{"id": 471845, "slug": "zetharis-m-version-demo", "name": "Zetharis [M. Version DEMO]", "name_original": "Zetharis [M. Version DEMO]", "description": "<p><strong>[The patreon page is having a reconstruction. Sorry. For now all the billings will be paused, and I highly reccomend you to NOT pledge until I figure it out. Thanks.]</strong></p>\n\n\n<p><strong><em>T</em><em>HIS PAGE IS FOR THE DEMO VERSION OF THE GAME. IF YOU ARE LOOKING FOR NEWER VERSIONS WITH NEW CONTENT/FEATURES </em></strong><strong><em>THAT ARE UNSTABLE, CHECK:<br/></em></strong></p>\n<p>\r\nhttps://scaryscary.itch.io/zetharis-dev-ver</p>\n<p>This is  M (Mature) version of the game. The only difference compared to the AO version, is the lack of adult scenes, the rest is the same.</p>\n<p>Also this project is made by one guy, so... Expect issues?\r\n</p>\n<p><strong><em>(Maybe in the future if that project goes somewhere I'll be able to hire artists and musicians to help me with that... But who knows. )\r\n</em></strong></p>\n\n<p><strong><em>The story is simple.</em></strong></p>\n<p><em><em>You are an otherworlder, summoned into this world.</em></em></p>\n<p><em><em>You are alone.  You have no one to rely on, and </em><em> you have no other</em><em> choice, but to survive.</em></em></p>\n<p><em><em>You have no idea who sent you there, or how you got there either.</em> </em></p>\n<p><em><em>It is up to you, on how you will shape your fate.</em></em></p>\n\n<p>Hello!\r\n</p>\n<p><em><em>Zetharis is a game that was inspired by various games, text adventures and JRPG games, mainly Shin Megami Tensei.</em></em><br/><em><em>It features <strong>(Or will feature, the game is still in developement)</strong>:\r\n</em></em></p>\n\n\n\n\n<em><em>\n<p>-A unique combat system similar to press turn(Mainline SMT), where combat can take from a few seconds to a few minutes, depending on your skill and how well can you handle the encounters.\r\n</p>\n<p>-Open world that you can choose to explore in your own way.\r\n</p>\n<p>-Companions with their own unique stories and personalities.</p>\n<p>-Classic dungeon crawling gameplay. (Well. A little bit of it. Sorry, cutting corners to release something is better than developement hell!)\r\n</p>\n<p>-Branching dialogue paths. (Or well. An attempt at having that.)<br/></p>\n<p><em>The game is available for PC (Windows, Linux builds might be coming later.) and Android devices, and it's free, there are no microtransactions, ads or tracking either.\r\n</em></p>\n<em>\n<p>Please enjoy!\r\n</p>\n</em></em></em>\n\n\n\n<p><em><em><em><strong><em>System Requirements</em></strong>: (Subject to change.)\r\n</em></em></em></p>\n\n\n\n\n<em><em><em>\n<p>PC <strong>minimum </strong>requirements:</p>\n<p><strong>MONITOR</strong>: A monitor with a resolution of 1280 x 720 at the minimum, ultrawide is supported. 4:3 is not.</p>\n<p><strong>RAM</strong>: At least 2GB of Ram.</p>\n<p><strong>OS</strong>: Windows 10 was the one I tested it on. It working on windows lower than 10 is currently unknown. </p>\n<p><strong>Hard Drive:</strong> At least 512MB of Free Space.</p>\n<p><strong>GPU</strong>: Anything with at least 1-2GB of VRAM would do the trick. Modern iGPUs should work without a problem.\r\n</p>\n<p><strong>CPU</strong>: Any quad core CPU with a speed of at least 2.8GHZ should be fine.\r\n</p>\n<p><strong>Internet connection</strong>: Not required. The game is always offline.</p>\n<em>\n<p>Phone <strong>minimum </strong>requirements: (Subject to change.)\r\n</p>\n<p><strong>DISPLAY</strong>: A display with the resolution of at least 1280 x 720p, ultrawide is supported, 4:3 is not. IPS or LCD display is reccomended.  (5.5-6+ inch device is reccomended.)\r\n</p>\n<p><strong>RAM</strong>: At least 2GB of Ram.</p>\n<p><strong>OS</strong>: Android 6+ is reccomended. Currently there are no plans to make an IOS version, not to mention I don't have a device to test it on.</p>\n<p><strong>Free Space</strong>: At least 512MB of Free Space.</p>\n<p><strong>GPU</strong>: Currently minimum is unknown, please report the performance on lower end devices if possible. Tested on a device with Adreno 640.</p>\n<p><strong>CPU</strong>: Currently minimum is unknown, please report the performance on lower end devices if possible. Tested on a device with Snapdragon 855.</p>\n<p><strong>Internet connection</strong>: Not required. The game is always offline.</p>\n<p><em>Found a bug or perhaps my terrible grammar that needs fixing? </em></p>\n<em>\n<p>Send the screenshot and reproduction steps to my email at scaryscarydeveloper@gmail.com, and I'll do my best to fix it.</p>\n</em></em></em>\n</em></em>", "metacritic": null, "released": "2020-06-30", "tba": false, "updated": "2020-07-24T05:17:00", "background_image": "https://media.rawg.io/media/screenshots/04e/04ef4983da29715e42cc72367e5074fd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Android"], "developers": ["ScaryScary"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}