{"id": 471870, "slug": "the-shore-demo", "name": "THE SHORE -demo", "name_original": "THE SHORE -demo", "description": "<p>TO support this game please follow this link https://www.ulule.com/the-shore-game/<br/><br/></p>\n<p>THE SHORE is a game that focuses on the mystery of the unknown on a forbidden island with horror elements. The whole story is based on mythology that goes deep through Lovecraft’s creations and beyond. The players will see the story from eyes of a Father who lost his lovely daughter and will experience the world through immersive atmospheric gameplay while trying to encounter the most nightmarish Lovecraftian entities, survive and to solve mind blowing puzzles all that to save his daughters life while being haunted; try to survive and uncover the secrets behind the mystery of his own sanity.</p>\n<p>Presented with a Lovecraftian style, As players dive deeper and deeper into the mystery, they’ll face overwhelming odds, Andrew's moments that will make you question his sanity, and a series of slow burn scenes. It’s only by mastering the artifacts of the old gods combat mechanic that they can stay one step ahead of the darkness that tries to swallow the world of his, but will that be enough? <br/>With the ghost of an action/mystery/horror play style and the mind of a psychological thriller, The shore's dramatic atmosphere, deep and multilayered story, and exceptionally tense,horrific, combat sequences provide players with an overwhelming and stunning gaming experience.</p>\n\n<p><em> <strong>KEY FEATURES</strong> </em></p>\n<p><em>•Stunning art design.</em></p>\n\n<p><em>• Immersive exploration experience .</em></p>\n\n<p><em>• Breathtaking enviroments, with every one of them a unique story to tell<em>.</em></em></p>\n\n\n\n\n\n<em><em>\n<p>• Challenging exploration, enter into unknown dimensions and come face to face with horrific entities that will try to stop you from gaining knowledge.</p>\n<p>• Chilling atmosphere and tension, what can a human do against the fear of the unknown.</p>\n</em></em>\n\n\n\n<p><em><em><em>• Main storyline and a lot of background plot to be discovered by players.</em></em></em></p>\n\n<p><em><em><em>• Self made story inspired by Lovecraftian Mythology.</em></em></em></p>", "metacritic": null, "released": "2020-07-21", "tba": false, "updated": "2020-07-24T05:23:04", "background_image": "https://media.rawg.io/media/screenshots/3fd/3fd69474e17eb25ad6b325dfc13b4d86.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "beaten": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 354, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["THE SHORE"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}