{"id": 471929, "slug": "the-path-we-take-pixelart-games-academy", "name": "The Path We Take (PixelArt Games Academy)", "name_original": "The Path We Take (PixelArt Games Academy)", "description": "<p>This game was made during GEC 2016's Game Impact Jam and theme of the jam was \"Peace\".</p>\n<p>The Path We Take is a first-person, psychological game that starts players in an unfamiliar environment, where a strange voice determines their fate through a series of questions.</p>\n<p>The game takes a more abstract approach to the theme of Peace, not blatantly laying out its core till the very end. You wake up in an unfamiliar room, alone and confused. As you do, a voice noticed that you have awaken and introduces itself, telling you that it will ask you a few questions as you progress through the facility. Once done, the voice asks you to go through one of the two doors in the room. At this point, you can choose to follow the voices directions, or choose the opposite. Depending on your choice, one of the two doors open up, allowing you to move towards the next room and be presented with another two doors. The voice again asks a question, this time something vague and metaphorical, and one of the two doors open again depending upon the answer you give. This continues till the voices is satisfied and states that your fate has been decided. The final door opens, and you are greeted by the results of your choices made in the facility.\r\nYou can either be greeted by a good end or a bad end.</p>", "metacritic": null, "released": "2020-07-21", "tba": false, "updated": "2020-07-24T05:34:58", "background_image": "https://media.rawg.io/media/screenshots/3e9/3e9c580f22c0a2ddf890fa0926eb9681.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 61, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["PixelArt Games Academy"], "genres": [], "publishers": [], "esrb_rating": null}