{"id": 471936, "slug": "stranded-2-drm-free-version", "name": "Stranded 2 - DRM Free Version", "name_original": "Stranded 2 - DRM Free Version", "description": "<p>Welcome to Stranded 2, the 2nd text-adventure from JimJams Games.</p>\n<p>Stranded 2 is a long awaited sequel to our lead developers highly rated ZX-Spectrum adventure Stranded, originally published back in 1991 by Zenobi Software. We've include an emulated version of that game, so you can see where it all began.</p>\n<p>The game is fully playable to completion, but is being released as early access and history has taught us that we will want to make changes and updates to the game. It may contain a few typos we've missed, so please let us know if you encounter any issues.</p>\n<p>Above all, enjoy the games.</p>\n<p>The JimJams Games team.<br/></p>\n<p><strong>STRANDED 2<br/></strong></p>\n<p>Following a not highly unexpected crash landing (which seems to happen to you a lot), you find yourself stranded on a hostile alien world full of humour, mystery and quite a bit of walking - Your task is clear, find a way off of this planet and get home. - Should be simple!<br/></p>\n<p>As a text-adventure, you will control your actions and that of other characters, not with single keypresses or controllers, but through typed English sentences, In  <strong>Stranded 2,</strong> you'll solve puzzles, and mysteries, through the manipulation of a host of objects, exploration and interaction with others you'll meet along the way.<br/><br/><strong>Features</strong>.<br/><br/>Advanced language parsing.<br/>Numerous and entertaining text-based puzzles.<br/>A rich, and in-depth world, full of mystery.<br/>Many hours of game-play.<br/>Full English language manual to help you get started.<br/>A true taste of classic gaming.</p>\n<p>INCLUDES STRANDED - The original ZX SPECTRUM game.<br/></p>", "metacritic": null, "released": "2020-07-21", "tba": false, "updated": "2020-07-24T05:36:34", "background_image": "https://media.rawg.io/media/screenshots/642/6421eb7015fdf002181d092bdbe6b3a4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 94, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["JimJamsGames"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}