{"id": 472058, "slug": "rain-on-your-parade-prologue", "name": "Rain on Your Parade Prologue", "name_original": "Rain on Your Parade Prologue", "description": "<p><strong>Rain on Your Parade Prologue is an early build of our upcoming slapstick comedy game where you play as a mischievous cloud determined to ruin everybody's day. Play across a wide range of levels while unlocking new abilities and mechanics that get progressively more ridiculous.</strong><br/></p>\n<p>Travel across the world, inventing new ways of causing chaos and mayhem. Turn the perfectly dry and sunny wedding day into a wet one, unleash thunder and lightning upon the cities, bring pandemonium to supermarket shoppers, destroy farmer’s crops, sneak around military bases and rain down meteors on dinosaurs! Yes, not even the dinosaurs are safe!</p>\n\n<p>As you progress in the game you will unlock new and more comical methods of causing bedlam. Use thunder and lightning to scare people out of hiding and set things alight, tornadoes to suck up everything that gets in its path, rain explosive material that you can blow up and even entire meteors and much more.<br/><br/></p>\n\n\n<ul><li>Ruin peoples day with rain, thunder, lightning, tornadoes and many more abilities.</li><li>Travel the world in over 40 levels causing disorder and havoc to weddings, cities, farms, military bases, parking lots and much more.</li><li>Give the mischievous cloud your personal touches. Draw a unique face and choose the hat it wears.</li><li>An upbeat and silly soundtrack that encapsulates the nature of the game.</li></ul>\n\n\n\n<p><strong>If you're a fan of <em>Untitled Goose Game</em> or <em>Donut County</em>, this will be right up your alley!</strong><br/></p>", "metacritic": null, "released": "2020-07-20", "tba": false, "updated": "2020-07-24T06:03:49", "background_image": "https://media.rawg.io/media/screenshots/3e0/3e06c07cabe9e7389b6fb8b28daa8f5e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 347, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Unbound Creations"], "genres": ["Adventure", "Simulation", "Puzzle"], "publishers": [], "esrb_rating": null}