{"id": 47209, "slug": "the-little-prince-vr", "name": "The Little Prince VR", "name_original": "The Little Prince VR", "description": "\"It is only with the heart that one can see truly\"<br/>The Little Prince VR is an interactive adventure that follows the events of Antoine de Saint-Exupery's masterpiece. <br/><br/>Virtual Reality allows the players to immerse into Saint-Exupery's creation, interact with the world and its characters like never before.They become both spectators and actors of the adventure, getting touched by its grace at a deep emotional level.<br/><br/>The Player escorts the Little Prince, in his discovery journey, from planet to planet. Each episode centers on a planet and a key character from the book. Help them solve their problems and learn something about grown-ups, and life in general; as each new encounter is an allegory of human nature.In the first episode: The Players team up with the Little Prince and the fox, as they are preparing to start a new discovery journey. A unique, VR native, mechanic allows players to assemble 3D objects that will help them progress through the adventure.<br/><br/>The players will help the Little Prince in his daily routine: clean the volcanoes, dig out baobab seeds, and take care of the Rose. <br/>After rebuilding a broken plane, the players will take the commands and fly the Little Prince from planet to planet.About the Little Prince<br/>The Little Prince is the most famous work of French aristocrat, writer, poet, and pioneering aviator Antoine de Saint-Exupéry. <br/>Since its first publication in 1943 the novella sold over 140 Million copies, making it the #4 best selling book ever published.<br/>With 300 official translations, it is the most translated fiction ever published. Over 2 Million copies are still sold every year.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:04:26", "background_image": "https://media.rawg.io/media/screenshots/7c0/7c01762b666e0bd08765f189ea8c21a7.jpg", "website": "http://www.thelittleprinceVR.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 390, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Red Accent Studios"], "genres": ["Adventure", "Casual"], "publishers": ["Red Accent Studios"], "esrb_rating": null}