{"id": 472341, "slug": "betrivers-sportsbook-illinois", "name": "BetRivers Sportsbook Illinois", "name_original": "BetRivers Sportsbook Illinois", "description": "Operated by the largest casino in the state of Illinois, place a bet with the award-winning BetRivers sportsbook, a brand you can trust!  To start betting, just Download the FREE sportsbetting BetRivers app and create your mobile account. The final step, which is required by Illinois law, is to validate your location, one-time only, by visiting Rivers Casino Des Plaines (which is centrally located just steps from Chicago O’Hare airport and minutes from downtown Chicago. To make the required validation process as seamless as possible, once you arrive outside of Rivers Casino, we’ve enabled you to validate your location from the safety of your car using our extended wifi network at the property (no interaction with people or kiosks is needed). After that, you’re good to bet on your favorite sports from anywhere in Illinois. <br/>Safe, legal and licensed by the state of Illinois, BetRivers sportsbook offers a massive number of real-money betting options: moneylines, point spreads, player props, futures and more. BetRivers offers live streaming of a huge variety of sporting events; you can bet on the game while you watch it! With our real-money sports betting app, you can bet easily, from anywhere you want in Illinois. Download now and enjoy the thrills of betting on:- Football – NFL and NCAA games and futures<br/> - Basketball – NBA and NCAA games and futures<br/> - Tennis – all live, in-game bets pro bettors crave<br/> - Golf – pro futures, player props and round-by-round betting<br/> - MMA – all the major fights from UFC and their undercards<br/> - Soccer – bet on all the top leagues from around the world such as English Premiere League and Champions League<br/> - Baseball, Hockey, Auto Racing, Boxing and much, much more! We don't stop there. At BetRivers, we believe the customer comes first. We value our players and are committed to delivering the best sports-betting experience and customer service around. With the trustworthy Betrivers Sportsbook app, your transactions are always safe and secure, and when you win, we pay fast. That means you can bet with confidence, 24/7.As a player with BetRivers, you'll be able to take advantage of all we have to offer:- Daily Specials and Odds Boosts – Curated by out expert staff, we make the bets and offer the boosts that give you plus-money bets you'll want to grab daily.<br/> - 24/7 Customer Support – Our expert customer support team is there to answer your questions, all-day and all-night.<br/> - Amazing live, in-game betting and live streaming – our premiere live betting service brings the action to life and our live-streaming turns your smartphone into a sports lounge.<br/> - Fast Payouts – Most bets are settled immediately and available for quick turnaround. We’ll even enable you to cash-out your wins at the cage at Rivers Casino.<br/> - Fast, easy registration – In most cases, registrations are approved immediately. The BetRivers services is run by Rush Street Interactive, an affiliate of Rivers Casino in Des Plaines, which is a leading real-money sportsbook operator in many other states across the United States such as IN, PA, NY and CO. EGR monthly recently named Rush Street Interactive as a top-3 online/sportsbook operator in the US. Download BetRivers today! BetRivers is licensed by the state of Illinois. We believe in responsible gaming, and integrity is our first priority. If you or someone you know has a gambling problem, call 1-800-Gambler. Must be 21+ and present in the state of Illinois. Additional terms and conditions apply", "metacritic": null, "released": "2020-06-30", "tba": false, "updated": "2020-07-27T02:16:03", "background_image": "https://media.rawg.io/media/screenshots/0ee/0ee1c0510e557bd076cd787689365865.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 120, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Rush Street Interactive"], "genres": ["Sports"], "publishers": ["Rush Street Interactive"], "esrb_rating": "Mature"}