{"id": 472338, "slug": "good-sudoku-by-zach-gage", "name": "Good Sudoku by Zach Gage", "name_original": "Good Sudoku by Zach Gage", "description": "You’ve never played Sudoku like this.<br/><br/>Good Sudoku turns your iOS device into an AI powered Sudoku genius whose only mission is to help you learn and love this classic game.<br/><br/>Whether you’ve never tried Sudoku, or you play every day, Good Sudoku’s elegant layout, intelligent hint system, and busywork reducing tweaks will help you play better and have more fun.<br/><br/>- Over 70,000 of the highest quality puzzles you’ll see anywhere<br/>- Optional tools to reduce busywork<br/>- AI powered hint support to continuously boost your skills<br/>- 3 standard modes: Good, Arcade, and Eternal<br/>- 3 Daily puzzle modes that get harder throughout the week + global leaderboards<br/>- 5 levels of difficulty<br/>- Import your own puzzles from elsewhere in Custom mode (and share them with friends!)<br/><br/>---<br/><br/>We put everything we could into making the best digital Sudoku game ever released:<br/><br/>- We wrote a puzzle generator from scratch to create over 70,000 of the highest quality puzzles you’ll see anywhere. We spent weeks figuring out how to generate intricate and complex puzzles you won’t find in other Sudoku apps. Our hardest puzzles require wild techniques like “XYZ Wings”, “Hidden Quadrouples”, “Jellyfish”, and “Swordfish”.<br/><br/>- Most people don’t know this but Sudoku puzzles are actually generated by programatic Sudoku solvers. The fastest way to know how hard your puzzle is, or if it’s valid, is to write a solver that knows all the strategies that can try it. With Good Sudoku, we run our solver as you are playing, so if you get stuck, it can detect what you know by looking at your answers and your notes, and then help you find the next technique you need to solve the puzzle.<br/><br/>- Most Sudoku games classify difficulty into vague Easy, Medium, and Hard difficulties — But what do these difficulties mean? Typically they refer to the kinds of solving techniques that are required to solve a given puzzle without resorting to guess-and-check. In Good Sudoku we aren’t vague about it at all. We lay out exactly which techniques are required for each difficulty level. Good Sudoku allows you to practice them individually outside of puzzles, and keeps track of which ones you’ve learned!<br/><br/>- When we first got interested in Sudoku we noticed that a lot of players spend most of their time looking at the board and counting. On easy puzzles, this counting serves as a way to increase the difficulty by making the puzzle take longer. We know some sudoku players love the counting but we found it a bit tedious and designed some tools to alleviate the busywork. At first these tools might feel a bit like cheating, but once your mind is freed up from counting you’ll have space to see the much deeper more fascinating side of Sudoku: all of the beautiful technique structures. Freed from the burden of busywork Sudoku becomes one of the best search-style games we’ve ever played. More fun than word-searches and solitaire, high-level Sudoku is a real treat — and with Good Sudoku and a little practice, anyone can learn it!<br/><br/>- We noticed when looking at other Sudoku apps although there are often daily puzzle modes, those modes never include global leaderboards. Weird! Good Sudoku remedies this problem!<br/><br/>- We wanted to make the best Sudoku out there, and while we’re proud of our puzzles, we recognize that puzzles come from all places. That’s why we built a quick and easy custom puzzle mode into Good Sudoku, so if you have a paper puzzle that you’re stuck on, or you’re trying some wild variant (Like the Miracle Sudoku!) it’s easy to put it into the game, play it, and share it with your friends. If the puzzle follows standard Sudoku rules, our hint system will even help you get unstuck!<br/><br/>We truly hope Good Sudoku can introduce you to, or deepen your love for this great game.<br/><br/>-Zach and Jack", "metacritic": null, "released": "2020-07-22", "tba": false, "updated": "2020-07-27T02:15:01", "background_image": "https://media.rawg.io/media/screenshots/a70/a708f3b17ba97ab7fb22622fc6881fb4_GDdZcvr.jpg", "website": "http://www.playgoodsudoku.com/presskit", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 80, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Zach Gage"], "genres": ["Strategy", "Puzzle"], "publishers": ["STFJ"], "esrb_rating": "Everyone 10+"}