{"id": 472352, "slug": "kitchen-scramble-2-world-cook", "name": "Kitchen Scramble 2: World Cook", "name_original": "Kitchen Scramble 2: World Cook", "description": "Join chef Pepper and embark on a culinary journey that spans the globe. Prepare mouthwatering entrées, desserts, and sides and serve them to quirky customers in your personal upgradable food truck. Earn tons of tips for quick service, then upgrade ingredients and appliances to build the ultimate kitchen on wheels!<br/><br/>Challenge your time-management skills in this highly addictive game! Dash around kitchen environments crafted specifically for each famous cuisine. Enjoy an endless cooking journey as you travel the world. Become a food truck tycoon and master the delicious dishes in high demand by your adoring customers.<br/><br/>The Rundown:<br/>• Cook dozens of delectable dishes from simple street food to haute cuisine!<br/>• Upgrade your food truck and unlock new ingredients and appliances!<br/>• Serve tons of quirky customers — but don’t make them wait!<br/>• Combine items in new and unexpected ways to make even crazier recipes!<br/>• Prepare and serve local delicacies from all over the world!<br/>• Win huge rewards and cook your way to the top!<br/><br/>Serve Fantastic Food Anywhere, Anytime<br/>• Free to download and play<br/><br/>Discover Interesting Foods From Around The World<br/>• Cook up real recipes with the proper ingredients and methods<br/>• Upgrade your ingredients and appliances to make your dishes even tastier!<br/>• Thousands of upgrade combinations for deep customization<br/>• Expertly simplified for everyone to enjoy! <br/><br/>Cook &amp; Travel<br/>• Take your food truck on a road trip across numerous locations<br/>• Each location features its own unique cuisine<br/>• Master each local specialty as you progress!<br/><br/>Fun &amp; Impactful Power-Ups<br/>• Cook at lightning speeds<br/>• Double your earnings from satisfied customers<br/>• Never burn your food again with a handy fire extinguisher<br/>• Hundreds of levels and counting<br/><br/>Cook Amazing Food<br/>• Chick'N'Stuff: Fried Chicken Sandwich, Grilled Chicken Sandwich, Fries, Mozzarella Sticks, Stuffed Peppers, Salad, Grilled Corn<br/>• Bun Noodles: Miso Soup, Green Tea, Pork Belly Udon, Torched Eel, Vegan Yakiudon, Fried Gyoza<br/>• Gyro Hero: Greek Salad, Tapenade, Souvlaki, Pilaf, Dolmades, Spanakopita, Moussaka, Baklava, Tahini<br/><br/>Bonus Levels<br/>• Unlock bonus levels in each location by completing the levels in Chick'N'Stuff location<br/>• A challenging, additional level is unlocked with every locked gate cleared!<br/>• Chance to play to these difficult levels is refreshed every 12 hours<br/>• Complete the chef worthy levels to earn more rewards!<br/><br/>Look Forward To<br/>• Getting substantial rewards from checking in daily<br/>• Achievements and rewards for cooking up a storm!<br/>• Regular free updates!<br/><br/>Coming Soon<br/>• More Events<br/>• Exotic cuisine themed levels and locations<br/>• Game improvements", "metacritic": null, "released": "2019-10-24", "tba": false, "updated": "2020-07-27T02:19:34", "background_image": "https://media.rawg.io/media/screenshots/d1d/d1d0f744d87d62ab66e53b0b31471a6c_6P1jLgX.jpg", "website": "https://popreach.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 222, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["PopReach"], "genres": ["Strategy", "Casual"], "publishers": ["PopReach"], "esrb_rating": "Everyone 10+"}