{"id": 472336, "slug": "tap-galaxy", "name": "Tap Galaxy!", "name_original": "Tap Galaxy!", "description": "Take a thrilling ride through space and visit strange alien star systems and black holes. Find out where our Sun - the Solar System - is located in the Milky Way galaxy, and more…<br/><br/>IDLE FUN GAME<br/>◉ Easy-to-play and easy to gain<br/>◉ Build your own galaxy<br/>◉ Amazing animations and 3D graphics<br/>◉ Four galaxy can be explored <br/>◉ Boost your economy in a short time<br/>◉ Collect gold even when you're offline!Highly addictive!<br/><br/>Explore space and get a little closer to our wonderful universe with this awesome game！Download it now for free and build lots of cores and layers in your universe that produce idle income!<br/><br/>----------------------------------------------------------------<br/>SUBSCRIPTION TERMS<br/><br/>Subscription options for Tap Galaxy:<br/>We have the following subscription periods in our game:<br/><br/>-Weekly Vip Access offers weekly subscription for $2.99 which provides 150 diamonds, 5 Free Rewarded Videos per day, and removing annoying Interstitial Ads.<br/><br/>-Monthly Vip Access offers monthly subscription for $9.99 which provides 250 diamonds, 10 Free Rewarded Videos per day, and removing annoying Interstitial Ads.<br/><br/>End of trial and subscription renewal<br/><br/>This price is established for United States customers. Pricing in other countries may vary and actual charges may be converted to your local currency depending on the country of residence.<br/><br/>Payment will be charged to your iTunes Account at confirmation of purchase.<br/><br/>Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period.<br/><br/>Account will be charged for renewal within 24-hours prior to the end of the current period, and identify the cost of the renewal.<br/><br/>Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user’s Account Settings after purchase.<br/><br/>Canceling trial or subscription<br/><br/>You can turn off the auto-renew for the subscription whenever you want to through iTunes. Check https://support.apple.com/HT202039 . When your current trial/subscription period expires, you will be unsubscribed. The current active subscription period can not be canceled. When your subscription expires, you will no longer be able to use elements included in Subscription option.<br/><br/>\u2028\u2028For more information, please visit https://support.apple.com/HT207865<br/>\u2028If you have any question, feel free to contact us at support sameowfei@gmail.com<br/><br/>Privacy Policy: https://docs.google.com/document/d/1ANJZSBkSSMe64cl9BE5vxlFRG6h0NhS4jzf_3ZVLyY0/edit?usp=sharing<br/>Terms of Use: https://docs.google.com/document/d/1lHx1kGLJViKfV_BHxi_UZi0c4HvFKVi-Xr-0Y-EyyIE/edit?usp=sharing", "metacritic": null, "released": "2020-05-22", "tba": false, "updated": "2020-07-27T02:14:22", "background_image": "https://media.rawg.io/media/screenshots/aa3/aa30fe35f184820dfa9c546ecd71cb66_BCaVzZk.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 33, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ziliang Wang"], "genres": ["Simulation", "Casual"], "publishers": ["Ziliang Wang"], "esrb_rating": "Everyone 10+"}