{"id": 47245, "slug": "unworded", "name": "unWorded", "name_original": "unWorded", "description": "<strong>unWorded </strong>is an innovative Narrative Puzzle Game where everything is built from letters. Use your imagination to create objects by assembling letters together and discover the story of a writer hospitalized after a serious accident...<br/><br/>Dive into his damaged mind and experience his inner creative world through strange and wondrous tales. Help the writer reassemble his memory and thoughts in this narrative text-based puzzler. Think outside of the box, drag letters and signs around on the canvas to form pictures worth thousand words. Divided into five books tracing back the author memories, Unworded is a unique, emotionally-engaging and story-driven indie masterpiece that appeals to the inner workings of human complex minds with its poetic and dreamlike puzzles full of letters.Artistic statementunWorded is born from a profound love for typography. Letters not only convey meaning but can also bring a strong sense of space. We asked ourselves if we could build an entire world out of simple letters? How would it look like? What feeling would we get, if we were to immerse ourselves in such an universe?! With that came along the desire to dive into a writer's head and his thoughts, to see how memories form themselves to bubble up to the conscient mind. We finally chose a very simple but engaging gameplay experience, assembling letters to create objects, each one triggering an important memory of the author. One key aspect for us was the intimacy the player would experience with the writer, actively participating in his introspection. <br/><br/>We really wanted to tell a story about feelings and thoughts through unWorded. The game deals with the subject of grief, it is something we all have to go through but that not easy to discuss. The player would have to live each phase of grief along with the author: shock and denial, anger, bargaining, depression, acceptance. The unWorded story is about a children's book writer, who was just hospitalized after a serious accident. As his wife at his bedside reads to him fairy tales of his own creations, you dive into his mind, sharing his last thoughts as he reminisces about his life and past works, standing with him at the death's door!The unWorded teamBento has been making mobile games since 2010. Based in Lyon, the team is made of two passionate individuals who were brought together by a common project: making original and creative games. Benoit breathes life in the games, making art, sounds and musics, while Séverin gets the engine running with his programming. With unWorded the Bento team accomplishes their long-awaited dream of doing a narrative game conveying a truly meaningfull story!", "metacritic": null, "released": "2016-11-17", "tba": false, "updated": "2020-10-26T03:09:38", "background_image": "https://media.rawg.io/media/screenshots/80c/80c6403d0c75b805e9306790b1b48e97.jpg", "website": "http://www.bento-studio.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 13, "beaten": 1}, "playtime": 2, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 41, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS", "macOS", "PC", "Android"], "developers": ["Playdigious", "Bento Studio", "Bento"], "genres": ["Adventure", "Indie", "Puzzle"], "publishers": ["Plug In Digital", "Bento"], "esrb_rating": null}