{"id": 472727, "slug": "chroma-shift-itch", "name": "Chroma Shift (itch)", "name_original": "Chroma Shift (itch)", "description": "<p>Here is my first ever Game Jam project.</p>\n<p>This took a fair amount of work as I had to learn Unity 2D and I'm barely knowledgeable in C#</p>\n<p>Gameplay:<br/></p>\n<p>Platform your way to the other side. You can only interact with platforms that are the same colour as you, so you have to <strong>change</strong> (<em>as in the theme :D) </em>colours to beat the levels.</p>\n<p>Controls:</p>\n<p>A &amp; D: Movement</p>\n<p>Space Bar: Jump</p>\n<p>Left Click: Attach a grapple hook to the selected platform</p>\n<p>Right Click: Change colour</p>\n<p>There isn't that many levels and the game can be quite buggy. This is more a concept game as I really like this game idea and would like to evolve it to something else in the future.</p>\n<p>Please comment on how I did! It's my first ever game really, so I know it isn't that good. But I had a lot of fun making it and would love any feedback.</p>\n<p>(I'm aware that the grapple line isn't working for the blue colour. I don't know at this moment how to fix it, nor do I have the time to figure out how so it'll just be a happy accident :P)</p>\n<p>Huge shout out to Ethan Ast, who did the music for this project, Flow State. He's a dude I personally know so this was done as a favour. If you want some good music for your game or project, feel free to hit him up for one of his tracks or a custom track at his Instagram (@ethansspace). </p>\n<p>Thanks!</p>", "metacritic": null, "released": "2020-07-26", "tba": false, "updated": "2020-07-27T03:36:11", "background_image": "https://media.rawg.io/media/screenshots/89d/89d649cd51d372438f2677334c2ca463.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["MatthewTofu"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}