{"id": 472777, "slug": "dungeons-of-wrath-and-mana", "name": "Dungeons of Wrath and Mana", "name_original": "Dungeons of Wrath and Mana", "description": "<p>Dungeons of Wrath and Mana - or DOWAM for short - is a fast paced roguelike that sees you teleport to themed dungeons, where you must hunt for equipment to fully customize your character's abilities. Equip unique weapons, ranging from bows &amp; arrows to high tech plasma rifles, to magic rings that let you summon lightning from the sky... and everything in between! (Including bacon)</p>\n<p>Download links are at the bottom of the page</p>\r\nThe Creators\r\n<p>DOWAM was made in 2018 for the Australian STEM Video Game Challenge, a national competition for high school students. We're a team of 3; I was joined by Callum McNeilage and Thomas Gabbie, who did Music and Design, respectively.</p>\r\nCallum M.\r\n<p>Callum is the mastermind of the game's soundtrack. All of the in game music was composed by him, using Musescore.</p>\n<p>Track list:</p>\n<ul><li>DOWAM Main Theme</li><li>Wasteland Home Base</li><li>Ice Dungeon</li><li>Snowy Home Base</li><li>Fire Dungeon</li><li>Paradise Home Base</li></ul>\n<p>You can find Callum's other projects and more at his personal website:<br/></p>\n<p>www.callummcneilage.me<br/></p>\r\nThomas G.\r\n<p>Thomas is the lead game designer, creating levels, weapons and enemies, and also helping out other roles like art. </p>\r\nLucas M.\r\n<p>That's me! I'm the group leader. I did all of the programming and some art, as well as dabbling in other roles like SFX &amp; Design. I've got some more recent projects, check out my profile on Itch!</p>\n<p>---</p>\n<p>As for the competition, we made it to the finalists but unfortunately did not win. Judges reasoning was that we did not adhere to the theme well enough, despite having one of the most polished, feature complete entry in the competition.</p>\n\r\nGameplay\r\n<p>You start off on the hub world, which evolves as you progress through the game. The hub world, named E'Tis, is where you go to between visits to the dungeon. It's a safe place to relax, where you can safely spend your gold at Fred the merchant.  It's designed to be a break from the action packed dungeon runs, so all evolutions of it have nice ambient sounds, with a great atmosphere - including a day and night cycle with colourful sunsets and sunrises.<br/></p>\n<p>[Image of sunrise]</p>\n<p>You can start a dungeon run by interacting with the teleporter, which lets you pick which dungeon to travel to. You'll need to unlock the fire dungeon by going deep into the ice dungeon (complete level 3). </p>\r\nDungeon Run\r\n<p>Each run sees you enter the dungeon with nothing but an old sword. You must quickly find yourself a better weapon, lest you get overrun by enemies! Luckily, there are heaps of weapons down there. At the beginning you'll mostly find grey and green tier loot, which will do for the first couple of levels. Keep pushing deeper to find rarer and more powerful (and way more fun) weapons! If you get stuck, don't sweat. As long as you get a bit of gold each run, you will slowly become more powerful. Or, you can get lucky and find a blue or purple weapon.</p>\n<p>The goal is to move right until you find the end teleporter, which will take you to the next level or back to home base if you unlocked something there. Along the way, you can collect items to customize your character's load out to suit your play style!</p>\r\nYour Abilities\r\n<p>You have five ability slots, bound to left click, right click, Q, E, and R. You can equip any item in any slot, but generally it's a good idea to have some primary weapons on your mouse buttons, and more situational weapons &amp; items in the other slots.</p>\n<p>Each weapon costs some mana to use. You need to balance using weapons vs keeping a good supply of mana! Mana regenerates by itself over time, and regens faster the longer you don't use it. You can also pick up purple mana crystals dropped by enemies for an instant +10 mana. Mana crystals will also kick-start natural regeneration immediately, so pick them up at the right moment to maximize damage output!</p>\n<p>Some weapons have multiple fire modes, indicated by a white number showing which mode you are on, and how many exist on the weapon. To change modes, click on the diamond shaped icons at the top of your inventory.</p>\r\nThe Arsenal\r\n<p>There are a total of 11 unique weapons, with 15 abilities spread throughout them. If you include rarities, there are 25 different weapons. Below is a breakdown of all weapons and their abilities in the game:</p>\n<p><strong>Assault Rifle<br/></strong>Your standard high damage, single target weapon. If you find 2 gold Assault Rifles, you can dual-wield them for some ridiculous firepower!</p>\n<p><strong>Pistol<br/></strong>Weaker than the Assault Rifle, but can pierce enemies. Compliments the Assault Rifle well early game. You can dual-wield any rarity of pistol for much more stopping power. Blue pistol is not to be overlooked, it can be quite powerful in the right hands. Line up your enemies!<br/></p>\n<p><strong>Bow<br/></strong>Slow firing but high single target damage. Can even one-shot some goblins! Pick up a green bow to get a triple arrow burst, which can take down a couple of enemies with one burst.</p>\n<p><strong>Double Barrel Shotgun<br/></strong>Higher skilled weapon that rewards getting right in your enemies face! Point-blank shots are usually instakills.<br/>It's secondary fire mode shoots both barrels at the same time, a blast so powerful that it pierces through enemies and even knocks you back! Reload time and mana usage is quite high though, use wisely.</p>\n<p><strong>Book of Fire<br/></strong>A magical book that lets you summon fireballs! It's main fire mode shoots a powerful fireball with a large AOE blast. <br/>Switch to secondary fire for a piercing, bouncing fireball! Cast this into a small room and watch all the enemies inside get churned up in a raging inferno.</p>\n<p><strong>Magic Bow<br/></strong>This bow's arrows are awesome, they will pierce through enemies and bounce off them towards another enemy in sight! Chain enemies together for some Yondu tier arrow wizardry.<br/>The alternate fire mode casts a bouncy arrow. Each time the arrow bounces, it summons another arrow and fires it towards a nearby enemy. Use this in a tight space to obliterate enemies in a flurry of magic arrows!<br/></p>\n<p><strong>Plasma Rifle<br/></strong>A very powerful laser beam that deals heavy damage to all enemies caught in its path. It takes a while to cool down after each shot, save it for the perfect moment! Or, you know, quickscope a falling goblin. Up to you.<br/></p>\n<p><strong>Fire Bow<br/></strong>This rare bow captures the essence of the fire dungeon. It summons a flurry of exploding magical fire arrows which will incinerate anything you point it at. <br/></p>\n<p><strong>Lightning Ring<br/></strong>The ultimate panic button. Cast this weapon on a group of enemies, and watch as lightning falls from the sky to fry each and every enemy in range, one at a time. Always deals lethal damage.<br/></p>\n<p><strong>Big Bite<br/></strong>Nuke rocket launcher. Update me.</p>\n<p><strong>Sword<br/></strong>The humble starting sword will barely be able to fend of enemies, but can be useful in a pinch when you're out of mana. The legendary sword, on the other hand, is an absolute monster. Swords deal much more damage if you run into enemies while swinging, as the damage is scaled based on your relative velocity. If you manage to hit enemies hard enough... I'm going to let you see what happens. This surprise mechanic easily makes the legendary sword the most satisfying weapon in the entire game! And those skilled enough may even be able to pull it off with the starting sword. Give it a try!</p>", "metacritic": null, "released": "2020-07-26", "tba": false, "updated": "2020-07-27T03:46:17", "background_image": "https://media.rawg.io/media/screenshots/086/086e338a75f7c65ffa5b4baa29892030.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 190, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Maldonacho"], "genres": ["Action", "Platformer"], "publishers": [], "esrb_rating": null}