{"id": 47273, "slug": "paperville-panic", "name": "PAPERVILLE PANIC!", "name_original": "PAPERVILLE PANIC!", "description": "Welcome to Paperville, Rookie! As the fire departments newest recruit, you're in for a sweet ride at your new employment. Cheque cashing, boot sorting, lunch stealing - after all, in a town made of arts and crafts, how often would there ever be a fire?<br/><br/><br/>Paperville is proof that anyone has what it takes to be a hero, as long as safety and saving lives aren’t priorities. A tongue-in-cheek look into the world of firefighting, in a town filled with strange critters, odd personalities and secrets to discover.<br/><br/>Guided by a less-than-stellar fire department, you must help restore Paperville to it’s former papery glory. From clearing building fires, rescuing citizens from rubble, hacking through doors, to dealing with townsfolk and their personal issues, Rookie does it all. <br/><br/>Only you can be the one to save Paperville. <br/>Well, someone else probably could, but you’re all they’ve got.<br/><br/><br/><ul><li>Explore the living, breathing town, from beach to balcony to bedroom, and get to know the people of Paperville.</li></ul><ul><li>Save the townspeople from imminent danger - and from themselves.</li></ul><ul><li>Atmospheric music helps set the scene as you traverse smokey spaces filled with fire.</li></ul><ul><li>Use a number of different weapons to tackle the problems in front of you.</li></ul><ul><li>Shoot, smash, pull, deduce, and lift your way through missions to find the solution and be the hero Paperville never deserved.</li></ul><br/><br/><br/>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:04:24", "background_image": "https://media.rawg.io/media/screenshots/f3f/f3fecd4f51b31c1f488bf3b0bc59307c.jpg", "website": "http://www.papervillepanic.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 15, "owned": 147, "toplay": 1, "playing": 1}, "playtime": 1, "achievements_count": 8, "ratings_count": 1, "suggestions_count": 352, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Ultimerse"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Ultimerse"], "esrb_rating": null}