{"id": 47275, "slug": "cube-c-vr-game-collection", "name": "CUBE-C: VR Game Collection", "name_original": "CUBE-C: VR Game Collection", "description": "This is a Brand New, Fun, Casual VR Game! If your VR device is lying there for a long time, welcome to try CUBE-C, A game specially designed for VR.<br/>Although there is no exquisite realistic scene and longtime gameplay here, hope the new experience will make you satisfied! (VIVE only, more VR devices support will be updated)<br/><br/>CUBE-C include 3 mini-games:<br/><br/><ul><li>VR Cube World<br/></li><li>720° Racing<br/></li><li>Pile Up VR</li></ul><br/><strong>VR Cube World</strong><br/>Grab anything you can grab and throw it out, <br/>Destroy anything you can destroy, <br/>Everything will turn into CUBEs!<br/>Three character status (VR hand shape), three different weapons, including - Cube, Fireball and... Lightsaber!!! <br/>It may be a Children's paradise! <br/>If CUBE-C can get enough support, I will add more fun weapons (｀・ω・´) and make some brand new maps.<br/><br/><strong>720° Racing</strong><br/>Have you ever played a Mini 4WD?<br/>If you have, then you can now experience how to drive it.<br/>If you haven't, It's time to try(｡･ω･｡)!<br/>If CUBE-C can get enough support, I will add more fun car skins, maps and network battle mod (｀・ω・´).<br/><br/><strong>Pile Up VR</strong><br/>Play JENGA in a way you can't imagine(^・ω・^ )<br/>If CUBE-C can get enough support, I will add more fun maps (｀・ω・´).<br/><br/>CUBE-C will soon release a beta version, it includes <strong>VR Cube World</strong> only(momo will personally send closed test qualification).<br/><br/>Author Statement:<br/>This game is made by momo alone for nearly a year and is still in early states. I try to improve the VR game experience and make it in an open, dynamic, fun, simple way. But because this is a personal developed VR game, there may be a variety of defects, hope every player that participated in the early test of the game can give me advice, help me improve the game.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:04:24", "background_image": "https://media.rawg.io/media/screenshots/6fb/6fb4d0b111f2b192bded4a0af7b3fcce.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 96, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["momo"], "genres": ["Action", "Racing", "Casual", "Indie"], "publishers": ["momo"], "esrb_rating": null}