{"id": 472935, "slug": "soultide", "name": "SoulTide", "name_original": "SoulTide", "description": "SoulTide\r\n<p>SoulTide is a top-down<strong> RPG pixel brawler</strong> with hand-illustrated <strong>VN style storyline</strong> and lore.  <br/></p>\n<p>*note: windows defender MAY flag this download as unsafe. this is because SoulTide is an indie game with no assigned publisher or developer. the file is 100% safe, and zipped. to continue, you can click \"expand\" or \"run anyways\" for the .exe and download. if there are any issues, please reach out in the comments!</p>\n\n<p>3024. In a world where your digital souls live in the Nest - a virtualization of the planet, a Soulrouter implant in your brain is the only connection you have to physical life. But when an unknown force starts taking over these Soulrouters, \"souljacking\" people over the age of 21 and controlling their physical bodies, who's left to stop them? The souljacked adults have created a dictatorship, and the youth are the ones who suffer.<br/></p>\n<p>Enter the Merge. A white-hat hacker group of young adults and teenagers who have found out who (or what) is behind these Souljacking events. They're not strong enough to stop this, but they might know some people who are.... </p>\n\n<p>Hey there! Caz here, along with Nak and Muffy, we are the developers behind SoulTide!</p>\n<p>SoulTide is currently in development, and this current release on itch.io is our first prototype. This sequence includes the first 2 story scenes of the game, as well as a barebones game tutorial. Thank you in advance to everybody who plays this! If you would like to be considered for a playtester after playing this beta, please email: chiingzhang@gmail.com</p>\r\nCredits\r\n<p><strong>Story, Characters, Concept Illustration by: </strong></p>\n<p>chibbybnny (caz)</p>\n<p><strong>Pixel Animation and Pixel Art by: </strong></p>\n<p>nak (kuukaii) and caz </p>\n<p><strong>Developed by: </strong>nak, muffy</p>\n<p><strong>Special Thanks: </strong>Vic Piña, GGJ NEXT, Jose Rueda<br/></p>\n<p><strong>Playtesters: </strong>Kimmy, Alex<br/></p>\n<p>Sound Credits</p>\n<p>Coded in GameMaker Studio 2. Illustrations and pixel art/animation done in Procreate and Photoshop. Sprites and pixel art done in Aseprite. Demo video made using Adobe Premiere Pro 2020.</p>\r\nHow To Download\r\n<p>1. Download file</p>\n<p>2. Extract [choose location] or click \"Extract Here\" with winRAR</p>\n<p>3. Click on the SoulTide application to launch</p>\n<p>* Notes: for the beginning \"Enter the Nest?\" scene, press enter to continue, following that, cutscenes will be controlled by player input. </p>\n<p>*Another note: the transition timings between gameplay and cutscenes are being worked on, so we've included a screenshot of the controls in case you missed it!</p>", "metacritic": null, "released": "2020-07-25", "tba": false, "updated": "2020-07-27T04:19:22", "background_image": "https://media.rawg.io/media/screenshots/ffc/ffccec9663f15723b2941936c23fb4b2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 99, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Caz", "Gaming_Muffin", "nak", "hikineet"], "genres": ["Action", "RPG"], "publishers": [], "esrb_rating": null}