{"id": 472909, "slug": "black-laser", "name": "Black Laser", "name_original": "Black Laser", "description": "<p><strong>Black Laser</strong><br/>by <em>Kial Irvin and James Black</em></p>\n<p>This was our first game we have done together for My First Game Jam Summer 2020.<br/>https://itch.io/jam/my-first-game-jam-summer-2020</p>\n<p>Black Laser is based on an unpublished comic that Kial made awhile back that has the same name.<br/></p>\n<p><strong>Objective:</strong></p>\n<p> Calvin Black (that's you) was sent to Chernobyl to recover a purple crystal deep in one of the silos of a defunct Black Laser Research Facility.</p>\n\n<p><strong>NOTE:</strong> Use your Black Laser Rifle(BLR) to destroy obstacles that get in your way. But remember, the BLR can only melt through things if they are extremely well lit.<br/></p>\n<p><strong>Post Mortem:</strong></p>\n<p><em>What we learned</em></p>\n<ul><li>How to utilize the tools given to us instead of being stubborn and doing things our own way. For example, using prefabs instead redoing work.</li><li>How to project manage. How not to overwhelm yourself with too many tasks at once and just take things one at a time.</li><li>What works in our mind doesn't always work in practice.</li><li>More familiar with the what the process is to finish a game, like implementing the end credits, end scenarios, etc.</li></ul>\n<p><em>What went right</em></p>\n<ul><li>The gradual increase in puzzle design</li><li>The look and feel of the Black Laser Device and pistol</li><li>Good communication between us to keep the flow of the project steady</li></ul>\n<p><em>What went wrong</em></p>\n<ul><li>We wanted an enemy to use the pistol on</li><li> Lack of textures in the main facility</li><li>We wanted proper feedback on if objects are breaking or not by the laser. The perfect solution would be voxels but we thought the scope of that would be too much</li></ul>", "metacritic": null, "released": "2020-07-25", "tba": false, "updated": "2020-07-27T04:14:12", "background_image": "https://media.rawg.io/media/screenshots/9b7/9b79d65db1294f89002e78070f90b7ee.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 76, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Singulo"], "genres": ["Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}