{"id": 473029, "slug": "soluto", "name": "Soluto", "name_original": "Soluto", "description": "<p>Sejam bem-vindos à exposição <strong>Soluto</strong> do artista visual <strong>Fabio Rocha </strong> com curadoria de <strong>Flávio Carvalho</strong> e narração de <strong>Fernanda Maldonado</strong>.</p>\n<p><strong>Instruções  </strong><strong>W</strong> (frente) / <strong>A</strong> (esquerda / <strong>S</strong> (trás) / <strong>D</strong> (direita) / <strong>Espaço</strong> (pular) / <strong>Mouse</strong> (visão)</p>\n<p>Aperte <strong>ENTER</strong> para iniciar dentro da exposição. Se você ficar preso no espaço aperte <strong>ENTER</strong> mais uma vez.</p>\n<p><strong>Obs</strong> Quando o jogador se aproxima da obra é acionada em voz a descrição dela.</p>\n\n<p>Segundo o dicionário de português “soluto” significa: “o que se dissolve, se desfaz em meio liquido, quando está em contato com outra substância de maior quantidade, o solvente”. A exposição virtual e interativa “Soluto” do artista visual Fabio Rocha, com curadoria e game/design de Flávio Carvalho apresenta 7 obras desse momento. A sublimação e soberania fazendo frente com angústia e a languidez. O mar; a água, surge como uma transição desses elementos, ora suave, ora revolto. Ela é o berço da poética de Fabio dissolvendo a mais pura composição imaterial de uma pessoa, que perdura após sua passagem. A narração de Fernanda Maldonado complementa à vivência virtual da exposição. Ela é acionada a partir do momento em que o jogador se aproxima de uma obra, com a descrição do que está por escrito. </p>\n<p>Este projeto expositivo se inicia na versão 1.0 para o evento CollabSoul Summit organizado por Marcelo Castilho e Michelle Taminato. A inovação, a colaboração e a felicidade são os pilares do CollabSoul, que andam em sintonia com a experiência expositiva. Sejam bem-vindos à exposição e sugiro que segurem a respiração mergulhando nessa experiência. O seu retorno à superfície tem tudo para ser mesmerizante. </p>\n\n<p>Contatos Instagram Fabio <strong>@fabr.r</strong> / Flávio <strong>@flvz_</strong>/ Fernanda <strong>@fe_mldn</strong></p>", "metacritic": null, "released": "2020-07-25", "tba": false, "updated": "2020-07-27T04:39:01", "background_image": "https://media.rawg.io/media/screenshots/853/8532de241b568fd0258d2cc8873deb92.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 39, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["flvz"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}