{"id": 473007, "slug": "willistoria", "name": "Willistoria", "name_original": "Willistoria", "description": "<p>Monsters have always been at odds against humans. The existence of the Monster Dimension was a forbidden dimension filled with vile monster energies. Monster energies strengthen the monsters on Earth, making them more aggressive and tougher to manage. It was sealed away in the past millennium. Humans then did what they could to secure their existence against monsters on Earth to date. Humans hunt monsters for food and materials, while monsters still prey on humans.<br/></p><p> <br/>A global defense force, known as the Imperial, was formed to protect the world and provide assistance in times of need, and to keep monsters under control. And thus, humans try to strike a delicate balance in this natural ecosystem against monsters, while working hard on their own lives...</p>\n<p><strong>Gameplay</strong></p>\n<p>This game has a free, open scenario. You basically explore the world and do whatever quests you want. It's your own journey! </p>\n<p>Estimated gameplay time: 8-15 hours</p>\n<p>You will choose from 4 starting characters at the start. Note that this character will be your main character throughout the game and you will not be able to change him or her. He or she will have his or her own storyline on top your journey. For starters, I would recommend choosing Eldred as his early gameplay is a little more guided. If you want to push yourself, choose Lazarus. The 4 starting characters have very different characteristics. The description in-game gives you a rough idea. You will also be able recruit (and expel) other characters as you play the game.</p>\n<p>If you want to know more about the in-game basics, talk to the informant. You can find him at any pub in any major town. He is dressed in mafia black and is the only non-playable character who wears sunglasses in the whole game. Similarly, whenever you are lost, just talk to the informant. He will lead you through the major storylines of your main character if your main character is strong enough.<br/> <br/>Lastly, always talk to people in town to find out information and trigger quests as your journey! Save your game frequently. You never know when you may get stuck or wiped out. If you complete the game, you are welcome to try out other starting characters. Take on the Cardinal Sentinels as a challenge! Have fun!</p>\n<p><strong>Monster Difficulty Tips \"Spoiler\"</strong></p>\n<p>For new players who are stuck in the early game because monsters are growing too strong or you're not getting enough gold, try to recruit a few more characters, preferably a party of 4 to 5 people before you take on quests. Some characters can be recruited straightaway, namely the starting characters and Cassara. You can expel them later on via the pubs.</p>\n<p>Regular monsters grow stronger every 5 levels of your main character. Quest bosses grow at every 10 levels of your main character and the difficulty grows by quite a vast amount. If you're training up your characters for the boss, try not to let your main character go past level 10, 20, or 30; otherwise you'd be facing an even tougher boss instead. It will be capped past level 30.</p>\n<p>Here are some tips for everyone:<br/>• Be careful with the mysterious portal quest in Baredale as there is NO RETURN upon entering it. Prepare some items, and maybe get some magic spells, for the boss battle.<br/>• Read the descriptions of your equipment. Some confer skills that are extremely helpful for boss battles (eg. Dispeller). <br/>• Some equipment confer resistance to states like instant death. You wouldn't want to put 2 death resistant equipment on the same character. Spread them out among your party so they have a higher chance of survival against monsters and bosses who use Doom. <br/>• If you want that treasure chest in the Lost Forest, you must explore it BEFORE dispelling the abnormal portals. Is it worth trying your luck on those random portals to get to that chest? Yes. :)<br/>• Ember Dynamics (Fire Element Magic) grants evasion to magic attacks. Try casting it if you have trouble against bosses that wipe out your team with hit-all magic spells. The same goes for Shadow Fuse (Dark Element Magic) which grants physical evasion.<br/>• I wonder if anyone actually found the 6th Cardinal Sentinel so far? He has been around since Willistoria was first released. If your level is high enough to meet the Cardinal Sentinels, he will randomly appear in wild areas where there are healing portals. If he doesn't appear the first time, just go out and back in to the place again. Talk to him once, he will disappear. Then keep checking other healing portal places and talk to him two more times. He will eventually ask you to meet somewhere...</p>\n<p>Once you have downloaded the file, simply unzip the folder, click on the game.exe inside and you should be able to start the game. You are recommended to read through the Readme for some beginner tips! Credits (long list) can be found in the Readme file and in-game itself. Control keys can also be found inside Readme file.<br/></p><p>PS: Although my game is completed, there may be bugs that I missed out as I mainly tested by myself. Please report them to me and I will fix them ASAP. Thanks!</p>", "metacritic": null, "released": "2020-07-25", "tba": false, "updated": "2020-07-27T04:33:55", "background_image": "https://media.rawg.io/media/screenshots/1b8/1b8b730eb6bdf0f054e7ed54a36fc07e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 279, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["evilsaigon"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}