{"id": 47317, "slug": "mall-mayhem", "name": "Mall Mayhem", "name_original": "Mall Mayhem", "description": "Online shopping has taken its toll and now it's time for the mall to be destroyed due to unpaid debts. Unfortunately, your shady demolition business can't afford a wrecking ball so you'll have to use your car instead. Don't think you can go about your job as you please. Holdout shoppers are still in the mall, and dangerous mayhem is around every corner!<br/><br/>The goal is to destroy as many things in the mall as possible. Getting stuck for more than a few seconds or hitting too many shoppers means game over. You won't go unrewarded for your efforts. For every object you destroy you will receive points. Points can be used to unlock abilities to greatly enhance the demolition experience.<br/><br/>If you gain enough points in a certain mall you will unlock an ability! Abilities help you get unstuck, avoid shoppers, or destroy objects.<br/><ul><li>Boost-Gain a quick burst of speed to blast through obstacles or get unstuck.<br/></li><li>Balls Of Steel-Magically drops down 4 huge steel balls from the sky, destroying everything in their path.<br/></li><li>Ghost-Fear those shoppers no more! Instead of running the shoppers over on \"accident\", you'll pass right through them.<br/></li><li>Radial Force-It's like the force, but radial.<br/></li><li>Second Chance-Are you stuck? No problem! Just use this ability to spawn back at the center of the mall. This is the only ability that can only be used once per game.<br/></li><li>Give Up-Had enough? Use this ability to destroy your car and save the current score.</li></ul><br/>Ready to up the challenge? Modes make the game harder to play. You can enable as many modes as you want. You'll be rewarded by a score multiplier while the mode is enabled. The amount of lives you have can also be adjusted to tweak the difficulty even more.<br/><ul><li>Blackout-Power outage in the mall! With all of the lights out you'll have to rely only on your headlights.<br/></li><li>Slippery Floors-The janitor just recently mopped up the floors. The mall just turned into a drift course!<br/></li><li>Earthquake-Everything is starting to shake. Can you destroy the mall before the earthquake destroys you?<br/></li><li>Inversion-Everything will be flipped upside down. Gravity vector change not included.<br/></li><li>Deadly Walls-Let's just pretend that the walls are lava.<br/></li><li>Black Friday-The mall is packed today! Can you destroy the mall before the shoppers get their Black Friday deals?</li></ul><br/><ul><li>Fast paced action packed gameplay; there’s mayhem around every corner.<br/></li><li>Advanced destruction technology that fully utilizes Unreal Engine 4.<br/></li><li>Navigate through six huge malls packed with items.<br/></li><li>Action packed arcade style gameplay with six game modes.<br/></li><li>Steam achievements and Steam Cloud save support.<br/></li><li>Relaxing mall music and elevator music that goes perfectly with the destruction.<br/></li><li>Made by a single developer with a great passion for games and the gaming industry.</li></ul><strong>I hope you have as much fun with Mall Mayhem as I had making it!</strong>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:04:23", "background_image": "https://media.rawg.io/media/screenshots/e8d/e8dd470745a1d5d4a7a03d6e8646e7b8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 24}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 354, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Titanium Game Studios"], "genres": ["Action", "Indie"], "publishers": ["Titanium Game Studios"], "esrb_rating": null}