{"id": 47311, "slug": "eden-falling", "name": "Eden Falling", "name_original": "Eden Falling", "description": "After an asteroid delivered chunks of rock and toxic overgrowth fungus, survivors found that their world had changed into the brutal new environment in which they would raise new generations. People soon formed Factions and claimed territories using whatever means of coercion they could find: negotiation, spears, or more advanced weaponry. The Fall forced survivors to abandon their technology, or ‘Tec,’ and learn to survive without it. When found, Tec can still be of great value to someone with the knowledge to use it.<br/><br/>In Razor Edge Games’ premier title, Eden Falling is a turn based RPG that finally brings a tabletop-based experience to cinematic life. Join those living after the Fall, exploring an extensive world with over 30,000 places to visit and dozens of optional rules to add to the challenge. Join in a fight for survival where your choices decide your fate.<br/><br/><ul><li><strong>Play with as many people as you want</strong> | Play alone, with a group of friends, or visit our servers to play with many adventurers.<br/></li><li><strong>Gain the edge against overwhelming odds</strong> | Gain destiny points by completing contracts (quests). Use destiny points to change your character's fate.<br/></li><li><strong>Become a legend</strong> | Build reputation and complete contracts to influence the Faction Wars, gain companions, and create your own faction.<br/></li><li><strong>Fight your way!</strong> | Choose from basic items like clubs to the most cutting edge Tec such as plasma weapons.<br/></li><li><strong>Loads of Content to Uncover!</strong> | Secret classes, recipes and crafting system allow you to find hidden gems in a wide-open world. And we’re adding things all the time!</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2023-01-31T10:57:56", "background_image": "https://media.rawg.io/media/screenshots/c3c/c3c0f14cf6ca3afbdfe09b30052e8a5d.jpg", "website": "http://razoredgegames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 385, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Razor Edge Games"], "genres": ["Adventure", "RPG", "Strategy", "Casual", "Indie"], "publishers": ["Razor Edge Games"], "esrb_rating": null}