{"id": 473226, "slug": "lost-bazaar", "name": "Lost Bazaar", "name_original": "Lost Bazaar", "description": "<h3>Welcome to the Lost Bazaar</h3>If you are in dire need for the scales of justice, a polylingual dictionary, or maybe a flyswatter to deal with those pesky efreets, you are not going to find it in your average store. Come to the Lost Bazaar - the interdimensional market where merchant-princes are selling enchanted objects for an almost honest price. In this game, you are impersonating one such aspiring merchant, trying to make a fortune at every opportunity. However, the laws of supply and demand are harsh, and many would-be lords who tried to claim a piece of the pie have fallen into poverty since the Bazaar first opened its gates. In order to stay in business, you must turn the powers of your wares against the competition!<br/><br/><br/><h3>What do you wish to play today?</h3>Lost Bazaar is a point-accumulating board game/card game hybrid, where 2 to 4 players fight for the dominance of advantageous tiles with cards drawn from a single, common deck. Play online or hotseat against other players, and choose from more than 20 boards and premade decks. Alternatively, you can show the AI opponent that humankind is still superior, or if you seek peace and enlightenment, challenge yourself with one of the devious puzzles.<br/><br/><br/><h3>Wheels will be turning</h3>The gameplay bears a resemblance to the mechanics seen in trading card games, but there is a twist. Because you do not build a deck solely for yourself, you cannot plan and enforce your strategy on others. Instead, you rely on your creativity to find combos on the fly, and make elaborate traps with whatever junk you managed to obtain. As the number of items on the board is going up, so does the difficulty to keep up with the plans.<br/><br/><br/><h3>We hope you like cards...</h3>There are a grand total of 69 beautifully illustrated item cards, ranging from seemingly mundane household objects to antique trinkets, all with a different ability to aid your cause. Some are just pretty and sell well, while others can move, wreck, turn upside down or otherwise manipulate the rest of the cast. So don your hard hat, pack your hourglass and keep an eraser in your pockets, since you'll need to be prepared for anything!<br/><br/><br/><h3>The only thing you'll be grinding is coffee</h3>While gradually building a card collection is definitely exhilarating, getting repeatedly beaten by cards you do not have is not. Lost Bazaar is devoted to the principle that all players get access to all the gameplay-affecting content from the very beginning. It is for free, but you can haggle!", "metacritic": null, "released": "2020-07-26", "tba": false, "updated": "2020-09-11T03:31:16", "background_image": "https://media.rawg.io/media/screenshots/a2b/a2bbf6c947bf6c5738e2d0f9490139eb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 284, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "PC", "Linux"], "developers": ["Lost Bazaar", "Lost Bazaar developers"], "genres": ["Strategy", "Casual", "Indie", "Puzzle"], "publishers": ["Lost Bazaar developers"], "esrb_rating": null}