{"id": 473346, "slug": "duck-boy", "name": "Duck Boy (itch)", "name_original": "Duck Boy (itch)", "description": "*** Please Note ***\r\n<p>This game is still in development - This is simply a demo. Please enjoy and be sure to leave feedback. Thank you!</p>\n\n<p>Duck Boy is a 2-d action platformer adventure game inspired by the classics, Like Zelda II and The Battle for Olympus.  Controlling Duck Boy, you'll navigate the mysterious land of Avenis on a personal quest for treasure and glory!</p>\n\n<p>Armed with an ancestral knife, a worn treasure map, and his trusty Call, Duckboy will have to run, jump, and fight his way past dangerous enemies and areas alike. Metroidvania elements put a focus on discovery and exploration as Duck Boy navigates his way around this strange and forbidden land. Combined with a classic-feeling difficulty, you'll need a sharp eye and clever problem solving skills to survive. Each enemy Duck Boy encounters fights in a unique fashion, demanding an adaptable strategy and quick reflexes. </p>\n\n<p>Crisp pixel-art and a limited color pallet invoke a sense of nostalgia. Created with this in mind, a retro-game feel is incorporated into every part of the game's design. Do you have what it takes to unearth the mysteries of Avenis? Will you lead Duck Boy to the valor of his birthright? Or will you fall like the many who have come before you? </p>\n\n<p>Duck Boy features controller support - <strong>and is in fact the encouraged way to play:</strong></p>\n<p><strong>D-pad/left control stick</strong> - movement <br/></p>\n<p><strong>D-pad up/down</strong> - look up/down </p>\n<p><strong>A/X</strong> - jump</p>\n<p><strong>X/Square </strong>- attack</p>\n<p><strong>B/circle</strong> - throwing knife</p>\n<p><strong>Y/L-bumper/Triangle/L1</strong> - Dash</p>\n<p><strong>R-bumper/R1 </strong>- Ready Call</p>\n<p><strong>start/options</strong> - pause/map/song list</p>\n<p>Controls can be viewed at anytime from the pause screen.</p>\n\n<p>Music created by: Travis Valois, @taddiestales</p>", "metacritic": null, "released": "2020-07-24", "tba": false, "updated": "2020-07-27T05:47:03", "background_image": "https://media.rawg.io/media/screenshots/499/4994150663bd671733e1ddd8df7d4cc9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 93, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Pixel_Trash"], "genres": ["Action", "Adventure", "Platformer"], "publishers": [], "esrb_rating": null}