{"id": 473444, "slug": "pazaak", "name": "Pazaak", "name_original": "Pazaak", "description": "<p>Based on the game Pazaak.</p>\n<p>Controls:</p>\n<ul><li>Escape to quit</li><li>R to reset (on your turn)</li><li>Click cards to play</li></ul>\n<p>Rules:</p>\n<ul><li>Reach 20 or end the set with a higher score than your opponent</li><li>You start with 4 cards in your hand and can play 1 card a turn. You cannot replenish these cards. Once played, they are gone</li><li>At the start of the set a main card (green) is added to your field and your score is updated. You can play a card then choose to either end or stand. Ending and standing both end your turn, but when you stand you will no longer receive cards until your opponent stands as well. You win the set when you score the highest number to 20 without going over.</li><li>In case you fill the field (9 cards) without busting, you win the set regardless of any other cards including Tie Breakers.</li></ul>\n<p>Types of cards</p>\n<ul><li>Plus (Blue) - Adds the amount on the card to your score. Range from +1-+6</li><li>Minus (Red) - Subtracts the amount on the card from your score. Range from -1 to -6.</li><li>Main (Green) - These cards are added to your field at the start of your turn and are scored like Plus cards.  Range from 1-10.</li><li>PlusMinus (Red and Blue) - Can act either like a Plus or Minus card before being played, but once set it cannot be changed.</li><li>Special (Yellow):<ul><li>Double - Acts like the card played previously. Ex. You start your turn and get a 10 card. If you play the double it will act as a 10 and your score will be 20.</li><li>Flip - Flips the value of cards with the value on them. For example, a \"3 &amp; 6\" Flip card will swap the signs of all 3's and 6's.</li><li>Tie Breaker - When the set ends in a tie, if a tie breaker was played on one side then that side will win the tie. Currently there is only one tie breaker card that acts like a plus or minus 1.</li></ul></li></ul>", "metacritic": null, "released": "2020-07-24", "tba": false, "updated": "2020-07-27T06:08:32", "background_image": "https://media.rawg.io/media/screenshots/3c0/3c014e54cf947428a1df47d97f8c4350.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 20, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Z_Doctor"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}