{"id": 473404, "slug": "final-fantasy-golden-stories-ace", "name": "Final Fantasy Golden Stories Ace", "name_original": "Final Fantasy Golden Stories Ace", "description": "<p>Final Fantasy Golden Stories Ace is a classic jrpg game that brings you an epic journey through the magical world of old-school FF series by Square Enix. Made with RPG Maker VX Ace.</p>\n<p><strong><em>Plot</em></strong><br/></p>\n<p>An events begin the scene of bloody conflict between two parties: Claudio, the holy kingdom, where a lasting peace, and Hell Gorge, the demons were're seek to conquer the world, ended up in the Claudio's Fall and seal Avatar beasts forever.</p>\n<p>15 years later, somewhere in the green Earth called Krajina, it's start with the mysterious objects called the Dragon Orbs. The Dragon Orbs were intended to be a thing of extraordinary magic and power, something to be revered, not for the ease of their method, but for the dream of never having to use them. Those Dragon Orbs are worshipped by the mystical humanoid called Orlanmians, who are living in peace at Holy City of Olando since they're keeping them for good. However, when the demonic spy attempt to obtain the Dragon Orbs for evil scheme, those orbs separate away to the various world. The crown-prince of Claudio, Prince Kayes, has changed his mind and beginning his journey with his childhood friend. Princess Laura and his army of Claudio called Human to gathering the six Dragon Orbs to grant a wish for peace. But not until the three other army show up: the Elflimian, the mysterious elf-like creatures with oriental clothes, the Orlanmian, and the Demons. During the war, each of them were fall in love, love can kill. But will the Earth regain back to peace despite the love and violence?</p>\n<p>*...Do you love Jrpg games like Tales of or Fire Emblem?<br/>*...Are you a fan of Final Fantasy and Square Enix?<br/>*...Do you enjoying classical FF games like from 1 to 6?<br/>*...Do you love Chocobos or Moogles?<br/>*...Do you like a Hero like Squall or Noctis?<br/>*...Do you love romance drama moments like Cloud x Tifa?<br/>*...Have you watched Dragon Ball or Sailor Moon before?<br/>*...Are you interesting in high fantasy instead of modern sci-fi?<br/>*...And, if you love Final Fantasy fan games? Then, this game is for you...for everyone!<br/>*...The most epic fantasy game ever made with RPG Maker VX/VX Ace! And it's not for sale, it's free to play!!</p>\n<p><strong><em>Gameplay</em></strong><br/>Final Fantasy Golden Stories, like most every classical FF games, has four basic game modes: an overworld map, town and dungeon maps, a battle screen, and a menu screen. The overworld map is a scaled-down version of the game's fictional world, which the player uses to direct characters to various locations. The primary means of travel across the overworld is by foot, a ship, a Chocobo, and an airship become available as the player progresses. With the exception of some battles in preset locations or with bosses, enemies are randomly encountered on field maps and on the overworld map when traveling by foot, Chocobo, or ship, and must either be fought or fled from.</p>\n<p>The game's plot develops as the player progresses through towns and dungeons. Some town citizens offer helpful information, while others own shops that sell items or equipment. Dungeons appear in areas that include forests, caves, mountains, swamps, underwater caverns and buildings. Dungeons often have treasure chests containing rare items that are not available in most stores. The game's menu screen allows the player to keep track of their experience points and levels, to choose which equipment their characters wield, and to use items and magic. A character's most basic attribute is their level, which can range from one to fifty, and is determined by the character's amount of experience. Gaining a level increases the character's attributes, such as their maximum hit points (HP), which represents a character's remaining health; a character dies when they reach zero HP. Characters gain experience points by winning battles.</p>\n<p><strong><em>Features</em></strong><br/>*10 playable characters planned for the series with 6 temporary characters.<br/>*14 classes for each character. No job systems anymore.<br/>*331 skills can be learn through levels or obtaining hidden skills.<br/>*323 items, 170 weapons, and 164 armors are available through buying, chests, hidden area, quests and much more.<br/>*Over 30 quests available by talking to NPCs or main quests.<br/>*8 cameo characters from famous Final Fantasy games can be found for the sidequest.<br/>*Crafting items/weapons/armors is only available after starting Chapter 6.<br/>*314 enemies and bosses to face off during your journey.<br/>*Cooking, cutting trees, mining, fishing and much more for fun.<br/>*50 locations around the magical world of Krajina, the main settings for my game.<br/>*Chocobo minigames, battle stadium challenge, and adorable creatures...oh my!<br/>*Enjoy the epic battle of the four greatest kingdoms with romantic moments between two enemies, life or death, and from friendship to true love.<br/>*Over 150 music soundtracks were taken from other games, belonged to rightful owners, not me!<br/>*The game story took inspired by The Lion King, Final Fantasy and Sailor Moon.<br/>*Collect 6 legendary Dragon Orbs and summons the most powerful god of the dragons to save the entire universe from evil's ambitions.</p>\n<p><strong><em>Age Rating</em></strong></p>\n<p>This fangame's age rating is T for Teen (+13) to have content that may be generally suitable for those aged 13 years and up.</p>\n<p>May contain Blood, Mild Language, Mild Sexual Themes, Partial Nudity, Suggestive Themes, Use of Alcohol and Violence.</p>", "metacritic": null, "released": "2020-07-24", "tba": false, "updated": "2020-07-27T06:00:58", "background_image": "https://media.rawg.io/media/screenshots/d33/d33b02e30b66c2beeb8acfd81cec7355.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 85, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["LittleLulu Falcom Emblem"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}