{"id": 473599, "slug": "aelep-demo", "name": "Aelep (Demo)", "name_original": "Aelep (Demo)", "description": "<p>    Welcome to Aelep, an online cooperative boss fighting arena. On it you and up to two friends will face off against gigantic enemies in fast and complex encounters.<br/></p>\n<p>    This is a<em> </em><strong><em>work in progress</em></strong> prototype, that intends to showcase one of the game's encounters. My main goal is to measure player's interest to decide on how and when to move forward with this project as a full game. As a solo developer it can get hard to judge your own work, so <strong><em>all feedback</em></strong> is precious and welcomed, as it will allow me to get a more objective vision of the game and its current state.</p>\r\nHow to play / Controls\r\n<p>    Aelep is a top down Action-RPG: your character is controlled with the WASD keys and oriented using the mouse. Your main way to interact with the world consist of skills, the manifestation of each Alchemist elemental power. Most skills are projectiles/position based, requiring careful aim and awareness to properly function.<br/></p>\n<p>    The game's objective is to defeat the enemy boss. As its health goes down, new phases will activate, increasing the fight's difficulty. Success in Aelep is a mix of good positioning, reflexes, teamwork, and practice.</p>\r\nThe setting\r\n<p>    Once, the most powerful city there was, Teva attracted people from every corner of the world. At its center stood the Philosopher's Stone, a crystallized form of raw elemental power that acted as a catalyst for Alchemy. For years the city thrived and grew, as Alchemists associated in Guilds, pushing their knowledge and power forward. But somewhere along the way cooperation turned into selfishness, then into mistrust and then into something dark: a terrible civil war exploded between the Guilds, engulfing the city and its inhabitants.\r\n</p>\n<p>    What came after is only vaguely understood since there are no witnesses of what transpired. It's theorized, however, that the fighting reached the Stone and damaged it somehow. The anomaly that consumed the city afterwards, throwing elements into disarray and condemning the world to a slow death, is simply known as The Upheaval.</p>\n<p>    Now, a small group of surviving Alchemists embark on a desperate quest to Teva’s ruins: a corrupted maelstrom, full of twisted inhabitants and experiments. They hope to reach the Stone at its center and somehow stop the sickness that is slowly consuming the world...</p>\r\nThe Alchemists\r\n<p>    In Aelep each Alchemist fulfills a very particular role: no lone hero can survive the aberrations that now dwell on Teva, so they must work together for a chance to succeed.</p>\n<p><em><strong>Amara</strong></em></p>\n\n<p>    A member of the Bolt Order, Teva's mysterious assassin Guild, Amara is the \"heavy hitter\" of the group, focusing on dealing sustained damage to enemies. A master of lightning, her play style focuses on moving fast around the arena, picking up anomalies that power her skills up while keeping a safe distance from foes. She is fast and deadly, but is very vulnerable when not positioned correctly and has the smallest health pool of the bunch.</p>\n<p><strong><em>Daigo</em></strong></p>\n\n<p>    Resolute and proud, Daigo is all that remains of the Ember Knights order.  Commanding both fire and ash, she is always the first line of defense of any encounter. Her kit focuses on disrupting enemies while mitigating the damage that they cause. Although her damage output is relatively small, she acts as the anchor of the group, controlling the encounter's rhythm while protecting her allies.</p>\n<p><strong><em>Maëlech</em></strong></p>\n\n<p>    No Alchemist feels the impact of the Upheaval more than Maëlech. A druid of the Earth Circle, she possesses a powerful connection with nature and its delicate balance. She uses her knowledge of both life and death to channel her vital energy into allies, restoring their health. Conversely, she can drain it from her foes, restoring her own. Cunning and reliable, the support and sustain that she grants are key to survive the horrors of Teva.</p>", "metacritic": null, "released": null, "tba": false, "updated": "2020-07-31T02:52:49", "background_image": "https://media.rawg.io/media/screenshots/72a/72abb98d86ed51b4c6295b9018190b16.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 346, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Galanodell"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}