{"id": 473534, "slug": "buried-stars", "name": "Buried Stars", "name_original": "Buried Stars", "description": "<p>A murder spree inside the collapsed site of an audition show!<br />\nReveal the hidden truth through Communication x Survival x Adventure</p>\n<p>『BURIED STARS』 is a new mystery adventure game presented by Studio LARGO, the developers of the masterpiece adventure series 「Panic Room」 and 「City of Mist」 in Korea, along with LINE Games Corporation.</p>\n<p>◆ A murder spree inside the collapsed site of a 「Survival Audition」<br />\nThe building suddenly collapsed during a live showing of an ordinary survival audition show.<br />\nAnd while trapped inside, the contestants and staffs are faced with a fatal incident.<br />\nWho is the culprit? Why and how did the attacker pull off this act?</p>\n<p>◆ A beautifully harmonized 3D-2D graphics and presentation<br />\nStunning 2D characters have been added into the 3D collapsed sites<br />\nin order to present a more dramatic and dynamic scenes.</p>\n<p>◆ Variety of sound effects and passionate acting by seasoned voice actors<br />\nDive into the immersive experience supported by variety of original scores,<br />\nincluding the main theme song 「Be Honest」, ambient sounds, sound effects<br />\nand the incredible voice acting by a seasoned crew of talents.</p>\n<p>CAST<br />\n- Korean : Park Sungtae, Ryu Seunggon, Nam Dohyoung, Kim Yeonwoo, Kim Haru, Lee Kyoungtae, Lim Yoonsun, etc.<br />\n- Japanese : Kakihara Tetsuya, Eguchi Takuya, Shimono Hiro, Hikasa Yoko, Sato Rina, Hoshi Soichiro, Kitamura Eri, etc.</p>\n<p>◆ Find hints and curses from 「Social Media」<br />\nKeep up with the reactions outside the accident site through 「Social Media」.<br />\nAnd check out the 「Timeline」 for possible hints and review the current situation.</p>\n<p>◆ Branching Scenario Paths<br />\nThe various choices during conversations with other survivors, along with multiple playthroughs, the scenario constantly branches out to provide plenty of stories to explore.<br />\nFind all of the possible endings and after stories of each survivors.</p>", "metacritic": 83, "released": "2020-07-30", "tba": false, "updated": "2023-11-04T09:51:47", "background_image": "https://media.rawg.io/media/screenshots/2f3/2f3bfcd01ceaa6b013d1e35ce34c0261.jpg", "website": "https://buried-stars.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 5, "owned": 14, "beaten": 3, "toplay": 6, "dropped": 1}, "playtime": 6, "achievements_count": 44, "ratings_count": 3, "suggestions_count": 281, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC", "PlayStation 4", "PS Vita", "Nintendo Switch"], "developers": ["LINE Games"], "genres": ["Adventure", "Casual"], "publishers": ["LINE Games"], "esrb_rating": "Teen"}