{"id": 473674, "slug": "wizard-league-super", "name": "Wizard League Super", "name_original": "Wizard League Super", "description": "<p>Welcome to the League! </p>\n<p>Wizard League Super is a variant on traditional tennis that uses magic. Players (known to the league as casters) use spells to manipulate a fireball so that it either excessively makes contact with their opponent or gets past their opponent and their defensive barrier. Casters can not directly touch the ball, so instead they use a reflector bolt to divert the fireball away from their side of the field. Successfully doing so builds up meter, a resource that allows for the caster to use powerful spells and super moves. Using spells and supers can turn the tide of a match, so casters will need to utilize them effectively to win!<br/></p>\n<p>In addition to the standard 1 on 1 versus component, the League provides every caster with a space to break blocks with a fireball in order to practice manipulating the fireball. </p>\n<p>During this meeting of the League, there are 6 available casters that will play:</p>\n<ul><li><strong>FIRE: </strong>The fire caster specializes on playing quickly and speeding up the game<ul><li><strong>Spell: Fire Up</strong>, increases the speed of the fireball</li><li><strong>Super: Fire bolt</strong>, shoot a bolt of fire that can hit the opponent or the fireball, speeding it up significantly</li></ul></li><li><strong>LIGHTNING: </strong>The lightning caster plays around fast situations, ready for anything that comes near<ul><li><strong>Spell: Shock Barrier</strong>, sets up a barrier of static electricity that automatically deflects the fireball</li><li><strong>Super: Lightning bolt</strong>, shoots a bolt of lightning across the field that can paralyze an opponent</li></ul></li><li><strong>ICE: </strong>The ice caster focuses on slowing the game down, making it more manageable<ul><li><strong>Spell: Cool Down</strong>, decreases the speed of the fireball</li><li><strong>Super: Spike</strong>, instantly freezes and destroys the fireball</li></ul></li><li><strong>EARTH: </strong>The earth caster creates extra defenses on the field<ul><li><strong>Spell: Rock Summon</strong>, places a rock in front of the caster. When struck by the fireball, it is destroyed, and the speed of the fireball is halved</li><li><strong>Super: Rock Wall</strong>, creates a wall of rocks behind the caster that instantly destroy the fireball on contact.</li></ul></li><li><strong>WIND: </strong>The wind caster tricks the opponent, manipulating the fireball without even touching it<ul><li><strong>Spell: Breeze</strong>, blows the fireball away from the caster</li><li><strong>Super: Reversal</strong>, instantly turns the fireball 180 degree</li></ul></li><li><strong>DARKNESS: </strong>The darkness caster plans on obfuscating parts of the game</li><ul><li><strong>Spell: Shadow Wall</strong>, blankets part of the field in darkness</li><li><strong>Super: Cloak</strong>, turns the fireball invisible for a short period of time</li></ul></ul>\n<p>Grab a friend, play some games, and determine who is the better caster on the field!</p>", "metacritic": null, "released": "2020-07-30", "tba": false, "updated": "2020-07-31T03:08:25", "background_image": "https://media.rawg.io/media/screenshots/1ad/1ad135fa426f86991249751bfe10db19.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 32, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["DAwesme"], "genres": ["Sports"], "publishers": [], "esrb_rating": null}