{"id": 47385, "slug": "syndrome-vr", "name": "Syndrome VR", "name_original": "Syndrome VR", "description": "<p>You wake up dazed and confused, probably from the effects of cryosleep.<br />\nNo one can be seen around, but you soon start to find the bodies of your dead crewmen.<br />\nThe ship is adrift, and whoever – or whatever – killed your crewmates is probably still around.<br />\nSyndrome is a sci-fi survival horror game that takes place aboard the &quot;Valkenburg&quot;, an exploration and science ship equipped with the most advanced systems in the Novacore fleet.<br />\nYou need to find out what happened to your crewmen and do whatever you can to survive this nightmare.<br />\nThe enemies are powerful and numerous, which means that stealth and evasion are often the best strategy.<br />\nYou&#39;ll find weapons aboard the ship, but ammo is scarce and should be wisely spent.FEATURES<br />\n● Claustrophobic horror: The action takes place inside a spaceship. There are countless horrors inside, both physical and psychological.<br />\n● Fight or hide: There are weapons on the ship, but not enough ammo to take everyone out. Use them wisely.<br />\n● Engaging storyline: Nothing is what it seems. Something very bad happened aboard the ship, and it’s up to you to find out what’s really going on.<br />\n● Reactive enemies: They’ll follow noises and investigate any disturbances.<br />\n● Interactive scenario: There’s plenty of exploration to do inside the ship, and many things to discover.<br />\n● VR Game Mode: A survival mode in VR where you face countless hordes of enemies.</p>", "metacritic": null, "released": "2017-10-06", "tba": false, "updated": "2020-01-07T22:48:25", "background_image": "https://media.rawg.io/media/screenshots/c8c/c8c7daab3df0e87ef673ddd276988b83.jpg", "website": "http://www.syndromegame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 14}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 384, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "PlayStation 4"], "developers": ["Bigmoon Entertainment"], "genres": ["Action", "Adventure"], "publishers": ["Bigmoon Entertainment"], "esrb_rating": null}