{"id": 47381, "slug": "60-parsecs", "name": "60 Parsecs!", "name_original": "60 Parsecs!", "description": "<p>In the late 1950s, the Cold War opens up a new front: THE OUTER SPACE!<br />\nWhen an unlikely crew of astronauts gets stranded among the stars after a haphazard evacuation from the exploding space station, their fate rests in your hands.<br />\nTime to act, Captain!<br />\nGet your people and enough supplies to the space rocket, before the incoming nukes, accidental debris or the vaccum get you first. Is 60 seconds enough to prepare for the 60 parsec, unplanned journey into the unkown?<br />\nHurled into the depth of far away galaxies, only you can get everyone back home. Decide what to do, facing impossible odds every day and a unique adventure every time you play. Ration food, somewhat radioactive fuel and make the best of your supplies to keep your crew spaceworthy.<br />\nCan you survive the horrors lurking outside and within your space rocket?<br />\nBon voyage!<br />\nSCAVENGE for supplies, resources and your crew in just 60 seconds and live with the consequences of your frantic decisions!<br />\nSURVIVE the farthest reaches of outer space with an almost competent crew and a modest supply of soup cans in your trusty space rocket. Can you reach your destination?<br />\nEXPLORE the vastness of space in a procedural, non-linear narrative, incorporating roguelite elements for short but intense play sessions, where every decision made can make it or break it.<br />\nCRAFT your own space-faring adventure and experience a neverending stream of story events with a diverse cast of characters<em>!<br />\n</em> including, but not limited to space octopi, the infamous swinging aliens of Omicron-7 and of course those pesky Soviets.</p>", "metacritic": 68, "released": "2018-09-17", "tba": false, "updated": "2024-03-13T21:04:42", "background_image": "https://media.rawg.io/media/screenshots/e9e/e9e19e791513add41990b4c5958c5bf1.jpg", "website": "http://60parsecs.com", "rating": 3.39, "rating_top": 4, "added_by_status": {"yet": 72, "owned": 837, "beaten": 32, "toplay": 9, "dropped": 22, "playing": 3}, "playtime": 3, "achievements_count": 87, "ratings_count": 55, "suggestions_count": 183, "game_series_count": 1, "reviews_count": 57, "platforms": ["PlayStation 4", "Xbox One", "iOS", "PC"], "developers": ["Robot Gentleman"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Simulation", "Casual", "Indie"], "publishers": ["Robot Gentleman"], "esrb_rating": "Everyone 10+"}