{"id": 47409, "slug": "landmark-city-game", "name": "Landmark City Game", "name_original": "Landmark City Game", "description": "■ Sale landmark city<br/>This is not difficult construction simulation game. Build your own landmark city with simple operation.<br/><br/>■ Urban growth game that grows with credits selling landmark city<br/>Build landmarks and upgrade buildings to enhance the value of the city.<br/>You can earn as many credits as you value at the time of sale.<br/>You can build new buildings and landmarks with your credits.<br/>Landmarks that have grown to maximum levels will provide buffs during the game.<br/><br/>■ Balancing game that requires proper upgrading of landmarks, buildings, and banks<br/>The best way to earn the best credit is by doing the upgrade in an optimal way.<br/>You can get the rewards in proportion to the happiness of the population upgraded and the population upgraded to the highest.<br/>At any moment, you can see yourself investing in a new landmark or building, upgrading a bank, or buying land.<br/><br/>■ Idle game with skills<br/>Skill can be used repeatedly at a certain time.<br/>Do not spare your skill. You can enjoy much more fun games.<br/>You can enjoy playing games while using auto construction skills.<br/><br/>■ Things to Watch<br/>Play hard and take a break and enjoy the city by zooming in on the screen.<br/>Colorful night views, hot air balloon, fireworks, various cars. I have a pleasure to fall in ignorance.", "metacritic": null, "released": "2017-09-26", "tba": false, "updated": "2019-10-22T14:30:50", "background_image": "https://media.rawg.io/media/screenshots/14e/14e1bd25300f8135690d3931f8ff37dd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 118, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Kong JungHyun"], "genres": ["Strategy", "Simulation"], "publishers": ["Kong JungHyun"], "esrb_rating": "Everyone 10+"}