{"id": 474069, "slug": "romancing-the-sun", "name": "Romancing the Sun", "name_original": "Romancing the Sun", "description": "<p><strong>Romancing the Sun</strong>: the dating sim where you find love or the sun goes out. In the tentative place between high school and life where the world seems close and intense, a bad date can feel like the end of the world and might be.<br/></p>\n<p>Step in our main character's head and (his\\her\\their) shoes as they make friends, meet people, go to parties, and date!</p>\n<p><strong>Gameplay</strong></p>\n<p>The main gameplay feature is choice and information gathering. Choosing one path may close off another but dangerous choices may yield insight into characters' thoughts and pasts.</p>\n<p>Multiple endings are planned but the game over scenarios are already waiting.</p>\n<p><strong>Dawn</strong></p>\n<p>Dawn is the love interest. She is a highschool graduate that most people forgot. Her motivation runs off of fumes from the energy that she used to have. She manages to keep up appearances in front of her parents and aggressively goal-oriented friend Conney.</p>\n<p>Build a relationship with Dawn, the people around her, and the community to pull through the blinking sun crisis.</p>\n<p><strong>Features</strong><br/></p>\n<ul><li>Fun supporting cast</li><li>Multiple date locations and stories</li><li>A tedious amoung of game overs</li><li>Hand-waved lore</li><li>And existential dread!</li></ul>\n<p><strong>Future Plans</strong></p>\n<p>For phase one of the game's development, we are going to focus on one love interest, Dawn. It is very important to us that we finish the game and have a complete story to it and that another love interest has a unique story  from meeting to romance, dating, complications, love, and solar shenanigans. </p>\n\n<p>Brought to you by Sweet Potato Dreams</p>\n<p>Ray Richards @ray_thought </p>\n<p>and Bee's Knees</p>", "metacritic": null, "released": "2020-07-29", "tba": false, "updated": "2020-07-31T04:33:37", "background_image": "https://media.rawg.io/media/screenshots/c91/c910f4a056eb842bd19714be684b2e4c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 141, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "Linux", "PC"], "developers": ["TheSugarRay"], "genres": [], "publishers": [], "esrb_rating": null}