{"id": 474079, "slug": "the-point-of-no-return-ds23g", "name": "The Point of No Return (DS23G)", "name_original": "The Point of No Return (DS23G)", "description": "Introduction:\r\n<p>„The Point of No Return“ is the story of Jennifer Turner, a mid-30's woman with a loving husband and a soon to be college bound daughter. Her idyllic smalltown existence is threatened when three fugitives decide to turn her home into a temporary hideout. Jennifer is faced with a decision: Cooperate with the intruders? Or resist them? How far will she go to protect her family? Are her actions going to jeopardize everything she holds dear?</p>\r\n\r\n\r\nGameplay:\r\n<p>Jennifer will be confronted with various decisions during this Visual Novel. Over time, those decisions will lead her onto one of the <strong>three unique main routes</strong>. <br/>So how will she act?<br/><strong>Defiant</strong>, confronting the antagonists at every possible turn? Maybe she'll instead try to <strong>deceive</strong> them into trusting her, waiting for that one opportune moment to strike. Or she'll just be <strong>submissive</strong>, hoping that this will be the best way to protect her family.<br/>All of these are possible and each route will lead to the final question: Will Jennifer be able to overcome this situation? Or will she cross a line, one that'll never let her go back to her past life. A Point of No Return.</p>\r\n\r\n\r\nCharacters:\r\n<strong>Jennifer Turner:</strong>\n<p>The main character of this story. Happily married with one daughter and working as a highschool librarian, she's a strong-willed 37-years-old woman. Having married very early due to getting pregnant while just out of highschool, she only ever has been seriously romantically involved with her husband.</p>\r\nMaya Turner:\r\n<p>Jennifer's daughter, who recently graduated highschool and is now on her way to college. This young adult may seem like a rebel on the outside, but her upringing in a relatively lower middle-class household formed her into a humble and dilligent person.</p>\r\nStan Lambert:\r\n<p>Having been involved in a widely publicized kidnapping case, Stan Lambert was supposed to serve a long prison sentence. He, however, had a different plan and is now on the run with his two fellow fugitives. It also happens to be the case that the 38-years-old deliquent knows Jennifer from an incident in the past...</p>\r\nChristopher Aprile:\r\n<p>Christopher Aprile was practically born into organized crime, with his father having been a famous hitman for a mob outfit in upstate NY. However, a botched assassination attempt landed Chris in a California prison. Luckily for him, he made the acquaintance of a man who had a plan to escape the place, Stan Lambert.</p>\r\nHuang Jinrong:\r\n<p>The third of the escapees. Unlike his companions, Huang is the opposite of hot blodded. His former \"job\" consisted of overseeing the gambling operations of a triad syndicate in the bay area, where cold, calculated reasoning guided his decision making.</p>\r\n\r\n\r\nAndy Turner:\r\n<p>Andy is the husband of Jennifer and Maya's father. Him and Jennifer were highschool sweethearts and ended up getting married when Jennifer got pregnant in their college junior year. As a university research assisstant, he sometimes has to travel to attend conferences and for his studies, which just happens to be the case at the start of this story.</p>\r\nSome more details on what content to expect:\r\n<p>To get the elephant in the room out of the way first: Yes, NTR and sexual corruption are very much in play in this game, but also avoidable. However, there are no \"safe\" choices initially, every decision Jennifer takes will eventually lead to her having to  deal with the fallout those decisions caused.</p>\n<p>Additionally, the different main routes the player will embark on will have their own sets of unique characters and scenarios, to give each route a very different feel.</p>\n<p>Also, if you're interested in supporting this game, feel free to drop by the <strong>Patreon page</strong>.</p>Note:<p>It came to my attention that some antivirus programs in Windows, most notably Defender, pick this up as a trojan. Turns out that using a custom .exe icon for Renpy VN's can cause this problem, so I added another download option for a version of the game that doesn't have this icon and instead uses the default Renpy one.</p><p>This of course doesn't change anything in-game, but it should help people who get the antivirus warning for the normal version and don't want to simply trust a porn game dev when he tells them to just ignore the antivirus message (which is completely understandable).</p>", "metacritic": null, "released": "2020-07-29", "tba": false, "updated": "2020-07-31T04:36:05", "background_image": "https://media.rawg.io/media/screenshots/ad9/ad953b975898d713ea250b76390298d6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 182, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["DS23G"], "genres": [], "publishers": [], "esrb_rating": null}