{"id": 474160, "slug": "attention-heroes", "name": "Attention Heroes!", "name_original": "Attention Heroes!", "description": "<p>8 heroes. 1 Spotlight. No morals.</p>\n<p>You all know what it means to be a true superhero, right? Huh? What’s that? Rescuing citizens? Having the strongest powers? Baloney! Claim your righteous spot in the spotlight, deprive your competitors from all the attention and thus prove yourself as the best, worthiest superhero to have ever flown!</p>\n<ul><li>Up to 8 heroes can play simultaneously!</li><li>Unique and easily accessible, self-centered gameplay!</li><li>Each hero is unique, just like everyone else!</li></ul>\r\nFaq\r\n<p>Great, what do I need to play?</p>\n<ul><li>Windows, Friends and a controller for each friend. You can choose between Xbox 360, Xbox One, Dualshock 4 and Switch Pro Controller. </li></ul>\n<p>How do I play?</p>\n<ul><li>Move with the stick, and dash with Cross for Dualshock4, A for the rest. Try hitting the guy who has the spotlight aimed at him with your dash, he seems very full of himself!</li></ul>\n<p>I have no friends to play with, or all my friends are quarantined in their homes right now. Is this multiplayer only? :(</p>\n<ul><li>As for now: yes. But AI is on it's way! And better yet, idk if you guys have ever heard of https://parsecgaming.com/ , but it lets you stream local multiplayer games to your friends, or even strangers, to play together wherever you are! </li></ul>\n<p>I want to say how impossible it is to leave negative feedback on this game as the game is already as perfect as can be. Where can I do so?</p>\n<ul><li>You can leave a comment, or fill out this form: https://docs.google.com/forms/d/e/1FAIpQLScqWd5tl43NKFuJiuEjfHZU806gXDxeGpiTqemq...</li></ul>\n<p>Where can I follow what Attention Heroes! is going to do next?</p>\n<ul><li>There's my personal Twitter https://twitter.com/Lennert_Koppe and the website http://www.attention-heroes.com/?utm_source=FAQ%20description&amp;utm_medium=itch.io...  and of course this place right here: the games itch.io page will occasionally receive new updates, and the downloadable demo as well!</li></ul>", "metacritic": null, "released": "2020-07-29", "tba": false, "updated": "2020-07-31T04:55:06", "background_image": "https://media.rawg.io/media/screenshots/fc3/fc3989df01eeb3f37bac918ec6f06d52.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Lennrtjboi"], "genres": ["Action"], "publishers": [], "esrb_rating": null}