{"id": 474155, "slug": "isle-of-parks", "name": "Isle of Parks", "name_original": "Isle of Parks", "description": "<p><strong>Controls:</strong></p><p><strong>Move:</strong> WASD (or Left stick of a gamepad)<strong><br/>Reset:</strong> R<br/><strong>Quit: </strong>Escape</p><p> </p>\n<p>                                                                 </p>\n<p><em><strong>Isle of Parks</strong> was made as part of the 2019 exhibition of <strong>Isle of Games</strong></em></p>\n<p>                                                                 </p><p> </p>\n<p><strong>So I made a game for my mom.</strong></p>\n<p>Now she's not a gamer, she's not familiar with playing games besides solitaire nor is she familiar with a gamepad controller, so I knew I had my work cut out for me.</p>\n<p>If you ARE a gamer, you'll probably have long forgotten but learning games was actually a bit challenging. There's a good chance you overcame that challenge by sheer interest and determination. But if you've neither for learning a new thing, learning said new thing can be overwhelming.</p>\n<p>It's a bit like reading a book. You remember the first few books you read? Big letters, simple words and structure, big bright colorful images. Imagine you're 6 years old and you just picked up a copy of \"A Brief History of Time\" by Stephen Hawking. You understand the concept of reading the letters that form the words, but nothing is making any sense to you... That's how a gamepad can feel in the hands of a lady in her 60's with no prior knowledge to games.</p>\n<p>So my challenge here was to create a game that would fit a theme somewhat interesting to her. Like a park! A park with a philosophical theme of art vs logic and the two hemispheres of the brain. Something that she would be inclined to push herself to explore a bit. To help enhance that feeling of discovery and exploration, I called out to one of my best friends, Einar Másson, to create a printable map of the park. </p>\n\n<p>The other challenge was to design the game to have the most basic controls. Like the Left stick of a gamepad to move the character, and make majority of other interactions automatic. For the 2019 Isle of Games exhibition, the crew created an amazing little station for it with a custom controller mimicking the yellow player capsule walking in the grass.</p>\n<p>At the exhibition I noticed that I had succeeded my intention. No, my mom didn't rush in to play my game, but every child that would wander in with their parents, would immediately run to the station and start playing. Sure, the station was set up to be somewhat child friendly, and the screen was usually full of bright colors, but the way they immediately picked up on the controls and started wandering around was a delight!</p>\n\n<p>But sure, my mom also liked it!</p><p><strong>Plugins used:<br/></strong>Stylized Water Shader (link)<br/>Low Poly Trees (link)</p><p><strong>Credits:</strong><br/>Isle of Games Crew for all the help and an amazing station at the exhibition! Isle of you all!<br/>Special thanks to Torfi, Joon &amp; Marco for their help!<br/>Special thanks to Einar Másson for a super cool map of the isle!<br/>Special thanks to my mom, for being my mom!</p>", "metacritic": null, "released": "2020-07-29", "tba": false, "updated": "2020-07-31T04:53:58", "background_image": "https://media.rawg.io/media/screenshots/eb8/eb88d36bdafb6a1c4ba9b7b1195cac33.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 87, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["JoiSigurdss"], "genres": [], "publishers": [], "esrb_rating": null}