{"id": 47411, "slug": "dungeonmoto", "name": "DungeonMoto", "name_original": "DungeonMoto", "description": "Exploration is no place for a human! Behold, the DungeonMoto, a fearless clockwork-adventurer sturdily-designed for exploring uncharted area, doing battle with its inhabitants and amassing riches on your behalf. All from the safety of your \"remote control device\".<br/><br/>DungeonMoto is combination neo-retro arcade and hack-and-slash style rpg hybrid: Explore, roam dungeons and collect gold in a classic arcade (\"wakka wakka\") sort of way. Encounter monsters, mobs, treasures, peddlers, traps and more! The encounters might help, they might hurt shaving off some of your health, but they could also be a swarm of battle-hardened monsters, eager for taste of metal parts and wheels!<br/><br/>Features:<br/><br/>* Combines both arcade and rpg game elements in a retroesque setting, brought to you in vibrant 4-bit color!<br/><br/>* Arcade-like exploration with swipe-and-lift based or virtual D-pad based directional controls (up, down, left, right).<br/><br/>* Multiple unique dungeon layouts to traverse. Some are nice and roomy. Some have lots of dead ends! Look out!<br/><br/>* Encounter one of over 30 different types of creatures wandering the dungeon: skeletons, zombies, dragons and more<br/><br/>* Discover traps, chests, amulets, peddlers and more!<br/><br/>* Turn-based combat: tap the adjacent creature you want to attack, use 8-direction movement controls to maneuver.<br/><br/>* Losing the battle? Give the iPhone a shake and use one of your magic potions or RUN AWAY!<br/><br/>* Full integration with GameCenter. Save and compare your high scores and accomplishments!<br/><br/>* One download gets you iPhone and \"HD\" iPad versions<br/><br/>* Play with the 8-bit sound effects and music to enhance your mood or or hack and slash to your own tunes<br/><br/>* Auto-savepoints are created at the beginning of each level, so you can go back to your game after a phone restart, crash, etc. <br/><br/>* Supports play suspension in the background<br/><br/>===========================<br/>Praise from our players:<br/><br/>\"Better than a blender with wings!\"<br/>\"Fun and original!\"<br/>\"Lots of RPG action...\"<br/>\"You guys rock!\"<br/>\"Thanks folks! Keep it coming!\"", "metacritic": null, "released": "2010-11-06", "tba": false, "updated": "2019-10-22T14:30:50", "background_image": "https://media.rawg.io/media/screenshots/cdd/cddbe33c5f0111cf9d2b854f39a95fe9.jpg", "website": "http://ftl.moofgroup.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 48, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Interealm"], "genres": ["Action", "RPG"], "publishers": ["Roby Sherman"], "esrb_rating": "Everyone 10+"}