{"id": 474368, "slug": "unicorn-racers", "name": "Unicorn Racers", "name_original": "Unicorn Racers", "description": "<p>Welcome to <strong><em>Unicorn Racers</em></strong></p>\n<p>A Single Player Arcade Racer which is still in development, race on cloud vehicles with beautiful visuals and fantasy creatures in strange and wonderful scenery, both vehicles and  charaters can be customised on preference.</p>\n<p>The idea is to gain a following for this game before its release, as its a project near and dear to my heart as this will be my first project as an indie developer. The game is made within the Unreal Engine.</p>\n<p>The Story:</p>\n<p>In a magical land far far away lived an array of beautiful and mystical creatures, they all lived together in perfect harmony. </p>\n<p>Each magical creature has their role to play, the ware wolves are the protectors of the kingdom, the Yeti's build as they have amazing strength, the Dragons are sent to collect food and other necessities and only fight when absolutely needed the Unicorns are the peace keepers and love to maintain and run around the beautiful gardens of the kingdom.</p>\n<p>\n</p>\n<p>Wanting to reign over all of the kingdoms the evil Chimera stormed the peaceful kingdom of the Unicorns. </p>\n<p>Due to ancient custom the Chimera challenged them for the right to rule over their kingdom, the magical creatures decided this was best determined by the ultimate race. \"We need to race for our land and for every bit of magic that lives here!\" cried the Unicorn King. Swiftly the magical animals headed to practice for what would be the race for their freedom.</p>\n\n<p>Please also follow the Unicorn Racers page under:</p>\n<p>Unicorn Racer Page<br/></p>", "metacritic": null, "released": null, "tba": false, "updated": "2020-07-31T05:40:28", "background_image": "https://media.rawg.io/media/screenshots/aab/aabedd5ca2aae35fa9aadc793fc4b121.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 156, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["FCSupreme"], "genres": ["Racing"], "publishers": [], "esrb_rating": null}