{"id": 474453, "slug": "avani-the-primal-land", "name": "Avani: The Primal Land", "name_original": "Avani: The Primal Land", "description": "<p>Explore, gather, learn, craft and build in the world of Avani: The Primal Land. Avani offers a unique crafting system combined with a huge skill tree and an intuitive building system mixed with traditional survival game elements.</p>\n<p>Build your home, upgrade your tools or simply explore. Learn new skills and new technologies to advance or just relax in your self built home.</p>\n<p>Avani: The Primal Land has been in development since the 25th of February 2019 and is now in Early Access!<br/></p>\n<p>Join our Discord Server to actively take decisions on the future of Avani, to provide feedback or chat directly with the developers!</p>\n<p>Discord: https://discord.gg/nY3f7BT</p>\n<p>As of now it is still unclear how the future of Avani will look. There are many ideas for future features(gardening/farming, creatures, electricity, mass production, more building options, more materials), but we want to wait for feedback before we promise features. It's your chance to shape the future of Avani, join our Discord and influence the future of Avani yourself! https://discord.gg/nY3f7BT</p>\r\nHow to help\r\n<p>We are glad that you like Avani and want to help us! We still have many plans to extend Avani and we need your help! If you can help directly with development(modeling, sound, music, programming) - great! But even if you can't directly help with development you can still help us with the project! Share Avani with your friends and help us grow a community!</p>\r\nDeveloped by:\r\n<p>PowerOfCreation \"Niklas Werner\" - Programming</p>\n<p>ДMinorStorm - Modeling, Graphics<br/></p>", "metacritic": null, "released": "2020-07-28", "tba": false, "updated": "2020-07-31T06:02:26", "background_image": "https://media.rawg.io/media/screenshots/aad/aad94d012de49383287d2208b008c28a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 4}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 131, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["PowerOfCreation", "ДMinorStorm"], "genres": [], "publishers": [], "esrb_rating": null}