{"id": 474596, "slug": "gone-viral-itch-akupara-games", "name": "Gone Viral (itch) (Akupara Games)", "name_original": "Gone Viral (itch) (Akupara Games)", "description": "<p>When a civilization dies, so too do its scruples. You’ve been captured by a society that glorifies one thing and one thing only – violence. Oh, and followers, too – can’t forget about them. String together sickening combos to sate your Fans’ thirst for blood and gain rewards. Upgrade your MURDERING skills to achieve even greater spectacle and efficiency as you tear your way through room after room, leaving a trail of blood and tears (but mostly blood) in your wake. Grab your freedom by the throat and never let go.</p>\n<br/>\n<p><em>Gone Viral</em> features randomly-generated levels, over-the-top violence, and physics-based combat that thrives on combos to unleash devastating brutality on your enemies. Become the apocalypse’s greatest SOCIAL MURDIA STAR as you amass a following in-game or IRL. “IRL!?” you say? That’s right! Now introducing Twitch Integration that lets you invite your audience to take part in the world of <em>Gone Viral</em> as Fans who can vote to either help or hinder you.</p>\n<br/>\n<p><strong>Feature List</strong></p>\n<p>• <strong>Killer Combos</strong> - Annihilate enemies by ricocheting them off walls, smashing them into each other, or shoving them into bone-crunching traps.</p>\n<p>• <strong>Kills = Fans</strong> - The flashier your combos and the more mayhem you unleash, the more likes and followers you’ll get!</p>\n<p>• <strong>Fans = Upgrades</strong> - Sate your fans’ parched throats with FOUNTAINS of blood and they’ll reward you with amazing upgrades!</p>\n<p>• <strong>Homicidium ad Infinitum</strong> - With endless combinations of mutations and attacks, each unique experience in the arena is as death-defying as the last so you can MURDER FOREVER</p>\n<p>• <strong>Blood Stream</strong> - Real-life audiences introduce another layer of interaction to the experience as they vote to help (or hinder) you in your killing sprees.</p>", "metacritic": null, "released": "2020-07-27", "tba": false, "updated": "2020-07-31T06:34:26", "background_image": "https://media.rawg.io/media/screenshots/454/454305d63e8b190bd2890445ce66b904.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 492, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Akupara Games"], "genres": ["Action"], "publishers": [], "esrb_rating": null}