{"id": 47468, "slug": "the-dungeon-of-destiny", "name": "The Dungeon of Destiny", "name_original": "The Dungeon of Destiny", "description": "The universe of <strong>\"The Dungeon of Destiny\"</strong> is a dark fantasy world with magic where people fight with evil creatures for the survival. Chaos rules here. Bloody wars for territories between clans and orders, deadly diseases and famine.<br/><br/><br/><br/>    Our hero is kidnapped by the Dark Order and is thrown into the Maze. He is not alone there and soon he meets others who were kidnapped without any reason. In the dungeon people have built the camp with merchants and have created their own currency. It is really dangerous to visit the Maze because every time you step into it the new Maze generates and nobody knows where is the Maze's energy source.<br/>The survivors are made to live in tiny room and eat rats. All who dared to go beyond the room no longer returned. Perhaps it is you who can change the fate of prisoners.<br/><br/>Our goal is to leave this unknown even to its inhabitants place whatever it takes to do this. The Maze is very dangerous and some creatures inside are no quite friendly to us - in fact they will probably try to eat you at the exect moment they see you.<br/><br/>     The gameplay is a bagel with RPG elements. Where the player is to get out of the dungeon to the surface along the way performing quests and passing the storyline. In the game you will be met by various kinds of monsters, riddles and traps. An ominous atmosphere accompanied by sounds of unknown origin will not let you fall asleep, even when you feel safe.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:04:18", "background_image": "https://media.rawg.io/media/screenshots/411/411a392dba5802693979a90c340efebb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 33}, "playtime": 4, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 176, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["LEVER Software"], "genres": ["RPG", "Indie"], "publishers": ["LEVER Software"], "esrb_rating": null}