{"id": 47464, "slug": "wall-street-junior", "name": "Wall Street Junior", "name_original": "Wall Street Junior", "description": "It dazzles us all - the world of trading, the trick of being able to trade paper and promise for money, the art of creating something of value from virtually nothing.<br/><br/>Wall Street Junior is a simulation game based on an equilibrium-targeted, event-driven model of economy and financial markets. The simulation evaluates the performance of economy's components and predicts the state of markets accordingly. Players have the option of interacting with the markets and trying out different investment strategies, yet to be successful in such one has to be aware of the current situation on the exchange floors and constantly keep up with the news not to miss anything that might render his investment invaluable.The Freedom of SimulationYour behavior on the market, as of a player, is entirely up to you; one may choose to buy a bunch of stocks today and sell them tomorrow with a profit, go for bonds while speeding up the simulation a little to receive the coupon payments claiming profit on the long run, or don't bother with the instrument trading at all and place their bets in the form of options that will expire one day with a (hopefully significant) premium. Some investments may, however, bear some risk, and it is then reasonable to hedge against inconvenient market moves in order to lessen the possible negative outcomes.Extensions to the Original ModelApart from the vanilla trading of instruments, currencies and derivatives, your company is fully capable trading on margin, offering loans to ordinary customers and issuing fixed-income securities on its own. These ways of raising capital give you the ability to operate with creditors money, thus maximizing the profits, but everything comes at a price and the interest responsibilities might one day present a significant burden, if not issued with care.<br/><br/>The game features a set of tutorials, campaign scenarios and a sandbox mode. The tutorials are written in an easy-going fashion, not going into much detail but covering all necessary topics and providing references to external resources discussing those of lesser importance. Campaign scenarios are merely a guided set-up with limitations regarding the options you have. The sandbox mode is stripped of all limitations and allows you to experiment on the simulation, with no exception of bringing companies on the brink of bankruptcy.Development DecisionsWall Street Junior was developed with the specific intentions of making a realistic simulation. These intentions had the positive effect of the game becoming (at times literally hand-) editable and easy to be modded, with the rather negative side effect of the user interface becoming complicated at the first sight. The game is in the Alpha stage and we actively encourage all player feedback to help us correct undesired behavior of the simulation and improve all the parts that might require further clarification.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:04:18", "background_image": "https://media.rawg.io/media/screenshots/d25/d253f6110c4f76b36597a4e1ef238f71.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 18, "ratings_count": 0, "suggestions_count": 124, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["WSJ Team"], "genres": ["Strategy", "Simulation", "Casual", "Indie"], "publishers": ["WSJ Team"], "esrb_rating": null}