{"id": 47461, "slug": "oceans-crabellum", "name": "Ocean's Crabellum", "name_original": "Ocean's Crabellum", "description": "<strong>Shoot 'em up! The former soldier Crab have to holster up his old Parabellum guns. He must wreak massive havoc to clean up the Big Ocean from villains and get revenge for his friends. Destroy the unrestrained mafia gang led by giant octopus in the best tradition of top-down and scroll-action shooters. </strong><br/><br/>But old Crab is not alone. His longtime friend Turtlon, his comrade-in-arms, will help you on that battlefield. Will you be able to smash all the enemies and inscribe your names in the Oceanic Book of glory?<br/><br/>In addition to Parabellum there will be more weapons in your arsenal: Ingram, Shotgun, Auto Shotgun, Machinegun and even Bazooka.<br/><br/>This cocky gang has come to believe in their exclusivity and omnipotence so strongly that they found a way of self-cloning. These rascals continually multiply with caviar, which they cultivate in themselfs. And as if the Big Ocean itself helps you to clear the territory periodically generating super-buffs and inspiring fear and trembling in the souls of your enemies.<br/><br/>...“Enough! I'll find 'em, then I'll find their boss... and I'll spill the caviar of his henchmen right to his feet. And then I'll kill him. It's time to put an end to their oppression. Nobody can't stop me!”...<br/><br/> Let's go, glorious soldier! In the name of water and arthropods!", "metacritic": null, "released": "2017-10-24", "tba": false, "updated": "2019-08-28T22:04:18", "background_image": "https://media.rawg.io/media/screenshots/02e/02e6e066b8346a2fa1be6330addc9cc0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 4, "achievements_count": 22, "ratings_count": 1, "suggestions_count": 105, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Crabellum Games"], "genres": ["Action", "Indie"], "publishers": ["Crabellum Games"], "esrb_rating": null}