{"id": 474626, "slug": "advance-civ-wars", "name": "Advance Civ Wars", "name_original": "Advance Civ Wars", "description": "<p><strong>Elève Premium de Gamecodeur : </strong>Depuis 2 mois exactement aujourd'hui !<br/><strong>Langage et Framework utilisé : </strong>Lua / LÖVE2D</p>\n<p><strong>Codé par : </strong> Mashadar</p>\n<p><strong>Graphismes par : </strong>8bee pour la majeure partie, et quelques pixels arts de moi même ( vous verrez la différence, j'en suis certain !)<br/></p>\n<p><strong>Utilisation de libraires et codes externes : </strong>Non<br/></p>\n<p><strong>Temps passé : </strong> Environ 50 heures<br/></p>\n<p><strong>Petit postmortem:</strong> <br/></p>\n<p>J'ai le plaisir de vous présenter mon premier jeu après ces deux premiers mois de formation avec Gamecodeur! Il s'est fait dans la sueur, le code en ferait surement sauté quelques uns au plafond, mais je suis heureux de pouvoir vous présenter un jeu fini!</p>\n<p>Ce projet a été réalisé lors de la Game Jam #26 de Gamecodeur. Il s'agit d'un jeu de stratégie multijoueur en local au tour par tour mêlant des fonctionnalités d'Advance Wars et d'autres jeux de stratégie tels que Civilization ou Starcraft! Je n'ai pas cherché dans l'originalité pour mon premier essai et suis donc resté fortement ancré dans le thème. J'ai voulu mettre l'accent au maximum sur le code afin de me challenger et de mettre en pratique les quelques connaissances que j'ai commencé à acquérir. <br/></p>\n<p>Je m'excuse d'avance devant la faiblesse des graphismes que j'ai pu ajouter et l'absence de sons.  Je m'y attellerai lors d'un prochain projet !</p>\n<p><strong>Quelques points concernant mon jeu :</strong></p>\n<p><strong>--&gt; </strong>Le <strong>but</strong> <strong>du jeu </strong>est tout simplement de capturer le QG de l'équipe adverse</p>\n<p><strong>--&gt; </strong>Trois types d'unités sont présents (Infanterie, Tank, Hélicoptère)<br/></p>\n<p><strong>--&gt; </strong>Les unités gagnent de l'expérience au fur et à mesure des combats et deviennent plus résistantes.</p>\n<p><strong>--&gt; </strong>Vous gagnez de l'argent à chaque tour.  Plus vous capturez de villes, pour ces revenus augmentent (<strong>s</strong>euls les infanteries peuvent capturer les bâtiments!).</p>\n<p><strong>--&gt; </strong>La résistance des unités varient en fonction de l'élément où elles se trouvent.<br/></p>\n<p><strong>--&gt; </strong>Présence d'un brouillard de guerre.</p>\n<p><strong>--&gt;</strong> Possibilité de capturer des tours d'observation pour gagner un avantage stratégique au niveau de la vision !<br/></p>\n<p>J'espère que vous prendrez du plaisir à tester mon jeu tout autant que j'ai pris à le faire! ;)<br/></p>", "metacritic": null, "released": "2020-07-27", "tba": false, "updated": "2020-07-31T06:39:56", "background_image": "https://media.rawg.io/media/screenshots/647/647fa82d54ddadbef030408bda80c989.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 71, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mashadar"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}