{"id": 474683, "slug": "i-wanna-go-home-dmitrysl", "name": "I wanna go home (dmitrysl)", "name_original": "I wanna go home (dmitrysl)", "description": "<p>Everyone: this is our buddy Vif the bug. He lives in a cozy house that he built for himself inside the owner's apartment. Every morning, Vif goes on a long and dangerous journey through a huge room to walk and get food. He often gets into trouble, and only you can get him out of it. Move the beetle around the playing field, jump and climb on objects, move them, turn on and off electrical appliances and watch how they interact. On the way, try to eat as many delicious flies as possible, they may be useful in the future. Unfortunately, not everyone likes bugs in the house. The owners throw slippers at him and try to crush him! Jump and dodge! In its journey, The Vif of constancy meets various objects. Some of them are special and keep their secrets, sometimes funny, sometimes dangerous! Despite everything, Vif is not discouraged and believes that everything is in his paws and your hands!!!<br/></p>\n<p>Features:<br/>Free game<br/>Mobile platformer with realistic physics and logical tasks<br/>Nice graphics<br/>Cute character<br/>Many options for passing the level<br/>A variety of ways to use in-game items<br/>Funny sounds</p><p><strong>P.S.</strong> Hey everyone. I've been working on that game for three  years already and started it when I was in high-school. Your comments are welcome!<br/></p>", "metacritic": null, "released": "2020-07-27", "tba": false, "updated": "2020-07-31T06:55:32", "background_image": "https://media.rawg.io/media/screenshots/f2d/f2dced184a151981d53f7becbca84aa8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 116, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["dmitrysl"], "genres": ["Action", "Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}