{"id": 474831, "slug": "dust-game-testbuild-1-game-settings", "name": "Dust Game Testbuild 1 - Game Settings", "name_original": "Dust Game Testbuild 1 - Game Settings", "description": "<p>Music game where you can move into sound agents to change the levels of the track!</p>\n<p>Lots of sliders to let you customise the game and give feedback on your preferred settings.</p>\n<p>Player behaviour: Changing between 1 and 2 affect how your right click interaction works. On 1 by default you can interact with enemies and boost the sound, and right clicking lets you move past them (or delete them if you dash into them) without boosting the sound. Changing to 2 inverts this behaviour. So by default you don't interact with enemies and right clicking will let you do so for a limited time.</p>\n<p>Enemy (Sound Agent) Movement: Changes how the enemy movment works subtly. On Enemy movement 1 their speed is more consistent and you have to shove past them in the inactive (player beharviour 1 right click) state. On enemy movement 2 you can more easily shove them out of the way when in your limited inactive state.</p><p>doesn't affect too much, one way lets you more easily move sound agents out of the way, the other you have to shove past them<br/></p>\n<p>Sound object speed: choose how fast the sound agents that chase after you move. Maybe moving really quickly works well if they spawn infrequently</p>\n<p>Spawn Delay: Directly affects how often things spawn</p>\n<p>Spawn Variance: Makes the difference in spawn rate more random 0= no randomness or variance</p>\n<p>Spawn Change: Changes how much the spawn rate is effected by how many sound agents are on screen, as well as how many of each type of sound agent is on screen in proportion to the total amount</p>", "metacritic": null, "released": "2020-07-27", "tba": false, "updated": "2020-07-31T07:27:22", "background_image": "https://media.rawg.io/media/screenshots/1f3/1f34b6b613222116f3f3160d2f68e06e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 18, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Rugeon"], "genres": [], "publishers": [], "esrb_rating": null}