{"id": 47488, "slug": "reginald-does-his-thang", "name": "Reginald Does His Thang", "name_original": "Reginald Does His Thang", "description": "Reginald Does His Thang is a 2D platformer in which Reginald sets out to gather scattered pages for his grandfather's final recipe. In a surreal land where cannibalism, projectile vomiting, and neurological diseases are commonplace, Reginald must chop, shoot, explode, masticate and vomit his way toward discovering what terminal culinary masterpiece Grampinald is scheming to cook.<strong>Key Features</strong><br/><ul><li> <strong>Perma-corpse</strong> : Reginald's expired bodies linger, allowing you to build corpse piles to clamber over, create safe spots for traversing spike fields, and even consume Reginalds of the past for health and... stomach ammunition. <br/><br/></li><li> <strong>Consume</strong>: Eat whatever you can find to fill your stomach... enemies, rabbits, longpigs, Reginald's own corpses, pies, bacon, etc., and then...<br/><br/></li><li> <strong>Regurgitate!</strong>: Vomit on command to stun enemies, cover spikes, and generally annoy Reginald's neighbors.<br/><br/></li><li> <strong>Expand your palette</strong>: Certain cuisines will grant Reginald a stomach full of flaming fire vomit or freezing ice vomit.<br/><br/></li><li> <strong>Help Grampinald</strong>: Explore 23 levels searching for about 57 recipe pages in a concisely expressed gameworld that introduces new mechanics as progression is made. </li></ul><br/>", "metacritic": null, "released": "2017-11-21", "tba": false, "updated": "2019-08-28T23:26:16", "background_image": "https://media.rawg.io/media/screenshots/e01/e012fb7a3faf60a2518ff23675889c07.jpg", "website": "http://www.reginalddoeshisthang.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 291, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Epic Banana Games"], "genres": ["Action", "Adventure", "Indie", "Platformer"], "publishers": ["Epic Banana Games"], "esrb_rating": null}