{"id": 47497, "slug": "ju", "name": "JU", "name_original": "JU", "description": "Hello there!<br/>This is my first game on Steam. And the game's name is JU.how to Play?Use KEY WSAD(or ↑↓←→) to control the green cube move to the red area. Don't worry too much about operation, it's really easy. But you should be really careful about the path you choose, because there are some path traps in the game, such as an endless loop.Features:<ul><li>80 Levels<br/></li><li>4 play rules:<br/></li><li>1.Basis rule (Level 1 - 20): Move green cube to the end area(the red block). When you use key to move the green cube, it just keep moving until touch a block-wall. <br/></li><li>2.Following rule (Level 21 - 40): Beside the basis rule, the end area will move when you try to move the green cube. So you should think about the strategy: move the green cube or end area as a chief way. <br/></li><li>3.Twins rule (Level 41 - 60): Beside the basis rule, there will be two green cubes in the game, and two end areas. And be careful: When the green cubes touch each other, they will become one entirety.<br/></li><li>4.Zu rule (Level 61 - 80):  Beside the basis rule, you will find a few green area which will move one block. What you need to think is that move to the end area before anyone of the green areas moves to the left-end-area. And be careful: You need move to the every blue block one time, or the end area will be blocked. This rule could be a little hard, remember it: Think before Move.</li></ul>why Choose Ju As Game's Name?Actually, it is the name of a piece in Chinese chess. When I played Chinese chess whit my uncle, it suddenly occurred to me that why not add the rule of JU to a simple maze map. So I made this game, JU.<br/><br/>Have Fun.", "metacritic": null, "released": "2017-10-18", "tba": false, "updated": "2019-08-28T22:04:17", "background_image": "https://media.rawg.io/media/screenshots/875/875019a0123a71097e5a8386a331a74c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 5, "toplay": 1}, "playtime": 2, "achievements_count": 8, "ratings_count": 0, "suggestions_count": 43, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["张公子"], "genres": ["Indie"], "publishers": ["张公子"], "esrb_rating": null}