{"id": 474952, "slug": "a-fourth-wall", "name": "A Fourth Wall", "name_original": "A Fourth Wall", "description": "<p><em>A Puzzle Game With Many Unique Twists and A Narrator</em></p>\n\n<p><strong>PLEASE READ:</strong></p>\n<p><strong>CONTROLS:</strong></p>\n<p>Arrow Keys To Move</p>\n<p>Space Bar to Jump</p>\n<p>\"E\" to pick up boxes</p>\n<p>\"R\" To use the GDS (once you obtain it)</p>\n<p>Warning, There are Some Known Collision Errors. I spent a full hour trying to patch all of the bugs. Please be advised that you might be able to clip out of bounds if you try really hard.</p>\n\n<p><strong>GAME SCRIPT: (WARNING SPOILERS) (Only Read If Cannot Understand the Narrator)</strong></p>\n<p>A Fourth Wall - Game Script</p>\n<p><strong>Intro:</strong></p>\n<p>Hey, thanks for choosing to play my game. Before you click off because this is just another platformer puzzle game, I would want to show you a couple things that might make you want to stick around. For now let's just get started with a simple puzzle to let you understand the mechanics. </p>\n<p><strong>First Puzzle Done. Start Of Second Puzzle:</strong></p>\n<p>Hey good job! You completed the first puzzle, now im going to show you a device that will let you do some pretty cool stuff. I present to you...the anti matter anti gravity changing field! Now your not in possession quite yet of the actual device that lets you change gravity at your own will, but run into this for now and it will have a similar effect.</p>\n<p><strong>Second Puzzle Done. Start of Third Puzzle:</strong></p>\n<p>Good job! You now have basic knowledge on the anti matter anti gravity changing field! Complete this puzzle and il give you access to the full device for some future puzzles.</p>\n<p><strong>Third Puzzle Done. Get The GDS. Fourth Puzzle Start:</strong></p>\n<p>Alright, you finally came this far. See? I told you that you would want to stick around. Anyways, here is the anti matter anti gravity changing field portable device system ™ ! For the sake of both of our ears, I will now be calling it the GDS (Gravity. Device. System.) Alright, onto some more testing, only this and 2 more puzzles before your next big surprise! </p>\n<p><strong>End Game:</strong></p>\n<p>Surprise! I didn't really expect anyone to make it this far to be honest. So surprise, there is no end of the game. Here il just program this confetti in. There you go! Good job on completing the game. Now, this ending will never change, considering I only had 3 hours to make this game. Hey player, thank you so much for playing my game it really means a lot to me. So uh, here goes a restart, Have fun! </p>\n<p> </p>", "metacritic": null, "released": "2020-07-27", "tba": false, "updated": "2020-07-31T07:58:55", "background_image": "https://media.rawg.io/media/screenshots/dd9/dd9bf8e8ec0d149e5bc4d3e8818681b6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 6, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["NotTofuFood"], "genres": ["Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}