{"id": 47506, "slug": "meltys-quest", "name": "Meltys Quest", "name_original": "Meltys Quest", "description": "<p>Meltys Quest is about the journey our protagonist, Princess Meltys takes to save the world. Meltys is a girl who has fooled around all her life, not giving a hoot about anything but herself. But one day the Grolido Monster Empire invades her country, destroys her home, and kidnaps her three sisters. With no castle and no one else to call for help, Meltys decides,<br />\n&quot;Well, I&#39;ll like somehow fix everything!&quot;<br />\nPlease warmly watch over Meltys and guide her on this light-hearted, sometimes comical, and sometimes serious, but always erotic, quest to save the world.<br />\nFeatures<br />\nOver 50 scenes with full screen CGs<br />\nOver 20 costumes for Meltys to dress up in<br />\nMultiple endings<br />\nDifficulties<br />\nKogal Mode - Recommended for players who want to experience the game&#39;s plot and &quot;plot&quot; as soon as possible.<br />\nPrincess Mode - Recommended for players who want a little extra gameplay challenge.<br />\nControls<br />\nMeltys Quest can be played using keyboard only, mouse plus keyboard, or XInput game controller.<br />\nHowever, it is recommended that you have access to a keyboard during the scenes for the keyboard-only functions.<br />\nNote<br />\nMeltys Quest is made with RPG Maker MV, which isn&#39;t known to work well with older computers or laptops. Please make sure to test the game out first.</p>", "metacritic": null, "released": "1993-05-10", "tba": false, "updated": "2023-02-08T10:43:57", "background_image": "https://media.rawg.io/media/screenshots/987/987d2f815e060bbead46b19135f2cda7.jpg", "website": "https://www.patreon.com/remtairy", "rating": 4.32, "rating_top": 5, "added_by_status": {"yet": 6, "owned": 49, "beaten": 7, "toplay": 4, "dropped": 2, "playing": 3}, "playtime": 8, "achievements_count": 38, "ratings_count": 17, "suggestions_count": 458, "game_series_count": 0, "reviews_count": 19, "platforms": ["PC"], "developers": ["Remtairy", "Happy Life"], "genres": ["RPG"], "publishers": ["Remtairy"], "esrb_rating": "Adults Only"}