{"id": 475001, "slug": "heroes-in-a-hurry", "name": "Heroes in a Hurry", "name_original": "Heroes in a Hurry", "description": "<p>Four RPG heroes have fallen into a fiendish trap... Now they must grind like they've never ground before, and they've only got eight minutes to make it! No time for combat transitions, fancy moves or much of anything besides barreling into enemies and hoping not to die!<br/></p>\n<p>Your goal is to find and defeat enemies of your own level or above, gain delicious XP and level up as fast as you can. Beware, for if you run into a monster stronger than you, you will lose a heart. But luckily, you may recover at the healing fountain at the entrance, and the friendly shopkeeper has some gear on offer that will surely come handy in your quest.</p>\n<p>Controls: WASD or arrow keys, mouse to buy shop items</p>\n<p>Programming and concept by Fredison<br/>Art by SinigangShake<br/>Audio by dnebesh</p><p>Version 1.1 changes:<br/>-Made the heroes catch up to the others faster when they get split from the party (except the Fighter, who is still a total slowpoke, but luckily the game lets you do something about that!)<br/>-Upped the font size on the enemies' level<br/>-Changed the enemy color-coding to make them more distinct<br/>-Zoomed out the camera a bit<br/>-Fixed the shop interface so it wouldn't look tiny on fullscreen, tweaked it to hopefully be a bit more readable<br/>-Added sound effects for taking damage and healing up at a fountain</p>", "metacritic": null, "released": "2020-07-27", "tba": false, "updated": "2020-07-31T08:09:06", "background_image": "https://media.rawg.io/media/screenshots/355/3556673811c089a2b1b52373ee7079d5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 29, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["SinigangShake", "Fredison", "Dmytro Nebesh"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}