{"id": 475122, "slug": "cube-itch-adc", "name": "CUBE (itch) (adc)", "name_original": "CUBE (itch) (adc)", "description": "An interactive tribute to the 1997 sci-fi horror film by Vincenzo Natali.\r\n<p><em>You play as a random stranger who wakes up in an alien-looking, symmetrical cube-shaped room with a hatch and ladders on each side of the room leading to other cube-shaped rooms. Your goal is to make your way through the maze of cubes, but there's a catch: some rooms are rigged with deadly traps. While trying to find the exit, you have to also find a way to tell the trapped rooms apart from the safe ones.</em></p>\n\n<p>Currently this version is for exploring and testing the environment, as well as for users to share feedback and report bugs. The future versions are expected to have:</p>\n<ul><li>Multiplayer</li><li>A LOT more traps</li><li>Way out</li><li>VR compatibility</li><li>More item uses</li><li>Story, hidden details (messages you can find in the cube)</li><li>Extras</li></ul>\n<p>The cube is randomized completely, which is why the current version doesn't have an exit (I'm currently trying to figure out a logical way to implement it, because the movie had a hard-coded logic to it while this one is randomized, so I can't apply movie logic)</p>\n<p>BTW: This game was made with HDRP, so ancient/weaker devices may not be able to run this at 60FPS because HDRP focuses on better visual quality. The game has been optimized as much as possible, but in case the game runs slower, that's why (there is still room for improvement though). You do have the option to disable effects in case it helps.</p>", "metacritic": null, "released": "2020-08-03", "tba": false, "updated": "2020-08-03T02:43:49", "background_image": "https://media.rawg.io/media/screenshots/a99/a999d4b090b4eab7109e5fe19c6730ab.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 148, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["adc"], "genres": ["Adventure", "Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}