{"id": 475158, "slug": "harry-potter-and-the-nlp-generated-visual-novel", "name": "Harry Potter and the NLP Generated Visual Novel", "name_original": "Harry Potter and the NLP Generated Visual Novel", "description": "<p>A short and silly story about Harry and his friends at Hogwarts, featuring 3 possible romantic pairings. Plot is completely NLP generated, and some quotes are NLP generated. 100% fanfiction.</p>\n<p>This is a short visual novel created by Meggie Cheng and Allison Kim during a class they took at the University of Pennsylvania, CIS 700: Interactive Fiction and Text Generation. The entire plot of the novel was generated using Natural Language Processing (NLP), specifically GPT-2 trained on various Harry Potter canon plots and Harry Potter fanfiction from fanfiction.net. Some of the quotes in the script were also NLP generated.<br/></p>\n<p>Background art, main character sprites (Harry, Hermione, Ron, Draco), and half of the writing and coding credits go to Meggie Cheng (Tauntybird).</p>\n<p>Side character sprites (Hagrid, Sirius, Voldemort, Death Eater), and half of the writing and coding credits go to Allison Kim.</p>\n<p>The <strong>HarryPotterNLPVN-Plot.pdf </strong>file contains the original, unedited plot generated by a trained language model. Feel free to read it once you finish the VN :)</p>\n<p>Disclaimer: Harry Potter does not belong to Meggie or Allison. This is a work of fan fiction using characters from the Harry Potter world, which is trademarked by J. K. Rowling. All rights reserved.</p>", "metacritic": null, "released": "2020-08-02", "tba": false, "updated": "2020-08-03T02:53:30", "background_image": "https://media.rawg.io/media/screenshots/761/76187b3f082f155b53f0c53c64f70bfe.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 209, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["TauntyBird"], "genres": [], "publishers": [], "esrb_rating": null}