{"id": 47515, "slug": "into-oblivion", "name": "Into Oblivion", "name_original": "Into Oblivion", "description": "<strong>Into Oblivion is a drinking contest</strong> akin to drunken Scrabble. Each player selects up to seven different ingredients each round and attempts to make one of many mixed drinks for themselves or their opponents.  Some drinks have additional status effects, some leave a nasty residue behind for the next player.<br/><br/><br/><br/><strong>Legend has it</strong> that this mysterious marvel of engineering known the Pocket Brewer was invented by Dr. Cyrus Stansfield as a means of keeping the homeless away from his dental office's parking lot. Some say it was crafted by the government to subdue the masses of Starkham. Others say some highly motivated drunks cobbled it together when the Noose &amp; Rafter briefly shut down for the summer. Regardless of how it happened, it has allowed the denizens of the town to easily make dangerous alcoholic drinks and hold all-too frequently drinking contents.<br/><br/><strong>The game takes place</strong> in various seedy locations through the city of Starkham (prominently featured in our previous games) and against some of it's better known inhabitants.  Players can customize their character as well as challenge friends in different multiplayer matches.  Bet on your matches directly, or spectate on other people's match and bet, to gain money to buy upgrade, cosmetic skins, and items from the local Shady Merchant.<br/><br/><br/><br/><strong>The game has the following features</strong> best laid out in list format with snappy phrases like:<br/><br/><ul><li> Face off against five different characters in story mode<br/></li><li> Various outfits, hair styles, and accessories<br/></li><li> Soundtrack by Macabre Gandhi and David Totten<br/></li><li> Online and LAN multiplayer up to 4 people<br/></li><li> Personal and global statistics on debauchery<br/></li><li> A leaderboard system of true alcoholics<br/></li><li> Over 50 items to mix, match, and drink<br/></li><li> Over 100 mixed drink recipes<br/></li><li> Over 15 temporary buffs to save your hide<br/></li><li> Over 15 Residues to sabotage your opponent<br/></li><li> Drink in various locations around Starkham<br/></li><li> Bet against friends and foes to acquire coins<br/></li><li> Upgrade and unlock gear at the Shady Merchant's shop<br/></li><li> 30 achievements to obtain</li></ul><br/><br/><br/><strong>The game features online and LAN cross-platform multiplayer</strong> for Linux, Mac, and Windows so you can drink your buddies under the table no matter what operating system they use.  Watch matches as a spectator and bet on the winner either through pot bets or side bets. Or get into the action yourself in one of four different game modes; each with a subset of rules.<br/><br/><strong>Spectators can also</strong> rolls dice as they wait for a match to end or even try to influence the outcome through devious methods.<br/><br/><br/><br/><strong>Similar to the \"Street Loyalty\"</strong> features of our last game, The Dope Game, there are some small bonuses for players of our other games. Mostly of the cosmetic variety.  Each game played unlocks a different skin set to mix and match with the ones you have already.  If you haven't played any of our previous games, fear not, you'll only have to spend a little coin to get them as well.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:04:16", "background_image": "https://media.rawg.io/media/screenshots/d64/d64b027521cfde48b906aad75ee3108a.jpg", "website": "http://into.coaguco.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 217, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC", "macOS"], "developers": ["CoaguCo Industries"], "genres": ["Strategy", "Simulation", "Casual", "Indie"], "publishers": ["CoaguCo Industries"], "esrb_rating": null}