{"id": 47517, "slug": "transports", "name": "Transports", "name_original": "Transports", "description": "Play against your opponents and build your own transport empire.<br/><br/><br/>Build trucks, buses, ships, planes, trains, trams, maglevs, helicopter ans zeppelins to transport goods and passengers between industry buildings and cities.<br/><br/>Renew your transport vehicles and replace them with better versions. Manufactories will offer you exclusive and special vehicle variants which will give you benefits.<br/><br/>You can research vehicle improvements to increase the efficiency of your vehicles.<br/><br/><br/>Play with up to 20 computer opponents on huge procedurally generated maps.<br/>Sabotage your opponents or make agreements to prevent sabotage acts against your transport routes. Cooperate with them to provide cities as quickly as possible or buy unpleasant competitors.<br/><br/><br/>Help cities grow by satisfying their needs for goods, food and luxury goods. Big cities provide more passengers which can be transported to nearby cities profitably.<br/><br/><br/>Transport 40 different goods between 39 different industries and numerous cities.<br/>Keep your station stock low to get a production bonus from industry buildings. Deliver machinery and tools to industry buildings to get a production boost for a short period of time.<br/><br/><br/>Play user created content or create your own content.", "metacritic": null, "released": "2017-11-23", "tba": false, "updated": "2019-08-28T22:04:16", "background_image": "https://media.rawg.io/media/screenshots/00a/00a8f2cdf669c50c6061f1ba10696a8a.jpg", "website": "http://www.transports-game.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 5, "toplay": 1, "dropped": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 142, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Jens P. Behrens"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["Jens P. Behrens"], "esrb_rating": null}