{"id": 475135, "slug": "imponderabilia", "name": "Imponderabilia", "name_original": "Imponderabilia", "description": "NOTES: \r\n<p>This game was made as a project for class in the Spring of 2020 by Aidan Takami (Engineer &amp; Designer) Alan Karbachinsky (Level Design) and Mac Coulter(Main Menu). Character art and animations provided by Shad.din. </p>\n<p>Mac Build is unable to be tested by us, so please report any issues and I'll try my best to fix them.</p>\n<p>Special thanks to Shad.din, very kindly providing us with custom animations for 4 directional walking.</p>\n<p>Environmental art purchased from GuttyKreum.</p>\n\r\nImponderabilia\r\n\n<p>Imponderabilia experiments with non traditional keyboard mechanics in 3 diverse minigames, all of which are created to replicate the experience of making sushi!<br/></p>\n\r\nThe 3 \"Minigames\"\r\n<p><strong>Rice Maker</strong>: Imagine you are making rice. You must rinse the rice a certain amount before cooking it! </p>\n<p>Before the game: Press space bar to increase the amount of rice you will be cooking! The more you cook, the harder it will be to clean the rice without losing some! </p>\n<p>The Game: Use the W A S D keys to \"rinse\" the rice,  and the space bar to drain the dirty water. The status bar will serve as your guide to this. It will show the amount of water and rice in your bowl, as well as the cleanliness of your rice. It will start as red, but once it is green, you have properly cleaned the rice and can press \"Enter\" to cook the rice!</p>\n\n<p><strong>Sushi Roller</strong>: You are now rolling the rice with the fish, to prepare the roll before you cut it!</p>\n<p>Before the game: Be ready to press multiple keys with your left hand. Notice how many \"rice\" you have made in the bottom right corner. This is how many times you can play this game</p>\n<p>The Game: Press and hold Q, then W, then E. Now, while holding all three, roll the sushi log towards yourself, dragging your fingers down from the QWE keys, to the ASD keys, to the ZXC keys. Do this 3 times! Then prepare for the countdown to compress the log of sushi (this is the part where you press down as many keys as you can with your left hand). A score will pop up after, telling you how many keys you had pressed when the timer hit zero. The score you accumulate here will be what decides your score.</p>\n\n<p>\n</p>\n<p><strong>Maki Maker</strong>: Final step! Cut the logs of sushi you've just made!</p>\n<p>Before the game: prepare your left hand and finger of choice to \"catscratch\" across the keys with (you will be dragging your finger downwards along the specified column on your keyboard).</p>\n<p>The Game: Press Q, then drag your finger down the keys towards yourself, hitting A then Z. Do this for each column of keys (W. E. R, T). You will do a total of 5 cuts, and then you have prepared a sushi roll to be served!</p>\n\n<p>Putting out the \"order\": Go to the red bin on the ground and press C to submit all the completed Maki you have.</p>", "metacritic": null, "released": "2020-08-02", "tba": false, "updated": "2020-08-03T02:46:47", "background_image": "https://media.rawg.io/media/screenshots/c47/c4712cbd95e5cf2d806a9f081e553e79.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 18, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["aidantakami"], "genres": [], "publishers": [], "esrb_rating": null}