{"id": 47521, "slug": "hotline-miami-collection", "name": "Hotline Miami Collection", "name_original": "Hotline Miami Collection", "description": "<p>The Hotline Miami Collection includes both the first Hotline Miami and Hotline Miami 2: Wrong Number.<br />\nHotline Miami is a high-octane action game overflowing with raw brutality, hard-boiled gunplay and skull crushing close combat. Set in an alternative 1989 Miami, you will assume the role of a mysterious antihero on a murderous rampage against the shady underworld at the behest of voices on your answering machine.<br />\nHotline Miami 2: Wrong Number is the brutal conclusion to the Hotline Miami saga, set against a backdrop of escalating violence and retribution over spilled blood in the original game. Follow the paths of several distinct factions – each with their own questionable methods and uncertain motivations – as unforeseen consequences intersect and reality once again slips back into a brilliant haze of neon and bloodshed.<br />\nPurchasing this content entitles you to the PS3™, PS4™, and “PS Vita” versions!<br />\nn/a<br />\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.<br />", "metacritic": null, "released": "2017-10-10", "tba": false, "updated": "2024-01-06T07:20:21", "background_image": "https://media.rawg.io/media/screenshots/dbd/dbd5e6cda6aaab59be768eaef58a8a2f.jpg", "website": "", "rating": 4.41, "rating_top": 5, "added_by_status": {"yet": 8, "owned": 51, "beaten": 12, "toplay": 12, "dropped": 6, "playing": 5}, "playtime": 0, "achievements_count": 64, "ratings_count": 17, "suggestions_count": 135, "game_series_count": 0, "reviews_count": 17, "platforms": ["Xbox One", "Nintendo Switch", "PlayStation 4"], "developers": ["Devolver Digital", "Dennaton Games"], "genres": ["Action"], "publishers": ["Devolver Digital"], "esrb_rating": null}