{"id": 475253, "slug": "optimization-quest", "name": "Optimization Quest", "name_original": "Optimization Quest", "description": "Description\r\n<p>Do you like grinding in RPGs, spending all your time gaining money and experience to take down the toughest foes? Do you dread the long walks between towns hunting tirelessly for new monsters to slay? Are you tired of hand-holding combat systems that never return 0? Welcome to Optimization Quest! An RPG Battle Simulator with rogue-like elements.<br/></p>\n<p>In this game you start with no items, no equipment, and you must make it to the end of the dungeon and kill the fearsome dragons that dwells deep within! All items are earned as rewards for killing enemies. Not every enemy will drop an item, but every enemy that does will only drop 1. There is a system in place so that if you have to chance to get a weapon or armor that will be prioritized over usables.<br/></p>\n<p>No walking from town to town, no getting lost in labyrinthian dungeons begging to find the boss chamber. Just pure, relentless RPG battle madness.</p>\r\n Controls\r\n<ul><li><strong>Arrows:</strong> Menu Cursor</li><li><strong>Z:</strong> Cancel</li><li><strong>X:</strong> Select</li></ul>\r\nHow to play\r\n<p>The game is very simple, progress through the battle simulation until you either cannot go any father, or have successfully killed the dragon. There is no fleeing from encounters, and due to the random nature of the game using an item does not waste your turn. If you need to heal, don't be shy, but also don't be too wasteful. Each kill will earn you gold and experience, the goal is to get as much gold as you can before you perish.<br/></p>\r\nUseful Tips\r\n<p><strong>Nil Damage</strong><br/>The player always has a chance of doing 1 damage if the damage roll is 0. No matter how difficult your enemy is, you will always have the chance of killing it. If you see multiple 0's in a row that is just an extreme happenstance of the RNG. You will always have the <em>chance</em> to damage your opponent.</p>\n<p><strong>Leveling Up</strong><br/>When you level up, the last line of text will show how much EXP is needed to reach the next level. This is not additive, once you hit this number you will level up. I recommend keeping track to make sure you don't waste herbs as when you level up all of your HP will get restored. Once you hit level 6 you will enter the dragon's lair, and all enemies will be dragons until you can't survive any longer, each one will award you an additional 50 gold.</p>\n<p><strong>Things to Gather</strong><br/>When you kill an enemy it has a chance to drop a reward. Not every enemy will drop something, but any enemy that does will only drop 1 thing. The back-end system prioritized equipment over herbs. Any equipment you get will be auto-equipped, and you if you get a piece you already have, it will ignore it and give you something else (if anything else was rolled for that reward.) As well, the maximum herbs you can hold at any one time is 6. Make sure to balance these accordingly.<br/></p>\n<p><strong>Final Notes<br/></strong>The last stretch gets very difficult unless you have all available equipment, and the final boss is near impossible unless you have found the final sword and shield from killing Wizards. The game is not really meant to be played all the way through the first time, and as this is a jam game that has undergone it's fair share of set-backs this is the difficulty solution I came up with. Please don't hate.</p>", "metacritic": null, "released": "2020-08-02", "tba": false, "updated": "2020-08-03T03:15:11", "background_image": "https://media.rawg.io/media/screenshots/e31/e31d96b70e0a74e48341dd3bbf9ab3cd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 14, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["DeepFriedOreo"], "genres": [], "publishers": [], "esrb_rating": null}