{"id": 47553, "slug": "jetx", "name": "JetX", "name_original": "JetX", "description": "JetX is a VR arcade racing game with unique flight mechanics and intense PvP action. JetX brings you a ton of emotions! Race with your friends and make sure you finish first! Want to see who's among your friends is the best shooter? Well then challenge them in our Arena mode!<br/><br/><br/><ul><li> Motion Is Life - the games flight mechanics are designed for VR headsets from scratch, in order to bring you a true excitement and minimize motion sickness!<br/><br/></li><li> Multiplayer - the game lets you play with friends both on HTC VIVE as well as Oculus Rift! No more boundaries! A true cross-platformer experience!<br/><br/></li><li> Dynamic PvP battles - carefully crafted combat mechanics in a beautiful SCI-FI setting will make you want to stay in this world forever! Killing enemies was never this exciting!<br/><br/></li><li> Multiple Weapons - a palette of death-killing machines to choose from! Find your personal gameplay style!<br/><br/></li><li> Game Modes - Racing, Arena, Deathmatch and so much more to come! <br/><br/></li><li> Clever Bots - never feel alone in the game and play even offline. JetX bots have been designed in a way to always challenge you! Don't underestimate those buggers!<br/></li></ul><br/><br/><br/>We will be adding more content to the game soon! More levels, game modes, weapons and new awesome features! Stay tuned!Motion Sickness:<br/>We highly recommend you to sit through your first few games! Motion sickness dramatically lowers after 1-2 sessions. <strong>If you still will feel dizzy - then you can activate the \"Safe Mode\" in the Games Menu.</strong>A Word From Singularity Lab:This is one of our first complete game projects and we are extremely excited to hear feedback from you, guys! The whole team of Singularity Lab was carefully crafting and polishing each aspect of the game, in order to bring you the best possible experience! After release, our social teams will work hard to help you in any way, and get as much feedback from you as possible! <br/><br/>We really hope you will like JetX! Thank you and see you in the game!<br/><br/>Team Singularity.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:04:16", "background_image": "https://media.rawg.io/media/screenshots/f44/f44e3abd688a9f098be287c0bfe28572.jpg", "website": "http://jetx.online", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 330, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Singularity Lab"], "genres": ["Action", "Racing", "Casual"], "publishers": ["Singularity Lab"], "esrb_rating": null}