{"id": 475632, "slug": "starwatchers-the-search-for-cosmic-jam", "name": "Starwatchers: The Search for Cosmic Jam", "name_original": "Starwatchers: The Search for Cosmic Jam", "description": "<p><strong>Startwatchers: The Search for Cosmic Jam</strong> is a visual novel about Jovia and Caelia, two alien best friends, and their roadtrip across the the galaxy all in search of the tastiest jam imaginable. It was created for the space-themed Shoot For The Stars Jam. Explore six wacky worlds, including...</p>\r\n☆ Saturday ☆\r\n<p>A planet from another galaxy that emanates the same energy as Saturn of the Milky Way. The word 'Saturday' itself is derived from the word 'Saturn' as it turns out. On the planet Saturday, it is always 'Saturn-day.' How do any of the inhabitants get work done on such a planet?</p>\r\n☆ Hots Tuff ☆\r\n<p>Tuff (from the Italian <em>tufo</em>), also known as volcanic tuff, is a type of rock made of volcanic ash ejected from a vent during a volcanic eruption. Following ejection and deposition, the ash is compacted into a solid rock in a process known as consolidation. Basically, it's a hot rock. What else do you want me to say?</p>\r\n☆ Panflake ☆\r\n<p>The name, is a play on the word 'pancake' as the planet itself is known for its delicious pancakes. The reason for this is because it's based on the real, but rare, phenomenon where sheets of ice form into pancake-like shapes. They're super cool, look them up!</p>\r\n☆ Boboba ☆\r\n<p>Just in case you didn't know,  'boba' or bubble tea doesn't refer to the tapioca pearls that sit at the bottom. It's actually referring to the bubbles at the top which are formed when the drink is shaken before being served. The residents of this planet thought it was a better name the their original proposal, which was Taroland.</p>\r\n☆ Prutas de Lite ☆\r\n<p>The word 'Prutas' comes from  the Tagalog language. It means 'fruits.' The design of the planet and its queen, Lemon-chan, seem eerily familiar. Where did they come from? Well, the only way to find out is to join DevTalk+, the Discord server that hosted the game jam this title was made for!</p>\r\n☆ Earth ☆\r\n<p>Quite possibly the most conceited planet in the cosmos. Why? Most planets tend to have several moons, all with their own unique name. Earth's moon somehow does not. It's just called, 'Moon.' That would be like naming their own planet, 'Planet.' How original.<br/></p>\n\r\nCredits\r\n<p>This game was created by 3 Halves Games. Follow us on Twitter, Facebook, and join our Discord community to chat directly with the developers of this title!<br/></p>\n<ul><li>Muhammad Abdul-Rahim<br/>Programming, Proofreading, Animation</li><li>m.<br/>Writing, UI Design<br/>@M_is_scared</li><li>Renée \"laughingbear\" P.<br/>Art<br/>@gelatobear</li><li>Mike Young<br/>Voice Over<br/>@MikeYoungVO</li><li>Pocket Sound<br/>Music<br/>https://pocket-se.info/</li></ul>", "metacritic": null, "released": "2020-08-01", "tba": false, "updated": "2020-08-03T04:31:50", "background_image": "https://media.rawg.io/media/screenshots/2f3/2f39b328274c7bf148456d1a9866883e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 63, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["3 Halves Games"], "genres": [], "publishers": [], "esrb_rating": null}