{"id": 47579, "slug": "ayo-a-rain-tale", "name": "Ayo: A Rain Tale", "name_original": "Ayo: A Rain Tale", "description": "Embark on a perilous journey to help Ayo fetch water for her family. Overcome challenges and enemies as you explore Sub-Saharan Africa in a daily daunting chore, gaining skills and wisdom along the way. Experience Ayo's harsh environment, as she confronts her fears and braves the unforgiving drought in this adventure platformer.<br/><br/><br/><br/><br/>• Experience day and night cycle on your journey.<br/>• Solve puzzles and push through boulders to advance.<br/>• Withstand the harsh desert heat and fight for strength and emotional balance.<br/>• Face challenging enemies and confront Ja Thunderstorm!<br/>• Discover hidden paths and avoid natural hazards.<br/><br/><br/><br/><br/><strong> Ayo: A Rain Tale </strong> sheds the light on a young girl who regularly carries her tough water-fetching duty with courage. Ayo’s struggle is shared by many girls in Sub-Saharan Africa who live in communities that have no access to clean water. The daily burden of fetching water is carried by women and children, who go on journeys to distant sources and return home shouldering a 40-pound container filled with water for their families.<br/><br/>With no time left for education, many women are denied the opportunity to develop themselves and their communities. An estimated 200 million hours are spent each day on water-fetching around the world [1], leaving both girls and women with little opportunity to break this cycle. <br/><br/>[1] UNICEF, http://www.unicef.org/media/media_92690.html <br/><br/>", "metacritic": null, "released": "2018-01-31", "tba": false, "updated": "2019-10-22T14:30:56", "background_image": "https://media.rawg.io/media/screenshots/65a/65ad4187e90e11482ff0bac3ccbd94d7.jpg", "website": "https://www.ayothegame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 9}, "playtime": 1, "achievements_count": 11, "ratings_count": 0, "suggestions_count": 321, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android", "macOS", "PC"], "developers": ["Inkline", "Inkline s.a.r.l", "Inkline s.a.r.l."], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["Inkline", "Inkline s.a.r.l"], "esrb_rating": "Everyone 10+"}