{"id": 47576, "slug": "bound-to-light", "name": "Bound To Light", "name_original": "Bound To Light", "description": "Bound to Light is a dark adventure puzzler set in oblivion where you sneak your way to save souls &amp; bring back the light<br/><br/><br/><br/>In Bound to Light you play as young Lux, trapped in a dark world without any light left.<br/>It is up to you to bring back the light by completing challenging puzzles and avoiding enemies.<br/><br/><strong>Note: The current demo is a prototype version, so there will be bugs. <br/>This is not a final version of the game.</strong><br/><br/>Bound to Light is still very early in development and we’ve tried to make sure that everything runs as smoothly as possible. In the future we will add more core mechanics to the game and further develop the existing ones, we have a lot of ideas but we are open for the public to have their say.<br/><br/><strong>Features:<br/>- Control empty husks to progress through the dark dungeon<br/>- Command them to follow you or stay in place<br/>- Swap places with husks to activate pressure plates<br/>- Sneak your way past the dangerous beasts<br/>- Move blocks to hold down pressure plates<br/>- Save lost souls on your journey </strong><br/><br/>There may be some minor visual bugs and the tutorial elements are sparse so we will provide you with the keybinds so that you can jump right in and enjoy the game.<br/><br/><strong>Input support:<br/>- Keyboard &amp; mouse. <br/>- Controller with xInput (e.g xbox 360).</strong><br/><br/>Movement - wasd  / left stick (controller)<br/><br/>Sprint* - shift (hold) / A (controller)<br/><br/>*=makes sound and attracts enemies to your location so be careful<br/><br/>Interact** - spacebar / X (controller)<br/><br/>**=Interact with husk to possess them, interact again to issue them to stay put.<br/><br/>Swap*** - C / Y(controller)<br/><br/>***=You need to posses a Husk to have something to swap positions with<br/><br/>Toggle between Husks - Q and E / RB and LB (controller)<br/><br/><br/>We hope you enjoy the prototype and we would love it if you could give us your honest feedback  so that we can make this game even better.", "metacritic": null, "released": "2018-09-25", "tba": false, "updated": "2019-08-28T22:04:15", "background_image": "https://media.rawg.io/media/screenshots/a0b/a0b01dcd82ec996082e23271587998c6.jpg", "website": "http://www.babloonstudios.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 117, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Babloon Studios"], "genres": ["Adventure", "Indie"], "publishers": ["Babloon Studios"], "esrb_rating": null}