{"id": 47575, "slug": "math-combat-challenge", "name": "Math Combat Challenge", "name_original": "Math Combat Challenge", "description": "<strong>Math Combat Challenge</strong> is a Math game, and is also a survival game, with some First Person areas and starship areas. The key of the game is solving math problems while trying to survive. Complexity of the math problems are random and can be configured, from simple adds to equations. Some panels require the player to look for the right number across the arena (static panels). Others appear just some seconds with different solutions, where you must shoot the right answer before disappearing (dynamic panels). <br/><br/>There are 41 achievements now integrated to the game, more to come.<br/><br/>There are four levels, and enemies will try to stop you from solving the math problems. You'll have to deal with the math problems while fighting the enemy. <strong>The paradox of solving math and fight is what you'll need to achieve in order to win.</strong> Too many errors, and you fail. That is also configurable.<br/><br/>This is not a sophisticated mathematical calculation program, nor is it intended to carry out complex studies on mind and calculation. Math Combat Challenge is a videogame, whose purpose is to entertain the player. And use mathematics for it. The player configures the game to his liking, to be presented with math exercises from simple sums to equations of second degree, although of course the game will have more options in the future. And the player must solve these exercises. <strong>Remember: fixed panels are resolved by looking up the numbers on the stage (the active panel has a halo around it). Instant panels require to shoot the right solution quickly.</strong><br/><br/>In the end, according to the type of problems solved, their complexity, and their speed, the game determines a score. And that’s all. Or well, not exactly , actually. The player must solve these exercises while resisting countless hordes of enemies trying to finish their calculations, and with him or her. That means an extra amount of stress. We want the player to suffer, there is nothing better than a player who suffers. Of course not too much. Suffer enough to have fun.<br/><br/>Three more arenas will be available the next three months after release for free. One of them will be aimed at children, with a water hose instead of weapons, without enemies in any case, and in an environment with images and sounds  for younger children.<br/><br/>In any case, you can deactivate the enemies if you want to practice, or just for fun. It's your choice. But the key is always the same: you don't win fighting, but solving math problems.<br/><br/><strong>If you fail to solve the math problems, no matter how well you fought, you'll lose</strong>.", "metacritic": null, "released": "2017-11-03", "tba": false, "updated": "2019-08-28T22:04:15", "background_image": "https://media.rawg.io/media/screenshots/dc3/dc30a35b45ca7c9ece5d797eaf462159.jpg", "website": "https://titandscompany.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 28, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 492, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Titan Deep Space Company"], "genres": ["Action", "Simulation", "Indie"], "publishers": ["Titan Deep Space Company"], "esrb_rating": null}