{"id": 47585, "slug": "legends-of-talia-arcadia", "name": "Legends of Talia: Arcadia", "name_original": "Legends of Talia: Arcadia", "description": "<p>Arcadia is a legendary knight who’s fought in innumerable battles in the war-torn land of Talia. She’s beloved by the people, despite her relatively young age, and many consider her a goddess among mortals. She fought in the battle of Kadath in her youth, saved Amaranth Village from destruction, and has defeated hundreds of Talia’s enemies with her sword... But there’s one legend about Arcadia nobody speaks of.<br />\nMore than ten years, a horned dragon attacked Freycross Village. Arcadia happened to be there at the time, and could have saved the lives of the villagers – but she didn’t. The village burnt to the ground, and almost all the villagers perished. Arcadia might be a hero, but those who survived the attack on Freycross Village resent her.<br />\nThey hate her. They even want her dead.Arcadia<br />\nA legendary knight whose name is known throughout Talia. The people have given her numerous titles and accolades – the Scourge of the Battlefield, Champion of Kadath, the Protector of Amaranth Village – but she prefers to go by ‘Arcadia’.<br />\nShe was a child warrior in her youth, who took up the sword to defend her country when she was only fourteen.<br />\nNow more than a decade has passed, and Arcadia has grown tired of fighting. With her faith in her own country shaken, Arcadia has retired from the life of a warrior…<br />\nBut things aren’t always that simple.Cecily<br />\nA young woman who lives in a small, easily overlooked village in Littleoak Forest. She’s cheerful and clumsy, but years of study have shaped her into an incredibly powerful mage.<br />\nCecily’s main talents lie in casting ice spells, summoning magic bullets with a flick of her fingertips, and cooking pancakes.Features:Join Arcadia on her adventure in this kinetic Visual NovelExperience an exciting fantasy storyAvailable in English and ChineseBeautiful graphics to visualize the story</p>", "metacritic": null, "released": "2017-10-27", "tba": false, "updated": "2023-12-25T21:42:50", "background_image": "https://media.rawg.io/media/screenshots/402/402e05d909b0daab7bde477ad3a7f58f.jpg", "website": "", "rating": 1.89, "rating_top": 1, "added_by_status": {"yet": 4, "owned": 84, "beaten": 7, "toplay": 1, "dropped": 1}, "playtime": 1, "achievements_count": 78, "ratings_count": 9, "suggestions_count": 542, "game_series_count": 0, "reviews_count": 9, "platforms": ["PlayStation 4", "PlayStation 5", "PC", "macOS", "Linux"], "developers": ["Winged Cloud"], "genres": ["Simulation"], "publishers": ["Winged Cloud"], "esrb_rating": null}