{"id": 475832, "slug": "raid-party-demo", "name": "Raid Party Demo", "name_original": "Raid Party Demo", "description": "<p>Your friends(?) are staging an assault on a mysterious fortress island, and you are a small, sentient bag. Do your best!</p>\n<p><em>(This is an early version of the game and includes only the first area, so you can't actually assault the fortress. Sorry. You can assault a pelican, if you want.)</em></p>\n<p><strong>Friends</strong></p>\n<p>You can't play with your <em>actual</em> friends, but you can play with a sarcastic batmage, a violent redhead and an archery-practicing octopus. Unless your actual friends are really cool, this is probably a very good alternative.<br/><br/><br/><strong>Turn-based combat</strong></p>\n<p>Try to direct your new friends to use some semblance of strategy by giving them items to use and redirecting their attacks.</p>\n<p><strong><br/>Loot</strong></p>\n<p>Take the stuff of anyone in your way! And take their money, and buy more stuff with that money! Then combine their stuff with the stuff you bought with their money and make more powerful versions of the stuff! Ignore the specifics of how two identical swords turn into one identical sword that's just on fire now.<br/></p>\n<p><strong><br/>Roguelite things</strong></p>\n<p>Get shot by a gun-hoarding octopus! Retreat! Then try again! It's randomly generated! Although probably not randomly generated enough to save you from getting shot by the octopus again. He's pretty good at shooting.<br/></p>\n\n<p>Come talk to us on Discord:<br/>https://discord.gg/wwQDnTZ<br/><br/>Or follow the game on Twitter:<br/>https://twitter.com/PlayRaidParty</p>", "metacritic": null, "released": "2020-07-31", "tba": false, "updated": "2020-08-03T05:16:24", "background_image": "https://media.rawg.io/media/screenshots/562/562cdf37f55bae297d5dc0052ab3aa49.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 167, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Magnega"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}