{"id": 47589, "slug": "space-viking-raiders", "name": "Space Viking Raiders", "name_original": "Space Viking Raiders", "description": "This game is in development, all of the models and textures seen in the video will be replaced with actual real life Space Vikings.  No real slugs were harmed in the making!<br/><br/><strong>Features</strong><br/><br/>1. Blast through wave after wave of enemies from multiple dimensions!  Battle the fleets of the Federites, the horrors of the Sluglings, and feel the wrath of Candyland.  Assult them on their homeworlds, destroy their bases, raid their lands, and take what you came for!<br/>2. Online co-op campaign.  Do the entire campaign online and with your friends! Fully voice-acted.<br/>3. Tactical - Strategy, with classic moba controls and lots of QWER abilities to mix and match!<br/>4. Innovative Swarm AI and Gameplay -- shape and manipulate the oncoming enemy swarms to maximize destructive efficiency!<br/>5. Deep Tactical Gameplay -- only the best vikings can master the hardest difficulties and achieve the high-scores.  It takes a high degree of co-operative teamwork and individual skill to defeat the hardest difficulty.<br/>6. Spend your loot on cosmetics to customize your Viking Raiders!<br/>7. A large selection of epic music to splatter your foes to.<br/><br/>Other Features<br/>-Singleplayer support, control multiple units.<br/>-Offline local multiplayer AND splitscreen.<br/>-Xbox controller support.<br/>-Lots of settings for difficulty and replay-ability.<br/><br/><br/><strong>Space Viking Raiders Story</strong><br/><br/>Long ago, in a dimension not too unlike this one... <br/><br/>An unlikely band of Space Vikings Raiders; while pillaging an alien research outpost on a remote world, unearthed ancient technology. It allowed portals to tunnel into other dimensions...<br/><br/>In this 3-part interactive historical simulation, discover the story of interdimensional space viking raiders. Pioneers of their time they probed millions of dimensions and found those richest in elementium. Venturing into the unknown, jazzed up on stimbrews, stimshrooms, stimspinach and the prospect of legendary loot, the raiders went through the portal with awesome in their eyes and space axes that shot artillery shells, gravity beam weapons, cut up enemies and mined elementium. <br/><br/>Their leader was Dredrick Dead Eyes, a legendary space viking known for his ferocity and disdain for authority. Also, because he had cybernetic eyes implanted after losing them in a lover's quarrel. He's evaded capture for years while his reputation has aged much better than fortunes. Dredrick is keen to exploit this new opportunity. Coincidentally, his crew was unaware of his willingness to gamble all their lives in the process. He was never the most brilliant space viking; by the end of his life he had more wealth than his entire race.<br/><br/>His right hand was Athelia, a seasoned viking raider captured from a world of giant trees where humans settled in platforms around the massive trunks. Orphaned at a young age in a avian dropping disaster, she found her way into the cockpit of a dragonfly fighter and farmed giant aphids. When captured by Dredrick and his crew she was kept alive for her skills at a helm. None we're overly impressed by her piloting, but she did manage to kill the previous pilot with a stimcoffee mug when being brought onboard. Dredrick was impressed and she soon joined the crew raiding, rising to a prominence of awesome. Pilot, raider and commander, Athelia had the highest quantifiable intelligence of anyone on the crew, which frankly isn't saying much.<br/><br/>Tommy K holds the prestigious space viking title of 'berserker'. Had he not suffered traumatic brain injuries during a college nutball career, perhaps life would have been different for Tommy. As it were, before his school could have him submitted for medical treatment he ran off to become a space viking. His brain had been damaged leaving him with intermittent episodes of intense rage and/or psychedelia. Among the best fighters on the crew, Tommy K never misses a raid. He forgot his last name.<br/><br/>Danny Zicarus, Zica. Zica lived on a makeshift space station orbiting a white dwarf in an otherwise abandoned system. When a ship was spotted in the system, Zica stole one of the station's only shuttles and joined up with the space vikings. An odd mix of farmer and thief in her past life, Zica is somewhat unpredictable. She's become a wizard with explosives and joins every raid to ensure effective use of ammunition. Zica has a common expression taken up by the crew \"More ammo, more kablammo.\" <br/><br/><br/><strong>Multiball Studios</strong><br/><br/>Based in Vancouver, Multiball Studios was created by Adam Thompson and Scott Banducci. Using their complimentary skill sets and a small seed fund of their own money, they set out to build an indie game studio from the ground up. <br/>With minimal time and resources, Multiball was able attract some of the best talent from Vancouver's rich game and film ecosystem. Sound engineers from feature film productions, artists from AAA gaming studios and modelers and animators from the indie game scene. Using a network of connections from around the world they've even pulled in music and voice acting from places like New Zealand and Scotland.<br/>The idea we believe in is both simple and difficult: the fastest way to become a successful indie game studio is to start making games. If they offer value, the money will flow. That's why we've set out to make our first game in 3 months. With veteran lead developer, Adam Thompson, at the helm we expect this first game will demonstrate the tremendous potential of Multiball Studios creativity and network of talented individuals.", "metacritic": null, "released": "2018-02-01", "tba": false, "updated": "2019-08-28T22:04:14", "background_image": "https://media.rawg.io/media/screenshots/9bb/9bbf33b9988d8c7b24d9ebff60545375.jpg", "website": "https://multiballstudios.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1}, "playtime": 0, "achievements_count": 63, "ratings_count": 0, "suggestions_count": 173, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC", "Linux"], "developers": ["Adam Thompson"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Casual", "Indie"], "publishers": ["Multiball Studios"], "esrb_rating": null}