{"id": 47602, "slug": "hinterhalt", "name": "Hinterhalt", "name_original": "Hinterhalt", "description": "<strong>“Hinterhalt”</strong> is an amazingly simple, yet tremendously hard World War 2 real time strategy game. Command your army, build basements, fortifications or even artilleries to both protect and lead your army to victory. The game includes a skirmish &amp; zombie game modes as well as a campaign and a tutorial level to get you started.  The complex designed AI behaves every game differently, acting more or less aggressive, defensive or passive.Basic:The game takes place during World War 2. The campaign offers approximately about 2-5 hours of gameplay. The zombie and skirmish mode offer additional play time and can be played independently from the campaign or each other.Art Style:The cartoonish low poly kind of style with bright colors make this game truly unique for real time strategy games. Smooth animations, carefully designed GUI and exciting background music and effects add an additional great experience to the game.Skirmish:In skirmish you can choose your desired faction (Allied powers vs Axis powers) and battle against the AI freely. You start with little money and troops but so does the AI. Completely destroying your opponent or reaching the capture-point limit leads to victory.Zombie Mode:Starting with only a few men you have to survive as long as you can. Waves start every 2-3 min. Each waves increases the number of zombies and make them stronger. Money and ammunition are very limited, so every decision you take must be wisely chosen.Early access:The game will be discounted during early access. The main goal is to improve the game and collect feedback from the community! Final release should be around 2017/2018.", "metacritic": null, "released": null, "tba": false, "updated": "2022-11-08T20:54:57", "background_image": "https://media.rawg.io/media/screenshots/957/957c957df6ce57246ce5a79c0f225e4c.jpg", "website": "http://felgcgamesdevelopm.wixsite.com/homepage", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 10}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 258, "game_series_count": 0, "reviews_count": 2, "platforms": ["macOS", "Linux", "PC"], "developers": ["Felip Guimerà"], "genres": ["Action", "Strategy", "Indie"], "publishers": ["FelGC.GamesDevelopment"], "esrb_rating": null}