{"id": 47613, "slug": "monster-energy-supercross-the-official-videogame", "name": "Monster Energy Supercross - The Official Videogame", "name_original": "Monster Energy Supercross - The Official Videogame", "description": "<p>Monster Energy Supercross - The Official Videogame<br />\nLive the adrenaline and the excitement of the 2017 Monster Energy Supercross Championship with MONSTER ENERGY SUPERCROSS - THE OFFICIAL VIDEOGAME!<br />\nRace with the official riders from 250SX and 450SX on the official tracks, Daytona included, to experience one of the most spectacular and entertaining racing competition ever!<br />\nDiscover the Track Editor feature for endless gameplay possibilities: select your stadium, create your own track and share it online with your friends.<br />\nCustomize your rider and bike as you like, with countless possibilities, with more than 80 official brands and 300 items available, and challenge yourself in conquering the top of the leaderboard.<br />\nRace alone or against players from all over the world thought different offline and online game modes!<br />\nFeel the rush of adrenaline, enter the arena and be the King of Supercross!<br />\nKEY FEATURE POINTS:<br />\nThe official 2017 Monster Energy Supercross Season.<br />\nOfficial bikes, iconic tracks, like the legendary Daytona, and athletes from both 250SX and 450SX Classes.<br />\nA powerful track editor, for endless gameplay possibilities: create, customize and share online your own tracks.<br />\nAn exciting career mode with extreme customization options for both riders and bikes.<br />\nTop notch graphics for a world-class game quality and a next-level immersive experience with an accurate reproduction of tracks, accessories and athletes’ aspects.</p>", "metacritic": 68, "released": "2018-02-13", "tba": false, "updated": "2024-01-10T15:36:02", "background_image": "https://media.rawg.io/media/games/0b0/0b0611eb331285aafb05779d9f76d0b8.jpg", "website": "", "rating": 2.02, "rating_top": 1, "added_by_status": {"yet": 30, "owned": 508, "beaten": 10, "toplay": 2, "dropped": 60, "playing": 8}, "playtime": 5, "achievements_count": 304, "ratings_count": 100, "suggestions_count": 500, "game_series_count": 0, "reviews_count": 101, "platforms": ["Nintendo Switch", "Xbox One", "PC", "PlayStation 4"], "developers": ["Milestone"], "genres": ["Sports", "Racing"], "publishers": ["Milestone"], "esrb_rating": "Everyone 10+"}