{"id": 476128, "slug": "grounded-game-preview", "name": "Grounded - Game Preview", "name_original": "Grounded - Game Preview", "description": "This game is a work in progress. It may or may not change over time or release as a final product. Purchase only if you are comfortable with the current state of the unfinished game.<br/><br/>\r\nXbox Game Pass members can now pre-install Grounded, so they’re ready to play as soon as Xbox Game Preview begins.<br/><br/>Not an Xbox Game Pass member? You can still purchase Grounded through Xbox Game Preview when it enters on July 28, 2020.<br/><br/>The world is a vast, beautiful, and dangerous place – especially when you have been shrunken to the size of an ant. Explore, build, and survive together in this cooperative survival-adventure. Can you thrive alongside the hordes of giant insects, fighting to survive the perils of the backyard? Join our community and help shape the future of Grounded in Xbox Game Preview.<br/><br/>- Reactive World and Insect Life -<br/><br/>Explore this immersive and persistent world, where the insect life reacts to your actions.<br/><br/>- Base Building and Crafting -<br/><br/>Shelter and tools are critical to your survival. Build epic bases to protect you and your stuff from the insects and the elements. Craft weapons, tools, and armor, allowing you to better fight, explore and survive.<br/><br/>- Online Co-op -<br/><br/>You can face the backyard alone or together, online, with up to three friends - it is your choice.<br/><br/>- Campaign -<br/><br/>Uncover the secrets lurking in the shadows of Grounded as you freely explore the backyard and progress through its mysterious story.<br/><br/><br/><br/>Full details on the latest status of the game, how you can give feedback and report issues can be found at https://grounded.obsidian.net/", "metacritic": null, "released": null, "tba": false, "updated": "2020-08-07T02:23:08", "background_image": "https://media.rawg.io/media/screenshots/207/20746951a10cfe92ebf9315b20562123.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 291, "game_series_count": 0, "reviews_count": 0, "platforms": ["Xbox One"], "developers": [], "genres": [], "publishers": [], "esrb_rating": null}