{"id": 476252, "slug": "ben-ding-time", "name": "Ben Ding Time", "name_original": "Ben Ding Time", "description": "This game was created in a week for submission into the Brackeys Game Jam 2020.\r\n-Theme-\r\n<p>The faces of Big Ben have gone berserk! It's your job to <strong>rewind </strong>the clock and make sure people know the correct time. The game is score based, so keep fighting to get a new high score! Be careful, the game starts off easy but quickly becomes more difficult as it continues. You lose a game once your meter hits the end of the red section.</p>\r\n-Controls-\r\n<p>Use the A and D keys to select which clock face you wish to wind and then use W and S to wind the clock. Match the minute hand with the green hand to ensure you have the right time. This game was created in a week for submission into the Brackeys Game Jam 2020. </p>\r\n-About-\r\n<p>This game was a family project and the first game jam we have ever participated in. The game is very simple but we are proud of it and plan to continue to do more jams in the future.</p>\r\n-Tips-\r\n<p>If a clock face is more than an hour off, check the hour hand and the timer to decide which direction to wind the clock. Your meter only decreases when you have red lights. It is often a good idea to focus on fixing red-light clocks instead of ensuring every clock is perfect, focus on getting them green first.</p>\r\n-Code-\r\n<p>Jacob Dentes</p>\r\n-Music-\r\n<p>Jacob Dentes</p>\r\n-Art-\r\n<p>Kathleen Dentes</p>\n<p>Marleah Dentes</p>", "metacritic": null, "released": "2020-08-06", "tba": false, "updated": "2020-08-07T03:03:28", "background_image": "https://media.rawg.io/media/screenshots/561/561f66300368256bef58808d60fc9fb9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 86, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Web"], "developers": ["Jacob Dentes"], "genres": ["Action"], "publishers": [], "esrb_rating": null}