{"id": 476373, "slug": "moon-settler-demo", "name": "Moon Settler (Demo)", "name_original": "Moon Settler (Demo)", "description": "<p>Moon Settler is a sci-fi puzzle/city-building hybrid, inspired largely by ISLANDERS with some elements inspired by games such as MyColony, Cities: Skylines, and Aven Colony. <br/></p>\n<p>In Moon Settler you build without resources. In place of resources, you fulfill goals that give you required and optional buildings by meeting minimum viability.</p>\n<p>Viability is determined by the sum of three stats which must be kept above 0 in order to advance: happiness, power, and sustenance. Buildings base stats and affect stats based on other buildings in range. <br/></p>\n<p>Moon Settler isn't meant to be a stressful game. It blends the puzzle-like nature of building placement with the stat-like nature of traditional city-builder strategy games. Other than that, there are no advisors yelling at you about management or notifications flashing about low resources. There is an undo function (up to 4 buildings) as well as a banish function (completely resets a settlement).<br/></p>\n<p>This is a demo, currently with two levels, a short soundtrack, and a single set of models. Be aware that there are some known bugs. The full game's release is TBA. There are plans outlined for the full release. Some may come as updates to the full game. The demo is fully FOSS (link to repo), while the full release is currently planned to be ~$2 with open-sourced code. Development will slow in the coming months due to classwork. Support is appreciated and can be done through itch or ko-fi!</p>\n<p>Moon Settler is developed by Goldenwere, a solo brand by Lightling. Follow the dev @_goldenwere / @_lightling on Twitter for updates!<br/></p>", "metacritic": null, "released": "2020-08-06", "tba": false, "updated": "2020-08-07T03:27:28", "background_image": "https://media.rawg.io/media/screenshots/dc7/dc72c3c42ea5e37827b2a278fbceaa51.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 51, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["Goldenwere"], "genres": ["Simulation", "Puzzle"], "publishers": [], "esrb_rating": null}