{"id": 47637, "slug": "airport-mania-first-flight-xp", "name": "Airport Mania: First Flight XP", "name_original": "Airport Mania: First Flight XP", "description": "Take an extended flight with Airport Mania: First Flight XP!<br/><br/>The XP stands for eXtended Play and that is the focus of this new (phone only!) edition of everyone's favorite airplane game. Airport Mania XP edition has several features not found in the original Airport Mania phone game, including the 4 Star Challenge,  8 Additional levels (56 total!),  Colorblind Options, and Endless Mode making the XP version of Airport Mania the definitive edition of the game! Be sure to book your trip to fun now!<br/><br/>Airport Mania was first released in 2008 and has since become loved around the world for its \"made to make you smile\" theme and its exciting non-stop action. Filled with charismatic planes, whimsical airports, and addictively intense gameplay that is both fun and challenging for everyone from children to the most veteran gamer, Airport Mania is one flight you simply can't afford to miss!<br/><br/>*********************<br/><br/>* 8 distinctly different Airports!<br/>* Whimsical Graphics and Music!<br/>* Awards to Challenge your skills!<br/>* 56 Unique Levels!<br/>* Secret Paper planes mode! <br/>* Colorblind Options!<br/>* Automatically saves as you play!<br/><br/>*********************<br/>REVIEWS:<br/>*********************<br/>\"...the best time management I have seen in a long time...\" - App Modo<br/><br/>\"Gameplay is fast and very intuitive.\" - IntoMobile<br/><br/>\"I promise you’ll never be bored...\" - Gamezebo<br/><br/>\"...the game play can go on for hours and hours...\" - App Chatter<br/><br/>\"I love Airport Mania.\" - iGadgetJunkie<br/><br/>\"Airport Mania is time management at its best.\" - The Appera<br/><br/>\"...one of those App Store gems we love to find...\" - TouchGen<br/><br/>\"...you can't beat the entertainment value of this app.\" - AppVee", "metacritic": null, "released": "2010-09-29", "tba": false, "updated": "2019-10-22T14:21:29", "background_image": "https://media.rawg.io/media/screenshots/9aa/9aad4cb622b31bd41e9ba2a82db0b4aa.jpg", "website": "http://www.airportmania.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 167, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Lemon Games", "Lemon Team"], "genres": ["Simulation"], "publishers": ["Lemon Games"], "esrb_rating": "Everyone"}