{"id": 476427, "slug": "dollypuzzle", "name": "DollyPuzzle", "name_original": "DollyPuzzle", "description": "<p>Hi,</p>\n<p>DollyPuzzle is a puzzle game with Russian dolls. For now, there are only 6 levels (and a tutorial)</p>\n<p>Goal :<br/>You play a Russian doll, who must find her sisters and then join the exit. Beware, when you move forward you only stop if you encounter an obstacle, which may complicate your plans.</p>\n<p>Control:<br/>The arrows to move and the space key for the rest (get in or out of the dolls and push the crates)</p>\n<p>Thanks to all those who will test the game, hoping you will have a good experience.</p>\n<p>Good day to you</p>\n<p>(The game is in French, but there aren't many texts. So don't worry, everyone can play DollyPuzzle)</p>\n\n\n<p>Bonjour à tous ,</p>\n<p>Je vous présente DollyPuzzle !</p>\n<p>Un puzzle game donc, avec des poupées russes.</p>\n<p>Le but :<br/>Vous incarnez une poupée russe, qui doit retrouver ses sœurs et rejoindre la sortie. Mais attention, quand vous avancez  vous ne vous arrêtez que si vous rencontrez un obstacle, ce qui risque de compliquer vos plans.</p>\n<p>Contrôle :<br/>Les flèches directionnelles pour se déplacer et la touche espace pour le reste (rentrer ou sortir des poupées et pousser les caisses)</p>\n<p>Merci à tous ceux qui  testeront le jeu, en espérant que vous en aurez une bonne expérience.</p>\n<p>Bonne journée à vous et bon jeu !</p>", "metacritic": null, "released": "2020-08-06", "tba": false, "updated": "2020-08-07T03:39:26", "background_image": "https://media.rawg.io/media/screenshots/fdb/fdba2890afada57b2f73ad9e77755651.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Narrosk"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}