{"id": 47646, "slug": "battle-for-the-galaxy", "name": "Battle for the Galaxy", "name_original": "Battle for the Galaxy", "description": "<strong>Battle for the galaxy is a freemium cross-platform MMO strategy video game. </strong><br/><br/><ul><li>Join the battle: become a Commander of a star fleet, start as a Trooper and become the General of the Galaxy!<br/></li><li>Unite in Corporations: find allies in numerous fights for galactic supremacy!<br/></li><li>Protect your planet: deploy towers, traps and walls on your base;<br/></li><li>Destroy enemy bases: send your army on assaults and earn Titanum and Energy;<br/></li><li>Build your own strategy: plan successful attacks using countless combinations of troops, technologies and modules!<br/></li><li>Prove yourself: participate in daily League competitions, Duels and Raids.</li></ul><br/><br/><br/>Battle for the Galaxy features player controlled development of the space outpost, further defending that outpost from other players, as well as attacking outposts of other players. Resources for army training and base development are obtained either from attacks, or via mines daily production. <br/><br/>Players are offered to create or join corporations (groups of up to fifty people), which provide them with permanent bonuses to make defensive and offensive gameplay of a player easier and allow him to participate in a corporate wars.<br/><br/>Battle for the Galaxy got positive reviews and high ratings for it's high quality graphics and popular gameplay model orineted for casual players.", "metacritic": null, "released": "2016-10-10", "tba": false, "updated": "2019-08-23T12:12:12", "background_image": "https://media.rawg.io/media/screenshots/491/49151f8291a564e5762192b2c4e63f41.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 5, "dropped": 1, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 522, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS", "PC"], "developers": ["AMT Games", "SP Melet", "AMT Games Publishing"], "genres": ["Strategy", "Casual", "Massively Multiplayer", "Indie"], "publishers": ["AMT Games"], "esrb_rating": null}