{"id": 47668, "slug": "clash-of-kings-cok", "name": "Clash of Kings – CoK", "name_original": "Clash of Kings – CoK", "description": "The wars are continuing. The descendants of the old King received the call from CoK land. The gate of the palace is about to open. The new mystery seas are waiting for the true lord. <br/><br/>Rally the army, show the energy to the other Kingdoms and Rule the sea! <br/><br/>Battle kingdoms, wage war, fight armies, build your castle and conquer an empire with real time strategy in this epic multiplayer online RPG. Download Clash of Kings to experience the CoK fantasy world of PVP medieval combat action in an epic war game.<br/><br/>Fight kingdoms, use dragons to enhance your abilities and conquer an empire in the multiplayer war game that pits your army against enemies and friends alike. The battle action heats up with a new army to fight, four new civilizations to explore and a new Popularity ranking system to dominate – join the Clash of Kings online game and play real time war strategy in this RPG for control over all the CoK kingdoms.<br/><br/>CoK – Top 5 Reasons to Download:<br/>1. Play CoK with real time MMO battle action against thousands of players worldwide<br/>2. Battle kingdoms, upgrade dragons and your army defenses, collect resources and build an empire in this epic multiplayer online game <br/>3. Fight against a rival castle, palace or kingdom and navigate the CoK fantasy world <br/>4. Play tactical MMO real time battle strategy and build alliances with other lords and leaders <br/>5. Battle and conquer kingdoms in four brand new civilizations and fight to retain your empire’s Popularity ranking in the online RPG and CoK battlefield.<br/><br/>Fight against other lords and wage war in the massive PVP online game. Battle for control of the kingdom, build an army and shore up your defenses with upgrades to your castle, palace, dragons and army barracks to withstand even the most powerful PVE attack. <br/><br/>Play real time strategy to strengthen control over your kingdoms, upgrade your equipment and fight in an epic MMO war to defend your castle from an enemy attack. Gain resources for your army and upgrade your palace by developing farms and sawmills. Build strategic alliances with other leaders and maintain them for your advantage.<br/><br/>Send dragons on a journey to bring back gifts for your kingdom, use tactical MMO RPG gameplay to prevent a siege on your palace, battle enemies and manage your palace’s resources to become one of the most powerful lords in the Clash of Kings empire. <br/><br/>Explore the new civilizations of Dragon-born, Viking, Yamato and Huaxia conquer all new territories. With new heroes each with their own specialties battling it out in the ancient valley, these battle-tested warriors are ready for intense fighting action within the ever expanding multiplayer fantasy world.<br/><br/>Download Clash of Kings, battle enemies for top billing in the Popularity feature and take control of the realm in this epic MMO PVP war! <br/><br/>Connect with Clash of Kings!<br/>• Facebook: https://www.facebook.com/Clash.Of.Kings.Game <br/>• Google+: https://plus.google.com/communities/102750039774058615160<br/>• Twitter: https://twitter.com/ClashOfKingsCOK <br/>• YouTube: https://www.youtube.com/c/clashofkingsmmogame<br/><br/>Are you having problems? Send an email to cok@elex.com to contact us, or contact the Customer Service staff by tapping on the Billboard of your castle.<br/>Privacy Policy and Terms of Service: http://bitly.com/2ohBRpD", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:10:58", "background_image": "https://media.rawg.io/media/screenshots/c39/c394144fa4a7e388453ac225109d0a53.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 3, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 414, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android"], "developers": ["Elex Wireless"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}