{"id": 476696, "slug": "blasters-pandemonium", "name": "Blasters: Pandemonium", "name_original": "Blasters: Pandemonium", "description": "<p>In a world where delicious milk is scare, only the Dairy Crystals. As the protector of the last Dairy Crystal, you must fight your way through 30 waves of bad guys trying to destroy you and the Dairy Crystal. WIELD a variety of weapons with different quirks and powers, BUILD  massive bases with brick walls, turrets, and many other blocks that aid you in tactical advantages. LEVEL UP to unlock new weapons and blocks! BATTLE large bosses! Do everything you can to save that crystal. Everyone's bowl of cereal depends on it!</p>\n<p>CONTROLS:<br/>Enter - Start Game/Start Attack Phase<br/>Escape - Pause Game<br/>WASD - Move<br/>Left Mouse Button - confirm/select/fire<br/>Space - Enter/Exit shop<br/>Mouse 3  or \"B\" Key -  Enter/Exit build mode<br/>\"Q\" Key - Switch to previous weapon/block<br/>\"E\"  Key- Switch to next weapon/block<br/>\"R\" Key- reload<br/>Escape + Tab = Quit Game</p>\n<p>GAMEPLAY:<br/>Blasters 2: Quarantine is a survival arcade top-down shooter. Your main goal is to survive for a total of 30 WAVES, making sure to keep the  DAIRY CRYSTAL alive.<br/>After every few wave the difficulty increases; enemies deal more damage and have more health, bosses get faster and stronger, etc.</p>\n<p>Each wave is separated into 3 main PHASES: <br/>**PREPARATION PHASE - In this phase, you must build defenses to protect the Dairy Crystal in the center.  In the prep phase, you have access to the SHOP. While in the SHOP, you can buy several item that will help with your defenses. <br/> *There are TWO main types of items: WEAPONS, and BLOCKS. <br/> *Weapons are your main tool for attacking enemies. All have there strengths and weaknesses, however, more powerful weapons are generally more expensive. <br/> *You can access the \"WEAPONS\" section of the SHOP by clicking the \"TO WEAPONS\" BUTTON towards the bottom of your screen. Similarly, you can use the \"TO BLOCKS\" BUTTON to access the \"BLOCKS\" section. <br/> *Blocks provide a method of directly protecting you and especially your crystal. While some blocks can block damage, other blocks can block damage or modify the direction or speed of a projectile. </p>\n<p>**SWARM PHASE - The main phase, where ENEMIES spawn and attack you or the crystal. Your main goal is to simply survive. Each phase has a certain amount of enemies that need to be destroyed in order to complete the phase. <br/> *Enemies will get more challenging as the game continues. <br/> *Enemies will drop MONEY once defeated. This money can be used to buy items in the next WAVE.<br/> *Enemies have either TWO main functions:<br/> *A) Target and shoot the player (aka YOU), OR<br/> *B) Dart toward the Crystal and shoot at it.<br/> *It's important to note that the Crystal does regenerate health and has its own weapon to shoot enemies with. </p>\n<p>BOSS PHASE - After you have defeated all of the enemies in the attack phase, a BOSS will spawn. You must defeat the boss in order to proceed to the next wave.<br/> *The boss will drop a large amount of money once defeated. </p>\n<p>If your HP falls below zero, but the Dairy Crystal is still alive, you will respawn after a short time. However, if the Dairy Crystal's HP is below 0 (The Crystal will turn black once that happens) and you die, your game is over. </p>", "metacritic": null, "released": "2020-08-05", "tba": false, "updated": "2020-08-07T04:39:00", "background_image": "https://media.rawg.io/media/screenshots/aa7/aa715df52be07a00afccff649ba23120.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Blast Studio Games"], "genres": ["Action", "Strategy"], "publishers": [], "esrb_rating": null}