{"id": 47676, "slug": "death-point-3d-spy-top-down-shooter-stealth-game", "name": "Death Point: 3D Spy Top-Down Shooter, Stealth Game", "name_original": "Death Point: 3D Spy Top-Down Shooter, Stealth Game", "description": "Death Point is a hardcore single player top-down shooter, stealth game with dual stick control that will test your reaction and cunning and plunge you into a post apocalyptic future that doesn’t forgive mistakes &amp; gives no chance for the weaks to survive. It’s an super spy adventure filled with excitement and emotion.<br/><br/>◉   EPISODIC STORYLINE<br/>Only two from your group have survived: you (agent) &amp; she (operator). She is blocked somewhere at the enemy’s territory, while you woke up in a prison, barely alive, but determined to get revenge. The countdown has started. Elimination sensors are already ticking in your heads. The mission success &amp; your future depends solely on you. All you have to do is to find the girl and call for evac. Hurry up!<br/><br/>◉   STEALTH<br/>Plan you attack by using baits to successfully eliminate step by step various opponents (including zombies!). Hide in shelters to pass by without being noticed or hide from enemy fire. Use a gun with silencer to quietly reduce a number if enemies.<br/><br/>◉   TACTICAL COMBATS<br/>There are various tactics with using if encirclement. Hide from attacks in containers &amp; cases. Draw guards attention throwing a bottle or a flash bang grenade. Use smoke bombs to pass unnoticed.<br/><br/>◉   ARSENAL<br/>To survive you can use any kind of weapon you would like: a gun with a silencer, a shot gun, an ‘UZIi’ weapon, a land mine and many other things.<br/><br/>◉   KEY GAME FEATURES<br/>∙ Tactical top-down shooter and super spy stealth game<br/>∙ Episodic storyline in 10 chapters - all chapters out now!<br/>∙ Up to 12 hours gameplay with interesting challenges of single player game<br/>∙ Dual stick gameplay controlled with two screen sticks.<br/>∙ Wide range of weapons, guns &amp; outfits<br/>∙ High quality &amp; stylish HD graphics<br/>∙ No extra downloads after the game installed<br/>∙ All future updates are free<br/>∙ A game like spy games and stealth games<br/><br/>Game requires OpenGL ES 3.0 support!<br/><br/><br/>Follow us on Twitter: @DeathPointGame<br/>Subscribe on Facebook: https://www.facebook.com/deathpointgame/<br/>Learn more about our other games: https://andiks.com/", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:10:57", "background_image": "https://media.rawg.io/media/screenshots/8cf/8cf1958ea027579745001fd79546f1c3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 455, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android"], "developers": ["Andiks"], "genres": ["Action"], "publishers": [], "esrb_rating": null}