{"id": 476769, "slug": "scp-294", "name": "SCP-294", "name_original": "SCP-294", "description": "<p>(Please note, that every time there is an update to the game on scratch, you will have to re-download the first file. The second file is the URL for the game on scratch, so it shouldn't need to be re-downloaded. Thank you!)</p>\n<p>Item SCP-294 appears to be a standard coffee vending machine, the only noticeable difference being an entry touchpad with buttons corresponding to an English QWERTY keyboard. Upon depositing fifty cents US currency into the coin slot, the user is prompted to enter the name of any liquid using the touchpad. Upon doing so, a standard 12-ounce paper drinking cup is placed and the liquid indicated is poured. Ninety-seven initial test runs were performed (including requests for water, coffee, beer, and soda, non-consumable liquids such as sulfuric acid, wiper fluid, and motor oil, as well as substances that do not usually exist in liquid state, such as nitrogen, iron and glass) and each one returned a success. Test runs with solid materials such as diamond have failed, however, as it appears that SCP-294 can only deliver substances that can exist in liquid state.</p>\n<p>It is of note that after approximately fifty uses, the machine would not respond to further requests. After a period of approximately 90 minutes, the machine seemed to have restocked itself. It is also interesting to note that many caustic liquids that would have eaten through a normal paper cup seemed to have no effect on the cups dispensed by the machine.</p>\n<p>Testing is ongoing. As suggested, SCP-294 was moved to the 2nd floor personnel break room as a money-saving venture. Following incident 294-01, guards were stationed at the item and a security clearance became necessary to interact with it.</p>", "metacritic": null, "released": "2020-08-04", "tba": false, "updated": "2020-08-07T04:55:49", "background_image": "https://media.rawg.io/media/screenshots/2dd/2dd8b7182ee42ce423e9cf6227bb1abd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 22, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Android"], "developers": ["Yeetus_Deletus123"], "genres": [], "publishers": [], "esrb_rating": null}