{"id": 476860, "slug": "idle-mine-breakout-become-mining-tycoon", "name": "Idle Mine Breakout - Become Mining Tycoon!", "name_original": "Idle Mine Breakout - Become Mining Tycoon!", "description": "<p>🎮 Have you ever wondered how difficult it would be to mine precious resources using… a set bouncy balls? In our idle management game you can experiment with this crazy set of mining tools to gather precious metals and minerals! 🎮<br/><br/>⚒️<strong>BECOME MINING EXPERT</strong>⚒️<br/>Create your idle mining empire as you expand your business! As a newborn entrepreneur you’re starting your clicker adventure with only a set of simple, not so effective mining tools and an old mine you’ve acquired from your grandpa. It may seem that you’re stuck with your career and some dirt and cheap metals - but here’s where the upgrade investments kick in!<br/><br/><strong>UPGRADES AND BALLS CAN BREAK THEIR BONES</strong><br/>You’re starting your adventure with a simple set of uncommon mining tools - a ball and your finger. At first glance it may seem the tools are not very successful at resource mining, but there are multiple upgrades that can make idling a really powerful weapon. In this game the mining mechanic that’s inspired by old hits like breakout or arkanoid is combined into a fun, expanded clicker experience.<br/><br/>⛏️<strong>MINE, INVEST, REPEAT</strong>⛏️<br/>Sell the ores you’ve mined and reinvest money into multiple possible upgrades to improve your idle and activa gameplay. Not only can you improve the performance of your mining tools, but even improve the quality and quantity of mined resources and unlock new resource types. After you’ve earned enough money, there are multiple locations around the world to unlock - and each one gives you access to even more precious resources. At the very beginning you’ll mostly come across simple metals, but 💎 expensive gemstones 💎 are at your fingertips!<br/><br/>💛<strong>ACTIVE OR IDLE - IT’S YOUR CHOICE!</strong>💛<br/>While your mining effort mostly starts with active gameplay effort, you soon encounter multiple possibilities of work automation. Improve the idle performance of your mining tools and watch as your mining tools gather huge piles of money for you! It’s up to you whether you prefer to invest your time and improve the idle performance of your mines or just watch and relax as you click to gather precious materials.<br/><br/><strong>CONQUER THE WORLD</strong>🌍🗺️<br/>You’re starting with simple mine, but the possibilities are plenty! There are many mines you can buy around the world - each with new, higher tiers and quality of available resources. As you get access to multiple world regions, you can watch as all of the previously unlocked ones play themselves even when you’re not watching. It’s not about completing a simple set of levels like the old breakout games handled it, but about increasing possible set of levels as you progress into the game and invest more of your hard earned cash.<br/><br/><strong>SPECIAL EVENTS (COMING SOON)</strong>🕛<br/>We’re currently working on some new fun gameplay mechanics and they will be available for our players soon - and the most important one will be the addition of special events! Visit new mining sites and unlock new, mysterious resource types as you fight against or odds and passing time in this new challenge mode!<br/><br/>Features:<br/>💎Easy-to-learn gameplay. 😀<br/>💎Idle clicker mechanics<br/>💎Expand your mining empire<br/>💎Sell resources and invest in powerful upgrades. Improve your idle income and increase the power of your mining tools. 💰💰💰<br/>💎Collect powerful power ups to become even more successful<br/>💎Buy new mining sites and increase the maximum potential of your enterprise. Each unlocked site gives you access to new resource tiers and quality<br/>💎Make strategic business decisions. Unlock new upgrade opportunities or invest in the old ones to maximize their profit<br/>💎Play idle or actively assist your mining devices - you decide!<br/>💎Progress offline, even when the game is turned off! 🤑<br/></p>", "metacritic": null, "released": "2020-08-04", "tba": false, "updated": "2020-08-07T05:19:00", "background_image": "https://media.rawg.io/media/screenshots/138/1385ba5a733a6945729d7d4f705254bb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 106, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Aelita1992"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}