{"id": 476915, "slug": "the-red-death", "name": "The Red Death", "name_original": "The Red Death", "description": "Who will survive?\r\n<p>The Red Death is a short horror visual\r\nnovel in which your choices will determine who will survive to the\r\nevents revolving around an ancient, supernatural ritual. You are\r\nVail, a non-binary person with difficulties to socialize, who really\r\nwants to fit in with their new friends. You join them for a weekend\r\nin an isolated cottage, and everything seems to be going fine at\r\nfirst. But a dreadful plan is about to reach its conclusion, and\r\nthere are strange powers involved...</p>\n<ul><li>11000+ words and several choices, leading to five different endings with three unique epilogues.\r\nAproximately 40-90 minutes.</li><li>Disturbing art handmade on paper, including several character portraits.</li><li>An interactive horror story with influences from Edgar Allan Poe, 80s slasher movies and Japanese\r\nvisual novels.</li><li>English and Spanish language.</li></ul>\n\r\n¿Quién sobrevivirá?\r\n<p>The Red Death es una novela visual\r\ncorta de terror, en la que tus decisiones determinarán quién\r\nsobrevivirá a los sucesos acaecidos alrededor de un antiguo rito\r\nsobrenatural. Eres Vail, una persona no binaria con dificultades para\r\nsocializar, que desea encajar con sus nueves amigues. Te apuntas a\r\npasar con elles un fin de semana en una aislada casa rural, y todo\r\nparece ir bien al principio. Pero un plan espantoso, relacionado con\r\nextraños poderes, está a punto de llegar a su conclusión...</p>\n<ul><li>11000+ palabras y varias elecciones, que llevan a cinco finales diferentes con tres epílogos únicos.\r\nAproximadamente 40-90 minutos.</li><li>Arte inquietante dibujado a mano en papel, incluyendo varios retratos de personajes.</li><li>Una historia de terror interactiva con influencias de Edgar Allan Poe, el cine de terror slasher de los 80 y\r\nlas novelas visuales japonesas.</li><li>Escrita en español y traducida al inglés.</li></ul>", "metacritic": null, "released": "2020-08-04", "tba": false, "updated": "2020-08-07T05:30:23", "background_image": "https://media.rawg.io/media/screenshots/408/40828839659123aa2b4f7e09b1d8f8b3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 85, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Gorgon Games"], "genres": [], "publishers": [], "esrb_rating": null}