{"id": 47706, "slug": "fz9-timeshift-legacy-of-the-cold-war", "name": "FZ9: Timeshift - Legacy of The Cold War", "name_original": "FZ9: Timeshift - Legacy of The Cold War", "description": "Observe carefully, take AIM, and BANG! Eliminate the most violent terrorists in a whole new FPS game experience - the one and only FZ9: Timeshift!<br/><br/>Accompany Mak, a lost soldier who was injected an experimental serum named “FZ9” during the Cold War. He was trapped in a frozen state and fell to a long hibernation until he was revived to fight in the modern world of combat.<br/><br/>Enhanced by “FZ9” to the peak of human’s shooting skill, his ultimate mission now is to eradicate the AS -- a dangerous terrorist organization spreading fear and horror on a global scale.<br/><br/>Pick up rifles, machine guns, and rocket launchers to eliminate enemies with the aid of bullet time!<br/><br/>This best first person shooter (FPS) action game on mobile features your favorite weapons -- such as the Glock, AK-47, M4A1 -- and an in-depth upgrade system that allows you to create your own unique weapon in the Armory.<br/><br/>✪ KEY FEATURES ✪<br/><br/>&gt; Eliminate enemies in bullet time.<br/><br/>&gt; Delve into a deep storyline that branches out over 30 missions.<br/><br/>&gt; Stunning graphics feature breathtaking environment visuals.<br/><br/>&gt; Shoot with a huge variety of weapons FPS fans know and love.<br/><br/>&gt; Explore an in-depth upgrade system with RPG elements.<br/><br/>&gt; Challenge yourself Experience mind-blowing gunfights in Slow-Mo!<br/><br/>&gt; Multiplayer PvP mode bring competitiveness to a mobile FPS.<br/><br/>The hero who control time will rule the fate of this world!<br/><br/>---------------------------<br/><br/>✪ ELIMINATE ENEMIES IN BULLET TIME ✪<br/><br/>There’s no need to rush! Your surroundings are slowed down while choose your execution tactics. Observe carefully, take your aim, and BANG!<br/><br/>Fight your way against all odds utilizing this one of a kind time control power!<br/><br/>✪ A DEEP STORY BRANCHING OVER 30+ MISSIONS ✪<br/><br/>Accompany Mak, the tactical shooter on his quest to eradicate AS, the most dangerous terrorist organization nowadays. There will be struggles, glories and pains along the path. Expect a heart-wrenching war saga as it unfolds!<br/><br/>✪ ALL YOUR FAVORITE WEAPONS ARE HERE ✪<br/><br/>Glock, AK-47, M4A1, Rocket Launcher... Following the long journey Mak has to travel, various unique weapons can be picked up and fired. Do you prefer the smashing power of a shotgun / sniper or the incredible fire-rate of an assault rifle? Experience and make your own choice!<br/><br/>✪ IN-DEPTH UPGRADE SYSTEM ✪<br/><br/>Welcome to the Armory, where you’re provided with tons of upgradable perks that can be utilized to power-up weapons and tune each of them to your preference. There’s so much to summarize, so make sure to come and explore!<br/><br/>✪ VARIOUS GAME MODES TO ENJOY ✪<br/><br/>In addition to story missions, take on new challenges in three other game modes: Compete with other players in PvP, gather valuable resources in Cycle Missions, and get ready to be surprised with unique tests in the Weekly Challenge. Embark on a variety of daring missions -- and protect the world from terrorists!<br/><br/>---------------------------<br/><br/>✪ IMPORTANT ✪<br/><br/>FZ9:Timeshift is optimized for Android devices and required at least 1.5GB RAM. Internet connection is required to play.<br/><br/>NOTE: The game will require WRITE_EXTERNAL_STORAGE, READ_EXTERNAL_STORAGE, RECORD_AUDIO, CAMERA to allow players capture in-game video and share.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:10:54", "background_image": "https://media.rawg.io/media/screenshots/144/1443bc961324040df8ecfcf978b058e1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 299, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["HIKER GAMES"], "genres": ["Action"], "publishers": [], "esrb_rating": null}