{"id": 47702, "slug": "flipt", "name": "flipt", "name_original": "flipt", "description": "A colorful and unique match-3 game. Light on resources, big on fun :)<br/><br/>Tired of moving jewels around? Bored with the latest facelift on the same old thing?<br/><br/>Introducing a brand new dimension of matching 3 items! In flipt the game grid has two sides, a front and a back, and each side has their own colors. Tiles are \"flipped over\", swapping their back and front colors. If the new color matches an adjacent tile the flip is successful, if not, the tile will \"un-flip\".<br/><br/>When 3 or more adjacent tiles have the same color, they are removed and count towards the level goal. Each level increases difficulty by requiring more matches in less time and increasing the number of tile colors on the board.<br/><br/>The game provides three power-ups which are available from the start. Credits, which are earned by making matches of 5 or more tiles, are used to activate the power-ups.<br/><br/>Features:<br/>* Two sided grid, matches are made by flipping over tiles.<br/>* Tap-only game-play. Simplest interaction possible.<br/>* Fun and challenging.<br/>* Full statistics tracking with achievements.<br/>* Unified power-ups. Credits, which are earned by making large matches, are used to activate any of the three power-ups.<br/>* Supports Themes &amp; Tile Sets to customize the look of the game.<br/>* Full interactive tutorial!<br/>* Full help file.<br/>* Game is saved automatically when interrupted by phone calls, notifications, etc.<br/>* Full Android compatibility from Android 1.5 to Android 4.2 (JB), phones and tablets.<br/>* Supports all resolutions from QVGA (320x240) up to FULL HD (1920x1080), and beyond.<br/>* Runs fullscreen or in standard mode (with notification bar visible).<br/>* Free! No Ads!<br/><br/>Similar to: Bejeweled, Treasures of Montezuma, Jewels Deluxe.", "metacritic": null, "released": null, "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/197/197ab998bcb142fb1516c4bf001dac2b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 115, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["fractious"], "genres": ["Casual"], "publishers": [], "esrb_rating": "Everyone"}