{"id": 477113, "slug": "conversations-with-deleted-npcs", "name": "Conversations With Deleted NPCs", "name_original": "Conversations With Deleted NPCs", "description": "<p>On this page, you will find the playable source files for SOOTHSAYER'S AUGURY 3: THE DRAGONMASTER'S PORTENT.</p>\n<p>SA3: TDP was the third game in the popular Soothsayer's Augury series. The Soothsayer's Augury games were popular early text adventures from AMICO Inc., not unlike Colossal Cave Adventure or Infocom's Zork games.<br/></p>\n<p>SA3: TDP was supposed to release Christmas 1983, but after two rapid changes in creative direction, massive resource shifts, a period of intense crunch, a series of disastrous playtests, and the acquisition of AMICO Inc. by Infocom, the project was shuttered and everyone on staff was laid off. <br/></p>\n<p>Towards the end of production, the lead designer, John Leonard Lyles, had something of a nervous breakdown dealing with the tight deadlines, conflicting notes, and a rapidly shifting interactive market. Shortly after being laid off, JLL moved to Thailand and ordained as an ascetic in a Kammaṭṭhāna monastery. He lives there to this day.<br/></p>\n<p>Please note that these files, in this unfinished state, may only be of interest to ardent interactive fiction historians, text adventure hobbyists, and those interested in JLL's philosophies.</p>\n\n<p>These source files contain all the extant material from the game, along with JLL's code comments, which I think you'll see are a tad... eccentric. Most of the actual adventure is missing. All that remains is a  short intro... and three conversations with deleted NPCs.<br/></p>", "metacritic": null, "released": "2020-08-03", "tba": false, "updated": "2020-08-07T06:13:37", "background_image": "https://media.rawg.io/media/screenshots/d97/d970786b4c2f731d72f55d4c37c883d6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 20, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["CogsAndSpanners"], "genres": [], "publishers": [], "esrb_rating": null}