{"id": 477336, "slug": "pick-me-up-3d", "name": "Pick Me Up 3D!", "name_original": "Pick Me Up 3D!", "description": "The craziest ride sharing simulator game is back with more rides, drives, cars and cash than ever before! Drive to, pick up and drop off customers to their desired location. Can you earn the most tips of the summer?<br/><br/>How To Play:<br/><br/>- Tap and hold to drive<br/>- Release to brake<br/>- Avoid crashing into other vehicles<br/>- Collect cash and unlock sweet cars<br/>- Explore the world and check out popular monuments<br/>- Compete to earn the most tips<br/><br/>Subscription Terms<br/><br/>VIP Access offers a weekly subscription for $5.99 after a 3 day free trial. Upon purchase of this subscription, you will immediately receive: 3 elite cars, 200% in-game cash earned, 250 in-game cash bonus daily and remove all ads. Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable. This is an auto-renewable subscription. The payment is charged to your iTunes account after purchase confirmation. Your subscription is renewed unless you turn it off at least 24 hours before the period ends. Your account will be charged for renewal as well.  <br/><br/>The prices are set for United States customers. Pricing in other countries may vary and actual charges may be converted to your local currency.<br/><br/>See below links for more information.<br/><br/>Canceling your Subscription<br/><br/>Please visit this link: https://support.apple.com/HT202039<br/><br/>For our privacy policy visit: http://tastypill.com/privacypolicy<br/>For our terms of service visit: http://tastypill.com/tos<br/><br/>For any additional question, please contact us at: help@tastypill.com", "metacritic": null, "released": "2019-12-24", "tba": false, "updated": "2020-08-10T02:31:12", "background_image": "https://media.rawg.io/media/screenshots/1c1/1c12aff9fb95a5bf8cdf5f3b827c589b_00v9bci.jpg", "website": "http://tastypill.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 103, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["tastypill"], "genres": ["Simulation", "Racing"], "publishers": ["Tastypill"], "esrb_rating": "Teen"}