{"id": 477332, "slug": "my-lottery-dream-home", "name": "My Lottery Dream Home", "name_original": "My Lottery Dream Home", "description": "Wanna live the fantasy life? Design luxurious properties for the recent lottery winners each new episode. Play My Lottery Dream Home today, an exciting and addictive game that allows you to live the life of an interior decorator. Start a new creative hobby! Play with home decor styles, express your creativity, and improve your design skills by creating amazing interior spaces for overnight billionaires! In My Lottery Dream Home, you get to make incredible choices by creating aesthetic designs, renovating homes, and seeing your clients' dreams come true. Have fun exploring impeccable designs in ultra-quality graphics. Gain inspiration from top trending Pinterest home designs, play with IKEA like furniture and apply your new ideas in your real life.<br/><br/>-Renovate homes for recent lottery winners ranging from the newlyweds to Hollywood celebrities each new Episode<br/><br/>-Explore luxurious properties including vacation villas, celebrity villas and many more<br/><br/>-Play with realistic home decor inspired by Pinterest.<br/><br/>-Design, renovate and retouch the old buildings and rooms into modern <br/><br/>-Express yourself with an incredible variety of high-end designer furniture, lighting, flooring and other decor.<br/><br/><br/><br/>If you like HGTV home remodeling shows and browsing Pinterest, then My Lottery Dream Home is a perfect home design playground for you. My Lottery Dream Home is free to play, though some in-game items can also be purchased for real money.<br/><br/>Enjoying My Lottery Dream Home? Join our vibrant home design community on:<br/><br/><br/><br/>Facebook: https://www.facebook.com/PurpleCowStudios/<br/><br/>Instagram: https://www.instagram.com/purplecowstudio_cookapps/", "metacritic": null, "released": "2020-07-28", "tba": false, "updated": "2020-08-10T02:29:43", "background_image": "https://media.rawg.io/media/screenshots/9a4/9a40a47b80d00605a966796f575829b2_SuCQXcU.jpg", "website": "http://www.cookapps.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 228, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["CookApps"], "genres": ["Simulation", "Puzzle"], "publishers": ["cookapps"], "esrb_rating": "Everyone 10+"}