{"id": 47734, "slug": "juice-cubes", "name": "Juice Cubes", "name_original": "Juice Cubes", "description": "Pack your bags and take a vacay right in the palm of your hand in Juice Cubes! Join Pippin island hopping in this juicy PUZZLE adventure through a tropical paradise! <br/><br/>Connect three or more juicy cubes to create cascades of epic explosions! Create boosters and fruity bombs to climb your way to the top of the scoreboards! Surpass friends as you slice your way through 700 levels and explore new islands full of magic and adorable cube characters!<br/> <br/>Blast into space or jump aboard pirate ships as weekend events give out fresh and fruity prizes!  With new levels just added, you’ll enjoy beautiful backgrounds as you rise to the challenge! Download and join the millions that have found a special place for these crazy cubes today.<br/> <br/>Juice Cubes includes:<br/>✮Match 3 or more cubes to create crazy combos and banana blast! (Literally bananas!) It's just the right balance of difficulty!<br/>✮Connect to Facebook and compete against your friends!<br/>✮Over 700 fresh, fruity, and free levels with wonderful artwork, animation, and graphics! <br/>✮Even more cute and crazy characters than ever before!<br/> <br/>LIKE &amp; FOLLOW JUICE CUBES<br/> <br/>Juice Cubes Facebook: https://www.facebook.com/JuiceCubes<br/>Juice Cubes Twitter: https://twitter.com/JuiceCubes<br/><br/><br/> <br/>SUPPORT<br/> <br/>Having problems? Any suggestions? We would love to hear from you! Visit http://www.playlab.com/juice-cubes-support/ for FAQs, or email us at: support+JC@playlab.com<br/> <br/>Privacy Policy: http://www.playlab.com/privacy/<br/> <br/>Juice Cubes is completely free match 3 game to play with some in-app purchases. If you don’t want to use this feature, please disable in-app purchases.<br/> <br/>Please note that Juice Cubes makes use of your device's external storage to save game data and cache.", "metacritic": null, "released": "2013-10-31", "tba": false, "updated": "2019-10-22T14:12:55", "background_image": "https://media.rawg.io/media/screenshots/4ca/4ca1ce80f24757473187a3c3ef176b07.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 112, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Playlab", "Pocket PlayLab"], "genres": ["Family", "Puzzle"], "publishers": ["Pocket Play Lab"], "esrb_rating": null}