{"id": 477347, "slug": "the-grand-mafia", "name": "The Grand Mafia", "name_original": "The Grand Mafia", "description": "The Grand Mafia is an MMO and real-time strategy game based on the Mafia theme. You will get to play as a recently escaped convict who has returned to seek out revenge on those that set you up and took over the parts of the city you once controlled. To succeed, you’ll need to recruit men and women to join your mob, construct buildings to assist in your endeavors, and expand your influence beyond your domain. You may also join forces with factions of over 100 members to take over the city and perhaps even the states. <br/><br/>◎Take Over the Underworld◎<br/><br/>Players will need to take on the law and battle others to control the cities they reside in. Businesses will be up for grabs. Citizens seeking a better life will look to you as their savior. Models and celebrities will be turned to a life of crime by your dashing looks and intelligent strategies!<br/><br/>◎Worldwide Online Tournaments◎<br/><br/>You won’t be alone in this pursuit to live a life of crime! There will be players from all over the world competing with you for infamy. Will you join forces with them to form a faction or meddle in their operations to take them down a peg? Who will become the next godfather? Your actions will determine your fate!<br/><br/>◎Tons of Faction Events◎<br/><br/>After you’ve joined a faction, you’ll be able to take part in loads of weekly and seasonal events. Want to take over the local government together? Want to clean up the streets of any unworthy punks who want to criticize your reign of terror? Stay tuned for various cool competitions!<br/><br/>◎Customizable Strategies◎<br/><br/>Every player will be able to develop their criminal empire differently. There are different skills, stats, characters, and upgradeable contents within the game, which require your attention from the nuances of strategy to individualize your army with fully-fledged mechanics.<br/><br/>◎Different Styles of Fighting◎<br/><br/>This game offers all types of battles. Sometimes you’ll need to choose your special characters to tackle harder opponents. Other times you’ll have to organize massive Crews to invade the turfs of other players. There will be both interactive and idle battles to choose from!<br/><br/>◎Loads of Thugs to Choose From◎<br/><br/>There are loads of different types of thugs within the game. Bruisers, Gunners, Bikers, and Mortar Cars are all at your disposal! Each type of thug will have their own stats. You’ll need to upgrade these minions and choose the formations of your crews wisely. There will be times when you’ll need to be aggressively offensive, times when you’ll need to be overly defensive, and then there will be times when you’ll need to have stealth on your side!<br/><br/>◎Construct, Invest, and Date◎<br/><br/>How will you prioritize the development of your criminal empire? Will you take over local businesses? Invest in the right strategic upgrades? Improve the look of your Turf so that it strikes fear into your enemies? Perhaps you’ll just make everyone around you jealous by dating all the local hotties when they realize you’re the slickest crook in town!<br/><br/>Official Facebook: https://www.facebook.com/The-Grand-MafiaEN-111488273880659/<br/>Official Line: @thegrandmafiaen<br/>Official e-mail: tgmafia@yottagames.com<br/><br/>●Tips<br/>※ The app is free to download. There is some paid content available via in-app purchases.<br/>※ Please pay attention to your gaming time and avoid addiction.<br/>※ The content of this game involves violence (attack and other bloody scenes), antisocial, game characters wearing obvious sexual characteristics of clothing.", "metacritic": null, "released": "2020-08-06", "tba": false, "updated": "2020-08-10T02:35:10", "background_image": "https://media.rawg.io/media/screenshots/c05/c05496244c8dc1f80cac03f7221e2b94_R0eunXE.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 479, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["YOTTA GAMES"], "genres": ["Strategy"], "publishers": ["YOTTA GAMES"], "esrb_rating": "Mature"}