{"id": 477345, "slug": "titan-glory", "name": "Titan Glory", "name_original": "Titan Glory", "description": "Titan Glory is a sci-fi mech combat game with an emphasis on mech and weapon variety, multiple game modes and spectacular combat arenas.<br/><br/>In the near future, mech combat sports are all the rage! Various match rules and objectives bring the thrill of the game in glorious skirmishes filled with explosions and projectiles.<br/><br/>Taking part in tournaments and winning matches will earn you valuable credits and ranks. In turn these will give you access to 12 mechs with different weapon loadouts and attributes. For all of them you will have to choose which component to upgrade and where to push your machine to the limits.<br/><br/>Each mech comes with its own play style characteristics and weapon loadout. Upgrade this infernal machine to achieve utter arena dominance and glory.<br/><br/>The matches take place in 6 huge arenas designed for different play styles and scenarios. From urban centers to plan fields and ancient temples each arena has its own spirit and style.<br/><br/>Players can hone their skills in offline tournaments and finally come for the real glory in explosive 12 player online matches. Compete with people from all around the world or create your own private matches of your friends only.<br/><br/>12 mechs to unlock and upgrade<br/>6 huge varied arenas to master and dominate<br/>7 primary weapons for massive obliteration<br/>4 secondary weapons for a tactical advantage<br/>9 game modes to keep you on your edge<br/>12 tournaments to claim glory over<br/>12 player online matches", "metacritic": null, "released": "2020-08-05", "tba": false, "updated": "2020-08-10T02:34:18", "background_image": "https://media.rawg.io/media/screenshots/c41/c412cab7914c51277c0919ce7cab86cd_q8pahyf.jpg", "website": "https://www.atypicalgames.com/games/titan-glory/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 510, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Atypical Games"], "genres": ["Action", "Simulation"], "publishers": ["Atypical Games"], "esrb_rating": "Everyone 10+"}