{"id": 477346, "slug": "endless-colonies-idle-tycoon", "name": "Endless Colonies: Idle Tycoon", "name_original": "Endless Colonies: Idle Tycoon", "description": "The year is 2020. Darkness has covered whole planet. Forest fires, earthquakes and pandemics threaten humanity. While we haven’t ridden out the storm yet, we realize that the worst one hasn’t come until now! An asteroid! Astronomers report that an asteroid approaching earth will annihilate humanity very soon. Our time is limited. Humanity is in fear. We need heroes who can save us from the extinction!<br/><br/>Are you ready to be a hero? Save the humanity by leading your colonies!<br/><br/>Endless Colonies is an idle space simulator game that you can progress incrementally without a clicker mechanism. The aim of this idle space simulator game is to discover new planets, establish new factories and create a space empire! Be the number one millionaire tycoon of whole the universe! Invest to become the greatest adventurer capitalist of the planet!<br/><br/>Different from other idle games, you have a chance to develop your own strategy to manage your factories, transporters and workers! Power up transporters to fill mineral storage of factories and let your workers produce hundreds of products! Make profit, upgrade your workers and grow!<br/><br/>Collect crew cards and assign your astronauts as managers to boost your earning! Each card has unique skills to rule the game!<br/><br/>Prepare your spaceship to deploy! Explore new sectors and find new home planets to live! Collect rewards, activate boosts to grow fast!<br/><br/>Do you like midcore games? Are you a casual player? No matter how you define yourself, you are in the right place! Join us in this adventure and change the rules of surviving! The destiny of humanity is now in your hands!<br/><br/>Features:<br/><br/>1. Research more than 200 different products!<br/>2. Unlock 8 different worker characters per factory to progress!<br/>3. Unlock 5 different factories with various themes!<br/>4. Play with beautiful visuals and fun content!<br/>5. Assign crew members to boost your income!<br/>6. Explore new mineral planets and manage resources!<br/>7. Discover new creatures and collection items!<br/>8. Make prestige and speed up your factories!<br/>9. Idle cash: earn cash even if you are offline!<br/>10. Earn many rewards for your upgrades!", "metacritic": null, "released": "2020-07-14", "tba": false, "updated": "2020-08-10T02:34:44", "background_image": "https://media.rawg.io/media/screenshots/967/967b5ded5c4709b94121e238867945eb_tRLQBcK.jpg", "website": "https://giantavocado.games", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 245, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Giant Avocado Teknoloji Anonim Sirketi"], "genres": ["Strategy", "Simulation"], "publishers": ["Giant Avocado Teknoloji Anonim Sirketi"], "esrb_rating": "Everyone 10+"}