{"id": 477426, "slug": "the-adventures-of-crimes-johnson", "name": "The Adventures of Crimes Johnson", "name_original": "The Adventures of Crimes Johnson", "description": "The Adventures of Crimes Johnson\r\nPremise:\r\n<p>You play as Crimes Johnson, a man in prison with the ability to temporarily pause time! However, once the timer runs out, you are forced backwards in time to where you were when you activiated the ability. You must use this ability to break out!</p>\r\nObjectives:\r\n<p>There are two stages to escaping: Day, and Night.</p>\r\nDay Time\r\n<p>By the end of the day, you need to have a copy of the guard's key, to use at night. To create  a copy of the key, you need the following items in your inventory:</p>\n<ul><li>Soap Mould</li><li>Lighter</li><li>Toothbrush</li></ul>\n<p>To create a soap mould, you need:</p>\n<ul><li>Key</li><li>Soap</li></ul>\n<p>There is a clock in the prison. It starts at 06:00. Day time ends at 20:00. When that happens, you'll be moved to your cell. Make sure you have a copy of the guard key!<br/></p>\r\nNight Time\r\n<p>At night, you need to unlock your cell using the key you created. Then you need to collect the Stool from the Janitors closet. Then you can find and use a Vent to escape.</p>\n<p>There is a clock in the prison. It starts at 02:00. Night time ends at 06:00. If you don't escape in time, you lose.<br/></p>\r\nGameplay Mechanics\r\nInventory System\r\n<p>There is a simple inventory system in the game. Pressing ESC will display it. On the left are the inventory slots, on the right is the crafting slot. Clicking on items on the left will select them. If a specific set of items have been selected, the crafting option will become availble.</p>\r\nTime Pausing\r\n<p>Pressing T will pause time. on the top left of the UI is a counter, when this reaches 0, the ability runs out. When the ability runs out, you will be taken back to where you were when the ability was activated, and then time will resume. Pressing T will end the ability early.</p>\r\nEye Sight\r\n<p>When a prisoner can see you, a message will appear on the UI informing you that you are being watched. If you take any items while being watched, you'll lose the game. Pause time to avoid being seen!<br/></p>\r\nFuture Improvements\r\n<p>There are lots of improvements we'd like to make. We were very limited on the time we had to create this for Mini Jam 60. Some improvements we'd like to make are:</p>\n<ul><li>Key improvements (Time limit to return original key)</li><li>Sounds</li><li>Animations</li><li>Random item spawns</li><li>Guard roaming at night</li><li>Shower room</li><li>Multiple escape routes</li><li>Character interactions</li></ul>\r\nCredits\r\n<p>Code &amp; Art - Feisty Crab Studios<br/>Textures - @PudglyTheBear<br/></p>\n<p>------------------------------------------------------------------------</p>\r\nControls\r\n<p>WASD - Movement<br/>Mouse - Aim<br/>E - pickup items / interact<br/>T - pause/resume time<br/>ESC - open inventory<br/><br/></p>", "metacritic": null, "released": "2020-08-09", "tba": false, "updated": "2020-08-10T02:57:23", "background_image": "https://media.rawg.io/media/screenshots/ab5/ab5b7851e2ecd9031255bf336c5d832c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 17, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Feisty Crab Studios"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}