{"id": 47746, "slug": "free-casino-slot-machines-unique-vegas-games", "name": "Free Casino Slot Machines & Unique Vegas Games", "name_original": "Free Casino Slot Machines & Unique Vegas Games", "description": "Vegas Casino fun comes alive with OMG! Grand Casino Slots! Hit it rich with EPIC WINS, HUGE BONUSES and MORE! Join the slots fever - the casino is open, fun and free.<br/><br/>Play free slot games with great graphics and exciting features: classic slots, quick bonus games &amp; real- time tournaments! Enjoy social mobile casino slots and earn your way into the exclusive High Roller Lounge with EPIC payouts. <br/><br/>Enjoy awesome slot machines and bonus games. OMG! Casino Slots have over 100 pop slots you'll love and new ones are added all the time. Classic slots, popular slots, big bonus slots and more!<br/><br/>Play free casino games when you download OMG! Casino Slots now! It’s Las Vegas slots wherever you are.<br/><br/>OMG! Casino Slots Features:<br/><br/>100% Free Slot Games<br/>🎰 Free online gaming with exciting themes, features and freebies<br/>🎰 Popular slots with Expanding Wilds &amp; multiple pay lines that will multiply your winnings<br/>🎰 Mobile casino games with amazing graphics &amp; gameplay<br/><br/>Sizzling Hot Slots to Win Big<br/>🎰 Casino games with a huge Welcome Bonus &amp; Exclusive VIP Experience<br/>🎰 Casino game tournaments &amp; Mega Jackpots<br/>🎰 Hit it rich with the “Double or Nothing” feature, spinning wheel &amp; more! <br/><br/>Casino Games Gone Social<br/>🎰 Mobile casino games with the world’s 1st Social Cash Back games!<br/>🎰 Use exclusive Boosters to increase your wins!<br/>🎰 Play casino games in the VIP Club &amp; High Roller Lounge<br/><br/>Unique Slot machines, big bonus slots, Vegas slots and more are in the palm of your hand. Mobile casino games let you keep playing and winning as long as you keep spinning.<br/><br/>Play free casino slot machines and feel the excitement of a Las Vegas casino from the comfort of your own home. Download OMG! Casino Slots and be a winner!<br/><br/>Over 100 games to keep you high rolling including: <br/>- Wild Buffalo <br/>- Leprechaun Gold <br/>- 777 Aztec <br/>- Pink Diamond<br/>- Fortune Teller<br/>- Slots in the City<br/>- House of Spins<br/>- Orca’s Gold<br/>- American Jackpot<br/>- Magic Bingo<br/>- Triple Red Hot 7<br/>- Cash Boom<br/>- Hawaii Beach Party<br/>- Safari Mania<br/>- Magic Mirrors <br/>AND TONS MORE!<br/><br/>If you have any questions or suggestions, please feel free to contact support@luckyfishgames.com <br/>Like us on Facebook for fan page freebies https://www.facebook.com/OMGfortune <br/>Follow us on Twitter: https://twitter.com/omg_fortune <br/><br/><br/>*This product is intended for use by those 21 or older for entertainment purposes only. All wins are virtual and not real money.<br/>*Practice or success at social casino gaming does not imply future success at real money gambling.<br/>* Please note that OMG! Fortune Free Slots™ is free to play, but you can purchase in-app items with real money.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:10:51", "background_image": "https://media.rawg.io/media/screenshots/bc6/bc6c12d6d2b83606ee3b8452e4645ca4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 198, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["LuckyFish Games – Free Slot Machines"], "genres": [], "publishers": [], "esrb_rating": null}