{"id": 477418, "slug": "halt-beat", "name": "Halt Beat", "name_original": "Halt Beat", "description": "<p>Game made in 3 days for the Mini Jam 60: Crime.</p>\n<p>The limitation was to have a core mechanic revolving around Pausing.</p>\n<p>I found the limitation really interesting and inspiring. </p>\n<p>The theme helped me to brainstorm, but I am not sure I actually used it that extensively here. </p>\n<p>I actually developed this game prototype in 2 days,  solo.</p>\n<p><em>Implementing the enemies' AI was more time consuming than I expected!</em></p>\n\n<p><strong>How to play:</strong></p>\n<p>I recommend playing with headphones for better immersion!!!<br/></p>\n<p>The instructions are on the main screen of the game (until we have a proper tutorial implemented!).</p>\n<p>The goal is to prevent the enemies from stealing the glowing blue items and leaving the area with them by reaching the entrance/exit areas. To do that the player can use his pausing skill (\"Spacebar\" on PC and/or the bottom left button with a pause icon for touchscreens ). By using this skill the surrounding elements will be frozen and the player can move them around to his convenience.  The radius of the skill depends on the current stress level. </p>\n<p>The player can be moved around by touching/clicking anywhere on the screen.</p>\n<p>The stress level increases with time.</p>\n<p>The enemies will be destroyed when their timer is finished (on top of their head).</p>\n\n\n<p>The <strong>pausing mechanic</strong> that I implemented allows the player to stop the elements in its area of effect (which grows the higher the stress level is, see below).</p>\n<p>All elements paused can be moved by hand by the player to place them wherever is most convenient to prevent the enemies from stealing our precious and escape!</p>\n\n<p>On top of the \"pausing\" mechanic I added a \"stress\" mechanic. The more stressed you are, the more powerful your skill is!</p>\n<p>For now only the radius of the area of effect is affected by the stress level.</p>\n<p>I'd like to expand this mechanic along with the Pause mechanic.</p>\n\n<p>At least one <em>other enemy type</em> is already planned:</p>\n<ul><li>a bigger enemy that tries to kidnap the player instead of stealing the glowing items (here is drawing  prototype below :))   </li><li>any suggestion...?</li></ul>\n\n\n<p>Other <strong>ideas for improvement</strong> (apart from the obvious current lack of polish):</p>\n<ul><li>bigger areas</li><li>different levels</li><li>better world building (more immersion)</li><li>add a little bit of lore</li><li>environment art to fit with the characters / lore</li><li>improve AIs (the thieves are often stuck, they can eventually find their way to the glowing items and the exits but that's just a basic implementation)</li><li>performances (seems to be pretty laggy with the debug version on Android)</li><li>add immersive tutorial</li><li>improve the pausing skill mechanic</li><li>enrich the stress mechanic</li><li>any suggestion...?</li></ul>\n\n<p><strong>All comments are appreciated. Feel free to share your thoughts and your ideas and suggestions too!</strong></p>", "metacritic": null, "released": "2020-08-09", "tba": false, "updated": "2020-08-10T02:55:29", "background_image": "https://media.rawg.io/media/screenshots/0ac/0acc54b34eaa1f7a8456ae76d3208065.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 1, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Android", "Web"], "developers": ["Alariann"], "genres": ["Action", "Puzzle"], "publishers": [], "esrb_rating": null}