{"id": 47759, "slug": "mu-origin", "name": "MU Origin", "name_original": "MU Origin", "description": "Get ready for the Full 3D EPIC MMORPG experience! Mobile MMORPG will never be the same!<br/>Experience an exciting real time MMORPG that lets you embark on an epic fantasy journey. <br/>Meet friends, create parties, and gear up to fight against the evil on a vast open world to bring back tranquility. <br/><br/>MU Origin 3.0 Update!<br/>Mount System - New friends have joined your journey! Acquire, strengthen and evolve the Mount! Fast movement and stylish appearance are not everything about the Mount. The more Mounts you acquire, the stronger you will become!<br/>\"Server Dungeon - Infernal Canyon - A new server dungeon for warriors who desire more challenges! Fight shoulder-to-shoulder with four other warriors and defeat Rapputh in the Infernal Canyon! <br/>Various rewards await the most courageous in the end!\"<br/>Awaken System - Warrior, your potential is infinite! Let your equipment awaken with Awaken Stones and go beyond the limit!<br/>\"Server Assault - A brand new paradigm of server war! Introducing Server Assault where your whole server fight against others, conquer them, and loot resources.<br/>Exclusive accessories and other rewards will be given to those who contribute to the battle!\"<br/>Aybss Temple - An unknown area where darkness controls over everything, Abyss Temple is now open for the warriors over 14 Rebirth. Many warriors have entered to discover the area, but most failed and never returned. Find the cause that maddened the creatures, and eliminate the darkness from the Abyss Temple!<br/><br/><br/>FEATURES<br/>- Choose and customize from three different classes: Dark Knight, Dark Wizard, and Elf.<br/>- Equip and evolve your hero with powerful gears and enhance wings to make yourself unstoppable.<br/>- Enhance their abilities and witness the dazzling display of each hero’s unique skills.<br/>- Your powers are endless! Become stronger through endless levels and contents!<br/>- Journey through an exciting open world and complete epic quests.<br/>- Gather parties and explore unique dungeons to defeat world bosses!<br/>- Gather Diamonds, Materials, Zens, and Star Essences in open PVP Areas! Dominate and hoard them all!<br/>- Exchange in real time through Trading and Auction System.<br/>- Clash with rivals in PvP battles and become the PVP King!<br/><br/>Join forces with powerful players and conquer enemies in the immersive world of MU Origin today!<br/><br/>Like us on Facebook: http://bit.ly/MUOriginFB<br/>Visit our Forums: http://bit.ly/MUOriginForum<br/>Need help? Visit: http://bit.ly/GMOSupport<br/><br/>Note: A network connection is required to play.<br/>*MU: Origin\" is only available in English.<br/><br/>-----------------------------------------------------<br/>By downloading this game, you agree to the Terms of Service, Privacy Policy. <br/>Terms of Service: http://www.webzen.com/Rules/TermsOfService-Mobile<br/>Privacy Policy: http://www.webzen.com/Rules/PrivacyPolicy-Mobile<br/>-----------------------------------------------------<br/><br/>MU Origin requires access to the following data to start the game.<br/>1. Your Google+ account data may be used to assist in sign-up and login to the game.<br/>2. Your game account data may be used to send events and notices through Push Notification.<br/>3. Your device storage may be checked in order to install updates or fix bugs.<br/><br/>Please note that we do not support devices that run on Asus/Intel processors.", "metacritic": null, "released": "2016-07-28", "tba": false, "updated": "2019-08-19T08:06:11", "background_image": "https://media.rawg.io/media/screenshots/e62/e62c82d891c253c8ba4430acaa7ef78b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 417, "game_series_count": 4, "reviews_count": 3, "platforms": ["Android", "iOS"], "developers": ["Webzen"], "genres": ["RPG"], "publishers": ["Webzen"], "esrb_rating": null}