{"id": 477591, "slug": "ouroboros-itch-blackmothentertainment", "name": "Ouroboros (itch) (BlackmothEntertainment)", "name_original": "Ouroboros (itch) (BlackmothEntertainment)", "description": "<p>Ouroboros was originally made in 2004! It was created in Dark Basic for a competition hosted by The Game Creators, where the aim was to create a modern spin on one of three classic games, I chose to take Snake and turn it into more of a puzzle game.  You can see the results here, though some of the links are dead because this was from way back in 2004, there used to be a whole review of each competition entry. The game was made in three months.<br/></p>\n<p>Ouroboros is a snake remake with a puzzle solving focus, the game is filled with locks, switches, keys, collapsing floors, etc. and the game's main gimmick where upon collecting all the scarabs within a level you then have to devour your own tail to complete the image of an ouroboros.</p>\n<p>Game comes with a few game modes, Pyramid, the main mode, where you go through a series of increasingly challenging levels, a more classic version of snake without puzzles, and a level creator.<br/></p>\n<p>Music was created by Parsec Productions.<br/></p>\n<p>So again, this is an old game, may be problems I can't do anything about this far out, and definitely things I would change going back.  Particularly the spikes that are on a timer are a real pain and I have no idea why I did not make them have some kind of warning they were about to pop up. And the levels that require you to go into first person mode should be destroyed, but they are not necessary to beat the game as the main game has a choose-your-own-progress kind of mechanic.  Controls are a bit weird too, you have to hold the direction down as the controls don't really queue the way you woudl expect them to.<br/></p>", "metacritic": null, "released": "2020-08-09", "tba": false, "updated": "2020-08-10T03:31:21", "background_image": "https://media.rawg.io/media/screenshots/540/54011406a895d5f2bf2387b97036a6f8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 151, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BlackmothEntertainment"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}