{"id": 47787, "slug": "quantum-revenge-mecha-robot-space-shooter", "name": "Quantum Revenge - Mecha Robot Space Shooter", "name_original": "Quantum Revenge - Mecha Robot Space Shooter", "description": "Quantum Revenge is an addictive shooter blasting action game threatening the existence of the rest of the human race. Featuring breathtaking 3D/2D animation, highly stylized aggressive aliens and robots inspired from the Manga / Anime  especially the 'Mecha' heritage genre with man controlled robot fighters.<br/><br/><br/>Key features of Quantum Revenge are:<br/><br/>■ Fight epic battles in space<br/>Battle against large number of enemies and boss fight, in mesmerizing 3D, and animated 2D art and manga cartoon animation at full frame rate with AAA quality 3D effects and huge amounts of effects on screen. <br/>Featuring five missions, with two bosses each, and an epic finale. <br/><br/>■ Pilot and Customize your Mecha:<br/>6 different robotic armours and player are available with different abilities and special attacks.<br/>Upgrade your armour with different modules like shield, drones and more.<br/>3 unique companion drones including Homing, Cryo Laser and Turret<br/><br/>■ Show off skills around the globe:<br/>With Google Play Games or Facebook realtime leaderboard, see your progression against the player better ranked than you while you play.<br/><br/>■ High quality graphics and support for latest hardware<br/>Realistic physics engine<br/>Advanced 2D Animation engine,<br/>Advanced 3D Engine with optimized for latest tablets in 2017<br/>Exclusive music track from Goldchimes <br/>Dual and single-stick touch control configurations<br/>Bluetooth controller support<br/><br/>In the year 70 of the Galactic Calendar, humanity left Earth for colonizing new solar system, like the 14th solar system. Many years after, the troops of Rokuseya are devastating our solar system, destroying every planet and life, but Tetsuji, Shin and Katashi are the elite pilots and the last line of defence to save Earth.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:10:48", "background_image": "https://media.rawg.io/media/screenshots/54f/54fa89fa7ce571e58f9a2928036da7fe.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 254, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Realtech VR"], "genres": ["Arcade"], "publishers": [], "esrb_rating": null}