{"id": 478, "slug": "rush-rally-2", "name": "Rush Rally 2", "name_original": "Rush Rally 2", "description": "5 / 5 - Touch Arcade - \"Easily one of the best racing games on mobile\"<br/>9 / 10 - Pocket Gamer - \"You should grab this as soon as you get the chance\"<br/>9 / 10 -  Multiplayer.it - \"Undoubtedly the best rally game on mobile\"<br/>--- International mobile game awards (IMGA) game of the year award Nominee ---<br/><br/>Race the most authentic rally simulation on your mobile all at an astounding 60fps, this is console quality racing on your mobile!<br/><br/>RACE IN ALL CONDITIONS OVER LOADS OF TRACKS!<br/>Race at night or day in rain or snow! Rally through 7 Countries, over 72 unique stages each with different surface types including snow, gravel, tarmac and dirt!<br/><br/>WORLD RALLY CHAMPIONSHIP RACING!<br/>Authentic Rally Championship and Rally Cross game modes. Compete in a full championship on A-B stages or go metal-to-metal with other cars in Rally Cross. <br/><br/>CUSTOMISE YOUR RIDE!<br/>A garage full of cars waiting to be driven and tuned. The best car dynamics model to date on a mobile platform from over 10 years experience on games such as MotoGP, Formula1, Split-Second, Sonic and Sega All Stars Racing and many more!<br/><br/>COMPETE WITH FRIENDS, MULTIPLAYER AND OFFLINE!<br/>Connect to Facebook or Game Center, race against your friends ghosts at any time you like or compete in the world rankings with real-time multiplayer!<br/><br/>EXPERIENCE THE THRILL OF OUR SKILL GAME MODES!<br/>Feel the rush by taking on a selection of our mini games, race through roadworks, dodge missiles and even pull trailers.<br/><br/>OPTIMISED FOR TOUCH!<br/>A control system designed specifically for touch devices mean racing becomes more fun and consistent, with the ability to scale, move and swap buttons to suit your needs. <br/><br/>TILT SUPPORT!<br/>Don't like touch, you can still use tilt or a controller!<br/><br/>MFI SUPPORTED<br/>Full MFi controller support for those who want to push their skills that little bit further!<br/><br/>DEVELOP INDIE SHOWCASE FINALIST 2014<br/>Short listed by a panel of games industry experts in the Develop Indie showcase awards 2014.<br/><br/>FAST REALISTIC RALLY RACING AT ITS BEST! VISIT THE FAN PAGE:<br/>http://www.rush-rally.com<br/><br/>-- This app has NO in-app purchases and NO adverts -- <br/><br/>--  60fps is only possible on top end devices due to graphical limitations --", "metacritic": null, "released": "2016-05-18", "tba": false, "updated": "2019-08-02T04:55:01", "background_image": "https://media.rawg.io/media/screenshots/c4c/c4c74c70656070683cca49c2ba15e507.jpg", "website": "http://www.rush-rally.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 2, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 218, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android", "iOS"], "developers": ["Brownmonster", "Stephen Brown"], "genres": ["Simulation", "Sports", "Racing"], "publishers": ["Brownmonster", "Stephen Brown"], "esrb_rating": null}