{"id": 478102, "slug": "eugenes-casualties-of-causality", "name": "Eugene's Casualties of Causality", "name_original": "Eugene's Casualties of Causality", "description": "<p><strong>NOTE: </strong>You can skip levels by pressing N - if you're stuck or frustrated, check out some of the later levels!<br/></p><p>Eugene from Eugene just can't catch a break. This time he went and ticked off the Cosmic Wych- and she's trapped him in her Quantum Country Club! The only way out is to navigate through her Death Golf course, located in the Chronodome, where time does not always flow linearly. But he won't be able to do it alone. Luckily he's made a new <em>causal</em> acquaintance- himself, from the past! Actually, many himselves. Their timelines end, so that his may continue. Eugene from Eugene meets Eugenes from Eugene in: Eugene's Casualties of Causality!</p>\n<p>Thanks for looking at our game! We're super excited to share it with you. We think it's pretty fun to play, and we'd love any feedback you could provide if you give it a shot! Also- let us know your scores!</p>\n<p>This game was made in 7 days for Brackeys Jam 2020.2 (https://itch.io/jam/brackeys-4). The theme was <strong>\"REWIND\"</strong>.</p>\n<p><strong>Controls</strong><br/></p>\n<ul><li>WASD / Left Stick - Move Eugene</li><li>Space / Bottom Face Button - Jump</li><li>Z / Right Face Button - Rewind time (when dead)</li><li>R / Left Face Button - Reset Current Level</li><li>N to skip level (For reviewers who get frustrated! Note: you will not have a score for that level)</li></ul>\n<p><strong>Credits</strong><br/></p>\n<ul><li>All programming and design by Bokonon (Matt Lempisky) and Yossarian.</li><li>All art was created by mouse in Aseprite.</li><li>Music was created via Beepbox</li><li>Audacity for sound creating editing</li><li>FreeSound.org for some SFX</li><li>DaFont.com for some fonts</li></ul>\n<p><strong>F.A.Q.</strong></p>\n<ul><li><strong>How many Eugenes can I make?</strong><ul><li>We didn't put an upper limit on that. Have fun- but keep an eye on your Death Golf score if you're going to make Eugene make lots of Eugenes. Also, inevitably, refer to the following question.</li></ul></li><li><strong>Eugene is stuck! What do I do?</strong><ul><li>If Eugene gets stuck- we tried to avoid this, but the poor guy is under a lot of pressure- just hit R on the keyboard, or the left face button on a controller to reset the level. Since we want people not to get frustrated, this will reset your score for that level to 0 so you can reset all you want!</li></ul></li><li><strong>Hm.. it looks like my scorecard didn't register my score for course 3 / my scorecard switched course 3 and 4!</strong><ul><li>Didn't we mention that time doesn't move linearly in the- ah, who are we kidding? We switched those two around accidentally on the scorecard. The pars should still be correct- just the position of those two courses is switched. Chalk it up to chronotons, or inverse temporal quarks or something.</li></ul></li></ul>", "metacritic": null, "released": "2020-08-08", "tba": false, "updated": "2020-08-10T05:41:28", "background_image": "https://media.rawg.io/media/screenshots/dbb/dbbd1f3c60ceef1b104b202935a521c7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 188, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["Bokonon Yossarian"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}