{"id": 478124, "slug": "robbin-in-the-wood", "name": "Robbin in the Wood", "name_original": "Robbin in the Wood", "description": "<p>ROBBIN IN THE WOOD is a stealth horror game made for the Brackeys Game Jam 2020.2. </p>\n<p>The game is set in the scottish woods on the night of a supernatural event. You break down in the middle of the wood and must hunt for parts equiped with only your flashlight. Collect all 5 parts and return to your car to escape. <br/></p>\n<p>Strange things happen late at night in the woods. You quickly figure out that you are stuck in a time loop and keep flashing back 60 seconds. However, your previous selves persist across loops, so remember where you have been otherwise you might meet an unexpected foe. <br/></p>\n<p>Your flashlight gives away your position, so turning it off will help you hide. <br/></p>\n<p><strong>Controls </strong><br/></p>\n<p>Move: WASD</p>\n<p>Toggle Flashlight (makes you harder to spot): F</p>\n<p>Interact: E</p>\n<p>Hold Left Shift: Direction of nearest object<br/></p>\n<p><em>Note: We tried to reduce the \"cheap\" scares so there are no pop-up/purposeful jumpscares -- those just aren't fun to us. There are some louder noises occasionally, but hopefully you should be able to know when its about to happen. We built the game to be suspensful not horrific!</em></p>\n<p><strong>Credits<br/></strong></p>\n<p>We used audio licensed under Creative Commons, thanks to the following: </p>\n<p>Flashlight Click, CreepyPastry</p>\n<p>Howling Wind Ambience, DBlover</p>\n<p>Fedefrede, Car door close engine start</p>\n<p>WillyBilly, RFX Car Engine Acceleartor and Switch Off</p>\n<p>Qubodup, Door Smash 3</p>\n<p>Unfa, Rumble Loop 10s<br/></p>\n<p>The Cynic Project, Dark Forest Theme</p>\n<p>Loopster by Kevin MacLeod<br/>Link: https://incompetech.filmmusic.io/song/4991-loopster<br/>License: http://creativecommons.org/licenses/by/4.0/<br/></p>\n<p><strong>Developer's Note<br/></strong></p>\n<p>This was our team's first attempt at a 3D game. We were inspired by the pixely look of PSX horror games so tried (some what successfully) to replicate it.  We learnt a lot but realised that 3D is a very different beast to 2D. <br/></p>", "metacritic": null, "released": "2020-08-08", "tba": false, "updated": "2020-08-10T05:47:02", "background_image": "https://media.rawg.io/media/screenshots/3e9/3e96eaaaa63cec8ef89138886eccca12.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 47, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["freddiejbawden"], "genres": [], "publishers": [], "esrb_rating": null}