{"id": 47837, "slug": "super-spartan-fury-world", "name": "Super Spartan Fury World", "name_original": "Super Spartan Fury World", "description": "<p>MegaManX inspired platformer game! Just jump and shoot! Available for both Phones and Tablets.</p><p>STORY★</p><p>A great shadow has descended over Olympus the mythical land of the gods, chaos creatures born of the darkest parts of the void defile this once peaceful and majestic land.</p><p>Zeus has called upon the bravest mortal of his time, the legendary brave and fearsome king of Sparta, Leonidas. Answer the call and make your way to meet with the king of gods himself, Zeus.</p><p>Journey to the center of the corruption and purge the land in the name of the gods, avoid devious traps and face off with fiendish bosses. Discover the truth behind this foul invasion, and destroy the mastermind behind it.</p><p>Great riches and prestige await you hero, your quest is perilous and full of danger around every corner. Save the land and become the savior of the gods!</p><p>Features★</p><p>★Over 40+ intense and fun levels!</p><p>★Fight evil bosses themed around the demons of Greek mythology!</p><p>★Jump and shoot your way to victory! unleash the fury of King Leonidas!</p><p>★Collect treasure to help you along your journey!</p><p>★Traverse Olympus in both the light world and the corrupt dark world!</p><p>★Future updates with more levels and more boss battles!</p><p>More★</p><p>★Follow us on twitter [at]Uri_we_r_u</p><p>★If you have any issues with the game please contact us at our email or on twitter, we check both daily and will get back to you asap!<br/></p><p>App with HD optimized graphics.</p>", "metacritic": null, "released": "2015-09-16", "tba": false, "updated": "2020-04-06T10:35:02", "background_image": "https://media.rawg.io/media/screenshots/d2e/d2e480cff25e147388ffc477e38efbc1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 198, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Android"], "developers": ["Unity Realm"], "genres": ["Arcade", "Platformer"], "publishers": [], "esrb_rating": null}