{"id": 478357, "slug": "last-train-to-tranz-central", "name": "Last Train To Tranz-Central", "name_original": "Last Train To Tranz-Central", "description": "<p><strong>* Part 1 files are free - look for the 'demo' files at the end of this page. *</strong></p>\n\n<p><strong>Welcome to Last Train to Tranz-Central, a two-part run 'n' gun adventure for the beloved  ZX Spectrum! :D</strong></p>\n\n<p><strong>Part I: All aboard the Space Train!</strong><br/></p>\n<p>In the Wild West frontier of the future, Space Trains race across the stars, piloted by powerful next-gen Artificial Intelligence (A.I.) with a whopping 48k of memory each.</p>\n<p>I know!</p>\n<p>Tech this advanced always goes wrong (right?). Following a hook up with incompatible peripherals at a remote space (train) station, the A.I.s have become corrupted and sent several Space Trains on a crash course with populated planets!</p>\n<p>It’s up to Maurice, The Space Cowboy, to reach the rogue A.I. in each train’s engine room before the outposts become a crater the size of Nebraska…</p>\n<p>Each train is now the last train… unless you succeed!</p>\n\n<p><strong>Part II: The return of the Space Cowboy</strong></p>\n<p>Tranz-Central is saved! But small splinters of code have infected four more trains, heading towards brand new targets.</p>\n<p>New and old enemies are on board to stop anyone interfering.</p>\n<p>But the Space Cowboy has returned, leaping from train to train, striving to put right what might go  wrong.</p>\n<p>Hoping each time that the next train will be the train home…</p>\n\n<p>FEATURES:</p>\n<p>* A two-part Run 'n' Gun game for the ZX Spectrum</p>\n<p>* 64 levels in total across 8 unique Space Trains (each part has 32 levels, spread across 4 trains)</p>\n<p>* 8 Rogue AI bosses to defeat or escape from.</p>\n<p>* 128k versions feature cosmic music by Yerzmyey<br/></p>\n<p>* Multiple enemies - some you can shoot, some you can't, all will kill you /o\\</p>\n<p>* Keys: QAOP and Space - can be redefined</p>\n<p>* Kempston Joystick Support</p>\n<p>* Each part has its own loading screen/presentation/music</p>\n<p>* Colour clash! \\o/</p>\n<p>* Made with Multi-Platform Arcade Game Designer (MPAGD) by Jonathan Cauldwell</p>\n<p>* Possible port to other systems thanks to being made with MPAGD</p>\n<p>* From the Sheep that madeJumpin' Jupiter :)</p>", "metacritic": null, "released": "2020-08-08", "tba": false, "updated": "2020-08-10T06:41:08", "background_image": "https://media.rawg.io/media/screenshots/614/6140634ba852cf4a02edbad56e7ace61.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 227, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Quantum Sheep"], "genres": ["Action", "Platformer"], "publishers": [], "esrb_rating": null}