{"id": 478523, "slug": "timekeep", "name": "Timekeep", "name_original": "Timekeep", "description": "<p>Timekeep is a puzzle platformer that lets you create wormholes through time.</p>\r\nFor centuries, the royal family of Elaine kept secret their knowledge of time travel.<br/><br/>\r\nTheir practices were shared only with their children and a classroom of orphans they elected to take in.<br/><br/>\r\nEventually, the family's reticence led the church to brand them as witches.<br/><br/>\r\nThe entirety of the Elaine Estate was engulfed in flames in a single night.<br/><br/>\r\nThe children narrowly escaped their demise, the only survivors being those gifted golden pocketwatches.<br/><br/>\r\nYears later, the King's only daughter by blood returns to the castle, seeking to reunite with her closest friend.\r\n<p>You play as Mina, a rabbit revisiting her home years after its destruction in search of her alligator friend Secil. With the ability to temporarily bend time in small areas, you can overcome hazards and discover treasure spread throughout the dilapidated castle.<br/></p>\n<p>Use WASD + Space to move around, left click to create wormholes and right click to clear them.</p>\n<p>There are a total of FIVE levels, after which you return to the title screen.</p>\n<p>CREDITS:<br/>Artist: CameraCore (@CameraCore)<br/>Level Designer: Flatflyer (@Flatflyer_) [nsfw twitter warning]<br/>Programmer: rubic (@paradoxrevolver)<br/>Music: SadColor (@fukouiro)<br/>Special thanks to: My brother for giving us the game title within 25 seconds of seeing the game, just like he promised. He only uses Twitch so here's that.</p>\n<p>Our team had a lot to add to this game but there's only so much we could get done in a week. Partial work already exists for level selection, story cutscenes, sound effects, several new game elements and, of course, new levels. The results and feedback we get from Brackey's Game Jam 2020.2 will definitely help us decide whether or not we want to continue working on Timekeep!</p>", "metacritic": null, "released": "2020-08-08", "tba": false, "updated": "2020-08-10T07:21:08", "background_image": "https://media.rawg.io/media/screenshots/91d/91d077d5d8a096c7bf8e2062c782881a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 63, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["rubic", "Flatflyer", "SadColor", "Camera"], "genres": ["Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}