{"id": 478705, "slug": "fattoria-mallory", "name": "Fattoria Mallory", "name_original": "Fattoria Mallory", "description": "<p><strong>Benvenuti alla Fattoria Mallory!</strong><br/></p>\n<p><em>Note for non italian speakers: this game hasn't been translated in english yet. Since it's not so text-heavy, you can still understand what's going on. Anyway I hope to translate it as soon as possible. </em></p>\n<p>La Fattoria Mallory è un incrocio tra visual novel e gioco di carte in solitario creato con <em>Ren'py</em>, un noto software <em>open source</em>.</p>\n<p>Lo scopo del gioco è quello di sconfiggere il <strong>mostro squamato </strong>che aleggia minaccioso sulla fattoria, cercando di portare a 0 almeno una delle sue quattro caratteristiche entro il 50° giorno.</p>\n<p>Per farlo, bisognerà affrontare gli <em>Sho-Shep</em>, terribili servitori del mostro, prendendo di volta in volta le giuste decisioni ed evitando che il tempo a disposizione o i propri punti vita raggiungano lo zero.</p>\n<p>I <strong>cinque abitanti </strong>della fattoria ti daranno una mano in questa difficile missione, poiché sembra che anche loro abbiano interesse a liberarsi dal giogo mostruoso di questa ingombrante presenza!</p>\n<p>Gli eventi giornalieri vengono «pescati» da un deck (o mazzo) di 53 eventi composto come segue:</p>\n<ul><li><em>Eventi battaglia:</em> con essi è possibile attaccare il mostro evitando gli Sho-Shep, infliggendo danni in una delle sue caratteristiche (pescate a rotazione);</li><li><em>Eventi bonus/malus: </em>in cui si possono ottenere bonus o penalità alle proprie caratteristiche, cioè all'ammontare dei danni che si possono infliggere al mostro;</li><li><em>Eventi di manipolazione temporale:</em> in cui si può andare avanti o indietro nel tempo di qualche giorno;</li><li><em>Eventi di cura:</em> in cui si ripristinano tutti i propri punti ferita;</li><li><em>Altri eventi: </em>che consentono, ad esempio, di rimescolare tutti gli eventi del deck oppure di ottenere un repellente con cui evitare di affrontare gli Sho-Shep.</li></ul>\n<p>Oltre agli eventi casuali, <strong>ogni 10 giorni (effettivi) </strong>viene proposta la scelta tra una serie di eventi favorevoli.</p>\n<p>Nel gioco ci sono <strong>7 finali possibili</strong>.</p>\n<p>Sebbene il gioco sia rilasciato alla versione 1.0 e sia completo, può essere considerato più una questione simbolica per l'autore che un videogioco dotato di particolari ambizioni.<br/>Cionondimeno, l'autore si riserva il diritto e lo sfizio di aggiornarne le meccaniche nel corso del tempo, anche eventualmente accogliendo i suggerimenti di quanti vorranno provarlo e contribuire. Il gioco sarà sempre gratuito e open source.</p>\n<p>Non resta che augurarvi una felice permanenza alla Fattoria Mallory all'ombra dell'enorme, minaccioso mostro squamato.<br/>Buona fortuna!</p>\n<p>Per sapere di più della vicenda misteriosa a cui il gioco si ispira:</p>\n<p>https://fattoriamallory.github.io/<br/></p>", "metacritic": null, "released": "2020-08-08", "tba": false, "updated": "2020-08-10T08:03:35", "background_image": "https://media.rawg.io/media/screenshots/606/606bb7bc96f6a9165e5d6a08d1c460ea.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 91, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["GIPPOplay"], "genres": [], "publishers": [], "esrb_rating": null}