{"id": 478909, "slug": "soviet-warmonger", "name": "Soviet Warmonger!", "name_original": "Soviet Warmonger!", "description": "Welcome, Comrade! ☭\r\n<p>The year was 1963, Soviet-controlled Russia and the United States of America were deep in the Cold War. With the Cuban Missile Crisis proving to be effective at discouraging the US, the USSR was ready for the next plan of action to bring America to chaos.<br/></p>\n<p>The Soviet Academy of Science had a team of top engineers who worked around the clock to develop computational algorithms and programs that would aid Soviet command in the war effort. One of those programs was a secret simulation program that would predict the outcome of a new civil war in the US. The simulation predicted how the selling of weapons and artillery to warring factions in the United States would bring the eventual end of the nation. These warring factions were created by Russian spies shortly before the Cuban Missile Crisis when America was at its weakest and most paranoid point. Americans lost faith in their government and were swayed by the ideas of the new factions.<br/></p>\r\nWelcome to the Warmonger simulation.\r\n<p>Soviet Warmonger is based on the very same top secret simulation program that was developed in 1963. Russia kept this program classified until now, so that the public may relive the turning point in the Cold War for the USSR. You must help bring down those capitalists and keep America's second civil war going for as long as possible, prevent a stalemate, and prevent one side from regaining control of the United States and reforming the government.</p>\n<p>Do you have what it takes to bring down those capitalist pigs again?<br/></p>\n\n<p>This game is still under development and may contain some bugs. Please report them via our Discord server<br/></p>", "metacritic": null, "released": "2020-08-08", "tba": false, "updated": "2020-08-10T08:45:22", "background_image": "https://media.rawg.io/media/screenshots/455/45512613c3c0b42cfa98a2dabaf4208c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 77, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Piginatuxedo", "mattattackitch"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}