{"id": 478987, "slug": "king-of-tapes", "name": "KING of TAPES", "name_original": "KING of TAPES", "description": "<p>Have you ever wondered what it would have been like to live in the golden age of video? Are you tired of the perfect convenience of Netflix? Would you like to own an extensive collection of movies on physical media?</p>\n<p>Let's rewind time and go back to the age of VHS cassettes!</p>\n<p>You have just scored your dream job in a video tape rental store. Ensure the smooth operation of the store by keeping the shelves well stocked and customers happy. </p>\n<p>Unfortunately the previous employee managed the store poorly. Many of the tapes are in the wrong place, making it difficult for customers to find what they're looking for!</p>\n<p>It's up to you to restock the shelves, rewind the returned tapes, and make sure the store remains profitable - while making sure you remember to feed yourself, or you might just starve to death...</p>\n\n<p>KING of TAPES is a humorous first-person management/survival simulation based on managing a video rental store<br/></p>\n<ul><li>Serve a variety of customers who come to you for their entertainment demands</li><li>Manage your store's inventory - Nearly infinite procedurally generated video tapes</li><li>Sit down and enjoy a fizzy drink and a tasty snack in the break room</li><li>But don't take too long, as the customers will grow impatient!</li></ul>\n<p>Do you have what it takes to build the next video rental empire... can you become... the KING of TAPES?</p>\r\nHow to play\r\n<p>KING of TAPES is controlled from a first person perspective:</p>\n<ul><li>Use the WASD keys and mouse to move around.  CTRL crouches.</li><li>Pick up tapes and objects with the left mouse button. You can hold multiple items at the same time.</li><li>Drop held object with right mouse button</li><li>Use mouse wheel to switch between held objects</li><li>To interact with customers or use objects, point at it and press right mouse</li></ul>\n\n<p>To ensure smooth operations of your store:</p>\n<ul><li>Interact with customers at the cash register</li><li>Customers will have trouble finding tapes if they're in the wrong shelf! Too bad the previous employee left many of them in the wrong place...</li><li>You can use the VCR machine to rewind tapes</li><li>Use the amenities in the store to prevent your death from the elements</li></ul>\r\nCredits\r\n<p>KING of TAPES was created by zomg and epsypolym for Brackeys Jam 4. The game was created in 7 days.</p>\n<p>Featuring voice acting and sound effects from IRVING FORCE</p>\n<p>VCR and VHS tape 3D models from cartti</p>\n<p>Royalty free and Creative Commons licensed assets from a number of authors. See the game's included README file for more details.</p>", "metacritic": null, "released": "2020-08-08", "tba": false, "updated": "2020-08-10T09:05:24", "background_image": "https://media.rawg.io/media/screenshots/d55/d556dae291d9b504b05a65e452b544bc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 101, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["zomg", "eps"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}