{"id": 478906, "slug": "summer-job", "name": "Summer [Job]", "name_original": "Summer [Job]", "description": "<p>Take control of a young man looking to fill his time in the hot summer of 1969. rewind tapes and play some tunes to keep the groove!</p>\r\n !Important note! : there is a critical bug in the game which can trap the player in a endless cycle of tape rewinding. be gentle with the game. and if you encounter such thing just give page a refresh. i'll try my best to fix it soon\r\nHow the Game Goes (read before playing):\r\n<p>Every few seconds a customer arrives and places a tape on one of the tables. go up to that table and rewind his/ her tape. they will then pay and leave the shop</p>\n<p>take too long to rewind and they will leave the shop and complain about it</p>\n<p>take 3 complains and your business is shut!</p>\n<p>Play music to keep the customers busy. they wont mind time passing if their favorite tape is playing<br/></p><p>YOU also have a favorite tape! the Red Tape! play it and your character will move faster and rewind better!</p>\r\nYou can find out which tape is the customers favorite by comparing the customers shirt with the color on the tape!<br/>You also have a favorite tape too! it makes you work faster!\r\n<p>be careful tho! when a tape finishes you have to rewind them aswell!</p>\n<p><strong>how to play : </strong></p>\n<ul><li>WASD to move and Navigate menus</li><li>Get near the Tape Player (top left of the Room) and Press E to open the tape drawer</li><li>Press E on a Table (indicated by the white square) to rewind the tape on it</li></ul>\n<p><strong>once in the tape selection menu:</strong></p>\n<ul><li>WASD to navigate </li><li>E to close the menu</li><li>F to play the selected Tape</li><li>R to rewind the selected Tape</li></ul>\r\nCredits:\r\n<ul><li>Music by<ul><li>Snowy</li><li>Kevin McLeod</li></ul></li></ul>\n<p>this game would not have been possible if it wasnt for these champs. thank you guys so much!</p>", "metacritic": null, "released": "2020-08-08", "tba": false, "updated": "2020-08-10T08:44:35", "background_image": "https://media.rawg.io/media/screenshots/cfe/cfe71b51d72363717550ea95cd0b455c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 89, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["PixelHole"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}