{"id": 479, "slug": "dungeon-story", "name": "Dungeon Story", "name_original": "Dungeon Story", "description": "Are you ready for an epic fast-paced monster killing experience? Challenge hordes of powerful monsters and bosses, defeat them, level up to 999 and become the most powerful and rich hero of all times! But be careful... The enemies will also use their own special abilities to destroy you!<br/><br/>Match 3 or more of the same tiles in any direction to attack with your sword, cast spells, heal or gather coins! Use special battle items such as a shield, a healing potion and an explosive bomb that can alter the battlefield! Upgrade your gear and learn tons of skills! Unlock 9 powerful classes and exploit their unique powers!<br/><br/>Can you create the most powerful character of all time?<br/><br/>- Level up to 999<br/>- Conquer 6 levels of progressing difficulty<br/>- Defeat more than 70 monsters and bosses with special abilities<br/>- 9 unique hero classes with awesome powers<br/>- Use 7 awesome battle-items with unique abilities<br/>- Gather coins and upgrade your items and skills<br/>- Visit the tavern, complete quests and earn reputation to unlock amazing rewards<br/><br/>Challenge your friends in Game Center<br/><br/>- Arena PvP matches<br/>- 80 achievements (up to 1000 GC points)<br/>- 12 leaderboards to compete<br/>- customisable leaderboard<br/><br/>Classic gameplay with lots of innovative features<br/><br/>- iCloud game saving support<br/>- Optimised for Retina displays<br/>- Universal app - buy once and play in all devices<br/>- iPhone 5 screen support<br/>- Game includes original music score<br/>- You can listen to your own music during the game<br/><br/>*** MANY NEW AWESOME FEATURES COMING SOON ***<br/><br/>Dungeon Story is inspired by some awesome games such as Dungeon Raid and Dragon Quest. The game is developed by an independent developer, passionate about games, with the help of some really great friends! :)", "metacritic": null, "released": "2012-09-28", "tba": false, "updated": "2019-10-22T14:27:29", "background_image": "https://media.rawg.io/media/screenshots/593/593690973e9f7ce9db41f01c1fce7dfa.jpeg", "website": "https://twitter.com/DungeonStory", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 106, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Pantazis Deligiannis"], "genres": ["RPG", "Puzzle"], "publishers": ["Pantazis Deligiannis"], "esrb_rating": "Everyone 10+"}