{"id": 479067, "slug": "re-wind-jackradforth", "name": "Re: Wind (JackRadforth)", "name_original": "Re: Wind (JackRadforth)", "description": "<p>Welcome to Re: Wind.</p>\n<p>Terrible beasts have been causing havoc near your home. So you decide to do something about it. You send a request to Aeolus, the keeper of the wind, to get his help to vanquish the beasts. He replies...</p>\n<p>\"Re: Wind,</p>\n<p>You may use the my wind to help you with your fights, simply press the right mouse button and it will propel you away from your cursor. The further your cursor is away from the player the more power it will have.</p>\n<p>You're also equipped with projectiles to damage the enemies. Use your left mouse button to fire them.</p>\n<p>Good luck\"</p>\n<p>There are 3 enemy types you will encounter:</p>\n<p>The Satyr, half goat, half man. These enemies will charge you frequently and do small damage. They are easy to deal with by themselves but in groups can become a problem.</p>\n<p>Euryale, the sister of Medusa. She will jump towards you dealing high amounts of damage. Her biggest weapon is her scream and it will destroy you if you are too close to her when she does it. Although she is more vulnerable to attack whilst screaming.</p>\n<p>The Hydra, a serpentine creature which sprints towards the player, being so big it takes time to stop and turn around and this makes it easier to attack. Be warned, when larger hydras die, they will divide into two smaller hydras.</p>\n<p>The wind and the projectiles both need to recharge, you can see in the top left of your screen two icons which represent both of them and their respective amounts available. <br/></p>\n\n<p>=-=-= DISCLAIMER =-=-=<br/></p>\n<p>This game was made for the Brackey's Game Jam 2020.2 and the name plays on the theme \"Rewind\". I struggled to come up with a concept I liked for the jam so I thought I'd make something to challenge myself whilst \"using\" the theme.  Hence \"Re: Wind\" (Regarding wind). Due to prior commitments I only managed to produce two levels for the game but I would like to improve upon the art and the games content later on. However I ran out of time for the jam.</p>\n<p>I used the BEEF programming language (https://www.beeflang.com) with SDL2</p>\n<p>All art assets are created by myself, the font is from 1001freefonts and is free to use (https://www.1001freefonts.com/archeologicaps.font). Thank you for playing my game created in 7 days and please leave any feedback you have!</p>", "metacritic": null, "released": "2020-08-07", "tba": false, "updated": "2020-08-10T09:22:33", "background_image": "https://media.rawg.io/media/screenshots/0c8/0c8945f10a89aa2719c17e597f5d146b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["JackRadforth"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}