{"id": 47907, "slug": "world-chef", "name": "World Chef", "name_original": "World Chef", "description": "Do you like exotic food? Are you more of a burger and fries kind of person? Either way, there’s a spot for you in the kitchens of World Chef, the most international cooking game, with chefs and recipes from over 20 nationalities!<br/><br/>World Chef is a happy place where the kitchen never closes, the waiter always has a big smile on his face and the food is so great you should probably play with a bib on.<br/><br/>Open your restaurant, give it a name and decorate it to your taste! Then start cooking world cuisines and serving customers! Your place will soon become so popular you’ll have to make it bigger!<br/><br/>Expand your menu with every new international chef: Tacos, pizza, sushi,... The whole world can fit inside one restaurant! The success ladder will lead you to welcoming VIP diners and even catering special events! You will soon master the art of running a top restaurant.<br/><br/>And remember! This is not a fast food joint, take your time to slow-cook your best recipes. Your customers know they will be worth the waiting.<br/><br/>----<br/><br/>FEATURES:<br/>Create, decorate and run your own fine dining restaurant!<br/>Craft exclusive decorations at the Design Studio.<br/>Buy and trade fresh ingredients and cook increasingly delicious dishes.<br/>Build yourself a dock, get a boat and start importing exotic ingredients!<br/>Serve your finest cuisine to customers from all around the world.<br/>Increase your popularity and see how all the VIPs become regulars!<br/>----<br/><br/>World Chef is FREE to download and FREE to play. However, you can purchase in-app items for the game with real money. If you wish to disable this feature, please turn off the in-app purchases in your phone or tablet’s Settings.", "metacritic": null, "released": "2016-01-11", "tba": false, "updated": "2019-07-29T12:10:20", "background_image": "https://media.rawg.io/media/screenshots/2bb/2bbb08e42f9fb7210e6effb67e157f33.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 291, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android", "iOS"], "developers": ["Social Point"], "genres": ["Simulation", "Casual", "Family"], "publishers": ["Social Point"], "esrb_rating": "Teen"}