{"id": 479146, "slug": "hook-heist-dubomb", "name": "Hook Heist (Dubomb)", "name_original": "Hook Heist (Dubomb)", "description": "<p>Made for the Brackeys Game Jam 2020.2.</p>\n<p>Use your hook to steal 4 jewels in 4 unique levels. Stealth, patience, and agility are key if you want to be successful in your heist.</p>\n<p>I did all of the programming, art, and music for this game. The font used for the timers is Press Start 2P.</p>\n<p><strong>Edit:</strong></p>\n<p>I've noticed a few comments have been saying that they don't know what caught them, so I've listed all of the enemies and hazards in detail down below (<strong>spoilers</strong>):</p>\n<p><strong>Security: </strong>Will pace back and forth in their hallways. They will only catch you if they're facing towards the hook, and not if they're walking on the side. You will be caught in any part of the hallway. Only your hook is detected by the security. The shield item has no effect on the security.<br/></p>\n<p><strong>Laser: </strong>Shoots a beam that can be blocked by boxes or a shield item. Only the hook is caught by the beam. All lasers are deactivated after the jewel is taken.<br/></p>\n<p><strong>Spikes: </strong>Will attempt to poke the player at a set speed. A red flash indicates that the spikes are about to be active. Only the rope is affected by the spikes, and the rope's hitbox covers the entire rope seen on screen. Spikes are only active after the jewel is taken.</p>\n<p><strong>Goop: </strong>Causes the player to be stuck in place until enough inputs are made (8 total, any key). Nothing else to say other than don't get stuck for too long.</p>\n<p><strong>Falling Objects: </strong>Falling objects will spawn before the jewel is taken. Their presence is indicated by a ! before they fall. Shield items can block falling objects. <strong>If your hook is moving downwards too fast, the ! may not be seen.</strong><br/></p>\n<p><strong>Homing Missiles: </strong>Homing missiles will spawn after the jewel is taken. Like the falling objects, a ! will appear before they enter the screen. They will travel towards the player for a short time before self destructing. Shield items can block homing missiles.</p>\n<p><strong>Edit 2:<br/></strong></p>\n<p>To prevent future confusion, I'm also going to list each powerup and what it does, hopefully it improves the experience that future players have. If I work on this post jam I'll add a tutorial stage with actual hazards instead of the small area in the menu/base.</p>\n<p><strong>Clock: </strong>Slows down all time. Its main functionality is to help out with movements around corners, although it is lacking in functionality compared to other powerups.</p>\n<p><strong>Accurate hook: </strong>Makes your movements extremely easier to control, and gives a small speed boost as well. Useful for when you are racing against the clock to beat a level and need an extra boost to your mobility.</p>\n<p><strong>Ghost hook: </strong>Makes you invulnerable to everything. Very useful for getting out of a dangerous area.</p>\n<p><strong>Hook shield: </strong>Protects your hook from lasers, falling objects, and missiles. Unlike the ghost hook, it will protect you until you are hit.</p>\n<p><strong>Stronger rope: </strong>Adds 20 seconds to the timer after stealing the jewel. It only appears after the jewel has been stolen. Useful if you need extra time to reach the end.<br/></p>", "metacritic": null, "released": "2020-08-07", "tba": false, "updated": "2020-08-10T09:38:23", "background_image": "https://media.rawg.io/media/screenshots/665/66542dac1583d7c48ea9f0d8d3c34a62.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 53, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Dubomb"], "genres": [], "publishers": [], "esrb_rating": null}