{"id": 479209, "slug": "orbi-a-survival-game", "name": "ORBI (A Survival Game)", "name_original": "ORBI (A Survival Game)", "description": "<p>This is my entry for my 2nd Game Jam ever, (Brackeys Jam 2020.2). It is a week long long event and I hope you enjoy what I have developed.</p>\n<p>In my game you play as Orbi. Orbi's whole job is to stay alive while the enemy falls from the sky trying to kill him. Each wave is random in color and length. <br/></p>\n<p>As the waves progress, Orbi's size gets larger making it an easier target for the enemy! However, If you hit the same color as Orbi, you get extra points, and if you do this 5 times you return to your original size.  As time progresses even further, the amount of enemies that spawn increase. Do you think you can make it far? I doubt it! ;-)</p>\n<p>Each game is random and to master Orbi, you must master timing. One feature on the desktop version is \"REWIND\". You can press the up arrow key and time will rewind for up to 5 seconds. However, to not make this too easy for Orbi, time does not effect all enemies.</p>\n<p>In the game, there are unlockable skins and achievements as well. Can you get them all? I plan on completing a bunch of mini games for future releases and any suggestions would be much appreciated. Just post them in the comments. If I use it, I will put you in the credits.</p>\n<p>Please download and play my game. It can be found at : https://bluemerlegames.itch.io/orbi</p>\n<p>Game Mechanics: Left and Right Arrow Keys to move and Up Arrow Key for \"REWIND\".</p>\n<p>My future plans after completing the full game is to publish this to both android and iOS as well.</p>\n<p>Don't forget to post your opinions or feature requests. <br/>Good Luck &amp; Have Fun!</p>\n<p>Attribution:</p>\n<p>I would like to thank the following for their effort in creating audio files that I have used in this game:</p>\n<p>\"House In A Forest\" by HorrorPen</p>\n<p>\"Sadness\" by Joseph Gilbert / Kistol</p>\n<p>\"A Journey Awaits\" by Pierre Bondoerffer (@pbondoer)</p>", "metacritic": null, "released": "2020-08-07", "tba": false, "updated": "2020-08-10T09:54:44", "background_image": "https://media.rawg.io/media/screenshots/09b/09b9e9e0b6a2731134be618001d10ab1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 80, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BlueMerleGames"], "genres": [], "publishers": [], "esrb_rating": null}