{"id": 47937, "slug": "warfare-nations", "name": "Warfare Nations", "name_original": "Warfare Nations", "description": "Warfare Nations is an epic online wargame filled with exciting strategy gameplay and awesome graphics and animation. Train your troops, upgrade your HQ, and battle thousands of other players online!<br/> <br/>► ► ► ► ►<br/>The Great War has descended upon Europe. You’re the Commander—the only one standing between glorious victory and certain death. Your troops need your leadership—now more than ever—to survive one of the bloodiest conflicts in human history. . .<br/> <br/>Choose a side (Silver Fox or North Polar)—and then assemble troops and resources in order to take over enemy bases of increasing difficulty. Train your troops (riflemen, sharpshooters, medics, grenadiers, and more); build armor units (armored cars, light/heavy tanks); summon air support (air superiority fighters, bombers); and establish outposts on enemy territory to generate indispensable iron and gold—the key resources for expanding and upgrading your army.<br/> <br/>► ► ► ► ►<br/><br/>   * Two sides to every story: Pledge your allegiance to either Silver Fox or North Polar.<br/>   * War can be beautiful: Gorgeous retina graphics with 4 unique environments--Outskirts, Forest, Countryside, and Ruins.<br/>   * Dominate both land and sky with 50+ powerful combat units: 9 different infantry troops and armored units, plus 7 unique air support units.<br/>   * Conduct research to take your army to the next level: 35+ resource bases to explore and research new technologies.<br/>   * Draw your troops into battle: Line-drawing control system (think Flight Control).<br/>   * Engage in boss fights: 7 personality-laden bosses between levels—each fight worthy of a victory bonus.<br/>   * Build your army: Collect enough gold and iron to upgrade your HQ and strengthen your troops.<br/>   * Quick online battles: Always fast-paced—with just 1 minute to get started, and 5 minutes per round.<br/>   * Obliterate your enemies online: Challenge thousands of other players, raid their bases, and enjoy the spoils of war!<br/>   * Smooth operator: Seamless connection for smartphones and tablets with matchmaking; supports Wi-Fi and 2G/3G/4G.<br/><br/> <br/>If you need help with the game for ANY reason, feel free to reach us at support@volvapps.com<br/> <br/>Like us on Facebook: https://www.facebook.com/warfarenations<br/>Follow us on Twitter: http://www.twitter.com/volvapps<br/>Follow us on Google+: http://goo.gl/orVxkh<br/> <br/>Note: Warfare Nations requires an Internet connection to play.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:10:38", "background_image": "https://media.rawg.io/media/screenshots/abc/abc8b1935772a1da97dfb33e1088b6fb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 204, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["VOLV Interactive"], "genres": ["Action"], "publishers": [], "esrb_rating": null}