{"id": 47941, "slug": "virtual-city-playground-building-tycoon", "name": "Virtual City Playground: Building Tycoon", "name_original": "Virtual City Playground: Building Tycoon", "description": "Build the city of your dreams… and then run it in Virtual City Playground®: Building Tycoon!<br/><br/>● Build dwellings and industrial buildings. <br/>● Manufacture a variety of retail goods and deliver them to your sleek and enticing shopping malls.<br/>● Set up a mass transit system to transport your city dwellers to parks, cinemas, stadiums and more.<br/>● Make your city greener and healthier by recycling garbage, planting trees, upgrading buildings and adding hospitals and fire stations.<br/>● Reward your happy, responsible citizens by organizing truly spectacular public events for them!<br/>● Take your city to towering new heights! Construct well-designed Apartment Towers, an Eco Skyscraper, an Airport, a Stadium, a Casino, a Hangar, an Ice Castle and even a Shuttle Launch Pad.   <br/><br/>While this game is absolutely free to play, you have the ability to unlock optional bonuses via in-app purchases from within the game. You may disable in-app purchases in your device settings.<br/><br/>Includes: <br/><br/>● Over 500 uplifting quests to tackle as you grow and enhance your city <br/>● Nearly 200 buildings, landmarks and decorations for city beautification <br/>● About 100 challenging achievements to earn and celebrate with your friends <br/>● Google Play game services support<br/><br/>***Did you know? Your minimized game continues transporting goods, making you money while you sleep!***<br/>____________________________ <br/><br/>Game available in:  English, Chinese, Traditional Chinese, French, German, Italian, Japanese, Korean, Brazilian Portuguese, Portuguese, Russian, Spanish<br/>____________________________ <br/><br/>Compatibility notes: This game performs best on high-end smartphones and tablets.<br/>____________________________ <br/><br/>G5 Games - World of Adventures™!<br/>Collect them all! Search for \"g5\" in Google Play!<br/>____________________________ <br/><br/>Sign up now for a weekly round-up of the best from G5 Games! www.g5e.com/e-mail<br/>____________________________ <br/><br/>Visit us: www.g5e.com<br/>Watch us: www.youtube.com/g5enter<br/>Find us: www.facebook.com/g5games<br/>Follow us:  www.twitter.com/g5games<br/>Game FAQs: https://support.g5e.com/hc/en-us/articles/115005743725-Virtual-City-Playground-Building-Tycoon<br/>Terms of Service: http://www.g5e.com/termsofservice<br/>G5 End User License Supplemental Terms:  http://www.g5e.com/G5_End_User_License_Supplemental_Terms", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:10:37", "background_image": "https://media.rawg.io/media/screenshots/429/429ffd05574b7100f3e73c4bf892c483.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 397, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["G5 Entertainment"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}