{"id": 479569, "slug": "snake-itch-blovorad", "name": "Snake (itch) (blovorad)", "name_original": "Snake (itch) (blovorad)", "description": "<p>ENGLISH VERSION BELOW<br/></p>\n<p>######### VERSION FRANCAISE #########<br/></p>\n<p>Bonjour à tous, je vous présente un remake de snake.</p>\n<p>Il reprend le concept de base du jeu, le serpent doit manger des pommes et éviter de se mordre lui même ainsi que foncer dans des blocs.</p>\n<p>Il se joue en ZQSD,  avec un lancer de boule de feu en appuyant sur espace.</p>\n<p>Vous pouvez changer dans les options si vous voulez du plein écran ou non ainsi que les sons.</p>\n<p>Vous pouvez changer la langue en cliquant sur le drapeau dans le menu principale<br/></p>\n<p>3 cartes sont implémenter en fonction de leur difficulté vous avez aussi la possibilité de retirer les quadrillages.<br/></p>\n<p>Votre meilleurs score pour chaque map est sauvegarder.<br/></p>\n<p>Tout à été coder en C avec la SDL2,  si jamais des personnes sont intéresser par le code source, je peux vous le transmettre.</p>\n<p>Bonne journée à vous et j'espère que mon remake vous plaira !<br/></p>\n\n<p>######### ENGLISH VERSION HERE #########<br/>Hey everyone,  I will present my Game name : Snake remake.</p>\n<p>It takes the basic concept of the game, the snake need to eat apple to grow and he will avoid to bite itself. He need to care of bloc who are in his road because that cause death to his. To counter bloc you can throw fireball to destroys it.</p>\n<p>You can play with WASD and press Space to throw fireball, you can in option set if you want fullscreen mode or not and change the volume of music and effect.</p>\n<p>You can switch langage by clicking on flag in the main menu.<br/></p>\n<p>3 maps are implemented, each linked to a difficulty level.</p>\n<p>Your best score for each map is saved.<br/></p>\n<p>Everything is program in C with SDL2, if you want to check the source code i can sent it to you.</p>\n<p>Have a nice day and i hope you will like my game !<br/></p>", "metacritic": null, "released": "2020-08-07", "tba": false, "updated": "2020-08-10T11:17:15", "background_image": "https://media.rawg.io/media/screenshots/90a/90acbddb481a4f69c2efeaf328313119.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 72, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["blovorad"], "genres": ["Action"], "publishers": [], "esrb_rating": null}