{"id": 479539, "slug": "knights-of-al-aqsa-mosque-free-demo", "name": "Knights of al-Aqsa Mosque - Free Demo", "name_original": "Knights of al-Aqsa Mosque - Free Demo", "description": "<p><strong>Visit www.fursanaqsa.com for more informations about the game.</strong></p>\n<p><strong>Follow the Game's Development at IndieDB:</strong></p>\n<br/>\n<p><strong>Fursan al-Aqsa PC Demo</strong></p>\n\n<p><strong>Fursan al-Aqsa PS3 Demo</strong></p>\n\n<p><strong>Fursan al-Aqsa XBOX360 Demo</strong></p>\n\n\n<p><strong>Fursan al-Aqsa - Knights of al-Aqsa Mosque</strong> is a Third Person Action Game on which you play as Ahmad al-Ghazzawi, a young Palestinian Student who was unjustly tortured and jailed by Israeli Soldiers for 5 years, had all his family killed by an Israeli Airstrike and now after getting out from the prison he seeks revenge against those who wronged him, killed his family and stolen his homeland, by joining a new <strong>Palestine Resistance Movement</strong> called <strong>Fursan al-Aqsa - Knights of al-Aqsa Mosque</strong>.</p>\n<p><strong>DISCLAIMER: In this game, the player does not shoot Israeli civilians, women, children, elderly, only soldiers. Also in this game there are NO images of sexual content, illicit drugs, religious desecration, hate of speech against any group, ethnicity or religion, anti-Semitist propaganda against Jews, Nazi propaganda or boasting of any terrorist groups and / or other unlawful acts. This game only contains the virtual representation of the Palestinian Resistance Movement against the Israeli Military Occupation, which is officially recognized by the United Nations (UN). This game was approved to release by Brazillian's Government Justice Department, Age Rating Sector.</strong></p>\n<p><strong>Click here for more informations</strong></p>\n<p>This game is being developed during the <strong>course of 4 years by one person</strong> (me, Nidal Nijm, Licensed Unreal Engine Developer), in a custom version of <strong>UDK Engine (Unreal Engine 3)</strong>, using the best technology to tell a compelling story through a game packed with <strong>non stop action, advanced 3D graphics and modern gameplay mechanics</strong>, however keeping the soul of old school shooters. <strong>You will play in missions accross ground, sea and sky, you have many objectives to accomplish in each mission, epic bosses battles, powerful guns, vehicles to drive, helicopters to take down, and much more</strong>. Expect a LOT of <strong>Action and Adrenaline!!!</strong></p>\n<p>This game also is greatly inspired by <strong>Hideo Kojima's Metal Gear Solid, Call of Duty Modern Warfare, Insurgency Sandstorm and Max Payne.</strong></p>\n<p>I hope you enjoy this game and <strong>support me by purchasing it, Insha Allah (God's Willing)</strong>. I decided to release this game as episodes (missions), each mission by a <strong>symbolic value </strong>just to cover my development costs, as everyone knows that develop a game is not an easy task, it takes a lot of time and efforts. It is a very small value, however any copy sold of this game is very important and will trully help me.<strong> Please buy this game to support me, Insha Allah (God's Willing), because I trully need your help!</strong></p>\n<p>Jazakom Allah Khayr (May God give you the best),</p>\n<p>Nidal Nijm.</p>", "metacritic": null, "released": "2020-08-07", "tba": false, "updated": "2020-08-10T11:10:58", "background_image": "https://media.rawg.io/media/screenshots/03e/03ed3c67c9d215fd902f9cd347fcba13.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 366, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Nidal Nijm Games"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}