{"id": 479561, "slug": "the-things-we-deal-with-heritage-game-jam-2020", "name": "the things we deal with [Heritage Game Jam 2020]", "name_original": "the things we deal with [Heritage Game Jam 2020]", "description": "Created for Heritage Game Jam 2020.\r\n<p>[the things we deal with] is a game about talking to your older sister, with cards.</p>\n<p>Your sister is an elite school student, the pride and joy of your family and a result of Singapore's desperate paper chase. You get along with her... sometimes. In this game, you uncover her story and learn about the expectations that are thrust upon her as a result of the environment you have grown up in.</p>\n<p>You can be aggressive, defensive or negotiable with her.  Your previous choices affect the way she behaves during the argument -- she may end up with cards in her hand that are far more powerful than yours, or she may be completely brought down by your attacks.</p>\r\nHOW TO PLAY:\r\n<p>Your sister will play a card face down with its color showing. Play a card in response and try to win against her by reducing her Hearts to 0.</p>\n<p>Your choices determine what cards are in her hand. Likewise, the outcome of your (verbal) battle gives you new cards to add to your hand. When you are offered a new card, you must discard an existing card to proceed.</p>\n<p>Play in different ways to get different endings! You don't always have to win.\r\n</p>\n<p>NOTE: If you would like to play again to get a different ending, do not press 'Restart' on the ending screen. Refresh the browser or close and reopen the application instead.</p>\r\nCredits\r\n<p><strong>Game</strong>\r\nYeo Joey\r\nYeo Niki</p>\n<p><strong>Music</strong>\r\nkotoji</p>\n<p><strong>SFX</strong>\r\nKenney.nl</p>\n<p><strong>Special Thanks</strong>\r\nYeo Dana </p>\n<p><strong>Made in Unity.</strong><br/></p>", "metacritic": null, "released": "2020-08-07", "tba": false, "updated": "2020-08-10T11:15:05", "background_image": "https://media.rawg.io/media/screenshots/7ec/7ece0f042fe4ef74549bf4545f54b15d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 14, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Joey Yeo", "yeoniki"], "genres": [], "publishers": [], "esrb_rating": null}