{"id": 479632, "slug": "the-last-turret-wrongdog", "name": "The Last Turret (wrong.dog)", "name_original": "The Last Turret (wrong.dog)", "description": "<p>The Etherian civilization has spent the last millennia in peace and prosperity and you have become an ancient relic from the long ago ages of war. You’ve weathered the centuries on your perch in constant vigil and when invaders appear in the northern sky, you are the only line of defence.</p>\n<p>The Last Turret is a casual shooter game that you can play just with one hand! You play as an ancient, but powerful, turret whose only job is to protect the Etherians from the invaders. Upgrade your weapons and defend the cities, over-watch convoys as the Etherians flee falling cities and finally attack the mothership and drive the invaders back into the sky.<br/></p>\n<p><strong>Why This Game?<br/></strong>We were looking to build a fun game that you could play with just  a mouse and this is what we came up with.  Its a casual shooter where you play an air defence turret in an ambient universe. Enjoy! <br/></p>\n<p><strong>Game Status?</strong><br/>This is an early access release and is still a work in progress. It has a weapons upgrade system and there are multiple campaign levels and an infinite wave challenge. <br/></p>\n<p><strong>Who Built This?</strong><br/>We are a family operation in Seattle Washington US  and this is our first game. We're excited to get feedback, so please let us know how you like it.<br/></p>", "metacritic": null, "released": "2020-08-07", "tba": false, "updated": "2020-08-10T11:30:28", "background_image": "https://media.rawg.io/media/screenshots/689/6896f34faf97256d8b7ddd13d1ffd26c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 182, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["wrong.dog"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}