{"id": 479670, "slug": "hood-outlaws-legends", "name": "Hood: Outlaws & Legends", "name_original": "Hood: Outlaws & Legends", "description": "<p>We are all Outlaws… but some of us will become Legends.</p>\n<p>Faced with a merciless, unchecked state, rebels and rogues from every corner battle to claim their place among legends. To win influence with an oppressed people, rival gangs now compete in daring heists to hit the wealthy where it hurts. Folk hero or gold-hungry outlaw, only the best will escape with hard-earned riches.</p>\n<p>Gather your team of outlaws and attempt to steal treasure from an oppressive government in a dark and violent, medieval world.</p>\n<p>Two teams of players compete to execute the perfect heist, in environments patrolled by deadly AI guards. Utilise the unique skills and mystical abilities of each character, moving in stealth to steal treasures unseen or dominating through loud and brutal combat.</p>\n<p>Blood will be spilled. Riches will be stolen. Legends will be reborn.</p>\n<p>Outplay opponents in intense PvPvE multiplayer heists<br />\nExperience a violent medieval world where ancient mysticism competes with man-made power and corruption<br />\nClaim your loot and invest in perks, weapons and bold new looks<br />\nPost launch support with new maps, characters, game modes and events</p>", "metacritic": 64, "released": "2021-05-10", "tba": false, "updated": "2023-12-05T21:55:10", "background_image": "https://media.rawg.io/media/games/220/220eb5b32d6ce6baf040568e502b0183.jpg", "website": "https://hood-game.com/", "rating": 2.83, "rating_top": 3, "added_by_status": {"yet": 74, "owned": 268, "beaten": 11, "toplay": 52, "dropped": 38, "playing": 2}, "playtime": 5, "achievements_count": 123, "ratings_count": 39, "suggestions_count": 799, "game_series_count": 0, "reviews_count": 40, "platforms": ["PlayStation 5", "PlayStation 4", "PC", "Xbox Series S/X", "Xbox One"], "developers": ["Sumo Digital"], "genres": ["Action", "Adventure", "RPG", "Massively Multiplayer"], "publishers": ["Focus Home Interactive"], "esrb_rating": null}