{"id": 479714, "slug": "tap-color-lite-coloring-games", "name": "Tap Color Lite- Coloring Games", "name_original": "Tap Color Lite- Coloring Games", "description": "Tap Color Lite is TOP paint by numbers free game for adults to number coloring relax and happy color thousands of drawings and coloring pages.  <br/><br/>Beautiful art coloring pages are updated every day for you to relax your mind! Explore 3000+ amazing free pictures and enjoy number drawing your own coloring book!<br/><br/><br/>Most Popular Categories:<br/>-Animals: cute puppies &amp; cats, birds, and eagles, all kinds of wild animals you want to color;<br/>-Flowers: the most beautiful flowers and bouquets are ready for coloring;<br/>-Mandalas: best coloring pages to relax your mind and paint by number mindfully;<br/>-Quotes: loving and inspiring messages for you to color and share;<br/>-Special Animated Pictures: color by number them and be surprised by the amazing animation feature!<br/><br/>Tap Color Lite is the coloring book you need to enjoy the fun and relax number coloring! You will never get bored with this game!<br/><br/>Coloring games has never been so easy. Open this coloring book, start to paint your own masterpieces. Don’t forget to share your finished work with family and friends!<br/><br/><br/>CONTACT US: support@colorbynumber.freshdesk.com<br/><br/><br/>Start to happy coloring experience now!<br/><br/><br/>------------------------<br/><br/>SUBSCRIPTION INFO<br/><br/>By subscribing, ​you get unlimited access to all coloring books, remove-ads, and ultimate hints in the app.<br/>- You can subscribe to a weekly plan (starting at $4.99, billed once a week), a monthly plan (starting at $9.99, billed once a month), or an annual plan (starting at $49.99, billed once a month). The availability and pricing of subscription plans may vary.<br/>- The payment will be charged to your iTunes Account when you confirm the purchase.<br/>- The subscription automatically renews for the same price and duration period as the original one weekly/monthly/annual plan unless canceled at least 24-hours before the end of the current period.<br/>- Any unused portion of the trial period will be forfeited when the user purchases a subscription.<br/><br/>Terms of Service: https://sites.google.com/site/tapcolorterms/<br/>Privacy Policy: https://sites.google.com/site/talefunprivacypolicy/", "metacritic": null, "released": "2020-07-06", "tba": false, "updated": "2020-08-14T02:28:02", "background_image": "https://media.rawg.io/media/screenshots/e4e/e4e503ee484b001a02d32b6d002dd3a4_U31xLSN.jpg", "website": "http://puzzlesagastudio.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 320, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Talefun"], "genres": ["Board Games", "Puzzle"], "publishers": ["Talefun Technologies"], "esrb_rating": "Everyone 10+"}