{"id": 479703, "slug": "wrestling-games-revolution-3d", "name": "Wrestling Games Revolution 3D", "name_original": "Wrestling Games Revolution 3D", "description": "Welcome to the world of super stars wrestling fight revolution it seems to be a real freestyle-wrestling<br/>tournament that have different levels of multiple wrestler’s matches. Our latest free wrestling games<br/>will give you chance to fight against world superstars in world wrestling competition with HD quality<br/>graphics &amp; advanced fighting games play modes. Wrestling game especially designed for professional<br/>wrestling lovers. World super star wrestling offers multi-man fighting experience in this ultimate<br/>wrestlers fighting game. Professional wrestling game is combines with real multiplayer fighting actions.<br/>Select different wrestlers with advanced fighting styles &amp; techniques. Use special wrestling skills and<br/>amazing combo power to take down energy of your rival.<br/><br/> Wrestling Game Play Modes &amp; Wrestlers Selection: <br/>In this Wrestling Rumble fighting sports game, the gameplay is very simple and easy. This wrestling<br/>action sports games developed in three amazing &amp; different modes. First, you need to choose your<br/>favorite wrestler &amp; than select a Battle Mode. Battle mode consist of three different fighting gameplay<br/>modes like Story Mode, Career Mode and Knockout Mode.<br/><br/> Wrestling Knockout Mode: <br/>In “knockout Mode”, fighting mode, which features top wrestlers challenging in different fighting levels.<br/>However, keep in mind, no second chance in knockout mode. Knockout match wining will increase the<br/>power, intensity, and excitement of real wrestling fights revolution game.<br/><br/> Wrestling Career Mode: <br/>In “Career Mode” after every success in fights will earn you some points to unlock next levels. Unlock<br/>new fighting challenge. Career mode consists with different &amp; latest action sports games play challenges<br/>against world wrestling champions. Challenging the next rivals to become the best fighter in this mode.<br/><br/> Wrestling Story Mode: <br/>Story mode is all about real life of wrestling stars, behind every fight there is and personal vengeance,<br/>which will increase the intensity of rage against rivals in the wrestling ring. First time in the history of<br/>wrestling; in Story mode wrestlers personal clashes will converted into the personal fights in different &amp;<br/>latest games play challenges.<br/><br/> Daily Rewards: <br/><br/>In “Daily Rewards Mode”, you will earn bonus points daily that will help you to unlock next players,<br/>ultimately getting more points will upgrade power, speed, and accuracy with new strikes and fighting<br/>styles. Earing maximum points to unlock next level by watching rewarded videos.<br/><br/> Game Wining Rewards: <br/>Earn points for each wining against opponent, fight against strong wrestlers and level up your wrestling<br/>skills to get top-level ranking. Upgrade your power, speed, and accuracy with new strikes and fighting<br/>styles getting points for each winning match.<br/><br/> Freestyle Rumble Wrestling: PRO Multiplayer Fights Game Features: <br/><br/>- Enjoy three Different fighting games play mode to test your wrestling skills<br/>- Defeat all heavyweight superstar wrestlers in “Story Mode”<br/>- Play in “Career Mode” and win against world top fighters<br/>- Extreme challenging “Knockout Mode” will test your fighting skills<br/>- Face toughest wrestling warriors and become king of the ring<br/>- Heavy weight champions fight against world wrestling superstars<br/>- Choose player among mixed male and female wrestlers<br/>- Real wrestling rivals in action with extreme fighting motions<br/>- Win wrestling matches &amp; get rewarded points to unlock next challenge<br/>- Background music &amp; sound effects will boost your energy", "metacritic": null, "released": "2020-08-12", "tba": false, "updated": "2020-08-14T02:23:40", "background_image": "https://media.rawg.io/media/screenshots/b49/b49f01bd80c766ca31719905e1161824_OSw7bwj.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 316, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mini Sports"], "genres": ["Action", "RPG", "Sports"], "publishers": ["Mini Sports"], "esrb_rating": "Teen"}