{"id": 479713, "slug": "sports-city-tycoon-idle-game", "name": "Sports City Tycoon: Idle Game", "name_original": "Sports City Tycoon: Idle Game", "description": "The goal of this cool tycoon game is to construct an entire sports city. Sport is your business and you need to manage stadiums to attract fans to watch the most epic matches! You will host games for sports fans from all over the world. You will face great challenges while raising your rich business empire! Build now your own sports town, earn money, invest your earnings, and purchase new stadiums to bring all kinds of sports to your town!<br/><br/>Start with a small stadium, get visitors into the town, and sell tickets to earn money to build even more stadiums! Manage and optimize resources like a sports management simulator and improve the games bringing more players to the field! You will manage a tennis court, a swimming pool, a car racing track, a soccer field, a football pitch, and build stadiums for all other cool national sports of the world!<br/><br/>Each city you build has its own strategy. You can build a beach sports city where people can surf, sail and play beach volleyball or even a winter sports city where you can play hockey or race in a bobsled! For the adrenaline loving fans you can build a radical sports city where people can skate, mountain climb or even skydive!<br/><br/>Features:<br/>- Easy to play and hard to master.<br/>- Earn cash even when you're offline.<br/>- Upgrade your stadiums to increase its seat capacity.<br/>- Manage resources to maximize money income and build new attractions!<br/>- Host competitions for Tennis, Soccer, Football, Basketball, Athletics, Car Racing, Swimming, Skating, Skydiving, Surfing, Sailing, Beach Volleyball, and much more!<br/>- Host epic matches among the best countries!<br/>- Watch the best matches in real-time amazing 3D graphics!<br/><br/>Have a problem? Want to suggest a cool new feature? Send your feedback to Pixodust Games. We love to hear from our players! support@pixodust.com<br/><br/>Be sure to check for updates. We're always working on improving gameplay and adding new features!<br/><br/>Privacy Policy:<br/>https://pixodust.com/games_privacy_policy/<br/>Terms and Conditions:<br/>https://pixodust.com/terms-and-conditions/", "metacritic": null, "released": "2020-08-11", "tba": false, "updated": "2020-08-14T02:27:34", "background_image": "https://media.rawg.io/media/screenshots/5a8/5a8fb6b1ff5f0d9a780c3091cb24c97f_VYVlD2r.jpg", "website": "http://www.pixodust.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 161, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Pixodust Aplicativos"], "genres": ["Simulation", "Sports"], "publishers": ["Pixodust Aplicativos LTDA"], "esrb_rating": "Everyone 10+"}