{"id": 479948, "slug": "everynowhere", "name": "Every[No]where", "name_original": "Every[No]where", "description": "<p><strong>WELCOME TO EVERY[NO]WHERE, [super duper pre-pre-pre alpha]</strong></p>\n<p>an abstract puzzle platformer that generates blocks in random places. you must either collect gems or race to the end as fast as possible. with simple walljump mechanics, you can cross seemingly impassible gaps. these levels are made by placing blocks in random places, but you have total control of the range, amount, and size of the blocks.</p>\n<p>where are you supposed to be? that does not matter. you create a realm that could exist, but the odds of these places ever existing in our universe is nearly zero. these are the worlds that exist in the midst of pure nothing. imagine if the universe ended up like a level you generated in this game. it would be pretty pathetic, but be glad that it is an astronomically small chance.</p>\n<p><em>IF YOU DIDN'T GET THAT LAST PARAGRAPH, DON'T WORRY, IT'S ABSTRACT. IT DOESN'T MATTER.</em></p>\n\n<p><strong>PLAYING</strong><br/></p>\n<p>once you start the game, you will see boxes with numbers. these are the parameters you modify for the level generation. parameters include. X axis, Y axis, Z axis, minimum scale size, maximum scale size, and number of blocks. </p>\n<p>below the boxes are some stats. these are the number of gems you collected in the current session [yes, it resets once you exit the game. i apologize :(], the density [a relation of number of blocks and the 3 axes. generally speaking, the smaller the number, the more difficult the level gets], and the number of gems to collect [this is based on density].</p>\n<p>there are two dropdown menus on the right. the top one to switch the game mode and the bottom one to switch the music tracks.</p>\n<p>this game uses standard first person controls; WASD for movement and space to jump. you can strafe towards the wall and keep jumping up to 3 times to do a wallrun/walljump. you also have a jump stored at all times to be used once. this means, besides using jump as you would expect, you can fall off of a ledge and press space to jump in midair.</p>\n<p>gem collecting is simple: collect the gems as fast as possible. failure can happen by falling off the level or experiencing an impossible gem that cannot be collected. while your time will not be logged, your collected gems will.</p>\n<p>there are two race types: standard and vertical. standard is along the Z axis, so make sure you max out the Z axis on race mode. likewise, max out the Y axis for the vertical race.</p>\n<p>press escape to pause the game and if you want to go back to the generation menu.</p>\n<p><strong>CREDITS</strong><br/></p>\n<p>almost everything is done by me. music, programming, concept, sound, etc. </p>\n<p>special thanks, however, goes to brackeys for his unity tutorials and dani for his game karlson and a source of motivation. if a bozo milk drinker can make a game, so can i.</p>", "metacritic": null, "released": "2020-08-13", "tba": false, "updated": "2020-08-14T03:27:19", "background_image": "https://media.rawg.io/media/screenshots/64a/64ab9fdee669d84a33d712acbcfc0a00.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 46, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["JohannKrupps"], "genres": ["Racing", "Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}