{"id": 47992, "slug": "time-mysteries-1", "name": "Time Mysteries 1", "name_original": "Time Mysteries 1", "description": "FANTASTIC HIDDEN OBJECT PUZZLE ADVENTURE GAME FROM THE CREATORS OF ENIGMATIS AND GRIM LEGENDS!<br/>Time Mysteries: Inheritance – Remastered is a beautiful, visually enhanced version of one of the most important games in Artifex Mundi’s portfolio and the first chapter of a captivating time travel story.<br/><br/>TRY IT FREE, THEN UNLOCK THE FULL ADVENTURE FROM WITHIN THE GAME!<br/><br/>A captivating time travel adventure awaits! <br/>Vivien Ambrose, a beautiful young physicist, goes to her father’s house to celebrate a recent scientific achievement. When she gets there, she is puzzled to discover that her father has vanished.<br/><br/>27 mini games and 31 scenes with hidden objects! <br/>While looking for clues to her father’s disappearance, our protagonist finds a strange letter that bestows upon her an unexpected and beautiful family inheritance: seven magic rings and a crystal ball. These mystery items will grant her the power to travel through time to learn the whole story behind her father’s disappearance.<br/><br/>Search for clues in 24 immersive hand drawn locations! <br/>The artifact gives Vivian a glimpse into her father’s fate: for reasons unknown, he has been abducted by a scary mysterious Time Traveler. Our heroine embarks on a dangerous adventure through time and space that will also test her inner detective skills.<br/><br/>Solve the fascinating centuries-old mystery to save your father! <br/>Vivian will encounter challenging puzzles and mini games, collect beautiful magic rings, and make her way through beautiful hand drawn hidden object scenes to rescue her father. Will Vivien accomplish her goals and defeat the Time Traveler?<br/><br/>Play with your family! <br/>A simple but beautiful game that’s easy to enjoy with your kids!<br/><br/>Take the adventure on the bus! <br/>Optimized for phones and tablets, filled with hidden objects, perfect for playing while traveling. No internet connection required, so you can play offline!<br/><br/>Sign up to our newsletter and get adventure games on sale! <br/>Captivating adventures, beautiful stories, and scary mysteries await in our selection of immersive hidden object puzzle games!<br/><br/>• A captivating time travel adventure awaits! <br/>• 27 varied mini games and 31 scenes with hidden objects!<br/>• Search for clues in 24 immersive hand drawn locations! <br/>• Solve the fascinating centuries-old mystery to save your father! <br/>• High-end, immersive gameplay, optimized for tablets and phones!<br/><br/> +++ WE ARE HERE +++<br/>WWW: http://artifexmundi.com<br/>FACEBOOK: http://facebook.com/artifexmundi<br/>TWITTER: http://twitter.com/ArtifexMundi<br/>FORUM: http://forum.artifexmundi.com<br/>YOUTUBE: http://youtube.com/user/ArtifexMundi<br/>PINTEREST: http://pinterest.com/artifexmundi<br/>INSTAGRAM: http://instagram.com/artifexmundi", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:10:29", "background_image": "https://media.rawg.io/media/screenshots/d59/d5924b5932264e62a27df1e7cdcb1bba.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 323, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Artifex Mundi"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}