{"id": 479927, "slug": "sybils-nightmare-run-agpc2020-edition", "name": "Sybil's Nightmare Run (AGPC2020 Edition)", "name_original": "Sybil's Nightmare Run (AGPC2020 Edition)", "description": "<p>This game is made for the Atari Gamer's Lynx Programming Competition 2020. It creates a future dystopian world where Sybil has to run to survive.</p>\n<p>The game was coded in less than two weeks using CC65, ABCmusic, GIMP and a couple of other support tools.</p>\n<p>A more feature rich version is expected some time in the future, if you have any specific requests, leave a comment!</p>\n\r\nHow to Play\r\n<p>You can't move Sybil left or right, but you can jump with B and start your jetpack with A. The jetpack has a minimum reserve energy requirement before it will turn on, but it automatically refills as Sybil moves through the stage.</p>\n<p>Sybil can automatically jump up to certain buildings based on their height relative to where she is currently, but as the difference in height gets larger, she will become stuck unless you jump her over. Get stuck for too long and you'll be captured.</p>\n<p>Sybil doesn't return to her usual position after getting stuck straight away - it takes a bit of time for that to happen, so be careful you don't get stuck too often.</p>\n<p>Avoid all gaps between buildings or you'll fall.</p>\n\n\r\nAtari Lynx Development\r\n<p>If you are interested in developing your own games for Atari Lynx, check out the Programming Resources page. Lynx is one of the easiest retro game consoles to get started coding with, and right now Atari Gamer is running a game jam where you can win some really amazing prizes. So if you have an idea for a game, don't hold back, code it for the Lynx!</p>", "metacritic": null, "released": "2020-08-13", "tba": false, "updated": "2020-08-14T03:22:40", "background_image": "https://media.rawg.io/media/screenshots/9bc/9bc87e8eb9b1e77aa214aa30ade3cc80.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 65, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Android"], "developers": ["Atari Gamer"], "genres": [], "publishers": [], "esrb_rating": null}