{"id": 480029, "slug": "timeloop-2", "name": "Timeloop", "name_original": "Timeloop", "description": "<p><strong>Timeloop</strong> is a fun game for the Atari LYNX handheld console where you <strong>play future soccer against your past self(s)!</strong><br/></p>\n<p>You'll control a blue robot who have to push the green ball into the goal to score points. <strong>Move with D-Pad</strong> and <strong>press A or B button to Dash</strong>. Sounds simple? Well there is a catch: <strong>the whole game plays inside an endlessly repeating timeloop!</strong><br/></p>\n<p>Every 6 seconds, the timeloop will reset the game. <strong>Your previous avatar will turn red, and it will move exactly like you did during the previous timeloop</strong>. You will play as another robot, always in blue. Up to 8 robots can play at the same time: your current avatar, and 7 of your previous incarnations. So, in this game<strong> you'll face the ultimate opponent: yourself!</strong><br/></p>\n\n<p>There is an<strong> increasing \"score limit\" to reach</strong> on each timeloop to be able to continue the game. It starts easy, but quickly become challenging. By-the-way, my current best score is<strong> 40 points</strong>. Can you do better?<br/></p>\n\n\r\nHow to play\r\n<p>Dowload the game <strong>ROM files</strong> in .LNX<em> (emulator)</em> and .LYX <em>(flashcart</em>) formats.\r\nThe<strong> fully commented source code is also provided</strong> as a separate download if you want to make new games for the Atari LYNX too!</p>\n<p>This game is my entry to the Lynx 2020 Programming Competition hosted by <strong>AtariGamer.com</strong><br/></p>", "metacritic": null, "released": "2020-08-12", "tba": false, "updated": "2020-08-14T03:46:59", "background_image": "https://media.rawg.io/media/screenshots/77c/77c8e8b0e943c0e7aedac90cc174d249.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 55, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Android"], "developers": ["Dr. Ludos"], "genres": ["Action"], "publishers": [], "esrb_rating": null}