{"id": 480007, "slug": "the-moon-in-autumn", "name": "The Moon in Autumn", "name_original": "The Moon in Autumn", "description": "<p>The Moon in Autumn is a visual novel which prepares Standard Mandarin Chinese learners for the third level of the Hanyu Shuiping Kaoshi language proficiency exam (HSK 3). HSK certification is a common requirement for China-related careers and a  prerequisite for university admissions and scholarship applications. Taking the HSK also shows your commitment to learning the language and culture, while also serving as a useful tool for measuring your progress.  However, HSK exam preparation is often tedious and repetitive. It can be difficult to stay motivated when limiting yourself to mock exams and flashcards. </p>\n<p>Graded readers are books which have simplified language levels to help language learners read. This graded reader is in the format of a visual novel, which allows you to make narrative choices along the way. Improve your Chinese by reading through multiple story lines and endings!</p>\n<p>If you have been preparing for the HSK 3 exam, you can review using this visual novel without looking up too many words in a dictionary. The language in The Moon in Autumn is graded by vocabulary and grammar structures. The visual novel’s interface (such as ‘save’), tips and explanations are in English. Using this graded reader visual novel will boost your motivation to study, test your knowledge and will be an enjoyable addition to your other HSK study tools.</p>\n<p><strong>Story</strong></p>\n<p>It’s autumn in old Beijing, and Peking University student Ming Gui is conflicted about spending Mid-Autumn Festival with his family. That night, a mysterious visitor appears in his bedroom and invites him to visit the moon. While making moon cakes and sightseeing around the palace and its gardens, Ming Gui discusses Chinese mythology, poetry, history and cuisine with the rabbit of the moon and the Goddess of the moon. What will Ming Gui learn about hard work, friendship and family?</p>\n<p><strong>Features</strong></p>\n<ul><li>Accelerate your language learning with this graded reader for the HSK 3 exam</li><li>Vocabulary and scenarios related to exam vocabulary and grammar points</li><li>Different story lines resulting in two endings will build fluency through reading and re-reading</li><li>Conversations reflect daily life in China using carefully selected high-frequency vocabulary</li><li>Hanzi writing quizzes replicate the feel of taking the exam</li><li>New vocabulary words, grammar and cultural points explained are English and pinyin</li><li>Lessons about Chinese history, art and culture with over 100 original, hand-drawn images</li><li>Guessing games explore Chinese symbolism, mythology and idioms</li><li>Includes travel information about Beijing and Hangzhou and introduces popular dishes</li><li>Atmospheric and enchanting music by composer Tim Beek</li><li>Original art based on 1920s/30s Beijing and the Song Dynasty</li></ul>\n<p>Parental Guidance Suggested (PG) – Includes mythology involving an archer, a couple being separated and a male character removing his shirt to change clothes. The city information references bars and the holiday information references wine.</p>", "metacritic": null, "released": "2020-08-07", "tba": false, "updated": "2020-08-14T03:40:42", "background_image": "https://media.rawg.io/media/screenshots/314/314bcfa75528e9af08320e6b2581f776.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 183, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Stockbridge House"], "genres": ["Adventure", "Educational"], "publishers": [], "esrb_rating": null}