{"id": 48008, "slug": "the-tiny-bang-story-premium", "name": "The Tiny Bang Story Premium", "name_original": "The Tiny Bang Story Premium", "description": "Welcome to Tiny Planet, a gorgeous steampunk inspired world sadly devastated by a recent asteroid strike.  Your mission is to help rebuild this beautiful idyll and restore it to its former glory.  To do so you'll need to hunt hidden objects, solve puzzles and conquer devilish brain teasers.  <br/><br/>The Tiny Bang Story is set across five distinct chapters each with their own lovingly hand-drawn location, which combined with the enchanting music created just for this game, adds up to an immersive and crowd-pleasing experience.  With no text in the game users will intuitively find their way around the planet, work out what tasks need to be completed next and forge their own path through this unique adventure.  <br/><br/>So sit back, put your thinking cap on and get ready to help the inhabitants of Tiny Planet in The Tiny Bang Story.<br/><br/><br/>Game features:<br/>•  Top 10 PC download hit on BigFish and Gamehouse<br/>•  Five distinct chapters and over 30 challenging brain teasers<br/>•  A gorgeous steampunk inspired world drawn entirely by hand<br/>•  Absorbing gameplay with intuitive controls<br/>•  10 enchanting musical themes<br/><br/><br/><br/>TESTIMONIALS:<br/>• \"Visually, this game is stunning.\"  - androidpolice.com<br/><br/>• \"I recommend you go and install the game right away...\" - androidheadlines.com<br/><br/>• \"It's worth every penny, and it will give you hours of fun.\" - talkandroid.com <br/><br/>• \"The Tiny Bang Story perfectly collects stunning hand drawn backdrops, original mini games, gorgeous graphics and smoothing soundtrack.\" – Editor's Pick from AppEggs.com<br/><br/>• \"If you haven’t tried this game yet and own a tablet, go get it NOW. You don’t know what you’ve missed out on.\" Gold Medal  – PlayAndroid.com<br/><br/>• “I recommend you go and install the game right away...” 5/5 – Android Headlines<br/><br/>______________________________________<br/><br/>Please note that this game requires an additional 50-100Mb download when first run, depending on your device.  Additional data charges may apply.<br/><br/>An Internet connection is required for verification the first three times you launch the game. <br/>______________________________________", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-31T04:30:17", "background_image": "https://media.rawg.io/media/screenshots/d6e/d6e72093dae7ea79c57c87f5b65d837d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 301, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["HeroCraft"], "genres": ["Adventure"], "publishers": [], "esrb_rating": "Everyone"}