{"id": 48031, "slug": "teeny-titans-teen-titans-go", "name": "Teeny Titans - Teen Titans Go!", "name_original": "Teeny Titans - Teen Titans Go!", "description": "Teeny Titans, GO! Join Robin for a figure battling RPG of epic proportions. Play for hours with no in-app purchases! <br/><br/>TEENY COMBAT<br/>Assemble your squad and face off in 3-on-3 battles! Bust out super moves in real time with the battle bar. Switch between your heroes to launch awesome attacks and take down your opponents.<br/><br/>77 COLLECTIBLE FIGURES<br/>Gotta snatch ‘em all! Collect all 77 Teeny Titans figures, including Harley Quinn, Blue Beetle, Alfred Pennyworth, Kid Flash, the 80s Titans, Batgirl, Silkie, and many more! Level up and combine your figs for even more powerful abilities.<br/><br/>EXPLORE JUMP CITY<br/>Race from store to store to shop for your favorite super hero figures. Complete special missions, enter tournaments, and unlock new areas on your journey to become the Jump City Mega Teeny Champion!<br/><br/>ORIGINAL VO!<br/>Teeny Titans features original voiceover from Robin, Starfire, Cyborg, Raven, and Beast Boy!<br/><br/><br/>********************* <br/><br/>This game is available in the following languages: English, French, Italian, Spanish (Latin American), Portuguese (Brazilian), Russian, Turkish, Korean, Japanese <br/><br/>If you're having any problems with this app, feel free to contact us at advanced.platforms@turner.com. Tell us about the issues you're running into as well as what device and OS version you're using. <br/><br/>********************* <br/><br/>IMPORTANT CONSIDERATIONS: <br/>This app may contain ads that feature other products, services, shows or offers from Cartoon Network and our partners.<br/><br/>PRIVACY INFORMATION: Your privacy is important to us at Cartoon Network, a division of Turner Broadcasting System, Inc. This game collects and uses information as described in Cartoon Network’s Privacy Policy linked below. This information may be used, for example, to respond to user requests; enable users to take advantage of certain features and services; personalize content; serve advertising; perform network communications; manage and improve our products and services; and perform other internal operations of Cartoon Network web sites or online services. Our privacy practices are guided by data privacy laws in the United States. For users residing in the EU or other countries outside the U.S., please note that this app may use persistent identifiers for game management purposes. By downloading this application, you accept our Privacy Policy and End User License Agreement, and you give permission for such uses for all users of your device. The Privacy Policy and End User License Agreement are in addition to any terms, conditions or policies imposed by your wireless carrier and Google, Inc. Cartoon Network and its affiliates are not responsible for any collection, use, or disclosure of your personal information by Google or your wireless carrier. <br/><br/>Terms of Use: http://www.cartoonnetwork.com/legal/termsofuse.html <br/>Privacy Policy: http://www.cartoonnetwork.com/legal/privacy/mobile.html", "metacritic": null, "released": "2016-06-23", "tba": false, "updated": "2024-01-23T22:23:36", "background_image": "https://media.rawg.io/media/screenshots/198/198c6f0a3adc94d18bd3286114064cb5.jpg", "website": "http://www.cartoonnetwork.com/apps/teen-titans-go/teeny-titans/", "rating": 0.0, "rating_top": 5, "added_by_status": {"owned": 4, "beaten": 2, "toplay": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 5, "suggestions_count": 216, "game_series_count": 4, "reviews_count": 5, "platforms": ["Android", "iOS"], "developers": ["Cartoon Network"], "genres": ["RPG", "Strategy"], "publishers": ["Turner Broadcasting System"], "esrb_rating": null}