{"id": 48036, "slug": "tasty-treats-a-match-3-puzzle-game", "name": "Tasty Treats - A Match 3 Puzzle Game", "name_original": "Tasty Treats - A Match 3 Puzzle Game", "description": "Enter the sweetest adventure and travel through magical lands of candy-like treats. Match, splash and crush two or more blocks of the same color to clear the level with your furry best friends! Make the most delicious combinations and get through challenging levels full of fun! Smash fruits together and match the rarest treats to feed your animal friends. Remember, they don’t all eat the same! Jam, jelly, popcorn, cupcakes and more treats are on the menu for you to discover in this land of tasty, tasty treats!<br/>*******************************************************************************************<br/>The SWEETEST WAY to Play: <br/>PLAY WITH FRIENDS -Show off your gaming progress on the leaderboard to your friends! Beat your friends’ score on every level and keep track of it!<br/>WONDERFUL BOOSTS!  -BLAST through Gummies with ease with powerful combos and special pieces!<br/>THE BEST LEVELS -HUNDREDS of levels to beat and NEW LEVELS added every week!<br/>Sync between devices and play anywhere, anytime! <br/><br/>Over  500 levels packed with fruits, candy, gummies, jam and more treats for you and your furry friends! Start your delicious adventure now!<br/>********************************************************************************************<br/> Follow Tasty Treats on Facebook for more bonus! Enjoy the sweetness!<br/>https://www.facebook.com/TastyTreatsApp/<br/><br/>Questions? Suggestions? Get in touch: tastytreats@avid.ly <br/><br/>Please note that Tasty Treats is a completely FREE match-3 puzzle game. It’s free to download and play, but there are game items available for purchase with real money.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:10:25", "background_image": "https://media.rawg.io/media/screenshots/a8c/a8c029adb9c4db25576ef10e1d8dd9e1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 51, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Avid.ly"], "genres": ["Casual"], "publishers": [], "esrb_rating": null}