{"id": 480318, "slug": "puta-mili-fucking-mili", "name": "Puta mili / Fucking mili", "name_original": "Puta mili / Fucking mili", "description": "Puta Mili\r\nPlataforma : Zx Spectrum 48K\r\n<p>Durante el siglo XX existió en España un servicio militar obligatorio (conocido como \"mili\") para los varones mayores de 18 años. Este servicio en el ejército en realidad escondía, en la mayoría de los casos, el empleo de mano de obra gratis barata y una instrucción militar que se limitaba al aprendizaje del uso de armas tan letales como la escoba y la fregona,  a  evitar a, los muchas veces, incompetentes mandos, y a los psicopáticos veteranos , y a  librar un heróico combate contra la voluntad para conseguir tomar solo el alcohol y las drogas necesarias para mantener la moral alta.</p>\n<p>El genial dibujante Ivà plasmó en su serie  cómica \"Historias de la puta mili\",  publicada durante muchos años por la revista satírica \"El Jueves\" , las absurdas situaciones que muchas veces  se daban en los cuarteles durante el \"cumplimento con el deber a la patria\"</p>\r\n---El Juego---\r\n<p>\"Puta mili\" es un juego típico de plataformas en el que debes recorrer el cuartel para hallar los 20 porros que algún desaprensivo ha introducido para minar la moral de la tropa. Hasta que no consigas los 20 no podrás disfrutar del pase pernocta ( el gran honor de dormir fuera del cuartel)</p>\n<p>Durante esta importante misión te encontrarás con diferentes elementos y personajes:</p>\n<p>-Sargento: Grande, poderoso, tu mentor y guía espiritual.</p>\n<p>-Marrones: Mierdas, algo que no te gustaría pisar.</p>\n<p>-Aspirinas del ejército: Sirven para todo lo imaginable. En este caso recargarán tu vida.</p>\n<p>-Imaginaria o cuartelero: Dícese de aquel que le toca estar  todo el día vigilando no se sabe qué. Si le consigues una revista \"animada\" puede que te deje pasar.</p>\n<p>-Revista \"animada\": ¿Qué más puede querer un cuartelero?</p>\n<p>-Veterano arrestado: Vive en el cuartel,  rodeado de humo. Posiblemente cuando acabe la mili irá directo al penal.</p>\n<p>-Guardia de limpieza: Mejor que no le pises lo fregado.</p>\n<p>-Gaviotas: No todos los cuarteles tienen gaviotas, pero todas las gaviotas tienen un cuartel.</p>\r\n---Teclas---   \r\n<p> 'O'  \"Izquierda\"  -  'P' - \"Derecha\" - 'Espacio' \"Salto\"  - 'Y' \"Abandonar\"</p>\n<p>Este juego ha sido realizado con el motor MK1 (La churrera) , gracias a los Mojon Twins</p>\n\r\nFucking mili \r\nEnglish version\r\nPlatform: ZX Spectrum 48K\r\n<p>Along the XX century, there was in Spain, a compulsory military service knowed as \"Mili\". This period in the army hid, most of time,  free cheap workforce and a military training limited to teach the use of such a lethal weapons as broom and mop, how to hide from the incompetent officers  and psychopathics veterans and fight against getting  into the abuse of drugs and alcohol.</p>\n<p>The brilliant cartoonist Ivà put to paper the absurd situations happened during this \"Mili\" in his serial comic  \"Historias de la puta mili\" (\"Fucking Mili stories\") published weekly in the satirical magazine \"El Jueves\".</p>\r\n---The Game---\r\n<p>\"Fucking mili\" is a typical platform game. You must find 20 joints that an ill-intentionaded person got into the quarter, if you want to earn the license to sleep out of the quarter.</p>\n<p>During this important task you'll find the next characters and items:</p>\n<p>-Sergeant: Strongest, greatest, your spiritual guide. </p>\n<p>-Brown thing: Shit, something you don't want to step in.</p>\n<p>-Army aspirin: Take cares of everything. In this case I will refill your lifes.</p>\n<p>-Military guard: Watching for nobody-knows-what. If you give him a funny magazine, he'll let you pass.</p>\n<p>-Funny magazine:  Something that a bored guard will enjoy.</p>\n<p>-Arrested veteran: He is always surrounded by smoke. When he finishes his military service probably is going to go directly to jail.</p>\n<p>-Cleaning guard: Better don't step where it is mopped.</p>\n<p>-Seagull: Not every quarter has  a seagull but every seagull has a quarter.</p>\r\n ---Keyword---\r\n<p>   'O'  \"Left\"  - 'P'  \"Right\" - 'Space' \"Jump\"  - 'Y' \"Give up\"</p>\n<p>This game have been made with  the MK1 engine (La churrera) , thanks to the Mojon Twins</p>", "metacritic": null, "released": "2020-08-11", "tba": false, "updated": "2020-08-14T04:56:31", "background_image": "https://media.rawg.io/media/screenshots/305/305f9320a6591e199ac6fe1107823926.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 57, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Android"], "developers": ["ejvg"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}