{"id": 480551, "slug": "haven-isles", "name": "Haven Isles", "name_original": "Haven Isles", "description": "<p>Haven Isles is a safe space, in which you can seek refuge from the anxiety-provoking reality made significantly worse by COVID-19.<br/></p>\n<p>With focus on the game as a space, Haven Isles is an immersive experience, establishing presence, enabling expression, and narrative that’s paced and built by the player.</p>\n<p>Retreat, Rest, Reside!</p>\n<p>The value foundation for our game is based on the following five core values:  </p>\n<ul><li>Pleasure </li><li>Control </li><li>Safety</li><li>Peace</li><li>Stimulation</li></ul>\n\n<p>The <strong>game design canvas</strong> for Haven Isles:</p>\n<p><strong>Mechanics:</strong> Environment interaction, free movement, a building-mechanic, ressource gathering and a small inventory mechanic to emphasize meaningful choice regarding tools and materials (Iten et al., 2018). Mechanics are shown on the storyboard, where we see the player roaming the game world and interacting with a tree. </p>\n<p><strong>Narrative</strong></p>\n<p>A bigger <strong>emergent narrative,</strong> where the narrative emerges from player's interaction with gameplay subsystems. (Jenkins, 2003) (Mates &amp; Stern, 2006)</p>\n<p><strong>Enacted narrative</strong> elements in the form of micro narratives and memorable moments, where for instance the player is building house or a fireplace is being ignited as a result of player-action. (Jenkins, 2003) (Mates &amp; Stern, 2006)</p>\n<p><strong>Experience design &amp; Space/gameworld</strong></p>\n<p>The player experience is essential for our game world to be a safe space. As a result, the colour palette, primarily consisting of blue, brown and green, is intended to bring forth a calm and natural environment that invites exploration and curiosity. The player will not have to worry about dying in the game due to the fact that we want to provide safety for the players to take action and in this way be stimulated to return to their lives and not spike any anxiety levels. The more minimalistic approach highlighted in the game's low poly art style is based on the idea that putting too much detail and story into an object can make it difficult for the player to construct their own story in a given situation. The more simplistic low-poly art accordingly aid us in making the player tell their story and form their own unique experience.  </p>\n<p>We integrated our core values into Haven Isles by constructing a gameworld localized on an island where players get the opportunity to create their own small space that can function as their safe space.  </p>\n<p>Nature elements like grass, trees, mountains and of course the surrounding ocean in the game are familiar to the player. This should prove more relatable to the player, provide a realism factor(Witmer &amp; Singer, 1998), and in that way not make the player feel overwhelmed, but rather provide them a sense of feeling in control in a more familiar setting. </p>\n<p><strong>Tools/tech/platform:</strong> </p>\n<p>Haven Isles runs on the Unity Engine.</p>\n<p>The mood board for the game is based on the values listed above with calming colours and pleasurable environments. Here we started by including design elements fitting our vision for the theoretical framework and later in proces trying to define a colour palette we wanted to display in the game. </p><p>As for the story board, we started by drawing sketches of activities we wanted to take place in the game, as seen above. This sketch was also what we originally imagined as the task for our testers during our playtest, but incorporating a fishing mechanic proved difficult enough that we eventually decided to task the player to find an axe, chop wood and collect it. As for the narrative in this, we wanted to portray an emergent narrative(Jenkins, 2003) in that the player makes the choice to do activities such as these and how this impacts the game world. In this case chopping down and removing a tree from the game world, which hopefully also reminds the player of topics such as consumerism and sustainability. </p>\n<p>We want the player to experience freedom of movement and agency which is the reason behind the interactive player-driven world where the mechanics and rules are simple. (Jenkins, 1998) The technical skills required from the player are also minimal, since our game is played on a browser with only the mousepad and few keyboard keys. The player is able to move around and impact their own gameworld where they can create their own narrative story.</p>\n\n<p><strong>Theme/context</strong></p>\n<p>General anxiety and anxiety disorder is not a new phenomenon, it has been around for a while. Recently over the last decade we’ve seen a significant rise in people with anxiety. According to (McCarthy, 2019) nearly 1 out 3 free teenage children will experience some form of anxiety disorder. In addition, we’ve seen these numbers increase steadily just a few years ago, where the number of children with anxiety disorder have risen by 20% from 2007-2012. Now in 2020, with the current Covid-19 pandemic looming in the shadows in our daily life, more people than ever are experiencing stress, fear and increased anxiety symptoms. Feeling overwhelmed, angry, sad and helpless are just some of the verbs used to describe the situation many people are experiencing during the pandemic, according to experts. (Murray &amp; Sherwood, 2020) <br/></p>\n<p>As a result of this, the purpose of our game is particularly to provide a game space to escape into for anxious people who during the Covid-19 situation have experienced an increase of anxiety. </p>\n<p><strong>Playtesting: </strong></p>\n<p>We tested Haven Isles with four playtesters, two female and two male testers respectively. In each playtest, stretching about 10 minutes, we tried not helping the players too much by sitting them down, placing the game in front of them and then giving them a task.<br/></p>\n<p><strong>Task for our playtester: </strong></p>\n<p>The task consisted of (1) finding an axe (2) using the axe to chop down a random tree. Furthermore, we asked the testers to Think Aloud to provide us with their immediate thoughts as well as to got as close to a full player experience as possible.</p><p><strong>Our playtesters</strong><br/></p><p>Player 1: Søren</p>\n<p>Player 2: Thea</p>\n<p>Player 3: Rasmus</p><p>Player 4: Mathilde</p>\n<p><strong>Feedback:</strong></p>\n<p>1. First we noticed the difference between testers and their technical skills, since two players immediately used the arrow keys to move the player. However, for the other two it took a while to realize. Also, they all pointed out that it was impossible to walk straight and very hard to control the character as highlighted by player 1: “I'm turning when I try to walk straight ahead. It is hard to control.”.</p>\n<p>2. Several testers mentioned that the graphics of the game were \"nice\" and two highlighted the music as fitting to the nature theme. One asked about the music: \"Have you chosen this music yourself? It's very meditative\" (Player 4), while another felt that the music encouraged a sense of mindfulness:  “The music fits very well to the nature theme. It promotes mindfulness” (Player 1) Another tester brought up that the music helped them focus on the game world: “I think the music is very calm and relaxing, so I can focus on my game” (Player 2). </p>\n<p>This was exactly our idea to give the player a relaxing experience of being in their own space. Likewise, players expressed that the island world worked well. Through observation we quickly sensed that we had to give more direction to the player and that they had to use an axe to cut the tree, which could indicate might indicate was distracted by the world due to the fact that this was specifically one of the tasks. Before that, all the players quickly started to walk around and explore. This was our vision, but we also wanted the tester to complete the task they were given.</p>\n<p>3. Three of the four players noted that the camera angle should be a bit higher so that the game view did not get occupied by treetops when in a forest. In relation to this, player 3 noted that \"If this was not a playtest, I would probably have quit the game”</p>\n<p><strong>Game fixes based on the provided feedback</strong><strong>: </strong><br/></p>\n<p>1. We have adjusted the player controls sensitivity. Now the controls should be more responsive and significantly easier to control. The players are actually in control of their actions now.</p>\n<p>2. To make possible actions clearer for the player, we made a small path from where the character starts by the house to the trees we asked them to cut down. In addition to this, we placed the axe in a more open spot closer to the player spawn making the task more obvious.</p>\n<p>3. We have fixed this issue in that now the camera is always on top of the items in the gameworld. </p>\n<p><strong>References: </strong></p>\n<p>Iten, G. H., Steinemann, S. T., &amp; Opwis, K. (2018). Choosing to Help Monsters: A Mixed-Method Examination of Meaningful Choices in Narrative-Rich Games and Interactive Narratives. <em>Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems  - CHI ’18</em>, 1–13. https://doi.org/10.1145/3173574.3173915<br/> <br/></p>\n<p> Jenkins, H. (1998). <em>“Complete freedom of movement”: Video games as gendered play spaces</em>.</p>\n<p>  Jenkins, H. (2003). <em>Game Design as Narrative Architecture</em>.</p>\n<p>  Mates, M., &amp; Stern, A. (2006). <em>The game design reader: A Rules of play anthology</em> (K. S. Salen &amp; E. Zimmerman, Red.). MIT Press.</p>\n<p>  McCarthy, C. (2019, november 20). <em>Anxiety in Teens is Rising: What’s Going On?</em> HealthyChildren.org.https://www.healthychildren.org/English/health-issues/conditions/emotional-problems/Pages/Anxiety-Disorders.aspx</p>\n<p>  Murray, J., &amp; Sherwood, H. (2020, marts 13). Anxiety on rise due to coronavirus, say mental health charities.<em>The Guardian</em>. https://www.theguardian.com/world/2020/mar/13/anxiety-on-rise-due-to-coronavirus-say-mental-health-charities</p>\n<p>  Witmer, B. G., &amp; Singer, M. J. (1998). Measuring Presence in Virtual Environments: A Presence Questionnaire. <em>Presence: Teleoperators and Virtual Environments</em>, <em>7</em>(3), 225–240. https://doi.org/10.1162/105474698565686<br/> </p>\n\n<p> </p>", "metacritic": null, "released": "2020-08-10", "tba": false, "updated": "2020-08-14T06:00:53", "background_image": "https://media.rawg.io/media/screenshots/696/696b34235ff12cdf5a24e3c9f43a58fb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 80, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Well Pl8"], "genres": [], "publishers": [], "esrb_rating": null}