{"id": 480770, "slug": "fight-night-battle-royale-3d", "name": "Fight Night Battle Royale 3D", "name_original": "Fight Night Battle Royale 3D", "description": "Fight Night Battle Royale 3D Shooting Survival 3D on a dead island with other players like you until all but the strongest have met their bitter end! Time flies by and the zone breathes right down your neck, so snatch up your weapons and equipment and jump into battle against the island's other survivors!<br/><br/>The shooting madness and FPS Offline shooter that will make you forget all other FPS combat are here! Feel the thrills of the fighting and killing in this FPS and become a real Shooter! Tired of the battle royale genre? Get ready for some action with your favorite gun and join this offline shooting battle now. Have you already? Run, shoot, laugh, and Respawn!<br/><br/>Join this fun third-person PvP adventure now! Play this online shooting FortFight Battle Royale Shooting Survival 3D for FREE: Complete challenges, join a special forces squad, or just kill them ALL shooting a gun!<br/><br/>Become whoever you want: sniper, special ops soldier, shooting expert, or just a combat killer to feel the thrills of the adrenaline in this online shooter! Feel the action of a TPS fight while you defeat your enemy army on all the battlefields.<br/><br/>If you like 3D epic special ops games, you will love this creative multiplayer army with PvP destruction mode. Will you become the last man standing? Join different sniper teams and define your online strategy and combat tactics to defeat the military rivals in the battle lands!<br/><br/><br/>This third-person shooter will make you forget any other multiplayer TPS game! If you love third-person shooter games and multiplayer or epic combat games, this PvP will make you forget about any other online shooters up you played before! Bring the victory home in this TPS. Take your heroes out of the fort into the battlefield at night! Win the war while avoiding the bullets!<br/><br/>Assassin, gunman, elite soldier, thumper gunman, or just a killer… Which one will you choose? Make your sniper or gunner aim at the shooting target and with your favorite thumper gun, prepare the assault with a shotgun or a rifle and attack and counterattack with violence with the fire of the bullets of your weapon!<br/><br/>Choose your Assault thumper gun and mark your target in this shooting struggle. An FPS offline shooter never was so funny! Start the PvP in this third-person shooter online!<br/><br/>Fight Night Battle Royale 3D Shooting Survival 3D Features :<br/><br/>• High-Quality Graphics &amp; engaging sound effects!<br/>• Challenging gameplay to Scavenge for weapons!<br/>• Gather supplies, guns and war equipment for survival!<br/>• Battle against unknown army squad in world war shooting game!<br/>• Explore the vast battleground as a US army commando survival shooter!<br/>• Challenge yourself to be the last standing player in the finest", "metacritic": null, "released": "2020-04-20", "tba": false, "updated": "2020-08-17T02:29:31", "background_image": "https://media.rawg.io/media/screenshots/d4f/d4f81d42981c60af5d30938b53e2deee.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 224, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Kashif Salman"], "genres": ["Action", "Adventure"], "publishers": ["Kashif Salman"], "esrb_rating": "Mature"}