{"id": 48090, "slug": "sprinkle", "name": "Sprinkle", "name_original": "Sprinkle", "description": "*** Winner of Best Casual Game in the 2012 International Mobile Gaming Awards! ***<br/><br/>\"Gaming App of the Day\" - [Kotaku]<br/><br/>\"Sprinkle is a solid puzzle game in a similar vein as Crush the Castle or Angry Birds, yet carries gameplay and an identity distinct from either.\" 4/4 Must have - [Slide To Play]<br/><br/>\"Sprinkle makes fighting fire with physics (and water, of course) a heck of a lot of fun\" 4.5 / 5 - [148Apps]<br/><br/>\"The game quickly made its way to every member of my family\" - [ArsTechnica]<br/><br/>Using a water cannon mounted on a crane, players must adjust the height and angle of the cannon to fight fires, move obstacles, spin wheels and activate traps in this challenging water-physics based puzzler! But squirt carefully as you will run out of water and the less water you use, the more drops you earn! <br/><br/>Sprinkle is available for devices running Android 2.3 or greater!<br/><br/>Using some of the most realistic water physics seen on an Android device yet, Sprinkle is a brain-teasing game that will have players straining to figure out each puzzle and obstacle. <br/><br/>Sprinkle features: <br/><br/>Amazing water physics – Some of the most realistic water physics ever seen on an Android device make Sprinkle an exciting and addictive puzzler. <br/><br/>Brain-teasing puzzles – What starts as simply pointing and spraying to quench each fire becomes much more challenging through the 72 levels, as players must overcome the intricacies of each puzzle before time and water run out. <br/><br/>Blocks, boulders, and cogs oh my – Use the power of your water cannon to move blocks of ice and boulders, spin giant cogs, and depress traps inorder to reach and extinguish every last fire. <br/><br/>The inhabitants of Titan, a moon of Saturn, lived out their days peacefully in their straw hut homes – until space tourists from Earth crashed through Saturn’s rings, bringing a storm of flaming asteroids crashing down on the Titans. To combat the widespread fires threatening their homes, the Titans have built a massive water cannon. And they need you to man it!<br/><br/>Xperia PLAY Optimized!", "metacritic": null, "released": null, "tba": false, "updated": "2022-07-21T11:22:14", "background_image": "https://media.rawg.io/media/screenshots/f52/f52b56757ab3c2d1a54592bf247da3c3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "beaten": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 134, "game_series_count": 0, "reviews_count": 3, "platforms": ["Android"], "developers": ["Mediocre"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": "Everyone"}