{"id": 480930, "slug": "nasty-ned-under-the-bed", "name": "Nasty Ned Under The Bed", "name_original": "Nasty Ned Under The Bed", "description": "<p><strong>Rather than downloading and building the game yourself, you can play it on here: </strong>http://nasty-ned-under-the-bed.herokuapp.com/<br/></p>\n<p>Play as the monster under a child's bed! Perform various moves to keep the child awake so that he fails tomorrow's big test! But watch out, don't let the child get too scared or else his parents will catch you!</p>\n<p><strong>NOTE:</strong>  I recommend you play on a chromium-based browser (chrome, edge, bruh) rather than something like firefox because the initial load time could be much longer<br/></p>\n<p><strong>HOW TO PLAY:</strong><br/> * after starting a game, the intro will play (where you will learn that the child has an important test tomorrow)<br/> * after the intro is complete, 7 buttons and an awake/scared meter will appear on the screen<br/> * click on one of the 7 buttons to perform a move<br/> * each move increases your score and the awake/scared meter by a certain amount<br/> * the stats of a move will appear when you hover over a button<br/> * the parents will occasionally check up on the child, if the child is scared (indicated by the awake/asleep meter turning red) the parents will catch you<br/> * the goal is to get as many points as you can, by performing moves, without getting caught before the time is up (see below for how you can get caught)<br/> * when the time reaches 0, the child will go to school to take his test and you will have hopefully earned him an F</p>\n<p><strong>HOW YOU CAN GET CAUGHT:</strong><br/> * the parents will occasionally check up on the child, and if the child is scared (indicated by the awake/asleep meter turning red) the parents will catch you<br/> * if you surpass the maximum value of the awake/asleep meter, the child will get too scared and scream, after which his parents will catch you</p>\n<p>TIP: press S in the main menu to enable skip intro</p>", "metacritic": null, "released": "2020-08-16", "tba": false, "updated": "2020-08-17T03:07:41", "background_image": "https://media.rawg.io/media/screenshots/1c8/1c8b519080827df8e014ae3f8849192e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 14, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Brodish"], "genres": [], "publishers": [], "esrb_rating": null}