{"id": 48098, "slug": "rpg-spectral-souls", "name": "RPG Spectral Souls", "name_original": "RPG Spectral Souls", "description": "\"Spectral Souls - Resurrection of the Ethereal Empires\" (English Version), the first Full Size Tactical RPG for Android platform available for your favorite Smartphone :<br/><br/>* 3D Battle Scenes.<br/>* The first full scale Japanese Tactical RPG for Android.<br/>* 52 outstanding soundtracks.<br/>* 84 characters.<br/>* High resolution graphic assets.<br/>* 100's of hours of GamePlay packed in 1GB data.<br/>* Cut-Scene videos.<br/>* Support for Touch &amp; Keyboard with key mapping.<br/>* Compatible with MOGA controllers.<br/>* Play it on NVIDIA SHIELD.<br/><br/>Simply \"a must have\" for all fan of \"Spectral Souls universe\" and for all fan of Tactical RPG in general.<br/><br/>** IMPORTANT NOTICE PLEASE READ **<br/><br/>-Game is set, by default, to use the HIGHEST resolution available so please adjust in the option screen should your device be a little \"just\" to support the full hires data.<br/><br/>-A High-End device is highly recommended for the best gaming experience however the game is fully enjoyable from Nexus1 or similar type of device. There is a pre-hardware check in the game before allowing the 1GB download so those with hardware not yet supported should be able to refund within the actual refund window. <br/><br/><br/>STORY :<br/><br/>Neverland is a world apart from our own, home to strange and dangerous creatures. Two of these creatures, humans and demons, have been struggling against each other for many years. As the centuries passed, control shifted from demons to humans and back again. The humans finally earned a clear victory after the First Neverland War. But this left the country in ruins and led directly to the Second Neverland War, which saw the decisive victory of the demons once again.<br/><br/>Magic Age 1053—<br/><br/>Tragedy strikes the small woodland village of Petun—the town is attacked and burned to the ground by vicious Neverland troops. But Petun is only the first of many massacres; the Demon Army tears through every human village it can find, slaughtering the people as it goes. Humiliated and infuriated by these abuses, the humans begin to resist and fight back.<br/><br/>It starts as a rash of disorganized, sporadic riots. But it soon grows into something more, something meaningful. These uprisings become a beacon of hope to all humans, spurring them on to unite and form a new empire. They choose a name to reflect their most noble traditions, to reflect a time when they ruled over the demon horde. They call it the Reformed Simba Empire.<br/><br/>Petun—little more than a bump in the road, a mark on a map. But this is where it all started, where the undercurrent of disdain and hatred overflowed into a bloody torrent of death and destruction, drowning Neverland in war for years to come.<br/><br/>This is where our story begins—the story of the Seven Year War.<br/><br/>- Visit our website and forum at http://www.hyperdevbox.com for more FAQ and information.<br/><br/>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-02T07:16:01", "background_image": "https://media.rawg.io/media/screenshots/7d7/7d73a87c447226a0b12e3097aea889bc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 314, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["HyperDevbox"], "genres": ["RPG"], "publishers": [], "esrb_rating": "Teen"}