{"id": 481096, "slug": "soldier-of-fortune-itch", "name": "Soldier Of Fortune (itch)", "name_original": "Soldier Of Fortune (itch)", "description": "SINOPSIS\r\n<p>“Pertarungan itu sangat besar dan mengerikan, kerajaan bahkan rela membayar tentara bayaran rendahan seperti kami dengan harga yang sangat tinggi. Namun, perang itu benar benar menghancurkan kami. Begitu sadar, aku sudah ada di tempat aneh dengan sihir yang kuat. Aku harus segera keluar dari sini.” <br/></p>\r\nDESCRIPTION\r\n<p>Soldier Of Fortune menceritakan tentang seorang mercenary atau yang biasa kita kenal dengan tentara bayaran yang terjebak di sebuah ruangan di dalam tower misterius. Player diminta untuk menjalankan mercenary mencari jalan keluar dari ruangan tersebut. Game ini adalah step-by-step dungeon crawler, di mana obor yang mercenary bawa hanya menerangi beberapa ubin di depannya yang berarti mercenary harus berjalan untuk menghindari jebakan dan monster mengerikan yang tiba-tiba muncul entah dari mana. Saat mercenary melihat monster, player dapat menggunakan obor untuk keuntungan player. Saat obor menyala, monster tersebut langsung lari ke lokasi mercenary. Namun sebaliknya, saat obor mati, monster itu akan diam di tempat. Jadi player disarankan untuk mematikan obor, berlari mengelilingi beberapa jebakan, menyalakan kembali obor dan melihat monster itu berlari ke arah jebakan. Akan Tetapi ketika obor mati, player tidak dapat melihat jebakan. Jadi saat player pertama kali menjelajah, player diharuskan untuk menghafal area ruangan, sehingga saat mercenary dikejar monster yang marah, mercenary dapat berlari dengan aman melewati semua jebakan yang tersembunyi dan kemudian menyalakan obor kembali untuk memancing monster tersebut ke arah jebakan.</p>", "metacritic": null, "released": "2020-08-16", "tba": false, "updated": "2020-08-17T03:40:38", "background_image": "https://media.rawg.io/media/screenshots/9bf/9bfe6e766dc48e5d3e55774c9f0be18f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 49, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ChessPorg"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}