{"id": 48108, "slug": "sonic-4-episode-i", "name": "Sonic 4 Episode I", "name_original": "Sonic 4 Episode I", "description": "Featuring enhanced gameplay elements, including the classic Sonic Spin Dash, and the versatile Homing Attack, Sonic 4 picks up right where Sonic and Knuckles™ left off.<br/>__________________________________________________<br/>2 EXCLUSIVE LEVELS!!!  <br/>Two exclusive levels built specifically for smartphones using the accelerometer. <br/><br/>NEW MOVES  <br/>All of Sonic's classic moves are available, including the newer Homing Attack which will add a new level of control and excitement.<br/><br/>CLASSIC SONIC STAGES   <br/>Race through 4 unique zones containing 4 acts each as well as 7 special stages. <br/><br/>SPECIAL STAGES RETURN  <br/>A staple of the Genesis-era games, the special stages return allowing fans to collect the 7 Chaos Emeralds and unlock Super Sonic. <br/><br/>REVAMPED CLASSIC BOSS BATTLES  <br/>Dr. Eggman returns with new and improved mechas and will go berserk when he accumulates damage.<br/><br/>¬¬<br/>GamePro - “…this looks and feels like a genuine Sonic game, deserving of the \"4\" attached to its title.”<br/>IGN – “After an afternoon in its presence it's become seared in our conscience just like the classic levels of the early Sonics – and surely that's reason enough to have faith in Sonic the Hedgehog 4.”<br/><br/>Be the first to know! Get inside SEGA info on great deals, plus the latest game updates, tips &amp; more…<br/><br/>FOLLOW US: twitter.com/sega<br/>LIKE US: facebook.com/sega<br/>VISIT US: http://blogs.sega.com/<br/><br/>Play SONIC 4™ EPISODE I on your big screen TV with MHL. Visit www.meetmhl.com for more information.<br/><br/>- - - - -<br/>Privacy Policy: http://www.sega.com/mprivacy<br/>Terms of Use: http://www.sega.com/terms<br/><br/>SEGA, the SEGA logo, SONIC THE HEDGEHOG and SONIC 4 EPISODE I are either registered trade marks or trade marks of SEGA Holdings Co., Ltd. or its affiliates. All rights reserved.", "metacritic": null, "released": null, "tba": false, "updated": "2019-09-17T11:28:36", "background_image": "https://media.rawg.io/media/screenshots/4af/4af110f91efebfd798e9c7a2eac7a2df.jpg", "website": "", "rating": 4.0, "rating_top": 4, "added_by_status": {"yet": 4, "owned": 73, "beaten": 10, "dropped": 1, "playing": 1}, "playtime": 0, "achievements_count": 15, "ratings_count": 6, "suggestions_count": 378, "game_series_count": 0, "reviews_count": 6, "platforms": ["Android"], "developers": ["SEGA"], "genres": ["Arcade"], "publishers": [], "esrb_rating": "Everyone"}