{"id": 481169, "slug": "cemeterierthings", "name": "CemeterierThings", "name_original": "CemeterierThings", "description": "<p>It was a <em>normal </em>day and you decided to visit your family's cemetery. After an hour in silence of peaceful graves you noticed something very wrong. Gates are locked and air is being filled with dark magic. Of course you know a rumor about three powerful wizards of your dinasty, but who actually believes in such tales nowadays?<br/>At least your pistol, lamp and matches are with you and it's known how to stop black witchcraft from spreading it's tentacles worldwide. Activate three rarest graves by striking a match near them and escape throw the gates till it's not too late!</p>\n<p>Control:<br/><strong>wasd </strong>- moving<br/><strong>arrows</strong> - shooting<br/><strong>1</strong>, <strong>2</strong> - using picked up items<br/><strong>x</strong> - extinguish the lamp (could be useful!)<br/><strong>f</strong> - use a match (consumes one) -&gt; light the lamp and activate a special grave<br/>\"<strong>-</strong>\" - make music quieter<br/>\"<strong>=</strong>\" - make music louder (button with \"+\")<br/><strong>Enter</strong> - restart the game<br/><strong>alt+f4</strong> - give up</p>\n<p>Some basic rules:<br/>- Don't read this section if you want a brain-cracking challange trying to undestand what is what.<br/>- You have to be very lucky just to have a chance to win<br/>- Mind is the blue thing on the right<br/>- Things can't exist if you don't see them<br/>- Lamp consumes oil while turned on<br/>- Lamp consumes mind while turned off<br/>- Monsters consume mind while seen<br/>- Monsters consume hp when you touch them<br/>- The goal is to activate 3 rare graves and then escape throw gates (use match near them as well)<br/>- Activated graves are shown in right-down corner<br/>- Violet slot is user for artifacts. Still, change to find them is 0%</p>\n<p>Items you can find:<br/>- <strong>Oil</strong> for the lamp<br/>- <strong>Ammunition </strong>for pistol<br/>- <strong>Blood </strong>for hp<br/>- <strong>Blue_whiskey</strong> for mind</p>\n<p>Game is still in development for LowRes jam, so I'll be happy to hear ANY comments, ideas and bug reports!<br/>(btw sometimes game is not winnable, )</p>", "metacritic": null, "released": "2020-08-16", "tba": false, "updated": "2020-08-17T04:00:08", "background_image": "https://media.rawg.io/media/screenshots/2e2/2e2d202c0c21fa1d0a9d9e4011f30084.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 60, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["MaximusTG", "PA3yMuCT", "StarikTenger"], "genres": [], "publishers": [], "esrb_rating": null}