{"id": 48110, "slug": "sonic-jump-fever", "name": "Sonic Jump Fever", "name_original": "Sonic Jump Fever", "description": "Catch the FEVER in an explosive race against the clock!  Compete with Sonic and friends in high-speed bursts of vertical jumping mayhem.  FREE and based on SEGA’s hit Sonic Jump. <br/><br/>Prove you are the best. Rack up huge combos to blast past your friends’ high scores.  Use boosters, upgrades, unique character abilities to maximize your score. Then kick into overdrive with Fever Mode and hit the top of the Leaderboard!  <br/><br/>JUMP REVOLUTION<br/>The all-new, free-to-play, Sonic Jump experience features quick-to-play explosive races against time! <br/><br/>CHALLENGE YOUR FRIENDS<br/>Compete with friends for the highest score. Play and post your scores on a Leaderboard that you share with your friends. The leaderboard updates instantly after every turn. So the competition never ends.<br/><br/>SHATTER YOUR SCORES<br/>Unleash FEVER mode to enter hyper-speed for earth-shattering scores.<br/><br/>PLAY &amp; UPGRADE A CAST OF CHARACTERS<br/>Play as Sonic, Knuckles and a host of famous characters. Upgrade their unique moves and abilities to help them soar to the skies.<br/><br/>UNLOCK THE POWER OF THE CHAO<br/>Recruit a legendary Chao from the Sonic universe! Find all the Chao to help you beat badniks, search for hidden rings and many more unique abilities!<br/><br/>- - - - -<br/>Privacy Policy: http://www.sega.com/mprivacy<br/>Terms of Use: http://www.sega.com/terms<br/><br/>Game apps are ad-supported and no in-app purchases are required to progress; ad-free play option available with in-app purchase.<br/><br/>This game may include \"Interest Based Ads\" (please see http://www.sega.com/mprivacy#3IBADiscolure for more information)​ and may collect \"Precise Location Data\" ​(please see http://www.sega.com/mprivacy#5LocationDataDisclosure ​for more information)​<br/><br/>", "metacritic": null, "released": "2014-04-16", "tba": false, "updated": "2022-11-19T05:27:28", "background_image": "https://media.rawg.io/media/screenshots/2a7/2a71e9c68b258832d1b357213f322691.jpg", "website": "http://www.sega.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1, "beaten": 3, "dropped": 4}, "playtime": 0, "achievements_count": 0, "ratings_count": 4, "suggestions_count": 221, "game_series_count": 63, "reviews_count": 4, "platforms": ["Android", "iOS"], "developers": ["SEGA"], "genres": ["Action", "Arcade"], "publishers": ["SEGA"], "esrb_rating": null}