{"id": 481247, "slug": "illusory-dreamlight-2-spiral-flame-chapter-1", "name": "Illusory Dreamlight 2: Spiral Flame [CHAPTER 1]", "name_original": "Illusory Dreamlight 2: Spiral Flame [CHAPTER 1]", "description": "<p><strong>Spiral Flame </strong>is a full-length turn-based RPG (role-playing game) with a story about time travel, magic, and the search for happiness.</p>\n<p>It's a lot cooler than it sounds, I promise.</p>\n<p>After Froze Winston notices strange things happening in his hometown of Southland, he ends up getting wrapped up in family drama spanning centuries and centuries that has him embark on a journey all over a somewhat-futuristic Southern California. Joined by Froze are his friends: Melody Rhythm, an optimistic girl with an abundance of energy, Cherry Berilia, a wannabe detective with an more neutral outlook, and Vessel Omnipota, a genius scientist and the oldest member of the group. And maybe more? Who knows?</p>\n\n\n<p>This demo covers the first chapter of the game. It serves as an introduction to the world you'll explore in the final game as well as the general tone of the story. Froze Winston is living an ordinary life in his hometown, when suddenly, the forest changes around him, just about the same time as a strange new citizen arrives in town...</p>\n<p>The estimated length of Chapter 1 is 1-2 hours.</p>\n\n<p><strong>Spiral Flame</strong> takes inspiration from many works of fiction, notably <em>Science Adventure</em> in its narrative, while the gameplay is a blend of <em>Dragon Quest</em> and <em>Paper Mario</em>.<br/></p>\n<p>So what can you expect from this demo? Well, to name a few things:</p>\n<ul><li>Two party members (wow!!!)</li><li>Cool, colorful areas (mostly with the color orange.)</li><li>Three difficulty modes (this will make a certain someone happy!)</li><li>Good (?) writing (I dunno, is it good?)</li><li>A whopping two full-size dungeons to explore (and a mini-dungeon between the two!)</li><li>A soundtrack made of original songs by Cheryl (that's me!), royalty-free songs from various Japanese sites, and a few selections from the works of Patricia Taxxon!</li><li>Assist mode features that allow you to handle the EXP rate, spell cost, and more!</li></ul>\n\n<p>It'll come... eventually. I'm currently working while developing this in my spare time alongside my other hobby projects. <strong>Spiral Flame</strong> has been in development for a year so far, and it's only this far along, so expect another year or a few. The goal is for the final game to be around 25 hours, with some optional content bumping it up to 30.</p>\n\n<p>You can join the Illusory Dreamlight Discord server here: https://discord.gg/BwMdtAY</p>\n<p>You can follow the development Twitter @StudioDreamlite</p>", "metacritic": null, "released": "2020-08-16", "tba": false, "updated": "2020-08-17T04:16:44", "background_image": "https://media.rawg.io/media/screenshots/76d/76dd2c88bff7fd39d3c9dbaac20c0d07.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 78, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["starspire"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}