{"id": 481229, "slug": "pokemon-battle-lab-gb-studio-battle-system", "name": "Pokemon Battle Lab (GB Studio Battle System)", "name_original": "Pokemon Battle Lab (GB Studio Battle System)", "description": "<p>Welcome to the Pokemon Battle Lab!<br/><br/>This is a demo of a battle system I'm working on for a Pokemon demake project. I was interested in learning GB Studio, and I've noticed a lot of people asking for Pokemon / RPG battle systems. Feel free to download this to use in your own fan game or just to mess around. The Battle System could easily be repurposed for non-Pokemon fan games, too! <br/></p>\n<p>//So what's in the game?</p>\n<ul><li>64 different pokemon moves.</li><li>4 Pokemon Powers (more to come) </li><li>3 Playable Pokemon (see if you can figure out how to change them!) </li><li>2 Pokemon encounters (1 random encounter, 1 NPC. Each can be re-battled!)\r\n</li><li>Plenty of NPCs to talk to, too!</li></ul>\n<p>//How to Play:<br/></p>\n<p>Explore the Battle Lab! Battle the Scientist! Chase off the rats. Talk to NPCs.<br/><br/>Controls:<br/>Z = A (Confirm)  / X = B (Cancel)<br/>Enter = Start (brings up Menu in overworld)<br/><br/>This isn't exactly the same battle system as PKMN, so here's what you'll need to know:<br/></p>\n<p>A Pokemon has 4 moves:</p>\n<ul><li>An Attack Move, which focuses on dealing damage.</li><li>A Defense Move, which focuses on protecting the user or buffing stats.</li><li>A Status Move, which focuses on giving the enemy a status condition.</li><li>And a Pokemon Power, a unique ability just for that Pokemon!</li><li>You can also use items, check on your status, or analyze the enemy!</li></ul>\n<p>If you see a (B) icon, press B in time to get a chance for a bonus effect!<br/><br/>//What are the files?</p>\n<ul><li>A Web Version of the exported GB Studio game</li><li>A ROM version to play offline</li><li>The GB Studio project itself so you can check it out and build your own</li><li>Some notes I took on the project</li></ul>\n<p>//Notes on the Battle System<br/>I've also uploaded some notes I've taken that go over my thoughts on the battle system. It covers why I chose to make it the way I did, what compromises I decided to make, and even has a few ideas for getting started on things I didn't implement, but think are possible!<br/><br/>//Final Thoughts!<br/>Let me know what you think. I'll come back to update this every now and then as I make improvements, but from here on out I'll be working on the main game. If there's anyone else out there working on de-makes in GBstudio I'd love to get feedback or share ideas on how to handle battles.  <br/><br/>If you do decide to use this system in a game of your own, (pokemon or otherwise), I'd appreciate a shout out! And check back for other updates (I'll be posting my pixel art soon!).<br/><br/>Stay safe out there, and have fun!<br/></p>", "metacritic": null, "released": "2020-08-16", "tba": false, "updated": "2023-04-27T08:14:18", "background_image": "https://media.rawg.io/media/screenshots/580/58051844c49f3a5fb4566fd3370c0814.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 110, "game_series_count": 0, "reviews_count": 1, "platforms": ["Web"], "developers": ["Lazy Dev"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}