{"id": 481398, "slug": "internal-combustion", "name": "Internal Combustion", "name_original": "Internal Combustion", "description": "<p>This here is a simple city racer built on unity. It includes a number of different levels, one level is free roam - the player drives around with no limits (timing limits). There are three other levels that are goal focused, to get somewhere or to destroy something with a time restraint. </p>\n<p>This is the main menu, the player can load levels or view information from here.</p>\n\n<p>This is what is seen when the free roam level is launched. In this level the player can explore the entire city.</p>\n\n<p>Here the player can select which level to play.</p>\n\n<p>Contribution to Project:                                                                                                                                 This was a solo learning project, I did the level design and the majority of the programming. The programming that I didn't do was the car and camera movement, I simply made changes to some statistics in the inspector tab. The level was built using a couple of free asset packs from the unity asset store.</p>\n<p>For the programming that I did do I learnt many things. I learnt how to create a checkpoint system for the player, the goal can only be reached/hit if all checkpoints have been hit. I also created, using code, a fuel system for the car, that when depleted sends the player into a fuel empty scene.</p>", "metacritic": null, "released": "2020-08-15", "tba": false, "updated": "2020-08-17T04:49:07", "background_image": "https://media.rawg.io/media/screenshots/288/28820d49dde226ac53ac676242bea97a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 42, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Lucas Fernandes Marcos"], "genres": ["Racing"], "publishers": [], "esrb_rating": null}