{"id": 48133, "slug": "skyforce-unite", "name": "Skyforce Unite!", "name_original": "Skyforce Unite!", "description": "Get yourself a plane and fly through the wild blue yonder!<br/><br/>Take on missions for the Hunters Association, explore the world and battle monsters. Create your very own team of helpers, mercenaries and apprentices, and head out on expeditions!<br/><br/>If a monster appears during an expedition, choose a card and attack! Will you use a Recovery Card? Maybe an Attack Card? Refine your strategy and fight wisely!<br/>Monsters feature Wind, Water, Lightning or Earth alignments, so choose a compatible weapon before taking on each enemy.<br/><br/>Of course, each pilot's skills are also important. Develop your character with various training exercises, and learn new skills that will aid you while exploring this dangerous land!<br/><br/>At the fabled New World, you can join up with other players and go on expeditions. There are many powerful monsters, so you probably won't stand a chance on your own. Push forward by helping each other!<br/>So, can you bring peace to the Uncivilized Land?<br/>Good luck!<br/><br/>'****************************<br/>• All game progress is stored on your device. Save data cannot be restored after deleting or reinstalling the app.<br/>------------------------------- <br/>Try searching for \"Kairosoft\" to see all of our games, or visit us at http://kairopark.jp. <br/>Be sure to check out both our free-to-play and our paid games!", "metacritic": null, "released": "2016-06-08", "tba": false, "updated": "2019-07-30T09:59:11", "background_image": "https://media.rawg.io/media/screenshots/1be/1befe98779c4abd563ccf2cdbcb6561f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 213, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android", "iOS"], "developers": ["Kairosoft"], "genres": ["Strategy", "Arcade", "Casual"], "publishers": ["Kairosoft"], "esrb_rating": "Everyone 10+"}