{"id": 481384, "slug": "eat64", "name": "Eat64", "name_original": "Eat64", "description": "<p>Controls:</p>\n<p>Left - move left</p>\n<p>Right- move right</p>\n<p>Up - move up</p>\n<p>Down - move down</p>\n<p>Eat Energizers to frighten ghosts! Clear mazes to earn extra lives! How far can you explore on the Meta-Maze?</p>\n\n<p>Based on a game design I made sometime around 1983, and a prototype programmed by my father in GraFORTH for the Apple ][. This version contains none of the original GraFORTH source code, but instead was implemented in C# and Unity for your browser. </p><p>One of the #LOWREZJAM 2020 optional themes was \"Always Moving\", which is sort of aligned with this game. Honestly, I was going to make this game regardless of prompts, but given that the ghosts are always moving, and the player character is mostly chasing or being chased by ghosts, it sort of fits. In the original Pac Man game, there was a corner that you could \"hide\" to avoid ghosts forever. This game has some of those, too - as an emergent behavior. I didn't really appreciate what that meant back in the early 80s when I was playing Pac Man in the arcades.</p>\n<p>Thanks to:</p>\n<ul><li>Marcin Wichary - for the Pac Man Google Doodle, and his subsequent tech talk. Can't say I used much that I learned from you here, but the inspiration was great!</li><li>\"The Pac-Man Dossier\" by Jamey Pittman: https://www.gamasutra.com/view/feature/3938/the_pacman_dossier.php a great resource, particularly on the ghost AI</li><li>Toru Iwatani - for the original Pac Man game</li><li>Leshy Labs - https://www.leshylabs.com/apps/sfMaker/ for the sound effects</li><li>Unity - for the game engine</li></ul>\n<p>This game is dedicated to the memory of George LeCompte, who opened doors for me and used phrases like \"when you make your first game\", helping me believe in myself. By now, I've lost track of how many games I've made, but if I can help the next game developer, that'd make Dad proud.</p>", "metacritic": null, "released": "2020-08-15", "tba": false, "updated": "2020-08-17T04:44:58", "background_image": "https://media.rawg.io/media/screenshots/d31/d31dd9badaa47e4decb7b017ea6c8b73.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 9, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["BigDiceDave"], "genres": ["Action"], "publishers": [], "esrb_rating": null}