{"id": 481375, "slug": "rgb-defense-low-rez-game-jam", "name": "RGB Defense (Low Rez Game Jam)", "name_original": "RGB Defense (Low Rez Game Jam)", "description": "<p>RGB Defense is a tower defense game made for Low Rez Jam 2020. Towers can swap places at any time, and towers deal bonus damage to enemies that share their color. You'll need to make split-second, under-the-gun decisions to maneuver your towers against waves of ever more dangerous enemies over six levels. Each color of tower provides not only a special power to its own projectiles, but also to its adjacent neighbors. Experiment with different arrangements to customize your defense.</p>\n<p>This game was a blast to make, and allowed me to test mechanics for an upcoming game. I hope you enjoy it!</p>\n<p><strong>Controls:</strong></p>\n<p>Left Click: Place / Upgrade Towers</p>\n<p>Right Click: Swap Towers</p>\n<p>1-6: Select Tower Color</p>\n<p>Esc/Space: Pause</p>\n<p>Instructions available in-game.</p>\n<p><strong>Tips:</strong><br/></p>\n<p>RGB Defense is <em>difficult</em>. If you get stuck, here's some general strategy tips:</p>\n<p>Towers don't deal much damage unless they're shooting a same colored enemy. Try to maneuver your towers such that they're always shooting the right thing.</p>\n<p>Resources are scarce in the early game. Wait to see what enemies are coming before spending money.</p>\n<p>Towers gain a temporary damage boost after being swapped. Whenever you have a free moment, swap towers back and forth to improve your damage output.</p>\n<p>Spam click on annoying enemies. It doesn't do anything, but might make you feel better.</p>", "metacritic": null, "released": "2020-08-15", "tba": false, "updated": "2020-08-17T04:42:37", "background_image": "https://media.rawg.io/media/screenshots/325/325b2f7cbcd604cd76f53722c3e9461b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 15, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["corriveaugames"], "genres": ["Action", "Strategy"], "publishers": [], "esrb_rating": null}