{"id": 481490, "slug": "forest-roguing", "name": "Forest Roguing", "name_original": "Forest Roguing", "description": "<p>A continuous roguelike where you are lost in a forest and trying to find your way out.</p>\n<p>No matter which way you go, you just find yourself heading deeper and deeper in the forest. Keep going, survive long enough, and you might just find your way out. </p>\n<p>This game was, strangely perhaps, inspired by Justin Smith's <em>Desert Golfing</em>. I was playing the recent sequel <em>Golf on Mars</em> and wondered if I could translate the 'continuous world' sensation to a roguelike sort of game where, instead of travelling through discrete 'levels' of a dungeon, you just gradually end up deeper in the forest. This is the result!</p>\n<p>This is probably the most systemically complex game I've ever made. There's a bunch of different magic spells and types of enemies with different statistics and ways of moving. You get experience points to level up and gold to spend at shops.</p>\n<p>The ending, if you survive that long, is a bit anti-climactic because I hit the code limit of what Pico-8 let's you do sorry lol.</p>\n<p>I suspect it's not perfectly balanced. I would be keen on feedback on what is too easy or too hard!</p>\n<p>I think I resolve any game-breaking bugs. If you do get one, though, I'd greatly appreciate a screenshot of the error message!</p>\n<p>Considering the amount of work I put into this game, I am charging a minimum price of $1.</p>\n\n<p><strong>HOW TO PLAY</strong><br/></p>\n<p><em>Controls<br/></em>Use arrows to move. If move towards an adjacent enemy, you attack them. If you move towards an adjacent merchant, you open the shop.</p>\n<p>Hold 'Z' to open the radial menu. Use arrow keys to highlight a selection then release Z to select.</p>\n<p>In menus, use X to make a selection.</p>\n<p>If you get Game Over, press Z or X to reset. </p>\n<p><em>Enemies<br/></em>As you move around, enemies will spawn and move towards you. Some enemies have different kinds of behaviours for you to figure out. </p>\n<p><em>Magic<br/></em>If you come across a mage, they will gift you with a new spell. You can only have a maximum of 3 spells, and must replace an old sell with a new one. Spells include:<br/></p>\n<ol><li>Bolt - Zap any square</li><li>Fireball - Blast a square on same row or column of grid</li><li>Teleport - Move to a random square</li><li>Dash - Move in a straight line til hitting an obstacle or edge of screen.</li><li>Shockwave - Push back enemies</li><li>Freeze - Make an enemy skip a turn</li><li>Heal - Heal some health</li></ol>\n<p><em>Items and Merchants<br/></em>Merchants have various wares for sale. Potions recover HP. Ethers recover MP. Elixirs increase your stats permanently.</p>\n<p><em>Levelling up<br/></em>Once you get enough experience points, open the 'Stats' menu to apply your skill points and level up. </p>", "metacritic": null, "released": "2020-08-15", "tba": false, "updated": "2020-08-17T05:11:40", "background_image": "https://media.rawg.io/media/screenshots/c70/c709146ca19dd7a84aa89bbae1155603.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 78, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Brendan Keogh"], "genres": [], "publishers": [], "esrb_rating": null}