{"id": 481559, "slug": "chez-moi", "name": "Chez Moi", "name_original": "Chez Moi", "description": "<p>\"Chez moi\" est une expérience interactive à partager pour découvrir des citations et explorer un petit jardin intérieur. Vous pouvez insérer vos propres citations dans le jeu en modifiant le fichier citations.xml qui se trouve dans le répertoire \"Chez Moi_Data/StreamingAssets\", puis offrir le jeu à quelqu'un.</p>\n<p>Le jeu se joue uniquement au clic, il y a 7 plantes à découvrir et vous pouvez cliquer sur le tableau noir pour revoir les citations déjà trouvées.<br/>Dans le menu pause (en pressant échap), vous pouvez cliquer recommencer si vous voulez retrouver le jardin de départ.</p>\n<p>\"Chez Moi\" is an interactive experience to share. Discover quotes and explore a tiny interior garden. You can insert your own quotes in the game by modifying the file citations.xml which is located in the folder \"Chez Moi_Data/StreamingAssets\". Then you can offer the game to someone.</p>\n<p>The game is played with the mouse clic, there is 7 plants to discover, you can click on the blackboard to see again the quotes you unlocked.</p>\n<p>In the pause menu (by pressing escape), you can \"recommencer\" to start again the expérience.</p>\n\n<p>Réalisé par :</p>\n<p>Julie Stuyck : https://www.artstation.com/kitshyju</p>\n<p>Noé Féret : https://www.noeferet.com</p>\n<p>Sébastien Mader</p>\n<p>Stéphanie Mader : http://smader.interaction-project.net/</p>\n<p>*A Mac Build may be made soon</p>", "metacritic": null, "released": "2020-08-14", "tba": false, "updated": "2020-08-17T05:25:46", "background_image": "https://media.rawg.io/media/screenshots/3e4/3e45aca656b4cfc2e0ec0d4a842b0ff4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 58, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["RedNaK"], "genres": [], "publishers": [], "esrb_rating": null}