{"id": 481615, "slug": "imposter-syndrome-crownednene", "name": "Imposter Syndrome (crownednene)", "name_original": "Imposter Syndrome (crownednene)", "description": "Description\r\n<p>You are working as an anxious young intern at a big company. You receive an email from Big Boss (your boss) that says they want to talk to you at lunch for a big evaluation. This makes you anxious but you still have to go around and do work. You have a list of tasks to complete but you have to interact with your coworkers so they can help you. But be careful! If you run out of time or your anxiety level gets to be too high, you fail your evaluation. Even if you don’t get to that stage, your score gets affected by those levels. You can also attempt to leave before the evaluation by using the elevator after completing one of your tasks or by collecting all three keys to the stairwell. But doing so means you get an automatic failing grade (and maybe learn why Big Boss is called Big Boss).<br/></p>\n<p>Role: Level Designer</p>\r\nNotes\r\n<ul><li><em>(This is only a prototype for a level design class and can be very buggy.)</em></li><li><em>Consume memes and cake to lower your anxiety levels (but you can only take two items with you, if you try to fill your inventory past the allotted two spaces, some items get lost forever).</em></li><li><em>To complete tasks, you need to first approach the machine (box in the kitchen, copier in the copy room), interact with the person who matches the emoji (click the emoji), and loo for the item that is missing.</em></li></ul>", "metacritic": null, "released": "2020-08-06", "tba": false, "updated": "2020-08-17T05:38:57", "background_image": "https://media.rawg.io/media/screenshots/6fe/6fe1b9f205841c5e76adb42694815e20.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 77, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["crownednene"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}