{"id": 481886, "slug": "for-the-people", "name": "For the People", "name_original": "For the People", "description": "<p>For the People is an acute social novel with strategic elements that puts the player in the shoes of a state official.</p>\n<p>Congratulations, dear comrade! From now on, you are the head of a small but important industrial center bearing the proud name of Iron-1. Your task will be to manage and rebuild it amidst the formation of a new totalitarian regime, currently faced with the consequences of the recent revolution, such as a deepening social crisis and an utter economic deficit.<br />\nYet we remain confident that it is young specialists such as yourself, who will lead this county to a stable and prosperous future.</p>\n<p>Glory to the Union of People&#39;s Orange Communes! Glory to Comrade Steel!</p>\n<p>Key features<br />\nDevelop a taste for power<br />\n– Hooligans, ganging up on a defenseless old man? Lock &#39;em up!<br />\n– It appears that grandpa is a veteran counter-revolutionary...<br />\n– In that case, let the poor boys go... Pops had it coming!<br />\nManage the appeals for justice from your citizens, grant or dismiss requests from subject departments, and untangle a web of political intrigue. Information is your most valuable resource, so do not be afraid to obtain it by any means necessary!</p>\n<p>Always be two steps ahead<br />\nEvery district in Iron-1 needs your help, but with a limited budget, you cannot help everyone. Strategically distribute resources to the people to earn their trust and increase your influence over them. There is no chance to please everyone, so you will inevitably have to take sides.</p>\n<p>Over 5 possible endings<br />\nEvery decision has a consequence. You will need to balance the interests of the party, the future of the country, and the very livelihood of your citizens.<br />\nSo, whose side will you really be on?</p>", "metacritic": null, "released": "2020-08-13", "tba": false, "updated": "2023-12-28T19:38:42", "background_image": "https://media.rawg.io/media/games/9ba/9ba961ff985b8b73878b1ee2731d40b7.jpg", "website": "", "rating": 3.21, "rating_top": 4, "added_by_status": {"yet": 7, "owned": 4, "beaten": 12, "toplay": 7, "dropped": 5, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 13, "suggestions_count": 294, "game_series_count": 0, "reviews_count": 14, "platforms": ["Linux", "macOS", "PC"], "developers": ["Brezg Studio"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["101XP"], "esrb_rating": null}