{"id": 481948, "slug": "my-restaurant-cooking-game", "name": "My Restaurant: Cooking Game", "name_original": "My Restaurant: Cooking Game", "description": "My Restaurant Crazy Cooking Madness Games is the brand new Cooking &amp; Design Home Game.<br/><br/>The perfect combination of Cooking and Decoration Home Design Makeover Game. Manage your own Restaurant and become the Star Chef in this highly addictive and FREE time management Cooking Game. <br/><br/>Welcome to Cooking Tasty Town a place attract many famous Crazy Chefs and a large number of madness food lovers. Enjoy Cooking Frenzy and Cooking Hot from restaurants to restaurants in your Cooking City, unlock more Restaurants and Kitchens, build your own Cooking City as you can. Show Cooking and Decorating talents, beat more Cooking Challenges. You are the next Cooking Star Chef in Tasty Town. Let this dreamed culinary journey begin. Write down your Kitchen Diary!<br/><br/>Powerful boost system makes you the invincible. Magic powerful boosts help you reach your Top Chef goal Food won't get overcooked anymore with magic cooker dish can be cooked instantly with instant cookers. There are more special game content waiting for you to explore. One more step to become cooking star in this famous tasty town.<br/><br/>Features:<br/>Cook hundreds of wonderful recipes in different restaurants!<br/>Collect enough keys to unlock new cooking restaurants!<br/>Upgrade your kitchen appliances to server more customers!<br/>Beat more than one thousand food levels!<br/>Expand your restaurants and design your cooking city!<br/>Win in exciting tournament with lots of rewards!<br/>Decor your restaurant as you want!<br/><br/>Cook and serve the world-famous gourmet cuisine, design your dreamed room as you want. What a nice dream! You could relax in your own room after the exciting cooking time, it all can be real in this game.", "metacritic": null, "released": "2020-08-07", "tba": false, "updated": "2020-08-21T02:33:01", "background_image": "https://media.rawg.io/media/screenshots/023/02376a3cb2a8e75461341ce1ca50e6ff_MrkCRWc.jpg", "website": "https://www.techvisionjoy.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 301, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["TECHVISION PTE"], "genres": ["Strategy", "Simulation"], "publishers": ["TECHVISION PTE"], "esrb_rating": "Everyone 10+"}