{"id": 481997, "slug": "along-the-river-of-spacetime", "name": "Along the River of Spacetime", "name_original": "Along the River of Spacetime", "description": "<p>Available exclusively on Oculus Go.</p>\n<p><em>Along the River of Spacetime</em> is a virtual reality game about activating Anishinaabe star knowledge to enhance river ecosystems.</p>\n<p><strong>ARTIST STATEMENT<br/></strong>This virtual reality game shares Anishinaabeg teachings relating to land practices, star knowledge, and quantum physics in an interactive non-linear journey about restoring rivers and their ecosystems by activating Anishinaabe constellations. Coded particle systems of light, hand drawn art brought into form with copper, and 360° film of riverways running through Nkwejong in Michigan are merged into technology-empowered storytelling. The work reflects the worldview passed on to me by mother Grace L. Dillon who coined the term “Indigenous Futurisms”—our stories share science. So, too, can our stories be shared through technology. My greatest hope is to show ways in which our ways of knowing can be experienced through design. </p>\n<p><em>Along the River of Spacetime</em> does just this by embedding Anishinaabeg scientific teachings within user interactions. The leaps in the journey are activated with an Anishinaabe symbol which parallels a particle physicists theorize may relate to teleportation, recently recognized by the LHCb experiment at CERN’s Large Hadron Collider. As riverways are fully restored, Anishinaabeg teachings about water unravel to the light of stars nourishing medicinal plants into form.<br/></p>\n<p><strong>SHOWINGS</strong><br/>Shown in the DEPTH Exhibition at the Science Gallery Detroit in Detroit, Michigan. More announcements forthcoming.</p>\n<p><strong>TEAM<br/>Design and Art</strong> - Elizabeth LaPensée<br/><strong>Music </strong>- Exquisite Ghost a.k.a. Jordan Thomas<br/><strong>Programming</strong> - Will Johnston<br/></p>\n<p><strong>THANK YOU</strong><br/>Made possible by the Guggenheim Foundation Fellowship 2018. With support from Michigan State University.</p>", "metacritic": null, "released": "2020-08-20", "tba": false, "updated": "2020-08-21T02:44:00", "background_image": "https://media.rawg.io/media/screenshots/3d7/3d754b34df7686a2e81503b425a534cb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 147, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Elizabeth LaPensee"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}