{"id": 481973, "slug": "rock-ball-fall-down-ball-hop-tap-jumper", "name": "🔮 Rock Ball: Fall Down Ball Hop 🧶 Tap Jumper 🏓", "name_original": "🔮 Rock Ball: Fall Down Ball Hop 🧶 Tap Jumper 🏓", "description": "<p>Guide the <b>Rock Ball</b> in a thrilling fall down ball hope quest! Go down, but watch out – there are all kinds of different obstacles that may destroy the fast ball. Show great reflexes, think fast, anticipate the situation and you’ll rock this ball hopper fast tap game!</p>\n<p><b>Rock Ball</b> is the most vibrant addictive brain challenging game! This game will let you think ahead before you let the ball fall while playing this puzzle game you can balance the ball like a pro. <br/>👆</p>\n<p>👀 <b>THE CHALLENGE</b><br/>The Rock Ball is going down but can be kept in the same place with fast tap bounces. As you go down watch out the different obstacles coming, like rotating platforms and shapes. Only the ones with the sharpest minds and quickest reactions will crash the high scores and dominate the ball hop game. </p>\n<p>🎭 <b>CHOOSE CHARACTERS</b></p>\n<p>Play with different characters and show the spirit of a real adventurer by choosing between multiple types of characters including animated characters.</p>\n<p>🌎 <b>DIFFERENT WORLDS</b><br/>Explore our different environments by unlocking new worlds. Show the spirit of real adventurer and even try out different space themes. Be energized by the upbeat soundtrack and enjoy the simple ball game in your free time.</p>\n<p>🏆 <b>DOMINATE THE LEADERBOARDS</b><br/>Put your best effort in every second so you can improve your score. Our ball hop game has a global leaderboard of tap bounce ball switch players just like you. Can you top them all and become the #1 ball hopping master?</p>\n<p>🔥 <b>ENTERTAIN YOUR DOWNTIME WITH:</b><br/>▪️ endless go down ball jump quest<br/>▪️ simple ball tap controls<br/>▪️ reflex testing obstacles<br/>▪️ upbeat soundtrack<br/>▪️ global leaderboards<br/>▪️ different worlds and gaming environments <br/>▪️ use points to restart at your last checkpoint<br/>▪️ offline ball hope game<br/>No more feeling bored in your free time!<br/>Don’t miss this dynamic and ultra-fun fall down ball hopping quest!</p>\n<p>👉 <b>Get Rock Ball &amp; delight in the fast ball jumping challenges that come at you fast &amp; unexpectedly!</b></p>", "metacritic": null, "released": "2020-08-21", "tba": false, "updated": "2020-08-21T02:39:06", "background_image": "https://media.rawg.io/media/screenshots/927/927c5989a33122f6a7a0300007ff31ac.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 83, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["timibz"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}