{"id": 481913, "slug": "black-myth-wu-kong", "name": "Black Myth: Wu Kong", "name_original": "Black Myth: Wu Kong", "description": "<p>A world unseen, where new sights rise with every stride. Enter a fascinating realm filled with the wonders and discoveries of ancient Chinese mythology!</p>\n<p>As the Destined One, you shall venture through breathtaking landscapes in the classic tale of Journey to the West, creating a new epic of uncharted adventures.</p>\n<p>Heroic Monkey, might and fame, adversaries rise, to test his name. One of the major highlights of Journey to the West is its diverse cast of adversaries, each with unique strengths.<br />\nAs the Destined One, you shall encounter powerful foes and worthy rivals throughout your journey. Fearlessly engage them in epic battles that know no surrender.</p>\n<p>Spells unbound, knowledge&#39;s flight, infinite abilities take their height. Spells, transformations, and magic vessels in all manifestations, complementary yet adversarial, have long been iconic combat elements in Chinese mythology.<br />\nAs the Destined One, aside from mastering various staff techniques, you can also freely combine different spells, abilities, weapons, and equipment to find the winning formula that best suits your combat style.</p>\n<p>Within beings of every kind lies the story of a life. Beneath the ferocity and craftiness of your foes lies an engaging tapestry of their origins, personalities, and motivations waiting to be revealed.<br />\nAs the Destined One, you will uncover the stories behind a variety of characters, delving beyond your battles with them, to taste the love and hate, greed and fury they once had and still carry with them.</p>", "metacritic": null, "released": "2024-08-20", "tba": false, "updated": "2024-04-20T16:04:31", "background_image": "https://media.rawg.io/media/games/779/77988e89f7862afeede524420aa251b0.jpg", "website": "http://www.heishenhua.com/", "rating": 4.57, "rating_top": 5, "added_by_status": {"yet": 56, "owned": 49, "toplay": 282}, "playtime": 0, "achievements_count": 0, "ratings_count": 7, "suggestions_count": 526, "game_series_count": 0, "reviews_count": 7, "platforms": ["PC", "Xbox Series S/X", "PlayStation 5"], "developers": ["Game Science"], "genres": ["Action", "RPG"], "publishers": ["Game Science"], "esrb_rating": null}