{"id": 481999, "slug": "faradays-magnets", "name": "Faraday's Magnets", "name_original": "Faraday's Magnets", "description": "<p><strong>[Please use Oculus Quest with hand controllers]</strong></p><p><strong>[v0.2] Oersted's electromagnetic experiment added!! </strong></p>\n<p>Go to the \"Faraday's Lab\" to play Michael Faraday's electromagnetic experiments.</p>\n<p>Go to the \"Oersted's Lab\" to explore electricity, magnetism, and Hans Oersted's discovery of electromagnetism.<br/></p>\n<p>--</p>\n<p>Transport yourself back in time to 1855 into the lecture hall of Michael Faraday, the experimental physicist who made vital discoveries around the understanding of electromagnetism. Joined by Scottish mathematical physicist James Clerk Maxwell, you will be able to visualize and interact with the magnetic forces in action like never before.</p><p>--</p>\n<p>Put on the \"Dyson Hat\" to see the invisible forces - the math structure superimposed onto the reality. We were inspired by Prof. Freeman Dyson's essays to design this hat for visualizing the two-layer structure of the world - the reality that satisfied math equations and the reality that we can touch.</p>\n<p>Pick up two bar magnets and feel the magnetic field. Use a bar magnet to generate current from the helix coils. Do you know why the direction of current changes?</p><p>--</p>\n<p>Faraday's Magnets VR app is created with Unreal Engine 4.24. Please let us know what you think :) Please consider support our indie development by being a subscriber of ScienceVR ($99 to receive Oculus Store keys for our VR labs via sciencevr.com).</p>\n<p>Jackie at sciencevr.com</p>", "metacritic": null, "released": "2020-08-20", "tba": false, "updated": "2020-08-21T02:44:21", "background_image": "https://media.rawg.io/media/screenshots/f7e/f7eb85063180e64596b68ded3d9721d7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 92, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["sciencevr"], "genres": ["Educational", "Puzzle"], "publishers": [], "esrb_rating": null}