{"id": 481969, "slug": "salad-master-3d-salad-choppingveggie-slicer", "name": "🥗Salad Master 3D: Salad Chopping🪓Veggie Slicer🍆", "name_original": "🥗Salad Master 3D: Salad Chopping🪓Veggie Slicer🍆", "description": "<p>Are you looking for the chopping thrill usually found in the table fruit slice &amp; veggie slice games?</p>\n<p>Do you love the satisfaction when you chop chop fruits and vegetables and make salads?<br/>Well, you must try <b>Salad Master 3D</b>, the ultra-fun salad chopping game filled with a slice cut fruit &amp; veggies fun! Become the champion salad chopper and play the ultra-fun Salad Master 3D in single-player or multiplayer.</p>\n<p>🍈<b>CLASSIC SALAD CHOPPING GAMEPLAY</b><br/>The fruits and veggies are constantly moving on the table. Use the tools such as the ultra-sharp food graders to chop the veggies and fruits without touching the barriers in between. Slice as many as possible to pass the level or cut more than your opponent to win the multiplayer battle.</p>\n<p>🆚<b>100+ LEVELS &amp; MULTIPLAYER FUN</b><br/>Try the single player salad chopping challenge and enjoy pure salat cutter fun. Watch out, grading &amp; chopping the fruits and veggies will become super-fast and incredibly hard as you progress. When you need some extra challenge &amp; competition, play the salad slicing multiplayer mode and experience a new level of slicer fun.</p>\n<p>👍<b>WHY SALAD MASTER 3D</b><br/>- exquisite chopping, grading &amp; slicing gameplay<br/>- cut veggies, fruit, meat, sweets and more 🍖🍍🥒<br/>- tap and hold to grade and chop<br/>- HD 3D graphics<br/>- continue where you lost the game by watching an ad<br/>- captivating chop chop sounds<br/>- chef animation when a level is complete<br/>- 100+ levels &amp; multiplayer mode<br/>- 100% Free to play</p>\n<p>How fast can you make a salad?</p>\n<p>Start your quest of making the tastiest salads. <br/>Enroll in some crazy-fun salad chopping competitions.<br/> <br/>🔪 Get <b>Salad Master 3D</b> now for free!</p>", "metacritic": null, "released": "2020-08-21", "tba": false, "updated": "2020-08-21T02:38:12", "background_image": "https://media.rawg.io/media/screenshots/cb1/cb14e36c176159dce57fef959ebd53c9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 47, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["timibz"], "genres": [], "publishers": [], "esrb_rating": null}