{"id": 48249, "slug": "pixel-super-heroes", "name": "Pixel Super Heroes", "name_original": "Pixel Super Heroes", "description": "Do you ever have a dream to become a Super Heroes?! Now this is your chance to achieve your dream and prove your skill to become the next Super Heroes!<br/><br/>Now the world is threatened by a new enemy and good people are taken as hostage. We must find all the Super Heroes again and save the world. All Heroes will have to run across the city, fight the evil new enemy and free the hostages.<br/><br/>Pixel Super Heroes is a very addictive and most thrilling Super Heroes Action Running Game where you must collect coin as much as possible and also save the hostage. Now it's a time to become the next Super Heroes!<br/><br/>Test your reflexes as your Super Heroes will race down the city, touch the screen to jump, smash enemy, collect coin, unlock new Heroes, and see how far you can run!<br/><br/>✧Awesome Pixel Art Super Heroes✧<br/>Get many Super Heroes to accompany you in your interesting and thrilling running game! Collect all of Super Heroes and Save all the hostages by using your favorite Super Heroes. You will also get a different city if you play with different Super Heroes.<br/><br/>✧Collect Coin✧<br/>Collect as many coins when you running and use it to recruit your favorite Super Heroes.<br/><br/>✧Save the Hostage✧<br/>This is what it mean to be a Super Heroes! Face the evil and Save all the hostages.<br/><br/>✧Offline Mode &amp; Online Mode✧<br/>Don't have internet connection? No Problem! You can play Pixel Super Heroes anywhere, anyplace and anytime!<br/><br/>✧Easy to Play✧<br/>Tap the screen to make the hero jump from platform to platform, make sure you must avoid attacks from enemy. Good luck ʕ•̀ω•́ʔ<br/><br/>✧Challenge Mode✧<br/>Complete all CHALLENGE and get the reward!<br/><br/>✧Special Power Up ✧<br/>Get the Special Power Up when you run and feel the greatness of Super Heroes Power.<br/>Each power up  are different and has an unique power.  Make sure you can get this power and use it to become Super Heroes!<br/><br/>So, what are you waiting for? Save the world with your Super Heroes Powers<br/><br/>Pixel Super Heroes is free to download and play. However, some game items can also be purchased for real money. A network connection is required during purchase game items.<br/><br/>Join the community at<br/>Facebook - https://www.facebook.com/PixelSuperHeroes<br/><br/>Have any trouble and need our support? Contact our support at http://support.lytogame.com", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:10:18", "background_image": "https://media.rawg.io/media/screenshots/792/7922f3e7261a7ca47da53c487d05ff7d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 219, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android"], "developers": ["LYTO MOBI"], "genres": ["Casual"], "publishers": [], "esrb_rating": null}