{"id": 48251, "slug": "pirates-showdown-premium", "name": "Pirates! Showdown Premium", "name_original": "Pirates! Showdown Premium", "description": "Pirates! Showdown is a fast-paced game combining real-time strategy(RTS) and defense tactics.  The full hit Android game with no ads and no in-app-purchases.<br/><br/>Featured on Google Play<br/><br/>\"...it's the streamlined method of delivery that makes Pirates! Showdown rather masterful.\"<br/>PocketGamer.co.uk<br/><br/>3rd place on list of best Android tablet games!<br/>Digital Trends<br/><br/>\"Seriously, this is a very cool game!\"<br/>AndroidGameplay4You<br/><br/>5 Stars - Very addictive By far one of the best games I've ever played on my phone<br/>5 Stars - Best game around!! Warning.....you will find yourself playing this for hours and hours ... Highly recommend this to anyone!!!<br/>5 Stars - Wickedly entertaining A must have<br/>5 Stars - Great game Easy to play, many skill levels, totally entertaining.<br/><br/><br/>Face off against the fearsome Red Hand privateers in thrilling head-to-head pirate battles on the high sea!  Capture towns and other structures to strengthen your defense and increase your gold supply.  Capture your enemy's base to win, but make sure you are also defending your own base!   75 campaign levels plus randomly generated maps in skirmish mode!<br/><br/><br/>STREAMLINED RTS DESIGNED FOR MOBILES!<br/>Fast paced gameplay with RTS and lane defense tactics without heavy resource management or the need to micro-manage units.  Set an initial course forward, then units will attack and capture on their way.<br/><br/>WEIGH ANCHOR!<br/>Command your fleet of pirate ships as you send them to intercept the enemy pirates or lay siege to land targets.  Send an armada of Brigantines or save your gold for a massive Ship of the Line!<br/><br/>CAPTURE!<br/>Towns, guard towers, shipyards, lighthouses, mystical obelisks, and more can all be captured.  Structures all have a unique purpose and will supply you with gold, attack your enemy, buff up you ships, allow you to launch more ships, etc.<br/><br/>UPGRADE!<br/>Upgrade towns to increase gold production.  Upgrade guard towers to increase their firepower and strengthen your defenses.<br/><br/>STRATEGY!<br/>Will you aggressively capture towns to loot their gold or invest in the towns you have to increase their gold production?  Wage a purely pirate ship battle or strengthen your defenses with upgraded guard towers?  Find the right RTS strategy to beat each level.<br/><br/>75 UNIQUE LEVELS IN FOUR WORLDS!<br/>Combat the enemy in the tropical Caribbean then follow them into Hades in the River Styx world.  And the Open Sea and Chaos Ocean worlds have the largest levels of all<br/><br/>ADJUSTABLE AI DIFFICULTY!<br/>Set the game to be as easy or as difficult as you want.  Set the AI to adjust to your skill or set it to play a completely even/fair match every time.  Pirates of all strategy skill levels should be satisfied<br/><br/>CONTROL TIME SPEED!<br/>At any time you can speed up or slow down time to play at your own pace.  Allow yourself more time to prepare your strategy or speed up your opponent's demise!<br/><br/>SKIRMISH MODES!<br/>Two skirmish modes provide an infinite number of randomly generated maps", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-02T07:19:34", "background_image": "https://media.rawg.io/media/screenshots/07a/07a480b831b9b066415c0f34229be3ad.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 331, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["FlashPoint Games"], "genres": ["Strategy"], "publishers": [], "esrb_rating": "Everyone 10+"}