{"id": 48265, "slug": "parallel-space-multiple-accounts-two-face", "name": "Parallel Space - Multiple accounts & Two face", "name_original": "Parallel Space - Multiple accounts & Two face", "description": "Clone and run multiple accounts of the same app simultaneously, and use themes to style your unique space.<br/> <br/>As one of the top-ranked tools on Android, Parallel Space helps more than 90 million users log on multiple accounts at the same time on one device and highlight their own style. It also protects user privacy by making apps invisible on device with the Incognito Installation feature. Moreover, users are able to customize themes of their cloned apps and the themes of Parallel Space to style their own space. Parallel Space supports 24 languages, and be compatible with most Android apps. Get Parallel Space immediately to manage multiple accounts, protect privacy, and customize your own space.<br/> <br/>★Log in to multiple accounts of social networking apps or game apps at the same time on one device<br/>• Balance between users' life and work easily.<br/>• Double users' online gaming experience and have more fun.<br/>• Almost all apps are supported for a second account in Parallel Space. Data from both accounts won't interfere with each other.<br/> <br/>★Protect user privacy, make apps invisible on device through Incognito Installation<br/>• Hide users' secret apps without worrying about prying eyes by keeping apps only in secret space.<br/>• Protect user privacy with a security lock.<br/> <br/>★Create a customized space by applying themes<br/>• A theme store is integrated into Parallel Space and a list of customized themes are ready for users to apply to style your own space.<br/>• To style a unique space by a customized theme. The user can switch fast the different themes by one-tap with their moods.<br/> <br/>★Switch fast between accounts with just one-tap<br/>• Run two accounts simultaneously and switch between them fast with one-tap to effective manage different accounts.<br/> <br/>Highlights:<br/>• Powerful, stable &amp; easy-to-use.<br/>• Unique: Parallel Space is based on multiDroid, the first application virtualization engine on Android.<br/> <br/>Notes:<br/>• Permissions: Parallel Space needs to apply for the permissions required by the apps added in Parallel Space to function normally. For example, if Parallel Space is not permitted to acquire your location, you will be unable to send your location to your friends in some apps that run in Parallel Space. Parallel Space does not collect your personal information to protect privacy.<br/>• Consumptions: Parallel Space itself doesn't take up too much memory, battery and data by which are actually consumed by the apps running inside. Details can be viewed in 'Storage' and 'Task Manager', which could be found in 'Settings' in Parallel Space.<br/>• Notifications: Please add Parallel Space to whitelist or exceptional list of some 'boost apps' to ensure that notification of some social networking apps functions well.<br/>• Conflict: You cannot run two accounts of some social networking apps by using a same mobile number. You should use a different mobile number to run your second account of those apps in Parallel Space and ensure that the mobile number is active during your first login because there will be a verification message sent to this number.<br/> <br/>For any urgent matters, please contact our official WhatsApp: +86 18201691197. Please note that hot line service is not supported at present.<br/> <br/>For any problems, please feel free to contact us via the 'Feedback' feature inside Parallel Space or send us an email at: lbedeveloper@gmail.com<br/> <br/>Follow us on FB for the latest news:<br/>https://www.facebook.com/parallelspaceapp<br/> <br/>Join us on Google+ Group:<br/>https://plus.google.com/u/0/communities/100090325501431514560", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:10:16", "background_image": "https://media.rawg.io/media/screenshots/e84/e84eea023cc969c5ab297088abd3d98f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 86, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["LBE Tech"], "genres": [], "publishers": [], "esrb_rating": null}