{"id": 482623, "slug": "staked", "name": "Staked", "name_original": "Staked", "description": "<p>As a prototype, the game features only two areas, while its full concept goes as described below. Currently, the prototype contains the Ottoman Court and the attack of Târgoviște. Development has mostly been a sole effort by myself, treating all disciplines such as design, environments, rigging/animation, mocap, lighting, camera, cutscenes, narrative and combat in a historically authentic manner as per my research in the thesis paper. Both the paper and project documentation can be provided upon request.</p>\n<p>Gameplay video: </p>\n\n<p><strong>Summary</strong>: Set in 15th century Eastern Europe (mostly Wallachia and Transylvania), the game portrays Vlad the Impaler during some of the most notable historical events during his life and reign. It aims to reconstruct the myth of Dracula through his own personal circumstances, as a devout ruler constantly struggling between defending European Christianity and his country from the Ottoman Empire, and trying to overcome his increasing predispositions which will eventually lead him to become what was then mythicized as the vampire Dracula.\r\n  </p>\n<p><strong>High concept:</strong> At its core, the goal of the game is managing Vlad the Impaler’s bloodlust and preventing him from becoming Dracula. Tone and themes are tense and have a dual nature. Somber and violent, befitting of Vlad’s infamous cruelty, put in contrast with his piety and patriotism.</p>\n<p><strong>Historical Narrative: </strong>The game is an 80-20 mix of authenticity-fantasy. Under the inherited banner of the Order of the Dragon, the player will be able to experience events during and between Vlad’s three reigns, such as:\r\n  </p>\n<ul><li>Being hostage to the Ottoman Empire\r\n  </li><li>His short reign in Wallachia and exile\r\n  </li><li>Second reign facilitated by Hungary\r\n  </li><li>The purge against the boyars involved in the murder of his family\r\n  </li><li>Conflict with the Saxons\r\n  </li><li>Ottoman war and the infamous night raid\r\n  </li><li>Imprisonment in Hungary\r\n  </li><li>Third rule in Wallachia and his death\r\n  </li></ul>\n<p><strong>Key Features:</strong>\n</p>\n<ul><li>Authentic medieval key locations\r\n  </li><li>Visceral combat using dual spears and long spear throwing mode\r\n  </li><li>Blood trance mode: when reaching 0HP, Vlad enters a timed vampiric state, gaining combat boosts, lifesteal, and combining the dual spears into a single, full one, enabling a new set of moves. </li><li>Blood marks: acquired when not able to lifesteal 50%HP during blood trance, gaining 3 of these sets the losing condition of the game and Vlad finally becoming Dracula.</li></ul>\n<p><strong>Credits:<br/></strong></p>\n<p>Tibi Neag - Character Artist for Vlad Țepeș</p>\n<p>Cole Morrow (Bold King Cole) - VA for Vlad Țepeș</p>\n<p>Colin Hussey - VA for Pope Nicolas V and the solider<br/></p>\n<p>Nick Senny - VA for Mehmed II, Murad II and Radu the Handsome</p><p>@cyclonebreitmayer (https://www.patreon.com/cyclonebreitmayer) - Composer for the Ottoman Court<br/></p>\n\n<p>All assets copyright of their respective authors.<br/></p>", "metacritic": null, "released": "2020-08-18", "tba": false, "updated": "2020-08-21T04:55:42", "background_image": "https://media.rawg.io/media/screenshots/56e/56e3416529a6e8140ebbd04dac79a52b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 316, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["RobertPhillipB"], "genres": ["Action", "Adventure"], "publishers": [], "esrb_rating": null}