{"id": 482729, "slug": "nocturne-prelude", "name": "Nocturne: Prelude", "name_original": "Nocturne: Prelude", "description": "<h3>Rich Narrative</h3><strong>The digital afterlife survived humanity's extinction.</strong><br/>Nocturne: Prelude is the first chapter of a story-driven RPG set within a digital afterlife. Millennia have passed since humanity's extinction; but somehow you've only just arrived.<br/>  <br/>Your conscience was uploaded to a world where a sentient AI has taken control, twisted creatures roam the land, and a vast corruption spreads.<br/><br/><h3>Rhythm Combat</h3>Master an entirely skill based rhythm combat with fierce battles and unexpected challenges. With multiple difficulty options, Nocturne: Prelude is a game suitable for beginners and veterans of the rhythm genre. <br/> <br/>   <br/>Find equipment to unlock powerful combat buffs or special abilities. Defeat enemies to unlock them in Arcade mode, where you can challenge them again for highscores.  <br/><br/><h3>Classic RPG</h3>Make friends, battle enemies, and traverse a beautiful world as it falls apart around you. The perfect balance of heart-pumping musical combat, magnificent worldbuilding and deep story.<br/>  <br/>Nocturne: Prelude was inspired by decades of traditional RPG's that immerse you in fantasy worlds.<br/><br/><br/><br/><strong>FEATURES</strong><br/><br/><ul><li>Meet a cast of unique characters who'll challenge what it means to be alive.<br/></li><li>Explore a vast and beautiful pixel art world.<br/></li><li>Master an entirely skill based rhythm combat system.<br/></li><li>Fierce battles with unexpected twists.<br/></li><li>Challenge your highscores in Arcade mode.<br/></li><li>Multiple difficulty modes suitable for beginners and veterans of the rhythm genre.<br/></li><li>Original soundtrack composed with a mix of digital and live performances.<br/></li><li>Befriend a giant orange fish.</li></ul><br/>Nocturne: Prelude is the first chapter of Nocturne, released for free. The main story contains about 1-2 hours of gameplay.", "metacritic": null, "released": "2020-03-03", "tba": false, "updated": "2020-08-27T21:01:34", "background_image": "https://media.rawg.io/media/screenshots/a42/a42e06f23d908d8d262447730a40f787.jpg", "website": "https://pracystudios.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 17, "ratings_count": 1, "suggestions_count": 252, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Pracy", "Pracy Studios"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Pracy Studios"], "esrb_rating": null}