{"id": 48282, "slug": "order-chaos-duels", "name": "Order & Chaos Duels", "name_original": "Order & Chaos Duels", "description": "<p>Rediscover the Order &amp; Chaos universe in this FREE collectible trading card game (TCG) that lets you battle with evil forces in many adventures or fight against real players for leaderboard supremacy.<br />\nThe ancient demonic spirit Zepar and his Corruption have returned to use the world as their twisted, wicked playground once again.<br />\nCreate your great hero, the Card Dueler, and embody the world’s only hope!<br />\n✔ Nearly 300 gorgeous cards to collect, with all the heroic fantasy art style of the Order &amp; Chaos games (MMORPG &amp; MOBA)<br />\n✔ Fast &amp; accessible duels on the go with spectacular special magic effects for the cards<br />\n✔ Deep content &amp; strategy with the game mechanics of a traditional trading card game (TCG)<br />\n✔ Epic live and asynchronous online multiplayer games<br />\n✔ Quests &amp; adventures to fight against evil and free the world of Haradon<br />\n✔ Optimize your deck for battle in solo &amp; online multiplayer PvP modes<br />\nOrder &amp; Chaos Duels is a free trading card game (TCG) in a magical fantasy universe that features online mulitplayer battles (PvP). This free multiplayer TCG game will allow you to manage your deck, battle with your deck, play games online and more.<br />\nDownload now for free and get on board for many exciting multiplayer games (PvP).</p>\n<hr />\n<p>Visit our official site at http://www.gameloft.com<br />\nFollow us on Twitter at http://glft.co/GameloftonTwitter or like us on Facebook at http://facebook.com/Gameloft to get more info about all our upcoming titles.<br />\nCheck out our videos and game trailers on http://www.youtube.com/Gameloft<br />\nDiscover our blog at http://glft.co/Gameloft_Official_Blog for the inside scoop on everything Gameloft.<br />\nCertain apps allow you to purchase virtual items within the app and may contain third party advertisements that may redirect you to a third party site.<br />\nPrivacy Policy : http://www.gameloft.com/privacy-notice/<br />\nTerms of Use : http://www.gameloft.com/conditions/<br />\nEnd User License Agreement : http://www.gameloft.com/eula/<br />\n&quot;</p>", "metacritic": null, "released": null, "tba": false, "updated": "2022-11-03T18:23:56", "background_image": "https://media.rawg.io/media/screenshots/5dc/5dc13b83a96dc07c5d6cdcdfbb115f48.jpg", "website": "", "rating": 0.0, "rating_top": 3, "added_by_status": {"owned": 1, "dropped": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 5, "suggestions_count": 279, "game_series_count": 0, "reviews_count": 5, "platforms": ["Android"], "developers": ["Gameloft"], "genres": ["Card"], "publishers": [], "esrb_rating": null}