{"id": 482832, "slug": "diktatura-2", "name": "DIKTATURA", "name_original": "DIKTATURA", "description": "<p><em>What you are about to experience, is based on the testimonies of individuals who lived during the Albanian dictatorship, whose voices you will encounter throughout the game.</em></p>\n<p><em>You, however, are entirely fictional.</em></p>\r\n\r\nINTRODUCTION\r\n<p>The player-character begins the day inside the office of the Secretary of the Party for the fictional Neighbourhood 31, populated by five individuals who experienced the Albanian dictatorship. During the timeframe of the game, Albania is isolated from the rest of the world and the Party controls everything, even what people think. Currently, to cover a shortage in food, the Party is forcing the belief that eating fish with cheese is poisonous. Citizens, however, are convinced they live in the happiest country in the world. </p>\n<p>The player witnesses the work of the Secretary from his point of view as he oversees his neighbours, with separate vignettes when he profiles each character. His ultimate goal is to produce a file for each neighbour. <br/></p>\r\nPROTOTYPE DESCRIPTION\r\n<p>In this short demo, you will get a glimpse of how the narrative of Diktatura unfolds. You will first enter the office of the Secretary, while the testimony of Shemo will take you to an Albanian communist home. Once inside, Shemo's real photographs, together with footage from the dictatorship, fill the computer generated house. There, the voiceover of Shemo will guide you around, as you learn about his life in the dictatorship, while at the same time, trying to make an antenna to capture Italian radiowaves. </p>\r\n\r\nHOW TO PLAY\r\n<p>Here's a very short guide if you get stuck:</p>\n<p>1. Teleport to move</p>\n<p>2. Pick up objects</p>\n<p>3. Make the antenna </p>\r\nNEXT STEPS\r\n<p>We are going to test the demo with a variety of players, especially focusing on the user experience and how players connect with the story. Simultaneously, we will develop the story of Liliana, the war nurse, which will take players inside a Test of Alertness, a war scene against an invisible enemy; and the story of Ermal, the boy with a stained biography, which will take place in the emulation corner of the neighborhood. Initially we were going to add one more story, but we estimated that the experience would exceed 20 minutes, which we believe would not be suitable for a festival context. <br/></p>\n<p>After profiling each neighbour, the Secretary writes a summary of the character in each file, which embody the values of the Party thoroughly. However, as the day finishes, the player follows the Secretary back to his house, only to find out that he has built an antenna himself. In the end, the Secretary goes to the window where he is left with the dilemma of whether to profile the next door neighbour whose antenna he spots, or listen to music himself. </p>\n<p>The end credits will play an important role in objectively shedding light on the Albanian dictatorship and  the individuals who players will meet in the game.</p>\r\nCHANGES\r\n<p>- The design of the scenes will improve and be updated until the end, and they will be rich with visuals and real footage, aiming to invoke a sense of exploration. </p>\n<p>- The Character Designer will create hands for each character, which will help in the world-building of the experience. </p>\n<p>- We are considering recording actors, and bringing the voices and the videos of the real characters in the end credits.  </p>\r\nSTATUS OF THE PROJECT\r\n<p>Our aim is to develop Diktatura into a feature length docu-game, and are now working on a 20 minutes version of it, which we hope to show during IDFA DocLab. This would be a great opportunity to meet our audience for the first time, and bring them to the heart of our production process. </p>\r\n\r\nCOMMUNITY\r\n<p>The main focus has always been to bring the audience inside the story of the Albanian dictatorship. In a simple narrative read-through test we conducted during Games for Change Festival in July, a player imagined Volunteer Musician to be a musician that was caught, but then decided to volunteer and spy on others to avoid going to prison. This showed that Diktatura is not a story we are telling , but a story we are sharing with our audience. We aim to encourage our players to create their theories and understandings during IDFA DocLab. Thus, by participating in the world-building of he game elements of the project, they will grasp the dystopian yet non-fictious world of the Albanian dictatorship. </p>", "metacritic": null, "released": "2020-08-17", "tba": false, "updated": "2020-08-21T05:38:59", "background_image": "https://media.rawg.io/media/screenshots/884/8846415a555d0c3b4b4f45cf333053b0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 195, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Sindi Breshani", "Juliette"], "genres": [], "publishers": [], "esrb_rating": null}