{"id": 482927, "slug": "dungeon-dogs-idle-hero-rpg", "name": "Dungeon Dogs - Idle Hero RPG", "name_original": "Dungeon Dogs - Idle Hero RPG", "description": "From the makers of award-winning Castle Cats, Dungeon Dogs is an idle RPG that allows you to battle, build, collect and craft all from the comfort of your mobile device.<br/><br/>Join our rebels Lyra, Ken and Poppy on their adventures in Lupinia to take down the evil cat king, who is suppressing the canine population and treating them as second-class citizens.<br/><br/>Dungeon Dogs is the perfect pick up and play game with tried and trusted gameplay mechanics and beautiful artwork that will capture the hearts of gamers young and old.<br/><br/>Set your rebels to battle foes whilst you are busy and collect your loot later or join the fight against oppression in real time, the choice is yours!<br/><br/>Features:<br/>IDLE AND ACTION GAMEPLAY SYSTEM<br/>Set your heroes to battle if you are busy and collect the rewards on your return to upgrade your heroes with Dungeon Dogs’ crafting system and collect new, epic doggos, each with their own individual skillset and characteristics.<br/>Alternatively, join battles whenever you want to help your heroes out!<br/><br/>COLLECTING AND CUSTOMISATION<br/><br/>With over 45 different dog heroes to collect from launch there is plenty of options to choose from. Set your heroes to battle and evolve to unlock new skills, characteristics and outfits to make each hero original. You can also collect over 100 different items for your guild leader and customise to your liking.<br/><br/>FRESH AND ORIGINAL NARRATIVE<br/><br/>Dungeon Dogs’ standalone narrative fits perfectly into the Castle Cats Universe in a pawsome, pun filled storyline that will engage and captivate newcomers, as well as veterans of PocApp’s Idle RPG games.<br/><br/>LIKE THE CHARACTERS, THE GAME WILL KEEP EVOLVING<br/><br/>Packed with 85+ quests from launch, Dungeon Dogs does not stop there! Dungeon Dogs is an ever-evolving game where regular event updates will be added to the game, creating longevity. Whether it is a spring, summer, fall, holiday or even a special celebrity event, you will want to keep coming back for more. Extra heroes will also be added at regular intervals with special guest heroes making an appearance to help you expand your collection.<br/><br/>FULL COMMUNITY SUPPORT<br/><br/>We are always listening, and we want to include you as much as possible. Dungeon Dogs related competitions, fan art features and more are fully supported by PocApp Studios through our social media channels and Discord server. You never know, your idea may even make it into the game! How cool is that?<br/>Get those paws ready and download now! It’s pawsome!<br/><br/>For more information, please visit:<br/><br/>www.dungeondogsgame.com<br/><br/>FOLLOW US ON SOCIAL MEDIA:<br/><br/>Facebook:   \thttps://www.facebook.com/dungeondogs/<br/>Twitter:\t\thttps://twitter.com/Dungeon_Dogs<br/>Instagram:\thttps://www.instagram.com/dungeondogs/<br/>Discord:\thttps://discordapp.com/invite/BhyYTTZ<br/>We love feedback so please feel free to write to us at contact[at]pocappstudios.com<br/>_____<br/>Subscription Double Gold-XP Boost - Weekly<br/>1. Doubles the amount of Base Gold and Base XP gained from Quests.<br/>$0.99 weekly (may vary by location)<br/>______<br/>Price may vary by location.<br/>Payment will be charged to iTunes Account at confirmation of purchase.<br/>Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period.<br/>Account will be charged for renewal within 24-hours prior to the end of the current period, and identify the cost of the renewal.<br/>Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's Account Settings after purchase.<br/>Any unused portion of a free trial, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable.<br/>_______<br/>Oh wait! Last but not least, the boring stuff …..<br/>Privacy Policy: \t\t\thttps://www.pocappstudios.com/privacy-policy<br/>Terms Of Service and EULA: \thttps://www.pocappstudios.com/terms-of-service", "metacritic": null, "released": "2020-08-19", "tba": false, "updated": "2020-08-24T02:24:28", "background_image": "https://media.rawg.io/media/screenshots/09a/09a9fbd13ba071413f5d6ada7fc27cd0_23ao6XB.jpg", "website": "https://www.pocappstudios.com/pressdungeondogs", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 242, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["PocApp Studios"], "genres": ["Adventure", "RPG"], "publishers": ["PocApp Studios"], "esrb_rating": "Everyone 10+"}