{"id": 482934, "slug": "merge-meadow-collection-game", "name": "Merge Meadow: Collection Game", "name_original": "Merge Meadow: Collection Game", "description": "Merge cute animals to discover new ones! <br/>Explore different worlds, each with unique animals, creatures, and mythical beasts. There are hundreds to discover - start building your collection!<br/>- Day Meadow has woodland critters from around the world<br/>- Night Meadow is full of mythical &amp; magic creatures<br/>- Sea Meadow features all sorts of aquatic critters<br/>- Dino Meadow brings cute prehistoric beasts to life<br/>- Pets Meadow with the cutest house pets you've ever seen!<br/>- Special Event Meadows offer unique dressed up critters for a limited time! See if you can collect them all.<br/><br/><br/>To play, tap to open bundles to get animals, then merge animals to discover new animals! Each animal earns hearts which you can use in the shop to buy higher level animals for faster merging.<br/>- Explore unique worlds full of adorable and magical animals!<br/>- Earn hearts to speed up merging<br/>- Collect hats &amp; accessories to dress up your collection<br/>- Frequent events<br/>- Catch butterflies to get a frenzy bonus<br/>- Use boosts to get even more hearts<br/>- Join the quest to find the Ultimate Animal!<br/><br/><br/>We want Merge Meadow to be your favorite merge game, and something that you love to play every day. We love to make games, and we try to evolve the games we make to get more fun and engaging over time. We are always working hard to make this happen - keep an eye open for updates and new features!", "metacritic": null, "released": "2018-08-09", "tba": false, "updated": "2020-08-24T02:26:45", "background_image": "https://media.rawg.io/media/screenshots/11a/11aac4f6695333e88ae31a60b94dbc6a_003Bug8.jpg", "website": "https://mergemeadow.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 108, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Extra Dimension Games"], "genres": ["Simulation", "Casual"], "publishers": ["Extra Dimension Games"], "esrb_rating": "Everyone 10+"}