{"id": 48310, "slug": "neo-wars-space-conquest-rts", "name": "Neo Wars Space Conquest RTS", "name_original": "Neo Wars Space Conquest RTS", "description": "Neo Wars is a sci-fi node-based RTS with deep strategic and tactical gameplay.<br/><br/>Fight with up to 3 enemy AI players for the last remaining robot harvester on a planet battlefield. Develop a variety of war strategies; be smart and quick to achieve a glorious victory on the battlefield.<br/><br/>Use powerful upgrades, buffs and de-buffs on your robot harvesters and your strategic thinking to gain the edge over your enemies. <br/><br/>Conquer countless galaxies and star systems to become the most powerful space war general to dominate your enemies.<br/><br/>Unique “Free2Paid” model! Watch videos or buy IAPs to unlock \"IAP free\" mode without IAPs and Ads.<br/>__________________________________<br/><br/>• Enjoy a beautiful sci-fi minimalistic low-poly art in vibrant colors<br/>• Strategic and tactical RTS gameplay on half a dozen environments<br/>• Campaign with countless star systems, 50 planetary battlefields, each planet requires different war tactics<br/>• Up to 5 difficulties per planet battlefield – easy to insane<br/>• Upgrade your robot harvester with 40 buffs in 5 rarities let you adjust your war strategy<br/>• Fight against an advanced RTS enemy AI with up to 3 opponents on the battlefield<br/>• Unique “Free2Paid” model -&gt; watch videos or buy IAPs to unlock free mode<br/>• Awesome and atmospheric 8-layer interactive music score<br/>• Battery save mode<br/>• Offline strategy: No internet connection required to play<br/>• Google Play savegames across devices, leaderboards and achievements<br/><br/>Join the conquest for resources now for free in this space war strategy game!<br/>__________________________________<br/>Join our community<br/>https://neowars.net<br/>https://twitter.com/microtalegames<br/>https://facebook.com/microtale<br/><br/><br/>Need help for the right strategy or want to give feedback:<br/>game@neowars.net<br/>___________________________________<br/>Privacy Policy: http://neowars.net/?page_id=477", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:10:13", "background_image": "https://media.rawg.io/media/screenshots/23c/23c08b2d5aece8237662af939973dc84.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 277, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Microtale"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}