{"id": 483332, "slug": "it-takes-3-to-play-chess", "name": "It takes 3 to play chess", "name_original": "It takes 3 to play chess", "description": "<p>#Controls:</p>\n<ul><li>right-click and drag the mouse to look</li><li>right-click and scroll to zoom</li><li>M to open menu (I learned my lesson to never put the menu on esc, you guys are welcome btw)</li><li>left-click a tile with your piece to select it. We play by tournament rules, so there is no deselect. You move what you touch.</li><li>left-click a tile to move your piece onto. Tiles with your own pieces are invalid!</li><li>press space to toggle between normal view and top down view</li></ul>\n<p>#Rules:</p>\n<ul><li>Standard chess rules apply. They where bent where necessary.</li><li>Fancy moves aren't supported. Forget about \"en passe\" and \"castling\" (If you are wondering what that is you are lucky enough to not notice any difference)</li><li>Players play in clockwise order. </li><li>You loose when your king dies. You win when the other kings die.</li><li>There is no check mate, no draw, no timeout, only death</li><li>The middle is a little funky, but you will figure it out on your own.</li></ul>\n<p>#Artificial \"Intelligence\"</p>\n<ul><li>Have you ever played chess with a five year old? Well lucky you! Today you will be playing against a polite three year old!</li><li>If you are not interested in this type of hell you better pick out two friends or surgically split your brain in three. Ether one is better than what you will endure if you continue.</li><li>To activate the AI just open the menu in game and check the \"AI BROKEN\" box. This is it. Enjoy what you chose.</li><li>Let me explain what the AI can and can't. It is a three year old, but it is a polite three year old.</li><li>The AI will wait for its turn. (You are the red guy btw, I picked you don't get a say in it although it would be very easy to implement)</li><li>The AI doesn't know how the pieces are supposed to move or what it's supposed to do, so it dose the next best thing, it picks a random valid field and just moves. What is that a rook? Don't mind if I place it on your king! I don't care that this is not how rooks move, I won by accident.</li><li>If you have any bright Ideas on how to map this hyperbolic chessboard onto a normal one (or one with euclidean coordinates), feel free to tell me, cause I don't know how to do that without manually writing all possible moves for all possible pieces on all possible fields. (I have neither the time nor the patience to do that)</li></ul>\n<p>Made for the Miz Jam 1 using provided art asset.<br/>https://kenney.nl/assets/bit-pack<br/></p>\n<p>Music is a snipped from Bach BWV 543 - Prelude and Fugue in A minor, which was rendered with Fruit Loops.<br/>All other sound effects where made during the jam.<br/></p>\n\n<p>Some thoughts and remarks:</p>\n<ul><li>I usually don't work with sprites and Tile sheets. That one was a first for me. I probably made many mistakes and inelegant solutions, but it is what it is.</li><li>To make a passable AI would be rather simple. The problem for this game was the unusual board, which made it difficult to apply the usual grid approach. Reading some Wiki articles on hyperbolic space and hyperbolic coordinates (off the clock) didn't really help. If only there was a simple way to determine the valid moves... everything else could be done in minutes, but sadly I am already out of time anyway.</li><li>I feel like the sound on the webgl build is worse than on my original build. I don't know if it is just me.</li><li>The default color scheme is really cool. I will be using some dark purple and other dark colors more often.</li><li>When will I learn to stop doing too ambitious things? Probably never, but I will try to make a super simple, straight forward game for my next jam.</li><li>Dose anyone actually care about the source code? It's a mess and it will be a mess to upload to github. I would rather not.</li><li>Btw what is up with Miziziziz? Are you guys trying to beat the polish record for most useless Z's in a word?</li></ul>", "metacritic": null, "released": "2020-08-23", "tba": false, "updated": "2020-08-24T03:54:03", "background_image": "https://media.rawg.io/media/screenshots/e8e/e8e73a15125fc5ce7c8ae0383812d67f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 91, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["Voidsay"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}