{"id": 483316, "slug": "familiar-unfamiliar", "name": "Familiar Unfamiliar", "name_original": "Familiar Unfamiliar", "description": "<p>Familiar Unfamiliar is both a ritual and a game. It's a journaling game that asks you to imagine the moment you meet a powerful alien entity with the power to help keep your community alive. </p>\n<p>The mechanics are drawn from divination rituals (and can be used as one, if you would like to try!) If this makes you uncomfortable, there are alternative mechanics available, but this might not be the right game for you. That's okay.</p>\n<p><strong>The Witch Engines of IRIS-7</strong></p>\n<p>Deep in space, the Symbiotic Community Ship IRIS-7 glides along on currents invisible to its human occupants, past stars and planets long-dead astronomers of the past never dreamed of. It has no real destination, but it has a mission – to protect and nurture its precious cargo, a community of humans left orphaned when their ancient homeworld became uninhabitable. Some day, IRIS-7 might find another world for its dear community to thrive on, but until then, the ship is their beloved home. It carries lush environments - samples of Terran plants and animals, to try and preserve the harmony of life on a planet that has forgotten what it means to be alive.<br/>You are one of its key components – a Witch Engine. At least, you will be. <br/>You will be at once engineer, mechanic, high priest, and pilot, and the people of IRIS-7 will rely on you – as soon as you find your own Familiar.<br/>IRIS-7 is not self-propelled. It is moved through space, and alongside the weave of time, by extraterrestrial sprites called Familiars. While everyday humans can see Familiars, it takes training and study to be able to communicate with them. Certain specialists train, cultivate themselves to achieve emotional harmony with Familiars – these Witches can then use the harmonic energy of the Familiars to operate stellar transports. The IRIS-7 has a small Coven of Witch Engines ensuring its safe and harmonious operation as it drifts. They keep the life support systems running. They keep the ship moving. <br/>In short, Witch Engines and their Familiars keep the people of IRIS-7 alive.<br/>IRIS-7 needs you. It needs your joy, your calm, your passion, and your intuition, and it needs you to find your Familiar. </p>", "metacritic": null, "released": "2020-08-23", "tba": false, "updated": "2020-08-24T03:49:53", "background_image": "https://media.rawg.io/media/screenshots/1d9/1d9c40294d0241d623dfad5ad047b39a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 48, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Peach Garden Games"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}