{"id": 483404, "slug": "stellar-king", "name": "Stellar King", "name_original": "Stellar King", "description": "<p><strong><em>edit: I also included a html version now, as most others did and it's much more convenient. It's not optimized for this though, music glitches while loading when starting the game. if you are unsure please check out the .exe version, that should run better. (html version is also outside the 42 hours, but the game is the same of course)</em></strong><br/></p>\n<p>Made for Miz Jam 1<br/>This was a 2 person project.</p>\n<p>\n</p>\n\n<p>Stellar King is a strategy/simulation Space game, but you are a medieval king! Manage your servants and alien emissaries. Colonize planets, let your population grow to the highest numbers, gain prestige to be remembered for ever!</p>\n\n<p>Originally, the idea was to make a fantasy game where you have to manage your court as the king. My wife wanted to go more into the space direction, so we did both! I was listening to space-synth music which then led to the final aesthetic style.</p>\n<p>I had way to little time for actual playtesting. I wanted to include more sound effects, the balance is horrible and many calculations probably not how I imagined them. And be sure there will be bugs. I had more NPCs planned and they all should have been more unique. Unfortunately, the Queen is pretty useles right now. And allthought it should have been a major mechanic, there aren't any negative consequenzes for letting relations go low. I couldn't do that in time, at the end I prioritized a Start Menu / End Screen and the tutorial. Obviously all done in a hurry, but I hope the game is playable right now, let me know! :)</p>\n<p>Besides that, I'm really happy with the game. It's only my second Game Jam after one in late 2018. And it's amazing to see how much I have improved myself. That gives me hope for the future. :D</p>\n<p>I noted times I worked on the game, unforunately not too precisely. Until last friday I did not expect to reach the 42 hours at all, because I usually don't have much time after my day at work. Times were always rounded up though. My wife worked at the same time with me, though not as much (She did the ship, the music (using AIVA), the text logo and the coloring/separating of many assets)</p>\n<p>16.08.20 = 12:00 - 20:00 (8) (sunday)</p>\n<p>17.08.20 = 17:00-21:00 (4)</p>\n<p>18.08.20 = 17:00-21:00 (4)<br/></p>\n<p>19.08.20 = 18:00-00:00 (6)</p>\n<p>20.08.20 = 12:00-23:00 (11) (day off work)</p>\n<p>21.08.20 = 20:00-00:00 (4)<br/></p>\n<p>22.08.20 = 00:00-01:00 (1.5)</p>\n<p>23:08.20 = 12:00-16:00 (3,5) (sunday)</p>\n<p>A huge thanks to Miziziziz for hosting this Jam and especially for the way it's organized. I can completly participate even with a full time job! That's amazing!</p>\n<p><strong>Controls:</strong></p>\n<p>W,A,S,D and Mouse</p>", "metacritic": null, "released": "2020-08-23", "tba": false, "updated": "2020-08-24T04:08:48", "background_image": "https://media.rawg.io/media/screenshots/f49/f490898a459fe56e26f386aecc9e9c08.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 49, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["GapaGames"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}