{"id": 483439, "slug": "find-a-friend-2", "name": "Find A Friend", "name_original": "Find A Friend", "description": "A simple puzzle game involving making many cute pet friends!\r\nMade for the Godot Wild Jam #24.\r\nThank you for playing!\r\n<br/>How to play:\r\n<p>There are 6 species of animals - dogs, cats, rabbits, chickens, pigs and mice. You start with two different colored animals of a given species. Each animals has its own set of statistics - cuteness, smartness, friendliness and elegance.</p>\n<p>You can get new animals in two ways:</p>\n<ul><li>mating - select two animals of the same species to mate them resulting in a new animal of the same species, with a combination of parents' colors and statistics,</li><li>searching for a friend - you send your animal to search for a new one - its species is determined by the sent animal's statistics (different animals like different things), while its color and statistics might be random.</li></ul>\n<p>The goal is to get an animal with the indicated species and color combination.</p>\n<p>Notes:</p>\n<ul><li>found animals always have a basic color (default red, green, blue or white)</li><li>you can only get complex colors by mating (default yellow, purple, dark aqua, black)</li><li>child's coloring can be any combination of parents' basic colors - for example purple parent (basic colors red and blue) + green parent (basic color green) can result in a child of any of those colors: red, green, blue, purple, yellow, dark aqua, black.</li><li>white is a special color, it will not provide any meaningful color variation to the child: for example white parent + yellow parent (basic colors red, green) can only result in white, red, green or yellow child.</li></ul>\n\r\nControls:\r\n<ul><li>Move camera: W, A, S, D or click middle mouse button and move your mouse</li><li>Animal interaction: Left click to select for mating, right click to send on a search, middle click to pet.</li></ul>", "metacritic": null, "released": "2020-08-23", "tba": false, "updated": "2020-08-24T04:15:07", "background_image": "https://media.rawg.io/media/screenshots/bf4/bf48835ca000647a4b8c565d9c215a91.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["pulawskig"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}