{"id": 483497, "slug": "get-ogre-it", "name": "Get Ogre It", "name_original": "Get Ogre It", "description": "Get Ogre It is a roguelike dungeon crawler. Shapeshift between ogre and human, escape ever-changing dungeons, deceive and hide from your enemies. Can you reach the exit?. Watch your steps, transform, and die a lot.<br/><br/>Play as Gobby, a little ogre who's been cursed and turned into a human. But the curse isn't working perfectly and Gobby keeps transforming between ogre and human every 8 moves.<h3>Wishlist our upcoming game:</h3>https://store.steampowered.com/app/2150910/Nekomancer_Auto_Card_Tactics/<br/><br/><br/><br/>Gobby can't fight back! you have to take advantage of the curse in your favor to slip away from humans or ogres depending on your colours. Remember <strong>every 8 moves you will transform back again!</strong><br/><br/><br/><br/><br/><br/><br/>Enemies do not sleep and their task is to hunt Gobby down. Meet several different characters from each faction, every of them with different combat abilities. Some are faster than others and Some are stronger than others. Observe, fail, learn their moves and use your curse against them.<br/><br/><br/><br/><br/><br/>Everytime you start playing the dungeon will be procedurally generated, your memory won't help!<br/><br/><br/><br/><h3>Time moves as you move</h3>Think before you move because your enemies will chase you after that, move slowly and strategize your next moves or go fast and reckless as you like!<br/><br/><br/>Ogres were not harmed in the making of this game<br/><br/><br/>", "metacritic": null, "released": "2020-08-23", "tba": false, "updated": "2023-11-06T16:22:16", "background_image": "https://media.rawg.io/media/screenshots/29e/29e1c3da70334942ca740d1140b626ad.jpg", "website": "https://getogreit.croixapps.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 39, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Johan Plasencia", "Chandie", "Nintai Studios"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["Nintai Studios"], "esrb_rating": null}