{"id": 4835, "slug": "nova", "name": "N.O.V.A.", "name_original": "N.O.V.A.", "description": "<p>With Earth no longer able to sustain life, huge artificial satellites called “near-orbitals” were constructed for people to live on. To protect themselves, the near-orbitals banded together to form N.O.V.A., the Near Orbit Vanguard Alliance. Now, a strange threat has emerged from the darkness of space. A Marine ship, reported missing just a week ago, has suddenly reappeared and is headed directly for the near-orbitals, ignoring all communications. Against his will, retired Marine hero Kal Wardin is forcefully returned to active duty to prevent mankind&#39;s annihilation.</p>\n<p>Get ready for unparalleled action on the iPad!</p>\n<p>iPAD OPTIMIZED CONTROLS<br />\n- Curve your grenade’s trajectory with the new 2-finger-based throwing move<br />\n- Perform multiple surgical kills at once with multi-target acquisition<br />\n- More intuitive than ever, thanks to numerous multi-touch controls on-screen</p>\n<p>EPIC SINGLE-PLAYER CAMPAIGN<br />\n- 13 insane levels<br />\n- 5 environments, from the real to the fantastic: Jungle, snow mountains, spaceship, bunker, and an alien city<br />\n- 6 weapons: Assault rifle, shotgun, sniper rifle, handgun, rocket launcher, and plasma gun – plus grenades &amp; machine gun turrets on certain levels</p>\n<p>FRANTIC MULTIPLAYER MODE<br />\n- 1-4 player Deathmatch locally or online on 5 different maps<br />\n- Play against your friends or the entire world through Gameloft LIVE!<br />\n- Worldwide leaderboards in the game &amp; on the official website, www.near-orbit-vanguard-alliance.com</p>\n<p>A TECHNOLOGICAL LEAP<br />\n- Full 3D rendered environments enhanced by highly detailed graphics<br />\n- 3 basic control schemes, plus a fully customizable interface<br />\n- An intense drama enhanced by cinematics and character voices</p>\n<p>Join the fight for mankind&#39;s survival against the aggressive aliens known as Judgers in this immersive space opera.</p>", "metacritic": 94, "released": "2009-12-17", "tba": false, "updated": "2022-12-19T11:06:27", "background_image": "https://media.rawg.io/media/screenshots/a00/a009c9b997470dd1d5cb74127107af21.jpg", "website": "", "rating": 4.36, "rating_top": 5, "added_by_status": {"owned": 9, "beaten": 9, "toplay": 4, "dropped": 4}, "playtime": 0, "achievements_count": 0, "ratings_count": 11, "suggestions_count": 127, "game_series_count": 1, "reviews_count": 11, "platforms": ["Android", "PlayStation 3", "iOS", "PSP"], "developers": ["Gameloft"], "genres": ["Action", "Shooter"], "publishers": ["Gameloft"], "esrb_rating": "Teen"}