{"id": 483707, "slug": "haunted-highway", "name": "Haunted Highway", "name_original": "Haunted Highway", "description": "<p>Haunted Highway</p>\n<p>Developed entirely by Michael Rosenberg<br/>Developed for the Kenney Jam 2020<br/>All art and visual assets made by Kenney.nl<br/>Game development began 8/22/2020 @ 12:43pm<br/>Game development on Jam Build finished 8/23/2020 @ 2:12am<br/>No audio included in Game Jam build</p>\n<p>Game Plot (will be included in post jam version):<br/>We've all heard of haunted roads. Many towns throughout America have them. Ghosts will appear in the road. Lights off in the distance. Some phantoms might even chase you.  If they catch you, you never know what might happen.<br/>Unfortunately the only way to get to where you need to be is via the haunted highway. </p>\n<p>Lot's of people come here to find haunted experiences of their own. Make sure not to hurt innocent townsfolk! Or they might just add to the spirits haunting the roads.<br/>Townsfolk, ghosts, ghost trucks, oilspils and fires. Try to avoid everything the haunted highway throws at you to make it to tomorrow.</p>\n<p>Controls: <br/>Main Menu - W/S or Up/Down to navigate menu. Escape to leave credits or close the game. Enter or space to select<br/>Game - W/A/S/D to drive your car - R to restart - Escape to close game</p>\n<p>Bugs: <br/>I was definitely not able to catch all the bugs in this, though I hope I caught and fixed most game breaking bugs. Please feel free to report any and all bugs you find so that I may fix them. The game also needs balancing. Most likely an increase in spawn rates but I left them for now.</p><p>Source Code:</p><p>I will be uploading the source code - but as I expect to make more changes I will be waiting until I consider the code completed and cleaned before sharing :)</p>", "metacritic": null, "released": "2020-08-23", "tba": false, "updated": "2020-08-24T05:11:36", "background_image": "https://media.rawg.io/media/screenshots/e26/e269032eab94c32cac9adb375bc7a9bc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 33, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["miker525"], "genres": [], "publishers": [], "esrb_rating": null}