{"id": 483710, "slug": "curse-swords", "name": "Curse Swords", "name_original": "Curse Swords", "description": "Curse Swords\r\n<p>Here you are, minding your own freaking business in your bad-a ... hem, dungeon, when your baddie buddies tell you that there's a bunch of goodie two-shoes adventurers coming to steal your gold! Good thing you know a curse or two you can throw at them. </p>\n<p>Type the words above the heads of the goodies to attack them.  You can also supercharge your attacks by powering up one of your baddies in the Monster Pen with the word above their head, then follow it up with an attack on a good guy. They will sometimes drop gold of their own, or even a Curse Sword, which can be picked up to string together a powerful Curse that will destroy everyone in your dungeon when it's typed.</p>\n<p>Warning: contains PG-13 language which may not be suitable for young children.</p>\n\r\nInstructions\r\n<p>Curse Swords is a typing game with three main components: Goodies, Baddies, and Swords.</p>\n<p>The Goodies come down the screen to take your treasure, and have a word showing above their head. Some move fast and can be killed easily, while others are slow moving and may take multiple attacks to be killed (although they are stunned briefly after a successful attack). The strongest will take three hits to destroy, but you can hasten this with Baddie attacks.</p>\n<p>Your Baddies hang out in the Monster Pen at the bottom of the screen, and you'll see one at the ready with a word above their head, just like the Goodies have. When you type this word, instead of being killed, the Baddie is activated and if you make a successful attack without any mistakes, it will kill any enemy outright. A useful strategy is to take advantage of a lull between attacks to load up a Baddie for the next one to come down.</p>\n<p>Swords will randomly drop after successfully killing a Goodie, and can be collected by typing the word above it (but hurry, they disappear quickly).   Successive kills without typos add to your Streak, which increases the chance of dropping a Sword.  Each collected sword builds towards a chained \"Curse Sword\" attack. You can see the progress on your Curse in the lower right corner of the screen, with a word lighting up each time you collect a sword. Once you have completed all of the words, the text will turn yellow to indicate it's ready to use. Typing the full phrase without mistakes will cast a curse that destroys every Goodie on the screen! </p>\n<p>If you let any Goodies get too far, they'll steal your treasure, leaving behind open chests. Once all of your chests are gone, it’s Game Over, so guard them carefully! Goodies will sometimes drop coins which can be picked up (by typing the word) to fill your treasure back up, and even accumulate some profit.</p>", "metacritic": null, "released": "2020-08-23", "tba": false, "updated": "2020-08-24T05:12:07", "background_image": "https://media.rawg.io/media/screenshots/9d6/9d6e1b699fe5d57cbb451f49c77fcbc5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 71, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["SlightlyMadman", "mikefictitious"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}