{"id": 483789, "slug": "treasure-cave-pato-ingeniero", "name": "Treasure Cave (Pato Ingeniero)", "name_original": "Treasure Cave (Pato Ingeniero)", "description": "Life in the village is soooo boring... let's go. Join me on this adventure and I promise we'll find some awesome treasures on the way!\r\n\r\nHow To Play\r\n<p><strong>Play with WASD or arrow keys. Once you move you have to wait until you hit a wall to move again.</strong></p>\n\n<ul><li>Try to get as much coins and diamonds as you can! Post your record on the comments!</li><li>Complete the 10 levels to have a big reward :)</li><li>If you get stuck on a level due to a bug, use the Restart Level button on the top right of the screen</li></ul>\n\n<p>---------------------------------------------------------------------------</p>\r\nComments from Developer:\r\n<p>This was my first Game Jam experience, this game was done in under 48 hours of development. This was also my first experience creating a game with Godot, I just started learning it 3 months ago. I do have game development experience creating Flash games but last one I created was more than 6 years ago. I've been mainly focused on other types of software development (mobile apps and web). Since I graduated as a software engineer last year I have more time now and very recently I decided to come back to the Game Development world as a hobbie, and here I am :) </p>\n<p>During the week this game jam lasted I worked full-time on my day job and I worked hard on this game at night so it was a VERY exhausting week for me. I didn't do anything else other than work the hole week really to get done as much as I could for this game. But I think it was worth it. All in all I'm very proud of the results :)</p>\n<p>During the development process I kept a Dev Log on a Google Docs that you can access here (but please play the game first since it contains spoilers!): Google Docs</p>\n<p>Special Thanks to my girlfriend Vero that supported me the hole week, and to my brother Guille that created the music and sound effects for the game.</p>\n<p>If you loved the music and sounds consider hiring him for your next project ;) Guillermo Dorfman - guillermodorfman@gmail.com</p>\n<br/>I hope you enjoy the game as much as I enjoyed creating it. If you do please leave a comment bellow :)", "metacritic": null, "released": "2020-08-23", "tba": false, "updated": "2020-08-24T05:26:56", "background_image": "https://media.rawg.io/media/screenshots/79b/79bda7a445bbc463cc405323e42f0b5a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 44, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Pato Ingeniero"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}