{"id": 483868, "slug": "merithlon", "name": "Merithlon", "name_original": "Merithlon", "description": "<p>Abordamos las problemáticas de distintas personas para llevar a cabo sus estudios o carreras.  Por lo cual parodiamos la idea del pensamiento mágico neoliberal de la “meritocracia” , el deseo  y su realización bajo falsas premisas románticas de gurúes marketineros (ej “Si lo deseas lo suficiente el universo conspira a tu favor” ; “Querer es poder” y si no no lo quisiste los suficiente etc.) desentendiéndose de los contextos socioeconómicos (que suelen imponerse antes que los deseos de autorrealización ) que suele de manera poco equitativa condicionar las oportunidades de los sujetos. <br/></p>\n<p>Destacamos   que si bien, todos partimos de “una misma línea de largada” (la educación en Argentina es pública, libre y gratuita siendo un hecho parteaguas en el progreso de las clases medias baja para la autorrealización educacional y el  cambio de posición  económico social ) aclarando que las oportunidades recibidas,  heredadas o las surgidas facilitan o complejizan el desarrollo de los caminos transitados. <br/>Comentamos que  en esta ocasión representamos la idea  gráfica/ interfaz como una analogía de una carrera deportiva. <br/>El cual tendrá como fin evidenciar las cantidad de tiempo o km recorrido por cada sujeto,dando claramente resultado diferentes.<br/>Para cerrar los invitamos a ponerse en los “zapatos de otros” y empatizar con sus luchas y caminos y recorridos  para así poder entender un poco las situaciones que transitan los otres. Gracias</p>", "metacritic": null, "released": "2020-08-22", "tba": false, "updated": "2020-08-24T05:42:35", "background_image": "https://media.rawg.io/media/screenshots/e8d/e8da58b838b918cb46b762691cc1ffc9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 45, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["placebo_yue", "KuraraH"], "genres": ["Racing", "Educational"], "publishers": [], "esrb_rating": null}