{"id": 483839, "slug": "monster-casino-billy", "name": "Monster Casino (billy)", "name_original": "Monster Casino (billy)", "description": "<p>Welcome to the Monster Casino.</p>\n<p>Chelly and Dog, citizens of Hell, are forced into a gauntlet of high stakes Poker death matches in order to secure their rent, which was unfairly jacked up by Satan.</p>\n<p>With her high emotional intelligence, Chelly is able to recruit monsters to her side. Using the secret technique of \"cheating\", these monsters can tip the scales in her favor.</p>\n<p>Created in 48 hours for Miz Jam 1.</p>\n<p>Full source code available here: https://github.com/billymonks/monster-casino</p>\r\nInstructions\r\n<p>Monster Casino is played exclusively using the mouse and left mouse button.</p>\n<p>When exploring, click on the ground to walk to a location, and click on a monster to interact with them. Some monsters will challenge you to a poker battle when interacted with.</p>\n<p>Poker battles play out similarly to standard Texas Hold 'em, with an added twist: monsters in your party can cheat to assist you during play. To activate these cheats on your turn, just click on the party member's icon on the bottom-left corner of the screen. When you hover the mouse over the icon a tooltip will be displayed showing your party member's ability, and how much \"security alert %\" the ability will cost to use. The current \"security alert %\" can be seen on your turn on the top-right corner of the screen, designated by a yellow \"!\". If an ability would bring this alert level above 100%, you will be unable to use the ability.</p>\r\nTexas Hold 'em basics\r\n<p>Aside from that, battles play out like standard Texas Hold 'em. The objective of the game is to bankrupt your opponent by betting on who has the stronger hand.</p>\n<p>Each player receives two cards (known as \"hole cards\", which are hidden from the other player. Five additional cards are placed on the table, known as \"community cards\". A player's hand value is calculated from the strongest possible 5 card hand from that player's hole cards and the community cards.</p>\r\nGame flow\r\n<p>Each turn, player and opponent take turns betting as cards are revealed.</p>\n<p>First, before any cards have been dealt, one player pays the \"small blind\", and the other pays the \"big blind\". This money goes into the \"pot\". The pot is a pile of money on the table that is at stake for the current hand.</p>\n<p>Next, each player is dealt their two hole cards and are given the opportunity to bet.</p>\n<p>Next turn, 3 of the 5 community cards are revealed. Both player have an opportunity to bet.</p>\n<p>Next, an additional community card is revealed and both players have another opportunity to bet.</p>\n<p>Next, the last community card is revealed and both players get one last chance to bet.   Finally, if neither player has folded, it's time for the showdown. Both players' hole cards are revealed, and the player with the strongest hand wins the pot.</p>\n<p>After each hand, the price of the big blind and small blind doubles, and which player is paying the big blind or small blind, and who plays first each turn (known as the dealer) switches.</p>\r\nBetting\r\n<p>Each turn, each player has the opportunity to increase the stakes, match the stakes, or fold and give up the pot. The player's options are: \"Check\" (if both players are currently betting the same stakes, checking passes your turn without betting any additional money.), \"Call\" (place money into the pot to match the opponent's stake and stay in the current hand), \"Fold\" (surrender the pot to the other player, ending the current hand and not placing any more money into the pot), or \"Raise\" (to match the opponent's stake, and bet additional money in the pot. If the opponent would like to stay in the current hand, they will have to \"Call\" your additional bet, or else surrender the pot.)</p>\r\nHand strength from strongest to weakest\r\n<p>Royal Flush: A straight flush from 10 to Ace (example: 10 of hearts, Jack of hearts, Queen of hearts, King of hearts, Ace of hearts)</p>\n<p>Straight Flush: A straight of the same suit (example: 2 of hearts, 3 of hearts, 4 of hearts, 5 of hearts, 6 of hearts)</p>\n<p>Four of a kind: Four cards of the same value (example: 6 of spades, 6 of diamonds, 6 of hearts, 6 of clubs + any other card)</p>\n<p>Full house: A hand with three of a kind and a pair</p>\n<p>Flush: Five cards of the same suit (example: all cards are hearts)</p>\n<p>Straight: Five cards in sequential order (example: 2 of spades, 3 of hearts, 4 of spades, 5 of diamonds, 6 of hearts)</p>\n<p>Three of a kind: Three cards of the same value</p>\n<p>Two pairs</p>\n<p>Pair: Two cards with the same value</p>\n<p>In the case that the player and opponent have the same hand, the hand with the higher value will win. (Example: a pair of Kings will beat a pair of Queens. If both players have the same pair, the tie will be split by who has the highest value card in their hand outside that pair.)</p>\n<p>In the event that both players have an identically valued hand, the pot will be split among both.</p>\r\nCredits\r\n\n<ul><li>Kenney - <em>1-Bit Pack</em> 1-Bit Pack</li><li>Kenney - <em>54 Casino sound effects</em> 54 Casino sound effects</li><li>SHADOWFOX2 - <em>Casino song</em> SHADOWFOX2</li><li>Maoudamashii - <em>Battle themes and many sfx</em> Maoudamashii</li><li>SnapCall - Snapcall for Poker hand evaluation tables</li></ul>", "metacritic": null, "released": "2020-08-22", "tba": false, "updated": "2020-08-24T05:36:58", "background_image": "https://media.rawg.io/media/screenshots/e52/e5210ed318dcd8b56e3b0bdc5a6e9a04.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 125, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Billy"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}