{"id": 483980, "slug": "nowhere-blackmothentertainment", "name": "Nowhere (BlackmothEntertainment)", "name_original": "Nowhere (BlackmothEntertainment)", "description": "<p>Nowhere was originally created in 48 hours in March 2011.  There wasn't actually a jam for this, I just took suggested themes from the forum I ran at the time and randomly selected one, the theme was 'Non-Euclidean'.</p>\n<p>I used this theme to make a platformer with looping levels where things can change when they loop.  <br/></p>\n<p>Arrow keys to move</p>\n<p>A to jump</p>\n<p>S to use switches/keys/etc</p>\n<p>ESC to quit<br/></p>\n<p>There is a \"true\" ending if you collect 100% of the gems in each level, progress is saved when you quit.<br/></p>\n<p>Strongly suggest you turn the volume down when playing, the jump sound is annoying ^^</p>\n\n<p>Looking back on the game almost 10 years later: The theme isn't used to its full potential, and the first level is kind of a boring introduction to the idea (just keep walking right until enough platforms spawn that you can climb up), High Garden is a kind of tedious idea of \"climb up until the level is solvable\" but if you fall down it reverses your progress, to the point where if you fall you should just quit which is... just terrible design on that one.  I think at the time I had a more involved idea for some of these levels, but the self-imposed time limit meant some of them were rushed.  I was quite happy at the time with how the looping came out, I'd never tried anything like that at the time so it was a fun challenge to implement but it could definitely have been made into more interesting puzzles. <br/></p>", "metacritic": null, "released": "2020-08-22", "tba": false, "updated": "2020-08-24T06:09:38", "background_image": "https://media.rawg.io/media/screenshots/ad4/ad40b91ebb36feb63c8a65656a38f85f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 25, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BlackmothEntertainment"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}