{"id": 483945, "slug": "logic-booster", "name": "Logic Booster!", "name_original": "Logic Booster!", "description": "<p><em><strong>    Tricky </strong><strong>tasks</strong> full of surprises and intricate logic are waiting for you in the stock of knowledge of cat scientist. Prove that you can handle them! Get poignant <strong>phrase</strong><strong>s</strong> in case of failure or approving praise and glory from the cat scientist himself to the one who is able to solve the tasks! <strong>Logic Booster</strong> and <strong>the cat scientist</strong> will surely not let you get bored! Not to mention the tasks getting crazier and crazier towards the end of the game, <strong>try not to go crazy!</strong></em></p>\n<p><em><strong>    Incredible logic tasks</strong> and unusual <strong>math tasks</strong> will take you on an epic journey through the deep aspects of <strong>your mind</strong>! The game will appeal to both children and adults! You will need extraordinary thinking and going beyond your imagination is necessary to find the right answer! </em><strong><em>Upgrade your logic with Logic Booster!</em></strong>\n</p>\n<em>What do you think about it?</em>\n<p><strong><em>★ Free to play\r\n  </em></strong></p>\n<p><strong><em>★ Almost 200 tasks are available! Their number will only grow!</em></strong></p>\n<p><strong><em>★ Logic and mathematical tasks! You decide which to solve!</em></strong></p>\n<p><strong><em>★ The ability to respond as you like! Just write the answer, and special algorithms will try to match your answer with the correct one!\r\n  </em></strong></p>\n<p><strong><em>★ More than 400 different phrases from your companion! He will definitely not let you get bored!</em></strong></p>\n<p><strong><em>★ Who are you? The tasks are distributed in ascending order of difficulty! They are suitable for both children, schoolchildren, teenagers and even adults!</em></strong></p>\n<p><strong><em>★ You will be surprised how much you can improve your mind and thinking!</em></strong></p>\n<p><strong><em>★ No Internet? Not a problem! You can still play and complete the levels!             \r\n  </em></strong></p>\n<p><strong><em>★ A modern application and game that anyone will definitely like!</em></strong>\n</p>", "metacritic": null, "released": "2020-08-22", "tba": false, "updated": "2020-08-24T06:02:01", "background_image": "https://media.rawg.io/media/screenshots/a5d/a5d376b9b68a1356892fe0dbfc83f78d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 70, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["InfinityUniverseStudio"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}