{"id": 48394, "slug": "kingdoms-of-camelot-battle", "name": "Kingdoms of Camelot: Battle", "name_original": "Kingdoms of Camelot: Battle", "description": "Build a mighty empire, forge alliances, unlock prizes, and claim your throne as ruler of the kingdom!<br/> ►►►9.5 Million players and counting◄◄◄<br/><br/><br/>Join millions of players as you build your empire in Kingdoms of Camelot: Battle for the North! (Camelot web players: this game does not connect to your web kingdom: it’s an all-new mobile game)<br/><br/>Drust mac Erp and his savage Picts have overrun Northern Britain. King Lot of Lothian is dead. His widowed queen, Morgause, appeals to her half-brother Arthur for help. It’s up to you to answer Arthur’s call and save the Kingdom!<br/><br/>BUILD A MIGHTY ARMY<br/>· Gather Knights, Heavy Calvary and more as you grow a massive army<br/>· Train hundreds and thousands of elite troops to dominate the realm<br/>· Fight for the glory of your medieval Kingdom with powerful forces<br/><br/>JOIN ARTHUR’S KNIGHTS OF THE ROUND TABLE<br/>· Recruit legendary Round Table Heroes to enhance your city<br/>· Command famous medieval Knights like Sir Lancelot, Sir Gawain, Sir Percival and more<br/>· Strengthen your mighty empire as you add high-ranking officials to lead your roster<br/><br/>FORGE ALLIANCES WITH OTHER RULERS<br/>· Join Millions online to form Alliances and combine forces with fellow Lords and Ladies<br/>· Use real-time chat to prepare strategic battles against other kings<br/>· Ally with friends or challenge enemies in the ultimate quest for power<br/><br/>DAILY REWARDS<br/>· Log in daily, participate in tournaments, and earn valuable prizes!<br/>· Discover new exciting items to increase your empire’s power and might<br/>· Dominate the leaderboards and earn the respect of the citizens of Camelot<br/><br/>EXPAND CAMELOT’S LEGACY<br/>· Build an empire and claim your throne in Camelot<br/>· Conquer enemies and lay siege to savage Picts and evil<br/>· Rule the medieval realm to become the most powerful King!<br/><br/>Follow @KoCMobile on Twitter for the latest news!<br/>Like us on Facebook: https://www.facebook.com/KingdomsofCamelotMobile<br/><br/><br/>*********************************<br/>By downloading this game, you agree to the Terms of Service, Privacy Policy and the License Agreement. <br/><br/>http://www.gaea.com/en/privacy<br/>http://www.gaea.com/en/termsofuse<br/>*********************************", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:10:04", "background_image": "https://media.rawg.io/media/screenshots/c55/c55e48f09a797650236417afc5a85231.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 418, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android"], "developers": ["Gaea Mobile"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}