{"id": 484032, "slug": "ecstaxi-indiewarejam-nathan-contreras", "name": "EcsTaxi - #IndieWareJam - Nathan Contreras", "name_original": "EcsTaxi - #IndieWareJam - Nathan Contreras", "description": "<p>The game is based on the concept of you being a down-on-your-luck traveler, looking for anywhere to go.  No more stops are planned by your hotel for the week, but an unlisted taxi makes a pit stop.  You notice the name on the placard reads \"EcsTaxi\".  The driver offers you a ride into town, which you didn't notice before on the horizon.  With nothing better going on in your future, you decide to hitch a ride.  The driver explains the fare will be covered, if you can complete his set of minigames.<br/><br/>Everything in this short game is made by myself.  This was a project I decided to roll solo instead of with my usual crew to refine my individual skills.  I ended up spending way more time making a good base for the game such that minigames could be easily created and added with minimal effort.</p>\n<p>All code can be found on https://github.com/CrestedShark/WarioWareJam_EcsTaxi_2020itch if you're savvy enough to check it out.  Documentation may be added at a future date to improve readability, and a framework for how to make new minigames will be included.  The current build can easily support the addition of new minigames that are contained within their own scenes.  Examples of these can be found within Assets/Scenes/Games.  </p>", "metacritic": null, "released": "2020-08-22", "tba": false, "updated": "2020-08-24T06:21:00", "background_image": "https://media.rawg.io/media/screenshots/696/6962dcdf674b5e8b785d220c2732bc18.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 11, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["CrestedShark"], "genres": [], "publishers": [], "esrb_rating": null}