{"id": 484121, "slug": "telephone-paintings", "name": "Telephone Paintings", "name_original": "Telephone Paintings", "description": "<p><strong><em>TELEPHONE PAINTINGS</em>:</strong></p>\n<p><em>Telephone Paintings</em> is an infinite-3D art gallery. Inside it are paintings and texts created using artificial intelligences.  The work uses three generative adversarial networks (GANs) working in tandem:</p>\n<ol><li>The first GAN (StyleGan) creates an infinitely varied set of paintings in the style of abstract 20th century art.</li><li>The paintings are then shown to a second GAN (Yolov3). Yolov uses object detection to name the objects in the paintings, which are then used to generate a descriptive phrase in fairly grammatical English.</li><li>This descriptive phrase is then fed into a third GAN (GPT2) which creates a short description of the work’s history and (imaginary) artists involved. This network  has been trained on the descriptions of various modern art museums.</li></ol>\n<p>\n</p>\n<p>The gallery is then procedurally created using Unity. In the gallery space itself, nothing repeats. Code controls the selection of artworks, the camera, and the 3D models. The audio is an abstracted soundscape of server farms-- fans and rhythmic mechanical pulsing.</p>\n<p><em>Telephone Paintings </em>is an ongoing work by Steven Sych and Timothy Thomasson. The work is dedicated to Bauhaus artist László Moholy-Nagy (1895-1946).</p>\n<p>“I was not afraid of losing the “personal touch” so highly valued in previous painting. On the contrary, I even gave up signing my paintings. I put numbers and letters with the necessary data on the back of the canvas, as if they were cars, airplanes, or other industrial products.”</p><p>-László Moholy-Nagy (1944)</p>", "metacritic": null, "released": "2020-08-22", "tba": false, "updated": "2020-08-24T06:38:21", "background_image": "https://media.rawg.io/media/screenshots/44c/44c2548a84edd1c34ed4c555769eec8e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 46, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["spelafort"], "genres": [], "publishers": [], "esrb_rating": null}