{"id": 48419, "slug": "istunt-2", "name": "iStunt 2", "name_original": "iStunt 2", "description": "Get ready to hit the slopes in the most extreme snowboarding game on the Google Play Store!<br/><br/>Escape deadly buzz saws, keep you balance through gravity shifts and speed boosts, grind your way to victory in this fast paced and insanely addictive snowboarding game!<br/><br/>REVIEWS:<br/><br/>\"The sense of being just enough in control is cool, and adds to the overall thrill ride element of iStunt 2.\" - IGN <br/><br/>\"Pulling off a twisting move, a couple of grabs, and tilting just right, and just in time, for a perfect landing is what makes iStunt 2 a blast.\" - PocketGamer <br/><br/>\"iStunt 2 is full of clever and surprising levels that remain exhilerating all the way through. iStunt 2 is a stunner.\" - SlideToPlay <br/><br/>KEY FEATURES:<br/><br/>★ Stunning HD graphics!<br/>★ Fast paced gaming with perfectly balanced tilt controls! <br/>★ 88 insane levels + more levels added regularly to keep all your extreme snowboarding needs satisfied! <br/>★ In-game store with cool unique items! <br/>★ Google Games services integration. Achievements and leaderboards - show you're friends who's the stunt king in these deadly slopes! <br/><br/><br/>If you're tired of just tapping games away embrace the full gaming experience. Tilt, tap and slide your way to victory! <br/><br/>*************************************** <br/>Try also the free web version of iStunt 2 on our website:<br/>http://www.miniclip.com/games/istunt-2/en/", "metacritic": null, "released": null, "tba": false, "updated": "2022-11-11T21:10:30", "background_image": "https://media.rawg.io/media/screenshots/a7c/a7ca9252c52179cd8aea21c8132cc063.jpg", "website": "", "rating": 3.0, "rating_top": 4, "added_by_status": {"yet": 1, "owned": 47, "beaten": 2, "dropped": 1}, "playtime": 0, "achievements_count": 37, "ratings_count": 7, "suggestions_count": 196, "game_series_count": 0, "reviews_count": 7, "platforms": ["Android"], "developers": ["Miniclip.com"], "genres": ["Sports"], "publishers": [], "esrb_rating": "Everyone"}