{"id": 484281, "slug": "the-kryntonian-menace", "name": "The Kryntonian Menace", "name_original": "The Kryntonian Menace", "description": "<p>Set in the far distant future, you are a lone survivor on your ship as three Kryntonian Dead Spiders have managed to get aboard. Will you survive? Will you make it through?<br/></p>\n<p>This game was made in less than 48 hours for Miz Jam 1<br/>47:52:12 exactly<br/></p>\n<p>-Devlog video coming soon before the end of the Miz Jam 1 rating period-</p>\n<p>Livestream archives of the development:<br/>https://www.youtube.com/watch?v=1N9mF-npKvU&amp;list=PL7WU5IMd2RCOfcNYhJHHLhYmrZFVdbDqm</p><p>Controls:</p>\n<p>-WASD to move<br/>-Mouse to look around<br/>-Ctrl to crouch<br/>-Space to jump<br/>-E to grab items<br/>-Tab for inventory<br/>-Left Mouse Button to shoot (when you have a weapon)<br/>-F to toggle flashlight (when you have a flashlight)<br/>-C to toggle crosshair on/off<br/>-R to restart (when dead)<br/>-Backspace to quit<br/>Most of the important controls get stated in game</p>\n\n<p>Good luck and have fun!<br/><br/></p>\n<p>In this final release one major bug is present: An out of bounds glitch easily performed by slamming in to the corners of the airlocks (can probably also be performed in different tight spots), sadly it is not something I could fix within the time I had left. Such are the limits of a game jam. I hope you'll be able to look past this issue and still enjoy the game for what it is, but because of this the following has been implemented as a 'fix' for the game jam so people won't get stuck out of bounds:</p>\n<p>Debug control: <br/>-press ; to restart the game at any time. <br/><br/>After the game jam is over I hope to be able to release a final bug fix patch</p>", "metacritic": null, "released": "2020-08-21", "tba": false, "updated": "2020-08-24T07:14:40", "background_image": "https://media.rawg.io/media/screenshots/776/7765b0b6816cfb1148c6036a3a34b7f5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 87, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["LAKster"], "genres": [], "publishers": [], "esrb_rating": null}