{"id": 484337, "slug": "knight-of-hope", "name": "Knight of Hope", "name_original": "Knight of Hope", "description": "<p>Chaos and despair corrupts this world. The wielder of Hope must fight endless waves of enemies to stop the Chaos King. YOU must wield Hope and save this world!\r\n</p>\n<p>Fight endless waves of enemies and bosses to see if you can stop chaos and despair. Can you will hold out?</p>\n<p>Controls: A &amp; D to move, Space to jump, K to swing sword, L to shot left or right, W to shot up, W+L to shot diagonally, S to fall down, ; to use item, P to pause.</p>\n<p>FAQ</p>\n<p>Q - Why are their 3 files?</p>\n<p>A - The used game engine does not have a good in-game resizing tool. So we made 3 resolutions (1536x960, 1024x640, and 512x320) in case you have a older screen. If a bigger resolution is needed, inform me and we'll try to add it.</p>\n<p>Q - Why is it not just one .exe file?</p>\n<p>A - It made the game stutter and lag so we opted to just give you the file.</p>\n<p>Q - Why is there a watermark in the corner?</p>\n<p>A - We could not afford at this time to by the full game engine licences, so we settled with releasing the game with the mark and if the game makes the 99$ we need, we'll by the licence and remove the mark.</p>\n<p>Q - Is this game worth 1$ of my money?</p>\n<p>A - Knight of Hope is in many ways different and could be fun experience for many indie game lovers. But we at CRA Games believe it is worth every penny :)</p>\n<p>We at CRA Games HOPE you have an fun playing are first full game!</p>\n<p>May contain glitches and bugs. Pleas comment or send your problems, improvements and advice to me.</p>\n<p>as of 8.20.2020. \"we\" stands for only one person :)</p>", "metacritic": null, "released": "2020-08-21", "tba": false, "updated": "2020-08-24T07:26:18", "background_image": "https://media.rawg.io/media/screenshots/9a7/9a7070b1cb058669c0c316cce8eef905.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 73, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["CRA Games"], "genres": ["Action", "Platformer"], "publishers": [], "esrb_rating": null}