{"id": 484431, "slug": "chroma-canyon-run-online-lowrezjam2020", "name": "Chroma Canyon Run ONLINE - LOWREZJAM2020", "name_original": "Chroma Canyon Run ONLINE - LOWREZJAM2020", "description": "<p><em>It is not a war, though there are casualties. </em><br/></p>\n<p><em>Some have called it a race, but aren't races meant to end?</em></p>\n<p><em>One thing is for sure though,<strong> someone is keeping score.</strong></em></p>\n<p>For as long as the people of Chroma Canyon can remember, they have observed The Run.</p>\n<p>Men and women from each corner of Chromata ride in on steam-rolling behemoths, used once to flatten the roads that allowed their civilization, now outfitted with giant paint rollers and ready to roll their nation's colors across the desert plane.</p>\n<p>The year is 2020, and you have finally reached the age to go to the Gulch of Gouache, run for your ChromaQuarter and spread the pigment of your people!</p>\n<p><strong>Now go, The Run has already begun!</strong></p>\n\n<p>MADE IN ~TWO WEEKS FOR LOWREZJAM2020</p>\n\n<p>You need to enter a name, pick a color/team, and click the checkmark button to join the game. (Names aren't really being used for anything in the jam build, but might display high scores or something at some point.)</p>\n<p>The game will run for the duration of the judging period (hopefully continuously, everyone cross your fingers for the server).</p>\n<p>GOAL:  Be on the team with the most pixels of your color on the world map when the game/judging period ends! The colored bar at the top of the screen shows the ratio of colored pixels drawn for each team.</p>\n<p>DON'T: Crash into walls while going too fast (you can keep an eye on your speed at the very bottom of your screen), or run out of paint in your tank (paint meter is right above the speed bar).</p>\n<p>Controls:</p>\n<p>Mouse: Main menu and team/color selection</p>\n<p>Movement: Arrow Keys/WASD</p>\n<p>TAB: Show Overworld View</p>\n<p>TAB + SHIFT: Show health and score bars while in Overworld View</p>\n<p>CTRL+/CTRL- : Increase/decrease game size if you don't like the default. This just zooms your browser, but works to scale the game up as well.</p>\n<p>ALSO<br/><strong>It's possible that there will be few or NO OTHER PLAYERS online</strong> when you play. To test that the game is in fact multiplayer and you can see other players, I recommend opening up at least two tabs and joining the game twice on the same team (so that both vehicles start near each other). You can join different teams, it will just take you some time to get to the other side of the map.<br/><br/>FINALLY<br/>The full world view triggered by TAB has something of a 'fog of war' effect, in that your client will only reveal the world within a certain distance from you, which may explain why you don't see much painting when you first join, depending on who has been on your side of the world. Somewhat intentional, somewhat a result of not finishing it.<br/></p>\n\n<p>Thanks for checking it out!</p>\n<p>-TyPhyter</p>", "metacritic": null, "released": "2020-08-16", "tba": false, "updated": "2020-08-24T07:45:38", "background_image": "https://media.rawg.io/media/screenshots/bf8/bf896a06876b68a87fda5d740559cc2b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 24, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["TyPhyter"], "genres": ["Action", "Racing"], "publishers": [], "esrb_rating": null}