{"id": 484422, "slug": "non-player-commissary", "name": "Non-Player Commissary", "name_original": "Non-Player Commissary", "description": "<p>Heroes play a vital role in the world: saving us from the dark forces that threaten our very existence. But what about the NPCs who keep the heroes equipped and fed? And does being a hero give them the right to come in and trash all the jars in every store?</p>\n<p>The goal of this entry is to be a store/factory simulation where (following a couple of the optional themes of LOWREZ 2020) you play as an NPC shopkeeper who is making hot dogs for heroes to satiate them and keep them from destroying your jars. You do this via creating assembly lines for making hot dogs and distributing them to heroes before they get impatient. Be careful though, different types of heroes request different types and quantities of hotdogs!</p>\n<p>At jam submission time, unfortunately, most of the gameplay loop wasn't functional. The jam submission basically lets you see the title screen/menu and story, and you can walk around the store and the empty factory a bit. I want to at least finish a functional version of the core game loop soon though, so make sure to follow for updated post-jam builds!</p>\n<p><strong>Credits</strong></p>\n<p><strong>Main team</strong></p>\n<ul><li>lopar LoparPanda on Twitch @lopar on Twitter - idea, code, music, character pixel art, factory pixel art, UI art</li><li>Casey Heartsupport on Twitch - pixel art for storefront</li><li>Michael Firman @michaelfirman on Twitter - Story and title screen illustrations, Concept art for heroes</li></ul>\n<p>Happily made with the Godot Engine!</p>\n<p><strong>Third party assets</strong></p>\n<p>Palette - HEPT32 by Endesga<br/></p>\n<p>Fonts</p>\n<ul><li>Ultrapixel by josemwarrior</li><li>Minimal3x5 by kheftel</li></ul>", "metacritic": null, "released": "2020-08-16", "tba": false, "updated": "2020-08-24T07:43:24", "background_image": "https://media.rawg.io/media/screenshots/3a7/3a7aadd36f60ec28065508eb27e3f030.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 64, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["lopar"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}