{"id": 48447, "slug": "honorbound-rpg", "name": "HonorBound (RPG)", "name_original": "HonorBound (RPG)", "description": "Begin your magical adventure in HonorBound today! Download now and immerse yourself in a mystical world where the likes of dragons, ogres, orcs, and even the undead wander the earth. Evil has taken root in the once peaceful world of HonorBound and it’s up to YOU to restore the balance. Are you a warrior? A rogue? A wizard, cleric or a knight? You decide! <br/> <br/>Ally with hundreds of different heroes to create the ultimate squad. Harness one or even all five of the mystical elements - fiery Terra, wild Primal, celestial Lunar, pure Spirit, and unknown Abyss to help defeat all that stands in your path. Recruit magical beasts, battle-tested warriors, and other allies from the world of HonorBound to assist you in your quest. Build your own unique strategy as you collect more allies and customize your squad!<br/><br/>Battle in epic PVE boss fights and collect rare loot and legendary treasures. Equip these treasures to make your squad even stronger! Team up with your friends and join a clan to find even more allies to accompany you on your adventure. Test your strength in the PVP Arena against thousands of other clans to see which clan rightfully deserves the throne. <br/><br/>FEATURES<br/>• Free-to-play fantasy RPG!<br/>• English, French, Spanish, Italian, German, Russian, Portuguese, and Japanese all supported<br/>• THOUSANDS of different heroes to capture, evolve, and battle!<br/>• Unique strategy combat system with different class strengths and weaknesses<br/>• 100% animated characters – bring them to life on both your phone and tablet!<br/>• Travel across lush and vibrant worlds, filled with valiant allies, fearful foes and unnamed beings!<br/>• Thousands of clans for you and your friends to team up with and forge powerful alliances<br/>• SFX and music scored by Bobby Tahouri<br/>• Tons of monthly PVE and PVP tournaments with awesome rewards! <br/><br/>Come play with over 3 million other players who have downloaded HonorBound!<br/><br/>Support: support@juiceboxmobile.com<br/>Community: https://forum.honorboundgame.com/<br/>Privacy Policy: http://honorboundgame.com/privacypolicy.html<br/><br/>Use of this application is governed by the JuiceBox Terms of Use. Collection and use of personal data are subject to JuiceBox's Privacy Policy. Both policies are available at http://honorboundgame.com/tos.html", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:10:01", "background_image": "https://media.rawg.io/media/screenshots/947/9473711f16fe3409ba4cd86b7914949f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 270, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["App Holdings", "JuiceBox Games"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}