{"id": 484502, "slug": "taiko-no-tatsujin-rhythmic-adventure-pack", "name": "Taiko no Tatsujin: Rhythmic Adventure Pack", "name_original": "Taiko no Tatsujin: Rhythmic Adventure Pack", "description": "<p>Taiko no Tatsujin RPG?! Join Don-chan in two exciting RPG adventures!</p>\n<p>From the past to the future, Don-chan sets out on a great adventure that will transcend time and space and save the world from mysterious occurrences around the world in &quot;Taiko no Tatsujin: Rhythmic Adventure Pack&quot;.</p>\n<p>■Enjoy a relaxing adventure through the world where you control Don freely in Story Mode!</p>\n<p>Take care of foes you encounter in Taiko Battles!</p>\n<p>Drum on the Taiko well to attack! Mess it up and you&#39;ll be attacked!</p>\n<p>Compose a team of your favorite characters to take on even stronger enemies!</p>\n<p>■In &quot;Rhythmic Adventure 1&quot; you&#39;ll serendipitously meet Tocky who has the important job of protecting all of history.</p>\n<p>He tells you his friend Ticky has been abducted by someone named Professor Timedyne.</p>\n<p>This wily professor is trying to use Ticky to dismantle history!</p>\n<p>Travel to all sorts of ages throughout history and do away with the bad guys!</p>\n<p>■In &quot;Rhythmic Adventure 2&quot; the treasures that protect the very being of the world, the Ooparts, have been stolen by the shady organization The Hexagria Magical Society!</p>\n<p>In order to retrieve them, Don and Katsu embark on a grand adventure!</p>\n<p>Will Don and his friends be able to retrieve the Ooparts successfully and save the world?!</p>\n<p>■And of course, you can play the Taiko Game Mode!</p>\n<p>The library consists of over 130 songs, including 6 newly added titles such as “Pretender” by Official Hige Dandism and “Gurenge” from Demon Slayer: Kimetsu no Yaiba!</p>", "metacritic": null, "released": null, "tba": true, "updated": "2020-08-26T16:00:00", "background_image": "https://media.rawg.io/media/screenshots/83f/83fa66dc8e69d964174610edf7375ead.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 2, "dropped": 1, "playing": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 210, "game_series_count": 9, "reviews_count": 1, "platforms": ["Nintendo Switch"], "developers": ["Bandai Namco Entertainment"], "genres": ["RPG", "Arcade"], "publishers": ["Bandai Namco Entertainment"], "esrb_rating": null}