{"id": 484577, "slug": "roadwarden", "name": "Roadwarden", "name_original": "Roadwarden", "description": "Other then that, your character will pursue a unique goal selected by you, such as wealth or fame. But do you have the courage to meet all the requirements that define a roadwarden?How to play?Roadwarden is an illustrated text-based RPG that uses isometric pixel art and combines mechanics borrowed from RPGs, Visual Novels, adventure games, and interactive fiction, such as inventory puzzles, dialogue choices, character abilities and progression, hit points. simple survival mechanics. or quests restricted by in-game time.<br />\nExplore and change the world!Discover the secrets and face the vast challenges of a hostile fantasy world – inevitably unveiling its uniquely fierce lore.Grow with the challenge!Create your own background, abilities, beliefs, and personality to shape your very own future as a roadwarden.Classical attitude!Prepare yourself for an adventurous journey, either as a warrior, mage, or scholar and define your character‘s attitudes, like friendly, playful or intimidating, during interactions with NPCs.Get lost in conversation!Immerse yourself in profound dialogues and sidequests with dozens of NPCs to gain their trust and support.Mysteries unfold!Use your savvy and be witty when investigating and drawing your conclusions to understand the true nature of this world.Overcome your weaknesses!The world is full of dangers and nobody can be trusted. Be the roadwarden you want to be and find your path to success against all odds!</p>", "metacritic": null, "released": "2022-09-08", "tba": false, "updated": "2023-09-18T18:46:39", "background_image": "https://media.rawg.io/media/screenshots/216/216b292b866abcd42afde82f759c3ac3.jpg", "website": "", "rating": 3.93, "rating_top": 5, "added_by_status": {"yet": 30, "owned": 267, "beaten": 7, "toplay": 22, "dropped": 7, "playing": 3}, "playtime": 1, "achievements_count": 25, "ratings_count": 14, "suggestions_count": 177, "game_series_count": 0, "reviews_count": 14, "platforms": ["Linux", "macOS", "PC"], "developers": ["Moral Anxiety Studio"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Assemble Entertainment"], "esrb_rating": null}