{"id": 484557, "slug": "spaceslingers-2", "name": "Spaceslingers", "name_original": "Spaceslingers", "description": "Spaceslingers is a fun and mind-bending 2D sci-fi gravity based puzzle game, where the only obstacles between you and your goal are the most powerful objects in the known universe!<br/><br/><br/>Use the gravity wells created by black holes (and other exotic celestial objects) to slingshot your delivery ship to target planets. Easy to play but hard to master, Spaceslingers is filled with both meditative moments of intuition-based planning and jaw-clenching moments of tense action.<br/><br/>Spamazon, the local intergalactic delivery company, has hired you to service the Core Quadrant which has been in sore need of deliveries since the last person doing them was spaghettified in the bowels of a black hole. You'll take on a huge variety of gravity based puzzles, facing death, destruction and/or insanity around every corner, on your quest to become the universe's ultimate deliverer. Plan your paths by thinking about the gravitational potential of each object on your route and figure out the perfect angle and power to launch with so that you will make it to your target planet successfully (and in one piece).<br/>With tons of deliveries waiting to go, you'll need all your wits and nerves of steel to come out the other side alive. Remember, interplanetary deliveries is a hard job, but someone's got to do it!<br/><br/><strong>Spaceslingers features a level editor as well.</strong>", "metacritic": null, "released": null, "tba": false, "updated": "2020-08-27T16:02:35", "background_image": "https://media.rawg.io/media/screenshots/6b7/6b706b00ad73e6c341ccb48a9228b7a8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 123, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["RefresherTowel"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["RefresherTowel"], "esrb_rating": null}