{"id": 484551, "slug": "stramedia-my_misadventure", "name": "Stramedia: my_MISADVENTURE", "name_original": "Stramedia: my_MISADVENTURE", "description": "Me and my mom have been having a good dinner in the kitchen that night, then the doorbell rang and an envelope slipped through the mail hole.<h3>\"Good evening! You've been invited!\"</h3>...it started off, continuing that it's an invitation to the \"Stramedia Safehouse Facility\" breach. The survey was...odd, to say the least, but some of the things were done fairly easy, though I didn't think it would go through. Then some of the days were spend outside of our homes and school, though it's up to you to think of whenever or not these were the good days. And then I am sure you know what happened next.<br/><br/><br/><strong>Stramedia - my_MISADVENTURE</strong> is an indie horror themed adventure game where you step into the shoes of a classroom warden who signed the agreement to possibly the most bizarre, yet somewhat deadly school trip in his entire life. Of course it may not start off deadly right away, but, uh...yeah, things are gonna escalate. But can you blame him? He really didn't know what he and his friends (fiends? Frienemies?) were going up for.<br/><br/>Well, what can he do now? Surprise, surprise, getting the hell outta there he must.<br/><br/><br/><br/>(AKA: the stuff worth checking it out and/or purchasing for)<br/><ul><li><strong>The main protagonist is wearing a fedora hat!</strong> This is probably the best selling point to this game... I think! I mean...this is one of the main factors you got attracted to that other game with a kid, the kid's hat, the stuff...uh, no? Okay, but if you know what you're doing, you can find and recruit three other friends you'll get (or have) to play as!<br/><br/></li><li><strong>Essentially, this is another \"average mediocre indie\" horror game,</strong> except the mediocrity here is 99% intentional! And not to mention that it's got everything you love and hate to see and experience in a horror themed videogame! Stupid simple and ridiculous (and somehow twisted) puzzles (with a lot of \"ands\"), cliché monsters and thirsty spooky mannequins...except they actually want to drink tea, you pervert. Get out of here!<br/><br/></li><li><strong>Simplistic Visual Pixel Art Style, Soundtrack and Audio Design!</strong> If you like looking at pixels with different contrast, I am sure your eyes will love that, and if your ears love to feast on the Low-Quality DPCM-ish Audio, giving you an illusion that you're playing a crappy retro GameBoy Advance styled game or something, then you're all welcome in!..oh, wait, I forgot that we <strong>are</strong> talking about a game that LOOKS pretty retro...huh, that's lame.<br/><br/></li><li><strong>No, really. That kid has a hat.</strong><br/><br/></li><li><strong>Despite it's horror nature, it's also a comedy game!</strong> What kind of comedy? This game has got most of it! Whenever it's all bad puns, visual humor, random, dark, dry or somehow outright gross and (\"mildly\") offensive humor, <strong>Stramedia</strong> has it in the stock and shelves!<br/><br/></li><li><strong>Prepare for some surrealism</strong>, because no matter if it's an optical thing or not, things are...weird, yet somewhat disturbing, but not personal space like disturbing, because this is where it draws the line even for us.<br/><br/></li><li><strong>A nice variety of accessibility options!</strong> Whenever you want to reposition the dialogue box, change it's text size, whenever you find some colored text hard to read, or just don't feel like playing the game with a controller and just want to rest your only arm and control the game with it, it's no problem! The accessibility (and other) settings options may enhance the experience more nicely! (if there's something you want to suggest, please let us know and we will gladly look into adding it!)<br/><br/></li><li><strong>Seriously, that kid is wearing my hat!</strong> SOMEBODY DO SOMETHING! DON'T LET HIM GET AWAY WITH MY HAT!! &gt;:U</li></ul><br/>#MadewithFusion", "metacritic": null, "released": null, "tba": false, "updated": "2020-08-27T15:58:29", "background_image": "https://media.rawg.io/media/screenshots/1f0/1f0e52ea597e2f64f7fb86914e9a4b95.jpg", "website": "https://rd_nickf.indie.af/stramedia_mM/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 101, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Nickolai Filipanov & Co."], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Good Friend Studios", "Nickolai Filipanov & Co."], "esrb_rating": "Mature"}