{"id": 484535, "slug": "pro-strategy-football-2021", "name": "Pro Strategy Football 2021", "name_original": "Pro Strategy Football 2021", "description": "If you've dreamed of a football game where every decision really counts, welcome to Pro Strategy Football 2021!<br/><br/>You don't have to decide between managing, coaching, enjoying watching live games, or simulating seasons (stats junkies, rejoice!), because PSF 2021 has it all!<br/><br/>With Steam's \"Remote Play Together\" enjoy a whole new dimension of coaching against a friend ONLINE!  And, play your PC or Mac version of the game directly on your iOS or Andriod tablet or smartphone, using the Steam Remote Play app! (from within your home internet network.)<br/><br/>Whether you're scouting free agents and rookies as a manager, or mounting a last minute drive as the head coach, the stress and fun of making real decisions is all there!  And the excitement is REAL, watching a college game go into its fifth overtime!<br/><br/><br/>The already-excellent simulation engine was carefully revamped this year to increase accuracy to uncanny realistic results!  And new \"Run Usage\" and \"Pass Usage\" options give more realistic personalities to teams, whether it's a grinding team from the 50s, the unbeaten Miami team running their fullback, tight end oriented passing attacks, or run and shoot teams!<br/><br/><br/><br/>New animation options let you watch the game the way YOU like to watch it!<br/><br/><br/>Customize every league's sounds, images, and rules.  Quick Set from rules in the 1940s to today, or go with three downs for a Canadian feel!  Play any song as your background music!<br/><br/><br/>Game ships with a Pro 2021 league AND a 130-team College starter league, but that's not all!  Over THIRTY schedules are included (as csv files), including a College schedule and a 21-week schedule for our Canadian fans!  Modders are already creating many more leagues, image sets, sounds, and schedules!  Play any actual season or create your own dream matchups!<br/><br/>Easily create the actual 1976 league and season schedule, for example, and play a season or even a career!  And now, you can change the number of wildcard teams!  Each season, you can load the actual schedules (or scramble teams) and choose the playoff formats!<br/><br/><br/>In Single Season play, create custom brackets from 2 to 32 teams for post season or standalone bracket tournaments!<br/><br/>Career play is incredible, with optional Free Agents and support for most custom leagues (two conferences, each having 1, 2, 3 or 4 divisions, and currently limited to 32 teams).  EACH season, you can load a custom schedule, choose to scramble the teams, and you can set the playoff format for the season!  You can also choose whether you want to allow Free Agents (and how many), the order of the FA draft, and more!<br/><br/><br/><br/><br/>Export season data in Career or Single seasons into text files, such as standings, stats, rosters, and more!<br/><br/>PSF 2021 is so full of features that you'll still be discovering them for months!  Check out the Scenario Editor in Quick Play, where you can set a game's teams, rules, quarter, time, number of timeouts, EVERYTHING, and then either sit back and watch or take one of the teams as a coach!<br/><br/>", "metacritic": null, "released": "2020-09-19", "tba": false, "updated": "2021-02-15T03:55:47", "background_image": "https://media.rawg.io/media/screenshots/cdb/cdb329261bf80250854f8e3062e3bcc1.jpg", "website": "http://www.prostrategyfootball.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 272, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "iOS"], "developers": ["Kerry Batts", "Pro Strategy Games"], "genres": ["Strategy", "Simulation", "Sports", "Indie"], "publishers": ["Pro Strategy Games", "Kerry Batts"], "esrb_rating": "Everyone 10+"}