{"id": 484571, "slug": "taimanin-yukikaze-1-trial", "name": "Taimanin Yukikaze 1: Trial", "name_original": "Taimanin Yukikaze 1: Trial", "description": "<p>This game is a trial version; it covers the prologue of the Taimanin Yukikaze.<br />\nThe language of this game is set to English by default.<br />\nFor other languages, please change the language setting from the in-game option.<br />\nTokyo. The demonic city, plagued with the demons from the dark realms.<br />\nThe ancient rule has prohibited the demons from interfering with humans,<br />\nbut with the humanity&#39;s dark descent, the pact is now history,<br />\nand the treacherous syndicates weave crime and chaos throughout the world.<br />\nIn order to protect the nation, the Japanese government has established a special force,<br />\nconsisted of ninjas who, with their might and skills, can fight against the demonic invasion.The world will know them...as the Taimanins.<br />\nIn the midst of the war against the demonic invasion, the young Mizuki Yukikaze, along with her senior Akiyama Rinko, volunteers to a highly dangerous mission, in order to rescue her long-lost mother, Mizuki Shiranui.<br />\nDespite the opposition from the headmistress Igawa Asagi, the two are chosen for the mission, which involves infiltrating into the heart of the dark side.<br />\nThe two set out to the mission leaving behind Akiyama Tatsurou, childhood friend to Yukikaze and younger brother to Rinko.<br />\nBut what awaits the two from the underground city of Yomihara, where suspense and betrayal lurks, and pleasure and debauchery slithers.......?<br />\nDisclaimer: This game may contain contents not appropriate for all ages, or may not be appropriate for viewing at work: Fantasy violence, nudity, strong language, sexual content, violence. All characters in the game are at least 18 years old.</p>", "metacritic": null, "released": "2020-07-08", "tba": false, "updated": "2022-03-01T02:06:17", "background_image": "https://media.rawg.io/media/screenshots/b06/b06935eda32e26125f1d1fafc5ce003e.jpg", "website": "https://www.lilith-soft.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 125, "beaten": 1, "toplay": 3}, "playtime": 1, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 323, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Lilith"], "genres": ["Adventure"], "publishers": ["Infini-Brain"], "esrb_rating": "Adults Only"}