{"id": 484598, "slug": "gripper", "name": "Gripper", "name_original": "Gripper", "description": "In Gripper, androids celebrate “Burning Man” by burning humans. That’s why all inhabitants bear a physical injury of one sort or another. You and your deaf sister are no exceptions. The two of you live peacefully on a farm until someone comes and burns it down. Now, your sister is missing. All you have left is your car with a hook. The time to learn how to kill with it is running out.<br />\nTake on the journey of a hero named None and follow the voice of his sister — a deaf singer.<br />\nTear your enemies apart with a hook and finish them with their own weapons.<br />\nDiscover and rip away the hearts of 11 colossal bosses to gain new abilities.<br />\nExplore 11 bizarre biomes which will form a vast and majestic world right in front of your eyes.<br />\nFly through 11 nightmarish tunnels to the beat of incredible tracks by KillTheBarber!, VEiiLA, Under This, Yamila, Mezzanine, pqQp.<br />\nSolve puzzles and decipher the codes of Garbage Collector to reconstruct the world history.<br />\nImmerse yourself into the retro-waves and tunes of mini rhythm games.<br />\nCollect all hidden statues to reveal the skeletons and tragedies of each character.<br />\nGripper is our personal story of loss. We turned it into the game to let it go. We hope it will help you too.</p>", "metacritic": null, "released": "2023-03-29", "tba": false, "updated": "2024-03-23T11:33:19", "background_image": "https://media.rawg.io/media/games/81a/81ab23e486efbd3a75167de8b5aa942a.jpg", "website": "http://gripper-game.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 5, "beaten": 2, "toplay": 4, "dropped": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 399, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Octobox Interactive", "Heart Core"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["OctoBox Interactive", "Heart Core"], "esrb_rating": null}