{"id": 484548, "slug": "destropolis", "name": "Destropolis", "name_original": "Destropolis", "description": "Destropolis is a top-down shooter game, inspired by such classic games like “Crimsonland”, “Alien Shooter” or “Nuclear Throne”. It takes place in a futuristic city, filled with red, cube-like enemies. Tear them to pieces with bullets, lasers and nuclear explosions. Play alone or with friends in a local co-op mode. Destroy as many enemies as you can before they overwhelm you.<h3>Features</h3><ul><li> Fight an endless wave of enemies in a futuristic city.<br/></li><li> Totally destructible environment. Every object in the game, every enemy, every building, can be smashed into pieces. You can blow up buildings, you can use them as cover, you can dismantle enemies bit by bit.<br/></li><li> 6 different types of enemies. Cubes are numerous and dangerous up close. Obelisks shoot lasers at you. Bomb spheres explode on contact. Pyramids shoot at you from a distance with artillery rounds. Wrecking balls smash everything on their path. Big, hexagonal bosses wreak havoc with their massive machine guns.<br/></li><li> 15 different guns at your disposal. Shotguns, assault rifles and machine guns shoot bullets that shred your enemies to pieces. Missiles and nuclear launchers create balls of fire that effectively clear out battlefields. Lasers and gauss guns cut through the enemies like knives through butter.<br/></li><li> 12 power-ups and 40 skills that enhance your abilities. Place turrets, create force fields and detonate nuclear explosions. Increase your health, damage or movement speed. Confuse your enemies that they will shoot at each other.<br/></li><li> Play alone, or with your friends in up to 3 players co-op mode.<br/></li><li> Compete with other players from around the world on global leaderboards.<br/></li><li> Unique art style. Clean and minimalistic environment. Distinct and aggressively colored enemies. Beautiful explosions and lighting effects.<br/></li><li> Synth-wave music. Created by a popular artist - LukHash. A fusion of chiptune mastery mingled with synthwave cyberpunk and EDM elements.</li></ul>", "metacritic": null, "released": "2020-08-19", "tba": false, "updated": "2022-12-06T07:47:39", "background_image": "https://media.rawg.io/media/screenshots/d4a/d4a4b87890e59f73b12b3d85a66b8fbe.jpg", "website": "http://igrekgames.net/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 41, "dropped": 2}, "playtime": 1, "achievements_count": 20, "ratings_count": 2, "suggestions_count": 292, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Igrek Games"], "genres": ["Action", "RPG", "Indie"], "publishers": ["PlayWay", "Games Incubator"], "esrb_rating": null}