{"id": 484524, "slug": "miao-ke-li-de-tu-wan-ou-nyakoris-rabbit-doll", "name": "喵可莉的兔玩偶 - Nyakori's Rabbit Doll", "name_original": "喵可莉的兔玩偶 - Nyakori's Rabbit Doll", "description": "<p>Playing Rule IntroductionThis is an RPG little game with micro terror to solve the riddles. The player will manipulate the maiden with cat’s ears to avoid the countless obstacles, constantly explore in the room full of lethal traps and find the secret hidden in the depth of memory.Game featuresThere are a lot of CG figures in this game and there are a great number of pixel animation to dynamically depict the protagonist&#39;s various action details.<br />\nThe player will have opportunity to operate anyone of the characters in the story to excavate the truth from different perspectives.Game duration and Number of endingsThe game lasts around 2-3 hours, with 2 Bad Endings, 1 Normal Ending and 1 Ture Ending.About Game StrategyIn the game, there are many built-in tools offering tips. The students who are not good at solving riddles can also avail it to pass.<br />\nFor this cat eared girl, most important thing is eating and sleeping. One day when she woke up and she found that there are no one prepared dinner for her so that she had to embark on the road to find a partner.<br />\nBut what she didn&#39;t think was that as time went on, a black secret was about to be revealed.<br />\nNyarutoru<br />\nThe strange girl with cat&#39;s ears and long tail seems to have no doubt about her body shape and her life background. She is selfish and indifferent in nature, afraid of being looked down upon, but she trusts and relies on Nyakori very much. She holds the same type rabbit doll with Nyakori, which is also her most important thing.<br />\nNyakori<br />\nShe is the girl who has blonde long hair and she likes to tie the hair up like two ponytails. She has a mature mind inconsistent with her appearance and age, reliable and steady. She has always treated Nyarutoru as a family member and called her &quot;Sister&quot;Operation methodAction: Mouse<br />\nConfirmation/ investigation：Z/ENTER/SPACE<br />\nCancel: X/ESC<br />\nFull screen mode：F4<br />\nScreenshot：F12<br />\nNote: This game does not rely on keyboard input, as long as using the touch device or handle can be a perfect experience.</p>", "metacritic": null, "released": "2020-02-02", "tba": false, "updated": "2022-01-31T21:40:00", "background_image": "https://media.rawg.io/media/screenshots/377/3774ccfd1c2215a4398e39dab46fd98a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 15, "beaten": 1, "toplay": 1}, "playtime": 2, "achievements_count": 6, "ratings_count": 1, "suggestions_count": 213, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["赤瞳大白猫"], "genres": ["Indie"], "publishers": ["赤瞳大白猫"], "esrb_rating": null}