{"id": 484596, "slug": "jessika", "name": "Jessika", "name_original": "Jessika", "description": "Dear <strong>Jessika,</strong><br/><br/>I have so many questions…so many questions that are haunting me since…then. I know we had lots of dissensions in the past. And sure, I have to admit that I wasn’t the best father there is…everybody has his faults and his crosses to bear. <br/><br/>Anyway, the important thing is, you have to learn from your mistakes. But right now, it’s too late for redemption, too late to say I’m sorry. There’s no way I can put right the terrible wrong that I’ve done – because of what you did and for whatever reason you did this. All I can think of is: <strong>WHY?</strong> Was this your last resort? If you would’ve talked to me, we could’ve found a remedy, a way out…somehow.<br/><br/>I can’t blame you for keeping silence and a low profile. I can only blame myself. No matter what others will say, for my emotional well-being, I want to – no, I have to find out what happened and what made you do this.<br/><br/>I hired professionals that will be able to bring light into the darkness, inquiring your whereabouts and examine your intentions. And maybe, but just maybe, they can ease my conscience. At least for the time being.<br/><br/>Love always.<br/>Dad<h3>What's your job?</h3>In this full motion video mystery adventure you are part of a group that specializes in processing digital footprints of deceased people - all on behalf of the relatives. What at first seems to be a job like any other quickly develops into a dark drama with twists and turns. <br/><br/>All you need is your laptop and some basic background info about the “victim” – in this case it’s all about <strong>Jessika</strong>. Access her database and browse her files by typing different search terms. These will give you access to video clips, audio files, notes, and news articles. Share those with the client and your colleagues to dig even deeper. Use your savvy and combine the facts to unfold the true story of <strong>Jessika</strong>.", "metacritic": null, "released": "2020-08-25", "tba": false, "updated": "2022-11-21T06:09:15", "background_image": "https://media.rawg.io/media/screenshots/764/764997f70e8005612c180ddaa16c136f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 4, "owned": 58, "beaten": 1, "toplay": 2}, "playtime": 3, "achievements_count": 7, "ratings_count": 3, "suggestions_count": 164, "game_series_count": 0, "reviews_count": 3, "platforms": ["iOS", "PC", "macOS", "Linux"], "developers": ["Assemble Entertainment", "Tritrie Games"], "genres": ["Adventure", "Indie"], "publishers": ["Assemble Entertainment"], "esrb_rating": "Mature"}