{"id": 484618, "slug": "lords-villeins-2", "name": "Lords & Villeins", "name_original": "Lords & Villeins", "description": "<h3>Build your Settlement</h3>Use the toolset to create and decorate the houses for your villagers. Expand your manor, build churches, warehouses and all kinds of buildings your civilization needs to prosper. Thanks to your input, no settlement is ever the same.<br/><br/><h3>Split the Land</h3>Take advantage of the procedurally generated world, understand where certain lands are best to be and set your village up in the most efficient way. Or just experiment and go wild!<br/><br/><h3>Manage Families</h3>The family profession is passed between generations and their members are tied to your service. Your production depends on who is living in your settlement so be sure to get to know them well.<br/><br/><h3>Provide Land to the People</h3>Your villagers are tied with their life to your land and will work as long as they are given the opportunity but they can also be the source of problems and may disobey your orders.<br/><br/><h3>Expand your Production Chain</h3>The production chain involves over 100 different resources and 40 professions. Every game is different and so are the industries you end up adopting in your economy.<br/><br/><h3>Prepare for the Winter</h3>Collect production and control the economy. Take too much and your villagers may starve. Take too little and you might be in trouble with the king. Are you willing to risk some lives?<br/><br/><h3>Be Part of the Community</h3>Lords &amp; Villeins has been in development for over two years and everything from the art, code, and music has been done by a single game developer. It still has a long way to go and it would not exist without the support of my friends and the community. I encourage you to be part of it and would love to welcome you on our journey to see this game where it can ultimately be.<br/><br/>", "metacritic": null, "released": null, "tba": false, "updated": "2020-08-27T16:38:04", "background_image": "https://media.rawg.io/media/screenshots/cb1/cb1138f696549db6e7735d71eb4b79cd.jpg", "website": "http://lordsandvilleins.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 5, "owned": 101}, "playtime": 1, "achievements_count": 47, "ratings_count": 0, "suggestions_count": 242, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Honestly Games"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["Honestly Games"], "esrb_rating": null}