{"id": 484675, "slug": "cherry-vx", "name": "Cherry VX", "name_original": "Cherry VX", "description": "<p>This game is for VR only. For those interested in n non-VR version please see the forum for more info.<br />\nPLEASE NOTE THAT CHERRY VX IS NOT CURRENTLY COMPATIBLE WITH WINDOWS MIXED REALITY HEADSETS AND VIVE COSMOS CONTROLLERS. Please go to the &#39;Bug Reporting&#39; sub forum for info on how we plan to fix this.<br />\nLive your sexual cyberpunk fantasies in VR!<br />\nCybersex Redefined<br />\nCherry VX is a private adult entertainment suite featuring amazing models for you to enjoy. After decades of research and development, the technology has finally come far enough for truly compelling sexual experiences with cybernetic humans.Features<br />\nchoose from a selection of gorgeous models<br />\nmodel customization including skins, hair and more<br />\nenter &#39;D-mode&#39; to achieve amazing 1 to 1 &#39;active&#39; interaction — thrust with your hips! (read below)<br />\n7 unique positions for each model to try<br />\nwatch the action from different angles on huge screens in the VX Suite<br />\ngrab and pose limbs<br />\nnon-passive interaction where you lead the action<br />\nrealistic sound, facial expressions and jiggle<br />\nCherrytech has new models in the pipeline that will be available soon...Full Hip Controller Support<br />\nActivate &#39;D-mode&#39; to engage your virtual genitals with the models. Thrust with your hips for compelling 1 to 1 interaction. Full-body tracking is NOT required. Just hitch one of your hand-tracking controllers to the waistband of your clothing to experience &#39;D-mode&#39; action in Cherry VX. Caters for both left and right-handed players. Find out more by visiting the Cherry VX website (link in the right-hand column).<br />\n&#39;D-mode&#39; combined with a men&#39;s sex toy is the ultimate way to experience Cherry VX!<br />\nAll models depicted in Cherry VX are 18 years or older.<br />\nThis game contains explicit sexual content. If you are not legally allowed to view/own content of this nature in your country of residence please do not buy this product. Please read the EULA for more.</p>", "metacritic": null, "released": "2020-07-27", "tba": false, "updated": "2022-04-28T10:19:02", "background_image": "https://media.rawg.io/media/games/ef4/ef4e7905d90aee30c59cb91aa1d15e0e.jpg", "website": "https://www.cherryvx.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 10, "toplay": 1, "dropped": 1, "playing": 1}, "playtime": 1, "achievements_count": 10, "ratings_count": 2, "suggestions_count": 401, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Polybay Digital Entertainment"], "genres": ["Action", "Adventure", "Simulation"], "publishers": ["Polybay Digital Entertainment"], "esrb_rating": null}