{"id": 484637, "slug": "venge", "name": "Venge", "name_original": "Venge", "description": "Explore the un-earthly world of Venge. A world filled with creatures and monsters, trapped and desperate for a way out. The world does weird things to your head, blink to get rid of it. Most of it. Will you be able to escape the world of Venge?<br/>\n<br/>\r\nYour anniversary is coming up soon, you don't have any more nor a gift. However, a local ad drops a paper by, inside you learn that you can receive a $10,000 reward if you find some studio, easy right? And so you go, will you be able to find the studio and make it back?<br/>\n<br/>\r\nThis game contains a variety of art styles and creatures. From exploring an abandoned building haunted by stalking ghosts to parkouring through a foggy cave, the main game is split into different lands, each with their own bosses and mechanics. Each land is different and offers unique mechanics and gameplay. With a flashlight in hand, you must find your way back home and stay alive.<br/>\n<br/>\r\nAct 0 is an introduction to the game, you learn the backstory to Act 1. You'll learn who you play as and why you should go. It is a shorter act, but important nonetheless. Act 0 takes about 10-30 minutes to play.<br/>\n<br/>\r\nAct 1 starts off slowly. You can explore by your own free-will, take your time, explore around. As you explore, you'll be haunted by the horrors of the remains of Rotnic Entertainment. The game will then quickly pick up the pace and you will start to learn the crazy world of Venge. You'll solve some simple puzzles as you are introduced to 5 unique bosses. Each boss has its own unique art style and mechanics. Act 1 takes about 1-3 hours to play.<br/>\n<br/>\r\nAct 0 - Free (Demo)<br/>\r\nAct 1 - $5<br/>\r\nAct 2 - In Development<br/>\r\nAct 3 - Not Released<br/>\r\nAct 4 - Not Released<br/>\r\nAct X - Not Released<br/>\n<br/>\r\n=======<br/>\n<br/>\r\nVenge is an indie game created by Ekrcoaster, this game contains 6 Acts (2 released currently) and plenty of unique minigames that build off of the main game. The game is replayable with multiple endings and sequences of events. The game starts slow but steady, as the game goes on, it builds in intensity as you discover more and more. Explore and battle creatures unlike you've ever seen. Each one different and each one challenging. This game learns as you play and adjusts itself accordingly to give you the best experience. Each new act will come with new adventures and so much more. <br/>\n<br/>\r\n=======", "metacritic": null, "released": "2020-07-28", "tba": false, "updated": "2022-11-26T22:55:39", "background_image": "https://media.rawg.io/media/screenshots/48f/48f2e6c08e13739fb235bfb49a744ce6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1}, "playtime": 0, "achievements_count": 13, "ratings_count": 1, "suggestions_count": 291, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "macOS"], "developers": ["Ekrcoaster"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Ekrcoaster"], "esrb_rating": null}