{"id": 484647, "slug": "united-command", "name": "UNITED COMMAND", "name_original": "UNITED COMMAND", "description": "UNITED COMMAND is a military base building real time strategy game with a two player cooperative multiplayer campaign.<br/><br/>Drop into a mission and fight side by side with a friend against the enemy AI in this near future military real time strategy game.<br/>It's possible to play solo but the game was designed with two player cooperation in mind. (2 VS AI).<br/>You can play with a friend or another player on Steam using the lobby mechanism.<br/><br/>There have not been too many co-op RTS games in recent years with a pure focus on their campaigns which is why we wanted to make one!<br/><br/>Starting from your headquarters you will use your construction dozer to build out your base. You will need a refinery and harvesters to gather resources to fund the construction of your units, their production structures and your base defenses. Construct a variety of ground and air units (tanks, infantry, aircraft, rocket artillery, helicopters). <strong>Note: The game currently has no naval units.</strong><br/><br/>Construct blast walls and defensive towers to repel attacks on your base and that of your ally.<br/><br/>UNITED COMMAND features a variety of missions thoughout its linear campaign that will allow you to explore your options for teamwork with a friend.<br/><br/><strong>Note: The game currently has no single player skirmish mode or player versus player mode</strong> so if you are looking for that experience please seek it elsewhere. (There are plenty of options!).<br/><br/>The early access release features a 7 map cooperative campaign that includes several sequential briefings, mission maps and objectives. We provide weekly updates and draw upon feedback from our playtesters and users to provide gameplay improvements, additional content, units and campaign missions, achievements etc.<br/><br/>All sales revenues will be reinvested into expanding the player base and funding additional content for at least the first year.<br/><br/>Thank you COMMANDER for taking an interest in our game!", "metacritic": null, "released": "2020-08-05", "tba": false, "updated": "2020-08-27T17:00:58", "background_image": "https://media.rawg.io/media/screenshots/e85/e859f8cdca8de582de7f2e1f4ea257c5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 362, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["UNITED COMMAND"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["UNITED COMMAND INTERNATIONAL"], "esrb_rating": null}