{"id": 484677, "slug": "men-bang", "name": "Men Bang", "name_original": "Men Bang", "description": "<h3>Get ready to become a big-shot adult-film producer and get jaw-dropping studs on video and into your bed!</h3><br/><strong>Your mission is clear! </strong><br/><br/>Film as many raunchy, crazy and wild videos as you can, and become the naughtiest film maker in town! <br/>Your rewards will get bigger and better the more studs you seduce. From dashing photos to heart pumping videos, all sorts of sexy opportunities await you to experience first-hand. <br/>But keep in mind that success doesn’t come by easily as you’ll have to take on any job that will put your seduction skills to the test. <br/>Get these yummy hunks to film some smoking hot scenes for you, and fill your pockets with some serious dough! <br/><br/><strong>Will you accept the challenge of getting these Adonises to bend to your every desire?</strong><br/><br/><h3>Key features</h3><br/><br/><ul><li>Scenarios that will keep you on your toes! Disguise yourself as a masseur, casting agent, cab driver, or a wide number of other job titles that will give you easy access to tons of hot studs!<br/></li><li>More than 18 hunks modeled after real adult video stars to have fun with, each with their own sexy look and entertaining, unique personality!<br/></li><li>The charmer takes it all! Seduce your handsome beefcakes by taking them on fake dates or smooth talking them with fake stories, but remember to always keep your steamy massages real!<br/></li><li>Build an adult entertainment empire, and enjoy the perks that come along with it!</li></ul>", "metacritic": null, "released": "2020-08-18", "tba": false, "updated": "2022-11-05T23:25:41", "background_image": "https://media.rawg.io/media/screenshots/1d3/1d3ff7c0003003b27e71215b5623a9f6.jpg", "website": "https://store.steampowered.com/publisher/Nutaku", "rating": 3.67, "rating_top": 5, "added_by_status": {"owned": 103, "toplay": 1, "playing": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 5, "suggestions_count": 330, "game_series_count": 0, "reviews_count": 6, "platforms": ["PC"], "developers": ["Timeless SP"], "genres": ["Casual"], "publishers": ["Nutaku Publishing"], "esrb_rating": null}