{"id": 484653, "slug": "stopgate", "name": "StopGate", "name_original": "StopGate", "description": "StopGate visual novel is created by the community, without the involvement of professionals. This is not just a fanfiction about the authors of the StopGame game portal. Although the game is packed to capacity with local memes and references, this is a completely independent story that will take you to a world where magic and technology coexist.<br/><br/>The main character of StopGate finds himself in a very strange world and, together with the player, gets to know its customs, laws and, of course, inhabitants. All characters in the game are drawn in slightly different styles, because all authors on StopGame are different and individual in themselves.<br/><br/>Before entering a world full of adventure, you will need to customize your character. You will be offered a choice of 7 unique races and 8 genders. Plus, you can choose your hero's magic ability. All of this will affect the game in one way or another. Or it won't.<br/><br/><br/><strong>Game features</strong><br/><br/><ul><li>Fully dynamic static environment<br/></li><li>The ability to play in the window<br/></li><li>Flexible configuration of window modes<br/></li><li>Esсape key can skip the whole game<br/></li><li>Calling \"Menu\" sometimes skips one line of dialogue<br/></li><li>The game is saved in random locations</li></ul>", "metacritic": null, "released": "2020-09-01", "tba": false, "updated": "2022-10-04T17:00:49", "background_image": "https://media.rawg.io/media/screenshots/65d/65dd5df7727da88eb7d12c0ac5378da0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 4, "beaten": 1, "toplay": 1, "dropped": 2, "playing": 1}, "playtime": 0, "achievements_count": 7, "ratings_count": 2, "suggestions_count": 270, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Anton Pauli"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Anton Pauli"], "esrb_rating": null}