{"id": 484682, "slug": "aeon-drive", "name": "Aeon Drive", "name_original": "Aeon Drive", "description": "Teleport your way through time itself! Instead of using the usual try/die/repeat loop of most video games, Aeon Drive features a unique time-warping system that saves players the frustration of repetition and keeps the challenge fresh. Is this level too hard? No problem, just recharge your timer before you run out of time and get those few seconds you need to beat the level. Run out of time-warping capsules and you will be on your own. Obstacles, enemies, and falls are your worst enemy, as time is always slipping away…<br />\nTeleport through lasers, spikes, saws and many other dangers, crouch-dash at the last moment to evade that incoming shot and run through more than 80 levels across several areas of the city of Barcelona where everyone is out to get you. Jump through the rooftops of las Ramblas, keep dashing with awesome vistas of Arc de Triomf, Colon, and the Torre Glòries, fight for your life in Park Güell and don&#39;t think just cause you reach the beach you can rest!<br />\nSpeed-running platformer mechanics.<br />\nEye-catching quality synthwave pixel art style.<br />\nEnjoy a sweet and shooty holiday in a cyberpunk version of tourist darling Barcelona.<br />\nAdvanced scoring system that enables long term replayability.<br />\nReal-time difficulty adjustment – collect time-warping devices and use them strategically!<br />\nCompete against friends and Ashajuls through Discord integration and Steam Leaderboards.<br />\nStreaming mode to share your exploits with the rest of the galaxy.<br />\nAeon Drive has been nominated to the Valencia Indie Awards 2020, Game Connection San Francisco 2020, Courage XL at GDC and the European Game Showcase at GDC.</p>", "metacritic": 74, "released": "2021-09-30", "tba": false, "updated": "2023-04-08T17:57:21", "background_image": "https://media.rawg.io/media/screenshots/39d/39d4aeb2ccc0e2f8f5825637cab20bdc.jpg", "website": "http://discord.gg/RfKxxFE", "rating": 0.0, "rating_top": 3, "added_by_status": {"owned": 26, "beaten": 2, "toplay": 4, "dropped": 1, "playing": 1}, "playtime": 4, "achievements_count": 25, "ratings_count": 4, "suggestions_count": 315, "game_series_count": 0, "reviews_count": 5, "platforms": ["Xbox One", "PC", "Nintendo Switch", "PlayStation 4"], "developers": ["2Awesome Studio"], "genres": ["Action", "Indie", "Platformer"], "publishers": ["2Awesome Studio"], "esrb_rating": null}