{"id": 484651, "slug": "delphyq", "name": "Delphyq", "name_original": "Delphyq", "description": "Delphyq is a Real-time/Pause Strategy &amp; Tactics game that puts you on the seat of a <strong>Mastermind</strong> requiring you to analyze each situation, evaluate the available resources, choose the missions, plan the attack and execute the plan.  Delphyq aims to provide its players with a more realistic tactical combat experience (not found in any turn-based strategy game) with the implementation of a Real-Time/Pause system...because real combat does not happen in turns.<br/><br/><br/><br/><br/><br/>Play the role of an enigmatic mastermind in command of an elite, hand-picked group of individuals called the Operatives. The world is ruled by an oppressive corporate armistice known as The Balance, and it is your job to bring it down at all costs.<br/><br/><br/><br/><br/><br/><ul><li>A Real-Time/Pause mechanic that allows the player to act &amp; react to any given situation at any given time<br/><br/><br/><br/></li><li>Dynamic Cover System that benefits the player who approaches the game with sound tactics being used in real-life situations. Minimal exposure behind cover means less chance of getting hit and less damage. Get caught outside of cover and you’ll feel the consequences of your mistake.<br/><br/><br/><br/></li><li>A Planning Stage where the player can create and elaborate scheme how to approach the mission and prioritize objectives. ]Unique Class Abilities that allow your operatives to have their respective specializations within the team.<br/><br/><br/><br/></li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2020-08-27T17:04:23", "background_image": "https://media.rawg.io/media/screenshots/791/791974dc4d898d57cfddc8edb7e84bdf.jpg", "website": "http://delphyq.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 548, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dusk Wave Arts"], "genres": ["Action", "Strategy", "Indie"], "publishers": ["Dusk Wave Arts"], "esrb_rating": null}