{"id": 484640, "slug": "20-minute-metropolis", "name": "20 Minute Metropolis - The Action City Builder", "name_original": "20 Minute Metropolis - The Action City Builder", "description": "Construct the infrastructure to rebuild civilization. Set up supply lines, mine skyscrapers for plastics, and find a place to process all the poop your people will generate. You have twenty minutes.<br/><br/><h3>FEED YOUR PEOPLE</h3><br/>Farms generate food—those are the green dots you see below. All food is bright green. That's how you know it's fresh.<br/><br/><h3>CONVERT FOOD TO WORK</h3><br/>Build apartments. People will take in food and generate work. And they'll poop. But you don't have to worry about the poop right now.<br/><br/><h3>TRAILS TRANSPORT RESOURCES</h3><br/>Trails will convey resources like food and work between buildings. There's a limit to the volume of resources they can carry at any given time, so you'll need to plan your layout carefully.<br/><br/>Extend your reach by cutting through forest and... Uh oh...<h3>YOUR APARTMENTS ARE FULL OF POOP</h3>So, you build a landfill to take care of the poop. Where was I? Cut through forest to get to ancient skyscrapers, which you'll mine for metals and plastics—you're an ace recycler!<h3>YOU HAVE DEFORESTED THE FOREST</h3>Time to expand to other forests! But try not to tear them all down. Set up a water turbine and energy transmitters to power your search for more trees. And build some parks for points. Now you're cooking. Build a dozen high rises. More parks!<h3>AND YOU'RE OUT OF TIME</h3>You just rebuilt an entire civilization in 20 minutes! That's no mean feat. Heck, it's going to take folks 30 minutes to do it in the sequel.<h3>WELCOME TO 20 MINUTE METROPOLIS!</h3>", "metacritic": null, "released": "2019-03-01", "tba": false, "updated": "2022-12-26T06:28:05", "background_image": "https://media.rawg.io/media/screenshots/33a/33a737f7a75c3f4565503ae617a98050.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 14, "dropped": 1, "playing": 1}, "playtime": 1, "achievements_count": 21, "ratings_count": 1, "suggestions_count": 556, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Dejobaan Games"], "genres": ["Strategy", "Simulation"], "publishers": ["Humble Bundle", "Dejobaan Games"], "esrb_rating": null}