{"id": 484649, "slug": "enlightened-sentinel", "name": "Enlightened Sentinel", "name_original": "Enlightened Sentinel", "description": "An exciting and memorable adventure in a diverse, thought-out world, where each creature counts down the days until the Storm - the end of existence and the beginning of a new one. If during the Storm the source of power that feeds the entire kingdom of Isdar with magic will be damaged, everyone except the undead will fall. Perhaps the Enlightened One will be able to deal with undead, with a sword and magic pave the way for the salvation of Isdar.<br/><br/>A special reward during Early Access awaits in the chest in the Royal Castle!<br/><br/><br/>Enlightened Sentinel is an action-RPG that combines spectacular combat and methodical exploration. The medieval fantasy setting is presented in a low polygon style, which makes it beautiful and allows to relax. At the same time, rivals will not let you get bored, because each requires its own approach. Of course, monsters do not wait for the hero at every turn, but they know a lot about ambushes.<br/>The project combines the classic \"dungeons-and-plains\" exploration style with a modern hit and dodge combat system.<br/><br/><br/><br/>Features:<br/>-Colorful journey combined with epic combat<br/>-Exciting story adventure<br/>-Libraries are full of books and books are full of stories<br/>-A world filled with surprises and mysteries<br/>-The outcome of the battle depends on the combination of abilities and magical artifacts<br/>-Maybe it is worth looking around more closely. Sometimes even a nondescript piece of paper or a word dropped by accident leads to adventure<br/><br/>Also visit our website for more detailed information.", "metacritic": null, "released": null, "tba": false, "updated": "2020-08-27T17:02:34", "background_image": "https://media.rawg.io/media/screenshots/e2f/e2f780827ef870201df262c83e70eed9.jpg", "website": "https://www.shieldomstudio.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 256, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Shieldom Studio"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Shieldom Studio"], "esrb_rating": null}