{"id": 484790, "slug": "siralim-ultimate", "name": "Siralim Ultimate", "name_original": "Siralim Ultimate", "description": "<p>Siralim Ultimate is a monster-catching, dungeon-crawling RPG with a ridiculous amount of depth. Summon over 1000 different creatures and travel through randomly generated dungeons to acquire resources, new creatures, and loot.<br />\nIf you’re looking to compare Siralim Ultimate to other games, you might think of it as Pokemon meets Diablo, or more accurately, Dragon Warrior Monsters meets Path of Exile.<br />\n1000+ creatures to collect<br />\nFuse your creatures together - the offspring inherits its parents’ stats, traits, and even the way they look!<br />\nRandomly generated dungeons spanning 21 tilesets<br />\nCustomize your castle with thousands of different decorations<br />\nEngage in strategic 6v6 battles<br />\nCraft Artifacts and Spell Gems for your creatures<br />\nChoose from one of 15 specializations for your character and earn perks that change the way your creatures fight in battle<br />\nInsane amount of post-story content that will keep you engaged for thousands of hours (yes, really!)<br />\nAn ever-changing world that is sure to keep the game feeling fresh even for the most devoted of players<br />\nFor the last century, the kingdoms of Nex and Siralim have enjoyed a prosperous alliance fueled by generous trade, unbiased distribution of territory, and a common goal to make the lands of Rodia safe for its inhabitants. Together, the two kingdoms have grown to become the most powerful in the world. But as we all know, power can corrupt even the most virtuous of souls.<br />\nAs the ruler of Siralim, you just received word that King Andrick of Nex has obtained the Ultimate Nether Orb - a powerful relic that can be used to control the gods themselves. Worse yet, Andrick intends to manipulate the gods to aid him in conquering Siralim. You are left with no choice but to wage war on Nex and take back the Ultimate Nether Orb so that it will not be used for ill purposes.<br />\nIn Siralim Ultimate, you’ll encounter over 1000 different creatures. Each creature has a unique stat spread, as well as its own, unique trait. And don&#39;t worry - none of these creatures are re-skins or re-colors!<br />\nA trait is a passive effect that affects that creature’s battle capabilities. For example, the Firewound Angel’s “Pyre” trait greatly increases the amount of damage it deals with basic attacks, and its attacks also afflict the target with the “Burning” debuff which causes damage over time.<br />\nMost creatures are obtained by encountering and defeating them in the wild. Afterward, you’ll be able to summon them and use them in your party. Other creatures are obtained as quest rewards or by participating in various in-game activities.<br />\nPlayers can also fuse their creatures together. The offspring inherits the stat spreads of both parents, as well as its parents’ traits. In addition, the offspring will take on the physical appearance of both of its parents. There are over a million possible combinations, ensuring that no two players will have the same team!<br />\nIn Siralim Ultimate, you’ll spend most of your time adventuring through randomly generated dungeons called Realms. There are 21 different tilesets for these Realms, and each one offers different creatures to collect, items to find, and secrets to uncover.<br />\nWhen you enter a Realm, you’ll also receive a randomly generated Realm Quest. These quests are short, bite-sized objectives that reward players with treasure upon completion.<br />\nPlayers can collect thousands of different decorations to adorn their castle. You can also change the floor and wall styles, and even unlock different songs that can be played in your castle.<br />\nYou can also take on Projects to unlock new castle features, such as a battle arena, a tavern where you can fight against other players’ creatures, and much more.<br />\nBattles are turn-based and pit your six creatures against six enemy creatures. Each creature takes a turn in a certain order that is determined by their Speed stat.<br />\nDuring a creature’s turn, they can do any of the following:<br />\nAttack: deals damage to the target based on the attacker’s Attack stat.<br />\nCast: choose from one of the creature’s equipped spells to devastate your enemies or boost the strength of your party.<br />\nDefend: drastically reduces the amount of damage the creature will take until the start of its next turn.<br />\nProvoke: enemies will be forced to target the creature until the start of its next turn.<br />\nThese actions all interact with your creatures’ traits as well. For example, one trait might cause a creature to deal damage to all enemies after it Defends.<br />\nAfter you win a battle, your creatures will gain experience points. In addition, you’ll receive resources (currency) and maybe even some items.<br />\nAt the start of the game, players can choose from one of 15 different specializations for their character. Each specialization offers a unique list of unlockable perks that change the way your creatures fight in battle.<br />\nHere is a list of specializations that are currently in the game, along with a brief description of how they work:<br />\nAnimator - As an Animator, you will always have a unique creature in your party called Animatus. Your entire battle strategy will likely focus on this creature. You can empower your Animatus, and even use your other creatures to make it stronger in combat.<br />\nCabalist - As a Cabalist, you&#39;ll enable your creatures to cast spells that they normally wouldn&#39;t have access to. While other people&#39;s creatures might run out of Spell Gem Charges, you&#39;ll be able to keep your creatures well-stocked with fresh Spell Gems at the start of every battle.<br />\nCleric - As a Cleric, you&#39;ll specialize in healing abilities, as well as buffing, resurrection, stat-boosting effects, and providing your creatures with protective barriers. Your creatures will be extremely difficult to kill.<br />\nDefiler - As a Defiler, you&#39;ll specialize in debuffs and stat-reducing effects. Enemies will be so weak that your party will be able to easily pick them off, even if they were originally much more powerful than your creatures.<br />\nDruid - As a Druid, you&#39;ll probably only want to have one (or two, later on) creatures in your party. Your creatures will gain massive benefits for being part of a smaller party.<br />\nEvoker - As an Evoker, you&#39;ll empower your creatures&#39; spellcasting capabilities. Your creatures will be able to cast the same spell multiple times in one turn, and these spells will be much stronger than if they had cast them without your guidance.<br />\nHell Knight - As a Hell Knight, you&#39;ll favor creatures that specialize in attacking. Hell Knights grant their creatures an increased chance to deal critical damage and cause a variety of effects to occur when this happens. Hell Knights are surprisingly adept at spellcasting in a pinch, as well.<br />\nInquisitor - As an Inquisitor, you&#39;ll have a solution at your disposal for every problem you encounter. In addition, Inquisitors are able to use healing effects for offensive purposes - for example, when your creatures heal enemies, they instead cause damage to them.<br />\nMonk - As a Monk, you&#39;ll boost your creatures&#39; chance to Dodge attacks and spells. When your creatures Dodge, they&#39;ll unleash a devastating counter-attack on the enemy.<br />\nNecromancer - As a Necromancer, you&#39;ll summon minions to aid your creatures in battle. These minions can do all kinds of things to support your creatures - they can cause damage, boost your creatures&#39; stats, debuff enemies, and much more.<br />\nPaladin - As a Paladin, your creatures will be able to endure even the most powerful of attacks. Each time your creatures take damage, they&#39;ll also damage their enemies.<br />\nReaver - As a Reaver, your creatures will gain massive benefits in combat as battles continue to drag on. If your creatures manage to survive for just a few extra turns, they&#39;ll be able to devastate your enemies.<br />\nSorcerer - As a Sorcerer, you&#39;ll support your creatures by debilitating their enemies from afar. Generally, your enemies won&#39;t be able to act for the first few turns in battle as long as you&#39;re around.<br />\nTribalist - As a Tribalist, you&#39;ll want to assemble a party of creatures that belong to the same race. This will provide them with significant benefits that are exacerbated by their racial synergies with each other.<br />\nTrickster - As a Trickster, you&#39;ll heavily inconvenience your enemies by preventing them from taking action. You&#39;ll also gain the ability to manipulate the element of luck - for example, if a positive effect has a chance to activate but fails to do so, you can try again.<br />\nEventually, you can unlock all of these specializations on the same save file and quickly swap to them whenever you want.<br />\nEach of your creatures can equip an Artifact. Artifacts provide your creatures with various bonuses, including stat boosts, on-damage effects/procs, traits, and even the ability to automatically cast spells when certain conditions are met.<br />\nIn order to obtain an Artifact, you must first Forge one at the Blacksmith. After that, you can Socket your Artifacts with crafting materials to add new properties to them. There are over 1000 crafting materials to be found, and they all provide different properties. You can Upgrade your Artifacts to unlock new socket slots, and even Brand your Artifacts to give them a custom name.<br />\nYour creatures can equip Spell Gems which allow them to cast the spell contained within the gem. There are more than 400 different spells for players to find.<br />\nIn order to obtain Spell Gems, you must first find an Inscription that acts as a recipe to teach you how to Craft the Spell Gem. You can Upgrade your Spell Gems to unlock Enchantment slots, and then you can use these slots to add properties that affect the way the spell works.<br />\nFor example, you can add a modifier to a Spell Gem that allows it to deal damage to an additional enemy. Another interesting property is called “Magnetic”, which causes the spell to be more powerful for each creature in your party that has that same spell equipped.<br />\nUnlike other games, Siralim Ultimate allows you to decide when you’ve finished it. For that reason, we’ve packed the game with a ridiculous amount of content to explore, items to collect, achievements to earn, and so much more. Many players have enjoyed the previous Siralim games for thousands of hours (yes, really!) and Siralim Ultimate is going to be even larger in scale. There will always be something new for you to collect, no matter how long you’ve been playing!<br />\nEach of the 21 realms in Siralim Ultimate is ruled by a different god. Players can earn Favor with these gods to increase their Favor Rank. As your Favor Rank with each god increases, you’ll be able to earn new items, creatures, decorations, and much more.<br />\nAlmost every gameplay system in Siralim Ultimate is meant to last players forever - or at least for a very, very long time. For example, your creatures do not have a level cap, so you can continue to level them up and make them stronger indefinitely. Similarly, enemies can scale infinitely as well.<br />\nPost-story content is filled to the brim with countless activities for you to partake in to make your creatures more powerful. Here are a few examples:<br />\nTake on randomly generated side quests to obtain unique creatures and items.<br />\nDraft a team of creatures in the arena and see how many battles you can last before your final creature falls.<br />\nFight against other players’ creatures in the tavern.<br />\nBattle against the gods themselves! These super boss-style fights are among the most challenging in the game… but also the most rewarding.<br />\nUnlock the relics of the gods and upgrade them indefinitely to unleash devastating powers upon your foes.<br />\nPartake in mini-games such as slot machines, keno, scratch cards, and even a board game that rewards you with exclusive items.<br />\nDefeat enemies to gain Knowledge about them, unlocking additional benefits when you next encounter that creature in the wild.<br />\nThe list goes on and on and on, and we have plans to add even more end-game content in the future as well. The point is, Siralim Ultimate isn’t a game where you’ll finish the main storyline and then call it quits. There’s so much content for you to discover afterward that it’s almost ridiculous!</p>", "metacritic": null, "released": "2021-03-12", "tba": false, "updated": "2023-08-09T17:42:04", "background_image": "https://media.rawg.io/media/screenshots/568/568694bb1424e172d39b34fdbed4483b.jpg", "website": "http://www.thylacinestudios.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 50, "toplay": 2, "playing": 1}, "playtime": 4, "achievements_count": 314, "ratings_count": 2, "suggestions_count": 282, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC", "iOS"], "developers": ["Thylacine Studios"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Thylacine Studios"], "esrb_rating": "Teen"}