{"id": 484716, "slug": "operation-tango-demo", "name": "Operation: Tango - Demo", "name_original": "Operation: Tango - Demo", "description": "This DEMO contains the introduction chapter to Operation: Tango. <br/><br/>Operation: Tango is an espionage-themed cooperative adventure challenging you and a friend to complete dangerous missions across the globe in a high-tech near-future world.<br/><br/>As an exclusive team of two, you and your partner will become AGENT and HACKER, working together to infiltrate, investigate, and eradicate the forces threatening the free world. Work in tandem from two different points of view with only your voice to link you. Teamwork is crucial, and communication is key!<br/><br/>NOTE: Operation: Tango requires both players to have access to a PC-compatible microphone.<br/><br/><h3>Superior Teamwork</h3>Be observant, keep talking, and make sure nothing explodes. Combine complementary skill-sets to overcome intense challenges against \"impossible\" odds.<h3>Authentic Espionage</h3>Exotic locations filled with thrilling scenarios create classic “Hollywood” spy moments. Experience the ultimate secret agent fantasy!<h3>Technological Toys</h3>Enjoy the visual splendor and technological advances of a fully-connected augmented world.<h3>Innovative Brainteasers</h3>Overcome obstacles in ways you’ve never dreamed of. Each mission features unique challenges, keeping you and your partner on your toes while delivering some of the most satisfying \"eureka!\" moments in modern gaming.", "metacritic": null, "released": null, "tba": false, "updated": "2023-08-16T15:07:08", "background_image": "https://media.rawg.io/media/screenshots/5cf/5cf43b40ffdcf2f5dd985c361d2e7755.jpg", "website": "http://www.operation-tango.com", "rating": 4.25, "rating_top": 4, "added_by_status": {"yet": 1, "owned": 329, "beaten": 11, "dropped": 1}, "playtime": 4, "achievements_count": 0, "ratings_count": 8, "suggestions_count": 121, "game_series_count": 0, "reviews_count": 8, "platforms": ["PC"], "developers": ["Clever Plays"], "genres": ["Adventure"], "publishers": ["Clever Plays"], "esrb_rating": null}