{"id": 484709, "slug": "panzer-crew-vr", "name": "Panzer Crew VR", "name_original": "Panzer Crew VR", "description": "Panzer Crew VR is a deathmatch-style multiplayer battle game of up to four tanks. Each tank is manned by a crew of three players who must work together to survive.<h3>The Commander</h3>The commander is the only player with a full 360 view of your surroundings. Situated atop the turret they must direct the other two players based on the information they have. They are also the only player with access to the radar and scoreboard during the match. The commander must be decisive and an excellent communicator.<h3>The Driver</h3>The driver is dealt a single and crucial role, drive the tank. This may seem simple but the positioning of the tank, the angling of the armour and knowing when to strike forward or go for that flanking maneuver will be the difference between defeat and victory. The driver needs a level head and a feel for the movements of the tank.<h3>The Gunner</h3>When push comes to shove, it's all down to the gunner to land the killing blow. The faster they can load and the more accurately they can aim will make all the difference in that to-the-death final duel. The gunner must have a steady hand and perfect knowledge of a tank's armour.<h3>Features:</h3>- Three-player crew per tank<br/>- Up to 12 players per match in four tanks<br/>- Varied armour thickness and effective thickness by angle of hit<br/>- Voice chat locally within the tank and to other tanks by radio (commander only)<br/>- Time limit, kill limit or unlimited match lengths<br/>- Physics-based tank movement<br/>- Ramming and impact damage<br/>- Four maps currently available.", "metacritic": null, "released": "2020-07-27", "tba": false, "updated": "2020-08-27T17:38:16", "background_image": "https://media.rawg.io/media/screenshots/a3a/a3aa14e57c751a30bc21a19e5ad0c0bc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 84, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ian David Elder"], "genres": ["Action", "Indie"], "publishers": ["Ian David Elder"], "esrb_rating": null}