{"id": 484814, "slug": "fobia-st-dinfna-hotel", "name": "FOBIA - St. Dinfna Hotel", "name_original": "FOBIA - St. Dinfna Hotel", "description": "<p>Fobia - St.Dinfna Hotel is a first-person psychological horror game focused on environment exploration, survival, and puzzles solving.<br />\nControl Roberto, a young journalist, who seeks to boost his career investigating supernatural events in Santa Dinfna Hotel, in the city of Treze Trilhas. An imponent and old construction that hides many secrets and mysteries.<br />\nExplore scary environments and solve challenging puzzles, at the same time you try to survive from unknown dangers. Feel the Fobia!<br />\n- First-person<br />\n- Random puzzles<br />\n- Investigation and clue note system<br />\n- Combine items to improve them<br />\n- Release new mechanics during the gameplay<br />\n- Survive the Fobia apocalypse<br />\nIn a small town in Santa Catarina, called Treze Trilhas, there&#39;s the Santa Dinfna Hotel, an imponent and old construction, known to be the center of many supernatural and unexplainable events.<br />\nRoberto, a young journalist, along with Stephanie, a supernatural stories fanatic, investigates and researches the cases reported in the town. Getting to Treze Trilhas, Roberto faces a very different reality he was expecting, an old, but an apparently average hotel. But after a few days of investigation, collecting statements and documents, he finds himself lost in the middle of a series of unexplainable events, where the survival is as important as the truth.</p>", "metacritic": 73, "released": "2022-06-28", "tba": false, "updated": "2024-03-16T10:49:36", "background_image": "https://media.rawg.io/media/games/ecd/ecd56f199e07adc72e6a5b6a26ec8a2a.jpg", "website": "https://www.fobiaojogo.com", "rating": 3.43, "rating_top": 3, "added_by_status": {"yet": 23, "owned": 199, "beaten": 8, "toplay": 29, "dropped": 5, "playing": 3}, "playtime": 4, "achievements_count": 46, "ratings_count": 12, "suggestions_count": 524, "game_series_count": 0, "reviews_count": 14, "platforms": ["Xbox Series S/X", "PC", "PlayStation 4", "Xbox One"], "developers": ["Pulsatrix Studios"], "genres": ["Indie"], "publishers": ["Pulsatrix Studios"], "esrb_rating": null}