{"id": 484889, "slug": "dragon-spirits-prologue", "name": "Dragon Spirits: Prologue", "name_original": "Dragon Spirits: Prologue", "description": "The demo version of Dragon Spirits is available on steam now! The full version will come out in 2021 if everything goes well.<br/><br/>In the Prologue part of this game, you will enjoy the first 3 weeks of student life in the Dragon Spirits Academy and there are also many side stories to explore and experience.<br/><br/>Join the Community (Click on the image below):<br/><br/><br/>While constantly working on a video game without any rest, a college student who's about to graduate quietly slipped into slumber several times.<br/>His workmate, as well as his childhood best friend, advised him to take some decent sleep, but he simply wanted to get the game done before graduation to prove himself.<br/><br/>However, the mystery is that, in those lucid dreams, he found himself in the game he's been working on —— a fantasy world of Dragon Spirits.<br/>His memory of the real world fades in and out among these dreams.<br/>He found himself became as his younger self and met his childhood best friend again. They are all junior school students here, learning how to master the power of Dragon Spirits with the help of their teachers and many other classmates.<br/><br/>Déjà vu, he just cannot understand why everything felt so familiar and miraculous.<br/><br/><h3>Features:</h3><br/><ul><li>Adapted from a self-made board game created by one of the developers. She designed it at her very young age. Her teacher laughed and said that it is absolutely worthless and impossible to become a real video game. Many years later, she made this game for celebrating her graduation from college.<br/></li><li>Catch, Train, Battle! The core of its game mechanic is inspired by the Pokémon series. Rest assured that our unique design will deliver a distinctive experience.<br/></li><li>Tactical, challenging, and exciting real-time combat system. You need to choose the 4 skills for every Dragon Spirit in your team to create an optimized combination for battles, you must know when would be the best to use them.<br/></li><li>There are plenty of side quests and challenges to discover and conquer, but be sure to enjoy your colorful school life. You can even reveal the secrets hidden among the history of Dragon Spirits.<br/></li><li>100+ beautiful and characteristic illustrations of Dragon Spirits from various talented artists.</li></ul>", "metacritic": null, "released": "2020-08-26", "tba": false, "updated": "2020-08-27T19:37:37", "background_image": "https://media.rawg.io/media/screenshots/df3/df3b0bf48d20d2f05957a3700441d50d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 337, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["FHNBHJ"], "genres": ["Adventure", "RPG", "Strategy", "Indie"], "publishers": ["indienova"], "esrb_rating": null}