{"id": 484862, "slug": "dont-be-afraid-the-first-toy", "name": "Don't Be Afraid - The First Toy", "name_original": "Don't Be Afraid - The First Toy", "description": "<strong>\"The First Toy\" is a standalone story that shares a word with “Don’t Be Afraid” , a horror adventure game.</strong><br/><br/>Take on the role of a child, and try to survive in the terrifying property of the psychopathic kidnapper. Keep your cool to get out of the madman's clutches. Nothing is as it seems here, but don't be afraid...unless you already are?<br/><br/><br/><br/><br/>Your name is Jamie, you are young boy and this story will completely change your life. <br/>If you survive...<br/><br/>You wake up in a terribly dark cellar, surrounded on all sides by terrifying noises and strange unknown items that you didn't even dream of in your nightmares. You are vulnerable and completely alone. Shreds of memories, without any logical connections, flash inside your head. Is someone detaining you? How did you get here? <br/><br/>With every step you make, you will get further from your innocent past. The frightening truth awaits. <br/><br/>The fate of an victim is sealed once it is in the hands of a sadistic psychopath.<br/>If you want to survive, grow up. Quickly.<br/><br/><br/><br/><br/><ul><li> Take on the role of a child and see how he sees the world,<br/></li><li> Find the notes describing the story and find out who is responsible for your kidnapping,<br/></li><li> Survive a clash with a terrifying psycho,<br/></li><li> Solve the riddles that will get you out,<br/></li><li> Try to escape the psychopathic killer.</li></ul>", "metacritic": null, "released": "2020-07-02", "tba": false, "updated": "2020-08-27T19:21:39", "background_image": "https://media.rawg.io/media/screenshots/e1d/e1ddec9f0bbf4bf1aea1983104a85225.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 4, "ratings_count": 0, "suggestions_count": 403, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Broken Arrow Games"], "genres": ["Adventure"], "publishers": ["Hydra Games"], "esrb_rating": null}