{"id": 484804, "slug": "bright-days-in-quarantine", "name": "Bright Days in Quarantine", "name_original": "Bright Days in Quarantine", "description": "It is hard to adapt to such drastic changes to our daily lives in a world where most of us need to stay at home to help curb a virus pandemic. Keeping a house organized during quarantine can be difficult, especially when you have some remote work to do too. But don’t freak out. It's all about dividing the household chores between all family members.. When is time for one to work, is time for you to clean. But wait!<br/>\n<br/>\r\nIn this all of a sudden hurricane of housework and remote work tasks, the only thing you can do is revisit old hobbies and find joy in the small things. Otherwise, you go insane!<br/>\n<br/>\r\nLet's find joy too in this frenetic shelter simulation game. All you have to do is to take great care of the house, doing all the scheduled household chores in a way that you still have some spare time. Through 10 phases with increasing levels of difficulty, sweep the floor, dust the furniture, put the trash away, do the laundry, and make sure the fridge is always full! But remember, after doing all the chores, you need to dedicate some time to the little joys available in your new routine BEFORE the clock strikes. If you don’t, you go insane, and it’s Game Over.<br/>\n<br/>\r\nIt’s really hard to finish all the scheduled chores before the clock strikes. But between each cleared level, let’s find little pleasures in things that have passed unnoticed through your days before.", "metacritic": null, "released": "2020-07-18", "tba": false, "updated": "2020-08-27T18:38:57", "background_image": "https://media.rawg.io/media/screenshots/947/947d0ad5749ffce91b72680b4d8bd27c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 43, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Delta Arcade"], "genres": ["Strategy", "Simulation", "Casual", "Indie"], "publishers": ["Delta Arcade"], "esrb_rating": null}