{"id": 484815, "slug": "ogre-tale", "name": "Ogre Tale", "name_original": "Ogre Tale", "description": "Once upon a time, Momotaro (a.k.a. Peach Boy) and his allies, Kintaro and Issuntaro, wiped out the tribe of ogres who plagued the Japanese countryside, and everyone lived happily every after.<br/><br/>...Until now, anyway.<br/><br/><br/><br/>Centuries later, Momotaro's descendant -- bored of life as a bar host (!) -- decides to run amok and terrorize the Japanese countryside with mononoke and yokai and all those other Japanese mysticism-related things you've probably heard the tiniest bit about from some anime somewhere. Not because it's his destiny or anything; just because he CAN.<br/><br/><br/><br/>And with the hero now serving as villain, it's time to flip the script and turn the villains into heroes! Or... comparatively less bad villains, at least? Ran, Hana, and Yume -- sisters who are descended from the very ogres Momotaro once took down -- must join forces with a kitty cat named Iroha who serves as their mentor, narrator, and caregiver (?) to rid the world of the pink, peachy menace and his fairytale folkhero-turned-villain flunkies in this action-packed tongue-in-cheek Japanese-inspired beat-em-up other-words-separated-by-hyphens romp-o-rama!<br/><br/>What kind of game is it, you ask? Why, it's...<br/><br/><ul><li>...a 2D sprite-based beat-em-up with multiple playable characters! Three of them, in fact! Play alone, team up with friends in online or offline multiplayer, or mix and match as the spirit moves you!<br/><br/><br/></li><li>...a chance to take out your aggressions on unsuspecting Japanese demons and ghoulies! Unleash ground-shaking combos, counters, and special moves with ease, and chain 'em together to rain devastation upon all who stand in your path!<br/><br/><br/></li><li>...a showcase of weird and wonderful zombies and demons and crows (oh my!) who all want you dead, dead, dead!<br/><br/><br/></li><li>...an RPG, kinda, sorta! I mean, it's got experience, coins, and other loot you can use to strengthen your characters and their skills, so that's all it takes, right? Right?!</li></ul><h3>So get ready; victory is in reach! It's time to go out and</h3>", "metacritic": null, "released": "2020-08-20", "tba": false, "updated": "2020-08-27T18:46:19", "background_image": "https://media.rawg.io/media/screenshots/1ee/1ee6e1f41d8ce6b3b5963bb58e74ce41.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 7}, "playtime": 7, "achievements_count": 64, "ratings_count": 0, "suggestions_count": 443, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MAGES"], "genres": ["Action"], "publishers": ["Degica"], "esrb_rating": null}