{"id": 484898, "slug": "sudden-way", "name": "Sudden Way", "name_original": "Sudden Way", "description": "Sudden Way is a fun and unusual platformer with retro pixel graphics and very simple controls. Take the little hero girl through an unknown and dangerous world full of mysteries and dangerous traps. Help her get out of inhospitable and unusual world and fight with cunning boss. It is he who manages the portals. Because of him, she was away from home. Can the little hero girl go back after passing all the challenges? She really needs your help! Time to go to the adventure!<br/>\n<br/>\r\nRetro graphics were inspired by the best masterpieces of classic arcade games. Amazing pixel style and colorful palette gives the game a special charm. When creating the game was used all the many years of world experience of the best platform games.<br/>\n<br/>\r\nThe game soundtrack takes a special place. These are amazing compositions in the style of classical hip-hop music. It makes the gameplay incredibly stylish and cool. It is exactly what the old retro games were so lacking. All this is implemented in this game.<br/>\n<br/>\r\nTest yourself and your gaming skills! Go through the different levels to the boss! Adventure begins now!<br/>\n<br/>\r\nFeaturing:<br/>\n<br/>\r\n• 25 varied levels<br/>\r\n• Battle with boss<br/>\r\n• Awesome gameplay similar to retro classic games<br/>\r\n• Cute retro pixel art graphics<br/>\r\n• Classic hip-hop music<br/>\r\n• Awesome sound effects<br/>\r\n• Intuitive and simple controls<br/>\r\n• Gamepad supported", "metacritic": null, "released": "2020-07-21", "tba": false, "updated": "2020-08-27T19:43:35", "background_image": "https://media.rawg.io/media/screenshots/034/03457a529c5f62f1af5e0d1b6d578cc0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 217, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Vitali Games"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Vitali Games"], "esrb_rating": null}