{"id": 484876, "slug": "dragonlord-chronicles-mmo", "name": "Dragonlord Chronicles MMO", "name_original": "Dragonlord Chronicles MMO", "description": "With the advent of The Age of Dragons, as warlocks leave countless riches and legends under the stars, each awakened teenager begins his or her own journey. Choose a profession from Warrior, Mage, Mage, Archer, etc. and ride a giant dragon and fight against ancient magical creatures to achieve great things!<br/>The game uses a realistic physics collision engine and a skill ballistic judging system to make combat feedback conform to the laws of real physics.<br/><br/><strong>◆Diverse Giant Dragons◆</strong><br/><br/>More than ten different elemental attributes, different quality dragons can get different elemental attributes in the game, different quality dragons can get different elemental attributes in the game, different quality dragons can get different elemental attributes in the game<br/>Ride the giant dragon and use your powerful dragon skills to put you on top of the game!<br/><br/><strong>◆Game Operation Features◆</strong><br/>Mouse pointing to release skills and attacks<br/>Beginners can use automatic combat to free up their hands; experts can manually operate to dodge skills and look for opportunities to attack, to weaken the weak!<br/><br/><strong>◆Multiple careers◆</strong><br/>Diverse and differentiated occupations<br/>Each career has over 20 skills to choose from, bringing a whole new and different experience.<br/>Gives players a new experience like never before.<br/><br/><br/><strong> ◆ Multiple modes of play◆</strong><br/><br/>Crystal Cave Brawl<br/>Maze Quest.<br/>guild warfare<br/>1V1 Arena<br/>World BOSS<br/>Full Service 1V1 Arena<br/>Full Service 3V3 Arena<br/>Full Service Guild Battle.<br/>Battle of the Dragons<br/><br/><br/><strong> ◆ Diversified equipment ◆</strong><br/><br/>Hundreds of pieces of equipment can be dropped at random in different BOSSes, all of which can be obtained with patience.<br/>Premium sets can be obtained by building equipment, and with patience, anything is possible!", "metacritic": null, "released": "2020-08-05", "tba": false, "updated": "2020-08-27T19:29:39", "background_image": "https://media.rawg.io/media/screenshots/4e3/4e32bd45ba39331ba23241ebbab58b69.jpg", "website": "https://www.facebook.com/Dragonlord-Chronicles-103884868074411", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 675, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Hong Kong Magic GOD"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Casual", "Massively Multiplayer", "Indie"], "publishers": ["Hong Kong Magic GOD"], "esrb_rating": null}