{"id": 484853, "slug": "dog-trainer", "name": "Dog Trainer", "name_original": "Dog Trainer", "description": "It’s time to meet your new adorable puppy! An advanced generator lets you create the dog you always wanted. It’s breed, sex and hundreds of different characteristics are all customizable in order to make your pet one of a kind. But remember - you cannot cheat nature! Some breeds are naturally prone to an active lifestyle, while others just want to chill on a comfortable pillow with you all day, so choose wisely.<br/><br/><br/><br/><br/><br/>Now when you’ve created your new best friend, it's time to learn how to take care of him! Feed him, give him baths and teach him how to behave, so his naughty side doesn’t take over your good boy! You’ll experience all the challenges of owning a dog, as he will need you by his side all the time! At the end of the day, don’t forget what is most important - you, your dog and the special bond you have. Nurture your relationship during every moment you spend together and have fun with your best friend for life!<br/><br/><br/><br/><br/><br/>Start with the basics, like “seat”, “lay down” or “give paw” and work your way to the advanced, almost acrobatic stunts. In order to reach perfection, you and your puppy have to learn how to be a team! Experiment with how and when to reward him or correct his behaviour, so he can learn efficiently while loving and respecting his trainer!<br/><br/><br/><br/><br/><br/>Everyone likes watching cute dogs in funny outfits, right? Well, now’s your chance to trump all the cool photos you’ve seen on the Internet! Choose from numerous items desired by every dog owner. From everyday stuff like collars, leashes, harnesses, and toys to hilarious or elegant costumes. Whether it’s a distinguished tux and top-hat or a spider-like Halloween outfit - your pup will have some style to show off!<br/><br/><br/><br/><br/><br/>Put your training skills to the test and take part in a bunch of competitions with your dog. Prove your pet’s obedience and extraordinary agility in a set of trail runs and guide him to becoming the champion! If your pup is more of a beauty queen, sign up for a beauty contest. Just as new trophies and medals will appear on your shelf, even more, difficult challenges will arise. Show everyone who’s the best trainer!", "metacritic": null, "released": null, "tba": false, "updated": "2020-08-27T19:17:05", "background_image": "https://media.rawg.io/media/screenshots/5fc/5fca1b1e07e2e0606c25f93c3e794207.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 197, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Moonlit"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["Frozen District"], "esrb_rating": null}