{"id": 484976, "slug": "hidden-deep", "name": "Hidden Deep", "name_original": "Hidden Deep", "description": "<p>Hidden Deep is a 2D Action &amp; Exploration Sci-Fi thriller which action takes about 1.6 km under the ocean floor. A group of researchers detected there some strange anomalies of unknown nature and organized an expedition to examine this mysterious phenomenon. After 681 days contact with the researchers suddenly breaks off. At this point you are entering as the leader of the second team who must find out what happened there.COMMAND YOUR TEAMControl your team members directly or by giving orders. Accomplish missions by coordinating your team&#39;s tasks.FACE A LETHAL DANGERDeal with sneaky and deadly alien lifeforms, environmetal traps and many other hiding threatsOPERATE SPECIALIZED EQUIPMENTExplore underoceanic caves using grappling-hooks, scanners, drones, heavy machinery and moreRICH DARK SCI-FI STORY which pays tribute to many 80&#39;s and 90&#39;s classic movies and games especially Aliens, The Thing and first Half-LifeTWO GAME MODES- Story mode with narrative-driven handcrafted levels<br />\n- Survival mode with randomized levels aimed on fast intensive action<br />\n(CO-OP mode is considered but is not there yet)OVER 20 HOURS OF GAMEPLAY IN STORY MODEStory Mode will have 50 or more levels (currently designed) and will require at least 20 hours to beatINTEGRATED LEVEL EDITOROFFICIAL LEADERBOARD FOR SPEEDRUNNERS</p>", "metacritic": null, "released": "2022-01-24", "tba": false, "updated": "2023-06-19T12:17:38", "background_image": "https://media.rawg.io/media/screenshots/966/966b9c525337d0415917e695942a0d44.jpg", "website": "https://www.hiddendeepgame.com", "rating": 3.75, "rating_top": 4, "added_by_status": {"yet": 16, "owned": 126, "beaten": 3, "toplay": 35, "dropped": 12, "playing": 4}, "playtime": 2, "achievements_count": 14, "ratings_count": 16, "suggestions_count": 293, "game_series_count": 0, "reviews_count": 16, "platforms": ["PC"], "developers": ["Cogwheel Software"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Daedalic Entertainment", "Cogwheel Software"], "esrb_rating": null}