{"id": 484904, "slug": "dragon-extinction", "name": "Dragon Extinction", "name_original": "Dragon Extinction", "description": "Enter a fantasy world where humanity has brought dragons to the brink of extinction. <br/>This ARPG features hundreds of unique items, crafting and procedural dungeons.<h3>Key Features</h3><ul><li><strong>Collect hundreds of items</strong> - Common, Uncommon, Rare, Epic, Legendary classes of loot with over 100 unique weapon models with tons of rare variations with unique stats.<br/></li><li><strong>4 Person Multiplayer</strong> - Connect with Friends or make new allies in glorious multiplayer. Multiplayer encounters will put your teamwork to the ultimate challenge.<br/></li><li><strong>Fast-paced Combat</strong> - Attack, dodge, jump, block in real-time to defeat your enemies or avoid getting hit.<br/></li><li><strong>Procedural Dungeons</strong> - Explore procedurally generated dungeons full of enemies, loot, and a boss at the end.<br/></li><li><strong>Character Customization</strong> - Change the appearance of your character to make them unique.<br/></li><li><strong>Mining / Gathering</strong> - Between fighting enemies you can take a moment to mine or gather resources necessary to improve your chances of survival.<br/></li><li><strong>Upgrade Weapons/Armor</strong> - Use resources to upgrade weapons and armor to improve your characters fighting capabilities.<br/></li><li><strong>Alchemy</strong> - Craft potions to help you survive.<br/></li><li><strong>Biomes</strong> - Explore maps in a wide variety of biomes including Forest, Desert, Snow Forest, Swamp, Volcano, etc</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2020-08-27T19:50:36", "background_image": "https://media.rawg.io/media/screenshots/01d/01d625ffd68c8d40005d60e75344629f.jpg", "website": "https://www.indiegogo.com/projects/dragon-extinction/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 5, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 467, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Xefier Games"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Xefier Games"], "esrb_rating": null}