{"id": 484935, "slug": "synth-war-tactics", "name": "Synth War Tactics", "name_original": "Synth War Tactics", "description": "Synth Wars Tactics is a tactical turn based game, where you control an elite squad of soldiers.  You choose what weapons to purchase, what armor to wear, and what cybernetic modifications to enhance them with.  You fight in a series of battles featuring a mix of maps, enemy groups, and tactical game play, which make sure every battle is fresh and unique.<br/><br/>Synth Wars Tactics doesn't use a traditional grid based system, instead all actions cost your units action points, and your units can move anywhere on the battlefield that their action points allow.<br/><br/><br/><br/>Synth Wars Tactics battles also feature objectives on the battlefields, which grant strategic intelligence each turn for whichever side controls them.  When a player gains enough strategic intelligence, they can call down a stratagem to affect the battle.  Ranging from Gunship air strikes, to missiles, or orbital deployed land mines, controlling objectives and smartly using call downs will separate good commanders from the great ones.  Each enemy leader also has their own unique set of call downs to fight back with.<br/><br/>Synth Wars Tactics also features an orders system, where you can issue an order to your men giving them advantages and disadvantages for the turn.  If you need to reach a far away objective, you might give the order to Advance, granting more move speed, but you trade off some weapon accuracy that turn.  Learning when to use each order is key to victory.<br/><br/>Finally after each successful mission, you will unlock new vendors in the shops, giving you more options to spend your hard earned cash.  When playing a mission set, each victory grants you cash to upgrade your team for that run.  Learning the best items to buy against each foe, along with the ever changing maps and enemy strategies gives you infinite replay ability.", "metacritic": null, "released": "2020-12-01", "tba": false, "updated": "2020-08-27T20:13:47", "background_image": "https://media.rawg.io/media/screenshots/72f/72fc873b54cf412d67a463bda5294e35.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 148, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Bryce Hochstedler"], "genres": ["Strategy"], "publishers": ["Bryce Hochstedler"], "esrb_rating": null}