{"id": 484967, "slug": "ride-4", "name": "RIDE 4", "name_original": "RIDE 4", "description": "<p>Are you ready to live the best gaming experience that a motorcycle fan can get?<br />\nRIDE 4 will spark your competitive soul with hundreds of bikes, dozens of tracks and a whole new level of realism.NEW AND ENHANCED CONTENTSChoose among hundreds of officially licensed bikes and ride on dozens of tracks all around the world, carefully designed with an extraordinary level of detail! Every asset has been created starting from CAD data, laser and 3D scanning to achieve precision down to the smallest detail and let you enjoy the best two-wheel racing experience ever.CHOOSE YOUR PATHJump into an amazing and dynamic adventure that interacts with your decisions and choose your own path from the regional events up to the professional leagues. Show your riding skills through challenging races, ability tests, track days and a huge set of events. You could even become an official tester for the most celebrated manufacturers!DAY/NIGHT CYCLE, DYNAMIC WEATHER AND ENDURANCE RACESRIDE 4 features a fully dynamic weather conditions system and a complete day/night cycle.<br />\nExperience the race in a new light and prove you are the best rider in any condition. And for the first time, the &quot;Endurance&quot; mode will put your tenacity to the test, with animated pit-stops and long lasting races: prepare to face a world where strategy is the ultimate ingredient of your success!NEURAL AILet us introduce you to A.N.N.A. (Artificial Neural Network Agent), our revolutionary neural AI system based on machine learning. Race against faster, smarter, more accurate riders and compete with an AI more human than ever!EXPANDED CUSTOMIZATIONRace with your own style! Choose among plenty of official brands for your rider’s outfit and customize your bikes aesthetically and mechanically. Unleash your creativity and design your helmet, suit and bike livery in total freedom thanks to our new graphics editor.<br />\nOnce you’re done, share your creations online or just discover the best designs of the community!ONLINE COMPETITIONS Enjoy the most complete and lag-free online multiplayer experience ever thanks to our dedicated servers.</p>", "metacritic": 75, "released": "2020-10-05", "tba": false, "updated": "2023-10-09T11:47:35", "background_image": "https://media.rawg.io/media/games/798/7985b75a0f4b081e6d87f9982a5b49f6.jpg", "website": "https://ridevideogame.com/", "rating": 3.22, "rating_top": 4, "added_by_status": {"yet": 3, "owned": 128, "beaten": 1, "toplay": 15, "dropped": 14, "playing": 6}, "playtime": 3, "achievements_count": 443, "ratings_count": 18, "suggestions_count": 310, "game_series_count": 0, "reviews_count": 18, "platforms": ["PlayStation 5", "PC", "Xbox One", "Xbox Series S/X", "PlayStation 4"], "developers": ["Milestone"], "genres": ["Simulation", "Sports", "Racing"], "publishers": ["Milestone"], "esrb_rating": "Everyone"}