{"id": 484965, "slug": "casinolife-poker-1-free-texas-holdem-3d", "name": "CasinoLife Poker - #1 Free Texas Holdem 3D", "name_original": "CasinoLife Poker - #1 Free Texas Holdem 3D", "description": "Play the world’s #1 3D POKER APP!<br/>\r\nJoin the most popular POKER Game!<br/>\n<br/>\r\nThe most immersive poker game brings you and your avatar to the best realistic table experience.  Compete to win!   Do you have what it takes to battle your way to the Top and become a Poker Legend?<br/>\n<br/>\r\nKey Features:<br/>\r\n● FREE CHIPS – EVERY 4 HOURS.  Come back often! Plus, Get a Welcome Bonus of $250,000 FREE Chips just for downloading!<br/>\r\n● POKER CAREER – Move up the Ranks and earn Big Perks! Win your way up to Legendary status.  Will you make it to the Top Rank?<br/>\r\n● AUTHENTIC TEXAS HOLD ‘EM – Stay casual with the classic Texas Hold ‘Em cash game or turn up the heat and go for the high-stakes jackpot. It’s up to you how high the stakes go!<br/>\r\n● TEXAS HOLD’EM EVENTS – Win Texas Hold’em events to earn prizes!<br/>\r\n● POKER STATISTICS – Keep track of how you and your friends are playing with your poker stats!<br/>\r\n● PLAY WITH LIVE POKER PLAYERS – Play and chat with real poker players from all over the world!<br/>\r\n● LEVEL UP!   As you play, you earn XP and levels.   These levels unlock rewards, chips, and special tournaments!<br/>\r\n● PLAY ANYWHERE – Play poker on Steam, Facebook, or your Android / iOS devices.<br/>\r\n● CLOTHING STORE – The only Poker Game with its own clothing store!  Buy Amazing Outfits to customize your Avatar’s look and feel!  Be yourself, or dress like the fantasy experience you have always wanted!<br/>\r\n● EMOTES - The most realistic emotes and avatar animations of any Poker APP! Feel like your actually in sitting at a real life poker game!<br/>\r\n● FACEBOOK CONNECT BONUS – Get $500,000 additional chips when you connect your account to Facebook.<br/>\r\n● EARN CAREER TITLES - Win your way up to become a Legend!<br/>\r\n● UNLOCK POKER CHARMS - Unlock poker charms and show them off at the table!<br/>\n<br/>\r\nStart your journey to become a Legend in CasinoLife Poker!<br/>\r\nDownload CasinoLife Poker and start playing today!<br/>\n<br/>\r\nAdditional information:<br/>\r\nThis product is intended for an adult audience for amusement purposes only. <br/>\r\nPractice or success at social casino gaming does not imply future success at real money gambling.<br/>\r\nThis product does not offer real money gambling or an opportunity to win real money or prizes.", "metacritic": null, "released": "2020-08-05", "tba": false, "updated": "2020-08-27T20:30:53", "background_image": "https://media.rawg.io/media/screenshots/ed9/ed99523e41ebb325f0d2043764796754.jpg", "website": "https://kava.world/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 44}, "playtime": 1, "achievements_count": 35, "ratings_count": 0, "suggestions_count": 298, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kaneva"], "genres": ["Simulation", "Casual", "Massively Multiplayer"], "publishers": ["Kaneva"], "esrb_rating": null}