{"id": 484960, "slug": "reroad-2", "name": "ReRoad", "name_original": "ReRoad", "description": "<h3>Making Road</h3>ReRoad is a tower defense game in which players dig their own road and design enemy paths.<br/><br/><br/><br/>Players should strategically create a road, taking into account the towers randomly placed on the stage and the towers to be placed later.<h3>Various tower and drone</h3><br/><br/><br/><br/>The range, the attack methods, are all different for the different towers.<br/>We need to design the roads and use the towers efficiently.<br/><br/>Before entering the stage, changing the drone, which is an sub-character, will change the skill and type of tower you can use.<br/>Currently, only one drone and four types of towers are provided in the demo version.<h3>Partss system</h3><br/><br/><br/>A dedicated part exists for each tower.<br/>Dedicated parts have their own basic characteristics, and each part has 15 different types of upgrades.<br/><br/>Among the random effects, you have to upgrade your parts by selecting them according to the situation,<br/>such as the roads and tower you've built, and the enemies you're coming to.<h3>Key features</h3><br/>• You can make your own path.<br/>  - You can freely create your own path.<br/>  - We need a strategy to design roads to fit randomly placed towers, not just to make roads longer.<br/><br/>• Fast, lively gameplay<br/>  - The key is to design a strategy quickly because enemies are constantly coming.<br/>  - Even after building a tower, you should manage the towers or assist the tower with skills.<br/><br/>• Diverse contents<br/>  - Each drone has two new skills and four towers.<br/>  - There are hard elite monsters with different characteristics.<br/>  - Depending on the parts upgrade, it can be a tower of different characteristics, so even if you use the same tower, it will give you a variety experiences.", "metacritic": null, "released": null, "tba": false, "updated": "2020-08-27T20:27:52", "background_image": "https://media.rawg.io/media/screenshots/b34/b34c7b835bd8d09eb84c5b7ab4a0f735.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 2}, "playtime": 0, "achievements_count": 24, "ratings_count": 0, "suggestions_count": 338, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Rabbit Hole Games"], "genres": ["Strategy", "Casual", "Indie"], "publishers": ["Rabbit Hole Games"], "esrb_rating": null}