{"id": 485077, "slug": "the-evil-in-the-forest", "name": "The Evil in the Forest", "name_original": "The Evil in the Forest", "description": "«The Evil in the Forest» is a 3rd-person horror adventure game. The game tells you the story of a man named Derek Bain - a single father who as a researcher in the field of natural resources, arrives with his daughter Kate in a mystical forest, shrouded in Indian secrets and riddles. On the spot, they are met by the only person living there named Adehi, the last living descendant of an Indian tribe that lived in this forest, who tries to convince the heroes to leave as far away from here as possible, because something truly terrible is happening in this forest. Because of his life issues Derek can't give up what he came here for and later he becomes a witness to terrible events...<br/>Try walking in Derek's shoes, find out the truth about his life and about the true reason of his arrival, save the daughter from the mysterious evil spirits, eager to escape to the human world, unravel the mysteries of a lost tribe and stop the ancient evil that lurks in the wilds of this cursed land.<h3>Game features:</h3><ul><li>A mysterious story filled with ancient magic and inspired by native American legends</li></ul><ul><li>Atmospheric music for full immersion to the gameplay</li></ul><ul><li>Variety of game opponents</li></ul><ul><li>Use light to survive</li></ul><ul><li>3rd-person game</li></ul>", "metacritic": null, "released": "2020-08-17", "tba": false, "updated": "2020-08-27T21:43:24", "background_image": "https://media.rawg.io/media/screenshots/9f8/9f8aacdc541b932def4152a3569abc33.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 311, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "macOS"], "developers": ["Souly Games"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Aleson"], "esrb_rating": null}