{"id": 485075, "slug": "the-divine-invasion", "name": "The Divine Invasion", "name_original": "The Divine Invasion", "description": "«The Divine Invasion» is a science fiction adventure game where you play as a headhunter employed by mysterious masters, whose goals initially seem bizarre and surreal. It will all become clear, though, once our protagonist admits that while the technologies might be changing, the human heart is not. It is exactly the same as it was two thousand years ago.<br/><br/><h3>A BLEND OF SCI-FI AND FANTASY</h3>Both sci-fi-flavoured and fantasy-flavoured locations await you. Living on the border between dreams and reality will pose the vital question: is the dream world truly unreal? Aren’t we driven by our very dreams? And if so, what is more real: the world of neon streets and skyscrapers that we see upon waking up, or the ineffable world that we can only navigate when we close our eyes and drift away? <br/><br/><h3>AN EXPLORATION OF FUTURISTIC VALUES</h3>This game invites you to join a social experiment — to look at the world where the traditional moral values are desperately trying to catch up with the technological progress. Synthetic life-forms and artificial intelligence will tilt the balance of light and shadow — try not to lose yourself as you make your choices.<br/><br/><h3>THE TASTE OF METAL</h3>Within the game you may find copies of The Taste of Metal — the bestselling book of the future. Collect every chapter of the ultimate novel and discover the fate of romance literature in the cyberpunk age… if you even care, that is.<br/><br/><h3>IN THE CYBERPUNK ERA, THE DESIRE TO HAVE A SOUL WILL BECOME A SOUL</h3>You don’t agree? Then prove the opposite by entering this paradoxical cyberpunk world, this cold and dreary place halfway between Hell and Heaven, where the true, living sunlight struggles to burst through the wall of neon signs as if it’s trapped between the skyscrapers. What is this but a reflection of the other side of reality, one we can only reach via our sixth sense? Private prisons and mercenary police exist in this world along with the electronic shadows and neo-Catholic cults. They will all be so very glad to meet you. Do have a nice day.<br/><br/><h3>DON THE ARMOR OF A FUTURISTIC KNIGHT</h3>The gameplay features are informed by the game’s setting. The hostile corporations and enemy clans employ a multitude of firearm and explosives detectors, meaning our protagonist has to rely on his composite sword and close combat skills during most of the missions. However, you may also take your enemies to school using sneaky subterfuge, if the guise of a hardcore ninja appeals to you more than the life of a knight charging at his enemies head-on. The game even offers an equivalent of riding, perfect for technologically advanced races inside cyberpunk ruins. The player may also visit the areas of an imaginary in-game fantasy MMORPG, where their every action will be analyzed through the prism of philosophy (because a true knight should never unsheathe his sword and charge at sci-fi windmills unless he is deeply philosophical and in love with art).<br/><br/><br/><br/>", "metacritic": null, "released": "2020-08-29", "tba": false, "updated": "2022-12-02T06:56:32", "background_image": "https://media.rawg.io/media/screenshots/a06/a0617da23f8f81fdfff90ee6b7555bbc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 6, "ratings_count": 1, "suggestions_count": 245, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Whale Rock Games", "CyberCry Creators"], "genres": ["Action", "Adventure", "Simulation", "Indie"], "publishers": ["Whale Rock Games", "CyberCry Creators"], "esrb_rating": null}