{"id": 485030, "slug": "maggies-movies-second-shot", "name": "Maggie's Movies - Second Shot", "name_original": "Maggie's Movies - Second Shot", "description": "<h3>Life in Hollywood isn't easy</h3><strong>Become a movie director and help Maggie</strong> survive her second shot at fame, as she directs her first feature-length drama.<br/><br/>Your favorite director is back in the time management game Maggie's Movies – Second Shot! After the box office success of her indie movie, Maggie is going big, now directing a feature film, Immense Darkness.<br/><br/>As the production starts, Maggie fully understands that in Hollywood, you're only as good as your last movie, and her failure could drown her benefactor's production company. When she calls for the help of a famous but troublesome director, she didn't expect the problems it would cause. To make matters worse, her father is busy taking photographs in the most dangerous, war-torn areas of the world. Can Maggie juggle everything that's going on and reconnect with her father, while battling her own demons?<h3>Help Maggie direct the movie!</h3><br/>Direct actors, assist the crew, keep an eye on every detail on the set, and make an award-winning movie!<h3>Key Features:</h3><ul><li> Learn the ins-and-outs of making a blockbuster movie<br/></li><li> Put your time management skills to the test<br/></li><li> Discover gorgeous tropical locations<br/></li><li> Hold the crew together and finish the movie<br/></li><li> Master 60 story levels and an extra 18 challenge levels<br/></li><li> Upgrade the movie sets with new equipment<br/></li><li> 7 movie-themed mini games will make you feel like you're directing a movie!<br/></li><li> Fall in love with a dramatic story, both on and off set</li></ul><h3>With your help, she might make it!</h3>", "metacritic": null, "released": null, "tba": false, "updated": "2020-08-27T21:15:33", "background_image": "https://media.rawg.io/media/screenshots/3ee/3eef334dde9de6bcc8a2051199669205.jpg", "website": "https://www.facebook.com/MaggiesMovies/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 201, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["World-LooM Games"], "genres": ["Adventure", "Strategy", "Simulation", "Casual", "Indie"], "publishers": ["World-LooM Games"], "esrb_rating": null}