{"id": 485008, "slug": "cube-chase", "name": "Cube Chase", "name_original": "Cube Chase", "description": "Cube Chase is a short but challenging 3D platformer; your primary goal is to reach the glowing golden cube while avoiding lethal and non-lethal obstacles.<br/><br/>Challenge your reflexes, navigate obstacles, dodge guards and pass checkpoints to unlock new areas. Cube Chase is a simple but fun, quick and addictive game, designed when I was 12 to learn programming, after years of Minecraft command block creations.<br/><br/>Use Z or W (forward), Q or A (left), S (backwards), D (right) and spacebar (jump) to move.<h3>Key Features</h3><br/>Lethal obstacles send you back to your spawn point:<br/><ul><li>Guards<br/></li><li>Spikes<br/></li><li>Chasers</li></ul><br/>Reaching one of the other glowing colored cubes sets your spawn point there and unlocks a new area.<br/><br/>Reaching the golden cube unlocks the next level, (harder of course!), 5 in total.<h3>Dev Notes</h3><br/>I started making this game when I was 12 as a fun way to learn more about programming and game design. I worked really hard on it for about a year, and was tempted to polish it more, but I’ve moved on to other projects so just want to release it here for my friends to play. I previewed it with my youth group who loved it, and I appreciate their encouragement - thanks everyone =) I’m now 14 and while this game is far from perfect I poured many hours into it, I hope you enjoy it!", "metacritic": null, "released": "2020-02-20", "tba": false, "updated": "2020-08-27T21:02:13", "background_image": "https://media.rawg.io/media/screenshots/b96/b96f9289fc647757acaec2dc4943a418.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 110, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dtmss"], "genres": ["Casual", "Indie"], "publishers": ["Dtmss"], "esrb_rating": null}