{"id": 485006, "slug": "zball-ii", "name": "Zball II", "name_original": "Zball II", "description": "Zball II is a new physics puzzle game. The goal is the same as in the first Zball game - you need to deliver the green ball to the green platform. It sounds simple, but actually it is not.<br/><br/>Blocks can have different powers - some can be destroyed when colliding with other objects or from an explosion, some are monolithic but mobile, some can mve the green ball. Most often, there is no specific algorithm of actions, you should rely only on your intuition to solve the problem.<br/><br/>We have added new types of platforms that interact with objects in different ways. For example, there are platforms that make round objects to roll in a certain direction. There are transparent platforms that are divided into colors and can only interact with objects of their own color.<br/><br/>There are game levels of different difficulty and types. Some levels require dexterity and reaction, some will require patience and caution, others will make you think about the sequence of actions. You can see how to interact with an object by its color. For example, green is the main color, and you need to deliver it to the platform of the corresponding color. Yellow object reacts to explosions from mouse clicks. Blue objects are destroyed when they collide with yellow ones. Blue ones are not destructible, but they can be moved by yellow objects. Red objects break down from the explosion… Gradually you will understand how the system works and will be able to cope with any task! Exciting gameplay will not let you get bored!<br/><br/><strong>Game Features:</strong><br/><ul><li> 40 new levels<br/></li><li> Interesting puzzles<br/></li><li> New types of blocks<br/></li><li> Steam achievements<br/></li><li> Some levels are really hard!</li></ul>", "metacritic": null, "released": "2020-09-09", "tba": false, "updated": "2020-08-27T21:00:39", "background_image": "https://media.rawg.io/media/screenshots/f0e/f0e29b92acfe605f3ab6c9a02a704886.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 8, "ratings_count": 0, "suggestions_count": 69, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["334Sgame"], "genres": ["Casual", "Indie"], "publishers": ["Garage Games"], "esrb_rating": null}