{"id": 485083, "slug": "golden-rails-tales-of-the-wild-west", "name": "Golden Rails: Tales of the Wild West", "name_original": "Golden Rails: Tales of the Wild West", "description": "Tame the Wild West as you build a railroad from coast to coast at the newest Time Management game from Alawar! Each backbreaking day in the untamed frontier provides an opportunity for you to further your dream of connecting small towns across the country. However, achieving your goal won't be easy. From the banker who's demanding you pay off your loan to the bandits who are hiding behind every rock, cactus and tumbleweed, obstacles are everywhere!<br/>\n<br/>\r\nFortunately, there's more good news than bad. As you rebuild a string of ramshackle towns, trains will bring much needed supplies to the station, sheriffs will lock bandits behind bars and the natives will cast a little magic to make it rain. All you have to do to earn your stars is think ahead and beat the clock!<br/>\n<br/>\r\nAs you complete quests and earn rewards, you and your engineer – a plucky but whip smart gal from the big city – will make your way through dusty canyons, snowy mountaintops, dazzling meadows and more!<br/>\n<br/>\r\nDownload Golden Rails: Tales of the Wild West and make history as the king of the tracks!<br/>\n<br/>\r\nKey features<br/>\n<br/>\r\n•\t50 rootin' tootin' levels!<br/>\r\n•\tClassic Wild West characters!<br/>\r\n•\tRockslides, droughts and other dangers!<br/>\r\n•\tTrains, steamships and a mechanical lumberjack!<br/>\r\n•\tA tutorial, an easy mode and simple controls!", "metacritic": null, "released": "2019-12-11", "tba": false, "updated": "2020-08-27T21:48:24", "background_image": "https://media.rawg.io/media/screenshots/13a/13a50db1971b26ab157d9dccd9989a89.jpg", "website": "https://steamcommunity.com/groups/alawargames", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 13, "beaten": 1}, "playtime": 8, "achievements_count": 30, "ratings_count": 1, "suggestions_count": 320, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Yustas Game Studio"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Alawar Entertainment"], "esrb_rating": null}