{"id": 485002, "slug": "guilty-hell-white-goddess-and-the-city-of-zombies", "name": "Guilty Hell: White Goddess and the City of Zombies", "name_original": "Guilty Hell: White Goddess and the City of Zombies", "description": "<p>■ Story<br />\nThe peacefully standing Fairy forest is suddenly attacked by hordes of the undead.<br />\nIt was the beginning of the [End] of the great continent, which was becoming desolate day by day.<br />\nThe wandering soul-less army move about like zombies, targeting fairies in order to quench their thirst for more magic power.<br />\nThe Fairy tribes well reknowned for their purity and high degree of magical power are the cream of the crop, mercilessly hunted one by one, ripped to pieces and torn into chaos.<br />\nIn the midst of the turmoil and conflict, the Fairy Chief performs a ritual, a message aimed towards the heavens, in search of a salvation, the descent of a goddess.<br />\nThe name of the girl summoned is Airi.<br />\nShe was once a goddess who was enshrined as a deity, guardian of the great continent.<br />\n■ Outline<br />\nThis is an adult themed side-scrolling action game with the concept of &quot;Silky smooth Ryona&quot; with &quot;Nimble moving Gameplay&quot;.<br />\nGoing after the cause that brought chaos and confusion to the world, the Dark Sorcerer VIVI, Airi takes on the various trials and challenges that await her.<br />\nThis game includes over 60 types of enemy characters and more than 300 types of grab attacks and insistant features of sexual depictions.<br />\n■ Features<br />\n・ No time to breathe or get overrun by ugly monsters and fiends<br />\n・ Seamless entanglements between beautiful women<br />\n・ Special scenes revealed after losing in some Boss battles<br />\n・ Intuitive and refreshing combo attacks can be operated with keyboard or game pad<br />\n・ 60 types of enemies and grab attacks that include over 300 types of sexual scenes<br />\n・ Sleek and sweet Hentai animations with exclusive high quality audio recordings<br />\n・ Stressless exploratory map allows for freed movement<br />\n・ Bonus priviliges added for extra enjoyment after game completion<br />\n■ Cast<br />\n・ Production<br />\nKAIRI SOFT<br />\n・ CV<br />\nKurumi Mochizuki (Airi/Grise)<br />\nKanamu Yogasumi (All men or monsters)<br />\nKyoko Aieda (Eleanore/Noir)<br />\nHikaru Ginga (Fairy / Midia / Blanc / Rose)<br />\nKichune (Cherry Blossom/Marie/Mistina)<br />\nAya Kuchitani (Lamia)<br />\nBubaigawara Shiho (Melusine)</p>", "metacritic": null, "released": null, "tba": false, "updated": "2022-12-25T10:52:35", "background_image": "https://media.rawg.io/media/screenshots/67c/67c2592963ea0a3a62d4dd40b34890ce.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 7, "toplay": 1, "playing": 1}, "playtime": 5, "achievements_count": 11, "ratings_count": 0, "suggestions_count": 456, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["KAIRI SOFT"], "genres": ["Action"], "publishers": ["KAIRI SOFT"], "esrb_rating": null}