{"id": 485029, "slug": "traffic-jams", "name": "Traffic Jams", "name_original": "Traffic Jams", "description": "<h3>Traffic Jams</h3><br/>In a world without traffic lights, one reigns supreme. Step onto the crossroads as the world’s worst traffic controller and keep traffic flowing in the face of outrageous events and flagrant road rage.<br/><br/>Starting out on a quiet corner in a small town, job offers start pouring in from around the globe. Guide rude pedestrians, impatient drivers, and the occasional meteorite along before road rage strikes. Sound easy? Think again! This chaotic VR game is full of monsters, (un)natural disasters, and something called… ‘cheese bowling’?<br/><br/>In Traffic Jams, you’ll be taken under the wing of Dennis, the self-proclaimed world’s best traffic controller… EVER!!! He comes from a place called Jam City, which gets its name from its many flash mobs and packed intersections. Armed with dreams of superstardom, a sassy attitude and fresh dance moves, he has taken it upon himself to teach YOU the ropes of traffic controlling (although between you and me, he’d rather be dancing). If you give him a chance, he’ll take you on a jam-packed global adventure on the road to friendship.<br/><br/>Made it to the top in career mode? Keep your VR headset cool as up to 4 non-VR friends turn up the heat in (couch) party mode, or climb the global ranks!<br/><br/><ul><li><strong>Take your career on the road: </strong>Take on the world’s most iconic and chaotic cities, from New York to Paris, and become a traffic control hotshot in career mode<br/></li><li><strong>Intuitive controls / deep chaos:</strong> Using real-life gestures in VR, try your hand(s) at one of the most chaotic yet thankless jobs in human history!<br/></li><li><strong>Frenzied gameplay action:</strong> Got this traffic control gig all figured out? Think again! Each city throws its own twists and turns at you, ranging from pesky to downright outrageous<br/></li><li><strong>Turn up the heat in (couch) party mode:</strong> Up to 4 non-VR friends can join in on the road mayhem using their mobile devices<br/></li><li><strong>Climb the global ranks!</strong> Now you can finally show everyone you can do it better than your local traffic control guy by carving out a place on the global leaderboards</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2020-08-27T21:15:03", "background_image": "https://media.rawg.io/media/screenshots/c34/c34e1e5666cdbb3bb6d6452b722d959f.jpg", "website": "http://trafficjams-vr.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 104, "toplay": 1, "dropped": 1}, "playtime": 1, "achievements_count": 26, "ratings_count": 1, "suggestions_count": 239, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Little Chicken Game Company"], "genres": ["Action", "Simulation", "Casual"], "publishers": ["Vertigo Games"], "esrb_rating": null}