{"id": 48510, "slug": "gobliiins-trilogy", "name": "Gobliiins Trilogy", "name_original": "Gobliiins Trilogy", "description": "Gobliiins Trilogy is a compilation of three games including Gobliiins, Gobliins 2 and Goblins 3. Released successively one after the other from 1991 to 1993 on PC, thoses point’n’click classics are now available on Android in a new version specifically enhanced for mobiles &amp; tablets. <br/><br/>In the first game, play the adventures of Oops, Asgard and Ignatius (also known as Dwayne, Hooter and BoBo in US) who are looking for a remedy to cure the king Angoulafre. Each character has specific abilities so you will need to play with them alternatively to succeed all the different levels.<br/><br/>In the second one, two goblins have to find and free the Prince. You will alternate between two diametrically opposed characters once again to reach your goals! Finally, in the last game and certainly the funniest, you play as a journalist goblin in charge of a report about the conflict between the queen and the king. However, a forced landing will upset his life: he fall in love with the Princess Winona and find himself in conflict, and then was bitten by a werewolf...<br/><br/>Features:<br/>•\tNew interface specially redesigned for mobile &amp; tablet<br/>•\tTwo control modes: «Touch » and «classique »<br/>•\tNew gameplay  adapted to the touch<br/>•\tChoose between original graphics or video filtering  (for rich, smooth graphics)<br/>•\t« Hotspot »system : highlight interaction areas if necessary <br/>•\t« Hint » system : progressive hints on player’s request <br/>•\tOriginal soundtrack<br/>Funny and mysterious adventures, original puzzles, colorful game with cartoon graphics, Gobliiins Trilogy offers you hours of fun at your fingertips!<br/><br/>This product uses ScummVM distributed under GPLv2 license. More information at http://scummvm.org/ &amp; http://www.gnu.org/licenses/gpl-2.0.html. Source code available at http://www.dotemu.com/gpl", "metacritic": null, "released": null, "tba": false, "updated": "2022-10-19T06:29:52", "background_image": "https://media.rawg.io/media/screenshots/9c7/9c737cd4b86d17cd59b77ac0fb90d124.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 282, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android"], "developers": ["DotEmu"], "genres": ["Adventure"], "publishers": [], "esrb_rating": "Everyone"}