{"id": 485193, "slug": "3on3-freestyle-rebound", "name": "3on3 FreeStyle: Rebound", "name_original": "3on3 FreeStyle: Rebound", "description": "<h3>Features</h3><ul><li>   3 Vs 3 Online Multiplayer Mode<br/></li><li>   1 Vs 1 Online Multiplayer Mode<br/></li><li>   Dynamic Practice Lobby</li></ul><h3>Free to Play Basketball Action</h3>The game’s unique free-to-play approach means that players can dedicate the time needed to master the game and become online street basketball legends.<h3>Real-time Online Community</h3>Players can dive into a huge online community of potential teammates and competitors for a personal, competitive experience which makes them feel like they are right there on the court. Allowing for personal interaction, team development, and rivalry, 3on3 FreeStyle: Rebound allows for social and interactive community, while also competitive at the same time.<h3>High-flying, Fast-paced Street B-ball Gameplay</h3>The straightforward controls of 3on3 FreeStyle: Rebound allow for players to execute their favorite basketball moves with ease within their first time trying out the game. Once the basics have been mastered, players will find each unique character in the game with individual signature basketball tricks which can quickly be picked up, mastered, and unleashed on opponents.<h3>Dynamic Art Powered By Unreal Engine 4</h3>Inspired by the real-life street basketball courts in the country, the artists have infused their own unique take on the courts using the power provided by the Unreal Engine 4. Interactive environments and characters come to life when a player pulls off a stunning alley-oop or hits an impossible acrobatic shot.<h3>Characters With Unique Skill Sets</h3>Players can pick from a wide variety of diverse street basketball characters with specific skill sets and physical traits inspired by the different kinds of basketball players you will find on the court. Whether the player wants a tall, lanky rim protector, a gravity-defying slam dunk artist, who can bury the outside shot with ease, they can find them in 3on3 FreeStyle: Rebound’s roster of characters.", "metacritic": null, "released": "2020-07-14", "tba": false, "updated": "2022-10-20T04:55:25", "background_image": "https://media.rawg.io/media/screenshots/531/531a341a5e351d9e119a95f205ef8d89.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 235, "toplay": 1, "dropped": 2}, "playtime": 1, "achievements_count": 35, "ratings_count": 4, "suggestions_count": 313, "game_series_count": 0, "reviews_count": 4, "platforms": ["PC"], "developers": ["Joycity"], "genres": ["Action", "Sports", "Casual", "Indie"], "publishers": ["Joycity"], "esrb_rating": null}