{"id": 485183, "slug": "the-necromancers-tale", "name": "The Necromancer's Tale", "name_original": "The Necromancer's Tale", "description": "The Necromancer's Tale is a narrative-driven top-down RPG where you play the role of a minor noble in the 18th Century, drawn into the Dark Necromantic Arts as you seek knowledge and revenge. Great power awaits... along with the weird, the morbid, and a gradual descent into madness.<br/><br/><br/><br/><br/>Before you lies a great spellbook, filled with powerful rites of death and reanimation. Can you decipher the pages and master its arcane rituals without losing your mind or being strung up by the townsfolk? Your progress will require great determination, cunning and secrecy, as well as a willingness to confront difficult aspects of yourself and all humankind.<br/><br/><br/><br/><br/>The Necromancer's Tale focuses on conversation, narrative and ritual more than on combat. Yes, there are battles, and tactical turn-based combat; however fighting on its own will not be a route to success. Choose your words wisely, because the characters you meet are already suspicious of the eerie events in town.<br/><br/><br/><br/><br/>Unlike most RPGs, this isn't a hero's journey as they rail against an evil lord. It is a person's descent into madness as they plumb the depths of black magic in their search for revenge, the terrible things it asks of them and the uncomfortable choices they make in their search for power.<br/><br/>Spells and rituals are not treated like guns, that you acquire and then use without a second thought: the process of gathering/manufacturing materials and knowledge and then the process of putting them into action is non-trivial and is a focus of the game.<br/><br/>Confusing dreams, strange distant lights through the trees, spooky voices whispering your name, a loosening grip on reality - the game focuses on the unsettling experience of becoming a necromancer and transcending mortality, whatever that may mean... The game deals with themes of death, change, morality, and a gradually eroding sense of time and place.", "metacritic": null, "released": null, "tba": false, "updated": "2020-08-27T22:54:24", "background_image": "https://media.rawg.io/media/screenshots/967/9673231796e18a74e4da837cf55769d1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 341, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Psychic Software", "Spiderwinkle Games"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Psychic Software"], "esrb_rating": null}