{"id": 485119, "slug": "fetish-locator-week-one-extended-edition", "name": "Fetish Locator Week One - Extended Edition", "name_original": "Fetish Locator Week One - Extended Edition", "description": "<p>Fetish Locator Week One Extended Edition is a visual novel where you determine the path of the male protagonist. Play as a young college student exploring love, lust, and sexual fetishes with the hottest women in town. Score points in the Fetish Locator app, which has taken the campus by storm.StoryOur main character returns to college after a couple of weeks at home, but everything is not how it used to be. There is a new app gaining popularity among the students, and he sees it as the opportunity to get close to the girl of his dreams. He will face many challenges and discover many secrets during his first week playing Fetish Locator!<br />\nFetish Locator Week One Extended Edition is the first game in a trilogy. During the first week, the male protagonist goes through an emotional journey starting as a single guy and voyeur to building relationships and his self-confidence. The second game covering week two is currently in development. A third game concluding the story during week three is planned.Characters<br />\nLydia - all around perfect<br />\nAmRose - the feisty redhead best friend<br />\nStacy - the close childhood friend<br />\nJessie - cosplayer extraordinaire<br />\nDaisy - the submissive free spirit<br />\nLyssa - the sexy lawyer with a secret surprise<br />\nAnd many others!<br />\nFetish Locator Week One Extended Edition contains graphic sexual content including (but not limited to) Incest, Foot fetish, Watersports, Femdom, Netori, Exhibitionism, Public Sex, Anal Sex, Oral Sex, Vaginal Sex, Transgender, Enema, Cumshots, Creampies, Facial, Masturbation, Menstruation, Hallucinations, Voyeurism, Teasing, and Blackmail. Player discretion is strongly advised.<br />\nFetish Locator Week One Extended Edition uses an in-game point system where players score points by exploring fetish content. At two points during this game, the male protagonist is required to have a minimum number of points to continue playing. While most of the sexual content is optional, opting out of too much of the fetish content may result in a game over. The first goal is a minimum of 25 points, with 50 points possible. The second goal is a minimum of 50 points, with over 100 points available. These goals are clearly stated several in-game days before the deadline.</p>", "metacritic": null, "released": "2020-07-27", "tba": false, "updated": "2023-11-24T04:40:13", "background_image": "https://media.rawg.io/media/screenshots/fb2/fb210147a46c1d4ecba72f45115a8948.jpg", "website": "", "rating": 4.45, "rating_top": 5, "added_by_status": {"yet": 8, "owned": 76, "beaten": 13, "toplay": 11, "dropped": 2, "playing": 1}, "playtime": 3, "achievements_count": 35, "ratings_count": 11, "suggestions_count": 466, "game_series_count": 2, "reviews_count": 11, "platforms": ["PC", "macOS", "Linux"], "developers": ["ViNovella"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["ViNovella"], "esrb_rating": "Adults Only"}