{"id": 485146, "slug": "starseed-2", "name": "Starseed", "name_original": "Starseed", "description": "Starseed aims to slightly twist the peaceful, calming farm sim archetype. \"A farm sim with dark undertones and an isolated atmosphere\" - would be a fitting description. <br/><br/>It is still, in sense, a peaceful sim without combat, but this time there's no relationships to build, your interactions are with your helper robots and with mission control back on Earth. You are millions of miles from the people you're trying to save.<br/><br/> <br/> <br/><strong><h3>Explore:</h3></strong> Explore and discover the many unknowns of the strange planet. It's your job to unravel those secrets.<br/><strong><h3>Research:</h3></strong> Discover and research the minerals and many features of the planet. Find out if you can grow crops from Earth here or what you would require to help the crops survive. Report your findings back to Earth and receive rewards and upgrades.<br/><strong><h3>Craft:</h3></strong> Craft machines and tools to aid you in your research. <br/><strong><h3>Robots:</h3></strong> Build robots to automate tasks and perform the tasks that are too much for a human to handle.<br/><strong><h3>Manage:</h3></strong> Manage your base to produce a steady output of resources. <br/><strong><h3>Customize:</h3></strong> Choose to color your various tools, equipment, design of lab, etc. Name the planet, name your robots!<br/><strong><h3>Procedural Side Missions:</h3></strong> Earth will face various challenges during this time, and your help will be requested. Collect resources, discover more about something, build a machine, send resources back home - your help in times of crises could save millions.<br/><strong><h3>Procedural Generation:</h3></strong> Each playthrough is unique. With each playthrough: The cave systems and mines are different. The planet itself will have unique features and colors. The random events and side missions will be different. Allowing for endless replayability!<br/><br/> <br/><br/><br/><br/><br/>", "metacritic": null, "released": null, "tba": false, "updated": "2020-08-27T22:30:18", "background_image": "https://media.rawg.io/media/screenshots/fc2/fc275a5153a36c430864d913ff4f6870.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["heartsynth"], "genres": ["Adventure", "RPG", "Strategy", "Simulation", "Casual", "Indie"], "publishers": ["heartsynth"], "esrb_rating": null}