{"id": 485141, "slug": "everdream-valley", "name": "Everdream Valley", "name_original": "Everdream Valley", "description": "<strong>Finally holidays!</strong> This summer, for the first time ever, you will spend it alone at your grandparent’s farm. Two months without mom and dad. Only you and your dog! Two months during which you have to take care of the grandparent's farm growing plants and milking animals, well at least some of them.<br/><br/><br/><br/><strong>You will plant, water, gather crops, and fight</strong> (sometimes for life) against pests.<br/>You'll need to clear nettles, build pens, and keep the animals on the farm happy.<br/><br/>You can <strong>sell your crops</strong> and buy or<strong> upgrade equipment</strong> with the money you earn.<br/>However, you will not be able to do everything right away, to build a pen you need to get wood and tools first. Fish are much more cooperative when you can offer them fatter worms. Oh, and remember to talk to your grandparents often and watch for guests. You never know where the next farming mission is coming from.<br/><br/><br/><br/>From the very beginning, your dog can support you in farming tasks, for example you can use him to herd a scattered flock of sheep.  But this dog, in addition to a solid bodyweight, has also a lot of character. It is up to you and your training skills whether your companion will help you or get in your way.<br/><br/><br/><br/>There is also a cat. At first, he will not be happy with the new company. It's your job to convince him that you are a worthy ally. If you succeed, you can use him to discover new missions, hidden places, pest control, and many other tasks on the farm.<br/><br/><br/><br/><br/><br/>The farm is located in the Everdream Valley. You will find there a few biomes with different flora, fauna, and missions. Fields, meadows, forests, a lake, and a river are waiting for you to discover new secrets and tasks, from gathering and sometimes growing fruits and mushrooms to catching fish, collecting insects, and even building a treehouse.<br/><br/><br/><br/><br/><br/>After a day of running through the meadows, fighting with nettles, and sheep riding, it would be good to rest from attractions in a comfy bed. Nothing of that. While sleep will eventually come to you, it will by no means be calm.<br/><br/>Everdream Valley is not your ordinary valley and its residents have their own lives, plans, and secrets.<br/>In your dreams, <strong>with the help of a magic hat</strong>, you will be able to play the role of various animals. Remember that what you do during at day and night has an impact on the farm. If you don't fend off the wolves as a dog, you may not have anyone to build pens for when you wake up. The goals of two ducks, who seemingly do not interfere with the life of the farm, may turn out to be completely contrary to the plans of the inhabitants of the henhouse. A cat that is at most a bit cranky during the day at night may aspire to be a war criminal, and war, war never changes. <br/><br/>In all this confusion, there is somewhere an answer to the question of what is actually going on on this beutiful but bizarre farm. You have two months of holidays to find out the answer. One thing is for sure. <strong>This will be the most peculiar summer ever.</strong>", "metacritic": null, "released": "2023-05-29", "tba": false, "updated": "2023-08-09T14:34:49", "background_image": "https://media.rawg.io/media/screenshots/cf1/cf1b28381a32190b5503ae557e9b625e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 11, "beaten": 1, "toplay": 8, "dropped": 2}, "playtime": 15, "achievements_count": 21, "ratings_count": 3, "suggestions_count": 301, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["Mooneaters"], "genres": ["Adventure"], "publishers": ["Untold Tales", "Varsav Game Studios"], "esrb_rating": null}