{"id": 485201, "slug": "zhan-qi-zheng-ba-auto-chess-war", "name": "战棋争霸 AUTO CHESS WAR", "name_original": "战棋争霸 AUTO CHESS WAR", "description": "<strong>Summary:</strong><br/><br/>This is a casual game like chess, in this world of swords and magic, a new and unique adventure has just begun, choose your soldiers, platoon, defeat wave after wave of powerful enemies, to achieve the ultimate victory...Or revel in endless battles.<br/> <br/><strong>design</strong><br/><br/><strong>Synthesis, promotion, beyond the limit</strong><br/>Roughlike play, each replay will be a new game, creating your own legion on each random trip, choosing your favorite from a rich pool of heroes, combining three eponymous heroes into the next level, and commanding your team, taking control of the battlefield like a chess player!<br/><br/><strong>A new journey, the beginning of a legendary epic</strong><br/>It's time for a classic hero's journey into adventure mode -- a world class threat looms, a terrifying and powerful satyre is about to bring about the end of the Scourge, and only one team is still searching for a way to stop it. Will they be faced with the most ferocious enemy or the most terrifying truth?There is only one way to clear the fog, and that is to embark on a new epic.<br/><br/><strong>Don't fight?It can also be fun!</strong><br/>A thousand Hamlets in a thousand hearts?A thousand games can have a different result!Gather new partners for your team, use their unique talents and skills, step by step in the battle round, otherwise the powerful enemy will set the stage for your final defeat.[Endless mode] under the heavy enemy test your strategy and the limit of perseverance, let you break through yourself again and again, called a great strategist!<br/><br/><strong>Automatic and free self - play</strong><br/>Single-player gameplay bring a unique user experience, at any time all can be a great game, open the game, when former, meaning, is between!The game will always stay in the moment you turn it off, waiting for the brave to return, something unexpected?Never mind, pick a good day and continue with your duel!", "metacritic": null, "released": "2020-07-23", "tba": false, "updated": "2020-08-27T23:06:22", "background_image": "https://media.rawg.io/media/screenshots/f13/f13da8aba56f081a721f61a746542ae9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 351, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["成都火凤电艺游戏工作室"], "genres": ["Strategy", "Indie"], "publishers": ["绿洲发行"], "esrb_rating": null}