{"id": 485259, "slug": "dream-odyssey-vondaft", "name": "Dream Odyssey (Von'Daft)", "name_original": "Dream Odyssey (Von'Daft)", "description": "<p><strong>Dream Odyssey</strong> is a prototype developed by me between 2017 and 2018.</p>\n<p>It is a turn-based RPG that tells the story of Dylan, a boy who finds himself lost in a World of Dreams and tries to find his way home. On his journey, he must restore the world already shattered and fight against an unknown entity called \"King of Everything\".</p>\n<p>Dream Odyssey was initially developed in Rpg Maker Vx Ace (the demo on this page is about this version).</p>\n<p>The demo features <strong>2 hours of gameplay</strong>, with two large locations complete, one of which is fully populated by enemies and NPCs, three playable characters with their skill trees.</p>\n<p>______________________________________________________<br/></p>\n<p><strong>Dream Odyssey</strong> é um protótipo desenvolvido por mim entre 2017 e 2018.</p>\n<p>Se trata de um RPG de Turnos que conta a história de Dylan, um garoto que se vê perdido em um Mundo de Sonhos e tenta achar o caminho para casa. Em sua jornada, ele deverá restaurá o mundo já despedaçado e lutará contra uma entidade desconhecida chamada de \"Rei de Tudo\".</p>\n<p>Dream Odyssey foi desenvolvido inicialmente em Rpg Maker Vx Ace (a demonstração contida nesta página se trata desta versão). </p>\n<p>A demonstração conta com<strong> 2 horas de Gameplay</strong>, com duas localidades grandes completas, sendo uma delas totalmente povoada por inimigos e NPCs, três personagens jogáveis com suas árvores de habilidades. \r\n</p>", "metacritic": null, "released": "2020-08-28", "tba": false, "updated": "2020-08-28T02:42:31", "background_image": "https://media.rawg.io/media/screenshots/de0/de0d4aa635e127603f0b85b6463fc487.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 252, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Von'Daft"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}