{"id": 485401, "slug": "overpopulation-vr", "name": "Overpopulation VR", "name_original": "Overpopulation VR", "description": "\r\nHave you played the game? If so please give me some feedback here: https://forms.gle/LYyTWTJqU7hfJUvY8\r\n\r\nAbout Overpopulation\r\n<p>Overpopulation is a dystopian game set in what we today know as Washington. The world is overpopulated, and unemployment, homelessness and crime is a normal sight in those times. As a desperate measure. The government of Washington has decided to kill of all the bad people to get the population down. You apply for the one of the jobs where you must go over peoples records and decide of they can live another day, or continue, and never be seen again…</p>\n\r\nHow To Play\r\n<p>-In  the office you have different \"papers\" these show information about the person, and they shall help you decide if the person can survive or not. </p>\n<p>-When you have decided a persons fate click on the corresponding button.</p>\n<p>-Continue this for each person in the day</p>\n<p>-There are 5 days</p>\n\n\r\nInfo\r\n<p>The game was originally made for a Ludum Dare game jam (play it here). And now it is being ported to VR. I have taken the critiques we got and improved the game. I hope to get the beta version out as soon as possible. And then start to make the full game. I aim for a 2 hour story, with an experimental endless mode on top.</p>\n<p>I aim to release it on steam, oculus rift, quest store and itch.io. For 5$ (Beta/demo will be free)</p>\n\r\nContent\r\n<p>The game is now in beta and is not finished. Everything you see now is subject to change. Here is a breakdown VS beta and the full version</p>\r\nBeta:\r\n<p>-6 persons per day</p>\n<p>-5 days</p>\n<p>-3 endings</p>\n<p>-4 papers to help you decide(records, guidelines, info and messages)<br/></p>\n\r\nFull Version(under development)\r\n<p>-6 persons per day</p>\n<p>-21 days</p>\n<p>- &gt;6 endings</p>\n<p>-6 papers to help you(records, guidelines, info, messages, ??? and ???)</p>\n\n\r\nOther platforms\r\n<p>The game/demo is right now <strong>only available</strong> on the <strong>Oculus rift</strong>(or Oculus link)</p>\n<p>I am working on  a <strong>quest port</strong> but it is harder than expected</p>\n<p>The plugin I'm using right now (Unity XR) doesn't support <strong>valve headsets </strong>yet. They are working on it though and i will update the game as soon as its available(maybe you can use revive but i haven't tested that) </p>", "metacritic": null, "released": "2020-08-27", "tba": false, "updated": "2020-08-28T03:14:23", "background_image": "https://media.rawg.io/media/screenshots/0b4/0b43e3f61264ca72ce07bb9b70c37dc8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 37, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Centauri"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}