{"id": 485638, "slug": "virtual-blox", "name": "Virtual Blox", "name_original": "Virtual Blox", "description": "Virtual Blox\r\n\n<p>Want to build with unlimited bricks in VR? </p>\n<p>Want to design your own bricks?</p>\n<p>Want to play this designer for a few minutes and then realise that you are as uncreative as me?</p>\n<p>If all your answers were yes, when what are you waiting for? Download Virtual Blox today!</p>\n\n<p>In Virtual Blox you can build to your hearts content, over 200 parts are available plus the hundreds unique designs you can create. </p>\n\r\nFeatures\r\n<ul><li>Over two hundred brick to choose from</li><li>Designer to design your own bricks</li><li>Copy and Paste build structures</li><li>Load and Save your builds in parts or as a whole scene</li><li>Fast UNDO and REDO if you made a mistake</li><li>Horizontal lift for builds that are bigger than you</li><li>Teleport yourself ONTO the bricks</li><li>Assistants that help you to place the bricks </li><li>Easy to learn</li><li>Menus are ambidexter and you can hold different designs in both controller  </li><li>Stepping on brick in VR doesn't hurt (as much)</li></ul>\n\n\r\nLimitations\r\n<ul><li>Currently only one brick can be separated at a time</li><li>Moving parts like doors or wheels are not supported (yet?)</li><li>Colliders are a bit iffy,  so if you want to place a part and a Collider won't let you, there is an option to turn off colliders for parts that are in your hand</li><li>Some more smaller bugs which I don't know yet about but I am sure you will find when you play this (but hopefully not to many)</li></ul>\n\n<p>Thanks to the LDraw Community for the parts, check them out: LDraw </p>\n\n\r\nControls\r\n<br/>\n<p>\n</p>\n<p>You can open the Menu by tilting the Controller to the side, as seen in the Gifs. </p>\n<p>To ride the lift up, point with both Controllers upwards. To ride down, point with both Controllers downward.</p>\n\r\nRequirements \r\n<p>Currently only the HTC Vive is supported. You may be able to change the required inputs to other controllers, but I was only able to test everything with my Vive Controllers.</p>\n<p>SteamVR is required. </p>\n<p>To play the game, just extract the content of the VB.zip and click on the exe.</p>\n<p>My Computer specs are</p>\n<ul><li>Ryzen 5 3600</li><li>Nvidia 2060 Super</li><li>16GB RAM</li></ul>\n<p>but it should work on lower spec maschines as well.</p>\n<p>Happy building!</p>", "metacritic": null, "released": "2020-08-26", "tba": false, "updated": "2020-08-28T04:05:49", "background_image": "https://media.rawg.io/media/screenshots/12b/12be860b8b097306edb4e7f3866dd0c2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 22, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Essometer"], "genres": [], "publishers": [], "esrb_rating": null}