{"id": 48572, "slug": "ferris-muellers-day-off", "name": "Ferris Mueller's Day Off", "name_original": "Ferris Mueller's Day Off", "description": "From the creators of Forever Lost which has had over 1 million downloads worldwide!<br/><br/>“Life moves pretty fast.” says Ferris Mueller, a barnyard mule. “If you don't stop and look around once in a while, you could miss it.”<br/><br/>Ferris Mueller’s Day Off — the latest point’n’click game from the creators of Forever Lost — is all about searching for a mule that is off sick. It’s full to the brim with clever puzzles, interesting characters, colourful locations and puns galore.<br/><br/>It is your role as the headteacher and owner of Ferris to find him and bring him back. Speak to the townspeople and solve puzzles to find the 9 golden carrots that Ferris has hidden for you to locate. <br/><br/>In the immortal words of Andrew Clark, from The Breakfast Club, “We're all pretty bizarre. Some of us are just better at hiding it, that's all.”<br/><br/>Features:<br/><br/>• Inspired by classic point’n’click adventure games and the love of great 80’s films.<br/>• Colourful hand drawn artwork.<br/>• In game camera so you can take photos of all the clues and rooms you find.<br/>• A fantastic soundtrack by Richard Moir that also includes the music of Franc Cinelli.<br/>• A built in hint system included at no extra cost to ensure you never get stuck for too long.<br/>• Auto-save feature with 8 separate save slots, never lose your progress again.<br/><br/>Quotes:<br/><br/>• “reminiscent of older point-and-click adventures” - 148 Apps<br/>• \"if you’re a fan of point-and-click adventure games, you do not want to miss this one\" - AppUnwrapper<br/>• \"a refreshingly zinester spin on the standard point-and-click\" - IndieGameReviewer<br/><br/>Facebook &amp; Twitter:<br/>www.facebook.com/FerrisMuellerGame<br/>www.twitter.com/FerrisMueller<br/> <br/>www.facebook.com/GlitchGames<br/>www.twitter.com/GlitchGames<br/><br/>Newsletter &amp; Future Game Releases:<br/>www.glitchgames.co.uk/newsletter", "metacritic": null, "released": "2014-01-16", "tba": false, "updated": "2020-04-15T10:00:30", "background_image": "https://media.rawg.io/media/screenshots/b95/b95f2a3093410f17dce3825fcf5a5d6b.jpg", "website": "http://www.glitchgames.co.uk/portfolio/ferris-muellers-day-off/", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 195, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "macOS", "Android", "iOS"], "developers": ["Glitch Games"], "genres": ["Adventure", "Puzzle"], "publishers": ["Glitch Games"], "esrb_rating": "Teen"}