{"id": 485895, "slug": "wayfarer-companion-book-of-psalms", "name": "Wayfarer Companion: Book of Psalms", "name_original": "Wayfarer Companion: Book of Psalms", "description": "<p><strong>Web version will not work on iPhone or iPad until Apple supports GLES3 in their Webkit . . . try the Mac or Windows downloads below. </strong></p>\n<p>On other devices (such as Mac, PC, Android): View in Chrome, Firefox, Edge, etc.  (not Safari)</p>\n<p><strong>Note:  The web version starts over each time you visit this web page.  It is meant as a demonstration of the app features.  To track your progress over a thirty day period, download one of the versions below or you can wait for the iOS or Android versions coming soon.   </strong></p>\n<p><strong>Just added more Bible versions.</strong>  Just go home screen and click on the Gear at the bottom left. </p>\n<p><strong>Wayfarer Companion : Book of Psalms.</strong></p>\n<p>Wayfarer Companion is a new way of reading the Bible.  It begins by allowing the Wayfarer to capture the state of the soul's affections (joy, compassion, peace, etc.) The next chapter of Psalms is selected using your soul affections and the Wayfarer Data Model, with the goal of increasing your faith .   As you journey through Psalms over a 30 day period, a song is generated based on your soul affections, increased faith and Isaiah 11:2 (the seven Spirits...). <br/></p>\n<p>Although version 1 is within weeks of completion--there's still so much more to do.  I value all comments and recommendations. </p>\n<p>This version is limited to Psalms 1 through 10.  I will continue to upload new versions as the data model is completed and other fixes and enhancements are ready.</p>\n<p>Wayfarer Companion: Book of Psalms will remain free, although a donation is appreciated.</p>\n<p>This early release is for Mac and Windows, but the goal is to release for iOS and Android by October 1, 2020.  </p>\n\n<p><strong>Coming soon:</strong></p>\n<p>1. Better sounds for the musical score</p>\n<p>2. Full Book of Psalms</p>\n<p>3. Fixes</p>\n<p>4. Cloud capabilities</p>", "metacritic": null, "released": "2020-08-25", "tba": false, "updated": "2020-08-28T05:08:11", "background_image": "https://media.rawg.io/media/screenshots/698/698f581ad79cf8f1c64d4869489369ad.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 54, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Web"], "developers": ["Wayfarer"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}