{"id": 485971, "slug": "bards-beat", "name": "Bard's Beat", "name_original": "Bard's Beat", "description": "<p>\"After an ensemble of bards played a forbidden musical score to get more power, the keepers of the world’s sound harmony, the Neumes, invaded the lands of Ertra, forcing men to barricade themselves in their castles. The knights proved to be powerless as the only weapon that could threaten the enemies is the bards’ music. These are therefore the only ones that can be sent to explore the dungeons of fallen castles to retrieve treasures and resources to make one's castle survive and prosper. But the monsters are not the only threat on their way, because in times of deep misfortune every alliance is broken, each castle fights for its own survival and every man can find an enemy in his neighbour.\"<br/><br/>The <strong>objective</strong> of the game is to explore the (procedurally generated) dungeon looking for the <strong>treasure chest</strong> and other resources. Each collected item is converted into a certain amount of <strong>gold</strong>, with the treasure netting a huge part of the dungeon’s total richness. Every match includes <strong>four players</strong> competing to collect the greatest amount of gold. If not enough players are available, remaining ones will be replaced by AI bots.\r\nThe game ends when a player <strong>reaches the exit</strong> while holding the treasure chest.\r\nAt the beginning of a match every player “spawns” in a different room of the dungeon. The <strong>position </strong>of the treasure room and the exit door are <strong>unknown</strong>. Each player has an <strong>empty map</strong> available which will be filled during the <strong>exploration</strong>.\r\n<br/>The dungeon is infested by the <strong>Neumes</strong>, monsters of different size and strength, inspired to the representation of notes in musical sheets. Each type of Neume, will have a different behaviour, to provide a strategic approach to fight and/or evade them. All of them though are <strong>attracted by sounds</strong> and will move towards it. Once a monster spots a player it will try to hunt him down depending on his attack behaviour.\r\nThe player can survive by <strong>casting spells</strong>. They are produced by <strong>performing songs using four notes</strong> in the correct sequence while following a musical <strong>track’s rhythm</strong>.\r\n<br/>The rhythm changes according to the number of enemies around the player or the amount of health points. This means that the more in danger you are, the more it will be difficult to play a song.<br/>\r\nThere are two kinds of spells: </p>\n<ul><li><strong>Offensive spells</strong> that cause damage to enemies and other players;</li><li><strong>Utility spells </strong>that have several useful effects;</li></ul>\n<p>Once a player performs a spell the sound of its music will be <strong>spread in the surrounding areas</strong> and can be <strong>heard by those around him</strong>. <br/><strong>Players</strong> have <strong>two fundamental resources</strong>:</p>\n<ul><li><strong>Health</strong>, which lowers whenever the player is damaged and can be restored by using the food item;</li><li><strong>Lute state</strong>, which lowers whenever a musical note is played and can be restored by using the string item;\r\n</li></ul>\n<p>Both items are scarce and valuable. For this reason the game encourages the application of smart solutions to overcome obstacles and not to rely on fighting (offensive spells) to solve every encounter.<br/><br/>Game developed by <strong>AMARcode</strong>:<br/><strong>Alessandro Ballerini</strong> - Game Designer &amp; Programmer<br/><strong>Matteo Moriani</strong> - AI Programmer (Procedurarly generated dungeons)<br/><strong>Andrea Marras</strong> - Game Designer, Programmer &amp; AI Programmer (mobs)<br/><strong>Riccardo Lombardi</strong> - Game Designer, Programmer, Sound Designer &amp; AI Programmer (player bots)<br/><strong>Giulia Rossi</strong> - 2D Artist<br/><strong>Jacopo Lonati</strong> - 2D Artist</p>", "metacritic": null, "released": "2020-08-25", "tba": false, "updated": "2020-08-28T05:24:17", "background_image": "https://media.rawg.io/media/screenshots/cce/cce8cd7d01976fe16c344ae28aa04a82.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 133, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["LombRicc", "jMattMorians"], "genres": [], "publishers": [], "esrb_rating": null}