{"id": 4859, "slug": "ys-the-oath-in-felghana", "name": "Ys: The Oath in Felghana", "name_original": "Ys: The Oath in Felghana", "description": "<p>When redheaded thrill-seeker Adol Christin and his eternal blue-haired companion Dogi make an unannounced visit to Dogi&#39;s homeland of Felghana after an eight-year absence, it quickly becomes apparent that things have changed dramatically. Hordes of violent monsters roam the outskirts of town, a long-dormant volcano has suddenly sprung back to life and the new lord of the land has begun mercilessly and inexplicably extorting money from its long-suffering citizens. While Dogi seeks out his former combat master for answers, Adol tends to the townsfolk -- and finds himself embroiled in a world of political conspiracies, ancient legacies and unthinkable taboos.<br />\nA complete 3D reimagining of the 16-bit console classic &quot;Ys III: Wanderers From Ys,&quot; Ys: The Oath in Felghana is a fast-paced action role-playing game with tight controls, Metroidvania-style exploration elements, intense combat with epic screen-filling boss battles, and a thrashing, percussive arranged soundtrack that&#39;s been heralded by many as one of the best of all time. Based on the original 2005 PC release, this classic is finally officially available in English with added Steamworks features such as achievements and cloud saving.<br />\nCome see why Falcom fans the world over regard this game as &quot;Ys, Perfected&quot;!Key Features:Six difficulty levels ranging from &quot;Very Easy&quot; for casual players to &quot;Inferno&quot; for true old-school gaming masters.<br />\nUnlockable &quot;Time Attack&quot; and &quot;Boss Rush&quot; modes for anyone looking to show off his/her boss-taming abilities.<br />\nOver 30 unique Steam Achievements as well as Steam Cloud support.<br />\nAdjustable high-resolution PC graphics with original blood effects intact.<br />\nGamepad support in addition to standard keyboard and mouse controls.</p>", "metacritic": 73, "released": "2005-06-30", "tba": false, "updated": "2023-11-18T16:12:16", "background_image": "https://media.rawg.io/media/screenshots/17d/17d956d6b091df7981be0eebf1743000.jpg", "website": "http://www.worldofys.com/ysf/", "rating": 4.16, "rating_top": 5, "added_by_status": {"yet": 55, "owned": 559, "beaten": 52, "toplay": 19, "dropped": 11, "playing": 3}, "playtime": 4, "achievements_count": 33, "ratings_count": 48, "suggestions_count": 539, "game_series_count": 14, "reviews_count": 49, "platforms": ["PC", "PSP"], "developers": ["XSEED Games", "Falcom"], "genres": ["Action", "Adventure", "RPG"], "publishers": ["XSEED Games"], "esrb_rating": "Teen"}