{"id": 485969, "slug": "crystals-of-planet-niberium", "name": "Crystals of planet Niberium", "name_original": "Crystals of planet Niberium", "description": "<p>Planet Niberium turned out to be rich in rare precious crystal. Space Corporation Sigma decided to extract these crystals. The extraction was carried out by NKX-627 Robot series. However, soon the Corporation Sigma discovered that they were not the only ones who were interested in the crystals. The invasion of the little-known species of biometal beetles on the planet Niburium was sudden. Numerous hordes of beetles occupied the bowels of the planet Niberium. As it turned out, beetles were absorbing almost infinite energy of the crystals, and it gave them a significant power increase and their species’ accelerated replication. Corporation Sigma was losing crystals robot-miners one after another. It appeared that the reaction of the contact of a robot with a beetle was an explosion with the destruction of both as a result. Corporation Sigma, as an interested party, using the currently available technologies, released a new search NKXgr-701 Robot series. This robot could change the gravity of certain types of matter by breaking the usual physical laws. It was decided to adjust the antigravitator to change the gravity of the stone masses, under the rubble of which the crystals were lying. Also, beetles could be blocked with stones in an enclosed space. The Corporation Sigma goal is to collect all the crystals and take them out...</p>\n<p>There are 20 levels in the game.<br/></p>", "metacritic": null, "released": "2020-08-25", "tba": false, "updated": "2020-08-28T05:23:49", "background_image": "https://media.rawg.io/media/screenshots/40a/40a675adee13030165703253d47308af.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 139, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Metamorpho_SG"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}