{"id": 485930, "slug": "ring-of-pain-demo", "name": "Ring of Pain (DEMO)", "name_original": "Ring of Pain (DEMO)", "description": "<p><strong>A new breed of card dungeon crawler!</strong></p>\n<p>Ring of Pain is a roguelike / card game / dungeon crawler mashup. Levels are generated randomly from decks of cards, and arranged in a ring, which lets you observe the level and strategise. As you interact with cards the dungeon dynamically adjusts based on what you're doing.<br/></p>\n<p>Ring of Pain blends elements of modern roguelike/roguelite dungeon crawlers (Binding of Isaac, Enter the Gungeon etc) with a turn-based card game, set in a world distorted by your mind. A cryptic world of fear and delusion.</p>\n<p><em>A challenge distilled, hard due to choice not mechanical skill.</em></p>\n<p><strong>Seek power - Find treasures with passive effects</strong></p>\n<p>Adapt your strategy with items collected, use mobility effects to explore the Ring.</p>\n<p><strong>Deck building with equipment - Manage your inventory</strong></p>\n<p>Choose wisely, as each inventory slot can only hold one of that item type.<br/><em>Strategy comes with inventory limits. What you can hold is a means to inhibit.<br/>Mix and match items within confines, of item types and slots defined.</em></p>\n\n<p><strong>Stack item effects</strong></p>\n<p>Collect items that work together to increase your chance of survival.<br/></p>\n\n<p><strong>Learn and adapt to a hostile world</strong></p>\n<p>Each dungeon is randomly dealt from a deck of cards, and arranged for you to see. See what creatures are about to do, and strategise based on the position of cards.Observe the ring and plan your action, creatures broadcast their reaction.</p>\n<p><strong>Unravel a dark mystery, one choice at a time</strong></p>\n<p>You find yourself broken and frail, scavenged by a creature who calls itself Owl. Owl is your caretaker and guide in this dark place. Your saviour, and protection from a creeping curse.<br/>Now you must discover your origin to decide on your future...</p>\n<p>Your mind is a lens distorting the world, a cryptic delusion for you to unfurl.<br/>When death approaches, readjust. Your final choice is... who to trust?</p>", "metacritic": null, "released": "2020-08-25", "tba": false, "updated": "2020-08-28T05:16:02", "background_image": "https://media.rawg.io/media/screenshots/ee7/ee7725cd29a4158b92b8e568d7c233f3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 193, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["twicedifferent"], "genres": ["RPG", "Strategy"], "publishers": [], "esrb_rating": null}