{"id": 485909, "slug": "starship-renata", "name": "Starship Renata", "name_original": "Starship Renata", "description": "Greetings, cadet!<br/><br/>I’m Admiral Desert Fish. I would first like to congratulate you for your over-achievements at the Imperial War Academy. The empire will expand its borders in deep space, thanks to young successful officers like you. <br/><br/>The War Council decided to send you and other promising candidates to the Battleship Renata, at the special request of Vice Captain Renata. Together with other candidates, you will be subjected to various tests for the management of the ship under the supervision of Vice Captain Renata.<br/><br/>During these tests, your skills as a pilot will be challenged from basic recon missions to space battles. You will be attending to ground missions with War Droid. As a result of these tests, the candidate who performs best in means of intelligence and leadership will be the new Captain of the ship.<br/><br/>You will be expected to serve the empire in the best possible way.<br/><br/>Welcome to Imperial Armada.<br/><br/><strong>GAME FEATURES</strong><br/><br/>80 different missions with challenging targets<br/>4 Different Co-Pilot with 20 different abilities. You need to choose the right Co-Pilot for the right mission.<br/>6 Different ships for you to choose from for different types of missions. <br/>Many upgrades for your ships.<br/>Rank up your character and unlock new missions, crew members and new space ships.<br/><br/><br/><strong>GAME PLAY</strong><br/><br/><br/><br/><strong>RACE</strong><br/>Race against time with your Corvette class battleship. Dodge the obstacles or hit them! Be aware of  your mission targets. You can use 3 different type Corvette class  ships for your missions. Every ship has its own abilities so you need to choose wisely.<br/><br/><br/><br/><strong>SPACE BATTLES</strong><br/><br/>The Empire may demand your support in space battles. You can use 3 different Frigate Class Ship in your missions. You will hunt the enemy spaceships and you need to do that according to your mission targets. Time limit, No blaster, No missiles. Get ready to be challenged in every aspect!<br/><br/><br/><br/><strong>GROUND BATTLES</strong><br/><br/>You will take control of the Juggernaut Class War Droid and you will raid the enemy bases. You will save hostages, Collect data and neutralize the enemies. As usual be aware of your orders, Cadet.", "metacritic": null, "released": "2020-08-25", "tba": false, "updated": "2020-09-11T10:58:39", "background_image": "https://media.rawg.io/media/screenshots/6ab/6ab6a41ad7c3db9735ee8a096ba2482c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 267, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["OEWORKS", "OE WORKS"], "genres": ["Action", "Shooter", "Racing", "Casual", "Indie"], "publishers": ["OE WORKS"], "esrb_rating": null}