{"id": 486083, "slug": "learning-electronics-resisitors-capacitors", "name": "Learning Electronics - Resisitors & Capacitors", "name_original": "Learning Electronics - Resisitors & Capacitors", "description": "<p><strong>LEARNING ELECTRONICS - RESISTORS &amp; CAPACITORS</strong><br/></p>\n<p>This program is meant to help you learn some basic electronics. It covers the nature of resistors and capacitors and the calculations for total resistance and total capacitance in series and parallel circuits. There are four simulations screens, 6 study screens, and one review test screen. It covers the terms ohm, Faraday, series circuit, parallel circuit, current, Amp, electric potential, and voltage.  It also presents the mathematical formulas used to calculate the total resistance or capacitance for series and parallel circuits. The electronic schematic symbols of a resistor and a capacitor are also shown. The final screen is a Review Test in which the user must match a tile with a displayed phrase. There are 21 items covered and they are presented in a random order with shuffled answers. The user can reveal the correct answer by selecting the \"Hint\" button or pressing the letter H on the keyboard. A score is represented as a percent Accuracy which is based on the number of correct clicks and the total clicks used. The final screen may be printed to show the score, number of hints used, and the final accuracy.<br/>This game is distributed as \"Totally Free\". This means it is free, does not contain any advertising, does not collect any personal data, and does not access the internet at all. This program can be installed on an unlimited number of computers running Windows 7 through 10.  This program should run on a variety of Linux distributions using Wine or PlayOnLinux. Visit https://sites.google.com/view/rtcgames/home to see a list of \"Totally Free\" Android applications and Windows programs from rtcgames.  <br/>Please send all questions and comments to Rich Carman at rtcarman47@gmail.com</p>", "metacritic": null, "released": "2020-08-24", "tba": false, "updated": "2020-08-28T05:49:25", "background_image": "https://media.rawg.io/media/screenshots/37b/37b462771523bddb9486b26e6b32b072.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 66, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["rtcgames"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}