{"id": 48600, "slug": "empires-and-allies", "name": "Empires and Allies", "name_original": "Empires and Allies", "description": "Welcome to Empires &amp; Allies: The critically acclaimed modern-military combat strategy game.<br/><br/>Deploy modern military troops and vehicles in a global war against terrorist forces. <br/><br/>Plan your approach, evolve your battle strategy and equip and train your  army to fight the enemy. <br/><br/>Team up with friends and players from around the world to form an alliance. Share troops and resources to gain the upper hand in epic PvP battles and alliance wars in a battle for global domination. <br/><br/>FEATURES<br/><br/>✓ DESIGN YOUR ARMY from the arsenals of modern military.  Deploy battle-hardened soldiers, veteran commandos, tanks, drones, helicopters, sentries with machine guns, laser guns, experimental tech, robots and much more.<br/>✓ DEPLOY THE WEAPONS OF MODERN WAR from tactical nukes and hellfire missiles to orbital strikes.<br/>✓ DOMINATE WITH MASSIVE HEROES - OMEGA UNITS -  unique mechs each with their own strengths and attributes dominate the battlefield.<br/>✓ BATTLE IN ALLIANCE WARS with up to 100 other players as your alliance clan fights to control the globe.<br/>✓ DYNAMIC BATTLEFIELDS deliver increasingly difficult scenarios that simulate real-world modern war.<br/><br/>Check out the elite new MMO, and get ready to annihilate the enemy!<br/><br/><br/>ADDITIONAL DISCLOSURES:<br/><br/>- Use of this application is governed by the Zynga Terms of Service. These Terms are available through the License Agreement field below, and at http://m.zynga.com/legal/terms-of-service.<br/>- For specific information about how Zynga collects and uses personal or other data, please read our privacy policy at http://m.zynga.com/privacy/policy. Zynga’s Privacy Policy is also available through the Privacy Policy field below.<br/>- This game does permit a user to connect to social networks, such as Facebook, and as such players may come into contact with other people when playing this game.<br/>- Terms of Service for Social Networks you connect to in this game may also apply to you.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:09:54", "background_image": "https://media.rawg.io/media/screenshots/e07/e07422d47006f19514c02c13c3abc734.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 465, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Zynga"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}