{"id": 48614, "slug": "dungeon-ascendance-roguelike", "name": "Dungeon Ascendance Roguelike", "name_original": "Dungeon Ascendance Roguelike", "description": "Roguelike meets RPG meets Puzzle game in Dungeon Ascendance!<br/><br/>Not played before? Try before you buy: Free version available! (link below)<br/><br/>Choose one of twelve brave heroes then conquer a dungeon filled with monsters and loot! Use a tactical mixture of abilities, items, spells and cold, hard steel to fight your way to the exit. But beware! The stairs are guarded by a fearsome Dungeon Master who isn't planning on letting you past.<br/><br/>The full version features twelve classes with unique abilities, fifteen dungeons and a whole lot of tactical rpg-puzzle gameplay. You also get a full achievements system including unique challenges for every class.<br/><br/>If you completed the Free Version you can unlock your progress in this version - so you don't lose anything upgrading!<br/><br/>Brand new graphics from ShroomArts! Not exactly pixel art, but in the great tradition of 16-bit and console RPGs. Veterans note: the old tiles are still available from the Config menu.<br/><br/>So why do we call Dungeon Ascendance a roguelike puzzle game? DA has the random, proceedural level generation of a roguelike, the turn-based combat of a roguelike and the varied classes of a roguelike. But it also has the level-by-level, strategic 10-minute satisfaction of a puzzle game. There's never just one solution to a level but the game feels at least half a puzzle.<br/><br/>Compatible with Android phones and tablets. Care has been taken so the game runs well on low-end devices.", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:09:53", "background_image": "https://media.rawg.io/media/screenshots/06a/06a44c3761feeeb79dc60d70932c9cc5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 302, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Seramy Games"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}