{"id": 486265, "slug": "fall-of-bronze", "name": "Fall of Bronze", "name_original": "Fall of Bronze", "description": "<p>Welcome to Fall of Bronze, a game taking place during the Bronze Age Collapse(Extra Credits videos linked below). You must <strong>take care </strong>of the nation of Alazar during this extremely volatile time. Every action counts, and may easily determine the collapse of your nation. Therefore, you must <strong>take care </strong>with every action that you take. Winning is impossible, for the odds are stacked against you. How long will <strong>you </strong>delay the inevitable?</p>\n<p>You start out controlling 25 Provinces.  There are also 25 more \"uncontrolled\" provinces, available for your conquest. Maintain the stability of Alazar and the loyalty of the Provinces, otherwise you will lose your territories. If all your territories are lost, it's game over.</p><p>In this tumultuous time, Earthquakes and Famines are constant, so don't be surprised when your population suddenly goes down. Be careful, however - if a Province loses all its population, it will become permanently abandoned! Together with loyalty, the population of a province can be managed using the interactions available on the Province Page.  <strong>Take care</strong>, however - you only have a limited number of interactions per season, and some actions may forbid you interacting with provinces for a limited time. </p><p>Keep the Three Groups of Alazar - The Boyarane(Nobles), Persane(People) and Rabane(Slaves) - happy, or expect your stability to fall. </p><p>Speaking of Stability - There is only one way to increase it, and it requires sacrificing a good amount of your population.</p><p>So <strong>take </strong><strong>care </strong>with every action you take, for the slightest mistake may mean the complete collapse of Alazar - inevitable, yet unexpected.</p><p>Enjoy!</p>", "metacritic": null, "released": "2020-08-24", "tba": false, "updated": "2020-08-28T06:30:09", "background_image": "https://media.rawg.io/media/screenshots/f17/f170df73661192deb5fc613abedfb2cc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 26, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["MysteriousDeveloper"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}