{"id": 486242, "slug": "grocery-dot-exe-a-virtual-pandemic-shopping-simula", "name": "GROCERY DOT EXE: A Virtual Pandemic Shopping Simulator", "name_original": "GROCERY DOT EXE: A Virtual Pandemic Shopping Simulator", "description": "<p>GROCERY DOT EXE is an extremely silly game about going shopping in a virtual reality in the midst of both physical and malware pandemics.  Jack on in to your local 1-stop shop, Grocery Warez, LLC, peruse the aisles trying to pick up everything on your list, prioritising purchases to avoid running out of money and missing the most important stuff, avoiding malware-laden merchandise, and maintaining a safe distance from other patrons, seeing them off by saying \"Take Care\" with your avatar's text-to-speech device.</p>\n<p>There's no combat, minimal drama, and a chill, synthwave retro-future atmosphere likely only punctuated by your friends spamming the Take Care button at you.  Playing alone is the easiest (and safest) way of doing things, since you're not competing for merchandise or crowding the halls, but the game is at its best when you have a couple of friends around to join in the socially-distanced shenanigans - if you've got the port forward required to run games like Garry's Mod or TF2 that use port 27015, it's easy to host a server &amp; get all your friends together for a shopping run.</p><p><strong>BUG WARNING: Something is broken with the Jack Out/SCRONCHED exit buttons that appear when your shopping spree is done, one way or another!  Exit the game with Alt+F4!</strong><br/></p>\r\nFEATURES\r\n<ul><li>Virtually Distance!<ul><li>Even if you know you're not infected, you can't know if anyone else is free of contamination or not!</li><li>Maintain a safe distance from your fellow patrons to avoid spreading malware - failure to do so could see you booted for wanton virtual plague-rattery!</li></ul></li><li>Communicate!<ul><li>PRESS V TO TAKE CARE</li><li>(You - and everyone else - have temporarily borrowed a janky copy of the Emperor's Text-To-Speech device with which to say \"Take Care\" to your fellow patrons.)</li></ul></li><li>Go shopping in a world of silly synonyms and shade-throwing references!<ul><li>You need things!  They need things!  Everybody needs things!  If you're unlucky, your shopping list may exhaust the store!</li><li>Furthermore, some items may be contaminated, meaning you'll have to carefully work around them - if you pick one up by accident, the malware might spread to your avatar!</li></ul></li><li>Vague funnies and ill-thought-outness!<ul><li>The whole premise is incredibly dumb &amp; hopefully kinda funny, and so much of what you're shopping for is <em>also</em> incredibly dumb and hopefully kinda funny.</li><li>Unfortunately, four in the morning isn't a good time to write jokes, so it's probably JUST going to be dumb.</li></ul></li></ul>\r\nNOTES\r\n<p>The game defaults to hosting on port 27015 (though this can be changed), and uses pretty bog-standard direct IP connection - pop in your friend's IP (e.g, as providing by googling \"what is my ip\"), their port of choice if it's been changed, and mash \"connect\" - you should be out in the jack-in lot of Grocery Warez, LLC right after!</p>\n<p>Due to the pretty laid-back low-gameplay nature of things (it's really just about retail therapy and spamming Take Care at your buddies), there probably won't be any official servers for this version - set your own up and invite friends, viewers, or your fellow socially-isolated housemates to join in the shopping shenanigans instead.</p>\n<p>Please don't take any of the dumb shade-throwing in the item names or descriptions personally - it's all meant in good fun!</p>\n<p>Note that the final version for the jam had a vast majority of the complicated game-developy bits done in the final evening up to about 0430 in the morning, so things are a bit janky and low-fi.  Post a comment if you find any bugs while playing, and seriously - apologies for how rushed and wonky the whole thing is.</p>\n<p>A polish pass will probably come in a few days to hopefully smooth out some of the roughest edges and deal with any critical bugs.</p>\r\nChallenges\r\n<p>Did take a whack at trying to participate in a few of the EC challenges.</p>\r\nExtra Retro\r\n<p>The obvious one - the whole thing is an (admittedly not very polished) retro virtual reality where things are low poly, gigabytes are breaking edge, and everything is colored in High-Intensity CGA Palette 0 - would've gone further and done a shader that makes EVERYTHING match that palette, a-la Obra Dinn's dithering shader, but between time constraints and wanting to chuck a computer out a window whenever shaders get involved, that got cut.</p>\r\nExtra Distance\r\n<p>The other obvious one - the game is literally just a socially-distanced shopping simulator.  Not original by any stretch of the imagination, and falls flat if you don't have buddies to play with, but still very much present.</p>\r\nExtra Historian\r\n<p>This one's just present as an easter egg vaguely referencing half-remembered merch from a couple years ago and may fall completely flat.</p>\r\nExtra Translation\r\n<p>Aside from using hexadecimal and binary in a couple of places as an inside joke for programmers, this doesn't really show up at all.</p>\r\nATTRIBUTION &amp; THANKS\r\n<ul><li>http://blog.runtimedevelopment.com/index.php/2017/02/17/text-occlusion-in-unity/: A useful post w/ drop-in code for standard 3d text that won't render through geometry.  This was necessary as TextMeshPro's font atlas generator is borked under Linux.</li><li>http://laemeur.sdf.org/fonts/: The More Perfect DOS VGA font used in all text seen within the game - this is my go-to for cool retro computery text, and was in Powerbot 9044 as well.</li><li>https://tetyys.com/SAPI4/: Source of the \"Take care.\" voiceline.  It's not QUITE the voice of the Man-Emperor of Mankind, but we honestly didn't have time to pester Alfabusa to ask if we could nick his TTS device, so it'll do.</li></ul>", "metacritic": null, "released": "2020-08-24", "tba": false, "updated": "2020-08-28T06:25:43", "background_image": "https://media.rawg.io/media/screenshots/6ef/6ef58e1cd8511b909e2f16e7c3d6b31b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 55, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["CliffracerX"], "genres": [], "publishers": [], "esrb_rating": null}