{"id": 486381, "slug": "the-right-path", "name": "The right path", "name_original": "The right path", "description": "<p>\"<em><strong>The Right Path</strong></em>\" is my first Game Jam submission ever! I've made a short 2D Visual Novel / Exploration game, I hope you like it!</p>\n\n<p>I made this game for the Extra Credits Game Jam #6 the theme of which was \"Take Care\". With that in mind, I decided to make a 2D game using Unity in which you have to take care of yourself in a maze.</p>\n<p>The game features both exploration elements and visual novel inspired interactions. So you'll have to find food to survive and make the right choices to manage to reach one of the endings. Good luck!</p>\n<p>There is a couple of negatives I should mention about the game. The first is that <em>English is not my first language</em>, so I apologize if there's some errors or weird structures in the text. The other negative is that the story isn't as finished as I had hoped to make it. The first level takes place on the first day of school, where you get bullied by some classmates who enjoy making it difficult for you to get to school. The level that now it's the second was meant to be the fourth, and takes place many days, and some events, after the first. But unfortunately I wasn't able to implement the rest due to lack of time. </p>\n<p>This is the first project I've ever published somewhere and the first time I've had to buid a game on my own in such a short time. I hope you enjoy it as much as I enjoyed participating!</p>\n\n<p><strong>Controls </strong></p>\n<p>WASD to move ( or gamepad but you still need the mouse)</p>\n<p>Mouse to make choices</p>\n<p>And yup, that's it.</p>", "metacritic": null, "released": "2020-08-24", "tba": false, "updated": "2020-08-28T06:56:58", "background_image": "https://media.rawg.io/media/screenshots/6b7/6b727053ac64d7ef1735b5b88ad17829.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 8, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["mumaitron"], "genres": [], "publishers": [], "esrb_rating": null}