{"id": 48644, "slug": "discover-o-match-colors", "name": "Discover O - Match Colors", "name_original": "Discover O - Match Colors", "description": "Discover O is a color matching fast reflex game that challenges players color coordination. <br/><br/>In the latest update of Discover O inspired by Game of Thrones you can uncover dragons, massive Titans, wolves and war ships while you deftly swipe your way through Discover O listening to an epic soundtrack. <br/>Unlock the home of dragons, land of kings, the wall, icy castle and the land of Titan. <br/><br/>Set in vibrant minimalist worlds inspired by our favourite destinations around the globe, Discover O is equal parts addictive and inspiring. <br/><br/>Discover O asks the player to swipe the centre O up, down, left or right to match it to the right color. The difficulty increases as the colour of the rotating walls around the O start to converge and mimic each other. <br/><br/>As the player continues, the O shrinks at an increasing speed so the user must move quicker with every correct swipe. <br/><br/>Swipe successfully to discover minimalist expressions of five different Worlds and five different Thrones<br/><br/>Epic Discover Thrones soundtrack was composed in the heart of Bombay, India by DJ Nanok. <br/>Follow him on Facebook and Soundcloud for sweet tunes: <br/>www.facebook.com/Nanokofficial <br/>www.soundcloud.com/Nanokofficial<br/><br/>Follow BYOF Studios on: <br/>Twitter: @BYOFStudios<br/>Facebook: www.facebook.com/byofstudios (http://www.facebook.com/byofstudios)", "metacritic": null, "released": null, "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/57a/57af8be5d23e83b5704fb8b62d90ae41.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 44, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["BYOF Studios"], "genres": ["Casual"], "publishers": [], "esrb_rating": "Everyone"}