{"id": 486477, "slug": "plague-doctor-carterjgreene-daniel-douros", "name": "Plague Doctor (carterjgreene, Daniel Douros)", "name_original": "Plague Doctor (carterjgreene, Daniel Douros)", "description": "<p><strong>Make your rounds as a village's chief medical expert! Examine your patients and craft the right cure to fit their needs!</strong></p>\n<p>In keeping with the theme of \"Take Care\", you play as a plague doctor who must protect their village from a terrible plague that has swept across the kingdom.</p>\n<p>Hunt for reagents in the Midnight Forest!</p>\n<p>Interact with thirteen individual NPC's, each with their own daily routines and special roles!</p>\n<p>Each game is completely randomized, so no two playthroughs are the same!</p>\n<p>How long can you last??</p>\n\n<p><strong>CONTROLS</strong></p>\n<p>On the village screen,  click on locations to visit them. <br/></p>\n<p>When visiting a home or the town square, using WASD or ARROW KEYS to move your character. When near a villager, press [T] to talk to them. Use WASD or ARROW KEYS to navigate conversation choices.</p>\n<p>When exploring the Midnight Forest, use WASD or ARROW KEYS to move your character and press [E] to pick up any reagents you come across.</p>\n<p>Press [I] at any time to open up your inventory menu. Use WASD or ARROW KEYS to navigate. On the left side of the menu, any reagents you pick up or cures you crafted are listed. Press [X] to throw out 3 of a selected item. On the right side of the menu is an index of all the cures you can create. Press ENTER to flip to the selected cure’s page, where it’s ingredients and attributes are listed. While on a cure’s page, pressing [C] will craft 1 of that cure and place it in your inventory if you have enough ingredients.</p>\n\n<p><strong>HELPFUL TIPS</strong><br/></p>\n<p>Pay attention to the notification bar at the top of the screen. It will alert you to villager movements and deaths!</p>\n<p>Reagents replenish in the Midnight Forest with each passing hour, so be sure to visit often!</p>\n<p>Each day, any laborers in the village will leave to go to work if they are not quarantined. When they return, they will donate part of their earnings to the village treasury!</p>\n<p>When administering medicine to a villager, giving them a reagent will have no effect. <br/></p>\n<p>Be sure that the cure you give to a villager will heal the symptoms they have before you administer it. You can view each cure’s attributes in the crafting menu (found in the inventory).</p>\n<p>Villagers can transmit symptoms to each other, so if one falls ill be sure to check their roommate for the same issues.</p>\n\n\n<p>Made in GameMaker Studio 2 for the 2020 Extra Credits Game Jam by Carter Greene and Daniel Douros<br/></p>", "metacritic": null, "released": "2020-08-24", "tba": false, "updated": "2020-08-28T07:17:59", "background_image": "https://media.rawg.io/media/screenshots/9e1/9e118c0c97c8177a52f5c89ae18795c4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 70, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Daniel Douros", "carterjgreene"], "genres": ["Strategy", "Puzzle"], "publishers": [], "esrb_rating": null}