{"id": 48664, "slug": "dead-on-arrival-2", "name": "Dead on Arrival 2", "name_original": "Dead on Arrival 2", "description": "MASSIVE UPDATE JUST ARRIVED!<br/>***************************************<br/>Think you know Dead on Arrival 2, well think again! Download this massive update with all new undead action!<br/>- The zombies have mutated and are harder and faster than ever. One or two hits from the undead and it’s game over!<br/>- Jump into single player and try out the new kill based scoring.<br/>- The steel mill now spans over 5 levels to massacre the undead!<br/>- Complete all new personal best bonuses and challenges to score some big Zbucks!<br/>- In a tight spot? Not to worry, we’ll come to your rescue with all the gear you need, when you need it so take note of the weapon and power-up prompts!<br/>- The mystery box now has a cool down timer before you can use it again. You just need to stay alive long enough to give it another go.<br/>- One gun on the wall is just not enough to fight the zombie horde. We’ve swapped this up with an entire arsenal of kickass weapons and power-ups for you to stay alive.<br/>… Don’t like the new look and feel? Not to worry. Multiplayer is still the game you know and loved so head on over with your friends and take on the undead together.<br/>***************************************<br/><br/>Intense co-operative zombie survival!!<br/>Tear through wave after wave of the walking dead as you fight for your life in an industrial playground filled with deadly traps and deadlier enemies.  An intense top down survival shooter, bringing console quality graphics to your mobile device.<br/> <br/>Featuring a Strategic Spending System, survival is based not just on your skills but also the decisions you’ll make about how to spend the precious Z-Bucks earnt from each kill. Making the wrong decision between more ammo now or a better weapon later could mean life or death.<br/> <br/>Team up with friends or strangers in 2-4 multiplayer and apply Mods to change the experience and give yourself the edge. Did somebody say Ice Bullets?<br/><br/>How long can you survive the zombie onslaught?<br/> <br/>Yes that's right! You can fight the zombie horde alone or join forces and take on the bloodthirsty masses with up to 3 other players in co-op mode. <br/><br/>KEY FEATURES<br/> <br/>CONSOLE QUALITY GRAPHICS<br/>Advanced lighting and shaders bring you a dark and gritty version of the zombie apocalypse<br/><br/>INTENSE ARCADE SURVIVAL<br/>How long will you survive against endless waves of the undead?<br/><br/>2-4 PLAYER CO-OP MULTIPLAYER<br/>Team up with your friends to fight the zombie horde together.<br/> <br/>EXPLORE AN EXPANSIVE, DANGEROUS ENVIRONMENT<br/>Unlock new areas of the map and use environmental traps to survive<br/><br/>STRATEGIC SPENDING SYSTEM<br/>Will you choose to buy more ammo for your pistol, unlock the door to the next area or save your Z-bucks to buy the rocket launcher? Better decide fast, the horde is right behind you!<br/><br/>MODS LET YOU PLAY IT YOUR WAY<br/>Unlock and equip special modifiers such as Double Damage, Ice Bullets, Healing and more to change the way you play the game<br/><br/>CUSTOMISE YOUR CHARACTER WITH A HUGE RANGE OF COSTUMES<br/>Just because its the end of the world doesn’t mean you can’t fight the undead as a dinosaur. Or in scuba gear.<br/><br/>OPTIMISED FOR TEGRA 4<br/>Showcase the power of your NVIDIA Tegra 4 device (such as the NVIDIA Shield) with Dead on Arrival 2<br/><br/>The sequel to Dead on Arrival brings new graphics, new zombies, new battlegrounds and new upgradeable weapons.<br/><br/>Keep pulling that trigger and see how long you can survive.<br/><br/><br/>NOTE: If you have trouble loading the game or get an .obb error, please reboot your device and try again. You can also try uninstalling and reinstalling the game. <br/>We are also working to resolve loading issues with certain chipsets like the Snapdragon 800 (LG G2, Xperia Z etc).", "metacritic": null, "released": "2013-11-12", "tba": false, "updated": "2019-07-30T11:02:48", "background_image": "https://media.rawg.io/media/screenshots/525/5251d645ca26edbd8490c0084d2632d3_TmAfLqT.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 434, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["N3V Games"], "genres": ["Action", "Arcade", "Casual"], "publishers": ["N3V Games"], "esrb_rating": "Mature"}