{"id": 486744, "slug": "dress-up-time-princess", "name": "Dress up! Time Princess", "name_original": "Dress up! Time Princess", "description": "You've been looking forward to the summer break, but now you have to go visit your grandpa in Paradise Town. This mysterious place, your doddering grandpa, and your mother's old bedroom... You can't help but feel that there's a secret hidden here.<br/><br/>A dusty old lectern shall become the gateway between reality and the world of books, and open up the way to a beautiful, magical adventure.<br/><br/>Step into Versailles, and fight the chaos threatening the kingdom over an opulent necklace; obtain stunning palace attire, and immerse yourself in 18th century Rococo beauty. Of course, you will also meet a special person in your life, and face difficult decisions in critical situations...<br/><br/>-Unique and beautiful attire and accessories<br/>Every story will have its own style that suits the world it's set in: ancient, modern, eastern, western, and more.<br/><br/>-Dramatic story-changing choices<br/>The story's ending and the fate of its characters lie in your hands.<br/><br/>-Highly customizable clothing DIY<br/>Use your imagination and apply special styles, patterns, and colors to customize everything to your liking.<br/><br/>-Relaxing and fun pet system<br/>Collect cute kitty cats of various colors and markings, and send them out to help you collect materials. There's no need to replay stages over and over again. Get all you need in a fun and carefree manner.<br/><br/>-Make friends and share your wardrobe<br/>Make friends with fellow players all over the world, and share your clothes and your creativity!", "metacritic": null, "released": "2020-08-27", "tba": false, "updated": "2020-09-07T02:39:32", "background_image": "https://media.rawg.io/media/screenshots/585/585d8af6d1f6c63f2be656e91c96e757.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 180, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["IGG.COM"], "genres": ["RPG", "Casual"], "publishers": ["IGG SINGAPORE PTE"], "esrb_rating": null}