{"id": 486750, "slug": "trucks-and-things-that-go-puzzle-game", "name": "Trucks and Things That Go Puzzle Game", "name_original": "Trucks and Things That Go Puzzle Game", "description": "Young children are fascinated by Things That Go and these colorful puzzles of the fastest, biggest and most amazing vehicles in the world will keep toddlers entertained for hours. From a spectacular giant bulldozer, crane, monster truck to a high speed train, spaceship, police boat and go-cart. Each has their name played in English and Hebrew so that children can learn what they’re called, build their truck, diggers and vehicles vocabulary, and start to develop word and picture association.<br/><br/>Kids Place the pieces correctly on the puzzle to hear the word and sound of wheeled excavator, mini loader, cement mixer truck, ice cream truck, combine harvester, rescue helicopter, police boat and much more!<br/><br/>Trucks and Things That Go is a colorful shape puzzle of trucks, ships, planes, trains and much more. This is the perfect app for kids who love trucks, diggers, tractors, trains and things that go. In  Things That Go they’ll discover bright, bold puzzle elements of different kinds of transportation vehicles - trucks, tractors, airplanes, trains, diggers and more, from farm vehicles to emergency vehicles to construction vehicles. <br/>If you have a child who is interested in different vehicles this is a great educational and fun learning game.  Things That Go is bursting with vehicles that kids will love learning the name, hearing the sounds and spotting in the world around them. <br/><br/>Trucks and Things That Go is an eye and ear catching puzzle enhances matching and listening skills. Let your toddler play with it, while enriching their language skills, developing their fine motor skills, and learning names and sounds of numerous objects. <br/><br/>Features: <br/>* Hebrew and English <br/>* Over 70 of the world’s most amazing  vehicles<br/>* Learn the name of the vehicle and hear its sound – Crane, Fire truck, car transporter, bulldozer and much more<br/>* Different themes<br/>    * Trucks<br/>    * Constructions<br/>    * Trains<br/>    * In the air<br/>    * Farm<br/>    * Emergency <br/>    * At sea<br/>    * And more<br/><br/>-----------------------------------------<br/>Like us on Facebook: http://www.facebook.com/myfirstpuzzles<br/>Visit us: http://www.kids1stpuzzles.com<br/>Email us: myfirstpuzzles@gmail.com<br/>Follow us on twitter: @Kids_1ST_Puzzle<br/><br/>-----------------------------------------<br/>We take children's privacy very seriously, our apps:<br/>- Do not collect any information<br/>- Do not contain ads<br/>- Do not contain in-app purchases<br/>- Do not contain integration with social networks<br/>- Do not use analytics / data collection tools<br/>- Do include a link to Kids 1st shape puzzle app in the iTunes AppStore", "metacritic": null, "released": "2012-08-16", "tba": false, "updated": "2020-08-31T02:27:15", "background_image": "https://media.rawg.io/media/screenshots/027/027c525c71febc8c2dab959f1e76178a.jpg", "website": "http://www.kids1stpuzzles.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 125, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Gil Weiss"], "genres": ["Educational", "Puzzle"], "publishers": ["Gil Weiss"], "esrb_rating": "Everyone 10+"}