{"id": 48677, "slug": "rpg-cross-hearts-arcadia", "name": "RPG Cross Hearts Arcadia", "name_original": "RPG Cross Hearts Arcadia", "description": "SPECIAL PRICE<br/>33% OFF(USD 5.99 -&gt; USD 3.99)!!!<br/><br/>* This app may not work on Android 8.0. We are currently working on an update.<br/><br/>A great adventure between an Eng and its Algiz!<br/><br/>Researching an ancient ruin, Nirva hears a strange voice that leads him to an \"egg\" deep in the ruin which he takes home.<br/>In time, that egg turns into a curious fairy.<br/>The fairy named Tylt asks Nirva to travel to the Genesis Sanctuary together...<br/>A fantasy RPG where you set off from the floating continent Nirva calls home with his mysterious fairy Tylt on an adventure to find the Genesis Sanctuary!<br/><br/>Tylt - A fairy that evolves<br/>Tylt grows as you progress in the adventure.<br/>Tylt's appearance and form will change with each evolution. Each change depends on a number of factors.<br/>Try different things to see other sides of Tylt.<br/><br/>Travel together with friends<br/>Nirva meets many unique characters that support him in various quests.<br/>They provide support in battle and also influence Nirva's bond with Tylt.<br/><br/>Create equipment at the Forge<br/>You can create or disassemble specific weapons at the Forges in towns and villages.<br/>To create weapons, you must have \"recipes\" from people and the required materials in your inventory.<br/>You can also get materials by disassembling unnecessary weapons.<br/><br/>Challenger's Hall<br/>Purchase additional CHA points at the Challenger's Hall.<br/>CHA points can be used to purchase items which include a key to enter a special dungeon where you can get rare items and other items unavailable in the main story.<br/>Enjoy a greater adventure with in-app purchases!<br/>*In-app purchases are not required to finish the main story.<br/><br/>*The actual price might differ depending on the region.<br/><br/>[EULA]<br/>Users must agree with our End User License Agreement before buying any of our Applications.<br/>http://kemco.jp/eula/eula_EN.html<br/><br/>[Supported OS]<br/>- 2.1 to 5.1<br/>[Supported Screens]<br/>- HVGA (320x480) and up<br/>[Xperia(TM) PLAY]<br/>- Not optimized.<br/>[SD Card Storage]<br/>- Enabled<br/>[Supported Languages]<br/>- Japanese, English (How to switch to English on ver 1.0.2g: Title screen &gt; Option &gt; Language)<br/>[Non-Supported Devices]<br/>- HT-03A(OS1.6), Xperia(OS1.6), LYNX(OS1.6), Optimus chat(OS2.2), IS01(OS1.6), 003Z(OS2.2), S31HW(OS2.2), Aria(OS2.2)<br/>（This app has generally been tested to work on any mobile device released in Japan. We cannot guarantee support on other devices.）<br/><br/>Get the latest information!<br/>[Newsletter]<br/>http://kemcogame.com/c8QM<br/>[Facebook page]<br/>http://www.facebook.com/kemco.global<br/><br/>(C)2012-2013 KEMCO/Hit-Point", "metacritic": null, "released": "2013-08-01", "tba": false, "updated": "2019-08-02T03:28:51", "background_image": "https://media.rawg.io/media/screenshots/99d/99dcf9b384eaff6b71d315b7ba5076b4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 423, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["KEMCO", "Kotobuki Solution Co"], "genres": ["Adventure", "RPG"], "publishers": ["Kotobuki Solution Co"], "esrb_rating": "Everyone 10+"}