{"id": 486973, "slug": "a-tale-of-rezing", "name": "A TALE OF REZING", "name_original": "A TALE OF REZING", "description": "<p><strong>A TALE OF REZING AND GREAT LITH</strong></p>\n<p>------------------------------------------------------</p>\n<p><strong>RU</strong></p>\n<p>Описание:</p>\n<p>Лит - великий и ужасный чертог злого бога Мавруса. В нем обитают различные чудища, скелеты-гиганты, черные маги и демоны, созданные самим Маврусом. Но главный \"бриллиант\" злого Бога - дракон Саргох, его правая рука.</p>\n<p>Адевард Резинг - легендарный герой королевства Бальфаса, попадает в Лит во время сражения с армиями тьмы.</p>\n<p>Противостоите проклятому Литу и сразите Саргоха, оставив его имя лишь в легендах...</p>\n<p>От автора:</p>\n<p>Данная игра сделана для эксперимента на RGM 5.31 и создавалась в короткие сроки, не ждите от нее чего то большого, это маленькая игра чтобы скоротать время.<br/>Наслаждайтесь:)</p>\n<p>------------------------------------------------------</p>\n<p><strong>EN</strong></p>\n<p>Lith - the great and terrible world of the evil God Mavrus. It is home to various monsters, giant skeletons, black magicians and demons created by Mavrus himself. But the main \"diamond\" evil God - dragon Sargoch.</p>\n<p>Adevard Rezing - a legendary hero of the Kingdom of Balfas, falls into Lith during the battle with the armies of darkness.</p>\n<p>Challenge Lit and overthrow the dragon Sargoch, leaving its name only in legends</p>\n<p>From the author:</p>\n<p>This game is made for an experiment on RGM 5.31 and was created in a short time, do not expect anything big from it, it is a small game to pass the time.</p>\n<p>Enjoy:)</p>", "metacritic": null, "released": "2020-08-20", "tba": false, "updated": "2020-08-31T03:18:55", "background_image": "https://media.rawg.io/media/screenshots/c34/c34d15e762e23428e6991b488aefb4e9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 222, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["Captain Midnight"], "genres": ["Action", "Adventure"], "publishers": [], "esrb_rating": null}