{"id": 48690, "slug": "construction-simulator-2", "name": "Construction Simulator 2", "name_original": "Construction Simulator 2", "description": "Construction Simulator 2 - One of the most successful simulators in the Googleplay Store!<br/><br/>In Construction Simulator 2, you build your own construction company and take the wheel of 40 original, licensed construction vehicles from Caterpillar, Liebherr, Palfinger, Bell, STILL, ATLAS, and Kenworth. Dig to your heart's content in the popular sequel to Construction Simulator 2014, operate massive cranes, load construction materials, pour concrete, and cover the streets in Westside Plains city with asphalt. Construction Simulator 2 takes you to the USA and offers up road construction and tons of jobs with construction vehicles to match. Expand into new regions, enlarge your fleet, and master more than 60 engaging and challenging construction jobs.<br/><br/>Critical praise: <br/>\"An impressive gameplay experience\" – Highways.today<br/><br/>\"Construction Simulator 2 looks beautiful, and it’s shaping up to be a deep, tranquil, surprisingly engrossing simulation of an activity you never imagined enjoying in a million years\" – GameZebo.com<br/><br/>\"Construction Simulator 2 is a beautiful-looking game\" – TouchTapPlay.com<br/><br/>\"Construction Simulator 2 is currently deemed to be the most comprehensive construction simulation game for smartphones and tablets\" – Gamershell.com  <br/><br/>AN EXTENSIVE FLEET IN CONSTRUCTION SIMULATOR WITH 40 AUTOMOBILES AND MACHINES Original, licensed vehicles and machines from Caterpillar, Liebherr, Palfinger, Bell Equipment, STILL, ATLAS, and Kenworth. Operate CAT's D8T crawler tractor, 430F2 backhoe or 745C dump truck, Palfinger's PK 27002 SH loading crane, Liebherr's 81K tower crane and LTM 1300 mobile crane, ATLAS' L310 wheel loader and Bell Equipment's B45E dump truck, as well as the T880 from Kenworth.<br/><br/>SEQUEL TO HIGHLY-SUCCESSFUL CONSTRUCTION SIMULATOR 2014 Experience the most extensive construction simulator ever made on your smartphone or tablet. <br/>OVER 60 DIFFERENT CONSTRUCTION JOBS Explore Westside Plains and master more than 60 engaging and challenging construction jobs, including repairing crumbly roads, rebuilding a railroad bridge, minor gardening work, building new residences and industrial halls, as well as transporting goods and machines, constructing new apartment buildings, mending canals, and much more.<br/><br/>YOUR OWN CONSTRUCTION COMPANY Once you have invested your savings into starting your own company, you can begin to explore new regions in Westside Plains and accept ever larger and more lucrative construction jobs in the open world of Construction Simulator 2.<br/><br/>INCLUDES ROAD CONSTRUCTION AND REPAIR For the first time ever in Construction Simulator 2, you can carry out road construction and repair roads in poor condition. Experience the game from a new angle with purpose-built machines from CAT and enjoy an even more varied day at work on the construction site.<br/><br/>REALISTIC STEERING OF CONSTRUCTION VEHICLES, OPTIMIZED FOR MOBILE DEVICES Use either tilt or slider steering and adjust them to your liking. <br/><br/>PLAY IN YOUR LANGUAGE Construction Simulator 2 supports the following languages: English, German, French, Spanish, Italian, Brazilian Portuguese, Turkish, Japanese, Dutch, Russian and Korean.<br/><br/>Like our game? Then rate us!<br/><br/>For the best gaming experience and news, follow us on: http://facebook.com/ConstructionSimulator <br/><br/>VISIT US AT: http://www.bau-simulator.de/en <br/><br/>Got questions? Then take a look at our comprehensive FAQ: http://www.bau-simulator.de/en/faq<br/><br/>We are sorry but this application does currently not support Android 8.0 Oreo but we are already working on it. Thank you for your understanding", "metacritic": null, "released": "2017-03-22", "tba": false, "updated": "2023-06-12T17:46:28", "background_image": "https://media.rawg.io/media/screenshots/44d/44d3a820be7098c8b5945c23d110e70a.jpg", "website": "http://www.construction-simulator.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 253, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android", "iOS"], "developers": ["astragon Entertainment"], "genres": ["Action", "Simulation"], "publishers": ["Astragon Entertainment"], "esrb_rating": null}