{"id": 487068, "slug": "sit-down-please-sawyheart", "name": "SIT DOWN, PLEASE (Sawyheart)", "name_original": "SIT DOWN, PLEASE (Sawyheart)", "description": "<p>The <strong>necessity </strong>and <strong>curiosity </strong>to possess an <strong>unknown power</strong>,  could bring a reign to act so cruel practices. Those who own such power have rebelled against their own <strong>King</strong>, starting a war that is at its end only now. The <strong>rioters</strong>, after suffering a bitter and final defeat, have been imprisoned and, <strong>without distinctions</strong>, submitted to the worst pains. Nevertheless,<strong> nothing has <strong>surfaced yet</strong></strong>.</p>\n<p>A <strong>scientist</strong>, moved by <strong>devotion </strong>for his own reign, agrees to succeed to all of those that, before him, have tried in the ever different and atrocious ways, to gain the so desired information.</p>\n<p>He gives his knowledge and his tools to reach a goal that is far beyond everything has been attempted yet…</p>\n<p>In this new phase, the rebels will not be anything else than guinea pigs to give to eat to these<strong> infernal machines</strong>.</p>\n\n\n<p><strong>    <br/></strong></p>\n\n<p><strong>More the <strong>agony will be prolonged</strong>, <strong>faster </strong>will be reached the goal.</strong></p>\n\n\n\n<p>Try to rebuild the past of this world, understand the reasons of winners and won and choose your side.</p>\n<p>On this chair, old and worn-out, you will bring your cavies to sure death. The most different subjects will be in front of you, but their end will be always the same.</p>\n\n<br/>\n\n<p>Discover their story, their thoughts and listen everything they have to say about themselves and about this world… <strong>before to leave it forever</strong>.</p>\n\n\n<strong>Will the scientist be able to withstand all this?</strong>\n\n<strong>Will it be worth it once the work is done?</strong><p><strong>Please check my kickstarter campaign if you want to know more about the game and if you want to support me.  =)</strong><br/></p><p><strong>https://www.kickstarter.com/projects/sawyheart/sit-down-please</strong></p>", "metacritic": null, "released": "2020-08-30", "tba": false, "updated": "2020-08-31T03:40:21", "background_image": "https://media.rawg.io/media/screenshots/139/13950ea211ca993f09edab65c2f14909.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 35, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["Sawyheart"], "genres": [], "publishers": [], "esrb_rating": null}