{"id": 48708, "slug": "choices-that-matter", "name": "Choices That Matter", "name_original": "Choices That Matter", "description": "CHOICES THAT MATTER is a library of epic choice-based adventures with a difference - new content is written and delivered weekly, making our stories the largest and most complex in the choice-based adventure market. No one player can discover the entire story in a single play through. See how many other players travelled to the same place as you each time you conclude a story arc.<br/><br/>Are you ready?<br/><br/>** OUR STORIES **<br/><br/>ADVENTURE 1: And The Sun Went Out<br/><br/>Approximately 600,000 words and 2,400 choices in total!<br/><br/>What if the sun inexplicably vanished only to return hours later? Investigate with your AI companion, Moti. Uncover conspiracies. Discover ancient religions. Travel the globe.<br/><br/>Find out who is murdering scientists and what this has to do with the random disappearances of the sun. This is your journey, and only your choices can expose the truth.<br/><br/>ADVENTURE 2: And Their Souls Were Eaten<br/><br/>You have a gift. With your gift, the dead are never truly gone.<br/><br/>But what if there is a dark side to your gift? What if there are those who can pervert your talent, and alter the balance of life and death?<br/><br/>Travel across a steampunk 1830s Europe, where metal is magical, giving powers to those who wear it. Learn more about your ancient gift and what it means for you, your family, and humanity. Uncover the nefarious plot to destroy all life... and fight against time to stop your enemy from destroying everything you hold dear.<br/><br/>ADVENTURE 3: And Their Heroes Were Lost<br/><br/>You wake up in a dirty prison cell with no memory of who you are. And, you're not alone. Who are the other prisoners? What are they to you? Are they your allies... or enemies?<br/><br/>Will you escape? Try to find out who you are? Why did the people who captured you steal your memories—instead of just killing you? Travel the world as you uncover the details of a past that holds many secrets, and a future that is in peril.<br/><br/>This story is ongoing and updated weekly!<br/><br/>\"What’s really innovative about Choices...unlike traditional gamebooks that have a definite end, Choices: And the Sun Went Out is a continuing gamebook that will be updated weekly, allowing you to progress through the story over time. As you make choices in your story, it will advance in ways completely differently than other readers when weekly content is added.\" - PocketTactics.com<br/><br/>This app is supported by video ads which can be optionally disabled by purchasing a story pass.<br/><br/>Privacy policy: http://tinmangames.com.au/privacy/", "metacritic": null, "released": "2015-11-25", "tba": false, "updated": "2019-10-22T14:22:40", "background_image": "https://media.rawg.io/media/screenshots/966/9660894445394437cc906f81c8202cc2.jpg", "website": "http://gamebookadventures.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "toplay": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 122, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android", "iOS"], "developers": ["Tin Man Games"], "genres": ["Adventure", "RPG"], "publishers": ["Tin Man Games"], "esrb_rating": "Everyone 10+"}