{"id": 487077, "slug": "izcalli-of-the-wind", "name": "Izcalli Of The Wind", "name_original": "Izcalli Of The Wind", "description": "<p><strong>Izcalli of the Wind</strong> is a game of momentum, elegant motion, and channelling flow. Swiftly navigate the environment by riding a god imbued relic in hoverboard fashion and build energy while completing trials to transfer into seals, repowering the island's main conduit and opening a path to the god's main temple!<br/></p>\n<p>The game was developed by a team of 16 students over 8 months at the Florida Interactive Entertainment Academy (FIEA). The goal was to develop a fun fast-paced game with tight controls and an unique environment.  </p>\n<p><strong>**Controller Highly Recommended**</strong></p>\n<ul><li><strong>Rhythmic Navigation:</strong> gracefully glide around the environment and use abilities to find lines flow and get into the zone!</li></ul>\n\n<ul><li><strong>Build and Disperse Energy:</strong> build energy by maintaining high speeds and drifting, using that energy to activate abilities and repower seals.</li></ul>\n\n<ul><li><strong>Slipstreams of Energy:</strong> as you repower the world, ride the slipstreams of energy to reach new areas and challenges! You can also absorb and release energy into the slipstreams to alter their speed!</li><li><strong>Tempest Staff:</strong> turrets and drones are on high alert to disrupt and thwart your progress. Use the tempest staff to deal with them swiftly!</li></ul>", "metacritic": null, "released": "2020-08-30", "tba": false, "updated": "2020-08-31T03:42:20", "background_image": "https://media.rawg.io/media/screenshots/7ff/7ff3971ffd41ed92b76ffb10fd56c24e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 329, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Axolotl Productions"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}