{"id": 487007, "slug": "pixel-art-mash-up", "name": "Pixel Art Mash-Up", "name_original": "Pixel Art Mash-Up", "description": "<p>Soon to be in early access on Steam.<br/></p>\n<p>Do you like survival?</p>\n<p>Do you like fighting?</p>\n<p>Great! You are in the right place then!</p>\n<p>I am happy to announce that I am releasing a playable version of Pixel Art - Mash-Up.</p>\n<p>The day has finally come where the community can participate in the testing phase.</p>\n<p>The game is currently set up to be played endlessly. There are 2 levels, each with 10 waves of enemies on each level. Each wave has increasingly difficult enemies. When you are done with level 2, it will transition you back to level 1. You can continue playing until you die and the total waves you were able to survive will be added to your final score.</p>\n<p>When you start the game you will start with only the ability to punch and block. When you defeat an enemy you will gain xp. When you level up your HP will be replenished and you will receive 2 skill points that you can spend to unlock new attacks and increase attack damage.</p>\n<p>Every other time you level up your max HP will be increased. This will allow you to play a little more aggressively if you choose.</p>\n<p><strong>It can be played with a keyboard or a controller.</strong>\n</p>\n<p><strong>Things you can unlock:</strong></p>\n<ul><li>Punch Combo - Instead of only punching once, you can time your punch and punch again after ( or button mash ).</li><li>Kick - Allows you to kick and execute a kick from a punch or sword attack if pressed at the correct time.</li><li>Sword - The sword is a slower attack that does more damage, you can execute a punch or kick from the sword attack if timing is right.</li><li>Double Jump - Allows you to double jump.</li><li>Gravity - Decrease gravity, allowing you to jump higher and get on those pesky platforms.</li><li>Critical Chance - Increase your ability to land a critical hit in combat.</li><li>Critical Damage - Increases your critical hit damage.</li></ul>\n<p><strong>Note: </strong>You can upgrade each attacks damage individually if you choose or you can increase crit chance and crit damage which will effect all your attacks. The choice is yours. </p>\n<p><strong>Note:</strong> After you select your new stats press the <strong>JUMP</strong> button to accept the changes and lock them in. (This is currently not explained in the current build but will be added soon.)\r\n</p>\n<p>There are a lot of things I still want to add and change but as a solo dev I will have to prioritize what gets tackled first!</p>\n<p><strong>Some of the feature to come:</strong></p>\n<ul><li>GUI that fits the game style better</li><li>5 more levels that will follow the same structure.</li><li>Boss fight at the end of each level</li><li>Special Attack </li></ul>\n<p><strong>MODES</strong></p>\n<ul><li>Endurance Mode - No extra lives, No food drops</li><li>Trials Mode - Avoiding enemies for a certain time. Use only Punch, Kick, or Sword. Time limit per wave.</li><li>Arcade Mode - Allow player to continue after they lose their lives.</li></ul>\n<p>This is a <strong>EARLY ACCESS TEST BUILD. </strong>I ask that you please give me any feedback that you have about the game. </p>\n<p>Is it hard? It is easy? How are the enemies balanced? What would be a good addition? Are there any glitches? All the feedback I get will help further development of the game.</p>\n<p>This game is exclusively being made with assets found here on itch.io and I feel its a good way to not only support the community but also showcase some awesome assets that I have found. </p>\n<p> I pay for every asset that I use as a way to give back to the itch.io community and will continue to purchase and use more assets. The game currently has assets from 14 different artists. I hope that everyone will enjoy this game and I can continue adding dozens of new enemies and levels. </p>\n<p><strong>If you enjoy this project and want to help support the development of this game consider donating .\r\n</strong></p>\n<p>Thank you for coming to check this out.</p>\n<p><strong>BUILD 1.2.0.9<br/></strong></p><p>Added reflex rounds.</p>\n<p>There will be some balance checks for these done soon. Have already played them for hours.</p>\n<p>Boss enemies buffed. Some changes to boss AI</p>\n<p>More likely to block your attacks. HP increased to better scale with the player.</p>\n<p>Crow Enemy</p>\n<p>No longer as agressive as it was. Might peck at you while on the ground though!</p>\n<p>Fixed credits menu visual bug.</p>\n<p>Fixed stats menu. Now confirms when stats are set. <br/>Stat menu tell you what button to press for confirming stats and added a visual confirmation so you know it worked.</p>\n<p>Audio - Different music now plays during the \"reflex round\"</p>\n<p>Level design - I did spend some time making the levels look a little better. I like the changes and hope you will too.</p><br/>\n<p><strong>BUILD 1.1.9.5c</strong></p>\n<p>Balance pass on the eye/bat enemy.</p>\n<p>Balance pass on slime enemy.</p>\n<p>Balance pass on tree enemy.</p>\n<p>Balance pass on boss enemies.</p>\n<p>Balance pass on stump enemy.</p>\n<p>Graphical fixes on tree enemy.\r\nUI tool tips changes.</p>\n<p>Fixed a bug allowing you to get hp when dead, and then killing you again.</p>\n<p>Enemies are now less likely to spawn on top of you.</p>\n<p>Enemies now know what walls are and turn around.</p>\n<p>Camera view increased to see more of the level. </p>\n<p><strong>Endurance mode is still not active.</strong></p>\n\n<p><strong>BUILD 1.1.8.3</strong></p>\n<p>Crow Enemy - HP Decreased</p>\n<p>2 Bosses Added <br/></p>\n<p>Arcade Mode Added - Increased player HP, each skill unlocked at level 1, player is able to continue.</p>\n<p>Endurance - Mode is added to the main menu but is not active.</p>\n<p>Survival - The mode people have come to know and love/hate.</p>\n<p>Some graphical fixes. More to come.<br/><br/></p>\n<p><strong>BUILD 1.1.6.0<br/></strong></p>\n<p>Complete Remap of Keyboard Controls</p>\n<p>Changed controls in options to only display keyboard controls if a controller is not connected.<br/></p>\n<p>W - A - S - D  are now used for movement</p>\n<p>E - Used to enter in-game menu to use stat points.</p>\n<p>Left Mouse - Punch</p>\n<p>Right Mouse - Kick</p>\n<p>Middle Mouse - Sword</p>\n<p>Shift - Block</p>\n<p>Space - Jump<br/></p>\n\n<p><strong>BUILD 1.1.5.7</strong>\n</p>\n<p>Tree Enemy - Larger Hitbox - Chance to attack lowered.</p>\n<p>Stump Enemy - Larger Hitbox - Increased Accuracy of Attack</p>\n<p>Player - Punch Knockback - Increased slightly to make combos easier while moving.</p>\n<p>&amp; more</p>\n<p><strong>BUILD 1.1.5.4</strong></p>\n<p>Enemy knockback fix for bush enemy</p>\n<p>Player knockback fix for bush enemy - will not get knocked back as far.</p>\n<p>Player hurt time reduced allowing quicker response when hit by enemy.</p>\n<p><strong>BUILD 1.1.5.3</strong></p>\n<p>Decreased enemy spawn range ( will now spawn closer to left and right )</p>\n<p>Increased responsiveness of player attack.\r\n</p>\n<p><strong>BUILD 1.1.5.2</strong></p>\n<p>Bug Fixes - Fixed Keyboard Controls</p>\n<p>E - is hard coded to exit game - R - restarts the game</p>\n<p>Enemy Fixes BUSH ENEMY - BETTER ATTACK RANGE - HP DECREASED</p>\n<p>Player Fix - Made attack hitbox more responsive.</p>", "metacritic": null, "released": null, "tba": false, "updated": "2020-08-31T03:26:54", "background_image": "https://media.rawg.io/media/screenshots/3e4/3e4db090ac4ff44dc3cc2fbc55d73410.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 14, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["VonderBear"], "genres": ["Action", "Fighting"], "publishers": [], "esrb_rating": null}