{"id": 487142, "slug": "silicon-city-itch", "name": "Silicon City (itch)", "name_original": "Silicon City (itch)", "description": "The game is now available for OPEN BETA.<p>Join the community of beta testers on itch.io !<br/></p>\r\nRetro city building!\r\n<p>Silicon City uses old game design and revisit the genre of city simulation. If you've already played to the earliest versions of Sim City©, you will find here tribute to the original game from the 90's. Your city is here based on a classic squared grid, ready for good old urban planning techniques.<br/></p>\r\nWelcome Mayor!\r\n<p>You've been elected as the new mayor of a city. Start with a procedurally-generated land and build your city from empty plains and forests to a concrete jungle with hundreds of thousands of citizens.<br/>Build residential areas to allow new citizens to move in. Provide them electricity and a place to work. Watch out their own needs and financial situation to adapt your urban layout.</p>\n\r\nA citizen's life\r\n<p>Your decisions will impact every of your citizen's life. Lay a smart road grid to help them commute to work faster. Build schools to boost their skills and motivation for better jobs and to raise new limits. Your citizens will wake up early with the sun and spend their day between work, entertainment and social activities. Fulfill their wishes and get enough followers before the next mayor elections.</p>\n\r\nTraffic jams\r\n<p>The worst enemy of every city building players is back. Due to the squared grid, the navigation used by your citizen is more understandable and its optimization is deeply customizable. Most of the jobs have different shifts times, but beware of critical rush hour times or your citizens might lose their job if they get stuck on the road every day.\r\nEach workplace's productivity is affected by the skills of your citizens and their ability to reach work on time. Place your commercial and industrial zones carefully. </p>", "metacritic": null, "released": "2020-08-30", "tba": false, "updated": "2020-08-31T04:00:20", "background_image": "https://media.rawg.io/media/screenshots/4ae/4ae66bb5d0fa462d41fc48e99637f5d4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 359, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Polycorne Games"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}