{"id": 487113, "slug": "space-orgy", "name": "Space Orgy", "name_original": "Space Orgy", "description": "<p><strong>Press SPACE for fullscreen in WEBGL version</strong></p><p>---<br/></p><p>In 1840 a brave company called SpaceSex launched its space program to habituate the cosmos. The first of the brave were called Astronuts. Advancements in technology made scaphanders obsolete and soon enough everyone was enjoying the freedom of space, completely naked. And so humanity sought a new life, among the stars, where anything can happed.</p>\n<p>Can you manage to recreate the big bang? Help the Astronuts find each other by propelling their jet pack and thrusting them in the right direction. Nudge them to take off their clothes and get the party started. But remember - to make history as the biggest space opera, you must manage the excitement as the explosions are quite powerful and - with no gravity around - they sure will get people flying! Use the power of the black hole to prolong the space party and throw items that will surely kill anyone's appetite. Pregnancy tests, banana peels, boring magazines, rocks - anything that works!</p>\n<p>The biggest Space Orgy in the history of mankind is in your hands.</p>\n<p><strong>Controls:</strong></p>\n<ul><li>Left Click on astronuts to take off their clothes</li><li>Hold left mouse button and drag to aim the direction of jet pack</li><li>Release to start the jet pack</li><li>Click on naked astronuts to have the blackhole shoot things at them and reduce their excitement</li></ul>\n<p><strong>UI:</strong></p>\n<ul><li>Green progress bar on the astronuts back indicates the jet pack fuel. They recharge over time and can be used repeatedly once the jet pack is fully charged.</li><li>Astronuts change color to red as their excitement is increasing</li><li>The scoring system calculates the maximum number of connected astronuts (session max and current max).</li></ul>\n<p>This game was submitted as part of the Bonfire Gamejam</p>", "metacritic": null, "released": "2020-08-30", "tba": false, "updated": "2020-08-31T03:51:35", "background_image": "https://media.rawg.io/media/screenshots/421/421b699d0408c9163b55b5a5172546a5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 18, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Android", "Web"], "developers": ["Jawsarn", "Vanilj", "SimplyMike", "briandiamondmusic", "JayAge44"], "genres": ["Action"], "publishers": [], "esrb_rating": null}