{"id": 487228, "slug": "dungeon-of-reminiscence", "name": "Dungeon of Reminiscence", "name_original": "Dungeon of Reminiscence", "description": "<p>My very first project! It has been a long time coming, but game development was something I've always wanted to do, and I finally decided to sit down and actually make it happen. What you have here is the very first stepping stone of that endeavor. It's raw, only slightly polished, and probably isn't all that exciting given the advances of today's gaming, but I'm proud of what I've put together. There is a lot of fundamental work that went into this, such as the large amounts of text and how it's being displayed, loops, switches, conditions, if statements, variables, and a few others. We all start from somewhere, and this was my starting point. I hope you can appreciate it for what it is. Friendly warning, the music is super loud, so turn down your audio before playing!</p>\n<p>Of note, there is one bug that I couldn't seem to work out, and that was the weird looping music each time a new battle started. I know it's frustrating to hear, but I couldn't find a simple solution to fix it, so it had to stay for now. If you are a C# coder and know of a way to remedy given my limited knowledge, please reach out!<br/><br/>Dungeon of Reminiscence is a short story about you, the player, being imprisoned for something you aren't even sure you are guilty of. Your goal is simple: make your way out of the dungeon and find out what really happened. Along the way, you'll battle with monsters and power yourself up until you face your final foe.</p>", "metacritic": null, "released": "2020-08-30", "tba": false, "updated": "2020-08-31T04:17:39", "background_image": "https://media.rawg.io/media/screenshots/2d4/2d44a014a54d066823358e96f61a4a30.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 28, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["PT6"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}