{"id": 487273, "slug": "milcham-from-the-ashes-of-hearts", "name": "Milcham: From the Ashes of Hearts", "name_original": "Milcham: From the Ashes of Hearts", "description": "<strong>Story:</strong>\n<p>Sixteen year old Yuuna, an orphan that\r\nwas born and raised in a small beach town near the Kurokuma kingdom’s capital, one of the\r\nbiggest and richest kingdoms in the continent of Eilusea.</p>\n<p>Despite being one of the biggest modern\r\ncountry, the kingdom still upholds a caste system that has been passed down\r\nfrom generation to generation ever since it had been formed over a century ago.\r\n</p>\n<p>Divided into four, the kingdom's social class\r\nstarts with the royalties in the highest position, followed by the nobles on\r\nsecond, and commoners with clear family background and no criminal records on\r\nthe third position.</p>\n<p> The fourth rank or the lowest rank is for those who have no\r\nsocial or family backgrounds, criminals, single -never been married- mothers,\r\nillegitimate children and abandoned orphans, such as Yuuna.</p>\n<p>Her life was never been easy, but she always\r\nliving to her fullest. Until one day a man came and offer her a chance to attend\r\nthe most prestigious magic and alchemy school in the kingdom. Little that she\r\nknew that she was sent into the center of upcoming hurricane that will change\r\nthe whole structure of the kingdom itself. \r\n</p>\n<p>Follow her journey, help her choose her life\r\npath as she enters a place she never thought she could ever be. Can she adapt\r\nwith the new environment? Will she make new friends? Will she crumble into the\r\ndark plot? Will she find unexpected romance along the way?</p>\n<p><strong>Characters:</strong><br/></p>\n\r\nYuuna \r\n<p>Our Protagonist, grew up in a small orphanage in a small port city at the outskirt of the capital. Being the lowest class citizen that often got mistreated, doesn’t stop her from being straight forward in stating her opinions and feelings. Her thirst for justice not only for her kind often made her being impulsive and often drags her into a fight. She doesn’t really care who she was up against, noble or not, she will defend anyone who got bullied and help those who in need. She has a rare magic talent of the ability to manipulate all four elements, sadly without a proper education that talent will go to waste.</p>\n\n<p><em>(Place holder picture, will be updated on the second demo)</em></p>\r\nHiroaki Jun \r\n<p><strong>-The kingdom crown prince-</strong> </p>\n<p>Jun was born into the lap of luxury, as the crown prince and heir apparent to an entire kingdom. Blessed with dual magical affinities (fire and air), he has been fawned over, and waited on hand and foot by people all his life.</p>\n<p>He is a rather prideful individual - almost coming off as conceited or standoffish at times. He is also not above flaunting or using his status or wealth against anyone he sees as lower than him (which is pretty much everyone else). </p>\n<p>However, deep down, he is just a lonely child wanting to be free. He does not like the fact that his whole life has been decided for him, since he was born. His acts of almost abusing his powers and privileges is his own form of rebellion, against the fate that has been laid out for him. </p>\n<p>Despite his spoiled prince exterior, he is actually quite the hard worker, and fiercely loyal to his friends and those he trusts. He’s willing to go to any lengths to keep them safe. He can be somewhat gullible/naive at times, due to his sheltered upbringing and lack of understanding of the world beyond the walls of the palace and the academy. </p>\n<p>He gains an interest in Yuuna from her stubborn refusal to bend under the influence of his position as crown prince.\r\n</p>\n\n<p><em>(Place holder picture, will be updated on the second demo)</em></p>\r\nHiroaki Raiji\r\n<p><strong>-The  crown Prince’s older brother-</strong></p>\n<p> The King first born from one of the concubines. Her mother expected that he will be the crown prince especially when the queen hasn’t been able to conceive for the longest time. But his mother’ expectation crumbled when a month after Raiji was born, the queen finally conceived.  </p>\n<p>Angry of her bad luck, she blames no one but Raiji. Living with an abusive and power hunger mother, all Raiji wanted is to be loved and he will do everything that he can to please her.  He studied hard and do everything she asked him to do.   </p>\n<p>Despite the harsh treatment he often gets from his mother, Raiji is a sunny boy, he always hides his true feelings with his silly smiles and jokes. He never hated his younger brother instead he loved him dearly and spoiled him.\r\n  </p>\n<p>Until one day he met with Yuuna, at first, he didn’t like on how she defies Jun. But soon he started to get attracted on how open she is in expressing her feelings. Something that he has hard time to do himself.  </p>\n\n<p><em>(Place holder picture, will be updated on the second demo)</em></p>\r\nUeda Zeeku \r\n<p><strong>-The Null-</strong></p>\n<p>Born without any Magic ability put him in a harsh childhood. Even though his parents loved him nonetheless but he had through a very hard life at school. Being bullied and nicknamed as the null. He had lost his desire to live and decided to kill himself when a young teacher who happened got invited to teach in his hometown saw what he wanted to do and stopped him. The teacher taught him to see beyond his lack of ability in magic and made him get back on his feet. Years after that incident, Zeeku who has high talent in martial arts  and body harder than any common man, trained himself to be the best martial artist in the kingdom at a very young age and granted his passage to work in the capital. </p>\n<p>He could never forget his teacher and think that being a teacher is the best job a person could get. He wanted to inspire people just like his teacher did to him. With a burning passion he applied to be the teacher of the best Magic and Alchemy academy in the kingdom and got his position as the Martial Art Department Head. \r\n</p>\n\n<p><em>(Place holder picture, will be updated on the second demo)</em></p>\r\nAmai Makoto\r\n<p> <strong>– The School\r\nRepresentative-</strong></p>\n<p>Born as the only child of a well-known college professor of Kurokuma\r\nMagic and Alchemy University. His father demanded him to be perfect in\r\neverything. Makoto’s mother passed away not long after he was born, he never\r\nreally got the chance to feel the warmth of mother’s love. </p>\n<p>Deep down he is\r\ntired to always try to be perfect in everything but he always worried that his\r\ndad won’t love him anymore if he isn’t. His demeanor is quiet to almost stoic,\r\npeople who didn’t know him always think him as a very cold person. Even though\r\nhe is young he is very responsible and abides the rule. it is because of his\r\nupbringing. But deep down he is a very shy boy and not very good around people.\r\nHe can be himself when he is around animals and familiars. </p>\n\n<p><em>(Place holder picture, will be updated on the second demo)</em></p>\r\nTakagi Shun \r\n<p><strong>Asagao Kingdom’s Duke’s Son</strong></p>\n<p>Suave, persuasive, playful, and diplomatic. He is someone who is really good with his words. Since he is also good looking a lot of girls fall head over heels and do everything they can to gain his attention.  Born as royalty with  good looking, has an amazing talent in music and smart, he lives his life very smoothly but at the same time it bored him out. Meeting someone like Yuuna that for some reason not showing any interest of his good look, attitude or even title spark his interest on her.   </p>\n<p>(Place holder picture, will be updated on the second demo)<br/></p>\r\nSuzumiya Haaku \r\n<p><strong>– The Kingdom’s\r\nYoungest Magic and Alchemy  Chief Magistrate- </strong></p>\n<p>He was born as the youngest son of a poor Baron family.\r\nEven tough they are poor, they were happy and loving family. Sadly his\r\nparents died when he was still 9 years old. His older sister Erina who was 16\r\nyears old at that time decided to quit her school and work to raise him and\r\ngave him the best education he could have. He was also having a rare talent\r\nwhich is his ability to wield two magic elements.  Erina did\r\neverything she can to put him at the best school in the kingdom and not long his talent was recognize by the king and at the age of twenty one years old he was appointed as the youngest Magic and Alchemy Chief Magistrate of the kingdom. </p>\n<p>He loves his\r\nsister so much and was hoping he could repay her one day. Alas, she passed away\r\nbefore he could actually return her kindness. Mysterious and unpredictable are his demeanor  but he actually is liable and kind. He often  has a hard time in showing affection especially\r\nthrough words. He believes actions speak louder than words.</p>\n<p><em>(Place holder picture, will be updated on the second demo)</em></p>\r\nTakagi Aine\r\n<p><strong>– The Crown Prince’s Fiance- </strong></p>\n<p>Aine is\r\nthe princess of Asagao Kingdom, a neighbor Kingdom of Kurokuma. She is very goal\r\noriented, calculative, cold and hated to lose. She can be pretty ambitious and\r\ndetermined in chasing her goals and dream. She is someone who is willing to do\r\nanything and everything to get what she wants Since the day she was born, she\r\nwas already prepared to be the future wife of Jun Hiroaki and be the queen\r\nof Kurokuma kingdom. Her younger age spent in so many classes and training to\r\nbe the perfect lady and queen. She is willing to do everything her mother ask\r\nand never questioned her mom request. Her happiness comes in fulfilling her\r\nmother’s wish and be the best daughter. But deep down she is a lonely\r\nchild, she never had chance to play with other kids at her age and her only\r\nfriend is her cousin Shun. </p>\n<p><strong><em>Notes :</em></strong></p>\n<p><strong><em>- Sprite art: Still at work, but will update as soon as I manage to work on them.\r\n  </em></strong></p>\n<p><strong><em>- The demo/teaser is more of the prologue of the game, there will be future update for the teaser before releasing the first episode of the game.\r\n  </em></strong></p>\n<p><strong><em>- The first demo still consisted a place holder sprite arts, it will be updated on the second demo along with better GUI and script (grammatically)</em></strong>\n</p>\n\n<p><strong>Current and Planned Features:</strong> </p>\n<p> • Over 100,000 words of content and 50 choices and counting at end of current script </p>\n<p> • Many genres and story lines to explore. </p>\n<p> • Rated: PG-13 </p>\n<p> • Numerous Endings (Eventually there are at least 23 endings currently planned)</p>\n<p> • 6 Romanceable Male NPCs (Four Open Romances, Two after all other route completed)<br/></p>\n<p>• 2 BFF (Best Friend Forever) Female (one common friendship route, one secret friendship route) </p>\n<p> • Characters’ Sprites </p>\n<p> • Rivalries between Romanced Male NPCs. </p>\n<p><strong>Needs for Game Development: </strong>(Currently Recognized Needs) </p>\n<p> • Sprite artist </p>\n<p> • Play testers as the game’s coding continues.</p>\n<p> • Proof reader (for any grammar related errors in the script). </p>\n\n<p><strong>Personal Description of Ara game Studio:</strong></p>\n<p>\r\n  I’m Yui, the founder of Ara game studio. I love writing stories and worlds for people to learn about and explore and thought an interesting way in which to do so was through the virtual novel medium. This is Ara game studio first project, with many storyboards and notes for future games connected to this world. </p>\n<p><strong>Progress of Game:</strong> </p>\n<p>-  Written: Prologue part 1, Character Scenes and option for episode 1 (80%), episode 2 (10%) </p>\n<p>- Programmed: Prologue 1\r\n GUI – Still needs upgrade </p>\n<p>- Character Art – Artwork finished 1 character (MC), 1 important NPC, (Still need 9 MC and a couple of NPC more to work on) </p>\n<p>- Background Art – 70% finished for the first episode (there will be more)</p>\n<p>- Approximate percentage of completion: 20% of 7 planned episode   </p>\n<p><strong>Questions for Demo/Teaser Player:</strong></p>\n<p>\r\n  - Does the game presented here interest you? (Why or why not?) </p>\n<p>- What was your first impression of the game? </p>\n<p>- What was your first impression of the characters? </p>\n<p>- Do you have a favorite character, or is there one you are already interested in? (Based on the description so far)  </p>\n<p>- Any thoughts on the art style and feel of the game? </p>\n<p>- Are there any suggestions as to the description of the characters or narrative that you feel could add to the game? </p>\n<p>- Are there any aspects that really interest you?</p>\n<p>- Are there any aspects that you feel detract from interest? </p>\n<p>- What was your impression of the demo overall?\r\n Did this page present the demo well?\r\n Did you find any glitches or bugs that need to be addressed? </p>\n<p>- Was the writing acceptable? Were there any strange moments in flow or awkward dialogue?</p>\n<p>- Were the transitions of expressions and rooms acceptable? Any strange moments?  </p>\n<p>-What was your favorite part of the demo? </p>\n<p>- Would you desire or consider helping to fund a kick-starter in relation to this game, if in the future we put it on a kick-starter? </p>\n<p>- Any other comments, questions, or feedback?\r\n</p>\n<br/>", "metacritic": null, "released": "2020-08-30", "tba": false, "updated": "2020-08-31T04:26:20", "background_image": "https://media.rawg.io/media/screenshots/cd7/cd75d6cc51d853e0b8344b40c4acac56.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 23, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Yui Enajori"], "genres": [], "publishers": [], "esrb_rating": null}