{"id": 487480, "slug": "deadman-deviance-s1", "name": "Deadman Deviance S1", "name_original": "Deadman Deviance S1", "description": "<p><strong>Deadman Deviance:</strong></p>\n<p>\n<em>This is a story about the boy who lost his life from unexpected event and became a deadman…</em>\n</p>\n<p>\r\nDeadman Deviance is a compelling adventure game developed by an amateur developer named <em>“Kev-meister”</em> with RPG Maker MV. This is the very first game he made and hopefully not the last. \r\n</p>\n<p>\r\nCaleb, a teenage boy who turned into an undead, goes on an adventure to regain his memory and unveil the truth of what really happen to him.\r\n</p>\n<p>\r\nAs Caleb found himself washed up on a shore, he met someone that could possibly have some connection to what happen to him. His name is Joseph, a guy that has a mysterious vibe and persona.\r\n</p>\n<p>\r\nLittle by little, he discovers the true identity of Joseph and the truth on what is going on. He learned that there is this mafia group called Azienda Apocrifa that is hunting down Joseph for some reason.\r\n</p>\n<p>\r\nThis mafia group is infamous for performing illegal human experimentation which result of random killing on their area. Ran by corrupted people who only wants power and superiority, they are insane for doing such things for some unexplained reasons.\r\n</p>\n<p>\r\nAfter some turn of events, Caleb decided to tag along with Joseph, as he hopes that working with him will lead him the way to unveil the truth and to have reason to move forward.\r\n</p>\n<p><strong>Season 1:</strong></p>\n<p>\r\nSeason 1 of <em>Deadman Deviance</em> is just an introduction of the main protagonist(s), antagonist(s) and some future characters of the game, and to show what might possibly be going.\r\n</p>\n<p><strong>Extra:</strong></p>\n<p>\r\nI made this game for about 3 months, thanks to YouTube tutorials of this people:<em> SRdude, RPGtime, Driftwood Gaming, Echo607.</em> Please check their YouTube channel for awesome RPG Maker contents.\r\n</p>\n<p>\r\nSpecial thanks to <em>CW of Stay Awake Games</em> for playtesting this game before the official release.\r\n</p>\n<p>\r\nI appreciate any comments, feedbacks, ratings, and suggestions from all players. Thank you for playing and I hope you like it.\r\n</p>", "metacritic": null, "released": "2020-08-29", "tba": false, "updated": "2020-08-31T05:14:22", "background_image": "https://media.rawg.io/media/screenshots/c06/c0656c569fed39de8da035870123cb63.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 233, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kev-meister"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}