{"id": 487467, "slug": "dodge-revolution", "name": "Dodge Revolution", "name_original": "Dodge Revolution", "description": "<p>The game is about dodging the cubes with your friends you can choose between easy,medium and hard mode to increase the amount of cubes you have to dodge and the speed in which they are being spawned.</p>\n<p>Players have to stand in the middle of the green cube to increase their points however this proves as a challenge as most of the cubes are being spawned there and they also have to wait a duration of 5 seconds before getting another point.There will be two spheres one is blue and the other is red.Player 1 would control the blue sphere and player 2 would control the red sphere.The controls are simple,Player 1 would use W A S D while Player 2 uses Up Down Left Right arrow keys.</p>\n<p>Background Info : Game was made 6 years ago, I wanted to get this out somewhere at least : D</p>\n<p>Update Log V0.2 :<br/>-Added highscore systems,now you can compare your scores with your friends!<br/>-Added out of bound system,once player 2 exits out of camera range it will take damage.<br/>-Added Random damage system to players once the cube hit the player<br/>-Changed the health to 100 instead of 40<br/>-Now the gameplay is more balanced for each difficulty easy,medium and hard</p>\n<p>Update V0.3 Log</p>\n<p>-Added 5 levels in story mode to play<br/>-Added new way to gain points in story mode<br/>-Changed The Main Menu</p>\n<p>Beta Update Log</p>\n<p>-Added a new type of trap called spilt cube it will fire off cubes that are faster than the normal cube<br/>-Added 5 more levels to the story mode</p>", "metacritic": null, "released": "2020-08-29", "tba": false, "updated": "2020-08-31T05:11:20", "background_image": "https://media.rawg.io/media/screenshots/9ce/9cedb076272f906e64a3a8005802b602.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 10, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["GamingIronStudio"], "genres": [], "publishers": [], "esrb_rating": null}