{"id": 487551, "slug": "el-gran-asalto-del-siglo", "name": "EL GRAN ASALTO DEL SIGLO", "name_original": "EL GRAN ASALTO DEL SIGLO", "description": "<p>Deslave se complace en presentar <em>EL GRAN ASALTO DEL SIGLO ¿Quién se robó la imaginación?</em>, exhibición individual de Israel Urmeer en Basura Espacial / Space Junk. <br/></p>\n<p>Cuando ya no haya vida sobre la Tierra, ¿qué remanentes de la cultura popular quedarán flotando en el espacio? Si escapamos de la inminente extinción, ¿qué lugar tenemos lxs mexicanxs en la conquista de otrxs planetas y galaxias distantes? Y sobre todo, ¿cómo podemos evitar los escenarios anteriores y concebir otro destino posible desde la imaginación? </p>\n<p>En <em>EL GRAN ASALTO DEL SIGLO</em>, Israel Urmeer nos presenta frente a una serie de pinturas digitales que condensan referencias y elementos gráficos provenientes de la caricatura occidental, el anime, la década de los noventas y la estampa japonesa. En estas, personajes endriagos se encuentran en medio de una guerra contra parasíticas sombras, superhéroes amorfos y criaturas quimeras ensambladas desde la cultura popular.  </p>\n<p>Volcanes, desiertos y campos de batalla se envuelven bajo cielos extraños que nos presentan entes atrapados en el espacio exterior. Como los códices de una nueva mitología, la obra de Urmeer convoca sensibilidades endriagas construidas desde los cómics, las caricaturas y los videojuegos; nos encontramos frente a una realidad moldeada por una imaginación que, sin embargo, no nos pertenece. </p>\n<p><em>¿Quién se robó la imaginación?</em> nos pregunta la exhibición, pidiéndonos dirigir nuestra mirada hacia las entidades responsables de fabricar nuevos regímenes narrativos mediante secuelas, remakes y universos compartidos. ¿será Disney el responsable de nuestra incapacidad de salvación, o es acaso Marvel quien ha puesto en marcha la muerte térmica del universo? </p>\n<p>Basura Espacial / Space Junk es un proyecto curatorial y editorial que se materializa como un videojuego ambientado en una isla flotante a la deriva fuera del sistema solar y una publicación homónima en la que se han reunido ocho escritores de diversos campos para trabajar en torno a la ciencia ficción especulativa.</p>\n<p>Basura Espacial / Space Junk cuenta con el apoyo, en parte, del Patronato de Arte Contemporáneo.</p>\n<p>  English<br/></p><p>Deslave is pleased to present <em>THE GREAT ASSAULT OF THE CENTURY, Who Stole Imagination?</em>, a solo show by Israel Urmeer at Basura Espacial / Space Junk.</p>\n<p>When there is no more life on Earth, what remnants of pop culture will be left floating in space? If we escape a seemingly imminent extinction, what place do we, as Mexicans, have in conquering other planets and distant galaxies? And above all, how can we avoid the previous scenarios and conceive another possible destinations using our imagination?</p>\n<p>In THE GREAT ASSAULT OF THE CENTURY, Israel Urmeer presents us a series of digital paintings that condense references and graphic elements from western cartoons, anime, the nineties and Japanese prints. In these, mutant characters find themselves in the middle of a war against parasitic shadows, amorphous superheroes and chimeralike creatures assembled from popular culture.</p>\n<p>Volcanoes, deserts and battlefields are wrapped under strange skies that present us entities trapped in outer space. Like the codices of a new mythology, Urmeer's work summons mutants sensibilities built from comics, cartoons and video games; we are faced with a reality shaped by an imagination that, however, does not belong to us.</p>\n<p>‘<em>Who Stole Imagination?’,</em> the exhibition asks us, forcing us to direct our gaze towards the entities responsible for fabricating new narrative regimes through sequels, remakes and shared universes. Is Disney responsible for our inability to save ourselves, or is it Marvel who has set in motion the heat death of the universe?</p>\n<p>Basura Espacial / Space Junk is a curatorial and editorial project that materializes as a videogame set on a floating island adrift outside the solar system and a homonymous publication in which eight writers from various fields have been brought together to work around speculative science fiction. </p>\n<p>Basura Espacial / Space Junk is supported, in part, by the Patronato de Arte Contemporáneo. </p>\n<p>www.deslave.art<br/></p>", "metacritic": null, "released": "2020-08-29", "tba": false, "updated": "2020-08-31T05:29:07", "background_image": "https://media.rawg.io/media/screenshots/21b/21b89f48a4c23b5c36467a0ff0b88545.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 290, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS"], "developers": ["Deslave"], "genres": [], "publishers": [], "esrb_rating": null}