{"id": 487692, "slug": "planet-balls", "name": "Planet Balls", "name_original": "Planet Balls", "description": "<p>A puzzle/arcade game for the immortal <strong>C64</strong>! <em>Planet Balls</em> was inhabited by peaceful balls that lived under the guidance of their King. But one bad day the evil <em>Dark Cube</em> made them all prisoners! Save King Ball and his subjects and restore peace on the planet!</p>\n<p>Notes:<br/></p>\n<p>The game saves your progress to disk, so the next time you play it, you won't have to restart from the first level!</p>\n<p>Press F7 on the main screen for some instructions.<br/>Press RUN / STOP to restart the current level.<br/>Press F3 to return to the first level.<br/>Press F5 to go to the next level (if you've already reached it).</p>\n<p>You can't put blocks in the air, but you have to stack them on top of existing ones (on blocks that allow it).</p>\n<p>You can stack an unlimited number of blocks from bottom to top and remove them in reverse order.</p>\n<p>Some tips:</p>\n<ul><li>Prepare the way in advance!</li><li>The balls can jump a block, but not 2 or more and only if they have enough space to do so!</li><li>You can't place a block over the balls, so you may need to group them together... but beware, once freed, they will separate again quickly!</li><li>Only one ball needs to reach the key, so separate one and lead it to the key.</li><li>You have to save at least half of the balls, for each color.</li><li>Some blocks are invisible and will appear once a ball passes over them!</li></ul>", "metacritic": null, "released": "2020-08-28", "tba": false, "updated": "2020-08-31T06:02:59", "background_image": "https://media.rawg.io/media/screenshots/578/5782065e0d82ecf9b205686f5050f50f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 107, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["AGPX"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}