{"id": 48766, "slug": "rpg-blood-of-calamity", "name": "RPG Blood of Calamity", "name_original": "RPG Blood of Calamity", "description": "SPECIAL PRICE<br/>50% OFF(USD 7.99 -&gt; USD 3.99)!!!<br/><br/>The special moves passed down through the bloodlines of the great clans...<br/>Will they lead the nation to salvation or ruin...?<br/>Introducing a hardcore Japanese-style 2D RPG which got the first place in the Google Play Top New Paid Apps in Japan!<br/><br/>Story<br/>Hoshu Washin is a nation ruled by four clans. Kenshiro, the ruler-in-waiting of the Totsuki clan, <br/>prefers to spend his time chasing skirts and abhors the training he's forced to endure on a daily basis. <br/>One day, the Totsuki clan is attacked by mysterious beings in Oni Masks. Kenshiro vows revenge and sets off <br/>on a journey to bring them to justice with his faithful retainer and friend, Tatsuto.<br/><br/>Clan Specials<br/>Performing actions like attacks and deployment changes in battle will allow you to accumulate ESP that can later be used to unleash powerful special moves known as Clan Specials. If used effectively, the multiple Clan Specials available to each character can exhibit a number of different effects and are sometimes enough to push even the most powerful Yokai to the brink.<br/><br/>Stat Boosts<br/>You can choose which stats you'll boost with the TP you earn from battles and which of your character's abilities <br/>you'll choose to augment. The degree at which you boost a stat impacts the skills (Kiho) you'll ultimately learn, so it's wise to take a balanced approach to their distribution.<br/><br/>Mandara and Deployment<br/>Though the order of turns is ultimately decided by each character's speed, a character can be turned counterclockwise after performing an action in battle. You can also place Mandara, special panels that will allow you to boost your stats and/or abilities. Using Mandara and deployment changes effectively can often be the key to emerging victorious in battle.<br/><br/>Quests<br/>There are a number people in need of your assistance in the Hoshu Washin’s many towns and villages. Talk to as many people as possible and accept the quests they offer you. Doing so will earn you wonderful rewards and possibly much, much more...<br/><br/>Basic System Information<br/>- Character name changes: unavailable<br/>- Equipment slots: weapon, armor, ornament x2<br/>- Save slots: 8<br/>- In-game purchases: available<br/>*While in-app-purchase content requires additional fees, it is not necessary for finishing the game.<br/>*The actual price might differ depending on the region.<br/><br/><br/>[Supported OS]<br/>- 2.3 and up<br/>[Game Controller]<br/>- Optimized<br/>[SD Card Storage]<br/>- Enabled<br/>[Languages]<br/>- English, Japanese<br/>[Non-Supported Devices]<br/>This app has generally been tested to work on any mobile device released in Japan. We cannot guarantee support on other devices.<br/><br/>[IMPORTANT NOTICE]<br/>Your use of the application requires your agreement to the following EULA and 'Privacy Policy and Notice'. If you do not agree, please do not download our application.<br/><br/>End User License Agreement: http://kemco.jp/eula/index.html<br/>Privacy Policy and Notice: http://www.kemco.jp/app_pp/privacy.html<br/><br/>Get the latest information!<br/>[Newsletter]<br/>http://kemcogame.com/c8QM<br/>[Facebook page]<br/>http://www.facebook.com/kemco.global<br/><br/>(C)2014 KEMCO/MAGITEC", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-02T06:46:57", "background_image": "https://media.rawg.io/media/screenshots/bba/bbac60a523c9aae6c73bc690628dd6f0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 430, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["KEMCO"], "genres": ["RPG"], "publishers": [], "esrb_rating": "Teen"}