{"id": 48771, "slug": "block-amok", "name": "Block Amok", "name_original": "Block Amok", "description": "Try the new best thing! Block Amok is an awesome action puzzle game about shooting structures and cardboard cows until they collapse. Drive a fun vehicle and utilize unique sheep powers to your advantage, and watch the buildings crumble before you! Your sheep sidekick will cheer you on and give you hints!<br/><br/>DOWNLOAD IT NOW for FREE!<br/><br/>The levels in this game are automatically generated, giving you an ENDLESS amount of possibilities for entertainment! Compete against your friends in Adventure Mode, be challenged by the Daily Puzzle, and send bacon to your friends and receive Piggy Banks! There's so much fun to be had in Block Amok, so get it now - it’s free!<br/><br/>Thousands of people can't be wrong, this game is nothing short of amazing!<br/><br/>★★★ BLOCK AMOK INCLUDES ★★★<br/><br/>★ Endless Destruction with an unlimited amount of randomly generated levels and puzzles! <br/><br/>★ Powerful new weapons on each vehicle!<br/><br/>★ Complete a handcrafted puzzle every day to win incredible rewards! <br/><br/>★ Different sheep characters and vehicles to suit your smashing style! <br/><br/>★ Leader boards! Compete with your friends and send them delicious bacon! <br/><br/>★ Smash rare Piggy Banks for grand rewards! <br/><br/>★ ...and of course cardboard cows you can shoot right in the face!<br/><br/>So what are you waiting for? Give it a try!", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:09:46", "background_image": "https://media.rawg.io/media/screenshots/4e8/4e80b487f6a7416348bbc98ee8ce8f62.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 193, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["ALL CAPS"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}