{"id": 48778, "slug": "blacksmith", "name": "Blacksmith", "name_original": "Blacksmith", "description": "<strong>Forge Your Story!</strong><br/><br/>Blacksmith is the definitive Blacksmithing experience. Make and sell Weapons, Armour and Tools. Send Heroes on Quests and unlock their unique potential. Grow the town of Ironwell and be a part of the community. Master the elements and bend them to your will! Find your true calling as the Blacksmith!<br/><br/><strong>Everything that appears in the trailer and screenshots is fully implemented in the current version of the game.</strong><br/><br/><br/><strong>Make and Sell Weapons, Armour and Tools:</strong><br/>A unique crafting system allows for countless possible unique items. Smelt up to 24 different Alloys in the Smelter, hammer them into 27 shapes on the Anvil, customize them even further with Helms, Arms, Blades, Styles, Handles, Enchants, and Dyes, and sell them to the Heroes and Townsfolk.<br/><br/> <br/><br/><br/><strong>Dungeons and Quests:</strong><br/>After equipping Heroes, send them to Dungeons to gain resources and advance the story. Equipping the Townsfolk well means they will heal faster and have access to more Spells and Abilities. It's not just about earning Coin, the better you equip clients, the better it is for everyone in Ironwell.<br/><br/> <br/><br/><br/><strong>Grow the town of Ironwell:</strong><br/>As you and your fellow Townsfolk's Coin grows, you can help to build new buildings and upgrades. Go from a small run down village to a large town complete with roads, shops, church, fleurist and of course a Wizard Tower. And more to come with updates!<br/><br/> <br/><br/><br/><strong>Be a part of the community:</strong><br/>Each Townsfolk and Hero in Ironwell is unique, with their own story and gameplay advantages. As you equip them, gain rapport and fulfill various objectives, you will advance their story and gain new tools to help improve Ironwell and yourself as the Blacksmith.<br/><br/> <br/><br/><br/><strong>Master the Elements and bend them to your will:</strong><br/>Imbue your steel with the Tail of a Phoenix or the Bones of your Ancestors. Enchant Weapons with Fire, Ice or Lightning to Burn Cloth or Zap Plate. Learn new Spells, Abilities and Recipes to become the best Blacksmith the world has ever known.<br/><br/> <br/><br/><br/><strong>Find your true calling as the Blacksmith:</strong><br/>There are many ways to play Blacksmith. Will you sit back, relax, and let the Clients come to you? Or will you ravenously devour the secrets of Ironwell, not wasting a day? Forge your own story!<br/><br/> <br/><br/><br/><strong>Planned Updates:</strong><br/>Updates are scheduled every 2 weeks from release day. Here is a rough breakdown of updates which is very much subject to change and circumstance:<br/><br/>April.<br/>The Quench Update: General fixes and improvements, including the Quench feature.<br/><br/>May.<br/>The Mines Update: More Dwarfs and Mines themed Dungeons, Enemies, Heroes and Townsfolk, as well as an entire Mining minigame/sidequest feature that should provide a lot of content.<br/>The Farms Update: More Farming themed content, as well as an entire farming minigame/sidequest feature.<br/><br/>June.<br/>Giving a break to Maly, the artist, this month, focusing less on new content and more on gameplay.<br/>The Silk Road Update, which will introduce a shop keeping feature so you can live out that weapon shop fantasy.<br/>The Apprentice Update, which will introduce an Apprentice Blacksmith to free up the player's time, among other things. July should see Blacksmith feature complete.<br/><br/>July.<br/>Finishing the Story, fixing the bugs, finishing the artwork, balancing and filling in any gaps in the game. By the end of July we should have announced the date of our transition to full release.<br/><br/><br/>More to be announced as time goes by.", "metacritic": null, "released": "2018-04-11", "tba": false, "updated": "2019-08-28T22:04:13", "background_image": "https://media.rawg.io/media/screenshots/bcf/bcf3bc4b0b65ac6fcfb56cb9c29f8249.jpg", "website": "http://blacksmiththegame.com/", "rating": 0.0, "rating_top": 1, "added_by_status": {"yet": 7, "owned": 103, "beaten": 1, "dropped": 1}, "playtime": 1, "achievements_count": 30, "ratings_count": 5, "suggestions_count": 247, "game_series_count": 0, "reviews_count": 5, "platforms": ["macOS", "Linux", "Android", "PC"], "developers": ["Otis Miller", "aftercharlie"], "genres": ["RPG", "Simulation", "Casual", "Indie"], "publishers": ["Otis Miller"], "esrb_rating": null}