{"id": 487943, "slug": "dungeon-shop-tycoon", "name": "Dungeon Shop Tycoon", "name_original": "Dungeon Shop Tycoon", "description": "While tales of your deeds aren’t sung about in great halls, every adventure starts with a merchant, and when the largest chain of dungeon outfitter shops in the rich fantasy world of Arpeegia is in trouble, YOU’RE the one they call. Your idle game adventure begins when you operate shops with which to craft items for your quest-driven clientele, recruit mighty managerial champions to run them, and watch your profit margins grow faster than a dragon’s horde as you expand operations to exciting new corners in a land of enchanted enterprise.<br/><br/>Your epic idle adventure as a Dungeon Shop Tycoon starts today!<br/><br/>Features<br/>• Heed the call to outfit the adventurers of Arpeegia by building shops and crafting fantastical items as you expand your reach to the far corners of this rich, fantasy realm.<br/>• Ancient chests provide exciting rewards as you collect powerful new items and transform existing inventory. <br/>• Call upon Managers of myth and legend to provide boosts and power-ups to your shops.<br/>• Open new locations throughout the realm in hotspots of adventure: Shireville, Elvendale, Dwarfburg, Bazaarnia, and Brimstone!<br/>• Choose between dozens of weapons, armors, and dungeon crawling accessories to craft, upgrade, and sell.<br/>• Renovate your shops to boost income and attract customers with loose purse strings.<br/>• Shops earn revenue, even while you’re away!<br/>• Receive amazing awards every day, just for playing!", "metacritic": null, "released": "2020-08-23", "tba": false, "updated": "2020-09-04T02:31:41", "background_image": "https://media.rawg.io/media/screenshots/a6c/a6c0b9e8e3ad9ab9272fc221b239e394_JyNqZL9.jpg", "website": "https://www.metamoki.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 128, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Metamoki"], "genres": ["Strategy", "Simulation"], "publishers": ["Metamoki"], "esrb_rating": "Everyone 10+"}