{"id": 48807, "slug": "avion-flight-simulator-2016", "name": "Avion Flight Simulator 2016", "name_original": "Avion Flight Simulator 2016", "description": "Update: 10 new missions featuring USA Presidential Air Force One! Air Force One is used for transporting the president of USA<br/><br/>Avion Flight Simulator ™ 2016 is a sophisticated flight simulator that includes 12 planes, 4 detailed cities, and over 9 airports. The player can fly anything from single-engine aircraft to jumbo jets, with idealistic to realistic flight simulation experience. The game features an immersive set of 60+ missions, dynamic real-world weather system, trees and interactive clouds.<br/><br/>Avion Flight Simulator ™ 2016 features 12 detailed aircrafts that you can pilot, with cockpit view: <br/><br/>Cessna 182 - The Cessna 182 Sky lane is an American four-seat, single-engine light airplane, built by Cessna of Wichita, Kansas.<br/><br/>DE Havilland DHC6 Twin Otter - The DE Havilland Canada DHC-6 Twin Otter is a Canadian 19-passenger STOL (Short Takeoff and Landing) utility aircraft developed by de Havilland Canada and produced by Viking Air. <br/><br/>ATR 42 - The ATR 42 is a twin-turboprop, short-haul regional airliner built in France and Italy by ATR.<br/><br/>Piper PA46 Malibu Meridian - The Piper PA-46 Malibu and Matrix are a family of American light aircraft manufactured by Piper Aircraft of Vero Beach, Florida. The aircraft is powered by a single engine and has the capacity for one pilot and five passengers.<br/><br/>A-10 Thunderbolt II - The Fairchild Republic A-10 Thunderbolt II is an American twin-engine, straight wing jet aircraft developed by Fairchild-Republic. It is the only United States Air Force production aircraft designed solely for close air support, including attacking tanks, armored vehicles, and other ground targets with limited air defenses.<br/><br/>DE Havilland Beaver - The de Havilland Canada DHC-2 Beaver is a single-engined, STOL aircraft developed by de Havilland Canada. It is used for cargo and passenger hauling, aerial application (crop dusting and aerial topdressing), and has been widely adopted by armed forces as a utility aircraft.<br/><br/>Canadair CL415 - The Bombardier 415 Superscooper is a Canadian amphibious aircraft purpose-built as a water bomber. It is an aircraft designed for aerial firefighting and is based on the company's CL-215 flying boat. It is marketed in the United States as the \"Superscooper.\"<br/><br/>Beechcraft King Air - The Beechcraft King Air is a twin-turboprop aircraft produced by Beechcraft. They were originally marketed as Super King Airs, with \"Super\" being dropped by Beechcraft<br/><br/>F-16 Fighting Falcon - The General Dynamics (now Lockheed Martin) F-16 Fighting Falcon is a single-engine multirole fighter aircraft originally developed by General Dynamics for the United States Air Force (USAF). Designed as an air day fighter, it evolved into a successful all-weather multirole aircraft. <br/><br/>Boeing F/A-18E - The Boeing F/A-18E Super Hornet and related twin-seat F/A-18F are twin-engine carrier-capable multirole fighter aircraft variants based on the McDonnell Douglas F/A-18 Hornet. The F/A-18E single-seat and F/A-18F tandem-seat variants are larger and more advanced derivatives of the F/A-18C and D Hornet. <br/><br/>Boeing 777 - The Boeing 777 is a family of long-range wide-body twin-engine jet airliners developed and manufactured by Boeing Commercial Airplanes. Commonly referred to as the \"Triple Seven”, it is also the first entirely computer-aided designed commercial aircraft.<br/><br/>Sukhoi Su-33 - The Sukhoi Su-33 (Russian: Сухой Су-33; NATO reporting name: Flanker-D) is an all-weather carrier-based twin-engine air superiority fighter designed by Sukhoi and manufactured by KnAAPO. Following the break-up of the Soviet Union and the subsequent downsizing of the Russian Navy, only 24 aircraft were produced.<br/><br/>Avion Flight Simulator ™ 2016 features pilot cockpit view for all the aircrafts. It contains 5 distinct commercial airports, 2 seaports and 2 small airports. It has no in-app purchases and the aircrafts can be unlocked sequentially as you progress the missions. <br/><br/>Airbus A380, Boeing 747-8 and a military / war expansion pack is being planned", "metacritic": null, "released": null, "tba": false, "updated": "2019-10-30T14:09:42", "background_image": "https://media.rawg.io/media/screenshots/f34/f341d659575bf0ace704d706925b6545.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 256, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["TeaPOT Games"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}