{"id": 488239, "slug": "the-sky-left-us-demo", "name": "The Sky Left Us [Demo]", "name_original": "The Sky Left Us [Demo]", "description": "From the deepest miasma to the shimmering veil, everything is in its place. The Peakborn rule, the Sunken toil, and the Unmoored trade. But Clear Skies Technology could rewrite the atmosphere, and with it the culture of planet Zé. \r\nIt all depends on how you use it.\r\n\n<p><em>The Sky Left Us</em> is a sci-fi visual novel about climate change, classism, and how relationships shape our politics. Play as Spire Risan, an off-worlder scientist who becomes entangled in the drama of a mountain they came here to save. Fall in with the denizens of the three castes, and find that things are more complicated than they seem: be it love, family, or the systems that shape us.</p>\n<p>#PoliticsAsPersonal #EthicsOfTechnology #ClimateChange #Classism #EveryoneIsGay #NonbinaryProtag #FogPunk #Hotties #Intrigue #Romance #FoundFamily #MessyCharacters #DifficultChoices #QueerTransContent</p>\n<p><strong>This is a demo of the game that features the opening sequence. </strong>We are launching a Kickstarter soon to fund the rest of the development. Follow us here, or on Twitter and Instagram @ RatwormGames . </p>\n<p> &gt;&gt;www.theskyleftus.com&lt;&lt; Website back soon!</p>\r\n\r\nThe Story\r\n<ul><li>4 routes and 1 true route exploring Spire's relationships with the denizens of Zé. </li><li>2 stretch goal routes.</li><li>Intrigue and class politics grounded in the relationship routes.</li><li>A rich sci-fi planet characterized by the climate and its imminent changes.</li><li>Diverse characters and relationship types.</li><li>Difficult choices and deeply flawed characters.</li></ul>\n\r\nThe Gameplay\r\n<ul><li>No mechanical bells and whistles. Just quality writing and critical choices.</li><li>A killer soundtrack.</li><li>Multiple endings for each route.</li></ul>\r\nThe Route Characters\r\n<ul><li>THE SPYMASTER — A two-faced Peakborn noble trapped in a web of his own design.</li><li>THE PAINTER — An ambitious Unmoored artist, kept like a bauble by her Peakborn patrons.</li><li>THE KID THIEF — A quiet Unmoored child who has fallen in with pirates.</li><li>THE REVOLUTIONARY — A fiery Sunken leader who wants the peaks to burn.</li><li>THE IDOL (True Route) — A Sunken Idol with a strange connection to the poisonous miasma. </li><li>THE DIVER (Stretch Goal Route) — A Sunken diver who explores the planet's depths.</li><li>THE PIRATES (Stretch Goal Route) — Two Unmoored pirates who search for freedom through their crimes.</li></ul>\n\n<p>Diversity in gaming is important to us, which is reflected in our team, the characters, and the subjects of the game. You can expect a range of relationship types and experiences of gender and sexuality. At the same time, this game has a small cast, so we are not able (or trying to) represent everyone.</p>\n<p><em>Ratworm Games</em> are the creators of the Event Horizon Universe of larps, a setting in which <em>The Sky Left Us</em> takes place. <em>Ratworm Games</em> produces queer-trans speculative fiction games. </p>", "metacritic": null, "released": "2020-09-03", "tba": false, "updated": "2020-09-04T03:35:57", "background_image": "https://media.rawg.io/media/screenshots/888/888c072bf6f96a0de638a109cfb8c6c8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 211, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Ratworm Games"], "genres": [], "publishers": [], "esrb_rating": null}