{"id": 488268, "slug": "rushaug-project-emerald", "name": "Rushaug: Project Emerald", "name_original": "Rushaug: Project Emerald", "description": "<p><strong>Rushaug: Project Emerald</strong> tells the story of a galaxy threatened by totalitarian dictatorship, and a feline willing to sacrifice everything to restore independence. Colorsky Star Force (CSF), a joint military organization is fighting to defend the Sayari System from the invading Dekenzia Major Allegiance (DMA), an imperial monarchy determined to unify all star systems under the will of a single cat. In the middle of this conflict is Rushaug, an elite soldier operating behind enemy lines, gathering critical information, all while sabotaging the enemy from the inside. His accomplishments does not go unnoticed, and he is quickly building a reputation after he defeats DMA’s greatest operative; <strong>Ridley Wesker</strong>. The DMA is determined to stop the threat, prompting Zargasso to dispatch additional forces to hunt down and eliminate Rushaug. Unknownly, Rushaug is about to meet his equal; <strong>Red Nuke</strong>.</p>\n<p>Rushaug has been operating within the Sayari Task Force for a while, and recently uncovered secret documents revealing a mysterious application being developed by the DMA. What is Project Emerald? Find out soon!</p>\n<p>Gameplay and Features</p>\n<p><strong>EXPLORE </strong>a vast spectrum of planets adapting from cold tundras to arid deserts</p>\n\n<p><strong>INFILTRATE </strong>hostile settlements ranging from remote outposts to enormous spacestations</p>\n<p><strong>ENGAGE </strong>in combat against enemies such as the skilled infantry of the DMA, experienced guerrilla fighters on planet Ecuador, or take on the feared Bolse Death Squadron. The game puts huge emphasis on gunplay, and realistic bullet velocity, so it is all about quick reactions.</p>\n\n<p><strong>COLLECT </strong>intel to reveal new locations and gun schematics to unlock 40+ different weapons to choose from</p>\n\n<p><strong>UNCOVER </strong>the truth about Project Emerald in an engaging story</p>", "metacritic": null, "released": "2020-09-02", "tba": false, "updated": "2020-09-04T03:41:58", "background_image": "https://media.rawg.io/media/screenshots/eb2/eb241c7aef62d2d162c12d7a25338a3b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 83, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["TobiasEdvardsen"], "genres": ["Shooter", "Platformer"], "publishers": [], "esrb_rating": null}