{"id": 488377, "slug": "seg-space-shuttle-ii", "name": "SEG Space shuttle II", "name_original": "SEG Space shuttle II", "description": "<p>\r\n\tCenturies have passed since the time when \"The Unknown Resistance\" tried to send four giant asteroids at our home planet. At the space shuttle academy, us cadets are frequently told of the great deeds of the legendary hero pilot and how he crushed the resistance with nothing but a single shuttle. But lately a rumor has made its way around among the cadets. \"The Unknown Resistance\" have once again started to move and are stirring up trouble ever closer to our home planet.\r\n\t<br/><br/>\r\n\tAs a last year cadet I will soon soar across the sky, just like the legendary hero pilot. Even though I am enthusiastic for my graduation, the current galactic situation is no doubt a cause for concern. Will the graduating cadets of my year be enough to fill the void in our navy? Will our home planet be able to repay our debt to higher powers? Will I too be able to defeat \"The Unknown Resistance\" if the time would come?\r\n\t<br/><br/>\r\n\tSEG Space shuttle II is the long awaited sequel to the intense retro experience of SEG Space shuttle.\r\n</p>\r\n\r\n\r\nFeatures\r\n\r\n\r\n\r\n\t\r\n\t\t\r\n\t\r\n\t<p>\n<strong>Intense missions:</strong><br/>\r\n\t\tAn exciting campaign with over 20 missions, multiple additional side missions and even\r\n\t\tan seemingly infinitely long trial mode to test your skills. In total the missions add up to\r\n\t\tpossibly hundreds of hours of gameplay.\r\n\t</p>\n<p>\n<strong>Multiple interesting factions:</strong><br/>\r\n\t\t\"The Unknown Resistance\" makes its return as well as the classic SEG faction itself, but\r\n\t\tthis time around even more factions join the fun. Everything from the xenophobic Marsh\r\n\t\tmilitia and technologically advanced Imperial navy to the mysterious Lunar Wraiths and\r\n\t\teven some standalone actors.\r\n\t</p>\n<p>\n<strong>500+ Items for ship modification:</strong><br/>\r\n\t\tThe classic ways of modifying your ship during missions through batteries and weapons return\r\n\t\tas well as the addition of many new item types. Balance the power usage from the batteries to\r\n\t\tthe reactor output and figure out the optimal balance between ship agility and firepower.\r\n\t</p>\n<p>\n<strong>20+ Unique playable ships:</strong><br/>\r\n\t\tA wide array of uniquely feeling ships with their own looks and playstyles. Each ship has its own\r\n\t\tmodifiers giving it a slight unique edge over the other ships in its own respective area. What ship will\r\n\t\tsuit you the best? Will it be the high DPS Marauder ship or maybe the trade oriented Merchant ship?\r\n\t</p>\n<p>\n<strong>100+ Challenging achievements:</strong><br/>\r\n\t\tA huge variety of engaging and challenging achievements await the devoted. Most achievements additionally\r\n\t\tunlock various exciting and helpful items to aid you during the missions.\r\n\t</p>\n<p>\n<strong>Online co-op:</strong><br/>\r\n\t\tConquer the asteroid fields together in this brand new online cooperative mode. All missions and modes are\r\n\t\tavailable to be played together with your friends in the online co-op mode, even if they do not own the full game.\r\n\t</p>\r\n\r\n\r\n\r\nAdditional information\r\n\r\n<p>\n<strong>Demo:</strong><br/>\r\n\t- If the game is started without a valid Product Key it will give access to a demo version of the game.\r\n\tPlayers with the demo version can still play the co-op mode with someone who owns the full game. Upgrading\r\n\tfrom the demo version to the full game by using a valid Product Key will keep any progress made during demo\r\n\tplay.\r\n</p>\n<p>\n<strong>Gamepad/controller usage:</strong><br/>\r\n\t- The entire game apart from IP address entry when joining a co-op game is possible to navigate and play\r\n\tusing a supported controller. Most gamepads/controllers should be supported.\r\n</p>\n<p>\n<strong>Modding the game:</strong><br/>\r\n\t- It is possible to modify the game in two different ways:\r\n</p>\n<ul>\n<li>\n<strong>Modifying content:</strong>\r\n\t\tDecrypting the JSON files using the provided command file or using the command\r\n\t\tjava -jar game.jar decrypt_json assets/ when in the game directory will allow you to edit\r\n\t\tthe content of the game. Note that the process of decrypting the JSON files will disable achievement\r\n\t\tprogress.\r\n\t</li>\n<li>\n<strong>Modifying the Java code:</strong>\r\n\t\tDecompiling the Java byte code will allow you to modify nearly any feature of the game.\r\n\t</li>\n</ul>\n<p>\n<strong>Main website:</strong><br/>\r\n\t- Main website with slightly more information and better layout is available at:\r\n\t\r\n\t\thttps://www.segames.org/space-shuttle-2.html\r\n\t\r\n</p>\r\n\r\n\r\nSystem requirements*\r\n\r\n<ul>\n<li><strong>CPU:</strong> Intel i5 650/AMD Opteron 4122, Dual Core @2.3GHz</li>\n<li><strong>Graphics:</strong> Intel HD4000 @650Mhz</li>\n<li><strong>Graphics API:</strong> Hardware OpenGL 2.0 or later</li>\n<li><strong>RAM:</strong> 2GB DDR3</li>\n<li><strong>Harddrive space:</strong> 2GB</li>\n<li><strong>OS:</strong> 64bit Windows, Mac or Linux</li>\n</ul>\n<p>* Guesstimated minimum requirements.</p>\r\n\r\n\r\nCredits\r\n\r\n<ul>\n<li>\n<strong>Philip:</strong> Lead programmer, Lead UI designer, Core feature designer\r\n\t</li>\n<li>\n<strong>William:</strong> Lead designer, Lead art and audio artist, Lead writer\r\n\t</li>\n<li>\n<strong>Ludwig:</strong> Ship AI theory, Playtesting\r\n\t</li>\n<li>\n<strong>Anton:</strong> Playtesting\r\n\t</li>\n</ul>\r\n\r\n\r\n\r\n\tNOTE: The download of the full game is the same as the demo download. Purchasing the game gives access to a Product Key that is then used to unlock the rest of the game.", "metacritic": null, "released": "2020-08-20", "tba": false, "updated": "2020-09-04T04:07:13", "background_image": "https://media.rawg.io/media/screenshots/a50/a5050eb8c549b2639634cb37564360ac.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 250, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["SecurityExceptionGames"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}