{"id": 488323, "slug": "monstra-city-bakery-demo", "name": "Monstra City Bakery!! (DEMO)", "name_original": "Monstra City Bakery!! (DEMO)", "description": "<p>It’s rough moving into a new city, and it’s even rougher being the only human in town–but taking over your aunt’s bakery in the middle of the city could be the solution to all your financial woes… if you can keep the place above water! But how hard could it be to run a bakery? If only you had a partner or something to help you out…</p>\n<p>Monstra City Bakery is a dating game that includes:</p>\n<ul><li>three bachelorettes, three bachelors, and three nonbinary bachelorennes for you to get to know and romance as you make your home in Monstra City</li><li>accessibility for players with low/no vision</li><li>choosable name and pronouns for the player character:<em> yes, you can be nonbinary</em></li><li>all characters dateable by all player genders <em>(of course you can be gay)<br/></em></li><li>no gender-locked routes--no need to be called the wrong pronouns just to date the monster of your dreams</li><li>a <em>dateable giant spider</em> </li><li>so, so many baked goods. Just, like, so many</li></ul>\n<p><strong>In this demo, the game's entire intro and three first dates are playable--Callaneiro, the gorgon; Andy, the werewolf-vampire hybrid; and Malketh, the <em>literal giant spider!</em><br/></strong></p>\n\n<p>Please email me at monstracitybakery@gmail.com if you have any issues!<br/></p>\n<ul><li>Clicking, hitting enter, or hitting space will all advance text forward.</li><li>Press V to enable the built-in screen reader and additional audio description.</li><li>Hit H or the middle mouse button to hide the text box so you can look deeply and soulfully into the eyes of your monster of choice with no distractions.</li><li>If you've got audio description on, you can use the arrow keys to and the enter key to navigate and click.</li><li>Use the scroll wheel to rewind if you miss something!</li></ul>\n\n<p>The final game is going to have more stuff, including but not limited to:<br/></p>\n<ul><li>Character creator--make your bakersona!</li><li>Partial voice acting!</li><li>More music--the score isn't finished!</li><li>Achievements!</li><li>Minigames?!</li></ul>\n\n<br/><br/><br/>\n<p>Check out our blog here!<br/></p>\n<p>Follow us on Twitter!</p>\n<p>Check out our Patreon here to get cool MCB stuff, like access to our Discord server, as well as physical merch like stickers and acrylic charms!<br/></p>", "metacritic": null, "released": "2020-09-02", "tba": false, "updated": "2020-09-04T03:55:32", "background_image": "https://media.rawg.io/media/screenshots/ec9/ec936b192085393f075c05b51e1a58eb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 209, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["edgebug"], "genres": [], "publishers": [], "esrb_rating": null}