{"id": 488441, "slug": "invisible-forces-kuvaartandtech", "name": "Invisible Forces (kuvaartandtech)", "name_original": "Invisible Forces (kuvaartandtech)", "description": "<p>Invisible Forces is an exhibition that allows the public to take a look into the future of the Academy of Fine Arts through a virtual visit to the building that is currently being built on Uniarts Helsinki’s Sörnäinen Campus. The immersive exhibition can be viewed with a VR headset or by watching a guided video tour.</p>\n<p>The exhibition presents digital works by the students and staff of the Academy of Fine Arts. The art works displayed are the result of an open call organised at the Academy of Fine Arts in spring 2019, and in June 2020, a new sound work was added to the exhibition. All art has been created particularly with a virtual gallery space in mind. The art works deal with the concepts of visual art such as space and scale, reality and simulation, errors, glitches and various transformations between materials.</p>\n<p>Artists featured in the exhibition: Susanna Autio, Sara Blosseville, Cezár Kaci, Jaana Kähkönen, Ilai Elias Lehto, Suzanne Mooney, Johanna Sulalampi and Nils Titus Östbrant</p>\n<p>Project coordination: Mireia C. Saladrigues and Tuomo Rainio</p>\n<p>Project curatorship: Marko Backman, Tuomo Rainio, Mireia C. Saladrigues and Aleksi Salminen</p>\n<p>Technical coordination: Roberto Pugliese</p>\n<p>Technical support: Marko Backman, and Tuomo Rainio</p>\n<p>3D modelling: Marko Backman and JKMM Architects</p>\n<p>Audio guide, manuscript: Aleksandra Szubert</p>\n<p>Audio guide, sound design: Rosie Swayne</p>\n<p>Audio guide, voice acting: Outi Condit</p>\n<p>Special thanks: Annet Dekker, Jaana Okulov, Marko Vuokola, Ulrika Ferm, and Andrea Mancianti</p>\n<p>You can view the work in two ways:</p>\n<p>Watch the 360 degree video<br/>Download the file and watch with your own VR headset</p>", "metacritic": null, "released": "2020-09-02", "tba": false, "updated": "2020-09-04T04:20:04", "background_image": "https://media.rawg.io/media/screenshots/326/3269649f9df3ae1754f0f3872d9d9eff.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 93, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["kuvaartandtech"], "genres": [], "publishers": [], "esrb_rating": null}