{"id": 488574, "slug": "scrabdackle", "name": "Scrabdackle", "name_original": "Scrabdackle", "description": "<p><em>You've never left the wizard academy before, but today you fell out the window. No time like the present to go explore!</em><br/></p>\n<p><strong>Scrabdackle</strong> is a scribbly hand-drawn game about exploring a large inter-connected world, finding secrets, and facing major challenges.<br/></p>\n<p>A 2D top-down action-adventure focused on exploration and combat, Scrabdackle is the journey of a novice wizard getting to know their own strange world for the first time.</p>\n\n<ul>\n<li>Discover new, intertwined areas like the Ducklands and Blustergust Peak. Find new abilities that allow you to push further into Scrabdackle, and find something curious behind every corner.</li>\n<li>See the world at your own pace, with rare progression gates and an emphasis on non-linear exploration. Although you'll need a full set of abilities to explore <em>every</em> nook and cranny, the order you approach things is entirely up to you.</li>\n</ul>\n<ul>\n<li>Engage charming enemies throughout the world, ranging from harmless-unless-provoked to hostile. Challenges are strewn throughout the world (some hidden), and \"dungeon\"-style areas will push you to your limits before rewarding you with new powers.</li>\n<li>Major challenge arenas and boss fights will test your skills, as your low health and damage never increase, and you'll overcome by leveraging your arsenal of quick-select abilities and learning patterns and telegraphs.</li>\n<li>Or, turn on the Mage Shield's invulnerability to focus on exploration, if reflexive-skill-based challenge isn't what you're here for.</li>\n</ul>\n<ul>\n<li>Talk to personable characters, or walk on by— control is never taken away during dialogue, although some characters may think you're rude if you just walk away mid-chat!</li>\n<li>Enjoy a whimsical soundtrack and lively, 2D cel animations hand-drawn frame by frame.</li>\n</ul>\n\r\nControls, Accessibility, and Assist Features\r\n<ul>\n<li>Playable with a <strong>mouse and keyboard</strong>. Controller support is upcoming.</li>\n<li>More accessibility and assist toggle settings are planned once the game has exited demo state.</li>\n</ul>\r\nFollow the project!\r\n<p>Scrabdackle is currently a <strong>vertical-slice demo</strong>, starting development in mid-May 2020. Though most systems are complete, there's plenty more content to build and releases planned, and I'd love to have you along for the ride.</p>\n<p>Here's where you can follow:</p>\n<ul>\n<li><strong>Twitter</strong> for regular gifs and stills of development</li>\n<li><strong>Bandcamp</strong> for soundtrack releases as they are composed</li>\n<li>Here on <strong>itch</strong> for some devlogs! Click 'Follow jakefriend' in the top right.</li></ul>\n<p>Other ways to reach me:</p>\n<ul><li><strong>Discord</strong> - jakefriend #4098</li><li><strong>Reddit</strong> - u/jakefriend_dev</li><li><strong>Email</strong> - jakefriend.dev@gmail.com</li><li><strong>Itch</strong> - Leaving a comment below!</li></ul>\n\n<p><em>Art, music, programming, writing, design by jakefriend. Built in Godot game engine. Full credits in-game.</em></p>", "metacritic": null, "released": "2020-09-01", "tba": false, "updated": "2022-09-09T03:38:40", "background_image": "https://media.rawg.io/media/screenshots/af6/af68737c08347eec0c7d1643c76af029.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 136, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["jakefriend"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}