{"id": 488789, "slug": "infinite-stars", "name": "Infinite Stars", "name_original": "Infinite Stars", "description": "<p>Infinite Stars is a science fiction series played as an interactive visual novel. It is meant to give humanity hope in the current time of fear and uncertainty. It is meant to make us dream about our future as we mingle with other species, their cultures and beliefs that we have yet to encounter.</p>\n<p>Our game and it’s assets are licensed under the Creative Commons license. We want our fans to write, draw and code their own fantastic visions of what the future could hold. We want them to share their creations with us, their friends, and with strangers all over the internet.</p>\n\n<p>In the distant but still recognizable future humanity has overcome our differences. We are finally a united people. No longer divided by our nationalities, our religions, or our race, we call ourselves human.</p>\n<p>Earth is a beautiful sanctuary planet. It took centuries to repair the damage our forefathers caused. Lunar Command is the hub of the solar government, and except for a few pirates and other undesirables, each individual works together for the greater good of mankind.</p>\n<p>We had total dominion over our solar system.</p>\n<p>Since Galileo gazed at the first planet, humanity has dreamt of meeting extraterrestrial life, but after centuries of shouting into the void of space, we had made peace with the fact that we are truly alone in the universe… Until the Cephilusk convoys arrived and started constructing the Sol Gate.</p>\n<p>The Discovery-War was brief and bloody. The entire Terran Protectorate was destroyed in a matter of days, and humanity resorted to guerilla warfare, sabotaging construction attempts and raiding supply convoys.</p>\n<p>A peace was brokered and official channels of communication were opened. We discovered that there were others like the Cephilusk, countless others and that all the civilized species belonged to the UIC. The United Interstellar Concordat.</p>\n<p>Once the Sol Gate was completed, humanity petitioned to join the UIC. It took years of hard work done by our most brilliant diplomats. They were opposed by the Cephilusk at every milestone, but we did not lose hope and we were not denied membership.</p>\n<p>Most species still view us vulnerable newborns, the newcomers to the interstellar power block, but we will change their minds. We will show them that there is greatness in humanity. We will share our brightly burning passion and curiosity with the universe. We will show them what it means to be human.</p>\n\n<p>Each episode is roughly 30-45 minutes of gameplay for a single branch. The choices that you make during the episode has an impact on how the current episode’s story plays out, while still having an impact on future episodes, and available side quests.</p>\n<p>We intend to implement feedback looped gameplay allowing players to manage a colony or upgrade their starship in-between episodes.</p>\n<p>We also want you, the player to mod and create your own stories in the Infinite Stars universe. If you write a short story, we want you to be able to incorporate it into the Infinite Stars universe and to share it with other people to experience.</p>\n\n<p>Infinite Stars was created in Ren’Py, an easy to learn coding language. (It really is easy to use)</p>\n<p>We intend to release a skeleton project to make it even easier for our fans to modify and start creating their own stories.</p>\n<p>If you want to start creating your own stories, you can find some of our free assets here. Alternatively, if you want a larger variety of assets, or just to learn more about the game you can check out our Patreon.</p>\n<p>The game and assets that we release do cost us money, and we have dedicated large amounts of passion and time to this project. If you like what we are doing, please consider supporting us here or on Patreon. Every cent donated is plowed right back into the project.</p>\n<p>We're excited to share this journey with you! If you want to be one of the first people to join our discord, now is the time!</p>", "metacritic": null, "released": "2020-09-01", "tba": false, "updated": "2020-09-04T05:38:40", "background_image": "https://media.rawg.io/media/screenshots/c14/c142c3df0738b7d7393d49cc9052ab82.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 250, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Android"], "developers": ["InfiniteStars"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}