{"id": 488772, "slug": "river-raid-squadron", "name": "River Raid Squadron", "name_original": "River Raid Squadron", "description": "<p>Answers the question:</p>\r\nWhat if River Raid was a 2-player co-operative game like I though it was supposed to be when I was 12?\r\nThis is a port\r\n<p>This is not just another knockoff made to look like the original (you know, the legendary River Raid game by Carol Shaw and Activision). Nope. This is a port from the Atari 2600 binary code to a modern game engine. Thus, the ground-breaking level generator is the same as the original. Even the fantastic flight controls that feel like they suck you into the canyon walls are the same. The things that are different are what I chose to make different, as you will see below.</p>\r\nRemastered for the Atari 7800\r\n<p>The primary goal is as stated up top: to mod River Raid into a co-op game. That, alone, would have been worth blowing up a bridge over. But, because I wanted a bit more reward for trying to make sense of the disassembled code, I thought I would up the specs a bit. Thus, I remastered the graphics to what should be doable on the 7800. Consequently, what you find here is actually a prototype for testing gameplay before porting again to the 7800 (should there be enough interest to bother getting around to that).<br/></p>\n<p>Never fear, fighter pilots (or is that canyon bombers?), I kept all enemy sprites pixel-perfect to the original, even though I did things like recoloring the ship into a river boat or PT boat. I did, however, make one, possibly controversial, change. I decided that the player's jet looks the most like an F-86 Sabre, and so I got out my pixel hacksaw and chopped the tailplane down to match it a bit better. Thus, the rear of the jet is now 1 pixel narrower on each side. At first, I thought this might only allow the extremely-rare close call after coming out of a bank near an object but, after testing, I noticed you can miss a few frames of refueling if only skimming near a fuel depot. Thus, I might widen the tailplane again, or might just call it a 2-player variant. Not sure. Happy to hear your thoughts on this.<br/></p>\n<p>There are, of course, other changes simply because of, well, 2 players! Kick butt!!! Oh, yeah, back to the topic.... The bridge now takes 2 hits to destroy (at half the hit points each). The screen is also taller allowing you to see and hit 1 more enemy sprite ahead. This has the side effect that it changes when enemies start patrolling and jets start flying (which is pretty random according to game start time anyhow). And... other geeky things I'm probably forgetting at the moment.<br/></p>\r\nTodo list\r\n<p>The game/prototype is pretty well complete, but:<br/></p>\n<ul><li>Add high score saving (such as for the cancelled High Score Cartridge... which homebrew released later)</li><li>Block input for 1-2 sec when entering in-game menus</li><li>Fuel balancing is instant (when player jets touch); slow it down maybe</li><li>Hold last frame of splash down if last life of game</li><li>Kill both planes if they both collide with same object on same frame (black plane currently escapes in this case)</li><li>Look at what the optional POKEY chip might give in terms of audio (other than more channels... which I'm already abusing here at maybe 10 channels on rare occasion... because I didn't care to police that part of the code too hard in a prototype... blah blah etc)</li><li>Upload my commented 2600 asm code (that was started by Thomas Jentzsch)</li></ul>\r\n\r\nControllers\r\n[ Supported Controllers on Linux ]\r\n<p>The list of supported controllers in Windows is the same as Linux with the added bonus of XInput controllers supported as well. Thus, you are much more likely to be able to use recent controllers in Windows at this time. See the above link for more details.</p>\r\nKeyboard controls\r\n<strong>Player 1</strong><br/>WASD, Space to fire<strong>Player 2</strong><br/>Arrows, Enter to firePauseP or EscScreen size presetsCtrl+1 to Ctrl+5 (not Linux)*Fullscreen toggleCtrl+0 (or Alt+Enter if you must)Reset game and<br/>rescan controllersEsc from the main menu\r\n<p>* Only Ctrl+1 works on Linux for reasons that are beyond my noobiness. And, Ctrl+3 is the same as Esc on Linux and this game engine?? Also, the screen size commands are only active on the main menu, for now.</p>\r\nGame modes\r\n<strong>1P</strong>This is really just the credits page telling you to play Carol Shaw's game (until I get permission to add it). [Considering putting an escort game here.]<br/><strong>2P Easy Lives</strong>Your combined score gets a new life for both players at every 10,000 points.<strong>2P Hard Lives</strong>Your individual score (not shown) earns that player a new life at every 10,000 points.\r\n<p>Yeah, my fault for being unable to decide on only one mode. I tried. I failed.<br/></p>\r\n\r\nInstall instructions\r\n<p>I completely and totally (with all my heart) recommend using the itch app to install River Raid Squadron and to keep it updated. I worked hard at tuning the installation to work super-cloud-soft-wonderful with it. Don't waste it. (Otherwise, just unzip and run... and updates are on you.)</p>\r\nLinux notes\r\n<p>Currently, I can only build for 32-bit Linux. The game has been tested and runs on: 32-bit Ubuntu 14.04, 64-bit Ubuntu 18.04, and 64-bit Mint 19.2.</p>\n<p>For info on installing on 64-bit Linux, see my post here:</p>\r\n[ Linux: 32-bit Game on 64-bit OS ]", "metacritic": null, "released": "2020-09-01", "tba": false, "updated": "2020-09-04T05:35:06", "background_image": "https://media.rawg.io/media/screenshots/283/2831120562ac72f9754db802e7eeab0c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 48, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["mj.Jernigan"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}