{"id": 48888, "slug": "1941-world-war-strategy", "name": "1941: World War Strategy", "name_original": "1941: World War Strategy", "description": "1941 is an Android strategy board game based on the conflicts of World War II between the Axis powers (Germany / Japan) and the Allies (Russia / UK / America). 1941 is very similar to the popular board game Axis &amp; Allies®.<br/><br/>NEW: 1942 has come! New features include 3 new units, buildable factories, a more complex map, strategic bombing, shore bombardment and more! 1942 is available for local and online play, and there is no additional cost, it's included in the purchase price.<br/><br/>This legendary war is carried out over 57 land territories and 48 sea zones, and includes 9 different units like infantry, tanks, bombers and battleships. Conquer the enemy and claim victory by destroying their armies and capturing their capital cities!<br/><br/>Use Google Play Game Services to play turn-based games online against your Google+ friends, or auto-match opponents. Send invitations, play rematches, earn achievements and rank on the Wins leaderboard! Receive push notifications when it's your turn to play. Currently supports 2-player games with multiple game mode options.<br/><br/>Local play in 1941 supports 5 players over two teams, in pass and play format combined with an advanced AI if desired. It has been exclusively designed and developed for Android devices including medium to high end phones and tablets, with crisp graphics and an intuitive touch interface.<br/><br/>Awesome features include turn-based multiplayer, detailed in-game statistics, full replay capability, automatic game saving, custom sounds and legendary music. If you're a fan of strategy board games like Axis &amp; Allies®, Age of Conquest, World Conquer or Border Siege, don’t miss 1941!<br/><br/>Note that this game is HD and may run out of memory during loading on some older devices, especially those with 512MB of RAM or less, depending on the manufacturer.<br/><br/>Don’t hesitate to contact me directly with any bugs, questions, suggestions or if you just don't like it and want a refund: brian.dewolff@gmail.com<br/><br/>The Axis &amp; Allies® game and its associated trademarks are the property of Hasbro, Inc. and Wizards of the Coast LLC. This game is neither endorsed by nor affiliated with either company.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-02T05:27:41", "background_image": "https://media.rawg.io/media/screenshots/aa6/aa6b10c6d1fa4a64679d2b8796fb48c8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 211, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["ElectroWolff Games"], "genres": ["Strategy"], "publishers": [], "esrb_rating": "Everyone"}