{"id": 488894, "slug": "rpg-plus-desktop-mobile-tabletop-roleplaying", "name": "RPG Plus - Desktop & Mobile Tabletop Roleplaying", "name_original": "RPG Plus - Desktop & Mobile Tabletop Roleplaying", "description": "<p>RPG Plus (RPG+) is the play-on-the-go app for players of role-playing-games. In these frenetic and busy days, it's hard to find time to meet up with friends and keep your RPG adventure going. RPG+ has been created to take the fun with you everywhere and no matter where your players are. It's an All-in-One solution: campaign manager, chat, character sheet and 3D and 2D map.</p>\n<p>Thanks to its customizable design, RPG Plus (RPG+) can be used for any of your favourite RPGs. Fans of Pathfinder and D&amp;D can enjoy a library of specific sheet templates and characteristic miniatures, and many more features and graphic elements will be uploaded periodically.</p>\n<p>In RPG Plus (RPG+) you can:</p>\n<p>- Create your campaign as gamemaster or join your friends as a player</p>\n<p>- Design your story adding rooms (chats, maps, sheets) and selecting your players</p>\n<p>- Make your own map for each adventure using the 3D builder system, add setting items and miniatures for the characters and keep track of the initiative with the turn manager</p>\n<p>- Add realistic and intuitive 3D dynamic lighting system</p>\n<p>- Upload and share an image to create 2D Maps</p>\n<p>- Interact with the other player via chat: posting messages, rolling dice, sending stickers and sharing links</p>\n<p>- Record your character's features in a digital sheet: choose among preloaded templates, build your own and even share templates with your group<br/></p>\n<p>You can play any old school, pen and paper roleplaying games, for example: dnd (including dnd 5e and Advanced Dungeon and Dragons Second Edition), Pathfinder, Pathfinder 2, Call of Cthulhu, Star Wars, Vampire: The Masquerade, World of Darkness, Shadowrun, Cyberpunk 2020, Mage the Ascension, Werewolf: the Apocalypse, GURPS,  Legend of the Five Rings, Warhammer.</p>\n<p>Become a Patreon to unlock exclusive miniatures!!  </p>\n<p>https://www.patreon.com/rpgplus</p>", "metacritic": null, "released": "2020-08-31", "tba": false, "updated": "2020-09-04T06:03:42", "background_image": "https://media.rawg.io/media/screenshots/d63/d63fe8f13953184b04a3a098482d67fb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 95, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["appminded"], "genres": ["RPG", "Strategy"], "publishers": [], "esrb_rating": null}