{"id": 488840, "slug": "bruxa-de-shopping", "name": "Bruxa de Shopping", "name_original": "Bruxa de Shopping", "description": "<p><strong>[AVISO: ESSE JOGO NUNCA FOI FINALIZADO E ESTÁ INCOMPLETO.]</strong></p>\n<p>Ele foi feito em cinco semanas como parte do Processo Seletivo da GDP em 2019, uma organização de desenvolvedores de jogos da UFRJ. O tema estabelecido foi “bruxaria” e depois disso formaram-se grupos com candidatos de diversas áreas, geralmente amadores ainda em formação e que sequer conheciam uns aos outros.</p>\n<p>Meu grupo, no caso, foi composto por quatro pessoas, todas da UFRJ: Diogo Amorim (programador), Victor Lima (músico e sound designer), Luana Gatti (artista e animadora) e eu, André Alves (roteirista, level designer e game designer). O veterano da GDP, Vitor Barcellos, foi nosso supervisor. Foi assim que nasceu o projeto \"Bruxa de Shopping\". <br/><br/>Logo no início, como roteirista e game designer, eu conversei com a Luana e logo estabelecemos uma estética um pouco sombria mas divertida e cartunesca. Me baseando na questão da bruxaria, pensei em mecânicas de combinação de itens para fazer feitiços. Porém, optamos por objetos aleatórios do cotidiano no lugar dos típicos elementos de bruxaria (ervas, cristais, asa de morcego etc.) na intenção de criar algo diferente, mais moderno e humorístico. Misturando a estética e as mecânicas, pensei num roteiro que contasse com caixas de diálogo e comentários da protagonista durante o gameplay, avançando na história e exibindo sua personalidade. O resultado seria uma espécie aventura point-and-click em perspectiva top-down, com elementos de exploração, puzzle e crafting. Tudo isso foi desenhado pela Luana e programado pelo Diogo, enquanto o Victor elaborava a trilha e efeitos sonoros. Além disso, eu também fiz o level design do shopping, utilizando o GitHub e o Godot com ajuda do Diogo que e introduziu aos programas.</p>\n<p>Enfim, apesar de não termos conseguido finalizar o jogo de fato, fomos todos aprovados e selecionados para fazer parte da GDP. Depois disso, acabamos nos separando em projetos diferentes e o jogo foi infelizmente abandonado. Eu ainda sonho em pelo menos amarrar as pontas soltas e concluir uma “demo” mais apresentável, mas isso não deve acontecer tão cedo...</p>\n<p><strong>PORTANTO, FICA O AVISO:</strong> esse rascunho é mais um protótipo rudimentar do que uma “demo” de fato. Ele foi apresentado pessoalmente na conclusão do processo seletivo, mas dificilmente pode ser compreendido sozinho. Jogue por sua conta e risco. <em>(P.S.: para passar pelas câmeras de segurança, é preciso combinar os itens corretos para ficar invisível... fica a dica)</em></p>", "metacritic": null, "released": "2020-09-01", "tba": false, "updated": "2020-09-04T05:49:55", "background_image": "https://media.rawg.io/media/screenshots/c2b/c2bc835420a78ce68837d859d5e16403.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 90, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["xdddre"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}