{"id": 489293, "slug": "graven-2", "name": "Graven", "name_original": "Graven", "description": "<p>A faithful priest of the Orthogonal order, exiled unto death for a crime in defense of another, you live again in a small boat, adrift in a swamp. A stranger ferries you to solid ground and bestows upon you vague instructions, along with a mysterious staff and book. Go forth, pious priest, alleviate suffering, uncover deceptions, and smash the eldritch perversions encroaching upon reality itself.</p>\n<p>A marriage between modern development tools and techniques with a stark late 90s aesthetic bring the action first person puzzler GRAVEN to life, featuring character designs by Chuck Jones (Duke Nukem 3d, Half-Life) and the voice talent of Stephan Weyte (Blood, Fire Emblem, Dusk) in a dark yet distinct medieval fantasy experience.</p>\n<p>Solve puzzles and scour lore to uncover the motives of the foul heretical sects behind the plagues and seasons undermining the land.<br />\nAlter your environment with all that surrounds you, wielding spells and crystals to adjust as you see fit in your pursuit.<br />\nDiscover new weapons and upgrade them at blacksmiths and alchemists to customize your capability.<br />\nExpand your horizons by returning to old stomping grounds with new abilities and seeing how far down the chasms go.<br />\nSlay over thirty distinct enemies in an ever broadening world across numerous biomes.<br />\nWalk the parallel path, lest you stumble into the recesses of the world, where the fog knows no light, and creatures beyond time roam free.<br />\nEarn your peace.</p>", "metacritic": null, "released": "2024-01-23", "tba": false, "updated": "2024-03-22T15:14:15", "background_image": "https://media.rawg.io/media/games/771/77147800b4b3c72c0abfdc8610559e40.jpg", "website": "http://graven.game", "rating": 3.04, "rating_top": 3, "added_by_status": {"yet": 21, "owned": 91, "beaten": 1, "toplay": 62, "dropped": 20, "playing": 3}, "playtime": 2, "achievements_count": 0, "ratings_count": 23, "suggestions_count": 523, "game_series_count": 0, "reviews_count": 23, "platforms": ["PlayStation 5", "Xbox Series S/X", "PlayStation 4", "Nintendo Switch", "PC", "Xbox One"], "developers": ["Slipgate Ironworks™", "Slipgate Ironworks"], "genres": ["Action", "Shooter", "Adventure", "RPG"], "publishers": ["3D Realms", "1C Entertainment"], "esrb_rating": null}