{"id": 48929, "slug": "one-strike", "name": "One Strike", "name_original": "One Strike", "description": "<strong>Description</strong><br/>One Strike is a 2d fighting game with fast and furious gameplay, memorable characters, and an 8-bit retro aesthetic! Choose between one of six unique fighters, travel to medieval Japan’s beautiful pixelated landscapes and fight to become the greatest warrior in history.<br/><br/>Only one hit decides a match. A duel in One Strike rarely reaches more than 10 seconds. Plan quickly, attack, defend, dodge, lure your oponnent to a reckless attack and finish the duel before you are finished by the blade of the enemy. But don’t worry, if that happen, pick up another warrior and try again.<br/><br/><strong> Features</strong><br/><ul><li>One hit kill mechanic provides fast and fun matches.<br/></li><li>Pixelated graphics with good and exciting animations.<br/></li><li>Amazing artwork made by Zaidan Andrade to complement the beatiful pixel art.<br/></li><li>Original soundtrack and SFX made for One Strike by the amazing Diogo Bazante.<br/></li><li>Adjustable difficulty; Play the game at your own pace. Improve, become the greatest.</li></ul><strong>Game Modes</strong><br/><ul><li>Arcade Mode: Just have fun and improve your skills fighting more matches.<br/></li><li>The Only Life: Well, finish the game with the only life you should have.<br/></li><li>Team Duel: Choose a team of 3 fighters and duel the best trios in Japan.<br/></li><li>Tournament: Gather friends localy and decide who is the best samurai. Up to 16 players in a thrilling bracket mode.<br/></li><li>Local-Multiplayer: Fight your friends with couch multiplayer!</li></ul>", "metacritic": null, "released": "2018-06-08", "tba": false, "updated": "2020-12-25T04:10:56", "background_image": "https://media.rawg.io/media/screenshots/8e3/8e3ed1d8786289ad644a8e9f7f3ff434.jpg", "website": "http://onestrikegame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 6, "owned": 19, "toplay": 1, "dropped": 5}, "playtime": 1, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 260, "game_series_count": 0, "reviews_count": 2, "platforms": ["Nintendo Switch", "PlayStation 4", "PC"], "developers": ["QubicGames", "Retro Reactor"], "genres": ["Action", "Sports", "Casual", "Fighting", "Indie"], "publishers": ["QubicGames", "Retro Reactor"], "esrb_rating": null}