{"id": 48942, "slug": "found-horror-game-11exe", "name": "Found Horror Game 11.exe", "name_original": "Found Horror Game 11.exe", "description": "When I was in school, I used to spend a lot of time coming up with game ideas and writing them down in notebooks, creating supplementary material of what the games would be like on video tapes and cassettes, and starting to develop and abandoning partially finished games in engines like Games Factory and RPG Maker. I'm Dusk Golem aka AestheticGamer, known in some corners of the internet as an absolute horror enthusiast and fanatic. But the truth is, once upon a time I was a huge scaredy-cat. I was convinced I hated horror because I was just too scared by it. Scary experiences would plague me with nightmares, but it also struck a strange fascination within me. I didn't put the pieces together that I actually liked horror until near adulthood, but I always had an attraction to the dark, to Halloween, to ghost stories, to nightmares, and to the twisted.<br/><br/>'Found Horror Game 11.exe' is a game compiling recreations of some of these scrapped games and ideas I wrote down in notebooks years ago. I've changed some of the details, for example some of these originally were fan games or used copyrighted stuff I could never sell and have replaced with materials I have made and can use. None of the game's themselves are tremendously long, but each one is crammed full of secrets. There is 11 games in all, with only Game 1 being available at the start. Once players have met the requirements given per game and post them in the Steam Community Board for the game, I will unlock the next game for everyone.<br/><br/>In FHG11.exe, we sometimes follow a girl named Aurora, sometimes not, who must reach the end of the game (but occasionally, there's more than one ending). Each game is different, but also similar. The ideas came from my nightmares... Or at least I think they were my nightmares, but what else could they be? I jotted them down in my notebooks, recorded ideas I had for these projects, and some even far enough along to get made into games I started then never came back to. But I'm coming back to them now.<br/><br/>The games themselves ranged from a simple haunted house simulator, to a scenario with you trapped in a surveillance room having to help others out, and even a trap-ridden labyrinth of horrors. The scenarios themselves are varied, elusive, and strange.<br/><br/>I want to share these games with you, and maybe if I do, it'll finally stop.<br/><br/><strong>FEATURES:</strong><br/><ul><li>11 small games exploring eleven separate but connected elements and narrative, but a unique gameplay experience for each one. Every game has a twist or two, and a unique creepy experience.<br/></li><li>Loaded with secrets to find and uncover, and goals for the community as a whole to work towards and discover.<br/></li><li>An unnerving air begins to flow over you. Things are not as they always seem, and an unsettling atmosphere will always keep you on your toes.<br/></li><li>An unnerving sound design, featuring voice acting. Best enjoyed in a dark environment wearing headphones.<br/></li><li>Multiple endings in several of the games to experience.</li></ul>", "metacritic": null, "released": "2017-11-03", "tba": false, "updated": "2019-08-28T22:04:11", "background_image": "https://media.rawg.io/media/screenshots/7bc/7bcffdc83fb95d1adddb7473b5933d59.jpg", "website": "http://yaigameworks.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 120, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Yai Gameworks"], "genres": ["Adventure", "Indie"], "publishers": ["Yai Gameworks"], "esrb_rating": null}