{"id": 489507, "slug": "banish-the-rubbish", "name": "Banish the Rubbish", "name_original": "Banish the Rubbish", "description": "<p>Functionnal version name: BanishTheRubbish_V3</p>\n\n<p>Champeau-Fournier. Ophélie - Animation, modélisation<br/>Dixon, Lissa - Sequeira, UI, Character modeler<br/>Jomphe, Naomi - Modélisation, Texture<br/>Ishoj-Paris, Yohanna - Lighting / FX<br/>Morin Grandmont, Maxime - Programmation<br/>Paré, Cassandra - Tech art<br/>Tremblay, Emma - Sound Design<br/><br/>Le but du jeu est de remettre l'ordre dans le chaos qu'est devenu la chambre du protagoniste avant que sa mère ouvre la porte. Le joueur devra trier les différents objets dans les bons conteneurs afin d'arriver à ses fins.<br/>Les contrôles sont simples : W pour avancer, S pour reculer, D pour se diriger à droite et A pour se diriger à gauche. La barre Espace peut être utilisée pour sauter dans le niveau. F sert à donner des ordres à votre compagnon robot, il se dirigera vers la dernière location que vous avez pointer avec la commande. Pour interagir avec les objets, utiliser le Clic droit de la souris pour prendre l'objet de la main droite et le Clic gauche de la souris pour prendre l'objet de la main gauche. Laisser appuyé pour pouvoir charger votre tir et relâcher à votre besoin.<br/>Le défi technique incorporé prend la forme d'un petit robot aspirateur qui obéit aux commandes de joueur ou se déplace par lui-même, remplissant sa tâche qui est de nettoyer les taches et ramasser la poussière.</p>", "metacritic": null, "released": "2020-09-06", "tba": false, "updated": "2020-09-07T03:21:16", "background_image": "https://media.rawg.io/media/screenshots/cde/cdef00cbb271f329e3ffed7860f2e742.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 33, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["CassAttack9", "Meteox", "RandomDoodles", "VerdantForests", "artisticJabberwock", "Globbie"], "genres": [], "publishers": [], "esrb_rating": null}