{"id": 489589, "slug": "bull-cow-game-raghuvansh-agarwal", "name": "Bull Cow Game (Raghuvansh Agarwal)", "name_original": "Bull Cow Game (Raghuvansh Agarwal)", "description": "<strong>Bull &amp; Cow Game </strong>\n<p>Bull Cow Game is a simple puzzle game developed in Unreal Engine 4 as part of an ongoing project. It is a Word Guessing Game in which player have to guess an Isogram <link examples=\"\" isogram=\"\" to=\"\"/>. It was developed by me under a week and pre made assets of unreal engine marketplace was used. </p>\n<p> </p>\r\nGameplay \r\n<ul><li>Player will be greeted with an opening scene in which rules and definition of game and isogram will be explained to them respectively. </li></ul>\n<ul><li>Hidden Word will Have a length ranging from 4 to 8. </li><li>Players then will have to guess an isogram which fits the criteria of the hidden word. </li><li>Player Input will be processed and appropriate messages will be shown. </li><li>Number of Attempts which player will have, will be directly proportional to the length of the Hidden Word. </li><li>If Player is Successful in guessing the word a Win Screen will Show appreciating the player. </li></ul>\r\nWhat Is Isogram? \r\n<p>According to Various Sources, an Isogram can be explained in one of two ways. </p>\n<ol><li>An Isogram is a type of word which contains unique letters i.e. Each letter will occur exactly one time in the word.  <strong>Examples:</strong> Host, Post, Coast, Toast, Donkey and various other isograms. </li></ol>\n<ol><li>An Isogram is a type of word which contains all letter equal number of times i.e. Each letter in the word will occur equal number of times.  <strong>Example: </strong>Dodo, Vivienne, intestines and various other isograms </li></ol>\n<p> </p>", "metacritic": null, "released": "2020-09-06", "tba": false, "updated": "2020-09-07T03:38:25", "background_image": "https://media.rawg.io/media/screenshots/790/7901031d85ee6c71c4dfb95a85608fa0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 124, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Raghuvansh Agarwal"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}