{"id": 489586, "slug": "the-great-conversion", "name": "The Great Conversion", "name_original": "The Great Conversion", "description": "Convert Robots using your Great Machine! \r\n For they are yours to command. Send them on their way, but modify their instructions so that they no longer resemble what they once were...\r\n<p>In this game you build great machines using conveyors, branches, and writers. You will have to think carefully about each design, as the Great Machine has keen senses, and knows when you are trying to get away with something. </p>\r\n How to Play \r\n<p> Select a stage at the Stage Selection screen, then read the description in the lower-right to learn what your objective is. </p>\r\n The Bot \r\n\n\n\n\n\n<p> Each bot has a \"tape\", an array of colored indicators that can be read and often times, have to be converted to new data. Bots can be \"accepted\" or \"rejected\". A rejected bot just has to be thrown on the floor, while an accepted bot has to reach the exit.       The tape reads from right-to-left, with the current marker being on the dot indicated by the box.  Other markers in the queue will be pushed right when the current marker is removed. </p>\n<p> There are three types of objects you can build: </p>\n\n\n\n\n\n\n\r\nConveyors move robots around the machine.\r\n\r\nBranches add logic to your system. When working with bots, you will need to make logical decisions, and these will aid you in that. Bots will steer towards the direction that matches a color on the branch arrows.\r\n\r\nWriters add to a bot's tape. You can write many types of colors and with this system, it is flexible enough to let you define the meaning of each color. Use this power carefully to solve problems.<br/>\r\nOptional Download\r\n<p>You may choose to download this file optionally for on-the-go / local play. This game is compatible with any Javascript-enabled web browsers!</p>\n<p><strong>The Great Conversion (In Zip format)<br/></strong><br/>Want to play this on the go? http://projectdivar.com:8080/TheGreatConversion<br/>I built this game so I can have a game of this type always available on the go. I did my best to integrate some mobile-friendly features.<br/><br/>Github repo for this project is at https://github.com/sigonasr2/TheGreatConversion</p>\r\nCredits\r\n<p>I would first like to thank javidx9 (formally known as OneLoneCoder) for hosting an awesome coding jam! I had a lot of fun, and I believe many others did as well.</p>\n<p>This game is heavily inspired by Manufactoria, so it's only natural I give credit to the creator of Manufactoria, <strong>@pleasingfungus - Nicholas Feinberg</strong></p>\n<p>Music is from an excerpt from the Shostakovich - Symphony No.9 Performance</p>\n<p>All graphics were designed by myself.<strong> (@sigonasr2) Joshua Sigona</strong> - Creator of The Great Conversion</p>\n<p>Font licenses are included in attached License files.</p>", "metacritic": null, "released": "2020-09-06", "tba": false, "updated": "2020-09-07T03:37:53", "background_image": "https://media.rawg.io/media/screenshots/181/181817c255f30d09ce508cb44de58951.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 60, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["sigonasr2"], "genres": ["Simulation", "Puzzle"], "publishers": [], "esrb_rating": null}