{"id": 48959, "slug": "7-bones-and-7-stones-the-ritual", "name": "7 Bones and 7 Stones - The Ritual", "name_original": "7 Bones and 7 Stones - The Ritual", "description": "7 Bones and 7 Stones - The Ritual is an asymmetrical, top down, RPG multiplayer game set in a very unique medieval fantasy realm, called Vayandor. In the game, one player is randomly chosen to spawn as the Monster (Vampire at launch) and all others are spawned as Villagers. The goal of the game for the Villagers is to find Ritual Stones in the dark forest and bring them to the Altar. When enough Ritual Stones have been delivered the Altar closes and all evil is abolished from the land and the Monsters lose. <br/><br/>However, the powerful monster will hunt them and will try and catch them, so the Villagers will have to hide and play smart. When a Monster catches a <br/>Villager it turns him into one of his. Turned Villagers now become Monsters themselves and change sides. <br/><br/><strong>Features</strong><br/><ul><li><strong>Beautiful VISUALS</strong> - The game is very polished and is in line with AAA productions in terms of graphical quality, despite being a very indie production.<br/><br/></li><li> <strong>Play as scared VILLAGERS</strong> - Run in the forest of Vayandor from the dark Vampire lord that has been summoned by the ALTAR. You and other 4 villager players have the main objective of finding Ritual Stones in the forest and delivering them to the Altar. Once enough Stones have been delivered the Altar closes and takes back all evil from the land. Villagers win the game only if the Ritual is completed and the Altar is closed. But running from the Vampire lord will not be enough, and sometimes you will have to search for a hiding spot or turn on the fire on a Light Altar that protects you for a while. <br/><br/></li><li><strong>Play as powerful MONSTERS</strong> - The dark Vampire lord is the first monster at release, but we plan on adding more monsters, like the Werewolf, Necromancer, Witch, Reaper, etc. Each Monster comes with its own set of abilities and unique gameplay. The Vampire has bat themed abilities and can turn himself into a flock of bats to fly over the forest and search for villagers, or to lunge into the night’s sky as a swirl of bats only to return as a powerful blow on a designated area. When the Vampire gets close enough of a Villager he instantly bites him. Villagers that have been caught become Minor Acolytes that now have 30 seconds to either be blessed by a fellow Villager or accept their fate of becoming a VAMPIRE themselves! Vampires win the game if the time runs up for the Ritual to be completed or if there are no more Villagers on the map.<br/><br/></li><li> <strong>Unique GAMEPLAY</strong> - The design takes a lot of inspiration from quality games of the genre but puts an interesting spin on the asymmetrical aspect. Villagers can be turned into Monsters and change sides when caught. This feature means non stop action and no player elimination/down time once a match has started. <br/><br/></li><li><strong>MULTIPLAYER Cooperative</strong> - What's more fun than running scared in a fantasy forest with your friends? <br/><br/></li><li><strong>Dedicated SERVERS</strong> - We may be an indie company, but we take multiplayer very seriously and this is why we bring the best networking services out there. You will experience no issues while playing a multiplayer match. Dedicated Servers also reduces any hacking/cheating threat.<br/><br/></li><li> <strong>Rich WORLD</strong> - We have put a lot of effort and love into creating an unique world. You will experience an east European fantasy realm like never seen before with a very rich lore.</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-23T12:12:12", "background_image": "https://media.rawg.io/media/screenshots/d7e/d7eab76688b34f6d45f4f752bc3a4612.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 365, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["RunAroundGames"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["RunAroundGames"], "esrb_rating": null}