{"id": 489728, "slug": "updog-jf1x-larner", "name": "Updog (jf1x, Larner)", "name_original": "Updog (jf1x, Larner)", "description": "Play as Boz, a dog whose adventurer master left to vanquish an evil enemy at the top of a tower - and didn't take Boz along with him, or the ball he threw before he left! Deliver the ball to the top of the tower and be a Good Dog!\r\n<p>Featuring a brilliant soundtrack by Larner, <strong>Updog</strong> is a challenging, non-violent platformer. Try to return the ball as quickly as possible! Your best time will be saved, post it below to compete with other players!<br/></p>\n<strong>Controls</strong>\n<strong>GameBoy button</strong><strong>Keyboard (QWERTY)</strong>Up/Down/Left/RightArrow Keys<br/>AZBXStartASelectSDouble Jump Mode (see below)<br/>Hold Select [S] and press [Up]<br/>Ball recall (see below)<br/>Hold Select [S] and press Start [A]<br/>\n<p>Keys can be rebound using the TIC-80 operating system by pressing Esc</p>\n<br/><strong>Double Jump mode<br/></strong>\n<p>You can turn on <strong>Double Jump mode</strong> by holding <strong>Select [S]</strong> and pressing <strong>[Up]</strong>. This mode will grant you a second jump mid-air after regular jumps and wall jumps. High scores will be marked with a Double Jump icon if you had it on at any time during the run.</p>\n<p>Double Jump mode can also be used for another speedrun category as best times are stored separately!<br/></p>\n<br/><strong>Has your ball disappeared or is unreachable?</strong>\n<p>Never fear! Ancient canine magic is available to you! Simply hold <strong>Select [S]</strong> and press <strong>Start [A] </strong>and your ball will be teleported to your feet. But beware, a full 3 minute time penalty will be applied. All magic comes at a cost!<br/></p>\n<br/><strong>Performance issues with the web version?</strong>\n<p>Please download the standalone exe below to play natively on Windows.<br/></p>\n<br/><strong>Developer playthrough</strong>\n<p>If you'd like a hint, or just want to watch the game without playing it, watch my full playthrough here: </p>\n<br/>GBJAM Disclaimer\r\n<p><strong>Updog</strong> was made for GBJAM8 in TIC-80, a fantasy console. The resolution and palette of the TIC-80 <em>operating system</em> cannot be modified to suit the rules of the jam. However, the <em>game</em> itself <strong>does </strong>follow all the rules. Pressing Escape will bring up the TIC-80's built in menu - this should also not be considered part of the entry as it cannot be modified.</p>\n<br/>Known issues<br/>\n<ul>\n<li>Boz can sometimes teleport through chickens when pushing against them</li>\n<li>The ball can sometimes be teleported away when jammed into a corner by a chicken</li>\n</ul>", "metacritic": null, "released": "2020-09-06", "tba": false, "updated": "2020-09-07T04:12:15", "background_image": "https://media.rawg.io/media/screenshots/853/8538e51bdf865cc6919c1196e54d2087.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 36, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["jf1x", "Larner"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}