{"id": 489714, "slug": "newcomen-atmospheric-engine-sim", "name": "Newcomen Atmospheric Engine Sim", "name_original": "Newcomen Atmospheric Engine Sim", "description": "<p>The steam engine revolutionized the world. Thomas Newcomen's atmospheric engine was the first commercially successful steam engine, used to pump water from flooded mines. Unlike high-pressure steam engines, which directly use the expansive force of steam, it worked by spraying cold water into steam, condensing it and pulling down a piston with the resulting vacuum.</p>\n<p>This is an attempt to simulate the Newcomen atmospheric engine in a very simple way. You have to put it together yourself (it's only a few parts in-game).</p>\n<p>There is no tutorial, but just Google \"Newcomen atmospheric engine\" to see what it should look like.<br/></p>\n\n<p><strong>Controls:</strong> Left click on menu buttons to select a part. Then click on the desired node to connect (or click and drag between nodes, in the case of the chain). Click the Start/Stop button to start or pause the simulation, or click reset if you want to start over (I didn't have time to allow you to disconnect or move parts already placed, so you will have to reset and start over to do that).</p>\n<p>Esc to quit.</p>\n\n<p><strong>Goal: </strong>No goal. Connect stuff and watch it move.</p>\n<p>(Hint) If you stick a piston inside the piston housing above the boiler unit, it will start receiving a strong downward force every few seconds.</p>\n\n<p>Code is major spaghetti, but it's included in the standalone zip if you really want to see.</p>\n<p>Known bugs:</p>\n<ul><li>UI got wonky in the build version.</li><li>Sometimes a part will immediately spawn at your mouse when you click a part button, or your cursor won't have the part after clicking the button. Try clicking the buttons and/or canvas a few times to fix, or possibly reset.</li><li>The piston may glitch through its housing when getting forced down near the bottom. Reset to fix.</li><li>Attempting to attach a chain between two other chain nodes will result in a crash in some circumstances (though you never need to do this).</li></ul>", "metacritic": null, "released": "2020-09-06", "tba": false, "updated": "2020-09-07T04:09:07", "background_image": "https://media.rawg.io/media/screenshots/2b9/2b9909469fbb87b0f6fc4fe3a91ee91e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 6, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["bluepunch"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}