{"id": 489720, "slug": "11-stories-that-survived-the-end-of-time-and-space", "name": "1:1 ~Stories that survived the end of time and space~", "name_original": "1:1 ~Stories that survived the end of time and space~", "description": "<p>\"And if you gaze long enough into an abyss, the abyss will gaze back into you.\" Friedrich Nietzsche</p>\n\n<p>1:1 is a little set of experiments in game making and story telling. It is to be updated semi regularly, perhaps monthly, and tell the tales of people going through the throes of emotion many of us find ourselves late at night when our sanity is too tired to keep us safe from the truth of the infinite expansive space we usually don't want to let set in, lest the fear of death, entropy, and eternity wake us up in a cold sweat. In 1:1, people try to find those death defying, anti entropy, eternity controlling things; complications ensue. </p>\n<p>Gameplay wise, you'll find some simulation aspects that hopefully feel fairly snappy, an RPG combat system based around balancing status effects, combos, and strategy, and for those who have friends a nice and simple drop in local multiplayer system (janky multiplayer is always a good substitute for actual content). The main gameplay loop was worked on to be fun to just jump in and have short quick sessions of at your leisure when not doing story content, so hopefully it's pleasurable.</p>\n<p>As for the story content, early chapters are going to be a ... learning process, but after that the main storyline can begin, dealing with the war for control of the great power of End of Ends. Some chapters will be linear, some will be wide open with many choices, some inbetween. 1:1 might get a few side stories/chapters thrown in, and some of those might lead up to a second \"season\" after this one. We'll see how it goes and how far I take this, but finishing the End of Ends storyline is first on the agenda.</p>\n<p>I promise to try and make these little adventures humbly, head firmly on my shoulders, if you'll keep a prideful and discerning eye to them; I create for you, not myself, so no point in rambling too much about philosophical aphorisms unless I can explain them coherently. But hopefully, as the worlds of 1:1 rise, fall, and rise again, someone out there will be able to sleep a little easier at night with the answers our intrepid, anti-entropic heroes fight to find. </p>", "metacritic": null, "released": "2020-09-06", "tba": false, "updated": "2020-09-07T04:10:28", "background_image": "https://media.rawg.io/media/screenshots/9f5/9f5e5a6e97f1f01bb01d53ade667ea63.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 186, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Thamaliam"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}