{"id": 48971, "slug": "8-bit-adventures-2", "name": "8-Bit Adventures 2", "name_original": "8-Bit Adventures 2", "description": "<strong>A Retro RPG That's More Than a Throwback!</strong><br/><strong>8-Bit Adventures 2</strong> is an all-new RPG experience that mixes modern design with retro style.<br/><br/>Explore a vast and varied world, brought to life by vibrant 8-Bit graphics, memorable NES-accurate music, and people with personality. Players can enjoy strategic, fast-paced combat that focuses on unique character traits, swapping party members, managing the turn order, and using a variety of unique skills (including powerful Omega Bursts) – no mandatory grinding required!<br/><br/>The antagonist takes the form of a video game ‘glitch’. Faced with erasure, the Glitch lashes out, distorting the world and threatening its people. It’s up to the player’s party of 7 distinct characters (3 returning, 4 brand new) to undo these distortions and defeat the Glitch. But to do so, they’ll have to brave dozens of dungeons, defeat deadly enemies, and even travel to other worlds!<br/><br/><strong>Featuring:</strong><br/><ul><li>    Beautiful, Vibrant 8-Bit graphics that bring the world to life!<br/></li><li>    Unforgettable NES-like Music with retro charm!<br/></li><li>    Classic RPG Gameplay enhanced by Modern Design (say goodbye to grinding!)<br/></li><li>    All New Battle System with 7 Unique Playable Characters!<br/></li><li>    An Engaging, Character-focused Story with Great Pacing &amp; Meaningful Moments!<br/></li><li>    Explore Two Very Different Worlds - In the Computer World, Anything Goes!<br/></li><li>    A Villain unlike anything you've seen before - the Glitch!<br/></li><li>    Discover Captivating Characters, and People with Personality!<br/></li><li>    Save Anywhere - Play for as long as you want, whenever you want to!</li></ul><br/>Get a taste for adventure in the First Look Demo, available now! Explore the Processor, meet new party members, survive a deadly train ride, and defeat a powerful boss!<br/><br/>", "metacritic": null, "released": null, "tba": false, "updated": "2021-08-13T03:32:22", "background_image": "https://media.rawg.io/media/screenshots/661/6612813856e0bc8b69ba0fb3e58d02d0.jpg", "website": "https://www.8bitadventures2.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 5, "toplay": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 358, "game_series_count": 1, "reviews_count": 0, "platforms": ["PC"], "developers": ["Critical Games"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Critical Games"], "esrb_rating": null}