{"id": 48984, "slug": "perfect-dead", "name": "Perfect Dead", "name_original": "Perfect Dead", "description": "Welcome to Perfect Dead, the world was afflicted by a unknown virus outbreak which wiped out the population of planet Earth. You are part of the few that have survived and now you must fight for your life against other survivors and the indigenous zombie population. Survive solely by yourself, or put your trust into other survivors to survive in this changed world.<strong>This is your story.</strong><br/>Perfect Dead is a open-world survival online multiplayer game, in which players follow a similar goal: to survive as long as they can. Players can experience chilling encounters and tension evolving from the game play. There is no tips, or help given to players. They must survive by instinct. Every decision you make matters, the smallest mistake can be lethal. If you perish, you lose everything and must scavenge once more with only your hands. Fight the zombie population by yourself or with friends, but other players can be friendly or enemies without you knowing.<br/><br/><strong>KEY FEATURES</strong><br/><ul><li>World - A world which is ever changing with decay and growth.<br/></li><li>Client - Customizable options and features with full screen support.<br/></li><li>Server - 100 players per server with modern server architecture developed from scratch.<br/></li><li>Items - Over 35 items that you need for survival or just plain fun in the changed world.<br/></li><li>Weapons – Use many firearms or melee weapons to ward off enemies.<br/></li><li>Modding– Customize your client with texture packs and sounds, making the game look and sound the way you want it to.</li></ul>", "metacritic": null, "released": "2018-06-27", "tba": false, "updated": "2019-08-23T12:12:12", "background_image": "https://media.rawg.io/media/screenshots/30c/30c902d8e92b3e91f6f1a74012d9892c.jpg", "website": "http://PerfectDead.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 81, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Zathex Studios"], "genres": ["Action", "Adventure", "RPG"], "publishers": ["Zathex Studios"], "esrb_rating": null}