{"id": 489815, "slug": "make-it-last-while-you-can", "name": "Make It Last: While You Can", "name_original": "Make It Last: While You Can", "description": "We return to Harvey and Jordan's story, when Candace was only nine years old.\r\nA simple story of forgiveness and loss.\r\n\n\n<p><strong>Make It Last: While You Can</strong> is a visual novel that  is set during the mid-2000's and is a stand alone story that takes place in the same series as Destiny Fails Us: A New Life and Make It Last, approximately 10 years before the events of those games.  </p>\n<p>This game features several appearances by characters from other games in the series, such as: Mr. Sly, Lily Day, Charlotte Hastings, Samson Hastings, and Reginald Sly.</p>\n<p>This visual novel has full 3D character models, and each character has animated gestures, facial expressions, and poses. There were supposed to be animated cutscenes, but I couldn't get them to actually play in the final build of the game.</p>\n<p>Development for <strong>Make It Last: While You Can </strong>started in August 2020, and the game was completed in one month for the Summer Novel Festival and Yaoi Game Jam 2020.</p>\n\n\n<p><em>This game features two gay men in a long term relationship as the protagonists, with a side story that follows their daughter and her best friend, Jess. </em><br/></p>\n<p><em><strong>Content Warnings</strong>: Mention of death, mention of cancer, visits to the hospital, swearing. There is a relatively short scene (about 30 lines in length) where Harvey gets into an argument with his father about Harvey's relationship with Jordan.</em><br/></p>", "metacritic": null, "released": "2020-09-06", "tba": false, "updated": "2020-09-07T04:30:58", "background_image": "https://media.rawg.io/media/screenshots/c36/c366f4249be5fcd690f1f2a4454e68f3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 233, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Strawberry Dagger Studio"], "genres": [], "publishers": [], "esrb_rating": null}