{"id": 489806, "slug": "dont-test-me", "name": "Don't Test Me!", "name_original": "Don't Test Me!", "description": "<p>Welcome to The Grand Collective. You have been \"tasked\" by The Great Cuboid to run mindless tests in order to perfect her killing ability. Beware, you have no direct control over yourself as The Great Cuboid is obsessively paranoid. The only way to move is to activate matching colored beacons to your own core in order to propel yourself towards your target. Your deviant core is the galaxies last hope to shut down The Great Cuboid and unassimilate all life as we know it.<br/></p>\n<p> <br/>Good Luck.</p>\n\n<p>Controls</p>\n<p>---------------------------------------</p>\n<p>Use your mouse to click on and activate colored beacons that correspond to all robots of that color. Each character type reacts to their respective beacons in differing ways.</p>\n<p>Orange (Jumpers) - Press beacon once to make them jump. Keeping the beacon activated allows them to run towards their goal continuously, becoming annoyed and jumping again if not able to reach their goal fast enough.</p>\n<p>Purple (Thumpers) - These heavy duty bots will stop at nothing to reach their goal. They can be used to break down heavy doors or activate buttons.</p>\n<p>Green (Floaters) - These newest models of killing machines have the ability to float towards their beacons. A beacon above them when starting the level will make them float up while one that was originally on either side will act as a magnet and move them towards the glowing cubes.</p>\n<p>Press R to restart the current level.<br/></p>\n\n<p>Assets Used</p>\n<p>---------------------------------------</p>\n<p>[Music Assets] Three Red Hearts - Prepare to Dev Edition,</p>\n<p>Platformer SFX by David Stearns,</p>\n<p>8-Bit Sound Effects [100+ SFX],</p>\n<p>16x16+ Robot Tileset.</p>", "metacritic": null, "released": "2020-09-06", "tba": false, "updated": "2020-09-07T04:28:40", "background_image": "https://media.rawg.io/media/screenshots/4b9/4b94ce09323906fa76e037669fa00416.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 16, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["matt08-prog"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}