{"id": 48991, "slug": "dreamstones", "name": "Dreamstones", "name_original": "Dreamstones", "description": "Dreamstones is an exciting combination of modern block-breaker gameplay with action RPG statistics, collectable loot and world building. <br/><br/>The Dreamweavers of the floating Kingdom have been attacked by the Nightlings. Stripped of all inhabitants and buildings, only \"Gentle Kenneth\" remains. He requests your aid to head into the Outlands, rescue his fellow Dreamweavers and rebuild the Kingdom. <br/><br/>On your journey you will encounter over 200 hundred levels of block-breaking goodness, crazy puzzles and manic boss battles. Use your skill to maneuver the paddle and lightning-fast reflexes to dodge the endless dangers. Harness incredible boosts from lucky drops or unlock the awesome powers of over 50 equippable skills and weapons.<br/><br/>Can you save the Dreamweavers from the Nightling menace? Do you have the skill required to retrieve all of the Dreamstones spread throughout the Outland maps?<br/><br/><strong>---Features---</strong><br/><ul><li>5 challenging worlds to explore and conquer<br/></li><li>Over 200 hand designed levels of block-breaking goodness <br/></li><li>Rebuild an entire kingdom with over 70 unique buildings to find and build <br/></li><li>Loads of weird and wonderful monsters to defeat <br/></li><li>Dozens of weapons, skills and buffs to find and unlock <br/></li><li>Meet the Dreamweavers and Nightlings and take part in a story of comedy and revenge<br/></li><li>Full original soundtrack </li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:04:09", "background_image": "https://media.rawg.io/media/screenshots/601/6010d915ac35e5e9fcd80e4026423837.jpg", "website": "http://windybeard.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 52}, "playtime": 3, "achievements_count": 25, "ratings_count": 0, "suggestions_count": 409, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Windybeard"], "genres": ["Indie"], "publishers": ["Windybeard"], "esrb_rating": null}