{"id": 48990, "slug": "steamburg", "name": "Steamburg", "name_original": "Steamburg", "description": "Steamburg is an award-winning puzzle adventure game with story exploration elements and unique gameplay. The game is made by Telehorse, a steampunk games company. It was awarded the Best Upcoming Game at IMGA in San Francisco in March 2017. <br/>\n<br/>\r\nThe main character, professor Vincent Cornelius Moore, fights robots that invaded the city of Steamburg. The gameplay is unique – Vincent is unarmed, so he must choose his moves wisely. He can only throw small electro-bombs which lure the robots and halt their progress for a while. Vincent has to walk through the streets in such a way that the robot chasing him hits upon a Tesla coil and is destroyed. It seems quite easy in the first levels. Then you have to fight several robots at the same time, the robots become faster and faster, some of them can fly and other respond to Vincent’s every move.<br/>\n<br/>\r\nNarrative elements are of great importance. In 2016 Steamburg won an award for Best Storytelling at White Nights in Helsinki. Dialogues reveal Vincent to be a scientist responsible for testing a new weapon in Steamburg. At the same time he is searching for his fiancée who was reported to be in Steamburg when the robots attacked. Some narrative elements are connected directly with the gameplay. Players can also find many letters and photos and discover the love story of Vincent and his fiancée.<br/>\n<br/>\r\nFeatures:<br/>\n<br/>\r\n•        Unique, addictive gameplay<br/>\r\n•        32 levels set in atmospheric steampunk locations<br/>\r\n•        Several hidden locations and dozens of narrative objects to be explored<br/>\r\n•        Outstanding American and British voice actors including Bruce Glover (known for Diamonds Are Forever and Chinatown)<br/>\r\n•        Original score by Silver Rocket", "metacritic": null, "released": "2017-11-08", "tba": false, "updated": "2019-08-28T22:04:09", "background_image": "https://media.rawg.io/media/screenshots/b0f/b0fc9fce3b662f77d62533dacb360eac.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 5, "owned": 147, "dropped": 1}, "playtime": 1, "achievements_count": 51, "ratings_count": 2, "suggestions_count": 430, "game_series_count": 0, "reviews_count": 2, "platforms": ["Nintendo Switch", "macOS", "PC", "Android"], "developers": ["Anuman Interactive", "4EversGames", "Telehorse"], "genres": ["Adventure", "Indie", "Puzzle"], "publishers": ["Microids Indie", "Monster Couch"], "esrb_rating": null}