{"id": 48994, "slug": "deathpit-3000", "name": "DEATHPIT 3000", "name_original": "DEATHPIT 3000", "description": "DEATHPIT 3000 is a classic co-op LAN party game in which you fight waves of enemies to claim the arena championships. Battle your way through four distinct Deathpits and slaughter an array of deadly enemies to earn Spacebux, unlock weapons, equipment and upgrades. Players choose a unique quantum ability, each of which promotes offensive or defensive play-styles.<br/><br/>It can be played solo or with up to four players over Local Area Network (NOTE: This game is officially LAN only, however online play is possible using a hosted VPN service, though stability is not guaranteed). It’s a punchy experience, great for casual gamers but with enough challenge and tactical depth for hours of replayability. <br/><br/><br/><br/><ul><li> 1-4 player co-op<br/></li><li> 4 distinct championships<br/></li><li> 4 powerful quantum abilities (shield, group teleport, lighting attack and invisibility)<br/></li><li> 5 voiced playable characters<br/></li><li> 5 upgradable main weapons<br/></li><li> Grenades, mines, jetpacks, armour, deployable walls and turrets<br/></li><li> 12 enemy types, each with unique attacks and weaknesses<br/></li><li> Championship boss battle<br/></li><li> Complete wiki of humorous universe and backstories</li></ul><br/><br/><br/>DEATHPIT 3000 is the first release by Cyberlamb Studios, a two-man indie development team from the UK. Thanks for checking out our game!", "metacritic": null, "released": "2017-12-01", "tba": false, "updated": "2019-08-28T22:04:09", "background_image": "https://media.rawg.io/media/screenshots/ab1/ab16868135084bc2133411a9a9503520.jpg", "website": "http://www.deathpit3000.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 26}, "playtime": 1, "achievements_count": 45, "ratings_count": 0, "suggestions_count": 478, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Cyberlamb Studios"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Cyberlamb Studios"], "esrb_rating": null}