{"id": 490073, "slug": "coding-factoryitescia-master-gaming-smart-tech-1-3", "name": "Coding Factory/Itescia: Master Gaming & Smart Tech ] 2017 [ Sweet Fear", "name_original": "Coding Factory/Itescia: Master Gaming & Smart Tech ] 2017 [ Sweet Fear", "description": "<p>Ceci est la présentation d'un prototype de projet étudiant, dans le cadre de la formation \"Master Gaming &amp; Smart Tech\" de l'école Coding Factory (anciennement Itescia).</p>\n\n<p><strong>Le jeu d’angoisse accessible pour tous :</strong></p>\n<p>Une nouvelle technologie, un nouveau genre de gameplay et un large public cible. Dans ce jeu, on incarne une petite fille devant échapper à son ours en peluche, Timmy, à travers différentes îles. <br/></p>\n<p>Grâce au casque VR (obligatoire), on utilise uniquement avec le regard pour se déplacer et interagir avec le jeu.Cela rendant les manettes classiques inutiles. Ce type de gameplay permet aux personnes à mobilité réduite de participer à cette expérience vidéoludique aussi bien qu’une personne lambda.</p>\n\n<p>En fixant le sol pendant quelques secondes, on se téléporte à cet endroit. En fixant certains éléments de la carte, on interagit avec cet élément. c’est grâce à ça ce mécanisme qu’on évolue dans ce jeu. <br/></p>\n<p>On est poursuivi par un ours cruel qui s’appelle Timmy et qui tente de nous faire du mal. Notre but est sortir des îles en trouvant et en utilisant les clés avant que Timmy ne nous trouve et que le monde ne s’écroule. Une quête à la fois fascinante et stressante.</p>\n<p> </p>\n<p><strong>Équipe :</strong></p>\n<p>Guillaume SEYER <br/></p>\n<p>Lucie Duval <br/></p>\n<p>Yann PASSY <br/></p>\n<p>Fémy NASSIROU</p>", "metacritic": null, "released": "2020-09-05", "tba": false, "updated": "2020-09-07T05:33:29", "background_image": "https://media.rawg.io/media/screenshots/20d/20df358ad660c63e26fdcb500863ee9f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 120, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Coding Factory"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}