{"id": 490043, "slug": "scp-1499", "name": "scp-1499", "name_original": "scp-1499", "description": "<p>http://www.scpwiki.com/<br/></p>\n<p>SCP-1499 is a Soviet GP-5 gas mask. A seal test performed on the object suggests that the object retains its original functionality. The anomalous effects of SCP-1499 activate when a human places SCP-1499 on their head. Approximately one second after SCP-1499 is fully secured on the subject's head, the subject vanishes from view, and is no longer detectable. The subject reports no feeling of motion at this time. Testing has revealed that two-way radios remain capable of both receiving and transmitting despite the subject being undetectable. Upon wearing SCP-1499, test subjects report completely different surroundings than they were in prior to wearing SCP-1499. Subjects have reported that it appears barren and inhospitable, with tall black towers filling the area. Subjects have also sighted entities in this landscape. These entities, designated SCP-1499-1, have been described as tall, nude humanoids with dark skin that have a thick coat of an unknown viscous substance. Instances of SCP-1499-1 also have large amounts of eyes and mouths covering their body. Upon removing SCP-1499 from their head, subjects reappear in the same location they were in when they put it on. For more information, see Test Log 1499.</p>\n<ul><li><strong>It's an experience if you have ideas or things that can be added</strong></li><li><strong>Support game created movies on youtube shared link</strong></li><li><strong>Thanks</strong></li></ul>", "metacritic": null, "released": "2020-09-05", "tba": false, "updated": "2020-09-07T05:24:24", "background_image": "https://media.rawg.io/media/screenshots/f39/f3918c44ec40e30f48c8c6a689820113.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 54, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["t73st01"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}