{"id": 490063, "slug": "coding-factoryitescia-master-gaming-smart-tech-2-9", "name": "Coding Factory/Itescia: Master Gaming & Smart Tech \\ 2018 / Dilemma", "name_original": "Coding Factory/Itescia: Master Gaming & Smart Tech \\ 2018 / Dilemma", "description": "<p>Ceci est la présentation d'un prototype de projet étudiant, dans le cadre de la formation \"Master Gaming &amp; Smart Tech\" de l'école Coding Factory (anciennement Itescia).</p>\n\n<p>Dilemma est un jeu vidéo de coopération et d’infiltration à deux joueurs, combinant l’utilisation du casque HTC VIVE de réalité virtuelle avec le jeu classique sur PC, au clavier et à la souris.</p>\n\n<p>Dans un monde cybernétique entièrement virtuel, un pirate informatique surdoué crée un virus doté d’une intelligence artificielle exceptionnelle pour retrouver la conscience de sa femme capturée par une puissante organisation.</p>\n\n<p>Au travers une expérience d'une heure environ, alternant réflexion et aventure, le but de chaque joueur sera bien spécifique : tandis que l’un d’entre eux aura pour mission de s’infiltrer dans des labyrinthes en évitant multiples pièges et en interagissant avec des dispositifs, l’autre devra le guider, et lui permettre de passer sans encombre les ennemis qui seront présents dans le niveau.</p>\n<p>La relation scénaristique entre les deux joueurs se présente ainsi : le joueur qui s’infiltre dans le niveau en réalité virtuelle est un virus informatique doté d’une intelligence humaine ; l’autre joueur qui le guide et l’aide avec sa souris est son créateur, un hacker.</p>\n\n<p>La coopération pourrait être le seul lien entre les deux joueurs mais une notion de rivalité est présente, et pas des moindres : alors que la véritable intention du hacker est de sauver sa femme capturée par l’univers du jeu, celle de son virus est de devenir de plus en plus puissant. La notion de dilemme lui reviendra alors entièrement : obéir ou trahir ?</p>\n\n<p>Les auteurs du projet :</p>\n<p>Guillaume THIEBAUD <br/></p>\n<p>\r\nPascal RAMOS\r\n<br/></p>\n<p>Rémi RIU <br/></p>\n<p>Renaud ORY</p>", "metacritic": null, "released": "2020-09-05", "tba": false, "updated": "2020-09-07T05:30:46", "background_image": "https://media.rawg.io/media/screenshots/fe8/fe8c5786c44d44ede1fb9fa58f9e6cac.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 248, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Coding Factory"], "genres": ["Action"], "publishers": [], "esrb_rating": null}