{"id": 490069, "slug": "coding-factoryitescia-master-gaming-smart-tech-1-2", "name": "Coding Factory/Itescia: Master Gaming & Smart Tech ] 2017 [ Fluid", "name_original": "Coding Factory/Itescia: Master Gaming & Smart Tech ] 2017 [ Fluid", "description": "<p>Ceci est la présentation d'un prototype de projet étudiant, dans le cadre de la formation \"Master Gaming &amp; Smart Tech\" de l'école Coding Factory (anciennement Itescia).</p>\n\n<p>Exploration de donjons combiné avec un combat tactique rythmé.</p>\n<p>Les 3 camarades du studio Kogiin annoncent la sortie de leur premier titre :\r\nFLUID !</p>\n<p>\r\n« Jusqu’où iriez-vous pour sauver votre famille ? »</p>\n<p>Cergy, France – Le 29 juin 2017 – FLUID, le premier titre du studio Kogiin propose une alliance subtile entre l’exploration labyrinthique d’un dungeon crawler et le dynamisme survolté de phases de combat en rythme.</p>\n\n<p>Dans FLUID, le joueur prend le contrôle de Saru, un jeune voleur qui doit s’infiltrer dans la tour Fluid Industries, immense complexe qui gère le dôme de protection qui se dresse entre l’hiver nucléaire et les survivants de l’Humanité pour sauver sa famille des griffes d’un terrible parrain de la mafia.</p>\n\n<p>Aidé d’un compagnon d’infortune, Saru devra progresser au travers des différents niveaux de la tour afin d’atteindre le bureau du gouverneur et obtenir des réponses à ses questions.\r\nFLUID promet au joueur des expériences inoubliables en affrontant les soldats du gouverneur dans des combats épiques, ou en observant leurs patrouilles afin de se faufiler dans leur dos. La maîtrise du Fluid et l’utilisation des différentes compétences de Saru pour personnaliser le style de combat du joueur lui permettra de venir à bout des adversaires qui lui barreront la route.</p>\n\n<p>L’expérience de jeu se compose en une alternance bien équilibrée d’exploration à travers 3 niveaux correspondant à 2 environnements de science-fiction, et des combats face à un ou plusieurs ennemis où un gameplay inédit basé sur le rythme donnera un challenge à la hauteur des plus hardcore des gamers.</p>\n<p>Ne soyez jamais trop sûr de vous. La précipitation pourrait vous mener à votre perte. La route est longue et les choses ne sont pas toujours ce qu’elles semblent être…</p>\n\n\n<p><strong>FLUID est développé par le studio Kogiin :</strong><br/></p>\n<p>Les auteurs du projet :</p>\n<p>Alexis Daniel\r\n<br/></p>\n<p>Michaël Hubert <br/></p>\n<p>Rémi Pauchet</p>", "metacritic": null, "released": "2020-09-05", "tba": false, "updated": "2020-09-07T05:32:39", "background_image": "https://media.rawg.io/media/screenshots/81c/81cf8a61cca8298a3e4004c52a27086e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 233, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Coding Factory"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}