{"id": 490135, "slug": "salvo-jas-x", "name": "SALVO (Jas X)", "name_original": "SALVO (Jas X)", "description": "Welcome, commander.\r\n<p>Set in the near future of 2065, <strong><em>SALVO </em></strong>is a real time tactics space combat sim. As the newly promoted commander of a combat vessel, you must lead your crew through operations in the outskirts of the solar system.<br/></p>\n\n\r\nWidespread use of high energy signal jamming and stellar phenomena have rendered most guided weaponry useless. Direct your own fire control and intercept hostile projectiles with the Mk1 eyeball.\r\n\r\n\r\nCounter your opponents by issuing tactical maneuvering orders in real time. Exploit blind spots and weak points, or simply evade incoming attacks.\r\n\r\n\r\nAnalyse and adapt to different opponents. Talk, navigate or fight your way through encounters, but beware; retreat isn’t always an option, and mistakes can cost you dearly.\r\n\r\n\r\nFrom performance optimizations to design, this game is intended to be enjoyed on a mobile device first. Expect intuitive features such as gestures and sensor input, as well as compatibility across a wide range of hardware.\r\n\r\n\r\nEARY ACCESS\r\nThis game is curently in the early stages of active development. The playable demo does not represent the final product\r\n\r\n\r\nIN THIS DEMO\r\n<p>Choose and play through a simple combat scenario as the commander of the ISV Proxima.</p>\r\nIssuing Orders\r\n\n<p>In <strong>AIM</strong> mode, tap anywhere on the screen to fire your currently selected weapon. A skilled commander may also intercept enemy projectiles with their own...</p>\n<p>In <strong>MOVE</strong> mode, tap anywhere on the screen to issue a move order for your ship</p>\r\nMode Switching &amp; Weapon Selection\r\n\n<p>Switch between <strong>AIM</strong> and <strong>MOVE</strong> mode by using the toggle on the bottom left of the screen.</p>\n<p>Select a different weapon by tapping on the weapon panel and choosing from the open list. Different weapons have different ammo limit and magazine size.<br/></p>\r\nTarget  Switching\r\n\n<p>When using the <strong>GESTURE</strong> method, simply swipe left or right to switch between targets. If using the <strong>UI</strong> method, tap on the arrow buttons on either side of the target reticule. The method option can be changed from the pause menu.</p>\r\nRetreating\r\n\n<p>In a scenario which allows retreating, survive until the timer counts down to 0 then tap the <strong>ESCAPE </strong>button to complete the encounter.</p>\r\nSecondary Weapons\r\n\n<p>Most combat vessels are equipped with point defence batteries (PDB) to defend against incoming projectiles. A brave commander may choose to use them offensively...</p>\r\nObstacles &amp; Items\r\n\n<p>Occasionally, various floating obstacles and items mayappear in the area. Avoid colliding with obstacles, pick up useful items by moving close to them.<br/></p>\n\n\r\nCREDITS\r\n\n\n<p>@JasX_RGP (Creator &amp; Developer, Rice Golem <em>Productions</em>)</p>\n<p>\r\n@ManekiMushi (Character Artist, Writer)</p>\r\n\r\nA MESSAGE FROM THE CREATOR\r\n<p>\"Thank you for playing the demo of<strong><em> SALVO</em></strong>! Your feedback is important to us. Expect to see regular updates and continuous improvements to the game.</p>\n<p>Please enjoy!\"</p>\n<p><em>- Jas X, Rice Golem Productions</em></p>", "metacritic": null, "released": "2020-09-04", "tba": false, "updated": "2020-09-07T05:48:11", "background_image": "https://media.rawg.io/media/screenshots/52b/52be2622d9d6bac7b42045f8cc1a5cb2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 189, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Android"], "developers": ["Jas X"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}