{"id": 490107, "slug": "diaregnum-chrono-hunter", "name": "DIAREGNUM: Chrono Hunter", "name_original": "DIAREGNUM: Chrono Hunter", "description": "<p>Time is of the essence. DIAREGNUM: Chrono Hunter is a thrilling action rogue-lite with slight RPG and bullet hell elements, featuring a cybernetic bounty hunter with the ability to halt the flow of time itself. Try, die, repeat, it's imperative.</p>\n<p>F E A T U R E S</p>\n<p>• <strong>Chrono a.k.a Time Stop. </strong>Stop everything, literally everything, from projectiles, explosions to the enemies themselves, while you plan your next move or catch your breath, or to create an eye-catching laser showcase, the sky's the limits.</p>\n<p>• <strong>Multiple classes. </strong>There are six different classes in the game for you to choose, and you can even bring two at the same time per run. Each has a distinct appearance and gameplay style to enhance replayability.</p>\n<p>• <strong>Upgrades. </strong>Say you want to turn your lousy shotgun into something like an AA-12, or a sniper rifle into... an even stronger sniper rifle? That's an option. (as long as you have the shekels required)</p>\n<p>• <strong>Streamlined and robust controls.</strong></p>\n<p>• <strong>Refined difficulty scaling. </strong>The game's difficulty will increases accordingly and adaptively depending on how you perform.</p>\n<p>• <strong>A brand-new world generation engine. </strong>Every level is randomized and looks more like a series of rooms and corridors instead of a labyrinth of hell-brick.</p>\n<p>• <strong>Challenges. </strong>In case you want to spice up your gameplay experience. Say that you want to play with only one health at all times, or you want weapon overheat killing you? They're all in your hands.</p>\n<p>• <strong>Screenshake. </strong>Yup, it's back.</p>\n<p>• <strong>Original soundtrack.</strong></p>\n<p>C O N T R O L S</p>\n<p>It's explained in the tutorial. Yes, there is one.</p>\n<p>Disclaimer: This game is a work-in-progress. More content will be ready in the future.</p>\n<p>C R E D I T S</p>\n<p><strong>Concept</strong>: Hellzy </p><p><strong>Programming, GFX</strong>: Hellzy </p><p><strong>Sprites: </strong>Hellzy, additional help by Dingo </p><p><strong>SFX: </strong>Shihotori, Hellzy\r\n<strong>Soundtrack</strong>: Shihotori, Obskoflos </p><p><strong>Inspirations: </strong>Nuclear Throne, Enter the Gungeon, SYNTHETIK </p><p>Made using <strong>Clickteam Fusion 2.5.</strong></p>\n<p>S E L L O U T</p>\n<p>https://www.youtube.com/channel/UCRKwoxzlzlUtlt2paRBwU7A</p>\n<p>https://overheaven.bandcamp.com/</p>\n<p>https://twitter.com/RealOverHeaven</p>", "metacritic": null, "released": "2020-09-05", "tba": false, "updated": "2020-09-07T05:41:14", "background_image": "https://media.rawg.io/media/screenshots/f31/f3162db0614afb2310bcb8a8e92e54ad.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 104, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["hellzyOH"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}