{"id": 49017, "slug": "hide-or-die", "name": "Hide Or Die", "name_original": "Hide Or Die", "description": "<h3>GENERAL</h3><br/>Hide or Die is a large scale multiplayer horror game set in a world corrupt with darkness. Dozens of players take the role as survivors, hiding out in remote bunkers, clinging to their last bits of resources. They must gear up, locate abandoned extractors, re-activate them and escape before the darkness fully consumes them. As the game progresses the darkness will corrupt even the strongest survivors, turning them into powerful and terrifying killers whose goal is only to kill those who remain. When the Darkness overtakes the world, the players with the most darkness are deemed The Chosen and are given the role to guard one of three bunkers which become the only possible escapes for the remaining players. This intense last-minute rush to escape is where The Chosen partake in a killing-spree in this brutal end-game with a fortune in rewards for doing so.<h3>KEY FEATURES</h3><br/><strong>Large Scale</strong><br/>Bale County is a 1.2km² world that was once a calm and beautiful place until the darkness corrupted it. You will explore the aftermath and see how the people have coped. Some joined cults and praised the darkness while others went insane trying to unlock the reason why it happened. The only survivors are those whom found safe haven in the bunkers. There are many unique areas to explore such as the crash site of Flight 36A-15, Hawksbill Mountain, and The Ritual Site. These areas, among others, will help tell the story of what happened to Bale County.<br/><br/><strong>Unmatched Terror</strong><br/>Hide or Die is built from the ground up to be terrifying and is a game where living is tough and death is permanent, you will be placed in a situation where you never feel comfortable in the world around you. Psychological events put the player on edge while the many hunters and enemies make direct interactions extremely tense. One mistake is all it takes to meet your end in this unforgiving world.<br/><br/><strong>Flexible Sandbox Gameplay</strong><br/>Bale County is an unpredictable sandbox world where players will be forced to adapt and where your decisions in-game are not pre-determined. How you decide to play, handle pressure, and pursue victory is entirely up to you. From playing sneaky and utilizing countless hiding spots, to fighting a hunter head-on with any assault item you can find, to even becoming a hunter yourself to join in on the bloodthirsty chase for the next victim.<br/><br/><strong>Collecting Darkness</strong><br/>Collecting Darkness can be done in numerous ways, providing choices in your gameplay that suits you best. Ranging from finding extractors and performing puzzle-esque tasks to gain rewards to becoming a hunter and chasing down survivors, killing them, and reaping their dropped darkness. You decide how you want to handle yourself in this large-scale experience. As a players darkness increases they will become a bigger target to any hunter in the server, putting the player in very challenging situations and creating even more altercations as they climb the in-game leaderboard.<br/><br/><strong>Looting</strong><br/>While on the search through Bale County, loot can be found in every explorable area. Ranging from defensive items, to powerful firearms, and even military experiments can be found and used for defense in this deadly world. Other items, such as Darkness and Credits, can be used to upgrade your character perks and unlock an vast assortment of cosmetics.<br/><br/><strong>Meaningful Progression</strong><br/>Collecting Darkness isn’t for nothing; using collected Darkness players can upgrade their characters with perks granting entirely new sets of abilities to their hunters and survivors. With three perk slots per character you'll find yourself putting together perk builds that drastically alter your gameplay and how you avoid death and deal it. <br/><br/><strong>Numerous Hunters</strong><br/>With 3 hunters at release and 4 hunters in production for addition in 2019, each character offers a unique and different experience to suit anyone’s playstyle. Ranging from long ranged hunters to extra-dimensional terrors, survivors will need to stay on their toes if they don’t want to meet their certain death.<br/><br/><strong>Teamwork Or Deception</strong><br/>Teamwork can be an essential way to combat hunters head-on by joining forces with fellow survivors and gearing up. However, with anyone being able to become a hunter, you never know if your teammates are trustworthy or if one of them is just waiting for the perfect opportunity to strike.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-23T12:12:12", "background_image": "https://media.rawg.io/media/screenshots/7b6/7b6750f009deb6cdb0c2162a3ef377a3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 14, "toplay": 1, "dropped": 2}, "playtime": 5, "achievements_count": 12, "ratings_count": 2, "suggestions_count": 151, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["BVG Studios"], "genres": ["Action", "Casual"], "publishers": ["BVG Studios"], "esrb_rating": null}