{"id": 49025, "slug": "mia", "name": "M.I.A", "name_original": "M.I.A", "description": "*About This Game*<br/>\n<br/>\r\n\"M.I.A\" = \"Mysterious Island Adventure\"<br/>\n<br/>\r\nIn the distant past, there was a high-tech civilization. That was destroyed for unknown reasons, left many ruins in the world.  One of your ancestors is a legendary treasure hunter, seeking the ruins of the ancient civilization. One time, he encountered a shipwreck and drift to a no-ones island. He found the ancient ruins and returned like a miracle. That is his first adventure, after that, he has created legends again and again.<br/>\n<br/>\r\nAll these stories were just your bedtime stories. Until a mysterious creature break into your life, it bring you into the memory of the treasure hunter, experience every adventure he takes, find the last truth…<br/>\n<br/>\r\nThis is a brand-new VR adventure game. Distinct from other puzzle games and room-escape games, “M.I.A” is a game includes adventure and puzzle, follow the story line, challenge every unique stage, find the secrets of the ancient civilization.<br/>\n<br/>\r\n*Features*<br/>\r\n● Experience the special game include adventure and puzzle. Go through the stages and defeat the final boss! <br/>\r\n● Shooting, Climbing, Move shadow in VR world, have unusual experience.<br/>\r\n● No death, no timer, more fun.<br/>\r\n● Enter the final stage if you can, the ultimate challenges awaits you…", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:04:08", "background_image": "https://media.rawg.io/media/screenshots/011/011b1a540ab926ac08b30ff5ce93c3e7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 19}, "playtime": 2, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 386, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["IBLACKHOLES"], "genres": ["Action", "Adventure"], "publishers": ["IBLACKHOLES"], "esrb_rating": null}