{"id": 490414, "slug": "scarfall-the-royale-combat", "name": "ScarFall - The Royale Combat", "name_original": "ScarFall - The Royale Combat", "description": "<p>Scarfall, the ultimate battle royale for your mobile. It is online shooting game with survival challenge. One of the best multiplayer game with strategic play.</p>\n<p>Experience the journey of real survival shooter on the battlefields. Explore the environments of the shooting battlegrounds with parachute landing from the high speed flying helicopters. Encounter the best strategy action multiplayer game to hit your play store this year. Build up your own rules for the online and offline multiplayer shooter. Survive in the shrinking safe zone with utmost 3 chances to win over the war and be the #1 survivor in unknown battlegrounds.</p>\n<p>Featuring team death match and solo death match which you can play online or offline with intense 4v4 squad mode. Play as lone soldier OR with clan to combat with rivals answering the call of duty. Scarfall offers TPS (Third Person Shooter) and FPS (First Person Shooter) play with modern vehicles to roam around quickly and reach the final destination in shrinking circle.</p>\n<ol>\n<li>GAMEPLAY WITH IMMENSE ACTION  </li>\n<li>Splendid 3D graphics with real life animations and environment.  </li>\n<li>Perfect aiming and shot system, giving you thrilling experience of the scarfall.  </li>\n<li>Exclusive gun fire sound with high quality audio, giving you intense feel of the action battleground.  </li>\n<li>Flexible support for low end devices with graphics and other quality settings of the combat.  </li>\n<li>\n<p>Play at your own convenience with customizable game play UI in online and offline mode of shooting games.</p>\n</li>\n<li>\n<p>HIGHLY LOADED WEAPONRY AND VAST ENVIRONMENTS</p>\n</li>\n<li>Load up guns from different modern weaponry category like machine guns, pistols, sniper rifles or shotguns to have a distinct experience in battleground survival games.  </li>\n<li>Play as multiplayer with your friends worldwide to enjoy the best battle royale combat.  </li>\n<li>New and amusing warfare environments of gun games in free battleground shooting game.  </li>\n<li>Modern armory with high range scopes like 2x, 4x and 8x to shoot opponents of the action games.  </li>\n<li>Challenge your friends directly by creating your private room and invite them to join the war of top shooting games.  </li>\n<li>Get loaded with 2 primary guns and 1 secondary gun to shoot your rivals at your best in intense combat.  </li>\n<li>Powerful explosives, melee weapons and medi-packs to accompany your journey of #1 survival in battleground games.  </li>\n<li>\n<p>Wide range clothing accessories to loot from map and design your own survival character.</p>\n</li>\n<li>\n<p>STAGGERING CLASSIC GAME MODE</p>\n</li>\n<li>Survival against shrinking zone, with utmost 3 chances to re-spawn in free FPS and TPS gun games with multiplayer combat.  </li>\n<li>Enjoy the survival game of the scarfall with thousands of items in the maps to loot and get equipped.  </li>\n<li>Open the majestic vaults via keys to receive huge rewards of survival battlefield games.  </li>\n<li>Hunt down your enemies with speed booster modern cars on the roads of scarfall.  </li>\n<li>Boost your gameplay with enemy detector, exp booster in top free war games.  </li>\n<li>\n<p>Play the daring 24 hour challenges and earn exciting rewards.</p>\n</li>\n<li>\n<p>TPS AND FPS ACTION SURVIVAL WAR</p>\n</li>\n<li>Scarfall gives you challenging war with dynamic and varied AI system in online and offline war games.  </li>\n<li>Win and claim exciting daily bonus and rewards to boost your performance of TPS war.  </li>\n<li>Upgrade faster and level up to unlock new powers, armory and rewards and land with flying colors on leader boards.  </li>\n<li>Build your strategy to fight in team death match or solo death match mode of FPS shooting battle royale.  </li>\n</ol>\n<p>Break the battle royale standards and dive into the modern warfare of unknown battlegrounds to be the last man standing in a way of ultimate hit man commando in this modern shooting game. So, grab your guns and bring your guts to survive the ultimate action survival shooter game, Scarfall - The royale combat.</p>\n<p>To give feedback write us on :<br />\nsupport@scarfall.net</p>\n<p>To stay updated, follow us on:<br />\nFacebook : http://facebook.com/scarfall<br />\nTwitch : https://www.twitch.tv/phoenixgames51<br />\nDiscord : https://discord.gg/GRvCj3X</p>", "metacritic": null, "released": "2019-09-01", "tba": false, "updated": "2023-03-06T13:21:14", "background_image": null, "website": "https://scarfall.net", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": [], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": "Mature"}