{"id": 490450, "slug": "dreamcatcher-2", "name": "DreamCatcher", "name_original": "DreamCatcher", "description": "The Dreamworld has been infected!  It is up to you to explore the Dreamworld as the DreamCatcher,  discover its secrets, and defeat the Nightmare. <br/><br/><ul><li>Single player, free, no ads game<br/></li><li>This is a Short Story adventure that typically takes between 1-2 hours to complete<br/></li><li>Parkour Platformer with precise and simple controls:  jump, air-dash, wall-slide, and invert-gravity. <br/></li><li>Fly through the air and overcome obstacles as you control gravity <br/></li><li>Instantaneous nearby respawning.  Makes dying fun!<br/></li><li>Supports a wide range of difficulty levels for all  (Easy to Nightmare Mode), and additional Assist Modes<br/></li><li>Frequent autosaving to load where you left off<br/></li><li>Best played with a controller.  Supports wide range of controllers (Xbox, PlayStation, Switch Pro), as well as keyboard/mouse. <strong> Controller strongly recommended. </strong></li></ul><br/>Note from C3B Games.   We love platformers, and wanted to share an adventure  of our own.  This game was inspired by some of our favorite modern platformers.<br/><br/>For any issues, please send email to support@c3bgames.com with the details. Thanks!<br/><br/><strong> Instructions </strong><br/><ul><li> You gain abilities as you progress through the story<br/></li><li> Pressing the same key/button as you use for Jump advances you through the Dialog<br/></li><li> Press the joystick/controls against a wall to slowly slide down the wall<br/></li><li> Dash allows you to reach additional heights when performed after you've Jumped into the air<br/></li><li> DashAttack and Gravity can <strong> only be performed once </strong> between touching the ground<br/></li><li> Dash is your attack when needed<br/></li><li> Adjust difficultly level or turn on Assist Mode options if you need help progressing through story  (<strong>in turning on Assist Mode some achievements may not be obtainable</strong>)</li></ul><br/><strong>Settings</strong><br/><ul><li> Momentum - This allows you to set the amount of momentum you have when stopping/turning.  A value of 0 allows you to stop/turn on a dime, higher values take more frames before stopping/turning. <br/></li><li> Volume - Set the volume for the game<br/></li><li> Difficulty - Supports 4 difficulty levels (Easy, Normal, Hard, Nightmare) which adjust the damage and speed of action during the game<br/></li><li> Touch Controls - Turns on/off the touch screen controls for the game<br/></li><li> Particles - Turns on/off the background particle effects.  If you are noticing lag (lower FPS) try turning particles off. <br/></li><li> <strong> Turning on any of the below Assist Modes can result in some achievements not being obtainable</strong><br/></li><li> Assist Mode Game Speed - Allows you to slow down or increase the overall speed of the game. Default value is 1<br/></li><li> Assist Mode Dash - Allows you to turn on Dash early as well as set it to infinite dashes (allows you to fly).  Infinite means you can press the Dash as many times as you want in the air. <br/></li><li> Assist Mode Gravity - Allows you to turn on Gravity controls early as well as set it to infinite gravity changes.  Infinite means you can press the Gravity control as many times as you want in the air. </li></ul>", "metacritic": null, "released": "2020-09-05", "tba": false, "updated": "2020-09-10T16:42:24", "background_image": "https://media.rawg.io/media/screenshots/c36/c3621b841156bbaf360f853bb3684ba0.jpg", "website": "https://www.c3bgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 22, "ratings_count": 0, "suggestions_count": 190, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["C3B Games"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["C3B Games"], "esrb_rating": null}