{"id": 490545, "slug": "8-bit-attack", "name": "8-Bit Attack", "name_original": "8-Bit Attack", "description": "<strong>8-Bit Attack:</strong> is a turn based tactics game where the player takes control of a hodgepodge of heroes from across multiple fantasy universes, and commands them as they defend the galaxy from evil. The evil lord Cthulhu and his minions of darkness threaten the destruction of all life as we know it, it is up to your strategy and wits to stop him. Battle through 4 types of levels before having to face the final boss himself, outfitting yourself with more gear and upgraded characters after each successful fight. Careful planning, coordinate attacks, and unique abilities are crucial in deciding whether your team emerges victorious, or falls victim to the invading monsters.<h3>How to Play:</h3>1) Determine Enemy Attacks: Choose which hero each enemy will be attacking for this combat sequence.<br/><br/>2) Determine Hero Attacks: Choose which heroes will attack which enemies. Will you gang up to take out the hardest hitting enemy, or target the enemy healer instead?<br/><br/>3) Use Hero Abilities: Heroes can use special abilities that greatly impact the battle. Some can attack an additional time, add critical strikes to their attacks, or heal allies!<br/><br/>4) Damage Phase: Heroes deal their attacks to enemies, and then enemies deal their attacks to heroes. This means you can target an enemy so he is killed before he is able to make a large attack!<br/><br/>5) Battle Again!: Enemies and players repeat the phases of combat again until all enemies or all heroes are dead.<br/><br/>6) Post Battle: Depending on the difficulty of the battle, medals are awarded to the player. The player can then spend these medals to upgrade their units with additional stats, healing potions, or more unique abilities!<br/><br/>7) After 4 rounds of fighting, the final boss appears... Lord Cthulhu. He is almost impossible to overcome, and will take an insane amount of planning and strategy to defeat. Think you are up for the task?<h3>Background:</h3> 8-Bit Attack was originally a boardgame created by Petersen Games that successfully launched on kickstarter to the tune of $40,000+ in funding. One of the stretch goals for the kickstarter was this video game, so here we are! This game follows the same rules, characters, and core gameplay, but modified to be more friendly to a PC audience. We hope you enjoy the wonderful battles, art, and design as much as we do.<br/>Visit https://petersengames.com/8bit/ for more details!", "metacritic": null, "released": "2020-07-15", "tba": false, "updated": "2020-09-10T17:39:35", "background_image": "https://media.rawg.io/media/screenshots/8af/8af4f681d0967f3f252f7e862c5a8ca2.jpg", "website": "https://www.startalegames.com/8bitattack", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 21, "ratings_count": 0, "suggestions_count": 249, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Startale Games", "Petersen Games"], "genres": ["RPG", "Strategy", "Indie"], "publishers": ["Startale Games"], "esrb_rating": null}