{"id": 49051, "slug": "wandering-in-space", "name": "Wandering in space", "name_original": "Wandering in space", "description": "《Wandering Space》 is a VR FPS single-player game that combines RPG and Roguelite elements. The story happened in 2598, the earth's environment worsening reached a tipping point, at the same time appear a \"doomsday virus infected either died or variations, of human resources of the federal government in the last the earth in the earth's orbit is established many scattered pieces of colonial satellite, spacecraft will survive partial migration to the space to human health from viruses and pollution, Others forced to stay on Earth struggle to survive disease and famine.<br/><br/><br/><br/><strong>Gameplay in VR</strong>: Played a memory loss of union soldiers, in a sealed space base in awakening and involved in a dispute over the army camp, the use of weapons and equipment within the base combat with the enemy, depend on the mysterious device installed in their armor and return to base on death came out of the fight and rebirth, if you break through time and time again, accumulated materials, upgrade equipment, Unlock new weapons, new skills, grow, and eventually defeat enemies only to find yourself facing bigger challenges...<br/><br/><br/><br/><strong>Rouge map level</strong> :  The ultimate goal of the player is to reach the top of the base. There will be 5 floors in the middle. Each floor has different enemies and challenges. Players need to fight continuously and survive to reach the top of the building. The map will change randomly;<br/><br/><strong>Random upgrade reward Buff in each round</strong>: There will be devices on each floor to enhance the player's combat ability. There will be three random options for the enhancement attributes according to the player's equipment type. Attribute enhancement accumulates powerful combat capabilities, and it is automatically cleared after returning to the base after death;<br/><br/><br/><br/><strong>Resource collect</strong>ion : Players can collect various materials scattered around on the way to battle, store them in their backpacks and bring them back to the base. The collected materials can be decomposed into various \"raw materials\" through the decomposition device of the base to manufacture and upgrade various equipment. ;<br/><br/><br/><br/><strong>Equipment upgrade manufacturing</strong> : Using the collected and decomposed \"raw materials\", players can upgrade the power, bullet capacity, attack speed, etc. of weapons, as well as the strength and defense value of armor to improve combat effectiveness;", "metacritic": null, "released": "2017-11-03", "tba": false, "updated": "2022-05-09T05:16:40", "background_image": "https://media.rawg.io/media/screenshots/1f8/1f833f411d98492c89320321caa10c29.jpg", "website": "https://ws.mengyuzhe.com/#/home", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 29, "dropped": 2}, "playtime": 1, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 291, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Evil Games", "Stream of consciousness VR"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Evil Games", "Stream of consciousness VR"], "esrb_rating": null}