{"id": 490576, "slug": "axegendepisode-i", "name": "Axegend：Episode I", "name_original": "Axegend：Episode I", "description": "ATTENTION!!! This is a demo version of Axegend VR. You can buy the Early Access version at<br/><br/>https://store.steampowered.com/app/1153460<br/><br/><br/>· <strong>Discord：</strong><br/>https://discord.gg/sF3Zc4C<br/>· <strong>Facebook：</strong><br/>https://www.facebook.com/Axegend-109962473874771/<br/>· <strong>Twitter：</strong><br/>https://twitter.com/SubversionSquad<br/>· <strong>Youtube：</strong><br/>https://www.youtube.com/channel/UChKcRIlpHWwrUS8OsV_QCsQ<br/>· <strong>Weibo      ：</strong><br/>https://weibo.com/u/5938731338<br/>· <strong>Email：</strong>441050785@qq.com<br/><br/><br/>Axegend：Episode I is a Rogue-lite action strategy game. The game is inspired by Orcs Must Die.You'll start the game as a rookie with nothing but an axe at hand.As you play on, you will gradually unlock a wide variety of weapons, items and master new battle skills. Through courage and wisdom, you'll become the battle-worn knight.After defeating a wave of enemies, you'll get the chance to select the loot you like. Your key to victory is the right combination of the suitable weapon, and the right buff and trap to fend off the hoards of enemies on the right location. In the face of bosses with different personalities, your wisdom and skill is extremely crucial.<br/>Gear up and venture into the dungeon. Take on the weapon on the waist and the traps on your back, and see what powerful combo will they lead to. Put your movement, observation, reflect and wisdom to good use. Now let the journey to save the princess begin.<br/><br/><br/><br/><br/>· Play as the knight, kill the orcs and save the princess<br/>· Unlock more weapons and items to add more flavor to the battle<br/>· Master profound battle skills in the endless supply of levels<br/>· Better yourself while searching for the truth of this world<br/><br/><br/><br/><br/><br/><br/>· Customize fighting style of your own<br/>· Rogue-like Mechanics<br/>· Heart-wrenching battle against epic Bosses<br/>· Imaginative bonus stages<br/>· Exceptional weapon control<br/>· Unrivaled item design<br/>· Load of eye-popping traps to choose from<br/>· Save the princess and solve the mystery of the world<br/><br/><br/><br/><br/><br/><br/><br/>There is a prosperous country that changes its name every 100 years...Strangely, some of its citizens would go missing every once in a while...<br/>In the Gemini month of year 327, the princess of the Kingdom of Sri... was captured by goblins!<br/>You are a noob knight with some skills up your sleeves...<br/>Your dream is to become a knight commander! And then idle away the rest of your life...<br/>This time, you are somehow assigned to save the princess from the enemy camp. This is a good chance to get promoted!<br/>But on your journey to save the princess, you find out a bigger conspiracy...<br/>Come to think about it: No one knows why something that doesn't belong in this world of axes and magic suddenly appears, like... the glowing rod!<br/><br/><br/>", "metacritic": null, "released": "2020-06-16", "tba": false, "updated": "2020-09-10T18:01:48", "background_image": "https://media.rawg.io/media/screenshots/973/973255ad9907b42834c03b5253f47cdb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 515, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Subversion Squad Studio"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Casual"], "publishers": ["Subversion Squad Studio"], "esrb_rating": null}