{"id": 490509, "slug": "canvas-hockey", "name": "Canvas Hockey", "name_original": "Canvas Hockey", "description": "<strong>Canvas Hockey </strong>is a top-down, arcade-style party game, whose character animations were made with drone footage of real hockey players. Team up with friends in <strong>local multiplayer for 1v1 or 2v2 battles</strong>, or set up custom <strong>Tournaments for up to 12 players</strong>. You can also start a single player <strong>Career</strong>, where you start at the bottom (Bronze league) and work your way up to the top (CHL elite). Manage your roster by trading your partner and goalie, or if your team is losing, trade yourself! Keep track of all of your stats and team history in this endless Career mode, as the A.I. progressively get faster and more skilled as you move up the leagues! Now, with the Co-Op career mode option, you can grab a friend and have them join you in your career mode games whenever you like.<br/><br/>Canvas Hockey will be supported by adding regular content updates and quality of life improvements. Please reach out with any problems or suggestions, they help to improve the game. Join the Discord Server to get involved with the community and play in tournaments via remote play! <br/>https://discord.gg/b5AN7H2<br/><br/>Canvas Hockey needs to support as many controllers as possible, so if you are using one that's not on the list, or if you are having trouble with a controller you want to use, shoot an email to brandon@synvoyity.com.<br/><br/>Controller Support:<br/>Switch Pro Controller: validated<br/>8BitDo Sn30Pro+: validated<br/>Joy Cons (L/R): validated, movement input is digital<br/>Xbox360/XboxOne: validated by beta testers<br/>PS3/PS4: validated by beta testers, reported issues with universal PS3 + dongle<br/>Steam Controller: validated by beta testers, reported issues with movement inputs", "metacritic": null, "released": "2020-08-05", "tba": false, "updated": "2020-09-10T17:19:30", "background_image": "https://media.rawg.io/media/screenshots/a08/a080415b58289989bc03b74b439855c2.jpg", "website": "https://synvoyity.com/canvashockey/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 203, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Brandon Alexander Holt"], "genres": ["Action", "Sports", "Casual"], "publishers": ["Synvoyity"], "esrb_rating": null}