{"id": 49057, "slug": "animal-super-squad", "name": "Animal Super Squad", "name_original": "Animal Super Squad", "description": "No matter who you are you might as well ask your mom for an advance allowance cause you’ll want to buy Animal Super Squad by the time you’ve finished reading this. <br/><br/><ul><li>Play as a chicken. Or a sloth. Or even a freaking blowfish<br/></li><li>Choose a ridiculous vehicle - like a toilet on wheels or like a flying propeller attached to your butt<br/></li><li>Get to the other side of the level to win, you know how this works, you’ve played games before I don’t need to explain this you’re on the internet, jeez<br/></li><li>Unlock stuff yourself instead of just getting it handed to you by the government, like a useful tinfoil hat or a dead octopus on your head<br/></li><li>Don’t cake your pants<br/></li><li>A custom level editor gives endless replayability by letting you make your own levels, and also play other people’s levels, you know how level editors work too, just </li><li>stop reading this and buy the damn game<br/></li><li>Very cool physics-based gameplay that is 100% accurate in any situation, I don’t really know how physics works though i wasn’t paying attention in school</li></ul><br/>Basically you’re far better off playing this game than whatever else you’re doing with your time and your mom’s money, which is probably buying economy glue in bulk. <br/><br/>But seriously, don’t eat anything with chemical solvents in it, it messes with your mind, <br/><br/>We’ve poured our hearts, souls and butts and money actually all our savings (yes our glue savings) into this game so we really hope you’ll enjoy it. Sometimes the work hours get long, but that’s no excuse to start eating glue seriously - that stuff will mess you up<br/><br/>you can play.. you choose your chicken, then you choose like a plane or a hover tank or whatever you want to ride, then you put on a goofy hat and you hit the gas buddy<br/><br/>then you try to get to the end of the level to unlock the next level and you also get maybe a new vehicle or at the least a new hat for your head to show your mom<br/><br/>ok that’s it that’s pretty much the whole game. im gonna go eat some gl", "metacritic": null, "released": "2017-11-02", "tba": false, "updated": "2023-11-16T11:36:47", "background_image": "https://media.rawg.io/media/screenshots/097/0978ea5ba04bf0545ab9c126da2878a6.jpg", "website": "http://doublemoose.com", "rating": 2.65, "rating_top": 3, "added_by_status": {"yet": 13, "owned": 231, "toplay": 3, "dropped": 9, "playing": 1}, "playtime": 3, "achievements_count": 68, "ratings_count": 17, "suggestions_count": 199, "game_series_count": 0, "reviews_count": 17, "platforms": ["PlayStation 4", "Nintendo Switch", "Xbox One", "Android", "PC", "iOS"], "developers": ["DoubleMoose"], "genres": ["Action", "Adventure", "Simulation", "Family", "Indie"], "publishers": ["DoubleMoose"], "esrb_rating": null}