{"id": 49069, "slug": "sword-legacy-omen", "name": "Sword Legacy Omen", "name_original": "Sword Legacy Omen", "description": "Welcome to Broken Britannia<br/><br/>\"Before Arthur’s Golden Age, our realm was lost, shattered and decadent; kingdoms torn apart by blind selfishness. A broken Britannia, void of hope.\"<br/><br/>The lord of Mercia has been assassinated, your love kidnapped and home is no more. As Uther, the disgraced Knight Commander, you must lead your misfit band of companions throughout quests riddled with trials. Forge uneasy alliances to acquire the mythical Excalibur sword and defeat the sinister power-obsessed duke of Wessex<br/><br/><br/>Combat in Sword Legacy: Omen is always a challenge. As a strategist, you will need to plan your course of action with four heroes at a time. However, be ready to adapt and improvise because combat results always change based on the chosen abilities and chances of landing an attack.KEY FEATURESTactical Combat: Learn the importance of strategic positioning and unleash powerful skill combos with your party.<br/>Free Exploration: When not in combat, investigate the environment, find treasures, solve riddles, and uncover secrets.<br/>Party Customization: Adapt characters to your play style, manage your team, and progress by unlocking over 70 unique skills.<br/>Hordes of Enemies and Unique Bosses: Fight a variety of vicious mobs and face powerful monsters in grueling battles.<br/>Stress System: Use all your might to become victorious, but deplete your willpower and witness your heroes fall prey to panic.<br/>Old-School Art Style With a Dark Twist: Relive the beautiful aesthetic of classic animations fused with the visuals of obscure and gothic comics.<br/>A Different Take on a Classic Myth: Experience the Arthurian legends as never before, as famous characters and locations are revamped in a mature storyline of vengeance, honor, conspiracy and alchemy.<br/>Interactive Environment: Study your surroundings and make deadly moves by blowing up explosive barrels and pushing enemies off edges.<br/>", "metacritic": null, "released": "2018-08-12", "tba": false, "updated": "2023-05-02T21:40:47", "background_image": "https://media.rawg.io/media/screenshots/ff9/ff95a4e23cc4bbb2f7ea9917647fdc93.jpg", "website": "http://www.swordlegacy.com/", "rating": 2.41, "rating_top": 1, "added_by_status": {"yet": 89, "owned": 1005, "beaten": 4, "toplay": 4, "dropped": 7}, "playtime": 4, "achievements_count": 12, "ratings_count": 26, "suggestions_count": 467, "game_series_count": 0, "reviews_count": 27, "platforms": ["PC"], "developers": ["Firecast Studio", "Fableware", "Fableware Narrative Design"], "genres": ["Action", "Adventure", "RPG", "Strategy"], "publishers": ["Team17 Digital"], "esrb_rating": null}