{"id": 490618, "slug": "into-the-flames-2", "name": "Into The Flames", "name_original": "Into The Flames", "description": "Welcome to the world of Into The Flames! An action packed open world firefighting game that can be played alone or with up to 6 players online. Into the Flames brings all the excitement of being a firefighter, from responding to calls driving a multitude of emergency vehicles to putting out a room engulfed in flames. There are a variety of calls to respond to including house fires, dangerous gas alarms, and hazmat incidents. Fire spreads dynamically which leads to emergencies being different each time they are played. <br/>\n<br/>\r\nUsing tools of the trade you will be able to conquer any obstacle in your way. Use Axes to bust down doors, Ladders to climb to the roof, Fans to blow the smoke out of structures, no matter the goal there are plenty of tools to get you there. Uncertain environment? Use the Hazmat suit to reach your objective, just don't forget to decontaminate in the decon tent afterwards!<br/>\n<br/>\r\nInto The Flames is currently in Pre-alpha which means it is constantly being updated with new content, and patches to polish the current game. I develop alongside the community, I listen to feedback, and suggestions daily. This is an experience you won't want to miss out on!<br/>\n<br/>\n<br/>\r\nLink to official Discord : https://discord.gg/2btzKdm", "metacritic": null, "released": "2020-05-27", "tba": false, "updated": "2020-09-10T18:25:57", "background_image": "https://media.rawg.io/media/screenshots/b2c/b2c15f46e41ec56c90e9b33430e1c474.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 22, "toplay": 1}, "playtime": 1, "achievements_count": 23, "ratings_count": 0, "suggestions_count": 235, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Fully Involved Game Studios"], "genres": ["Action", "Simulation", "Casual", "Indie"], "publishers": ["Fully Involved Game Studios"], "esrb_rating": null}