{"id": 490660, "slug": "summer-in-mara-prologue", "name": "Summer in Mara Prologue", "name_original": "Summer in Mara Prologue", "description": "'Summer in Mara - Prologue' is just the beginning of a great adventure.  Discover the life of Koa, a young girl living on her own island with her grandmother, Yaya Haku. You will have to harvest your crops, fish on your pond, chop down trees, and pay close attention to all the tasks that Yaya Hakui will give you. Enjoy the opening act of this tropical adventure in a colorful island and play this story at your own pace.<br/><br/><br/><br/>‘Summer in Mara’ is a summer adventure with farming, crafting, and exploring mechanics set in a tropical archipelago.<br/><br/>‘Summer in Mara’ is a single-player experience in a calm, relaxing environment, with a handmade look and an exciting narrative. You will be Koa, a little adventurer girl who wants to explore the world that surrounds her.<br/><br/>In ‘Summer in Mara’ you’ll have to take care of your own island, harvest your crops, create new tools and buildings, and sail with your boat to discover new islands and secrets.<br/><br/><br/><br/>You’ll have your own island, but taking care of something like that is a lot of hard work. You’ll be able to plant trees to get wood, and craft new tools and buildings with different materials. Or you can create crop fields to grow all kinds of vegetables. You’ll also have a farm with chickens and pigs to take care of. <br/><br/>But be careful, because this isn’t as easy as it looks! You’ll also be able to fish in a pond or in open sea, cut trees with your hatchet, build things with your hammer, and use a hoe to help you harvest your island.<br/><br/><br/><br/>", "metacritic": null, "released": "2020-05-29", "tba": false, "updated": "2020-09-10T18:52:33", "background_image": "https://media.rawg.io/media/screenshots/e65/e6548bd12aeba7be95c569f56f8ad435.jpg", "website": "http://summermara.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "beaten": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 250, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Chibig"], "genres": ["Adventure", "Casual"], "publishers": ["Chibig"], "esrb_rating": null}