{"id": 490649, "slug": "captain-disaster-in-death-has-a-million-stomping-3", "name": "Captain Disaster in: Death Has A Million Stomping Boots", "name_original": "Captain Disaster in: Death Has A Million Stomping Boots", "description": "Captain Disaster takes a job delivering a package from Acturus-1 to Proboscis Major - not realising that he is actually transporting something that will put the entire galaxy in danger!  Though just getting the package in the first place is quite a challenge in itself...<br/><br/>Our intrepid nitwit investigates interesting peculiar people, puzzling places and panicky problems along the way to saving the day, once he finally realises that something is wrong.  Expect lots of laughs and head-scratching dilemmas before you reach the shocking conclusion and find out what all this \"Million Stomping Boots\" business is actually about!<br/><br/><strong>Game Details:</strong>- Classic point-and-click adventure gaming action with a few new twists<br/>- Retro 320x200 resolution graphics<br/>- Fully voiced <br/>- Epic music score <br/>- Plenty of puzzles <br/>- Plenty of adventure<br/>- Plenty of comedy<br/><br/>This game has been a labour of love by 2 devs (CaptainD and TheBitPriest) - who should know better, but just can't help loving the genre - with help from multiple other people over time.   We were inspired by the classic adventure games produced by Lucasfilm Games and Sierra, and believe we have created something that will hopefully, like those games, stand the test of time.<br/><br/><br/>\"Death Has A Million Stomping Boots\" is a love letter to the classic adventure games we loved in the 90s - CaptainD inspired mostly by the masterpieces published by LucasFilm Games, TheBitPriest owing more of his point &amp; click memories to Sierra's titles.  Combining these elements into one game with a few modern game design features thrown in, the co-devs has sought to create something that looks and feels just like it could have been a game made in the 90s but never released at the time (though we promise you this was not in fact the case!).<br/><br/>In Stomping Boots you play the role of the eponymous Captain Disaster as he struggles to save the galaxy, having inadvertently nearly caused its destruction.  It features a 2-click interface (left-click Interact, right-click Look), with the game divided into 3 Acts, set on two different planets and a space ship.  There are a variety of people - aliens - well, aliens are people I guess - to talk to, many inventory objects to use, misuse and possibly combine, and of course a mountain of different types of puzzles to solve.   <br/><br/>If you like comedy sci-fi, pointing, clicking and puzzle solving, this is the game for you!", "metacritic": null, "released": "2020-05-28", "tba": false, "updated": "2020-09-10T18:43:43", "background_image": "https://media.rawg.io/media/screenshots/546/5466b9874c284d603de89a92ac863c47.jpg", "website": "http://www.captaindisasterthecomputergame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 288, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dave Seaman", "R Riebau"], "genres": ["Adventure"], "publishers": ["Team Disaster"], "esrb_rating": null}