{"id": 490697, "slug": "sakura-knight-2", "name": "Sakura Knight 2", "name_original": "Sakura Knight 2", "description": "Taking place after the events of Sakura Knight, Estelle continues her quest to become a famous knight like her mother, Cressida.<br/><br/>With her mother's sword retrieved and a party of pretty and capable women to support her, our plucky young heroine tries to make a name for herself in Grimoire, Lemuria's biggest city. Together with the ditzy elf Felicia, the mischievous catgirl Tart, and the affectionate wolfgirl Rune, Estelle takes on quests at Grimoire's guild, fights off hordes of wicked plant and slime monsters, and hones her swordplay.<br/><br/>Though her journey got off to a rocky start, things are finally starting to look up for Estelle. Perhaps she'll be able to accomplish her dreams after all!<br/><br/>...It would be a lot easier, though, if Rune and Tart would stop arguing every five seconds.<br/>The catgirl and the wolfgirl are constantly at one another's throats, and Estelle and Felicia are unable to placate them, no matter what they do!<br/><br/>Then, there's the unusual abundance of monsters in the forest to deal with, not to mention the appearance of a mysterious woman who seems oddly antagonistic towards Estelle.<br/><br/>Will Rune and Tart's relationship ever be repaired? What is this strange woman's identity? Will Estelle ever be able to become a real knight...<br/><br/>And which of her party members will Estelle pledge her heart to?!<br/><br/><br/><br/><br/><br/><br/><br/>", "metacritic": null, "released": "2020-06-01", "tba": false, "updated": "2020-09-10T19:16:06", "background_image": "https://media.rawg.io/media/screenshots/9e8/9e8ad4148ba12b6bf51dfebdb5b5df4d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 6, "owned": 93, "toplay": 3}, "playtime": 2, "achievements_count": 10, "ratings_count": 2, "suggestions_count": 434, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Winged Cloud"], "genres": ["Simulation"], "publishers": ["Winged Cloud"], "esrb_rating": null}