{"id": 490755, "slug": "chimeras-cherished-serpent-collectors-edition", "name": "Chimeras: Cherished Serpent Collector's Edition", "name_original": "Chimeras: Cherished Serpent Collector's Edition", "description": "<strong>Elephant Games</strong> brings you Chimeras: Cherished Serpent – an exciting new entry in the Chimeras series!<br/><br/>Eleven mysterious deaths have plagued Serpent Hill in one month, so it’s no wonder the citizens live in constant fear. In every case, the only witnesses are the victims themselves, so the new sheriff, Amber, has no leads. What’s more, people can’t shake the sense that someone is always watching them. Now it’s up to you to dig into the case and see what turns up. What a way to start a vacation! Can you help Amber finish what her dearly-departed brother started and find out what’s really going on in Serpent Hill? You’ll need your puzzle-solving skills and a sharp mind to find the truth in this hair-raising Hidden-Object Puzzle Adventure!<br/><br/>This is a special Collector's Edition release full of exclusive extras you won't find in the standard version. The Collector's Edition includes:<br/><br/>•\tInvestigate an engrossing new mystery of mythological proportions in the bonus game!<br/>•\tEarn a variety of unique achievements! <br/>•\tTons of collectibles, puzzle pieces, and morphing objects to find!<br/>•\tEnjoy replayable HOPs and mini-games, jigsaw puzzles, secret room, exclusive wallpapers, soundtrack, and concept art!<br/>•\tNever get lost with the strategy guide! <br/><br/><br/>This is a Hidden Object Puzzle Adventure game, meaning a specific genre of story-driven, point &amp; click adventures. Throughout the game, players are tasked to find a list of objects hidden within a particular scene, and to occasionally complete various mini-games/puzzles.", "metacritic": null, "released": "2020-06-05", "tba": false, "updated": "2020-09-10T19:48:19", "background_image": "https://media.rawg.io/media/screenshots/5f5/5f552afa4c98bc737a3c2d14debe3d49.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 6}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 612, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Elephant Games"], "genres": ["Adventure", "Casual"], "publishers": ["Big Fish Games"], "esrb_rating": null}