{"id": 490787, "slug": "martial-arts-brutality-premium", "name": "Martial Arts Brutality Premium", "name_original": "Martial Arts Brutality Premium", "description": "Premium version of Martial Art Brutality. Pay once, no in app purchases.<br/><br/>Enter the savage world of Martial Arts Brutality.<br/><br/>In this turn based tactical card fighter, you will learn the secrets of Kung Fu, master control of your formidable Chi Energy and perfect the legendary Dim Mak death touch.<br/><br/>Discover and collect technique cards, upgrade their awesome powers, and build ultimate fighting decks.<br/>Fight online with or against friends, mock and insult them using the unique taunt system.<br/>Inflict horrific injuries on you opponents and execute many different KO types as you battle your way to becoming a Dragon Grand Master.<br/>Is your inner warrior ready to meet the challenge? The brutal world of the Martial Arts awaits...<br/><br/>Features<br/><ul><li>A unique blend of tactical card play and real time attacking and defensive mechanics<br/></li><li>Detailed human body model allows for horrific injuries and numerous brutal KO types.<br/></li><li>Watch the vicious action unfold with a full fight replay system<br/></li><li>Discover and collect martial arts cards, including Chi strikes and forbidden Dim Mak techniques.<br/></li><li>Master a number of styles, including Shaolin Kung Fu, Wing Chun, Shotokan Karate and Taekwondo<br/></li><li>Insane 8 player brawls. ‘Every man for himself’ and team fights.<br/></li><li>Battle against friends and taunt them along the way!</li></ul>", "metacritic": null, "released": "2020-06-09", "tba": false, "updated": "2020-09-10T20:10:25", "background_image": "https://media.rawg.io/media/screenshots/dff/dff892b0fc0656a96e2fdde4d6139707.jpg", "website": "http://www.coldbeamgames.com/martial-arts-brutality.html", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 0, "achievements_count": 48, "ratings_count": 0, "suggestions_count": 236, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Cold Beam Games"], "genres": ["Action", "Strategy", "Indie"], "publishers": ["Cold Beam Games"], "esrb_rating": null}