{"id": 490744, "slug": "the-ninth-way", "name": "The Ninth Way", "name_original": "The Ninth Way", "description": "You wake up in your cell. Your name, Cyr, is the only memory you have left. Why are you alone? What happened to you?<br/>\r\nThe Ninth Way is an action game with an eye on tactics which will accompany you on a journey of magic, intrigue and mystery.<br/>\r\nThe game revolves around 9 basic elements (at first you will recognize fire, water, air and earth). With a cel-shading graphic filter, it's a lightweight low-poly product. <br/>\r\nThe player's creativity is the central element of the gameplay: you will be able to combine the elements at your disposal to create new powerful spells and conjurations in your fight against both neutral and elemental enemies.<br/>\r\nWill you be able to recover Cyr's memories? What is happening to the inhabitants of the fire continent?<br/>\r\nMost of all, why are we all confined inside a Magic Academy?<br/>\n<br/>\r\nThe game is still in development and is in \"coming soon\" mode because we would like to involve players and lovers of the genre in the development phase of single player mechanics, in order to launch the p2p mode as soon as possible.<br/>\r\nWe therefore hope to see you active in the forum together with our team.<br/>\n<br/>\r\nFor the Demo version, you can play with only 2 elements and its interactable.", "metacritic": null, "released": "2020-06-05", "tba": false, "updated": "2020-09-10T19:42:11", "background_image": "https://media.rawg.io/media/screenshots/3ea/3eaf74f1b5ed327d706be7f0a92826ff.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 298, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["PixelsDesign VR Developers", "Luca Tocco", "Matteo Contu"], "genres": ["Action", "Adventure", "Strategy", "Indie"], "publishers": ["PixelsDesign VR Developers"], "esrb_rating": null}