{"id": 490734, "slug": "narvas", "name": "Narvas", "name_original": "Narvas", "description": "The story of Mace, a young scavenger recently promoted to the Resource Collection Department for the Narvas Colonies.  He is ordered to infiltrate and discover resources on distant planets in search of materials to ensure the survival of his people.  Supplies are hemorrhaging, scarce, and unaccounted for.  Times are bleak for Narvas.<br/><br/>The scavenger feels the weight of an entire population on his shoulders as he embarks on increasingly more dangerous and deadlier missions.  It is up to Mace and his mechanical companion Toby to discover the source behind the recent shortages and save an entire colony from extinction.<br/><br/>Take control of Mace in this local co-op side scrolling platform shooter as you go from assignment to assignment taking on enemy bots and dangerous bosses on different planets.<br/><br/>Features:<br/>-Sprint, dodge, wall climb, and teleport through platforming situations.<br/>-Take control of your personal bot, Toby, to help navigate through levels or use him to unleash a devastating attack.<br/>-Collect gun mods and ability buffs that drop randomly to help you through your assignment.<br/>-Track your fastest times for each level and compare your time to the best of Steam's Community.<br/>-Single player or Local Co-op through any level.<br/>-Replay any mission at any time in order to get the perfect run and fastest time.<br/>-Build momentum from successful missions to increase your effectiveness for future levels.<br/><br/><br/>Join the discord! https://discord.gg/j9qH4Eg", "metacritic": null, "released": "2020-06-04", "tba": false, "updated": "2023-12-18T17:39:15", "background_image": "https://media.rawg.io/media/screenshots/731/731038c2e3a1e5997e0d6e2f4ab7bea2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 19, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 87, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Stranga", "Tommah"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["GrabTheGames"], "esrb_rating": null}