{"id": 490708, "slug": "flain-tao-force-cubes", "name": "Flain - Tao force & Cubes", "name_original": "Flain - Tao force & Cubes", "description": "<h3>Story</h3>  In 2048, Moogi star sued Earth for emojis violating Moogi's right to portrait. The Supreme Court of the Galaxy ruled that Earth lost the case, Earth must hand over emojis and compensation. Moogi, who have mastered the power of Tao force, come to Earth, Earth unable to resist. Moogi's great starship, full of emojis and compensation packed in cubes, was hit by super space junk. Moogi and Earth began a joint rescue - to rescue the cubes! Use Tao force!!<h3>How to Play</h3>  Select emoji category(big square button) to start a random game. A spaceship will be launched into the sapce with floating cubes.<br/>  Pair and collect the floating cubes using Tao force.  Collected cube pairs provide a bit of energy for longer game time. Golden cubes provide more energy. Tao force, force shield( when cubes colliding with screen) and spaceship(screen) moving all consume energy. Game ends when energy exhausts.<br/>  Each time cubes are collected, energy will be consumed a bit faster, the spaceship will move faster, the amount of different emojis will be bigger.<h3>Item Description</h3><h3>Tao Force Wave</h3>  When the spinning and shining wave emoji is pressed, a Tao force wave is emitted. All the cubes on screen will be affected the its power. Tao force waves can be got by collecting double golden cubes in random game or as random bonus of highscore.<h3>Spaceship</h3>  A spaceship will be consumed to start a random game. When spaceship is run out, only replay game can be started by pressing the highscore number or the \"key&amp;lock\" emoji. Spaceships can be exchanged from Tao force waves. The replay game start with the previous random seed(represented by the \"key\" emoji), so that players could get higher score by remembering the sequence of cubes. In replay game, collecting double golden cubes won't produce Tao force wave.<h3>Energy</h3>  The moon emoji represents the amount of energy.  The moon provides 100 base energy each time the game start.<h3>Star</h3>  A star provides 10 extra energy each time the game start. A star can be got for every integral multiple of 1000 of highscore. A star can be got if all the emojis in a category are collected. A star can be got if a valid share key is input.<h3>Meteor</h3>  A meteor will disappear after 7 days. Befor disappearing it's counted as a star. 20 waves can be exchagned to a metor.", "metacritic": null, "released": "2020-06-02", "tba": false, "updated": "2020-09-10T19:21:19", "background_image": "https://media.rawg.io/media/screenshots/070/07055d72f52965d76918e61de5a99845.jpg", "website": "https://www.flain.io", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 93, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["zyfun"], "genres": ["Casual"], "publishers": ["zyfun"], "esrb_rating": null}