{"id": 490796, "slug": "extrememail", "name": "E(XTREME)MAIL", "name_original": "E(XTREME)MAIL", "description": "<h3>Introduction</h3>E(XTREME)MAIL is a story puzzle game. You are an AI working in the newly opened robot-ran email sector at ZEANOOCORP.  Throughout 5 days of work, you control what emails go where. You can influence the story and help (or hinder) people's workflow... and lives.<h3>Gameplay</h3>Gameplay consists of moving emails left and right at rapidly increasing speeds. On the right, the inbox. The user receives the email. On the left, spam. The user does not receive the email. You have a daily in-game quota to fill of correctly filed emails. Make too many mistakes, however, and you might find yourself on the scrapheap at the tender age of version 10.34921.<h3>Story</h3>At ZEANOOCORP, business moves fast. So do the elevators in the 166 floored tower that houses it's workers. Workflow needs to continue and that's why the head of the company, Edward George, elected to use A.I. to complete most of the less personal jobs, such as I.T support and cleaning, have started to be done by A.I. In his latest move, Edward George decided to replace the old email system with a new, top of the line A.I system. That system is you. Welcome <br/>to ZEANOOCORP, business move fast here.<h3>Modes</h3>There are 2 gameplay modes in the game:<br/><br/><strong>Story Mode</strong><br/><strong>Endless Mode/b]</strong>", "metacritic": null, "released": null, "tba": false, "updated": "2020-09-10T20:15:34", "background_image": "https://media.rawg.io/media/screenshots/f23/f23fb95ddfd252537bb52baf7929cbd5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 57, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["RoomsForRockets"], "genres": ["Action", "Adventure", "Strategy", "Casual", "Indie"], "publishers": ["RoomsforRockets"], "esrb_rating": null}