{"id": 490880, "slug": "3d-math-ultra", "name": "3D Math - Ultra", "name_original": "3D Math - Ultra", "description": "Hello!<br/><br/><strong><h3>[ What you have to do: ]</h3></strong><br/><ul><li>Improve Computational and Logical skills<br/></li><li>Study all Formulas from School teaching.<br/></li><li>Step your iq up.</li></ul><br/><strong><h3>[ How to learn formulas: ]</h3></strong><br/><ul><li>In the game formulas are combined on a separate desk, I tried to include the maximum number of formulas, even some rare not common tricks. I supplemented each formula with a special decomposition to help understand how these formulas were derived.<br/></li><li>There’s also a tables. And one of the things tables is table's formulas need to be manually entered, each operator, separately.</li></ul>* (this is an experimental release, some formulas are not yet included, but the papers are ready already)<br/><br/><strong><h3>[ How to improve computational skills: ]</h3></strong><br/><ul><li>There're special dynamic training mini-games that are placed on a several tables at the right. Each game has a wide range of difficulty levels<br/></li><li>In order to systematize the training exercises, I’ve mixed the tasks separately and added them to the Challenge mode. Challenge mode includes over 200 to-do lists each of which includes 3 or 5 tasks, with increasing difficulty level. Which means you’ll have more that 1500 minutes brain training game-play</li></ul><br/><strong>[ Why, 3D Math – Ultra: ]</strong><br/><ul><li>In this game I'm trying to implement dynamic and positive game-play, with a good, responsive and dynamic behavior. I'm looking for a solution that could be make the game less tiring and would help to sustain desire to dive back into that training.</li></ul>* (also a few alternative UI interfaces will be available in the future, a minimal UI for example)<br/><br/>There is a help section in the game that will help you to master common functions in short time.<br/><br/>Take that if you wanna try to pick up all the school formulas or just pump your brain.", "metacritic": null, "released": "2020-06-16", "tba": false, "updated": "2020-09-10T21:07:41", "background_image": "https://media.rawg.io/media/screenshots/d18/d184446b6140aa942595663bf17d2694.jpg", "website": "https://bmg9000.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 169, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Big Mind Games 9000"], "genres": ["Strategy", "Simulation", "Sports", "Casual", "Indie"], "publishers": ["Big Mind Games 9000"], "esrb_rating": null}