{"id": 490850, "slug": "hunting-moon-depression-succubus", "name": "Hunting Moon - Depression & Succubus", "name_original": "Hunting Moon - Depression & Succubus", "description": "<strong>Game introduction</strong><br/>This is a Galgame / visual novel, containing about 50,000 words of text, 5 independent cg (of which 4 are dynamic).<br/>Tells the story of a depressed man Yoru momiji and the succubus Lilith,single character single ending.<br/><br/><strong>Synopsis</strong><br/>Yoru momiji, a guy who feels extremely desperate with his life, past and future, and wants to end everything of his own.<br/>In front of him, who couldn't find the slightest fun in his life, a succubus named Lilith suddenly appeared, aiming at hunting spirit.<br/>However, as a special energy that humans only release when they are in a happy mood, Lilith cannot collect the essence from Yoru momiji at all.<br/>Faced with such a situation, Lilith, who felt that her dignity as a succubus was provoked, decisively challenged him to obtain the highest quality essence from him.<br/>A love comedy full of laughter and ecchi begins.<br/><br/>Disclaimer: All characters in this game are adults.<br/><br/>Note: Please install the free DLC experience for the complete CG and costumes, neither the body nor the DLC in the game has any adult elements or dew point scenes<br/>Due to the lack of producer skills, the game only supports running in Chinese and English system environments.", "metacritic": null, "released": "2020-06-15", "tba": false, "updated": "2020-09-10T20:44:12", "background_image": "https://media.rawg.io/media/screenshots/9d2/9d2f3707df0d56823d47d9812eb9b15a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 129, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["lamb of game"], "genres": ["Adventure", "RPG", "Casual", "Indie"], "publishers": ["lamb of game"], "esrb_rating": null}