{"id": 490870, "slug": "you-ling-gao-xiao-ghost-college", "name": "幽灵高校(Ghost College)", "name_original": "幽灵高校(Ghost College)", "description": "<h3>Plot of the game</h3>This game takes place in a university, where an ordinary college student is involved in a paranormal event, but is unable to escape from the event. In these paranormal events, you will reveal the hidden secrets of this university.<h3>Gameplay</h3>1. The game is designed with a 2D horizontal board, in which the player can move left and right and not up and down. Items in the game that have hints can be interacted with.<br/>The plot of the game will change depending on your level of exploration and the companions you meet.<h3>Form of game on sale</h3>The game will be free as a prologue chapter, and subsequent chapters will be charged as DLC. The game contains 6 chapters in total, the price will be adjusted according to the length of the chapters.<h3>Progress in the development of the game</h3>1. At present, the game has only completed a small part of the daytime, the night battle-related plot is still under development, I will collect feedback from players for the design of future games.<br/>2. subsequent releases will complete the access to Steam cloud storage and trophies<br/>3. The next game will be released in the form of weekly updates until the official version is released.<br/>4. I am currently developing the game alone, if you encounter any problems in the game, you are welcome to give feedback.<br/>Contact QQ Group：1077218323", "metacritic": null, "released": null, "tba": false, "updated": "2020-09-10T20:59:31", "background_image": "https://media.rawg.io/media/screenshots/e4c/e4c1d50f77dda02f5da21383abe18918.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 5, "ratings_count": 0, "suggestions_count": 140, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["血色双眸"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["血色双眸"], "esrb_rating": null}