{"id": 490800, "slug": "frag", "name": "Frag", "name_original": "Frag", "description": "Frag is a roguelike gridless turn-based game of tactical combat. Kill the enemy. Grab the loot. Craft new gear. Level up your team. Learn new skills. If you lose a single match, you are done. How long can you survive?<h3>Gridless turn-based tactical combat</h3><br/>Frag tries to capture the experience of miniature wargaming. Use distances and templates to measure range and movement. Units activate one at a time, in an order determined by their statistics. Attacks hit or miss based on a percent roll, that is influenced by a unit’s stats, weapons and skills.<h3>Intuitive cover system</h3><br/>Cover is your friend. Cover keeps you alive. If you are in cover, enemies cannot shoot you. This does not prevent you from shooting them, though. Watch your units pop out of cover, attack their target, then pop back in.<h3>Specialized skills and gear</h3><br/>Winning a match requires much more than just shooting. Defend your position deploying automated turrets, shield your teammates with energy barriers, buff your units or hack into enemy droids.<h3>Customize your team</h3><br/>Between each match, your team can gain new gear and skills. Each unit can choose a different class, each one with its skill progression. Find the right combination of classes and skills, synergies and combos to multiply your team’s strength and cancel out each individual unit’s weaknesses.", "metacritic": null, "released": "2020-06-10", "tba": false, "updated": "2020-09-10T20:17:34", "background_image": "https://media.rawg.io/media/screenshots/220/220c38e7a5262aacbc13407a769f2bfd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 310, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Zule"], "genres": ["Strategy", "Indie"], "publishers": ["Zule"], "esrb_rating": null}