{"id": 490980, "slug": "troll-patrol", "name": "Troll Patrol", "name_original": "Troll Patrol", "description": "<strong>\"Troll Patrol\"</strong> is a puzzle game which combines the tile-matching and RPG genres by offering a unique experience: Play as the last defender of the threatened troll den where vicious village people and heroes from far away castles and kingdoms knock down your door.<br/><br/>Stand firm, take whatever weapon is close and fight them off to get your family and friends to safety. Protect what is rightfully yours, your home, your heritage. They come for blood, for revenge, to still their blood thirst. But you won't allow it.<h3>Gameplay</h3>Fight of waves of enemies, each consisting of at least 50 turns. Each turn you can collect connected tiles which will yield rewards depending on their type:<br/><br/><br/><ul><li><strong>Potions</strong> heal you and might even yield you a powerful healing potion that you might use whenever you need it.<br/></li><li><strong>Shields</strong> will replenish your armor and count towards your loot value. Collect enough and you can improve your items. You might even find explosives.<br/></li><li><strong>Coins</strong> will allow you to purchase stronger weapons and more powerful armor.<br/></li><li><strong>Swords</strong> can be connected with enemies to deal them damage. Killing them will increase your experience which will lead to levelups and new and better skills.</li></ul><br/>At the end of each wave you will encounter a boss enemy who is stronger and more dangerous than any other enemy you encountered on your way so far. Defeating him can unlock new features and new enemy types. Completing a wave may even trigger a random event that will offer you multiple choices to resolve it.<br/><br/>After your first patrol you may also select one of multiple offered quests which will yield you tentacles and other rewards which can be used to purchase permanent upgrades for your cave.<br/><br/>Will you be the saviour of your people? Or just another worm, crushed under the heels of those so-called heroes?<h3>Feature Overview</h3><ul><li>Over 50 unlockable types of enemies<br/></li><li>6 unlockable weapon types<br/></li><li>5 unlockable playable classes<br/></li><li>Endless waves of enemies<br/></li><li>Over 50 active and passive skills and powerups<br/></li><li>Over 40 event cards with multiple choices and outcomes<br/></li><li>Over 15 quests to choose from<br/></li><li>Improve your cave for permanent bonuses<br/></li><li>Leaderboards and Achievements<br/></li><li>Synchronized unlockables between mobile version and Steam</li></ul>", "metacritic": null, "released": "2020-06-22", "tba": false, "updated": "2020-09-10T22:06:03", "background_image": "https://media.rawg.io/media/screenshots/fa7/fa78e4c4630e8c359ad730d91b1ce1ee.jpg", "website": "https://www.fellhuhn.com/trollpatrol/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 113, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["Philippe Schober"], "genres": ["RPG", "Casual", "Indie"], "publishers": ["Philippe Schober"], "esrb_rating": null}