{"id": 490993, "slug": "matrix-brain-twister-2", "name": "Matrix Brain Twister", "name_original": "Matrix Brain Twister", "description": "<h3>INTRODUCTION</h3>Matrix Brain Twister is a puzzle game, where you have to solve matrices by filling all blocks with the same color. If a block is clicked, the block itself and its horizontal and vertical neighbours will change their color instead of a rotation like the Rubic's Cube. <br/>The matrix is solved, if all blocks are filled with the same color, except white.<br/><br/>This is a very simple game mechanic, but can lead to very difficult riddles. <br/>True to the motto: Easy to learn, hard to master.<h3>FEATURES</h3><ul><li>2D, 3D and 4D matrices<br/></li><li>Several matrix formats like: 2D (Hourglass, Skull, Star, etc.), 3D (Octahedron, Pyramid, Sphere, etc.), 4D (Hypecube, Pentachoron, Octaplex, etc.)<br/></li><li>Random and 30 handcrafted levels for each matrix format (WIP)<br/></li><li>Handcrafted levels varies from easy to hard difficulty<br/></li><li>Solve all handcrafted riddles to not only get achievements, but also to be at the top of the leaderboard<br/></li><li>Random levels can be generated for your own fun and you can change them in dimension, format, size and colors<br/></li><li>Create your own feel-good atmosphere by choosing between different backgrounds, effects, light moods, block styles, music and atmosphere sounds</li></ul><h3>FREE OUTDATED VERSIONS</h3>You can test other free outdated versions of this game. This gives you an opportunity to see, if you like this type of game.<br/><br/><ul><li>Google Play Store: Matrix Brain Twister 2D<br/></li><li>itch: Matrix Brain Twister 3D<br/></li><li>Wallpaper Engine: Matrix Brain Twister 3D</li></ul><h3>FEEDBACK</h3>Feel free to visit the Steam forum to tell us about your feedback, occurring bugs, feature requests or any idea you have in mind. <br/>As the game is currently in Early-Access, we try to add every useful requested feature by the community and definitely fix all reported bugs.<h3>EPILOG</h3>Last but not least, have fun!", "metacritic": null, "released": "2020-06-23", "tba": false, "updated": "2020-09-10T22:13:05", "background_image": "https://media.rawg.io/media/screenshots/08e/08e3a2573bac9a7529e0ae2a2876f48b.jpg", "website": "https://gamejolt.com/games/matrix_brain_twister/510598", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 244, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Clever AI"], "genres": ["Casual", "Indie"], "publishers": ["Clever AI"], "esrb_rating": null}