{"id": 490976, "slug": "relic-guardians-complete", "name": "Relic Guardians: Complete", "name_original": "Relic Guardians: Complete", "description": "Relic Guardians: Complete Edition is the compilation of the Arcade Version and the Story Version + more in one single package!<br/><br/>Take control of one of the Relic Guardians and help them fight the Space Chaos. You'll fight the Chaos horde using a rock-paper-scissors-like system of turn-based combat. It's a simple system to learn, but tough to master. And with good strategies and luck, you'll be able to save the world!<br/><br/><br/><ul><li><strong>Highly Experimental Mechanics</strong> - Explore Earth-1 by randomly selecting a time and place. Every run is a new sequence of events;<br/></li><li><strong>Play as 7 Different Characters</strong> - Every character is unique in their own way. Try different characters;<br/></li><li><strong>Rock-Paper-Scissors Battles</strong> - Every action has a reaction, so choose every action wisely;<br/></li><li><strong>Items Galore!</strong> - If you're still feeling that the battle system is too luck-based, then try using items;<br/></li><li><strong>Collect Relics and Defeat Bosses</strong> - Defeating every boss can be a tough task, but don't give up!<br/></li><li><strong>Play Again and AGAIN!</strong> - This mode is made to be highly replayable, you can unlock new characters and endings for them!</li></ul><br/><br/><ul><li><strong>Linear Story</strong> - It's a cutscene-heavy mode with a LOT of text, but if you're cool with that, there's an enjoyable story to be experienced here;<br/></li><li><strong>Interactive Fights</strong> - In between the cutscenes you'll encounter a few fights that YOU take control of the outcome!<br/></li><li><strong>Bonus Scenes</strong> - And depending on how you fight, you may or may not see new scenes, so even the story is replayable;<br/></li><li><strong>Battle Visual Novel</strong> - I must say again: there's a LOT of text! Even with some fights in it, the focus of this mode is to give you the story of these characters, so please enjoy it!</li></ul>", "metacritic": null, "released": "2020-06-22", "tba": false, "updated": "2020-09-10T22:04:12", "background_image": "https://media.rawg.io/media/screenshots/776/776b99578ccf7b90095ed6d60eede828.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 258, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["victor sette games"], "genres": ["Adventure", "RPG", "Casual", "Indie"], "publishers": ["victor sette games"], "esrb_rating": null}