{"id": 490973, "slug": "plunkocity", "name": "Plunkocity", "name_original": "Plunkocity", "description": "Plunkocity is a light hearted brain game that is simple enough to be enjoyed by all.  Seven different versions allow seven different topics to be drilled, all while being amused by whimsical pain and rewards. <br/>\n<br/>\r\nAdd and Subtract numbers to reach the target number waving in the background.  Spell words both in english and spanish, so long as they are at least as long as your target.  Match objects that are similar in bizarre ways; what does dinosaurs and ugly looking toe nails have in common? There both dead, but no more hints here. Match objects from your favorite sport or animals based on their biological families.<br/>\n<br/>\r\nNeed some extra help, SHARK!  Have your mechanical arm hold the flopping fish over the ball to be removed and click for the shark to remove it.  Click on an Einstein ball and watch the mechanical arm point out the best match possible.  Maybe something more simple, like a bomb ball or a rocket ball that sends the whole column into orbit.  Many more helpers will keep you guessing what is next.<br/>\n<br/>\r\nNothing comes for free; as the game progresses, more obstacle will be placed in your way, blocking your view, changing balls to something different just before you can get your match or maybe blocking where you can go.  As they say, no pain, no gain.<br/>\n<br/>\r\nDesigned from beginning to end to give you some grins while learning a few things.  Have fun.", "metacritic": null, "released": "2020-06-22", "tba": false, "updated": "2020-09-10T22:02:54", "background_image": "https://media.rawg.io/media/screenshots/682/682c2ba9a3eb9701ed4f39a370f98add.jpg", "website": "http://plunkocity.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 313, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jeffrey Fullerton"], "genres": ["Casual", "Indie"], "publishers": ["Jeffrey Fullerton"], "esrb_rating": null}