{"id": 490968, "slug": "maze-sinister-play-collectors-edition", "name": "Maze: Sinister Play Collector's Edition", "name_original": "Maze: Sinister Play Collector's Edition", "description": "<strong>Mad Head Games</strong> brings you the latest chilling chapter in the Maze series!<br/><br/><strong>WARNING</strong>: This horror game features moments of psychological terror that some may find distressing. It is not for the faint of heart.<br/><br/>You’re more than excited for a fun road trip with your best friends. But things quickly take a terrifying turn when you’re kidnapped by a pair of eerie children! Not only do you find yourself trapped in an abandoned school, but an old ghost roams the halls bent on burning everything to the ground! Things are never quite what they seem, and it’s up to you to defeat a long-forgotten evil to escape with your life. Do you have what it takes? Find out in this spine-tingling Hidden-Object Puzzle adventure! <br/><br/>This is a special Collector's Edition release full of exclusive extras you won't find in the standard version. The Collector's Edition includes:<br/><br/>•\tCan you save your best friends in the Bonus Game?<br/>•\tUnlock the Ultimate Hidden Object Puzzle!<br/>•\tReplay your favorite HOPs and mini-games and earn achievements! <br/>•\tEnjoy exclusive wallpapers, screensavers, music, concept art, and more! <br/>•\tNever get lost with the strategy guide!<br/><br/><br/>This is a Hidden Object Puzzle Adventure game, meaning a specific genre of story-driven, point &amp; click adventures. Throughout the game, players are tasked to find a list of objects hidden within a particular scene, and to occasionally complete various mini-games/puzzles.", "metacritic": null, "released": "2020-06-21", "tba": false, "updated": "2020-09-10T22:00:04", "background_image": "https://media.rawg.io/media/screenshots/f11/f11debafc204cb483f07cd56baf85867.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 518, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mad Head Games"], "genres": ["Adventure", "Casual"], "publishers": ["Big Fish Games"], "esrb_rating": null}