{"id": 490935, "slug": "sloth-quest", "name": "Sloth Quest", "name_original": "Sloth Quest", "description": "Control the true king of the jungle as you navigate treacherous vines, battle predators, scale trees and travel to the great beyond. Can you master the precise timing honed by all sloths in the jungle? Impaired by lethargic motions, you must patiently complete your quest, and avoid predators at all costs.<br/><br/>Inspired by challenging games such as GIRP and Sexy Hiking, Sloth Quest takes a twist on the typical platformer by giving you control of a climbing sloth.<br/><br/>Features<br/><ul><li> Swing, swim and grab your way through over 30 levels<br/></li><li> Collect lost treasures and wearable items scattered throughout the world<br/></li><li> Fight and defeat tough bosses<br/></li><li> Customize your sloth with wearables and complete outfits you discover</li></ul><br/>Controls<br/><br/>Sloth Quest supports both keyboard and game controller (xbox or equivalent). The game has an unusual control scheme. You control each of the sloth arms with a single key or button. A short tap starts the arm raising and a press-and-hold will grab anything in reach. Two more keys control the swing of the legs left and right.<br/><br/>The arms and legs move slowly--this is a sloth. You will need to predict motions and carefully time your grabs to make progress. Oh, and you must hold down the key or the sloth will let go!<br/><br/>History<br/><br/>Sloth Quest was conceived around 2013. In 2014, a short version of the game was green lit by Valve under the old Steam Greenlight program. That game was never published for various reasons. In 2019 we decided to remake the game. We kept the basic controls, but expanded the game's scope, duration and mechanics of the sloth.<br/><br/>Requirements<br/><br/>If you use a keyboard, it must be capable of detecting 3 nearby keys at once. Many modern keyboards and all gaming keyboards typically support this feature. If you are unsure, try the web demo. Go to our website using the links box on this page. Full game controller support is always a second option.", "metacritic": null, "released": "2020-06-18", "tba": false, "updated": "2020-09-10T21:37:02", "background_image": "https://media.rawg.io/media/screenshots/2a7/2a7a1a952f50c5866f8383233a4354c7.jpg", "website": "http://www.lumatap.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 363, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["lumatap"], "genres": ["Action", "Simulation", "Indie"], "publishers": ["Lumatap"], "esrb_rating": null}