{"id": 491004, "slug": "gogoo-2", "name": "Gogoo", "name_original": "Gogoo", "description": "Gogoo is all the way set to take you to a Platform adventurous and challenging game. Gogoo is stuck in the levels full of barriers and needs your help to reach the exit of each level. The path is covered with hurdles which makes it impossible for Gogo to escape without your help. Go the Extra Mile for every level as new challenges will be waiting for Gogoo with each progress. Every new level brings new thrills and dares. Your mind needs to be extra focused while playing this game. Try to expertise this game, although quite tough, and try balancing Gogoo carefully through the obstacles as your single miss can vanish the Gogo and you have to start all over again. Remember Gogoo has some special skills besides walking. It can jump, do wall hop, and even slide. This game is addicting and extremely tough to master. It has a minimalistic design but maximum thrill and fun.<br/><br/>Features:<br/>1. Pull up your socks for the most challenging and astonishing game you will ever play. <br/>2.Every passing level brings unique dares for you. <br/>3. Control the Gogo wisely to cross all the hurdles. <br/>4. The trick you used in the previous level may not be helpful in the next level. So look out before you proceed. <br/>5. Wisely select the correct skill of the Gogoo and pass the obstacles. <br/>6. Amazing gameplay will make  you addictive to this game. <br/>7. This game has minimalistic design with maximum fun.<br/>8.The graphics and design of the game is minimal to accentuate and emphasize on the main aspects of the game,  so that you can enjoy the game to the fullest.", "metacritic": null, "released": "2020-06-23", "tba": false, "updated": "2020-09-10T22:19:40", "background_image": "https://media.rawg.io/media/screenshots/8be/8be2ec69bb947a6e6166e127dd1a66e6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 60, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["StarCity Games"], "genres": ["Action", "Casual", "Indie"], "publishers": ["StarCity Games"], "esrb_rating": null}