{"id": 491027, "slug": "miao-yu-lian-zhu", "name": "妙语连珠", "name_original": "妙语连珠", "description": "The glyph of Chinese characters is art in itself.<br/>Every Chinese character is square, solid and rigorous in structure. The exquisite composition and proper proportion make the symbol endowed with too much artistic connotation.<br/>This game combines the unique structure of Chinese characters with the play methods of xiaoxiaole, 2048, Sanhe, pushing box, etc., and develops a unique new play method creative game for identifying, recognizing and expanding Chinese culture.<br/>It's really about teaching and having fun. Experience the charm of Chinese characters in entertainment, and recall the beauty of learning in the game. From then on, say goodbye to writing and forgetting Chinese characters, enrich your vocabulary, and improve your understanding of Chinese culture and even Chinese culture.<br/><strong> Basic play method<br/>The strokes are combined into radicals, radicals are combined into Chinese characters, Chinese characters are combined into idioms, poems, riddles and so on. In depth analysis of 4736 Chinese characters, each of which has several combinations, waiting for your exploration.<br/><br/><strong> Promotion play method [/ b]<br/>When the players are familiar with the basic operation, the following levels will integrate idiom reconstruction, antonym, disassembly, assembly and other complex playing methods. The players will no longer consider which strokes are combined intuitively. The curve like checkers will become the mainstream to save the country. The route and complexity will be increased by one or two orders of magnitude. Of course, the fun will also be.<br/><br/><strong> Level [/ b]<br/>Xiongguan road is like iron, 100 Xiongguan are waiting for you to break through, including word completion, poem completion, riddle solving, allegorical sayings, idiom connection, xiaoxiaoxiaole, maze, and so on. In the future, new playing methods and checkpoint modes will be added continuously, and all the people who pass the customs will get the top secret!</strong></strong></strong>", "metacritic": null, "released": "2020-06-25", "tba": false, "updated": "2020-09-10T22:32:12", "background_image": "https://media.rawg.io/media/screenshots/cc3/cc3bc23c4e9ed139cb1b88a67da39e8b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 216, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["杨云卿"], "genres": ["Strategy", "Casual", "Indie"], "publishers": ["杨云卿"], "esrb_rating": null}