{"id": 491050, "slug": "zoku-sonohigurashi-vs-touhou-universe-2", "name": "zoku sonohigurashi vs touhou universe 2", "name_original": "zoku sonohigurashi vs touhou universe 2", "description": "90's-style 2D fighting action in which real-life men fight in cosplay.<br/>The shocking work that appeared in 2016 finally appears on Steam!<br/>* This work is a secondary creation game work based on the Touhou Project.<br/><br/>This is a package that contains all the delivered DLCs.<br/>45 playable characters, 50 stages in total (individual BGM for each stage)!<br/><br/>Even if it looks like cosplay, the contents of the game are very serious<br/>Please enjoy a nostalgic live-action fighting game.<br/><br/><br/>[Features of this work]<br/>■ Spell_Declaration<br/>A trump card that can be activated when your physical strength is 1/4 or less (physical power gauge flashes) and you have at least one skill gauge.<br/>You can use unlimited Gauge expends for 10 seconds while active.<br/>The effect is forcibly terminated when \"Time Out\", \"Final Secret / Last Word\" or \"SPELL FATALITY\" is activated.<br/>It can be activated only once per game, and after the end of the effect, gauge consumption techniques cannot be used until the end of the game.<br/><br/><br/>■ KURAI Bomb Combination<br/>A system that can counterattack while being attacked by the opponent.<br/>Cancel the damage action and perform a combination attack.<br/>During the combination, the attack of Todome splits depending on the direction of the direction key,<br/>Further pursuit is possible.<br/><br/><br/><br/>■ SPELL FATALITY<br/>A deadly technique for Todome that can be activated when the opponent's physical strength is 1/4 or less while the \"Spell Declaration\" effect is in effect.<br/>When you hit, you can always defeat your opponent.<br/>There is a production unique to each character.<br/><br/><br/>【mode】<br/>・ ARCADE<br/>It is a mode to fight the CPU battle.<br/>Depending on conditions, boss branching and multi-ending.<br/>Immerse yourself in the story with every individual victory message.<br/><br/>・ VS<br/>In this mode, you can play local matches with your friends.<br/>(Single [1 ON 1].)<br/><br/><br/><br/>▼ Story<br/><br/>The stage is a fantastic fanatic ...<br/><br/>Defeated the swordsmen's \"Celebration Sakura Fire\" and \"Sarin Rin\"<br/>Distortion of the dimension that was connecting the fantasy fan with Hinazawa was closed and the incident was resolved<br/>The two worlds have regained their original form and it looks as if peace has come ...<br/><br/>However, there are a few beast shrine maidens of Hinazawa, \"Riken Riwa\" and several residents of Hinazawa.<br/>I was getting into a fantastic fanatic as if I was invited by something.<br/><br/>Their purpose is to kill time and play extra time in club activities (called a rampage)<br/>There are various purposes, but in the greatest crisis of this fantastic fanatic<br/>To subdue, capture, and repel uninvited guests<br/>He started to move with his heavy waist up.<br/><br/>\"Please subdue the swordsman Pearfires who are rampaging in fantasy!\"<br/><br/><br/>[Development tools]<br/>・ 2D Fighting Maker 2nd", "metacritic": null, "released": "2020-06-26", "tba": false, "updated": "2020-09-10T22:44:56", "background_image": "https://media.rawg.io/media/screenshots/373/373d8db2dd58d138a816919c77729fb6.jpg", "website": "http://www.18kingyo.com/sonohivstouhou2.5_main.html", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 302, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["青春18金魚"], "genres": ["Action", "Indie"], "publishers": ["青春18金魚"], "esrb_rating": null}