{"id": 491014, "slug": "forgotten-trace-thanatos-in-nostalgia", "name": "Forgotten Trace: Thanatos in Nostalgia", "name_original": "Forgotten Trace: Thanatos in Nostalgia", "description": "It all began with a beautiful lullaby...<br/><br/>Forgotten Trace: Thanatos in Nostalgia is an enchanting all-ages dramatic mystery visual novel by developer Almaz.<br/><br/><h3>Story</h3>\"This is a love story adrift in time eternal, woven from the grief of a girl.\"<br/><br/>Nanami Kazuya finds himself in a place that he can't identify as either a dream or reality.<br/><br/>Under the northern stars, the young man who has lost everything when his dream crashed, is now all alone in a forest dark and snow-covered. Everything around him reflects the depths of his own mind, and the gloom of his daily life.<br/><br/>The only thing different is that the pain in his knee is somehow all gone...<br/><br/>Lured by an inexplicably beautiful lullaby, Kazuya walks through the maze-like forest, only to discover a captivating beauty singing by a lake, shining bright amidst the moonlight snow.<br/><br/>\"I wanted to see you, Kazuya...\"<br/><br/>She whispers and kisses him.<br/><br/>Right beside the couple blooms a single violet flower unaffected by the snow, as though watching them...<br/><br/>In Kazuya's town, there has lately been a string of mysterious suicides committed by people with various medical issues.<br/><br/>Someone with a leg problem jumped off the roof of a building; someone with a hand problem wrote a suicide note in their own hand before their death.<br/><br/>Kazuya recalls the snowy forest and how he didn't feel any pain in his knee there.<br/><br/>\"Who was that beautiful woman? And what's the meaning of everything that happened there?\"<br/><br/>There is one thing he does not yet know about himself: That he himself is one of the seven symbols that lurk in the back of his memories from the distant past.<br/><br/>And it all began with that beautiful lullaby...<br/><br/>", "metacritic": null, "released": "2020-06-24", "tba": false, "updated": "2020-09-10T22:25:33", "background_image": "https://media.rawg.io/media/screenshots/f79/f796a2825432c8de7e526a3a758d4202.jpg", "website": "http://fruitbatfactory.com/forgottentrace", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 31}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 433, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Almaz"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Fruitbat Factory"], "esrb_rating": null}