{"id": 491022, "slug": "galmon-folklore-monster-girl-galore", "name": "Galmon Folklore ~Monster Girl Galore!~", "name_original": "Galmon Folklore ~Monster Girl Galore!~", "description": "The development of this game took 6 years and a half.<br/>A super kawaii and lengthy fantasy RPG!<br/><br/>○ Game content<br/><br/>The protagonist named Ryle is put through various kawaii situations in this game.<br/>The gameplay is designed so you can fully enjoy events with monster girls without <br/>frustrating level grinding and frequent random encounters with monsters.<br/><br/>〇Story image<br/><br/><br/><br/>A monster army led by a Greater Demon that suddenly appeared.<br/>The resistance of the human race was also lacking, and the Continent of Wiltoria was conquered.<br/>The Greater Demon, who claims to be the Demon King herself, divides the continent into five parts and begins control by himself and big four Devas under his control, and humanity entered the dark age ...<br/>Six years after the Demon War.<br/>Lyle, a good boy at a church in the Kingdom of Rainier, embarks on a service mission as a monk to qualify as a priest.<br/>Lyle needs to survive this dangerous continent.<br/><br/>〇Recommended points<br/><br/>More than 200 characters and monsters are drawn!<br/>The total number of magic and skills is more than 500 including enemy and ally!<br/>A large volume of about 30 hours to play once!<br/>No stress due to low random encounter rate (probability of 1 encounter in 60 steps)<br/>he level will rise to some extent only with events and boss battles, so earning experience value is minimal!<br/>Still, strong bosses are placed here and there for those who have raised their level<br/>There is no effect on the game progress or story even if you defeat it!<br/>Too difficult to solve the mystery is not adopted, you can enjoy the mystery solving feeling with a proper mystery!<br/>Full-scale scenario!<br/>Coach of martial arts gym supervises martial arts-related skills and scenarios!<br/>There are 4 endings, the branch is in the final stage, and if you save there, replaying is easy!<br/>100 save slots are available!<br/>Recollection mode is fully opened with one clear!<br/><br/>〇characters<br/><br/><br/>・Lyle<br/>Protagonist of this work.<br/>He is a good boy, kind and loved by everyone.<br/>Embark on a journey as a monk to become a monk.<br/>Don't miss people in trouble and get involved in various incidents.<br/><br/><br/>・ Demon King Greater Demon<br/>A high-ranking demon that suddenly emerged from the demon world and invaded the continent.<br/>He herself named himself the Demon King and reigns on the continent.<br/><br/>・military planner Dark Elf<br/>Evil elf who believes in darkness and chaos.<br/>Greater Demon military planner, also serving as the head of the military police.<br/>Although it is inferior to other big four in a simple meat war, it manages finances, intelligence and strategies of the Demon King army with excellent skill, and the great demon's trust is also thick.<br/>Constant suffering from chronic gastritis.<br/><br/><br/>・big four Dragon<br/>The strongest monster in the demon army, and it is said that its simple attack power exceeds that of the demon king.<br/>Her personality is rough and aggressive, and once he gets really angry, whoever can't touch it.<br/><br/>・big four wight<br/>Big four leading an undead monster.<br/>Her was a well-known fighter who used the fist of lightning and was the founder of Cavendish style martial arts.<br/><br/>・big four Alraune<br/>Plant-based monster leading an insect monster.<br/>Her always vague and nobody don't know what Her thinking about .<br/><br/>・big four Evil Kight<br/>Big four leading the Beast Monster.<br/>Knight wearing equipment equipped with dark magic.<br/>Beastmen Moe Lesbian and Hentai, Looks Cool, But Missing Somewhere.<br/>Know the names and birthdays of all of her subordinates.<br/><br/><br/>Various other characters will also appear!<br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/>", "metacritic": null, "released": "2020-06-24", "tba": false, "updated": "2020-09-10T22:29:38", "background_image": "https://media.rawg.io/media/screenshots/248/248a72fc4a340b19e13050d91d123fce.jpg", "website": "http://miragebringer.x.fc2.com/galmonG/galmon_index.html", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 377, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ミラージュブリンガー"], "genres": ["RPG", "Indie"], "publishers": ["ミラージュブリンガー"], "esrb_rating": null}