{"id": 491122, "slug": "do-noob-corporate-slave-dream-of-bosss-ass", "name": "Do Noob Corporate-slave Dream of Boss's Ass?", "name_original": "Do Noob Corporate-slave Dream of Boss's Ass?", "description": "<strong>The game is not yet available in English.</strong><br/><strong>(The English content of this article uses AI translation, it is difficult for us to guarantee the accuracy of the translation.)</strong><br/><br/>++++++++++++++++++++++++<h3>Choose it, wage slave! What you see may be your tomorrow! </h3><br/><br/>Small cram school before the first entry,<br/>Effectively identify and turn back the fate of death[1].<br/>Even seasoned professional elites can use the game to develop ideas.<br/><br/><strong>+From the Real Story+</strong><br/>This is a new into the workplace rookie wage slave in the industry well-known media companies mixed three years of footing countless finals of the blood and tears history.<br/><br/><strong>+The Easy-to-understand Play+</strong><br/>Slide the card with your mouse to make your own decisions,<br/>Then wait for the workplace verdict!<br/><br/><strong>+Super Rich Content+</strong><br/>From dealing with co-worker sms to choosing a favorite lunch,<br/>Up to 300 real-world experiences!<br/>Exercise your workplace responsiveness in a reality situation close to the soul!<br/><br/><strong>+A Variety of Difficulty Options+</strong><br/>Believe this is a RougeLike game?<br/>If you want to back the plate clearance, you may need to slightly upgrade the brain[3]！<br/><br/><br/><strong>❤You can live the game in any form❤</strong><br/><strong>❤Also let viewers know our game page on live❤</strong><br/><br/>++++++++++++++++++++++++++++++++<br/>[1]:Due to possible differences between your boss and co-workers in your life and the game, we do not guarantee that the results will happen 100% by the game.<br/>In the event of adverse reactions, you can write to us, but there is no guarantee that you will be able to solve.<br/>[2]:For special reasons, we can't reveal who the story prototype is, but we can guarantee that the content of the game is 100 percent original in the workplace.<br/>[3]:This game in the test ingress stage no player can clear difficulties and real mode, can you become the first \"God of Wage-slave\"?", "metacritic": null, "released": null, "tba": false, "updated": "2020-09-10T23:32:07", "background_image": "https://media.rawg.io/media/screenshots/e6b/e6b1c9dafe4a708e5d7786303cb7572c.jpg", "website": "https://moespiritstudios.github.io/BossAss/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 65, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["TOWA Software"], "genres": ["Adventure", "RPG", "Strategy", "Simulation", "Casual", "Indie"], "publishers": ["Moespirit Studios"], "esrb_rating": null}