{"id": 491185, "slug": "apprentice-arriving", "name": "Apprentice Arriving", "name_original": "Apprentice Arriving", "description": "Apprentice Arriving is a narrative-driven 3D-Fantasy RPG played in 3rd-Person that combines Retro elements with modern gameplay. Guide Prince Landon’s way as he fights Maira’s mystical creatures to become a true and worthy Paladin. But as your slumbering powers grow, so do the dark forces tracking your every step.<br/><br/><br/><br/>Your time has come. As the „Apprentice“ you dive into the role of a sorcerers disciple, granted with incredible strength. You are the son of the beautiful Queen of Aclendi, whose ancestry is indistinct. She sends you out to „Dormum“ the home of the wizards. There you will be subjected to trials which will awake your slumbering powers. With your new abilities you will be able to oppose the evil forces. But be warned, this is not the end of your journey. A long adventure awaits you with a mysterious and profound story where many things are not as they seem to be. In a world where darkness seeks to overwhelm, you may not prevail with incredible powers only. Are you ready for a journey beyond your imagination? Then be the next Apprentice!<br/><br/><br/><br/>The fights in Apprentice Arriving are dynamic and they can get very tough, you can dodge, use Magic &amp; Technique Skills and fight with various sword types. Tactics can be more effective than pure force so you will see that running on the blunt will most likely not lead to success.<h3>Whats Included In the current version?</h3><br/><ul><li>element Magic Skills<br/></li><li>several sword types<br/></li><li>weapon enchantments<br/></li><li>Equipments &amp; Items like rings and herbs to buff your character<br/></li><li>a few attack moves and combos<br/></li><li>Physical Techniques<br/></li><li>level up system up to lvl 10<br/></li><li>small level available for exploration<br/></li><li>some enemy types and a boss fight<br/></li><li>some hidden quests</li></ul><br/><br/><br/><strong>This is a list showing what will come with the next big update.</strong><br/><br/><ul><li><strong>Destiny Board</strong></li></ul>It allows you to skill passively. Everything you do is taken into account and improves over time in the game. It can be a type of weapon to use, an attitude or elements like fire and water. Even running and jumping can be learned and improved over time. Everything you do, you learn as in real life. You decide what to specialize in. Master what you like!<br/><br/><ul><li>New NPC's &amp; Quests<br/></li><li>New weapons<br/></li><li>Combat Stances<br/></li><li>New attack moves and combos<br/></li><li>New smooth character animations<br/></li><li>More balanced combat<br/></li><li>New monster components to collect</li></ul><h3>Development</h3><br/>In November 2017, we started planning for Apprentice Arriving and have been continuously involved ever since. The development of this version was completed in less than a year and the programming in three months. Now we have completed a fully functional version, which can have a playing time of up to six hours. There are already different enemy types, abilities, spells, some equipment, secrets, quests and much more.", "metacritic": null, "released": "2020-07-07", "tba": false, "updated": "2020-09-11T00:13:50", "background_image": "https://media.rawg.io/media/screenshots/923/923f4e225ff99b8ced25f655dfaffc07.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 566, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jewel Seeker Entertainment"], "genres": ["Action", "Adventure", "RPG"], "publishers": ["Jewel Seeker Entertainment"], "esrb_rating": null}