{"id": 491126, "slug": "dominus-multiplayer-sim-turn-based-strategy", "name": "Dominus - Multiplayer Sim Turn Based Strategy", "name_original": "Dominus - Multiplayer Sim Turn Based Strategy", "description": "<strong>Dominus</strong>: collect technologies, troops, and heroes with unique abilities as you build up a powerful tribal civilization and out-think your opponents in 4 player simultaneous-turn-based battles.<br/><br/>* Simple and quick to learn, even if you have no experience in turn-based games<br/>* Set in a lush fantasy world of floating islands, savage tribes and raw elemental magic<br/>* You are the warlord of a tribe bent on survival, expansion and ultimate domination<br/><br/>Revolutionary Simultaneous-turns system:<br/><br/>- All players plan their actions at the same time<br/>- Then watch the results unfold in a cinematic action scene<br/>- Skillful play is about predicting enemy moves and actions<br/>- This leads to a lot of suspense, crazy bluffing and mind games!<br/>- Also makes combat highly skill-based and tactical, without being overly complex<br/><br/>We’re currently in beta, keep track of us on Discord and be the first to find out the exciting features we have planned- taking this insanely fun core gameplay and transforming it into a huge multiplayer world of clans, empires and adventure!<br/><br/>We’re racing to deliver the game on steam as quickly as we can, don’t forget to add us to your wishlist to stay updated!", "metacritic": null, "released": null, "tba": false, "updated": "2020-09-10T23:34:17", "background_image": "https://media.rawg.io/media/screenshots/55d/55d02c7d6ee9a4c11a72ccc52427e835.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 226, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["dc1ab"], "genres": ["RPG", "Strategy", "Indie"], "publishers": ["dc1ab"], "esrb_rating": null}