{"id": 491162, "slug": "kokorokuroba-pato1kokoro-clover-part1", "name": "ココロクローバー パート１/Kokoro Clover Part1", "name_original": "ココロクローバー パート１/Kokoro Clover Part1", "description": "Join the Spirit Summoner, Treffy, in this side-scrolling action-platformer in the style of a Sunday morning anime TV show. In part 1, Treffy begins her story with Spirit friends and some clumsy bad guys. Fight using magic and transform using Elemental Spirits in this exciting and comedic adventure!<br/>\n<br/>\r\nーーーーーーーーーーーーーーーーーーーーー<br/>\r\n（machine translation）<br/>\n<br/>\r\nKokoro Clover Part 1\" is the first installment of the \"Kokoro Clover\" series, a casual side-scrolling dot picture action game based on the theme of \"casual play\" and \"Sunday morning anime\", in which the main character, Treffy, is transformed, summoned, dances (with unique motions), and has a choice of stages.<br/>\n<br/>\r\nAssist, dance, and collect unleashed assists, dances, and collections while completing the story mode and challenge mode inspired by the atmosphere of \"Sunday Morning Anime.<br/>\r\nThe game is unique in that it opens up.<br/>\n<br/>\r\nThe protagonist and player, Treffy the Spirit Master, has to use the help of his fellow spirits in the stage. Transformation, which allows you to change your appearance and attributes, and Assist, which summons fellow spirits and defeated bosses. You can \"Dance\" to perform unique motions set on the spot.<br/>\r\nThese elements will be opened up as you watch the story and clear stages.<br/>\n<br/>\r\nIn addition, there are treasure chests in the stages, and you can \"collect\" the stickers hidden in them.<br/>\r\nCollected collections can be viewed in Library Mode.<br/>\n<br/>\r\nIn the Story Mode, Treffy, a spirit user, obtains a mysterious clover and is able to use it to help him get to the next level. embark on a journey<br/>\r\nThe storyline is based on the image of an animated film (30 minutes) depicting the situation.<br/>\r\nYou can also select the tutorial map and boss battles.<br/>\n<br/>\r\nIn the \"Challenge Mode\", you can select the stage where the bosses will be waiting for you at the end of the game.<br/>\r\nDefeat all bosses (including Story Mode bosses) and fight against them in succession to unlock the boss rush! You can also use the Library mode.<br/>\n<br/>\r\nIn the Library mode, you can also use the collections you've collected in each stage and the progress of the story. character and<br/>\r\nYou can see a description of the monster with a dot picture.<br/>\n<br/>\r\nIn \"Password Mode\", you can choose a password to unlock special assists and dances. You can do this.<br/>\r\nThe password can be found at the end of the story mode and challenge mode.<br/>\n<br/>\r\nKokoro Clover was created with the themes of \"casual play\" and \"Japanese Sunday morning anime\". I did.<br/>\r\nExperience the lively and fun atmosphere of pixel art.<br/>\n<br/>\r\nPlay time: 40 minutes to 1 hour<br/>\n<br/>\n<br/>\r\nWe are planning to fix bugs as needed.<br/>\r\n2020/07/06 Update: Temporary deletion of \"mid-air attack (vertical rotation)\" as a countermeasure for the wall-loop bug. Done.<br/>\r\nAdded on 2020/07/09 Including the display of boss icons, attributes and HP in boss battles. Update.<br/>\r\nAug. 29, 2020 Added English translation, added effects for weak point hits, enhanced direction, and other updates.<br/>\r\nIf the game does not start, please install the 32-bit VC++ Runtime. Try the", "metacritic": null, "released": "2020-07-04", "tba": false, "updated": "2022-10-19T13:11:36", "background_image": "https://media.rawg.io/media/screenshots/735/7359d7bcfef2b8f013541ab3ab5d2413.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 14, "toplay": 1}, "playtime": 2, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 325, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["ひこてる"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["ひこてる"], "esrb_rating": null}