{"id": 491101, "slug": "dungeon-marauder", "name": "Dungeon Marauder", "name_original": "Dungeon Marauder", "description": "Dungeon Marauder is a retro style, pixel art, 2D, roguelite puzzle game created by Razvan Luta where you play as a mighty knight with an even mightier quest. <br/>Your knight is cursed to only be able to move in one direction at a time until they are forced to stop by an obstacle. You can use the walls and the major blockers to redirect the knight towards the exit.<br/><h3>TONS OF LEVELS</h3>Play through hundreds of challenges and discover the traps and monsters that lurk in the caves and dungeons. Each challenging room is hand crafted, but levels are built out of three different rooms that get randomly selected from a set of a certain difficulty so each one of your playthroughs may be completely different.<br/><h3>ATTACK AND DEFEND</h3>But just because your movement is limited are your items dictate how powerful you are, it doesn’t mean your choices are! On the contrary, your smarts and instincts will: every moment after you’ve started moving in a direction, you have to decide if you want to go faster or slower, attack the enemy that’s right in front of you or shield yourself from incoming projectiles or take some minor damage while avoiding certain death? <br/>Choose right and you may live to see another level!<br/><h3>TRAPS!</h3>Not so fast though and watch your step! Every level is sprawling with traps trying to impale you, crush you, drop you to your demise or do one of many other ruthless things to you.<br/><h3>ENEMIES!</h3>And just when you thought traps were the only thing you’d have to worry about, a rat will bite your foot. Or maybe a spider? Or maybe a giant <strong>redacted spoiler</strong>. You’ll have to find out for yourself.<br/><h3>INVENTORY ITEMS!</h3>But do not fret! That might all sound a bit overwhelming at first, however, help is on the way. Hidden through the chambers of the dungeons you’ll find enchanted items that will help you survive the horrors: swords and bows that will help you attack your enemies and different types for armor that will protect you from said foes and traps.<br/><br/><br/>I hope you enjoy playing this game as much I enjoyed making it!", "metacritic": null, "released": null, "tba": false, "updated": "2020-09-10T23:18:48", "background_image": "https://media.rawg.io/media/screenshots/609/60922fae5742352fcb5658f1b75e5448.jpg", "website": "https://dungeonmarauder.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 84, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["KROMVO Games"], "genres": ["Adventure", "RPG", "Strategy", "Indie"], "publishers": ["KROMVO Games"], "esrb_rating": null}