{"id": 491294, "slug": "the-importance-of-choosing-second-chance", "name": "The importance of choosing: second chance", "name_original": "The importance of choosing: second chance", "description": "This story will tell us about a girl who went through a lot in her life, and each of her decisions led to certain consequences, sometimes even very sad. At first, our heroine does not remember anything, she got into a world that is limited only by her memories, she needs to see 6 consequences of decisions in which she can understand which path in the final, she still should choose.<br/><br/><strong>TIOC: second chance</strong>- a game which is designed for a peaceful passing, along with the main character you will face the consequences of a choice, which in the final will help you to make the right decisions, so you have the opportunity not to just take the consequences, and to explore the area and be aware of the challenges took place, the main character, and why she had to undergo these difficulties, you will be able to control your character, view a map of the main platform, and a flashlight that will illuminate your path. Each consequence is different from each other, the variety of terrain, its own history, its own end of history, and more. Consequences of refusing to study, trusting strangers, excessive faith in loved ones, the consequence of using prohibited substances. in the final part, you have the freedom of choice. The game has several endings, and it all depends on which path you choose.<br/><br/><strong>Gameplay, game features and content clearly, by item</strong>:<br/>0. after Starting the game, we will see the main menu which will be: \"game Description\". Click on this item and read, in order to understand: what to do in this game, what the game is about and how to control the character. Then we start the game and go to step 1.<br/><br/>1. we Start the game from the \"Starting point\", while we have a flashlight and a complete lack of interface, what to do next? Where to go? In order to find the answer to this question, we proceed to step 2. <br/><br/>2. Press the \" Esc \"key on the keyboard, and a menu opens in front of us, where we can see the map, and on the map, the \"Starting point\" where we are. On the map, we understand where to go, we start our way to the 1st \"consequence of choice\", go to the 3rd step.<br/><br/>3. At this step, we have already reached one of the \"consequences of choice\", we have a small platform in front of us, go a little on this platform, and start to pass this \"consequence of choice\", go to the 4th step.<br/><br/>4. after A little on a small platform, we see the \"consequence of choice\" in which you will need to listen carefully to each dialogue, and pay attention to every detail, all this in order to understand what difficulties our heroine went through, and why everything turned out exactly like this. As you go through each consequence, you will return to the \"Starting point\", and as you head to the next \"consequence of choice\", you will have time to think about everything that happened in the consequence that you went through before. We go to step 5:\" Final part: choosing the path\".<br/><br/>5. When you have already passed each consequence, and are sure that you are ready for the final part, you go to a small platform, which is indicated on the map as:\" Final part: choosing the path\". And if you can choose the right path, you will expect a good ending.<br/> <br/><br/><br/><strong>game Features</strong><br/><br/>Choice<br/><br/>Original story <br/><br/>Importance of voice acting<br/><br/>Variety of terrain", "metacritic": null, "released": "2020-07-15", "tba": false, "updated": "2020-09-11T01:19:50", "background_image": "https://media.rawg.io/media/screenshots/c92/c92c57e1c4d7403dd056357f6ff2ecbc.jpg", "website": "https://www.off1c1al.com/the-importance-of-choosing", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 192, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["OFF1C1AL"], "genres": ["Adventure", "Indie"], "publishers": ["OFF1C1AL"], "esrb_rating": null}