{"id": 49121, "slug": "ermo", "name": "ERMO", "name_original": "ERMO", "description": "ERMO is an ethereal puzzle game featured with a charming and peaceful graphics.<br/>\r\nYou will learn the rules in a few seconds, but ERMO will catch you for hours.<br/>\r\nImmerse yourself in the landscapes and colors of ERMO and let you be carried away by the restful atmosphere. <br/>\n<br/>\r\nRearrange the blocks to get columns of the same color.<br/>\r\nHow many blocks you can collect?<br/>\n<br/>\r\nRelaxing with vibrant colors, ERMO is a logic puzzle pleasant to play for all ages.<br/>\r\nA relaxing and soothing music enriches the experience with a calm  harmony.<br/>\n<br/>\r\nDo you want a break from your hectic day and just be free? Refuge yourself in the serenity of ERMO.<br/>\r\nAnd then you will continue to think of ERMO and be in its world, even when you've left.<br/>\n<br/>\r\nHOW TO PLAY<br/>\r\n- Shift the blocks in horizontal and vertical, by row or by column<br/>\r\n- Line up blocks to make columns each with a single color<br/>\r\n- Do not exceed the number of moves available<br/>\r\n- Remove special items that halt the block lines<br/>\r\n- Avoid obstacles and dangers<br/>\n<br/>\r\nERMO includes mind bending puzzles requiring brain thinking. You have to master logic reasoning and problem solving, while facing puzzles from different point of views.<br/>\n<br/>\r\nFEATURES<br/>\r\n- Simple rules, intuitive mechanics and profound gameplay full of surprises<br/>\r\n- 60 unique levels with several stages with 200+ block puzzles<br/>\r\n- Hand-crafted balanced difficulty to make each puzzle always challenging<br/>\r\n- 4 different intriguing modes to test your brain in different ways<br/>\r\n- Special skills to have relax in moments of stress<br/>\r\n- Player experience progression with goals to achieve and earn rewards<br/>\r\n- Challenges! Share levels you completed with friends<br/>\r\n- BONUS levels with easy item collecting to refill your stocks<br/>\r\n- Full featured Level Designer! Make your own levels, solve and share them!<br/>\r\n- Ethereal graphic design giving harmony and inner peace<br/>\r\n- Adaptive and immersive experience: ERMO runs beautiful maximized or windowed.<br/>\n<br/>\r\nTheme support with a polished and curated level design with marvelous colors and amazing visual aesthetics.", "metacritic": null, "released": "2017-10-24", "tba": false, "updated": "2019-08-28T22:04:06", "background_image": "https://media.rawg.io/media/screenshots/585/58519536ff60264e340b32d2a659fcfe.jpg", "website": "http://www.nonostante.io/games/ermo", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 80, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC", "Linux", "iOS"], "developers": ["Nonostante Games", "Giuseppe La Torre"], "genres": ["Board Games", "Casual", "Indie", "Puzzle"], "publishers": ["Self-Published", "Giuseppe La Torre"], "esrb_rating": null}