{"id": 491220, "slug": "hvor", "name": "HVOR", "name_original": "HVOR", "description": "<strong>HVOR</strong> is a new horror game that you can play on your own or with friends.<br/>First of all, the game is aimed at the cooperative mode.<br/><br/>The action takes place in a world that was hit by a previously unknown disease. <br/>The disease-irrevocably causes living organisms to mutate turning them into monsters-the brain of which dies leaving only the animal instinct-to destroy all who are not yet affected. Since the outbreak of the epidemic, years have passed, the planet now belongs to zombie mutants-time has no power over them, not living but not dead, their souls have left, leaving the body of an evil monster in a world in which there is no more compassion and pity. Kill or die.<br/><br/>The game is designed for co-op mode. You must create a game session or connect to an existing one. When creating a session, you can specify the map, game mode, and select the character you want to play(if available). When you change these parameters, the description of what the player needs to do to win will change.<br/><br/><strong>SURVIVAL </strong>mode.<br/>You need to hold out until the countdown timer stops. A certain number of lives are allocated for the entire team. <br/>Your rivals are only zombies. Be careful you can hurt your teammates. At the level of enough different supplies and weapons.<br/><br/><strong>RAT</strong> mode.<br/>Rats are able to adapt to any conditions. Their incredible adaptation skills are a possible key to saving civilization. <br/>Collect dead carcasses of rodents in the \"Rat\" mode and make every effort to catch these small creatures in pitch darkness.<br/><br/><strong>GENERATOR</strong> mode.<br/>The world has changed, but not faded. <br/>During the zombie apocalypse, some areas still maintain energy balance.<br/>Replenish fuel supplies in the \"Generator\" mode to the last ray of light.", "metacritic": null, "released": "2020-07-10", "tba": false, "updated": "2020-09-11T00:33:21", "background_image": "https://media.rawg.io/media/screenshots/afa/afa55e84d37b9adb5f473a2221261f11.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 253, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["offmonreal", "Alex Fedorchenko", "Andrey Antonov", "Kirill Fedishin", "Andrey Zuev"], "genres": ["Action", "Massively Multiplayer", "Indie"], "publishers": ["OFFMONREAL GAMES"], "esrb_rating": null}