{"id": 491281, "slug": "qia-pai-you-xi", "name": "卡牌游戏", "name_original": "卡牌游戏", "description": "Card Killer is a high death rate game of survival, combined with masculinity, survival, thriller, suspense reasoning and other elements.<br/>\r\nThe world of cards, waiting for you to experience.<br/>\r\nThere are two main lines you can choose from the story - the male line and the female line. Meanwhile, you can also choose different talents as you like.<br/>\r\nWelcome to the cards world. Choose your own card color. Get ready for an unusual fight.<br/>\r\nAs long as you can fulfill the task and survive successfully, all your wishes will come true!<br/>\r\nAfter each games, you will be given the right to return to the original world three days. You have to draw one card per round. At the same time, if you want to go to the next level, you must know the card content of a player. During this period, you can choose to form an alliance or fight alone. You can go to the next level as long as you finish it within the specified time.<br/>\r\nShen Xuan: He is independent, more ruthless than her sister Shen Jing. He has many aspects, but he will also take responsibility. He will try to change the helpless situation, and will not be kind to those who should not. He is neither bloodthirsty nor foolish.<br/>\r\nIn order to find the girl whose brother has been persistent for five years. In the five years when her brother was away, she worked hard to grow up and became a cool, intelligent, courageous, even powerful girl, But like her brother, though powerful, she is still kind-hearted. It's these things that finally make her stand on her own in the card world.", "metacritic": null, "released": "2020-07-14", "tba": false, "updated": "2020-09-11T01:12:02", "background_image": "https://media.rawg.io/media/screenshots/ee5/ee54dd216adedf4dd0faa6c1118ff805.jpg", "website": "http://www.66rpg.com/index", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 206, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["橙光游戏"], "genres": ["Adventure", "RPG", "Strategy", "Casual", "Indie"], "publishers": ["橙光游戏"], "esrb_rating": null}