{"id": 491228, "slug": "raid-on-the-zone", "name": "Raid on the Zone", "name_original": "Raid on the Zone", "description": "Bring the battle to the mysterious terrorist organization dubbed The Zone, and race against the clock to stop their plans on unleashing a devastating biological weapon upon the world.<br/><br/><br/><br/>Pilot your unique dual-ducted fan combat helicopter to seek and destroy The Zone’s factories, air defenses and land forces while providing protection to your own aircraft carrier from brutal retaliatory attacks.<br/><br/><br/>Raid on the Zone is a tribute to the classic arcade games of the 80’s, featuring retro-inspired top-down 2D graphics in a procedurally generated gameworld. Your helicopter can be equipped with an arsenal of deadly weapons and countermeasures. But The Zone have nastry tricks up their sleeves and devastating weaponry of their own including anti-aircraft guns, missiles, radar jammers, fighter jets, bombers, tanks, and more.<br/><br/>This game isn't easy! So to help you in your assignment, you will be able to buy upgrades which greatly enhances your chances of success!<br/><br/><br/>The Zone is active on all fronts, requiring your attention and trigger finger to be ready at all times.<br/><ul><li>Attack and destroy facilities on land to slow The Zone’s ability to construct their deadly super weapon<br/></li><li>Destroy runways to prevent enemy planes from entering the fight<br/></li><li>Take out enemy boats in the sea to prevent them from targeting and attacking your aircraft carrier, your hub for rearming and repairs<br/></li><li>Protect civilians from both enemy and friendly fire<br/></li><li>Put a final end to The Zone by finding and destroying their super weapon factory</li></ul>", "metacritic": null, "released": "2020-07-10", "tba": false, "updated": "2020-09-11T00:39:01", "background_image": "https://media.rawg.io/media/screenshots/2e6/2e6c79074eb134ff87c6b9e5a71c3d53.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 19, "ratings_count": 0, "suggestions_count": 123, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Nikolaj Piet Pagh"], "genres": ["Action", "Indie"], "publishers": ["Nikolaj Piet Pagh"], "esrb_rating": null}