{"id": 491339, "slug": "my-isekai-after-life-is-an-rpg", "name": "My Isekai After Life is an RPG!?", "name_original": "My Isekai After Life is an RPG!?", "description": "Die and become reborn into a new world! Battle unique monsters, farm materials, and converse with beautiful goddesses to recruit them to your team! Enjoy yourself in the isekai world of your dreams~~<br/><br/>Current Features:<br/>Spells to purchase and assist in your adventures.<br/>Converse in comical dialogue with 4 goddesses and other characters.<br/>A large world to explore, meet new people, defeat monsters, and farm materials in.<br/>Boats! Because what else is better than sailing around the world searching for magic spells and treasure!<br/>RPG style turn based combat against multiple unique enemy's, including a gun-wielding frog, watch out!<br/><br/>Planned Features:<br/>Emotions and Emotes for every character is the first thing we want to add!<br/>Multiple new characters to converse with, and updated art for all of the characters.<br/>More spells to use, and more monsters to kill them with. More islands and biomes too!<br/>Customizeable character and customizeable home-base, create the mansion of your dreams! (Customizeable base started!)<br/>Anything else our community suggests, this game will be updated multiple times after release. We have a thriving discord community and we cannot wait to see what else everyone suggests for the game!<h3>*Spoilers Below! Sneak Peak at the introductory dialogue</h3><br/>Fina:<br/>Congratulations, you are dead.<br/><br/>Player:<br/>\"I'm sorry WHAT!?\"<br/><br/>Fina:<br/>Wait, that came out wrong.. I meant to say, I am sorry to inform you of your death.<br/><br/>Player:<br/>\"Oh, gee... thanks..\"<br/><br/>Fina:<br/>Anyway's, I am Fina. I am in charge of your reincarnation. Since you lived a good life, you've been given the option to choose your after life!<br/><br/>Player:<br/>\"I spent my whole life playing video games and watching cartoons, you call that a good life?\"<br/><br/>Fina:<br/>Well, you spent so much time being a loser, that you didn't have any time to kill or steal.<br/><br/>Player:<br/>\"That's weird, it almost sounded like you called me a loser just now.\"<br/><br/>Fina:<br/>Now then. What's it going to be NEET, perhaps you want to save a world from peril, or become a powerful king!<br/><br/>Player:<br/>\"I want to come back with you and live amongst all the other beautiful goddesses!\"<br/><br/>Fina:<br/>W-what!!", "metacritic": null, "released": "2020-07-17", "tba": false, "updated": "2020-09-11T01:47:36", "background_image": "https://media.rawg.io/media/screenshots/42f/42fd6970b17c0a4094f30684d9c4dd65.jpg", "website": "https://www.instagram.com/nyanko_games/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 110, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Nyanko Games"], "genres": ["RPG", "Casual"], "publishers": ["Nyanko Games"], "esrb_rating": null}