{"id": 491325, "slug": "zui-hou-de-da-fa-shi-guang-ming-zhi-lu-last-archma", "name": "最后的大法师 光明之旅(Last Archmage Journey of Light)", "name_original": "最后的大法师 光明之旅(Last Archmage Journey of Light)", "description": "The legendary mage Merlin betrayed by his teammates in the Demon Wars, fall from one of the legendary heroes to a rookie mage, and embarks on a new journey. After all the ups and downs, love and hate, is he confused? Or will he forge ahead and take the journey of light to be the greatest mage in the land of magic? Complete weapon and equipment system, powerful magic system and various ways to use magic scrolls. Welcome to this Japanese open world exploration RPG turn-based game!<br/><br/>       In addition to the nine characters who join the main team, hundreds of unique NPCs will also appear.Unintended discoveries of treasures can significantly strengthen a character, instead of the traditional upgrade system. The areas of the game are left free to explore from the start. <br/><br/>        The combat system highlights the differences in resistance to the six types of magic: wind, fire, lightning, ice, light, and darkness. Different demons have different resistances to these six types of magic. The resistance of different demons to spells in the game cannot be directly observed.The various maps in the game are not marked with difficulty levels, while this could be done, the development team felt that it would ruin the authenticity of the game. After all, life is like a box of chocolates; you never know what the next piece will taste like. Furthermore, the weapons that characters from different professions can equip are different, and the vast majority of them have additional effects. <br/><br/>       What are you waiting for? Come on a journey through this wonderfully magical fantasy world!<br/>", "metacritic": null, "released": "2020-07-16", "tba": false, "updated": "2020-09-11T01:38:38", "background_image": "https://media.rawg.io/media/screenshots/b7c/b7c3e9d8a4d9362edf479a620c56bb0b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 353, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Flying Star Games"], "genres": ["Adventure", "RPG", "Strategy"], "publishers": ["Flying Star Games"], "esrb_rating": null}