{"id": 491308, "slug": "sex-poker", "name": "Sex Poker", "name_original": "Sex Poker", "description": "<p>Sex Poker brings the amazing world of high stakes poker to a whole new adult level. What happens in Sex Poker doesn&#39;t stay in Sex Poker for long. You enter the exclusive poker room where only the wealthiest players are allowed. Surrounded by Vegas&#39; hottest poker dealers and the finest first class accommodations. Show everyone that you are a serious card shark and the dealer of your deals might allow you to take her up to your high roller suite.<br />\nUtilizing fully animated lip sync characters, custom jiggle body physics, body fluid dynamics and hundreds of hand animated expressions and movements, Sex Poker strives to be one of the most entertaining mature games available on Steam.<br />\nOnce you pick the dealer of your choice you can choose her outfit and overall appearance before she escorts you personally to your exclusive poker table. Play well enough and be generous with your tips, and your personal dealer may strips bare for you and perform a personal lap dance in the VIP lounge. Among the multitude of options that you have at your disposal are skin type, hair style and color, as well and body customization for breasts, ass, and face. You can literally develop thousands of looks with your dealer to make her look like the girl next door or a completely bad girl that&#39;s ready to take you up to your room and go wild.<br />\nEach character has fully articulated lip sync that adds to the realism and immersion as they speak their requests and responses in a way that you have not seen before in mature themed gaming. Earn orgasm power while you pleasure your partner then advance to the climax boss battle for a happy ending all over your personal dealer.<br />\nThis game is intended for players 18 year of age or older. All content is fully mature and does not include censors or any required patches to view the fully nude content. As this game is early access, features and content to this game will be added on a regular basis. The developer seeks input directly from players as to future scenarios and additions to existing situations which can be enhanced.</p>", "metacritic": null, "released": "2020-07-16", "tba": false, "updated": "2020-09-11T14:18:29", "background_image": "https://media.rawg.io/media/games/690/6901e1aed51d45b1d60df215d0dcb9e4.jpg", "website": "http://www.somavision.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "toplay": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 407, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["SomavIsion Games"], "genres": ["Simulation"], "publishers": ["SomavIsion Games"], "esrb_rating": null}