{"id": 49134, "slug": "critters-cute-cubs-in-a-cruel-world", "name": "Critters - cute cubs in a cruel world", "name_original": "Critters - cute cubs in a cruel world", "description": "This world has many secrets (final version) and it shows in strangely familiar looking mountain ranges and a mysterious fog surrounding these Lands.<br/>There is life everywhere and everything flourishes naturally, those are virgin lands, untouched by humankind and it shows.<br/>The weather, while predictable most times, can be very harsh. <br/>Hot Deserts, eerie swamps and ice cold snowy mountains, are surrounding this World, it seems almost as if something wants to prevent you from going too close to the edge, where the impenetrable and quite deadly Mists are. Sometimes you think, you can see shadows moving through them...<br/><br/><br/>features:<br/>explore the world on your own or with your cubs<br/>evolve and adapt to weather conditions and other challenges<br/>uncover the story of these lands and it's inhabitants<br/>watch fruits regrow on bushes<br/>get sucked into the tornado<br/>watch your cubs die in lots of different ways<br/>feed your cubs<br/>start a new generation (visit a den)<br/><br/>*Computer spec based \"infinite\" spawn and kill of cubs (press K or L on keyboard)<br/><br/><br/><strong>if you read this all and are still insecure if this game is for you, here a little help:</strong><br/>Do you like animals and fantasy? <br/>Do you like cute, but also are craving for a new survival challenge?<br/>Are you liking animals?<br/>Do you like Cartoons/Anime?<br/>Do you like to wander around aimlessly in hopes of stumbling on something interesting?<br/>Do you like to watch little creatures grow?<br/>Are you interested in Genes and Biology?<br/>Are you curious about Environments around you and the animals that inhabit them?<br/>Are you wanting kids of your own?[/list]<br/><br/>If you responded \"Yes\" to all or most of them, you would likely enjoy the game ;)", "metacritic": null, "released": "2017-11-06", "tba": false, "updated": "2019-08-28T22:04:05", "background_image": "https://media.rawg.io/media/screenshots/3f3/3f373b6059f35d6f148e658f362df6f6.jpg", "website": "http://www.embersparkz.com/critters.html", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 243, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["EmberSparkz"], "genres": ["Indie"], "publishers": ["EmberSparkz"], "esrb_rating": null}