{"id": 491335, "slug": "illuminati-simulator-vr", "name": "illuminati Simulator VR", "name_original": "illuminati Simulator VR", "description": "Illuminatti Simulator VR <br/>\n<br/>\r\nThis simulator, features a real and completely accurate Freemasonry temple. as well as an Ordo Templi Orientis Gnostic Mass working lodge...   <br/>\r\nit is an Experience more than a game. when you purchase this title you can expect to be teleported to a virtual freemasonry lodge where you will be able to perform any ritual you may want in a safe place. <br/>\n<br/>\r\nits configuration makes it work for members of the Ancient and Accepted Scottish Rite of Freemasonry (the Northern Masonic Jurisdiction). and also workable for the Duncan's Masonic Rituals , Martinist Order,  Thelema and Ordo Templi Orientis and of course the French ancient and accepted rite. <br/>\n<br/>\n<br/>\n<br/>\n<br/>\r\nit everything started when COVID-19 pandemic caused some fraternal organizations to close up meetings, and not everyone can afford or have the space or family support to hold a gnostic mass or other similar temples at home.  by grabbing this to your steam library you will be able to log in and immediately start performing your fraternal duties.<br/>\n<br/>\r\nit lacks a tutorial on purpose, because it keeps secret what it needs to be kept secret. but if you are a real member you will find it extremely accurate when you perform the right secret moves .  If you are a gamer and you are looking on this game for some fun , consider it as a very hard puzzle where you have to put things in certain places and perform certain moves to unlock more levels.  there are more than 33 levels.  if you are a member of any order or fraternity the game wont be hard to beat for you, but if you are a profane you may most likely wont pass the first level. <br/>\n<br/>\r\nthe multiplayer option will be coming soon, please support the game and wait some months... when its done an update will be released", "metacritic": null, "released": "2020-07-17", "tba": false, "updated": "2020-09-11T01:44:13", "background_image": "https://media.rawg.io/media/screenshots/608/60850226a5bc2d4f6d68d1925c8b437e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 138, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ricardo Alonso Pina"], "genres": ["Simulation"], "publishers": ["Ricardo Alonso Pina"], "esrb_rating": null}