{"id": 491393, "slug": "teenage-blob-paperperson-the-first-single", "name": "Teenage Blob: Paperperson - The First Single", "name_original": "Teenage Blob: Paperperson - The First Single", "description": "Team Lazerbeam and The Superweaks invite you to rock out with Paperperson, the lead single from their upcoming game/ album split release, Teenage Blob!<br/><br/>In Paperperson you play an amorphous teen and you’re about to see your favourite band, tonight is going to be the greatest night of your life! There’s just one problem: before the gig you want to buy some new boots, and before you can do that you’re gonna need to work your butt off! Time to grab your bike, hit the streets of the suburbs and throw sandwiches at everything that moves!<br/><br/><ul><li>Throw sandwiches into the postboxes of customers!<br/></li><li> Smash the windows of non-subscribers!<br/></li><li> Defy your boss and feed the adorable neighborhood dogs!<br/></li><li> Deliver justice (sandwiches) to heads of cat-calling creeps!</li></ul><br/>Paperperson is a free single to celebrate the upcoming release of Teenage Blob! To experience the entire tale of bands, butts and bootleg battlet0adz, be sure to wishlist Teenage Blob!<br/><br/>Paperperson is a very short game, that has been made for players who demand \"shorter games with worse graphics made by people who are paid more to work less\". We are happy to provide this service to players that are sick of games that waste player time and squander the lives of developers. The Paperperson demo will only take you about 6 minutes play. Please enjoy this short playable experience, and whatever you chose to do with the rest of your time! If you'd like to help us on our quest to make the world a cuter/ weirder/ cooler place, please consider sharing this demo with somebody awesome!", "metacritic": null, "released": "2020-07-20", "tba": false, "updated": "2020-09-11T02:21:01", "background_image": "https://media.rawg.io/media/screenshots/20b/20b3af89ee903edb68398c3470b65987.jpg", "website": "https://www.teamlazerbeam.com/teenage-blob", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 5, "ratings_count": 0, "suggestions_count": 67, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Team Lazerbeam", "The Superweaks"], "genres": ["Adventure", "RPG", "Simulation", "Sports", "Casual", "Indie"], "publishers": ["Superhot Presents", "Team Lazerbeam"], "esrb_rating": null}