{"id": 491381, "slug": "elliot-2", "name": "Elliot", "name_original": "Elliot", "description": "<h3>You looking for hell? Congratulations, you found it!</h3><strong>What do you mean, impossible? Ok, let's explain...</strong><h3>A colourful hell. </h3>Elliot is a colourful 2D platformer inspired in 16-bit classics yet with a hardcore touch. Don't be fooled by appearances, it's a tough game! Run, jump and dash through over 60+ levels to solve the mystery surrounding the World of Elliot, Manuel and the adorable Mombas.<h3>Need to know more?</h3>Elliot, that loveable little blue ball, is a Momba, a wild, free, musical creature who lives alone in the natural world. Well, not entirely alone: with his friend, Manuel. But one apparently ordinary day, strange things begin to happen.<h3>How to play?</h3>It's easy: run, jump and dash in any direction. Die, come straight back and die again.<h3>What will you find?</h3><ul><li>Two loveable characters, Elliot and Manuel.<br/></li><li>Collectibles to help you discover the story of Elliot's World.<br/></li><li>You yourself, making titanic efforts to get through the 60-plus levels in 11 chapters.<br/></li><li>Stress, frustration and possibly rage. but don't worry, the soundtrack will make everything much easier.<br/></li><li>Speedrun mode, if you want to break personal records or challenge your friends.<br/></li><li>Achievements, in case the ordinary game itself leaves you in need of more.</li></ul><h3>Love letter to platformers:</h3>Elliot is our lil' love letter to the genre. If you dig platforms and challenges, we promise you're gonna love this experience.", "metacritic": null, "released": "2020-07-19", "tba": false, "updated": "2020-12-25T04:14:16", "background_image": "https://media.rawg.io/media/screenshots/5b8/5b83a435c9e0e00320f9164b30c44a6e.jpg", "website": "https://elliotgame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 382, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "PlayStation 4", "Xbox One"], "developers": ["Plain and Game"], "genres": ["Action", "Indie"], "publishers": ["Plain and Game"], "esrb_rating": null}