{"id": 49136, "slug": "the-drg-initiative", "name": "The D.R.G. Initiative", "name_original": "The D.R.G. Initiative", "description": "The D.R.G. Initiative is a 3rd person team combat shooter, focussed on pure competitive play, set in purpose built arenas.<br/> <br/>The game is team elimination and the team with the last man/woman standing wins the round.  Each player gets to pick two different characters per round and you can switch between them during the game by using the swap-pods found in the arena.  Once your first character is killed you auto switch to the next one, now you have to stay alive to try to win the round or you’re permanently dead and out of the round, no further respawning!<br/><br/>The other team are not the only foes to deal with, the Addicted are the raging, primal human monsters that are released into the arena for sport and spectacle.  They have nothing left to live for and all they are interested in is…... you and your untimely end.<br/> <br/><br/>Ammo and health packs are scarce commodities in The D.R.G. Initiative, so go easy on the spray and pray.  Working as a team is the critical winning formula.  Whether it's securing more Ammo or Health, dealing with the Addicted or of course finding and dispatching the opposing team. We highly recommend using a voice chat system.<br/><br/>Mastering specific factions and levelling up your characters and factions together is a key part of winning. At the Early access launch, we have 2 in the game (which come as part of the Pioneers Faction pack, exclusively for Early Access).<br/><br/> <br/> <br/><br/><br/> <br/> <br/><br/>We have 9 more on the design table and as part of our community we are going to let you guys decide which faction you want to see added next to the game.<br/><br/>We are currently at the early stages of development, we have come pretty far, pretty quickly and we will be soon releasing a closed alpha build that will allow us to take your feedback and iron out some more kinks, before the early access release in late 2017<br/><br/><br/>And finally, but not least, if you fancy being the Games Master* of The D.R.G. Initiative, now you can be!  This special mode allows you to run the TV show - deciding what happens in the arena, what gets broadcast to the global population and making sure the very best entertainment keeps the viewers at home entertained.  <br/> <br/>We give you a complete broadcast command centre to run the TV show from and if you decide to stream your show to Twitch (or other supported streaming services) then your audience at home can get involved too with live voting and cheering.  We have a lot of features we are going to be adding to this mode during the Early Access release period. <br/><br/>(*) Games Master mode is optional, and can be disabled for tournaments and events.<br/><br/><br/> <br/> <br/>The Leaders of the new world order needed a radical approach to discourage criminality and remind the population of the deadly threat of the Addicted.<br/><br/>The first shows were never intended to be what they have become today.  Originally a one-time only, globally broadcast event that showed how crimes would be punished if you chose to take that path.<br/><br/>Each of the enclaves that survived the old world destruction entered an Enforcement squad of their best fighters and hunters.  They were heavily armed and well trained.<br/><br/>They were pitched against teams of the worst of the criminals that had been rounded up and condemned.<br/><br/>The shows were huge, and the population begged for more.  It didn't take long for Leaders to sign-off on the Enforcement squads taking on each other.  And the popularity soared to new unimaginable heights as people tuned in to watch the Gladiatorial battles between Earth's surviving factions.<br/><br/>And with that, The D.R.G. Initiative was born.   Welcome, to the greatest show on Earth!", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-23T12:12:11", "background_image": "https://media.rawg.io/media/screenshots/4bc/4bcda950a1f2cf25891e6b65952fd116.jpg", "website": "https://thedrginitiative.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 5}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 639, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Third Kind Games", "Slingshot Cartel"], "genres": ["Action", "Indie"], "publishers": ["Slingshot Cartel"], "esrb_rating": null}