{"id": 491417, "slug": "dungeon-scale", "name": "Dungeon Scale", "name_original": "Dungeon Scale", "description": "Dungeon Scale is a couch multiplayer dungeon scaling game for 2-4 players that’s inspired by the coin collecting classics of our age.  Dungeon Scale’s core mechanics are simple yet fun, reach the top before your opponents, whilst collecting as many goodies as you can along the way.<br/><br/>The game features eight unique dungeons each with increasing zones of difficulty that you can challenge with 1 to 3 of your closest friends or family members. There are four different scenarios ranging from 3 to 6 combined levels depending on how long you would like your adventure to last. Each level ends in a score screen awarding the fastest and best followed by a shop where you can purchase life, ammo and various upgrades. You can also grab a bomb or two, to rain down fiery death on the leaders. A balancing option is included to make sure that the more skilled players will face a harder challenge and make for a closer game.<br/>Do your best to win as a team or on your own as the fates of the losers will be decided on the final podium. <br/><br/><strong>Features include:</strong><br/><br/>-\t20 unique characters in four different classes (ninja, wizard, hunter and gunslinger class)<br/>-\tController support for Xbox, PS4 and most generic controllers<br/>-\t4 player keyboard support with customizable controllers for each player<br/>-\t8 dungeons spanning 3 different themes<br/>-\t4 different scenario lengths - including Quest, Adventure, Epic and Legendary<br/>-\tA balanced difficulty option based on your rank<br/>-\tA fate system which grants the winner the ability to award or punish the losers<br/><br/><strong> DISCLAIMER </strong> Please be aware Dungeon Scale is currently MULTIPLAYER ONLY and does not feature a single player campaign at this stage.", "metacritic": null, "released": "2020-07-21", "tba": false, "updated": "2020-09-11T02:35:12", "background_image": "https://media.rawg.io/media/screenshots/c14/c14b37bf060107d756ac99d4cc5930db.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 288, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Midnight Fair Games"], "genres": ["Action", "Adventure", "RPG", "Casual", "Indie"], "publishers": ["Midnight Fair Games"], "esrb_rating": null}