{"id": 491420, "slug": "summertime-madness", "name": "Summertime Madness", "name_original": "Summertime Madness", "description": "<p>Summertime Madness is a single-player first-person puzzle game.<br />\nThe player, in the role of a painter who has made a deal with the devil, has to find his way back to the real world after being cheated and trapped into one of his canvases. A dreamlike journey into a surreal world of the artist’s own creations where the atmospheric gameplay provides mysteries to discover, puzzles to solve and artistic landscapes to explore.<br />\nGAMEPLAYYou find yourself on an evolving island.<br />\nAs you investigate your surroundings, the island will start to change. The appearance of a ship, the rise of a lighthouse, each mystery you uncover and puzzle you solve will unfold new wonders and unveil new places to explore. But be forewarned, the scene you find yourself in, this breathtaking land of paint and oil is not always as straightforward as it appears. This intriguing world within the canvas holds more mysteries than even the artist intended.<br />\nSTORYPrague<br />\nJuly 20th 1945<br />\nThe city of Prague was under siege, ravaged by war.<br />\nBuildings were falling, churches were burning, and everything was to be washed away forever.<br />\nA painter lived there, isolated from the outside world. The worse the terrors of war became, the more the artist obsessively painted beautiful landscapes as a contrast to the evil he had witnessed. One night, a mysterious figure appeared in the house seemingly out of nowhere. The stranger walked slowly around the room, inspecting the paintings. He then sat down in front of the artist; to offer him a deal.<br />\nThe chance to enter one of his own creations, far away and free of war. But he would have to find his way back out before midnight, or else his soul would become trapped in the canvas forever. Feeling alone, on the edge of madness, terrorized by the scent of death creeping in from the streets, the artist shook the mysterious man&#39;s hand, accepting the deal.<br />\nA few moments later, the house was empty.<br />\nKEY FEATURESUnique artstyle and a surreal environment to exploreA collection of clever puzzles that will challenge your creativityAn ever-changing world that develops as  you progressHidden secrets to find</p>", "metacritic": 66, "released": "2021-06-17", "tba": false, "updated": "2023-12-06T10:55:37", "background_image": "https://media.rawg.io/media/screenshots/c05/c05fd99bcc8482aebcf83535a0ebdf85.jpg", "website": "", "rating": 3.0, "rating_top": 3, "added_by_status": {"yet": 12, "owned": 41, "beaten": 4, "toplay": 7, "dropped": 2}, "playtime": 6, "achievements_count": 28, "ratings_count": 5, "suggestions_count": 300, "game_series_count": 0, "reviews_count": 6, "platforms": ["PlayStation 5", "PlayStation 4", "Xbox One", "Xbox Series S/X", "Nintendo Switch", "PC", "macOS"], "developers": ["DP Games"], "genres": ["Adventure", "Indie"], "publishers": ["Sometimes You"], "esrb_rating": "Everyone"}