{"id": 491537, "slug": "kongfusion", "name": "Kongfusion", "name_original": "Kongfusion", "description": "<h3>KONGFUSION: KUNG FU MADNESS IN VIRTUAL REALITY!</h3>Kongfusion is an action packed kung fu rhythm experience where the player takes on a horde of space kung fu masters. Slam into your opponents on the beat and show everyone who's boss with a variety of weapons.<br/><br/><br/><ul><li>Battle with your fists, the kung fu staff or cut through your enemies with daggers.<br/></li><li>Fight alien kung fu masters while dodging projectiles.<br/></li><li>Beat all high scores in arcade mode or test your luck and stamina in infinite mode.<br/></li><li>Fight in multiple futuristic settings designed to fit the music.<br/></li><li>A young trainee starts all maps on easy and leaves a master at hardcore.<br/></li><li>Kung fu is a serious sport, Kongfusion builds actual stamina.</li></ul><h3>MASTER THE ART OF KUNG FU:</h3>Begin Kongfusion on easy mode and grow into a master on hardcore mode. Leave a sea of alien bodies as you complete your path to glory.<h3>A VARIETY OF WEAPONS</h3>A true kung fu artist can wield a variety of weapons. You shall do so as well; your bare hands will help you unlock multiple weapons to obliviate your foes.<h3>A MUSIC WORKOUT</h3>Slam, punch and cut your enemies to the rhythm of the music. Dance and martial have never been so closely linked. Make it a morning routine and watch those pounds fly away.<br/><br/><br/>", "metacritic": null, "released": "2020-07-28", "tba": false, "updated": "2020-09-11T03:53:11", "background_image": "https://media.rawg.io/media/screenshots/4ba/4baf0cf2c19709fdb3d9564884c72519.jpg", "website": "http://www.kongfusion.io", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 435, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ZMVR"], "genres": ["Action", "Simulation", "Sports", "Casual", "Indie"], "publishers": ["Leka Games"], "esrb_rating": null}