{"id": 491509, "slug": "arcadium", "name": "Arcadium", "name_original": "Arcadium", "description": "In Arcadium the main goal is to break all the bricks on each level using a paddle and a ball, if the ball passes the paddle and leaves the screen you lose a life. There are however some special levels where the goal is something else and also levels where you fight a boss.<br/>\n<br/>\r\nThroughout the levels you can get powerups such as being able to fire laser, bigger paddle and more balls, get points to get high up on the leaderboard and also to get extra lives. You can also get permanent powerups which will not be lost when you lose a life or go to the next level.<br/>\n<br/>\r\nYou use the mouse to control the paddle and the left mouse button to fire the ball or use weapons, the keyboard is used to scroll through the menus and also to pause the game. You can choose between three difficulty settings and also adjust the volume of the sound effects and music, there is also an option to turn off the permanent upgrades for a more challenging gameplay.<br/>\n<br/>\r\nIf you are a big fan of the old brickbreaker games such as Arkanoid and Breakout you are definitely gonna enjoy this game as it have similar features but also adds something new.<br/>\n<br/>\r\nKey Features:<br/>\n<br/>\r\n*   Classic brickbreaker levels<br/>\r\n*   Special levels<br/>\r\n*   Boss fights<br/>\r\n*   Powerups<br/>\r\n*   Permanent powerups<br/>\r\n*   Three difficulty settings<br/>\r\n*   Achievements<br/>\r\n*   Leaderboard", "metacritic": null, "released": "2020-07-27", "tba": false, "updated": "2023-08-31T16:41:59", "background_image": "https://media.rawg.io/media/screenshots/082/082f70fc22ccc81b62a395409e5bcb7c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 238, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Gedor Games"], "genres": ["Action", "Indie"], "publishers": ["Gedor Games"], "esrb_rating": null}