{"id": 491505, "slug": "aeon-on-mosaic-anemone-shi-jian-sui-pian-qi-ji", "name": "Aeon on Mosaic: Anemone 时间碎片：奇迹", "name_original": "Aeon on Mosaic: Anemone 时间碎片：奇迹", "description": "\"Aeon on Mosaic\" is a series of time-themed text adventure games, each chapter will be an independent story, you need to play different roles to explore their stories. \"Aeon on Mosaic: Anemone\" as the prologue of the series of games, tells the stories that Convallar deeply buried in his heart. In an accident, he met the hit girl Ruta, and the trajectory of his life has changed since then.<br/><br/>But is this really the case?<br/><br/><br/>● <strong>Game time: 1-2 hours</strong><br/>● <strong>Dubbing of the main character throughout the process (non-main perspective)</strong><br/>● <strong>9 carefully drawn game CGs (without difference)</strong><br/>● <strong>More surrounding stories and eggs waiting for players to discover</strong><br/><br/><br/><br/><br/><strong>Convallar</strong><br/>Freshman students majoring in journalism are responsible for the maintenance of the school forum in the Youth League Committee. He is not good at expressing his thoughts in language, and likes to record everything he sees and thinks into words. He is very confident in his writing, dreaming of becoming a writer, and opening a dessert shop with his beloved.<br/><br/><br/><strong>Ruta</strong>　CV: <strong>Xianta Wutong</strong><br/>Although the freshman major in journalism is in the same class as Convallar, there is no intersection between the two. Introverted personality, inexplicable hostility to unfamiliar people, but many words to familiar people. Like to read novels, she seems to have a strong interest in a person who frequently updates articles on the school forum.<br/><br/><br/><strong>Oncidion</strong>　CV: <strong>Pingguojiang</strong><br/>A freshman student in computer science and a friend whom Convallar met at the school's literary club. The two often play games together and share stories and ideas. On the surface, he is outgoing and outgoing, but he is very shy in his feelings. Secretly love Ruta, but don't know how to convey this feeling.<br/><br/><br/><strong>Cerasa</strong>　CV: <strong>Xiange</strong><br/>The elusive and mysterious girl always holds her black rabbit doll Bab. On the surface, she doesn't care about anything, but maybe a dessert can buy her.<br/><br/><br/><strong>Gerberon</strong>　CV: <strong>Fengming</strong><br/>The mysterious man who followed Cerasa was often bullied by Cerasa because he was honest. Act very cautiously and carefully, and strive to do everything perfectly.", "metacritic": null, "released": "2020-07-30", "tba": false, "updated": "2020-09-11T03:31:57", "background_image": "https://media.rawg.io/media/screenshots/477/4779cbeed02a7eaa4d2103bd3ea79995.jpg", "website": "http://weibo.com/u/1287114400", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 362, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "Linux", "PC"], "developers": ["Fantasia Studio"], "genres": ["Adventure", "Indie"], "publishers": ["Fantasia Studio"], "esrb_rating": null}