{"id": 49159, "slug": "the-sun-origin", "name": "The Sun: Origin", "name_original": "The Sun: Origin", "description": "In the year 2050, the sun unleashed a catastrophic surge of energy into space, a wave of power that would plunge our civilization into chaos for centuries. Though predicted for years by the scientific community, their warnings were ignored by the world leaders that instead squabbled over petty territorial concerns.<br/><br/>When the wave of energy struck the earth, a storm of radioactive particles blanketed the atmosphere in a deadly, carcinogenic fog. The fog killed indiscriminately … the young, old, rich and poor all fell in equal measure. Only those that had heeded the warnings and taken shelter in abandoned bunkers were spared. <br/><br/>When their supplies eventually ran out and these communities were forced to emerge from their shelters, they saw a new world of desolation and chaos. A world in which the laws of civilization had been replaced by the law of the gun. The few areas that still had clean water and arable land were held by ruthless warlords and their armies.<br/><br/>It was in this world that a warrior known only as Raven would emerge. A warrior that would save his people by bending the wasteland to his will. A warrior that would one day become a legend.<br/><br/>- Explore a merciless wasteland in an immersive, first-person view.<br/>- Manage scarce resources such as ammunition, food and medical supplies.<br/>- Brave the dangers of the wasteland and face off against humans, rabid hounds, ghouls and raiders.", "metacritic": null, "released": "2017-10-21", "tba": false, "updated": "2022-11-13T19:54:23", "background_image": "https://media.rawg.io/media/screenshots/4e5/4e542f7945274c389c22da011c196711.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 185, "game_series_count": 0, "reviews_count": 2, "platforms": ["iOS", "Android"], "developers": ["AGaming+", "Igor Migun"], "genres": ["Action", "RPG"], "publishers": ["Igor Migun"], "esrb_rating": null}