{"id": 491549, "slug": "galvatia", "name": "Galvatia", "name_original": "Galvatia", "description": "In the game, as a nature lover, you have to explore several environments<br/>\r\nsuch as the African savannah, the Amazon rainforest, the ocean, a<br/>\r\nmixed forest and a meadow.<br/>\n<br/>\r\nYou act as a discoverer whose objective is to solve tasks, get money to<br/>\r\nthe rescue fund and ensure the return of animal species that no longer<br/>\r\nexist in the environment or are about to become extinct. There is free<br/>\r\nmovement in the game and you can analyze anything you click. You can<br/>\r\ntake the eyes of animals, observe them, swim underwater or fly. Unlock<br/>\r\nindividual species on extensive maps and search for them and, of<br/>\r\ncourse, learn interesting things.<br/>\r\nTake pictures and learn something interesting about every species in<br/>\r\nthe game. Photos are stored in your own gallery. The game is based on<br/>\r\ndiscovery and rescue, it does not contain any violence.<br/>\n<br/>\r\nGalvatia contains<br/>\n<br/>\r\n- maps of five environments measuring 250x250 m (African savannah,<br/>\r\nAmazon rainforest, ocean, mixed forest, meadow)<br/>\n<br/>\r\n- about 250 unique animals, plants and trees in various variations<br/>\n<br/>\r\n- 50 tasks to complete, for which you get play money to the rescue fund<br/>\n<br/>\r\n- Game money is also used for exploring anything in the game<br/>\n<br/>\r\n- launching rescue operations for 15 endangered species. After rescuing<br/>\r\nthem, you will find them in the environment.<br/>\n<br/>\r\n- Ability to analyze anything by clicking on an object<br/>\n<br/>\r\n- After reviewing the automatic unlocking, search for the animal on the<br/>\r\nmap<br/>\n<br/>\r\n- photograph individual animals, plants and store them in galleries.<br/>\r\nDescriptions are automatically added to them.<br/>\r\n- you are invisible to animals, you can easily approach them<br/>\r\n- share your \"photo catches\" on Facebook and Twitter<br/>\r\n- the use of heart-shaped jokers to facilitate the task. Jokers are obtained<br/>\r\nfor every 2 completed tasks<br/>\r\n- information on the number of animals examined in the environment<br/>\n<br/>\r\n- information on the number of steps and also recording the route where<br/>\r\nyou walked. You can activate this option so that you do not walk in the<br/>\r\nsame places.<br/>\n<br/>\r\n- each environment has a preview of the map, it is possible to move<br/>\r\nthrough it or you can search for the position of animals on the map which<br/>\r\nyou have already unlocked by clicking on them<br/>\n<br/>\r\n- tons of information about everything alive in the game", "metacritic": null, "released": "2020-07-29", "tba": false, "updated": "2020-09-11T04:01:37", "background_image": "https://media.rawg.io/media/screenshots/286/28645ccf13a1207f60ac6d4819244555.jpg", "website": "https://www.facebook.com/galvatia", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 275, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dev.studio"], "genres": ["Simulation"], "publishers": ["Dev.studio"], "esrb_rating": null}