{"id": 491654, "slug": "ice-star", "name": "Ice Star", "name_original": "Ice Star", "description": "Hello!,  The story begins then the Colony on the Ice star is raided,<br/>\r\nand the mining spaceship is captured, the Captain must do<br/>\r\nsomething to save his men and the mining colony from the <br/>\r\nraiders.<br/>\r\nThe Game 3d shooter , includes many different items and weapons to use in game,<br/>\r\nInteresting mini quests as this is a shooter game with ammo and weapons,<br/>\r\nfree open scene world for this part of story, there you can move in any <br/>\r\ndirection, just be sure you are ready for the new challenge, and many <br/>\r\ncharacters that will tell you important information, but not all will be happy <br/>\r\nto share their information in some cases.<br/>\n<br/>\r\nIn game there are not only weapons and some items to use,<br/>\r\n there are -Score, you can get then you play and fight some enemy,<br/>\r\n and different -Statuses, that will change with time you play, this futures <br/>\r\nwill make you more friendly to the characters in game, and they will change<br/>\r\ntheir minds about you, some will like you some will not, depending on what <br/>\r\nyou are doing in the game, game will change.<br/>\n<br/>\r\nThank God , the Captain survives and escapes to the cold and dark planet <br/>\r\nsurface, He can not go back to the mining ship, and must do<br/>\r\nsomething to stop the raiders, but he is not alone, Big Boss, <br/>\r\nwho pays the raiders to control the area, is keeping a secret <br/>\r\nlaboratory  with partial stealth technology,<br/>\r\nand will do all to secure his business.<br/>\n<br/>\r\nUse keys, W,A,S,D to move, and mouse to look around,<br/>\r\n shoot and Zoom with weapons, F for flashlight, Shift to<br/>\r\nrun, E to use items in game, 1-9, 0, Weapons.<br/>\n<br/>\r\nThe story will change depend on your activity in game, <br/>\r\nThank and have fun.", "metacritic": null, "released": "2020-08-02", "tba": false, "updated": "2020-09-11T05:07:48", "background_image": "https://media.rawg.io/media/screenshots/d25/d25e7cc3a490273659eb09ee3a88efa0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 192, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Avisgames"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Avisgames"], "esrb_rating": null}