{"id": 491694, "slug": "operator-2", "name": "Operator", "name_original": "Operator", "description": "In <strong>OPERATOR</strong>, you will play as an elite \"Tier 1\" operator undergoing dangerous clandestine operations all across the globe. With a strategic, measured, and unforgiving style of gameplay. OPERATOR aims to be the ultimate tactical shooter with total realism in mind. Featuring realistic weapon handling, ballistics, injury, gore, and active ragdolls.<h3>[MASTER YOUR ENVIRONMENT]</h3><br/>Our goal is to fully immerse you in the game world. Making every interaction physically accurate such as opening/closing doors, interacting with switches, activating/deactivating night vision goggles, no automatic operation of firearms, and many more. Essentially VR gaming without the VR headset.<h3>[TEAM WORK MAKES THE DREAM WORK]</h3><br/>With multiplayer co-op in mind going up against the enemy solo is a risky endeavor that will most likely get you killed. Team up with your friends and use a variety of tools and special tactics in order to get the job done. At your disposal are many different types of breaching tools and grenades all with their own pros and cons to respect. Train hard together and leave nothing to chance.<h3>[UNPARALLELED CUSTOMIZATION]</h3> <br/><br/><br/>Tired of seeing the exact same boring weapon builds? Personalize your weapon and tune it to exactly how you like it! Strip the gun down to the receiver and build it from the ground up. Replace everything and add whatever you want! <strong>You</strong> define what's <strong>tactical</strong>.<h3>[PLAN ACCORDINGLY]</h3><br/>Choose how and where you will infiltrate and conduct your operation. Using available information from satellites, UAVs, and on-ground intelligence you will determine where, when, and how you will complete your objective. After completing your main objective, it's time to extract. Always make sure you have a plan B as your primary extraction might become compromised forcing you to find an alternative route.<h3>[TURN OFF THE LIGHTS]</h3><br/>Discover, locate, and swiftly manipulate breaker switches to gain a tactical advantage over your enemy.", "metacritic": null, "released": "2020-08-05", "tba": false, "updated": "2023-08-04T04:06:09", "background_image": "https://media.rawg.io/media/screenshots/159/1596cdf0345e1d8990271609af65edca.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 42}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 166, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Virtual Edition", "30 Matches", "Chemical Gaming Studios", "vector 2"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Simulation", "Indie"], "publishers": ["Virtual Edition", "30 Matches", "Chemical Gaming Studios", "vector 2"], "esrb_rating": null}