{"id": 491689, "slug": "brave-pinball", "name": "BRAVE PINBALL", "name_original": "BRAVE PINBALL", "description": "The dead man's mouth opened...<br/>\n<br/>\r\nThe sealed 'Demon Dragon King Boruaka' resurrected...<br/>\r\nThe world has been turned into a pinball.<br/>\n<br/>\r\nBrave Fol clutched his flipper blade in both hands,<br/>\r\nHe is going to take down the Demon Dragon King with his buddies!<br/>\n<br/>\r\n\"BRAVE PINBALL\" is a single type pinball game.<br/>\n<br/>\r\nThere are no difficult rules in this game.<br/>\r\nUse the left and right flippers to fly the brave, and<br/>\r\nDefeat a group of monsters led by the Demon Dragon King Boruaka!<br/>\r\nThat's all there is to it!<br/>\n<br/>\r\nThere are grasslands, forts, caves, forests, etc.<br/>\r\nA lot of enemies are placed on the various stages colored in the JRPG style.<br/>\r\nIf you want to go to a different stage, you need to have a good control technique over the heroes.<br/>\r\nYou will find the demon dragon king Boruca that lurks in the darkness, and you will be the first to find him.<br/>\r\nCan you bring peace back to the world?<br/>\r\n(The boss may not be alone...)<br/>\n<br/>\r\nOf course, it also has a high score challenge, which is very important in pinball!<br/>\r\nEach time you level up, the rate of increase in your score will increase.<br/>\n<br/>\r\nDuring the game, you will get a piece of treasure by defeating certain enemies and clearing various conditions.<br/>\r\nWhen all the pieces are collected, a hidden treasure will be revealed.<br/>\r\nYou'll have to see it for yourself!", "metacritic": null, "released": null, "tba": false, "updated": "2020-09-11T05:29:32", "background_image": "https://media.rawg.io/media/screenshots/cc6/cc68b2e1edbd4b2479387f560ff48be9.jpg", "website": "https://apollosoft.wixsite.com/pinbollua", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 321, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ApolloSoft", "POWER UNIT"], "genres": ["Casual", "Indie"], "publishers": ["APOLLOSOFT"], "esrb_rating": null}