{"id": 491607, "slug": "humankind-opendev", "name": "HUMANKIND - OpenDev", "name_original": "HUMANKIND - OpenDev", "description": "https://store.steampowered.com/app/1124300/HUMANKIND/?snr=1_5_1100__1100<h3>Welcome to HUMANKIND™ OpenDev!</h3><br/><br/>Getting feedback as early as possible from our players has always been our way of creating the best games we can. In fact, we designed the GAMES2GETHER platform and program 10 years ago to fill that missing link between our dev team and our players. <br/><br/>“Today, we're very excited to present OpenDev : a new way for players to get early access into our developing games so they can help us make sure we're on the right path.<br/>We're really excited to try this out with HUMANKIND™ -- we're looking forward to your feedback on our most ambitious game yet!\" - Romain de Waubert<br/><br/><strong>Introducing HUMANKIND™ OpenDev </strong><br/>OpenDev is our new approach to community-driven game development. It allows you to join the dev team and help shape the game during its production.  <br/><br/>Starting June 13th, register and get a chance to get access to 3 time-limited scenarios focusing on specific core features of the game (exploration, tactical battles, basic city management). Each scenario concludes with a game design survey that will help our dev team level-up the game! <br/><br/><br/><br/><strong>Register now!</strong><br/>Head over to http://opendev.humankind.game, register and get a chance to be one of the first to play HUMANKIND™. Once selected, you will receive a confirmation e-mail and the game will be automatically added to your Steam library. The number of players who get access will be increased as we release new scenarios, so stay tuned!<h3>QUESTIONS</h3><br/><br/><strong>How can I join? </strong><br/><br/>By signing up/logging in to Games2Gether, you will get access to a registering form. After answering a few questions about your gaming habits and PC specifications, you will be registered on the waiting list. If selected, you will later receive a confirmation email and HUMANKIND™ OpenDev will be added to your steam library automatically.<br/>Please note that you have to be 18 or over to join HUMANKIND™ OpenDev.<br/><br/><br/><strong>In what regions will HUMANKIND™ OpenDev be available? </strong><br/><br/>OpenDev will be available worldwide, but will only be playable in English. HUMANKIND™ will however be localized in several other languages at its release. <br/> <br/><br/><strong>I haven’t been selected for the first scenario, what can I do? </strong><br/><br/>OpenDev only has a limited number of spots, that will increase for each scenario release. Not having access to the first scenario does not necessarily mean that you will not get access to the next one. Keep an eye open on your inbox 😉 <br/><br/><br/><strong>Is OpenDev free? </strong><br/><br/>HUMANKIND™ OpenDev is completely free! <br/><br/><br/><strong>How long will the game stay in my Steam library ? </strong><br/><br/>HUMANKIND™ OpenDev is limited in time. Each scenario is accessible only for 4 days, and previously unlocked scenarios will remain playable during this period. Once these 4 days are over, the game will be removed from your Steam library.<h3>What mark will you leave on HUMANKIND™?</h3>", "metacritic": null, "released": null, "tba": false, "updated": "2023-02-02T22:37:08", "background_image": "https://media.rawg.io/media/screenshots/c98/c98679ecd581897c521033e5e29df147.jpg", "website": "http://opendev.humankind.game", "rating": 3.78, "rating_top": 4, "added_by_status": {"yet": 2, "owned": 256, "beaten": 4, "toplay": 2, "dropped": 4}, "playtime": 2, "achievements_count": 0, "ratings_count": 9, "suggestions_count": 370, "game_series_count": 0, "reviews_count": 9, "platforms": ["PC"], "developers": ["Amplitude Studios"], "genres": ["Strategy"], "publishers": ["SEGA"], "esrb_rating": null}