{"id": 491663, "slug": "epidemic-2", "name": "EPIDEMIC", "name_original": "EPIDEMIC", "description": "The game is set in a city isolated by a large number of infection cases. As a conscientious soldier, your original task was to guard a hospital, but before receiving the evacuation order, you were cut off from the headquarters because of infection. Now you will use this hospital as your base to defend against the increasing number of infected people, Recruit more homeless survivors in the city and explore the isolated city with them.<br/><br/><br/><strong>Game features:</strong><br/>Open world: you can explore the map and explore every corner of the city.<br/><br/><strong>Materials collection:</strong><br/>In the game, collect a variety of materials for the construction of the camp, to resist all kinds of deviant monsters in the doomsday world.<br/><br/><strong>Build camp:</strong><br/>Players will defend a hospital in the game. At the same time, the hospital is also the player's base. You can define and build various defense works by building various items. You can even change the terrain to create a variety of bases that are conducive to your own defense.<br/><br/><strong>Recruiting survivors:</strong><br/>In addition, you can recruit a lot of teammates to help you survive, raise chickens, farm, resist the growing number of monsters, and explore the city together<br/>", "metacritic": null, "released": "2021-01-31", "tba": false, "updated": "2021-02-05T02:27:28", "background_image": "https://media.rawg.io/media/screenshots/7d6/7d61ca3a5ac1789cb4f98c9db1033c93.jpg", "website": "https://celeritasgames.mailchimpsites.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 356, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Celeritas Games", "WAEUN"], "genres": ["Action", "Adventure", "Strategy", "Simulation", "Indie"], "publishers": ["Celeritas Games", "RPK-studio game"], "esrb_rating": null}