{"id": 491713, "slug": "grand-horse-attraction", "name": "Grand horse attraction", "name_original": "Grand horse attraction", "description": "From the makers of No. 1 in the Kids Entertainment Charts \"Grand Horse Attraction\" you get total playful freedom.  You alone decide which task you want to do next: Stable work, such as feeding and cleaning the horses or rather earning money, with newspapers or bread rolls? Maybe you will have more fun steering the horse-drawn carriage through the vast landscapes of the riding country, through the small town or along the beautiful beach ... Why not take a photo tour and take great snapshots? Not only can you ride all the horses in the game, you can also take part in various riding tournaments or explore the area with bicycles and electric scooters. You can even drive the farmer's tractor! Talk to the friendly NPCs and listen to the cool songs from \"Radio Reiterland\".<br/>\n<br/>\n<br/>\r\nFEATURES:<br/>\r\n- Explore the game world. You decide what you want to do in the riding country. Take care of the rescue of the abandoned horses.<br/>\r\n- Equip yourself with your favorite clothes in the boutique.<br/>\r\n- Win exciting horse shows.<br/>\r\n- Drive with many vehicles such as bicycles, electric scooters, tractors and carriages.<br/>\r\n- Put together your own photo album. Take on part-time jobs like delivering newspapers.<br/>\r\n- Ride through huge, varied levels.<br/>\r\n- Help with the stable work (feeding, brushing and much more). Endless game mode!", "metacritic": null, "released": "2020-08-06", "tba": false, "updated": "2020-09-11T05:43:42", "background_image": "https://media.rawg.io/media/screenshots/dbd/dbdc2dd19f27a9744034db6c750c5b47.jpg", "website": "http://www.uniquegames.info/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 322, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Caipirinha Games"], "genres": ["Adventure", "Simulation", "Casual"], "publishers": [], "esrb_rating": null}