{"id": 491746, "slug": "dark-tales-edgar-allan-poes-the-devil-in-the-belfr", "name": "Dark Tales: Edgar Allan Poe's The Devil in the Belfry Collector's Edition", "name_original": "Dark Tales: Edgar Allan Poe's The Devil in the Belfry Collector's Edition", "description": "<strong>Amax Interactive</strong> is proud to bring you the newest chilling mystery in the Dark Tales series!<br/><br/>When a series of strange deaths occur in the town of Morden, an old friend jumps on the case. But it’s not long before he goes missing himself! You and Dupin quickly arrive to find a town in panic. Each night, someone dies after the 13th chime of the bell tower. And to top things off, no one can be seen ringing the bell itself! Is a sinister specter to blame, or are illusions wreaking havoc on reality? Find out in this stirring Hidden-Object Puzzle adventure!<br/><br/>This is a special Collector's Edition release full of exclusive extras you won't find in the standard version. The Collector's Edition includes:<br/><br/><ul><li>Help Louise Wheeler’s clever children free their mother from jail, and save their Illusion Theater from criminal Benjamin Barlow. Join their quest for their father’s will and an ancient hidden treasure!<br/></li><li>Find magic cards and puzzle pieces throughout the game – and access an extra puzzle and stories.<br/></li><li>Replay your favorite HOPs and mini-games - and add to your achievement awards!  <br/></li><li>Save your favorite Tale in the Belfry twists with screensavers, wallpapers, concept art, and music. <br/></li><li>Keep your adventure on track with the strategy guide!</li></ul><br/>This is a Hidden Object Puzzle Adventure game, meaning a specific genre of story-driven, point &amp; click adventures. Throughout the game, players are tasked to find a list of objects hidden within a particular scene, and to occasionally complete various mini-games/puzzles.", "metacritic": null, "released": "2020-08-07", "tba": false, "updated": "2020-09-11T06:08:04", "background_image": "https://media.rawg.io/media/screenshots/aac/aacc6ff3e90f0d8e1e8527bfc53c06cd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 5}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 602, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["AMAX Interactive"], "genres": ["Adventure", "Casual"], "publishers": ["Big Fish Games"], "esrb_rating": null}