{"id": 491738, "slug": "hard2fly", "name": "Hard2Fly", "name_original": "Hard2Fly", "description": "Did you know, you are one of the very few who actually read this?<h3>Challenge</h3><br/>Controlling all axes of a drone without stabilization, <strong>it just can't be that hard, right?</strong> Riding a bicycle is easy, but do you remember how hard it was to learn? In Hard2Fly you can practice and learn the basic controls of flying a FPV drone in a not so serious environment. After the initial \"what the actual ****\"-moment, players usually make good progress and start going stunt flying or beat their friends in timed racing.<h3>Crashing (a lot)</h3><br/>Brace-Brace! Your drone is crashable. You will notice - guaranteed. Learn from mistakes, crashes and failures. Hard2Fly kindly reminds you of them by leaving Debris where you crashed unless you want it to be removed.<h3>Fly 'round</h3><br/>Once it got to you - relax your mind, enjoy the sensation of being free like a bird.<h3>Time Race your friends</h3><br/>Of course there is a global leaderboard for every track, but also a short list to see how your friends are doing and challenge their LAP times.<h3>Crash some more (a lot more)</h3><br/>Did I mention crashes yet? Do you like crashing? Turn on or off up to 99 of your own ghosts, race them or have a wreck festival.<h3>Conclusion?</h3><strong>Hard2Fly is for you if</strong><br/><ul><li>You like tricky challenges to build a skill<br/></li><li>Like crashing drones<br/></li><li>Want a game to be just a game<br/></li><li>No-Fly restrictions from your local aerospace restrict you from adding annoying sound emissions to the sky<br/></li><li>Your PC has enough performance to simulate a ton of ghost drones, crashes and debris<br/></li><li>You thought drones were a toy, but realized they are dangerous - now you still want to have fun in a safe-to-others environment</li></ul><br/><strong>Hard2Fly is likely NOT for you if</strong><br/><ul><li>You are looking for true realism and absolute perfectly accurate simulation to become the world best FPV drone racer and win every single race you'll ever attempt.</li></ul>", "metacritic": null, "released": "2020-08-07", "tba": false, "updated": "2020-09-11T06:02:45", "background_image": "https://media.rawg.io/media/screenshots/1e6/1e6682a002bb6bf01b7c5f094e8fc456.jpg", "website": "https://www.lama-rage.ch/?page_id=928", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 123, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Lama Rage"], "genres": ["Simulation", "Racing", "Indie"], "publishers": ["Lama Rage"], "esrb_rating": null}