{"id": 491880, "slug": "rock-star-simulator", "name": "Rock Star Simulator", "name_original": "Rock Star Simulator", "description": "Deep down inside, you’ve always wanted to be a rock star, don’t deny! <br/>\r\nAnd guess what - today you can be! Taste the life of a famous musician, go on the live tour across the USA and have fun just like a real star - welcome to the rock and roll heaven!<br/>\n<br/>\r\nClimb the ladder of fame and fortune, gain respect points, and watch your audience grow. Not only your glory expands, but also your possessions! Get a bigger house, more guitars, and maybe a yacht - why the heck not! And you know that being rich attracts pretty girls… Do you want them at your parties? Of course you do, party all night long! <br/>\n<br/>\r\nLook at your fans from the stage, choose your guitars for the shows, play the music yourself. Who knows, maybe you’ll even get best awards in the whole music industry? Work hard for it and you’ll see it was fun and worth the effort! <br/>\n<br/>\r\nNow you can only imagine that epic life… But get the Rock Star Simulator and live it! <br/>\r\nParty in the style of a famous rock superstar, and all that to the accompaniment of an awesome and powerful rock music!<br/>\n<br/>\r\nYou start the game as a musician, you are not known in the world yet, but you would like to become a rock star.<br/>\n<br/>\r\nAt the beginning you play concerts for small audiences in small music clubs. If you want to become famous, you have to do shows well. During the concert, to get as many points as possible, to get them you have to press buttons on the keyboard to the beat of the music.<br/>\n<br/>\r\nPoints collected in this way can be spent on buying new musical equipment, investing in advertising a new album or organizing an event where there will be famous people.<br/>\n<br/>\r\nYour goal is to become a rock star and get as many fans as possible and play your last concert in the biggest stadium.", "metacritic": null, "released": "2020-08-14", "tba": false, "updated": "2020-09-11T07:29:27", "background_image": "https://media.rawg.io/media/screenshots/c2c/c2c2fed42c8c5a96da4f184c0e0715ee.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 391, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Rock Star Simulator Studio"], "genres": ["Action", "Adventure", "Simulation", "Indie"], "publishers": ["Rock Star Simulator Studio"], "esrb_rating": null}