{"id": 491806, "slug": "tragedy-of-loneliness", "name": "Tragedy of Loneliness", "name_original": "Tragedy of Loneliness", "description": "Loneliness is me.<br/><br/>Loneliness is you.<br/><br/>Loneliness is us.<br/><br/>I have been alone since she left. I am sorry for everything, for all of my weakness.<br/><br/>If you are reading these stuffs that I wrote, I am sure that hundreds of years must have passed.<br/><br/>I am maybe a hero, or maybe an enemy for you.<br/><br/>After all that I said, I beg you not to approach to me with prejudice. Please read. Try to understand well that all the things I wrote.<br/><br/>When you see the difficulty of being alone in the whole world, you will feel the anger I felt, in your bones.<br/><br/>So please discover me. Believe in me. Give me strength...<br/><br/>I am X. Are you ready to see my story?<br/><br/>In this Kinetic Novel and RPG, you will discover what a deaf and dumb person experiences at different times.<br/>You will witness the brutality of people, the absurdity of the massacres in nature, and the relentless struggle of the character to become a hero.<br/>X was a weak person, but to the scream of the world, he could not remain silent. He believed he was elected. Could X's desire for heroism change the world, or was X already lost?<br/><br/><br/><br/><br/><strong>Features:</strong><br/><br/><strong>---Are you ready for this story that will not be forgotten and will deeply affect your psychology?<br/><br/>---You will have a unique experience with music that reflects the ambiance wonderfully.<br/><br/>---You won't be able to take your eyes off the hand-drawn paintings.<br/><br/>---In battles in the dungeon, your greatest helper will be the legendary ax and shield.<br/><br/>---When you successfully pass the dungeon missions, you will gain the ability to cast spells.<br/><br/>---You will fight with Slime, Fire Nymphs, Ice Nymphs, but the scariest one will be your battle with the Death Spirits. To defeat the Death Spirits, you must use your magic skill very carefully.<br/><br/>---As your level rises, both your health and mana will increase.<br/><br/>---Get ready for an end that will shake you up and shake your psychology in Kinetic Novel episodes...<br/><br/>---When you finish the game, you will be lost in thoughts...<br/><br/>---It runs smoothly on every computer system.</strong>", "metacritic": null, "released": "2020-08-11", "tba": false, "updated": "2020-09-11T06:39:49", "background_image": "https://media.rawg.io/media/screenshots/c62/c62689d10e68e5adf46d3ca53711cc93.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 141, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Vingbelz Games"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Vingbelz Games"], "esrb_rating": null}