{"id": 491814, "slug": "bamerang-warm-up-duel", "name": "Bamerang: Warm-Up Duel", "name_original": "Bamerang: Warm-Up Duel", "description": "Experience fast-paced boomerang duells, set in an outlandish, colorful world. Master the flight curve of the boomerang to hit your friends in unexpected ways and send them flying off the stage.<br />\nWhat are you waiting for? Grab a friend for some action packed fun and please the almighty goddess with your mad boomerang throwing skills.Master the flight curve of the boomerangLearn to anticipate the trajectory of the boomerangs to dodge your opponent&#39;s throws and hit them from unexpected angles.<br />\nWin the favor of the goddessThe almighty green goddess declares as the winner whoever collects the most golden points on the stage. Don’t fall off the platform or the goddess will shake those precious points out of you.<br />\nExciting matchesSteal those precious points from your opponents by landing your boomerang throws and throwing them off the platform. But beware, the more points you have, the more you can lose, making it easy for your opponents to catch up.AND ONCE YOU&#39;RE ALL WARMED-UP, CHECK OUT THE FULL GAME, FEATURING:Over 20 map variationsAdapt to the changing surface of the platform. Take cover behind obstacles and throw your opponents into holes in the map.<br />\nFree for all mayhem or team modeEngage in intense 1v1 duels, or fill your whole couch with a 4-player free for all or team game.Matches over multiple roundsThe green goddess will change the platform after each round as it rises towards the sky, where the winner can look forward to be celebrated by the goddess herself.More unique soundtracksGet into the boomerang fighting groove with 3 handcrafted soundtracks!</p>", "metacritic": null, "released": "2021-04-22", "tba": false, "updated": "2021-03-31T15:43:11", "background_image": "https://media.rawg.io/media/screenshots/d1d/d1de2642e2e1ec687dad58ddc3e311f8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 63, "game_series_count": 0, "reviews_count": 0, "platforms": ["Nintendo Switch", "PC"], "developers": ["Lululu Entertainment"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Lululu Entertainment"], "esrb_rating": null}