{"id": 491922, "slug": "mushroom-picker-simulator", "name": "Mushroom Picker Simulator", "name_original": "Mushroom Picker Simulator", "description": "Mushroom Picker Simulator is a mushroom search and collection simulator that will involve you in hunting many different mushrooms growing in the wild. Collect mushrooms, enjoy walking in the forest, complete missions, improve your hut and your equipment.<br/>\r\nYou will play the role of a mushroom picker living in a hut. You will be able to find 100 types of real mushrooms growing in large areas of coniferous forests. Plan your route, try not to get lost in the forest and return to the hut in time.<br/>\n<br/>\r\nGAME FEATURES:<br/>\n<br/>\r\n■ Large location for exploring and collecting mushrooms.<br/>\n<br/>\r\n■ Different weather conditions.<br/>\n<br/>\r\n■ 100 types of real-life mushrooms, both edible and inedible, encyclopedia of mushrooms.<br/>\n<br/>\r\n■ Classification of fungi by their type, rarity, and value.<br/>\n<br/>\r\n■ Improve the hut and equipment of the mushroom picker.<br/>\n<br/>\r\n■ Presence of venomous snakes in the forest.<br/>\n<br/>\r\n■ The presence of hunger and thirst in the mushroom picker, the possibility of injury and snake bite.<br/>\n<br/>\r\n■ The presence of various missions related to mushrooms and searching for items.<br/>\n<br/>\r\n■ Orientation on the terrain: using a compass and binoculars.", "metacritic": null, "released": "2020-08-19", "tba": false, "updated": "2020-09-11T08:00:46", "background_image": "https://media.rawg.io/media/screenshots/0b7/0b7e102710464ac9e08405bc580c1c8a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 390, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Poroshin Develop"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["Poroshin Develop"], "esrb_rating": null}