{"id": 49198, "slug": "slimebrawl", "name": "Slimebrawl", "name_original": "Slimebrawl", "description": "Slimebrawl is a 3D melee brawler game focused on quick action and fast rounds. Select your character, customize your appearance, choose your heirloom and get ready to brawl to appease the gods. Play together in 2-4 player matches and collect the most slime at the end of the game to win, ultimately bringing you the status of godhood instead of a mere slime.<br/><br/>The basis of the game is that each character has a certain amount of slime which counts as that character's life points. When you get hit by an opponent, your health isn't lost forever, but is merely pushed away from your form - in turn this makes you smaller and lowers your strength with which you attack. Act quickly to regain your health by picking up the loose slime, or attack your opponents to steal their slime. Do not become too greedy without a clear plan though, as your size is proportional not only to your attack strength but to your character's speed. Being unable to quickly respond to the shift in terrain might spell disaster, as the levels change with the map getting smaller and smaller as pieces of the level collapse, bringing the fight closer to the middle of the field. Nobody likes a coward that runs away from a good brawl.<br/><br/><br/> <strong>Destructible maps</strong>  - The maps have been designed to fall apart as the match goes on, thus forcing players to fight bravely instead of running and hiding in the corners of the map. Every map falls apart in a unique way, randomized each time the map is played.<br/> <strong>Fast, fluid brawls</strong> - The game is based on a Best of 5 system, with each round taking a maximum of 90 seconds. With no time for pause, your slime will soon be ascended to godhood. If the gods are appeased by the show you put on, and of course the tribute of slime you bring to them, they might just ascend you to a form higher than a slime.<br/> <strong>Satisfying and violent</strong>  - Character attacks feel meaty and violent - just the way the gods want 'em.<br/> <strong>Tactics </strong>- Will you fight the others head on, or will you try to steal slime from your opponents stashes while they fight? Or maybe your aim is to push your opponents off the map to guarantee your win? You choose.<br/> <strong>Diverse map pool</strong> - Will you fight on a dried out crystal-infected sky island, or on a building in the middle of a construction area? No one really knows what the gods will choose as an arena for you to brawl in.<br/> <strong>Character customization</strong> - Choose the form of your inner slime. Customize the way your character looks with hefty customization options. Do not forget that the heirloom you choose isn't just for looks though. Keep it close at all times and the gods might just reward you for it!<br/> <strong>Couch multiplayer</strong> - Made with local couch multiplayer in mind, this game is perfect to play with your friends when you are itching for a quick, fun adrenaline filled game on your next LAN party.<br/><br/><br/>", "metacritic": null, "released": "2017-11-06", "tba": false, "updated": "2019-08-28T17:05:12", "background_image": "https://media.rawg.io/media/screenshots/1e5/1e570c0f972a0133b51dbad9506f4f2e.jpg", "website": "http://www.kolosskolektiv.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 17}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 413, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Koloss Kolektiv"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Koloss Kolektiv"], "esrb_rating": null}