{"id": 491924, "slug": "a-story-in-space", "name": "A Story In Space", "name_original": "A Story In Space", "description": "Can I tell you a story? A bounty hunter among the cosmos lives a pretty basic life within the galaxy when one day a bounty is put upon the King of a planet named Hakarr for 1,000,000 galactic space units! Hakarr is in a vicious battle against its neighboring planet Pahnbuk where its leader wants to initiate in a war to completely wipe out the people of Hakarr. What happens when the morals you've known all your life are challenged? Can you find a way to save them all and more importantly (or unimportantly) , save yourself? <br/>\n<br/>\r\nThis game has it all! Turn based battling, challenging battles, wholesome side missions, engaging plot and lore, moral based decision making and even a farming sim! Read more below for more detail! Enjoy this 2D adventure game with a variety of content to keep you on your toes!<br/>\n<br/>\r\nFEATURES:<br/>\n<br/>\r\nThe turn based battling is dynamic, fun and requires strategy to be successful!<br/>\n<br/>\r\nFun and interactive puzzles are present to challenge the player!<br/>\n<br/>\r\nFollow the main story to stop an evil king and a possibly more destructive queen from destroying two planets!<br/>\n<br/>\r\nAt least one giant worm named Bobert<br/>\n<br/>\r\nLook out for secrets to figure out what the Story teller is hiding!<br/>\n<br/>\r\nFollow side missions that pull away from the main story to explore and obtain exciting items, advantages and bits of lore.<br/>\n<br/>\r\nThere will be some tough decisions that will question your morals and perspective of what makes an ending \"good\" or \"bad\"<br/>\n<br/>\r\nMultiple endings allow for players to experience their results as a reflection of their actions and morals.<br/>\n<br/>\r\nTake a break and enjoy the farming sim part of the game! Are the fights becoming too much? Pick 1,000 carrots to help out a local village of Tandyville and relax!<br/>\n<br/>\r\nWatch out for Chad The Angry Tree!<br/>\n<br/>\r\nHelp a sad square creature, Albert, become the hero of his town!<br/>\n<br/>\r\nDid I mention there's a giant worm with a top hat?<br/>\n<br/>\r\nUnlike many RPG adventure games, enemy grinding is typically not needed to be successful.<br/>\n<br/>\r\nREPORT ANY PROBLEMS TO: joshcuttinggamedev@gmail.com (this game was made by me only so I can't test everything so there are most likely a few small bugs)", "metacritic": null, "released": "2020-08-19", "tba": false, "updated": "2020-09-11T08:02:15", "background_image": "https://media.rawg.io/media/screenshots/b0b/b0b56220bff8b2e0e77f5129b65605fd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 11, "ratings_count": 0, "suggestions_count": 122, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Joshua Cutting"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Joshua Cutting"], "esrb_rating": null}