{"id": 491994, "slug": "blackjack-championship", "name": "Blackjack Championship", "name_original": "Blackjack Championship", "description": "Play the most authentic BLACKJACK GAME with players all over the world!<h3>Key Features</h3>Many unique play modes with different bet ranges to choose from. Fully implemented real casino rules and newly added features to give it more fun. From serious to just-for-fun players, you will soon be falling in love with this Blackjack game. Spend massively fun time with our top-of-the line game provided with many special features for you to feel real casino atmosphere!<br/><br/><ul><li> <strong>FREE CHIPS EVERY 4 HOURS</strong> : All you need to do to get free chips is just come back every day.<br/></li><li> <strong>LUCKY BOX</strong> : What will happen when you collect the free chips 4 times? Open the golden box with the red ribbon around!<br/></li><li> <strong>SIT-N-GO MEGA TOURNAMENT</strong> : Aim for MEGA PRIZE which is 50 times larger than BUY-IN at the SIT-N-GO MEGA.3 potential prizes will be decided from the start of the game and the final winner gets to choose one among the hidden prizes.<br/></li><li> <strong>PRIVATE TABLE</strong> : Enjoy Multi-hand Blackjack at the private table exclusively for you! You can play up to three seats per round. <br/></li><li> <strong>JACKPOT</strong> : Place a Jackpot Wager to get a chance of hitting the Jackpot at the CLASSIC table. Take risks to be a Jackpot winner!<br/></li><li> <strong>AVATAR</strong> : Variety of portraits collection representing your achievements! Show off your new lucky decorations.<br/></li><li> <strong>EVENTS AND MISSIONS</strong> : Various and exciting seasonal events. Stay on top of your game with daily and weekly missions!<br/></li><li> <strong>WEEKLY RANKINGS</strong> : Compete with outstanding Blackjack players throughout the world in real time and be the world champion!<br/></li><li> <strong>CONTINUOUS PLAY</strong> : Start playing blackjack on your phone or tablet and continue on TV or PC with the same bankroll!</li></ul><br/>This product is intended for use by an adult audience for amusement purposes only. Practice or success at social casino gaming does not imply future success at real money gambling. This product does not offer real money gambling or an opportunity to win real money or prizes.", "metacritic": null, "released": "2020-08-25", "tba": false, "updated": "2020-09-11T08:43:24", "background_image": "https://media.rawg.io/media/screenshots/f42/f42a64e0ca520fe870bb0fb48d806254.jpg", "website": "https://www.bbstud.io", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 53}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 271, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["BBstudio"], "genres": ["Sports", "Massively Multiplayer", "Indie"], "publishers": ["BBstudio"], "esrb_rating": null}