{"id": 492097, "slug": "oneons-prisoners", "name": "Oneons: Prisoners", "name_original": "Oneons: Prisoners", "description": "After years of imprisonment and experimentation in a Sentinel prison, an Oneon shatters its containment pod and begins the long road to escape. Can it evade the sentinels and their minions, and rescue its fellow Oneons along the way?<br/><br/>Oneons is a short, experimental sci-fi broughlike (coffee-break roguelike/roguelite) with 12 floors of tactical combat, dangerous enemies, and useful items. Strategize your limited health and energy as you descend through the increasingly difficult floors. Survive. Die. Fight again.<br/><br/><br/><br/><br/><br/><ul><li>Navigate through twelve floors filled with unique and dangerous enemies, some with powers of their own.<br/></li><li>Balance careful use of combat, energy, and your unique psionic blast ability to maximize your chances of survival<br/></li><li>Free other Oneons to power up in your quest for freedom<br/></li><li>Discover a story about oppression, faith, and hope</li></ul><br/><br/><br/>Accessibility matters! Contains several accessibility features, including:<br/><br/><ul><li>Uses large, high-contrast images and text ideal for low-vision players<br/></li><li>Uses simple, readable font for easy readability<br/></li><li>Entirely playable by keyboard with fully-rebindable keys<br/></li><li>One-hand friendly key bindings setup by default<br/></li><li>Options you can access at any time during the game</li></ul><br/><br/>If you've never played a roguelike (dungeon crawler) game before, here are some tips and things to know to get the most out of your experience:<br/><br/><ul><li> To explore, click any square that has adjacent unexplored/black squares, or click on any object.<br/></li><li> Nothing happens until you take a turn. Observe carefully the effects after you move.<br/></li><li> The game is difficult. Expect to die a lot. When you die, you restart from the beginning.<br/></li><li> You can hover your mouse over things to see more information. Look closely at icons and their explanations.</li></ul>", "metacritic": null, "released": "2020-08-31", "tba": false, "updated": "2020-09-11T09:49:47", "background_image": "https://media.rawg.io/media/screenshots/8c7/8c764ba8ef316331aa243da4481d596c.jpg", "website": "https://deengames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 6, "ratings_count": 0, "suggestions_count": 122, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["Deen Games"], "genres": ["Casual", "Indie"], "publishers": ["Deen Games"], "esrb_rating": null}