{"id": 492098, "slug": "dust-to-the-end", "name": "Dust to the End", "name_original": "Dust to the End", "description": "Nuclear wars ended human civilization,the survivors hid in the underground shelter through a stagnant but safe century.When the radiation from the ground gradually dissipates,the survivors returned to the surface and began the reconstruction of civilization.Sadly, mankinds failed to learn from the tragic ending of the last civilization,intrigue and deceit, blood and blood are repeated in this wasteland world. In order to compete for land and resources, emerging forces began to fight against each other, chaos in everywhere.Not long ago, a human trafficking organization called the \"Black Death\" ransacked an shelter called \"507\". After looting, a large number of residents became slaves.As the lucky one of 507, you escaped a catastrophe, but survival is never easy.When you walk out of the ruins of 507 and come to this wasteland world, these choices are already in front of you.<h3>Game Features</h3>● The semi-open world map will encounter various monsters and beasts, bandit robbers, emergencies, and harsh natural environments when moving on the big map.<br/><br/>● There are more than 50 cities and towns of different sizes and more than 100 kinds of trading goods in the game for players to find out the property and demand, run business transactions, and earn the difference.<br/><br/>● There are 9 categories of weapons. Different weapons can release different fighting skills in battle. Reasonable and skillful skill matching can make fighting more effective.<br/><br/>●Each recruited mercenary has his own personality, which determines the mercenary’s mood and team status, which in turn affects the team’s combat effectiveness and attitude.<br/><br/>●Inquire about informations, explore ruins, establish and operate underground bases, and gain output.<br/><br/>●Interface design in waste soil style, with more than 40 exquisite character drawings.<br/><br/>● Multiple ending plots, different dialogue choices will affect the plot trend and the final ending.<h3>Contact us</h3>E-mail：zz_zjoy@163.com", "metacritic": null, "released": null, "tba": false, "updated": "2020-09-11T09:50:43", "background_image": "https://media.rawg.io/media/screenshots/441/4416edf15b88d887933436a07a704ed8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 74, "beaten": 1, "toplay": 4, "dropped": 2}, "playtime": 6, "achievements_count": 47, "ratings_count": 4, "suggestions_count": 405, "game_series_count": 0, "reviews_count": 4, "platforms": ["PC"], "developers": ["ZJOY"], "genres": ["RPG", "Strategy", "Indie"], "publishers": ["ZJOY"], "esrb_rating": null}