{"id": 492023, "slug": "star-rover", "name": "Star Rover", "name_original": "Star Rover", "description": "<h3>\"mysteries Await Your Discovery\"</h3><br/>The story of the Star Rover who travels in space. The player will be a Star Rover who wanders and travel in various stars. Roy Roque, he was assigned a rescue mission. He must bring the missing scientist back to the base. In which these scientists have carried out experiments until the robots in the stars are malfunctioning and attacking people. Under the mission to save the stars, there may be something hidden and dangerous to the galaxy.<br/><br/><br/><br/>Star Rover is a third-person action role-playing game. The game takes place in the secret stars. Star Rover contains gameplay elements from adventure games, sword action platformer, and character upgrade system. You can travel to different areas and explore different routes. An important part of the game is the collection of weapons and items, especially rare weapons that are new movements from new weapons. And attach some items to upgrade their weapons<h3>Features:</h3><br/><ul><li><strong>Infinity Combos:</strong> You can use horizontal slash and vertical slash to make a freestyle infinity combos. If you have a new weapon or you are upgrading your character statistics, you can increase the attack ending movement or new moves to your infinity combos.</li></ul><br/><ul><li><strong>Create attack power:</strong> Each weapon you choose to use It consists of 3 attack parts: the point of a sword to pierce, the sharp edge to slash, pommel to smash. Which will depend on the fighting style you choose to use. Some movements can accumulate attack power. Some movements will multiply attack power.</li></ul><br/><ul><li><strong>Discover everything in dungeons:</strong> In one area, which has a total of 11 areas, there will be many treasure chests to collect. There may be exotic weapons. To open all the treasure chests, that requires key abilities and will play the best way of story to play.</li></ul><br/><ul><li><strong>5 types of game-ending:</strong> During the game, there will be many secrets for you to choose to follow or ignore. Your actions will change the gameplay, such as having characters help to fight or the condition of the dungeon has changed which will also affect your dungeon exploration too.</li></ul><br/>", "metacritic": null, "released": null, "tba": false, "updated": "2020-09-11T09:04:41", "background_image": "https://media.rawg.io/media/screenshots/096/096a4242c31bcade29e76621eff1ed90.jpg", "website": "http://starrover.bastation.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 328, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Browny Application"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Browny Application"], "esrb_rating": null}