{"id": 49205, "slug": "moose-invasion", "name": "Moose Invasion", "name_original": "Moose Invasion", "description": "-HOW TO PLAY-<br/>\r\nUse arrow keys and enter to maneuver menus.<br/>\r\nAim ship with mouse.<br/>\r\nleft click to move, and while doing so hold right click to fire.<br/>\r\nSpace bar to use wipe ability.<br/>\n<br/>\r\n-STORY-<br/>\r\nMankind was finally prepared for the colonization of Mars, with new technology which would allow them to terraform it into a livable and truly earth-like planet.<br/>\r\nAlongside this technology came the ability to give creatures human-like intelligence.<br/>\r\nA Canadian scientist began to give these abilities to his specimens, and intended for them to be taken alongside Mars colonists and used for hard labour.<br/>\r\nThey were transported to the planet and began their contribution to the cause.<br/>\r\nWhile excavating the planet for fossils and useful materials, a large collection of glowing crystals was discovered.<br/>\r\nThe animals were sent to retrieve these crystals, only to return with unnatural powers which would make them truly powerful.<br/>\r\nHowever; one did not return from below.<br/>\r\nSoon the colony went dark, and a new power on the planet was forming.<br/>\r\nCloser inspection of the surface revealed the intention for the animals to return to Earth, and take revenge for their treatment.<br/>\r\nBeyond this, a large source of energy was discovered below the original site of excavation, and it is unclear how this came to be.<br/>\r\nIn order to prevent the incoming devastation, you, the scientist who created this very situation have come to end it before the animals are ready for invasion.<br/>\n<br/>\r\n-MUSIC CREDITS-<br/>\r\nMain Theme \\/<br/>\r\nKick Puncher - Runner Gunner<br/>\n<br/>\r\nCombat Theme \\/<br/>\r\nMK Ultra - Tears in The Rain", "metacritic": null, "released": "2017-11-12", "tba": false, "updated": "2019-08-28T22:04:03", "background_image": "https://media.rawg.io/media/screenshots/374/3748f18b46d45f252ea2affb776fb587.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 105}, "playtime": 1, "achievements_count": 7, "ratings_count": 0, "suggestions_count": 69, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Daniel Meredith"], "genres": ["Action"], "publishers": ["Daniel Meredith"], "esrb_rating": null}