{"id": 492065, "slug": "vr-time-machine-travelling-in-history-visit-ancien", "name": "VR Time Machine Travelling in history: Visit ancient Egypt, Babylon and Greece in B.C. 400", "name_original": "VR Time Machine Travelling in history: Visit ancient Egypt, Babylon and Greece in B.C. 400", "description": "Ancient Egyptian civilization is one of the oldest civilizations in the world and one of the civilizations with the longest continuation of a single ethnic culture. The ancient Egyptians formed a traditional culture in their development, but it was not a conservative and closed civilization. Ancient Egypt was closely connected with the Middle East and the Mediterranean world through civilization exchanges and wars. It blended with West Asia, Greece, and Roman civilizations, which affected the development of the surrounding world culture and made great contributions to the progress of world civilization.<br/><br/>In the history of the world, the ancient Egyptians were the creators of the oldest civilization in the world. Egypt was the first to enter the national stage and the first to enter the civilized society. It is generally believed that the ancient Egyptians were a fusion of Asian and African tribes and belonged to the Ham-Sem language family. Around 4000 BC, the city-state of slavery had been established. Around 3000 BC, Egypt developed from independent city states to a unified kingdom. Since then, ancient Egypt has gone through the ancient kingdom period, the middle kingdom period and the new kingdom period before and after, and gradually became a great empire spanning the two continents of Asia and Africa.<br/><br/>Around 1000 BC, Egypt began to decline, and Egypt once became part of the Assyrian Empire. Since the 1000s BC, that is, the post-Egyptian dynasty era, Egypt was successively conquered by Nubians, Assyrians and Persians. In the 4th century BC, Alexander of Macedonia conquered Egypt and established the Ptolemaic dynasty. In 30 BC, Rome expanded to Egypt and replaced the Ptolemaic dynasty. In 641 AD, Egypt was conquered by the Arabs, and the ancient Egyptian civilization was replaced by the feudal civilization of the Arabs.<br/><br/>However, Egypt's own system has not been completely cut off, still maintaining its continuity. Even during the rule of the Greeks and Romans, Egypt still maintained its own cultural traditions. Except for the ruling class and some upper class members, other civilians still used their own language and script. In short, the ancient Egyptian civilization is one of the oldest and oldest civilizations in the world, and it has always retained its national continuity. Ancient Egyptian civilization lasted from about 4000 BC to the 7th century AD, with a history of about 4000-5000 years. Although the ancient Egyptian civilization has been repeatedly invaded by foreign nations, Egypt has always maintained the ancient Egyptian civilization and traditions, and has actively absorbed the excellent cultures of foreign nations and has all-inclusive. In 641 AD, the Arabs conquered Egypt. But the Arabs are completely different from the ancient Egyptians. The Arabs created the Islamic civilization, and gradually assimilated and replaced the ancient Egyptian civilization. Since then, Egypt has become a part of Arab civilization.<br/><br/>Ancient Egypt was the civilized country with the strongest religious consciousness in the ancient world. Religion permeates all aspects of the country and everyone's life. The reason is that, on the one hand, the relatively closed natural environment of ancient Egypt has invisible control and influence on people; on the other hand, more importantly, it is the long-term theocratic and monarchist rule.<br/><br/>In ancient Egypt, not only the three religious theology systems of Heliopolis, Hermopolis and Memphis were retained. And almost all animals have become people's worship objects, ranging from lions and tigers to small cats and beetles. This reflects the different concepts of the ancient Egyptians about the universe and its origin formed in different centers, and demonstrates the universality of the ancient Egyptians' worship of heaven, earth and nature.<br/><br/>Another characteristic of Egyptian religion is the dualistic world outlook of people's ideology. The ancient Egyptians saw that the world was divided into this world and the next. The ancient Egyptians believed that the real world is short-lived and the underground world is eternal. They painstakingly pursue the eternal world and value the afterlife more than this one. In order to pursue the \"eternal\" world, the ancient Egyptians had to mummify the corpse after death to preserve the integrity of the corpse. The influence and effect of religion on the field of literature and art is also very profound. Ancient Egyptian literature includes a rich variety of genres such as myths, biographies, teachings, prose, poems, and dramas. Almost all the literature on the above subjects is full of religious consciousness or content. Sculpture and painting art are also full of religious atmosphere. The creation of these artworks is not only closely related to religious activities, but the themes are also to promote the lofty and greatness of gods and kings, and people's good wishes for the future.<br/><br/>In addition to the ancient Egyptian civilization, the ancient Greek civilization is especially worthy of our understanding. When it comes to Greece, in addition to myths and monuments, the most often drawn picture is the blue sky and sea, and the white houses set off the blue-roofed church. This scene is often shot on the island of Santorini in Greece. This small island with a permanent population of less than 10,000 attracts hundreds of thousands of tourists every year. It is no exaggeration to say that it is a holiday paradise in the Aegean Sea. But all the tourists never thought that this piece of paradise under their feet could become a hell on earth at any time because they stepped on a volcano.<br/><br/>Let the time go back to 1600 BC, which is 3,600 years ago.<br/><br/>This is a map of ancient civilizations in the Old World. Greece is located at the southern end of the Balkan Peninsula in southeastern Europe, including many nearby islands (the Greek archipelago is composed of more than 1,500 islands). It has a long coastline, many rivers, turbulent rivers, and mountainous territory. The lack of open plains in the region is a natural limitation of human survival and development. However, in such an environment, the Greeks relied on their extraordinary wisdom and perseverance to open up an ideal living space, transforming the barren mountains and ridges into a fragrant green garden; turning the tyrannical and impermanent sea into a long and long distance. , Pingchuan, with all directions, pompous and beautiful. And it is this space that once constituted the cultural center of the Mediterranean world and produced the rich fruits in the history of human civilization.<br/><br/>When the time sequence of history entered the end of the 5th century BC, Greece began to show signs of decline. The two powers of the Aegean, Athens and Sparta, allied their organizations in an attempt to sweep the world and swallow the wasteland. But in the end, both lose and lose strength. At the same time, Macedonia in the north has risen, and it roars with a powerful horse team wrapped in an invincible phalanx. Wherever he went, he was invincible, so that the Greeks of disputes were settled and unified. Although the subsequent Alexander Empire once brought civilization to a brief rejuvenation in the evening scene, it was ultimately a rush of history. Soon after Alexander returned from the expedition, his generals \"divided into three divisions\" and impatiently sent the former glory of the empire to the grave. At this time, on the Apennine Peninsula facing the Balkans across the sea, the roar of the roman legion was already resounding. Although the three \"divided Jin\" families continued to embrace the incense of civilization, they were unable to recover due to the general situation. The invincible advance of the Roman Legion played the elegy of Greek civilization, and finally the prosperity fell into the long river of history. After showing off her glory, the civilization was finally lost. She left a rich legacy to future generations, and also left endless sorrow and grief!<br/><br/>The purpose of our game is to let more people know about the great civilizations of ancient Egypt and ancient Greece. The game uses realistic Unity3D models and uses models to build the civilization and architectural scenes of ancient Egypt and ancient Greece. The same scene is equipped with corresponding background music. As long as you wear a VR headset to experience it, it seems to travel through time and space and return to the age of ancient civilization. Bring you the greatest enjoyment of sight and hearing.<br/><br/>In addition, we have also set up a mini-game link to search for treasures in the game settings; what's even better is that as long as you choose our game, you can enjoy the snake and hunting games we prepared for you for free project.", "metacritic": null, "released": "2020-08-30", "tba": false, "updated": "2020-09-11T09:28:48", "background_image": "https://media.rawg.io/media/screenshots/6c4/6c4b2e02bc4cafa834fcb720adddaaa8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 361, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["William at Oxford"], "genres": ["Casual"], "publishers": ["William at Oxford"], "esrb_rating": null}