{"id": 492079, "slug": "high-entropy-challenges", "name": "High Entropy: Challenges", "name_original": "High Entropy: Challenges", "description": "Use computers (via GUIs or the command line), unlock doors, crawl through vents, fight enemies head on or find other ways to neutralize or avoid them...<h3>Challenges</h3><br/>High Entropy: Challenges is a free, action-adventure FPS (inspired by some of my favorite immersive sims) consisting of a beginning, 15 levels, a default ending and a special ending if you finish with a 100% score in all levels.<br/><br/><h3>Command Line Interface / Fists vs Shadows</h3><br/>The computers in the game include a command line interface for those interested in overcoming some obstacles the 'hacker' way, but the levels are designed so there's always an alternative way to advance (except once as an introduction in level 7, and the exact commands needed then are written in a document next to the corresponding computer). Some secondary objectives and achievements require its use, but there are manuals placed around the levels that gradually introduce how do it.<br/><br/>Also, some of the levels offer multiple paths to solve them, being able to choose a more action oriented approach or a stealthy one, and include some achievements related to this (Path of Fists, Path of Shadows...).<h3>High Entropy</h3><br/>Hopefully, High Entropy: Challenges is a fun stand-alone gaming experience by itself, but it was also made to serve as a way for people to help me test my ideas out and see if creating High Entropy --the extended, commercial version I have in mind-- is viable and something people would enjoy (it would include this challenges mode and an exclusive story mode).", "metacritic": null, "released": "2020-09-01", "tba": false, "updated": "2020-09-11T09:36:18", "background_image": "https://media.rawg.io/media/screenshots/a86/a866b0d2dbb500c93cf7ceaa0fa0baaa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 2, "toplay": 2}, "playtime": 0, "achievements_count": 32, "ratings_count": 0, "suggestions_count": 182, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Álvaro García"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Álvaro García"], "esrb_rating": null}