{"id": 492047, "slug": "you-can-pet-the-dog-vr", "name": "You Can Pet The Dog VR", "name_original": "You Can Pet The Dog VR", "description": "You Can Pet The Dog VR is a short VR game where you can fulfill the ultimate video game fantasy: petting the dog. Set in the beautiful opening sequence of upcoming game DOGGONE, you will experience a gorgeous hand-crafted art style and an adorable pup awaiting play time.<h3>Features:</h3><ul><li>Play with a dog, and most importantly, pet the dog. This is why you're here, after all.<br/></li><li>Throw a ball to play fetch, toss a stick and see the dog go after it, or just stop and pet that cute dog.<br/></li><li>Relax in a breathtaking environment inspired by classic Disney films.<br/></li><li>Experience the head-start to once-in-a-lifetime game DOGGONE, Raconteur Games' upcoming game about a lost dog.</li></ul><br/>There are games that will give you hundreds of hours of gameplay with branching narrative and unparalleled player choice. This is not one of them. In fact, it's the exact opposite. It's one thing, and one thing precisely: Petting a dog, and unplugging from the world.<br/><br/>You Can Pet The Dog VR was designed with bright colors and beautiful handcrafted landscapes. It has been tailored to be enjoyable for most levels of color perception, such that color blind players should be able to adjust a setting and enjoy the game no matter their situation.", "metacritic": null, "released": "2020-08-28", "tba": false, "updated": "2021-09-20T13:40:08", "background_image": "https://media.rawg.io/media/screenshots/fbe/fbef2bb46bee07f1c5efa9af63b3f9d9.jpg", "website": "http://raconteurgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 96, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Raconteur Games", "Red Iron Labs"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["Raconteur Games", "3D Media"], "esrb_rating": null}