{"id": 492181, "slug": "fear-of-the-unknown-2", "name": "Fear of The Unknown", "name_original": "Fear of The Unknown", "description": "Experience the horror in reliving the past of mysterious and horrible crime scenes that have taken place in this strange world. Fear of The Unknown targets the fear of the \"unexpected\" or the \"unknown\" and uses multiple environments to amplify the fear that this game provides.<br/><br/><br/>Fear of The Unknown's scene one follows the story of Edward Hevaney, particularly the story of his death. His job as a personal doctor to a patient named Marilyn, required him to leave the city and visit her twice-weekly. However; his last visit does not end well...<br/><br/><br/><br/><br/>Fear of The Unknown contains suspenseful events designed to keep the player waiting, not knowing what comes next, but those pauses can also be moments of realization.<br/><br/><br/><br/><br/>Unlike most horror games out there, Fear of The Unknown's environments are unique. They are designed to provide the player with realistic places and the feeling of actually being there. Looking around might just be the right thing to do if you are a story seeker.<br/><br/><br/><br/><br/>Solving some puzzles will allow you to learn the past and the truth behind everything, mainly the past of the dark figure. But be careful not to go too deep, or you might just end up like the rest of them.<br/><br/><br/><br/>* SPECIAL THANKS TO *<br/><br/>Sara Badday - Character Modeler.<br/><br/>Angad Singh - Voice Actor.<br/><br/>Fesal Badday - Support Developer.", "metacritic": null, "released": "2020-09-03", "tba": false, "updated": "2020-09-11T10:41:06", "background_image": "https://media.rawg.io/media/screenshots/99b/99b8acc7b287c07dbeee920a97b4c98e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 235, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Saaed Badday"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Bad Days Game Studios"], "esrb_rating": null}