{"id": 492112, "slug": "snapshot-vr", "name": "Snapshot VR", "name_original": "Snapshot VR", "description": "<strong>Snapshot</strong> is a VR arena shooter built for e-sports with competitive solo and team play.  Inspired by the real-life sport, Snapshot feels like playing paintball in the future.  One shot, one kill.  In competitive teams of up to 5, communication and coordination are the keys to victory.<br/><br/>Join our Discord community to arrange games, share arena layouts, and maybe, just maybe, change your whole life forever.<br/>Check the links section for an invite!<h3>Features</h3><ul><li>Room Browsing / Basic Matchmaking<br/></li><li>Cross-platform profiles with tracked stats and leaderboards<br/></li><li>Avatar Customization w/ Cosmetics<br/></li><li>Third-party Map Editor w/ 50+ community maps playable<br/></li><li>Training maps with stationary and moving targets<br/></li><li>Multiple Locomotion Modes to accommodate any type of VR player</li></ul><h3>Avatar Customization</h3>Select from built-in cosmetics to make your avatar your own.  Join our community.  We recognize our most active community members with custom cosmetics that you get to design.<br/><h3>Custom Maps</h3>With Snapshot's standard set of competitive obstacles that we call 'bunkers', it's quick and easy to throw together new layouts with a web-based editor thanks to our partnership with 2D Paintball.  Endless combinations.  Layouts are easy to share and will load automatically for players connecting to your game.<br/><h3>Stats and Leaderboards</h3>Your cross-platform profile carries your stats, cosmetics, and maps with you no matter which platform you're playing on.  Fight your way to the top of the kill leaderboard or go for a pristine k/d ratio.<br/><br/>Generate metrics for your custom maps to find best positions and shooting lanes.  Playing a real-life paintball tournament?  Add your layout and generate data to take with you to practice and to the event.<br/>", "metacritic": null, "released": "2020-08-31", "tba": false, "updated": "2020-09-11T10:00:38", "background_image": "https://media.rawg.io/media/screenshots/95d/95d21b9e154407cfe72e9bddef7fc757.jpg", "website": "https://www.snapshotvr.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 5, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 171, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Giant Scam Industries"], "genres": ["Action", "Indie"], "publishers": ["Giant Scam Industries"], "esrb_rating": null}