{"id": 492135, "slug": "saboteur-sio", "name": "Saboteur SiO", "name_original": "Saboteur SiO", "description": "Saboteur SiO is the official sequel to the classic retro games Saboteur! and Saboteur II: Avenging Angel.<br/>Travel the world in this original ninja mission, created and developed by the original author, Clive Townsend.<br/><br/>In 1985 Saboteur! received the prestigious award \"The Crash Smash\" from Crash magazine and was high-rated with a 93% score. In 1987 Clive made the sequel Saboteur II: Avenging Angel - the first video game to feature a female protagonist - Nina - sister of the ninja from the first game. Now, after over three decades, SimFabric in collaboration with Clive Townsend have prepared the next installment in the Saboteur saga.<br/><br/>- 19 Special story-related achievements.<br/>- All new levels, enemies, and story by Clive Townsend.<br/>- Original Soundtrack by: Sean Fountain, Geovarius, Zoltar Dreamusic, and Jeroen Tel.<br/>- Original Retro graphics and extra screen modes for ZX Spectrum, Commodore 64, Amstrad CPC, and Game Boy.<br/>- 9 Language versions - English, Polish, French, Italian, German, Spanish, Russian, Portuguese, Czech.<br/><br/>Retro options:<br/>- Scanlines.<br/>- CRT Moire.<br/>- Retro, Modern, and 'Original' title and menu.<br/>- Retro and Modern in-game panel.<br/>- Modern difficulty setting, for players with non-retro skills ;-)", "metacritic": null, "released": "2020-08-31", "tba": false, "updated": "2021-06-25T04:16:22", "background_image": "https://media.rawg.io/media/screenshots/c12/c126606f57a449602699c7a6c9ba9149.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 428, "game_series_count": 0, "reviews_count": 0, "platforms": ["PlayStation 4", "PC"], "developers": ["SimFabric", "Clive Townsend"], "genres": ["Action", "Adventure", "RPG", "Casual", "Indie"], "publishers": ["SimFabric"], "esrb_rating": null}