{"id": 49219, "slug": "chop-chop-princess", "name": "Chop Chop Princess!", "name_original": "Chop Chop Princess!", "description": "Princess adventures in Zephyr Kingdom<br/>\n<br/>\r\nOr<br/>\n<br/>\r\nOne grown-up divorced princess CHCHP is going through existential crisis.<br/>\r\nRunaway from reality leads her to the childhood where one sweet memory is waiting, and this is her childhood friend, Teddy bear.<br/>\r\nBut in childhood near the toys there had always been lava and dragons.<br/>\r\nTroublemaker dragon is sending 99 troubles to hunt the princess CHCHP who dreams to escape from reality. From now on you decide whether her escape is successful or not.<br/>\n<br/>\r\nOr<br/>\n<br/>\r\nChasing for followers and likes one #liftlook and #duckface lover has made her mind for a grand selfie with a real dragon to blow up the social networks.<br/>\r\nFinding herself in the dragon retro-dwelling the contemporary princess feels nostalgia for her childhood years.<br/>\r\nCassette players, yo-yo’s, chewing gums with terminator, tamagotchi… The memories overwhelm her so deep that she almost forgets about the selfie project.<br/>\r\nShe decides to steal her childhood symbol Teddy bear in any possible way.<br/>\r\nBut OMG! There goes the trouble. Teddy bear is held by the sleeping dragon.<br/>\r\nSelfie girl pulls the toy out of the dragon paws and escapes from the dwelling but nothing she knows about the dragon’s plan. All the Zephyr World habitants are now searching the dragon’s favorite toy.<br/>\r\nNothing can stop Troublemaker unless he punishes and bans the raider for ever and a day! <br/>\n<br/>\r\nDASH as much as you can!<br/>\r\nAVOID multiple traps!<br/>\n<br/>\r\nMore than 20 unique traps will forcemeat you if you choose the wrong place for your foot!<br/>\r\nAngry dragon will eat her if you are standing still!<br/>\r\nGreat pin-up style graphics and top quality sound recorded by symphonic orchestra", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:04:03", "background_image": "https://media.rawg.io/media/screenshots/7f7/7f797c1cc6c45cdfe6ad74b124ed8bf5.jpg", "website": "http://takefivegames.com/games/chop-chop-princess/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 4, "owned": 7}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 189, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Spectre EU"], "genres": ["Adventure", "Racing", "Indie"], "publishers": ["Take Five Games"], "esrb_rating": null}