{"id": 492152, "slug": "the-last-farm", "name": "The Last Farm", "name_original": "The Last Farm", "description": "Save the town of Riverside from starvation by building and maintaining a farm. Work the barren soil, breed new types of crops, and build automated systems to help manage the land. The world has become a harsh and unforgiving place, the land plagued by blightstorms that devastate plant-life with a variety of diseases. A brutal attack on the town of Riverside leaves their farm in ruins, and with no one left who can work the barren soil, they desperately need your help. Strike a balance between feeding the town and funding your own growth. Create better varieties of crop and even entirely new species through selective breeding. Make decisions to help shape the future of the town and the surrounding region as part of the town council. Form relationships with the people of the town. Can you save Riverside from disaster?<br/><br/><ul><li><strong>Build your own farm in a harsh and unforgiving world.</strong> Cultivate the land and bring life to the area through the use of science, technology, and good old fashioned hard work.<br/></li><li><strong> Customise your crops, creating new varieties and even entirely new species.</strong> Improve the yield, growth time, and resistance to blightstorms through careful selective breeding, or just throw everything together and see what shakes out.<br/></li><li><strong>Explore the ruins of fallen cities and reclaim lost technologies to use on your farm.</strong> Create vast automated systems, improve the efficiency of your farm, process your crops into more valuable resources, and employ advanced genetic manipulation techniques to supercharge your crops.<br/></li><li><strong>Get to know the residents of Riverside, form relationships, and help shape the future of the town through your position on the town council.</strong> Will you encourage growth and cooperation with the surrounding region, or will you strive for self-reliance and ensuring the town's needs come first?</li></ul>", "metacritic": null, "released": "2020-09-02", "tba": false, "updated": "2020-09-11T10:23:52", "background_image": "https://media.rawg.io/media/screenshots/6e1/6e14ddc453c34a83ee84242056fba2ce.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 239, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Works In Theory"], "genres": ["RPG", "Simulation", "Indie"], "publishers": ["Works In Theory"], "esrb_rating": null}