{"id": 492147, "slug": "heart-in-the-cell-rebirth", "name": "Heart in the Cell: Rebirth", "name_original": "Heart in the Cell: Rebirth", "description": "<strong>Without the Cell, you won't be able to move a single inch.</strong><br/><br/>In \"Heart in the Cell\", you will take on the role of an agent who infiltrates the Oniros Corporation and uses the Cell left behind by the first president to defeat unknown cosmic beings and unlock the secrets hiding within the Oniros Corporation.<br/>The game sheds the traditional UI design, breaking the concept that the UI can only be used as a fixed layer, and blends it with combat. In scenes, the UI will float freely as cells, and players will need to use them at the right moment to unleash spells and summon creatures to fight the enemy. Players will also need to move their heroes to avoid damage from enemies or scenes.<br/><br/><strong>You will experience<br/>A world where the occult coexists with hard science fiction</strong><br/>Biochips, memory transmissions, as the mainstream of the current era, are active in this highly developed world of artificial intelligence. In the shadows, unknown creatures with occult as the cornerstone are also stirring, as if they are waiting for something...<br/><br/><strong><h3>Stylized game graphics</h3></strong><br/>From the pixel-styled sci-fi graphics to the original soundtrack, you'll be in a constant state of sci-fi mysticism.<br/><br/><strong><h3>Ensuing battles</h3></strong><br/>Keeping tabs on the battlefield.<br/>Use the Cell to release spells, summon creatures.<br/>Move the hero and dodge the bullets.<br/>Defeat the mighty boss.<br/><br/><br/><strong><h3>Imaginative puzzle solving</h3></strong><br/>Combination of Coordinates and Perspective.<br/>Determining when to use a Cell.<br/>A maze of information and cues.<br/><br/>", "metacritic": null, "released": "2020-09-01", "tba": false, "updated": "2020-09-11T10:20:45", "background_image": "https://media.rawg.io/media/screenshots/415/415f81d1795ca16c415fff1cc5ab738e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 157, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Team Gingerbread Man"], "genres": ["Strategy"], "publishers": ["Team Gingerbread Man"], "esrb_rating": null}