{"id": 492179, "slug": "sightbringer", "name": "Sightbringer", "name_original": "Sightbringer", "description": "Sightbringer is a single player platformer.<br/>\n<br/>\r\nIn this game you control the character “Sight”, who is the hero of this forgotten civilization. Your mission is to explore the underground ruin and restore the fire in the brazier to bring light and peace back to this world.<br/>\n<br/>\r\nThis is not going to be a safe trip. Ever since the great catastrophe, evil monsters who are fed by the dark energy have invaded this land and they will do whatever it takes to stop Sight from restoring light to the world. Luckily, with the help of some ancient artifacts, nothing can stop Sight from finishing his/her mission.<br/>\n<br/>\r\n“Life crystal” can protect Sight from the dark energy 3 times. “Flight crystal” can help Sight fly through the obstacles. “The Lantern of Bright” will re-lit the fire and guide Sight whenever he/she is lost in the dark energy.<br/>\n<br/>\r\nAlong your journey you will encounter a friendly NPC “Touch” who can restore your life crystal and bring you back when you are severely damaged so you can continue your journey. She seems to be able to appear all over this ancient ruin along your journey. Some say her power is related to space and time. Her stories still remain to be discovered…<br/>\n<br/>\r\nFeatures:<br/>\r\n- Glide and wall jump through the ruin<br/>\r\n- Boost yourself with the power of ancient crystals<br/>\r\n- Bring light to the world with the lanterns", "metacritic": null, "released": "2020-09-03", "tba": false, "updated": "2020-09-11T10:39:56", "background_image": "https://media.rawg.io/media/screenshots/a0b/a0b727cc18674d031ece9bcb8229de41.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 202, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Team UWU"], "genres": ["Action"], "publishers": ["DigiPen Institute of Technology"], "esrb_rating": null}