{"id": 49217, "slug": "scrap-galaxy", "name": "Scrap Galaxy", "name_original": "Scrap Galaxy", "description": "Scrap Galaxy is a local build-and-destroy deathmatch game for up to 4 players. It is a 2D top-down shooter taking place out in space in a galactic junkyard. In this setting, the players are trying to survive by constructing space ships.<br/><br/>The game is round-based and each round is divided up into two phases: build phase and battle phase. During the build phase, each player gets a number of components and has to assemble a spaceship from them within a certain time limit. During the battle phase, the players pilot the ships. They battle against the other or team up against the garbage drones living in the junkyard.<br/><br/>The randomness and unpredictable nature of the game makes every round into a new challenge, because you always have a new ship to battle with, raising the stakes and making the game quite addictive.Key Features<ul><li>Creativity under time pressure mixed with action-packed spaceship battles.<br/></li><li>Deathmatch until only one player remains. A new ship is constructed each round.<br/></li><li>Scrap King is like Deathmatch but the winner keeps their ship and can continue to build on it.<br/></li><li>Survival allows the players to fight together against garbage drones. The players continues to build on their ships after each wave of enemies.<br/></li><li>Gamepads are highly recommended for singleplayer and multiplayer.<br/></li><li>Bots fill lasts slots if you are less than 4 people playing.<br/></li><li>Original soundtrack made by Connor O.R.T. Linning.</li></ul>Numbers<ul><li>1 to 4 players playing together in local multiplayer.<br/></li><li>12 different components to construct spaceships from.<br/></li><li>3 different game modes.<br/></li><li>5 Different maps.<br/></li><li>4 Survival levels.</li></ul>", "metacritic": null, "released": "2017-12-01", "tba": false, "updated": "2019-08-28T22:04:03", "background_image": "https://media.rawg.io/media/screenshots/4c1/4c1e5aecde0eec717e4c74558bc2d3af.jpg", "website": "http://www.scrapgalaxy.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 8}, "playtime": 1, "achievements_count": 31, "ratings_count": 0, "suggestions_count": 332, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Catalope Games"], "genres": ["Action", "Indie"], "publishers": ["Catalope Games"], "esrb_rating": null}