{"id": 492118, "slug": "time-break-chronicles", "name": "Time Break Chronicles", "name_original": "Time Break Chronicles", "description": "<strong>Time Break Chronicles is a fusion of classic JRPGs and modern Roguelites, with a planned cast of 100 playable classes to find and unlock. Build your team, customize their abilities, and venture into a procedurally generated adventure through space-time and beyond!</strong><br/><br/><h3>Classic JRPG-like Battle Gameplay</h3>A core element of any JRPG style game is turn-based combat. Time Break Chronicles features turn-based battles against a variety of foes, each requiring different strategies, skills, and maybe an item or two to bail you out. Take care; these enemies are no pushovers. They will test your thinking and require a strong team to defeat!<br/><br/><br/><h3>Explore, Adapt, Overcome</h3>Your adventure will not only consist of battles. You will also have to contend with a variety of traps, barriers, secrets, and other encounters as you explore the procedurally generated map. Customize your characters, their abilities, and choose the correct items to help you overcome obstacles.<br/><br/><br/><h3>Customize Your Heroes</h3>Customize your heroes' abilities with a wide variety of equippable relics, that can do anything from modifying attributes to granting new skills. Craft additional relics to round out your strategy.<br/><br/><br/><h3>Build a Town</h3>Even heroes need someplace to rest after a difficult journey. Build up a town over time with multiple buildings and varied upgrades to support your favorite strategies.<br/><br/><br/><h3>Features</h3><ul><li> 100 Playable Character Classes (by end of EA) - Heroes from all throughout history and even the future. Find and unlock them all!<br/></li><li> 6 Unique Stages (by end of EA) - Each stage contains unique enemies, items, encounters, and heroes to unlock.<br/></li><li> Roguelite Gameplay - Every stage playthrough is different, with random effects to give each run a unique feel and strategy.<br/></li><li> Customize Your Heroes - Equip relics and train skills to customize your hero's abilities and refine your strategy.<br/></li><li> Build a Town - Build up your town over time to support your heroes in their adventures.<br/></li><li> Endless Mode - Play any stage in an endless looping mode for increased difficulty and rewards, and to test your skills.<br/></li><li> Classic JRPG Styling - As fans of classic SNES-era JRPGs, we have tried to recreate the feel and fun of these classic games.<br/></li><li> Controller Support - Play with the mouse or keyboard, or use a controller for that classic feel!</li></ul><br/>", "metacritic": null, "released": "2020-09-01", "tba": false, "updated": "2020-09-11T10:03:56", "background_image": "https://media.rawg.io/media/screenshots/627/627dd1646abfd5c29852bccc85d46240.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 16}, "playtime": 3, "achievements_count": 23, "ratings_count": 0, "suggestions_count": 370, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Warrior General Games"], "genres": ["RPG", "Strategy", "Indie"], "publishers": ["Warrior General Games"], "esrb_rating": null}