{"id": 492177, "slug": "hyperbolic-arcade-trading", "name": "HYPERBOLIC Arcade Trading", "name_original": "HYPERBOLIC Arcade Trading", "description": "<h3>THE WORLD'S FIRST 'ARCADIFIED TRADING' GAME!</h3>Hyperbolic Arcade Trading delivers an 'arcadified' take on trading stocks, cryptocurrencies, and forex (traditional currencies) that helps players develop ACTUAL trading skills while playing a video game!<br/><br/><h3>FEATURES</h3><ul><li>Learn or practice the fundamentals of trading and technical analysis, reading price movement, and risk management, all while<strong> playing a video game</strong>!<br/></li><li><strong>Accelerate</strong> developing your trading skills! Day trade an entire day in less than 2 minutes!! <br/></li><li>Have <strong>FUN</strong> with HYPERBOLIC Arcade Trading's accessible user interface, variety background visuals, and quality tracks by @eonsound! <br/></li><li>Uses <strong>ACTUAL historical price data</strong> to simulate your real results for each trading session and massive replayability! <br/></li><li><strong>Tracks your results and progress</strong> so you can understand your trading strengths, then put what you’ve learned into practice with real trading!<br/></li><li>Progress through each level / trading day to build your buying </li></ul>power and aim for higher profits!<br/><br/><h3>Early Access Version</h3>The game is currently in development with a targeted release date of fall 2020. A FREE early access version is available and players are invited to post thoughts, feedback, ideas, or bug reports to the HYPERBOLIC Arcade Trading discussion group.  <br/><br/>Please Note: This version is not yet optimized for laptops. Playing on a desktop computer is strongly recommended.<br/><br/>As an early access version, many features are still unimplemented or unpolished and there are bugs. That said, please post any feedback to the game forum and we will try to be as responsive as possible. All feedback is highly appreciated and will be valued input as we prepare the final product!<h3>How to Play</h3>① Follow the price bars on the scrolling chart. <br/>② Use in-game indicators to predict where the price will move.<br/>③ Place triggers to i) profit when the price goes up or even when the price goes down and ii) get out if the trade goes against you.<br/>④ Progress your in-game trading career and aim to grow your account with each stage / trading session!<br/><br/>★★★ Be ready to think and move FAST! ★★★<br/>Arcadified trading moves MUCH faster than regular trading sims or IRL trading - in the day trading mode (the mode playable in Early Access), 5 minutes goes by in 3 seconds.<br/>You'll have to be quick read the price movement, plan entries and exits, and and place orders. This dynamic, arcadified trading allows you to go through more trading sessions in a shorter time and develop a feel for price movement much faster than is possible through regular trading or simulations.<br/><br/>* For more details and until the in-game tutorials are completed, please see the tutorial PDF and readme.txt included in the game folder and feel free to post any questions to the discussion group.<br/><br/><br/><br/>★　★　★　★　★　★　★　★　★　★　★　★　★　★　★　★　★　★<br/>THANK YOU for checking out Hyperbolic Arcade Trading!<br/>Please post any questions or feedback to our discussion group!<br/>★　★　★　★　★　★　★　★　★　★　★　★　★　★　★　★　★　★<br/><br/>Disclaimer: HYPERBOLIC Arcade Trading and the content in the accompanying tutorials are for informational and educational purposes only. These materials are not and should not be construed as professional financial or investment advice, and Hyperbolic LLC is not soliciting any action based upon such material. Trading in stocks, cryptocurrencies, and forex have large potential rewards but also large potential risk. You must be aware of and willing to accept the risks in order to invest in these products. Do not trade with money that you cannot afford to lose. The past performance of any trading system, methodology, or particular trader is not indicative of future results.", "metacritic": null, "released": "2020-09-03", "tba": false, "updated": "2020-09-11T10:38:56", "background_image": "https://media.rawg.io/media/screenshots/553/553e39655b2560fa42bb09a2387649aa.jpg", "website": "https://hyperbolic.me", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 219, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Hyperbolic"], "genres": ["Action", "Simulation"], "publishers": ["Hyperbolic"], "esrb_rating": null}