{"id": 492107, "slug": "9-nine-episode-3", "name": "9-nine-:Episode 3", "name_original": "9-nine-:Episode 3", "description": "Episode 1 - Episode 2<h3>Concept</h3>9-nine- Episode 3 is the third volume in a series of supernatural mystery games, with Episode 3 telling a story centered around Haruka Kosaka. <br/>The entries in the the 9-nine- series share the same setting and world, but each entry focuses on a different heroine. 9-nine- is a tale of the town of Shiromitsugawa, host to mysterious Artifacts and the superpowers they bestow on their Users. <br/><br/>A tale of growing trust and budding romance between the protagonist and the heroine, and also a murder mystery where they hunt down the culprit behind a series of supernatural murders. A tale of our group running into an organization composed of Artifact Users called Rig Veda. What is their goal, and what is the real goal of the culprit? Will romance develop by working together? <br/><br/><strong>Each game has an independent story that can be enjoyed on its own. We hope you enjoy the experience that is the 9-nine- series.</strong><br/><br/><br/>Shiromitsugawa City: an academic city with no other particular features.<br/><br/>A large earthquake hits the city, damaging the sacred treasure in the Shrine of the White Viper's Relic, and causing strange items to appear from a parallel world. These \"Artifacts\" grant strange powers to their owners, with incidents of an owner abusing their powers and turning people into stone.<br/><br/>Having learned of the item that causes this petrification, the \"Evil Eye Artifact\", Kakeru Niimi teams up with his classmate, Miyako Kujo, and his sister, Sora Niimi, to investigate and put a stop to the culprit.<br/><br/>During the investigation, they find themselves at odds with \"Rig Veda\", an organization of Artifact users. Among their members, they spot their upperclassman in school, Haruka Kosaka.<br/><br/>9-nine-: Episode 3 is the latest chapter in this series of supernatural mystery visual novels with the focus now shifted towards a new heroine, Haruka Kosaka.<br/><br/><br/><ul><li>Gorgeous art from Izumi Tsubasu (Artist of SakuSaku:Love Blooms with the Cherry Blossoms)<br/></li><li>Multi part series with independent stories per episode<br/></li><li>Two different endings<br/></li><li>CG gallery<br/></li><li>Music gallery<br/></li><li>Movie gallery<br/></li><li>FULL Japanese voice acting (Including the main character!)<br/></li><li>Japanese, English, and Chinese text. Dual-lang display options</li></ul>", "metacritic": null, "released": "2020-08-31", "tba": false, "updated": "2020-09-11T09:56:57", "background_image": "https://media.rawg.io/media/screenshots/6e7/6e7680b27ea056e68e9fb8115783104c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 20, "beaten": 1, "toplay": 1}, "playtime": 13, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 485, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["PALETTE"], "genres": ["Action", "Simulation", "Casual"], "publishers": ["Sekai Project"], "esrb_rating": null}