{"id": 492212, "slug": "dungeon-no-dungeon", "name": "Dungeon No Dungeon", "name_original": "Dungeon No Dungeon", "description": "“<strong>Dungeon No Dungeon</strong>” is a location damage &amp; turn-based strategy cult game with extremely high randomness with certain “Roguelike” elements. The core strategy of the game is to be able to make different choices based on the status of the adventurer’s body location, in which adventurers will start their journey by freely matching a 3-person adventure team. Each adventurer will have a diversified and semi-open development direction, which makes this group of misfits who are dead set on accomplishment and yet very laid back, bring different game experiences and excitement to players in each unknown exploration and adventure.<h3>EXPLORATION SYSTEM</h3>When exploring, players will venture to “rooms” such as random events, battles, rest areas and stores, whose location and routes will be generated randomly in each exploration, and so players will have different experiences and encounters in each exploration undertaken. The team that is composed of 3 characters is to roll dice to decide the numbers of steps to reach a “room”, during which branch roads that may appear and will need to be chosen actively. After each encounter of random “rooms”, in addition to the corresponding random events, characters will maintain a real time state in the current exploration. However, the characters’ status will be fully recovered when the current exploration is completed.<h3>CHARACTER &amp; MONSTER SYSTEM</h3>The combination of many characters will also produce powerful chemical reactions, which allows players to have a 1+1&gt;2 game experience. Each character in the game has a diversified and semi-open development direction. These different developmental directions allow the same character of each player to have distinct differences and different playing methods.<h3>RANDOM EVENT SYSTEM</h3>Nearly one hundred different random events are purely triggered by conscience in the process of exploration. Different events create all kinds of different choices, various uncertain ways and totally unexpected results, which motivate players to pursue on!<br/><br/>Most random events trigger different results or rewards according to different choices made by the players. However, some events require players to greatly enrich their mind and patiently solve puzzles through various mini games. Some events can assist players to easily complete the many oncoming challenges. However, some events will cause the following challenges to be much more difficult! Through random events, “Dungeon No Dungeon” allows players to have many other different kinds of game experiences on the premise of trying a type of game.<h3>UNIQUE BATTLE SYSTEM: SELECTION OF LOCATIONS</h3>The core gameplay and game mechanics of “<strong>Dungeon No Dungeon</strong>” are embodied by the different results caused by different selections of different character’s body locations when attacking the enemy (Locational Damage System). “Dungeon No Dungeon” integrates more interesting and exciting contents with this game. Each facet of a character has its own unique functionality and option in which to evade damage. Each body part of a character will have corresponding armor protection according to the different settings. The existence of armor can not only provide armor value, but also make it difficult to apply negative status effects while in battle. Also, there are a variety of armors to cope with different types of damage. Around different characteristics of different characters or enemies, players can launch and formulate a series of tactics and strategies due to the different body locations. The butterfly effect produced by a single location affects the overall battle situation. For example: In a battle, if the character’s limbs (upper or lower) are dismembered, the skills that have corresponding needs will not be able to be utilized. If the character’s armor is destroyed, the flesh will be exposed.", "metacritic": null, "released": "2020-09-04", "tba": false, "updated": "2020-09-11T11:03:34", "background_image": "https://media.rawg.io/media/screenshots/219/219793455051d73de75310a91e86c71b.jpg", "website": "http://302games.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 12, "toplay": 2}, "playtime": 1, "achievements_count": 63, "ratings_count": 0, "suggestions_count": 369, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["302 Studio", "302 GAMES"], "genres": ["Adventure", "RPG", "Strategy", "Casual", "Indie"], "publishers": ["302 GAMES"], "esrb_rating": null}