{"id": 492231, "slug": "_our__defense", "name": "_OUR_:_Defense", "name_original": "_OUR_:_Defense", "description": "_OUR_Defense is a dynamic tower defense game. You must react and counterattack the enemies on the battlefield all the time. Fight in the most diverse conditions and places on our planet. Fight off alien swarm attacks with gigantic machine guns, shotguns, gauss rifles and even a giant laser created using alien technology. <br/>\n<br/>\r\nAt the beginning of the game there are only two towers, but when you open new locations there will be more of them. You will need to plan for what places, and at what point it is better to place towers. Improvements to your towers are also an important part of your defense. You need to understand at what point and in what sequence it is best to improve the towers built. When improving the main characteristics of the towers increase: strength, speed and range of the attack. To improve the towers, you will need credits that are given for killing enemies.<br/>\n<br/>\r\nIn different locations use different tactics and strategies to get through them. In some locations some towers are almost useless, but in other locations you can not do without them.<br/>\n<br/>\r\nEnemies are on the way, they will not die not die themselves! Place towers and repel the enemy attack!<br/>\n<br/>\r\nFeatures: <br/>\r\n- 18 amazing locations. <br/>\r\n- each location has its own tactics and strategy. <br/>\r\n- the need to think through every action. <br/>\r\n- beautiful, atmospheric 4K graphics and sounds. <br/>\r\n- the gameplay is constantly in suspense. <br/>\r\n- missions passing time varies from several minutes to several tens of minutes.<br/>\n<br/>\r\nP.S.<br/>\r\nWe sincerely appreciate your time and any support and hope that _OUR_:_Defense is the best strategy game you have ever played.", "metacritic": null, "released": "2020-09-06", "tba": false, "updated": "2020-09-11T11:13:44", "background_image": "https://media.rawg.io/media/screenshots/b59/b59c7daf1072227c546f2e9a3e57267a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 391, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["M58"], "genres": ["Strategy", "Casual", "Indie"], "publishers": ["M58"], "esrb_rating": null}