{"id": 492355, "slug": "candied", "name": "CANDIED", "name_original": "CANDIED", "description": "<p><strong>Controls:</strong></p>\n<p>Move left and right with ← → or A D</p>\n<p>Jump with ↑ W or Space</p>\n<p>Duck through platforms with ↓ or S</p>\n<p><strong>Enemy appears after 150 points</strong><br/></p>\n<p><strong>Try to reach 1000!</strong></p>\n\n\n<p><em>made for Beginner's Circle Jam #2</em></p>\n<p><em>every single asset (sound, music, art, code) in the game made by us</em></p>\n<p><strong><em>by </em></strong><strong>Team RotKore</strong></p>\n<p><em>thanks for playing &lt;3</em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>WARNING: below is a diary of how the programmer felt upon uploading each build of the game. you can see exactly where the desperation kicked in for me lmao <br/></strong></p>\n\n<p><strong>Build 10<br/></strong></p>\n<p><strong>There's not actually a build 10, but I really wanted to say something in this for the first time (not the programmer). Thanks for playing  and we hope you enjoy the game.  :D  -Jknator. <br/></strong></p>\n<p><strong>BUILD 09</strong><br/></p>\n<p>fixed all the bugs and added a splash screen... this is cool</p>\n\n<p><strong>BUILD 08</strong></p>\n<p>finished up the credits and added the music and sound effects which are AMAZING!! I can't believe this game is real :0</p>\n\n<p><strong>BUILD 07</strong></p>\n<p>wow I'm super tired it's 4am at the time of uploading wtf someone save meeeee</p>\n<p>anyway I did a credits screen that I'm happy with and also the game now gets harder as it goes on!!! I think I'm pretty much ready to call this done, just need to add music and sound tomorrow.. uh oh</p>\n<p>oh also the credits screen is full of placeholders right now because my partner is understandably asleep</p>\n\n<p><strong>BUILD 06</strong></p>\n<p>oops I accidentally did not work on this for like 5 days ahhhh anywayssss I'm back and better than ever. I added a main menu screen and an enemy!!! the movement on the enemy still kinda sucks but I'm gonna playtest and fix it tomorrow hopefully</p>\n\n<p><strong>BUILD 05</strong></p>\n<p>Okay, I guess I needed some sleep. Here's a tip: if you're spending hours on a bug, go the fuck to sleep, you'll solve it in the morning. Anyway, I finally figured out how to make the UI elements work in different aspect ratios!! the game works on all screens!! I mean it's definitely <em>prettier</em> in 4:3 (how it's <em>meant</em> to be played) but it works on inferior resolutions too &lt;3 &lt;3</p>\n<p>the game has a PARALLAX background now (i know right!??!?) and just looks prettier in  general. this was the aesthetic update</p>\n<p>EDIT: for some reason on the first run the background looks really ugly, just kill yourself and play again and the background will look as intended. I wonder what that's about... I guess I have another bug to fix tomorrow :,,)</p>\n\n<p><strong>BUILD 04</strong></p>\n<p>lava has a cool texture now, and it actually kills you!! and there's a brand-new death screen that lets you replay the game without refreshing!!! unfortunately the main menu doesn't exist yet so the button doesn't take you anywhere.</p>\n<p>P.S. I closed unity without saving when I was practically finished this build so I had to restart everything UGH</p>\n<p>ALSO I HATE UI ELEMENTS. HOW DO THEY SCALE TO DIFFERENT SCREENS? I DON'T GET IT. I SPENT HOURS WORKING ON IT AND THE DEATH SCREEN <em>STILL</em> DOESN'T COVER THE WHOLE SCREEN UIFHAIEFHIUSADFIS</p>\n\n<p><strong>BUILD 03</strong></p>\n<p>okay okay a buncha bug fixes. movement should be smoother now, no more soaring through the air when you wall jump, and the lava is actually visible now!! I bet you all thought I was crazy last time I mentioned the lava huh? it was there, it was just invisible outside the editor :(</p>\n<p>oh oh also now there's awesome textures for the platforms and blocks, AND a score tracker!! isn't UI amazing :0</p>\n<p>next thing I work on will be the death screen, currently dying is just kinda awkward. oops</p>\n\n<p><strong>BUILD 02</strong></p>\n<p>testing out the rising stage mechanic. the \"lava\" doesn't actually kill you yet, but it <em>does</em> make the game impossible to play, so it counts ?<br/></p>\n\n<p><strong>BUILD 01</strong></p>\n<p>first build of my first ever game jam game, just testing out the movement and apple animation</p>", "metacritic": null, "released": "2020-09-11", "tba": false, "updated": "2020-09-11T12:19:17", "background_image": "https://media.rawg.io/media/screenshots/cf2/cf28d7997987c76c393dab0233d6f67e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 60, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["sofiregu", "Jknator"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}