{"id": 492456, "slug": "crime-city-miami-vice-city-gangster-game", "name": "Crime City - Miami Vice City - Gangster Game", "name_original": "Crime City - Miami Vice City - Gangster Game", "description": "<p>Welcome to Miami Vice City, the city of freedom… and crime.<br/><br/>Do you like open world and free roam games? Do you like sandbox games where you can do everything you want? Than this is the game for you!<br/><br/>Crime City – Miami Vice City is similar to games like GTA by Rockstar Games, or Saint Row by Violition: you can walk around the city, buy cars, race against people, fight the crime and more.<br/><br/>Take full control of Miami Vice City, the city of freedom and crime. Defeat the gangsters and take the lead of this beautiful city. Rival tribes will do nothing against you!<br/><br/>Car, weapons, money.. everything you need you can find it here!<br/><br/>Miami Vice City, a beautifull city.. full of crime!. You can use different types of motor vehicle theft missions to take over the city and outrun the police, or just obey every traffic light. Stealing auto cars, evading cops, racing through streets, and shooting down other gangs… Take control of the city, it can be all yours!<br/><br/>Explore every inch of Miami Vice City. Discover secrets and special items.<br/>Complete action mission, racing challenge, secret collectible, and commit grand theft auto like a real gangster.<br/><br/>Game Features:<br/>- Unique mixer of a shooter, punch game and auto racing!<br/>- Realistic 3D graphic game<br/>- Open world, free roam game<br/>- Tons of missions and activities<br/>- 15+ weapons and auto vehicles<br/>- A realistic 3D criminal underworld bustling with real life and crime<br/>- Customize your gangster using a variety of clothes and equipment<br/>- A wide range of weapons and dozens of vehicles for you to steal<br/><br/>Upcoming updates:<br/>-New weapons<br/>-New upgrade system (upgrade weapons etc)<br/>-New customization system<br/>-New cars<br/>-New bosses and boss<br/>-Much more<br/><br/>Hurry up and download this open world, free roam game: Crime City – Miami Vice City, for FREE!<br/>Stay tuned, new updates are coming soon!<br/><br/>Enjoy Crime City – Miami Vice City, by Exacron!<br/><br/>SOCIALS and CONTACTS<br/>Follow us on our social platform for updates about Crime City – Miami Vice City and more!<br/><br/>Have questions? Contact us on our social platforms, or via email “support@exacron.com”.<br/><br/>PRIVACY POLICY<br/>http://www.exacron.com/index.php/privacy-policy/</p>", "metacritic": null, "released": "2020-09-10", "tba": false, "updated": "2020-09-11T12:39:23", "background_image": "https://media.rawg.io/media/screenshots/47f/47feae484100014893d8620835909f2e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 106, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Exacron"], "genres": ["Action"], "publishers": [], "esrb_rating": null}