{"id": 49257, "slug": "city-game-studio", "name": "City Game Studio", "name_original": "City Game Studio", "description": "City Game Studio is a sandbox type management game.<br/><br/>January 1975, you have created your video game company. You are renting a tight place that allows you to develop your first game. Quickly, your games are successful and you already have to move, but it is up to you to cross the city to pick up your next local. In the blink of an eye you are hiring artists to improve the visual aspect of your games. Next came developers and then testers. But a problem remains, even if your games are brilliants, you don't have enough fans to self-publish a big game to make your studio profitable. You will have to turn to video game editors who will carve out the lion's share. Combinating successes is the only way of getting rid of the publishers. Furthermore you will be able to publish your own publishing contracts. Then you will then be ready to dominate the market and buy back your competitors.Each game is unique<br/>Maps and studios are procedurally generated. Combined with random events and customizable studios, you will rediscover the game with each new game.Assign the best studio<br/>Browse the cities and choose the location of your next studio. As my uncle said \"we do not hire new talents with vinegar !\"Furnish your studios carefully<br/>Everyone is not a studio designer, yet every piece of furniture has its place in your studio, and can have an influence on the history of your company.Publish, hire, repeat<br/>Each game is unique, but over time new generations of consoles come out. You cannot create a bestseller alone. You have to hire new talents that will help you creating the perfect gameGame development<br/>The development of the game is broadcast on twitch using the channel binogure.", "metacritic": null, "released": null, "tba": false, "updated": "2023-02-22T09:43:35", "background_image": "https://media.rawg.io/media/screenshots/1ae/1ae3f45597cb674699375d7bf3fe58b8.jpg", "website": "http://www.binogure-studio.com/", "rating": 3.8, "rating_top": 5, "added_by_status": {"yet": 2, "owned": 63, "beaten": 5, "toplay": 4, "dropped": 4, "playing": 2}, "playtime": 7, "achievements_count": 79, "ratings_count": 10, "suggestions_count": 174, "game_series_count": 0, "reviews_count": 10, "platforms": ["Linux", "PC"], "developers": ["Binogure Studio"], "genres": ["Strategy", "Simulation", "Casual", "Indie"], "publishers": ["Binogure Studio"], "esrb_rating": null}