{"id": 492640, "slug": "love-friendship", "name": "Love & Friendship", "name_original": "Love & Friendship", "description": "<p>In <em><strong>Love and Friendship</strong></em>, you play as a young lady named Miss Merritt, a veteran of Regency society. The season–a period of year designated for arguably excessive social interaction and wasteful displays of wealth and status–is yours for the commanding. Decide how you want to spend the next few months among society’s richest, well-sculpted upper echelon. Though the outcome of the season may determine the rest of your life. </p>\n<ul><li>Pursue 3 romance options</li><li>2 female, 1 male</li><li>Ignore romance altogether and pursue a platonic friendship with this season’s most coveted Gentleman</li><li>Shape your character’s personality and skills</li><li>Play by Regency rules or break them to your heart’s content</li><li>Thwart a relation’s convoluted inheritance scheme or ignore it and live on your own terms</li><li>Find love and friendship and riches, marry for either or both or all three!</li></ul>\r\nMiss Merritt \r\nA Young Lady\r\n<p>Miss Merritt is one and twenty years of age, embarking on her fifth season in town or London. Being a single child to two well-off parents, growing up in large and covetous property in the countryside, has afforded her the lifestyle to pursue those attributes considered nonnegotiable among respectable young women. And while the Merritt’s hold no title, they are highly regarded as one of the older, settled families in society. </p>\n<p><em>This season holds particular merit as most young ladies are expected to be attached or actively engaged in searching for a life partner by their third season. Miss Merritt has let that aspect of herself languish in favor of cultivating her skills and experience. But the external pressures do not come alone. A cunning ploy orchestrated by one of the Merritt’s closest(in blood, not attitude) relations threatens to wrest control the Merritt estate unless the young lady can find herself a suitable match by the season’s end. </em></p>\n<em>“What’s a lady to do?” </em>\n<em>“why…follow her heart.”</em>\n\r\nSamantha Renolds\r\nThe Childhood Best-friend\r\n<p>Growing up only a half or so from mc’s home in Easton, Sam is Miss Merritt’s first and closest friend. The pair have been nearly inseparable since infancy, engaging in all sorts of mischief and fun as they’ve grown. Sam can be quiet and rather shy, which made her the perfect partner in crime. The pair got up to all sorts of mischief; sneaking away during events, playing the piano-forte in a crowded assembly room, sipping stolen brandy as teens, etc. Not without getting into trouble, of course. While Sam would eventually admit her involvement, most of the time, Miss Merritt took the fall for their shenanigans. The relationship deepened to the point, Sam held off her own debut a year to align with Miss Merritt’s. But the merry times ended rather suddenly with Mrs. Renold’s illness. The family was forced to leave England and seek treatment abroad. This season will be the first time in over five years that the two will have spoken as correspondence to the continent was spotty and Sam seemed to neglect all of Miss Merritt’s letters. There’s no telling what remains of their friendship after such a gap, if anything at all.</p>\n<p>Despite only being a year older than Miss Merritt, Sam stands nearly a head taller than her friend. Although her golden waves draw more attention from others than her height. If one were to peer even closer, they’d be struck by the openness of her light-brown eyes and the fullness of her smile. </p>\r\nVivian Fortescue\r\nThe Jaded Widow\r\n<p>Vivian’s story is harder to tell. While many in society known her, her family, her husbands(oh yes, plural!) for many years, no one can claim a particular closeness to the thrice-now widow. The charitable bleeding-hearts pity her; to marry and settle down, only to lose it all, again and again. The petty and envious whisper conspiracy and concoct extreme theories, blackmail, murder, and affairs. Everything and anything outlandish enough to erase her unfortunate tragedy. Although one does wonder…three husbands dead in succession. Three very rich, very influential husbands dead. Vivian, for her part, seems indifferent to society’s speculation and grieves, well, maybe a little too much. Since the death of her third and final husband two years ago, Vivian has worn nothing but mourning colors. More ammunition for the charitable and the petty to pick apart. As for the lady herself, no one is close enough to know the truth.</p>\n<p>No one in court has the gumption to get close enough to look Mrs. Fortescue in the eye, to peer beneath the black of her lace mourning veil. But if one was brave, one might note the slight curve of her mouth, the sharpness of her dark–near black eyes, the strength behind her stature, the gravity of her voice. But, of course, society only has their eyes on her dress, her black wardrobe colored only by the deepest shades of purple, red, and green. </p>\r\nLord Warren Hind\r\nThe Infamous Rake\r\n<p>Very few can fascinate and repulse in such equal measure as London’s most infamous, Lord Warren Hind. A second son, no one actually expected Warren to ever hold the title. But the mysterious and sudden death of his elder brother a few years prior has shaken the order of things, leaving behind a solemn widow and infant. Before taking his brother’s position, Warren was known as unashamed flirt, a man for whom all pleasures, carnality included, were welcomed with reckless abandon. Rumors range from his deflowering of several fresh-faced debutantes to swindling thousands of pounds from London’s seediest gambling parlor. Though even the most stanchest of his detractors admit the Lord as been quiet, almost sullen, as of late. To the dismay of wagging tongues, Lord Hind may be better behaved than his reputation claims. </p>\n<p>Wicked green eyes, that accounts for much of the speculation surrounding Warren. But it’s rather unfair to the rest of his equally attractive features, his causally tousled brown locks, his slightly athletic tanned build, his vulpine smile. But with baggage like that, who abandon Regency-sanctioned good sense and take a second look. </p>\r\nHugh Langley\r\nThe Red Herring Dandy\r\n<p>It is a truth universally acknowledged, that a single man in possession of a good fortune, must be in want of a wife. Hugh Langley is not. Not in a way that matters, but that won’t stop the hoards of mothers springing their daughters upon him. His income, his family history, his address, all up for public discussion, it seems. The Langleys did not come into their riches through exploitation of tenant farmers but rather through…trade. A horrid concept to the more traditional heads in Regency. But it was Hugh’s grandfather that did the hard labor of building the family business. All Hugh has to worry about is picking which shade of maroon his cravat should be, that and making sure his income doesn’t disappear with neglect. Now he wants to get through the season without entangling himself with someone he cannot stand, and maybe have some fun, if he can find a moment of peace.</p>\n<p>A stranger might describe Hugh as a not-so young man in his early-thirties with dark brown skin, effortlessly braided black hair, and striking blue eyes. But a friend could tell you about his obsession with red-colored clothes, or the small scar on his upper lip he hides with his facial hair, or how his cane is more than just a fashion statement. </p>", "metacritic": null, "released": "2020-09-09", "tba": false, "updated": "2020-09-11T13:26:25", "background_image": "https://media.rawg.io/media/screenshots/7f9/7f9d4ec0bd3fed1e088e2a76e26811e1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 97, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Salty Stories"], "genres": [], "publishers": [], "esrb_rating": null}