{"id": 49266, "slug": "slave-story", "name": "Slave Story", "name_original": "Slave Story", "description": "Slave Story is a Game Development Simulation game.Who is slaver?You will play the role of the slave of money, try your best to make an indie game and sell them in the bigget game platform.How it's beginning?Something unexpected happened, you find out that your father was a gang leader, and your favorite girl, Vicki, owed your father a lot of money. Your father did not think that making games is very promising thing. In order to prove your own choice, you took the initiative to take up her debt which makes your life harder.How to Play？<ul><li>Talk to Vicki, raise the affinity. She will take the initiative to share your work when affinity reach a certain amount.<br/></li><li>Design your own indie game and sell them. You can create indie game in multiple types. Each type of game has its own difficulty.<br/></li><li>Each operation will brings you EXP. You will be able to improve your ability when you reach a new level. Ability include: stamina, creativity, code ability, marketing ability, art ability. <br/></li><li>Vicki also has the same level system. Interacting with her will increase her exp.<br/></li><li>Earn enough money and let your father know the love can make miracle.</li></ul>Features<ul><li>Design and create games to earn money.<br/></li><li>Get EXP and unlock new skill.<br/></li><li>Choose an artist to work with you.<br/></li><li>Pay for food and necessity items.</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:04:01", "background_image": "https://media.rawg.io/media/screenshots/034/03444239b8063deb442c398ee5ac37c5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 17, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SMG Saint"], "genres": ["Simulation", "Indie"], "publishers": ["SMG Saint"], "esrb_rating": null}