{"id": 49272, "slug": "the-warhorn", "name": "The Warhorn", "name_original": "The Warhorn", "description": "In The Warhorn you will get to play as an adventurer, who decides to leave his safe homeland to start a life he always dreamed of. As the only son of a lumberjack you have basic survival skills, which will not be enough to survive in a new world. The willingness to learn and openness is the only tool you have at the start. You will visit dark, dangerous places that will help you find the answer. Key element of all dungeons are puzzles and traps.<br/>Every place has it's own story that you can unravel by taking side quests or reading journals and notes.<br/><br/><ul><li> Explore big open world which consists of 6 theme biomes: spring, autumn, snowy, desert, savanna and jungle. Every biome has subbiomes which feel very unique and in which you will find needed flowers to create potions.</li></ul><ul><li> Resolve various and tricky puzzles. You can try alone but sometimes you will need to gather a friend or two.</li></ul><ul><li> Fight dangerous creatures. All over the world, in different biomes you will face various creatures. Some of them may be neutral, but others are deadly. You will have to face them in order to get needed resources or just to reach your destination. Many times the strongest will protect the most valuable places.</li></ul><ul><li> Learn new skills. You will meet many characters who can teach you everything you need. Sometimes you have to do them a favor, other times you just need to pay for knowledge. In order to survive you have to learn how to use sword properly, but if you are not into melee weapons, use magic runes. You can get them in magic castles - Fireball, Icelance, Light, Invisibility are just a few of many runes that will be very useful in the game. </li></ul><ul><li> Learn how to build and create your village. Invite your friends and develop it together. Create war machines and fight other players. In The Warhorn you can build 2 types of buildings:<br/>- Custom Buildings, which you create by using ready elements like foundations, walls, doors, stairs and etc. This way you can build your home and hide the most valuable items you have.<br/>- Function Building like Blacksmith, Sawmill or Armorer which will help you create needed weapons, armor, potions and all necessary tools to survive and expand.</li></ul><ul><li> Recruit NPC's who will help you develop and defend your village. You can hire:<br/>- Villager who extract resources and bring them to village.<br/>- Warrior who will help you fight with every creature and player in the world. He will also take care of helpless villager exposed to other players when he is gathering resources.<br/>- Gate guard who will protect entrance to your village. </li></ul><br/>Even though the world seems pretty, there are many secrets that you probably don't want to discover. Be ready for disturbing and weird stuff that you will find in the game.", "metacritic": null, "released": null, "tba": false, "updated": "2023-07-19T15:28:58", "background_image": "https://media.rawg.io/media/screenshots/212/2122b47872a4a5bbf5d5364ec0aec494.jpg", "website": "http://thewarhorn.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 21, "beaten": 1, "toplay": 2}, "playtime": 5, "achievements_count": 24, "ratings_count": 2, "suggestions_count": 405, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Pigeons Interactive"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Pigeons Interactive"], "esrb_rating": null}