{"id": 49278, "slug": "harvest-moon-light-of-hope", "name": "Harvest Moon: Light of Hope", "name_original": "Harvest Moon: Light of Hope", "description": "<p>In celebration of Harvest Moon&#39;s 20th Anniversary comes an all new Harvest Moon title for Steam! Harvest Moon: Light of Hope! The game encompasses twenty years of the spirit that have made the franchise what it is today!<br />\nLooking for a fresh start and some new surroundings, you set off on a voyage to begin your new life! Unfortunately, the weather has different plans, as your ship is hit by a monsoon, and goes down! You drift into a small harbor town, now in a shambles from the storm, where a young doctor named Jeanne saves your life. The town has essentially been deserted, but you&#39;re never one to back down from a challenge! It will be up to you to help rebuild the town and save the lighthouse...but it won&#39;t be easy! Nevertheless, with some hard work growing crops, tending livestock, and gathering materials for repairs, you will be able to make new friends, start a family, revive the lighthouse, and save the town, your new home!<br />\n•   Collect important materials to rebuild the town and restore the lighthouse!<br />\n•   Complete requests from villagers to unlock new areas and items!<br />\n•   New and unique festivals, including the Dog Racing Festival!<br />\n•   Learn to grow and mutate crops with user friendly UI and tutorials!<br />\n•   Play as a boy or a girl, get married, and start a family!</p>", "metacritic": null, "released": "2017-11-14", "tba": false, "updated": "2022-07-27T07:17:24", "background_image": "https://media.rawg.io/media/screenshots/da0/da0738506742ff90386a4f033b1bdc42.jpg", "website": "", "rating": 2.67, "rating_top": 4, "added_by_status": {"yet": 3, "owned": 39, "beaten": 1, "toplay": 2, "dropped": 2}, "playtime": 6, "achievements_count": 20, "ratings_count": 6, "suggestions_count": 120, "game_series_count": 22, "reviews_count": 6, "platforms": ["PlayStation 4", "Nintendo Switch", "PC", "Android", "iOS"], "developers": ["NATSUME", "Tabot"], "genres": ["Adventure", "RPG", "Simulation"], "publishers": ["Natsume"], "esrb_rating": "Everyone"}