{"id": 492738, "slug": "laudanum-a-delirium-story-preview", "name": "Laudanum - A Delirium Story (Preview)", "name_original": "Laudanum - A Delirium Story (Preview)", "description": "<p><strong>THE STOIC OPPOSITION</strong> presents</p>\n<p><em>LAUDANUM - a Delirium adventure</em></p>\n<p><strong>THE STORY</strong></p>\n<p>One day a young woman wakes up to realize that his father is missing. As she founds out, his father contracted the plague and was transported to the local hospital, while she must remain in a quarantine. Avoiding soldiers, the girl sets out to go to the hospital, to his father.</p>\n<p>This very short, but relatable story provides the backbone for <em>LAUDANUM - a Delirium adventure</em>.</p>\n<p><strong>THE LOCATIONS</strong></p>\n<p><em>LAUDANUM </em>takes place in 3 main locations (a farm, a valley and a hospital) and several smaller ones, but gameplay- and storywise the game can be separated into 5 parts or acts, each with a clear objective and each filled with harder and more complex puzzles.</p>\n<p><strong>BASED ON REALITY</strong></p>\n<p><em>LAUDANUM </em>is based on real history and real locations. Although in a fantasy setting, the game reimagines the plague outbreak in the 18th century in the Kingdom of Hungary, when leaving quarantine resulted in a death sentence. Leave 2020 for a little and see how we can imagine a similar situation in a different time.</p>\n<p>Based on a small region, where the hospital for infected people was located in a small valley, the player must figure their way through several locations to get to the father.</p>\n<p><strong>THE INSPIRATION</strong></p>\n<p><em>LAUDANUM </em>is inspired by the classic point and click adventure games of the nineties, mainly by the likes of Monkey Island or the Indiana Jones and the Fate of Atlantis, the game is a full-on adventure game complete with a verb list. Forget the keyboard and rely on mouse as you interact deeply with the objects in the game to solve puzzles and get to your father. See a chest? Examine it, move it, open it, you decide. The various opportunities for interaction provide deep experience and rich puzzles. Following the tips of Ron Gilbert, creator of Maniac Mansion and the first two Monkey Island games, every puzzle and dialogue tree is designed with great care to find balance in this game.</p>\n<p><strong>THE FUTURE</strong></p>\n<p><em>LAUDANUM - a Delirium adventure</em> takes place in the universe of my planned bigger game, Delirium, serving as a kind of experiment as to how one can implement adventure game elements in a game made with RPG Maker.</p>", "metacritic": null, "released": "2020-09-09", "tba": false, "updated": "2020-09-11T13:50:09", "background_image": "https://media.rawg.io/media/screenshots/343/34300418368b587d0deef79484edeabc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 57, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["thestoicopposition"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}