{"id": 492880, "slug": "there-is-no-light-itch-hypetrain", "name": "There Is No Light (itch) (hypetrain)", "name_original": "There Is No Light (itch) (hypetrain)", "description": "There Is No Light is a brutal action-adventure set in a grim underground world ruled by the mysterious Church of the Great Hand. Blast your way through the hordes of enemies, fight dangerous bosses and explore the world the way you want.\r\n\r\n\r\n<p>Plunge into a reality where the entire human population has been eradicated by a global catastrophe. Battle your way through bloodthirsty demonic forces to bring order to the world… Or become the herald of its destruction!<br/></p>\n<p>In the gameplay core lies an aggressive fighting style. It resembles a deadly dance, where each mistake can be your last one and avoiding battle is not an option. A Rage system builds up when damage is inflicted on enemies and the environment, the hero can use special abilities of weapons in order to gain an advantage in battle.  </p>\n\n<p>Explore different locations of the Underworld. Fight your way through hordes of monsters, defeat deadly bosses and find a way to the light which has been taken away by the Church of the Great Hand.  <br/></p>\n<ul><li><strong>Ashes of the Old World</strong> – Visit human settlements and unearthly ruins to unveil the secrets of the past.</li></ul>\n<ul><li> <strong>Fight to Survive</strong> – Blast your way through hordes of various enemies.</li><li> <strong>Filled with Rage</strong> – The Rage system forces you to slay your opponents quickly and efficiently.</li><li> <strong>Danger lurks in the Shadows</strong> – Encounter chthonic and horrific bosses.</li><li> <strong>Weapons of the Underworld</strong> – Develop your own combat style with the sheer variety of weapons and its upgrades.</li><li> <strong>Non-linear Narrative</strong> – Explore the story the way you want.</li><li> <strong>Good Intentions</strong> – Your actions and decisions affect the world.</li></ul>\n<p>&gt;&gt;&gt; Find out more on Kickstarter Page. </p>\r\nAdd to wishlist on Steam", "metacritic": null, "released": "2020-09-08", "tba": false, "updated": "2020-09-11T14:23:35", "background_image": "https://media.rawg.io/media/screenshots/752/752af50f46ada8d9ec6e4309ccd86758.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 269, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["hypetrain"], "genres": ["Action", "Adventure", "RPG"], "publishers": [], "esrb_rating": null}