{"id": 493028, "slug": "project-constraint", "name": "Project \"Constraint\"", "name_original": "Project \"Constraint\"", "description": "<p>The game in it's current playable demo state. The updates are frequent, but I can't imagine the final release and content as of now.</p>\n<p><em>As an (unwilling) prototype fighter pilot, you are trapped in an endless testing facility, bad for you. They don't know what you and the machine you pilot are capable of, bad for them. After your escape attempt the defense AI is ordered to destroy you, but  can not break your shields - yet it's silicon brain thinks it deals damage as long as it can register a hit, forcing itself into a loop of trying over and over again... then break it by not taking a single hit! Wiping out waves after waves of never-ending drones while dodging the stream of projectiles, you make the AI logic advance further and further, and the enemies more fierce, - with a hope it fails at some point, granting your escape.</em><br/></p>\n<p>Ever wondered what a classic side-scroller would look and feel like as a detailed simulator? Now you'd probably know :)</p>\n<ul><li>Full 3D: no sprites, no overlays, particle-based pyrotechnical effects.</li><li>Infinity concept: no overflowing or accuracy-degrading variables, truly infinite environment, the death-restart approach replaced by the repeat-until-not-hit one.</li><li>In-depth simulation, including realistic (yet still sci-fi) and detailed weapon behavior, controllable and complex on-board computer and a \"fun-realism\" flightmodel with evasive dashes and alike.</li><li>Advanced custom graphics engine featuring true HDR, area lighting, raymarched displacement mapping, large-scale particle systems and realistic fully-procedural camera simulation.</li><li>High performance, very wide range of detail-level tweaking to suit most hardware configurations, from lower-end laptops with integrated GPUs to high-end gaming PCs.</li><li>Flexible gamepad and joystick support.</li><li>Optional cross-eyed on-screen SBS mode (using a special frame correction technique in order to make the image not appear blurry nor doubled on the larger screens).</li><li>Native stand-alone PS VR support, no additional software needed. Includes an option for adaptive reprojection to seamlessly switch between 120 and 60 internal-FPS modes (both with 120 Hz sensor-based image updates) depending on the hardware load.</li><li>Built-in support for the standard CUBE video and photo color grading lookup tables (LUTs) along with camera signal emulation (with various device emulation modes and custom device curve support) and post-process dithering.</li></ul>", "metacritic": null, "released": "2020-09-08", "tba": false, "updated": "2020-09-11T14:57:48", "background_image": "https://media.rawg.io/media/screenshots/e37/e37a19be14987940b2b922aa476fac05.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 403, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Lithium Ballistics"], "genres": ["Action"], "publishers": [], "esrb_rating": null}