{"id": 49318, "slug": "darts-of-fury", "name": "Darts of Fury", "name_original": "Darts of Fury", "description": "Let's play darts! Compete against real opponents in this stunning multiplayer darts game. 'Darts of Fury' is an action-packed, modern darts game made for darts newcomers and fans alike. <br/><br/>MULTIPLAYER DARTS<br/>Pick up your darts, join Sparrows League and face your first challenger in a simple game of 101. Take aim, swipe to throw and play against real opponents from all over the world in competitive '01 matches. Race to get your score down to zero and be the first to checkout without going Bust. Earn XP to climb up the Leagues and aim for promotion to unlock better darts, faster flights, tougher rules (301, 501), and bigger rewards. Can you reach the legendary Eagles league? Unlock Battle mode to test your dart skills even further as you take on opponents in high stake, real-time multiplayer matches of darts classics Cricket, Shanghai and Count Up. <br/><br/>COLLECT AND UPGRADE DARTS<br/>Customize your darts with endless combinations of barrels, shafts and flights. With 80 darts, hundreds of flight designs and shaft stickers, you can show off your unique personality to your opponents. Earn coins in League matches to upgrade to slimmer, faster darts and increase your chances of getting that elusive perfect '180'.<br/><br/>MODERN ARENA<br/>Set in a stunning and crowd-packed arena, Darts of Fury is unlike any darts game you've ever seen before. Perfect for both darts newcomers and fans. Interactive dartboards highlight your targets, freeing you to concentrate on achieving the perfect throw. Meet 'Shot Bot' - your very own checkout guide drone. She'll guide you around the board in League, calculating the safest path to that winning checkout. Big screen action, explosive celebrations, interactive dartboards, and digital oches all bring darts into the 21st century.<br/><br/>AND MORE<br/>• Training Mode features a fast paced game of Round the Clock<br/>• Hot streaks<br/>• Facebook and Google sign in so you can save progress across devices<br/>• Loads of achievements to collect<br/>• Player stats <br/>• Flag selection<br/>• Language support<br/><br/>SUPPORT<br/>If you have any problems with Darts of Fury or you just want to tell us about a feature you'd love to see, then you can reach us at https://support.yaku.to<br/><br/>Note: Darts of Fury is free to download. However, some items are available to purchase with real money. If you don't want to use this feature, please disable in-app purchases in your device settings.", "metacritic": null, "released": "2017-10-18", "tba": false, "updated": "2019-07-30T22:13:54", "background_image": "https://media.rawg.io/media/screenshots/af7/af79e08c0da7e19442c5a513c91f7586.jpg", "website": "http://www.dartsoffury.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 236, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android", "iOS"], "developers": ["Yakuto"], "genres": ["Action", "Sports"], "publishers": ["Yakuto"], "esrb_rating": null}