{"id": 493187, "slug": "poly-f1-racing", "name": "Poly-F1 Racing", "name_original": "Poly-F1 Racing", "description": "<p>Formation lap is almost over, as you push gently on the throttle and brutally steer 1 last time from left to right, trying to maintain a high temperature on your wheels. You know it's the key to get through the 1 st corner as fast as you can. Probably it will allow you to make a good start and overtake the two cars in front of you. They already reached their starting spots.</p>\n<p>1 st red light of the traffic light turns on. You did this already, you know how to do it. Your right foot pushes gently gas pedal.<br/>Second red light is on, rpm hits the limiter.<br/>Third red light is on. The engine now howles loud, while you try to find the right rpms for a perfect start.<br/>Four red light is on. The heat distortion waves of the formula cars in front of you suggest all drivers are ready for the fight.<br/>Fifth red light is on. A fast glance to the steering wheel display. Everything is ok.<br/>Lights are out...</p>\n<p>Game Features :</p>\n<ul><li>Customizable Formula and Sports cars.</li><li>Day and Night different exciting circuits.</li><li>Side Mini-Map feature for better driving experience.</li><li>Exciting AI for great challenges!</li><li>2 different modes- Lap Modes, Casual vehicle modes(includes all different multi-vehicles).</li><li>3 Camera Modes - FP, TP and far view mode.</li><li>Cash-Credits system for in-game purchases.</li><li>A surprsing special mode made !</li></ul>\n<p>Now, C'mon guys download it to your devices and share your experiences and reviews with me and don't forget to provide your feedbacks.</p>\n<p>Share it among your circle too,</p>\n<p>Cheers, R45productions!</p>", "metacritic": null, "released": "2020-08-16", "tba": false, "updated": "2020-09-11T15:35:43", "background_image": "https://media.rawg.io/media/screenshots/1d6/1d6db2fabe538d54846f17dacd6073c3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 174, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["r45productions"], "genres": ["Racing"], "publishers": [], "esrb_rating": null}