{"id": 493106, "slug": "switch-factory", "name": "Switch Factory", "name_original": "Switch Factory", "description": "<p>Switch Factory is a simple puzzle game crafted during a one week game jam (the Tri-Annual Game Jam) by one person on the theme \"You Are Your Enemy\".</p>\n<p>In this game, you play as a little bot that has to be killed by other little bots to get their abilities (jumping, climbing ladders, and opening doors).</p>\n<p>There are three levels in which you have to get the exit to finish the game. At the end of each level, a rank is given to the player depending of the times he/she has to be killed to find the exit.</p>\n\n<p>It's the first time I participate to a game jam alone and I was really pleased ! But, unfortunately, it wasn't the best condition to make a game in one week, because i was absent for almost three days of the game jam.</p>\n<p>The result is what it is, a simple game in which you have to be killed by others to become them, and unlock abilities.</p>\n<p>In terms of design, i'm not really proud, but i didn't wanted to spend more than one day about the idea of my game. So I came up with this simple features that i liked and tried to create a puzzle game around it, (if we can call those 3 levels puzzles), that is simply based on observation, and a sequence of actions to realize to find the exit. I think on a long term game the idea could be interesting, but, it's a one week jam.</p>\n<p>I had some difficulties through coding, that isn't really my speciality in game's creation, so I tried to be efficient and not spend too many time on problems and difficulties. I also think that you could find bugs, and one of the most important is the fact that the game isn't responsive on all screens.</p>\n<p>For the art and sound part, I did my best with the time constraint, and the fact, that i'm just an amateur didn't really help. But i avoided to have a game entirely with placeholder arts, and no sounds, so i'm happy with it.</p>\n<p>So even if my game isn't perfect, I hope it allows me to grab some experience !<br/></p>\n<p>Thanks for reading.</p>\n<p>Here is a link to my other games : https://scratchinartist.itch.io/<br/><br/></p>", "metacritic": null, "released": "2020-09-07", "tba": false, "updated": "2020-09-11T15:17:13", "background_image": "https://media.rawg.io/media/screenshots/59a/59a59bf77c1cd601a5fc8c1c505a54e7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["scratchinartist"], "genres": ["Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}