{"id": 49320, "slug": "highwind", "name": "Highwind", "name_original": "Highwind", "description": "In Highwind you control a paper plane using only two buttons. You will destroy enemy planes and protect your own. Tapping the right side of the screen will shoot bullets and holding the left side will activate the shield. The shield blocks and reflects bullets back to your enemies.<br/><br/>Fight different enemy planes and obstacles, each with different behavior. Travel to different dimensions and avoid obstacles on the way.<br/><br/>As you progress through the game you will be able to purchase upgrades to your health, shield and ammo. Also, each time you beat a level you will get a power up that will help you defeat your enemies.<br/><br/>Each time you play you will accumulate points that will unlock new planes and new game styles. Try to beat the game in each one of the different styles!<br/><br/>Features<br/><br/>-Simple controls: Play with only two buttons<br/>-Different game styles: Five variations of the game including an infinite mode<br/>-Minigames: Three additional sections with different mechanics<br/>-A different experience each play: Enemy waves are randomly selected from a predefined set<br/>-Upgrades and power ups: Purchase upgrades to your shield, ammo and health. Get a power up every level<br/>-Different airplanes: Unlock new airplanes with different stats", "metacritic": null, "released": "2017-10-25", "tba": false, "updated": "2023-10-13T05:36:09", "background_image": "https://media.rawg.io/media/screenshots/63d/63dc3a090a923941ad72bbe2952d3a5e.jpg", "website": "http://highwind.selvainteractive.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 87, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["Selva Interactive"], "genres": ["Action", "Arcade", "Casual"], "publishers": ["Selva Interactive Sociedad Anonima"], "esrb_rating": "Everyone 10+"}