{"id": 493223, "slug": "venus-improbable-dream-free-demo", "name": "Venus: Improbable Dream Free Demo", "name_original": "Venus: Improbable Dream Free Demo", "description": "<p>Created almost entirely by one person, 'Venus: Improbable Dream' is a choice-based visual novel game centred around music, friendship, romance and mental health.  With four different endings to explore, and many player decisions along the way, its aim is to highlight the importance of understanding and compassion for those with disabilities and mental health issues, and to remind such people that they are wonderful and worthy of love.  It's also a fun and touching adventure that explores how powerful music can be, and features real life pieces by celebrated composers!</p>\n<p><strong>WARNING</strong>: Contains themes of depression and anxiety, and depiction of panic attacks.</p>\n<p><strong>Synopsis:</strong></p>\n<p>Akane Kakeru is not your average 17 year old.  Thanks to a disfigurement he gained at birth, he spends his days struggling with social anxiety and wishing to be invisible.  Everything changes for him when he's placed into the after school music club, in an attempt to coax him out of his shell.  It's here that he meets Fujiwara Haruka, a disabled girl with a shy disposition, and a gift for music.  As the two of them begin to connect, Kakeru remembers what it's like to yearn for friends, to be confident in himself, and most importantly, to have a dream. Will he be able to truly face his inner fears once and for all, and achieve something he never thought possible? That’s up to you!<br/></p>\n<p>This free demo is for you to enjoy and get a feel for the game!  The demo contains roughly 3-4 hours of gameplay.  If you like what you see, please consider supporting Venus: Improbable Dream on Kickstarter!<br/></p>\n<p>https://www.kickstarter.com/projects/shirliainsworth/venus-improbable-dream?ref=...<br/></p>", "metacritic": null, "released": "2020-09-07", "tba": false, "updated": "2020-09-11T15:44:48", "background_image": "https://media.rawg.io/media/screenshots/ca3/ca3ca4ffba0594267028d23d5786c499.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 223, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["BorealisGames"], "genres": [], "publishers": [], "esrb_rating": null}