{"id": 493206, "slug": "carrolls-riddles", "name": "Carroll's Riddles", "name_original": "Carroll's Riddles", "description": "<p>[Please use Oculus Quest with Touch controllers]</p>\n<p><strong>[v1.02 Update]</strong> </p>\n<ul><li><strong>Added DEMO and Paid versions</strong> (for supporting further development).</li><li><strong>Added new locomotion to move around</strong> (i.e., holding grip buttons and move your hands up and down). </li><li><strong>Added three levels of Carroll Diagram</strong> (2x1, 2x2 with hints, 2x2 PRO).</li></ul>\n<p>Find us on Discord (https://discord.gg/tqp5w7h)</p>\n<p>--</p>\n<p>With ScienceVR's Carroll’s Riddles, you are invited on a journey to a mind-bending dimension created based on Lewis Carroll's Alice in Wonderland (1865) and The Game of Logic (1886).</p>\n<p>We design Carroll's Riddles to create a new expression of storytelling and STEM learning in an imaginary place where we can visualize ideas. We heard about Alice and the rabbit hole from cartoons, books, and movies, so most people are familiar with them. In addition, there are metaphors related to Alice found in many modern stories. We believe in combing Carroll's works in mathematics and logic with stories from Alice in Wonderland. This experience will be both entertaining and educational.</p>\n<p>Lewis Carroll invented a tool - the Carroll Diagram (1886) - to visualize the attributes of things which we re-created in Carroll’s Riddles. Aided with this interactive Carroll Diagram, you can only make your way out of the tree hole by tackling the logic riddles. We suppose this interactive and guided approach can accelerate your mastery of logic.</p>\n<p>This immersive journey is unlike any other, pushing the limits of the viewer’s imagination and challenging them to make sense of a nonsensical world. Will you be able to master Carroll Diagram in this VR wonderland?</p>\n<p>Carroll's Riddles VR app is created with Unreal Engine 4.24. Please let us know what you think :) Please consider supporting our indie development by being a subscriber of ScienceVR ($99 to receive Oculus Store keys for our VR labs via sciencevr.com).<br/></p>\n<p>Have fun!</p>\n<p>Jackie at sciencevr.com</p>", "metacritic": null, "released": "2020-09-05", "tba": false, "updated": "2020-09-11T15:40:35", "background_image": "https://media.rawg.io/media/screenshots/6bb/6bb61f2502473061d0b613bbf05aa5d6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 58, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["sciencevr"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}