{"id": 493361, "slug": "witch-machine-spilled-vessel", "name": "witch machine: spilled vessel", "name_original": "witch machine: spilled vessel", "description": "'Witch Machine: Spilled Vessel' was supposed to be an experiment, meant to push the Game Boy to its limits.\r\nInitially a passion project by ex-Godhead Interactive developers (creators of Witch Machine, 1996, restored by the Video Memories Project in 2019), Spilled Vessel was doomed from the start.<br/>A handful of employees at Godhead, on orders from their boss, took their equipment home with them in the days leading up to the company's bankruptcy filing. Thousands of dollars in equipment was reported as stolen, and among the workstations and supplies were two Game Boy devkits, both of which were blacklisted so that any games developed on the hardware would be rejected during Nintendo's approval process.<br/>This meant the fate of Spilled Vessel, once developed, lied in the hands of a legally dubious unlicensed publisher, shrinking the game's potential audience and tanking its financial viability. The team continued working on it regardless, but infighting and legal questions about who owned the rights to Witch Machine prevented the game from getting to catridge.\r\nDuring our work on Witch Machine, there was no indication from the ex-Godhead employees we spoke to that a sequel had been in the works.<br/>Faye Marten, a former Godhead intern, emailed us as soon as she saw Witch Machine had been restored to tell us she'd stuck with the development team after the company dissolved. She was 17 at the time, so she couldn't sign a non-disclosure agreement. Whether or not she was a \"liability\" was, according to her, one of the many things the devs fought over while developing Spilled Vessel.<br/>Faye told us in her email that she overheard her boss pulling out of their publishing contract one day and decided to stay late that night. Once the office cleared out, she put the project files on her flash drive and took it home with her. The next day, she got a call from a coworker saying she was out of a job.<br/>We got in touch with several ex-Godhead Interactive developers she said could vouch for her story. Most didn't respond, but a couple of them (who asked to be kept anonymous, presumably for NDA reasons) were kind enough to talk to us about the game's troubled development and help us piece parts of it back together.\r\nNow, for the first time, Witch Machine: Spilled Vessel is available to the public; another restored piece of video game history from VMP.\r\n(Note: The above synopsis reflects what VMP was able to confirm about the game's development. Some info Faye sent us was omitted, as the developers who got back to us were unwilling to discuss some of the more outlandish claims she made about her time at Godhead.)\r\na submission for GBJAM 8. <p>and a direct sequel to last year's entry, witch machine. <br/>not necessary to play, just good to know.</p>\n<p><strong> default keybindings:</strong><br/>- arrow keys: walk<br/>\r\n- Z (\"A\"): confirm  <br/>- X (\"B\"): cancel<br/>- V (\"Start\"): menu</p>\r\nknown issues:\r\n<p>-  the witch fight in the second house may cause the game to crash after victory<br/>- using the first aid kit during the final boss will crash the game</p>\r\ncontributors: (alphabetical) \r\n<p>- gilmore girls expert: austinbrook  (@austindotorg)<br/>- music: max knightley (@maxiesatan)<br/>\r\n- oh, you know: victoria lacroix (@arachonteur)<br/>- big nuisance: gwen lawson (@lesbosmer)<br/>\r\n- environment writing: mabel mabel (@rintezukas)<br/>- vmp copy writing: john l moore (@john_l_moore)<br/>\r\n- animation: jane underscore (@janederscore)</p>", "metacritic": null, "released": "2020-09-07", "tba": false, "updated": "2020-09-11T16:19:37", "background_image": "https://media.rawg.io/media/screenshots/259/259a88d9c22c6c177ca9737ba9d5e073.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 92, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["victoria lacroix"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}