{"id": 493346, "slug": "space-war-battle-cadet-xxl-hyper-edition-v", "name": "Space War Battle Cadet: XXL HYPER EDITION V", "name_original": "Space War Battle Cadet: XXL HYPER EDITION V", "description": "<p>Good day, Cadet! We are under attack.<br/></p>\n<p>As an order from the Space Alliance, you are ordered to compromise an entire army of alien invaders on a solo mission of courage and honor. It is your destiny to save planet earth from these foul beings. To help you on your journey, you have received one of the best space ships we can offer... to someone of <em>your </em>ranking. As with all other Space Cadets, your ship can change between 3 of the 4 colors that exist in this world.  It's also got a banging stereo. I've loaded up some filthy drum and bass for the road.</p>\n<p>-Yours faithfully,<br/>General Maya Armies, Sleeve Division.<br/>The Space Alliance.</p>\n<p><strong>How to Play:<br/></strong>Space War Battle Cadet: XXL HYPER EDITION V is a simple bullet-hell game designed with four colors, a resolution of 160x144, and was built in the Unity engine for Windows.</p>\n<p>The aim of the game is to complete all waves and an end-game boss within the time limit. There are three colors of ships in the game (<em>Orange, Purple, and Monochrome</em>). You must swap to the corresponding ship color to absorb enemy ship projectiles and to damage ships of the corresponding color. The progress bar at the bottom of the screen indicates how far along the game you have come and switches to the enemy boss health meter... if you arrive at that stage.<br/></p>\n<p><strong>Controls:</strong><br/><em>Best played with a controller, but a keyboard will suffice!<br/> You can use any controller of your choice to play this game. Nintendo Switch, Xbox, PlayStation... heck, even an NES controller.</em></p>\n<p>Controllers</p>\n<ul><li>A/Cross and B/Circle<strong>*</strong> to swap ship color and projectile color.</li><li>D-Pad to move.</li><li>Start and Pause to select menu buttons.</li></ul>\n<p>Keyboard</p>\n<ul><li>'O' and 'K'<strong>*</strong> to swap ship color and projectile color.</li><li>WASD to move.</li><li>G and H to select menu buttons</li></ul>\n<p><strong>*</strong><em>Note, these controls can be inverted in the game settings.<br/></em></p>\n<p>Developed by:<br/><br/>Artwork and music composed by Avery Mullen.<br/>Programmed by Lyes Oussaiden and Jann Andre Fjelde Mjøen.<br/>Designed by all of us. <strong>&lt;3</strong><br/></p>\n<p>This title was developed for GBJam 8 between Saturday the 29th of August 2020 and Sunday the 7th of September 2020.<br/><br/></p>", "metacritic": null, "released": "2020-09-07", "tba": false, "updated": "2020-09-11T16:16:23", "background_image": "https://media.rawg.io/media/screenshots/713/71319770c33e174fd369dd28d69ac0c3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 22, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Midnight Marmalade"], "genres": ["Action"], "publishers": [], "esrb_rating": null}