{"id": 493485, "slug": "supreme-stickman-shadow-fight", "name": "Supreme Stickman: Shadow Fight", "name_original": "Supreme Stickman: Shadow Fight", "description": "Explore new stickman SuperHeroes and Super Villains, ultimate skills and nonstop one-on-one combats, through several places of Supreme Stickman: Shadow Fight! Becoming a stronger heroes, faster stickman, deadlier and compete against dangerous villains! Join the battle with your favorite manga characters and fighting in Danger Battles across the comics.<br/><br/>MORE HEROES, MORE SKILLS, MORE FIGHTS!<br/>Supreme Stickman: Shadow Fight contains a large variety of powerful Shadow heroes and warriors, so feel free to choose a favorite character and discover this new world. Those masters of martial arts have unique styles of fighting, assassination and ultimate skills, so if you could manage to combine the right fighters to the right combo, your phone would get multiple flashy effects which attracts people nearby! That’s how we want to play, too! More Supreme Heroes, more friends, more fun!<br/>Also, it is recommended that you put volume up to get the most experience of this game. The sound effects for each hero are different, so you can feel the intense of the combat.<br/><br/>SEVERAL FEATURES<br/>Collect over 200 Super Heroes and Super Villains to assemble your ultimate team.<br/>- Level up your characters and their gear to unleash their full powers!<br/>- Build classic teams to take advantage of special bonus effects.<br/>- Choose from hundreds of Uniforms to increase your character’s powers and perfect your hero's look.<br/>- Upgrade powerful characters in Epic Quests!<br/><br/>ORINGINAL NEW STORIES ONLY FOUND IN SUPREME STICKMAN: SHADOW FIGHT! <br/>- Experience unique, never-before-seen stories to find out who’s responsible for threatening the existence of your universe!<br/>- Play through Special Missions featuring the New Super human and Inhumans…", "metacritic": null, "released": "2020-07-30", "tba": false, "updated": "2020-09-11T19:40:39", "background_image": "https://media.rawg.io/media/screenshots/0d8/0d87db74a30dff20817aa8527a85aa3e_IBZJ7sd.jpg", "website": "https://funnii.net", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 157, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["FUNNII PTE"], "genres": ["Action", "Adventure"], "publishers": ["FUNNII PTE"], "esrb_rating": "Teen"}