{"id": 493459, "slug": "city-of-gangsters", "name": "City of Gangsters", "name_original": "City of Gangsters", "description": "<p>Start a crime syndicate from nothing, and grow it into a well-oiled money machine. Build speakeasies and illegal distilleries. Manage production chains and resource distribution. Smuggle goods from out of town and bribe the police to look the other way. Grow a powerful crew and keep your rivals under your thumb. Eliminate competition and rule the city. But most importantly, keep the money flowing.<br />\nThe year is 1920, the start of Prohibition in the USA. With congressional action, a huge segment of the national economy becomes illegal overnight: bars and saloons are ordered to close, distilleries and breweries go quiet, distributors shut down. But a new era is dawning: a gilded age for smugglers, black markets, illegal manufacture, and organized crime.<br />\nThis is where you come in.  You’re a new arrival in the city at the dawn of Prohibition, with ambitions of striking it big. Behind many of the city’s facades, people are building makeshift distilleries, secret loading docks, nighttime speakeasies. Work your way into this network, and the world will be yours.<br />\nBut think beyond making a quick buck or two. You gotta be thinking ahead. You gotta be thinking bigger. Much bigger.<br />\nWell-organized crime<br />\nGet started in the booze biz by hocking some homemade hooch. Start your own stills, and find raw materials to supply them. Learn new techniques to make expensive drinks, or smuggle imported booze to fuel your growing operation. Soon you’ll be supplying entire neighborhoods, and opening your own swinging speakeasies.<br />\nYou gotta know a guy<br />\nOn the black market, social currency matters as much as the greenback. With cops and feds sniffing around, trust is everything and personal introductions are worth their weight in gold. So work your connections to find profitable new friends, and get people who owe you favors to put in a good word.<br />\nYou can’t do it alone<br />\n​​​​​​​You will need plenty of hands to open new fronts, do delivery runs, and protect your product from envious rivals. Your outfit’s ambitions are only limited by the number of people working for you. Keep them paid, armed, and organized, and who knows how far and how fast you’ll rise.<br />\nThe walls have ears​​​​​​​<br />\nBut proceed carefully, because everyone is always observing what you’re doing, and family members stick up for each other. Whether you send your people to harass someone, or to help them, you can be sure they’ll remember it down the line.<br />\nGetting territorial​​​​​​​<br />\nAs your outfit grows, convince locals that your goods and theirs will be looked after. Territory under your control will provide a safety net, an income base, and a wealth of opportunities for further growth and expansion.<br />\nThis era belongs to you​​​​​​​<br />\nYou’ve grabbed the opportunity by the horns, and the city is yours for the taking. But you only have a few years to make your mark on history, to build the largest, most profitable crime syndicate, take over your competition, and rule the entire city.<br />\nBecause after 1933, it will be all over, alcohol will be legal again. And doing business fair and square, well, everybody knows that’s not where the real money is.</p>", "metacritic": null, "released": "2021-08-09", "tba": false, "updated": "2024-01-19T13:35:52", "background_image": "https://media.rawg.io/media/screenshots/f2d/f2db3c491307ae5b5efb92242dcd024c.jpg", "website": "https://www.kasedogames.com/cityofgangsters", "rating": 3.0, "rating_top": 3, "added_by_status": {"yet": 55, "owned": 87, "beaten": 2, "toplay": 8, "dropped": 10, "playing": 2}, "playtime": 4, "achievements_count": 80, "ratings_count": 12, "suggestions_count": 314, "game_series_count": 0, "reviews_count": 13, "platforms": ["PC"], "developers": ["SomaSim", "Kasedo Games"], "genres": ["Strategy", "Simulation"], "publishers": ["Kasedo Games"], "esrb_rating": null}