{"id": 493457, "slug": "icbm-2", "name": "ICBM", "name_original": "ICBM", "description": "ICBM is a real-time strategy game of nuclear destruction. Research new technologies, build up your nuclear stockpile and use a combination of ships, planes and missiles to strike at the heart of your opponents’ cities while keeping your population safe from harm.<br/><br/><br/>Take command of one of the continents of the world and prepare yourself for global nuclear conflict. It is your job to ensure the complete and total destruction of your enemies, while you do all in your power to prevent enemy retaliation against your peace-loving citizens.<br/><br/><br/>Research and develop your nuclear arsenal. Will you focus on developing new technologies, or mass producing existing ones? It takes a true strategist to research and build a balanced force that can deal with a multitude of enemy tactics.<br/><br/><br/>In ICBM, you can try out different strategies every time you play. Will you overwhelm your enemy with intercontinental ballistic missiles? Use bombers to deliver massive payloads? Or maybe use submarines to deliver nukes from the least expected locations? These strategies and more can all be used to ensure victory. ICBM has 20 unit types and 12 nuclear weapon types to use, plus 44 technologies to explore.<br/><br/><br/>Take the time to carefully plan your next move, or just nuke your opponents as fast as you can. Increase the contamination speed for a swift and painless nuclear war, or slow it down for an endless nightmare. In ICBM, you can constantly adjust the game speed to your own pace.<br/><br/><br/>Use diplomacy to gain strategic advantages. Share information, technologies or even the location of your nukes with your allies to wage war against common enemies. Be aware however that these alliances do not have to last and you might find yourself fending off attacks by your former friends. <br/><br/><br/>Reduce micro-management by making use of the strike planner. Set up detailed plans in advance, targeting specific structures, units and cities and synchronise your ICBM launches to overwhelm the enemies defences. <br/><br/><br/>Play with up to seven other players in multiplayer matches. Play in free for all, fixed teams or coop games, all while improving your ELO score as you climb the leaderboard.  <br/><br/><br/>Up for something different? ICBM comes with full modding support out of the box. Add or change maps, units, technologies, rules, graphics and much more.<br/><br/>", "metacritic": null, "released": "2020-11-17", "tba": false, "updated": "2023-11-06T16:09:11", "background_image": "https://media.rawg.io/media/screenshots/e8d/e8d2e7a23475404080246fda59113f4f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 25, "toplay": 3}, "playtime": 1, "achievements_count": 20, "ratings_count": 0, "suggestions_count": 217, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["K-Project", "SoftWarWare"], "genres": ["Strategy"], "publishers": ["Slitherine"], "esrb_rating": null}