{"id": 493429, "slug": "microodyssey", "name": "Microodyssey", "name_original": "Microodyssey", "description": "In an attempt to investigate into the <strong>ultimate nature of reality</strong>, a team of scientists, under the name of <strong>Microspace Corporation</strong>, develop a powerful machine in order to scale down the matter. After the first three tests on humans, in which they lost contact with the representative scientists into the so-called “<strong>Microworld</strong>”, they are going to test this machine on another human for the fourth time. <br/><br/><strong>Axel</strong> has the same objective of the previous three scientists: to go smaller and smaller, trying to discover what there is at the very end of the Microworld. At the same time, his secondary goal is to try to find and rescue the scientists lost in the previous missions. <br/><br/>During his odyssey, <strong>from the bigger particles to the smallest things in the Universe</strong>, Axel will encounter many characters, articulated stories, and impossible environments. From minerals, to cells, to molecules, to atoms, to sub-particles, to the quantum world and beyond, Axel will experience an extraordinary adventure that will bring him toward the ultimate scientific question: why everything exist?<br/><br/><br/><br/><br/><br/>Axel, the main character<br/><br/><br/><br/><br/>The core of the gameplay of Microodyssey is centered on finding strategies to pass through a certain room. Just a single hit can result in a “game over”. <br/><br/>Axel has a special “<strong>Platform Gun</strong>”: when he shoot a bullet and this bullet collide with certain types of walls he will become a platform - that will stay alive for 3 seconds before disappearing; this is used to pass obstacles, solve light environmental puzzles, and finding original ways of passing through each room.<br/><br/><br/><br/><br/><br/><br/>In order to avoid trouble, Axel has many <strong>abilities</strong> that will acquire during its adventure in the Microworld.<br/><br/>As for example:<br/><br/><br/><br/><strong>Shooting</strong><br/><br/><br/><br/><strong>Super Bullet</strong><br/><br/><br/><br/><strong>Boost</strong><br/><br/><br/><br/><strong>Jetpack</strong><br/><br/>And many others...<br/><br/><br/><br/><br/>Many <strong>obstacles</strong> will stay along the way during Axel’s adventure. From evil crystals, to corrupted spiders, to viruses, to …dinosaurs! Yes, micro-dinosaurs! <br/><br/><br/><br/><br/><br/><br/>Every location of the game is set in smaller and smaller sizes into the matter. <br/><br/>From bigger to smaller, Axel will reach 8 realms, that will compose the <strong>8 chapters</strong> of the game:<br/><br/>- Mineral level<br/>- Cellular level<br/>- Molecular level<br/>- Atomic level<br/>- Sub-atomic level<br/>- Photonic level<br/>- Quantum level<br/>- Singularity<br/><br/><br/><br/><br/><br/><br/>Hi! I'm Nicola Mari and I'm a Research Scientist. I’m developing all this thing <strong>solo</strong>. With just a minimum help from other artists (for example, for some of the music and for the cover art). Thus, Microodyssey will take me still some time to be completed. <br/><br/>But in the meantime, I really appreciate your interest, support and patience!  <br/><br/>I worked a lot on the first five chapters of the game (they are almost done!) – the whole game will comprise 8 chapters in total. <br/><br/>Hope to have you playing my game in the end! If you like 2D pixel-art platforms with a unique story, <strong>you will be truly satisfied!</strong><br/><br/><br/>", "metacritic": null, "released": "2020-09-10", "tba": false, "updated": "2020-09-11T19:04:44", "background_image": "https://media.rawg.io/media/screenshots/b42/b42ef9beabbad9584eb8fa0afb09e079.jpg", "website": "https://pulsarnikproductions.wordpress.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 161, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Pulsarnik Productions"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Pulsarnik Productions"], "esrb_rating": null}