{"id": 493481, "slug": "les-manley-in-search-for-the-king", "name": "Les Manley in: Search For The King", "name_original": "Les Manley in: Search For The King", "description": "He finds his clothes at K-Mart. He finds his dates at Radio Shack. And now he's out to get rich quick by finding the greatest entertainer of all time. Follow mild mannered Les Manley as he rocks 'n' rolls across America in search of big bucks, beautiful babes and...The King.<br/><br/>The first in Accolade's Les Manley series of adventure games, Search for the King begins with lovable nerd Les at a dead-end job rewinding video tapes at a failing TV station. The station pulls a publicity stunt offering a million dollars to anyone who can photograph \"The King\", and Les sees it as his chance to escape his job and impress the lady of his dreams. The search for the elusive legend takes Les across America – and places far beyond – on a colorful, humorous, and puzzling adventure.<br/><br/><ul><li>Converse and interact with dozens of unique characters<br/></li><li>Over 70 vibrant, detailed screens to explore on Les's journey<br/></li><li>Investigate, deduce, and solve puzzles to get ever closer to the elusive King<br/></li><li>Catchy and memorable soundtrack<br/></li><li>Explore with the mouse, act with the keyboard: use your wits and your words to solve puzzles with the text parser</li></ul>", "metacritic": null, "released": "1989-12-31", "tba": false, "updated": "2023-11-04T19:14:58", "background_image": "https://media.rawg.io/media/screenshots/3e0/3e0263b53b1df96306bb5a54bc7c9bf0.jpg", "website": "https://www.ziggurat.games/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 10, "beaten": 1, "toplay": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 207, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Accolade"], "genres": ["Adventure"], "publishers": ["Ziggurat", "Ziggurat Interactive"], "esrb_rating": null}