{"id": 493682, "slug": "lovelink", "name": "Lovelink", "name_original": "Lovelink", "description": "Meet your dream match – just one swipe away!<br/><br/>Lovelink is a virtual reality romance that lets you navigate your chats with your choices! With interesting, exciting and thrilling characters to browse through, dive into an all-new narrative dating experience. <br/><br/>Get to know your potential suitors! Learn about their lives and experience their unique stories. Collect steamy selfies, send emojis and make choices that influence your interactions and the outcome of the story, and who knows, maybe they’ll want to meet you for a date!<br/><br/>- SWIPE through more than 70 characters, of all backgrounds and desires, waiting to be matched with you!<br/>- CONNECT with your dream partner! Congratulations, it’s a match – time to get to know them a better and get to chatting.<br/>- CHAT and react with your match to level up your relationship! Chat away and make your choices. You never know where it may lead…<br/>- COLLECT selfies from your matches and view them any time in the Photo Gallery.<br/><br/>Time to get swiping in Lovelink!<br/><br/><br/>* Please note: Lovelink is completely free to play but offers some game items for purchase with real money. If you choose not to use this feature, you can disable in-app purchases in your device’s settings.<br/><br/>Compatible with iPhone 6 and up, iPad 5 and up, iPad mini 4 and up, iPod 6 and up, on devices with iOS Version 11 or later installed.<br/>--<br/><br/>Privacy policy can be found at https://legal.ludia.net/mobile/2019-2/privacyen.html<br/><br/>Terms of service can be found at https://legal.ludia.net/mobile/2019-2/termsen.html<br/><br/>http://legal.ludia.net/mobile/wys/legal.html<br/><br/>By installing this application you agree to the terms of the licensed agreements.", "metacritic": null, "released": "2020-09-08", "tba": false, "updated": "2020-09-14T01:56:29", "background_image": "https://media.rawg.io/media/screenshots/827/827803b729c0d40aa9a5dd70efbfa81f_pgEHjgj.jpg", "website": "https://lovelinkgame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 149, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ludia"], "genres": ["RPG", "Simulation"], "publishers": ["Ludia"], "esrb_rating": "Mature"}