{"id": 493677, "slug": "kingdom-of-force", "name": "Kingdom Of Force", "name_original": "Kingdom Of Force", "description": "<h3>Thank You Very Much For Clicking to See Our Game</h3>The game was originally developed by 4 people in the studio,<br/>We want to make a different strategy game,<br/>Development process twists and turns, team members have also changed a lot<br/>Even so, we still present the game in a complete form.<br/><br/>At present, the game has completed the production of the first version of the level mode and custom mode. We have more ideas and have more ways to play in our mind. such as random map, PVP, and even a map editor! These will be updated in later versions, but we need more support form you. In addition, the new content will not be charged!<br/>Now the game has opened the limited time discount. With the continuous update of the game content, the game price will gradually return to the original price. The earlier you buy, the more money you save! Thank you for your support!<h3>Full Description</h3><h3>[story Mode and Challenge Mode]</h3>The game has now opened five chapters, corresponding to the Human race, the Dragon race , the Naga race , the Wingman race and the Goblin race. Each race has a different story, and each chapter has 10 sections. The game is divided into story mode and challenge mode. After completing the story mode, you can also challenge the challenge mode and get more rewards. We will continue to update more races and levels!<h3>[custom Mode]</h3>Players can customize player information in a given map, team fight or multi player melee with computers!<h3>[race and Talent]</h3>Different races have their own racial skills, strong shields and sharp spears! Each race has its own talent system. Each race has 25 talent skills that you can customize. As the game progresses, you can gain talent points and strengthen your own troops!<h3>[control Resources]</h3>You can build logging field, farmland and barracks to obtain timber, grain and soldiers. Timber is used for building and upgrading, grain is used for producing soldiers, and barracks are used for training soldiers. Therefore, players need to weigh each other among these three kinds of buildings and resources to achieve the optimal strategy.<h3>[dispatch Troops]</h3>Send the trained soldiers from your city to the enemy's city. You should consider how to send the appropriate number of soldiers to the appropriate battlefield! Destroy the enemy and occupy their cities, and seize their resources!", "metacritic": null, "released": "2020-09-11", "tba": false, "updated": "2020-09-14T01:53:26", "background_image": "https://media.rawg.io/media/screenshots/8b9/8b926eeb1f2b9c45aa402d5ff2b261c1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 239, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Beijing Hydra Technology Co"], "genres": ["RPG", "Strategy", "Simulation"], "publishers": ["Beijing Hydra Technology Co"], "esrb_rating": null}