{"id": 493606, "slug": "bangsquash-demo", "name": "BangSquash DEMO", "name_original": "BangSquash DEMO", "description": "<p><strong>BangSquash</strong> is a block breaker-style game for <strong>Oculus Ques</strong>t which could be attractive for people of all ages. We believe Bang Squash to be an ideal game to show off the basic operation of the Oculus platform to novice players, or to get in a mini workout session in a couple of minutes. </p>\n<p>It is an arcade game, so each level could be repeatable many times and there aren’t two similar scenarios regarding the playing of levels, everything happens differently each time because of the realistic physics. </p>\n<p>The game launch with a whole set of fun <strong>achievements </strong>and an <strong>online</strong> <strong>ranking system (leaderboard)</strong> to increase replayability.</p>\n<p><strong>FULL Version is avaliable here</strong>: https://lebersoftware.itch.io/bangsquash</p>\r\nFeatures\r\n<p>You can play in numerous arenas (game levels) which have different difficulty levels and you must destroy colorful boxes which have different properties. Every arena has a unique color scheme and different obstacles/distribution of boxes. They have random royalty-free music, mainly Tech House.</p>\n<p>The geometry of the arenas are set up in such a way that the balls will always find their way back to the users side, however if they aren’t able to hit them in time, they lose them. Some of the challenge presented by the game comes from this requirement for good timing and precision. The player starts the game with a set number of (blue) balls. </p>\n<p>At any given time only a single blue ball can exist on the playing field, but breaking specific boxes might give the player the ability to play with multiple, differently colored additional balls simultaneously.</p>\n<p>The game is won by destroying all the boxes on the field, or lost if the player runs out of balls. The game will have a ranking system based on remaining lives and total time spent at the moment level completion.</p>\n\r\nGameObjects\r\n\n<p>· Rackets (left and right hand): The rackets have a hit and a catch mode the user can switch between with a button on the corresponding controllers.</p>\n<p>· Blue ball: The ball the user starts out playing with.</p>\n<p>· Green box: The most common box with no special properties.</p>\n<p>· Yellow box: Creates another ball after collision.</p>\n<p>· Purple box: Has to be hit multiple times to explode, remaining “lives” are displayed on the box.</p>\n<p>· Pink box: Speeds up the balls that have collided with it.</p>\n<p>· Blue box: minify the ball\r\n</p>\n<p>· Energy wall: Blocks the movement of balls while they are active.</p>\n<p>· Yellow ball: Created by exploding yellow boxes. Can be used like the normal balls.</p>\n\r\nControls\r\n\n<p><em>- move your hands to use the rackets. <strong>IN VERSION 1.5 we improved the collision detection between balls and rackets so now you won't lose any ball because of a wrong hit.</strong></em>\n</p>\n\n<p>- you can switch between hit&amp;catch mode with the primary and secondary hand trigger buttons (they are on the side of touch controllers)</p>\r\nRegister for online leaderboard\r\n<p>You can register your account in-game.</p>\n\r\nHow To Install\r\n<p>Please Install from SideQuest : https://sidequestvr.com/</p>\n<p>Alternatively, you can download the APK from this page and Check this guide if you need help on how to do it!</p>", "metacritic": null, "released": "2020-09-11", "tba": false, "updated": "2020-09-11T20:10:20", "background_image": "https://media.rawg.io/media/screenshots/9ff/9ffad7e4ec4e166536ef7b5254d3ff08.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 147, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["lebersoftware"], "genres": ["Action"], "publishers": [], "esrb_rating": null}