{"id": 493852, "slug": "not-so-dead", "name": "Not So Dead", "name_original": "Not So Dead", "description": "IOS Version will be available soon. Sorry for inconvenience.\r\n\n<p>Hidden inside a post-apocalyptic city, a small paramilitary team takes shelter in a fortified base while being relentlessly pursued by hordes of <strong><em>zombies</em></strong>.<br/>Your goal consists on running through wrecked streets in the search for food by making your way through unending waves of undeads.</p>\r\nAvailable Characters\r\n<p>You'll be able to take part in this decisive task by putting yourself on <strong>Arnold's and Cyriel's</strong> shoes, our brave heroes.</p>\n\n\n\n<p>Will you dare to figth those dead who are desperate to feed on you or will you stick to food scavenging by dodging enemies and obstacles?<br/></p>\r\nGame Content\r\n<p>Enjoy an extraordinary action mood under an acid conjunction of skill and dynamism, all through accurate shots and real-time strategy.</p>\r\nPlayer Mechanics\r\n<p>You'll be able to run, use special, character-specific abilities, jump over obstacles 'à la parkour', make enemy hordes explode, and above all shoot again and again. You have at your disposal all the ammo you will need; your only worry in that concern will be to aim propely and to empty as many weapon magazines as you can. Well and of course to enjoy the music!</p>\r\nEnemies\r\n<p><strong><em>Zombie</em></strong> variety isn't scarce in this game. These damned citizens, each with their own perks and behaviours, will try to give you a hard time, and also an unwanted scare-jump from time to time.</p>\n\n\n<br/>\n<p>As well as other not-so-photogenic dead you'll have to find and annihilate!</p>\r\nHow many hordes will you be able to survive?\r\n\n<strong>Available in English and Spanish.\r\nDoesn't require any hearing skill to be played. Sound effects and voices purely improve the gaming experience. </strong>\n<strong> Juego disponible en inglés y español.\r\nNo requiere ninguna habilidad auditiva para ser jugado. Los efectos de sonido y las voces mejoran la experiencia de juego.</strong>", "metacritic": null, "released": "2020-09-13", "tba": false, "updated": "2020-09-14T02:32:56", "background_image": "https://media.rawg.io/media/screenshots/a65/a65e7d91e9813d5ada8bb582db94f183.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 320, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Algebro", "Herrjea"], "genres": [], "publishers": [], "esrb_rating": null}