{"id": 493862, "slug": "mr-cube", "name": "MR. CUBE", "name_original": "MR. CUBE", "description": "<p>YOU ARE MR CUBE AND YOU'R OBJETIVE IS COMPLETE THE GAME</p>\n<p>HOW TO INSTALL: YOU JUST HAVE TO BRING THE .EXE FILE TO THE DESKTOP THEN DOUBLE CLICK IT AND AN INSTALLER WILL OPEN IF IN SOME CASES THE ANTIVIRUS DOES NOT ALLOW YOU TO OPEN IT JUST PAUSE IT AND DOWNLOAD IT IN THE FOLDER YOU WANT ALSO IF YOU WANT, CHECK THE DIRECT ACCESS BOX TO MAKE A DIRECT ACCESS TO THE DESKTOP THEN OPEN THE DIRECT ACCESS OR OPEN THE WINDOWS MENU AND OPEN IT AND READY TO PLAY!</p>\n<p>DISCLAIMER: THE GAME IN SOME CASES CAN BE VERY FRUSTRATING AND IF YOU ARE VERY \"TOXIC\" I WILL NOT BE CHARGED FOR DAMAGE TO THE COMPUTER SINCE YOU BROKE IT.</p>\n<p>SCAMS: THE GAME IS FREE BUT IF YOU HAVE PAID A FEW AMOUNT OF MONEY FOR THIS I SUGGEST YOU A REFUND OR IN THE MOST SERIOUS CASES, DEMAND IT AGAIN, I WILL NOT BE CHARGED IF THIS HAPPENS.</p>\n<p>PS: THIS GAME IS NOT COMPATIBLE WITH MAC</p>\n<p>PS 2: I'M NOT GOING TO MAKE A PORT FOR ANDROID BUT IF YOU WANT, YOU CAN ASK ME ABOUT YOUTUBE AND DO IT BUT IF YOU DIDN'T ASK ME FOR PERMISSION THEN THAT PORT WILL NOT BE THE OFFICIAL</p>\n<p>COMO INSTALAR:</p>\n<p>SOLO TIENES QUE LLEVAR EL ARCHIVO .EXE AL ESCRITORIO LUEGO DARLE DOBLE CLICK Y UN INSTALADOR SE ABRIRA</p>\n<p>SI EN ALGUNOS CASOS EL ANTIVIRUS NO TE PERMITE ABRIRLO SOLO PAUSALO Y DESCARGALO EN LA CARPETA QUE QUIERAS</p>\n<p>TAMBIEN SI QUIERES MARCA LA CASILLA DE ACCESO DIRECTO PARA HACER UN ACCESO DIRECTO AL ESCRITORIO</p>\n<p>LUEGO ABRIR EL ACCESO DIRECTO O ABRIR EL MENU DE WINDOWS Y ABRIRLO Y ¡LISTO A JUGAR!</p>\n<p>DESCARGO DE RESPONSABILIDAD:EL JUEGO EN ALGUNOS CASOS PUEDE SER MUY FRUSTRANTE Y SI ERES MUY \"TOXICO\"</p>\n<p>NO ME HAGO CARGO DE DAÑOS AL COMPUTADOR YA QUE TU LO ROMPISTE.</p>\n<p>ESTAFAS:EL JUEGO ES GRATUITO PERO SI HAS PAGADO UNA SIERTA CANTIDAD DE DINERO POR ESTE</p>\n<p>TE SUGIERO UN REMBOLSO O EN LOS CASOS MAS GRAVES DEMANDARLO OTRA VEZ YO NO ME HAGO CARGO SI ESTO PASA.</p>\n<p>POSDATA:ESTE JUEGO NO ES COMPATIBLE CON MAC</p>\n<p>POSDATA 2:NO VOY A HACER UN PORT PARA ANDROID PERO SI TU QUIERES PUEDES PREGUNTARME POR YOUTUBE</p>\n<p>Y HACERLO PERO SI NO ME PEDISTE PERMISO ENTONCES ESE PORT NO VA A SER EL OFICIAL</p>\n<p>КАК УСТАНОВИТЬ: ВЫ ПРОСТО ДОЛЖНЫ ПРИНЯТЬ ФАЙЛ .EXE НА РАБОЧИЙ СТОЛ, ТОГДА ДВАЖДЫ НАЖМИТЕ ЕГО И УСТАНОВЩИК ОТКРЫТ ЕСЛИ В НЕКОТОРЫХ СЛУЧАЯХ АНТИВИРУС НЕ ПОЗВОЛЯЕТ ВАМ ОТКРЫТЬ ЕГО, ПРОСТО ПРИОСТАНОВИТЕ ЕЕ И ЗАГРУЗИТЕ В ПАПКУ, КОТОРОЙ ВЫ ХОТИТЕ ТАКЖЕ, ЕСЛИ ВЫ ХОТИТЕ, ПРОВЕРЬТЕ ОКНО ПРЯМОГО ДОСТУПА, ЧТОБЫ ПОЛУЧИТЬ ПРЯМОЙ ДОСТУП К РАБОЧЕМУ СТОЛУ ЗАТЕМ ОТКРОЙТЕ ПРЯМОЙ ДОСТУП ИЛИ ОТКРОЙТЕ МЕНЮ WINDOWS, ОТКРОЙТЕ ЕГО И ГОТОВЫ ИГРАТЬ! ОТКАЗ ОТ ОТВЕТСТВЕННОСТИ: ИГРА В НЕКОТОРЫХ СЛУЧАЯХ МОЖЕТ БЫТЬ ОЧЕНЬ УДИВИТЕЛЬНОЙ, И ЕСЛИ ВЫ ОЧЕНЬ «ТОКСИЧНЫ» МЕНЯ НЕ БУДУ ПОВРЕЖДЕНЫ ЗА ПОВРЕЖДЕНИЕ КОМПЬЮТЕРА, ПОСКОЛЬКО ВЫ ВЫПОЛНИЛИ ЕГО. ЖУЛЬНИЧЕСТВО: ИГРА БЕСПЛАТНАЯ, НО ЕСЛИ ВЫ ЗАПЛАТИЛИ НЕСКОЛЬКО ДЕНЕГ Я ПРЕДЛАГАЮ ВАМ ВОЗВРАТ ИЛИ, В САМЫХ СЕРЬЕЗНЫХ СЛУЧАЯХ, ТРЕБУЙТЕ ЕГО СНОВА, В ЭТОМ СЛУЧАЕ МНЕ НЕ БУДУ ПЛАТИТЬ. PS: ЭТА ИГРА НЕ СОВМЕСТИМА С MAC PS 2: Я НЕ СОБИРАЮСЬ ДЕЛАТЬ ПОРТ ДЛЯ ANDROID, НО, ЕСЛИ ВЫ ХОТИТЕ, ВЫ МОЖЕТЕ СПРОСИТЬ МЕНЯ О YOUTUBE И ДЕЛАЙТЕ ЭТО, НО ЕСЛИ ВЫ НЕ СПРОСИЛИ У МЕНЯ РАЗРЕШЕНИЕ, ТО ПОРТ НЕ БУДЕТ ОФИЦИАЛЬНЫМ</p>\n<p>musica/music:</p>\n<p><strong>Who Likes to Party Kevin MacLeod (</strong><strong>incompetech.com</strong><strong>)</strong><br/><strong>Licensed under Creative Commons: By Attribution 3.0 License</strong><br/><strong>http://creativecommons.org/licenses/by/3.0/</strong></p>", "metacritic": null, "released": "2020-09-13", "tba": false, "updated": "2020-09-14T02:34:50", "background_image": "https://media.rawg.io/media/screenshots/4e6/4e6788c4ab9085e033622fc2903f9b46.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 54, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Emifiralero"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}