{"id": 494, "slug": "kingdom-rush-frontiers-hd", "name": "Kingdom Rush Frontiers HD", "name_original": "Kingdom Rush Frontiers HD", "description": "Now for Mac! Full HD version of KRF, all Heroes will unlock for free! NO IAP on this HD version of the game.<br/><br/>The world's most devilishly addictive defense game is back - welcome to Kingdom Rush: Frontiers! <br/><br/>Bigger and badder than ever before, Kingdom Rush: Frontiers is a whole new level of the furiously fast, enchantingly charming gameplay that made the original title an award-winning hit. Tap your troops through an epic (mis)adventure as you defend exotic lands from dragons, man-eating plants, and ghastly denizens of the underworld -all with flashy new towers, levels, heroes, and more goodies to help you crush your foes to a pulp. (Don't worry, we've still got all the good ol' stuff from the last game, too. It's vintage now.) <br/><br/>Kingdom Rush: Frontiers packs in so much content, it's like a fully upgraded artillery blast of mouthwatering, pixelated joy launched right into your smiling little face... and it hurts so good! <br/><br/>GAME FEATURES<br/><br/>• Fortify the frontier in exotic news lands - hold the line in deserts, jungles and even the underworld!<br/><br/>• Eight new specialized tower upgrades! Slice, sizzle, and stomp your foes with Crossbow Forts, Mighty Templars, Necromancers, and even Earthquake Machines - hey, we told you we were shaking things up.<br/><br/>• Over 18 tower abilities! Unleash Death Riders, pestilence clouds, or Assassins that steal and kill your enemies!<br/><br/>• Over 40 enemies with unique abilities! Stay on your toes as you fight through desert sandworms, tribal shamans, nomad tribes and underground terrors.<br/><br/>• Nine legendary heroes. Choose your champions and train their abilities!<br/><br/>• Special units and features on every stage! Watch out for the Black Dragon!<br/><br/>• Merciless boss fights! Hey, we told you to get those upgrades...<br/><br/>• Hours of gameplay with over 70 achievements!<br/><br/>• Classic, Iron, and Heroic game modes to challenge your tactical skills!<br/><br/>• Three difficulty modes! Are you up for a real challenge? Go with Hard mode!<br/>Intoxicating charm with a rousing score, full-bodied voice-overs and lovingly illustrated cartoon art! (Complete with cartoon blood, naturally.)<br/><br/>• In-game encyclopedia! True warriors know thine enemies... and their towers. Study up!<br/><br/>PRAISE FOR KINGDOM RUSH: IGN Editor's Choice, Slide To Play Must Have, 148 Apps Editor's Choice, Jay is Games Game of the Year, Pocket Gamer Gold Award, Touch Arcade 4.5/5, CNET. Best iPad Games", "metacritic": null, "released": "2013-06-06", "tba": false, "updated": "2019-07-30T02:58:31", "background_image": "https://media.rawg.io/media/screenshots/864/8646080a23de6d68c26e22a09d7b0470.jpg", "website": "http://www.ironhidegames.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "beaten": 4}, "playtime": 0, "achievements_count": 0, "ratings_count": 4, "suggestions_count": 248, "game_series_count": 0, "reviews_count": 4, "platforms": ["macOS", "iOS"], "developers": ["Ironhide"], "genres": ["Action", "Strategy"], "publishers": ["Ironhide"], "esrb_rating": null}