{"id": 49403, "slug": "wonky-ship", "name": "Wonky Ship", "name_original": "Wonky Ship", "description": "[Surgeon General’s Warning]<br/>This game is NOT recommended for the faint of heart. Playing may cause cold sweats, rage blisters, screech-face, intense euphoria, and well, straight up wonkiness.<br/><br/>So whats this all about?<br/>You’re a daring intergalactic pilot, desperately trying to outmaneuver the ravenous pull of a plasma-fueled black hole. You'll weave, dodge, cuss, flip out, and roll around like you’ve never done in a video game before. And then you’ll die. Often.<br/><br/>Like all the time. <br/><br/>Hope you enjoy disintegration!<br/> <br/>What our fans are saying:<br/>\"This is the final frontier. The most intense experience I've had standing up.\" —Capt. K<br/>\"Wonky Ship really blew my mind—and I've blown up fully armed and operational battle stations.\" —Luke S. <br/>\"Roarghejhwharrrrrr.\" —Chew B. <br/>\"And I thought dance-offs were the hardest challenge in space.\" —Star-Prince. Or was it Space Lord?<br/>\"I told our programmers, 'Make a hard game.' Not like this. Not like this.\" —S. Johnson, Kiz Studios<br/><br/>Prepare to experience one of the most intense, addictive, and challenging arcade games ever created. Invite your friends to play and engage in our Multiplayer Madness mode. Joust, ram, and outsmart your fellow pilots to see who gets vaporized first.<br/><br/>In space, no one can hear you throw your controller against a wall.<br/><br/>Highlights:<br/>• INSANE CHALLENGE – Outmaneuver a vicious, plasma-fueled black hole for as long as you can. Easy right?!<br/>• HIGH VELOCITY FUN – Jump in and play instantly. A game with NO learning curve or respect for your safety.<br/>• BEST YOUR FRIENDS – Earn points to score big and dominate the global leaderboard. Just stay alive!<br/>• DEMOLISH YOUR FOES – Who can you force into the black hole first? Welcome to the ultimate way to lose friends at the speed of light.", "metacritic": null, "released": "2015-09-10", "tba": false, "updated": "2019-10-22T14:21:34", "background_image": "https://media.rawg.io/media/screenshots/07d/07dbceefd0ebc267a5e8fe2422d1e02a.jpg", "website": "http://wonkyship.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 114, "dropped": 1}, "playtime": 1, "achievements_count": 12, "ratings_count": 0, "suggestions_count": 77, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "iOS"], "developers": ["Kiz Studios"], "genres": ["Action", "Arcade", "Casual"], "publishers": ["You42", "Kiz Toys"], "esrb_rating": "Everyone 10+"}