{"id": 494075, "slug": "infested-lands", "name": "Infested Lands (itch)", "name_original": "Infested Lands (itch)", "description": "<p><strong>An Action Survival Top-down Shooter.</strong></p>\n<p>Design by Max. L &amp; Jeffery</p>\n<p>Code by Tom. K</p>\n\n<p><strong>Controls: </strong></p>\n<p>Movement: WASD</p>\n<p>Skill 1: F       Skill 2: G</p>\n<p>Shoot: Left Click</p>\n\n<p><strong>Story:</strong></p>\n<p>September, 21, 2020: WWIII was started. It was called “World war 3” because... well, Nearly the whole world went to war with each other. It was also the third one of those massive “World wars.” During a massive battle, a disease from the east met a disease from the south. In another battle, a disease from the west met a disease from the north. Then, the diseases all met together, no wait… The diseases from the west and north merged… So did the ones from the south and east. They spread until the hybrids met each other in a battlefield. An infected soldier was later shot, and killed. We don’t know how, or why, But the disease reacted with the rotting body and then… As if it was a movie, the body was reanimated, but this time the disease wanted food. A lot more food. With the host, it began to go into populated areas. The disease began to spread. With people believing it was fake, and gathering in groups, the disease spiraled out of control. It had surpassed Covid-19 and the total death count skyrocketed. As the disease grew and mutated, the population of humans diminished. Now only a few humans remain, many working to find a cure… Others are just trying to survive in this infested land. Now, you must survive. Take your weapon and supplies. You’re going to need it.</p>", "metacritic": null, "released": "2020-09-12", "tba": false, "updated": "2020-09-14T03:23:59", "background_image": "https://media.rawg.io/media/screenshots/524/5245315d774a2712b70d5b2a7fc0d90c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 62, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Tom Kun"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}