{"id": 49401, "slug": "mobile-empire", "name": "Mobile Empire", "name_original": "Mobile Empire", "description": "game brief introduction \"Mobile Empire\"is a high degree of freedom stand-alone simulation game with the theme of \"making mobile phones\". You act as an entrepreneur back in 2001, because of the unique vision of the mysterious investors to start the funds, and then created a great technology enterprises. The game starts from 2001 to the end of 2035, and you'll start with the early development of smart phones, until you can end up using AR smart glasses. In these 35 years, you will have the opportunity to create miracles. you can make your company to become the world's first technology companies. core gameplay The core of \"mobile empire\" is to develop better drawings, upgrade more cattle technology, build stronger teams, develop better mobile phones, and earn more profits, so cycle. And \"how to use people\" is the essence of the game, according to the staff's ability, talent and skills, put the right employees in the right position. Employee collaboration also triggers team breakthrough, a new mechanism that allows players to create miracles. holds your conference According to the quality of your mobile phone, you can hold different product launches, from the unknown small venues to the National Convention Center. unique competitive experience In order to simulate a more real business environment, there are a large number of constantly updated competitors in the game, players can cooperate with them and develop together, but also for the fierce competition for talented people. a large number of random events In order to create a better sense of the world, the game is set in a large number of industry events, world events, crisis events, lucky events, employee events, news interviews and so on, waiting for you to make your own choice. rich drawings The game includes 65 mobile phone drawings completely different and more than 100 mobile phone appearance, from the mobile phone to the Full Screen Display, folding screen including AR smart glasses in the future, a large number of mysterious drawings is waiting for you to explore. massive technology There are a lot of upgrades available in the game, and all the accessories can be upgraded. In addition, you can even develop CPU and operating systems independently and support custom names when you have money. unique persuasion system In the recruitment of talents, the game has added a unique \"Persuasion\" system. If you want to get top talent, you need to use the different communication skills to convince each other according to the personality type of the other person. waiting for other content you explore The game also includes credit rating, corporate acquisitions, employee development, outsourcing model, intelligence system, corporate strategy and many other game content waiting for you to explore.", "metacritic": null, "released": "2017-11-17", "tba": false, "updated": "2020-08-03T02:38:00", "background_image": "https://media.rawg.io/media/screenshots/876/8761880c5eaee98600bb6d37e6f82f8d.jpg", "website": "http://www.huanzhenkeji.cn", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 10, "dropped": 2}, "playtime": 4, "achievements_count": 30, "ratings_count": 2, "suggestions_count": 147, "game_series_count": 0, "reviews_count": 2, "platforms": ["iOS", "PC"], "developers": ["X.D. Network", "Shanghai huan zhen Info Tech", "上海幻真信息科技有限公司"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["X.D. Network", "Shanghai huan zhen Info Tech"], "esrb_rating": null}