{"id": 49422, "slug": "hex-commander-fantasy-heroes", "name": "Hex Commander: Fantasy Heroes", "name_original": "Hex Commander: Fantasy Heroes", "description": "Hex Commander: Fantasy Heroes is a turn-based strategy game that will put you right in the middle of conflict between humans, orcs, goblins, elves and dwarves.<br/>Build a mighty army and lead your troops to victory, using unique skills of your units. Make use of terrain covers and buildings to upgrade your statistics and outwit your enemies. <br/>In the human campaign you assume the role of Percival Kent, a seasoned paladin who has been sent by the Emperor to investigate reports of goblin activity in a human settlement. The kingdom is at the brink of war… Who wants it to break out? What kind of alliance will you have to forge to face the inevitable invasion of the green-skinned foes? Take part in the exciting campaign to get to the bottom of truth and protect your people.<br/>To gain a tactical advantage you must resort to magic, which goes way beyond deploying specialized mage units. As a paladin, Percival is trained to use scrolls, which can turn the tide of battle in the blink of an eye. Summon the undead, lead your opponents into a rain of fire or a toxic cloud, and awaken their rage.<br/>Thanks to the Emperor, you have a base at your disposal. You can expand it according to your preferred fighting style. Upgrade your hero and your favorite units, and improve teleports to gain an edge on the battlefield.<br/><br/><strong>ACCESSIBLE AND COMPLEX STRATEGY GAME</strong><br/><ul><li>Turn-based strategy game with simple and clear rules and a tactical depth, thanks to which you can adjust the gameplay style to your individual preferences.<br/></li><li>Use the special skills of your hero and units to gain an edge on the battlefield.<br/></li><li>Expand your base, upgrade your army and recruit specialized units.<br/></li><li>Each of the available races has well-balanced units and features, which enforce a unique strategy and make the battles more exciting and varied.<br/></li><li>Complete the captivating campaign to learn the truth behind the war that will change your kingdom forever.</li></ul>", "metacritic": null, "released": "2017-12-22", "tba": false, "updated": "2019-11-20T10:56:59", "background_image": "https://media.rawg.io/media/screenshots/759/759a407968d502995546580608a59777.jpg", "website": "http://www.homenetgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 127, "dropped": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 415, "game_series_count": 0, "reviews_count": 3, "platforms": ["Linux", "PC", "macOS", "iOS"], "developers": ["Home Net Games", "Teresa Dymek"], "genres": ["Strategy", "Indie"], "publishers": ["Home Net Games", "Teresa Dymek"], "esrb_rating": null}