{"id": 494246, "slug": "la-table-du-soleil", "name": "La Table Du Soleil", "name_original": "La Table Du Soleil", "description": "<p>Aidez Gustave à devenir chef !<br/></p>\n<p>Gustave veut être chef mais d’abord il doit être le meilleur serveur !</p>\n<p>Entrainez Gustave à être le serveur le plus rapide.</p><p>Bienvenidos a  La table du soleil, el juego se compondrá de 3 sencillas mini actividades que hará nuestro Camarero Gustava en las que le ayudaremos, así teniendo un buen dia en su rutina de trabajo!!</p>\n<p>(inicio del mini actividad1)<br/>Al entrar en su dia laboral, encontraremos que la primera actividad será un asocie de dos elementos, del lado derecho estarán cada palabra de uno de los elementos situados en la mesa, deberas indicarle a Gustave dandole click al elemento y a su palabra antes de que el tiempo se agote y empiezen a llegar los clientes!! Justo a tiempo!! hemos ayudado a Gustave a  ordenar la mesa! <br/>(Fin del mini actividad 1)</p>\n<p>(inicio del mini actividad 2)<br/>Han llegado nuestros primeros clientes!! y es deber de Gustave conocer sus pedidos, será buena idea mantener los oidos bien abiertos para discernir entre 2 opciones que pensará nuestro Camarero Gustava, y ayudarlo a elegir la que es la correcta con un click derecho,  Apurate que nuestros clientes podrian cansarse de esperar y nos meteremos en problemas!!<br/>(Fin del mini actividad 2)</p>\n<p>(inicio del mini actividad 3)<br/>El cliente se ha mostrado satisfecho con el servicio de Gustave ye le ha llamado para decirle algo, podras ayudar a Gustave a armar las frases que te dira el cliente? escucha lo que le quieren decir, y escoge con el click las palabras correctas que conforman la oracion que escuchaste. Gustave: Un placer serviles!!<br/>(Fin del mini actividad 3)</p>\n<p>Hemos dado una gran ayuda a nuestro amigo Gustave, y le hemos facilitado su diá, bravo Gustave por haberlo logrado !!</p>", "metacritic": null, "released": "2020-09-12", "tba": false, "updated": "2020-09-14T04:04:08", "background_image": "https://media.rawg.io/media/screenshots/a81/a81de9e37550c0e6da85419dab947f7f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 82, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["beenok23"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}