{"id": 494373, "slug": "harry-potter-magic-awakened", "name": "Harry Potter: Magic Awakened", "name_original": "Harry Potter: Magic Awakened", "description": "<p>Test your skills against other witches and wizards in exciting multiplayer duels in the latest Harry Potter game!<br />\nHarry Potter: Magic Awakened is a new card collection game (CCG) and role-playing game (RPG) where you enroll at Hogwarts and explore the wizarding world. Play with friends and elevate your skills on a journey to master the magic!<br />\nWill you battle a dragon? Play with friends in PvP duels? You choose!<br />\nGame Features<br />\n- Collect and level 70+ Cards: Master the magic and cast spells like Stupefy and Incendio in card battles. Summon fantastic beasts and artefacts in PvP brawls and PvE challenges.<br />\n- New Harry Potter Story Game: You’ve arrived at Hogwarts 10 years after the defeat of Voldemort, and joined a new generation of witches and wizards. Encounter beloved characters and new adventure companions in Hogwarts and beyond!<br />\n- Role-play and Customize your own witch or wizard: Shop in Diagon Alley for wands, brooms and outfits to show off your magic, and much more.<br />\n- Explore and Socialize with other wizards: Connect with friends online in real-time, duel and explore Hogwarts together<br />\nWhat to do at Hogwarts?<br />\nHarry Potter: Magic Awakened combines the best of adventure games, RPG games and story games together! Online multiplayer games and role-playing story games enthusiasts alike will surely find a favourite activity at Hogwarts.<br />\n- Duelling Club: Enter the Duelling Club, a magic arena where Hogwarts students practise competitive card brawls, in solo or duo modes. Play with friends and jump into some real-time PvP action! Face off against other wizards online in fun PvP 1v1 or 2v2 multiplayer brawls. Step into the arena, select your cards, strategically position yourself, and coordinate as a team to rise to the top! Unlike traditional CCG games which favour turn-based card battle, players gain magic points real-time and can cast spells and summons (from Nifflers to Dragons), avoid opposing wizards’ attacks, and team up for brilliant combos.<br />\n- Attend Classes at Hogwarts: Collect new magic cards, brew potions, learn Harry Potter lore at History of Magic and more.<br />\n- Forbidden Forest: Enter at your own peril, follow clues, collect rare ingredients, fend off magical creatures and even face dragons.<br />\n- Dance Club: Invite your friends to the dance floor and impress them with dazzling moves.<br />\nHarry Potter: Magic Awakened goes beyond traditional CCG and card battle games. Play with friends or alone; enjoy PvP matches or co-op action; collect items, or enjoy the RPG game features that allow you to role-play as the witch or wizard that you’ve always wanted to become in the wizarding world.<br />\nForget about casual magic games and enroll as a true student of magic at Hogwarts, just like Harry Potter!<br />\nJoin our community:<br />\nWebsite: http://www.magicawakened.com<br />\nInstagram: https://www.instagram.com/hpmagicawakened/<br />\nTwitter: https://twitter.com/hpmagicawakened<br />\nFacebook: https://www.facebook.com/HarryPotterMagicAwakened/<br />\nYouTube: https://www.youtube.com/@HPMagicAwakened<br />\nDiscord: https://discord.gg/harrypottermagicawakened<br />\nHarry Potter: Magic Awakened is developed by Netease and co-published by WB Games under Portkey Games, a label creating video games inspired by J.K. Rowling&#39;s stories, from puzzle games to role-playing adventure and card battle games.</p>", "metacritic": null, "released": "2023-06-27", "tba": false, "updated": "2024-02-04T09:38:53", "background_image": "https://media.rawg.io/media/games/f41/f41c8af86c60d2d9fc2d138f8b6b4c4b.jpg", "website": "https://www.magicawakened.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 3, "beaten": 1, "toplay": 9, "dropped": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 4, "suggestions_count": 263, "game_series_count": 0, "reviews_count": 4, "platforms": ["iOS", "Android"], "developers": ["Warner Bros. Interactive", "Netease"], "genres": ["Adventure", "Strategy"], "publishers": ["Warner Bros. Interactive"], "esrb_rating": "Teen"}