{"id": 494354, "slug": "the-bond-a-tale-of-mother-daughter", "name": "The Bond: A Tale of Mother & Daughter", "name_original": "The Bond: A Tale of Mother & Daughter", "description": "<p><strong>Side Quests with Women in Games: Game Jam.</strong></p>\n<p>This is our first game jam submission to Side Quest, and the first time this group of strangers collaborated together to work on this game. I am proud of the final product, and could not be happier with the group of ladies I worked with to make this happen!</p>\n<p><strong>Team:</strong></p>\n<p>Character Concept &amp; Asset Artist: Shiyi Yin - sy.yin3366@gmail.com</p>\n<p>Environment &amp; Asset Artist: Ixel Camacho - ix.camacho10@gmail.com</p>\n<p>Composition - Maya Talwatte - maya@mayatalwatte.com</p>\n<p>Spanish Translator: Sofia Rosa - sofiaorosa@gmail.com</p>\n<p>UI Designer: Naomi Sheridan - NaomiXDesign@gmail.com</p>\n<p>Team Organizer/Level Concept/Programmer: Seth Funk - snootysnootgames@gmail.com</p>\n<p><strong>Summary:</strong></p>\n<p>A story of a mother &amp; daughter trying to escape their home city of Haven due to an infection that is spreading through the city. The machine virus aka\"blue ooze virus\" infects anyone it touches immediately, converting whatever it infects into a mixture of mechanical and biological. </p>\n<p>Use puzzle solving skills to escape Haven and get to Glimmerbourne.</p>\n<p><strong>Conceptual Story: </strong></p>\n<p>The machine virus aka the blue ooze is a recently new virus that has been spreading fast through the land of Tinkervolden. It turns whatever it infects into mix of creature and machine with only one thing in its programming, and that's to keep spreading the infection. There is no cure and it only takes touching the blue ooze that comes from the infected to receive it. Mother \"Theodora\" and daughter \"Lucy\" are in their apartment, and the mom wakes the daughter from her sleep. The daughter hears screams from outside of their apartment and her mother telling her the blue ooze has gotten into the Haven . They need to escape and fast. But quarantine procedures are being put into place. Theo knows a secret way out of city through the sewers.\"We are heading to Glimmerbourne. The next city over\"<br/></p>\n<p>Theo leads Lucy out of the apartments, needing to push a box out of the way of the hole in the fence, that Theo knows leads into the alley way that leads to the sewers. The sewer is locked with a panel. Lucy is known for getting into trouble with hacking the local panels, so she hacks the panel and opens the gate to the sewers with a breeze. Theo and Lucy spot a azul devil.(the human/machine infected that oozes blue from his eyes and mouth,stays still unless it spots a target). The azul devil needs to be distracted, so Theo sees a rat on the pipework near the ceiling right above the azul devil. Using Theos ability to push, she pushes a beam over near the wall that bangs against the pipe and causes the rat to fall near the azul, distracting it so they can get by.<br/></p>\n\n<p>Still in the sewers, Theo and Lucy find themselves stuck as the gate out is stuck closed due to debris outside of the door. There's a box near the wall that they see has a small vent duct that leads out the sewer. Theo pushes the box, and Lucy crawls thru the hole. Lucy now removes the debris from the door and they both make it out of the sewers. Now they are on the outskirts of the city in the streets. It's dark but they see that there is a azul devil and an indigo hound(dog/machine, has open wounds on body that oozes blue, and from the mouth, patrols a path and has short distance of sight). Theo pushes a car out of their way, and then lifts debris so Lucy can crawl underneath to a locked chain linked fence area that contains a panel for local security turrets. Once inside, Lucy uses the panel to turn on the turrets and kill the azul devil and indigo hound. They now pass by and are at the police barricade, that which keeps them from salvation. <br/>\"its getting dark\"<br/>There is a swarm of azul devils at the barricade where everyone tried to escape and sadly, could not. Theo sees a large propane tank and Lucy spots a panel for the steam vents that run underneath the city to help evacuate all exhaust created from the mechanical city. Theo pushes the barrel up to the steam vent and tells Lucy to vent the steam to cause the tank to explode from the heat. This blows open a large opening and kills the azul devils. Theo and Lucy are now out of the city.</p>\n\n<p>Theo and Lucy are now in the woods, away from the fancy machinery they have come to know and rely, but strangely enough they find a small out post, they know they should take shelter since it is another day walk to Glimmerbourne. The peak inside and see a single infected, but it makes Theo's heart sink, it is a cobalt knight (human/machine/large/armor/and large boiler on back, they are quick, they have large sight of field, and they explode ooze out of the boiler when close.) Lucy tells Theo that if she can get inside, she release the crane hook that is storing steal beams that is hovering over the path the cobalt knight is walking. Theo needs to lift a box and place it on another box to allow for Lucy to climb inside the building. Once inside Lucy must sneak over to the panel, and release the hook, killing the cobalt knight. Theo and Lucy stay the night . They walk down a country path but are horrified to learn there are indigo hounds, All they can do is sneak around them, hoping not to get sniffed out. Theo and Lucy make it past, but now one last challenge lays ahead of them, The gate to Glimmerbourne is surrounded by Every enemy type. Theo knows what is needed done, there is no other way in. She tells Lucy that she wants her to scout out the area, so Theo lifts Lucy into a tree, but then runs out, shouting at the blue ooze crew \"come get me you sapphire sacks of puss\" this causes the horde to start chasing her. Theo yells\" Run Lucy, go now!, it's your only chance, I love you, and I will see you on the other side, I promise!\"<br/>Lucy starts crying, she is afraid to jump of out the tree, \"please mom, give me your courage, I love you\" she cries to herself, stuck into the tree, until the player clicks both left and mouse buttons, signifying her mothers strength guiding her. You move Lucy to the gate, only to hear \"I'll see you on the other side\" echoed in her ears, knowing that she is never to see her mom again</p>", "metacritic": null, "released": "2020-09-11", "tba": false, "updated": "2020-09-14T04:25:52", "background_image": "https://media.rawg.io/media/screenshots/c3a/c3a4900549cee7da6a41ff100c45d6e4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 76, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Sfunk92"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}