{"id": 494322, "slug": "runaway-duckling", "name": "Runaway duckling", "name_original": "Runaway duckling", "description": "<p>Prepare to embark on fantastical adventure filled to the brim with heartbreak and sorrow. Join momma duck on her quest to rescue local ducklings from a world swimming with danger and death. Will momma duck be able to save those poor lil' duckies?  </p>\n<p>To play: Push the ducklings to the other side avoiding the cars or you might die</p>\n<p>W- UP</p>\n<p>S - DOWN</p>\n<p>D- RIGHT</p>\n<p>A - LEFT</p><p>push them down to the verybottom and have 4+ left or mother duck has failed</p>\n<p>Btw this game was made in like 8 hours.</p>\n<p>Team  Scheming Elephants</p>\n<p>Fuzzy - Coder</p>\n<p>Reuben - Artist</p>\n<p>Jack - Art and writing</p>\n<p>Music was sourced from this website rest of the assets was created by us</p>\n<p>https://www.zapsplat.com/sound-effect-category/forest-and-jungle-ambiences/<br/></p>\n<p>There was going to be a voice over for story but we ran out of time to implement it.</p>\n<p>Made for Side Quest Mother Game Jam</p><p>Story:</p><p>The night was cold. Sorrow wails of a lonely mother echoed throughout the air. Pain became a new normal for this unfortunate creature. The mother feels helpless. Losing all her children was like a knife to the heart. Her feet dangled in water. She swam aimlessly. No direction in mind. Crying waiting for her inner pain to eat her away. There was a noise. A loud high pitch noise. Startled she reacts quickly. She rushes towards the noise ready to attack the first thing that comes to the eye but she halted sudden a small yellow creature emerges from the bush. It looks so similar. it fills her with joy, but he looks afraid. She wants to help. That this was something she needs to do and nothing will get in her way.</p><p>She approaches the city. A dangerous place for such small creatures. But she feels that there are still more to be found. she knows that she must risk her own life if she wants to save them. But she is willing to take it.</p>\n<p>The city was over. She escapes. Protecting everyone she could. She felt overjoyed knowing that the younger ones could live their lives in piece. Her mission was not finished yet there was still more left to be saved. </p>\n<p>There was a pond. A place for creatures to live freely. But something wasn’t right. It felt abandoned. She knew the final creatures must be here she could help them she could save them all. She new this would be a challenge and she’s ready for it.</p>\n<p>She did it. She survived. They are free and safe. Her mission was finally completed. She fulfilled her role in the world and is now a mother again. The cold air has been transformed into warmth.</p>", "metacritic": null, "released": "2020-09-11", "tba": false, "updated": "2020-09-14T04:19:39", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["iprofuzzy"], "genres": [], "publishers": [], "esrb_rating": null}