{"id": 494490, "slug": "cartel-tycoon-demo", "name": "Cartel Tycoon Demo", "name_original": "Cartel Tycoon Demo", "description": "<p> Check out other amazing games featured on our special Digital Dragons partner page </p><br/><br/>\n\n\nCartel Tycoon is coming soon and can be wishlisted here<br/>\n\nSet in the fictionalized 80s Latin America, Cartel Tycoon tells the story of a time during which the cocaine took over the US and the whole world. Ridiculously rich drug kingpins rule their glorious empires while creating thousands of jobs, but at the same time maelstrom of violence envelops this criminal world.<br/>\n<br/>\nBuild an empire of drug production and smuggling chains while dealing with rival cartels, your rogue lieutenants, state authorities, and public opinion. Adapt on the fly to procedurally generated events. When you die (it never really ends well for drug lords), take over the empire as your successor, and start upon your empire ruins all over again.<br/>\n<br/>\nIn Cartel Tycoon, failure is inevitable and violence begets more violence—but for the cunning kingpin, profits await.<br/>\n<br/>\nExpand a drug empire in the late ‘80s, controlling everything from production to supply lines. Deal in marijuana, cocaine, methamphetamine and legal goods disguising your drug trade.<br/>\n<br/>\nAuthorities, rival cartels, DEA, army and even CIA all threaten your growing business. Death is inevitable, but when you die, one of your sicario leiutenants takes over.<br/>\n<br/>\nConquer neighboring regions and send profits climbing to unlock new upgrade paths and powerful research opportunities<br/>\n<br/>\nOriginal soundtrack recorded by artists like Orkesta Mendoza, Chico Unicornio, Candeleros, C.A.M.P.O.S., The Vicious Seeds and others<br/>\n<br/>\nKey features\n<ul>\n<li>Grow a drug empire in the late ‘80s, dealing in marijuana, cocaine, methamphetamine and other goods</li>\n<li>Tycoon action on an epic scale with dozens of upgrade paths and endless strategic combinations</li>\n<li>Run huge logistical systems of your farms, labs, warehouses, workshops, research centers, and delivery lines</li>\n<li>Death is inevitable but lieutenants with unique traits take over for the drug lord before them</li>\n<li>Evade the authorities and square off against rival cartels on the path to profit</li>\n<li>Procedurally generated story and roguelike action for endless replayability</li>\n<li>Original soundtrack captures the era with the psychedelic and Latin American influences</li>\n</ul>\n<br/><br/>\nFull game is out late 2020: wishlist it now!", "metacritic": null, "released": null, "tba": false, "updated": "2020-09-18T02:43:45", "background_image": "https://media.rawg.io/media/screenshots/da0/da0f888722e8c5328309e058ef1a9ddf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 14}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 545, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Moon Moose"], "genres": [], "publishers": ["tinyBuild"], "esrb_rating": null}