{"id": 494474, "slug": "hostile-mars", "name": "Hostile Mars", "name_original": "Hostile Mars", "description": "Hostile Mars is the world's first defense-automation game. It is a third-person shooter mixed with tower defense, item manufacturing and automation. Build and upgrade a massive defense factory filled with automated delivery bots to keep your defenses stocked with ammo and power.<br/>\n<br/>\r\nDesign<br/>\r\nPlan out your defense as waves of attacking robots come storming in to attack your base. Strategically place walls, traps, and turrets to create a defense strong enough to keep your home base energy core protected. Try different combinations of traps and turrets to find interesting and fun ways to kill the attacking swarm. <br/>\n<br/>\r\nAutomate<br/>\r\nYou won’t last long without automating defensive logistics. Print delivery bots to transport various items around home base like from ammo stations to turrets or from resource nodes to blast furnaces. <br/>\n<br/>\r\nFight<br/>\r\nBuild your own army of robots or try to fight them yourself by focusing your resources on upgrading weapons and armor.<br/>\n<br/>\r\nUpgrade<br/>\r\nAlmost everything you build can be upgraded. Upgrade your traps to collect materials that fall from defeated enemies, or turrets to shoot farther and hit harder.<br/>\n<br/>\r\nPersistent Base<br/>\r\nContinue to build a massive defense factory while you sit back and watch the carnage of the attacking enemies getting chewed up and repurposed by your defenses. Try different base layouts risk-free by moving base defenses around without penalty.", "metacritic": null, "released": "2020-09-30", "tba": false, "updated": "2020-09-18T02:33:13", "background_image": "https://media.rawg.io/media/screenshots/d91/d915bd8bfa32a758dee675d5af93437f.jpg", "website": "https://www.HostileMars.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 402, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Big Rook Games"], "genres": ["Action", "Adventure", "Strategy"], "publishers": ["Big Rook Games"], "esrb_rating": null}