{"id": 494463, "slug": "the-developer", "name": "The Developer", "name_original": "The Developer", "description": "Quit your day job and begin developing games!<br/><br/>From the humble beginnings of programming alone in the basement, build up your company by employing and training new workers, researching new technologies and dominating the market with hit games of your design.<br/><br/><strong>History </strong><br/>Follow a roughly similar gaming history as the real world as famous companies release their gaming consoles, starting with the first generation 8bit consoles, play through 60 years of history and see all the technological advances, from 2D graphics all the way to augmented reality. <br/><br/><strong>Game Creation</strong><br/>Decide how much time your workers should spend on each aspect of game development, Include features that are relevant to your chosen genre and topic and be rewarded with great reviews, high sales and happy fans.<br/><br/><strong>Company Growth</strong><br/>Grow your company by moving out of your basement and into an office where other developers can join your ranks, upgrade your office to unlock extra abilities that will help you develop games of higher quality or maybe try your luck by creating your own gaming console.<br/><br/><strong>Features</strong><br/>* Begin your own game development company<br/>* Create games of 8 different genres and up to 100 unique topics<br/>* Instruct your workers to analyze the strengths and weaknesses of consoles<br/>* Create your own custom game engines with technologies you have researched<br/>* Unlock hidden achievements<br/>* Compete in Development Champions against rival companies<br/>* Upgrade your offices<br/>* Create sequels of your most popular hits<br/>* Take out business loans to ensure you're never short on funds<br/>* Multiple languages supported", "metacritic": null, "released": "2020-09-16", "tba": false, "updated": "2020-09-18T02:28:00", "background_image": "https://media.rawg.io/media/screenshots/966/9664a119384129552c7b593fa060f3e9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 236, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Huntah"], "genres": ["Strategy", "Simulation", "Casual", "Indie"], "publishers": ["Huntah"], "esrb_rating": null}