{"id": 494458, "slug": "evil-icebox", "name": "Evil Icebox", "name_original": "Evil Icebox", "description": "<strong>\"Catch the Flag and Kill the Pink EVIL ICEBOX!\"</strong><br/>You are Good White Icebox. the others are Bad Iceboxes. there are 8 colors evil icebox!<br/><br/>'EVIL ICEBOX' is simply hard 3D Platformer Action Game<br/>and it has simple operation sensitivity.<br/>a game that's simple to play but very hard to beat.<br/>the game has savepoint per each level.<br/>Player can only jump and attack the enemies, <strong>but can't kill them</strong> (except last boss)<br/>and should catch the red flag for go to next level.<br/>Just that!<br/>But do you have what it takes to beat Level 11 of this Game?!<br/>It's Pretty hard. I promise!<br/><br/>'EVIL ICEBOX' features 11 levels, each one getting progressively harder.<br/>and every level has hidden route called \"skull road\"<br/>the route makes the game contents more harder and replayable by your choice!<br/><br/>Also some trickery is implemented into the game.<br/>and exist many objects like trap! <br/>Have Fun!<br/><br/>View more  detail about the game in Store Page Trailer.<h3>Disclaimer</h3>MATER Games is not responsible for broken keyboards, broken minds, or broken friendships.<h3>Controls</h3><br/>Controls are super simple. Move with Left Key &amp; Right Key, Jump with Up key,<br/>Attack with Z key.<br/>Currently, controllers are partially supported by steam controller settings.<h3>Requirements</h3><br/>'EVIL ICEBOX' can work on any Windows computer with working 3D graphics is sufficient.<br/>Evil Icebox was exported to support PC and it was tested in Windows 7/8/10<br/>but not tested in Steam OS &amp; Mac &amp; Linux yet.", "metacritic": null, "released": "2020-09-16", "tba": false, "updated": "2020-09-18T02:25:41", "background_image": "https://media.rawg.io/media/screenshots/b2b/b2be6605af21fd23278a59386472b1bd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 84, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MATER"], "genres": ["Action", "Indie"], "publishers": ["MATER"], "esrb_rating": null}