{"id": 494578, "slug": "lungo-difficult-logic-puzzle-game", "name": "Lungo - Difficult Logic Puzzle Game 🧠", "name_original": "Lungo - Difficult Logic Puzzle Game 🧠", "description": "Lungo - Difficult Logic Puzzle Game 🧠\r\nAbout game\r\n<p>Lungo is a difficult logic game that will thoroughly test your logical thinking. Playing this game is a great exercise for your brain. Although the puzzles look easy at first sight, it may surprise you how challenging the game can be. After you get to know the main logical principles, <strong>your brain will start to get better and faster at solving the difficult logic puzzles</strong>.</p>\r\nHow to play\r\n<p>Your task in this game is to cover all grey circles with yellow lines and also fit these lines on the game board. You can drag lines on the grid to expand their length. Each line has its given length which you must reach to succesfully solve the puzzle. Lines can't intersect with each other so you will have to use your logical thinking before making a move in this difficult puzzle game.\r\n</p>\n<p>However, if you get stuck solving a puzzle, you can use hints that will help you get back on track. Or you can use the undo button which will help you to get unlimited amount of steps back in your game progress.</p>\n<p>Lungo offers three difficulty levels that are <strong>suitable for absolute beginners as well as experienced puzzle game players</strong> with developed logical thinking. To give you a quick start into the game there is an intuitive tutorial that will teach you all the basic principles you need to know to be able to solve the logic puzzles.</p>\r\nLungo has these main features:\r\n<p>✅ hints when you get stuck<br/>✅ dark mode<br/>✅ easy tutorial<br/>✅ hundreds of levels<br/>✅ multiple languages<br/>✅ minimalistic design</p>\n<p>If you would like to request a new feature, or just tell us your appreciation, don't hesitate to leave a review or send me a message.</p>", "metacritic": null, "released": "2020-09-17", "tba": false, "updated": "2022-11-03T17:54:09", "background_image": "https://media.rawg.io/media/screenshots/12a/12ad02c470dc9d4bfb57a97828d9f9d7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 28, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["jindrazak"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}