{"id": 494513, "slug": "tintin-match", "name": "Tintin Match", "name_original": "Tintin Match", "description": "Welcome to the wonderful world of Tintin! Get ready to assemble a beautiful collection of miniatures, and follow the famous reporter and many popular characters as he progresses through colourful match 3 puzzles. Unlock and collect the stunning locations where you can explore with Tintin on his travels.<br/> <br/>The first adventure: The Crab with the Golden Claws<br/> <br/>The day started like any other for Tintin and Snowy, but a mystery is always around the corner! Snowy is getting his snout stuck inside a crab tin, the Thompsons are investigating counterfeit money, and a stranger gets kidnapped before he can give a letter to Tintin. Could all those threads lead to a much bigger mystery?<br/> <br/>Follow Tintin and experience the exciting investigation that takes him from familiar streets to foreign cities following the trail of The Crab with the Golden Claws.<br/> <br/>Brand new match 3 puzzles<br/> <br/>In order to unravel the mystery perplexing Tintin, you will have to beat a selection of<br/>hand-crafted match 3 puzzles, each one of them sure to challenge the problem solver in you. Obstacle in the way? A piece out of reach? Turns running out? Bring out your best strategies and achieve 3 stars on the first attempt! And if at first you don’t succeed, no problem! Try again as many times as needed to beat the puzzle in style.<br/> <br/>Build the world, and craft your resources.<br/> <br/>Why try hard to beat the many puzzles in the game? Because the better you play, the more kits you will collect. What to do with kits you ask? Kits are used to unlock the scenes of the miniatures, that is how you build the world. You can also use them to craft boosters like the Double Plane or power ups like the Glove. Use the boosters to give you the edge you need to beat the most difficult puzzles. Now that you have a growing collection of kits, you can build the world and craft the power up you need to beat level 61!<br/><br/><br/><br/><br/>Tintin is free to play, though certain game items are also offered for purchase. If you do not wish to use this option, you can turn off in-app purchases in your device’s settings.<br/><br/><br/>", "metacritic": null, "released": "2020-08-30", "tba": false, "updated": "2020-09-18T02:54:03", "background_image": "https://media.rawg.io/media/screenshots/8f8/8f80c35f6b7339ffa678085871cccb66_DPdCjnl.jpg", "website": "https://www.5thplanetgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 90, "game_series_count": 6, "reviews_count": 0, "platforms": ["iOS"], "developers": ["5th Planet Games Development ApS"], "genres": ["Adventure", "Puzzle"], "publishers": ["5th Planet Games Development ApS"], "esrb_rating": "Teen"}