{"id": 494544, "slug": "rude-dimensions-part-one", "name": "Rude Dimensions (Part One)", "name_original": "Rude Dimensions (Part One)", "description": "<p>In Rude Dimensions Part One, you play as Thorn - a simple, down-home, courteous cowhand who just wants to help folks out. After seeing some strange things happening, he stumbles on a portal to the Rude Dimensions - alternate realities where monsters roam free and courtesy is not to be found!</p><p>Rude Dimensions Part One is available in Windows 32-bit and Windows 64-bit standalone .exe versions.</p>\n<p><em><strong>Note: </strong>This game is an early effort! There are some quirks, bips and bops, and other aspects that are unpolished, as this was originally intended to be a much bigger game but later was decided to be released as-is. Overall it's just meant to be a fun game/art project, and I think you'll have fun with it. Thank you for playing!<br/><br/><strong>Another Note:</strong> Rude Dimensions Part One is meant to be played with a gamepad of some kind. Numerous tests on various gamepads have been successful, including PS4 and XBox One controllers as well as other options, but there is no guarantee that any gamepad will work, or any guarantee of any kind. There is a standard keyboard option if gamepads are not possible that should work, although gameplay will be somewhat limited as certain features and level aspects had to be changed to accommodate it, and of course, not every keyboard may work either, depending on the setup you have.  The last level is quite difficult (but not impossible in my testing) using the keyboard, fair warning.</em></p>\n<p><em><strong>One Last Note:</strong> Unfortunately, I'm unable to provide any guarantees of any kind related to this game, as am I  just one person. I decided to ask for a donation if you can with this game because I spent a great deal of time and invested a lot of artistic love into it. I'll fix bugs and issues if they arise where I can and if I can, but there are no updates planned as of its release, and I may make no changes at all. There is no plan to actively support this game - it is sold as-is. I'm mentioning this because I want to be transparent, but testing has gone very well, and I doubt you'll have any issues!<br/></em></p>", "metacritic": null, "released": "2020-09-18", "tba": false, "updated": "2020-09-18T03:04:35", "background_image": "https://media.rawg.io/media/screenshots/ce9/ce9b2c786d0235f3ff3ece4b9c934a32.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 41, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["niock"], "genres": ["Action", "Platformer"], "publishers": [], "esrb_rating": null}