{"id": 494689, "slug": "fall-halloween-picture-hunt-extravaganza", "name": "Fall Halloween Picture Hunt Extravaganza", "name_original": "Fall Halloween Picture Hunt Extravaganza", "description": "<p>The season of the Harvest.\r\n  </p>\n<p>Time to sit back relax and discover the things we have lost. Hidden Items have been scattered throughout the land. Discover hidden items in scenic fall landscapes. Look for lost items in Halloween themed settings. Can you find all of them? Identify all of the hidden items in time and earn golden pumpkins to unlock the next level. Challenge yourself and replay levels to earn even more medals.   </p>\n<p>It’s fall get into the season with harvest themed images featuring scenic landscapes with leaves changing colors, pumpkins being harvested, falling leaves, Halloween, trick o’ treating. Including images of haunted graveyards and mysterious mansions. Can you locate all the ghosts and ghouls in the mystery mansion? Can you spot the candy in the pumpkin patch? How about finding the hidden items at the Halloween party?\r\n  </p>\n<p>Love the nostalgia of picture hunt games on the back of cereal boxes. You will love solving the hide and seek puzzles offered in Fall Harvest and Halloween Festival Picture Hunt. Hidden objects are scattered through high definition scenes. Journey through the relaxing landscapes and soothing sounds to find the hidden images.\r\n  </p>\n<p>Challenge yourself and exercise your mind and memory while competing against yourself for a new high score. Each play through offers different items to find. Test your memory and reaction time when reentering a level to find hidden objects.\r\n  </p>\n<p>Avoid false hidden items to avoid a time penalty and earn a high score. Correct items disappear in a wisp of falling leaves and wind.\r\n  </p>\n<p>Levels include, pumpkin patches, falling leaf covered trails, creepy forests, ghostly graveyards, Halloween parties, fall decorations, Halloween decorations, fall bonfires, and relaxing views with the occasional pumpkin spice latte.\r\n  </p>\n<p> \r\n  </p>\n<p>Featuring\r\n  </p>\n<p>Excellent Graphics!\r\n  </p>\n<p>Relaxing Music!\r\n  </p>\n<p>Fall and Halloween themed images!\r\n  </p>\n<p>Challenging Gameplay!\r\n  </p>\n<p>Re-playable Levels!\r\n  </p>\n<p>Hidden Items!\r\n  </p>\n<p>Zoom and Pan on Mobile!\r\n  </p>\n<p>Free!\r\n  </p>\n<p> \r\n  </p>\n<p>Check out our website at https://www.monkeykidgc.com/\r\n  </p>\n<p>Follow us on Twitter https://twitter.com/MonkeyKidGC\r\n  </p>\n<p>Like us on Facebook https://www.facebook.com/MonkeyKidGC\r\n</p>", "metacritic": null, "released": "2020-09-17", "tba": false, "updated": "2020-09-18T03:34:01", "background_image": "https://media.rawg.io/media/screenshots/c22/c22e6e93d48c31325187f5fe5eb2a320.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 266, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MonkeyKidGC"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}