{"id": 494823, "slug": "in-the-middle-of-the-night-xcvg", "name": "In The Middle Of The Night (XCVG)", "name_original": "In The Middle Of The Night (XCVG)", "description": "<p><strong>Created for </strong><strong>Magical Girl Game Jam 2</strong><br/></p>\n<p><strong>A postmortem is currently in the process of being written</strong><br/></p>\n<p>In The Middle Of The Night is a first-person shooter with some visual novel elements, starring a magical girl (for real this time, kinda) and set in the tense days of 2020. It is partially salvaged from a very different project I started for Magical Girl Game Jam 2 and then realized wasn't workable mid-jam. Because it is a salvage project, it is a bit weird and quite short, so be aware of that.</p>\n<p><strong>Storyline</strong></p>\n<p>Gina was pretty much your basic, edgy, low-key geeky, slightly gothy teenager. Now she's graduated high school and is totally not ready to face the world, which is more or less on fire. Suddenly, in the middle of the night a ridiculously cheerful girl in a ridiculously cheerful outfit wakes her up, tells her she's a \"maho sho-jo\" whatever that means, and drags her off to fight evil. Well, it's not like she had anything better to do...</p>\n<p><strong>Features</strong></p>\n<ul><li>Two levels, one small and one large</li><li>Visual novel-style conversations</li><li>Gun+magic first person shooter gameplay</li><li>Two characters and two enemies</li><li>An unoriginal soundtrack</li><li>Fancy lighting</li></ul>\n<p><strong>Acknowledgements</strong></p>\n<p>Ran d'Reille for hosting the Magical Girl Game Jam and its sequel.</p>\n<p>A very long list of asset creators and technology vendors. Like most of my games it's pretty bodged together. Of particular note are Unity, Microsoft and the .NET Foundation, and James Newton-King on the technology side, and ISAo, Scouser, and the Contributors to the Freedoom Project on the assets side.</p>\n<p>The Unity Asset Store, OpenGameArt, the Free Sound Project, and of course itch.io, all of which make game dev possible or at least a lot easier and more fun. <br/></p>\n<p>Microsoft, Bungie and 343 Industries. There's a disproportionate amount of Halo inspiration here and I took a lot of breaks during the jam to play Halo.<br/></p>", "metacritic": null, "released": "2020-09-16", "tba": false, "updated": "2020-09-18T04:02:36", "background_image": "https://media.rawg.io/media/screenshots/7da/7da6644ef98453e2c0d450b8e87ec951.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 71, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["XCVG"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}