{"id": 49493, "slug": "knights-and-bikes", "name": "Knights And Bikes", "name_original": "Knights And Bikes", "description": "<p>KNIGHTS AND BIKES is a hand-painted action-adventure set on a fictional British island in the late 1980s, inspired by coming-of-age movies like The Goonies and classic games like Earthbound and Secret of Mana.<br />\nThe story features two new friends: Nessa &amp; Demelza. They&#39;re tough and imaginative girls exploring the island of Penfurzy in search of mysteries and treasure. Cycling around on their bikes, exploring the natural beauty of their surroundings, they experience their first taste of a more grown-up freedom. But this new-found independence also leads them into danger, both modern and ancient.<br />\nWith a mixture of ingenuity and imagination, they deal with enemies and a challenging environment using frisbees, water-balloons, a cranked-up stereo, a pet goose, and more. The trinkets they collect from their adventures allow them to upgrade their bikes and widen their treasure-hunt.<br />\nAs Nessa and Demelza try to figure-out the puzzling adult world around them, it&#39;s their friendship and imagination that guides them on their quest: to find the legendary treasure! (as well as saving some of those stupid adults that just keep disappearing).<br />\nThe game is by Rex Crowle, (Creative Director: Tearaway/Tearaway-Unfolded, Art &amp; Design: LittleBigPlanet) and by Moo You (Gameplay Programmer: Ratchet &amp; Clank and LittleBigPlanet). Audio design by Kenny Young (Audio Lead: Tearaway &amp; LittleBigPlanet) and with a musical score by Daniel Pemberton (Composer: The Man From Uncle, Steve Jobs, King Arthur: Legend Of The Sword)Things to Do Best friends forever! Play single-player with an AI companion, couch co-op or online co-op.<br />\nSolve puzzles and deal with enemies using your improvised abilities! These include: frisbees, water-balloons, puddle-stomping welly boots, and a powerful boom-box stereo.<br />\nWork together! Both characters have different skills so you&#39;ll want to experiment with how they combine in order to succeed.<br />\nExplore the island! Seek out its modern tourist-attractions and ancient ruins, both on foot and on your customised bikes.<br />\nDiscover treasure! Ranging from trinkets like broken action-figures and animal skulls, to the legendary riches rumoured to be hidden on the island.<br />\nUpgrade your bikes! Barter with adults (offload your junk) so you can personalise your bikes, unlock extra abilities or at the very least: get those training-wheels removed!<br />\nTend to your pet goose! Captain Honkers has a keen nose-beak and can help you find what you need, if you keep him fed and happy.</p>", "metacritic": 80, "released": "2019-08-27", "tba": false, "updated": "2023-01-25T15:05:12", "background_image": "https://media.rawg.io/media/games/507/5079b644ad6fb5efce34a387b18d1c4e.jpg", "website": "http://foamswordgames.com", "rating": 3.32, "rating_top": 4, "added_by_status": {"yet": 24, "owned": 200, "beaten": 15, "toplay": 60, "dropped": 20, "playing": 6}, "playtime": 2, "achievements_count": 120, "ratings_count": 44, "suggestions_count": 316, "game_series_count": 0, "reviews_count": 44, "platforms": ["PC", "macOS", "PlayStation 4", "Nintendo Switch", "Linux", "Xbox One"], "developers": ["Foam Sword", "Foam Sword Games"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Double Fine Productions"], "esrb_rating": "Everyone 10+"}