{"id": 494948, "slug": "flight-for-planet-a", "name": "Flight For Planet A", "name_original": "Flight For Planet A", "description": "<p>The year is 3020 and the sun is about to explode. Luckily scientists have been able to attach solar powered rockets to the side of the earth, so you can get out of the galaxy. This is the adventure of Earth (planet A), searching for a new home.</p>\n<p>The game is set in a part of space where humans have never been before. The galaxies in the part of space seem to all make their own specific sounds - It's almost like they each have their own song! There are rumours of a galaxy which has enough space for Earth. So keep your eyes and ears peeled!</p>\n<p>This is intended to be a slow game and the main focus is the music. Each galaxy is a solo improvisation on either alto or tenor saxophone played by me. The galaxies spawn in different spots each time you play and the music is intended to move in and out of focus, and sometime be competing for your attention. Each piece is a different length, so the looping times will be different and create different moods depending on which galaxies are close by. If you are inclined, please take your time and have a listen. I loved putting this music together.</p>\n<p>This is also my first game. When Covid started to make us lock-down in Australia, I decided to \"pick up a hobby\" and wanted to explore coding and game making. I love making games, and also am wanting to compose music for games as part of my musical practice. I made this for a three day game jam hosted by Billie Blue College of Design during Pax 2020. Thanks for the push to put something out there. I've really enjoyed the process!</p>", "metacritic": null, "released": "2020-09-16", "tba": false, "updated": "2020-09-18T04:26:38", "background_image": "https://media.rawg.io/media/screenshots/db8/db8b3ecc4ec0ade67a2ba9ad88ad4d97.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS"], "developers": ["shaunrammers"], "genres": [], "publishers": [], "esrb_rating": null}