{"id": 495127, "slug": "bang-dream-arena-beta-1st-anniversary-update", "name": "BanG Dream! ARENA (BETA) - 1st Anniversary Update!", "name_original": "BanG Dream! ARENA (BETA) - 1st Anniversary Update!", "description": "Follow on Instagram!\r\nJoin the Discord Server!\r\nIntroduction\r\n<p>Welcome to BanG Dream! ARENA, a fan made fighting game featuring characters and stages from the BanG Dream! franchise. This game has been in development since April of 2019, and I've now decided to start hosting this game on itch.io!</p>\r\nGameplay\r\nBasic Attacks\r\n<p>This game is a platform fighter that centers around projectile based gameplay, in which most attacks are delivered by shooting your opponent with projectiles. Each player has access to a close ranged projectile and long ranged projectile, each with a limited amount of ammo. You can also use a bubble shield to defend yourself from attacks. However, if your shield breaks, you will end up hurting yourself.</p>\r\nFighter Classes\r\n<p>Each character is placed into one of five fighter classes based on the instrument they play. Basic close and long ranged attacks are shared among characters in the same fighter class, but each character has two unique special attacks (more on that below). Characters that play a unique instrument (violinists, DJs) will use a unique fighter class that mirrors the abilities of another fighter class.</p>\r\nSpecials\r\n<p>Aside from basic projectile attacks, each fighter has two specials that are unique to their character. Special attacks do not need ammo, but require you to fill up a power meter which can be filled by dealing damage or receiving damage. Some characters do not have their specials yet as they are unfinished, and they will be marked on the character select screen.</p>\r\nContent\r\nFighters\r\n<p>All 35 characters from the BanG Dream! franchise are playable as fighters. The side character Marina Tsukishima also makes an appearance as well! Some characters are unfinished, and will be marked as such on the character select screen.</p>\n<p>Aside from BanG Dream! characters, characters from other anime and game series will appear as well. Hatsune Miku, Nico from Love Live!, Monika from Doki Doki Literature Club, Sakura from Zombieland Saga, and even Jotaro and Kakyoin from JoJo's Bizzare Adventure will join the fight as guest fighters!</p>\r\nStages\r\n<p>Different areas from the BanG Dream! franchise will serve as battle arenas for fighters to battle on. From Livehouse CiRCLE to Yamabuki Bakery, each stage has it's own unique layout, so make sure to try them all out and see which one you like best!</p>\r\nModes\r\n<p>There are currently only 3 modes available right now. Arena mode (offline battles), Online, and Zombies mode (Multi-Man Smash-esque mode). More modes will be coming in the future.</p>\r\nMusic\r\n<p>Instrumental versions of various BanG Dream! songs and songs that belong to third party franchises can be played as background music during battle.</p>\r\nCredits\r\n<p>This game uses characters and assets from the BanG Dream! Girls Band Party mobile game.</p>\r\nCharacter Sprites\r\n<ul><li>makisayos (Chu2)</li><li>ayay_m8 (LOCK, Miku)</li><li>evechinthethird (MASKING, LAYER, Beta Arisa)</li><li>ac_animatingcat (PAREO, Beta Saaya)</li><li>ummk01 (Nico)</li><li>tuskesrozsa (Kasutron, Beta Tae)</li></ul>\r\nMap Backgrounds\r\n<ul><li>evechinthethird (CiRCLE)</li><li>ac_animatingcat (Yamabuki Bakery)</li><li>han.akie  (Rooftops)</li><li>kokoyukina (Rooftops Alternate Ver.)</li><li>_idolizy_ (S. S. Smile)</li></ul>\r\nIcons\r\n<ul><li>Freepik from flaticon.com</li><li>Eucalyp from flaticon.com</li><li>Smashicons from flaticon.com</li><li>monkik from flaticon.com</li><li>Those Icons from flaticon.com</li></ul>\r\nOther\r\n<ul><li>Kakyoin and Jotaro sprites from the JoJo's Pitter Patter Pop mobile game</li><li>Various sound effects are from Super Smash Bros. Ultimate</li><li>Drummer close ranged projectile sprite is from Sonic Battle</li></ul>", "metacritic": null, "released": "2020-09-15", "tba": false, "updated": "2020-09-18T05:04:14", "background_image": "https://media.rawg.io/media/screenshots/730/730c8c22f4363a15ae98f91ee839f614.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 167, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["thebuddyadrian"], "genres": ["Fighting"], "publishers": [], "esrb_rating": null}