{"id": 495238, "slug": "love-itch-developer-big-b", "name": "Love (itch) (Developer Big B)", "name_original": "Love (itch) (Developer Big B)", "description": "Oyun Hikayesi\r\nBir zamanlar çok kötü kalpli bir adam varmış. Bu adam o kadar kötü biriymiş ki dünya üzerinde yaşam enerjisi çalınmamış bir insan bırakmamaya karar vermiş.\r\nBiz, bu eziyete dayanamayan ve insanları kurtarmak isteyen bir kahramanız.\r\nHayat enerjisini paylaşmayı başaran bir silah yapmayı başarıp kendi hayat enerjimizi diğer insanlar ile paylaşıp dünyayı daha güzel bir yer yapmaya karar veriyoruz.\r\n\r\nOynanış\r\nBenzer bir çok oyunda olduğu gibi bunda da kontroller basit.\r\nAteş etmek için \"Sol Fare\" tuşu, zıplamak için \"Boşluk\" tuşu vede hareket etmek için \"A-D\" tuşları kullanılmakta. \r\nOyunun en temel mekaniği \"Can = Mermi\" vede bunlar hayat enerjisini temsil etmektedir. Can mermiye eşit olduğundan dikkatli bir şekilde ateş edilmesi gerekmektedir. Eğer yaşam enerjiniz 0 olursa ölürsünüz.\r\nOyunda 2 farklı tipte düşman bulunmakta, bunlar yaşam enerjisi sömürülmüş robotlaşmış insanlardır.\r\nEğer bunlardan birisi size dokunursa yaşam enerjinizi emerler, bu da ölümünüze yol açar.\r\nFabrikadan yeni çıkmış olan düşmanlar 3 kalpte ölürken diğerleri 1 kalpte yaşam enerjisi kazanır ve hayatına devam eder.\r\n\r\nKatkı\r\nTile set, Aleifr tarafından yapılmıştır.", "metacritic": null, "released": "2020-09-15", "tba": false, "updated": "2020-09-18T05:25:51", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Developer Big B"], "genres": ["Action", "Shooter", "Platformer"], "publishers": [], "esrb_rating": null}