{"id": 495322, "slug": "janken-brawl", "name": "Janken Brawl", "name_original": "Janken Brawl", "description": "<p>Janken Brawl is a turn-based fighting game with a rock-paper-scissors mechaninc at its core.<br/><br/>FEATURES:<br/>- Solo fight, fight against an AI<br/>- Local fight, fight against your friends using two controllers<br/>- Online fight, challenge people via online multiplayer<br/><br/>RULES:<br/>Queue 5 actions that can be attacks, super or block to define your round sequence. Once both player have queued their 5 actions, the round will play out simultaneously. </p>\n<p>The three attacks are ruled as rock-paper-scissors, where the punch beats the kick, the kick beats the headbutt and the headbutt beats the punch.<br/><br/>Charging your super will leave you exposed to any attack so be careful! If you manage to charge your super, your next attack will deal double damage and beat any non-super attack regardless of the type.<br/><br/></p>\n<p>Block to reduce incoming damage by half, doesn't seem that useful right? Well the twist is that if you successfully block an attack you stun your enemy, causing him to lose the next queued action.</p>\n<p>HOW TO PLAY:</p>\n<p>Player 1 - Keyboard:</p>\n<p>A, Z, S for attacks, Q for super and W for blocking.</p>\n<p>Player 2 - Keyboard:</p>\n<p>J, M, K for attacks, U for super and I for blocking.</p>\n<p>Controllers, based on Xbox controller:<br/></p>\n<p>X, A, B for attacks, Y for super and RB for blocking.<br/><br/><br/>This game was made in 20 hours as a part of an hispanic educational online series about game development.<br/><br/>More info on this:<br/>https://www.youtube.com/channel/UCE_m2COf7mZK0NlqpWeW6Jw<br/><br/>Source code:<br/>https://gitlab.com/games23/rps-fighter<br/></p>", "metacritic": null, "released": "2020-09-14", "tba": false, "updated": "2020-09-18T05:43:14", "background_image": "https://media.rawg.io/media/screenshots/bc2/bc252e311be8703afc6ee53e31d236c0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 320, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Juan Rodriguez"], "genres": ["Fighting"], "publishers": [], "esrb_rating": null}