{"id": 495383, "slug": "henchman-story", "name": "Henchman Story", "name_original": "Henchman Story", "description": "Henchman Story is a narrative adventure where you play as a beleaguered henchman working for a bumbling supervillain. <br/><br/>It’s thankless work. Week in and week out, you put on your purple spandex and get the crap beaten out of you by much stronger, much cooler people wearing much fancier spandex. But the checks clear, and Lord Bedlam offers healthcare, so a job’s a job, right?<br/><br/>Even henchmen have bills to pay, and sometimes, even henchmen can make choices that change everything.<br/><br/><br/><br/><br/><br/>💥 <strong>Superhero Satire:</strong> A comedic take on the world of superheroes that revels in the ridiculous nature of its setting, and showcases a colorful, comic book aesthetic.<br/><br/>💥 <strong>Colorful Characters:</strong> Find friends, enemies and even romance amongst a lively cast of villains, heroes and fellow henchmen. <br/><br/>💥 <strong>Meaningful Choices:</strong> Your decisions directly influence the story - leading to eleven endings, determining the fate of its characters, and if you play your cards right, you might even earn a promotion!<br/><br/>💥 <strong>Full Voice Acting:</strong> Starring a talented cast of professional actors that have been featured in anime, video games and more!<br/><br/>", "metacritic": null, "released": "2020-09-14", "tba": false, "updated": "2022-02-24T13:36:49", "background_image": "https://media.rawg.io/media/screenshots/f77/f77a5f8fd230c69563c48aa7eaa31d85.jpg", "website": "http://www.silkensail.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 9}, "playtime": 15, "achievements_count": 15, "ratings_count": 0, "suggestions_count": 188, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Xbox One"], "developers": ["Silken Sail Entertainment"], "genres": ["Adventure", "Indie"], "publishers": ["Silken Sail Entertainment"], "esrb_rating": null}