{"id": 495303, "slug": "chess-battle-nl123", "name": "Chess Battle (NL123)", "name_original": "Chess Battle (NL123)", "description": "<p>Chess Battle est un jeu en 1vs1 local, donc jouez-y avec vos amis ou votre famille! Vous incarnez chacun une pièce d'échec, l'une blanche et l'autre noire, et devez faire tomber les PV de la pièce adverse à 0.</p><p>Je retrouve souvent dans les retours que les commandes et les bonus ne sont pas assez claires, je vais donc les réexpliquer: </p><p>- Les déplacements se font avec ZQSD pour le joueur blanc et les flèches pour le joueur noir, à noter que certaines pièces peuvent se déplacer dans huit directions en appuyant sur deux touches en même temps (par exemple, la reine peut se déplacer dans les quatre directions classiques, et en diagonale). Ils attaquent respectivement avec X et M, quand la barre dans le coin supérieur gauche pour le blanc et droit pour le noir est pleine. Les deux grandes barres en haut de l'écran représentent les PV des joueurs</p><p>- Il existe deux types d'armes: l'épée et le pistolet. Le joueur peut savoir quelle arme il tient en regardant dans le cadre sous sa barre d'attaque. Les deux armes font les mêmes dégâts et peuvent attaquer à la même vitesse, cela dépend de la pièce incarnée par le joueur, mais les deux projectiles sont différents: l'épée tire un projectile plus large et plus rapide que le pistolet, mais seulement dans la direction du dernier mouvement de la pièce, quand la balle du pistolet vise automatiquement la pièce adverse, mais est plus facile à éviter car plus petite et plus lente.</p><p>- différents bonus apparaissent aléatoirement sur la carte: </p><p>* Les pièces C, qui permettent aux joueurs d'évoluer quand assez sont collectée. Le joueur peut voir sa progression sous sa barre de vie. Évoluer change les déplacements des pièces et leur vitesse, leur montant de PV max, leur attaque et la vitesse à laquelle elles peuvent attaquer. Je vous laisse découvrir en quoi par vous-même ;)</p><p>* Les croix/sourires vous soignent aléatoirement selon les points de vie que vous avez perdu.</p><p>* les armes vous font changer d'arme, tout simplement.</p>\n<p>Élève Premium de Gamecodeur depuis 1 an, je pratique cependant irrégulièrement.</p>\n<p>Langage et FrameWork Utilisé:   C#  Monogame;</p>\n<p>Code et graphisme de mon cru, les musiques et effets sonores viennent de la gamecodeur toolbox</p>\n<p>Pas de Librairies ou code externes utilisés.</p>\n<p>Je n'ai pas compté mes heures, mais je pense avoir passé une vingtaine d'heures entre le code et les graphismes, le tout répartit sur 1 semaine et demie.</p>\n<p>J'ai passé l'été à compléter le module C# Monogame de la formation Gamecodeur, et cette jam était pour moi le moyen de me tester dans ce nouveau langage. Eh bien je pense maitriser les bases du c#, et j'espère que le reste viendra avec la pratique. Concernant la jam elle-même, le plus dur a été de s'approprier le système d'affichage, qui m'a donné beaucoup de fil a retordre mais, une fois cette étape passée, une autre difficulté est arrivée: trouver une idée pour un jeu en noir et blanc. Et voici comment est né ce petit jeu qui ne casse pas trois pattes à un canard mais saura (je l'espère) être sympathique à plusieurs.</p>", "metacritic": null, "released": "2020-09-14", "tba": false, "updated": "2020-09-18T05:38:46", "background_image": "https://media.rawg.io/media/screenshots/76c/76c133e7d71ff2792b8383e6225e5f40.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 17, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["NL123"], "genres": [], "publishers": [], "esrb_rating": null}