{"id": 49539, "slug": "ciel-fledge", "name": "Ciel Fledge", "name_original": "Ciel Fledge", "description": "In the future, mankind lives on Arks in the sky ever since the planet surface was rendered nearly uninhabitable. The cause: an outbreak of alien creatures from deep inside the core of the planet.<br/><br/>A recent alien attack has left one Ark destroyed and you, along with other citizens of your home, Ark 3, are tasked with caring for survivors of this attack. One includes a little girl found stranded on the Earth's surface...<br/><br/>Unveil the story surrounding the planet, humanity, and your new companion as you play through the game. What will become of mankind in the span of 10 years? What of your adopted daughter? Will she find happiness in such a dire future?<strong>FEATURES</strong><strong>Learn and explore the future world of Ciel Fledge</strong><br/>Ciel Fledge is set in the future in a certain planet like Earth. Learn the future of the inhabitant of this planet and their fate. Are they thriving in utopia or are they close to impending doom?<br/><br/><strong>Raise your daughter from young age to adulthood</strong><br/>Despite the fate of the world, your task ultimately is to raise your adopted daughter. Raise her well and see her grow from a child to adult in the span of 10 years.<br/><strong>Limitless possibility of raising the child</strong><br/>What she will be in the future, depends on you. Implement strict parenthood and discipline or be sloppy and spoil her with affections and lack of discipline.<br/><br/><strong>Full Costume Customization</strong><br/>Dress up your adopted daughter with cool outfit and accesories, change her hairstyles. Give her lots of food and allowance, and see the consequences...<br/><br/><strong>Engaging action puzzle battle system</strong><br/>Battle it out and have fun with puzzle battle system where your daughter will be challenged in three categories: Fight battle, Quiz battle, and Score battle.<strong>RELEASE INFO</strong>Ciel Fledge will be released for Windows on Steam and DRM-free some time in Q2 2018 (tentative).", "metacritic": null, "released": null, "tba": false, "updated": "2023-08-02T13:21:18", "background_image": "https://media.rawg.io/media/screenshots/f48/f487bc00a95622d046a99b77e89fed92.jpg", "website": "http://studionamaapa.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 30, "dropped": 2}, "playtime": 4, "achievements_count": 43, "ratings_count": 2, "suggestions_count": 178, "game_series_count": 0, "reviews_count": 2, "platforms": ["Linux", "PC"], "developers": ["Studio Namaapa"], "genres": ["Simulation", "Indie"], "publishers": ["Studio Namaapa"], "esrb_rating": null}