{"id": 495354, "slug": "project-gamma-alpha-wip", "name": "Project Gamma - Alpha [WiP]", "name_original": "Project Gamma - Alpha [WiP]", "description": "<p><strong>This project is in development, so be indulgent ;)</strong></p><p><strong>English</strong>:<br/></p>\n<p><em>Project Gamma is a management game - simulation - tycoon, in which you embody a rich Roman owner during antiquity. Your objective is to produce wine, in a traditional way by looking for quality wines, or in a more industrial way with fields as far as the eye can see. However, in order to achieve this, you have to build the various buildings necessary for the production, transformation, maceration and storage of the grapes, to eventually obtain your amphorae of wine, which you will be able to export throughout the empire. In addition, a good management of the employees is recommended in order to obtain maximum efficiency in their different tasks in the vineyard.</em></p>\n<p><strong>Objective of the game</strong>:</p>\n<p>You have to plant vines, maintain them over the months to get a stable production, and for that you will have to hire workers. In addition, you'll have to master the production chain from grape processing to the amphorae of wine that you can sell in the stall to the merchants. The stages in terms of buildings : (Vine-&gt; Stomping Vats -&gt; Wine Press -&gt; Wine Storehouse -&gt; Storehouse -&gt; Stall) <br/>The steps in terms of resources : (Bunchs of Grape -&gt; Grape Must -&gt; Grape Juice -&gt; Amphora of Wine).</p>\n<p><strong>Help &amp; Tips</strong>:<br/></p>\n<p><em>Escape</em>: Exit the game<br/><em>B</em>: Open Building Mode, time is paused<br/><em>O</em>: Buy a worker for 1,000 sesterces<br/><em>+</em> or - (Keypad): Switch between workers<br/><em>A</em> or E : Switch between workers<br/><em>Left Click</em>: Place where the worker will move / Place a building<br/><em>Scroll</em> : Zoom in / Zoom out &amp; Scroll through the list of buildings in Build mode</p>\n<p><strong>Others</strong>: </p>\n<p>- The time of a game is estimated at 20-30 min.<br/>- A month goes by in a minute<br/>- In case of a problem with a worker, make a screen of the game (so I can see the action that's above their head).<br/>- In case of problems, write it in the #bugs channel, trying to detail as much as possible the process you did to get to this bug / crash / blockage.<br/>- Chances are that for the moment, you're not having so much fun, because there are no indications, no precise goal, except being rich, but the road map updates will change that.</p>\n<p><strong>Game's Roadmap</strong> :<br/></p>\n<ul><li><strong>0.0.3 </strong>- <strong>Alpha </strong>- Realase the 21th August</li><li><strong>0.1.0</strong> -<strong> Building Update</strong> <strong>0.2.0 </strong>- <strong>Exchange Update</strong></li><li><strong>0.3.0 </strong>- <strong>Workers Update</strong></li><li><strong>0.4.0 </strong>-<strong> Developed Commerce &amp; Ressources Update</strong></li><li><strong>0.5.0 </strong>- <strong>Wine Update </strong></li></ul>\n<p>Connect with us : </p>\n<p>Official Discord server</p>\n\n<p><strong>French </strong>: </p>\n<p><em>Project Gamma est un jeu de gestion - simulation - tycoon, dans lequel vous incarnez un riche propriétaire romain durant l'Antiquité. Votre objectif est de produire du vin, de façon artisanale en recherchant des crus de qualités, ou de manière plus industrielles avec des champs à perte de vue. Cependant, pour y arriver, vous devez vous atteler à construire les différents bâtiments nécessaires à la production, transformation, macération et stockage des raisins, pour à terme obtenir vos amphores de vin, que vous pourrez exporter à travers l'empire. En plus, une bonne gestion des employés est recommandé afin d'obtenir une efficacité maximale dans leurs différentes tâches dans le vignoble.</em><br/></p>\n<p><strong>Objectif du jeu :</strong></p>\n<p>Vous devez planter des vignes, les entretenir au fur et à mesure des mois afin d'obtenir une production stable, et pour cela, il vous faudra engager des ouvriers. Par ailleurs, vous devrez maîtriser la chaîne de production de transformation du raisin jusqu'aux amphores de vins que vous pourrez vendre dans l'étale aux marchands. Les étapes en terme de bâtiments : (Vigne -&gt; Fouloir -&gt; Pressoir -&gt; Chai -&gt; Entrepôt -&gt; Étale) \r\nLes étapes en terme de ressources : (Grappes de Raisin -&gt; Moût de Raisin -&gt; Jus de Raisin -&gt; Amphore de Vin).</p>\n<p><strong>Aide &amp; Astuces</strong> :<br/></p>\n<p><em>Echap </em>: Quitter le jeu<br/><em>B</em> : Ouvrir le mode Construction, le temps est en pause<br/><em>O</em> : Acheter un ouvrier pour 1 000 sesterces<br/><em>+</em> ou - (Pavé numérique) : Passer d'un ouvrier à un autre<br/><em>A</em> ou E : Passer d'un ouvrier à un autre<br/><em>Clique Gauche</em> : Endroit où l'ouvrier va se déplacer / Placer un bâtiment<br/><em>Scroll</em> : Zoomer / Dézoomer &amp; Faire défiler la liste de bâtiments dans le mode Construction</p>\n<p><strong>Autres </strong>: </p>\n<p>- Le temps d'une partie est estimée à 20-30 min<br/>- Un mois s'écoule en 1 minute<br/>- En cas de problème avec un ouvrier, faire un screen du jeu (pour que je puisse voir l'action qui est au dessus de leur tête<br/>- En cas de problèmes, l'écrire dans le channel #bugs en essayant de détailler le plus possible le processus que vous avez effectué pour arriver à ce bug / crash / blocage<br/>- Il est fort probable que pour le moment, vous ne vous amusiez pas tellement, parce qu'il n'y a pas d'indications, d'objectif précis, hormis être riche, mais les updates de la road map modifieront cela</p>\n<p>Rejoignez nous sur : </p>\n<p>Serveur Discord Officiel</p>", "metacritic": null, "released": "2020-09-14", "tba": false, "updated": "2020-09-18T05:51:04", "background_image": "https://media.rawg.io/media/screenshots/fbf/fbf57404f11a811a2aadd66644533867.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 66, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Benji"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}