{"id": 495420, "slug": "weightshiftctrl", "name": "WeightSHIFT+CTRL", "name_original": "WeightSHIFT+CTRL", "description": "<p>Hang-gliding simulator done right. </p>\n<p>The weight-shift control model and a proper multi-body physical simulation of this simulator make it very distinct from traditional aircraft simulators and perfect for simulating ultralight aircraft like hang-gliders.<br/></p>\n<p>Desktop (non-VR) version is available here on Itch.io for free, however the hang-gliding simulator was originally developed as a VR teaching aid in a hang-gliding course with realism and piloting exercises in mind. Hardware components were made out of real hang-glider parts. The software was developed specifically for this purpose because existing generic flight simulators do not simulate weight-shift controlled aircraft accurately enough. Therefore, custom aerodynamics and rigid body setup were developed in Unreal Engine 4. To our knowledge this makes it the only simulator of its kind in the world.</p>\n<p>Current simulator design enables VR experience in both the sitting and the full hang-glider rig setup with multiple realism options. It can also be run as a standard desktop flight simulation. Future plans include spectator mode for training and real-time flight analysis, multiplayer for group soaring exercises, higher realism in thermals simulation and rendering, and much much much more…</p>\n<p>VR variant will soon be available via Patreon tiers (see \"More information\" for the link to Patreon page).</p>", "metacritic": null, "released": "2020-09-14", "tba": false, "updated": "2020-09-18T06:06:59", "background_image": "https://media.rawg.io/media/screenshots/d04/d04e6af951e67d536d8582c2af8a1fd6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 200, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Aileron"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}