{"id": 49551, "slug": "king-of-the-eggs", "name": "King of the Eggs", "name_original": "King of the Eggs", "description": "Lots of nonsense, lots of cracked laughs and shells. Welcome to Eggorias, a land where you prove your worth and your capability to rule a kingdom by smashing eggs… yup, seems about right, or at least historically accurate. 4 nations send their strongest champions to fight for their beliefs and their right to claim the throne. The rules of the duel are picked by you, the players, whether the destiny of the kingdom shall be determined by a tournament, a dance till the armageddon or a frisky quick play. The ultimate champion shall rise for his abilities to become the king of the hill, be the last one standing in a survival competition or cooperating in a hot ball event. No yolks are given in the matter of choosing the next king of the land, it can be determined in matter of seconds through frivolous, merciless matches full of quick action and death.<br/><br/>In this 4-player couch party game you will have several opportunities to become the king, and if your friends don’t agree with that they can always steal back the crown, in the different levels that we offer. The levels are different enough so that if you suck in one kind it’s most likely that you won’t in the others... unless of course you are a butterfingered mess, but that would be okay as well, we will love you anyway. Your mastership will come through in events that test your cleverness, the speed of your fingers and luck. <br/><br/><strong>In Our Basket:</strong><br/><ul><li>4 Fun characters representative of each silly nation.<br/></li><li>3 Game Modes: King of the hill, Survival and Hot ball. 3 Variations for each mode <br/></li><li>Each one has high level of emergent gameplay, so anything and everything can happen.<br/></li><li>Fast-paced and eggxtremely easy to learn. Simpler than frying an egg.<br/></li><li>3 Ways to Play: QuickPlay, Tournament and Rain of Yolks. So you can have either a quickie or a full afternoon of destroying friendships.<br/></li><li>A dozen or two of eggcelent egg puns. I mean come on, who doesn’t love those, they always crack me up… get it? CRACK me up?<br/></li><li>Cock sound effects, nuff said.</li></ul>", "metacritic": null, "released": "2018-01-12", "tba": false, "updated": "2019-08-28T17:05:11", "background_image": "https://media.rawg.io/media/screenshots/9d8/9d858073c653cd3f25b73f6a15fa449a.jpg", "website": "http://mralpacagames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 125}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 373, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mr Alpaca Games"], "genres": ["Casual", "Indie"], "publishers": ["Mr Alpaca Games"], "esrb_rating": null}