{"id": 495619, "slug": "mystery-at-greveholm-3-the-old-legend", "name": "Mystery at Greveholm 3: The Old Legend", "name_original": "Mystery at Greveholm 3: The Old Legend", "description": "<p>The Mystery at Greveholm 3: The Old Legend is the third installment of The Mystery at Greveholm series and plays one hundred years before the preceding episodes, The Mystery at Greveholm and The Mystery at Greveholm 2: Journey to Planutus.</p>\n<p>This time you play the princess herself, who lives in the castle with the “duke” (as he is called in this game), his servant Jean and the already familiar robot Sprak. In the Piano room at Greveholm the duke is trying to play &quot;The old castle song,&quot; but his sheet of music with the song is missing. The culprit is Jean, who has painted portraits of the duke on the back of the sheet of music, which were sent to different parts of Sweden to show how handsome the duke is and to find him a wife. Jean is punished for his mistake and the princess decides to help him and locate all the portraits. To start she will need the help of Sprak, who will provide her with useful items for her quest.</p>\n<p>Unlike the sequel, this installment uses a similar interface as the original game. Gameplay is a bit easier. The first episode of the game plays in the Piano room, where the player has to solve a number of puzzles, including various sound puzzles. This episode assumes that you are already familiar with the rooms in the castle, which you explored in the first game. In the second episode the player explores various locations in Sweden, and after solving all puzzles, nine pieces of the sheet of music will be gathered. In the third - short - episode the player has to steer a carriage on a road with big rocks to find a shed with an easel, where the original sheet of music can be put together. During the first episodes the player will find scrolls that show visual hints for the puzzles.</p>", "metacritic": null, "released": "2000-01-01", "tba": false, "updated": "2020-09-18T09:02:30", "background_image": "https://media.rawg.io/media/screenshots/9ae/9ae3e556c696f1d26bd726e9e3575a40.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1, "toplay": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 414, "game_series_count": 2, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": [], "genres": ["Adventure", "Puzzle"], "publishers": ["Young Genius Software"], "esrb_rating": null}