{"id": 495649, "slug": "doom-destiny-worlds", "name": "Doom & Destiny Worlds", "name_original": "Doom & Destiny Worlds", "description": "<strong>Stranded </strong>and <strong>naked </strong>on a shore of an unknown planet, four friends wake up afflicted by the most common video game disease: <strong>amnesia</strong>.<br/>Who summoned them? Why are they here? How will they return home? What’s for dinner?<br/><br/><h3>What is Doom &amp; Destiny Worlds </h3>Doom &amp; Destiny Worlds is an <strong>open world</strong> turn-based <strong>RPG </strong>with <strong>crafting</strong>, building, farming, and <strong>4 players</strong> local co-op option.<br/><br/>Craft your way through <strong>crazy cosplaying goblins</strong>, <strong>farting stone giants</strong> and <strong>cursed genies</strong> across more than <strong>60 hand-made islands</strong>.<br/><br/>Gather resources, customize your party, and <strong>unravel the mystery</strong> that shrouds the three worlds of Doom &amp; Destiny Worlds.<br/><br/><h3>It’s dangerous to go alone! </h3><br/>Take advantage of every tool at your disposal to overcome Doom &amp; Destiny Worlds many challenges!<br/><br/><ul><li>The <strong>Dynamic Crafting System (DyCS)</strong> allows you to use blueprints and any available crafting material to create custom made weapons, armors, drinks and explosives!<br/><br/></li><li>Defeat enemies to level up your party and unlock <strong>Feats </strong>and increase your <strong>Abilities</strong> to equip awesome weapons and <strong>create unique Classes</strong> to suit your playstyle.<br/><br/></li><li>In Doom &amp; Destiny Worlds, turn-based battles take place in real-time. While you fight, enemies can join the fray as reinforcements adding extra layers of challenge!</li></ul><br/><h3>It’s important to chillax!</h3><br/>You might need to find a way back home, you might be the chosen and be required to save the world, BUT even a Hero needs to relax.<br/><br/><ul><li>Play with the <strong> highly interactive</strong> open world of Doom &amp; Destiny Worlds.<br/><br/></li><li>Feel free to<strong> exploit nature</strong>: <strong>mine </strong>tunnels, <strong>dig </strong>canals and <strong>rise </strong>mountains.<br/><br/></li><li>Create your personal camp. Craft forniture or steal it from around the worlds.<br/><br/></li><li>Tired to gather fruit or to buy it from the local monster grocery shop? Grow it yourself! Farm sweet fruits, magical berries, interesting vegetables and prepare healthy snacks and grown-up drinks.</li></ul><br/>The limit? Your imagination... And the number of slots in your inventory.<br/><br/>", "metacritic": null, "released": "2020-09-18", "tba": false, "updated": "2022-08-19T10:15:33", "background_image": "https://media.rawg.io/media/screenshots/54c/54cdbc8b88bf73a77ded40089c4f8e0c.jpg", "website": "http://doomanddestiny.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 13}, "playtime": 1, "achievements_count": 31, "ratings_count": 0, "suggestions_count": 237, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "PC"], "developers": ["Heartbit Interactive"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Heartbit Interactive"], "esrb_rating": "Mature"}