{"id": 495636, "slug": "head-bumper-editcraft", "name": "Head Bumper: Editcraft", "name_original": "Head Bumper: Editcraft", "description": "In this game you will find something new every day because its content is created by the players. An adventurous campaign, a variety of game modes including daily challenges with rewards, and community levels await you. You can also try your hand at the level editor! :)<br/>The game currently includes two game modes: Freerun &amp; Campaign.<br/><br/> <strong>The Freerun</strong> game mode is an experimental variation of the endless runner in which the player hovers over the abyss with the help of superjump items and his task is to cover the greatest possible distance in this way. On the way, the player encounters various obstacles and collectable items. You can break records in two categories: the best distance in a single attempt and the number of points achieved in five attempts. The player receives rewards for achieving certain results.<br/><br/> <strong>The Campaign</strong> mode consists of community levels. The player's goal is to find one of the finish blocks while traversing the platform world made of various types of blocks. Touching each type of block causes a different action - there are pushable blocks, exploding blocks and many more. The actions of the blocks can be linked together using programming cables. There are two ways to complete each level including collectable stars - either by finding all the stars or by going to the finish block right away. Collecting all stars in a level gives you more experience points and other rewards. Each player can create their own level and play and rate the levels of others. By completing the highlighted levels, you can earn special rewards such as custom body parts for your character.<br/><br/> With <strong>Character Customization</strong>, each player can compose their own unique appearance. Different types of body parts can be mixed together and given custom colors. You can also change the parameters of your character, such as jump height, movement speed and agility. The higher the rank you achieved with the experience points, the more stat points you can allocate.", "metacritic": null, "released": "2020-09-19", "tba": false, "updated": "2020-09-21T01:55:42", "background_image": "https://media.rawg.io/media/screenshots/8d7/8d7f31a82575ef77816a085ef35127aa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 181, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Blue Spot Games"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Blue Spot Games"], "esrb_rating": null}