{"id": 495674, "slug": "monster-girl-breeder", "name": "Monster Girl Breeder", "name_original": "Monster Girl Breeder", "description": "<p>Ready to enjoy a gaming session with their favorite erotic game, our protagonist is suddenly whisked away to a fantasy world! Once you regain your bearings, the first thing you notice is the visual feast of boobies and butts of sexy monster girls spread out in front of you.<br />\nIt is revealed that you have been summoned to this strange land for a purpose. Their village is trapped behind a barrier, and with no men inside with them there was no way to keep the village going. Until you arrived that is!<br />\nWill you become the greatest Monster Girl Breeder and help these poor monster maidens repopulate their village?!<br />\nTranslated version of the original Japanese Visual Novel<br />\nAll the sexy monster girls are fully voiced with their original Japanese dialogue.<br />\nOriginal artwork HD upscaled with 16:9 and 4:3 variants.<br />\nHours of &quot;plot&quot; to enjoy.<br />\nAudio including music and special effects.<br />\nEnhanced with character sprite animations.<br />\nGallery and Scene selections.<br />\n18 sex scenes full of baby making goodness!<br />\nMonster Girl Breeder is the English localization of a Visual Novel originally created by prolific Japanese developer Norn/Miel. We at Cherry Kiss aim to provide an authentic Japanese Visual Novel experience to gamers outside of Japan.<br />\n<strong> PLEASE NOTE </strong><br />\nAll characters described and visually represented in this game are over 18 years of age, and no actual, nor identifiable minor was used in the production of this game.</p>", "metacritic": null, "released": "2020-09-18", "tba": false, "updated": "2022-03-15T12:16:40", "background_image": "https://media.rawg.io/media/games/0f9/0f9091c8d8828e728ec6ccb7059820d8.jpg", "website": "https://cherrykissgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 12, "toplay": 1}, "playtime": 1, "achievements_count": 18, "ratings_count": 0, "suggestions_count": 520, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["miel", "Norn"], "genres": ["Casual"], "publishers": ["Cherry Kiss Games"], "esrb_rating": null}