{"id": 495694, "slug": "shark-tank-tycoon", "name": "Shark Tank Tycoon", "name_original": "Shark Tank Tycoon", "description": "Empire Building Idle Clicker! Click, tap, and grow your business tycoon empire!<br/><br/>Do you have what it takes to survive the Shark Tank? Build your business empire and become a billionaire in the official idle clicker mobile game, Shark Tank Tycoon.<br/><br/>As the newest Shark in the tank – Hear pitches from entrepreneurs and choose which companies and products to invest in and grow your empire to become a self-made multi-millionaire or even multi-billionaire business tycoon! Click, tap, and build your way up the leaderboard to prove that you are the top Shark. Search in multiple cities across the world for the best businesses and products that hopeful entrepreneurs and inventors have to offer.  The more your empire grows, the more idle cash you'll earn, even while offline!<br/><br/><br/>Next in the tank is YOU! Are you in or are you out?<br/><br/><br/>The Ultimate Shark Tank mobile experience is now on your phone and tablet! Become the next Shark and beat the competition to conquer the world of business.<br/><br/><br/>Shark Tank Tycoon offers exciting and addictive idle clicker game mechanics including:<br/>- DAILY QUESTS: Complete fun, challenging quests each day to earn more money and gain a competitive advantage.<br/>- INVEST IN PRODUCTS: Choose the products you want to build, market, and grow. As a Shark, you decide how to invest by making high stakes deals to cut out the competition.<br/>- BUILD BUSINESSES: Unlock, manage, and upgrade businesses to earn more idle money. Click and tap to become a billionaire faster!<br/>- EXPAND YOUR EMPIRE: Dominate and take over markets as you grow your business and franchise reach in multiple cities and globally.<br/>- HIRE MANAGERS:  Grow your businesses by unlocking and upgrading advisors to earn higher profits and money.<br/>- LIMITED TIME EVENTS: Complete Festivals each weekend to win special items such as unique entrepreneurs and business managers<br/>-MAKE YOUR MONEY WORK FOR YOU: The bigger your business empire, the more money you'll generate.  Even when you are idle or asleep, your business will continue to produce cash.<br/><br/>TV’s Emmy-Award winning Shark Tank is now your favorite incremental game on mobile devices. As a Shark, start from rags and grow to riches in this best new business idler! Prove your ability as a cunning entrepreneur by investing stake in unique products and build production by managing and upgrading businesses and buildings. Dominate entire cities as you expand your empire on your way to becoming a millionaire business mogul.<br/><br/>This app may include advertising tailored to your interests on behalf of the Sony Corporation family of companies, as well as third parties. To learn more about this, visit www.aboutads.info. To exercise certain choices regarding interest-based advertising, visit www.aboutads.info/choices. You may also download the App Choices app at www.aboutads.info/appchoices.<br/><br/>Terms of Use: https://www.sonypictures.com/corp/tos.html<br/>Privacy Policy: https://www.sonypictures.com/corp/privacy.html<br/>Do Not Sell My Info: https://privacyportal-cdn.onetrust.com/dsarwebform/d19e506f-1a64-463d-94e4-914dd635817d/b9eb997c-9ede-451b-8fd4-29891782a928.html", "metacritic": null, "released": "2020-09-15", "tba": false, "updated": "2020-09-21T02:25:18", "background_image": "https://media.rawg.io/media/screenshots/4c7/4c7c194be662b40243dc3a6bd1c9f726_9EsUxYd.jpg", "website": "https://www.sonypictures.com/games", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 129, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sony Pictures Television"], "genres": ["Strategy", "Simulation"], "publishers": ["Sony Interactive Entertainment"], "esrb_rating": "Everyone 10+"}