{"id": 495695, "slug": "idle-police-tycoon-cops-game", "name": "Idle Police Tycoon - Cops Game", "name_original": "Idle Police Tycoon - Cops Game", "description": "Will you be able to manage a police station and become a police tycoon? <br/><br/>Take control of numerous police precincts and become rich preserving the security of your district. <br/><br/>Start running a small police department and work hard to make your reputation grow. Improve every detail in your facilities and turn your small office into a renowned police station. <br/><br/>Deal with the needs of your headquarters and follow the proper strategy to expand your business while providing safety to the community. Upgrade your buildings, improve your vehicle fleet, build new areas, provide the best working material to your team, enlarge your office to streamline the paperwork, hire the most efficient police officers in town, or learn the ultimate police investigation methods. Take decisions and invest your money wisely. <br/><br/>COMBAT CRIME WITH DIFFERENT STRATEGIES:<br/><br/>Take numerous cases and draw up different investigation plans to solve them. Catch the most wanted criminals in the neighborhood. Unlock well-known characters during the game and put them behind bars. <br/><br/>MANAGE YOUR RESOURCES EFFICIENTLY TO SUCCEED:<br/><br/>Invest your money and your idle accountancy wisely to maintain your police station and your staff properly equipped. Watch out for the electricity supply, provide the ultimate technology to your agents, or get armored vehicles to keep the security of your special units. Every detail counts to level up. Watch out! A bad strategy could make your business be in the red...<br/><br/>MANAGE YOUR STAFF: <br/><br/>Your district will need the best working team in town. Study the situation regularly and hire workers according to your workflow and growth strategy. All employees and their departments will cover important needs in your business, and you should manage your team intelligently to make your police station profitable. Unlock famous police officers and be the scourge of the crime!<br/><br/>ENSURE SECURITY IN YOUR DISTRICT <br/><br/>Accomplish missions and invest your idle money to reach the security levels desired by the community. Keep social security and make your police department profitable a the same time! Make your reputation grow thanks to your business strategy and receive offers to run bigger police stations.<br/><br/>If you like management and idle games, you will enjoy Idle Police Tycoon - Cops Game! A casual easy-to-play game where strategic decisions have to be taken to grow a police team with profitable results. Improve your empire starting from a small and modest police station and unlock visible progress in your premises. Transform your small business into the best police department in the city and become the best police manager around the world!", "metacritic": null, "released": "2020-09-16", "tba": false, "updated": "2020-09-21T02:35:49", "background_image": "https://media.rawg.io/media/screenshots/29d/29d32050ea53b8d16573bdb0337a7de7.jpg", "website": "http://codigames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 126, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["Digital Things", "Codigames"], "genres": ["Strategy", "Simulation"], "publishers": ["Digital Things Sociedad Limitada"], "esrb_rating": null}