{"id": 495618, "slug": "mystery-at-greveholm-2-the-journey-to-planutus", "name": "Mystery at Greveholm 2: The Journey to Planutus", "name_original": "Mystery at Greveholm 2: The Journey to Planutus", "description": "<p>The Mystery at Greveholm 2: The Journey to Planutus is the sequel to The Mystery at Greveholm. After freeing the princess of Planutus from her imprisonment by the skeleton of the count at Greveholm in the first episode, the princess has returned to her planet. But the evil jellyfish king has locked her in a cell and has taken over the planet. He has obtained Planutus&#39; crystal ball and uses his vessel to suck up all the water on Planutus.<br />\nIvar, Lillan, and Sprak the flying robot, the princess&#39; faithful companions, have traveled to earth, but their spaceship has crashed in front of Greveholm castle. In order to save the princess and stop the jellyfish king, the first thing to do is to fix the rocket. In the second part, back at Planutus, the power in town has to be restored and some contraptions have to be repaired, after which the party is able to access the region where the jellyfish king lives. In the third part of the game, the player has to locate the crystal ball and bring it back to the city in order to awake the princess.</p>\n<p>Gameplay is completely different from the first and third installment of the Mystery at Greveholm series as the game design includes RPG features. The game world is shown in a top-down perspective. The player has to control three characters, which have to eat or otherwise they fall asleep after a short episode. An energy meter shows how much energy is left. Each character has its own inventory, and the characters have different properties. For example, Ivar is able to cut down trees and to drive a vehicle, Lillan is a good swimmer and Sprak can fly into tall buildings. Except for a few mild arcade sequences, gameplay consists of locating items and using them at the right place. Sometimes only one of the characters is able to use an inventory item. Scrolls can be found that include hints. The player can choose to play the game with or without a time-limit.</p>", "metacritic": null, "released": "1999-01-01", "tba": false, "updated": "2020-09-18T09:17:08", "background_image": "https://media.rawg.io/media/screenshots/23c/23ce832462767fbe257a17053e69b597.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1, "toplay": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 304, "game_series_count": 2, "reviews_count": 1, "platforms": ["PC", "macOS"], "developers": ["Vioma Digital Media"], "genres": ["Adventure", "Puzzle"], "publishers": ["Young Genius Software"], "esrb_rating": null}