{"id": 495669, "slug": "case-00-the-cannibal-boy", "name": "Case 00: The Cannibal Boy", "name_original": "Case 00: The Cannibal Boy", "description": "Case 00: The Cannibal Boy is a half-hour visual novel <strong>partly based on a true story, written by a writer with a background in psychology.</strong> It is a psychological horror story with an urban legend theme.<br/><br/>This work is also a prequel to Physical Exorcism: Case 01. Some of the same characters appear, but the two games have unrelated plots that can be enjoyed separately.<br/><br/>https://store.steampowered.com/app/949890/<h3>Story</h3><br/><br/>Have you heard of the \"Cannibal Boy\"? If you've heard his story, you have to hurry and tell someone who hasn't. Or else, he might just come get YOU...<h3>Characters</h3><br/><br/><strong>\"You\"</strong><br/>A master's student in psychology. The topic of your master's thesis is \"judgment and decision making.\"<br/>\"Are you going to do a case conceptualization?\"<br/><br/><br/><strong>Jade</strong><br/>An interning psychologist. She is constantly smiling but her eyes always look shut.<br/>\"Eating is essentially a kind of possession, a kind of intimacy, just like having sex.\"<br/><br/><br/><strong>James</strong><br/>A grad student who enjoys college life. He sometimes worries about whether he will find a decent job.<br/>\"It's the urban legend everyone's been talking about!\"<br/><br/><br/><strong>Grete</strong><br/>Jade's BFF. She has a tendency to be passive aggressive and jumps to conclusions.<br/>\"Your fault your fault your fault your fault your fault...\"<br/><br/><br/><strong>Hans</strong><br/>Grete's twin brother. He is prettier than girls.<br/>\"I can be there for Grete anyway.\"<br/><br/><br/><strong>The handsome guy</strong><br/>Grete's crush. He is a mystery.<br/>\"I can't say exactly...\"", "metacritic": null, "released": "2020-09-18", "tba": false, "updated": "2020-09-21T02:11:29", "background_image": "https://media.rawg.io/media/screenshots/230/230a68f981bfee7d30b74c5f4285a134.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 3, "ratings_count": 0, "suggestions_count": 184, "game_series_count": 3, "reviews_count": 0, "platforms": ["PC"], "developers": [], "genres": ["Adventure", "Casual", "Indie"], "publishers": [], "esrb_rating": null}