{"id": 49578, "slug": "covens", "name": "Covens", "name_original": "Covens", "description": "A GLOBAL CONTEST BETWEEN DARK AND LIGHT WITCHCRAFT \r\n\r\n◐ The Autumn Tribunal ◑ \r\n\r\nWe are midway through the autumn tournament, headed toward the final \"Ember Days\" that will decide the strongest witches and covens in the world. The Winter Tribunal will begin December 21, the Winter Solstice. \r\n\r\nThe White School of magic is slight stronger worldwide than the Shadow School. \r\n\r\n▶ Features\r\n\r\n• Build powerful covens with your friends.\r\n\r\n• Compete in the summer tournament to earn special rewards at the end of the season.\r\n\r\n• Summon otherworldly spirits. (Beware, it is an unstable art)\r\n\r\n• Use your energy to fly to exotic places around the world and help others banish powerful spirits that invade our world.\r\n\r\n• Hunt for mythical creatures in the real world that can be mastered to serve as your Familiar (pets).\r\n\r\n• Claim Magical Places of Power around the world and earn rewards for every hour you hold them.\r\n\r\n• Search for a multitude of powerful items that can change your fate.\r\n\r\n• Engage in events and questlines. \r\n\r\n• Infuse your spellcraft with botanicals found around the world.\r\n\r\n• No two days are alike in Covens as even the phases of the moon have an influence on your energy and power.\r\n\r\nCovens is a work of passion from indie Raincrow Studios. Inspired not by the success of other titles but by original storytelling through words, art, and music. It is the first in a series of augmented reality titles that will be played on the same real world map. It is the flagship of a shared universe of real world games. \r\n\r\nWe love the feedback. We need the feedback! Good, bad, ugly - let us hear from you.\r\n\r\nCovens Official Community: \r\nhttps://covens.raincrowstudios.com/\r\n\r\nFollow us!\r\ntwitter.com/RaincrowStudios\r\n\r\nLike us on Facebook!\r\nfacebook.com/RaincrowStudios\r\n\r\nOn Reddit @ /r/Covens", "metacritic": null, "released": "2017-10-31", "tba": false, "updated": "2019-11-01T02:59:38", "background_image": "https://media.rawg.io/media/screenshots/a9b/a9b7a0029b04bbedbb307189debe00c3.jpg", "website": "https://raincrowstudios.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 102, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Raincrow Studios", "Raincrow"], "genres": ["Adventure", "RPG"], "publishers": ["Raincrow Studios"], "esrb_rating": null}