{"id": 495764, "slug": "transylvanian-castle-by-siyei-er-2020", "name": "Transylvanian Castle by Siyei er (2020)", "name_original": "Transylvanian Castle by Siyei er (2020)", "description": "<p>En esta aventura, tú encarnas al famoso profesor, y tu misión será la de acabar con<br/>esta terrible maldición, pero deberás darte prisa, ya que solo dispones de tres días<br/>antes de que la maldición acabe con tu vida…<br/>El primer paso será el de recorrer todas las estancias del castillo hasta encontrar al<br/>Conde Drácula y acabar con su vida, solo así conseguirás acabar con este mal.<br/>Por último, deberás encontrar la llave que te permitirá escapar del castillo, ya que<br/>tras entrar en él, la pesada puerta se ha cerrado a tu paso y solo con dicha llave<br/>conseguirás abrirla.</p>\n<p>Este juego no es original, ni pretende serlo.<br/>Fue ideado y diseñado para rendir Homenaje a los maravillosos años<br/>80’s, a sus juegos, su música, sus series, a la moda no y en especial a<br/>Chris Dorrell, diseñador y programador de videojuegos para<br/>ordenadores de 8 Bits y autor de 2 magníficos juegos que se<br/>encuentran entre mis favoritos, The Oracle’s Cave y The Runes of<br/>Zendos.</p>\n<p>CRÉDITOS<br/>Idea, Diseño y Codificación.... Siyei-Er<br/>Soporte Técnico………………….. AdolFito<br/>Beta Tester…………………………. Azimov<br/>(C) FITOSOFT 2020</p>\n\n<p>------------------------------------------</p>\n<p>In this adventure, you play the famous professor, and your mission will<br/>be to end this terrible curse, but you must hurry, since you only have<br/>three days before the curse ends your life…<br/>The first step will be to go through all the rooms of the castle until you<br/>find Count Dracula and end his life, only then will you be able to end<br/>this evil.<br/>Finally, you must find the key that allows you to escape from the castle,<br/>since after entering it, the heavy door has closed in your path and only<br/>with this key will you be able to open it.</p>\n<p>This game is not original, nor does it pretend to be.<br/>It was conceived and designed to pay tribute to the wonderful 80's,<br/>their games, their music, their series and especially Chris Dorrell,<br/>designer and programmer of video games for 8 Bit computers and<br/>author of 2 magnificent games that are among my favorites, The<br/>Oracle's Cave and The Runes of Zendos.</p>", "metacritic": null, "released": "2020-09-20", "tba": false, "updated": "2020-09-21T02:44:51", "background_image": "https://media.rawg.io/media/screenshots/c3a/c3a547c1aec91221d32e12e9cf8c8243.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 198, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["fitosoft"], "genres": [], "publishers": [], "esrb_rating": null}