{"id": 49573, "slug": "vanguard-v-for-google-cardboard", "name": "Vanguard V for Google Cardboard", "name_original": "Vanguard V for Google Cardboard", "description": "Vanguard V is a fast-paced 3rd person rail shooter, designed for Virtual Reality\r\n\r\nHelp support this title at VanguardV.com and become part of VR history!\r\nMake sure to check out the other Google Cardboard game 'Proton Pulse'. All sales go directly into funding Vanguard V development.\r\n\r\n-------------------\r\n\r\nVanguard V is a fast action VR experience that takes you on a journey from the low orbit of our planet, down to the very core. Designed for VR from day one, Vanguard V is a celebration of control, design, and amazing music.\r\nProduction of this title is a collaboration of eight team members. Much of the talent was sourced from dedicated people in the reddit community. From voice acting to chip tune music, reddit has been instrumental in making this VR experience a reality. The power of the internet is truly amazing.\r\n\r\nVanguard V is an all-new Virtual Reality action game that takes the best aspects of flight and adventure. Driven by music, story, and innovative VR design, Vanguard V is a celebration of gameplay to welcome Virtual Reality to the world.\r\n\r\nYou play as Qu, who has tracked the parasite menace from worlds afar and with the help of her A.I. companion, BiT, is fighting to save the planet's inhabitants from utter annihilation. Fly in low orbit while re-entering the atmosphere, skim the waters of the ocean, dive into the tunnel from the initial impact and make your way to the center of the planet to exterminate the source of the parasite infestation. Lock on with your VR targeting system and blast through the alien threat!", "metacritic": null, "released": "2015-07-16", "tba": false, "updated": "2019-10-22T14:31:53", "background_image": "https://media.rawg.io/media/screenshots/045/045c7126ff84eb30bd389aa9c46e3f9d.jpg", "website": "http://www.VanguardV.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 256, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["ZeroTransform"], "genres": ["Shooter", "Adventure", "Arcade"], "publishers": ["Zero Transform L.L.C."], "esrb_rating": "Everyone 10+"}