{"id": 495704, "slug": "nameless-cat", "name": "Nameless Cat", "name_original": "Nameless Cat", "description": "Received Honorable Mention Award in 2018 Bahamut ACG Creation Contest<br/><br/><br/>｜Story Background｜<br/><br/>A nameless kitten who stumbled upon a strange world, embark on an action-packed journey through the fantasy realm to return to its owner's embrace.<br/>On the way home nameless cat encounters various creatures, undergo trials and hardships, which will become its takeaways of this journey!<br/><br/>\"Oh, you know, many have given up halfway\" ——God<br/>\"I don't see the value worthy of pursuing in that thing\" ——Rabbitman<br/>\"Here comes another lamb to be slaughtered\" ——Owlvin<br/><br/>Can it overcome all dangerous challenges, defeat the enemy, and return to its owner?<br/>A little adventure story of a cat is about to begin ⋯⋯<br/><br/><br/>｜Game Features｜<br/><br/>○ Western Style Narrative Mobile Game<br/>Game narrative consist of dialogues and levels, a heart-warming story told in cat's point of view<br/><br/>● 2D Side-Scrolling Action Game<br/>Challenge yourself with Hardcore difficulty gameplay in 3 different chapters and 40+ levels, with boss battles and special moves that will test your mastery!<br/><br/>○ Element of Mystery<br/>Play as an adorable kitten, through talking with other animals, defeating monsters, and collecting treasures, you gradually discover the mystery of your background, and find the way to return to your owner.<br/><br/>● Retro-inspired Pixel Style Graphics<br/>Render in stunning pixel art style, with charming characters and custom skin collectibles, Nameless Cat take you on a retro experience of amazing classics.<br/><br/>○ Original Music Festival<br/>In game music was specially designed by the team to create the sense of loneliness and indifference of the cat's journey, allow you to be immersed in the dual experience of stunning graphics and beautiful music during game play.<br/><br/><br/>｜News and Updates｜<br/>Facebook：https://www.facebook.com/KotobaGames/<br/>GameJolt：https://gamejolt.com/games/NamelessCat/417750<br/>Twitter @Antony_Sze：https://twitter.com/Antony_Sze<br/>Twitter @2030Qiu：https://twitter.com/2030Qiu<br/><br/>※ Game data is stored on users' devices. Deleting or Reinstalling the app will also remove any in-game data<br/><br/>Kotoba Games © 2017", "metacritic": null, "released": "2020-08-08", "tba": false, "updated": "2022-06-05T14:09:31", "background_image": "https://media.rawg.io/media/screenshots/480/4804fea471f445b3ea80f8e10b8d5a8b_02l7Oik.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 3, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 213, "game_series_count": 0, "reviews_count": 3, "platforms": ["iOS"], "developers": ["Yi Kwan Sze"], "genres": ["Action", "Adventure"], "publishers": ["Yi Kwan Sze"], "esrb_rating": "Everyone 10+"}