{"id": 495867, "slug": "sailing-the-seas-of-chaos", "name": "Sailing the seas of chaos", "name_original": "Sailing the seas of chaos", "description": "<p>This game was made in 48 hours for the 10th Alakajam featuring the themes of Maps, Ships, and Chaos!</p>\n<p>For the maze levels: navigate the maze and collect the map! Avoid the ghosts! WASD or arrows will move your pirate ship. You can shoot cannons with the space bar, but that will depend on the orientation of your ship, and cannons are slow moving projectiles. However, they may clear the maps to make navigation easier, and help deal with the meddlesome ghosts.</p>\n<p>The ghosts will remove one heart every time they touch you, and when your hearts are gone, it will be game over. :( <br/></p>\n<p>For the fractal levels: navigate using WASD or arrows, and Q/E or page up/page down to zoom in and out. The map will give you coordinates to get to,  and the center of the UI will tell you if there is a level to enter. <br/></p>\n<p>Extra: The \"O\" button turns on and off sound.</p>\n<p>Extra: In the fractal level, the \"T\" button turns off all non-fractal elements, should you want to just browse the Mandelbrot fractal to your hearts content. <br/></p>\n<p>Score: +1 for shooting rocks (hey why not it's fun), +50 for collecting the map. And -25 for shooting ghosts, we want to promote nonviolence even if they are already dead, and attempting to remove your hearts.<br/></p>\n<p>Things that will get fixed in the post-compo version!</p>\n<ul><li>I have the coordinates reversed in the fractal levels. I should fix that.</li><li>Better indication of where levels are. This was not easy and will easily take some time.</li><li>The places where the levels are, are not very interesting in the mandelbrot set.</li><li>There are only 10 levels. In fact, it might crash if you attempt to go further.</li><li>Sometimes the cannonballs do not collide with the rocks.</li><li>Ghosts could move smarter.</li><li>Your HTML version of the font may not render the hearts correctly, so you don't know how many lives you have left.</li><li>I'm sure there are many more issues but I can't think of them now.</li></ul>", "metacritic": null, "released": "2020-09-20", "tba": false, "updated": "2020-09-21T03:07:55", "background_image": "https://media.rawg.io/media/screenshots/da6/da6655ea64e098b709951d4b5813bee2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 14, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Laaph"], "genres": [], "publishers": [], "esrb_rating": null}