{"id": 495938, "slug": "demo-unity-third-person-shooter-template", "name": "DEMO Unity Third Person Shooter Template", "name_original": "DEMO Unity Third Person Shooter Template", "description": "Unity Third Person Shooter Template:\r\nDemos of Third Person Shooter Template for UNITY 3D made by Julhiecio Gamedev. You can download the demos below or play in the browser.\r\nThis is a third-person shooter template, which has several pre-made systems, such as Weapon Switch, Mobile Inputs,Vehicle Physics, Functional Weapons with Precision and Procedural Animation, Ragdoll Controller, MeshCollider Correction for Vehicles and much more.\r\n\r\n►The Template has:\r\n►Basic locomotion of third person shooter character:<br/>walk, run, jump, crouch, roll, walk in 8 directions aiming with the gun.<br/>\n<br/><br/>►Camera Controller: a complete camera system for third person games, with camera collision, smooth movement, without flickering, rotation limit, and fps limit.<br/>\n<br/><br/>►Weapon System:<br/>Playing the script on a weapon model is just to configure the ammunition, shots per second, accuracy, and link the empty objects that serve as references (IK and shot). And a new weapon is ready, just put it in the player's hand and link to the player's script and it's ready to use.<br/><br/><br/>►Bullet Physics: bullet physics has 3 movement modes, one for physics, one for teleportation, and one calculated (recommended).<br/><br/><br/>►Vehicle Physics: vehicle physics has two types, car and motorcycle, easy adjustment in the inspector and with support for mesh collider correction.<br/>\n<br/><br/>►Ragdoll Physics: it is a system that manages the bones of Ragdoll, having a ragdoll done is just pressing the button to search for ragdoll bones and then the button to disable the physics of the bones. You can make calls from the disable and enable functions to use the way you prefer.<br/><br/><br/><br/><br/><br/>►Destructible Objects: It is a simple system that instantiates a fractured object when it collides with a bullet or an object at a high speed (you can adjust this by dragging a slider on the inspector).<br/><br/><br/>►Scene Scripts: the Asset Pack also has simple scripts that control the scenes, you can add a portal just by dropping the script on a trigger and writing the name of the scene.<br/>\n<br/><br/>►Mobile Inputs: The Asset Pack has Virtual Joystick, Touchfield, and Buttons, all easy to use scripts, just play in a UI component and you can access the data that these scripts provide as the touch distance to move a camera, and the coordinates joystick to move the player. The Asset Pack comes with prefab pre-configured canvas UI, ready to reskin.<br/><br/><br/>►Utilities: the Asset Pack has useful scripts such as Auto Destroy, Shooting target movement (going from one side to the other), Resolution optimizer for mobile devices (but it can also be used as a resolution scale in a settings menu if you want) and etc.<br/>\n<br/><br/>►Animations: all animations are of the Humanoid type, so only characters with humanoid skeleton recognized by the Mecanim of Unity 3D can work.\r\n<em>(obs: some scripts are very long and have many variables so some of the images above are cut)</em>\r\n►Buy the template on:\r\nCodester", "metacritic": null, "released": "2020-09-20", "tba": false, "updated": "2020-09-21T03:21:15", "background_image": "https://media.rawg.io/media/screenshots/6c0/6c00703da8d2072b9dfe01e802288fc1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 130, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Android", "Web"], "developers": ["Julhiecio"], "genres": ["Action", "Shooter", "Racing"], "publishers": [], "esrb_rating": null}