{"id": 49596, "slug": "ergastulum", "name": "Ergastulum", "name_original": "Ergastulum", "description": "<strong>Ergastulum</strong> is a first-person fantasy horror adventure game that blends a mix of <strong>Asian and Western folklore</strong> to create a terrifying vision that will test a players faith to the extremes. The game focuses on psychological horror which relies on the character’s fears and abnormal psyche to frighten players.<br/><br/>An Ergastulum is a underground building used to hold dangerous slaves, or other creatures. This is the Dark World. The player must traverse between the Dark World and Light World to find the answers they seek and experience of journey of rediscovering your lost faith.Features<ul><li>Combat-less stealth gameplay with only a Crucifix and Light to protect you<br/></li><li>Real-time light and shadow gameplay to hide and manage your sanity<br/></li><li>In-game sanity levels affect your surroundings and how enemies react to the player<br/></li><li>100% procedural-generated maps in the Dark World so every time you enter it will be the unknown<br/></li><li>Inspired by both Western and Chinese folklore to create new forms of horror<br/></li><li>Traverse between the Light World and the Dark World through hypnosis<br/></li><li>Intuitive puzzles to solve to unlock hidden secrets<br/></li><li>Over 14 creatures each with their own unique traits<br/></li><li>Distract enemies by making sounds from throwing or using objects in the world</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:03:52", "background_image": "https://media.rawg.io/media/screenshots/259/259207cb5a858a6cb3fa0d6b00f1fbec.jpg", "website": "http://www.kmonkeygames.com/games/ergastulum", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 10, "beaten": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 520, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["K Monkey"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["K Monkey"], "esrb_rating": "Mature"}