{"id": 496044, "slug": "shadow-animus-byte-off-2020-demo", "name": "Shadow Animus [ Byte-Off 2020 Demo]", "name_original": "Shadow Animus [ Byte-Off 2020 Demo]", "description": "Beware the darkness in your own heart.\r\n\n<p>Rumors have been spreading, rumors of people disappearing without a trace.</p>\n<p>Now a strange village has appeared where there was none before. A village out of place and out of time. Time ceases, dark creatures prowl the streets and the surrounding wilderness.</p>\n<p>None who venture into the village are seen again.<br/> Avarice, for her own reasons enters the village with a willing heart and open mind.</p>\n<p>With hopes of returning that which has been lost, her husband, she seeks to unravel the mysteries of this unsettling village. Armed with little more than her wits and minor paranormal insight she will tackle the task before her. She must search, find clues, and discover what has become of this place and those who dwell within it. For here in this place of perpetual night danger lurks around every corner, and the deepest darkness may be that within ourselves. Explore the village, solve its riddles, rescue the lost, battle the shadow hearts and discover the truth hidden in the darkness.</p>\n\r\nByte-Off 2020 Entry\r\n<p>!! WORK IN PROGRESS !!!</p>\n<p>This game is an entry for the Nesmaker Byte-Off 2020 homebrew game jam. As such, please realize that the game is only a demo, made during a month-long sprint. You will likely experience some bugs and/or imperfections. If you are looking for a complete NES homebrew game, I suggest checking out my previous game Nix: The Paradox Relic or these other great NES homebrew games.</p>\n\n\r\nFeatures\r\n<ul><li>From the developer of Nix: The Paradox Relic. Experience a new story from the perspective of Avarice, an adventure seeking Volpe with supernatural powers. Learn more about the helpful adventurers who aided Nix on her mission.</li><li>Explore a village full of dangerous animals that have been consumed by darkness... as well as the terrifying Shadow Animus.</li><li>Explore, find clues, hide from danger, and cast powerful Volpe magic to stop your foes in their tracks!</li><li>Uncover the mystery of your husband's disappearance, the village, and the mysterious land of loss. </li></ul>\r\nRequirements\r\n\n<p>This game is provided as a ROM file in the .nes format. It will not run as an independent EXE. To play the game, you will need a mapper 30 compatible NES emulator. I personally recommend MESEN, FCEUX, or Retroarch as they emulate the game most accurately.</p>\n\r\nAvailable Files\r\n<p> <strong>Free:</strong></p>\n<ul><li>Shadow Animus Byte-Off 2020 Demo Rom</li><li>Concept art</li><li>Soundtrack</li><li>PDF manual</li></ul>\n\n\r\nCredits\r\n<ul><li>Dustin Huddleston - Game Design, Programming, Pixel art, Soundtrack.</li><li>Jamie Huddleston - Story, Character Design, Concept Art, and Debugging.</li><li>Joe Granato - NESMaker Game engine</li><li>NESMaker Community:\r\nSpecial thanks to all my friends in the Nesmaker community for their guidance and support during the games development.</li></ul>", "metacritic": null, "released": "2020-09-20", "tba": false, "updated": "2020-09-21T03:42:43", "background_image": "https://media.rawg.io/media/screenshots/3a4/3a48a2185d60f3019261b87aa285b8b6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 175, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Android"], "developers": ["Chronicler of Legends"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}