{"id": 496114, "slug": "30-03au", "name": "30-03AU", "name_original": "30-03AU", "description": "<p><strong>by Luís Eduardo Rozante de Freitas Pereira</strong></p>\n<p><strong>(Português Brasileiro)</strong></p>\n<p><strong>30.03AU</strong> é um space-shooter simples que eu fiz em 2018 para o processo seletivo do grupo <strong>Fellowship of the Game</strong>, um grupo de extensão da minha universidade (Universidade de São Paulo - Campus de São Carlos) focado em aprender desenvolvimento de jogos,<br/></p>\n<p>Eu encontrei o projeto quando estava mexendo nos meus arquivos e decidi lança-l para o público, todos os assets e código do jogo foram feitos por mim usando Unity Engine, Visual Studio Community, Audacity, Krita  e GIMP.</p>\n<p>O projeto pode ser encontrado em  GitHub.</p>\n<p>Podem haver algumas coisas mais incompletas ou não funcionando tão bem no projeto, já que era para ser apenas um protótipo (e algumas seções vazias onde era para ter alguns dialogos que eu nunca terminei =D).</p>\n<p>OBS: o título é uma referência à distância entre o Sol e Netuno.<br/></p>\n<p><strong>(English)</strong></p>\n<p><strong>30.03AU</strong> is a simple space-shooter game I made back in 2018 as part of a recruitment process to join <strong>Fellowship of the Game</strong>, a study group of my university (Universidade de São Paulo - Campus de São Carlos) focused on learning game development.</p>\n<p>I found the project looking through some old files and decided to release it to the public, all game assets and code where created by myself using the Unity Engine, Visual Studio Community, Audacity, Krita and GIMP.</p>\n<p>The game download files are unfortunately available only in brazilian portuguese.</p>\n<p>The source code can by found on GitHub.</p>\n<p>There may be some hard edges in the project as it was supposed to be just a prototype (and some empty spaces where dialogue telling the story would have been if I had finished it =D).</p>\n<p>OBS: the title is a reference to the distance between the sun and the planet Neptune.<br/></p>", "metacritic": null, "released": "2020-09-20", "tba": false, "updated": "2020-09-21T04:00:34", "background_image": "https://media.rawg.io/media/screenshots/aa4/aa45b8c3e56820c5e206ab6aab986f2d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 105, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Luís Eduardo Rozante de Freitas Pereira"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}