{"id": 49627, "slug": "exorder", "name": "Exorder", "name_original": "Exorder", "description": "<strong>The fantasy world of Exorder awaits you!</strong><br/><br/>Immerse yourself in a singleplayer campaign to discover the story of a conflict between three neighbouring countries or put your strategic thinking to a test in multiplayer skirmish.<br/><br/><br/><br/><strong>Singleplayer</strong> Campaign Mode offers twelve engaging missions presenting the story from the perspective of one side of the conflict. This mode gets you acquainted with the skills needed to successfully command a roster of Exorder's quirky characters in the multiplayer mode.<br/><br/><br/><br/><strong>Multiplayer</strong> Mode offers you a choice between Ranked Mode and Casual Skirmish. The former lets you duel against a randomly selected player of a similar skill level. Defeat your enemy to climb up the leaderboards! Casual Skirmish allows you to create a custom multiplayer game of up to four players, either locally or online.<br/><br/><br/><br/>The purpose of Exorder is to provide a solid entry in the underrepresented genre of turn-based tactics games that focus on fun and easy to pick up combat. The game is being developed with a team of three (the entirety of Solid9 Studio) and we do our our best to provide you - the player - with the best gaming experience possible.Features:<br/><ul><li>Turn-based tactics game.<br/></li><li>Addictive Campaign with 12 missions.<br/></li><li>Indie game with good-looking graphics.<br/></li><li>Story with a unique setting and twist.<br/></li><li>Crossplatform multiplayer with leaderboards.</li></ul>", "metacritic": null, "released": "2018-09-27", "tba": false, "updated": "2019-08-28T22:03:51", "background_image": "https://media.rawg.io/media/screenshots/f37/f37572dca583e3be9afed77cad7a6369.jpg", "website": "http://www.fatdoggames.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 5, "owned": 37, "toplay": 2}, "playtime": 1, "achievements_count": 45, "ratings_count": 0, "suggestions_count": 268, "game_series_count": 0, "reviews_count": 0, "platforms": ["Nintendo Switch", "PC"], "developers": ["Solid9 Studio"], "genres": ["Strategy", "Indie"], "publishers": ["Fat Dog Games"], "esrb_rating": null}