{"id": 496226, "slug": "settler-cca", "name": "Settler (CCA)", "name_original": "Settler (CCA)", "description": "<p>Settler is intended to shed light on the struggles of a homeless person, mainly in South Africa, as this country has a fairly unique way of surviving and getting by when you are out on the street. There aren't many games that attempt to tackle this issue, thus the game experience is based solely on research acquired from the internet, real-life interviews with people enduring this struggle, as well as personal knowledge of the township life and the struggles of many in it, specifically Ivory Park, Tembisa. \r\n</p>\n<p>The game throws the player into a world with nothing in their pocket and their cart to do recycling and pawning. The player will go around the township, scavenging for possible items to be recycled and pawned whilst worrying about food, water, and fatigue levels. The aim of the game is to help others around the township, build a house and a stable income, whilst figuring out a workable schedule for days to accomplish tasks.</p>\n<p>\n</p>\n<p>The game offers confrontations like muggers and pickpockets as this is a common practice in the township. The player must avoid areas where strikes and protests are happening as this can create heavy violence. But not all is bad in the township. The player will also encounter good and helpful people. \r\n</p>\n<p>The ultimate goal of the game is to survive, help others and become a true Settler.</p>\n<p><strong>Our Team:</strong></p>\n<ul><li>Jonathan Bala</li><li>Deniell De Vries</li><li>Ian Roberts</li><li>Melissa Grobler</li></ul>", "metacritic": null, "released": "2020-09-19", "tba": false, "updated": "2020-09-21T04:21:20", "background_image": "https://media.rawg.io/media/screenshots/48e/48e6e631ce2b65bda3c6abbfde910901.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 232, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["NeXzXBlitZ", "Project Springbok at CCA"], "genres": ["Adventure", "RPG", "Simulation"], "publishers": [], "esrb_rating": null}