{"id": 496228, "slug": "byo-hero", "name": "BYO-Hero", "name_original": "BYO-Hero", "description": "<p>The full length Point-and-click Adventure game for parents &amp; kids &gt; where <strong>YOU get to be the HERO</strong>!</p>\n<p>YOU (your drawing/picture HERO) has been unceremoniously thrown out of the Royal castle. You find yourself left alone in a forest with nothing in your possession and you soon realise that you have been booted out since you were next in line to the throne!</p>\n<p>You must use your wits and skills and, the help of your sister Abbey, to try and get back into the castle and back into your role. This is the first part of what may be a 3 x part series depending on uptake and requires you to complete many tasks and some puzzles. </p>\n<p>The game is designed to re-engage kids into the genre and can be played WITH your kids. The game uses animated cartoon drawings as the playable character and includes hundreds of voice dialogs to engage with!</p>\n<p>This full-length, free game was written on the Adventure Game Studio platform (AGS 3.5.0). <br/><br/>Adult Players should turn Hints: <strong>OFF </strong>(makes the game a little harder)<br/>For MS-Windows based computers only<br/>Game Version 20.20.09.21.HS</p>\n<p><strong>Key Game Features</strong></p>\n<ul><li>Designed to play WITH kids, so you are both challenged</li><li>Game HINTS help you on your journey (Turn hints OFF for harder Parent-mode)</li><li>Save and Restore games - to keep your progress</li><li>Point scoring throughout the game (find them all!)</li><li>Kid friendly! (no violence actions or text that will offend children)</li><li>33 hand-crafted screens, objects, animals and characters</li><li>Game Sounds and Music throughout to suit the scenes</li><li>More than 200 Voice interactions</li><li>Unlimited Inventory of items you can use</li><li>Full mouse click game operation throughout and Dyslexic fonts used for those with disability</li><li>A game MAP you can use to get around the game fast (if you can find it!)</li><li>Variable game Speed, Volumes etc</li></ul>", "metacritic": null, "released": "2020-09-19", "tba": false, "updated": "2020-09-21T04:21:56", "background_image": "https://media.rawg.io/media/screenshots/2bd/2bdcbd6a5ebb0cb04064387c60296636.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 385, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Game 360"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}