{"id": 496313, "slug": "jamanji-afr8d", "name": "JAMANJI (afr8d)", "name_original": "JAMANJI (afr8d)", "description": "<p>Legend has it: “<em>Only the bravest of them all will attempt this foolish act. Only the strongest of them all can put up a bull’s fight. Only the most cunning of them all can outsmart the heart; but not for long, for they will find you, and have your heart.</em>” </p>\n<p>This legend was told all around the country of Eriba. The legend of a treasure chest, hidden in the deepest trenches of a jungle, hidden from the eyes of the sun. This chest was said to hold the darkest heart of them all, nurtured by the shadows and cursed by the silence. All but those who held it would fall, for the heart was said to have the ability to grant anyone one wish. This mythological existence of a treasure was heavily guarded by a mighty genie who was possessed by an evil demon, Helcurt, with his lava pulps. These pulps are certainly not as cute as they may sound. Each the size of a horse, jumping and bouncing at you constantly, teasing you with burns on your skin. Slowly but surely, giving you a slow and agonizing death. Many have sought out for the treasure, but none have returned.</p>\n<p>Of course, it did not take long for another one of those greedy men to rise to the challenge, to seek this treasure despite the risks. Alexander (Protagonist) was a bounty hunter, seeking wealth and eternal fame. He set foot into the depths of the dark forest, vanishing into the darkness like a shadow, thought to be swallowed by the dark tendrils of the forsaken place. He thought he was brave and courageous. He thought he was well prepared for this treacherous journey, with all the experience under his belt. Little did he know that what was about to happen to him was nothing like he had ever experienced before, for he was unaware of his impending doom…<br/></p>", "metacritic": null, "released": "2020-09-19", "tba": false, "updated": "2020-09-21T04:38:45", "background_image": "https://media.rawg.io/media/screenshots/378/378722b77d9d97bd43beb15808fa2b81.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 22, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["afr8d"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}