{"id": 496351, "slug": "hyperion-renegade", "name": "Hyperion Renegade", "name_original": "Hyperion Renegade", "description": "Mission\r\n<p>You are an extraterrestrial pilot who lives in a small outcast community residing on Hyperion, Saturn’s 8th largest moon. Your community is dependent on fuel from the core of Saturn in order to function. The mainland government has cut off your access to their planets fuel so you had been tasked with a mission by the Hyperion local government. You were to extract Fuel Orbs from Saturn without being detected. Your mission failed when an explosion was triggered at the Fuel Orb storage facility. The Fuel Orbs, along with your Ship, were launched into space. You now must Escape the pursuing Enemy Ships while maintaining enough fuel to stay out of the range of the Enemy Mothership’s radar. If you are captured, the Hyperion community will be demolished.</p>\r\nControls\r\n<p>If the Player Ship collides with a Green Orb, the ship will boost forwards.<br/>If the Player Ship collides with a Red Orb, the ship will stall backwards.<br/>If the Player Ship is hit by an Enemy fire, the ship will stall backwards.<br/>If the Player Ship crosses the bottom dotted line, then it is detected by the Enemy Mothership and the game is over.<br/>If the Player Ship crosses the top dotted line, then all active enemies are destroyed and bonus points are awarded for every enemy killed.<br/>If the Player Ship shoots an Enemy Ship, it will destroy that ship.</p>\n<p>[left arrow] = Move Left<br/>[right arrow] = Move Right<br/>[spacebar] = Shoot</p>", "metacritic": null, "released": "2020-09-19", "tba": false, "updated": "2020-09-21T04:46:33", "background_image": "https://media.rawg.io/media/screenshots/b8f/b8fe4e51d583da04ed31993615e104d5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 25, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Josh Montague"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}