{"id": 496671, "slug": "ironseed-25th-anniversary-edition", "name": "Ironseed 25th Anniversary Edition", "name_original": "Ironseed 25th Anniversary Edition", "description": "Originally released in 1994, this is the rewritten-from-scratch 25th Anniversary Edition!  The entire game has been recreated using a modern 3D engine to be as faithful to the original as possible.... <br/><br/><strong>Story:</strong><br/>It is the thirty-eighth century.  The fall of Earth is but a legend and humanity has migrated to a terraformed Mars.  The Pentateuch, a group of five priests, rules the newly risen technocracy with an iron fist.  In a bold attempt to eliminate the last of their political opponents, the five began the purgation trials.  With guerrilla tactics their followers went about convicting those who would oppose them.<br/><br/>To counter them an underground movement was initiated and an elaborate plan was conceived.  A virus was spread throughout the circuit matrix.  A thousand days from inception, the virus was scheduled to delete all personality files.  The Ironseed Movement, as it was called, hoped that by stealing a ship they could escape... leaving behind Mars... and the Pentateuch.  Their intent was to return after the fall of the technocracy. ...but a computer malfunction turned a thousand days into a thousand years...<br/><br/>As the captain, you are awakened along with the crew by an alien horde.   After a brief dialogue, communication is cut off and they attack. The game begins as the attack ends.<br/><br/><strong>Gameplay:</strong><br/>The player begins with a single ship and a chosen crew. Planets are randomly generated and numerous ship designs and crew selection allow for different playing styles. Technology research, space exploration, resource management and gathering, production, crew management and alien diplomacy are essential elements. New ships, new upgrades, and ancient artifacts help the player in their efforts. Combat can be both in the form of random encounters or planned for by the player.<br/><br/>Ironseed has been compared to Star Control, Starflight, Masters of Orion, Space Rangers, and Captain Blood.<br/><br/>Rock, Paper, Shotgun's Adam Smith describes Ironseed as \"weird, trippy sci-fi that blew my tiny mind\" and \"a little bit Space Rangers, a little bit Star Control and just a teensy bit FTL.\"", "metacritic": null, "released": "2020-09-21", "tba": false, "updated": "2020-09-25T02:15:50", "background_image": "https://media.rawg.io/media/screenshots/1b7/1b7b8a21b4d8131c947e4e11c8deaf6b.jpg", "website": "http://ironseed.net/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 18, "ratings_count": 0, "suggestions_count": 351, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Robert Morgan", "Jeremy Stanton"], "genres": ["RPG"], "publishers": ["Channel 7 Software"], "esrb_rating": null}