{"id": 496795, "slug": "genesis-human-destiny", "name": "Genesis: Human Destiny", "name_original": "Genesis: Human Destiny", "description": "Genesis: Human Destiny is a space saga about the eternal search, phantom hope, and new menace. Faced with an invincible enemy, humanity sends more and more spacecrafts to foreign galaxies outside the Solar System, trying to stop the approach of inevitable Armageddon.<br/>Genesis offers you a combination of genres that will magnetize you as a black hole: text quest, spaceship simulator, survival, adventure, and rogue-like RPG.<br/>Solve a hundred urgent problems and riddles: how to catch the One who got out of the Xenobiologist's body? What does the phrase in 327 human languages received from space ​​mean? How to identify a cyborg among the human beings? Why do engines go dead after meeting with the Flying Dutchman? Can space vampires really cause blind sight? Who is to blame and what is to be done?<br/>Buy, equip and upgrade your spaceships to create an invincible space fleet!<br/>Become the guardian of the galaxy! Heroic astronauts are waiting for your orders!<br/>Send your cruisers and storm-troopers beyond the horizon and to a trip to the Moon, Mars and thousands of other planets in still nameless nebulae and star systems!<br/>Overcome the gravity laws and show how the Earth empire strikes back! Neither vacuum, nor dark energy or antimatter, nor comets infected by intelligent cyber viruses will interrupt your odyssey!<br/>Complete your own star trek to the end and decide whether the human civilization will live or die!", "metacritic": null, "released": "2020-01-29", "tba": false, "updated": "2020-09-25T03:26:38", "background_image": "https://media.rawg.io/media/screenshots/305/3059799ce4d96c890121bb73bcb63f09_IA3LZ8x.jpg", "website": "https://khangames.online/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 181, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["4Flash"], "genres": ["Adventure", "Simulation"], "publishers": ["YONKO ELECTRIC CONSTRUCTION"], "esrb_rating": "Everyone 10+"}