{"id": 496790, "slug": "tap-nations", "name": "Tap Nations", "name_original": "Tap Nations", "description": "Tap Nations is a very simple yet deep, casual real-time strategy.<br/><br/>Easy: Tap rapidly on other countries to attack, or on your countries to defend.<br/><br/>...and it includes NUKES &amp; MISSILES now!<br/><br/>Go idle after you use your offensive and defensive power-ups, and let them do the work for you. Just sit back, and watch as you dominate. Or combine everything all together and storm the tap-world!<br/><br/>Upgrade them as the cash piles up, and as your domination expands!<br/><br/>- 200 playable countries. You can't conquer them all. Can you?<br/><br/>- 16 new custom flags to add a bit more style to your conquest!<br/><br/>- 10 new Super Powers including NUKE!, Super Shields, and Ballistic Missiles.<br/><br/>- You earn money with taps, shields, and owned territories over time.<br/><br/>Our future plans (according to your feedback) include:<br/>- Adding short competitive matches versus others.<br/>- Adding historical game modes such as WW2, American Civil War...<br/>- Adding diplomacy; alliances and trade.<br/>- More differences in gameplay between the nations.<br/>- Adding a \"play with your friends\" mode.<br/><br/>Let's make Tap Nations a global hit together. Thanks a lot for your great reviews, feedback, and support.<br/><br/>iCloud must be logged in, in order to save your purchase data even when you delete &amp; reinstall the game.", "metacritic": null, "released": "2018-08-29", "tba": false, "updated": "2020-09-25T03:24:46", "background_image": "https://media.rawg.io/media/screenshots/4e9/4e9d9d51995cf9b5335c0e2ecea2cd4c.jpg", "website": "https://www.peoplepersongames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 48, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tughan Yalgin"], "genres": ["Strategy", "Casual"], "publishers": ["Tughan Yalgin"], "esrb_rating": "Everyone 10+"}