{"id": 496784, "slug": "onet-connect-match-puzzle", "name": "Onet - Connect & Match Puzzle", "name_original": "Onet - Connect & Match Puzzle", "description": "Join a super fun puzzle adventure today and enjoy matching and connecting beautiful images!<br/><br/>Play NOW and train your brain as you solve puzzles and test your matching skills. <br/>Onet: Connect &amp; Match Puzzle is a fun memory game where you have to link the images and clear the board. Enjoy linking beautiful images of cute animals, delicious food, amazing places, and so much more! <br/><br/>Develop your skills by playing everywhere, and as much as you want offline!<br/><br/>Discover these Awesome Features:<br/>• Lots of Brain Teasers: Test your memory, exercise your brain<br/>• Fun Link Game: Easy to pick up and play<br/>• Addictive Gameplay: Enjoy hours of pair matching fun!<br/>• Great Time Killer: Relaxing line connect game<br/>• Beautiful Graphics: Plenty of amazing themes<br/>• Awesome Boosters: HINT and SHUFFLE <br/>Onet: Connect &amp; Match Puzzle is the best game to play when you have some free time or looking for a fun activity to share with friends and family.  <br/>Your goal is to remove all the images from the board by connecting pairs of identical images. Play now and improve your memory as you swipe and connect colorful images and make big explosions!<br/><br/>HOW TO PLAY?<br/>* Match and connect pairs of the same kind images<br/>* Link two identical images and tap to draw a line between them <br/>* Match farther images to gain more stars<br/>* Longer lines=more points!<br/>* Use the HINT to reveal a possible connection<br/>* Use the SHUFFLE to rearrange all the images randomly <br/>* Solve all the challenges and train your brain<br/><br/>Onet memory game is a perfect game to play while waiting for an appointment, during a boring meeting, or waiting in a long line. This blasting game keeps getting better as you advance and encounter more challenging elements!<br/><br/>Onet: Connect &amp; Match Puzzle is free to download and play, but contains in-app purchases. You can turn off the payment feature by disabling in-app purchases in your device’s settings.<br/><br/>Subscriptions automatically renew unless turned off at least 24 hrs before the current period ends. Manage subscriptions via iTunes account settings.", "metacritic": null, "released": "2020-09-15", "tba": false, "updated": "2020-09-25T03:22:44", "background_image": "https://media.rawg.io/media/screenshots/a82/a8208ded9bd97d0cb8a3395bd5766b36.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 66, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Boombox Games"], "genres": ["Board Games", "Puzzle"], "publishers": ["Boombox Games"], "esrb_rating": "Everyone 10+"}