{"id": 496718, "slug": "tales-of-evenfall", "name": "Tales Of Evenfall", "name_original": "Tales Of Evenfall", "description": "Zeke and Miles are just two regular best friends until a crazy piece of technology sucks them into an adventure RPG game trapping them in the vast overworld of Edina. Trapped in a land facing certain destruction from the malevolent magical storm known as \"The Evenfall\".  These unlikely heroes must find their way out of the game and save Edina. Together with their friends they will travel through high mountains,  cross over raging seas, and even dive into the depths of the underworld, all in an attempt to stop the Evenfall, and return home.<br/><br/>Take a team of fellow adventurers with you to face the evil forces of the Evenlords - those who wish to destroy the digital world of Edina. The journey will be difficult, and the foes you will face may seem countless, but with determination and the skills of your party, you’ll succeed. Collect ancient relics of heroes long past in order to battle against terrible bosses that stand in your way of returning home. Are you ready to be a hero?<br/><br/><br/><h3>Explore a vast open world.</h3><ul><li>Travel to the bustling, snowy town of Orwell.</li></ul><ul><li>Roam the green fields of Verdyn.</li></ul><ul><li>Navigate the tight streets of Coventry.</li></ul><ul><li>The landscape of Edina is yours to explore and discover.</li></ul><br/><h3>Uncover the mysteries of Edina</h3>Things in Edina aren't always what they seem. Secrets are everywhere. Help strangers with quests to uncover world-building pieces of lore, can you and your band uncover the all the secrets hidden around you? What will it take to rescue Edina from The Evenfall?<br/><br/><br/><h3>Dynamic Class System</h3><br/>As you gather your team of adventurers, choose from a variety of classes and play-styles. Are you a spell-casting mage, a defender who protects your friends, or are you the hero of the party? Outfit your party members with the right gear and skills to assist you and your game play-style as you face the foes and challenges of your journey.<h3>The fate of Edina is in your hands</h3><br/>Will you be victorious? Can you stop the destructive Evenfall before it’s too late? Or will you perish in a distant, strange, foreign world? Try your skills and find out if you have what it takes to be a hero in, Tales of Evenfall.", "metacritic": null, "released": "2020-09-22", "tba": false, "updated": "2020-09-25T02:40:01", "background_image": "https://media.rawg.io/media/screenshots/c9d/c9d3f29fadb7265d99b6bf8b19f0197b.jpg", "website": "https://www.northwardgames.org/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 166, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Northward Games"], "genres": ["RPG"], "publishers": ["Northward Games"], "esrb_rating": null}