{"id": 496709, "slug": "mondrian-plastic-reality-2", "name": "Mondrian - Plastic Reality", "name_original": "Mondrian - Plastic Reality", "description": "Mondrian's back, and he's taking his friends for a spin through the Plastic Reality. In this sequel to the award-winning Mondrian - Abstraction in Beauty, you play as five great 20th Century artists - Sophie Taeuber-Arp, Hale Woodruff, Andy Warhol, Loïs Mailou Jones, and, of course, Piet Mondrian - as you uncover the lost masterpieces of the Modernist movement. Mondrian's orbital brickbreaking gameplay returns with all new additions, and the simple but powerful Mondrian Maker level editor, allowing you to Play, Create, Paint, and Share your own levels with the world. The canvas is waiting, are you ready to explore its mysteries?<br/><br/><br/><br/><ul><li>Explore Art and Art History in Adventure Mode, Mondrian's first ever narrative-based game mode, as you venture through time to uncover the Lost Modernist Masterpieces. New episodes are released in a Series format, letting you even play the story out of order if you want. Dedicated Museum Pack DLC's are released with each new episode, giving you deeper customization for your Museums. Season 1 begins right now!<br/></li><li>Orbital brickbreaking gameplay that combines classic arcade style with modern twists<br/></li><li>Build your own levels in Mondrian Maker and share them worldwide on Steam Workshop!<br/></li><li>Five playable characters and six game modes, including Quick Play, Creation, and Adventure modes, with online and local leaderboards<br/></li><li>Customize your own Art Museum hub world with dozens of construction, furniture, and artpiece options<br/></li><li>Mod support! Create your own levels, background art, and more. See the Steam Community for more details.</li></ul><br/><br/><br/>Always wanted to try your hand at level design but could never get started? Mondrian Maker is designed from the ground up to be as user-friendly as possible! Its simple drag-and-drop interface will have you building levels in seconds, the Painting tools will help you really make them your own, and the included Mini Manual and Tooltips are there to help you in case you get lost. Share your creations on Steam Workshop in just a few clicks, right from inside the game. With Mondrian Maker, we truly believe anyone can create, and we can't wait to see what you come up with!<h3>Mondrian Maker Features:</h3><br/><ul><li>Use multiple block shapes at any scale and rotation, and even paint them to build the level of your dreams<br/></li><li>Increment the Difficulty to flip any block to different block types, including Grays, Portals, and Splitters<br/></li><li>Apply different modifiers to any block per Difficulty, including Movement Shifting and Visibility Phasing<br/></li><li>Access dedicated Testing and Gallery modes. Testing mode lets you try out a vanilla version of your level, while Gallery mode's integrated graphic design options set your level up for screenshots, Workshop thumbnails, or even sending to print.<br/></li><li>Test your level in-game and share it via Steam Workshop in just two mouse clicks!<br/></li><li>All owners receive Mondrian Maker free of charge, included in the game. We encourage you to build and submit levels on Steam Workshop!</li></ul><br/><br/><br/><ul><li><h3>How is Plastic Reality different from Abstraction in Beauty?</h3></li></ul>Plastic Reality takes the original game's gameplay to a brand new level. We have introduced five playable characters, brand new obstacle types, Block Modifiers which can be added to and layered on any block, mod compatibility, an easy-to-use level editor, revamped animations, new sound effects, and a whole lot more. Basically, if you liked the first game, you're going to love this one.<br/><ul><li><h3>What languages does the game support?</h3></li></ul>At the moment, the only language supported is English, but we plan to localize into others, and have already developed the backend to support localization soon!<br/><ul><li><h3>What OS's does the game support?</h3></li></ul>Windows-only at the moment. We do plan to bring this one to more platforms in time. Stay tuned!<br/><ul><li><h3>What accessibility options are available?</h3></li></ul>You can control the game speed, screenshake, and controller rumble levels in the Options menu. There are 4 difficulty selections when you start a new game. You can also control the game via keyboard, mouse, controller, or touchscreen simultaneously.<br/><ul><li><h3>How do I use Gallery Mode?</h3></li></ul>Gallery Mode can currently be controlled via Keyboard shortcuts. Check out the Gallery Mode Instructions guide we've put on the Steam Community for more information. Updates to this are coming very soon!<br/><ul><li><h3>What do I do if a find a bug?</h3></li></ul>Please visit the Bug Reports forum on the Steam Community. We promise we do everything we can to fix any issues found in as speedy a time as possible. We would appreciate it if you not use a Steam Review to report bugs, as we consistently check the Bug Reports forum for any new issues that have appeared. Thank you for understanding and cooperation.<br/><ul><li><h3>What do you mean by \"Partial Controller Support?\"</h3></li></ul>You can currently use a controller (and even a Steam Controller) to start the game, play quick play modes, access the menu, change options, walk around in the museum, etc. You cannot currently use a controller in Mondrian Maker or Gallery Mode. These are areas we're addressing post-launch and are fully committed to bringing the game back up to Full Controller Support ASAP.<br/><ul><li><h3>What is that cool song in the launch trailer?</h3></li></ul>\"Spin Cycle\" by Speechwriters LLC, Licensed under CC BY 3.0. (speechwritersllc.com/about/) (creativecommons.org/licenses/by-nc/3.0/)", "metacritic": null, "released": "2020-09-22", "tba": false, "updated": "2020-09-25T02:35:00", "background_image": "https://media.rawg.io/media/screenshots/4b1/4b1d2a14c0f6a11d9a5520fb78db28b8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 189, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Lantana Games"], "genres": ["Casual", "Indie"], "publishers": ["Lantana Games"], "esrb_rating": null}