{"id": 496797, "slug": "mystic-pillars-a-puzzle-game", "name": "Mystic Pillars: A Puzzle Game", "name_original": "Mystic Pillars: A Puzzle Game", "description": "Mystic Pillars is an original blend of intriguing puzzles and an immersive storyline set in Ancient India, providing you with a unique gameplay experience.<br/><br/>Play as a mysterious traveller whose journey across the world lands you in the kingdom of Zampi. Resolve the drought plaguing the once-prosperous kingdom of Zampi by solving puzzles and destroying the magical pillars blocking the water.<br/><br/><br/>[REVIEWS]<br/><br/>“An interesting twist on your typical puzzle game which leads to a fun experience.”<br/>3.5/5 – Geeky Hobbies<br/><br/>“They say video games can’t teach you anything. They say it’s not an art form and it can’t offer you a single drop of culture. Whoever said that really needs to give Mystic Pillars a shot. Not only did I feel smart tackling its math-based puzzles like a smug scholar, but also made me want to dive into Indian culture.”<br/>7/10 – waytoomanygames<br/><br/>“Mystic Pillars is a great puzzle game that not only looks pretty but the art design and lore of the game is pretty unique. The gameplay is solid as well because the puzzles will keep you busy for a good time.”<br/>Preview – Games Hedge<br/><br/><br/>[AWARDS]<br/>- Official Selection: BitSummit Gaiden Showcase 2020<br/>- Official Selection: Indie Megabooth GDC Showcase 2020<br/>- Official Showcase as part of Unite India 2018 event<br/><br/><br/>[FEATURES]<br/><br/>- A game based in the southern part of Ancient India<br/>- 100 simple and unique logical puzzles<br/>- Interesting story that reveals itself as you play<br/>- Hand drawn colourful 2D artwork<br/>- Animated cutscenes<br/>- Supported in 20+ languages - English, French, Italian, German, Spanish, Russian, Chinese (Simplified &amp; Traditional), Japanese, Korean, Portuguese EU, Polish, Turkish, Portuguese BR, Hindi, Kannada, Telugu, Tamil, Arabic, Catalan, Hebrew<br/>- Voice over in English and Kannada (the local language in Bangalore, India)<br/><br/><br/>Over the course of your journey, you meet other characters and slowly uncover what exactly happened that led to the downfall of Zampi. The animated cutscenes in the game add to the storyline and keep you wanting for more. Puzzles become more interesting and challenging to solve with different configurations as you proceed further in the game.<br/><br/><br/>[ABOUT US]<br/><br/>Holy Cow Productions is a small team of passionate game developers based out of Bangalore, India. We are focused on creating quality games for PCs, consoles and mobile / tablet devices.<br/><br/>Minimum Device Requirement<br/>- iPhone / iPad device with 2GB RAM<br/>- Mystic Pillars does NOT support iPhone 6 or older, iPad air (2013) or older and iPad mini 3 or older<br/><br/>Our social media links:<br/>Mystic Pillars: https://holycowprod.com/portfolio/mystic-pillars/<br/>Website: https://www.holycowprod.com<br/>Facebook: https://www.facebook.com/holycowgames/<br/>Twitter: https://twitter.com/HolyCowGames<br/>Instagram: https://instagram.com/holycowgames/", "metacritic": null, "released": "2019-11-06", "tba": false, "updated": "2020-09-25T03:27:23", "background_image": "https://media.rawg.io/media/screenshots/313/31343a2d9b84f2ecf7c3313906f39004.jpg", "website": "https://holycowprod.com/portfolio/mystic-pillars/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 97, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Holy Cow Productions India"], "genres": ["Casual", "Puzzle"], "publishers": ["Holy Cow Productions India Private"], "esrb_rating": "Everyone 10+"}