{"id": 496850, "slug": "forlorn-bobafettus", "name": "Forlorn (Bobafettus)", "name_original": "Forlorn (Bobafettus)", "description": "<p>Hey everyone we are 2 friends developing this game! Its our early demo, more of a proof of concept thingy.<br/></p>\n<p>In this early demo we promise you new and hopefully fun mechanics! Using your mouse to swing your weapons however you like, or using your spells like a brush continuing this game we will be implementing more \"interactive\" spells and ways to play the game. By the end we would like to have a variety of different skills and weapons which you can combine to your play style!</p><p>Also we have plenty more planned;</p><p><em>Items, weapons, skills, pets more elaborate ai </em><em>and bosses, procedural maps,</em></p><p><em> typical dungeon crawler stuff + our new ideas!</em></p>\n<p>We also have a story planned which we think is different and refreshing, can't give details now but we have some \"wow\" moments planned for you! Also we tought of a sneaky way implement the story element to the \"procedural random dungeon\" theme. So it wouldn't change the arcadeyness or rogue-likeness of the game!(hopefully)<br/><br/>We are two friends who are developing so we want to go kickstarter or steam pretty soon, thats why we added a donate button. If you think that this project needs to be developed your contribution in that way, or even your comments and sharing of our game is incomprehensibly awesome! Thanks!<br/><br/>We would like to continue working on this game because we love it so much, so would love to hear your ideas and toughts!! Also if you are interested in developing with us you can contact me!<br/><br/>Also you can follow my instagram @kaantheanimator (Artist)</p>", "metacritic": null, "released": "2020-09-24", "tba": false, "updated": "2020-09-25T03:40:07", "background_image": "https://media.rawg.io/media/screenshots/1a0/1a02c9c0380f25e256f8e40244c66a20.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 147, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Bobafettus"], "genres": ["Action", "RPG"], "publishers": [], "esrb_rating": null}