{"id": 49694, "slug": "ascendant-hearts", "name": "Ascendant Hearts", "name_original": "Ascendant Hearts", "description": "Hayato lived an ordinary life until he wakes up one day with amnesia… and finds himself in a world closer to the video games he plays than the world he remembers.     <br/><br/>Fetch quests? Skill points? Respawning after death? It’s all a bit much to accept. A mage named Shiori offers to help him find his way, and with her help, he learns how to fight monsters, perform fetch quests, and put items in a strange metaphysical space called an “inventory.” <br/><br/>Soon he’s ready to take on NPC quests! But the town of Lightshire is in danger from deadly monsters—monsters that can kill you for real. Where did they come from? What is behind the attacks? Hayato and Shiori are determined to find out, and no matter what they encounter—from high-level dungeons to argumentative party members—they won’t stop until they learn the truth.<br/><br/><strong>Features</strong><br/><ul><li>Parody of traditional JRPG and MMORPG tropes. <br/></li><li>Immersive fantasy world filled with monsters and memorable characters.<br/></li><li>Numerous distinct environments, including a haunted library, a mad scientist’s laboratory, and an eldritch temple.<br/></li><li>Lighthearted and humorous atmosphere.<br/></li><li>Three possible romance routes.<br/></li><li>Three main endings based on your choices.</li></ul>", "metacritic": null, "released": "2020-01-30", "tba": false, "updated": "2020-12-16T14:19:38", "background_image": "https://media.rawg.io/media/screenshots/440/440186e1fa2a66cf27091617495b841e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 10, "beaten": 1, "toplay": 3}, "playtime": 14, "achievements_count": 11, "ratings_count": 1, "suggestions_count": 561, "game_series_count": 0, "reviews_count": 1, "platforms": ["Nintendo Switch", "Linux", "PC", "macOS"], "developers": ["Visualnoveler"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Visualnoveler"], "esrb_rating": "Teen"}