{"id": 497187, "slug": "drifter-fight-night", "name": "Drifter Fight Night", "name_original": "Drifter Fight Night", "description": "ENTER THE  TOURNAMENT\r\nDuke it out in a battle of somewhat epic proportions!\r\n\n\n<p>Take hold of one of 8 unique fighters as you attempt to beat each other out of the stage and into the abyss over the pettiest squabbles. From thunder bolts to swords to shooting with word bubbles, you'll never be short of a weapon to fight with.<br/></p>\r\n- - - FIGHTERS - - -\r\n\n\r\n- - -\r\n\r\n\r\n- - -\r\n\r\n\r\n\n\r\n- - - NERO - - -\r\nA stoic Roman legionnaire pulled out of time and space to lead the Drifters. Nero's had his fair share of trouble from the Drifters and the gods of various realms. Despite all the chaos and turmoil he's faced, he's one of the few members of the team that manages to survive throughout it all. He may have horrid luck. but his skill gets him out alive.\r\n<p>Nero favors his shield and spear in combat, and can fight defensively from a distance. Or he may just pull out a steel baseball bat and end things here and now. A well rounded character, like the soldier he aspires to be.</p>\n\r\n\r\n\r\n- - - SPACEJAM - - -\r\nA curious kitty who loves to throw herself into strange and odd journeys on a whim. She gets in trouble for that curiosity fairly often, but she's quick to get out of it as well. Some days she brings salvation to the continent by purging it of undead horrors, other days she thinks about owning a boat. She's a simple cat.\r\n<p>Spacejam is light on her feet and armed with a knife... as well as incredibly powerful death cleric magics :3. Fast and nimble, but surprisingly packs a punch.</p>\n\r\n\r\n\r\n- - - BOJO - - -\r\nA baffling drow,  all around. Bojo speaks in third person, giving off a likely accurate impression of not being the most intelligent, being but kind in heart. He currently studies ecomomic and the bagpipe. He may chop off a horse’s head, a known threat and hunt to Bojo, and throw it at a friend as a thoughtful gift. Most people find it easier to smile and nod at Bojo’s antics and continue onward as he is mostly harmless.\r\n<p>Bojo has a sword, though he doesn't quite know how to use it. Honestly, it's the music you really need to look out for.</p>\n<p>\n</p>\n\r\n- - - LADY PARHELION- - -\r\n\r\nA young bard with a lovely harp. Lady Parhelion is kind and helpful, always extending a hand to those in need. Her flowery language goes a long way in convincing others that she's a noblewoman, but Lady Parhelion's true love is in a good, bloody, brawl. She'll fight anything that moves, and makes friends with the biggest, baddest customer in the room. Win or lose, she's happy with any sort of training.\r\n<p>Lady Parhelion has a wide array of magic, but she prefers to bash people over the head with her pedal harp. She's quite well-built from carrying that thing around, so expect some serious punches.</p>\n\r\n\r\n- - - SWORDFROG - - -\r\nOnce upon a time, Swordfrog was just another amphibian, living in a lovely swamp. Then, he got cursed by an elder god to turn into a human. He doesn't like it. Swordfrog wants to return to his old life, and he's willing to go to great lengths to regain his original form. He has a tendency to make bad puns, and even worse insults.\r\n<p>Swordfrog wields... a sword, and certainly wields it in his own unique way. His long legs and years of practice as a frog also make him excellent at jumping. </p>\n\r\n\r\n\r\n- - - MEGURIN- - -\r\nOnce a lowly student, Megurin set her sights on becoming the best wind mage around! As such, she uses exclusively wind-related spells (give or take a bit of storm and cold magic here and there). Once she has her mind set on something, you can bet you won't be talking her out of it. She's going to lug that mimic all the way back to the base camp and feed it your life earnings, and you can't stop her.\r\n<p>Megurin can conjure up all sorts of powerful tricks, or wipe the board with AoE magics. With a variety of projectiles, she's always ready for the situation.</p>\n\r\n\r\n\r\n- - -RYYKE- - -\r\nKonikryyke of Veiligheid, or Ryyke for short, comes across as alien in both appearance and mannerisms. She has a deep reverence for both the living and the dead, each of which she interacts with regularly. In spite of their cultural differences she is always eager to make \r\nnew friends with the locals while she travels. Optimistic, eager,and selfless, she always seeks to help as many people \r\nas possible, though her unusual ideas about death often makes her \r\ndefinition of “help” dubious to others.\r\n<p>Rykke may kick or hit you with her trusty shovel if you get too close, but her summoned undead friends increase her reach and strength to a frightening degree.<br/></p>\n\n\r\n- - - ORRO - - -\r\nAs if by fate, Orro caught wind of a voyage across the sea to an \r\nunexplored land. This presented an opportunity not only to complete his \r\nthesis, but to outshine anything his siblings, or even his lineage had \r\never produced. The new world would be his chance to uncover new beasts \r\nand magic and to restore the adventuring-academic legacy of his family.\r\n<p>A student of the arcane arts through and through, Orro has many spells up his sleeves to watch out for. Don't keep your distance though, he excels at mid-range attacks.<br/></p>\n\n\r\n- - -  - - -", "metacritic": null, "released": "2020-09-23", "tba": false, "updated": "2020-09-25T04:56:48", "background_image": "https://media.rawg.io/media/screenshots/5fe/5fe12cc174f63ee91eb1093dd47e4b43.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 40, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Pascal King", "NoahKliemann", "Lightmoon", "prent2cookies", "Drifters Studios", "worzalla"], "genres": ["Fighting"], "publishers": [], "esrb_rating": null}