{"id": 497340, "slug": "level-editor-game", "name": "Level Editor & Game", "name_original": "Level Editor & Game", "description": "<p>Level Editor &amp; Game!</p>\n\n<p>This was developed using the kage game engine as a university project.</p>\n<p>You can switch between the level editor and game at any time using the \"e\" key to access the editor or using the \"space bar\" key to access the game mode. </p>\n<p>Levels you make can be added via the \"maporder.txt\" file located in the data folder being downloaded.</p>\n\n<p><strong>Level Editor:</strong></p>\n<p>To use the level editor, click on the sprite you wish to place and left click where you want it to appear on the level.  Levels are restricted to be between 2 x 2 to 32 x 32 blocks.</p>\n<p>You can place sprites on the background or foreground layers using the menu panel to allow for better level design.</p>\n<p>If you make a mistake and place a sprite in the wrong place, you can remove this using the right mouse button or by replacing the sprite with another.</p>\n\n<p>You have the option to make any sprite impossible to move through and also which blocks represent players, enemies or items that will configure and spawn when the game is being played. If you plan to use specific sprites for spawning, ensure visible in game for that sprite is not ticked.<br/></p>\n\n<p><strong>Game:</strong></p>\n<p>To play the game</p>\n<p>Use the \"a, d\" or \"arrow\" keys to move left or right</p>\n<p>Use space bar key to jump, you can double jump and wall jump. Wall jumping will push you in the opposite direction and reset your jump counter allowing additional jumps.</p>\n\n<p>In the current build you can jump on a frost giants head to remove them from play.</p>", "metacritic": null, "released": "2020-09-23", "tba": false, "updated": "2020-09-25T05:27:52", "background_image": "https://media.rawg.io/media/screenshots/c27/c278d40b7143a53c056e5463d0726e7e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 17, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["RedHeadGames"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}