{"id": 497586, "slug": "two-strangers-the-third-stranger", "name": "Two Strangers: The Third Stranger", "name_original": "Two Strangers: The Third Stranger", "description": "<p>Your name is <strong>They</strong>, and your grandpa wants you to get married.<br/>In fact, he's already picked somebody out for you.<br/><br/>The thing is, you never asked for this. You never wanted to get married, let alone be trapped in an arranged marriage.<br/>So you do the thing you know best: you run away.<br/><br/>Will you ever escape from your grandfather's controlling demands?<br/><br/>This game takes place during a chapter of time in the Gene universe known as the Grand Dream.<br/>It is largely unnecessary to understand the lore, aside from what is explained in-game, though those familiar with sbarg may have an extra bit of insight into certain events that may appear absurd at face value.</p>\n\n<p>As mentioned before, this game is a fangame tribute to Frogge's Two Strangers series, having been started in development right after the second one was released and continued during the release of the actual third game, which it somehow did not become lore incompatible with (in fact, it gave more ideas than it took away!).<br/><br/>However, while the main games in the series lean hard on parodying tropes of romantic comedies (and other tangential movie genres), this game seeks to subvert and reject the mainstream path of such cinematic mainstays.<br/>Actual gameplay however, is very similar in scope. If you've played the others, you know what to expect. Light puzzles in places.<br/>This game was made for the Year Of The Hedgehog.<br/><br/>Approx. play time: 20-30 minutes</p>", "metacritic": null, "released": "2020-09-22", "tba": false, "updated": "2020-09-25T06:23:41", "background_image": "https://media.rawg.io/media/screenshots/216/2166da03e84d57da89fa1cf4d0ea76aa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 260, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["lavendersiren"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}