{"id": 497516, "slug": "ovine-replica", "name": "Ovine Replica (itch)", "name_original": "Ovine Replica (itch)", "description": "—Story—\r\n<p>Once an impoverished boy, Ecout Kanovos lands a job as a recruit for the authoritative force of the city of Enonoia: the Master Order Trained Hire. However, Ecout soon realizes that this work exceeds his expectations of delivering any sort of justice.</p>\n<p>Amidst the chaos of sudden abductions and riots, an otherworldly atmosphere looms just beyond the recesses of the city's society. From a dubious state prison, Ecout frees Otis: a peculiar young man with a beastly visage who promises to return the favor with an ability to grant any wish.</p>\n<p>Could this power repair Ecout's life before it crumbles along with the city, or will the events that follow mark his undoing? What awaits you in the end is yet to be found.<br/></p>\r\n—Features—\r\n<p>•<em>Ovine Replica</em> is an adventure-style visual novel: a text-based game with emphasis on a story—featuring illustrations and a soundtrack—which readers can enjoy at their own pace.</p>\n<p>•Multiple endings to a tale of suspense and intrigue shed new light on what could be and what could have been. Choices made will lead to different outcomes in unexpected ways as your true intentions become evident. Decide for yourself if the city of Enonoia is a utopia or dystopia in need of your own ambition.</p>\n<p>•Event CGs (dynamic illustrated scenes) are spread throughout the story, complementing a number of key scenes with fresh art from Aiyuu as much as each new track from composers Matthew L. and Strung.</p>\n<p>\r\n•With a blend of inspiration taken from other tense, terrifying visual novels like <em>Chaos;Head</em> and atmospheric, moody role-playing games like <em>Shin Megami Tensei</em>™, dread may loom over the reader alongside enchantment. In an already-foreign world, the true mysteries have yet to be solved, and the biggest surprises have yet to be discovered.<br/></p>\n<p><strong>This is the complete version of <em>Ovine Replica</em></strong>, featuring the full story and the ability to either start from the beginning or continue from the point at which the demo version ends. <strong>The demo version of <em>Ovine Replica</em></strong> only covers the introduction of the story, but may be downloaded from this page for the sake of preservation.<br/></p>\r\n[CONTENT NOTICE]\r\n<p>This software is unadvised for young or immature audiences, particularly anyone under the age of 17.</p>\n<p>Sensitive material includes:<br/>•Blood and gore<br/>•Profanity<br/>•Sexual themes<br/></p>", "metacritic": null, "released": "2020-09-22", "tba": false, "updated": "2020-09-25T06:08:37", "background_image": "https://media.rawg.io/media/screenshots/85d/85d8e28e7a355116b4010a50f2b2c9d2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 248, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Amorous Ursidae"], "genres": [], "publishers": [], "esrb_rating": null}