{"id": 49755, "slug": "south-park-phone-destroyer", "name": "South Park: Phone Destroyer", "name_original": "South Park: Phone Destroyer", "description": "<p>All those countless hours spent on your phone have been preparing you for this moment.<br />\nFulfill your destiny and become… THE ULTIMATE PHONE DESTROYER!<br />\nFrom South Park Digital Studios comes a real-time battle game like nothing you’ve ever experienced before! Take on Cartman, Kenny, Stan and Kyle in all out mobile mayhem!<br />\nSouth Park: Phone DestroyerTM brings you iconic South Park characters, action packed real-time strategy, exploding PvP battles, trademark South Park humor and collectible cards in a perfect mix that’s spicier than Cartman’s chili con carne.<br />\nAssemble the ultimate team of cowboys, wizards, cyborgs and more and get ready to crush your opponent!</p>\n<p>FEATURES<br />\n- A whole new South Park experience with new and twisted versions of iconic characters like Stan of Many Moons, Cyborg Kenny, Ninjew Kyle, Grand Wizard Cartman… and many more!<br />\n- Beat down opponents in real-time PVP battles.<br />\n- Experience a huge single player story written in collaboration with South Park Digital Studios.<br />\n- Collect and upgrade over 80 unique cards featuring all-new, beautifully rendered designs.<br />\n- Join a team and boost your decks by sharing cards with your teammates.<br />\n- Customize your hero to be the most badass looking kid on the block.<br />\n- Witness Randy cross-dressing in new and exciting outfits.<br />\n- Kill Kenny.</p>", "metacritic": null, "released": "2017-11-09", "tba": false, "updated": "2024-03-25T05:41:45", "background_image": "https://media.rawg.io/media/games/6f5/6f5a86874e87f6f8d63caad6e4a3b49f.jpg", "website": "https://www.ubisoft.com", "rating": 3.35, "rating_top": 4, "added_by_status": {"yet": 5, "owned": 9, "beaten": 7, "toplay": 6, "dropped": 24, "playing": 4}, "playtime": 0, "achievements_count": 0, "ratings_count": 31, "suggestions_count": 183, "game_series_count": 9, "reviews_count": 31, "platforms": ["iOS", "Android"], "developers": ["Ubisoft"], "genres": ["Action", "Strategy", "Card"], "publishers": ["Ubisoft Entertainment"], "esrb_rating": null}