{"id": 4975, "slug": "history-ice-road-truckers", "name": "HISTORY Ice Road Truckers", "name_original": "HISTORY Ice Road Truckers", "description": "Take command of these huge 18-wheelers and drive your way across ice roads. In this official game from the award-winning TV series from HISTORY™ you will be in charge of delivering your load to its destination, driving the most powerful trucks on earth and become the number one Ice Trucker !\r\n<br/><br/>\r\nFeatures<br/>\r\n* 5 trucks, with unique characteristics. Unlock trucks by winning awards<br/>\r\n* 5 different cameras<br/>\r\n* Different surfaces with different traction<br/>\r\n* 15 ice roads to master. Unlock roads by earning cash<br/>\r\n* Thin breakable ice area – beware! <br/>\r\n* Forking roads<br/>\r\n* Race against the clock to deliver your loads<br/>\r\n* Avoid other trucks and hazards on the road<br/>\r\n* Set records in the hall of fame<br/>\r\n* Even your glass steams up when the action gets intense!\r\n<br/><br/>\r\nPublished by Slitherine Software UK Ltd ©2010. All Rights Reserved. Developed by Digital Tales srl. All rights reserved.\r\n<br/><br/>\r\nHISTORY™ Ice Road Truckers. Slitherine Software UK Ltd 2010. All rights reserved. \r\n<br/><br/>\r\nTHE HISTORY CHANNEL, HISTORY and the “H” logos  are trademarks of A&amp;E Television Networks. All rights reserved. Documentary footage ©1999-2010 A&amp;E Television Networks. All rights reserved. \r\n<br/><br/>\r\nAll brands and associated imagery featured in this game are trademarks and/or copyrighted materials of their respective owners. All rights reserved.\r\n<br/><br/>\r\nPurchase or use of this item is subject to the PlayStation®Network Terms of Service and this item’s use restrictions. If you do not wish to accept all these terms, do not purchase or use this item. One-time license fee for downloads to up to 2 console systems and 2 portable systems that are associated with the purchasing account.", "metacritic": null, "released": "2010-03-11", "tba": false, "updated": "2019-08-02T16:22:41", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PlayStation 3", "PS Vita", "PSP"], "developers": ["Slitherine Software"], "genres": ["Racing"], "publishers": [], "esrb_rating": "Everyone 10+"}