{"id": 4976, "slug": "mahjongg-artifacts", "name": "Mahjongg Artifacts", "name_original": "Mahjongg Artifacts", "description": "Escape from the rush of modern life into immersive ancient atmosphere of Mahjongg Artifacts! This new fan-favorite comes with three game play modes which take you through five exotic cultures. It also comes with innovative game play twists, like Special Tiles that allow you to use new strategies to clear layouts, Bonuses for skillful play and Trophies for special accomplishments. Story Mode features epic quest for lost relics, in Classic mode you can choose the layout you want to play, and in the breathtaking Endless mode you remove tiles from an ever-rising tower of game pieces.\r\n<br/><br/>\r\n- Story mode featuring 25 layouts<br/>\r\n- Classic mode with 100 layouts<br/>\r\n- Innovative Endless mode<br/>\r\n- 27 gorgeous backgrounds<br/>\r\n- Five beautifully drawn tilesets<br/>\r\n- Music tracks inspired by ancient cultures<br/>\r\n- Manual smooth zoom in/out and auto-zoom option\r\n<br/><br/>\r\nThe wealth of gameplay options, elegant new tile sets and easy-to-learn gameplay will earn Mahjonggg Artifacts a permanent place in your collection!\r\n\r\nMahjongg Artifacts © and TM  2009,2010 G5 Entertainment AB.  “G5 Entertainment” is a registered trademark of G5 Entertainment AB. All Rights Reserved.\r\n<br/><br/>\r\nPurchase or use of this item is subject to the PlayStation®Network Terms of Service and User Agreement. If you do not wish to accept all these terms, do not purchase or use this item. This item has been sublicensed to you by Sony Computer Entertainment America. One-time license fee for downloads to up to 2 console systems and 2 portable systems that are associated with the purchasing account.", "metacritic": null, "released": "2006-09-13", "tba": false, "updated": "2019-08-02T16:22:41", "background_image": "https://media.rawg.io/media/screenshots/ea8/ea8c494a900fb609eecd8c1e8324d789.jpg", "website": "http://www.alawar.com/games/mahjongg-artifacts/index.php/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "beaten": 2, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 407, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC", "PSP", "PlayStation 3"], "developers": ["G5 Entertainment", "Shape Games"], "genres": ["Puzzle"], "publishers": ["Alawar Entertainment"], "esrb_rating": "Everyone 10+"}