{"id": 497616, "slug": "king-of-autumn", "name": "King of Autumn", "name_original": "King of Autumn", "description": "<p>A simple deckbuilder based around the seasons with an emphasis on autumn. You play as the scarecrow, who must fight enemies representing each of the seasons. The game was created for the Great Harvest Game Jam.<br/></p>\n<p>The game is solely played using the left mouse button. The mechanics should be fairly familiar to anyone who has played a card game. There is a brief tutorial to those unfamiliar with the genre.</p>\n<p>As with other game jams, I ran out of time and there were many things I didn't get to add or improve, among them:</p>\n<ul><li>Sound/Music - unfortunately, I did not have time to add audio to the game</li><li>Balancing - currently, the game is rather easy; I ran out of time to improve the card &amp; enemy difficulty balance</li><li>More cards and greater variety</li><li>More animations and added detail to existing animations</li><li>Improvements to the HUD, including displaying extra info like effects</li><li>Cutscenes instead of plain text for the story</li></ul>\n<p>On the positive side, it was a great learning experience. It was a good challenge to try and build an efficient card system that would also make it easy to add additional cards. One of the reasons I ran out of time was because halfway through, I was unhappy with how the system worked and realized it would not scale well, so I completely redid it. On another note, having the color palette was fun as someone who is guilty of \"programmer art.\" It helped to have colors to have focus on, while proving a fun challenge to represent all seasons with colors that lean in the autumn direction.</p>\n<p><strong>Credits:<br/></strong>Fall font from Misti's Fonts:<br/>https://mistifonts.com/fall-is-coming/<br/></p>", "metacritic": null, "released": "2020-09-22", "tba": false, "updated": "2020-09-25T06:30:06", "background_image": "https://media.rawg.io/media/screenshots/cbb/cbbd39a53ee058a84fffaf493d946957.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 36, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["fc85057"], "genres": [], "publishers": [], "esrb_rating": null}