{"id": 497723, "slug": "flappy-bird-for-the-zx-spectrum-next-in-basic", "name": "Flappy Bird for the ZX Spectrum Next - in BASIC", "name_original": "Flappy Bird for the ZX Spectrum Next - in BASIC", "description": "<p>This is the original mobile game back from 2013/2014 ported to the new ZX Spectrum Next! This is an unofficial port, although the original creator Dong Nguyen has allowed me to release it as a free download (feel free to make a donation for coffee - I need it haha).</p>\n<p>The game has been coded entirely in NextBASIC by myself. Sound effects have been made with Shiru's AYFX editor and Remy Sharp's AYFX driver has been used. The sprites and tiles have been sourced from the web and converted using UDGeed by David Saphier aka emook and then slightly modified. Additional graphics were made by myself.<br/></p>\n<p>The aim of the game is to guide your bird in between the pipes for as long as you can by flapping constantly as you are constantly falling. If you hit a pipe or the ground it's game over!</p>\n<p>With the demo mode showing you how to play (when you haven't pressed anything on the title screen for about 20 seconds) you'll be flying in no time.<br/></p>\n<p>The high score is saved to your SD card so you don't have to worry about losing it when you power off your ZX Spectrum Next and will work no matter whether you load the game from your C drive, D drive or other drive.<br/></p>\n<p>There is Kempston joystick support for port 1 (fire or any direction will work) and a redefine key option (the default is M). You don't have to select the joystick or keyboard as both are enabled at the same time allowing you to easily switch.<br/></p>\n<p>The game is playable in both 50Hz and 60Hz.<br/></p>\n<p>Good luck and have fun!<br/></p>", "metacritic": null, "released": "2020-09-21", "tba": false, "updated": "2020-09-25T06:54:57", "background_image": "https://media.rawg.io/media/screenshots/8e0/8e033955901c5a460ad7d4f0bc909e8f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 36, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Retro Beach Man"], "genres": [], "publishers": [], "esrb_rating": null}