{"id": 49777, "slug": "catan-stories", "name": "Catan Stories: Legend of the Sea Robbers", "name_original": "Catan Stories: Legend of the Sea Robbers", "description": "DISCOVER THE WORLD OF CATAN<br/>Set off on an adventure with Catan Stories: Legend of the Sea Robbers. Seventy years after the first settlers arrived on Catan, the island is enjoying peace and prosperity, but for how much longer? In this original text adventure, guide three heroes and explore the world of Catan through them. Each of your decisions will have consequences; the fate of the island is in your hands.<br/><br/>In this captivating interactive story, you play as a raven, the island's guardian, and you follow three characters on their journey. In order to lead these three adventurers toward their shared destiny, you must choose your words with care and write your own story. Throughout your adventure, be aware of your environment and try to learn a little more about the world that surrounds you.<br/>Many mysteries await you... As a bird with supernatural powers, you can communicate with and read the thoughts of human beings. This strange raven is also endowed with dark and intriguing visions. These disconcerting visions will perhaps bring trouble or, who knows, help from characters you did not even imagine existed.<br/>A great adventure awaits you. Show your mettle and keep a level head to progress through the story. However, don't be too reckless, or you might lose a few feathers! This game requires nerves of steel and a marked flair for adventure, but don't get too distracted, Catan could be in danger. The time has come to explore the island and save it. Are up to the challenge? Catan's fate is in your hands.<br/> <br/><br/>Features:<br/>Single-player text adventure with three different characters<br/>• 360° environment with immersive graphics and sound<br/>• A storyline based on the new scripted Catan expansion, \"\"Legend of the Sea Robbers.\"\" Catan is one of the most popular board games of recent years.<br/>• Extra features to unlock using your Asmodee account • Developed in collaboration with Klaus and Benjamin Teuber, the creators of Catan <br/>• Several different font sizes available<br/><br/>To find more information about Asmodee Digital, please go to http://www.asmodee-digital.com<br/><br/>Having an issue? Looking for support? Please contact us: https://asmodee.helpshift.com/a/catan-stories/<br/><br/>You can follow us on Facebook, Twitter, Instagram and You Tube!<br/>Facebook: https://www.facebook.com/asmodeedigital/<br/>Twitter: https://twitter.com/asmodeedigital<br/>Instagram: https://www.instagram.com/asmodeedigital/<br/>You Tube: https://www.youtube.com/asmodeedigital<br/><br/>Available in English, French and German", "metacritic": null, "released": "2017-11-08", "tba": false, "updated": "2019-07-30T07:11:51", "background_image": "https://media.rawg.io/media/screenshots/7cf/7cf0e1e0b8d16b3e49193da1057ac6fe.jpg", "website": "http://www.asmodee-digital.com/en/catan-stories/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 293, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Asmodee Digital"], "genres": ["Adventure", "RPG"], "publishers": ["Asmodee Digital"], "esrb_rating": "Everyone 10+"}