{"id": 49772, "slug": "river-city-rival-showdown", "name": "River City: Rival Showdown", "name_original": "River City: Rival Showdown", "description": "The 1989 retro classic River City Ransom has muscled up and doubled down on modern innovation!<br/>\r\nTightened controls, improved backgrounds, and even online play -- this version has it all and more!<br/>\r\nThrow in a 2D fighting game mode to the mix, and River City has never been more action-packed!<br/>\n<br/>\r\n■ Craft your own story and unlock various endings in single player mode!<br/>\r\nBrand new story events await as you battle through three days of hot-blooded high school hostilities!<br/>\r\nCharacters and dialogue change with each completed event, culminating in a variety of unique endings.<br/>\r\nUncover sinister plots and protect your turf at all costs! The fate of River City is in your hands!<br/>\n<br/>\r\n■ Utilize flashy new special techniques to send your adversaries packing!<br/>\r\nStone Hands, Dragon Feet -- Kunio already has quite an arsenal up his sleeve.<br/>\r\nBring even more bravado to the brawl with an array of fresh, never-before-seen macho maneuvers!<br/>\r\nAnd that's not all! Ultra moves make their return, with enough firepower to bring any would-be challengers to their knees!<br/>\n<br/>\r\n■ Play against friends in the 2D fighting game mode!<br/>\r\n\"Double Dragon Duel 2023\" (or DDD for short) is an all-new 2D fighting game bundled in at no extra cost.<br/>\r\nSelect from a bountiful roster of hardened hitters and connect with friends both near and far to see who is the top dog on campus!<br/>\r\nAnd the word on the street is that even more unlockable characters await those who can find them...!<br/>\n<br/>\r\n* This product is a port of the 2016 title River City: Rival Showdown.", "metacritic": null, "released": "2017-11-21", "tba": false, "updated": "2023-10-13T04:18:52", "background_image": "https://media.rawg.io/media/screenshots/1c6/1c6c5856753d0a51f5bf4bd90d87379f.jpg", "website": "https://www.kuniokun.jp/nekketsusp/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 3, "toplay": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 252, "game_series_count": 25, "reviews_count": 1, "platforms": ["PC", "Nintendo 3DS"], "developers": ["Arc System Works", "Arc System Works Co."], "genres": ["Action", "Adventure", "RPG"], "publishers": ["Arc System Works", "Natsume"], "esrb_rating": null}