{"id": 49782, "slug": "jia-you-da-mao-nekojishi", "name": "家有大貓 Nekojishi", "name_original": "家有大貓 Nekojishi", "description": "<strong>Ever dreamed about having furry beast men hanging around with you? What if they are gods in your childhood bedtime stories? This visual novel gives you a chance to play a young man whose dream has come true, but also gets him deeply involved in the consequences.</strong><br/>Although he was born within a religious family, college student Lin Tian-Liao has never thought about meeting three feline spirits. <br/><br/>It's never bad to have three lovely guys around, but life must be going on. Knowing his humdrum life has gone forever, Liao still don't know what his future holds. However, his story with three big cats has already began.<br/><br/>With his third eye accidentally opened, Liao can now see spirits that used to be invisible to him. However, their requests force Liao to decide for his future life. Lin Hu, the tiger patron god of Lin family wants Liao to go back home after his graduation. Likulau, a clouded leopard spirit from an Aboriginal Taiwanese tribe finds Liao is a good candidate for the tribe oracle. And Yan Shu-Chi, who is a colleague of Liao but now being possessed by a leopard cat spirit, is trying to get help from Liao to rejuvenate a countryside temple. Before Liao could understand what’s going on, his brand new daily life is already on the track. <br/><br/>Surprisingly, these gods appear from nowhere are not fuddy-daddy as Liao thought, letting him rethink the positive side of folk belief in the modern society. However, his course schedule doesn’t allow him to thoroughly interpret the traditional culture, and now it’s time for you to help him getting his decision.<br/><br/><strong>The story of Nekojishi contains same gender romance plots.</strong>", "metacritic": null, "released": "2017-11-12", "tba": false, "updated": "2024-01-07T09:16:58", "background_image": "https://media.rawg.io/media/screenshots/7c9/7c9cea8f768c3178762f5d826fc72a5a.jpg", "website": "https://www.nekojishi.tw/", "rating": 3.58, "rating_top": 4, "added_by_status": {"yet": 14, "owned": 221, "beaten": 10, "toplay": 4, "dropped": 5}, "playtime": 1, "achievements_count": 0, "ratings_count": 18, "suggestions_count": 519, "game_series_count": 0, "reviews_count": 19, "platforms": ["PC", "Linux", "macOS"], "developers": ["Team Nekojishi"], "genres": [], "publishers": ["Orange Juice Dog"], "esrb_rating": null}