{"id": 49786, "slug": "nebula-nuker", "name": "Nebula Nuker", "name_original": "Nebula Nuker", "description": "Go back to arcade shooter games with Nebula Nuker! Taking place in space, you have a single ship that you use to destroy hordes of enemies, using various weapons, including your default laser cannon, missiles, EMPs, turrets, and much more! Explore a variety of maps as you progress and fight harder enemies! But beware! You don't have lives! This is space, after all! When your health bar runs out, you're dead! Sure, you can repair your ship, but you'll find that to be its own challenge.Key Features:<br/>- Explore space at its finest! Every background is a real nebula!<br/><br/>- Use a wide variety of powerups, from simple ones that heal and increase speed...<br/><br/>- ... to much more advanced powerups, such as a cannon that fires diamond shards and even a nuclear missile!<br/><br/>- Utilize the vector-movement system! This is part of the challenge that you will need to master. Enemies will fire based on where you will be based on your path, so you will need to learn to use this to your advantage!<br/><br/>- Fight various enemies, starting out at small vessels, but eventually taking on much larger and deadlier enemies, like cruisers, capital ships, and more!<br/><br/>- Earn Credits to upgrade your ship and gain an arsenal of new weapons as you progress in the game.<br/><br/>- Each level randomized enemies, so no two games are exactly the same. Just to keep things interesting...<br/><br/>- Customize your ship with different skins and thruster trails!", "metacritic": null, "released": "2017-12-21", "tba": false, "updated": "2019-08-28T22:03:47", "background_image": "https://media.rawg.io/media/screenshots/7db/7dbfd791736d179ba44a01efb29cbd0f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 125, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Octopi is not a Word"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Octopi is not a Word"], "esrb_rating": null}