{"id": 497993, "slug": "propagation-vr", "name": "Propagation VR", "name_original": "Propagation VR", "description": "<p>Combining survival horror and wave shooting, Propagation VR will get your adrenaline pumping as you try to survive the apocalypse brought on by a mysterious virus. Armed only with your guns and your fists, fight off terrifying zombies and other multi-species mutants. Will you get out alive?Live The HorrorTrapped in an abandoned subway station filled with monsters from your worst nightmares, you can only count on your cold blood and your skills to survive. You might get a little help... or not. Throughout this short but intense immersive experience, thrilling cinematics and a variety of enemies will keep you on your toes. The realistic handling of weapons will add to the tension, as you try to think straight and manage your ammunition. Surviving Propagation VR is a challenge you will remember.Use Your SkillsStudy your enemy for weaknesses, analyze the situation and overcome your fear if you want to make it till the end.<br />\nManage your weapons wisely. You carry two weapons, each with their own qualities :<br />\n- Use the handgun on your belt if you need precision, quick reload, or a light in the dark<br />\n- Use the shotgun on your back for a powerful short-range blast<br />\nDon&#39;t forget to reload whenever you catch your breath, or you will only be left with your fists to defend yourself in close combat.Can You Beat The Game?4 difficulty modes are available : Normal, Hard, Nightmare, and Impossible!<br />\nOne session of Propagation VR is about 30 minutes of sweat and fear. Once you&#39;ve finished the game, challenge yourself to a harder setting and see if you can make it!<br />\nPersonal high score is locally saved. Can you beat your best score?<br />\nChoose between multiple comfort settings to match your style and your hardware.<br />\nPropagation VR is provided for private use only. For commercial licensing and more (multiplayer) experiences, please visit our website.</p>", "metacritic": null, "released": "2020-09-25", "tba": false, "updated": "2024-01-02T00:18:05", "background_image": "https://media.rawg.io/media/screenshots/4f1/4f1e0071133f416170f1b5a5213ee130.jpg", "website": "https://www.propagation-vr.com/", "rating": 2.93, "rating_top": 3, "added_by_status": {"yet": 13, "owned": 455, "beaten": 6, "toplay": 4, "dropped": 6}, "playtime": 1, "achievements_count": 0, "ratings_count": 15, "suggestions_count": 528, "game_series_count": 0, "reviews_count": 15, "platforms": ["PC"], "developers": ["WanadevStudio"], "genres": ["Action"], "publishers": ["WanadevStudio"], "esrb_rating": null}