{"id": 498017, "slug": "metal-gear-solid-2-substance-2", "name": "METAL GEAR SOLID 2 SUBSTANCE", "name_original": "METAL GEAR SOLID 2 SUBSTANCE", "description": "Solid Snake returns in Metal Gear Solid 2® Substance, the ultimate edition of Metal Gear Solid ® 2: Sons of Liberty, with all-new game modes, hidden characters, and storylines. Top-secret weapons technology is being mysteriously transported under cover of an oil tanker to an unknown location. Armed with an arsenal of new weapons, supplies and stealth maneuvers, it's up to Snake to infiltrate the transport and keep this deadly weapon of mass destruction from falling into the wrong hands!<br/><br/>\n<ul>\n<li>350 VR missions and 150 alternative missions  - SUBSTANCE Exclusive</li>\n<li>Play through 5 new Snake tales involving Solid Snake - SUBSTANCE Exclusive</li>\n<li>Unlock new playable characters and game modes - SUBSTANCE Exclusive</li>\n<li>Contains the entire Metal Gear Solid®2: Sons of Liberty game plus the debut of the Casting Theater and Boss Survival mode - SUBSTANCE Exclusive</li>\n<li>Utilize stealth and infiltration methods, such as diving somersaults, hanging from ledges and using disguises.</li>\n<li>Fully interactive environment where bullets pierce steam pipes, smoke reveals laser beams and wet shoes leave footprints</li>\n<li>Powerful musical score composed by Harry Gregson - Williams (Armageddon, The Rock)</li>\n</ul>", "metacritic": null, "released": "2003-03-24", "tba": false, "updated": "2023-12-17T21:49:45", "background_image": "https://media.rawg.io/media/screenshots/b6d/b6da83c38cbfa4f1feb64a5a370d1700.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 14, "owned": 87, "beaten": 6, "toplay": 4, "playing": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 4, "suggestions_count": 191, "game_series_count": 0, "reviews_count": 4, "platforms": ["PC"], "developers": ["Konami Computer Entertainment Japan"], "genres": [], "publishers": ["Konami"], "esrb_rating": null}