{"id": 498039, "slug": "mini-football-mobile-soccer", "name": "Mini Football - Mobile soccer", "name_original": "Mini Football - Mobile soccer", "description": "Put on your boots, and get ready to go onto the pitch in this brand new football game! Experience football like never before, in this fresh and easy to play football game. In Mini Football you will enjoy a casual gameplay experience, while still remaining loyal to the original game. It’s time for you to get the crowds roaring in the stadiums, score some amazing screamers, and build the strongest team that ever existed!<br/><br/>Pick Up and Play<br/>Welcome to the first casual experience of football. Mini Football has a casual pick up and play feel that still remains true to the original sport. No need to waste time on endless mechanics, just pick it up and jump straight into the action!<br/><br/>Build, Upgrade and Customize Your Team<br/>In Mini Football you will be able to win players, from common to epic ones, and upgrade them to turn your team into the most feared opponents on any pitch. Not only can you build your team, but you will also be able to fully customize it to your image with more than 100 customizable options from:<br/>●     Unique logos, jerseys, shorts, socks, and boots<br/>●     Over 30 unique country kits<br/>●     Personalize your gameplay experience by choosing the ball you prefer<br/>●     Name your team<br/>Win the rarest pieces of equipment and show them off!<br/><br/>Play through Different Tiers<br/>5 unique and original stadiums that will get bigger, louder, and more impressive as you progress through your football career.<br/>Whether it’s on your home pitch, or in an international setting, every game will feel different. New and more impressive stadiums are on their way, so keep an eye out for future updates.<br/><br/>Rule the World<br/>Climb up the leaderboards to win amazing prizes and always be on top of the competition. Every week you will have a chance to move up the leagues, from the Brass League to the All-Stars League, so make sure that you grab those promotion spots by the end of the week to win bigger and better prizes!<br/><br/>--------------------------------------<br/><br/>Contact us:<br/>support@miniclip.com", "metacritic": null, "released": "2020-09-22", "tba": false, "updated": "2020-10-02T02:53:39", "background_image": "https://media.rawg.io/media/screenshots/5f8/5f87c545f4fc19aaa118843597384d71_7GCiHph.jpg", "website": "http://www.miniclip.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 191, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["Miniclip.com"], "genres": ["Action", "Sports"], "publishers": ["Miniclip"], "esrb_rating": null}