{"id": 498095, "slug": "virus-remove", "name": "VIRUS REMOVE", "name_original": "VIRUS REMOVE", "description": "<p>[DESCRIPTION]<br/><br/>Remove stress by removing viruses! \"VIRUS REMOVE\" 1.1.0 major update!! Operate nanomachine to remove viruses in the body. This is a simple 3D shooting game, that can play with one finger in portrait screen. With the update, there are 5 types of nanomachines and 5 types of weapons. The types of viruses has increased to 10, so getting more and more interesting!</p>\n<p>[FEATURES]<br/><br/>1. Enjoy 3D shooting game with one finger! It is a simple operation just to move.<br/><br/>You can play with the portrait screen. It is a simple operation just to move. Aim at the enemy while moving. It will attack automatically. Depending on the weapon, you can attack by releasing your finger or tapping repeatedly.<br/><br/>2. You can power up by Gacha system.<br/><br/>You can get new nanomachines and weapons. The more you draw the Gacha, the more power you will get. If you power up to the maximum, you can wipe out the virus!<br/><br/>3. Customize machine!<br/><br/>5 types of nanomachines x 5 types of weapons = 25 types of settings. There are quests for all settings. Clear all the quests and get a lot of Gacha Coins!<br/><br/>4. New Virus...??<br/><br/>100 missions and 100 quests! New virus you have never seen is waiting at the final stage. New virus is very strong!! Can you remove it?<br/><br/>[HOW TO PLAY]<br/><br/>○DRAG ... MOVE<br/><br/>[ABOUT NANO-MACHINE]<br/><br/>\"TURTLE\"<br/>Very hard armor. But too slow speed.<br/><br/>\"MANTA\"<br/>A little hard armor. A little slow speed.<br/><br/>\"SHARK\"<br/>Standard armor and speed. Easy to control.<br/><br/>\"PENGUIN\"<br/>A little weak armor. A little fast speed.<br/><br/>\"TOBIUO\"<br/>Very weak armor. Very fast speed.<br/><br/>[ABOUT WEAPON]<br/><br/>\"LASER\"<br/>Long range penetrating beam. Need accurate manual aiming.<br/><br/>\"MAGNET\"<br/>Auto aiming tractor beam. Be careful not crash to enemy.<br/><br/>\"BUBBLE\"<br/>Release finger to attack. If hit enemy, can bind enemy.<br/><br/>\"SHOWER\"<br/>Wide beam to easy aiming. But cannot reach far area.<br/><br/>\"BARRIER\"<br/>Attack by crash to enemy. For expand, TAP! TAP! TAP!<br/><br/>[HOW TO POWER UP]<br/><br/>Power up by GACHA. 1Gacha cost is 100 coins. You can get Gacha coins by playing game. You can get many many coins at First clear and All Clear bonus! If you see the Ads, you can get double coins!<br/><br/>[GACHA %]<br/><br/>nanomachine TURTLE 10%<br/>nanomachine MANTA 10%<br/>nanomachine SHARK 10%<br/>nanomachine PENGUIN 10%<br/>nanomachine TOBIUO 10%<br/><br/>weapon LASER 10%<br/>weapon MAGNET 10%<br/>weapon BUBBLE 10%<br/>weapon SHOWER 10%<br/>weapon BARRIER 10%<br/><br/>(bonus+10 (Goddess appearance) 20%)<br/><br/>[MATERIAL]<br/><br/>SOUND : Maoh Damashii<br/>PICTURE : Irasutoya<br/>special thanks!</p>", "metacritic": null, "released": "2020-09-27", "tba": false, "updated": "2020-09-28T02:30:39", "background_image": "https://media.rawg.io/media/screenshots/fee/fee3ebafd2e322edbefebbc66487385f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 133, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["zakuro-latte-game"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}