{"id": 498007, "slug": "scarlet-hollow", "name": "Scarlet Hollow", "name_original": "Scarlet Hollow", "description": "Scarlet Hollow is being released across <strong>7 episodes</strong>. The first two are already released for you to play, with the remaining episodes to follow as free updates as we finish them.<br/><br/>Trapped in the dying Appalachian mining town of Scarlet Hollow for the funeral of your estranged aunt, you quickly find yourself at the center of a dark mystery that threatens your life and the fate of an entire town. Who lives, who dies, and the fate of an entire town rests on your shoulders.<br/><br/><br/><br/><strong>Features</strong><br/><br/><ul><li> <strong>A heavily branching narrative where your choices matter</strong>. The relationships you forge and the decisions you make will dramatically alter your journey.<br/></li><li> <strong>Terrifying and funny.</strong> Charming characters and snappy dialogue flip to pulse-pounding horror at a moment's notice.<br/></li><li> <strong>A complex relationship system that changes how characters act around you.</strong> Characters don't just like or dislike you. Become friendly rivals, bitter adversaries, best friends, or mild acquaintances with everyone in town based on how you approach the story.<br/></li><li> <strong>Trait-based dialogue and role-playing.</strong> Scarlet Hollow's dialogue system is driven by role-playing elements that let you choose who you want to be. Are you quiet and observant? Hot and clueless? 21 different character builds change how you interact with the world and how your story unfolds.<br/></li><li> <strong>Original monster designs inspired by Appalachian myths and cryptids.</strong> You won't find any predictable vampires or zombies here.<br/></li><li> <strong>Five romance options.</strong> Whether you're into goths, dads, Youtubers, mysterious recluses, or lo-fi beats to study and water your plants to, we've got all your bases covered.<br/></li><li> <strong>Dozens of meticulously hand-drawn and traditionally inked backgrounds.</strong> Every background in the game is drawn by hand and inked on massive 19x24 inch paper.<br/></li><li> <strong>Hundreds of immersive sprites.</strong> Each major character has dozens of hand-drawn sprites that interact with backgrounds and capture a full range of lighting, emotion, environment, and outfit changes.</li></ul>", "metacritic": null, "released": "2020-09-25", "tba": false, "updated": "2022-06-03T06:20:03", "background_image": "https://media.rawg.io/media/screenshots/133/13355ac2c872c6acce6cdd90097dcede.jpg", "website": "https://scarlet-hollow.backerkit.com/hosted_preorders", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 69, "toplay": 11, "playing": 1}, "playtime": 2, "achievements_count": 103, "ratings_count": 0, "suggestions_count": 385, "game_series_count": 0, "reviews_count": 1, "platforms": ["Linux", "macOS", "PC"], "developers": ["Black Tabby Games"], "genres": ["Adventure", "RPG", "Casual", "Indie"], "publishers": ["Black Tabby Games"], "esrb_rating": null}