{"id": 498033, "slug": "otomania", "name": "Otomania", "name_original": "Otomania", "description": "Otomania is THE place to find otome love stories made just for YOU! Enjoy exciting storylines where you get to choose what happens and which of the unique characters you’d like to romance! <br/><br/>Choose your story!<br/>You’ll get to pick which stories you want to read from a HUGE selection of titles that include genres such as fantasy, action, drama, and horror! Once you start, you won’t be able to stop reading!<br/><br/>Choose your romance! <br/>Each story has a cast of love interests that you’re able to romance! Whether you like alpha-males or have a thing for the strong silent type, we’ve got a character to match your tastes! With so many of them to choose from, who will be your favorite? <br/><br/>The choice is yours!<br/>Will you save him or let him fend for himself? Do you go for the kiss, or do you hesitate? In Otomania, you get to decide! <br/><br/>Featured stories:<br/><br/>Nocturne of Nightmares<br/><br/>You find yourself trapped in a nightmare world along with a few attractive strangers. Yet, they all seem vaguely familiar. Before you can even process all of this, a hideous monster shows up out of nowhere. You run for your life scared and confused and then you wake up in a cold sweat. But then, the cycle repeats itself every night when the bell tolls ten.⁠<br/>⁠<br/>Can you put an end to this life-threatening cycle of nightmares? Or will you be forever tormented by your past? Ready or not, embark on an emotional journey of self-discovery, friendship, love, and survival!⁠<br/><br/>My Mystic Dragons<br/><br/>One night, your life is turned upside-down by the arrival of three hot, mysterious young men with special powers - and they all want your hand in marriage!⁠<br/>⁠<br/>It turns out that they are dragon princes and you are actually the princess of a long line of powerful dragon slayers! ⁠<br/>⁠<br/>You’re even more shocked to discover that only by marrying you, can peace between dragons and humans be maintained. But you’re not ready to say \"I do\" just yet…or are you? ⁠<br/><br/>The Spellbinding Kiss<br/><br/>Life running the pharmacy passed down by your father was uneventful until a wounded man showed up at your door one stormy night. He disappeared into a bolt of lightning along with another man that seemed to know your father… The next day, you find a letter of acceptance to a school for users of magic! ⁠<br/>⁠<br/>Although nervous, you decide to enroll in the magic academy. Awaiting you are three handsome men, each with their own unique skillsets and personalities. ⁠<br/><br/><br/>Dozens of other stories are also available to read! Download now to check them out!", "metacritic": null, "released": "2020-07-13", "tba": false, "updated": "2020-09-28T02:14:27", "background_image": "https://media.rawg.io/media/screenshots/895/8953e4269b4bd5d7a14899a26d298687.jpg", "website": "", "rating": 0.0, "rating_top": 5, "added_by_status": {"owned": 4}, "playtime": 0, "achievements_count": 0, "ratings_count": 5, "suggestions_count": 165, "game_series_count": 0, "reviews_count": 5, "platforms": ["iOS"], "developers": ["Genius"], "genres": ["Adventure", "Simulation"], "publishers": ["Genius"], "esrb_rating": "Teen"}