{"id": 498175, "slug": "the-king-returns-francium-chapter-2", "name": "The king returns! Francium chapter 2", "name_original": "The king returns! Francium chapter 2", "description": "<p>I made it in 2 weeks with some existing assets and new ones. Among the things I already had: <br/>- the robots in 3d (made for chapter 1 for Yaz Solo Jam)<br/>- some assets from the Unity asset store: bushes and trees</p>\n<p>Made with 3dsmax, Unity and Adventure Creator. It is my first project with Unity and AC, so I learned a lot and it was interesting.<br/></p>\n<p><strong>Work progress:</strong><br/></p>\n<p>The game should be playable from the beginning to the end, but several bugs and issues are to be expected such as collision, typos, or animations that are not working properly.</p>\n<p>There's currently no sound design (only music), I didn't have the time.<br/></p>\n<p><strong>Language: English</strong><br/></p>\n<p>I couldn't include the usual French translation before the deadline, so it's only in English.</p>\n<p>I will try to improve The King returns! Franchium 2 within the next few weeks. Thanks for playing this first unpolished version :)</p>\n<p><strong>Gameplay info:</strong></p>\n<p>Move with keyboard (zqsd or wasd, or arrows), interact with left click. If you are prompted to type a text, write directly with your keyboard. There is no inventory, I didn't have the time to include items to use. There should be a menu with options and save/load with Escape, but it seems that it doesn't work. <br/></p>", "metacritic": null, "released": "2020-09-27", "tba": false, "updated": "2020-09-28T02:48:41", "background_image": "https://media.rawg.io/media/screenshots/7ad/7ad8f823af150dc182e2a92ae8d3bc7f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 210, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["The Icehouse"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}