{"id": 49836, "slug": "maze-of-gaea", "name": "Maze of Gaea", "name_original": "Maze of Gaea", "description": "GaeaGaea was a primal Greek goddess, one of the deities that governed the universe before the Titans.<br/>In our game, your challenge is to escape from the maze of Gaea.Game description:The design of the game was inspired by the experience of a real-life labyrinth. I couldn't find the way out the labyrinth. The only way is to return to the tall bridge in the maze, look down from the high bridge, find the route, and then find the exit by memory. Now, we have rebuild the gameplay and carefully designed a series of  maze of different difficulties, different styles and different ways of playing. This seven labyrinths have increasingly difficult and constantly challenge your memory limits. The addition of weather system also adds to the reality of the maze experience. There are many famous mazes around the world. And now, in our game, you can actually experience how to get out of the maze.Tip:Every maze has different high platforms, Bridges, etc. These positions are key to escaping the maze. When you get lost, remember to return to the tower, look for the exit route on the high stage, and remember it. Of course, you can't jump from a high platform, but you have to walk down the high stairs because we have made some restrictions to make sure that it is real.Function description:1. The pan key of the handle can use for transport, which is the main method of replacement;<br/>2. A handle shows the current time of use;<br/>3. The trigger key of a handle can be used to select more functions, including returning to the main menu and restarting;<br/>4. Language can be configured with the main menu . We support 简体中心and English.", "metacritic": null, "released": "2017-10-17", "tba": false, "updated": "2019-08-28T22:03:45", "background_image": "https://media.rawg.io/media/screenshots/f5b/f5bd0c7ca08cdd264763b52c4df1f0a3.jpg", "website": "http://www.tistartech.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 330, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["TiStar Game"], "genres": ["Adventure", "Strategy", "Simulation"], "publishers": ["TiStar Game"], "esrb_rating": null}