{"id": 498519, "slug": "the-crowd", "name": "The Crowd", "name_original": "The Crowd", "description": "<p>The Crowd was made during MEGAMIGS gamejam with Microsoft Azure. The gamejam lasted 8 hours which was a pretty big challenge.</p>\n<p>The theme was \"Anomaly\".</p>\n<p>In The Crowd, the player is put in an experiment where they have to find a specific individual in a crowd. A sort of needle in a haystack concept. <br/></p>\n<p>--------------Read after play--------------</p>\n\n<p>The theme took us toward an experiment type of concept with some authoritarian voice and we got significantly inspired by the Milgram Experiment. This is the experiment where participants are lied to and told to shock other people based on statements.</p>\n<p>What we thought was very interesting the Milgram experiment is the social statement about our relationship with people in position of power and we tried to recreate it in our game.</p>\n<p>In our experiment the players have to play a fake kind of hidden object game where they are told that one character is an anomaly in the crowd. But in a crowd, finding one particular individual is like searching a needle in a haystack. So the player is told to eliminate participants.</p>\n<p>With the traps, the lie about the anomaly death and the erratic kind of gameplay we tried to put pressure on the player so that they end up targeting some random character based on flimsy intuition.</p>\n<p>While we still use that authoritarian voice, our goal was to put forward our nature to single out a person or group of persons going as far as to imagine differences to fit our perspective.</p>\n\n<p>Game Created by the Octogone team :<br/></p>\n<p>Jacynthe Lefebvre-Asselin - 2D and Animation</p>\n<p>\n</p>\n<p>Jamie Dorval Caya - Design</p>\n<p>\n</p>\n<p>Agathe Préfontaine - 3D Art and Textures</p>\n<p>\n</p>\n<p>Félix Liberali - Design</p>\n<p>William Alexandre Thibault - FX</p>\n<p>Emery Monzerol - Programming</p>\n<p><strong>Controls<br/></strong></p>\n<p>WASD/Arrows - Moving</p>\n<p>Spacebar - Jump</p>\n<p>Left Mouse - Select an anomaly<br/></p>", "metacritic": null, "released": "2020-09-26", "tba": false, "updated": "2020-09-28T04:06:10", "background_image": "https://media.rawg.io/media/screenshots/3b6/3b698355ab79b0bca72e86bc9e7424d1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Licorneinabox"], "genres": [], "publishers": [], "esrb_rating": null}