{"id": 498536, "slug": "miragem-part-a", "name": "Miragem - Part A", "name_original": "Miragem - Part A", "description": "<p><strong>WELCOME TO THE WORLD OF MIRAGEM</strong><br/></p>\n<p>Miragem is a timed collectathon adventure through the Valley of Lost Dreams. It mixes the collectathon exploration of a Banjo Kazooie stage with the time dynamic of the game Minit.<br/>⠀<br/>You start in the Hub, a safe zone in the Valley. But once outside you're against the clock. Subjected to a magic that puts all to sleep once the timer reaches zero, you have limited time before being sent back to the Hub. So to be able to explore the valley, you must collect items that increase that exploration time; allowing you to go further into the Valley, unlock shortcuts and new areas, and progressively discover more of the story.<br/>⠀<br/>This was our approach to bringing something new into the genre. Being able to explore everything is not a given like in other 3D Platformers, but something the player must earn. The more you want to advance, the more you have to collect. That way the act of collecting gets a lot more meaningful.</p>\n<p>In this segment you be able to explore one of the four areas of the game!<br/></p>\n\n<p><strong>UNIQUE INFORMATION ABOUT THIS PROTOTYPE!</strong></p>\n<ul><li>The game requires a minimum donation, but you can skip it!</li><li>The biggest help that you can do is to do this Form with some questions about the game!<br/>https://forms.gle/WbzNUhbaX9vgGPC36</li><li>We are having an SpeedRun competition in this prototype! Whoever has the best time until the 5th of October wins the Prize! If you want to know more, join our Discord and share your speedrun video!</li><li>If you complete Part A and Part B send a print to us that you will have exclusive access to a mysterious version !!!</li></ul>\n\n<p><strong>OUR SOCIAL MEDIA</strong></p>\n<p>Twitter                    Instagram                   Discord                      Facebook</p>\n<p><strong>Support Us!</strong>\r\nPaypal: <br/>https://www.paypal.com/paypalme/BeGiants</p>", "metacritic": null, "released": "2020-09-26", "tba": false, "updated": "2020-09-28T04:09:25", "background_image": "https://media.rawg.io/media/screenshots/9b9/9b9be3b718b90c69689b2c6c5876a6f1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 175, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Little Giants"], "genres": ["Adventure", "Platformer"], "publishers": [], "esrb_rating": null}