{"id": 498592, "slug": "gryff-handler", "name": "Gryff Handler", "name_original": "Gryff Handler", "description": "<p>An alien world lays in a sleepy corner of the universe, undisturbed by man for untold eras. It is a pristine world where adorable bird creatures enjoy the views, the crisp air, and a fairly un- meddled with life. <br/></p>\n<p>That is, of course, until a group of settlers arrive on this quiet world. You and your fellow settlers have little to complain about-the world has ideal conditions for human life. The planet is peaceful, and yet…</p>\n<p>There is a void in your new lives that needs to be filled. An emptiness in the soul that desires to be whole. It’s pets. </p>\n<p><strong>A wild gryff appears!</strong></p>\n\n<p>These creatures are cute, cuddly, and friendly. Everyone wants one, but they all look the same. Who can tell which gryff belongs to you, and which gryff belongs to Lucy? Luckily you brought a solution with you to the planet- the technology to resequence the genome!</p>\n<p>And of course, you set about doing what any human does when they come across anything that has yet to be meddled with. You set off meddling.</p>\n\n<p><strong>Your guide to meddling:</strong><br/></p>\n\n\n\n\n\n\n<p>Parts of meddling that might be... meddlesome</p>\n<p>These would, of course, be the bugs. Plain and simply, sometimes things don't work like they should. This list is probably non-exclusive. I apologize.</p>\n<ul><li>the genes don't always snap to the gene sequencer (but still function at least)</li><li> sometimes genes won't move  out of the gene sequencer (this can usually be remedied by clicking the Reset Genetic Sequence button)</li><li>sometimes a gene is still stuck in the gene sequencer after resetting the sequence...</li><li>resizing the screen is a bad idea</li></ul>\n\n<p><strong>Credits</strong></p>\n<p>This game was drawn, programmed, and designed by Kyria Inked.</p>\n<p>All audio was created by Kyle Wynn @kylethewynner.</p>\n<p>This description page was made by conscripting many close friends for assistance.</p>\n<p>And it was all done in less than 7 days! Enjoy~</p>", "metacritic": null, "released": "2020-09-26", "tba": false, "updated": "2020-09-28T04:20:57", "background_image": "https://media.rawg.io/media/screenshots/16b/16b2b8eee9894f615fb4b22c0af3ca7c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 71, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Nighttsong"], "genres": [], "publishers": [], "esrb_rating": null}