{"id": 49866, "slug": "call-of-duty-2-big-red-one", "name": "Call of Duty 2: Big Red One", "name_original": "Call of Duty 2: Big Red One", "description": "<p>Call of Duty 2: Big Red One is a historical-military first-person shooter developed by Treyarch and published by Activision for the Xbox, PlayStation 2, and GameCube on November 1, 2005. It is the last game in the series released on the GameCube.<br />\nThe second console spin-off of the Call of Duty series (after Call of Duty: Finest Hour), Big Red One is the first game in the series developed by Treyarch (during acquisition of Gray Matter, which developed the first game&#39;s expansion) and was released in tandem with the second main installment (Call of Duty 2).<br />\nUnlike most other games in the series, Big Red One focuses on only one Allied soldier (American Sgt. Roland Roger of the 1st Infantry Division) throughout numerous World War II operations in North Africa and Western Europe. Similar to Finest Hour, the PS2 and Xbox versions of the game feature online multiplayer.<br />\nUnique to this installment is the direct military footage used in certain cutscenes (from the Military Channel, with voiceovers by Mark Hamill) and the voicework of several actors from the Band of Brothers miniseries. The PS2 and Xbox versions were also released in a special Collector&#39;s Edition, featuring a bonus behind-the-scenes DVD and four exclusive character skins for multiplayer mode.</p>", "metacritic": 77, "released": "2005-11-01", "tba": false, "updated": "2024-04-23T14:49:08", "background_image": "https://media.rawg.io/media/screenshots/46d/46dffc5eb7d84cf393aa939eddc43cd2.jpg", "website": "", "rating": 3.9, "rating_top": 4, "added_by_status": {"yet": 13, "owned": 24, "beaten": 54, "toplay": 11, "dropped": 8, "playing": 5}, "playtime": 0, "achievements_count": 0, "ratings_count": 38, "suggestions_count": 598, "game_series_count": 29, "reviews_count": 39, "platforms": ["PlayStation 2", "Xbox", "GameCube"], "developers": ["Treyarch", "Gray Matter Interactive"], "genres": ["Shooter"], "publishers": ["Activision Blizzard", "Activison", "Konami"], "esrb_rating": null}