{"id": 49874, "slug": "pillars-of-eternity-ii-deadfire", "name": "Pillars of Eternity II: Deadfire", "name_original": "Pillars of Eternity II: Deadfire", "description": "<p>Pursue a rogue god over land and sea in the sequel to the multi-award-winning RPG Pillars of Eternity. Captain your ship on a dangerous voyage of discovery across the vast unexplored archipelago region of the Deadfire. Bend the world to your will, as you explore the depths of infinite possibilities, including detailed character customization, total freedom of exploration, and more meaningful choices at every turn.<br />\n•   Immerse yourself in a deeper single player RPG game experience - enriched with cutting edge technology and features, Deadfire builds on the foundation of classic D&amp;D gameplay with vastly improved graphics, deeper game mechanics and a whole new hand-crafted adventure where choices truly matter.<br />\n•   Discover the new region of the Deadfire – plot your own course by ship and explore the rich and exotic islands of the archipelago region, discovering new places interacting with their inhabitants and engaging in a variety of quests at every port.<br />\n•   Build your party and customize your companions – choose from 7 different companions to join you on your quest and assign multiple classes and deeper abilities for each. Witness their personal relationships and interactions unfold with the addition of the new companion system.<br />\n•   Captain your ship across the seas – as your stronghold on the seas, your ship is much more than simply a vessel for exploring.  Upgrade your ship and crew and choose what skills you improve in order to survive dangerous encounters along the way.</p>", "metacritic": 82, "released": "2018-05-07", "tba": false, "updated": "2024-04-16T21:26:14", "background_image": "https://media.rawg.io/media/games/86b/86bea42bc14fb1f9cb76b44c4450cbab.jpg", "website": "https://eternity.obsidian.net/", "rating": 4.13, "rating_top": 4, "added_by_status": {"yet": 200, "owned": 1271, "beaten": 152, "toplay": 192, "dropped": 64, "playing": 36}, "playtime": 9, "achievements_count": 77, "ratings_count": 291, "suggestions_count": 509, "game_series_count": 1, "reviews_count": 298, "platforms": ["Xbox One", "Nintendo Switch", "macOS", "Linux", "PlayStation 4", "PC"], "developers": ["Obsidian Entertainment"], "genres": ["RPG"], "publishers": ["Versus Evil", "Obsidian Entertainment"], "esrb_rating": "Mature"}