{"id": 498785, "slug": "scarlet-hollow-episode-1", "name": "Scarlet Hollow: Episode 1", "name_original": "Scarlet Hollow: Episode 1", "description": "<p>You jolt awake as the bus hits a particularly nasty bump. You feel like you’d only just managed to start drifting off, and now here you are, awake again and still exhausted.<br/><br/>For a moment, you’re hazy on the details of where exactly 'here' is, confusing this bus with the many others that came before it. But as your mind continues to reassert its existence in the waking world, the past few days come back into focus. The long-lost cousin, the bad news, the twenty-six hours of bus rides with countless late-night stops in seedy depots that felt unsafe even in the middle of the day. You wouldn’t normally find yourself traveling like this, but your cousin bought the tickets. The funeral of her mother, your aunt, seemed like something you shouldn't ignore, even considering your own late mother’s rocky relationship with this side of the family.<br/><br/>Fortunately, the end of your long journey is in sight. You're almost in Scarlet Hollow.<br/><br/>~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~<br/><br/>Scarlet Hollow is a horror visual novel where your choices deeply matter. Hand-drawn backgrounds and sprites work together with a complex relationship system to bring to life an immersive world of charming (and terrifying) characters. Who lives, who dies, and the fate of an entire town rests on your shoulders.</p>", "metacritic": null, "released": "2020-09-25", "tba": false, "updated": "2020-09-28T05:05:28", "background_image": "https://media.rawg.io/media/screenshots/690/690c4328bea218cb3181d8fa6d41e16e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 344, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["AbbyHoward"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}