{"id": 49872, "slug": "guild-wars-2-path-of-fire", "name": "Guild Wars 2: Path of Fire", "name_original": "Guild Wars 2: Path of Fire", "description": "<p>Guild Wars 2: Path of Fire™ is the second expansion for the award-winning game, Guild Wars 2. As the balance of magic comes undone, lead your allies in the hunt for the rogue god Balthazar, whose scorched-earth campaign threatens the very existence of Tyria.<br />\nA DIVINE INSURRECTION<br />\nHumanity has worshipped the six gods for centuries, even as their prayers went unanswered. Now the god of fire and war, Balthazar, has made an unexpected return, only to reveal himself as a ruthless manipulator with little regard for mortal life.<br />\nTyria&#39;s heroes thwarted the first stage of his catastrophic plan to destroy the Elder Dragons—but now he&#39;s raised a zealous army to cut a path of terror and destruction across the south. You must halt their march before Balthazar sets the foundations of the world ablaze.<br />\nThe Forgotten Land<br />\nBalthazar threatens the Crystal Desert and adjoining kingdom of Elona with his Forged legions. Explore vast new maps filled with magic-drenched desert plains, ancient temples and ruins, and beautiful oases. Uncover the secrets of Tyria&#39;s history, and discover the fate of the Elonian people after years of silence.<br />\nMounts: A New Way to Explore<br />\nMounts are far more than a speed boost—they&#39;re a whole new way to explore the world of Tyria. Unlock and train your new companions using the max-level Mastery character progression system, and explore freely by leaping across canyons, bounding up high cliffs, and skimming over quicksand.<br />\nElite Specializations<br />\nContinue to evolve and customize your level-80 character with a new elite specialization for each profession. With a new variety of playstyles, weapon choices, and traits to choose from, there are more options than ever to play your way.</p>", "metacritic": null, "released": "2017-09-22", "tba": false, "updated": "2024-01-22T16:30:26", "background_image": "https://media.rawg.io/media/screenshots/116/11637f3a0c3db977f6fdb3af573e76fa.jpg", "website": "https://www.guildwars2.com/en/path-of-fire/", "rating": 4.39, "rating_top": 5, "added_by_status": {"yet": 6, "owned": 9, "beaten": 14, "toplay": 4, "dropped": 6, "playing": 7}, "playtime": 0, "achievements_count": 0, "ratings_count": 17, "suggestions_count": 605, "game_series_count": 0, "reviews_count": 18, "platforms": ["PC", "macOS"], "developers": ["ArenaNet"], "genres": ["RPG", "Massively Multiplayer"], "publishers": [], "esrb_rating": null}