{"id": 498818, "slug": "you-are-the-collectable", "name": "You are the Collectable", "name_original": "You are the Collectable", "description": "<p><strong>Prelude:</strong><br/></p>\n<p>We've all played strategy games<em> (if you are a degenerate like me then that would be gacha games)</em>. However we are all guilty of sending out our best soldiers into the battlefield avoiding our weakest options. So here's a taste of your own medicine. Have fun appeasing to the player in order for him to keep you on his roster. You better keep your performance up else another individual will rise over you. Maybe after this you'll appreciate the default characters more. Hehe..</p>\n<p>--</p>\n<p><strong>Themes:<br/></strong>Collectables: Instead of collecting objects or teammates <strong>you are the collectible</strong>. As the game progresses the player will <strong>collect other crewmates</strong>. You'll have to keep your performance up in order to stay on the roster. If you don't the player <strong>might select someone else over you.<br/></strong></p>\n<p>There and Back: Once you complete the third level Mikan will be unlocked. If the player selects her to be on the roster she will heal you and other team members. After a certain amount of time she will go <strong>there</strong> to heal other team members. But then she will come <strong>back</strong> to heal you. This process repeats until you die or complete the level.<br/><br/>--</p>\n<p><strong>Credits:<br/></strong></p>\n<p><strong>SkyanSam </strong>(Youtube) (Itch)<br/>Code &amp; Gameplay</p>\n<p><strong>Terranbyte</strong> (Youtube) (Itch) <br/>SFX Audio &amp; SFX Code</p>\n<p><strong>Prox</strong> (Newgrounds) (Itch) <br/>Music Track in game</p>\n<p>Nooh Alavi (Youtube) (Itch) (Twitch) <br/>Playtesting</p>\n<p>Unusual Autumn (Youtube) (Instagram)<br/>Playtesting<br/></p>\n<p>--</p>\n<p>Oh and look out for a video posted here on my process developing this game. Hopefully I'll get it done by the time rating is over. Until then I hope you enjoy the game!<br/></p>", "metacritic": null, "released": "2020-09-25", "tba": false, "updated": "2020-09-28T05:12:19", "background_image": "https://media.rawg.io/media/screenshots/b16/b16565dc14613825c780c487e845ec53.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 4, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["SkyanSam"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}