{"id": 499100, "slug": "then-and-now", "name": "Then and Now", "name_original": "Then and Now", "description": "[Might happen after the first loop of the game] If you can not grab items, please restart the entire game!\r\n[Might happen at random times] If you can not see what people are saying, please restart the loop by pressing 'R'!\r\n\n\n<p>In <strong>Then and Now </strong>you are stuck in a time loop with a few key moments happening around you. Figure out how you can make them work in your favor so you can stop the time loop and be free! Use anything you find and see how other characters react to them!</p>\n<p>This game is my submission to the VimJam! I made the game on unity, all of the assets (art - code - music - sound effects) are all made by me during the time of the jam (1 week)! The theme is \"<em>There and back</em>\" and the jam focus is \"<em>Collectables</em>\"!</p>\n<p>This game has controller support!</p>\n<p>font used: Poller One</p><p>Controls are on screen during gameplay so you don't have to memorize them, and here they are:</p>\n<strong>Action</strong><strong>Keyboard</strong><strong>Controller</strong>MoveWASD/ArrowsLeft Analog<br/>InteractEAUse itemQXDrop itemFBSwitch between Items1,2,3,4,5Lb/RbRestart LoopRY\r\nMeet, you!\r\n\n<p>Meet the protagonist of Then and Now, You!</p>\n<p>We don't really know how you got into the loop, but everyone in the village seems to see him/her/them/you as an outsider. Some people like that about you and other don't.</p>\r\nEaster Egg Hunt!\r\n<p>I love writing and I love placing easter eggs in places people aren't expecting! (No hidden rooms though)</p>\n<p>All of the NPCs are kicking around on a piece of ground in their home town.<br/></p>\n<p>If you love this kind of thing then here are two hints for you:</p>\n<p>Talk with everyone (and anything)</p>\n<p>Maybe people's names were intended ;) </p>\n\r\nFeedback\r\n<p>If you have the time, please let me know what you like and what you don't like about the game. Since I built everything in it, I would really love any comment about anything in the game. Let me know if you like the art, the music, the writing, if you've encountered any bugs!</p>\n<p>If you want to check out more stuff by me here's everything: https://linktr.ee/mickehh</p>\n<p>Thank you, I hope you enjoy the game!</p>", "metacritic": null, "released": "2020-09-25", "tba": false, "updated": "2020-09-28T06:16:54", "background_image": "https://media.rawg.io/media/screenshots/86c/86cdabc27ac813c04dbd29789c8640ec.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 36, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["Mickehh"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}