{"id": 499134, "slug": "legato", "name": "Legato", "name_original": "Legato", "description": "<p><strong>Note: </strong> I recommend using keyboard for this game, as controller tool tips aren't present. The puzzles in the game also require number buttons 1 through 5.</p>\n<p><em><strong>I also recommend playing with the downloadable version, as the web browser version is a tad bit buggy in terms of audio and visuals, which is a big problem for this game. </strong></em>However, it does seem playable for those who can't download the game.</p>\n\n<p><strong>Music is such an important part of our lives.</strong> It has the ability to move others, and let them experience emotions, simply through sound. This young boy has been obsessed with music and playing the piano, and wants to make a difference in the world through his joy of piano. In this game, you play as the young boy, and follow him in the emotional imagination that is his own music and song. <em>You take an entire journey to his dream, and then safely return back to the comfort of his own home.</em></p>\n<p>Also, the theme of this game was not taken super literally. Keep in mind when you finish a puzzle, you can continue down the path. You don't have to go back from where you came.</p>\n<p><em><strong>Controls</strong></em> are explained in the game for the most part, but for those who want to use a combination of controller for movement and keyboard for the actual piano, here are those:<br/></p>\n<p><strong>Movement: </strong> A and S <strong> OR </strong> Left Stick Left and Right<br/></p>\n<p><strong>Jump: </strong> W <strong>/ </strong>Space Bar <strong> OR</strong> Controller A<br/></p>\n<p><strong>Crystal Listen/Music Staff (White) Door Open: </strong>  E <strong> OR </strong> Controller X<br/></p>\n<p><strong>PIANO: </strong><em>(number keys) </em> | 1 | 2 | 3 | 4 | 5 |</p>\n\n<p><strong>I also really just want to give both Vimlark and the 8-Bits to Infinity Community a big thank you for such an amazing jam. I'm stoked to see what everybody else made, and I'm hoping you all will enjoy my game as well!</strong></p>\n\n<p><strong>Twitter: https://twitter.com/SGruntled</strong></p>\n<p><strong>Youtube: https://www.youtube.com/channel/UCIzce-d35l1aVbZpDM8jNYQ</strong></p>\n<p><em>**If you are experiencing trouble with the browser version of the game, a .exe file of the game is also accessible through a download.**</em><br/></p>", "metacritic": null, "released": "2020-09-25", "tba": false, "updated": "2020-09-28T06:24:34", "background_image": "https://media.rawg.io/media/screenshots/dc4/dc4f125a0bb6cc157e030f0389ee02f3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 75, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux", "Web"], "developers": ["StraightUpGruntled"], "genres": ["Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}