{"id": 499288, "slug": "death-tales", "name": "Death Tales", "name_original": "Death Tales", "description": "<p>Embark on an adventure as a new Reaper who has gone rogue! Collect equipment and spells, learn powerful attacks against hordes of enemies, complete quests for a cast of quirky characters, and make difficult choices in this grim yet richly illustrated 2D world. Play alone or with a friend in local co-op and serve Death together!<br />\nOver 40 pieces of Equipment for you to acquire to customize your Reaper and aid you in battle! Find equipment in a variety of well hidden chests, or use the souls you collect as currency to buy items from the local vender, Fiona. Be sure to check back every day, as her inventory changes! Mix and match armor and harness the power of the unique skills such as fireballs, the ability to freeze enemies, angel wings allowing you to glide to safety, summon meteors from the sky and even stampeding unicorns!<br />\nJoin forces with a friend locally. While in local play, Player 2 plays as Spaura, the Reaper’s Soul Bearer.  Online co op will be coming soon in the next months where each player can play as their customized Reaper.<br />\nBattle your way through 30 beautifully designed levels, help colorful characters through various side quests, and fulfil your reaper duties by collecting souls for Death. Daily bounties are available from various npc&#39;s.<br />\nCollect equipment, learn spells, and advance as a Reaper to take on horrid enemies, and defeat epic bosses.</p>", "metacritic": null, "released": "2020-10-01", "tba": false, "updated": "2022-08-20T07:57:17", "background_image": "https://media.rawg.io/media/screenshots/2c4/2c4bcff25ee66f32ad74e91818ad11ef.jpg", "website": "http://www.plagueuniverse.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 29, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 450, "game_series_count": 0, "reviews_count": 2, "platforms": ["PlayStation 4", "PC"], "developers": ["Arcade Distillery"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Arcade Distillery"], "esrb_rating": null}