{"id": 499290, "slug": "htd", "name": "HTD", "name_original": "HTD", "description": "HTD is a mix of classic party-based RPG and fast-paced, real-time action. Take control of a party consisting of a healer, tank, and damage dealer, each of whom excel to an extreme level in their specific role, but fall short in others.<h3>UNIQUE PARTY-BASED ACTION</h3>The burly <strong>DPS</strong>, with a big sword and a lack of armor, is capable of dishing out extreme damage - enough to defeat most bosses in a few blows, under the right conditions. However, they can only stand a few hits, and require sufficient openings to deal maximum damage.<br/><br/>The steel-clad <strong>Tank</strong>, a heavily-armored juggernaut with a heavier shield, is able to safely nullify damage and has an extreme health pool. However, they have no form of attack whatsoever.<br/><br/>And the mysterious <strong>Healer</strong>, with staff and tunic, can rapidly restore the party's HP, mend their equipment, and revive fallen allies. However, they are sorely lacking in both defense and offense.<h3>BRUTAL &amp; SATISFYING FAST-PACED COMBAT</h3>Each party member must be mastered and utilized to their full potential in order to overcome the myriad brutal foes in HTD. Rapidly cycle through party members, parry and interrupt enemy attacks, weave in healing and repairs, and stun your enemy long enough for the DPS to charge a fatal blow, all while weathering the onslaught of your hellish adversary.<h3>NIGHTMARISH BOSSES AND BIZARRE HORROR</h3>Do battle with over 15 fully animated and unique adversaries, each with their own quirks, strategies, surprises, and horrific design. Delve into horror by discovering secret levels that take you into the dark, forgotten recesses of the land, where eldritch nightmares push your party's skills - and sanity - to their limits.<h3>IMPACTFUL, GAME-CHANGING LOOT</h3>Each adversary you defeat grants you the choice of multiple pieces of loot to boost your party, each with interesting effects and drawbacks, and some unlocking powerful new abilities. Choose your items to support your play-style, complementing your strengths and alleviating your weaknesses.<h3>DARK, COMPELLING STORY</h3>Uncover the secrets of the land, the apocalyptic Great Contortion, and your very own party members as you venture through a story rife with mystery. Meet with various strangers along your quest, some helpful, some hindering, and learn what truly motivates your party as you guide them toward their final fate at the Northern Cliffs.", "metacritic": null, "released": "2020-10-01", "tba": false, "updated": "2020-10-02T02:09:28", "background_image": "https://media.rawg.io/media/screenshots/1ab/1ab7d4263e3ba429e520db94a0985b6b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 237, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["D-Tarrow"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["D-Tarrow"], "esrb_rating": null}