{"id": 499277, "slug": "wen-yi-zhan-zheng", "name": "瘟疫战争", "name_original": "瘟疫战争", "description": "go all over the world to develop antidotes to eradicate all viruses and save the world<br/><br/><br/><br/><br/>Four kinds of viruses have broken out all over the world. As a disease control expert, you will set up an elite team to develop the antidotes for these four kinds of viruses in time. Go all over the world to control the spread of the virus and save the world.<br/><br/><br/><br/>\"The plague war\" is a simulation game. Players will choose your team members from multiple classes. In each round, you can move, cure viruses, exchange hands and so on Through teamwork, the virus will be completely eradicated. With the promotion of the game, more and more cities will be infected, especially those cities that have been plagued, and will be more likely to have large-scale diseases. We must develop the antidote before the virus destroys human civilization. The task of saving the world is up to you!<br/><br/><br/><br/>Game features:<br/><br/><ul> <li> simulate the outbreak of virus in major cities around the world, so that players can experience the hardships of front-line workers personally <ul><ul> <li> 5 different roles, corresponding to various occupations of front-line work, each role has its own professional characteristics skills [/ list]<br/><br/><ul> <li> can control 2-4 characters to form a team at the same time, and make actions in each round according to the character's hand [/ list]<br/><br/><ul> <li> hand management, player's position and team composition will test player's control of the situation [/ list]</li></ul></li></ul></li></ul></ul></li></ul>", "metacritic": null, "released": "2020-10-01", "tba": false, "updated": "2020-10-02T02:03:12", "background_image": "https://media.rawg.io/media/screenshots/e3c/e3cbcbb690af269a1ee655f895b22d7c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 180, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["幻梦游戏"], "genres": ["Strategy", "Simulation", "Casual", "Indie"], "publishers": ["幻梦游戏"], "esrb_rating": null}