{"id": 499276, "slug": "zhong-guo-shi-80hou-the-chinese-80s", "name": "中国式80后(The Chinese 80s)", "name_original": "中国式80后(The Chinese 80s)", "description": "\n<br/>\r\nThis is a game to simulate the life of the post-80s primary school in China. We try to show those unforgettable years in the form of games.<br/>\n<br/>\n<br/>\n<br/>\r\nDaily event system<br/>\n<br/>\r\nThat green years, is there a lot of unforgettable memories. Whether it's sleeping in class, playing with classmates, being scolded by parents for failing the exam, and sharing favorite toys with classmates. All these constitute your unforgettable primary school life. In order to reproduce that time, we have prepared a lot of events, dialogues, and strive to be able to make some ripples in your memories.<br/>\n<br/>\n<br/>\n<br/>\r\nLikability system<br/>\n<br/>\r\nA large number of NPC characters have their own unique character and rich event lines. Hope that players can feel the emotional temperature of each character. With the improvement of liking level, players will experience the unique event line of each NPC and experience the psychological activities of NPC. Finally, get rich rewards.<br/>\n<br/>\n<br/>\n<br/>\r\nCombat system<br/>\n<br/>\r\nWhether the compatriots of the post-80s have experienced the robbery, and whether they thought about resisting at that time. Relying on the card system, we have designed a unique combat system. Let's complete our wish in the game and educate these bad teenagers.<br/>\n<br/>\n<br/>\n<br/>\r\nExamination system<br/>\n<br/>\r\nAlso relying on the card system, we developed the examination system, fully considering the randomness of the examination, so that strength and luck coexist, get high scores, and become the brightest kid in the class. Become a good student that teachers like and parents are proud of.<br/>\n<br/>\n<br/>\n<br/>\r\nRich props system<br/>\n<br/>\r\nHua Huadan, Da dajuan, figs, these familiar names, will appear in our game in the form of props, hoping to bring a touch to the players and let them feel the temperature of our game.<br/>\n<br/>\n<br/>\n<br/>\r\nCard system<br/>\n<br/>\r\nCards are divided into passive, combat and test cards. Players can get these cards through reading, time and communication. At the same time, it is full of the fun of collection.<br/>\n<br/>\n<br/>\n<br/>\r\nNostalgic scenes<br/>\n<br/>\r\nA large number of exquisite scenes, together with hand-painted original paintings, are beautiful and nostalgic. We hope to bring China in the 1990s to the players again and restore that unforgettable time.<br/>\n<br/>\n<br/>\n<br/>\r\nAll kinds of people<br/>\n<br/>\r\nWith stylized character design and modern clothing, there may be a person you can't forget, who can find his or her shadow in the game.<br/>\n<br/>\n<br/>\n<br/>\r\nUnique growth system<br/>\n<br/>\r\nTalent with growth level, create a unique growth system in the game. Players are free to control their own development direction, thus affecting the process of the game. It's up to you whether you want to be a master of learning, a master of sports, or an all-round development.", "metacritic": null, "released": null, "tba": false, "updated": "2020-10-02T02:02:48", "background_image": "https://media.rawg.io/media/screenshots/ed8/ed875f5acd76db1757870d7ac88b0676.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 310, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["zeroplaystone"], "genres": ["RPG", "Strategy", "Casual", "Indie"], "publishers": ["zeroplaystone"], "esrb_rating": null}