{"id": 499345, "slug": "golf-skies", "name": "Golf Skies", "name_original": "Golf Skies", "description": "Golf Skies is a delightful 2D golf game with smooth gameplay and lots of fun twists - You play golf up in the sky where the course is made out of golf planets with their own gravitational fields and obstacles. There´s another  innovative mechanic too, right after you shoot the ball you are able to steer it and race all the way to the green for a hole in one - as long as you have stamina left!<br/><br/>Immerse yourself in a meditative golf experience in the skies with fairways, rough, bunkers, trees, water obstacles, windmills, lighthouses and much more. And birds, did I mention birds? There are loads of them there just to make your day bright and relaxing.<br/><br/>Collect coins and power-ups to gain extra air control, and then use the coins in the golf shop to upgrade to even faster golf balls with more stamina, or use them to unlock new challenging golf courses.<br/><br/>Make more birdies and eagles than ever before!<br/><br/>Compete on the leaderboards for the best score and time.  <br/><br/>FEATURES<br/>- 6 beautiful and challenging golf courses<br/>- Golf planets with their own gravitational fields<br/>- Smooth controls and ability to steer the ball during the flight<br/>- Taptic feedback for supported devices.<br/>- Upgrade golf balls with the coins you collect<br/>- Power-ups such as magnets and infinite stamina. <br/>- Leaderboards for best scores and best time for all golf courses<br/>- Free game with ads, and option to buy and remove ads<br/><br/>HOW TO PLAY <br/>1. Pull and release to shoot the golf ball.<br/>2. Steer the ball by pressing left and right side on your display. (Using thumbs with both hands is the recommended grip)<br/>3. If you run out of stamina, you will lose all air control. <br/><br/>Now it's your time to tee off, have a cheerful golfing experience, excellent golf player!  <br/><br/>IMPORTANT<br/>Golf Skies is totally free to download and play. However, there are some in-app purchases available for real money. It´s easy to turn off this feature in your device settings if you don´t want this feature.", "metacritic": null, "released": "2020-09-23", "tba": false, "updated": "2020-10-02T02:39:54", "background_image": "https://media.rawg.io/media/screenshots/b2e/b2e710a7a43b726690b1a67a3b673671_TmHpvKp.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 33, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Carl Oberg"], "genres": ["Sports", "Casual"], "publishers": ["Carl Oberg"], "esrb_rating": "Everyone 10+"}