{"id": 499371, "slug": "700-solitaire-games-pro", "name": "700 Solitaire Games Pro", "name_original": "700 Solitaire Games Pro", "description": "Get all classic solitaire card games and more than 700 new games to try. All in one incredible pack!<br/>------------<br/>Love card games? Want to play the best of all card games - Solitaire games or different variations such as the Pyramid Solitaire game, Spider Solitaire game, Free Cell, Classic Solitaire (Klondike) or any other solitaire game? Here is an app that has a collection of 700 Solitaire Games in one single app. Jump into every variant of single player card games with the \"700 Solitaire Games\"! Download 700 Solitaire Games and start organizing decks, discovering new ways to have fun, and game your way with different card games - the best of all Solitaire Card Games.<br/><br/>700 Solitaire Games delivers on a very simple promise. This unique \"700 Solitaire Games\" app offers you access to hundreds of different single player card games in a single package. Regardless of whether you like classic solitaire or a unique variant most gamers haven’t even heard of, we have it - all rendered in vibrantly colorful graphics, smooth animations, and seamlessly effective controls!<br/><br/>Solitaire on the iPhone and iPad has always been available, but it has never been this exciting or this well delivered! 700 Solitaire Games is a completely well rounded application. This game features flexible user setting options, background and deck designs to choose from, as well as intuitive statistics and scoreboard options to ensure that competitive gamers and casual players alike see exactly how they’re playing every game in this package with ease.<br/><br/>**************************<br/>GAME FEATURES<br/>**************************<br/>Still looking for features that make \"700 Solitaire Games\" the best choice of game collection apps among all other solitaire games? Here are features that make it incredible -<br/>-\t700 solitaire card games<br/>-\tAll classic solitaire games: Freecell, Klondike, Spider Solitaire, Pyramid Solitaire and much more<br/>-\tDesigned for both iPhone and iPad devices<br/>-\tSupport for portrait and landscape orientations<br/>-\tSingle game and journey play modes<br/>-\tBeautiful Background images &amp; Background colors for card board<br/>-\tCustomize the playing cards’ back images<br/>-\tDetect when no moves remain<br/>-\tFavorite and hidden games folders<br/>-\tGame filters<br/>-\tShow all available moves<br/>-\tUnlimited undos/redos<br/>-\tSave/load game<br/>-\tAuto-resume last game<br/>-\tDrag 'n' drop/single touch play modes<br/>-\tAuto-jump to foundations<br/>-\tDetailed statistics<br/>-\tInternet and local scoreboard<br/>-\tKnow the game rules to learn different solitaire games<br/>-\tAll classic games included: Free Cell, Klondike, Pyramid, Spider, Yukon, Forty Thieves<br/>-\tLeft-handed layout option<br/><br/>Spider Solitaire is an addictively fun and enticing card game. Learn how to play spider solitaire or the pyramid solitaire games in the ‘700 Solitaire Games’ app. Get '700 Solitaire Games', get gaming and join the next revolution of digital fun today!<br/><br/>700 Solitaire Games is for you if like:<br/>- single / solo player games like sudoku, mahjong, puzzles<br/>- multiplayer, board and family games like chess, dominoes, backgammon, reversi, poker, blackjack, checkers (draughts, dame), dice games<br/><br/>Privacy Policy:<br/>http://www.mobarts.net/ma/privacy_policies/solitaires-pro.html<br/><br/>Terms of Use:<br/>http://www.mobarts.net/ma/terms_of_use/solitaires-pro.html", "metacritic": null, "released": "2020-09-02", "tba": false, "updated": "2020-10-02T02:51:37", "background_image": "https://media.rawg.io/media/screenshots/c1c/c1cca786394fe932ed855b2965ae62f2_iyFA7ao.jpg", "website": "http://www.mobarts.net", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 86, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["MobArts"], "genres": ["Card", "Puzzle"], "publishers": ["MobArts"], "esrb_rating": "Everyone 10+"}