{"id": 499339, "slug": "gi-joe-operation-blackout", "name": "G.I. Joe: Operation Blackout", "name_original": "G.I. Joe: Operation Blackout", "description": "<p>To play this game on PS5, your system may need to be updated to the latest system software. Although this game is playable on PS5, some features available on PS4 may be absent. See PlayStation.com/bc for more details.<br />\nG.I. Joe and Cobra are back! G.I. Joe: Operation Blackout is a  team-based third- person shooter where you play as your favorite characters from Team G.I. Joe and Team  Cobra. Experience the action from both sides as you help G.I. Joe restore order and lead Cobra to world domination. Continue the fight with all new characters and weapon skins and get exclusive access to the art and music from the game!<br />\nG.I. JOE VS COBRA - Play with 12 of your favorite characters from both sides including Snake Eyes, Duke, Roadblock, Storm Shadow, Cobra Commander, Destro and more in 4-player PvP and across 17 epic campaign story missions.  Includes voice acting for over 20 iconic characters in the G.I. Joe universe.<br />\nCOMBAT TOOLS - Fight for your side with 18 awesome weapons, 36 weapon skins, 12 alternate character skins and a series of uniquely devastating ultimate abilities.<br />\nLEGENDARY FRANCHISE - Take control of the iconic G.I. Joe Persuader and Cobra H.I.S.S. tanks in your battle across classic locations like the USS Flagg and Cobra Headquarters.<br />\nCO-OP &amp; PVP MULTIPLAYER - Play the campaign with a friend in local co-op, or compete in 4-player PvP local matches in 4 Multiplayer Modes: Capture the Flag, Assault, King of The Hill, and Deathmatch Arena.<br />\nDigital Deluxe Edition Includes:<br />\nClassic Duke &amp; Classic Cobra Commander Character Pack - Two new characters skins based on the iconic 80’s TV series!<br />\nBattle Gear: G.I. Joe and Cobra Weapons Pack - Includes 12 new weapon skins in Cobra Gold and G.I. Joe Chrome.<br />\nExclusive Digital Art Book - Get a look at the never-before-seen art used to create the game.<br />\nDigital Soundtrack - Full length music tracks from game plus bonus tracks from the 80’s TV series.<br />\nOffline multiplayer (2-4 players)<br />\nUses DUALSHOCK 4 vibration function<br />\nEnhanced game play on PS4 Pro console<br />\nOffline play enabled<br />\nOnline features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy).<br />\nSoftware subject to license (us.playstation.com/softwarelicense).<br />\nOne-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.</p>", "metacritic": 55, "released": "2020-10-13", "tba": false, "updated": "2022-06-16T05:41:57", "background_image": "https://media.rawg.io/media/games/da8/da83e0f6e6da48e26a21a0e6c6a9944c.jpg", "website": "https://gijoeblackout.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 44, "beaten": 1, "toplay": 4}, "playtime": 24, "achievements_count": 173, "ratings_count": 0, "suggestions_count": 422, "game_series_count": 14, "reviews_count": 0, "platforms": ["PC", "Xbox One", "PlayStation 4"], "developers": ["IguanaBee", "Fair Play Labs", "GameMill Entertainment"], "genres": ["Action", "Shooter"], "publishers": ["GameMill Entertainment"], "esrb_rating": "Teen"}