{"id": 499300, "slug": "carestia", "name": "Carestia", "name_original": "Carestia", "description": "<h3>Carestia</h3><br/>Human kind has discovered a very rare crystal capable of providing huge amounts of power. With a lot of advancements in technology, daily life was surrounded with helpful robots and inventions. One day, unfortunately, all those technology became self-aware and decided that the human kind was not well fitted for Earth. Some people escaped to an artificial planet, where they live their lives dreaming of one day going back to Earth.<br/><br/>You have been born on that artificial planet and trained from your very first days until now to overcome any problems you may face. You are a soldier of the New Day. A special force assembled to take Earth back.<br/><br/>Now it's time to put all that training into test. Your grand master demands your assistance into entering an underground fortress and stealing one of that power crystals. That will leave the fortress in a vulnerable state, making way to further reinforcements to establish a base of operation on Earth.<h3>Gameplay</h3><br/>Carestia is a mix of intriguing puzzles and precise action battles into a 2D side scrolling platformer. You will go from moments of thinking to solve and overcome the puzzles to moments of fast reactions to defeat a boss.<br/><br/><br/>The puzzles uses an energy mechanism that will make you use the right items to wire everything in order to proceed.<br/><br/><br/>You can customize your character!<br/>", "metacritic": null, "released": null, "tba": false, "updated": "2020-10-02T02:13:59", "background_image": "https://media.rawg.io/media/screenshots/b76/b76dab7daea09cdd6998a5563a29e5ec.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 113, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["River Stone Games"], "genres": ["Action", "Adventure", "Strategy", "Indie"], "publishers": ["River Stone Games"], "esrb_rating": null}