{"id": 499332, "slug": "costume-kingdom", "name": "Costume Kingdom", "name_original": "Costume Kingdom", "description": "Costume Kingdom is a Halloween themed turn based action-adventure game set in a open world environment and played from a third-person perspective. The player takes on the role of “Rain” a young child on a quest to beat the Apex Cup while unknowingly saving Halloween.<br/>The Apex Cup is a competition held on Halloween night where the children of Monkchester use their Hallowmon in a tournament to see who is the champion!<br/> Build your team of Hallowmon and trick-or-treat your way through the breathtaking Monkchester. It is essential to collect costumes &amp; complete quests to unlock mystical abilities that will aid you in defeating Pineapple &amp; saving Halloween, This is a holiday experience that will warm the hearts of adults and children alike.<br/><br/><strong>KICKING OFF THE CANDY-COLLECTING BONAZA</strong><br/><br/>Discover a vast roster of secrets throughout your journey to unlock many special in-game prizes which are only seen by players that go the extra mile to collect everything within the game!<br/><br/><br/><strong>BUILD YOUR CAST OF HALLOWMON</strong><br/><br/>Meet and beat a vast cast of amusing characters &amp; Hallowmon brought to life throughout Costume Kingdom, Expect to laugh and maybe even cry along your journey to save Halloween.<br/><br/><br/><br/><strong>AWESOME ABILITIES &amp; UNIQUE MECHANICS</strong><br/><br/>Costume Kingdom is home to 11 unique abilities which over the course of the game you will learn to master and utilize, We also have implemented numerous unique mechanics for the player to enjoy such as a Trick or Treating mechanic, Dynamic Platforming sections, Fishing, Building your own HallowZoo and much more.<br/><br/><br/><br/><strong>JAW-DROPPING BATTLE SYSTEM</strong><br/><br/>Castle Costume currently has 3 unique and dynamic boss battles that are sure to keep you on the edge of your seat! Each boss is challenging but very rewarding and makes for some of the best moments in the title!<br/><br/><br/><br/><strong>BEAUTIFUL SOUNDTRACKS</strong><br/><br/>Composed by numerous industry legends with over a century of combined experience.<br/>", "metacritic": null, "released": "2020-10-01", "tba": false, "updated": "2020-12-11T02:35:41", "background_image": "https://media.rawg.io/media/screenshots/9a3/9a3fb9596d93021a741be7c3e22284dc.jpg", "website": "https://costumekingdomgame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 19, "ratings_count": 0, "suggestions_count": 368, "game_series_count": 0, "reviews_count": 0, "platforms": ["PlayStation 4", "PC"], "developers": ["Stratton Studios"], "genres": ["Action", "Adventure", "RPG", "Simulation", "Casual", "Indie"], "publishers": ["Stratton Studios"], "esrb_rating": null}