{"id": 499356, "slug": "dungeoning-epic-idle-rpg", "name": "Dungeoning: Epic Idle RPG", "name_original": "Dungeoning: Epic Idle RPG", "description": "Create a party of heroes, dungeon crawl &amp; loot in an incremental RPG. Tap your heroes through caves, level up in the dungeon and collect powerful RPG upgrades. See if your heroes can survive Dungeoning: Idle Dungeon Crawler, an epic incremental dungeon crawler.<br/><br/>This dungeon crawler will goad you into gargantuan caves of ghastly ghouls. You’ll have to crawl, upgrade equipment &amp; incremental skills to crawl deeper into dungeons &amp; caves packed with loot. Level up idle heroes to find treasure in a pixel dungeon, making sure your heroes have enough gear, health and items to survive a dungeon disaster.<br/><br/>Dungeoning: Idle Dungeon Crawler Features:<br/><br/>Crawl Through Dungeons<br/>- Caves &amp; Dungeons pack the landscape.<br/>- Each pixel dungeon is packed with elite monsters.<br/>- Engage in incremental boss battles!<br/>- Explore Dungeons in an epic cave crawler!<br/><br/>Battle Monsters<br/>- Battle monsters to collect rare loot &amp; enchants!<br/>- Reach the final cave and defeat fearsome foes!<br/><br/>Collect Resources: Build Your Party!<br/>- The Caves &amp; Dungeons are packed with collectibles! Collect them all!<br/>- Invest to Upgrade Your Heroes!<br/>- Find hidden loot and customize your heroes with the epic gear.<br/><br/>Incremental Action<br/>- Play as much or as little as you like!<br/>- Your heroes keep leveling up even when you are offline<br/>- Return to collect the loot and riches your heroes collected while you were away!<br/><br/>Lovers of dungeon crawlers and incremental RPGs won’t be able to put down this idle cave crawling game. Go on an epic quest, explore dungeons to battle monsters and defeat the tough dungeon bosses in Dungeoning: Idle Dungeon Crawler!", "metacritic": null, "released": "2020-09-03", "tba": false, "updated": "2020-10-02T02:44:13", "background_image": "https://media.rawg.io/media/screenshots/c61/c618fe21f0241db67af73fc52d22dc70_jQnOalm.jpg", "website": "https://www.godungeoning.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 310, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Gunslinger Studios"], "genres": ["RPG", "Simulation"], "publishers": ["Gunslinger Studios"], "esrb_rating": "Teen"}