{"id": 49933, "slug": "driveshaft", "name": "Drive//Shaft", "name_original": "Drive//Shaft", "description": "This game is great<br/>Just like its trailer<br/>It was made in one week<br/>The game, not the trailer<br/><br/>You drive really fast<br/>But it's hard to see<br/>You drive late at night<br/>So it's not easy<br/><br/>Your friends can play too<br/>It's a race to the ball<br/>Get there first for a point<br/>It's a fun time for all<br/><br/>So give Drive//Shaft a go<br/>There's no reason to wait<br/>It's only a dollar<br/>You're going to do greatDeveloper's Note<br/>Hi, I'm Alex Schearer the founder of Spotted Zebra Software. I've been making games for a while, but always in two dimensions. I wanted to learn how to make 3D games and decided that making a game a week was a good, challenging way to do so. <br/><br/>Drive//Shaft is my first week long game. You're driving a fast car late at night on a deserted island, and you're goal is to collect as many mysterious glowing orbs as possible. The problem is there are other people on the island, too, and they're all better drivers than you! Drive//Shaft is a simple game which is fun because driving fast at night is fun, and because physics based, online gameplay is fun.<br/><br/>I'm releasing Drive//Shaft for one dollar so people can join me in this crazy game-a-week adventure. If you'd like to share your thoughts, please leave a review or post to the Steam forums. If I get enough feedback I will improve the game based on what player's want.<br/><br/>Thanks for reading this; I really hope you enjoy the game!<br/>Alex Schearer - Spotted Zebra SoftwareGameplayDrive a fast car around a large island late a night. Compete against seven other players to reach the mysterious glowing orb first.ControlsOn keyboard: Use the arrow keys or AWSD to accelerate, brake, or turn.<br/><br/>On a gamepad: Use either joystick or the d-pad to turn. Use the triggers to accelerate and brake.Features<ul><li>Huge open world to drive around</li><li>Realistic car physics</li><li>Up to 8 players can compete on the same island</li><li>Beautiful, 3D environment and effects</li><li>Short, fun pick and play gameplay</li><li>In-game chat, just press enter and type your message</li></ul>", "metacritic": null, "released": "2017-11-30", "tba": false, "updated": "2019-08-28T22:03:42", "background_image": "https://media.rawg.io/media/screenshots/4fa/4fa5c81802a5be546b97602744051a0e.jpg", "website": "https://www.driveshaftgame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 8, "beaten": 1}, "playtime": 2, "achievements_count": 3, "ratings_count": 1, "suggestions_count": 101, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Spotted Zebra Software"], "genres": ["Action", "Sports", "Racing", "Indie"], "publishers": ["Spotted Zebra Software"], "esrb_rating": null}