{"id": 499440, "slug": "flockdown", "name": "Flockdown", "name_original": "Flockdown", "description": "<p>Flockdown was made in less than two weeks for Indicade's #JammingTheCurve game jam. It is a grid-based puzzle game in which the player attempts to stop a viral spread by moving healthcare workers toward the outbreak and keeping citizens away from it. Your goal is to keep your birds uninfected. It may not be so simple, however...</p>\r\nGameplay\r\n<p>Use actions to move birds with your cursor  one space at a time. After you run out of actions, they get replenished.</p>\n<p>Infected spaces spread active infection to each adjacent space, then become inactive.<br/></p>\n\n<p>Infected birds spread the virus to any space they move to.</p>\n<p>Win by making infected spaces inactive and keeping your green birds healthy!</p>\r\nCharacters\r\nEach uninfected normal bird counts toward<br/>your victory progress at the end of a game.<br/>Healthcare workers stop the spread by<br/>making each infected space they come<br/>into contact with inactive.Open businessbirds give you one<br/>additional maximum action each turn.<br/>\n\n<p>If you close their business (by pressing X over them), they stop the spread by killing any active virus on their space and preventing more from entering it.  Doing this costs one maximum action, though.  Open it up again to regain your lost action.<br/></p>\n<p>    </p>\r\nControls\r\nArrow keys<br/>Move cursor<br/>CPickup/Place Birds<br/>XClose/Open characters OR Pass if on an empty space<br/>ZUndo\r\nInspiration\r\n<p>Flockdown expresses the difficult choice between keeping business open to help the economy at risk of spreading infection adjacent to a gameplay mechanic similar to Pandemic’s main mechanic of virus spreading.</p>\n<p>Business characters play a vital role, giving the player one additional action to use every turn if they’re open and stopping the spread if they’re closed. Levels give the player difficult choices such as that of closing a business to save a group of citizens at the cost of the loss of a future action and that of moving one healthcare worker into the path of a virus in order to save another group.</p>\n<p>At the end of each level, the player is scored based on the percentage of citizens saved.</p>\r\nCredits\r\n<p>Designed and produced by Lionel (@onygox) and Munro (@MunroHoberman). Music by Antti Luode (@aluode).<br/></p>", "metacritic": null, "released": "2020-10-01", "tba": false, "updated": "2020-10-02T03:09:28", "background_image": "https://media.rawg.io/media/screenshots/001/001fe8ab772f86667317c69b5b491213.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 41, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Munro", "Onygox"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}