{"id": 499552, "slug": "sys_breach", "name": "SYS_BREACH", "name_original": "SYS_BREACH", "description": "<p><strong>In a world of robots with lasers and iron fists (literally), you are the mind of a human transported into one such entity. It's your job to destroy as many other robots as possible by invading their systems, and pave the way for a revolution.</strong></p>\n<p>There are three types of robot that you'll encounter:</p>\n<p>The <strong>Charger</strong>, who will throw short-range punches at you, then dash through you</p>\n<p><em>...though it's not very smart, and likes to get stuck in walls</em></p>\n<p>The <strong>Circler</strong>, who will shoot at you from a distance, then fire an exploding bullet</p>\n<p><em>...though it's pretty slow, and it's special bullet only explodes on walls</em></p>\n<p>The <strong>Sentry</strong>, who will fire at you from a distance, then unleash a torrent of lasers in a cone</p>\n<p><em>...though it can't move, and is an easy target</em></p>\n<p><strong>But be warned, with every kill you switch bodies, your mind passed on between systems (like a torch, perhaps?), and so you have to always consider the fact that you will never be the same for long. It's lucky you heal whenever switching, though.</strong><br/></p>\n<p><strong>Thus, it's now up to you. How long can you survive the <em>SYS_BREACH</em>?</strong></p>\n<p>This has been our first game jam, so any feedback is welcome <em>(expect many bugs)</em>. Thanks to Teknoaxe for the royalty free music we used.</p>\r\nMade for the<em> Weekly Game Jam 168: 'Pass the Torch'</em>", "metacritic": null, "released": "2020-10-01", "tba": false, "updated": "2020-10-02T03:32:16", "background_image": "https://media.rawg.io/media/screenshots/c4c/c4cda0a3642dc045a616ec1bd0d546e8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 52, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["WinstonWalrus", "mrk_OS"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}