{"id": 499583, "slug": "project-brawl", "name": "Project Brawl", "name_original": "Project Brawl", "description": "<p>Project Brawl is a fighting game that’s mainly inspired by the game Super Smash Bros by Nintendo. The goal is to knock out all other players and be the last one standing. The games are similar in the sense of core gameplay, 2D perspective and the feature of adding characters inspired by or taken directly from other gaming universes. The characters of Project Brawl are based on some classic arcade games that Futuregames provided us to work with, such as Pacman, Frogger, Bubble Bobble and Pong. Each character with unique mechanics and abilities reminiscent of respective game.<br/><br/>We believe that Project Brawl is most enjoyable on a couch together with friends, and that’s why we aimed to make the game as fun as possible while maintaining the old local co-op that we all used to love back in the day.  An important thing for us was making sure that the art style has a retro feel to it with some interesting twists so that you get arcade vibes the second you boot the game up.<br/></p>\n<p>\n</p>\n<p><strong>Note:<em><br/>Controllers are essential and four players are recommended.</em></strong></p>\n\n<p><strong>Project Brawl was developed in <em>Unity </em>in two weeks as a part of a game project at <em>Futuregames</em> a higher vocational education for game development in Stockholm, Sweden.</strong><br/><strong><br/>Credits:</strong><br/></p>\n<ul><li>Programming:\r\n<ul><li>Robin Ortryd</li><li>Fredrik Hanses</li><li>Johannes Kemppainen</li></ul></li><li>2D:<ul><li>Carl-Victor Norberg</li><li>Felix Ferm</li></ul></li><li>Music:<ul><li>Rasmus Hartonen</li></ul></li></ul>", "metacritic": null, "released": "2020-10-01", "tba": false, "updated": "2020-10-02T03:39:04", "background_image": "https://media.rawg.io/media/screenshots/25a/25a328263aac127201fe562f2dc59327.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 88, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Haesst", "Fredrik Hanses"], "genres": ["Action", "Fighting"], "publishers": [], "esrb_rating": null}