{"id": 49955, "slug": "rolling-line", "name": "Rolling Line", "name_original": "Rolling Line", "description": "<strong>Rolling line lets you take control of a huge, detailed model railroad in stunning virtual reality! Build, organize and drive trains in human scale, or explore the world on foot in miniature!</strong><br/><br/><br/><br/><br/>Build massive freight trains and follow passengers on scenic journeys, all though a diverse range of real-world inspired locations from the stunning south island of New Zealand!<br/><br/>Choose between driving trains through the intricately detailed world of this pre-built table top model railway or combine your own pieces of track and scenery to build your own journeys.<br/>The entire railway fits within one large workroom, with tons of surrounding free bench space for you to experiment with your own custom creations.<br/><br/><br/><br/>This railway is designed to look, feel and operate like a real hobbyists model railroad, with stylised switch boards to control the tracks, portable hand-held controllers to drive trains, and complete control over the rooms lighting.<br/><br/>Freely push wagons around on the rails with your hands to build up trains as long as you could possibly want, and take control of any number of different locomotives (using multiple controllers).<br/><br/><br/><br/>Switch between human-sized room scale and railway-sized miniature scale at any time, any where. You are not limited to only driving trains in miniature, but can fully explore the entire railway at the scale of a person. <br/><br/>Drive trains from right inside the cab in miniature, and view the world from the driver's perspective!<br/><br/>While in miniature scale you will experience dynamic time, weather and unique terrain and skyboxes that extend beyond the shape of the railway,<br/><br/><br/><br/>Choose between a range of locomotion options, including standard teleporting, grabbing the world around you to move yourself around, free directional movement with the trackpad and any other locomotion options suggested by the community that can be added!<br/><br/>Other options like manual rotation (if you cannot use room scale) and setting your player height help support a range of VR setups.<br/><br/><br/><br/><br/>Rolling line offers an immersive experience of both controlling a model railroad and driving trains from within the world itself. Whether you enjoy the diverse scenery of New Zealand, the joy of controlling model trains, the experience of a scenic railway journey or the freedom of building your own tracks and creations, then Rolling Line can deliver.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:03:42", "background_image": "https://media.rawg.io/media/screenshots/9a8/9a8760c16f27218650b9793da1c9bd83.jpg", "website": "http://www.gaugepunk.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 35, "toplay": 1, "dropped": 3}, "playtime": 1, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 214, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Gaugepunk Games"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["Gaugepunk Games"], "esrb_rating": null}