{"id": 499729, "slug": "color-me-killer-honeymouth", "name": "Color Me Killer: Honeymouth", "name_original": "Color Me Killer: Honeymouth", "description": "<p><strong>Do not play this game to hurt or trigger yourself! My work is for entertainment purposes only!</strong></p>\n<p><strong>This game contains themes of abuse, kidnapping, drugging, physical violence, and murder. Please be mindful of this before/while playing. Viewer discretion is advised.</strong></p>\n<p>After moving to a new neighborhood, a bike ride through the park lands you in the loving care of a very strange man.</p>\n<p>There are six possible endings!</p>\n<p><strong>Tools for Gameplay:</strong><br/></p>\n\n<p>The ripcord is located in the top right corner of the screen. It will be visible as long as the game is running, but is not located on any menu screen. Only within the game. If you feel uncomfortable or unsafe, click on the ripcord and you will be taken to this screen.</p>\n\n<p>You may choose to click through the prompts, close the game from this screen, or return to the game when you have calmed down by pressing the left facing arrow at the bottom. Please utilize this tool whenever you need it. And do not continue playing if you are distressed by the content.</p>\n\n<p>The menu buttons are located at the bottom right corner of the text box at all times. The left facing arrow rewinds dialogue.  The book icon displays dialogue history. The right facing double arrow skips through dialogue that has already been seen. The single right facing arrow automatically advances through dialogue for you. The floppy disk icon opens the save menu. The down facing arrow quick saves your game without taking you to the save menu. The ascending arrow quick loads from a save point without taking you to the save menu. The box icon takes you to the preferences menu, where you may adjust music volume, text speed, and auto-forward time.</p>\n<p><strong>You can contact me here with any questions or comments!</strong></p>", "metacritic": null, "released": "2020-09-30", "tba": false, "updated": "2020-10-02T04:13:13", "background_image": "https://media.rawg.io/media/screenshots/715/715809a28ba9805fd57102d75726e2da.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["derek"], "genres": [], "publishers": [], "esrb_rating": null}