{"id": 49973, "slug": "totally-realistic-sledding-vr", "name": "Totally Realistic Sledding VR", "name_original": "Totally Realistic Sledding VR", "description": "<strong>Totally Realistic Sledding is the most totally realistic sledding simulator out there for VR!</strong><br/><br/>It's fast and exciting. Jump off high cliffs, slide off ramps beneath beautiful sunsets, have heart pounding close shaves with dangerous obstacles and other wacky stuff that our childish minds have come up with. Sounds exhilarating doesn’t it?Features:<ul><li>Destructibles everywhere. See that tree stopping you? Bash it out of the way with your sled.<br/></li><li>Totally realistic physics<br/></li><li>Experience your inner child - look for easter eggs and secrets</li></ul>Humour aside, we have looked at the marketplace and at the moment we know that the other snow themed VR games like ours out there simply do not have enough content and replayability. We believe Totally Realistic Sledding VR will change this, and fill the void in the marketplace. Regular updates will be made and a lot of content eventually added.Development Roadmap:<strong>Totally Realistic Sledding</strong> will be developed on Early Access. This is so we can integrate the players into the development process to make the game better. We will make major updates roughly every half to two months. Minor updates such as bug fixes come out weekly. Our main goal is to make the game as replayable as possible.", "metacritic": null, "released": "2017-12-01", "tba": false, "updated": "2019-08-28T22:03:41", "background_image": "https://media.rawg.io/media/screenshots/89d/89d5271249551b1b71987a3528cd289d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 153, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Plectrum Software"], "genres": ["Action", "Adventure", "Simulation", "Racing", "Casual", "Indie"], "publishers": ["Plectrum Software"], "esrb_rating": null}