{"id": 499873, "slug": "no-papel-20201", "name": "No Papel (2020/1)", "name_original": "No Papel (2020/1)", "description": "<p><strong>No Papel</strong> é um jogo linear com pouca narrativa que tem por objetivo despertar a curiosidade no jogador em design e produção de jogos. O jogo se passa nas anotações de uma estudante de design de jogos que adormece e em seu subconsciente acaba revisitando conceitos que lhe foram ensinados ou que leu em diversas referências.</p>\n<p>Para isso, No Papel baseia se muito nos ensinamentos contidos no livro Level Up de Scott Rogers, que é um produtor de jogos com grande carreira na indústria, e seu livro é uma das grandes referências para quem estuda o tema, bem como outras bibliografias.</p>\n<p>Com Id o personagem principal, imaginado por Kaavia, o jogador irá transpor diversas salas e coletar anotações cifradas sobre cada uma delas, que podem ser traduzidas caso termine o jogo pegando todas. O jogo segue um gameplay bastante comum aos jogos de plataforma e não apresenta inimigos apenas riscos e perigos que deverão ser evitados.</p>\n<p>Projeto de Graduação (TCC) do Curso Superior de Tecnologia em Jogos Digitais da Fatec São Caetano do Sul desenvolvido pelo aluno:</p>\n<ul><li>Pedro Henrique Emil Pinheiro Freme</li></ul>\n<p>E orientado pelos professores:</p>\n<ul><li>Prof. Me. Adilson Ferreira da Silva</li><li>Prof. MSc. Alan Henrique Pardo de Carvalho</li><li>Profa. Dra. Érika Fernanda Caramello</li><li>Profa. Dra. Raquel Silva</li></ul>\n<p>Período letivo: 2020/1</p>", "metacritic": null, "released": "2020-09-29", "tba": false, "updated": "2020-10-02T04:43:46", "background_image": "https://media.rawg.io/media/screenshots/b26/b267506ca81754def114fa20518b175b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 51, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jogos Digitais Fatec São Caetano do Sul"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}