{"id": 49997, "slug": "golem-gates", "name": "Golem Gates", "name_original": "Golem Gates", "description": "In a desolate land ravaged by ancient wars, you are the Harbinger, an outcast with the ability to manipulate and command nanites from ‘The Ash’– a leftover power manifesting itself in your barren world’s atmosphere. Ancient warrior machines spawn from Golem Gates while an unseen force compels you to take up arms. Wielding the power hidden within ‘The Ash’, you’ll battle the golems and unravel the mysteries surrounding their long-lost creators.<br/><br/>Golem Gates blends elements of real-time strategy (RTS) and card battle. Collect cards (called Glyphs) containing your forces and powers. Strategically weave them into a deck to prepare for battle, then create them on the field to defeat your enemies in fast-paced and highly tactical battles with streamlined management to keep focus on the action. Play singleplayer or multiplayer in local matches with bots, online matches with other players, single and co-op Survival, and a full single player campaign. (Campaign not available in Early Access)<br/><br/><ul><li><strong>Dynamic Diversity:</strong> Nearly 100 Glyphs provide the options for your strategy: Units, buildings, traps, buffs, debuffs, and sorceries. Create your own unique battle plan and counter your opponents'. Randomized drawing puts a slightly different spin on every battle - eliminating monotonous build sequences, rewarding deckbuilding skill and strategic planning in equal measure.<br/></li><li><strong>Streamlined Strategy:</strong> Build your forces and enhance them with Glyphs; no production or research buildings needed. Capture resources in King of the Hill style without dedicated gathering units. Keep your focus where it belongs: on the battle.<br/></li><li><strong>Fight Where You Have Sight:</strong> Glyphs can be played almost anywhere you have an existing presence. Add more forces to a battle to turn the tide, transform a scouting party into an army, place emergency defenses to respond to the enemy, or hide an outpost in a direction the enemy doesn't expect. The choices are yours, but beware: the enemy will do the same and with the right Glyph your forces can be destroyed as fast as they were created.</li></ul>", "metacritic": null, "released": "2017-12-07", "tba": false, "updated": "2019-11-19T17:59:56", "background_image": "https://media.rawg.io/media/screenshots/46a/46acc81c0d42bd6d1220e8474cbab257.jpg", "website": "http://www.golemgates.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 26, "toplay": 1, "dropped": 1}, "playtime": 1, "achievements_count": 79, "ratings_count": 3, "suggestions_count": 319, "game_series_count": 0, "reviews_count": 3, "platforms": ["Nintendo Switch", "PlayStation 4", "Xbox One", "PC"], "developers": ["Digerati Distribution", "Laser Guided Games"], "genres": ["Action", "RPG", "Strategy"], "publishers": ["Digerati", "Laser Guided Games"], "esrb_rating": "Everyone 10+"}