{"id": 49994, "slug": "street-heat", "name": "Street Heat", "name_original": "Street Heat", "description": "Surrender your senses to the ultimate top-down racing experience! Street Heat is an action-packed four-player party-piece enhanced by vibrant neon-noir visuals and a masterful ’80s soundtrack. Go bumper-to-bumper with three other racers as you screech around corners, hurtle over deadly jumps and floor it across busy train tracks in the race for the checkered flag. <br/>Pick your car and livery of choice and get racing against friends, strangers or AI within seconds. But beware: spin off the track’s edge or get obliterated by the trains and your race is over until the next round!Features•\t<strong>Fiercely competitive arcade racing:</strong> Trade paint as you push your competition off the track and scrape your way to first place in fast and frantic four-player races.<br/>•\t<strong>Flexible online multiplayer:</strong> Simultaneously take on friends and strangers both locally and online via matchmaking that supports multiple local players. <br/>•\t<strong>Challenging AI:</strong> Fancy offline tussles? Whether playing solo or with a friend or two, fill in the spare slots with AI racers and tweak their skill settings to ensure a competitive race every time.<br/>•\t<strong>Randomized hazards:</strong> With slippery oil slicks and deadly train carriages roaring through Street Heat’s twisting cityscapes, no two races are the same. And with no respawns available, every corner could be your last!<br/>•\t<strong>Rise up the ranks:</strong> Rack up the victories to unlock new cars and skins.<br/>•\t<strong>Tournament play:</strong> Participate in multi-race events where points are awarded for finishing positions, fastest laps and kills.<br/>•\t<strong>Track voting system:</strong> Everybody gets a say in which track’s up next via a post-race ballot.<br/>•\t<strong>Steam Achievements</strong><br/>•\t<strong>Steam Trading Cards</strong><br/>•\t<strong>Full controller support</strong><br/>•\t<strong>Steam Cloud support</strong>", "metacritic": null, "released": "2017-11-29", "tba": false, "updated": "2019-08-28T22:03:40", "background_image": "https://media.rawg.io/media/screenshots/8dd/8dd2091d3822e917d70ec503bdbffb3e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 32}, "playtime": 1, "achievements_count": 12, "ratings_count": 1, "suggestions_count": 240, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Astalo Games"], "genres": ["Racing", "Indie"], "publishers": ["PQube"], "esrb_rating": null}