{"id": 49991, "slug": "himeko-sutori", "name": "Himeko Sutori", "name_original": "Himeko Sutori", "description": "An unprovoked attack on a minor noble house sparks a fire that will engulf kingdoms.  Aya, the youngest daughter of House Furukawa, must find her way amid crumbling alliances and her family's questionable decisions.  The war rages on after its original aim becomes impossible and the innocent begin to lose their way.  If there is still a victory to be achieved, you the player must fight for it.<br/>\n<br/>\r\nLead House Furukawa's few remaining loyal soldiers into battle.  Forge new alliances and rally new troops.  Train your human troops in 20 unique character classes and fill your ranks with wolves, fairies, the undead, and your own mechanical creations, each with their own character classes.  Equip them all with hundreds of different items in limitless combinations.  Craft powerful new weapons to give them an edge in battle.  Organize your troops into lances, relying on your captains' leadership abilities and your troops' affinities to maximize their effectiveness in battle.  Order your lances in tactical turn-based combat to defeat your enemies in epic battles with hundreds of unique characters on each side.<br/>\n<br/>\r\nAnd that is just one possible adventure to be had in Himeko Sutori.  With the included campaign editor, you can make an infinite number of possible stories.  Use the powerful Kismet visual scripting tool to set up your campaign without writing a single line of code.  Or for the advanced modder, make entirely new games using Himeko Sutori as the base for your development.  Then share your campaigns for others to experience.<br/>\n<br/>\r\nCome experience Himeko Sutori.", "metacritic": null, "released": null, "tba": false, "updated": "2023-02-07T02:17:34", "background_image": "https://media.rawg.io/media/screenshots/dd2/dd239a734d5d022feee3fd4d7461c5d5.jpg", "website": "http://himekosutori.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 10}, "playtime": 1, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 328, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Rockwell Studios"], "genres": ["RPG", "Strategy", "Indie"], "publishers": ["Rockwell Studios"], "esrb_rating": null}