{"id": 499907, "slug": "catch-the-apples-luis_henrique_verissimo", "name": "Catch the Apples (Luis_Henrique_Verissimo)", "name_original": "Catch the Apples (Luis_Henrique_Verissimo)", "description": "<p>Description in english:</p>\n<p>Cath the Apples is a casual game inspired by an exercise where I should make rectangles appear on the screen to click on them. I started to get interested in the idea and started adding mechanics until I turned the study into a game.<br/>The object of the game is to click on the red apples to gain points and time. Rotten apples also appear on the screen and if you click on them, you will waste time.<br/>When losing a match, the player will enter his name. Your top ten scores will be in a highscore.<br/>Every player's score will be converted into coins for the player to buy different items in the in-game store and thus try to get higher scores.</p>\n<p>----------</p>\n<p>Descrição em português:<br/></p>\n<p>Cath the Apples é um joguinho casual inspirado em um exercício onde eu deveria fazer aparecer retângulos na tela para clicar neles. Comecei a me interessar pela ideia e fui adicionando mecânicas até transformar o estudo em um jogo.</p>\n<p>O objetivo do jogo é clicar nas maçãs vermelhas para ganhar pontos e tempo. Maçãs estragadas também aparecem na tela e se você clicar nelas, perderá tempo.</p>\n<p>Ao perder uma partida, o jogador digitará o seu nome. Suas dez melhores pontuações ficarão em um highscore. </p>\n<p>Toda pontuação do jogador será convertida em moedas para o jogador comprar itens diversos na lojinha do jogo e assim tentar conseguir pontuações maiores.</p>", "metacritic": null, "released": "2020-09-29", "tba": false, "updated": "2020-10-02T04:53:13", "background_image": "https://media.rawg.io/media/screenshots/024/0243591c50cc11f252aaf448c54a1368.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Luis_Henrique_Verissimo"], "genres": [], "publishers": [], "esrb_rating": null}