{"id": 499931, "slug": "triple-catch-triple-cash", "name": "Triple Catch Triple Cash", "name_original": "Triple Catch Triple Cash", "description": "<p>A short game where you control 3 characters through different mechanics while collecting cash and avoiding bombs all in 60 seconds! Accept the challenge and you'll get a chance to win thousands of fake money! Play alone or with your friend/s.</p><p>Submission to the Practice Circle Jam with optional theme \"multiple main characters\".</p>\n<p><strong>Q</strong> - Quit Game</p>\n<p>Feedback, suggestions, questions, etc. are much appreciated! </p>\r\nCreator's Experience:\r\n<p>Warning: Kinda Long</p>\n<p>I'm glas and I'm a lazy bum who finally decided to learn about game dev and programming this quarantine. This is a little backstory to how I made <strong>this </strong>game. So I was scrolling through the jam calendar and saw this jam which seemed very welcoming to beginners like me. After a \"few\" days, I suddenly realized I hadn't done anything for the jam and that there were 2 and a half days left. Naturally, instead of just accepting that I probably shouldn't rush a game in that short amount of time, well, I did just that. I actually had a different first idea I wanted to do for the jam, which I spent a good few hours on brainstorming and conceptualizing characters, but I realized it was too ambitious. After trying out my game generator, I got the idea of using different controls for diff. characters which seemed simple enough to do and then I kept adding some ingredients to it. Well, that's all strangers, enjoy the game! </p>\n<p>All art, code and music (except for sfx  - <strong>zapsplat</strong>, <strong>myinstants</strong>) was made by glas.</p>", "metacritic": null, "released": "2020-09-29", "tba": false, "updated": "2020-10-02T05:00:00", "background_image": "https://media.rawg.io/media/screenshots/422/422476bbf5a16203412b0e0752319d5d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 29, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["glas"], "genres": ["Action"], "publishers": [], "esrb_rating": null}