{"id": 49995, "slug": "until-none-remain-battle-royale-pc-edition", "name": "Until None Remain: Battle Royale PC Edition", "name_original": "Until None Remain: Battle Royale PC Edition", "description": "Until None Remain is a futuristic multiplayer first person shooter in a Battle Royale or Last Man Standing format. Matches pit weaponless players against one another in a death match that continues until only one player remains. Players must rush to acquire weapons, armor, or specialty items such as jet packs, or traps. Scale walls or objects using magnetized gloves, jet around the arena in a jet pack, and interact with an environment that includes turrets, explosive containers, noxious gases, and more!<br/><br/>Action takes place on a competitive map with poisonous gases which will push the players inward every five minutes. Matches will last for a maximum of 15 minutes, or until only one player remains. Players will be automatically matched for quick action and will be able to practice in an offline lobby. Matches will take a maximum of five minutes to begin. If a match has not filled up its slots by that time it will fill out the match with AI controlled players.<br/><br/><strong>Key Features</strong><br/><br/><ul><li>Battle Royale gameplay rewards players for obtaining armor, weapons, or utility items.<br/></li><li>10 minute matches in a shrinking play area encourage fast action. <br/></li><li>Automatic multiplayer matching with servers running 24/7.<br/></li><li>Fully integrated and 3d spatialized voice chat.<br/></li><li>Holster weapons, utility items, and grenades so that you can retrieve them later.<br/></li><li>Mine launchers, shotguns, rifles, rocket launchers, pistols, knives, grenade launchers, and five types of thrown grenades. <br/></li><li>Positional damage, as well as armor and penetration values.<br/></li><li>Jet packs grant limited flight capabilities to those who find them.<br/></li><li>Bots will automatically be spawned if any player slots are empty when a match begins.<br/></li><li>Powerup system rewards exploration.<br/></li><li>Hoverbikes for quick transporation.</li></ul><br/>The PC Edition is the best version for players who do not have VR headsets. There is a separate VR edition for Virtual Reality players. <br/><br/>If you are seeking the VR version it can be found here: http://store.steampowered.com/app/697020/Until_None_Remain_Battle_Royale_VR/", "metacritic": null, "released": null, "tba": false, "updated": "2019-09-17T14:04:40", "background_image": "https://media.rawg.io/media/screenshots/876/87681cbd3f3f4097d30b9282f992ec45.jpg", "website": "https://www.facebook.com/UntilNoneRemain/", "rating": 1.67, "rating_top": 1, "added_by_status": {"yet": 1, "owned": 79, "dropped": 1}, "playtime": 1, "achievements_count": 11, "ratings_count": 6, "suggestions_count": 361, "game_series_count": 0, "reviews_count": 6, "platforms": ["PC"], "developers": ["D.W.S."], "genres": ["Action", "Indie"], "publishers": ["D.W.S."], "esrb_rating": null}