{"id": 50002, "slug": "this-war-of-mine-stories-season-pass", "name": "This War of Mine: Stories - Season Pass", "name_original": "This War of Mine: Stories - Season Pass", "description": "Accédez à une série de trois nouvelles histoires prenant place dans l'univers de ‘This War of Mine’. La première, ‘Father’s Promise’, est d'ores et déjà disponible et les deux autres suivront en 2018.\nCe passe saisonnier vous permet de faire des économies. Toutes les histoires sont téléchargeables depuis le jeu à leur sortie et nécessitent le jeu de base This War of Mine sur GOG pour être jouées.\n<br/><br/>\nPremière histoire : <br/>\nLe DLC Father's Promise est une histoire originale prenant place dans l'univers de This War of Mine. Vous y suivrez une lutte familiale pour préserver le peu d'humanité qu'il reste dans une époque rongée par le désespoir et la cruauté. \n<br/><br/>\nIncarnez Adam, un père cherchant à sauver sa fille des horreurs de la guerre et à fuir la ville assiégée. Accompagnez-les pour découvrir une histoire d'amour, de haine et de deuil, émotions que nous partageons toutes et tous dans les jours les plus sombres.\n<br/><br/>\nCe DLC offre une expérience nouvelle, avec des mécanismes supplémentaires et plusieurs heures de jeu vous invitant à réfléchir. C'est aussi le premier opus de la série inédite This War of Mine: Stories. Les prochains chapitres seront publiés en 2018.\n<br/><br/>\nVoici ce que contient le DLC Father's Promise :<br/><ul>\n<li class=\"description__cool-point\">un scénario inédit adapté d'une pièce radiophonique du célèbre auteur polonais Łukasz Orbitowski</li>\n<li class=\"description__cool-point\">4 lieux entièrement nouveaux</li>\n<li class=\"description__cool-point\">5 lieux reconstruits et redessinés</li>\n<li class=\"description__cool-point\">des nouveaux mécanismes : des systèmes de dialogue et de recherche d'indices</li>\n<li class=\"description__cool-point\">des nouveaux objets liés à l'histoire</li>\n</ul>", "metacritic": null, "released": "2017-11-13", "tba": false, "updated": "2023-07-23T10:54:42", "background_image": "https://media.rawg.io/media/screenshots/cc7/cc73fadf4e26d9f942229387c6fb93dc.jpeg", "website": "", "rating": 0.0, "rating_top": 4, "added_by_status": {"yet": 2, "owned": 3, "beaten": 4, "toplay": 1, "dropped": 1, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 5, "suggestions_count": 373, "game_series_count": 0, "reviews_count": 5, "platforms": ["Linux", "PC", "macOS"], "developers": ["11 Bit Studios"], "genres": [], "publishers": ["11 bit studios"], "esrb_rating": null}