{"id": 50014, "slug": "7-wonders", "name": "7 Wonders", "name_original": "7 Wonders", "description": "<p>Strategy card game. Compete against players from all around the world in the digital adaptation of this multi-award winning tabletop game.<br />\nPlayable offline against the Artificial Intelligence. Internet connection required for online functionalities.<br />\nRecommended devices: Iphone 6, iPad Air, and more recent devices.<br />\nFast-paced, well-balanced and accessible strategy card game.<br />\nDevelop your military, scientific, commercial or civil domains… Choose your strategy and place your cards to develop your civilization and construct one the seven wonders of the world.<br />\nThe simple rules and the convenient tutorial will help you master the interface and the different game concepts to guarantee an incredible gaming experience.<br />\nCOMPETE ON EQUAL TERMS: There are no cards to collect, the drafting mechanism guarantees that players are on an equal footing each game. Your strategy will make the difference, not the size of your card collection.<br />\nDON’T WAIT, JUST PLAY: All players act simultaneously, as such you do not wait for each other player to finish their turn.<br />\nPRACTICE MAKES PERFECT: Sharpen your skills by playing against the A.I.<br />\nMULTIPLAYER: Up to 7 players per game.<br />\nGAME LENGTH: 5–8 Minutes<br />\nLanguages available:<br />\nEnglish<br />\nFrench<br />\nSpanish<br />\nGerman<br />\nPolish<br />\nDutch<br />\nItalian</p>", "metacritic": null, "released": "2017-11-13", "tba": false, "updated": "2021-09-06T15:29:29", "background_image": "https://media.rawg.io/media/screenshots/a13/a133ee42a73a89ad1ba8193e028b365f.jpg", "website": "http://rprod.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 274, "game_series_count": 8, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["Repos Production"], "genres": ["Strategy", "Card"], "publishers": ["repos production"], "esrb_rating": null}