{"id": 500261, "slug": "segwheel", "name": "Segwheel", "name_original": "Segwheel", "description": "<p>\n<br/></p>\r\n3 - 2 - 1 - GO !\r\n<p>\n<br/></p>\n<p>Fast, agile, beautiful, magnificient... The segway is trully a racing beast. Enjoy a fast and fun racing game with unconventional controls : you drive each wheel separately with 2 commands each : <strong>go forward</strong> OR <strong>go backward</strong>.</p>\n<p>Segwheel is a game about mastering this weird vehicle and control scheme. Be fast, and try to perfectly control your segway to avoid the various obstacles on each track.</p>\n\r\nSETUP YOUR PARTY\r\n\n<p>Play with as much players as you want (we won't stop you from playing a 200 players game). Controls are rebindable as much as you want. You could even try to play \"co-op\" mode : Two players per segway, one controlling the left wheel, the other controlling the right wheel.<br/></p>\n<p>If you want to play with friends online, try something like Parsec, it's working nicely with it.</p>\n\r\nCUSTOMIZE\r\n\n<p>Modifiers are what trully change how the game works. From extreme rotation speed to turn-based gameplay, there is a lot to try and have fun with. And you know what ? You can combine modifiers together ! You can absolutely enjoy a game where you can't stop going forward at insane speed, with unstable segways that explodes on impact, while avoiding lethal orbital strikes and alien abduction rays. It's your choice !</p>\n\n<p><strong>DRIVE SAFELY !</strong></p>\n<br/>\n\n\n\r\nCREDITS\r\n<p><strong>Anatole Chaumont Frelet</strong> - <em>Code / Game Design</em><br/></p>\n<p><strong>Thomas Lebrun</strong> - <em>Code / VFX / Level Design / Audio (Music &amp; SFX) / Game Design</em></p>\n<p><strong>Léa Pequignot</strong> - <em>3D Art / Artistic Direction</em></p>\n\r\nADDITIONAL NOTE\r\n<p>You can customize your entire game and mix a lot of modifiers together. However, some combinations can be frustrating / impossible to win with. We won't stop you from trying dangerous combos, but just be warned that you might not be able to finish every tracks with these.  But go explore, try everything, and HAVE FUN !</p>", "metacritic": null, "released": "2020-09-28", "tba": false, "updated": "2020-10-02T06:11:54", "background_image": "https://media.rawg.io/media/screenshots/31f/31fa04f6c1110c14b6ad57dcea0f4d88.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Teagher Studio"], "genres": ["Action", "Racing"], "publishers": [], "esrb_rating": null}