{"id": 50023, "slug": "tap-tap-dig-idle-clicker", "name": "Tap Tap Dig - Idle Clicker", "name_original": "Tap Tap Dig - Idle Clicker", "description": "If you enjoy clicker games, Tap Tap Dig is perfect for you! Tap Tap Dig is an incremental idle clicker game that lets you take control of a miner and dig deep into the planet’s core! Just start clicking to mine. Bring along special mining helpers, collect coins, diamonds, and more! Upgrade your miner and helpers to increase your DPS and reach uncharted depths.<br/><br/>Digging for gold has never been more exciting! Tap to start, then upgrade your helpers and hire benefactors to help you dig deeper, faster. Unlock a pirate helper, construction slime, a miniature black hole and more! Still not strong enough? Collect fossils and trigger a Big Bang to boost your digging power even further! <br/><br/>Download now and start digging for gold in one of the most addicting incremental idle clicker games! How far can you dig?<br/><br/>TAP TAP DIG FEATURES<br/><br/>Idle Clicker Gameplay<br/>● Tap: Swing your pick-axe!<br/>● Tap: Squish earthworms and earn diamonds!<br/>● Dig: Earn coins and fossils!<br/><br/>Incremental Upgrades<br/>● Collect 12 helpers to dig for you!<br/>● Hire benefactors to unlock unique bonuses<br/>● Evolve your digging strategy! Unlock special mysterious benefactors to lend a helping hand, fin, or claw!<br/><br/>Upgrade Your Miner<br/>● Gold Miner: Unlock prospector skills and dig even faster<br/>● Research stat bonuses and profit!<br/>● Rewards to permanently upgrade your prospector are everywhere!<br/><br/>Idle Mining<br/>● Earn coins even when you're not playing<br/>● Bonus - enjoy cool bonuses from our unique ad reward system<br/>● Achievement system - show off to your friends!<br/><br/>Tap Tap Dig is the perfect incremental clicker / idle game for fans of endless fun. Tap the day away digging for gold, diamonds, fossils, and more! Bring along friends like Rocky the loyal dog, Mack “The Anchor” pirate, and Jack Hammer the construction worker and get digging today!<br/><br/>Tap, Tap, Dig - can you dig it?<br/><br/>Become a gold digger in one of the newest free mining games and download now! <br/><br/>Want more info about Tap Tap Dig or want to know what else we're working on? Follow us on Twitter or Like us on Facebook:<br/>twitter.com/thebaconbandits<br/>facebook.com/baconbanditgames", "metacritic": null, "released": "2017-11-14", "tba": false, "updated": "2019-07-30T08:31:49", "background_image": "https://media.rawg.io/media/screenshots/5f6/5f677a2624e67af3c6dad503e2a4fd86.jpg", "website": "http://www.baconbanditgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 133, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["6864954 MANITOBA", "Iron Horse Games"], "genres": ["Adventure", "Simulation"], "publishers": ["6864954 MANITOBA", "Iron Horse Games"], "esrb_rating": "Everyone 10+"}