{"id": 500448, "slug": "frog-wars", "name": "FROG WARS", "name_original": "FROG WARS", "description": "<strong>IMPORTANTE:</strong>\n<p>Ésta es una lista de problemas conocidos con los que te puedes encontrar al jugar con la versión de la jam. <strong>Algunos de ellos se han arreglado tras la finalización de la jam y se pueden evitar descargando la versión actualizada del juego.</strong></p>\n<ul><li>Botón \"Singleplayer\" en el menú principal solamente funciona cuando es pulsado por la parte inferior <em>(Arreglado en versión 1.1).</em></li><li>Posibles problemas al utilizar múltiples mandos + teclado y ratón a la vez. Si el juego no responde correctamente evita utilizar diferentes métodos de control en el menú.</li></ul>\n<em>Pipo y Pipa se llevan fatal, y cuando a la frustración a la que los estudiosos de la magia son inevitablemente sometidos se va acumulando, una tonta discusión sobre la pizza con piña puede llegar a algo más que palabras, lo cual puede ser especialmente preocupante si hablamos de magos.</em>\n<strong>EL EQUIPO:</strong><p>Frog Wars ha sido desarrollado por 4 personas y un perro durante los 7 días que duró la Spain Game Devs Jam II. Todo el contenido del juego, a excepción de los efectos de sonido, fue desarrollados durante el evento por este equipo:</p>\n<ul><li>Gius Caminiti - Programación, Música</li><li>Antón Blanco \"Chandalf\" - Arte</li><li>Eugenia Suárez - Arte</li><li>Guillermo Couceiro \"Filo\" - Programación, VFX</li><li>Ame - Perro</li></ul>\n<p>Efectos de sonido de https://freesound.org/ bajo licencia CC Public Domain.</p>\n<strong>MAKING OF:<br/></strong>\n<strong>IMPORTANT:<br/></strong>\n<p>Here is a list of known issues you can stumble into when playing the jam submission. Some of these have been fixed after the jam deadline and can be avoided downloading the bugfixed version of the game.</p>\n<ul><li><em>The \"Singleplayer\" button inside the main menu can be unreliable. Pressing the lower third of the button should avoid the problem (</em><em>Bugfixed in v1.1).</em></li><li>Input issues when handling multiple controllers + keyboard. If the game doesn't respond to your inputs avoid using different input methods inside the game menu.</li></ul>\n<em>\"Pipo and Pipa  just can't get along, and when the inevitable frustration that comes with the study of magic keeps building up, a silly discussion about pinneapple on pizza can get physical. Add magic powers to the mix and nothing good can come from it...\"</em>\n<strong>THE TEAM:</strong><p>Frog Wars was developed by 4 people and a dog during the 7 days the Spain Game Devs Jam II lasted. All of the content in the game, with the exception of SFX, was made by this team during the event:</p>\n<ul><li>Gius Caminiti - Programming, Music</li><li>Antón Blanco \"Chandalf\" - Art</li><li>Eugenia Suárez - Art</li><li>Guillermo Couceiro \"Filo\" - Programming, VFX&lt;li\"&gt;&lt;/li\"&gt;</li><li>&lt;li\"&gt;Ame - Dog\r\n&lt;/li\"&gt;</li></ul>\n<p>SFX from https://freesound.org/ under CC Public Domain license.</p>", "metacritic": null, "released": "2020-09-28", "tba": false, "updated": "2020-10-02T06:58:15", "background_image": "https://media.rawg.io/media/screenshots/672/6724685d384ec5e8273ee3b0ca884149.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 246, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Chandalf", "Gius Caminiti", "FiloGC", "Eugenia Suárez"], "genres": ["Fighting"], "publishers": [], "esrb_rating": null}