{"id": 50045, "slug": "project-5-sightseer", "name": "Project 5: Sightseer", "name_original": "Project 5: Sightseer", "description": "Project 5: Sightseer was designed to be a cooperative multiplayer sandbox game set in a vast, procedurally generated world. Players start with nothing but a scanner and a mining laser in the location of their choosing by themselves or with their friends, then venture forth to discover resources, build outposts, research technologies and ultimately unravel the world's secrets.<br/>\n<br/>\r\nThe world of Sightseer has a strong emphasis on science. For example burning coal produces CO2. This CO2 can be stored in its gaseous form, but chilling it below -78.5 Celsius will turn it into dry ice, making it much more compact. If the CO2 gets released into the atmosphere, nearby trees will slowly absorb it back into the environment -- but burning too many hydrocarbons will still pollute the area, bringing dire consequences.<br/>\n<br/>\r\nMost of the world's resources are finite, and depleting a resource node will mean that the players will need to find another source. Actual world chemical formulas can be used to convert one resource into another. For example Electrolysis can be used to extract Hydrogen from water, then the Hydrogen can be mixed with Nitrogen with the help of an Iron catalyst to form Ammonia. Even vehicles that get destroyed will effectively litter the surrounding area with the resources used to make them, ensuring that nothing gets lost.<br/>\n<br/>\r\nEach world is persistent, and player achievements are recorded for posterity. For example once a player establishes an outpost, that player's name will always show up for others visiting it in the future. The same goes for artifacts -- the first player to discover an artifact will be remembered as such -- so go out there and explore! Even the trade routes established between different outposts will show the name of the player that found the fastest route.<br/>\n<br/>\r\nPlayers are free to play offline by themselves, online with others, or host private worlds for their friends. Hosting a game offers a Creative Mode option where all resource costs are ignored and dying isn't possible -- for those creative players that just want to build cool things! Outside of the creative mode, everything costs resources in order to create: for example any hard metal can be used to create a storage crate, while researching Nuclear Fission will require players to find a way to enrich Uranium.<br/>\n<br/>\r\nPlaying online, players can band together to form factions, establish outposts, set up their automated defenses, or even siege and capture outposts belonging to other factions. With adequate scientific research various sensors exist to aid players in setting up basic automation -- such as gates opening when a friendly player gets near or turrets that activate only when a radar detects an enemy.<br/>\n<br/>\r\nIn the end, what Sightseer offers is a creative sandbox -- with the only limit being the players' imagination.", "metacritic": null, "released": "2017-12-04", "tba": false, "updated": "2019-08-28T22:03:40", "background_image": "https://media.rawg.io/media/screenshots/681/68139b2342b0e6760486de5c4c1ed3f3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 131}, "playtime": 3, "achievements_count": 56, "ratings_count": 1, "suggestions_count": 535, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Tasharen Entertainment"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Tasharen Entertainment"], "esrb_rating": null}