{"id": 500540, "slug": "breach-protocol", "name": "Breach Protocol", "name_original": "Breach Protocol", "description": "<p>//DESCRIPTION----------------------------------------------------</p>\n<p>In the year 2030, breach into the network of  corrupt mega corporation Takion and steal their business data. Defeat the security programs by destroying or hacking them and steal as much data as you can before your connection time runs out.</p>\n<p>//HELP-----------------------------------------------------------------</p>\n<ul><li> WASD or arrow keys to move. Mouse to aim and left click to fire.  </li><li>Destroying enemies will only increase your score. You can also shoot at some enemy  bullets to destroy them.\r\n     </li><li> Hack enemies by keeping them in range. You will gain a time bonus on succesful     hacking.  You can only hack one enemy program at a time. </li><li>Touching enemy  programs causes you to lose as much time as what you would get from hacking. Dont rush in!\r\n     </li><li>Hack yellow data packets to gain a greater time bonus or even a power-up!</li></ul>\n<p>//AYUDA---------------------------------------------------------------</p>\n<ul><li>Sobrevive todo lo que puedas destruyendo y hackeando programas enemigos antes de que tu tiempo de conexión se acabe ¡Intenta alcanzar el puntaje más alto!</li><li>WASD o flechas para moverte. Mouse para apuntar y botón izquierdo para disparar.  </li><li>Destruir programas enemigos solo aumentará tu puntaje. También puedes disparar a algunas balas enemigas para destruirlas.      </li><li>Hackea enemigos manteniéndolos dentro de tu rango. Obtendrás más tiempo si logras completar el hackeo. Solo puedes hackear un enemigo a la vez. </li><li>Chocar enemigos te quitará más tiempo del que ganarías hackeando ¡No te precipites!</li><li>Hackea los paquetes de datos amarillos para obtener aún más tiempo ¡o incluso un power-up!</li></ul>\n<p>//INFO----------------------------------------------------------------------</p>\n<p>Small college project for my game design class. Developed in one month. SFX by MATRIXXX_, pumodi and kwhmah_02 under the Attribution License. Music: \"Answer to the Black Orb\" by White Bat Audio.</p>", "metacritic": null, "released": "2020-09-28", "tba": false, "updated": "2020-10-02T07:19:23", "background_image": "https://media.rawg.io/media/screenshots/74e/74ecab91381a08b5c3199bcd65f9abfb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 39, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Bigbadbackstab"], "genres": ["Action"], "publishers": [], "esrb_rating": null}