{"id": 500618, "slug": "struggle-offensive-2", "name": "Struggle Offensive", "name_original": "Struggle Offensive", "description": "Struggle Offensive takes place between two rival teams. With the coming together of anti-government groups, the Orange Star, Terrorist group was born. This terrorist group is aiming to take over by overthrowing the government, and they are creating chaos across the country to implement what they want. The government has set up the Blue Shield team, a specially trained Anti-Terrorist team, to prevent and destroy terrorist groups' activities. In Struggle Offensive, you will see the remains of the relentless struggle between these two teams and you can take your place in this story by choosing your side.<br/><br/><br/><br/><strong>There are two rival teams in Struggle Offensive. Choose one side and destroy the other team! achieve your goal!</strong><br/><br/><br/><br/><strong>Orange Star, his team is an anti-government terrorist group.</strong><br/><br/><br/><br/><strong>The Blue Shield team is a specially trained Anti-Terrorist team working on behalf of the government.</strong><br/><br/><br/><strong>Players fight in PvP matches dominated by chaos. There are a maximum of 8 players on each side. May the weapon's ability and the fast one win!</strong><br/><br/><br/><br/><strong>The game is constantly being developed! Change the outcome of the war by using new weapons to be added in the future and take your weaponry to the next level.</strong>", "metacritic": null, "released": "2020-10-03", "tba": false, "updated": "2020-10-05T01:59:35", "background_image": "https://media.rawg.io/media/screenshots/7cb/7cb8897566377140f29bd9c4de5ee577.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 330, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["OXO Games"], "genres": ["Action", "Casual", "Indie"], "publishers": ["OXO Games"], "esrb_rating": null}