{"id": 50063, "slug": "deep-space-unknown-universe", "name": "Deep Space: Unknown Universe", "name_original": "Deep Space: Unknown Universe", "description": "Poseidon 1It is year 2352. Human race is finally becoming multiplanetary species after successful colonization of Mars.<br/>You are member of Poseidon 1 crew. Poseidon 1 is the most advanced spaceship of mankind. Capable of interstellar travels.<br/>Your mission is to gather information about nearest neighboring star Alpha Centauri. If your mission prove that it is possible to colonize other solar systems. It will be huge step for mankind.AliceEver since from robotization of Earth in 2052 world has never been same. Many question if artificial intelligence can really be considered an intelligence same as human one. Constant revolts calls for stop making robots smarter and smarter. However they could not stop development of AI for space ships. Alice is latest AI outperforming any human in any kind of thinking process.MissionExplore a few planets until you find the puzzle that leads to the energy needed for flight back to Earth. You will be accompanied by Alice, artificial intelligence built into the ship's computer. Alien worlds are often an inhospitable environment. Some planets are being burned by radiant presence of a star. Others are overwhelmed by toxic vapors. And some do not even have a solid surface. Can you survive where no one ever was? And come back to Earth?", "metacritic": null, "released": "2017-12-01", "tba": false, "updated": "2019-08-28T22:03:39", "background_image": "https://media.rawg.io/media/screenshots/7a5/7a5f5da44695d3e8d06cb96bbf0baec8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 204, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Matouš Lörinc"], "genres": ["RPG", "Indie"], "publishers": ["Matouš Lörinc"], "esrb_rating": null}