{"id": 500760, "slug": "frogs-training-to-be-heros-in-a-large-wheel-thing", "name": "FROGS Training to be Heros (In a large 'wheel-thing')", "name_original": "FROGS Training to be Heros (In a large 'wheel-thing')", "description": "<p>~ Made during LudumDare 47 ~<em><br/><br/>FROGS Training to be Heros (In a large ‘wheel-thing’)</em> is a platform-style game about hopping from place to place and navigating all sorts of tricky situations in a big rotating wheel. Be on guard for all sorts of challenges- but don’t worry! It’s all training- if you get knocked into the bog, just swim back and try again.</p>\n<p>There is no set ‘end’ to this game- so, you could try to get a high score, just have a good time jumping around, or take in the nighttime ambience.</p>\n<p>CONTROLS:\r\nLeft Arrow - Short, backward hop. Keeps sword in ‘Defense’ stance.\r\nRight Arrow- Large, forward hop. Puts sword into ‘Attack’ stance.\r\nSpacebar - Used in menus to select options.\r\n‘M’ key - Cycles through mute options (All sound off, only sound effects, all sounds on)\r\n‘S’ key - Toggles screenshake</p>\n<p><strong>You can skip to the game page down below if you’re ready to play, or read a little more for helpful info and intros to the playable characters.</strong></p>\n<p>📖 Hints</p>\n<ul><li>Your sword is really only good for blocking cannon shots in the training wheel- but you’ll be glad you have it! When your sword is in the ‘Defense’ stance, it will passively block the projectiles. When your sword is in the ‘Attack’ stance, blocking is very tricky- you must strike the projectiles with the very tip of the sword. (Please note that ‘Nate’ cannot deflect projectiles in the ‘Attack’ stance.)</li><li>That scary red thing below the wheel punches upwards whenever a red panel lines up with it.</li><li>Never underestimate spikes.</li><li>Jumping onto the far side of the wheel will weigh it down and make it rotate faster. This is a useful strategy- but also very risky.</li></ul>\n<p>👋 Introductions…</p>\n<ul><li>Freddie: She is very passionate about her calling and is good at a little bit of everything when it comes to knight duties. (She actually came up with the idea for the wheel, although construction was a team effort.)</li><li>Beethoven: Smaller than most frogs, Beethoven is very quick, and can easily dodge projectiles. However, he cannot jump very high, so careful planning is needed when navigating tricky terrain. (The name is a coincidence, although he does enjoy music a lot.)</li><li>Nate: Wow. This guy is a real wild card. He has strong armor that allows him to break through spikes- but his sword is very tiny. It can’t reflect projectiles with the tip like Beethoven and Freddie’s swords. (Nate has been training to be a knight the longest, and has passed down much of his knowledge to the other frogs.)</li></ul>", "metacritic": null, "released": "2020-10-04", "tba": false, "updated": "2020-10-05T02:45:03", "background_image": "https://media.rawg.io/media/screenshots/a7b/a7b760ff664c6b2b18f97cfb7fb7f963.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 59, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["HacksawUnit"], "genres": ["Action", "Platformer"], "publishers": [], "esrb_rating": null}