{"id": 50095, "slug": "shadow-fight-3", "name": "Shadow Fight 3", "name_original": "Shadow Fight 3", "description": "<p>An epic Fighting/RPG series returns! Master the shadows and challenge your foes!<br />\nStep into the world of shadows at the time of changes. Reveal all its dark secrets and become the greatest warrior this land has ever seen. In this RPG-fighting game you will take on a role of a hero whose destiny isn&#39;t determined yet. How do you see the future? It&#39;s your call! Choose from three different fighting styles, experiment, combine your gear, learn some fresh new moves and explore a massive world full of adventures! Enjoy the beauty of a real fight which has been made possible due to modern technologies and smooth animations.</p>\n<p>CREATE YOUR OWN FIGHTING STYLE</p>\n<p>Shadow Fight 3 offers you 3 unique fighting styles to choose from. Collect new moves, perks, weapons, gear and combine them in the way YOU like it. Be fast and graceful, strong and shattering, enigmatic and deadly. Raise a character that will represent your distinctive playing technique and personality.</p>\n<p>AT THE EDGE OF TECHNOLOGY</p>\n<p>Shadow Fight 3 brings the fighting genre to a whole new technological level. Colorful graphics, smooth animations, realistic physics and effects create a picture of a living and breathing world you&#39;ve never seen before!</p>\n<p>DEEP AND IMMERSIVE STORYLINE</p>\n<p>Shadow Fight 3 is a story-driven game. You&#39;ll find yourself in a dangerous world that is on the threshold of a great war with you in the middle. Three powerful factions are tearing these lands apart and plotting against each other. Which side would you choose? You decide!</p>\n<p>MANAGE YOUR GEAR COLLECTION.</p>\n<p>There&#39;s large amount of weapons and armor in Shadow Fight 3. If you&#39;ve ever dreamed of having a rare collection of war goods, now&#39;s your time! The world of shadows has got splendid rewards for the most adventurous ones! Collect epic gear, combine and upgrade it, equip it with new lethal moves and perks. Fight your enemy with style! It is all limited by your imagination only.</p>\n<p>Shadow Fight 3 in a nutshell:</p>\n<ul>\n<li>Smooth animations and lifelike physics  </li>\n<li>Spectacular SHADOW-based fighting mechanics  </li>\n<li>Lots of gear and weapons to collect  </li>\n<li>Gorgeous visuals  </li>\n<li>Three unique factions and fighting styles  </li>\n<li>Hundreds of perks and supermoves  </li>\n<li>Character creation tool  </li>\n<li>Diverse fighting modes</li>\n</ul>", "metacritic": null, "released": "2017-11-16", "tba": false, "updated": "2023-12-17T14:09:19", "background_image": "https://media.rawg.io/media/screenshots/bc2/bc2d373bcf8d0a27dd1381736a8241f6.jpeg", "website": "http://shadowfight3.com", "rating": 3.39, "rating_top": 4, "added_by_status": {"yet": 4, "owned": 5, "toplay": 2, "dropped": 22, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 22, "suggestions_count": 375, "game_series_count": 2, "reviews_count": 23, "platforms": ["Android", "iOS"], "developers": ["Bonzai Games"], "genres": ["Action", "RPG"], "publishers": ["Nekki"], "esrb_rating": null}