{"id": 50101, "slug": "3571-the-game", "name": "3571 The Game", "name_original": "3571 The Game", "description": "<strong>Planet earth, year 3571. Humans have lost technology, but their heritage is still alive: droids, mutant animals, monsters, aliens... Time travel safely by sending an avatar in the year 3571. Control it from your computer and see how many day you can survive! </strong>Role Playing Game3571 The Game is a <strong>role playing game</strong> in which you can create an organic avatar in the year 3571. You'll be able to control its movements and experience safely what it's like to time travel : explore, make friends, work, fight, upgrade your skills and die.+ RoguelikeLike in <strong>roguelike</strong> games, if your avatar dies, your game is lost for ever. If you want to play again, you'll need to create a brand new avatar in the year 3571. Be careful: you'll be sent in a very different version of the Earth to avoid spacetime paradoxes.+ First-person shooterThanks to a third-person camera drone, you can see your avatar's body while playing. At any time you can also activate an internal camera, and see exactly what your avatar sees. If you find a gun, the gameplay will feel like a <strong>first-person shooter</strong>.+ SurvivalAs you will experience hunger and thirst you'll need to collect food and water to survive, like in most <strong>survival</strong> games. Hunt, fish, find fruits or even steal: do whatever it takes to keep your avatar alive.+ Open-World Sandbox3571 The Game is also a <strong>sandbox simulation</strong>. You can also gather resources like wood or stone to build weapons, armors and even buildings. The game have no other goal except surviving, so you are free to explore the world like you want and set your own goals.+ Single artist original art project3571 The Game is part of a bigger project, <strong>the 3571 Project</strong>. Comics, films &amp; animations, music soundtrack, and this videogame are created by a single artist since 2012 (conception, marketing, 3D &amp; 2D graphics and animations, texts and coding).<br/><br/><br/><strong>Features (v0.55 beta):</strong><br/><ul><li><strong>Original 3571 Comics universe </strong>created together with the comic</li><li><strong>Survival</strong> with XP level and skills <strong>RPG system</strong> and <strong>chest and inventory system</strong></li><li>Roguelike inspired <strong>permanent death</strong> with higscore: How many days will you survive? </li><li><strong>Procedurally generated open world</strong> inspired by the 3571 Comics: Various buildings and towns, animals, droids, zombies, monsters... Each new game is different!</li><li><strong>Fast One-click simple Crafting System</strong> designed for the game</li><li>Player character<strong> customization</strong></li><li>100% <strong>Realtime combat system</strong></li><li>Both 3rd person <strong>Hack'n'Slash</strong> gameplay and <strong>FPS</strong> gameplay </li><li>Quantum Force <strong>unleash your energy</strong> in every situation : jump higher, run faster, kill harder!</li><li>Intelligent and<strong> interactive NPCs:</strong> they speak, they trade, get happy or angry, they fight, they sometimes defend or attack you, and sometimes act stupid just like in the 3571 comics</li><li><strong>Riding system</strong> ( horses, giant wolves... )</li><li><strong>Intelligent and interactive music multitrack system:</strong> the same song goes on but the arrangements vary according to the player stress level ( darker themes when health is low, for exemple )</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:03:39", "background_image": "https://media.rawg.io/media/screenshots/58c/58c5ed5a643aa5064286f3ff4771b2ff.jpg", "website": "http://3571thegame.wordpress.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 386, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["FRAPPA STUDIO"], "genres": ["Action", "Adventure", "RPG", "Simulation", "Indie"], "publishers": ["FRAPPA STUDIO"], "esrb_rating": null}