{"id": 50110, "slug": "holy-towers", "name": "Holy Towers", "name_original": "Holy Towers", "description": "Defeat hordes of imps in the very first Tower Defence game about the order of monks! <br/> All this to defend humankind from hordes of demons! <br/><br/>Greetings, the Great Architect! We’ve got a little problem here… Army of demons breaking through the portals into our world! It seems that to board up those filthy spacetime holes was not enough. But that’s ok, ‘cause we’ve got you! Just let me finish that… hic… brew mash and we’ll show em! <br/><br/>SO HERE IS WHAT WE'VE GOT<br/><br/>➶ Lots of different TOWERS! Shot, blow ‘em up, chop, poison, blow ‘em up one more time, incinerate and a little salt on the top, ‘cause demons hate salt!<br/>➶ Really cool HEROES you can control during battle!<br/>➶ Loyal WARRIORS that are ready to show demons what's what! And when they’ll find out which side to hold the sword, that will turn badly for demons! <br/>➶ Lots of different ABILITIES you can use during battle. See? There’s a fireball flies low. Some say it’s to another demon’s death!<br/><br/><br/><br/>The army of demons breaks through thy tower defense, and your holy duty is to protect medieval kingdoms. You will have a lot of different towers, powerful abilities and mighty warriors at your disposal. Even heroes of camelot are too weak to withstand the threat so the Holy church medieval army is on the scene! Do not let that darkness reign here today...<br/><br/>But the devil is in the detail... Stop! Stop shooting the details, it's just an idiom! So:<br/>★ Nice humor, colorful graphics and original theme!<br/>★ A lot of different towers. How do you like the tower, that calls a pocket army on the battlefield instead of attack?<br/>★ Dozens of achievements, different tower upgrades, lots of loot, cool heroes and spells!<br/>★ A variety of realms will become a delight for your eyes.<br/>★ Choose complexity: the usual uncomplicated mode or the \"Hardcore\" mode with 1 life and hordes of enemies. That can be a real test!<br/>★ Funny thurible massacre td battles that will hook you for hours!<br/>★ Fight imps, warlocks, hell ponys, fatass demons and skeleton hordes!<br/>★ An in-game encyclopedia with a detailed description of all towers and creeps will be updated as the game progresses and will always provide you with the most accurate information.<br/><br/><br/><br/>Please share your feedback and ideas! <br/>Have a good game!", "metacritic": null, "released": "2017-12-01", "tba": false, "updated": "2019-08-28T22:03:38", "background_image": "https://media.rawg.io/media/screenshots/07c/07cd334a3563d2c5a1e9ade27ea508d3.jpg", "website": "https://playflock.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 1, "achievements_count": 15, "ratings_count": 0, "suggestions_count": 231, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["PlayFlock"], "genres": ["Strategy"], "publishers": ["PlayFlock"], "esrb_rating": null}