{"id": 50115, "slug": "debris-infinity", "name": "Debris Infinity", "name_original": "Debris Infinity", "description": "Debris Infinity is an action packed game that puts your reflexes to the limit, allowing you to manipulate time itself to make impossible maneuvers, using an advance scoring system to rank your performance!<strong>Game Modes</strong>Take control and face one of the 3 challenging game modes available:<br/><br/><br/><ul><li><strong>Normal Mode:</strong> Get the maximum score against increasingly harder enemy attacks that will improve their strategy depending on how well you are playing.<br/> </li><li><strong>Time Attack:</strong> You have 3 minutes to achieve the highest score ever. Your ship will have infinite shields but each enemy impact decreases your score... you can end up with a negative score if you are not careful!<br/> </li><li><strong>Power Wave:</strong> Enemies will attack in waves and you are on a time limit! Each cleared wave awards you with a time extension so play smart to minimize time wasted, avoiding collisions, of course.</li></ul><strong>Scoring System</strong>There is an advanced scoring system that rewards precision and reflexes:<br/><br/><br/><ul><li><strong>Combos:</strong> Destroying enemies constantly without letting the Combo Meter to be depleted will increase the current combo and the score value of each enemy.<br/> </li><li><strong>Streak:</strong> Defeat enemies without receiving damage will increase the score multiplier. Being impacted reduces it.<br/> </li><li><strong>Reflex:</strong> Get a score bonus by having good reflexes and destroying enemies as soon as they appear. The longer they stay active, the smaller the bonus.<br/> </li><li><strong>Chains:</strong> Destroy enemies of the same color in groups of 4 to create a chain. Chaining rewards you with a bit of energy for slowing down time or launching a powerful hyperbomb. Make lots of chains and you will get a temporal bonus weapon or more shield.</li></ul><br/><strong>KEEP THIS IN MIND: Be elusive. Be intense. Be constant.</strong><strong>More features</strong><ul> <li>Different bonus weapons.<br/> </li><li>Up to 4K at 60 fps graphics for a full arcade experience.<br/> </li><li>Slowdown time for daredevil moves.<br/> </li><li>Gamepad support (Xbox 360, Xbox One, Ps3, Ps4...) or use keyboard and mouse.<br/> </li><li>Top Scores Ranking.<br/> </li><li>Detailed configuration options for quality, resolution, sound...<br/> </li><li>Multilanguage.</li></ul>", "metacritic": null, "released": "2018-09-21", "tba": false, "updated": "2019-10-11T03:27:52", "background_image": "https://media.rawg.io/media/screenshots/1df/1df77fdf1eee70a05884f64a87581e37.jpg", "website": "https://www.svcgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 6, "beaten": 1, "dropped": 1}, "playtime": 0, "achievements_count": 20, "ratings_count": 0, "suggestions_count": 310, "game_series_count": 0, "reviews_count": 0, "platforms": ["Xbox One", "Nintendo Switch", "PC"], "developers": ["SVC Games"], "genres": ["Action", "Indie"], "publishers": ["SVC Games"], "esrb_rating": null}