{"id": 50133, "slug": "apex-tournament", "name": "APEX Tournament", "name_original": "APEX Tournament", "description": "Apex Tournament is the fastest Virtual Reality game ever built. Players can move around extremely fast with Zero VR sickness with the Hyper Dash system. With this movement system we are building a fast paced TDM shooter / Hack&amp;Slasher. Players compete as professional athletes in the Apex Tournament equipped with a variety of melee and ranged weapons. <br/><br/><strong>Story:</strong><br/>In 2050 sport fans follow Apex Tournament fanatically. As Romans worship gladiators, Apex Tournament athletes get endorsed with weapons and armor. You compete as professional athlete in the Tournament. You are equipped with a variety of melee and ranged arsenal. <br/><br/><br/><strong>Weapons: </strong><br/>Sword <br/>War Hammer<br/>Pistol <br/>Assault Rifle <br/>Sniper<br/><br/><strong>Weapon Blast:</strong><br/>Each weapon comes with a unique ability. The ability levels up with your weapons. You can even stack your abilities by purchasing additional weapon. <br/><br/><strong>Game play:</strong><br/>Quickplay. Free for all mode! <br/><br/><strong>Hyper Dash Locomotion: </strong><br/>We turn players into human joysticks. Hyper Dash tracks the player’s acceleration with the headset. This allows players to control their in game character intuitively with their center of gravity. This allows players to free their hands and eyes to full focus on target and engage in high level combat. The Hyper Dash locomotion system translates the player’s movement in real life proportionally. Because players actual movement is transferred to the in-game visual movement there is zero VR sickness.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:03:37", "background_image": "https://media.rawg.io/media/screenshots/a94/a949c71562fa63f1174806b0787816b7.jpg", "website": "https://www.facebook.com/FantomFathom/?fref=ts", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 313, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Douglas Liang", "Gorge Quan Li"], "genres": ["Action", "Indie"], "publishers": ["Fantom Fathom"], "esrb_rating": null}