{"id": 501571, "slug": "back-in-my-days-bedeu", "name": "Back in my days - Bedeu", "name_original": "Back in my days - Bedeu", "description": "<p><strong>History</strong></p>\n<p>     Some children, friends of school, decide, during recess, to play hide and seek. However, when they realize that the schoolyard is very small, they decide to run away to continue playing in the street. In the course of the game, they got so excited that they started to pass through several countries inviting other children to play.</p>\n<p><strong>Gameplay</strong></p>\n<p>   The game must be played between two players, connected via a local network; The first player to access the game must enter his name and enter through the “HOST” to create the match room. The second must enter his name and enter by “JOIN” to participate in the created match room. Then the game starts when the player who created the match room clicks \"START\";</p>\n<p>The game is a mixture of two games: “hide and seek” and “tag”; Among the pair of players, one will be the Searcher and the other the Wanted. The Searcher has a glove symbol and an extra speed while the Wanted has the symbol of a person running and the advantage of being able to hide well, in addition to being able to run from the Searcher if necessary - hence the speed difference;</p>\n<p>At least in the first match, the Searcher is the one who created the room. Each game lasts 2 minutes and 40 seconds. As soon as a match starts, the Wanted has within the period of the initial 30 seconds the best opportunity to hide on the map, since, during that time, he is invisible to the Searcher. The Wanted can hide behind map objects, which have shapes and sizes that allow the Wanted to be partially or totally hidden from the Searcher.</p>\n<p>After those initial 30 seconds there is still the possibility of getting behind the objects. It is possible for the Wanted to flee from the Searcher and take advantage of the fact that one cannot permeate through the objects to circumvent the Searcher, avoiding for a while being caught by him. When the Wanted is picked up, a signal is issued to indicate that this has happened;<br/></p>\n<p>When the match is over, the game restarts, then the Searcher and Wanted reappear in different locations. If the Searcher has managed to reach the Wanted, the Wanted loses and becomes the Searcher in the next match. Otherwise, the Searcher loses and remains the Searcher for the next match.</p>\n<p><strong>Game Mechanics</strong></p>\n<ul><li><strong>⇧</strong> “W” button: moves the player upwards;</li><li><strong>⇦</strong> \"A\" button: moves the player to the left side;</li><li><strong>⇩  </strong>“S” button: moves the player down;</li><li><strong>⇨ </strong>\"D\" button: moves the player to the right side;</li><li>Left Mouse Click: used to select the \"HOST\" option, to \"JOIN\", to \"START\" and to make it possible to type in the input of the player's name.</li></ul>\n<p><strong>Challenges</strong></p>\n<ul><li> Paz - Game has mechanics that are not violent or threatening (i.e. no shooting, damage, etc.)\r\n</li><li>For the Patria - Game focuses on cultural subject - folklore, mythology, tradition, food, landscape, etc.</li></ul>", "metacritic": null, "released": "2020-10-04", "tba": false, "updated": "2020-10-05T05:35:40", "background_image": "https://media.rawg.io/media/screenshots/611/6114f4e023841c3dd56d4bcdc98f3bdc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 81, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ofelipegabriel321", "nelsonwenner", "KeyjinBR", "rickdipaula", "Thallano", "MADdantas"], "genres": [], "publishers": [], "esrb_rating": null}