{"id": 501580, "slug": "spring-action", "name": "Spring Action", "name_original": "Spring Action", "description": "<p>HOW TO PLAY\r\n</p>\n<p>Tap and hold down on the screen to move the rabbit in that direction. He'll bounce off the walls and ceiling of the stage, as well bounce off blocks and the springs at the bottom of the screen. If you tap just as he bounces, you'll earn a Tap. The more Taps you have, the more powerups unlock at the top of the screen. Some breakable blocks also reveal randomised powerups to collect; just run into them to use them immediately. Only one powerup can be used at a time, so choose wisely. But some powerups (like Multi or Size) can be stacked if you collect them more than once.<br/></p>\n<p>NO IN-APP PURCHASES</p>\n<p>There are no options to gain an advantage over other players, just your own mastery of the game. There is no stamina system in place to wear down your patience. This game is safe for all ages.</p>\n<p>MOONSAILOR</p>\n<p>The themes and sound design for this game were provided by Rafael Langoni Smith in association with Moonsailor. Please look up their website and Bandcamp if you like the audio in Spring Action!<br/></p>\n<p>https://langoni.com/</p>\n<p>https://moonsailor.com/</p>\n<p>https://moonsailor.bandcamp.com/<br/></p>\n<p>DEMO AND FEEDBACK</p>\n<p>If you feel there are things that can be changed with the game like movement and controls, or things that can be added to make the experience more enjoyable or tough, please leave your comments. Please also share this game with friends so they can provide their own thoughts.</p>", "metacritic": null, "released": "2020-10-04", "tba": false, "updated": "2020-10-05T05:37:34", "background_image": "https://media.rawg.io/media/screenshots/61b/61bdaed95f92c38983b5543fe9a5b86e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 78, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["1988stevenm"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}