{"id": 50156, "slug": "way-of-defector", "name": "Way of Defector", "name_original": "Way of Defector", "description": "<strong>Lives of real North Korean defectors</strong><br/><br/>Do you see North Korea simply as an Axis of Evil or a country to make fun of? But the lives of real North Koreans are far from evil or comical.<br/><br/>Way of Defector is a board game through which you experience the process of a North Korean defector escaping to China and arriving in South Korea. You must overcome starvation and break through the surveillance of the Public Security Officers to find the broker who knows the way to get to South Korea and safely arrive at the destination.<br/><br/>Choose from various scenarios based on true stories to create your own defection story.Game Features<ul>Scenario based on a true storyExperience the real life of a defector through a scenario written based on an actual memoir of a North Korean defector.<li>Your own story, not a predefined scenario<br/>Create your own escape story from North Korea through a changing scenario based on your own choices, instead of playing a game determined by a specified scenario.<br/></li><li>North Korean defectors with diverse stories and abilities<br/>North Korean defectors escaped from North Korea due to various reasons. They possess abilities accumulated over their lifetime and must go to South Korea using these abilities.<br/></li><li>Survival and growth of North Korean defectors<br/>Keep your character alive and escape by averting the surveillance of the Public Security Officers and hunger.</li></ul>", "metacritic": null, "released": "2017-12-12", "tba": false, "updated": "2019-08-28T22:03:37", "background_image": "https://media.rawg.io/media/screenshots/8f4/8f4cf25b40205b083f8dccf88b76cbbb.jpg", "website": "http://Devarc.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 380, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dev Arc"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["Dev Arc"], "esrb_rating": null}