{"id": 50165, "slug": "neverwinter-nights-enhanced-edition", "name": "Neverwinter Nights: Enhanced Edition", "name_original": "Neverwinter Nights: Enhanced Edition", "description": "<p>Neverwinter Nights: Enhanced Edition adds all-new enhanced features to the content of Neverwinter Nights Diamond Edition.<br />\nSlink through the shadows as a deadly half-elven rogue, wield fearsome magics as a powerful gnomish sorcerer, vanquish your foes as an armor-clad dwarven paladin... whatever hero you create, incredible adventures await.<br />\nDiscover magic, wonder, and danger at every turn on your own or with friends in these classic Dungeons &amp; Dragons adventures.Enhanced Features:Improved Display: Your portrait, combat bar, inventory, and other UI elements adjust in size based on your chosen resolution including 1080p and 4k.<br />\nAdvanced Graphics Options: Pixel shaders and post-processing effects make for crisper, cleaner visuals. Enable contrast, vibrance, and depth of field options as preferred.<br />\nCommunity Endorsed: Original developers have teamed with key members of the Neverwinter Nights community to curate important fan-requested improvements to support players, storytellers, and modders.<br />\nBackwards Compatibility: Works with save games, modules, and mods from the original Neverwinter Nights. A galaxy of community created content awaits.All the content of Neverwinter Nights Diamond Edition:The original Neverwinter Nights campaign: Find yourself at the center of intrigue, betrayal, and dark magic in Neverwinter Nights. Journey through dangerous cities, monster filled dungeons and deep into uncharted wilderness in search of the cure for a cursed plague ravaging the city of Neverwinter.<br />\nTwo expansion packs:<br />\nShadows of Undrentide: Another adventure begins in Shadows of Undrentide! Charged by your master to recover four ancient artifacts, travel from the Silver Marches to unravel mysteries of a long-dead magical civilization.<br />\nHordes of the Underdark: Continue the adventure started in Shadows of Undrentide and journey into the ever-more bizarre and hostile depths of Undermountain to challenge a gathering evil.Three premium modules:<br />\nDiscover over 40 hours of new stories, then go on to sample the hundreds of modules created by community members just like you.<br />\nKingmaker<br />\nShadowGuard<br />\nWitch’s Wake The Aurora Toolset: Build your own world full of unique monsters, items, traps, encounters, and settings, then share your creation with the rest of the Neverwinter Nights community. (Windows only)<br />\nDungeon Master Client: Become the storyteller! Control monsters, creatures, and characters your players will meet over the course of an adventure.</p>", "metacritic": null, "released": "2017-03-27", "tba": false, "updated": "2024-02-25T16:05:09", "background_image": "https://media.rawg.io/media/games/2fd/2fd22c97f779363102e7a5d8e4306ebf.jpg", "website": "http://nwn.beamdog.com", "rating": 4.07, "rating_top": 4, "added_by_status": {"yet": 131, "owned": 1170, "beaten": 55, "toplay": 40, "dropped": 47, "playing": 17}, "playtime": 3, "achievements_count": 59, "ratings_count": 136, "suggestions_count": 600, "game_series_count": 0, "reviews_count": 138, "platforms": ["PlayStation 4", "Xbox One", "Nintendo Switch", "Android", "PC", "macOS", "Linux"], "developers": ["BioWare", "Beamdog"], "genres": ["RPG"], "publishers": ["Beamdog"], "esrb_rating": "Everyone 10+"}