{"id": 501642, "slug": "tombstones", "name": "Tombstones", "name_original": "Tombstones", "description": "<p><strong>THE STORY:</strong></p>\n<p>\r\nOur hero - <em>EL GRINGO</em> - is infamous for being the fastest and most dangerous gunslinger in the wild, wild west. But he is tired of killing, and wants to retire from his gunslinger career to settle down with his true love, <em>MISS. JIGGLYTITS</em>. However, having this stellar reputation tempt outlaws from the whole wide west to seek him down for duels! Will it be possible for <em>EL GRINGO</em> to survive his retirement day and get to his true love?</p>\n<p><strong>AIM OF THE GAME:</strong></p>\n<p>\r\nTo get to his true love, <em>EL GRINGO</em> has to gun down 6 outlaws on 3 different stages: The Desert, The City and The Graveyard. Each outlaw is slightly quicker than the previous, so <em>EL GRINGO</em> has to summon all his reaction, speed, and will to survive.</p>\n<p><strong>HOW TO PLAY:</strong> </p>\n<p>Press space to start the game. Place your fingers on the keyboard while you GET READY. When a random character is displayed on the screen, you have to press the same character on the keyboard to draw and shoot your gun! If you are too slow, or you press the wrong character, you will get wasted.  To quit the game and return to the intro press \"RUN/STOP\"</p>\n<p><strong>TRAINER:</strong></p>\n<p>You can press \"F8\" to activate/de-activate the trainer. This can only be done on the intro screen. If the trainer is activated, the border changes color to dark blue. The trainer gives you full invincibility and you will never loose a duel. Keep in mind that a cheater is not worthy of any points on the hall of fame, so the score will remain at ZERO points as long as you have the trainer activated.  You can always return to the intro by pressing \"RUN/STOP\" and deactivate the trainer.     </p>\n<p><strong>HI-SCORE SAVER:</strong></p>\n<p>\r\nIf you have a disk-drive or you play the D64 version on an emulator, the game has a built-in high score saver. </p>\n<p><strong>CREDITS:</strong> </p>\n<p>Programming by Docster<br/>\r\nGraphics and Music by Rotteroy<br/>\r\nBased on idea by Drumtex<br/>\r\nCoding assistance: Scroll and Majikeyric<br/>\r\nPlaytesting and moral support by Majikeyric, Drumtex, Scroll, Rage and Sparkler</p>\n<p>Instructions page made by Majikeyric with Petscii graphics by Shine, and sprites by Sparkler and Rotteroy.</p>\n<p>Loading Picture by Sparkler\r\nLoading Music by Rage</p>\n<p>Developed in 2017 by Megastyle.</p>\n<p>Physical version distributed by Reset 64 on the coverdisk of Reset magazine issue number 10 august 2017.</p>\n<p>Digital version distributed by Megastyle on ITCH and CSDB september 2017</p>", "metacritic": null, "released": "2020-10-03", "tba": false, "updated": "2020-10-05T05:52:48", "background_image": "https://media.rawg.io/media/screenshots/23a/23a2a56af7d052bc7c686841af37ddd7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 108, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Docster"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}