{"id": 5017, "slug": "normaltanks", "name": "NormalTanks", "name_original": "NormalTanks", "description": "<p>NormalTanks is a fast-paced multi-directional top-down arcade shooter featuring classic run&#39;n&#39;gun gameplay with 3 difficulty settings. At the 8 challenging, dynamic and hazardous environments, inside the enemy bases or forests and mountains, you have to choose your battle tactics carefully to survive!<br />\nOver the 30 dangerous enemies types on your heroic way, including various tanks, machines and helicopters, robots and biomechanical creatures, pillboxes and missile sites. Crash, kill and destroy them all to move forward and with help of the red star power-ups, which upgrades your tank abilities: cannon, machine gun, shield and speed.<br />\nSome levels transform you to tiny mine-bot to stealth pass near the enemies and deactivate energy fields or to giant walking robot, which demolish everything on his way to the alien&#39;s hive!<br />\nTry to finish the game without lost any life and save the universe the classic, old school arcade way!<br />\nPurchase or use of this item is subject to the PlayStation®Network Terms of Service and User Agreement. If you do not wish to accept all these terms, do not purchase or use this item. This item has been sublicensed to you by Sony Computer Entertainment America. One-time license fee for downloads to up to 2 console systems and 2 portable systems that are associated with the purchasing account.</p>", "metacritic": null, "released": "2010-04-29", "tba": false, "updated": "2022-07-25T08:38:41", "background_image": "https://media.rawg.io/media/games/c5b/c5bebd0f874a0f288efe71f57d51f381.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 328, "game_series_count": 0, "reviews_count": 0, "platforms": ["PSP"], "developers": ["Beatshapers"], "genres": ["Action", "Shooter"], "publishers": ["Beatshapers"], "esrb_rating": "Everyone 10+"}