{"id": 501792, "slug": "stars-apart-together", "name": "Stars Apart, Together", "name_original": "Stars Apart, Together", "description": "You're stargazing through your telescope. What a wonderful splendor of colors and twin-wait what's that?!\r\n\r\n🌟Gameplay🌟\r\n<p>A astral virus is causing calamity in the skies above, luckily a cure is being made- you just have to hold out until then. You accomplish this with your <em>Cosmic Manipulator</em>; a wand capable of moving the astral bodies. In order to keep the virus at bay, the best course of action, while waiting for a vaccine, is to keep the stars separate from each other. Do this by clicking and dragging them apart from each other. </p>\r\n🌟How to win!🌟\r\n<p>When stars are too close, your <em>Star Power</em> is drained. Run out of <em>Star Power</em>, and the galaxies will dim forever. Create constellations by double clicking  stars that are a safe distance apart from each other. Double click in empty space to score them. Dragging them apart from on another will also keep your <em>Star Power</em> intact.  Keep your <em>Star Power</em> up until the vaccine is made (60 seconds). </p>\n<p>The <strong>ONLY </strong>way to get rid of the virus stars, is to plot out your constellations in such a way that the virus bounces off of them and into a nearby black hole- thus quarantining them!</p>\r\n🌟How to lose! (If you're into that kind of thing)🌟\r\n<p>You'll notice that the virus will multiply as time goes on and create more chaos by bumping into celestial bodies. When they touch a virus star, your <em>Star Power </em>will be drained.  Stars that are too close, will also drain your power. The more stars that are clumped up, the faster your star power will drain. </p><p><strong>A word of warning:</strong> Just like in real life, it's better to avoid high density populations. IRL, you could get sick. In game, you could actually explode the entire universe; you'll see...</p>\r\n🌟Controls🌟\r\n<p>Left click and hold: Drags the stars</p>\n<p>Double click safe stars in succession: Creates constellations</p>\n<p>Right click: Cancels your current constellation</p>\r\n🌟Why?🌟\r\n<p>This game was made in under two weeks for the Jamming The Curve gamejam host by Indiecade. First and foremost, <em>MASSIVE </em>shoutout to the organizers- this was absolutely the most painless, chill, good vibes game jam I've had in a LONG TIME!</p>\n\r\n🌟Tools Used🌟\r\n<p>Everything in the game I made solo over the course of the jam. I was actually super excited to try my hand at some music and sound effects this time around (sorry if it sounds like a bunch of annoying ringtones on loop!!)</p>\n<ul><li>Unity3D</li><li>Blender</li><li>Reason</li><li>Figma</li></ul>\n\n<p><strong>🐛Known Bugs🐛</strong></p>\n<ul><li>When you have too high of a population and sink a covid-star into a black hole, you will get masks, BUT you will also launch every star in the known universe into god knows where.</li><li>If you're dragging a star and it goes off screen, you'll probably get some very cool and funny lines, just let the star go...it's for the best</li><li>Too many stars and too many covids, you're gonna have a bad time. Physics just go, RIGHT out the window</li></ul>", "metacritic": null, "released": "2020-10-03", "tba": false, "updated": "2020-10-05T06:24:38", "background_image": "https://media.rawg.io/media/screenshots/3dd/3dd838f8b12877ae73a5a73caa925078.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 21, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["SugarSores"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}