{"id": 501835, "slug": "outbreak-in-space", "name": "Outbreak in Space", "name_original": "Outbreak in Space", "description": "<p>This game was made for IndieCade's Jamming the Curve. </p>\r\nControls \r\nOverworld\r\n<ul><li>Arrow keys or WASD keys to move, shift to run</li><li>E to interact when nearby an interactable object</li><li>Mouse click and spacebar for dialogue actions</li></ul>\r\nMini Game\r\n<ul><li>Arrow keys or WASD keys to move </li><li>Mouse to rotate, mouse click to fire</li></ul>\r\nSynopsis\r\n<p>You live on an alien planet, in a town that is essentially a series of bubbles. The one scientist/doctor on the planet needs your help to get this new virus under control. You can use a mixture of persuasion, well-timed testing, and fine motor skills (via infection fighting mini game) to save your town from this new virus. </p>\n<p>This game seeks to make the numbers and statistics of infectious spread more personable and real, as you get to know and care for the NPCs before any real results from the viral infections are known. The town starts off with only one infected individual, and at first, everything seems fine, but since it takes several days for anyone to develop symptoms, as a player, you very quickly see how things can get out of control, and what impact public health measures like mask wearing can really have, especially for at-risk loved ones.</p>\r\nInfection System\r\n<p>Infection is spread by viral shedding. Breathing, speaking, singing, coughing all shed different amounts of viral particles, and different NPCs require different viral loads for infection to happen. As this is an alien planet, with alien species, this virus is *not* specifically COVID-19, but very much inspired by it.</p>\n<p>There are a number of private, luxury housing bubbles, as well as high-density housing bubbles. We really liked the idea of an alien space town to get to use the idea of social bubbles in a very literal sense.</p>\n<p>The infection system will not be visible at first, as you can't see infection spread in real life. After completing the game in a first playthrough, players will have the option to turn on visuals and to also change factors like helmet/mask effectiveness.</p>\r\nShedding Amounts\r\n<p>Amount of viral particles shed by contagious people by action below. There is also some variability in the percentage of these shed particles that nearby NPCs take in (average of 50%).</p>\n<ul><li>Breathing: 5 per second</li><li>Speaking: 75  per line</li><li>Coughing: 1500 per cough</li><li>Singing: 100 per second</li></ul>\n<p>*In addition, each contagious person has two radiuses around them for shedding particles, and characters that are closer get twice as many particles shed in their direction as those a bit farther away*</p>\r\nEffect of Masks\r\n<p>Masks in this game are helmets, and they halve the amount of particles shed by contagious people, and if susceptible people are also wearing masks, the amount is further halved.</p>\r\nViral Load Variability\r\n<ul><li>\"Normal\" person: 1,000 viral particles (average)</li><li>Elderly or immunocompromised: 500 viral particles (average) (at this point, Granny Murktuk is the only one who needs this lower viral load, but this will change)</li></ul>\r\nTime Factor\r\n<ul><li>2 days from infection to contagious</li><li>4 days from infection to symptomatic (chance at asymptomatic not yet implemented)</li><li>4 days for test results to come back</li></ul>\r\nInfection Fighting Mini Game\r\n<p>When townsfolk get sick, you can spend energy to fight off the virus. The difficulty of the mini game is related to the immune system of the specific NPCs. A person who can recover without many symptoms would represent an \"easy\" difficulty. A person who is elderly and immunocompromised would mean a near-impossible mini game.</p>\r\nFuture Additions\r\n<p>We have so much we'd like to add with this game! Things we're thinking about:</p>\n<ul><li>More deeply explore the inequality between the two alien races </li><li>Add more options for NPC schedules / dialogue</li><li>Enable more end game content -- randomizing the initial case and giving the player more of a chance to play detective and contact trace, as well as giving the option to customize settings like helmet effectiveness, % at-risk, shed amounts and others, to let the players really experience what all these numbers would mean in an enclosed space.</li><li>More intricate infection system mechanics</li><li>Potentially explore how a game like this could be used in middle school / high school settings as a way to prompt discussion</li><li>Introduce more of an NPC \"hive mind\" -- having NPCs that react to the news and events of the town</li><li>Larger population and travel between sectors</li></ul>\r\nCredits\r\n<p>Juan Lr: Art &amp; Map Design (Instagram)<br/>Kapden: Music and Sound Design (Instagram)<br/>Leo Pancho: Programming<br/>Patrice Metcalf-Putnam: Programming, Writing, Game Dialog (Twitter)<br/><br/>Special thanks Raventrapta: Dialog Assistance<br/></p>", "metacritic": null, "released": "2020-10-03", "tba": false, "updated": "2020-10-05T06:33:35", "background_image": "https://media.rawg.io/media/screenshots/ef0/ef064b698169f25516714ad3f0691168.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 59, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["lpancho", "Kapden", "Juan Rodrigues", "Patrice Metcalf-Putnam"], "genres": ["RPG", "Simulation", "Educational"], "publishers": [], "esrb_rating": null}