{"id": 501970, "slug": "wayra", "name": "Wayra", "name_original": "Wayra", "description": "<p>\n</p>\n<p>En la cultura Andina la música es considerada importante en la vida cotidiana y en la vida espiritual, es utilizada para expresar emociones y sentimientos. <br/></p>\n<p>“Wayra” es un juego basado en la música Andina y los instrumentos de viento presentes en casi todos los ritmos de mi país, Bolivia, entre ellos se puede mencionar: la zampoña, la quena, la tarca y el pinquillo. </p>\n<p>“Wayra” es un <em>endless runner (corredor infinito)</em>, con un estilo y atmósfera distinto a otros juegos del género.</p>\n\n<p>Al momento de jugar un nivel, los personajes y el ambiente danzan al compás con la música. Conecta unos auriculares y te conectará a efectos de sonido impecables y música serena del viento.</p>\n<p>El juego está ambientado en un lugar de Los Andes, donde, existe una aldea de conejos que adoraban explorar los cielos en sus pequeñas naves, pero no se atrevían a volar lejos de su bella aldea. Sólo uno de los conejitos llamado \"Wayra\" reunió el valor de explorar más allá del confort de su hogar. Ésta es su aventura...</p>\n<p>(Por favor usa el botón de maximizar pantalla para ver mejor el juego, está abajo a la derecha del juego)</p>\n<p><strong><em>Hecho en Bolivia por Edson Veneros</em></strong></p>\n<p>Para Unidos Online Game Jam<br/></p><p>(English Ver.)</p>\n<p>In Andean culture, music is considered important in daily life and in spiritual life, it is used to express emotions and feelings.</p>\n<p>“Wayra” is a game based on Andean music and the wind instruments present in almost all the rhythms of my country, Bolivia, among them we can mention: the zampoña, the quena, the tarca and the pinquillo.</p>\n<p>\"Wayra\" is an endless runner, with a style and atmosphere different from other games of the genre.</p>\n<p>When you play a level, the characters and the environment dance in time with the music. Plug in a pair of headphones and you'll be hooked up to flawless sound effects and serene wind music.</p>\n<p>The game is set in a place in Los Andes, where there is a village of rabbits that loved to explore the skies in their small ships, but did not dare to fly far from their beautiful village. Only one of the bunnies named \"Wayra\" mustered the courage to explore beyond the comfort of her home. This is her adventure ...</p>\n<p>(Please Use fullscreen button, at the right bottom corner of the game)</p>\n<p><strong><em>Made in Bolivia by Edson Veneros</em></strong></p>\n<p>For Unidos Online Game Jam<br/>All music and fx is Free to Use.<br/></p>", "metacritic": null, "released": "2020-10-02", "tba": false, "updated": "2020-10-05T07:06:51", "background_image": "https://media.rawg.io/media/screenshots/60f/60f5c277aa5a18af190418e555564fe2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 108, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Edson Veneros"], "genres": [], "publishers": [], "esrb_rating": null}