{"id": 501938, "slug": "tailgate-party", "name": "Tailgate Party", "name_original": "Tailgate Party", "description": "<p>Orab Games brings cornhole to your NES! This game was originally released in 2017 for the NES using the Power Pad peripheral. Three years after it's physical cartridge release, we are making the ROMs available! Challenge your friends to seven different games styles or test your skills against the computer in Story Mode as you sling bags across your living room. Tailgate Party is sure to become your new gameday tradition! <br/></p>\n<p>Features: <br/>Single Player Story Mode\r\n<br/>Multiplayer Vs Mode\r\n<br/>7 Different Game Styles\r\n<br/>11 Playable Characters<br/>16 Achievements\r\n<br/>Killer Soundtrack composed by Bleep Bop Records<br/></p>\n<p><strong>What's Included?</strong><br/>You will get access to the ROM files for the NES game Tailgate Party, written and published by Orab Games, and a PDF version of the game manual. For best results, use the most up-to-date Mesen emulator for these ROM files or a flash cart on real hardware with the newest mapper files installed for UNROM 512 and GTROM.<br/></p>\n<p><em>Tailgate Party - GTROM.nes and Tailgate Party - UNROM 512.nes</em><br/>These two ROM files are the actual commercially released game, but in two different mappers, UNROM 512 and GTROM. This is the same game that is on the NES cartridges.<br/></p>\n<p><em>Tailgate Party - Demo.nes<br/></em>This is a playable demo of the game that includes a modified version of game play that is not included in the actual game. It was originally developed to be used for a tournament.<br/></p>\n<p><em>Power Pad Test.nes<br/></em>This was a test program I wrote that checks if the buttons on the Power Pad are properly working. It was initially used to see if tossing corn-filled bags could register the sensors in the very early stages of development.<br/></p>\n<p><strong>Warning:</strong> This game was programmed to work on the original NES. What you are downloading are the actual ROM files for the game. You will need additional hardware or software to play the ROM files.</p>\n<p><strong>Requirements to play this game</strong><br/>- Supported NES Emulators or Flash Carts (Must support UNROM 512 or GTROM)<br/>- Power Pad<br/>- Set of 8 standard corn-filled bags or bean bags<br/>- retroUSB's USB NES RetroPort V2 (Needed for emulators. This adapter is the only known NES to USB adapter that supports the Power Pad)</p>\n<p><strong><em>Please Support<br/></em></strong>These ROMs are not for redistribution or to be included in downloadable ROM sets. These ROMs are for your private use to enjoy, please do not share them or post them anywhere else. If you enjoy this game, please support this project with a donation and share this page with your friends. Additionally, you can purchase a physical  copy of the NES game at our store on our webpage, www.orabgames.com.</p>\n<p>Thank you</p>", "metacritic": null, "released": "2020-10-02", "tba": false, "updated": "2020-10-05T06:59:50", "background_image": "https://media.rawg.io/media/screenshots/6a0/6a05e19a1ebd7ac6dde96cce6b65e53d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 52, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["orabgames"], "genres": ["Sports"], "publishers": [], "esrb_rating": null}