{"id": 50206, "slug": "flight-of-the-athena", "name": "Flight of the Athena", "name_original": "Flight of the Athena", "description": "Flight of the Athena is a unique vertical shooter, with a procedurally generated campaign and scenarios. Earn new craft, weapons and upgrades as you fly deep into enemy territory to destroy their central command, and turn the tide of this war.<br/><br/><strong>**Please note: Flight of the Athena is a dual-stick vertical shooter – a dual analogue XInput / Direct Input controller is required for each player**</strong><br/><br/>Key Features:<br/><ul><li><strong>Dynamic mission and scenario generation</strong> - Missions are generated and scaled based on a number of factors (campaign progress, difficulty, etc). Each experience will be unique, with the focus on air combat awareness rather than learning levels. Choose the routes and rewards that will serve you best, using the information to hand.<br/><br/></li><li><strong>Local co-op (2 to 4 player)</strong> - Form a wing and take on the campaign with additional pilots. Watch each others backs, and take care in the air!<br/><br/></li><li><strong>Varied ship classes and configurations</strong> - A number of craft are available, from the small and nimble Skydoos through to the lumbering but heavily armoured Capital ships. Each of these can be configured with a wide range of weaponry available - choose your loadout appropriately for the mission in hand.<br/><br/></li><li><strong>Multiple difficulty settings</strong> - A selection of difficulties are available, to suit the casual adventurer through to the hardcore shmupper.</li></ul><br/><br/>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:03:35", "background_image": "https://media.rawg.io/media/screenshots/6ed/6ed57be6e4e09e9aeccb0da0cb9f508c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 198, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["A To Play"], "genres": ["Action"], "publishers": ["A To Play"], "esrb_rating": null}