{"id": 502085, "slug": "soft-drizzle-b-track", "name": "Soft Drizzle: B-Track", "name_original": "Soft Drizzle: B-Track", "description": "<p><strong>Soft Drizzle: B-Track</strong> is a short visual novel about friendship and Halloween Festivals. It even includes an escape room!</p>\n<p>Made in a month for the 🍂 Great Harvest Game Jam 🍂 and the Spooktober Visual Novel Jam, although I missed the deadline for the first one.</p>\n<p>It's a sequel to my previous tiny visual novel, Soft Drizzle. You can play this one without having played the previous one, though.</p>\n<p>I had a lot of fun developing this game, I hope you enjoy it!</p>\r\nControls\r\n<ul><li><strong>Click </strong>to advance the text and examine objects.</li><li><strong>Click </strong>to select an option when prompted.</li><li>You can press Alt + Enter on Windows to switch the game to fullscreen, if you want, but it has been designed to run in a windowed resolution and I'd recommend you play it that way.</li></ul>\n<p>If you get stuck in the escape room you can download the file <strong>Soft Drizzle B Track - Clues.zip </strong>that contains a number of clues (including the solution) for all the puzzles.</p>\r\nCredits\r\n<p>I composed the music and drew the character sprites and UI, etc. The subway sound effects was created by <strong>TheMSsoundeffects</strong>. Other sound effects were taken from the SoundJay website.</p>\r\nBugs and stuff - PLEASE READ THIS!\r\n<p>If you spot a typo or a bug please tell me!</p>\n<p><strong>Known bugs:</strong></p>\n<ul><li>It seems that in some situations, saving and loading your game in the escape room can result in some items disappearing, leaving you trapped there for good. <strong>If this is your case, save, close the game, open it again and load your save file and everything should be working fine</strong>. I will try to address this bug as soon as the voting period finishes.</li></ul>\r\nPrequel\r\n<p>Soft Drizzle: B-Track is a sequel to my previous visual novel, Soft Drizzle. If you enjoyed this game, give it a go!</p>", "metacritic": null, "released": "2020-10-02", "tba": false, "updated": "2020-10-05T07:30:38", "background_image": "https://media.rawg.io/media/screenshots/369/3695bc8e73ea74418612f92fd28f32b1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 189, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Lartu"], "genres": [], "publishers": [], "esrb_rating": null}