{"id": 502118, "slug": "shattered-pixel-dungeon-roguelike-dungeon-crawler", "name": "Shattered Pixel Dungeon: Roguelike Dungeon Crawler", "name_original": "Shattered Pixel Dungeon: Roguelike Dungeon Crawler", "description": "<p>Shattered Pixel Dungeon is a Roguelike RPG, with pixel art graphics and lots of variety and replayability. Every game is unique, with four different playable characters, randomized levels and enemies, and over 150 items to collect and use. The game is simple to get into, but has lots of depth. Strategy is required if you want to win!</p>\n<p>This game is based on the freely available source code of Pixel Dungeon. It began as a project to improve on the original game&#39;s quirks, but has since evolved into a separate game, with many unique features.</p>\n<p>Shattered Pixel Dungeon includes:<br />\n- High replayability: Randomly generated levels, enemies, and items. No two games are the same!<br />\n- 4 hero classes: Warrior, Mage, Rogue, and Huntress. Each hero has a unique playstyle.<br />\n- 8 subclasses: Successful heroes can refine their skills to become more powerful.<br />\n- 5 distinct dungeon regions: each with their own enemies, traps, and quests.<br />\n- Over 150 different items: including powerful wands, rings, weapons, and armor.<br />\n- 50+ different enemies, 30 different traps, and 5 bosses to test your skills.<br />\n- Unique artifacts, which grow in power as you use them.<br />\n- Updates, with new content roughly once a month.</p>\n<p>Shattered Pixel Dungeon is a 100% free game. There are no advertisements, microtransactions, or paywalls. An optional donation to support the game unlocks a couple of fun extras, but these are entirely cosmetic and do not affect gameplay.</p>", "metacritic": null, "released": "2014-08-05", "tba": false, "updated": "2023-07-02T22:12:29", "background_image": "https://media.rawg.io/media/screenshots/b41/b41cc3f49f6d37811001d837358c7ebf.jpg", "website": "https://shatteredpixel.com/shatteredpd/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1, "beaten": 2, "toplay": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 184, "game_series_count": 0, "reviews_count": 3, "platforms": ["Android"], "developers": [], "genres": ["RPG"], "publishers": [], "esrb_rating": null}