{"id": 502184, "slug": "nuclear-last-darkness", "name": "Nuclear Last Darkness", "name_original": "Nuclear Last Darkness", "description": "\"When there is no more room in hell, the dead will walk among us.\"<br/>\r\nGeorge A. Romero<br/>\n<br/>\r\nFew remember the night they came to this world, because is better to forget the worst evils. Abalon, Dorkan and Bel'Uk invaded our reality in the worst way. And it was Abalon, the silent demon, who flew over the major cities. A curse with wings of bone. And was in this world only one night, long enough to take millions of lives. Dorkan, the demon who does not exist, stayed longer, nobody knows how long, because he drove entire cities to madness. No one could see it, but it invaded dreams and minds, and those who suffered from it were unable to wake up until death touched them.<br/>\n<br/>\r\nThe last was Bel'Uk, the demon of darkness, the most sadistic and ruthless. It usually appears out of nowhere and revives the dead, so that they torment us day and night. Bel'Uk is still with us, and the dead are still with him.<br/>\n<br/>\r\nThe demon of darkness hates light, so cities need electricity more than ever. The night is the ally of the dead. In the new times, those who work to generate energy are the enemy of Bel'Uk. And there are very few left who can. Large generators have been destroyed, energy is a scarce commodity in the world. Only a few nuclear power plants remain, created by the company \"Nucleares\" before the end of the world, so that they could be operated by a single person with the help of an assistant with Artificial Intelligence, built in remote places, and never used. Before the demons came, humanity was concerned about other things.<br/>\n<br/>\r\nYour job will be to generate energy in one of those nuclear power plants, even if you don't know how to do it, and keep an entire city alive, and survive Bel'Uk and the dead that accompany him.", "metacritic": null, "released": "2020-10-31", "tba": false, "updated": "2020-10-09T02:38:18", "background_image": "https://media.rawg.io/media/screenshots/525/52560e8797b9824d5d7be1568e8d4e1b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 297, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Iván Marcelo Pretti"], "genres": ["Action", "Adventure", "Simulation", "Indie"], "publishers": ["Iván Marcelo Pretti"], "esrb_rating": null}