{"id": 502150, "slug": "professor-lupo-ocean", "name": "Professor Lupo: Ocean", "name_original": "Professor Lupo: Ocean", "description": "Professor Lupo: Ocean is the epilogue and standalone sequel to the \"<strong>Professor Lupo and His Horrible Pets</strong>\" saga. Waking at the bottom of the ocean aboard a crumbling spaceship, you and a confrontational A.I need to work together to not only repair it, but uncover the mysteries surrounding its crew and what happened to them. Uncover how the ship you're on board has ended up underwater, where the crew are, and why the ship's A.I keeps calling you a clone....<br/><br/><br/><br/>Professor Lupo: Ocean is a 2D grid-based puzzle and adventure game in which the story plays a key role. Building on the core gameplay from its predecessor and the much loved Professor Lupo series, Ocean implements water, a key element you’ll need to use to overcome obstacles and find your way off the ship. <strong>Will You Be Able to Escape?</strong><br/><br/><br/><br/><ul><li><strong>Story:</strong> The stand alone sequel to Professor Lupo and his Horrible Pets, Lupo: Ocean is a rich story-driven adventure across 40 levels, that’s filled with plot twists. Uncover the mystery of who you are, and why you’ve woken at the bottom of the ocean.<br/></li><li><strong>World:</strong> Professor Lupo: Ocean is populated by fascinating creatures and aliens that can help or hinder your progress. Learn their behaviour, utilise or avoid them to solve challenging puzzles. <br/></li><li><strong>Puzzles:</strong> Solve challenging, deadly puzzles and mini-games by using the flow and currents of water to your advantage. Discover all the hidden documents across each level to truly push your puzzle solving abilities. <br/></li><li><strong>Graphics:</strong> Hand-drawn 2D characters and creatures, beautifully realized.<br/></li><li><strong>Music:</strong> An original beautiful synth soundtrack that’s set to be released for all, for free. <br/></li><li><strong>Communication:</strong> Fully voice acted for greater immersion.</li></ul>", "metacritic": null, "released": "2020-10-05", "tba": false, "updated": "2020-10-09T02:20:36", "background_image": "https://media.rawg.io/media/screenshots/2b7/2b7c08d73170bf81d4ed540b20330141.jpg", "website": "http://www.beautifungames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 251, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["BeautiFun Games"], "genres": ["Adventure", "Indie"], "publishers": ["BeautiFun Games"], "esrb_rating": null}