{"id": 502246, "slug": "against-the-storm-demo", "name": "Against the Storm Demo", "name_original": "Against the Storm Demo", "description": "Rebuild to last!\n<br/>\n<br/>\nAgainst the Storm is a roguelite city builder set in a fantasy world tormented by the everlasting rain. Settle the unknown wilds to discover and rebuild the ruins of a long-forgotten civilization. Develop technologies that will help your citizens tackle destructive storms and extend the frontier of your civilization.\n<br/>\n<br/>\nA unique combination of city building and roguelite genres makes each playthrough a unique adventure. Every reclaimed ruin increases your buildings’ collection. Optimize your set and test different strategies with each run to thrive in a world where it never stops to rain!\n<br/>\n<br/>\n\nMain Features<ul><li>Engage in city building core amped up with roguelite’s replayability\n<br/>\n</li><li>Harness three rain seasons which dictate constant shifts in your strategy \n<br/>\n</li><li>Manage a city inhabited by three races with different needs and skillsets\n<br/>\n</li><li>Discover and incorporate long-forgotten technologies that influence your playstyle\n<br/>\n</li><li>Build and grow a city that will endure harsh weather conditions</li></ul>City builder...Build and nurture your settlement in the unforgiving wilds. Take control of a growing population of humans, beavers, and lizardfolk - the last sentient races that opposed neverending storms. Manage their living conditions, diverse eating habits, and utilize their unique proficiencies. Gather scarce resources and process them into valuable goods, the most essential of them being hearth-keeping fuel.\n<br/>\n<br/>\n\n\n...meets rogueliteStart every playthrough with different conditions and toolsets that guarantee unique experiences on procedurally generated maps. Randomly assigned long-term goals will tempt you with visions of great rewards and motivate you to experiment with new strategies. Expand your meta hub and the collection of buildings by preserving valuable relics of your predecessors.\n<br/>\n<br/>\n<br/>\n\nReclaim and rebuildThe world is filled with ruins of a long lost civilization that vanished in unknown circumstances. Who were they? Was it the rain that wiped them out or some greater threat that lurks in the uncharted lands? During every settling expedition, you can reclaim and rebuild what was once lost to unlock new technologies that will help you avoid the tragic fate of previous inhabitants.A world tormented by the stormThe rain is your ally and the greatest enemy. It cycles in three seasons requiring you to stay flexible and adapt to changing conditions. In Drizzle, the season of regrowth, natural resources replenish themselves, and it’s time for construction and planting crops. The Clearance is the season of harvest, expansion, and preparations for the last, most unforgiving season of them all. A true test of your city’s strength comes with the Storm when bolts of lightning tear the sky, nothing grows and resources are scarce.Community-driven developmentWe aim to constantly provide you with new opportunities and infrastructure to influence the making of the game. Our goal is to incorporate your feedback into development cycles and spark a genuine belief of contributing to the world of Against the Storm.", "metacritic": null, "released": "2020-10-06", "tba": false, "updated": "2020-10-09T03:14:35", "background_image": "https://media.rawg.io/media/screenshots/313/31315c52b17a4fafe58012caed962f3c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 20}, "playtime": 0, "achievements_count": 2, "ratings_count": 0, "suggestions_count": 452, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Eremite Games"], "genres": [], "publishers": ["Eremite Games"], "esrb_rating": null}