{"id": 502281, "slug": "presidents-rule-the-usa", "name": "Presidents - Rule the USA", "name_original": "Presidents - Rule the USA", "description": "Are you watching the presidential campaigns and thinking that you could do better? Well, why not become the President and see if you can be the leader of the free world? <br/><br/>Be aware every decision you make will have an effect.  With great power comes great responsibility to your fellow citizens. <br/><br/>Do you still think you can hack being the President?  Become the president and endure the politics, wars, lies, real-life scenarios that every president faces and make name for yourself. <br/><br/>Will you be able to find a balance between a luxurious lifestyle, your family, and a president’s duty to their country? Will you sellout for money, or fight to the last breath to preserve the welfare and the prosperity of the United States of America?<br/><br/><br/> With each scenario, you will feel the pressure of being a president, yet also feel the exhilaration and pride of the office.The unpredictable nature of the world will captivate you.The game affords the player the opportunity to reflect on their political beliefs and values as they engage in the political discourse.  Strategy and long-term plans will face domestic and foreign threats. Each decision will require you to weigh many factors. Your country depends on you. Do your part to help America succeed. <br/><br/>Presidents | Rule the USA allows you to:<br/><br/>– Swipe to determine the fate of United States of America,<br/>– Make 250+ choices that will change the balance of the world,<br/>– Live the change and feel the pressure of being the President,<br/>– Make your own decisions as the President of the USA!<br/> <br/>Live your dream of being the president of the most powerful country in the world!<br/><br/>If you have any questions or comments, feel free to contact Presidents App (us) at support@presidentsapp.com, or visit Presidents App Website at https://presidentsapp.com/ <br/>Privacy Policy: https://presidentsapp.com/presidents-app-privacy-policy/ <br/>Terms of Use:  https://presidentsapp.com/presidents-app-terms-of-service-presidents-app/ <br/><br/>Become the most powerful president in US history.  Balance the economy, national, security, advancing technology and your own popularity, while keeping an eye on those vying for your office. Play Presidents App for the America of your dreams!<br/><br/>! Warning !<br/>Presidents App (this game) is a work of fiction. Names, characters, places and incidents either are products of the authors’ imagination or are used fictitiously. Any resemblance to actual events or locales or persons, living or dead, is entirely coincidental. The President App is respectful to all countries, presidents, governments, militaries, companies and their personnels. Presidents App cannot be held responsible for any misunderstandings, political crimes, false news, false information or any other indictment resulting from the texts or choices displayed in the Presidents App game. If you have any questions or comments, feel free to contact Presidents App (us) at support@presidentsapp.com, or visit Presidents App Website at https://presidentsapp.com/", "metacritic": null, "released": "2020-08-06", "tba": false, "updated": "2020-10-09T03:32:07", "background_image": "https://media.rawg.io/media/screenshots/e6c/e6c980ddbecc8dfc12554e9e883c8c17_Autz71p.jpg", "website": "https://presidentsapp.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 56, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mustafa Ayten"], "genres": ["Adventure", "Strategy"], "publishers": ["Mustafa Ayten"], "esrb_rating": "Teen"}