{"id": 502270, "slug": "color-by-music-coloring-game", "name": "Color by Music: coloring game", "name_original": "Color by Music: coloring game", "description": "Make music to color pictures. <br/>Color pictures to make music!<br/><br/>Piano Coloring Subscription:<br/>The subscriptions are $5.99 weekly, $9.99 monthly, $39.99 annually.<br/>You'll be able to access unlimited coloring pages for the duration of your subscription.<br/>Payment will be charged to iTunes Account at confirmation of purchase.<br/>Subscription automatically renews unless auto-renew is turned off at leat 24-hours before the end of the current period.<br/>Account will be charged for renewal within 24-hours prior to the end of the current period at the cost of the chosen subscription.<br/>Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's Account Settings after purchase.<br/>- You may cancel a subscription during its free trial period via the subscription setting through your iTunes account. This must be done 24 hours before the end of the subscription period to avoid being charged<br/>- Please visit http://support.apple.com/kb/ht4098 for more information<br/>- You may turn off the auto-renewal of your subscription via your iTunes Account Settings. <br/>- Any unused portion of a free-trial period, will be forfeited when the user purchases a Paint Premium subscription<br/>You can read privacy policy and terms of use at http://coloringpuzzles.com/music-coloring-privacy/<br/>Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that content.<br/><br/>Prices are equal to the value that \"Apple's App Store Matrix\" determines is the equivalent of the subscription price in$USD.<br/><br/>Terms of Service and Privacy Policy - http://coloringpuzzles.com/music-coloring-privacy/", "metacritic": null, "released": "2020-10-01", "tba": false, "updated": "2020-10-09T03:27:50", "background_image": "https://media.rawg.io/media/screenshots/98f/98f8937781cdd2d5614a53a79d6a1eee.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 175, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Coloring puzzle games"], "genres": ["Puzzle"], "publishers": ["Coloring puzzle games"], "esrb_rating": "Everyone 10+"}