{"id": 50226, "slug": "pterodalien", "name": "Pterodalien", "name_original": "Pterodalien", "description": "The world is under siege by an alien armada. - Fight the aliens back and destroy the master alien ship. To get there you must close the 5 Gates.<br/>We know you have saved the world a lot of times, that is why we need you as a pilot to do it again. - Join now!<br/><br/>Pterodalien is the next Shoot 'em Up which takes another step forward in the evolution of the shmup-genre. As the story is made for players who act up to the principle \"first shoot - ask questions later\" the sophisticated gameplay-cycle gives the succesfull player the opportunity to stand out from the other players to get all the<strong> 48 achievements</strong>.<br/><br/>Now as the mission is clear the player will be equiped with high-tech<strong> space ship that can be upgarded</strong>. The palyer is able to <strong>earn upgarde points </strong>(attributes) after a Level-UP in the <strong>experience-system</strong>. The player can <strong>choose between</strong> different upgrades: main-gun, lasergun, homing-missle, Rocket, Speed, Health. - But decisions should be chosen <strong>wisely </strong>because some upgrades have a<strong> trade-off</strong>... So for <strong>example a homing-missile makes an easy hit but only a hit with the main-gun brings aditionally XP for you next Level-Up. </strong><br/><br/>In the tradition of Shmups, Pterodalien has it's <strong>own </strong><strong>combo-system</strong>: with each alien ship you shoot you will get a card from the type of alienship you have shot, you can get an XP-Bonus for <strong>3-of-a-type 4-of-a-type and 5-of-a-type, also another XP-Bonus for a 3+2 combo</strong>. But it is not that easy, the player <strong>starts with the chance for a 3-of-type, once this is reached the chance counter raises to 4</strong>. Then the player is able to reach a 4-of-a-type and so on. In case the player is not succesfull the <strong>counter is reset to 3</strong>. - So the succesfull player wil <strong>first aim and then shoot.</strong><br/><br/>After making achievements the player will get aditionally <strong>rank-points</strong> with reaching certain amounts the player will be <strong>promoted </strong>and reach a higher rank. <br/><br/>Pterodalien comes with<strong> 11 stunning sci-fi levels</strong> each of them has <strong>boss-fights</strong><br/><br/>Many <strong>Alien Bosses have a character and are giving comments</strong> during the bossfigt<br/><br/>The game has <strong>a lot of different types of enemy spacecrafts and turrets to shoot</strong>", "metacritic": null, "released": "2017-12-05", "tba": false, "updated": "2019-08-28T22:03:34", "background_image": "https://media.rawg.io/media/screenshots/12e/12ea504eaf6ab28085192783679976b9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 460, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kibosso Media"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Kibosso Media"], "esrb_rating": null}