{"id": 502276, "slug": "sword-master-story", "name": "Sword Master Story", "name_original": "Sword Master Story", "description": "'You, the one and only Sword Master in this world, <br/>fight for peace after the betrayal of the empire.<br/>Gather allies to help you and join forces for endless adventures and battles!’<br/><br/>With a really fast attack and brilliant skills given by the Dual Blade, <br/>Enjoy an action RPG that never gets boring!<br/><br/><br/>[Hack &amp; Slash]<br/><br/>• Double the pleasure and fun thanks to brilliant skill animations!<br/>• Exciting Action RPG that can be enjoyed even in idle mode!<br/>• A fantastic combination of attractive illustrations and unique pixel graphics!<br/> <br/>[Adventure and Story]<br/><br/>• Gather the goddesses as companions to participate in endless battles and earn rewards!<br/>• If you clear stages faster, you can get better rewards!<br/>• Discover the hidden truth through a new story every 10 stages.<br/><br/>[Character Collection RPG]<br/><br/>• Summon 40 unique heroes from mythology and legendary equipment.<br/>• Strategically deploy heroes of 4 different classes and 5 different attributes to win the battle!<br/>• The more characters you collect, the more the Buff will go up! Complete your character collection!<br/><br/>[Growth and equipment]<br/><br/>• Characters can become stronger through 'Level Up', 'Rebirth', and 'Transcendence'!<br/>• With a variety of costumes, they not only look more glamorous, but their abilities will also go UP!<br/>• Acquire more than 50 types of weapons and armor, and explode your potential with ' Reinforcement ' and 'Transcendence'!<br/><br/>[Various contents]<br/><br/>• Explore “Endless Dungeons”<br/>- Dark Dragon, Dark Lord's Tower and the Gold Dungeon, that will stimulate infinite growth and challenges!<br/>• Defeat your first Raid Boss now on the newly Global Server, prepared for the Global Launch!<br/>• Challenge other users in ‘Global PVP’ and become a true Sword Master in another world!<br/><br/>[Guild System]<br/>• Protect your territory from outside forces with your guild members!<br/>• Clear the Guild Dungeon and challenge the Guild to a higher level!", "metacritic": null, "released": "2020-10-05", "tba": false, "updated": "2020-10-09T03:30:18", "background_image": "https://media.rawg.io/media/screenshots/606/6060ff9dc9e08470ba9bb77664002e32.jpg", "website": "http://www.superplanet.net/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 402, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["SuperPlanet"], "genres": ["Action", "RPG"], "publishers": ["SuperPlanet"], "esrb_rating": "Teen"}