{"id": 502215, "slug": "slime-pandemic-td", "name": "Slime Pandemic TD", "name_original": "Slime Pandemic TD", "description": "Defend the galaxy against a slimey pandemic. It is up to you to eradicate the disease before it has the chance to infect the entire universe.<br/>This classic Tower Defence game comes with with new, fresh mechanics to challenge your tactical skills. Build towers to defend these planets and strategize against the infection.<br/><br/><h3>Build and upgrade towers!</h3><br/><ul><li> <strong>20+ unique towers!</strong> - You build towers to defend against the infection. Learn how they work and how they synergize with eachother. </li></ul><ul><li> <strong>Powerful abilities!</strong> - Each fully upgraded tower has a powerful ability you can activate on the battlefield. They can only be used once per mission, so use them wisely. </li></ul><br/><h3>Save the galaxy step-by-step!</h3><br/><ul><li> <strong>Discover!</strong> - Uncover the 40+ unique kinds of enemies with different traits, strengths and weaknesses. </li></ul><ul><li> <strong>Unique challenges!</strong> - Each mission is different and offers unique challenges and in-game locations. </li></ul><br/><h3>Choose your loadout!</h3><br/><ul><li> <strong>Customize!</strong> - You can choose what towers you have access to between missions. Some towers may be more effective on certain missions. </li></ul><ul><li> <strong>Progress!</strong> - Increase the size of your loadout by performing well on your missions. </li></ul><ul><li> <strong>Experiment!</strong> - Change your loadout often to approach the challenges of each mission in new ways. </li></ul><br/><br/><ul><li><h3>Hard-Mode!</h3></li></ul>Hard-Mode offers a more challenging experience of the regular game that you can unlock after you've fully completed the normal campaign.", "metacritic": null, "released": "2020-10-07", "tba": false, "updated": "2020-10-09T02:58:00", "background_image": "https://media.rawg.io/media/screenshots/f8d/f8d1c010a5a0e21ba621d2806cc6c38f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 183, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Christoffer Tornell"], "genres": ["Strategy"], "publishers": ["Christoffer Tornell"], "esrb_rating": null}