{"id": 50228, "slug": "la-tale-2017", "name": "La Tale", "name_original": "La Tale", "description": "La Tale is a beautiful 2D side-scrolling fantasy MMORPG with fast-paced combat and endless customization. Choose from 9 distinct Classes and over 50 potential Job Specialties to create your own unique Hero of legend. Visit small towns and vast cityscapes, conquer exploration fields and instance dungeons packed with quests and secrets, or challenge colossal area bosses either solo or with a party across 3 massive continents. Customize your Hero however you choose with upgradeable weapons, gear items, powerful magical enchantments, and rare outfits, plus helpful pets and unlockable titles and emotes that allow you to express yourself your way.<br/>Embark on an epic quest around the globe with other legendary heroes to battle against the forces of the Demon World and search for the renowned champion Iris Livier. The world of La Tale is yours discover – how will your tale be told?Key Features<ul><li>Choose from 10 distinct Classes and over 50 potential Job Specialties<br/></li><li>Unlock extensive unique Skill Trees and Weapon Masteries<br/></li><li>Challenge colossal bosses either solo or with a party<br/></li><li>Explore 3 sprawling continents with cities, fields, dungeons and secret areas<br/></li><li>Customize your Hero’s appearance with near-endless options<br/></li><li>Collect and raise Pets with unique helpful skills<br/></li><li>Join a Guild and increase its rank for special bonuses<br/></li><li>Challenge other players in fast-paced PvP duels<br/></li><li>Craft, upgrade, and enchant weapons, gear, and accessories<br/></li><li>Open a Shop and engage with the player-driven economy</li></ul>", "metacritic": null, "released": "2017-11-28", "tba": false, "updated": "2024-02-01T03:41:13", "background_image": "https://media.rawg.io/media/screenshots/7f8/7f83ec85a55c51d12268f708881b5b20.jpg", "website": "https://latale.papayaplay.com/latale/", "rating": 2.07, "rating_top": 1, "added_by_status": {"yet": 25, "owned": 697, "beaten": 3, "toplay": 1, "dropped": 13}, "playtime": 1, "achievements_count": 0, "ratings_count": 29, "suggestions_count": 546, "game_series_count": 0, "reviews_count": 29, "platforms": ["PC"], "developers": ["Actoz Soft"], "genres": ["Action", "Adventure", "RPG", "Casual", "Massively Multiplayer"], "publishers": ["Papaya Play"], "esrb_rating": null}