{"id": 5022, "slug": "2010-fifa-world-cup-south-africa-psp", "name": "2010 FIFA World Cup South Africa PSP", "name_original": "2010 FIFA World Cup South Africa PSP", "description": "EA SPORTS™ celebrates the single largest sporting event on the planet with the only official and exclusively licensed videogame for the 2010 FIFA World Cup South Africa™. \r\n<br/><br/>\r\nExperience all the emotion and passion of the world’s fiercest national rivalries as you live the dream of competing against friends from around the world for the 2010 FIFA World Cup South Africa™. Take on the challenge of leading your home nation from qualification right through to a virtual re-creation of the final with all the pageantry, drama and excitement of the official tournament.\r\n<br/><br/>\r\nOfficial FIFA licensed product. \"© The FIFA name and OLP Logo are copyright or trademark protected by FIFA. All rights reserved.”  Manufactured under license by Electronic Arts Inc.  Player names and likenesses used under license from The International Federation of Professional  Footballers “(FIFPro)”, national teams, clubs, and/or leagues.\r\n<br/><br/>\r\nPurchase or use of this item is subject to the PlayStation®Network Terms of Service and User Agreement. If you do not wish to accept all these terms, do not purchase or use this item.  This item has been sublicensed to you by Sony Computer Entertainment America.  One-time license fee for downloads to up to 2 portable systems that are associated with the purchasing account.", "metacritic": null, "released": "2010-04-27", "tba": false, "updated": "2019-08-02T16:22:39", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PSP"], "developers": ["Electronic Arts"], "genres": ["Sports"], "publishers": [], "esrb_rating": "Everyone 10+"}