{"id": 502227, "slug": "ozone-guardian", "name": "Ozone Guardian", "name_original": "Ozone Guardian", "description": "<strong>SUMMARY</strong> — Easy to understand, addictive to play<strong>Ozone Guardian</strong> is a modern take on the classic arcade shooter with colourful stark visuals and equally addicting gameplay. <br/>You defend the ozone layer against groups of evil spaceships, which increase in quantity and power each time, and you're thrown at a large menacing boss every 5 rounds. <br/>Your dodging and timing skills reward you with higher points at the end of the round, which you spend on creative Upgrades in the Space Shop to boost your spaceship's capabilities. Whether you enjoy burning foes with damage over time, launching shuriken shaped blasts, shooting 4 shots simultaneously in a cone, piercing through enemies or firing at hit-scan speeds, the Shop has your creativity covered. <br/>With thousands of combinations, your choices matter in your spaceship's growth and will affect your experience moving forward at harder rounds. Purchase power in small increments each round, or save your points to large amounts to see the Shop offer some higher-level supreme upgrades. <br/><br/>You can choose to play a quick session on-the-go (casual, 5-10 minutes), experience the normal gameplay at its best (normal, 25-30 minutes), or take on a harder realm to truly exercise your precision (hard, ~1 hour).<br/>Enjoy our assortment of soundtracks to soothe your session, or get invigorated with an upbeat tune.<br/><br/>Save your best gameplay session on the global leaderboards and see how you fare against others around the world, in any category! <br/><br/>And all for the price of a cup of coffee.<strong>CONTROLS</strong>  — All with a mouse<ul><li><strong>Move at insane speeds</strong> - your spaceship's position is where your mouse cursor is. <br/></li><li><strong>Shoot simply and easily</strong> - launch shots upwards with a click or hold click to continuously shoot. </li></ul><strong>FEATURES</strong>  — Ever-growing with updates<ul><li> Wide variety of starting spaceships each with their own benefits and traits<br/></li><li> Randomized enemy spaceships with unique attack styles each round<br/></li><li> Creative bosses with stimulating skills that'll challenge your dodging precision<br/></li><li> An upgrade system that allows you to build upon your spaceship (power, size, speed, flame shots, homing shots, spread shots, and more!) <br/></li><li> Global leaderboard with statistics and records of gameplay sessions from other players<br/></li><li> Adaptive Shop system - dynamically displays upgrades relevant to your income and availability<br/></li><li> Large range of background soundtracks to harmonize with your experience<br/></li><li> Three difficulty modes (casual, normal, hard) to suit your skill level and time available</li></ul><br/><br/>Originally designed as a birthday gift to our father, Ozone Guardian took shape in a week and demonstrated potential to be a full production game. <br/>As a result, this game is designed for all ages, with easy mode for younger and elder audiences as well as difficult modes for the passionate gamers.<br/>UI icons and menus are large and easily legible at distances, and violence/graphic is cartoon explosions at maximum.<br/>We intend to add a huge list of more Upgrades in the Shop as well as expand on the character choices. More distinct bosses and crazy enemies are also planned.", "metacritic": null, "released": null, "tba": false, "updated": "2020-10-09T03:05:06", "background_image": "https://media.rawg.io/media/screenshots/826/8263b76fd50a854a1e8a3c20b9e6e90b.jpg", "website": "https://discord.gg/n8V6dHq", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 150, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Paraverse Games"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Paraverse Games"], "esrb_rating": null}