{"id": 502257, "slug": "superhero-racing-car-stunts", "name": "Superhero Racing Car Stunts", "name_original": "Superhero Racing Car Stunts", "description": "Hello! welcome to the Superhero Racing Car Stunts Game.<br/><br/>This tricky race is specially designed for racing kids download and enjoy the superhero car race. If you are looking for racing games for boys then this super hero game is for all kids. Many different superheroes with different dance moves are available in the garage for your fun with every superhero his car also is designed to select the gt racing stunts car start your car's engine for plain ramp stunts and crazy car stunts.<br/><br/>In this game, you are the superhero car stunts impossible tracks racer to perform the ramp stunts many different ultimate car stunts on vertical ramp extreme are designed to train you and make you a perfect stunts driver train your favorite superhero and enjoy the superhero impossible stunts car racing game. In this superhero impossible ramp car driving stunts game you have to perform amazing extreme speed stunts, car jump, and car stunts for crazy car driving. In this extreme gt racing game, many different levels contains reckless stunt, city car stunts, mega ramp car stunts, and extreme racing car stunts.<br/><br/>In this GT racing Ramp up for impossible project fasten your seatbelt and start your engine to burn the asphalt stunts by dodging the obstacles on impossible tracks many different obstacles like big fans, tubes, hammers, crushing machines are placed to destroy you and your gt car dodge them all and escape from the dangerous tracks. This superheroes City GT Car Stunts Game contains many stuntman car race 3d challenges and racing car extreme stunts select the super car and become the superhero jumper in this impossible car stunt racing. In this car stunt driving game many stunt car racing games modes are available. Enjoy the superhero mid-air ramp car stunt driving game. More than 20 gt racing sports cars and superheroes are available dozens of challenging levels and free mode also include select the car from garage first car is unlocked and the rest of the cars are locked play and complete the challenge to earn rewards through the game money you can buy locked cars or simply through In-app purchases you can buy.<br/><br/>Gameplay and Key Features:<br/><br/>-Every level contains a fixed time<br/>-Use the race button for acceleration<br/>-Use the brake button to reduce your car speed<br/>-Buttons, tilt, and steering for left and right movement<br/>-Use of nitro is the most important part of this game<br/>-Challenging mode, free mode and coins mode<br/>-Stunning 3d graphics<br/>-Modified GT racing stunts sports cars<br/>-Control your balance and grip on stunts tracks<br/><br/>Superhero Racing Car Stunts Game is continuously updating download enjoy share your thoughts with us for further improvements.", "metacritic": null, "released": "2019-10-26", "tba": false, "updated": "2020-10-09T03:23:02", "background_image": "https://media.rawg.io/media/screenshots/0da/0da82235b6853cd6b0c4b7e9723b8bfb_UqOzxyx.jpg", "website": "https://babartabbasum786.wixsite.com/website", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["HITBOX GAMES"], "genres": ["Sports", "Racing"], "publishers": ["HITBOX GAMES"], "esrb_rating": "Everyone 10+"}