{"id": 502497, "slug": "cdec2020", "name": "cdec2020", "name_original": "cdec2020", "description": "<p><em>Sigue las instrucciones detenidamente.\r\n<br/>Si necesitas asistencia técnica, ponte en contacto con nosotros:<br/> ayuda@futura.space<br/><br/></em></p>\n<p>\r\nPara acceder a la plataforma deberás usar un <strong>PC o MAC</strong> y preferiblemente entrar desde el navegador <strong>Google Chrome.</strong> En el caso de conectarse con un ordenador de ofimática, asegúrate de no estar ejecutando programas pesados como editores de imágenes o videos y reduce el número de ventanas y pestañas abiertas. Si utilizas un ordenador de última generación no será necesario. Como plataforma gamer, es recomendable, pero no obligatorio, hacer uso del ratón. En el caso de utilizar un ordenador portátil podrás hacer uso del trackpad<br/><br/></p>\n<p><strong>LO MÁS BUSCADO</strong>\n</p>\n<ul><li>Capítulo 3 - Cómo entrar en la plataforma </li><li>Capítulo 7 - Cómo moverte y girar cámara</li><li>Capítulo 10 - Preguntas y problemas comunes </li></ul>\n\n\n<p>Plataforma creada por Futura Space<br/></p>\n<p>\n<strong>1</strong>. Presiona Run Platform. </p>\n<p><strong><br/>2.</strong> Abajo en el borde derecho encontrarás el botón de ampliación de pantalla. Presiona aquí  para pantalla completa. <br/><br/><br/>\n<strong>3. PANEL DE ACCESO</strong>\n<br/><br/>Si es tu primera vez deberás registrarte. En el caso de que ya te hubieses registrado previamente puedes acceder directamente a través de Login haciendo uso de tu usuario y contraseña.\r\n<br/><br/><br/>\n<strong>3.1 Registro</strong></p>\n<ul><li>Selecciona un nombre de usuario, una contraseña y añade un email para la recuperación de datos. </li><li>Acepta los Términos y Condiciones</li><li>Presiona a Sign Up.</li></ul>\n<p>En la siguiente pantalla deberás seleccionar si entrás como invitado o  si accedes con entrada comprada:<br/><br/></p>\n<ul><li><strong>Usuarios con entrada</strong>\n<br/>Tenéis acceso completo a las herramientas de networking y a todos los contenidos gratuitos y a los de pago.\r\n<br/>\r\n- Introduce el código de tu entrada. <br/>- Clica al botón de acceder con entrada.<br/><br/>\n</li><li><strong>Usuarios sin entrada</strong>\n<br/>Tenéis acceso a todas las herramientas de networking y a los contenidos gratuitos pero no a los contenidos de pago.\r\n<br/>\r\n- Presiona el botón de entrar como invitado. <br/><br/><em>Nota:</em> Si una vez dentro de la plataforma quisieras comprar una entrada para acceder a los contenidos de pago clica al botón Comprar Entrada. Este botón lo encontrarás en el margen derecho de la interfaz y te redireccionará directamente a la venta de entradas de c de c. </li></ul>\n<p>\n<strong><br/>3.2 Login</strong>\n</p>\n<ul><li>Introduce tu nombre de usuario y contraseña.</li><li>Presiona Login\r\n</li></ul>\n<p>Si no recuerdas tu contraseña clica a, ¿has olvidado tu contraseña?:</p>\n<ul><li>Introduce el email de tu registro </li><li>Presiona el botón de Enviar. \r\n</li></ul>\n<p>Te enviaremos un correo electrónico de recuperación de contraseña.\r\n</p>\n<p>\n<strong><br/><br/>4.</strong> <strong>SELECCIÓN DE SALA <br/><br/></strong>\r\nSelecciona un hall en función de tu ordenador y el número de usuarios conectados en las salas.\r\nSiempre podrás volver a cambiarte de hall si tu sala se queda vacía o si tu ordenador necesitase una sala más pequeña para procesar la plataforma. \r\nSi tu hardware es:</p>\n<ul><li><strong>Gaming PC/MAC:</strong> Podrás acceder a salas con mayor número de capacidad de usuarios. (150 - 100 jugadores por sala simultáneos).<br/><br/>\n</li><li><strong>Standard PC/MAC:</strong> Podrás acceder a salas con un número medio de capacidad de usuarios. (60 jugadores por sala simultáneos).<br/><br/>\n</li><li><strong>Old PC/MAC:</strong> Podrás acceder a salas con menor número de capacidad de usuarios. (35 jugadores por sala simultáneos).\r\n</li></ul>\n<p>Selecciona tu sala y espera unos 10’’ a 15’’ segundos.\r\n<br/><br/><br/><br/>\n<strong>5.</strong> <strong>TU PERFIL</strong>\n<br/><br/>Aparecerá un mensaje de bienvenida. Presiona Let's Go.</p>\n<p><strong>5.1 Perfil Público</strong>\n<br/>\r\nA la izquierda de la pantalla verás que puedes completar tu perfil y añadir los datos que deseas compartir con otros usuarios. Esta será tu tarjeta de presentación visible para todos los usuarios.</p>\n<p><strong>5.2 Customizado del Avatar<br/></strong>A la derecha de la pantalla tienes disponibles las herramientas de personalización. \r\nEste es un espacio seguro e inclusivo en el que podemos ser nosotros mismos por lo que hacemos uso de avatares de género fluido. Si quieres customizar tu avatar hacía una orientación en concreto deberás hacerlo a través de la ropa, los complementos, el cabello, los rasgos faciales, entre otros.\r\nPresiona guardar una vez estés agusto con tu perfil.</p>\n<p>\n<strong><br/><br/>6.</strong> <strong>BIENVENIDOS A LOS DÍAS C <br/><br/></strong>\r\nAhora mismo te encuentras en el hall del Kursaal en San Sebastián. Tomate unos segundos para ubicarte. \r\nA tu izquierda encontrarás la programación diaria y a tu derecha verás el photocall. Te invitamos a que tomes una foto / captura de pantalla y la compartas en redes haciendo uso del hashtag #cdec2020<br/><br/>\n<br/><br/>Recordarte que en este evento online tú tienes el control. Con total libertad puedes recorrer este espacio virtual, conectar con otros usuarios y conversar con nosotros a través de las cuatro salas:</p>\n<ul><li><strong>Foyer</strong> <br/>Como punto de encuentro.</li><li><strong>Nuevas Conversaciones</strong> <br/>Reflexiones de un grupo de profesionales sobre cómo ven los cambios en el entorno, en las formas de consumir y en la propia naturaleza de los productos. Cada uno de estos testimonios se ha plasmado en una pieza audiovisual de algunos minutos de duración. Estas nueve piezas se emitirán a lo largo de las tres jornadas de los Días C.</li><li><strong>Zona Facebook<br/></strong></li>¡Bienvenido a la Zona Facebook! Un espacio en la que podrás aprender a hacer divertidos Reels a través de nuestra ‘Reels School’; te invitaremos a participar en nuestro concurso #AUPACDEC utilizando los filtros que hemos preparado para ti y que te transportarán a San Sebastián: ¡podrás ganar premios! Además, te presentamos en exclusiva ‘Conversaciones con’, breves charlas con creativos de alto nivel, y además, descubrirás todo lo que hacemos a través de Hack For Good. ¡Te esperamos!<br/><li><strong>Auditorio <br/></strong>Volver a encontrarnos creativos, productores, realizadores, medios, marketeers y todos los agentes de una industria que sigue viva y con unas ganas locas de hacer y decir nuevas cosas. Además de las conferencias, se podrá asistir a la Gala de entrega de los Premios Nacionales de Creatividad y del c de c de Honor y el premio JMM al talento joven.</li></ul>\n\n<p>\n<strong><br/><br/>7.</strong> <strong>COMANDOS TECLADO Y TRACKPAD</strong></p>\n<ul><li><strong>Para moverte: <br/></strong>W - hacía delante\r\n<br/>A - izquierda\r\n<br/>S - atrás <br/>D - derecha <br/><br/>\r\nTambién puedes hacer uso de las teclas de flechas.<br/><br/>\n</li><li><strong>Rotar cámara:</strong> clic derecho del ratón. En el caso de usar trackpad, clica con dos dedos y desliza hacía la dirección que quieres rotar. <br/>\n</li><li><strong>Saltar: </strong>Espacio<br/>\n</li><li><strong>Correr:</strong> Shift<br/>\n</li><li><strong>Bailar: </strong>cada vez que presiones la tecla Enter se te activará una animación de baile distinta. </li></ul>\n<p>\n<strong><br/><br/>8. NETWORKING</strong>\n<br/><br/>Al hacer clic encima de cualquier otro avatar. Te saldrán tres opciones: <br/><br/>- <strong>Perfil.</strong> Pulsa aquí y podrás ver el perfil público del usuario.\r\n<br/><br/> - <strong>Chat</strong>. Haz clic aquí si quieres chatear en privado con el otro usuario.\r\n<br/><br/> - <strong>Contactos</strong>. Presiona aquí y agrega al otro usuario en tu lista de contactos.\r\n<br/><br/><br/><br/>\n<strong>9. INTERFACE</strong><br/><br/>\r\nParte Izquierda:</p>\n<ul><li><strong>Perfil. <br/></strong>\r\nPulsa aquí si deseas volver a tu perfil público y cambiar cualquier dato o personalización del avatar.<br/>\n</li><li><strong>Chat. <br/></strong>\r\nHaz clic aquí para abrir o cerrar el chat general. Este chat es público para todos los usuarios. Todos los que estén conectados pueden leer lo que se escribe en el chat general. \r\nPara hablar en privado con alguien debes 1. agregarlo como un contacto o 2. hacer clic en su avatar.</li><li><strong>Contactos.</strong> <br/>Presiona aquí para ver su lista de contactos o para agregar nuevos. \r\nPara agregar nuevos contactos puedes 1. escribir su nombre de usuario o 2. hacer clic en su avatar. \r\nLos amigos que tienes en tu lista de contactos aparecerán en verde cuando estén conectados. En blanco cuando estén desconectados.\r\n</li></ul>\n<p>Parte derecha:</p>\n<ul><li><strong>Instrucciones.</strong>\n<br/>Haz clic aquí para volver a leer las instrucciones en cualquier momento.<br/><br/>\n</li><li><strong>Teletransporte</strong>\n<br/>Haz clic aquí y selecciona a la sala que quieres ir sin necesidad de caminar hacía ella.<br/><br/>\n</li><li><strong>Concursos</strong>\n<br/>Clica aquí para acceder a los concurso de los Días C.<br/><br/>\n</li><li><strong>Preguntas</strong>\n<br/>Presiona aquí para mandar tus preguntas al moderador en tiempo real. El moderador se las comunicará al ponente para que las pueda contestar.<br/><br/>\n</li><li><strong>Cambiar Hall</strong>\n<br/>Si te has quedado solo, notas que la plataforma va lenta o quieres cambiar de sala porque te apetece, clica aquí para ir a un hall diferente. \r\nEn el caso de que te hayas cambiado de hall por problemas técnicos y sigue sin funcionar correctamente ponte en contacto con nosotros en ayuda@futura.space\r\n</li></ul>\n<p>Parte inferior derecha:<br/><br/>\r\n- <strong>Reportar un Bug</strong><em>.</em> Haz clic aquí para informar de un error de software.</p>\n<p> - <strong>Rate Us</strong>. Presiona aquí para completar una breve encuesta sobre la plataforma. De esta forma nos ayudarás a optimizar y mejorar la experiencia del usuario.<br/><br/><br/></p>\n<p>\n<strong>10. PREGUNTAS COMUNES</strong></p>\n<ul><li><strong>¿Qué navegador es compatible con WebGL?</strong>\n<br/>Google Chrome, Mozilla Firefox y  Opera ofrecen una buena compatibilidad con WebGL. Asegúrate de haber instalado la última actualización del navegador. Recomendamos el uso de Chrome.</li><li><strong>¿Se puede acceder a través de Ipad o smartphone?.</strong>\n<br/>NO. La plataforma sólo se encuentra operativa para su uso en ordenador (PC/MAC).</li><li><strong>No se envían los mensajes del chat.</strong><br/>El servidor europeo ha reportado incidencias en los últimos días. Si no te deja enviar mensajes refresca la página (pulsando F5).</li><li><strong>Me ha saltado un error de buffer, o se ha puesto la pantalla en negro ¿Qué puedo hacer?.</strong>\n<br/>Habrás sobrepasado el limite de tu ordenador. Si no dispones de un hardware potente, cierra ventanas y pestañas que no estés utilizando para que tu ordenador pueda procesar los contenidos de la plataforma sin problemas. Y cambia de acceso a uno que tenga un menor numero de usuarios.  Si sigue dando problemas ponte en contacto con nosotros: ayuda@futura.space</li><li><strong>El avatar se ha quedado corriendo y no puedo pararlo.</strong><br/>Esto ocurre cuando no estás a pantalla completa y haces clic derecho fuera de la ventana de juego. Vuelve a clicar fuera de la ventana para detenerlo y ponte en pantalla completa para mejorar la experiencia ;)</li><li><strong>Cuando le doy enter en el customizador no se me carga la página siguiente.</strong><br/>Esto ocurre cuando le has dado a un acceso superior al que soporta tu ordenador.  Te recomendamos volverlo a intentar clicando a un acceso de 4 a 7. En el caso de que te siga pasando descárgate al paquete de Javascript y reinicia  el ordenador.<br/>https://www.java.com/es/download/help/index_installing.html</li></ul>\n<p>Si sigue dando problemas ponte en contacto con nosotros: ayuda@futura.space</p>", "metacritic": null, "released": "2020-10-08", "tba": false, "updated": "2020-10-09T04:18:25", "background_image": "https://media.rawg.io/media/screenshots/d48/d486789c3331101a3d8bab27b672b2c0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 21, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["cdec"], "genres": [], "publishers": [], "esrb_rating": null}