{"id": 502458, "slug": "mz-alertregion", "name": "[MZ] AlertRegion", "name_original": "[MZ] AlertRegion", "description": "<p><strong>License: </strong><br/></p>\n<p>Free for personal or commercial use. </p>\n\n<p><strong>Context: </strong>In games where player positioning is important for gameplay to trigger events depending on the player's position, it can be a tiring and repetitive task to exhaustion if all the tasks that involve this are done only by event commands.</p>\n\n<p><strong>Description: </strong>This script allows the developer to activate / deactivate switches when the player enters a land marked as a preconfigured region.</p>\n\n<p><strong>How to use this script: </strong>No plugin configuration is required. After activating it in the RPG MAKER MZ it will be ready to be used!</p>\n\n<p><strong>Configuring the map regions: </strong>For each map, the developer can configure up to 255 different regions. Setting up a region is quite simple, as long as the developer inserts a tag in the “Note” field in the Map settings where he wants the alert to work. The following theme tag structure:</p>\n<p><alertregionid:switchid, value=\"\"></alertregionid:switchid,></p>\n<ul><li><strong>&lt;alertRegion</strong> is the tag suffix</li><li><strong>ID</strong> is the region number</li><li><strong>switchIdis </strong>the number of the database switch that will be manipulated.</li><li><strong>value</strong> is the value to be assigned to the switch. It can be <strong>true</strong>, <strong>false</strong> or <strong>temp</strong>.</li></ul>\n\n<p><strong>Alert types:</strong> There are basically two types of alerts, a permanent alert and a temporary alert.</p>\n\n<p><strong>2) Permanent alert: </strong>in this type of alert, a database switch is activated or deactivated when the player moves to a terrain marked as a pre-configured region. When he leaves this land, the state of the switch will not be changed.</p>\n\n<p>To set up a Permanent Alert, assign \"true\" or \"false\" to the value in the tag configuration.</p>\n<p><strong>Example 1:</strong> ACTIVATE switch 1 in the database when the player enters region 4.</p>\n<p><alertregion1:4,true></alertregion1:4,true></p>\n\n<p><strong>Example 2: </strong>DISABLE switch 2 from the database when the player enters region 10.</p>\n<p><alertregion2:10,false></alertregion2:10,false></p>\n\n<p><strong>2) Temporary Alert: </strong>In this type of alert, a database switch is ON as long as the player remains in a terrain marked as a pre-configured region. When he leaves this terrain, the switch is turned off.</p>\n\n<p>To configure the temporary alert tag, assign “temp” to value in the tag configuration.</p>\n<p><strong>Example 3: </strong>Set switch number 3 in the database to be activated while the player remains on a terrain marked as region 89.</p>\n<p><alertregion89:3,temp></alertregion89:3,temp></p>", "metacritic": null, "released": "2020-10-08", "tba": false, "updated": "2020-10-09T04:10:44", "background_image": "https://media.rawg.io/media/screenshots/38d/38d4daf98b2f2441d5045ddf013bc97e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 10, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["TecnoAnalogica"], "genres": [], "publishers": [], "esrb_rating": null}