{"id": 50270, "slug": "dungeons-vampires", "name": "Dungeons & Vampires", "name_original": "Dungeons & Vampires", "description": "Explore the dungeon of the damned in this fascinating gothic roguelike game, fighting in turn-based battles with it’s inhabitants. For each game session, the game will create new unique adventures, full of challenges and surprises, dotted with monsters and ancient magical artifacts. <br/>\r\nThe game will offer you three different classes of heroes, each of which has a unique style of play. Some of them are focused on attack or defense, others have access to magic spells. All of them will need to rely on their special fighting skills to survive. As updates are released new classes and skills will be added to the game.<br/>\n<br/>\r\nMoving deep into the dungeon you will encounter many different types of monsters with different characteristics and abilities. Using gold and crystals found during campaigns you will be able to unlock more advanced forms of your abilities and skills, strengthening your heroes for future battles. <br/>\r\nThe main goal of the game is to survive at any cost and rid the world of the terrible creatures of darkness that terrorize the inhabitants of the surrounding settlements. All this horror is brought to life by ancient vampires, whose sleep is guarded by their numerous servants. Can you resist the otherworldly horrors that seized your native lands?<br/>\n<br/>\r\nDungeons &amp; Vampires - an exciting \"roguelike\", adapted for modern players! He eliminates cumbersome movements and complex commands, while retaining all the functions of the genre that make games fun and enjoyable. Here you will find turn-based battles, generation of random levels, numerous mini-games and beautiful gothic graphics. This combination will make any of your adventures in the universe of this game unforgettable and unique!", "metacritic": null, "released": "2017-12-12", "tba": false, "updated": "2019-08-28T22:03:33", "background_image": "https://media.rawg.io/media/screenshots/61f/61fecb79c53a4197395ae8d1d6318fdf.jpg", "website": "http://angrygames.ru", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4}, "playtime": 0, "achievements_count": 45, "ratings_count": 0, "suggestions_count": 250, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BAD team"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["BAD team"], "esrb_rating": null}