{"id": 50290, "slug": "defenders-of-the-fallen-island", "name": "DEFENDERS OF THE FALLEN ISLAND", "name_original": "DEFENDERS OF THE FALLEN ISLAND", "description": "Do you have what it takes to defend what is yours? This is not a typical tower defense game where the troops do all the work. This is a hybrid FPS/TPS tower defense game which you take over the control to defend your island.<br/><br/>Your ancestors built ancient temples which generates a protective energy barrier around the world. Your world is surrounded by the enemy and they got only one option to invade, destroying the ancient temples. Enemies will send their troops by creating portals all over the island. Be ready with your friends to face the enemy! <br/><br/>Build and upgrade your turrets, improve your stats and prepare your defenses before the invasion starts!<br/><br/><strong>Key Features</strong><br/><br/><ul><li>First Person &amp; Third Person Gameplay - Each player controls their own vehicle.</li></ul> <ul><li>4 Player Multiplayer Co-Op - You don’t have to be alone, invite your friends and face the enemy together.</li></ul><ul><li>7 Different turrets - Create your own strategy and don’t let anyone pass your defense.</li></ul><ul><li>Drones! - Don't spend time on gathering resources. Spawn a drone and it will do the gathering for you.</li></ul><ul><li>7 Types of enemies - Normal, Swarm, Ranged, Armored, Destructive, Air and Titans!</li></ul><ul><li>Upgrade system - Improve your turrets, make them stronger.</li></ul><ul><li>Vehicle turret system - Build turrets on your vehicle and let them burn down surrounding enemies.</li></ul><ul><li>Level system - Gain experience by collecting essence from dead enemies.</li></ul><ul><li>Stat system - Use stat points to increase your survival abilities.</li></ul><ul><li>Steam Achievements - Added 17 new achievement.</li></ul><ul><li>Checkpoint system - For Single Player, each 10 rounds will be saved. When you are defeated, start again from last checkpoint.</li></ul><ul><li>Skill system - The vehicles have 7 different abilities. Use them to support your defense.</li></ul><ul><li>Massive Open World - Build your turrets where ever you want. Create massive mazes.</li></ul><ul><li>Endless difficulty - Every round the invaders gets bigger and stronger.</li></ul><ul><li>Dynamic weather system - When the sky gets dark, beware... The enemy can strike from any direction.</li></ul>", "metacritic": null, "released": "2017-12-14", "tba": false, "updated": "2019-08-28T22:03:33", "background_image": "https://media.rawg.io/media/screenshots/dd1/dd1d45cab185a3b13625c946b15cdef8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 16}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 374, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Open World Interactive"], "genres": ["Action", "Strategy", "Indie"], "publishers": ["Open World Interactive"], "esrb_rating": null}