{"id": 50304, "slug": "rocket-armor", "name": "Rocket Armor", "name_original": "Rocket Armor", "description": "This is newly developed and experimental high-speed flight maneuvering gear. The boys in the lab tell me it's safe, but there's nothing else like it in the world so... we need more data. That's where you come in. Congratulations, you're the Alpha Pilot!<br/>\n<br/>\r\nWe've installed automated leaderboards on every course, so try and break some airspeed records while you're out there and don't miss any checkpoints! Enemy mines will attempt to slow you down, but you won't be defenseless. Each thruster is equipped with a petawatt laser. Be careful though; the lasers generate a lot of heat, so the engineers also added \"15-meter carbon fiber telescoping bayonets for close-proximity acrobatic combat.\" How and when you use these armaments -- well that's your call. <br/>\n<br/>\r\nThe manual also says the armor has an overdrive mode. \"Activate both thrusters simultaneously to temporarily increase your speed and air control. WARNING: Thrusters will generate enormous quantities of heat when operating at 300% capacity.\"<br/>\n<br/>\r\nFinally, there's a pool going back at the lab. I told the boys you're tougher than any armor they can plate this monstrosity with. So try and use the environment to your advantage if you can. The armor should hold up. Hopefully.<br/>\n<br/>\r\nSuit up, Pilot. Your Rocket Armor is ready for its first test flight!", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:03:33", "background_image": "https://media.rawg.io/media/screenshots/86f/86f4e69b4568fe83b901c3f10b97c326.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 104}, "playtime": 1, "achievements_count": 4, "ratings_count": 1, "suggestions_count": 204, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Illusion Foundry"], "genres": ["Action", "Indie"], "publishers": ["Illusion Foundry"], "esrb_rating": null}