{"id": 50312, "slug": "descent-3-mercenary", "name": "Descent 3 + Mercenary", "name_original": "Descent 3 + Mercenary", "description": "The gut-wrenching Descent saga continues with more pulse-pounding action than ever before. Dive into massive subterranean strongholds and experience a whole new degree of freedom, as you careen through canyons and craters on the surface above... powered by the all-new Fusion™ engine. Test your piloting skills against an army of battle-drones and assault-bots using an extensive arsenal of tactics and heavy firepower.\n<br/><br/>\nImmerse yourself in the wonders of the Descent universe, filled with new friends and old enemies, as the plot twists and turns with each daring mission. Prepare yourself for an explosive new 3D action experience with that will turn you world INSIDE... OUT!\n<br/><br/>\nAre you able to reveal the dark conspiracy threatening not only you but also the world you know? Don't you wanna know who stands behind the intrigue in which you were involved in Descent 3? Then relax your mind and body before the next battle begins. Cause when it happens, with an impact of a speeding roller-coaster, you won't be able to break free before you finish the Descent 3: Mercenary expansion.\n<br/><br/>\nStill not enough? Then test your creativity by designing your own maps in the level editor. After finishing your marvelous creation explore it by yourself or with your friends. Now both games and editor bundled together!Diverse environments including confined tunnels and, for the first time in the series, open spaces\nA complex and scalable AI that can surprise and outsmart you\nA unique gameplay experience unmatched by any other game", "metacritic": null, "released": "2000-12-09", "tba": false, "updated": "2019-07-25T20:55:50", "background_image": "https://media.rawg.io/media/screenshots/445/445c59e69d65fbd6cc33b30f5e9d8293.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 9, "owned": 75, "beaten": 1, "toplay": 6, "dropped": 1, "playing": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 428, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["Outrage Entertainment"], "genres": [], "publishers": ["Interplay Productions"], "esrb_rating": null}