{"id": 503111, "slug": "ouroboros-chess-ludumdare47", "name": "Ouroboros Chess (LudumDare#47)", "name_original": "Ouroboros Chess (LudumDare#47)", "description": "<p>## Overview ##<br/>This is a 2-player chess game inspired by double Ouroboros.<br/>Each player controls a snake, and the goal is to eat up the other player's snake.</p>\n<p>## Control ##<br/>Click the chess pieces to play.<br/>Chess pieces that can perform actions are marked with white flashes, and valid targets are marked with red.</p>\n<p>## Tutorial ##</p>\n<p>### 1 ###<br/>Click on your Snakehead, and select then select another cell to target.</p>\n<p>Snakehead can move up to 3 steps per turn.</p>\n<p>### 2 ###<br/>You can summon mythical creatures to battle for you.</p>\n<p>Select Snakebody, and target an adjecent cell to summon a Mythical in your turn.</p>\n<p>Mythicals can move 1 step per turn.</p>\n<p>### 3 ###<br/>When a Mythical moves, the cell where this Mythical leaves will become a Town.</p>\n<p>Your Mythicals can't step back to your Towns, but they can attack your opponent's Towns.</p>\n<p>### 4 ###<br/>When your opponent disconnects a series of Mythicals and Towns controlled by you from your Snakebody or Snakehead, these Mythicals and Towns are removed from play.</p>\n<p>### 5 ###<br/>The last mechanic of this game is that you will spend or gain Mana depending your actions.</p>\n<p>- Step to an empty cell: -1 Mana<br/>- Summon a Mythical: -3 Mana<br/>- Removing your opponent's units: +2 Mana (for each chess piece removed)</p>\n<p>Each player's amount of Mana is shown at the corner of the display. Make sure you have enough Mana to support your strategy!</p>\n<p>## Author's Thoughts ##</p>\n<p>This game is designed to be a 1 vs 1 chess game, but I failed to squish time to implement AI opponents... (cry internally)</p>\n<p>Anyway, I am still content with my entry this time. It's the first time I've solo'd finishing the whole run: designing, graphics, audio, etc. A great experience.</p>", "metacritic": null, "released": "2020-10-06", "tba": false, "updated": "2020-10-09T06:28:07", "background_image": "https://media.rawg.io/media/screenshots/8c3/8c300c7560de6381cf627a37b41fca78.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 81, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["IkigaiSeitetsu"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}