{"id": 503249, "slug": "exolvuntur-phanty", "name": "Exolvuntur (Phanty)", "name_original": "Exolvuntur (Phanty)", "description": "<p>Every time you play, a procedurally generated map is created, in which you need to eliminate all the enemies. The enemies can drop ammo packs, health packs and weapons. If you die, you restart from loop 1 and lose all your progress. At the end of a loop, you choose an upgrade to take with you for the new loop and a new begins with harder enemies.<br/></p><p>It is the year 20XX, and the world has endured havoc. The global superpowers have fought a war so technologically advanced, even the fundamental laws of physics are breaking down. In the city of Sendai, Japan, a government-funded group of scientists have set out to explore the new properties of the world and have figured out a way to move along the 4th dimension - time. In the midst of testing, they invent a way for a person to get duplicated using the principle of joining parallel timelines. A closed environment called “Exolvuntur” is created for the experiment to take place in and to control such a dangerous and unpredictable test, they install surveillance drones, guards and robots to have the duplication proceed in a controlled manner. You are a young volunteer who has applied to their program, wishing to change your life from living in a slum to being valued and doing something important. You have one crucial skill - your father has trained you with weapons from a very young age, and you have become almost masterful with them. You’ve been taken to the laboratory, and everything is set to take place in just a few minutes. However, moments before the experiment commences, an independent hacker group from Russia intervenes and alters the system, causing several fatal errors in the way the process ensues. The scientist group identifies some obvious flaws: the surveillance reverses their intentions and instead of guarding the subject, they try to eliminate it, and something is also crucially wrong with the way time behaves - at some point, the “Exolvuntur” reverts its timeline to some point in the past, and the subject has to continue deflecting the now-enemy surveillance. There is nothing the scientists can do to stop it because any intervention in the time loop might disrupt the global flow of time and end the universe as a whole. Can you escape the seemingly infinite time loop? What’s the farthest you can get before you get beaten by your own skill and weaponry?</p>\n<p>All assets used were created in the 72 hours, including the 5 music tracks, weapon sounds, all the other sound effects, voxel 3d models as well as icons and promotional work.</p><p><strong>Controls</strong><br/>WASD to move<br/>Left-click to shoot<br/>E to pick up weapons<br/>Space to swap your weapons</p>", "metacritic": null, "released": "2020-10-05", "tba": false, "updated": "2020-10-09T07:02:12", "background_image": "https://media.rawg.io/media/screenshots/ca5/ca544e5737c3f3d18a4a0959094d8fbb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Phanty"], "genres": ["Action"], "publishers": [], "esrb_rating": null}