{"id": 50334, "slug": "conduct-deluxe", "name": "Conduct DELUXE!", "name_original": "Conduct DELUXE!", "description": "Conduct DELUXE! is an addictive game of explosive railway action that will challenge your inner conductor. Set in a stunning world, with incredibly simple controls you race against time to bring passengers safely to their destination by commanding trains, switching tracks and avoiding collisions in increasingly challenging action-puzzles.<br/><br/><br/><br/><br/>As you progress through demanding levels your railroad network expands to the farthest regions of this mysterious and beautiful low poly world. Each region with its own style, music and distinct challenges. All aboard!<br/><br/><br/><br/><br/><br/>Get ready for a serious challenge as you manage your growing fleet of trains through ice, desert, tropical islands, big city metros and maybe even the moon. You'll need both dexterity and wit to solve puzzles that have been known to make grown men cry on YouTube.<br/><br/><br/><br/><br/><br/>Create your own railroad puzzles with the level editor and make grueling commuter challenges for your friends or community to play. Unlock more pieces of the editor as you progress through the campaign. <br/><br/><br/><br/><br/><br/>As you progress you unlock new trains and earn awards. Marvel at the growth of your HQ and drive historically correct trains like the French TGV and Japanese Shinkansen and a few... not so historically correct too! Beat every level, collect every train, explode all the things and become the ultimate conductor.Here's some rad things in this game<br/><ul><li>Conduct trains in beautiful low-poly 3D worlds<br/></li><li>Simple and intuitive gameplay, just click to start/stop trains and control switches.<br/></li><li>Transport passengers, earn coins and unlock new themed regions<br/></li><li>Build your own worlds with the Level Editor!<br/></li><li>Unlock trains found in the real world, such as the French TGV and Japanese Shinkansen, to expand your train collection<br/></li><li>Seriously challenging puzzles in clever levels that will push you to the limit<br/></li><li>Earn awards for completing regions and marvel at your success in the company HQ<br/></li><li>Fantastic soundtrack by composer Simon Kölle</li></ul><br/><br/><br/>3 million players can't be wrongConduct DELUXE! is the reimagined desktop version of the highly popular mobile game Conduct THIS! But this is no ordinary port. Almost everything has been remade to bring the experience to new heights. Fresh new graphics, completely revamped controls and UI, new content and above all a – level editor! Make no mistake, this is the definitive version of the conductor experience.", "metacritic": null, "released": "2017-12-05", "tba": false, "updated": "2019-10-22T14:13:52", "background_image": "https://media.rawg.io/media/screenshots/bbd/bbdc57931a5a489602aa90405c265170.jpg", "website": "https://conductthis.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 50, "dropped": 1}, "playtime": 1, "achievements_count": 98, "ratings_count": 2, "suggestions_count": 299, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC", "macOS", "iOS"], "developers": ["Northplay"], "genres": ["Action", "Indie", "Puzzle"], "publishers": ["Northplay", "Northplay ApS"], "esrb_rating": "Everyone 10+"}