{"id": 50346, "slug": "snail-trek-chapter-2-a-snail-of-two-worlds", "name": "Snail Trek - Chapter 2: A Snail Of Two Worlds", "name_original": "Snail Trek - Chapter 2: A Snail Of Two Worlds", "description": "<strong>Snail Trek - Chapter 2: A Snail Of Two Worlds</strong> is the second in a series of \"20 minute adventures\" where you take on the role of a crew of snails on a journey to a new home world.<br/><br/>In the style of the early Sierra Online adventure games, Snail Trek has colorful EGA-ish graphics and a text parser interface. Relive the nostalgia in these bite-sized adventures - but without all the pain. Autosaves, a text parser with auto-suggest, and puzzles with no dead ends, all combine to bring this old genre into the modern era.<br/><br/>In Chapter 2, you are fighting for your survival on an alien world. With the odds against you and your crew, will you be able to use your wit and grit to persevere and find safety? And will you solve the mysteries behind your predicament and what it means for your civilization?<br/><br/><strong>Key Features</strong><br/><ul><li> Switchable characters (new for chapter 2!) - solve puzzles by having the snails work together.<br/></li><li> Autosaves - no need to save every few minutes (though you still can if you want).<br/></li><li> A text parser with both auto-suggest and auto-correct - fat finger your way to puzzle glory (but you can turn them off if you want to suffer more greatly).<br/></li><li> A text parser that understands what objects are in front of you, so you can be lazy and just type things like 'get' or 'look'.<br/></li><li> CRT emulation mode that gives those pixels an ever-so-slightly fuzzy look.<br/></li><li> A stereophonic score.<br/></li><li> Cute snails.<br/></li><li> Deaths (but hey, autosaves).<br/></li><li> No dead ends! Puzzle your way around with impunity!<br/></li><li> Widescreen aspect ratio, since monitors are more rectangular now.</li></ul>", "metacritic": null, "released": "2017-12-14", "tba": false, "updated": "2024-04-09T09:20:09", "background_image": "https://media.rawg.io/media/screenshots/35e/35e65b424c2832cf5ef5eb3e33bfba54.jpg", "website": "http://snailtrek.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 7, "dropped": 1}, "playtime": 2, "achievements_count": 4, "ratings_count": 2, "suggestions_count": 216, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Phil Fortier"], "genres": ["Adventure", "Indie"], "publishers": ["Phil Fortier"], "esrb_rating": null}