{"id": 50352, "slug": "starfighter-neon", "name": "Starfighter Neon", "name_original": "Starfighter Neon", "description": "Hello. Starfighter Neon is a small but fun game. It's a re-playable arcade style space shooter where the goal is to beat your (and your friends) best scores, unlocking extra ships as you go. <br/><br/>I hope you enjoy playing the game, all feedback is welcome, and I'll do my best to help with any issues.<br/><br/>   mikey<br/><br/><br/>You've been dropped into enemy space. Weave your Starfighter between alien spaceships, lasers, asteroids and bombs destroying as many as you can and collecting valuable coins and powerups as you go.<br/><br/>-If you fly off one side of the screen, you appear back on the other side, use this to escape enemies and surprise others!<br/><br/>-You have 3 lives each game.<br/><br/>-Collecting pickups will boost your weapons for a short while.<br/><br/>-There are Green, Blue and Yellow weapons to collect, alongside the default blaster, each available as 'normal' or 'gold' strength. The Yellow weapons are unique to each Starfighter.<br/><br/>-Collect coins to unlock extra Starfighters in the Ship Shop that all fly in different ways, and each have a unique powerup.<br/><br/>-Collect the SmartBomb pickup to wipe out the entire screen of enemies!<br/><br/><br/>Easy to play, just point and fire, this isn't a twin stick shooter. Keyboard and Gamepads both supported.<br/><br/>Infinite game play, it only stops when you lose all your lives.<br/><br/>Steam achievements and leaderboard.<br/><br/>Steam cloud support.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:03:31", "background_image": "https://media.rawg.io/media/screenshots/19e/19e25a745204bc3cddcd44023c9e4251.jpg", "website": "http://www.madeofdinosaurs.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 6}, "playtime": 1, "achievements_count": 10, "ratings_count": 1, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 1, "platforms": ["macOS", "PC"], "developers": ["MadeOfDinosaurs"], "genres": ["Action", "Indie"], "publishers": ["MadeOfDinosaurs"], "esrb_rating": null}