{"id": 503564, "slug": "permit-a-39", "name": "Permit A-39", "name_original": "Permit A-39", "description": "<p>Play the hottest fetch quest game of the year <strong>NOW</strong>!<br/></p>\n<p>Bureaucracy, bureaucracy, bureaucracy, bureaucracy, the never ending story. It would seem that regardless of how our technology advances, the hurdles we have to take to get things done just don’t get any lower. Kafka vented his frustration about it in “The Trial”, Goscinny and Uderzo show its maddening effect in “The Twelve Tasks of Asterix” and Adams made fun of it in “The Hitchhiker's Guide to the Galaxy”. Joining these great names is our humble team of developers with an everlasting fetch quest to apply for that one thing you don’t really want or need, but is required of you for some reason.</p>\n<p><strong>Tutorial:</strong><br/>Go to the main desk and ask about the process to get your thing done. Once you’ve asked, remember the order in which the symbols are displayed and visit the counters in that order. Don’t go to the wrong booth though, because as much as bureaucrats love wasting your time, they hate you wasting theirs. You may have to start over. Once you fulfill your task, you may receive more to do. Try and get as far in the process as possible.</p>\n<p><strong>Tip: You can look at the map at the entrance to get an overview of the building!</strong></p>\n<p><strong>Attention: Other visitors can give you additional tasks when you come to close to them!</strong></p>\n<p><strong>Controls:</strong><br/>A -&gt; Move Left<br/>D -&gt; Move Right<br/>W -&gt; Climb Stairs or Ride Elevator Upwards<br/>S -&gt; Descend Stairs or Ride Elevator Downwards<br/></p><p>E -&gt; Interact with reception and counters<br/></p>\n<p><em>Music by lunareffect. Soundeffects by  </em><em>sonniss</em></p>", "metacritic": null, "released": "2020-10-05", "tba": false, "updated": "2020-10-09T08:07:25", "background_image": "https://media.rawg.io/media/screenshots/5c5/5c5584aac4208a17f8fedc7e267608f9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 82, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["kirroyal"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}