{"id": 503519, "slug": "one-slicing-minute", "name": "One Slicing Minute", "name_original": "One Slicing Minute", "description": "<p>You have one minute to slice every enemy who are attacking the blue heart, otherwise you will be stuck in a loop! So you will have to improve your character and yourself!</p>\n<p>Unfortunately, I couldn’t finish the ending of the game, so for the moment, it is only an endless game, but you can see the main gameplay loop.</p>\n<ul><li>Controls:</li><li>Mouse/Keyboard: WASD or ZQSD for moving, Mouse position for controlling the camera, Right click for aiming, mouse wheel for choosing your angle slice, and Left click for slicing.</li><li>Gamepad (Xbox One scheme): Left stick for moving, Right stick for controlling the camera, Left Trigger for aiming, Left &amp; Right Shoulder buttons for choosing your angle slice, and Right Trigger for slicing.</li></ul>\n<ul><li>Credits:</li><li>For the slicing part, I used “Ezy-slice” from DavidArayan =&gt; https://github.com/DavidArayan/ezy-slice)</li><li>I got inspired by the video of “Mix and Jam” on Metal Gear Rising =&gt; \r\n\r\n\r\n</li></ul>\n<ul><li>For the music is from “theartinme” of NewGrounds, the song is named “Tokyo Shuffle” =&gt; https://www.newgrounds.com/audio/listen/931329</li><li>And for the only SFX that I could put (slicing sound), it is from the free brank sounds 2020 gdc of Soniss =&gt; https://sonniss.com/gameaudiogdc2020/</li><li>Visual outline on Unity, I used the tutorial of “AMEYE ALEXANDER” =&gt; https://alexanderameye.github.io/outlineshader.html<br/></li></ul>\n<p>06/10/2020 =&gt; Quick fix of a blocking issue - Spawners won’t work at all after the first loop finished, now it is fixed!</p>", "metacritic": null, "released": "2020-10-05", "tba": false, "updated": "2020-10-09T07:57:53", "background_image": "https://media.rawg.io/media/screenshots/f36/f3626c7aba2a853b8ac4a4f59722ce14.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 35, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["Edalbung"], "genres": ["Action", "Adventure"], "publishers": [], "esrb_rating": null}