{"id": 503631, "slug": "ouroboros-the-cursed-hero", "name": "Ouroboros: The Cursed Hero", "name_original": "Ouroboros: The Cursed Hero", "description": "<p> Long ago, in an age beyond remembrance, the gods walked the earth. Finding the land lonely, they set about populating it with plants and animals. To serve as wardens to their new creations, they molded mankind in their own image and blessed them with intelligence and immortality. Man diligently served the gods and tended to the land and the creatures, but, as the ages passed, mankind grew weary of their duty to the divine.   They banded together and plotted to overthrow their creators and take their place as the sole rulers of the world. The gods, enraged at man’s betrayal, traveled to the temple of Uros, buried deep within an ancient mountain. Here, the gods created a new being, Decay. Decay would slowly eat away at all living things, causing them to grow old, die, and rot away back to the primordial elements from which they were crafted. Yet from these elements, new life would emerge. So it was that the loop of life and death came into being.   Despite their efforts, mankind was powerless to stop their own demise. Fear gripped their hearts as they grew old and perished. Satisfied at their victory, but now ashamed at what they had done to the world, the gods fled the earth, returning to the heavens from which they came. Their departure meant mankind had indeed become the sole rulers of the world, but it was a cursed world. </p>\n<p>  Yet, mankind learned to cope with their new mortality and their offspring spread far across the land, each generation, replaced by a new one. For a time, things were good. But something terrible was lurking within the temple of Uros. Decay was growing too strong feeding off of the many lives of men. Soon, the land was withering away before its hunger. Some men tried to flee, while others pledged themselves in worship to this new deity. </p>\n<p>  A few brave heroes even traveled to Uros in hopes of slaying Decay and breaking the loop of life and death, unaware of the curse they were about to cast upon themselves.</p>\n\n<p>Coding, Modelling, Texturing - LERPish</p>\n<p>Story, Writting, Artwork - Victor</p>\n<p>Sfx's, Music, Video - Aless<br/></p>", "metacritic": null, "released": "2020-10-05", "tba": false, "updated": "2020-10-09T08:20:39", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["LERPish"], "genres": ["Action"], "publishers": [], "esrb_rating": null}