{"id": 50371, "slug": "puke-simulator", "name": "PUKE SIMULATOR", "name_original": "PUKE SIMULATOR", "description": "We are just two friendly apes who learned how to make games in our free time and now love to bring our often crazy ideas to live in all kinds of games. Please expect our games to be smaller, raw experiences. We always love to chat with you guys and greatly appreciate all of your feedback in order to become better game creators. <br/>Just tell us your questions or ideas on the forums, Twitter or Facebook. If you encounter bugs or any problems, we will do all we can to ensure the best support that a drunken ape could possibly give.<br/><br/><br/><br/>PUKE SIMULATOR is all about puking as much as you possibly can.  <br/><br/>Dropped in an open world city, puke on things and people on mass and with style to earn points! Find more food to keep you going on the puke carnage and find some cool secrets. Puke simulator is a small and completely stupid game and, to be honest, you should probably spend your money on something else, such as a nice Cheeseburger. But to be honest again, the fluid physics stuff is still pretty cool and maybe we can get even more physics magic out of this with future updates. <br/><br/><br/><br/>🔸next gen fluid physics simulation <br/>🔸crowd controlled characters with funny dialogues <br/>🔸open world city<br/>🔸hilarious secrets<br/>🔸gorgeous puke sounds<br/>🔸beautiful low poly style<br/>🔸Trading Cards (when the game eventually reached the... \"confidence metric\" ... )", "metacritic": null, "released": "2017-12-12", "tba": false, "updated": "2019-10-22T14:06:28", "background_image": "https://media.rawg.io/media/screenshots/9f6/9f6757581eecab3534bc1d8085986f9e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 7}, "playtime": 1, "achievements_count": 46, "ratings_count": 1, "suggestions_count": 176, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS", "PC"], "developers": ["DRUNKEN APES", "Zap Zap"], "genres": ["Action", "Adventure", "Simulation", "Casual", "Indie"], "publishers": ["DRUNKEN APES", "Zap Zap"], "esrb_rating": "Everyone 10+"}