{"id": 50382, "slug": "nodge", "name": "Nodge", "name_original": "Nodge", "description": "Nodge is a 3rd person exploration sandbox. Tasked with the mission to help preserve its ecosystem, you set out on an adventure to explore and understand this little planet. The flora and fauna of Nodge are very peculiar but thankfully you can invite a friend to help you complete your mission. Science your way to success!<br/><br/>Add this game to your wishlist to be notified of updates.<br/><br/><strong>Features</strong><br/><ul><li><strong>Exploration</strong>: Nodge is NOT procedurally generated but rather entirely hand-crafted. Every zone and every biome has some kind of gameplay purpose.<br/></li><li><strong>Farming</strong>: Farming is all about finding rare and exotic seeds and growing them in your farm. Not every crop is equal so you'll have to experiment to grow the highest quality possible!<br/></li><li><strong>Herding</strong>: Every creature you find will have its own behaviors and purpose. Some help with farming and others can be used as pets/companions.<br/></li><li><strong>Co-Op Multiplayer</strong>: Everything is more fun with friends and everything in Nodge is playable in co-op!<br/></li><li><strong>More</strong>: There's a lot more you can do in Nodge and I'll be posting about them as I develop the features.</li></ul><br/>Note: Nodge is still in full development, pretty much everything you see is work-in-progress and subject to change.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:03:30", "background_image": "https://media.rawg.io/media/screenshots/055/055d71258d2bb6a7df80715da6ce4724.jpg", "website": "http://playnodge.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 205, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["LODZERO"], "genres": ["Action", "Adventure", "RPG", "Simulation", "Casual", "Indie"], "publishers": ["LODZERO"], "esrb_rating": null}