{"id": 503881, "slug": "areallybadday", "name": "AReallyBadDay", "name_original": "AReallyBadDay", "description": "<p><strong>A Really bad day</strong></p>\n<p>This project has been made under 72h for the LudumDare 47. <br/>The theme of the jam was : \"Stuck in a loop\".<br/>The LudumDare is a game jam where you have to make a game under a certain amount of time with a certain theme. More details on : ldjam.com .</p>\n<p>To launch the game, download the package file from itch.io. </p>\n<p>- If you're on Windows : Select the Windows folder inside it and launch \"LudumDare47.exe\"<br/>- If you're on Mac : Select the Mac.app folder, then Contents, then MacOS and you'll find a file named \"LudumDare47\". ( Mac version not tested as we didn't have any Macs available )</p>\n<p><strong>Idea</strong></p>\n<p>This game, is a textual game. It narrates a story where you have to make multiple choices. <br/>If you do a wrong choice or go a wrong path of choices, you'll die and wake up again to do the exact same day. <br/>Unless you do the right choices, you'll be stuck in the same day. </p>\n<p>The purpose was to lose the player in a lot a choices and not making a wrong choice obvious. A wrong choice can be a wrong path that continues on and on with also multiple choices. Making the player unable to know the wrong choice right away and be \"Stuck in a loop\" for a long time. <br/>Unfortunately, making a good story with that much choices wasn't possible under 72h. </p>\n<p>But since we liked the idea, we wanted to open it to everyone that wants to collaborate to make this game better.<br/><br/>Please check the github if you want to know how to contribute.</p>", "metacritic": null, "released": "2020-10-05", "tba": false, "updated": "2020-10-09T09:17:12", "background_image": "https://media.rawg.io/media/screenshots/fb5/fb5b0ac83ce8f642e462a4a2ebdd9a00.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 28, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Shyrro"], "genres": [], "publishers": [], "esrb_rating": null}