{"id": 5039, "slug": "freekscape-escape-from-hell", "name": "Freekscape: Escape From Hell", "name_original": "Freekscape: Escape From Hell", "description": "Meet Freek, a cute little demon who found a holy trident which infused him with ideas of ascending to Heaven. Help Freek escape the fire and brimstone in this action platform adventure by attaching a variety of hellish creatures to his trident, turning it into different tools, depending on each enemy’s property. Run, jump, attack and solve puzzles to advance Freek through a twisted 3D netherworld.\r\n<br/><br/>\r\nHarness the power of the trident by capturing different enemies. While an elastic-bed-like enemy will transform the trident into a pogo stick, a sharp toothed enemy turns it into a cutting machine.  Embrace or avoid the creatures, depending on their emotional state.\r\n<br/><br/>\r\n- Adventure through 15 challenging levels in 3D, with 2D side-scrolling controls<br/>\r\n- Encounter numerous bizarre creatures, both friend and foe<br/>\r\n- Discover secret areas and hidden passages <br/><br/>\r\nCreat Studios, Inc. © 2009, Creat Studios, Inc. All rights reserved.\r\n<br/><br/>\r\nPurchase or use of this item is subject to the PlayStation®Network Terms of Service and User Agreement. If you do not wish to accept all these terms, do not purchase or use this item. This item has been sublicensed to you by Sony Computer Entertainment America. One-time license fee for downloads to up to 2 console systems and 2 portable systems that are associated with the purchasing account.", "metacritic": null, "released": "2010-04-05", "tba": false, "updated": "2019-08-02T16:22:38", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PlayStation 3", "PS Vita", "PSP"], "developers": ["Creat Studios"], "genres": ["Adventure"], "publishers": [], "esrb_rating": "Everyone 10+"}