{"id": 504, "slug": "dead-effect-2", "name": "Dead Effect 2", "name_original": "Dead Effect 2", "description": "<strong>Dead Effect 2</strong> is the newest addition to the acclaimed Dead Effect franchise. This action sci-fi shooter is looking to push the boundaries of first-person shooters to new levels with slick graphics, rich narrative and RPG elements. <br/><br/>Play the single-player missions at your own pace or engage your friends in the cooperative or PvP multiplayer mode. Train, develop your character, collect and upgrade countless weapons, gear and body implants and take control of the monster-infested ship.<br/><br/><strong>KEY FEATURES:</strong><br/><br/><br/>Your hero adapts, grows and gets better as you play. Help them along the way by choosing the best gear!<br/>-\tget 100+ upgradable weapons of all kinds – pistols, shotguns, plasma guns, bows, swords... you name it<br/>-\tcollect 300+ gear items and implants<br/>-\tcollect dozens of gear sets, from Regular to Mythical<br/>-\tput together a complete gear set to gain special abilities<br/>-\tequip your hero with a selection of 30+ special abilities, from bullet time to force field<br/>-\ttry high-tech body implants to increase your character’s performance<br/><br/><br/>A colonist ship is full of diverse environments, from maintenance rooms to oxygen gardens. And full of dark corners, too!<br/>-\tenjoy the stunning environments with moody graphics<br/>-\texplore the whole ship during the main story campaign<br/>-\treturn to complete various basic tasks in generic missions<br/>-\tstand up to the challenge in special missions – Biohazard, Survive, Lone Wolf, Infestation modes<br/> <br/><br/>You know you are not alone on this ship. There are friends, and there are foes. Sadly, the friends are outnumbered.<br/>-\ttest your strength against zombies, soldiers, cyborgs, mutant, cannibals, mechanical dogs, drones...<br/>-\tget engaged in several unique boss fights<br/>-\tcomplete special missions with various enemy types to gain experience<br/><br/><br/>You can face the enemy alone, but you won’t last long. Call your friends to action and together take up arms against the enemy!<br/>-\tplay together in the cooperative multiplayer mode – you can play the story campaign and all special missions<br/>-       challenge your friends to a life-and-death battle in the player vs. player multiplayer mode<br/>-\tconquer the elaborate system of achievements – collect all 170 of them!<br/>-\tget social - share your results and leaderboard position on social media channels<br/><br/><br/>By purchasing Dead Effect 2, you directly support the developers and get more than just a game!<br/>-\t20+ hours of gameplay<br/>-\tall future updates for free<br/>-\tdownloadable game soundtrack<br/>-\texclusive art book with a comprehensive overview of the Dead Effect universe<br/>-\tbecome a member of a lively community and participate in the development<br/><br/><br/>Feel free to drop us a line at info@badflyinteractive.com, or catch up with our latest news on our official website or a social media channel of your choice:<br/>www.deadeffect2.com<br/>Facebook: Dead Effect<br/>Twitter: @DeadEffectGame<br/>YouTube: BadFly Interactive", "metacritic": 53, "released": "2015-10-28", "tba": false, "updated": "2023-07-30T03:51:11", "background_image": "https://media.rawg.io/media/screenshots/17e/17edd75b97fb4f98672b017bef1d192d.jpeg", "website": "http://deadeffect2.com/", "rating": 2.84, "rating_top": 3, "added_by_status": {"yet": 13, "owned": 361, "beaten": 12, "toplay": 6, "dropped": 12, "playing": 2}, "playtime": 4, "achievements_count": 384, "ratings_count": 37, "suggestions_count": 516, "game_series_count": 0, "reviews_count": 37, "platforms": ["Xbox One", "Android", "PlayStation 4", "iOS", "macOS", "PC"], "developers": ["App Holdings", "BadFly Interactive"], "genres": ["Action", "Shooter", "RPG", "Arcade", "Indie"], "publishers": ["BadFly Interactive"], "esrb_rating": null}