{"id": 50418, "slug": "deiland", "name": "Deiland", "name_original": "Deiland", "description": "<p>A long time ago, when the universe was young, children were sent to Minor Planets. Their mission was to awaken the magic of the Crystals kept within the planet&#39;s interior.<br />\nThis is the story of Arco, the youngest of these children who lives on the smallest planet, Deiland. The tiniest of them all.<br />\nDeiland is an adventure game that combines RPG and sandbox mechanics. Its simple calm appearance is the result of the effort put into its creation. It seeks to surprise players with small details and an interesting storyline and appealing characters. Deiland planet is our home, and living on this small place will be a unique experience for every player.<br />\nBut it isn&#39;t all peace and tranquility on Deiland. A shadow wonders in the absolute darkness of the universe. The shadow speaks through dreams to evil creatures pressing them in to its service, with the sole objective of finding children and their planets and to rob them of their power of the Crystal and subdue them.<br />\nMain features<br />\nDeiland is a sandbox planet that you can develop in your own way.<br />\n12 characters to meet with 100 quests to complete.<br />\nMore than 120 inventory items to manage and trade.<br />\nSurvival mechanics: hunger and fatigue.<br />\n12 structures to build and 4 house levels.<br />\nImprove your skills. The game has some RPG mechanics, like character leveling, 4 magic spells to learn and 4 skills to upgrade (strength, intelligence, agility and stamina).<br />\nImprove your equipment with 7 tools (each with 3 levels).<br />\nDay/night cycle and climate events.<br />\nMore than 50 craft recipes: tools, cooking dishes, hand-craft items and magic potions.</p>", "metacritic": null, "released": "2016-02-19", "tba": false, "updated": "2023-12-18T17:33:23", "background_image": "https://media.rawg.io/media/screenshots/ee6/ee659c373573c9966dd773a59eb1af24.jpg", "website": "http://deiland.games", "rating": 2.29, "rating_top": 1, "added_by_status": {"yet": 186, "owned": 2819, "beaten": 25, "toplay": 8, "dropped": 44, "playing": 7}, "playtime": 1, "achievements_count": 96, "ratings_count": 133, "suggestions_count": 304, "game_series_count": 0, "reviews_count": 133, "platforms": ["PlayStation 4", "Android", "iOS", "PC", "macOS"], "developers": ["Chibig"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Chibig"], "esrb_rating": "Everyone 10+"}