{"id": 50453, "slug": "911-operator-special-resources", "name": "911 Operator + Special Resources", "name_original": "911 Operator + Special Resources", "description": "In 911 Operator, you take on the role of an emergency dispatcher, who has to rapidly deal with the incoming reports. Keep in mind, that the person on the other side of the line might turn out to be a dying daughter’s father, an unpredictable terrorist, or just a prankster. Can you handle all of this?<br/> <br/>PLAY ON ANY CITY IN THE WORLD<br/> <br/>The Free Play mode lets you choose a city to play on - the game will download its map, along with real streets, addresses and the emergency infrastructure.<br/> <br/>PEOPLE’S LIVES ARE IN YOUR HANDS!<br/><br/>Main features:<br/>* Over 50 recorded dialogues inspired by real calls: serious and dramatic, but sometimes also funny or annoying.<br/>* Real First Aid instructions.<br/>* 6 selected cities in Career mode, featuring unique calls and events.<br/>* More than 140 types of reports to encounter.<br/><br/>***<br/><br/>The game requires Internet connection to download free maps. The offline game is available after downloading the maps.<br/><br/>All map data © OpenStreetMap authors<br/><br/>***<br/><br/>Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy).<br/><br/>1 player<br/>DUALSHOCK®4<br/>Online Play (Optional)<br/><br/>  Software subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.<br/><br/>Ported by Code Horizon. Developed by JutsuGames. Published by PlayWay SA.", "metacritic": null, "released": "2017-11-28", "tba": false, "updated": "2019-08-02T16:20:58", "background_image": "https://media.rawg.io/media/screenshots/461/4614b2ebf2b71aba4baf7fe516e7aa55.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 335, "game_series_count": 0, "reviews_count": 0, "platforms": ["PlayStation 4"], "developers": ["PlayWay plc"], "genres": [], "publishers": [], "esrb_rating": "Teen"}