{"id": 50460, "slug": "bush-hockey-league", "name": "Bush Hockey League", "name_original": "Bush Hockey League", "description": "<p>Bush Hockey League features 5-on-5 arcade hockey gameplay where players will their opponents to submit through rough and tumble aggressive hitting and fighting. You are expected to contest for the puck by taking the body and hitting your opponents by throwing elbows, shoulder checks, cross checks, hip checks, and dirty clotheslines. Timely hits allow your team to go on fire and inflict further damage on your opponents causing them to drop the mitts and fight. That&#39;s right, aggressive hockey is back in town! Experience hockey the way it was meant to be played - line brawls, bench brawls, goalie fights, stick fights, knockouts and injuries, molestation of refs - Old Time Hockey has it all! Win the bouts to fatigue your opponents for good and gain a clear advantage to score goals and win the hockey game. Better yet, injure most of your opponents and you will win the game by way of a forfeit. That&#39;s Old Time Hockey - I went to a fight the other night, and a hockey game broke out!<br />\n• Play in rinks where hockey was born<br />\n• Story Mode - Experience taking a rag-tag hockey team facing a folding season by navigating the rumours, the pranks, and the realities of a bus-travelling hockey team in the 70s<br />\n• Unlock vintage alternate jerseys and retro hockey cards of top players in the Bush Hockey League<br />\n• Modern and Retro Two-Button control schemes. Includes Beer Mode control scheme that lets you play the game with ONE hand so you can hold your drink with the other!<br />\n• Local couch co-op of up to 4 players<br />\n• 1080p, 60fps</p>", "metacritic": null, "released": "2017-11-29", "tba": false, "updated": "2019-10-29T22:34:41", "background_image": "https://media.rawg.io/media/screenshots/03e/03e8414c0ac1311629ef428983ee38ae.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 7}, "playtime": 0, "achievements_count": 22, "ratings_count": 0, "suggestions_count": 83, "game_series_count": 0, "reviews_count": 0, "platforms": ["Xbox One"], "developers": ["V7 ENTERTAINMENT"], "genres": ["Sports"], "publishers": ["V7 Entertainment"], "esrb_rating": null}