{"id": 504907, "slug": "snowballer-2", "name": "Snowballer", "name_original": "Snowballer", "description": "Reminisce your youthful days, or just be actively malicious in this bloody serious, <br/>fast-paced First-Person Snowball Fight / Sled Racing Simulation.<h3> Multiplayer 𝐆𝐀𝐌𝐄 𝐌𝐎𝐃𝐄𝐒</h3><ul><li>[Deathmatch]    Everyone fights anyone. <br/></li><li>[Team Fight]   Red Team🔶👤👤👤👤🔶  vs.  Blue Team🔷👤👤👤👤🔷<br/></li><li>[🔥Fire Fight🔥] Protect your own campfire whilst trying to extinguish the opponent teams fire.<br/></li><li>[Capture the Flag] Get on your sled and capture the flag. </li></ul><h3>Singleplayer Content</h3><ul><li><strong>Sandbox / Creative-Mode</strong> Build even the most ridiculous constructions/fortifications out of snow piles. Ability to Save/Load those at any point in game. Ramps to use with your sled can be placed as well.<br/></li><li><strong>Battle Editor Mode</strong> Simulate unique NPC battles/snowball fights and take part in them.<br/></li><li><strong>Survival Challenges</strong> Withstand waves of opponents, their angry big brothers and various other dangers.  <br/></li><li><strong>Global Time Attack</strong> Fast-paced Sled Downhill Race for the best time.  🎿  🌐🏆   🥇🥈🥉  Global Leaderboards for the fastest descenders on each track. </li></ul><br/><h3>Character Customization</h3> Taunts, Hats, Clothing, Attributes and your Sled. <br/>Adjustable gameplay-relevant attributes to fit the base gameplay to your personal playstyle.<br/>Attributes/Stats:<br/><ul> <li><strong> Power </strong> will have an impact on maximum throwing force and snowball damage.<br/> </li><li><strong> Speed </strong> will have an impact on final walk/sprint velocity, the time it takes to charge your next throw to the maximum, aswell as the minimum time interval at which you are able to throw balls.</li></ul><h3> Sled </h3> Choose your sled of choice. Each with its own steering attributes/jump pattern. The sled is your weapon, your getaway vehicle and a huge threat for your wellbeing. <strong>Boost</strong> to trade higher possible maximum speed at the price of worse handling + higher chance to crash. In development: Workshop tools to add your own personalized sleds.<br/><h3>Crash Highscore system</h3> Calculated by adding up the impacts of each body part. Body parts have their certain score multiplier, which makes head and spine impacts the by far most desirable.  + Leaderboard to see whos crash was the worst!<br/><h3>Build your castle</h3> Pile up some snow. Snow Piles are stackable. Get creative. Build your fort! There is no maximum number in placeable Snow Piles. Your Imagination is only limited by your GPU. Also place ramps for planning out the perfect jump/stunt/crash.<br/><br/><h3>12+ Maps</h3> i.e. Lake, Schoolyard, Parks, Backyards, Treehouses, Ancient Ruins, Forest, Graveyard (12+ maps for Free For All  etc.and 2 maps with currently <strong>~10</strong> different race tracks for Time Trial). Some maps are playable in both, ☀day🌤 and nighttime🌙.<br/><br/><h3>Artifical Sweetener induced Overdrive Abilties</h3><br/> <strong>Snow Burst</strong> - Throw a series of snowballs in a very short time. The effective range and possible damage can be considered medium.<br/> <strong>Spreading Snowball</strong> - Launches multiple snowballs in cone pattern. Has a short effective range but within said range, it is super effective.<br/> <strong>Snowball Snipe</strong> - This will give you the chance to throw one insanely strong and rather unpleasant snowball.<br/> <strong>Avalanche</strong> - Launches a bunch of smaller snowballs which have the chance of starting an avalanche.<br/><br/><h3>Items</h3>  Gift Boxes will be granted for playtime. A box may contain either an equippable or a consumable/usable item. <strong>Equippable</strong> items can be used over and over again.  one of the available (more-or-less protective) dog companions (might catch and save you from oncoming snowballs),  custom taunt animation to continuously irritate your enemies. Secondly there are the consumable/usable items. <strong>Consumable</strong> items can be admitted through the ingame inventory right before your next match. Examples: 🎰Lottery tickets🎰 for a chance to win stuff even crazier collectibles, 🎫Funfair tickets🎫 grant you one-time access to an otherwise unreachable encounter/challenge/sideshow. Usable items must be equipped in the ingame inventory like you would do with a standard equippable but once used, ⚠the item will be permanently removed from your Steam inventory⚠.  Currently there are  <strong>100+ </strong>base-items available which can drop in many insane variations.<br/><br/><ul><li> Various environmental hazards and some quite dangerous wildlife can be encountered.<br/></li><li> Loads of secrets to reveal, events to trigger, dimensions to invade!<br/></li><li> Hit-zones<br/></li><li> Instant Replay: Save the last seconds of gameplay to a .gif file by a single button press.</li></ul>", "metacritic": null, "released": "2020-10-09", "tba": false, "updated": "2020-10-12T02:04:05", "background_image": "https://media.rawg.io/media/screenshots/7f1/7f1246b7d23b2ceeb0b4a11393bae007.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 18, "ratings_count": 0, "suggestions_count": 408, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Church of Bolloxology"], "genres": ["Action", "Simulation", "Racing", "Casual", "Indie"], "publishers": ["Church of Bolloxology"], "esrb_rating": null}