{"id": 5049, "slug": "blue-toad-murder-files-episode-1", "name": "Blue Toad Murder Files: Episode 1", "name_original": "Blue Toad Murder Files: Episode 1", "description": "A murder mystery puzzle adventure from the developers of Buzz!™. Episode 1 of 6.<br/>\n<br/>\r\nNow supports the PlayStation®Move motion controller!<br/>\n<br/>\r\nSet in the quaint village of Little Riddle, you play as one of the four members of the Blue Toad Detective Agency. Can you follow the clues and find the murderer? With each step of the investigation a puzzle is played and further clues about the case are revealed. Pay attention to what transpires – you will regularly be questioned on your knowledge of the case, and only observant detectives will learn the truth behind the events of the day.<br/>\n<br/>\r\nBlue Toad Murder Files™: The Mysteries of Little Riddle has 6 episodes each with a new crime and suspects to be uncovered. The series has over 90 challenging puzzles, Case Reviews and Whodunnits.<br/>\n<br/>\r\nThis product supports the following languages: In-game speech: English; On-screen text: English.<br/>\n<br/>\r\nNOTE: This information was correct at the time of publication. Blue Toad Murder Files © 2010 Relentless Software Ltd. All Rights Reserved. Blue Toad Murder Files is a registered trademark of Relentless Software Ltd. PlayStation®Move features require PlayStation®Move motion controller and PlayStation®Eye (sold separately).\r\n<br/><br/>\r\nPurchase or use of this item is subject to the PlayStation®Network Terms of Service and User Agreement. This item has been sublicensed to you by Sony Computer Entertainment America.", "metacritic": null, "released": "2010-03-25", "tba": false, "updated": "2019-08-02T16:21:41", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PlayStation 3"], "developers": ["Relentless Software"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": "Everyone 10+"}