{"id": 504915, "slug": "pro-player-life", "name": "Pro Player Life", "name_original": "Pro Player Life", "description": "<h3> Have you ever dreamed about becoming a pro player? </h3>In Pro Player Life you can make this dream come true, and maybe even become a legend in the world of e-sports.<br/>Manage your career, level up your skills, overcome your limits, and come up against increasingly stronger opponents on your journey to the top of the world.<br/>To fail or to succeed, it is all up to you!<h3> A legend is born </h3>Create your character, customize his appearance, personality, and game style.<h3> Train hard </h3>To become a successful pro player, you need to work hard.<br/>Level up your people skills, hone your tactical knowledge and teamwork.<h3> Believe in your potential </h3>Are you ready to stop being a nobody who plays just for fun?<br/>Stand out from the crowd and get offered deals from multiple teams. <br/>Start in an amateur team, playing on the regionals. But aim to gain a spot in some of the best teams in the world.<h3> Road to Success </h3>During your journey, you will come up against over 100 different teams, in dozens of competitions. <br/>Stand out on the lower levels and chase after your success.<h3> Invest with wisdom </h3>Use the money that you earned with your paycheck and awards to keep developing your career. <br/>Improve the place where you live. Have the best equipment.<br/>Pay for courses and specific trainings that will help you stand out even more.<h3> A solo star </h3>Improve your world ranking, and face the best players in solo tournaments.", "metacritic": null, "released": "2020-10-31", "tba": false, "updated": "2020-10-12T02:08:31", "background_image": "https://media.rawg.io/media/screenshots/fa2/fa291a5c14bb24a9f5afabdddf321e5c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 122, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BloodBrothers Studios"], "genres": ["Simulation", "Sports", "Casual", "Indie"], "publishers": ["BloodBrothers Studios"], "esrb_rating": null}