{"id": 504987, "slug": "green-dragon-super-retro", "name": "Green Dragon Super Retro", "name_original": "Green Dragon Super Retro", "description": "<p><strong>G</strong><strong>REEN DRAGON SuperRetro</strong> Edition is graphically designed to look almost like Amiga game, it is using special shaders and graphics. Now you can play Green Dragon with a SuperRetro look! Green Dragon Super Retro is graphically designed for hardcore Retro players! </p>\n<p>This DLC includes the same game as the main game, but this version comes with ultra retro shaders. So if you are more fan for ultra retro than main game retro style, you can play now with SuperRetro -look!<br/></p>\n<p>*Special shaders are currently added to the main game 'Green Dragon'. We will remove those shaders and add them to Super Retro Edition 12. - 15th October, so if you are more fan of the retro look, buy Super Retro Edition instead of main game!</p><p><strong>Youtubevideo coming soon!</strong></p>\n<p>Fight against evil corporation in this Arcade Beat 'Em Up game, in the imaginary streets of Hong Kong, Helsinki and Tokyo...</p>\n<p><strong>Up to 2 players!</strong></p>\n<p>Single-player &amp; Shared/Split Screen Co-op</p>\n<p><strong>Story</strong></p>\n<p>[b]Tougo[/b] is a distinguished martial artist recruited by a British intelligence agency takes part in a fierce fight against mysterious Cannabis drugs lord Taito, who is also responsible for Dee's fathers death. Together with agent \"Alice\" (Kiyori) they discover the drug lair situated at an urban city and try to defeat Taito's Gangs in a brutal battle.</p>\n<p><strong>Taito's Gang</strong></p>\n<p>Naturally Taito's Gangs try to defeat you to complete your mission. They defend their drug-territory strongly and do not give up easily. Taito's Gang is well organized and they have also bribed officials to their side. For you and agent Kiyori, it might be most safe to trust no-one...\r\n</p>\n<p><strong>Your mission</strong></p>\n<p>Before you can beat Taito and make this corner of earth more safer place, you need to kill numerous smaller bosses on each city (*13th of May version have 1 level).</p>\n<p><strong>Receive intelligence Data</strong></p>\n<p>During your missions, you will receive valuable intelligence reports from agency headquarter or local agents. You can make us of this data or dismiss it. Which path you choose depends of you. Intelligence reports will help you complete your missions more easily... but be sure that you don't be misled by Double agent(s). You might also receive some new weapons/vehicles from agency Research and Development division.</p>\n<p><strong>Go inside to premises while playing the level</strong></p>\n<p>You will be able to enter shops, restaurants and clubs while playing the main level. Pop inside the restaurant and rest for a moment while fighting! *This feature is currently in development and is not available on First Version release\r\n</p>\n<p>With 1 level, this Early Access First Version offers taste of the future gameplay. And of course it also offers good entertainment!\r\n</p>\n<p><strong>Features on Version 2.9. (10th of October):</strong></p>\n<p>1 level, animated city\r\nAttack enemy with a knife\r\nGrab enemy\r\nGrab Hit enemy\r\nPick and throw objects\r\nFlying Kick attack\r\nAttack against enemy with 3 different kind of hit styles\r\nThrow Enemy\r\nDown Attack\r\n</p>\n<p><strong>Planned features are:</strong></p>\n<p>End Boss to level 1\r\nLevel 2 with an End Boss\r\nSeveral different levels\r\nAt least 2 unique enemy\r\nSeveral different end Bosses\r\nAbility to drive a car\r\nAbility to fly a helicopter\r\n</p>\n<p><strong>Controls:</strong></p>\n<p>Player 1 (Tougo)</p>\n<p><strong>Jump =</strong> Shift\r\n<strong>Move =</strong> Arrow keys\r\n<strong>Hit =</strong> Ctrl\r\n<strong>Pick object =</strong> Ctrl</p>\n<p><strong>PC &amp; MAC-versions</strong></p>\n<p>Play on PC (Mac version coming soon!)</p>\n<p><strong>This is a DLC content</strong></p><p>You can play this DLC content withouth owning the main game. Click here to view the main game.</p>", "metacritic": null, "released": "2020-10-11", "tba": false, "updated": "2020-10-12T02:31:15", "background_image": "https://media.rawg.io/media/screenshots/bfd/bfdd0ee581a635be29c7c8b57cce4ac1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 116, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["IcanY"], "genres": ["Action", "Fighting"], "publishers": [], "esrb_rating": null}