{"id": 50503, "slug": "la-noire-the-vr-case-files", "name": "L.A. Noire: The VR Case Files", "name_original": "L.A. Noire: The VR Case Files", "description": "<p>A dark and violent crime thriller set against the backdrop of 1940’s Los Angeles, now in stunning virtual reality.<br />\nL.A. Noire: The VR Case Files for HTC VIVE™ places you directly in the shoes of Detective Cole Phelps as you solve brutal crimes, plots and conspiracies inspired by real cases from 1947 Los Angeles, one of the most corrupt and violent times in L.A. history.</p>\n<p>Featuring seven cases rebuilt specifically for virtual reality, L.A. Noire: The VR Case Files for HTC Vive adds new layers of immersion and realism to Rockstar Games’ atmospheric crime thriller as you solve select cases from the blockbuster original game, spanning mysteries from the Detective desks of Traffic, Arson, Homicide, and more.<br />\nSearch for clues by grabbing, inspecting and manipulating objects<br />\nGet behind the wheel and drive to your next crime scene<br />\nEngage in chases, fistfights and shootouts as you track down suspects<br />\nBuild your case by making notes or drawing freehand in your detective’s notebook<br />\nInterrogate witnesses and use your wits to separate truth from lies in a city where everyone has something to hide</p>", "metacritic": 82, "released": "2017-12-15", "tba": false, "updated": "2024-03-09T22:03:11", "background_image": "https://media.rawg.io/media/games/5f0/5f0496427e951c894435134ff1a2d4cb.jpg", "website": "http://www.rockstargames.com/lanoire/", "rating": 3.42, "rating_top": 4, "added_by_status": {"yet": 11, "owned": 103, "beaten": 4, "toplay": 9, "dropped": 9, "playing": 5}, "playtime": 2, "achievements_count": 62, "ratings_count": 19, "suggestions_count": 443, "game_series_count": 0, "reviews_count": 19, "platforms": ["PC", "PlayStation 4"], "developers": ["Rockstar Games"], "genres": ["Action", "Adventure"], "publishers": ["Rockstar Games"], "esrb_rating": "Mature"}