{"id": 50512, "slug": "rocketgirl", "name": "RocketGirl", "name_original": "RocketGirl", "description": "RocketGirl is the greatest game ever made. Take control of a beautiful heroine and grab a stolen rocket. Can you help her escape, with an army of baddies in hot pursuit? Stunning visuals. Awesome soundtrack. Non-stop action. Are you up for the challenge?<br/><br/><br/>PHOTOSENSITIVE SEIZURE WARNING<br/>A very small percentage of people may experience a seizure when exposed to certain visual images, including flashing lights or patterns that may appear in video games. Even people who have no history of seizures or epilepsy may have an undiagnosed condition that can cause these “photosensitive epileptic seizures” while watching video games.<br/><br/>These seizures may have a variety of symptoms, including lightheadedness, altered vision, eye or face twitching, jerking or shaking of arms or legs, disorientation, confusion, or momentary loss of awareness. Seizures may also cause loss of consciousness or convulsions that can lead to injury from falling down or striking nearby objects.<br/><br/>Immediately stop playing and consult a doctor if you experience any of these symptoms. Parents should watch for or ask their children about the above symptoms. Children and teenagers are more likely than adults to experience these seizures.<br/><br/>The risk of photosensitive epileptic seizures may be reduced by taking the following precautions:<br/><br/><ul><li>Play in a well-lit room<br/></li><li>Do not play if you are drowsy or fatigued</li></ul>If you or any of your relatives have a history of seizures or epilepsy, consult a doctor before playing.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:03:27", "background_image": "https://media.rawg.io/media/screenshots/ff6/ff6f06351b3f2135fbc28659661e8416.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 323, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SoftwareByEugene"], "genres": [], "publishers": ["SoftwareByEugene"], "esrb_rating": null}