{"id": 50529, "slug": "danger-close-2017", "name": "Danger Close! (2017)", "name_original": "Danger Close! (2017)", "description": "It is the dawn of the American invasion of Afghanistan during the night in late 2001. You are onboard a Hercules airplane. Explosions in the distance light up the sky and tracers from AA fire can be seen being strewn across the heavens as luminous confetti. <br/><br/>As the plane enters the combat zone, it is hit and you start to lose altitude. When the plane crashes into the ground you are the only survivor, and left alone to fight of hordes of insurgents to see the light of day.<br/><br/><strong>Features:</strong><br/><ul><li>As an American soldier stranded behind enemy lines, your mission is simple: Make it out in one piece<br/></li><li>Inspired by arcade shooters/run n’ gun-games in the vein of Metal Slug 3 and Contra 3, with a twist:<br/></li><li>Danger Close! takes place in an alternative past with locations, enemies and bosses loosely based on real-life counterparts<br/></li><li>Utilize genre-unique weapons including a particle-based flamethrower, an enemy-detecting artillery cannon and a CHAINSAW<br/></li><li>Focus on hordes of enemies on screen at a time: RPG-armed insurgents, vial-throwing mad scientists and flamethrower tanks<br/></li><li>Two-player local co-op multiplayer mode<br/></li><li>Stages take place on horse back, riding on a truck roof, an oasis raft-sail and in a commandeered tank<br/></li><li>Original soundtrack by Dan Butler</li></ul>", "metacritic": null, "released": "2017-12-01", "tba": false, "updated": "2019-08-28T22:03:26", "background_image": "https://media.rawg.io/media/screenshots/8db/8dbfd23549c3616b73f6a71e96991371.jpg", "website": "http://www.magicalhackers.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 425, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Magical Hackers"], "genres": ["Action", "Indie"], "publishers": ["Magical Hackers"], "esrb_rating": null}