{"id": 505448, "slug": "jumping-jacksons-the-halloween-carnival", "name": "Jumping Jacksons: The Halloween Carnival", "name_original": "Jumping Jacksons: The Halloween Carnival", "description": "The Jumping Jacksons have found themselves an adventure on Halloween night. The Halloween Carnival has come to town and all is not what it seems when the Goblin Troupe puts their mysterious plan into action. \r\nCan you stop the Goblins and overcome all the puzzles and monsters you'll find in this strange land? I hope so, or else who knows if things will ever go back to normal. \r\nWho are the Jumping Jacksons?\r\nThe Jumping Jacksons are masters of platforming who will jump, climb, slide their way to their goals. Siblings Mark and Laura Jackson are quick to act and utilize their surroundings to overcome obstacles. \r\nMark                  Laura\r\n<p>                   </p>\r\nUse masks to turn yourself into a Halloween monster!\r\nFrankenstein's Mask grants the strength to push crates.\r\n\r\nWolfman's Mask hastens your pace and has the ability to bring down walls of bone.\r\n\r\nDracula's Mask enables you to turn into a bat that can float in the air longer than any other form.\r\n\r\nCollectable Coins\r\n\r\nCollectable Coins are found in all non-boss stages. If you collect enough of them, maybe something good will happen. (hint hint)\r\nCandy Skulls\r\n\r\nThe more candy you have by the end of your adventure will determine how your adventure will conclude. These candy skulls, 13 in all, will contribute greatly towards your candy stash. You can find these skulls hidden in certain levels, denoted by the skull over the door frame of their stage. The chests that hold these skulls are located in treasure rooms, protected by lock and key. Find the key and bring it to the treasure room to unlock the way; Just don't get hurt along the way.\r\n\r\nControls\r\nYou can move left and right using A and D respectively, as well as left and right arrow keys.\r\nJump using the Space Bar.\r\nOpen and enter doorways with the W or Up arrow key.\r\nDrop down from platforms using S or the Down arrow key; also used to open treasure chests!\r\nHow to play\r\nThere are 2 versions of the game at the moment, the browser version and the windows version. \r\nUnfortunately, the browser version doesn't seem to get along with Itch.io but you can still play it at newbenland.com. (note that the website is still under construction, but you'll be able to play the demo there. <strong>Browser Version</strong>\r\nYou can also download the Windows version by pressing 'Download Now' at the top or bottom of the page. \r\nDonations are not necessary, but appreciated; There is an option to say 'no thanks take me to downloads'. \r\nOnce at the download page, you'll find Jumping Jacksons: The Halloween Carnival - Demo with a download button to the left of it, click download. \r\n\n\n\n\n\r\n\r\nConsider Donating to UNICEF (unaffiliated)", "metacritic": null, "released": "2020-10-10", "tba": false, "updated": "2020-10-12T04:07:44", "background_image": "https://media.rawg.io/media/screenshots/c58/c586338c931876fe932b1e60430a7d3a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 90, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["New Benland"], "genres": ["Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}