{"id": 505494, "slug": "rod-itch", "name": "RoD (itch)", "name_original": "RoD (itch)", "description": "Our project:\r\n<p>From Autohit Games, we want to present our first project \"RoD\", a turn-based strategy game. Join us to take part into turn-based battles where strategy and the tactical use of terrain will decide your fate. You can also recruit different types of combat units, each one which different characteristics, and upgrade them trying multiple combinations to creat the combat gear that better fits your combat style. And all of this accompained by pixel art style, lovely characters, and a memorable script. \"RoD\" takes place in a worldinhabited by many animal species that dispute the territory and struggle for survival. In this context, many stories take place: love, betrayal, vengeance... all blending in a spiral of life and death. Which will succeed in their fight for survival? And more importantly, at what cost?</p>\r\nSocial Media and Project Updates:\r\n<p>Follow us in our social networks to know more about the development of \"RoD\" and new updates, and join our discord channel to ask us questions, give us feddback, or just help us to create community!</p>\n<p><strong>Twitter:</strong> @AutoHit_Games<br/><strong>Instagram:</strong> @autohit_games<br/><strong>Discord:</strong> https://discord.gg/PwB8env</p>\r\nOur team:\r\n<p>Hi! We are Autohit Games an indie studio from Barcelona that it's starting its way into the videogame industry. We are just a bunch of friends that wants to spend their time doing something that we truly love: making and playing videogames and share them with you. So, are you ready to play?</p>\r\nStaff:\r\n\r\nProgramming :\r\n<p>Oriol Ganduxé</p>\r\nArt:\r\n<p>Marc Salayet (@salayetart)</p>\n<p>Alexandra Millar (@millargraphic)</p>\n<p>Aran Tapias (@arantapias)</p>\n<p>Javier Moreno (Pitticli , @pitticli)</p>\r\nScript:\r\n<p>Albert Pedrosa (@Albert_Pedrosa)</p>\r\nMusic:\r\n<p>Aran Tapias</p>\r\nDesign:\r\n<p>Gemma Roger</p>", "metacritic": null, "released": "2020-10-10", "tba": false, "updated": "2020-10-12T04:16:14", "background_image": "https://media.rawg.io/media/screenshots/f40/f4080f121908b728ec7aa316a728cde1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 170, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Web"], "developers": ["AutoHit Games"], "genres": ["Adventure", "Strategy"], "publishers": [], "esrb_rating": null}