{"id": 505599, "slug": "intrepid-lepid", "name": "Intrepid Lepid", "name_original": "Intrepid Lepid", "description": "<p>Build up the confidence to confront your family in this narrative puzzle adventure</p>\n<p>Nothing brings more shame to Lepid's relatives than knowing their youngest child lacks a <strong>special talent</strong>. In a family where everyone is expected to<strong> excel</strong> at one art or another from their early childhood, Lepid's mediocrity was good enough a reason to keep him<strong> isolated</strong> in his bedroom and to torment him the rare moments he entered his parents' sight.</p>\n<p>Resigned to spend his loveless days on his own, Lepid one day receives a message from his older sister, <strong>Libelle</strong>, who recently escaped this mad environment and is determined to get him out.</p>\n<p>Follow Libelle's instructions throughout the house, solve puzzles and <strong>confront your tyrannical relatives</strong> to gain enough confidence to step out the front door!</p>\n<p>Keep in mind the laws of each room</p>\n<p>Each member loves enacting laws on their own territory. Reach the exit door while breaking one law, no more, no less.</p>\n\n<p>Collect Libelle's tapes...</p>\n<p>...and learn a bit more about her own journey out to follow her dreams.</p>\n<p>Bring an end to an absurd tradition</p>\n<p>Excentric relatives will get in your way as you cross their turf. How about you give them a taste of their own medicine since you're there?</p>\n<p><em>Intrepid Lepid</em>'s colorful and excentric world was developed as a summer project by four ENJMIN students.</p>\n\n<p>Credits</p>\n<p>Charline Faure - Artist</p><p>Simon Gigant - Programmer, Music Composer</p><p>Thomas Imbert - Sound Designer</p><p>Chiara Rosmarino - Game Designer, Level Designer, Narrative Designer</p>\n<p>Find the original soundtrack on every streaming platform.</p>", "metacritic": null, "released": "2020-10-09", "tba": false, "updated": "2020-10-12T04:35:46", "background_image": "https://media.rawg.io/media/screenshots/957/95788c07abdbfdb30e7ca02344e057ce.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 128, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SlyBebop", "Graouh", "Rambar", "Simon Gigant"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}