{"id": 505556, "slug": "astrovoid-harmswaysoftware", "name": "Astrovoid (HarmsWaySoftware)", "name_original": "Astrovoid (HarmsWaySoftware)", "description": "<p>Astrovoid drops you in the cockpit of one of many futuristic space racers to test your reflexes against the unforgiving asteroid belt. Try and survive as long as you can, gathering points along the way to purchase new ships later! featuring: A completely procedurally generated environment with limitless possible formations and reactions. Smart levelling system that will change the asteroid belt as you fly. Several ships to choose from and unlock, all with unique abilities. Online Highscores to challenge your friends, the game is still young, place high in the rankings today!</p>\n<p>NOT RECOMMENDED FOR LOWER END PHONES</p>\n<p>Features:<br/>- 6 Unique ships, some with special abilities with more being released often.<br/>- 2 Beautiful environments to fly through.<br/>- Online highscores.<br/>- Procedurally generated asteroid fields.<br/>- Fracturing asteroids and ships for awesome destruction.<br/>- Professional soundtrack<br/>- More being added all the time!</p>\n<p>Features currently being developed<br/>- Custom ship builder<br/>- All new defend the fleet mode<br/>- New environments<br/>- More varied space debris such as destroyed ships</p>\n<p>This project intends to take user suggestions very seriously, please leave a review or alternatively send us suggestions at nate@harmswaysoftware.com. If we use your suggestion, we will acknowledge you for it in the game!</p>\n<p>This game is indie developed and published.</p>", "metacritic": null, "released": "2020-10-10", "tba": false, "updated": "2020-10-12T04:27:08", "background_image": "https://media.rawg.io/media/screenshots/46c/46cbd59475753b4a871f8cf00bcd5a33.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 255, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["HarmsWaySoftware"], "genres": ["Action"], "publishers": [], "esrb_rating": null}