{"id": 5056, "slug": "wakeboarding-hd", "name": "Wakeboarding HD", "name_original": "Wakeboarding HD", "description": "Grab your board and hold on tight!  Wakeboarding HD™ drops players into a high-speed, water-filled, arcade experience to maneuver through tracks, perform high-flying tricks, collect bonuses and avoid dangers from exploding mines to bloodthirsty sharks.  Show your skills and wreak havoc as the bright and colorful tropical paradise resort transforms into an action-packed extreme playground.  Perform assigned tasks while zooming through obstacles at top speed in order to keep your action chains going.  Jump the ramps, ride the rails, crash through boats, docks and tourists and collect stars and power-ups while feeling the power of the wake!<br/>\n<br/>\r\nPS3 is a trademark of Sony Computer Entertainment Inc. \"XMB\" is a trademark of Sony Corporation and Sony Computer Entertainment Inc.\r\n<br/><br/>\r\nPurchase or use of this item is subject to the PlayStation®Network Terms of Service and User Agreement. This item has been sublicensed to you by Sony Computer Entertainment America Inc.  One-time license fee for downloads to up to 2 console systems that are associated with the purchasing account.\r\n<br/><br/>\r\nTikGames, LLC. © 2010, TikGames, LLC. All rights reserved. \r\n<br/><br/>\r\nCreat Studios, Inc. © 2010, Creat Studios, Inc. All rights reserved. \r\n<br/><br/>\r\nAll trademarks, trade names and logos are the property of their respective owners.", "metacritic": null, "released": "2010-03-18", "tba": false, "updated": "2019-09-17T13:38:13", "background_image": "https://media.rawg.io/media/screenshots/c64/c6439641fee1a82652caac7504a215b1.jpg", "website": "http://www.creatstudios.com/games/wakeboarding-hd.php", "rating": 2.0, "rating_top": 3, "added_by_status": {"yet": 1, "owned": 67, "beaten": 1, "dropped": 5}, "playtime": 0, "achievements_count": 13, "ratings_count": 6, "suggestions_count": 479, "game_series_count": 0, "reviews_count": 6, "platforms": ["PlayStation 3"], "developers": ["Creat Studios", "TikGames-Creat Studios"], "genres": ["Sports", "Arcade"], "publishers": ["TikGames"], "esrb_rating": "Everyone 10+"}