{"id": 505799, "slug": "roboticsnotes-dash", "name": "Robotics;Notes DaSH", "name_original": "Robotics;Notes DaSH", "description": "<p>The island of Tanegashima is preparing for the Summer Festival half a year after the events of ROBOTICS;NOTES ELITE. Kaito Yashio has graduated high school and is applying to attend college as he pursues his dream of becoming an astronaut. Through Nae Tennouji, an acquaintance he knows from JAXA, he is introduced to Itaru Hashida, who happens to be on the same ferry heading back home. Itaru claims to be taking a tour of the island, but as times goes on, he starts acting strangely... Together they enjoy summer with the former members of the Robot Club: Akiho Senomiya, Junna Daitoku, Frau Koujiro, Subaru Hidaka, and Airi Yukifune, a girl they met from the incident last February. However, some unsettling incidents start occurring all around them, harbingers of an event that will again plunge the world into chaos.<br />\nKEY FEATURES<br />\nBreathtaking Imagery - Experience the world of ROBOTICS;NOTES like never before with newly animated graphics.<br />\nFind Your Happy Ending - Featuring intricate, branching storylines, allowing you to fall in love with any character you wish!<br />\nTimelines Converge - Itaru Hashida (Daru), a beloved character from the STEINS;GATE series, plays an intricate part of the story in DaSH], making this a must play for Science Adventure fans.</p>", "metacritic": null, "released": "2020-10-13", "tba": false, "updated": "2023-10-03T01:42:47", "background_image": "https://media.rawg.io/media/screenshots/a13/a130aef73e6cef24b68752320fab475b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 8, "owned": 58, "beaten": 2, "toplay": 6, "dropped": 1}, "playtime": 2, "achievements_count": 40, "ratings_count": 1, "suggestions_count": 499, "game_series_count": 6, "reviews_count": 1, "platforms": ["PlayStation 4", "PC", "Nintendo Switch"], "developers": ["MAGES"], "genres": ["Adventure"], "publishers": ["Spike Chunsoft Co"], "esrb_rating": null}