{"id": 505845, "slug": "knightczech-the-beginning", "name": "Knightczech: The beginning", "name_original": "Knightczech: The beginning", "description": "<strong>Knightczech is an adventurous 2D platformer in which the player explores various corners of kingdoms in Euritia world - from sun-drenched forests through the war-ravaged region to dark underworld.</strong><br/><br/>The game currently has two different modes - \"Classic\" mode and \"Story\" mode.<br/><br/><strong>Classic mode:</strong><br/>In classic mode, the player can dive into each of the three main areas of Euritia world in order to conquer the prepared challenges. The difficulty escalates along with progress to other levels of the area.<br/><br/>Each of the areas has different types of dangers or traps.<br/><br/>In this mode, your goal is to find and collect the long-lost swords of the Titans from ancient times in order to unlock more difficult levels.<br/><br/>Remember, you have no special powers. It is just you, your sword and iron armor.<br/><br/><strong>Story mode:</strong><br/><br/>Storyline consists of levels that will take you through the main (but also secondary) areas of Euritia world.<br/><br/>Your story begins in the middle of a war between two powerful kingdoms dominating Euritia. You are one of hundreds of ordinary soldiers for whom the whole war means only poverty, suffering and bloodshed.<br/>But everything will change after you, as one of the few, survive a crushing battle in enemy territory - this is the beginning of the struggle for survival and the search for a way to try to change the course of an already destructive and long-lasting war.<br/><br/><br/><br/><strong>In this game mode, players have available features such as inventory, improving their character and abilities, merchants with items, hidden places with treasures, various enemy units including several major villains, character dialogues, storytelling and much more.</strong><br/><br/>There will be available first two Chapters of Story mode on release.", "metacritic": null, "released": "2020-10-14", "tba": false, "updated": "2020-10-16T02:55:47", "background_image": "https://media.rawg.io/media/screenshots/204/20486337bc6f82c7e56da1bb974b3688.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 412, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["FridolinSlehacka"], "genres": ["Action", "Adventure", "RPG", "Casual"], "publishers": ["FridolinSlehacka"], "esrb_rating": null}