{"id": 505844, "slug": "killstreak-2", "name": "Killstreak", "name_original": "Killstreak", "description": "The stage of fierce battle with the smell of gunpowder<br/>\n<br/>\r\n is the 21st century. There are terrible terrorist incidents around the world.<br/>\r\nDozens of gunmen carrying guns and grenades broke into a Korean consulate in the Middle East.<br/>\n<br/>\r\nShortly after the incident occurred, six special mercenaries were dispatched to protect the consulate by a Bravo team, each secretly operating in the Middle East, from Gaie Arms Fabric, (Gaie Arms Fabric) and Ariel Gunner Indurstry (Aeri Gunner Industries). They set out on an immediate rescue operation to save the remaining people.<br/>\n<br/>\r\nGaie Arms Fabric, (Gaie Arms Fabric) and Ariel Gunner Indurstry, (Ariel Gunner Industries) are set against the terrorists of the two private mercenary companies.<br/>\n<br/>\r\nThe 21st century provides realistic missions, that is, operations, taking place on various maps that show realistic modern infantry warfare in the context of the era. Through these missions, gamers can vividly experience the thrilling feeling as if they were given a mission and participated in the battle directly in the real battlefield.<br/>\n<br/>\r\nKillstreak is a first-person online PVP game.<br/>\n<br/>\r\nThere are three modes of battle.<br/>\n<br/>\r\n1. Free for all<br/>\r\n  All users except yourself are enemies.<br/>\r\n  The user who killed the most users wins.<br/>\n<br/>\r\n2. Team deathmatch<br/>\r\n  Join your team and defeat your opponents.<br/>\r\n  The team that killed the most users wins.<br/>\n<br/>\r\n3. Capture of flag<br/>\r\n  Capture the flag on the opposing faction<br/>\r\n  Cooperate with the team to bring the flag.", "metacritic": null, "released": "2020-10-14", "tba": false, "updated": "2020-10-16T02:54:19", "background_image": "https://media.rawg.io/media/screenshots/747/747be20a4ad3505e48265b5b01ecd536.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 295, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mancheolsoft"], "genres": ["Action", "Indie"], "publishers": ["Mancheolsoft"], "esrb_rating": null}