{"id": 505858, "slug": "nexos-colosseum", "name": "NEX:OS Colosseum", "name_original": "NEX:OS Colosseum", "description": "--The Story--<br/>\r\nNEX:OS takes place within a vast galaxy on the brink of collapse and destruction, with the end of the universe(s) looming over its head. An Eons long war between two brothers has finally taken its toll, the once powerful Human Empire is in shambles. Only Sol remains safe... well as safe as can be when surrounded by enemies, pirates, and other fractured Empires. Ancient relics and technology lost to the Shutdown has begun to surface or reactivate, rumblings from deep within the Nexos tell of the Ageless return. It is only a matter of when the final confrontation will take place and the Onslaught resumes to wipe out all of Humanity and end the guidance of Eternal<br/>\n<br/>\r\nYou play as a Centurion, Humanities Elite near Immoral Super Soldiers who wield the powers and energies of the Nexos as a weapon. Partnered with your Valkyrie you will serve as the Sword and Shield of Veritas and the Terran United Republic.<br/>\n<br/>\r\n--The World--<br/>\r\nNEX:OS is based in a sudo Post-Apocalyptic Universe, constant war and battle has caused the last Golden Age to be all but forgotten except for in Sol, when a majority of Humanity now resides. While not everything is doom and gloom and hope still exists, one you leave the light of Sol, the true weight of what happened, and how people now struggle to survive takes shape.<br/>\n<br/>\n<br/>\r\n--Gameplay--<br/>\r\nNEX:OS will offer players the ability to choose from different classes, each with unique abilities and ways to traverse the environments: from Grappling Hooks, to Teleporting, Sprinting to Wall-Running and much more.<br/>\n<br/>\r\nCurrently NEX:OS will focus mostly on PvP, growing a community and hammering out the core systems before expanding with a full PvE Story mode.<br/>\n<br/>\n<br/>\r\n--Features--<br/>\r\nNEX:OS is going through a phased development process that will be scaling with development and the community, starting with the Phase called Colosseum. Eventually NEX:OS will shift to a Seasonal model that will offer large expansions to gameplay, Currently there a 5 seasons being penned out for the Colosseum Phase with more in the backlog depending on the needs of the game and community.<br/>\n<br/>\r\nEach Season will expand on the existing systems, while also adding new ones as a build up to Phase 2 and full implementation of all systems. The plan is for Phase 1 to last upwards of a year-in-a-half, pending the development of Phase 2 this might be extended. After Season 5 no additional core features will be added until Phase 2 begins unless Community or Game needs", "metacritic": null, "released": null, "tba": false, "updated": "2020-10-16T03:04:32", "background_image": "https://media.rawg.io/media/screenshots/f92/f92fcc3f1530d4f1ac91d37a9229cc2d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 148, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Primordial Games"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Primordial Games"], "esrb_rating": null}