{"id": 505833, "slug": "space-mech-pilot", "name": "SPACE / MECH / PILOT", "name_original": "SPACE / MECH / PILOT", "description": "<h3>The SPACE/MECH/PILOT program is available to the general public - for free!</h3> Hello (Hello), welcome to the SPACE/MECH/PILOT program, a idle-RPG clicker video game entertainment simulation unlike any other. With this exciting (and brand-new) SPACE/MECH/PILOT program, you get to fully live out the dream of being a totally violent space pilot, soaring through the universe, the stars, and through the broken chassis of your foes!<br/><br/><br/><br/>This video game allows you to:<br/>1. Defeat enemies.<br/>2. Attain XP and acquire big numbers.<br/>3. Defeat more enemies! The cycle never ends!<br/><br/>Wind it up and watch it go. Wind it up and play some more!<br/><br/><strong>P.S. - THE S/M/P INITIATIVE IS NOT RESPONSIBLE FOR ANY ODD ABNORMALITIES WHILE PLAYING. CONNECTIONS TO OTHER UNIVERSES ARE NOT MONITORED OR CONTROLLED BY THE SIMULATION. KEEP AWAY FROM CHILDREN UNDER THE AGE OF 6. Fun to play but not to eat.</strong><h3>FEATURES:</h3><ul><li><strong>A new riveting adventure awaits!</strong> - can you explore the cosmos and assimilate incoming opponent ships? <br/></li><li><strong>Three buttons? No, how about one!</strong> You only need one button to defeat enemies, and that's the fire key!<br/></li><li><strong>Gain powerful upgrades!</strong> - Level up and put your skill points towards powerful new abilities and upgrades.<br/></li><li><strong>STEAM Integration</strong> - Unlock achievements and compete in online Steam Leaderboards!<br/></li><li><strong>A brand new summer project from A NIGHTMARE'S TRIP alumni</strong>, featuring original character art from L0VEBREAK and lead art by Supeh Soph!</li></ul><br/>content warning: references to bullying/discrimination, use of weaponry. mention of family death. the game is not time-sensitive.", "metacritic": null, "released": "2020-10-13", "tba": false, "updated": "2020-10-16T02:44:42", "background_image": "https://media.rawg.io/media/screenshots/fac/fac530ff6e8457c327046b78f555803e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3}, "playtime": 0, "achievements_count": 8, "ratings_count": 0, "suggestions_count": 269, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SKY HOUR WORKS"], "genres": ["RPG", "Strategy"], "publishers": ["SKY HOUR WORKS"], "esrb_rating": null}