{"id": 505898, "slug": "10mg-you-are-such-a-soft-and-round-kitten", "name": "10mg: You are such a Soft and Round Kitten.", "name_original": "10mg: You are such a Soft and Round Kitten.", "description": "<strong>10mg</strong> is a collection of 10 minute long games. <br/><strong>You are such a Soft and Round Kitten</strong> is about a curious kitten. Aren't you curious too?<br/><br/>The Seven-Colored Gems.... Long ago, they were responsible for the creation of the world. Now they have been sealed away in various areas, unobtainable to all. But this has nothing to do with your story. You are only a soft and round kitten. You have been permitted to enter this world for one reason. The reason is something you will need to figure out for yourself. You will encounter items such as Doors, Ladders, Kittens, Ballon, Frogs and more. What do these items do? I will tell you one at a time. Doors are the first item you will encounter. Use them to op<strong>SIMULATION ERROR <br/>SIMULATION ERROR DO NOT CONTINUE READING YOU WILL BECOME UNREAL YOU WILL LOSE YOUR SELF ERROR ERROR ERROR ERROR ERRO</strong>very useful to a kitten in the world. That is all I can say, I have described all the items and their uses in great detail. I must go quickly now. I feel a sense that something is approaching, I can't stay here much longer. These premonitions of mine are rarely incorrect, as you know. Just don't forget the \"most important thing\": you must not touch th<strong>CONNECTION LOST<br/><ul><li>RECONNECTING....<br/></li><li>CONNECTION TERMINATED<br/></li><li>YOU CAN NO LONGER CONNECT<br/></li><li>DO NOT ATTEMPT TO CONNECT<br/></li><li>ATTEMPTS TO CONNECT WILL BE DETECTED AND LOGGED<br/></li><li>ATTEMPTS TO CONNECT WILL BE PUNISKTE IEN KIT ITNE KITE KITT ITNNE TITEN KITTE KITTEN KITTEN KITTEN KITTEN KITTEN KITTEN KITTEN KITTEN KITTEN KITTEN KIT</li></ul></strong>This is a gentle world. Welcome to the normal world, little kitten. Become ever more soft and round in this pleasant world.<br/><br/><br/><strong>Very Important<br/><br/>Your purchase will include many gameplay and features, such as:<br/><br/><ul><li>Kitten Moving Around in the World<br/></li><li>Entering a Door<br/></li><li>Use of Varying Items<br/></li><li>Side Scrolling<br/></li><li>Puzzles and Fantasy<br/></li><li>Getting Lost<br/></li><li>Nothing<br/></li><li>Guitar's Music</li></ul><br/>Please enjoy the content, game play and features provided with your purchase.</strong>", "metacritic": null, "released": "2020-10-15", "tba": false, "updated": "2020-10-16T03:28:44", "background_image": "https://media.rawg.io/media/screenshots/824/82479f8177e04a8098d37dded3407991.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 117, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["sylvie"], "genres": ["Adventure", "Indie"], "publishers": ["10mg"], "esrb_rating": null}