{"id": 505936, "slug": "vital-signs-emergency-department", "name": "Vital Signs: Emergency Department", "name_original": "Vital Signs: Emergency Department", "description": "Play a doctor in Vital Signs: Emergency Department and challenge your medical knowledge to help treat a wide array of characters that come into the ER that day. Unlike medical school everybody can enroll in Vital Signs with nothing down and as little as a commitment of 30 minutes or less! <br/><br/>Come to a diagnosis by selecting from a wide range of tests and prescribe medications or other treatments to give your patients the best possible care. However, remain vigilant and flexible! Your decisions and how you handle the influx of patients that come in during your shift will decide who gets to go home and who ends up in the morgue!<br/><br/>You completed the tutorial and two scenarios offered in the main game multiple times and have come across all ten patients during your shifts. Naturally, you have already reached the best possible ideal care, improper care and negligence scores that are possible in Vital Signs: Emergency Department – so what now?<br/><br/>A life in the day of an ER doctor is almost never complete, and if you think you are capable of doing more, check out our nine additional content packs that are available for download on Steam. These content packs will give you access to more scenarios and more patients so you can get back into the ER and save lives. What are you waiting for, doctor?<h3>KEY FEATURES</h3><ul><li>Tutorial and two scenarios<br/></li><li>10 patient cases<br/></li><li>Add more patient cases and scenarios with downloadable content<br/> </li><li>Plays in under 30 minutes<br/> </li><li>Scoring based on ideal care, improper care, and negligence</li></ul>", "metacritic": null, "released": "2020-10-15", "tba": false, "updated": "2020-10-16T03:50:11", "background_image": "https://media.rawg.io/media/screenshots/a7d/a7db17d8bc3d65f9bb786c62a8c54194.jpg", "website": "https://www.vitalsignsgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 237, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["BreakAway"], "genres": ["Simulation"], "publishers": ["BreakAway"], "esrb_rating": null}