{"id": 505933, "slug": "death-circus", "name": "Death Circus", "name_original": "Death Circus", "description": "Flyers everywhere. \"New circus in town! Clowns, exotic animals, and things you have never seen before! Grab your ticket and enjoy the fun!\"<br/>\r\n\"I've been dying to go to a circus! I'm pretty sure my mom wouldn't let me... She's such a killjoy... Maybe she doesn't notice if I sneak out at night! I really wanna watch animals and acrobats and I have enough money to buy a ticket!\"<br/>\n<br/>\r\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=<br/>\n<br/>\r\nYou'll be playing as a young girl who snuck out at night to go to the circus, unaware that the creepy clown might actually be a serial killer, waiting for his next victim. After you enter, you'll find out about the true identity of the clown and will have to do whatever it takes to get out of there before you get butchered like his other victims or end up as a feast for the circus animals.<br/>\n<br/>\r\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=<br/>\n<br/>\r\nDeath Circus is a short FPS horror-themed RPG game / experience about a young girl and a clown serial killer. It's a hide and seek style game in which you'll be tasked with different objectives and have to complete them in order to get closer to freedom. All you have to do is not to get murdered as you do so. The current state of the game contains the base gameplay, objectives, the map, the complete AI, and some cutscenes. The rest of the features will be added later as we're trying to incorporate the Steam community's feedback and suggestions into the game.<br/>\n<br/>\r\n-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=<br/>\n<br/>\r\nDeath Circus is in early access so there might be bugs and mechanics that don't work properly yet. We encourage you to share your feedback and ideas with us on the discussion board or send us an email.<br/>\n<br/>\r\nWe hope you'd enjoy your early access experience!", "metacritic": null, "released": "2020-10-15", "tba": false, "updated": "2020-10-16T03:48:07", "background_image": "https://media.rawg.io/media/screenshots/f07/f07b39b49e363ab92d6cd31009b524b9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 253, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["KangarooUnderlord"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["KangarooUnderlord"], "esrb_rating": null}