{"id": 505949, "slug": "slide-stars", "name": "Slide Stars", "name_original": "Slide Stars", "description": "<strong>Play with the world’s biggest stars and blast through crazy water slides!</strong><br/>Are you ready for the world’s most extreme water slide adventure? Play with 20+ of the world’s biggest social media stars and blast into an adventure of a lifetime! Choose your favorite star, jump onto the ride of your choice and race head-first down some of the most crazy water slides!<br/><br/>Slide, jump and balance your way through insane tracks packed with race-platforming dangers and extraordinary enemies. Overcome insane challenges like rolling boulders, wobbly constructions, banana bomb throwing monkeys, and even a colossal kraken! Nothing goes too far for these stars!<br/><br/>Will you make it to the finish line?<br/><br/>FEATURES:<br/>★ Play as Brent Rivera, Demi Rose, Ben Azelart or one of the other international super stars!<br/>★ Slide, jump and balance to beat the most exciting and dangerous water challenges! <br/>★ Unlock 20 super bizarre rides, ranging from a shark, unicorn and llama to even a mech and a dragon: each with its own pros and cons!<br/>★ Perform crazy stunts and get some airtime to increase your score!<br/>★ Easy to pick up and play, yet exciting to master. Will you set a new record?<br/>★ Challenge yourself by completing each level in multiple ways, unlock hidden tracks and earn special medals!<br/><br/><strong>Note:</strong> An additional controller is required when playing co-op with a second player.", "metacritic": null, "released": "2020-11-10", "tba": false, "updated": "2023-11-04T05:54:59", "background_image": "https://media.rawg.io/media/screenshots/7dc/7dc1bd89528283932d192fb3364f209b.jpg", "website": "https://slide-stars.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "dropped": 1}, "playtime": 0, "achievements_count": 34, "ratings_count": 0, "suggestions_count": 252, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "PlayStation 4", "Xbox One"], "developers": ["Triangle Studios"], "genres": ["Adventure", "Racing"], "publishers": ["Lion Castle Entertainment"], "esrb_rating": null}