{"id": 5060, "slug": "patchwork-heroes", "name": "Patchwork Heroes", "name_original": "Patchwork Heroes", "description": "Save a colorful world in need of a brave hero! Millions of innocent lives are being threatened by giant warships that are targeting defenseless cities and towns. Answer the people's cry for help and control a machine that can cut apart warships into harmless patches. \r\n<br/><br/>\r\nA unique artistic style is combined with friendly game play to create instant excitement! No two levels are alike as you learn new strategies and get help from comrades to overcome different enemies throughout a fun story.\r\n<br/><br/>\r\nFeatures:<br/>\r\n• Beat 30 action-packed levels, each with a different war ship, enemies, and obstacles to overcome<br/>\r\n• Easy controls let you cut ships apart, set bombs, and use special Mojo attacks to defeat the enemy<br/>\r\n• Uncover the story and get to know your comrades and the innocent cities being threatened by enemies<br/>\r\n• React quickly and plan ahead to stop enemy repairs and attacks before time runs out<br/>\r\n• Become the ultimate patchwork hero by mastering unique challenges in Mission Mode\r\n<br/><br/>\r\nPurchase or use of this item is subject to the PlayStation®Network Terms of Service and this item’s use restrictions. If you do not wish to accept all these terms, do not purchase or use this item. One-time license fee for downloads to up to 2 console systems that are associated with the purchasing account.\r\n<br/>", "metacritic": null, "released": "2010-03-18", "tba": false, "updated": "2019-08-02T16:22:37", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PSP", "PS Vita"], "developers": ["Sony Interactive Entertainment"], "genres": ["Action"], "publishers": [], "esrb_rating": "Everyone 10+"}