{"id": 506069, "slug": "roll-down-hectagon", "name": "Roll Down (Hectagon)", "name_original": "Roll Down (Hectagon)", "description": "Roll Down\r\nRoll Down is a simple Racing Game where you control a small collection of classic sport balls and have to participate in different event types like Time Attack and Speed-trap. At the moment I am making the transition from the Demo to the Early Access Version!\r\n<br/><br/>\r\n\r\nWhat the Game All ready includes:\r\nWe have already two game-modes (Time Attack and Speed-trap), Three Sport Balls which you can customize and Two maps one is represent the finished Version and the other one will get an rework in the finale version!\r\nRoll Down Finale Version:\r\n\r\nThe Game will feature a small Selection of classic Sport balls and different Tracks and Locations! This game is my first step in to the world of Racing games and will be my first commercial Game!\r\n\r\n\r\n\r\nSo what is the plan?\r\nHere is the Roadmap!\r\nPrototype One: was a proof of concept just to get an idea if this is even possible!\r\nPrototype Two: Re acting to the player feedback and checking if the performance is possible with the Graphic standard. Can be tested on Itch.io at the moment!\r\nDemo: The Demo will be a completely vertical slice of the game and will give every one the chance to get there hand on some gameplay!\r\nIt will feature three Balls and two game modes time attack and speed trap.\r\nAt the moment I am making the last changes and fixes on the Demo!\r\nEarly Access: Beyond the Demo there will be an Early Access version for a small price tag! You will get access to the latest builds and Multiplayer based on the Steam API!\r\nRelease: If the development stays on track I am aiming for a release at the end of the Year! Release will be on Game Jolt, Itch.io and Steam! Maybe also the Microsoft Store.\r\nThings to keep in mind: At the moment I am developing the game solo by side my full-time job so things may take longer as they should!\r\n<em>Follow as to get the latest information!</em>\n<br/>", "metacritic": null, "released": "2020-10-15", "tba": false, "updated": "2020-10-16T04:33:17", "background_image": "https://media.rawg.io/media/screenshots/a2a/a2a7d25c65b478a7b5d8a053dcb3eb48.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 205, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Hectagon"], "genres": ["Action", "Sports", "Racing"], "publishers": [], "esrb_rating": null}