{"id": 506309, "slug": "deadliner-incident", "name": "Deadliner Incident", "name_original": "Deadliner Incident", "description": "<p><strong>The Deadliner Incident</strong> is a board game for 3-5 players mixture of asymmetric, cooperative and competitive.</p>\n\n<p><strong>The Deadliner Incident</strong> allows players to take roles of the last survivors on an isolated spaceship or become an alien invader that will hunt everyone on board. However, trapped survivors are not an easy prey. They can run, seek and craft tools and weapons, help each other and use all the means available to survive until the rescue ship arrives, so they would rejoice in safety, if there is an escape pod left for you. And playing as a mighty monster can give you an unforgettable feeling of being a predator on a hunt, constantly evolving so there will not be any universal strategy to stop you. The core of the game is an asymmetrical gameplay of monster vs crew confrontation, and the cooperation with a room for intrigues and betrayals.</p>\n\n<p><strong>Features:</strong></p>\n<ul><li>Take the role of an alien on an isolated spaceship and hunt down all survivors</li><li>Combine different cards to invent new strategy</li><li>Craft powerful tools</li><li>Evolve into a powerful monster</li><li>The best strategy is to outsmart the opponent’s strategy</li><li>Stick together against any odds or backstab your friends to survive</li><li>Retro sci-fi aesthetics</li><li>Asymmetric gameplay</li></ul>\n<p>The game prototype was developed dusing the Game Design Course by <strong>Roman Pianzin</strong>, <strong>Daniel Švancara</strong> and <strong>Jan Valenta</strong>.</p>", "metacritic": null, "released": "2020-10-14", "tba": false, "updated": "2020-10-16T05:32:26", "background_image": "https://media.rawg.io/media/screenshots/b0a/b0af8b7fbdc7f478b12c9fa4283e0008.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 67, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Lucius Match"], "genres": [], "publishers": [], "esrb_rating": null}