{"id": 5063, "slug": "mega-man-10", "name": "Mega Man 10(2010)", "name_original": "Mega Man 10(2010)", "description": "<p>The original 2D classic Mega Man returns in a new adventure!<br />\nThis latest Mega Man title continues to bring the series back to its old school roots with retro action, platform game play and classic 8-bit style graphics and sound. This latest Mega Man title continues to bring the series back to its old school roots with retro action, platform game play and classic 8-bit style graphics and sound. Rediscover the Mega Man experience with classically inspired new boss characters, each with their own unique weapons and vulnerabilities.<br />\nThe year is 20XX and a suspicious outbreak of Robotenza, a Robot Flu, has broken out. It spreads through the world like wildfire bringing down robots everywhere. People who have relied on helpful robots for ages are unnerved trying to live their lives without their robot assistance. One month after the outbreak, the situation worsens even more. Infected robots have gone out of control, destroying the city and holding it hostage! It&#39;s up to Mega Man to take on this sinister threat and get to the bottom of this viral mystery.<br />\nPurchase or use of this item is subject to the PlayStation®Network Terms of Service and User Agreement. This item has been sublicensed to you by Sony Computer Entertainment America.<br />\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy). One time license fee entitles play on up to 2 PlayStation® 3 systems activated by this account.<br />", "metacritic": null, "released": "2010-03-01", "tba": false, "updated": "2024-01-24T12:02:47", "background_image": "https://media.rawg.io/media/screenshots/b87/b876d9664840d7e2f53cf5c649476935.jpg", "website": "http://megaman.capcom.com/10/", "rating": 3.59, "rating_top": 4, "added_by_status": {"yet": 22, "owned": 226, "beaten": 33, "toplay": 12, "dropped": 17, "playing": 2}, "playtime": 4, "achievements_count": 24, "ratings_count": 43, "suggestions_count": 323, "game_series_count": 10, "reviews_count": 44, "platforms": ["Xbox 360", "Wii", "PlayStation 3", "Xbox One"], "developers": ["Capcom", "Capcom U.S.A", "Inti Creates"], "genres": ["Action", "Adventure", "Arcade", "Puzzle"], "publishers": ["Capcom"], "esrb_rating": "Everyone 10+"}