{"id": 50633, "slug": "artifact-adventure-gaiden", "name": "Artifact Adventure Gaiden", "name_original": "Artifact Adventure Gaiden", "description": "Those tones, those colors...<br/>Featuring a uniquely Game Boy-like design<br/>and all-new adventures and tales.<br/><br/><ul><li>A seasoned world adventurer who can travel anywhere with his extensive wisdom.<br/></li><li>An old knight with the world’s greatest swordsmanship skills.<br/></li><li>An aristocrat with the resources to buy anything in the world.</li></ul><br/>Custom-build your own team of powerful allies to join you<br/>as you freely traverse the vast and unique open world!<br/><br/>Your own choices lay the foundation for the future...<br/>Three years later, upon your arrival in the world of the future,<br/>will the choices you made bring you happiness? Or misfortune? Or something else altogether...?<br/><br/>Immerse yourself in the Game Boy-like design and 2D open world while making choices that freely shape the scenario itself as you progress through this JRPG.<br/>The choices you make are all up to you. But don’t forget: the decisions you make just might end up providing you with invaluable help three years in the future, upon the arrival of an impending disaster...<br/>Embark on an adventure in which you sew the threads of your own future.Developer CommentsArtifact Adventure Gaiden, in which you lay the groundwork for your own future, features the “choose your own adventure” elements carried over from the original  Artifact Adventure.<br/><ul><li>Simple yet fun battles<br/></li><li>Myriad artifacts to be freely customized to your liking<br/></li><li>Improved playability<br/></li></ul>All of the above have been carefully implemented to maximize replayability.<br/><br/>While the “Gaiden” part of the title insinuates a sequel or spinoff, Artifact Adventure Gaiden has been painstakingly crafted to ensure that both seasoned veterans of the original Artifact Adventure as well as first-time players alike can fully enjoy the game with absolutely no rookie hurdle”.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:03:23", "background_image": "https://media.rawg.io/media/screenshots/fbc/fbc5f0c1796a02ec1f7207ca1c4024d3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 25, "toplay": 1}, "playtime": 1, "achievements_count": 52, "ratings_count": 0, "suggestions_count": 45, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["bluffman"], "genres": ["Action", "RPG", "Indie"], "publishers": ["AGM PLAYISM"], "esrb_rating": null}