{"id": 506420, "slug": "tikip", "name": "TikiP", "name_original": "TikiP", "description": "<p>Bonjour à tous! <br/>Voici ma proposition pour la Jam: TikiP</p>\n<p>Comme pour Pong, on à 1 raquette de part et d'autre de l'écran et une balle.<br/>Si la balle sort par 1 côtés le point va à l'adversaire. Les bords haut et bas sont des \"mur\".<br/>Les scores sont affichés en haut au milieux. les Matchs vont jusqu'à 10</p>\n<p>La taille de la fenêtre de jeux est plus large et il est possible de créer/ détruire des palissades derrière sois.</p>\n<p>Élève depuis 3 mois environs, je suis encore dans les bases du Lua avec LÖVE, je code sur ZeroBrainStudio. Je n'ai pas de bug lors de la destruction des palissades. Hors, le fichier .exe crash à ce moment là. </p>\n<p>Si vous rencontrez ce bug ou d'autre type je veux bien un petit retour ;)<br/></p>\n<p>Certains sons viennent du site : \"https://lasonotheque.org/\", les autres du module GameCodeur \"Les bases de la programmation, / atelier Shooter\"</p>\n<p>Temps passé, beaucouuup trop. plusieurs version du même projet. avec à chaque fois une approche différente. J'ai simplifié le code et tout recommencer pour aboutir à cette version (la 7ème :'( ). La dernière version m'a donc demander une 15ène d'heure, pour un temps totale proche des 40h</p>\n<p>Grosses difficultés sur les collisions (et les vitesses ^^):<br/> Initialement la balle devait accélérée  à chaque rebond et perdre en vitesse en cassant un mur. Les pad devaient aussi avoir une accélération propre. j'ai eu différents types d'accélération qui fonctionnais plutôt bien, mais qui déclenchais énormément de bug lors des collisions (sortie de balle, balle fantôme...) </p>\n<p>En espérant que vous preniez plaisir</p>", "metacritic": null, "released": "2020-10-14", "tba": false, "updated": "2020-10-16T05:57:51", "background_image": "https://media.rawg.io/media/screenshots/94d/94dada685fd4396a443f92701fd8e054.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 24, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Belzepierre"], "genres": [], "publishers": [], "esrb_rating": null}