{"id": 506454, "slug": "highstakes", "name": "HighStakes", "name_original": "HighStakes", "description": "Disclamer \r\n<p>this isnt a finish game, its pretty hard developing a game with a story alone without some fresh eyes to criteque it.  the famicase design isnt mine, its the prompt i used for the game-jam this game was made for.</p>\n\r\nPlot\r\n<p>Darkness has fallen, An eternal night. The supernatural emerge from the shadows.</p>\n<p>As body's start to be found in the depths of alleyways and back streets, <br/>Dracula, vampire Lord and commander of the army of chaos, infiltrates society.<br/>Tasting the blood of those who wander to far from the light, turning them into vampires.<br/>Vegas with all its neonlights becomes a beacon of life for the human population, <br/>providing a sense of security to all those who now live there.<br/>Months pass and more and more people are becoming vampires. <br/>The government, or what's left of it, <br/>issues mandatory weekly blood donations in order to try quench the thirst of those vampires that are still as civil as normal humans. <br/>Our protagonist and playable character, <br/>a news reporter technician who has been keeping the lights on,<br/>telecommunications up, and broadcasts the radio order to communicate with the rest of the world;<br/>from local news studio is delivered some really bad news;<br/>his daughter was drained by a vampire. <br/>Devastated by the sudden and tragic loss of his daughter,<br/>he vows to get revenge on Dracula and try bring light back to the void of darkness beyond the neon lights. <br/>A local group of scientists are studying a vampire, <br/>one of their co-workers who was previously bitten by a vampire acts as both a test subject and scientist. <br/>Our player character comes across this groop, <br/>recruited by the anti-vampire organization, because of his close connection to a vampire drained victim. <br/>He is urged to infiltrate the ranks of a known vampire gathering location and collect valuable information,<br/>infomation that could lead to understanding the cause of the eternal darkness and try eliminate the cause of it,<br/>as well as get revenge on the rogue vampires doing the drainings. <br/>We visit different locations navigating our way through the neon lit streets, <br/>starting from the players home acting as a hub, the scientists lab acting as an quest giver, <br/>then the club, as well as the news studio broadcasting their findings to the world.</p>", "metacritic": null, "released": "2020-10-14", "tba": false, "updated": "2020-10-16T06:06:22", "background_image": "https://media.rawg.io/media/screenshots/7ca/7ca86be147209968e5bc44c5aa63a9a9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 23, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["jacobsmith3204"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}