{"id": 506490, "slug": "gate-silver-alpha", "name": "Gate Silver Alpha", "name_original": "Gate Silver Alpha", "description": "<p>Gate Silver is an Indie Idle/RPG hybrid with a focus on Characters, Upgrading Systems, and Idle Progression. it is currently in it's Alpha Stages.</p>\n\n<p>Gameplay Summary:</p>\n<p>You have 3 rows of 3 Heroes that will fight 1 enemy, the different heroes have their own stats and abilities that will activate automatically during a fight allowing you to idle the game, and if you wish to actively assist your team you can heal heroes by clicking on them.</p>\n<p>The enemy can attack attack one row at a time and can only move onto the next row once all 3 heroes in that row are defeated, This means you need to consider the stats, abilities, and the placement of all 9 heroes in your team, as well as the best times to heal them.</p>\n<p> </p>\n<p>Heroes:</p>\n<p>Currently there are 12 characters in the game, Each character has 6 different skills, as well as there being many ways to upgrade them such as levelling, increasing max level, prestiging, getting DNA Upgrades from their individual upgrade tree, or equipping weapon upgrades to them. </p>\n\n<p>Upgrading:</p>\n<p>There are many many things you can upgrade in Gate Silver such as the many Hero upgrades, upgrades to your healing, upgrades that weaken the enemies, upgrades for more loot, and many more that will be added during further development.</p>\n\n<p>Alpha Stage:</p>\n<p>Gate Silver is currently in the alpha, please excuse some of the poor art and palette swaps, these are place holders are will be replaced as time goes on.</p>\n<p>There are also features that are not yet in the game which will help expand the gameplay options for the player as well as make the core gameplay more compelling.</p>\n\n<p>Suggestions / Feedback:</p>\n<p>I'm very open to suggestions and feedback, Sometimes a small comment or two can spark inspiration for a great idea.</p>\n\n<p>Personal Note:</p>\n<p>Thank you for your interest and support, please keep an eye out for future updates and most importantly have fun.</p>", "metacritic": null, "released": "2020-10-14", "tba": false, "updated": "2020-10-16T06:13:50", "background_image": "https://media.rawg.io/media/screenshots/9ff/9ff91b731fc6eefb5fef9d41198ad690.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 115, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Haydn Hachijo"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}