{"id": 506560, "slug": "metel-horror-escape-2", "name": "METEL HORROR ESCAPE", "name_original": "METEL HORROR ESCAPE", "description": "<p>Metel - Horror Escape is a first-person 3D game in the quest, horror genre.<br/><br/>Welcome to the house of a crazy maniac, thirsting for new blood and suffering! You are the victim that fell into his hands.<br/>Be careful when trying to find a way out. A maniac should not notice your attempt to escape.<br/><br/><strong>Description of the game process:</strong><br/>You play as a victim, you were caught by a maniac and put in a metal cage, in some old abandoned house located in the forest.<br/>Your main task is to get out of this house and escape as far as possible from this nightmare.<br/>You must be careful when you are trying to escape, the maniac can hear you and come to you to check if everything is in place, before he arrives you must hide all the evidence of the escape and return to the cage so that the maniac does not find you badly. When a maniac comes, he first of all checks whether you are on the spot or not, then he suspects that you tried to escape, and if he does not find evidence of escape, then the maniac leaves and leaves you alone, but if he noticed at least one piece of evidence you have sent, for example, a box you opened or a forgotten open door, he will punish you by applying an electric current to your metal cage.<br/>You have three attempts to escape, and do not try to go one-on-one with the maniac, you have no chance.<br/>The game will have four levels, and in each level you will play for different victims, learning the history of the victims and how it all started.<br/><br/><strong>Features:</strong></p>\n<ul><li>Unusual gameplay</li><li>Atmospheric graphics</li><li>Interesting puzzles</li><li>Deep plot</li><li>Excellent optimization</li></ul>", "metacritic": null, "released": "2020-10-13", "tba": false, "updated": "2020-10-16T06:27:26", "background_image": "https://media.rawg.io/media/screenshots/a3c/a3c243c3e4b1f8979090ae8622649a50.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 161, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Nar_Qoteak"], "genres": ["Action", "Puzzle"], "publishers": [], "esrb_rating": null}