{"id": 506581, "slug": "allnighter", "name": "ALLNIGHTER", "name_original": "ALLNIGHTER", "description": "<p><em>The year is 2069, and anti-gravity racing has become the region's most popular sport. Regulation quickly set in, under the iron fist of the Anti-Grav Racing League (AGRL), locking out the regular thrillseeker. Take matters into your own hands, as illegal races take to the streets. Race for glory!</em></p>\n<p>ALLNIGHTER is a turn-based racing game, where you have to manage your speed to get around the racetrack in the fastest time you can without crashing. Finish each race, and get access to more tracks!</p>\n<p><strong>How to play:</strong></p>\n<ul><li>You take turns moving across the race track, gradually increasing in speed. </li><li>You can only move based on your current speed and direction of travel. The faster you go, the harder it is to steer without crashing. </li><li>Click on the hex you want to move to and you will move. You can increase or decrease your speed by picking a hex further or closer to your vehicle.</li></ul>\n<p><strong>Credits:</strong></p>\n<p>Programming, Tiles and Menu GFX: Aviv<br/>Music, SFX, Vehicle and Scenery GFXs: Nick Vychuz</p>\n<p>(ALLNIGHTER was initially created for the A Game By Its Cover 2020 jam, with permission from Adrian Wrobel for the name, logo and setting concept, as well as John Yellow for the gameplay concept. Thanks to both for allowing this project to go ahead.)</p>\n<p>Get the soundtrack here!<br/></p>\n<p>Powered by DOME</p>\n<p>Development of ALLNIGHTER was partially livestreamed on Twitch, and the recordings can be found on YouTube.</p>", "metacritic": null, "released": "2020-10-13", "tba": false, "updated": "2020-10-16T06:32:59", "background_image": "https://media.rawg.io/media/screenshots/42c/42c5fd7ff1274b707d2a7862891785d3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 76, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Aviv"], "genres": ["Strategy", "Racing", "Puzzle"], "publishers": [], "esrb_rating": null}