{"id": 506694, "slug": "heart-at-hack", "name": "Heart at hack", "name_original": "Heart at hack", "description": "<p>Heart at Hack is a mix of a visual novel and a puzzle-game for Android and IOS devices. It was made in 2017 (phew! time flies!) as a friends project with the following folks : Neil Bouchakdji, Alexandre Senadji, Julien Weissmann, Matthias Duclos, Emmanuel Oujoud, Mattias Husser aka Sovnger and Dimitri Zanatta.</p>\n\n<p><strong>&lt;3 SOME LOVE &lt;3</strong></p>\r\nDefinitely a shining pearl in this sea of uninteresting mobile games.\r\nI never played a game like this one, a puzzle game with a real and interesting scenario. The puzzle are very clever and will make you think outside the box. And the story is catchy with some awesome plot twist.\r\nI wish I found this game way earlier cause it was amazing. This is truly a hidden gem in the Playstore and I wish more and more people would come and try this game cause it's worth it. The visuals and the UI in this are very pleasing to look at. The plot twist was pretty good too but I wish the game was longer cause I really enjoyed it plus they got some fun little puzzles as well. Love it!\r\nVery good worldbuilding for the small game it is. Felt uncomfortable playing as a character who's a bit of an ass but it did make for a good narrative and I appreciated that\r\n<p><strong>EXPLORE THE POCKET MINITEL AND ITS OPERATING SYSTEM : THE mOS<br/></strong>Use Darius’ Pocket Minitel and the Minitel OS. Powered by the french futuristic tech, explore a colorful user interface and unravel the truth behind this piece of tech.</p>\n<p><strong>HACK YOUR WAY THROUGH YOUR LOVER’S HEART<br/></strong>Use your brainpower and solve the twisted puzzles hidden in the Pocket Minitel. Lead the data to the mysterious cube to uncover the truth.</p>\n<p><strong>A TEXTUAL ADVENTURE<br/></strong>Discuss with Alaska9, Kimiko and many more to get by in New Paris world.</p>\n<p><strong>WISDOM ON DEMAND<br/></strong>Get your daily dose of wisdom with the Oracle. It could be useful, right?</p>\n\n<p><strong>&lt;3@HACK is 100% free.</strong> No ads, no in-app purchase or anything like it. We'v done this game for the labour of love!</p>", "metacritic": null, "released": "2020-10-13", "tba": false, "updated": "2020-10-16T07:04:29", "background_image": "https://media.rawg.io/media/screenshots/0c9/0c98b1024b9e95f81a276913b93c3247.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 45, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["donatdonat"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}