{"id": 50661, "slug": "spirit-animal-survival", "name": "Spirit Animal Survival", "name_original": "Spirit Animal Survival", "description": "Spirit Animal Survival story is loosely based upon a North American Tribe Legend about the beginning of life and the evil trying to rule the world, that only can be faced and defeated by the spirit animal bearer.<br/>You as one of the chosen ones are faced with the destruction of your tribes<br/>village and most of the members captured by the evil hordes to be sacrificed to the Evil Lord in exchange for dark spirit powers that sets this half human half animal creatures above everyone else to rule us all.<br/><br/><br/><br/>You begin your journey to search for your people and to defeat those creatures to gain there Spirit Animal powers. Cleansing the world from this evil giving you the opportunity to restore, peace and harmony for everyone.<br/><br/><br/><br/>SAS (short for Spirit Animal Survival)  is a Open World Sandbox Survival game that focuses on Cooperative Multiplayer game-play and also offers a Single Player Mode. <br/>In SAS you will be able to harvest fruits,vegetables and resources like stone,wood  to craft tools,weapons and building structures for your tribe and you to survive and live.  Besides the survival aspect of this game you will face numerous dangerous creatures some like wild animals that are hungry or territorial which you are only allowed to defend against or hunt if you are starving or if you are attacked first  (Health or Hunger depleted) you will be punished if you just kill for fun (experience same damage as the animal). You will also encounter Monsters of Evil that are extremely dangerous and you have to cleanse the world from them. Besides  that you will need there spirit energy to be able to transform your being in one of the Spirit Animals that you will unlock as you defeat the Evil Lord Elite Monsters.  <br/>Only after you defeated all 11 Elite Monsters and there hordes you will have all the Spirit Animals abilities unite in you to face the Evil Lord for a final showdown. <br/><br/><br/><br/>Game Core Elements<br/><ul><li>Non linear Coop Survival Multiplayer you have only one main goal and that is defeat all 11 Instance bosses to collect the 11 Spirit Animal abilities to defeat the Evil Lord and rescue your tribes people but other then that just try to stay alive and survive because everything is out to either kill you or eat you.<br/></li><li>Large and Vast Open World Environment with 5 Islands without loading screens.<br/></li><li>4 Boss Fight Instances at start of Early Access<br/></li><li>Morph into 11 Spirit Animals<br/></li><li>More then 100 Creatures roaming the world besides the well known Animals the World will be populated with Monsters,Dinos and Dragons.<br/></li><li>More then 200 Craftable items including 4 tiers of building material as well as complete Huts and structures for your Tribe.<br/></li><li>Extensive Character Creation system for Male and Female almost every aspect can be changed.<br/></li><li>6 Sets of Clothes for Male and Female and more will be added every update<br/></li><li>Variety of Weapons and Tools and like clothes and craftable items we will add more every update <br/></li><li>Various rideable and flyable Mounts like Dragons or Horses and Boats<br/></li><li>Taming / Mating System were specific Animals can be tamed as pets and if you have a male and female pet of the same type there will be able to have babies. But be careful taming is very dangerous and if your are not successful you may die in the process​<br/></li><li>Own Private Server hosting possible , very easy setup<br/></li><li>Over 49 Social Animations like dancing and greetings to interact with each other<br/></li><li>Many more exciting features to come.</li></ul><br/><br/><br/>The Story of Spirit Animal Survival<br/><br/>At the beginning of existence,<br/>our Creator made it such that Humans and Animals had a mutual understanding of one another allowing them to communicate together <br/>which in turn forged a bond of peace and harmony.<br/> <br/>It was not until Humans became overrun with greed and an insatiable need for power that the Humans began the gratuitous killing of animals beyond what they needed for food and survival. Angered by the Humans actions, the Creator separated the two populations, assigning them their own respective villages and different languages. As a punishment for their ignorance, the Humans and Animals were then completely segregated and the ability to communicate was lost. <br/><br/>Although the balance between the Humans and Animals was in peril, the Creator passed a piece of his primal essence to a few select kind and honest Humans which allowed them to still understand the animals and to yield the power of the 11 Spirit Animals by taking on their animal forms.<br/><br/>As the Creator was bestowing the gift of the Spirit Animal to the few select Humans, elsewhere a dark and malevolent energy manifested. The Dark Lord saw this schism between Animal and Man as an opportunity to overrule the World with His darkness and evil. To accomplish his evil goals, the Dark Lord gathered the most corrupt of the Humans and promised them power of their own to rule the World if they were to supply Him with both Animal and Human sacrifices to feed this insatiable hunger for fear and pain of all living creatures.<br/> <br/>Now, the time has come for those few gifted Humans who bear the Spirit Animal to defeat the evil forces that prevail and bring light to the darkness once and for all. Your quest begins with your Tribe being attacked by the forces of evil, when many parts of the World are set afire, people are being captured and offered for sacrifice, causing much pain and suffering. As the sole survivor, unsure of why you were spared during the torment and massacre, your mission is to find your people, free them, and fortify your Tribe’s village. The only way to defeat the Dark Lord is to summon the collective power of the 11 Spirit Animals, using their gifts and abilities to kill the Soldiers of Darkness and their armies of destruction.<br/><br/>", "metacritic": null, "released": "2018-01-05", "tba": false, "updated": "2019-08-28T22:03:22", "background_image": "https://media.rawg.io/media/screenshots/0a6/0a6a15887b6f92699b9ad529d6067fe3.jpg", "website": "http://www.spiritanimalsurvival.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 5}, "playtime": 1, "achievements_count": 24, "ratings_count": 0, "suggestions_count": 355, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["True Illusion Software"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["True Illusion Software"], "esrb_rating": null}