{"id": 50676, "slug": "band-of-defenders", "name": "Band of Defenders", "name_original": "Band of Defenders", "description": "Band of Defenders is modern online COOP FPS game where up to four players protect one central object against masses of savages and mutants who rule the world slowly recovering from nuclear apocalypse. Players build, repair and upgrade barricades and turrets, craft weapons and try to survive waves of enemies.<br/><br/>Each game consists of few waves of enemies and players have time to build their defenses after they deal with each wave. The last wave is always lead by one of the boss enemies, highly dangerous individuals that will test your defenses and skills to the fullest.<br/><br/><br/><br/>First of all, we wanted to create fun shooter game that has everything players expect and desire. Tons of different weapons, fluid animations and good feel from shooting bad guys. And because Band of Defenders is cooperative game, you can play it solo, with friends or with complete strangers - it is completely up to you how you want to enjoy your game. World of Band of Defenders is also extremely brutal so make sure you can handle a little bit of bloodshed. <br/><br/><br/><br/><br/>Do you like survival games where you have to build defenses to survive attacks from savage enemies? We love those but we think that it takes too much time to play for example 7 Days to Die and really enjoy it. Band of Defenders is coming with similar idea but focused on shorter (around 20-30 minutes) individual battles. You start with only basic equipment but you fortify your stand to beat more and more dangerous waves of enemies and beat boss that comes at you in the end.<br/>You build various barricades and automated turrets, craft weapons, set minefields to protect vulnerable spots and prepare for the worst which always comes.<br/><br/><br/><br/><br/><br/>You get experience points after each battle and when you level up you get crate with some useful equipment - new gun to craft, new upgrade to your turrets, new barricade to build, perk giving you a better gun on start of each game...so higher level means more and better equipment and higher chance to survive, especially if you want to play on higher difficulties.<br/><br/><br/><br/><br/>Are you ready for one of the best visual customization experiences you can have in online shooters? Without buying keys to actually get items you rightfully won? Band of Defenders lets you customize all characters without trying to rob you. You just win a game, get new items and try to figure out what combination of visual items give you the best looks. From character skins, headwear and face accessories to cool armors and knife skins, ranging from regular items to crazy ones, you will have almost infinite number of combinations so your character will be unique.<br/><br/><br/><br/><br/>You are mercenary, member of elite Band of Defenders. You came from the vaults deep under destroyed surface of the Earth and you want to reclaim what is rightfully yours. But the world is still very hostile place with Cult of Gore uniting mutants and savage bandits into the horde that is the main power that kills, pillages and stops any attempts to start human civilization anew.<br/>That means a lot of work for you and your fellow mercenaries and you take pride in protecting remnants of what once was a decent human society (decent enough to destroy the world with nukes...). Only you are able to defend weak and wealthy against hazards of this new deadly world.<br/><br/><br/><br/><br/><ul><li>Band of Defenders is packed with content and action so you enjoy every minute of many hours you will be playing it.<br/></li><li>30+ weapons including pistols, assault rifles, grenade launchers, mines, grenades and more futuristic pieces like laser  or tesla rifles<br/></li><li>10+ enemies ranging from expendable bandits trying to punch you to elite mutants in heavy armor and mortar in hand<br/></li><li>5+ maps in various post-apocalyptic sceneries<br/></li><li>4+ boss enemies that will test your defenses at the end of each battle<br/></li><li>4 difficulties that come not only with scaling of enemy stats but also with completely new sets of waves of enemies that will be attacking you<br/></li><li>4+ characters to choose from - do you see yourself as valorous soldier, sexy woman lieutenant or huge mutant that switched sides and fights against his own?<br/></li><li>200+ items for visual customization - hats, face accessories, armors, character skins and knife skins and models<br/></li><li>Endless mode - protect yourself against waves of enemies, next one always stronger than the previous one<br/></li><li><strong>No microtransactions so all content is yours for taking!</strong></li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-09-17T13:02:52", "background_image": "https://media.rawg.io/media/screenshots/6c1/6c1d4d92b60ac8ed937269924bc24729.jpg", "website": "http://bod.aldagames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 92, "toplay": 3}, "playtime": 2, "achievements_count": 47, "ratings_count": 1, "suggestions_count": 489, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Alda Games"], "genres": ["Action"], "publishers": ["Alda Games"], "esrb_rating": null}