{"id": 506894, "slug": "elves-clan-tricky-seasons", "name": "Elves Clan: Tricky Seasons", "name_original": "Elves Clan: Tricky Seasons", "description": "<p>🎁<strong>Elves Clan: Tricky Seasons</strong>🎁 is an impossible game, very easy to play but hard to master!</p>\n<p>In Elves Clan: Tricky Seasons you will play as Triki, Friki or Kiki to reach Chicho's house by jumping obstacles and platforms before they move, break, disappear, or anything else kill you XD! On the way you can collect coins and Tricky-Piranhas ... 😇 It seems easy, right? Well, it is not! Because it is a simple game, it can take out your negative emotions but at the same time it will take out your resilience by overcoming obstacles and reaching the goal as well as in real life.</p>\n<p><strong>“But, who are the Elves Clan?”</strong></p>\n<p>Triki, Friki and Kiki are mischief elves who want to get to Chicho's house to make pranks on him and steal his happiness. You read it right! You play as the cutest antiheroes, so help them in this adventure.</p>\n<p>Are you willing to accept the challenge and beat the record of your best friends?<br/></p>\n<p><strong> --------------------------------------     FEATURES     --------------------------------------</strong><br/></p>\n<p>👉 A unique experience with detailed animations and gorgeous graphics that throw you back to the retro era with a funny logic twist.</p>\n<p>👉 A modern visual touch with cute characters, a very out of mind level design and tons of creativity.</p>\n<p>👉 An intuitive control that will sharpen your reflexes and a level design that challenges your memory in every inch you advance to reach Chicho's house.</p>\n<p>👉 It is not necessary to be an expert, you will learn how to play easily.</p>\n<p>👉 Discover secrets, turn down the cutest enemies, leap holes and dodge dangers as the challenges will be all over the place.<br/></p>\n<p>👉 Incredible music that will stuck in your head as a tattoo inside your brain, impossible to forget.</p>\n<p>👉 You can use different style clothes and customs that will come out with new seasons.</p>\n<p>👉 Incredible music that will stick in your head as a tattoo inside your brain, impossible to forget.<br/></p>\n\n<p><strong>  --------------------------------  </strong>🔥 <strong>PLAY THE DEMO </strong>🔥  <strong>--------------------------------</strong><br/></p>\n<p>🎮 To feel how the rage will rise through your veins... you can download the demo, just click in this link 👉 http://bit.ly/Elves_Clan_Tricky_Seasons_Demo</p>\n\n\n<p><strong>--------------------  </strong>❤️<strong>YOU WILL HELP VENEZUELAN KIDS</strong>❤️  <strong>--------------------</strong><br/></p>\n<p>Elves Clan: Tricky Seasons has the objective and social responsibility to help with the collected value of each ad seen. This will be donated to Venezuelan institutions that distribute food, medicines and clothes for the needy.<br/></p>\n<p>This game is developed and directed by Juan León with the help of the entire Elves Clan Collective. <br/></p>\n<p>Here you can learn more about the history of Elves Clan: Tricky Seasons:<br/>http://www.elvesclan.com and #elvesclan in social networks.</p>\n<p>We would love to hear your opinion 🤘 and stay tuned for all the updates that Elves Clan: Tricky Seasons will have.</p>", "metacritic": null, "released": "2020-09-25", "tba": false, "updated": "2020-10-16T07:49:21", "background_image": "https://media.rawg.io/media/screenshots/96b/96b33af108ed9c42778aed3967d9922d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 204, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["JUANLEON.LIFE"], "genres": ["Adventure", "Platformer"], "publishers": [], "esrb_rating": null}