{"id": 50689, "slug": "lost-grimoires-3-the-forgotten-well", "name": "Lost Grimoires 3: The Forgotten Well", "name_original": "Lost Grimoires 3: The Forgotten Well", "description": "<p>King Raphael returns victorious from the expedition against the army of the mysterious Elf Sylvanheir. While king&#39;s subjects are preparing for his triumphant arrival, his sister - startled by his strange letters from during the war - suspects that Raphael has been cursed and that a real war is about to begin.<br />\nThe war between the Kingdom of Phoenix and the possesed army of elves and their leader Sylvanheir is coming to an end.  When the subjects await the arrival of their king, his sister - the alchemist - is full of bad feelings. Strange letters, sent by her broher in the last weeks of war expedition and horrible nightmares lead her to believe that something wrong is going on with the king.  She suspects that it is somehow connected with the dwellers of the Tangled Forest, who conjured people of the kingdom of elves. Is the protagonist right about all this? What inglorious secrets are hidden beneath the legendary past? Will the Alchemist unravel the complicated plot, make up for the Kingdom&#39;s sins from the past and save her brother?<br />\nFeatures Travel through 26 hand painted locations!<br />\nUse alchemy to lead your investigation!<br />\nSolve 26 minigames and ho scenes!<br />\nTraverse the Kingdom on horseback and a raft!<br />\nLearn the long hidden secret of people and elves!</p>", "metacritic": null, "released": "2017-12-14", "tba": false, "updated": "2022-07-12T22:20:56", "background_image": "https://media.rawg.io/media/screenshots/71a/71a02a71878f6c2dcc72443a448c3d05.jpg", "website": "http://www.artifexmundi.com/", "rating": 3.33, "rating_top": 4, "added_by_status": {"yet": 2, "owned": 99, "beaten": 3, "toplay": 1, "dropped": 2}, "playtime": 3, "achievements_count": 13, "ratings_count": 6, "suggestions_count": 452, "game_series_count": 0, "reviews_count": 6, "platforms": ["Android", "Linux", "macOS", "PC"], "developers": ["World-Loom"], "genres": ["Adventure", "Casual"], "publishers": ["Artifex Mundi"], "esrb_rating": null}