{"id": 506992, "slug": "innerreality", "name": "INNER//REALITY", "name_original": "INNER//REALITY", "description": "<p><strong>INNER//REALITY</strong> is a self-reflection of the artist's experience during times of isolation. Break free from the mediated experience and reclaim your own reality. Walk with me or on your own in this virtual vista. </p>\n<p><strong>KEYBOARD CONTROLS</strong><br/>MOUSE to Look Around<br/>SPACE BAR to Walk Freely / Jump<br/>WASD / Arrow Keys to move character<br/>LEFT SHIFT to Sprint<br/>ESC to Bring up Menu<br/></p>\n\n<p>INNER//REALITY is a self-portrait.</p>\n<p>This familiar ambience may trigger memories of virtual spaces visited once before. As you load up this experience, you are curated through a mediated walk with my virtual self. As I am unable to be with you in person, I have been digitally scanned and embedded into the art to bring my virtual avatar to embody the virtual vista.</p>\n<p>You are encouraged to walk one cycle with me, an introduction into the space.</p>\n<p>Once comfortable, you are then able to break free from the mediated to freely explore the space on your own. Like a baby bird from the nest, you are thrusted into the virtual world and must navigate yourself using the convention of 3D space navigation.</p>\n<p>Over the landscape you may see non nature related phenomenon. If you jump or pass through these portals of sorts, you will be transported to the reality of the creator.</p>\n<p>Now crossed the threshold, you see the reality behind the curtain. The wizard behind the design of the land of Oz above.</p>\n<p>The avatar here is unlike the others above experiencing and reflecting with nature. Instead closed away, locked beneath further tasked with creation and productivity. The avatars screen shows other virtual environments which are reminiscent of the virtual work above.<br/> <br/>Trapped in this space, you have the option to end the work here, your journey brought to a halt by another screen. Or, you can turn back and breach the confined space to reveal a path to transcend the space. In this limbo, you are greeted with fabricated memories and the simulated nature above. Revealing the under workings and holes between each reality. </p>\n<p>You traverse through this space to be transported once more after ascension. Fully lifted above the simulation and towards a new horizon of the simulated. One last avatar is presented looking over the vista, in hopes of new horizons. You can join in on this search, or fall back into the simulation. </p>\n<p>The work will evolve as development of ideas continues during the showing period. </p>\n<p>-Version 1.0</p>", "metacritic": null, "released": "2020-10-12", "tba": false, "updated": "2020-10-16T08:14:15", "background_image": "https://media.rawg.io/media/screenshots/fa1/fa1a0d8a73a2e092dfa4e3e95dd99f13.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 215, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["eternaltw"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}