{"id": 50696, "slug": "shoujo-city", "name": "Shoujo City", "name_original": "Shoujo City", "description": "Shoujo City is an anime dating simulator game, combining gameplay of bishoujo visual novels and sandbox-style city exploration adventure. The game is set in virtual 3D Tokyo and focused on anime and otaku culture.<br/><br/>Shoujo City project draws inspiration from romantic and bishoujo anime series. In the beginning of the game you'll get your own unique anime girlfriend, and then will have to take care of her, exploring the city together during various dating activities.<strong>Features</strong><ul><li> Dating - you can go on visual novel-style dates with your girlfriend, or by choosing one of alternative dating activities.<br/></li><li> Shopping - you can go shopping for clothes and accessories, food, snacks, toys.<br/></li><li> Cooking - to win heart of your anime girlfriend, you'll have to cook food for her, by using recipes and combining various food ingredients.<br/></li><li> Cosplay and customization - you can dress yourself and your girlfriend using different clothes and accessories.<br/></li><li> Unique personalities - every player will get a unique girlfriend with her own likes and dislikes. Also, you can choose to date a dakimakura pillow.<br/></li><li> All graphics and 3D assets are hand crafted specifically for this game and are based on contemporary culture of Japan - including accurate recreations of vending machines, Tokyo street signs, Shinto amulets, food recipes, etc.<br/></li><li> Yuri - the game features romantic relationships between two girls.</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:03:21", "background_image": "https://media.rawg.io/media/screenshots/58e/58eb47df2f55c61cd72abe03b76161d0.jpg", "website": "http://shoujocity.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4, "dropped": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 223, "game_series_count": 0, "reviews_count": 1, "platforms": ["macOS", "PC"], "developers": ["Shoujo City Developer"], "genres": ["Simulation"], "publishers": ["Shoujo City Developer"], "esrb_rating": null}