{"id": 507182, "slug": "religion-inc-god-simulator", "name": "Religion inc God Simulator", "name_original": "Religion inc God Simulator", "description": "Religion inc – is a simulator of creating a religion in a popular genre of strategy. Will you find a way to unite the whole world under one faith? Create your own unique religion using different combinations of religious aspects!<br/>\n<br/>\r\nHumanity would always experience a compulsive need to believe in something bigger than ourselves. They would search for comfort in the darkness: the light that would enlighten their path in the shadows of millennia. For millions of people at all times this light used to be and still is faith. It was religion that became this guiding light which gave many people the meaning of their lives in this universe, helped them to hold out against the storms of changes and to come ashore of happiness. There are many religions in the world. Each of them gave its own response to the defiance of times and changes. But what other way could this process go? What other diversified and bizarre shapes did human beliefs take? The answers to these questions you will find in our new game. Create your own unique religion. Test if it can hold against the challenges of the times, the pressure of obstacles and bring the humanity together.<br/>\n<br/>\r\nReligion inc features:<br/>\r\n· Diverse archetypes of religions with unique cultural values and traditions!<br/>\r\n· Many different ancient religions of the world: Monotheism, Spiritualism, Pantheon, Paganism. Coming soon: Shamanism, Totalitarian sect and Destructive Cult!<br/>\r\n· Will the believers become furious fanatics or reach higher enlightenment? It all depends on you! Absolute freedom in a sandbox game about religions and god simulator!<br/>\r\n· Hundreds of actual religious aspects and we will add more! Learn more about ancient religions!<br/>\r\n· Unique active skills for each religion archetypes. Show miracles to the world!<br/>\n<br/>\r\nThe game was translated into the following languages: English, German, French, Spanish, Portuguese, Russian", "metacritic": null, "released": "2020-10-16", "tba": false, "updated": "2020-10-19T02:22:21", "background_image": "https://media.rawg.io/media/screenshots/683/683b99f7c6fe280d7783579116a73ada.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 13, "toplay": 1}, "playtime": 2, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 108, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["GameFirst"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["GameFirst"], "esrb_rating": null}