{"id": 507133, "slug": "inner-fear-jhone-marra", "name": "Inner Fear (Jhone Marra)", "name_original": "Inner Fear (Jhone Marra)", "description": "<p>Jogo onde o jogador dentro de um cenário quase absolutamente escuro tenta impedir que o medo (que é sua própria sombra) o alcance. Caso o jogador seja pego ele é absorvido pelas sombras e perde o jogo. O jogador deverá ativar 5 interruptores ao redor do cenário iluminando-os com as cores correspondentes, ao fazer isso o jogador consegue ver o caminho e uma porta de saída. Se ele consegue se libertar e chegar até a porta o jogador ganha o jogo. E descobre que o tempo todo ele estava dentro de um armário e conseguiu se libertar finalmente. O jogador tem 20 minutos para concluir o jogo.<br/></p>\n\n<p>Como Jogar:</p>\n<p>Use ASWD ou as setas do seu teclado para mover o personagem. Para interagir com objetos use “Crtl” ou “Clique esquerdo do mouse” ou “Barra de espaço.</p>\n<p>Neste jogo você deve levar os cinco objetos que emitem luz aos cinco interruptores de cor equivalente (Exemplo: Leve o objeto verde até o interruptor verde) para que estes sejam acionados. Você joga em um cenário escuro, com paredes que você só pode ver se se aproximar o suficiente e um monstro correrá atrás de você durante todo o tempo, (ele representa o seu medo). Você possui um pequeno raio de iluminação ao seu redor, e pode visualizar os objetos (interruptores e outros) quando se aproximar. Quando você conseguir ativar os 5 interruptores uma porta se abrirá e você poderá ver o local iluminado, corra até essa porta e você terminará o jogo. Você tem 20 minutos para concluir o desafio.</p>\n<p>Ps: Versão inacabada. </p>", "metacritic": null, "released": "2020-10-11", "tba": false, "updated": "2020-10-16T08:43:44", "background_image": "https://media.rawg.io/media/screenshots/319/319fe767247d941cd9ac1a9bfb54aed9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jhone Marra"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}