{"id": 507174, "slug": "bao", "name": "BAO", "name_original": "BAO", "description": "BAO (of the Swahili people)<br/><br/>Bao is a boardgame in the mancala family of boardgames (games with seeds and pits). <br/><br/>There are many simple mancala type games out there but none of those are as mesmerizing as Bao. This game focuses solely on the full unrestrained, unadulterated, and arguably most beautiful version of Bao: Bao la Kiswahili (‘Bao of the Swahili people’).<br/><br/><strong>Basics of the game</strong>: your goal is to rid your opponent’s front row of seeds, or to put your opponent in a position where they are unable to make any moves (stalemate). You do so by placing, sowing, and stealing seeds.<br/><br/><br/><ul><li> BAO provides unparalleled diversity and complexity, not a single game is ever the same.<br/></li><li> The online game mode provides masters and novices alike with a platform to meet their match, test their skills, challenge friends and duel other BAO adversaries.<br/></li><li> Besides providing a comprehensive Tutorial, BAO keeps track of all of the different rules. You can’t accidentally mess up a move, making learning the game a blast.<br/></li><li> BAO gives you the option of super human seed sowing speeds, making tirelessly long moves a thing of the past. <br/></li><li> Don’t want to play online? BAO also provides a carefully crafted AI to test your skills before you head into the ring.<br/></li><li> The AI knows what move to make before you can say “Bao la Kiswahili”, couple that with the fast sowing, and even the lengthier games are usually no more than 20 minutes.</li></ul>", "metacritic": null, "released": "2020-10-16", "tba": false, "updated": "2020-10-19T02:17:37", "background_image": "https://media.rawg.io/media/screenshots/d91/d910b340cebfd820dcd107ffceee0798.jpg", "website": "https://baoboardgame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 115, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC", "macOS"], "developers": ["VMS Media"], "genres": ["Strategy"], "publishers": ["VMS Media"], "esrb_rating": null}