{"id": 50711, "slug": "jak-x-combat-racing", "name": "Jak X: Combat Racing", "name_original": "Jak X: Combat Racing", "description": "<p>After a mysterious invite brings Jak and Daxter to Kras City, they discover that they have been poisoned by the sinister Krew. Krew proceeds to give the duo an ultimatum - race for him in the next Kras City Grand Championship and receive the poison antidote.  Jak and his friends must now race for their lives in the biggest combat racing on the planet - against the best drivers in the world!</p>\n<p>Experience Jak X: Combat Racing for PS2™ system with 1080p up-rendering and Trophies. Additional enhanced features include Shareplay (active PS Plus membership may be required), Remote Play, Activity Feeds and Second Screen support for game manuals with PS Vita or PlayStation App.</p>\n<p>This title has been converted from the original PlayStation®2 version to the PS4™ system. Consequently, there may be times where the title plays differently from the PlayStation®2 version, or where some features may not function properly. This version does not support PlayStation®2 peripherals, therefore some functionality may not be available.</p>\n<p>Software subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.</p>\n<p>© 2005 Sony Interactive Entertainment LLC.</p>", "metacritic": null, "released": "2005-10-18", "tba": false, "updated": "2023-02-01T09:43:22", "background_image": "https://media.rawg.io/media/games/dbd/dbd629dce42e03686c3eea7a96e30737.jpg", "website": "", "rating": 3.96, "rating_top": 4, "added_by_status": {"yet": 19, "owned": 92, "beaten": 44, "toplay": 17, "dropped": 20, "playing": 6}, "playtime": 0, "achievements_count": 26, "ratings_count": 51, "suggestions_count": 221, "game_series_count": 5, "reviews_count": 51, "platforms": ["PlayStation 4", "PlayStation 2"], "developers": ["Naughty Dog"], "genres": ["Action", "Racing"], "publishers": ["Sony Computer Entertainment"], "esrb_rating": "Teen"}