{"id": 507275, "slug": "blood-pressure-eli-vazquez-eli-vazquez", "name": "Blood Pressure (Eli Vazquez) (Eli Vazquez)", "name_original": "Blood Pressure (Eli Vazquez) (Eli Vazquez)", "description": "<p>Trapped in a dungeon without a weapon, you'll have to fight back with pressurized streams of your own blood. Blast baddies in this frantic action platformer, but don't forget to recharge before you bleed out. Explore the Metroidvania map, collecting keys and new abilities in search of an exit.</p>\n<p>This release is a demo featuring the game's first area, with a full version planned for 2021. However, this demo is not lacking in content, with an estimated play time of over an hour. This demo features a full Metroidvania map to explore, multiple unlockable abilities, and 9 hidden HP upgrades.</p>\n<p>If you enjoy the game, please consider donating to support the project via Itch.io's pay-what-you-want feature. Also, if you have any feedback, please post a comment, as it will help guide the game's future development.</p>\n<p><strong>Background</strong>:<br/></p>\n<p>The original version of Blood Pressure was developed in 48 hours for the Ludum Dare game jam. You can check out the original submission page here: https://ldjam.com/events/ludum-dare/44/blood-pressure</p>\n<p><strong>Credits</strong>:<br/></p>\n<p>A game by Eli Vazquez</p>\n<p>Music by Jack Szulc-Donnell</p>\n<p>Made with MonoGame</p>\n<p><strong>Known issue</strong>:</p>\n<p>There's currently a rare bug which sometimes causes breakable walls to not get colored in. If you run into this issue, try moving around and shooting from different angles and it should eventually work. If you find a way to consistently reproduce this bug, let me know, as it will help me find a solution.</p>", "metacritic": null, "released": "2020-10-19", "tba": false, "updated": "2020-10-19T03:02:27", "background_image": "https://media.rawg.io/media/screenshots/b06/b06d91acdb7206c665db4395774b15c8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 43, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Eli Vazquez"], "genres": ["Action", "Adventure", "Platformer"], "publishers": [], "esrb_rating": null}