{"id": 507209, "slug": "relicta-demo", "name": "Relicta Demo", "name_original": "Relicta Demo", "description": "The full version of Relicta is available here.\n<br/>\n\nRelicta is a first-person physics-based puzzle game where you need to creatively combine magnetism and gravity in order to unravel the secrets of Chandra Base. Alone in the treacherous depths of the Moon, your scientific mind is the only thing that can keep your daughter alive…\n<br/>\n<br/>\nPlay as a top physicist stranded on an eerie, derelict Moon base. Find your way around the enigmatic, terraformed craters by bending gravity and magnetism to your will in order to solve physical puzzles. Will you rush straight ahead and try to reach safety - or will you take your time to gather clues and unravel the intrigues of 22nd century orbital politics? Buried in the eternal darkness of the lunar craters lies a secret that might claim your daughter’s life - or change the fate of humanity forever. Are you ready to face the ultimate consequences of your research?Features:\n<ul><li>Mind-bending mechanics - alter gravity and magnetism at will.\n<br/>\n</li><li>Complex physical puzzles - combine your abilities in innovative ways to solve these physical riddles.\n<br/>\n</li><li>Lovingly detailed environments - each corner tells a story, each new step is a challenge.\n<br/>\n</li><li>Deep and enigmatic background story - Find clues and piece together the details about the investigation of the Relicta's anomaly.\n<br/>\n</li><li>Immersive original soundtrack - slip into the soundscapes of an sci-fi psychological thriller.</li></ul>", "metacritic": null, "released": "2020-08-03", "tba": false, "updated": "2020-10-19T02:38:27", "background_image": "https://media.rawg.io/media/screenshots/b42/b42b030227a1168af0dc2572d99d7cf6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 44}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 598, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mighty Polygon"], "genres": [], "publishers": ["Ravenscourt"], "esrb_rating": null}