{"id": 507200, "slug": "fishing-together", "name": "Fishing Together", "name_original": "Fishing Together", "description": "Are you bored at home during the epidemic? As the United Kingdom and the EU have just introduced bans on gatherings of more than 6 people, in such cases, how can we play with friends? We still need to be social however, and we need entertainments for ourselves too. <br/>\n<br/>\r\nThis game will help. This game has a noval way of playing: Party mode.<br/>\r\nLet's go fishing, and bombing schools of fishes with shinny cannons! This is a game that allows you to creat fishing game parties, letting 1-6 friends or family members to play together in a party pool. By creating a game party, and sending a 7-digit party secret passcode to your friends and family members, they can join in your party and play with you, on a private game server. <br/>\n<br/>\r\nBy purchasing just 1 set of this Fishing Together game for PC through Steam, you will get 12 activated sets of mobile-end Fishing Together games to share friends.  A value bucket!<br/>\r\nEach player will also get a starter pack of 120,000 gold coins, and your friends will also get a smaller mini-starter pack (10,000 coins) as soon as they log in for the first time. The gold coins in the starter pack will automatically turn into bullets, cannonballs and shuttles in the game, which are used to catch various schools of golden fish. The fish caught will also turn into new gold coins according to their respective values. You can use gold coins to open new parties, buy new equipments, draw a lottery in exchange for more special effects, and unlock more party games.<br/>\n<br/>\r\nYou can unlock more and more party games with your coins earned. Currently there are 5 kinds of game parties to be play directly, and 10+ to be unlocked!", "metacritic": null, "released": "2020-10-16", "tba": false, "updated": "2020-10-19T02:33:18", "background_image": "https://media.rawg.io/media/screenshots/8dc/8dcee5c8be8e1e7a6f13737feb50e73a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 265, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["William at Oxford"], "genres": ["Casual"], "publishers": ["William at Oxford"], "esrb_rating": null}