{"id": 507217, "slug": "zombero-hero-shooter", "name": "Zombero: Hero Shooter", "name_original": "Zombero: Hero Shooter", "description": "Become a zombie exterminator in post-apocalyptic top-down rogue-like bullet hell!<br/><br/>Fight through masses of zombies and other vile creatures in this roguelike shooter and enjoy epic adventure full of crazy action. Zombie apocalypse rages once again and only a man of strong faith and even stronger weapons can find a solution.<br/><br/><br/>FEATURES<br/>• Roguelike shooter<br/>• Heavy RPG elements<br/>•Bullet hell &amp; auto attack - dodge enemy fire and melee attacks and shoot while you are standing in place<br/>• Each run is different thanks to random selection of abilities<br/>• Equip your character with protective gear and weapons<br/>• Level-up your hero and equipment, and upgrade your skills and weapons so you can survive harder and harder encounters with enemies<br/>• Gain unique perks<br/>• Epic boss fights<br/>• Many types of zombies and other diabolical monsters<br/>• Cool environments - city streets, farm, sewers<br/>• Companions<br/>• Story of redemption and destruction<br/>• Offline game - even if you lose connection during run, you can continue playing (you just have to reconnect at the end)<br/><br/><br/>TOP-DOWN ZOMBIE SHOOTER<br/>Zombero brings you two best things in one package - popular hit and run survival game and zombies! You will be guiding your character through the world destroyed by zombies while eradicating everything that tries to eat you. You will start each run just with your own equipment and skills, but you will unlock new cool power-ups (abilities) as you quickly gain levels. Randomly generated unique combination of abilities will ensure that each run is different, but you can always pick from few - do you prefere multishot, fire bullets, piercing or ricocheting ammo?<br/><br/><br/>EASY TO LEARN, HARD TO MASTER<br/>• Simple and intuitive controls - you either attack or move<br/>• Deep and rewarding mechanics - if you have a skill, you will enjoy epic battles and get further faster<br/>• Master your defense game - you have one life for each run so self-preservation is a key<br/><br/><br/>Don't settle with being a mere archer, take your gun and show those undead monsters who's in charge here in the best action role-playing shooter! <br/><br/>Download and start playing now!", "metacritic": null, "released": "2020-10-07", "tba": false, "updated": "2020-10-19T02:41:42", "background_image": "https://media.rawg.io/media/screenshots/2f9/2f953b42ef3f11b8723deff83814ef98_z44pZrn.jpg", "website": "https://aldagames.com/games/zombero/", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 311, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Alda Games"], "genres": ["Action", "RPG"], "publishers": ["Alda Games"], "esrb_rating": "Teen"}