{"id": 507412, "slug": "the-forsaken", "name": "The Forsaken", "name_original": "The Forsaken", "description": "<p>The Forsaken is a medieval fantasy visual novel with romances and adventures. This is only the demo, as well as the prologue. I would like to make this an episodic game if I'm able and depending on the feedback this gets. </p>\n<p>You have lived your whole life in the mountains among the Forsaken to learn about your unique powers in peace , away from everything and everyone. You felt at home there, content with your quest for knowledge and wisdom, living among your peers. However, one year something shifted. Tensions started growing, people changed and you felt something ominous was settling in.  After years of feeling more and more oppressed, you realised you didn't feel at home anymore. One night you decide to escape, to see what's beyond these mountains. But your freedom will be short lived, as you realise you can't really flee from who you are.         </p>\n\n\n\n<p>The characters below <strong>don't appear in the demo</strong>, but you'll meet them soon in the following chapters, if this becomes a full game. I don't want to reveal too much about their role in the story, but here is a <strong>sneak peek</strong>:</p>\n\n\n<p>This demo contains: </p>\n<ul><li>Different choices of actions/dialogue.</li><li>3 different characters (with sprites, in addition to the main character).</li><li>Around 10 000 words, which is about 30-40 minutes of gameplay.</li></ul>\n<ul><li> CGs for characters / actions</li></ul>\n<ul><li>8 different backgrounds (+ 3 in the intro) </li></ul>\n\n\n<p><strong>Story,  art and programming:</strong> Lucie M. </p>\n<p><strong>Proofread and tested by:</strong> Caroline T.</p>\n<p><strong>Music and sound effects</strong>: See credits in game. </p>\n<p><strong>Font:</strong> </p>\n<p>Euphorigenic (https://www.1001fonts.com/euphorigenic-font.html)</p>\n<p>Roboto Slab (https://www.1001fonts.com/roboto-slab-font.html)</p>\n\n\n<p>I just want to add that I'm not a native English speaker, nor was my friend who graciously agreed to test the demo and advise me on my little project. If you see any mistakes don't hesitate to point them out, I'll correct them as soon as I can. </p>\n<p>Furthermore, I welcome feedback and criticism as long as it's constructive (and I really encourage you to express your opinion). </p>\n<p>Thank you for taking an interest in my demo, and thank you even more if you download it! </p>", "metacritic": null, "released": "2020-10-11", "tba": false, "updated": "2020-10-19T03:32:55", "background_image": "https://media.rawg.io/media/screenshots/b33/b3320d1dde912b65dccc19debd244af7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 227, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["MysticBrewGames"], "genres": [], "publishers": [], "esrb_rating": null}