{"id": 50757, "slug": "epic-loon", "name": "Epic Loon", "name_original": "Epic Loon", "description": "<strong>Synopsis</strong><br/><br/>They were locked away in stasis, hidden from the human world, in an antiquated piece of obsolete entertainment tech known as a VHS cleaner tape. Their restful prison, where they would remain until the end of time, was foolproof.<br/><br/>But thanks to a greedy shop owner and an analog cinephile named Joe, those mischievous creatures not of this world were free once more. They would make Joe pay for disturbing their slumber.<br/><br/>Become the alien. Invade Joe's prized film collection. Dodge his remote-controlled attacks as you destroy that which he most cherishes.<br/><br/>Be gross. Be evil. Be EPIC.<br/><br/><br/><br/>Dive into the bizarre world of Epic Loon, a quirky physics platformer for up to 4 players playable in single player, couch co-op, or battle mode.<br/><br/>An offbeat tribute to classic sci-fi movies, players lead a group of aliens to take over Joe’s TV after they are rudely awakened from their home, an old-school cleaning VHS-tape.<br/><br/><br/><br/><br/>Either go it alone, or play cooperatively with friends. But NOT ONLINE. You're gonna want to grab some snacks and get the empty candy wrappers off your couch, because you'll be sitting next to actual people, playing in the same place, at the same time! However you decide to play through the story, you'll be unlocking new bits of the game that you'll then get to rampage through in.<br/><br/><br/><br/><br/>Remember those friends you had over for Story Mode? SURPRISE! They're now your sworn enemies. Race against the clock as your friends race against the SAME EXACT CLOCK, and come out on top. The fastest player gets first place. Are you really going to let people you invited over take the crown away from you? What, do they think they own the place? CRUSH THEIR SPIRITS.", "metacritic": null, "released": "2018-07-13", "tba": false, "updated": "2019-08-28T22:03:20", "background_image": "https://media.rawg.io/media/screenshots/25c/25cd0e42f34d84cbfd45b956afc28c4b.jpg", "website": "http://epicloon.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 406, "game_series_count": 0, "reviews_count": 1, "platforms": ["PlayStation 4", "Nintendo Switch", "Xbox One", "PC"], "developers": ["Macrales Studio"], "genres": ["Action", "Indie"], "publishers": ["Ukuza"], "esrb_rating": "Mature"}