{"id": 50765, "slug": "front-defense-heroes", "name": "Front Defense: Heroes", "name_original": "Front Defense: Heroes", "description": "Front Defense: Heroes, the newest update to Fantahorn’s smash hit Front Defense, brings teammates together with you to most fierce war in human history -World War II. <br/>\r\nFront Defense: Heroes is a multiplayer VR shooting game set in WWII and can support up to 5 VS 5 online battle. <br/>\r\nFront Defense: Heroes delivers the most immersive war experience, using classic WWII weapons in life-like battlefield atmospheres. <br/>\r\nThe development team, Fantahorn, has come up with the best VR war experiences. There are various classic WWII weapons and intuitive control experiences, so players can explore the battlefield freely, make strategic movements and engage in a realistic combat.<br/>\r\nThe best military shooting game on VIVE include 3 different multiplayer fighting modes: Deathmatch, Flag, and Defend/Offend, With Front Defense: Heroes you can complete your team goals in all different modes, bringing victory and glory to your team.<br/>\r\nMultiplayer game mode:<br/>\r\nPlayers can choose to fight for the Allies or the Axis and engage in battlefields with different realistic atmospheres. With support of 5v5 battles, you and your teammates can support each other and discuss tactics through real time voice chat. <br/>\r\nV-move:<br/>\r\nThe ingenious design of player movement maintains the rhythm, continuity and fun of playing the game. It highlights the immersion of tactical movement for covering each other and fighting the battles strategically. <br/>\r\nTwo combat modes:<br/>\r\nTeam deathmatch: Show your skills to the utmost within the time to kill players on the opposing team.<br/>\r\nDefense: The two sides take turns to play offense and defense. The offensive team needs to have tactics to destroy a designated target at full force while the defensive team needs to hold fast to the target to make sure it is not destroyed by the other side.<br/>\r\nVarious classic WWII weapons:<br/>\r\nVarious classic WWII guns are at your disposal.<br/>\r\nMotion-sensing weapon operation: Use the two hands to shoot in order to suppress the recoil and increase accuracy, change clips manually, handle the machine gun, fill the Howitzer and other engagement experiences.<br/>\r\nDiversified combat actions:<br/>\r\nCharging, jumping, hunkering down and crawling forward are no longer just animations shown after buttons are pressed. In this game players need to use their own extremities to combine with the intuitive controller, just like new soldiers carry out various kinds of actions on the battlefield and survive in fierce battles!<br/>\r\nThrough immersive VR, experience the classic battles of WWII, feel the European <br/>\r\nstreets during wartime, fortress factories that manufacture secret weapons, church <br/>\r\ngraveyards in the mist and other realistic environments. <br/>\r\nEngage in this great war in VR and fight shoulder to shoulder with heroes and friends.", "metacritic": null, "released": "2017-12-08", "tba": false, "updated": "2019-08-23T12:12:07", "background_image": "https://media.rawg.io/media/screenshots/c35/c35e8ce069242601dae5d8a23c6bf773.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 6, "dropped": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 458, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Fantahorn Studio"], "genres": ["Action"], "publishers": ["VIVE studio"], "esrb_rating": null}