{"id": 507772, "slug": "the-trapped-princess", "name": "The Trapped Princess", "name_original": "The Trapped Princess", "description": "<strong>Description</strong>\n<p>This is a short-maze game all centered around one level, it should take you up to 30-40 minutes to complete the game fully.</p>\n<p>The objective of this \"Maze Game\" is to collect the pieces to unlock the way out. Can you find them all?</p>\n<strong>History</strong>\n<p>Legend has it, before the great war between the gods and the demi-gods, Humans constructed a \"Never Ending Maze\" in which they could imprison the leaders of both army's to make sure that a war could never happened... sadly there efforts were in vain, by the fourth age war had broken out. Throughout this blood socked war many humans, demi-gods and gods died, great armies that once were are no longer. At the beginning of the fifth age a Human overcame his fear and hatched a plan to finally end the wars. After many years Gogalo grew a name for himself from being a farmer to now the greatest warrior they had, Gogalo plan was simple... To catch the soul of the leader \"Seth\" who lead the armies of the gods, and imprison her into the \"Maze\". Next he planned to sacrifice himself with the help of Hopean a demi-god he curse Gogalo to forever protect the maze against anymore who would try and save Seth.</p>\n<p>After 1000 years the world forgot... Until the year 2020.</p>\n<p>You have been hired by a company called Olaz co, that has found maps containing the location of the maze. Will you take up the task of finding out if the legends are true? Are you chosen by the gods? </p>\r\nControls:\r\n<p>WASD: Movement. <br/></p>\n<p>Space: Jump.</p>\n<p>M: Open Map.</p>\n<p>F: Turn off and on flashlight.</p>\n<p>Left-click: Place a marker.</p>\n<p>Right-click: Remove said marker.</p>Discord:<p>Discord Link: NeverEndingLeX<br/></p>", "metacritic": null, "released": null, "tba": false, "updated": "2020-10-19T04:59:10", "background_image": "https://media.rawg.io/media/screenshots/439/439bba539d5bb928a3986040764861da.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 74, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["NeverEndingLeX"], "genres": ["Adventure", "Strategy"], "publishers": [], "esrb_rating": null}