{"id": 50771, "slug": "the-lord-of-the-rings-living-card-game", "name": "The Lord of the Rings Living Card Game", "name_original": "The Lord of the Rings Living Card Game", "description": "<p>Build your deck and face the Dark Forces of Sauron!<br />\nBattle Uruks, spiders, orcs, and more as you journey through Middle-earth, earning cards and devising new tactics along the way. In The Lord of the Rings Living Card Game, players lead their own fellowship of heroes through quests that will test their leadership, tactics, lore, and spirit. Ready your weapons, gather your heroes, and create your own story.Key FeaturesBased on the hit Fantasy Flight LCG® The Lord of the Rings: The Card Game<br />\nThe Lord of the Rings Living Card Game adapts the strategic gameplay of Fantasy Flight Games&#39; award-winning Living Card Game to digital platforms.<br />\nConstruct your Deck<br />\nWith numerous cards available day one and more on the way, decks in The Lord of the Rings Living Card Game are fully customizable. Build the perfect deck to topple your foes.<br />\nAssemble your Heroes<br />\nLead a team of up to three heroes through five distinct quests, with many more to come.<br />\nPreset Packs<br />\nThe Lord of the Rings Living Card Game introduces an innovative economy system built around preset card packs. Get the cards you want to play with and enjoy all the depth and customization of card games.</p>", "metacritic": 75, "released": "2019-11-05", "tba": false, "updated": "2020-06-27T20:05:19", "background_image": "https://media.rawg.io/media/screenshots/f97/f97e617d356f55ee180340f1cd877282.jpg", "website": "", "rating": 3.0, "rating_top": 3, "added_by_status": {"yet": 12, "owned": 329, "toplay": 1, "dropped": 8, "playing": 1}, "playtime": 3, "achievements_count": 71, "ratings_count": 14, "suggestions_count": 221, "game_series_count": 0, "reviews_count": 14, "platforms": ["PC"], "developers": ["Fantasy Flight Interactive"], "genres": ["Adventure", "Strategy", "Casual"], "publishers": ["Asmodee Digital"], "esrb_rating": null}