{"id": 50783, "slug": "pocket-squid-fishing", "name": "Pocket Squid Fishing", "name_original": "Pocket Squid Fishing", "description": "Enjoy the most unique and relaxing fishing experience anytime anywhere with your iOS devices.<br/><br/>Experience the true joy of catching live squids and legendary sea creatures.<br/><br/>Your ultimate goal is to catch all species of marine life in the sea of Squido Island and complete the collections of Fishbook and Treasurepedia.<br/><br/>Features:<br/>• Simple and unique gameplay mechanisms which are easy to learn and master.<br/>• Explore 5 fishing spots with stunning underwater reef scenes.<br/>• More than 50 species and 300+ types of marine life to catch.<br/>• Up to 30 deep sea treasures waiting to be discovered.<br/>• Environment seamlessly transitions between day and night according to actual time.<br/>• Enjoy the view of colourful reef with marine life and sounds of sea waves crashing.<br/>• Touch and interact with marine life in water.<br/>• Life-like squid movements.<br/>• Watch the live squids chasing and grabbing your bait in the water.<br/>• Keep your catch in the fish tank. Feed and watch them feeding on small fishes.<br/>• Share your catch on social media and help your friends to catch one too.<br/>• No internet connection required. Play anytime anywhere.<br/><br/>Enjoy your fishing vacation 365 days a year!", "metacritic": null, "released": "2014-04-13", "tba": false, "updated": "2019-10-22T14:30:54", "background_image": "https://media.rawg.io/media/screenshots/497/497104028430593b0825fb8d9ae37d2b.jpg", "website": "http://www.bestens.com.my/kusoboy", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 124, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Bestens Sdn Bhd"], "genres": ["Sports", "Family"], "publishers": ["Bestens Sdn Bhd"], "esrb_rating": "Everyone 10+"}