{"id": 507827, "slug": "orboros", "name": "OrboROS", "name_original": "OrboROS", "description": "Orbital rendezvous objectives simulator\r\nIt’s a snake! On orbital planes!\r\n<p>This is a no-engine game based on raw Vulkan SDK and some Haskell libraries I made to load stuff. The source code is on GitLab.</p>\n<p>I haven’t figured out how to build it on Windows, so… At least the Linux build should work out of the box on anything older than Ubuntu 18.</p>\n<p>The gameplay is a Snake - you move around and collect stuff. The twist is the playing field is actually 6-dimensional, as in 6 orbital elements. See below for controls.</p>\r\nControls\r\n<p>The controls are <strong>not</strong> intuitive. I had difficulties with rendezvous missions in Kerbal Space Program so I made this to grok it. It should be even more difficult with limited fuel, time and other restrictions.</p>\n<p>The controls are two-fold:</p>\n<ul><li>To actually change your orbit, activate (and hold) [space].</li><li>To lock spacecraft orientation use:<ul><li>[W] - orient prograde. That is, towards your next position, “forward”. This will raise the opposite point of your orbit.</li><li>[S] - orient retrograde. Turn around, engine-forward and prepare to brake. This will lower the point at 180° around your orbit.</li><li>[A]/[D] - orient “inside” and “outside” orbit. This is where things get funky. Those are slow burns that shift your orbit around.</li><li>[Q]/[E] - orient perpendicularly to your orbital plane. This will adjust your inclination, however unintuitively. Even slower burn.</li></ul></li></ul>\n<p>That’s it. Things will get faster the closer they get to the planet. Red color indicates the greater speed and lower altitude.</p>\r\nExtras\r\n<ul><li>[←]/[→] - rotate camera around the planet to get a better look.</li><li>[P] toggles game time. You still can do your burns though. This is to simulate more powerful engines and give you some time to think.</li><li>[1]/[2] - spawn more containers to catch!</li><li>[Backspace] - jettison your score and yourself to restart.</li></ul>", "metacritic": null, "released": "2020-10-05", "tba": false, "updated": "2020-10-19T05:12:00", "background_image": "https://media.rawg.io/media/screenshots/f52/f5265311944075b97f0bd0dba341ab24.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 52, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["IC Rainbow"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}