{"id": 50780, "slug": "omen-of-sorrow", "name": "Omen of Sorrow", "name_original": "Omen of Sorrow", "description": "<h3>Monsters of classic horror and mythology clash to take back the night!</h3><br/><br/>In a hidden underworld ruled by creatures of the night, a new terror has awakened! Omen of Sorrow brings monsters of horror, literature and mythology together for a fighting game experience unlike any other. Inspired by numerous arcade classics but offering its own unique innovations and mature aesthetics, Omen of Sorrow positively bleeds style!<br/><br/>Featuring a roster inspired by such icons as Frankenstein’s monster and Egyptian high priest Imhotep, this traditional 4-button fighting game rewards or punishes players based on how aggressive their playstyle is, putting a skill-centric spin on combat while keeping the experience accessible to newcomers. Powered by Unreal Engine 4, Omen of Sorrow’s 2.5D brawling spans a multitude of detailed locations with handcrafted animations and cinematic finishers, all set to a masterful soundtrack by composer Francisco Cerda.<br/><br/>The previously downloadable bloody countess Erzsébet now joins the main roster, alongside a massive blood dragon at her command. With a dozen vicious combatants at your command, who will you lead to victory, and who will fall to your bloodlust?<br/><br/><br/><br/><strong>Features:</strong><br/><br/><ul><li>Select from a varied roster of characters inspired by horror classics.<br/></li><li>Use cinematic finishers to take down opponents in style!<br/></li><li>Explore single-player modes against the CPU or challenge friends online.<br/></li><li>Strategize on the fly and turn the tide of battle through aggressive play!</li></ul><br/><br/><br/>", "metacritic": null, "released": "2017-12-08", "tba": false, "updated": "2023-03-24T04:39:35", "background_image": "https://media.rawg.io/media/screenshots/8d3/8d3105589a373aa9c9599bc6771ae81c.jpg", "website": "https://www.eastasiasoft.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 29, "toplay": 2}, "playtime": 0, "achievements_count": 34, "ratings_count": 0, "suggestions_count": 732, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "PlayStation 4", "Xbox One"], "developers": ["AOne Games Spa", "AOne Games"], "genres": ["Action", "Indie"], "publishers": ["eastasiasoft"], "esrb_rating": "Teen"}