{"id": 50785, "slug": "sachin-saga-cricket-champions", "name": "Sachin Saga Cricket Champions", "name_original": "Sachin Saga Cricket Champions", "description": "Experience complete cricket. Play Sachin Tendulkar’s Official Mobile Cricket Game. Play Realtime Multiplayer with 14 Million Players across the world.<br/><br/>Get ready to play as the legendary Master Blaster himself, in the fastest growing mobile cricket game! World’s Premier 3D Mobile Cricket Game with high-end graphics &amp; realistic motion captured animations where you play as the Sachin Tendulkar himself &amp; relive some of the most famous moments in real cricket history in console quality play.<br/>(One-days, Tests, T20, domestic, Premier League, World Cup – all included).<br/><br/>Compete against other World cricket teams, complete milestones, &amp; play real world cricket championships.<br/>Build your dream cricket team by collecting real player cards from over 350 real cricketers.<br/><br/>Highlights:<br/>* Nominated ‘The Best Mobile &amp; Tablet Game: Sports (India &amp; International) 2017 Award at FICCI<br/>* Sachin Signed Merchandise &amp; Rewards up for grabs in online events!<br/>* Super Fans get to meet Sachin Tendulkar<br/>* Manual Catches<br/><br/>Enjoy a complete cricketing experience – Batting, Bowling, Custom Fielding &amp; Manual Catches!<br/><br/>Exclusive Features:<br/><br/>Legendary Mode<br/>* Play as Sachin Tendulkar in his iconic cricket matches in the same settings &amp; stadiums as he did. Start your journey as a young 16-year-old Sachin &amp; live through his glorious cricketing career of 24 years.<br/>* Hit over 28 cricket shots the way he did, including his famous Straight drive, Cover drive etc.<br/><br/>PvP Real-time Multiplayer<br/>* Compete with Real Players online or with your Friends<br/>* Use Boosters to score more runs &amp; choose when to opt for Powerplay.<br/>* Top the League &amp; Engrave your Name in the Hall of Fame<br/><br/>Series Mode<br/>*Play classic domestic &amp; high-octane international tournaments.<br/>*Participate in SSPL - Sachin Saga Premier League<br/>*WIN Fan points &amp; get a chance to meet Sachin Tendulkar.<br/><br/>Quick Play Mode<br/>* Play 2-OVER Quick Blitz, Exciting T20 or Enduring ODI’s<br/><br/>Tournaments Mode<br/>* Participate in domestic &amp; international tournaments like Big Bash, Asia Cup &amp; more!<br/>* RELIVE ALL the amazing World Cup &amp; IPL Journeys in their authentic settings<br/><br/>Events Mode<br/>* Compete in cricket matches to top the Time-Limited event Leader boards hosted every month.<br/><br/>Superior Gameplay<br/>* Revolutionary batting systems that emulates real-world playing conditions in real stadiums resulting in authentic batting experiences<br/>* Motion captured batting shots of Sachin himself that allow you to play all cricket shots the way he does<br/>* Dynamic camera angles &amp; replay camera<br/><br/>SUBSCRIPTIONS:<br/>Subscribe to VIP Pass &amp; get an opportunity to progress faster &amp; access premium content!<br/>By subscribing to the VIP Pass, you get:<br/>- Access to Premium Teams &amp; Series Mode<br/>- Unlimited revives in Legend mode<br/>- Ad free experience<br/>Subscription cost is $4.99 per month. Your subscription will auto-renew every month unless you turn it off. You can turn off auto-renewal at any time from your account settings. No cancellation of the current subscription is allowed during an active subscription period. If you don’t choose to purchase subscription, you can continue using Sachin Saga for free.<br/><br/>https://www.jetsynthesys.com/terms-of-service/<br/>https://www.jetsynthesys.com/privacy-policy/", "metacritic": null, "released": "2017-12-06", "tba": false, "updated": "2021-03-26T05:09:58", "background_image": "https://media.rawg.io/media/screenshots/e78/e7804fcceb3bc81e4f4287c700992d0c.jpg", "website": "http://www.sachinsaga.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 444, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Jet-Play"], "genres": ["RPG", "Simulation", "Sports"], "publishers": ["JetSynthesys"], "esrb_rating": null}