{"id": 508077, "slug": "hypernova-a-hitchhikers-adventure-mobile-game", "name": "Hypernova: A Hitchhiker's Adventure - Mobile Game", "name_original": "Hypernova: A Hitchhiker's Adventure - Mobile Game", "description": "<p>Hypernova is a text based RPG where the goal is to reach the end of the level exploring the vast universe, talking with its multiple characters, understanding their emotional purposes and trying not to get killed.<br/></p>\n<p>You will be Alex, a citizen of B903 who realizes that, due to the corruption of the system, he cannot stay in his planet anymore.</p>\n<p>You will face the calamities and depression that this universe has to live in its day to day because of a Space Federation that only brings death and poverty to its people.</p>\n\n<p>Features:</p>\n<ul><li><strong>Consequences based story. </strong>The most important thing about this universe are the actions you do and the words you say. Once you say something, you live with that and once you kill someone, you will be remembered for that aswell.</li><li><strong>Natural language interface.</strong> You will choose to do whatever you want by just typing the action in the commands line. The machine will process your action and this will cause its repercussion in the universe.</li><li><strong>Inmersive story.</strong> The narrative is written with the objective of telling you a sci-fi tale, which you can change and corrupt however you want. Nevertheless its objective is to have a story telling vibe that will adapt to your responses.</li><li><strong>References of the game.</strong><ul><li>Rick and Morty. For their \"who cares about the universe\" mentality.</li><li>The Hitchhiker's Guide to the Galaxy and Zork games.</li><li>The Treasure Planet.</li></ul></li></ul>\n<ul><li><strong>Fred.</strong> He is just a character that is there to help you. He is not even a main character in the story. This funny guy will give you a hand from time to time and occasionally you will have to help him too.</li></ul>\n<p>Android 5.0+</p>", "metacritic": null, "released": "2020-10-17", "tba": false, "updated": "2020-10-19T06:09:46", "background_image": "https://media.rawg.io/media/screenshots/e6f/e6fe68264cdb6f9cd991fb8e335a497d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 40, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["GoodOfVanders"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}