{"id": 508053, "slug": "towers-of-essence", "name": "Towers Of Essence", "name_original": "Towers Of Essence", "description": "Welcome Great Mage. We need your help.\r\n<p>Our home is under attack! It is up to you and your tower placement abilities to help us, place towers around the world and fend off the goblin hoard, we can't take too much damage or else all is lost.</p>\r\nFeatures of this game:\r\n<p>This game is set in a lovely 3D voxel world, with a beautiful procedural skybox. </p>\n<p>All the assets you see in game where made by me, except for the music.</p>\n<p>At its core, this game is a Tower Defence but I've added a few special features to hopefully keep it fresh.</p>\n<p>Firstly it has procedural enemy generation, much like a loot system in your favourite RPG my game features random enemy spawning, so that each wave will be different. I've tried to focus on the strategy aspect of the Tower Defence, by making it have limited numbers of tower placement blocks, and you can only have a limited numbers of towers at once. This should make it so you need to move towers around the map as you get further on in the waves and more enemies start to spawn.</p>\n<p>Even the trees around you are spawned procedurally...because I mean, who has the time to place all those trees by hand, not me!</p>\r\nWhat is this game?\r\n<p>Towers of Essence is a Game Demo/Showcase, I did plan for it to be a full game but the realisation that I had over planned and wanted too much out of this project became very real. However I decided to go back and make this game a lot simpler, whereas instead of multiple worlds, you have 5 (6 technically) waves of enemies to defeat!</p>\n<p>I have posted this for two reasons, one I thought people might enjoy it and two I'd love to see if people want me to carry on with this game and develop it further as I did have some future ideas.</p>\n<p><strong>Future Ideas:</strong></p>\n<ul><li>Ability to speed up game</li><li>Boombox enemy attracts towers towards it</li><li>More enemy types and enemies having unique features</li><li>A shop</li><li>More towers</li><li>More bosses</li><li>A story</li><li>Different Game Modes</li></ul>\r\nSo...you need some help - well that's what this is here for!\r\n<p><strong>The Towers:</strong></p>\n<p>You can only place<strong> 5 towers</strong> down at a time, so be sure to make the best use of this limit!</p>\n<ul><li>Purple - Basic Tower -Average Attack and Fire Rate - Range of 2 blocks</li><li>Red - Strong Tower - High Attack but Low Fire Rate - May burn enemies - Range of 1 block</li><li>Yellow - Fast Tower - Low Attack but High Fire Rate - May stun enemies - Range of 2 blocks</li></ul>\n<p><strong>The Enemies:</strong></p>\n<p>Enemies are randomly spawned in a different order and amount each game but the ones you will face are:</p>\n<ul><li>Standard Green Goblin - Moves at an Average Speed and Deals Average Damage</li><li>Fast Blue Goblin - Moves at High Speeds but Deals Low Damage</li><li>Boombox Purple Goblin -  Moves at Low Speeds but Deals High Damage </li></ul>\n<p>If you somehow make it to the end you will need to face off against the boss:</p>\n<p><strong>Ebrietas</strong> the Brawler - A mean Goblin warlord who's punches have destroyed mountains which stood in his way, will your castle walls be able to defend against him?</p>", "metacritic": null, "released": "2020-10-17", "tba": false, "updated": "2020-10-19T06:04:17", "background_image": "https://media.rawg.io/media/screenshots/fe4/fe4c0561bee13e30aef4d45e2668d960.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 156, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["GamesbySaul"], "genres": ["Action", "Strategy"], "publishers": [], "esrb_rating": null}