{"id": 508231, "slug": "rivelon", "name": "Rivelon", "name_original": "Rivelon", "description": "<p><strong>RIVELON (available in English &amp; French)</strong></p>\n<p>Rivelon is a visual novel in which we embody a Viscount, lulled since his early childhood by the intrigues of the local nobility. Cynical, skillful, charming at times, lon Taliaan has everything to please as well as to displease, which suits him perfectly. But <strong>everything changes when he starts showing strange symptoms</strong> that medicine cannot explain. In his madness, a hallucination whispers him to go to the Archipelago to find a cure. Problem ...? This Archipelago does not exist. At least, so it seems...<br/></p>\n<p>Will you use your influence and privileges to obtain a cure or will you go on a breathtaking journey with no guarantee of return?</p>\n<p>Take part in an adventure that suits you! </p>\n<p><strong>2 out of 60 hours</strong> of original reading are already available! For the rest, we await nothing but your input and enthusiasm to release it! <strong>70 endearing characters</strong> including 15 inclusive love interests, more than <strong>50 contemporary and exotic landscapes</strong>, with <strong>many choices </strong>and <strong>mini-games</strong>!</p>\n<p>Between love, fame and blackmail (not necessarily in that order), <strong>will you entertain the right relationships to achieve your goals?</strong> Fall in love, be unfaithful or stay by yourself, your story is yours to write!</p><p>----------</p><p>Rivelon c’est un visual novel où l’on incarne un Vicomte, bercé depuis sa tendre enfance par les intrigues de la noblesse locale. Cynique, habile, charmeur à ses heures, lon Taliaan a tout pour plaire comme pour déplaire, ce qui lui sied à merveille. <strong>Mais tout bascule le jour où il contracte d'étranges symptômes</strong> que la médecine ne parvient pas à expliquer. Dans sa folie, une hallucination lui souffle de se rendre sur l'Archipel pour y trouver la guérison. Seul problème ..? Cet Archipel n'existe pas. Du moins, paraît-il…</p>\n<p>Jouerez-vous de votre influence et de vos privilèges afin d’obtenir un remède ou bien partirez-vous pour un voyage époustouflant sans garantie de retour ?</p>\n<p>Prenez part à une aventure qui vous ressemble ! </p>\n<p>Déjà<strong> 2 des 60h</strong> de lecture inédite sont disponibles,  nous n'attendons que votre soutien pour poursuivre ! <strong>70 personnages</strong> attachants dont 15 love interests, plus de <strong>50 décors </strong>contemporains et exotiques, avec de <strong>nombreux choix </strong>et <strong>mini-jeux </strong>!<br/></p>\n<p>Entre amour, gloire et chantage (pas nécessairement dans cet ordre), <strong>saurez-vous lier les bonnes relations pour aller au bout de vos objectifs ?</strong> Tombez amoureux, soyez infidèle ou restez solo, votre histoire vous appartient !</p>", "metacritic": null, "released": "2020-10-16", "tba": false, "updated": "2020-10-19T06:47:12", "background_image": "https://media.rawg.io/media/screenshots/009/009dcb33e5ff2908c3de268ec38984ae.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 245, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Exorde"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}