{"id": 50831, "slug": "billiards-wizards", "name": "Billiards Wizards", "name_original": "Billiards Wizards", "description": "Welcome to Billiards Wizards, a game unlike any other you have ever seen: <strong>control an wizard and cast several spells to create amazing shots</strong>! Choose from <strong>11 unlockable wizards</strong>, grab one of our <strong>20 cues with several bonuses</strong> and join online or local matches to master <strong>over 30 different spells</strong>!<br/><br/>Have you ever wondered what your regular pool game would look like if a ball could attract others? Look no further than the Attraction spell!<br/> <br/><br/>What about hiding the pockets so that your opponent would have a harder time hiding them? Try the Shadow Canopy spell!<br/> <br/><br/>Here are some more reasons why you should give this game a shot:<br/><ul><li> <strong>Great physics</strong>: the balls move around the table just like they do in real life, and we’re still improving them even further!<br/></li><li> <strong>Tight controls</strong>: fast and responsive controls so that you get to spend your time planning your next shot, not fighting the controls.<br/></li><li> <strong>Fair matchmaking</strong>: always face enemies of your level so that playing online is as fun and fair as it should be.<br/></li><li> <strong>Local multiplayer</strong>: if you ever want to challenge a friend that’s just beside you, head straight into a local match with either two controllers or in hotseat mode (both players share same keyboard).<br/></li><li> <strong>Neat cosmetics</strong>: you begin the game with 6 different wizards to choose from, but there are 5 more to unlock!<br/></li><li> <strong>Enormous variety</strong>: we have over 20 cues and over 30 spells. You can also assign any of our over 100 runes to your spells to fine tune them, so you’ll never face two opponents using the same strategy!</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-23T12:12:07", "background_image": "https://media.rawg.io/media/screenshots/910/9101acc49fff7a996662a456d7bd54ae.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 52, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Bloom Studios"], "genres": ["RPG", "Sports"], "publishers": ["Bloom Studios"], "esrb_rating": null}