{"id": 508379, "slug": "dark-devotion-prototype", "name": "Dark Devotion - prototype", "name_original": "Dark Devotion - prototype", "description": "Where it all began...<p>This is the prototype produced for <strong>Dark Devotion</strong> 2D platformer rogue-lite game from <strong>June to August 2015</strong>.</p>\n<p>The final game based on this prototype was released in <strong>April 25 2019 on PC</strong> and <strong>October 24 2019 on Switch &amp; PS4</strong>, more details here.<br/><br/></p>The controls<p><strong>The team behind the prototype:</strong><br/></p>\nThe team behind the prototype\n<ul><li>Louis Denizet - design &amp; code</li><li>Aymeric Thevenot - lead art</li><li>Benjamin Baldassini - music</li></ul>\n<p>Benjamin also worked on Dark Devotion final version during early stages. He made a compilation of his work for the project named The Forgotten Songs which I highly recommend you to listen to while reading this article. Listening to them always makes me feel so nostalgic in particular \"Hope\" that really echoes the <strong>contemplation and devotion vision we had </strong>for the game back then.</p>\n<p>The prototype was made on Clickteam Fusion 2.5 and it was partly made with the talented people from Bulwark Studios as Aymeric had an intership in their studio at this time, they gave us the opportunity to improve our concept.</p>\n<p>At this time the game was inspired by Steam game Shadowcrypt I felt we could improve but Aymeric was already a Dark Souls player was greatly inspired by it.<br/></p>\n<p>He quickly made sketches of our main character, I don't really remember why we aimed a female character as it was pretty unusual at this time.<br/></p>\n<p>\n</p>\n<p>The medieval and fantastic tone of these sketches were absolutely on point and quickly a devoted knight appeared from the darkness. We wanted her strong and confident in her fighting skills and sword mastering.</p>\n\n<p>He then drew the now known as templar in pixel art and all we wanted from this point was to be able to control her in game and slay herectics.</p>\n\n\n<p>He also created concepts for enemies, we had a clear vision of what the game was going to be about, you can spot a lot of these enemies to be very similar to first world enemies in particular with the faceless enemies wearing masks.</p>\n\n\n<p>Some enemies were selected to have better concepts and be made in pixel art and we had our first enemies.</p>\n\n\n<p>\n</p>\n\n<p>We also had the opportunity to have a bigger enemy that would block with a massive shield and swing a very massive sword.</p>\n\n<p>\n</p>\n\n<p>Code wise I was coding things in a very amateur way so we had a lot of issues and nothing felt really stable but we had Normal Maps lights and it felt very nice to have in such a small prototype but it was very complicated to handle and it used a lot of ressources!</p>\n<p>It allowed things like this : </p>\n\n<p>It is important to note that this prototype was a more action packed version of a game I was working on for several months already, in June 2015, before we teamed with Bulwark Studios, Aymeric &amp; Benjamin for this prototype. </p>\n\n<p>The game I was working on included :<br/></p>\n<ul><li>6 HP and 6 armor points linked to Armor &amp; Relics to equip</li><li>2 sets of weapons you could swap with \"tab\"</li><li>Runes to set on weapons</li><li>Consumables</li><li>2 dodges depending of direction</li><li>Ladders to explore &amp; even spike traps you probably know if you played the final version of the game</li></ul>\n<p>It is crazy to see how little it changed</p>\n<p>this demo is more action packed because... etc</p>", "metacritic": null, "released": "2020-10-16", "tba": false, "updated": "2020-10-19T07:22:53", "background_image": "https://media.rawg.io/media/screenshots/70a/70a2b92cc9c306d1805c2f53f4c71692.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 39, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Louis Denizet"], "genres": [], "publishers": [], "esrb_rating": null}