{"id": 50841, "slug": "man-of-law-judge-simulator", "name": "Man of Law | Judge simulator", "name_original": "Man of Law | Judge simulator", "description": "In our game you can immerse in the world of the most progressive and controversial justice system in the world, cover a career path from an alumnus of prestigious law school to the head of the county court. <br/>\n<br/>\n<br/>\r\nWe offer a very unusual gaming experience in the most exciting simulator of the judge activity. <br/>\n<br/>\n<br/>\r\nIn the game you will be waited of:<br/>\r\n• Work with criminal and civil cases.<br/>\r\n• Most interesting judicial processes of modern time and tours into the history of jurisprudence. <br/>\r\n• Problems and joys of the judge’s private life.<br/>\r\n• Financial difficulties and temptations. <br/>\r\n• The hero’s adventures beyond the temple of Themis.<br/>\n<br/>\n<br/>\r\nYou won’t be bored because our game is full of sharp satire and humor. We are not going to torment you by routine, but want to make your brain work!<br/>\n<br/>\r\nYou will meet a history of the decider of the fate who is on the hook of the Bureau of investigation or the life of an honest but poor clerk. <br/>\n<br/>\r\nKnowledge or reputation?<br/>\r\nQuick money or long and cautious way to the Top?<br/>\r\nAn offshore six zero account or the salary of an honest judge?<br/>\r\nBusiness dinner with a prospective protégé or an evening spent on preparation of a science monograph?<br/>\r\nCareful bribe or principled, but immoral decision?<br/>\r\nA wolf in sheepskin or a jealous advocate of the legality?<br/>\n<br/>\r\nOr maybe your talent will allow you to balance on the fine line between risk, skill and influence? The choice is yours!<br/>\n<br/>\r\nSet the most ambitious goals, take fair or not very fair solutions and move up the food chain of the judicial system.", "metacritic": null, "released": "2017-12-22", "tba": false, "updated": "2019-08-28T22:03:18", "background_image": "https://media.rawg.io/media/screenshots/405/4050f62a2e921e7e74c1fad3f38f0c9a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 8}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 160, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["VITALII HOLIEV"], "genres": ["Adventure", "Simulation", "Casual", "Indie"], "publishers": ["VITALII HOLIEV"], "esrb_rating": null}