{"id": 508518, "slug": "hard-bullet", "name": "Hard Bullet", "name_original": "Hard Bullet", "description": "Hard Bullet is a brutal physics sandbox VR game with realistic enemy interactions, gore and dismemberment, slow motion abilities, survival modes, lots of guns and cinematic environment destruction.<br/><br/><ul><li><strong>Fast-paced Action:</strong> inspired by genre-defining classic Hong Kong action movies. <br/></li><li><strong>Destructions and Physics:</strong> using the best solutions to bring realistic physic destructions, object and environment hand interactions.<br/></li><li><strong>Slow Motion and Tricks:</strong> control time like famous PC and console blockbusters — perform long jumps in slow motion and kick enemies with your overpowered fists.   <br/></li><li><strong>Weapons:</strong> Expect variety of famous pistols, submachine guns and shotguns, you'll get some sweet rifles and machine guns as well.<br/></li><li><strong>Enemy Gore Body Damage:</strong> Accurate full body IK systems. You can turn on real gore mayhem with body dismembering, bullet holes and blood fountains if you are ready.</li></ul><br/><br/>▬▬▬▬▬▬▬ <strong>24 G U N S</strong> ▬▬▬▬▬▬ <strong>B L U N T S</strong> ▬▬▬▬▬▬ <strong>M O D E S</strong> ▬▬▬▬▬▬▬<br/><br/><h3>Large gun collection and handy blunt weapons</h3>Here is a collection of legendary firearms you can unlock during <strong>Early Access</strong>. Each gun has its unique sounds, damage and fire modes.<br/><br/>Meet and unlock dozens of iconic firearms to take with you into battle:<br/><ul><li><strong>8 Automatic Pistols</strong> like Gretta, Sweet17, Greening and more!<br/></li><li><strong>12 Submachine Guns</strong> — take one in each hand and never stop bursting!<br/></li><li><strong>8 mighty Shotguns</strong> to shred enemies in parts: Moss50 or Ram870? Why choose when you can take both? </li></ul><ul><li><strong>2 Rifles.</strong> Ivan47 or Mark16 — best of east and west for you.</li></ul><strong>Notice, these guns do not copy the exact design of real prototypes, but we tried to stick to reality as close as we could.</strong> You can check the full list of guns and their real world inspirers here in Discussions.<br/><br/><strong>But what about close combat?</strong><br/>While the bladed weapons are still in work, we have some cool stuff to show.<br/><strong>You can use any game object to fight enemies! Be creative! </strong><br/><h3>Two Gunplay modes: Arcade and Tactical</h3>We prepared two different gun modes so you can feel yourself a powerfull action movie hero as well as a tactical modern fighter:<br/><ul><li><strong>Tactical Mode</strong> brings everything you like in realistic shooters: <strong>hand reloads</strong>, cool mag-hits-mag tricks, slow-mo gunswaps and all the stunts you can discover. Use both hands to <strong>hold handguard</strong> weapons to reduce recoil, be fast and sharp to get out alive.<br/></li><li><strong>Arcade Mode</strong> is the one we wanted to bring to VR. Your <strong>guns do autoreloads</strong> when you bring them closer to your waist, so both your hands can have one. Do crazy <strong>dual wielding</strong> jumps, use two shotguns at a time or show your gun fu skills with dual pistols. </li></ul><br/><br/>▬▬▬▬▬▬▬ <strong>G O R E</strong> ▬▬▬▬▬▬▬ <strong>R A G D O L L S</strong> ▬▬▬▬▬▬▬ <strong>A I</strong> ▬▬▬▬▬▬▬▬<br/><br/><h3>Gore and Dismemberment</h3>Compex dismemberment and realistic bullet damage with blood fountains all around — can it be more fun?<br/><br/><br/><strong>Oh boy it can.</strong><br/><br/>Use different gory instruments like meat grinders, sharp spikes, killer stackers and electricity powers to bring world of pain to this f*****s. They deserve this.<br/>Have your own gory ideas? Share them with us through Discussions or Discord.<br/><h3>Ragdolls and AI</h3><ul><li>All enemieas have <strong>several weapons</strong> on them to use.<br/></li><li><strong>Doing special attack</strong> if player gets too close. <br/></li><li><strong>Looking for cover</strong> when are low on health. Looking for guns or batons when lost theirs.<br/></li><li><strong>Commenting the situation</strong> around. </li></ul><strong>AI is not perfect and we work on it every day.</strong><h3>Physics fun you can do:</h3><ul><li><strong>Hit with any object</strong> you can find. Gun butts are good too.<br/></li><li><strong>Grab and kick</strong> enemies with your fist, threw them into abyss and <strong>use as shields</strong>.<br/></li><li><strong>Shoot off their limbs</strong> or put into a hydraulic press — gory fun is on us.</li></ul><br/><br/><br/>▬▬▬▬▬▬▬▬▬▬ <strong>T O</strong> ▬▬▬▬▬▬▬ <strong>B E</strong> ▬▬▬▬▬▬▬ <strong>T O L D</strong> ▬▬▬▬▬▬▬▬▬▬<br/><br/><br/><br/><br/><br/><br/>", "metacritic": null, "released": "2020-10-22", "tba": false, "updated": "2023-01-16T22:55:39", "background_image": "https://media.rawg.io/media/screenshots/645/645fd3d990d633e507ef9bf25cdce582.jpg", "website": "http://www.gexagon.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 88, "toplay": 3}, "playtime": 1, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 456, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["GexagonVR"], "genres": ["Action", "Adventure", "Simulation", "Indie"], "publishers": ["GexagonVR"], "esrb_rating": null}