{"id": 508579, "slug": "draw-story-love-the-girl", "name": "Draw Story: Love the Girl", "name_original": "Draw Story: Love the Girl", "description": "Draw the puzzle to complete the Love Story! <br/><br/>The boy needs your help to save his love! There are some hidden objects in love story. The girl looks sad so you need to draw the correct story and find hidden puzzle to help the boy escape from his confusion. You have to draw puzzle carefully to escape games. Spend time thinking of the hidden objects and drawing it in the picture. <br/><br/>Worry about your bad draw skill? Don’t! Our drawing games is easy to draw. It’s simple to get a high level with your brain in this draw games.<br/><br/>BIG SURPRISE FEATURES OF LOVE STORY:<br/><br/>-        Don’t be tricked! Each level of this draw games shows you with multiple love story and brain test - make the correct answers to draw one part or draw the word. Wrong answers will result in painful and can’t save the boy but funny outcomes for his! <br/><br/>-        So many levels to draw a story. Each level is unique draw puzzle that brings you an astonishing combination of logical puzzle, drawing and brain test. <br/><br/>-        Fun for the whole family to draw their own story. Everybody can play this brain games and color games. If you get stumped - ask for help from your friends and family to draw the story or draw your word! It's necessary to escape these complex puzzle. <br/><br/>-        Simple and Addicting Drawing offline: Once you start you will want to keep solving the upcoming love story. This is the best offline drawing games!<br/><br/>-        Is it that draw puzzle game drawing games from those ads? Yes, it actually is. <br/><br/>-        Variety of drawing packs to unlock, save the boy and collect the coints.<br/><br/>Wanna get some fresh and relaxing time with brain test, brain games, escape games and color games?<br/><br/>Whether you are a fan of puzzle games, drawing games, escape games, brain games, color games, draw puzzle game or you just want to have a relax time with draw games, then Draw Story: Love the girl is the best offline draw games for you. Will you draw the full of story to help the boy? Let's try!!!<br/><br/>Do you know how to draw the word or save the boy with his love story?<br/><br/>Probably you’ll fail few times when you draw the word. Do not worry! This escape games will provide you with guidance and hints in case you could not draw one part of the hidden objects!What would you do to fill this hidden objects?<br/><br/>AMAZING GRAPHICS &amp; SOUND:<br/><br/>- As a drawer, immerse yourself in the “draw one part” world of funny graphics and impressive animations.<br/>- Draw one part is a magic way to help in this color games and brain games, which will completely polish the boy’s love story and get him out of embarrassing situations with his girl.<br/>- This game is a brain test for people who would love to challenge their IQ and drawing skill", "metacritic": null, "released": null, "tba": false, "updated": "2020-10-23T02:30:33", "background_image": "https://media.rawg.io/media/screenshots/325/325c8d121e5c34af5a007e08de14a843.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 81, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["FUNNII"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": "Teen"}