{"id": 508562, "slug": "anibabe", "name": "Anibabe!", "name_original": "Anibabe!", "description": "Anibabe! is THE place to find the hottest moe bishoujo content created JUST FOR YOU! Enjoy exciting storylines where you get to choose what happens and which of the unique girls you’d like to make YOUR girlfriend!<br/><br/>Choose your girl! <br/>Each story has a cast of unique and cute girls that you’re able to romance! Tsundere childhood friends your thing? We’ve got you covered! Is a cool senpai with a mysterious aura more your type? You’re in the right place! With so many of them to choose from, who will be your waifu? <br/><br/>Choose your story!<br/>You’ll get to pick which stories you want to read from a HUGE selection of titles that include genres such as fantasy, action, drama, and horror! Once you start, you won’t be able to stop reading!<br/><br/>The choice is yours!<br/>Will you save the girl or will you let someone else get all the glory? Do you go for the kiss, or do you hesitate? In Anibabe!, you get to decide! <br/><br/>Featured stories:<br/><br/>My Rental Girlfriend<br/><br/>You’ve decided to “rent” a girlfriend to escape humiliation in front of your friends and you end up meeting three beautiful girls! Things seem to go well at first… But what will you do when you start to develop real feelings for the girls? ⁠<br/><br/>My Crazy High School Romcom!<br/><br/>You are an aspiring manga artist who wants to make it big someday. The problem is, a new school year has come! No one looks forward to it—not even you.⁠<br/>⁠<br/>Things change when you get seated next to an energetic classmate, and you meet another girl who desperately needs your help to get close to your best friend. Just when things couldn’t get more complicated, a familiar face from the past arrives.⁠<br/><br/>Will you be able to capture the attention of these girls in time for the upcoming school festival?⁠<br/><br/>Protect My Love<br/><br/>Your mission was to assassinate three targets... But when you learn that those targets are three orphaned sisters, you abandon the mission. Now serving as their bodyguard, will you be able to protect them from a dangerous organization?⁠<br/><br/><br/>Dozens of other stories are also available to read! Download now to check them out!", "metacritic": null, "released": "2020-08-15", "tba": false, "updated": "2020-10-23T02:23:04", "background_image": "https://media.rawg.io/media/screenshots/569/569bb4f78e647c5b41a734769d126d2e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 158, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Genius Studio Japan"], "genres": ["Adventure", "Simulation"], "publishers": ["Genius Studio Japan"], "esrb_rating": "Teen"}