{"id": 50857, "slug": "the-dead-cloud-forest", "name": "The Dead Cloud Forest", "name_original": "The Dead Cloud Forest", "description": "Born in a White World, Facing a mystery forest. All you could do is keep moving forward, Watch out for the incoming obstructions, hit anything will restart the game. Try to run further, Gain higher score, Noting the orange items , they will help reduce your speed, make good use of them.<br/>\r\n    This is my first time creating a indie game, it's simple but also have some challenging details. Furthermore it provides 3 kinds of game mode. When you got faster and faster, you will also experience speed in vision.<br/>\r\n    Although this game is too simple to say, but I think it's a interesting thing to show it before other players, this is only the beginning, I will keep working on creating more and more fun games.<br/>\r\n    The Dead Cloud Forest is a Parkour Game, in which players should try their best to run further with increasing speed.<br/>\r\n   Main Features:<br/>\r\n   1· Intense racing game in a Zen-like white clould forest;<br/>\r\n   2· 3 Game mode, 3 kinds of experiences, In the easy mode, you will only face the dead trees which you should avoid; In the normal mode, you will face extra obstacles such as guide boards; In the Zombie Mode, you will experience running between zombies and try hard not to hit them in order to survive.<br/>\r\n   3· Game provides some special items to help players control their speed.<br/>\r\n   4· Running in White Cloud Forest and enjoy 4 kinds of Zen-Like background music.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:03:17", "background_image": "https://media.rawg.io/media/screenshots/c2a/c2a6c84231de9af737fc5f22fac015d9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 20}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 95, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Carlos"], "genres": ["Adventure", "Racing", "Indie"], "publishers": ["Carlos"], "esrb_rating": null}