{"id": 508580, "slug": "wood-block-puzzle-free-classic-block-puzzle-game", "name": "Wood Block Puzzle - Free Classic Block Puzzle Game", "name_original": "Wood Block Puzzle - Free Classic Block Puzzle Game", "description": "Wood Block Puzzle - Free Classic Block Puzzle Game, which also named Qblock is a classic addictive wooden style block puzzle game. Qblock challenges you to fit blocks of different shapes into a 10×10 grid. Wood Block Puzzle (Qblock) is a real classic, no time limit and totally free elimination game. Play Wood Block Puzzle - Free Classic Block Puzzle Game (Qblock) everyday, find the brand new combo mode in this classic block puzzle game.<br/><br/>How to Play Wood Block Puzzle - Free Classic Block Puzzle Game (Qblock) :<br/>✓💪Drag and drop blocks into 10×10 grid<br/>✓💪Fill the blocks with a row or column to eliminate them<br/>✓💪Game will be over if there is no room on the board for given blocks<br/>✓💪Blocks CAN'T be rotated<br/>✓💪Reward scores for each step and every row or column of blocks you eliminated <br/>✓💪Get as many scores as you can to become the best block crush at Wood Block Puzzle - Free Classic Block Puzzle Game!<br/><br/>Features of Wood Block Puzzle - Free Classic Block Puzzle Game (Qblock) :<br/>✓💪Completely free to play<br/>✓💪Truly enjoy the fun of puzzle game: NO wifi needed<br/>✓💪Pure game environment: NO time limit<br/>✓💪Innovation in the classics: Provide a grid to place a temporarily unwanted block<br/>✓💪Brand New combo mode: 4 times or more combo will cause a round of shaking<br/>✓💪Brisk game sound effects <br/>✓💪Quick to understand rules, easy to control<br/>✓💪Elaborate interface: wooden style gets you close to nature.<br/>✓💪Constantly update the various shapes of blocks, classic and challenging<br/>✓💪Simple and addictive! <br/>✓💪Support game scores recording, support friend rankings, come and find our more services at Wood Block Puzzle - Free Classic Block Puzzle Game!<br/><br/>Wood Block Puzzle - Free Classic Block Puzzle Game (Qblock) also offers: <br/>✓💪Wood Block Puzzle - Free Classic Block Puzzle Game which also named Qblock is a classic simple game but is full of challenges. Qblock has its own logic skills and placement strategies, whether it is the very first or later move, each step determines whether you can get high scores. <br/>✓💪Share Wood Block Puzzle - Free Classic Block Puzzle Game (Qblock) with your friends, spend leisure time together and get close to each other!", "metacritic": null, "released": null, "tba": false, "updated": "2020-10-23T02:31:06", "background_image": "https://media.rawg.io/media/screenshots/144/14431831d5b9a5a5b40a64078ba01034.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 64, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Beetles Games Studio"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": "Everyone"}