{"id": 508563, "slug": "sherlock-hidden-match-3-cases", "name": "Sherlock: Hidden Match-3 Cases", "name_original": "Sherlock: Hidden Match-3 Cases", "description": "Join the legendary detective Sherlock Holmes in his unbelievable new investigations!<br/><br/>Something wicked is going on in the worlds of well-known books – their plots are changing, with the main characters being defeated while the villains prevail. The magic of literature is at work here, and this magic is real! Now, The Hound of the Baskervilles, Alice in Wonderland, The Wizard of Oz, and many other classic novels are not at all like you remember them.<br/>Help Sherlock Holmes and Dr. Watson restore the original plots of the books and deliver justice by solving tricky match-3 puzzles or unraveling hidden object scenes, and complete thrilling quests while searching for the reasons and patterns behind the events. These world-renowned stories helped to shape the history of mankind, so they carry enormous power – and whoever can control that power, will be able to rule the universe. Make sure it falls in the right hands!<br/>Set off on an exciting detective adventure, solve ingenious puzzles and investigate crimes without delay before the real world turns upside down too!<br/><br/>While this game is absolutely free to play, you have the ability to unlock optional bonuses via in-app purchases from within the game. You may disable in-app purchases in your device settings.<br/><br/>To find clues and get closer to figuring out challenging cases, pay close attention and choose your favorite gameplay mode for any scene:<br/><br/>● FIND hidden objects and use them, or<br/>● MATCH gems in a row<br/>Plus:<br/>● COMPLETE absorbing quests<br/>● EXPLORE colorful locations from well-known books<br/>● MEET familiar characters<br/>● SOLVE perplexing puzzles<br/>● FOLLOW the gripping storyline<br/>● ENJOY regular free updates with new books and fascinating cases!<br/>● iPhone XR Display support<br/>● iPad Pro Display Support<br/>____________________________<br/><br/>Game available in: English, French, Italian, German, Spanish, Russian, Korean, Simplified Chinese, Japanese<br/>____________________________<br/><br/>Sign up now for a weekly round-up of the best from G5 Games! www.g5e.com/e-mail<br/>____________________________<br/><br/>G5 Games - World of Adventures™!<br/>Collect them all! Search for \"g5\" in iTunes!<br/>____________________________<br/><br/>Visit us: www.g5e.com<br/>Watch us: www.youtube.com/g5enter<br/>Find us: www.facebook.com/g5games<br/>Follow us: www.twitter.com/g5games<br/>G5 End User License Supplemental Terms: http://www.g5e.com/G5_End_User_License_Supplemental_Terms", "metacritic": null, "released": "2020-10-20", "tba": false, "updated": "2020-10-23T02:23:30", "background_image": "https://media.rawg.io/media/screenshots/9d6/9d6702cdc25c8ffe122ab5531a7ec30d_KLnTS7M.jpg", "website": "http://www.g5e.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 338, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["G5 Entertainment"], "genres": ["Adventure", "Puzzle"], "publishers": ["G5 Entertainment"], "esrb_rating": "Everyone 10+"}