{"id": 50854, "slug": "delicious-moms-vs-dads", "name": "Delicious - Moms vs Dads", "name_original": "Delicious - Moms vs Dads", "description": "<strong>The moms are testing the dads’ mettle in this fun take on an age-old debate! Who will end up victorious?</strong>  ♂️ ♀️<br/><br/>We’ve all been there, whether as parents or kids – why aren’t chores split evenly in the family? Why does one person always seem to do almost everything (❗) and, most importantly, what can you do about it? Emily and Patrick face (and answer!) this question in Emily’s newest story, Moms vs Dads!  ♂️ ♀️<br/><br/>🏆 <strong>Manage both dads and moms</strong> in this fun time management story game!<br/>🏆 <strong>Play your way</strong> through 60 story levels plus 30 challenge levels<br/>🏆 <strong>Get to know</strong> the differences between the four couples! Who will you be rooting for?<br/>🏆 <strong>Enjoy six fun locations</strong> including favorites like Camp Talon and Emily’s house<br/>🏆 <strong>Earn diamonds</strong> and build your own kids paradise in Emily’s back yard<br/>🏆 <strong>Beat daily challenges</strong> to earn extra diamonds<br/>🏆 <strong>Collect all the postcards</strong> and send heartfelt greetings to all your loved ones<br/>🏆 <strong>Help Emily and Patrick</strong> discover what is truly important in life<br/><br/>Emily is thrilled with her family, but with three kids, it seems there is 10 times the work! Balancing work in the diner, her cooking vlog, chores plus the family is getting harder and harder. When she notices Patrick acting like occasionally playing with the kids is doing his fair share, she’s had enough! 👶🏻 👶🏽<br/><br/>Her girlfriends all have similar experiences - men who don’t help out in the house unless asked, men who only “babysit” their own kids…. and they’ve had enough! It’s time to ACT, to show them how much work it really is. Can the girls get their men dashing around the house, or will this end up being a recipe for disaster?", "metacritic": null, "released": "2017-12-12", "tba": false, "updated": "2019-08-28T22:03:17", "background_image": "https://media.rawg.io/media/screenshots/d97/d972482e8847ebba569e43e1d04fc379.jpg", "website": "http://deliciousemily.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 6, "beaten": 1}, "playtime": 5, "achievements_count": 16, "ratings_count": 0, "suggestions_count": 238, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "PC", "macOS", "iOS"], "developers": ["GameHouse"], "genres": ["Adventure", "Simulation", "Casual", "Family", "Indie"], "publishers": ["Gamehouse", "RealNetworks"], "esrb_rating": "Everyone 10+"}