{"id": 508538, "slug": "the-crew-demo", "name": "The Crew Demo", "name_original": "The Crew Demo", "description": "To play this game on PS5, your system may need to be updated to the latest system software. Although this game is playable on PS5, some features available on PS4 may be absent. See PlayStation.com/bc for more details.<br/>With exploration, customization, and a wide, connected experience, The Crew redefines what you know about driving games and takes you on a relentless ride all throughout the USA. Seamlessly jump in and out of a massive network of drivers, and build your crew of friends to take on heart-stopping missions throughout metropolitans and landmarks across America. Customization is the key to success, though, and an extensive tuning system will prepare your ride for any terrain that lies ahead of you.<br/><br/><br/>Drive fast, drive everywhere, but…<br/><br/><br/>NEVER DRIVE ALONE<br/><br/><br/>DRIVING SOCIAL<br/>Jump in and out seamlessly and build your crew of four through bonding or intense rivalry.<br/><br/><br/>A PLAYGROUND OF UNPRECEDENTED SCOPE AND VARIETY<br/>The entire United States is your driving playground – all the roads coast-to-coast and everything in between.<br/><br/><br/>PREPARE FOR THE NEXT JOB<br/>An extensive tuning system combining depth and simplicity allows you customize your licensed cars according to your style and driving preferences.<br/><br/><br/><br/><br/>Additional hardware required for Remote Play.<br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/>Use of PSN and SEN account are subject to the Terms of Service and User Agreement and applicable privacy policy (see terms at sonyentertainmentnetwork.com/terms-of-service &amp; sonyentertainmentnetwork.com/privacy-policy). *Online multiplayer also requires a PlayStation®Plus subscription.<br/><br/><br/><br/>Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy). <br/><br/>Software subject to license (us.playstation.com/softwarelicense). <br/><br/>One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.<br/>", "metacritic": null, "released": "2015-06-10", "tba": false, "updated": "2020-10-23T02:11:24", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PlayStation 4"], "developers": [], "genres": [], "publishers": [], "esrb_rating": null}