{"id": 508555, "slug": "clash-of-legions-rise-war", "name": "Clash of Legions - Rise & War", "name_original": "Clash of Legions - Rise & War", "description": "Clash of Legions is a one-of-a-kind mobile game that mixes hardcore RTS and collectible card game mechanics, all in a fantasy setting.<br/><br/>Pre-plan your war strategy, recruit an unstoppable army backed up by a solid spellbook, and pick one of the many stunning locations to show everyone that you’re a force to be reckoned with. Build your base, mine resources, or dive straight into the battle! A strong support system always makes things easier so be sure to share your highs and lows with your friends.<br/><br/>Intense duels, thrilling team battles, ranked matches, and dozens of unique modes will keep you infinitely entertained. Chat with friends, create your own clan, unlock achievements, and become a celebrity streamer. Loyal allies and sworn enemies, untold riches and everlasting glory, the bitterness of defeat and the joys of victory are all but a touch away. <br/><br/>Become a Clash of Legions legend and let the fantasy war begin!<br/><br/>Special features:<br/><br/><br/>• Do you have fond memories of playing classical RTS games as a child? Well then, you're sure to love Clash of Legions, the all new mobile strategy game! Hire units, collect resources, and build a base. Command your troops on the battlefield, wield their abilities, and masterfully dodge enemy spells. Make your skills a game changer! Become a living legend in your clan!<br/><br/>• Complete freedom in choosing the way you fight. Dozens of units, buildings, and spells for every taste. Feel like picking the Knights of Light and a Tesla Tower? Perhaps you’d prefer Vampire bats and hellhounds? Or maybe a few ballistas to bathe your opponents in fire? The choice is yours!<br/><br/><br/>• 9 game modes await you. Let your war strategy go wild! Intense 1v1 fights, powerful team battles, exciting ranking matches on a terrific battlefield, and various unique modes — double HP, endless mana, instant construction, and catapult duels to name just a few. Nothing is impossible in the fantasy Clash of Legions world!<br/><br/>• Having quality downtime is as important as putting in work. Not in the mood to swing the ol’ battle axe? Put your mind at ease with various minigames, collectibles and achievements.<br/><br/>• Easy to master, hard to put down. New to rts games? We’ve got you! An elaborate tutorial will teach you the basics and point you in the right direction. Build up your confidence by playing against NPCs and begin your epic journey to the fame of a strategy games master. If you feel lost at any point, a detailed glossary is available to help refresh your memory.<br/><br/>• Play wherever you want, however you want. The controls have been designed specifically for mobile devices to make your journey as smooth as possible.Start a battle wherever you are knowing that  each match lasts no more than five minutes.<br/><br/>• Wide social opportunities. Add friends, talk using the in-game voice chat, or stick to traditional text chat. Send stickers, show off new emotions, or create your own clan. The more the merrier!<br/><br/>• Let’s talk about eSports. Are you confident in your abilities or have you already conquered the platinum league? Then take the leaderboards by storm, win in the war championships and tournaments, and secure your place in the Hall of Fame.<br/><br/>• Stream and record matches. Do you dream of being a popular streamer? Start playing Clash of Legions and millions of players around the world will be able to watch you in real time. Study the replays of your own games, watch your friends battle or peek at the real pros. There’s no need to be shy!<br/><br/>• Still having doubts? At the end of the day, nothing is better than a hands-on experience. Good luck and welcome to the best fantasy mobile game of all time — Clash of Legions. Your own legend awaits!", "metacritic": null, "released": "2020-10-08", "tba": false, "updated": "2020-10-23T02:20:32", "background_image": "https://media.rawg.io/media/screenshots/c35/c357eed61de7fe1c2a1769cf51f90492_j4c7hwV.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 357, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["CreaGames"], "genres": ["RPG", "Strategy"], "publishers": ["CLASSWIRE"], "esrb_rating": "Teen"}