{"id": 508720, "slug": "double-pug-switch-itch", "name": "Double Pug Switch (itch)", "name_original": "Double Pug Switch (itch)", "description": "<em>Double Pug Switch is a challenging, but easy to learn single-player 2D precision-platformer. Take control of a dimension swapping Pug!</em>\n<p>Become a dimension-swapping, platform-hopping master and test your puppy platforming abilities. Double Pug Switch is a call back to pure, refined gaming where skill meets imagination.</p>\n\n<p>Take control of the Pug Otis, the loyal companion of the Professor! After an accident in the Professor’s lab involving the mischievous cat Whiskers and some Portal Fluids, Otis and Whiskers are sucked into an alternate dimension.</p>\n<p>Hop, dimension swap and navigate your way through four unique dimensions to chase down Whiskers and save him from his evil wrongdoings.</p>\n<ul><li>Dimension-Swapping Action Pug Platforming!</li><li>32 levels spread across 4 alternate dimensions</li><li>40 unique hats to unlock - Cowboy hat, welders mask, even a brain slug!</li><li>Become a pugillionaire by collecting gold coins to spend in the hat shop</li><li>Find the special purple coins hidden in each level to buy the rarest hats</li><li>Powerups to shrink, launch, bounce and accelerate the Pug through the level</li><li>Earn a purrfect score by running a level without failing once!</li><li>Includes challenging bonus dimension <em>Whiskers of Wrath</em> for the ultimate test of skill</li></ul>", "metacritic": null, "released": "2020-10-19", "tba": false, "updated": "2020-10-23T03:06:46", "background_image": "https://media.rawg.io/media/screenshots/e7f/e7f1f1fb95b0bf3a4d695ae14fcddcfe.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 162, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["The Polygon Loft"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}