{"id": 50886, "slug": "tormental", "name": "Tormental", "name_original": "Tormental", "description": "Tormental is a rogue-like shooter where you battle your way through rooms flooding with monsters conceived by no other than Mental, the demi-god of destruction.<br/><br/>Deep into an abandoned temple of Egypt lies a cursed artifact, an ancient device capable of the unthinkable; Could this be the key to enter the mind of the demi-god of destruction: Mental?<br/><br/>This may be your only chance to delve deep into the twisted world of its mind, where [Sam]'s quest will lead him against reckless hordes of monsters product of Mental's wicked imagination. Blast your way through the most hideous corners of its mind, and prepare for a brain-melting showdown!<br/><br/><ul><li> Fight against the wicked imagination inside the mind of Mental, destructive demi-god and Serious Sam's arch enemy, in an attempt to stop him once and for all.<br/></li><li> Battle your way through rooms flooding with freaks and monsters.<br/></li><li> Sam is not the only one aiming for glory, play one of the many characters that dare to go through the depths of Mental's mind. <br/></li><li> Colourful worlds full of traps and surprises.<br/></li><li> Play together in Co-op mode.</li></ul><br/>Key Points:<br/><br/><ul><li> Roguelike shmup<br/></li><li> Local co-op multiplayer<br/></li><li> 3D graphics, 2D precision and visibility<br/></li><li> Dungeon evolution: the game starts simple, player learns the basic, over time while playing more content is unlocked and the game becomes more complex ( new enemies, bosses, dungeon modifiers, weapons, upgrades, characters, etc. )</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:03:17", "background_image": "https://media.rawg.io/media/screenshots/c25/c25a083de14ddbaae6186c24ae5d2675.jpg", "website": "http://www.tormentalgame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 100, "playing": 1}, "playtime": 1, "achievements_count": 23, "ratings_count": 1, "suggestions_count": 128, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Croteam Incubator", "GunGrounds"], "genres": ["Action", "Indie"], "publishers": ["Croteam", "Croteam Publishing"], "esrb_rating": null}