{"id": 508826, "slug": "sabba", "name": "SABBA", "name_original": "SABBA", "description": "<p>Sabba (Space Association of Banking and Bureaucracy Advancement) is a digital board game where you need to negotiate with your other players on where to go next with imperfect information based on the role of the player.</p>\n<p>Everyone has their own agenda of things they need to get done, ranging from, Picking up your Space Kids, to, Accepting a Nobel Peace Price.</p>\n<p>The player who has completed the most amount of personal goals when the fuel runs out is the winner.</p>\n<p>The game is meant to be played in Multiplayer where a server is running on a shared display as a TV and everyone has their client running on a phone or other device.</p>\n<p>(However it is possible to play the game alone for demo purposes)</p>\n<p>The game starts by the shared ship going to a planet, when it lands, an event occurs.</p>\n<p>All players get to anonymously vote for what the crew should do and an outcome is determined, often some sort of punishment or reward (or a combination of both)</p>\n<p>Some events have effects later in the game so choose wisely.</p>\n\n<p>Roles in the game:</p>\n<ul><li>Engineer: Knows information about the ship. Most importantly, how much fuel there is left.</li><li>Merchant: Knows all the prices of all planets at any time in the galaxy.</li><li>Navigator: Knows the different risk levels of the planets (not implemented :( )</li><li>Civilian: Doesn't know anything but has energon-cubes to spend and the same right to vote as everyone else (Horray for Space Democracy!)</li></ul>\n\n<p>By: Felix Hellman, Jerker Röjder, Hannes Häggander </p>", "metacritic": null, "released": "2020-10-22", "tba": false, "updated": "2020-10-23T03:28:31", "background_image": "https://media.rawg.io/media/screenshots/487/487d0f58897daf42208abc081ed77e22.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 66, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux", "Android"], "developers": ["hell", "azdaarf"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}