{"id": 508947, "slug": "my-hero-halloween", "name": "My Hero Halloween", "name_original": "My Hero Halloween", "description": "MY HERO ACADEMIA - HALLOWEEN SPECIAL - OTOME GAME\r\n<p>• Changeable name<br/>• Implied gender is she/her (due to dorm placement assumptions)<br/>• 4 Romances: Deku, Bakugou, Todoroki, Uraraka<br/>• Warnings: Mild swearing, minor BNHA spoilers up to season 4</p>\n<p><strong>Story:</strong></p>\n<em>Something strange has been going on in the dorm, Heights Alliance, where all of Class 1-A lives. It's up to you to figure out what's happening, on top of training, and preparing for the upcoming Halloween costume contest! You may even grow closer to a certain classmate in the process.</em>\n<p>This is my first game but I hope to keep learning as well as make more in the future!<br/>You can contact me at my Tumblr, Twitter, or TikTok.</p>\n<p>CREDITS: To the best of my ability, I have tried to correctly credit everything I used in the game. Please check the game \"About\" section to see them. </p>\n<p>This is a FREE game made for fun, to show my love and appreciation for the BNHA universe. </p>\n<p>All characters and original concepts belong to Boku no Hero Academia (c) Kohei Horikoshi!<br/></p>\n<p>If you'd like to tip me, you can do so here (but is not necessary at all)! </p>\n<p>~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~</p>\r\nGame Access\r\n<ol><li>You can play the game online at this <strong>link.</strong> It is not as fluid, especially in regards to music/sound effects but it does work pretty well otherwise.</li><li>You can download the zip files. Read the \"Install Instructions\" below.</li><li>It is meant to be played on a computer. Sorry, no mobile version.</li></ol>\r\nInstall Instructions\r\n<ul><li><strong>PC</strong><ul><li>Download the zipped file and unzip it</li><li>You should have a folder titled \"My Hero Halloween 1.0 Dists\"</li><li>Open the game, which is the .exe file and should have the game title</li><li>Enjoy!</li></ul></li><li><strong>Mac/Linux</strong><ul><li>Double click on the zipped folder to unzip it</li><li>You should have a folder titled \"My Hero Halloween.app\"</li><li>The game title is \"My Hero Halloween\" which you should find within the Contents &gt; MacOS folder</li><li>Enjoy!</li></ul></li></ul>\n<p>Please don't hesitate to contact me if you have any issues and I will try to help :) </p>", "metacritic": null, "released": "2020-10-22", "tba": false, "updated": "2020-10-23T03:58:34", "background_image": "https://media.rawg.io/media/screenshots/c72/c72805c210f65d57beddb895e12b0c15.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 164, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["zerostumbleine33"], "genres": [], "publishers": [], "esrb_rating": null}