{"id": 508961, "slug": "a-fold-apart-itch", "name": "A Fold Apart (itch)", "name_original": "A Fold Apart (itch)", "description": "<p><strong>Lightning Rod Games presents <em>A Fold Apart</em>:</strong> an award-winning puzzle game that explores the emotional rollercoaster of a long-distance relationship — in a world of folding paper!</p>\n<p>After career choices force them along separate paths, a Teacher and Architect vow to make their long-distance relationship work at any cost. Experience both sides of their story as the couple navigates the complexities of (mis)communication and the emotional ups and downs that separation brings. By flipping, folding, and unfolding the paper puzzles in their handcrafted worlds, you can help the couple overcome the emotional barriers of their relationship — but will love endure...?<br/></p>\n\n<ul><li>A relatable, true-to-life story of a long-distance relationship.</li><li>Over fifty handcrafted paper folding puzzles.</li><li>Beautiful 3D graphics with a tactile, “homemade” paper aesthetic.</li><li>The ability to choose the couple that best represents you!</li></ul>\n\n\n<p>“A Fold Apart is a truly special puzzle game that will leave players thinking about it for days after they finish.”</p><p>4.5/5 Stars – ScreenRant</p>\n<p>“There is perhaps no game that better captures the intricacies of being in a relationship than A Fold Apart.”</p><p>9/10 – Game Skinny</p>\n<p>“A Fold Apart isn’t just a series of puzzles with a story about long distance relationships, but a game about communication.”</p><p>Recommended – The Verge<br/></p>\n<p>“In a time where many of us know how it feels to be separated from our loved ones, A Fold Apart provides a wonderful catharsis that celebrates the highs and lows experienced in every relationship.”</p><p>– The Escapist<br/></p>", "metacritic": null, "released": "2020-10-21", "tba": false, "updated": "2020-10-23T04:02:24", "background_image": "https://media.rawg.io/media/screenshots/c15/c1569b71b2ea7637cb11da752522aa5f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 162, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Lightning Rod Games"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}