{"id": 508952, "slug": "revpass", "name": "revPass", "name_original": "revPass", "description": "<p><strong>What is revPass?</strong> </p>\n<p>revPass is a collection of every premium game I make in 2021 (and some other things that are secret for now). By selling directly, I have the freedom to make what I want and deliver it to you immediately. If a book, song or video can be shared without a gatekeeper, why should apps and games be any different? All the games included in revPass will be made for Android, but I am also looking into porting the games to other platforms after 2021.</p>\n<p><strong>Is revPass a subscription service?</strong><br/></p>\n<p>No. Once you pay for revPass, <strong>you own everything in the collection</strong>. As more content is added throughout 2021, the price may increase, but what you get will not change if you bought it today or a year from now.</p>\n<p><strong>What do I get in 2020?</strong><br/></p>\n<p>Space Bunny: Special Edition, Counterfeit Memory: The Movie (October 27th), and Counterfeit Memory: The Game (November 3rd), plus some bonus content to be announced. Buying revPass in 2020 means you'll save nearly <strong>40% </strong>before I release my first game for the collection. When that game releases in January, revPass will increase to $21 USD. The price may increase throughout 2021 depending on the number of people who buy it, but it will only occur when new content is added.</p>\n<p><strong>Why isn't revPass available on iPhone?</strong><br/></p>\n<p>Apple does not allow its users on iOS to download games without being approved by them. In addition to this restriction, Apple takes 30% of the revenue from developers and charges a $100 yearly subscription for the \"privilege\" of being the only viable option for iOS apps. Apple claims that security is the reason for not allowing apps to exist outside of the App Store, but it already has a solution on macOS with the notarization process. This is an automated system that checks an app to see if it's safe and secure. If this can exist on Mac, then there is no reason it shouldn't on iPhone. And although the process is automated, Apple still charges $100 a year for it. If Apple were to remove the $100 yearly fee, I would consider making these games available on iOS after 2021.</p>", "metacritic": null, "released": "2020-10-22", "tba": false, "updated": "2020-10-23T03:59:57", "background_image": "https://media.rawg.io/media/screenshots/133/133d2fad6a1c554f5f342b313530df49.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 16, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["RevTheGame"], "genres": [], "publishers": [], "esrb_rating": null}