{"id": 509025, "slug": "binary-system-simulator", "name": "Binary System Simulator", "name_original": "Binary System Simulator", "description": "<p>The Binary System Simulator does exactly what its title says.  It simulates two stars in orbit around each other.  The orbits are assumed to be circular for simplicity, as this tool is intended for an introductory course in Astronomy rather than an Astrophysics course in which one would consider elliptical orbits and views other than top-down or edge-on.  This tool also simulates the radial velocity curve for the two stars of the system assuming a direct edge-on view.</p>\n<p>Users may edit the masses of the two stars and the separation between the two stars.  These values are shown in green.  Calculated values, shown in amber, include the orbital period and the speeds of the two stars.  By using the period, <em>P</em>, and the two velocities, one can calculate the average separation, <em>a</em>,</p>\n<p>a = 2π * P * (vA + vB).</p>\n<p>The ratio of the masses can be found using the ratio of the two velocities,</p>\n<p>MA / MB = vB / vA.</p>\n<p>The total mass of the system can be calculated using Kepler's Third Law.  Here, we assume the period, <em>P</em>, is measured in years and the average separation, <em>a</em>, is in AU yielding mass measured in solar mass units, <em>M</em>☉,</p>\n<p>MA + MB = a3 / P2.</p>\n<p>The individual masses can be determined by solving the ratio equation and the total mass equations simultaneously.  I will have a video tutorial demonstrating all of this posted soon.</p>", "metacritic": null, "released": "2020-10-21", "tba": false, "updated": "2020-10-23T04:16:08", "background_image": "https://media.rawg.io/media/screenshots/e13/e130b0adc2e0c3261d85733465335e5e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 14, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Web"], "developers": ["J. Douglas Patterson"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}