{"id": 50917, "slug": "drunkenpants", "name": "Drunkenpants", "name_original": "Drunkenpants", "description": "<strong>Drunkenpants</strong> is a game where ordinary heroes who got drunk in their underpants at home (Kalsarikänni) try to solve mundane problems with excessive violence. The game is an action based, fast-paced multiplayer battle game, where you compete in different game modes and try to beat your opponents. <br/><br/>Your character can move, dodge roll, melee attack, use all kinds of different improvised special weapons, drink alcohol and launch an ultimate attack when drunk enough.Revolutionary Game Modes such as:<strong>Master of the Tv-Remote</strong><br/>Fight for who is the master of the TV remote, inside a suburb flat with your freaky friends. The one who gets to change the channel 10 times first, will win the round.<br/><strong>Meatpie Mayhem</strong><br/>Collect enough coins next to a barbeque restaurant and order a meal before the other players to win the round. Price is saturated based on how many players are fighting to order.Improvised Special Weapons such as:<strong>Nailgun</strong><br/>A little bit tweaked version of a proper construction tool, this one shoots massive nails with massive velocity. <br/><strong>Disemboweler 9000</strong><br/>A very handy circular handsaw that gives you speed boosts and wrecks everything in your way.<br/><strong>Potato Cannon</strong><br/>The longer you charge it, the bigger the potato. Penetrates everything and destroys everything in its way.Playable characters:<strong>Recruit Ritva</strong><br/>An ordinary female soldier, that likes to use a foldable shovel in battle. Likes to wear a winter hat indoors to warm up her cool head.<br/><strong>Pekka the shaman</strong><br/>Got rabies from his pet fox, that has given him extraordinary superpowers to use in combat. The pet fox fell in battle, but its memory lives on Pekka's head as a nice hat for now. <br/><strong>Lalli the farmer</strong><br/>The ordinary farmer in a very interesting overalls that combats anything in his way with his mighty axe. <br/><strong>Christmas Goat</strong><br/>The real Santa, who doesn't bring any presents, just uses his bag filled with bricks to cause havoc to fellow people. Likes to cross-dress under his festive garments.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-23T11:27:00", "background_image": "https://media.rawg.io/media/screenshots/dca/dca8f435d11d765d352a116632b1c8f4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 103}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 131, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Firetail Games"], "genres": ["Action", "Indie"], "publishers": ["Firetail Games"], "esrb_rating": "Adults Only"}