{"id": 509391, "slug": "running-rogue", "name": "Running Rogue", "name_original": "Running Rogue", "description": "<p>Our hero is a thief who flirted with death and stole one of her most powerful artifacts - time gloves. Failing to cope with their power, the thief finds himself in a dungeon of souls. Determined, he climbs the tower to give battle to death and recover his humanity!<br/></p>\n<p><strong>Freedom of Movement</strong></p>\n<p>At each level, you decide for yourself how you act. You'll run away beating up enemies or find detours and take advantage of your surroundings. Scramble on ledges, run through walls, slide on the floor and jump!</p>\n<p><strong>Dynamic Battles</strong></p>\n<p>You move fast, and your attacks and block are instant. A variety of enemies will check your reaction and will not let you stand still.</p>\n<p><strong>Time - Life!</strong></p>\n<p>The faster you pass the level and deal with the enemies the more health you can make up for.</p>\n<p><strong>Plenty of Abilities and Improvements</strong></p>\n<p>Pass through levels, defeat bosses to get the chance to choose from a variety of random improvements. Choose what you need now. Restore health, increase attack strength or improve your parkour skills. After another death, discover new upgrades and abilities that will make you stronger each time and bring you closer to the top of the tower and to defeating death!</p>\n<p><strong>Random Levels</strong></p>\n<p>The levels are generated randomly. Each passing will differ from the previous one. You will never know what enemies, obstacles and traps will be waiting for you in the next room.</p>\n<p><strong>Three Parts of the Tower</strong></p>\n<p>The tower is divided into three parts: Dungeon, Limb and Gardens.<br/>Each part of the tower differs in its visual style, obstacles, set of enemies and bosses.</p>\n<p><strong>Only the most resourceful and skillful will deceive death!</strong><br/></p><p><strong>Add to your wishlist on Steam!</strong></p>", "metacritic": null, "released": "2020-10-20", "tba": false, "updated": "2020-10-23T05:39:34", "background_image": "https://media.rawg.io/media/screenshots/033/033edd6784cf0a9845e0bff580d981ae.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 190, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["vsmobgames"], "genres": ["Action"], "publishers": [], "esrb_rating": null}