{"id": 50938, "slug": "wizzball", "name": "WizzBall", "name_original": "WizzBall", "description": "Wizard Ball is a Virtual Reality team sports game for the Rift Touch and Vive where players fly on broomsticks and pass a ball between them to score goals while dodging spells. Players can use wands to stun each other at close and long range. The team with the most goals scored by the end of the round wins!A game made for VR!<br/>Similar games based on a popular book series about a Wizarding school have been made in the past, but only VR can really do this style of game justice! Feel the sensation of flying a broomstick, make catches and preform accurate physics based throws! A softball pitcher would make an amazing scorer - don't forget to wear your wrist straps!Multiple server modes for customization<br/>Setting up a server allows you to set many variables, such as whether teams are randomly selected each round or people can select their teams, maximum players, minimum players needed before a match will start as well as set a speed multiplier if you want a faster paced game!Beta Release<br/>While the mechanics of the game are done we are considering this game to be in Beta right now as there are some additional features we want to add, as well as we would like to get player feedback as to the optimal number of players for a match and what speed of flight provides the most balanced game. One of the main planned new features is a single player tower defense style game mode for practicing your skills.", "metacritic": null, "released": "2017-12-15", "tba": false, "updated": "2019-08-23T12:12:06", "background_image": "https://media.rawg.io/media/screenshots/dcc/dccb2202dcb52d12ba70987c9b0e05d9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 10}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 345, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["NRVR Labs"], "genres": ["Action", "Sports"], "publishers": ["NRVR Labs"], "esrb_rating": null}