{"id": 509446, "slug": "one-day-every-day", "name": "One Day, Every Day", "name_original": "One Day, Every Day", "description": "<p>One Day, Every Day is about part of my  high school senior year experience. Specifically, an experience that is filled with anxiety and self-doubts during the college application process. When looking back, that experience feels like nothing. But during the time, it felt almost unsurpassable. So I decided to make a short game about it to look back on that experience. It still doesn't perfectly  embodies the complicated emotions I was feeling, but hopefully it will give you a glimpse. </p>\n<p>My initial idea was to make a 2D top down exploration game with three  main scenes and some small scenes. The three main ones are the living room, the hall way in school, and the bedroom. I was planning on making some mini games in the hallway section. But when I was prototyping, I realized the scale I planned was too big for a two weeks project. After discussing with classmates and receiving feedbacks, I decided to cut down the minigames part and focus more on three main sections.  Since the main mechanic of the game is exploration and interactions, I want to polish the atmosphere so that even without complicated mechanics, players can sense the emotions of helplessness and anxiety.  I changed the art style, the ambient music, and added the disordered dialogue keys to help building up this atmosphere I want to create.\r\n</p>\n<p>One challenge I have encountered was pressing space to move through the dialogues. Initially, I wanted to use the space key, but I struggled for so long with it because every time I pressed the key, it will automatically jump to the last dialogue. To avoid this problem, I changed to using the 1, 2, 3, 4 keys for moving through the dialogue. It will appear somewhat anti-intuition at first. But in the second scene, the hallway, I purposefully changed order of the numbers to create a feeling of not knowing what to say when encountering other people. The orderly arranged numbers in the first and third scenes are in contrast with the disorder numbers in the second scene, which create a even more chaotic emotions in school. After I consulted with the professor, I found the solution for using the space key. Sadly, I didn't have the time to completely redo the dialogue system. But on the bright side, I now learned the solution, and I do like the number contrast I have used, which I believe suits this game.</p>", "metacritic": null, "released": "2020-10-20", "tba": false, "updated": "2020-10-23T05:52:37", "background_image": "https://media.rawg.io/media/screenshots/069/0696e9835d097c36104ac865d096b3d5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 14, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["BoxedVodka-bot"], "genres": [], "publishers": [], "esrb_rating": null}