{"id": 509481, "slug": "adventure-counterpart", "name": "Adventure Counterpart", "name_original": "Adventure Counterpart", "description": "<p><strong>ENGLISH</strong><br/></p>\n<p><em><strong>Important message about donations</strong> : if you want to donate, you should first try to install the game on your computer without donating anything to make sure it functions properly.</em><br/></p>\n<p>The browser version of Adventure Counterpart seems to have sound problems after restarting a new game. To fix this, just refresh the page.<br/></p>\n<p><strong>Adventure Counterpart</strong><br/></p>\n<p>The goal is to collect every diamond in this maze filled with enemies. The maze layout is different every time you play. There are several different helpful items that can be found at random spots.<br/></p>\n<p>You play as the First Adventurer, who is able to make knives spin around him to form a shield that can damage monsters. The more knives he finds, the stronger he is. Unfortunately, it doesn't mean that he's invulnerable. Stronger enemies can still pass through the shield, and knives will fly away after dealing a certain amount of damage.</p>\n<p>-------------<br/><br/></p>\n<p><strong>FRANÇAIS<br/></strong></p>\n<p><em><strong>Message important à propos des dons : </strong>si vous voulez faire un don, essayez d'abord d'installer le jeu sur votre ordinateur sans faire de don pour être sûr qu'il fonctionne correctement.</em></p>\n<p>La version navigateur d'Adventure Counterpart semble avoir des problèmes au niveau du son quand vous recommencez une nouvelle partie. Pour les régler, réactualisez la page.</p>\n<p><strong>Adventure Counterpart<br/></strong></p>\n<p><em>flèches du clavier -&gt; se déplacer<br/></em></p>\n<p><em>touche 'esc' -&gt; fermer le jeu (version téléchargeable uniquement)<br/></em></p>\n<p><em>touche 'M' -&gt; couper le son / remettre le son<br/></em></p>\n<p><em>touche 'P' -&gt; pause<br/></em></p>\n<p>Le but est de ramasser tous les diamants dans ce labyrinthe rempli d'ennemis. Le labyrinthe est différent à chaque nouvelle partie. Divers objets utiles peuvent être trouvés à des endroits aléatoires.</p>\n<p>Vous incarnez le Premier Aventurier, qui est capable de faire tourner des couteaux autour de lui pour former un bouclier qui inflige des dégâts aux monstres. Plus il trouve de couteaux, plus il est puissant. Cela ne veut pas pour autant dire qu'il en devient invulnérable. Les ennemis les plus forts parviendront malgré tout à traverser le bouclier, et des couteaux se détacheront parfois de la formation pendant les combats.<br/></p>", "metacritic": null, "released": "2020-10-20", "tba": false, "updated": "2020-10-23T06:01:53", "background_image": "https://media.rawg.io/media/screenshots/e9d/e9de2df6be51e74cb7fc99c9ef9cf4e9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 64, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["MariusBLGQ"], "genres": ["Action"], "publishers": [], "esrb_rating": null}