{"id": 509548, "slug": "cheatday", "name": "CheatDay", "name_original": "CheatDay", "description": "<p>This game was made for the LudumDare 42 GameJam (theme: Running out of space) in 72 hours. It was our first LudumDare and we had a lot of fun. In the beginning we had planned the game a little bit differently, but the time has made us a line through the bill.</p>\n<p>We actually wanted the bodybuilder to get thicker and thicker the more in his stomach is but have not managed that anymore.</p>\n<p>Description</p>\n<p>Even bodybuilders here and there do a so-called cheatday, where they eat all the treats that they otherwise do not.\r\nHelp the poor man to eat as many delicious snacks as he can. But beware, a stomach can eventually be full and must digest and the intestine must be emptied and to top it all you have to dodge your bad conscience skilfully</p>\n<p>Oh and don't step into your own poop of course ;-D</p>\n<p>Controlls</p>\n<p>You have to find food (eggs, fish and muffins) to eat it with <strong>E</strong>. But now it is not done yet, the food is now in your stomach and has to be digested. Press <strong>Q</strong> to look into your stomach and move the small hydrochloric acid molecule to the food to digest it with the<strong> spacebar</strong>. It has to be hit several times. Now you have excrement in your intestine that wants to get out Press <strong>F</strong> to put a small heap.</p>\n<p>but be careful if your stomach or intestines get too full, you lose. And of course nobody wants to run into his excrement and to top it all off, your guilty conscience hovers around you and must not catch you. Good luck!</p>\n<p>Platformer</p>\n<p>Walk with Arrow Keys ore A and D</p>\n<p>Jump with SpaceBar</p>\n<p>Open your stomach to make more room for food with Q</p>\n<p>poop with F</p>\n<p>Stomach</p>\n<p>Move With WASD or Arrow Keys</p>\n<p>Attack arround you with SpaceBar</p>\n<p>Patchnotes</p>\n<p>1.0.1 first release.</p>\n<p>1.0.2</p>\n<ul><li>fixed the anchor of the \"Press Q for Stomach\" image</li><li>Quit button brings you to a blank page in webGL</li><li>corrected some spelling</li></ul>", "metacritic": null, "released": "2020-10-20", "tba": false, "updated": "2020-10-23T06:18:12", "background_image": "https://media.rawg.io/media/screenshots/357/357c46824f0a676a1059bfa3387ab9a4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 10, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["Stames"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}