{"id": 5095, "slug": "route-66", "name": "Route 66", "name_original": "Route 66", "description": "<p>Professional bike racer, &quot;Mad&quot; Madeleine Mayflower is at the top of her game. She has been in the racing circuit for 20 plus years and gained notoriety as one of the best racers in the world. It&#39;s been a long time since she&#39;s had some down time so she&#39;s temporarily stepping out of the lime light so that she can get some much deserved R and R. And what better way to relax than a trip on the open road?<br />\nRoute 66 the great American historical highway starting from Chicago to Illinois, is the perfect place to kick start this adventure. Joining Ms.Mayflower will be the Stockton chapter of a famous biker club, and her grandfather Muddy Mayflower who himself is a legendary racer and taught Madeleine everything she knows.<br />\nDifferent locations bordering Route 66 serve as the backdrop for each level. Navigate through these backdrops to find out the hidden objects. The objects at each location are prevalent and are of importance to the location.<br />\nFeatures<br />\n•   The game has a total of 25 levels/Locations.<br />\n•   The Character learns about the history of each location during the progression.<br />\nKey Controls<br />\nNavigating through the map: Analog stick.<br />\nSelecting the object from the HUD: Right and Left buttons<br />\nPicking up the object: &quot;X&quot; Button.<br />\nNavigating through: Up, Down, Left, Right Buttons.<br />\nEnter: &quot;X&quot; Button.<br />\nUses Memory Stick DUO™ with at least 416KB of free space required to save data</p>", "metacritic": null, "released": "2009-10-06", "tba": false, "updated": "2023-05-02T12:29:16", "background_image": "https://media.rawg.io/media/games/895/895988484f5dda2dbe622ae1ca87f019.jpg", "website": "http://www.bigfishgames.com/download-games/6384/route-66/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 254, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "iOS", "PSP"], "developers": ["Gameshastra"], "genres": ["Puzzle"], "publishers": ["Big Fish Games"], "esrb_rating": "Everyone 10+"}