{"id": 509608, "slug": "dodo-adventures-itch", "name": "Dodo Adventures (itch)", "name_original": "Dodo Adventures (itch)", "description": "Dodo Adventures<p>Your holiday destination this year: Hamari Island. This non-violent VR adventure will give you a much-needed break from the reality. You can choose to explore a tropical island or fill tasks to further the story.</p>\r\nSunshine, ocean breeze, palm trees dropping fruit at my feet – my home of tranquility and beauty.\r\n<p><em>I live on Hamari Island, today I spent my time on sandy dunes, eating figs and dates. Winters are beautiful here and full of life. Summers bring harsh storms, but I take cover in a cave with my flock and the storms pass. So, life was good, but recently there have been shining eyes in the night and noises I’ve never heard before. What are they? Could you become one of us and help me to find out what they are?</em><br/></p>\r\nCharacter profile:\r\n<ul><li>Height: ~3 feet (1 meter)\r\n</li><li>Favorite food: Date, palm fruits\r\n</li><li>Combat skills: Vicious bite</li></ul>\n<p>Dodo Adventures is a VR adventure game that can be played with Valve Index, HTC Vive devices, Oculus Rift and Oculus Rift S headsets. The game is a story-based, single-player and currently under development. You can choose to solve tasks or take a meditative trip to a lost paradise. Forget your To-do list and escape to Dodo Hamari Island!<br/></p>\r\nTravel to the island that once existed\r\n<p>Features:</p>\n<ul><li> Experience a world filled with the calming, soothing sounds of nature\r\n</li><li> Transform to something unexpected\r\n</li><li> Explore the items that once existed\r\n</li><li> Teleport to different locations\r\n</li><li> Travel to the unknown world\r\n</li><li> Realize the story\r\n</li><li> Collect items</li></ul>\n<p><em>The game aims to bring awareness to the impacts of human behavior. </em><br/></p>", "metacritic": null, "released": null, "tba": false, "updated": "2020-10-23T06:31:57", "background_image": "https://media.rawg.io/media/screenshots/ae7/ae7f8651f14b56a348222176a15b4f7c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 359, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["TechLemon"], "genres": ["Adventure", "Educational"], "publishers": [], "esrb_rating": null}