{"id": 509614, "slug": "glorys-fools", "name": "Glory's Fools (itch)", "name_original": "Glory's Fools (itch)", "description": "<p>Long ago, in the dawn of man, before the world could be shaped as it is today, the path to becoming a legend was laid bare for all comers. Monsters freely roamed the land and the Gods gave blessings on a daily basis. Truly, it was a hero’s haven, if you knew where to go. Recently, there have been tales of a new creature roaming the land, Medusa. She is said to have the ability to turn anyone foolish enough to challenge her to stone. Are you foolish enough to test this tale? Or will you let glory slip from your grasp?</p>\r\nFeatures\r\n<ul><li>Featuring a diverse cast of quirky characters with unique dialogue based on how you play the game </li><li>Dozens of spells, armors, and weapons to find and master throughout the game </li><li>Unique enemies with custom battle strategies when encountered </li><li>A compelling narrative based on the Ovid's interpretation of the Medusa myth</li><li>Branching narrative based on your decisions in battle and in the overworld. </li><li>Short gameplay of around 3-6 hours. </li></ul>\r\nCharacters\r\n<ul><li><strong>“The Gloryhound”</strong> - A fool by any other name is still the same .<br/> Born somewhere though they often change where and raised on myth and fantasy, the Gloryhound seeks to find their fortune, not in doing good works, but in doing Glorious Projects. Hostile to criticism, the Gloryhound is a braggart, but good for little else. </li></ul>\n<ul><li><strong>“The Barbarian”</strong> - A true son of the land of Libya. <br/>He claims to be some form of noble, a descendant of an honorable house of Berbers. Or is he a champion from Mali? Or was he a son of Apollo? Either way he's quite the talker and quite the fighter. He can be found in the tavern, imbibing spirits and telling tales of his life.  </li><li><strong>“The Heathen”</strong> - Some type of wicked Magos. <br/>She prays to no gods and serves no master. Truly a <strong>savage.</strong> Her powers come from nature and she is able to commune with the spirits, much better than she can with humans or maybe it's just the Gloryhound. She is rarely found in the city. You'd have better luck finding her in the woods with the other beasts. </li><li><strong>“The Shrew”</strong> - A kindly young woman who for whatever reason chooses to wear a veil.  Maybe she's a leper. Or like so beautiful she'd bewitch Zeus.  Maybe there's a beard under there. No one knows. She's a lady of real mystery for sure. She’s able to do something called “medicine” but it is more likely she is blessed by Hermes. Whatever the case, she’s a life saver. </li><li><strong>Grey</strong> - A kind old hermit who has taken a liking to the Gloryhound.<br/> He’s great at giving wisdom, though it always seems to be someone else's fault if things go wrong. He’s also great at finding problems for you to solve. Like unnaturally talented at finding things for you to do. </li></ul>", "metacritic": null, "released": "2020-10-19", "tba": false, "updated": "2020-10-23T06:33:32", "background_image": "https://media.rawg.io/media/screenshots/d78/d781b25e3ca5c509bb78b393e30a727e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 60, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["AGGroAzteca"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}