{"id": 50962, "slug": "dream-town-story", "name": "Dream Town Story", "name_original": "Dream Town Story", "description": "Tired of tedious town simulators taking up your time? Develop dream dwellings down to the last brick and construct cityscapes crawling as far as the eye can see in this stimulating simulation game!<br/><br/>Compete with other towns in the rankings, or take it easy and go at your own pace.<br/><br/>Build houses to have people move into your town, then add shops and lots of other facilities, making it a vibrant, lovely place to live. Stores like the bike shop or car dealer will sell vehicles to your residents, allowing them to travel further and visit more places.<br/><br/>Acquire more areas as your town grows, discover new facilities to build, help the residents find new jobs, plan the town down to the last detail to make sure it's convenient for everyone... There is just so much to do!<br/><br/>Once you get settled into your town, try co-op mode, which will enable you to team up with other players and build towns together.<br/><br/>If I wasn't busy making more amazing games, I'd be playing Dream Town Story all the time!<br/>   - Kairobot<br/><br/>* All game progress is stored on your device. Save data cannot be restored after deleting or reinstalling the app.<br/><br/>Try searching for \"Kairosoft\" to see all of our games, or visit us at http://kairopark.jp/. Be sure to check out both our free-to-play and our paid games!<br/><br/>Follow kairokun2010 on Twitter for the latest Kairosoft news and information.<br/>https://twitter.com/kairokun2010", "metacritic": null, "released": "2017-12-13", "tba": false, "updated": "2019-07-30T09:59:17", "background_image": "https://media.rawg.io/media/screenshots/7dd/7dd1cb817eee9b42ac9ac2969d86f36e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "toplay": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 141, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Kairosoft"], "genres": ["Simulation", "Arcade", "Casual"], "publishers": ["Kairosoft"], "esrb_rating": "Everyone 10+"}