{"id": 509659, "slug": "chem-words-6-substances-and-solutions", "name": "Chem-Words 6: Substances and Solutions", "name_original": "Chem-Words 6: Substances and Solutions", "description": "<p>     This FREE application allows a student to review and practice the recall of 25 terms and definitions relationg to substances and solution in chemistry. The terms are presented in two screens - one with 12 terms and one with 13 terms. The terms are presented on each screen in a shuffled arrangement. The definition appears at the bottom of the screen and the player must select the correct match.     There is a study screen for each set of terms which the student can review at first and make a list of the terms and definitions for studying. Some of the terms are actually mathematical formulas.<br/></p>\n<p>    After completing the two screens of tile matching, the user is presented with a score report which shows if each level was completed and what the accuracy was. The accuracy is based on the number of correct answers out of the total number of selections made.<br/>    This app works fine with Android versions 5.0 through 10.0. There is also a Windows version available.<br/>This app is offered totally free of charge and does not require a registration. There are no ads and no permissions needed.<br/>The internet is not needed.  This app does not collect any information at all.<br/>It is a free app and is not be sold for profit. Search for \"Richard Carman\" or \"rtcgames\" on sites where you find Android apps. Send questions and comments to rtcarman47@gmail.com<br/>Visit OpenStax.org to download FREE textbooks!<br/>=============== NOTE ======================================<br/>This program is total freeware, meaning that there is no registration, no advertising, no collection of any personal information, and no internet connections.<br/>You may install this program on 1 or a thousand devicess - there is no restriction.<br/>You may pass this program on to you friends, colleagues, and students.<br/>You MAY NOT sell this program for profit.<br/>You MAY NOT modify or reverse engineer this program.<br/>=====   PRIVACY POLICY  =====<br/>by Richard Carman d.b.a. rtcgames - September - 2019<br/>Privacy is considered as one of the fundamental human rights by many countries in the world. I also share this sentiment. Freeware produced by rtcgames does not acquire or ask for any information about the user or the device being used. These apps do not in any way, shape or form access the internet or any other communication system.</p>", "metacritic": null, "released": "2020-10-19", "tba": false, "updated": "2020-10-23T06:43:39", "background_image": "https://media.rawg.io/media/screenshots/e72/e7253e554c94b82f95abd37769aaa08d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 65, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux", "Android"], "developers": ["rtcgames"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}