{"id": 509869, "slug": "safety-in-numbers", "name": "Safety in Numbers", "name_original": "Safety in Numbers", "description": "GAME INCOMPLETE\r\n<p>The game is playable, but incomplete. I got distracted a lot during its development and did not use my time very efficiently; the game still needs about 40 more minutes of work to finish what I was doing with some gameplay programming, the addition of sound and music, bug fixes (I know what I have to do I just didn't have the time to do it), and adding more levels.</p>\n<p>I also made an animation for the monsters I'm really fond of, but didn't have time to program into the game haha... I need to whip up a specific trigger and animation sequence, just like 4 more minutes of work there...</p>\n<p>Also for some reason the HTML build isn't working; I probably just need to </p>\r\nControls\r\n<strong>Move</strong>WASD / Arrow Keys / ZQSD / IJKL<strong>R</strong>Restart Game<strong>Escape</strong>Exit Game (Windows only)<strong>F11</strong>Toggle Fullscreen (Windows only)\r\nHow to Play\r\n<p>Your job is to survive the roaming monsters with what little you have... There is safety in numbers.</p>\n<p>This is a simple stealth game. If you enter one of the monster's cone of vision, it will begin to chase you down until you can evade it. Your health is limited. Don't let the monsters get too close!</p>\n<p>INCOMPLETE: The game is playable; you can move, hide, evade the monsters, trigger the monsters to chase you, but there is currently no win condition. The next update will add a simple win condition involving collecting a certain number of keys.</p>\r\nDevelopment\r\n<p>This game was made in 3.8 hours for the three hour game jam Trijam 91 with the theme: <strong>There Is Safety In Numbers</strong></p>\n<p>I was in Discord chat with my friends throughout the development process and thusly was very distracted. I didn't use my time especially well and was very indecisive, wasting at least 45 minutes on various ideas and bits of content that I decided not to include.</p>\n<p>An update that finishes what I started is forthcoming, including more mechanics, animations, sound, a working HTML version, a crisper icon, and an animated GIF cover image.</p>", "metacritic": null, "released": "2020-10-19", "tba": false, "updated": "2020-10-23T07:32:06", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Gunnar Clovis"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}