{"id": 509920, "slug": "corrupted-nightmare-archive", "name": "Corrupted Nightmare Archive", "name_original": "Corrupted Nightmare Archive", "description": "<p>This game was supposed to be a successor to Demonpact: Clarice, but focusing only on <strong>turn-based RPG battles and Yume Nikki inspired exploration</strong>, while having little to no story or character interactions.</p>\n<p>\n</p>\n<p>This project had aproximately 2~3 months of development before being shut down and cancelled in mid-2020. But I believe it still has a few minutes of entertainment for whoever is curious, and that's why I'm uploading it here.</p><p><strong>WARNING:<br/></strong>- MATURE CONTENT.<br/>- FLASHING LIGHTS.<br/>- VERY LOUD.<br/></p>\n<p>It has:<br/>- A little introduction that explains the story.<br/>- One incomplete questionary that defines the character you start with.<br/>- One incomplete tutorial level.<br/>- A developer room with everything available from the whole game.<br/>- 4 main characters, 5 recruitable characters, and 3 cheat code characters.<br/>- 3 enemies with a few animations.<br/>- Major spoilers from Demonpact: Clarice, despite not being a sequel.</p>\n<p>Corrupted Nightmare (AKA Recluso) was cancelled due to the corona virus pandemic, burnout from the Demonpact: Clarice team, multiple members having poor mental health followed by very long hiatuses, newcomers quitting due to game development being hard as hell (seriously, guys, it's not easy), and other upsetting reasons.<br/></p>\n<p>I do NOT have plans on continuing this specific project. The developers involved in this project sadly cannot be credited or mentioned, due to reasons we can't talk about.<br/></p>", "metacritic": null, "released": "2020-10-19", "tba": false, "updated": "2020-10-23T07:44:25", "background_image": "https://media.rawg.io/media/screenshots/07a/07a56b92f499c9e2716076ee2bfdaaca.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 20, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Goiaba Megas Xellox"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}