{"id": 510066, "slug": "f1-2018-demo", "name": "F1 2018 Demo", "name_original": "F1 2018 Demo", "description": "To play this game on PS5, your system may need to be updated to the latest system software. Although this game is playable on PS5, some features available on PS4 may be absent. See PlayStation.com/bc for more details.<br/>MAKE HEADLINES in F1® 2018.<br/><br/><br/>F1® 2018 is the official videogame of the 2018 FIA FORMULA ONE WORLD CHAMPIONSHIP™. <br/><br/><br/>Complete your iconic F1® car collection in F1® 2018 with the F1® 2018 ‘HEADLINE CONTENT DLC PACK’, which adds both the 2009 BRAWN BGP-001 and 2003 WILLIAMS FW25 classic cars to the game.<br/><br/><br/><br/><br/>Online Play (Optional)<br/><br/><br/><br/><br/>F1 2018 Game - an official product of the FIA FORMULA ONE WORLD CHAMPIONSHIP. © 2018 The Codemasters Software Company Limited ('Codemasters'). All rights reserved. 'Codemasters”®, “EGO”® and the Codemasters logo are registered trade marks owned by Codemasters.<br/><br/><br/>The F1 FORMULA 1 logo, F1 logo, FORMULA 1, FORMULA ONE, F1, FIA FORMULA ONE WORLD CHAMPIONSHIP, GRAND PRIX and related marks are trade marks of Formula One Licensing BV, a Formula 1 company. © 2018 Cover images Formula One World Championship Limited, a Formula 1 company. Licensed by Formula One World Championship Limited. The FIA and FIA AfRS logos are trade marks of Federation Internationale de l’Automobile. All rights reserved.<br/><br/><br/>All other copyrights or trade marks are the property of their respective owners and are being used under license. Developed and published by Codemasters.<br/><br/><br/><br/>Uses DUALSHOCK 4 vibration function<br/><br/><br/>Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy). <br/><br/>Software subject to license (us.playstation.com/softwarelicense). <br/><br/>One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.<br/>", "metacritic": null, "released": "2018-11-13", "tba": false, "updated": "2020-10-26T02:10:58", "background_image": "https://media.rawg.io/media/screenshots/ad8/ad82f0727e5f29bd603a63e31af62b0c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 336, "game_series_count": 0, "reviews_count": 0, "platforms": ["PlayStation 4"], "developers": [], "genres": ["Simulation", "Racing"], "publishers": [], "esrb_rating": null}