{"id": 510072, "slug": "f1-2017-trial", "name": "F1 2017 Trial", "name_original": "F1 2017 Trial", "description": "To play this game on PS5, your system may need to be updated to the latest system software. Although this game is playable on PS5, some features available on PS4 may be absent. See PlayStation.com/bc for more details.<br/>Make history in F1™ 2017. Win the 2017 World Championship, break every record in the fastest ever F1™ cars, and race some of the most iconic F1 cars of the last 30 years. With an even deeper ten year Career, more varied gameplay in the new ‘Championships’ mode, and a host of other new features, both online and offline, F1 2017 is the most complete and thrilling F1 videogame ever.<br/><br/><br/><br/><br/><br/><br/>F1 2017 Game - an official product of the FIA FORMULA ONE WORLD CHAMPIONSHIP. © 2017 The Codemasters Software Company Limited ('Codemasters'). All rights reserved. 'Codemasters”®, “EGO”® and the Codemasters logo are registered trade marks owned by Codemasters.<br/><br/><br/>The F1 FORMULA 1 logo, F1 logo, F1 FIA FORMULA 1 WORLD CHAMPIONSHIP logo, FORMULA 1, FORMULA ONE, F1, FIA FORMULA ONE WORLD CHAMPIONSHIP, GRAND PRIX and related marks are trade marks of Formula One Licensing BV, a Formula 1 company. Licensed by Formula One World Championship Limited. ©Key art driver images 2017, licensed by Formula One World Championship Limited. All rights reserved.<br/><br/><br/>All other copyrights or trade marks are the property of their respective owners and are being used under license. Developed and published by Codemasters.<br/><br/><br/><br/>Online multiplayer (2-20 players). A paid-for PlayStation Plus membership is required. Online features require an account and are subject to our terms of service (playstationnetwork.com/terms-of-service), our privacy policy (playstationnetwork.com/privacy-policy), and the game publisher’s privacy policy.<br/>Uses DUALSHOCK 4 vibration function<br/><br/><br/>Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy). <br/><br/>Software subject to license (us.playstation.com/softwarelicense). <br/><br/>One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.<br/>", "metacritic": null, "released": "2017-10-19", "tba": false, "updated": "2020-10-26T02:14:02", "background_image": "https://media.rawg.io/media/screenshots/04e/04ea26bf3a1365e110bce0468d675a8b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 342, "game_series_count": 0, "reviews_count": 0, "platforms": ["PlayStation 4"], "developers": [], "genres": ["Racing"], "publishers": [], "esrb_rating": null}