{"id": 510062, "slug": "operation7-showdown", "name": "Operation7 Showdown", "name_original": "Operation7 Showdown", "description": "To play this game on PS5, your system may need to be updated to the latest system software. Although this game is playable on PS5, some features available on PS4 may be absent. See PlayStation.com/bc for more details.<br/>OPERATION7: SHOWDOWN is a free-to-play third-person shooter (TPS) game. <br/> Main contents include weapon customization, vehicles, and characters. The weapon customization system allows you to combine various parts and assemble your own unique weapon. Vehicles are similar to \"classes\" in other shooter games: you can use vehicles to destroy walls and transport your allies, in addition to providing fast movement. <br/> The game also provides realistic and dynamic action through various costumes that suit the genre of TPS. Strategic and open maps within the competitive mode enhance fun and completeness of the game, and the combination differentiates OPERATION7: SHOWDOWN from other shooter games. You can easily progress through the battleground against other players by using weapons, costumes, and gears to your advantage.<br/><br/><br/><br/>Online multiplayer (2-12 players). Online features require an account and are subject to our terms of service (playstationnetwork.com/terms-of-service), our privacy policy (playstationnetwork.com/privacy-policy), and the game publisher’s privacy policy.<br/>Uses DUALSHOCK 4 vibration function<br/>Optional In-game purchases<br/>Online play required<br/><br/><br/>Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy). <br/><br/>Software subject to license (us.playstation.com/softwarelicense). <br/><br/>One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.<br/>", "metacritic": null, "released": "2020-10-23", "tba": false, "updated": "2023-05-01T21:49:37", "background_image": "https://media.rawg.io/media/screenshots/65a/65a94e4cefc3fca45847efabe4dbc918.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 14, "dropped": 2}, "playtime": 0, "achievements_count": 56, "ratings_count": 2, "suggestions_count": 630, "game_series_count": 0, "reviews_count": 2, "platforms": ["PlayStation 4"], "developers": [], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}