{"id": 510213, "slug": "party-royale-guys-dont-fall", "name": "Party Royale: Guys Don't Fall!", "name_original": "Party Royale: Guys Don't Fall!", "description": "An epic fall race is going to thrill you with so many interesting run royale games challenges but remember, do not fall!  <br/><br/>Hey Run Royale Guys! This is the time to show your amazing crazy fall.io skills with this interesting ultimate knockout race game. Compete with royale players, do not fall, and enjoy crazy royale.io games.Try hard to be the winner of this exciting ultimate royale knockout game. So come on! Let’s become crazy royale runners like fun guys in these free.io games.<br/><br/>Get ready to win the title of royale runner 3D and have a fun experience of a free fall knockout race in the world of amazing free.io games. Enjoy this chaotic do not fall run royale game with a whole new amazing round, eye-catching colors, and amazing graphics. Experience this crazy knockout fall race and challenge your fun guys to beat them for the big victory in this thrilling fun race.io game.<br/><br/>Get ready and do not fall! Push the other crazy guys, crossover hurdles, and run fast to become the ultimate royale run guy of this amazing crazy fall race game. Enter into the amazing royale knockout game and try hard to be the number one. Accept the challenge and do your best to become the crazy dude… So come on guys! It’s your chance to win the do not fall games.<br/><br/>The addictive gameplay of royale knockout race games will give the fun guys the real joy with lots of different missions of the ultimate fall race.io game. The enhanced features like customization of your character, new amazing rounds, more difficult obstacles, and a very competing epic fall runner 3D are what you have been missing out on.<br/><br/>Test your impulses as an ultimate royale runner while getting into do not fall race and give other players intriguing knockout mayhem. So just dive into the best running.io game with lots of competitors and explore the new tactics of crazy fall race to become the fun guys of this free.io games.<br/><br/>Fun guys! Get yourselves ready to win this fall running knockout game but DO NOT FALL!<br/><br/>A Crazy Fall Race With So Many Amazing Features:<br/><br/>-To become the better player, try hard to come out from the crowd of mad runners<br/>-Enjoy playing different interesting dash rounds<br/>-Use your best tactics to save yourselves from lots of bizarre obstacles<br/>-Let’s explore so many maps of the exciting fall race<br/>-Fun guys can also enjoy by choosing different cute and funny characters <br/><br/>Don’t wait just start running and do not fall", "metacritic": null, "released": "2020-09-07", "tba": false, "updated": "2020-10-26T03:07:21", "background_image": "https://media.rawg.io/media/screenshots/11f/11fe478f7862a5332abefc496bf9fe30.jpg", "website": "https://playspare.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 98, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mad1 Games"], "genres": ["Adventure", "Racing"], "publishers": ["Mad1 Games"], "esrb_rating": "Everyone 10+"}