{"id": 51028, "slug": "mind-twins-twisted-co-op-platformer-adventure", "name": "MIND TWINS - Twisted Co-op Platformer Adventure", "name_original": "MIND TWINS - Twisted Co-op Platformer Adventure", "description": "We are just two friendly apes who learned how to make games in our free time and now love to bring our often crazy ideas to live in all kinds of games. Please expect our games to be smaller, raw experiences. We always love to chat with you guys and greatly appreciate all of your feedback in order to become better game creators. Just tell us your questions or ideas on the forums, Twitter or Facebook. If you encounter bugs or any problems, we will do all we can to ensure the best support that a drunken ape could possibly give. Have fun playing - DRUNKEN APES <br/><br/><br/><br/>MIND TWINS is playable alone by controlling one character at the time but it is probably much more fun to play local co-op mode.<br/><br/>You will discover more than 100 different levels, countless obstacles that will try to kill you and difficult puzzles that you and your friend will have to solve together, in this dark, puzzle-platformer with a twist. <br/>You will be able to navigate the MIND TWINS bunnies through the levels by running, jumping, dodging and changing the gravity which will often open up a lot of possibilities to actually solve a puzzle. Furthermore, there are hidden achievements and traps all over the place and teleporters, deathly chain-saws and giant carnivorous plants are just some of the many difficulties that you will need to overcome! <br/><br/>The game also includes a level editor which enables you to create your own levels.<br/>(ﾉ◕ヮ◕)ﾉ*:･ﾟ✧<br/><br/><br/><br/>◻️ Play alone or with a friend in the co-op mode<br/>◻️ More than 100 mind-bending levels <br/>◻️ Even more levels will be added over time<br/>◻️ 3 secret achievements are hidden in every level<br/>◻️ Intuitive gameplay creates a smooth beginning of the game but...<br/>◻️ The cubes are getting crazy difficult at a later stage - can you solve them all?<br/>◻️ Freaking funky dark music <br/>◻️ Cool combination of puzzle and platformer gameplay<br/>◻️ MIND TWINS editor to create your own levels and make even more of your friends suffer", "metacritic": null, "released": "2018-01-12", "tba": false, "updated": "2019-08-28T22:03:14", "background_image": "https://media.rawg.io/media/screenshots/d86/d8644325dbaa75d58873a18c68e55cd7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 18}, "playtime": 5, "achievements_count": 315, "ratings_count": 0, "suggestions_count": 167, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["DRUNKEN APES"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["DRUNKEN APES"], "esrb_rating": null}