{"id": 510204, "slug": "house-flipper-home-renovation", "name": "House Flipper: Home Renovation", "name_original": "House Flipper: Home Renovation", "description": "Have you ever dreamed about running your own renovation company?<br/>House Flipper is the best free one-man makeover crew on the market. Become an interior designer and start your very own business. Carry out orders, renovate, decorate houses, and sell them with profit afterwards! Get new skins for your tools.<br/><br/>Main features waiting for you:<br/>- awesome, realistic 3D graphics<br/>- smooth intuitive gameplay (60 FPS gameplay)<br/>- different interesting tasks<br/>- buying, renovating and selling houses as well as interior decoration.<br/>- Over 500 decoration items to unlock<br/><br/>COMPLETE ORDERS<br/><br/>A great adventure awaits you in the House Flipper simulator - the world of renovations! Perform interesting orders that will make you feel like a real house flipper. Meet colorful characters such as Eleonor Moore and her artistically gifted animals (whose activities will be followed by cleaning). Renovate the art connoisseur's museum, Giuseppe Clavier, and help the squat residents renovate their ruined house. House Flipper offers you various locations equipped with characteristic items.<br/><br/>DECORATE INTERIORS<br/><br/>Become an interior designer and arrange interiors according to your own ideas, using available items and a wide range of paints. Most of the items available in the game have from several to over a dozen variants, which you will unlock as you progress in the game. Learn not only their purpose but also the story behind them (background). What does a cat have to do with haiku writing? Why are the Babylonian invaders buying souvenirs there? You will find answers to more strange questions in the descriptions of over 500 items available in the game. All this in realistic 3D graphics!<br/><br/>GAIN EXPERIENCE<br/><br/>As you progress in House Flipper, you'll level up and improve your tools. Advance to the next levels to complete the tasks (quests) faster. Why hurt your hands when you can have gloves made of hardened smurf leather? Using unlocked items, you can arrange the interior of your office according to your own design. It can be stylish, but also ... A cat tree in the middle of the room? Why not? It's your idea after all!<br/><br/>BUY, RENEW, DECOR, SELL<br/><br/>You can unlock new items, buy various, though not always beautiful houses with cash and flipcoins acquired during orders. Renovate your new house and turn it into your office, or negotiate a convenient sale price at real estate agency. It doesn't matter if you clean the Trash in M5 or polish the Crimson Corner. Each of them can become your haven on the path of developing your own career in the house flipping industry or a source of additional profit.", "metacritic": null, "released": "2020-10-22", "tba": false, "updated": "2020-10-26T03:03:46", "background_image": "https://media.rawg.io/media/screenshots/55f/55fd3a9f90e9f8bf3ccb157fa24178ae.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "beaten": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 164, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["PlayWay"], "genres": ["Simulation", "Casual"], "publishers": ["PLAYWAY SPOLKA AKCYJNA"], "esrb_rating": "Everyone 10+"}