{"id": 510222, "slug": "illusion-connect", "name": "ILLUSION CONNECT", "name_original": "ILLUSION CONNECT", "description": "Heed the call of justice and fight to defend reality!<br/><br/>Illusion Connect is a mobile real-time strategy game that allows you to build your Radiants, and socialize with them in a myriad of social modes! With more than 50 Radiants at your disposal, create your unique lineup to dominate the Nightmares!<br/><br/>[Features]<br/>1. Exciting Real-time Battles<br/>Experience fast-paced, real-time battles and command your Radiants using nothing but your fingertips. Become their leader and direct them in battle!<br/><br/>2. Tactical Combats<br/>Devise various strategies by coordinating your chosen Radiants with the main character. Build awesome and powerful teams of Radiants to save the day!<br/><br/>3. A Radiant Cast of Heroes<br/>Learn the backgrounds, personalities, experiences, and hobbies of each and every one of your  Radiants! Recruit over 50 Radiants that have been fully designed in live 2-D, each customizable in variety of styles!<br/><br/>4. Grow with your Radiants<br/>Spend time with the Radiants both in and out of combat to find out more about them. Your growing bond will manifest as an ever-strengthening bond of power against the Nightmares!<br/><br/>5. Design your Dream Home<br/>Build a unique home and customize to your liking! Arrange your furniture and post your wallpapers! Make your home as comfortable as possible for your Radiants and enjoy life outside of combat!<br/><br/>6. Voiced by an All-star Cast<br/>Ai Kayano, Hisako Kanemoto, Yui Ishikawa, Risa Taneda, Ami Koshimizu, Maaya Uchida, Ayane Sakura, Yumi Hara, Haruka Tomatsu, Aoi Yuki, Hitomi Nabatame, Takehito Koyasu, Kae Oki, Saori Hayami, Natsuki Hanae<br/><br/><br/>[Join Us]<br/>Facebook: https://www.facebook.com/IllusionConnectGlobal<br/>Discord: https://discord.com/invite/CqQpWN3<br/>Illusion Connect Offical Web: http://www.illusionconnectgame.com<br/><br/>[Contact Us]<br/>Email: illusionconnect@superprismgames.com", "metacritic": null, "released": "2020-10-21", "tba": false, "updated": "2020-10-30T02:13:09", "background_image": "https://media.rawg.io/media/screenshots/984/9847194c3cfaa3c54e8a8c0047f16e53.jpg", "website": "https://www.illusionconnectgame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1, "dropped": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 256, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android", "iOS"], "developers": ["Chameleon Games", "Superprism Technology Co"], "genres": ["RPG", "Card"], "publishers": ["SuperPrism Technology Co"], "esrb_rating": null}