{"id": 510202, "slug": "randonautica-reimagined", "name": "Randonautica reimagined", "name_original": "Randonautica reimagined", "description": "Randonautica is an app built by a team of enthusiasts who share the spirit of random exploring. We believe it is all about the journey, not the destination.<br/> <br/>Instead of spending a weekend as you would normally do, why not explore some random spot? That's where Randonautica comes in handy. This is an experimental project. And our entire team does weekly trips as well. So, we try to make the app better with each step.<br/><br/>Download the app, share your location and the app will try to propose some mysterious spot to you in your location. Read the description carefully and decide if this is something you'd wish to explore. If not, there's another spot proposal waiting for you in an hour. Otherwise, prepare your backpack, take some spare bags to collect the trash, which you might find along the way, stay alert, respect the private property, and enjoy your journey!<br/><br/>Subscription pricing and terms:<br/>- You need to subscribe to get access to all the premium features and content offered for purchase within Randonauting.<br/>- Inside Randonauting an unlimited access option (in-app purchase named \"Lifetime access\") is proposed with a average cost of $39.99. A subscription is offered as well: for the new users a monthly subscription \"Monthly with trial\" with a 3-day free trial is proposed. After 3-day trial, if not canceled, the subscription will convert to the full price of $9.99 per month.<br/>- The cost of the purchase is charged to your iTunes account. Subscriptions are auto-renewable and are billed at the rate and period selected depending on the subscription plan. Users’ accounts are charged for auto-renewal within 24-hours prior to the end of the current period.<br/>- Subscriptions can be managed and auto-renewal can be turned off in Account Settings in iTunes after the purchase. Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable.<br/><br/>Terms of use: https://explore.korrekted.com/terms.html<br/>Privacy policy: https://explore.korrekted.com/policy.html", "metacritic": null, "released": "2020-08-10", "tba": false, "updated": "2020-10-26T03:03:04", "background_image": "https://media.rawg.io/media/screenshots/fda/fdae5bddb902e26eea043cd5823647b7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 66, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["ENI LENGVICH, OOO"], "genres": ["Action", "Adventure"], "publishers": ["ENI LENGVICH, OOO"], "esrb_rating": "Everyone 10+"}