{"id": 510347, "slug": "liars-maze", "name": "Liars Maze", "name_original": "Liars Maze", "description": "\"All I need is this spell of my own making, one more time, one more time, one more time...\"\r\n<p>Made in celebration of Halloween 2020, this game focuses on an alternate reality featuring characters from my comic, Space School. You <strong>do no</strong>t need to have read Space School in order to play an enjoy this game, though it is encouraged. This game is a short, fun romp exploring characters I've loved for a long time playing around in a different setting. <br/></p>\r\n- About the Game \r\n<ul><li>Zeggy is totally a Grand Master Witch! No lies here!</li><li>Why the heck is this game called Liars Maze if Zeggy is telling the truth, huh? Zeggy is known to be totally honest, all the time!</li><li>Half an hour of reading time for the full story! </li><li>Completely original soundtrack by Downhill.</li><li>It's rated PG! </li><li>Will make you feel emotional if you love Alkaline and Zeggy like I do.</li></ul>\r\n- About the Artist \r\n\n<p>Hey! I'm DCS! A queer comic artist and game dev who enjoys goofy, magical shenanigans with a dash of romance. I made this game on a whim in about 12 days total, so it's a tiny little thing, but still full of a lot of love. I hope you'll enjoy it!<br/></p>\n<p>If you like this game, consider supporting Space School on Patreon to see more projects like this come to life!\n</p>\r\n- About the Music \r\n<p>This game features an original soundtrack created by Downhill!</p>\n<p>Check out Downhill's Soundcloud and Bandcamp!</p>\r\n Thanks for playing!", "metacritic": null, "released": "2020-10-25", "tba": false, "updated": "2020-10-26T03:36:45", "background_image": "https://media.rawg.io/media/screenshots/6fd/6fdd54cd8b869efc518bab9f703025f1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 219, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Android"], "developers": ["DarkChibiShadow"], "genres": [], "publishers": [], "esrb_rating": null}