{"id": 510355, "slug": "halloween-2020", "name": "#Halloween 2020", "name_original": "#Halloween 2020", "description": "<p>A Halloween themed survival game that I built in 23 days, it's still a little rough around the edges and I'd love to update it later with some more features but for right now it's almost Halloween and I really just want to push this out for some people to give a try while it's still the Halloween period.</p>\n<p>If you'd like to support me by following my game development progress for my other games I'd really appreciate it, I post on Twitter regularly with progress I've made, see here: @S_Byrnes or follow my Developer Page @UpPixels<br/></p>\n<p><strong>Controls:</strong><br/>Left: A<br/>Right: D<br/>Jump: Spacebar<br/>Fire Primary: Left Mouse Click<br/>Throw Grenade: Right Mouse Click</p>\n<p><strong>How To Play:</strong><br/></p>\n<p>Fight off the enemy horde with the weapons you can scavenge, you have a basic sword by default but better weapons will drop from Demon Ralph when he throws pumpkins at you from the sky, but don't get hit by them.</p>\n<p>You will encounter zombies, ghouls, skeletons and witches, each harder to kill than the last and progressively more powerful.</p>\n<p>At random intervals the power will shut down, making it much harder to see where both you and the enemies are, your mission at this point is to make your way to the broken generator (located left and right of the play area), once you've located the broken generator, you must continue to fight the horde coming from the shadows as you remain near the generator until it is fixed. Continue this until your inevitable doom and see if you can get the highest score. </p>\n<p>At this point I'll be creating a promotional post on my Twitter so you can post screenshots of your highest kill streak in the comments, in the future I plan to implement an in-game leaderboard but I have run out of time and it's almost #Halloween2020</p>", "metacritic": null, "released": "2020-10-25", "tba": false, "updated": "2020-10-26T03:38:11", "background_image": "https://media.rawg.io/media/screenshots/f22/f2228311f1d4f33d54a5b53f26261961.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 106, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["UpTwoPixels"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}