{"id": 510336, "slug": "agronaut-working-title-alpha", "name": "Agronaut [Working Title] [ALPHA]", "name_original": "Agronaut [Working Title] [ALPHA]", "description": "<p><strong>Welcome</strong>!</p>\n<p>Agronaut is the working title for an isometric puzzle game I've been developing on my own since 2019. I plan to release the game initially on PC and later on Android.</p>\n<p>At the game's core, the player goes between levels helping navigate a car to the goal by placing a limited number of objects down that will alter its course. For instance: arrows that change the direction of the car, or teleporters that move it somewhere else. Inspired by the Toy Car minigame from Professor Layton and the Unwound Future.</p>\n\n<p><em><strong>Game is currently in an alpha state</strong>.</em></p>\n<p><strong>Current features:</strong></p>\n<p>- 26 playable levels, including 2 secret levels and 2 bonus levels for when you've perfected the other 24</p>\n<p>- Bonus goals to complete on every level</p>\n<p>- Mostly complete dynamic tutorial system</p>\n<p>- Can play with mouse only if desired, but includes several keyboard hotkeys (SPACEBAR to stop/start the puzzle, SHIFT to fast-forward, WASD or arrow keys to pan camera)</p>\n\n<p><strong>Known issues/shortcomings:</strong></p>\n<p>- No story/title screen/ending yet!</p>\n<p>- UI could be a little clearer, less cluttered (stop/start button is not super intuitive, need new symbols)</p>\n<p>- No music has been added yet, so listen to whatever you want for now :) Lots of SFX work still ongoing as well</p>\n<p>- No controller support, doubtful that I will add this since it plays much better with mouse or touch screen</p>\n<p>- Camera ends up zoomed in slightly too far on some hardware, especially on world map</p>\n<p>- Lack of levels and awkward progression towards the end of the game (e.g. there are only a few levels involving teleporters); I have many levels designed that I still need to translate into the game</p>", "metacritic": null, "released": "2020-10-25", "tba": false, "updated": "2020-10-26T03:34:26", "background_image": "https://media.rawg.io/media/screenshots/707/70775949652219ebcb12a0ee2082b4d1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 69, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jacob Knispel"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}