{"id": 510340, "slug": "journey-of-discovery", "name": "JOURNEY OF DISCOVERY", "name_original": "JOURNEY OF DISCOVERY", "description": "<p>Journey Of Discovery surprises you with not just inventive mechanics, of which there are many, but with expertly tuned level design and moments of charismatic .</p>\n<p>Its immaculately conceived and emotion-wrought fantasy world, topped by brilliant tactical combat, make it one of the finest games of the year thus far.</p>\n<p>Journey Of Discovery has grown into more than just a game. It’s become a metaverse, a digital space where players can come together to play, create and witness virtual events that continue to push forward what is possible in an online space. </p>\n<p>No matter how gorgeous its environments are, how clever its enemies are, and how tricky its puzzles get, the fact that Journey Of Discovery  continues to surprise you with new found rules and possibilities after dozens of hours is by far its most valuable quality. It's a game that allows you to feel gradually more and more empowered yet simultaneously manages to retain a sense of challenge and mystery--which, together, creates a steady, consistent feeling of gratification throughout the entire experience</p>\n<p>Journey Of Discovery is a  game that challenges courageous players. Use a huge variety of powers and abilities to vanquish your enemies. </p>\n<p> Level-up Your Abilities: Earn experience points throughout the game to increase your level, unlock rewards and gain magic abilities that assist you in overcoming each new Match-3 puzzle.<br/>Combining a puzzle merging game with a classic fruit matching puzzle game, Journey Of Discovery is a relaxing and addictive new free game that you won’t want to put down.</p>\n<p>A must have for those who loves action games with Great graphics Endlless playability . <br/>The most popular game on Play. The best competitive game currently on Play.<br/>The best competitive game currently on Play.Very challenging and rewarding action game featuring your favorite  heroes. <br/>Easier than the second, you have to taste it.game boasting eye-catching anime-style artwork,It enjoys new updates every few weeks<br/>which adds new cards and tweaks the game balance to score points.This hyper-realistic game delivers one of the most detailed battlefields you'll experience in video games</p>\n<p>There are many game options available to you right from the offset,giving you lots of play styles to choose from. You can tackle the war alone if you've got the courage, </p>\n<p>NOW WITH  THE FUN PUZZLES game YOU CAN GO CHALLENGE YOUR FRIENDS ONLINE TO A MATCH AND COMPARE YOUR SPEED ,STRENGTH AND HAVE A fantastic EXPERIENCE WITH THE Free MOBILE GAME Journey Of Discovery.</p>\n<p>We love to hear your thoughts. if you any areas for improvement while using our app, tell us that . We take all feedback seriously and use it for constant improvement.</p>\n<p>★ Features :</p>\n<p>+ Progress through multiple levels all the way to the top<br/>+ Learn different battle tactics and become the ultimate champion<br/>+ Free Daily cards<br/>+ Earn trophies<br/>+ Fun, intuitive mechanics<br/>+ Play for free!<br/>+ Ideal for all types of players - kids and adults, girls and boys...<br/>* Easy to learn <br/>* Realistic graphics, physical and sound effect<br/>* Different experices  to choose<br/>- Cutting Edge 3D Graphics and gnarly impact-crash sound effects<br/>- Upgrade and customize your own cars color speed ...<br/>- Earn cash rewards to unlock new Levels</p>\n<p>developed with all the love in the world .<br/>we hope you enjoy Journey Of Discovery  0.4.1 :)</p>\n<p>Download for free today, enjoy free game Journey Of Discovery with your friends now!</p>\n<p>Please review our Terms of Service and Privacy Policy :</p>\n<p>https://endless-game-studios.firebaseapp.com/privacyPolicy.html</p>", "metacritic": null, "released": "2020-10-25", "tba": false, "updated": "2020-10-26T03:35:29", "background_image": "https://media.rawg.io/media/screenshots/7da/7daa07d43e1f6e518b1a68361586642d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 9, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["play4fun_games"], "genres": ["Action"], "publishers": [], "esrb_rating": null}