{"id": 510446, "slug": "the-glass-files", "name": "The Glass Files", "name_original": "The Glass Files", "description": "What began with a harmless walk on the riverside ends with a fight against the world dictatorship. Was mit einem harmlosen Spaziergang am Flussufer begann, endet mit einem Kampf gegen die Weltdiktatur.\r\n\r\n\r\n\n<p><strong>Shadows by the Waterhouse 2 / The Glass Files</strong><br/><br/></p>\n<p>Meanwhile the villains that were just captured by the player have been led away from the store house by the police. The officers behaved uncooperative suggesting that they want to cover up everything on instruction of the secret service. And although the behavior of the doctor causes mistrust it appears like teaming up with her for now could be advantageous. On who’s authority is the distinctly nazi and transhumanisticly influenced gang of criminals planning and conducting their secret experiments on human beings? Where is the skull area? This appears to be the headquarters of the waterhouse gang which is sub rosa actually close to the Pyramidists although they are officially opposing them.  Where is the chambermaid of the little hotel where the player stayed over night? As additional research shows she was subdued and kidnapped by ruthless transhumanists. It’s quite probable that she had been the owner of the aforementioned mobile phone. A Biotech Lab can be found in containers hidden under the surface of the reservoir. Three of prisoners were able to escape into the open when we activated the secret mechanism. A video broadcast indicates that the chambermaid is in immediate danger. She is supposed to undergo an undefinable medical surgery as well as a complete mental re-programming. We will try to enter the lion‘s den once more in order to inspect the operating room. The police don’t let you enter. Finally we are permitted to take a peek at the bodycam of a police officer which indirectly strengthens our concerns. The doctor joins us. Her ambivalent behavior becomes more and more dubious. Is she playing a double game with us? She lured us into her apartment.  Shortly afterwards our discomfort is justified when another, apparently identical doctor stands in front of us. One of them has to be the bogus one… but which one? The showdown begins …<br/></p>\n\n\r\n\"The snake has two heads. Either cut them both off or none. Die Schlange hat zwei Köpfe. Entweder schlägst du sie beide ab oder aber keinen!\"\r\n\r\n\r\n<p><strong>Fluss des Vergessens Teil 2 / Die Glas Dateien</strong></p>\n<p>In der Halle sind mittlerweile die soeben vom Spieler / der Spieler*in dingfest gemachten Verbrecher abgeführt worden. Die Polizei zeigt sich unkooperativ was den Verdacht nahelegt, das Geschehene im Auftrag des Geheimdienstes vertuschen zu wollen. Obwohl das Verhalten der Ärztin Anlaß zu Mißtrauen gäbe, erscheint eine augenblickliche Verbündung mit ihr von Vorteil. In wessen Auftrag plant oder macht die eindeutig nationalsozialistischen, sowie transhumanistischen Ideologien anhängende Verbrecherbande geheime Menschenversuche und wo befindet sich das sogenannte \"Totenkopfgelände\"? Es scheint sich hierbei um den mutmaßlichen Hauptsitz der Wasserhausgruppe zu handeln, die im Geheimen den \"Pyramidlern\" nahe steht, obwohl sie diese nach offizieller Version bekämpft. Wo ist das verschwundene Zimmermädchen aus dem kleinen Hotel in dem der / die Spieler*in kurzfristig übernachtet hat? Wie sich durch weitere Recherchen herausstellt, war sie in die Kontrolle skrupelloser Transhumanisten geraten und entführt worden. Vermutlich war sie auch die Besitzerin des besagten Handys. In unter der Wasserroberfläche eines Sees versteckten Containern  befindet sich ein Biotech-Labor. Drei dort festgehalte Personen konnten durch den von uns betätigten Geheimmechanismus ins Freie fliehen. Wie aus einer Videoschaltung deutlich wird befindet sich das offenbar gekidnappte Zimmermädchen in großer Gefahr. Sie soll einem undefinierbaren chirurgischen Eingriff sowie einer vollkommenen mentalen Umprogrammierung unterzogen werden. Wir versuchen noch einmal in die \"Höhle des Löwen\" zu gelangen, um dort den mutmaßlichen Operationssaal zu inspizieren. Die Polizei läßt uns nicht in die Halle. Schließlich dürfen wir jedoch einen Blick auf die Bodycam eines Polizisten werfen, was unsere Befürchtungen indirekt verstärkt. Die Ärztin stößt hinzu. Ihre Ambivalenz wirkt zunehmend suspekter. Treibt sie etwa ein doppeltes Spiel mit uns ..? Sie hat uns in ihre Wohnung gelockt. Dass unser Unbehagen berechtigt ist, zeigt sich wenig später, als urplötzlich eine weitere, allem Anschein nach  exakt identische Ärztin vor uns steht. Eine der Beiden muß die Falsche sein ... aber welche? Der Showdown beginnt ...</p>", "metacritic": null, "released": "2020-10-25", "tba": false, "updated": "2020-10-26T04:01:14", "background_image": "https://media.rawg.io/media/screenshots/664/6646a3f2bce444e432b908b5bc303b40.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 320, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["novel games"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}