{"id": 51052, "slug": "magic-tower", "name": "Magic Tower", "name_original": "Magic Tower", "description": "The game consists of two parts and a combination of defense and escape. \"Exterminate all the monsters\" VS \"Help the monster to escape\".<br/>The whole process consists of 32 rounds, each round \"defense\" and \"escape\" play, two play through to the next round.<br/><br/>You don't have to destroy all the creatures in the \"Tower Defense\". After each round of play, Hp will be auto reset.<br/>You don't have to save all of the same kind in the \"escape\" game, and of course it will lose some \"energy\".<br/><br/>Each kind of turret has its own unique effect, through the collocation of various turrets to get the best defense.<br/>Each kind of monster has its own unique attributes, using the properties of the turret to combat monsters.<br/><br/>The core of the game is \"energy absorption\". (similar to \"thieves\", \"plunder\"). That is, the attack of the defense tower will draw energy from the monster, and accumulating energy can build more defense towers.<br/>(it's hard to defend if you have not enough energy.)<br/><br/><strong> Features: </strong><br/><ul><li> You don't want this games is so hard? Cheat code is \"greedisgood\". (open the console by press the 'Enter' key in the game)<br/></li><li> You only want to play \"defense\" part? The author's channel help you skipped the \"escape\" part directly.<br/></li><li> Automatic archiving after failure, reset the current round, relayout. </li></ul><br/><strong> Operation Description: </strong><br/>God's angle of view ___WASD mobile perspective; the mouse roll adjustment height; click land to build tower; click the tower to view the property or upgrade.<br/>The monster visual angle ___WASD walks; the mouse controls the direction; 'shift' key control accelerates; E, R, F key use skills.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:03:13", "background_image": "https://media.rawg.io/media/screenshots/1e0/1e0ade1659aa96f25255a63437b5a32b.jpg", "website": "https://www.indienova.com/g/MagicTower", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 10}, "playtime": 1, "achievements_count": 32, "ratings_count": 0, "suggestions_count": 275, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["夕"], "genres": ["RPG", "Strategy", "Indie"], "publishers": ["夕"], "esrb_rating": null}