{"id": 510553, "slug": "climax-supreme_bbq-pier-luc-poissant", "name": "Climax (Supreme_BBQ, Pier-Luc Poissant)", "name_original": "Climax (Supreme_BBQ, Pier-Luc Poissant)", "description": "Game Description\r\n<p>Incarnate Cthulhu and attack the demonic entities who kidnapped Miss Cthulhu.  Beat them with your divine psychic brain waves. As you absorb the <strong>MADNESS</strong> of your enemies, you'll upgrade your divine capacities. There is nothing stopping you. You have <strong>UNLIMITED POWER</strong>. </p>\n<p>Your goal is to become the <strong>ULTIMATE GOD OF THE OLD ONES</strong>... but at what price?<br/></p>Team<p><strong>Patrick Vasile: </strong>Programming/Merging</p><p><strong>Philippe Legris-Sylvestre: </strong>Art/Level Design<br/></p><p><strong>Pier-Luc Poissant: </strong>Art/Level Design<br/></p><p><strong>Gabriel Raymond-Roy: </strong>Programming/Build</p>\r\nHow we built it\r\n<p>The game was built in Game Maker Studio 2 using the GML language. Most of the sprites were made using Aseprite.</p>\r\nChallenges we ran into\r\n<p>This is our first Game Jam and we're all new Level Design students. It was a big challenge for us since it was the first game we've ever made from scratch. The biggest challenge for us was to find an efficient workflow as a team with little to no experience in video game making.</p>\n<p>Another big challenge was to find a way to all work on the same project without using a source manager. Using Google Drive, we found a way of creating a ''Master'' build and then we all worked on our own parts separately. Let's just say that merging all of the builds together was hectic since we could not be working on the same object at the same time.</p>\n<p>Finally our goal was to ship something playable and we achieved our goal, hurray!</p>\r\nAccomplishments that we're proud of\r\n<p>Shipping our first playable game demo is a huge milestone for us. It may not be as polished as we wanted but we're very proud of breaking the ice and being able to say that we made our first Game Jam!</p>\r\nWhat we learned\r\n<p>So much. We learned that it would've been better if each member had a specific role instead of all figuring out what to do as we go. Our programming skills got greatly increased as well as our teamwork in general. Making a game is not easy and we learned that it requires a lot of planning to have an efficient workflow.</p>\r\nWhat's next for Climax\r\n<p>We will soon start to learn the basics of Unity so we don't plan on retouching this project for now. Hopefully our next Game Jam will be on Unity and we will have even more skills to work with!</p>\r\nSpecial thanks to\r\n<p><strong>Annick Dumai</strong><strong>s</strong>: Our Level Design/Programming teacher</p>\n<p><strong>Alex Baillargeon</strong>: For the main soundtrack<br/>  https://www.linkedin.com/in/alexandre-baillargeon/</p>\n<p><strong>Vincent Charland</strong>: For the guitar riffs</p>\n<p><strong>Elizabeth Martin</strong>: For the splash screen logo<br/>   https://elizzacreation.com/</p>", "metacritic": null, "released": "2020-10-25", "tba": false, "updated": "2020-10-26T04:22:09", "background_image": "https://media.rawg.io/media/screenshots/3ac/3acc52971cb5a799f472638efbf48445.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 45, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Supreme_BBQ", "Pier-Luc Poissant"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}