{"id": 510731, "slug": "shaftshifter", "name": "ShaftShifter", "name_original": "ShaftShifter", "description": "<p><strong>READ THIS FIRST:</strong></p>\n<p>There's a known bug in Godot currently where a KinematicBody2D gets stuck when the corner of its rectangular collision shape collides precisely with the corner of another bodies. This sometimes make the first playable character to get stuck in around the corner of the platform. The only workaround is to change the collision to Capsule or Circle shape but doing that will make the sliding movement buggy and jumpy. The other workaround is to make two collisions with the normal movement using the Capsule or Circle shape while it change to Rectangle temporarily when sliding. Although it can reduce the chance for the bug to happen (it happens pretty rare on its own though), it still doesn't solve the problem and the bug can still happen when you're sliding. <br/></p>\n<p>In the end, i leave the bug as is and didn't make an effort to work around it because the bug is not on my scope to fix it and the workaround will ruin the gameplay of the game.<br/><br/></p>\n<p>Description:</p>\n<p>A lone adventurer woke up in an unknown place without memories...</p>\n<p>\"Where....and who am I....?\"</p>\n<p>Unbeknownstly, he woke up in the Crack of Multiverse, a place where many Universes converges. In that place, he found the Shaft Shifter, a strange machine that can travel between Universes. On his adventure, he meets many friend and foes alike, sometimes joining him traveling the Universes. Will his party solve the mystery of the Shaft Shifter ? Can he regains his memories and save the Multiverse ?</p>\n\n<p>Concept:</p>\n<p>A fast-paced   2d platformer, with less platforming and more action. The player will have to reach until a certain point to clear a stage while clearing enemies on the way and staying alive. For one stage, you can choose a maximum of 4 between many characters, which will have their own mechanics. You can switch between the characters you have choosen mid-stage anytime for your advantage, but for this game there's only 2 playable character.<br/></p>\n<p>This game is submitted in the CSUI Individual Game Jam of 2020 and includes three diversifier provided by the game jam:</p>\n<ul><li>Starlight Breaker (Make your enemies your friend by beating them)</li></ul>\n<p>On a certain point, you can beat a boss which you can recruit to your party. Each Universes will have their own storyline and recruitable characters with an overall overarching storyline. But for this game there's only the first stage and only 1 recruitable characters.<br/></p>\n<p>\n</p>\n<ul><li>I Can’t Punch You Without Getting Closer (Implement a melee combat system)</li></ul>\n<p>The main character, or the first playable character only have melee for his attacks. The melee combat system also have 3 attack patterns: normal (standing) attack, jump attack, and sliding attack, which can be smoothly combined and chained to attack while dodging the enemies.<br/></p>\n<ul><li>K2 is now only the third highest mountain in the world (Implement a destructible environment)</li></ul>\n<p>Although not a main theme for this game, there's a certain objects which can be destroyed. At some point, there's a mini puzzle where you're forced to think your way through the level with destructible environment.<br/></p>\n\n<p>How to Play:</p>\n<ul><li>Press right ( →) or left ( ←) arrow key to move right or left.</li><li>Press up (↑) arrow key to jump.</li><li>Press esc key to pause.</li><li>Press z key to attack. Diferent characters will have different attack patterns.</li><li>Press space key to perform special attack. Not all characters have a special attack.</li></ul>\n\n<p>External Assets Used:</p>\n<ul><li>Pixel Art Side Scroller 5 by hugues laborde.</li><li>Animated Pixel Adventurerby rvros. </li><li>Animated Pixel Slime by rvros.</li><li>PIXEL ART METROIDVANIA ASSET PACK by o_lobster.</li><li>Massive Weapon Package by GameSupplyGuy.</li></ul>\n\n<p>Music and SFX:</p>\n<p>(C) 魔王魂<br/></p>\n<p>(C) PANICPUMPKIN</p>\n\n<p>The source code for this game is available publicly: link.<br/></p>\n<p>You may use and edit the source code however you like. <strong>BUT, don't forget to credit and give copyright to the original author </strong><strong>for the external assets if you decided to use them!</strong><br/></p>\n<p>How to Install:</p>\n<p>Unzip the ShaftShifter.zip and run the ShaftShifter.exe on the same folder with its .pck file.<br/></p>", "metacritic": null, "released": "2020-10-24", "tba": false, "updated": "2020-10-26T05:03:25", "background_image": "https://media.rawg.io/media/screenshots/64c/64c058360896b9ed8cbb49a81cdec508.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 35, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["racendol"], "genres": ["Action", "Adventure", "Platformer"], "publishers": [], "esrb_rating": null}