{"id": 510726, "slug": "minimog", "name": "Minimog", "name_original": "Minimog", "description": "<p>Minimogs are amazing off road vehicles. The Minimog game is all about going as fast as you can through tons of chaos grinding everything into oblivion as you go. Collect coins in hard to reach places, but don't wreck the truck. The boss will get mad. When things go wrong, stop off at Lou's Garage and he will fix you up in a jiffy. Spend your collected coins to upgrade to different Minimog trucks. Mindless arcade 4-wheelin' fun.</p>\n<p><strong>To control the Minimog truck Use the arrow keys:</strong><br/>Hold the right arrow key to go forward.<br/>Push the left arrow key to back up.<br/>Tap the up arrow key and your truck jumps.</p>\n<p>For the most part you go forward, tapping jump at opportune times to<br/>reach a coin. You only go backwards when something has gone wrong.</p>\n<p>If anything other than your tires touch the ground, it will crash the<br/>truck and the boss will get mad. Try not to wheelie up too far or tip<br/>over scratching the truck. Keep your wheels under you! Go as fast as<br/>you can, stay safe, collect coins, and trade them for new Minimog<br/>upgrades.</p>\n<p>Your total coin count is displayed during game play in the top right<br/>corner. It has a spinning coin under the amount collected. TIP: If<br/>your Minimog ever gets stuck and cannot move, click the spinning coin<br/>to return to the main menu so you can start over.</p>\n<p>10 Minimogs to choose from:</p>\n<p>Rusty: a fixer upper. Not much power, but it's all you've got to<br/>collect coins with. Once you collect enough coins, purchase the other<br/>Minimogs with all new game play and powers.<br/>Apples: where do they discuss apples and oranges? They don't grow in<br/>the same area...<br/>Oranges: I like anything that's name is its color.<br/>Fruity: this is the truck with it all. Fruity has a lot of fruit in<br/>his Minimog. It goes everywhere and is insane.<br/>Bananas: I like this truck just because it's full of bananas. Bananas<br/>are funnier than all the other fruits combined.<br/>Fishy: Fish are funny too. There is only one way to have an insane<br/>fish incident during this game, and it's with this Minimog.<br/>Wiggly Loaf: the problem with Wiggly Loaf is that they just can't sit still.<br/>Toxic: this is the most challenging Minimog to drive. Pro drivers<br/>only. The toxic waste drips off the back dissolving the very road you<br/>are driving on. You're melting the world behind you! No going back<br/>with this one. You must go forward, and fast!<br/>Medic: can you get the patient safely to the hospital? The answer is<br/>no. You won't even be able to keep them in your truck, and might even<br/>run them over if you're not careful. This game is nuts.<br/>Plow Boy: he's got a snow plow and he plows the snow. A bit too front<br/>heavy, and a bit too powerful.</p>\n<p>Flags: if you knock a flag pole over, your Minimog gets the flag and<br/>becomes a magic coin magnet. Go fast and collect as many coins as you<br/>can while you have a flag.</p>\n<p>When I was a kid, this is how I imagined work. I wasn't sure of the<br/>details, but I knew that my dad drove a truck and delivered stuff. I<br/>also knew that sometimes you don't get there. Sometimes things go<br/>wrong and the boss gets mad. That's all this game is about. Abusing<br/>the company vehicle, losing the stuff you're supposed to deliver, and<br/>having a ton of fun along the way.</p>\n<p>I made the Minimog game with the goal to make you laugh. It's cartoony<br/>slapstick humor in a physics based driving game. I tried to make it<br/>really easy to play but have tons of fast, insane action. It's a<br/>truck. You race forward. Why? Mischief!</p>\n<p>I wanted the levels to have a \"this is going to be really hard to explain feeling.\" Each time your Minimog is destroyed in an inexplicable way you are presented with the angry boss, thinking, wow, how did that just happen? No one would ever believe... I'm in so much trouble...</p>\n<p>It's hilarious to hang out and watch friends play this game. Laughter is contagious.</p>", "metacritic": null, "released": "2020-10-24", "tba": false, "updated": "2020-10-26T05:01:56", "background_image": "https://media.rawg.io/media/screenshots/1ff/1ffe6253d51acd387475589099482740.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 479, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["JEMoores"], "genres": ["Action", "Platformer"], "publishers": [], "esrb_rating": null}