{"id": 510894, "slug": "the-lockrooms-demo", "name": "The Lockrooms Demo", "name_original": "The Lockrooms Demo", "description": "<p><strong><em>The Lockrooms    DEMO<br/></em></strong></p>\n\n<p><strong><em>____________________________________________________<br/></em></strong></p>\n<p><em>The Lockrooms </em>is a surreal first person survival/puzzle horror game. Go from room to room, solving puzzle after puzzle, and evading whichever horror has wandered your direction...</p>\n<p>You wake up without context, alone, in a hallway covered in brick and stone. The only way out of your predicament is to open the yellow door that lies at the end of the hallway. You circumvent the hallway, reaching it, and with a tug you manage to pry it open.<br/></p>\n<p>But all it does is lead you to another room, this time covered in plaster. Each additional iteration brings you to a different room, with the obstacles gradually gaining in complexity, and the shadows dancing in the distance. Would you find that it is the same lifeless room as before, or would you find yourself an unwilling guest to whatever being lies in there...</p>\n<p>Solve puzzles and riddles, and evade the horrors that lie within <em>The Lockrooms</em>. Recordings, Notes, and broadcasts all deliver their messages, sometimes uncannily nonsensical, and sometimes <em>eerily familiar.</em></p>\n<p><em>---------------------------------------------------------------------------------------------------------------------<br/><strong>The Lockrooms </strong></em><strong>is a only a demo at this point.</strong></p>\n<p>If this demo gets enough support, then I will make the full game!</p>\n<p>The full game will include:</p>\n<p>-More rooms!</p>\n<p>-More unique and interactive puzzles based on physics, riddles, and logic systems!</p>\n<p>-More numerous and different antagonists, all with unique behaviors!</p>\n<p>-Challenging combinations of different enemies! In this Demo, only one type of enemy was present at a time. In the full game, different combinations will be active in a single room.</p>\n<p>-More complex levels! These will be levels on a larger scale! These will include many enemies, many puzzles, and many areas, and this complexity would give these rooms much more depth and challenge.</p>\n<p>-Story! Notes, radios, and other sorts of communication will develop the lore and situation over the course of the game.<br/> <br/>-Different modes! The base game will have a series of levels that you can progress through. There will also be a difficult mode with a form of permadeath. Each will have a separate ending. In addition to this, there will be the option to play individual levels.</p>\n<p>-New Items! New gameplay!</p>\n<p>-Horror!<br/></p>\n<p>---------------------------------------------------------------------------------------------------------<br/>If you enjoyed this project, you may enjoy supporting me by purchasing my other project, <strong><em>Domestic Defense</em></strong>.</p>\n<p>Domestic Defense is an absurdist take on home invasion horror. An intruder has broken into your home, and is threatening you and your household. <br/></p>\n<p>Like <em>The Lockrooms, </em>Domestic Defense features a surreal overtone, and a gameplay focus. In addition to that, Domestic Defense features satirical parody and dark humor, as well as a fleshed out lore that may or may not connect to <em>The Lockrooms</em>...<br/></p>\n<p>https://store.steampowered.com/app/1367620/Domestic_Defense/</p>\n<p>================================================================<br/></p>\n<p><strong>CONTACTS:<br/></strong></p>\n<p><strong>Email: mellodevstudios@gmail.com<br/></strong></p>\n<p><strong>Twitter: @mellodev1<br/></strong></p>\n<p><strong>Youtube:  https://www.youtube.com/channel/UCUfYgJfLjp8wPXCQgX7YP0g</strong><br/></p>", "metacritic": null, "released": "2020-10-24", "tba": false, "updated": "2020-10-26T05:39:59", "background_image": "https://media.rawg.io/media/screenshots/86a/86a92095d92fac67eee4fd051f106161.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 110, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["MelloDev"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}