{"id": 510854, "slug": "onehundred", "name": "OneHundred", "name_original": "OneHundred", "description": "<p>Hi this is my first game i've ever made and it took me a long time to make it. In my opinion it's not good but it was a good learning experience. There might be some typos and dead memes in there but i am 13 years old so ignore them pls. Anyway don't expect much. The assets are ripped off of the unity asset store like you would probably guess.</p>\n<p><strong>How to play</strong></p>\n<p>The goal of the game is to beat all 100 levels without dying once as dying will reset your progress to the last checkpoint which is every 20 levels. If you take any amount of damage, you die. You can move using the WASD or the arrow keys. There is a timer for each level and if you can't finish in under the set time, you lose.  You can also double jump and use your cursor to interact. If you quit the game, it will restart u to the last checkpoint. There are \"bosses\" every twenty levels and a miscellaneous one every 10 levels that not a boss fight.</p>\n<p><strong>Downloading Issues</strong></p>\n<p><em>Mac</em></p>\n<p>If it says it can't be open as it is made by an unidentified developer, go to system preferences and  go to the general section of security and preferences, then click open at the bottom.</p>\n<p><em>Windows</em><br/></p>\n<p>If it gets block by windows defender because it is made from an unidentified developer or something like that then just click open anyway. Trust me there are no viruses lol u can scan it if u want.</p>", "metacritic": null, "released": "2020-10-24", "tba": false, "updated": "2020-10-26T05:31:33", "background_image": "https://media.rawg.io/media/screenshots/537/53775c29f2721f6fde669999e1abc3d3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 218, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["DankDoodle"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}