{"id": 510923, "slug": "minotaur-hotel-sfw-mode", "name": "Minotaur Hotel: SFW Mode", "name_original": "Minotaur Hotel: SFW Mode", "description": "Itch.io's 9th highest rated game, now available in Safe for Work format!\r\n<p><strong>Minotaur Hotel: Safe for Work Mode</strong> is a romance visual novel set in a magical hotel. You will become its new manager and meet the keeper — Asterion, the minotaur from the Greek legend, sentenced by the gods to spend eternity there.<br/></p>\n\n<p>In your mandate as Master of the hotel you will be faced with many choices — treating the minotaur humanely or not, dealing with the hotel’s magical workings and entities, and managing a growing cast of fantastical employees. By sending out teams to explore the valley below the hotel you will find ancient artifacts and mementos, which will reveal more about Asterion’s past and the realm’s history.</p>\n\n<p>The way you treat Asterion and manage the hotel will affect the story, leading to a replayable experience where each playthrough reacts to your play style and reveals different parts of the story. The game has over 150.000 words and it will provide you with hours of playtime.</p>\n<p>~~~</p>\n<p>The original version of Minotaur Hotel contains explicit, graphical adult content, which can be turned off. Over the months, however, a number of players requested a version with Safe for Work Mode permanently on, as they might not feel comfortable with carrying adult content in their devices.</p>\n<p><strong>Minotaur Hotel: Safe for Work Mode</strong> is the <strong>same game, </strong>with the single difference that this version is locked as SFW. It does not portray nudity, sex or graphic violence.<br/></p><p>If you would rather play the original version of the game, you can check it by clicking the link below.</p>\r\nThe cover art for Minotaur Hotel: SFW Mode was graciously made by Systemic Gaze. Please consider following him on Twitter.", "metacritic": null, "released": "2020-10-23", "tba": false, "updated": "2020-10-26T05:46:17", "background_image": "https://media.rawg.io/media/screenshots/4dd/4dd5af62beacc3a24c2ca5dac9233e52.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 228, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Android"], "developers": ["Minoh Workshop", "Nanoff"], "genres": [], "publishers": [], "esrb_rating": null}