{"id": 51125, "slug": "plutocracy", "name": "Plutocracy", "name_original": "Plutocracy", "description": "In «Plutocracy» you immerse into the 1870 America's Gilded Age - the era of the first billionaires. You start from the bottom and become the shadow ruler of the world. You seek the profitable companies and negotiate with shareholders to buy out the controlling stake and put your own people at the helm. Absorb your competitors' companies and dominate the market gaining excessive profit.<br/><br/>Be ready to lobby politicians and laws to expand your influence. Corrupt officials creating barriers and intrigues against enemies. There are decades of history in front of you which you will be able to influence. You can create the most powerful financial empire. No one should know who really rules the world!<br/><br/><strong>Key features:</strong>Simulation of economic systemThe functioning of each enterprise depends not only on the microeconomic indicators, but also on macroeconomic. In addition, the activities of the companies affected by each other.Diplomacy in-depthEach character has unique features. The better you know them, the higher chance of success will be.Dirty methods of a competitive struggleUse blackmails, threats, industrial strikes, oil pipeline arsons, raider captures and other dirty tricks to achieve your goals.Corrupt the politicians and lobby the lawsYou can decide to finance an election campaign politicians or give bribes to promote your own interests. Politicians will help you push the bills which will favorably effect on your economy as well as to impair the economy of your competitors.Win the auctionWin luxury items and pieces of artistry at the auction: the respectable mansions, vehicles, antiques, collectibles and other valuable items. Gathering collections, you will be able to achieve necessary alliances and gain trust allies.MultiplayerPlay with your friends online. Determine who of you is best suited for the role of billionaire. You may choose your own goal for the win in 2 modes: \"free for all\" or \"2vs2\". Find yourself in the global ranking table of players.", "metacritic": null, "released": null, "tba": false, "updated": "2023-06-12T19:28:49", "background_image": "https://media.rawg.io/media/screenshots/0f4/0f492c1d3d01a25f41d662c11c4bb96d.jpg", "website": "http://plutocracygame.com/", "rating": 3.71, "rating_top": 5, "added_by_status": {"yet": 1, "owned": 21, "toplay": 1, "dropped": 3}, "playtime": 2, "achievements_count": 0, "ratings_count": 5, "suggestions_count": 258, "game_series_count": 0, "reviews_count": 7, "platforms": ["PC", "Linux"], "developers": ["Redwood Games"], "genres": ["Strategy", "Simulation"], "publishers": ["Redwood Games"], "esrb_rating": null}