{"id": 51127, "slug": "epic-car-factory", "name": "Epic Car Factory", "name_original": "Epic Car Factory", "description": "<strong>Epic Car Factory</strong> lets you be the CEO of your very own car company. You are responsible for developing, building, and marketing vehicles for the world stage. Try to stay in the black while navigating the tumultuous market and striving to beat out the competition. To thrive you’ll need more than heart and determination. You’ll need to hire the right people, focus on the right projects, research the right parts, decide which customers to court, and make the tough calls. Your company will succeed or fail based on the choices you make! Epic Car Factory is a grand business simulation game filled with…<br/><br/><ul><li>Car Development (over 70 cars types to research)<br/></li><li>Research (24 different parts with 5 quality levels)<br/></li><li>Employees (over 40 possible employees, different professions and training options)<br/></li><li>Contract Jobs (Dozens to help supplement your factories income)<br/></li><li>Advertising and marketing (to help get the product to the buyer)<br/></li><li>Random economic Events (Because the market is volatile)<br/></li><li>Dynamic time control (Make every second count or skip ahead weeks)<br/></li><li>And more!</li></ul><br/>If you’ve ever looked at the car companies and thought that you could do better, then now is your chance to prove it.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:03:10", "background_image": "https://media.rawg.io/media/screenshots/7fa/7fa2f89c85421d496b59080476771fff.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 101, "beaten": 2, "toplay": 1, "dropped": 1}, "playtime": 2, "achievements_count": 24, "ratings_count": 2, "suggestions_count": 272, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC", "macOS", "Linux"], "developers": ["Epic Devs"], "genres": ["Simulation"], "publishers": ["Assemble Entertainment"], "esrb_rating": null}