{"id": 511311, "slug": "dreams-itch-zoroiscrying", "name": "Dreams (itch) (Zoroiscrying)", "name_original": "Dreams (itch) (Zoroiscrying)", "description": "<p><strong>Brief Introduction</strong></p>\n<p>This game is a simple platformer game aiming at producing a Dream-like mechanics and art style. This game is made during the course of the Art game competition between 2020/3 to 2020/5.</p>\n\n<p>Developers were consisted of two members in JiangNan University, Yan Yifei(Programmer and Designer) and Jiang Minmin(Artist and Designer).</p>\n<p><strong>Game Mechanics</strong><br/></p>\n<p>The mechanics of this game is simple and easy to understand, consists of 9 elements:</p>\n<p>1. Movement: Walk and run. In game you can move around using WSAD, later of the game, you can press Left Shift to run.</p>\n<p>2. Jump: You can press Space bar to perform a jump, later in the game, you can jump one more time in air, and your jump height and jump speed will increase at some point of the game.</p>\n<p>3. Danger zone: In the game, there are some danger zones implying player to avoid. When touching the danger zone, the player will be directly send back to a latest saved position. The danger zone's visual wouldn't be consistent, you need to compare them with the environment and try them out.</p>\n<p>4. Collapsing Blocks: In game, there will be some blocks that will disappear once after few seconds from player stands on them, and recover afterwards.</p>\n<p>5. Bouncing Counds: Later of the game, you will enter a scene with cloud elements, inside which you will find a Purple Cloud like platform, jumped upon, the player will be bounced up exactly at the height that the player has ever been during a perform of a jump action.</p>\n<p>6. Item_Jump block: You will find a shining cube in the game, and if touched, the player can perform another jump action in air.(Requires the player to double jump first and touch the item, then jump again)</p>\n<p>7. Item_pinwheel: You will find Pinwheels during the game, and if it is touched by the player, it will give the player a speed-up for several seconds.<br/></p>\n<p>8. Check points: In game you will find several a circling object that will disappear once touched. The check point will stand as a recover position once the player touches the danger zone or fall out of the environment.</p>\n<p>9. Button: In the game you will find cubic objects that shines when you face at them, they represent interactable buttons and will perform relating actions once you press the interact button: E.</p>\n<p>Last but not least, this game also marks my earliear experiences playing Cs1.6/Cs:Source, during which I played a lot of Strafe/Jump/Climbing/Surfing maps. I realized that some of the mechanics are like the mechanics in these maps after completed the game, and I actually played those maps again in CS:GO to review my old memories.</p>", "metacritic": null, "released": null, "tba": false, "updated": "2020-10-26T07:16:47", "background_image": "https://media.rawg.io/media/screenshots/83d/83d8ab4ff8d88934ead5648c1161dda9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 113, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Zoroiscrying"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}