{"id": 511359, "slug": "habiter", "name": "Habiter", "name_original": "Habiter", "description": "<p><strong>Submission for Beginners Circle Jam #3 - Theme: \"A Different Planet\"</strong></p><p><em>Great news employee! The StellarCorp has reviewed your file and deemed you fit for a new position. Starting tomorrow you’ll be moved from your minimum-wage job to a new position of a Habiter. Naturally, your pay will start at a minimum, due to your expected inexperience.\r\n  </em></p>\n<p><em>Habiter is an especially important job in which you’re given a cargo of various creatures that were taken from their home planet when approaching extinction. Usually due to worsening climate that was definitely never caused by us.\r\n  </em></p>\n<p><em>You need to research these creatures and find them a suitable new home where they won’t die for at least next couple years.\r\n  </em></p>\n<p><em>Good luck employee!</em></p>\n<p>------------------------------------------------------------------</p><p><strong>How to play:</strong><br/></p><p>Your goal is to assign correct planets to each creature you receive.<br/></p><p>Use your mouse to move documents around on the table. Clicking on tools at the bottom you can switch your cursor into a pen or a stamp.</p><p>On the sides of the screen you have a creature panel and a planet panel. You use them to identify traits of both the creatures and planets you have available.<br/>To know what to look for, check out your handy rulebook that holds all the info you need.<br/><em>ex. all insectoid creatures like Savannah, Desert and Arid planets</em></p><p>To progress, type the correct codes of planets on each document. Once you're done, press the big button to initiate a Launch and finish the level. You will be given a point for each correctly assigned planet.</p><p>------------------------------------------------------------------</p><p>Hi! Some words from the team:<br/>We are a new dev team of 5 college students currently studying game design. We've never had a change to work on a project from start to finish so this game jam was a great opportunity for us to test our skill and knowledge.</p><p>Habiter definitely challenged us and we only managed to develop a small portion of what we planned. This little prototype is the result.</p><p>We're happy to hear any feedback you have for us. And if you think the concept, we have here is promising we might think of continuing to develop Habiter further : )</p><br/>", "metacritic": null, "released": "2020-10-23", "tba": false, "updated": "2020-10-26T07:27:35", "background_image": "https://media.rawg.io/media/screenshots/7bf/7bfa1f7fcd0e0974b83aef57fc352172.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 52, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SlimePieGames"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}