{"id": 5113, "slug": "buzz-quiz-world-psp", "name": "BUZZ! Quiz World (PSP)", "name_original": "BUZZ! Quiz World (PSP)", "description": "<p>The portable quiz show experience without boundaries!<br />\nTake a huge variety of trivia options on the go with you in BUZZ!™ Quiz World for the PSP® system. All new single and multi player modes will keep you and friends challenged for hours. now you can jump online to try quizzes created by other fans or download add-on quizzes on your favorite subjects through the PSN. Take your trivia party to go!<br />\nFeatures</p>\n<p>-Deep single player mode - challenge the 4 quiz boards to show you’re a quiz master, earn new trophies, and unlock characters</p>\n<p>-&#39;Pass Around&#39; quizzing lets 6 people play together on one PSP® system</p>\n<p>-New online mode lets 4 players take on others or share your game with up to 4 other PSP® system owners with Game Sharing</p>\n<p>-Answer over 4500 new questions including hundreds of pictures and videos</p>\n<p>-New MyBUZZ! support – download and play MyBUZZ! user-created quizzes directly on your PSP® system</p>\n<p>-Download add-on premium quiz packs exclusively from PSN and extend your fun</p>\n<p>BUZZ! is a trademark of Sony Computer Entertainment Europe. Developed by Curve Studios. © 2009 Sony Computer Entertainment Europe.</p>\n<p>Use of this item is subject to the PlayStation®Network Terms of Service. If you do not wish to accept all these terms, do not use this item. One-time license fee for downloads to up to 2 console systems that are associated with the purchasing account.</p>", "metacritic": null, "released": "2009-12-17", "tba": false, "updated": "2023-03-09T09:12:16", "background_image": "https://media.rawg.io/media/games/4f3/4f3922308652c973bbb9d09ec960ed38.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 128, "game_series_count": 18, "reviews_count": 0, "platforms": ["PSP"], "developers": ["Sony Interactive Entertainment"], "genres": ["Adventure"], "publishers": ["SCEA"], "esrb_rating": "Teen"}