{"id": 511475, "slug": "bakugan-champions-of-vestroia", "name": "Bakugan: Champions of Vestroia", "name_original": "Bakugan: Champions of Vestroia", "description": "<p>Bakugan: Champions of Vestroia is an all-new action role-playing game with an original story that expands on the hit TV series and brings the Bakugan universe to the Nintendo Switch for the very first time. The adventure takes players on the ultimate Bakugan journey as they befriend powerful creatures known as Bakugan, gear up and customize Bakugan teams for fiercely strategic battles, and master their skills to become the Champion of Vestroia. Players can also play online in head-to-head multiplayer.</p>\n<p>Master Your Bakugan Fighting Skills: Become Bakugan Brawling heroes through the game’s highly competitive and deep Action Battle System as players build their best Bakugan teams. Players can collect Bakugan by befriending them while exploring and completing quests. Level them up by battling in Bakugan Brawls and watch them grow more powerful as they evolve.<br />\nBuild the Perfect Team: Assemble three of your strongest Bakugan, each with their own customizable abilities, and equip Baku-Gear to form the ultimate team synergy. Bakugan also come in various Factions, which determines their strengths and weaknesses, adding another layer of depth and strategy to the brawl.<br />\nVaried Environments to Explore: Fully explorable 3D world divided into different districts each with dedicated battle environments. Players can interact with other characters, go on quests, and explore with their Bakugan team through locations such as a sunny waterfront, bustling downtown or a factory riddled with nefarious enemies.<br />\nTake on the World: Test your skills against the world in head-to-head Online Multiplayer Brawls using the Bakugan teams you have trained on your adventure.</p>", "metacritic": 53, "released": "2020-11-03", "tba": false, "updated": "2020-10-27T13:01:50", "background_image": "https://media.rawg.io/media/screenshots/823/823c541ea43dc1ed670991157fd54cf7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "beaten": 1, "toplay": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 197, "game_series_count": 4, "reviews_count": 1, "platforms": ["Nintendo Switch"], "developers": ["WayForward Technologies"], "genres": ["Action", "RPG"], "publishers": ["WayForward"], "esrb_rating": "Everyone 10+"}