{"id": 511517, "slug": "liftoff-drone-racing", "name": "Liftoff: Drone Racing", "name_original": "Liftoff: Drone Racing", "description": "<p>Become a skilled drone racing pilot in Liftoff: Drone Racing! The game challenges you to start a fast paced from backyard to pro track drone racing pilot career, either solo in the single player or together with others in the online multiplayer mode.<br />\nWith 27 officially licensed drone frames and hundreds of parts and skins from several top brands such as Rotor Riot, Armattan and ImmersionRC, you will be able to customise your own authentic racing drone by using thousands of customisation combinations. Create the drone of your dreams, start your motors and fly up to 60 race tracks in first-person or third-person view to be the best drone pilot out there.<br />\nThanks to several game and flight modes it is not a matter of whether you are a pro drone pilot with real-life experience or a rookie who is completely new to the drone racing sport.<br />\nEnjoy advanced drone physics, recommended and tested by top drone pilots across the world. Flying a drone in Liftoff: Drone Racing feels so real, you will forget it is completely virtual! The exciting campaign mode will guide you through the history of drone racing!<br />\nWith optimised controls for consoles, experienced pilots can explore various environments or race one another, while newcomers can hone their flying skills before taking them to the field.<br />\nDo you have what it takes to make it to the top?</p>", "metacritic": 56, "released": "2020-11-10", "tba": false, "updated": "2020-12-01T08:30:17", "background_image": "https://media.rawg.io/media/screenshots/c8f/c8faef12da9ceedbf9fc9c1450da83e0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 4, "dropped": 1, "playing": 1}, "playtime": 0, "achievements_count": 28, "ratings_count": 1, "suggestions_count": 456, "game_series_count": 0, "reviews_count": 1, "platforms": ["PlayStation 4", "Xbox One"], "developers": ["LuGus Studios"], "genres": ["Simulation", "Racing"], "publishers": ["LuGus Studios", "Astragon"], "esrb_rating": null}