{"id": 511513, "slug": "five-nights-at-freddys-original-series", "name": "Five Nights at Freddy's: Original Series", "name_original": "Five Nights at Freddy's: Original Series", "description": "Explore the history of the Freddy's world famous pizzeria in this bundle containing the original 4 titles. <br/><br/>in Five Nights  at Freddy's 1 you are welcomed to your new summer job at Freddy Fazbear's Pizza, where kids and parents alike come for entertainment and food as far as the eye can see! The main attraction is Freddy Fazbear, of course; and his two friends. They are animatronic robots, programmed to please the crowds! The robots' behavior has become somewhat unpredictable at night however, and it was much cheaper to hire you as a security guard than to find a repairman.<br/><br/>From your small office you must watch the security cameras carefully. You have a very limited amount of electricity that you're allowed to use per night (corporate budget cuts, you know). That means when you run out of power for the night- no more security doors and no more lights! If something isn't right- namely if Freddybear or his friends aren't in their proper places, you must find them on the monitors and protect yourself if needed!<br/><br/>In Five Nights at Freddy's 2, the old and aging animatronics are joined by a new cast of characters. They are kid-friendly, updated with the latest in facial recognition technology, tied into local criminal databases, and promise to put on a safe and entertaining show for kids and grown-ups alike!<br/><br/>\r\nWhat could go wrong?<br/><br/>\r\nAs the new security guard working nights, your job is to monitor cameras and make sure nothing goes wrong after-hours. The previous guard has complained about the characters trying to get into the office (he has since been moved to day-shift). So to make your job easier, you've been provided with your very own empty Freddy Fazbear head, which should fool the animatronic characters into leaving you alone if they should accidentally enter your office.<br/><br/>Then in Five Nights at Freddy's 3. Thirty years after Freddy Fazbear's Pizza closed its doors, the events that took place there have become nothing more than a rumor and a childhood memory, but the owners of \"Fazbear's Fright: The Horror Attraction\" are determined to revive the legend and make the experience as authentic as possible for patrons, going to great lengths to find anything that might have survived decades of neglect and ruin.<br/><br/>\r\nAt first there were only empty shells, a hand, a hook, an old paper-plate doll, but then a remarkable discovery was made...<br/><br/>And finally in Five Nights at Freddy's 4 the last chapter of the Five Nights at Freddy's original story, you must once again defend yourself against Freddy Fazbear, Chica, Bonnie, Foxy, and even worse things that lurk in the shadows. Playing as a child whose role is yet unknown, you must safeguard yourself until 6 am by watching the doors, as well as warding off unwanted creatures that may venture into your closet or onto the bed behind you.<br/><br/>\r\nYou have only a flashlight to protect yourself. It will scare away things that may be creeping at the far end of the hallways, but be careful, and listen. If something has crept too close, then shining lights in its eyes will be your end.<br/><br/>As always, Fazbear Entertainment is not responsible for death or dismemberment.", "metacritic": null, "released": "2020-10-29", "tba": false, "updated": "2020-10-30T02:04:35", "background_image": "https://media.rawg.io/media/screenshots/1c0/1c0e7aac17aa7515cb69af3febaa90fd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 242, "game_series_count": 0, "reviews_count": 0, "platforms": ["Xbox One"], "developers": [], "genres": [], "publishers": [], "esrb_rating": null}