{"id": 511538, "slug": "clash-of-dots-1v1-rts", "name": "Clash of Dots - 1v1 RTS", "name_original": "Clash of Dots - 1v1 RTS", "description": "Clash of Dots is a quick and addictive real-time strategy. <br/><br/>Your ultimate goal is to capture all enemy’s cells in the arena. Upgrade buildings, gather the army of dots &amp; send the troops to seize the neutral or rival cells. Believe that’s won’t be that easy!<br/><br/>USE MULTIPLE TACTICS<br/>Start a level with launching a full-scale attack or provoke your enemy to waste cells by making the first move. Defend your dots &amp; fight back to take control of the exhausted cells. There are numerous ways to win in this minimalistic strategy game.<br/><br/>BEAT TOUGH OPPONENTS<br/>You need to be really smart and react quickly to battle the foes. Use strong logic, advanced strategy &amp; tactics to win the cell expansion wars. The smart AI won’t give you a second’s respite. <br/><br/>UPGRADE YOUR ARMY<br/>Wanna look cool in the battle arena? Spend coins to buy bright skins for your defence buildings, attacking towers &amp; fearless fighters. <br/><br/>DON’T LOSE <br/>Try to win PvP battles &amp; pass levels at one dash to get increased rewards. Don’t give up or lose, or all the coins you’ve earned in the previous cell expansion wars will be lost! <br/><br/>Solve challenging puzzles and win tough 1v1 battles in one of the best offline casual war games!", "metacritic": null, "released": "2020-07-26", "tba": false, "updated": "2020-10-30T02:15:06", "background_image": "https://media.rawg.io/media/screenshots/57b/57b4a833c14b01fb730c947b5f5d51b1.jpg", "website": "https://azurgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 38, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["AI GAMES FZ"], "genres": ["Strategy", "Casual"], "publishers": ["AI GAMES FZ"], "esrb_rating": "Everyone 10+"}