{"id": 511524, "slug": "space-decor", "name": "Space Decor", "name_original": "Space Decor", "description": "Welcome to the design studio and show your design talent here to decorate different houses!<br/><br/>As a young designer, you dream to become one of the best architecture in the world. One day, you met the greatest architecture in the design circle, and your legendary stories get started!<br/><br/>Here are tons of decorations for you to choose from: Mediterranean style, European style, Modern minimalist style and so on. It’s all up to you to design the houses. From apartment to villa, restaurant to hotel, your work will cover all over the world. It sounds great, does it?<br/><br/>Except choose the decorations, beat the match-3 levels is another mission for you. Here are many delicate levels waiting for you! Switch, match and crush hundreds of tiles to challenge funny puzzles and make high scores with your families and friends!<br/><br/>-HOW TO PLAY-<br/>●Swap to match 3 or more similar tiles in a line to crush them.<br/>●Make a square of four to create the paper plane.<br/>●Match 5 or more to create amazing boosters<br/>●Find different kinds of powerful combos is the key to solve puzzles and beat the levels.<br/>●Beat the levels to get more coins which are the necessary sources to buy decorations<br/>●Choose the styles you like and become the greatest designer in your friends<br/><br/>-FEATURES-<br/>●Completely free game to play;<br/>●Many houses are waiting for you designing;<br/>●Various interesting events in every week;<br/>●Vivid character and attractive detective story;<br/>●Play with your families and friends and share your works;", "metacritic": null, "released": "2020-10-22", "tba": false, "updated": "2020-10-30T02:09:55", "background_image": "https://media.rawg.io/media/screenshots/bb0/bb08c73f6b0560de53afe020c5dc0198_fT3nVIu.jpg", "website": "http://www.zygogogo.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 135, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["ZYMobile"], "genres": ["Casual", "Puzzle"], "publishers": ["ZhangYuan Mobile Co"], "esrb_rating": "Everyone 10+"}