{"id": 511521, "slug": "chess-online-3", "name": "Chess Online +", "name_original": "Chess Online +", "description": "Play Chess Online + with more than 1.000.000 registered players worldwide. ChessFriends.com app is the perfect tool for everyone, ranging from amateurs and children to pro players and grandmasters.<br/><br/>Features:<br/>- Big international community, chess multiplayer - More than 1.000.000 registered players on http://www.chessfriends.com<br/>- Various time control options - Classic, Blitz and Bullet chess games<br/>- Rated games - Track your rating and performance<br/>- Rankings and detailed statistics with charts<br/>- Player account - User profiles with real FIDE rating<br/>- Access your account from various platforms, including web browsers and mobile devices<br/>- Multiple languages supported<br/>- Compatible with iPhone, iPad, iPod Touch<br/>- Track your progress with ELO rating and experience levels<br/>- Elaborate friends system and chat to keep you in touch with friends / favourite opponents<br/>- Entertaining achievements with bonus rewards<br/>- VIP Membership<br/><br/><br/>VIP Membership Subscription* Options:<br/>- Monthly VIP Subscription for $5.99 per month<br/>- Yearly VIP Subscription for $33.99 per year<br/><br/>VIP Membership features: <br/>- VIP Member icon<br/>- No game fees with 0 gold bet (unlimited play)<br/>- Big game profits<br/>- No Ads<br/><br/>• Payment will be charged to your iTunes account at confirmation of purchase.<br/>• Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period.<br/>• Account will be charged for renewal within 24hours of the end of the current period, and the cost of the renewal will be provided.<br/>• Subscriptions may be managed by the user. Auto-renewal may be turned off by going to the user’s Account Settings after purchase.<br/>• No cancellation of the current subscription is allowed during active subscription period.<br/>• Privacy Policy and Terms of Use: http://chessfriends-data.s3.amazonaws.com/terms-and-privacy-policy/ios/en.html<br/><br/>* Actual charges might be converted to local currency depending on your country of residence.", "metacritic": null, "released": "2014-08-26", "tba": false, "updated": "2020-10-30T02:08:52", "background_image": "https://media.rawg.io/media/screenshots/868/868d1f32c4665b71d5057cc54f47963b.jpg", "website": "https://www.chessfriends.com", "rating": 0.0, "rating_top": 3, "added_by_status": {"owned": 12, "toplay": 5}, "playtime": 0, "achievements_count": 0, "ratings_count": 5, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 5, "platforms": ["iOS"], "developers": ["Entertainment 4Media"], "genres": ["Strategy", "Sports", "Board Games"], "publishers": ["Entertainment 4Media"], "esrb_rating": "Teen"}