{"id": 511531, "slug": "extreme-car-crash-game-2020", "name": "Extreme Car Crash Game 2020", "name_original": "Extreme Car Crash Game 2020", "description": "Going fast with no limits or in other words running after the crooks, just like in Police traffic Race hot Pursuit. This Crazy cop driver, crazy thief pursuit is well suited for your needs, which will allow you to drive from a wide range full of powerful police cars and do some insane stunts. Off course this stunning game will provide you all thrilling like driving fast, boost, drift, roll, jump, and crash the criminal car in our all new NY city police car chase simulator 2019. Probably the best car driving simulator you'll play with endless action and super-fast police driving, which you might have You've never observed in any other police chase games with this much detail!<br/><br/>Prove yourself to be the best police officer and crazy stunt driver in this Police car crash drive 2019 where you don't need to use brakes, just nitro boost your police super cars onto so many of unique stunts and tricks. Real Fast police car chase will allow you to choose from a wide choice of police vehicles and drive wherever you want. Also as a police cop driver, you will have to perform some special duties like chasing the criminal cars either to stop or bust them all.<br/><br/>In Miami Gangster police car crash simulator you'll get amazing experience of realistic car damage by hitting into obstacles and crashing criminal cars to see full body damage. We need you to lay down the law and patrol the city putting a stop to the madness and taking pursuit of the criminals! High speed police wali games 2019 have never been this intense! Patrol the streets in your police car and chase reckless criminals driving fast to police car chase, bust them or get busted.<br/><br/>Police Car crash 2019: 3D Cops car chase Features:<br/>- High speed police chases!<br/>- Smooth &amp; realistic car controls<br/>- Realistic vehicle damage with real physics<br/>- crash through obstacles to bust criminals!<br/>- Lots of traffic driving around the city!<br/>- Unlock multiple super fast police cars!", "metacritic": null, "released": "2019-12-19", "tba": false, "updated": "2020-10-30T02:12:25", "background_image": "https://media.rawg.io/media/screenshots/df6/df6bc184888fe70fb7a23c9ae79c0ef9.jpg", "website": "http://monstergamesproductions.com.au", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 193, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Monster Games Productions"], "genres": ["Simulation", "Racing"], "publishers": ["Monster Games Productions"], "esrb_rating": "Everyone 10+"}