{"id": 511634, "slug": "hordecore", "name": "HordeCore (itch)", "name_original": "HordeCore (itch)", "description": "<p>HordeCore is a kick-ass action side-scroller set in a post-apocalyptic world. Become the leader of an ever-expanding group of survivors. Manage supplies, upgrade your team, and craft deadly contraptions to defend yourself! Remember, exploration is vital in this harsh new world. Prepare to forge bizarre alliances and, together, face the many dangers of the wastelands. Take survival gameplay, combine it with base management, add RPG elements, and spice it up with a fully-fledged collectible card game - and you get HordeCore! <br/></p>\n\n<ul><li>SURVIVE through the hardships of a zombie-infested apocalyptic world!</li><li>UPGRADE AND DEFEND your team's safe haven!</li><li>EXPLORE the vast wastelands through randomly generated environments!</li><li>WAGE WAR against endless hordes of undead and living threats!</li><li>LOOT UP and collect rare materials to craft outstanding weapons!</li><li>TEAM UP with your friends and face the world of HordeCore in Co-op Mode!</li></ul>\n\n\n<p>[b]Collect unique survivors[/b] and strategically pick your team of apocalypse-hardened characters to fight through the outstanding number of living dead trying to get your brains for a snack. [b]Keep your base camp[/b] safe and develop your defenses while growing a community of bad-asses that you can command into the constant fight for survival. [b]Explore the wastelands[/b] in search of supplies. Face the unexpected dangers of the zombie-apocalyptic world of [b]HordeCore[/b]!</p>\n\n\n<p>Besides all the zombie-killing and loot-grabbing you can handle, HordeCore also includes a complete, fully-featured Collectible Card Game!</p>\n<p>Horde Tactics is a deck-building card game, featuring 60+ cards that you'll gather and unlock during your time in the Wasteland. Each card represents an item, character, or a Hordeling that you encounter in the game—that way, your collection grows alongside your progress in HordeCore! </p>\n<p>Horde Tactics features:</p>\n<p>* Easy to pick up gameplay </p>\n<p>* Over 60 cards available<br/></p>\n<p>* Power up your deck by building synergy combos </p>\n<p>* Best part... it's entirely optional!<br/></p>", "metacritic": null, "released": "2020-10-29", "tba": false, "updated": "2024-03-02T17:35:11", "background_image": "https://media.rawg.io/media/screenshots/f8f/f8f81960cf2f207bdacc3ad96ceee6fc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "toplay": 1, "dropped": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 331, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["MetaPub"], "genres": ["Shooter", "Adventure", "RPG"], "publishers": [], "esrb_rating": null}