{"id": 51176, "slug": "leisure-suit-larry-3-passionate-patti-in-pursuit-2", "name": "Leisure Suit Larry 3 - Passionate Patti in Pursuit of the Pulsating Pectorals", "name_original": "Leisure Suit Larry 3 - Passionate Patti in Pursuit of the Pulsating Pectorals", "description": "<p>Passionate Patti in Pursuit of the Pulsating Pectorals! is the third game in Al Lowe&#39;s Leisure Suit Larry series. Larry Laffer has finally found the woman of his dreams, and can happily live with her together on the beautiful tropical island... until he gets thrown out of the house by his wife. His boss, who happens to be his (now ex-) father-in-law, fires him. Larry is all alone, without a woman, without a job, on an island that has long ceased to be a &quot;tropical paradise&quot; and is exploited by entertainers, lawyers, and alike. But never despair! Dressed in his irresistible leisure suit, Larry is about to conquer the world (or at least its female population) anew. Watch out, fairer sex, because Larry is back to his swinging self!<br />\n-   A classique text-based adventure as the previous entry in the series<br />\n-   Play in the second half of the game as the enigmatic and beautiful pianist Patti, helping them to reach an ending that will finally bring happiness into Larry&#39;s life.<br />\n-   Play as one of gaming’s longest lasting legends: Leisure Suit Larry!<br />\n-   Al Lowe’s famously risque humor and bodacious babes that are waiting to “work out” with you!</p>", "metacritic": null, "released": "1989-11-17", "tba": false, "updated": "2023-12-18T17:37:44", "background_image": "https://media.rawg.io/media/screenshots/5d8/5d89e3ef78840103848e59d631cfc431.jpg", "website": "", "rating": 3.21, "rating_top": 3, "added_by_status": {"yet": 31, "owned": 501, "beaten": 15, "toplay": 3, "dropped": 6}, "playtime": 1, "achievements_count": 0, "ratings_count": 24, "suggestions_count": 325, "game_series_count": 11, "reviews_count": 24, "platforms": ["PC", "Commodore / Amiga"], "developers": ["Assemble Entertainment", "Sierra On-Line"], "genres": ["Adventure"], "publishers": ["Sierra On-Line", "Assemble Entertainment"], "esrb_rating": null}