{"id": 51170, "slug": "mr-prepper", "name": "Mr. Prepper", "name_original": "Mr. Prepper", "description": "<p>Mr. Prepper is about to be preppered. You know something is wrong, the risk of a nuclear war is in the air and you need to be prepared for what&#39;s comming. They promised freedom but dealing with your paranoid government is just another day in this survival crafting game;<br />\n- Build an underground shelter<br />\n- Craft machines that can keep you alive; farms, greenhouses, tools, vehicles etc.<br />\n- Trade with neighbors, give them what they need, get what is useful to you<br />\n- Make a plan, you need to get out of this country<br />\n- Beaware of the secret police, they don&#39;t want you to be prepared, they want you to stay in their control<br />\nMr. Prepper is the guy who live in a country which once was the land of freedom but step by step its government changed everything. If you don&#39;t obbey - you dissapear. Be as they want you to be or be gone. Our hero decided to opose, to get out of this delusion of life. The only way for him to hide his plans and his doings is to build an underground shelter and construct a machine that helps him get out across the border. But he will need materials, materials so rare in this world - help him get them, help him escape without being discovered.<br />\n- Craft<br />\n- Trade<br />\n- Survive<br />\n- Get out of there</p>", "metacritic": null, "released": "2021-03-19", "tba": false, "updated": "2023-12-24T18:12:50", "background_image": "https://media.rawg.io/media/screenshots/b09/b09617645c68ec6508a4068d9a913b34.jpg", "website": "", "rating": 3.12, "rating_top": 3, "added_by_status": {"yet": 22, "owned": 200, "beaten": 10, "toplay": 19, "dropped": 23, "playing": 4}, "playtime": 2, "achievements_count": 179, "ratings_count": 34, "suggestions_count": 243, "game_series_count": 0, "reviews_count": 34, "platforms": ["PC"], "developers": ["Rejected Games"], "genres": ["Action", "Adventure", "Simulation", "Indie"], "publishers": ["PlayWay"], "esrb_rating": null}