{"id": 511724, "slug": "autumn-leaves-kyanite-heart", "name": "Autumn Leaves (Kyanite Heart)", "name_original": "Autumn Leaves (Kyanite Heart)", "description": "<p>Autumn Leaves is a crafting and exploration game. Explore the world and find obelisks that unlock memories. Build crazy machines to escape the strange world you're stuck in.</p>\n<p>The game takes around an hour or two to complete and it only has one ending. The game auto-saves often and it auto-loads when you open it again.</p>\n<p>I also made a video on how I made the game which you can watch here!</p>\n<p>CW: The game contains a small amount of flashing imagery.<br/></p>\n<p>\n</p>\r\nFeatures\r\n<p> 10 Different Machines.<br/>\r\n 9 Different Items.\r\n<br/>\r\n A Spooky Story.\r\n<br/>\r\n A Cute Ghost Kitty.\r\n<br/>\r\n A Lot of Dead Leaves. <br/></p>\r\nHelp\r\n<p>If you're stuck in the game or having trouble with certain mechanic, then here's a list of the controls and mechanics:</p>\n<ul><li>You can destroy trees, graves, and tombstones by holding the <em>right mouse button</em> on them.</li><li>You can open the ghost's crafting menu by pressing <em>E</em> while hovering your cursor over the ghost.</li><li>You can open a machine's menu by holding your cursor over it and pressing <em>E</em>.</li><li>You can activate obelisks to unlock more recipes by hovering your cursor over them and clicking the <em>right mouse button</em>.</li><li>You can interact with Koshak (the ghost cat) by hovering over them and pressing <em>E</em>.</li><li>You can drop items from your inventory by hovering your cursor over a certain slot and pressing the <em>right mouse button</em>.</li><li>Connect a machine that makes power to a machine that needs power by holding your cursor over the power machine while it's menu is open and press <em>C</em>. Then hold your cursor over the machine you want to connect it to and press <em>C</em> again. Do the same to disconnect them.</li><li>Input boxes are always on the left side of the machine's menu. Click them with the <em>left mouse button</em> to add items or click it with the <em>right mouse button</em> to withdraw.</li><li>Output boxes are always on the right side of the machine's menu. Click it with the <em>left mouse button</em> to collect however many items it contains.</li><li>Hold <em>escape </em>to close the game.</li><li>The game auto-saves and auto-loads.</li></ul>\r\nCredits\r\n<p>Programming, art and music by Kyanite Heart (me).<br/>Sound effects are mostly from freesound.org.<br/>Thanks to Waffleflower and my girlfriend for testing the game.<br/></p>\n<p> - Koshak the kitty wishes you good luck!</p>", "metacritic": null, "released": "2020-10-29", "tba": false, "updated": "2020-10-30T02:59:40", "background_image": "https://media.rawg.io/media/screenshots/bdb/bdb07e255626abd7d9d5d78af889b3d8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 35, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["Kyanite Heart"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}