{"id": 511761, "slug": "crazy-halloween", "name": "Crazy Halloween", "name_original": "Crazy Halloween", "description": "<p>Crazy Halloween, dodge the cute ghosts and get the highest score.</p>\n<p>You must hold out as long as possible without the crazy ghosts catching your pumpkins,<br/>showing your skills in this cute game for the Halloween holiday.</p>\n<p>Just press one side or the other of the screen to make the pumpkins turn, and so on<br/>be able to avoid getting caught.</p>\n<p>Each ghost you avoid will add you a point, get the highest score !!!</p>\n<p>Ghosts behave differently, some will go faster, others slower,<br/>some will zig zag and some will go straight, skip them all.</p>\n<p>Nice graphics for all ages, even the smallest of the house will enjoy<br/>with Crazy Halloween.</p>\n<p>Original soundtrack by Guillermo Cañete, which will make you enjoy this even more<br/>game on the holiday of Halloween.</p>\n<p>In Crazy Halloween you will find:</p>\n<p>- Nice cartoon graphics for all audiences<br/>- One touch gameplay<br/>- B.S.O. Original by Guillermo Cañete<br/>- Fast and fun games for all ages<br/>- Set on the Halloween holiday<br/>- Free game</p>\n<p>Play and enjoy Crazy Halloween as a family !!!</p>\n<p>---------------------------------------------------------------------------------------------------</p>\n\n<p>Crazy Halloween, esquiva los simpáticos fantasmas y consigue la máxima puntuación.</p>\n<p>Debes aguantar el máximo tiempo posible sin que los alocados fantasmas atrapen tus calabazas,<br/>demostrando tu hablidad en este simpático juego para la festividad de Halloween.</p>\n<p>Basta con pulsar a un lado u otro de la pantalla para que las calabazas giren, y así<br/>poder evitar ser atrapado.</p>\n<p>Cada fantasma que evites te sumará un punto, consigue la máxima puntuación!!!</p>\n<p>Los fantasmas se comportan de manera diferente, unos irán más rápido, otros más lentos,<br/>algunos harán zig zag y otros irán en línea recta, esquívalos a todos.</p>\n<p>Gráficos simpáticos para todas las edades, hasta los más pequeños de la casa disfrutarán<br/>con Crazy Halloween.</p>\n<p>Banda sonora original de Guillermo Cañete, que hará que disfrutes todavía más de este<br/>juego en la festividad de Halloween.</p>\n<p>En Crazy Halloween encontrarás:</p>\n<p>- Simpáticos gráficos cartoon para todos los públicos<br/>- Jugabilidad de un solo toque<br/>- B.S.O. Original de Guillermo Cañete<br/>- Partidas rápidas y divertidas para todas las edades<br/>- Ambientado en la festividad de Halloween<br/>- Juego gratis </p>\n<p>Juega y disfruta en familia de Crazy Halloween!!!</p>", "metacritic": null, "released": "2020-10-29", "tba": false, "updated": "2020-10-30T03:07:27", "background_image": "https://media.rawg.io/media/screenshots/850/850e00c8b941dffe86256a77f84bcf6d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 66, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Ixel Games"], "genres": [], "publishers": [], "esrb_rating": null}