{"id": 51181, "slug": "stack-gun-heroes", "name": "Stack Gun Heroes", "name_original": "Stack Gun Heroes", "description": "Note: Wishlist this game to be notified when it releases.<br/>Stack Gun Heroes is a first person shooter where you improvise guns in combat.<br/><br/><br/><br/>Features<strong>Invent overpowered weapons</strong> to defeat enemies and solve problems.  Make machine gun rocket launchers, remote nukes, lightning lassos, and much much more.  One player even invented a gun that lets him fly.<br/><br/><strong>Collect superpowers</strong> and find the most broken ways to use them.  Most powers let you break the rules of the game in some way.  Since powers are randomly generated, your strategies are unique.  When someone sees you exploit a power, they know you came up with that idea yourself.<br/><br/><strong>Design a massive base</strong> that processes your loot.  Choose where to put walls and floors by shooting them onto your base with the Stack Gun.  Once constructed, your base produces rare ammo and resources that can be used to further increase your power.<br/><br/><strong>Play with friends in co-op.</strong>  The game is designed for 1-4 players, but there is technically no limit as long as your computer is fast.<br/><br/><strong>Compete with friends in PVP.</strong>  Though not the focus of the game, PVP let's you test your gun designs against other players or compete in scenarios with preset loadouts.<br/><br/><strong>Test yourself in challenge maps</strong> where you run obstacle courses, break targets, race your friends, and more.<br/><br/><strong>Do badass walljumps and wallslides</strong> to get around faster.  Each one gives a slight boost, so the fastest route is not always a straight line.  Usually it's the awesomest line.<br/><br/><strong>Find secrets and achievements.</strong>  Collectibles aren't just strewn accross hundreds of tedious locations, they usually require some kind of skill or smart stacking to get.<br/><br/><strong>No max difficulty.</strong>  Tougher enemies don't just have more health.  They carry more complex weapons and behave differently.  Of course, sometimes they WILL have more health, so still be ready for that.. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .I spent over 5 years and 12,000 hours working on this project and it's almost ready.  Stack Gun Heroes is my dream game.  Hopefully it's yours too!<br/><br/>-Unstackd", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:03:09", "background_image": "https://media.rawg.io/media/screenshots/a90/a9037abc2e22c34bc4a321ad149e4ad2.jpg", "website": "http://www.stackgunheroes.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 379, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC", "Linux"], "developers": ["Unstackd"], "genres": ["Action", "Indie"], "publishers": ["Team Stack Studios"], "esrb_rating": null}