{"id": 512019, "slug": "redds-runaway-demo-version", "name": "Redd's Runaway - Demo Version", "name_original": "Redd's Runaway - Demo Version", "description": "<p><strong>DEMO VERSION</strong></p>\n<p><strong>Through the demo version, you will be able to play the first level in both Arcade Mode and Endless mode!</strong></p><p>You can find the full version at https://bewolf-studio.itch.io/redds-runaway</p>\n<p>=========================</p>\n<p><strong>This is a tale about pain, suffering, and vengeance; about hope, compassion, and mercy.\r\n</strong>\n</p>\n\n<p>Inspired by the Red Ridding Hood's tale, Redd's Runaway is a run and gun action game, combining a frenetic playstyle with an aesthetic reminiscent of the traditions of Halloween and the Day of the Dead, in a short experience aiming for a great replayability.</p>\n<p>\n</p>\n<p>\n</p>\n<ul><li>A run and gun 2D game, inspired by classics like Megaman X, The Adventures of Batman and Robin (Mega Drive) and Ghost n' Goblins.</li><li>Get inmersed into a world infused with the Halloween and the Day of the Dead mythos, where ghosts, monsters and demons appear at every step.</li><li>6 worlds, each one full of enemies and a level boss.</li><li>Obtain new weapons and switch between your arsenal in real time, as you develop your own strategies to surpass this nightmare.</li><li>Different game modes, like Arcade, Endless, and Boss Rush.</li><li>Discover a story about revenge, when the sorceress Redd must stop an Underworld invasion in Brock City.</li></ul>\n<ul>\n</ul>\n<p>\n</p>\n<p>Redd was an orphan adopted by a master sorceress when she was just a baby. She has learned a few spells specialized in offensive tactics, to protect other people from supernatural menaces. She believes that life, as is, is chaotic enough, and is willing to help others in need against the creatures of the Underworld. After joining the Legion of Sorcerers in her adulthood and starting her training, tragedy struck her life when an unknown attacker killed her mother. With a scar as a reminder of the event, Redd suffered a deep trauma, which left her confused and depressed, pushing away her best friends and teammates.</p>\n<p>When Brock City is under invasion, she will use everything she learned to fight along the Legion and defend the innocent, learning new spells in her way to stop this nightmare. But this event may put her abilities and strength at test until its last consequences: moreso, her true believings.</p>\n<p><strong>Join Redd's journey to stop this supernatural invasion and the mind behind this nightmare.\r\n\r\n</strong></p>\n<p>\n</p>\n<p>Minimum System Requirements:</p>\n<ul><li>OS: <strong>Windows 8 or higher 64 bits\r\n</strong></li><li>Processor: <strong>Intel Core i5</strong></li><li>Memory: <strong>4GB RAM</strong></li><li>Graphics: <strong>Dedicated graphics card (OpenGL 3.0 support or higher)</strong></li><li>Storage: 1<strong>00 MB available space</strong></li></ul>\n<p><strong>Subtitles: English, Spanish.\r\nController support.\r\n</strong></p>\n<p><strong>Royalty Free soundtrack courtesy of White Bat Audio.\r\n</strong><strong>Redd's Runaway Main Theme by White Bat Audio.</strong></p>", "metacritic": null, "released": "2020-10-28", "tba": false, "updated": "2020-10-30T04:03:28", "background_image": "https://media.rawg.io/media/screenshots/62e/62e8dd34c3e20d86b1139117a0e3f412.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 214, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BeWolf Studio"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}