{"id": 512040, "slug": "later-daters-the-series", "name": "Later Daters: The Series", "name_original": "Later Daters: The Series", "description": "Move to a Retirement Community\r\n\n<p>You’re the newest resident at Ye OLDE retirement community, where you’ll meet a cast of sexy seniors who are all dying (not literally) to meet you. It’s a lot like summer camp, but with orthopedic shoes, bridge clubs, and more jell-o. It’s an adjustment as you settle in, but who knows: maybe these will turn out to be the best years of your life!\r\n</p>\n<p>\n</p>\r\nMeet Cute Silver Foxes\r\n<p>Adventure, passion, and transformation are not experiences reserved for the young. Later Daters portrays the aging process as a rollicking romp and reminds us of what the elderly can teach us about our capacity for love.\r\n</p>\n<p>\n</p>\r\n... And Date Them\r\n<p><em>Remember if the chairs are a-rockin' don't come a-knockin!</em></p>\n\r\nGameplay Features:\r\n<ul><li>Play as a sexy senior! Customize your look, name, romance history, and gender.</li><li>Have some intimate adventures that deal with mortality, vulnerability, and getting some action.</li><li>Enjoy LGBTQ inclusive romance and poly relationship options.</li><li>Pick your favorite companion creature : A cat, a dog... Or a robot?</li><li>Date and flirt with eight fetching residents of Ye OLDE...</li></ul>\r\nPart 1\r\n<p>Welcome to the Ye OLDE Retirement Community. Time to move in, get settled, and meet your new neighbors.  Your first three days is packed full of adventures and sentimental moments, and soon you'll learn that it's never too late for love.</p>\r\nPart 2\r\n<p>Something is brewing at Ye OLDE… is the happy family of friends you’ve made headed for splitsville? It’s up to you to keep everyone together or bring on the drama. Whatever you choose, you’re in for a helluva ride.<br/></p>\n<p>Includes Episodes 4-7!</p>\n<ul><li>Will Blair give up his shenanigans ? (Spoiler: he will not.)</li><li>Might Jax write you a customized tune?</li><li>Does Esther micro-manage herself into a torrid love affair?</li><li>How well do you really know the mysterious Albert and his chatterbox cockatoo?</li><li>All this and more in Later Daters Part Two!</li></ul>\r\nPlus our Cribbage Mini-Game!", "metacritic": null, "released": "2020-10-28", "tba": false, "updated": "2020-10-30T04:07:41", "background_image": "https://media.rawg.io/media/screenshots/ded/ded67c4e052c0102d6d3f3169434c5a1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 162, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Bloom Digital Media"], "genres": [], "publishers": [], "esrb_rating": null}