{"id": 51200, "slug": "arena-of-valor", "name": "Arena of Valor", "name_original": "Arena of Valor", "description": "<p>Build the ultimate team with your friends to crush your opponents in the most popular MOBA game!</p>\n<p>Explore and command a roster of over 39 fearless heroes, with roles including Tank, Assassin, Mage, Support, Warrior and Marksman. First Blood, Double Kill, Triple Kill and all the features MOBA fans know and love will be included. Discover and dominate all the gameplay modes, including 5v5, 3v3, 1v1, and a unique “Hook Wars” mode that will challenge your skills and prove your hero as a true champion!</p>\n<p>Features:</p>\n<ul>\n<li>Classic 5v5 MOBA<br />\nCarve your way through jungles, lanes, and towers, draw first blood and destroy the enemy Core. Intuitive controls will have you racking up kills with ease and make you an MVP in no time!  </li>\n<li>Got What It Takes? Free to Play Forever -<br />\nIn Arena of Valor, it’s all about skill. We strive to create the most riveting and balanced gameplay, so you can turn the tide of battle and vie for glory no matter the odds. Win or lose, every action counts!  </li>\n<li>Growing Number of Legendary Heroes -<br />\nExplore and command a roster of over 39 fearless heroes and counting, including a variety of Tanks, Assassins, Mages, Support, Warriors, and Marksmen. Build the perfect team to crush your opponents in battle!  </li>\n<li>Play with Your Friends in Quick Pace Matches -<br />\nTeam up with your friends, guild buddies or players all around the world in an instant. Carry your team to victory in quick pace and intensive matches.</li>\n</ul>", "metacritic": null, "released": "2015-11-26", "tba": false, "updated": "2023-03-07T17:23:45", "background_image": "https://media.rawg.io/media/games/aaf/aaf7777c82c127abf495557ee1c9b9f6.jpg", "website": "https://sok.proximabeta.com", "rating": 3.93, "rating_top": 4, "added_by_status": {"yet": 1, "owned": 11, "beaten": 2, "toplay": 1, "dropped": 16, "playing": 7}, "playtime": 0, "achievements_count": 0, "ratings_count": 14, "suggestions_count": 548, "game_series_count": 0, "reviews_count": 14, "platforms": ["Nintendo Switch", "Android", "iOS"], "developers": ["Tencent Games", "Tencent"], "genres": ["Action", "RPG"], "publishers": ["Tencent Games", "PROXIMA BETA PTE.LIMITED", "Tencent"], "esrb_rating": "Teen"}