{"id": 51210, "slug": "witchball", "name": "Witchball", "name_original": "Witchball", "description": "<strong>Witchball</strong> is a post-reality racing game played by children in the year 2601. Massive environmental change has made much of the world inaccessible, and long-distance travel impossible. Communities are isolated, but communication has advanced to the point where short distances between people barely exist at all.<br/><br/>In Witchball, two players compete in a high speed foot-race while simultaneously playing a 2D pong-like ball game on the surface of the screen. Points are gained in both aspects and tallied per lap, so it’s important -- and tricky -- to manage the space better than the opponent.<br/><br/><strong>** LOCAL MULTI-PLAYER ONLY **</strong><br/><br/><strong>FEATURES:</strong><br/><ul><li> 1v1 Competitive Racing (Two XBOX controllers recommended, at least one is required for controller share)<br/></li><li> Challenging volleyball-like gameplay -- play on both you and your opponent's cameras!<br/></li><li> Four different courses with varying modes, for a total of 9 Tracks<br/></li><li> 8 Different Special Abilities</li></ul><br/><br/>~*~<br/><br/>Originally used for fishing, glass buoys became associated with witches during witch-hunts in the late 1600s. Traditionally, a ‘witch ball’ is a glass orb hung in a home to ward away bad or evil spirits. The act of play, and games by extension, can function in a similar way -- kind of like a respite from the darkness. Games won’t solve any problems, and neither will a ward, but safeguards and rest are necessary parts of life and games can provide that. A game as a ward, not an escape.<br/><br/>Have fun!", "metacritic": null, "released": "2018-01-02", "tba": false, "updated": "2019-08-28T17:05:04", "background_image": "https://media.rawg.io/media/screenshots/925/9250e5d576d0c07b486c2b9df4350430.jpg", "website": "http://twentycapitalletters.com/Witchball", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 12}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 288, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Stephen Lawrence Clark"], "genres": ["Action", "Sports", "Racing", "Indie"], "publishers": ["Independent"], "esrb_rating": null}