{"id": 51213, "slug": "bad-dream-fever", "name": "Bad Dream: Fever", "name_original": "Bad Dream: Fever", "description": "The world has lost its natural colors, an unknown plague has gathered its cruel harvest. The city seems to be completely empty and dead, but in its every corner there are manifestations of fear, sorrow, frustration, misunderstanding, loneliness and suffering. The situation looks hopelessly, but not everything is lost yet...<br/><br/>Enter the feverish dream and experience its abstract world. Recognize the degradation of your environment and adapt to it. Act with caution. There is a malicious virus waiting for you at each step, which purpose is to remove you from this infected and imperfect sleep.<br/><br/>Keep an open mind and be prepared for anything. Expect an enemy in the person who you would least expect it. If you feel betrayed, remember that a fever can change a strong, healthy person into a complete wreck. An infected mind loses common sense and the ability to assess the situation.<br/><br/>Attempt to save at least one person. Remember, sometimes 100% effort is still not enough. Don't let the fever infect your mind. Don't make the same mistake as others...<br/><br/><strong>Game features:</strong><br/><br/>- The climate of a world resembling sleep during a fever.<br/><br/>- Creative riddles requiring an unconventional approach.<br/><br/>- A sincere and complex story told from the depth of the author's heart.<br/><br/>- Refined locations, full of intense, suggestive climate.", "metacritic": null, "released": "2018-09-12", "tba": false, "updated": "2024-03-29T13:44:24", "background_image": "https://media.rawg.io/media/screenshots/98e/98e11f696b44d06dda1352f5e57178ad.jpg", "website": "", "rating": 3.56, "rating_top": 5, "added_by_status": {"yet": 16, "owned": 136, "beaten": 11, "toplay": 9, "dropped": 1}, "playtime": 2, "achievements_count": 0, "ratings_count": 17, "suggestions_count": 214, "game_series_count": 0, "reviews_count": 18, "platforms": ["Nintendo Switch", "PC", "macOS"], "developers": ["Desert Fox"], "genres": ["Adventure"], "publishers": ["Forever Entertainment", "PlayWay", "Ultimate Games"], "esrb_rating": null}