{"id": 51212, "slug": "shadowcrawl", "name": "Shadowcrawl", "name_original": "Shadowcrawl", "description": "A classic for the next generation, Shadowcrawl is an attempt at taking one of gamings greatest and oldest genres and improving upon it with modern design principles. Modeled after 80's rogue-likes, Shadowcrawl stays true to the classic rogue gameplay while updating the formula with the depth found in modern games.<br/><br/>Set in a highly interactive \"Occult-Punk\" universe rooted heavily in Gothic literature and Pagan lore. Influence the world mechanics to completely change rules of level generation and other gameplay aspects. You can even go so far as to replace all in-game enemies and alter the rules of life and death itself!<br/><br/>HIGHLY DEVELOPED ROGUELIKE<br/>Fight over 100 different enemy types as you work your way through the dungeon, each with different ranks and roles. Defeat high ranking enemies quickly before they have a chance to mass an army for a counter-attack. Find secret bosses, rare-spawn monsters, and even replace weak in-game enemies with over-powered hidden enemies to forever change the face, and difficulty, of your game world. <br/><br/>Complete quests to add weapons, enemies, shrines and more to the level generator. Adding new items to the game as you go. Join powerful cults to gain new perks and powers. You can even worship some beings in secret without violating existing pacts, if you don't get caught.<br/><br/>Shadowcrawl is less about luck or collecting loot than it is strategy, not to say that luck and loot won't help along the way. Skills, perks and roles take on traits that let your character adapt more effectively to different features of the maze generator, forcing you to think strategically at all times about where you are standing and where you are going. Most players know many moves ahead of time if they are going to die once they learn how to read the battlefield. You are constantly being swarmed by hundreds, even THOUSANDS of enemies at a time must think on your feet to survive.DEEP CHARACTER BUILDING<br/>Shadowcrawl takes a strong focus on maintaining deep yet accessible character creation and development. Every possible build combination lends itself to a unique play-style and each build can even be re-geared on the fly to fulfill an entirely new role. Your choices, Gods, and allegiances throughout the game will also grant you access to new perks, abilities and more.<br/><br/>Mix &amp; Match Melee, Ranged, and Stealth specializations in different combinations to create builds with unique playstyles. A stealth-oriented mage can get up to 8 stealth-kills in a single attack if played cleverly. The game will also coerce you into playstyles based on your choices. As a Demon it is effective to play in an underhanded manner or should you turned a mindless monster then your character is forced to berserk or die.STEALTH<br/>Some perks and classes will grant your character the ability to hide in the shadows. This enhances the lighting effects and makes the player hard to detect or even undetectable in low lighting conditions. Sneak past tough enemies and perform devastating attacks from the shadows. Combine with the Assassin perk for powerful stealth damage bonuses.<br/><br/>COMPLEX INTERNALLY CONSISTENT OCCULT-PUNK UNIVERSE<br/>Shadowcrawl is a fully actualized universe with consistent internal mechanics that can all be discovered and interacted with. Including the fundamental forces of life and magic, what the NEXUS is, where each NPC came from, how they wound up in the dungeon, and more. Every question in the game can be answered if you look hard enough. Every one of these things can be interacted with. Should the player find and tamper with the God that governs the laws of life and death, then the laws of life and death in the game will change<br/><br/><br/><br/>The levels themselves are powered by technology that creates an actual infinite continuum of static game dungeons. These dungeons have been mathematically folded through higher dimensions to create a structure with a hyper-dimensional co-ordinate system...<br/><br/>...In other words the NEXUS really is a mathematically 10-dimensional space. It's not just lore, the NEXUS is an actual dungeon multi-verse.<br/><br/>Betraying the game-world mechanics can release terrifying secret enemies into your game. Things like killing the Omnipotent, collapsing dimensions in on themselves, or just generally warping space-time will unleash the deadly \"Glitch\" enemies into your game.<br/><br/>Unlike normal enemies, the \"Glitches\" can jump between your save files and show up in any universe for any character.<br/><br/>However they can be stopped. Killing \"Glitches\" you have freed will kill them for good, until you unleash some more.", "metacritic": null, "released": "2018-08-01", "tba": false, "updated": "2019-08-28T22:03:08", "background_image": "https://media.rawg.io/media/screenshots/c8d/c8dff24ece18d8f67c443c80ad1dc2f9.jpg", "website": "http://www.wickedcakegames.com/shadowcrawl.html", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 3, "achievements_count": 49, "ratings_count": 0, "suggestions_count": 118, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Wicked Cake Games"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Indie"], "publishers": ["Wicked Cake Games"], "esrb_rating": null}