{"id": 5122, "slug": "battle-poker", "name": "Battle Poker", "name_original": "Battle Poker", "description": "<p>Battle Poker is a family friendly card game in which players battle against the clock to make the best five card hands possible.<br />\nBattles are played across multiple rounds with points scored for each round based on the quality of the hands.<br />\nGame Modes:<br />\nShuffle Up and Deal With it:<br />\nRe-Arrange the cards into the best combinations of rows and columns to get the best scoring hands. Move to a card witj the D-Pad or Analog Stick and press the X Button, then select another card and press the X button again, The two cards will swap positions.<br />\nChain Reaction:<br />\nSelect a card with the D-Pad or Analog Stick and press the X Button to start a chain, then move to adjacent cards until tou have made (up to) a five-card hand. Once you’ve selected the last card in the chain, press the X Button to capture that hand.<br />\nPurchase or use of this item is subject to the PlayStation®Network Terms of Service and User Agreement. If you do not wish to accept all these terms, do not purchase or use this item. This item has been sublicensed to you by Sony Computer Entertainment America. One-time license fee for downloads to up to 2 console systems and 2 portable systems that are associated with the purchasing account.</p>", "metacritic": null, "released": "2009-07-20", "tba": false, "updated": "2023-04-07T06:37:13", "background_image": "https://media.rawg.io/media/screenshots/72b/72b955eea8006fbd7649701135ad5623.jpg", "website": "http://www.left.com/battlepoker/faqs/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 123, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "PSP", "Wii"], "developers": ["Left Field Productions"], "genres": ["Casual", "Puzzle"], "publishers": ["Left Field Productions"], "esrb_rating": "Everyone 10+"}