{"id": 512256, "slug": "rlg-jam-sub", "name": "RLG Jam Sub", "name_original": "RLG Jam Sub", "description": "<p>In True Game Jam fashion I accomplished about 1 / 100th of my total vision after I heard the theme.  Which was \"Create an Escape Room\".  So I did that just and I present to you my 3 day game of an escape room.</p>\n<p>A couple packs were used for set dressing credits found in game.</p>\n<p>If you remotely like this game or think its well made please check out my actual current game in development found here https://hulgarth.itch.io/gdm</p>\n<p>A few years ago when I first saw Epic's take on visual scripting with there blue prints I was immediately intrigued.  I have been coding for a long time and used some other visual languages like Visual Basic back in the day and always loved that style of programming.  So I had to learn Bps.  Ryan Layley the hose of this Jam was quickly found from some internet searching.  He has some top tier beginner tutorials on his channel that really helped me learn the engine and Bp's.  When I saw he was hosting a jam I felt like it was only good karma to try and participate.</p>\n<p>If you are interested in learning how to make games, I urge you to check out his you tube channel and get started.  You can easily make a game of the quality of this jam submission in a short time.</p>\n<p>Controls are listed on main screen and theirs a built in cheater tip if you get stuck.  I hope you enjoy the game and I hope everyone who participated had as much fun jamming as I did, if only I could learn to sleep less and get more done.<br/></p>", "metacritic": null, "released": "2020-10-27", "tba": false, "updated": "2020-10-30T04:51:27", "background_image": "https://media.rawg.io/media/screenshots/dff/dff90ba8ff64040159f81d35e169650d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 62, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["hulgarth"], "genres": [], "publishers": [], "esrb_rating": null}