{"id": 512456, "slug": "mission-luciferin", "name": "Mission Luciferin", "name_original": "Mission Luciferin", "description": "<p>This game is part of the Human Practices of AUC-EGYPT iGEM Team as its purpose is to communicate synthetic biology to the puplic.</p>\n<p>AUC-EGYPT (American University in Cairo) is participating for its very first time in the iGEM 2020 competition. Twelve brilliant and aspiring undergraduate students from diverse scientific backgrounds have allied in the love of Synthetic Biology, and they are ready to tug at the iGEM world's heartstrings. This year we're working on innovative COVID-19 therapeutics. We aim to design an efficient treatment method, leading to the therapy of COVID-19 Disease.We applied the contemporary methods of Synbio through toehold switches loaded with siRNA-targeting the replicase mRNA of SARS-CoV-2 to inhibit the virus replication cycle, which are then combined to be delivered with the aid of the Virus-Like Particle (VLP) system.</p>\n<p>The game was developed in partnership between AUC-EGYPT and AFCM-EGYPT.<br/></p>\n<p>Game Developer:<br/>Dalia El-Naggar</p>\n<p>Graphics: <br/>Hana Abdelzaher</p>\n\n\n<p>Content Developers:<br/>AFCM-EGYPT<br/>Rana Salah Khalel<br/>Salma Abou Elhassan<br/>Abdurrahman Radwan<br/>Ahmed Magdy Ghouneimy</p>\n\n<p>AUC-Egypt Team:<br/>Abd-Elrhman Elsadany <br/>Dr. Anwar Abdel Naser<br/>Kareem Kassab <br/>Mahmoud Mohamed Abdelgawad<br/>Mina Ashraf<br/>Mohamed Ashraf Abdelaeim Hassan</p>\n<p>Mohammed Salah AlFeky<br/>Mohammad Taha Monir<br/>Norhan Abdeldayem<br/>Sawsan Hisham Ali<br/>Yousef Eldemerdash</p>", "metacritic": null, "released": "2020-10-27", "tba": false, "updated": "2020-10-30T05:33:51", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["AUC-EGYPT-iGEM"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}