{"id": 512553, "slug": "dungeon-origins", "name": "Dungeon Origins", "name_original": "Dungeon Origins", "description": "Betrayed by the kingdom, the hero seeks his revenge as a new dungeon master! Build and manage your dungeon, raid villages, unlock new evolutions, grow an army of powerful monsters and then fulfill your revenge against the kingdom!<br/><br/>As the dungeon master, you must protect the dungeon's core at all costs from the adventurers that come seeking fame and fortune!<h3>Build the dungeon the way you want</h3><br/><br/><br/>Create the dungeon's path as you like. Be it a labyrinth or a long corridor, the choice is yours! Defend the core with a variety of different monsters, set up deadly traps and place buildings to improve your army strength!<h3>Manage resources wisely</h3><br/><br/><br/>Manage well your resources, think about every decision you make and every step you take. Be prepared and don't underestimate your enemies, you never know how strong the next party of adventurers will be!<h3>Expand in size and power</h3><br/><br/><br/>Collect resources by defeating adventurers and raiding nearby villages and towns! Grow your dungeon in size and power by researching new unlockables and evolutions!<h3>Survive and thrive</h3><br/><br/><br/>As the days pass by, the dungeon will gain notoriety and with it, stronger foes will come to try to destroy the core! Use everything that you got to prevent that and live until your revenge is completed!", "metacritic": null, "released": "2020-01-23", "tba": false, "updated": "2023-11-05T13:37:34", "background_image": "https://media.rawg.io/media/screenshots/8e3/8e3df78ad1161ca8e0e8c9a429d972d8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 357, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kraken Ink.", "Kraken Ink"], "genres": ["Action", "Adventure", "Strategy", "Casual", "Indie"], "publishers": ["Kraken Ink."], "esrb_rating": null}