{"id": 51257, "slug": "act-it-out-xl-a-game-of-charades", "name": "ACT IT OUT XL! A Game of Charades", "name_original": "ACT IT OUT XL! A Game of Charades", "description": "The classic console party game is now finally available on PC, and bigger and better than ever. ACT IT OUT XL is an interactive streaming game designed for Twitch, YouTube, and Mixer, and this special XL version comes with almost double the content as the original console game.<br/><br/><strong>PLAY WITH THE WORLD</strong><br/>In the 'Live Show' mode, you can broadcast your performance to your viewers. Create drawings, act, sing, or make up your own rules to communicate the secret phrases, while your viewers try to guess what it is. No Companion Apps are needed, your viewers type what they think it is in the chat, and the game will know which viewers are giving the right answer and will add the winners to the in-game leaderboards. Choose to play with the in-game content, or you can even make up your own.<br/><br/><strong>PACKED WITH CONTENT</strong><br/>Choose from almost 3,000 secret phrases from categories including film, music, sports, theatre, and video games. Do you love drawing, singing, acting and/or describing? Then this is the game for you.<br/><br/><strong>GREAT FOR THE LIVING ROOM</strong><br/>Not just for streaming, you can also play ACT IT OUT XL in the comfort of your living room. Up to 8 players can compete against each other, work in teams, or play cooperatively.<br/><br/><strong>A GREAT QUALITY EXPERIENCE</strong><br/>All content has been handpicked for various international audiences. ACT IT OUT XL features English (US/UK/Global), French, Italian, German, Spanish (Latin American/European) and Dutch secret phrases, and has been localised into those languages as well. The game also features some incredibly catchy music, composed and recorded by BAFTA-nominee Dom Beken. And it has cats.<br/><br/><strong>ACT IT OUT XL! A Game of Charades</strong> is a new way to play with your friends, and perfect for a great game night!", "metacritic": null, "released": "2016-01-05", "tba": false, "updated": "2023-02-10T21:22:31", "background_image": "https://media.rawg.io/media/screenshots/e3e/e3ea451e820f7c6ea9e4bbfbc36f70ab.jpg", "website": "https://www.snapfingerclick.com", "rating": 2.33, "rating_top": 3, "added_by_status": {"owned": 62, "beaten": 2}, "playtime": 2, "achievements_count": 70, "ratings_count": 6, "suggestions_count": 92, "game_series_count": 0, "reviews_count": 6, "platforms": ["Wii U", "PlayStation 4", "PC"], "developers": ["Snap Finger Click"], "genres": ["Strategy", "Casual", "Indie"], "publishers": ["Snap Finger Click"], "esrb_rating": null}