{"id": 512534, "slug": "flangry-bird-101", "name": "Flangry Bird 101", "name_original": "Flangry Bird 101", "description": "<p><strong>Flangry Bird 101</strong></p>\n<p>A Clone of Flappy Bird</p>\n<p><strong>Background  (From Wikipedia Flappy Bird):</strong></p>\n\n<p>Flappy Bird is a mobile game developed by Vietnamese video game artist and programmer Dong Nguyen (Vietnamese: Nguyễn Hà Đông), under his game development company dotGears.[1] The game is a side-scroller where the player controls a bird, attempting to fly between columns of green pipes without hitting them. Nguyen created the game over the period of several days, using a bird protagonist that he had designed for a cancelled game in 2012.</p>\n<p>The game was released in May 2013 but received a sudden rise in popularity in early 2014. Flappy Bird received poor reviews from some critics, who criticized its high level of difficulty, alleged plagiarism in graphics and game mechanics, while other reviewers found it addictive. At the end of January 2014, it was the most downloaded free game in the App Store for iOS. During this period, its developer said that Flappy Bird was earning $50,000 a day from in-app advertisements as well as sales.</p>\n<p>Flappy Bird was removed from both the App Store and Google Play by its creator on February 10, 2014. He claims that he felt guilt over what he considered to be its addictive nature and overuse. The game's popularity and sudden removal caused phones with it pre-installed to be put up for sale for high prices over the Internet.[2][3][4] Games similar to Flappy Bird became popular on the iTunes App Store in the wake of its removal, and both Apple and Google have removed games from their app stores for being too similar to the original.</p>\n<p>In August 2014, a revised version of Flappy Bird, called Flappy Birds Family, was released exclusively for the Amazon Fire TV. Bay Tek Games also released a licensed coin-operated Flappy Bird arcade game.</p>\n<p><strong>Gameplay</strong></p>\n<p>Flangryt Bird 101 is an arcade-style game in which the player controls the bird Flangry, which moves persistently to the right. The player is tasked with navigating Flangry through pairs of pipes that have equally sized gaps placed at random heights. Flangry automatically descends and only ascends when the player taps the spacebar. Each times passes the player is awarded points. Colliding with a pipe or the ground ends the gameplay. The game gets faster when a lever is completed. </p>\n\n<p><strong>Controls:</strong></p>\n<ul><li>Use Keyboard Space Bar</li></ul>\n\n<p><strong>Credits:</strong>\n</p>\n<ul><li>Code - Prince / Phaze101</li><li>Music - Crain / Phaze101</li><li>Graphics - Naufr4g0 / Phaze101</li></ul>\n\n<p><strong>Releases: </strong>\n</p>\n<p>v1.0 - <strong>Initial 22nd September 2020</strong></p>\n\n<p><strong>Minimum System Requirements:</strong></p>\n<ul><li>Commodore 64</li><li>64KB Ram</li><li>6510 1Mhz CPU</li><li>VIC-II GPU</li><li>SID</li></ul>", "metacritic": null, "released": "2020-10-27", "tba": false, "updated": "2020-10-30T05:50:53", "background_image": "https://media.rawg.io/media/screenshots/1c1/1c1a4e5dcb2edb34ca2c40d9784e468e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 74, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Phaze101"], "genres": [], "publishers": [], "esrb_rating": null}