{"id": 51251, "slug": "the-dummy-experiment", "name": "The Dummy Experiment", "name_original": "The Dummy Experiment", "description": "In The Dummy Experiment you are a test dummy subjected to a horrible experiment by a mad scientist, Dr. Strohmann. When you start up the game your goal is to pick a dummy of your choice.<br/><br/>On your way to the experiment the grappling hook (that picked up the dummy you chose) somehow loses grip. When the dummy’s feet reach the ground, the test dummy suddenly stands up. From here on, you are in control of the dummy. The narrator reacts surprised but motivate you (the dummy) to go for it and escape the facility.<br/><br/>As a dummy that just got his first experience in walking you use your balance to move away and escape the horrible experiment you were exposed to. Not only do you use this balance to get moving, but also in order to dodge objects and face obstacles that you will encounter. <br/><br/>While moving it is important to keep your balance so you won't fall over. Once you move you can't stop. Stay focused, and remember... Rushing around the terrain will only make it harder.while Playing, You Will<ul><li>“Simply” walk to your goal.<br/></li><li>Get Frustrated.<br/></li><li>You will ask yourself why you are playing this.<br/></li><li>Tell yourself that it is actually a pretty nice game.<br/></li><li>Be satisfied once you reach a checkpoint. <br/></li><li>Hear nice feedback from the narrator. </li></ul><br/><br/><strong>A big special thanks to our narrator Sam Lopez. You can reach out to him with the contact information you can find on our community page.</strong>", "metacritic": null, "released": "2018-01-19", "tba": false, "updated": "2019-08-28T22:03:07", "background_image": "https://media.rawg.io/media/screenshots/bac/bac3dd3b1deb73824049ea1c7a88fd6f.jpg", "website": "https://cetusstudios.com/the-dummy-experiment/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 127, "beaten": 1, "toplay": 1, "dropped": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 113, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Martijn de Vree", "Niek Oosterbaan", "Max Geraci", "Plaisir Nzuzi", "Kai van Ommeren", "Kevin van Huit", "Sedat Bilen", "Wesley Kroon"], "genres": ["Adventure", "Indie"], "publishers": ["Cetus Studios"], "esrb_rating": null}