{"id": 512897, "slug": "necromancer-escape", "name": "Necromancer escape", "name_original": "Necromancer escape", "description": "<p>--- NOTICE!  if the game is slow on the web please consider downloading---</p>\n<p>This game has been created with the idea of becoming a high-speed thinking puzzle. Although when the time came, I started designing all the levels and game mechanics, and regarding the time limit for the Jam I decided to make a smaller scope, and create all the core mechanics in a small map and with just one simple treasure hunt.</p>\n<p>So the core mechanic for the game is about velocity, when you move the necromancer will move slowly toward you, when you stop, it'll run at high speed. For this, you'll have a lantern and it will also light up with your speed. The treasure hunt is for magic flowers all around the house, with them you can breed potions and when you breed potions you can get some magic and powerful ones. For this stage, there is just one that's important and it is the ectoplasm potion, with that potion you can finish the game.</p>\n<p>Feel free to leave any feedback it's pretty much appreciated. Also, don't forget to wear headphones.</p>\n\n<p>===== INTRUCTIONS =====</p>\n<p>You have to search for the magic flowers near the house, there are four kind of flowers, find them all and pick them with right click, then you have to go to the alchemy station and read the recetary, it's not much descriptive but gives you the idea, mix flowers, then potions, and find the ectoplasm potion and take it to the stone's skull pedestal to win.<br/><br/>Also the bar tells the necromancer proximity but it's not that precise (on purpose) so you better take care and look around, and as you may now, never stop walking...<br/></p>\n<p>MOVE: w-a-s-d</p>\n<p>INTERACT: Right click</p>\n<p>RUN: Left shift</p>\n<p>PAUSE: Esc</p>\n<p><strong>Creator:</strong> Harold Troya</p>\n<p><strong>Twitter: </strong>@HaroldTroya</p>", "metacritic": null, "released": "2020-10-26", "tba": false, "updated": "2020-10-30T07:08:55", "background_image": "https://media.rawg.io/media/screenshots/366/3663eea7d199a6687d72151b5ee06b10.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 110, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Tlousher"], "genres": [], "publishers": [], "esrb_rating": null}