{"id": 5128, "slug": "frogger-returns", "name": "Frogger Returns", "name_original": "Frogger Returns", "description": "Frogger is coming to a PS3™ near you! Frogger Returns takes the heart-pounding challenge of arcade Frogger and takes it into the next dimension! Classic top-down 2D gameplay is updated with colorful 3D graphics, a new perspective, all-new levels, new enemies and game-changing power-ups to dodge and use! Local multiplayer lets you race a friend to victory.\n\n•\tEnhanced graphics. Classic Frogger gameplay gets a brand new look. \n\n•\tAll-new levels. Four stages take the original journey of Frogger from highway to home through an all-new adventure. \n\n•\tMultiple gameplay modes. Attack your top scores, race against the clock, or just get Frogger to his home pad. Play how you like! \n\n•\tNew bosses and tactics. New enemies and power-ups change up your strategy. \n\n•\tPlay with a friend! Local multiplayer lets you race a friend.\n\n©2009 Konami Digital Entertainment. KONAMI is a registered trademark of KONAMI CORPORATION. All Rights Reserved.\n\nPurchase or use of this item is subject to the PlayStation®Network Terms of Service and User Agreement. If you do not wish to accept all these terms, do not purchase or use this item.  This item has been sublicensed to you by Sony Computer Entertainment America.  One-time license fee for downloads to up to 2 portable systems that are associated with the purchasing account.", "metacritic": null, "released": "2009-11-09", "tba": false, "updated": "2023-02-18T11:13:48", "background_image": "https://media.rawg.io/media/screenshots/4ed/4ede011fffe205e4524955df6b7860db.jpg", "website": "http://www.konami.com/games/froggerreturns/", "rating": 2.42, "rating_top": 3, "added_by_status": {"yet": 4, "owned": 106, "beaten": 6, "toplay": 1, "dropped": 8}, "playtime": 1, "achievements_count": 12, "ratings_count": 12, "suggestions_count": 365, "game_series_count": 14, "reviews_count": 12, "platforms": ["Wii", "Nintendo DS", "PlayStation 3"], "developers": ["Konami Digital Entertainment", "Hijinx Studios"], "genres": ["Action", "Arcade"], "publishers": ["Konami"], "esrb_rating": "Everyone 10+"}