{"id": 51281, "slug": "snares-of-ruin", "name": "Snares of Ruin", "name_original": "Snares of Ruin", "description": "Synopsis <br/>You are detective <strong> Hank Anderson </strong>, and you’ve just been transferred to another city to help solve a series of unusual crimes. Upon arrival, you are greeted with a gory scene and a revelation of several instances of a deadly disease that turns people into savage zombie-like husks. Upon closer inspection, it appears there’s more to all this, and peculiar events do not stop. It is up to you now to solve this mystery and find out who or what has caused this.<br/><br/>During your investigation, you will have to make choices, find allies, and improve your abilities, for all this will affect how the story shapes up. You will meet fascinating female characters throughout. What kind of relationship you forge with each one of them is up to you, but be aware that your relationships with the ladies will impact the investigation one way or another. Features <br/><ul><li> A detective story with choice and consequence, set in a modern-day urban fantasy world.<br/></li><li> 6 female characters to romance, all unique in some way, ranging from a sexy vampire to a cute elf!<br/></li><li> Build romantic or platonic relationships with the ladies in a variety of ways: dialogue options, sidequests, and even take them out on dates.<br/></li><li> Choose to specialise in athletics, charisma, erudition, or mix and match those abilities to open up new ways of tackling the missions.<br/></li><li> Your stance with each lady could affect the flow of events, their interactions with you and each other, as well as their final fate.</li></ul>", "metacritic": null, "released": "2018-01-12", "tba": false, "updated": "2019-09-17T11:24:02", "background_image": "https://media.rawg.io/media/screenshots/d86/d86e3610d21fa25d77a58bef3862869f.jpg", "website": "", "rating": 2.0, "rating_top": 1, "added_by_status": {"yet": 3, "owned": 126, "dropped": 2}, "playtime": 1, "achievements_count": 26, "ratings_count": 7, "suggestions_count": 297, "game_series_count": 0, "reviews_count": 7, "platforms": ["PC"], "developers": ["Astronomic Games"], "genres": ["RPG", "Indie"], "publishers": ["New Reality Games"], "esrb_rating": null}