{"id": 512983, "slug": "asteroidsds", "name": "Asteroidsds", "name_original": "Asteroidsds", "description": "<p>CAUTION: The browser version's a bit odd and seems to be using compressed sound effects, causing popping to happen more often. Please download one of the versions below to experience this game at its best if you can.<br/></p>\n<p>Asteroidsds is a slight spin on the classic arcade game, starting out as a typical run-through until a certain turning point. After the turning point, you'll find that you can explore beyond the single screen the original was known for.</p>\n<p>A run-through when you know how the game works already takes about &lt;15 minutes. There is a speedrun timer running in the background that will show you your time at the end of the game.</p>\n<p>Keyboard is highly recommended. Controller inputs are set up for xb360/xbOne controllers on windows, I cannot confirm if they'll work on anything else. A readme is available with controls and tips, and are labeled following this paragraph.</p>\n<p>Controls:</p>\n<ul><li>Up/W: Thrust</li><li>Down/S: Brakes</li><li>Left/A and Right/D: Turning</li><li>Space: Shoot</li><li>Escape: Pause</li><li>P: Self-destruct</li></ul>\n<p>Tips:<br/>    Light blue and Purple things are safe to touch, I wouldn't try it with anything else</p>\n<p>--------------------------------------------------------------------------------</p>\n<p>My first game with unity, this was my opportunity to learn how some of the intricacies of the engine work; I hope to continue forward with this knowledge and learn more about game development and making more games.<br/></p>\n<p>P.S. If anyone happens to game on Mac or Linux, please leave a comment and tell me if the versions provided actually run.<br/></p>", "metacritic": null, "released": "2020-10-26", "tba": false, "updated": "2020-10-30T07:25:50", "background_image": "https://media.rawg.io/media/screenshots/4a7/4a7bfe7b3aaa713922f6c01e35977a2f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 6, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["Shoelariat"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}