{"id": 513, "slug": "dead-trigger-2", "name": "DEAD TRIGGER 2", "name_original": "DEAD TRIGGER 2", "description": "<p>BEST ZOMBIE SHOOTER EVER<br />\nTake your part on saving the world and win unbelievable real prizes in specially designed tournaments. Earn the money every day from oil fields!<br />\n<em> App Store - Best of 2013</em><br />\n<em> 44+ Millions survivors from all over the world are now part of Global Zombie Warfare!</em><br />\n<em> Join them and begin the mega fight for your life.</em><br />\n&quot;Hours of fun in marathon sessions or short bursts.&quot; - Gamezebo<br />\n&quot;The gap between mobile and console gaming is shrinking substantially.&quot; - 148apps<br />\n&quot;The game is improving upon everything that made the first title great.&quot; - Arcade Sushi<br />\nDownload Dead Trigger 2 for FREE and enter a dark world where humanity is engaged in the ultimate battle for survival in the face of a global Zombie apocalypse.<br />\nMASSIVE, CONTINUOUSLY UPDATED CONTENT. EVOLVING STORYLINES.<br />\nDead Trigger 2 is constantly evolving and expanding. Every update features new content intended to make your game even more enjoyable.<br />\n- Travel across 10 regions in different parts of the world.<br />\n- Explore 33 unique environments.<br />\n- Grab your favorite Zombie annihilator from 38 kinds of weapons.<br />\n- Go for the action in more than 600 gameplay scenarios.<br />\nTOURNAMENTS FOR REAL PRIZES<br />\nGet ready people, here they come. Join warriors from all around the world and fight in the Arena under custom gladiator rules every week. Become a legend in 3 unique Arenas, each featuring different environment and traps.<br />\nMOUTH-WATERING GRAPHICS<br />\nYou’ll be dazzled by cutting-edge graphics, including real time water reflections, dynamic vegetation and enhanced ragdolls. Explore multiple locations and slaughter the undead in diverse places like eerie Shanghai alleyways, abandoned mines, the African desert, Europe, South America …<br />\nTHE FINGER IS MIGHTIER THAN THE GUN<br />\nChoose between a touch control scheme created especially for casual players or an enhanced virtual joystick.<br />\nDo you prefer console gaming? Then go ahead, Dead Trigger 2 supports MOGA and other MFi game controllers on iPhone and iPod touch<br />\nREAL TIME STORY DEVELOPMENT<br />\nYou are not alone. Take part in the Global Resistance, tune in to stay informed as the global gameplay develops, directly influenced by the participation of every single player. Enjoy different types of operations such as story or global missions and side-quests.<br />\nREWARDS FOR EVERYONE<br />\nParticipate in global missions and receive rewards. Complete achievements, meet challenges and receive exclusive in-game currency.<br />\nTHE HIDEOUT<br />\nExplore your personal hide-out and meet the Gunsmith, Medic, Scientist, Smuggler and Engineer. These NPCs will help you unlock incredible weapons and gadgets. You can decorate your Hideout with many authentic decorations such as carpet, sofa, rubber duck, zombie aquarium, mounted zombie head trophies, zombie in a cage and many more...<br />\nORIGINAL AND FUN GAMEPLAY<br />\nForget easy-to-kill Zombies. Get ready for Kamikaze, Vomitron and other bosses – powerful Zombies with an inventive approach to your elimination. Also be sure to try out non-traditional melee weapons such as the Big Hammer, Boat Motor, Chainsaw or Katana. What’s our favorite? You gotta try the Boom Chickens, Rocket Chickens or special Sentry Chickens with mounted Machine-Gun. You’re gonna love them…<br />\nEASY TOURNAMENT VIDEO SHARING<br />\nBecome an overnight star via Youtube - we’ve perfected the options for sharing videos of your super game performance as well as the possibilities for becoming recognized LPs. Just click on the “Share video on Everyplay” button after completing a mission, warfare or tournament</p>", "metacritic": null, "released": "2013-05-08", "tba": false, "updated": "2024-01-01T17:41:01", "background_image": "https://media.rawg.io/media/screenshots/c18/c18b93229b585224a1313df025b1e255.jpeg", "website": "http://www.madfingergames.com", "rating": 3.94, "rating_top": 4, "added_by_status": {"yet": 2, "owned": 5, "beaten": 9, "dropped": 13, "playing": 1}, "playtime": 21, "achievements_count": 0, "ratings_count": 16, "suggestions_count": 294, "game_series_count": 0, "reviews_count": 16, "platforms": ["Android", "iOS"], "developers": ["MADFINGER Games"], "genres": ["Action", "Adventure"], "publishers": ["MADFINGER Games"], "esrb_rating": "Mature"}