{"id": 513032, "slug": "soul-nomad-the-world-eaters", "name": "Soul Nomad & the World Eaters", "name_original": "Soul Nomad & the World Eaters", "description": "<p>Soul Nomad &amp; the World Eaters begins in a world called Prodesta where an evil entity named Gig has returned with his three beasts known as World Eaters. The land of Prodesta has battled these monsters before, two hundred years earlier when Princess Layna sacrificed herself to capture the enemies and save the land from certain doom. Now they are back and you are the chosen hero who must battle through several environments to keep Prodesta alive. After creating your character, you learn that Gig has possessed your body and is offering you his strength to defeat your foes. Unfortunately, the powers you accept from Gig allow him to overtake more of your mind. A large part of the game is learning how much power you can use before you are completely consumed by evil. You are sent through the world to battle Gig&#39;s minions on grid-based battlefields with a party of your creation. Your group is composed of soldiers you purchase with Gig points, and you must set them up on the battleground so that their attributes and skills are put to good use. However, if you are running low on points you can also kidnap townsfolk and force them to join your cause. Battle is based around team work, and there are 40 different group abilities you may add to your arsenal as you attempt to defeat the enemy and save Prodesta.</p>", "metacritic": 73, "released": "2007-02-15", "tba": false, "updated": "2023-11-04T13:01:32", "background_image": "https://media.rawg.io/media/games/f66/f668966639e994ba660ce3b535535c2e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 8, "owned": 6, "beaten": 1, "toplay": 6, "dropped": 1}, "playtime": 0, "achievements_count": 4, "ratings_count": 4, "suggestions_count": 228, "game_series_count": 0, "reviews_count": 4, "platforms": ["PC", "Nintendo Switch", "PlayStation 2"], "developers": ["Codeglue", "Nippon Ichi Software"], "genres": ["RPG", "Strategy"], "publishers": ["NIS America", "Nippon Ichi Software", "Koei"], "esrb_rating": "Teen"}