{"id": 513090, "slug": "secret-of-ridgeway-manor", "name": "Secret of Ridgeway Manor", "name_original": "Secret of Ridgeway Manor", "description": "Experience the intense horror of a ghostly uninhibited mansion full of logic puzzles and classic point and click gameplay.<br/><br/>Have you ever wondered what it would be like to experience a ghostly adventure in an abandoned manor house out in the woods where no one can find you?<br/><br/>Well this manor house is unlike any other. Ridgeway Manor was abandoned in the early 19th century by its owners and due to the unique way the manor was built, no one has been brave enough to set foot back inside.<br/><br/>The manor has been created with traps and dangers to keep the snooping public at bay. The challenge you face, if you are brave enough, is to explore the manor and unlock its secret puzzles.<br/><br/>\"You are settling into bed on a breezy evening, the draft from the window wafts over your face as you think back to the strange experience you had earlier in the day. You dreamily remember walking home past an old deserted manor house, you recall glancing up the driveway where a light was on in the window. You think to yourself “No one has lived in that house for decades”. You let the thought mill through your mind as you begin to drift off to sleep. Your eyes begin to close and your thoughts begin to wander…<br/><br/>...You open your eyes to find yourself outside the gates to that same old manor house you were just thinking of – Ridgeway Manor as the name on the gate says…<br/><br/>...You have the strangest urge to explore…\"<br/><br/>Features:<br/><br/>+ Unique challenging logic puzzles which focus on escape room style puzzles.<br/>+ Drag and drop inventory system for combining items found.<br/>+ Classic point and click gameplay. Tap to navigate rooms, no complicated controls.<br/><br/>Thank you for playing The Secret Of Ridgeway Manor.", "metacritic": null, "released": "2020-10-21", "tba": false, "updated": "2020-11-02T02:17:01", "background_image": "https://media.rawg.io/media/screenshots/315/315e62c477154f522a09bb61715f7fbf_FOjhG0I.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 226, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["M9 Packaging"], "genres": ["Adventure", "Puzzle"], "publishers": ["M9 Packaging"], "esrb_rating": "Everyone 10+"}