{"id": 513091, "slug": "mr-word-pro", "name": "Mr Word Pro", "name_original": "Mr Word Pro", "description": "Mr Word challenges you to a word game with added personality. Even more so, now that Mr Word talks back.<br/><br/>This update sees the following enhancements:<br/><br/> - Mr Word chats with you during 1 player game play, just like a real human opponent<br/> - Improved dictionary (uses the Oxford English Dictionary if installed)<br/> - High score table, plus keeps track of how many games each player has won<br/> - more consistent AI gameplay<br/><br/>Choose 1 player or 2 player modes, and enter your name to begin. <br/><br/>In 1 player mode, you are playing against Mr Word himself. Featuring Genuine People Personality, Mr Word will really give you a run for your money. Sometimes he will offer encouraging comments, other times he can be a little sarcastic - try not to let him put you off.<br/><br/>Choose a difficulty level, Easy, Medium or Hard, then Mr Word will choose words that a real human would choose (his vocabulary increases in Hard level), and respond to your move in seconds - great for rapid fire play. Now even faster than before.<br/><br/>If you make Mr Word think for longer than a few seconds, you are doing really well! <br/><br/>Mr Word will even \"spellcheck\" your words as you lay them, so you know in advance whether the word you are playing is acceptable. New option: turn off spellcheck for  more challenging word play.<br/><br/>In 2 player mode, your iPad, iPhone or iPod Touch becomes a high quality table top board game. Both users can examine and manipulate their letters simultaneously, and the board rotates to face you when it's your turn. <br/><br/>Mr Word Pro is minimalist, highly playable, and totally ad free so you can rediscover the joy of word games.<br/><br/>Also featuring the Define button - instantly brings up word definitions for all words played. High quality, Apple-supplied dictionary of over 100,000 words. Features definitions from the Oxford English Dictionary so you can learn new words and their meanings every time you play.", "metacritic": null, "released": "2011-08-02", "tba": false, "updated": "2020-11-02T02:17:21", "background_image": "https://media.rawg.io/media/screenshots/0b9/0b9011248f37f975f21c1a8735c98992.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 101, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Truncated Tales"], "genres": ["Board Games", "Educational"], "publishers": ["Truncated Tales"], "esrb_rating": "Everyone 10+"}