{"id": 5131, "slug": "pixeljunk-shooter", "name": "PixelJunk Shooter", "name_original": "PixelJunk Shooter", "description": "<p>PixelJunk Shooter is the fourth installment of the PixelJunk franchise, in which each game is based on another genre. Unlike the previous PixelJunk games, Shooter does not feature the series&#39; trademark hardcore difficulty.</p>\n<h3>Plot</h3>\n<p>Another departure from the PixelJunk traditions is that Shooter has a backstory. The game is set on a faraway planet Apoxus Prime. The scientists explore its enormous caves to mine resources. The player controls a starship called Ers Pinita Colada. Its captain answers to a distress signal from Apoxus Prime and tries to rescue the scientists lost in the caves.</p>\n<h3>Gameplay</h3>\n<p>The player flies the ship in the underground tunnels. The goal is to locate and save the scientists. The ship uses its gun to destroy enemies or to clear the way from ice and rocks. The ship has no hit points. Instead, a thermometer measures the ship&#39;s temperature. The player has to avoid overheating and remember to cool the ship, for example, by diving into water.</p>\n<p>The underground features monsters, villains and other dangers. There are many environmental puzzles that require the player to manipulate water, lava, stones, and other elements to access the scientists and unlock doors. PixelJunk Shooter has three episodes comprised of five levels each, and levels consist of short stages. The player can only progress by saving the scientists, and if five or more of them die, he or she has to restart. A secondary objective is to gather the collectibles such as diamonds.</p>", "metacritic": 73, "released": "2009-12-10", "tba": false, "updated": "2023-09-18T09:00:33", "background_image": "https://media.rawg.io/media/screenshots/0d1/0d180a9847a3876837b21d00b3f53515.jpg", "website": "", "rating": 3.39, "rating_top": 4, "added_by_status": {"yet": 29, "owned": 975, "beaten": 37, "toplay": 2, "dropped": 32, "playing": 3}, "playtime": 3, "achievements_count": 28, "ratings_count": 66, "suggestions_count": 276, "game_series_count": 0, "reviews_count": 66, "platforms": ["PlayStation 3", "macOS", "PC", "Linux"], "developers": ["Sony Interactive Entertainment", "Double Eleven"], "genres": ["Action", "Shooter", "Arcade"], "publishers": ["Double Eleven"], "esrb_rating": "Everyone 10+"}