{"id": 513246, "slug": "mage-world-the-wizards-stone", "name": "Mage World - The Wizard´s Stone", "name_original": "Mage World - The Wizard´s Stone", "description": "<p>Mage World - The Wizard's Stone is a new platform jump and run game! True side scrolling jump´n´run power awaits you inside of this retro action adventure 2D platformer game with bosses. Be ready to run´n´gun with a magicwand and be aware of the dangers.<br/></p>\n\n<p>⭐Controlls<br/>-Use the WSAD or the arrow keys to move and jump<br/>-Use Space or Ctrl to shoot<br/>-Hit Enter to close a textbox<br/>-Hit tab or click on the spell book to open it<br/>-Use the mouse to select a spell</p>\n<p>⭐Key Features<br/>- Classic Adventure jump and run platformer fun<br/>-5 Mighty bosses, beat them and get new spells!<br/>-Many unique magic spells for your spell book<br/>-9 amazing game worlds to explore:<br/>- The Greenland<br/>- Ice World<br/>- The Castle<br/>- Desert Valley<br/>- Ghosty Graveyard<br/>- Firelands<br/>- The Outpost<br/>- Desert of Rhysa<br/>- Dino World<br/><br/>-79+ lovely 2d platformer levels with a lot of action<br/>-Collect coins to unlock new mystical worlds<br/>-Original epic soundtrack<br/>-Amazing 2D graphics<br/>-Tuned retro 16-bit gameplay<br/>-A great variety of traps, enemies and dangers<br/>-Save the kingdom of Super Mage World!<br/>-Most controllers got support<br/>-Responsive and simple controls<br/><br/>⭐Story<br/>Oh, no! The Wizard Stone has been robbed by the evil sorcerer! Now it's up to our heroine Trisha the mage to rescue the Wizard Stone, defeat the evil sorcerer, and —you guessed right— save the kingdom of Mage World. A magical plattformer game with boss fights!<br/><br/>⭐Gameplay<br/>Run and jump across 79+ addictive levels with increasing difficulty, a journey around 9 magical game worlds and enjoy the old school platformer action.<br/><br/>Beware on your awesome journey! You will come across all kind of hazards, traps, enemies and danger. Be ready to bounce around and use your powerful force abilities! Time your jumps perfect to avoid every trap.<br/><br/>Defeat mighty bosses to obtain new unique magic spells —you will need them. Now use your spell book to switch the powerful magic spells at any time!<br/>(At the moment you need to use the mouse for the spell book to use it, just click on the spell book and choose a spell. I ad full controller support a bit later, some controllers may not be functional)<br/><br/>Jump around and… unleash your mega power of the force and get stronger as any man before!<br/><br/>The classic retro adventure comic style catches the old spirit of the c64 and amiga times combined with modern 2D graphics.<br/><br/>⭐Old School Hint<br/>Collect 200 coins to get an extra life! You never know when they will come in handy.<br/><br/>⭐Join Trisha On Her Quest<br/>Are you prepared to defeat all bosses? Are you ready to master all 6 unique magic spells and save the kingdom?<br/><br/>Help Trisha the sorceress to become the greatest heroine in JacPete´s outstanding Mage World - The Wizard's Stone!<br/><br/><br/>⭐Suggestions<br/>I love your feedback to the game. Please keep your ideas coming. In the meantime, let’s bounce into the adventure!<br/></p>", "metacritic": null, "released": "2020-11-01", "tba": false, "updated": "2020-11-02T02:54:36", "background_image": "https://media.rawg.io/media/screenshots/7b4/7b4810fb80ff581fc83a3208267ebbf4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 235, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["JacPete"], "genres": ["Adventure", "Platformer"], "publishers": [], "esrb_rating": null}