{"id": 513205, "slug": "one-last-adventure", "name": "One Last Adventure", "name_original": "One Last Adventure", "description": "<p>\"One Last Adventure\"  is a casual platformer in which you experience locations and relationships important to the main character, who is  in the last moments of their life. It is your job as the player to guide the character through the levels of their life, collecting important heirlooms, and saying one last goodbye to those they loved.</p>\n\n<p>This is a vertical slice of a longer game. In the vertical slice, you play the first level of the game. Set in the garden of the character's childhood home, you traverse through tall grass and old toys to make it to the end of the level. You also meet Kyba, the character's childhood canine best friend.</p>\n\n<p>This assignment was part of a Games Design module where we were tasked with creating a game that would invoke an emotional response in the player. I tried to convey  Joy and Nostalgia through shared experience, and make it so the character in the game would have universal experiences that everyone playing could relate to. The idea of death, and that the player is on their final journey is also something I have used to convey  Sadness and Empathy.  I felt these pair of emotions were effective as the player could find joy in the nostalgia and shared experiences, as well as sadness i looking through the eyes of the main character.</p>\n\n<p>Character - Base character sprites and poses. Colours and basic structure changed.</p>\n<p>Dog Sprites - Paid for and slightly modified.</p>\n<p>Background Hospital Noise - Background noise of hospital movements.</p>\n<p>EKG Beeps (Heartrate Monitor) - Slight reverb added to give dreamlike effect.</p>", "metacritic": null, "released": "2020-11-01", "tba": false, "updated": "2020-11-02T02:43:25", "background_image": "https://media.rawg.io/media/screenshots/c9d/c9d9d8c0afb4616e20161f022ce99924.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 63, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Evan Williams"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}