{"id": 5132, "slug": "silent-hill-origins", "name": "Silent Hill: Origins (PSP)", "name_original": "Silent Hill: Origins (PSP)", "description": "<p>The renowned Silent Hill® survival horror series makes its handheld gaming debut with a brand new adventure that reveals many of the series&#39; most hallowed secrets. Assuming the role of a lone truck driver trapped in Silent Hill while making a routine delivery, players must escape the city’s horrific inhabitants and confront the strange hallucinations that have haunted him since childhood. Taking full advantage of the PSP® system’s graphics, sound, and portability, Silent Hill® Origins set a new standard in handheld gaming terror.<br />\n•   First Silent Hill® game for a handheld game platform<br />\n•   Storyline set before the events of the first Silent Hill® game<br />\n•   Spooky effects and visuals atypical of a Silent Hill® game<br />\n•   Enhanced camera system specifically designed for handheld play<br />\n•   Controls allow for more fluid combat and detailed exploration of the environment<br />\n•   Puzzles and mysteries to uncover as players attempt to escape Silent Hill<br />\n•   All new monster types and storyline that reflect the troubled past of the main character<br />\n•   Original soundtrack by famed series composer Akira Yamaoka<br />\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service).<br />", "metacritic": null, "released": "2007-11-06", "tba": false, "updated": "2023-11-10T15:32:48", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 5, "beaten": 6, "dropped": 1}, "playtime": 8, "achievements_count": 0, "ratings_count": 4, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 4, "platforms": ["PSP"], "developers": ["Konami Digital Entertainment"], "genres": ["Adventure"], "publishers": [], "esrb_rating": "Mature"}