{"id": 51335, "slug": "omensight", "name": "Omensight", "name_original": "Omensight", "description": "<p>You are the Harbinger, a skilled warrior who exists outside of time. You have foreseen the annihilation of the land known as Urralia and have been summoned to rewrite its fate. Serve as the eyes and the sword of Urralia as you identify characters who may have played a part in the story of its destruction, like a war general or a powerful sorcerer. Appear alongside these characters to discover how they chose to spend their final moments. Will you fight with them or against them?</p>\n<p>By participating in fateful events from different perspectives, you’ll learn valuable information about how specific decisions unfold. When those situations call for battle, make use of the Harbinger’s sword techniques and creatively combine time-slowing spells or other abilities to eliminate threats. Use the power of Omensight to weave a new narrative, pave the way to a brighter future, and give the land of Urralia a second chance.</p>\n<p><strong>Key features:</strong></p>\n<ul>\n<li>Manipulate time to witness the outcome of events from different perspectives  </li>\n<li>Join a diverse cast of characters with mysterious roles to play in Urralia&#39;s story - and each other&#39;s  </li>\n<li>Learn key information about specific characters, then help or hinder them to prevent the end of the world  </li>\n<li>Fight using fluid, stylish combat that combines swordplay and magical abilities</li>\n</ul>", "metacritic": 75, "released": "2018-05-14", "tba": false, "updated": "2023-06-04T23:34:23", "background_image": "https://media.rawg.io/media/games/f1c/f1c41f3bd938c2c533c671c1552c4f99.jpg", "website": "http://www.omensight.com", "rating": 3.44, "rating_top": 4, "added_by_status": {"yet": 30, "owned": 247, "beaten": 22, "toplay": 36, "dropped": 8, "playing": 3}, "playtime": 5, "achievements_count": 97, "ratings_count": 36, "suggestions_count": 259, "game_series_count": 0, "reviews_count": 39, "platforms": ["PC", "PlayStation 4", "Nintendo Switch"], "developers": ["Spearhead Games"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Spearhead Games"], "esrb_rating": "Teen"}