{"id": 513345, "slug": "scpacman", "name": "SCPacman", "name_original": "SCPacman", "description": "<p>I small game I had lying around on my computer, initially made as part of a commission of sorts. In celebration of Halloween, I decided to make a public standalone version. In order to get it out in time (Or well, one day late), I had to rush it a bit and as such, it's not as complete as I would have liked. Nevertheless, it's perfectly playable.</p>\n<p>It's as basic as its sounds: Pacman, but the ghosts have been replaced with SCPs.</p>\n\n<p>List of features:</p>\n<p>- Enemies each with a unique behaviour associated with its respective SCP; 106 goes through walls, 173 stops when in your line of sight, and 096 kills you when in your line of sight. ...049 does nothing special, though. He's the Clyde of the gang.</p>\n<p>- Play on a virtual arcade machine which matches your input (This mostly exists due to the original project being made with this in mind, and changing that would have further delayed release).</p>\n<p>- Settings for adjusting the speed of enemies and the player (this also affects your final score due to making the game more or less difficult), and of course a volume slider.</p>\n<p>- The cherry has been replaced with a health pack, giving you a 1-up.</p>\n\n<p>List of missing features:</p>\n<p>- Scoreboard. There is no way of saving your high score besides writing it down.</p>\n<p>- More levels. When you win, that's it. No \"Continue\" like in regular Pacman.</p>\n<p>- Power pellets. It seemed wrong to be able to \"fight\" the SCPs, so these were left out entirely. I considered replacing them with an SCP item that would make you immune to damage for a while, but I couldn't think of one that matched that description and so I decided against it, again to avoid delays. As a result, this game is significantly harder than the original. Don't feel ashamed to use the speed settings to make it a bit easier on you.</p>\n<p>- Saving. Without the scoreboard this seemed rather pointless, but it does mean that your settings will reset upon quitting the game.</p>\n<p>- Other miscellaneous touch-ups which likely won't be missed by anyone but myself.</p>\n\n<p>I may or may not update the game to fix some of the above points, and/or others that slipped under my radar, but I'll make no promises.</p>\n\n<p>That's it. If that sounds fun, download it, play it until you're bored of it, and I hope you had a happy Halloween.</p>", "metacritic": null, "released": "2020-11-01", "tba": false, "updated": "2020-11-02T03:18:21", "background_image": "https://media.rawg.io/media/screenshots/bef/befaf850fa00d7bb836c067fe4b0fea1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 35, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Fågelkung"], "genres": [], "publishers": [], "esrb_rating": null}