{"id": 513607, "slug": "turm8", "name": "Turm8", "name_original": "Turm8", "description": "<p>This is a collection of cellular automata called \"turmites\", implemented in Octo for SUPER-CHIP on the HP 48 graphing calculators.</p>\n<p>A \"turmite\" (also known as \"TurNing machine\") is a type of two-dimensional Turing machine. It consists of an ant that moves over a grid of pixels. Depending on the current pixel's color (limited to two colors in this implementation) and the ant's internal state, it can rotate, change its state, and/or change the color of the pixel before moving. From these simple rules, interesting patterns and behaviors emerge.</p>\n<p>Instructions on how to load and run this program on your own HP 48 calculator</p>\r\nControls\r\n<p>The controls will vary depending on whether you're running in your browser, on an actual HP48 calculator, or in a general CHIP-8/SUPER-CHIP emulator/interpreter.</p>\n<strong>PC / Octo</strong><strong>HP 48</strong><strong>CHIP-8</strong><strong>Move in menu</strong>WASD or arrow keys5 1 2 35 7 8 9<strong>Select</strong>Space or ReturnSPCB<strong>Adjust speed</strong>+ and -+ and -F and E<strong>Return to menu</strong>Escape0 or ENTERA<strong>Toggle sound</strong>+/-\r\nCustom\r\n<p>You can input and store (in the HP 48's persistent user flags) a custom turmite. Scroll to the bottom of the menu, and use the numerical buttons to input the numerical string that represents an ant. See if you can discover any interesting ones!</p>\n<p>A turmite's ruleset is defined by three digits per color per state (since this implementation only uses two colors, a multiple of two times three numbers).</p>\n<p>For example, the basic turmite definition \"120 080\" (Langton's Ant) means that the turmite has only one state (0), since it has six digits (three digits per color). If the pixel is off (first three digits), it turns the pixel on (1), turns right (2) and enters state 0 (the only state). If the pixel is on (second group of three digits), it turns it off (0), turns left (8) and enters state 0. Possible movement directions are</p>\r\n1No turn2Right4U-turn8Left\r\nLimitations\r\n\r\n<p>In order to be equivalent to Turing machines, turmites unsurprisingly require an infinite grid of pixels to move on. Since SUPER-CHIP only provides 128x64 pixels, this implementation is toroidal (ie. the ant wraps around the edges of the screen).</p>\n<p>Turmites are limited to 3 internal states in this implementation.</p>\n<p>The ant's speed can be adjusted with the + and - keys. However, on a real HP 48 calculator, it will still move pretty slowly even on the fastest setting. An HP 48G series calculator is recommended, as they have a faster CPU than the HP 48S series.</p>", "metacritic": null, "released": "2020-11-01", "tba": false, "updated": "2020-11-02T04:15:57", "background_image": "https://media.rawg.io/media/screenshots/0dd/0dda2decb55b3adc9c87c6385744f7e8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 49, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Tobias V. Langhoff"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}