{"id": 513645, "slug": "confused-industries", "name": "ConFused Industries", "name_original": "ConFused Industries", "description": "Controls\r\n<p>WASD, Arrow Keys, Controller stick - move forward/backward and rotate left and right<br/></p>\n<p>Space, Ctrl, A/B - Animal special action, and interaction with ConFusion machines</p>\n<p>R / Select - Respawn</p>\r\nWhat is this?\r\n<p>TLDR: Mostly a fun character creator that needs some UX polish, and a very very prototype-stage game using that character creator.</p>\n<p>You are a new breed of highly intelligent and specialized hybrid animal who just escaped from their holding area at ConFusion Industries! Use one of 5 special abilities to solve puzzles, and mutate into other types of animals when you need the other abilities! Or, at least, that's what it hopefully will be someday. Right now the level after the character creator is mostly just a testing jungle gym. You can play around with using and mutating your animal, and find all the neat narration points if you can!</p>\r\nCredits\r\n<p>LoparPanda - Programming, Polymorphic Animal base mesh, blend shapes, procedural animation, and shaders. Music, Sound Effects</p>\n<p>I stream gamedev stuff on Twitch!</p>\n<p>Narration VO artist: https://www.fiverr.com/timwells692</p>\n<p>Title Screen building and Level design - Assembled by me with Asset Forge using the included blocks as well as additional blocks from the Kenney Game Assets bundle. Both Asset Forge and all blocks are available at https://kenney.itch.io/</p>\n<p>Font: League Gothic</p>\n<p>Special thanks to supershigi for making this jam and building such a wonderful community that has, among many other things, helped rekindle my passion to tell stories through game development.</p>", "metacritic": null, "released": "2020-11-01", "tba": false, "updated": "2020-11-02T04:23:48", "background_image": "https://media.rawg.io/media/screenshots/94b/94b7cd569b3a20ee94dd42551f69c360.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 64, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["lopar"], "genres": [], "publishers": [], "esrb_rating": null}