{"id": 51377, "slug": "cubians-rescue-princess", "name": "Cubians: Rescue Princess", "name_original": "Cubians: Rescue Princess", "description": "<strong>Welcome to the world of fairy tales!</strong><br/>\"CUBIANS rescue princess\" is a game where you control Cubians using magical drums. Jump over and avoid the obstacles and take Cubians to the destination. <br/>You can explore the cute voxel-style characters and their fairy tale world through VR.Background Story: \"The magic library where the fairy tale world unfolds into reality.\" Wizards can explore the fairy tale world using magic. <br/><br/>Dr.Plague, who lived alone in a horror fairy tale book that no one wanted, found out about the magic of fairy tale book traveling. Dr.Plague came out of his fairy tale world and traveled to other fairy tales using this magic. One day, Dr.Plague found a prince and a princess who looked very happy. Seeing them, jealous Dr.Plague kidnapped the princess and fled to the world of other fairy tales.<br/><br/>We need to bring the princess back in order to keep the order of fairy tale books. Help the princess return to her original storybook world.Magic Library: \"Prepare to explore the world of fairy tale books.\" 1. Choose a Cubian to take to your fairy tale journey.<br/>You can choose which Cubian to take with you from the Cubian Showcase. <br/>Pick up a Cubian from the Cubian Showcase with Trigger Button, and place it on the slot on the table in front of you.<br/>Only the Cubians on the slot can explore with you.<br/><br/>2. Choose a fairy tale book to explore.<br/>Pick up the books from the bookshelf with the Trigger Button and place them on the reading desk in front of you.<br/>Place the book on the reading desk, the fairy tale stages will be opened. <br/>Take one and bring it close to your head. Then starts the fairy tale world exploration.Explore the fairy tale: \"Play the magic drum to the rhythm of the music.\" In the fairy tale book, the controller turns into a drumstick. Swing the drumstick and hit the drum to the rhythm of the music. Cubians will move in the direction of the arrow drawn on the drums. Judge the situation, think about the way to go and hit the drum.", "metacritic": null, "released": "2018-01-16", "tba": false, "updated": "2019-08-28T22:03:03", "background_image": "https://media.rawg.io/media/screenshots/3d4/3d4e0216f3ee5fe3c44442c1938616f1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 206, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["IKINA GAMES"], "genres": ["Action", "Casual", "Indie"], "publishers": ["IKINA GAMES"], "esrb_rating": null}