{"id": 51378, "slug": "dust-and-salt", "name": "Dust and Salt", "name_original": "Dust and Salt", "description": "Dust and Salt is a text-based narrative adventure with a pinch of turn-based tactical battles which has you as the main hero leading your troops in a gritty, low-power, medieval fantasy world. <br/><br/>When his father is murdered and his village burned to the ground, a young warrior swears vengeance. He has to choose between force or diplomacy to forge new alliances and subdue his enemies. Will he get rid of the oppressors of this world or become an oppressor himself?<br/><br/>The game consists of a story text, a world map, and a tactical combat layer. On the world map you can choose to travel to different locations. The story text builds around the constant choices you make. Once you engage in battle the game will switch to a tactical map where the actual fighting takes place as turn-based combat. Enjoy the vivid writings by the quill of the author Sycamore Bright.<br/><br/><br/><br/><ul><li><strong>Story is king.</strong> Rich, non-linear story that reminds of D&amp;D with a \"flair of battle\". We’d describe it as a choose-your-own-adventure book that meets an RPG.<br/></li><li><strong>Tactical combats.</strong> This is not checkers, this is a grown-up combat simulation. Send your light-armored infantry, the Nameless Wolves, through the woods into the back of the enemy while your armored, hammer-wielding Nameless Bears stall the enemy attack.<br/></li><li><strong>Decisions matter.</strong> The narrative branches based on your choices. Your actions define and shape the world you experience.<br/></li><li><strong>Character development.</strong> Are your decisions black, white or gray? Will they lead to a better future for the Sin Lands or will you turn into a usurper?<br/></li><li><strong>Memorable personalities.</strong> Stand up to the cunning Lords of the Sin Lands in well-written interactive dialogues.<br/></li><li><strong>Art that gives more life to the whole story.</strong> Zoom-in on the world map and experience the detail of the artistic work.<br/></li><li><strong>You don’t pick abstract skills.</strong> Instead the choices you make at the beginning of the game define what abilities your character will learn.<br/></li><li> Featuring a gorgeous Nordic soundtrack by acclaimed artist Mike Olsen a.k.a. Danheim.</li></ul>", "metacritic": null, "released": "2018-01-25", "tba": false, "updated": "2019-08-28T22:03:03", "background_image": "https://media.rawg.io/media/screenshots/79f/79f8efdb00176cf4423aa15e4354c3d7.jpg", "website": "https://www.primegames.bg/en/dust-and-salt", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 15, "dropped": 1}, "playtime": 1, "achievements_count": 29, "ratings_count": 1, "suggestions_count": 277, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android", "PC", "macOS"], "developers": ["Prime Games", "Prime Games Bulgaria"], "genres": ["Adventure", "RPG", "Casual", "Indie"], "publishers": ["Prime Games"], "esrb_rating": null}