{"id": 51385, "slug": "the-last-rolling-hero", "name": "The Last Rolling Hero", "name_original": "The Last Rolling Hero", "description": "On a distant and nameless planet lived forgotten and seemingly forgotten robotic toys that called themselves Lumi. Their favorite activity was to sit on the beach and admire the sunset. <br/>One day they heard a roar from the sky and a terrible alien warship landed on their beautiful planet. It turned out that the ship of the hero of the war, named Sphery, who fought with the Kuboids in the constellation of Triangle was hit, and he made an emergency landing. <br/>In the beginning, Lumi was frightened, but quickly became friends with an uninvited guest. They helped him repair the ship, and he told them interesting stories about other worlds and a war that Lumi themselves knew nothing about. <br/>On one of the usual days, which suddenly became unusual, their planet was found by the evil Kuboids. All of Lumi were captured by Kuboids. It turned out that the harmless robot toys have a reactor inside of them, the energy of which can power the whole cruiser. Its Evil Darkness, Lord Kubotron ordered to seize all the Lumi. <br/><br/>Our hero Sphery has nothing left but to save his kidnapped friends.<br/><ul><li>More than 20 unique levels<br/></li><li>Two game modes (With and without enemyes)<br/></li><li>Character upgrades<br/></li><li>Lots of bonuses and power ups<br/></li><li>Compete with friends and the whole world to be the best of the best in the highscore tab <br/></li><li>Dynamic gameplay <br/></li><li>Beautiful story <br/></li><li>Modern graphics powered by Unreal Engine 4 <br/></li><li>Great soundtrack </li></ul>and much more.", "metacritic": null, "released": "2021-07-21", "tba": false, "updated": "2021-07-09T03:08:43", "background_image": "https://media.rawg.io/media/screenshots/fd2/fd26466cdcdab002b979df29c2d974c9.jpg", "website": "http://rhdi.ru", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 26}, "playtime": 11, "achievements_count": 120, "ratings_count": 0, "suggestions_count": 283, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Xbox One"], "developers": ["RHDI Interactive"], "genres": ["Action", "Casual", "Indie"], "publishers": ["RHDI Interactive"], "esrb_rating": null}