{"id": 513829, "slug": "the-blind-assassin", "name": "The Blind Assassin!", "name_original": "The Blind Assassin!", "description": "<p>The Blind Assassin!   Hello welcome to the polite assassin's club. We eliminate the \"ass\" in assassin... because you know... we are polite! My name is doctor i-don't-carrot-at-all. and i am going to teach you how to be an assassin like me!   Like all great assassins of my bloodline, the \"don't carrots\", we suffer from this terrible curse... A scary, unique, mystery ailment called... \"night blindness\".  But fret not! we have figured out a way to get around this, when the day turns into night, we rely on other sense like our hearing rather than our vision. Which is really cool!   </p><p>Notes on BYOG 2020 Our main theme is \"Unlearn\", the game has a day and night cycle, during the day cycle the user can see their obstacles and surrounding and use visual cues to navigate the level, however, at night, the player depends on the audio cues to avoid obstacles i.e. unlearn how they process information.  </p><p> Gameplay controls and all that fun stuff The blind assassin is an endless runner. Use the arrow keys to navitage!  Playable on web browsers!   Future scope and inspiration The idea started with the intention of making a game for blind or visually impaired audiences. A game that relies more on sound than visuals and can still provide a fast paced gaming experience.   </p><p>Assets we.... \"borrowed\" Animations:  - Mixamo  Audio:  -Incomptech  Code: - Bunch of youtube tutorials and google searches<br/></p>", "metacritic": null, "released": "2020-10-31", "tba": false, "updated": "2020-11-02T05:06:16", "background_image": "https://media.rawg.io/media/screenshots/6bf/6bf6f579f89e00ac85b9a51968222bee.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 72, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jenna153"], "genres": [], "publishers": [], "esrb_rating": null}