{"id": 513988, "slug": "crimson-shrine", "name": "Crimson Shrine", "name_original": "Crimson Shrine", "description": "<p>My brother and I put a lot of time into <em>Crimson Shrine</em> in the early 2000s. I don't remember all that much about it, to be honest, only that we were terrified and enraptured by the monster on the cover, which was really just a photocopied slip of paper in a clear CD case, and that it was the direct cause of at least four physical fights.<br/></p>\n<p>I haven't been able to find the original since I moved out in 2004, and my brother and I like to play this <em>new </em>game where sometimes I ask him about <em>Crimson Shrine</em> and he says he doesn't know what I'm talking about until I ask a couple more times and then he gets sullen and quiet and hangs up on me.</p>\n<p>So this is a remake of sorts: more a half-remembered dream of <em>Crimson Shrine</em> than a 1:1 recreation. There's no story but whatever your mind can pull from the low-resolution 1990s edginess. Happy Hallowe'en.<br/></p>\n<p>\n</p>\r\nControls\r\n<ul><li>The WASD keys move your character.</li><li>Use the mouse to look around and direct your character.</li><li>Click to shoot a bullet, which hurts your opponent's character.</li></ul>\r\nHow To Play\r\n<p>Players fight for control of the Shrine -- that central area bathed in cleansing white light. The longer you can stay on the Shrine and keep your opponents away from it, the more points you'll score, and the first player to score 50 points wins the game. If you leave the Shrine, your score will start to go back down, and you'll also leave it wide open for someone else to take.</p>\r\nSingle Player Mode\r\n<p><em>Crimson Shrine</em> is a split-screen multiplayer game, but if you're on your own you can still explore the space for spooky secrets and easter eggs. You can make up your own story if you like! I'm not the boss of you!</p>\r\nContent Warnings\r\n<ul><li>People with photosensitive epilepsy might have trouble with some of the effects.</li><li>This is a dark game in both content and aesthetic. Those with visual impairment might find <em>Crimson Shrine</em> a difficult play.</li><li>A future update may alleviate or at least try to lessen these problems.</li></ul>\r\nKnown Issues (as of 1.1)\r\n<ul><li>The browser version doesn't always load all the models. This doesn't affect gameplay, but if you're a fan of statues and fire bowls you may experience some mild disappointment.</li><li>The \"walkway\" area doesn't consistently load shadows properly.</li><li>Sometimes a path opens that takes you out of the level geometry into a place referred to as \"the city beyond the sunset,\" though no such place exists. For now, if the path <em>does</em> open, do not take it.</li><li>Sometimes the game will erroneously register a second player during single-player mode. To be clear, <em>Crimson Shrine</em> is a local multiplayer game with no online connectivity features and no AI drones or \"bots.\"</li><li>The level music has been described as \"too intense.\" This is intentional and also <em>rad as hell</em>. No future update will correct this. The music is an important part of the developer's <em>extremely cool vision</em>.</li><li>During the private beta phase, a small minority of players ran into an <br/>issue related to not closing the game properly and \"cleanly.\" Please \r\nmake sure the program is fully closed and unloaded before sleeping.</li></ul>", "metacritic": null, "released": "2020-10-31", "tba": false, "updated": "2020-11-02T05:41:20", "background_image": "https://media.rawg.io/media/screenshots/399/399a7fbcd93515d1847e3574090cc9a5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 80, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["Jamie Drew"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}