{"id": 51412, "slug": "grisaia-phantom-trigger-vol4", "name": "Grisaia Phantom Trigger Vol.4", "name_original": "Grisaia Phantom Trigger Vol.4", "description": "Grisaia: Phantom Trigger is a visual novel. More specifically, it is a kinetic novel, without any branching routes. Returning character artist Akio Watanabe and writer Ryuta Fujisaki bring you the latest installment in the acclaimed Grisaia series, \"Grisaia: Phantom Trigger\".<br/>\r\n\"<br/>\r\nStory:<br/>\r\nKumashiro Megumi (Gumi), recently transferred from St. Aile's International School, has been training hard together with Rena and Maki - now fully recovered from their injuries. With the help of her mentor, Tohka, she’s shaping up to be a fine sniper.<br/>\n<br/>\r\nJust as one new student settles in, another has her sights set on joining the girls in Class A, Mihama’s elite combat unit. Her name? Sengoku Taiga. Haruto, the team’s handler, has one condition for Taiga’s transfer: that Chris serves as her supervising officer.<br/>\r\nThe two seem an unlikely pair at first, but after spending some time with little Taiga, Chris soon finds a way to see things from her perspective.<br/>\n<br/>\r\nIt’s at that moment that the nation is suddenly rocked by a terror attack on an unprecedented scale. Chris rushes to the scene, aware of what’s at stake, but paying no heed to the dangers ahead.<br/>\n<br/>\r\nJust as she did, once before.<br/>\n<br/>\r\n“This is even worse than we could’ve imagined...”<br/>\r\n“Two of the guys are dead! What happened? What the hell happened!?”<br/>\r\n“Y’know what it means to bring nukes into the country...?”<br/>\r\n“It’s scary, shooting someone for the first time... My legs are shaking.”<br/>\r\n“That fool... Is she trying to ruin everything!?”<br/>\n<br/>\r\nThe death toll keeps on rising, but SORD are stuck watching helplessly from the sidelines. What destiny awaits Chris, Taiga... and Mihama Academy?<br/>\n<br/>\r\n“Oh, right... I must have died...”<br/>\n<br/>\r\nClutching to memories of her long-dead mother, she too prepares for an eternity of slumber...", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:03:02", "background_image": "https://media.rawg.io/media/screenshots/93c/93cca36f8941b863549712ed33c0086e.jpg", "website": "http://grisaia-pt.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 5, "owned": 16}, "playtime": 5, "achievements_count": 25, "ratings_count": 0, "suggestions_count": 414, "game_series_count": 18, "reviews_count": 0, "platforms": ["PC"], "developers": ["Frontwing"], "genres": ["Adventure", "Casual"], "publishers": ["Frontwing USA"], "esrb_rating": null}