{"id": 514225, "slug": "pumpkin-total-destruction", "name": "Pumpkin: Total Destruction", "name_original": "Pumpkin: Total Destruction", "description": "<p>Guys, i m in a big trouble... I totally f***ed up. But first things first.</p>\n<p>It all started when i bought a planet from strange old dude. He offered me only 3.5 grand for seemengly normal planet. What a fool I was! I bought it... Initially there was no water on it, but the old dude assured me it would soon appear, and he was right, some time after my planet was covered with water! I was really satisfied with my new purchase. I placed it inside a pumpkin and everything was ok until one day, right before the Halloween.</p>\n<p>As usual i got up pretty early and went to check on my sweet pumpkin. It was fine, but I noticed something weird on my water source. It was freaking living organisms! I called the anti-pesto agency, according to my description they said these creatures were dinasaurus. They suggested me to take care of dinasaurus by myself, the only thing needed was just a small asteroid! Phew, such a relief! Of course i found one in my drawer. It was just perfect size and i launched it right into my planet through special holes in the pumpkin. I thought the problem was solved, so i pour myself a cup of tea and almost forgot about this issue.</p>\n<p>As you may have already guessed it's not all! The next time i came to check i found out that asteroid didn't destroy all of them... Some survived and continued to evolute. While i was drinking tea they turned from some stupid lizards into even more stupid creatures! I googled and turned out this time my planet was populated with so called 'humans'. Some website said it was some kind of pretty smart mold. This creepy stuff can literally change the whole planet, terraform it and destroy your plant! Should I tell you i didnt need that at all. So i called to the agency again. This time they were really concerned about my situation. They said you can't destroy all the humans so easily without destroying the whole planet, another option would be just get rid of that planet. But the operator warned me that, no matter what, i shouldn't allow these parasites to leave the pumpkin. He said if they find out that they lived in a big pumpkin, they would get mad and just destroy everything! I was really surprised by the fact that mold can 'find out' something, but he said that stuff is pretty smart.</p>\n<p>So, im waiting now for them armed with a small space cannon in case they decide to get out of the pumpkin. I need to resist just until the Halloween ends an then just utilize this planet. I can make it! Here they come!! Oh sh...</p>\n\n\n<p>This game was made for the Spooktober Jam 2020.</p>\n\n\n<p>Twitter: https://twitter.com/BearEnthusiasts<br/></p>", "metacritic": null, "released": "2020-10-31", "tba": false, "updated": "2020-11-02T06:37:13", "background_image": "https://media.rawg.io/media/screenshots/8ae/8ae2ab65d425527f514bc22879d54484.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 52, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BearEnthusiasts"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}