{"id": 514264, "slug": "drugged-up-melt-down", "name": "Drugged-Up Melt-Down", "name_original": "Drugged-Up Melt-Down", "description": "<p>Hello, and welcome to your first day at the mega-corp nuclear center, providing power for the millions of people in Alcasca, New Mexico.  Today i’m going to teach you about the wonders of nuclear engineering and how you can do your part to keep this glorious piece of cold war era technology running at peak proficiency. Remember, decreasing power efficiency comes out of your pay. </p>\n<p><strong>HOW TO PLAY</strong></p>\n<p>\n<strong>Top Console Tasks: </strong></p>\n<ol><li><strong>Lever and buttons</strong> - controls flow of hot and cold oxygen to the reactor</li><ol><li>Status Indicator: Left-most bar</li><li>Description: Press the button of the opposite color to that of the one filling it’s status bar and pull the lever to begin the flow of hot or cold oxygen into the system. </li><li>Type: Continuous</li></ol><li><strong>Valves</strong> - controls inflow of hot and cold water to the reactor</li><ol><li>Status Indicator: Second bar from left</li><li>Description: Open the valve of the opposite color to that of the one filling the status bar begin filling the reactor with water and return the readings to to nominal</li><li>Type: Continuous</li></ol><li><strong>Open and Close Buttons</strong> - open and close the doors to the reactor chamber for venting</li><ol><li><strong>Status Indicator: </strong>Highlighted button on status screen</li><li><strong>Description: </strong>Press the button with the associated symbol to the one lit on the status screen to complete the action.</li><li><strong>Type:</strong> Single Press</li></ol><li>Purge Button  - purge the reactor chamber of excess irradiated water </li><ol><li>Status Indicator: Rightmost Bar</li><li>Description: Use the switch and push the button to empty the reactor of irradiated water</li><li>Type: Single Press\r\n</li></ol></ol>\n<p><strong>Bottom Console Tasks:</strong></p>\n<ol><li>Keyboard - logs you into the console</li></ol>\n<ol><li>Description: A keyboard with 9 numbers and 5 letters. A note containing the password will be on the screen.</li><li>Type: Start of Game</li></ol>\n<ol><li>Add and Remove Panel - adds and removes plutonium from the reactor</li></ol>\n<ol><li>Status Bar: Second to right</li><li>Description: A panel with a slider and two switches. Use the slider to select an amount of plutonium to add or subtract from the system. Then select either add or subtract to do so. If the status bar is orange, the plutonium is too high. If the status bar is purple, the plutonium is too low.</li><li>Type: Instant</li></ol>\n<ol><li>Request Panel - sends plutonium to someone requesting it.</li></ol>\n<ol><li>Status: Chat Box</li><li>Description: A panel with a slider and one button called REQUEST. If the chat box symbol is red, set it to any amount and press the button.</li><li>Type: Instant.</li></ol>\n<ol><li>Panel of Many Buttons - a panel of many buttons</li></ol>\n<ol><li>Status: Button and Arrows</li><li>Description: A panel with six buttons. Press them from left to right or right to left depending on the arrow shown on the screen</li><li>Type: Instant</li></ol>\n<ol><li>Giant Megaphone - allows you to end your shift.</li></ol>\n<ol><li>Status: Green Box with Check Mark</li><li>Description: A panel with a large megaphone, a light, and a button on it. Hold the button when the status light is on to end your shift.</li></ol>\n<p><strong>Type:</strong> Hold Down</p>", "metacritic": null, "released": "2020-10-31", "tba": false, "updated": "2020-11-02T06:46:20", "background_image": "https://media.rawg.io/media/screenshots/561/561be9233e8c87abb9b18bcaebf5403d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ignis_Panem"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}