{"id": 51426, "slug": "moorhuhn-knights-castles", "name": "Moorhuhn Knights & Castles", "name_original": "Moorhuhn Knights & Castles", "description": "<p>\n      Finally, Moorhuhn strikes back! Get set, aim, fire ... and never neglect \n      your own cover. Fight against the AI, your friends ... or your enemies! \n      Pure Moorhuhn action!\n    </p><p>\n      CONTENTS\n    </p><ul>\n<li>\n        Action: Aim and hit with a variety of weapons and magic!\n      </li>\n<li>\n        Construction: Build your own castle complete with walls, shields, \n        towers, cannons, catapults or mighty mages!\n      </li>\n<li>\n        Defence: Turn your Scottish Moorhuhn clan's residence into the most \n        impregnable fortress in the Highlands!\n      </li>\n<li>\n        Progression: Upgrade your castle and weapons by up to 18 levels!\n      </li>\n<li>\n        Single-player: Pursue the evil Clan Chief and defeat him in epic \n        battles!\n      </li>\n<li>\n        Multiplayer*: Compete against players from around the world and win \n        gold and trophies.\n      </li>\n<li>\n        Live duels*: Challenge your friends directly and fight for glory ... \n        and gold!\n      </li>\n<li>\n        Looting*: Try to secretly rob other players.\n      </li>\n<li>\n        Recognition*: Let everyone see what you've got in the high-score table.\n      </li>\n</ul><p>\n      Single-player: The game features an extensive 36-part campaign with \n      challenging battles taking place in the Scottish Highlands, in an icy \n      landscape and near lava-spewing volcanoes. Fit out the seat of your clan \n      to build a mighty and prestigious fortress, and upgrade it continuously \n      with better weapons and defense facilities. Pursue the evil Clan Chief \n      from one battle to another, and grow stronger and more powerful. You \n      start out with a small shack, but you will soon be able to improve and \n      expand each element of your residence. Eventually, you will become the \n      lord of an extensive castle, able to withstand heavier attacks. You can \n      play the campaign battles as often as you wish, for an unlimited time.\n    </p><p>\n      *Multiplayer: COMING SOON! Join the battlefield now, start building up \n      your castle and developing the best strategy, and you will get a FREE \n      Feature Pack with several multiplayer options in Spring 2018.\n    </p><p>\n      Looting: Catch random opponents all around the world off-guard by \n      attacking and stealing from them whenever you want. This feature is a \n      real challenge for gamers who enjoy competing with real-life opponents \n      as well.\n    </p><p>\n      Live multiplayer: Play fast, action-packed duels against your friends in \n      real time. Just agree on a password, and you are ready to play. Fight \n      for gold and collect as many crowns as possible. The crowns are the \n      multiplayer reward, determining how high you climb up the leaderboard. \n      Weekly and all-time rankings show who is the No. 1 king in the Highlands.\n    </p><p>\n      The multiplayer mode requires a network connection, while single-player \n      campaigns can be played offline.\n    </p><p>\n      Community: With more than 15 million games sold, Moorhuhn is the \n      best-known and most successful German game character. With \"Moorhuhn \n      Knights &amp; Castles,\" developed specially for the Nintendo Switch, the \n      Chicken opens a new chapter and hits the charts once again. Join the \n      large Moorhuhn community!\n    </p><p>\n      Ready to accept the challenge? Then download \"Moorhuhn Knights &amp; \n      Castles\" NOW! Start building your castle, choose the right weapons and \n      defeat your enemies in this ultimate artillery strategy simulation to \n      become the strongest of all kings!\n    </p><p>\n      Moorhuhn speaks English, Dutch, French, German, Italian, Japanese, \n      Portuguese, Spanish and Russian.\n    </p>", "metacritic": null, "released": "2018-01-11", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/ecb/ecb5990ef0bd3e3d69c57c52294aa814.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 230, "game_series_count": 0, "reviews_count": 0, "platforms": ["Nintendo Switch"], "developers": ["Young Fun Studio"], "genres": [], "publishers": ["Young Fun Studio"], "esrb_rating": null}