{"id": 514288, "slug": "one-run-dungeon-pingpongpotato-asffg123-kakoure", "name": "One Run Dungeon (PingPongPotato, asffg123, Kakoure)", "name_original": "One Run Dungeon (PingPongPotato, asffg123, Kakoure)", "description": "<p>ONE RUN DUNGEON [DUNGEON CRAWLER GAME]</p>\n<p>For Hack UTD 2020 Game Jam</p>\n<p>!!! CONTROLS !!!</p>\n<p>LShift - Dodge Roll<br/>Space - Use Offhand Item<br/>WASD - Movement<br/>LMB - Attack<br/>RMB - Interact With Items/Inventory</p>\n<p>!!! IMPORTANT NOTES !!!</p>\n<p>You press an item on the ground with RMB to pick it up, but you need to DRAG<br/>the item with RMB in your inventory to manage it. Drag it outside of inventory to drop<br/>or drag it into the Weapon or Off-hand slot.</p>\n<p>Weapon Slot is indicated by a SWORD icon in the inventory. A weapon/item placed in<br/>that slot will be used/consumed when pressing LMB. If you don't have anything equipped<br/>you do an UNARMED ATTACK.</p>\n<p>Offhand Slot is indicatred by a HAND icon in the inventory. A weapon/item placed in<br/>that slot will be used alternatively when pressing SPACE.</p>\n<p>IF YOU WANT TO SKIP THE DUNGEON CRAWLING AND FIGHT THE BOSS, GO TO THE DEVELOPER TP AT<br/>THE START OF THE GAME.</p>\n<p>CHOOSE A CLASS AT THE START OF THE GAME:<br/>WIZARD - STAFF<br/>WARRIOR - SWORD<br/>RANGER - BOW<br/>GODMODE - GOD STAFF<br/>THE TRUE ROGUELIKE - UNARMED</p>\n<p>Weapon Abilities:<br/> Sword - Quick melee attack with two hitscans<br/> - ALT = Throws sword for low damage<br/> Staff - Slow ranged AOE attack with an initial hit DMG + AOE DMG<br/> - ALT = Same as normal ability<br/> Bow - Versitile ranged attack that can be quick fired or charged<br/> - ALT = No ALT ability<br/> Unarmed - Quick melee attack with two hitscans, extremely weak<br/> God Staff - Just obliterate everything<br/> - ALT - Obviously the same</p>\n<p>Items:<br/> Jam - Heals the player for 50 HP<br/> - Same as normal ability<br/> Golden Jam - ??? (Beat BOSS)</p>\n<p>ALL SOUNDS ARE IMPORTED EXCEPT THE MUSIC<br/>MUSIC IS OC (ORIGINAL CONTENT), INCLUDING:<br/> - Title Music<br/> - Game Over Music<br/> - Boss Music<br/> - Dungeon Music</p>\n<p>ALL SPRITES ARE OC EXCEPT THE FOLLOWING:<br/> - Fireball Sprite<br/> - Black Fireball Sprite<br/>ORIGINAL SPRITES:<br/> - SLIME (1 Direction)<br/> - SKELETON (8 Directions)<br/> - PLAYER (8 Directions)<br/> - EYEBALL (8 Directions)<br/> - JOKER BOSS (1 Direction)<br/> - CLOWN BALL (1 Direction)<br/> - ARROW (1 Direction)<br/> - DUNGEON TILE MAP<br/> - TITLE SCREEN<br/> - DEATH SCREEN</p>\n<p>Group w/ Roles:<br/> SEIN<br/> - Spriter, Artwork, Music<br/> - Created BOSS attack pattern/idea<br/> - Created SKELETON, SLIME, CLOWN BALL, ARROW, TITLE SCREEN, DEATH SCREEN<br/> - Created ALL MUSIC<br/> - Managed all numbers for balancing, bug tester<br/> - Created map with tilemap<br/> ANTHONY<br/> - Coder<br/> - Created 99% of the scripts and implemented into the game<br/> - Boss Scripter, Enemy Scripter, Player Scripter, Projectile Scripter, Etc.<br/> - Like literally created 99% of the project lmao<br/> - Cannot emphasize how much this man scripted<br/> RICHARD<br/> - Coder, Spriter<br/> - Assisted in BOSS script<br/> - Created PLAYER, JOKER BOSS, EYEBALL, DUNGEON TILE MAP<br/> - Worked on all animation trees and interaction within Unity<br/> - Bug fixes on scripts<br/> - Put in sound effects</p>", "metacritic": null, "released": "2020-10-31", "tba": false, "updated": "2020-11-02T06:54:12", "background_image": "https://media.rawg.io/media/screenshots/8b0/8b078c570c8cec609869b071809e5628.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 57, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["PingPongPotato", "asffg123", "Kakoure"], "genres": [], "publishers": [], "esrb_rating": null}