{"id": 514344, "slug": "i-am-not-a-pumpkin-and-i-am-having-a-horrible-day", "name": "I am not a pumpkin and I am having a horrible day", "name_original": "I am not a pumpkin and I am having a horrible day", "description": "It's Halloween night, the spookiest of nights. Our protagonist is home, minding his own life.  As trick or Treaters arrive, the night turns sour. \r\nCreated by Emil &amp; Olliver for the🎃 Spooktober Jam🎃\r\n<p>This is both of our first ever Game Jam Submission and we are excited to present this top down shooter. Both of us are mainly sound designers by profession, but we figured that this Jam was the perfect opportunity to  have a boxing match with  Unity. We are not experienced programmers, but magically Emil managed to get most of the game working, whilst Olliver focused more on level &amp; sound design. Any kind of feedback or comment is appreciated. Get in touch with either of us if you find yourself to have further questions or just want to talk! Cheers!<br/><br/>\r\nWASD to move, Left mouse to spit seeds, Right mouse to Dash, P to pause (gamepad does not work in menus, but in game). <br/></p>\n<p>\r\nAssets used from Unity Asset Store: <br/></p>\n<ul><li>Horror Axe by ESsplashkid</li><li>Effect textures and prefabs by Magicpot Inc.</li><li>Simple Gems Ultimate Animated Customizable Pack by AurynSky</li><li>Free Stylized PBR Textures Pack by Lumo-Art 3D</li><li>Low Poly Ultimate Home Pack by Streakbyte</li><li>Low Poly Street Pack by Dynamic Art</li></ul>", "metacritic": null, "released": "2020-10-31", "tba": false, "updated": "2020-11-02T07:07:04", "background_image": "https://media.rawg.io/media/screenshots/ac1/ac1ffa69a3edd8fea09c0b975c0427fa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 22, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Emil", "Olliver"], "genres": [], "publishers": [], "esrb_rating": null}