{"id": 514391, "slug": "strewed-gears", "name": "Strewed Gears", "name_original": "Strewed Gears", "description": "<p><strong>(Soon avaible in the Google Play Store)</strong></p>\n<p>Remember that the project is under development, so if you want, leave a feedback to let me know what to improve! The final version will be released soon in the Play Store for Android.</p>\n\n<p>Welcome to Strewed Gears. In this Universe you will control a robot that will have to escape from a drone, collect the gears scattered around the world and finish the levels within a specific time, as well as avoiding the hits of the enemy turrets or looking for the hard drives hidden in some levels.</p>\n<p>I warn you, you will have to be very DETERMINED to \"move forward\" in this world and to understand, in the end, the reason for the existence of the entire Universe. But it will not be easy at all... quite the opposite!</p>\n<p>Will you be determined enough?</p>\n<p><strong>Strengths (according to our Universe):</strong></p>\n<p>- You can unlock skins or decorations for the protagonist from \"other different Universes\" that I cannot name for the copyrights, XD<br/>- Lots of levels to complete in order to reach the end and get all the answers you are looking for.<br/>- Soundtracks made especially for the game (and for this alone I already expect at least 1 million downloads XD).<br/>- Ability to find numerous hard drives, \"cleverly\" hidden in some levels, to obtain resources.<br/>- Simple controls, everything else can sometimes seem extremely difficult.<br/>- Seriously, the audio tracks of this game are something fantastic!</p>\n\n<p><strong>Strewed Gears is:</strong></p>\n<p>- A platform game consisting of 4 modes: Endless mode, Escape Mode, Points Mode and Time Mode.<br/>- Suitable for all ages (basically, anyone who has nothing better to do).<br/>- An Easter Egg: if you find it then thank you, I will know that I have not only wasted time writing this description!<br/>- Not particularly suitable if you feel you are unable to maintain control or calm, and are serious.<br/>- Seriously, don't complain in reviews saying \"But it's ToO hArD! 11! 1 !!\"...<br/>- An independent game.</p>\n\n<p><strong>NOTE:</strong></p>\n<p>Strewed Gears is an independent project by the Italian developer Fralev.<br/>I deliberately didn't put in-app purchases, advertisements or stuff as this because this is not my idea of what an independent video game of this genre should be, simply and only for this. So, if by any chance you get so enthralled with this game that you want to share with your friends, know you would do me a huge favor!</p>\n\n<p>\"Stay Determined\" &amp; <br/>\"Don't Forget\"<br/>(14-6)</p>\n<p>Happy Birthday Matti!</p>", "metacritic": null, "released": "2020-10-30", "tba": false, "updated": "2020-11-02T07:17:05", "background_image": "https://media.rawg.io/media/screenshots/27a/27a08f8ddbc7f41ce113d842fa25ef86.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 168, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Fralev"], "genres": ["Adventure", "Platformer"], "publishers": [], "esrb_rating": null}