{"id": 514309, "slug": "squid-savings", "name": "Squid Savings", "name_original": "Squid Savings", "description": "<p><strong>Download the executable for your system for better performance than the in-browser version.</strong></p>\n<p>Welcome to Squid Savings. A short, casual open world exploration game (maybe a metroidvania if you count all the backtracking) made in under 24 hours (non-continuous) for the GDS Fall-O-Ween 2020 jam.</p>\n<p>The challenge - in a similar vein to Miz jam - was to use the GDS Fall-O-Ween 2020 art kit by frecklebars in the most creative way possible. All art in the game is from that kit, most of it modified in some way.</p>\n<p>Music is by yours truly. My goal with this jam was to show myself I can make both a game and it's soundtrack quickly to a reasonable degree of quality. The open world aspect is just an idea that got out of hand, and honestly if there are any bugs now you know why 😅 I'm pretty happy with how the music turned out - considering that it was made in a panicked frenzy near the end - and you can download it below for free. The <strong>soundtrack</strong> is licensed under a Creative Commons Attribution 4.0 license (as detailed in the thank you note) so you can feel free to use it as you please with credit.</p>\n<p><strong>Control Scheme</strong><br/>Tutorialised in-game anyway but here it is:</p>\n<ul><li>Hold the left mouse button to swim towards the mouse</li><li>Hold space to swim faster</li><li>Press the right mouse button to throw a bomb towards the mouse if you're holding one</li><li>You can throw bombs further if the mouse is further away from the player</li></ul>", "metacritic": null, "released": "2020-10-31", "tba": false, "updated": "2020-11-02T06:59:43", "background_image": "https://media.rawg.io/media/screenshots/f23/f233b66705ee7a7c465fd4186ea92c1b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 19, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["SwiftVector"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}