{"id": 51439, "slug": "duralumin-wind", "name": "Duralumin Wind", "name_original": "Duralumin Wind", "description": "I'm a self taught game developer and this is my first commercial release. In the game you pilot a helicopter across four levels. Expect a stright forward shooter, with some simple resource management. I would appreciate any feedback and will do my best to be of help if you have issues with the game. Contact me on twitter, my website or on the forums and I will do my best to get back to you. <br/><br/>Thank you for taking the time to check out this game, and I hope you find it enjoyable.<br/>Francisco Arias - CETVE LLC<br/><br/><br/>Each of the four levels are composed of series of individual objectives that must be completed to clear the level. You pilot a helicopter with limited ammunition, health and fuel, each of which will need to be replenished as you play by finding pickups scattered across the level. Accessing your map and mission objective screen will help you navigate between points on the map. The camera can either rotate with the helicopter or stay fixed in its orientation. Movement can be swapped between either a fluid gliding feel or a more rigid feel.  Their is no saving mid level, instead the game automatically unlocks the next level upon the completion of the current level and saves your progress. At any time you can pull up the game options menu and customize the difficulty level.<br/><br/><br/><br/>Currently the game only supports the keyboard and mouse.<br/><br/><br/><ul><li>Twin stick helicopter shooter.<br/></li><li>Steam achievements<br/></li><li>Easily adjust difficulty level at any time.<br/></li><li>Featuring game play inspired by Jungle Strike and Red Zone.</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:03:01", "background_image": "https://media.rawg.io/media/screenshots/9d2/9d2a3910f614613e701945bb271ea2ac.jpg", "website": "http://www.cetve.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 6}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 274, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["CETVE"], "genres": ["Action", "Indie"], "publishers": ["CETVE"], "esrb_rating": null}