{"id": 514580, "slug": "path-of-the-midnight-sun-demo-v004", "name": "Path of the Midnight Sun - DEMO v.0.0.4", "name_original": "Path of the Midnight Sun - DEMO v.0.0.4", "description": "<p>The continent of <strong>Arvium</strong>. Sixty years ago, these lands bore witness to the arrival of a being henceforth known as the <strong>Demon King</strong>. Where he appeared from; none could say. Nature itself twisted before his very existence, and it wasn’t long before a horde of demons and monsters fell upon the nations of man.<br/></p>\n<p>No matter how many times these heroes struck down the Demon King, death proved to be naught but a temporary setback. He soon returned; He always did. <br/></p>\n<p>Driven to desperation, it was the learned men of Arvium who would discover a solution. The Demon’s soul would be pulled from His body, and <strong>sealed</strong> within that of a human. </p>\n<p>In time, these custodians of the Demon King’s soul would come to be known as “<strong>Vassals</strong>”, recalling the original meaning of the term which was used to define those who entered into a mutual obligation to a lord or a monarch.</p>\r\n\"The gameplay takes inspiration from both RPG and VN classics such as Fire Emblem, Etrian Odyssey and Phoenix Wright.\"\r\n<p>In Path of the Midnight Sun, whose gameplay takes inspiration from both RPG and VN classics such as Fire Emblem, Etrian Odyssey and Phoenix Wright, you'll follow the current Vassal of the Demon King, Lady Faratras Hoikade.<br/>She has contained the Demon King’s soul for nearly 21 years, the longest serving Vassal so far. The people have begun to grow complacent, to truly consider the possibility that perhaps He is sealed for good. But as is so often the case, outward appearances can be deceptive.</p>", "metacritic": null, "released": "2020-10-30", "tba": false, "updated": "2020-11-02T08:02:56", "background_image": "https://media.rawg.io/media/screenshots/50f/50f4c2491c06fb8615e99a2b69609f17.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 265, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Studio Daimon"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}