{"id": 51471, "slug": "circle-pong", "name": "Circle pong", "name_original": "Circle pong", "description": "<strong>Circle Pong: The Circular Twist on Classic Arcade</strong><br/><br/>Circle Pong is a game. A top down 2D arcade game that adds a unique circular twist to a classic, multiple game modes, and fast paced game play with a high skill ceiling.<br/>It's like pong but in a circle. <br/><br/><strong>Visuals and sounds</strong><br/><br/>Circle Pong combines bright vibrant colors, abstract designs, and synthwave music to create a fun geometric/synth feel. <br/><br/><strong>Gameplay Overview</strong><br/><br/>Circle Pong is for the hardcore and casual gamer, whether you are looking for a challenge with an impossible skill celling or just a quick arcade fix. The gameplay is intuitive yet challenging, with a few different game modes that everyone can play but not all can beat:  <br/><br/><strong>Infinite:</strong> The essence of Circle Pong, where the player must keep the ball with in the area for as long as possible. The balls speed increases with each point gained, demanding quicker reflexes. This game mode contains a shield power-up that acts as a onetime safety net until its recharged. <br/><strong>Finite:</strong> Unlike Infinite, Finite has a defined beginning and end, this mode tasks players to decrease a score from 100 to 0 points. But other than that, it is very similar. <br/><strong>Block Bust: </strong>Bust all blocks in each stage to win by aiming the ball to collide with the blocks. There are four unique stages each with a different set of blocks where each stage has different block behaviors. <br/><strong>Double:</strong> Double the balls, double the challenge, and double the points. This mode requires players to manage two balls simultaneously, increasing both the difficulty and the rewards.", "metacritic": null, "released": "2018-02-02", "tba": false, "updated": "2024-03-29T08:43:40", "background_image": "https://media.rawg.io/media/screenshots/e33/e33146bbf0726c5e88a4cd135bffb4f4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 59, "beaten": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 19, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Dexion Games", "AuSome Software"], "genres": ["Action", "Strategy", "Casual", "Indie"], "publishers": ["Dexion Games", "AuSome Software"], "esrb_rating": null}