{"id": 51474, "slug": "snappy-turtle-ultimate", "name": "Snappy Turtle Ultimate", "name_original": "Snappy Turtle Ultimate", "description": "Take a refreshing break from epic quests that demand equally epic amounts of your time, and come visit the colorful cartoony world of Snappy Turtle.<br/>\n<br/>\r\nDive right in, and swim through four deceptively dangerous waters... eating as many goldfish and dragonflies as you can while avoiding or defeating hungry predators and obstacles along the way.<br/>\n<br/>\r\nTurtle acrobatics have never been so easy; a single tap on your keyboard, mouse, touch screen, or control pad makes Snappy swim, and whenever there's an obstacle or meanie you can't avoid, execute your indestructible spin move.  <br/>\n<br/>\r\nThose still green around the gills can play in the two casual environments. With their less hectec pace and with Snappy's ability to spin for an unlimited amount of time, even turtle-like reflexes can get  Snappy to the goal.<br/>\n<br/>\r\nOnce you've honed your turteling skills you're ready to take on the two Marathon environments, and to replay the casual environments more agressively... risking your shell for higher scores and to unlock all the achievements Snappy Turtle Ultimate challenges you with. <br/>\n<br/>\r\nThe faster Snappy eats consecutive snacks, the higher the score multiplier becomes. This is not only the key to beating your old best scores, but also the key to unlocking the Mega Turtle modes, which are unique to each environment!<br/>\n<br/>\r\nWhat are you waiting for? Let's take this half-shell for a spin, in Snappy Turtle Ultimate.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:03:00", "background_image": "https://media.rawg.io/media/screenshots/e87/e8775e9b21efcaaae45bd83e58ae2f3c.jpg", "website": "https://www.bitbeamcannon.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 10}, "playtime": 0, "achievements_count": 38, "ratings_count": 0, "suggestions_count": 258, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BitBeamCannon.com"], "genres": ["Action", "Casual", "Indie"], "publishers": ["BrashMonkey.com"], "esrb_rating": null}