{"id": 51487, "slug": "bad-north", "name": "Bad North", "name_original": "Bad North", "description": "<p>Your home is under attack. The king is dead at the hands of Viking invaders. Hope is a distant glimmer in the fog, fading fast with every passing moment. As you rise to take your father’s place as ruler, it will fall to you to stage your defenses. But make no mistake – this is no fight for victory, but a desperate grasp for survival.</p>\n<p>Bad North is a charming but brutal real-time tactics roguelite. Defend your idyllic island kingdom against a horde of Viking invaders, as you lead the desperate exodus of your people. Command your loyal subjects to take full tactical advantage of the unique shape of each island. Everything is at stake: fail, and watch the blood of your subjects stain the ground red.</p>\n<p>It’s charmingly brutal, with beautiful procedurally-generated islands and adorable soldiers juxtaposed against the blood-stained realities of war. You control the broad strokes of the battle, giving high level commands to your soldiers who try their best to carry them out in the heat of the moment. It’s accessibly deep, with simple player inputs masking a dynamic combat simulation that make it inviting to new players while challenging veterans.</p>\n<p>Keep fighting, warriors. Not for power or riches or glory, but for hope of peace to come once again in the harsh lands of the Bad North.</p>\n<p>Key Features:<br />\n• REAL-TIME TACTICS ROGUELITE: Position and relocate your troops to fend off the Vikings, who each have their own counters to the threats you pose. Pick your battles and plan your evacuations carefully! Lose a commander and they’re gone forever; lose everything, and it’s game over!<br />\n• INTELLIGENT UNIT CONTROLS: You command the broad strokes of your defenses and monitor positioning — your soldiers do the rest, navigating and engaging intuitively in response to the situation at hand.<br />\n• PROCEDURALLY-GENERATED ISLANDS: Each island is both stylistically charming and unique in its layout. Plan your strategies around every nook and cranny, for you only get one chance to save them from the enemy invasion.<br />\n• UNLOCKABLE UPGRADES: A stronger, smarter defense leads to greater rewards. Use these to develop your subjects from a ragtag militia into seasoned warriors.</p>", "metacritic": 70, "released": "2016-11-16", "tba": false, "updated": "2023-12-25T23:44:28", "background_image": "https://media.rawg.io/media/screenshots/c33/c3316ad8dac378244c48c1d93377e773.jpg", "website": "https://www.badnorth.com/", "rating": 3.63, "rating_top": 4, "added_by_status": {"yet": 86, "owned": 1123, "beaten": 56, "toplay": 41, "dropped": 69, "playing": 13}, "playtime": 2, "achievements_count": 55, "ratings_count": 136, "suggestions_count": 288, "game_series_count": 0, "reviews_count": 142, "platforms": ["Nintendo Switch", "PlayStation 4", "iOS", "Xbox One", "Android", "PC", "macOS"], "developers": ["Raw Fury", "Plausible concept"], "genres": ["Action", "Strategy", "Simulation", "Indie"], "publishers": ["Raw Fury"], "esrb_rating": "Teen"}