{"id": 514905, "slug": "bus-driver-simulator", "name": "Bus Driver Simulator", "name_original": "Bus Driver Simulator", "description": "To play this game on PS5, your system may need to be updated to the latest system software. Although this game is playable on PS5, some features available on PS4 may be absent. See PlayStation.com/bc for more details.<br/>All aboard, please, the ride's starting. Punctually like clockwork you start your working day as a bus driver and transport your passengers safely to their destination. In the hustle and bustle of city life, it is not always easy to keep to schedules, follow traffic rules and turn your blinkers at the right intersection. Timetables through big cities as well as numerous trips in suburbs provide variety and long-term driving pleasure!  Buses from various eras and countries will accompany you on your journeys. Buy new buses with your hard-earned money or design your already available vehicles according to your taste!  Play in free mode or fulfill different scenarios while you live your dream job and take over an important role in public life!<br/><br/>Features:<br/>• Different busses from different countries and epochs guarantee you varied journeys.<br/>• Real cities and suburbs on an area of 12 km² let you meet your timetables on a wide variety of routes.<br/>• Numerous possibilities to upgrade and design the buses - give your vehicles your own personal touch.<br/>• Different weather conditions and times of the day demand your adapted driving behaviour.  <br/>• Different traffic situations such as accidents, traffic jams, night drives or long-distance journeys demand your skilful and considered action.<br/><br/><br/>Offline single player<br/>PS4 game can be controlled via PS Vita<br/>Enhanced game play on PS4 Pro console<br/><br/><br/>Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy). <br/><br/>Software subject to license (us.playstation.com/softwarelicense). <br/><br/>One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.<br/>", "metacritic": null, "released": "2020-11-03", "tba": false, "updated": "2023-07-10T03:05:21", "background_image": "https://media.rawg.io/media/screenshots/ac9/ac9b6b5d67c2025abef07f2e24529f8a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 5}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 283, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "PlayStation 4"], "developers": ["KishMish Games"], "genres": ["Simulation"], "publishers": ["KishMish Games"], "esrb_rating": null}