{"id": 514915, "slug": "archers-tale-rogue-hunter", "name": "Archer's Tale: Rogue Hunter", "name_original": "Archer's Tale: Rogue Hunter", "description": "Archer’s Tale is a fast-paced action RPG game mixed with roguelike randomly generated dungeons. You are the archer hero on your quest to become the master of arrows, bow, and crossbow. Explore a fantasy world full of dungeons and mazes and fight your way through mystic places in this dungeon crawler action game.<br/><br/>Start a journey where you will destroy evil beasts, mythical bosses, and waves of monsters in battles full of strategy and tactics. Do you have what it takes to become an epic adventure archer?<br/><br/>CHOOSE YOUR SKILLS: give your archer elemental arrows, faster attack speed, or multiple arrows. <br/><br/>POWERFUL EQUIPMENT: Choose from bows, crossbows, helmets, and capes. Create a powerful hero with unique builds.<br/><br/>UNIQUE SPELLS: Powerful shields, life drain attacks, poison arrow and many other skills will be earned for each successful dungeon run.<br/><br/>ENEMY WAVES: Evil enemies and bosses have defeated many an archer who has dared to set foot in their dungeon. Will you be the one to survive?<br/><br/>EASY TO PLAY, HARD TO MASTER: 100+ different monsters with special attacks and skills that you'll want to memorize and learn to avoid.<br/><br/>MYTHICAL BOSSES: Unique, challenging bosses live in the dungeons, protecting powerful items that are worth fighting for.<br/><br/>RANDOM DUNGEONS: Start your adventure on a beach that leads to an incredible yet dangerous Atlantis.<br/><br/>Smash boss enemies<br/>Explore fantasy dungeons filled with obstacles and legendary beasts with your master hunter archer. In this action-adventure game, you are the hero, out to slay epic boss monsters. Dodge their attacks and break their defenses with your powerful weapons and skills. Epic gems and new equipment will be your reward if you win the roguelike battle. Choose your weapon and enter the arena to fight for survival  - only the toughest archery master can win. <br/><br/>Level up your skills<br/>Want burning arrows or bullets that poison your enemies? This idle RPG game offers you a huge variety of talents to train on your way to being the master archer. You decide the archer’s fate by mastering magic hunter attacks to complete quests for epic loot. Claim unique rewards to level up your archer hero. <br/><br/>Hunter for legendary items<br/>In Archer’s Tale, you can explore roguelike dungeons, collect epic weapons and equipment that you can level up and enhance with powerful gems and magical artifacts. Craft unique bows and upgrade arrows to make every shot a headshot and become the master of arrows. <br/><br/>Why this dungeon crawler game is awesome<br/>Random dungeons.<br/>Every run is unique.<br/>Powerful collectible items and gear.<br/>Nonstop action game.<br/>Unique hero builds.<br/><br/><br/>This idle action RPG offers you everything from casual dungeon grinding to archery master role-playing strategy.", "metacritic": null, "released": "2020-09-05", "tba": false, "updated": "2020-11-06T01:58:10", "background_image": "https://media.rawg.io/media/screenshots/ed5/ed52208e121d0f138b2d369f05f21ca6.jpg", "website": "https://babilgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 150, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Babil Games"], "genres": ["Action", "Adventure"], "publishers": ["Babil Games"], "esrb_rating": "Everyone 10+"}