{"id": 51497, "slug": "stranded-alone", "name": "Stranded Alone", "name_original": "Stranded Alone", "description": "Stranded in space, alone, with no one left. You are the sole survivor of an exploration crew on a distant planet defending yourself from the terrors of the night. <br/>\n<br/>\r\nThe game is a top down isometric survival shooter where the player (You) tries to survive the longest and obtain the highest score!<br/>\n<br/>\r\nThe game includes 4 playable characters, each with unique stats shown in the character selection screen. The 4 characters includes: Eugene the Gunsman, Barry the Sniper, Jimmy the Scout and Marcel the Gunner. Eugene the Gunsman is a well balanced class between speed, damage and fire rate. Barry the Sniper excels at damage but lacks mobility and fire rate. Jimmy the Scout is a playful character, he is the fastest man on the planet but unfortunately, his damage may be off putting. Marcel the Gunner is the roughest, toughest space solider around with a high fire rate and high health, he's sure to survive the night!<br/>\n<br/>\r\nThe game also includes a global highscore and a local highscore system.<br/>\n<br/>\r\nThe global highscore system features the Top 10 players worldwide!<br/>\n<br/>\r\nThere are two game modes, normal and ranked. Normal mode allows you to hone your character and survive at an easier pace. Whereas ranked is more intense and challenges the player to survive. The normal score is posted locally and the ranked score is posted in the global highscore. <br/>\n<br/>\r\nSurvive the longest and get the highest score possible!<br/>\n<br/>\r\nOther key features include: Silly phrases and voice acting by the Dev.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:03:00", "background_image": "https://media.rawg.io/media/screenshots/559/559760b53ae34f4f9df180a504392698.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 11}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 177, "game_series_count": 0, "reviews_count": 1, "platforms": ["Linux", "PC", "macOS"], "developers": ["Tanny Tran"], "genres": ["Action", "Strategy", "Casual", "Indie"], "publishers": ["Tanny Tran"], "esrb_rating": null}