{"id": 515094, "slug": "kid-hallow", "name": "Kid Hallow", "name_original": "Kid Hallow", "description": "Kid Hallow is an action/puzzle game all about slipping on a variety of Halloween costumes to get past horrifying monsters that will haunt your nightmares, and of course, collecting all the Candy Corn. It's a brutally difficult precision platformer - but only if the player who built the level made it that way (mostly they do though, let's be honest). Don't like that? Make your own easy levels!<br/><br/><br/><br/><br/>Each costume has unique abilities, shifting the gameplay from action-slasher to puzzle-solving and everything in between. Build your own levels using the extremely simple level editor, and share them online with the world! Rate and compete on endless levels created by your fellow players.​<br/><br/><br/><br/><br/>Includes 9 more costumes and dozens of enemies and objects from the Winter Pack, Dumb Pack, and Fantasy Pack. Play as a Wizard with fire and ice powers, the fattest Santa Claus you've ever seen, Happy Stick Ninja, and more!<br/><br/><br/><br/><br/>Originally released in 2008 as Costume Party, we've updated this game for 2021 with shiny new technology, starting with over a dozen new tiles that can interact in a myriad of ways - from the Earth Shrine that pacifies all botanical enemies (that is, if you light all the Earth Shrines in the level...), to the Poltergeist which can both possess enemies to supercharge them and possess any block to turn it into a hidden threat. We've also added a ton of visual enhancements and new effects. Best of all, many of the costumes have received upgraded abilities - the Vampire can now turn into mist to dodge bullets, Bouapha can pick up and throw Princesses and Baby Penguins (trust me, this makes sense once you play the game), Santa can drop Gifts in mid-air, and most amazing of all, Kid Hallow himself can now duck! It doesn't do anything, but it sure looks cool.", "metacritic": null, "released": "2020-11-05", "tba": false, "updated": "2021-11-05T03:43:20", "background_image": "https://media.rawg.io/media/screenshots/e45/e456569d72ba9122957e2ab522be6bc6.jpg", "website": "http://hamumu.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 34, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC", "Linux"], "developers": ["Hamumu Games", "LineartLemur"], "genres": ["Action", "Indie"], "publishers": ["Hamumu Games"], "esrb_rating": null}