{"id": 51506, "slug": "gump", "name": "Gump", "name_original": "Gump", "description": "Well then. this is a game about doobie. he is a boy genius and he invents his gadgets in his lab. doobie makes a flying jet and fly accroass the lands. he meets the quibles and the land of gump. This is the story of doobie and his journey in Gump with the quibbles. this is. action adventure arcade style platformer like game. meaning you can have the feel of the arcade shootout yet have the puzzling progression when flying like the platformer and the enemies are in platform like placement as well. the Flyig of the player object is almost the same as the open world and the maps are long. the enemies don't just die with one shots. nether they just go out and vanish. there is a interaction between the enemies and the player as well as the over all game.<br/><br/><strong>Game Play</strong><br/>the Gameplay is simple yet complex. you get to upload weapons and you have to like all platformer avoid the traps. such as thunderbolts or tall trees with boobie trap. you get to fly around a open world 2d game and mingle with the quibbles and the bosses. the ammos are not so serious as starting off with a time bomb you start the attack. the quibles can avoid your attack or run frantically  here and there when hit. the over all game play is not a walking simulator or a factory scenario neither it is a arcade just keep on shooting till everything blows up. rather you need to concentrate how you are flying and the quibbles are not a one hit dead proposition. as you start to enjoy the characters you will find the game much more enjoyable.<br/><br/><strong>the Custom Game maker</strong><br/>The Custom game maker is there for oyu to explore and practice ore of the options you want to try out. may be the gun or the Ammo's or the technique of flying across. you can however just hover and do nothing and keep on dropping Ammo's on top of the quibles but that defeatst he purpose of the game. fly. drop ammo shot'em with your guns. get a charger fly fast and powerup.<br/><br/><strong>the doobies lab</strong><br/>The dobies lab is a secret addition to the upgrade console. here the upgrade is a game as well. yoy get to experiement with elements and research your own upgrades and unlock them. there are upgrades in the levels as well. but that is a secret where.<br/><br/><strong>the menus</strong><br/>the menus in this game a re bit diffrent than normal text baswed ui, rather oyu have to use the buttons and the icons to operate with.<br/>And thats about it. this game has plenty of stages for your disposal. enjoy doobie and the quibles.<br/><br/><strong>Guns and Ammos</strong><br/>The guns and the ammo's are a bit on te comical side as it is not a game to go war on countries. or you are not fighting the cia with a 9 mm reload reload. but a array of funny type of guns and the bombs are like that as well such as the following dynamite character or the alien drones with laser vision. i could have made a banana gun as well for that matter.<br/><br/><strong>Technical </strong>:<br/>The levels are sprite heavy. so they need a bit of time to load. sorry about that. noway to workaround to that. but with a 4th genaration computer oyu should be good to go. the game is a co- op mission as well where two players can play with two controlers. it's been configured for x-box controlers. may function well with laystation controllers as well.", "metacritic": null, "released": "2018-01-23", "tba": false, "updated": "2020-08-27T18:21:13", "background_image": "https://media.rawg.io/media/screenshots/1b0/1b03efc9c91813624f9fa1a6fce65462.jpg", "website": "https://workshop-alternatum.wixsite.com/gump", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 31}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 153, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Workshop-alternatum", "Ursine"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["Ursine", "Workshop-alternatum"], "esrb_rating": null}