{"id": 515114, "slug": "esports-manager-itch-neurona", "name": "Esports Manager (itch) (Neurona)", "name_original": "Esports Manager (itch) (Neurona)", "description": "<p>Esports Manager - is an Android mobile game that injects you into the real-life experience of being an Esports organization manager. Create your own organization or use the existing ones! Want to win The International? Go ahead and lead your team to glory!<br/></p>\n<p>• Buy/sell/loan players from the other teams. Build a new all-star line-up!<br/>• Train your players. You can train the skill/moral/physical attributes of your players. Also, you can send them to the psychologists, on massage, teambuilding events, boot camp or vacation. Be wise and careful since you can only have 60 hours per week for training.<br/>• Take part in tournaments and any kind of event. Make it to \"The International\" or \"Major\", let your organization become top-1 of the ratings!<br/>• Hire new staff members such as analytics, trainers, junior managers, newsmakers, digital/marketing specialists and others!<br/>• Acquire a new organization if you are feeling you are big enough for this scene.<br/>• Develop your own brand, make deals with other companies, increase your revenue and invite more useful people to the organization.<br/>• Talk to your players and impact on their motivation.<br/>• Choose your game tactics.</p>\n<p>If you have any kind of suggestions or ideas - please let us know.<br/>Our Reddit - https://www.reddit.com/r/esportmanager/.</p>\n<p>Our site - https://esportsmanager.gg</p>", "metacritic": null, "released": "2020-11-05", "tba": false, "updated": "2020-11-06T02:41:09", "background_image": "https://media.rawg.io/media/screenshots/2e1/2e17cfd646884096f002127801ec2d09.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 130, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Neurona"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}