{"id": 51544, "slug": "creatio-ex-nihilo-iii-amor-dei", "name": "Creatio Ex Nihilo III: Amor Dei", "name_original": "Creatio Ex Nihilo III: Amor Dei", "description": "After the conclusion of 'The War of Gods', some of the divine immortals decided to settle down on the planet of Astea where they created their own heavenly domain from where they could watch over and judge the mortal realm. They would see mortals wage war and die; over and over again. And thus, the sacred order of the universe was kept... Until a forbidden love shattered the balance between divines and mortals.<br/><br/>For the first time in the series, you will take on the role of a mortal. You will guide her through the barbaric life on Astea, where the road to a civilized society seems very long and uneven. You will go on an epic adventure where you will meet elves, centaurs and many other fantastical beings. But, most importantly of all, you will be swept away to the beautiful heavenly realm by a god who has been watching you and loving you as long as he remembers. However, not everything is going to turn out just like the fairy tales you were told when you were a child. Your love is not appreciated by the deathless gods ruling over you. And that has consequences. Soon you and every mortal on Astea will feel the wrath of a scorned god.<strong>Features:</strong><ul><li> Strategic Turn-Based Battles<br/></li><li> Immersive Storyline <br/></li><li> Visual Novel Style Cutscenes<br/></li><li> Female Protagonist</li></ul>", "metacritic": null, "released": "2018-01-26", "tba": false, "updated": "2019-08-28T22:02:57", "background_image": "https://media.rawg.io/media/screenshots/46b/46bd3de44c26587a4b7ca7149c167d18.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 212, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Shoho Games"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Shoho Games"], "esrb_rating": null}