{"id": 515581, "slug": "enhanced-shooter-game", "name": "Enhanced Shooter Game", "name_original": "Enhanced Shooter Game", "description": "<p>This project has been developed with Unreal Engine 4.</p>\n<p>Shooter Game is a Epic Games multiplayer first person shooter. I have enhanced the basic version with several modifiers.</p>\n<ul>\n<li>\n<strong>Teleport</strong>: The player is able to teleport forward, in parallel to the ground, and can do it again after a cooldown. The teleport will actually move the player if there are no collisions forward; if there are, the teleport moves the player until the collision point. This feature has been tested also with a lag simulation of 500ms, with 30% lag variance.</li>\n<li>\n<strong>Jetpack</strong>: Player has an energy pool he can use to fly simulating a jetpack. The energy gets recharged when not flying and it’s displayed on the HUD.</li>\n<li>\n<strong>Wall Jump</strong>: The player is able to perform a lateral jump while flying very close to a wall. This jump will push the player to the opposite direction of the wall, and a bit higher than before.</li>\n<li>\n<strong>Freezing Gun</strong>: When hitting an opponent with this weapon he gets freezed and cannot move or shoot for a specific amount of time. He can however look around.</li>\n<li>\n<strong>Shrink Gun</strong>: When hitting an opponent with this weapon he gets very tiny for a specific amount of time. If during this time another player stomps on him, then he dies. The \"shrinking\" is interpolated over time, and the amount of remaining time shrinked appears on the HUD of the affected player.</li>\n<li>\n<strong>Rewind Time</strong>: Player is able to rewind his time (position, rotation, health, ammo) without affecting others gameplay. During the rewind the player is invisible and invulnerable, like being in a \"wormhole\", then returns normal at the end of the effect, and can reuse the ability after a cooldown. Information about the time rewinding appears on the HUD. This feature is similar to the Overwatch Tracer's one.</li>\n<li>\n<strong>Wall Run</strong>: Player is able to run and jump on walls for a specific amount of time. The player can run on the wall by jumping on it laterally, looking in the direction of run. While in wall run, the player has a certain autonomy to look externally and do other things, like shooting; if the player looks too externally, he gets off the wall. If he jumps from a wall to another, the wall run continues and the allowed run time resets.</li>\n<li>\n<strong>Drop Weapon</strong>: A killed player drops all his weapons with the current amount of ammo remaining. These pickups remain in-game for a certain amount of time and then disappear. The drop weapon can be picked up by walking on it and restores the same type of weapon ammo, in a \"fps arena\" manner.</li>\n</ul>\n<p>All these modifiers have been developed and tested for single player and LAN multiplayer play, and are compatible with PvE and PvP modes.</p>\n<p>ACTIVE ABILITIES COMMANDS:</p>\n<ul>\n<li>\n<em>teleport</em>: 'E' key</li>\n<li>\n<em>jetpack</em>: 'X' key</li>\n<li>\n<em>rewind time</em>: 'Z' key</li></ul>\n<p>All the other gameplay commands are the PC FPS's classics (WASD, space, mouse, etc.)</p>\n<p>Enjoy! :)</p>", "metacritic": null, "released": "2020-11-03", "tba": false, "updated": "2020-11-06T04:17:52", "background_image": "https://media.rawg.io/media/screenshots/f3c/f3ca30496aaa65649483cc8883fa10d3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 375, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["drumangel92"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}