{"id": 5155, "slug": "circles", "name": "Circles", "name_original": "Circles", "description": "<p>The game idea of the circles is inspired from a war strategy called “Chakravigua” described in the Indian epic Mahabharata.  The Sanskrit word Chakravigua means Circle strategy where a battalion forms a circle around the king to protect him.<br />\nCircle puzzle is designed in similar fashion. The player’s circles (Blue small circles) are distributed in border of big circle where the objective is to move the blue circle toward zero to conquer it. Defending player’s circles (orange small circles) are distributed around the golden zero where the object is to destroy the all the blue circles.<br />\nMoving the circle around works based on simple logic which described in game mechanics section. The player can destroy the opponent circles using simple math skills like (5+3 =?), (4-2 =?).<br />\nFeatures<br />\n•   Three difficulty modes (Easy, Medium &amp; Hard).<br />\n•   40 levels in each mode<br />\n•   120 total levels<br />\nKey control<br />\n•   Directional keys is used to move the cursor<br />\n•   The cursor color will change on rotatable circles.<br />\n•   Right Trigger is used to rotate the selected circle in clockwise direction.<br />\n•   Left Trigger is used to rotate the selected circle in anticlockwise direction.<br />\n•   Triangle Button is used to restart the button. Conformation window will pop-up on the triangle button press.<br />\nPurchase or use of this item is subject to the PlayStation®Network Terms of Service and User Agreement. If you do not wish to accept all these terms, do not purchase or use this item. This item has been sublicensed to you by Sony Computer Entertainment America. One-time license fee for downloads to up to 2 console systems and 2 portable systems that are associated with the purchasing account.</p>", "metacritic": null, "released": "2009-11-19", "tba": false, "updated": "2023-05-02T13:19:01", "background_image": "https://media.rawg.io/media/screenshots/968/9680944676cad290d2a33ea40fd06b58_e10iFkg.jpg", "website": "http://cherrypickgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 43, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Gameshastra", "cherrypick games"], "genres": ["Arcade", "Puzzle"], "publishers": ["Cherrypick Games"], "esrb_rating": null}