{"id": 515569, "slug": "mycivilwar", "name": "MyCivilWar", "name_original": "MyCivilWar", "description": "<p>Rise soldier! It’s time to battle, it’s time to wage war! Take up arms and eliminate the rebels who have thrown your homeland into chaos. \r\n</p>\n<p>Heavily inspired by the great GBA classic CT Special Forces, this shooter is surely going to take you on a walk down the memory lane. Featuring modern design, physics based characters and retro 2D style, MyCivilWar embarks you on an action-packed journey to defeat those who were once brothers-in-arms and fellow companions<br/></p>\n<p><strong>Story</strong>\n</p>\n<p> You are “Elyr”, a veteran soldier of the peaceful United Congregation of North Africa (UCNA). The latter union is going through an unprecedented riot action and rebel movements; Your intel states that the man behind the coup in no other than your brother “Malik”, an equally able soldier and a toughened fighter. Set in the year of 2020, the action takes you throughout various locations in North Africa: From sun-scorched deserts to grassy plains, from sandy shores up to mountainous zones; various landscapes and plenty of enemies. Your goal? To take the adventure and to eliminate the rebellious “Essorism” movement led by your brother. Fight, explore, and get to know the causes that motivated your own fellows to take up arms against the order of the UCNA.</p>\n<p>The project MyCivilWar has started in August 2019, it is the first project of the team and still has no backers.\r\n  </p>\n<p>It is a 2D platformer shooter game where you play as a soldier and fight against soldiers who were under the same flag as you.\r\n  </p>\n<p>Controls</p>\n<ul><li>AD - Move</li><li>WS - Look up/down</li><li>Left Mouse - Shoot</li><li>Right Mouse - Melee Attack</li><li>SPACE - Jump</li><li>C - Crouch</li><li>SHIFT - Run/Grab Wall</li><li>R - Reload</li></ul>\n<p>The game features:\r\n  </p>\n<ul><li>Modern design and realistic elements.\r\n  </li><li>Skillful character ready to adventure the mountainous desert \r\n  </li><li>Various enemies with abilities and features\r\n  </li><li>Physics based characters\r\n  </li><li>AI controlled enemies\r\n  </li></ul>\n<p>The game will release on Windows and Android first with release on others platforms already planned. \r\n  </p>\n<p>No Estimated release date yet.\r\n  </p>\n<p><strong>Rewards </strong>\n</p>\n<p>Backers of MyCivilWar will receive special rewards. (TBA)\r\n  </p>\n<p><strong>Challenges</strong>\n</p>\n<p>MyCivilWar is the first 2D project of Watersky which is a newborn indie game development startup. The team working on the project itself has little to no experience in game development universe, yet they bring this first version of the game. The team is composed of 3 enthusiastic young developers ready to face the difficulties of game development.\r\n  </p>\n<p>The game is developed on Unity 3D: A well-known game development tool. It has a large community and a strong technical support.  \r\n  </p>\n<p>If you can’t back MyCivilWar, consider sharing this campaign wherever you feel it! It means really much for the team working on it.</p>\n<p>This is a demo version of the game that is in development!</p>\n<p>Support the movement, support WATERSKY!</p>", "metacritic": null, "released": "2020-11-03", "tba": false, "updated": "2020-11-06T04:15:31", "background_image": "https://media.rawg.io/media/screenshots/454/4543d86ca2517db5d9db74cfc5292151.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 96, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Watersky2d"], "genres": ["Action", "Shooter", "Platformer"], "publishers": [], "esrb_rating": null}