{"id": 515669, "slug": "cubiscape-2", "name": "Cubiscape 2", "name_original": "Cubiscape 2", "description": "<h3>Overview</h3>In this original turn-based puzzle game you will take on the role of a lonely ball trapped in the world of cubes! Find a way to escape out of hundreds of levels that range from very simple to brutally complex.<h3>Features</h3>Use the environment to your advantage - lure enemies into traps, push buttons to open up new paths or teleport away from danger. Avoid mines and use bombs to destroy your foes! Discover over 20 unique puzzle elements and all the crazy interactions that can happen between them!<br/><br/><ul><li> <strong>5 different</strong> types of enemies<br/></li><li> <strong>17 unique</strong> puzzle elements<br/></li><li> Campaign with <strong>over 100 levels</strong><br/></li><li> Random puzzles with cosmetic rewards<br/></li><li> Level editor</li></ul><h3>Campaign</h3>The campaign is divided into several chapters and guides you through the world of Cubiscape. Almost <strong>every chapter introduces one or two new puzzle elements</strong> and presents you with unique challenges that get harder the further into the chapter you get. Be prepared to think outside the box (literally!) and discover surprising interactions that can arise when many elements are combined together!<h3>Randomly generated puzzles</h3>If the campaign is too easy or too hard you can try our large collection of randomly generated levels. These come in four difficulties (from easy to insane!) so there is something for everyone. Earn points by completing random levels (harder levels give more points) to advance in ranks and <strong>unlock cool cosmetic rewards</strong>, such as the \"Beating Heart\" skin!<h3>Editor</h3>Finished all levels? Head to the level editor and <strong>create your own to challenge</strong> your friends or share them with the community! The editor is very easy to use and allows you to leverage all features of the game.", "metacritic": null, "released": "2020-11-02", "tba": false, "updated": "2023-11-06T10:25:44", "background_image": "https://media.rawg.io/media/screenshots/e59/e59648882456ac891f9ce2e230085a90.jpg", "website": "http://cubiscape2.p3tr.cz", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 1}, "playtime": 0, "achievements_count": 31, "ratings_count": 0, "suggestions_count": 37, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Cubiscape", "lonewolf"], "genres": ["Strategy", "Casual", "Puzzle"], "publishers": ["LoneWolf"], "esrb_rating": null}