{"id": 51568, "slug": "asura-valley", "name": "Asura Valley", "name_original": "Asura Valley", "description": "It's a game of survival and challenge.<br/><br/>In this world, you need to repair parts to survive, and repair parts can only be obtained by defeating the enemy. (no hotel can rest)<br/><br/>Challenging enemy: each enemy has their own special abilities. Especially the king of shura. Reasonable use of different equipment and skills to defeat the enemy.<br/><br/>Every time you act in the game, you will affect the next round of the game world. Such as excessive kill the goose that leads to the next round of the game does not chicken, using a weapon customs clearance be fix the queen will lead to increase in the price of this weapon,<br/><br/>and special events of every village, it is triggered by yourselves.<br/><br/>Game features: ●Skills can be learned by beating hunters.  ●Magic stones need to be purchased in stores to learn after use.  ●Different weapons can use different skills, each with different effects.  ●Cnhancement is a special ability to achieve the desired effect through different combinations. (unyielding defenders, strong fighters)  ●Creed can dramatically change the way characters fight.  ●When you go through the game, start \"new game +\" your leading character will become a new king, waiting for you to challenge again.  ●The enemy will grow stronger, but don't be afraid that your kingdom will become more prosperous and better equipped.", "metacritic": null, "released": "2018-01-22", "tba": false, "updated": "2019-08-28T22:02:57", "background_image": "https://media.rawg.io/media/screenshots/11e/11e6bb1e4b44182e2be0452ae0483a90.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 5}, "playtime": 2, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 187, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["lvkeai"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["lvkeai"], "esrb_rating": null}