{"id": 51567, "slug": "matchygotchy", "name": "MatchyGotchy", "name_original": "MatchyGotchy", "description": "MatchyGotchy is a fun experience from the Matchy Star world. Stars need your love so they can become the rocket surgeon they always wanted to be. Look after their food, health, household lab chores, games, and important selfie every other day.<br/><br/>Stars have four different life stages: smol egg, tiny baby, awkward teen, rocket surgeon adult. Your level of care will determine how quick or slow they get to grow up. They need your guidance to grow and become productive so they can build ships and explore the galaxy. It's a digital tamagotchi like experience!<br/><br/>MatchyGotchy Parenting<br/>All stars get two important meters: Happy and Hungry. These meters deplete over time, meaning you have to look after them. If you do not replenish these, then your Star will become neglected affecting its health and productivity. <br/><br/>You could be the proud parent of an All-Dimensional Master Shipwright, Dauntless Elegant Diplomat, Interstellar Shipment Manager, Space Physician MD, Mighty Booty Hunter, Picturesque Alien Botanist, or Astrological Forecast Specialist.<br/><br/>Just like any Tamagotchi, there are important actions to take towards your parenthood skills. Soon you will be able to download more instructions so you can become the best rocket surgeon parent you can be. <br/><br/>Let's get ready for Xanadu ~☆<br/>The more stars you get, the better your chances to explore the galaxy. Collect them all, build your space fleet, and get yourself that fancy intergalactic Xanadu pool party you always wanted! <br/><br/>MatchyGotchy is a Matchy Star inspired game experience. <strong>Matchy Star is coming 2018.</strong><br/><br/>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:02:57", "background_image": "https://media.rawg.io/media/screenshots/937/9373ec4dd209ad8eaee22461ced3e0ee.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 136, "dropped": 2}, "playtime": 1, "achievements_count": 20, "ratings_count": 1, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Silverware Games"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["Silverware Games"], "esrb_rating": null}