{"id": 515750, "slug": "dont-miss", "name": "Don't Miss", "name_original": "Don't Miss", "description": "Are you ready to catch gemstones? Don't you wanna miss them?\r\n\n<p><strong>Don't miss</strong> is a simple gemstone catch game where your goal is  to catch the most valuable gemstones in the game and avoid falling stalactites from the above. This game enhances of your alertness, instincts of earning the most valuable to you the most.</p>\r\nHOW TO PLAY?\r\n<p>In this game, you need to catch many gemstones as you can. once you miss one gemstone, it will reduce your health bar as a gemstone catcher, so don't miss.</p>\r\nKINDS OF GEMSTONES\r\n<p>There are few types of gemstones in the game such as Emerald, Ruby, Blue Sapphire, Yellow Sapphire, and Tanzanite. They have the same value as a gemstone but still don't miss when your going to catch it.</p>\n<p>There are falling Stalactites while catching gemstones and make sure you avoid them at all cost, because once you catch up with falling stalactites, it will damage your cart.</p>\n<p>There are also Heart Gemstone which can heal you up once you catch it, it falls faster but it doesn't affect your health if you didn't catch it. Catching Heart Gemstones don't affect your score so make sure you still catch other kinds of gems. </p>\r\nCONTROLS\r\n<p>Use left and right arrow keys or a and d to move horizontally </p>\n<p>in order to pause the game, press the esc button.</p>\n\r\nA game and featuring  design, art, and code by Jerico, also known as OwllCraft\r\n\r\nSound effects are from<br/>https://www.zapsplat.com\r\n\r\nContributors\r\n<p>Thanks to Anant Ray, Mad Eriksen, also known as Darth Glonk, and A5^CERVO for testing the game.</p>\r\nSocial Medias\r\n<p><strong>Twitter:  </strong>https://twitter.com/OwllCraft</p>\r\nAny Feedback Is Appreciated, thank you! :)", "metacritic": null, "released": "2020-11-02", "tba": false, "updated": "2020-11-06T04:53:48", "background_image": "https://media.rawg.io/media/screenshots/e8e/e8e47c886872273a3884dc69d3e69ce5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 219, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["OwllCraft"], "genres": [], "publishers": [], "esrb_rating": null}