{"id": 515826, "slug": "rapid-reupholstering", "name": "Rapid Reupholstering", "name_original": "Rapid Reupholstering", "description": "<p>For over three years Ronny's Rapid Reupholstering LLC stands for fast service at an affordable fee. Happy or money back guarantee*. Come to one of our stores for a consultation and see our unbeatable prices yourself!<br/></p>\n<p>Reupholster the couch as fast as you can! Don't forget to meet the company's quality standard, otherwise Ronny will be majorly displeased and give you a pink slip! </p>\n<p>Do not worry! Reupholstering is easy, just read our employee training material.  There are 6 mini-games to complete the process.</p>\n<ol><li><strong>Take Photos!</strong> <br/>Not sure why, but it is an integral step in reupholstering that cannot be skipped (OK it can there is a button to skip any mini game). When the lights flash up press ether Space, Enter or the left Mouse button. You get a higher score for having more light in the picture.</li><li><strong>Rip and Tear!</strong> <br/>Unleash your inner demon hunter and smash the displayed buttons as fast (and hard) as you can. Don't worry about the old holster, we won't be needing it again.</li><li><strong>Filling material!</strong> <br/>Blow those suckers up like balloons... No wait! Don't do that! Filling material is expensive and Ronny will take the excess out of your paycheck!</li><li><strong>Measuring!</strong> <br/>Screw this step! Measuring is for girls, real men use their experience and estimate everything (also I don't have a mini game for this)</li><li><strong>Sewing!</strong> <br/>You can take your time with this one. Just make sure you get the seams straight, otherwise nothing will fit!</li><li><strong>Staple!</strong> <br/>OK enough time wasted! Time to quickly staple  the fabric to the couch. Don't miss the spots, we're running out of staples and band aids!</li><li><strong>Rebuild!</strong> <br/>It's just like step 2, only backwards! And before you ask, no it's not because I am running out of time and have to reuse a mini game, that'd be unprofessional and I am known for my professionalism!</li><li><strong>Ronny's Quality Assurance!</strong> <br/>Now that you're done, it's time for Ronny to asses your work! Have you met company standards? Have you wasted company funds? Ronny will tell you! Or fire you, one or the other really. Don't get yourself fired on the first day, that would be pathetic!</li></ol>\n\n<p>*refunds payed out in store credit, damage after leaving the store is not covered, odors of gasoline, chlorine, ammonia, sulphur and dog vomit are not covered, fabric chosen at consultation is final, in case of a canvas shortage we reserve the right to exchange the fabric to an equivalent nylon material without prior notification<br/></p>\n<p>Made for the Random WikiHow Jam #3 in 72 hours.<br/></p>\n<p>I got the theme How to Reupholster a Couch if you couldn't tell. Not an exact step by step, but the guys at WikiHow can't get it straight themselves. Lots of useless (not really step) steps and the order gets a little wacky in the end.<br/></p>\n<p>List of textures from Poliigon:</p>\n<ul><li>https://www.poliigon.com/texture/fabric-upholstery-mid-century-pebbles-001</li><li>https://www.poliigon.com/texture/fabric-upholstery-bright-angle-pattern-001</li><li>https://www.poliigon.com/texture/wood-quartered-chiffon-001</li><li>https://www.poliigon.com/texture/fabric-fleece-001<br/></li><li>https://www.poliigon.com/texture/tiles-05</li><li>https://www.poliigon.com/texture/bricks-01</li></ul>\n<p>Tools used<br/></p>\n<ul><li>Unity</li><li>GIMP</li><li>Audacity</li><li>FL Studio</li><li>MakeHuman</li><li>Blender</li></ul>\n<p>Wow, you read all the way to the bottom! <br/>You know this means only one thing (3B88)! <br/></p>", "metacritic": null, "released": "2020-11-02", "tba": false, "updated": "2020-11-06T05:09:53", "background_image": "https://media.rawg.io/media/screenshots/e03/e03540cf27ac956f6e28efa9305fce9d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 132, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["Voidsay"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}