{"id": 5158, "slug": "legacy-of-kain-soul-reaver", "name": "Legacy of Kain: Soul Reaver", "name_original": "Legacy of Kain: Soul Reaver", "description": "<p>Legacy of Kain: Soul Reaver is a third-person action-adventure title developed by Crystal Dynamics. It is the direct continuation of Blood Omen: Legacy of Kain and is the second title in the series.</p>\n<h3>Plot</h3>\n<p>The game takes place 1500 years after the events of Blood Omen. It tells the story of Raziel, a lieutenant vampire in the Kain&#39;s army. Kain almost kills Raziel and throws him down the Lake of the Dead. However, an elder god saves Raziel from death and turns him into a Soul Stealer to help him take revenge on Kain. </p>\n<h3>Gameplay</h3>\n<p>The game is completely different from its predecessor. The game is played from the third person with the player being able to move it by themselves.</p>\n<p>The gameplay is based on the ability to travel between the material and spirit worlds. This allows the player to continue on the game&#39;s plot. The item interaction in the spirit world is limited, yet it also benefits Raziel as he can pass the gates that he is unable to go through in the material world. Many of the game&#39;s puzzles are based on the differences between these two worlds. The puzzle environment of the material world can be completely different in the spirit one.</p>\n<p>The game&#39;s combat system is based on the hack and slash principle and consists out of multiple attacks and finishing moves. The enemies of Raziel are divided into three groups: humans, spirit beings, and vampires. The main feature of the combat system is the usage of the in-world items as your own weapons.</p>", "metacritic": 91, "released": "1999-08-16", "tba": false, "updated": "2024-03-05T02:04:14", "background_image": "https://media.rawg.io/media/games/84d/84da5a0c948592becea7a022e151a8b0.jpg", "website": "", "rating": 4.1, "rating_top": 4, "added_by_status": {"yet": 169, "owned": 1659, "beaten": 169, "toplay": 71, "dropped": 102, "playing": 5}, "playtime": 1, "achievements_count": 0, "ratings_count": 228, "suggestions_count": 519, "game_series_count": 5, "reviews_count": 229, "platforms": ["Dreamcast", "PlayStation", "PC"], "developers": ["Sony Interactive Entertainment", "Crystal Dynamics", "Nixxes software"], "genres": ["Action", "Adventure", "Platformer"], "publishers": ["Square Enix", "Eidos Interactive"], "esrb_rating": "Mature"}