{"id": 516, "slug": "man-at-arms-td-pocket-edition", "name": "Man at Arms TD: Pocket Edition", "name_original": "Man at Arms TD: Pocket Edition", "description": "(Have an iPad, but also like to play on your phone? If you buy the iPad version, we&amp;#39;ll gift you the phone version for free. E-mail tricket@gmail.com for info!)<br/><br/>The hit iPad strategy game Man at Arms is now available for your phone! Play fast-paced action gaming with hundreds of units, then collect unique cards to increase the strength of your army!<br/><br/>Features include:<br/><br/>* Dozens of levels across multiple game chapters. Sweat in the dusty canyons, trek through dense forest, or trudge through the swamps.<br/><br/>* Face off against all manner of twisted foes, and battle them back with soldiers, healers, knights, magical elemental creatures, and more. Watch dozens of cartoon characters battle with fist and magic!<br/><br/>* Build a deck out of cards that are as deadly as they are beautiful. Use them to curse your enemies, add extra power to your attacks, or hurl lightning down upon your foe.<br/><br/>* Online Competition: Send your levels to your friends to play. Defend your levels against hordes sent by your Game Center friends, then build your own rampaging army and attack them back!<br/><br/>* Dozens of towers and magical powers to construct and upgrade. Hundred of card combinations enhance the towers, defenders, monsters, and abilities.<br/><br/>* Choose your challenge: play through on an easier mode at first, or earn the highest honors by playing in Master mode!<br/><br/>* Complete a variety of achievements for fame and fortune.<br/><br/>* Everything is fully HD artwork for your Retina display!", "metacritic": null, "released": "2014-01-23", "tba": false, "updated": "2019-10-22T14:27:30", "background_image": "https://media.rawg.io/media/screenshots/d18/d18e7607db5446567f8a6ed7df4c31dc.jpeg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 165, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Inert Soap"], "genres": ["Strategy", "Arcade"], "publishers": ["Inert Soap"], "esrb_rating": "Everyone 10+"}