{"id": 51605, "slug": "overdrive-ninja-shadow", "name": "Overdrive Ninja Shadow", "name_original": "Overdrive Ninja Shadow", "description": "In the future, a strong, outstanding species is created from the combination of humans, technology and black metal.<br/>The government names them “shadow cyborg”, and allows every sector to have their own shadow security force (S.E.F), but all of theme have to be controlled by the Headquarter placed in Century city.<br/>Everything seems so perfect, til the day Headquarter is under attacked by a Dark Clan.<br/>CORE, a senior cyborg soldier discovers the plot too late.<br/>The Lord Commander of S.E.F is hacked, he slays his soldier and replace them by new shadow cyborg generation to take over the government.<br/>After the attack, CORE joins the rebel and heads to the city seeking revenge for his comrades and destroying the Dark Clan. <br/>Overdrive is a combination hack n slash and action platformer with many weapons available: sword, buster sword, spear, twin dagger...with unique built-in combos.<br/>Starting from the Dark Forest, you will face dangerous enemies and traps. In the fight, use your skill to avoid attack and make extraordinary combos.<br/><br/>FEATURES of Overdrive - Ninja Shadow Revenge game:<br/>- Tutorial for newbie makes sure every player can know how to play <br/>- Playable OFFLINE<br/>- Smooth game control experience<br/>- Discover poweful combos in each weapon, make game full of fun and suprising.<br/>- Upgrade, customize &amp; equip your hero with epic weapons &amp; armor suits and more!<br/>- Ultra-stunning scifi graphic &amp; effect <br/>- Giant boss with unique attack.<br/><br/>FIGHTING of Overdrive game:<br/>- The screen’ll locked when enemies appear in the screen &amp; you need to destroy numerous waves of enemies to continue going ahead.<br/>- Using avoiding skills to survive? Killing enemies madly?<br/>- Exploting traps &amp; platforms to kill them?<br/>- There are many strategies to handle them.<br/><br/>ADVENTURE &amp; STORY:<br/>- Not only combat but also challenge your self to complete each level with many dangerous platforms. <br/><br/>VARIOUS WEAPONS:<br/>- Using different weapons ( Sword, Buster Sword, Spear,...) with their perfect combos bring unforgetable hack and slash game experience.<br/>- Players can pick their best weapons and also upgrade weapons to unlock new stronger combos. <br/><br/>GRAPHIC &amp; SOUND:<br/>- Amazing scifi high quality graphic makes sure you will be suprised.<br/>- It’s 2 available modes to set suitable graphic for your phone.<br/><br/>SO YOU GONNA BE THE HERO WHO SAVES THE WORLD? ENJOY NOW!<br/><br/>Have any question or feedback to make the game better? Please let us know.<br/>Contact us via: <br/>Email: gms.mobilegame@gmail.com<br/>Facebook: https://www.facebook.com/Mobile-Adventure-Game-461699647363707/", "metacritic": null, "released": "2017-12-14", "tba": false, "updated": "2019-06-24T01:42:58", "background_image": "https://media.rawg.io/media/screenshots/c4e/c4e9bb5b013d63b8475abe2221c71e9a.jpg", "website": "http://gemmob.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 291, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["GEM MOBILE SOFTWARE COMPANY"], "genres": ["Action", "Strategy"], "publishers": ["GEM MOBILE SOFTWARE COMPANY"], "esrb_rating": null}