{"id": 516125, "slug": "superliminal-game-soundtrack-bundle", "name": "Superliminal Game + Soundtrack Bundle", "name_original": "Superliminal Game + Soundtrack Bundle", "description": "\nSuperliminal is a first-person puzzle game based on forced perspective and optical illusions. Puzzles in this game give you a sense of the unexpected. Players need to change their perspective and think outside the box to wake up from the dream.\n<br/>\n<br/>\n\n\n\nWAKE UPAs you fall asleep with the TV on at 3AM, you remember catching a glimpse of the commercial for Dr. Pierce’s Somnasculpt dream therapy program. By the time you open your eyes, you’re already dreaming - beginning the first stages of this experimental program.\n<br/>\n<br/>\n<br/>\n\n\nPERCEPTION IS REALITYExplore a dream world where everything is exactly as it seems. Tread carefully as the world slowly unravels around you and subverts your expectations. What you see isn’t always precisely what you get.MAN VS MACHINEIn this fully-voiced adventure, Dr Glenn Pierce is doing his questionable best to guide you home and out of the dreamscape. His artificial intelligence assistant, however, is having trouble understanding exactly how you’re here at all, and has other plans for you.\n<br/>\n<br/>\n<br/>\nDEVELOPER COMMENTARYWe’ve added an extensive developer commentary throughout the game, so you can learn the secrets and history behind the game’s development.\n<br/>\n<br/>\n<br/>\nCHALLENGE MODEThe overwhelming response from the speedrunning community to Superliminal inspired us to add a new Challenge Mode, which will score you per-level on metrics such as time to finish, grabs, and jumps.\n<br/><br/>\nBundle includes double-album soundtrack for Superliminal, composed by Matt Christensen and with remixes by 2 Mello.<br/>\n<br/> The first album is the in-game soundtrack, and covers the full spectrum of the Superliminal experience, from cool jazz piano to dark threatening electronica.<br/>\n<br/> The second album is comprised of the remixes by 2 Mello, who created a timeless lo-fi hip-hop sound in his inimitable style.<br/>", "metacritic": null, "released": "2020-11-04", "tba": false, "updated": "2020-11-09T01:51:00", "background_image": "https://media.rawg.io/media/screenshots/d08/d08535541cc3b25eae872a43242a217f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 196, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Pillow Castle"], "genres": [], "publishers": ["Pillow Castle"], "esrb_rating": null}