{"id": 516129, "slug": "worms-rumble-beta", "name": "Worms Rumble Beta", "name_original": "Worms Rumble Beta", "description": "To play this game on PS5, your system may need to be updated to the latest system software. Although this game is playable on PS5, some features available on PS4 may be absent. See PlayStation.com/bc for more details.<br/>PlayStation®Plus members can join our Worms Rumble open beta for THIS WEEKEND ONLY!<br/><br/>Enjoy 32 player cross-play action from 6th November 8am UTC to 9th November 8am UTC. See you there!<br/><br/>Worms Rumble is Worms like you’ve never played it before, with intense, real-time, arena-based 32 player cross-platform combat. Get ready for frantic Deathmatches and intense Last Worm Standing!<br/><br/>Use a variety of fan-favourite weapons like the Bazooka, Shotgun and Sheep Launcher plus all-new additions to the armoury to bring the pain to your invertebrate opponents as you climb the ranks. Customise your worm, take part in challenges and seasonal events and experiment with new ways to play in The Lab. This is Worms, reinvented.  <br/><br/>The First Real Time Worms! <br/><br/>You won’t find any turn-based combat in Worms Rumble. Every round is in REAL TIME! If your enemy is raining fire upon you, give them heck right back! <br/><br/>32 Player Cross Platform Multiplayer <br/><br/>Play with friends online across console and PC. With Deathmatch and Last Worm Standing solo and squad battle royale modes available at launch! <br/><br/>Classic Weapons with New Ways to Play <br/><br/>Arm yourself with new and returning fan-favourite weapons! With classics like the Bazooka, Holy Hand-grenade and Sheep launcher and the all-new Hammerhead, Plasma Blaster and Rocket shield. <br/><br/>Events, Challenges and ‘The Lab’ <br/><br/>Take part in seasonal and community events, and daily challenges for additional XP and in-game rewards. And experiment with new gameplay mechanics and weapons in The Lab. Each week brings new experimental game modes with new fun ways to play! <br/><br/>Player Customisations <br/><br/>Earn XP and in-game currency to unlock and purchase weapon skins, outfits, accessories and emotes! Mix and match to create your own personal style on the battlefield.<br/><br/><br/>Online multiplayer (2-32 players). A paid-for PlayStation Plus membership is required. Online features require an account and are subject to our terms of service (playstationnetwork.com/terms-of-service), our privacy policy (playstationnetwork.com/privacy-policy), and the game publisher’s privacy policy.<br/>Uses DUALSHOCK 4 vibration function<br/>PS4 game can be controlled via PS Vita<br/>Enhanced game play on PS4 Pro console<br/>Online play required<br/><br/><br/>Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy). <br/><br/>Software subject to license (us.playstation.com/softwarelicense). <br/><br/>One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.<br/>", "metacritic": null, "released": "2020-11-06", "tba": false, "updated": "2020-11-09T01:54:20", "background_image": "https://media.rawg.io/media/screenshots/e2f/e2f23c3d556645516543e4e8e9b636e8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 268, "game_series_count": 0, "reviews_count": 1, "platforms": ["PlayStation 4"], "developers": [], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}