{"id": 516137, "slug": "mana-monsters", "name": "Mana Monsters", "name_original": "Mana Monsters", "description": "Mana Monsters is a completely new take on match 3 puzzle games! Combining RPG elements, immersive story, world exploration, and monster collection - topped with epic PvP battles. <br/><br/>Start your fantasy adventure today! <br/><br/>◆ MATCH 3 BATTLES <br/>Lead your monsters to the victory by matching colorful gems and creating epic combos! <br/><br/>◆ AMAZING GRAPHICS <br/>Experience detailed monsters, unique special skills, epic loot, powerful combos, and visual effects in a majestic fantasy world! <br/><br/>◆ BASE-BUILDING <br/>Build your Camp, where you can Hatch, Craft, Join Factions or Engage in Drafts! <br/><br/>◆ MONSTER TOKEN COLLECTION <br/>Summon tons of mighty legendary monsters! <br/><br/>◆ LEVEL UP AND UPGRADE <br/>Build the perfect monster team and discover their special powers! <br/><br/>◆ MULTIPLAYER <br/>Clash in intense match-3 RPG battles in Epic PVP and Boss Fights! <br/><br/>◆ GREAT LOOT <br/>Unlock powerful skills, runes, and boosters to blast your way to the top! <br/><br/>◆ CRAFTING <br/>Craft legendary runes to help your monsters in battle! <br/><br/>◆ IMMERSIVE STORY <br/>Engaging story full of mystery and intrigue. Collect stars and unlock secret levels! <br/><br/>Be the HERO of the story in this QUEST to COLLECT all the LEGENDARY Mana Monsters! Join players from around the WORLD in this epic puzzle RPG adventure! Master colorful match-3 battles. <br/><br/>Do you have what it takes to hatch tons of cute monsters and beat the bad guys as you uncover the hidden secrets of the mysterious Underland? <br/><br/>Download today and start your adventure! <br/><br/> <br/>Mana Monsters is completely free to download and play, some game items may be purchased for real money. To disable this, turn off the in-app purchases in your device settings. <br/><br/>Help &amp; Support Email: mm-support@outerdawn.com <br/>Terms and Conditions: https://www.outerdawn.com/termsconditions/en <br/>Privacy Policy: https://www.outerdawn.com/privacypolicy/en <br/>Facebook: facebook.com/ManaMonstersGame <br/>Twitter: Mana_Monsters <br/>Instagram: ManaMonstersGame", "metacritic": null, "released": "2020-08-25", "tba": false, "updated": "2020-11-09T01:58:21", "background_image": "https://media.rawg.io/media/screenshots/285/285e0ab066dba854b028aedd8a78620d_3FB6kIG.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 186, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Outerdawn"], "genres": ["RPG", "Puzzle"], "publishers": ["Outerdawn"], "esrb_rating": "Everyone 10+"}