{"id": 516133, "slug": "trench-warfare-1917-ww1-game", "name": "Trench Warfare 1917: WW1 Game", "name_original": "Trench Warfare 1917: WW1 Game", "description": "Trench Warfare 1917: WW1 is an intense War strategy game. Build the best Army, fight in epic tank battles, and play with your own custom war strategy. You shall never fear the enemy and must fight as hard as you can with a superb winning strategy. It’s a front-line army battle game between doom and glory. Combine war heroes with outrageous and incredible power and build your ultimate battle team. Embark on a journey to discover new characters and confront mighty opponents along the way. It is the best game to enjoy tanks battle against any of your choice army <br/><br/>Armies: <br/>You can select and command the British German , French or Russian Tsar Army and be the hero of it, then choose an enemy country for the ultimate Trench Warfare experience. Play with riflemen, assault grenade troops, snipers, tanks. Every nation has unique special troops and special attacks that will help you defeat the enemy troops. <br/><br/>Custom Difficulty <br/>Trench Warfare 1917 has a creative game mode with custom difficulty, where you can select easy, medium and hard difficulty according to your war and strategy gameplay level. <br/><br/>Build your own battleground<br/>Build your battleground according to your own strategy. Place army, buildings and tanks to have an epic and super intense fight with the enemy army.   <br/><br/>Shoot before they do: <br/>Be the pro of battlefield games - shoot all the enemy soldiers on the chosen ww1 army. Say yes to the call of war and enjoy the wonderful armor game <br/><br/>Build an Army: <br/>Be a hero and build a brave and pro army to fight besides you. Practice your war and strategy skills by collecting teammates from the soldiers, tanks and others provided to counter the enemy strategy and formation and win WW1 for your country. <br/><br/>Features of Trench Warfare 1917 Armor Game:<br/>-\tLatest strategy game<br/>-\tPixel graphics <br/>-\tEasy to play <br/>-\tPlace buildings and train armies <br/>-\tChoose your favorite army <br/>-\tFight against country of your choice <br/>-\tCustom war strategy game<br/>-\tShow best combat skills <br/>-\tAddictive gameplay <br/>-\tOver 4 epic campaigns: England, Germany, France, and Russia <br/>More to be announced: Ottoman Empire, Austria-Hungary, Italy, USA, Japan<br/>-\tOver 100 missions and more coming <br/><br/>Trench War: <br/>Fight against the enemy army with strategy and courage. Never let them come too close. Show the enemy army strong resistance in the trench fight. Never lose hope, and fight until the end to win a glorious victory for your army and country. <br/><br/>Final words <br/>Trench Warfare is the first game of our studio and we; Mads, Oliver and Bertin, deeply hope you will give it a try. Sharing our game with your friends and family would mean so much to us and help us come closer in becoming full time game developers. <br/>If you have any feedback, let us know! You can reach out to us on contactsimplebit@gmail.com , in the review section and on our Discord server linked in the game, or on our website simplebitstudios.com . We are always keen to improve this game as good as possible.<br/><br/>As we are still in college and this is our first game, please note that we will not be able to add all your requests. But we are doing our best and will continue with becoming the greatest and most wholesome game studio there is", "metacritic": null, "released": "2020-10-23", "tba": false, "updated": "2020-11-09T01:56:41", "background_image": "https://media.rawg.io/media/screenshots/552/55243d7efcedd9b57b822861c019b24c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 229, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["SimpleBit Studios ApS"], "genres": ["Action", "Strategy"], "publishers": ["SimpleBit Studios ApS"], "esrb_rating": "Teen"}