{"id": 516234, "slug": "our-hero-first", "name": "Our Hero! First", "name_original": "Our Hero! First", "description": "<p>Enter Our Hero! First, a nice action-adventure game with RPG mechanics starred by cute and colorful characters. The game involves seamlessly alternating Hack'n'Slash and platforming sections, free-to-explore environments dotted with secrets to collect and enemies to fight in frantic real-time battles, each guarded by armored and evasive boss which require timing and tactics to hit in an opening.</p>\n<p><strong>Features</strong></p>\n<ul><li>Explore a sprawling open world divided into zones: discover the Foxes Desert, the Eternal Glaciers, the Water City and other enchanted places.</li><li>A lot of action: run, jump, fight and take control of enemies!</li><li>Immersive Story starred by nice NPCs and rascally enemies.</li><li>Real-time Battle System.</li><li>More than 20 unique swords to discover and collect!</li><li>Many different zones to explore and overcome: solve puzzles, discover secret places and fight epic boss battles!</li><li>Side quests to play during your adventure.</li><li>Trophies and characters to unlock in the Trophies Hall and the Characters Gallery.</li><li>Take part in the Final Battle and save the world.</li></ul>\n<p><strong>Story</strong></p>\n<p>Are you itching to cut down a swathe of baddies, with your back stretched and a giant sword in your hands? The King is in need of help, and you've been trusted with the task of making a stand for the entire world. </p>\n<p>Step in the shoes of Ourhero, arm yourself with your trusty swords, and set off on a quest to retrieve the Teorhemas Crystal!\r\nThe devious Finalboss is racing against you to nab the Teorhemas Crystal for himself, giving himself the ultimate magical power to sink the world into despair and suffering. </p>\n<p>What's the real power of the Crystal? Do not let Finalboss to find it out.\r\nJourneying through forests and fortresses, seas and skies, vast stretches of land and tight dungeons, carving your way through Finalboss and his cronies with the help of other mighty warriors and a cast of colorful NPCs assisting you in uncovering the land's treasures and secrets, and wielding an array of mighty weapons to collect and upgrade. </p>\n<p> Are you ready?</p>\n<p> The world of heroes awaits you!</p>", "metacritic": null, "released": "2020-11-08", "tba": false, "updated": "2020-11-09T02:20:03", "background_image": "https://media.rawg.io/media/screenshots/778/77816a1f52271b4c584f06bc51dc34d3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 195, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ste's Project"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}