{"id": 51627, "slug": "all-stars-racing-cup", "name": "All Stars Racing Cup", "name_original": "All Stars Racing Cup", "description": "<strong>All Stars Racing Cup is the ultimate top-down racing experience!</strong><br/>Push your driving skills to the limit in this vibrant, fun, arcade-style racing game against AI or with up to three other players either locally or via online multiplayer. <br/>Master the art of drifting to go head-to-head with your opponents in a choice of challenging tracks and race to beat them to the finish.<br/>With a wide range of vehicles and a number of circuits to choose from, can you master them all to become the next All Star? <br/><br/><strong>As with our main company we plan to donate 5% of all sales to different charities and causes each month</strong><br/><br/><strong>Features</strong><br/><ul><li>Competitive arcade racing - battle to push your competition off the track or compete for the best racing line to gain first place in fun and challenging four-player races.<br/></li><li>Flexible multiplayer gameplay: Take on friends locally or online players for the ultimate gaming experience your way. <br/></li><li>Suitable for players of all ages - simple controls, fun, clean graphics and intuitive gameplay make this game a must for all ages!</li></ul><br/><strong>Development plan</strong><br/>You can view a full list of our future development plans and bug fixes on our Trello page.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:02:55", "background_image": "https://media.rawg.io/media/screenshots/aff/aff60e849a314ea6ca354dc65279ad70.jpg", "website": "http://www.inksyntax.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 5}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 112, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Ink Syntax"], "genres": ["Racing", "Casual"], "publishers": ["Ink Syntax"], "esrb_rating": null}