{"id": 51629, "slug": "hiros-forest-rumble", "name": "Hiro's Forest Rumble", "name_original": "Hiro's Forest Rumble", "description": "The Hiro's are back. Now the forest is awake and all the species are at war.<br/>\n<br/>\r\nUpgrade all characters, use invincibility and head start perks, and run as fast and as far away as you can, beyond their garden and even their known forest. Travel to the swamp, cave, mountains, and snowy plains, gather lost friends and fight as a team against foxes, wolves, and bears. Watch out for the poisonous spiders and sharp needles of the hedgehogs.<br/>\n<br/>\r\nUse Benny to throw carrots, Lola to speed up with her magic hat, and the elder that taught them the ancient way of Martial Arts. Collect cabbages to unlock Hiro's mighty blast of stinky cabbage and put on the run all of the nearby enemies.<br/>\n<br/>\r\nYou can also play instead as the foxes, wolves or bears, using their amazing abilities - a pack of fox cubs that steal gold coins from the enemies, hungry wolves that trample over everything or the tremendous roar of the angry, voracious bear.<br/>\n<br/>\r\nFeatures:<br/>\r\n- 4 playable factions, each with 3 different characters<br/>\r\n- Ramping difficulty: the run gets harder the further you get; how long can you survive?<br/>\r\n- 6 different areas: escape the spider-infested swamp and then freeze in fear of the mighty polar bear<br/>\r\n- Epic and unique boss encounters: survive the fight for a set interval of time to advance, or win the fight and also get rewarded with huge amounts of gold!<br/>\r\n- Personal upgrade lines for each faction; the bears might be slower, but their resistance is superior<br/>\r\n- Daily missions to complete and 50+ challenging achievements<br/>\n<br/>\r\nHours of fun!", "metacritic": null, "released": "2018-01-23", "tba": false, "updated": "2019-08-28T22:02:55", "background_image": "https://media.rawg.io/media/screenshots/28a/28ab18821da14bacf5923da24c9be3ef.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 285, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mad Mag Store"], "genres": ["Casual", "Indie"], "publishers": ["Mad Mag Store"], "esrb_rating": null}