{"id": 51625, "slug": "contagion-vr-outbreak", "name": "Contagion VR: Outbreak", "name_original": "Contagion VR: Outbreak", "description": "Contagion VR: Outbreak is a first-person shooter built from the ground up exclusively for VR.  Fully immerse yourself in a world initially familiar to you, and witness it's transformation into something much darker as it rapidly changes right before your eyes.<br/><br/>Assume the role of one of our many characters and experience their stories first hand that would shape them in the mold of who they would eventually become.  The end of the world as we know it is filled with horrors the likes of which were never fathomed, but in all the darkness lies a beacon of light, tales of heroism and sacrifices made so others could carry on.  Explore highly detailed environments, search for scarce resources and see if you've got what it takes to survive a zombie apocalypse!<br/><br/>We've painstakingly developed every element from the ground up for HTC Vive and Oculus, Contagion VR: Outbreak drops you in the middle of the zombie apocalypse.  Fight alone in our single player story driven mode and experience each characters past, or team up and fight alongside your friends in one of our co-op based modes!  Have a competitive drive?  Do battle against other players in one of our PVP modes and see if you've got what it takes to be crowned king of the VR wasteland!<br/><br/><ul><li>VR driven game-play mechanics: Perform physical actions true to life that immerse players deep inside the world of Contagion.<br/></li><li>Full single player campaign: Each character has their own history, learn the events each experienced that shaped their personalities and defines who they are today.<br/></li><li>A massive arsenal of weapons: Firearms, melee weapons, explosives, and much much more!<br/></li><li>Multiple co-op modes: Fight alongside your friends in one of our multi-player focused modes, or climb the leader-boards in any of our shooting range challenges! <br/></li><li>Challenge other survivors: Have a competitive itch? Hop into one of our PVP multi-player modes and see if you're good enough to be king of the VR wasteland!<br/></li><li>Customize your personal space: Play the game to unlock loot drops and customize your home base to your liking before heading out to battle the infected.</li></ul>For now, hit that <strong>DOWNLOAD DEMO</strong> button on the right and let us know what you think so far!", "metacritic": null, "released": "2019-11-12", "tba": false, "updated": "2024-01-29T21:31:32", "background_image": "https://media.rawg.io/media/screenshots/071/071333dfdb6632f62330a675187dbfb9.jpg", "website": "http://www.contagion-game.com/contagionvr/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 18, "beaten": 1, "toplay": 1}, "playtime": 4, "achievements_count": 61, "ratings_count": 1, "suggestions_count": 281, "game_series_count": 0, "reviews_count": 1, "platforms": ["PlayStation 4", "PC"], "developers": ["Monochrome"], "genres": ["Action", "Shooter", "Adventure", "Simulation", "Indie"], "publishers": ["Monochrome"], "esrb_rating": null}