{"id": 51630, "slug": "freeman-guerrilla-warfare", "name": "Freeman: Guerrilla Warfare", "name_original": "Freeman: Guerrilla Warfare", "description": "<strong>Freeman: Guerrilla Warfare</strong> is a unique combination of tactical first-person shooter and strategy game, where the player assumes the role of a commander and raise money, build an army, engage the enemies in field combat, attack hostile territories and defend currently held ones and eventually dominate the world.<br/><br/>The gameplay operates on two levels: the overworld map and the first-person shooter portion. In the overworld, the player can visit locations, trade, upgrade equipment, attack enemy armies, lay siege to towns, accept missions, and more. In the FPS portion, the player enters the battlefield in the first-person view, fight as a foot soldier and issue orders to the army.<br/><br/><strong>Features:</strong><br/><br/><ul><li>FPS meets Strategy Game</li></ul>Start your career with one pistol and 5 soldiers, how would you become the most powerful army in the world? The game is not only about shooting, but also about your career as an army commander.<br/><ul><li>Free-Form Sandbox Game Experience</li></ul>Trade with the locals, recruit soldiers, loot villages, fight bandits, attack territories and conquer the world. You are in charge of your own destiny!<br/><ul><li>Epic Large Scale Combat</li></ul>Immerse you in really epic battlegrounds of hundreds of combatants. Watch your men charge into enemy lines and spill blood for victory.<br/><ul><li>Commanding an army</li></ul>You are not fighting alone. Issue direct orders to your squads during a firefight, taking advantage of the terrain, setting up flanking routes and crush the enemies with the final charge!<br/><ul><li>Realistic Combat Simulation</li></ul>Ballistic simulation, detailed environment, realistic sound effects and highly intelligent AI will give you an immersive real battlefield experience.", "metacritic": null, "released": "2018-01-25", "tba": false, "updated": "2019-09-17T13:22:00", "background_image": "https://media.rawg.io/media/screenshots/a74/a7498c5e3a4e8ba762d4304c9c7daf8a.jpg", "website": "https://www.freeman-game.com/", "rating": 3.21, "rating_top": 4, "added_by_status": {"yet": 5, "owned": 103, "beaten": 4, "toplay": 11, "dropped": 7}, "playtime": 5, "achievements_count": 38, "ratings_count": 19, "suggestions_count": 514, "game_series_count": 0, "reviews_count": 19, "platforms": ["PC"], "developers": ["KK Game Studio"], "genres": ["Action", "RPG", "Strategy", "Indie"], "publishers": ["KK Game Studio"], "esrb_rating": null}