{"id": 51637, "slug": "the-apartment", "name": "The Apartment", "name_original": "The Apartment", "description": "The Apartment - Psychological Thriller GameThe Apartment is bringing together quite unique mix of genres, combination of first person detective action-adventure game and psychological horror with some interesting puzzles, all tied together with dark and heavy story. It is not a pure horror and it's not just a story adventure either.The InvestigationAs detective James Sachs, you lead the investigation of several murders in your area. Young girls were found dead, arranged and with strange injuries that don't make any sense. It's up to you to find out who these girls were. Why were they killed. And find the murderer before he strikes again and solve the case. Case that might prove to be more difficult and challenging than you ever imagined.<br/><br/>Main gameplay of the action-adventure part focuses on detective work - exploring crime scenes, finding evidence, connecting clues, completing simple word puzzles or physics puzzles and piece together the whole story.<br/>Not all evidence on the crime scene is crucial for finding the killer. There is also a lot of wrong choices you can make, wrong questions you can ask. So you will need to pay attention and think about your actions. Before your investigation ends up in a dead end.The NightmareHorror part of The Apartment is focused more on psychological horror, rather than jumpscares or survival horror. There is no monster hunting you down, there is no threat that you can see (but don't worry, there is still lot of way you can die in this game). The main purpose is to create unsettling and eerie atmosphere and make the player as uncomfortable and creeped out as possible. Why? What is your goal? Survive? Win? Escape? No matter what is happening, you can only be certain of one thing now - nothing makes sense anymore.<br/><br/>There is no clear line between \"investigation\" and \"horror\" parts. You can never tell what is waiting around the next corner. Both worlds of reality and nightmare are slowly fusing together. But is there even such a thing as reality anymore?<br/><br/><br/>The Apartment is very diverse in its environments. Don't expect single, unchanging surroundings. This game is switching scenes and environments faster than you would imagine. Always trying to keep one step ahead of the player.<br/>Path forward is often blocked with simple, yet interesting puzzles. Word puzzles, number puzzles, simple physics stuff, but also some play with light and shadows.<br/><br/>Total gameplay time is 4,5 - 5,5 hours and the main story culminates in grand, action-packed finale.<br/><br/>NOTE: Solving puzzles is big part of the game, so be prepared for that. <br/>          Basic understanding of English might be required for some of the puzzles, so keep that in mind.", "metacritic": null, "released": "2018-01-26", "tba": false, "updated": "2019-08-28T22:02:55", "background_image": "https://media.rawg.io/media/screenshots/ac4/ac4c130d73d2a01a45b429777c85e036.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4, "beaten": 1, "toplay": 1, "dropped": 1}, "playtime": 8, "achievements_count": 8, "ratings_count": 0, "suggestions_count": 433, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Shattered Mirror"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Shattered Mirror"], "esrb_rating": null}