{"id": 51635, "slug": "seven-mysteries-the-last-page", "name": "Seven Mysteries: The Last Page", "name_original": "Seven Mysteries: The Last Page", "description": "That night, at the only school of a small town, a group of students unintentionally discovered their school had been hiding things that should have been left unknown. Every student knew about the tales of what happened there, except them. Then, unknowingly, the unacquainted students were somehow connected to uncover the hidden. Together they try to open doors, hoping they would clear away the fog. However, soon will their realization come when all the pieces of the final puzzle gather. All will fall into dead silence with the same thought... about why they crossed each other's path in the very beginning.<br/><br/><strong>GAMEPLAY</strong><br/>Seven Mysteries - The Last Page is a supernatural horror game played in a top-down view. In this game, you are acting as Nathan, a transferee at the only school of a certain town. You are knowledgeable, cunning, and able to keep your calm no matter how hectic things become. You use those qualities to discover what's haunting the school. On your way looking for tracks at the scene, you inadvertently befriend odd people. Since then, you realize that you are arriving at the end of everything, and you are also aware that... you can't turn back.<br/><br/>The game focuses on the flow of the story. There will be choices that direct the game flow to various endings throughout the game. The duration of the game is up to the player to decide.<br/><br/><strong>FEATURES</strong><br/>• 11 chapters.<br/>• 2 main endings and 4 side endings.<br/>• Choices determining the different endings of the game.<br/>• Act as different characters over several chapters.<br/>• Supported Languages: English, Vietnamese.", "metacritic": null, "released": "2017-10-08", "tba": false, "updated": "2019-08-28T22:02:55", "background_image": "https://media.rawg.io/media/screenshots/c9e/c9e0a5499aec75e5ccead2426b12f763.jpg", "website": "http://behindthedoorgames.com/sevenmysteries", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 33, "toplay": 1}, "playtime": 1, "achievements_count": 26, "ratings_count": 0, "suggestions_count": 216, "game_series_count": 1, "reviews_count": 0, "platforms": ["PC"], "developers": ["Sang Hendrix"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Behind The Door Games"], "esrb_rating": null}