{"id": 516301, "slug": "sitting-ducks-itch", "name": "Sitting Ducks (itch)", "name_original": "Sitting Ducks (itch)", "description": "<p><strong>(This game was made for the Quinnipiac Game Dev Club eJam 2020.)</strong></p>\n<p>Your goal is to guide the duck to the bread. However, the duck can only <em>move forward</em>, so it is up to you to use your tools to guide it to the bread.</p>\n<p>The tools at your disposal are:</p>\n<p>Counter-clockwise rotation tile - rotates the duck 90 degrees counter-clockwise<br/>Clockwise rotation tile - rotates the duck 90 degrees clockwise<br/>Horizontal reverse tile - if the duck is moving horizontally, rotates the duck 180 degrees<br/>Vertical reverse tile - if the duck is moving vertically, rotates the duck 180 degrees<br/>Teleporter tile - teleports the duck from one teleporter to the other of the same color while retaining the duck's orientation</p>\n<p>The duckling is a collectible that acts as an \"key\" in a level. In order to pick up the bread and finish the level, you must pick up the duckling first, leading to more complex puzzles.</p>\n<p>Click on the tools to pick them up, and then drop them where you want on the grid by clicking again. To start moving the duck, hit the space bar. </p><p>There are some quirks with the game that can cause the game to act strangely. As such, please avoid moving the tools while the duck is moving, as the game tends to not handle this well, and it's also not necessary to finish the levels! Additionally, placing tiles under the duck, duckling, and bread is not necessary as well, and may cause some unintended issues.</p>\n<p>Can you guide the duck to the bread in all five levels?</p>\n<p>(This game was made by two first-year Computer Science students, Matthew Merritt and Michael Merritt. We wanted to see what we were capable of doing with little previous experience, and this game was the result.)</p>", "metacritic": null, "released": "2020-11-08", "tba": false, "updated": "2020-11-09T02:33:53", "background_image": "https://media.rawg.io/media/screenshots/7d5/7d5b944c3fb0a8e036e089e9d198df2b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 11, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Michael Merritt", "Matthew Merritt"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}