{"id": 516465, "slug": "catch-your-truth", "name": "Catch Your Truth", "name_original": "Catch Your Truth", "description": "<p>This game was created during GDS Jam 2020 in 48 hours. <br/>Theme of the Game Jam: Disinformation and Conspiracy theory. </p>\n\n<p>The game Catch Your Truth is competitive game for two players. One player is Human who represents the Truth, the second player is Troll who represents misinformation. <br/>From the top of the screen are falling two types of words, which can represent truth or lie. If human catches word \"earth is flat\" he gets minus points, but if troll catches it, he gets plus points. If human catches word \"earth is round\" he gets plus points, but if troll catches this word, he gets minus points. <br/>Human moves using keys \"W A D\" and troll moves by \"LEFT UP RIGHT\" arrows. <br/>One player can also \"freeze\" the other using left or right \"SHIFT\" key.  The freeze lasts 5 seconds. During this period player cannot move. <br/>The game has a time limit of 2 minutes. When the time runs out, the winner is player with most points. </p>\n\n<p>This game was created by a team that consists of two people: Miriam Tancibokova and Jakub Kocourek. <br/>For Miriam this is her third game jam she participated in. She prepared graphics in Aseprite. She doesn't have any programming or professional graphical  knowledge, but she likes to participate in game jams to learn new skills and have fun with game design. :) <br/> For Jakub this is his first game jam he participated in. He had some prior knowledge of C#, but he is completely new to Unity.  <br/>Therefore we created a simple game  with simple graphics for this game jam. Hope you will have fun! </p><p>Music source: https://freesound.org/people/yummie/sounds/410574/<br/></p>", "metacritic": null, "released": "2020-11-08", "tba": false, "updated": "2020-11-09T03:09:20", "background_image": "https://media.rawg.io/media/screenshots/b0e/b0e9a8553a7c02d820a06dca56937e92.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 48, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Miriam", "kocouj1"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}