{"id": 516416, "slug": "inspector-leverman", "name": "Inspector (leverman)", "name_original": "Inspector (leverman)", "description": "<p><strong>Welcome in the world of the press, you are a redactor of it and you must decide when is disinformation or not. </strong></p>\n<ul><li>You must build your reputation, make money and take care about these special information on little papers.</li><li>Because everything you make do a substantial result on the future of the people, your family and your job.</li></ul>\n\n<p><strong>The game is a 8-bit stylized puzzle adventure, where you make a delicate decisions depending on the information you get.</strong></p>\n<ul><li>You can play it on the Windows PC with a low end  hardware, anything from a toaster to a gaming beast is capable playing our game.</li><li>Every day you get about a 4 papers of information, that you must complete...</li></ul>\n\n<p><strong>How do I play a game?</strong><br/></p>\n<ul><li>You are only using a mouse or touchpad to control objects, in your office like paper shredder, bin, notebook, mobile and newspaper.</li><li>You start with a little paper on your desk, you look at the information and then you are looking for clues on the pc, mobile and newspaper to make sure that information is good or bad.</li><li>Than you click on the the papers with a green good sticker or you throw the paper to the bin or paper shredder.</li><li>After your day played, you get a your deserved money and respect.</li><li>Enjoy your playing of the game!</li></ul>\n\n<p><strong>Thank you for your attention!</strong></p>\n<p>Šimon Ustal</p>", "metacritic": null, "released": "2020-11-08", "tba": false, "updated": "2020-11-09T02:58:37", "background_image": "https://media.rawg.io/media/screenshots/693/6936aaf6008ada50b0c2f28095ddb69a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 36, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["leverman"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}