{"id": 51640, "slug": "zanshin", "name": "Zanshin", "name_original": "Zanshin", "description": "Slice and dice! Zanshin is a sword fighting simulator, where you can test yourself in challenging sword fights. Try your agility, reaction, speed. Move, block and strike your enemies down and then slice them into thousand pieces. Fight with hundred waves of enemies and survive as long as you can. It seems dishonest but you have an ace up your sleeve - the \"Zanshin\" technique. This game is about challenging sword fights, blood, slow motion, countless waves of enemies in various beautiful worlds.Challenging physics-based sword fightsAll factors are taken into account - angle, strength, speed, every hit and every block to bring you in realistic sword fight.Advanced AI Fight with good balanced AI and test yourself in hardcore sword fights.Unique Slicing SystemBe a real warrior, strike your enemies down, choose the right moment and get yourself in Zanshin to slice them into thousand pieces.Accurate collision detectionWe made super accurate collision system for best realistic sword fights - we won't get you frustrated with wrong hit and block detection.Various of weaponsExpress yourself and choose your style of the fight with the variety of weapons.Different beautiful worldsExperience the full immersion of VR with various of different beautiful levels to fight.Safety Notice and Room-Scale Info<br/>Zanshin requires players to swing their controllers and perform wide gestures in virtual reality. Be cautious with your environment and play at your own risk. We are not responsible for any destruction of property or the injury of yourself or anyone else while playing Zanshin.<br/><br/>Play far away from any object, have plenty of space, use high quality wrist straps, remove all children or animals from the room, do not play near stairs.<br/><br/>Zanshin will play correctly with simple standing configuration as long as you can move your arms in any direction without risking to hit something. However, it is recommended for best playing experience to have 2m x 2m of playspace or more.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:02:55", "background_image": "https://media.rawg.io/media/screenshots/58f/58f2ff481e688f86bdd4eb54a6e10197.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 345, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Seven Wolves Studio"], "genres": ["Action"], "publishers": ["Seven Wolves Studio"], "esrb_rating": null}