{"id": 516481, "slug": "the-mad-wizard", "name": "The Mad Wizard", "name_original": "The Mad Wizard", "description": "<p>This is a port of The Mad Wizard, an NES game by indie game developer Rob Bryant, originally released in 2014. The original NES ROM is available free from the developer on his website https://slydogstudios.org/ under \"The Candelabra Epic.\" It is a metroidvania style adventure and if you know where everything is, has a substantial 1.5 hrs of gameplay in it. (longer if you don't know where things are!)</p>\n<p>The evil summoner Amondus from The Order of the Talon has taken over Prim, Hekl's once happy homeland. And nothing drives a wizard more crazy than having their territory trampled on! Can you help Hekl defeat the enemies that Amondus has populated throughout the landscape? To do so, you will need to master the art of levitation, find magic spells that will assist you in reaching new areas, and upgrade your weapons. All of these will be necessary in order to give Hekl the power he needs to restore peace to Prim. Do you have what it takes? If you dare, venture into this, the first installment of the Candelabra series!</p>\r\nTHE FIRST CHRONICLE\r\n<p>In the vast province of Prim lies a great forest known as The Primwoods. It is here that the powerful wizard alliance \"The Order of the Talon\" has made their expedition. Among them was Hekl, also known as \"The Mad Crow\" who was dismissed from the group due to his experiments with arcane scrolls and alchemy. It seems he has lost his mind attempting to master the art of flight and was expelled for his most ambitious nature.</p>\r\nTHE SILENT OWL INCURSION\r\n<p>However, there may be more to the reason...<br/>It seems Hekl knew something of the Order of the Talon that the archleader Amondus \"the Silent Owl\" did not approve of.<br/>Amondus swiftly invaded Hekl's homeland, constructed a great floating palace in the sky, and used his powers of summoning to control a legion of evil.</p>\r\nRETRIBUTION OF A MADMAN\r\n<p>Amondus' intentions are unclear, but he has ordered his many goblin minions to steal Hekl's precious magic items and hide them throughout the land to deter Hekl's effort.</p>\n<p>Hekl's only hope is to build up his magical powers, rid the area of all evil foes, and locate the legendary trident that is known as the TRI-CASTER to give him the means of reaching the Floating Palace to defeat Amondus and restore peace at once.</p>\r\nGET STARTED ON YOUR QUEST!\r\n<p>THE MAD WIZARD is a screen-by-screen, side-view, platform adventure game in which you guide the wizard \"Hekl\" throughout an open-ended fantasy world. The focus is on exploration, magic use, puzzle solving, and reaching areas through levitation. Along the way, Hekl will find hidden items to grant new abilities which will allow him to access more parts of the world.<br/>You will be granted infinite continues to complete your quest. The game ends when Amondus is finally defeated.</p>\r\nBASIC CONTROLS\r\n<p>Moving around and about.</p>\n<p>Left/Right: Use left/right to make Hekl walk in the desired direction.</p>\n<p>Up/Down: Use to climb or descend ladders or choose on the continue screen.</p>\r\nLEVITATION CONTROLS\r\n<p>X(X): Press to levitate. Press again or hold to go higher after upgrade.</p>\n<p>Left/Right: Use left/right to move in the direction while floating in the air.</p>\n<p>Down: Press to cancel levitate to quickly fall back to the ground.</p>\r\nMAGIC ATTACK CONTROLS\r\n<p>Hekl can attack his foes using his strong magic. The range and power of attacking is upgraded by finding the mystical hidden diamonds.</p>\n<p>O(Z): Press to fire the MAGIC MISSILE. This is the default attack.</p>\n<p>Enter: Press to bring up the in-game menu. Select \"SWITCH WEAPON\" to switch between default missile and vertical lightning attack.</p>\r\nADVANCED MAGIC CONTROLS\r\n<p>Special adventure abilities!</p>\n<p>Up + X(X): Press to place the PRISM CUBE directly in front of Hekl.</p>\n<p>Down + X(X): Press to summon the SPECTRAL BRIDGE when standing at a ledge.</p>\n<p>Up + O(Z): Press to use Hekl's TELEPORTATION ability to zoom forward.</p>\r\nABILITY ICONS DESCRIPTION\r\n<p>Identifying all icons in status bar at the bottom of the play screen.</p>\n<p> The LIFE SPHERES. Number of hits Hekl can take.</p>\n<p> Icon for the MAGIC MISSILE. Basic attack.</p>\n<p> Number of LIVES that Hekl has. Gets 2 per continue.</p>\n<p> Current level for ability. Full bar = max level.</p>\n<p> Icon for XECROM'S THUNDER. Vertical attack.</p>\n<p> Indicates having the spell of PRISM CUBE.</p>\n<p> Indicates SPECTRAL BRIDGE magical ability.</p>\n<p> Indicates TELEPORTATION warping skill.</p>\n<p> Horizontal levitation upgraded by finding X scrolls.</p>\n<p> Vertical levitation upgraded by finding Y scrolls.</p>\n<p> Levitation speed. Can be doubled by finding S potion.</p>\r\nCOLLECTIBLES AND UPGRADES\r\n<p> DIAMOND - Increases the attack power or distance of the magic missile.</p>\n<p> XECROM'S THUNDER - Hekl casts a lightning bolt down from the heavens.</p>\n<p> LIFE SPHERE - Increases the total amount of hit points permanently.</p>\n<p> SCROLL - Levitate further. X scroll for horizontal. Y scroll for vertical.</p>\n<p> S POTION - Will double Hekl's levitation speed.</p>\r\nSPECIAL MAGIC ABILITIES\r\n<p>The spells Hekl can learn! NOTE - Can only cast 1 spell at a time initially.</p>\n<p> PRISM CUBE - Create a block to use as a shield or platform to stand on.</p>\n<p> SPECTRAL BRIDGE - Casts a bridge of energy near a ledge for safe crossing. </p>\n<p> TELEPORTATION - Projects Hekl's image forward to warp across the screen.</p>\n<p> TRI-CASTER - All 3 spells can be cast at once!</p>\r\nEARLY AREAS OF EXPLORATION\r\n<p>HEKL'S HOME - A cabin in the central woods. The well in the backyard runs deeper than one might imagine.</p>\n<p>THE PRIMWOODS - Dense forest of hundreds foot high trees, wooden bridges, a graveyard, and a river.</p>\n<p>KAPLAN CAVERNS - Damp underground cave that's mined for its previous minerals.</p>\n<p>THE ELDERWOOD - Largest and oldest tree in the world. The hollowed insides serve as the goblins' fortress.</p>\r\nINTERMEDIATE DANGER ZONES\r\n<p>RUINS OF KYR TEMPLE - A once proud sanctuary of stone pillars now collapsed and haunted by untrusted ones.</p>\n<p>THE UNDER RIVER - Limestone tunnel of raging water rapids beneath the earth. Home to a race of lizardmen.</p>\n<p>BRIMSTONE GROTTO - A blazing core deep beyond the roots. Here lies a legendary weapon and many fiery inhabitants.</p>\n<p>FLOATING PALACE - The place of Amondus' great power. Soars high in the sky.</p>\r\nCREATURES OF THE PRIMWOODS\r\n<p> SNAKER - Venemous prowler. Can get up trees.</p>\n<p> BONES - Undead warriors raised by Amondus.</p>\n<p> GOBLIN - Annoying beings that run and climb.</p>\n<p> BAT - Dangerous dweller of caves and the woods.</p>\n<p> TRENT - Demon bush immune to some magic spells.</p>\n<p> RAVEN - Fierce predator of the treetops.</p>\n<p> GHOST - Guardian soul near sacred areas.</p>\n<p> GARGOYLE - Awakened statues that drop skulls.</p>\n<p> GOLEM - Stone foe capable of causing rockfalls.</p>\n<p> LIZARDMAN - Uses spear and shield near water areas.</p>\n<p> CHARWIT - A phoenix. Ultimate Gain of Strength!<br/></p>\n<p> BEANCY - Accursed zombie pirate captain.</p>\n<p> FLERG - The ghost falcon. Pet of Beancy.</p>\n<p> RANT - The golden gargoyle. Underworld general.<br/></p>\n<p> AMONDUS - The master summoner and ambitious leader of the Order of the Talon. Lives in a sky palace.</p>\r\nADVICE FOR THE ADVENTURER\r\n<p>-When Hekl flashes after taking damage, he will be momentarily invulnerable.</p>\n<p>-Always look for ladders or branches that lead off-screen. They could be a path to a new area.</p>\n<p>-If you find it difficult to avoid certain enemy attacks, you might not yet have enough speed.</p>\n<p>-Falling in water will reset the screen but no life points will be lost.</p>\n<p>-Tri-caster can combine blocks and bridges. Use it to go almost anywhere!</p>\r\nTHE MAD WIZARD - CREATED BY\r\n<p>The Mad Wizard was created for the Nintendo Entertainment System by Sly Dog Studios (Rob Bryant) in 2014. It is well loved in the NES homebrew community as one of the most enjoyable homebrew titles ever released.</p>\n<p>Porting it to the PICO-8 system has been one of the most enjoyable game development projects I've ever undertaken, and I am immensely grateful to the creator for giving me permission to do so, both for my own enjoyment and so that the game might be enjoyed by another enthusiastic audience.</p>", "metacritic": null, "released": "2020-11-08", "tba": false, "updated": "2020-11-09T03:12:23", "background_image": "https://media.rawg.io/media/screenshots/be9/be9e552d2c34b24247ad9a211e28085f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 35, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["gradualgames"], "genres": [], "publishers": [], "esrb_rating": null}