{"id": 516508, "slug": "stop-the-count", "name": "STOP THE COUNT!", "name_original": "STOP THE COUNT!", "description": "<p><strong>Hello young Vote-counter,</strong><br/></p>\n<p>thank you so much for volunteering to help count all the ballot votes. As you are surely aware, the supreme leader <strong>Ronald Dump</strong> is taking over the country once again and it is in our hands to save this country. We must help our lizard savior <strong>Johny Buythem</strong> to get more then 50% votes to become the supreme leader! Count all his votes, and destroy all Dump ones. We are <strong>COUNTING</strong> on you! And beware of the cunning Eagle!</p>\n<p><strong>How does it work:</strong></p>\n<p>You play as Vote-counter, the person responsible for sorting vote ballots. But you have a more important job! You have 60 seconds to make sure Johny Buythem wins this election. For that you need to quickly decide whether the ballot is marked as Johny´s and needs to be swiped left into the mailing box or Dump´s vote and thus sent right, directly into the shredding machine. But watch out! The cunning eagle is watching all your decisions and will let you know when you make a mistake. Can you make sure that Johny gets <strong>more than 50%</strong> of votes and becomes the next supreme leader? Or will the world fall in chaos under the supremacy of Ronald Dump. That´s for you to decide! And you can always compare your results with agents in other states.</p>\n<p><strong>This game features:</strong></p>\n<ul><li>Ballot sorting</li><li>Two leaders</li><li>Cunning eagle</li><li>MORE ballot sorting...with a twist ;)</li><li>And more!</li></ul>\n<p><strong>Controls:</strong></p>\n<p>OR To swipe ballot left into the ballot box</p>\n<p>OR To swipe ballot right into the shredder box</p>", "metacritic": null, "released": "2020-11-08", "tba": false, "updated": "2020-11-09T03:18:02", "background_image": "https://media.rawg.io/media/screenshots/59a/59a0731f6a6a4264b5ea12558469fafe.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 112, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ilirion", "Deathress", "Mates1912"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}