{"id": 516545, "slug": "living-with-a-black-dog", "name": "Living with a Black Dog", "name_original": "Living with a Black Dog", "description": "<p>This game was made in 48 hours for the PLAY20 Game Jam. <br/>https://itch.io/jam/play20-online-game-jam<br/><br/></p>\n<p>This project was created during the PLAY20 game jam with the topic \"Exploring Borders\". The game focuses around a fictional character, who has BPD (\"Borderline\") suffering a panic attack / emotional outburst. Borderline personality disorder is a mental health disorder, which impacts the way you think and feel about yourself and others, causing problems functioning in everyday life through strong emotional reactions. It includes self-image issues, difficulty managing emotions and behavior, a pattern of unstable relationships and can lead to self-harm and other dangerous behaviours. Substance abuse, depression and eating disorders are commonly associated with BPD. The causes of BPD are unclear to this day.</p>\n<p>With our game, we wanted to show some methods used in the so-called DBT program, especially highlighting “skills\", which are teached and used to deal with panic attacks and emotional stress or disorder. Skills can include actions like meditating, counting things in your surroundings, eating something spicy, squeezing a stress ball and many more.</p>\n<p>The time we had to create the game wasn't enough to display BPD in detail. The topic of BPD, mental illness and disorders in general is very complicated and should be dealt with respect,  caution and great care. Our game is just one interpretation of how it could feel like to have such an episode. We are not experts on this topic and hope that we didn’t offend anyone.<br/><br/><br/>credits:<br/>amarillo - 3D art<br/>bonez - code<br/>Florian Arndt - sfx, voice acting, audio impementation<br/>Vault Kid - music, additional code<br/></p>", "metacritic": null, "released": "2020-11-08", "tba": false, "updated": "2020-11-09T03:25:40", "background_image": "https://media.rawg.io/media/screenshots/774/774a32c505c355dcb1dc86eb3a6016c7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 101, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["amarillosebas", "Vault Kid", "boscoJones", "Florian Arndt"], "genres": [], "publishers": [], "esrb_rating": null}