{"id": 51667, "slug": "containment", "name": "Containment", "name_original": "Containment", "description": "SUMMARY<br/>\r\nA fun, uniquely challenging and brutal arcade game with beautiful 3D visuals inspired by the Breakout games, with 80 levels over 4 phases, with different brick shape themes. The game forces you to split your focus 4 ways, as you must try to control FOUR different paddles at the same time on each edge of the screen, while trying to maintain control over the ball in more and more chaotic situations! The aim of the game is to “contain” and destroy the bricks, before they drift out of the screen or touch your paddles! The bricks have physics based collisions and are fully destructible! The mouse controls all 4 paddles at once, so easy to learn but difficult to master! Your reflexes will be put to the test!<br/>\n<br/>\r\nSPECIAL 3 STAR TYPES, STAR RATINGS AND CROWNS GAME PLAY SYSTEM<br/>\n<br/>\r\nStar Types <br/>\r\nThere are 3 Types of stars needed to finish a level <br/>\r\n– The Time Left Star, <br/>\r\n- The Lives Lost Star, and <br/>\r\n- The Bricks Lost Star. <br/>\n<br/>\r\nStar ratings<br/>\r\nEach of these stars have Bronze, Silver, Gold and Platinum difficulty levels. Similarly, there are also 4 types of Crowns, the Bronze, Silver, Gold and Platinum crowns.<br/>\n<br/>\r\nCrowns<br/>\r\nThe Crown achieved for each level is decided based on the overall minimum star rating achieved. For example, if you have obtained a minimum of a bronze star for each Star Type, then you have achieved the Bronze Crown. If you have bronze stars for two Star Types, and a Platinum star for the third Star Type, then you will still only have achieved the Bronze Crown. Similarly, if you have a minimum of 3 silver stars, you will have achieved the Silver Crown. If you have a minimum of 3 gold stars, you will have achieved the Gold Crown. If you have a minimum of 3 platinum stars, you will have achieved the Platinum Crown. <br/>\n<br/>\n<br/>\r\nPOWER-UPS<br/>\r\nThere are twenty different types of power-ups, some of which can be combined for powerful combos!<br/>\n<br/>\r\nCONTROLS<br/>\r\nThe controls are very straight forward to grasp, but surprisingly difficult to master. There are 4 paddles, one at each edge of the platform. The left and right paddles move up and down the screen on one axis only, by only following the upward and downward movement of the mouse. Similarly, the top and bottom paddles move left and right on one axis only, by only following the right and left movement of the mouse. <br/>\n<br/>\r\nHELPER BLOCKS<br/>\r\nIn order to ease the player into the game, initial levels provide “helper blocks” that block random sides of a level and allow the player to focus on the other edges, while getting used to the concept of using 4 different paddles moving on different axes. But only the initial levels! Once past them, you’re on your own!<br/>\n<br/>\r\nLEVELS<br/>\r\nThe game currently has 80 levels, and more levels and themes may be added as updates to the game in the future depending on the success and popularity of the game. The 80 levels are divided into 4 different phases. <br/>\r\no The first phase introduces Rectangular and Square faced 3d bricks. <br/>\r\no\tThe second set introduces Pentagonal 3d bricks. <br/>\r\no\tThe third set introduces Hexagonal 3d bricks.<br/>\r\no\tThe fourth set introduces Spherical and Ovoid shaped 3d bricks.<br/>\r\nAll these bricks are combined and mixed and matched to create more and more complex levels.<br/>\n<br/>\r\nPROGRESS<br/>\r\nAt the start of the game, only the first level will be unlocked. You need a minimum of a Bronze Crown, in order to unlock the next level and progress. The highest achievement possible for each level is to get the Platinum Crown. But the required achievements for this are really punishing, so if you can do this for all the levels then you’ve really mastered the controls and the game!<br/>\n<br/>\r\nSAVE FILES<br/>\r\nThere are 3 Save files available. The game will auto-save your progress between levels. During the play through of a level, the game is not saved, so game progress will be lost if you exit during a level. However, for all those stat-lovers out there, total game play time, total lives lost, total power-ups collected, etc., will still be saved to the game stats page.<br/>\n<br/>\r\nLINUX USERS<br/>\r\nPLEASE NOTE THAT THE GAME IS UNTESTED ON LINUX", "metacritic": null, "released": "2018-04-24", "tba": false, "updated": "2019-08-28T22:02:54", "background_image": "https://media.rawg.io/media/screenshots/c79/c7931c52110d436ade07c945df511744.jpg", "website": "http://finitereflection.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 12, "toplay": 1}, "playtime": 2, "achievements_count": 14, "ratings_count": 0, "suggestions_count": 45, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Finite Reflection Studios", "Planet X Game Studios"], "genres": ["Strategy", "Simulation", "Casual", "Indie"], "publishers": ["Finite Reflection Studios", "Planet X Game Studios"], "esrb_rating": null}