{"id": 516650, "slug": "gm78x", "name": "GM78X", "name_original": "GM78X", "description": "<p>08/11/20 VERSIONE DEMO</p>\n<p>STORIA</p>\n<p>Il pianeta Terra è stato invaso dagli alieni, che hanno preso possesso anche di molte strutture e veicoli militari terrestri per usarle a loro favore contro la resistenza terrestre.</p>\n<p>GM78X è un prototipo di aereo dotato di nuove armi tecnologiche capace di contrastare le astronavi aliene.</p>\n<p>Riuscirai a portare Jolinàr pilota prescelta a pilotare il GM78X alla vittoria?</p>\n\n<p>COMANDI</p>\n<p>Comandi PC:</p>\n<p>-tenere premute le frecce direzionali per muovere l'aereo</p>\n<p>-tenere premuta la barra spaziatrice per sparare</p>\n<p>-usare il mouse per cliccare sui pulsanti del menu</p>\n<p>Raccogli le stelline per aumentare il tuo punteggio finale!</p>\n\n<p>CREDITI</p>\n<p>GM78X è stato realizzato da Ganzerla Massimo tra Agosto e Novembre 2020, grafica inclusa, alcuni assets grafici sono stati acquistati e altri scaricati gratuitamente da internet dal sito Opengameart.org , come anche le musiche e i suoni.</p>\n<p>Un ringraziamento a tutto il gruppo Facebook SviluppareGiochi.it , in particolare a Samuele Sciacca.</p>\n<p>Un ringraziamento anche a Nicola Ventrone.</p>\n\n<p>---ENGLISH---</p>\n<p>HISTORY</p>\n<p>Planet Earth has been invaded by aliens, who have also taken possession of many ground-based military structures and vehicles to use them in their favor against terrestrial resistance.</p>\n<p>GM78X is a prototype aircraft equipped with new technological weapons capable of countering alien spaceships.</p>\n<p>Will you be able to lead Jolinàr chosen driver to fly the GM78X to victory?</p>\n\n<p>COMMANDS</p>\n<p>PC commands:</p>\n<p>- hold down the directional arrows to move the plane</p>\n<p>- hold down the space bar to shoot</p>\n<p>-use the mouse to click on the menu buttons</p>\n<p>Collect stars to increase your final score!</p>\n\n<p>CREDITS</p>\n<p>GM78X was created by Ganzerla Massimo between August and November 2020, graphics included, some graphics assets were purchased and others downloaded for free from the Internet from the Opengameart.org site, as well as the music and sounds.</p>\n<p>Thanks to the whole Facebook group SviluppareGiochi.it, in particular to Samuele Sciacca.</p>\n<p>Thanks also to Nicola Ventrone.</p>", "metacritic": null, "released": "2020-11-08", "tba": false, "updated": "2020-11-09T03:48:12", "background_image": "https://media.rawg.io/media/screenshots/26d/26d92abc5e7cfae3444afe2bbfbdcbb3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 119, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["max78games"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}