{"id": 516719, "slug": "prehistoria-itch", "name": "Prehistoria (itch)", "name_original": "Prehistoria (itch)", "description": "Latar Belakang\r\n<p>Teknologi pada zaman ini terus mengalami kemajuan pesat, dan permainan video atau disebut juga video game, tidak luput dari pengaruh kemajuan tersebut. Video game dibuat dengan tujuan hiburan maupun edukasi, yang di mana dalam rancangan ini menitikberatkan pada tujuan edukasi. Edukasi melalui video game telah dirancangkan dan dikembangkan sejak lama, namun sebagian besar dari rencana tersebut berakhir sebelum memiliki pengaruh pada dunia pendidikan. Adapun subjek dari pendidikan yang sudah dilibatkan dalam pengembangan tersebut antara lain adalah matematika, bahasa inggris, dan sains, yang di mana subjek - subjek tersebut merupakan subjek yang sifatnya lebih global. Untuk subjek khususnya dalam kurikulum yang digunakan di Indonesia, mata pelajaran sejarah Indonesia kurang dibahas dan dikembangkan melalui teknologi ini.</p>\r\nTujuan dan Manfaat\r\n<p>Dapat dilihat pada pernyataan di atas, kurangnya pembahasan dan peminatan terhadap mata pelajaran sejarah Indonesia menjadi suatu tujuan dalam pengembangan video game ini. Video game ini dibuat untuk mendukung edukasi mata pelajaran sejarah Indonesia siswa SMA kelas X dalam cakupan masa pra-aksara di Indonesia. Bersifat edukatif, namun tidak lupa juga mencakupkan aspek hiburan di dalamnya, yang bertujuan mempermudah pembahasan dan menambah daya tarik bagi siswa SMA.</p>\r\nDeskripsi Permainan\r\n<p>Nama Permainan: Prehistoria<br/>Genre: Puzzle, Adventure<br/>Competition Mode: Single Player<br/>High Concept Statement:<br/>Prehistoria adalah sebuah permainan single player yang memiliki genre puzzle dan adventure, dibuat berdasarkan tujuan sebagai media pendukung dalam proses pembelajaran Sejarah Indonesia, khususnya zaman pra-aksara. Dengan permainan interaktif ini, diharapkan dapat memberikan pemahaman dan ketertarikan lebih para siswa terhadap mata pelajaran terkait.</p>\r\nGeneral Summary of Progression\r\n<p>Secara singkat, dalam permainan ini pemain berperan sebagai penjelajah waktu ke masa lalu, untuk mempelajari lebih dekat mengenai penemuan dan kejadian pada masa pra-aksara. Tantangan pada permainan ini adalah seiring pemain menjelajah masa lalu, pemain harus menghindari kontak langsung dengan manusia (musuh) yang ada pada zaman itu demi menghindari gangguan pada linimasa. Pada permainan ini terdapat beberapa level, yang pada tiap levelnya terdapat objektif berupa benda penemuan pada masa itu atau kejadian yang ada pada masa itu. Pemain harus menemukan benda dan/atau kejadian tersebut untuk melanjutkan ke level berikutnya. Apabila pemain melakukan kontak dengan musuh maka darah pemain akan berkurang.</p>\r\nStory\r\n<p>Kemajuan teknologi di zaman ini tidaklah lepas dari segala yang terjadi di masa lalu. Di manakah semua ini berawal? Bagaimana semua ini bisa terjadi? Pertanyaan - pertanyaan semakin membuatmu penasaran, mengenai apa yang benar - benar terjadi di masa lalu. Dengan teknologi zaman ini, tidak ada hal yang mustahil. Rasa ingin tahu menjadikanmu sebagai seorang penjelajah waktu, untuk mengetahui dan mempelajari langsung tentang zaman - zaman yang tidak sepenuhnya tertulis dalam sejarah, yang hanya didapat dari barang - barang yang ditemukan. Namun, ingat, linimasa tidak dapat diubah dan diganggu, jika tidak ingin masa sekarang ini menjadi rusak dan terganggu.</p>\r\nCredits\r\n<p><strong>Salinan dapat dilihat dalam permainan di menu dengan logo Lustrum XII ITS.</strong></p>\n<p>Supervisors:<br/>1. Dr. Supeno Mardi Susiki Nugroho S.T., M.T.<br/>2. Mochamad Hariadi S.T., M.Sc., Ph.D.<br/>Programmer: Muhammad Daffa Abiyyu Rahman<br/>Game Design: Muhammad Daffa Abiyyu Rahman<br/>Art: Maydlinne Liudyvia<br/>Event Documents (Lustrum XII): Diaz Batara S.<br/>Team Name: Harapan dan Doa Ibu</p>", "metacritic": null, "released": "2020-11-08", "tba": false, "updated": "2020-11-09T04:03:42", "background_image": "https://media.rawg.io/media/screenshots/bdf/bdf8e785ee03a716b153ce7b9fdaa27c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 34, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Muhammad Daffa Abiyyu Rahman"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}