{"id": 516853, "slug": "drop7-clone", "name": "Drop7 Clone", "name_original": "Drop7 Clone", "description": "Drop7 Clone\r\n<p>Drop7 Clone is a web clone of the smartphone puzzle game Drop7.</p>\n<p>The game area is made of a 7-by-7 grid where each cell is either empty or occupied by a disc. Each turn the player gets a new disc to drop into one of the seven columns. The discs can be either numbered (from 1 to 7) or solid.</p>\n<p>A numbered disc will explode when its number matches the number of consecutive discs (connected to himself) either on its column or its raw. When exploding, a numbered disc will crack every solid disc nearby. Solid discs reveal a numbered disc when cracked twice.</p>\n<p>After 30 drops, a new level is reached, spawning a new row of solid discs from below, pushing the existing discs up. When either the discs overflow the top row or the grid is full of discs, the game is over.</p>\n<p>At each disc explosion, the player gets a number of points that increase as the explosion chain (i.e. the explosions combo) gets higher. When a new level is reached, the player gets a bonus of 7'000 points and if the grid gets clearead 70'000 points.</p>\n<p>Apart from the classic game mode, the game is available in:</p>\n<ul><li>blitz mode: a new level is reached after every 5 drops (and awards 17'000 points for each new level) but let the player is given only numbered discs to drop;</li><li>sequence mode: always spawns the same sequence of discs.</li></ul>\r\nControls\r\n<p>The game is controlled through keyboard.</p>\n<p>To control the disc, use A/D (left/right arrow keys) to move it sideways and S (down arrow key) to drop it.</p>\n<p>To move through menus, use W/S (up/down arrow keys) to move through the options and spacebar/enter to select.</p>\n<p>Hitting the ESC key will prompt the pause menu, where music and sound effects can be toggled and, if in the middle of a game, the current game can be restarted or quit.</p>\r\nTechnologies<p>Drop7 Clone has been developed using HTML5 and Javascript.</p>Credits\r\n<p>All the rights over the original Drop7 games belongs to Zynga Inc.</p>\n<p>The music is the track Retroland Recital by TeknoAXE.</p>\n<p>The ding sound is a modification of the Ding Ding Small Bell audio by JohnsonBrandEditing.</p>\n<p>Everything else, including images and HTML5/CSS/Javascript code, is made entirely by myself.</p>", "metacritic": null, "released": "2020-11-07", "tba": false, "updated": "2020-11-09T04:29:24", "background_image": "https://media.rawg.io/media/screenshots/b51/b51f8eb0fcf4deba70d659c90c254e67.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["oddlord"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}