{"id": 516873, "slug": "pluhnoah", "name": "Pluhnoah", "name_original": "Pluhnoah", "description": "<p>Greetings!<br/>The names Buttermel Bear! And I'm creating a choose your own adventure RPG titled Pluhnoah!<br/><br/>\"Pluhnoah\" at it's core is an RPG driven by user choice and character narratives. You will follow a rookie mercenary named Florrent, born and raised in a small village known as Wooldale. After setting off for his first adventure, following a tragedy, he is faced with different foes and adversities to overcome. Along the way the user will have the opportunity to decide who joins their adventure and who doesn't.</p>\n<p>                    -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -                                          </p>\n<p>Pluhnoah will deliver a full RPG experience with emphasis on player choice, allowing for every play-through to be entirely unique to it's player.<br/><br/>This projects main goal is to create a universe of fantasy that is diverse and inclusive to all. Pluhnoah's experience is aimed towards those who love traditional RPGS driven by story without those dated and traditional representations. Our world is diverse and rich in people, and our games should represent that.</p>\n<p>               -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -                                          <br/></p>\n<p>If you enjoyed Pluhnoah and want to see more consider going to my Patreon for monthly builds and much more!</p>\n<p>Social Media:</p>\n<p>Patreon</p>\n<p>Twitter</p>", "metacritic": null, "released": "2020-11-07", "tba": false, "updated": "2020-11-09T04:33:54", "background_image": "https://media.rawg.io/media/screenshots/61c/61c0925a5bc9721ee5dc1a330149d795.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 82, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Buttermel Bear"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}