{"id": 51683, "slug": "memories-of-mars", "name": "MEMORIES OF MARS", "name_original": "MEMORIES OF MARS", "description": "100 years in the future, something happened on Mars. Once frequently visited, it is now abandoned with some left behind. <br/><br/>MEMORIES OF MARS is a open world survival game set on the abandoned mining operations in the red planet, as the dream of exploiting and colonizing Mars has proven impossible. You play as a recently awoken clone who learns its lifespan is limited by the lethal solar flares that hit the surface of the planet every few weeks.<br/><br/>Tasked with surviving the barren wastelands of Mars, players must explore the unforgiving Martian terrain and build a habitable homestead while fighting off against a variety of dangers including strange enemies, harsh environmental elements and other human clone survivors.<br/><br/>Explore and Survive the Red Planet.<br/><br/><ul><li>EXPLORE AND DISCOVER – Explore over 16 KM2 of the Martian landscape complete with deserts, craters, canyons, rocky planes, and mesas. Visit over 85 points of interest including abandoned towns, mines, industrial facilities, biodomes and vehicles.<br/></li><li>SURVIVE – Look after basic needs including health, stamina, nutrition, body temperature and oxygen. <br/></li><li>FIGHT –Encounter and fight against unique NPCs and competing players that are always looking to interrupt your adventures. These NPCs are strange enemies left over from previous, failed, colonization efforts. Now they’ve gone rogue, and you’ll need to fend them off.<br/></li><li>BUILD – Building your own base will be a cornerstone of your gameplay experience. Build a small base on your own, or collaborate and build a much larger base. Either way, a base is required to for the ultimate project – surviving Mars!<br/></li><li>EVENTS &amp; FLOPS – Memories of Mars contains a unique system of in-game events where players will converge and try to survive these events and thereby collect Flops. There are multiple ways to collect Flops, but beware because other players can rob, kill and loot your Flops. </li></ul>", "metacritic": null, "released": "2018-06-05", "tba": false, "updated": "2023-02-07T02:18:23", "background_image": "https://media.rawg.io/media/screenshots/7ee/7eebaf59aca04ae7e156b93a560e6fbd.jpg", "website": "https://www.memoriesofmars.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 4, "owned": 90, "beaten": 1, "toplay": 4}, "playtime": 2, "achievements_count": 187, "ratings_count": 4, "suggestions_count": 433, "game_series_count": 0, "reviews_count": 4, "platforms": ["Xbox One", "PlayStation 4", "PC"], "developers": ["Limbic Entertainment"], "genres": ["Action", "Adventure"], "publishers": ["505 Games"], "esrb_rating": null}