{"id": 516970, "slug": "whisper-beyond-the-hollow", "name": "Whisper Beyond The Hollow", "name_original": "Whisper Beyond The Hollow", "description": "<p><em><strong>==============================</strong></em></p>\n<p><em><strong>She still hasn't called. Messaged. Emailed. Not a peep. Not to your parents. Not to you. She was supposed to keep in contact over summer break - and even if she wasn't, you spoke almost every day anyway. </strong></em><em><strong>But now there's nothing. </strong></em></p>\n<p><em><strong>No replies. No response. Too early to panic, the police said. No big deal. She's probably off partying. But you know her, and you know she would never keep you out of the loop. Not e</strong></em><em><strong>ven for this John guy. Not even then.  </strong></em><br/></p>\n<p><em><strong>But you do have an address. Six hours out. Some remote place in the middle of fucking nowhere - 20 miles from her college town. And maybe if you beg June, she'll take you. She'll get it. She has to. And if it turns out there's nothing wrong, no big deal - road trip. </strong></em></p>\n<p><em><strong>But at least you'll know. </strong></em><strong><em> </em></strong></p>\n<p>==============================</p>\n<p><strong>Whisper Beyond The Hollow</strong> is a short, incomplete, PSX style atmospheric horror experience made during October 2020 for Halloween Jam 2020, hosted and supported by @HauntedPS1. </p>\n<p>While incomplete, the first release is around 15 - 30 minutes in length, making up the first act of the project. The remaining game will continue to be worked on over the following months, and you can follow me at @SlvtSammich on Twitter to follow along with updates and release information. </p>\n<p>If you enjoy this project, please consider donating. </p>\n<p>Made in Unity3D and designed for Keyboard / Mouse. </p>\n<p>HPSX Render Pipeline by @pastasfuture</p>\n<p>==============================<br/></p>\n<p>Movement - WASD<br/>Inventory - TAB<br/>Interact - E<br/>Continue Conversation E/Mouse Click<br/>Use Special Item - Mouse Click<br/>Menu - ESC</p>\n<p>===============</p>\n<p>As this is a very early build of the game, there may be game breaking bugs and issues with the release. If you encounter any of these, please let me know by leaving a comment and I'll try to fix the issue by next release. There are also a few missing audio touches, and missing features, which should be added in future releases. <br/></p>", "metacritic": null, "released": "2020-11-07", "tba": false, "updated": "2020-11-09T04:55:35", "background_image": "https://media.rawg.io/media/screenshots/dfe/dfeef1fa5e45a0b031d92a6ad7cd8abb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 106, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ｔｅｃｇｏｔｈｉｃａ"], "genres": [], "publishers": [], "esrb_rating": null}