{"id": 51707, "slug": "march-to-glory", "name": "March to Glory", "name_original": "March to Glory", "description": "Europe, beginning of the XIX century. Born from the ashes of the Ancient-Regime, the new French Empire is putting the old continent on fire, spreading the seeds of the Revolution.<br/><br/>Napoleon Bonaparte, inflicting several humiliating defeats to his enemies, has shown how ineffective the old tactics have been against him, forcing the other European powers to renovate their approach.<br/><br/>Will this be enough to put an end the French ambitions? Or it will be just another fruitless effort against the military genius of the Corsican ogre? <br/><br/><br/><br/>March to Glory is a turn-based strategy game that takes you through the Napoleonic wars with a new strategic and challenging gameplay, full of interesting mechanics combined with thrilling combat.<br/><br/>Give orders to many different units and choose the best tactics to fight with your forces: engage in ranged attacks, cavalry charges and infantry assaults!<br/>You’ll also be able to have different unit formations and promote your units to give them advantages in different situations and kinds of terrains.<br/><br/><br/><br/>Enjoy the Single player campaign with 14 historical maps, ranging from France to Russia, passing through Austria, the German States and Prussia, or play with your friends in the Multiplayer mode, featuring a random map generator that will allow you to have always different experiences.<br/><br/>Finally, the beautiful soundtrack that will accompany you with great classical music, some of it composed in honour of the battles depicted in game.<br/><br/><br/><br/>Features<br/>- Strategic and challenging gameplay<br/>- Realistic combat system combined with simple to use mechanics<br/>- Ranged combat, cavalry charges, different unit formations: line, column, square, morale<br/>- Promotion based on unit's class, reinforcements, flanking, support, routs and cascade routs.<br/>- Promote units according to your strategy and always take into consideration terrain type.<br/>- Reinforcements not always arrive in time so having a plan B might help", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:02:53", "background_image": "https://media.rawg.io/media/screenshots/c9a/c9a20a99e9a881179c2c2e8439067cee.jpg", "website": "http://www.shenandoah-studio.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 406, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Shenandoah Studio"], "genres": ["Strategy"], "publishers": ["Slitherine"], "esrb_rating": null}