{"id": 517082, "slug": "tomb-of-the-eyeless", "name": "Tomb Of The Eyeless", "name_original": "Tomb Of The Eyeless", "description": "<p>You: \"I heard you are looking for a new member for your adventuring party?\"</p>\n<p>Stranger: \"Huh? You mean us?... who are you talking to, are you blind or something?\"</p>\n<p>You: \"Actually I am.\"</p>\n<p>Stranger: \"Haha, we are going into a dungeon, you know with monsters, why would we want to bring a blind fool like you with us?\"</p>\n<p>Stranger 2: \"Let's just go, this is ridiculous.\"</p>\n<p>You: \"...I guess I'll just have to go on my own then.\"</p>\n\n<p>Follow the music, kill monsters. Level = 10: You win.</p>\n<p>Hi! This is a dungeon-delving audiogame, There are a set of simple instructions inside the game itself, however this is an early prototype and have only two monsters, a slow moving zombie and an imp throwing fireball, as well as a boss on level 9...  A few more things: If you get hurt you will hear breathing from your character, the louder it is the closer you are to dying (you start with 4 health), you regain 1 health every time you gain +1 to the current level (by following the music). Also, when the Imp is about to throw a fireball you will hear a whoosh sound, like a bonfire being lit with a lot of gasoline, the actual fireball doesn't spawn until a short moment afterwards so you have a small window of time to react. So make sure to use your Dash to dodge or get close faster.</p>\n<p>My goals for the future will be to add several more enemy types, each with distinct mechanics that can be expressed through the limitation of audio only. More weapons, environmental dangers, as well as adding in several unique boss-fights.</p>\n<p>Any feedback or thoughts would be greatly appreciated, thank you for your time.</p>", "metacritic": null, "released": "2020-11-06", "tba": false, "updated": "2020-11-09T05:18:18", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["FloatingOer"], "genres": ["Action"], "publishers": [], "esrb_rating": null}