{"id": 51719, "slug": "sky-haven", "name": "Sky Haven", "name_original": "Sky Haven", "description": "We hear all sorts of complaints about airports. Crowded halls, inconvenient layouts, confusing navigation, lack of coffee shops or bathrooms. The poor airport builders must be getting a lot of heat… So come on! Build your own ideal airport, convenient for passengers and airliners alike. An airport in which everyone will be happy. Make a mark!<br/><br/><strong>Build</strong>:Start your process by carefully planning out wide spaces inside the terminal. Continue on with a thinking through the layout of the airport apron, make smart taxiway networks by connecting aircraft stands with runways. And build the rest of the airport in all other areas of management like Check-in counters, security checks, boarding gates, etc.<br/><br/><strong>Manage</strong>: Count your funds carefully. You will need to buy a lot of merchandise and equipment for your airport. Everything from all sorts of interior services to vehicles and buildings, such as check-in officers, ramp agents, buses, aircraft stairs, ATC tower, jet bridges and much much more. Even the smallest conveniences for your passengers like seats for sitting cost money. Otherwise that сomplainants decrease your rating because they could not buy a hot dog.<br/><br/><strong>Develop</strong>: Start with very basic services. Research and improve. Attract domestic and international airlines. Prepare for the big planes and huge passenger traffic.<br/><br/><strong>Choose</strong>: Make your own airport. Focus on discounters or make international hub. Remote ramps or bridged? Charters or regular flights. Big or small aircrafts? Domestic passengers or connected flighst? It's your decision, your rules.", "metacritic": null, "released": null, "tba": false, "updated": "2023-05-01T02:04:08", "background_image": "https://media.rawg.io/media/screenshots/ab9/ab97f5f21a31ae13fd9fff5930f8b669.jpg", "website": "http://realwelders.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 24, "toplay": 1}, "playtime": 4, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 292, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "macOS"], "developers": ["Real Welders"], "genres": ["Strategy", "Simulation"], "publishers": ["Real Welders"], "esrb_rating": null}