{"id": 517194, "slug": "the-space-between-us-wiborawildfeuer", "name": "The Space Between Us (Wiborawildfeuer)", "name_original": "The Space Between Us (Wiborawildfeuer)", "description": "<p>Online LARP (LAOG) for five players, duration: 5 hours</p>\n<p>_________________________________________________________________________</p>\n<p><strong>You are:</strong> The Mangatas, the most famous family in Spacefleet. Your Mission: to find a habitable planet. Because motherplanet Earth isn't gonna do it for much longer. After 100 years of cryo sleep you woke up in this remote part of the universe. Now you have to be strong as a family and stick together, if you don't want to lose your mind in the vast emptiness of space. Inspired in TV shows like Lost in Space and The Expanse and Nordic Style Larps like Odysseus.</p>\n<p>_________________________________________________________________________</p>\n<p><em><strong>\"Extremely well-designed and executed larp. </strong>It was easy to dive into the world and feel real connections with the characters and forget that you play on your own computer. I very much recommend this larp to anyone who wants to experience an emotional nordic-style online larp.\"</em> - Laura Kröger</p>\n<p><em>“A warmly heartbreaking larp about family, space, isolation and loyalty. A nordic Lost in Space with a lovely family you will treasure in your heart.” </em>- Andrea Vaghi (Moonesia)</p>\n<p><em>\"The space between us\" is a smart design, an exciting and emotional larp, with a diegetic setting that will make you live an intense experience playing the Mangata family, the most epic travelers in space.” </em>- Pepe Roma</p>\n<p>_________________________________________________________________________</p>\n<p><strong>We've been fearing it for years.</strong> Now, at the dawn of the 23rd century, the day when Earth becomes uninhabitable to humans looms near. Our only recourse is to send exploratory ships far and wide into space to search for a new home... and to hope that we aren't too late.</p>\n<p>Humanity's desperate last hope, you are a member of the distinguished Mangata spacefaring family. You have been sent into deep space searching for a new home for your species, now that it has royally screwed up Earth's habitability. You are alone in your solo exploration craft, cut off by vast distances from Earth, your only human contact the video calls between you and the four distant ships that make up the rest of your team. Can you overcome the familial tensions between you? Can you brave the ghosts of your past and complete your mission?</p>\n<p>_________________________________________________________________________</p>\n<p><strong>“The Space Between Us”</strong> is an online larp that is played via video chat (e.g. ZOOM, Skype). It requires exactly five players and one gamemaster, and lasts about 5 hours including workshops and debrief. There are prewritten characters and secret roles. This larp focuses on the relationships between the members of the family, and how they will affect the characters on their mission. And there will be some space adventure!</p>", "metacritic": null, "released": "2020-11-06", "tba": false, "updated": "2020-11-09T05:41:35", "background_image": "https://media.rawg.io/media/screenshots/579/5796c65bc7fff76e27f449720b495100.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 181, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Wiborawildfeuer"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}