{"id": 517203, "slug": "tank-attack-andres_7w", "name": "Tank Attack (Andres_7w)", "name_original": "Tank Attack (Andres_7w)", "description": "<p><strong>Tank Attack</strong> is a survival horror and shooter game, where we will drive a \"<em>Tank</em>\" and face numerous \"<em>Zombies\"</em> to save the earth.</p>\n<p>We will have weapons to kill the zombies before they destroy us. We will have bullets and a bomb cannon. The ammunition runs out, so you must calculate your shots and position well to avoid being hunted.</p>\n<p>We will face two types of <em>Zombies</em>: </p><ul><li><strong>Zombrax</strong>, who are smaller, faster, and annoying. If they run into the ammunition boxes they will destroy them and, if they drink the poison bottles, they will become Zombie Titans. Zombrax can only be killed by 2 bullet shots. </li><li><strong>Zombie Titan</strong>, who are bigger, slower, and stronger. The bullets do not hurt them, so you must kill them with 3 shots from the bomb cannon.</li></ul>\n<p>On the map, we will find some help to complete our mission. Ammo boxes; nitrox to run faster (but use it carefully, a bad calculation will make you crash into the nearest zombie). On the other hand, we should avoid poison bottles, since they make us smaller and they take away ammunition.</p>\n<p>To win we will need <strong>15 coins</strong>, which can be found in the map itself or after killing the zombies. It won't be easy, but we must save the earth and someone will have to. </p>\n<p>Get in the tank and kill those damn zombies.</p>", "metacritic": null, "released": "2020-11-06", "tba": false, "updated": "2020-11-09T05:43:37", "background_image": "https://media.rawg.io/media/screenshots/bf1/bf1dabacb7500f3e50261ec5b6524731.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 10, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Andres_7w"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}