{"id": 517239, "slug": "grab-em-by-the-puy", "name": "Grab Em By The Pu$$y", "name_original": "Grab Em By The Pu$$y", "description": "<p><strong>What is even the point of this game?</strong></p>\n<p>With so much division that exists in our country today, sometimes you just need to take a step back and have a good laugh.  Welcome to \"Grab Em By The Pu$$y\", a game where you play our President doing exactly what the title says.<br/>Now, one of the first things you might be thinking is, this hardly even qualifies as a game, and you'd be right.  But you should know that this is just a tiny part of what the final game will be.  But I started this project much later than I planned, and at the time of this writing, it's less than a day before a game like this will no longer be relevant, and I wanted to get SOMETHING out before the election.<br/>In the event our President goes on to have a second term, I will continue to develop this game, which is obviously a work of satire.  In it, you will make countless decisions in running the country, and there will be many minigames, including a Tetris-inspired Twitter game in which you own as many \"blue checkmarks\" as possible, a tower defense game in which you oversee the building of the wall, even a Risk-style strategy game in which you conduct foreign policy, as well as many more.  <br/>Whether you support Trump or not, there's something in the game for everyone to enjoy, or at least there will be.</p>", "metacritic": null, "released": "2020-11-06", "tba": false, "updated": "2020-11-09T05:53:23", "background_image": "https://media.rawg.io/media/screenshots/267/267bbfe3fec1374ca460ab6f86d5dc2a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 23, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["MerlinsMaster"], "genres": [], "publishers": [], "esrb_rating": null}