{"id": 517384, "slug": "turnip-boy-commits-tax-evasion", "name": "Turnip Boy Commits Tax Evasion", "name_original": "Turnip Boy Commits Tax Evasion", "description": "<p>Take control of an adorable turnip who happens to be an absolute menace to society. After failing to pay taxes and getting evicted from your home, you must go on an epic quest to pay back your massive debt to Mayor Onion. Garden tools to solve plantastic puzzles, meet eccentric vegetables and fruits, and take on treacherous fights against animals both big and small. Along the journey uncover what’s spoiling this garden community and rise to tear down the corrupt vegetable government!<br />\nA thrilling, single-player adventure full of tax evasion, petty crimes and more.<br />\nDungeons full of puzzles, enemies and rare treasures to pay back your debt.<br />\nBattle massive beasts that terrorize the garden community.<br />\nGrow and harvest plants to aid in your journey.<br />\nA large cast of quirky food-based characters, all with their own stories and problems.<br />\nTons of tax documents to rip up, allowing you to erase your paper trail and potentially destroy the government.<br />\nEarn collectible hats and alternate between which one to wear.<br />\nMultiple endings based on how effectively you commit tax evasion.<br />\nA deep history of the world and how it became what it is.</p>", "metacritic": 74, "released": "2021-04-22", "tba": false, "updated": "2024-02-16T04:26:26", "background_image": "https://media.rawg.io/media/games/4ce/4ce87a0d1274009bc19588eb491b1e01.jpg", "website": "http://playturnipboy.com/", "rating": 3.81, "rating_top": 4, "added_by_status": {"yet": 95, "owned": 1051, "beaten": 84, "toplay": 27, "dropped": 19, "playing": 6}, "playtime": 3, "achievements_count": 37, "ratings_count": 81, "suggestions_count": 337, "game_series_count": 1, "reviews_count": 84, "platforms": ["Nintendo Switch", "Linux", "macOS", "PC", "Xbox One"], "developers": ["Snoozy Kazoo", "Yukon W."], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["Graffiti Games"], "esrb_rating": null}