{"id": 51730, "slug": "the-communist-dogifesto", "name": "The Communist Dogifesto", "name_original": "The Communist Dogifesto", "description": "In 1957, the Soviet Union launched Sputnik 2. On board the spacecraft was a single dog, named Laika. When Laika returned to Earth, the Soviet scientists discovered something profound: dogs in space experience extreme cognitive enhancement. The following year the Soviet space program would be dedicated solely to studying the effects of space on canine intelligence...<br/><br/><strong>The Communist Dogifesto</strong> is a science fiction first-person shooter set on a Soviet space station in Lunar orbit, which has been used as a platform for experimentation on the Russian space dogs. Unfortunately, dogs this deep in space have more tricks in their vac suit than the scientists accounted for. Now Laika has taken over and you are the only one left who can take back the station, or at least attempt to escape with your life!<br/><br/>In order to survive and defeat Laika and her robotic footsoldiers, you will have to gain new abilities with tech upgrades, recycle scrap materials you find lying around into usable items, read data logs written by the ousted humans to find keycodes and to explore new areas of the station, and do a lot of good old fashioned shooting!<br/><br/>Features a hand-designed space station to explore, eight unique tech upgrades to choose from, pages of in-universe data logs from the scientists and other staff which reveal the nature of the work done on the station as well as vital information to access new areas and items, and several different endings based on in-game actions.", "metacritic": null, "released": "2017-12-21", "tba": false, "updated": "2020-04-15T10:24:25", "background_image": "https://media.rawg.io/media/screenshots/7d0/7d0b91c27bf0f8d8104cb1dd33102e8d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 196, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["Joshua Giles", "vede"], "genres": ["Action", "Shooter", "Indie"], "publishers": ["Joshua Giles"], "esrb_rating": null}