{"id": 517383, "slug": "bridge-constructor-the-walking-dead", "name": "Bridge Constructor: The Walking Dead", "name_original": "Bridge Constructor: The Walking Dead", "description": "<p>Experience the fun of KILLING WALKERS using the POWER of your BRAIN!<br />\nPrepare for the ultimate mashup experience! Bridge Constructor: The Walking Dead combines the legendary and challenging puzzle gameplay of Bridge Constructor™ with the post-apocalyptic zombie universe of AMC’s The Walking Dead.<br />\nJoin a group of survivors as they fight against hordes of undead walkers and a hostile human community. Build bridges and other constructions through bleak landscapes and ruined structures. Team up with fan-favorite characters like Daryl, Michonne and Eugene, and create safe passage for iconic vehicles from the series.<br />\nUse movable level objects, explosives and baits to your advantage as you lure walkers into lethal traps and guide your survivors to safety. Enjoy the physics-based frenzy and ragdoll animations as walkers succumb to the forces of gravity.<br />\nFEATURES<br />\nAMC’s The Walking Dead meets Bridge Constructor™<br />\nCreate elaborate constructions and lethal traps<br />\nA captivating plot featuring new faces as well as iconic characters and vehicles from the series<br />\nNumerous brainteasing levels and countless brain-eating walkers<br />\nMake use of movable objects and explosives to lure walkers to their doom.<br />\nSave your survivors and smash the undead hordes<br />\nBrutally funny walker ragdoll physics.</p>", "metacritic": 72, "released": "2020-11-18", "tba": false, "updated": "2024-03-22T22:40:43", "background_image": "https://media.rawg.io/media/games/176/17628bec5c40970dc5d1b9b672994d95.jpg", "website": "", "rating": 2.21, "rating_top": 3, "added_by_status": {"yet": 57, "owned": 187, "beaten": 2, "toplay": 2, "dropped": 14, "playing": 2}, "playtime": 3, "achievements_count": 39, "ratings_count": 14, "suggestions_count": 227, "game_series_count": 0, "reviews_count": 14, "platforms": ["Xbox One", "iOS", "Nintendo Switch", "PlayStation 4", "Android", "Xbox Series S/X", "PlayStation 5", "PC", "macOS", "Linux"], "developers": ["ClockStone"], "genres": ["Simulation", "Puzzle"], "publishers": ["Headup Games"], "esrb_rating": null}