{"id": 517338, "slug": "no-place-for-the-dissident", "name": "No Place for the Dissident", "name_original": "No Place for the Dissident", "description": "No Place for the Dissident is a strategic political simulator. You'll be responsible for the creation, growth, and adoption of a new ideology to dominate the world. But be careful, as your ideas gain traction, some will alert about its danger. The opposition will rise, and, if not controlled properly, it will wipe out your influence.<h3>Ideologies have shaped the world, will you be able to shape it as you want?</h3><br/>In No Place for the Dissident, you'll have to spread a new ideology to dominate the world. Whatever means are necessary.<br/><br/><h3>Key Features</h3><ul><li> <strong>Highend Simulator</strong>. The engine performs a worldwide simulation with hundreds of thousands of points. Our engine tracks your influence in each bit of the world, and each bit will interact with the rest. <br/></li><li> <strong>Population Segments</strong>. People are segmented into five different categories: <strong>neutral, supporters, violent supporters, opposition, and violent opposition</strong>.<br/></li><li> <strong>Social Traits</strong>. Your politics and actions will affect five different traits in each country: <strong>expansion, conversion, polarization, censorship, and terror.</strong><br/></li><li> <strong>Actions</strong>. Make peaceful protests, manipulate through TV, newspapers, fake news, and social media. Create associations, create militias, lead coups, repress opposition, and even declare war to enemy countries where your ideology didn't do well.<br/></li><li> <strong>Politics</strong>. Adopt new politics from the ideology tree to exponentially expand your ideas and crush the opposition. Adoptions of new politics will unlock bonuses and new actions to perform on each country.<br/></li><li> <strong>Multiplayer</strong>. Competitive 1vs1 online multiplayer.<br/></li><li> <strong>Real data of 175 countries</strong>: population density, economy, military power, political regime, and more!<br/></li><li> <strong>Governments</strong>. Access the government through free elections or by overthrowing the existing one by force.<br/></li><li> <strong>Events</strong>. From assassination plots to sexual scandals.<br/></li><li> <strong>News Feed</strong>. You'll make it to the headlines!<br/></li><li> <strong>War</strong>. Avoid civil wars, declare wars and, if you are sure, launch devastating nuclear strikes.<br/></li><li> <strong>Face the consequences</strong>. You may have dominated the world, but at what cost?</li></ul><h3>Warning</h3>This game includes dreadful and extremely violent motifs. It also contains quotes and points of view of the most violent historic figures.<br/><br/><br/>Millions of people have suffered the ultimate consequence of these beliefs.<br/><br/>We, the developers, consider that this should be reason enough to reflect on it.", "metacritic": null, "released": "2020-11-12", "tba": false, "updated": "2020-11-13T02:03:14", "background_image": "https://media.rawg.io/media/screenshots/758/758ab38487d6ae69dbe4a5b00ecbdc8e.jpg", "website": "https://noplaceforthedissident.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 391, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["David M."], "genres": ["Strategy", "Simulation", "Casual", "Indie"], "publishers": ["David M."], "esrb_rating": null}