{"id": 517385, "slug": "assassins-creed-valhalla-ultimate-ps4-and-ps5", "name": "Assassin's Creed Valhalla Ultimate", "name_original": "Assassin's Creed Valhalla Ultimate", "description": "To play this game on PS5, your system may need to be updated to the latest system software. Although this game is playable on PS5, some features available on PS4 may be absent. See PlayStation.com/bc for more details.<br/>This product entitles you to download both the digital PS4™ version and the digital PS5™ version of this game.<br/><br/>Includes the game, Season Pass, and Ultimate Pack.<br/><br/>Become Eivor, a legendary Viking warrior on a quest for glory. Raid your enemies, grow your settlement, and build your political power<br/><br/>-Lead epic Viking raids against Saxon fortresses.<br/>-Dual-wield powerful weapons and relive the visceral fighting style of the Vikings.<br/>-Challenge yourself with the most varied collection of enemies ever found in Assassin's Creed.<br/>-Shape the growth of your character with every choice you make and carve your path to glory.<br/>-Explore a Dark Age open world, from the shores of Norway to the kingdoms of England.<br/><br/>Save money on content for this game by purchasing the Season Pass. Content can be downloaded from the PlayStation®Store or in-game once it is released.<br/><br/>If you already own the PS4™ version of this game, you can get the PS5™ digital version at no extra cost and you do not need to purchase this product. Owners of a PS4™ disc copy must insert it into the PS5™ every time they want to download or play the PS5™ digital version. PS4™ game disc owners who buy the PS5™ Digital Edition disc-free console will not be able to get the PS5™ version at no extra cost.<br/><br/><br/>Offline single player<br/>Optional In-game purchases<br/>Online features require an account and are subject to terms of service (playstationnetwork.com/terms-of-service), privacy policy (playstationnetwork.com/privacy-policy), and the game publisher’s privacy policy.<br/><br/><br/>Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy). <br/><br/>Software subject to license (us.playstation.com/softwarelicense). <br/><br/>You can download and play this content on the main PS5 console associated with your account (through the “Console Sharing and Offline Play” setting) and on any other PS5 consoles when you login with your same account.<br/>", "metacritic": null, "released": "2020-11-12", "tba": false, "updated": "2023-07-24T06:37:08", "background_image": "https://media.rawg.io/media/screenshots/e66/e66371989b103d2299a17f5411c510a6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "beaten": 6, "toplay": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 4, "suggestions_count": 536, "game_series_count": 0, "reviews_count": 4, "platforms": [], "developers": [], "genres": ["RPG"], "publishers": [], "esrb_rating": null}