{"id": 51751, "slug": "endurance", "name": "Endurance", "name_original": "Endurance", "description": "<strong> It's time for Endurance.</strong><br/><br/>You have a game to play, but it's not going to be that simple. For you see; you've got to eat, drink and close the door. Sound easy? You best be prepared as beating the game as fast as possible is your objective and life is going to be the number one reason for slowing you down. Do you have what it takes to be the fastest player alive?<br/><br/>Take on a unique challenge of mixing the standard game that you want to complete without being distracted by real life while that very same real life will get in your way at every moment it's inconvenient. You will have to order and eat/drink fruit, meat, water, cola and so on so you don't die from starvation or dehydration. Don't forget to close your door which constantly gets opened up causing your screen to get too bright to see.<br/><br/><ul><li>Unique strategy style gameplay.<br/><br/></li><li>A mix between 3D graphics and retro 2D graphics.<br/><br/></li><li>5 Areas to \"The Game\" each with 3 levels.<br/><br/></li><li>4 difficulties each for Real Life and in \"The Game\".<br/><br/></li><li>3 different game modes: Normal mode with two other ones to unlock.<br/><br/></li><li>Actual consequence of failure: If you die in Real Life you'll have to start all over again.<br/><br/></li><li>Hints available when playing on lowest difficulties.</li></ul>", "metacritic": null, "released": "2018-01-16", "tba": false, "updated": "2019-08-28T22:02:51", "background_image": "https://media.rawg.io/media/screenshots/9af/9afd0a62aa00df7e3be56dae9bbebffd.jpg", "website": "https://gestmorphgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 26}, "playtime": 4, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 101, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Gestmorph Games"], "genres": ["Adventure", "RPG", "Strategy", "Indie"], "publishers": ["Gestmorph Games"], "esrb_rating": null}