{"id": 51762, "slug": "the-short-story-of-a-drifting-labyrinth", "name": "The Short Story of a Drifting Labyrinth", "name_original": "The Short Story of a Drifting Labyrinth", "description": "In The Short Story of a Drifting Labyrinth, the player takes control of Anaesse, a powerful magic user tasked with destroying a flying fortress which floats from village to village, consuming the people below to keep itself standing. A newly entrapped resident of the Labyrinth, you must destroy the fortress using the guidance of the long term captives. <br/><br/>Players will be tasked with a series of strategic encounters against a robotic army which will challenge their ability to think quickly. Using Anaesse’s abilities, you must outwit and out-muscle your way out of a necromancer’s sky fortress. <br/><br/>The Short Story is an isometric action game which gives you a choice between strategic, hack-n-slash, or mixed style gameplay.A Fascinating New WorldThe Short Story takes place in a floating Labyrinth, created by an ancient necromancer and inhabited by strange robotic beasts. Those who came before you sought to destroy the Labyrinth, but only became lost in its maze-like structure. Hoping beyond hope for an escape, the long term captives look to you to lead them out of the Labyrinth.Over 350 Unique Combat EncountersThe Short Story features at least 350 individual, unique, hand crafted combat encounters and 20 basic enemy units which all have their own unique AI. The 10 boss fights each individually feature their own mechanics which aren't re-used anywhere else in the game.Fast-Paced GameplayThe Short Story focuses on fast-paced real-time gameplay with quick restarts and infinite tries, allowing players to quickly fail and retry strategic combat encounters. A diverse array of abilities allow you to complete each encounter using your own distinct approach.No Early Restrictions on Your AbilitiesJump straight into the game as a powerful magic user. Players are at liberty to play as strategically or as aggressively as they desire with a range of offensive, defensive, and healing abilities without any early restrictions.Ability AnaloguesEvery ability has three levels of analogue, allowing the player to choose from the baseline, strong, or strongest level of a magical ability. However, proper stamina management is key in ensuring Anaesse’s survival.Your Game Time is Your DecisionThe Short Story allows you to choose how long the game lasts. You may simply skip levels that you aren't interested in or complete each individual level. <strong>Your game time is entirely your decision. </strong>Releasing February 26, 2018Explore the Labyrinth, discover its secrets, and interact with its inhabitants on February 26, 2018.A Note on Controller CompatibilityThe Short Story works with an Xbox controller (in addition to keyboard and mouse), however, the Launcher (which allows you to rebind keys, pick resolutions, and change settings) requires a keyboard and mouse.", "metacritic": null, "released": "2018-02-26", "tba": false, "updated": "2019-08-28T22:02:51", "background_image": "https://media.rawg.io/media/screenshots/675/6753bd5b3c6a523ccb7a6ae2a1527295.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 224, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["adefiantbrownie", "Hauris"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Indie"], "publishers": ["adefiantbrownie"], "esrb_rating": null}