{"id": 51767, "slug": "zombie-watch", "name": "Zombie Watch", "name_original": "Zombie Watch", "description": "DISCLAIMER: THIS GAME IS EARLY ACCESS ALPHA. WITH PURCHASE YOU ACTIVELY SUPPORT DEVELOPMENT OF THE GAME.<br/><br/>Welcome to the world of Zombie Watch! You are the one of a few that survived a virus that has infected most of the population and turned them into flesh-eating zombies. Play alone or team up with up to 4 friends and take on this challenge of survival in a harsh and brutal environment.<br/><br/>Zombie Watch is a top-down, open world survival game that will take you to a post-apocalyptic world, where you are going to encounter many different zombies and wildlife. Gather, mine, scavenge for resources and build a self-sustaining base with defenses to fend off the incoming zombie hordes. Craft or find weapons, armor, medicine and much more.<br/><br/><br/><br/><strong>STORY</strong><br/><br/>You wake up in a post-apocalyptic world overrun by bloodthirsty zombies that are after you around the clock. They can smell you from the distance, hear every step you take if you are not careful and make you their one and only target once they spot you. While living in hiding or fighting for your life, you also have to attend your basic human needs. It would be a shame if you perished of starvation or cold. Use your survival skills, hunt animals, make and set traps and build a self-sustaining base with a great defense! Enter the world of Zombie Watch – be aware of your surroundings and keep a good watch!<br/><br/><strong>FEATURES</strong><br/><br/><strong>- Breathtaking graphics</strong><br/><br/>  Enjoy the realistic landscape in a high-quality graphics.<br/><br/><strong>- Open world</strong><br/><br/>  Large realistic open-world landscape<br/><br/><strong>- Inventory system</strong><br/><br/>  Find or craft different clothing items, weapons, food and other equipment to carry on you at all times.<br/><br/><strong>- Base</strong><br/><br/>  Build your own base and a great defense system to keep the zombies out.<br/><br/><strong>- Zombie Hordes</strong><br/><br/>  Different zombies will attack you in hordes or one on one but they will also periodically attack your base. They can smell you from afar and hear your every step unless <br/>you are careful. You will be able to sneak up on them and kill them before they spot you. When you get bitten or otherwise wounded, you are going to be able to heal <br/>your wounds.<br/><br/><strong>- Wildlife</strong><br/><br/>  There are different animals to be hunted for food, bones, fat, leather and other items (bear, boar, wolf, fox...). You will be able to befriend a few of them – like a horse – to make them your companions. Some of them will attack you and try to kill you! You can also build and set traps.<br/><br/><strong>- Food and water system</strong><br/><br/>  You have basic human needs and you need food and water. You will be able to plant a few seeds and grow your own food.<br/><br/><strong>- Crafting</strong><br/><br/>  Find or craft your own weapons and armor. Cook, brew potions, scavenge, gather herbs, grow your own garden, mine ore, chop down trees and much more to come.<br/><br/><strong>- Exploration</strong><br/><br/>  Explore the surroundings of the living, breathtaking world and gather food and items. Everything can come in handy.<br/><br/><br/><strong>WEAPONS</strong><br/><br/><br/><br/>We will have a large variety of weapons e.g. pistols, assault rifles, shotguns, sniper rifles, crossbow, bow, swords, axes, shields, knives and much more. All of these items can be found or crafted at your crafting stations. You will be able to craft or find ammo.<br/><br/><strong>BASE BUILDING</strong><br/><br/><br/><br/>Chop down trees and carry logs to your base, mine and refine different kinds of ore or metal. Scavenge for provisions or grow your own food. Create a base with a great defense you can be proud of.<br/><br/><strong>ZOMBIES</strong><br/><br/><br/><br/>Zombies will attack your base in hordes repeatedly in waves. You can bunker down or fight the enemy directly. They will also attack you randomly while you are out exploring the landscape. You can heal your wounds when they bite or scratch you and keep on fighting. You need to make sure you have healing potions or bandages in your inventory at all times.", "metacritic": null, "released": "2021-09-17", "tba": false, "updated": "2021-09-17T04:13:01", "background_image": "https://media.rawg.io/media/screenshots/9c3/9c336e64c06a7c6716284cee997de478.jpg", "website": "https://www.nebulaxgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 446, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "Xbox One"], "developers": ["David Grof"], "genres": ["Adventure", "RPG", "Casual", "Indie"], "publishers": ["David Grof"], "esrb_rating": null}