{"id": 517689, "slug": "rade-blunner-episode-2-cannibal-whehs-little-shop", "name": "Rade Blunner, Episode 2: Cannibal Wheh's Little Shop", "name_original": "Rade Blunner, Episode 2: Cannibal Wheh's Little Shop", "description": "<p><strong><br/><br/>Rade Blunner, Episode 2: Cannibal Wheh's Little Shop</strong></p>\n<p>A presentation in Spanish of this game is available in this link:</p>\n<p> http://foro.speccy.org/viewtopic.php?f=6&amp;t=5369</p>\n<p>The map of the game, just in case you get lost, is available in this link:</p>\n<p> https://maps.speccy.cz/map.php?id=RadeBlunner2)</p>\n<p>This folder contains the game Rade Blunner, Episode 2 in two versions: the TCP/IP Virtual Joystick for Android compatible version and a normal version for those who do not have the Spectranet compatible TCP/IP Virtual Joystick.</p>\n<p><strong>Technical details</strong><br/></p>\n<p>Dylan Smith's Spectranet compatible <br/></p>\n<p>(so you can use our TCP/IP Virtual Joystick for Android app. as joystick):<br/></p>\n<p>http://spectrum.alioth.net/doc/index.php/Main_Page</p>\n<p>Iadvd's TCP/IP Virtual Joystick for Android compatible:</p>\n<p>https://play.google.com/store/apps/details?id=com.iadvd.android.tcpipvirtualjoys...</p>\n<p><strong>Story</strong></p>\n<p>(From Cannibal Wheh's interrogation by Rade Blunner Agff) <br/></p>\n<p>I used to have an Eye Factory. Well, you know, I made eyes for the Rytell Corporation. Everything was perfect until the day that those Lepricants arrived to my factory! They asked me about their morphology, longevity and incept days. Of course I did not say a word about it... and they got mad and almost finished me!</p>\n<p>They thought that I was frozen... but I survived! Tired of my luck, I decided to work in another business: noses. Big noses, small noses, noses with three holes (please do not ask me about it). Once indeed I did the nose of a lion! Anyway... I thought everything was calm... but then again, a new group of Lepricants found me!</p>\n<p>They wanted again that important information about their bodies, and I apologize, but this time I did not want to become an ice cube, so I told them that I would bring them the documents. They also obligued me to give them some Nose Kits that they want to sell illegally to get some money and escape from the city. <br/>Unfortunately I had stored that data in three different vaults of my factory. Clive is taking care of them... who is Clive? well, you'd better not even ask!  He is my secret experiment...</p>\n<p>My factory is a strongly defended place: toxic bubbles and z-rays are triggered on every room. I have switches that control the access to the secret chambers. Everything would have been easier if those robots that I hired would not have decided to go on strike exactly today!!!</p>\n<p>By the way... one of those Lepricants was that one that appeared on the TV last month... Weon was his name?</p>\n<p><strong>The Game</strong><br/></p>\n<p>Be careful getting too close to the toxic residues or you will lose your energy. If you find some earmuffs take them asap, it's quite cold here and you will recover some energy!</p>\n<p>When you get rid of Clive and all the robots, give all to the Lepricants, they will open a passage and will let you go home.</p>\n<p>It is said that there is a hidden room somewhere, and the robots know it! look for a suspicious wall and you will find it!</p>\n<p><strong>Check the board!!!<br/></strong><br/>At the bottom of the screen you will be able to check the map of the nose factory. The more you walk through the facility, the more the map will be completed. Use it wisely!\r\n</p>\n<p>You will notice three interrogations as well. As you obtain the morphology, longevity and incept day documents through the game, they will show an image step by step.</p>\n<p>When there is a conversation between Wheh and the robots or the lepricants the text are shown in the messages panel. This panel will show also important information depending on the room where you are, giving important clues about how to solve certain puzzles.<br/></p>\n<p><strong>Controls</strong></p>\n<p>      O / joystick left: run left.</p>\n<p>      P / joystick right: run right.</p>\n<p>      Q, SPACE / joystick fire (Red or Green button): jump.</p>\n<p>      A / joystick fire (Green button): turn a switch.<br/></p>", "metacritic": null, "released": "2020-11-12", "tba": false, "updated": "2020-11-13T04:01:09", "background_image": "https://media.rawg.io/media/screenshots/a6d/a6da05d7f82e6a4e1342b18b555a194e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 72, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Furillo Productions"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}