{"id": 51771, "slug": "stax", "name": "STAX", "name_original": "STAX", "description": "STAX!!! Blast your way through one hundred colourful, addictive levels in this classic inspired arcade puzzle game.<br/><br/><strong>STAX is the definitive way to play a coloured-tile matching game on the PC or Mac.</strong><br/><br/>Players need to place the same coloured brick adjacent to one another, in a combination of 3 or more. Doing this removes the combination from the basket and scores points. Each wave has a goal that needs to be completed in order to progress. Multi-bricks have a one in twenty chance of spawning, which allow the player to join different colours in one combination.​<br/><br/>The levels progress linearly from 1 to 100, with the difficulty increasing every few waves with the addition of more colours and an increase in speed. Each level also speeds up the longer the player spends on it.<br/><br/>There are secret level skips available (on waves ending with a 1 or a 6) throughout the game for the experienced player to jump ahead, at the expense of earning extra points on easier levels to boost their high score. Activating these skips requires the player to create a giant combo in the shape of several different letters (T, X or Y).<br/><br/>STAX is a spiritual successor to Klax, the 1989 arcade game. It is just as fun and addictive as the arcade classic but with many improvements, not least of all, the soundtrack.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:02:51", "background_image": "https://media.rawg.io/media/screenshots/69b/69b933f2bc2523c01c5259b7e2c57334.jpg", "website": "https://www.modacodegames.com/stax", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 158, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Moda Code Games"], "genres": ["Casual", "Indie"], "publishers": ["Moda Code Games"], "esrb_rating": null}