{"id": 51802, "slug": "scavenger-sv-4", "name": "Scavenger SV-4", "name_original": "Scavenger SV-4", "description": "Scavenger SV-4 is a highly replayable atmospheric first-person science fiction game.<br/>\n<br/>\r\nYou are alone on your ship, in orbit above an undiscovered alien planet.<br/>\n<br/>\r\nThe windswept surface below is a radioactive wasteland.  In orbit, the radiation levels are dangerous.  Landing there would kill you in seconds, even through your spacesuit.<br/>\n<br/>\r\nYou have a remote control rover drone.  The signal is weak and the interference is strong - the video feed is grainy with static.  Use it to explore the surface of the planet, the derelict structures there, and the remains of alien machinery long dead... or perhaps just dormant.  <br/>\n<br/>\r\nPilot your rover, bring back samples, and research them in the science lab.  Use the objects you've found to enhance your rover.  Try to figure out what happened here.  Each time you start a new game, you are someone else, with a different story and unknown mysteries waiting on a new planet.  With luck, you might leave with a cargo hold full of priceless alien artifacts and be wealthy for life.<br/>\n<br/>\r\nBe careful.  Bad things sometimes happen to lone explorers far from home.<br/>\n<br/>\r\nScavenger SV-4 is genre defiant - part simulator, part roguelike, with elements of action, combat, resource management, and a dash of horror.  It is not quite like any game you have played before.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:02:50", "background_image": "https://media.rawg.io/media/screenshots/5ca/5ca9327e2fff8a03cab5ced49f291461.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 26, "toplay": 4, "dropped": 1}, "playtime": 3, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 393, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Deric Ruhl"], "genres": ["Action", "Adventure", "Simulation", "Indie"], "publishers": ["HoroArch"], "esrb_rating": null}