{"id": 518017, "slug": "alchemist-itch-spellweaver", "name": "Alchemist (itch) (Spellweaver)", "name_original": "Alchemist (itch) (Spellweaver)", "description": "<p>Alchemist is a \"traditional\" roguelike dedicated to crafting, resource management and world interactivity. It's still an early version and a lot will be added later.</p>\n<p>What you can expect:</p>\n<ul><li>Detailed 64x64 tiles, soft lighting and special effects.</li><li>Unique alchemy system with raw materials refined into essential components that represent abstract qualities: \"something sinister\" can be a bat wing, or a spider net, \"something verdant\" is a bunch of leaves or a young branch. Those components are then used to create potions and tools.</li><li>A dozen of recipes and many more ingredients to gather.</li><li>Highly interactive environment. A lot of objects in game can be interacted with in many ways: smash barrels, shatter walls, fell trees, start wildfires, then douse them.</li><li>Dangerous enemies with custom UI that require you to pay attention to their habits but become easy if you do.</li><li>A few environments created with various degrees of procedural generation.</li><li>A lot of flavor text in item descriptions, object descriptions and recipes.</li><li>Keyboard controls, supporting mouse as an alternative.</li></ul>\n<p>I really love feedback and listen to all of it, even if I don't always agree. I will be happy to hear your suggestions or criticism.</p>\n<p>If for some reason you really really like my work, you can buy me a coffee.</p>", "metacritic": null, "released": "2020-11-11", "tba": false, "updated": "2020-11-13T05:20:54", "background_image": "https://media.rawg.io/media/screenshots/94f/94fe73e51d692bbb10b2f5d34e17617c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 136, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Spellweaver"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}