{"id": 518100, "slug": "david-clark-eagle-down-2077", "name": "David Clark Eagle Down 2077", "name_original": "David Clark Eagle Down 2077", "description": "EAGLE DOWN 2077\r\n<p>The year is 2077, war between other countries and Australia has escalated due to the breakdown of trade agreements, global overpopulation and limited resources.</p>\n<p>The government has lost control of regulating law throughout some parts of the country. Many Australian citizens have taken refuge at military facilities and precincts, like Fort Lytton, for there protection and security against gangs and looters.</p>\n<p>After an offshore attack that saw Fort Lytton pelted with ordinance many have abandoned the stronghold. The military no longer watch over the fort which has created opportunities for groups with their own interests to take over the area.</p>\n<p>Recently, a military drone known as an Eagle went missing while surveying the area. Believed to shot down the Minister of Defence has personally requested retrieval of the drone as it contains months of coastal analysis data crucial to the security of the country.</p>\n<p>An agent has been given the task of infiltrating the fort and finding the drone as discretely as possible. The agent is flown in, just outside the fort Lytton gate. Supported by a state-of-the-art military recon ship from the air the investigation begins.</p>\n\r\nTHE MISSION\r\n<p>Search the Fort Lytton area for the missing drone. Collect the three items scattered throughout the compound to recover the data contained within the drone. Transmit the data back to HQ and escape via the evac point on the roof.</p>\n\r\nCREATED BY\r\n<p>David Clark</p>\n\r\nREQUIREMENTS\r\n<ul><li>Windows 64bit operating system.</li><li>GTX 1060 ( equivalent or higher ).</li><li>VR HMD and controllers ( Vive pro recommended ).</li><li>Steam VR.</li></ul>\n\r\nHOW TO INSTALL\r\n<ol><li>Download Zip file.</li><li>Unzip folder to an appropriate location.</li><li>Open folder and double click on exe file.</li><li>In steam VR Controller settings select customise and apply grabbing action to triggers if necessary.</li></ol>", "metacritic": null, "released": "2020-11-10", "tba": false, "updated": "2020-11-13T05:38:53", "background_image": "https://media.rawg.io/media/screenshots/6d7/6d7f07efe308b3a3ac196c0491a68e04.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 295, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["virtualenvironments"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}