{"id": 518180, "slug": "taco-neko", "name": "Taco Neko", "name_original": "Taco Neko", "description": "<p><strong>You. Are. Suavez.</strong></p>\n\n<p>Owner of the world's most renown Taqueria. People call you the Gordon Ramsey of Tacos. They said Taco-less Tacos couldn't be done, but you were the first to do it. You made headlines. Developed renowned techniques and styles. Your craft is rewarded with fortune, fame, and countless customers at Suavez #1 Taco. You have it all.</p>\n<p>Or so you thought.</p>\n<p><strong>GATACO CO. INVITES YOU TO THE ISLAS DE GATACOS</strong><br/></p>\n\n<p>One day, a mysterious letter arrives at Suavez #1. Addressed from the unknown Gataco Co., they claim to have the world's best taco ingredients on the Islas de Gatacos. They offer you a free ride and accomodation in return for bringing fame to the Islas' tacos. But they mention a danger- they say, perhaps, the tacos may not be made. You chortle with confidence. Has anything stopped Suavez before? Never! You leave Suavez #1 with your trusty sidekick Paco, and head to the Islas de Gatacos.</p>\n<p><strong>ROBO-CATS! MEAT TREES! TACOS!</strong><br/></p>\n\n<p>You soon discover the reason for Gataco Co.'s concern- the Islas are dominated by hungry Robo-Cats! The cats feed off the Islas' three main variety of Taco Trees- Lettuce Trees, Taco Shell Trees, and Meat Trees! And they'll guard them with their electric ears! As Suavez, you'll have to be careful to avoid the watchful eyes of these cats while trying to make your own tacos- lest you have to drop everything and RUN!</p>\n<p><strong>3 EXCITING LEVELS</strong></p>\n<p> </p>\n<p>Make your way through the first 3 Islas de Gatacos in this prototype! Make sure to make your tacos before the time limit- or you'll be forced to abandon your expedition early!</p>\n<p><strong>HAVE FUN. BE SUAVE. BE SUAVEZ.</strong><br/></p>\n<p>Play now in your browser!</p>\n<p><strong>CONTROLS</strong><br/></p>\n\n<p>A - Interact</p>\n<p>D-Pad - Move</p>", "metacritic": null, "released": "2020-11-10", "tba": false, "updated": "2020-11-13T06:00:05", "background_image": "https://media.rawg.io/media/screenshots/362/362b7c609ffdec5ec90f22ccdc2e98db.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 61, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["halmic"], "genres": ["Action"], "publishers": [], "esrb_rating": null}