{"id": 518128, "slug": "hero-dog-2020", "name": "HERO DOG (2020)", "name_original": "HERO DOG (2020)", "description": "<p><strong><em>[Português Brasil]</em></strong></p>\n<p><strong>HERO DOG (2020)</strong> É um Jogo de Pedro Lustosa de Shooter feito com base na Engine Construct 3 e Apresentado como trabalho de Conclusão do Curso de Game Design da Escola de Efeitos Visuais chamada Gracom(No Brasil). Essa Versão do Trabalho está sendo Liberado Gratuitamente com Legendas em Português, Lembrando Novamente que foi um trabalho de conclusão do curso e contém musicas de direito autoral, essa versão em si não tem fim lucrativo.<br/> </p>\n<p><strong>ENREDO:</strong><br/>Cutie é um Filhote canino da raça Pinscher criado pelo Doutor Maluco em um Laboratório que consiste em transformar o filhote em ser capaz de ser imune a quase tudo, principalmente doenças, dores, e fogo. Cutie tinha tudo para não ter empatia, carinho e respeito. mas, após tanto sofrimento, decide fugir do laboratório em busca de uma família para se sentir melhor e futuramente se tornando o Hero Dog.</p>\n<p><strong>STAFF:</strong><br/>Pedro Lustosa (Personagens/História/Fundos/Pintura Digital &amp; a mão/Design Original/Criação/Produtor/Ilustração/Textos)</p>\n<p>Felipe Hotz<br/>(Ilustrador Principal/ Concept Art/ Sprites)</p>\n<p>Mayara Abulquerque<br/>(Programação / Level Design)</p>\n<p>Bárbara Lustosa<br/>(Pintura a mão)</p>\n<p><strong><em>OBSERVAÇÃO: depois atualizo com legendas em Inglês e Espanhol Latino, caso for possivel.</em></strong></p>\n\n<p><strong><em>[English]</em></strong></p>\n<p><strong>HERO DOG (2020) </strong>It's a shooter game made by Pedro Lustosa based on the Construct 3 engine and presented as a completion of course work of game design of the School of Visual Effects called Gracom (from Brazil)<br/> The version from the wotk is being released for free with portuguese subtitles. Note: remembering that this is a completion of course work, so it contains musics with copyright and is for no profit</p>\n<p><strong>STORY:</strong><br/>Cutie is a pinscher puppy raised by Doctor Maluco in a lab that aims do make puppies invulnerables to disease, pain, and almost everything. Cutie had all to be a dog with no empathy, no love, no respect. But, after all the pain, he decides to eacape the lab in search of a family to make him feel better, in the future becoming the Hero Dog</p>\n<p><strong>STAFF:</strong><br/>Pedro Lustosa (characters/story/backgrounds/digital and handmade paint/original design/creation/productor/illustration/texts)</p>\n<p>Felipe Hotz<br/>(Main illustrator/concept art/sprites)</p>\n<p>Mayara Albuquerque<br/>(Programming/level design)</p>\n<p>Bárbara Lustosa<br/>(Handmade paint)</p>\n<p><strong><em>Obs: in the future, I will update the game with english and latin spanish, if possible</em></strong></p>\n\n<p><strong><em>[Espanõl]</em></strong></p>\n<p><strong>HERO DOG(2020) </strong>Es un juego de Pedro Lustosa de Shooter realizado en base a Engine Construct 3 y presentado hoy como finalización del curso de Game Design en la Escuela de Efectos Visuales llamada Gracom (en Brasil). Esta versión del trabajo se publica de forma gratuita con subtítulos en portugués, recordando nuevamente que fue un trabajo de finalización del curso y contiene canciones de derechos de autor, esta versión en sí no tiene fines de lucro.</p>\n<p><strong>TRAMA: </strong><br/>Cutie es un perrito de raza Pinscher creado por el Doctor Mad en un Laboratorio que consiste en transformar al perrito para que tenga poder de ser inmune a casi todo, principalmente enfermedades, dolores y fuego. Cutie lo tenía todo para no tener empatía, cariño y respeto. pero, tras tanto sufrimiento, decide huir del laboratorio en busqueda de una familia para sentirse mejor y en un futuro convertirse en el Hero Dog.</p>\n<p><strong> STAFF:</strong><br/> Pedro Lustosa (Personajes / Historia / Fondos / Pintura digital y a mano / Diseño original / Creación / Productor / Ilustración / Textos) </p>\n<p>Felipe Hotz (Ilustrador principal / Arte conceptual / Sprites) </p>\n<p>Mayara Abulquerque (Programación / Diseño de niveles) </p>\n<p>Barbara Lustosa (Pintura a mano) </p>\n<p><strong><em>NOTA: Luego actualizaré con subtítulos en inglés y español latino, si es posible.</em></strong></p>", "metacritic": null, "released": "2020-11-10", "tba": false, "updated": "2020-11-13T05:45:19", "background_image": "https://media.rawg.io/media/screenshots/b3e/b3efbdd8bc2ee16dc9e00c49a8b15cbf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["LMA TEAM"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}