{"id": 51823, "slug": "bomb-bay", "name": "Bomb Bay", "name_original": "Bomb Bay", "description": "Bomb Bay is a new single player game that takes the player into many different and unique settings with the task of arming explosive devices on enemy payloads. You are all alone, with nothing but your mind, your weaponry, and your mission.<br/><br/>This game offers hours of fun while giving you a rush of excitement leaving you on the edge of your seat wanting more. As the player, <strong>YOU</strong> get to decide how you play. You can run and gun, mowing down anyone that gets in your way. Or you can choose a more stealthy approach, leaving havoc in your way and disappearing before they even know what hit them.<br/><br/>Players can play many different ways. Whether that be arming the bombs, and heading straight to the EVAC zone. Or doing some snooping around and finding some beneficial equipment to assist on their mission. The possibilities are endless, whatever you can think of doing, you can do it here. Each level brings a new challenge to the player and new strategies to think of. No mission can be played the exact same. <br/><br/><strong>Key Features:</strong><br/><ul><li> Arm the three bombs on set locations, all while keeping your health up, completing secondary objectives, planning out strategies, and making fast decisions.<br/></li><li> Learn the importance of mixing stealth and chaos to beat every situation with maximum proficiency.<br/></li><li> Take a chance to explore the maps and find ways to assist you in your endeavors.</li></ul><br/>*Free DLC to come in future updates!", "metacritic": null, "released": "2018-02-16", "tba": false, "updated": "2019-08-28T22:02:49", "background_image": "https://media.rawg.io/media/screenshots/a28/a28fb3f65fc173a8a00d8766cbc0182d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 5}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 346, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jake Waggoner"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Jake Waggoner"], "esrb_rating": null}