{"id": 518241, "slug": "attack-of-the-es", "name": "Attack of the E's!", "name_original": "Attack of the E's!", "description": "<p>As you wander into town, you notice its entirely deserted.  Cars and houses lay abandoned, with weapons strewn about showing signs of a battle. Then, you see something approaching from the distance. First, you only see one, then two, five, and soon there's an entire swarm of them! With only seconds left, you brandish a pistol and prepare for a fight...</p>\n<p>\"Attack of the E's!\" is a 2D shooter where all the objects are made from letters and symbols. This was done to allow for the game's code to be pasted into the console of any browser, making the game available to be played on most computers and laptops, regardless of any restrictions, such as a requirement for admin access to download or ban on game websites. The gameplay itself involves the player constantly maneuvering around to avoid \"E's\" and fire at them. The terrain and items are generated and include the following:</p>\n<ul><li>Cars (currently not usable)</li><li>Houses</li><li>Walls (varying sizes)</li><li>Emitters (devices that momentarily repulse the E's at a cost of 15 score)</li><li>3 Different Weapons</li></ul>\n<p>The weapons of the game consist of the following:</p>\n<ol><li>Pistol: The starting weapon, decent range and one shot per use</li><li>Shotgun: A two-shot weapon, short-range.</li><li>Sniper: A long-range weapon that fires two bullets close together.</li><li>SMG: A three-round burst weapon, short-range.</li></ol>", "metacritic": null, "released": "2020-11-10", "tba": false, "updated": "2020-11-13T06:14:27", "background_image": "https://media.rawg.io/media/screenshots/f84/f849103573a99c0bc93e9c426a947581.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 24, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["LDGamingExpress"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}