{"id": 51839, "slug": "coin-match", "name": "Coin Match", "name_original": "Coin Match", "description": "Money is addictive and coins are especially so - shiny gold, silver, nickel, electrum, and copper, all colours, sizes and designs! Find matching pairs of coins in this Mahjong-style puzzle game to unlock all chapters and collect all coins.<br/><br/>This puzzle game is unique, not only does it provide entertainment, but it will also educate you by providing interesting facts. All the coins in the game are real, displaying both historical and current currencies that were in circulation throughout the world - from Ancient times to current day.<br/><br/>The game offers:<br/>• Addictive mahjong-like gameplay.<br/>• Realistic coin designs of the world currencies.<br/>• Chapter collections where all your treasures are stored. <br/>• Interesting facts about coins.<br/>• Easy to learn but challenging enough gameplay.<br/>• 3 free chapters with 35 unique coins: Ancient Greece, Ancient Rome, Britain. <br/>• (current version) 2 premium chapters, Spain and Asia with 22 unique coins.<br/>• Unlimited premium chapter access and ad free experience with the Premium bundle purchase.<br/><br/><br/>The gameplay and rules are simple:<br/>• Each level has a goal to achieve - collect a certain amount of coins of any or specified type.<br/>• You can collect coins by selecting a pair of matching coins. <br/>• Coins have heads and tails (obverse and reverse) - you can flip them.<br/>• The coins can overlap and only top level coins can be collected.<br/>• Some levels have a limit on the moves required to achieve the goal. <br/>• You have some bonus moves and “undo” attempts and can purchase more if needed.<br/>• After a level has been completed, the game shows the coins you collected and some interesting facts about those coins.<br/>• The coins found are saved in a chapter's collection.<br/>• Some chapters are free and open after a previous chapter is complete. Some chapters are premium and available only through in game purchase.<br/>• When you purchase the Premium bundle, you can access all premium chapters that are available or will become available in the future!<br/><br/>Enjoy the game and let me know if you liked it or email me at feedback@weronalabs.com on what you want to see in the game - this is important for me to plan what I add or change in the game. <br/><br/>Share the game with a friend and spread the word if you liked it!", "metacritic": null, "released": "2017-11-22", "tba": false, "updated": "2019-10-22T13:59:48", "background_image": "https://media.rawg.io/media/screenshots/a7e/a7eff0231d6984028ab472bab0abdb7b.jpg", "website": "http://www.facebook.com/coinmatch", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 131, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Andrew Grischenko"], "genres": ["Strategy", "Puzzle"], "publishers": ["Andrew Grischenko"], "esrb_rating": "Everyone 10+"}