{"id": 518460, "slug": "car-rally-3000-by-natcam-games", "name": "Car Rally 3000 by NatCam Games", "name_original": "Car Rally 3000 by NatCam Games", "description": "<p>Tired of old Racing games with not enough detail to keep you interested?  Introducing Car Rally 3000.  Car Rally 3000 is a 2D top down viewing, competition car racing arcade genre, where the Player (Protagonist), tries to outrun the Bad guys (Antagonists) and place 1st all while picking up health to restoring their damaged vehicle; coins for high score and extra lives; fuel for a speed boost; and a key in each level, that unlocks the next level once the player drives onto their team truck.  The race is a set 10 laps, dodging bumps, water hazards and winding tracks.  The game is aimed at ages 5-10 years and is designed to be played on a PC platform.  Some of the mechanics Car Rally 3000 uses include:  Movement, Scoring System, Competition and Status.  This one player game is controlled best using the arrow keys (Up, Left, Right, Back) on the keyboard, however, can also be controlled using (W,A,S,D) keys.  This game featuring colourful graphics and realistic car driving and handling, just must be made, as it is a reminder of the classic arcade Nitro Rally games. </p>\n\n<p>The main protagonist that the user will control is Yellowstone.   </p>\n<p>Yellowstone comes from outback Queensland living the farm life. While Yellowstone is driving his buggy on his farm Yellowstone enjoys tearing it up. Yellowstone is a driver that has no fear and is willing to hit the jumps at high speed to get plenty of air. </p>\n<p>  </p>\n<p>Yellowstone’s main opponent is Rory Red Rocket the red protagonist,  </p>\n<p>Yellowstone enjoys beating Rory especially when there is some air involved.  The character design for Yellowstone and the computer players are based on, a Toyota FJ Cruiser a popular 4wd.  </p>\n<p> Yellowstone can be controlled by using the arrow keys (up, down, left and right) or if you are left handed the player can use the W,A,S,D,</p>", "metacritic": null, "released": "2020-11-09", "tba": false, "updated": "2020-11-13T07:06:21", "background_image": "https://media.rawg.io/media/screenshots/b88/b88c83737a9c803ce4a007d8c7ad5e79.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 72, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["NatCam Games"], "genres": ["Racing"], "publishers": [], "esrb_rating": null}