{"id": 518462, "slug": "la-prairie-des-mots", "name": "La prairie des mots", "name_original": "La prairie des mots", "description": "<p>This is our contribution to <strong>Trijam#94</strong> (\"a+b=c\").</p>\n<p>This was our first game jam as a family jam: my wife, my daughter (7yo), my son (9yo) and myself wanted to create a game as a new way to take time together.</p>\n<p><strong>It's a game where you have to write two words (a and b) to get the full sentence (c).</strong></p>\n<p><em>Warning: it currently does not detect correctly the keyboard layout and seems to keep the standard US keyboard layout (that means if you use an AZERTY keyboard, you will have to press W to enter Z and vice versa..). --&gt; download the Windows executable if you really want to try it in French :)</em></p><p>Update after the deadline:</p><p><strong>- Fixed</strong><br/>The word <em>Both</em> in the english version that was already displayed but required.</p><p>\n</p><p><strong>- Changed</strong></p>\n<p>Two words are added at the same time, using a bucket (or bean bag) to make sure they are not created at the same position twice.<br/>Falling speed is increasing each time you end a sentence, starting at a very lower rate.</p>\n<p>-<strong> New</strong></p>\n<p>There's a <em>continue</em> button now when you fail so you can keep going on.</p>\n<p><strong>--- HOW TO PLAY</strong></p>\n<p>Start by selecting the language (french is the original one), then click on \"Play\".</p>\n<p>Find the correct word to enter that fits the sentence displayed in the bottom.</p>\n<p>Do not type too fast, each letter has to be separate from the previous one, but do not type too slowly as you have to type the word before it vanishes!</p>\n<p>There are XX sentences to enter before getting the success screen (you didn't think I was going to give that intel so easily, right?), each mistake takes you to the start of the word, and if you lose a word, you'll have to restart from the beginning. With some training you should be able to reach the end. If not, I may upload a full playthrough in the next days.</p>\n<p><strong>--- HOW IT WENT</strong></p>\n<p>We started by writing our ideas on the friday evening, it lasted only 10 minutes as the kids were exhausted after their school week.</p>\n<p>After a good meal and some rests, we started on the two main ideas we had, my daughter and my wife began to dig some sentences from her books while I started coding the game with my son. It lasted 1 hour and the kids went to bed afterward.</p>\n<p>We had no time on the saturday as it was shiny so we were outside the whole day.</p>\n<p>Sunday after lunch, my wife and daughter started to draw using a drawing lesson book we had: all the animals are painted by my daughter! During the same time, we almost finished the game with my son. It lasted around 1 hour and 15 minutes.</p>\n<p>Then we went out again and ended the game after dinner on Sunday evening, to include music gather from https://incompetech.filmmusic.io/ and integrate the painting that were dry now. Around 30 minutes before going to bed, so that makes <strong>2 hours and 55 minutes</strong>, then I added around 30 minutes to include translation, writing this text and take some pictures to post the game here. Then another 15 minutes to check that only the standard US keyboard layout is supported on WebGL by Unity, so I'll see if we can have a workaround later --&gt; 3h40 for the whole process.</p>\n<p>I hope you will enjoy it as much as we enjoyed doing it! It was really fun and I think we will do a trijam another time as everyone loved it.</p>\n<p>--- WHAT WE WANTED TO DO</p>\n<p>My wife and daughter painted some others assets I had no time to include in the game. I will include them in a new release that will not count in the game jam. We wanted the trees and animals to move.</p>\n<p>Next jam, we want to make the music ourselves and I will use a visual coding tool so my son can participate more: he created a few games using Scratch but I'm not used to it and felt more comfortable with Unity.</p>", "metacritic": null, "released": "2020-11-09", "tba": false, "updated": "2020-11-13T07:06:47", "background_image": "https://media.rawg.io/media/screenshots/6ab/6ab16f8abf1e9331bbdaaeb769f16fbd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 48, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["FredericRP"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}