{"id": 518599, "slug": "dragon-ball-z-dokkan-battle", "name": "Dragon Ball Z: Dokkan Battle", "name_original": "Dragon Ball Z: Dokkan Battle", "description": "<p>Dragon Ball Z: Dokkan Battle is a free-to-play mobile game based on the Dragon Ball anime franchise. Developed by Akatsuki and published by Bandai Namco Entertainment, it was released in Japan for Android on January 30, 2015 and for iOS on February 19, 2015. Dokkan Battle was eventually released worldwide for iOS and Android on July 16, 2015. The game has exceeded 300 million downloads worldwide, and has grossed over $2 billion in worldwide revenue. The game includes elements of board game, collectible card game, and puzzle genres. The main game is made up of levels that work similarly to board games, with spots dedicated to items, power-ups, traps, and fights. During the fights, the player&#39;s characters fight with an enemy via a puzzle system similar to match-3 games. Multiple orbs of different colors are placed between the player&#39;s character and the enemy, and the player can match different kind of orbs to do attacks or use other abilities. After a certain amount of orb matches, the player unlocks &quot;Dokkan Mode&quot; for one of their characters, which requires them to tap 7 targets in a Z-shaped configuration as a ki orb passes over them. This allows that character to unleash a super attack that is much more powerful than the typical super attack. The characters with which to fight in game are unlocked via either in-game items or in-app purchases.</p>", "metacritic": 71, "released": "2015-01-30", "tba": false, "updated": "2024-02-02T18:22:07", "background_image": "https://media.rawg.io/media/screenshots/405/405d7b5e7665e95d45177d5be081ff2e.jpg", "website": "https://dbz-dokkan.bngames.net", "rating": 4.0, "rating_top": 5, "added_by_status": {"owned": 7, "beaten": 3, "toplay": 1, "dropped": 5, "playing": 4}, "playtime": 0, "achievements_count": 0, "ratings_count": 8, "suggestions_count": 311, "game_series_count": 56, "reviews_count": 8, "platforms": ["iOS", "Android"], "developers": ["Akatsuki"], "genres": ["Action", "Puzzle"], "publishers": ["Bandai Namco Entertainment"], "esrb_rating": "Everyone 10+"}