{"id": 51856, "slug": "heat-guardian", "name": "Heat Guardian", "name_original": "Heat Guardian", "description": "Heat Guardian - is a hardcore top-down shooter with survival, horror and stealth elements in the cold post-apocalyptic world<br/>\r\nThe Cold killed most forms of life on earth. Civilization is destroyed. Survivors have to fight for their lives, environment is hostile, resources are limited and aggressive mutants are all around.<br/>\r\nYour goal is to survive and find the legendary vault. A normal life might be behind its walls.<br/>\n<br/>\r\nStoryline.<br/>\r\nSingle player campaign consists of 40 levels. The road to the vault is long. You will meet interesting characters, dangerous enemies. You will visit frozen lakes and murky catacombs.<br/>\n<br/>\r\nRecognizable setting.<br/>\r\nEverlasting winter after the Apocalypse that killed most people. The story takes place in an alternative future on open spaces of undetermined CIS country.<br/>\n<br/>\r\nHardcore.<br/>\r\nYou cannot run for too long in the cold. The number of enemies is vast and the number of bullets is scarce. What to do? Die time after time, sharpen your shooting skills and reaction speed.<br/>\n<br/>\r\nCold’s mechanics.<br/>\r\nCold makes the game more hardcore. It is dangerous to be outside for too long: the hero freezes, loses health and stops running.<br/>\n<br/>\r\nImpressive arsenal.<br/>\r\nMore than 50 real weapons to suit all tastes. Pistols, rifles, shotguns. Choose what you like.", "metacritic": null, "released": "2018-05-10", "tba": false, "updated": "2023-02-01T13:37:28", "background_image": "https://media.rawg.io/media/games/98c/98c40347ba6d3b1d6fd3b5b626481e0c.png", "website": "http://heatguardiangame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 43, "toplay": 1, "dropped": 2}, "playtime": 3, "achievements_count": 30, "ratings_count": 3, "suggestions_count": 146, "game_series_count": 0, "reviews_count": 4, "platforms": ["PC"], "developers": ["Denis Rudoy"], "genres": ["Action", "Indie"], "publishers": ["Denis Rudoy"], "esrb_rating": null}