{"id": 518522, "slug": "balloon-hi-demo", "name": "Balloon Hi Demo", "name_original": "Balloon Hi Demo", "description": "<p>Balloon Hi is a short 3D casual arcade physics game inspired by pilot wings and mini golf.</p>\n<p>Guide your balloon from take off to the landing zone,<br/>playing over 6 beautiful world maps with 50 challenging levels,<br/>in a relaxing... but occasionally frantic hot air balloon game.<br/>Release coming in 2021 to PC / MAC / Android / IOS.<br/></p>\n<p>The Alpha demo is ready for release and I hope you will download and enjoy this peek at a short game.  The levels are short and the whole demo can be enjoyed in 10 - 15 minutes. </p>\n<p>It is still work in progress.. and there may be a few bugs.. but i cant find anything game breaking as yet.  you may find yourself drifting.. with no wind around to guide you..  this will end up with you running out of fuel or dipping in the ocean.. don't see this as a failure.. there is no penalty  just restart.  at level 3 I've introduced a gust mechanic which address's this issue and kind of breaks the game if you get enough of them.</p>\n<p>so the whole things still getting balanced. but I've had fun making it and the music. and i hope to finish the full 6 maps and 50 levels  in 3  months. and ill release it at 2.99 or something.    </p>\n<p>any constructive criticism or feedback is very welcome, thank you for taking the time to read this and  hopefully play the demo. </p>", "metacritic": null, "released": "2020-11-09", "tba": false, "updated": "2020-11-13T07:18:48", "background_image": "https://media.rawg.io/media/screenshots/ec0/ec06675288632551f782551911279d70.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 110, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Robin"], "genres": ["Action"], "publishers": [], "esrb_rating": null}