{"id": 518695, "slug": "ukiyo-e-woodblock-printing", "name": "Ukiyo-e Woodblock Printing", "name_original": "Ukiyo-e Woodblock Printing", "description": "<p>References</p>\n<p><strong>Future Development: </strong><br/></p>\n<ul><li>Implement a less buggy drag &amp; drop feature </li><li>Sound effects </li><li>Analysis/no analysis path </li><li>Full self mode path </li><li>Replace beeping sound</li><li>settings</li></ul>\n\n<p><strong>Full Transcript: </strong></p>\n\n<p>Welcome to a virtual printmaking experience! We will be printing a rendition of Beautiful Woman, designed by Kaigetsudo Dohan</p>\n<p>This piece will be printed in the style of Ukiyo-e, a popular art genre during the Edo period that meant, “floating world”. </p>\n<p>Let's Begin</p>\n<p>Did you know that most prints from this era were not made by one person? </p>\n<p>There was often an artist, who created the drawing, then a carver, and finally a printer.</p>\n<p>This is the block used for printing. The blocks were made out of aged cherry wood. </p>\n<p>Each color has a separate block. First, we'll print the key block, which is the line art of the piece.</p>\n<p>Select the brush and drag it to the key block. </p>\n<p>Usually, you only need a little bit of paint for a print.</p>\n<p>Now you have to add white paste to control and protect the colors</p>\n<p>Next, use a brush made out of horsehair to fully apply the ink throughout the woodblock.</p>\n<p>Now place the paper over the wooden block being careful to line it up with the edges</p>\n<p>Next, you use a baren to imprint the ink into the paper. </p>\n<p>A baren is a flat pad usually made of bamboo sheath. </p>\n<p>Now that the key block is printed, it is much easier to view the drawing. </p>\n<p>After viewing examples of Ukiyo-e art, you might notice a trend in the art style. </p>\n<p>The woman depicted in this print was not printed as her individual person, but rather with the ideal features of women during the Edo period.</p>\n<p>Art during the Ukiyo-e period reflected the ideas and virtues desired of women during the Edo Period. </p>\n<p>Next up we will print the white colors. When printing, always print the lightest colors first. </p>\n<p>Each color requires a separate block. </p>\n<p>Now just repeat the process with the white color, the paste, brushing, and imprinting. </p>\n<p>A well known East Asian beauty standard in the present day is having pale skin. </p>\n<p>This standard had originated many centuries ago when white skin were signs of youthfulness because skin pigmentation was one of the first signs of aging.</p>\n<p>Portraits of women and men during this era had pale white skin, oftentimes printed whiter than the paper. </p>\n<p>Since each piece was able to be printed many times, ordinary people were able to afford woodblock prints.</p>\n<p>Ukiyo-e art perpetuated this beauty standard because of its widespread popularity and influence. </p>\n<p>Would you like to complete the print yourself or have it completed for you? (Beta mode - other path not implemented yet) </p>\n<p>Although pale skin was a beauty standard that has carried into the present, many of the beauty standards from today are different from those during the Edo Period. </p>\n<p>These standards can be found in Ukiyo-e prints, such as having relatively small almond-shaped eyes slanting upwards. </p>\n<p>Despite slanted almond-eyes becoming a trend in the beauty industry in America, in East Asia, larger eyes with double eyelids are currently desired for a cuter and more innocent look.</p>\n<p>Also, small noses were not trending during the Edo period. Compared to the stylistic choices of manga art, the art style used in animes, noses were printed much larger than the current trending art style.</p>\n<p>During this era, beauty was not seen as important as a woman's manners. </p>\n<p>Not only were women taught by societal Confucian ideas to behave as a submissive housewife who obeyed men at all times, but these ideals were also enforced by the art. </p>\n<p>Ordinary people such as young women and children, who were usually restricted from education were able to access these prints and the messages that came along with it. </p>\n<p>Woodblock prints in the style of Ukiyo-e were very beautiful and made the world seem more consummate than it actually was. </p>\n<p>While some may argue that the prints were just art and they did not perpetrate any of the standards previously explained, there are always implications behind the art. </p>\n<p>The person fabricating the prints would have been influenced by their surroundings and what society taught them. </p>\n<p>Their view of the world would shape the art they are creating, which would then be absorbed by the viewers. </p>\n<p>Ukiyo-e centered around a perfect, hedonistic world. However, this world suppressed the voices of Japanese women and objectified them. </p>\n<p>The impact of art on society is very profound because it can educate people visually. Ukiyo-e art spread the message of a patriarchy and the roles of women through their depictions of them.   </p>", "metacritic": null, "released": "2020-11-16", "tba": false, "updated": "2020-11-16T02:51:07", "background_image": "https://media.rawg.io/media/screenshots/d61/d610f5277f74dd6a05bb473d74f8a007.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 14, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["artalogica"], "genres": ["Simulation", "Educational"], "publishers": [], "esrb_rating": null}