{"id": 518676, "slug": "chess-prime-pro", "name": "Chess Prime Pro", "name_original": "Chess Prime Pro", "description": "- Importance of chess -<br/>Chess is one of the ancient games in the world. Chess has become so increasingly popular that there was a time when chess was considered \"Royal Game\", but is now a common source of entertainment for a common man. In many parts of the world (in schools) chess has been introduced as major part of the curriculum, because chess increases the mathematical and scientific skills of the students. Chess also increases the problem solving skills, a sense of confidence, a self-worth and the communication skills.<br/><br/>••• Why Chess Prime? •••<br/>Chess Prime is one of the best designed chess games for the iPad / iPhone. It provides learning support for novice players, a real challenge for the experienced players and fun.<br/><br/>Chess Prime supports both ‘one player’ and ‘two player’ game play, so you can play against your friends or against a challenging computer opponent.<br/><br/>You can even start your game from any position that allows you to test your skills in different game phases, common positions, solve chess puzzles, etc. Also you can save your game and then re-load it anytime you want.<br/><br/>If you are novice player you may take advantage of the feature that shows all legal moves for current piece.<br/><br/>-The full list of features:-<br/>• Excellent graphics, sound effects and music<br/>• Configurable player names<br/>• Great AI engine with a flexible difficulty level that suits both novice players and experts<br/>• Versatile openings:  Chess Prime AI engine plays like a human, not as a computer that always chooses the same move at the same position. It gives you opportunity to play different famous openings to gain extensive experience in chess. This feature is activated automatically in the game with high difficulty level.<br/>• SETUP game: Start the game from any desirable position with any number of pieces<br/>• UNDO function if you accidentally hit wrong piece or square. It works even if your king is checkmated.<br/>• REDO function if you missed the opponent’s move. Just press EYE button and Chess Prime will show you the last opponent’s move.<br/>• SAVE / LOAD feature gives you an opportunity to finish the game later or to play the chess puzzle which you can setup in the “Setup Game” module.<br/>• Option to show the LEGAL MOVES for current piece (very useful for novice players)<br/>• Option to ROTATE the board in ‘two player’ mode.<br/>• Option to limit ‘think time’ in ‘one player’ mode to 5, 15 or 30 seconds<br/>• Option to switch on / off sound effects and / or music<br/>• Automatically saves the current state of the game, so the game state would be automatically restored if you quit the application<br/>• Universal app (supports iPad / iPod touch / iPhone)<br/><br/>Enjoy!", "metacritic": null, "released": "2013-05-29", "tba": false, "updated": "2020-11-16T02:43:58", "background_image": "https://media.rawg.io/media/screenshots/648/6484109120e9ed3ca3df9e52287e43bf.jpg", "website": "http://vintagames.weebly.com/chess-prime.html", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Vinta Games"], "genres": ["Strategy", "Board Games", "Educational"], "publishers": ["Anton Vinokurov"], "esrb_rating": "Everyone 10+"}