{"id": 518652, "slug": "this-is-my-dungeon", "name": "This is My Dungeon", "name_original": "This is My Dungeon", "description": "\"This Is My Dungeon\" is a side-view real-time tower defense game with a dungeon management element.<br/> Adventurers will invade your dungeon, targeting the dungeon core in the deepest part of dungeon.<br/> If the adventurers reach the deepest part of your dungeon and destroy the dungeon core, you lose.<br/> You must kill all adventurers to prevent them from conquering the dungeon.<br/>  Give good commands to the your monsters and fight off the invading adventurers.<h3>Manage the dungeon</h3> \"This Is My Dungeon\" 's dungeon has a total of five sections, with each section consisting of several connected rooms of various sizes.<br/> Initially, the dungeon core is located close to the ground in smaller sections.<br/> As the game progresses, the section will be expanded and the dungeon core will be placed in a deeper section.<br/> However, as you expand, the number of adventurers who will attack you will also increase.<br/> You can choose the section you want to expand from the choices randomly shown in each game.<br/> Create your own dungeon through trial and error!<h3>Place the monsters in the dungeon!</h3> You can place monsters with unique skills in dungeons.<br/> Monsters can move freely in their placed section, but they cannot move across the section.<br/> Consider the shape of the section and the skills of the monsters when placing them.<h3>Command the monsters to fight the adventurers!</h3> When the adventurers start to invade, you can command the monsters to move.<br/> The monsters will attack the adventurers in the same room, so give them the benefit of the doubt.<br/>  If a monster is dead, it will respawn after a certain amount of time.<br/> So let the monsters fight the adventurers more and more.<br/><br/>Game Graphic<br/>  COM Kichi<br/>  Jigoku Kaba<br/>  Game-icons .net", "metacritic": null, "released": "2020-11-14", "tba": false, "updated": "2020-11-16T02:32:07", "background_image": "https://media.rawg.io/media/screenshots/62c/62cb4794fe9c520e6b8a88803e150a1a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 222, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Amagumo Horn"], "genres": ["Strategy", "Simulation", "Casual", "Indie"], "publishers": ["Amagumo Horn"], "esrb_rating": null}