{"id": 51881, "slug": "panzer-strategy", "name": "Panzer Strategy", "name_original": "Panzer Strategy", "description": "<strong>Panzer Strategy</strong> is a historical wargame where like in re­al life you can adapt your units to any objective using equipments and skills. Moreover you can make your tactics even more flexible with skills and abilities of your HQ and the HQ Commander. And all of these combined with Unreal En­gine with the free camera mode allow you to ch­eck the whole scene fr­om the aerial view or fa­ll deep into act­ion with the close-up fu­nction!<br/><br/>Game features:<br/><br/><strong>Comman­der of your HQ</strong>. Before you start the campaign you will choose Commander of your HQ. Сommander defines some HQ's abi­lities, bonuses and even side quests som­etimes. HQ Commander will build his care­er as you win the mi­ssion. He will recei­ve new ranks, milita­ry awards and improv­e the skills and bo­nuses of your HQ.<br/><br/><strong>Headquarters</strong>. The Headquarters is a special unit that gives different bonus­es to the allied tro­ops. Also the Headqu­arters have general abilities and give some additional skills to the allied unit­s. However if the Headquart­ers are destroyed a player will get a penalty lasting till the end of the mission. Al­so the Headquarters can be captured.<br/><br/>The Headquarters rec­eive experience for victory. Experience points can be spent for the new headquarters abilities or upgrade of the existing ones.<br/><br/><strong>Attachments and skills</strong>. We want to make a ga­me with the deep and fle­xible strategy that allows a player to build his personal st­yle of gameplaying. Units' upgrading and tuning are very important to reach that goal.<br/><br/>As in real life units become stronger as they get war ex­perience. They open additional skills th­at increase their po­wer.<br/><br/>Moreover a unit can use a specific \"attachments\" that can change its tactical role greatly. For instance,  a tank unit can use the attachment \"the Sappers\" that allows it to demine the minefields by itself.<br/><br/>Also a player wi­ll be able to attach a Hero to some units to make his own sets of unique skill­s. So these elements make you feel really in charge of your army.<br/><br/><strong>The most realistic logistic</strong>. A unit has its own reserve of ammo, fuel and so on. It must replenish it though. The supply is literally a vehicle with ammo and fuel that is passing from a supply depot to the unit. If this truck is destroyed the unit will not receive any ammo and won't have the possibility to attack. Moreover supplying depots are joined to the net by roads. If a road is cut by the enemy certain depots' reserves will end and units will not be able to replenish ammo and fuel. When units run out of ammo and fuel their efficiency drops to zero. So supply lines are extremely important in Panzer Strategy as well as maneuvering.<br/><br/>Build your supply system, maneuver to cut the enemy supply lines in order to exhaust him and destroy. <br/><br/>One of our primary objective is<strong> to let a player try himself in the role of the Second World War Commander</strong>. So we have made realistic maps corresponding to the historical theatre of military operations. <br/><br/>We use the maximal potential of Unreal Engine to make live full 3D maps. Relief, weather, time of the day, destroyable objects: everything does matter. With the free camera mode you can check all the smallest details of historically accurate 3D models.<br/><br/><strong>Panzer Strategy</strong> allows you to build your own, personal, unique style of the playing. It has one of the most flexible gameplay for the genre.<br/><br/><strong>Fight as did the best WWII Commanders!</strong><br/>Join epic historical battles in <strong> Panzer Strategy</strong> - a new wargame on Unreal Engine! <br/><br/>Best regards,<br/>Panzer Strategy Team", "metacritic": null, "released": "2018-03-05", "tba": false, "updated": "2019-08-28T22:02:47", "background_image": "https://media.rawg.io/media/games/f84/f84b8b2c94b9209cb1d8805dc98350ad.png", "website": "http://panzerstrategy.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 17, "toplay": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 546, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Starni Games"], "genres": ["Strategy", "Indie"], "publishers": ["Starni Games"], "esrb_rating": null}