{"id": 518951, "slug": "dungeon-tiles", "name": "Dungeon Tiles", "name_original": "Dungeon Tiles", "description": "<p>Have you ever wondered what would be a mix between a dongeon crawler, regular card game and a procedural game ? Meet dongeon tiles. You play on a dongeon crawling map that YOU make, by placing severals cards on a table. The goal ? Touch\"le lampadaire\", a floor lamp on the tiles top-right.</p>\n<p>\n</p>\n<p>(sry for our bad english, we are French)\r\n</p>\n\n<p><strong>“Dungeon Tiles” is a mix between a card game and a dungeon scroller. In this game, you have to create your pathway to the exit, trying to escape from skeletons and to find treasures. You build your dungeon by placing cards, and then, let’s fight!<br/>Rules : - to move a card, simply drag and drop it into a place holder.<br/>- to rotate a card, use “right-click”, or use “Q” and “D” keys.<br/>-to move, use the “WASD” keys.<br/>-to attack, use “left-click”, or use “Ctrl” key.<br/>(Coded by Elouan TOULLEC, Charles DUVAL, Aubin SAUNIER)</strong></p>\n\n<strong>\n<p>\"Dungeon Tiles\" est un mélange de jeu de carte et de dungeon scroller. Dans ce jeu, vous devrez créer votre voie vers la sortie, en assayant d’échapper aux squelettes et de trouver des coffres. Vous devrez fabriquer votre donjon en plaçant des cartes, et ensuite, à l’attaque !<br/>Règles :<br/>- pour bouger une carte, un simple \"glisser-déposer » dans un emplacement.<br/>- pour tourner une carte, utilisez \"clic-droit\", ou utilisez les touches \"Q\" et \"D\".<br/>- pour bouger, utilisez les touches \"WASD\".<br/>- pour attaquer, utilisez \"clic-droit\", ou utilisez la touche \"Ctrl\".<br/>(Codé par Elouan TOULLEC, Charles DUVAL, Aubin SAUNIER)</p>\n</strong>\n\n<p>\n</p>", "metacritic": null, "released": "2020-11-15", "tba": false, "updated": "2020-11-16T03:43:44", "background_image": "https://media.rawg.io/media/screenshots/4fb/4fb3080e1ad38b64a7b100c84d9fdfac.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 30, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Lelou1"], "genres": [], "publishers": [], "esrb_rating": null}