{"id": 51892, "slug": "e-depth-angel-pinocchio-murder", "name": "Edepth Angel: Pinocchio's Murder", "name_original": "Edepth Angel: Pinocchio's Murder", "description": "Summary:<br/>Which memory is true, which is false? Angel must sort out the implanted memories and true memories in her friends Lien and Kolei in order to rescue them from the grasp of their controlling father Seon, who wants to turn them into puppets to become pure weapons of mass destruction.<br/><br/>THE GAME<br/>There will be three romance options: Choose between Lien, Kolei, and Seon’s mysteries to solve and resolve for expanded content. Additional funding may open up additional routes.GAME ELEMENTS:<br/>Starts with three romance options (more options if stretch goals are met) <br/>Mystery aspect: investigate and collect evidence of true/false memories.<br/>Presenting the case not to a judge but to a character according to their beliefs and personalities, you need to lay out the evidence in a timeline, if matched you get a good ending, if not matched you get a bitter/sweet ending but with another evidence to keep playing.<br/>You can end up helping the enemy to take over the world if you choose.<br/>Options to pair characters up, there’s romance element Friendship endings will become available once funding reached stretch goals.<br/><br/><br/>*Based on E-Depth Angel <br/>Developer: Altabe Studio<br/>Status: In Production<br/>Release: 2017<br/>Genre: Mystery, Science Fiction, Romance, Choose Your Adventure<br/>Romance options: GXB<br/>Rating: 13+<br/>Engine: Renpy<br/>Specs: 1200x800<br/>Language: English<br/>Platform: PC/Mac<br/>Length: 60k words (6 hours playtime)<br/>Voice Acting: LimitedINTERACTIVE FEATURES: <br/>1. It includes 1 dress up mini game for your support robot, DingDing<br/>2. Collecting evidence after talking to different characters, with drag and drop features into the item box to present the story you piece together to get the desirable endings. <br/>3. 13 Endings in total.CHARACTERS<br/><br/>Angel Love – ||Human/Clone|| The heroine who is a clone of someone from the past.<br/><br/>Angel is a certified nurse for cyborgs and wishes the best for them, including helping her friends Lien and Kolei with their personal issues.<br/><br/>Well meaning and committed, Angel won’t stop until her friends are finally happy.<br/><br/><br/><br/><br/>Lien Lei – ||Cyborg|| CEO of Seon Corp and Angel’s boss who has a famous storm-like temper. He may or may not have feelings for her…<br/><br/>Lien has had a grudge against family members for years which he might take to the grave.<br/><br/><br/><br/><br/>Kolei – ||Cyborg/Bio-Mech|| The younger brother of Lien and quieter of the two.<br/><br/>He hides a lot of secrets and prefers to be very private, acting distant as there is more going on beneath the surface than he likes to let on.<br/><br/>His relationship with Lien is complicated due to their history and half-sibling relation.<br/><br/><br/><br/>Seon Lei – ||Cyborg/”Immortal”|| The brothers’ mysterious and elusive father who is the founder of the major company Seon Corp.,<br/><br/>which has the size and power of a small country. His reasons behind the treatment and mental manipulation of his sons are questionable…<br/><br/>SIDE CHARACTERS<br/><br/><br/>Randy<br/>- A cyborg whose human life was turned upside down thanks to Seon Corp., namely Lien Lei. He is a steadfast friend to Angel and forced lackey of Lien. His hacking ability makes him a valuable ally.<br/><br/><br/><br/><br/>Sharon - ||Human|| Head doctor at Seon Corp, she is a long time employee and Angel's boss when Lien isn't around. Usually calm and collected, she might decide to leave her job due to the insanity that ensues between the Lei family.<br/><br/><br/>Lilian – ||Human/Clone|| A mysterious and beautiful woman with a striking resemblance to Lien’s deceased mother due to being her clone.<br/>What secrets does she know by being at Seon’s side?<br/><br/><br/><br/>DingDing –||Robot/Mini Android||<br/>DingDing is Angel's personal robot assistant and a defacto \"pet\" as well friend; she's customizable in appearance.<br/><br/><br/><br/>Angelica - ||cyborg??|| a cyborg with appearance that closely resembles Angel.<br/>She relays messages for Angel and helps Angel with her work.", "metacritic": null, "released": "2018-01-22", "tba": false, "updated": "2019-08-28T22:02:47", "background_image": "https://media.rawg.io/media/screenshots/6f5/6f5e0d1ab4a080e7d20c76a97d6a1c6d.jpg", "website": "http://altabestudio.com/works/ea-pinocchio/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 35, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 380, "game_series_count": 0, "reviews_count": 1, "platforms": ["macOS", "Linux", "PC"], "developers": ["Altabestudio"], "genres": ["RPG", "Casual", "Indie"], "publishers": ["Altabestudio"], "esrb_rating": null}