{"id": 5192, "slug": "oddworld-abes-exoddus", "name": "Oddworld: Abe's Exoddus", "name_original": "Oddworld: Abe's Exoddus", "description": "<p>Oddworld: Abe&#39;s Exoddus is a spin-off installment of the Oddworld game series. It is a direct sequel to the Oddworld: Abe&#39;s Oddysee.</p>\n<h3>Setting</h3>\n<p>The game is set in the Oddworld, a planet in another dimension, ten times larger than our Earth. Among its inhabitants, there&#39;s the race of Mudokons, a species of spiritual humanoids who can control others&#39; minds. Many Mudokons serve as the slaves to their more technically advanced enemies, Glukons. The protagonist is Abe, a blue-skinned Mudokon who escaped slavery and freed many of his compatriots.</p>\n<h3>Plot</h3>\n<p>The game begins right after the ending of Oddworld: Abe&#39;s Oddysee. Abe learns that the evil Glukons use Mudokons as slaves in the Necrum Mines. The protagonist sets off on a quest to liberate the slaves. There, he discovers that Glukons&#39; popular drink called Soulstorm Brew is brewed from the bones and tears of the enslaved Mudokons. Abe&#39;s goal is to destroy the Soulstorm Brewery and to set his people free. The ending depends on the number of Mudokons the player saved.</p>\n<h3>Gameplay</h3>\n<p>Oddworld combines platforming with puzzles. Its levels consist of sections that occupy one screen each and require the player to overcome puzzles to move on. Abe cannot fight his enemies, but he can use his spiritual powers to defeat them, save Mudokons and advance through the levels. Abe&#39;s abilities include mind control, interacting with fellow Mudokons and limited telekinesis. To save Mudokons, Abe has to comfort them if they&#39;re angry or depressed. If he doesn&#39;t, they can harm others or themselves.</p>", "metacritic": null, "released": "1998-11-17", "tba": false, "updated": "2024-04-02T15:47:31", "background_image": "https://media.rawg.io/media/screenshots/ba5/ba5f0dd05f44cc48c918683764e3a125.jpg", "website": "http://www.oddworld.com/?p=79", "rating": 4.09, "rating_top": 4, "added_by_status": {"yet": 119, "owned": 1198, "beaten": 100, "toplay": 25, "dropped": 75, "playing": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 143, "suggestions_count": 678, "game_series_count": 8, "reviews_count": 144, "platforms": ["PlayStation", "PC"], "developers": ["Sony Interactive Entertainment", "Oddworld Inhabitants", "Digital Dialect"], "genres": ["Action", "Adventure", "Platformer"], "publishers": ["GT Interactive Software", "Oddworld Inhabitants"], "esrb_rating": "Teen"}