{"id": 519307, "slug": "turtle-story", "name": "Turtle Story", "name_original": "Turtle Story", "description": "<p>Voici notre jeu pour la Volcano Game Jam 2020!<br/></p>\n<p>Un peu fini en rush certes... Mais encore une fois, on a visé haut (peut être trop)... Mais on pu faire un petit Action-RPG à la Zelda (entre autre), où vous incarnez \"Francky\" une petite tortue qui s'ennuie seule sur son ile... Toutefois, de nouvelles ile apparaissent et elles sont remplies d'oeufs de tortues ! En les récupérant, c'est l'occasion de peupler votre petite ile !</p><p>Nous avons intégralement composé la musiques, les graphismes (ormis la police d'écriture propre à Yoshi Island) et le code (qui est d'ailleurs disponible).</p><p>Nous avons développé le jeu à partir de Ruby / Gosu / OpenGL (pour la 3D) et une librairie faite maison par nos soins.<br/></p>\n<p><strong>Contrôles :</strong><br/></p>\n<p>- X pour attaquer à l'épée ou à la hache</p>\n<p>- C pour attaquer avec la magie</p>\n<p>- C pour valider les boites de dialogues\r\n</p>\n<p>- Shift droit ou gauche pour changer d'armes</p>\n<p>- Flèche directionnelle pour se balader</p>\n<p>- Entrer pour valider les menus</p>\n<p>(PS: Les contrôles manette, bien qu'indiquer partiellement dans le jeu n'ont pas plus être implémenté à temps, milles excuses)</p>\n\n\n<p><strong>Notes :</strong><br/></p>\n<p>On souhaitais montrer la population l'ile grandir, mais le temps à eu raison de nous.. Toutefois on a pu :</p>\n<p>- Faire 3 grandes zone explorables</p>\n<p>- Divers monstres à affronter</p>\n<p>- Un système d'expérience</p>\n<p>- Le jeu à été fait en pixel art par nos soins de A à Z (malgré nos capacités limités)</p>\n<p>- Une world map en 3D (à la Yoshi Island)</p>\n<p>- Un tableau pour répértorier vos exploits (oeufs trouvés, photos des dévs + un membre de bouftang bien caché et le niveau de Francky)</p>\n<p>- Les iles apparaissent au fur et a mesure</p>\n<p>- Divers choix d'armes</p>\n<p>- Musiques intégralement faite par nos soins<br/></p>\n<p>Bref vous l'aurez compris, des ambitions plus hautes que ce que le temps impartis nous laissait faire.<br/></p>", "metacritic": null, "released": "2020-11-15", "tba": false, "updated": "2020-11-16T05:17:25", "background_image": "https://media.rawg.io/media/screenshots/21f/21f0bbc030bc96907704453f29ec18ac.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 92, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["HydroGene", "D3nX"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}