{"id": 519474, "slug": "sablier", "name": "Sablier", "name_original": "Sablier", "description": "<p><em>\"Dans un monde constamment proie à l’orage inarrêtable du sable, les survivants de la race humaine ne respirent plus qu’à l’aide de machines, destinés à parcourir le désert sans fin à la recherche d’énergie. Faisant face à cet environnement hostile où animaux et créatures ont émergé, la dernière caravane du peuple errant doit s’en rapporter à la volonté et la détermination sans faille de leur Chasseur, sur lequel repose l’unique espoir de leur survie à tous. Mais qui sait face à quels choix ce même chasseur sera confronté pour la perpétuation de ses semblables</em><br/></p>\n<p><em>Vous êtes ce dernier espoir de perpétuation. Chassez, survivez, et assurez la survie de votre caravane dans une course pour l’énergie, contre le sable, et contre le temps\"</em><br/></p>\n\n<p><strong>Sablier</strong> est un shooter 2D où vous devez combattre et chasser des robots pour amasser des batteries énergétiques.</p>\n<p> Ces batteries vous permettent de survivre, en alimentant la machine qui vous permet de respirer dans cet l'environnement hostile et en améliorant votre équipement de combat. Mais elles doivent également permettent aux membres de votre caravane de survivre. </p>\n<p>Vous devez dès lors choisir comment partager vos ressources avec les derniers survivants de votre espèce ou bien les utiliser pour améliorer vos équipements dans l'espoir de ramener plus d'énergie. </p>", "metacritic": null, "released": "2020-11-15", "tba": false, "updated": "2020-11-16T05:54:14", "background_image": "https://media.rawg.io/media/screenshots/9f2/9f20c5650b26a134287679993acb60f0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 31, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ThrowbackDev", "RomainBecht", "Guillaume Houard", "VSteph"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}