{"id": 519587, "slug": "battle-tactics", "name": "Battle Tactics", "name_original": "Battle Tactics", "description": "<p>An early concept prototype for a tactical puzzle game. It's pretty minimal for now, with just the core mechanic and a single level.<br/>               <br/>       </p>\n<p>\"Unhappy is the fate of one who tries to win his battles and succeed in attacks<br/>without cultivating the spirit of tactical thinking.\"<br/><em>The Art of War</em></p>\n<p>An early concept prototype for a tactical puzzle game based on two previous game jam prototypes, Grim Tactics and Arctic Slide.</p>\n<p>It's pretty minimal for now, with just the core mechanic and a single level. There is almost no audio or GUI, but hopefully it's enough to get some community feedback on whether this has any potential to be developed further.</p>\r\nConcept\r\n<p>Eliminate all enemy units on each level in a fixed number of moves.</p>\r\nHow To Play\r\n<p>Move the warrior units (wizards and knights, for now) so that each warrior kills one enemy unit (skeleton soldier).  Each warrior will start out with an assigned number of spaces it can move on each turn. The number of spaces a warrior can move will be reduced by one after every turn. A warrior must kill an enemy before running out of moves. A warrior can only kill a enemy if the move ends exactly on the tile the enemy is on. </p>\n\r\nControls\r\n<p>Drag (Left Mouse Button)           Rotate view .<br/>Click (Left Mouse Button)           Select warrior unit OR tile to move selected warrior to.</p>", "metacritic": null, "released": "2020-11-15", "tba": false, "updated": "2020-11-16T06:17:48", "background_image": "https://media.rawg.io/media/screenshots/31b/31b6f177f8025c774780bf1b231370ad.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 36, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Itizso"], "genres": ["Strategy", "Puzzle"], "publishers": [], "esrb_rating": null}