{"id": 519733, "slug": "the-wiki-how-game", "name": "the Wiki How game", "name_original": "the Wiki How game", "description": "Welcome!\r\n<p>The Wiki How game is a crazy guess-the-title party.  Emphasis on the party.</p>\n<p>You, along with (ideally) 3+ friends, will be provided with images from wiki how articles at complete random and with zero context.  It is your job to divine the original article's name using nothing more than the picture.  The true article title is mixed in with your friends' guesses and you must try and find it.<br/><br/>Whether you're trying hard or hardly trying you will have a laugh, have fun!</p>\n<p>-------------------------</p>\n\r\nHow To Play\r\n<p>The Wiki How game is split into 4 main phases</p>\n<p><strong>1: Guess</strong><br/>    Take a good look at the provided picture and give your best effort to name the title of the article. You will be given 1 point for each vote your title is given in the next phase.</p>\n<p><strong>2: Vote</strong><br/>    You will be provided a list of the other player's guesses with the actual title slipped in. You will not be able to see your own guesses on this screen, don't worry!<br/>    You are given 2 votes. You don't need to spend them both, but you can vote for the same thing twice!</p>\n<p><strong>3: Scoring</strong><br/>    On the scoring screen, the guesses will have their owners revealed and the number of votes each received.<br/>    If you voted for the actual title, you will recieve a point. If you voted for another player's title, they will earn a point.</p>\n<p><strong>4: Results</strong><br/>    You get to see how many points each player has and a link to the real title will be provided.<br/>    If a player has breached the score threshold, they will be declared the winner!<br/>    In the event multiple players break the score threshold on the same round, the player with more points will win. If multiple players are tied for most points, the winner is chosen at random.</p>", "metacritic": null, "released": "2020-11-14", "tba": false, "updated": "2020-11-16T06:51:03", "background_image": "https://media.rawg.io/media/screenshots/0de/0decfe1335485df006436a6e899b6997.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 3, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["alphazeba"], "genres": [], "publishers": [], "esrb_rating": null}