{"id": 519991, "slug": "redhooks-revenge-ii-call-of-booty", "name": "Redhook's Revenge II: Call of Booty", "name_original": "Redhook's Revenge II: Call of Booty", "description": "<p>Specular Realms, in conjunction with ImagiSOFT, presents the newest in naval edutainment software, Redhook’s Revenge II: Call of Booty. Now, the sequel is back with a revamped musical score and over 10,000 general knowledge trivia questions. With photorealistic graphics that are so immersive, you’ll swear you can feel the sting of the salt in the air as you sail the high seas.</p>\n<p>Choose from one of five pixelated profiles rendered in stunning 256 color graphics and take to the sea as you plunder Spanish galleons, loot port cities, and wage war on your fellow corsairs. Naval battles take place using a turn-based dice system in the style of Risk, just like in real life!<br/></p>\n\n<p>With over hundreds of hours of quality entertainment that’s wholesome fun for the entire family, take your maritime trivia-based board game interactive simulation to the next level with Redhook’s Revenge II. It’s meaner than the son o’ a double Dutchman!\r\n  </p>\n<p>PSea Gamer writes<em> “This is the only nautically themed interactive trivia board game for the PC that you’ll ever need!”</em><br/></p>\n<p>Davy Jones gives it <em>“Two hooks up!”</em>\n</p>\n<p>So what are you waiting for cap’n? Don your classiest eye patch and saltiest parrot and set sail!</p>", "metacritic": null, "released": "2020-11-13", "tba": false, "updated": "2020-11-16T07:50:03", "background_image": "https://media.rawg.io/media/screenshots/02a/02af693695d3f4d8594ed0f94eddd96d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 56, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Specular Realms"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}