{"id": 519965, "slug": "citadel-2-working-title", "name": "Citadel 2 (working title)", "name_original": "Citadel 2 (working title)", "description": "<p>Work in progress. The name will change I expect.<br/><br/></p>\n<p>I've decided to write a sequel inspired by the original Citadel created by Martin Walker. I spoke to Mr. Walker a while ago and asked him for his blessing to do a game inspired by the original and he said OK! Way back in 1992 I had attempted this kind of project (See http://www.gamesthatwerent.com/gtw64/citadel-2/ ) but this time I want to really do it properly. This time around I will be writing most of the code first and using placeholder graphics, music and SFX. This means the initial demos will be technical demos designed to show working code first. Only when I'm sure the game code is mostly complete will I start adding the graphics/sound and doing game balancing and polish.</p>\n\n\r\nTitle screen\r\n<p>Press down on the joystick to choose between Aracade or Strategy. By default Arcade mode is selected. Press left/right/up to choose between SFX/SFX+Music/Music.</p>\n<p>Arcade mode</p>\n<p>The player moves around the map with eight-way control not aligned to the map blocks. Pickups are automatically added instead of waiting to be installed by accessing a terminal.</p>\n<p>Strategy mode</p>\n<p>The player moves around the map aligned to the map blocks and with four-way movement. Pickups are stored in the inventory and can be installed when accessing a terminal. A terminal sub-game needs to be completed before an inventory item is installed or door is activated.</p>\n<p>Computer terminals and switches</p>\n<p>To access a computer terminal in a wall, stop the player, hold down fire while pushing the joystick in the direction of the terminal until the screen changes. A switch in a wall looks a bit like a computer terminal, using it is the same as a computer terminal except that it will just toggle its associated door.</p>\n<p>In Arcade mode</p>\r\n\r\nTerminals are like switches, there is no sub-game.\r\n\r\n<p>In Strategy mode</p>\r\n\r\nThe first default option for the terminal sub-game is: Exit back to the game.\r\nThe next option is: Open/close (toggle) the associated door.\r\nThe next options are any collected powerups.\r\nChoose the option with left/right and use fire to select it. The sub-game will start.\r\n\r\n<p>Teleporters</p>\n<p>To use a teleporter stop the player and hold down fire.</p>\n<p>Capturing enemies</p>\n<p>While stationary double click and hold the fire button to activate the capture probe. Move the probe over an enemy to capture it, if you have enough energy to do so. Once captured, the enemy status will be displayed on the status panel.</p>\n<p>It is possible to capture and control up to three enemies at once. The currently active captured enemy will quickly pulse grey, other captured enemies will slowly pulse grey. Cycle through the captured enemies with by pressing the \"space bar\".</p>\n<p>The currently captured enemy can be ordered to do different actions with the function keys:</p>\r\n\r\n* F1 - Orders Stay or continue moving, it toggles the order\r\n* F3 - Follow the player, the point to be followed is two squares along the last direction the player fired.\r\n* F5 - Destroy mode, shoots at other enemies\r\n* F7 - Assimilate, depending on the enemy health and the capture cost an amount of energy is returned to the player and the target is destroyed\r\n\r\n<p>Dropped pickups</p>\r\n\r\n* Flashing weapon pod - Upgrades weapons. Bullet range, rear shot, side shot etc\r\n* CPU icon - Reduce sub-game difficulty\r\n* Battery - Immediate health increase. Also adds up to two batteries above and below energy bar.\r\n            Constantly moving slowly recharges the batteries.\r\n            When health is critically low and you're damaged a battery will immediately discharge and replenish your energy, saving you from destruction.", "metacritic": null, "released": "2020-11-14", "tba": false, "updated": "2020-11-16T07:43:01", "background_image": "https://media.rawg.io/media/screenshots/4ee/4eee1b97f8039748f77194ab5c2c7c50.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Martin Piper"], "genres": ["Action"], "publishers": [], "esrb_rating": null}