{"id": 519901, "slug": "the-legend-of-kai-o", "name": "The Legend of Kai-O", "name_original": "The Legend of Kai-O", "description": "<p>You crash landed on a hostile planet, you need  to survive and find toolkits to repair your ship and escape!<br/><br/>The Game takes place on a mysterious abandoned planet known as Theseus. Theseus is a hot planet surrounded by lava instead of water and has nothing but only Rocky terrain and  Egg shaped plants that don't seem to need water for nourishment. The year is not specified. Robots, treasure, weapons, and A.S.S’s (Atomic Space Stations) have been left behind by  past colonists and miners which the player can interact with in certain ways. It remains a mystery why the past habitants disappeared and left behind Hostile robots, chests, and Light Saws still cutting the terrain. <br/><br/></p><p>Each A.S.S. sells one particular item that can be purchased by bucks. You collect bucks by killing enemies or finding them in chests. Once you purchase the item, it will give  that item instantly to the player with each purchase, if you don't have enough bucks to buy a certain item, you can't buy it.<br/></p><p>You need to explore Theseus and find...  </p>\n<p> ● Strange Egg shaped Plants to eat to heal you.  </p>\n<p>● Ammo and Grenades for your weapons to defend yourself from Robots who were  left behind by Colonists.  </p>\n<p>● Bucks to purchase from A.S.S’s (Atomic space station’s) to purchase leftover  supplies, to increase your chances of survival and tools to repair your spaceship.  </p>\n<p>● You need to find 5 tool kits to repair your ship and escape Theseus.</p>\n<p> </p>", "metacritic": null, "released": "2020-11-14", "tba": false, "updated": "2020-11-16T07:28:53", "background_image": "https://media.rawg.io/media/screenshots/d48/d482345dc6b45d291f89110c4076a0a3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 186, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Adamh5"], "genres": ["Shooter", "Adventure"], "publishers": [], "esrb_rating": null}