{"id": 52006, "slug": "tank-brawl-2", "name": "Tank Brawl 2", "name_original": "Tank Brawl 2", "description": "Tank Brawl 2 is currently in development and will be released around late 2018. Tank Brawl 2 is the sequel to our first published game Tank Brawl. In the first game, we wanted to remake something we loved as kids, the Battle City game on the NES, and give it some modern and personal touch that everyone old and new would enjoy playing.<br/><br/>In Tank Brawl 2, we want to step it up. We want to build a game that will wow player every 5 minutes so that by the time you finish the game, your wow counter of epic moments would not be less than 100.  This will be the best shoot-up tank game of this generation which would be be remembered 30 years from now as THE ONE with many original mechanics that inspired dozens other games. <br/><br/>Below are the list features that we are PLANNING TO have:Free 3 vs 3 Team multiplayer battle.Combine vehicle and driver classes to make hundred different playable classes (Inspired by Titan Quest class system).Drive Jeeps, Tanks, Giant Mechs or the brutal Mobile Rocket Launchers. Each with its own unique game-play mechanics.A campaign with 100 wow moments, we will provide an in game counter of these moments to prove our promise.<br/>- Most impressive and satisfying tank destruction ever.<br/>- Most impressive and satisfying shooting visual ever.<br/>- And more features yet to be revealed.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:02:43", "background_image": "https://media.rawg.io/media/screenshots/431/43133917cf15b8638da99af5aa7476bb.jpg", "website": "http://tankbrawl2.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 12, "ratings_count": 0, "suggestions_count": 406, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Phung Games"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Phung Games"], "esrb_rating": null}