{"id": 52014, "slug": "space-bob-vs-the-replicons", "name": "Space Bob vs. The Replicons", "name_original": "Space Bob vs. The Replicons", "description": "Space Bob vs. The Replicons is a planetary exploration and survival game in the final stages of development for PC (Mac &amp; Linux soon).<br/><br/>Combining hand crafted planets with procedurally generated content for endless replayability, experience elements of survival, platforming, adventure and space exploration while exploring Bob's world with his companion AI.<br/><br/>Armed with a basic blaster, a jet pack, a multi-functional grappling gun, a personal landing craft, and his own warp capable refinery ship, Bob thinks he's about to embark on a cushy new life working for Space Salvage Corp. Little does he know; he'll be lucky to survive an hour. <br/><br/>GameplayExplore dozens of planets, collect resources, salvage what you find to craft upgrades, and fight for your life while trying to uncover the time-bending mysteries of Bob's universe.<br/><br/><br/>Things start out nice and relaxed but rapidly escalate towards a full-on alien invasion with Replicons swarming over every planet. You can choose to play it safe and make a quick escape, through the jump-gate, or explore Bob's world in depth with the ever looming risk of death.<br/><br/>Whether you survive or die, an average play session is designed to take 30-90 minutes. At first you'll die, but soon you'll learn to survive long enough to discover that death is not as permanent as it seems. Dig deeper and you could unlock check-points allowing Bob to save mankind from alien obliteration over multiple play sessions.<br/><br/><br/>TechnologyAlthough the game may initially appear to use traditional 2D sprites, it instead uses polygons. This allows for improved performance and the ability to seamlessly zoom so close that Bob fills the screen or far enough away to view entire planets. Object outlines remain crisp and sharp even at extreme zoom levels.<br/><br/><br/>All objects are physics enabled with precise, complex, and realistic collisions.  You'll need to figure out how to efficiently connect objects together and return them to your refinery ship in orbit, while managing their weight as they swing around the game's environments, while simultaneously trying to survive an alien invasion.", "metacritic": null, "released": "2017-02-03", "tba": false, "updated": "2019-08-28T22:02:43", "background_image": "https://media.rawg.io/media/screenshots/a31/a31bb11fb9dddb5b28eecb6a91a7c1eb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 9}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 153, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Intravenous Software"], "genres": ["Action", "Adventure", "RPG", "Casual", "Indie"], "publishers": ["Independent"], "esrb_rating": null}