{"id": 520106, "slug": "four-sides-of-square", "name": "Four sides of Square", "name_original": "Four sides of Square", "description": "<p>In this game you’ll play as Square, a small, well… square, in which four different emotions live. Each one has their own way of moving, being and interacting with the world that surrounds them.</p>\n<p><strong>Controls:</strong><br/></p><p>- Arrow Keys or WASD: Move</p><p>- Space Bar: Jump and select state in the selection menu</p>\n<p><strong>Team members: </strong><br/>Fuchs, Leandro (programming, music and sound)<br/>Baltar, Nicolás (programming, art and effects)<br/>Álvarez, Mariano (programming)</p>\n<p><strong>Description:</strong><br/>Breeze is so happy that he can even jump once in the air!<br/>Blue is sad and her crying is contagious to enemies, which make them move slower.<br/>Lila is frightful and very cautious. This allows her to see danger clearly, even when the lights are off.<br/>Rage’s wrath prevents him from stopping his momentum. He’s extremely impulsive and will move rapidly until he crashes against something.</p>\n<p>Upon touching an orb, one of our friends will take control of Square. The goal of the game is to overcome all of the obstacles while making use of all of the emotional states that make Square work together. Rage can’t overcome some parts due to his impulsiveness and there’s other obstacles in which Lila is the only way to go.</p>\n<p>As soon as we read the assignment, we discussed different ideas and concepts. We wanted to do it as creatively as we could. The words “personality” and “emotion” came up often and that was when the idea of The Four Sides of Square sprouted up. Breeze, Blue, Lila and Rage are Square, they’re all one. In the same way as us: we have different “versions” of ourselves who seem to take turns controlling us. The game’s title is also a reference to this fact. Square is made up of its four sides and all four sides together make up Square.<br/>The team’s communication was good from the get go, despite the challenges implied in making a game in a week. We enjoyed every part of its development very much. The three of us programmed it together. Nicolás did the art and Leandro the music.<br/>We aim for the player to get immersed in the game’s atmosphere. Each one of our characters has their own theme song and color, as well as some post-processing effects.</p><p>We hope you enjoy the game as much as we enjoyed making it.</p><p>----------------------------------------------------------------------------------------------------------</p>\n<p>En este juego encarnarás a Square, un pequeño cuadrado en el que viven cuatro simpáticas emociones. Cada una de ellas tiene su propia forma de moverse, ver e interactuar con el mundo que la rodea.<br/><br/>Controles:<br/>Flechas de dirección u WASD para moverse, barra espaciadora para saltar y confirmar estado en la selección de estado.<br/><br/>Miembros del equipo:<br/>Fuchs Leandro (Programación, música y sonido)<br/>Baltar Nicolás (Programación, arte y efectos)<br/>Alvarez Mariano (Programación)<br/><br/>Detalle:<br/></p>\n<p>Breeze está tan contento que es capaz de saltar una vez más en el aire</p>\n<p>Blue llora y le contagia su tristeza a los enemigos, que comienzan a moverse más lento.</p>\n<p>Lila es muy miedosa y muy precavida, esto le permite detectar peligros incluso con la luz apagada.</p>\n<p>La ira de Rage le impide frenar en su movimiento, es extremadamente impulsivo, se moverá muy rápidamente hasta chocarse contra algo.</p>\n<p>Al tocar un orbe, uno de nuestros amigos pasará al control de Square. El objetivo del juego es sobrepasar todos los obstáculos haciendo que todas las emociones que conforman a Square trabajen en equipo. Hay partes que Rage no puede sobrepasar por su impulsividad y otras en las que la única que puede sortear los obstáculos es Lila.</p>\n<p>Apenas nos enteramos de la consigna, nos pusimos a debatir distintas ideas y conceptos. Queríamos encararla de la forma más creativa que pudiéramos. Las palabras “personalidad” y “emociones” empezaron a resonar y ahí fue cuando surgió la idea de The four sides of Square. Breeze, Blue, Lila y Rage son Square, todos son uno. Al igual que nosotros tenemos distintas “versiones” de nosotros mismos y pareciera que se van turnando para controlarnos. A esto hace referencia también el título del juego, Square está compuesto por sus cuatro lados. Y todos los lados juntos, son Square.</p>\n<p>En el equipo hubo buena comunicación desde un primer momento, a pesar de los obstáculos que plantea hacer un juego en una semana, disfrutamos mucho cada parte del desarrollo. <br/>Los tres nos encargamos de la programación. Nicolás hizo el arte y Leandro la música.<br/>Buscamos que el jugador se vea inmerso en la atmósfera del juego. Cada uno de nuestros personajes tiene su canción y su color característico, como también algunos efectos de post procesado.</p>\n<p>Esperemos que disfruten el juego tanto como nosotros cuando lo creamos.</p>", "metacritic": null, "released": "2020-11-13", "tba": false, "updated": "2020-11-16T08:17:02", "background_image": "https://media.rawg.io/media/screenshots/6b5/6b52ed8854478dbb94a72215dfef5077.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 46, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["NikoAniki", "leanfuchs-cloud"], "genres": ["Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}