{"id": 520351, "slug": "the-perplexing-orb-2", "name": "The Perplexing Orb 2", "name_original": "The Perplexing Orb 2", "description": "The Perplexing Orb returns! Experience an all new puzzle platforming adventure like none other! Roll, shrink, grow, zip, and jump your way through over 70 all new stages. Experience the classic Perplexing Orb game play with all new twists involving The Perplexing Orb's new character abilities. In this installment the Perplexing Orb has the ability to shrink and grow to solve various puzzles. The Orb can now also ride along and connect to magnets. This creates numerous new types of puzzles and game play challenges.<br/><br/><br/><br/><ul><li> Embark on an all new story mode featuring 75 new levels.<br/></li><li> Try your hand at 4 new optional unlock-able Challenge Levels to really test your skills!<br/></li><li> Customize the Perplexing Orb with additional unlock-able character skins.<br/></li><li> Grab a friend and race to the finish in 4 new multiplayer race maps.<br/></li><li> Go head to head in the arena in this brand new additional multiplayer mode including 4 all new arena stages.</li></ul><h3>All New Worlds and Environments</h3><br/>Embark on a new journey featuring all new levels and challenges.<h3>New Hubworld Map System</h3><br/>Engage in a new story. Explore the map selecting levels, visiting new worlds, unlocking bonus levels and more!<h3>All New Character Abilities</h3><br/>Shrink and Grow to navigate tricky new puzzles. Ride and jump along magnets to traverse new environmental landscapes.<br/><h3>Intense New Challenges. Precision Platforming.</h3><br/>Use all the skills learned throughout the game to conquer platforming obstacle courses like no other! In addition to puzzles based on the new Orb mechanics, you must also learn to overcome environmental puzzle challenges. Falling wooden planks, tilting platforms, button timed challenges, moving and flipping levels await you. Do you have what it takes?!<h3>The Perplexing Orb 2</h3><br/>The classic platforming gameplay is back. Roll your way through this all new adventure.", "metacritic": null, "released": "2020-11-16", "tba": false, "updated": "2023-11-06T15:55:24", "background_image": "https://media.rawg.io/media/screenshots/f8b/f8b2b834ceeb1164848fb7fd4d4f9391.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "dropped": 1}, "playtime": 0, "achievements_count": 28, "ratings_count": 0, "suggestions_count": 190, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "PlayStation 4"], "developers": ["TreeFall Studios L.L.C."], "genres": ["Adventure", "Arcade", "Casual", "Indie", "Puzzle"], "publishers": ["TreeFall Studios L.L.C."], "esrb_rating": null}