{"id": 520359, "slug": "mortal-kombat-11-ultimate", "name": "Mortal Kombat 11 Ultimate", "name_original": "Mortal Kombat 11 Ultimate", "description": "<p>All-new story mode</p>\n<p>Continue the epic saga through a new cinematic story that is more than 25 years in the making. Players will take on the role of a variety of past and present characters in a time-bending new narrative that pits Raiden against Kronika, the Keeper of Time who created existence at the dawn of history.</p>\n<p>All-New Custom Character Variation System</p>\n<p>Offers nearly infinite customisation options, giving players more control and providing a deeper and more personalised experience than ever before. Players can customise their fighters with a variety of Skins, Gear, Special Abilities, Intro and Victory Cinemas, Taunts and Brutalities that can be earned via gameplay.</p>\n<p>New &amp; Returning Fan-Favorite Characters</p>\n<p>Choose from a roster of fighters with unique abilities and Fatalities, with new characters, such as Geras, a powerful and loyal servant of Kronika who can manipulate time, along with fan-favorite characters, including, Baraka, Raiden, Skarlet, Scorpion, Sonya Blade and Sub-Zero and more.</p>\n<p>More Modes, Challenges &amp; Rewards</p>\n<p>Packed to the brim with multiple modes, including the Towers of Time, which builds upon NetherRealms’s past games, allowing players to test their skills through various challenges, providing more ways than ever to continue the Mortal Kombat 11 experience.</p>\n<p>All-New Crushing Blows &amp; Iconic Fatalities</p>\n<p>Showcasing brutal battles like never before with enhanced graphics and animations.</p>", "metacritic": 89, "released": "2020-11-17", "tba": false, "updated": "2024-04-22T08:14:21", "background_image": "https://media.rawg.io/media/screenshots/837/837544531ee999e51a548ecc6fb29804.jpg", "website": "https://www.mortalkombat.com/en-US", "rating": 4.07, "rating_top": 4, "added_by_status": {"yet": 9, "owned": 20, "beaten": 38, "toplay": 14, "dropped": 11, "playing": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 45, "suggestions_count": 729, "game_series_count": 0, "reviews_count": 45, "platforms": ["Xbox One", "PC", "Nintendo Switch", "PlayStation 4", "Xbox Series S/X", "PlayStation 5"], "developers": ["NetherRealm Studios"], "genres": ["Action", "Fighting"], "publishers": ["Warner Bros. Interactive"], "esrb_rating": "Mature"}