{"id": 52036, "slug": "train-crisis", "name": "Train Crisis", "name_original": "Train Crisis", "description": "In this puzzle strategy game, you will have to guide trains with different colours each towards their corresponding destination. Travel through time and discover how trains and railroads looked like in the past –or in the future too! More than 160 levels will test your reflexes in this visually beautiful high-definition game with environments in 3D. Will you be able to make the trains reach their destination safe and sound?<br/><br/><strong>4 eras</strong><br/>You’ll find the following iconic periods of time represented within the game: Industrial Revolution, Far West, the Modern era and the  Future.<br/><br/><strong>Puzzles and trains</strong><br/>Overcome the hurdles that may arise in 168 addictive levels and solve the challenges of this demanding strategy game.<br/><br/><strong>Precious visuals</strong><br/>Designed in full 3D, the game shows attractive high-definition graphics which will please fans of strategy puzzle games and trains alike.<br/><br/><strong>Features</strong><br/><ul><li>168 levels containing challenging puzzles.<br/></li><li>Go over the history of trains in 4 different eras: Industrial Revolution, Far West, Modernism and Future.<br/></li><li>Spectacular high-definition 3D environments<br/></li><li>Interact with the stages: change junctions, time traffic lights, avoid traps in tunnels;  collect money from banks; blow up barriers… and much more!</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T22:02:42", "background_image": "https://media.rawg.io/media/screenshots/ce3/ce335b344c975efcb52b051fab34565c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 5}, "playtime": 1, "achievements_count": 20, "ratings_count": 0, "suggestions_count": 272, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["U-Play Online"], "genres": ["Strategy", "Simulation", "Casual", "Indie"], "publishers": ["U-Play Online"], "esrb_rating": null}