{"id": 520369, "slug": "jigsaw-puzzles-classic-jigsaw", "name": "Jigsaw Puzzles: Classic Jigsaw", "name_original": "Jigsaw Puzzles: Classic Jigsaw", "description": "Enjoy the Relaxing Jigsaw Puzzles Game for Everyone!<br/><br/>HD Jigsaw Puzzles to play every day! Try to put Jigsaw Puzzles together! Download and start the Jigsaw Puzzles Challenge!<br/><br/>Jigsaw Puzzles game contains high-quality HD pictures in a wide variety of categories, such as nature, amazing food, interesting people, art, lovely animal puzzles of dogs, cats… a large number of beautiful pictures that can help you relax and have fun during your Jigsaw Puzzles gameplay.<br/><br/>Playing Jigsaw Puzzles is a great way to train your brain and to relax! The game difficulty is based on the number of puzzle pieces, and you can put these pieces together in the app.<br/><br/>Key features:<br/><br/>- Tons of free, beautiful HD puzzles from a variety of collections: Flowers, Animals, Landmarks, Oil paintings and more!<br/>- Daily Puzzles. Get a free puzzle every day.<br/>- Mystery Puzzles. Challenge yourself to complete unknown pictures. <br/>- Coin system. Play, earn coins and unlock new puzzles.<br/>- Freely choose from 4 difficulty levels. You can be a Jigsaw master!<br/>- Rotation mode. Turn on rotation to explore more challenging puzzles.<br/>- Custom background. Choose a comfortable background for your puzzle challenge.<br/>- Work on multiple puzzles at a time and see your progress. <br/>- Use your own images/photos to create puzzles by yourself. <br/>- A mode for you to show the pieces in the borders only. <br/><br/>A large number of HD pictures for the Jigsaw Puzzles: Browse from the library with HD pictures in different Jigsaw Puzzles categories, including lovely pets, delicious foods, famous landscapes, beautiful illustrations...<br/><br/>Every new puzzle piece is unique and beautifully realistic!<br/><br/>Download and start solving beautiful free jigsaw puzzles!<br/><br/>Play jigsaw puzzle and see all of the new puzzles we've added! Create your masterpiece with just a puzzle!<br/><br/>Privacy Policy: https://jigsaw.fungame.studio/policy.html<br/>Terms of Use: http://fungame.studio/termsofservice.html", "metacritic": null, "released": "2020-05-12", "tba": false, "updated": "2020-11-20T02:37:08", "background_image": "https://media.rawg.io/media/screenshots/39e/39e7551578aeedb924bc8c06745b7c8f_Nfd43Y0.jpg", "website": "https://jigsaw.fungame.studio/", "rating": 0.0, "rating_top": 0, "added_by_status": {"playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 156, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Guru Smart Holding"], "genres": ["Board Games", "Puzzle"], "publishers": ["Guru Smart Holding"], "esrb_rating": "Everyone 10+"}