{"id": 520361, "slug": "override-2-super-mech-league", "name": "Override 2: Super Mech League", "name_original": "Override 2: Super Mech League", "description": "<p>The gigantic robot brawler is Mech-ing a super-charged comeback in Override 2: Super Mech League!</p>\n<p>Seven years after the Xenotypes that invaded Earth have been eradicated, the giant mechs that were once the planet’s defenders are now their entertainers in global mech battle leagues. As a new pilot of these repurposed weapons of war, climb the ranks and represent your Club with a tuned-up roster of returning and new mechs, each with their own unique abilities, moves, and super-charged attacks. Override 2: Super Mech League is playable both in single player and multiplayer campaigns for up to 4 players locally and online in stages set all over the world.</p>\n<p>Start as a new pilot and propel yourself through the ranks in a deep and robust Career Mode. Join Mech Leagues and earn reputation by competing in Arenas located across the globe. Duke it out with a tuned-up roster of returning robots and new mechs across various versus and co-op game modes of up to 4 players online and locally. Defeat your opponents using an arsenal of unique moves including super-charged ranged attacks, metal-busting combos, or an arena-shattering ultimate attack!</p>\n<p>Key Features:</p>\n<p>•   Career Mode: Fight in Mech Leagues and soar to new heights, aiming to be the best mech pilot. Represent your Club and work together with its members to earn Influence and rewards!<br />\n•   Ranked Rumbles: Two Mechs enter, one leaves. Battle through the competition and climb the ranks to become a legendary pilot.<br />\n•   Mech Mania: 20 playable robots including brand-new mechs with unique abilities, skill sets, and Ultimate moves.<br />\n•   Hazardous Arenas: Competitive fighting grounds that include dynamic elements such as geysers, lava pools, and platforms that encourage strategy and unexpected outcomes.<br />\n•   Upgraded Game Modes:  Pick your playstyle across match types including 1v1, 2v2, free-for-all and several games such as Xenoswarm, King of the Hill and more.<br />\n•   Expansive Customizations: Unlock a slew of cosmetic items and attachments for your mech of choice in the Garage.</p>", "metacritic": 58, "released": "2020-12-22", "tba": false, "updated": "2021-10-08T10:42:10", "background_image": "https://media.rawg.io/media/screenshots/5e7/5e7ad42ee52bd174bb65c938866f21a2.jpg", "website": "https://modusgames.com/override-2-super-mech-league/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 43, "toplay": 4, "dropped": 1}, "playtime": 2, "achievements_count": 36, "ratings_count": 1, "suggestions_count": 382, "game_series_count": 23, "reviews_count": 1, "platforms": ["PlayStation 5", "Xbox Series S/X", "PlayStation 4", "PC", "Xbox One", "Nintendo Switch"], "developers": ["Modus Games"], "genres": ["Action", "Fighting", "Indie"], "publishers": ["Modus Games", "Maximum Games"], "esrb_rating": "Teen"}