{"id": 52043, "slug": "apocalypse-zombie-race", "name": "Apocalypse zombie Race", "name_original": "Apocalypse zombie Race", "description": "This is a real rally with drift elements, while you have to fulfill the mission, shoot down the zombies on the machine. Overcome the hills, throw the car into a skid on the asphalt and feel the inexpressible drive from drift through the mud. Races on Russian cars - that's what a player needs in real physics games. These are games with the open world where you can go anywhere you like. This category of racing has become a special \"chip\" of this game. Post-apocalypse will become a point in the massifs for survival. Now Chernobyl will become Chernobyl 2, however many opinions exist. Simulator rally on the mud will please you with the most realistic and convenient control in races of the \"rally\" class. You are waited by racing cars and lorries and inexpressible pleasure from drift, realistic physics and high detailed graphics. Jeeps, pickup trucks, SUVs are machines for men of the past. Drive off-road, like on the road, just like Ken Block and Colleen McRae! And to supplement the feeling of the game will help you animals that run around the map. When they hit animals with machines, they flounder along the ground.<br/>\n<br/>\r\nGAME FEATURES:<br/>\n<br/>\r\nGREAT CARD: This is an open world game in which you can, for the task, choose the path yourself and make your way through the forest, mountains and dirt.<br/>\n<br/>\r\nZOMBI: On the way, you will come across zombies people and animals. Shoot down a zombie machine. It's fun and will give you the opportunity to survive in this not-friendly world of post-apocalypse.<br/>\n<br/>\r\nMISSIONS: The games with the plot have a big pop due to their interest. In the game there are many thematic missions, performing which you will earn the game currency.<br/>\n<br/>\r\nEARNINGS: In order for missions to be carried out faster, and to shoot down zombies by car it was easier for you to get money for the tasks you completed. You can not earn money and bring it to the card, since it is a game currency. The money is intended solely for purchases inside the game. You can buy cars that are stronger or faster than yours.", "metacritic": null, "released": "2018-02-01", "tba": false, "updated": "2019-08-28T22:02:42", "background_image": "https://media.rawg.io/media/screenshots/b68/b685cf48676194c946aaf0b73d385d34.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 17, "toplay": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 211, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["hallunazigames"], "genres": ["Action", "Racing"], "publishers": ["hallunazigames"], "esrb_rating": null}