{"id": 520589, "slug": "quartette-group-therapy", "name": "Quartétte (Group Therapy)", "name_original": "Quartétte (Group Therapy)", "description": "<p>Warrior Princess Bisa of the neighbouring kingdom is set to marry the love of her life, Prince Robin. However, their castle is invaded by the Gobolies, a group of tyrannical gremlins who want to get rid of diversity by enslaving everyone in the kingdom, leaving them to rule. Their mission goes well, resulting in all of the citizens and Prince Robin himself being captured by the Gobolies. With the two heirs of the kingdom separated, it starts to collapse. After the onslaught, Princess Bisa is left alone with three staff members in the castle; a magician, a court jester and a butler. Together, these four unlikely heroes will come together and take back their kingdom, to restore their diverse and loving paradise.<br/><br/></p><p>We wanted to create this game to emphasise how any one person of any background, race or gender can be a strong individual. The game’s intention is to inspire those that feel down and insecure about themselves, and encourage them to gain confidence and a new found love for themselves by seeing someone just like them represented in a small indie project. We designed the characters in a way so that we didn’t stereotype these same people, but rather present them as a strong and brave person where who they are doesn’t hold them back in the slightest. The narrative in our game shows how loving a unified kingdom like Harmeloda is, and how the world would be an even greater place should everyone aspire to live in a place such as this.<br/> </p><br/>\n\n<p>Controls:</p>\n<p>WASD - Movement</p>\n<p>Space (Castle) - Switch Character</p>\n<p>Space (Battle) - Finalise Attack</p>\n\n<p>Credits: </p>\n<p>Cieran - Programmer</p>\n<p>Jess - Artist/Animator/Concepts</p>\n<p>Bryony - Artist/Animator/Narrative</p>\n<p>Kieron - Artist/Modeller/Level Designer</p>\n<p>Sam - Social Media Manager/Sound Design</p>", "metacritic": null, "released": "2020-11-19", "tba": false, "updated": "2020-11-20T03:34:03", "background_image": "https://media.rawg.io/media/screenshots/4c2/4c26f6c730d71ad10eaee878461b7a5d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 80, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ThreeSA"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}