{"id": 520730, "slug": "disforia", "name": "Disforia", "name_original": "Disforia", "description": "<p>La <strong><em>disforia</em></strong> (del griego δύσφορος (<em>dysphoros</em>), de δυσ-, difícil, y φέρω, llevar) se caracteriza como una emoción desagradable o molesta, como la depresión, ansiedad, irritabilidad o inquietud. </p>\n<p>Se refiere a un desarreglo de las emociones y se puede experimentar en respuesta a acontecimientos vitales ordinarios, podemos entenderla como insatisfacción con la vida o infelicidad general. Es el opuesto etimológico de la euforia. </p>\n<p>~</p>\n<p>A medio camino entre el corto interactivo y el videojuego pasivo, este proyecto se ha realizado en el marco de un curso de Unity 3D, por lo tanto se trata de una obra limitada e imperfecta.*<br/></p><p>Este juego se nutre de la narración en primera persona, en la que se expone la realidad de jóvenes que finalizan una formación con la esperanza de incorporarse al mundo laboral, que aprovecha para ser un manifiesto anti-materialista. </p>\n<p>Se busca lograr pensamientos afines al vacío existencial y al autocuestionamiento, pero al mismo tiempo a la esperanza y la apreciación contemplativa de la belleza; que el jugador precise de un momento para reflexionar y valorar en qué situación se encuentra. Para lograr tal objetivo se utilizan movimientos de cámara, música instrumental, iluminación animada, monólogo y ruptura de la cuarta pared. </p>\n<p>~<br/></p>\n<p>Se recomienda el uso de auriculares y tener activada la webcam.</p>\n<p>* <em>Cuando puedas interactuar con los objetos, deja el televisor para el final.</em></p>", "metacritic": null, "released": "2020-11-18", "tba": false, "updated": "2020-11-20T04:07:56", "background_image": "https://media.rawg.io/media/screenshots/fb9/fb9604e6d95b25bc36029f9e46dd66c6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 52, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Violet Dome"], "genres": [], "publishers": [], "esrb_rating": null}