{"id": 521004, "slug": "looty-v2-amiga-1mb-chip-ram", "name": "Looty V2 (Amiga 1MB Chip RAM)", "name_original": "Looty V2 (Amiga 1MB Chip RAM)", "description": "<p>Runs on any Amiga with a minimum of 1MB Chip RAM<br/></p>\n<p>Note: must be <em><strong>Chip RAM</strong></em> - a mixture of 512k Chip and 512k Slow/Fast will <em><strong>not </strong></em>work. Any additional RAM after that should be fine.</p>\n<p>Tested on A500, A1200, A3000 and Vampire V4 with both AROS and AmigaOS3.1<br/></p>\n<p>---<br/></p>\n<p>Originally written in 1993, and mailed to the Assassins PD free disk collection the next year, this 2020 update fixes various bugs, adds cursor key controls, a way to turn off the music - and crucially, <strong>the numbers on keys and partition doors</strong>!</p>\n<p>It also comes with the Level Designer I originally created to make the levels for the game. It's rough around the edges, but if you wanted you could make a completely fresh set of levels for Looty with it.</p>\n<p>Though this is a complete release, if enough people are interested, I would like to maintain the game after initial publication here to further improve it.</p>\n<p>I'd also love to engage a proper artist to replace the graphics (I created all code, music and graphics assets myself, bar the treasure chest made by my sister!). There is an optional Excel file provided on this page, with details of the graphics format should you wish to have a go yourself!<br/></p>\n<p>Looty was originally inspired by John F Cain's 1984 ZX Spectrum classic 'Booty'. It does NOT replace that game, it is merely an homage to it. Go and play the original today!<br/></p>\n<p>---</p>\n<p>Extra notes:</p>\n<p>* The bubble with Jim's head in is an extra life</p>\n<p>* The red flag will save your position so next time you die you appear at the flag</p>\n<p>---</p>\n<p>If you wish, you can also find me as @retrotechtive on Twitter.</p>", "metacritic": null, "released": "2020-11-18", "tba": false, "updated": "2020-11-20T05:12:07", "background_image": "https://media.rawg.io/media/screenshots/9aa/9aaf7d737149ddb83f5436ee2129f8d8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 113, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["mixelsoftware"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}