{"id": 52106, "slug": "escape-from-tarkov", "name": "Escape from Tarkov", "name_original": "Escape from Tarkov", "description": "<p>Escape from Tarkov is a hardcore and realistic online first-person action RPG/Simulator with MMO features and a story-driven walkthrough.<br />\nWith each passing day the situation in the Norvinsk region grows more and more complicated. Incessant warfare in Tarkov has sparked massive panic; the local population has fled the city, but those who stayed are looking to improve their fortunes at the expense of others. Having accepted the new reality, savage Tarkov locals - &quot;Scavs&quot; flocked into well-armed gangs and started the redivision of the city. Nowadays, Tarkov is separated by unseen borders, controlled by different groups. Gain-greedy gunmen would go to any length to have their way, including the murder of civilians and direct confrontation with the two private military companies.<br />\nThe players will have to experience living in the skin of one of the mercenaries who survived the initial stage of the Tarkov conflict. After choosing one of the sides – USEC or BEAR – the player’s character starts to make his way out of the city. Tarkov is sealed off by UN and Russian military, supply chains are cut, communication with operational command is lost, and in these conditions everyone has to make his own choices of what to do and how to get out of the chaos-ridden metropolis</p>", "metacritic": null, "released": "2017-07-28", "tba": false, "updated": "2024-04-18T14:12:58", "background_image": "https://media.rawg.io/media/games/a9a/a9ab53644b92698b18957a362c99b4e2.jpg", "website": "https://www.escapefromtarkov.com/?lang=en", "rating": 4.03, "rating_top": 5, "added_by_status": {"yet": 29, "owned": 45, "beaten": 30, "toplay": 55, "dropped": 61, "playing": 71}, "playtime": 0, "achievements_count": 0, "ratings_count": 122, "suggestions_count": 386, "game_series_count": 0, "reviews_count": 132, "platforms": ["PC"], "developers": ["Battle State games"], "genres": ["Shooter"], "publishers": ["Battle State games"], "esrb_rating": null}