{"id": 52115, "slug": "hero-hunters", "name": "Hero Hunters", "name_original": "Hero Hunters", "description": "<p>Build a Powerful Team of Heroes! Play the #1 in Shooting RPG Games!<br />\nRecruit 50+ Legendary Heroes to go hunting with!<br />\nJoin epic games with friends in Co-op Missions and compete world-wide in real-time online PvP survival battles.<br />\nThe most incredible free team-based battle royale.<br />\nThe World&#39;s Survival depends on you - crush anyone who is part of the Kurtz army kingdom!<br />\nParticipate in Daily Events, Gauntlet Mode and Boss Raids!<br />\nTake charge by shooting and switching between heroes, or use auto-play for idle gameplay!<br />\nGear up for the best free third person shooter rpg game on mobile!<br />\nJOIN THE HUNT<br />\n• Cover-based, third person shooter experience with amazing console-like graphics<br />\n• Quickly swap between Heroes during battle in real-time, team-based combat wars<br />\n• Modern and futuristic weaponry makes playing each hero a distinct experience; fire sniper rifles and energy guns<br />\n• Deploy jaw-dropping special abilities that can quickly turn the tide of battle.<br />\n• Hone your skills by controlling your heroes or play idle when on the move.<br />\nCOMMAND YOUR HEROES<br />\n• Collect exclusive heroes, each with their own legendary weapons and special abilities.<br />\n• Assemble the right team to take on the enemy. Mix up your roster to find the perfect combination - keep your tanks and healers on overwatch while your assassins and assault classes take down the enemy.<br />\n• Play as your favorite hero and dynamically switch between heroes at any time during gameplay.<br />\n• Plunder loot after each battle, level up your heroes, upgrade your abilities and perfect your loadout.<br />\n• Immerse yourself in the single-player campaign as you fight against raiders, bandits and worse in a post-apocalyptic cityscape.<br />\n• The battle is never over. Watch your hero squad dominate the battlefield.<br />\nREAL-TIME PvP TACTICAL BATTLE MODE<br />\n• Challenge your skills against other players in real-time multiplayer action-packed tactical PvP combat<br />\n• Craft a tactical squad of up to 5 heroes and dominate the leaderboards and leagues<br />\n• Join forces with your friends to build an unstoppable military alliance<br />\n• Beat your rivals in intense time-based event competitions focused on both solo and strategic group play.<br />\n• Become one of the highest ranked lords of PvP!<br />\nPlay one of the Top Shooting RPG Games for FREE! Download Now!</p>\n<hr />\n<p>By downloading this app you are agreeing to be bound by the terms and conditions of Hothead&#39;s Terms of Use (www.hotheadgames.com/termsofuse) and are subject to Hothead&#39;s Privacy Policy (www.hotheadgames.com/privacy-policy).<br />", "metacritic": null, "released": "2018-01-30", "tba": false, "updated": "2021-05-30T09:05:10", "background_image": "https://media.rawg.io/media/screenshots/362/362a2e91589db8bf10211d7dc1971d5b.jpg", "website": "http://www.hotheadgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "dropped": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 387, "game_series_count": 0, "reviews_count": 2, "platforms": ["iOS", "Android"], "developers": ["Hothead Games"], "genres": ["Action", "RPG"], "publishers": ["Hothead Games"], "esrb_rating": "Teen"}