{"id": 52116, "slug": "bring-you-home", "name": "Bring You Home", "name_original": "Bring You Home", "description": "BRING YOU HOME unravels the story of Polo, a humble alien hero who will traverse all kinds of worlds in a frenzied chase to rescue his kidnapped alien pet.<br/>\n<br/>\r\nBRING YOU HOME is a cute and accessible, purely visual, family-friendly puzzle adventure… with a twist in the gameplay. You don’t control the hero, you control the level ITSELF! How? Change and rearrange the pieces of every level to unveil the right path for Polo!<br/>\n<br/>\r\nWith this innovative mechanic, even failing can be fun! If poor Polo finds a deadly but hilarious fate, just go back in time and rewind the level.<br/>\n<br/>\r\nVenture into oodles of worlds stuffed with magical characters, bizarre surprises, and many treacherous dangers – all to catch the captors of your missing pet. Will you get to the bottom of this mystery?<br/>\n<br/>\r\nINVENTIVE<br/>\r\nExplore a mind-boggling game mechanic that allows you to control the environment around you!<br/>\n<br/>\r\nUNEXPECTED<br/>\r\nJump from world to world in dozens of levels all around the universe. You never know what’s gonna happen next!<br/>\n<br/>\r\nSILLY<br/>\r\nDiscover all the wacky pitfalls in every level – you don’t want to miss them!<br/>\n<br/>\r\nADORABLE<br/>\r\nFind and collect nostalgic pictures you took with your lovely pet! Oh, sweet memories…", "metacritic": null, "released": "2018-02-01", "tba": false, "updated": "2023-03-16T22:28:56", "background_image": "https://media.rawg.io/media/screenshots/d94/d9482a17517b087f9d8532a65e349ba9.jpg", "website": "", "rating": 4.5, "rating_top": 5, "added_by_status": {"owned": 2, "beaten": 7, "toplay": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 6, "suggestions_count": 174, "game_series_count": 0, "reviews_count": 6, "platforms": ["PC", "Linux", "macOS", "Android", "iOS"], "developers": ["Alike Studio"], "genres": ["Adventure", "Casual", "Indie", "Puzzle"], "publishers": ["Alike Studio"], "esrb_rating": null}