{"id": 52122, "slug": "disc-drivin-2", "name": "Disc Drivin' 2", "name_original": "Disc Drivin' 2", "description": "Faceoff with friends in a turn-based, disc-swiping race as you compete to be the first to get your disc around the track. Tackle tracks with sweeping curves and elevation changes in physics-based environments. Play at your own pace as you master the action-packed sport of disc drivin’.<br/><br/>Based on the acclaimed original Disc Drivin’, Disc Drivin’ 2 is a combination of skill and tension-producing physics. Now with two swipes per turn, set up your shot and make a second move while still in motion to avoid an unexpected hazard at the last second. Armed with an arsenal of upgradable powers to slip past your enemy, decide the best way to outrace your opponent. Try your hand at the new Speedrun mode where you’ll race against the clock to improve your skills. Earn coins in competition to unlock cards, new powers, discs, and abilities.<br/><br/>A competitive battle to the finish line, Disc Drivin’ 2 is a fresh combination of friendly competition, anticipation, strategy, and hijinks on the track! <br/><br/>Features:<br/>• Intuitively swipe to move your disc around the track<br/>• Compete in turn-based multiplayer battles around the globe<br/>• 20 unique tracks of various challenge levels<br/>• Single-player Speedrun, local multiplayer, and pass-and-play modes<br/>• Collect cards to unlock crazy new discs, upgrade powers, and earn disc abilities<br/>• Many unique powers such as turbo, missiles, autopilot, and bombs<br/>• New animated hazards like lasers, spikes, and force fields<br/>• Customize your disc and play as a pizza, cake, monster truck tire, and more<br/>• Full 3D physics<br/>• Four cheerful and immersive environments", "metacritic": null, "released": "2018-02-01", "tba": false, "updated": "2019-07-30T12:25:08", "background_image": "https://media.rawg.io/media/screenshots/7d7/7d7df5354a7b1aa2ce34abab3b155a62.jpg", "website": "http://www.pixelocitysoftware.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 86, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Pixelocity Software"], "genres": ["Racing", "Board Games"], "publishers": ["Pixelocity Software"], "esrb_rating": null}