{"id": 52139, "slug": "close-combat-3-the-russian-front", "name": "Close Combat 3: The Russian Front", "name_original": "Close Combat 3: The Russian Front", "description": "Lead your men through the largest, bloodiest battle of the century.<br/>\n\nCommand a fire brigade of soldiers on the Russian Front in this real-time strategy game set in World War II featuring unequaled detail, realism and scope. Player as either the Soviets or Germans as you orchestrate your squads' attack, defense, and survival over four grueling years of the grandest and bloodiest war the world has ever seen. To succeed, you must guide your man through the moral dangers of war while physically an psychologically defeating your enemies. Your soldiers are counting on you. Don't let them down!\n<br/><br/>\nCommand the same men throughout the entire four-year campaign - from the initial German invasion of Operation Barbarossa to the pivotal Russian victories at Moscow, Stalingrad, Kursk, and Berlin. Or rewrite a chapter of the history by rallying your German troops to take Red Square.\n<br/><br/>\nOver 300 specialized squads - 100 weapons, 60 soldier types, and 60 distinct vehicles or antitank guns. Includes 120 mm mortars, flame-throwers, rocket launchers, half-tracks and off-map heavy artillery barrages,\n<br/><br/>\nManage your squads by resting, refilling, and upgrading them between battles. Follow each soldier as he progresses from green rookies to seasoned veterans and advance in rank to command more units.\n<br/><br/>\nCreate your own \"what if\" scenarios with Close Combat III's enhanced Scenario Editor. Craft single or multi-map battles and set deployment zones, objective locations, requisition points, and available units.\nModeling realistic soldier psychological profiles during combat\nExperiencing the effects of strength, ability, and morale\nRallying around new commander units on the battlefield\nReturning fire when fired upon and zeroing in on targets\nAdapting strategies to counter your playing style\nTrue line-of-sight and line-of-fire gameplay with elevation effects for terrain and buildings\nDirect and indirect fire with limited ammunition\nAbility to protect your men in buildings, pillboxes, and trenches\nVehicle facings that affect armor protection\nContinuity from battle to battle, including destroyed terrain and burnt wrecks", "metacritic": null, "released": "1999-01-14", "tba": false, "updated": "2019-07-25T20:57:11", "background_image": "https://media.rawg.io/media/screenshots/abf/abf50337dcbe53892dcc215dc3a9be7d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 14, "toplay": 1, "dropped": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 491, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Atomic Games"], "genres": [], "publishers": ["Slitherine"], "esrb_rating": null}