{"id": 521548, "slug": "absorb-noahmt", "name": "Absorb (NoahMT)", "name_original": "Absorb (NoahMT)", "description": "<p>Absorb  is a game that I worked on in 2020 and was the Producer/Designer in a group of 10 very talented people including myself.</p>\n\n<p>Game Overview:</p>\n\n<p>You wake up in a coffin inside a tomb. You soon realise that it’s not a coffin or a tomb but a battery slot for a massive engine that runs the entire world and its technology. You feel weak but still remember your power of absorption. You don’t really remember how you got here but you are determined to find out so you venture out of your prison into the hostile world outside to seek answers. You will use your power to absorb enemy abilities to fight your way through many tough enemies and regain your lost strength, hopefully finding out answers to why you were imprisoned and why the world is on the verge of destruction and full of hostile inhabitants.</p>\n\n<p>Controls:</p>\n\n<p>Story:</p>\n<p>Welcome to the world of Syphonia, a mysterious land that feeds off, is fueled by and exists because of its living inhabitants. Two beings that are forever connected to but always in constant contrast with each other. Two sides to one coin, light &amp; dark, negative &amp; positive energy.</p>\n<p>In the beginning there was nothing but then without warning a spark gave rise to a glint of light. This was the first born, known as the life giver, Solaris. Then almost immediately after Solaris, a shadow was cast in contrast to its shining brilliance. This was the second born, known as the destroyer, Abidaro.</p>\n<p>Even though they became known as the life giver and the destroyer by the masses, in truth they were much more complicated than that and without both of them, the world of Syphonia would not exist.</p>\n<p>Syphonia’s land was formed by the brief merging of Solaris and Abidaro, which caused a giant explosion and once the dust had cleared there was a massive rocky landscape as far as the eyes could see. Solaris used its power to give life to the landscape, spawning flora, seas and other living beings by splitting itself into millions of smaller pieces, which became the living inhabitants of Syphonia. These inhabitants at first were nothing more than blank empty shells, and it was what came next that allowed Syphonia to grow and advance.</p>\n<p>Abidaro gave autonomous sentience to these beings and gifted them knowledge. Knowledge that allowed the inhabitants to build and create. With this knowledge they created vast cities, structures and formed societies. The most impressive thing that came from Abidaro’s gift of knowledge to these inhabitants though was the advanced technology. A siphoning technology that harvested the internal energy of the world and inhabitants to fuel everything. Vehicles, electricity, computers, medical technology, everything was fueled by this technique of harvesting the very life force of the world and feeding it back in on itself. However, Abidaro was not known as the destroyer for nothing. Abidaro knew that nothing lasts forever and for new life to be created or for progress to be made, some things needed to end. Abidaro took it upon himself to destroy anything in Syphonia that was starting to stagnate and rot, clogging up the siphon technology’s process with drained husks not fit to properly fuel their world. This is also where Solaris would step in and create new life for Abidaro to grant autonomy and the cycle would continue.</p>\n<p>Many millennia had passed since Syphonia’s inception and Solaris and Abidaro ruled over their vast and successful kingdom. Solaris and Abidaro always had an underlying sibling rivalry if you will and quite often did not see eye to eye. The world had come to a tipping point and Syphonia was facing a crisis. Solaris and Abidaro had become weaker over the thousands of years that had passed and this was nothing but trouble for the world of Syphonia. The technology that was so prominent in the world and what allowed the world to flourish was draining so much fuel from the inhabitants and the world that soon there would be no energy left to fuel the world and it would all collapse on itself.</p>\n<p>Solaris and Abidaro both knew this day would come one day and both frequently argued about the best way to deal with the issue.</p>\n<p>Abidaro was of the belief that the best thing to do would be for them to recreate how the world was first formed and join together. Fusing their powers together would however essentially destroy the entire world and reset everything back to the beginning. The advantage of this would be that they could learn from their previous mistakes and hopefully create a more successful world.</p>\n<p>Solaris however had grown quite comfortable with ruling the world of Syphonia and had every intention to keep it that way. Solaris knew of another way but knew that Abidaro would never agree to such a thing. Solaris knew that if one of them “sacrificed” themselves and artificially fueled the world, almost acting like a living battery, that the world could continue to exist. The problem with this was that the world would forever stagnate and could not continue to advance or grow, being left in an almost purgatory like existence. </p>\n<p>Solaris and Abidaro got into a large conflict and Solaris was able to defeat and imprison Abidaro. Solaris doomed their other half to an eternal prison, forever to fuel the world artificially as a living battery… or so he thought.</p>\n\n<p>Team Credits:</p>\n<p>Design</p>\n<p>Uriah Overton - Lead Designer<br/>Noah Mendelsohn-Thornton - Producer/Designer</p>\n<p>Programming</p>\n<p>Lachlan Wernert - Lead Programmer<br/>Will Hart - Gameplay/UI Programmer</p>\n<p>Art</p>\n<p>Nicole Harvey - Lead Artist<br/>Guillaume Coquel-Danchin - Character Artist<br/>Harry Lister - Environment/Texture Artist<br/>Kira Walters - Environment/Texture Artist<br/>Sean Rogers - Animator<br/>Tristan Milverton - Environment Artist/Rigger</p>", "metacritic": null, "released": "2020-11-16", "tba": false, "updated": "2020-11-20T07:16:19", "background_image": "https://media.rawg.io/media/screenshots/1a1/1a10026fd43d92df7fc548431d6abd56.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 393, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["NoahMT"], "genres": ["Action"], "publishers": [], "esrb_rating": null}