{"id": 521571, "slug": "stay-2", "name": "Stay?", "name_original": "Stay?", "description": "<p><strong>STAY?<br/></strong><strong><em>CHOOSE YOUR OWN HAPPY ENDING</em></strong></p>\n<p>Welcome to Elaia, a magical city nestled in a high valley. It's the end of your first year at university &amp; time to choose your major. </p>\n<p>Find yourself among potential friends or lovers-- young people with secrets, dreams, fears, and tragedies. Learn about the history &amp; breadth of Elaia's world, and decide what kind of mark you want to leave on it. </p>\n\n<p><strong>WHAT IS \"<em>STAY</em></strong><strong><em>? </em>\" ?</strong></p>\n<ul><li>An interactive fiction story. </li><li>A dating sim wrapped up in a fantasy adventure puzzle.</li><li>A quest to find your own happy ending in a world where you always get a second chance.</li></ul>\n\n<p><em>HOW TO PLAY: </em></p>\n<p>Select \"Run Game\" or \"Load Game.\" Read the text that appears like it's a story unfolding, and select between the bolded options offered to you. </p>\n<p><em>HOW TO SAVE: </em></p>\n<p>Use the SAVE button to preserve your progress as you explore Elaia. Any refresh/reload of the web page will clear your existing progress. Many phones will automatically drop any idling webpages, so save before you leave the browser app to go to another application or tab. </p>\n<p><em>TROUBLESHOOTING: </em></p>\n<p>If the game \"freezes,\" choices stop appearing, or it has other issues in execution, we suggest closing the browser, then reopening it &amp; reloading your most recent save. (Do NOT save at the place the error occurs. Only use a save that already existed.) This has helped with most the commonly seen bugs. </p>\n<p>If the game won't load at all (\"Run Game\" does not appear), try deleting your cookies. </p>\n\n<p>Credits: </p>\n<p>Made using inkle's INK - inklestudios.com</p>\n<p>Written by E. Jade Lomax - ejadelomax.com</p>\n<p>Ink by E. Jade Lomax </p>\n<p>Save Function provided by Adam Rubin </p>\n<p>Photo by Curt Lomax </p>\n<p>Beta testing by Jules Lomax, Adam Rubin, M. Esty, J. Loginov, R. Kellum, A. Rowland, K. Su, H. Barnard, N. Oguri, S. Hayes, M, Grace Li, and many wonderful helpful others! </p>", "metacritic": null, "released": "2020-11-15", "tba": false, "updated": "2020-11-20T07:21:42", "background_image": "https://media.rawg.io/media/screenshots/0e4/0e49eace548d03cfbc3f282a67f410b7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 39, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["ejadelomax"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}