{"id": 521578, "slug": "album-crawl-the-shape-of-he-to-come", "name": "Album Crawl - The Shape of He to Come", "name_original": "Album Crawl - The Shape of He to Come", "description": "<p>Venture into the swamps of Wästland to get to the bottom of the recent disappearances of foresters and peat cutters. <br/></p>\n<p>Crawl through the muck and vegetation, discovering new dangers at every turn. Join forces with the druids, explore the bogs, talk to the local aspirants, and struggle with some very energetic plants. <br/><br/>Will you make it to the ritual in time? Will you stop it? Will you aid it? Will you face down the <strong>Shambler</strong>, avatar of the Shape of He to Come, and live to tell the tale? <br/><br/>Put on Botanist's album, <em>The Shape of He to Come</em> and find the answers to these questions and more in this album crawl! <br/></p>\n<p>Special thanks to Chalkdown for their awesome rendition of the hex map!</p>\n<p>🜋🜋🜋<br/></p>\n<p>LEGAL<br/></p>\n<p><strong>Album Crawl - The Shape of He to Come</strong> is an independent production by <strong>I. McClung</strong> and is not affiliated with Ockult Örtmästare Games or Stockholm Kartell. It is published under the MÖRK BORG Third Party License.</p>\n<p>MÖRK BORG is copyright Ockult Örtmästare Games and Stockholm Kartell. </p>\n<p>Furthermore, I am not affiliated with <em>Botanist</em> in any way, shape, or form. This album crawl is purely inspired by their music, nothing more. <br/></p>", "metacritic": null, "released": "2020-11-16", "tba": false, "updated": "2020-11-20T07:23:09", "background_image": "https://media.rawg.io/media/screenshots/921/9218e58e5cdc1e55da99bf2a93140052.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 53, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Makooti"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}