{"id": 521557, "slug": "hells-cookhouse", "name": "Hell's Cookhouse", "name_original": "Hell's Cookhouse", "description": "You are tasked with collecting ingredients for a variety of recipes, but they're not going to come easily...<br/><p>To aid in the kitchen you are equipped with a (kitchen) gun, and a cleaver. While the gun boasts power, it destroys any ingredients beyond use, so the cleaver is needed to deal the finishing blow, lest the resources go to waste.<br/><br/>The demons can smell your cooking however, and won't rest until they've pierced your defences...<br/><br/>--------------------------------------------------------------<br/></p><p>Unity WebGL is a bit wonky, but make sure to go fullscreen (icon is on the bottom right). Press ESC to exit fullscreen and/or unlock the cursor from the game.\r\n</p>\n<p>--------------------------------------------------------------<br/></p>\n<p>Created for the 2020 Mix and Game Jam. All art + code created by me, with most sounds coming from freesounds. The \"\"music\"\" <em>was</em> composed by me however, at around 6am by hammering on a keyboard before the deadline.<br/></p>\n<p>The theme of the jam was to mix two different genres into one game. I decided on mixing Cooking games with First Person Shooters. In the end it admittedly was mostly the latter, but given the amount of time I had I'm fairly happy with the results. I had some more ideas that didn't make it, such as a flamethrower to \"cook\" the monsters, as well as more meaningful ingredients and recipes. Definitely focused on the FPS mechanics first.<br/></p>", "metacritic": null, "released": "2020-11-15", "tba": false, "updated": "2020-11-20T07:18:43", "background_image": "https://media.rawg.io/media/screenshots/9ed/9ed1f5b3dd0b2d0d09d72cbe3cc00769.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 98, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["Tsunscreen"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}