{"id": 52169, "slug": "osu", "name": "osu!", "name_original": "osu!", "description": "<p>osu! is a rhythm game created by Australian developer Dean &quot;peppy&quot; Herbert in 2007 and playable for free on PC. It is among the most popular rhythm games in recent times, counting about 500,000 active players and over 14,000,000 created accounts. It received an official iOS version named osu!stream in 2011. A new PC client codenamed osu!lazer is currently in the works.</p>\n<p>osu! features 4 modes, three of them based on popular commercial rhythm games :<br />\n- osu!standard is based on Osu! Tatakae! Ōendan (known as Elite Beat Agents in the West); it is the default and most popular mode. Notes are represented by numbered circles which appear on the play field. The player must use a pointing device (such as a mouse or graphic tablet) to click on the circles to the beat of the music to earn points and keep up their combo until the end of the song. <br />\n- osu!mania is based on classic Vertical Scrolling Rhythm Games (VSRG) such as the Dance Dance Revolution series. Notes scroll down a play field with multiple lanes each corresponding to one key, until they reach a line. The player must press the right keys at the right timing indicated by the line to earn points.<br />\n- osu!taiko is based on the Taiko no Tatsujin series. Red (don) and blue (katsu) circles representing notes scroll on a single lane and the player must press the key corresponding to the color of each note at the right timing. This mode supports use of Nintendo Wiimotes as a control device, mimicking the controls in Taiko no Tatsujin Wii.<br />\n- osu!catch, also known as Catch the Beat or ctb, is the only original mode in osu!. Notes represented by various fruit fall down from the top of the screen. The player controls the mode&#39;s mascot, Yuzu, holding a basket, and must move him left and right to catch the falling fruit. </p>\n<p>Whereas commercial rhythm games generally only feature music licensed or commissioned by the developer, osu! is notable for its entirely player-created content. Players can freely create beatmaps (the game&#39;s equivalent of charts) for any song using an extensive editor and upload them on the game&#39;s website for anyone to download and play. Quality maps are selected through a evaluation process to become ranked, allowing them to possess a leaderboard and count towards the game&#39;s player performance ranking system. The game also features support for skins which can change the appearance of nearly everything in the game.</p>", "metacritic": null, "released": "2007-09-16", "tba": false, "updated": "2024-04-06T11:41:10", "background_image": "https://media.rawg.io/media/screenshots/142/1420d28eb5fa9d012b90c48629a18a94.jpg", "website": "https://osu.ppy.sh/", "rating": 4.26, "rating_top": 4, "added_by_status": {"yet": 3, "owned": 59, "beaten": 57, "toplay": 6, "dropped": 108, "playing": 93}, "playtime": 281, "achievements_count": 0, "ratings_count": 167, "suggestions_count": 83, "game_series_count": 0, "reviews_count": 175, "platforms": ["iOS", "macOS", "Android", "PC"], "developers": ["ppy", "Dean «peppy» Herbert"], "genres": ["Arcade", "Indie"], "publishers": ["Dean «peppy» Herbert"], "esrb_rating": null}