{"id": 521719, "slug": "touhou-block-fall-yukari", "name": "Touhou Block Fall ~ Yukari", "name_original": "Touhou Block Fall ~ Yukari", "description": "<h3>Youkai are invading!</h3>Take control of Reimu as she teams up with Yukari to handle the invasion! Manage stacks of falling Bakebake, Magic Books, Sunflower Fairies, and Yinyang orbs to keep the invasion from getting out of control in this 8-bit inspired falling block puzzle game.<br/><h3>Extermination</h3>Match two youkai of the same type to exterminate them and clear room on the board for more. Or, sandwich youkai between the top and bottom halves of a gap so Yukari can send them all away and earn extra points in the process.<h3>Use Bombs Wisely</h3>Overwhelmed by supernatural beings? Just want to earn extra points? Use bombs to clear the board of all youkai at once and take the pressure off - for now!<h3>Choose Your Path</h3>Choose between two different play modes:<br/><ul> <li>ReimuA, in which the youkai fall endlessly until you're overwhelmed and a stack reaches the top of the board<br/> </li><li>ReimuB, in which clearing the board earns you bonuses and resets the field</li></ul>Each mode has different advantages to play, so try them both!<h3>Bustin' Tunes, Bustin' Youkai</h3>Listen to six different Touhou tracks, each with two different arrangements (including NES-faithful chiptune arrangements) in the Music Room, and choose three of them as music presets for quick selection on the game setup screen.", "metacritic": null, "released": "2020-11-20", "tba": false, "updated": "2020-11-23T02:19:18", "background_image": "https://media.rawg.io/media/screenshots/07a/07a116025fa0d8d69301f1ee975c2d9d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 10, "ratings_count": 0, "suggestions_count": 155, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ShmoeSoft"], "genres": ["Casual", "Indie"], "publishers": ["ShmoeSoft"], "esrb_rating": null}