{"id": 521746, "slug": "palace-rule", "name": "Palace Rule", "name_original": "Palace Rule", "description": "[Game Features]<br/>1. Dramatic Plot, Amazing Dubbing<br/>Super enjoy the story of the Qing palace travels through the novel, the emotional interpretation of the world's cause, if life is just like first sight, ups and downs, watching and playing, the ultimate sultry dubbing, immersive experience, put on headphones and enjoy this moment.<br/>2. Gorgeous Costumes, Be Your Own Designer<br/>Thousands of costumes, hairstyles, makeup, clothing, accessories, socks, shoes, match them as you like. Be the most beautiful girl in the Forbidden City and lead the fashion trend of the Qing Dynasty.<br/>3. Romance in Palace, Lover Development<br/>Despite the indifferent moonlight, characters in palace are sentimental. Dress up to meet lovers, and exchange gifts with each other, as well as your love. Nevertheless, your fate is not in your own hand. Among the four gentlemen in this deep palace, who is your true love?<br/>4. Get Promoted, Seize the Throne of Empress<br/>Step by step, finish dailies to get promoted gradually. How to become the Empress by starting with just a candidate? This is a battlefield for women, do you dare to fight?<br/>5. Train Followers, Form up Your Own Force<br/>Followers from all walks of life can be cultivated and dispatched. Upgrade them to exert their talent in socializing or art, everything is up to you!<br/>6. Companion Pets, Cute and Adorable<br/>Innovative cat house mechanic, come to raise various cute cats, cultivate them to adulthood. Find love for your cats through the whole server, a paradise that cat lovers cannot miss!<br/>7. Manor System, Grow Vegetable and Feed Yourself<br/>Even if you are in the palace, you can experience the manor gameplay! Plant vegetables and harvest them, it would be fun to enjoy a relaxed life like this!", "metacritic": null, "released": "2020-11-16", "tba": false, "updated": "2020-11-23T02:35:31", "background_image": "https://media.rawg.io/media/screenshots/1ed/1eda79011f5639e2c564f93cb243758d_1qbPq9t.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 210, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Young Phoenix Co"], "genres": ["RPG", "Card"], "publishers": ["Young Phoenix Co"], "esrb_rating": "Teen"}