{"id": 52209, "slug": "taiko-no-tatsujin-drum-session", "name": "Taiko No Tatsujin – Drum Session", "name_original": "Taiko No Tatsujin – Drum Session", "description": "<p>Taiko No Tatsujin is finally here for the PlayStation®4 platform!<br />\n◆Well-known mainstream songs with more than 70 latest hits! You can now enjoy that all so familiar game center experience playing Taiko No Tatsujin at the comfort of your home!<br />\n◆All essential gaming elements are catered for in the PS4™ Taiko No Tatsujin! Simply register your friend or family member&#39;s Sony Entertainment Network account as a friend allows you to have a causal game session with their Ghost data even if they are not around!<br />\nPerhaps playing with a popular character through the Game Session with Guest would be equally appealing♪<br />\nAnd for those with great ambition, the Taiko Ranked Match provides you the opportunity to put your skills to the test and compete against online players from all around the world! You will be matched up automatically against other online Ghost data befitting of your current skill level.<br />\nSavour the VS battles as you win your way through the ranks aiming for the top spots♪<br />\n※Game session with friend, Taiko Ranked Match feature requires a Sony Entertainment Network account.<br />\n※PlayStation®Plus subscription is not required.<br />\n※Internet connection is required for the PlayStation®4.<br />\n※Content and design may be changed without prior notice.<br />\nPurchase or use of this item is subject to SEN Terms of Service and User Agreement.<br />\nPurchased content or services are not refundable or transferable, and cannot be redeemed for cash or credit.</p>", "metacritic": null, "released": "2017-11-02", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/027/0277d0ac656f13337f9d2d1c966c61fd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 124, "game_series_count": 0, "reviews_count": 1, "platforms": ["PlayStation 4"], "developers": ["Bandai Namco Entertainment"], "genres": ["Simulation"], "publishers": ["Bandai Namco Entertainment"], "esrb_rating": null}