{"id": 5220, "slug": "mortal-kombat-unchained", "name": "Mortal Kombat: Unchained", "name_original": "Mortal Kombat: Unchained", "description": "<p>Mortal Kombat: Unchained delivers the deepest fighting game ever on the PSP® system. With multiple fatalities per character, interactive backgrounds, extensive game modes and multiplayer wireless support.<br />\nMortal Kombat®: Unchained™ © 2009 Warner Bros. Entertainment Inc.  Portions of this software are Copyright 1998-2004 Criterion Software Ltd. and its Licensors.  CRI Sofdec and the CRI Sofdec logo are trademarks of CRI Middleware Co., LTD.  Converted by JGI Entertainment.  All other trademarks and copyrights are the property of their respective owners.  All rights reserved.  MORTAL KOMBAT, MORTAL KOMBAT: UNCHAINED, the dragon logo, and all related characters and elements are trademarks of and © Warner Bros. Entertainment Inc.  WB GAMES LOGO, WB SHIELD: ™ &amp; © Warner Bros. Entertainment Inc. (s09)<br />\nPurchase or use of this item is subject to the PlayStation®Network Terms of Service and User Agreement. If you do not wish to accept all these terms, do not purchase or use this item.  This item has been sublicensed to you by Sony Computer Entertainment America.  One-time license fee for downloads to up to 2 portable systems that are associated with the purchasing account.</p>", "metacritic": null, "released": "2009-10-02", "tba": false, "updated": "2024-03-21T00:39:55", "background_image": "https://media.rawg.io/media/games/a19/a191e7212996de1f32b72bfa8997e2ca.jpg", "website": "", "rating": 3.45, "rating_top": 4, "added_by_status": {"yet": 4, "owned": 14, "beaten": 24, "toplay": 4, "dropped": 15, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 31, "suggestions_count": 275, "game_series_count": 22, "reviews_count": 31, "platforms": ["PSP"], "developers": ["Midway Home Entertainment"], "genres": ["Action", "Fighting"], "publishers": ["Midway"], "esrb_rating": "Mature"}