{"id": 522025, "slug": "keyboard-guitarra", "name": "Keyboard Guitarra", "name_original": "Keyboard Guitarra", "description": "<p>The guitar consists of 6 strings, numbered in decreasing pitch. The first string <strong>[1]</strong> being the one with the highest pitch (an <strong>e</strong> or <strong>Mi</strong>). The lowest string <strong>[6]</strong> is tuned at the lowest pitch of this guitar which is also an <strong>E</strong> or <strong>Mi</strong>, 2 octaves below the 1st string.<br/></p>\n<p>Each string can be pressed at different places in the neck of the guitar called <strong>frets</strong>.<br/>Pressing each fret, starting from the head of the guitar, will increase the pitch of that string by half a semitone per fret. In western music, 1 octave is divided in 12 semitones.<br/></p>\n<p>You play the guitar by pressing the frets on the neck of the guitar with your left-hand's fingers; and playing, strumming or plucking the strings with your right hand over the hole of the guitar.<br/></p>\r\nHow to read the sheet music\r\n<p>There are 2 types of written music in this digital piece.</p>\n<ol><li>Original music sheet by Francisco Tárrega</li><li>Section-long guitar tabs by Ferran</li></ol>\r\nReading the guitar sheet\r\n<p>To learn to read music sheets in general, we won't go into detail  for now (!) please excuse us and come again later or find one of the many nice online resources about it such as this video!</p>\n<p>In the music sheet, there are numbers that guide your fingers on the guitar.<br/>In guitar, the left hand fingers are numbered as so:</p>\n<ol><li>Index</li><li>Middle</li><li>Ring</li><li>Pinky</li></ol>\n<p>A clean number  in front of a note will tell you what finger you should press the fret with to play that note.</p>\n<p>A circled number after a note will tell you what string to play that note.</p>\n<p>A circled <strong>(0)</strong> will tell you to play that note on an open string (no fingers pressed on the string)</p>\n<p>A <strong><em>C 2a</em></strong> on top of the staff will tell you to use a barre chord (cejilla) with your index finger on the indicated fret (in this case the 2nd). The index finger might need press all the 6 strings or as little as the higher 2 strings of the guitar.<br/></p>\n<p>You can zoom on the current section on the sheet, by clicking on the magnifying glass.<br/>You can also display the music-staff visualization of the played note by clicking on the wine bottle.<br/></p>\r\nReading the guitar tablature\r\n<p>The guitar tab, visible by clicking on the onion, displays the 6 strings of the guitar, from bottom (low) to top (high).<br/>Over each string-line, the number displayed tells us the <em>fret number</em> of the note that should be played.<br/>Frets are counted from the head of the guitar. A number 0 represents an open string, or unpressed string.<br/>The horizontal dimension of the tab represents time. Two numbers displayed on top of each other represent two strings that need to be played at the same time.<br/></p>\r\n\r\nA playful instrument by\r\n<p>Nomi @the_nomi</p>\n<p>Ferran Bertomeu Castells @fonserbc<br/></p>\r\nSpanish Public Domain works used\r\n<ul><li>Preludios. n. 8. Guitarra. La mayor, Francisco Tárrega, 1906</li><li>Fragment (Spain), 15th century</li><li>Tile (Spain), late 18th–early 19th century</li></ul>\r\nOther assets\r\n<ul><li>Classical Guitar by Avgust9</li></ul>", "metacritic": null, "released": "2020-11-22", "tba": false, "updated": "2020-11-23T03:44:30", "background_image": "https://media.rawg.io/media/screenshots/f9c/f9c46cc3d62826dae5e4ff760b1c2559.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 23, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Nomi", "Ferran Bertomeu"], "genres": ["Simulation", "Puzzle"], "publishers": [], "esrb_rating": null}