{"id": 522032, "slug": "from-the-ruins", "name": "From The Ruins", "name_original": "From The Ruins", "description": "<p>From The Ruins was created for the #Globalcitiesstartupgamejam in 48 hours. The topic of the Jam was \"WIN-WIN-Solutions\".</p>\n<p>In the game, you are a powerful wizard charged with bringing life back to a ruined world. Turn by turn, you flip over ruined tiles and bring life back to the desolate, dead place. This time, civilization will live in harmony with nature.</p>\n<p>To score high, you need to strive for a perfect balance between civilization and nature. Some actions will gain you civilized points, others will give you natural points - but your total score will be the lower of the two, so make sure to raise both equally.<br/></p>\n<p>Please use the hashtag #fromtheruins when sharing your scores or post them in the comments.<br/></p>\n<p><strong>How To Play</strong></p>\n<p>Every turn, you click and drag one dormant tile on a neighboring awakened tile or vice versa.  The dormant tile will awaken and score points, and if you moved or awakened a village, a city might be created.</p>\n<p>Each tile will score either Civilized or Natural points. The game ends when all tiles have been awakened, or no legal move can be made anymore. Once that is the case, your final score will be the lower of the two (which means ideally, both will be at the same score).</p>\n\n<p><strong>The Rules:</strong><br/></p>\n<p>A dead forest will turn into a living forest.</p>\n<p>A living forest scores 3 Nature point for each other living forest it touches.</p>\n<p>Savannah can turn into a Meadow when awakened directly next to a village, or a Grassland.</p>\n<p>A Meadow will score 3 Civilized points.</p>\n<p>Grassland will score 2 Nature point.</p>\n<p>Ruins can turn into a Village when there is another Civilized tile in range of 3 hexes, or they turn into Grassland.</p>\n<p>A Village will score 2 Civilized points for each neighboring awakened tile it touches.</p>\n<p>Grassland will still score 2 Nature point.</p>\n<p>Scorched Earth will turn into Farmland when awakened directly next to a Village, or turn into Flowers otherwise.</p>\n<p>Farmland will score 5 Civilized points.</p>\n<p>Flowers will score 3 Nature points.</p>\n<p>An Evil Mountain will either turn into a Mine when it is directly next to a Village, or it will turn into a Beautiful Mountain.</p>\n<p>A Mine will score 5 Civilized point for each Village in a range of 3 or less hexes.</p>\n<p>A Beautiful Mountain will score 3 Nature points per living or dead forest directly next to it.</p>\n<p>Thank you! We hope you have as much fun playing as we had creating the game!<br/><br/></p>\n<p>Art by Inka McAtee<br/>Sound and Music by Deniz Erdogan<br/>Programming by Tobias Kiehnlein<br/>Game Design: Björn Loesing</p>", "metacritic": null, "released": "2020-11-22", "tba": false, "updated": "2020-11-23T03:46:16", "background_image": "https://media.rawg.io/media/screenshots/c26/c2685d086e45abf0066ffdd5044e3626.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 78, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Web"], "developers": ["Inka_McAtee", "KnotHorn Studio", "strudelkopf", "TobiasKiehnlein"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}