{"id": 52211, "slug": "orwell-ignorance-is-strength-season-2-deluxe", "name": "Orwell: Ignorance is Strength Season 2 Deluxe", "name_original": "Orwell: Ignorance is Strength Season 2 Deluxe", "description": "Orwell: Ignorance is Strength Season 2 Deluxe includes Orwell: Ignorance is Strength and Orwell: Ignorance Is Strength Original Soundtrack.\n<br/><br/>\nStep into the shoes of a government official in a top-secret department of the Orwell surveillance program. A political crisis has arisen across borders, threatening to plunge neighbouring Parges into violent civil unrest and embarrass the ruling Party of the Nation. Given the power to both uncover and fabricate \"the truth\", you must decide for yourself how far you will go in the service of your country and whether the truth is sacred or ignorance is strength.\n<br/><br/>\nOrwell: Ignorance is Strength is the second season of the award winning surveillance thriller - Orwell. It will release as a weekly episodic series and will introduce new mechanics and features to the series, providing players with greater agency to direct their investigation and even the power to use information they gather to influence public opinion. The story takes place in parallel to the events of the first season and reveals a darker, more secret side to the Orwell program.\n<br/><br/>\nOrwell: Ignorance is Strength Original Soundtrack\n<br/><br/>\nThis is the official soundtrack for Orwell: Ignorance is Strength, the second season of the award-winning surveillance thriller, Orwell.<br/>\n<br/>\nRELEASE SCHEDULE - 3 EPISODES OVER 5 WEEKS<br/>\nInspired by serialized drama, the game Orwell: Ignorance is Strength will be releasing as three bi-weekly episodes, starting February 22. \n<br/><br/>\nIn turn, the official soundtrack for Orwell: Ignorance is Strength will also release in the same episodic format, with the tracks featured in episodes becoming available with the release of each episode. We strongly encourage you to purchase the game and play the episodes as they become available, then download the full soundtrack at the release of episode 3.\n<br/><br/>\nIMPORTANT NOTE: Purchasing the soundtrack gets you the official soundtrack for the whole season. You do NOT need to buy the episodic tracks seperately and the full soundtrack will be available for download with the final episode.\n<br/><br/>\nRELEASE SCHEDULE:<br/>\nFor Orwell: Ignorance Is Strength OST there are three episodes and there will be two weeks in between each. \n<br/><br/>\nEpisode One: Thesis - 8am PST/5pm CET, Thursday February 22<br/>\n1. Tension<br/>\n2. Thesis\n<br/><br/>\nEpisode Two: Antithesis – 8am PST/5pm CET, Thursday March 8<br/>\n3. Antithesis\n<br/><br/>\nEpisode Three: Synthesis – 8am PST/5pm CET, Thursday March 22<br/>\n4. Synthesis<br/>\n5. Disintegration<br/>\n6. Credits\n<br/><br/>\nOrwell: Ignorance is Strength Official Soundtrack full track Listing:<br/>\n1. Tension<br/>\n2. Thesis<br/>\n3. Antithesis<br/>\n4. Synthesis<br/>\n5. Disintegration<br/>\n6. Credits<br/>\nOST produced by The Otherworld Agency<br/>\nComposed by feeding | ear", "metacritic": null, "released": "2018-02-21", "tba": false, "updated": "2019-07-25T20:57:50", "background_image": "https://media.rawg.io/media/screenshots/18f/18f4dfd84ad2d5a209d6bbbd345febe7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 242, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux", "macOS"], "developers": ["Osmotic Studios"], "genres": [], "publishers": ["Surprise Attack"], "esrb_rating": null}