{"id": 52210, "slug": "ancestors-legacy", "name": "Ancestors Legacy", "name_original": "Ancestors Legacy", "description": "<p>Pre-purchase now and receive free gifts:<br />\n- Official digital artbook</p>\n<ul>\n<li>Official digital soundtrack (composed by award-winning composers Adam Skorupa and Krzysztof Wierzynkiewicz)<br />\nDigital goods will be available once the full game is released on May 22nd, 2018!<br />\nTake command of your army as you storm through medieval Europe in an extensive series of campaigns. Choosing one of the four available nations – Viking, Anglo-Saxon, German, Slav – you will be tasked with more than just conquering, raiding and pillaging enemy camps, villages and towns. Only by utilizing the full range of available tactical options, taking strategic advantage of the environment, and managing your temporary bases and settlements, will you emerge victorious.<br />\nAncestors Legacy is a historically accurate real-time strategy game influenced by historical events in the Middle Ages. The game combines resource management and base building with large-scale, squad-based battles across vast battlefields, all rendered in great detail thanks to the Unreal Engine 4 tech. Experience medieval bloodshed like never before, thanks to the cinematic action camera that puts you right in the middle of the battle at the press of a button. 4 playable nations in an extensive single player campaign inspired by historical events<br />\nAdvanced tactical options combining the use of terrain, experience and morale<br />\nCinematic battle camera view puts you right in the center of the action<br />\nOutstanding visual fidelity powered by Unreal Engine 4<br />\nIntense multiplayer battles<br />\nStreamlined resource management and village construction<br />\nPrecise controls with native gamepad support</li>\n</ul>", "metacritic": 73, "released": "2018-05-22", "tba": false, "updated": "2024-02-04T22:09:26", "background_image": "https://media.rawg.io/media/games/132/132675908605cb67196ea2adc9a14b50.jpg", "website": "https://destructivecreations.pl/ancestors-legacy/", "rating": 3.74, "rating_top": 4, "added_by_status": {"yet": 27, "owned": 49, "beaten": 14, "toplay": 22, "dropped": 17, "playing": 1}, "playtime": 4, "achievements_count": 38, "ratings_count": 31, "suggestions_count": 703, "game_series_count": 0, "reviews_count": 34, "platforms": ["Xbox One", "PlayStation 4", "Nintendo Switch", "PC"], "developers": ["Destructive Creations"], "genres": ["Strategy"], "publishers": ["1C Company"], "esrb_rating": "Mature"}