{"id": 52221, "slug": "rbi-baseball-18", "name": "R.B.I. Baseball 18", "name_original": "R.B.I. Baseball 18", "description": "It's a whole new ballgame! R.B.I. Baseball 18 take a significant leap delivering all-new Franchise Mode, Home Run Derby Mode, redesigned player models, stunning MLB ballparks and UI presentation. \n\nAll-New Franchise Mode: Take control of your favorite MLB team! Make trades, pick up free agents or call up rookies through multiple seasons.\n\nHome Run Derby Mode: Challenge a friend or the CPU in the ultimate slugfest!\n\nAuthentic MLB Players: Completely redesigned player models including over 300 digitally modeled likenesses and hundreds of new animations \n\nBetter Ballparks: Experience enhanced lighting, textures, revamped 3-D crowd system and new dynamic camera angles in all 30 MLB ballparks.\n\nMLB Legends: Play as the greats with over 100 historic players\n\nOnline Multiplayer: Jump into ranked and friendly online exhibition games \n\nRoster Updates: Get the latest rosters throughout the 2018 season and use the new Import Rosters feature to keep your in-progress Franchise current without starting over!\n\n© 2018 MLB.com MLB Advanced Media, L.P. All Major League Baseball trademarks, service marks and copyrights used herein are the property of the applicable MLB entity. All rights reserved. OFFICIALLY LICENSED PRODUCT OF MAJOR LEAGUE BASEBALL PLAYERS ASSOCIATION-MLBPA trademarks and copyrighted works, including the MLBPA logo, and other intellectual property rights are owned and/or held by MLBPA and may not be used without MLBPA's written consent. Visit www.MLBPLAYERS.com, the Players Choice on the web.", "metacritic": null, "released": "2018-03-20", "tba": false, "updated": "2019-08-02T16:20:52", "background_image": "https://media.rawg.io/media/screenshots/dd5/dd52df0fe79e1f517d6ea40db36247c8.jpg", "website": "http://rbigame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "dropped": 1}, "playtime": 0, "achievements_count": 19, "ratings_count": 0, "suggestions_count": 282, "game_series_count": 0, "reviews_count": 0, "platforms": ["Xbox One", "PlayStation 4", "Nintendo Switch", "Android", "iOS"], "developers": ["MLB", "MLB Advanced Media, L.P.", "MLB.com"], "genres": ["Sports", "Arcade"], "publishers": ["Major League Baseball Advanced Media", "MLB Advanced Media"], "esrb_rating": null}