{"id": 522322, "slug": "treasures-of-a-slavers-kingdom", "name": "Treasures of a Slaver's Kingdom", "name_original": "Treasures of a Slaver's Kingdom", "description": "<p>In the cruel kingdoms north of the Viraxian Empire, a barbarian seeks treasure - and vengeance! Having escaped the clutches of the Slaver King, he has vowed to pillage the wealth of the kingdom ... then bring it to its knees. <strong>YOU </strong>are this barbarian. Weakened by your ordeal as a slave, wandering an unfamiliar realm filled with danger, you must use cunning, savagery, and something approximating English syntax to regain thy might, rally an army of friends to your cause, do repeated business with a Delicate Doxy, and <em>do deadly violence unto the Slaver King!</em><br/></p>\n<p>Fans of <strong><em>Encounter Critical</em></strong> rejoice! The long-lost classic of text-adventure gaming is restored at last to a glory it never knew! Thrill to the savagery of the Sky Piranha! Marvel at the pathos of a love-struck Frankenstein! Mutate from exposure to unmodulated phasic radiation! Wield a rune-carved peg-leg Dwarf in your hand, and <em>crush a wicked kingdom beneath your sandaled tread!</em></p>\r\nDownload and Play!\r\n<p>Mere words cannot contain a game made entirely of text! To understand the savage beauty of <strong><em>Treasures of a Slaver's Kingdom</em></strong>, it's best to just download it (below)! The download includes the game itself, plus the spiffy documentation and a folder full of extras (including yet more PDFs, an alternate all-in-one game file, and even a kind of kit for those in the mood to write a sequel)! <strong><em>ToaSK </em></strong>runs on virtually any modern device (Windows, Mac, Linux, iOS, Android and more) using the z-machine program of your choice (see below). Snag it, fire it up, and step into another chapter in the saga of <strong><em>Encounter Critical!</em></strong></p>\nGroove to the Mighty Z-Machine!\r\n<p><strong><em>ToaSK </em></strong>is a z-machine game (a format devised by Infocom for the <strong><em>Zork </em></strong>games back in the slightly more real 1970s). If you don't have a z-machine player installed,  click here for the free software you'll need to quest into the Slaver Kingdoms in a twisted (and sometimes very <em>naughty</em>) interactive <strong><em>EC</em></strong> adventure.</p>\r\nSome Specs and Details\r\n<p>Fair warning: if you consider yourself an IF enthusiast, you should just back away slowly, now, and forget this game exists. It <em>isn't for you,</em> and it responds dangerously to sudden movements. Never break eye contact until you're ready to run, then <em>run</em>, run like the wind, and don't look back!<strong><em> </em></strong>Really. But if you're the kind to ignore such warnings with a roguish grin, a swirl of your cloak, and a defiant bite into your slightly dry dinner roll, here's the basic rundown:</p>\n<ul><li><strong><em>ToaSK </em></strong>is a <em>polite </em>game on the usual IF \"cruelty scale.\" While you can certainly get killed (oh, <em>yes </em>indeed), it's impossible to get into any kind of stuck-state. If your barbarian is still breathing and not currently being shredded/burned/electrocuted/stepped on by a foe or dissolved in acid or whatever, you're good to go. Crucial objects cannot be destroyed or irrevocably discarded, vital NPCs cannot be accidentally skewered, and you can't get trapped anywhere that doesn't kill you quickly. If your arm falls off, that's part of the story, I promise.</li><li><strong><em>ToaSK </em></strong>is a <em>long-form</em> game. This isn't one of those dealies that can be played in an hour or less. This is a <em>lay-in-a-junk-food-supply and crank-up-some-tunes epic</em> of Encounter Criticalness. Final turn-count for most games will range from 1,250 to 2,500 or so, with an average of 20-25% of the turn-count relating in some way to the combat system, depending on options chosen and your play style. Reported playing times range from 6 to 15 total hours (if you go right for the hints, you could burn through it in less).</li><li>The game contains from 60-90 puzzles, depending on how you slice the definition, plus the mega-puzzle of the \"monster maze,\" which can be disabled with the WIMP command if you'd rather just kick ass with impunity. It includes a dozen or two substantial scenes, a cast of odd characters, and (including rooms and people) about 200 \"objects.\" There are 45 explorable locations, though \"explorable\" is a relative term ... The winning ending has several variables and variant versions (with the very-very-last bit coming in three different flavors of awesome).</li><li><strong><em>ToaSK </em></strong>is <em>not </em>a CRPG. This is a puzzle-based adventure game with a veneer of wargame elements (and all kinds of other veneer). If you're looking for a text-based CRPG, they're out there! But this one's just pretending.</li><li>This is an <em>ea</em>sy game and won't provide much challenge to hardcore lateral thinkers. The puzzles are heavily and redundantly clued (the more crucial the puzzle, the more frequent and solid the descending clue-stick) and the documentation includes a complete solution-set.</li><li>This game would be rated \"PG-13,\" most likely, for bawdy innuendo (double and even <em>triple</em>-entendres, plus some fade-to-black naughty scenes), lotsa fights, references to alcohol use, smoking, drinking, poetry-reading, limb-trading, naughty-sounding hat-styles (bycockets!) and more.<em> This is not a well-behaved game.</em></li><li><strong><em>ToaSK </em></strong>is now and forever freeware (having completed its planned three-year commercial run), but if you find yourself with a gnawing urge to throw money in my direction, poke through the rest of my offerings and maybe you'll find something else to buy!</li></ul>\n<p>Finally, and it's important to stress this: this is <strong><em>Encounter Critical</em></strong>, which means it's designed to be a very <em>good </em>game while providing a thrill-ride simulation of a very, <em>very </em>bad one. If that sounds like a stupid idea, well, yes. Yes it is. And if <em>that </em>sounds <em>great</em>: welcome, friend, to the world of <strong><em>EC</em></strong>.</p>", "metacritic": null, "released": "2020-11-22", "tba": false, "updated": "2020-11-23T04:55:23", "background_image": "https://media.rawg.io/media/screenshots/502/5022d66ddecff0aaea9adec4f2c2eaeb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 67, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Cumberland Games & Diversions"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}