{"id": 522454, "slug": "labyrinthians", "name": "Labyrinthians", "name_original": "Labyrinthians", "description": "<p>Under the great barrier city of Orello lies a vast Labyrinth... teeming with monsters of all kinds, great and small, kind and savage. Endemic to the Labyrinth these monsters dwell, and Orello was constructed on top of their homelands to keep them isolated from the rest of the world. </p>\n<p>And so the task of containing these monsters and exploring all the Labyrinth has to offer lies on the shoulders of Orello's citizens. The world stands on the edge of a time of astounding discovery and fearless development. It is time to take up the mantle.</p>\n\n<p>Crutch and Rinja are the Orellan Explorer's Guild's newest recruits. Guide them through the dangers of the Labyrinth, from D-rank explorers all the way to the famous S-rank. Traverse the Labyrinth's many layers, each with their own distinct aesthetics, ecosystems, and societies. </p>\n<p>Encounter Orello's six fabled champions, and see if they are really as heroic as the tales make them out to be. And above all, wonder: is it really good for humanity to explore this Labyrinth, or are the secrets you will uncover best left untouched?</p>\n<p>Labyrinthians is a turn-based rpg focused on exploration and story. The Labyrinth is vast and filled with all sorts of goodies.  The main story is linear but there are several branching side quests and stories to uncover, and plentiful amounts of secrets to unlock!<br/></p>\n<p>CURRENT VERSION: 1.0.0<br/></p>\n<p>Contains the first chapter and approx. 2 hrs 30 mins of gameplay!</p>\n<p>THIS GAME IS AN EARLY DEMO: EXPECT TO SEE SOME BUGS!<br/></p>\n<p>HOW TO DOWNLOAD: </p>\n<p>download the zip file and extract ALL files into a folder, then click on the the game.exe file and enjoy!</p>\n<p>This is my first RPG Maker game, I worked really hard on it! I will be updating as frequently as possible and that you like my little creation!</p>\n<p>Art, story, characters, mapping and coding by me, Kitty Rika! Other credits are located in a README file included with the game as well as in an ingame menu.</p>", "metacritic": null, "released": "2020-11-21", "tba": false, "updated": "2020-11-23T05:25:13", "background_image": "https://media.rawg.io/media/screenshots/900/900881f49ee7b4c836bd97c0c4753960.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 216, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kitty Rika"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}