{"id": 52249, "slug": "surviving-mars-edition-digital-deluxe-precommande", "name": "Surviving Mars - Édition Digital Deluxe - Précommande", "name_original": "Surviving Mars - Édition Digital Deluxe - Précommande", "description": "Précommandez dès aujourd'hui et recevez le “Stellaris Dome Set” et la bande sonore en bonus !\n\n<br/>\n<br/><br/>\nL'Édition Digital Deluxe de Surviving Marsfournit à vos ambitieux colons une pléthore de nouvelles méthodes pour personnaliser leurs nouveaux foyers et dômes. Le contenu exclusif de l'Édition Digital Deluxe contient :\n<br/><br/>\nL'ensemble de construction \"Metropolis\" <br/>\nSurvivez avec style grâce à cet ensemble de construction qui vous permettra de choisir des apparences chromatiques pour vos réservoirs à oxygène, châteaux d'eau, raffineries de carburant et plus encore.\n<br/><br/>\nStation de radio \"Quantum Sonics\" :<br/>\nUne station de radio en jeu supplémentaire avec de la musique et des conversations inédites, uniquement disponible avec cette édition.\n<br/><br/>\nDes apparences \"Onyx\" :<br/>\nTrois apparences alternatives sont disponibles pour vos bâtiments résidentiels afin d’ajouter du style et de l’élégance à vos colonies !\n<br/><br/>\nArt Book :<br/>\nUn Art Book de plus de 50 pages vous offre un aperçu détaillé du style artistique et de la conception de Surviving Mars.\n<br/><br/>\nAvatar de luxe et icône sur les forums Paradox.\n\n<br/><br/>\nWallpapers :<br/>\nUne superbe illustration de Surviving Mars pour décorer votre écran de bureau.\n<br/><br/>\nAussi disponible sur GOG.com :Surviving Mars - Édition First Colony<br/>\nAussi disponible sur GOG.com :Surviving Mars - Jeu de Base<br/>\n<br/><br/>\nColonisez Mars, dévoilez tous ses secrets, le tout avec un minimum de victimes !\n<br/><br/>\nBienvenue à la maison ! Le temps est venu de faire valoir vos droits sur la Planète rouge et de construire les premières colonies humaines fonctionnelles sur Mars ! Vous aurez simplement besoin de réserves d'oxygène, de dizaines d'années d'entraînement, d'une expérience préalable avec les tempêtes de sable et d'une attitude volontaire et enthousiaste pour découvrir la raison d'être de ces mystérieux cubes sombres qui sont apparus du néant. Après quelques travaux de rénovation, cet endroit promet d'être vraiment magnifique. \n<br/><br/>\nSurviving Mars est un jeu de gestion qui vous propose de coloniser Mars dans un univers de science-fiction et de survivre lors de cette périlleuse entreprise.\nChoisissez une agence spatiale pour bénéficier d'un soutien logistique et financier avant de déterminer l'emplacement de votre colonie. Bâtissez des dômes et des infrastructures, recherchez de nouvelles avancées technologiques et utilisez des drones pour débloquer de nouvelles méthodes pour modeler et développer votre colonie. Cultivez votre propre nourriture, extrayez du minerai ou détendez-vous tout simplement au bar après une journée de dur labeur. Mais gardez à l'esprit que l'objectif le plus important de tous reste de maintenir vos colons en vie. Ce qui ne sera pas chose facile sur une étrange nouvelle planète.\n<br/><br/>\nDe nombreux défis seront à surmonter. Élaborez et exécutez votre stratégie et améliorez les chances de survie de votre colonie tout en dévoilant les grands mystères de ce monde extraterrestre. Vous êtes préparés ? Mars n'attend plus que vous.\nConstruisez une colonie spatiale durable : Construire une colonie astucieuse et fonctionnelle sur une planète inapte à la vie humaine : voilà une mission qui vous confrontera à de nombreux défis. Une mauvaise planification n'engendrera pas de problèmes de circulation mais plutôt le décès de vos colons. Il n'est vraiment pas recommandé de se retrouver à court d'énergie dans une ville construite sur une planète sans source d'oxygène naturelle.\nColons simulés individuellement : Chaque colon est un individu unique avec ses propres qualités et problèmes qui influencent les besoins et le comportement des autres colons. Les choses peuvent très vite se compliquer si vos responsables scientifiques se retrouvent en proie à l'alcoolisme pour avoir passé de trop nombreuses nuits à travailler d'arrache-pied au labo.\nConstruction en dôme spatiaux futuristes : Des structures rétro-futuristes pour héberger les colons aux usines en passant par les bâtiments commerciaux, découvrez des infrastructures qui ont toutes leur propre \"personnalité de voisinage\". Créez des colonies qui placent la science au-dessus de tout le reste, pendant que des ouvriers exténués dilapident leur salaire dans l’alcool au bar du coin ou tentent d'atteindre l'utopie parmi les étoiles.\nExploration des secrets martiens : Inspiré par les grands classiques de la science-fiction comme Asimov et Clarke, Surviving Mars contient de nombreux secrets. À chaque partie, les joueurs pourront découvrir l'un des mystères inhérents de la planète Mars. Dévoiler ces secrets pourrait apporter d'immenses bénéfices à votre colonie ou peut-être la mener vers sa funeste perte.\nArbre de recherches aléatoire : Combinez des recherches statiques et aléatoires et de l'exploration pour vous permettre de vivre une expérience totalement différente à chacune de vos expéditions en jeu. Réalisez de nouvelles avancées scientifiques en partant à l'aventure dans les zones inexplorées de la surface de Mars.\nEsthétique rétro-futuriste unique en son genre : Une approche racée et moderne du futurisme optimiste et éclairé des années 1960. Une période taillée pour l'exploration et l'aventure.\nSupport des mods complet : Fabriquez vos propres et merveilleux bâtiments, parcs ou même un mystère à partager, grâce aux outils de modding simples d'utilisation et ultra complets de Surviving Mars. Partagez vos plus belles créations avec la communauté pour construire la société parfaite.", "metacritic": null, "released": "2018-03-14", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/680/6803452694dcb7a3b2546a181e1e0fb8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 2, "beaten": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 384, "game_series_count": 0, "reviews_count": 1, "platforms": ["Linux", "PC", "macOS"], "developers": ["Haemimont Games"], "genres": [], "publishers": ["Paradox Interactive"], "esrb_rating": null}