{"id": 52258, "slug": "shiny-a-robotic-adventure", "name": "SHINY - A Robotic Adventure", "name_original": "SHINY - A Robotic Adventure", "description": "Robots can have a heart!<br/><br/>Left to fend for himself after mankind abandoned the doomed planet Aurora, robot Kramer 227 must find a way to harvest energy and rescue his robotic friends before Aurora crashes into its sun. In his journey, Kramer will probe the planet itself and overcome challenging obstacles, while trying to conserve his limited life energy to power himself and his friends.<br/>Kramer will gather and share energy with his fellow robots, helping them escape dire situations and predicaments. He will have to jump and explore every platform in every corner of the 20 levels to find all of his friends. Energy is running low on Aurora, so Kramer will have to collect batteries or use generators to recharge, as every action drains his power. Various power-ups collected along the way, such as jetpacks, energy spheres and temperature regulators, can help him on this journey.<br/>Shiny is about saving lives, so it contains no blood or violence.<br/><br/>1 player<br/><br/>  Software subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.<br/><br/>“Garage 227 Studios” and “SHINY” are registered trademarks of Garage 227 Studios, inc. All rights reserved<br/><br/>'SHINY uses the Unreal® Engine. Unreal® is a trademark or registered trademark of Epic Games, Inc. in the United States of America and elsewhere'", "metacritic": null, "released": "2018-02-26", "tba": false, "updated": "2019-08-02T16:20:17", "background_image": "https://media.rawg.io/media/screenshots/6c5/6c5ac5257f95e7f672e279a989a59420.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 409, "game_series_count": 0, "reviews_count": 0, "platforms": ["PlayStation 4"], "developers": ["Garage 227 Studios"], "genres": ["Adventure"], "publishers": [], "esrb_rating": "Everyone 10+"}