{"id": 52278, "slug": "world-conqueror-x", "name": "World Conqueror X", "name_original": "World Conqueror X", "description": "<p>\n      This entry in the long-running series offers varied missions, with a \n      strong focus on history to add intrigue to each battle.\n    </p><p>\n      Across dozens of battles and multiple modes you manage a diverse range \n      of troops and military units in turn-based conflict, utilizing advanced \n      strategies such as air defenses, while always being mindful of \n      battlefield environments and cities. You can level up your HQ, capture \n      enemy strongholds and also strengthen your own cities, build landmarks \n      and gain access to powerful Generals. Battles take place on the ground, \n      at sea and in the air, requiring careful strategy for victory.\n    </p><p>\n      There are two main modes that combine to offer many hours of challenging \n      strategic warfare. Scenario Mode includes Axis and Allied missions from \n      WWII in Europe and in the Pacific, as you experience key historic \n      battles from both sides. There are 40 missions (plus tutorial stages) to \n      conquer.\n    </p><p>\n      You can also engage in Conquest Mode, choosing a starting point of 1939 \n      or 1943. Choose from over 20 countries and seek strategic and military \n      dominance over your foes.\n    </p><p>\n      Features:\n    </p><ul>\n<li>\n        Turn-based strategic warfare based around key events from World War II.\n      </li>\n<li>\n        Engage in historic battles from both the Allied and Axis perspective \n        in Scenario Mode, with 40 battles in total.\n      </li>\n<li>\n        Build your own wartime empire in Conquest Mode, choosing from over 20 \n        countries.\n      </li>\n<li>\n        Develop your HQ, earning access to powerful Generals and perks to turn \n        the tide of battle.\n      </li>\n<li>\n        Consider all aspects of strategy – ground units, air and sea battles, \n        establishing defenses and evolving your cities to boost your chances \n        of success.\n      </li>\n<li>\n        Utilise touch controls in handheld mode or use a controller for \n        portable, desktop or TV play.\n      </li>\n<li>\n        A Switch console exclusive.\n      </li>\n</ul>", "metacritic": null, "released": "2018-03-08", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/baf/bafeed6f5e1d5ef382fd9ba13a99172b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 271, "game_series_count": 0, "reviews_count": 0, "platforms": ["Nintendo Switch"], "developers": [], "genres": [], "publishers": ["CIRCLE Ent."], "esrb_rating": null}