{"id": 52279, "slug": "steredenn-binary-stars", "name": "Steredenn: Binary Stars", "name_original": "Steredenn: Binary Stars", "description": "<p>\n      Steredenn: Binary Stars is an award-winning mashup of a classic shmup \n      and a rogue-like, carved in big beautiful pixels, with insane boss \n      battles. Fly solo or co-op with a friend, fighting off the worst \n      scourges of space in a never-ending struggle for survival.\n    </p><p>\n      Steredenn: Binary Stars is the hugely expanded version of the acclaimed \n      Steredenn. Enjoy infinite replayability and unforgiving gameplay through \n      intense boss fights, (almost) randomly generated environments, twisted \n      space events and a massive arsenal of weapons.\n    </p><p>\n      Enhance your ship during your flight with upgrades aplenty, and forge \n      your own path across the universe!\n    </p><ul>\n<li>\n        QUICK, INTENSE SESSIONS: with rock-hard boss battles that'll keep you \n        coming back for \"just one more run\"\n      </li>\n<li>\n        INFINITE REPLAYABILITY: Endless arcade action, where levels are \n        (practically) randomly-generated.\n      </li>\n<li>\n        LOCAL COOP MODE: 2 ships, 4 weapons, 1 lifebar - test your friendships!\n      </li>\n<li>\n        5 PLAYABLE SHIPS: each with its own special ability and playstyle\n      </li>\n<li>\n        MIGHTY ARSENAL: 42 weapons and 30 upgrades with tons of customisation \n        options\n      </li>\n<li>\n        BOSS RUSH: fight a weekly selection of epic bosses and work your way \n        up the leaderboard\n      </li>\n<li>\n        DAILY RUN: Try to get to number one in a special daily leaderboard \n        where all players share the same run, guns and bosses. Be ready - you \n        only get one chance per day!\n      </li>\n<li>\n        ARENA: Unlock a boss by defeating it in the main game. Then, train \n        against it in a 1-on-1 duel. Your guns, your laws, your fight.\n      </li>\n<li>\n        THE ULTIMATE EDITION: Loads of new content, reworked balancing, \n        scoring, optimisation &amp; always more polish\n      </li>\n</ul>", "metacritic": null, "released": "2015-09-24", "tba": false, "updated": "2020-01-24T14:40:20", "background_image": "https://media.rawg.io/media/screenshots/ac1/ac1de18cbcc63afc816fba9c6ba74636.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "beaten": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 324, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "macOS", "Linux", "Nintendo Switch"], "developers": ["Pixelnest Studio", "Pixelnest"], "genres": ["Shooter"], "publishers": ["Plug In Digital"], "esrb_rating": null}