{"id": 522700, "slug": "floor-swooping", "name": "Floor Swooping", "name_original": "Floor Swooping", "description": "<p><strong>S T O R Y</strong></p>\n<p>The game follows a young floor sweeper named Will, or a janitor as they are more commonly known as. You, the player, live as a self aware embodiment of a consciousness. Being so all knowing and significantly bored, you get to choose how Will shall spend the worst possible night at the office building after being drowned in a sea of lies and finding out one of the workers there has been killed.</p>\n<p>It's up to Will now to either step aside... or become a true detective. Though the options don't lie in that specific choice, you're pretty sick and tired of this kid as it is.</p>\n<p><strong>N O T E S</strong></p>\n<p>All illustrations were created by me (Iris), the structure and gem-play were also designed by me. The overall story was co-written by me and Alfonso. Coding was also co-written by me and Alfonso. </p>\n<p><strong>Website for Assets:</strong> https://source-library-for-twine-game.webnode.com</p>\n<p><strong>F U T U R E   A I M S</strong></p>\n<ul><li>I want to make a more atmospheric experience than it is. Currently the project only has snippets of its true potential but I have to learn much more on how Twine works<ul><li>Add more sound effects when certain actions are done </li><li>Improve illustrations and add more </li></ul></li></ul>\n<ul><li>This story was intended to be short since it had to be played in 5 minutes. You can choose to explore for more or less but the overall experience was meant to be only 5 minutes. In the future I want to:<ul><li>Lengthen the detail of the story</li><li>Create better verbal puzzles</li><li>Have the scoring system rely on the player's perception <ul><li>I need to learn how to hide links or have only hover underlines. I want the player to genuinely experience a version of game-play rather than just reading different pages</li></ul></li></ul></li></ul>\n<p>I still have a long road to go but I believe this game was a great introduction to Twine and its capabilities. I hope in the future I will be able to better reach my goals and improve this experience.</p>", "metacritic": null, "released": "2020-11-20", "tba": false, "updated": "2020-11-23T06:21:12", "background_image": "https://media.rawg.io/media/screenshots/d88/d88496ad25ced87a203bdebe60cecd12.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 16, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["NoFaceCreep"], "genres": [], "publishers": [], "esrb_rating": null}