{"id": 522989, "slug": "guardian-chronicle", "name": "Guardian Chronicle", "name_original": "Guardian Chronicle", "description": "In Guardian Chronicle, you will be defending against a swarm of enemies by placing random guardians on a battlefield. <br/>You can present various strategies and tactics based on the combination of guardians you are using as each guardian has a unique skill. <br/>Defeat your opponent and claim victory with your personal set of guardians! <br/><br/><strong>■ Real-time Defence</strong> <br/>You can defeat enemies real-time through competing or co-operating with another player.<br/>Defeat more enemies through placing your guardians in the preferred locations and challenge the best by building a stronger deck with the rewards obtained from your victories. <br/><br/><strong>■ Competitive Mode </strong><br/>In a 1v1 competitive mode, you will be competing with another player to determine who survives against continuous waves of monsters. You can defeat the monsters in your battlefield and send them back to the opponent’s battlefield. <br/>You can advance to higher tiers and obtain more rewards to upgrade your deck. <br/><br/><strong> ■ Co-op Mode  </strong><br/>You and another player will be co-operating and facing waves of enemies during a co-op mode.<br/>Break your highest co-op record by defeating more monsters and surviving longer with your partner. <br/><br/><strong> ■ Your Personal Deck and Strategies </strong><br/>In Guardian Chronicle, your personal deck will be composed of five different guardians and one master. <br/>You can create your own strategies and tactics with a master, as a master can turn the tide of the battle with its powerful ability.", "metacritic": null, "released": "2020-11-25", "tba": false, "updated": "2022-10-19T06:30:35", "background_image": "https://media.rawg.io/media/screenshots/fdd/fdd1a4c4dd68c4b617e305239af96596.jpg", "website": "", "rating": 0.0, "rating_top": 4, "added_by_status": {"yet": 1, "owned": 97}, "playtime": 1, "achievements_count": 14, "ratings_count": 4, "suggestions_count": 191, "game_series_count": 0, "reviews_count": 5, "platforms": ["PC", "iOS"], "developers": ["LINE Games", "Pixelcruise"], "genres": ["Action", "Strategy", "Casual"], "publishers": ["LINE Games"], "esrb_rating": "Teen"}