{"id": 52291, "slug": "kidarian-adventures", "name": "Kidarian Adventures", "name_original": "Kidarian Adventures", "description": "Kidarian’s Adventures begin! Help the brave young Viking to save the wonderful world from dark magic. Slay ruthless monsters, overcome dangerous traps, reveal secrets and find the treasure of the vikings.<br/>Powerful weapons in Kidarian's hands will help overcome all obstacles. Use their strength and your skills and you will be able to win. <br/><br/>If you like classic arcades and old platformers, you will love this game. Kidarian Adventures has fun game mechanics and rich, beautiful graphics.<br/><br/>Kids and adults can play the game. You will take to an amazing world of adventure! If you have been looking for a great retro platformer for a long time, download this game right now and load it into the unforgettable story of Kidarian.<br/><br/>You have to not only run and jump on platforms, but also to find all the secrets, and to kick dangerous monsters. The main goal is to save the life of your hero, because the game is not as simple as it seems at first glance. Use magic potions, upgrade your skills, choose the best sword and new skin.<br/><br/>Kidarian Adventures Features: <br/>- Exciting action platform<br/>- The incredible world of adventure filled with danger<br/>- Insidious enemies at every turn<br/>- Battles with awesome bosses<br/>- Ability to customize the character<br/>- Colorful art and an excellent soundtrack<br/><br/>Start playing right now. This game is free and it will work wherever you will. Enjoy this platform game, because you can play without the Internet.", "metacritic": null, "released": "2018-02-27", "tba": false, "updated": "2019-10-22T14:30:58", "background_image": "https://media.rawg.io/media/screenshots/adc/adc50aefd03a1b7c7afd810de06a2ba5.jpg", "website": "https://www.hardslime.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 150, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Hard Slime"], "genres": ["Adventure", "Arcade"], "publishers": ["KHARD SLAIM, OOO"], "esrb_rating": "Everyone 10+"}