{"id": 522992, "slug": "starlite-defender-of-justice", "name": "STARLITE: Defender of Justice", "name_original": "STARLITE: Defender of Justice", "description": "XBOX 360/ONE or PS4 CONTROLLER REQUIRED TO PLAY GAME: (Press any button at START)<br/><br/><br/>STARLITE: DEFENDER OF JUSTICE<br/><br/>In the year 2170 an alien threat known as the CYRONS has invaded the planet Earth with intent of hostile takeover. Using Advance BIO-CHEMICALS they turned most human beings into mindless ZOMBIES. While the reminder of the Humans are being wiped out systemically by their advance machines and what appears to be \"Android Warriors\" with great strength.<br/><br/>The cops and the military were quick to fall...<br/><br/>So the worlds Governments formed an alliance. Sharing all of their resources they decide to create a new organization called STARLITE. These would be the best of the best soldiers fighting back with advance technology and new enhanced GENETIC ALTERNATIONS that made them stronger, faster and more adopt for a battle of this magnitude.<br/><br/>Now you are AGENT 69: Sent on a special mission to find the HEART of these aliens power source and take it out. You are... <br/><br/>STARLITE: DEFENDER OF JUSTICE<br/><br/><br/><br/>STYLE | DESIGN | AESTHETICS CHOICES:<br/><br/>STARLITE's visual style is influenced by many things. Everything from Andy Warhol to Ghost in the Shell, to the movie BACK TO THE FUTURE ||. STARLITE uses a mix of Anime based shaders with PBR shaders to create a sense of contrast and beauty. <br/><br/>I look forward to hearing all of your thoughts on the game and its visuals. Keep in mind the game is barley 20 % done as of this date 10 / 20 / 2020<br/><br/>GAMEPLAY:<br/><br/>This game is a hack and slash action game with shooter elements. It features a top down view and fast paced combat. There is still a lot for me to do and this is only the first level. I do apologize for the anti-climatic ending, again this game is early in development but I am very eager to hear all your thoughts on the game. This is the first time I have done early access and I think it might help me shape my game and make it even better with your HELP!<br/><br/><br/><br/>THANK YOU", "metacritic": null, "released": "2020-11-23", "tba": false, "updated": "2020-11-27T02:29:20", "background_image": "https://media.rawg.io/media/screenshots/9c0/9c089d7cffc7bab4046cbd2087893418.jpg", "website": "https://www.xcogames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 13}, "playtime": 0, "achievements_count": 13, "ratings_count": 0, "suggestions_count": 304, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Xcogames"], "genres": ["Action", "Adventure"], "publishers": ["Steam"], "esrb_rating": null}