{"id": 522982, "slug": "phoenix-point-year-one-edition", "name": "Phoenix Point: Year One Edition", "name_original": "Phoenix Point: Year One Edition", "description": "<p>Phoenix Point: Year One Edition is the definitive version of the acclaimed strategy game from the creator of X-COM, collecting all previously released DLC, updates, and additional content.</p>\n<p>The Earth has been overrun. A mutating, alien menace threatens the last remnants of mankind. Only the Phoenix Project, a secret organization of the best minds and bravest soldiers left on earth, can repel the aliens and reverse the inevitable. It&#39;s up to you to lead the Phoenix Project: research and develop new technologies, explore a ravaged globe, build your bases, manage resources, and dominate the battlefield.</p>\n<p>But you won&#39;t be alone. Factions, including the corporatist New Jericho, the indecisive Synedrion, and the fanatical Disciples of Anu, as well as offshoot subfactions, have their own values and view of the Pandorans. You can choose to work with factions via Phoenix Point&#39;s diplomacy system, or you can simply crush all around you with military might. No matter what you choose, it won&#39;t be an easy victory.</p>\n<p>Year One Edition Features:<br />\nTons of Content: The Year One edition of Phoenix Point includes all previously released content: 3 DLC Packs (Blood &amp; Titanium DLC, Legacy of the Ancients DLC, and the Living Weapons Pack) and a slew of updates, upgrades, fixes, and new content suggested by our community.</p>\n<p>Mutating Alien Menace: Face down an ever-changing alien threat that adapts to your tactics and offers no respite even as your team becomes more powerful and technologically advanced.</p>\n<p>Uncover the Secrets of the Pandoravirus: Engage with a complex narrative, complete with multiple endings that the player can only uncover via several playthroughs. Explore, research, and discover a secret history, as you learn about the origins of the mutants, the Pandoravirus, and Phoenix Point itself.</p>\n<p>Manage Diplomatic Relations: The Phoenix Project is not the only organization trying to reclaim the Earth. The militaristic New Jericho, the mystical Disciples of Anu, and the technophiles of Synedrion all offer unique rewards for co-operation and threats for opposition. It is up to you to decide how, or even if, to deal with them.</p>\n<p>Take Aim on the Battlefield: In addition to equipping and commanding units, Phoenix Point lets you take direct control of your soldier&#39;s shots in combat, with a unique free-aiming system. Target enemy weakspots, weapons, or valuables, or just go for center mass.</p>\n<p>Next-Gen Tech with Classic Pedigree: Phoenix Point was designed by Julian Gollop, the creator of the X-COM series in the 1990s. Integrating the core ethos of X-COM while updating the visuals, technology, and systems to modern standards has made Phoenix Point best-in-class.</p>", "metacritic": null, "released": "2020-12-03", "tba": false, "updated": "2023-12-11T20:31:18", "background_image": "https://media.rawg.io/media/games/1f9/1f9b4a079f9689db4874dd0a0a288451.jpg", "website": "https://phoenixpoint.info", "rating": 3.25, "rating_top": 4, "added_by_status": {"yet": 31, "owned": 384, "beaten": 8, "toplay": 26, "dropped": 5, "playing": 8}, "playtime": 4, "achievements_count": 44, "ratings_count": 16, "suggestions_count": 507, "game_series_count": 0, "reviews_count": 16, "platforms": ["macOS", "PC"], "developers": ["Snapshot Games"], "genres": ["RPG", "Strategy"], "publishers": ["Snapshot Games"], "esrb_rating": null}