{"id": 522987, "slug": "spinnys-journey", "name": "Spinny's Journey", "name_original": "Spinny's Journey", "description": "Tales of a Space Explorer and how he escaped from planet Earth<br/><br/>Spinny, an alien explorer, arrives on planet Earth. It is inhabited by a bipedal civilization whose architectural excellence is one of the most beautiful in the galaxy. Amazed, our hero wanders from city to city.<br/><br/>Spinny, although a skilled explorer, has mistakenly forgotten a small detail when coming to this planet. The world on Earth is gigantic compared to him: he is indeed not bigger than a peanut.<br/><br/>This error is costing him a lot of troubles. A terrifying sparrow attacks him and tears off several parts of his spaceship. After this incident, Spinny takes his emergency propellers and goes in search of lost parts of his spaceship in order to rebuild it.<br/><br/>Help Spinny to find his way through mazes, dodge traps and fix his spaceship to get back home.<br/><br/>Spinny's Journey is a challenging 2D action-puzzle game. You'll fly with his emergency propeller and search for the pieces to repair his spaceship.<br/><br/>The game will challenge your skills and resilience with its simple to learn and hard to master gameplay.<br/><ul><li>Explore exotic and beautiful places<br/></li><li>Fly your way through maze-like levels<br/></li><li>Avoid walls, traps and dangers from this world</li></ul><br/>The art of Spinny's Journey is bucolic, colourful and joyfully alive. Catchy and adventurous music will carry you on this journey. Every area will amaze you with its vibrant hand-drawn art.<br/><br/>Explore the world of Spinny's Journey for its ambience and challenges.<br/><br/><h3>Features</h3><ul><li>Challenging 2D action-puzzle game. <br/></li><li>Tightly tuned 2D controls. <br/></li><li>Explore exotic and beautiful places.<br/></li><li>Over 50 challenging levels.<br/></li><li>Collect 15 hidden pieces of ship.<br/></li><li>Try hard to get perfect on each level.<br/></li><li>Be the quickest and unlock 3 stars for each level.<br/></li><li>Colourful, joyful, vibrant hand-drawn art.</li></ul><br/>", "metacritic": null, "released": "2020-11-26", "tba": false, "updated": "2020-11-27T02:26:39", "background_image": "https://media.rawg.io/media/screenshots/f20/f20fbf5a88b2e7f2e207f7565bd4b072.jpg", "website": "https://www.spinnysjourney.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 117, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Thunder Sparrow"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["Thunder Sparrow"], "esrb_rating": null}