{"id": 523080, "slug": "rekt-crash-test", "name": "Rekt: Crash Test", "name_original": "Rekt: Crash Test", "description": "<p>REKT: Crash Test is a prologue to REKT: High Octane Stunts.<br />\nIt includes 2 arenas with unlimited features.<br />\n⚡️ SUMMARY ⚡️<br />\nREKT! is a stunt, driving game inspired by the eternal classics like Rush and Tony Hawk&#39;s Pro Skater series. In quick gameplay sessions, you will complete various challenges to unlock cars, arenas, and customizations.<br />\nDo outstanding tricks and stunts to get the highest scores and face other players - rule the leaderboard!<br />\nThe physics model in REKT makes performing tricks incredibly smooth and easy but don’t get too comfortable - it&#39;s easy to learn but hard to master.<br />\nOver 170 000 active players and GROWING.<br />\n⚡️ MASTER ALL TRICKS ⚡️<br />\nTake on the challenge and master the most awesome stunts: aerial flips, barrel rolls, loops, grinds, drifting and much more - combine them all and break your best scores!!<br />\n⚡️ CHALLENGES ⚡️<br />\nEvery time you enter the arena you will be given a set of challenges. Many variables can increase or decrease their difficulty creating an infinite amount of objectives, that will attract even the most seasoned players.<br />\nEndless tasks include checkpoint races exclusively designed for different arenas.<br />\n⚡️ SOLO RIDE ⚡️<br />\nPractice your stunts, unlock various cars and discover arenas in 2 singleplayer game modes:<br />\nHIGH SCORE: The main game mode, inspired by the old-school arcades, will allow you to take on the challenge of the global leaderboard - remember the time is running, although there are ways to extend it.<br />\nPRACTICE: Practice makes perfect, in this game mode, time does not matter, train as much as you wish - get prepared to #GETREKT<br />\n⚡️ MULTI RIDE ⚡️<br />\nFace the opponents in a local competitive mode (up to 4 players) and battle them on the way to the victory.<br />\nSCORE - challenge your competitors and get the highest score.<br />\nVIRUS - spread the infection by crashing into other players or avoid being infected - last car standing wins!<br />\nCHECKPOINT - first to hit a checkpoint gets a point - collect 5 points to win the race.<br />\nCAPTURE THE CROWN - you have 90 seconds to defend the crown - don’t let others take it over - or you won’t reign supreme in the arena.</p>", "metacritic": null, "released": "2020-12-03", "tba": false, "updated": "2022-08-24T22:33:03", "background_image": "https://media.rawg.io/media/screenshots/483/4832d07c4a473437665d384c3b4b6f85.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1, "toplay": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 114, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Little Chicken Game Company"], "genres": ["Action", "Sports", "Racing", "Casual", "Indie"], "publishers": ["No Gravity Games"], "esrb_rating": null}