{"id": 52308, "slug": "uvu-you-versus-universe", "name": "uVu - yoU versus Universe", "name_original": "uVu - yoU versus Universe", "description": "'Clicker meets Shmup! Keep on feeling everlasting \"I MADE IT!\"'<br/>Ingredients : Bullets, Lasers, Bombs, Blades, Shurikens, Rapid Fires, Clones, SpaceBugs, Bosses, Coins, Princesses!<br/><br/>\"uVu - yoU versus Universe\" is a  Growing Shoot'emUp with vast Incremental power Ups / size Ups / additional Weapons / time Extends, for iOS.<br/>The player controls the unbreakable fighter against the universe to save his homeland.<br/><br/>[FEATURES]<br/>- Incremental Upgrades : The player fighter grows up bigger and bigger<br/>- Procedural Level Generation: 1 Billion Universes<br/>- Race against other players: Daily Runs<br/>- Retro-Modern Art Style: Pixel Art Like Voxels, Chip tuned EDMs<br/>- Rhythm-Based Play: Bullets and Enemies and whole stuffs are on the Beat<br/>- Share: Post and Get Gifts via SNS<br/>- MFi Controller support<br/>- Localized in 15 languages: English, Arabic, Chinese Simplified, Chinese Traditional, French, German, Indonesian, Italian, Japanese, Korean, Portuguese, Russian, Spanish, Turkish, Vietnamese<br/><br/>[DETAILS]<br/>- Weapons<br/>Upgradable weapons are procedurally selected in each universe : <br/>[Tier1]  3-WAY and 5 - WAY = Shotgun,  PENETRATOR = Penetrating pulse laser, BLADE =Penetrating direction controllable cutting blade<br/>[Tier2]NOVA MISSILE = Slow big missile ,dealing big damage in large radius, COSMIC SWORD = Wide linear laser dealing enormous damage to enemies, VOID LAUNCHER = Generate void in space, dealing damage to enemies entering the damage radius<br/>[Tier3] HOMING RAY = Homing laser, HOMING BOMB = as the name says, SHURIKEN = Penetrating homing cutter<br/><br/>- Skills<br/>Skills are upgradable and give buffs to the fighter for some duration :<br/>HELLFIRE = Fast rapid fire, GIANT GROWTH = Increase the size of the fighter, SHADOW CLONE = Call a clone fighter fighting with you, SHARP SHOOTER = Increase the critical damage and chance, GOLD FINGER = Increase the earnings in game<br/><br/>- Stages<br/>Stages are from the ground into the outer space, where you can find your fellows. In some universes the homeland already has been destroyed and just find the vacant outer space and ghosts :<br/>Homeland, Burning Skyscraper, Stormy Mountains, Ridge of the snowy higher mountain, Calm Stratospheric sky, Dawnlike Mesospheric sky, Earth lit Thermosphere, Exosphere, Low Earth Orbit, Geostationary Orbit, and so on...<br/><br/>- Weapons for fellows<br/>The fellows in stages can equip weapons and fight with you :<br/>Handgun, Rifle, Anti material Rifle, Helicopter, Mini gun, Jet Fighter, Jet Bomber, High Altitude Airship, Rail gun, and so on.<br/><br/>- Fighter Hanger<br/>You can upgrade the fighter with earnings in play to unlock new skills, and also can purchase avatars of the fighter :<br/>3 fighter upgrades, 16 avatars = fighters like a propeller fighter and jet fighters, enemies like a butterfly and a spider,  fellows like office workers, space sharks of 4 kinds!", "metacritic": null, "released": "2018-03-07", "tba": false, "updated": "2019-10-22T14:30:58", "background_image": "https://media.rawg.io/media/screenshots/ba5/ba5e5b77e599f8cf6a5feabd30c25571.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 29, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ambrella Co"], "genres": ["Action", "Arcade"], "publishers": ["AMBRELLA CO"], "esrb_rating": "Everyone 10+"}