{"id": 523087, "slug": "pretty-girls-klondike-solitaire", "name": "Pretty Girls Klondike Solitaire", "name_original": "Pretty Girls Klondike Solitaire", "description": "Let's play some Klondike \"Solitaire\" with the girls from the \"Pretty Girls\" series!<br/>Play against 10 Pretty Girls each stage and dress them up in different outfits!<br/>Clear Solitaire and earn new costumes!<br/><br/><strong>■ Solitaire </strong><br/>Solitaire with Klondike rules.<br/>Move the cards in the field so that the numbers and colors alternate.<br/>See if you are able to arrange all the cards in order!<br/><br/><strong>■ The stage takes place at school! Challenge the girls and win! </strong><br/>There are 7 characters + 3 secret characters.<br/>As you clear the stage, a new costume will begin to reveal itself.<br/>All characters are voiced!<br/><br/><strong>■ Character introduction </strong><br/>・ AIRI MUTOH<br/>Very popular at school because she is playful and loved by everyone.<br/><br/>・ MAYU<br/>She is quiet and shy, she is very academic focused.<br/><br/>・ NAGISA HAYAMA<br/>A perfect student, who can excel at studying as well as playing sports. She is loved by all students.<br/><br/>・ SERIKA SHIINA<br/>A student with the highest grades and is also the Director of the Literature Department. She is a quiet girl who is inclusive to those around her.<br/><br/>・ SHIORI SHINOTO<br/>She is a strong speaker and knows a lot about class subjects and school personnel.<br/><br/>・ SENA<br/>An honor student who is also really good at playing sports.<br/><br/>・ HONOKA<br/>A bright and innocent girl. She is admired as an idol of the school.<br/><br/>In addition, there are three hidden characters ...! ??<br/><br/>※All characters in this game are over the age of 18.<br/>※This is a puzzle game with sexy characters (no nudity). Characters and character images used under license from their respective owners.", "metacritic": null, "released": "2020-11-23", "tba": false, "updated": "2022-09-17T05:55:10", "background_image": "https://media.rawg.io/media/screenshots/078/078f2c79a600ca27dcee852ef2428fad.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 11, "beaten": 2}, "playtime": 0, "achievements_count": 26, "ratings_count": 2, "suggestions_count": 279, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Zoo"], "genres": ["Casual"], "publishers": ["Zoo"], "esrb_rating": null}