{"id": 523035, "slug": "son-savasci", "name": "Son Savaşçı", "name_original": "Son Savaşçı", "description": "For the first time in 2D games, we performed completely in Turkish. We wanted to make you experience the past Atari period again. We are proud to start a brand new era in the gaming world, and this is just the beginning. The Last Warrior game will connect you to the game in a great way with its gameplay and in-game story. We will be looking forward to your comments, support, suggestions, criticism and feedback. With your support and help, we will offer much better games to your liking.<br/>\r\nAll you have to do is just log in to the game and enjoy the game. What are you waiting for?<br/>\r\nGet your character and start saving the world now. Because this is just the beginning.<br/>\n<br/>\r\nSTORY<br/>\r\nSome parts of the world are taken over by unknown forces. Huge explosion occurs in New York. While people try to understand what is happening in a state of great fear and panic, they also seek a savior for themselves. World Protection Organization leader Colonel Rossveild immediately orders Hope Connor to be summoned. Hope Connor, the woman she loves, Agent Aidan and Colonel Rossveild embark on a spectacular operation to save New York. In this operation, Hope Connor encounters people she did not expect, things she did not expect happen to her, and she is left with a great betrayal from someone very close. But in this world, unfortunately, good people do not always win ...<br/>\n<br/>\r\nSECTIONS<br/>\r\nChapter -1 - Meet the Enemy<br/>\r\nChapter -2- Kill Vito<br/>\r\nChapter -3- Mountaineer in Suit<br/>\r\nChapter -4- Skirts of the Mountain<br/>\r\nChapter -5- When It's Over<br/>\r\nChapter -6- Save yourself<br/>\r\nChapter -7- Pig Hunt<br/>\r\nChapter -8- Good People Do Not Win (FINAL)", "metacritic": null, "released": "2020-11-18", "tba": false, "updated": "2020-11-27T02:55:49", "background_image": "https://media.rawg.io/media/screenshots/1e9/1e9cf9b2b694f410cd404e25d851cea3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 141, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Narut Studio's", "Umut Haznedar"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["Umut Haznedar"], "esrb_rating": null}