{"id": 523170, "slug": "the-beardless-wizard", "name": "The Beardless Wizard", "name_original": "The Beardless Wizard", "description": "An evil scientist has kidnapped a kind, old wizard! As the magician's young apprentice, you might not have a beard, but don't let that stop you from saving his wrinkled skin!<br/><br/>Guide the dewy-eyed Eugene on an epic quest to save his master and stop the wicked Oyzo. Time will be of the essence as you travel through a magical land and complete quests for the many amusing characters you meet along the way, as the faster you work, the greater your reward will be! The challenges you face won't be easy, but your ability to turn into a giant stone golem, a dragon, or a ghost will give you the edge you need! In an exciting new twist for time management games, you'll be able to level up each character and give them the skills you choose, allowing you to build, harvest, and repair more efficiently.<br/><br/>The journey will be fraught with obstacles but also filled with laughs. Take the most important step now: get The Beardless Wizard and begin your next great adventure today!<br/><br/><br/><ul><li>Collect magic artifacts and brew potions!<br/></li><li>Become a golem, a dragon, or a ghost - you choose!<br/></li><li>Dozens of achievements to earn and secrets to reveal!<br/></li><li>Improve your heroes and become the most powerful wizard of all!<br/></li><li>Over 100 levels to beat - a true challenge for any wizard!</li></ul>", "metacritic": null, "released": "2020-11-26", "tba": false, "updated": "2020-11-27T04:14:03", "background_image": "https://media.rawg.io/media/screenshots/b2a/b2a70e0fc9b390f78bfa0cd360646a2c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 7, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 315, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Alawar North"], "genres": ["Strategy", "Simulation", "Casual", "Indie"], "publishers": ["Buka Entertainment", "Alawar Entertainment"], "esrb_rating": null}