{"id": 523143, "slug": "bloody-sand-the-gods-of-assyria", "name": "Bloody Sand: The Gods Of Assyria", "name_original": "Bloody Sand: The Gods Of Assyria", "description": "Mesopotamia / the Assyrian and Babylonian empires, 780 B.c.<br/><br/>Adonis and the Betrayal of Semiramis: Adonis is a brave slave who took his freedom to duel with other slaves. And he seeks to kill the person who killed his family<br/>Bloody Sand The Gods Of Assyria :Contains story mode with long hours of play with many combat systems. The game centers on an emotional story between Semiramis, Adonis and the Assyrian king<br/>And the events of gameplay in the Babylonian and Assyrian empires in the year 780 BC<br/>With all new graphics and technologies to bring out even the smallest of details at its best, Bloody sand for PC makes full use of the power of the PC to enliven every corner of this huge, Improved reflections and deeper, higher resolution shadows at all distances; Trees mosaic textures and improved turf and fur textures for added realism in every tress and building.<br/>-------<br/>Character:<br/>Adonis a slave who was born in the year 800 BC. Who was a slave fighting for freedom and the search for who killed his family<br/>Adonis has the courage to fight with the axe and the boxing , and he also has the advantage of throwing the axe<br/>and also an advantage of rage in combat<br/><br/><br/>-------<br/>World of Mesopotamia :<br/>The game world represents the great Assyrian and Babylonian Empire in 780-778 BC with high visual resolution and immersive art.<br/>Mesopotamia is a very diverse land full of different terrain.<br/>Apart from the beautiful natural landscapes, the world will be rich in many historical monuments and architecture.<br/>", "metacritic": null, "released": "2020-11-25", "tba": false, "updated": "2020-11-27T03:57:53", "background_image": "https://media.rawg.io/media/screenshots/fb9/fb919a95772be9212899a8e24942229f.jpg", "website": "https://goldenrockgames.weebly.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 430, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Golden Rock Games Team"], "genres": ["Action", "Adventure"], "publishers": ["GOLDEN ROCK GAMES"], "esrb_rating": "Mature"}