{"id": 523110, "slug": "kaverini-nuuk-adventures", "name": "Kaverini Nuuk Adventures", "name_original": "Kaverini Nuuk Adventures", "description": "Welcome to Nuuk, the capital of Greenland! Design or choose your own character and immerse yourself as a tourist in a fanciful cartoon RPG depiction of a legendary Arctic city! <br/>\n<br/>\r\nExplore the ice sheet, boating trips and the fjord alongside shopping malls, nightclubs, bars and museums! <br/>\n<br/>\r\nGet drawn into a plot that places YOU as one of the most pivotal revolutionaries in the history of the world! <br/>\n<br/>\r\nYou may encounter foes of all sorts, be they sentient machines, rebellious foods, the occasional frustrated tourist, a frightened animal, or even the elements themselves, but never fear! Your emotional intelligence can disarm them all with no guns or sticks required! <br/>\n<br/>\r\nPlay as ANY character you'd like! Hop into the game files and draw the tourist of your dreams!<br/>\n<br/>\r\nLevel up your character with emotional techniques! Thirteen different emotions, plus a custom technique you can name whatever you want! <br/>\n<br/>\r\nDefeat bad guys non-violently by determining which emotional techniques would work best against them!<br/>\n<br/>\r\nExplore real-life places in Nuuk, Greenland re-imagined in a nostalgic game world! <br/>\n<br/>\r\nLearn about Greenland, its culture and its history by talking to as many characters as you can! <br/>\n<br/>\r\nAll information in this game is verified by native Greenlanders! <br/>\n<br/>\r\nAdopt an arctic pet to help you on your journey!<br/>\n<br/>\r\nJoin forces with mythical and historical figures of Greenland! <br/>\n<br/>\r\nAvailable to play in English, Danish or Greenlandic!", "metacritic": null, "released": "2020-11-24", "tba": false, "updated": "2020-11-27T03:36:46", "background_image": "https://media.rawg.io/media/screenshots/be7/be766f9092b49f35828c7a3f7f552d4a.jpg", "website": "http://jaredgimbel.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 85, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Jared Gimbel", "Kaverini Korp"], "genres": ["RPG"], "publishers": ["Kaverini Korp"], "esrb_rating": null}