{"id": 523104, "slug": "football-manager-2021-touch", "name": "Football Manager 2021 Touch", "name_original": "Football Manager 2021 Touch", "description": "Although you are trading a little depth for speed, Touch still packs the finesse and quality of the full simulation experience. <br/>\n<br/>\r\nAll the top leagues and nations are included from around the globe and your player recruitment is powered by the world’s biggest player database, which features more than 500,000 active real-life players.<br/>\n<br/>\r\nTactical presets prime you for success and feature the most popular formations from around the world of football. For more control and personalization, there’s also a custom setting for you to stamp your individual style and preference. <br/>\n<br/>\r\nOn Match Days you can enjoy the action from the touchline or completely avoid the action by simulating your result and skipping the highlights. Smashing through the seasons lets you focus your time on buying superstars and unearthing wonderkids - and there are thousands to be found. By accelerating your progress, you also won’t have to wait too long to watch your youngsters become elite. <br/>\n<br/>\r\nChallenge Mode offers an even more casual approach to proceedings with various ready-made trials and experiments. Aim to finish the season unbeaten, see off an injury crisis or battle the odds and avoid relegation over the last few games of the season. <br/>\n<br/>\r\nLicensing updates, new features and game upgrades will all be revealed in November across the Football Manager social media channels, so get following to get ahead of the game.", "metacritic": null, "released": null, "tba": false, "updated": "2023-11-01T18:51:18", "background_image": "https://media.rawg.io/media/screenshots/dd0/dd02a29d85b1a8cdbfce4e3630517b39.jpg", "website": "http://www.footballmanager.com/", "rating": 2.88, "rating_top": 3, "added_by_status": {"yet": 7, "owned": 176, "beaten": 3, "dropped": 3, "playing": 1}, "playtime": 2, "achievements_count": 94, "ratings_count": 8, "suggestions_count": 35, "game_series_count": 0, "reviews_count": 8, "platforms": ["PC", "macOS"], "developers": ["Sports Interactive"], "genres": ["Simulation", "Sports"], "publishers": ["SEGA"], "esrb_rating": null}