{"id": 523122, "slug": "pray-in-vr-medieval-christian-churches", "name": "Pray in VR Medieval Christian Churches", "name_original": "Pray in VR Medieval Christian Churches", "description": "Traveling around the world, those religious buildings with great historical and artistic value are the must choice for tourists. What's interesting is that European churches often tower in downtown and can be seen almost everywhere. The architectural details of European churches indicate the opposition between the heavens and the earth. When visiting European churches, the most impressive and unforgettable thing is the beauty of their architecture. Famous churches such as St. Peter’s Basilica in the Vatican, St. Mark’s Basilica in Venice, Stefan Cathedral in Vienna, Notre Dame Cathedral and Cologne Cathedral enjoy high status in the history of world architecture. They are magnificent and stalwart. They are the epitome of the history, culture and art of European countries, and they are the witness of the rise and fall of countries.<br/><br/><br/>The Cologne Cathedral in Germany is a monument of European Gothic architecture. Its most unique features are its complex minarets and dazzling stained glass windows. The steeple on top of the church is lined with spires, looking from a distance like a towering stone forest, piercing the sky. Stepping into the church, it feels like stepping into the deep and vast sky. The huge column supports the huge arched dome, expanding a vast and lofty space like a fairyland. When you stand in the center of the 50-meter-high hall and look around, you will find that there are almost no walls between the tall wall pillars but only the same tall windows. The windows with a total area of ​​more than 10,000 square meters are all inlaid with stained glass, which is colorful under the reflection of the sun, and people are like walking into a giant kaleidoscope. The stained glass depicts all the characters and scenes in the \"Bible\" story. Each picture is so vivid and vivid, as if it will jump out of the picture and come to you at any time, giving people the feeling of entering a heavenly holy realm.<br/><br/><br/>There are two main forms of church buildings in the Middle Ages: the one that appeared earlier is called the \"Romanesque\", which evolved from the earlier \"Basilica\", and its appearance resembled the castle of a feudal lord with its strong, honest, and The unbreakable image shows the authority of the church, such as the church of Pisa in Italy. The latter is called \"Gothic\", its form is lighter and more decorative than \"Romanesque\". It adopts many sagittal scroll structures and minaret-style decorations. It towers into the sky and is close to God. Feel, control people's spiritual feelings. Such as Milan Cathedral in Italy and Notre Dame Cathedral in France.<br/><br/>Medieval art is basically religious art, and the main place for religious activities is church. The Archbishop of Constantinople Karlmas once said that \"the church is the earthly heaven, where the gods live and live\". In this historical period, church architecture and fine arts were integrated and became the highest representative of Christian fine arts.<br/><br/><br/>European churches in the Middle Ages are highly unified and integrated with architectural structure and decorative art effects. They have practical and symbolic significance. They serve the purpose of preaching Christian doctrines. They can more deeply control and anaesthetize the thoughts and feelings of believers, and make people deter religious Under theocratic power, be an obedient \"subject of God.\" The early church building was developed on the traditional Basilican building, which is rectangular with columns and cloisters around. However, the hundreds of millions of sincere hearts and wisdom that the people dedicated to the church were prominently reflected in the Romanesque and Gothic architectural art they created.<br/>Christian art is mainly manifested in the decoration of church buildings. Because the church is the only place of activity for Christianity, from the architectural style of the church, the decorations such as sculptures, murals, mosaic paintings, and glass window paintings inside and outside the church have the function of preaching and explaining the teachings.<br/><br/>……It is a casual VR game with scene experience. It is divided into 6 mini games. You can enjoy these games at will; in the game, you can see long corridors and rusty iron doors. Burning candles brought a glimmer of light to the dim church; skeletons on the floor, spider webs in the corners, and coffins invisibly presented the church in a gloomy atmosphere. In this world, you can't see a person, as if the whole world is only you. But this does not prevent you from exploring it. According to the objects and buildings on the scene, you can still see its former glory.<br/><br/><br/>Our game allows you to learn more about the development of medieval churches. The game uses realistic Unity3D models and uses models to build medieval church architectural scenes. We also carefully equip each different scene with background music. You bring a VR headset to experience, as if traveling back to the middle ages through time and space. Bring you an extraordinary gaming experience.", "metacritic": null, "released": "2020-11-25", "tba": false, "updated": "2020-11-27T03:43:32", "background_image": "https://media.rawg.io/media/screenshots/0f4/0f4933de326599e2dbd1b5007fa98452.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 187, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["William at Oxford"], "genres": ["Casual"], "publishers": ["William at Oxford"], "esrb_rating": null}