{"id": 523118, "slug": "diary-of-lucie", "name": "Diary of Lucie", "name_original": "Diary of Lucie", "description": "Diary of Lucie is action-roguelite game made with RPG Maker.<br/>In addition to simply avoiding the enemy's barrage, strategically use the enemy's bullet to make the battle situation advantageous!<br/><br/>In Roguelike mode, Lucie can get 2 types of weapons, 4 types of skills, and abilities with various special effects.<br/>Choose the right weapon for you. A bow with high utility from a distance, a sword with a quick melee combo ability, or a wand specializing in magic attacks may be good for you.<br/>Every skills has a place to use. Combine your skills as effectively as possible to create a playstyle that suits you.<h3> Features of the game</h3> -Hard Difficulty: Diary of Lucie is basically designed with Hard difficulty. At first, you will die soon, but you will see yourself and Lucie getting stronger and stronger.<br/><br/> -Roguelite: Each time, skills, items, and enemies are all randomly generated.<br/>Strategically take care of what you need as quickly as possible. If you're lucky, you can even get a powerful weapon and start from the beginning.<br/>Of course you will die soon, but don't be disappointed As you die, your experience and Lucie's abilities will increase more and more!<br/> <br/> -Each weapon has its own unique playstyle: Every weapon has its own special ability. Sometimes, depending on the enchantment, the performance may change completely.<br/><br/> -Various skill combinations: Skills are acquired at random each time, but you can also choose strategically to farm. Combine various skills effectively.<br/><br/> -Cute character motion: Enjoy smooth motion and various dot-graphic motions.<br/><br/> -Hidden Story: Don't give up on the challenge! As you progress through Roguelike mode, the story between Lucie's past and the characters will naturally reveal little by little.", "metacritic": null, "released": "2020-11-25", "tba": false, "updated": "2020-11-27T03:41:28", "background_image": "https://media.rawg.io/media/screenshots/bdf/bdfef288d2017173a7338d8f7a04ec6d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 375, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Parange Project"], "genres": ["Action", "Adventure", "Strategy", "Indie"], "publishers": ["Parange Project"], "esrb_rating": null}