{"id": 523297, "slug": "monster-masher", "name": "Monster Masher", "name_original": "Monster Masher", "description": "<p>This is <strong><em>Monster Masher</em></strong>, a small game about mashing Monsters together to get new ones! This is a super small project, so we'll see if anything comes of it, but there are a few things you can do in the current build. <br/></p>\n<p><strong>CONTROLS:</strong><br/></p>\n<strong>Right Mouse:</strong><br/><em>Using Right Mouse on Monsters will <strong>Select</strong> or <strong>De-Select</strong> them. Selected Monsters can be given items/fed, and fused with non-selected monsters; if a Monster is selected, an indicator will appear above it, and you won't be able to drag the Monster with Left Mouse until it is de-selected. Multiple Monsters can be selected at once.</em>\n<strong>Left Mouse: </strong><br/><em>Used to drag <strong>Items</strong> from the two bins in the bottom right of the screen, and<strong> Monsters</strong> from the door in the bottom left. Dragging monsters back into the door removes them, and dragging items into the trashcan beside the door will similarly destroy the items.<br/></em>\n<em>Using Left Mouse on selected Monsters will check their <strong>Status</strong>. Monsters must be fed meat and kept entertained with items, or else they will eventually become unhappy and run away.</em>\n<p><strong>OTHER NOTES:<br/></strong></p>\n<strong>Feeding:<br/></strong><em>Monsters will often grow <strong>Hungry</strong></em><em> if left without food. Giving Monsters <strong>Meat </strong>will reduce their hunger. However, giving Monsters too much food will make them sick. If a Monster becomes sick from overeating, giving them <strong>Medicine</strong> will restore them. Using non-food items on Monsters will often make them hungry, but will also make them happy, and potentially do other things...<br/></em>\n<strong>Happiness:<br/></strong><em>Giving Monsters <strong>Items</strong> will often make them <strong>Happy</strong>.</em><em> Balls, Balloons, and Dumbells will increase a Monster's happiness. If a Monster is sick, tired, or hungry, they will slowly become unhappy. When a Monster's happiness runs out, they will run away, leaving a note behind. Checking a selected Monster's <strong>Status</strong> is a good way to see how happy/hungry they are at a given time.<br/></em>\n<strong>Fusing:<br/></strong><em><strong>Selected</strong> Monsters</em><em> can sometimes <strong>Fuse</strong> with other Monsters by dragging other Monsters into them. Fusions make the resulting Monster happier, and may raise their <strong>Rarity</strong> value. They also create different, normally unobtainable Monsters; try to see how many you can discover!</em>\n<strong>Rarity:</strong><em>Monsters are generated with a defined <strong>Rarity</strong> value, which is indicated by their appearance. Rarer Monsters can shine, may appear golden, or have shift between colors. Taking <strong>Medicine</strong> may increase a Monster's rarity, as will fusing it with other Monsters, or Monsters of the same type.</em>", "metacritic": null, "released": "2020-11-26", "tba": false, "updated": "2020-11-27T04:55:20", "background_image": "https://media.rawg.io/media/screenshots/0dc/0dc602fdf96b5dd0b27b762c361695ce.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 25, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Linker"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}