{"id": 52337, "slug": "thems-fightin-herds", "name": "Them's Fightin' Herds", "name_original": "Them's Fightin' Herds", "description": "As an additional thank you to Skullgirls and their playerbase for supporting us by letting us use the Z-engine via their crowdfund goals, owners of Skullgirls on Steam get an additional discount when purchasing the game. THANK YOU SO MUCH!<br />\nThe full main story will be delivered (FOR FREE) in regularly released episodes after Full release launch, focusing mostly on one character each, along with many unique unlockables, target mode courses and hidden fight scenarios.GAME FEATURESVisual Pixel Lobby: Online multiplayer lobby system uses the same style of overworld as Story Mode to allow all players to explore (read: goof around in) locations within the world of Foenum with other players. Customize your avatar with cosmetic items you collect through Story Mode AND Multiplayer PVP/PVE gameplay!<br />\nDynamic Music System: Rockin’ character themes that adapt in the heat of the battle makes every fight a treat to the players AND the spectators.<br />\nGGPO powered netplay for the smoothest possible fighting game experience.<br />\nMore fighters are on the way, introducing more playstyles to the roster! Each fighter DLC release will include additional unlockable cosmetics, modes and character specific story mode expansions.<br />\n4-button Fighting: A-Light, B-Medium, C-Heavy, D-Magic.<br />\nMagic System: Emphasize your character’s special abilities through a dedicated button and a unique resource.<br />\nJuggle Decay: Opponents become gradually heavier during a combo, but ONLY after the juggle decay bar is filled. This manages combo length without imposing a hard limit. In addition, filling the juggle decay bar prevents standing infinites by removing the opponent&#39;s ability to remain standing for the rest of that combo.<br />\nEnhanced Super Attack: Spend an additional meter to add utility to your main super attack with effects that stay true to the characters’ unique personalities and talents!</p>", "metacritic": 82, "released": "2020-04-30", "tba": false, "updated": "2024-04-01T18:29:21", "background_image": "https://media.rawg.io/media/games/cc8/cc851f5962b7e3a07ec6ae76d61c82cc.jpg", "website": "http://themsfightinherds.com/", "rating": 3.38, "rating_top": 4, "added_by_status": {"yet": 76, "owned": 628, "beaten": 6, "toplay": 15, "dropped": 26, "playing": 4}, "playtime": 2, "achievements_count": 52, "ratings_count": 39, "suggestions_count": 289, "game_series_count": 0, "reviews_count": 42, "platforms": ["Linux", "macOS", "PC", "Nintendo Switch", "Xbox Series S/X", "Xbox One", "PlayStation 4", "PlayStation 5"], "developers": ["Mane6"], "genres": ["Action", "Fighting", "Indie"], "publishers": ["Humble Bundle", "Mane6"], "esrb_rating": null}