{"id": 523546, "slug": "hypnagogia-cui-mian-shu", "name": "hypnagogia 催眠術", "name_original": "hypnagogia 催眠術", "description": "<em>Hypnagogia</em> is an exploration in themes involving deep dreams, liminal spaces, sleep paralysis demons, and much more. Can you collect all 8 dream crystals and finally wake up?\r\n\n<p>Influenced by the nostalgia-fueled polygonal games from the mid and late 90's, <em>Hypnagogia </em>takes players on a short but intriguing journey through various worlds inspired by real dreams. </p>\n\n<p>Hang out with cats in a relaxing garden temple, mingle with sea creatures in an underwater quarry, or find meaning in a city full of strange people. Everyone has something to say, so meet and greet with every denizen you can!</p>\n\n<p>Each hand-crafted and detailed environment has been amalgamated from different dream journal recordings over the years, with entries used by both the dev and some users on the LSD Revamped Discord channel. </p>\n\n<em>When dreams turn to nightmares, will you overcome the challenge of returning to reality?</em>\n\n<p>If you enjoy this game, check out more from this dev below! There's also a comprehensive commentary file within the game folder if you're interested in knowing the origins of each dream.</p>\n<p>Descension - a Quake-inspired procedurally-generated FPS</p>\n<p>Infectoid - a Metroidvania adventure through a computer</p>\n<p><em>KNOWN BUGS/ISSUES</em></p>\n<ul><li>Mouse/controller sensitivity does not save between areas.</li><li>There's a possibility any one of the quest givers/npcs may bug out, resulting in not being able to complete the dream. If this happens, leave and reenter through the dream hub.</li><li>There is no way to save progress in the game currently.</li><li>I don't have plans on building for any platform besides Windows currently. My apologies in advance, but I don't have any way to test those builds and would rather ensure a cleaner experience.</li></ul>", "metacritic": null, "released": "2020-11-25", "tba": false, "updated": "2022-08-08T12:42:16", "background_image": "https://media.rawg.io/media/screenshots/482/482347dd57c736d0e2274aea6658a57f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 1, "beaten": 2, "toplay": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 244, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["sodaraptor"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}