{"id": 52354, "slug": "lost-in-the-dungeon", "name": "Lost in the Dungeon", "name_original": "Lost in the Dungeon", "description": "Lost in the Dungeon is a dungeon crawler based on a card system. <br/><br/>The goal of the player is surviving to a series of increasingly hard dungeons thus being rewarded with the loot they need to get stronger and stronger.<br/>What characterizes the game is a combat system as much original as simple and intuitive without loosing in deep and strategy.<br/>The core feature of the game is an original yet simple and intuitive combat system that maintains depth and strategy.<br/><br/>Risk is always behind the corner, will you escape with the loot or adventure deeper in the dungeon?Features<ul><li>Original gameplay that mixes card games combat with RPG character growth and dungeon crawlers mechanics<br/></li><li>High character customization based on classes (warrior, mage, rogue, and more to come), skills, equipment<br/></li><li>Everything from cards illustrations to user interface is beautifully hand drawn in an evocative fantasy style<br/></li><li>A journey in which you are always between the chance to get epic loot and the risk of losing it</li></ul><strong>DIFFICULTY SCALING SYSTEM</strong><br/><br/><br/>Every Dungeon is harder than the one before, each level will become more intense, will you be able to keep up and defeat the final bosses?<strong>WILL YOU ADVANCED AND INCREASE THE REWARD OR WILL YOU STOP AND ENJOY THE LOOT?</strong><br/><br/><br/>The Looting system increases with the increased difficulty, you can choose to stop and return to the inn or continue the adventure, if you decide to advance you can earn a better loot, you will also risk to die and lose everything... make your choice.<strong>IMPROVE THE LOOT AND CONTINUE THE ADVENTURE</strong><br/><br/><br/>Proceeding with the game you will unlock more and more powerful equipment that will allow you to wipe out your enemies and deal with more dangerous ones.<strong>TAKE THIS ADVICE, YOU WILL NEED IT IN THE FUTURE:</strong><strong>\"CHOOSE YOUR SKILLS WISELY\"</strong><br/><br/><br/>Not only your equipment is important, the way you decide to \"grow\" in the game will also have its impact during the fight, find your style, perfect it, scale in the skill tree and win!", "metacritic": null, "released": "2018-03-12", "tba": false, "updated": "2022-11-03T17:53:52", "background_image": "https://media.rawg.io/media/screenshots/4e0/4e05e460d3e09b0d539ec8c42a9f477b.jpg", "website": "http://lostinthedungeon.com", "rating": 2.0, "rating_top": 1, "added_by_status": {"yet": 7, "owned": 104, "beaten": 1, "dropped": 2}, "playtime": 1, "achievements_count": 0, "ratings_count": 6, "suggestions_count": 429, "game_series_count": 0, "reviews_count": 6, "platforms": ["iOS", "macOS", "Linux", "PC"], "developers": ["Eggon"], "genres": ["Adventure", "RPG", "Strategy", "Casual", "Card", "Indie"], "publishers": ["EGGON SRL SEMPLIFICATA", "Eggon"], "esrb_rating": "Everyone 10+"}