{"id": 523660, "slug": "oil-tycoon-xxl", "name": "Oil Tycoon XXL", "name_original": "Oil Tycoon XXL", "description": "<p><strong>Made for Ludum Dare 40 </strong><strong>Compo (48hrs)</strong><br/></p>\n<p>Grow your oil empire!</p>\r\nThis game is unfinished.\r\nDuring the Game Jam I spent too long working out the details of the systems to address most of the other aspects that would improve the experience. In the end I ran out of time (48 hour limit!) But on the plus side I learnt some handy new things!\r\n<p><strong>How to play:</strong></p>\n<ol><li>First select a country to prospect. Prospecting will cost you a certain amount per hour depending on the country. The country will turn black on the map whilst being prospected, click the prospect button again to cancel.</li><li>Each hour there is a chance that your prospectors will strike oil (woo!) these will appear as an white oil barrel icon on the map.</li><li>Click one of these barrels to build a rig. Each rig has an initial build cost and a hourly cost. (Rig staff cost on the country panel on the left). NOTE: Rigs cannot be destroyed once build so be careful! Rigs will generate crude oil barrels for that country. These can be viewed on the country panel (left).</li><li>You also have the option of building a refinery in one country. This is a one time build cost and will turn the country red. You may only have 1 refinery at a time.</li><li>Once you have a refinery you can begin shipping crude oil barrels to that country to process into refined oil. The cost of shipping is an hourly rate based on the distance between the production country and the refinery country. Your crude oil barrels and refined oil barrels will then appear on top status bar (alongside your money).</li><li>The refined oil will be sold at the end of every day and the profits will go into your bank.</li><li>You can also upgrade your refinery to increase the amount of refined oil produced and decrease the amount of crude oil used. This is a one time cost. You can increase your refinery up to level 5.</li></ol>", "metacritic": null, "released": "2020-11-25", "tba": false, "updated": "2020-11-27T06:12:30", "background_image": "https://media.rawg.io/media/screenshots/ace/ace96b0dec983a7eef2c69bbdae56de5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 9, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Pete H"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}