{"id": 52376, "slug": "realm-battle-rival-kingdoms", "name": "Realm Battle: Rival Kingdoms", "name_original": "Realm Battle: Rival Kingdoms", "description": "Realm Battle: Rival Kingdoms is an epic war between the kingdom and the devils from the demon kingdom. The castle of kingdoms being threatened by evil forces. The epic heroes and warriors from allied kingdoms must fight to defend their kingdom with top strategy and a rush of inspiration. War is the battle between the royal army and evil army that lies in a magical fantasy world.<br/><br/>The battle begins from the human kingdom, Prince Arthur with his sword fight alongside with royal knight, dragons, defensive viking, archer and other ancient gods in the forest. Upgrade army and win battles, the prince has received support from other kingdoms. Allied kingdoms sent warriors and heroes to join the war. Travel through lush forests, snow covered mountains, and epic desert as you face off against armies of darkness, goblins, skeletons, and evil spider, butcher and more.<br/><br/>Realm Battle offers variety and challenge. Overcome incredible odds with strategy and wit!<br/>You will learn how to become a warrior, summon reinforcements, how to command your troops, recruit elven warriors, face legendary monsters, how to use resources to build a kingdom and how to win a battle. Your once great kingdom now fights for its life against a scourge of mighty monsters! Are you ready?<br/><br/>Game Features:<br/><br/>- Epic defense battles with a combination of RPG and strategy game.<br/>- You control the action! Activate heroes’ skills. <br/>- Command your soldiers and see them engage in hand to hand fantasy cartoon battles!<br/>- Multiple worlds to play with 3 kingdoms and 25 different soldiers from Viking, assassin, archer to demon hunter. <br/>- Over 40 different enemies, from goblins to evil dragon each with their own skills!<br/>- 7 heroes from Human kingdom, Elven kingdom and Element kingdom. Choose your champion to lead your troops to victory!<br/>- Huge variety of enemies offer multiple challenges: Burn your enemy, freeze, stun, poison, slow and more skill from your items to cast in battle. <br/>- PVP mode: Where you can fight with other players around the world.<br/><br/>Visit us on Facebook at: https://www.facebook.com/realmbattle<br/><br/>Keep in touch with us if you like Realm Battle: Rival Kingdoms and do not forget comments to us about this. We would love to hear from you!", "metacritic": null, "released": "2018-01-02", "tba": false, "updated": "2019-10-22T14:30:59", "background_image": "https://media.rawg.io/media/screenshots/2a8/2a8136d20a61f85896862eb78e802bc6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 227, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Giang Tran"], "genres": ["RPG", "Strategy"], "publishers": ["Giang Tran"], "esrb_rating": "Everyone 10+"}