{"id": 52378, "slug": "urban-legend-shin-hayarigami", "name": "Urban legend: Shin Hayarigami", "name_original": "Urban legend: Shin Hayarigami", "description": "\"The truth is hidden\"<br/>Go on the most terrifying adventure with famous horror series Shin Hayarigami.<br/>Be ready, because this story will make you shiver... <br/><br/>Features:<br/>- Shin Hayarigami: The BlindMan is a narrative masterpiece that will seriously creep you out once and for all. <br/>- The story will bring out your biggest fears and shake you to the ground.<br/>- You can test your detective skills and shed light on the most terrifying murder case in history. <br/><br/>How to play:<br/>- Shin Hayarigami: The BlindMan is a visual novel horror game. Follow the story, listen and watch carefully. Pay attention to every single detail that can help you solve the case and uncover the mystery of the Urban Legend of the BlindMan. <br/>- From time to time you will have multiple choice questions. Your answers will define the future of the story and will affect the whole investigation. Think carefully before you choose an answer. Don't get trapped. <br/>- Use all your detective skills that can help you find crucial clues. Will you be able to overcome your fear and find the truth?<br/>- Use your wits and logic to solve the case. Don't let your feelings and emotions get in the way.<br/>- Shin Hayarigami: The BlindMan is more than just a story. It is part of breathtaking series of visual horror novels. While playing this game you will discover thrilling and terrifying stories. Be ready to shiver!<br/>- You will be fascinated with the story, but in the real world, be prepared to crumble in fear as you hear the murderer whispering in your ear: \"Give me your eyes...\"<br/>- Urban Legend: The BlindMan - the story is so disturbing and fascinating at the same time. This will be incredibly scary, even for you!<br/><br/>Prologue<br/>A murder happened in an isolated village in the S prefecture. A body was found with its eyes carved out.<br/>Someone came forward saying: \"I have some information on the murder that happened in village C in prefecture S.\" <br/><br/>This man, university professor Takeshi Sekimoto, was being tried at the Tokyo district court, and said to have information on this incident. So, he was transferred to a detention center of C village’s police department.<br/><br/>Sekimoto will be in the hands of the special police department in which our hero Hojyo Saki is stationed. Sekimoto was confident when he confirmed all the case material. He claims this murder is the work of the monster \"BlindMan\" from the Urban Legend.<br/><br/>With Shin Hayarigami: The BlindMan, start a journey in a terrific horror game, that will shake you to the core. Follow in the footsteps of the BlindMan, to crack this scary case and bring back peace to the city. Dive deep in this scary atmosphere tainted with suspense and fear and be ready to shiver. But be careful to not get trapped or you may be the next victim!<br/><br/>※ Contact information: <br/>E-Mail : help@iplayse.com<br/>Twitter : urbanlegend(@Shin_Hayarigami)", "metacritic": null, "released": "2018-03-14", "tba": false, "updated": "2020-10-02T02:48:49", "background_image": "https://media.rawg.io/media/screenshots/e14/e14dd689bd93d4a1d0bde32d45c3f2ff.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 280, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["I-Play.Co.,Ltd."], "genres": ["Adventure", "Simulation"], "publishers": ["iplay Co.,Ltd."], "esrb_rating": null}