{"id": 523931, "slug": "breathless-downunder", "name": "Breathless (DownUnder)", "name_original": "Breathless (DownUnder)", "description": "Overview\r\n<p>Your teleporter has malfunctioned and sent you underground to an unexplored cave system. Explore the caves, mine for resources and create buildings to help you escape the caves before you run out of oxygen!</p>\n\r\nFeatures\r\n<ul><li>Explore a random, procedurally generated cave system that changes every playthrough!</li><li>Four tools to help you survive<ul><li>Your pickaxe is the main tool to destroy the rock walls</li><li>Your shovel can be used to clear rubble from the ground</li><li>The jackhammer is an upgrade to the pickaxe but requires power from a building to be used</li><li>Your building fabricator is used to select and place buildings if you have the resources.</li></ul></li><li>Different rock types and resources to gather<ul><li>Soft rock is rich in stone and can occasionally drop iron</li><li>Hard rock can only be mined with a powered jackhammer and is rich in both stone and iron. May contain some gold.</li><li>Gold ore is the best source of gold and also drops some of the other resources</li><li>Rubble is left behind after mining a wall, clearing it with your shovel can yield some stone.</li></ul></li><li>Buildings can be created to help you escape<ul><li>Paths help you move quicker</li><li>Batteries supply power to your jackhammer when nearby</li><li>Power Plants generate power that can be used by your jackhammer and surrounding buildings</li><li>Oxygen generators can be used to slow the depletion of oxygen from the caves, buying you more time to escape</li><li>The escape teleporter is the main goal, building this lets you escape the caves and win</li></ul></li></ul>\n\r\nControls\r\n<ul><li>WASD: Move</li><li>Mouse: Look around</li><li>Space: Jump</li><li>Left-Click (Hold): Use the selected tool (Mines with pick, shovel, jackhammer. Places building with building fabricator)</li><li>1,2,3,4: Choose tool</li><li>Q, E: Change building selection (Only when holding building fabricator)</li><li>ESC: Pause the game</li></ul>\n\r\nTips\r\n<ul><li>Most buildings must be placed on flat ground<ul><li>Paths can be placed on uneven ground however</li></ul></li><li>Buildings cannot be placed on rubble</li><li>Paths will light up in the range of a power plant, use this as a guide when placing buildings to place them in range if they need power.</li><li>If you get a bad cave generation and are stuck, you can restart from the pause menu.</li></ul>\n\r\nCredits\r\n<p>Made by Charlton Lane</p>", "metacritic": null, "released": "2020-11-24", "tba": false, "updated": "2020-11-27T07:10:40", "background_image": "https://media.rawg.io/media/screenshots/625/6257c28b13bebe51322c7faaa13f048c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 88, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["DownUnder"], "genres": [], "publishers": [], "esrb_rating": null}