{"id": 524146, "slug": "big-bang-limited", "name": "Big Bang Limited", "name_original": "Big Bang Limited", "description": "<p>Build a Solar System! But be careful, if you don't manage your space well, things will explode! You will be given Planets, Moons and Asteroids to place in your Solar System, how big your system can get will depend on your skills. When and where you place these objects will make all the difference.</p>\n\n<p>Scoring:</p>\n<p>- Planet in orbit: +1 Point / Turn</p>\n<p>- Moon in orbit: +1 Point / Turn</p>\n<p>- Moon/Asteroid flying off in the distance: -1 Point</p>\n<p>- Planet in orbit covered by dust: 0 Points / Turn (happens if two moons were to orbit  the same Planet)</p>\n\n<p>Use Planets to gain Points!</p>\n<p>Use Moons to double a Planets gains!</p>\n<p>Use Asteroids to clean up space! (Especially useful for dust covered planets)</p>\n\n<p>Controls:</p>\n<p>Aim with the mouse, release a projectile with the Left Mouse Button.</p>\n\n\n<p>The Windows build should be able to run on Linux and Mac but I wasn't able to test.</p>\n<p>The Web build has a sound bug when you get points. It doesn't sound as it should. It started when switching target platforms. If it bothers you please turn off the sounds or download a Windows or Android version. I'm sorry about the inconvenience.</p>\n<p>The Android build will be expanded into a Google Play release. Suggestions on a new name are welcome! It will be in portrait mode, this version is in Landscape.</p>\n\n<p>Made as a Solo project for BenBonk Game Jam #2 which had the theme of Limited Space. It was a 72 hour game jam and the second game jam I've participated in.</p>", "metacritic": null, "released": "2020-11-23", "tba": false, "updated": "2020-11-27T07:57:08", "background_image": "https://media.rawg.io/media/screenshots/804/8046fd9d9cdde99a47bb1d857ebd2a51.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 60, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Android", "Web"], "developers": ["Magregon"], "genres": ["Action"], "publishers": [], "esrb_rating": null}