{"id": 524163, "slug": "living-chess-v01", "name": "Living Chess v0.1", "name_original": "Living Chess v0.1", "description": "<p>Based on John Conway's \"Game of Life,\" but played on a limited board.</p>\n<p>Two players take turns putting one new Blob on the board. After each Blob is placed, the Blobs advance to the next generation. Place your Blobs strategically to encourage your Blobs to create more Blobs, OR to crowd out and kill your opponent's Blobs.</p>\n<p>There's also a Practice mode for one player to fill in cells and observe how they act over the course of several generations.</p>\n<p>Accessibility features include a colorblind-safe palette, different shaped Blobs, and OpenDyslexic font option.</p>\n<p>Features in development include: builds for Apple and Linux (and potentially other platforms too!), customizable Blob shapes and colors, a two player match with a non-random setup phase, customizable board size and starting player Blob count, and different Match victory conditions, as well as NUMEROUS aesthetic upgrades. Online multiplayer will be developed in the future. Oh, and I should probably put some credits/thank yous in there...</p>\n<p>This game is still in early development. The rules of \"The Game of Life\" are set, but the board size, starting player Blob counts, and turn structure aren't. After playing a few matches, feel free to send feedback to journeymangamestudios [at] gmail.com. Please include FEEDBACK in the subject line. Constructive criticism is welcome and appreciated!</p>\n<p>If there's enough response, I'd love to start a Discord for game players to discuss strategies and give me direct feedback.</p>\n<p>Thanks for checking out my game, and ENJOY!</p>\n<p>And if you donated, or want to... THANK YOU for helping me start my new journey (career)!</p>", "metacritic": null, "released": "2020-11-23", "tba": false, "updated": "2020-11-27T08:01:00", "background_image": "https://media.rawg.io/media/screenshots/706/706024a465908e2c66366dde91c1c194.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 6, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Journeyman Game Studios"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}