{"id": 524487, "slug": "dystopia-contest-of-heroes", "name": "Dystopia: Contest of Heroes", "name_original": "Dystopia: Contest of Heroes", "description": "Epic Multiplayer RTS Adventure<br/>For all the lovers of strategy games, we present you DYSTOPIA: CONTEST OF HEROES!<br/><br/>Prepare for the BIG CLASH<br/>Fight with the brave Conor McGregor and his squad against evil enemies as the world goes to pieces in this galaxy battle from the future.<br/><br/>Become a LEADER &amp; free the CITY<br/>Assume the role of a HERO in a futuristic world where fractured societies and clans are fighting for power and control over the city in this new genre-defining RTS game with RPG elements. <br/><br/>Epic MULTIPLAYER Battles<br/>If you love to play strategy games with your friends - DYSTOPIA: CONTEST OF HEROES is the perfect new game for you! <br/><br/>Manage your HEROES with unique equipment and abilities that fit your desired gameplay style<br/>Forge an ALLIANCE to create a strategy and develop Tech Trees in a united effort for domination over the galaxy <br/>Command your ARMY, win every BATTLE and conquer your enemy!<br/><br/>Rush into a fantasy RTS ADVENTURE<br/>Be the brave champion of Conor McGregor’s unique TOURNAMENTS - send your best soldiers to clash with the enemy’s army and overpower their base defenses.<br/><br/>Battle amazing LEVELS<br/>Show your dominance by climbing the RANKS and join THE BRAVE Conor McGregor on an epic journey as you explore the city districts in a thrilling  solo campaign.<br/><br/>Try this NEW GAME that you are going to LOVE<br/>All this in a fantasy strategy game of the future with RPG elements! It's pure, it's a GRAND ADVENTURE, it's DYSTOPIA: CONTEST OF HEROES!<br/><br/>FEATURES:<br/><br/>BE a BRAVE HERO! Join Conor McGregor in this Dystopian world as you fight in Tournaments and battle through the campaign story of this epic genre-defining strategy game!<br/><br/>BUILD an ARMY! Create your own base, manage your defenses, plan hundreds of strategies to surprise attack your rivals.<br/><br/>JOIN the FANTASY HEROES! Mix and Match - select from an all-star cast with unique skills to get that extra edge on the battlefield.<br/><br/>RUSH INTO BATTLE! Dynamic RTS battles with more depth and options than ever before. <br/><br/>BUILD your STRATEGY! Show the type of player you are! Play aggressive, play safe or play smart. Dominate or be crushed!<br/><br/>LEVEL UP your HERO! Collect legendary weapons, upgrade epic armor, and beef up your heroic squad to crush your foes.<br/><br/>CONQUER the CITY! Be the hero that will win in this game with RPG elements!<br/><br/>FORGE ALLIANCES! Make new friends and fight together to increase your influence on the grid in this multiplayer adventure and liberate the world.<br/><br/>CHAT with OTHERS! Connect with millions of players worldwide that are fans of RTS and strategy games like you. Gather information, discuss gameplay, and forge lasting relationships!<br/><br/>CLASH! Fight your enemies and find the right strategy to win every battle!<br/><br/>DOWNLOAD NOW<br/>Don’t wait, come join Conor McGregor and explore the vast universe of Dystopia TODAY!<br/><br/>Facebook: https://www.facebook.com/dystopiacontestofheroes<br/>Twitter: https://twitter.com/DystopiaMobile<br/>Instagram: https://www.instagram.com/dystopiagame/<br/>Youtube: https://www.youtube.com/channel/UCNXNqib5cr0OV0nPbe3D22g?view_as=subscriber<br/>Discord: https://discord.gg/xhdRnsJ<br/>Web: http://dystopia.beetrootlab.com/<br/><br/>Privacy Policy: http://dystopia.beetrootlab.com/privacy-policy.html<br/>Terms of Service: http://dystopia.beetrootlab.com/terms-of-service.html", "metacritic": null, "released": "2020-11-17", "tba": false, "updated": "2020-11-30T02:12:20", "background_image": "https://media.rawg.io/media/screenshots/c5c/c5c576e58577802d969b8eb6625517ea_YTqFG6e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 420, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Beetroot Lab"], "genres": ["Action", "Strategy"], "publishers": ["Beetroot Lab"], "esrb_rating": "Teen"}