{"id": 524826, "slug": "moonshot-battle-jam-version", "name": "Moonshot Battle (Jam Version)", "name_original": "Moonshot Battle (Jam Version)", "description": "<p>What do you wish for? What would you sacrifice for it?<br/></p>\n<p>Wager something that's most precious to you, and the moon goddess will grant you one wish of yours, that is, if you win... in the Moonshot Battle.</p>\n<p>Be prepared to lose what you treasure most, if you choose to participate...</p>\n\n<p><strong>Dev Notes</strong></p>\n<p>I didn't have time to make a tutorial for the game so here is a short tutorial on this page:</p>\n<p>The game consists of story sequences and battle sequences.</p>\n<p><strong>Story Tutorial</strong></p>\n<p>Press [SPACE] to progress the dialog of the story.</p>\n<p><strong>Battle Tutorial</strong></p>\n<p><strong>Basic Controls:</strong></p>\n<p>Use the [Up], [Down], [Left] and [Right] arrow keys to navigate the game board.<br/></p>\n<p>Press [SPACE] to toggle selection on a tile.</p>\n<p>Once you have a tile selected, use the [Up], [Down], [Left] and [Right] arrow keys to swap tiles in a direction of your choosing.</p>\n<p>Press [S] to activate your Special when your Special Meter is full.</p>\n<p><strong>Basic Mechanics:</strong></p>\n<p>Players start with 100 Health, 0 special Meter, and 0 Shields.</p>\r\n   \r\n<p>Green is for Health, Orange is for Special Meter, Blue is for Shields.</p>\n<p>You lose when you drop to 0 Health, so keep an eye out for it!</p>\n<p>Match 3 or more tiles horizontally or vertically to clear them and trigger their effects!</p>\n<p>(3 horizontal tiles)<br/></p>\n<p>             </p>\n<p>(3 vertical tiles)</p>\n\n\n<p><strong>Tile types and Effects:</strong></p>\n<p> Damage Tile</p>\n<p>Damage tiles deal damage to the opponent. </p>\n<p>The damage is calculated as: 2 x Number of cleared tiles.</p>\n<p>(Eg. If you clear 3 Damage tiles, you deal 6 damage to your opponent)</p>\n<p>When Special is active, it will be: 4 x Number of cleared tiles.</p>\n<p>  Freeze Tile<br/></p>\n<p>Freeze tiles creates unplayable tiles on the opponent's board, effectively \"freezing\" them. Tiles remain frozen for 3 seconds, after which, they will be playable once more.</p>\n<p>The number of \"frozen\" tiles are calculated as: 1 x Number of cleared tiles.</p>\n<p>(Eg. If you clear 3 Freeze tiles, you will freeze 3 of your opponents tiles)</p>\n<p>When Special is active, it will be: 2 x Number of cleared tiles.</p>\n<p> Heal Tile<br/></p>\n<p>Heal tiles heal yourself, replenishing your Health.</p>\n<p>The amount you heal is calculated as: 1 x Number of cleared tiles.</p>\n<p>(Eg. If you clear 3 Heal tiles, you will heal for 3 Health)</p>\n<p>When Special is active, it will be: 2 x Number of cleared tiles.</p>\n<p> Special Meter Tile<br/></p>\n<p>Special Meter tiles fill up the Special Meter.</p>\n<p>The amount you fill up the special Meter is: 1 x Number of cleared tiles.</p>\n<p>(Eg. If you clear 3 Special Meter Tiles, you fill up the Special Meter by 3)</p>\n<p>The Special Meter also fills up when you take damage, it is calculated by : Damage Taken / 2</p>\n<p>(Eg. If you take 6 damage, you fill up the Special Meter by 3)</p>\n<p>The Special Meter maxes out at 50. When it maxes out, you can press [S] to activate the Special. It will start draining your Special Meter when it is active. </p>\n<p>When the Special is active, you cannot replenish the Special Meter.</p>\r\n Shield Tile<br/>\n<p>Shield tiles fill up your Shields. Shields decay by 1 every second.</p>\n<p>The amount you fill up the Shields is: 1 x Number of cleared tiles.</p>\n<p>(Eg. If you clear 3 Shield tiles, you fill up the Shields by 3)</p>\n<p>Shields block half of the incoming damage and gets reduced by the amount blocked as well.</p>\n<p>(Eg. If you have 6 Shields, and your opponent deals 6 damage, you will take 3 damage instead but you will have 3 Shields left)</p>\n<p>Blocking damage with shields do not affect filling up your Special.</p>\n<p>(Eg. If you have 6 Shields, and your opponent deals 6 damage, you will still fill up the Special Meter by 3, even though you take only 3 damage)</p>\n<p>Take note that shields decay by 1 every second. It is effective when blocking short bursts of damage such as when your opponent has their Special active, but not that effective at accumulating Health like Heal tiles do.</p>\n<p><strong>End of Match stats:</strong></p>\n<p>At the end of the match, the number of tiles of each type you cleared are displayed.</p>\n<p>The white numbers are total number of tiles, and the numbers in yellow are tiles you cleared when your Special is active.</p>\n\n<p>And thus concludes my tutorial. Hope it helps! And more importantly, helps you have fun with the game!</p>\n\n<p><strong>Future plans for this project:</strong></p>\n<p>I do intend to continue working on the game, even if nobody shows interest in it. Planned features that are missing in this version include:</p>\n<ul><li>Original soundtracks</li><li>2 Player versus</li><li>Proper in-game tutorial</li><li>Menu System</li><li>Settings and Key mappings</li><li>Controller Support</li><li>Extended storyline</li></ul>\n<p>Features that are nice to have but difficult to realize without better support (which basically means I'm not gonna do it if I am not getting paid for it) :</p>\n<ul><li>Netcode for online multiplayer</li><li>Online leaderboard and scoring system</li><li>Voice Acting</li><li>More characters and character selection</li><li>More art assets</li></ul>", "metacritic": null, "released": "2020-11-29", "tba": false, "updated": "2020-11-30T03:24:13", "background_image": "https://media.rawg.io/media/screenshots/d4a/d4a264ada3022e889d9f84702bc13e51.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 14, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["damakuno"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}