{"id": 524870, "slug": "nevergreen-simplyjpk", "name": "Nevergreen (SimplyJpk)", "name_original": "Nevergreen (SimplyJpk)", "description": "<p>Nevergreen was a small group project for a 1st year UNI assignment at Academy of Interactive Entertainment over three months utilizing the Unity 5.4 game engine.<br/>Dev-Info: https://simplyjpk.com/nevergreen/</p>\n<p>Known Bugs :(<br/></p>\n<p>- 'Press Q to change arms' missing sometimes when picking up new arm.</p>\r\nUpdates and fixes since 1st Year Assignment\r\n<p>The finished product was rough around the edges, however, with four years of Unity Updates and some additional knowledge from years passed I've spent a couple of hours fixing up some small details that added the most in regards to features and appearances. A list below of changes made is below.<br/></p>\r\nBugs\r\n<p>- Fixed a number of animator problems.<br/>- Slight improvements to audio to matching animations, still needs some work.<br/>- Fixed an issue with an interactable beam not always working causing a softlock of sorts, also fixed an issue with the material it was using.<br/>- Fixed a couple particle systems that can been scaled incorrectly.<br/>- Fixed a few art assets that were missed.<br/>- Aligned the sprites for the paralax better, as some textures were popping in/out.<br/>- Disabled the 'Exit Game' button in WebGL to prevent a '<strong>JavaScript execution error'</strong><br/>- Fixed video players not working since they require StreamingAssets as WebGL<br/>- Fixed a resizing issue with main menu.<br/></p>\r\nImprovements\r\n<p>- Updated from Unity 5.4 to Unity 2019.4 LTS<br/>- More responsive player controller, still a bit awkward.<br/>- The fireflies have been given some additional behaviours, such as flying to 'points of interest' which they may visit when nearby.<br/>- Added some very minor Bloom post-processing.<br/>- Added anti-aliasing to improve overall appearance of game and helps some of the art blend together more.<br/>- Cleaned up some of the Particle effects for Dust motes and leaves, adding a bit more atmosphere.<br/>- Updated most TextMesh's to use TextMeshPro, and made a new UI manager to improve how the drawing of UI is handled for the arms. (Still a bit clunky)<br/>- Added additional particle systems for leaves and dust motes throughout the scene to improve visuals.<br/>- Gave additional objects a sway shader to make the scene feel more alive.<br/>- Cleaned up many art assets to support DXT5 compression, reducing build size, significantly.<br/>- Cloned small pieces of some assets to fit some spaces that were missed, ie (Trees ending, but still visible on screen).<br/>- Arms and Collectables all now fade out when collected improving appearances, so do their respective particle systems.<br/>- Added some 2d shadows for most scene objects to give a bit more depth.<br/>- Additional objects throughout the level for some more visuals, vines, leaves, flowers.</p>\r\nPerformance\r\n<p>- Updated from Unity 5.4 to Unity 2019.4 LTS<br/>- Tweaks to allow WebGL build, plus some minor optomisations to improve WebGL performance.<br/>- Removed debug logging I still had in the released build (whoops).<br/>- Fixed up some awkward getComponents which should improve performance slightly.</p>\r\nBuild Size \r\n<p>- Removed all mips for 2D assets that didn't require them (most)<br/>- Resized many assets so that they were supported by DXT5 compression.<br/>- Deleted some unused assets that were disabled in scene from greyboxing period.</p>\n<p><em>Original Build Size: 180MB<br/>Updated Build Size: 83MB</em></p>\r\nTeam\r\nArtists\r\n<p>Chloe Brett (Lead Character artist, Foilage artist)<br/>Alex (Lead Rigger, Particle Effects animator and 3D artist)<br/>Elizabeth (Lead 2D Artist)<br/>Maddie (Generalist - 3D art, 2D art &amp; grass animator, Typographer sound engineer)<br/>Brianna Rippon (Lead 3D animator, 2D animator, Credits, Motion graphics)</p>\r\nDesigners\r\n<p>Mike<br/>Dai-Wei Pobjie<br/>Connor Urwin</p>\r\nProgrammers\r\n<p>Hanih Saneen<br/>James Kellie / SimplyJpk</p>", "metacritic": null, "released": "2020-11-29", "tba": false, "updated": "2020-11-30T03:33:46", "background_image": "https://media.rawg.io/media/screenshots/b98/b98c33e5575e34ac3b0d453e4acf190f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["SimplyJpk"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}