{"id": 524814, "slug": "win-in-space", "name": "Win in Space", "name_original": "Win in Space", "description": "<p>Choose the right angle and power of fire to eliminate the interplanetary threat!</p>\n<p>Win in Space is a turn-based game where players are surrounded by space objects which affect the trajectory of your projectiles.</p>\n<p>This game is best played on a desktop or laptop computer with mouse and keyboard.  Bring a friend for the best experience.</p>\r\nHow to Play\r\n<p>Players take turns:</p>\n<ol><li>Hold the mouse button on your planet and drag around to select the angle of fire.</li><li>Use the buttons on the HUD to choose the power of the shot.</li><li>Fire the projectile with the button on the HUD or the Enter key, and observe its trajectory.</li><li>Be the first to hit the opponent to win.</li></ol>\n<p>Also:</p>\n<ul><li>Use the arrow keys to navigate around the level.</li><li>Use the mouse wheel to zoom in and zoom out, or the keys Q and E.</li></ul>\r\nTips and Tricks\r\n<ul><li>Select <strong>How to Play</strong> if this is your first time playing the game.</li><li>Try to predict the trajectory of your shot. Objects in the level generally attract the projectile, with the exception of less common anti-matter objects (in red), which repel the projectile.</li><li>If the previous shot failed, fine-tune the next shot by continuously inspecting the difference in angle and power, as seen in the HUD.</li><li>In One Player mode, the only goal is to try to discover the right angle and force to hit the stationary planet in the least number of rounds. Bring a friend along to increase the fun.</li><li>Don't feel overwhelmed if generated levels appear too difficult or biased towards some player. That can indeed happen. Continue generating more levels for a better experience.</li><li>Firing <em>low power</em> projectiles makes you more awesome.</li></ul>", "metacritic": null, "released": "2020-11-29", "tba": false, "updated": "2020-11-30T03:21:35", "background_image": "https://media.rawg.io/media/screenshots/a9a/a9afbea1803557a7b13e959e9e3d0c3c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 8, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["E_net4"], "genres": [], "publishers": [], "esrb_rating": null}