{"id": 52512, "slug": "arcade-archives-donkey-kong", "name": "Donkey Kong", "name_original": "Donkey Kong", "description": "<p>Donkey Kong (Japanese: ドンキーコング, Hepburn: Donkī Kongu) is an arcade game released by Nintendo in 1981. An early example of the platform game genre, the gameplay focuses on maneuvering the main character across a series of platforms while dodging and jumping over obstacles. In the game, Mario (originally named Mr. Video and then Jumpman) must rescue a damsel in distress named Pauline (originally named Lady), from a giant ape named Donkey Kong. The hero and ape later became two of Nintendo&#39;s most popular and recognizable characters. Donkey Kong is one of the most important games from the golden age of arcade video games, and is one of the most popular arcade games of all time.<br />\nThe game was the latest in a series of efforts by Nintendo to break into the North American market. Hiroshi Yamauchi, Nintendo&#39;s president at the time, assigned the project to a first-time video game designer named Shigeru Miyamoto. Drawing from a wide range of inspirations, including Popeye, Beauty and the Beast, and King Kong, Miyamoto developed the scenario and designed the game alongside Nintendo&#39;s chief engineer, Gunpei Yokoi. The two men broke new ground by using graphics as a means of characterization, including cutscenes to advance the game&#39;s plot, and integrating multiple stages into the gameplay.<br />\nDespite initial doubts by Nintendo&#39;s American staff, Donkey Kong succeeded commercially and critically in North America and Japan. Nintendo licensed the game to Coleco, who developed home console versions for numerous platforms. Other companies cloned Nintendo&#39;s hit and avoided royalties altogether. Miyamoto&#39;s characters appeared on cereal boxes, television cartoons, and dozens of other places. A lawsuit brought on by Universal City Studios, alleging Donkey Kong violated their trademark of King Kong, ultimately failed. The success of Donkey Kong and Nintendo&#39;s victory in the courtroom helped to position the company for video game market dominance from its release in 1981 until the late 1990s (1996–1999).</p>", "metacritic": null, "released": "1981-07-09", "tba": false, "updated": "2024-02-13T07:48:24", "background_image": "https://media.rawg.io/media/games/23e/23eecccb588a4a9c97f35ebf8f9f00ef.jpg", "website": "", "rating": 3.73, "rating_top": 4, "added_by_status": {"yet": 12, "owned": 105, "beaten": 146, "toplay": 23, "dropped": 117, "playing": 3}, "playtime": 10, "achievements_count": 0, "ratings_count": 178, "suggestions_count": 240, "game_series_count": 14, "reviews_count": 181, "platforms": ["Game Boy", "Nintendo Switch", "Nintendo 3DS", "Wii U", "Wii", "Atari 2600", "Game Boy Advance", "Atari 8-bit", "Atari 7800", "Apple II", "NES", "Atari XEGS", "Commodore / Amiga"], "developers": ["Nintendo", "Pax Softnica", "Ikegami Tsushinki"], "genres": ["Puzzle", "Platformer"], "publishers": ["Nintendo", "HAMSTER", "Co."], "esrb_rating": null}