{"id": 525122, "slug": "the-regressor", "name": "The Regressor", "name_original": "The Regressor", "description": "<p>The regressor merupakan sebuah permainan bullet hell yang bertemakan magical fantasy. Pemain mengendalikan protagonist bernama Ronne, seorang manusia yang memiliki kemampuan mengendalikan waktu. Setting tempat permainan adalah di sebuah padang pasir di masa depan, dimana peradaban manusia sudah hancur.</p>\n<p>Pada saat game dimulai, Ronne terbangun tanpa ingatan di tengah-tengah padang pasir. Ia melihat sebuah menara yang sangat tinggi dan ia memutuskan untuk terbang menuju menara tersebut. Selama perjalanan, Ronne perlu melawan monster-monster yang menghalangi.</p>\n<p>Permainan terdiri dari beberapa level, dimana tingkat kesulitan akan meningkat setiap levelnya. Pada setiap level, pemain akan bertemu dengan monster-monster yang sangat banyak dan mencoba membunuh pemain dengan tembakannya. Pemain harus bertahan hidup dengan menghindari tembakan musuh dan membunuh musuh. Setelah beberapa waktu, boss level tersebut akan muncul. Jika pemain berhasil mengalahkan boss, maka pemain dapat lanjut ke level selanjutnya.</p>\n<p>\n</p>\n<p>Ada beberapa hal yang dapat dilakukan pemain. Tentunya pemain dapat menggerakkan protagonist ke kiri, kanan, depan dan belakang. Protagonist akan terus menerus menembak selama permainan secara otomatis, sehingga pemain tidak perlu mengontrol tembakan. Pemain dapat menekan tombol “Shift” untuk memperlambat pergerakan guna kepentingan manuver. Pemain dapat mengkaktifkan ultimate skill protagonist dengan menekan tombol “X”, ketika ultimate skill aktif, seluruh musuh akan menjadi lambat, seakan akan protagonist bergerak di “arus waktu” yang lebih cepat. </p>\n<p>Ketika pemain menabrak musuh atau pemain tertembak, maka semua musuh selain boss akan mati, dan \"Nuke\" player akan berkuran. Ketika Nuke player mencapai 0, maka player akan mati. Ketika pemain mati, pemain akan kembali ke masa lalu dan bertemudengan “Shadow”. Shadow merupakan rekaman pergerakan pemain pada “permainan” sebelumnya. Pemain dan Shadow akan berjuang bersama sama untuk mengalahkan para musuh.</p>\n<p>Pada pengembangan selanjutnya, akan dilakukan penambahan sistem “Score”, memperkaya tipe dan pattern serangan musuh dan boss, menambahkan dialog pada game, dan juga menambahkan menu permainan.<br/><br/>Kontrol:<br/></p>\n<p>- Tombol panah: Movement<br/>- Tombol X: Ultimate (Time slow motion)<br/>- Tombol Shift: Movement deceleration<br/></p>", "metacritic": null, "released": "2020-11-28", "tba": false, "updated": "2020-11-30T04:27:50", "background_image": "https://media.rawg.io/media/screenshots/261/26181a12b787222db93c267847fa2c3a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 65, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["gibara_gaming"], "genres": [], "publishers": [], "esrb_rating": null}