{"id": 525157, "slug": "abyssal-escape", "name": "Abyssal Escape", "name_original": "Abyssal Escape", "description": "<p>Help Leon the slime to escape the mysterious tower using a rocket launcher. Use both types of rockets for either power or accuracy. Meet unique characters along the journey, uncover the truth behind the tower, and beware for enemies that can knock Leon back to earlier levels.</p>\n<p><strong>Story<br/></strong></p><p>Leon is a small slime that lives in the underground world. Him and many more kinds of monsters that live there are called abyssal creatures. The abyssal creatures live in harmony being led by the powerful hydra race. However, one day the hydras had a conflict that ended with the king's death. With the evil king replacing him, Leon and other weak monsters live in fear. One day, Leon find himself waking up in a mysterious tower with seemingly no escape route as all of its walls and windows have been strengthen by magic. Ended with the conclusion that the tower is a jail by the evil king and the only escape route is the top of the tower, Leon must travel through the seemingly endless levels of the tower to escape. Luckily, Leon found a mysterious magical device that can make an explosion which he can use to propel himself upwards. Leon must also uncover the truth of the tower by interacting with other monsters there.<br/></p><p><strong>Gameplay</strong><br/></p><p>In Abyssal Escape, players must help Leon to reach the top of the tower by launching himself with the rocket launcher he found.  There are 2 types of rockets which he can use. One is the power rocket, very useful to help Leon reach the next platform and the one players will use most of the time. The other is the adjustment rocket, which is helpful to get Leon to right position for the next rocket launch. Using these, players must carefully launch Leon to the next as a miscalculation might end with him falling to a platform far below where he was before. This can be tricky, as there are special types of platforms, some can move around and others will magically disappear and came back when Leon stand on it for too long. There are also enemies that while they can't hurt Leon, they can knock him back to earlier platforms, so be careful and good luck at helping Leon reach the top of the tower!<br/></p>\n<p><strong>Controls\r\n</strong></p>\n<p>Left click - Shoot big rocket<br/></p>\n<p>Right click - Shoot small rocket</p>\n<p>E - Interact</p>\n\n<p>A game by Gaming With Us<br/></p>", "metacritic": null, "released": "2020-11-28", "tba": false, "updated": "2020-11-30T04:35:22", "background_image": "https://media.rawg.io/media/screenshots/352/35297f8f33bb5c5acbe747016ad3b1dc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["GamingWithUs"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}