{"id": 525271, "slug": "mothlily-demo", "name": "MOTHLILY DEMO", "name_original": "MOTHLILY DEMO", "description": "<p><strong>NOTE ON THE PRICE: </strong></p>\n<p><em>The steep price is to encourage sales of the Locally Sourced Michigan November Bundle, where the games individually cost $1 each. For the best savings, please purchase this game from their link </em>here.</p>\n<p><strong>BRIEF SUMMARY:</strong><br/></p>\n<p>MOTHLILY is a queer, experimental, and fantasy visual novel about two gods navigating intimacy when one of them has a human heart and the other's is monstrous and divine. It is about playful, morbid banter, Vietnamese sizzling crepes, and the decision to put down the scalpel (or to pick it up).<br/></p>\n<p>This demo contains Chapters 1 &amp; 2 out of seven total.</p>\n<p>The final release of the visual novel will happen through Itch and Steam on 7/4/21.</p>\n<p><strong>CHARACTERS</strong><br/></p>\n<p><em>AMADEUS VU</em><br/>The legend of AMADEUS VU, as she would tell it, is that she is a mortal man who became EMPRESS OF HEAVEN, though she is also known as THE WHITE SNAKE and THE FEY THE FAIRIES FORSAKE. She was a surgeon, once, a rising star, before she became weak with fairy rot. THE FAIRY SOVEREIGN, THE LADY SILVERBELL, told her how to make an oleander tea that would treat the rot. After that, Silverbell let Amadeus loose: waiting to see what she'd do. After years of symbolic killing cycles of blood and flesh consumed for the divinity inside it, Amadeus finds SEVERIN LACANDOLA, entangling Severin into her own bloody desires and fairy games, and after the two of them prove too much a threat to Silverbell, they immortalize themselves in The Luminous River, in its godmaking waters. </p>\n<p>Now, living with Severin, as two gods in their kingdom of heaven, Amadeus doesn't know what to do except destroy herself.</p>\n<p><em>SEVERIN LACANDOLA</em></p>\n<p>SEVERIN LACANDOLA never wanted to be a god, she just wanted to be loved. She didn't need anything nice, just someone who might make pancakes from the box once in a while, or a nice bagel with lox. Just as a special treat. Severin craved normalcy, as much of it as she could get as a CHEVALIER OF THE ROYAL OAK, an organization created post-fey-occupation to help with the transition and maintain whatever scraps of boundaries humanity could scrounge from the fey. In one of her investigations of a murder that ends up being AMADEUS's, she goes to THE LORD SILVERBELL, who pairs his favorite fey human and his most intriguing human fey (who didn't, at the time, know she was fey) for a bit of entertainment. It ends up nearly being his demise. To prevent such an outcome, Silverbell forces Amadeus and Severin to choose death or the divine. When Severin walks into The Luminous River, she isn't sure if she'll die, but she doesn't care.</p>\n<p>She doesn't die, and now she lives with Amadeus, not knowing what to do with her but deeply, desperately afraid that she'll do something terrible: leave.</p>\n<p><strong>DETAILED SUMMARY</strong></p>\n<p>MOTHLILY is about Amadeus and Severin learning what it means to be in love with someone whose heart is so much unlike their own, but whose hearts they both mutually desire, and whose company they are both terrified of leaving. But though Amadeus might be terrified of it, Severin knows she is not above ruining her own happiness for some greater outcome no one else will ever see. Sometimes, Severin thinks it would've been easier if they'd both died with no feeling more complex than the tenderness of a waltz into a glowing river. But now, the fear of Amadeus leaving Severin makes her want to corner Amadeus until she speaks the truth and nothing but the truth. God knows she's lied enough, though Severin no longer knows what god she's even referring to, since she and Amadeus are the higher beings, now. But even so, Severin knows she's human.</p>\n<p>On the other hand, Amadeus is playing a much more intricate game, one that, at times, she does not even know she is playing, or that she is playing against herself. Amadeus knows only how to play games with her silver tongue or her silver scalpel. She has been alone so long, she doesn't know what it's like to have someone on her side, and she's not sure she likes it. But that uncertainty is outweighed by the calm, simple, domestic delight she's never known before, that feeling of home, of someone to wake up beside, and someone to go to sleep beside, and someone to eat what she cooks. The simple knowledge that Severin will eat whatever Amadeus makes, that Amadeus now has an equal to share with all her Vietnamese culinary secrets, this makes her feel more like she's leaving a legacy than any tableau of murder she's made before. But inside her is this knowledge that her human mimicry has one fatal flaw: intimacy. And what she is beyond that mimicry, what she is beyond a deft hand in the kitchen and a skilled knife outside of it, it is the divine. Amadeus is divine, and she knows there is no divine that is not a monster.  </p>\n<p>The core conflict of MOTHLILY is that Severin has a human heart while Amadeus has a divine and monstrous one. They both knew that they'd die for each other, but now that they are alive, and they are more than godlike, they are gods—they have to learn what it means to be together, and how to stay together. </p>", "metacritic": null, "released": "2020-11-27", "tba": false, "updated": "2020-11-30T05:02:41", "background_image": "https://media.rawg.io/media/screenshots/ff3/ff3a01698e7c7f91d3b020d41d25cba9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 118, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["feyxuan"], "genres": [], "publishers": [], "esrb_rating": null}