{"id": 525205, "slug": "winston-is-stuck-on-the-moon", "name": "Winston is Stuck on the Moon", "name_original": "Winston is Stuck on the Moon", "description": "<p><strong>This is my first ever game in Unity, and my first ever entry into a Game Jam (so please be gentle!) - Going from zero experience to a playable game in Unity in a month IS my moonshot :P</strong><br/></p>\n<p>It is not known how or why Winston came to be stuck on the moon, but he's there and somehow breathing without a suit.  He's already doing great; but he needs your help.</p>\n<p>Your mission, should you be inclined to engage, is to bring him home.</p>\n<p>As this is my first Unity game, and we only had a month for the jam; there are only two levels. Sorry; I might have spent a few days just on cat legs... oops.</p>\n<p>In Level one you must find the parts required to build Winston's Return Vehicle.  It doesn't go exactly to plan, as you'll discover.  Once assembled, use the return vehicle to get home.</p>\n<p>In Level two you will navigate the expanse between the moon and Earth; you will be required to pass through security and avoid death. My advice to you is to just keep moving.</p>\n<p><strong>You only get one life, so live it well!<br/></strong></p>\n<p>Winston is based on a real cat who was awesome and is missed; he's not  dead, but was instead stolen slowly by another family. cos people do that now -_-</p>\n\n<p><strong>UPDATE:</strong></p>\n<p>Fixed some bugs kindly pointed out to me by <strong>kreivi</strong>!<br/></p>\n<ul><li>Added a <strong>MAP </strong>so you can find the parts more easily (not exactly a bug but certainly useful :P)</li><li>'Quit' triggering by itself (hard to reproduce, I think I got it though; used the same fix I used when 'respawn' also seemed to trigger on it's own)</li><li>Brightness toned down - I was aiming for <em>\"what the sun would be like without Earth's atmosphere\"</em> but it was just too bright.</li><li>Audio issues - again, another one that's hard to reproduce, so what I did was just pull the MP3s into Audacity, reduced the envelope size then exported to WAV - A quick playthrough suggests it's fixed - fingers crossed!</li></ul>\n<p>Big thanks to <strong>kreivi </strong>for the free playtesting!</p>", "metacritic": null, "released": "2020-11-28", "tba": false, "updated": "2020-11-30T04:46:01", "background_image": "https://media.rawg.io/media/screenshots/e1f/e1f75a81eb872e61158a7316bd045b43.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 196, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["duckSPLASH"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}