{"id": 525579, "slug": "castle-heck", "name": "Castle Heck", "name_original": "Castle Heck", "description": "Castle Heck is a procedurally generated dungeon crawler that combines elements you love from Metroidvania with the chaos of Enter the Gungeon. You've arrived with several adventurers into a place not quite as bad as Hell – but Heck! Fight through the dungeon and face your inner demons to escape. Select a hero and melee and magic your way through 5 levels of Heck for a chance of redemption. The enemies you face will be the most slightly menacing and mild mannered enemies you will ever have the pleasure of encountering.<br/><br/><strong>Playable characters:</strong> Playable characters include those that although haven't lived a sinful life, yet have not lived the most pristine life either, including, a used car salesman with the most deceitful of used car sales tactics. Use their unique skills to help survive through all levels of Heck.<br/><br/><strong>Weapons:</strong> Over hundreds of custom weapons to find and unlock. From infernal flame swords to impotently weak poisonous knuckles, you'll find epic loot and just some plain stupid as you traverse through the Levels of Heck.<br/><br/><strong>Combat:</strong> Imagine Dark Souls but in top down. Combat is skill based and requires players to perfect their timing with perfect dodges, shielding and backstabs. Roll your way to victory!<br/><br/><strong>Heck:</strong> Heck contains 5 mind-numbingly difficult levels all procedurally generated to ensure a unique experience for every new run. Complete all levels for a chance of redemption, but fail and perish and you must start all over! But don't fret!  Unlocks and secrets you find through your adventure of Heck will remain with you to help you along in your grueling quest towards vindication.", "metacritic": null, "released": null, "tba": false, "updated": "2020-12-04T02:29:26", "background_image": "https://media.rawg.io/media/screenshots/00e/00e82e1568e08db8339f4b4882663b3b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 91, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Vu Tran"], "genres": ["Action", "Adventure"], "publishers": ["Vu Tran"], "esrb_rating": null}