{"id": 525591, "slug": "aod-art-of-defense", "name": "AOD: Art Of Defense", "name_original": "AOD: Art Of Defense", "description": "Near future. Planet population decreased by 70% after a succession of nuclear wars and horrifying destructions. <br/><br/>The mysterious Mr. Ivil who has united the scattered gangs into one army of thugs is looking for the drawing of the long forgotten Inola project. In search for their treasure, they rob and murder innocent people, destroying settlements. <br/><br/>The A.O.D squad confronts them under your command. You are searching the drawing too to assemble the machine that will either save or destroy mankind. Who will be the first? Its up to you, Commander.<br/><br/><h3>FEATURES</h3><ul><li> Dynamic battles won't leave you bored;<br/></li><li> Elements of Tower Defence, RPG, and strategy;<br/></li><li> Over 500 sectors for real-time battles;<br/></li><li> Various location from small villages to huge abandoned megapolises;<br/></li><li> New Tower Defence modes: escape, fog, survival;<br/></li><li> Over 1000 tower upgrades (tanks, minigun, air defence, etc.);<br/></li><li> 6 unique heroes to explore and level up<br/></li><li> Nuclear bombs, ionic satellite attacks, ballistic barrages, other boosters;<br/></li><li> Hundreds of card upgrades for each tower</li></ul><br/><br/><br/><strong>STRATEGY PART!</strong><br/>Organize defence as you wish, place towers, block the enemy, combine towers, use super weapons. All that you love about Tower Defence (TD) with new features and experience. <br/><br/><strong>EXPLORE GLOBAL MAP.</strong><br/>Plan your moves in the forthcoming battle, take the territories, free sectors from your enemies. <br/><br/><strong>GREAT GRAPHICS AND OPTIMIZATION!</strong><br/>Plunge into the Tower Defence atmosphere with staggering graphics and dynamics battles real-time. <br/><br/><strong>UPGRADE BASE AND WEAPONS!</strong><br/>Create a perfect team of heroes, increase tank damage, tower reloading speed, or create the most powerful nuclear bomb to burn your enemies to ashes! <br/><br/><strong>HUGE COLLECTION OF CARGS!</strong><br/>Find upgrade cards in battles. Apply them to towers. Use all armoury: tanks, miniguns, grenades, machine guns, rocket launchers, etc. <br/><br/>GOOD LUCK, COMMANDER!", "metacritic": null, "released": "2020-12-01", "tba": false, "updated": "2020-12-04T02:35:30", "background_image": "https://media.rawg.io/media/screenshots/11a/11ac18921d9e9acfa81558e264fecfd7.jpg", "website": "https://sateda.net/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "toplay": 1, "playing": 1}, "playtime": 0, "achievements_count": 90, "ratings_count": 0, "suggestions_count": 397, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Sateda"], "genres": ["Action", "Strategy", "Indie"], "publishers": ["Sateda"], "esrb_rating": null}