{"id": 525572, "slug": "batterneers", "name": "Batterneers", "name_original": "Batterneers", "description": "Batterneers is an exciting, action-packed game for up to 4 players. Fight across a number of different maps and game modes using a range of abilities and powerups.<br/><br/>Do note that as of now, Batterneers only supports online and LAN multiplayer. Local multiplayer is currently not available.<br/><br/><br/><br/>Battle Across a Range of Different Game Modes<br/><br/><ul><li> <strong>Deathmatch</strong> - Fight to be the last one standing with the highest score in this classic game mode.<br/></li><li> <strong>Gem Chase</strong> - Hold onto the precious gem for as long as you can while avoiding your fellow players.<br/></li><li> <strong>Treasure Hunt</strong> - Collect the most treasure to win the game! But watch out, as other players can try to sabotage you.</li></ul><br/><br/><br/>Choose Your Approach to Combat<br/><br/><ul><li> <strong>Cannons</strong> - In order to be the best, you'll need to learn how to fire your cannons, calculate the trajectory and use a range of unique powerups to your advantage. These include tracking balls, boomerangs, summoning the kraken, sun beams, explosives and more!<br/></li><li> <strong>Bombs</strong> - The most dangerous weapon in Batterneers. Bombs can be picked up and thrown at pursuing enemies, but watch out as just one rogue cannon ball can make everything go wrong.<br/></li><li> <strong>Ship</strong> - Using the right powerups, your ship can be as deadly as any weapon in the game. Spikes, ocean swirls and rapid reloading will make anyone run away in fear.</li></ul>", "metacritic": null, "released": "2020-11-30", "tba": false, "updated": "2022-10-05T13:20:34", "background_image": "https://media.rawg.io/media/screenshots/35a/35abc5919f76561e676735e354221b3c.jpg", "website": "http://www.batterneers.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 10, "ratings_count": 1, "suggestions_count": 56, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "macOS", "Linux"], "developers": ["Batterneers Dev"], "genres": ["Action", "Casual"], "publishers": ["Batterneers Dev"], "esrb_rating": null}