{"id": 525666, "slug": "anime-play-life-unlimited", "name": "Anime Play Life: Unlimited", "name_original": "Anime Play Life: Unlimited", "description": "Anime Play Life: Unlimited is an adventure and second life simulation game, where you are able to do quests with your character created in the \"Character Creation\" in any location, find a job and work there, buy, place and customize your own houses, place furniture on your property or into your houses, fish on any lake or sea, picnic, buy ships, boats, outfits, items and much more...<br/><br/><ul><strong>FEATURES</strong><li><strong>Character Creation</strong> - Edit the face and body of your character in the \"Character Creation\".)</li></ul><ul><li><strong>Get Jobs</strong> - Go to stores or restaurants and apply for a job to work there.</li></ul><ul><li><strong>Housing/Build System</strong> - Buy, place and customize your own houses, you are also able to buy furniture and place it on your property or into your houses.</li></ul><ul><li><strong>Outfits and Clothing Items</strong> - You can buy outfits and accessories to visually customize your character.</li></ul><ul><li><strong>Barber Shop</strong> - Buy new haircuts and cosmetics.</li></ul><ul><li><strong>Fishing</strong> - You are able to go fishing on any lake or sea with an fishing rod.</li></ul><ul><li><strong>Interact</strong> - You can interact with different characters and objects, such as a computer, chair, bed, treasure chests and more...</li></ul><ul><li><strong>Ships and Boats</strong> - You can buy, customize and drive boats and ships to explore islands and more...</li></ul><ul><li><strong>And mush more...</strong> - Picnic, buy and sell items and more...</li></ul><br/>", "metacritic": null, "released": "2020-12-03", "tba": false, "updated": "2020-12-04T03:26:52", "background_image": "https://media.rawg.io/media/screenshots/640/6409748bf5201ed19b40756e5e487fdc.jpg", "website": "http://www.RedicionStudio.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 256, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["Redicion Studio"], "genres": ["Adventure", "Simulation", "Indie"], "publishers": ["Redicion Studio"], "esrb_rating": null}