{"id": 525674, "slug": "brok-the-investigator", "name": "BROK The InvestiGator", "name_original": "BROK The InvestiGator", "description": "<strong>\"Brok\" is a narrative-driven game that blends action, puzzles and investigation in never-before-seen ways. Will you use your brain... or your brawn?</strong><br/><br/>In a futuristic \"light cyberpunk\" world where animals have replaced humans, privileged citizens live under a protective dome from the ambient air pollution while others struggle to make a living on the outside.<br/><br/>Brok, private detective and former boxer, lives with Graff, the son of his deceased wife. Although he could never elucidate the nature behind her accident, recent events may shed some light on an even more tragic outcome... one that may be linked to their own existence. <br/><br/>Will they be able to withstand the threats of this corrupted world and face their own destiny? <br/><br/><h3>FEATURES</h3><br/>A deep and emotional narrative-rich experience filled with characters reminiscent of classic 80s/90s cartoons.<br/>The first game to combine a \"Classic Adventure\" with \"Beat'em up\" and RPG elements!<br/><br/>- Solve puzzles with your wits... or muscles!<br/>- Make choices impacting gameplay and/or story<br/>- Easy mode for pure \"Point &amp; Click\" gameplay (fights can be skipped)<br/>- Level up to beat enemies and bosses<br/>- Combine clues to uncover the truth!<br/>- In-game hints<br/>- Two playable characters, switch at any time<br/>- 15 to 20 hours long on first playthrough <br/>- Multiple distinct endings to unlock <br/>- Fully voice acted (23,000 lines)<br/>- All controls supported (mouse, keyboard or controller)<br/><br/>Verified compatible with Steam Deck and Linux/Proton.", "metacritic": null, "released": "2022-08-26", "tba": false, "updated": "2024-01-24T16:29:41", "background_image": "https://media.rawg.io/media/screenshots/c49/c49528bf4fbd414d10e61bc5e3a4d56e.jpg", "website": "https://www.brokgame.com", "rating": 0.0, "rating_top": 5, "added_by_status": {"yet": 2, "owned": 27, "beaten": 3, "toplay": 12, "playing": 2}, "playtime": 2, "achievements_count": 29, "ratings_count": 5, "suggestions_count": 387, "game_series_count": 0, "reviews_count": 5, "platforms": ["PC"], "developers": ["COWCAT"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["COWCAT"], "esrb_rating": null}