{"id": 525644, "slug": "summon-fusion", "name": "Summon & Fusion", "name_original": "Summon & Fusion", "description": "Summon&amp;Fusion is a completely different and completely familiar tower defense game.<br/><br/>The game includes the concept of synthetic star rising from the move of the board, as well as a complete floor tile, while adding the growth mode of the concept of card building.<h3>Game elements</h3><br/>Call from the time and space of a beautiful girl against the demon army!<br/><br/>Thirteen characters with completely different features<br/>More than 200 different effects of card building skills<br/>A BOSS with a powerful skill<br/>Unlimited entry<br/>Each character can be enhanced with gold COINS<h3>The game features</h3><br/>Summon a character to defend an enemy in a 4 by 4 tile scene.<br/>Determine the five roles to play by configuring the team.<br/>The summoned characters appear at random according to the playing team.<br/>The pairing of the same star for the same character becomes a higher star.<br/>For every successful defense, the next wave store will refresh 3 random skill CARDS for the player to choose to grow.<br/>You can use crystal refresh to gain more skill CARDS to enhance your character.<h3>A new attempt</h3><br/>Random is the core of the game, random call, random BOSS, random skill CARDS.<br/>Through the position can be matched with a variety of tactics.<br/>Through the skill CARDS can build their own strongest defense system.", "metacritic": null, "released": "2020-12-02", "tba": false, "updated": "2020-12-04T03:12:28", "background_image": "https://media.rawg.io/media/screenshots/7ac/7ac07ef0a850214be04aa5b95ccd02b0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 355, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Philosophy♂"], "genres": ["RPG", "Strategy", "Simulation", "Casual", "Indie"], "publishers": ["BVRgames"], "esrb_rating": null}