{"id": 525629, "slug": "summerland", "name": "Summerland", "name_original": "Summerland", "description": "In every door lies another memory, and every memory unlocks another door.<br/>\n<br/>\r\nThere's a flash of white, and you suddenly find yourself in an unfamiliar place.  A locked door keeps you enclosed in this small, empty room — well, empty all except for the table that sits in the dead center of the floor.  Atop that table sits a rotary phone, completely unplugged.  The walls and carpet are uncomfortably plain, the camera in the corner not helping with that discomfort.  After a few moments, the unbearable silence is finally broken by the ringing of the rotary phone.  There's nothing left for you to do but answer the call.<br/>\n<br/>\r\nSummerland is a first-person narrative game developed by high school student Conner Rush.  You take the role of an ill detective named Matthew as you relive the events of his recent past, all the while being questioned on your moral stances.  With themes heavily revolving around ethical philosophy and the afterlife, Summerland is sure to be a unique gameplay experience.<br/>\n<br/>\r\nSummerland includes:<br/>\r\n    - An engrossing and intriguing 1.5 - 2 hour single-player story written by Conner Rush (Welcome to the Dreamscape).<br/>\r\n    - ​Beautiful visuals and design.<br/>\r\n    - A stellar voice cast featuring Ryan Beard, Rhys David, and Natalie Van Sistine.<br/>\r\n    - A haunting soundtrack composed and performed by Auric Echoes.<br/>\n<br/>\r\nHi!  This is Conner.  I just wanted to say that this game was very much made as a way to deal with some really intense existential fears of death.  This was just sort of my way of coping with those big ideas.  Even if those fears or how personal this game is to me isn't very apparent in your playthrough, just know that it's a project that really meant a lot to me and made me feel a bit of comfort.  I hope that if you struggle with these same fears, you'll find comfort in it as well.<br/>\n<br/>\r\nNote: This game uses some 3D assets legally obtained from The Unity Asset Store and other 3rd party services.  These are not claimed to be original work.", "metacritic": null, "released": "2020-12-01", "tba": false, "updated": "2023-08-08T20:25:55", "background_image": "https://media.rawg.io/media/screenshots/548/5485f1e6260480c91ad46132273bc044.jpg", "website": "https://www.fyregames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1}, "playtime": 0, "achievements_count": 9, "ratings_count": 1, "suggestions_count": 184, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["FYRE Games"], "genres": ["Adventure", "Indie"], "publishers": ["FYRE Games"], "esrb_rating": null}