{"id": 525797, "slug": "breaking-point-paele", "name": "Breaking Point (Paele)", "name_original": "Breaking Point (Paele)", "description": "<p>During the events of Dragon Age: Origins, the Circle of Magi in Ferelden is attacked by blood mages and demons.<br/>Young templar Cullen Rutherford finds himself in the midst of the chaos, his mind invaded by a desire demon who tries to use his most intimate secrets against him. <br/></p>\n<p>This is the second part of my interactive fanfiction set in the Dragon Age universe - you can find the first part here: <br/></p>\n<p>https://paele.itch.io/what-keeps-us-apart</p>\n<p>It was made with Twine (Harlowe) and takes about 15-20 minutes to play. <br/></p>\n<p><strong>Content</strong><br/>The story takes place in Dragon Age: Origins between the mage origin and the return to the Circle of Magi in Ferelden during the attack of Uldred and his followers. <br/>It contains young Cullen Rutherford's crush on a female mage (Amell/Surana), from Cullen's perspective (2nd person POV). <br/>It involves the most traumatic events in Cullen's backstory.<br/>Content/Trigger Warnings for: abuse, halluzinations, nudity, violence, death, mind control<br/>Also: the background color changes multiple times throughout the story which can be a bit sudden. <br/></p>\n<p>I do not own any content that is related to Dragon Age - the world and the characters are owned by Bioware/EA.<br/>I only made this for fun and because I love this franchise - I do not intend to make money off of it.<br/>If there is any reason for me to delete this, please let me know.</p>\n<p><strong>Quality</strong><br/>English is not my first language - please keep that in mind while reading.<br/>I am also not an experienced writer or game designer whatsoever.</p>", "metacritic": null, "released": "2020-12-03", "tba": false, "updated": "2020-12-04T04:21:59", "background_image": "https://media.rawg.io/media/screenshots/ed0/ed012f5a268bc79f8e64398e0cd77ac1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 11, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Paele"], "genres": [], "publishers": [], "esrb_rating": null}