{"id": 525710, "slug": "raptor-survival-simulator", "name": "Raptor Survival Simulator", "name_original": "Raptor Survival Simulator", "description": "The Velociraptor is known as one of the most fearsome dinosaurs. Take control of this ferocious dinosaur as he thrives and survives in this massive open world Jurassic map. Face off against many of your favorite Jurassic and Cretaceous Dinos in this fast action animal simulator. Find your dinosaur mate and start your raptor family. The map is massive so take your time to explore all the areas to find all the bosses. Run everywhere and look for the special items. Dinosaur simulation at its best.<br/>The goal of the game is to defeat all 5 bosses. The 5 bosses includes Trex, Pteranodon, Spinosaurus, Triceratops, and Dilophosaurus. The more you play, the more the Dino grows, and the stronger she gets. Loaded with super fun sounds for great gaming excitement.<br/><br/>Top Game Features:<br/>-- Your Raptor Strength, Stamina, and Speed increase with each level you advance<br/>-- Massive Open Jurassic World 3D Map<br/>-- Defeat all 6 Dinosaur Giants<br/>-- Dynamic weather system and time of day. The longer you survive, the more changes you will experience.\u2028<br/>-- Continuous action and Fast paced game play\u2028<br/>-- Your energy will be refilled when you defeat your enemy dinos<br/>\u2028\u2028-- Survival is the name of the game\u2028-- 10 Jurassic Animals included\u2028<br/><br/>Please come like us on Facebook:\u2028https://www.facebook.com/wildfootgames \u2028\u2028If you like Velociraptor Survival Simulator, please come and check out our other 3D animal simulators - We know the app is not perfect, and we welcome your constructive criticism. One user mentioned about lasers coming from the sky. Please send your suggestions to wildfootgames@gmail.com. At Wild Foot we are looking for things we can do to improve the app. Enjoy the game!", "metacritic": null, "released": "2016-06-28", "tba": false, "updated": "2020-12-04T04:00:55", "background_image": "https://media.rawg.io/media/screenshots/cd9/cd949a82784326a22e4556ca45c3de4a_wtJ5GJJ.jpg", "website": "https://www.facebook.com/wildfootgames", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 126, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Boris Tsarkov"], "genres": ["Adventure", "RPG"], "publishers": ["Boris Tsarkov"], "esrb_rating": "Everyone 10+"}