{"id": 525830, "slug": "crazy-pets-the-ultimate-chase-for-candy", "name": "Crazy Pets - The Ultimate Chase For Candy", "name_original": "Crazy Pets - The Ultimate Chase For Candy", "description": "<p><strong>Crazy Pets - The Ultimate Chase For Candy</strong></p><p>When candy thief thinks he can escape with no one watching, Your agile pets are ready for challenge. They are up for chase, not just any chase but crazy chase to catch that candy thief and bring back what's rightfully yours.<br/><br/>Help your pets avoid obstacles and collect awesome pickups in order to catch the thief and bring back your candy.<br/><br/>Every pet has its own skill, choose your pet wisely, because once they are out, there is no turning back. The chase is not easy, but neither are your pets. Stay focused, stay agile, keep those fingers tapping, your pets need you as much as you need them.<br/><br/><br/><strong>PETS</strong><br/><br/><strong>Sky </strong>- he is happy, jolly and friendly. He loves to meet new people until that new person steals candy.<br/><br/><strong>Chilli </strong>- She is agile and serious. Don't underestimate this girl. She is the fastest pet around<br/><br/><strong>Nandu </strong>- The largest one, the strongest one, small bugs don't bug him. Please underestimate him, it will be fun.<br/><br/><br/><strong>PICKUPS</strong><br/><br/><strong>Coins </strong>- Use them to unlock new pets and climb the leaderboard.<br/><br/><strong>Gems </strong>- Use them to unlock new pets and revive them during the chase.<br/><br/><strong>Heart </strong>- It gives your pet second life. Collect them to cheat death<br/><br/><strong>Pet Food</strong> - When chase heats up, and pet's speed goes out of control, these will help you to calm down your pet.<br/><br/><strong>Dragon Boost</strong> - Dragon gem will convert your pet into a dragon for a while, helping them cover distance rapidly while smashing through the obstacles<br/><br/>Get...set...chase</p>", "metacritic": null, "released": "2020-12-03", "tba": false, "updated": "2020-12-04T04:28:22", "background_image": "https://media.rawg.io/media/screenshots/8fa/8fa05026264e5769616f28848bf52979.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 74, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["meeku"], "genres": ["Action", "Adventure"], "publishers": [], "esrb_rating": null}