{"id": 525980, "slug": "filhos-de-heroi", "name": "Filhos de Herói", "name_original": "Filhos de Herói", "description": "<p>\"Azuria... Uma energia mística e invisível que tem efeito em todas as formas de vida. Naturalmente caótica, ninguém sabe ao certo sua origem ou sua verdadeira função, se é que há alguma, mas alguns são capazes de senti-la como uma leve brisa de verão em seus rostos, como um reconfortante calor em seus corações, ou mesmo uma sensação inexplicável de ligação com a natureza. Seus efeitos ao nosso redor, porém, são fáceis de serem notados por qualquer um que possua bons olhos... <br/><br/>Em uma região do mundo onde a Azuria é muito mais caótica do que o normal, é possível notar os efeitos desse caos em toda parte. A terra não é fértil, plantas e animais têm dificuldade em sobreviver, e grandes desastres naturais como maremotos, terremotos e dilúvios são comuns, mas é justamente nessa região que uma tribo de pequenos homens conhecidos como hilinois encontraram um jeito de manter a Azuria sob controle, para posteriormente equilibrá-la através de monumentos mágicos. A partir de então, tudo muda nessa região, e um novo reino nasce sob a bênção dessa energia. Agora, a terra se torna fértil, grandes florestas surgem, os rios passam a ter água limpa, e a vida como um todo encontra todas as condições de que precisa para prosperar. Entretanto, devemos estar atentos a realidade: O fato do nosso reino  estar em uma região única no mundo onde a Azuria se encontra em equilíbrio, torna Thalazan um lugar muito cobiçado, e isso aumenta muito as responsabilidades do rei Arcenius IV em proteger seu reino e o seu povo.\"<br/><br/>- Trecho retirado do livro \"Pequenos mistérios da Azuria\", do escritor Casimiro.<br/><br/>---<br/><br/>Filhos de Herói é um jogo completo feito para o concurso Café Game Awards. Em um reino abençoado com uma misteriosa energia conhecida como Azuria, cabe a você assumir o papel de um dos filhos de grande herói Leonel e livrar Thalazan da possível destruição!<br/><br/>- Use um sistema único de mudança de classes e aprendizado de habilidades de batalha para criar personagens únicos;<br/>- Explore as diferentes regiões de Thalazan em um sistema de deslocamento inspirado em jogos como Breath of Fire IV, Final Fantasy Mystic Quest e o saudoso Super Mario World;<br/>- Dúzias e mais dúzias de estratégias diferentes para você experimentar em batalha, devido ao grande número de combinações de classes e habilidades;<br/>- Ao todo, são oito personagens jogáveis. Cada um deles pode escolher seis classes diferentes, dependendo de seu perfil. Como são três perfis diferentes (astúcia, combatividade e perspicácia), o jogo conta com 18 classes no total;<br/>- 6 a 10 horas de gameplay, dependendo do seu ritmo de jogo.<br/><br/>---<br/><br/>Dicas gerais:<br/><br/>- Nesse jogo os itens de cura são muito importantes, por isso é recomendado que você sempre tenha um bom estoque antes de ir para uma área desconhecida;<br/>- Existem muitas combinações possíveis de classes e habilidades, por isso experimente diferentes possibilidades até conseguir montar um time que seja adequado ao seu estilo de jogo;<br/>- É uma boa ideia conversar com os aventureiros que ficam nas Academias de Classes. Isso pode abrir seus olhos para boas estratégias de batalha.<br/></p>", "metacritic": null, "released": "2020-12-03", "tba": false, "updated": "2020-12-04T05:06:12", "background_image": "https://media.rawg.io/media/screenshots/ebb/ebbe8ec7b2cb46677f1487cf8d48ed2c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 166, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SolonWise"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}