{"id": 526198, "slug": "goldeyes", "name": "GoldEyes", "name_original": "GoldEyes", "description": "<p>Descrição em Português (Brasil):<br/></p>\n<p>Um jogo que vai desafiar a sua visão! Esse jogo de TAP consiste em um grande desafio para o jogador que é tentar encontrar o objeto que esta diferente dos demais em razão da cor e posicionamento sutilmente diferente na tela, cada vez que o objeto distinto for tocado ou clicado o jogador será direcionado a uma nova tela, e caso seja tocado o objeto errado o jogador será direcionado para o início do jogo que se reiniciará do zero, ao encontrar todos os objetos distintos o jogador finaliza o jogo e vai para a tela de vencedor onde será exibida a mensagem informando que ele venceu o jogo.</p>\n<p>Description in (English):</p>\n<p>A game that will challenge your vision! This TAP game is a great challenge for the player, which is to try to find the object that is different from the others due to the subtly different color and positioning on the screen, each time the different object is touched or clicked, the player will be directed to a new screen, and if the wrong object is touched the player will be directed to the beginning of the game that will restart from zero, when finding all the different objects the player ends the game and goes to the winner screen where the message will be displayed informing that he won the game.</p>\n<p>Prévia do Jogo no YouTube - Game Preview on YouTube:</p>\n<p>Prévia do Aplicativo no YouTube - App Preview on YouTube:</p>\n\n<p>Faça o Download:  AppStore<br/></p>\n<p>Faça o Download:  PlayStore<br/></p>\n<p>Página do jogo: Instant Games</p>\n<p>Conheça Nossa Página:  Edinesoft</p>", "metacritic": null, "released": "2020-12-02", "tba": false, "updated": "2020-12-04T06:00:58", "background_image": "https://media.rawg.io/media/screenshots/373/373273101f52bc4245d78b3e2e6f3b73.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 41, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Edinesoft"], "genres": [], "publishers": [], "esrb_rating": null}