{"id": 526269, "slug": "prison-scapist", "name": "Prison Scapist", "name_original": "Prison Scapist", "description": "Prison Scapist\r\n<p>Platform game that is about of a prisoner called <strong>Franklin </strong>who wants to escape from jail, avoiding the different obstacles and guards, with the help of a <strong>Fairy </strong>that will be guiding him through this journey.<br/></p>\n<p>The objective is to collect each one of the objects necessary to open each one of the doors in order to advance to different zones of the prison, avoiding the guards or fleeing from them. In each zone of the prison you will have a score, the faster you do it the more score you will have.</p>\r\nMain characteristics:\r\n<ul><li>Each guard has a range of vision and Franklin has different ways to avoid each of them, one of them is to walk slowly without entering his range of vision, another way is to lean against the walls under a flag so he cannot be detected by them, unless they see him. </li><li>If the guards see Franklin they will start chasing him around the area while he is in their range of vision, in order to escape from them Franklin has to enter a prison cell again, so the guards will stop chasing him.</li><li>Franklin has a skill that he can use if he waits for a guard to lean against a wall. This skill will disappear from a guard for a few seconds and allow Franklin to move more freely. </li></ul>\n<p>-</p>\n<p>Game made in Unity3D and other free software in order to obtain an initial knowledge on how to develop video games, therefore they may have certain bugs or other problems, I recommend reading the guide in the folder before playing. I hope you give him a chance to try the game, see you in the comments. :D<br/></p>\n<p>The game consists of six levels that progressively increase its difficulty and is available for Windows, to play it you just have to download the .zip file below, then unzip it and finally enter the folder and run the application PrisonScapist.exe.</p>\n<p>I will be attentive to any comments about the game and I really hope you have fun. :)<br/></p>", "metacritic": null, "released": "2020-12-02", "tba": false, "updated": "2020-12-04T06:17:08", "background_image": "https://media.rawg.io/media/screenshots/759/759970f7dd5f420ef4c87112fc635482.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 132, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Nufotedam"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}