{"id": 526290, "slug": "rajd-przez-polske", "name": "RAJD PRZEZ POLSKE", "name_original": "RAJD PRZEZ POLSKE", "description": "<p>The work by the duo Grażyna Monika Olszewska / Rufus Rufson (b. 1991 and 1983 respectively) is a visualization of Poland’s civilizational ambitions and post-1989 modernization focused on infrastructure. It also expresses tensions around geographical identity which still accompany these processes. It consists of an informational totem – a feature which was characteristic of new investments and museums in the early 2000s – and a specially designed game. The game is built around the theme of a race, which refers to the Polish post-1989 cult of traffic capacity and the considerable increase in car imports from Germany to Poland after joining the EU. The aesthetics of the game and the form of the totem reflect the postmodern fantasy and chaos of identity. The landscape of the rally includes architectural elements borrowed from  Euro banknotes. The gates and bridges depicted on the notes symbolize a common European heritage, but in fact they exist only in political imagination and as graphic design. This is a commissioned artwork produced especially for this exhibition.</p>\n\n<p>Totem / Rajd przez Polskę Praca duetu Grażyna Monika Olszewska / Rufus Rufson jest wizualizacją modernizacji skupiającej się na infrastrukturze, a także obrazem tożsamościowych napięć towarzyszących tym procesom. Praca składa się z totemu informacyjnego - charakterystycznego elementu nowych inwestycji i muzeów początku lat dwutysięcznych, a także specjalnie zaprojektowanej gry Rajd przez Polskę (odnoszącej się do tytułu z roku 1996). Wykorzystując motyw wyścigu gra nawiązuje do kultu przepustowości dróg oraz znacznego wzrostu liczby importowanych samochodów z Niemiec do Polski po wejściu do UE. Estetyka gry oraz forma totemu są odbiciem postmodernistycznej fantazji i chaosu tożsamościowego. Krajobraz wyścigu zawiera elementy architektoniczne zapożyczone z waluty euro: bramy i mosty zamieszczone na banknotach, które symbolizują wspólne europejskie dziedzictwo, ale nie istnieją w świecie rzeczywistym, a jedynie w politycznej wyobraźni i formie graficznej.<br/></p>", "metacritic": null, "released": "2020-12-02", "tba": false, "updated": "2020-12-04T06:21:38", "background_image": "https://media.rawg.io/media/screenshots/be0/be0b4aedd895a038b6e1041288fdde15.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 121, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["grazyna_rufus"], "genres": ["Racing"], "publishers": [], "esrb_rating": null}