{"id": 526252, "slug": "chronicles-of-darkness-itch", "name": "Chronicles of Darkness (itch)", "name_original": "Chronicles of Darkness (itch)", "description": "<p><strong>SO WHAT IS CHRONICLES OF DARKNESS?</strong></p>\n<p>Chronicles of Darkness is a old style rpg game with some dark fantasy elements (not implemented in this demo) created entirely on RPG Maker MZ! currently this demo only show the beggining of the game, with some small NPCs dialog and one almost finished side quest. In the final version I intend to add a lot of other things and more dialog to improve game experience.</p>\n\n<p><strong>GAME SYNOPSIS</strong><br/></p>\n<p>What happens when a girl has her life destroyed by a group of bandits? This game will show you the answer for this question. In this demo you'll follow the story of Eleanor  a villager girl who belongs to the 5th house of Flen family that lives in Drinconwood Village with her Mom Mirian, her Dad Bartholomeu and her little brother Aaron.</p>\n<p>See how Eleanor has her life destroyed by those bandits and follow her in her path to revenge or justice depending of your point of veiw.</p>\n<p>In this demo you'll play until the begining of the tragedy, and you'll have just a few quests to do at this point. If you played and liked please leave a comment in the description below to show your opnions and tips for improvement. If you do that I'll be greatfull to you guys. And if you really loved that game please donate to support the development of Chronicles of Darkness.</p>\n\n<p><strong>IF YOU WANT TO SEE MORE ABOUT THIS GAME?</strong> Click here</p>\n\n<p><strong>HOW TO INSTALL?</strong></p>\n<p>Just unpack it using 7zip or winrar and play it.</p>\n\n<p><strong>HOW DO I PLAY IT?</strong></p>\n<p>Just use the arrow keys to walk. Z or Enter is to interact. X or ESC to cancel or access the menu;</p>\n\n<p><strong>MANY THANKS TO THIS GUYS!</strong></p>\n<p>JP SOUNDWORKS.<br/>Platonic Game Studio<br/>Landon</p>\n\n\n<p>O que acontece quando uma garota tem sua vida destruída por um grupo de bandidos? Este jogo irá mostrar a você a resposta para esta pergunta. Nesta demo, você seguirá a história de Eleanor, uma aldeã que pertence à 5ª casa da família Flen que mora na Vila de Drinconwood com sua mãe Mirian, seu pai Bartholomeu e seu irmão mais novo Aaron.</p>\n<p>Veja como Eleanor teve sua vida destruída por aqueles bandidos e siga-a em seu caminho para a vingança ou a justiça, dependendo do seu ponto de vista.</p>\n<p>Nesta demo, você jogará até o início da tragédia e terá apenas algumas missões para fazer neste momento. Se você jogou e gostou, deixe um comentário na descrição abaixo para mostrar suas opiniões e dicas de melhorias. Se vocês fizerem isso, serei grato a vocês.</p>\n\n<p><strong>Como Instalar?</strong></p>\n<p>Apenas extraia o jogo usando o 7zip ou winrar e então é só jogar.</p>\n\n<p><strong>Como Jogar?</strong></p>\n<p>Use as setinhas do teclado para se mover. Z ou Enter para interagir. X ou ESC para cancelar ou acessar o menu.</p>\n\n<p><strong>Para quem for jogar em português e não souber Inglês!</strong></p>\n<p>No momento não existe nenhum tipo de plugin de tradução das teclas do menu para o RPG Maker MZ, e os plugins do MV não estão funcionando bem na nova engine, então se você tiver dificuldade logo abaixo seguirá a tradução das opções:</p>\n<p>Fight = Lutar<br/>Inventory = Inventário<br/>Skill = Habilidades<br/>Equip = Equipar<br/>Status = Status<br/>Game End = Voltar ao Menu Principal<br/>Save = Salvar<br/>Options = Opções<br/>Formation = Formação do Grupo<br/>Guard = Defender<br/>Attack = Atacar<br/>Escape = Fugir<br/>Weapon = Arma<br/>Armor = Armadura<br/>Key Item = Itens Chave<br/>Sell = Vender<br/>Buy = Comprar<br/>To Title = Voltar ao Menu Principal<br/>New Game = Novo Jogo<br/>Continue = Continuar<br/>Clear = Limpar<br/>Optimize = Otimizar</p>", "metacritic": null, "released": "2020-12-02", "tba": false, "updated": "2020-12-04T06:14:03", "background_image": "https://media.rawg.io/media/screenshots/0fb/0fbb8f2f6c60575a9ed098093d5e9fc2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 136, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["EduardoGiovani"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}