{"id": 526309, "slug": "fury-arena-the-desert", "name": "Fury Arena (the desert)", "name_original": "Fury Arena (the desert)", "description": "<p><strong>Gameplay</strong></p><p>A battle tank war game with the aim of using logic to discover a mystery: how to get the maximum point limit.</p><p>The gameplay is very simple, where the dynamics are to move through the desert, collect the flags, attack and defend against tanks of wars scattered but ready to attack.<br/>Mobile enemies will appear to prevent you from getting your maximum.</p>\n<p><strong>Summary</strong></p><p>A combat game that hides a trap and a logical secret that leads to the highest possible score.</p><p>The goal is to reach this score.</p>\n<p><strong>Control</strong></p><p>PC: use the arrow keys to move, the space key to shoot with the cannon, the M key for machine gun fire. Use the right mouse button on the enemies to aim and left button to fire the cannon shot.</p><p>MOBILE: it has directional detas, button for cannon fire and button for machine gun fire. Touch the enemy to enable the aim.</p>\n<p><strong>Story</strong></p><p>Basically you are the commander of a battle tank lost in a desert trying to survive in front of enemies.<br/></p><p>The initial project was a game of fighting detanches of war in the desert, but the idea evolved into traps and traps, flags to be collected, enemies that appear at strategic points to disrupt the score.</p><p>The goal became the discovery of the maximum score and how to obtain it.</p>\n<p><strong>Credits</strong><br/>Helcio Ramos de Lima<br/><em>(c) All rights reserved</em></p>", "metacritic": null, "released": "2020-12-02", "tba": false, "updated": "2020-12-04T06:26:10", "background_image": "https://media.rawg.io/media/screenshots/f9a/f9ad81b995a8e41a9c8a0569f921af03.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 40, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Android"], "developers": ["helcioramos"], "genres": ["Action", "Strategy"], "publishers": [], "esrb_rating": null}