{"id": 526509, "slug": "we-need-to-go-deeper-itch-deli-interactive", "name": "We Need To Go Deeper (itch) (Deli Interactive)", "name_original": "We Need To Go Deeper (itch) (Deli Interactive)", "description": "<p><em>*STEAM KEYS ONLY: This game utilizes Steam Matchmaking for its online multiplayer. As such we are only offering Steam Keys at this time. Included with purchase are instructions for redeeming your Steam Key.<br/></em><br/><strong>DIVE. DISCOVER. DIE. Crew a submarine with friends in We Need To Go Deeper - a 2-4-player cooperative submarine roguelike set in a Verne-inspired undersea universe.</strong><br/><br/><br/></p>\r\n2-4-Player Online Co-op\r\n<p>Designed with human interaction in mind, in We Need to Go Deeper you communicate or perish. Play with friends, strangers, or bots!<br/></p>\r\nCrew Your Submarine\r\n<p>Pilot, repair, load torpedoes and reroute power as you and your crew dash around one of several unlockable submarines on your voyage into the deep.<br/><br/><br/></p>\r\nExplore The Living Infinite\r\n<p>The Living Infinite is an ever-changing undersea trench – with randomized biomes, on-foot expeditions, loot, civilizations and a dynamic difficulty system to keep you guessing every time you take a dive.<br/></p>\r\nWield a Variety of Tools\r\n<p>From wrenches, to wedding rings, to electricity-powered weaponry, a wide selection of tools and weapons await discovery.<br/></p>\r\nCustomize Your Adventurer\r\n<p>Choose from a wide variety of era-specific outfits from the 19th century so you can dive in style! Non-gender-specific mustaches included.<br/></p>", "metacritic": null, "released": "2020-12-01", "tba": false, "updated": "2020-12-04T07:16:22", "background_image": "https://media.rawg.io/media/screenshots/e92/e9280862cd228bb1a059517b13c765c8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 293, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Deli Interactive"], "genres": ["Action", "Simulation"], "publishers": [], "esrb_rating": null}