{"id": 526610, "slug": "when-pigs-fly-sanjithar", "name": "When Pigs Fly (sanjithar)", "name_original": "When Pigs Fly (sanjithar)", "description": "<p>Pigs flying? Who would have ever thought of that? Well, Hugo the Pig did when he discovered Farmer Joe's glider. Help Hugo escape the farm and Farmer Joe's reach as he soars through the mountains! Start flying by pressing <strong>P</strong> and control Hugo with the <strong>WASD</strong> keys. W and A control up and down rotation of his movement and A and D control the left and right. Try to fly as far as you can. Note that this is my first game written from scratch using Java and OpenGL through LWJGL. </p>\n\n<p><strong>Install:</strong><br/></p>\n<p>I have compiled native versions for both macOS and Windows. The file structures for the natives are very similar. Download the specific zip file for your system and extract it.  Open the folder and double click on the executable (will be called \"macos\" or \"windows\"). If it is your first time launching, you may get a few security warnings. These can be dismissed and, if you are on Mac, you have to go through System Preferences to do so(note that there will be two warnings and thus two dismissals). Let me know if you have any issues with the install and I apologize for any inconvenience. </p>\n\n<p><strong>Credit</strong>:<br/></p>\n<p>All the models are downloaded from Google Poly under the CC-BY License. The creator of these files is Poly User \"Poly by Google.\" Some of the code for the engine is adapted from Antonio Hernández Bejarano's guide. In the project you will find a version of the Java Runtime Environment(JRE) that is legally allowed to be distributed due to it being created with the Java JDK 11 tool \"jlink.\" All legal information about it can be found in the LEGAL folder within the \"when-pigs-fly-runtime\" folder.</p>\n\n<p><strong>Notes:</strong><br/></p>\n<p>There are a few known bugs, as expected, with this being a game jam and my first experience with OpenGL. There are issues with the model loading on different screens after reload and the terrain collision detection. If there are any issues you find, please let me know in the comments. </p>\n\n<p><strong>Code:</strong><br/></p>\n<p>The project is open source and can be found on my GitHub page. Please leave any issues there and a star would be greatly appreciated. Please also <strong>do not </strong>redistribute the Java runtime for this. </p>", "metacritic": null, "released": "2020-12-01", "tba": false, "updated": "2020-12-04T07:39:05", "background_image": "https://media.rawg.io/media/screenshots/196/196c882a0950cb91bca08ea518f31315.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 14, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["sanjithar"], "genres": ["Action"], "publishers": [], "esrb_rating": null}