{"id": 526636, "slug": "drbot-evil-haunted-mansion", "name": "Dr.Bot Evil Haunted Mansion", "name_original": "Dr.Bot Evil Haunted Mansion", "description": "<p><strong>- Short Description -</strong></p>\n<p>A short Halloween themed FPS game made using the Unity's FPS microgame template.</p>\n\n<p><strong>- Dev Story -</strong><br/></p>\n<p>What started as a simple project to test out what FPS template had to offer, soon escalated to become a rather big ambitious project! In fact it took me roughly an month of countless iterations in order to achieve a build that I am quite happy with.</p>\n<p>Another reason on why it took me so long to achieve a satisfactory build, was that lot's of the assets where made entirely from scratch with the help from external tools, but even Unity's built-in ProBuilder. </p>\n\n<p>That being said, since this game was created for Unity's learn November game showcase, as the deadline was gradually getting closer, I did decide to use several other free assets found in the Unity Marketplace to speed up with the develop process, such as props, audio, and visual effects.</p>\n\n<p>Additionally, as it was quite some time since I got the chance to practice my basic C# skills, I had to sharpen it even further in order to implement some of my much more complicated ideas.</p>\n\n<p><strong>- Create your own FPS! -</strong><br/></p>\n<p>Like what you see and feeling adventurous? Then head over to Unity and check out their fun FPS tutorial! No scripting knowledge is involved whatsoever, only a passion for video games!</p>\n<br/>\n<p><strong>- Fun Facts -</strong><br/></p>\n<ul><li>The boss voice is actually mine, I made it robotic thanks to this handy voice changer</li></ul>\n\n<ul><li>Originally my idea for the boss battle was the enemies to come out from the ground sort like zombies, unfortunately due to time retrains I had to cut this feature</li></ul>\n\n<ul><li>Also during the boss battle I wanted to have three difference phases where on completion of each one, several different visual effect would occur, like old film grain, pixelated screen and so on.</li></ul>\n\n<ul><li>This is the first successful FPS game I was able to design, develop and finally publish</li></ul>", "metacritic": null, "released": "2020-12-01", "tba": false, "updated": "2020-12-04T07:44:20", "background_image": "https://media.rawg.io/media/screenshots/9b4/9b4b330194c9fc5c5daf1ad9509da5be.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 152, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux", "Web"], "developers": ["PtJones"], "genres": ["Action", "Adventure"], "publishers": [], "esrb_rating": null}