{"id": 526617, "slug": "moon-defence", "name": "Moon Defence", "name_original": "Moon Defence", "description": "<strong>Moon Defence</strong> is very simple “stand-and-shoot” game. You control the turret mounted amidst the every extraterrestrial colony to defend the remnants of earthlings.<br/><br/><br/><br/>You step from moon to moon in this dangerous journey with an uncertain outcome. Stand still and shoot straight all the enemies. Control a replenishable energy budget, pump your weapon, research artifacts. And perhaps you shouldn’t destroy a monoliths.<br/><br/><strong>Key Features</strong><br/><br/><ul><li>Extremely simple game mechanic offering tactical variety<br/></li><li>Unique landscapes of biggest moons across Solar System <br/></li><li>Ability to create a defensive infrastructure and customizable turret armament<br/></li><li>Bonus levels on every planet system</li></ul><h3>Plot</h3><br/>Year 2061.  Weaponry rusts in museums. Earthlings have forgotten the wars as they master the Solar System. Science labs and industrial bases are posted wherever a human feet can step.<br/><br/><br/><br/>Once the communication with farther settlements has lost. The colonies evaporate one by one. From the ripped reports it becomes clear that unknown agressors cruelly eradicate all of the colonists. Nobody can perceive the motivation of attackers.<br/><br/>Since the metropolis is too far, it can't help fast enough. Settlers must construct weapon of everything they have. Plasmagenerators, mining lasers were welded on the excavator cabin, it was mounted on the turret and reliably buried in the ground close to base.<br/><br/><br/><br/>The remainings of earthlings on Pluto, Saturn, Mars, Moon and other are resourceful and fearless. Desperate defense turns into encouraging struggle. It’s time to choose your way to protect, banish or collapse.", "metacritic": null, "released": "2020-12-01", "tba": false, "updated": "2021-07-30T02:38:33", "background_image": "https://media.rawg.io/media/screenshots/5d6/5d6ef17a0ade59d699520a432f014759.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 16, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["unluerbaris", "Ivan Kulibin"], "genres": ["Action", "Shooter", "Indie"], "publishers": ["Ivan Kulibin"], "esrb_rating": null}