{"id": 526769, "slug": "lunas-odyssey-jam-edition", "name": "Luna's Odyssey (Jam Edition)", "name_original": "Luna's Odyssey (Jam Edition)", "description": "<p>Our GameOff 2020 Game Jam edition of our game, Luna's Odyssey, a fun little Sci-Fi arcade-style platformer.  Reunite Luna and the Earth in this short little adventure, navigating through space and  traversing wormholes. Be sure to steer clear of asteroids and those other bully moons! </p>\r\nControls:\r\n<ul><li>Control - Brake</li><li>Space - Accelerate</li><li>Z or / - Redirect Powerup</li><li>X or . - Shield Powerup</li><li>Shift - Rewind Powerup</li><li>Esc - Pause</li></ul>\r\nPowerups:\r\n<p>The Redirect powerup allows you to change directions. Use Z or / to open up the redirect interface, which opens a semi-circle around the moon. This is the allowable range you can redirect to, indicated by the green and red arrow. The further you click away from the player, the further you'll redirect!</p>\n<p>The Shield powerup allows you to deflect damage from other orbiting moons and any damage from asteroids! Be weary though as the other moons are affected by your trajectory!</p>\n<p>The Rewind powerup is as it sounds, rewind your movement up until a certain point! It might come in handy in certain situations, and it might even be a necessity at points.</p>\n\n<p>Features coming soon in a new development version: Achievements, Fullscreen, Sandbox Mode and an actual Credits Page &lt;3</p>\n<p>---------------------------------------------------</p>\n<p>Chrome users be sure to enable \"Use hardware acceleration where available\" in your Settings, under Advanced Settings in System</p>\n<p>---------------------------------------------------</p>\n<p>This is our first ever Game Jam, and our first attempt at a somewhat finished game. During the development of this game, we've decided to continue developing the project, hopefully looking to fully port it to mobile and making it a more fun and accessible game for everyone. </p>\n\n<p>Feel free to join us our Discord server! Any and all suggestions are highly welcomed and we can't wait to hear any sort of feedback you might have!</p>\n<p>https://discord.gg/3P5wqTRCzN<br/></p>", "metacritic": null, "released": "2020-12-01", "tba": false, "updated": "2020-12-04T08:20:58", "background_image": "https://media.rawg.io/media/screenshots/54b/54b48fb64210e083d60f1ebd04255655.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 145, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["KTGames"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}