{"id": 527443, "slug": "bella-the-girl-in-the-woods", "name": "Bella: The girl in the Woods", "name_original": "Bella: The girl in the Woods", "description": "<h3>\"Ever Wondered what happened to those who went missing in the forest while camping\"?</h3><br/>\"Bella: The girl in the Woods\" is an Indie survival horror game developed by one person. This game is based on true events that happened to a guy went he went camping alone in the forest and encountered a girl in the middle of the night. Out of curiosity he searched all over the forest and found an abandoned house where he learned the secrets of Bella and the reason behind the people who went missing while camping.<br/><br/><br/><br/>By using a fully physically simulated world, cutting edge 3D graphics and a dynamic sound system, the game pulls no punches when trying to immerse you. Once the game starts, you will be in control from the beginning to the end. There are no cut-scenes or time-jumps, whatever happens will happen to you first hand.<br/><br/><br/><br/>An experience that will chill you to the core. Something emerges out of the darkness. It's approaching. Fast.<br/><br/><br/><br/>Some dark sinister secret is hidden in this forest, and it won’t be a place of happiness as it used to be any longer.<br/><br/><h3>FEATURES:</h3><br/><ul><li>Next-Gen Horror – Bella the girl in the woods will shock you with realistic graphics and terrify you edge-of-your seat gameplay.<br/></li><li>Harnessing the power of an evolved Unreal Engine 4 along with iClone 7 and Character Creator 3 for animations to give you more realistic experience.<br/></li><li>Immerse yourself in a truly spine-tingling experience by a true camping event that happened in the forest.<br/></li><li>Find your way out of the haunted woods either by solving the puzzles or by finding a way to destroy bella.</li></ul>", "metacritic": null, "released": "2020-12-04", "tba": false, "updated": "2020-12-07T02:31:45", "background_image": "https://media.rawg.io/media/screenshots/f5b/f5b7b8d8c2bcd3d6925dcfc0f18d3486.jpg", "website": "https://www.jannerbros.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 318, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jannerbros"], "genres": ["Action", "Adventure", "Strategy", "Casual", "Indie"], "publishers": ["JannerBros"], "esrb_rating": null}