{"id": 527492, "slug": "tank-road-racing-combat-traffic-rider-stunts", "name": "Tank Road Racing Combat & Traffic Rider Stunts", "name_original": "Tank Road Racing Combat & Traffic Rider Stunts", "description": "Go Tanks and enjoy the winner’s feeling on death race!<br/><br/>Playing role of colorful unique style tanks, your mission is to win the death race not only on grand prix roads but also on various difficult types of terrains such as deserts, docks, forests.<br/><br/>To complete every level, tanks have to use weapons like guns, lasers, rockets, tank cuirass to combat other competing tanks.On every death race road, another task of tanks is to collect items (Drop Bomb, Horning Cartridge, Global) to increase battle indicators.<br/><br/>More specially, tanks also have to face against harsh natural challenges like tsunami, volcano eruption and so on on each level, depending on chosen terrains.<br/><br/>Unlike racing military tanks, this game brings you the feeling of speed and power of tanks racing on real local terrains at present.<br/><br/>Let’s get started Fast paced 3D Tank racing game.<br/><br/>FEATURES<br/><br/>■ RPG racing games with different battle index of health, accel, attack and handling<br/><br/>■ 5 fantastic of tanks: Freeze Tank, Grizzly Bear, Laser Tank, Apocalypse, Panza in colorful designed styles (Sport, Old Fashion, Fashion)<br/><br/>■ Various weapons and equipments such as guns, lasers, rockets, tank cuirass to upgrade tanks for the increase in combat skills<br/><br/>■ Unique designed racing road based on real local terrains: deserts, docks, forests<br/><br/>■ 3D animation support<br/><br/>■ Realistic effects on sound based on the laws of physics", "metacritic": null, "released": "2017-08-01", "tba": false, "updated": "2020-12-07T03:02:33", "background_image": "https://media.rawg.io/media/screenshots/b8d/b8dcf46475d6e4c55f88effc97004021_oLmmNwr.jpg", "website": "https://www.facebook.com/Vector-Entertainment-557257244422350/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 121, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Vector Labs"], "genres": ["Racing"], "publishers": ["VECTOR LABS"], "esrb_rating": "Everyone 10+"}