{"id": 527496, "slug": "tile-connect-free-tile-puzzle-match-brain-game", "name": "Tile Connect - Free Tile Puzzle & Match Brain Game", "name_original": "Tile Connect - Free Tile Puzzle & Match Brain Game", "description": "Connect tiles with delicate images by pairs in the limit of time. As you eliminate all the tiles, you can pass the level! Become a master🏆 level by level! Play faster and faster to train your brain! Ready to fully enjoy the collection of various images on the tiles: cute animals 🐼, fresh fruits 🥑, delicious cakes 🎂, beautiful clothes 👗, cool vehicles 🚗, lovely toys 🧸, etc. You can definitely find your favorite ones! 😊<br/><br/> Latest version of Tile Connect  📣<br/><br/>- Three small games in the Playground Mode: <br/>Woodblock - Place the pieces into board, fill in a vertical or horizontal line to clear them!<br/>Zuma - Click two typical tiles to eliminate before the tile line goes to the terminal!<br/>Find the same - Find the same tiles to eliminate them in the limit time!<br/>They are all ready for you now! New gameplay, new joy! 😀<br/><br/>Key Features 💡<br/>-Various images on the tiles: Thousands of images randomly appear level by level! <br/><br/>- Easy rule to play: Only need to tap tiles and connect them!<br/><br/>- Powerful tools to choose: Unlock tools to pass more quickly!<br/><br/>- Autosave and offline: Play at anytime and anywhere! <br/><br/>- Task focus and concentration enhance: Wonderful gameplay to train your brain!<br/><br/>How to play ❓<br/><br/>- Find two identical tiles without the block of other tiles!<br/><br/>- Tap the tiles to connect with maximum three straight lines!<br/><br/>- Use powerful tools as you want!<br/><br/>- Eliminate all the tiles within the limit time!<br/><br/>- Pass levels one by one to become a master!<br/><br/>Now come to play this free puzzle game, Tile connect! Prove you are a master at connecting tiles!<br/><br/>Hope you have a wonderful time playing!", "metacritic": null, "released": null, "tba": false, "updated": "2020-12-07T03:04:41", "background_image": "https://media.rawg.io/media/screenshots/9c8/9c84e156ef5c7d41e8ee35551832233f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 86, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Higgs Studio"], "genres": ["Board Games"], "publishers": [], "esrb_rating": "Everyone"}