{"id": 527400, "slug": "mind-muscle-vr", "name": "Mind Muscle VR", "name_original": "Mind Muscle VR", "description": "Have you ever felt that you are secretly capable of much more? That your body can do more, but you have not unlocked this inner ability yet? Allow us to help bring out that part of you with this training. <br/>\n<br/>\r\nImprove the connection of your nervous system to your muscles, increasing the gains that you make when you work out. By exercising your nerves (even just once!) you could make your muscles perform faster, stronger, and better in every way. <br/>\r\nPerfect for:<br/>\r\nAthletes wanting to maximize their performance.<br/>\r\nPower-lifters looking to push their body to it's real limits (or better).<br/>\r\nElderly or disabled people who want an easy but effective workout. <br/>\r\nA pre-workout pump. <br/>\r\nChanging your body into the shape you want--using your mind. <br/>\r\nRest days.<br/>\n<br/>\r\nSimply pick up the virtual weights and use the guided movement meditations to enhance your muscular performance. <br/>\r\nThere are no points, no tracking, and no gold stars to achieve. Use this as a tool for your advancement. <br/>\r\nThere is no special state of mind to achieve. Just feel into the sensations of your own body as you listen to the guided audio. This will improve the precision of control that you have with your body. <br/>\r\nYou may want to return regularly for a refresher, but even just one focused practice session can have a profound effect on your future workouts, making your muscle control very precise.", "metacritic": null, "released": "2020-12-05", "tba": false, "updated": "2020-12-07T02:06:28", "background_image": "https://media.rawg.io/media/screenshots/745/745a6a493def6d34c41505def260bcad.jpg", "website": "https://TransformHypnosis.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 130, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jackson Stock"], "genres": [], "publishers": ["Jackson Stock"], "esrb_rating": null}