{"id": 527606, "slug": "orphea", "name": "Orphea", "name_original": "Orphea", "description": "<p>Orphea is a short NES (Nintendo Entertainment System) shooter built for Lost Cartridge Jam 2020. It is a designed to be reminiscent of early NES ports of arcade games. Many ports of that era were non-traditional in that they added more non-linear elements to the straight-forward design of their arcade originals.</p>\n<p>Orphea was implemented as an actual NES ROM and so must be run in a NES emulator. For convenience, I have packaged this game with the Windows version of FCEUX. You can easily <strong>run Orphea by double-clicking on PlayGame.bat</strong> to launch the rom in FCEUX. Of course, you can run Orphea in your emulator of choice. If you write the game to a cart, you may even be able to play it on an actual NES (though I haven't tried this.) For  more info about FCEUX, see the following page: http://fceux.com/web/home.html.</p>\n<p>In Orphea, you must avoid or destroy enemies while navigating the level in order to find a key that will let you go through the door to the boss of the game. Along the way, you may also pick up Bits, small helper ships that will increase your firepower.</p>\n<p>The default controls for the game in FCEUX are:</p>\n<ul><li>Arrow Keys to Move (D-Pad)</li><li>Enter to Start Game (Start Button)</li><li>F to Shoot (A Button)</li><li>D to Change Formation of Bits (B Button)</li></ul>\n<p>Much of this game was built using the tools and tutorials from https://nesdoug.com/. Without Doug's fabulous website, this game would not have been possible.</p><p>The zip file contains the rom and a NES emulator. You can also download the NES rom by itself.</p>", "metacritic": null, "released": "2020-12-06", "tba": false, "updated": "2020-12-07T03:29:26", "background_image": "https://media.rawg.io/media/screenshots/e20/e20d0539be7c5b5fd2cfd5dc17099c79.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 91, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Skyboy Games"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}