{"id": 5276, "slug": "persona", "name": "Shin Megami Tensei: Persona", "name_original": "Shin Megami Tensei: Persona", "description": "<p>Set in 1996, Megami Ibunroku Persona centers around the protagonist and his classmates at St. Hermelin High School in Mikage-cho (Lunarvale in Revelations: Persona). Hidehiko Uesugi talks all of his friends into playing a game called &quot;Persona&quot;, which is played much like the ritual game &quot;Bloody Mary&quot;. While playing, the students lose consciousness and meet Philemon, who gives them the ability to summon reflections of their personalities, which are known as Personas.</p>\n<p>A short time later, the protagonist and several of his friends go to visit Maki Sonomura, who is ill and bed-ridden. During their visit, they discover that the town is changing and demons are roaming the streets. The party is told by Maki&#39;s mother, an engineer working for SEBEC, that the culprit behind the incident is Takahisa Kandori, president of the company.</p>\n<p>After taking Maki&#39;s mother to the school (the only place in town safe from demons), the protagonist&#39;s actions decide the course of the story. If the protagonist opts for going after Kandori, it&#39;ll start the SEBEC Chapter which is the main storyline of the game. Alternatively, the protagonist may opt for investigating a series of incidents that occurred in the school eight years ago and start the Snow Queen Quest, an alternate storyline unrelated to the SEBEC incident.</p>", "metacritic": 78, "released": "1996-09-20", "tba": false, "updated": "2024-01-23T12:14:29", "background_image": "https://media.rawg.io/media/games/c0b/c0b90804a936a729636ec8f09ddf8ff7.jpg", "website": "", "rating": 3.53, "rating_top": 4, "added_by_status": {"yet": 34, "owned": 26, "beaten": 63, "toplay": 31, "dropped": 25, "playing": 14}, "playtime": 9, "achievements_count": 0, "ratings_count": 52, "suggestions_count": 379, "game_series_count": 37, "reviews_count": 53, "platforms": ["PSP", "PlayStation"], "developers": ["Atlus Persona Team"], "genres": ["Action", "RPG"], "publishers": ["Atlus", "Ghostlight"], "esrb_rating": "Teen"}