{"id": 52799, "slug": "chrono-cross-2011", "name": "Chrono Cross", "name_original": "Chrono Cross", "description": "<p>Chrono Cross (クロノ・クロス, Kurono Kurosu) is a 1999 role-playing video game developed and published by Square for the PlayStation video game console. It is the successor to Chrono Trigger, which was released in 1995 for the Super Nintendo Entertainment System. Chrono Cross was designed primarily by scenarist and director Masato Kato, who had help from other designers who also worked on Chrono Trigger, including art director Yasuyuki Honne and composer Yasunori Mitsuda. Nobuteru Yūki designed the characters of the game.<br />\nThe story of Chrono Cross focuses on a teenage boy named Serge and a theme of parallel worlds. Faced with an alternate reality in which he died as a child, Serge endeavors to discover the truth of the two worlds&#39; divergence. The flashy thief Kid and many other characters assist him in his travels around the tropical archipelago El Nido. Struggling to uncover his past and find the mysterious Frozen Flame, Serge is chiefly challenged by Lynx, a shadowy antagonist working to apprehend him.<br />\nUpon its release in Japan in 1999 and North America in 2000, Chrono Cross received critical acclaim, earning a perfect 10.0 score from GameSpot. The game shipped over 1.5 million copies worldwide, leading to a Greatest Hits re-release and continued life in Japan as part of the Ultimate Hits series. Chrono Cross was later re-released for the PlayStation Network in Japan in July 2011, and in North America four months later.</p>", "metacritic": 94, "released": "1999-11-18", "tba": false, "updated": "2024-04-11T23:15:31", "background_image": "https://media.rawg.io/media/games/2ad/2ad33347237cdc941ba5312787dbe3f8.jpg", "website": "", "rating": 4.38, "rating_top": 5, "added_by_status": {"yet": 48, "owned": 75, "beaten": 98, "toplay": 66, "dropped": 40, "playing": 11}, "playtime": 42, "achievements_count": 0, "ratings_count": 142, "suggestions_count": 530, "game_series_count": 1, "reviews_count": 144, "platforms": ["PlayStation"], "developers": ["Sony Interactive Entertainment", "Square", "Square Product Development Division 3"], "genres": ["RPG"], "publishers": ["Electronic Arts", "Square"], "esrb_rating": "Teen"}