{"id": 528053, "slug": "mazinger-versus-gran-mazinger-con-dlc", "name": "Mazinger versus Gran Mazinger con DLC", "name_original": "Mazinger versus Gran Mazinger con DLC", "description": "<p><strong>Factsheet:</strong></p>\n<p><strong>Developer/Desarrollador:</strong> Mediatech Game Studio</p>\n<p><strong>Release Date/Fecha de lanzamiento:</strong>  1999 Motor inicial/2001 lanzamiento</p>\n<p><strong>Platforms/Plataformas: </strong>PC</p>\r\nDescription:\r\n<p>This game is a tribute to all the fans of the great Japanese heroes of the 70´s, <strong>Mazinger Z</strong> and his big brother <strong>Great Mazinger</strong>. It is a game that combines Arcade-style, also some shooter and of course challenges by waves of enemies that are increasingly powerful.</p>\r\nDescripción:\r\n<p>El juego es un tributo a todos los fans de los grandes héroes mecánicos de los 70´s como Mazinger Z y su hermano mayor Gran Mazinger. Este juego combina un estilo Arcade y también estilo shooter donde debes acabar con oleadas de enemigos que van incrementado su poder en cada nivel.\r\n</p>\r\nHistory:\r\n<p>Since 1985 creating Mazinger Z games was the engine that drove our founder José Rafael Marcano (Kabuto) to develop video games on different computers, starting with 8 bits with a first unpublished game on Commodore 64, then 16 bits on Atari ST and in 1999 already with the conformed study comes the first game published and authorized by Nagai on PC called Game Maker, which brought the Mazinger Zeta game developed in Multimedia Fusion with its source code and a manual on how to make games and documentation. Of code. It was a sales success, selling thousands of units.</p>\n<p>Due to the success of Game Maker, the game Mazinger vs. Great Mazinger which was the definitive Mazinger game, following the anime's story until Mazinger's death and appearance in the last level of Great Mazinger. This game was well known and sold not only in Venezuela but in many Spanish-speaking countries, having tremendous success, even reviewed in different books and robot encyclopedias in Spain and in many press articles in many parts of the world.<br/>This game covers the entire history of the anime with their respective videos from when the dying grandfather Juzo Kabuto gives his grandson Koji Kabuto the Mazinger Z to fight the evil Dr. Hell and his army of mechanical beasts, until the defeat of this and the appearance of the Black General and his 7 armies that end Mazinger's adventures and give way to his older brother Great Mazinger built by his father Kenzo Kabuto in secret after being resurrected as a Cyborg by his father.</p>\r\nHistoria:\r\n<p>Desde 1985 crear juegos de <strong>Mazinger Z</strong> fue el motor que impulso a nuestro fundador <strong>José Rafael Marcano (Kabuto)</strong> a desarrollar videojuegos en diferentes ordenadores, comenzando en los 8 bits con un primer juego no publicado en Commodore 64, luego por los 16 bits en Atari ST y en 1999 ya con el estudio conformado llega el primer  juego publicado y autorizado por Nagai en PC llamado Game Maker, el cual traía el juego de <strong>Mazinger Zeta</strong> desarrollado en Multimedia Fusion con su código fuente y un manual de como hacer juegos y la documentación del código. Fue un éxito de ventas llegando a vender miles de unidades.</p>\n<p>Por el éxito de <strong>Game Maker</strong> se desarrollo y lanzó en 2001 el juego <strong>Mazinger vs. Gran Mazinger</strong> el cual fue el juego definitivo de Mazinger, siguiendo la historia del anime hasta la muerte de Mazinger  y aparición en el último nivel del <strong>Gran Mazinger</strong>. Este juego fue muy  conocido y vendido no solo en Venezuela sino en muchos países de habla hispana teniendo un éxito tremendo, reseñado hasta en diferentes libros y enciclopedias del robot en España y en muchos artículos de prensa en muchas partes del mundo.</p>\n<p>Este juego cubre toda la historía del anime con sus videos respectivos desde que el abuelo Juzo Kabuto moribundo le entrega a su nieto Koji Kabuto el Mazinger Z para que combata al maléfico Dr. Hell y su ejercito de bestias mecánicas, hasta la derrota de este y la aparición del General Negro y sus 7 ejercitos que dan fin a las aventuras de Mazinger y dan paso a su hermano mayor Gran Mazinger contruido por su padre Kenzo Kabuto en secreto después de ser resucitado como Cyborg por su padre.</p>\n\r\nInstallation:\r\n\n<p>Because it is such an old game, it is best to install and play it in a virtual machine with Windows XP with the INDEO 5 drivers that you can download here as well. In my case, I did it with the Oracle VirtualBox with 1GB of RAM and 10GB of disk, more than enough to fully run the game.</p>\r\nInstalación:\r\n<p>Por ser un juego tan antiguo, lo mejor es instalarlo y jugarlo en una máquina virtual con Windows XP con los drivers de INDEO 5 que pueden descargar acá también. En mi caso lo hice con el Oracle VirtualBox con 1GB de RAM y 10 GB de disco, más que suficiente para correr a plenitud el juego.</p>", "metacritic": null, "released": "2020-12-05", "tba": false, "updated": "2020-12-07T05:18:33", "background_image": "https://media.rawg.io/media/screenshots/6c0/6c041e4b432aff7f49433e61a2d7b71c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 229, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mediatech Game Studio"], "genres": ["Action", "Shooter", "Adventure"], "publishers": [], "esrb_rating": null}