{"id": 528030, "slug": "projectsprint3", "name": "ProjectSprint3", "name_original": "ProjectSprint3", "description": "<p>Description: Create a painting tool by creating 3D primitives where the user clicks on the screen. It reads user input on the mouse and mouse location. It spawns 3D primitives and prefabs from user input and destroys 3D primitives after a set time.</p>\n<p>A color cube tracks the current colors being painted in real time, (Feature 1) rotates 360 degrees using animations, and a color button identifies what color is active when clicked on. A button tracks the mouse position as you move around the screen. My game creates shapes like Spheres, Cylinders, Cubes and prefabs such as a Snowman with randomized sizes, colors, rotation enabled by various toggle switches when you click on them. Each shape and prefab have their own animations too. For example, the Cube (Feature 2)  grows on the X, Y and Z axis, the Sphere (Feature 3) grows, shrinks and bursts into a bunch of them using root motion, the Cylinder (Feature 4) rotates and changes size, the Snowman (Feature 5) rotates on the X axis. Additionally, one toggle changes the how opaque the paint objects are. There, are sliders to change the colors of the shapes and a drop menu to change the colors and the shape. The shapes auto delete after a short duration and have a button that clears the screen by deleting all painted objects. A toggle is also there to disable auto the auto delete feature. Lastly, a clock has been added to show real time as it moves you can click on the screen to have the actual time displayed for you. The clock also grows and shrinks every 10 seconds and does a full flip afterwards like a coin. \r\n</p>", "metacritic": null, "released": "2020-12-06", "tba": false, "updated": "2020-12-07T05:12:44", "background_image": "https://media.rawg.io/media/screenshots/724/724089a5f938a6613da1c40324630455.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 20, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["antonkonrad"], "genres": [], "publishers": [], "esrb_rating": null}