{"id": 528172, "slug": "junk-tower", "name": "Junk Tower", "name_original": "Junk Tower", "description": "<em>Now, it is a matter of notoriety: competition has started.</em>\n<p>Play with an opponent and assume the roles of the managers of the two biggest and most polluted junkyards of the planet. Before the time runs out, you and your opponent will have to manage and build the highest tower, made with different kind of <strong>junks</strong>, using your <strong>crane</strong>.</p>\n<p>Exploit a common deck of <strong>cards</strong> to rack up junk pieces and create the highest (and possibly stronger) junk tower.</p>\n<p>Before the time runs out, you and your opponent will have to build the tallest tower simultaneously, playing carefully your cards and positioning precisely your junk pieces. </p>\n<p>Each card costs a certain amount of <strong>pollution</strong> and your junkyard will produce it for you. But beware! The common deck also contains <strong>powerups</strong> and <strong>debuffs</strong>, perfect to make your opponent weaker.</p>\r\nPC Controls\r\n<ul><li><strong>A</strong> - Move crane to left</li>\n<li><strong>D</strong> - Move crane to right</li>\n<li><strong>Space </strong>- Release a junk from the crane</li>\n<li><strong>Mouse left click</strong> - Use card</li>\n</ul>\r\nPrototype disclaimers\r\n<ul><li><em>Some issues could arise during the multiplayer experience:</em><ul><li>When you want to host a match, it could be slow the lobby creation or, in the worst case, you will be redirected to server list if a timeout expires.</li></ul><ul><li>When a match ends and players quit, it could be possibile to see the just used lobby still in server list; server takes a few seconds to clear data and reset its state.</li></ul></li><li><em>Take off your headphones, audio is a \"work in progress\":</em><br/><ul><li>We are aware that, in game like this, audio is one of the key part of the gameplay experience; the aim of prototyping for now is the user perception of the gameplay. Thus, audio will be available in next release.</li></ul></li></ul>", "metacritic": null, "released": "2020-12-05", "tba": false, "updated": "2020-12-07T05:47:59", "background_image": "https://media.rawg.io/media/screenshots/6f4/6f41ceb28ca7d4f5d9a6f317f8e23c5d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 94, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["POLIMI Game Collective"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}