{"id": 528275, "slug": "love-goes-toward-love", "name": "Love Goes Toward Love", "name_original": "Love Goes Toward Love", "description": "<p>\n</p>\n<p><em>\"A thousand times the worse to want thy light.<br/>Love goes toward love as schoolboys from their books,<br/>But love from love, toward school with heavy looks\"</em></p>\n<p><em><strong>When a new cafe opens right in front of the one Chiyoda Juri works at, tensions begin to rise between the two competing owners. After a fateful encounter, Juri falls in love at first sight with the beautiful and charismatic stranger that saved her life—who just so happens to be the new worker at the rivalling cafe. To make matters worse, her savior already has eyes on someone else! How will Juri deal with these overflowing feelings for someone she shouldn’t have feelings for? </strong></em></p>\n<p><em><strong>Find out by taking a sip out of  \"Love Goes Toward Love\"!</strong></em></p>\n<p>_______________________________</p>\n<p>Hello once again!! This is Team ANPIM here with an entry for the Yuri Game Jam 2020. Thanks to the extended deadline, we made it on time (Also thanks to CEO for putting this game before her school assignments)!!!  This year's game is more on the simpler side, but we hope you still love it nonetheless! It's <em>very lightly</em> based off of a certain classic tale, so kudos to you if you spot the little references here and there! Even though this year's game isn't on par with the wildness of last year's game, we hope that you still enjoyed it! And if it wasn't your cup of tea (or rather, coffee), we hope that we still have your faith in us as we strive for something better next year!</p>\n<p>Once again, we thank you so much for all the support we receive for our kinetic novels! Have fun reading Love Goes Toward Love, and as always, make sure to play our previous games if you haven't, share the game, and spread the word! &lt;3</p>\n<p>** The game's default volume and sfx is set to max, so please be aware the music might be really loud upon opening the game! You can lower it in \"Preferences\".</p>\n<p>Edit 1.1: Fixed something in the writing after doing some more research on coffee making :')</p>", "metacritic": null, "released": "2020-12-05", "tba": false, "updated": "2020-12-07T06:14:42", "background_image": "https://media.rawg.io/media/screenshots/8c2/8c2f12a032783f4e4e720ac2fc795196.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 149, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["TeamANPIM"], "genres": [], "publishers": [], "esrb_rating": null}