{"id": 528454, "slug": "the-parting-of-sarah", "name": "The Parting of Sarah", "name_original": "The Parting of Sarah", "description": "<p>Repository<br/></p>\n<p>Assingment for the Videogames and Entertainment Software 20/21 subject of the University of Oviedo.</p>\n<p>This little project intends to be a very light version of The Binding of Isaac with the player control of Enter the Gungeon. That's it.</p>\n<p>The game will feature unlimited floors made with interconnected rooms filled with enemies. Killing those enemies and entering treasure rooms will gain upgrades to the player. The game will be a complete rogue-like, dying in the game means the lost of all the progress made. Each run is a completely new run. The goal is to reach the deepest floor you can killing the bosses of each one and getting access to the next one.</p>\n<p>The game is developed in C++ only using the SDL2 library for handling audio and grahpics, that's all. Everything else will be pure manfactured C++.</p>\n<p>Controls</p>\n<p>The game is controlled with mouse and keyboard. The mouse is used to aim and shoot and the keyboard to move the character.</p>\n<ul><li>WASD for axis movement</li><li>Mouse Left Click to shoot</li><li>Return to pause the game</li><li>Escape to exit the game</li><li>Key 1 to make the game fullscreen</li><li>Key 2 to replace the character in the room (bug safety measure)</li><li>Key 3 to reset the game</li></ul>\n<p>Mechanics</p>\n<p>The objective of the game is reaching the highest possible floor and score before dying. To complete a floor you need to defeat its boss. Each floor has a peaceful starting room, a peaceful treasure room with an item, a boss room and from three to twenty-one commons rooms filled with basic enemies.</p>\n<p>Each time a player enters a non-peaceful room it will need to clear it before beign able to leave it. Defeated enemies will drop coins, collecting five of them will heal the player one heart if they're damaged. Collecting them will power-up the player, giving them a random upgrade to one of the five stats (hp, attack damage, speed, shot cooldown and shot size).</p>\n<p>Enemies</p>\n<p>Currently the game features a total of seven enemies:</p>\n<ul><li><strong>Bee</strong>, it's a flying ranged enemy who follows and shoots the player within a certain range.</li><li><strong>Bird</strong>, it's a melee flying enemy that can approach the player very fast.</li><li><strong>Ghost</strong>, it's a melee flying enemy that goes invisible from time to time.</li><li><strong>Pig</strong>, it's a melee enemy which goes berserk when hit, gaining speed.</li><li><strong>Plant</strong>, it's a ranged static enemy who shoots three beans.</li><li><strong>Raddish</strong>, it's a melee enemy with a lot of health that needs to stop to rest.</li><li><strong>Stone</strong>, it's a melee enemy that leaves two smaller stones when it diest. Those stones also leave another two smaller ones. Smaller the stone, faster.</li></ul>Bosses\r\n<p>Currently the game features a total of four bosses:</p>\n<ul><li><strong>Barrelwood</strong>, it's a barrelwood. It rolls, smokes and spreads acid, everything barrelwood-like.</li><li><strong>Bore</strong>, it's an angry pillow. Shots a chasing projectile so he doesn't have to do the job, sleeps to recover health because he is tired and summons its cat, Franky, to fight for him. Lazy motherfucker.</li><li><strong>Litost</strong>, it's static walrus with a pan that protects him. He can shoot fishes and its fangs, because why not.</li><li><strong>Pera</strong>, a flying pear, who poops, shoot itself like a dart and has a fucking magic shield, because WHY NOT.</li></ul>\n<p>Items</p>\n<p>Currently the game features a total of seven items:</p>\n<ul><li>Banner of Rox Q., power-ups the player three times.</li><li>Gift of An, gives three extra health and fully heals the player.</li><li>Green Arrow GRP, increase the number of projectiles shot by the player (max. 5).</li><li>Iyanel, at the cost of one maximum health upgrades all the other stats.</li><li>Kamespren, makes the projectiles little and blue, it also increases a lot the shot cadence.</li><li>Meru's Razor, multiplies the attack damage, it's not affected by the cap.</li><li>Shield of Xur, will block a hit each 16s. Picking it up again will reduce the cooldown 1s.</li></ul>\n<p>Resources</p>\n<p>Almost all the graphic and sound assets of the game are from third-party creative common sources. I modified some of it but the big work is not mine.</p>\n<ul><li>Basic enemies: https://pixelfrog-store.itch.io/pixel-adventure-2</li><li>Boss theme: https://freesound.org/people/Sirkoto51/sounds/352171/</li><li>Crosshair: https://opengameart.org/content/crosshair-pack-200%C3%97</li><li>Main character: https://gamekrazzy.itch.io/8-direction-top-down-character</li><li>Main theme: https://freesound.org/people/FoolBoyMedia/sounds/264295/</li><li>Tileset: https://scut.itch.io/7drl-tileset-2018</li><li>Wall: https://o-lobster.itch.io/simple-dungeon-crawler-16x16-pixel-pack</li><li>Sources of some sprites:<ul><li>https://ansimuz.itch.io/patreons-top-down-collection</li><li>https://pixel-poem.itch.io/dungeon-assetpuck</li><li>https://uilleaggodwin.itch.io/roguelike-dungeon-asset-bundle</li></ul></li></ul>", "metacritic": null, "released": "2020-12-04", "tba": false, "updated": "2020-12-07T07:00:14", "background_image": "https://media.rawg.io/media/screenshots/ba2/ba2d2a7fe30dbe18d5e49e60321459ee.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 122, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["kriogenia"], "genres": ["Action", "Adventure"], "publishers": [], "esrb_rating": null}