{"id": 528683, "slug": "hijacker-jack", "name": "Hijacker Jack", "name_original": "Hijacker Jack", "description": "Hijacker Jack is the first ever FMV live-action game with real-time interaction. Our hero is controlled in first-person point of view through the story, while he has to survive thrilling action scenes by making decisions in every 2-3 seconds, delivering punch/kick combinations in fist fights, jumping between rooftops or even just like in any FPS game, grab a shotgun and maintain public order.<br/><br/><br/><br/>THE STORY<br/><br/>Our hero lives peacefully off-the-grid when one day he is kidnapped, re-shaped and thrown into a fancy luxurious world as a celebrity impostor. All seems fine while living the #highlife until he suddenly experiences the dark side of his fame…<br/>During his transformation he has to survive some romance and thrilling adventures, including fist fights, gun fights, car chasing, parkour and much more. While he can’t trust anyone around him, he slowly starts figuring out the reason behind his kidnapping. Our decisions during the game will affect his karma as we choose between material values or turning back to his old life, which finally leads the story to one of the four different alternate endings.<br/><br/>Do you want to live the life of rich and famous? Live like Jack!<br/>MORE THAN 2 MILLION PLAYERS WORLDWIDE<br/><br/>THE FEATURES<br/><br/>After our two successful games, SOV1 and SOV2, here comes the greatest: Hijacker Jack! An innovative action game which you have never seen before...<br/><br/>You can:<br/><ul><li>Interact with several characters<br/></li><li>Explore amazing locations<br/></li><li>Play car chasing, skydiving, FPS action scenes and more<br/></li><li>Use the new Combo system in fight missions and a parkour-freerunner chasing!</li></ul><br/>Make story decisions to reach any of the 4 different endings!<br/>...and be ready for your karma...", "metacritic": null, "released": "2020-12-07", "tba": false, "updated": "2020-12-11T02:30:23", "background_image": "https://media.rawg.io/media/screenshots/804/804c69a231c711e7b1e66b95a271b978.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 369, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["New IDEA Games"], "genres": ["Action", "Adventure", "RPG", "Simulation", "Indie"], "publishers": ["New IDEA Games"], "esrb_rating": null}