{"id": 528659, "slug": "the-game-of-life-2", "name": "THE GAME OF LIFE 2", "name_original": "THE GAME OF LIFE 2", "description": "<p>This digital board game is an official, contemporary sequel to the classic THE GAME OF LIFE game. It offers more choices and more freedom at every stage of the game on a fully animated and immersive 3D board. You’ve got thousands of new, meaningful ways to live your life before reaching the finish line.</p>\n<p>THE GAME OF LIFE 2 is another one of Marmalade Game Studio’s classic board games for kids and adults alike.<br />\nFeatures<br />\nA CONTEMPORARY SEQUEL TO HASBRO’S CLASSIC BOARD GAME - THE GAME OF LIFE 2 drives the original from yesterday to today, with:</p>\n<p>Customisable pegs<br />\nA selection of vehicles<br />\nAn eco-city board<br />\nSecond chances, including the option to change job, go back to school and get married later<br />\nNew careers, including Video Blogger, Game Designer, Athlete and Dog Groomer<br />\nPet adoption<br />\nNew ways to win, including points for knowledge and happiness, as well as wealth<br />\nThe chance to continue playing past retirement<br />\nOPEN ONLINE MULTIPLAYER - Distance doesn’t interrupt play when you connect with up to 4 players around the world<br />\nPRIVATE ONLINE MULTIPLAYER - Invite up to 4 friends and/or family members to a private multiplayer game<br />\nCROSS-PLATFORM MULTIPLAYER - Play on Steam, against friends on their phones!<br />\nSINGLE PLAYER -  There’s no such thing as playing alone when you take on our challenging AI<br />\nPASS &amp; PLAY - Simply pass the keyboard and/or mouse between players for an easy offline experience<br />\nSEASON PASS - Seek out additional boards, including ‘Fairytale Kingdom’, ‘Haunted Hills’ and Frozen Lands with THE GAME OF LIFE 2 Season Pass to unlock themes, with 7 more on the way!How to play<br />\nCHOOSE and CUSTOMISE your character!<br />\nA life journey calls for one jaw-dropping outfit! Customise your pink, blue or purple peg with a style all of their own.<br />\nSTART at the beginning!<br />\nTeen life on the board might seem daunting, but there’s no pressure! THE GAME OF LIFE 2 game starts when big decisions really begin, and the choices just keep coming!<br />\nChoose your LIFE PATH!<br />\nYour life is in your hands! Get married, earn qualifications, become a star and adopt pets. In THE GAME OF LIFE 2 game the road has many twists and turns, and crossroads can now grant second chances - so it’s never too late to get married or earn that degree!<br />\nMoney vs Happiness, RETIRE your way!<br />\nAre you in it for the millions or the good times? THE GAME OF LIFE 2 game is about so much more than money. Gain attributes for happiness, wealth and knowledge, and the final score will sum up your achievements!<br />\nEarn REWARDS to UNLOCK new items!<br />\nUnlock new characters, outfits and vehicles by playing the game and earning rewards! Collect 60 happiness points, travel 100 spaces, collect 5000k; each accomplishment unlocks a puzzle piece. When you collect 6 puzzle pieces you can unlock a bonus item, and there are eight to unlock in each world!<br />\nEXPLORE marvellous worlds with THE GAME OF LIFE 2 Season Pass!<br />\nWhen you’re done finding success in the eco green cityscapes, there are more worlds to explore as part of the Season Pass. Take an enchanted quest through the ‘Fairytale Kingdom’, or explore the ‘Haunted Hills’!  THE GAME OF LIFE 2 Season Pass includes 2 marvellous worlds…<br />\n...with additional worlds coming soon!</p>", "metacritic": 53, "released": "2021-03-29", "tba": false, "updated": "2023-12-26T11:32:47", "background_image": "https://media.rawg.io/media/screenshots/b9b/b9beac5046ce491836e6cfb1e2ded623.jpg", "website": "https://www.marmaladegamestudio.com", "rating": 3.11, "rating_top": 4, "added_by_status": {"yet": 7, "owned": 95, "beaten": 1, "toplay": 2, "dropped": 5, "playing": 1}, "playtime": 2, "achievements_count": 30, "ratings_count": 8, "suggestions_count": 245, "game_series_count": 0, "reviews_count": 9, "platforms": ["Nintendo Switch", "PC", "Android", "iOS"], "developers": ["Marmalade Game Studio"], "genres": ["Strategy", "Simulation", "Casual"], "publishers": ["Marmalade Game Studio"], "esrb_rating": null}