{"id": 528667, "slug": "the-message-2", "name": "The Message", "name_original": "The Message", "description": "I answered the call, got into the car, arrived at the place ... Fun waiting me. Each level is an arena. Find a weapon and kill everyone.<br/>\n<br/>\r\nRandom:<br/>\r\nThere are elements of randomness in the game: weapons have random components, enemies get random weapons and do not repeat the route.<br/>\n<br/>\r\nDifferent ways to complete level<br/>\r\nIn most levels you can choose different ways for completing. Rooms got more than 1 enters, more than 1 stair lead to 2 floor etc.<br/>\n<br/>\r\nCruelty<br/>\r\nEnemies can be dismembered. Blood reacts on surfaces. If it is a ceiling, it will drip; if it is on the wall, it will flow.<br/>\n<br/>\r\n80th<br/>\r\nThe game takes place in the 80s. Russia won the Cold War and a mass settlement of Russians, including criminals, began in the United States. The latter you have to kill.<br/>\n<br/>\r\nWeapon<br/>\r\nThe game has a wide variety of firearms (machine guns, shotguns, pistols, etc.), as well as edged weapons.  The weapon has modifications (muzzle attachments, stocks, handles, etc.)<br/>\n<br/>\r\nMasks<br/>\r\nBefore starting the level, you can choose a mask that will give you the ability.  For example: getting brass knuckles at the beginning of the level, the ability to shoot from 2 hands, more blood, etc.<br/>\n<br/>\r\n Based on Hotline Miami.", "metacritic": null, "released": "2020-12-06", "tba": false, "updated": "2020-12-11T02:20:52", "background_image": "https://media.rawg.io/media/screenshots/da9/da95ce7ad9b3464b4acacab774d66f76.jpg", "website": "https://vk.com/otbitie_nahui_psihi", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 85, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dream Games"], "genres": ["Action", "Indie"], "publishers": ["Dream Games"], "esrb_rating": null}