{"id": 528684, "slug": "summoner-apprentice", "name": "Summoner Apprentice", "name_original": "Summoner Apprentice", "description": "Can you see yourself summoning an army of minions and destroying your enemies’ crystals day in and day out? Do you have what it takes to develop and improve a deck and come up with different strategies to further your game? In the newly established position as Summoner Apprentice you get to learn all there is to know about summoning first hand from Feylin, our star summoner and the best in the business. Are you ready to show us your drive and talent?<h3>Your responsibilities will cover:</h3><ul><li>Summoning hordes of  minions to overcome the enemy force<br/></li><li>Protecting your crystal at all costs<br/></li><li>Building your own deck and managing the card draft and reserve pools<br/></li><li>Improving your deck on a continuous basis in order to deal most efficiently with the different types of enemies<br/></li><li>Collecting enhancement relics and work well under the effect of curses</li></ul><h3>We offer:</h3><ul><li>A great opportunity to develop your skills as a summoner under the guidance of Feylin<br/></li><li>Relics, upgrades and powerful new cards as you progress to mark your achievements<br/></li><li>A system of challenges to push your drive and abilities<br/></li><li>Tons of fun and the full deck building rouge-lite experience</li></ul><h3>Requirements?</h3> Just download the game now and start your training right away.<br/><br/><br/>Applications are reviewed on a rolling basis.", "metacritic": null, "released": "2020-12-07", "tba": false, "updated": "2020-12-11T02:30:55", "background_image": "https://media.rawg.io/media/screenshots/ee5/ee540fab6909f94944a61b7aed3bccd6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 125, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Unknown Magic"], "genres": ["Adventure", "Strategy", "Indie"], "publishers": ["Wa Tran"], "esrb_rating": null}