{"id": 528776, "slug": "awakening-of-cthulhu", "name": "Awakening of Cthulhu", "name_original": "Awakening of Cthulhu", "description": "To play this game on PS5, your system may need to be updated to the latest system software. Although this game is playable on PS5, some features available on PS4 may be absent. See PlayStation.com/bc for more details.<br/>How can a day go so mad? This is the question that runs on our hero Walter’s mind who is a jobless ex-veteran and suffers from PTSD. On the top all, Cthulhu is rising again from his eternal sleep from the deepest shadows of Earth to bring the apocalypse.<br/>With Cthulu’s effect, his unstable conditions created a delusional world. Nothing will be the same anymore, especially from Walter’s eyes. Everyone became monsters born from a mind inspired from HP Lovecraft’s books. And Cthulhu calls you!  Cthulhu wants you! Go through him! To answer the call of Cthulhu, walk on streets of the city and defend yourself against monsters which await hunting you down. How can a man keep his sanity straight in this delusional world? Let’s take the ticket of an adventure full of madness and discover the delusional world of Walter born from Cthulhu’s awakening. And think that those monsters are real or a mad man attacking people on the streets while living in his delusional hollow.<br/><br/>-Different dark style levels<br/>-Monsters born from HP Lovecraft’s book<br/>-Lovecraft inspired a horror adventure platformer game<br/>-Captivated music and sounds<br/><br/><br/>Offline single player<br/><br/><br/>Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy). <br/><br/>Software subject to license (us.playstation.com/softwarelicense). <br/><br/>One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.<br/>", "metacritic": null, "released": "2020-12-04", "tba": false, "updated": "2023-03-23T22:37:58", "background_image": "https://media.rawg.io/media/screenshots/d71/d71a0345bfff4b040952f22c86d3cc98.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 393, "game_series_count": 0, "reviews_count": 1, "platforms": ["PlayStation 4"], "developers": [], "genres": ["Action"], "publishers": [], "esrb_rating": null}