{"id": 528783, "slug": "lucky-tile-match-3-game", "name": "Lucky Tile - Match 3 Game", "name_original": "Lucky Tile - Match 3 Game", "description": "Lucky Tile - Match 3 Game is an addictive triple match game. You can challenge your brain and have fun by matching 3 tiles of the same icon to eliminate them. More matching tiles, more scores, more random rewards for you!!<br/><br/>This Lucky Tile - Match 3 Game has you match 3 same tiles together to clear them and aim for the highest score as much as possible, like classic mahjong puzzle games! <br/><br/>Challenge yourself and train your brain to beat the higher score, to earn more prop rewards, to get higher scores! Join the millions of people playing Lucky Tile - Match 3 Game! Relax and collect big prizes! <br/><br/><br/>*** How to Play Lucky Tile - Match 3 Game ***<br/>- Choose tiles on the board<br/>- Match 3 same tiles to clear them<br/>- Match as much as possible to get high scores <br/>- Tile puzzle game finished when all tiles are cleared <br/>- No time limit<br/><br/>*** Features of Lucky Tile - Match 3 Game ***<br/>- Various tile icons: organic elements like fruits, flowers, animals, crops, etc. nature elements like wind, water, fire, snow, thunder, etc.<br/>- Unlimited levels, 3000+ challenges waiting for you!<br/>- No time limit. Have fun and challenge your brain with tile matching game.<br/>- Addictive gameplay<br/><br/>STOP hesitating and join us! the more you play, the more you win!", "metacritic": null, "released": "2020-10-27", "tba": false, "updated": "2020-12-11T03:41:58", "background_image": "https://media.rawg.io/media/screenshots/525/5256f7d0cded295e4d5eb6a1aad2d853.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 57, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tuyoo Online HK"], "genres": ["Casual", "Puzzle"], "publishers": ["Tuyoo Online HK"], "esrb_rating": "Mature"}