{"id": 528794, "slug": "petrolhead-epic-joyride", "name": "PetrolHead: Epic Joyride", "name_original": "PetrolHead: Epic Joyride", "description": "Petrolhead: Petrolhead will provide you the high quality graphics and the driving experience you are looking for. Test your overspeed skills and drift skills on asphalt. Push your limits and step forward to become a master driver! Complete the missions, own the best cars and challenge worldwide drivers!<br/><br/>SINGLE/MULTIPLAYER<br/>Improve your driving skills with Career Mode. Complete the quests and expand your garage day by day. Test yourself in miscellaneous modes with your skills! Push your limits in these tougher modes. Dominate the streets by different cars and exhibit your skills to the world! Be ready to compete with the worldwide master drivers in a huge multiplayer map!<br/><br/>CUSTOMIZE YOUR CARS<br/>Own more than 80 cars that you're fond of with the high quality graphics. Use the workshop to find the best fitting colors, decals and improvements. Show your dream car to everyone in this world and enjoy more! Make the best cars amongst all various combinations and rule the streets!<br/><br/>A CITY ALIVE<br/>Don't get bored! You can take side quests in this huge map and drive your car to the eternity! Find and complete all the missions in this map which is waiting for your exploration! Drive your car freely while you are waiting for your mode queue. You don't even have to stop having fun!<br/><br/>QUESTS AND BADGES<br/>Complete the quests, get achievements. Get rewarded by a badge according to the combinations of your achivements. Collect the badges of your masteries and exhibit in your profile! Let everyone see your masteries!<br/><br/>EXTRAORDINARY GRAPHICS<br/>With this realistic graphics, feel like you are in the streets for real. Enjoy the high quality graphics which is containing natural light. Let your self in to this reality!<br/><br/>LIMITLESS DRIVING EXPERIENCE<br/>You are free to drive your own car as you want by this realistic mechanics. You can join a drift race event or you can get in an engine power race! In this endless driving experience you can do anything you want that you want to do in real life!<br/><br/>REALISTIC MECHANICS<br/>Show your driving skills with this close-reality mechanic design and pyhsics. You are in control of your car as in real life.<br/><br/><br/>*********<br/>Website: http://lethestudios.net<br/>Instagram: lethe.studios<br/>Twitter: @LetheStd<br/>Reddit: r/LetheStudios<br/>Facebook: @lethestudios<br/>Discord: PetrolHead<br/><br/>*********<br/><br/>Privacy Policy:  https://lethestudios.net/privacy.html<br/>Terms Of Service: https://lethestudios.net/terms.html<br/><br/>", "metacritic": null, "released": "2020-07-25", "tba": false, "updated": "2020-12-11T03:47:14", "background_image": "https://media.rawg.io/media/screenshots/8a9/8a920635775972df5040fe020e6312bf_0MjS7GH.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 124, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Lethe Studios"], "genres": ["Simulation", "Racing"], "publishers": ["LETHE STUDIOS BILISIM MEDYA YAZILIM REKLAM OYUN PROGRAMCILIGI TICARET LIMITED SIRKETI"], "esrb_rating": "Everyone 10+"}