{"id": 528799, "slug": "reigns-rising-civilization", "name": "Reigns: Rising Civilization", "name_original": "Reigns: Rising Civilization", "description": "Greet legendary leaders such as King Arthur, Temujin, and Charlemagne to join your army for revolution! They will assist you to train elite troops, eliminate rebels and take back Camelot. Build the strongest empire with Lords from all over the world!<br/>In order to maintain competitive advantages on the battlefield, you are required to capture more military bases, expand your territories and build reciprocal relationship with your allies. Attack and defense are happening on this land of warfare every day. Please stay vigilant!Your enemies may launch sneak attacks when you are sleeping soundly!<br/><br/>※Game Features<br/><br/>◆Arrival of Legendary Heroes◆<br/>New era has come and you are the leader! Those legendary heroes will be your guards. Finally, they will come out from your historical books and fight fearlessly on the battlefield like they did years ago! The heroes will listen to you orders. Let’s attack and defend now!<br/><br/>◆Assembly of Elite Troops◆<br/>Lords from all over the world will assemble on this grand map. Each Lord will fight for his/her own Bloc. Find your allies, station together and get prepared for upcoming Bloc Wars!<br/><br/>◆Grand and Epic Battles◆<br/>Challenge classic campaigns! Impress those heroes with your talents and you can recruit them into your army. Various challenges with different degrees of difficulties are awaiting. Only the one with wisdom and strategies can overcome obstacles and win victories!<br/><br/>◆Combat for Treasures◆<br/>Resources are indispensable for revolt and revolution. People always cast greedy eyes to good resources. If it’s about these treasures, never hesitate to dispatch your troops and beat your rivals who are gathering resources ahead of you.<br/><br/>◆Activate Artifacts Power◆<br/>Unseal the temple and search for those Artifacts lost for thousand years. Use technologies to restore them and activate their power! Equipped with these Artifacts, your heroes will be much stronger!", "metacritic": null, "released": "2020-08-09", "tba": false, "updated": "2020-12-11T03:50:15", "background_image": "https://media.rawg.io/media/screenshots/071/0712ef8bdc44276e1d315af20fec3db3_zOywCyF.jpg", "website": "http://www.ehaia.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 259, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["OneGame"], "genres": ["Strategy", "Simulation"], "publishers": ["ONE GAME HOLDING"], "esrb_rating": "Everyone 10+"}