{"id": 528703, "slug": "bomber-games", "name": "Bomber Games", "name_original": "Bomber Games", "description": "Fight your friends in fast, fun and explosive battles. Bomber Games is a local multiplayer game with support for up to 8 players. Team up with your friends or play in free-for-all to explode your adversaries until the battle is over. <br/>Easy to learn but hard to master, you will be surprised by this new take at a well-known classic of the genre. Bomber Games pays tribute to Bomberman without forgetting its lot of new and original gameplay features! <br/><br/><br/><strong>MAIN FEATURES</strong><br/><br/>- Play with up to 8 local or AI players<br/>- 3 multiplayer game modes: DeathMatch, ChickenRun and Splat&amp;Splash<br/>- Play in Free-For-All or in teams for any game mode<br/>- Exclusive bomb types that really change the way you play<br/>- Original characters with their own special ability<br/>- Turn into a chicken!<br/>- Many included levels, and more from the community<br/>- Build your own levels using the level editor and share them with the Steam community<br/>- Fully compatible with Steam Remote Play Together to play online with your friends<br/>- Enjoy lively music composed by z.elv<br/><br/><br/><strong>PLAY WITH YOUR FRIENDS</strong><br/><br/>You can play with up to 8 local players on the same computer. Not enough gamepads? Share the same keyboard or gamepad across multiple players! You wish to play with more than your friends? Then try our Artificial Intelligence and see if you can beat it!<br/>Bomber Games is also fully compatible with Steam Remote Play Togetherif you wish to play online with your friends.<br/>Team-up or play in Free-For-All to explode your friends.<br/><br/><br/><strong>NEW GAME MECHANICS</strong><br/><br/><br/>A whole set of new bomb types bringing original gameplay mechanics!<br/>Trap your opponents with your mines. Kill them instantly using egg bombs. Wait patiently for them using remote controlled bombs. Surprise them with drilling explosions. Protect yourself with your tank bomb. Turn any bomb into a fragmentation bomb and bring chaos to the battle. And more.<br/><br/><br/>Each character comes with a unique ability that spices your games. Crystalize, dash, jump, stun, clone, hide... Who will be the best at using its ability?<br/><br/><br/>Discover multiple game modes:<br/>- Destroy all your enemies in DeathMatch<br/>- Grab the golden egg and be the last to turn into a chicken in ChickenRun<br/>- Paint as many tiles as possible in Splat&amp;Splash<br/><br/><br/>To be the best, you will need to adapt to your environment. Discover a whole set of special blocs making each level unique.<br/><br/><br/><strong>CUSTOMIZE YOUR EXPERIENCE</strong><br/><br/>We believe each player is different. Discover many options to really customize your gameplay experience: show/hide bomb indicators, enable:disable special abilities, change cooldown times, decide which power-ups players start with, create your own levels, customize your controls and more.", "metacritic": null, "released": "2020-12-08", "tba": false, "updated": "2020-12-11T02:43:37", "background_image": "https://media.rawg.io/media/screenshots/6f8/6f880421411de2720de022ddabe1de03.jpg", "website": "https://playerone-studio.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 400, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Florent BOCQUELET"], "genres": ["Casual", "Indie"], "publishers": ["Marlène LYOTARD"], "esrb_rating": null}