{"id": 528826, "slug": "the-rattening", "name": "The Rattening", "name_original": "The Rattening", "description": "The Rattening\r\n\n<p>Hello, <strong>Detective</strong> - I see you're new to our great colony. Well, listen up!</p>\n\n<p>Last night, two of the <em>Carrion</em> family’s children went missing. There is evidence of a kidnapping. This seems to have coincided with strange signals coming from <em>Mount Helozone</em> on the northern island...signals that have not been sensed since before the great <em>Goondives</em> were a colony. Are you thinking what we’re thinking?</p>\n\n<p>That’s right, you’re on the case. We need you to do everything you can to get close to the residents of our town, to find out who is responsible for this. There could be more kidnappings. There could be multiple conspirators. Who knows where the children have been taken to? Their lives could be at stake! Surely some nefarious purpose is being carried out, and you must stop it.</p>\n\n<p><strong>The Rattening</strong> is a game of dirty tactics and layered deception. Work with or against other players, either to ensure the ultimate culprit is convicted - or to kidnap the <strong>Rat Children</strong> you need to ascend. Use one of a variety of actions to blame, scavenge, haggle and search, and use the myriad of items you find to your advantage.</p>\n\n<p>Do not show cowardice, keep your enemies and friends close, and most importantly:</p>\n<p><em>Embrace the Rat way.</em></p>\n\n<p><strong>Tabletopia Play Zone:</strong><br/></p>\n<p>https://tabletopia.com/playground/the-rattening-ek9q64/play-now<br/></p>", "metacritic": null, "released": "2020-12-11", "tba": false, "updated": "2020-12-11T04:01:13", "background_image": "https://media.rawg.io/media/screenshots/e85/e85afdf3c7dc5900f98b228a1dc914ce.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 152, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["lifemince"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}