{"id": 529363, "slug": "flicker-itch-tumblin-down", "name": "Flicker (itch) (Tumblin-down)", "name_original": "Flicker (itch) (Tumblin-down)", "description": "Flicker\r\n<p><em>Flicker </em>is a puzzle platforming adventure game where a small white creature breaks free from captivity and sets out to travel across The Barrens in order to find its family, overcoming puzzles and platforming challenges along the way.</p>\n<p>\tThe game has a dark, desaturated color palette with select accent colors to make certain objects, such as the player, stand out in contrast. The art style is a simplified silhouetted style inspired by the indie game Limbo. Flicker takes place in a land called The Barrens, where the environment is bleak with dead trees and very little vegetation. This combined with the visual style creates a lonely atmosphere that causes the player to feel isolated while traveling through the seemingly empty world. However, the cute, innocent-looking player character gives off an underlying sense of hope to keep pressing forward in hopes of leaving their isolation behind.</p>\n<p>\tFlicker consists of five levels, each level containing various platforming puzzle challenges that the player must overcome in order to reach a portal located at the end of the level. To solve puzzles, the player can use dark blue block creatures to aid them. For example, the player can push a block creature into a position that allows the player to jump onto the creature to reach a higher place. In addition, glowflies allow the player and block creatures to float upwards while spikes kill the player when touched. The game ends with the player character reuniting with its family, no longer having to be alone within the dreary world. </p>\n\n<p>Credits:</p>\n<p>Game Design and Art Assets by Kasey Wu</p>\n<p>Base Code by Michael Baker</p>\n<p>Music: Haunted Resonance by maplesnow (c) copyright 2020 Licensed under a Creative Commons Attribution Noncommercial  (3.0) license. http://dig.ccmixter.org/files/maplesnow/62298</p>", "metacritic": null, "released": "2020-12-09", "tba": false, "updated": "2020-12-11T06:09:21", "background_image": "https://media.rawg.io/media/screenshots/23b/23b4944ec2a578e37f72b9ce47658ef8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 26, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Tumblin-down"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}