{"id": 52935, "slug": "final-fantasy-ii-1988", "name": "Final Fantasy II (1988)", "name_original": "Final Fantasy II (1988)", "description": "<p>Final Fantasy II is a fantasy role-playing video game developed and published by Square (now Square Enix) in 1988 for the Family Computer as the second installment of the Final Fantasy series. The game has received numerous enhanced remakes for the WonderSwan Color, the PlayStation, the Game Boy Advance, the PlayStation Portable, and multiple mobile and smartphone types. As neither this game nor Final Fantasy III were initially released outside Japan, Final Fantasy IV was originally released in North America as Final Fantasy II, so as not to confuse players. The most recent releases of the game are enhanced versions for the iOS and Android, which were released worldwide in 2010 and 2012, respectively.<br />\nThe game&#39;s story centers on four youths whose parents were killed during an army invasion by the empire of Palamecia, who are using hellspawn to conquer the world. Three of the four main characters join a rebellion against the empire, embarking on missions to gain new magic and weapons, destroy enemy superweapons, and rescue leading members of the resistance. The Game Boy Advance remake adds a bonus story after the game is completed.<br />\nFinal Fantasy II introduced many elements that would later become staples of the Final Fantasy franchise, including chocobos and the recurring character Cid. It also eliminated the traditional experience point leveling system of the previous and later games in the series, instead introducing an activity-based progression system where the characters&#39; statistics increase according to how they are used or acquired. Despite being a sequel to Final Fantasy, the game includes no characters or locations from the first game. Final Fantasy II received little attention at the time from non-Japanese reviewers, though its remakes have garnered favorable reviews.</p>", "metacritic": null, "released": "1988-12-17", "tba": false, "updated": "2024-01-30T01:06:53", "background_image": "https://media.rawg.io/media/games/f29/f29af1b9d00800b26af2a6fda55aa3b9.jpg", "website": "", "rating": 3.35, "rating_top": 4, "added_by_status": {"yet": 27, "owned": 46, "beaten": 80, "toplay": 38, "dropped": 33, "playing": 4}, "playtime": 0, "achievements_count": 0, "ratings_count": 77, "suggestions_count": 203, "game_series_count": 27, "reviews_count": 79, "platforms": ["Game Boy Advance", "iOS", "Nintendo 3DS", "Wii U", "Wii", "PSP", "PlayStation", "NES"], "developers": ["Square"], "genres": ["RPG"], "publishers": ["Square"], "esrb_rating": null}