{"id": 529311, "slug": "rock-paper-spells", "name": "Rock, Paper, Spells!", "name_original": "Rock, Paper, Spells!", "description": "<p>After playing, please let us know what you think!</p>\n<p>The world of Ludus had been created with only one infallible rule; games were the only way to decide anything and everything- Ludus was a world where once, anyone who was good at games could take anything they wanted. In its time, Ludus had been a place of near constant war that had been disguised as games. Thusly, a group of mysterious figures appeared, people who were above and beyond anyone who had played games before- they had been unstoppable, taking on all who dared challenge them, and challenging those who didn’t, and one by one removing those who had been in power from the world. These figures slowly dismantled the machinations of their world, molding it back as they took each step and applying new rules and laws that would form the basis of the rest of history; these rules would become known as “The Magister Ludi Percepta,” often referred to as the Ludi. They stated that those who would have power would first have to complete a series of tasks and games, one of which would take its place as the most commonly celebrated and regarded games; the Rock Paper Spells championship. Every 20 years this championship would be used to select a list of candidates that would be potential future leaders, rulers, and legends that would once again shape the world. But be warned those who wish to play- the list of candidates selected each 20 years is small, and there are those who wish to use the power they could gain from it to take apart the modern world and set it back to a time where only the strong ruled. It is because of this that many mercenaries are often spotted taking out potential targets on their way to the Championship. </p>", "metacritic": null, "released": "2020-12-09", "tba": false, "updated": "2020-12-11T05:56:58", "background_image": "https://media.rawg.io/media/screenshots/33b/33bedce6a15cc3c9d849d955d7131526.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Seth B.", "TeamRPS"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}