{"id": 529498, "slug": "mcsm-behind-the-scenes", "name": "MCSM: Behind the Scenes", "name_original": "MCSM: Behind the Scenes", "description": "<p><strong>DISCLAIMER: This is a fangame, made by a fan, for fans. <em>THERE IS NO PROFIT BEING EARNED FROM THIS GAME</em>. Astral Autumn Games has no affiliation to Telltale Games or Mojang, and nothing in the game is owned by Astral Autumn Games. All music belongs to Antimo &amp; Welles, and all voice files are taken from the game directly. </strong></p>\n<p>======</p>\n<p>Based on the <em>Craft Your Story</em> promotional shorts by Telltale Games, Jesse is an actor working for an unnamed company to produce a series of games known as <em>Minecraft: Story Mode</em>. Their fellow actors have stayed on and remained their coworkers-- but now they work behind the scenes, from coding to choreographing to beta-testing in an office the size of a closet.</p>\n<p>Jesse loves their job-- perhaps a little too much, since their roommate's had to now step in and tell them that <em>maybe</em> they should start hanging out and doing things that aren't related to work. </p>\n<p>Between hanging out with their coworkers in much more bonding situations, dealing with their manager, and juggling the fans, will Jesse find romance? Or will they just decide they want a close friend instead?</p>\n<p>Well, you're the player.</p>\n<p>You get to decide.</p>\n<p>======</p>\n<p><em>Minecraft: Story Mode: Behind the Scenes</em> is a fanmade visual novel dating sim that features slice-of-life, romance/close friendship (for those people who aren't interested in romance), and drama.<br/></p>\n<p>The demo features:</p>\n<ul><li>A choice of character avatar and pronoun customization</li><li>Some partial voice acting [not complete]</li><li>Absolutely wonderful writing 10/10 very hilarious</li><li>6k+ words</li><li>Sound captions</li><li>11 love interests [yes. you heard me right. <strong>Eleven.</strong>] and a roommate</li><li>A custom UI</li></ul>\n<p><strong>The full version is not yet complete, but will feature:</strong></p>\n<ul><li>11 Love Interests and 1 Planned Secret Route (may be more)</li><li>Pronoun and voice customization for the player character.</li><li>100k+ words</li><li>Image and sound captions for accessibility purposes</li><li>36+ endings!</li><li>Partial voice acting [more complete than in the demo]</li></ul>\n<p>The game is rated 13+ for:</p>\n<ul><li>Adult themes</li><li>Possible tragedy/character death</li></ul>\n<p>Please enjoy the game! </p><p>======</p><p><strong>Demo Errors:</strong><br/></p><ul><li>In one part, Jesse's sleeves may disappear depending on which avatar you chose. This is due to an error on the dev's part where the images weren't resized properly.</li><li>The gender textbutton is not clear that it's clickable. This was also an error on the dev's part where that transform was not defined correctly.</li></ul>", "metacritic": null, "released": "2020-12-09", "tba": false, "updated": "2020-12-11T06:41:05", "background_image": "https://media.rawg.io/media/screenshots/f77/f77bcffdcf1bc7d9c30742969ae2d58f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 103, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Astral Autumn Games"], "genres": [], "publishers": [], "esrb_rating": null}