{"id": 529512, "slug": "octarina", "name": "Octarina", "name_original": "Octarina", "description": "<strong>Octarina is a physics-based 3D puzzle platformer featuring a trapped little octopus who must find a way out and escape out of a sushi factory site.</strong><br/>You play as an adorable little octopus, which is trapped inside an aquarium for its whole life. Not as a pet, but rather as a sushi ingredient. Escape your captivity and find a way out before it's too late! Use the sticky abilities of Octarina to jump, climb and cause mayhem in the factory. Discover your way to regain freedom!<br/><br/>You'll have to find a way to escape your current situation. Octarina has the ability to stick to its environment and objects. You explore the factory and try to open up new ways. To do that you climb up walls, push buttons and throw around various things to work your way through the factory to escape. There are many dangers but also secrets in the level which will challenge your finesse.<br/><br/>Additionally to its main storyline, Octarina contains two other challenging gamemodes so far. Firstly, in the “Checkpoint Race” gamemode the octopus has to navigate through the factory and reach different checkpoints within a certain timeframe. <br/>The second gamemode is “The Floor is Lava”. Obviously you are not allowed to touch or fall into the hot lava. There is a specific way through the level. Try to be the fastest.", "metacritic": null, "released": "2020-12-09", "tba": false, "updated": "2021-06-25T03:59:08", "background_image": "https://media.rawg.io/media/screenshots/d56/d569cdd3963fdb7bbc40b560c658bd83.jpg", "website": "https://octarina.netlify.app/", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1}, "playtime": 0, "achievements_count": 14, "ratings_count": 0, "suggestions_count": 60, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Octarina", "Katrin Mair", "Martin Wolf", "Nadine Bartosch", "Slavko Ivanovic", "Dhana Panzer", "Christopher Pöschl"], "genres": ["Adventure", "Casual", "Puzzle", "Platformer"], "publishers": ["Mediacube Games", "Salty Octopus Crew"], "esrb_rating": null}