{"id": 529604, "slug": "refraction-itch-ogallagher", "name": "Refraction (itch) (ogallagher)", "name_original": "Refraction (itch) (ogallagher)", "description": "Refraction\r\n\t\t\r\n\r\n\t\t\t\r\n\t\t\t\tlocal &amp; remote asynchronous multiplayer action shooter\r\n\t\t\t<br/>\n<p>\r\n\t\t\tPlay it now at refraction.fun!\r\n\t\t</p>\r\n\r\n\t\t\tControls\r\n\t\t\r\n<p>\r\n\t\t\tWASD or arrow keys to run up, left, down, and right.\r\n\t\t</p>\n<p>\r\n\t\t\tPoint and left-click to point and shoot. You want to shoot the other teams; <strong>careful of friendly fire!</strong>\n</p>\n<p>\r\n\t\t\tThe bar at the top of the game window shows a combination of remaining ammunition and remaining shots in the current clip. The clip limits shot frequency (has a capacity and continuous reload speed), and ammunition limits total shots per round.\r\n\t\t</p>\n<p>\r\n\t\t\tYour player is marked with a black X. Teams are denoted by colors (blue, orange, green, magenta).\r\n\t\t</p>\n<p>\r\n\t\t\tBelow the game window is a switch to toggle local vs online mode. In online mode, you pick a username and pass turns between your and other usernames.\r\n\t\t</p>\r\n\r\n\t\t\tSystem requirements\r\n\t\t\r\n<p>\r\n\t\t\tJust a computer browser with a keyboard and mouse. Mobile devices are not yet supported (the UI would first need some major improvements, and the game window would need touch control support). Most browsers should work (I’ve done cursory testing in Chrome, Firefox, and Safari).\r\n\t\t</p>\r\n\r\n\t\t\tGameplay\r\n\t\t\r\n<p>\r\n\t\t\tYour objective is to get as many of your players to the opposite base as possible, while at the same time allowing as few of the players from the other team get to your base as possible. You get one point for each player that reaches the opposing base within the time limit.\r\n\t\t</p>\n<p>\r\n\t\t\tThe game can be played with 2, 3, or 4 teams. The arena is a square, and each base is a corner. Let’s assume the game is just 2 teams, blue vs orange, and run an example.\r\n\t\t</p>\n<ul>\n<li>The first turn, blue moves to the opposite corner, which seems easy enough. Score is <strong>1 to 0</strong>.\r\n\t\t\t</li>\n</ul>\n<p>\n</p>\n<ul>\n<li>Orange then runs the opposite direction, and takes out blue’s first player on the way. Score is now <strong>1 to 1</strong>.\r\n\t\t\t</li>\n</ul>\n<p>\n</p>\n<ul>\n<li>Back to blue two, who manages to shoot orange one before they can shoot blue one. Blue scores 2 points! Score is now <strong>3 to 1</strong>.\r\n\t\t\t</li>\n</ul>\n<p>\n</p>\n<ul>\n<li>Orange two avenges orange one, but not quick enough to save them. Score is now <strong>3 to 2</strong>.\r\n\t\t\t</li>\n</ul>\n<p>\n</p>\n<ul>\n<li>Blue three takes out orange two, saving one of the blue team to score 2 more points. Blue now leads significantly, <strong>5 to 2</strong>.\r\n\t\t\t</li>\n</ul>\n<p>\n</p>\n<ul>\n<li>Orange three struggles to help out, and doesn’t manage any kills until the other orange players are already dead. Score is <strong>5 to 3</strong>.\r\n\t\t\t</li>\n</ul>\n<p>\n</p>\n<ul>\n<li>Blue four heads straight for orange three, taking them out before they can shoot anyone. Score is now <strong>8 to 3</strong>.\r\n\t\t\t</li>\n</ul>\n<p>\n</p>\n<ul>\n<li>In the final round, orange four fails to make much of a difference, letting blue score again. The final score is <strong>10 to 4</strong>.\r\n\t\t\t</li>\n</ul>\n<p>\n</p>\n<p>\r\n\t\t\tEventually, the game is over (default is 8 turns). The winning team has the most points total. The game then enters playback mode, and we can review how it went!\r\n\t\t</p>\n<p>\n</p>\r\n\r\n\t\t\tCustomization\r\n\t\t\r\n<p>\r\n\t\t\tI added a <strong>game configuration</strong> section where some basic game settings can be set prior to playing the first turn.\r\n\t\t</p>\n<p>\r\n\t\t\tYou can currently customize:\r\n\t\t</p>\n<ul>\n<li>\n<strong>number of teams</strong>\n</li>\n<li>\n<strong>number of rounds</strong>\n</li>\n<li>\n<strong>player run speed</strong>\n</li>\n<li>\n<strong>player radius</strong>\n</li>\n<li>\n<strong>bullet tracer length</strong>\n</li>\n<li>\n<strong>frame limit</strong> (round time limit, in frames)\r\n\t\t\t</li>\n</ul>\r\n\r\n\t\t\tDevelopment\r\n\t\t\r\n<p>\n<strong>Refraction</strong> is a pretty early prototype, so I’ll be updating it frequently and am looking forward to suggestions.\r\n\t\t</p>\n<p>\r\n\t\t\tIt’s also open source and shared on GitHub at ogallagher/refraction. Check it out!\r\n\t\t</p>\r\n\r\n\t\t\tPlanned improvements\r\n\t\t\r\n<ul>\n<li>pick a design theme and replace the placeholder graphics with something <em>cooler</em>\n</li>\n<li>redesign the page interface so the layout is not so sparse\r\n\t\t\t</li>\n<li>fix gameplay for 3 and 4 teams\r\n\t\t\t</li>\n<li>expand the arena by adding some camera panning\r\n\t\t\t</li>\n<li>extend game mechanics with player abilities, secondary attack, items (details unknown)\r\n\t\t\t</li>\n<li>add passwords to prevent account sabotage\r\n\t\t\t</li>\n<li>add mobile support\r\n\t\t\t</li>\n<li>and more ?\r\n\t\t\t</li>\n</ul>\r\n\r\n\t\t\tCredits\r\n\t\t\r\n<p>\r\n\t\t\tAuthor: Owen Gallagher<br/>\r\n\t\t\tGraphics library: paperjs<br/>\r\n\t\t\tWeb design library: bootstrap<br/>\r\n\t\t\tServer hosting: Amazon Web Services\r\n\t\t</p>", "metacritic": null, "released": "2020-12-09", "tba": false, "updated": "2020-12-11T07:10:04", "background_image": "https://media.rawg.io/media/screenshots/1ed/1ed5b3c6feb93c31b97a989e0c6e2c6e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 10, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["ogallagher"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}