{"id": 5296, "slug": "spec-ops-covert-assault", "name": "Spec Ops: Covert Assault", "name_original": "Spec Ops: Covert Assault", "description": "<p>Purchase this PS one® Classic and play it on both your PS3™ and PSP® (PlayStation®Portable) systems!</p>\n<p>Lock and load, because the Rangers are back in action! Choose your two-man team from a squad of five expert Rangers. Traverse dangerous ground and utilize ten different weapons to complete your missions and defend democracy.<br />\nDownload this PS one® classic game today and jump into the action!<br />\nTransferring to a PSP® system from your PS3™ system:<br />\nYou must be signed into the PlayStation®Network account that originally purchased the game.  You must have at least 64 MB free on your Memory Stick Duo™.  Connect your PSP® system to your PS3™ system with a USB cable and switch your PSP® system to USB Mode. Highlight the game on the PS3™ XMB™, press the Δ button and select Copy.</p>\n<p>PC Store Customers:<br />\nLog into your PlayStation®Network account that you originally used to purchased the game.  Then, download the game from your “Download List” in the PlayStation®Store onto your PS3™ system.<br />\nThis title has been converted from the original PlayStation® disc to the PSP® and the PS3™ systems. Consequently, there may be times where the title plays differently from the PlayStation® disc version, or where some features may not function properly.  This version does not support PlayStation® peripherals (controller, memory card, multitap, etc.), therefore functionalities such as multiplayer, versus, and co-op modes are not available.<br />\nSpec Ops: Covert Assault™ © 2000-2001 Take-Two Interactive Software, Inc. Spec Ops and Spec Ops: Covert Assault are trademarks of Take Two Interactive Software, Inc. All rights reserved.<br />\n&quot;PlayStation&quot; and the &quot;PS&quot; Family logo are registered trademarks of Sony Computer Entertainment Inc.<br />\nPurchase indicates acceptance of the PlayStation®Network Terms of Service/User Agreement and this item&#39;s use restrictions.  If you do not wish to accept all these terms, do not purchase or use this item.  One-time license fee for downloads to up to 2 console systems and 2 portable systems that are associated with the purchasing account.</p>", "metacritic": null, "released": "2009-07-23", "tba": false, "updated": "2023-05-20T04:35:04", "background_image": "https://media.rawg.io/media/screenshots/cf4/cf4a7bbd416f067a28f6cedbf8b7cbb6.jpg", "website": "", "rating": 2.71, "rating_top": 3, "added_by_status": {"yet": 1, "owned": 5, "beaten": 1, "toplay": 1, "dropped": 9}, "playtime": 0, "achievements_count": 0, "ratings_count": 7, "suggestions_count": 207, "game_series_count": 8, "reviews_count": 7, "platforms": ["PlayStation"], "developers": ["Sony Interactive Entertainment"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": "Teen"}