{"id": 529829, "slug": "crimson-desert", "name": "Crimson Desert", "name_original": "Crimson Desert", "description": "<p>Crimson Desert is a sequel of sorts to Pearl Abyss&#39; flagship game, Black Desert. It combines elements of narrative-driven single-player games with online multiplayer functionality.</p>\n<p>A vast but divided continent... A harsh desert... Cities as dangerous as they are breathtaking... In the world of Crimson Desert, gritty realism often precedes aesthetic beauty.</p>\n<p>Crimson Desert tells the story of Pywel, a vast continent of divided regions inhabitated by people struggling to survive in its ever-changing lands. From the vast plains of Akapen to the inhospitably cold lands of Kweiden, or the barren Desert, each region possesses its own unique beauty. However, you might have to scrape away the grime to see it!</p>\n<p>As you traverse the cities of Pywel, be it the Desert Oases or Kweiden’s Ulsrund, land of the wolf, expect to encounter filthy alleys, destitute hovels, and marketplace language that would make even a Troll blush. Each location has its own unique character that is both fantastical and grounded in gritty realism. </p>\n<p>Will you explore these strange new lands alone or venture into them with other players? However you decide to explore these ancient mysteries, just remember that whether you intend to or not, your actions will influence the story of Pywel. </p>\n<p>This is Crimson Desert. This is where legends are made.</p>", "metacritic": null, "released": null, "tba": true, "updated": "2020-12-14T11:21:35", "background_image": "https://media.rawg.io/media/screenshots/bd5/bd52be2b0f166bd43501e3088144d771.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 18, "owned": 10, "toplay": 65}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 205, "game_series_count": 0, "reviews_count": 0, "platforms": ["Xbox One", "PC", "PlayStation 4"], "developers": ["Pearl Abyss"], "genres": ["Action", "Massively Multiplayer"], "publishers": ["Pearl Abyss"], "esrb_rating": null}