{"id": 529838, "slug": "tg-internal-void", "name": "TG Internal Void", "name_original": "TG Internal Void", "description": "<p>Matheus Hirata Santos\r\n  </p>\n<p>Rodrigo Santana de Souza Reis\r\n  </p>\n<p>Tamilyn Kuniy\r\n  </p>\n<p> \r\n  </p>\n<p><strong>Sumário:</strong>\n</p>\n<p>Durante uma tarde de verão Nelphy e sua irmã Fley estavam entediados na casa de sua avó que estava na cozinha, mais uma tarde típica de verão, mas tem algo diferente no ar. Quando o jovem Nelphy está para comentar esse fato sua irmã deixa cair algo da estante que não se parecia com um item de decoração comum que uma senhora teria em casa. Um objeto enrolado em panos velhos e arames com um aviso “não abra”, um cartão de entrada para qualquer jovem entediado. Talvez fosse sensato apenas deixar o artefato trancado no seu esquecimento, mas os irmãos já estavam atiçados pela curiosidade. Ao cortar as amarras com um alicate e remover os panos o artefato se revela um livro medonho: a capa é de um marrom envelhecido pelo tempo, com ranhuras que quase fazem lembrar uma feição humana, ao abrir, as páginas estão em branco e suas folhas tem uma coloração amarelada, porém na contra capa o jovem consegue ver o desenho da entrada de uma caverna que lhe é familiar...sim, claro o velho morro no bosque que por algum motivo seu avô nunca os deixava ir lá o que deixava tudo mais empolgante. Ir até a caverna era, agora, a coisa mais importante. A empolgação das crianças não os faz prestar atenção nas vozes sussurrando em suas mentes e assim elas vão na entrada da caverna, a menina hesita, o ar quente de verão e a feição assustado no livro lhe diz que há algo de ruim entre as pedra milenares dessa gruta, mas seu irmão a encoraja a vir com uma voz que quase já não é a dele “vamos, está com medo da verdade?”.   </p>\n<p>Ele vai na frente e ela o segue de perto, a entrada da caverna se fecha com um estrondo, pedras caem cobrindo a entrada e um selo verde com quatro fechaduras se forma nas pedras. Ao ligar a lanterna o garoto pode ver o livro tomar forma: a capa é claramente um rosto humano deformado, suas páginas estão manchadas de vermelho sangue com desenhos macabros de criaturas a muito tempo esquecidas, na primeira página pode se ver um pequeno aviso tomar forma na folha em branco “A porta de entrada e saída do mundo dos desesperados, a mesa está posta, famintos eles vem para o jantar, a verdade será revelada aqueles que nos 4 desafios se provar.” Vozes na escuridão, ruídos vem das pedras, o medo toma o coração dos jovens e uma única certeza pode ser dita, segredos antigos estavam escondidos ali.... e eles estão famintos.\r\n  </p>\n<p> \r\n  </p>\n<p><strong>Plataforma: PC</strong>\n</p>\n<p><strong>Gênero: Survival Horror<br/></strong></p>\n\n<p>Trabalho de Graduação (TG) do Curso Superior de Tecnologia em Jogos Digitais da Fatec Carapicuíba. Semestre letivo: 2020/2\r\n  </p>", "metacritic": null, "released": "2020-12-08", "tba": false, "updated": "2020-12-11T08:10:57", "background_image": "https://media.rawg.io/media/screenshots/9ce/9ce687c9abae53405541b190ba3838ec.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SiJOGA - Fatec Carapicuíba"], "genres": [], "publishers": [], "esrb_rating": null}