{"id": 529818, "slug": "automeme", "name": "Automeme", "name_original": "Automeme", "description": "Automeme.io - place your meme characters and let them fight against other memes!\r\n\r\n<p>Buy, upgrade and rearm memes in order to beat your opponents in this autobattler meme mashup.</p>\r\nControls:\r\n<p>Mouse / Tap for every action</p>\n\r\nGameplay details:\r\n<p>\n</p>\n<p><strong>Lobby</strong>\r\nUp to 10 players join a room. Game starts automatically after a while.</p>\n<p><strong>Prematch</strong>\r\nPlayer has couple of seconds to pick a card from the pool of random cards. It goes to another player after that. After all cards were picked, planning starts.</p>\n<p><strong>Planning</strong>\r\nPlanning is where the player does the most. Players get assigned in pairs.\r\nMain goal is to place heroes on the board (by dragging their cards at blue zone on the board). Cards require mana to place and mana limit rises with each turn played.</p>\n<p>On the bottom right there is a button that opens the shop. It contains 3 cards, after all of these are bought (by dragging them to player’s hand), there is a new batch ready. Shop can be closed by clicking the shop button again.</p>\n<p>One button higher there is an item shop. After opening this window, you can buy items by dragging them on hero cards below.</p>\n<p>Above item shop button there is a ready button. If both fighting players are ready, game starts instantly.</p>\n<p>When a card is being dragged, 2 new buttons appear. One on the bottom right. When card gets dropped there, it opens a window with hero information (stats and abilities).\r\nThe second button is on the top left and it appears when the card that is being held comes from player’s hand. When the card gets dropped there, the card gets removed from the hand and the game.\r\n</p>\n<p><strong>Battle</strong>\r\nAfter planning phase, hero placements get placed on both of the opponents boards and placed heroes fight each other.</p>\n<p>Winner gets coins for the victory.\r\nLoser gets less coins and his health is dropped.\r\nBattle can end up in a draw, dealing little damage to both players.\r\n</p>\n<p>If a player dies (0 hp or less), he gets eliminated from the game.\r\nLast player alive wins the game.</p>\n<p><strong>Leveling up</strong>\r\nAfter obtaining 3 cards of the same meme, it gets merged into one of higher rank. Highest rank is 3.</p>\n<p><strong>Auction</strong>\r\nAfter every couple battles, there is an auction. It contains memes of already higher rank. Players can bid on the card that is being auctioned. The winner pays the amount he bid and other bidders don’t pay anything.</p>\n<p><strong>Death</strong>\r\nAfter being eliminated, the player is set as a spectator. Spectator watches next battles that happen.</p>", "metacritic": null, "released": "2020-12-08", "tba": false, "updated": "2020-12-11T08:06:12", "background_image": "https://media.rawg.io/media/screenshots/807/80708cbfe940afe4b1a362a73b978ab0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 24, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Yazaa"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}