{"id": 530043, "slug": "smaug-lury", "name": "SMAUG Lury", "name_original": "SMAUG Lury", "description": "<p>Gênero: Plataforma</p>\n<p>Plataforma: Mobile e computador</p>\n<p>Sinopse: Em “Lury”, o jogador precisa ajudar a personagem protagonista, uma cachorrinha muito carismática e corajosa, a sobreviver aos perigos do ambiente e reencontrar seus donos, os quais foram capturados por um grupo de criminosos, enquanto caminhavam pela floresta.</p>\n<p>Enredo: A história começa quando Lury e seus humildes donos são obrigados a migrar para outra região, pois o local onde viviam foi castigado por uma terrível seca.<br/>Após uma longa caminhada, a família chega a uma misteriosa floresta e nela se depara com um grupo de criminosos que estão derrubando as árvores e capturando animais para traficá-los. Lury tenta proteger seus donos e morde o cruel líder dos criminosos. O impiedoso homem a chuta com demasiada força, a cachorrinha bate a cabeça contra uma pedra e fica desorientada. Ela vê num borrão o bandido apontando sua arma para ela, sem piedade. Tudo escurece e Lury começa a perder a consciência. Ela consegue apenas ouvir o ensurdecedor barulho do disparo de uma arma. O que acontece em seguida? Só jogando para saber...</p>\n<p>Equipe – 1JDN<br/>Adriano Santos Chaves<br/>Ana Martins<br/>Diego Cardoso Meruoca de Sousa<br/>Douglas Lima Osti<br/>Silvia Regina de Alencar Frigatto<br/>https://dasad-games.github.io/</p>\n<p>Mostra Melhores do Sistema Maximizado de Avaliação Unificada em Games (SMAUG), projeto interdisciplinar do Curso Superior de Tecnologia (CST) em Jogos Digitais da Fatec Carapicuíba. Semestre letivo: 2020/2. Ciclo: 1JDM<br/></p>", "metacritic": null, "released": "2020-12-08", "tba": false, "updated": "2020-12-11T09:04:25", "background_image": "https://media.rawg.io/media/screenshots/c51/c518190602633f34b806a874a4c859d3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 86, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SiJOGA - Fatec Carapicuíba"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}