{"id": 530021, "slug": "hemo-voracity", "name": "Hemo Voracity", "name_original": "Hemo Voracity", "description": "Finding yourself in an unknown place your only choice is to escape, but will you survive?\r\n<p>Of the many cultures of the world there were those, in ancient times, that tried to gain power, to spite the gods of their lands. These once off people fed on the blood, bodies and souls of their fellow men and in doing so, lost the souls they once had… or were bound to the world after death. </p>\n<p>These beings were the first of the vampires, the once-humans cursed by their own actions or the gods themselves.</p>\n<p>These creatures however… did not mind these curses for with the curses, came the loss of their humanity and any doubt in their mind. With this new power they had obtained they continued a cursed half-life that they cannot recognise as a curse, they went out, spread these curses to unfortunate victims. </p>\n<p>These creatures were all different and the only thing they had in common was the hunger for the mortal soul and as such people called them all under the moniker of vampire.</p>\n<p>Lately these monsters have been abducting the descendants of who the first of their kind committed the cardinal sins that their curses are against. These unlucky souls have the protection of a guardian spirit from the land they are trapped in, that land being transilvania, this spirit is as ancient as some of the curses and recognises these captives as the descendants the blood of these humans and the blood of these monsters have and an ancient link, and what these monsters want with these humans is unknown....</p>\n\n<p>Hemo Voracity is a 1 vs. up to 9 player asymmetric survival horror game where the survivors have to run around the map completing tasks to obtain a Ritual Item. This Ritual Item needs to be deposited at the Ritual Site where a Ritual to escape the Nosferatu will be performed once all Ritual Items are collected. Throughout this survivors will have to run from the Killer a Nosferatu that will attack and kill the survivors in its thirst for blood. Survivors can stun the Nosferatu using a Silver Cross which can be found throughout the map. </p>\n\r\nCurrent State\r\n<p>The game is currently in a very early stage of development. The current version of the game is a prototype for game mechanics for both the survivor and killer. Multiplayer is not implemented currently within the game and we are working to implement this in later stages. For the survivors the number keys are used to select the items they are currently holding and for the killer the number keys are used to use the different abilities. For the UI in the main menu only the play and quit buttons work and the in-game the escape menu isn't connected. </p>\n<p><strong>Survivors</strong></p>\n<p>Currently the survivor items are using place holder images and don't reflect the survivor items. The Silver Cross is on number 1 and Ritual Item is on number 2. The Silver cross is represented by the white spheres and the Ritual Items are represented by pink cubes. Ritual items will need to be deposited into the central lake for players to escape as a stand in for the ritual site.</p>\n<p><strong>Killer</strong></p>\n<p>Currently the killers third ability isn't working. Killer abilities can be tested on players and hits are seen by the green survivor turning red. </p>\n\r\nControls\r\nControlsKeyboardMovementWASDSprintLeft Shift<br/>CrouchLeft ControlInteract/Pick Up ItemEAbilities/Select ItemNum 1, Num 2Use ItemLeft Mouse ButtonMapSpacebarIn-Game MenuEsc\r\n\r\nTeam Members\r\n<p><strong>William Jarman -</strong> Project Manager, Killer Modeller, Designer</p>\n<p><strong>Charbel Bouchmouny -</strong> Programmer</p>\n<p><strong>Harlem Egen -</strong> Mechanic Designer, Lighting Designer</p>\n<p><strong>Jacqueline Holdaway -</strong> Level Designer, UI Designer</p>\n<p><strong>Vincent Shiou -</strong> Survivor Modeller, Programmer,  Designer</p>\n\r\nFeedback \r\n<p>Hemo Voracity is currently in development and we would appreciate any feedback on the current game <em>here</em>. You can also reach us on our social medias and in the comment section below with feedback. </p>\n\r\nSocials\r\n<p>Twitter</p>\n<p>Instagram</p>\n<p>YouTube</p>\n<p>This game was made for a University project.<br/></p>", "metacritic": null, "released": "2020-12-08", "tba": false, "updated": "2020-12-11T08:57:59", "background_image": "https://media.rawg.io/media/screenshots/0c1/0c1f471d96a31e766afaa46453b05dd4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 2, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Vincent_Shiou", "Jacqueline Holdaway", "Charbel", "Harlem E", "gunner_gaming"], "genres": [], "publishers": [], "esrb_rating": null}