{"id": 530079, "slug": "rainy-blocks-teryu", "name": "Rainy Blocks (Teryu)", "name_original": "Rainy Blocks (Teryu)", "description": "<p><strong>My first selfmade videogame! </strong> Although I'm still a beginner both in design and programming, I did my best to create a somewhat enjoyable experience. Also, it may occur that the mouse sensitivity is way to slow/fast depending on what device you run the game.  On my device everythink runs perfect and I think I solved the problem. But if not, I would really appreciate it if you could write a comment bellow :)</p>\n<p><strong>Gameplay: </strong></p>\n<p>If you survive 60s, you win. You play as a red box, which needs to avoid both the white box, which is continuously following you, and the black boxes, which spawns randomly every second somewhere on the map. If you touch the white box which is following you, you die, the same with the black boxes. So the more the time is passing, the more the number of black boxes will appear, which makes it more difficult to get away from the white box</p>\n<ol><li><strong> A,S,W,D</strong> to move your player</li><li><strong>Space</strong> to jump (if you hold the space bar, you'll jump higher)</li><li><strong>Mouse</strong> to look around</li></ol>\n<p>The<strong> difficulty buttons</strong> will change how fast the white box will follow you</p>\n<p>P.S. sorry for the \"can become\" annoying background music, this was my first experience with creating a song. </p>\n<p>I hope you ENJOY!</p>", "metacritic": null, "released": "2020-12-07", "tba": false, "updated": "2020-12-11T09:13:02", "background_image": "https://media.rawg.io/media/screenshots/def/defd9fe621d2dd3c95cd4d6687d52a16.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Teryu"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}