{"id": 53004, "slug": "guilty-gear", "name": "Guilty Gear", "name_original": "Guilty Gear", "description": "<p>Guilty Gear (Japanese: ギルティギア, Hepburn: Giruti Gia), subtitled The Missing Link in Japan, is a 2D fighting video game developed by Team Neo Blood, an Arc System Works production group led by Daisuke Ishiwatari, and published by Arc System Works. First released on May 14, 1998, for the PlayStation, it is the first installment in the series of the same name. Set in a world destroyed by a war between humans and bio-organic weapons called Gears, it follows ten fighters as they enter a tournament held to prevent resurrection of the Gears&#39; leader. Its gameplay consists in one-on-one fights, with a main four button configuration, featuring special moves and instant kill techniques, as well as three different playable modes.<br />\nDevised by Ishiwatari, it took a year and a half in production, with Street Fighter and manga influences. After its original release, it was brought to North America, Europe and PAL region, and reached cult status among gamers. It has received favorable critical reception, with praise towards its characters&#39; roster, 2D graphics and fast gameplay that differentiates it from other games of the same genre. It has been labeled as one of few games of its era to cause any sort of impact on the genre, except from Capcom and SNK hegemonic games. However, it received criticism due to its difficult and unbalanced set of characters.</p>", "metacritic": null, "released": "1998-05-14", "tba": false, "updated": "2024-01-11T17:06:28", "background_image": "https://media.rawg.io/media/screenshots/e18/e18b7a8bfdab3929f71164bec2098e41.jpg", "website": "", "rating": 4.36, "rating_top": 5, "added_by_status": {"yet": 4, "owned": 12, "beaten": 11, "toplay": 12, "dropped": 8}, "playtime": 0, "achievements_count": 0, "ratings_count": 11, "suggestions_count": 443, "game_series_count": 16, "reviews_count": 11, "platforms": ["PlayStation", "Nintendo Switch", "PC", "PlayStation 4"], "developers": ["Arc System Works"], "genres": ["Fighting"], "publishers": ["Atlus", "Arc System Works", "Studio 3"], "esrb_rating": "Teen"}