{"id": 530164, "slug": "corona-attackprototype", "name": "Corona Attack(Prototype)", "name_original": "Corona Attack(Prototype)", "description": "<p>Short prototype for a class, for Android.</p>\n<p>Rules:</p>\n<p>1. You can move the character right or left, with the buttons at the left and bottom of the screen.</p>\n<p>2. You can jump with the button at the right and bottom of the screen.</p>\n<p>3. The main objetive is to collect 5 pills, without dying on the process.</p>\n<p>4. The inyections rest you one life.</p>\n<p>5. The Corona Enemy is a one-hit kill.</p>\n<p>6. The band aids heal one life, only if you are not at maximum.</p>\n<p>7. The Vitamin offers invulnerability for a short period of time. Useful in dangerous zones.</p>\n<p>8. The beds work as trampolines, the jump distance is higher when you jump on a bed. Useful in platforming.</p>\n<p>----------------------------------------------------------------------------------------------------------</p>\n<p>Prototipo corto para una clase, para android.</p>\n<p>Reglas:</p>\n<p>1. Puedes mover al personaje a la izquierda y derecha, con los botones en la esquina inferior izquierda de la pantalla.</p>\n<p>2. Puedes saltar con el botón en la esquina inferior derecha de la pantalla.</p>\n<p>3. El objetivo principal es recoger 5 píldoras, sin morir en el proceso.</p>\n<p>4. Las inyecciones te restan una vida.</p>\n<p>5. El Enemigo Corona te mata de un solo impacto.</p>\n<p>6. Las curitas te curan una vida, si no estas al máximo.</p>\n<p>7. La Vitamina ofrece invulnerabilidad por un periodo corto de tiempo. Útil en zonas peligrosas.</p>\n<p>8. Las camas funcionan como trampolines, la distancia de salto es mas alta cuando saltas sobre una cama. Útil para el plataformeo.</p>", "metacritic": null, "released": "2020-12-07", "tba": false, "updated": "2020-12-11T09:32:42", "background_image": "https://media.rawg.io/media/screenshots/8ab/8ab8b061749ecf5aa8ae8c835580dd74.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 28, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Taller#1"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}