{"id": 530353, "slug": "rediscovery-a-kakegurui-fan-game", "name": "Re:Discovery - A Kakegurui Fan Game", "name_original": "Re:Discovery - A Kakegurui Fan Game", "description": "<p>After an emotionally charged incident at Hyakkaou academy, the Student Council President invites her \"new\" secretary, Sayaka, to spend the weekend at her home. Sayaka agrees. She can only hope that what happens then would be good.</p><p>Re:Discovery is a visual novel demo for a Kakegurui fan game starring Sayaka as the protagonist.</p><p>The play time is a couple of minutes to half an hour.</p><p>The game is provided free at no cost.</p>\n<p>-----</p><p><strong>Credits</strong></p>\n<p>Director: AJ &amp; Crispy<br/>Artist: Crispy<br/>Writer: AJ<br/>Programming: Crispy &amp; AJ<br/>Moral &amp; Tech Support: Roth<br/>Music: Kevin Macleod </p><p>For more info about our team, please visit our carrd!</p>\n<p>-----<br/></p><p><strong>Note from the Team</strong></p><p>Hello everyone! </p>\n<p>This has been a long game jam. Let's give a round of applause for the Yuri Jam 2020 organizers!!</p>\n<p>Kawamoto-sensei and Naomura-sensei created an incredible world and without them, all of this would not be possible. This here has been a project envisioned three years ago when we first read Kakegurui and finally, we found the time to make a demo of it. </p>\n<p>Kirari and Sayaka are characters that are very dear to our hearts, which is exactly why we set this right after the Tower of Doors Arc (Ch 33 in the manga). We based it heavily on the manga, so there will be spoilers up to that point. We always wondered what happened afterwards. And so we decided to explore the possibilities and this is what we poured our souls into.</p>\n<p>If you can believe it, this is only the beginning.  Please look forward to more updates in the near future! Thank you to everyone that participated!</p><p>-----</p><p>edit: we have also added a mac version!</p>", "metacritic": null, "released": "2020-12-07", "tba": false, "updated": "2020-12-11T10:21:38", "background_image": "https://media.rawg.io/media/screenshots/dfb/dfbfaed7e8cb57982d1143be0b6208c4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 20, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Team ToG"], "genres": [], "publishers": [], "esrb_rating": null}