{"id": 5304, "slug": "battlefield-1943", "name": "Battlefield 1943", "name_original": "Battlefield 1943", "description": "<p>It&#39;s time to do your part in the action packed battles of the World War II Pacific campaign! Pick your path - be it as a rifleman crawling the trenches, a steel fisted tank commander, or ace fighter pilot dog fighting to protect the skies. Play as a lone wolf or with your friends, coordinating to turn the tide of battle. Whatever you choose, you get to enjoy the thrill of a fully featured online shooter with the unique Battlefield™ gameplay.<br />\nSo, whether you are flying your Zero fighter for the glorious Japanese Imperial Navy over Wake Island or rushing the shores on Iwo Jima with other battle-hardened U.S Marines, you´re in for an intense battle.  Use the built in squad features to team up with up to 4 other soldiers and make your way across the Pacific Theatre together.  Thrash an enemy bunker, setup camp and snipe across the map, steal a tank in the enemy’s stronghold while your comrades launch an all out bomber attack the choices are endless!<br />\nBuy now for a complete, action packed Battlefield™ gameplay right at your fingertips with quick and easy access.<br />\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service).<br />", "metacritic": 84, "released": "2009-07-08", "tba": false, "updated": "2024-03-09T22:00:14", "background_image": "https://media.rawg.io/media/games/3fb/3fb4cecfa42d7cdf98dabb59bb42925e.jpg", "website": "http://www.battlefield1943.com", "rating": 3.75, "rating_top": 4, "added_by_status": {"yet": 15, "owned": 782, "beaten": 110, "toplay": 19, "dropped": 67, "playing": 2}, "playtime": 1, "achievements_count": 24, "ratings_count": 165, "suggestions_count": 547, "game_series_count": 17, "reviews_count": 165, "platforms": ["Xbox 360", "Xbox One", "PlayStation 3"], "developers": ["Electronic Arts", "Electronic Arts Digital Illusions Creative Entertainment"], "genres": ["Action", "Shooter"], "publishers": ["Electronic Arts"], "esrb_rating": "Teen"}