{"id": 530564, "slug": "persian-nights-2-moonlight-veil", "name": "Persian Nights 2: Moonlight Veil", "name_original": "Persian Nights 2: Moonlight Veil", "description": "To play this game on PS5, your system may need to be updated to the latest system software. Although this game is playable on PS5, some features available on PS4 may be absent. See PlayStation.com/bc for more details.<br/>Travel to the magical land of Persian Nights and save your sister from a dire fate. Feel the taste of orient in this sumptuous and beguiling hidden object adventure.<br/><br/>The day of Mathab is coming to an end. During this time the aura of two moons forbids spellcasting, and the magic community must rely on previously enchanted artifacts. This year, the Academy was full of uncanny accidents which lead to the scrutinous investigation led by the mysteriously looking individual. On top of that, your sister vanishes under unclear circumstances. Unfortunately, it's just the beginning of a heap of troubles that you'll be facing in the far-off orient land!<br/><br/>Welcome to the fascinating, exotic world of Persian tales and legends. Tame mythical creatures called moonlings and meet other including the fabled simurgh, experiment with magic amulets, traverse through the Academy exploring all its secrets, and reveal who's behind all the atrocities!<br/><br/>Get ready for a highly immersive, enchanting adventure which brings to memory such classics as Aladdin and Arabian Nights, dealing with the orient theme in its own, unique way.<br/><br/>Solving the mystery behind the accidents and saving sister rests upon your shoulders!<br/><br/><br/>Offline single player<br/>Uses DUALSHOCK 4 vibration function<br/>Remote Play allows users to connect to and play games on their PlayStation®4 or PlayStation®5 using a mobile device, PC, or another PlayStation®4 or PlayStation®5.<br/>Enhanced game play on PS4 Pro console<br/><br/><br/>Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy). <br/><br/>Software subject to license (us.playstation.com/softwarelicense). <br/><br/>One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.<br/>", "metacritic": null, "released": "2020-12-11", "tba": false, "updated": "2020-12-14T02:35:46", "background_image": "https://media.rawg.io/media/screenshots/24b/24b81c4586d9741a9f55d523bef2653f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4, "beaten": 1, "dropped": 1}, "playtime": 0, "achievements_count": 62, "ratings_count": 1, "suggestions_count": 377, "game_series_count": 0, "reviews_count": 1, "platforms": ["PlayStation 4"], "developers": [], "genres": ["Adventure", "Casual", "Puzzle"], "publishers": [], "esrb_rating": null}