{"id": 530569, "slug": "age-of-piratesbattleship", "name": "Age of Pirates：Battleship", "name_original": "Age of Pirates：Battleship", "description": "Age of Pirates: Plunder War is a 3D-maritime adventure game based on a realistic, geographic system. In this game, the player will take on the role of a high-seas commander. Adventurers from different countries and regions will chart new courses to open up new naval routes, while also engaging in battle.<br/><br/>※Background Story:<br/><br/> In AD 800, Kievan Rus’controlled the Black Sea and the Baltic Sea, the Abbasid Caliphate controlled the Red Sea and the Persian Gulf and, thus, the Ottoman Empire controlled the vast majority of the Mediterranean. However, this wasn’t enough. We always want what we do not have; humans, by their very nature, are always seeking to expand their boundaries. People began to wonder, for instance, what is hidden beneath the waves: buried treasure or killer sea monsters? Everyone had been hearing that the earth was round, but there wasn’t any proof. Magellan went on a voyage across the world and changed that forever. You can change the world too. Commander, lead your troops onto the high seas. Dock in foreign ports, and plant your flag in distant lands!<br/><br/>※Game Characteristics:<br/><br/>◆The Guild battle has begun. Who will emerge victorious?<br/>Three main forces have gathered on the open seas: the Abbasid Caliphate and their brilliant civilization, Kievan Rus’, descendants of the Vikings and the powerful Ottoman Empire. The trumpets of war have sounded, and the armies are fast approaching. Who will conquer the oceans? Commander, it is time for you to show what you’ve got!<br/><br/>◆Real time, naval PVP battles, slaughter your enemies and become king!<br/>Plunder passing ships, gather allies to defeat the World BOSS, participate in Arena challenges, large-scale, multiplayer PVP battles, tons of combat modes to choose from, who could ask for anything more? Commander, time waits for no man. Let’s get started!<br/><br/>◆Hidden treasure is waiting for you! Go acquire some new wealth!<br/>We have hidden more than 100 buried treasures in the sea. These are gifts from Sea God. Maybe you’ll find Gold or Silver; maybe you’ll find a new warship….or maybe you’ll encounter a killer sea monster! It all depends on your luck!<br/><br/>◆Gorgeous skill effects, a smooth combat experience<br/>We have developed a unique skill set for each captain. They can advance on an enemy and attack, or fall back into a defensive position. Recruit legendary sea captains like Babarosa Hayreddin the “Redbeard” and Edward Thatch, the \"Blackbeard\" and fly into battle!<br/><br/>◆Exquisite combat vessels, equipment set bonuses<br/>We’ve designed 24 types of warships and 14 equipment sets. Let’s say you own the “Flying Dutchman” and then obtain protection from “Poseidon, the Sea God”. Well, you’ll have enough power to crush your enemies.<br/><br/>◆Join guilds, because there’s strength in numbers!<br/>You’ll find players from many different countries and regions. Join up with them and form guilds to pool your resources. Guilds will provide you with superior protection as well.<br/><br/>◆A unique home construction system will allow you to create your own safe haven.<br/>Customize your home with tons of different options. Commander, develop your home to serve as a testament to your brilliance.<br/><br/>◆Light up the 12 constellations to guide you on your quest.<br/>For centuries, seafarers have relied on the stars to guide them. Go to the Observatory to watch the stars. The illuminated constellations will show you the way forward, so you never get lost.<br/><br/>◆A precise commerce system; it’s fun to trade!<br/>We’ve set up 143 ports across the 7 seas and 4 great oceans. Each port has its own unique products, and there will be special sales and events at certain fixed intervals. Join in events to build your stash of goods!<br/><br/>◆Tons of events make your adventure even more exciting!<br/>There are always surprises in store on the high seas. Watch out for pirates or sudden changes in weather. Perhaps a plague will descend on your crew and start killing them off. We have pulled out all the stops to make this a realistic ocean adventure!", "metacritic": null, "released": "2019-08-07", "tba": false, "updated": "2020-12-14T02:38:51", "background_image": "https://media.rawg.io/media/screenshots/1f8/1f84ffbafa06217b6555122b6033a381_fPhSIkM.jpg", "website": "https://www.facebook.com/AgeOfPirates2020/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 472, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["BRIGHT TECH"], "genres": ["Adventure", "RPG"], "publishers": ["BRIGHT TECH"], "esrb_rating": "Everyone 10+"}