{"id": 530582, "slug": "senet-deluxe", "name": "Senet Deluxe", "name_original": "Senet Deluxe", "description": "Senet Deluxe - The Ancient Game of Life and Afterlife<br/><br/>Senet is an ancient Egyptian race game and the predecessor of our modern Backgammon. The oldest known form of the game is shown in a painting from the tomb of Hesy (circa 2686-2613 BCE). Many pictures of the game and artifacts have been discovered and are displayed in Museums around the world. The commonness of these finds indicates that the game was very popular in its time.<br/><br/>The main adversaries in Senet are the Spools and the Pyramids. These pawns follow a path from their start positions to the House of Horus in an inverted 'S'. The player moving all of his pawns off the board first wins. Fields on the Senet board are called houses. Some of these have special significance and are adorned with icons like the Ankh symbol. Instead of dice flattened sticks are used. Each stick has a bright side and a dark side. Every bright side is a point. If only dark sides are showing the player is awarded 5 points. When a 1, 4, or 5 is thrown the player gets another turn.<br/><br/>When moving into a field occupied by an opponent, the pieces switch places. If, however, the opponent's pawn is part of a row of two or more, it cannot be beaten. It is possible to 'jump' over an opponent if it isn't part of a row of 3 pieces or more. 3 pieces are considered a block and are an important strategic tool.<br/><br/>Through symbology Senet hints at the afterlife as seen from an Egyptian point of view. If one's piece is beaten on one of the last three fields or the jump over the House of Water is not successful one moves back to the house of Rebirth. In such the game alludes to reincarnation and the journey of the dead.<br/><br/>Senet Deluxe is a truly unique strategy game. It features great animation, a soundtrack, an intelligent adversary, enforceable backwards moves, highlighting for acceptable moves, game statistics and online help. Be prepared to spend many hours with the most popular game of the antiquity.<br/><br/>For more screenshots and several videos of the application in action, please visit the website indicated below.", "metacritic": null, "released": "2019-02-03", "tba": false, "updated": "2020-12-14T02:44:09", "background_image": "https://media.rawg.io/media/screenshots/3bf/3bf497aa6b5eb9ca130f541ac2de4cc6_43JAvlB.jpg", "website": "https://rogame.com/senet-deluxe.html", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 107, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["RoGame Software"], "genres": ["Strategy", "Board Games", "Educational"], "publishers": ["Arthur Roolfs"], "esrb_rating": "Everyone 10+"}