{"id": 530537, "slug": "ussr-life", "name": "USSR Life", "name_original": "USSR Life", "description": "Nostalgic simulator of a life of a Soviet person. Live a life of an ordinary Soviet hard worker walking under the scorching sun of socialism and find yourself in a time where the grass was greener, ice cream was made from milk and love for the Motherland! Three hundred bucks were banned, the boy could not find the next door, the dungeon master just goes to school and becomes a pioneer, and the slaves were not even born yet! <h3>Gameplay: </h3>The game is a clicker based on the theme of the USSR and its features. Your currency is coupons, which in the USSR were dearer than everything, as well as repression , as they increase, you can get on the bottleor even in the GULAG! Work hard in the factoryto keep up with the harsh Soviet fashion, created according to GOST, and reach the ultimate dream - buy a Volga. The world's first battlepass system - the five-year plan will not let you get bored and will provide you (but this is not certain) and your country with continuous growth. Also, you will constantly need to change your General Secretary (party leaders), because equality is equality, but the struggle for power has not been canceled, besides, new general secretaries improve your earnings coefficient for coupons and repression. The game contains a set of bright locations familiar to any Soviet person.<br/><h3>Features: </h3><ul><li>A set of unique events! Don't let Yeltsin steal your vodka!<br/></li><li>The most  honest and incorruptible , and most importantly sober leaders of the Soviet Union!<br/></li><li>All the most significant events and purchases possible in the USSR!<br/></li><li>Huge selection of Soviet locations!<br/></li><li>The opportunity to get a job at the factory and send the family to a sanatorium!<br/></li><li>The most  sustainable  economic system based on coupons and repression...</li></ul>For the first time in your life, you have the opportunity to fix the past and complete socialism, in which everyone will be equal and you will not need to look for  three hundred bucks  for travel, because it will be free!", "metacritic": null, "released": "2020-12-11", "tba": false, "updated": "2020-12-14T02:19:21", "background_image": "https://media.rawg.io/media/screenshots/b7f/b7fe434700d2cb1a02c3adbebec1a5dd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 100, "ratings_count": 0, "suggestions_count": 455, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["GosDev Production", "7oxic"], "genres": ["RPG", "Strategy", "Simulation", "Casual", "Indie"], "publishers": ["SaveMeFromGULAG"], "esrb_rating": null}