{"id": 530534, "slug": "trackmaster", "name": "Trackmaster", "name_original": "Trackmaster", "description": "Challenge your friends to a chaotic race on procedurally generated levels. Never play the same track twice! Master tricky obstacles, find shortcuts and use an arsenal of different powerups. Experience a dynamic environment with moving blocks, water physics and changing weather.<h3>Features</h3><ul><li><strong>Procedurally generated tracks</strong>. <br/>All tracks are randomly generated. Choose your difficulty level and track length. Never play the same track twice!<br/></li><li><strong>Multiplayer</strong>. <br/>Compete against your friends in chaotic races! Make use of an arsenal of different powerups or simply push your opponent off the road.<br/></li><li><strong>Dynamic environment</strong>. <br/>Dynamic weather and water simulation. Race during the night or be washed away by a wave during a storm!<br/></li><li><strong>Choose between four different cars</strong>. <br/>Paint your car, equip a hat, and choose an annoying horn. Beware that each car has different weaknesses and disadvantages!<br/></li><li><strong>Master tricky obstacles</strong>. <br/>Trackmaster includes a large number of different track parts. Learn how to drive in loops and rotating barrels.<br/></li><li><strong>Be aware of your surroundings</strong>. <br/>This is no ordinary racing game. Finding the way is just as important as driving skills. A smart shortcut may win you the game!</li></ul>", "metacritic": null, "released": "2020-12-11", "tba": false, "updated": "2020-12-14T02:17:32", "background_image": "https://media.rawg.io/media/screenshots/292/292087a9224659f354fdcf665d313b4f.jpg", "website": "http://trackmaster.space", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 319, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Master Technologies"], "genres": ["Action", "Racing", "Indie"], "publishers": ["Master Technologies"], "esrb_rating": null}