{"id": 530570, "slug": "sudoku-sudoku-puzzles", "name": "Sudoku: Sudoku Puzzles", "name_original": "Sudoku: Sudoku Puzzles", "description": "Enjoy the Free Sudoku Puzzle Game for people who are a fresh start and advanced! Thousands of Sudoku Puzzles Game to play and solve. Download and start the Daily Challenge!<br/> <br/>The Sudoku - Brain Game has many different Sudoku puzzles and contained four different levels such as Easy, Medium, Difficult, and Expert to help you to choose the appropriate level for you!<br/> <br/>There are easy levels of daily Sudoku puzzles to train your brain and Medium or hard Sudoku levels are also waiting for you. The game has the functions that to add or remove notes by turning on the memo during gameplay. Did you make a mistake? Of course, there are undo and hints functions! Don't give up!!<br/> <br/>-Highlights-<br/> <br/>9*9 &amp; 3*2 blocks: 9x9 and 3*2 grids with simple design<br/>Easy, Medium, Hard, and Expert: Four perfectly balanced difficulty levels: <br/><br/>-Features-<br/> <br/>Note Mode: Turn on the note mode to take notes like a piece of paper. The memo is automatically updated itself while you fill in the block<br/>Auto-Check: Find your mistakes and challenge yourself or use auto-check to see your mistakes in real-time.<br/>Daily Change: Complete daily challenges and earn special trophies!<br/>Hint: Use the hints function when you are stuck.<br/> <br/>-Other additional functions-<br/> <br/>Game stats: There is a stats feature for each difficulty so that you can examine the game what played at any time. (Statistics can be reset).<br/>Unlimited Undo: Did you make a mistake? Get it back fast!<br/>Autosave: If you leave Sudoku incomplete, it will be saved. Keep playing anytime.<br/>Eraser: Eliminate all mistakes!<br/> <br/>Train your brain anytime and anywhere with the Sudoku - Brain game. If you like Sudoku, we welcome you. Come and try it out! Investing your spare time in Sudoku is very helpful for your mental health. Challenge yourself how quickly you can solve problems!<br/><br/>We always carefully check all reviews. Please leave your feedback on why you like this game or suggestions for improvements! Thank you and have fun with Sudoku Puzzle Game!<br/> <br/>Enjoy the best sodoku app for sodoku fans. If you are a lover for soduku game, you can download this suduku game app and begin your first sodoko play. We offer 4 difficulty modes and add 100 new sedoku puzzles every week. Download now and play sudoko and train your brain!<br/> <br/>Privacy policy: https://www.my-sudoku.com/policy.html<br/>Terms of use: https://www.my-sudoku.com/termsofservice.html", "metacritic": null, "released": "2020-02-05", "tba": false, "updated": "2020-12-14T02:39:20", "background_image": "https://media.rawg.io/media/screenshots/bb5/bb5fdaa4c11ad4ff3f221bf4327f36f9_Zk5EIIt.jpg", "website": "https://my-sudoku.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 40, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Guru Smart Holding"], "genres": ["Board Games", "Puzzle"], "publishers": ["Guru Smart Holding"], "esrb_rating": "Everyone 10+"}