{"id": 531085, "slug": "swim-or-drown", "name": "SWIM OR DROWN!", "name_original": "SWIM OR DROWN!", "description": "<p>The tropical oceans welcome you to <em>Swim or Drown</em>, a card game about luck and survival! You are buck naked in the middle of a tropical ocean filled with diverse and beautiful sea life, with no scuba or snorkel gear. You must do everything you can to not drown!</p>\n<p>Here is the link to the Playingcards.io game: https://playingcards.io/mstbwt</p>\n<p><strong>RULES</strong></p>\n<p>⇢This game is for 3 or more players, and a fish. The fish moderates the game, to make sure players aren't cheating.<br/> ⇢You and the other players are swimming in a warm, tropical ocean filled with diverse and beautiful sea life, with no scuba or snorkel gear. You must survive in the ocean as long as possible!</p>\n<p>There are <strong>cards</strong> and <strong>float tokens</strong>. Each player gets 5 of each at the beginning of the game!</p>\n<p>Float tokens are kind of like the number of lives you have, and cards are what each player puts down.</p>\n<p>Cards can be either <strong>number cards</strong> or <strong>wild cards</strong>. Number cards are either sink or swim, while wild cards can shake up the game. Keep a stack of facedown cards in the center.</p>\n\r\nExample of a number card: 3\r\n\r\nExample of a wild card: Octopus\r\n\n\r\n(image of the game in playingcards.io)\r\n\n<p>In the <strong>opening</strong>, the player that goes last will pick an opening card from the stack.<br/></p>\n<p> ⇢<strong>If the open card is odd, odds are swim and evens are </strong><strong>sink.</strong><br/> ⇢<strong>If the open card is even, evens are swim and odds are sink</strong><strong>.</strong><br/> ⇢<strong>If the open card is a wild card, that doesn’t count—you put it into the used play card stack and continue pulling open cards until you get a number card </strong>that is odd or even.</p>\n<p>Now the game starts!</p>\n<p>The player can place down a card from his/her deck and then draw another card, or the player can draw a card from the deck and must put it down.</p>\n<p>If a player puts down a swim card, the player gets +1 float tokens. If a player puts down a sink card, -1 float tokens.</p>\n<p>Wild cards are special. Here is the list of wild cards:</p>\n<p>Current: You can skip your turn! Handy for if you have a lot of sink cards.</p>\n<p>Ship's Wheel: Switch your deck of cards with that of another player.</p>\n<p>Reverse: This reverses sink and swim. If you play reverse, place it in the \"Reverse\" cardholder.  For example, if odds were swim and evens sink before the reverse, reverse makes evens swim and odds sink. Vice versa applies as well.</p>\n<p>Small Bait: If you pull this card at any time, you must tell the fish that you pulled a small bait. Put down the small bait and any punishing card.</p>\n<p>Big Bait: Same as small bait, except you must put down your worst punishing card.</p>\n<p>Bubbles: Keep this card until next turn. Forces you to draw from the stack next turn. If you pull another bubbles from the stack next turn, put both of them down and it is -3 float tokens!</p>\n<p>Fish: +1 float token!</p>\n<p>Sea Turtle: +2 float tokens!</p>\n<p>Dolphin: +3 float tokens!</p>\n<p>Whale: +5 float tokens!</p>\n<p>Seaweed: -1 float token.</p>\n<p>Octopus: -2 float tokens.</p>\n<p>Shark: -3 float tokens.</p>\n<p>Crocodile: -4 float tokens.</p>\n<p>A player drowns, aka is knocked out of the game, if he/she runs out of float tokens at any point in the game. The winner is the player who survives the longest!</p>\n<p><strong>Will you be saved by a school of fish, or swim with a kindhearted dolphin, or will you end up in the slimy belly of a shark or crocodile? It's up to you to play <em>Swim Or Drown </em>and say <em>blub glub blub </em>as you find out!</strong></p>", "metacritic": null, "released": "2020-12-13", "tba": false, "updated": "2020-12-14T04:43:50", "background_image": "https://media.rawg.io/media/screenshots/cff/cff70e15a6405f64710e8f88d70cb946.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Rishi Prasanna"], "genres": [], "publishers": [], "esrb_rating": null}