{"id": 531041, "slug": "disco-fitter", "name": "Disco Fitter", "name_original": "Disco Fitter", "description": "<p>Your goal is to collect as much currency (λ-credits) as possible during the game - just over 2 minutes of gameplay.</p>\n<p>You work as a mechanic right next to a Disco party in a futuristic world. Everything around permeates with rhythm, even the cyber-hands you're fixing. So in addition to picking the right tool for repair, you'll gain more style and therefore more λ-credits if you do it to the beat of the music and your surroundings.</p>\n<p><strong><br/>Controls<br/>Q W E R </strong>- Picking tools<br/><strong>Space</strong> - Catching Credits (if you follow the beat you'll get more)</p><p><strong>Sound<br/></strong>There is music - it just starts when you start gameplay :)<br/><br/><br/><strong>How to?<br/></strong>If you've read the above, you already understand the game - you don't need to read this big description below :)</p>\n<p>However if you want to know the details, here are they:<br/>First of all <strong>Rhythm is more important than being perfect</strong> - you get the lion's share of credits for even selecting a tool on time. However if you want the highest possible result you should try to choose the tool at the end of the bit - then the color of the cyber-hand is the brightest. Speaking of colors, there is also some currency for choosing the right tool (in the same color).<br/>In addition, after each cyber-hand (consisting of 4 repairs) you get a payment and here only the perfect \"catching\" (using the Space key) counts - this will increase its value.</p>\n<p>Okay, the long description behind there is still a specific list of \"how get λ-credits\":<br/>30 C - Tool selection itself (large time window)<br/>10 C - Color matching (Color can be changed if there is still time)<br/>10 C - Selecting the color only in the sweet spot (small time window)</p>\n<p>10 C - Award received for each hand<br/>30 C - Catching rewarn in sweet spot<br/><br/><strong>Game is from Game Jam<br/></strong>There are minor lacks :)<br/></p>", "metacritic": null, "released": "2020-12-13", "tba": false, "updated": "2020-12-14T04:34:59", "background_image": "https://media.rawg.io/media/screenshots/6c9/6c90eeb098a192cb0e960ca080c1de1d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 86, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ortuy", "Belfaust", "Juru111"], "genres": [], "publishers": [], "esrb_rating": null}