{"id": 531142, "slug": "funk-off", "name": "Funk Off", "name_original": "Funk Off", "description": "<p>You're a malware defender having normally a reaaaally bad time defending against all those malicious files attacking your computer owner, very indulgent in adult movie industry...<br/></p>\n<p>You apparently went \"full sentient mode\" and decided that if you're going to do it for eternity, you need to spice things up... or make them FFFUUNKYY!</p>\r\nObjective\r\n<p>Your goal is to survive as long as possible, with difficulty increasing with each successful takedown!</p>\n<p>There are 3 types of enemies:</p>\r\nNormie (adware) - quick, not so harmful to your hosts computer, but neutralizing it fast before it disappears is your best bet to get points! (10 btw)\r\n<p>Malicious Packet - slower, but immune to your attacks - the only two things you can do is to either dance around it or push it with your heuristic missile. If he's off the PC, you score 1 point!</p>\r\nRansomware - stoods there till the end of time, harming you in the process - when it becomes full red, it damages you. Take care as fast as possible or prepare for shield-fest! 20 points for that one!<br/>\n<p>You have 2 means of defending your system:</p>\r\n Shield - if you stop moving, you can take defensive stance, avoiding Ransomware attacks - it's risky though, so use carefully!\r\nNetbusters - data that can harm ransomwares and normies. Your main source of defense. It also helps repelling malicious packets!\r\n<p>Every 200 points scored, the difficulty rises! Watch out ;)</p>\r\nControls\r\n<p>WASD - Controlling your antivirus</p>\n<p>Arrows - Shooting in 4 directions</p>\n<p>Space - Shield</p>\n<p>Yes, you can move diagonally ;)</p>\n<p>(Psst, if you really want the true torrent PC experience, use Numpad1 few times - just dont overdo it!)</p>", "metacritic": null, "released": "2020-12-12", "tba": false, "updated": "2020-12-14T05:00:56", "background_image": "https://media.rawg.io/media/screenshots/515/515fa63488ab1da0692455e3eaedf29f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 22, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["VeSemiR"], "genres": ["Action"], "publishers": [], "esrb_rating": null}