{"id": 531294, "slug": "shield-hitting", "name": "Shield Hitting", "name_original": "Shield Hitting", "description": "<p>Welcome to this new brand challenging “Shield Hitting Game”, Your balloon is the most important thing that you have to protect from all the challenging obstacles. The game is simple but interesting ball and obstacles game, just aim and shoot at the obstacles to protect the balloon and let it rise up.<br/>Save your balloon as it rises high into the sky! Protect the balloon by hitting your defense against the obstacles. Allow the balloon to rise up by removing all the hurdles that can disturb your progress.<br/>Easily swipe your finger from left to right to protect the balloon. This game is very easy to play, but very hard to master! Only the best of the best will become the Balloon Protect master. Do you have what it takes to get the top score?<br/>One pro tip for you is to keep the shield to some distance from the balloon and easily deflect the obstacles but must keep in mind that you have to deflect them in a right direction to protect your balloon, umbrella or Hot Balloon.</p>\n<p><strong>Features:</strong><br/>• Easy to play, 1 finger game<br/>• 2 Unlocked objects (hot balloon and Umbrella)<br/>• Experience &amp; Conquer unique obstacles each game<br/>• Endless gameplay ( If you can protect the balloon )<br/>• Score will keep increasing as u progress.<br/>• Free to Play<br/>How to play<br/>• As the balloon rises you will need to use your shield to block the incoming obstacles that threaten the safety of the balloon you're trying to protect. Easily swipe your finger from the left to right to control the shield and protect the balloon. Push aside all of the obstacles and/or stack them to keep the balloon safe.</p>\n<p>• You are only allowed to swipe from left to right. This means that you will constantly need to protect the balloon from the obstacles as soon as they're about to hit. Going up &amp; down is not allowed because you always need to be right in front of your balloon, so that you can protect it!<br/>Move your shield with one finger to protect your balloon. Clear your way as you reach higher and higher!</p>\n<p>Shield control is very easy but it's very hard to reach high scores!<br/>If you find our Shield Hitting  – Balloon Game addictive, then you can give us your precious feedback in form of rating 🌟🌟🌟🌟🌟 along with your comments.</p>\n<p><strong>Privacy Policy</strong><br/>We built this app as an Open-Source app. This SERVICE is provided by at no cost and is intended for use as is.<br/>This page is used to inform visitors regarding my policies with the collection, use, and disclosure of Personal Information if anyone decided to use my Service.<br/>If you choose to use my Service, then you agree to the collection and use of information in relation to this policy. The Personal Information that I collect is used for providing and improving the Service. I will not use or share your information with anyone except as described in this Privacy Policy.<br/>The terms used in this Privacy Policy have the same meanings as in our Terms and Conditions, which is accessible at Warranty unless otherwise defined in this Privacy Policy.<br/>Information Collection and Use<br/>For a better experience, while using our Service, I may require you to provide us with certain personally identifiable information. The information that I request will be retained on your device and is not collected by me in any way.<br/>The app does use third-party services that may collect information used to identify you.<br/>Link to privacy policy of third-party service providers used by the app.<br/> <br/><strong>Contact Us</strong><br/>If you have any questions or suggestions about my Privacy Policy, do not hesitate to contact me at (ivanbaranasic33@gmail.com).</p>", "metacritic": null, "released": "2020-12-12", "tba": false, "updated": "2020-12-14T05:32:30", "background_image": "https://media.rawg.io/media/screenshots/7e2/7e2c6dd1dee8ba86bf8a1d8d17e7bf09.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 23, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Free Games And Fun"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}