{"id": 531231, "slug": "a-bugs-trip-redux-demo", "name": "A Bug's Trip Redux Demo", "name_original": "A Bug's Trip Redux Demo", "description": "<p>A Bug's Trip Redux is an extended version of A Bug's Lynx, edited by Songbird in the Redux collection :</p>\n<p>A Bug’s Trip Redux – Songbird Productions<br/></p>\n<p>It features the same levels, with improved gameplay, new songs.</p>\n<p>If you already know A Bug's Lynx and want to give a try to new gameplay before buying at Songbird, this demo release is for you. It features levels n° 2, 12, 22, 32 &amp; 42 from the game, and let you test the new control scheme.</p>\n\n\n<p>In A Bug’s Trip Redux, you play a young butterfly during its first year of life, exploring 40 gardens through the 4 seasons.</p>\n<p>Many traps await you, including other bugs lurking in the garden trying to catch you.</p>\n<p>Be wise and use all the gardens features and traps to your benefit. In order to go to the next garden, you must collect all the scattered pills. Collect flowers to earn more points, and enjoy life – a butterfly’s life is so short…</p>\n<p>The game cartridge saves your progress. Selection of the starting season is available once you have unlocked the corresponding season while playing. </p>\r\nSPRING\r\n<p>During Spring, the gardens are full of life. You’ll soon discover the gardeners had a wonderful idea – they installed rotating doors everywhere. \r\n</p>\n<p>You can use these mechanisms, but the bugs chasing you cannot. So, exploit the garden layouts for your profit – to hide yourself or to isolate nasty bugs.</p>\n<p>In some gardens, gardeners (who were probably hardcore retrogamers) put some nice exits, allowing you to travel from one side of the garden to the other. The bugs cannot follow you through these.</p>\r\nSUMMER\r\n<p>In Summer, the sun is blazing hot. Bushes will offer you a welcomed shadow and protection. Bugs will not dare to follow you under the bushes.</p>\n<p>So they offer you some rest, or an entrance to quieter zones.\r\n</p>\r\nAUTUMN\r\n<p>In Autumn, spiders come out to weave their webs. \r\nFortunately, you will not have to encounter these scary creatures, but their webs will slow you down, while they will have no effect on other bugs.</p>\r\nWINTER\r\n<p>In Winter, the cold sets in and ice forms on the paths of the gardens. As a butterfly, it won’t affect you, but crawling bugs will slide over ice and become much faster.</p>\n<p>Fortunately, once they start to slide, they cannot change direction and slide until the end of the ice, allowing you to dodge them if an exit is avalaible\r\n</p>\r\nCREDITS\r\n<p>Code : Fadest\r\nGraphism : Romuald &amp; Fadest\r\n(Ugly) Music / SFX : Carl Forhan / Fadest Additionnal ideas : Matmook, Romuald</p>\n<p>Made in C with BLL Kit (Lars Baumstark, Matthias Domin, Bastian Schick) and Chipper (Sage)</p>\n<p>Technical support : AtariAge and Yaronet Lynx developpers community</p>", "metacritic": null, "released": "2020-12-12", "tba": false, "updated": "2020-12-14T05:18:16", "background_image": "https://media.rawg.io/media/screenshots/c7c/c7cc276a6a83f90bd9a97279d638f4e1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 25, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Android"], "developers": ["Fadest"], "genres": [], "publishers": [], "esrb_rating": null}