{"id": 531540, "slug": "pc-creator-pc-building-simulator-itch", "name": "PC Creator - PC Building Simulator (itch)", "name_original": "PC Creator - PC Building Simulator (itch)", "description": "<p><strong>PC Creator - PC Building Simulator</strong><br/><br/><br/>The \"PC Creator\" is a simulator game, where you try yourself as a PC builder. You need to perform client's commissions with various requirements: to build a computer from the ground up, to mount the operating system's images, to update a computer, to install different programs, games, and much more.<br/><br/><br/>In addition to this, you have a special opportunity to create your mining farm to mine the cryptocurrency and to set up your own computer shop.<br/><br/><br/><strong>User-friendly interface</strong><br/><br/><br/>Despite the fact that our game has a lot of various functions, we made our best to develop a stylish, modern, and comfortable interface for managing all game's processes:<br/><br/><br/>★ animated controls<br/>★ useful tooltips<br/>★ user-friendly and plain positioning of buttons<br/>★ elements icons speak for itself<br/><br/><br/>All, mentioned above, you can see in the virtual world of the \"PC Creator\"!<br/><br/><br/><strong>Create your PC from the ground up</strong><br/><br/><br/>You can build the PC of your dream in our game. In the shop, you can choose and buy a motherboard, a processor, a video card, and other parts. Then you are about to install the operating system, drivers, favorite programs, and games. And all these you can do in the one app on your smartphone.<br/><br/><br/><strong>Wide choice of accessories</strong><br/><br/><br/>There are a lot of modern computer parts in the game: motherboards, processors, video cards, random access memory, power units for all tastes. Moreover, you can overclock these parts to the top and enjoy their productivity after this.<br/><br/><br/><strong>How to improve your service center</strong><br/><br/><br/>By finishing the client's commissions, you receive the experience points and the virtual coins. You can purchase a new room for your service center with earned money. Moreover, there is an opportunity to replace the equipment with a more powerful and modern one.<br/><br/><br/><strong>Learn how to improve your PC</strong><br/><br/><br/>You will learn how to fix up personal computers while playing our game, replacing parts with better ones. In addition to this, you will notice that not all parts comply with other ones of your PC. Our simulator will teach you, how to choose details correctly, in the case to make the most of your computer.<br/><br/><br/><strong>The opportunity of installing popular operating systems</strong><br/><br/><br/>\"PC Creator\" gives you an opportunity of installing popular operating systems: Linux, macOS, Windows. The рrocess of installing is very close to realistic, so it is a good time to learn how to install different OS.<br/><br/><br/><strong>Simulation of programs</strong><br/><br/><br/>There is the built-in PC simulator, with help of which you can install various programs, games and test them without leaving the game. To play your favorite games on your phone, what could be better?<br/><br/><br/><strong>Rating of the players</strong><br/><br/><br/>Our team has also devised and developed a system of rating all players over the world. So, in your cabinet, you can look at the best players by several parameters:<br/><br/><br/>★ reputation<br/>★ quantity and quality of finished commissions<br/>★ winnings in the wheel of fortune<br/><br/><br/>Your primacy won't have left unnoticed.<br/><br/><br/><strong>Community</strong><br/><br/><br/>Things don't work out? Ask for some pieces of advice in the official chat of the game, where players share their knowledge, experience, and just communicate with each other on various subjects. There are contests and promotions held in our game. You will be pleasantly surprised by them!</p>", "metacritic": null, "released": "2020-12-11", "tba": false, "updated": "2020-12-14T06:30:10", "background_image": "https://media.rawg.io/media/screenshots/4c0/4c06962c3d6976e060e33ee125e083b8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 108, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Unofficial MYKOLA NADTOKA"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}