{"id": 531586, "slug": "nemesis-awakening", "name": "Nemesis; Awakening", "name_original": "Nemesis; Awakening", "description": "<p>Betrayed by your countrymen.  Abandoned, pinned mockingly to an old Oak tree by the assassin's blade.  Left to rot for eternity...  Until a capricious forest spirit decides to imbue your smouldering rage with just enough magick to loosen the shackles of death, and offer you an opportunity to make manifest your revenge...  But what pale mockery of justice can be found here, in this dead and accursed land you'd been pulled back into?  Only skeletons tread here now, where there was once a lush forest teeming with life.  Nevertheless, the Fae urges you along the path, insisting that your destiny awaits you in the castle thronehall...<br/></p>\n<p>Nemesis; Awakening is an action-adventure VR game developed primarily targeting the Oculus platform, with support for Vive and Index.  As a player, you will cut your way through a dark and grim future, searching for answers to the questions surrounding your death, and discovering the role that it played in the fall of Man. <br/></p>\n<p>Open-World travel makes use of common VR locomotion options to maximize player's personal VR  comfort level. (User-configurable in the settings menu).  Players will have ample opportunity to run, slash, and climb their way through the this dying husk of a world.<br/></p>\n<p>Combat has a unique target-locked navigation method, that makes for some really interesting and dynamic VR battles, with a focus on well-placed and intentional blows to critical areas, well-timed dodges, and smart use of the terrain.  Health is represented by illumination cast from the player's lantern, which makes already tense moments even more harrowing. <br/></p>\n<p>Developed over a largely sleep-less week for entry into Epic's MegaJam2020.  Theme: \"It's been a long time, but we're not done yet.\"<br/></p>", "metacritic": null, "released": "2020-12-11", "tba": false, "updated": "2020-12-14T06:41:09", "background_image": "https://media.rawg.io/media/screenshots/2d9/2d95aede9eaf00f79d38423bc0ca1bc5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 63, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["code_Goblin"], "genres": ["Action", "Adventure"], "publishers": [], "esrb_rating": null}