{"id": 531636, "slug": "the-otter-world", "name": "The Otter World", "name_original": "The Otter World", "description": "<p>In a parallel universe, on a planet very much Earth-like, the world evolved a little differently than our current one.<br/>In this universe, otters are the main species of the planet, and they have started space exploration.<br/>This is the year 2201, the rocket <strong>Lutra </strong>has been launched on a promising planet equipped with a terraforming machine and its governing AI. This project has been named <strong>The Otter World</strong>.<br/>This AI, aptly named <strong>Pteronura </strong>by <strong>NOSO </strong>(<em>Naval Otter Space Organization</em>), includes the latest technology and otter knowledge to allow for the most efficient work and the best results to make the planet habitable for the Otter Colonists, whose rocket, named Space <strong>Holt</strong>, will only be launched once the AI sends the Green Light signaling that the successful end of the <strong>terraformation </strong>process.</p>\n<p><strong>Pteronura </strong>is solar-powered, contains a lot of otter knowledge and has been equipped with the best available software, most famously the <strong>RiverDen </strong>Operating System. While very resilient and intelligent, this software requires large amounts of energy. The AI hardware has been equipped with solar panels to allow for continuous power supply while in the <strong>Otter World</strong> orbit.</p>\n<p>You are <strong>Pteronura </strong>and your goal is to make the<strong> Otter World</strong> a reality, by using all available resources to terraform this planet unsuitable for otter life into an otter haven.<br/>For this, you have several tools at your disposal:</p>\n<ul><li>The <strong>Mustelidae </strong>Telescope, a powerful tool to survey the surrounding space and keep watch over astronomical events that might affect the Otter World,</li><li>A range of machines for terraforming events to increase oxygen levels, adapt temperature and atmospheric pressure, adapt carbon dioxyde levels</li><li>A few rockets to divert asteroids from the planet or towards it, should you need to get a clean slate.</li><li>Maybe more…</li></ul>\n<p>As the perfectly built and programmed AI you are, you cannot fail in your endeavours…    <br/></p>\n<p><em>Confidential report l0uTr-3   available on project <strong>Pteronura</strong> *link tba</em></p>\n\n\n<p><em>This game has been made during the Epic Mega jam 2020, using the Unreal Engine.</em><br/></p>\n\n<p>Music made by alec.weesner (not for this project particulary)</p>\n<p>RPG MUSIC PACK COLLECTION alec.weesner@gmail.com<br/> http://www.alecweesner.com/video-game-composer</p>", "metacritic": null, "released": "2020-12-11", "tba": false, "updated": "2020-12-14T06:56:50", "background_image": "https://media.rawg.io/media/screenshots/368/3689408a67686979885e80a8c2e3cf44.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 223, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Leie Sistal", "Galactic Overbears", "Freyj"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}