{"id": 531671, "slug": "the-slayer", "name": "The Slayer", "name_original": "The Slayer", "description": "<p>Plot: Long ago there was a warrior who was once called The Chosen One, fought the invaders from hell over 1, 000 years in the event of \"War of Hell\". When the chosen one defeated the Dark Master who is responsible  declaring the war, he was greatly wounded barely dead but he managed to survive, the doctors can't treat his wound because of the great beyond of their skills and he was instead put in hibernate sleep. In present time, the secret expedition found his  shrine where he was still sleeping in the unknown location somewhere in Europe. Soon he was finally awaken and now he see what is now living in the cave and finds the corpse in front of him with sword and a pistol.</p>\n<p>This is my first time uploading my very own game to the public in Itch and very excited to share this to everyone, the game was made in Unreal and it isn't the final. Right now I'm only sharing in Demo version so I'll continue to work on it, the full-version I wouldn't say it in 2021 but that depends on my own life. </p>\n<p>If you want the game to be complete than here's what you can do!</p>\n<p>Donate it for this game and maybe I'll get it to work and get everything ready as the full version right now I'm going to do whatever I can to make the game look good.</p>\n<p>So again, this is a Demo and does not represent as final everything will likely to change depending on the progress</p>\n<p>Disk Space: 10.70 gbs</p>\n<p>Note: Ray trace is enabled. </p>", "metacritic": null, "released": "2020-12-11", "tba": false, "updated": "2020-12-14T07:08:15", "background_image": "https://media.rawg.io/media/screenshots/8bf/8bf975b4b7df2832da69033756991a72.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 134, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["erick_guerrero2000"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}