{"id": 53171, "slug": "bubble-bobble-1986", "name": "Bubble Bobble (1986)", "name_original": "Bubble Bobble (1986)", "description": "<p>Bubble Bobble (バブルボブル, Baburu Boburu) is an comical action platformer video game by Taito, first released in arcades in 1986 and later ported to home systems. The game, starring the twin Bubble Dragons Bub and Bob, tasks players with travelling through one hundred stages, blowing and bursting bubbles, jumping on and off blown bubbles to navigate level obstacles, dodging and eliminating enemies, and collecting a variety of items including some that carry power-ups and significant bonuses. For example, some wrapped candies allow Bub and Bob to move faster, blow bubbles faster, and blow bubbles at greater distances. Other items, such as umbrellas, allow to skip numerous levels, moving closer to the final level. The game became popular and led to a long series of sequels and spin-offs. The main goal of the game is to rescue Bub and Bob's girlfriends from the Cave of Monsters. The game has multiple endings, which depend on the player's performance and discovery of secrets.</p>\n<p>The creator of Bubble Bobble Fukio Mitsuji (MTJ) went on to create other games such as Rainbow Islands, Syvalion and Volfied. He died on December 11, 2008.</p>", "metacritic": null, "released": "1986-01-01", "tba": false, "updated": "2024-04-01T03:32:56", "background_image": "https://media.rawg.io/media/screenshots/2a5/2a5404773ab69671bb6585cd46dd0a97.jpg", "website": "", "rating": 4.23, "rating_top": 4, "added_by_status": {"yet": 9, "owned": 45, "beaten": 33, "toplay": 11, "dropped": 27, "playing": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 52, "suggestions_count": 209, "game_series_count": 16, "reviews_count": 52, "platforms": ["Nintendo 3DS", "Atari ST", "PlayStation 4", "Wii", "NES", "SEGA Master System", "Game Gear", "Apple II", "Game Boy", "PC", "Game Boy Advance", "Wii U", "Commodore / Amiga"], "developers": ["Taito"], "genres": [], "publishers": ["Taito", "Romstar"], "esrb_rating": null}