{"id": 53223, "slug": "shin-megami-tensei-devil-children", "name": "Shin Megami Tensei: Devil Children", "name_original": "Shin Megami Tensei: Devil Children", "description": "<p>Shin Megami Tensei: Devil Children, also known as DemiKids, is a series of role-playing video games primarily developed by Multimedia Intelligence Transfer and published by Atlus. It is a spin-off from Atlus&#39; Megami Tensei franchise, and began in 2000 with the Game Boy Color games Black Book and Red Book. Five more role-playing games and three games in other genres were released until 2004, followed by no new releases until the 2011 social game Shin Megami Tensei: Devil Children. In addition to the games, the series has been adapted into manga, anime, and a trading card game, and two soundtrack albums have been released by First Smile Entertainment.<br />\nThe series follows demon-human hybrids called devil children, who journey from Japan to the demon world, and are joined by talking companion monsters who give them guidance. The player takes the role of one such devil child, and battles against demons; the devil children do not fight directly themselves, however, but have allied demons in their party fight for them. The player can choose to talk to demons instead of fighting them, to try to make them join the player&#39;s party, and can increase their allied demons&#39; power by fusing multiple demons with each other.<br />\nWhile Multimedia Intelligence Transfer developed most of the games in the series, Enterbrain and Index Corporation also developed one game each. The music for the first two games was composed by Tomoyuki Hamada, who made use of both orchestral music and rock. Yuji Himukai, known for his work on the Etrian Odyssey series, worked as character designer and illustrator on the 2011 game, creating new art for returning characters. The series received a wide range of reviews, from negative to positive. Reviewers enjoyed the demon fusion, while the music and visuals were criticized.</p>", "metacritic": null, "released": "2000-11-17", "tba": false, "updated": "2022-03-20T15:24:44", "background_image": "https://media.rawg.io/media/screenshots/bd5/bd551d1f2ae4b58a9c03905286546ac1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 2, "beaten": 2, "toplay": 6}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 339, "game_series_count": 33, "reviews_count": 1, "platforms": ["Game Boy Color", "Game Boy Advance"], "developers": ["Index", "Enterbrain"], "genres": ["RPG", "Puzzle"], "publishers": ["Atlus"], "esrb_rating": null}