{"id": 532399, "slug": "fantasy-tavern-sextet-vol1-new-world-days", "name": "Fantasy Tavern Sextet -Vol.1 New World Days", "name_original": "Fantasy Tavern Sextet -Vol.1 New World Days", "description": "It is an adventure game where you can enjoy a slapstick love harem play with laughter, tears, and a little H in a bar in a different world.<br/><br/>The \"E-mote\" engine that can move illustrations smoothly and three-dimensionally is used for standing pictures in the game.<br/>The characters displayed on the screen move as if they were alive.<h3>STORY</h3>One day without warning, a young cook working behind the scenes at an Akihabara maid cafe suddenly gets spirited away to another world!<br/>The new world he finds himself in is one of fantasy, where magic exists and monsters run wild.<br/><br/>Without a way to return to his own world and at a total loss, a monster appears out of nowhere and is about to attack him when, at the last moment, Lupine, the owner of the tavern \"Stray Sheep\" appears and saves his life.<br/><br/>Brought to \"The Stray Sheep\" by his lifesaver Lupine, he finds nothing but a sad empty tavern with not even a single customer.<br/><br/>With nowhere to go, the main character decides to aid Lupine in reviving The Stray Sheep, knowing that if enough adventurers come by, one of them may know a way for him to return home.<br/><br/>Utilizing the cooking skills he cultivated during his time in the maid cafe, can he be the one to save the tavern from its precarious management situation?!<br/>You'll laugh! You'll cry! Set against the backdrop of a fantasy world's tavern, this slightly naughty, slapstick love-harem drama is about to begin!<h3>CHARACTER</h3><br/><strong>Lupine</strong><br/>CV:Rin Mitaka<br/><br/>Lupine is the female owner of the tavern where adventurers gather, a place known as \"The Stray Sheep\".<br/>Following her father's wishes, Lupine suceeded him as owner after his death.<br/><br/>She likes caring after others to the point of being a bit overbearing.<br/>This caring nature of hers has won the hearts of her neighbors, who love her dearly.<br/><br/>Lupine works hard everyday to liven up the tavern left behind by her father, and fill it with adventurers, just like in the old days.<br/><br/>Even the adventurers there are no match for her in strength when it comes to handling drunk and troublesome guests. <br/>She even has the power to send monsters flying. On the other hand, she is a catastrophe when it comes to cooking.<br/>Unfortunately, her cooking has caused guests to stay away...<br/><br/><br/><strong>Daisy</strong><br/>CV:Mochi Morisawa <br/><br/>\"Daisy runs The Stray Sheep, along with Lupine.<br/><br/>After being saved by Lupine from a certain situation, she became one of the staff at The Stray Sheep, adoring Lupine like an older sister.<br/><br/>Seized by jealousy at seeing the main character grow close to Lupine, she plots how to get rid of him.\"<h3>Feature</h3><br/>・Smooth character animation via the E-mote system<br/>・Different  routes and ED<br/>・High quality event CG<br/>・Story set in an actual Japanese town<h3>STAFF</h3><br/>・Illustration               :WaonInui<br/>・Scenario                  :Linkedbrain Inc.<br/>・Producer/Planner    :Yujiro Usuda", "metacritic": null, "released": "2020-12-14", "tba": false, "updated": "2023-05-27T21:25:32", "background_image": "https://media.rawg.io/media/screenshots/b8f/b8fefb909a13eb8bb852589d54a4000e.jpg", "website": "https://qureate.net/fantasy_tavern_sextet/en/vol1/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 20, "beaten": 1, "toplay": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 468, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["qureate", "iMel"], "genres": ["Adventure", "Indie"], "publishers": ["qureate"], "esrb_rating": null}