{"id": 532387, "slug": "hustomten", "name": "Hustomten", "name_original": "Hustomten", "description": "<h3>'Twas the night before Christmas...</h3><br/>We have all heard the story of Santa Claus. But have you heard the one about the hustomte? Most homes have one and certainly all farms have at least one farm elf. They look like a small person with a long beard and pointy hat and live under your floor or in the attic and other nooks and crannies. The hustomte helps to protect your home from evil and misfortune and tends to the farm’s animals, as long as you remember to put out snacks.<br/>However, if you don’t, bad things will happen... <br/><br/>Will you be able to bring enough snacks for Hustomten before midnight of Christmas Eve?<h3>Features</h3><ul><li>Before the night starts, the \"Wheel of Snacks\" is spun to indicate what snack Hustomten likes the most.<br/></li><li>Explore the house to find snacks randomly strewn across the floor, and then drop them off at the drop-off spots.<br/></li><li>Keep the satisfaction meter from draining—or else it's game over.<br/></li><li>Collect snacks faster to gain additional bonus score.<br/></li><li>Have you collected enough snacks to place on the global leader boards?<br/></li><li>Remember to keep your distance—Hustomten doesn't like when you get too close.<br/></li><li>Keep an eye out for Lucky Charms, as they will give you a brief moment of protection.</li></ul><h3>Beware of snack stealing rats!</h3>", "metacritic": null, "released": "2020-12-14", "tba": false, "updated": "2020-12-18T02:37:50", "background_image": "https://media.rawg.io/media/screenshots/a40/a403ed9d2f5ffef34e63727d1f33afab.jpg", "website": "https://www.blackcurtainstudio.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 193, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Black Curtain Studio"], "genres": ["Action", "Indie"], "publishers": ["Black Curtain Studio"], "esrb_rating": null}