{"id": 532313, "slug": "taxi-sim-2020", "name": "Taxi Sim 2020", "name_original": "Taxi Sim 2020", "description": "Experience the life of a taxi driver in our latest taxi simulator game. Complete different types of driving missions as a taxi or private taxi driver and pick your favorite car from a selection of over 30 amazing vehicles, with more new cars being added weekly.\n\nNavigate around huge cities like New York, Miami, Rome or Los Angeles and adjust your driving style to different types of clients - some are in a hurry and don’t care if you run a red light, while others are terrified of dangerous driving.\n\nWe take taxi simulation games to a new level with VIP clients, undecided clients and various types of daily and lifetime milestones.\n\nStart your taxi driving career with regular cars and work your way up to SUVs, luxury cars, sports cars and supercars. Buy better cars to be able to pick up VIP clients and to earn more for each mission. Each car you buy can be played both in taxi and private taxi mode.\n\nEnjoy the stunning graphics and environments in this open-world driving experience. We’ve added features you won’t find in any other taxi simulation games: pedestrians open umbrellas when it rains, there are hundreds of destructible objects, there is a realistic density of cars and people on the sidewalk. Feel like an actual taxi driver with realistic controls and sounds!\n\nWork your way up to the top in the Career mode, drive around and relax in Free Roam.\n\nFeatures\n\n◾ Amazing selection of different types of vehicles\n◾ Huge cities to explore\n◾ Realistic Controls (tilt steering, buttons or virtual steering wheel)\n◾ 2020 updated engine sounds\n◾ Realistic vehicle features (you car will get dirty or require repairs)\n◾ Visual Tuning options\n◾ Spectacular environments and weather\n◾ Realistic city traffic (cars, vans, trucks, motorcycles, bicycles)\n◾ Diverse and realistic pedestrian traffic\n◾ Career, Free Roam and Multiplayer modes\n◾ New cars and challenges added weekly\n◾ Request new vehicles or features on our Social Pages!", "metacritic": null, "released": "2020-06-03", "tba": false, "updated": "2020-12-16T15:19:02", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 1, "platforms": ["Nintendo Switch"], "developers": ["OviLex Soft"], "genres": [], "publishers": ["SC Ovilex Soft"], "esrb_rating": "Everyone 10+"}