{"id": 532480, "slug": "lamp-chronicle", "name": "Lamp Chronicle", "name_original": "Lamp Chronicle", "description": "The evil energy of darkness spread around the world, resulting many lives in the kingdom losing their memories or being turned into monsters.<br/>On the night of the fall of the kingdom, the princess, who fought the darkness, had to hide a lamp of light, which was the treasure of the kingdom that possessed a mysterious power. During this chaotic fight, the princess's friend Luca happened to took over the lamp and managed to escape the Kingdom. He heals his wounds near his hometown and goes on an adventure to save the kingdom. Can Luka, still a flimsy knight trainee, become the true owner of the lamp, drive out the darkness and find the missing princess? His long and dangerous journey, full of monsters, is challenging.<br/><br/><h3>Lamp Chronicle is a 2D side-scrolling action platformer game that combines weapons-based melee attacks and magic skills to face unique monsters.</h3><br/><br/><ul><li>Explore various areas of the kingdom of Lifenia that have been fallen by the darkness.</li><li>Each and every one of the backgrounds, characters, and monsters are hand painted to present them beautifully and to add depth of emotion.</li><li>No complicated combos, thus the game is intuitive and you can immediately start playing.</li><li>You grow stronger by finding various hidden weapons, items, and skills.</li><li>As more abilities such as dash and double jump are added, you can enjoy more exciting battles and escape traps.</li><li>Trade helpful items through several shops you visit in the middle of your expedition.</li><li>You will encounter fierce middle bosses and huge stage bosses.</li></ul><br/>", "metacritic": null, "released": null, "tba": false, "updated": "2020-12-18T03:37:02", "background_image": "https://media.rawg.io/media/screenshots/ee3/ee3f8c12c5032087d837feba4a0fae70.jpg", "website": "http://www.pixellicagames.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 4, "toplay": 4, "dropped": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 498, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Pixellica"], "genres": ["Action", "Adventure", "RPG", "Casual", "Indie"], "publishers": ["Pixellica"], "esrb_rating": null}