{"id": 532410, "slug": "jiu-ge-shi-jie-nine-worlds", "name": "九个世界（Nine worlds）", "name_original": "九个世界（Nine worlds）", "description": "In a parallel earth world with players, the earth is invaded by alien races, and the earth humans who failed to resist it die in a large number of oppression and resistance. The soul of the dead becomes the daily food soul of the alien race, and the corpse is transformed into slaves. Because of their unyielding spirit, some human beings have resisted the transformation process and become artifacts falling all over the world.<br/>\n<br/>\r\nThe four great magicians and the most powerful craftsmen of human beings moved nine islands together to establish a lonely world to protect the last batch of human beings. Although those alien races claim to be superior, they have no way to break the boundary of the lonely world. They send slave legions to hunt and kill the weak human beings. They use banter like means against the powerful individuals to pull them into the Heterodimensional space. Although a few people have survived from the alien space, after a long time, there are not many human beings left, but there are no four great magicians Nai went out of the border to resist, and they failed.<br/>\n<br/>\r\nNow the lonely world welcomes you!!!<br/>\n<br/>\r\nIn this sandbox world, you can choose a character you like, freely search for artifacts that fall all over the world, kill all kinds of monsters, enhance yourself, challenge various boss, gain control of islands in lonely world, and open the entrance to the next world.<br/>\n<br/>\r\nThe game is designed as chapter mode, that is, the game can only enjoy the content of the lonely world.<br/>\n<br/>\r\nGame bug feedback and communication QQgroup: 1159870896", "metacritic": null, "released": "2020-12-14", "tba": false, "updated": "2020-12-18T02:55:55", "background_image": "https://media.rawg.io/media/screenshots/2fe/2feae4540599da1aaacfabd479c6503b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 392, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["登"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Indie"], "publishers": ["登"], "esrb_rating": null}