{"id": 532539, "slug": "opultimate-battle", "name": "OP:Ultimate Battle", "name_original": "OP:Ultimate Battle", "description": "“Dreams never die.”<br/>“If you’re lost inside, just go clear your mind.”<br/>“I wasn’t born a King, but I was born to never know how to give in.”<br/>....<br/><br/>A 2020 special, a tribute to the younger days, an homage to a classic: OP: Ultimate Battle—a strategy RPG game. All the moving stories straight out of the manga, exciting turn-based battles, endless ways to build your dream crew, plus sea warfare and cross-server battles, create a fantastic world of adventures!<br/><br/>====Features====<br/><br/>【The Straw Hat’s Dream】<br/>Set sail to explore the seas and find nakamas along the way. Out of all the best OP characters, who will be your crewmates? Begin your voyage to become the Pirate King!<br/><br/>【Promise of Three Swords】<br/>Realtime cross-server PvP clashes, unlimited Combos, and skills reproducing the amazing anime visuals, generate sensational battles on your screen!<br/><br/>【The Lier’s Slingshot】<br/>New gameplay, new adventures! Besides the classic campaign, Dock, Characters Bios, Long Ring Long Land, Impel Down and Monster’s Challenge are waiting for you with amazing rewards!<br/><br/>【Miracles under the Sakura】<br/>Massive gold and diamond rewards, and rums that recruit nakamas for you, and great resources giveaway! Develop your crew and become the Pirate King!<br/><br/>The age of great pirates is here again. Embrace the adventures and find the OP! <br/><br/>[Tips]<br/>If you have any problems in the game or if you want to offer suggestions, please contact our guest staff at any time!<br/><br/>Contact us: <br/>※ Official Email: support@opultimatebattle.com<br/>※ Terms of Service: https://opultimatebattle.com/ob_terms.html<br/>※ Privacy Policy: https://opultimatebattle.com/ob_privacy_policy.html", "metacritic": null, "released": "2020-09-11", "tba": false, "updated": "2020-12-18T04:16:51", "background_image": "https://media.rawg.io/media/screenshots/93d/93d1caaa1fee0483cb932762aec7f73f_RuxJhE8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 227, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Shanghai Bodao Chemistry Technology Co"], "genres": ["RPG", "Card"], "publishers": ["Shanghai Bodao Chemistry Technology Co"], "esrb_rating": "Teen"}