{"id": 532548, "slug": "marvel-realm-of-champions", "name": "MARVEL Realm of Champions", "name_original": "MARVEL Realm of Champions", "description": "Experience a bold new imagining of the Marvel Universe and uncover the secrets of the mysterious new planet known only as Battleworld. <br/><br/>Long ago, Maestro, an evil version of the Hulk from an alternate future, forced shattered realities together to construct his own Battleworld. He ruled over these merged, alternate timelines filled with Gods and Warriors alike until he was secretly slain! With his iron grip no longer holding this world together, it has descended even deeper into disarray. Barons have risen to control their lands, looking to turn the tide of war in their favor. As this Secret War begins, it is up to YOU brave Summoner to solve the mysteries of Battleworld and take your true place as a powerful Champion! <br/><br/>Customize your own ultimate Marvel Champion with weapons and gear, then team up with your network of friends in real-time high-action brawls. Play your part in an epic war of planetary proportions as you rise from a rookie Champion to become a legendary hero of THE BATTLEWORLD!<br/><br/>YOUR CHAMPION. YOUR WAY.<br/><br/>•Customize Your Champion - The only Marvel game where you can become your favorite Champion and customize them to reflect both your personality and battle style.<br/><br/>•Enhance Your Champion - Earn gear and upgrades as you brawl through the mayhem. Gear and weapons will add to your Champions’ abilities and strength. The more powerful your Champion becomes, the more successful you will be. The possibilities and combinations are endless!<br/><br/>•Play the Perfect Role - Tank with your Hulk and soak up hits while you attack hard with area disruption. Bring your Black Panther to excel in single combat at close range and inflict devastating damage. Annihilate the competition using high-powered ranged attacks with your Web Warrior and Iron Legionnaire. Amplify your allies with your Storm and Sorcerer Supreme to deal bursts of damage and vanquish entire groups of foes.<br/><br/>EXPERIENCE BATTLEWORLD<br/><br/>•Immerse Yourself in a New Marvel Universe - Marvel authenticity with a twist! Experience the deep story of Battleworld, full of mystery, intrigue, and ferocious battles with characters from across Marvel history.<br/><br/>•Marvel Inspired Battle Arenas - Fight in the barbarian wastelands of the Hulk Gamma Horde, high-tech cityscapes composed of Iron Man’s Stark Tech, astounding Asgardian arenas worthy of the greatest battles, and much more! <br/><br/>•A Visually Stunning World - Witness awe-inspiring graphics and representations of iconic Marvel characters, battle arenas, and spectacular special moves.<br/><br/>EPIC REAL-TIME MULTIPLAYER BRAWLS<br/><br/>•Lead Your Team to Victory -  Strategize with your team to select the right mix of three Champions to dominate over the competition in action-packed team battles!<br/><br/>•Reign Supreme in Arena Conquest -  Engage in real-time 3v3 team brawls! Takedown the opposing team’s Baron and claim your victory!<br/><br/>•Defend Your Ground in Stronghold - Team up and battle waves of enemies to protect your ISO Core.<br/><br/>Join the intense, team-based multiplayer action and put your Champion to the test in action-packed brawls where skill and strategy will earn you a place among LEGENDS! <br/><br/>MAKE MARVEL YOURS! Your Champion. Your Team. Your Realm.<br/><br/>DOWNLOAD MARVEL REALM OF CHAMPIONS NOW!<br/><br/>Subscribe on YouTube: www.youtube.com/MarvelRealmofChampions<br/>Like us on Facebook: www.facebook.com/MarvelRealmofChampions<br/>Follow us on Instagram: www.instagram.com/MarvelRealmofChampions <br/>Follow us on Twitter: www.twitter.com/MarvelRealm <br/>Learn more at: www.playmroc.com <br/><br/>TERMS OF SERVICE:<br/>Please read this Terms of Service Agreement and our Privacy Notice before using our services as they govern the relationship between you and Kabam.<br/><br/>www.kabam.com/terms-of-service/ <br/>www.kabam.com/privacy-notice/", "metacritic": null, "released": "2020-12-15", "tba": false, "updated": "2020-12-18T04:20:42", "background_image": "https://media.rawg.io/media/screenshots/9ad/9ad9ffd971463d7c887eaa969f6051f6_RGMVQrH.jpg", "website": "https://kabam.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 192, "game_series_count": 31, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Kabam Games"], "genres": ["Action", "RPG"], "publishers": ["Kabam Games"], "esrb_rating": "Teen"}