{"id": 532615, "slug": "nova-star", "name": "Nova Star", "name_original": "Nova Star", "description": "<p>Protect your galaxy from outside invaders in this exhilarating space shooter! If you love throwback arcade style galaxy shooter games, you will love this modern take on the genre! The concept is simple: using lighting-fast reflexes, and a fully upgrade-able weapons system, dodge and battle your way though   your enemies to DEFEND YOUR WORLD!<br/></p>\n<p><strong>Nova Star is an action packed game stacked with features! </strong><strong>   </strong><br/></p>\n<ul><li>Battle through 15+ unique waves!</li><li>An array of unique enemies with varying attack patterns! </li><li>Collect power ups to upgrade your on-board weapon systems.  How many? You'll have to find out.</li><li> Challenging game play! Salt not included.</li><li> Multiple boss battles await, your world needs you!</li><li> Game accompanied by upbeat tracks and audio!</li><li>Beautifully rendered graphics, and effects!  </li></ul>\n<p><strong>Game Instructions and Controls:</strong></p>\n<ul><li>Use WASD Keys to control your space fighter!</li><li>Space bar will employ your weapons systems.</li><li>Power ups will be rewarded from destroyed enemies and occasionally throughout game play.  Collect them to upgrade your weapons systems, and repair your fighter.</li><li>Escape key will pause the game, allowing you to adjust options and navigate the menus.</li><li>Checkpoints will be unlocked as you fight through certain waves, look for the checkpoint system on the left side of the screen to have another chance to save the galaxy!</li><li><strong>For the best gaming experience, please play in full screen mode!</strong></li></ul>\n<p><strong><strong><strong><strong><strong><strong><strong><strong><em>This game may be developed with future updates, our team welcomes all comments and feedback!  We appreciate you playing our game and hope you enjoy it!</em></strong></strong></strong></strong></strong></strong></strong></strong></p>", "metacritic": null, "released": "2020-12-17", "tba": false, "updated": "2020-12-18T04:36:36", "background_image": "https://media.rawg.io/media/screenshots/49c/49cc49f8b876ad60cc397e6af0046c8d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 259, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["GameDevHQ"], "genres": ["Action"], "publishers": [], "esrb_rating": null}