{"id": 532703, "slug": "inmost-itch", "name": "INMOST (itch)", "name_original": "INMOST (itch)", "description": "Something is lurking in the shadows...\r\n<p>INMOST, by Lithuania-based indie studio <strong>Hidden Layer Games</strong>, is an emotional and deeply atmospheric narrative-driven puzzle platformer.</p>\n<p>Explore a crumbling, nightmarish landscape, slice through enemies, and spring deadly traps in order to escape the evil that awaits…<br/><br/><em>**INMOST is an intimate story of loss and hope that some may find upsetting. Player discretion is advised.**</em></p>\n\n\n<ul><li>Venture through a hauntingly atmospheric pixel art world</li><li>3 main characters, each with their own unique gameplay styles</li><li>A knight adventures into the depths of a deteriorating castle. A child uncovers the past of an eerie house. A wanderer searches for answers.</li><li>Lure enemies into lethal traps, solve environmental puzzles and utilise your scythe, hookshot and pickaxe to avoid a gruesome end!</li><li>Discover a 3-5 hour emotional story, intended to be played in a single-sitting on a dark, stormy night</li><li>Explore every nook and cranny to find secret passages and collectibles</li><li>Featuring the vocal talents of Andrew Dennis and Cassandra Lee Morris</li><li>Playable in 14 languages, including English, French, German, Russian, Spanish, Italian, Arabic, Dutch, Japanese, Korean, Brazilian Portuguese, Turkish, Simplified and Traditional Chinese</li><li>Each pixel is placed with love!</li><li>Features CORSAIR iCUE RGB dynamic lighting functionality for PC</li></ul>", "metacritic": null, "released": "2020-12-17", "tba": false, "updated": "2020-12-18T04:57:17", "background_image": "https://media.rawg.io/media/screenshots/ddd/ddd029884a879aec57ad06280cf62722.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 253, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Chucklefish Games"], "genres": ["Adventure", "Platformer"], "publishers": [], "esrb_rating": null}