{"id": 532874, "slug": "tribalism-digital-edition", "name": "Tribalism (Digital edition)", "name_original": "Tribalism (Digital edition)", "description": "<p><em>\"How could you betray me right before an Ice Age?! I'm your dad!\"- my Dad</em></p>\n<p><em>\"Did you really just raid me because I betrayed you before? Way to hold a grudge...\" - Jonathan Xu </em></p>\n<p><em>\"Wow! I never knew raiding a tribe of my friends could be so much fun without  the bloodshed!\" - Andrew Shao </em></p>\n<p>__________________________________________________________</p>\n<p>Tribalism is a 5-8 player game, taking anywhere from 15 - 40 mins,  in which players form tribes to survive events as well as sabotage from other tribes. Each player is designated a role --hunter or gatherer-- that allows them special traits to be used throughout the game. They both have strengths, and weaknesses, and when facing events as a tribe its necessary to have both roles in order to survive. </p>\n<p>Don't be fooled by your tribe's initial kindness though. Betrayal can happen at any moment, and in some situations can lead to the downfall of multiple players. While on the surface gathering resources and surviving events with your tribe may seem like all that's needed to survive the events, the social skills needed to navigate the landscape of the game after a couple betrayals may be your way to victory. </p>\n<p>Tribalism was initially created due to an interest in the social dynamics of early human civilizations. While it may not be a wholly accurate representation of the social dynamics during early human history, the twists and turns you'll face when coming up to an event may offer a mix of frustration, or satisfaction if your cards are played right. </p>\n<p>Think you can outsmart your friends and survive an ice age or two? Play now here!</p>", "metacritic": null, "released": "2020-12-11", "tba": false, "updated": "2020-12-18T05:33:07", "background_image": "https://media.rawg.io/media/screenshots/64f/64f4fb619f28fcf1c9ec46472e6ca475.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 103, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["kchacko"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}