{"id": 532950, "slug": "rai", "name": "Rai", "name_original": "Rai", "description": "<p><strong>English</strong></p>\n<p>The Opa continent suffers rains that seem to have no end. Its inhabitants are desperate, the crops wither, the streets and buildings are flooded ... knowing that, if they do not act quickly, they will die by drowning.</p>\n<p>For this reason, the heroine Rai, from the Alfárbores tribe, agrees to enter unknown and threatening environments, which she will have to overcome to reach La Laguna, with the aim of convincing the god Kelpie to put an end to the catastrophe atmospheric that he himself has caused.</p>\n\n<p><strong>Galego</strong><br/></p>\n\n<p>O continente Opa sofre unhas choivas que non parecen ter fin. Os seus habitantes están desesperados, as colleitas marchítanse, as rúas e edificios asoláganse... sendo conscientes de que, se non actúan rápido, morrerán afogados.</p>\n<p>Por iso, a heroína Rai, da tribo dos  Alfárbores, comprométese a penetrarse en contornas descoñecidas e ameazantes, que terá que superar para chegar á Lagoa, co obxectivo de convencer ao deus  Kelpie de que poña fin á catástrofe atmosférica que el mesmo provocou.</p>\n\n<p><strong>Español</strong></p>\n\n\n<p>El continente Opa sufre unas lluvias que no parecen tener fin. Sus habitantes están desesperados, las cosechas se marchitan, las calles y edificios se inundan...siendo conscientes de que, si no actúan rápido, morirán ahogados.<br/></p>\n<p>Por ello, la heroína Rai, de la tribu de los Alfárbores, se compromete a adentrarse en entornos desconocidos y amenazantes, que tendrá que superar para llegar a La Laguna, con el objetivo de convencer al dios Kelpie de que ponga fin a la catástrofe atmosférica que él mismo ha provocado.</p>", "metacritic": null, "released": "2020-12-16", "tba": false, "updated": "2020-12-18T05:52:30", "background_image": "https://media.rawg.io/media/screenshots/670/67024ca5062510a7b971bebbd4cf7c68.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 152, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["WoodGamesDEV"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}