{"id": 533015, "slug": "mayhem-itch-bitl-development-studio", "name": "MAYHEM (itch) (Bitl Development Studio)", "name_original": "MAYHEM (itch) (Bitl Development Studio)", "description": "<p>Description:</p>\n<p>This game is a horde-mode top down shooter where you and a friend must take down hordes of robots, aliens, zombies, and a giant UFO at the end.<br/>This first started off as a single-player platform shooter, but I had issues with platform collisions and I realized that it would have taken way too much time to make as this was a college project built within 2 weeks.<br/>This game was built entiely from scratch, with the exception of the the sprite engine.<br/>The sprite engine was modified from the gameEngine.py from Andy Harris for use in my custom-made engine. (https://www.cs.iupui.edu/~ajharris/pygame/ch10/gameEngine.py)</p>\n<p>Features:</p>\n<p>- AI enemies that track down a target (the players) and stand a certain distance away from them to shoot. 3 different types!<br/>- 2 player system. One relying on a keyboard and another relying on a game controller. The second player can also use an alternate keyboard control scheme if there's no controller detected.<br/>- Wave system that spawns more enemies difficult over time.<br/>- Regenerating health!<br/>- Supports an unlocked frame rate!<br/>- Option of 8-way or 360 degree aiming system! (for second player)</p>\n<p>Source Code:<br/></p>\n<p>https://github.com/BitlDevelopmentStudios/MAYHEM<br/><br/>Report bugs here:</p><p>https://github.com/BitlDevelopmentStudios/MAYHEM/issues</p>\n<p>Controls:</p>\n<p>- Player 1: <br/>Movement: W for moving forward, S for moving backwards, A for moving to the left, D for moving to the right.<br/>Combat: Move the crosshair around with the mouse to aim, and press the left mouse button to fire.<br/>- Player 2: <br/>-- With a controller (tested on an XBOX ONE gamepad): <br/>Movement: Move with the left joystick or the D-Pad<br/>Combat: Right Joystick to use 360 degree aiming, ABXY to aim with 8-way controls, Right Trigger or Right Bumper to fire.<br/>-- Without a controller: <br/>Movement: Up Arrow for moving forward, Down Arrow for moving backwards, Left Arrow for moving to the left, Right Arrow for moving to the right.<br/>Combat: Press Right CTRL to fire, then use the movement keys to aim in any direction (8-way controls). Pressing Right CTRL will also stop you from moving, making aiming easier.</p>\n<p>Source Licence info:</p>\n\n<p>MAYHEM is free software: you can redistribute it and/or modify<br/>it under the terms of the GNU Lesser General Public License as published by<br/>the Free Software Foundation, either version 3 of the License, or<br/>(at your option) any later version.</p>\n<p>MAYHEM is distributed in the hope that it will be useful,<br/>but WITHOUT ANY WARRANTY; without even the implied warranty of<br/>MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the<br/>GNU Lesser General Public License for more details.</p>\n<p>You should have received a copy of the GNU Lesser General Public License<br/>along with this program.  If not, see https://www.gnu.org/licenses/.</p>", "metacritic": null, "released": "2020-12-16", "tba": false, "updated": "2020-12-18T06:07:00", "background_image": "https://media.rawg.io/media/screenshots/122/1225fe76100459f0fe3918f43ce8addc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Bitl Development Studio"], "genres": ["Action"], "publishers": [], "esrb_rating": null}