{"id": 533082, "slug": "guess-the-animal-pics-quiz", "name": "Guess the Animal pics - Quiz", "name_original": "Guess the Animal pics - Quiz", "description": "<p>Guess the Animal pics is a Quiz app that allows players to guess the animals. This app is very informative and also made for educational purposes. 70+ levels are added on every weak.</p>\n<p><strong>* What is this app all about?</strong></p>\n<p>This app is amazing than the other's app because it has more high-quality images than other's app. And it has also good information about the animals and types of every animal species that make this app unique from the other alternative apps. The who has to increase his/her knowledge about animals and their kind download this app to gain success in this field.</p>\n<p><strong>* App's Features:</strong></p>\n<p>*In this app (Guess the Animal pics) you can use hints to solve levels.<br/>*You can also expose letters to achieve the level.<br/>*And also you can solve the level to play next level if you want.<br/>*You can also ask friends to help you on WhatsApp.Facebook,Messenger, Telegram,...etc.<br/>*If you have a shortage of coins you can get 90 coins by sharing our unique game on social *media like Tweeter, Facebook, Vkontakte,...etc. (where ever you want)<br/>*New users will receive (coins): 60<br/>*For correct answer user will receive (coins): 3<br/>*Hint \"Expose a letter\" will cost (coins): 25<br/>*Hint \"Remove letters\" will cost (coins): 30<br/>*Hint \"Solve the question\" will cost (coins): 60<br/>*Amount of free coins from post/tweet: 90<br/>*New post/tweet for coins will be available after (hours): 24 hours</p>\n<p><strong>* Conclusion:<br/></strong>The conclusion about this app (Guess the Animal pics) is that the app is amazing due to its features and also great for educational purposes because of those who want to know about the animal's names. That's why the player/user must download this app to enjoy and gain benefit from this app. If the user has any problem please contact us! So, we can solve our mistakes and make our users happy. Thanks!</p>", "metacritic": null, "released": "2020-12-16", "tba": false, "updated": "2020-12-18T06:20:38", "background_image": "https://media.rawg.io/media/screenshots/72a/72a592600ec9ae143a28e969f457b2ac.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 56, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["MSS Studio"], "genres": ["Action", "Educational"], "publishers": [], "esrb_rating": null}