{"id": 533004, "slug": "light-awakening", "name": "LIGHT: Awakening", "name_original": "LIGHT: Awakening", "description": "<p><strong>WALK THE PATH OF LIGHT &amp; SHADOW</strong><br/></p>\n<p>Not all residents of the Lighthouse are Human - some are beings formed from Light and Dark, created from a horrific interstellar rift. Many remain in their new home within the Shoal of Dreams, but some have come to the Lighthouse to offer aid. A few have even received the Light and become Beacons. These strange beings do not all worship the Light and do not all shun the Dark. They are <strong>Penumbral</strong>.</p>\n<p><strong>LIGHT: Awakening</strong> is a fan-created module for Spencer Campbell's rules-lite sci-fi RPG LIGHT. It introduces several new concepts to LIGHT:</p>\n<ul><li>A new playable <strong>species </strong>- the ethereal, mysterious Penumbral.</li><li><strong>Traits</strong>, abilities that can be used before or during a Strike unique to each species.</li><li><strong>Tags</strong>, a form of skills that each character gains by choosing a unique set of Origins, Memories, and Beliefs. Tags can provide a bonus die on any action they apply to. As characters grow and change, these tags can be altered to reflect that growth.</li><li><strong>The Shoal of Dreams</strong>, a briefly-described location which can be added to your game and visited or fleshed out at the GM's discretion.</li></ul>\n<p><strong>LIGHT: Awakening</strong> was created for the #LightJam in December, 2020.</p>", "metacritic": null, "released": "2020-12-16", "tba": false, "updated": "2020-12-18T06:04:39", "background_image": "https://media.rawg.io/media/screenshots/d7f/d7ff53055e4a93a3e905b31a8f5e3895.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 4, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Color Spray Games"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}