{"id": 533179, "slug": "kimmy-superstar-talking-fashion-cat-itch", "name": "Kimmy Superstar: Talking Fashion Cat (itch)", "name_original": "Kimmy Superstar: Talking Fashion Cat (itch)", "description": "<p>🌟 <strong>Welcome to the world of virtual pet games #1 fashion diva - talking cat! Who will put a new talking pet on a throne? KIMMY SUPERSTAR: TALKING FASHION CAT IS YOUR EXCLUSIVE VIRTUAL PET GAME, DIFFERENT FROM ALL THE OTHER VIRTUAL PETS TALKING GAMES!</strong> Explore the world of a real fashion star among the talking animals in virtual pet games and watch my talking cat Kimmy rise to fame and fortune! Let your talking cat be in all magazine covers! Complete daily missions, collect diamonds, experiment at the nail salon and makeup salon with my virtual cat and enjoy daily rewards of virtual cat games! DOWNLOAD KIMMY SUPERSTAR: TALKING FASHION CAT!</p>\n<p>💖💎 <strong>TALKING FASHION CAT DRESS UP VS SUPERSTAR DIVA PHOTOSHOOT!</strong> 💎💖<br/><br/>Play virtual cat games with your new fabulous virtual pet and start a real talking pet games adventure with this edgy fashion diva! <strong>Kimmy Superstar: Talking Fashion Cat is not just a regular virtual pet! You can dress her up just like in other virtual pets talking games, but talking pet Kimmy also has a new feature.</strong> IT’S THE PHOTOSHOOT ROOM! Let your snappy virtual cat be right in the spotlight. Prepare my virtual pet Kimmy for a celebrity photoshoot with a spa day. Take a bath and brush and polish her teeth. You can even put a peel off mask at the same time and have the same glamourous nail polish to steal the show! Watch my talking pet pose as a diva and become a cover star of all fashion magazine! <strong>Collect diamonds and coins and get daily bonuses to buy designer clothes for your talking cat after the photoshoot! As you progress to higher levels, Kimmy’s rooms will be more edgy and glamorous.</strong> The more magazine covers with this talking animal you collect, the more exclusive the living space for your talking animal will be. What are you waiting for? Download Kimmy Superstar: Talking Fashion Cat!<br/><br/>💖💎 <strong>KIMMY SUPERSTAR: TALKING FASHION CAT FEATURES:</strong> 💎💖<br/><br/>🎬📷 <strong>PHOTOSHOOT ROOM</strong> - Have a photoshoot for famous magazine covers and buy the looks for my virtual pet Kimmy<br/>🏠<strong>UPGRADE KIMMY’S ROOMS</strong> - Each level gives your talking cat a new fabulous room design<br/>👗<strong>DRESS UP</strong> - Customize my virtual cat with many style options<br/>💄<strong>MAKEUP SALON</strong> - Polish your talking kitty at the superstar salon<br/>💅 <strong>NAIL SALON</strong> - Do the nail polish to my virtual pet<br/>🍛🍹<strong>EXCLUSIVE FOOD AND DRINK</strong> - Notice luxurious food your diva Kimmy can eat<br/>💤<strong> SKIP SLEEPING</strong> to continue playing with your talking cat, a real superstar angel<br/>🏆 <strong>DAILY BONUS</strong> - Come play with fabulous Kimmy superstar and be awarded for being a loyal player<br/>☸️ <strong>SPIN THE WHEEL</strong> to collect diamonds and coins in talking pet games<br/>🐾 <strong>SHARE</strong> Kimmy’s magazine covers on social networks<br/>🎮 <strong>MINI GAMES</strong> - Play Diamond Splash, Tic Tac Toe, Tower Builder to earn coins while playing talking animal games<br/><br/><strong>My virtual cat Kimmy is much more than just a regular virtual pet. Kimmy the cat will win your heart, because she is the boldest fashion diva of all talking pet games.</strong> Don’t miss the fun! Download Kimmy Superstar: Talking Fashion Cat and show who is the greatest superstar!<br/><br/>Please note that Kimmy Superstar: Talking Fashion Cat is free to play, but it contains items that can be purchased for real money. Some features mentioned in the description may also have to be purchased for real money. Still, you will surely enjoy playing with my talking cat!<br/><br/><strong><em>This virtual pet game has been developed and published by Peaksel.</em></strong></p>", "metacritic": null, "released": "2020-12-16", "tba": false, "updated": "2020-12-18T06:42:36", "background_image": "https://media.rawg.io/media/screenshots/3a0/3a0a0dc17c7b1104d6c74034e99c191c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 149, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Peaksel"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}