{"id": 5332, "slug": "interpol-the-trail-of-dr-chaos", "name": "Interpol: The Trail of Dr. Chaos", "name_original": "Interpol: The Trail of Dr. Chaos", "description": "Track down the evil and destructive fugitive Dr. Chaos, as you hunt down clues in this exciting seek and find game. As an elite agent for Interpol, it is your mission to eradicate his trail of corruption as it takes you around the world from one international city to the next.  Use your investigative skills to quickly gather the evidence needed to bring him to justice.<br/><br/>\r\n•\tTons of Puzzles – Analyze elaborate crime scenes to uncover hundreds of mysterious hidden objects.<br/>\r\n•\tGlamorous Destinations  – Search for clues scattered in exotic locales around the world including San Francisco, Paris, Tokyo, Cairo and more.<br/>\r\n•\tClever Mini-games -  Discover bonus similarities and differences puzzles to test your keen eye-sight.<br/>\r\n•\t4 Player Co-op – Complete missions with other agents to quickly apprehend this dangerous criminal before he does more harm.\r\n<br/><br/>\r\n TikGames, LLC. © 2008, TikGames, LLC. All rights reserved. All trademarks, trade names and logos are the property of their respective owners.\r\n<br/><br/>\r\nPurchase or use of this item is subject to the PlayStation®Network Terms of Service and User Agreement. This item has been sublicensed to you by Sony Computer Entertainment America.", "metacritic": null, "released": "2007-09-05", "tba": false, "updated": "2019-08-02T16:22:26", "background_image": "https://media.rawg.io/media/screenshots/850/8504b361aaabcc623a737e39aeb88496.jpg", "website": "http://www.tikgames.com/pc/InterpolTheTrailofDrChaos/tabid/67/default.aspx?id_game=391", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 22, "beaten": 1}, "playtime": 0, "achievements_count": 12, "ratings_count": 0, "suggestions_count": 500, "game_series_count": 0, "reviews_count": 0, "platforms": ["PlayStation 3", "PC"], "developers": ["TikGames", "TikGames-Creat Studios"], "genres": ["Adventure", "Puzzle"], "publishers": ["Big Fish Games"], "esrb_rating": "Everyone 10+"}