{"id": 533696, "slug": "the-elvess-gifts-factory", "name": "The elves's gifts factory", "name_original": "The elves's gifts factory", "description": "<p>Jeu en développement pour la Game Jam #29 de GameCodeur sur le thème de Noël.</p>\n<p>Le concept de mon projet est basé sur le jeu mobile Cooking Diary consistant à préparer des plats pour des clients en combinant des aliments.</p>\n<p>Sauf qu'ici il s'agit d'un lutin devant préparer des cadeaux.</p>\n\n<p>Le principe de mon jeu sera le suivant:</p>\n<p>- Un tapis roulant apportera les lettres des enfants à un téléviseur.</p>\n<p>- Celui-ci convertira les lettres en image pour afficher le jouet à fabriquer.</p>\n<p>- Les divers éléments pour le fabriquer apparaîtront à côté du téléviseur.</p>\n<p>- Il faudra envoyer le lutin sur les divers postes de travail afin d'assembler les bons éléments.</p>\n<p>- Quand le jouet est prêt, celui sera emballé automatiquement.</p>\n<p>- Il suffira de le déposer sur le présentoir de gauche pour que le Père Noël vienne le chercher.</p>\n<p>- J'aimerai faire des objectifs de 5 minutes pour réaliser une série de cadeaux pour un pays avant de basculer sur un autre pays.</p>\n<p>- La victoire sera atteinte si et seulement si un certain pourcentage de cadeau à été réalisé.</p>\n\n<p>Beaucoup de travail en perspective. Projet trop ambiteux à mon avis. Je devrais faire les bons choix pour arriver à quelque chose de potable.</p>\n\n<p>Babbou !</p>", "metacritic": null, "released": "2020-12-14", "tba": false, "updated": "2020-12-18T08:41:22", "background_image": "https://media.rawg.io/media/screenshots/f4d/f4d73e2e9c609293c177652222bd63d9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 18, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Babbou"], "genres": [], "publishers": [], "esrb_rating": null}