{"id": 533618, "slug": "space-station-tycoon-early-access", "name": "Space Station Tycoon | Early-Access", "name_original": "Space Station Tycoon | Early-Access", "description": "<p><strong>The year is 3000, humanity is all over the galaxy and the economy is booming.</strong> It is time to take action by building your very own space station in a star system far, far away. Managing a space station in a distant star system isn’t an easy task to achieve, that’s why you should do your best to attract customers and get them to spend money.<br/><br/><br/><br/><strong>There are lots of wandering pilots across the whole galaxy looking for a space station</strong>. Each has their reasons, be it to repair and refuel their ships or maybe just to relax and have some fun. Even though what they each look for in a space station is very different, there is one thing they have in common; <strong>they want to spend some money.</strong> In Space Station Tycoon you will expand your station by building lots of different stuff like docking bays, research facilities, and even casinos to attract every kind of customer you can.</p>\n\n<p>Space Station Tycoon is inspired by its greatest ancestors of the “tycoon” genre. That’s why our main focus while making this game is always going to be its depth. We want the player to be able to control everything necessary from small things like fuel prices to intergalactic marketing budgets. <strong>With the depth it offers, Space Station Tycoon will surely deliver a true “tycoon” experience.</strong></p>\n\n<p>Space Station Tycoon on early-access will offer many days of fun gameplay. Here's an overview of what we have added to the early-access release so far:</p>\n<ul><li>Over 20+ buildings, each with different upgrade options</li><li>Procedurally generated customers with lots of attributes</li><li>Staff management</li><li>Collect and research alien artifacts</li><li>Set the rules of your station</li><li>Customization options</li><li>Stock trading</li><li>Intergalactic material trading</li><li>Space missions</li><li>Many hostile events like natural disasters or pirate attacks</li><li>A really in-depth finance tab to help you maximize your profits</li><li>Time speed controls</li><li>A 5-star ranking system to determine your station's quality</li><li>Achievements</li><li>Original soundtrack</li><li>Huge variety of marketing options for your space station</li><li>Build and implement holographic billboards to display ads of other intergalactic firms. Your rating determines the quality of these ad offers.</li><li>Frequent content updates</li></ul>\n<p>...and lots more to come.</p>\n<p>We are a small indie studio located in Germany, and Space Station Tycoon is our first game ever. </p>\n<p>The team currently consists of only 2 people. One of us does coding and sound design, and the other does art and game design.</p>\n\n<p><em><strong>!!! Steam keys are available with every purchase  !!!</strong></em><br/></p>", "metacritic": null, "released": "2020-12-14", "tba": false, "updated": "2020-12-18T08:24:46", "background_image": "https://media.rawg.io/media/screenshots/479/479b6491cdc8926b1abdc03dece65936.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 127, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Lunheim"], "genres": ["Strategy", "Simulation"], "publishers": [], "esrb_rating": null}