{"id": 533861, "slug": "melody-farm", "name": "Melody Farm", "name_original": "Melody Farm", "description": "<p>Melody Farm is an educational farming simulator/RPG where the goal is to help the Clavis Goddess save the homeland and unite people through the power of music once more. To do this, you must first nurture eight magical root notes from small sixteenth note seeds to magical whole note plants within ten days in order to fully resurrect the Tree of Melody and bring music back to life. But be wary, for your time and motivation each day is limited. Spend your time wisely and don't forget to rest every now and then.</p>\n<p>Key Features:</p>\n<ul><li>A love letter to all things music and classics like Story of Seasons and Stardew Valley!</li><li>Challenge yourself, and race against the clock and resurrect the Tree of Melody before time runs out!</li><li>Learn proper ear training techniques, and get to understand note keys, note notations, and musical keys and scales all within the gameplay alone!</li><li>Learn about the many aspects of beginner music theory like Major and Minor Scales, Time Signature, and common Composition Methods in the <em>Lessons Menu</em>!</li><li>See what's there to unlocks beyond the good ending of the game!</li></ul>\n\n\n<p><strong>Credits:</strong></p>\n<p><em><strong>Tobey-Julian Joseph: </strong></em></p>\n<p><em>Project Lead, Gameplay Designer, Lead Programmer, Lead UI Designer, Audio Engineer, Music Composer, Lessons Designer</em></p>\n<p><em><strong>Shawn Flynn:</strong></em></p>\n<p><em>Lead Artist, Animator, UI Art Designer, Promotional Artist</em></p>\n<p><em><strong>Owen Parker:</strong></em></p>\n<p><em>UI Designer, Layout Designer, Lead Technical Artist, Animation/Spritework Supervisor</em></p>", "metacritic": null, "released": "2020-12-14", "tba": false, "updated": "2020-12-18T09:21:22", "background_image": "https://media.rawg.io/media/screenshots/c38/c383861e3710cb1b244a448ca31ec99d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 95, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Decalf", "Tobey-Julian Joseph", "Gruulmagebeast"], "genres": ["RPG", "Simulation", "Educational"], "publishers": [], "esrb_rating": null}