{"id": 533996, "slug": "to-hell-and-back-itch-olvvvvlo", "name": "to hell and back (itch) (olvvvvlo)", "name_original": "to hell and back (itch) (olvvvvlo)", "description": "<p>Controllers: WASD <br/></p><p>W:left</p><p>A:up</p><p>S:down</p><p>D:right</p><p>and F is the action button, it opens the chests<br/></p><p>Move through a labyrinth looking for chests that contain cards, with forbidden knowledge, but be careful since there is something there with you, you can't see it, but you know that its there because the closer it is to you, the darker it gets.</p><p>The cards contain either forbidden knowledge or warnings, if you get a warning be careful:</p><p>!RUN: it knows where you are and is on its way there, better move away.</p><p>Behind you: It is just few steps away of you, but it doesn't know jet where you are, you have about 5 seconds to move away without it seeing you.</p><p>This is my entry to the mini jam, 3 days to create a game, because of this I had to left a lot of stuff out, as soon as the votes are out and if there is enough interest, I will make an update to the game, the final goal is to find an idea that can be developed on a project.<br/></p><p>HISTORY<br/></p><p>You managed to make a portal to another dimension, but that dimension happens to be hell, as soon as you see the place, you want to leave, but then you find a small chest that contain a card with forbidden knowledge that could help all humanity... or make you rich. You decide to stay for a while and look for more of those cards, but suddenly you realize that something is wrong, its getting darker and you feel watched, you take out your lighter, but even the light that comes out of the fire is getting dim, you try go get back to the portal but its not there any more, nothing is there anymore, the labyrinth has changed.<br/></p>", "metacritic": null, "released": "2020-12-14", "tba": false, "updated": "2020-12-18T09:53:34", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["olvvvvlo"], "genres": ["Action", "Adventure"], "publishers": [], "esrb_rating": null}