{"id": 533989, "slug": "mazing-ratuspro-antunes10-carlosmvs-game-dev-tecni", "name": "Mazing (ratuspro, Antunes10, Carlosmvs, Game Dev Técnico)", "name_original": "Mazing (ratuspro, Antunes10, Carlosmvs, Game Dev Técnico)", "description": "<p>⚜ Mazing is an action-platform game that uses Procedural Generated maps and biomes ⚜</p>\n<p>0️⃣ The Game:<br/>You're an athletic runner that has to find the secret crystal hidden in the corridors of a giant neon Building.<br/>Through quick mechanics and good orientation you have to catch it in the least amount of time as possible, with the help of a simple arrow, that tells you the direction of the objective.</p>\n<p>1️⃣ The Code:<br/>Mazing uses a complex Wave Function Collapse to create 3D worlds, .......</p>\n<p>2️⃣ The Future:<br/>For now this is just a simple Tech Demo, however our team is motivated to improve and build a fully developed game. Here are some ideas that are already being implemented:<br/>- 2 more levels with moving platforms and different architecture models.<br/>- 2 power ups, to help the player navigate faster through the level.<br/>- 2 new game modes, Survival Climb and Catch me if you can.<br/>- AI enemy that runs away from the player, while this one tries to catch it.<br/>- Raising water level, that the player must avoid.<br/>- Menus and UI.</p>\n<p>3️⃣ All art was created by us and it was made using Unity Engine.</p>\n<p>🧡 Made by a team at GameDev Técnico.</p>\n<ul><li>André Antunes</li><li>Carlos Sousa</li><li>Diogo Rato</li></ul>", "metacritic": null, "released": "2020-12-14", "tba": false, "updated": "2020-12-18T09:51:41", "background_image": "https://media.rawg.io/media/screenshots/bcb/bcb09522389174a8463eb2e7ae321719.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 55, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ratuspro", "Game Dev Técnico", "Antunes10", "Carlosmvs"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}