{"id": 533953, "slug": "hex-tactics", "name": "Hex Tactics", "name_original": "Hex Tactics", "description": "<p><strong>MISSION DEBRIEFING</strong></p>\n<p>Unattended mechs across the sector have been hacked and gone rogue. The now autonomous mechs are wreaking havoc, and it's your mission to scuttle the drones and keep the malware from spreading. The injected override routines can be outsmarted if you're clever, but the mechs will do real damage, so be careful out there!<br/></p>\n\n<p><strong>Hex Tactics </strong>is a demo developed over about 5 weeks. The project is built in Unity. While the code was written by Robert Ackley, all audio and visual assets were obtained from online marketplaces and forums.</p>\n<p>Development has advanced in phases, each with a different area of focus:<br/></p>\n<ol><li>Rapid Prototype [14 Days]</li><li>AI Extension [6 Days]</li><li>Polish Phase [6 Days]</li><li>Procgen Iteration [10 Days]</li></ol>\n<p>The procedural generation phase was developed as a submission for ProcJam 2020.</p>\n\n<p><strong>Development Diary</strong></p>\n<p><strong>[Rapid Prototype] </strong>[14 Days]</p><p>• Generate hex tiles from map definition scriptable object<br/>• Implement basic mech controls for selection, movement, attack<br/>• Add health bar UI, functions to inflict damage, death animation<br/>• Add cycling through unit turns plus unit turn UI<br/>• Add action phase handling plus action panel UI<br/>• Implement initial AI for enemy turn management<br/>• Extend AI to reposition when no target is available<br/>• Add UI to render lines representing LOS to enemies<br/>• Implement weighted pathfinding based on terrain types<br/>• Implement LOS blocking via certain terrain types<br/>• Add Hex Tile UI panel with info on terrain effects<br/>• Update mech movement to run or walk based on terrain type<br/>• Add initial Title Menu and Pause Menu screens<br/>• Expand map, add Camera controls for pan &amp; zoom<br/>• Implement win condition handling and End Game UI<br/>• Implement Restart option, add to Pause and End Game menus<br/>• Add mech movement limit and UI to convey mech range</p>\n\n<p><strong>[Extended AI] </strong>[6 Days]</p>\n<p>• Introduce terrain based defense bonuses<br/>• Extend hex grid code to produce distance map for multiple destinations<br/>• Calculate defensive bonus utility factor for nearby hexes<br/>• Calculate exposure avoidance &amp; target opportunity utility factors<br/>• Choose best location to move based on combined weighted utility factors<br/>• Provide UI to select from AI difficulty options at start of each game<br/>• Evaluate game state and render dialogue to convey AI decision making</p>\n\n<p><strong>[Polish Phase]</strong> [6 Days]</p>\n<p>• Add Title Screen and Gameplay music with track cycling<br/>• Add musical stingers for win and loss conditions<br/>• Add ambient looping wind sound effect<br/>• Add SFX for laser attacks, mech locomotion, and unit death<br/>• Add SFX for hex hover over, confirm action, new unit turn, and AI dialogue<br/>• Add SFX for hovering over and clicking on UI buttons<br/>• Increase mech movement and animation speeds by 30%<br/>• Add Credits screen accessible from the Title Screen<br/>• Display shield icon indicating terrain defense bonus in hex highlight<br/>• Display shield icon indicating terrain defense bonus next to mech health bar</p>\n\n<p><strong>[Procgen Iteration]</strong> [10 Days]</p>\n<p>• Introduce basic procedural generation of maps and starting positions<br/>• Add option to reset current scenario to original starting positions<br/>• Add option to reset current scenario to same map with new positions<br/>• Add option to start a new scenario on a new map<br/>• Add Customize menu with sliders controlling procgen map parameters<br/>• Refactor map generation to accommodate multiple biomes<br/>• Refactor Customize menu to accommodate multiple biomes<br/>• Add Desert &amp; Shrubland biomes (in addition to original Tropical biome)<br/>• Refine map gen parameters to achieve more distinct gameplay per biome<br/>• Add mech pilot speech lines for end turn, move, attack, and teammate down<br/>• Randomize mech pilot names and avatars for each new paythrough<br/>• Introduce randomized character traits with Character Profile UI panel<br/>• Extend speech lines and filter on speaking unit's characters traits</p>", "metacritic": null, "released": "2020-12-14", "tba": false, "updated": "2020-12-18T09:41:21", "background_image": "https://media.rawg.io/media/screenshots/91a/91adaaa8d485b47c7810d4d3698abf44.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 167, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Robert Ackley"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}