{"id": 53408, "slug": "mega-man-bass-1998", "name": "Mega Man & Bass (1998)", "name_original": "Mega Man & Bass (1998)", "description": "<p>Mega Man &amp; Bass, known in Japan as Rockman &amp; Forte (ロックマン&amp;フォルテ, Rokkuman ando Forute), is an action-platform video game developed and published by Capcom. It is a spin-off title in the original Mega Man series and was originally released exclusively in Japan on April 24, 1998 for the Super Famicom. Mega Man &amp; Bass was ported to the Game Boy Advance (GBA) handheld in 2002 and was localized in North America and PAL regions the following year.</p>\n<p>After defeating the evil Dr. Wily many times, the robotic hero Mega Man is called into action once again when a powerful being known as King steals the blueprints to the creations of Dr. Wily and Dr. Light in order to create an army for robotic dominance over humans. Having learned of the threat, Mega Man's rival Bass decides to take matters into his own hands. The game is an action-platformer where the player advances by defeating bosses and acquiring their signature weapons. Mega Man &amp; Bass lets the player choose between either of its title characters, each of which plays differently from the other.</p>\n<p>Mega Man &amp; Bass debuted on the aging 16-bit Super Famicom despite the series having already transitioned to the PlayStation and Sega Saturn with Mega Man 8. Producer Keiji Inafune claimed Mega Man &amp; Bass was created with regard to younger players who did not yet own one of the more advanced gaming systems. The game received positive remarks from critics for its graphics and use of a tried-and-true gameplay formula, though many found the difficulty to be too steep. Although Mega Man &amp; Bass shares many traits with previous console games in the series, the ninth numbered title would not be released until 2008.</p>", "metacritic": null, "released": "1998-04-24", "tba": false, "updated": "2023-04-28T10:32:35", "background_image": "https://media.rawg.io/media/screenshots/03f/03f09342cb02826b9abbe0325cf2334d.jpg", "website": "", "rating": 3.29, "rating_top": 4, "added_by_status": {"yet": 3, "owned": 4, "beaten": 10, "toplay": 5, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 7, "suggestions_count": 314, "game_series_count": 0, "reviews_count": 7, "platforms": ["Game Boy Advance", "SNES", "Wii U"], "developers": ["Capcom"], "genres": ["Action"], "publishers": ["Capcom"], "esrb_rating": null}