{"id": 53404, "slug": "mega-man-battle-network-6", "name": "Mega Man Battle Network 6", "name_original": "Mega Man Battle Network 6", "description": "<p>MegaMan Battle Network 6, known as Rockman EXE 6 (ロックマンエグゼ6, Rokkuman Eguse Shikkusu) in Japan, is a video game developed by Capcom for the Game Boy Advance (GBA) handheld game console. As with the previous three games, the Japanese edition was released in two separate versions: Cybeast Gregar (電脳獣グレイガ, Dennōjū Gureiga) and Cybeast Falzar (電脳獣ファルザー, Dennōjū Faruzā). Later, Japan re-released these games in combo packs with a special colored version of the &quot;Battle Chip Gate&quot;, or &quot;Beast Link Gate&quot;. This special combo pack was called the Rockman EXE 6 Beast Link Gate DX Edition and contained a special Blue &quot;Netto&quot; version of the Beast Link Gate and one of the games&#39; two versions.<br />\nBattle Network 6 marks the end of the Game Boy Advance Battle Network series, as shown in the ending. Keiji Inafune has stated in an interview that EXE6 is indeed the final game in the series. It takes place months after Battle Network 5, and Lan&#39;s father has been moved to work in Cyber City, forcing Lan to move there as well. He learns of two ancient and dangerous Net creatures known as Cybeasts as well as the return of WWW who are trying to awaken the beasts. Lan must do whatever it takes to stop them and destroy the Cybeasts before they destroy the Net.</p>", "metacritic": 63, "released": "2005-11-23", "tba": false, "updated": "2023-06-19T08:44:22", "background_image": "https://media.rawg.io/media/games/f71/f71bb1d261493da6032df37669eb368d.jpg", "website": "", "rating": 4.5, "rating_top": 5, "added_by_status": {"yet": 4, "owned": 4, "beaten": 6, "toplay": 5, "dropped": 2, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 6, "suggestions_count": 375, "game_series_count": 10, "reviews_count": 6, "platforms": ["Game Boy Advance"], "developers": ["Capcom"], "genres": ["Action", "RPG"], "publishers": ["Capcom"], "esrb_rating": "Everyone"}