{"id": 534083, "slug": "wrath-of-zeus-yungcereal", "name": "Wrath of Zeus (yungcereal)", "name_original": "Wrath of Zeus (yungcereal)", "description": "<p>The people have had enough of Zeus, and they're ready to knock him off his cloud!</p>\n<p>You play as Zeus, and your job is to fight off those pesky peons. Shoot your lightning and send them down to the underworld! Let Hades deal with them!</p>\n<p>(The game may take a few seconds to load in browser.)</p><p>(Check the comments to see my latest high score!)</p>\n<p><strong>Instructions</strong></p>\n<p>Move around and shoot lightning at the enemies. New enemies constantly spawn, and the longer you last, the angrier they get! That means they attack and spawn more frequently.</p>\n<p>Every five seconds, Hermes will visit you! He's a gambling man and wants to play a card game. He'll deal out a card, and you fly over what suit you think it is. If you're correct, you get a reward!</p>\n<p> If you are low on health, you'll regain a heart. If you have full health, you'll kill all enemies on the screen. </p>\n<p>But if you're wrong, two more enemies will spawn to attack you. Good luck!</p>\n<p><strong>Controls</strong><br/></p>\n<p>Move - WASD<br/>Shoot Lightning - Left Click</p>\n\n<p>This game was made for Mini Jam 69.</p>\n<p>Theme: Hell</p>\n<p>Limitation: Must include cards</p>\n\n<p>I had a lot of fun making this game! It's my second jam and I think I improved a lot over my first. The game is tricky, but I think it's fun to play considering it was made in only 72 hours! Wish I had more time to add some animations to the characters, but that's for another day!</p>\n\n<p><strong>Programming/Game Design/Art</strong></p>\n<p>Ashton Winters</p>\n<p>@a_winters7</p>\n\n<p><strong>Music</strong><br/></p>\n<p>MD Wade</p>\n<p>@MD_Wade_Music</p>\n<p>mdwade.com</p>", "metacritic": null, "released": "2020-12-14", "tba": false, "updated": "2020-12-18T10:13:56", "background_image": "https://media.rawg.io/media/screenshots/874/8745d066d5bd897b8afd01ac0259ef0f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 47, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["yungcereal"], "genres": ["Action"], "publishers": [], "esrb_rating": null}