{"id": 534001, "slug": "2d-portal-run", "name": "2D Portal Run", "name_original": "2D Portal Run", "description": "<p>Welcome to <em>2D Portal Run</em>! This game is an infinite runner based on the portal games! Your objective is to see how far you can survive, but be careful as the game gets harder as you play.  In case you aren't familiar with Portal's mechanics, you are required to shoot two different colored Portals in order to play the game. The blue portal takes you to the yellow one, and the yellow portal takes you to the blue one. You'll get the hang of it after a few tries. Be careful though, only the light-grey surfaces are able to have a Portal placed on them, so make sure only to aim for those surfaces.</p><p><strong>Instructions:</strong></p><p><em>W/A/S/D</em> or the <em>Arrow Keys</em> to move the character</p><p><em>Space </em>to <em>Jump</em></p><p><em>Aim </em>with your <em>cursor</em></p><p><em>Left-Click</em> to shoot a blue Portal</p><p><em>Right-Click</em> to shoot a <em>yellow </em>Portal</p><p><strong>Questions to the player:</strong></p><p>What else can be implemented to make the game more fun and replayable?</p><p>Are the Portals working as intended?</p><p>Are you confused at all by the concepts presented? How can they be presented more clearly to make it less confusing?</p><p><em>All feedback is appreciated!</em></p><p><strong>Known Issues:</strong></p><p>On some walls, the Portals do not face the correct direction.</p><p>Occasionally the Portals will act funky and switch your location between the two rapidly, if this happens shoot one of the Portals somewhere else and it should fix this.</p><p>If you are not facing the direction of the Portal and Jump into it, it sometimes teleports you right back to your original location.</p>", "metacritic": null, "released": "2020-12-14", "tba": false, "updated": "2020-12-18T09:54:56", "background_image": "https://media.rawg.io/media/screenshots/930/930866f38911e58f96829dd6e76ef2be.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 4, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["shoneyjosh"], "genres": [], "publishers": [], "esrb_rating": null}