{"id": 534199, "slug": "silver-cats", "name": "Silver Cats", "name_original": "Silver Cats", "description": "Once upon a time, the country Rain was famous for its jewelry craftsmen, and its landscapes could impress any guest. But one day in the afterlife world, a fierce struggle began between demons for the right to own the throne. Due to the feuds of demons right in the center of Rain, a rift opened into the afterlife world, which turned everything around into ruins. The corruption from the rift was so strong that the surviving inhabitants of the surrounding area forever lost the ability to use ordinary magic – from that moment they could only wield demon magic. Now the guild \"Silver Cats\" is trying to restore the world to its previous state, and the son of the guild master was chosen as one of those who are able to restore the world.<h3>Features</h3><ul><li> 135 different quests<br/></li><li> over 250 crafting recipes<br/></li><li> almost 1000 different items<br/></li><li> 3 types of weapons: one-handed sword, two-handed sword, magic artifact<br/></li><li> 4 types of armor: cloth, plate, leather-physical and leather-magic<br/></li><li> no binding to character class<br/></li><li> 24 locations<br/></li><li> 6 levels of difficulty that change the gameplay of your choice<br/></li><li> on high difficulty it is necessary to use sharpening, inlay and engraving<br/></li><li> 10+ hours of passage on \"Researcher\" difficulty<br/></li><li> 30+ hours of passage on \"God\" difficulty<br/></li><li> no donation</li></ul><h3>For the game to work correctly, you must run it as an administrator.</h3>If the game does not start or there are problems with displaying text, go to the \"Compatibility\" tab in the properties of the Silver Cats.exe file, check the box next to \"Run the program as administrator\" and save – this way, every time you start the game, the game will run as administrator.", "metacritic": null, "released": "2020-12-18", "tba": false, "updated": "2020-12-21T02:21:50", "background_image": "https://media.rawg.io/media/screenshots/c0e/c0e2274db87e4d4da1f14d305b4222b9.jpg", "website": "https://silvercatsdeveloper.blogspot.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 460, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Silver Cats"], "genres": ["RPG", "Indie"], "publishers": ["Silver Cats"], "esrb_rating": null}