{"id": 534198, "slug": "fa-li-en-zhan-ji-2-furion-chronicles-2", "name": "法利恩戰記2 (Furion Chronicles 2)", "name_original": "法利恩戰記2 (Furion Chronicles 2)", "description": "game introduction:<br/><br/>The Ishurian Islands in the northwestern part of Farion have been ruled by members of the Abyssal Council who traded slaves for hundreds of years. However, after the chief member of the Abyss Council was killed by slaves, the entire archipelago gradually fell into war...<br/><br/>As a suppressive force directly under the Abyss Council, Kurt met a mysterious slave girl at this moment. How would he use his wrist to deal with the various forces in the mainland, and hold the fate of the entire archipelago... and even the entire continent in his own hands?<br/><br/><br/><br/>◆Detailed information, roles and system introduction of the work, etc.<br/><br/>game type:<br/>SRPG<br/><br/>Game text:<br/>traditional Chinese<br/><br/>The game contains:<br/><br/><br/>◆15 chapters in the basic level, 8 chapters in other levels.<br/><br/>Game system:<br/>◆Weapon restraint system<br/>There is standard weapon restraint in the game. Observe the enemy's weapons and choose the right weapon is the way to victory.<br/><br/>◆Battle system:<br/>The commander who knocks down the enemy will get different rewards, make good use of these to achieve victory.<br/><br/>◆Subordinate system:<br/>Some characters have subordinate characters with different abilities. Use them to deal with different battlefields.<br/><br/>◆ Favorability system:<br/>Increase the popularity of different heroines through events or props to unlock events! The final choice will determine the fate of everyone!<br/><br/>◆Difficulty system:<br/>If you are an elite commander who is good at combat, you can choose [Difficult] difficulty, so that you will understand the original appearance of the whole story.<br/><br/><br/><br/>Other related:<br/>◆The difficulty of this game is not high, and novice players can easily proceed with the plot.<br/>◆All characters appearing in this game are over 18 years old.", "metacritic": null, "released": "2020-12-18", "tba": false, "updated": "2020-12-21T02:20:46", "background_image": "https://media.rawg.io/media/screenshots/254/2547ea401eb608acd0f80730a79004e3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 295, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Minstrel Studio"], "genres": ["Adventure", "RPG", "Strategy", "Simulation", "Indie"], "publishers": ["Minstrel Studio"], "esrb_rating": null}