{"id": 534189, "slug": "structura", "name": "Structura", "name_original": "Structura", "description": "Structura is a rather unique sci-fi real time strategy set in space.<br/>Its a hybrid of rts and fps, emphasis on combat and survival<br/>, the economy is important for the war effort.<br/><br/>You are the commander of a combat unit of the Human Resistance Fleet.<br/><br/>Build your economy for war, modify the unit by adding components,<br/>explore, expand and survive the savage waves of enemies attacks.<br/>Scan and destroy enemies, plan your defenses, jump the unit to safety.<br/><br/><br/><strong>Core features</strong><br/><br/>Single-player open-world gameplay<br/>Procedural generated world<br/>Permadeath, there is no save<br/>Multiple roles (fly the sentinel a combat strike ship, command the main base)<br/>Space navigation by jumps (use the sentinel to create jump beacons for the base to jump)<br/>Economy gameplay, prepare the unit for war.<br/>Multiple ways to acquire resources<br/>Base construction (the base can be expanded indefinitely, with enough resources available)<br/>Your choices, many options, pick how you want to play<br/>Survival gameplay<br/>Difficulty high but fair once you learn the ropes<br/>Interesting story, replayable<br/><br/><br/><strong>Story</strong><br/><br/>Humanity fights for survival against an unknown and implacable enemy.<br/>The human race as we know it doesn't exist anymore.<br/>Humans survived as cybernetic simulations inside their combat vessels.<br/>You are the commander of such unit (part of the Human Resistance Fleet).<br/>HRF Structura , your ship, contains the simulated personalities of about 300 humans.<br/><br/>Your story begins here<br/><br/><br/><strong>Gameplay</strong><br/><br/>Fight for survival.<br/>The sentinel provides offensive/defensive capabilities.<br/><br/>The main base(known as the unit) can be expanded by using components<br/>on 6 directions(left,right, up, down, front, back).<br/><br/>Each component is linked to the ship by one socket and one tunnel.<br/>15 different components are available from economy to military purposes.<br/><br/>New units can be attached so the base can be expanded indefinitely<br/>in any direction(providing enough resources).<br/><br/>Gather resources, fight, survive", "metacritic": null, "released": "2020-12-18", "tba": false, "updated": "2020-12-21T02:16:03", "background_image": "https://media.rawg.io/media/screenshots/fb7/fb783b6709195898b1fa038a4997e27c.jpg", "website": "https://greengolem.github.io/Structura", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 259, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["GreenGolem"], "genres": ["Strategy", "Indie"], "publishers": ["GreenGolem"], "esrb_rating": null}