{"id": 534190, "slug": "100-worlds-escape-the-room", "name": "100 Worlds - Escape the Room", "name_original": "100 Worlds - Escape the Room", "description": "<strong>Story</strong><br/><br/>Mia set out on yet another adventure. She found herself stuck in an ancient magic book and now has to solve various problems, riddles and puzzles in order to travel from one world to another and eventually escape from the magic book. There is a variety of magical and fantastic worlds, all very different from one another. Your task is to work out the solutions with Mia. In case you get stuck, you can use hints and other help to pass the levels. <br/><br/><strong>Game features:</strong><br/><br/><ul><li>100 mind bending levels, 400 more coming soon<br/></li><li>A variety of magical worlds to explore<br/></li><li>Hints to help you when you’re stuck<br/></li><li>Amazing graphics<br/></li><li>Exciting puzzles with hidden objects and conundrums to solve<br/></li><li>Innovative game mechanics: move in time and space and combine objects</li></ul><br/>Put your brain to work and help Mia get out. Are you ready to give it a try?<br/><br/><strong>Genre</strong>: logic puzzle, escape the room<br/><strong>Age</strong>: 12+<br/><br/><strong>Benefits of Brain Games</strong><br/><br/>In addition to boosting brain activity, brain games have proven beneficial when it comes to improving concentration and providing a sense of accomplishment. While playing this room escape game, you will have to use logical thinking and get your brain cells to work. Not only will you remove boredom, but also the puzzles and riddles in the game will help enhance your memory and improve the step by step thinking process.<br/><br/><strong>Family friendly</strong><br/><br/>You can play 100 Worlds as a family and see who’s got the fastest skills. The puzzles and riddles have been adjusted to players above the age of 12 so get your teens together and explore the variety of worlds while solving logic tasks.", "metacritic": null, "released": "2020-12-18", "tba": false, "updated": "2023-04-13T15:06:59", "background_image": "https://media.rawg.io/media/screenshots/f1f/f1fc551fca45891ab334d3917db869e9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 259, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Peaksel"], "genres": ["Casual"], "publishers": ["Peaksel"], "esrb_rating": null}