{"id": 534235, "slug": "art-puzzle-jigsaw-coloring", "name": "Art Puzzle - Jigsaw Coloring", "name_original": "Art Puzzle - Jigsaw Coloring", "description": "Meet Art Puzzle, a brand new stress-relieving game by Easybrain. It's a unique place where coloring books meet jigsaw puzzles! Relax and engage your mind with breathtaking stories coming to life.<br/><br/>In Art Puzzle, you solve puzzles by fitting together pieces of a drawing and watching them build into a colorful animated painting. It's a completely new gaming experience of a classic coloring game.<br/><br/>Every puzzle has been specially created for Art Puzzle. Each puzzle is a unique multilayered piece of art. Many different artists have created fascinating paintings in which you can immerse yourself. Enjoy an incredible world of amazing stories. All pictures are hand-drawn with original styles and techniques. Explore hundreds of amazing pictures and brighten your mood! <br/><br/>Enjoy Art Puzzle:<br/><br/>* Enjoy a fun twist on jigsaw puzzles and coloring books.<br/>* Every picture comes to life as the puzzle animates when completed.<br/>* Each game level is a little more challenging but very fun and relaxing.<br/>* Tons of fascinating hand-drawn pictures from different artists, each with their own original style and technique.<br/>* Stuck on a puzzle? Watch helpful hints that easily guide you to finish.<br/><br/>Create fun beautiful artwork as you challenge your mind and relax at the same time. Now, let’s get started with your first art puzzle!", "metacritic": null, "released": "2020-12-15", "tba": false, "updated": "2020-12-21T02:44:06", "background_image": "https://media.rawg.io/media/screenshots/edc/edcab7d35c80a55f3b80f69f5c8fa23b.jpg", "website": "https://easybrain.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 303, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Easybrain"], "genres": ["Board Games", "Puzzle"], "publishers": ["EASYBRAIN"], "esrb_rating": "Teen"}