{"id": 534255, "slug": "crazy-dinerkitchen-adventure", "name": "Crazy Diner:Kitchen Adventure", "name_original": "Crazy Diner:Kitchen Adventure", "description": "Crazy Diner is the crazy chef's worldwide cooking game! Follow the world chefs to learn cuisines from all over the world, run restaurants in your cooking city and enjoy cooking frenzy in every cooking day! Start your adventure and record your kitchen diary in this crazy cooking madness game!<br/><br/>Welcome to Tasty Town - Food from dozens of countries, the star chefs and people with cooking fever are waiting for you here. You will learn too much cooking skills in different restaurants, how to cook the most tasty meals and also how to satisfy the needs of every guest. Finally, defeat all challenges and open your own restaurant! More and more guests dash into the diner! Let's experience a brand new restaurant story !<br/><br/>Unique boosts make you more addicted to this Time-Management game! No matter how long the food will not burn! Have you seen any food that can be made immediately? The guests are urging you to serve! Don’t worry, \"Imagine Boost\" will help you solve it easily! You have countless ways to become a top chef! Come and unlock one by one!<br/><br/>Features:<br/>Cook hundreds of special recipes in different restaurants around the world!<br/>Get keys which lead you to the top-chef! Don't miss any level!<br/>Unlock more kitchen machines and more ingredients!<br/>Thousands of levels make you never bored!<br/>Participate in exciting events and get surprise rewards!<br/>Create the character with your own fashion style!<br/>Decorate your own special Food Street!<br/><br/>Cook tasty food from all over the world, open your own restaurant and decorate the most dreamy food street. Cook these foods as fast as you can and you will find that your cooking skill is better than ever! When others are still immersed in decorating the room, you have owned a food street to manage and decorate! When more and more guests are attracted by your restaurant, you will get closer to the star chef!<br/><br/>Call your friends to download with you together! Create your personal role and get rewards while sharing happiness! Never thought that cooking games can be so fun!", "metacritic": null, "released": "2020-12-02", "tba": false, "updated": "2020-12-21T02:55:50", "background_image": "https://media.rawg.io/media/screenshots/e90/e90fabcfc450e1969dead8ad7d8fd842_g5yZXEY.jpg", "website": "https://www.smartfunapps.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 173, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Smart Fun"], "genres": ["Strategy", "Simulation"], "publishers": ["Smart Fun"], "esrb_rating": "Everyone 10+"}