{"id": 534320, "slug": "candycanecrush", "name": "Candy(Cane)Crush", "name_original": "Candy(Cane)Crush", "description": "<p>This is my entry for the Great Winter Game Jam 2020, and also my first ever released game. I had a lot of fun making it, I hope you enjoy as well!</p>\n<p><strong>- Game Jam Theme -</strong></p>\n<p>As the name suggests, the theme for the game jam was winter.</p>\n<p>There is an optional mechanic of \"Risk &amp; Reward\". My idea with that is described below.</p>\n<p>The optional color palette was used for most of the assets.</p>\n<p><strong>- About the Game -</strong></p>\n<p> Christmas is coming, and the present machine still has a lot of work to do. The machine is working non stop to create all the presents it can, but the evil snowmen want to ruin the holidays by destroying the machine. Your goal is to defend the present machine for as long as you can, so that it can create enough presents for everyone.</p>\n\r\nTitle Screen of the game\r\n\n\r\nPresent machine - defend it!\r\n\n<p><strong>- How to play -</strong></p>\n<p>Use your weapons to defend the machine as long as you can.<br/>Difficulty increases over time, so be prepared to fight!<br/></p>\n\n<p><strong>- Controls -</strong></p>\n<p>WASD to move</p>\n<p>Switch weapons using your number keys.</p>\n<p>Attack using the left mouse button.</p>\n<p>Attacks to enemies heads deal critical damage!</p>\n<p>Crouch down using left CTRL. This heals you over time but slows you down as well.</p>\n<p>Once the player dies, it respawns in a few seconds. During that time, the present machine is undefended.</p>\n<p>Interactable objects light up yellow if you are close enough to interact with them. Press E to interact.</p>\n<p>The present machine can be repaired a little by pressing its left button.</p>\n\n<p><strong>-- Risk &amp; Reward --</strong></p>\n<p>It is possible to sacrifice machine health to receive ammo for a special weapon. Press the right button on the present machine and it will generate a weapon present while hurting the machine. These presents have a different colour and pressing E while looking at them gives you ammo for the Bonbomb weapon in slot 3.</p>\n\n<p><strong>-- Weapons --</strong></p>\n<p>- Snowball:<br/> Use snowballs to defeat snowmen at longer distances. Pick up snow from the ground by pressing E while looking at it. Hold down the left mouse button to charge your throw.</p>\n<p>- Candy cane:<br/> Use the candy cane to fight at melee range. Left click to swing - aim for the head!</p>\n<p><strong>-- Consumable weapons --</strong><br/>The present machine tries to help you out by generating weapon presents from time to time. These presents are coloured differently from normal presents, press E to pick them up while looking at them. They will give you ammo.</p>\n<p>BonBomb:<br/> This sugar bomb will clear an area of enemies. If you have ammo, you can charge your throw by holding down the left mouse button. Release it to throw the bonbomb, it will explode a few seconds after throwing it.</p>\n<p>Have fun!<br/></p>", "metacritic": null, "released": "2020-12-20", "tba": false, "updated": "2020-12-21T03:12:59", "background_image": "https://media.rawg.io/media/screenshots/b9b/b9b6d1ceff91f172afc231c53a1ed391.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 106, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["RealCrabGames"], "genres": ["Action"], "publishers": [], "esrb_rating": null}