{"id": 534302, "slug": "lamentable-soccer-c64", "name": "Lamentable Soccer (C64)", "name_original": "Lamentable Soccer (C64)", "description": "Lamentable Soccer<p>Bend it like Beckham with this free-kick mini-game. You have 20 shots to score as many points as possible. Points are awarded for goals scored, the closer to the targets in the net the more points are scored, up to 120 per shot. </p>\n<p>This game was written over a weekend for the C64 Cassette 50 charity competition, where all code and data has to reside below $1000 in memory. Playable in the browser only until the competition is over.</p>\n\r\nControls\r\n<ul><li>To aim, wait for the moving ball to be in the right position and then hold fire (Z)</li><li>The longer you hold fire, the more power is added </li><li>Adjust the height of the shot by also holding back on the stick (down arrow) </li><li>Release the fire button to shoot</li><li>When the ball is in the air, pull left or right to add swerve</li></ul>\r\nTips\r\n<ul><li>The game is definitely tricker with keys than a joystick! But practice will be rewarded.</li><li>Between 0.5 seconds and 2 seconds should provide enough power depending on your distance to the goal. </li><li>If you are close to goal, loft will need to be added almost immediately to get over the wall.</li><li>If you are far away, loft may only be required for around a half of the power phase</li><li>Use aftertouch to get the ball around the wall or end up closer to the target</li></ul>\n\n<p>I wanted to have the wall jumping so you could try and place a low shot under them, and balls going in off the post or bar, but simply ran out of memory. Very early on there were goalkeeper sprites too but the memory they took up and the code needed for the AI made that a non-starter. <br/><br/>And yes, I'm still looking for the cause of a bug where the ball sometimes shoots off at a crazy speed and angle. Answers on a postcard!</p>", "metacritic": null, "released": "2020-12-21", "tba": false, "updated": "2020-12-21T03:09:10", "background_image": "https://media.rawg.io/media/screenshots/950/95028d4a8e98ff9a62f5afb49e18c196.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 27, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Arlasoft"], "genres": ["Sports"], "publishers": [], "esrb_rating": null}