{"id": 53446, "slug": "need-for-speed-underground-2-2", "name": "Need for Speed: Underground 2", "name_original": "Need for Speed: Underground 2", "description": "<p>Need for Speed: Underground 2 is a cross-platform racing video game and the eighth installment in the popular Need for Speed driving game series published and developed by Electronic Arts. Released in 2004, it is the direct sequel to Need for Speed: Underground, and is part of the Need for Speed series, available on Microsoft Windows, Game Boy Advance, GameCube, PlayStation 2, Xbox, PlayStation Portable, Nintendo DS and mobile phones. Like its predecessor, it was also commercially successful, breaking sales records in the United Kingdom.<br />\nThe game entails tuning cars for street races, resuming the Need for Speed: Underground storyline. Need for Speed: Underground 2 provides several new features, such as a broader customization, new methods of selecting races, the &quot;explore&quot; mode (similar to the Midnight Club series, in a large city known as &quot;Bayview&quot;). The City Center was based on Philadelphia, Beacon Hill was based on Beverly Hills and Coal Harbor was based on Camden, New Jersey, and Bayview as a whole is a microcosm of the west coast of the United States. Underground 2 also introduces several SUVs, which could be customized as extensively as other Underground 2 vehicles and used to race against other SUV racers. Brooke Burke is the voice of Rachel Teller, the person who guides the player throughout the game.<br />\nThe game has been ported to PlayStation Portable, under the title of Need for Speed: Underground Rivals. The Nintendo DS port introduces a new feature in which the player is able to design custom decals to adorn any vehicle in the game.</p>", "metacritic": 82, "released": "2004-11-09", "tba": false, "updated": "2024-04-22T22:22:30", "background_image": "https://media.rawg.io/media/games/dc6/dc68ca77e06ad993aade7faf645f5ec2.jpg", "website": "", "rating": 4.4, "rating_top": 5, "added_by_status": {"yet": 31, "owned": 389, "beaten": 1246, "toplay": 43, "dropped": 329, "playing": 18}, "playtime": 46, "achievements_count": 0, "ratings_count": 1155, "suggestions_count": 295, "game_series_count": 25, "reviews_count": 1160, "platforms": ["Nintendo DS", "PC", "PlayStation 2", "Game Boy Advance", "Xbox", "GameCube"], "developers": ["Electronic Arts Canada", "Electronic Arts Black Box", "Pocketeers"], "genres": ["Racing", "Arcade"], "publishers": ["Electronic Arts"], "esrb_rating": "Teen"}