{"id": 534598, "slug": "snowb4ll-fight", "name": "Snowb4ll Fight", "name_original": "Snowb4ll Fight", "description": "Credits:\r\n<ul><li><strong>Code + Art: Mig Moog<br/></strong></li><li><strong>Music + SFX: sodadreamer1999<br/></strong></li><li><strong>Cover Art: DrawlTT</strong></li></ul>\n<p><strong>THIS IS A 2 PLAYER GAME<br/></strong></p>\n<p><em><strong>How to play</strong></em>:<br/></p>\n<p>Each player has a set of 3 actions, to throw a snowball, build up a wall, or gather snow. These are performed by clicking the action button with a mouse. Once you perform these actions your turn switches, and you must hand the mouse to the next player. Each player also starts with 4 snow. Below is a list of your actions:<br/></p>\n<p>:: Throw ::<br/>When throwing a snowball a 1 &amp; 2 will appear on screen, allowing you to apply 1 or 2 damage to your snowball, and by proxy subtracting those amounts from your snow. There's also a small chance every turn that a golden 3 will appear, which does 3 damage and doesn't cost any snow. After clicking the 1 or 2, click the character from your opponent you want to hit, and your turn will end.<br/></p>\n<p>:: Build ::<br/>The walls in front of each character defend them from snowballs. If a snowball hits a wall, it will decrease the walls amount. If the snowball's damage is greater than the wall's height, then the left over damage will hurt the player. Like throwing, you have an option between 1 or 2 snow, and a chance for a golden 3 to appear. Each wall has a maximum of 4. After clicking the amount, click one of your piles to build them, and your turn will end.<br/></p>\n<p>:: Gather ::<br/>This increases a player's pile by 1, this will be the only move a player can make if their snow amount is 0.<br/></p>", "metacritic": null, "released": "2020-12-20", "tba": false, "updated": "2020-12-21T04:16:09", "background_image": "https://media.rawg.io/media/screenshots/6a1/6a1465ac5705f7c03b27ef61c5900882.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 18, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Mig Moog"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}