{"id": 534578, "slug": "crawlers-manor", "name": "Crawler's Manor", "name_original": "Crawler's Manor", "description": "<p>You are trapped inside the Crawler's Manor, a home of a strange monster that helds you inside!</p>\n<p>This monster wanders from room to room, checking that everything is okay. The only way to escape is hiding from it inside the rooms or disguising you as a furniture piece!</p>\n<p>You have to press the transform button (right click) to disguise randomly into a piece of furniture that fits into the room you're hiding, or instead the monster will find you and return you to the spawn point. You can't move while disguised, but you can transform into another object.</p>\n<p>If you want to return to your original look, press the action button (left click) and continue searching the exit, your girlfriend is waiting out for you! (She was supposed to help you on your way out, but overplanning left her only on the ending screen, lol).</p>\n<p>This game was made for konata-chan404, for Secret Santa Jam 2020. We hope you really like it! There are some mechanics we had to remove because there was no time left, but we'll try to add the missing content these next weeks. :-)<br/></p>\r\nCredits (alphabetically):\r\n<ul><li>Adrián Cortés (@acortes_music): Music, SFX.</li><li>Eli SP (@Eliimperio1): Illustration, sprite, tiles and game design.</li><li>Enrique AM (@Zurullin): Software development, game design and letter sending to giftee.</li></ul>\r\nFont credits:\r\n<ul><li>Title: XAyax (https://www.1001fonts.com/xayax-font.html).</li><li>Menu: Lansbury FG (https://www.1001fonts.com/lansbury-fg-font.html).</li><li>Credits: Special Elite (https://www.fontsquirrel.com/fonts/special-elite).</li></ul>", "metacritic": null, "released": "2020-12-20", "tba": false, "updated": "2020-12-21T04:12:28", "background_image": "https://media.rawg.io/media/screenshots/392/39221869674dc92800501526a45b7ed4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 38, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Enrique AM"], "genres": [], "publishers": [], "esrb_rating": null}