{"id": 534620, "slug": "game-783", "name": "2048+", "name_original": "2048+", "description": "A small and simple but challenging game!\r\n<p>This game is based on the classic 2048 browser game and its simple ruleset yet very challenging puzzle aspect.</p>\n<p>Play either the traditional mode the game is known for or try yourself in one of the extra levels where the playfield changes and challenges you to rethink your approach to reach the final piece: 2048.</p>\n\r\nHow to play:\r\n<p>Use your Arrow key to slide all pieces in one direction. If a piece would hit another with the same number they combine their values into one.  The goal is to reach a piece with the number 2048.</p>\n<p>After you took a move in one direction, a random amount of pieces will spawn on the opposite site. For example after pressing the right arrow key you will find new pieces spawned in at the left most column.</p>\n<p>You lose if no possible action would result in a piece moving, spawning in or result in two pieces combining. Good luck!</p>\n\n<p>Note that this game does <em>not</em> use the same odds and algorithms to spawn in pieces as the classic 2048 game does.<br/></p>\n<p>This game was developed, programmed and designed by Sundiray with the help of Texture Assets from the Unity Asset store and taking inspiration from the classic game 2048.</p>\n<p>My intention of this project was to further improve as well as challenge my knowledge of the Unity game engine, my C# capabilities and get in first testing of various self developed tools for the Unity Editor.<br/></p>", "metacritic": null, "released": "2020-12-20", "tba": false, "updated": "2020-12-21T04:20:51", "background_image": "https://media.rawg.io/media/screenshots/c2c/c2ce40d2d332cc50614d576d8d3e4180.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Sundiray"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}