{"id": 53460, "slug": "phoenix-wright-ace-attorney-justice-for-all-4", "name": "Phoenix Wright: Ace Attorney − Justice for All", "name_original": "Phoenix Wright: Ace Attorney − Justice for All", "description": "<p>Phoenix Wright: Ace Attorney − Justice for All is a visual novel adventure video game developed and published by Capcom. It was originally released for the Game Boy Advance in 2002 in Japan, and has since been released on multiple platforms. The Nintendo DS version, initially released in 2006 in Japan, was released in English in the West in 2007. The game is the second entry in the Ace Attorney series, following Phoenix Wright: Ace Attorney.<br />\nThe story follows Phoenix Wright, a defense attorney who defends his clients in four episodes. Among other characters are his partner Maya Fey, her cousin Pearl, and the rival prosecutor Franziska von Karma. The game is divided into two types of sections: courtroom sessions, where the player cross-examines witnesses and tries to uncover contradictions in their testimonies; and investigations, where the player gathers evidence and talks to witnesses.<br />\nThe game was directed and written by Shu Takumi, as the second entry in a planned Ace Attorney trilogy. It was originally intended to feature the first game&#39;s prosecutor, Miles Edgeworth, in all episodes; Franziska was created when the development team learned that Edgeworth had become popular among players, and Takumi wanted to use the character more carefully and sparingly. They only introduced one new gameplay mechanic in the game; Takumi wanted to keep the game focused on the core concept of finding lies, and to keep it simple enough for his mother to play. The game was positively received by critics, who generally liked the writing, but criticized the game&#39;s short length and the lack of the Nintendo DS-exclusive gameplay mechanics that appeared in the previous game.</p>", "metacritic": 76, "released": "2002-10-22", "tba": false, "updated": "2024-03-10T17:18:02", "background_image": "https://media.rawg.io/media/games/862/86283a28784f6a24d35b5bbb3ab3b4a8.jpg", "website": "", "rating": 4.43, "rating_top": 5, "added_by_status": {"yet": 22, "owned": 42, "beaten": 247, "toplay": 28, "dropped": 11, "playing": 7}, "playtime": 0, "achievements_count": 0, "ratings_count": 167, "suggestions_count": 218, "game_series_count": 5, "reviews_count": 169, "platforms": ["iOS", "PC", "Nintendo 3DS", "Nintendo DS", "Wii", "Android", "Game Boy Advance"], "developers": ["Capcom Production Studio 4"], "genres": ["Adventure"], "publishers": ["Capcom"], "esrb_rating": "Teen"}