{"id": 534742, "slug": "eggimals", "name": "Eggimals", "name_original": "Eggimals", "description": "<p><strong>Keep your egg happy and see what might hatch! Thanks for playing! </strong></p>\n<p><strong>This game was created for the Godot Wild Jam #28</strong></p>\r\nTutorial:\r\n<p><strong>Essential tip: </strong>To hatch an egg you must satisfy all 3 of its requirements! A heart will appear for each requirement you are fulfilling.</p>\n<p>1) Read your egg's preferences by clicking on the piece of paper</p>\n<p>2) Adjust the temperature by clicking  the lightbulb's chain</p>\n<p>3) Adjust the moisture by clicking the spray bottle, then the egg</p>\n<p>4) Click the red button on the radio to turn it on, and click the triangle keys to find the station that sounds like the correct genre. Be careful, the stations seem to change!</p>\n<p>5) Monitor your egg's progress by clicking the flashlight, then the egg</p>\n<p>Congratulations, you've hatched your first eggimal! You can view your collection and watch them play by selecting \"Eggs\" from any menu.</p>\r\nDevelopment:\r\n<p>As a team of two, this marks the 2nd game jam and 2nd game we've made! Although we're still learning, things generally went much smoother because we had an idea of how we were going to accomplish our vision.</p>\n<p>Speaking of our vision, with the smaller time period given by the Godot Wild Jam we were aiming to create something simpler. When  \"egg\" was unveiled as the theme we decided to create a hatching simulator that is also somewhat of a management- style game. Thinking of ways to appease a very needy egg, we came up with 3 requirements that we could feasibly implement within the deadline: temperature, humidity, and music preference. Also, we wanted the player to be able to 'candle' the egg to see its growth and progress! </p>\n<p>But, who cares about the hatching process if you don't have a compelling creature to hatch? Then came the ultra cute, animal/fruit/vegetable fusion idea :). Needless to say, we are really proud of our 6 launch-day eggimal species. </p>\n<p>We're still testing different ways to make the game more fun and repeatable (besides adding more species of course). Perhaps varying the number of requirements an egg could need (a pseudo difficulty level), adding a way to 'play' with your eggimals in the Eggs scene, or even managing six different incubators at once! We'd love to hear your ideas and feedback! Thanks again for playing our game!</p>\r\nCredits:\r\n<p>Code &amp; Title Music: Kyle</p>\n<p>Art &amp; Sound : Zach</p>\n<p>Radio Music: PlayOnLoop.com, Bensound.com, Musopen.org</p>\n<p>Raw SFX: Freesound.org</p>\n<p>Fonts: FontMeme</p>\n\r\nBugs:\r\n<p><strong>-</strong> Radio may or may not be shuffling its songs correctly</p>\n<p>- Audio is glitchy in the html5 version :(</p>\r\nUpcoming Features:\r\n<p>- More eggimal species!</p>\n<p>- Different types of eggshells</p>\n<p>- Elements for eggimals to interact with in the Eggs scene</p>\n\n<p>note: the Linux and MacOS/OSX builds are untested as we don't have those systems! Please let us know if you experience any issues.</p>", "metacritic": null, "released": "2020-12-20", "tba": false, "updated": "2020-12-21T04:48:22", "background_image": "https://media.rawg.io/media/screenshots/aa7/aa77c78fff1a232fed7d8693717c0c0f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 97, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Android", "Web"], "developers": ["Studio Haiku"], "genres": ["Strategy", "Simulation"], "publishers": [], "esrb_rating": null}