{"id": 534800, "slug": "mint-rabbits-part-time-waffle-job-vr", "name": "Mint Rabbit's Part-Time Waffle Job VR", "name_original": "Mint Rabbit's Part-Time Waffle Job VR", "description": "<p>Just in time for Christmas, serve up eggs, bacon, and southern instant grits in a hectic diner.  Room scale SteamVR is required, and, as I only have a Vive, that's all that's officially supported. The Index knuckles and the Oculus Touch controllers should work out of box, but I haven't thoroughly playtested them yet. I'm actively adding support for more controllers and headsets. Additionally, standing only and sitting are not supported. I have an optional \"bunny hop\" teleport control, so if SteamVR has allowed you to complete the setup wizard for room scale, then you meet the minimum requirements. The recommended requirements to play without teleport is about 6' by 10'. The game was designed this way because my intent was to  create a really fun room scale experience which makes use of VR's strongest point, that you can walk around by actually walking around.<br/></p>\n<p>This was made almost entirely by me, with unbelievable support from my friends. I also got help from a pal, who made a few models for me, in exchange for giving him a few Blender tips and advice. And my boyfriend, heck- he did make the music! He crunched, too! An all-nighter! You better believe I'm thankful...<br/></p>\n<p>I started this project in late August and decided to release it in time for the Xmas holiday. There's nothing of any particular religion in here, but there is a decorated tree. A banner in the store just reads \"holidays.\" I hope that doesn't upset anybody! I just like Christmas a lot. Presents! Candy, food, and a bit of hard eggnog... The game will be de-holidayed after new year's, so you can enjoy it year round.<br/></p>\n<p>I'm asking for a minimum price because I put a heck ton of effort into it, about half a year's work, and I do want to improve on it further and publish on Steam itself at the $9.99 price mark. If I do end up going for that, I will update the price here to better match Steam, and anybody who already has it on itch will get access to the update for free. If not, the game will get any bugfixes that are sent to me and remain in its current state, albeit without holiday decorations. I want some time to decide what my next course of action is, as an individual developer and new business owner.</p>\n\n<p>Credits:</p>\n<p>https://twitter.com/Mnesia3 did the music, and threw everything in the ring at the final moments of the project! Thank you! &lt;3<br/></p>\n<p>https://twitter.com/RealMrBlue helped me make a few of the models. He provided amazing moral support as well, so a big shout out to him. I wouldn't have made it here without that.</p>\n<p>A pink furry of some description sent me a recording of her saying \"coffee.\" She wishes to remain anonymous simply because it's more fun that way.<br/></p>", "metacritic": null, "released": "2020-12-18", "tba": false, "updated": "2020-12-21T05:04:18", "background_image": "https://media.rawg.io/media/screenshots/826/82644ebb4e7387cc1c6413f35b40d62b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 78, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Tatrabbit"], "genres": ["Action", "Simulation"], "publishers": [], "esrb_rating": null}