{"id": 534966, "slug": "corridor-lu_bu", "name": "Corridor (Lu_Bu)", "name_original": "Corridor (Lu_Bu)", "description": "<p>This game was made as part of the <strong>Secret Santa Jam 2020</strong> - Based of a letter I received by <strong>PhilippeZ</strong>:</p>\n<p><em>\"Dear Santa,<br/></em></p>\n<p><em>Hi! Im a computer graphics and animation student, but my great passion is game developpment. Recently I've been really interested by the og doom for dos, it's just the general aesthetic and mechanics of a bygone era. I'm also really into jrpgs, but will just about any genre of games, excpect very fast pace games, because I have really bad motion sickness lol. I'm a windows user, but you can just send a unity or godot file and I could play it like that (please feel free to use any means to make the game, doesn't have to be unity or godot). Have fun during this jam and have a great day!</em></p>\n<p><em>Love, PhilippeZ\"</em></p>\n<p>I wanted to make a game with the movement and <em>aesthetics of an 90's shooter, but combine it with something turn-based. </em>Unfortunately, I didn't manage to get in all the stuff I had planned, but i'm still happy with the result, because it was fun to make, and I learned a lot during the process.</p>\n\n<p><strong>Story:</strong></p>\n<p>In corridor, you stole some important files from an secret data center and you need to reach the end of the facility. The security system got activated and deadly drones will attack you. Try to survive all encounters and reach the final corridor.</p>\n\n<p><strong>How to play:</strong></p>\n<p>You and your enemy have their own deck of cards. They contain, attacks, buffs and other useful things. </p>\n<p>Your cards are also your Health. If you can't draw any more cards, you get caught and the game is over. Try to deplete the enemy's deck, before you run out of cards. </p>\n<p>All battles are turn based. Each draws 3 cards and plays 1 - The rest of your hand gets discarded. The played card gets removed from the game. After each battle, you get your discarded cards back and receive random cards as loot.</p>\n<p>Attack cards will target random cards in the opponents draw pile. If the attack value is higher then the defense value of that card, the card gets destroyed and deleted from the game. If not the card will block this attack. Some attacks will attack multiple cards. </p>\n<p>All these values can be buffed with different cards. You can also heal yourself and get some cards back from your discard pile. </p>\n<p>I know, this is complicated and I didn't manage to implement a tutorial. I'm sorry for that. If you have any questions, please leave a comment.</p>\n<p>Have fun :)</p>\n\n<p><strong>Controls:</strong></p>\n<p>WASD/Arrows - walk</p>\n<p>Mouse - Look</p>\n<p>Play card - LMB</p>\n\n<p><strong>Credits:<br/></strong></p>\n<p>Sounds: Freesound.org</p>\n<p>Music by Alexandr Zhelanov (l<strong>icensed under</strong> CC BY 4.0)</p>", "metacritic": null, "released": "2020-12-19", "tba": false, "updated": "2020-12-21T05:41:35", "background_image": "https://media.rawg.io/media/screenshots/772/7720f4460b783bbb4c53c33ab01d1390.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 16, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["Lu_Bu"], "genres": [], "publishers": [], "esrb_rating": null}