{"id": 535079, "slug": "brain-training-tricky-puzzle-move-the-block", "name": "Brain Training: Tricky Puzzle - Move the Block", "name_original": "Brain Training: Tricky Puzzle - Move the Block", "description": "<p>Don't worry if you are feeling bored, Download the Tricky Puzzle and kick out the boring moments from your life! Test you brain abilities with Move Block puzzle and sharpen your problem-solving skills.<br/>A lot of colored blocks are given in the puzzle and you have to arrange them in an order so that all the blocks make room for primary red block so it can easily pass through the goal. You can move the blocks in different directions. Vertical positioned blocks can only be moved vertically and horizontally placed blocks can be moved horizontally. Arrange them in correct order and help your red block to reach you to the next levels.<br/>Improve your cognitive &amp; problem-solving skills with Move Block game. The game is tiny in size but mighty in puzzles. Exercise your brain with unlimited puzzles and levels. Choose from 5 challenging modes; Easy, Medium, Advance, Hard and Expert. A family-friendly game; suitable for all ages.</p>\n<p>Unblock the red block and get it out of the board by sliding the blocks that are in the way - free sliding game that provide you entertainment in your free time.</p>\n<p>Slide the blocks according to their sliding orientation and make a clear way for red block. Trying to find the optimum moves will get you hooked on this brain exercise.<br/>Enjoy puzzles and keep your mind sharp!<br/>Some stages are particularly difficult, we want players to think more.<br/>If there is a difficult level, you can use the hint button to get the solution.</p>\n<p>There are many levels to play organized in packages with different difficulties. Whether a beginner or already an expert, our hint option can guide you to solve each level.</p>\n<p>We have taken care of polishing the graphics for you, with smooth tiles that seems to resemble wood and music to relax you and enable your mind to find the logical solution with minimum movements.</p>\n<p>Solve more and more levels to unlock more exciting levels and share the game with your friends. If you like the mind games you will love this free sliding puzzle. You just have to think and find the solution.</p>\n<p>Move Block Game- Block puzzle, sliding game with blocks is a free game with in-game advertising. Like a free Move Block game, it gives you access to hundreds of free levels.<br/>Yes, all our levels are solved by correctly sliding the blocks. You have a red block that must be taken out of the board. Think well and unblock it.</p>\n<p>Features<br/>- Slide the blocks vertically or horizontally!<br/>- Addictive puzzles!<br/>- Prove your skills in hardcore challenges!<br/>- Multiple Difficulty levels!<br/>- Select your difficulty category!<br/>- User Friendly Interface!<br/>- Hundreds of puzzles.<br/>- The game supports English.<br/>- Hints are available if you are stuck!<br/>Stop reading and download the amazing and entertaining Tricky Puzzle to jump into poll of enjoyment.</p>\n<p>Privacy Policy<br/>We built this game as an Open-Source app. This SERVICE is provided by at no cost and is intended for use as is.<br/>This page is used to inform visitors regarding my policies with the collection, use, and disclosure of Personal Information if anyone decided to use my Service.<br/>If you choose to use my Service, then you agree to the collection and use of information in relation to this policy. The Personal Information that I collect is used for providing and improving the Service. I will not use or share your information with anyone except as described in this Privacy Policy.<br/>The terms used in this Privacy Policy have the same meanings as in our Terms and Conditions, which is accessible at Warranty unless otherwise defined in this Privacy Policy.<br/>Information Collection and Use<br/>For a better experience, while using our Service, I may require you to provide us with certain personally identifiable information. The information that I request will be retained on your device and is not collected by me in any way.<br/>The app does use third-party services that may collect information used to identify you.<br/>Link to privacy policy of third-party service providers used by the app.<br/> <br/>Contact Us<br/>If you have any questions or suggestions about my Privacy Policy, do not hesitate to contact me at (ivanbaranasic33@gmail.com).</p>", "metacritic": null, "released": "2020-12-19", "tba": false, "updated": "2020-12-21T06:10:01", "background_image": "https://media.rawg.io/media/screenshots/7d4/7d4c84253059e377b9949553b4b458ac.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 45, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Free Games And Fun"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}