{"id": 535126, "slug": "pengi", "name": "Pengi", "name_original": "Pengi", "description": "Pengi finally gets a chance to fulfill their dream. To do so, they have to convince others to give up something...\r\n<p>Pengi is an interactive fiction interfic about Pengi the penguin working for real estate.<br/>Will Pengi get to convince the mall folks to hand out their stores?</p>\nShortcut to play in browser\n<p>\r\nYou can watch our trailer by clicking this link (YouTube).\r\n<br/>\n</p>\n<p>This was a group project made for STS 350.</p>\n\n<p>You can play the game in Windows (best resolution) by downloading the files here.<br/>\r\nOr you can it on your browser by clicking the download button besides \"Play in browser\". Trust us, it won't download anything. It will send you to github pages.\r\n</p>How to play\r\n<ul>\n<li>\r\nYou can right click, use the spacebar, or use the enter key to move through the dialogue. \r\n</li>\n<li>\r\nWe recommend, before making a big decision, to save! You can do so by clicking the hamburger button on the bottom right, \r\nclicking a save slot, and saving! So easy WOW. \r\n</li>\n</ul>\n\n<ul>\n<li>Note: You can only start saving after reaching a save point.</li>\n<li>You can also access the main menu by clicking the little option on the bottom as well.</li>\n<li>On the main menu you can access previous saves, access the options or start a new game. \r\nOptions enables you to change text size, speed, and font, remove text formatting, change the volume and \r\ndisable the screen shakes and flashes.</li>\n</ul>\r\nGreen Tea-m\r\n<p>\n</p><p>This game was developed by Green Tea-m.</p>\n<ul>\n<li>EJ Meneses</li>\n<li>Liv McRobbie (Musician)\r\n<ul>\n</ul></li>\n<li>Nicole Chik (Artist)\r\n<ul>\n<li>Instagram</li>\n<li>ArtStation</li>\n</ul>\n</li>\n<li>Ohi Ahimie</li>\n<li>Samadhi Ranatunga</li>\n<li>Allan Manuba</li>\n</ul>\r\nKnown bugs\r\n<p>This is a Unity bug, and can only be fixed by Unity themselves. If you do two of these things at the same time, <br/>the game can freeze:</p>\n<ul>\n<li>Left clicking</li>\n<li>Pressing enter</li>\n<li>Pressing the spacebar</li>\n</ul>\n<p>For example, if you left click and press enter at the same time, the game will freeze. You can mash left click, <br/>and the game won’t freeze. You can alternate between left clicking, and pressing the spacebar, and the game won’t freeze.</p>\r\nWhy is the game on Github pages?\r\n<p>Whenever we host the game on itch, we can't seem to retain our save data on Google Chrome. It seems to be an itch glitch.</p>\n<p>Here's the link to the issue in question.</p>\r\nSource code\r\n<p>Check out the source code at: github.com/GreenTea-M/ProjectPengi</p>\n<br/><br/><br/><br/>", "metacritic": null, "released": "2020-12-19", "tba": false, "updated": "2020-12-21T06:20:25", "background_image": "https://media.rawg.io/media/screenshots/acf/acf337874c982e669cc708b163d9552a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 64, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["TurnipXenon", "nicklejoesc"], "genres": [], "publishers": [], "esrb_rating": null}