{"id": 535217, "slug": "squibblies-3", "name": "Squibblies 3", "name_original": "Squibblies 3", "description": "<p>From The New Dimension comes \"Squibblies 3\". The final in the Squibblies series. The game originally made for the Official C64 SEUCK Compo 2019. Now it feature cool enhancements to make game play more challenging and fun. This new version of the game features the following:<br/><br/>- Loading bitmap<br/>- New front end with hi-score table<br/>- New score panel<br/>- Background animation<br/>- Full enemy explosion<br/>... and a few other features to enhance the game play slightly<br/><br/>You are Squibblies. A green squelchy thing from another world. Your family have been captured and left stranded in strange places. Your task is to rescue your family. Be warned, you will not be alone.  You will encounter stange and bizarre enemies, including birdies, killer balls, globs, buzzsaws, poop monsters, giant slugs and a few other nasty enemies. You can use your giant slime balls and destroy the baddies.  Some enemies will require one hit.<br/><br/>During your quest, you will encounter locked cages. Release the cages to rescue your villagers. These will boost the amount of slime you can throw.<br/><br/>Can Squibblies save all of his family members, or will he become the next captive? <br/><br/>Good luck, and have fun.<br/></p>\n<p>Game design, graphics, sound effects and music by <br/><strong>Richard Bayliss<br/></strong></p>\n<p>SEUCK Redux Framework by<br/><strong>Martin Piper<br/></strong></p>\n<p><strong>(C)2019 The New Dimension</strong><br/></p>\n<p>This is free software and may be copied for free. No part of this production may not be sold digitally or commercially. <br/></p>", "metacritic": null, "released": "2020-12-18", "tba": false, "updated": "2020-12-21T06:42:00", "background_image": "https://media.rawg.io/media/screenshots/12d/12d271f9d42f78f946d6edf257525e85.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 79, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Richard of TND"], "genres": [], "publishers": [], "esrb_rating": null}