{"id": 535366, "slug": "coffeed-19", "name": "Coffeed-19", "name_original": "Coffeed-19", "description": "<p>You and your friends need to save a town and their citizens from a horrible virus called Coffeed-19.</p>\n\n<p>This is very much in \"pre alpha\", if even. </p>\n<p>Coffeed-19 is a multiplayer coop racer shooter. You are paramedics in a Coffeed-19 infected town. At game start, there is only one infected citizen. But whenerver he gets close to a healthy citizen, it will spread the desease. </p>\n<p>Your job is to drive around in your ambulance and vaccinate the infected, to heal them and turn them back into healthy citizens. </p>\n<p><strong>How to run</strong><br/></p>\n<ol><li>Extract the .zip directory </li><li>Run \"GDD1_COVID_GAME.exe\"</li></ol>\n<p><strong>How To Play<br/></strong></p>\n<p>As mentioned, this is a multiplayer game. Multiplayer is available only peer to peer. So all players either need to be on the same network, or the server needs to be publicly available (port fowarding, see section bellow).</p>\n<p>To play, start the app (GDD1_COVID_GAME.exe) and select \"Host (Server + Client)\", this will start a local server and connect to it, so you can start playing solo, or let your friends connect</p>\n\n\n<p>A second player (or yourself, with a second instance of the programm) can join by entering the ip address of the host machine in the text field and pressing \"client\". </p>\n<p>On a local network, or even the same machine, this should work out of the box. </p>\n<p><strong>Port forwarding<br/></strong></p>\n<p>If you want to play with your friends over the internet, you will need port 7777 on the server machine exposed to the internet. For most home-users this means: Configure your router to forward connections to <local ip=\"\" server=\"\">:7777 <br/></local></p>\n<p>You then need to find our your pulbic IP address (just google \"my ip\"). Others can then join you by entering this public IP in the text field and starting as Client. </p>\n<p>Warning: Port forwarding will expose your machine, and thus our game code to the internet. This brings significant security risk! Our app is at this point most probably not secure at all. Do this at your own risk, or stay on a local network/use VPN services like Hamachi. <br/></p>\n\n<p><strong>Controlls</strong></p>\n<p>Drive your ambulance with WASD or Arrow keys and boost speed with Left-Shift.</p>\n<p>Shoot syringes with \"P\" or Right-Click<br/></p>\n<p>Shoot masks with \"O\" or Left-Click, they reduce the radius of the infection range<br/></p>\n\n<p><strong>How to win<br/></strong></p>\n<p>There is no win condition as of now. But if you manage to vaccinate all the infected, you can view that as a victory ;) </p>\n<p><strong>Known bugs<br/></strong></p>\n<p>Plenty :) </p>\n<ul><li>Only host is able to vaccinate infected<ul><li>This is a networking issue we will fix very soon!</li></ul></li><li>Falling through the map: yes, we havent added all the coliders yet, you will definetly be able to fall through the map. Stay on the streets/sidewalks, they work! </li></ul>\n<p><strong>Future plans<br/></strong></p>\n<p>Start by fixing the known bugs. Then implement a win condition, multiplayer lobby and scoreboard. From there, lets see where the journey takes us ;) <br/></p>", "metacritic": null, "released": "2020-12-18", "tba": false, "updated": "2020-12-21T07:21:30", "background_image": "https://media.rawg.io/media/screenshots/1c8/1c87435e1d0630b7f418b0b81834578f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 10, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["groupfiffteen"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}