{"id": 535331, "slug": "spooky-chase-burning-goat-studio", "name": "Spooky Chase (Burning Goat Studio)", "name_original": "Spooky Chase (Burning Goat Studio)", "description": "The Ultimate Platformer Challenge\r\n<p><strong>Spooky Chase</strong> is without a doubt a <strong>challenging</strong> experience. The unique aspect of the game relay on the fact you create your enemy's movement. Creating a new experience for 2D platform games.</p>\n<p>Every year we play scary games for the Halloween season. Running away from monsters, zombies, ghosts, and the list goes on. <br/>This time, you gonna run away from your own past. Watch out for every step you made and <strong>don't give up</strong>  if it has some one who can defeat you, it is <strong>you</strong>.</p>\r\nYour Adventure:\r\n\n<p>You are your enemy! In Spooky Chase, every movement you made towards the flag are recorded and than, replicated by the monsters. For more flags you collect, more enemies will show on the map!<br/></p>\n\n\n<p>It can't be a Halloween game without costumes! Collect all the candies to unlock many costumes to use in your adventure! <br/></p>\n\n\n<p>So you beat the stages on campaign? Time to reach that right score! On Endless Mode you can choose your favorite stage and try to collect many flags as possible!</p>\n\n\n<p>How about play with your friends in a total chaotic game mode? On Multiplayer you can play up to 4 players Local and see who survives at the end!</p>\n<p>Get the flags, run for your life... And from yourself!</p>\n<p>You are a blissful child taking part in a capture the flag championship in exchange for treats, until something terrifying starts to happen...</p>\n<p>No matter how much you run, monsters chase after you mimicking your every move!</p>\n<p>Grab the flags, escape the monsters and find out what's behind this great mystery!</p>\n\n<p><strong>Social Media:<br/></strong>Twitter<br/>Facebook <br/>Instagram<br/>Youtube</p>", "metacritic": null, "released": "2020-12-18", "tba": false, "updated": "2020-12-21T07:13:41", "background_image": "https://media.rawg.io/media/screenshots/292/292d1d787ec49c624340248e391a179e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 223, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Burning Goat Studio"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}