{"id": 535568, "slug": "revel", "name": "Revel", "name_original": "Revel", "description": "Welcome to the best thing since Blackjack! Revel is a player-vs-house suit-based card game that is unlike any other. It was created for fellow mathematics enthusiasts and card game revellers who are looking for something fun and original. Unsolved at the time of publishing, will you be the one to solve the optimal strategy to this elegantly complex mathematical puzzle?<br/><br/>So just how complex is Revel exactly? One way to put it is this: a Texas Hold’em starting hand boasts 169 meaningful combinations, while a three-card initial deal of Blackjack comes in just shy of 550. In comparison, a three-card initial deal alone of Revel surpasses 2000 combinations!<br/><br/>Despite that, the concept is simple: have a hand of three to five cards that scores higher than the dealer’s hand of four cards. The fewer cards you choose to play with, the more you stand to win. The choice is yours! Pay close attention to the suits in your hand as they will be the key to how high you score.<br/><br/>You will be pleased to know that once you’ve got the game, you’ve got the game. There are no in-game purchases or subscriptions. If you run out of in-game credits, you can top up for free every few hours. <strong>NB THERE IS NO PLAYING WITH REAL MONEY</strong>. All you need in there is your brain, your guts and a dash of luck, and just maybe you might find yourself long and lost in revelry!", "metacritic": null, "released": null, "tba": false, "updated": "2020-12-25T02:37:16", "background_image": "https://media.rawg.io/media/screenshots/e97/e9702e69eeebd1ba61a3254ba48db48a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 44, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Tzar Leonardi"], "genres": ["Casual", "Indie"], "publishers": ["Tzar Leonardi"], "esrb_rating": null}