{"id": 535578, "slug": "abyssal-agent-alyss", "name": "Abyssal Agent Alyss", "name_original": "Abyssal Agent Alyss", "description": "Set in the world of Kate's Test https://store.steampowered.com/app/790260/Kates_Test/ <br/>Abyssal Agent Alyss follows the story of Alyss, a succubus working as a police officer for the Demon World Police Department.<br/>She is tasked with investigating a suspicious location in the human world that's been purchased by a notable crime family (of demonic origin),<br/>but upon arrival Alyss swiftly finds herself in trouble.<br/><br/>After being rescued by the infamous Phantom Thief Sylphy, the two team up to take down an illegal kidnapping ring, and thwart the traditional demons who want to return to the days of war and strife between humans and demonkind, where power and instinct rule, and the strong tramples the weak.<br/><br/>Though not all is as it seems... the corruption spreads far beyond just a simple crime family... they have connections in high places... <br/>Will they triumph? Or become victims themselves? Lost to lust...<br/><br/><br/><ul><li> A dark and demonic erotic RPG!<br/><br/></li><li> A lewd and lustful adventure!<br/><br/></li><li> 2 lovely protagonists!<br/><br/></li><li> A well built interconnected dungeon.<br/><br/></li><li> 6 lewd sex animations for when the characters are grappled in combat! (3 for each protagonist)<br/> <br/></li><li> Balanced combat with no grinding necessary.<br/></li></ul><h3>Characters</h3><br/><strong>Alyss</strong><br/><br/>Age: 22<br/>Bio: Graduated at the top of her class from the demon police academy. Alyss has been serving the DWPD for 2 years.<br/>With her trusty twin pistols (The pacifiers) she doles out justice to those that would harm society.<br/><br/><br/><strong>Phantom Thief Sylphy</strong><br/><br/>Age: 28<br/>Bio: A Phantom Thief known for targetting criminal organisations and corrupt politicians, and exposing their wrongdoings.<br/>As a master of unlocking, Sylphy uses a wide range of gadgets in her capers, such as her telescopic stunrods and grapple gun.<br/>Normally she'd wear a mask, but she seems to have lost it somewhere...", "metacritic": null, "released": "2020-12-21", "tba": false, "updated": "2020-12-25T02:43:09", "background_image": "https://media.rawg.io/media/screenshots/8fc/8fc2e87de9f24150274bfffee116efff.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 246, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Azurezero"], "genres": ["RPG"], "publishers": ["Azurezero"], "esrb_rating": null}