{"id": 535587, "slug": "quest-for-runia", "name": "Quest for Runia", "name_original": "Quest for Runia", "description": "In Quest for Runia you explore one of the most beautiful, spectacular and calming places in the universe - with gushing waterfalls, buzzing airships and glittering diamonds. <br/>Everything could be perfect, if there wasn’t that mean little wizard Karos, who has cast a spell over Runia. Karos needs Runia's beauty - its magic crystals - for his evil magic powers and wants to destroy Runia. <br/>Numerous cursed barriers block the way to the Castle of Karos. <br/>Help Runia to keep its beauty and free it from Karos and his evil magic by breaking all the barriers!<br/><br/>The gameplay is based on a mix of classic Match-3 and well-known bubble shooters.<br/>Each level is a three dimensional structure, built of cubes of different color. They resemble objects, like e.g. a fish, but also geometric interesting and hard to solve mazes. <br/><br/>You have to cast a new cube into the structure from the magic wand. If it creates a chain of three or more cubes of the same color, the cubes will pop.<br/><br/>In Runia there is no time limit, but you have a fixed number of shots to clear the 3D structure barriers. Your aim is to find the most effective way to solve the puzzle by destroying as many cubes as possible with one shot and clear the entire barriers.<br/><br/>Earn three stars in every level by finding the most effective way to finish it.<br/><br/>Dissolve the magic barriers blocking the way to defeat the evil mage Karos in this funny puzzle exploration bubble shooter!<br/><br/><strong>Features:</strong><br/><ul><li> Relaxing seated VR gameplay<br/></li><li> Seven beautiful environments<br/></li><li> 165 levels with various difficulty<br/></li><li> Steam achievements<br/></li><li> Special cubes with fun mechanics, e.g. <br/><ul><li> Bomb – removes all cubes in the explosion radius<br/></li><li> Lightning bolt – removes all cubes in one direction<br/></li><li> Slime cube – will spread slime to neighboring cubes<br/></li><li> …and many more!</li></ul></li></ul>", "metacritic": null, "released": "2020-12-31", "tba": false, "updated": "2020-12-25T02:49:45", "background_image": "https://media.rawg.io/media/screenshots/62f/62fc2c1811c60f9d866c65ad6c04dfe2.jpg", "website": "http://www.questforrunia.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 294, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Cykyria"], "genres": ["Casual", "Indie"], "publishers": ["Cykyria"], "esrb_rating": null}