{"id": 535660, "slug": "elrit-clover-a-forest-in-the-rut-is-full-of-danger", "name": "Elrit Clover -A forest in the rut is full of dangers", "name_original": "Elrit Clover -A forest in the rut is full of dangers", "description": "<p>2.5D puzzle actionIn the midst of the conflict, sisters Fortuna and Ellie are captured by the slavers.<br />\nDuring the wagon ride, Fortuna escapes her sister Ellie by taking advantage of a momentary lapse in the slavers&#39; minions.<br />\nTo seek help from Empire knights garrison which Fortuna belongs, and to escape from her pursuers, Ellie sets out for the dangerous forest of Erlit.<br />\nControl Ellie in this puzzle action game as she tries to find her way out of the forest.<br />\nEllie doesn&#39;t have the power to fight, so you&#39;ll have to run away from demonic beasts and use gimmicks in the forest to confront them.<br />\nYou can use controller in action part.A beautiful world expressed in 3D<br />\nThe forest is full of dangers and it&#39;s difficult to clear  on the first try.<br />\nHowever, even if you fail, you can resume right before, so it won&#39;t hurt the tempo.<br />\nYou can use the keyboard, but we recommend using the gamepad. A further evolution of the sex scene<br />\nThe camera can be operated freely at any time (free camera<br />\nAdjustable sound volume<br />\nYou can now also switch the camera sensitivity and inversion.<br />\nIt can also be used to change the visibleness of costumes, men, penis, and background accessories.<br />\nThe expression of fluids such as tears and semen has also evolved further.A highly flexible dress-up system<br />\nYou can set your clothes, hair color to eye color,  (At the time of release, there is only one type of clothing. We&#39;ll add more as we update.<br />\nThe combination patterns are endless!<br />\nAnd of course, you can control the character in any outfit you want.<br />\nIf it&#39;s popular, will you be able to customize it further in the update?</p>", "metacritic": null, "released": "2020-12-23", "tba": false, "updated": "2021-01-19T10:17:34", "background_image": "https://media.rawg.io/media/games/717/7175eaca8969c502a06910a6a1f376f7.jpg", "website": "https://ci-en.dlsite.com/creator/763", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 390, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["azucat"], "genres": ["Action"], "publishers": ["azucat"], "esrb_rating": null}