{"id": 535601, "slug": "kinesis-2", "name": "KINESIS", "name_original": "KINESIS", "description": "KINESIS is a new first-person single player puzzle platformer developed and brought to you by Cosmic Key. Delve deep within this new ancient sci-fi realm known as kinesis. Unravelling the mysteries behind these mysterious powers that were left behind by the ancestors. Adventure further into the world of Kinesis, solving puzzles based around that of kinetic energy itself.<br/><br/><strong>Key Features</strong><br/><br/><strong>Sphere from an unknown dimension</strong><br/>Using your powers, create a sphere from the energy of an unknown dimension. Cast this sphere and teleport to it, consuming its energy while moving with formidable velocity through the air.<br/><br/><strong>The Mark</strong><br/>You bear an ancient mark behind both hands. These marks give you unprecedented access to interaction with the environment you find yourself within. Objects compatible with this ancient mark will allow you to teleport, and even convert the velocity of these objects into your very being.<br/><br/><strong>Magnet</strong><br/>Strangely, this mark holds many secrets, allowing the utilisation of magnetism. This ability allows you to magnetise to the wall for a short period, allowing you to strategize your next jump/movement.<br/><br/><strong>kinE</strong><br/>The ancient marks on your hands hold even more power than one would believe, burning once you stop momentum abruptly due to the sheer volume of force this ancient mark can hold. You can almost feel the magnitude of momentum reflecting to yourself.<br/>Once absorbed and transformed into kinetic energy; it can be used to launch yourself into the direction you wish to travel.", "metacritic": null, "released": "2020-12-21", "tba": false, "updated": "2020-12-25T03:00:42", "background_image": "https://media.rawg.io/media/screenshots/89b/89baba195df352befe7faf982af08e77.jpg", "website": "https://www.cosmickey.co.uk/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 177, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Cosmic Key"], "genres": ["Action"], "publishers": ["Cosmic Key"], "esrb_rating": null}