{"id": 535676, "slug": "skinwalkers", "name": "Skinwalkers", "name_original": "Skinwalkers", "description": "SKINWALKERS is an experimental Horror Survival where you are given an open environment to explore and choose your own ending. You find yourself traveling along the Twin Peaks National Forest late in the night when suddenly your car gets thrown off course and off a cliff. Hurt but still able to walk, you find yourself lost in an ever changing forest where creatures known as Skinwalkers stalk and kill humans at late hours of the night. Can you find the right way out?<br/><br/>Features<br/>- Multiple Endings (SKINWALKERS currently features multiple endings and a few secret endings as well.)<br/><br/>- Interactivity with the Game Creator (Leave Comments on what YOU think should be the next Escape method and it may added to the game in future updates.)<br/><br/>- Free Story Gameplay (This game has a Nonlinear story and leaves the gameplay decisions entirely up to the player, you can make this a 1 hour game or a 5 hour game. Explore EVERYTHING!)<br/><br/>- Randomly Generated Forest Props and Escapes (SKINWALKERS features a Forest and Exit System that changes each time you Respawn)<br/><br/>- Challenge anyone to a Survival Run (Want to make the game more interesting? Grab some friends and see who can survive the longest and actually escape the forest. Makes for a scary Game Night!)<br/><br/>- Updates! (New Escape Route and Items every Update. If you want to add your own ending to the game, make sure to leave a comment!)", "metacritic": null, "released": "2020-12-24", "tba": false, "updated": "2020-12-25T03:45:35", "background_image": "https://media.rawg.io/media/screenshots/3ca/3ca690c72462d2b6bbb76c7311fdf369.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 150, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Luis R. Gamboa"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["BoneYard Crew"], "esrb_rating": null}