{"id": 535617, "slug": "physics-cake", "name": "Physics Cake", "name_original": "Physics Cake", "description": "Physics Cake is a 2-D physics simulation game where you can draw containers, objects, or anything you want really and put whatever chosen physical object you want inside of it. All the objects have different interactions that are designed to be fun and entertaining. <br/>\n<br/>\r\nPhysics Cake is similar to old “sand-like” games you would find online many years ago. <br/>\n<br/>\r\nPhysics Cake is designed to be fun and entertaining, like paint, but with basic physics. <br/>\n<br/>\r\nYou can also save your creations and simulations. You can easily share your simulations with anyone else by sharing your saved text files with them. Physics Cake supports steam cloud, so anything you have saved will be backed up to steam automatically when you exit the game. This way you can keep your creations across devices.<br/>\n<br/>\r\nThe game is easy to start and has built-in help descriptions for all the objects and basic functions by clicking the ? Or ?2 buttons in the game. <br/>\n<br/>\r\nPhysics Cake is currently in early access as we plan to add user suggestions, fix any bugs, improve stability, and in general make a fun open 2-D simulation game that can be entertaining for minutes or for hours.<br/>\n<br/>\r\nBelow is a list of all the objects currently in the game (most objects are able to be re-arranged after spawning by right-clicking and dragging the object as wanted): <br/>\r\nNone: nothing spawned on click (default)<br/>\r\nDelete: A red crossed through circle that deletes anything you touch with it.<br/>\r\nLine: A solid line to draw things with, or make containers.<br/>\r\nWater: A liquid ball of water.<br/>\r\nOil: A liquid glob of oil.<br/>\r\nSteam: Quick rising steam that evaporates.<br/>\r\nFire: It burns things, duh!<br/>\r\nWood: Wood blocks that act similarly to line (wood can be effected by other objects life fire).<br/>\r\nJello: Wiggly, jiggly jelly, bouncy and expandable.<br/>\r\nSpinner-R: Spins to the right like a singular fan blade.<br/>\r\nSpinner-L: Spins to the left like a singular fan blade<br/>\r\nVoid: A tiny black hole, anything sucked into it is deleted automatically (limit 1).<br/>\r\nClack: Clacker balls that are pinned to the spawn area<br/>\r\nGrass: Grass, can be watered to be grown. <br/>\r\nIce: Cubes of ice that freeze things and jiggle like real ice cubes.<br/>\r\nWater-SP: Endlessly spawns water objects from the chosen location.<br/>\r\nIce-SP: Endlessly spawns ice objects from the chosen location.<br/>\r\nOil-SP: Endlessly spawns oil objects from the chosen location.<br/>\r\nJello-SP: Endlessly spawns jello objects from the chosen location.<br/>\r\nSteam-SP: Endlessly spawns steam objects from the chosen location.<br/>\r\nE-SP: Endlessly spawns electron objects. <br/>\r\nKill Line: The standard object, but any physical objects that touch it are removed on contact.<br/>\r\nPulley: Two connected weights that make up a pulley system.<br/>\r\nSticky: Sticks to other physical objects. (limited to 125 instances on screen at once)<br/>\r\nCOLORED L BUTTONS: Produces the LINE object in the chosen color.<br/>\r\nEtron: Short for electron. Bounces randomly at high velocity. Not affected by void, wood, or ice, and can electrify objects on contact. <br/>\r\nDrag u: Drags any physical objects upwards that are below it.<br/>\r\nFire-SP: Endlessly spawns fire objects above it.<br/>\r\nKill Line: The standard object, but any physical objects that touch it are removed on contact.<br/>\n<br/>\r\nYou can also alter the gravity of the simulation at any time you wish.", "metacritic": null, "released": "2020-12-22", "tba": false, "updated": "2020-12-25T03:10:14", "background_image": "https://media.rawg.io/media/screenshots/4a2/4a2444c0accb72c620063626514c7296.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 99, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Merriman Games"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["Merriman Games"], "esrb_rating": null}