{"id": 535600, "slug": "aggressive-robot-vacuum", "name": "Aggressive Robot Vacuum", "name_original": "Aggressive Robot Vacuum", "description": "Aggressive Robot Vacuum - a robot vacuum cleaner simulator with a top view, where your task is to clean up the worst mess in just one minute! Collect gobies and crumbs, clean the floor and carpets from dirt, and most importantly: beware of hard and sharp objects, because they can cause the robot to explode! Collect coins to improve cleaning characteristics and explore the entire apartment for dirt, because this is the meaning<br/>\r\nof your life!<br/>\n<br/>\r\nOne day, a small robot vacuum cleaner was bought to clean a small apartment while the owner is busy with work and other daily activities outside the house. However, when he returns home, he makes a terrible mess all over the apartment every night. Cleaning up such a serious mess every day, the robot has lost its circuits, and now it shouts obscene phrases about its \"boss\" and its work. You are the same robot, and your task is to clean the apartment as soon as possible, otherwise the robot will go to the Creator without fulfilling its duty, and this promises digital hell. Help the poor guy and prove to everyone that he is not just a robot vacuum cleaner, but a machine with a heart and soul!<br/>\n<br/>\r\nAdvantages of the game:<br/>\r\n- Nice graphics<br/>\r\n- Fun replica of the robot<br/>\r\n- Full localization in Russian and English<br/>\r\n- Shop for improvements", "metacritic": null, "released": "2020-12-21", "tba": false, "updated": "2020-12-25T03:00:10", "background_image": "https://media.rawg.io/media/screenshots/a3d/a3d555e40b12bee6e9229f41ce1f638d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 35, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SosiskaGames"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["SosiskaGames"], "esrb_rating": null}