{"id": 535690, "slug": "magic-sword-for-kamonegi-go", "name": "Magic Sword for Kamonegi-go", "name_original": "Magic Sword for Kamonegi-go", "description": "This game is currently only supported in Japanese.<br/>I welcome translators who can translate one million characters. -Musashi Kazui<h3>Magic sword for Kamonegi-go</h3><br/>A Different world from here. A Story when many Magic swords were still born.<h3>Opening</h3><br/>You woke up, in the world of magic swords.<br/>You don't know anything about the catastrophe five years ago in This world.<br/>You'll be working as a radio operator, and you'll be attacked by a black magic sword.<br/>Who is the \"Messenger\", who knows the terrible power of a black magic sword, the identity of a magic sword, and everything?<br/>Your choices determine the fate of this world.<h3>Ship's mate</h3><br/><br/>Captain: Aaron<br/><ul><li>Captain of the ship who hired you as a radio operator. He enjoys everything.</li></ul>Navigator: Brendan<br/><ul><li>Navigator who performs all the office work on the ship. He is hiding something.</li></ul>Searcher: Chase<br/><ul><li>Adventurers looking for magic swords. Her get on a ship looking for miracle magic sword.</li></ul>Magic Swordsman: Dion<br/><ul><li>Legitimate successor of the venerable magic swordsman clan. He get on the ship to learn about the magic sword.</li></ul><h3>Outline of game</h3><br/><br/>You will use the radio as the radio operator’s job and ask the \"Messenger\" for the location of the magic sword.<br/>You rely on advice to find a magic sword with your ship mate.<br/>Then tell \"Messenger\", what you found answer.<br/><br/><br/>Playing time: about 3-5 hours.<br/>Ending: 1 (with some changes)<br/>Bad end: about 10<br/>Event Still: Basic 50<br/>Adult event: 4 characters x 4   about 10 others<br/>(* Don't even remember the producer)<h3>Explore in the ship</h3><br/>Ship's mate live freely in the ship.<br/>Go wherever you want to talk and work.<h3>Easy mode</h3><br/>This game has an Easy mode.<br/>Many choices, the one that progresses in the story will be colored Green.<br/>Red for bad ends and Pink for Adult events.<br/>In addition, In Very easy mode chooses Green over time.<br/>It's game will proceed simply by turning the mouse wheel.<h3>Credit</h3>Production: Musashi Kazui<br/>Assist: Nozomi Tsubaki, Kotton, Inuo, Gosyoku,<br/><br/>Sorry,this game has some difficult errors to bother you.<br/>This game development at Kirikiri 2 (吉里吉里２).<br/>Since it is a relatively old engine, there may be compatibility issues.<br/>There is a trial version, so please use it to check the operation.", "metacritic": null, "released": "2020-12-24", "tba": false, "updated": "2020-12-25T03:58:34", "background_image": "https://media.rawg.io/media/screenshots/97b/97b2423f3068bb5e666f10ba1c334031.jpg", "website": "https://kagiz.x.fc2.com/index.html", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 471, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["数井ムサシ"], "genres": ["Adventure", "Indie"], "publishers": ["Kagi-zu-MEGA"], "esrb_rating": null}