{"id": 535626, "slug": "tormentor", "name": "TORMENTOR", "name_original": "TORMENTOR", "description": "Take on the role of a ruthless tormentor who manages an abandoned prison full of victims sentenced to death.<br/><br/><strong><h3>The Story of Tormentor </h3></strong><br/>Fight against a developing mental illness that takes away your memories and causes more and more frequent and dangerous fainting. Work with an organized criminal group using darkweb to get more doses of the experimental drug that helps to keep your mind sober.<br/><br/><strong><h3>Designed for Next Generation</h3></strong><br/>Take over a prison that has been abandoned for years. Built this modern prison among the ruins of an ancient temple, creating opportunities to prepare a truly hellish labyrinth for your victims.<br/>By taking advantage of raytracing possibilities, begin to create unusual traps that will confuse your prey, giving you the necessary advantage while hunting.<br/><br/><strong><h3>Customize your Cells</h3></strong><br/>Search for the best deals and enrich prison cells with new torture tools to prepare your victims for the dangerous game. Satisfy the hellish lusts of your sponsors and win progressively darker contracts by removing those individuals who are inconvenient for them.<br/><br/><strong><h3> Customize your Victims</h3></strong><br/>Use an extremely powerful character customization system to make new victims for your prison. Name them, select a tone of voice and add a detailed description on the figure card, and then use the camera to conduct a live stream of her torture!<br/><strong><h3>Manhunt</h3></strong><br/>Nurture the desire for revenge in your victims, then give them a weapon and let them finally hunt... You!<br/><strong><h3>Main Features</h3></strong><br/>- Expansion of the prison with new instruments of torture<br/>- Extensive character editor for creating new victims<br/>- Video transmission equipment<br/>- Organizing a hunt for yourself<br/>- Brutal executions<br/>- Fighting and sneaking in TPP mode<br/>- Receiving donations and new victims from sponsors", "metacritic": null, "released": null, "tba": false, "updated": "2023-07-17T05:10:06", "background_image": "https://media.rawg.io/media/screenshots/fcc/fccd4d2a772280747a5ba2a4b89e8a22.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1, "toplay": 4}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 349, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Madmind Studio"], "genres": ["Action", "Adventure", "Simulation", "Indie"], "publishers": ["Madmind Studio"], "esrb_rating": null}