{"id": 535608, "slug": "round-99", "name": "Round 99", "name_original": "Round 99", "description": "<h3>Round 99 is a fast-paced shooter combined with a platformer that focuses on jumping around colorful environments and making a variety of enemies explode! Jump around 12 levels and bombard nearly 20 different enemies and bosses alone or as a team.</h3><br/><strong>Sounds simple? It is... until it isn't.</strong><br/><br/>In Round 99, each level has 99 rounds in which you shoot dangerous enemies as a star, with each round being harder than the last. Round 99 can get chaotic if you're not good at wielding explosive power.<br/><br/>By explosive power, we mean <strong>ABSOLUTELY EXPLOSIVE.</strong><br/><br/>The more you go through Round 99, the more levels and items you unlock, the farther you'll get in your journey of finding your true potential as a star who can make things blow up. The better you play, the faster rounds go, and the faster you can make your foes fall down, and that extends across all three modes.<br/><br/><strong>The three modes can ALL be played alone or with friends. </strong><br/><br/>In Normal mode, you simply make your way through 99 rounds and fight a boss. In Endless mode, the rounds are completely randomized and you aim to score as many points as possible by beating enemies quickly. Arcade mode involves playing through the levels in order with a lives counter, beating this mode unlocks new secrets that can make playing through the game even more fun!<br/><br/>Are you ready to use your weapon-wielding, star-shaped, powerful power to lead you to victory? Round 99 says you're always ready.<br/>", "metacritic": null, "released": "2020-12-21", "tba": false, "updated": "2020-12-25T03:04:47", "background_image": "https://media.rawg.io/media/screenshots/ff9/ff952c1c97fa5b3b43e8fa4b677d6aa8.jpg", "website": "https://gamesbyboomz.com/round-99", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 98, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Boomz Games"], "genres": ["Action", "Indie"], "publishers": ["Boomz Games"], "esrb_rating": null}