{"id": 535621, "slug": "motesolo-no-girlfriend-since-birth", "name": "Motesolo: No Girlfriend Since Birth", "name_original": "Motesolo: No Girlfriend Since Birth", "description": "Everyone was a solo when they were born.<br/>All of us were solo at least once.<br/>And Someone even now.. <br/><h3>[Synopsis]</h3><br/>On a late afternoon in Seoul, There are two people having a blind date in cafe.<br/>But this man is so suspicious. He acts like the man who doesn't have any girl friend.<br/>Unfortunately this is true. yes. He is NGSB. No GirlFriend Since Birth.<br/><br/>He is 29 years old and There is saying that the virgin in 30 will finally become a black magician .<br/>There are only bunch of boys in his life like men's middle school, men's high school, major in computer in Univ and military..<br/>This is last chance to have a girl friend before turning into 30 in this blind date.<br/>His life depends on your choices.<h3>[Characters]</h3>His name is Kang Ki-mo who got you to spy on the conversation.<br/>Kang Ki-mo is an ordinary office worker who likes DIY and playing games.<br/>However, he is the man who has never had a relationship with a woman.<br/><br/>Motesolo means no girl friend since birth in Korea.<br/>Kimo is Motesolo who even haven't held the a woman's hand in his life.<br/>Do you think he will success on this blind date?<br/><br/><h3>[How Play?] </h3><br/><strong>1. Conversation selection</strong><br/>You become the protagonist and you can choose the conversation the protagonist will answer.<br/>And all of these choices can affect the ending.<br/>The progress of the game changes according to your choice.<br/><br/><strong>2. Interaction</strong><br/>Throughout the game, players interact not only with characters, but also with their surroundings and objects.<br/>You can sit down and explore the world on your phone,<br/>You can also wander around to acquire items or do research.<br/><br/><strong>3. Mini Game</strong><br/>Various mini-games appear according to the situation<br/>You shouldn't slow down your tension.<br/><br/><h3>Mind tracking</h3>Become a love tracker! What is the heart of the man (she)? Notice the game starts! One..<br/><br/><h3>[Game features]</h3>- Progress that changes according to player actions<br/>- Beautiful shooting, non-linear ending progress<br/>- Multiple choice synopsis with infinite endings<br/>- Interactive producing<br/>- And.... Hidden Ending", "metacritic": null, "released": "2020-12-24", "tba": false, "updated": "2024-04-05T14:01:58", "background_image": "https://media.rawg.io/media/screenshots/828/828809dc58fe910a43dd1a1d6ae40397.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 5, "toplay": 1}, "playtime": 4, "achievements_count": 32, "ratings_count": 0, "suggestions_count": 253, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["INDICAVA INTERACTIVE"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["INDICAVA INTERACTIVE"], "esrb_rating": null}