{"id": 535719, "slug": "okudoku-number-brain-challenge", "name": "OkuDoku Number Brain Challenge", "name_original": "OkuDoku Number Brain Challenge", "description": "OkuDoku is a combination of 2 classic games Sudoku and Tetris. We have tried to take all the best from those two games to create a truly challenging experience for puzzle lovers.<br/>You can play against yourself by beating your own high score or compete in Daily Challenges.<br/><br/>The game is easy to play but in order to completed Daily Challenges and get a really high score, you will need to plan your moves a few steps ahead.<br/><br/><br/>How to play:<br/>1. Drag and drop numbers on the board<br/>2. Build lines or squares that contain numbers from 1 to 4<br/>3. You score every time you complete a line or a square with all numbers from 1 to 4<br/>4. Lines and squares are cleared once all the numbers from 1 to 4 are added<br/>5. Plan your moves in order to combine multiple lines and squares in order to get even higher score<br/>6. Game ends when you don’t have any available moves left<br/><br/><br/>Daily Challenge:<br/>- Every day we release a new challenge for you to play<br/>- Challenge is started with a predefined set of numbers on the board<br/>- The goal is reach a high score and not to run out of moves too quickly<br/><br/><br/>Please don’t forget to leave a review with your feedback &amp; suggestion, so we can make our game even better!", "metacritic": null, "released": "2020-06-26", "tba": false, "updated": "2020-12-25T04:19:45", "background_image": "https://media.rawg.io/media/screenshots/197/1971879b2a3468b5d2f4fec9d98bc7e1.jpg", "website": "https://www.okudoku-game.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 33, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Pavel Kechko"], "genres": ["Board Games", "Puzzle"], "publishers": ["Pavel Kechko"], "esrb_rating": "Everyone 10+"}