{"id": 535734, "slug": "sushi-roll-3d-asrm-food-game", "name": "Sushi Roll 3D - ASRM Food Game", "name_original": "Sushi Roll 3D - ASRM Food Game", "description": "Slice, chop, and roll your way to sushi success in this satisfying cooking game. The more sushi you roll, the happier your customers will be and the more money your restaurant will make! <br/><br/>► NOW YOU’RE COOKING!<br/><br/>Sharpen your knife skills on all sorts of Japanese dishes. But the cooking fun doesn’t stop there! You can keep unlocking new actions as you advance to add tons of captivating new mini-games to your gameplay experience.<br/><br/>Satisfy customers by making quality food fast with a variety of fixings, and watch them react with lots of likes and a big cash tip — or anger at poorly made food. When making sushi, be sure to pick up the right ingredients and avoid obstacles to deliver the most delicious meals. Be careful: no guest wants too much seaweed and too little fish — or worse, thumbtacks and moldy cheese in their sushi!<br/><br/>► SUSHI AND CHILL<br/><br/>As you slash through fun levels in the game, you’ll cut through your worries in real life! Feast your eyes and ears on anti-stress ASMR vibes while you work your way to master sushi chef. With its charming graphics and optional vibration, this relaxing game will have you dreaming of sushi! <br/><br/>► GAME FEATURES:<br/><br/>• Beat increasingly challenging levels to earn more cash and unlock new fillings and toppings. This cooking and restaurant management game is sure to keep you coming back for seconds!<br/><br/>• Level up your sushi skills to earn better Surprise Box rewards, including new ingredients, cutting tools, and actions. You can also earn more skins to customize your gameplay!<br/><br/>• Roll and chop sushi, scale and slice fish, grate cheese, make rice, weigh out noodles in take-out boxes, and more in different mini-games that never get old.<br/><br/>• Work with the classic ingredients of fish, rice, and seaweed, and earn special toppings as you progress, including chili peppers, durian fruit, and caviar. Combine your options to make different types of dishes, including maki, sashimi, nigiri, noodles, and more.<br/><br/>• Upgrade your restaurant with new furniture, dishware, decorations, and accessories to increase your revenue per minute. The more levels you complete, the more options you’ll have for chopping: why slice with a plain old knife when you could hack with an ax or gnaw with a chainsaw?<br/><br/>• Test your skills in entertaining bonus levels with wild and unexpected ingredients. Roll out the red carpet for VIP guests by making sushi and other dishes with fun objects like cash, gold, bling, gadgets, computer chips, honeycomb and more. Don’t forget to top it off with diamonds and rubies! <br/><br/>• Relax and enjoy this ASMR game with anti-stress sounds, visuals, and tasty virtual treats. Who knew sushi could be so soothing?<br/><br/>• Check out the in-game store to buy special bonuses and upgrades.<br/><br/>• The user-friendly and easy-to-learn interface makes it easy to jump in and get rolling.<br/><br/>What other game can serve you tasty sushi, engaging and satisfying gameplay, a chill ASMR atmosphere, and the opportunity to run your own restaurant? Once you find yourself on a roll, you won’t be able to put this game down!<br/><br/>Well, what are you waiting for? Step up to the cutting board and start cooking! Chop-chop! <br/><br/>► Download the game now and get your sushi on!", "metacritic": null, "released": "2020-11-09", "tba": false, "updated": "2020-12-25T04:26:02", "background_image": "https://media.rawg.io/media/screenshots/cff/cff9b5907c2cbd974df7c07e08c6cf48_etVsaKF.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 75, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["SayGames"], "genres": ["Simulation", "Casual"], "publishers": ["SEIGEIMS, OOO"], "esrb_rating": "Teen"}