{"id": 535717, "slug": "jigsaw-sudoku-by-sudokucom", "name": "Jigsaw Sudoku by Sudoku.com", "name_original": "Jigsaw Sudoku by Sudoku.com", "description": "Play Jigsaw Sudoku – a fun twist on the classic Sudoku from the makers of Sudoku.com! Solve puzzles, train your brain, and have fun. Install to start now!<br/> <br/>Jigsaw Sudoku is very similar to regular Sudoku, but instead of 3x3 blocks, you’ll have irregular jigsaw-shaped blocks. This where the puzzle's name comes from! Jigsaw Sudoku is a great puzzle for both beginners and experienced sudoku players. You can choose a level that fits your mood and skill best – an easy puzzle for a short mental break or an expert one to give your brain a solid exercise!<br/><br/>How to play:<br/> <br/>* Fill all rows and columns with numbers 1 to 9 exactly like in classic Sudoku.<br/>* Watch the irregular jigsaw-shaped blocks! There are no classic 3x3 blocks here.<br/>* Don’t repeat numbers within a single row, column, or a jigsaw-shaped block.<br/> <br/>Get an amazing sudoku experience:<br/> <br/>* Sudoku puzzles with the new enhanced mechanics <br/>* Solve thousands of levels with a unique grid layout<br/>* Use hints when you’re stuck<br/>* Write notes to keep track of possible numbers. Your notes are updated as you go along!<br/>* Take the game with you wherever you go<br/>* New game from a top developer<br/><br/>While it might seem challenging to get used to the new grid at first, be certain you’ll grasp the puzzle’s brilliance shortly. Each time you start a game, you get a different combination of jigsaw blocks and hence – a completely unique puzzle made just for you!<br/><br/>Challenge your brain with Jigsaw Sudoku. Play anywhere, anytime!", "metacritic": null, "released": "2020-12-18", "tba": false, "updated": "2020-12-25T04:18:53", "background_image": "https://media.rawg.io/media/screenshots/cb8/cb8686b2fcd7c0828d6b7510ffa9233f_tIHTxLi.jpg", "website": "https://easybrain.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 35, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Easybrain"], "genres": ["Board Games", "Puzzle"], "publishers": ["EASYBRAIN"], "esrb_rating": "Teen"}