{"id": 53576, "slug": "super-puzzle-bobble", "name": "Super Puzzle Bobble", "name_original": "Super Puzzle Bobble", "description": "<p>Super Puzzle Bobble, released as Super Bust-A-Move in Europe and North America, is a puzzle video game in the Puzzle Bobble series. It was developed by Taito Corporation, and released on November 26, 2000 by Acclaim Entertainment for the PlayStation 2 and PC. There is a different arcade release with the same name. It was later ported to the Game Boy Advance on November 27, 2001. It was re-released in Japan for the PS2 in 2004 as part of Super Puzzle Bobble DX (along with its sequel, Super Puzzle Bobble 2), which is Volume 62 of the Japan-exclusive Simple 2000 Series. This compilation includes a few graphical enhancements.</p>\n<p>Super Puzzle Bobble was ported to the GameCube in 2003, under the name of Super Puzzle Bobble/Bust-A-Move All-Stars, and also Bust-A-Move 3000. The game is a direct port, except for the inclusion of new backgrounds and remixed music. It also features new box artwork, more in line with the in-game artwork. The GameCube All-Stars version has a four player option.</p>\n<p>Super Puzzle Bobble gameplay is essentially the same as the rest of the series. It bestows some audiovisual improvements, adds and removes gameplay elements, adds a new art style, and adds a new character roster. It has single player, training, computer competition, and two player competition modes.</p>", "metacritic": null, "released": "2000-09-28", "tba": false, "updated": "2019-08-28T22:02:02", "background_image": "https://media.rawg.io/media/screenshots/1c6/1c64af8b2dafbd3ddd04f14772a236bb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1, "toplay": 4}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 185, "game_series_count": 0, "reviews_count": 0, "platforms": ["Game Boy Advance", "GameCube", "PlayStation 2", "PC"], "developers": ["Taito", "Altron"], "genres": ["Puzzle"], "publishers": ["Ubisoft Entertainment", "Acclaim Entertainment", "Taito"], "esrb_rating": null}