{"id": 535732, "slug": "exominer-idle-miner-universe", "name": "ExoMiner - Idle Miner Universe", "name_original": "ExoMiner - Idle Miner Universe", "description": "Ever dreamed of conquering planets? Leaving your mark on human history? Rivaling the Medici, Rockefeller, and Bezos? Making unbelievable money and ADVANCING the world? Discovering and creating life changing technologies? Then, strap in, because you are headed to the STARS.<br/><br/>PLANETS TO DISCOVER<br/>Even after you go from rags to riches… you’re only getting started. Build your reputation as a daring entrepreneur and keep expanding your empire into daring new galactic fronts.<br/><br/>ENJOY YOUR SUCCESS<br/>Other games just give you empty numbers while you tap away. ExoMiner is still easy to play. Watch your corporation grow from a humble mine with a tiny spaceship, to covering entire worlds.<br/><br/>PROFIT FROM LUCRATIVE CRAFTING<br/>Has anyone ever said two businesses are worse than one? You won’t only reap profits from settling planets. You discover materials, invent new technologies, and construct more items.<br/><br/>70+ MATERIALS! MINING NEVER GETS OLD<br/>Your interstellar experience isn’t going to be mining the same boring stuff. There are 70+ different minerals and alloys you can discover and refine. Turn these into assemblies you can sell to make even more PROFIT!<br/><br/>BUILD YOUR EMPIRE WHILE YOU'RE AWAY<br/>Your miners, rovers, and heavy machinery are busy at work for hours! Doesn’t matter if you put your phone down when you’re at work, eating, or sleeping at night. Your empire keeps growing!<br/><br/>What are you waiting for? There are planets for you to write your name on!<br/><br/>Any problems or suggestions?<br/>Contact: support@exocorp.space<br/><br/>Your ExoMiner Team<br/><br/>Privacy Policy: https://www.exocorp.space/privacy-policy<br/>Terms and Conditions: https://www.exocorp.space/terms-of-service", "metacritic": null, "released": "2020-12-05", "tba": false, "updated": "2023-02-22T13:07:00", "background_image": "https://media.rawg.io/media/screenshots/e78/e787864304568e6bed6f62d244725a3c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 53, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Eldring Games", "ExoCorp"], "genres": ["Adventure", "Strategy", "Simulation"], "publishers": ["Eldring Games", "ExoCorp"], "esrb_rating": null}