{"id": 535720, "slug": "crystal-crush-match-3-game", "name": "Crystal Crush - Match 3 Game", "name_original": "Crystal Crush - Match 3 Game", "description": "Play the newest candy match 3 free games---Crystal Crush! Enjoy the candies puzzle match 3 game which you cannot miss! Use the magic power to crush the crystal stone with Princess Gerda and her sweet pet---Firefox. Just begin your magic adventure soon!<br/>After Princess Gerda and her sweet firefox ending their magical adventure in the Frozen realm, the evil Snow Witch got a chance to escape and cast her ultimate magic for revenge: She transformed every candy in the world into crystal stones! Fruit hard candy turned into yellow crystal stones; Lollipop candy becomes purple crystal rocks；Toffee candy transformed into blue crystals; Caramel candy has been changed into red crystal stones; Milk candy switched into Green rocks, And Chocolate candy is cursed to be orange crystals!<br/>Frozen realm has again faced with another danger. Sweet candies over the world have disappeared in an instant. Gerda and her pet firefox are ready to set up their another magic journey, saving the candies from crystal rocks. Defeat Snow Witch in the frozen land and use the magic to crush every hard magic stones, restoring them to candy again. What are you waiting for? Just join this sweet and magic game with Gerda and sweet firefox. <br/><br/>How to play this Game?<br/>-You will have a specific goal in every free level, just finish the goals and you will get big rewards after games.<br/>-Match 3 or more same color crystal stones in order to crush them.<br/>-Pass level to get enough stars and unlock the new maps in the game.<br/>-Collect coins and buy powerful boosters to crush and save candy easily.<br/>-Pass levels to unlock magic cute friends to help you win the match game.<br/>-Hundreds of challenging levels and magic maps need you to match<br/>-Join Team competes in games with friends all over the world, the winner will get generous rewards.<br/><br/>FEATURES<br/>THE BEST PUZZLE GAME<br/>- Super fun and addictive gameplay. Hundreds of challenging and unique match-3 levels!<br/>- No Wi-Fi or internet connection required to play. This is an easy to play match 3 puzzle game! No matter your age or experience, you will enjoy those wonderful jewel games &amp; levels!<br/>- Different wonderful game-worlds with new designs! Solve puzzles and unlock new maps.<br/>- Powerful boosters helping you solve the quests and they will help you to match every block and solve every puzzle.<br/>- Play timed events for boosters &amp; other rewards. Sweet holiday events to be added regularly for your entertainment.<br/>- Leaderboard to watch your friends and competitor globally. Monthly and global rankings show your great record.<br/>Follow us to get news and updates:<br/>https://www.facebook.com/Crystal-Crush-Match-3-103108168199829<br/>Start the Crystal Crush in the magical today!<br/>Have fun playing Crystal Crush!", "metacritic": null, "released": "2020-11-16", "tba": false, "updated": "2020-12-25T04:20:16", "background_image": "https://media.rawg.io/media/screenshots/ead/eadf7aec389dd36f430d3535daf07e48_LbBrwJq.jpg", "website": "https://www.adevote.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 106, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Adevote Interactive"], "genres": ["Casual", "Puzzle"], "publishers": ["HK Adevote Interactive"], "esrb_rating": "Everyone 10+"}