{"id": 535706, "slug": "the-last-dead-end", "name": "The Last Dead End", "name_original": "The Last Dead End", "description": "To play this game on PS5, your system may need to be updated to the latest system software. Although this game is playable on PS5, some features available on PS4 may be absent. See PlayStation.com/bc for more details.<br/>The Last Dead End is an adventure game with the elements of FPS and horror.<br/><br/>In this game, we play the role of young scientist Farhad Novruzov, who returned to his homeland to help in filming a documentary movie for an international television channel. Here he faces strange events connected with the ancient religion of Zoroastrianism and the scientist has to find out the reason of these events.<br/>The game takes place both from the first person and the third person. Most actions and active research take place in the first person view. The main action of the game takes place in Baku, Azerbaijan. It takes place in an actually existing inner city of Baku. This is the oldest district of the city with a thousand-year history, surrounded by a fortress wall, inside which along with the old streets, there are dozens of historical and archaeological sites.<br/>There are several regular enemies in the game, as well as strong enemies (bosses), that were inspired by local legends. In the fight against some of them, there is its own tactic of winning them.<br/><br/>The game has an extensive encyclopedia and the possibility of research. Articles in a vast encyclopedia, containing articles about historical objects, characters, symbols, etc., are added along the course of the game. In the game there are various items that can be selected, viewed from all sides, learn information about them. With the help of technological glasses, which the main character has, you can read and decipher the inscriptions in the ancient languages that are on the walls of the old city.<br/><br/>Some of the locations are built one-to-one with real city and historical buildings, the game has many objects that reflect the national flavor of the old city.<br/><br/>Most of the game takes place in unusual locations for the genre - a flooded fortress, an ancient palace, ancient ruins, etc. This is one of the rare games in the genre, with elements of horror, where action takes place in a real city, enveloped in a mystical atmosphere.<br/><br/>Survival mode. Special mode where you can fight with different enemies in various maps. There are three types of survival: try to hold out \"waves\" of enemies, kill all enemies in a certain time and finally, to last as long as possible, remaining alive.<br/><br/><br/>Offline single player<br/><br/><br/>Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy). <br/><br/>Software subject to license (us.playstation.com/softwarelicense). <br/><br/>One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.<br/>", "metacritic": null, "released": "2020-12-24", "tba": false, "updated": "2020-12-25T04:11:55", "background_image": "https://media.rawg.io/media/screenshots/e14/e14e617e3b3d76cbcbccb0da66b20ec9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "dropped": 1}, "playtime": 0, "achievements_count": 28, "ratings_count": 0, "suggestions_count": 327, "game_series_count": 0, "reviews_count": 0, "platforms": ["PlayStation 4"], "developers": [], "genres": [], "publishers": [], "esrb_rating": null}