{"id": 536040, "slug": "evitando-el-coronavirus", "name": "EVITANDO EL CORONAVIRUS", "name_original": "EVITANDO EL CORONAVIRUS", "description": "<p>Nuestro juego trata de una simple agilidad de evitar contagiarse de virus (covid-19) y acumular la mayoría de puntos, que son unas botellas de alcohol. el juego es entretenido pero llega a su final cuando es tocado por un virus. Así que debes de tratar ser rápido, ágil y no quedarte quieto. Este juego tiene una temática de un virus que es el covid-19 con un fondo navideño, el cual es interesante para jugarlo en épocas navideñas.  Una simple regla es no dejarse tocar por los virus y tener una buena agilidad para evitar ser tocado, al otro lado del jugador siempre va a estar una botella de alcohol la cual debe tocar para poder ganar puntos.</p>\n<p>Este juego es creado por: Antonio Verdugo, Nathy Benavides y Michael Vivanco, El juego \"EVITANDO EL CORONAVIRUS\" trata de no contagiarse por los virus de suben y bajan para tocarnos.<br/>Este juego tiene una temática de un virus que es el covid-19 con un fondo navideño, el cual es interesante para jugarlo en épocas navideñas.</p>\n<p>Una simple regla es no dejarse tocar por los virus y tener una buena agilidad para evitar ser tocado, al otro lado del jugador siempre va a estar una botella de alcohol la cual debe tocar para poder ganar puntos.</p>\n<p>Este videojuego fue creado en una pagina de herramientas llamada scratch, con música sin copyright importada desde YouTube.</p>", "metacritic": null, "released": "2020-12-23", "tba": false, "updated": "2020-12-25T05:36:15", "background_image": "https://media.rawg.io/media/screenshots/f15/f1574f4af50acea8f1242e3de633f99d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 72, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["antonioverdugo01"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}