{"id": 536230, "slug": "unioradix-fray", "name": "Unioradix Fray", "name_original": "Unioradix Fray", "description": "\n<p>Video game where all levels, objectives and progress are connected to the needs and interactions of its inhabitants.</p>\n<p>The player can manipulate several characters with history, personality, attributes and unique attacks, to succeed you must observe, dodge and defend against enemies and your surroundings to make the most of the qualities of your character and emerge victorious.</p>\n<p><strong>Gameplay mechanics:</strong></p>\n<br/>\n<p>■ <strong>Fluid management of the character on the ground and the air:</strong><br/>Manipulate with the joystick the force which the character walks or jumps, allowing the player to calculate better his approach towards enemies and obstacles.</p>\n<p><strong>■ Cancel attacks with defensive maneuvers, and vice versa.</strong><br/>The characters can perform and cancel the attacks almost instantly with the use of stamina and energy for special attacks, so skillful players can exploit unexplored combos even by the developers themselves.</p>\n<p><strong>■ Weak, strong, directional and aerial attacks.</strong><br/>Each attack is made depending on the intensity that the attack button is pressed and its direction (strong attacks are alternated by keeping the attack button on the ground), advanced movement techniques (similar to wavedash, wavelanding, dash dancing, moonwalking, etc.) can be done with a specific direction on the joystick. Also you can impulse when canceling an evasion with attacks and approach the enemy efficiently.</p>\n<p><strong>■ Fight based on physics and launching.</strong><br/>The attacks have levels of impulse and direction affected by the position in which a player or enemy receives an attack, with the goal of creating a game that does not depend on fixed combos. Instead, requires the observation and experience of the player with the different angles that can result when an attack collides toward the enemies which as the playable characters, they have weight and unique gravity that modifies the way everyone reacts to attacks.</p>\n<p><em>* The current version of the game has bugs and incompatibility with certain devices, it is expected to improve the game experience with constant updates.</em><br/></p>\n<p><em>* The game contains optional advertising with bonuses for the player. (Only Android Version)</em><br/></p>", "metacritic": null, "released": "2020-12-23", "tba": false, "updated": "2020-12-25T06:20:07", "background_image": "https://media.rawg.io/media/screenshots/353/35379168a1b251be2779efaca2d4770f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 183, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Gzini"], "genres": ["Action", "Fighting", "Platformer"], "publishers": [], "esrb_rating": null}