{"id": 536390, "slug": "santas-trainee-elf", "name": "Santa's Trainee Elf", "name_original": "Santa's Trainee Elf", "description": "Background\r\n<p>It's 23 December 2020.</p>\n<p>It's been a really tough year for many people with bush fires, floods and other natural disasters and then the Covid-19 pandemic. Many people are doing it tough, so it's up to Santa Claus to bring a smile to their faces and make sure that all the nice children get a present on Christmas Day, even if their parents can't afford it.</p>\n<p>Today also happens to be your birthday. You have just turned 16, which is the elvish coming-of-age. It's a very proud day when Santa's elves start their traineeship.</p>\n<p>You've been told to report to Santa in the lounge room to receive your instructions for your first day on the job. Good luck, young Eldrid.</p>\r\nGoal\r\n<p>Early in the game, Santa will give you a list with 10 chores to do. Each chore that's completed will earn you 10 points. The majority of the chores are to get Christmas presents for the children on the list. In order to get the presents, you first have to find out what the children want and what materials you need to make the presents. As a consequence the beginning of the game is an information gathering exercise. Don't worry, it's very easy.</p>\n<p>Unfortunately, materials for the presents are in short supply due to the Covid-19 pandemic, so you may have to scrounge around to find what you need. Some of the materials are easily acquired from supplies or toy storage, but others will take a bit more ingenuity. You earn 5 points for each present that you find or make and a further 5 points for putting it on Santa's sleigh.</p>\n<p>Incidentally, the list that Santa gives you is sprinkled with elvish magic. It not only provides you with a dynamically changing reminder of what you have to do, but also provides you with a colour-coded indication of your progress, so you'll probably want to keep it with you.</p>\r\nInstructions\r\n<p>This is a traditional text adventure written for the Adventuron Christmas Jam, 17 November to 22 December 2020. See Adventuron Christmas Jam for the jam rules.</p>\n<p>A text adventure is a form of computer game that presents you with a story. You take on the role of the main character in the story and control that character's actions. The story has a goal and you will need to solve puzzles in order to achieve that goal. The computer tells you where you are, what you can see and what's happening around you. You can then move around, examine the things you find and manipulate objects by telling the computer what to do using simple English commands.</p>\n<p>Commands consist of a verb phrase, optionally followed by a noun phrase. Most commands can be abbreviated to a verb followed by a noun. For example, CHOP THE CHRISTMAS TREE can be abbreviated to CHOP TREE.</p>\n<p>If the verb is followed by a preposition, this may alter its meaning. For example, GET BOX will attempt to pick up the box, but GET ON BOX will attempt to climb onto it.</p>\n<p>In some cases, the verb phrase and first noun phrase may be followed by a second noun phrase. The two noun phrases are usually separated by a preposition. For example, DIG SNOW will attempt to dig a hole in the snow with your hands (as you didn't specify a second noun phrase), but DIG SNOW WITH SHOVEL will attempt to dig a hole with the shovel. If you only use a verb and a noun, the game will generally tell you if it needs an extra phrase.</p>\n<p>Don't panic! It's not as complicated as it sounds. Just use simple English sentences starting with a verb and it will all feel quite natural.</p>\r\nMovement\r\n<p>To move around, use commands like GO NORTH and GO SOUTH. You can move in any of the four cardinal compass directions, as well as UP and DOWN. To save typing, movement commands can be abbreviated to N, S, E, W, U and D. You can sometimes use other commands such as CLIMB, ENTER, GET ON or JUMP ONTO. These will be reasonably obvious when the time comes.</p>\r\nExamining things\r\n<p>Make sure you EXAMINE everything you come across, even insignificant things like scenery and objects mentioned in the room descriptions, as subtle hints and clues are scattered everywhere. To save typing, EXAMINE can be abbreviated to X. For example, EXAMINE TREE can be abbreviated to X TREE.</p>\n<p>The game includes a number of containers (like boxes) and supporters (like tables). If you examine these, they will either reveal their contents or tell you that they're empty.</p>\n<p>You can also try your other senses when it seems appropriate, e.g. SMELL TREE, TOUCH TREE or LISTEN.</p>\r\nManipulating objects\r\n<p>Apart from examining things, most of your time will be spent manipulating objects. Use commands like GET or TAKE to pick up an object, e.g. GET LIST. Use commands like DROP or DISCARD to drop an object, e.g. DROP LIST. Use WEAR to wear something, e.g. WEAR COAT. Use REMOVE to remove something that is already worn, e.g. REMOVE COAT.</p>\n<p>To see what you are currently carrying and wearing, use INVENTORY (or I).</p>\n<p>There are many other verbs that can be used to manipulate objects. These will be fairly obvious when the time comes. Common verbs include OPEN, CLOSE, LIGHT, EXTINGUISH, EAT and so on. Use PUT or PLACE to put objects into containers or on supporters, e.g. PUT TURKEY IN CAGE or PUT BREAD ON TABLE.</p>\n<p>When you are ready to make a toy, just take all the parts to the assembly area and ASSEMBLE, BUILD, CONSTRUCT or MAKE the relevant toy.</p>\n<p>Part of the challenge is working out what verbs to use in any given situation. Don't be scared to try anything. The game has well over 100 verbs, so if something doesn't work, try a synonym or try a different way of achieving the same thing. For example, if FEED RUDOLPH doesn't work, try GIVE HAY TO RUDOLPH.</p>\r\nCommunicating with characters\r\n<p>You will encounter quite a few characters in the game, not necessarily human. When you first meet new characters, in addition to examining them, you should also try talking to them, e.g. TALK TO SCROOGE. To get further information from them, try asking them about something, e.g. ASK SCROOGE ABOUT CRATCHIT or just ASK ABOUT CRATCHIT. You can also try giving them something or getting something from them, e.g. GIVE PRESENT TO SCROOGE (or GIVE SCROOGE PRESENT) and ASK SCROOGE FOR MONEY (or ASK FOR MONEY).</p>\r\nOther commands\r\n<p>Use LOOK (or L) to refresh the display.</p>\n<p>Use VERSION to get the game version. Use ABOUT, CREDITS or INFO to get the game version plus some extra info about the game.</p>\n<p>Use TURNS to see how many turns you've taken. Once you've solved the game, you should try to solve it in as few moves as possible. The number of turns taken does not include 'meta' commands such as TURNS and LOOK.</p>\n<p>Use SCORE to get your score. This is also shown in the status bar at the top of the screen as A/B, where A is your current score and B is the maximum score.</p>\n<p>Use SAVE to save your progress. You can save up to three game states. Use LOAD or RESTORE to restore a saved game. Due to a limitation in Adventuron, you may need to use LOOK after restoring a saved game to refresh the display.</p>\n<p>Use UNDO to undo the last move. This is handy if you change your mind, make a mistake or just want to experiment. The game should not allow you to get into an unwinnable situation.</p>\n<p>Use WAIT (or Z) to do nothing apart from pass the time.</p>\n<p>Most importantly, have fun, enjoy the game and have a happy Christmas!</p>\r\nKeyboard shortcuts\r\n<p>If you are playing on a computer with a conventional keyboard, rather than a mobile device, you can press the up and down arrow keys to cycle through your past commands. This is handy if you want to repeat the previous command or correct a typo.</p>\n<p>You can also enter a few characters of a word, then press Tab to cycle through any words containing those characters. For example, enter EX then press Tab to change the word to EXAMINE. Press Tab again to get EXIT. Press Tab again to return to EX.</p>\r\nCredits\r\n<p>Game design, coding and graphics by Garry Francis.</p>\n<p>Germania One font by John Vargas Beltrán, licensed under the Open Font License.</p>\n<p>The image in the title screen was grabbed when doing a Google search, but I couldn't find it again when I went looking for it.</p>\n<p>The game was originally written in Inform 6, then ported to Adventuron. Adventuron was written by Chris Ainsley.</p>\n<p>Learn to write your own text adventure with Adventuron. Visit the Adventuron web site for further details.</p>", "metacritic": null, "released": "2020-12-22", "tba": false, "updated": "2020-12-25T06:57:45", "background_image": "https://media.rawg.io/media/screenshots/b2c/b2cc24cb0f3ba622496456f92e002efa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 43, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Garry Francis"], "genres": [], "publishers": [], "esrb_rating": null}