{"id": 536392, "slug": "deck-the-halls-gieves", "name": "Deck the Halls, Gieves", "name_original": "Deck the Halls, Gieves", "description": "<p><em>(Created for the Adventuron Christmas Jam - November/December 2020)</em></p>\n<p>Fans of P. G. Wodehouse might find the character of Bartie Worster familiar. He's a wealthy bachelor about town with far too much free time on his hands, and he often seems to find himself or his friends in a variety of sticky situations. It's lucky for Bartie, then, that he's also the employer of Gieves, who is quite possibly the most brilliant gentleman's gentleman (or valet) in the entire British Empire of the deliberately vague 1920s or 1930s.<br/></p>\n<p>The goal of the game is to survive a Christmas spent at Penrose Hall at the behest of Aunt Allison; she whose disappointed lecturing is sure to send an icy chill down the spine of one Bartholomew Worster. Bartie's lifelong pal \"Checkers\" Small is, by coincidence, also staying at the Hall during Christmas, but almost before the pair have a moment to catch up, trouble strikes in the form of a <em>femme fatale</em> who threatens to cause a rift between the two quite by accident. Or is it an accident...?<br/></p>\n<p>All recognized commands are either a single VERB, or a two-word VERB NOUN phrase. <strong>Typing HELP at the prompt</strong> will provide a more thorough run-down of the sorts of inputs the game is programmed to respond to. The verb USE is not recognized by the program, other than to tell you to try another command. If a particular item is required to execute a command, you do not need to specify the item; as long as everything you need is in your inventory or the current location, the game will allow the action.<br/></p>\n<p>This game has been written in Adventuron, an online text-adventure creation environment designed to be easy to use and teach basic programming principles to school students. This is the second game that I've made with Adventuron, and this time around I spent a lot longer becoming familiar with all of its ins and outs. In the end, I didn't use that many of Adventuron's more advanced features, but I do feel that I was able to produce a much more customised experience compared to my last effort.</p>\n<p><strong>PLEASE NOTE:</strong> The font which I used in my game, to give it an old \"EGA PC\" feel, seems not to agree completely with Adventuron's scaling algorithms. I have done some rigging to force a display which looks good on my PC, but it may not work for you. If you find the text too large or too small for comfort, you should be able to use your browser's \"zoom\" functionality (usually holding \"Ctrl\" and pressing \"+\" or \"-\", or alternatively holding \"Ctrl\" and moving the mouse wheel) to adjust the display.<br/></p>", "metacritic": null, "released": "2020-12-22", "tba": false, "updated": "2020-12-25T06:58:19", "background_image": "https://media.rawg.io/media/screenshots/0b6/0b692a42d91008a13cc11dd2c2fffe35.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 32, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["VerdantTome"], "genres": [], "publishers": [], "esrb_rating": null}