{"id": 536380, "slug": "jump-step", "name": "Jump Step", "name_original": "Jump Step", "description": "<p>Jump Step</p>\n<p>Un divertentissimo passatempo per tutti gli amanti dei mini-giochi in Pixel art!</p>\n<p>Questo è Jump Step un gioco creato per intrattenere e divertire, metti alla prova la tua resistenza con il classico salto alla corda in chiave moderna, in uno nostalgico stile a 8/16 bit! </p>\r\nGameplay:\r\n<p>Attraverso l'uso di un semplice \"tap\" potrai saltare e accumulare punti, ma attento a non farti colpire dalla corda. <br/>Nel caso in cui ti venisse sete, non dimenticare di usare il bottone pausa per fermare un attimo il gioco! <br/>Per il resto ... Siete pronti per la sfida?</p>\r\nRingraziamenti:\r\n<p>Comincio con il ringraziare l'autore dei video tutorial, Samuele Sciacca che se non fosse stato per lui io e mio fratello non avremmo mai cominciato con lo sviluppo di giochi Indie.</p>\r\nDietro le quinte:\r\n<p>Da appassionato di videogiochi, ho cominciato per hobby praticando pixel art con mio fratello e non abbiamo più smesso. Dopo scoprimmo le potenzialità delle sue applicazioni e della fattibilità in se, decidemmo da subito di intraprendere la strada da sviluppatore di giochi indie. </p>\n<p>Inizialmente la fantasia ci portava a ideare giochi che \"teoricamente\" apparivano meravigliosi e indimenticabili ma che dal punto di vista \"pratico\" era impossibile per le nostre capacità, così decidemmo di mirare allo stile Casual dei giochi Arcade (almeno per la realizzazione di questo gioco).</p>\r\nCrediti:\r\n<p>Pixel art, Development, Music and Sounds:</p>\n<p>Guido Caminiti - \"Corvus\";</p>\n<p>Maurizio Caminiti - \"Grin\".</p>\r\nInfo:\r\n<p>Ci tengo in oltre evidenziare che questa è la versione per PC e che prossimamente sarà rilasciata una versione funzionante per android, grazie dell'attenzione.</p><p>Per l'appunto a chi fosse interessato lascio il link al nostro sito web, nonché portfolio online:  https://guidocaminiti95.wixsite.com/gmgamesmaker</p>\n<p>Il link del sito noto come Pixilart: https://www.pixilart.com/corvus</p>\n<p>Il link al nostro profilo Twitter: https://twitter.com/GM_Caminiti</p>", "metacritic": null, "released": "2020-12-22", "tba": false, "updated": "2020-12-25T06:55:15", "background_image": "https://media.rawg.io/media/screenshots/18f/18fb61bd7370b39bf5ab037c27967880.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 72, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["G&M Caminiti"], "genres": ["Action"], "publishers": [], "esrb_rating": null}