{"id": 536397, "slug": "hannahs-game", "name": "Hannah's Game", "name_original": "Hannah's Game", "description": "<p>Controls= Left Arrow / Right Arrow / Up Arrow</p>\n<p>Object = Eat as many falling goodies as you can</p>\n<p>Limit = 30 seconds</p>\n<p>Created With = Godot</p>\n<p>I made this game a couple years ago with my oldest daughter. Well, she drew the pictures and somehow she requested a Kaboom! clone, which, wow, brought me back to my own childhood and reminded me of the way I envied my friend's dad. Judging by the date that Kaboom! was released, I would have been 3, but there is no way I could remember anything at that age. At the same time, I moved to a new house when I was 5, so it couldn't have been much later. Either way, I have this strong memory, even more than that, like the scent of one of those perfumed erasers you used to be able to buy at the school store, if you know what I mean. This recollection is going into my friend's house and watching his dad just totally destroy Kaboom!. Of course, in hindsight he was probably just doing OK at the game, but to a preschool kid with preschool dexterity it seemed magical. So anyway, as simple as this game is, the way my daughter looked at me for putting it together totally collided with my memory of staring at my friend's dad in awe while he was playing Kaboom!, and yeah, that's pretty sweet. It has been a tough year with online schooling and the kids always home and stress and uncertainty and and and, but, if I can hold onto that magical moment when she looks at me like I am the most amazing person in the world, we are going to be all right. Stay safe out there, everybody.</p>", "metacritic": null, "released": "2020-12-22", "tba": false, "updated": "2020-12-25T07:00:02", "background_image": "https://media.rawg.io/media/screenshots/4cc/4ccc467db0b7e01c5cbcbfa0ef667d87.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 25, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["petenotpete"], "genres": ["Action"], "publishers": [], "esrb_rating": null}