{"id": 536600, "slug": "republik-zero-conflicts", "name": "Republik: Zero Conflicts", "name_original": "Republik: Zero Conflicts", "description": "<p><strong>Developers: </strong><em>Ana Wükong, Bern Perli, Marcellus \"H3yo\"</em></p><p>(EN) - <strong>Republik: Zero Conflicts</strong> is a strategy game in which the player takes over the presidency of Ungral, a country that is in conflict with it's neighbor Osias. Your job is to prevent a war from occuring, reducing the tension between the countries to <strong>absolute zero</strong>. </p>\n\n<p><strong>&gt;&gt; How to play &lt;&lt; </strong></p>\n<p><em>You'll be introtuced to a series of cards and each one of them will present you with a conflict. You must swipe the cards to the right or to the left, based on your own choices. </em>Each choice will affect your three stats.</p>\n<ul><li><strong>Don’t let the economy or your approval get to zero.</strong></li></ul>\n<ul><li><strong>You need to reach absolute zero on the tension indicator and reverse our situation.</strong></li></ul>\n<p><em>A special thanks to Laura, who reviewed the translation into English and French.</em></p>\n\n<p><strong><br/>Desenvolvedores: <em>Ana Wükong, Bern Perli, Marcellus \"H3yo\"</em><br/></strong></p>\n<p><strong>(PT) -</strong> <strong>Republik: Zero Conflicts</strong> é um jogo de estratégia onde o jogador assume a presidência de Ungral, um país que está em conflito com seu vizinho Osias. Seu trabalho é impedir que uma guerra ocorra, reduzindo a tensão entre os países até chegar ao <strong>zero absoluto</strong>. </p>\n\n<p><strong>&gt;&gt; Como jogar &lt;&lt; </strong><br/></p>\n<p>Você será introduzido a uma série de cartas e em cada uma delas estará presente um conflito. Você deve arrastar a carta para a direita ou esquerda, com base em suas escolhas. Cada decisão irá afetar os seus três marcadores.</p>\n<ul><li><strong>Não deixe a economia ou a sua aprovação chegarem a zero.</strong></li><li><strong>Atinja o zero absoluto no indicador de tensão e reverta a nossa situação.</strong></li></ul>\n\n<p><em>Agradecimentos especiais para Laura, que revisou a tradução para o inglês e francês.</em></p>\n<p><strong>Les développeurs:</strong><strong>  <em>Ana Wükong, Bern Perli, Marcellus \"H3yo\"</em></strong></p>\n<p> <strong>(FR) -</strong> <strong>Republik: Zero Conflicts</strong> est un jeu de stratégie dans lequel le jouer prend la présidence d'Ungral, un pays enconflit avec son voisin Osias. Leur travail conste à empêcher une guerre de se produire, en réduisant la tension entre les peys à zéro abolu.</p>\n\n<p><strong>&gt;&gt; Comment jouer &lt;&lt; </strong><br/><br/>Vous serez présenté à une série de cartes et un conflit sera présent dans chacune d'elles. Vous devez faire glisser la carte vers la droite ou la gauche, en fonction de vos choix. Chaque décision affectera vos trois marqueurs.<br/><br/></p>\n<ul><li><strong>Ne laissez pas l'économie ou votre approbation tomber à zéro.</strong></li><li><strong>Atteignez le zéro absolu sur l'indicateur de tension et inversez notre situation.</strong></li></ul>\n<p><em>Un merci spécial à Laura, qui a révisé la traduction en anglais et en français.</em></p>", "metacritic": null, "released": "2020-12-21", "tba": false, "updated": "2020-12-25T07:45:09", "background_image": "https://media.rawg.io/media/screenshots/9c9/9c98b1f61ee59ca2e33b6e12e86276a8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 3, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ana Wükong"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}