{"id": 536709, "slug": "labyrinth-city-pierre-the-maze-detective", "name": "Labyrinth City: Pierre the Maze Detective", "name_original": "Labyrinth City: Pierre the Maze Detective", "description": "<p>Come say hi in our Discord and get an exclusive role!<br />\nFrom the award-winning designers that brought you Homo Machina (2018) and Californium (2015), Darjeeling brings you another revolutionary puzzle game that is one of its kind.<br />\nFun, engaging, and beautiful, Labyrinth City creates 10 new visually-stunning universes for you to explore.Play as detective Pierre, you must solve all puzzles to retrieve the lost stone from the notorious thief, Mr. X.Crossing varied locations, you will encounter cute NPCs, and learn more about Opéra City, its surroundings and its citizens.<br />\nStoryline<br />\nA terrible crime has happened at the Opera City Museum! Mr. X, Pierre&#39;s sworn enemy, has stolen and fled with a magic stone that can turn everything around it into a labyrinth. Under the call of the Opera City Museum, Pierre, the detective, must undertake a new set of adventure, across 10 different places, to retrieve the lost stone. The issue is urgent, and he must act now!<br />\nGame Features<br />\nMany giant levels for you to exploreMore than 100 hidden objects to find and some surprising mini puzzle gamesAvailable in English, French, German, Chinese, Italian and JapaneseOriginal soundtrack<br />\nGame Highlight<br />\nStellar graphics based on the international bestselling children&#39;s book Pierre The Maze DetectiveVisiting beautiful places and interacting with the NPCs to build your own storySearching through the colorful world and exploring the numerous hidden subplot and modesIntriguing puzzles and many hidden objects awaitCollecting extra stars and treasure chests on your way to the finish line</p>", "metacritic": 78, "released": "2021-06-22", "tba": false, "updated": "2023-04-10T14:52:05", "background_image": "https://media.rawg.io/media/screenshots/6d8/6d82db0687a8fbe096f51a6248639785.jpg", "website": "", "rating": 3.92, "rating_top": 4, "added_by_status": {"yet": 7, "owned": 104, "beaten": 10, "toplay": 21, "dropped": 3, "playing": 4}, "playtime": 1, "achievements_count": 39, "ratings_count": 13, "suggestions_count": 436, "game_series_count": 0, "reviews_count": 13, "platforms": ["Nintendo Switch", "PC"], "developers": ["Darjeeling", "Labyrinth City"], "genres": ["Adventure", "Casual", "Indie", "Puzzle"], "publishers": ["Pixmain"], "esrb_rating": null}