{"id": 536764, "slug": "word-search-2", "name": "Word Search", "name_original": "Word Search", "description": "<p>Word Search Puzzle game is a beautiful word finder &amp; puzzle game. Swipe all hidden words and unlock at each level a beautiful badge. Start the word hunt now!  The game is available in 16 different languages.<br/></p>\n<p>You can connect words in any direction! Swipe up, down, left, right, or sideways to form the answers. Don’t think it’s that easy though! You have limited time to solve each puzzle-- and sometimes the word bank is missing a few letters! Be ready for a challenge!</p>\n<p>Library of word search puzzle books containing Themed word searches, Holiday word searches (including Christmas and Halloween), Biblical word searches, and more.</p>\n<p>Find the words listed at the top, in the letter grid below. Intersecting words are hidden forwards, backwards, up, down and diagonally. When you have found all the words you have solved the puzzle!</p>\n<p>Train your brain and vocabulary with the brand new word search game!</p>\n<p>Combining the best features of word find, word search and crossword puzzles.</p>\n<p><strong>HOW TO PLAY :<br/></strong>- Swipe up, down, left, right or diagonally to search for given words<br/>- Each puzzle has a clue to which all words are related<br/><br/></p>\n<p><strong>FEATURES:<br/></strong>- Unlimited levels is waiting for you,<br/>⭐  Beautiful visual experience.<br/>⭐ Suitable for both kids and adults.<br/>⭐ Easy to play anytime, even without wifi.<br/>⭐ NO need to rush. There is no time limit or penalties.<br/>⭐ Easy to play with a fresh and modern look<br/>⭐ Have fun in the Quest road and play smarter and smarter puzzles<br/>⭐ Play without connection, whenever and wherever you want<br/>⭐ No timer, no pressure<br/>⭐ Special rewards: the more words you found, the more coins<br/>⭐ Unlock 23 themes, with more to come<br/>⭐ Relax mode with an infinite numbers of grids with difficulties for everyone<br/>⭐ 16 different languages with more than 3000 words per language</p>\n<p>If you’re a fan of free, relaxing offline games, including crossword puzzles, trivia games, word games, or even the classic card games, give the word search game a try!</p>\n<p>Download it and PLAY it NOW for FREE!<br/><br/></p>\n<p><strong>Contact Us<br/></strong>If you have any questions or suggestions about my Privacy Policy, do not hesitate to contact me at (ivanbaranasic33@gmail.com).</p>", "metacritic": null, "released": "2020-12-21", "tba": false, "updated": "2020-12-25T08:24:10", "background_image": "https://media.rawg.io/media/screenshots/954/954abf5fd05aabfa4d6948ca6fab5d47.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 38, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Free Games And Fun"], "genres": ["Adventure", "Educational", "Puzzle"], "publishers": [], "esrb_rating": null}