{"id": 536796, "slug": "a-snowmans-saga", "name": "A Snowman's Saga", "name_original": "A Snowman's Saga", "description": "<p><strong>Controls</strong></p>\n<ul><li>WASD/Arrow keys to move Snowman</li><li>Collect Snowman's items and as many presents as possible!</li><li>Avoid the fruitcakes and ugly sweaters, which will lower your score when they hit you and move your present around.</li><li>Gain a multiplier in Present Rush mode, but watch out. Even more enemies will spawn!</li></ul>\n<p>Apologies if the game is too slow or literally unplayable for some reason - there's a bug regarding v-sync one of my playtesters experienced that I haven't been able to get around. Try using another browser if this doesn't play correctly for you. I've tested it on 4 other computers and can't reproduce it.</p>\n<p><strong>❄️ Great Winter Game Jam - 2020 ❄️</strong></p>\n<p>I'm truly grateful to participate in this GJ and to have learned so much from it. The optional mechanic for this GJ was <strong>Risk &amp; Reward</strong>. My favorite type of risk vs. reward scenarios are time-based, so I implemented Present Rush mode which increases the number of enemies spawning around you while also racking up your final score quite a bit.</p>\n<p><strong>The Write-up</strong></p>\n<p>WOW - this was such an amazing experience. This is my first game jam! I had a tough time submitting this to itch.io but here it is.<br/></p>\n<p>First off, everything you see and control in the game was modelled or programmed by me, except for the wonderful <strong>AllSky</strong> which I used for my skybox/lighting (and I hope to make some myself soon!) and <strong>Snow Materials</strong> by Danil Piskor. I used <strong>Blender 2.91</strong> for all of the other textures and modelling.</p>\n<p>I started working on this around the 10th of December with a lot of hope and a little too much scope creep. I started with the GDD, which helped my immensely in nailing down exactly which elements to 100% keep and which ones could be cut without an issue. From there I worked on the initial movement - trying to get the player to move with the camera was such a pain in the rear. With intense Googling I learned about Slerp and all the goodies that came with it. From there, the core mechanics were relatively simple to program. What really troubled me most was integrating the UI system and trying to understand how to effectively tween from code. </p>\n<p>My biggest disappointments would be the models and the music. I found the perfect music but spent so much time fine-tuning the core gameplay experience that I had it on the backburner for too long. With the models, I really screwed up with the Christmas tree. The lighting is barely even done! I also had plans to include other things like stockings for even more points, spawning dreidels which gave you more time,  a tinsel enemy, and a handful of other ideas. In the end it was because I didn't respect the core player experience enough, and by the time I got player feedback it was too late to continue working on the polish. And the bugs! Isn't it great how Snowman can just take off flying endlessly from a great enough height? Just amazing. I've learned my lesson regarding early playtesting the hard way now, even though I know how to disable player input when they aren't colliding with anything I didn't put it in until I decided to laser focus on the core gameplay. I also regret not making a persistent high score object! That one really made me connect my head to my desk.</p>\n<p>What I don't regret: I don't regret the way the Snowman moves, which was really hard to get right using a Cinemachine free look camera. I have a long way to go to really master Cinemachine but it felt amazing to see that little guy scoot around relative to the camera. Also, the presents were from a super fun tutorial and they looked even better when I imported them into Unity. And I know the base particle system is lightyears behind shader graph but I really liked making Snowman's frost trail and animating him exploding at the end of every level. I honestly can't wait to do more GJs in 2021 just to make even more complicated particle systems.</p>\n<p> I have a newfound respect for tools like Notion or Google Calendar now, as getting organized in my notes/planning is what really saved me in the long run. Because I blocked off dates and times to do X amount of work I put myself in a position where there was actually a game to be played here and not a project full of messy half ideas as many of my \"prototype\" games are. As I mentioned before, the GDD I got from the Unity online certification course is also a big lifesaver (you can find it under this section in the course).</p>\n<p>The amount of knowledge this experience has given me far outweighs the regrets I have, however. I feel like I've broken through a barrier when it comes to truly understanding how to create functional UI, and with animations to boot. I've learned a lot about the input system, tweening via script, particle effects, and translating everything to the player in a way that makes sense. There are many more things I tangled and triumphed over involving Unity, but my skill with Blender was also tested during all of this! I've been using Blender for about 2 and half years now and feel very comfortable in it, but I had to come out of my comfort zone quite a bit to get the exact textures I needed. There were so many more textures I wanted to bake and get into Unity, but this too met the crunch hammer. I'm currently on a Youtube binge watching every UV unwrapping video under the sun!</p>\n<p>Thank you all for playing, thank you for reading, and thank you to everyone else who participated! I loved everyone else's projects and I can't wait to see more.</p>\n<p>-T.A.</p>", "metacritic": null, "released": "2020-12-21", "tba": false, "updated": "2020-12-25T08:30:49", "background_image": "https://media.rawg.io/media/screenshots/e87/e87fd169b191d2ecd9e2dfc0777fc7fb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 9, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["tturner0"], "genres": ["Action"], "publishers": [], "esrb_rating": null}