{"id": 536888, "slug": "fraymakers", "name": "Fraymakers", "name_original": "Fraymakers", "description": "<h3>What is Fraymakers?</h3>Fraymakers is the ultimate customizable platform fighting game, featuring a cast of some of indie gaming's biggest icons. Duke it out with up to 4 players*, and call on assists to help out in the heat of battle. Create or play custom characters, stages, modes, and more for infinite fun!<h3>Key Traits</h3><ul><li><strong>Easy to pick up, hard to master</strong> - Fraymakers is designed to be friendly to new players and challenging and expressive for veteran players. You’re going to have a ton of fun whether you want a quick round with your friends or you’re looking to climb the leaderboards.<br/></li><li> <strong>Rollback Netcode</strong> - If you’ve been part of the fighting game community over the past few years, you know that rollback is the gold standard for fighting game netcode. We’ve prioritized and designed around rollback from the outset of development, meaning that Fraymakers will provide the smoothest possible online experience.<br/></li><li> <strong>Full Movesets</strong> - With over 80 animations per character, we've skipped nothing! Each character comes complete with every motion and attack you've come to expect from a platform fighter as well as some brand new techniques.<br/></li><li> <strong>Assists</strong> - Choose from a massive selection of indie characters to unleash an attack, fire a projectile, buff your character, or inflict a special status effect on your foes.<br/></li><li> <strong>...And Infinite Expandability!</strong> - We designed both the game and our custom content editor to be accessible and powerful. We want the process of creating your own content to be simple and fun. Whether you're a player or a creator, this means that the possibilities are endless.</li></ul><br/>* Local multiplayer requires the use of a gamepad for each additional player (and keyboard may be used for one player slot)", "metacritic": null, "released": "2022-03-22", "tba": false, "updated": "2023-03-03T08:21:46", "background_image": "https://media.rawg.io/media/screenshots/888/8887498def8970889a785a04178b0d59.jpg", "website": "https://www.fraymakers.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 10, "toplay": 5, "dropped": 2}, "playtime": 4, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 129, "game_series_count": 0, "reviews_count": 1, "platforms": ["Linux", "macOS", "PC", "Nintendo Switch"], "developers": ["McLeodGaming", "Team Fray"], "genres": ["Action", "Adventure", "Fighting", "Indie"], "publishers": ["McLeodGaming", "Team Fray"], "esrb_rating": null}