{"id": 536890, "slug": "fitness-boxing-2-rhythm-exercise", "name": "Fitness Boxing 2: Rhythm & Exercise", "name_original": "Fitness Boxing 2: Rhythm & Exercise", "description": "<p>Work out at home and punch to the beat. Jab, uppercut, dodge, and more to catchy pop tunes in this rhythmic boxing game. Pass a Joy-Con™ controller to an exercise buddy and box to the beat together. Customize your workout with the help of a virtual instructor. Choose from nine virtual instructors, select a challenge level from light to heavy and have a workout prepared for you by your trainer, or create one all by yourself from scratch in Free Training. Check out detailed examples, practice specific moves, and receive helpful feedback from your instructor to get the most out of your workout. Warm up with the original Fitness Boxing game and then transfer your profile to the Fitness Boxing 2: Rhythm and Exercise game. Keep your progress from the original Fitness Boxing game and transfer your profile to the Fitness Boxing 2: Rhythm and Exercise game. Get your daily workout on and box (and bop) to the beat. Pass a Joy-Con controller (or two) to a workout partner to enjoy a 2-player boxing session lead by your in-game instructor. These virtual trainers have different personalities and styles, so try them out and find the one that suits you best! Complete achievements to receive tickets you can redeem for outfits to deck out your trainer in fitness fashion.</p>\n<p>Whatever difficulty you play on, you can revisit specific exercises for practice or watch detailed examples to observe perfect form.</p>\n<p>Fitness Boxing 2: Rhythm &amp; Exercise is a way to get in a guided workout, track your activity, and listen to some popular, upbeat jams.</p>", "metacritic": 66, "released": "2020-12-03", "tba": false, "updated": "2024-04-09T13:57:02", "background_image": "https://media.rawg.io/media/screenshots/fe6/fe695114a45aa78261893eb2b3d0a3fb.jpg", "website": "https://fitboxing.net/2/", "rating": 4.14, "rating_top": 4, "added_by_status": {"yet": 1, "owned": 2, "beaten": 2, "toplay": 2, "dropped": 1, "playing": 6}, "playtime": 0, "achievements_count": 0, "ratings_count": 7, "suggestions_count": 21, "game_series_count": 1, "reviews_count": 7, "platforms": ["Nintendo Switch"], "developers": ["Imagineer Co.,Ltd."], "genres": ["Sports", "Family"], "publishers": ["Nintendo", "Imagineer Co.,Ltd."], "esrb_rating": null}