{"id": 536964, "slug": "fun-run-3d", "name": "Fun Run 3D", "name_original": "Fun Run 3D", "description": "Welcome to the wonderful world of Fun Run 3D<br/><br/>Growth your survival mode with this highly interactive fun run 3D<br/>Compete with others and get the real parkour experience. <br/><br/>Fun run racing adventure<br/>Set on a fun-filled run racing adventure to challenge your survival reflexes with this exciting game. Filled with lots of exciting gameplay elements, this game is designed to get the adrenaline pumping through your bloodstream. <br/>Every level has a new unique experience.<br/>Free 3d Run Race, Be the Best!<br/>Fun Race Adventure, 3D Running Race, Free Race 3D, Run Race Run, Runner Crowd <br/>Jump race helps you to jump on wall to wall.<br/>Run and run never stop running! <br/><br/>New characters every day<br/>Apply a new strategy every day by following unique game logic and experience. Use smooth tap and release game controls to clear the levels.<br/><br/>Smooth game controls<br/>Eliminate the hassle of lag-filled, sloe gameplay as this 3D runner is designed to offer you the most responsive gameplay and smooth controls. Hold your breath as you move from one barrier to next. You will never know what is coming!<br/><br/>How to play Fun Run 3D<br/>- Pick your characters<br/>- Hit the play button<br/>- Hold to run and release to stop<br/>- Overcome stampede to survive<br/>- Collect cash and unlock cool characters<br/><br/>Features of Fun Run 3D<br/>- Attractive graphics and appealing design elements<br/>- 3D view of the game zone for a boosted thrill<br/>- Adventurous fun racer game <br/>- New challenges at every step of the way<br/>- Filled with tough levels and stampedes<br/>- Exciting new game characters to choose from the store.<br/>- Increase your score and set a new record<br/>- Customize your character; Skin, Clothing, Dance, and many more!<br/><br/>Would you like to experience the delight of an action-filled 3D Racer game? Download fun run 3D Today!", "metacritic": null, "released": "2019-12-14", "tba": false, "updated": "2020-12-28T02:35:04", "background_image": "https://media.rawg.io/media/screenshots/883/8831920ef71a4005cf2234a3b0f8b0e3_Ya01RFO.jpg", "website": "https://avongames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 51, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Akbari Bhaveshbhai"], "genres": ["Sports", "Casual"], "publishers": ["Akbari Bhaveshbhai"], "esrb_rating": "Everyone 10+"}