{"id": 537290, "slug": "defuse-docster", "name": "Defuse (Docster)", "name_original": "Defuse (Docster)", "description": "<p><strong>WELCOME:</strong></p>\n<p>This game was made by using C64studio for the C64 Cassette 50 Charity \r\ncompetition. \"Cassette 50\" was an infamous collection of games published \r\nby Cascade in 1983 and an early example of shovelware, marketed on the \r\nbasis of sheer quantity rather than the quality or playability of its games. \r\nThis competition is about creating a brand new compilation tape - with any proceeds to be donated to charity. To help achieve the aesthetic from the original, there is a tight limit on the amount of memory the complete game can use: all code and data is located below $1000 (4K) in the c64 memory....<br/></p>\n<p>AIM OF THE GAME:</p>\n<p>You are the leader of the Bomb Squad. Evil terrorists has planted the a bomb with a timer on the nuclear plant, and if the bomb explodes the  world will go under. The bombs timer is using advanced technology, so the only way to make it stop is to cut the wire when it is 5 seconds or less before it explodes. This could have been an easy task if you knew how many seconds  that will pass before it explodes... But the timer is ticking from zero and up,  and what time it is exploding is totally random.<br/>So... Do you feel lucky today??!? </p>\n<p>CONTROLS - HOW TO DEFUSE THE BOMB:</p>\n<p>Use spacebar to start the timer. When timer starts, press and hold space. The moment you release space bar you cut the wires. If you cut at the right time, you will save the world! If not.... You are DEAD!</p>\n<p>CREDITS:<br/>Programmed by Docster <br/>PETSCII graphics is made by Rotteroy<br/>(C) Megastyle and Phoenixware 2020/2021</p>\n<p>TECHNICAL INFORMATION:</p>\n<p>The game will be made available for downloading March 31st 2021, and is in other words not available for download before that date. (This is because this game is part of a competition submission which was made exclusively for the C64 Cassette 50 Charity Competition) </p>\n<p>For more info, visit:<br/> 50 cassette</p>", "metacritic": null, "released": "2020-12-26", "tba": false, "updated": "2020-12-28T03:50:57", "background_image": "https://media.rawg.io/media/screenshots/372/3728bd3d38dce45ef67ff6a3526503ad.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 36, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Docster"], "genres": [], "publishers": [], "esrb_rating": null}