{"id": 537587, "slug": "back-to-school", "name": "Back to school", "name_original": "Back to school", "description": "<p>Back to school is a simple fun game settled in a classroom.<br/></p>\n<p>Inspired by my children, both at primary school, it is an occasion to test Godot engine on a simpe top-down videogame genre. It has an isometric view and many gameplay mechanisms like sprites\\walls collisions,  path planning, fighting, object collecting, inventory and throwing collected objects. Win version supports 2 players on screen (keyboard or 2 joypads)<br/>Customize user name in game settings to change the player sprite nickname and have your score in public leaderboard.<br/></p>\n<p>The software collects statistical data for app improvements, user can disable this behaviour in app settings. <br/></p>\n<p>Rules of the game:<br/>Victory condition: Teacher has to be defeated.<br/>Enemy attack causes decreasing of life points. Collecting items (apple, coke..) give extra life points.<br/>Books, plants and paper balls can be collected and throwed to obtain game points.<br/>Be carefull to not hurt any class friend because all the class will react fighting you.</p>\n<p>License:<br/>This software is provided as-is, without any express or implied warranty. In no event will the authors be held liable for any damages arising from the use of this software.<br/>The software collects statistical data about application usage, user can disable this behaviour in app settings.</p>\n<p>Credits:<br/>- Game engine supported by Godot 3.2.1<br/>- Iso classroom environment grfx assets from macrovector: https://www.freepik.com/free-vector/lecture-room-with-big-chalk-board-desks-mass...<br/>- Characters are from Mixamo site: https://www.mixamo.com/#/?page=3&amp;type=Character<br/>- Models and animations Rendered by Vpiro built using Blender 2.8<br/><br/></p>", "metacritic": null, "released": "2020-12-25", "tba": false, "updated": "2020-12-28T05:05:01", "background_image": "https://media.rawg.io/media/screenshots/0c5/0c5193b09ce67aeaf66843b2b4bec3f1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 58, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Android"], "developers": ["vpiro"], "genres": ["Action"], "publishers": [], "esrb_rating": null}