{"id": 537750, "slug": "r-type-final-2", "name": "R-Type Final 2", "name_original": "R-Type Final 2", "description": "<p>For the first time in nearly two decades, you can experience R-Type Final 2, now on PC! Feel the rush of mowing down hordes of Bydo with your fleet of R-Type fighters equipped with an arsenal of new and classic wave cannons, force units, bit devices, and devastating delta weapons. The Bydo threat is always evolving, as new enemies spawn from the wreckage of fallen foes, and stages are corrupted and altered by the sentient Bydo corruption. R-Type Final 2 unites the explosive action of the original games with modernized visuals and gameplay features, making this a must-have title for new and old shoot-&#39;em-up fans alike.<br />\nEnhanced and Evolved<br />\nR-Type is back and better than ever! Experience the explosive return of the legendary shoot-&#39;em-up on PC, where the high-octane action of the original games meets contemporary visuals, challenging gameplay, and an arsenal of new features.evolving enemies, stages that transform before you, and a real-time difficulty meter increases or decreases based on your performance.<br />\nUniversal Challenge<br />\nThe performance-based difficulty system adjusts to each player’s individual experience, making this game accessible to new and old pilots alike. When you’re done decimating the alien hordes, check out the worldwide leaderboard to see how you stack up against other pilots!<br />\nCustomized Loadout<br />\nPersonalize every element of your ship, including its color, weapon type, and decals. Additionally, choose among dozens of fighters that appeared in previous installments, and even customize your pilot to your liking.</p>", "metacritic": 73, "released": "2021-04-30", "tba": false, "updated": "2023-11-04T15:45:13", "background_image": "https://media.rawg.io/media/games/7f8/7f8bbaea1a128d9115781f6733b1c905.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 55, "beaten": 1, "toplay": 4, "dropped": 1}, "playtime": 2, "achievements_count": 140, "ratings_count": 3, "suggestions_count": 236, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC", "Xbox One", "Nintendo Switch", "PlayStation 4", "Xbox Series S/X"], "developers": ["Granzella"], "genres": ["Action", "Shooter"], "publishers": ["NIS America"], "esrb_rating": "Everyone 10+"}