{"id": 537740, "slug": "ryte-the-eye-of-atlantis", "name": "Ryte - The Eye of Atlantis", "name_original": "Ryte - The Eye of Atlantis", "description": "<p>Orichalcum Pictures presents Ryte - The Eye Of Atlantis. A VR experience that takes you through an epic journey as you travel back to the ages of mythical Atlantis. This ancient Greece and Myst-inspired VR adventure game, has players discover an authentic depiction of what historians and philosophers like Plato or Herodote imagined the long lost fantasy civilization of Atlantis to be.</p>\n<p>Explore a mystical world with our company, Historia Time Travel</p>\n<p>Set sail to the legendary city of Atlantis, standing atop the fertile central plains of a mountainous island which rose straight from the ocean of ancient Greece. Visit the citadel’s main harbor sprinkled with outdoor markets filled with occult artefacts, statues and worshiping venues. Meet the village fishermen and its sacred temples, acquire supernatural powers and let your spiritual beliefs guide you through the Atlanteans religious wisdom and mysticism practices.</p>\n<p>A dreamlike adventure</p>\n<p>Alternate history fans will be transported to the lost civilization of Atlantis to unravel its mysteries, wield supernatural powers and, maybe, prevent a global catastrophe. Fill in the sandals of an Atlantean unfairly jailed and escape from captivity. Join forces with the clerics to find the oracle and witness epic battles where giant centurions battle for the sake of Atlantean Minds.</p>\n<p>Physics puzzles and logical mindbenders</p>\n<p>Decode secret messages to gather clues, read the sky and the constellations to channel the stars power , play with mystical energies to open your path. With the guidance of Atlantean allies like Danae, players will learn how to use complex mechanisms to solve challenging puzzles. Your logic skills will be put to the test, leaving you without a minute to rest. At the same time, you will acquire telekinesis powers, allowing you to manipulate the environment to your advantage.</p>\n<p>Multiple endings</p>\n<p>Throughout the course of the adventure, players will constantly have to weigh the consequences of their actions, as moral decisions, quick wits and an eye for secrets will determine one of fours distinct endings and the fate of both Atlantis and oneself.</p>\n<ul>\n<li>Immerse yourself into an antique thrilling world to unlock the mysteries of Atlantis filled with strange machines, mind-bending puzzles and supernatural powers.  </li>\n<li>Progress through the levels as you solve puzzles, decipher riddles and explore a mythical universe where your moral choices will directly impact the storyline and its ending.  </li>\n</ul>\n<p>Get ready to craft your own legendary saga when, Ryte - The Eye of Atlantis, releases for Steam VR and Oculus this winter.</p>", "metacritic": null, "released": "2021-01-27", "tba": false, "updated": "2021-01-29T03:21:09", "background_image": "https://media.rawg.io/media/screenshots/e65/e6575cc596c20e8056e6979fec2202fc.jpg", "website": "http://ryte-atlantis.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 2, "toplay": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 354, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ebim Studio", "Orichalcum Pictures", "Digiteyes", "VR-Connection"], "genres": ["Adventure"], "publishers": ["Orichalcum Pictures"], "esrb_rating": null}