{"id": 537886, "slug": "soul-force", "name": "Soul Force", "name_original": "Soul Force", "description": "<p><em>The Soultron star system has been at peace for millenniums, the echoes of warfare long faded, its people living in hope for a never-ending peaceful existence.</em><br/></p>\n\n<em>\n<p>Yet some had looked out into the skies, wondering what lay beyond, and what dangers could descend upon their peaceful worlds. In secret they developed project <strong>Soul Force</strong>, an advanced space fighter designed to defend the Soultron system from an outside threat.</p>\n<p>And from the darkness of deep space comes a terrible bio-mechanical fleet swarming into the Soultron star system, monstrous creations descending upon the peaceful planets, tearing into the ground for reasons unknown. Communication attempts remain unanswered, the invaders obliterating any ship brave enough to approach...</p>\n</em>\n<p><em>We have chosen you to launch and pilot the new <strong>Soul Force</strong> space fighter against this terrifying threat and liberate our star system. Learn our enemy’s plans and put a stop to them for good. The fate of our star system lies in our hands. You are our last and only hope...</em></p>\n<p><strong>Soul Force</strong> is an outstanding and immeasurable SHMUP game for your Commodore 64 personal computer. It is the long awaited first cartridge release from Sarah Jane Avory, known for her other SHMUPs <strong>Neutron</strong> and <strong>Zeta Wing</strong>. If you haven't seen these highly popular space shooters yet, you had better head over to her itch.io page and give these games a shot.</p>\n\n<p><strong>Key Features of <strong>Soul Force</strong>:</strong><br/></p>\n<ul><li><strong>20</strong> adrenaline filled horizontal shoot’em up levels, each with their own distinct graphical theme</li><li>A dedicated bitmap screen and music for each level</li><li>Seven in-game bonus items to collect</li><li><strong>Four</strong> individually upgradable weapon systems</li><li>General ship upgrades</li><li>Lots of boss fights</li><li>Four difficulty settings</li><li>Password and flexible save game system</li><li>Progress automatically saved to cartridge</li><li>Fully PAL &amp; NTSC compatible</li></ul>", "metacritic": null, "released": "2020-12-31", "tba": false, "updated": "2021-01-01T02:30:45", "background_image": "https://media.rawg.io/media/screenshots/0cc/0cc492a7e9d62e3f59e6e7e33d8b6142.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 182, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Protovision"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}