{"id": 537809, "slug": "snow-love-and-christmas-magic", "name": "Snow, love and Christmas Magic", "name_original": "Snow, love and Christmas Magic", "description": "<p>This novel was created for the Winter VN Jam 2020 (Winter VN Jam 2020 - itch.io) and it is still a work in progress.</p>\n<p>The story was created by my amazing and creative girlfriend.</p>\n<p>The characters were created by me using the AMAZING Mannequin software (Mannequin by AR14 (itch.io))</p>\n<p>Music and programming were also done by me.</p>\n<p>Hope you enjoy!</p>\n<p>Camila is a young woman who decides to completely change her life: moving to the other side of the world. An adventure full of cold days, fantastic food, a new love and that kind of magic that can only happen on Christmas!<br/></p>\n<p>This is a lesbian romance and it is still a work in progress! </p>\n<p>The english version will be fully supported over the next few days, and we will update the story with the next chapters. Please note that only the first chapter is currently included.</p>\n\n<p>Português:</p>\n<p>Camila é uma jovem que decide mudar de vida da maneira mais radical possível: indo para o outro lado do mundo. Uma aventura cheia de dias frios, comidas fantásticas, um novo amor e a magia que só o Natal proporciona.</p>\n<p>Este é um romance lésbico e um trabalho ainda em andamento!</p>\n<p>A versão em inglês será disponibilizada nos próximos dias, e nós iremos atualizar a histórias com os próximos capítulos. No momento apenas o primeiro está disponível.</p>", "metacritic": null, "released": "2020-12-31", "tba": false, "updated": "2021-01-01T02:14:16", "background_image": "https://media.rawg.io/media/screenshots/ce8/ce88ddafd4760342967deb92c8418ab2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 154, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MaySama"], "genres": [], "publishers": [], "esrb_rating": null}