{"id": 537972, "slug": "invasion-alpha-demo", "name": "Invasion Alpha Demo", "name_original": "Invasion Alpha Demo", "description": "<p>Invasion is a 3D rogue-like top-down shooter set in a cargo ship, you are the pilot of the ship and you are preparing to jump to FTL, the engines were almost charged as pirates teleport onto your ship and cut the FTL controls from the engine room. Over the intercom, you hear your engineer get shot. You need to fight your way to the engine room to manually engage the FTL and escape the pirate ships.<br/></p>\n\n<p>I only started this project early December, this project has a long way to go, to become what I envision it to be. All donations gave to this project will go into making it as great as it can be, I also plan to start a kickstarter with more info on future plans and goals I want to achieve at some point soon.</p>\n\n<p>The current map is planned to be nine area's long, this may change as I design the map.<br/></p>\n<p>Health can't be regained during a level,  at the end of each level, you will have the option to either heal a percentage of your health or upgrade one of your systems or weapons.</p>\n<p>Upgrades will carry through to the next run, the closer to the engine room you make it, the better the upgrades will be. If you make it to the engine room and defeat the boss you will unlock a new weapon.</p>\n<p>The demo has limited enemy types and weapons, but more will be added as the game gets updated.</p>\n<p>The first main focus will be getting the maps built and being able to go from map to map and receive upgrades or health between each map, then obstacles and story points will be added. </p>\n<p>There is also future plans for co op of at least 2 people, maybe get 4 person co op each having their own individual upgrade routes.</p>\n<p>There is no set date for finishing this project, the hope is to get the main build published before the end of August 2021 with extra updates being released as they are ready after that.<br/></p>", "metacritic": null, "released": "2020-12-31", "tba": false, "updated": "2021-01-01T02:52:27", "background_image": "https://media.rawg.io/media/screenshots/97a/97a5521d21d7f8bf8a48cb13c89cc9d4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 180, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Fortstudios"], "genres": ["Action"], "publishers": [], "esrb_rating": null}