{"id": 537945, "slug": "debri-buster", "name": "Debri-Buster", "name_original": "Debri-Buster", "description": "<p><strong>Debri-Buster </strong>is a 2D, Long-Running, Sci-Fi, Asteroid, Target shooting mini - game. Defend your spaceship hull against incoming wild debris in outer space.</p>\n\n\n<p>In this mini-game, your objective is to obliterate space debris which might affect your spaceship's hull. You are in the space, exploring in asteroid belt and you encountered a large group and mass of space debris. You have crosshair to shoot them all. Everytime you shoot a debris, you will gain a score.</p>\r\nAiming for Debris\r\n\n<p>Don't aim at the back! Always aim in front of incoming debris, due to the acceleration of a space bullet and it will give you a high possibility of destroying an incoming debris.  Use your mouse to aim for debris and left click to shoot!</p>\r\nTypes of Debris\r\n<p>There are many types of space debris in outer space, but those are common type we see every time we explore the interstellar. So far, there are three types of debris.</p>\n\r\nSmall Type\r\n<ul><li>Smaller types has the fastest acceleration/movement of the three types of Debris. It might also difficult to hit for smaller type of debris. Be sharp whenever smaller type of debris seen in the view.</li></ul>\n\r\nMedium Type\r\n<ul><li>Medium types has balanced acceleration/movement, and also not difficult to hit. </li></ul>\n\r\nLarge Type\r\n<ul><li>Large type is the most slowest of the three types of debris and very easy to aim.</li></ul>\n\n<p>\n</p>\r\nA game and featuring design, art, and code by Jerico, also known as OwllCraft\r\nSound effects are from\r\nhttps://www.zapsplat.com\r\nContributors\r\nThanks to Anant Ray, and Mad Eriksen also known as Darth Glonk, for testing the game.\r\n\n\n<p><strong>Twitter:  </strong>https://twitter.com/OwllCraft</p>\n\r\nAny Feedback Is Appreciated, thank you! If you don't mind, feel free to share your high score which you gained in the game! Show how awesome you are! :)\r\nIf you enjoyed my game, feel free to leave a rating!", "metacritic": null, "released": "2020-12-31", "tba": false, "updated": "2021-01-01T02:45:09", "background_image": "https://media.rawg.io/media/screenshots/c37/c37840f99b738fa11058e078ce1e9f58.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 189, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["OwllCraft"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}