{"id": 538131, "slug": "bio-mimics-bird-or-drone", "name": "Bio-Mimics: Bird or Drone?", "name_original": "Bio-Mimics: Bird or Drone?", "description": "<p><strong>Bio-Mimics: Bird or Drone?</strong></p><p>**WARNING: includes actual military and law enforcement drone footage of explosions, player and viewer's discretion is advised**</p>\n<p><strong>Description</strong></p>\n<p>In the past decade, drones have become increasingly commercialized and more and more of the general public have access to them. They are amazing for hobbyists, content creators, and videographers as they provide an affordable alternative to helicopter use, with their ability to survey and capture steady video from high altitudes (or low) and their flexible size. Still, their sudden widespread use has made policy-making for drones difficult to follow and brings up new privacy and airspace safety issues. Like many technologies, they also have a strong connection and history with the military. Drones have been historically used for surveillance and warfare, and their similarity to small aerial creatures, like insects and birds, have allowed both governments and military to take advantage of bio-mimetic design to create more efficient and concealed drones.  </p>\n<p><em>Bio-Mimics: Bird or Drone? </em>aims to loosely visualize the present and future of drone surveillance and aerial warfare through a flock of synthesized bird-drones set against the backdrop of actual military and law enforcement drone footage. </p>\n\n<p><strong>Bio-Mimics Application Controls </strong></p>\n<p>Press [ESCAPE] to quit the application </p>\n<p>LEFT CLICK to switch camera view to the perspective of the bird-drone that is clicked on </p>\n<p>[ARROW KEYS] to reset camera position and focus on different drone footage </p>\n<p>Continuously hold down [SPACE] to pause</p>", "metacritic": null, "released": "2020-12-30", "tba": false, "updated": "2021-01-01T03:27:52", "background_image": "https://media.rawg.io/media/screenshots/9ee/9ee84ffa5eacee5dce7c71591fd1b220.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 96, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MaddieFish"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}