{"id": 538171, "slug": "mail-call", "name": "Mail Call!", "name_original": "Mail Call!", "description": "It's time to fill the mail call! Are you ready?\r\n<p><strong>Mail Call </strong>is Harold's first original game, created in Game Maker Studio 2 and is designed not only to test new game mechanics and opportunities for the first time, but also for players to have a blast with something wildly new!</p>\r\nStory\r\n<p>You're a recently hired postman named Tom who has been tasked with filling the daily mail call that scours the post office. However, one day, the envelopes all come alive and start to envelop people, so you must use your courage and bag-throwing abilities to sack this mail once and for all!</p>\r\nPremise\r\n<p>Mail your way through seven action packed levels! Your goal in each level is to set the highest score by throwing bags at envelopes as much as you can. Be careful though, if one of the envelopes touches you, you'll have to start the level over! Some envelopes are faster than others, so keep an eye out and memorize strategies to hinder them. </p>\n<p>In each level lies a snail-speed green box. If you want to go to the next level, you just go to the box once you've completely grabbed all the envelopes, which is the correct way to complete the game!</p>\r\nCurrent State\r\n<p>The game is very early in development, so the release currently is just a demo. In the future, there are being planned many things, including more levels, more enemies and many fixes to bugs and handling! </p>\n<p>Some things to keep an eye out for when you play the demo:</p>\n<ul><li>Once you complete a level, there is no way to go back. You'll have to close the game and start over again.</li><li>The boss can't be defeated.</li><li>An enemy type isn't working at the moment.</li><li>Audio frequently layers on top of one another.</li></ul>\n<p>Regardless, I hope that you will still have the best experience with this game!</p>\r\nWELL, WHAT ARE YOU WAITING FOR? DOWNLOAD THE DEMO NOW AND GET STARTED ON FILLING TODAY'S <strong><em>MAIL CALL!</em></strong>\n<p>Game by Harold the Water Dropper</p>\n<p>Created in Game Maker Studio 2</p>\n<p>Thanks to Yo Yo Games' YouTube tutorials for helping me out!</p>", "metacritic": null, "released": "2020-12-27", "tba": false, "updated": "2021-01-01T03:38:00", "background_image": "https://media.rawg.io/media/screenshots/422/4225d97ec1a49fa08e4beced61d1a481.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 68, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Harold"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}