{"id": 538148, "slug": "some-say-it-has-always-been-here", "name": "some say it has always been here", "name_original": "some say it has always been here", "description": "<p><em>Switch off your phone. Do not go outside. Do not accept invitations from strangers. Do not turn on your phone. Only trust information obtained via dreams. Avoid panicking if stopped by a police officer. Do not attempt to leave. Avoid thought. Do not stare directly into the sun. Do not stare directly at people. Do not expect anything exciting to happen. </em></p>\n<p>:::<br/></p>\n<p>A reanimated corpse of what was supposed to be my bitsy egg jam entry. I've been putting off finishing this game for so long that I could no longer restore the mindset under which I had begun to make it. By the deadline I had most of the art and music but no writing at all, so now the script is riddled with omissions, approximations and simplifications. It's probably better off this way. I imagine the game as being set in summer or early autumn at the latest, so it's a pity I only got around to finishing it now. <br/></p>\n<p>It's vaguely related to ||[}}}°.•°.°•..°•°[|||{{{ and \\\\\\//\\\\/\\\\\\///.<br/></p>\n<p><strong>How to play:</strong> WASD or arrow keys to move, walk into things to interact.<br/></p>\n<p><strong>FLASHING LIGHTS WARNING:</strong> when interacting with the TV set after getting the tape, a scene containing a flashing light source will be played. It's very mild, I'm not even sure it counts as one, but it's better to be safe. The action is optional (almost all of the \"content\" in this game is, you can get to an ending in under a minute) and you can avoid it altogether.</p>\n<p>Please report any bugs, typos, etc.  (Known issue: it seems like sometimes either the bitsy transparency hack or the tile opacity one  does not work properly, causing visual artifacts. So far I have no idea why this should happen, I'm sorry. This only happens on some playthroughs, very mysterious.)<br/></p>\n\n<p><strong>CREDITS</strong></p>\n<p>:::<br/></p>\n<p>bitsy | Adam Le Doux<br/>bitsy hacks | managed by Sean LeBlanc<br/>pixsy | ruin<br/>RGBitsy | janosc</p>\n<p>:::</p>\n<p>aseprite | David Capello<br/>left | Rekka Bellum &amp; Devine Lu Linvega</p>\n<p>:::<br/></p>\n<p>Crowd and laser.jpg | Fabric<br/>RepublicGC1.JPG | Dubtech<br/>Docomo D506i open.JPG | TTTNIS<br/>Dropdeadcrowd.jpg | Betterthansex<br/>Gowanus22.JPG | Christopher Sclafani<br/>Manitoba Electronic Music Exhibition 2013.jpg | Ccyyrree<br/>Mobile radio telephone.jpg | Hackgillam<br/>Punk-with-strongbow.JPG | Ritzii<br/>Space is at a premium in New Orleans, whether on the street or in the shops.jpg (under CC BY 2.0) | sylvar<br/>Sharp TV VCR combo 20031009.jpg (under CC BY-SA 3.0) | SuperDude115<br/></p>\n<p>:::</p>\n<p>a fragment of a frame from the film <em>Prince of Darkness </em>(1987,  dir. John Carpenter) appears in this free interactive media software product solely for the purposes of satire, parody and education<br/></p>", "metacritic": null, "released": "2020-12-30", "tba": false, "updated": "2021-01-01T03:32:38", "background_image": "https://media.rawg.io/media/screenshots/a65/a65e5f9e5e87608422995b4ea124668a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 33, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["hideous cave goblin"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}