{"id": 538236, "slug": "ritual-666", "name": "Ritual 666", "name_original": "Ritual 666", "description": "<p>You opened a huge wooden door. The atmosphere is cold, dark. You cannot see the room, but you are hearing noises. Disturbing noises. You feel the pain of a thousand souls.</p>\n<p>Obviously, you try to run away, but the door is locked. No, it is not a dream nor a nightmare. When you realized this, it was too late already, and a loud, high-pitched laugh is penetrating your mind. You are shaking, but you are trapped. There is only one possible way: keep going forward. Step by step, blindly, you are moving. At some point, you hit a stoned structure. This laugh again... Suddenly, the light turns on. You can now see the table you collided with: there are old-looking objects on it.</p>\n<p>As you grab one of them, you notice another table with a pentagram on it. On the wall in front of you, there are blood-written instructions:</p>\n<p>\"You can see these objects on the table, they are intended to fulfill a ritual with five objects placed at each end of the pentagram. This way, you might find a combination, which will, of course, lead to two possibilities: leave this dungeon and get back to your loving family or... Well, if you take a look under your feet, the second possibility will be pretty explicit. Oh, and we will not make it easy, of course. If you reach the second possibility, this will suit our plan just fine.\"</p>\n<p>Obviously, you understood what he meant by the second possibility. You look under your feet, as he said, there is dry blood on the ground. Well, it looks like you have no choice. You grab your first item and drop it on the table. One more laugh and an hourglass begin.</p>\n<p>----</p>\n<p>Ritual 666 is a little game developed for the GGJ 2016. The theme was \"ritual\" and we had the idea to use a summoning table to defeat spirits trying to end the player's life.</p>\n<p>It is the beginning of a long adventure until the creation of the GDream studio.</p>\n<p>----</p>\n<p><strong>Diversifiers:</strong></p>\n<ul><li>Crowd Sourced</li><li>No retreat, no surrender!</li><li>One hand tied behind my back</li></ul>\n<p><strong>Credits: </strong></p>\n<ul><li>Pislari Véronica, Graphist</li><li>Pierre Roy, Sound Engineer</li><li>Victorien Lecouv Duffet, Programmer</li><li>Yohan Rimokh, Programmer</li><li>Geraldine Heuse, Programmer</li><li>Alexis Mongin, Programmer</li><li>Guillaume Robin, Programmer</li></ul>", "metacritic": null, "released": "2020-12-30", "tba": false, "updated": "2021-01-01T03:54:44", "background_image": "https://media.rawg.io/media/screenshots/48c/48cc889ae5196167db5091ee34733496.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 24, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["GDream Studio"], "genres": [], "publishers": [], "esrb_rating": null}