{"id": 538448, "slug": "garbagefield-saves-christmas", "name": "Garbagefield Saves Christmas", "name_original": "Garbagefield Saves Christmas", "description": "<p><strong>IMPORTANT: As of 12/31/2020, Joel still hasn't seen all the content of this game, which was created as a gift for him.  If you are a Vinesauce fan, please DO NOT spoil him on endings he hasn't seen.  I am releasing this as a gift to you and if you ruin it for the guy I actually made it for I will be very upset.</strong><br/></p><p>Somewhere in Sweden, trouble is brewing: Joel Jarvisson, popular streamer of Vinesauce fame, decided to write an incredibly mean-spirited letter to Santa as a joke while streaming drunk.  This wouldn't normally be a problem except for one thing: he didn't remember doing it and now he's accidentally sent it!  Now it's up to you, his anxiety-ridden incompetent cartoon cat pal Garbagefield, to try and save the holiday season!<br/><br/>Originally completed the day before Christmas Eve in 2019, this game is now available to the public for the first time!  A graphical CYOA for the Sega Master System, this game features over 365 unique images spread across dozens of wildly different endings.  The story is written with the intention of it being funny regardless of your experience with Joel's streams as well as being relevant any time of the year.<br/><br/>Included in the .7z file are the SMS ROM for \"Garbagefield Saves Christmas\" as well as the game's manual in lovely TXT format!  Recommended emulator is MEKA, though it is confirmed to also work in RetroArch.  It is unknown if it will work on real hardware at this time.<br/></p>", "metacritic": null, "released": "2020-12-30", "tba": false, "updated": "2021-01-01T04:44:05", "background_image": "https://media.rawg.io/media/screenshots/2aa/2aa66cf843347238f2fe9f2fad0f085e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 96, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Zero X. Diamond"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}