{"id": 538509, "slug": "lfz-battle", "name": "LFZ Battle", "name_original": "LFZ Battle", "description": "<p>LFZ Battle</p>\n<p>A clone of Pokemon Fire Red but with programming questions instead of Pokemon.<br/>Built with vanilla TypeScript.</p>\n<p>Disclaimer</p>\n<p>This game is only a parody.</p>\n<p>I am not affiliated with the Nintendo Company, all assets in this application were taken from third party websites and not from the game itself.</p>\n<p>If you are someone from Nintendo and would like the website taken down please email me here and I shall do so.</p>\n<p>Pokemon and All Respective Names, Images, and Sounds are Trademark © of Nintendo 1996 - 2021.</p>\n<p>A little bit of background</p>\n<p>I've been an instructor at LearningFuze for more than a year now. This game is a small collection of memories and experiences I have had working here. I had the idea of creating a game where you can battle the instructors a long time ago but I didn't have the skill at the time. After alot of grinding I was finally able to pull it off.</p>\n<p>The code is somewhat messy in my opinion. I spent a few weeks reading about design patterns and game engines and kind of funneled all my knowledge into this game. I didn't exactly plan anything, I just sat at my computer one Friday night and started prototyping. I didn't really stop prototyping and here we are.</p>\n<p>There are some portions that are really overcomplicated and some bandaid fixes that I'm not super proud of, but I will go back to refactor someday.</p>\n<p>As of now the game is for desktop only, I had planned the ability to play on mobile, but at this point I'm a little burnt out and working with loading sounds on iOS Safari and touch events is kind of not working with my brain right now. But it will be the next feature when I some more free time.</p>\n<p>Thanks for reading, please enjoy!</p>\n<p>Technologies Used</p>\n<p>- Typescript<br/>- Webpack<br/>- Babel</p>\n<p>How to Play</p>\n<p>- WASD - Move your character around<br/>- M - Unmute/Mute audio<br/>- SPACE - Interact with NPCs</p>\n<p>Features</p>\n<p>- User can preload assets<br/>- User can walk around map<br/>- User can transition between maps<br/>- User can interact with npcs<br/>- User can battle npcs<br/>- User can hear audio<br/>- User can battle gym leaders</p>", "metacritic": null, "released": "2020-12-29", "tba": false, "updated": "2021-01-01T05:01:52", "background_image": "https://media.rawg.io/media/screenshots/e78/e78e595904ecb075d35abb189417a9b6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 66, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["shadoki"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}