{"id": 538603, "slug": "gamedevhq-jam-planetcreator", "name": "GameDevHQ Jam PlanetCreator", "name_original": "GameDevHQ Jam PlanetCreator", "description": "Planet Creator\r\nA relaxing mini game about creating your own planet\r\n<p>Hello friend! This is the submission for the GameDevHQ GameJam December 2020.</p>\n<p>Enjoy \"Planet Creator\" - A relaxing mini game where you can create your own little universe. 100% COVID-free! There isn't much gameplay, but my main focus was to create something that is relaxing and enjoyable. The theme was \"new beginnings\" - what better beginning is there than an entire new universe?</p>\n<p>As always, all assets are made by myself, solo. </p>\n<p>I am a big fan of GameDevHQ and Jon and just had to participate, eventhough I had little time (moved to new country recently, new baby, etc.). I wanted to use this jam to learn more about how I can create a customization system and improve my limited GIMP drawing skills.</p>\n<p>Depending on the feedback, I might want to continue with this game and add additional elements such as life creation and vegetation creation. I would also like to implement a color picker instead of a pre-defined color palette, but at this stage it feels a bit outside of my skill level. But that would open up more fun due to more customization possibliities.</p>\n<p>Hope the mini game brings a few minutes of joy and relaxation :)</p>\n<p>As always, I captured the progress and lessons learnt in the devlog of this project.</p>\n<p>misterG (kai grr in filebase)</p>", "metacritic": null, "released": "2020-12-29", "tba": false, "updated": "2021-01-01T05:23:33", "background_image": "https://media.rawg.io/media/screenshots/0e4/0e443efbc4b442d3071ffa56259bd9bc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["misterG420"], "genres": [], "publishers": [], "esrb_rating": null}