{"id": 53879, "slug": "jack-nicklaus-greatest-18-holes-of-major-champions", "name": "Jack Nicklaus' Greatest 18 Holes of Major Championship Golf", "name_original": "Jack Nicklaus' Greatest 18 Holes of Major Championship Golf", "description": "<p>Jack Nicklaus' Greatest 18 Holes of Major Championship Golf is a golf-simulation video game developed by Sculptured Software, and published by Accolade in 1988.</p>\n<p>The game features simulations of eighteen holes from renowned golf courses in the United States, Scotland, and England: Four from Augusta National Golf Club, three from Pebble Beach Golf Links, three from the Old Course at St Andrews, two from the Riviera Country Club, two from Baltusrol Golf Club, one from Oakmont Country Club, one from Merion Golf Club, one from Muirfield, and one from Royal Lytham &amp; St Annes Golf Club. In addition, the game contains simulations of two complete Nicklaus-designed 18-hole courses: The Castle Pines Golf Club and The Golf Club at Desert Mountain.</p>\n<p>It also bears the name and likeness of American professional golfer Jack Nicklaus. Less than two years before the game's publication, Nicklaus won the final major golf championship of his career: the 1986 Masters Tournament. Augusta National Golf Club hosted the tournament. Players can compete against Nicklaus as a computer opponent, or any of eight other computer opponents of varying skill levels.</p>\n<p>Jack Nicklaus' Greatest 18 Holes of Major Championship Golf was a commercial success for Jack Nicklaus Productions and Accolade. The two companies developed it into a video game franchise, and Accolade published numerous adaptations and sequels for more than ten years.</p>\n<p>Accolade retitled the TurboGrafx-16 versions of the game to Jack Nicklaus' Turbo Golf. The game was released in TurboChip and CD-ROM formats on the console.</p>", "metacritic": null, "released": "1988-01-01", "tba": false, "updated": "2023-02-08T10:50:17", "background_image": "https://media.rawg.io/media/screenshots/4e2/4e26e79f32967c893eb089ba9d7dfb46.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 4, "beaten": 2, "toplay": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 255, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "Commodore / Amiga", "Atari ST", "Classic Macintosh", "NES", "Apple II"], "developers": ["Sculptured Software"], "genres": ["Sports"], "publishers": ["Konami", "Accolade", "Victor Entertainment"], "esrb_rating": null}