{"id": 538925, "slug": "realm-of-shadows", "name": "Realm of Shadows", "name_original": "Realm of Shadows", "description": "<p><strong>Intro</strong></p>\n<p>A Yugioh-themed roguelike/dungeon crawler I made for my SO! You probably won't be able to play this for real since it requires real life Yugioh decks and cards that we own. But if you want to, you will need:</p>\n<ul><li>A large assortment of random Yugioh cards of all types</li><li>A bunch of premade decks (probably won't match up to the ones I used, but stlil playable)</li><li>Two people who know how to play Yugioh. One is the player, the other is kind of like a DM.</li></ul>\n<p><strong>Rules</strong></p>\n<p>(The rules aren't in the game because I explained them in real life.)</p>\n<p>The player starts off with a deck of 40 random cards. You can decide how to put this deck together-  it's not supposed to be very good at the beginning, but try to go for a good mix of monsters and spells/traps. </p>\n<p>If the player runs into a monster, the player and the DM will duel according to the rules on the screen. The monsters have random decks that are either 20 or 40 cards- again, they're not supposed to be that great, but try to balance the card types so it's not completely terrible. The minibosses and bosses have actual pre-made decks and should be stronger than the normal monsters.</p>\n<p>If the player loses, the run is over, but you keep your deck with all its improvements (and also your money). Keep trying until your deck is good enough to make it to the end and win!</p>\n<p><strong>Credits</strong></p>\n<p>https://0x72.itch.io/dungeontileset-ii by 0x72</p>\n<p>https://emily2.itch.io/5-parallax-scrolling-backgrounds by Emily2</p>\n<p>https://crazybirdladygames.itch.io/pixel-tavern-inn by CrazyBirdLadyGames<br/></p>\n<p>https://assetstore.unity.com/packages/tools/ai/dialogue-system-for-unity-11672 by PixelCrushers<br/></p>\n<p>Music by my SO!</p>", "metacritic": null, "released": "2020-12-28", "tba": false, "updated": "2021-01-01T06:40:59", "background_image": "https://media.rawg.io/media/screenshots/c37/c3747a67056f2e15363d17a419b75bf2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 134, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Isana"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}