{"id": 539074, "slug": "frontline-world-war-ii", "name": "Frontline: World War II", "name_original": "Frontline: World War II", "description": "In <strong>\"Frontline: World War II\"</strong>, players command the Allied forces through some of the most famous battles of the Second World War, freeing Europe, Africa, and the Pacific theatre from the hands of the Axis powers.<br/><br/>Fight your way through 23 Campaign missions and 20 Scenarios, aim your targets carefully, counter-attack, and strategically coordinate your squads. The study of enemy tactics and the use of  <strong>Special abilities</strong> will lead to victory!  <br/><br/>New units become available as you progress through the campaign based on your ingenuity, skill, tactics, and chronology.<br/>All Units improve and unlock new behaviors once they reach the experience needed, abilities that will prove later indispensable in battle: Camouflage, Sabotage, Entrench, Over-watch, Smoke-screens, AT grenades, Artillery barrage, Shell Shock, Transport, Special Panzers, APCR, Armor Suppression, Routed, Surrounded, Infantry Charge,  sharp-shooters, encirclement &amp; flanking, deflections, penetration, critical hits, and ballistics that depend on the range of contact.<br/><br/>in this turn-based, offline-operational tactics-strategy game you get to lead your army to victory by conquering objectives in any strategy you find best.<br/><br/>In this new edition of the \"Frontline\" engine, a new  <strong>Perk</strong> system has been added and illustrated in the unit UI and for an improved atmosphere, the game now features <strong>Radio</strong>, music in the style of the 1940s, and atmospheric battle sounds. <br/><br/>The \"Frontline Games Series\" is a Solo Dev effort, I answer and appreciate all feedback. <br/><br/><strong>FEATURES:</strong><br/>✔23 Historical inspired missions (Volume I)<br/>✔22 Hard Scenarios where you will face against the full force of the enemy but also get to recruit your own army<br/>✔30xUnit specializations (Perks)<br/>✔Level up &amp; active abilities for every unit<br/>✔Massive weapon arsenal: 200+ unique units<br/>✔More 12 hours of music &amp; background radio shows<br/>✔Reinforcements &amp; supply<br/>✔Multiple objectives<br/>✔Zoom controls<br/>✔HD graphics <br/>✔Intuitive interface<br/>✔No ADS or Micro-transactions<br/>✔All DLC's are free<br/>✔Lean learning curve<br/>✔Light Turn limit<br/><br/>\"Volume I Battles\"[23 Missions + 20 Scenarios]: Pegasus Bridge, North Africa, Crete, Fort Capuzzo, Italian Offensive, Girba, Bardia, Beda Fomm, Sicily, Salerno, Cassino, Pointe du Hoc, D-day, Cherbourg, Carentan, Bastogne, Coral Sea, Ford Snipe, Solomon Islands, Guadalcanal, Guam, Peleliu, Iwo Jima!<br/><br/>If you are a player of Turn-based Strategy &amp; tactics Hex-grid WW2 Wargames, this game might be for you!<br/><br/>Cheers!", "metacritic": null, "released": "2021-01-01", "tba": false, "updated": "2021-01-04T02:16:48", "background_image": "https://media.rawg.io/media/screenshots/1b9/1b99f9ebe0ea152f81576295cdc1e23b.jpg", "website": "https://88mmgames.wixsite.com/welcome", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 6, "toplay": 2}, "playtime": 12, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 445, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Frontline: Games Series"], "genres": ["Action", "Strategy", "Simulation", "Casual", "Indie"], "publishers": ["Frontline: Games Series"], "esrb_rating": null}