{"id": 539085, "slug": "ostrova-koshki-2", "name": "Ostrova Koshki", "name_original": "Ostrova Koshki", "description": "http://store.steampowered.com/app/1205680<br/><br/><ul><li><strong>You can join the community now in instagram.com/cathoodparty</strong></li></ul><h3>SOMETHING ABOUT IT</h3><br/><br/>Imagine a small snowy island surrounded by an endless ocean from whose waters giant birches grow. There is nothing more in the whole world. The only people are a small tribe.<br/><br/>According to tradition, each child must go through a complex ritual to get rid of the evil spirit that lives in everyone from birth. This is the only way to get a name and become an adult.<br/><br/>The <strong>Boy</strong> has one last attempt to go through the <strong>ritual</strong>, and he goes on a journey for <strong>Magic Water</strong> that can make any person strong. But this potion is protected by a <strong>Grim Creature</strong> that lives in a <strong>Dark Cave</strong>.<br/><br/>Will the Boy be able to resist the danger, overcome all the difficulties, fight the Beast, become strong, return to the surface in time and undergo the rite to become part of his tribe?<br/><br/>Well, of course he will.<br/><br/><h3>SOMETHING ABOUT YOU</h3><br/><br/><br/><br/>The <strong>Boy</strong> is not a typical platformer hero: he is sensitive and fragile.<br/>Will you listen to the Boy's worries, choosing a safer path, or will you risk not caring about the child's feelings, just to get through the game as quickly as possible?<br/><br/><ul><li> Control your mental state and stamina level.<br/></li><li> Try to avoid cold water. <br/></li><li> Look for shelter so as not to freeze.<br/></li><li> Go to bed to restore your strength and save game progress. <br/></li><li> Learn how to overcome various types of enemies, traps, and mechanisms.<br/></li><li> Get to know new proverbs and sayings to better understand the nature of this world. <br/></li><li> Pay attention to the details to discover a new depth of this story.<br/></li><li> Eat well and rest well.<br/></li><li> Get back to the village in time.</li></ul><br/>You only have one chance to go through the rite. When you fall, the game is over. There are no continues, my friend.<br/><br/><h3>SOMETHING ABOUT US</h3><br/><br/><br/><br/>We are a team of two novice developers from Irkutsk, Russia. This is our first experience of game development, and we have many interesting ideas that we want to implement.<br/><br/><strong>Ostrova Koshki</strong> is a very personal game. I think it's easy to guess that I often imagine I'm the <strong>Boy</strong>, and the <strong>Cave</strong> is a video game development. The release of the game is a <strong>ritual</strong>, the culmination of many years of work, where I have only one attempt to prove myself.<br/><br/>If you find our game at least a little cute, add it to your wishlist and come see my growing-up ritual when the game is finished. <br/><br/><h3>SOMETHING ABOUT A CATHOOD PARTY COMEBACK COLLECTION</h3><br/><br/><br/><br/><strong>Cathood Party: Comeback Collection</strong> is a game series consisting of four games:<br/><br/><ul><li> <strong>Game of the year</strong>, a rhythm arcade about the importance of simple moments when you can just fool around with your friends and forget about all your worries.<br/></li><li> <strong>Shaman You</strong>, a casual novel about mental and physical health on days when life turns upside down.<br/></li><li> <strong>Cathood Party</strong>, a JRPG in which you play the role of the party leader and your strongest weapons are ethics and empathy.<br/></li><li> <strong>Ostrova Koshki</strong>, an action platformer about teenage issues in primitive world.</li></ul><br/>These games are autonomous, but all together they are telling an entirely new story. You will find out about it soon enough.<br/><br/><strong>Thank you</strong> for your attention.<br/><br/><br/><br/><br/>See you<br/>Someday, somewhere", "metacritic": null, "released": null, "tba": false, "updated": "2021-01-04T02:22:35", "background_image": "https://media.rawg.io/media/screenshots/ed9/ed9812a4e10c7934d5964f75a5839341.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 128, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["surikovdanya"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["surikovdanya"], "esrb_rating": null}