{"id": 539118, "slug": "bedazzle-by-number", "name": "Bedazzle by Number!", "name_original": "Bedazzle by Number!", "description": "The #1 color by number game. Fill images with beautiful diamond pixels to create your own unique art. Enjoy happy canvases full of unicorns, hearts, cakes, and more. Press diamond pixels around the canvas bringing beautiful images to life. Draw diamond icing on a diamond cake, bring a beautiful dress to life, you name it, you can paint it ...with diamonds!<br/><br/>SUBSCRIPTION DETAILS<br/><br/>- Subscribe for unlimited access to all models with weekly, monthly and yearly subscription plans.<br/>- All subscription plans unlock all models for the duration of the subscription and remove ads.<br/>- Three membership tracks:  A weekly track (for 4.99$/week), monthly track (for 9.99$/month) and yearly track (for 49.99$/year). <br/><br/>- Payment will be charged to your iTunes account at confirmation of purchase.<br/>- Subscriptions automatically renew unless auto-renew is turned off at least 24 hours before the end of the current period.<br/>- Account will be charged for renewal within 24 hours prior to the end of the current period.<br/>- Subscription may be managed by the user and auto-renewal may be turned off by going to the user’s Account Settings after purchase.<br/>- By downloading this App you agree to Crazy Labs’s Privacy Policy and Terms of Use at https://crazylabs.com/privacy-policy/ and at https://www.crazylabs.com/terms-of-use/.<br/>- Please consider that this App may include third party services for limited legally permissible purposes.<br/>- Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication.<br/><br/>To opt out of CrazyLabs sales of personal information as a California resident, please visit our Privacy Policy: https://crazylabs.com/app", "metacritic": null, "released": "2020-12-29", "tba": false, "updated": "2021-01-04T02:42:22", "background_image": "https://media.rawg.io/media/screenshots/d0d/d0d780ad2ad9cfa1a01761b9b64619fd_S2RidwJ.jpg", "website": "https://www.crazylabs.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 43, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Crazy Labs"], "genres": ["Simulation", "Puzzle"], "publishers": ["CRAZY LABS BY TABTALE , G.P."], "esrb_rating": "Teen"}