{"id": 539269, "slug": "the-scholarton-college-of-meat-studies", "name": "The Scholarton College of Meat Studies", "name_original": "The Scholarton College of Meat Studies", "description": "<p>The Scholarton College of Meat Studies is a spur of the moment setting created collaboratively by myself and some of my players after they inadvertently animated a few skeletons. The questions we immediately had to tackle were \"how much do skeletons understand about the workings of the universe?\" (Answer: not much), \"how do they begin to understand themselves?\" (Answer: strangely), and \"What do they make of the difference between themselves and flesh covered folk?\" (Answer: by concluding Meat is a parasite which envelops and controls skeletons). </p>\n<p>The idea made me too happy not to do something with, so the logical conclusion is obviously that the Skeletons would go on to found a university to explore metaphysics and the ultimate question of the nature of life in a Meat-filled world. Within is a three page zine (and an accompanying plaintext file) detailing some major aspects of the setting, such that you can incorporate it into your games, while having enough wiggle room to adapt as needed. </p>\n<p>Image Description for Cover Image: A bust view of a skeleton looking to the left on a light purple, almost grey, background. The skeleton is wearing a black, squared cap with a small ruffle on the top, and a set of robes with three buttons and a high collar. The image is cut from an entry in José Guadalupe Posada's <em>Calaveras</em> series, and was obtained through the Smithsonian Museum's creative commons archives. </p>", "metacritic": null, "released": "2021-01-03", "tba": false, "updated": "2021-01-04T03:28:53", "background_image": "https://media.rawg.io/media/screenshots/501/501eb1d3747d734e390ce9d06a9e72ef.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Hieronyma"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}