{"id": 53954, "slug": "punch-out-1987", "name": "Punch-Out!! (1987)", "name_original": "Punch-Out!! (1987)", "description": "<p>Mike Tyson&#39;s Punch-Out is one of the most popular and biggest selling video games of all time. Step into the ring as Little Mac, a 17-year-old fighter from the Bronx, ranked number three in the minor circuit. Your goal is to work your way up through the rankings so that you can challenge Mike Tyson, Kid Dynamite, in a dream fight.</p>\n<p>But the road to the championship is long and hard. You&#39;ll have to work your way up through the minor, major, and world circuits by winning 14 bouts against some very tough opponents.</p>\n<p>The rules of the World Video Boxing Association govern your bouts. Each match is three three-minute rounds long. Any boxer knocked down for a 10 count is Knocked Out (KO). If a boxer goes down three times, he&#39;ll find himself a Technical Knock Out (TKO). If both boxers make it to the end of the third round, the ref determines the winner.</p>\n<p>Once you&#39;re in the ring you&#39;ll have to beat your opponent with smart fighting. Use left and right punches, as well as uppercuts to knock your opponent to the mat. Dodge your opponent&#39;s blows with some fancy footwork. Dazzle them with your brilliance and you&#39;ll be the World Video Boxing Association Champion. On the other hand, you might find yourself down for the count.</p>", "metacritic": null, "released": "1987-09-18", "tba": false, "updated": "2023-10-08T13:44:05", "background_image": "https://media.rawg.io/media/screenshots/336/336a7b964cefa676fd63fd9744fc77e2.jpg", "website": "", "rating": 4.28, "rating_top": 4, "added_by_status": {"yet": 9, "owned": 32, "beaten": 30, "toplay": 14, "dropped": 20, "playing": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 43, "suggestions_count": 256, "game_series_count": 2, "reviews_count": 43, "platforms": ["Nintendo 3DS", "Wii U", "Wii", "NES"], "developers": ["Nintendo"], "genres": ["Sports", "Fighting"], "publishers": ["Nintendo"], "esrb_rating": null}