{"id": 539624, "slug": "asteroid-alestore-inc", "name": "Asteroid (Alestore Inc.)", "name_original": "Asteroid (Alestore Inc.)", "description": "<p>Asteroid is the latest masterpiece from Alestore Inc.<br/></p>\n<p>In this new action RPG set in space, you will be the one to forge your own path.</p>\n<p>The game world is infinite and reflects the real time of your country in such a way as to guarantee events according to the time slot.</p>\n<p>The game itself does not have its own story mode, but it is a totally free game in which the main objective is to explore, improve your ships and free planets from hostilities, carrying out a series of tasks assigned by the various NPCs that you can find around the game map.</p>\n<p>Asteroid is currently in development, and we plan to release more information in the future. The game will be available on PC on February 11, 2021 and also on Google Play Store in the near future. There will be a lot of updates once the game is out!</p>\n<p>However, not all planets will be present at the game launch. We intend to release the game with only 2 planets, and after the game launches more will be added gradually through free updates.</p>\n\n<p>We need your support to continue developing the game relentlessly. We finally thought of introducing the \"Pass\", or rewards to be included in the game, such as a new ship created by you or more in exchange for a small donation, a support.</p>\n<p>There are currently three Asteroid Passes: Bronze Pass, Silver Pass and Gold Pass.</p>\n<p>So, what do you think about Asteroid Passes? With €0,99 You get the Bronze Pass, €1,99 for the Silver Pass and €2,99 for the Gold Pass. This is a little support that you can do, and it really helps us very much.</p>\n<p><strong>Thank you for your support!</strong></p>", "metacritic": null, "released": "2021-01-02", "tba": false, "updated": "2021-01-04T04:59:29", "background_image": "https://media.rawg.io/media/screenshots/2f5/2f519490c3ab0825cc81934585a4f215.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 61, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "Android"], "developers": ["Alestore"], "genres": ["Action", "Adventure"], "publishers": [], "esrb_rating": null}