{"id": 539793, "slug": "ground-control-itch-rarelikeaunicorn", "name": "Ground Control (itch) (rarelikeaunicorn)", "name_original": "Ground Control (itch) (rarelikeaunicorn)", "description": "<p>Claim territory to deny your opponent ground control!</p>\n<p>Rules:</p>\n<ul><li>Each player must take exactly 3 steps during their turn</li><li>Blue goes first. The colored icon in the border reflects the current player, and the dice icon represents the remaining steps for the active player's turn</li><li>You may not step on the same tile twice in one turn</li><li>When your turn ends, tiles you stepped on are changed:<ul><li>If this is the first time a tile has been stepped on, it becomes Marked in your color</li><li>If you already Marked the tile on a previous turn, it becomes Claimed in your color</li><li>If you already Claimed the tile on a previous turn, it becomes Blocked</li><li>If your opponent already Marked the tile on a previous turn, it becomes Blocked</li></ul></li><li>Any player may pass over any Marked tile</li><li>Players may only pass over their own Claimed tiles </li><li>Blocked tiles are impassable for all players</li><li>The first player unable to take 5 steps during their turn forfeits</li></ul>\n<p>Currently, the game doesn't trigger the win/loss state. Please feel free to press R to start a new game when a player becomes boardlocked.<br/></p>\n<p>---</p>\n<p>An initial prototype from 2018, with added polish for release to make it not-terrible to look at and parse information from. A full version would include a classic play mode while also allowing for custom matches: grid size, starting locations (always bisymmetrical), and number of steps per turn would all be straightforward options. Extended options could include 4-player support (1v1v1v1 for sure, possibly 2v2) and movement rule modifiers.</p>\n<p>Two versions of the game, 3-Step on a 5*5 board and 5-Step on a 9*9 board, are available for download in addition to the browser-playable 3-Step above.<br/><br/></p>", "metacritic": null, "released": "2021-01-01", "tba": false, "updated": "2021-01-04T05:38:30", "background_image": "https://media.rawg.io/media/screenshots/39b/39bcee2f5d85f7a35a685b77fc33422f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 9, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["rarelikeaunicorn"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}