{"id": 539898, "slug": "curry-culc-make-weird-curries-while-doing-math", "name": "Curry & Culc - Make weird curries while doing math", "name_original": "Curry & Culc - Make weird curries while doing math", "description": "<p><strong>This is a brain training program for children and adults.<br/></strong></p>\n<p> It can be enjoyed by everyone from children to the elderly, as long as you can do the calculations required for elementary school.<br/> However, there is more than one way to answer the questions because you have to choose the numbers to match the questions and construct the equation.</p>\n<p><strong>The game has a gameplay that will keep you entertained.<br/></strong> The numbers that appear on the field are random, and the same numbers do not appear in succession.<br/> In addition, the numbers disappear after a certain amount of time.<br/> It requires not only calculation skills but also quick judgment and strategy.<br/> Also, at first, the game only requires the addition of three numbers, but if you can clear the numbers in a certain amount of time, you will be able to challenge the next difficult level.</p>\n<p><strong>Easy and fun for children.<br/></strong> The required operations are simple, so even elementary school children can play.<br/> The explanations and dialogues are as simple as possible.<br/> It's not just a game app, so it's a great way to take a break from learning at home.</p>\n<p><strong>It's all free!<br/></strong> This is a free app. There are no in-app purchases, so you can enjoy it without worry.<br/> This version also has no ads.</p>", "metacritic": null, "released": "2021-01-01", "tba": false, "updated": "2021-01-04T06:07:45", "background_image": "https://media.rawg.io/media/screenshots/d70/d700228140cb51acf74c4e630a3078fc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 65, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["popliner99"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}