{"id": 539884, "slug": "vomitoreum-kickstarter-demo", "name": "Vomitoreum Kickstarter Demo", "name_original": "Vomitoreum Kickstarter Demo", "description": "<p><strong>Support this Kickstarter here: https://www.kickstarter.com/projects/scumhead/vomitoreum</strong><br/></p>\n\n<p>A dark and arid hellscape inspired by the likes of Metroid Prime and Dark Souls, Vomitoreum is an FPS Metroidvania set in an interconnected and nightmarish world.</p>\n<p>Explore a land that has been plagued with an eldritch infection, a horrible fog that blankets the world and turns it’s denizens into wretched mutants. Delve deep into the ruins of this plagued world and find a cure for this horrid blight.</p>\n<p>You are the Nephilem, a vessel born of cosmic ash and the churning souls trapped within graves. Created as a being able to survive the hellish environment and search for a way to make the fog recede, you will scour the lands in search of tools and weaponry that will be useful on your journey.</p>\n<p>The Nephilem’s end goal is to make the infection and the fog recede, destroy the horrible demons plaguing the land, and let life flourish once again.</p>\n<p><strong>Vomitoreum has a world inspired by the painting of Zdzisław Beksiński; intense combat; challenging but fair gameplay; and a world waiting to be explored! Rise from the grave factory and see what Vomitoreum has lying in wait for you!</strong></p>\n\n<ul><li> Grotesque pixel art to bring these wretched demons and hellscapes to life.</li><li>Atmospheric world inspired by Zdzislaw Beksinski's Paintings.</li><li>Challenging but fair gameplay.</li><li>Movement and mobility that consistently re-contextualizes previously explored areas.</li><li>Minimalist combat encounters, focused on \"moment-to-moment\" encounter design.</li><li>A vast and interconnected world.</li><li>Secrets and environmental story telling around every corner.</li><li>World-building and lore, hidden within the cracks and crevices of the world.</li><li>Challenging bosses to test the player's limits.</li></ul>\n<p>In this demo:</p>\n<ul><li>Explore the first few areas of Vomitoreum.</li><li>Battle a set of Umadermadine's Monstrous soldiers.</li><li>Collect secret upgrades hidden in the nooks and crannies of the world.</li><li>Battle the first boss, a monstrous being from a time long ago.</li></ul>\n<p><strong><em>PROJECT TEAM:</em></strong></p>\n<p>Project lead: Scumhead https://twitter.com/Scumhead1</p>\n<p>Programmer: Mengo https://twitter.com/Mengo329</p>\n<p>Art and Animation Help: Batandy https://twitter.com/Batandy_</p>\n<p>Music:<br/>Immorpher https://twitter.com/immorpher64</p>\n<p>Primeval https://twitter.com/PRIMEVAL</p>", "metacritic": null, "released": "2021-01-01", "tba": false, "updated": "2021-01-04T06:04:27", "background_image": "https://media.rawg.io/media/screenshots/eb4/eb4c68f68c6d0ff2a9e8ddd469562301.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 241, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["scumhead"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}