{"id": 539835, "slug": "mastercharm", "name": "MasterCharm", "name_original": "MasterCharm", "description": "<p>Descrição em Português (Brasil):</p>\n<p>Um clássico  jogo emocionante para se divertir! Esse jogo de Slot consiste em um grande desafio para o jogador que é tentar acertar o prêmio máximo pela sorte, tudo que o jogador deve fazer é clicar no botão Spin para as Slots rodarem, quando as Slots pararem de rodar se formar na tela três figuras iguais o jogador recebe pontos de acordo com o valor atribuído a cada figura, caso não apareçam três figuras iguais na tela o jogador perde pontos, ao zerar os pontos do jogador este será direcionado a tela de Game Over, caso o jogador consiga atingir 1000 que é o prêmio máximo ele vence o jogo.</p>\n<p>Esse game só foi possível graças a colaboração do professor Lucas, do canal no YouTube intitulado Eu sou o seu professor Lucas, e algumas dicas e template de menbros do fórum da Gdevelop .  </p>\n<p>Description in (English):<br/></p>\n<p>An exciting classic game for fun! This Slot game consists of a great challenge for the player, which is to try to hit the maximum prize by luck, all the player must do is click on the Spin button for the Slots to spin, when the Slots stop spinning form three figures on the screen equal the player receives points according to the value assigned to each figure, if three equal figures do not appear on the screen the player loses points, when zeroing the player's points he will be directed to the Game Over screen, if the player manages to reach 1000 that is the maximum prize he wins the game.</p>\n<p>Prévia do Jogo no YouTube - Game Preview on YouTube:</p>\n<p>Prévia do Aplicativo no YouTube - App Preview on YouTube:</p>\n<p>Faça o Download:  AppStore\r\n</p>\n<p>Faça o Download:  PlayStore\r\n</p>\n<p>Página do jogo: Instant Games</p>\n<p>Conheça Nossa Página:  Edinesoft</p>", "metacritic": null, "released": "2021-01-01", "tba": false, "updated": "2021-01-04T05:47:58", "background_image": "https://media.rawg.io/media/screenshots/278/2788d1f5797d3c2da0cee548b59e607d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 39, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Edinesoft"], "genres": [], "publishers": [], "esrb_rating": null}