{"id": 540023, "slug": "press-any-button", "name": "Press Any Button", "name_original": "Press Any Button", "description": "<p>PRESS ANY BUTTON is an arcade-style game. It has a big emphasis on story, but it will also put your reflexes to a test!<br />\nThe game introduces a weird but sweet character named A-Eye. He is an artificial intelligence created to process data for important scientific research. When he gets bored with this assignment, he decides to turn the research into a video game. The fact that he can&#39;t draw game assets or compose music and knows nothing about game design is not going to stop him.<br />\nA-Eye will be extremely glad if you become an impartial critic for him. Make your own opinion on the game he&#39;s been working on and find out his story full of life, death, rain, and dandelions.<br />\nWhat you should know before you play:<br />\nIt will take you about an hour to complete the game.<br />\nThe gameplay consists of dialogues with the main character and of playing the game he is creating.<br />\nYou will need to stop falling blocks. If a block goes beyond the bottom edge of the screen, you will lose a life.<br />\nThe previous sentence might not sound very exciting, but you should consider that the blocks are going to look different and have unique properties.<br />\nAnd yes, the whole thing still might prove to be not very exciting. Be understanding, this is the very first game for A-Eye!<br />\nBut don&#39;t be patronizing, he doesn&#39;t like it.</p>", "metacritic": null, "released": "2021-01-07", "tba": false, "updated": "2024-03-07T01:04:56", "background_image": "https://media.rawg.io/media/games/121/1212ed1625c7d1d7fe78d473d3d2b2d4.jpg", "website": "", "rating": 3.73, "rating_top": 4, "added_by_status": {"yet": 9, "owned": 9, "beaten": 11}, "playtime": 0, "achievements_count": 4, "ratings_count": 10, "suggestions_count": 75, "game_series_count": 0, "reviews_count": 11, "platforms": ["PC"], "developers": ["Eugene Zubko"], "genres": ["Casual", "Indie"], "publishers": ["Eugene Zubko"], "esrb_rating": null}