{"id": 540036, "slug": "cruelty-squad", "name": "Cruelty Squad", "name_original": "Cruelty Squad", "description": "<p>Cruelty Squad is a tactical first person shooter set in the hardcore gig economy of corporate liquidations. You&#39;re an emotionally dead combat-substance fueled grunt of Cruelty Squad, a depraved subsidiary company tasked with performing wetworks for its host conglomerate. Will you make the Corporate Arch Demoness proud or succumb to bitter tears of failure?<br />\nHighly kinematic tactical gameplay using varied weapons such as the flechette shotgun, silenced 10mm pistol, radiation emitter, dart gun, corrosive gas launcher and more.<br />\nNo handholding!<br />\nAll of the missions have multiple viable approaches and routes. Plan out your equipment loadout to gain a tactical advantage. Choose between non-lethal and lethal options. Throw toilet bowls at enemies.<br />\nFight and sneak through offices, suburbs, police stations and secret compounds. Find and unlock hidden equipment and levels<em>.<br />\nOpen objective based gameplay, in each mission your goal is to kill or destroy your targets before heading for the exit.<br />\nRevisit earlier missions and try to beat your best time. Can you S-rank all of the missions?<br />\nEnemies including private security, cops, psycho freaks, flower hybrids, swamp cultists and mutant dogs.<br />\nTalk to NPCs and figure out the mysteries of the world.<br />\nAdvanced death mechanics.<br />\nPunishment mode.<br />\nNote: The game is in development and features detailed here are subject to change<br />\n</em>Currently only one hidden bonus level available, more planned.</p>", "metacritic": null, "released": "2021-06-16", "tba": false, "updated": "2024-04-09T09:06:37", "background_image": "https://media.rawg.io/media/games/826/8268937033816c09a50bb5a98e17b33c.jpg", "website": "https://twitter.com/CSoftproducts", "rating": 4.07, "rating_top": 5, "added_by_status": {"yet": 12, "owned": 300, "beaten": 26, "toplay": 38, "dropped": 10, "playing": 3}, "playtime": 2, "achievements_count": 2, "ratings_count": 29, "suggestions_count": 441, "game_series_count": 0, "reviews_count": 30, "platforms": ["PC"], "developers": ["Consumer Softproducts"], "genres": ["Action", "Indie"], "publishers": ["Consumer Softproducts"], "esrb_rating": null}