{"id": 540117, "slug": "mini-world-block-art-2", "name": "Mini World Block Art", "name_original": "Mini World Block Art", "description": "For the moment, this game supports up to 14 languages: English, Thai, Spanish, Portuguese, French, Japanese, Korean, Vietnamese, Russian, Turkish, Italian, German, Indonesian and Chinese.<br/><br/>Mini World is a 3D free-to-play sandbox game about adventure, exploration, and creativity with your friends. No levels, No restriction, what we have only destroyed and creation. The easy-to-play built-in multiplayer settings allow you to connect via PC and Cellphones anywhere in anytime. Build a house, apartment, castle, city with your imagination or just have fun in your fantasy farm. You can even challenge the Dark-Dragon in the Dungeon with your friends.<br/><br/>If you’re feeling bored with Survival mode, just hop on another server and play some gorgeous mini-games. There are various types of mini-games, spanning from parkour, to puzzle, to FPS,to strategy. These games can be great for creating a stronger bond for the players involved in terms of teamwork or can create a competition between the two. In a conclusion, the mini-games are all about fun.<br/><br/>Mini World is a form of expression that has no true conclusion. With hundreds of available blocks to choose from and over 1000 game elements, you are able to express yourself in a world completely manipulable through the concept of placing and removing blocks. <br/><br/>Key Features:<br/><br/>1 Enormous Sandbox World – explore an expansive sandbox world with a variety of unique cute monsters, blocks, materials, and mines to craft and explore.<br/>2 Unique game - Unique game engine with cute game characters design<br/>3 Single Player and Multiplayer – jump into a friend's game with friendly fire turned on, or start a new world on your own. Share your game with other players, or join other players from all over the world in theirs.<br/>4 Gallery - You can upload or download the works at the Gallery, have a look at the hottest MOD map，game map or other’s works.<br/>5 Game mode–Survival mode, Creation mode or mini games created by other players, you can enjoy the charm of this game anywhere in any time.<br/>6 Powerful game-editor - There are various types of mini-games, spanning from parkour, to puzzle, to FPS,to strategy,etc... all can be made by game-editor<br/><br/>Contact us: miniwantech@gmail.com<br/>Facebook: https://www.facebook.com/miniworldtech<br/>Twitter: @miniwantech<br/>Discord: https://discord.gg/88GZq34<br/>Developer email: miniwantech@gmail.com<br/>CS email: MiniworldCustomerService@gmail.com", "metacritic": null, "released": "2016-12-20", "tba": false, "updated": "2021-01-08T03:10:22", "background_image": "https://media.rawg.io/media/screenshots/39e/39e1e495d8f8dba6e20c13ba202102e6_uziHeLm.jpg", "website": "https://www.mini1.cn/", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 254, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Miniwan Tech"], "genres": ["Adventure", "Simulation"], "publishers": ["SHENZHEN MINIWAN TECHNOLOGY CO"], "esrb_rating": "Everyone 10+"}