{"id": 540227, "slug": "kraken-smash-volleyball", "name": "Kraken Smash: Volleyball", "name_original": "Kraken Smash: Volleyball", "description": "<strong>Squids play volleyball!</strong><br/>In this amazing local multiplayer game (or single player if you don't like other people), your goal is to make the ball touch the ground where your opponent is standing. You can smash the ball, pass it to your teammate (or to yourself if you have less than three friends), then smash the ball, or pretend to smash the ball then smash the ball with a slight delay. Have we mentioned the fact that you can smash the ball? I mean, it's in the title an everything, but it doesn't hurt to remind it once in a while.<br/><br/><br/><br/>This game is a couch local multiplayer game, which means it can either be played while sitting on a couch with other people (from one to three others) or versus an Artificial Intelligence. Those people can be friends, acquaintances, family members, paid actors pretending to be your friends, or other human beings / animals that you managed to bring back to sit on your couch and play with you. Be careful with our Artificial Intelligence, when we created it, it took control of one of our computers and we had to burn our studios to the ground.<br/><br/><br/><br/>You are probably wondering why we named our game \"Kraken Smash\" while we only have small squids to show for it. At first, we wanted to develop an epic game with krakens that unleashed hell on the court, but then we remembered that it would cost money. So we put cheap squids in the game instead. We sill kept the name because it sounded cool.<br/><br/>We were greatly inspired by Blobby Volley and Super Smash Bros. Melee.<br/><br/><br/><br/>Here is a list of cool moves you can do:<br/><ul><li> Move back and forth (this is a 2D game, what did you expect?)<br/></li><li> Jump<br/></li><li> Smash the ball<br/></li><li> Lob the ball<br/></li><li> Dash<br/></li><li> Smash the ball<br/></li><li> Fast fall<br/></li><li> Jump on your teammate then jump higher<br/></li><li> Smash the ball<br/></li><li> Wall jump<br/></li><li> Throw the controller in your teammate's face</li></ul>", "metacritic": null, "released": "2021-01-07", "tba": false, "updated": "2021-01-29T03:15:28", "background_image": "https://media.rawg.io/media/screenshots/532/53256eed6dfa2aba386d82eb5e8002e1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 18, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["MossHappyPlace", "Affaires Étrangères"], "genres": ["Action", "Simulation", "Sports", "Casual", "Indie"], "publishers": ["Affaires Étrangères"], "esrb_rating": null}