{"id": 540560, "slug": "night-guardian-ar-borno", "name": "Night Guardian (AR Borno)", "name_original": "Night Guardian (AR Borno)", "description": "<p>Night Guardian is a micro-strategy, tower defense game where you play as a night guardian. Long ago, there was a village hunted by monsters and dragons.  Then one day the Night Guardian appeared.  In morning, he used to earn gold by farming, hunting and fishing. With that gold, he recruited solders and archers to kill monsters and dragons one by one every night. With the recruited solders, one day attacked the Monster king and defeat him.</p><p><strong><em>Basic gameplay</em></strong></p><p>In daytime,  you have to harvest crops, hunt animals and catch fish to earn gold and invest it to buy solders and archer to fight with monsters and dragons in night time. You can also borrow money from the bank when necessary.</p><p><strong><em>Controls</em></strong></p><p>Use W/D to to move camera left or right. Use left mouse button to  interact with objects.</p><p>Solders and Archers: Buy Solders to kill ground monsters. Buy Archers to kill dragons which shows up after second night.<br/></p>\n<p>Farming: Buy seeds from shop. Drag  seeds to the farming spot with left mouse button, wait few sec. </p>\n<p>Hunting: Buy arrows from shop. Go to hunting area and click on Deer to hunt them. You can also kill monsters with arrow by clicking on them.</p>\n<p>Fishing: Click the fishing pole, it will cost you 100 gold. While controlling the fishing hook, use W/A/D/S to move it around. Catch the fish from the bottom of the map and bring it up while avoiding the traps. You can do fishing 3 times a day.</p><p>Killing The Monster King: Buy 10 solders and click on the monster portal. It will take you to the Monster King...</p><p><strong>Music Used in This game:</strong></p><p><em> [Dark Hollows, Mountain Walk, A Lone Wolf ] by Alexander Nakarada </em></p><p><em>L</em><em>icensed under Creative Commons BY Attribution 4.0 License</em></p><p><em>http://creativecommons.org/licenses/by/4.0/</em></p><p><strong><em>Thanks For Playing This Game.</em></strong></p>", "metacritic": null, "released": "2021-01-06", "tba": false, "updated": "2021-01-08T05:06:28", "background_image": "https://media.rawg.io/media/screenshots/dc9/dc9cfbc2076f1fd8844ce6adc283054e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["AR Borno"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}