{"id": 54056, "slug": "solar-jetman", "name": "Solar Jetman", "name_original": "Solar Jetman", "description": "<p>Solar Jetman: Hunt for the Golden Warpship is a multi-directional shooter video game developed by Zippo Games and Rare and published by Tradewest. It was released in North America on 14 October 1990 and in Europe on 26 September 1991 for the Nintendo Entertainment System. The game is the third instalment of the Jetman series and was later re-released by Nintendo for their NES-based PlayChoice-10 arcade system in the United States in 1990.</p>\n<p>In the game, series protagonist Jetman must manoeuvre his small craft through caverns of various planets whilst searching for pieces of the Golden Warpship. The game is presented in a horizontal side-view environment and has ranging gravitational pulls for each planet, which subjects Jetman's craft to various forms of inertia. Similar to its predecessors, Jetman must keep his craft topped up with fuel in order to progress through levels.</p>\n<p>The game was developed mostly by Mancunian developer Zippo Games under the name of Iota before being ordered to change the game into a Jetman title by Rare. Ports of the game for the ZX Spectrum, Commodore 64 and Atari ST were completed but not released due to poor sales of the NES version. The game received mostly positive reviews upon release, with critics praising the game's presentation and graphics, however criticism was directed at the game's difficulty. It was later included in Rare's 2015 Xbox One retrospective compilation, Rare Replay.</p>", "metacritic": null, "released": "1991-09-26", "tba": false, "updated": "2019-08-28T22:26:19", "background_image": "https://media.rawg.io/media/screenshots/71a/71af9482a1a2490d7fac45b0be16502f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 9, "beaten": 1, "toplay": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 236, "game_series_count": 0, "reviews_count": 1, "platforms": ["NES"], "developers": ["Rare", "Zippo Games"], "genres": [], "publishers": ["Nintendo", "Tradewest"], "esrb_rating": null}