{"id": 540585, "slug": "custom-dash", "name": "Custom Dash", "name_original": "Custom Dash", "description": "Custom Dash\r\nKey Features\r\n<ul><li>Dash:<ul><li>Race through a randomly generated race track</li><li>avoid obstacles, make split second decisions</li><li>Shoot for the highest score your own way!</li></ul></li><li>Custom:<ul><li><em>Customize</em> your character to your liking</li><li>Pick your colors</li><li>Bend the rules to your will</li><li>Pick from over 20 passives, primary and secondary abilities</li><li>Combo aspects</li></ul></li></ul>\r\nThe basics\r\n<p>The concept is quite simple: go as far right as you can to get the highest score! But how you do it is completely up to you! Feel free to express your skill, find any exploits or cheese you can and win!</p>\r\nIn reactive Developement\r\n<p>Although the game is done, you may still find things that you would like to have added. I want to make this game in a reactive way, meaning to listen to your feedback and implement it! Please feel free to comment or hit me up! Or even better, to become a patron and gain access to an exclusive discord server where you can chat with me and other members of the community!</p>\n<p>Examples of this include but are not limited to:</p>\n<p>New abilities, passives, mechanics, map chunks or anything else</p>\r\nLet's help each other\r\n<p>I know first hand how hard it is to grow, so if you are a content creator feel free to hit me up so I can shoutout your content (wheter a live stream, video or just some fanart you drew in paint) as a big thank you for your support.</p>\r\nPatreon\r\n<p>Shameless plug; I want to get to a point where I can make quality games for free full time. Please help me achieve this dream and become a patreon of mine.</p>\n<p>https://www.patreon.com/LightForge</p>\n<p>Shameless plug end;<br/></p>\n\n<p>All that being said, I really hope you enjoy my game and I am excited to hear any feedback from you!</p>", "metacritic": null, "released": "2021-01-03", "tba": false, "updated": "2021-01-08T05:12:14", "background_image": "https://media.rawg.io/media/screenshots/2c9/2c9e30ba935e0c2743a6d3df56bebf56.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 49, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Light Forge"], "genres": ["Racing"], "publishers": [], "esrb_rating": null}