{"id": 540601, "slug": "entrance-number-3", "name": "Entrance Number 3", "name_original": "Entrance Number 3", "description": "<p><strong>Sometimes life can be boring. it's understandable when teenagers make some stupid decisions. But what if your first adventure will be your last?</strong></p>\n<p>Welcome to the past. It's Belarus 2020, August 21. Two young people watched memes in tik tok (not my proudest memory), but sudenly, they where showered with  foul language. Who? Some Old Fart. What the hell is wrong with him. They had tried to open the door to his house, for their happiness, it opened. There, they found...</p>\r\n8 endings\r\n<p>They are shitty tho.</p>\r\nEnjoy great soundtrack\r\n<p>Just joking, play my game.</p>\r\nFoul language\r\n<p>Yes.</p><p>You can disable it in settings. I don't own any rights for it.</p>\r\nKill dictator\r\n<p>Don't do this. In game okay, but not in real life. Even Luke didn't kill him. Why would you do?</p>\r\nAde due Damballa\r\n<p>Maybe in sequel (unlikely). There it's more like \"Klaatu...\"</p>\r\nAttention\r\n<p>The game is free, but if you liked it, feel free to donate. Keep in mind that 75% of recieved money will be donated to solidarity fund for the repressed during the protests in Belarus (BySol). For me it's really matters, that is the reason why I uploaded this game (originally it was only for me and my friends, but I want to help protests against dictatorship).</p>\n<p><strong>I also will create a patreon page, where you could get Ivan with mustache skin, so if you are interested in it, wait </strong><strong>a bit.</strong></p>\r\nAttention but smaller\r\n<p>The game is spoopy don't play it if you are scared.</p>", "metacritic": null, "released": "2021-01-06", "tba": false, "updated": "2021-01-08T05:16:45", "background_image": "https://media.rawg.io/media/screenshots/fad/fadad8b3c1b4ca7e2c2991a3f3e62f65.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 111, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["StyopaTelephone"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}