{"id": 54089, "slug": "tecmo-bowl-1990", "name": "Tecmo Bowl (1990)", "name_original": "Tecmo Bowl (1990)", "description": "<p>Tecmo Bowl (Japanese: テクモボウル, Hepburn: Tekumo Bōru) is an American football arcade game developed and released by Tecmo in 1987. The game was successful in its original arcade format, and as a 1989 port for the Nintendo Entertainment System. The NES version is the first console game to have featured real NFL players, via a license from the NFLPA. Although LJN's NFL is the first NES game to have featured NFL team names, it was not as successful as Tecmo Bowl. Because of this, and combined with the scarcity of the arcade version, the NES version eclipsed its arcade counterpart in popularity. The NES version was ported to mobile phones in 2004—and then to the North American Virtual Console: March 12, 2007 for the Wii, September 12, 2013 for the Nintendo 3DS, and on September 10, 2015 for the Wii U. The game was also included on the NES Classic Edition, which launched in 2016. The arcade version for the Wii Virtual Console was released in North America on August 3, 2009 and in Japan on September 29, 2009. The game is notorious for how much better Los Angeles Raiders running back Bo Jackson is than the rest of the players in the game, as he can make it through the defense almost every time.</p>", "metacritic": null, "released": "1990-11-13", "tba": false, "updated": "2023-10-29T01:04:28", "background_image": "https://media.rawg.io/media/screenshots/d24/d245d5832285e409e37614b13c99b11f.jpg", "website": "", "rating": 3.5, "rating_top": 3, "added_by_status": {"yet": 2, "owned": 10, "beaten": 1, "toplay": 2, "dropped": 5}, "playtime": 0, "achievements_count": 0, "ratings_count": 6, "suggestions_count": 267, "game_series_count": 0, "reviews_count": 6, "platforms": ["Wii", "Game Boy", "Nintendo 3DS", "Wii U", "NES"], "developers": ["Sculptured Software", "Tecmo"], "genres": [], "publishers": ["Tecmo"], "esrb_rating": null}