{"id": 540987, "slug": "lasise-driver", "name": "LaSiSe Driver", "name_original": "LaSiSe Driver", "description": "LaSiSe Driver\r\n<p><strong>Are you ready for one of the most challenging race tracks?</strong><br/></p>\n\n\n<p><strong>LaSiSe</strong> is the abbreviation for \"Ladungssicherung Selm\", an open-air research laboratory based in Germany dedicated to improving cargo securing and driver safety. The research area with a total of 123.500 square meters consists of three test modules for driving tests and professional driver education with various vehicles like trucks and cars. <br/></p>\n<p>JP Performance, a popular car tuning company from Dortmund in Germany, took the opportunity to continuously test their vehicles performance on the LaSiSe test track. Performance is thereby defined by lap times and handling. The laps are conducted by Jean Pierre Kraemer, CEO of JP Performance. The test sessions are filmed and available on the companies YouTube channel.</p>\n<p>These two ambitious projects inspired me to recreate the LaSiSe in a video game with realistic driving physics in order to attract attention to the work of research lab \"Forschungs- und Technologiezentrum Ladungssicherung Selm\", and as a fan of JP Performance it was obvious to add a touch of racing entertainment to the game. This is how \"LaSiSe Driver\" was born. </p>\n<p>As the Porsche 911 GT3 RS '19 has achieved the best lap time up until now in stunning 52 seconds flat, I decided to model and release it as the first drivable car in the game. </p>\n<p>A lot of work and skill has been put into this game. It was challenging, but great fun and the final result is worth the effort. </p>\n<p>I'm releasing this game in alpha state, so more vehicles and features are to follow depending on demand and reception. Do not hesitate to contact me with feature requests, eventual bugs, remarks or simply some words of appreciation. </p>\n<p>Enjoy the game and drive safely! </p>\n<p><em>*68Whiskey</em></p>\n\n\n<p><strong>Recommended System Requirements:</strong><br/><strong>OS:</strong> Windows 7/8/10 64-bit<br/><strong>Processor: </strong>Intel i5-6600K equivalent<br/><strong>Memory:</strong> 8 GB RAM<br/><strong>Graphics:</strong> GTX 970 equivalent<br/><strong>DirectX:</strong> Version 11<br/><strong>Storage: </strong>1 GB available space</p>", "metacritic": null, "released": "2021-01-04", "tba": false, "updated": "2021-01-08T06:57:40", "background_image": "https://media.rawg.io/media/screenshots/995/99583d2ed37d7c0fe48864c146ce3168.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 139, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["68Whiskey"], "genres": ["Simulation", "Racing", "Educational"], "publishers": [], "esrb_rating": null}