{"id": 540999, "slug": "templar-blacksun2257", "name": "Templar (BlackSun2257)", "name_original": "Templar (BlackSun2257)", "description": "<p><strong>Templar </strong>is  an isometric RPG<strong>, </strong>you will play as a knight of the church selected by the bishop, and sent to investigate an island where the population has been corrupted by an evil presence, it will be your duty to find and destroy any unholy creature infesting the island before the corruption spread to other lands.</p>\n<p>Collect gear around the island and level up to gain powerfull skills.</p>\n<p>How to Download:</p>\n<p>Well.. click download at the bottom of the page, unzip the file, open the folder, open the application named Templar.exe, play.</p>\n<p><strong>The Game:</strong></p>\n<p>The game has 3 levels and 2 bosses.</p>\n<p>The gear has randomized stats and every single one will affect the knight differently, some improve skill damage or basic attacks, others defence or mana regen etc..</p>\n\n<p><strong>Controls:</strong></p>\n<p><strong>Left Mouse Button : </strong>Attack and Interact with objects.<br/></p>\n<p><strong>Right Mouse Button :</strong> Move.</p>\n<p>I : Open Inventory.</p>\n<p>O : Open level description.</p>\n<p>Esc : Pause the game.</p>\n<p>Q - W - E - R : Use skills. </p>\n<p>Q : Leap on a target and slam the sword on the ground releasing flames in front of you.</p>\n<p>W : Charge the sword with thunders and strike all the creatures in a straight line in front of you.</p>\n<p>E: Smash the sword on the ground dealing high damage to all creatures around you, this skill has greater range than the others but much longer cooldown.</p>\n<p>R : Heal, long cooldown, use wisely.</p>\n<p><strong>Tutorial(READ THIS PLEASE):</strong></p>\n<p>You can swap things in the inventory as you like and see the stats of the gear by clicking on it. In most cases dodging enemy attacks, expecially heavy attacks, will make a big difference, kiting is crucial. You can heal yourself by standing next to \"Healing stones\" that you will find around the levels, Healing Stones will stop healing after  you healed a certain amount of hp and you will need to find another to heal more.</p>\n<p>Minimum requirements:</p>\n<p>The weakest machine I've tested it on is a laptop with nvidia 960m and i5 and it runs above 100 FPS,  so I believe you can play this on a microwave.</p>\n<p><strong>Hi everyone,</strong><br/></p>\n<p>Templar is a short game that I decided to create to improve my optimization skills, test a new idea for the Audio Manager and learn more about UI, if you are interested, you will find most of the code in my git hub linked in my portfolio (in the next few days), I believe the inventory system, Audio Manager and AI are strong and fast and with a few tweaks they can be implemented in any game, so you may wanna have a look.</p>\n<p>Game should be bug free, but Game Dev you know... So if you find anything please write down in the comments and i'll fix it the same day.</p>\n\n<p>Have fun guys!</p>\n<p>Click here for my Portfolio!</p>", "metacritic": null, "released": "2021-01-04", "tba": false, "updated": "2021-01-08T07:01:41", "background_image": "https://media.rawg.io/media/screenshots/399/3990c5f8f09ee3dd56fba02ac3d64926.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 174, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BlackSun2257"], "genres": ["Action", "RPG"], "publishers": [], "esrb_rating": null}