{"id": 541199, "slug": "sow-saw", "name": "Sow Saw", "name_original": "Sow Saw", "description": "Background (excuses)\r\n<p>This complete trainwreck of a game manifested within 48 hours at the cost of me and a friend of mine's energy, sleep and sanity for DJam 5. Although originally pretty realistically-scoped, a lot of ideas and even fairly developed code ended up on the cutting room floor -- firstly, because of the time restrictions, and secondly, because of my spaghetti code.</p>\n<p>Nevertheless, the gam<em>e exis</em>ts, be it in a much less polished and complete state than we'd like it to.</p>\r\nHow to play\r\n<p>- <strong>WASD</strong>/<strong>↑←→↓</strong> - move</p>\n<p>- <strong>[SPACE]</strong> - interact (can be held in some cases)</p>\n<p>- <strong>[TAB]</strong> - switch seed slot</p>\n<p>The aim of the game is to gather <strong>points</strong>. Originally there were point thresholds to pass a level, but since the entire concept of levels had to be cut, now it's basically an arcade-y 'collect as many as you can within the time limit' type deal.</p>\n<p>You collect the aforementioned points by <strong>planting and watering veggies</strong>, and <strong>harvesting</strong> them when they ripen. Every vegetable has two gauges, the <strong>red</strong> one indicating its <strong>hydration</strong> level and the <strong>green</strong> one being its <strong>ripeness</strong>.</p>\n<p>The more <strong>ripe</strong> the plant, the more likely it is to <strong>mutate</strong> and <strong>become hostile</strong> towards you. You can <strong>attack</strong> them with the same chainsaw you use to harvest them, but be aware -- there <em>is</em> a <strong>cooldown</strong>, so you can't just spam it.</p>\n<p>Every time you harvest a plant, mutated or not, there's a chance it'll drop seeds. You can plant those. I know, mind-blowing.<br/></p>", "metacritic": null, "released": "2021-01-04", "tba": false, "updated": "2021-01-08T07:53:30", "background_image": "https://media.rawg.io/media/screenshots/f9a/f9adcd80082476050ac17925a5a8d447.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 18, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["ArBe"], "genres": [], "publishers": [], "esrb_rating": null}