{"id": 541275, "slug": "the-way-home-2", "name": "The way home", "name_original": "The way home", "description": "<strong>The story of a driver who wants to go home</strong><br/>In the Republic of River, there is the special law.<br/><br/>According to the law, the driver who hit a human - even at least a little bit - while they're driving, become a criminal in the same class as the murderer. That means, if a driver violates the law, the driver would become a condemned prisoner.<br/><br/>Here is a driver who is going their home. And some guys on the road might break the driver's life. The runner appears out of nowhere, the smart guy, the drunken bicycle, and the sacred scooter.<br/><br/><br/><br/><br/><strong>Feature</strong><br/>The rule of the game is basically to avoid the obstacles of life while driving to go home. The driver needs to stop driving perfectly before hit them, or would get behind bars.<br/><br/>The driver might pick up some very expensive things on the road. It makes the driver can buy the super car and the luxury house. After then, the driver also can drive with the super car to go luxury home.<br/><br/>Do you want to go for a drive listening music calming your mind without worrying about hitting the guys? Don't worry. You can go to the highway where there is no one. Do you want to get rid of the stress caused by extremely safe driving? Try joining the racing game. (Only the super car can participate) 'The law' isn't applied to the racing track. So, anyone won't come in to be hit and killed by a car in there. Of course, the winner is given a prize.<br/><br/><br/><br/><br/><strong>Warning</strong><br/>The content of this videogame is purely fictional, is not intended to represent or depict any actual event, person, or entity, and any such similarities are purely coincidental. The makers and publishers of this game do not in any way endorse, condone or encourage engaging in any conduct depicted in this videogame.<br/><br/>All characters in this videogame never represent the any country, any race, any organization, any gender, any generation, and so on.", "metacritic": null, "released": "2021-01-10", "tba": false, "updated": "2021-06-04T03:36:33", "background_image": "https://media.rawg.io/media/screenshots/c7b/c7be0cb01ffc8104732296e040ab371b.jpg", "website": "https://store.steampowered.com/dev/hiderumstudios", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 177, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["HiderumStudios", "likaikai"], "genres": ["Adventure", "Racing", "Casual"], "publishers": ["chu qingfang", "HiderumStudios"], "esrb_rating": null}