{"id": 541276, "slug": "shards-of-feyra", "name": "Shards of Feyra", "name_original": "Shards of Feyra", "description": "Shards of Feyra is a turn based RPG, where magic is real and the monsters are unleashed. This world is dangerous, full of adventures and mythical beasts. Land of Feyra is a mystical place, where you can adventure with your friend in co-op game mode or alone. Each player will control 2 heroes through the deepest dungeons and complete tasks for the village leader. This game is built for the casual gaming community, however the hardcore player base can aim to reach the top of the leaderboards. The game is more challenging if you try to complete fast for more points and achievements, with automatic difficulty level adjustments. <br/>\n<br/>\r\nA single session is between 45 minutes and 2 hours, based on your skill and campaign you choose. There are 2 campaign so far, but this number will increase as time goes. Since the game has multiple heroes, which are randomly chosen, you will face different challenges each session, different team compositions and you must try different tactics to finish your adventure.<br/>\n<br/>\r\n    * Play with your friend in a full co-op environment or complete the quests alone!<br/>\r\n    * Unique locations with secret rooms, doors and mystery!<br/>\r\n    * Optional puzzle-like RPG elements to unlock secret locations and achievements!<br/>\r\n    * Deep combat system!", "metacritic": null, "released": "2021-01-10", "tba": false, "updated": "2021-01-11T02:08:52", "background_image": "https://media.rawg.io/media/screenshots/ce7/ce789acadb959f44a51f7907a42b32a9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 324, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Feyra Online"], "genres": ["RPG", "Strategy", "Casual", "Indie"], "publishers": ["Feyra Online"], "esrb_rating": null}