{"id": 54120, "slug": "ufouria-the-saga-1991", "name": "Hebereke. U-four-ia: The Saga", "name_original": "Hebereke. U-four-ia: The Saga", "description": "<p>Ufouria: The Saga, known in Japan as Hebereke (へべれけ), is a side scrolling action-adventure video game developed and published by Sunsoft for the Nintendo Entertainment System. It was released in Japan on September 20, 1991, in Europe on November 19, 1992 and in Australia in the same year. It is the first game in the Hebereke series with almost every &quot;sequel&quot; being a completely different style of game. Hebereke is the name of the Japanese version&#39;s title character, which is colloquial and roughly translates to &#39;drunk&#39; or &#39;untrustworthy&#39;. The game was later rereleased in a two-in-one Sony PlayStation game, Memorial Series Sunsoft Vol.5, which also included Raf World (known outside Japan as Journey to Silius). In 2010, Ufouria: The Saga was rated by the Australian OFLC, implying a future rerelease. It has been confirmed that this game would be released on the Wii Virtual Console in the PAL region on July 2, 2010 and as an import in North America on August 23, 2010.<br />\nThe games design is in the style of Metroid and Blaster Master where the player traverses an uninterrupted game world collecting items and power-ups enabling the player to reach even more locations, fighting bosses and minibosses. Throughout the game the player locates the main character&#39;s three friends who each have unique skills. The game allows the player to switch between the characters at any time to utilise their skills when needed.<br />\nThe game sports bright characters and graphics that are typically Japanese in design, done in the style of Bomberman, Kirby and particularly Hello Kitty.<br />\nAs a result of the limited release of English versions of the NES game, it has become quite in demand, and is considered a sought after item by collectors.</p>", "metacritic": null, "released": "1991-09-20", "tba": false, "updated": "2022-12-21T14:20:39", "background_image": "https://media.rawg.io/media/games/8bf/8bf8000db1705588318dfc2ee237fa71.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 6, "beaten": 5, "toplay": 1, "dropped": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 4, "suggestions_count": 130, "game_series_count": 3, "reviews_count": 4, "platforms": ["NES"], "developers": ["SunSoft"], "genres": ["Action", "Platformer"], "publishers": ["Sunsoft"], "esrb_rating": "Everyone"}