{"id": 54134, "slug": "wall-street-kid", "name": "Wall Street Kid", "name_original": "Wall Street Kid", "description": "<p>Wall Street Kid is a video game released by SOFEL for the NES. It was originally released in Japan as The Money Game II: Kabutochou no Kiseki (ザ・マネーゲームII「兜町の奇跡」, \"The Money Game 2: The Miracle of Kabutochou\"), which was the sequel to The Money Game.</p>\n<p>The story line from the two versions are different but the layout and the scheme of the office are almost exactly the same. Only cosmetic changes were made to make it relevant with the North American audiences. Both of these games expect the player to exercise his avatar and go out on dates.</p>\n<p>The player must prove himself worthy by taking $500,000 in seed money and growing it to $1,000,000 in order to gain a six-hundred-billion-dollar inheritance from the extremely wealthy Benedict family. Successfully investing it in the American stock market results in rewards like going shopping on the weekend and being able to acquire expensive items such as a house. The names of the companies listed in the stock market are slight variants on actual U.S. companies in operation at the time of the game's release. The player is also encouraged to spoil his girlfriend. The game terminates if the player is unable to raise the money needed for a key item such as a boat or the house, causing the stockbroker to be disowned by the family.</p>", "metacritic": null, "released": "1990-06-01", "tba": false, "updated": "2019-08-28T22:01:43", "background_image": "https://media.rawg.io/media/screenshots/54f/54f6af942380b9add09266e6377af5b3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "beaten": 1, "toplay": 2, "dropped": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 244, "game_series_count": 0, "reviews_count": 1, "platforms": ["NES"], "developers": ["SOFEL"], "genres": ["Strategy"], "publishers": ["SOFEL"], "esrb_rating": null}