{"id": 541328, "slug": "stella-arcana-eternal-stars", "name": "Stella Arcana- Eternal Stars", "name_original": "Stella Arcana- Eternal Stars", "description": "Eons ago, Baldur the God of Light created the Light Realm, a blessed land over which the stars shone bright. Envious of this creation, Chaos the God of Darkness brought war to this sacred land. In order to fend off the incoming invasion, Baldur the God of Light sacrificed himself and sealed the forces of darkness. After Baldur's sacrifice, he transformed into 12 constellations to protect all beings.<br/><br/>As time passed, people turned their backs on their beliefs and the old legends, and the 12 constellations gradually lost their power to protect the beings of the Light Realm. As darkness threatens to strike back, you must now help the Light Realm recover its faith, restore power to the 12 constellations and bring about another Star Era, in order to protect the Light Realm.<br/><br/>[Thrills]<br/>A series of exciting boss fights with intricate and deep combat mechanics.<br/>Travel through a vast and gorgeous world map, full of surprises and engaging quests!<br/>Join a Guild, meet new friends and have fun! Work together to make bring glory to your Guild!<br/>One-on-one PVP matches! Combine strength, strategy and dexterous  playing to climb up the rankings!<br/><br/><br/>[Wind Down &amp; Relax]<br/>Stella Arcana isn't all about thrills!<br/>Tired? Go tame some cute pets! Decorate your own house! <br/>Take some time off to travel through the gorgeous world map and Fish through all the fishing locations spread across the map.<br/>A rich fashion system with endless costumes, mix and match clothing to your own style!<br/><br/>[Romance]<br/>Check your horoscope every day! Meet your destined partner!<br/><br/>Want to play an innovative MMORPG? Want a game that mixes thrilling action-RPG combat and relaxing casual game modes? Want a game with a gorgeous art-style and soundtrack? Want exciting team-based dungeons and raids? <br/><br/>Stella Arcana, a tale of bravery and light! Come and join us in the fight to save the Light Realm!", "metacritic": null, "released": "2021-01-06", "tba": false, "updated": "2021-01-11T02:39:21", "background_image": "https://media.rawg.io/media/screenshots/442/4423ebc56022769d611c60de7455e981_KXtPUJe.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 224, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["LRGame"], "genres": ["Adventure", "RPG"], "publishers": ["LING CHAI HONG KONG"], "esrb_rating": "Teen"}