{"id": 541336, "slug": "beat-the-boss-war-zone", "name": "Beat the Boss: War Zone", "name_original": "Beat the Boss: War Zone", "description": "Robo Joe is on a mission to make your workplace hostile and miserable!<br/>Don’t want to walk into that familiar office on Monday morning? Dealing with the unresolved stress from the last time your boss made your life difficult? Beat The Boss is the healthy way of dealing with office stress and it's better than yoga!<br/><br/>Get back virtually at your dentist, smash that high-school bully, or travel to space to defeat aliens in this interactive simulation action game. As you play through the action packed stages, find out where Robo Joe’s from and why you need to take vengeance and kick his ignorant robot buddies. <br/><br/>From beehives to office supplies, and even grenades, the possibilities to get back at your foes are endless. Beware, don’t let your coldhearted manager get away! Unlock the immense power of finisher attacks and let out that pent up anger in the ultimate stress relief game.<br/><br/>Wage war with the evil Robo Joe and his machine buddies. Buckle up and prepare to riot as you grab your guns and assassinate an onslaught of horrible bosses in this funny fighting game! Drop and smash massive weapons on your robot foes, and reel in that satisfactory feeling from hunting your enemies!<br/><br/>Your therapist and colleagues will thank you so start taking revenge and go have some fun!<br/><br/>TALK TO US!<br/>Join your fed up coworkers on<br/>▶ Facebook: facebook.com/beatthebossgame<br/>▶ Discord: discord.gg/gamehive<br/>▶ Instagram: instagram.com/beatthebossgame<br/>▶ Blog: gamehive.com/blog", "metacritic": null, "released": "2020-11-12", "tba": false, "updated": "2021-01-11T02:42:41", "background_image": "https://media.rawg.io/media/screenshots/cbe/cbe2966f60cc0acf4405378bb988aa73_K6bqwmc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 232, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Game Hive"], "genres": ["Action", "RPG"], "publishers": ["Game Hive"], "esrb_rating": "Teen"}