{"id": 541329, "slug": "survival-master-3d", "name": "Survival Master 3D", "name_original": "Survival Master 3D", "description": "Imagine finding yourself stranded on a deserted island with nothing to eat and nowhere to go. All alone. Test your survival skills and find out if you’re worthy enough. It’s a wild and dangerous adventure out there, and you need more brainpower to win Mother Nature than you think. You’ll also need to defeat natural forces and hide from vicious predators wanting you dead. So fight for your right to stay alive! <br/><br/>Go and explore the deserted island. You can make a raft and try to escape, or just adapt to this new environment until help will come (gulp!). This 3D survival action game simulator will help you develop strong survival skills and instincts as danger is always lurking around. Can you make it out alive? Play to find out!<br/><br/><br/>Game Features:<br/><br/>Make fire from scratch<br/>Rub those sticks together and do everything you can to not freeze to death!<br/><br/>Catch fish and harvest food<br/>Save yourself from starvation, catch fish with your spear, grill them fresh, sow seeds to harvest vegetation for a lifetime. You can even steal some eggs...if you can!<br/><br/>Build shelter<br/>Use your intuition and logic. Gather wood, leaves and stones, and assemble your fort to stay protected from the wild.<br/><br/>Fight off pirates<br/>Self-defense must be your number one priority. Attack those bloody pirates who are trying to kill you. Or else, it’s off the plank you go!<br/><br/><br/>Visit https://lionstudios.cc/contact-us/ if have any feedback, need help on beating a level or have any awesome ideas you would like to see in the game!<br/><br/>From the Studio that brought you Mr. Bullet, Happy Glass, Ink Inc and Love Balls!<br/><br/>Follow us to get news and updates on our other Award Winning titles;<br/>https://lionstudios.cc/<br/>Facebook.com/LionStudios.cc<br/>Instagram.com/LionStudioscc<br/>Twitter.com/LionStudiosCC<br/>Youtube.com/c/LionStudiosCC", "metacritic": null, "released": "2020-12-11", "tba": false, "updated": "2021-01-11T02:39:47", "background_image": "https://media.rawg.io/media/screenshots/625/62519bd38ad5a6cc3e85342e605bb737_NqSMGui.jpg", "website": "http://lionstudios.cc", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 110, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Lion Studios"], "genres": ["Simulation", "Casual"], "publishers": ["Lion Studios"], "esrb_rating": "Everyone 10+"}