{"id": 541396, "slug": "acolyte-prologue", "name": "Acolyte: Prologue", "name_original": "Acolyte: Prologue", "description": "<strong>Acolyte: Prologue</strong> is the first act in a dynamic narrative detective/puzzle game that gives you your own Acolyte; a digital assistant you can talk to freely without pre-defined dialogue options. Just like a real conversation. <br/><br/>Become an employee of Nanomax, a well-funded tech start-up looking to change the face of consumer AI  with its upcoming Acolyte application.  As a remote-worker for the company, you'll interact with its employees and absorb its culture. But unexplained firings, missing employees and a strange, highly-classified bug in the Acolyte code-base point to something being very wrong.    <br/><br/>As you work with your new Acolyte, who seems to be intrinsically caught up in the company’s problems, you’ll find yourself at the very heart of the conspiracy. <br/><br/><br/><br/><h3>//FEATURES</h3><br/><ul><li><strong>//NATURAL LANGUAGE INPUT </strong>- interact freely with your Acolyte, using your own words to advance a non-linear narrative. <br/></li><li><strong>//BECOME A PART OF THE STORY</strong> - the worlds of the game and your own will blur, with ARG elements that contribute to a sprawling real-world narrative.  <br/></li><li><strong>//INNOVATIVE PUZZLES</strong> - use your Acolyte to help solve puzzles that require out-of-the-box-thinking, as you dig deep into its programming.<br/></li><li><strong>//CUSTOMISE YOUR ACOLYTE</strong> - personalise how your Acolyte looks and interacts, as you tailor your assistant to your preferences.<br/></li><li><strong>//UNRAVEL THE CONSPIRACY </strong>- uncover a dark truth as you dig into the past of your employer. </li></ul><br/><h3>//ABOUT SPIRIT AI</h3>Acolyte is powered by the Spirit AI Character Engine, allowing for natural language interaction with the game. Spirit AI uses artificial intelligence and natural language processing to both understand conversations and create digital personalities.", "metacritic": null, "released": "2021-01-10", "tba": false, "updated": "2021-01-15T02:13:57", "background_image": "https://media.rawg.io/media/screenshots/907/9073383ce3ddf0b488f6cc5cad9f8637.jpg", "website": "https://www.superstring.studio/acolyte", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 102, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Superstring"], "genres": ["Adventure", "Indie", "Puzzle"], "publishers": ["Superstring"], "esrb_rating": null}