{"id": 541647, "slug": "gods-of-maa-corrupted-blessing", "name": "Gods of Maa - Corrupted Blessing", "name_original": "Gods of Maa - Corrupted Blessing", "description": "<p>Gods of Maa is a passion project of mine that I've been honing for years, and it was fully realized for the first time in 2014 in the form of the first game Pristine Sin. The game got expanded into a full trilogy with its later installments Corrupted Blessing in 2015 and Mechanical Prayer in 2016, and the three games grew together in various aspects thorough the next few years (like getting a full graphical remake and various new songs), and the series reached a satisfying final result in 2020.\r\n</p>\n<p>These games are one-man-made (apart from the musics, which are from various sources), made with Ren'Py and completely free.\r\n</p>\n<p>Corrupted Blessing here is the second game in the trilogy, a prequel to the first one, which tells a tale of a loud young demon named Achmetha (Achme for short) who is going to the overworld for the first time in his life to seek for his missing big brother. On Achme’s journey, he meets a carefree young halfling - half demon, half human - Lilian, who hears a voice in her head, and a grumpy demon hunter human Vladimir. The three heroes embark on a journey to find out what kind of shady business is going on in the empire, and how does this relate to Achme’s big brother, and both the human and demon realms.</p>\n<p>The trilogy's genre falls somewhere between fantasy and steampunk, with story philosophical elements that may or may not destroy your emotions, and a plethora of interesting, hilarious and down-right depressing characters.</p>\n<p>Depending on how fast reader you are, each game will offer you 6 to 8 hours of story.</p>\n<p>It is recommended to play this one after Pristine Sin, but before Mechanical Prayer.\r\n</p>", "metacritic": null, "released": "2021-01-10", "tba": false, "updated": "2021-01-11T04:02:08", "background_image": "https://media.rawg.io/media/screenshots/0fb/0fbd155c406263989debacea15f80dde.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 125, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Pyllymursu"], "genres": [], "publishers": [], "esrb_rating": null}