{"id": 541987, "slug": "thousand-threads-itch", "name": "Thousand Threads (itch)", "name_original": "Thousand Threads (itch)", "description": "A beautiful open world where you deliver mail, find artifacts, help people out, and fend off folks you’ve wronged.<p><strong>Take on jobs.</strong> Find an attacker's identity. Retrieve stolen items. Deliver a gift. Obtain a lost keepsake. Complete the tasks however you like and make some money. Or betray your employer and make an enemy.</p>\n\n<p><strong>Deliver the mail.</strong> Open letters to discover more about the people you meet. Some folks are easier to find than others.</p>\n\n<p><strong>Discover ruins and collect artifacts.</strong> Sell the artifacts and learn the history of this place. </p>\n<p><strong>Help out.</strong> If you see someone being attacked, lend a helping (or hurting) hand. Characters remember and react to the actions you and others take.</p>\n<p><strong>Fend off folks you’ve wronged.</strong> You can attack, rob, or kill just about anyone. But you’re likely to make enemies. And they’re likely to tell their friends and family. And you’ll likely need to watch your back. But it’s almost never too late to turn old enemies into friends.</p>\n<p><strong>Gather plants, mushrooms, pelts, and more</strong> to craft and upgrade your tools, weapons, and ammo along the way.</p>\n<p><strong>Explore vibrant landscapes.</strong> Chase rabbits and deer. Run from wolves and bears. Find overlooks. Throw rocks in the water. Enjoy the world around you.</p>\n\n<p><strong>Get a new experience with every new game.</strong> The characters' traits and relationships are randomized at the start, so you get a fresh adventure on each replay.</p>", "metacritic": null, "released": "2021-01-05", "tba": false, "updated": "2021-01-11T05:26:53", "background_image": "https://media.rawg.io/media/screenshots/9a9/9a952423cccc6b8030906b779b286501.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 177, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Seamount Games"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}