{"id": 542013, "slug": "nyctophobia-itch-mtegarasta", "name": "Nyctophobia (itch) (MTegarAsta)", "name_original": "Nyctophobia (itch) (MTegarAsta)", "description": "<p>* This game contains jumpscare *<br/></p>\n<p>Nyctophobia, a phobia when you scare of darkness. This game theme is a terrible story of a girl who found a house as a shelter when raining outside. The girl needs to keep walking and exploring because when she stays, she feels her nyctophobia and creepy imagination coming. We need to help the girl survive from her own imagination and make her not being paranoid.</p>\n<p>*This Game Made In 4 days for Dani Basement Jam #2</p>\n<p>* Objective<br/>- Wait for the rain to stop, while waiting, look for items that can be taken from the cupboard or drawer<br/>- Try to avoid the weird thing by looking in the opposite direction or by turn off the flashlight and turn it back on, if you keep looking at it will make Lisa scared even more.<br/>- Keep turning the flashlight off for too long will slowly scare her.<br/>- What Happens if Lisa gets too scared? Well, her mind will become unstable and start thinking more weird things which means the harder the gameplay is, you can see it by looking at the screen, more red means more scared she is, or by hearing the heartbeat, faster the heartbeat is, yeah you get it.<br/>- If Lisa is too scared, She will become paranoid or simply you lose the game.<br/>- If rain has stopped, goto the exit door to end the game or you can stay in there for more points (the exit door is on the first floor, right when Lisa first arrives).</p>\n<p>Control :<br/>A, D, left, right = Move<br/>E = Interact<br/>Shift = run<br/>ALT, right-click = toggle Flashlight<br/></p>\n<p>* Play it on FullScreen Mode</p>\n<p>*Update<br/>Some People says the game was too hard, so I lower the difficulty<br/></p>", "metacritic": null, "released": "2021-01-06", "tba": false, "updated": "2021-01-11T05:33:03", "background_image": "https://media.rawg.io/media/screenshots/aa5/aa5b15edd9df9e1b7b7007f0d212bc16.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 27, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["MTegarAsta"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}