{"id": 542023, "slug": "the-labyrinth-demo-2", "name": "The Labyrinth (Demo)", "name_original": "The Labyrinth (Demo)", "description": "<p>The Labyrinth is a text-based dungeon crawler with an emphasis on combat and looting. Choose a party of 4 heroes from a roster of 8 as you journey on a quest to purge an underground dungeon of a hidden evil.</p>\n<p>The game features 8 playable classes, each with 9 unique abilities. There's 30+ enemies and 20+ room types to encounter, ensuring games stay fresh across multiple playthroughs.</p>\n<p>The enemies are smart and work together in their attempt to defeat you. Use your party's many abilities to synergize with each other to gain the upper hand. Bosses pose an even greater threat and will need you to keep sharp attention on their spells and items so you come to no encounter unprepared.</p>\n<p>This is a demo of the full game which is available on Steam. The full Steam version has access to 16 playable classes, multiple run length settings that allow you to beat the game in one sitting or multiple, endless floor generation, 50 achievements, over 100 statistics, and cloud saves.</p>\n\n<p><strong>Loot your way </strong><strong>through a procedural dungeon.<br/></strong></p>\n\n\n<p><strong>Use tactics to fight hoards of enemies.</strong><br/></p>\n\n<p><strong>Rooms contain spirits and enemies that want to help, or hinder, your progress.<br/></strong></p>\n\n\n<p>I appreciate all feedback, both positive and negative, and I try to fix bugs as soon as I'm made aware of them!</p>\n<p>The game was entirely made by Alexander Spillman. Sound effects made in BFXR, and music licensed from Purple Planet Music.</p>\n<p>#adventure #rpg #roguelike #roguelite #pointnclick #textadventure #altgame #strategy #tactics #turnbased #pixels</p>", "metacritic": null, "released": "2021-01-09", "tba": false, "updated": "2021-01-11T05:35:56", "background_image": "https://media.rawg.io/media/screenshots/be7/be78bb932142f77dbbcc640329c33b2c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 161, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ugotopia123"], "genres": ["Adventure", "RPG", "Strategy"], "publishers": [], "esrb_rating": null}