{"id": 542264, "slug": "escape-the-great-beyond", "name": "Escape the Great Beyond", "name_original": "Escape the Great Beyond", "description": "<p>(Entry for GE Jam #3)</p>\n<p>You were wrongly sent to the afterlife, which is a labyrinth designed to keep people from returning to the mortal realm. However, there are ways to manipulate your way through heaven and hell to get back to Earth. You will be given a chance to make it through the six realms of the afterlife to get back home to finish your earthly tasks. </p>\n<p>Make sure to keep an eye on how much time you spend in each realm. The more time you spend in a realm, the more your morality will be affected. If you become completely good or evil, you will no longer be human, but rather become an immortal being stuck in that realm. There are guardians looking to keep you stuck in the after life. Make sure you do not spend too long in hell. Otherwise, the guardians will come for you and keep you stuck there. </p>\n<p>Note that the further you progress, the harder it becomes to tell the difference between heaven and hell. You will  never be able to tell which you are in. Good luck. May luck be on your side.</p>\n\n<p>CONTROLS:</p>\n<p>Accept/Start/Shoot -&gt; Enter / J</p>\n<p>Cancel/Back -&gt; Esc / K</p>\n<p>Move -&gt; Arrows/WASD</p>\n<p>Jump -&gt; Up Arrow / W</p>\n<p>Switch Worlds -&gt; Space / R</p><p>WARNING: Do NOT try \"Hard Core\" mode. Start with Normal Mode. The level of difficulty for \"Hard Core\" is most likely impossible.</p>", "metacritic": null, "released": "2021-01-08", "tba": false, "updated": "2021-01-11T06:35:43", "background_image": "https://media.rawg.io/media/screenshots/64a/64a876425056213eda2d3712327f4f24.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 53, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["MetaphysicsStudios"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}