{"id": 542632, "slug": "the-astronomy-game", "name": "The Astronomy Game", "name_original": "The Astronomy Game", "description": "Explore the depths of outer space and experience the wonders of astronomy!<br/>\n<br/>\r\nGo on an adventure that will take you through the cosmos in Story Mode. Your lab partner has been kidnapped, and you must travel to an alien fortress to rescue him. Along the way, you will visit ten different planets, filled with control panels.<br/>\n<br/>\r\nControl panels are interactive simulations visualizing celestial movement with corresponding text to clarify what is occurring.<br/>\n<br/>\r\nControl panels teach the player everything from the Sun to Einstein’s prediction of violent ripples in space-time. Each planet has its own theme, with Level 1 being an introduction to stars and Level 10 describing supermassive black holes titled active galactic nuclei.<br/>\n<br/>\r\nThe simulations and text from control panels will be automatically stored in a journal throughout your adventure. The journal can be accessed in Trivia Battles, which are competitive battles against Trivia Bots at the end of each level.<br/>\n<br/>\r\nTrivia Bots, while originally created by your lab partner as fun quizzes, were hacked to become threatening enemies by the alien villain, Demetrix.<br/>\n<br/>\r\nDefeating Trivia Bots at the end of every Story Mode level will allow your lab partner, Marc, to holographically speak with you from Demetrix’s castle. Marc will often give you tips and status reports. It is revealed that Demetrix intends to use Marc’s genius to create an all-powerful invention that could destroy the universe.<br/>\n<br/>\r\nDo you have what it takes to save Marc and stop Demetrix from destroying the universe? Find out in the Story Mode of The Astronomy Game.<br/>\n<br/>\r\nInfinitely test your astrophysics skills and comprehension in Trivia Battle Mode. Quiz yourself by battling Trivia Bots, this time without the assistance of the simulations in your journal.<br/>\n<br/>\r\nDefeat enough Trivia Bots and you can unlock a secret Trivia Battle.<br/>\n<br/>\r\nCan you save your lab partner and unlock the secret Trivia Battle in The Astronomy Game? Play to find out!", "metacritic": null, "released": "2021-01-12", "tba": false, "updated": "2021-01-15T02:32:51", "background_image": "https://media.rawg.io/media/screenshots/5cb/5cb7c83da579632224c8bc0e1d2a4cfe.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 62, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Matthew Pena"], "genres": ["Adventure", "Indie"], "publishers": ["Matthew Pena"], "esrb_rating": null}