{"id": 542629, "slug": "fiction-f3f", "name": "FICTION #F3F", "name_original": "FICTION #F3F", "description": "<h3>The FICTION #F3F collection of ambient games includes Nightline, Carcavas, That Feeling Blue, æ, and Sands of Voltark. These five pieces, originally released between 2018 - 20, have been remastered and enhanced to feature hours of music, dynamic 3D first person experiences and (mostly) peaceful open worlds. From infinite train rides to sun bleached deserts, there’s quite a lot to explore at leisure :)</h3><h3>Nightline</h3>Take the Nightline through an infinite Metropolis. Destination? Unknown.<br/><br/><h3>Carcavas</h3>Visit the Carcavas Valley Natural Preserve in this nostalgic exploration piece. It’s a curious place, home to a wide variety of wildlife and rumors of military test sites and energy zones.<br/><br/><h3>That Feeling Blue</h3>A star melts on a morphing altar, the enveloping woods feed ever growing, that feeling, blue, sinks deeper.<br/><br/><h3>æ</h3>Strange shapes and voices pierce the blizzard's veil, stranded and curious atop this mountain you leave behind the comforts of your cabin to survey this darkest of nights. <br/><br/><h3>The Sands of Voltark</h3>Upon crash landing on this desert planet, you have the choice to explore its beautiful steppes or systematically strip mine its resources. Choose wisely for the consequences are irreversible!<br/><br/><br/><br/><br/>Photosensitive epileptic seizures warning! A small percentage of people may experience a seizure when exposed to certain visual images,  including flashing lights or patterns that appear in videogames. Immediately stop viewing and consult a doctor if susceptible!", "metacritic": null, "released": null, "tba": false, "updated": "2021-01-15T02:29:39", "background_image": "https://media.rawg.io/media/screenshots/3fe/3fe7b60841ccdc7ac206a9aec18f5237.jpg", "website": "https://www.colorfiction.co/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 390, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Colorfiction"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Colorfiction"], "esrb_rating": null}