{"id": 542742, "slug": "the-software-corp", "name": "The Software Corp.", "name_original": "The Software Corp.", "description": "\n<p>The Software Corp. is a management game with visual programming puzzles. Starting off as a software developer working remotely through an ongoing pandemic, why not start your own business while having spare time from all that not commuting? Fund your own company through multiple pathways and manage it as you like!(P.S: Just be careful to not bankrupt it.)</p>\n\n\n<p><strong>Tiredness Simulation: </strong>Sleepless nights won’t get you anywhere if you are tired except hospital.</p>\n<p><strong>Built-in Web Browser: </strong>Extra money from gigs won’t hurt right? Check out the freelance page! Need loans? We got you covered at the bank! While you are at it, can you pay the bills as well, please?</p>\n<p><strong>Visual Programming: </strong>What's a software dev game without programming, right? Many problems through the game awaits you where you’ll use real-world a-like programming blocks to solve them.</p>\n<p><strong>Build Mode: </strong>Order furniture you or your employees need with a single click. We even pre build the 500-part disassembled ones with incorrect instructions just so you can easily drag and drop it to wherever you like at your house or office.</p>\n<p><strong>Company Management: </strong>Create different types of projects and carve the path for your company. See where the journey goes!</p>\n\n\n<p>Twitter</p>\n<p>Discord</p>\n<p>Twitch</p>\n<p>Website</p>", "metacritic": null, "released": "2021-01-14", "tba": false, "updated": "2021-01-15T03:29:59", "background_image": "https://media.rawg.io/media/screenshots/1f3/1f373713deb390c149fcd0fc5d6fa1f4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 81, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Threewell Studios"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}