{"id": 542703, "slug": "ronin-the-last-samurai", "name": "Ronin: The Last Samurai", "name_original": "Ronin: The Last Samurai", "description": "“I’ll cut down anyone who stands in my way. Even the great mountain!”<br/><br/>Elegantly portrayed in an ink-and-wash painting style, play as the last samurai of a war-ravaged era in which he lost the lord he served. In order to avenge the lord's death, you must level up, unlock new abilities, collect various equipment, and constantly strive to become stronger. Do not forget: The path of revenge is very perilous and painful, and when you die, the only way is to start from the beginning. Only a true samurai who understands the way of the sword by cutting down countless enemies will survive to the end and finally leave his name in history!<br/><br/>Caution! Ronin: The Last Samurai is free to download and play, but some in-game items can be purchased with real money. If you do not want to use this feature, please block in-app purchases in device settings. Additionally, in accordance with the Terms of Use and Privacy Policy, you must be at least 15 years old to play the game and an internet connection is required.<br/><br/>[Game Features]<br/>● Winning a battle is rather simple. Either attack or defend.<br/>● By pressing the Block or Attack button, you can parry the enemy's attack or perform a Counter Flash right before the enemy attack lands. Don't forget that life and death depends on this split second decision!<br/>● “Concentration”, “Time Distortion”, “Annihilation” - Gain the upper hand in battle by actively utilizing different Skills of each weapon.<br/>● Stay headstrong by defeating various kinds of enemies that stand in your way on a beautifully rendered battlefield. If you can’t figure out the enemy’s pattern, death is inevitable!<br/>● Strong enemies that appear in every chapter have a unique combat pattern and should never be underestimated. By defeating strong enemies, you can earn special loot to further upgrade your key abilities.<br/>● Unlock new abilities through training, collect and upgrade a variety of equipment to constantly grow stronger.<br/>● Pet friends with special abilities will be your only reliable companions in lonely battles.<br/><br/><br/>[Customer Support]<br/>Please contact us through the Settings&gt; Customer Support button or send an e-mail to the address below.<br/>support@roninthesamurai.freshdesk.com<br/><br/>[Facebook]<br/>https://www.facebook.com/roninDreamotion<br/><br/>[Terms of Service]<br/>http://dreamotion.us/termsofservice<br/><br/>[Privacy Policy]<br/>http://dreamotion.us/privacy-policy", "metacritic": null, "released": "2021-01-04", "tba": false, "updated": "2023-03-17T09:58:16", "background_image": "https://media.rawg.io/media/screenshots/512/5123b3d32de4797482eb660f5956e2f7_lYpzQHz.jpg", "website": "http://fbronin.dreamotion.us", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 294, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android", "iOS"], "developers": ["Dreamotion"], "genres": ["Action", "RPG"], "publishers": ["Dreamotion"], "esrb_rating": null}