{"id": 542772, "slug": "dead-silent-not-quite-working-title", "name": "Dead Silent (Not-Quite-Working Title)", "name_original": "Dead Silent (Not-Quite-Working Title)", "description": "<p>Behold!</p>\n<p>You are a stranded nobody, a single soul with no outside connections that are relevant to this story. You start off in a clearing in a dark forest with nothing but a flashlight. The goal is to light a fire, so that you can signal for help. At the ironically inconvenient timing, however, the opposite comes down from the heavens and hunts you down. But be careful! His sight is limited, but he can hear for several yards, so if you walk at a normal pace outside of his cone of vision, you should be fine. However, the <em>second </em>you sprint within range, he <em>will </em>pick up your last known sprint location. </p>\n<p><strong>::MAJOR BIG HINT TO HELP YOU WIN THE GAME::<br/></strong>To get the key for the big safe place, you must let the villain \"spot\" you <strong><em>3</em></strong><em> </em>times, then head back to the shed. You will hear a sound effect, which signals the cabinet doors to open, and sets the pitchfork outside to be a grabbable object. You can use the pitchfork as a distraction when you grab the key, or just wait for him to move on into the opposite direction. How do you get \"spotted\"? Once he chases you, and stops, he will then initiate an attack, but he is rather slow, and you can use your flashlight to interrupt the attack sequence. </p>", "metacritic": null, "released": "2021-01-14", "tba": false, "updated": "2021-01-15T03:37:43", "background_image": "https://media.rawg.io/media/screenshots/fbd/fbd13dfbbb7d74c1bf70a57bda9ff971.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 142, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Lickbeans Interactive"], "genres": [], "publishers": [], "esrb_rating": null}