{"id": 542861, "slug": "interferencias", "name": "Interferencias", "name_original": "Interferencias", "description": "INTERFERENCES\r\nMayo - Junio 2020\r\n<p><strong>Planteamiento inicial</strong>. Con el cambio de las clases al entorno virtual se propuso el proyecto adaptado a las condiciones y que permite explorar las nuevas herramientas y maneras de trabajar. Se quería crear un espacio audio/visual donde cada alumno/a expresa lo vivido durante el confinamiento u otras ideas con la forma y contenido de libre elección y juntarlo posteriormente en un conjunto de espacios conectados entre sí.</p>\n<p><strong>Experimentación</strong>. El objetivo del espectador es experimentar la escucha moviéndose por el espacio y mezclando de la manera automática los sonidos. La ruta recomendada consiste en un camino semirrecto recorriendo los espacios creados uno tras otro. Es recomendable que en los focos del sonido el oyente se pare y gire alrededor para percibir los sonidos de diferentes direcciones. Es posible que andando rápido el sonido se distorsione, es preferible evitarlo</p>\n<p><strong>Audio</strong>. El contenido musical de mi trabajo ha sido grabado durante la experimentación sonora en casa, con los medios disponibles que muchas veces han sido el sonido de ambiente, de la vecindad, de los espacios próximos. Estos sonidos posteriormente han sido manipulados y distorsionados usando el programa Supercollider y Reaper. Parte de los sonidos como la síntesis de audio han sido creados mediante el mismo programa Supercollider.</p>\n<p>La ruta consiste en: \r\n</p>\n<ul>\n<li>Entrada. Variedad de los sonidos grabados de la calle, y otros generados, como la onda básica, la onda grave, el sonido del agua, etc.</li>\n<li>Lluvia. La lluvia cayendo sobre el tejido, con reverb.</li>\n<li>Árbol. Los pájaros de la calle.</li>\n<li>El ruido de la casa. Grabado con el micrófono en loop, a veces con fuerte presencia rítmica, con diferentes objetos cotidianos como la vajilla.</li>\n<li>Patos. Los sonidos ya escuchados hasta ahora con las notas harmónicas que sirven de la resolución de la tensión.</li>\n</ul>\n\n<p>Durante toda la ruta se puede percibir el sonido del fondo que consiste en el sonido de los pájaros modificado.</p>\n<p>Todos los sonidos además de su directa manipulación descrita arriba han sido editados. Algunas pistas han sido distribuidas en lo que serían los altavoces, copiando la pista, o con pistas diferentes creadas específicamente para ello. En esta segunda opción, se ha optado por mezclar los sonidos en diferentes canales para percibir el sonido en el espacio de manera diferente.</p>\n<p><strong>Contenido visual</strong>. Hablando del entorno de la pieza, sobre todo se pretendía no limitarse a algún estilo concreto y expresar lo que se sentía a través de la experiencia vivida en el confinamiento, dejándose llevar por el impulso.</p>\n<p>Prevalecieron los colores alegres, espacio abierto, líneas suaves. Se quiere anteponer lo familiar, cercano, acogedor, el refugio, desahogo, tranquilidad, libertad, sensación de amplitud, sencillez, con la ansiedad, peligro, algo irreal, preocupación, tristeza, soledad. Se quería visualizar todo aquello que permitía escaparse de la realidad limitada y monótona, aunque incluyendo algunos detalles de la presencia de ella.</p>\n\n<p>\n</p>\n<p><strong>Cadáver exquisito</strong>. La idea de la pieza de cadáver es ir modificando el mismo fichero uno tras otro añadiendo capas. Mi parte fue la segunda con lo cual aprovechando que aun no se había formado un cierto estilo o tónica a seguir, decidí añadir una parte con la carga rítmica contundente después de un audio de entrada de la compañera mezclándolo un poco. Dicho audio ha sido creado con la modulación de diferentes ondas, y con los patrones de diferentes parámetros en el programa Supercollider. Hay que mencionar un arreglo hecho por otra compañeroa de una línea harmónica de guitarra distorsionada que lo adornó con un contraste tonal.</p>\r\nCRÉDITOS\r\n<p>Ilona</p>", "metacritic": null, "released": "2021-01-14", "tba": false, "updated": "2021-01-15T04:00:19", "background_image": "https://media.rawg.io/media/screenshots/082/082e9fb759cebd82f19dc5787f78ab82.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 23, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Creación Digital Sonora"], "genres": [], "publishers": [], "esrb_rating": null}