{"id": 5429, "slug": "go-sports-skydiving", "name": "Go! Sports Skydiving", "name_original": "Go! Sports Skydiving", "description": "Go! Sports Skydiving™ is a skydiving simulator that uses the SIXAXIS™ wireless controller to twist, turn and pull off tricks. The easy and intuitive motion control allows you to move through the skies into various skydiving team formations or solo tricks with the greatest of ease. Supports several single player modes, including formation, team match, landing and several online battle modes.  Other online features include competing against other players in formation and team matches, as well a global ranking system for the formation and landing modes.<br/>\n<br/>\r\nKey Features:<br/>\r\n•\tVarious Gameplay Modes – Includes 4 offline modes, a license mode and 2 online modes with up to 4 players. <br/> \r\n•\tSIXAXIS™ wireless controller - Fully controlled by the SIXAXIS™ motion sensors to maneuver your skydiver into various formations. <br/> \r\n•\tDownload Replays – Watch the replays of the highest ranked players on the leaderboards. <br/>\r\n•\tGlobal Online Ranking – See how you compare to other skydivers. <br/> \r\n<br/>\r\nGo! Sports Skydiving is a trademark of Sony Computer Entertainment America Inc.  Developed by Lightweight Co., Ltd.  © 2007 Sony Computer Entertainment Inc. <br/>\n<br/>\r\nPurchase or use of this item is subject to the PLAYSTATION®Network Terms of Service and this item’s use restrictions.  If you do not wish to accept all these terms, do not purchase or use this item.  One-time license fee for downloads to up to 2 console systems that are associated with the purchasing account.", "metacritic": null, "released": "2008-02-07", "tba": false, "updated": "2019-08-02T16:22:21", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PlayStation 3"], "developers": ["Sony Interactive Entertainment"], "genres": ["Simulation", "Sports"], "publishers": [], "esrb_rating": "Everyone 10+"}