{"id": 542989, "slug": "alchemists-menagerie-pocprototype", "name": "Alchemist's Menagerie PoC/Prototype", "name_original": "Alchemist's Menagerie PoC/Prototype", "description": "<p>I spent about 9 days on this, so it's going to be pretty busted, I think. I decided to make a series of prototypes in order to learn my way around Unity, this is the first. I may come back and finish it if somehow there are people who are into it but it's more as a way to get feedback as I build this skill-set.</p>\n\n<p>You play as an Alchemist who can create life and convert said life into weapons and armor. You gather gems, craft items and use those to craft pets, which can eat the gems to gain stats.</p>\n\n<p>There are <strong>3 pets</strong>, all based on <em>Yokai</em> because that's what I have on my mind lately.  2 melee and one ranged weapon. Each pet has different stats in armor and weapon slots.</p>\n<p>Also; Sorry for the trash cover image. I half-assed it.<br/></p>\n<p><strong>Controls<br/></strong></p>\n<p>WASD - Move<br/>Left Click - Interact<br/>Right Click - Attack with equipped weapon<br/>Escape - Quit.</p><p><strong>Credits:<br/></strong></p><p>I made some of the sprites, most of the 3D models are from a Unity asset pack I got in a bundle a while ago.</p><p>The Sprite Base for the main character is by <strong>Kacper Woźniak and I got it here on Itch Available here</strong></p><p>The Icons on the Feed menu are from a pack by <strong>Finalbossblues</strong> which is Available Here<br/></p><p>Some Sound effects and music are from <strong>OpenGameArt</strong>. I had a text file with credits but somehow lost it in my crap file organization I had for this project. The music is entitled \"The Field of Dreams\".</p><p>Now to figure out the next prototype.<br/></p>", "metacritic": null, "released": "2021-01-14", "tba": false, "updated": "2021-01-15T04:28:40", "background_image": "https://media.rawg.io/media/screenshots/999/999cb096a2bee7f50d39db8bd9af18fe.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 34, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["Yarr"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}