{"id": 542950, "slug": "starship-escape-reeryte", "name": "Starship Escape (Reeryte)", "name_original": "Starship Escape (Reeryte)", "description": "<p><strong>**For the best experience download the Windows version at the bottom of the page**<br/></strong></p>\n<p><strong>Objective</strong></p>\n<p>The player needs to escape the starship that androids have taken over. The player will need to find the key card, so they can enter the cockpit to escape. </p>\n<p><strong>Story</strong></p>\n<p>The game takes place in the year 2325, during a galactic war. The war is the Earth and their allies against an army of androids and their allies. The story follows Sergeant Miles Clay, a security officer, aboard the USS Columbia. </p>\n<p>The crew of the ship are on a rescue mission to rescue the crew of USS Atlantis. The Atlantis was a research mission, but they were attacked by an army of android. The Columbia comes out of hyperspace to find the wreckage of the Atlantis, they scan the ship for any life forms, but the scan shows no life forms. The ship calls in that the Atlantis has been destroyed but as they are ready to jump to hyperspace, they are attacked by the same androids that attacked the Atlantis. The androids board the ship, and they take the crew as prisoners. Miles is about to attack the androids, but the ship rocks and Miles gets knocked unconsciousness. When Miles regains consciousness, he quickly realises that the ship has been taken over by the Androids. </p>\n\n<p><strong>UI Controls</strong><br/></p>\n<ul><li>W: Move Up</li><li>S: Move Down</li><li>L: Confirm</li></ul>\n<p><strong>Gameplay Controls</strong></p>\n<ul><li>WASD: Move</li><li>K: Fire Gun</li><li>J: Run</li></ul>", "metacritic": null, "released": "2021-01-14", "tba": false, "updated": "2021-01-15T04:20:31", "background_image": "https://media.rawg.io/media/screenshots/5b5/5b57638f5d8916f8ed46c41a4d8cf457.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 65, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["Reeryte"], "genres": ["Action"], "publishers": [], "esrb_rating": null}