{"id": 5430, "slug": "neopets-petpet-adventures-the-wand-of-wishing", "name": "Neopets: Petpet Adventures: The Wand of Wishing", "name_original": "Neopets: Petpet Adventures: The Wand of Wishing", "description": "<p>The Hidden World of Petpets Comes to Life!<br />\nAll of Neopia is in peril. A villain driven by unspeakable powers has tracked down the fabled Wand of Wishing - an ancient faerie wand that has the power to grant its user any wish. The fate of Neopia is in your hands.<br />\n• Play as one of four Petpets in this adventure role-playing game.<br />\n• Save Petaria as you battle through a series of adventures leading to the secret of the fabled Wand of Wishing.<br />\n• Delve into Dark Caverns, Spooky Catacombs, Cloud Plains and other mystical realms.<br />\n• Have your Petpet compete with others in the Battledome.<br />\nNEOPETS, and all characters, logos, names and related indicia are trademarks of NeoPets, Inc. All rights reserved. Used with permission © 1999-2006 NeoPets, Inc. NEOPETS is a MTV Networks company. Source code © 2006 Sony Computer Entertainment America Inc.<br />\nPurchase or use of this item is subject to the PLAYSTATION®Network Terms of Service and this item’s use restrictions. If you do not wish to accept all these terms, do not purchase or use this item. One-time license fee for downloads to up to 2 portable systems that are associated with the purchasing account.</p>", "metacritic": null, "released": "2008-01-31", "tba": false, "updated": "2019-09-12T06:39:30", "background_image": "https://media.rawg.io/media/screenshots/ce9/ce9a03c9a7339628374bbeaefac9771f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "toplay": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 135, "game_series_count": 0, "reviews_count": 1, "platforms": ["PSP"], "developers": ["Sony Interactive Entertainment"], "genres": ["Action", "Adventure", "RPG"], "publishers": [], "esrb_rating": "Everyone 10+"}