{"id": 543160, "slug": "descent-into-madness-2", "name": "Descent into Madness", "name_original": "Descent into Madness", "description": "<p>This is my submission for my college portfolio!! It is not perfect, but I'm very proud of it! It is (depending on your playthrough speed) anywhere from 23-45'ish minute long! Descent into Madness is a short, narrative driven horror game with a first person perspective and some elements of exploration and survival. It also has an ending, unlike my first horror game... You can play it for free, but if you enjoy your experience and think it worth something, please consider a donation &lt;3! I don't expect to make much off this, but<strong> anything I do make from this will go towards college</strong>. College transcripts are 10 dollars each, maybe I can cover a few of those with this game haha.</p><p>Inspired by Brain on Fire, by Susannah Cahalan<br/></p>\n<p>** READ THIS PLEASE**<br/></p>\n<p>As I am still learning, I have a few things to mention!</p>\n<p>* I don't know how to use inventory entirely yet, so you can't keep your flashlight between levels; however, you'll always find a flashlight on the ground beneath you, glowing yellow! (Same with keys)</p>\n<p>*If the game seems to have frozen, it is just loading between levels :)!</p>\n<p>* The mouse bugs out in the credit scene, so to close the game you have to currently alt-tab and manually close it, will fix that the moment I know how haha.</p>", "metacritic": null, "released": "2021-01-13", "tba": false, "updated": "2021-01-15T05:10:42", "background_image": "https://media.rawg.io/media/screenshots/869/8691b965c3e1ef71c6d0005e04e8eeb3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 132, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["A Good Potato"], "genres": ["Action", "Adventure"], "publishers": [], "esrb_rating": null}