{"id": 543302, "slug": "vala", "name": "Vala", "name_original": "Vala", "description": "<p>The world on which Vala takes place is ruled by the Three Sacred Avatars, Nihil Astrum, Nihil Sol and Nihil Luna, and they keep the world going with the legendary Valas, nine staves that harbor the power of the elements; Earth, Wind, Lightning, Fire, Water, Plant, Light, Darkness and Time. These are powerful sources of energy, and each is guarded by a selected species, distributed in the four continents.<br/><br/>Ten years before the events of the game, the kingdom of the Earth Vala was attacked by the dedorians, the race of Fire, in order to obtain their Vala, killing the king and queen, as well as most of the nobles, reducing the merkerian race to a small village. The Eastern continent is ruled by them now.<br/><br/>Now, a young merkerian boy named Bibro, accompanied by his adoptive brother Smail, and his close friend Muntz, will join a mission to dethrone Aracnus, leader of the dedorian, with the help of his own daughter Daedyl. But once they’re done with that, they will realize that what drove Aracnus to such actions is a bigger problem that they had ever thought, and will have to prepare to fight against the true mastermind that orchestrated the misery not only of the Eastern continent, but the world as whole.<br/><br/><br/><br/>The gameplay is a basic RPG without any particularly different characteristic, but there are things to highlight: The nine elements interact with each other in three paper-rock-scissors triangles; Earth beats Lightning, which beats Wind, which beats Earth. Fire beats Plant, which beats Water, which beats Fire. Light beats Darkness, that beats Time, that beats Light. And that’s without counting the mutant elements that act in reverse of their original form: Metal, Ice and Space, altered versions of Earth, Water and Time respectively.<br/><br/>There are also the Magulis/Magires, mystical gems dropped by monsters that can be equipped by the characters, allowing them to use a special attack of the monster that dropped them. Their main difference is that Magulis are dropped by common enemies, while Magires are dropped by bosses.<br/><br/>Alternatively, instead of them, the characters can equip Seals, each with their own special effect. There are basic seals that allow the characters to somewhat boost their stats. There are others that grant immunity towards a specific ailment, and finally there are the rare Diamond Seals, that grant various effects from letting one double wield, spend less MP, act twice per turn, or earn more money per battle.<br/><br/>And for the player commodity, there’s the PinkBox, a flying building which works as a safe haven for you, where you can buy items, equipment, rest and safe your file. The repertoire of items will update every now and then.</p>\n\n<p>Feel free to give me your opinions regarding the plot, the characters, difficulty and other things. Though I must add there is not original music yet (I kinda lack musical skills and haven't got anyone of trust to make the music for me). The demo has only the first chapter.</p>", "metacritic": null, "released": "2021-01-13", "tba": false, "updated": "2021-01-15T05:41:29", "background_image": "https://media.rawg.io/media/screenshots/210/2100e38293df82987c069f8b1c6684ad.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 62, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["TheFerydra"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}