{"id": 5434, "slug": "pixeljunk-monsters", "name": "PixelJunk Monsters", "name_original": "PixelJunk Monsters", "description": "<p>Inspired by the popular and addictive “tower defense” game genre, PixelJunk™ Monsters is a fun and intuitive game featuring a uniquely attractive art style.  Defend your home base against threatening monsters by building towers and casting lightning storms across the forest.  Collect gold coins and jewels from fallen enemies to finance tower upgrades and purchase even deadlier weapons.  Co-op mode adds an additional level of strategy and communication.  Download the game today!<br />\nKey Features:<br />\n•   Simple But Deep - Simple controls allow anyone to learn, but gameplay is challenging enough for experienced players.<br />\n•   Visually Charming - Features a unique hand-drawn art style with over 20 stages and weather effects.<br />\n•   Distinctive Music - Features original music and sound by Japanese ambient techno group Otograph.<br />\n•   Online Support - Players can track single player and co-op high scores on the online leaderboards.<br />\n•   Remote Play - Supports Remote Play for PSP® system.<em><br />\nPixelJunk™ Monsters © 2007 Q-Games Ltd. &quot;PlayStation&quot;, &quot;PS&quot; Family logo and &quot;PSP&quot; are registered trademarks of Sony Computer Entertainment Inc.<br />\nPurchase or use of this item is subject to the PLAYSTATION®Network Terms of Service, this item’s use restrictions, and other terms and conditions located at http://www.us.playstation.com/support/useragreements.  If you do not wish to accept all these terms, do not purchase or use this item.  One-time license fee for downloads to up to 2 console systems that are associated with the purchasing account.<br />\nMemory Stick Duo™may be required.<br />\n</em>Certain limitations apply to Wi-Fi connectivity.  See manual for details.<br />\nPlayer responsible for Wi-Fi fees.</p>", "metacritic": 78, "released": "2008-01-24", "tba": false, "updated": "2023-01-25T11:57:02", "background_image": "https://media.rawg.io/media/screenshots/cb3/cb3a944ec7c18797fcf021c9326b66f3.jpg", "website": "http://pixeljunk.jp/Monsters/index.shtml", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 3, "beaten": 2, "dropped": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 411, "game_series_count": 3, "reviews_count": 3, "platforms": ["Wii U", "PlayStation 3"], "developers": ["Sony Interactive Entertainment", "Double Eleven", "Q-Games"], "genres": ["Adventure", "Strategy", "Arcade"], "publishers": ["Sony Computer Entertainment", "Double Eleven"], "esrb_rating": "Everyone"}