{"id": 543599, "slug": "insilentium", "name": "Insilentium", "name_original": "Insilentium", "description": "<p>Insilentium is an upcoming mobile CCG that features all of the core CCG mechanics that you know and love while building upon them with unique features. This creates a card game like no other where both new and veteran players of the genre will be able to enjoy the compelling collectible and strategic gameplay.</p>\n\n<p>Our Mission</p>\n<p>As experienced players of the TCG and CCG world, we set out on a mission to create a CCG that feels both familiar but new, while tackling one of the biggest problems that every card-based game faces - the gradual obsolescence of cards.</p>\n<p>We know that a wide variety of cards is vital to a card-based game and that frequent updates to bring in new cards is needed to keep the game interesting.</p>\n<p>However, what normally happens in these situations is that as power creep sets in and as abilities get more and more complex, the older cards gradually become less useful until players are left with just a handful of cards that are used in almost all of their matches.</p>\n<p>Though there will always be a meta (the current top decks), there is no reason (beyond game balancing) to not have a truly diverse meta based around a rock-paper-scissors style match up.</p>\n<p>So join us on this journey as we set out to make our vision a reality!</p>\n\r\nInstructions for downloading the game on iOS\r\n<p> • First, you will need to install Test Flight on your iPhone.<br/> • Once you have done so, please visit this page in Safari: <em>https://testflight.apple.com/join/x4MebRyl</em><br/> • This will open up Testflight and will give you an invite to the game's test version - from there you can install normally. </p>\r\nImportant <em>Even though Test Flight shows the app is valid for 90 days only, each client update resets this timer, so you do not need to worry there.</em>\n<p><em>You can also join us on discord if you wish to chat with our developers or have questions/feedback about the game! discord.gg/e2QAVns</em><em>  </em></p>", "metacritic": null, "released": "2021-01-11", "tba": false, "updated": "2021-01-15T06:53:00", "background_image": "https://media.rawg.io/media/screenshots/845/8458a1f349170f1a8e7df40d801a4cae.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 212, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MonolithMind"], "genres": [], "publishers": [], "esrb_rating": null}