{"id": 5437, "slug": "nucleus", "name": "Nucleus", "name_original": "Nucleus", "description": "Players steer the cell around an organic, microscopic environment, manipulating inert cells and destroying aggressive ones.  The aim of each level is to destroy 'The Scourge'.  These organisms have viruses that change cells and aggressively attack.  Players can manipulate inert cells by pushing and pulling them into clumps and using the cells to harvest more power, or to shield their bodies.<br/>\n<br/>\r\nKEY FEATURES<br/>\r\n•\tMass of Gameplay –  Includes over 40 levels with varied difficulty. <br/> \r\n•\t1-2P Co-op Multiplayer – Select a level from three phases: Training, Intermediate and Advanced moving through the digestive, circulatory and nervous systems. <br/>\r\n•\tUnique mechanics &amp; Art Style – New, compelling mechanics of cell manipulation. The game mimics the actual characteristics of a real microscope. <br/> \r\n•\tOnline Ranking – Take your spot on the leader boards and show that you’re the best in the world. <br/>\n<br/>\r\nNucleus™ ©2007 Sony Computer Entertainment Europe.  Published by Sony Computer Entertainment America. <br/>\r\nDeveloped by Kuju.  Nucleus™ is a trademark of Sony Computer Entertainment Europe.  All Rights Reserved. <br/>\n<br/>\r\nVideo output in HD requires cables and an HD-compatible display, both sold separately. <br/>\n<br/>\r\nPurchase and use of this item is subject to the PlayStation®Network  Terms of Service/User Agreement, this item’s use restrictions, and other terms and conditions located at www.us.playstation.com/termsofuse.  If you do not wish to accept all those terms, do not purchase this item.  One-time license fee for downloads to up to 2 console systems that are associated with the purchasing account.", "metacritic": null, "released": "2008-08-07", "tba": false, "updated": "2019-09-12T06:40:48", "background_image": "https://media.rawg.io/media/screenshots/757/7573edba21ed767de8eba936ab8c1ceb.jpg", "website": "http://pangeasoft.net/iphone/nucleus", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 3, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 97, "game_series_count": 0, "reviews_count": 0, "platforms": ["PlayStation 3", "iOS"], "developers": ["Sony Interactive Entertainment", "Pangea Software"], "genres": ["Action", "Shooter", "Arcade", "Casual", "Puzzle"], "publishers": ["Pangea Software"], "esrb_rating": null}