{"id": 543961, "slug": "henry-the-weeper", "name": "Henry the Weeper", "name_original": "Henry the Weeper", "description": "<p>Submission to the 3rd RPG Maker Web Original Character Contest!</p><p>Please consider voting here.<br/><br/>Henry, the \"Weeper/Reaper\" is terrified of fighting, but due to inexplicable martial arts abilities, he is constantly challenged to fights by those looking to prove themselves.</p>\n<p>As soon as he is attacked, Henry’s uncanny reflexes and inhuman movements kick in. While weeping uncontrollably, he wails (pun intended) relentlessly on his opponents. His abilities work best when they are subconscious. If he were to assault an opponent consciously (which he would never do because he’s a coward), he wouldn’t know how to strike. Instead, his capabilities kick in when he is under immediate threat, which is often due to his attention grabbing and extremely annoying yelps. </p>\n<p>The combination of his battle prowess and troubling personality traits have gained him the dual nickname Weeper/Reaper.</p>\n<p>Henry currently lives something of a nomadic life, constantly on the run in search of a place where he can pursue his extremely boring hobby of soap carving in peace, but can hardly get through a week without being jumped by punks trying to prove themselves.</p>\n<p>Because of his high stress life, Henry suffers from an early onset receding hairline. He often wears a mask to disguise himself from attackers, but due to a total lack of self-awareness, doesn't realize it's his bright orange hair and male-pattern baldness that give him away to attackers.</p>\n<p>Battlecry: *sobbing* Gods no, not again! I’m just trying to carve my soaps!<br/><br/>Credits: <br/>Degica, Kadokawa<br/>Visustella (Battle Core Plugin)<br/>Infant Mini-Human for the Voiceovers</p>\n<p>Human's Action Sequence and RPG Maker Beta Testing server: https://discord.gg/sd9b8em</p>\n<p>Check us out if you're interested in the action sequences above or are looking for beta testers for your games!<br/></p>", "metacritic": null, "released": "2021-01-11", "tba": false, "updated": "2021-01-15T08:22:05", "background_image": "https://media.rawg.io/media/screenshots/7fe/7feddf3732fa16643306a1f549e5b0d3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 53, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Human"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}