{"id": 544047, "slug": "farmers-life-prologue", "name": "Farmer's Life: Prologue", "name_original": "Farmer's Life: Prologue", "description": "Morning! Your day starts at sunrise. After all, you have a job to do… or another surprise keg party with the neighbors. <br/><br/><br/><br/>A good farmer starts the day by dealing with the flock. The better you will manage, the better results you will achieve. Better care means a greater yield, more meat and extra eggs. Sell the fruits of your labor and you will be able to buy new barn equipment or distillation apparatus. Afterward, it’s time to work in the field. Weed, fertilize and irrigate. Rough field, freakish weather or uninvited guests can trouble you in achieving your goal. It depends on you, how you will face them. After a busy day, you deserve something special, don’t you? Neighbours will love to go for a shot. Be careful though, as they can become another trouble, you will have to manage. <br/><br/>In Farmer’s Life you will have to learn how to compromise and make decisions, which will affect your fate. It’s time to start farming!<br/><br/><br/><br/>Explore, take care of your farm and manage your resources wisely. Your animals require patient care. Thanks to it the chickens will lay more eggs and cow will give more milk. Well-kept animals work more efficiently.<br/><br/><br/><br/>Mind the seasons! Prepare for constantly changing weather conditions and hard winters. A good farmer is a prepared farmer. Learn new ways of survival. Sow, feed, harvest, slaughter.<br/><br/><br/><br/>Your farm is surrounded by impenetrable forests, home of countless dangerous animals. Take your time and explore every inch of this place. You might be surprised what can be found in this dark woods.<br/><br/><br/><br/>Work hard and build your farm empire. Or... leave it be. What's the worst that can happen?", "metacritic": null, "released": "2021-01-15", "tba": false, "updated": "2021-01-18T02:10:57", "background_image": "https://media.rawg.io/media/screenshots/2cf/2cf78ea93bc0a6d5360a8830fd201793.jpg", "website": "http://www.freemind.games", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 114, "beaten": 1, "toplay": 2, "dropped": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 263, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Freemind"], "genres": ["Adventure", "RPG", "Simulation", "Casual", "Indie"], "publishers": ["PlayWay"], "esrb_rating": null}