{"id": 544060, "slug": "figment-2-creed-valley-prologue", "name": "Figment 2: Creed Valley - Prologue", "name_original": "Figment 2: Creed Valley - Prologue", "description": "<strong>Note: This is a short introduction to Figment 2. Face the Black Hog, the fear of the dark, in rock n' roll showdowns. Then, travel to Conviction Lane to participate in regularly updated challenges. Controller recommended.</strong><br/><br/><br/><br/>Figment 2: Creed Valley is an action-adventure game set in the human mind. Nightmares are spreading chaos and have overrun once-peaceful lands. Join Dusty, The Mind’s courage, as you make your way through puzzles, musical boss fights and unique environments. Face your fears head-on.<br/><br/><br/><br/>Nightmares have their own theme songs, shining light on why they have appeared. <br/>Dodge and weave as they taunt you. <br/><br/><br/><br/><br/><br/><br/>Chat with The Mind's ever-changing opinions and tune in to the world's rhythm. <br/><br/><br/><br/><br/><br/><br/>Explore The Mind’s two fundamental states: Open-minded and Closed-minded. Switch between states and adapt to the shifting environment to move forward.<br/><br/><br/><br/><br/><br/><br/>Prove your mental and physical strength through mind-bending puzzles and fights timed to the soundtrack.<br/><br/><br/><br/><br/>Joy, sadness and everything in between. Figment 2: Creed Valley draws from emotional experiences that affect us all. <br/>Face stress, anxiety and the fear of the dark in a musical and surreal universe. <br/>Grab your sword and restore the light that once was.<br/><br/><strong>Figment 2: Creed Valley is the standalone sequel to Figment, check it out here:</strong><br/><br/>https://store.steampowered.com/app/493540/Figment/", "metacritic": null, "released": "2021-01-15", "tba": false, "updated": "2021-01-18T02:18:32", "background_image": "https://media.rawg.io/media/screenshots/151/1514bd6bee267dc351365eaac3f9de78.jpg", "website": "https://www.bedtime.io/figment-creed-valley", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 305, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Bedtime Digital Games"], "genres": ["Adventure", "Indie"], "publishers": ["Bedtime Digital Games"], "esrb_rating": null}