{"id": 544035, "slug": "strike-team-gladius", "name": "Strike Team Gladius", "name_original": "Strike Team Gladius", "description": "Strike Team Gladius is a turn-based, tactical combat game where you and your team fight to reclaim a colony world from an alien invasion. Complete missions to level up your strike team members, earn better equipment and unlock new command skills and abilities.  Special missions will let you support your team with tanks, troop carriers, artillery and even combat mechs. The game’s focus is on turn-based, tactical combat alone and does not slow the gameplay down with base building or resource management.  <br/><br/><ul><li>Employ cover, terrain and destroyable objects such as fuel containers and explosive barrels to gain an advantage over your enemies.</li></ul><ul><li>Battles involve dozens of aliens at once in fast-paced combat missions.</li></ul><ul><li>Fight over deserts, alien jungles and even an alien home world.  Each environment features unique tactical challenges.</li></ul><ul><li>Choose your team from 22 unique classes ranging from lethal snipers to brutal melee specialists.</li></ul><br/>The main campaign features 40 combat missions, each with their own special objectives and win conditions. Each successful mission will help your team become stronger and obtain more powerful equipment.  As you progress, your strike team will evolve in a finely-tuned and ruthlessly effective combat force.", "metacritic": null, "released": "2021-01-14", "tba": false, "updated": "2021-01-18T02:04:31", "background_image": "https://media.rawg.io/media/screenshots/96d/96d023d67fb57ace7e0b9d66ca7f1983.jpg", "website": "http://wavelightgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 550, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Wave Light Games"], "genres": ["RPG", "Strategy"], "publishers": ["Wave Light Games"], "esrb_rating": null}