{"id": 544229, "slug": "hawthorne-forest", "name": "Hawthorne Forest", "name_original": "Hawthorne Forest", "description": "<p>Hawthorne Forest is an<strong> </strong>interactive story set in a world where magic is a poorly kept secret; everyone has at least one story about a magical family member, but the general population doesn't know more beyond a vague 'it exists' and even some people debate that hotly. Spoiler alert: magic exists.<br/></p>\n<strong><em>the game</em></strong>\n<p>The game opens on a nineteen year old witch performing a demon summoning - nothing too out of whack - and culminates in the destruction of their mother's marriage. All in a day's work, really. Afterward, they're brought into their mother's hometown of Hawthorne, a small and creepy town between 'nowhere' and 'isolation'.</p>\n<p>The crows hold grudges, the residents have to sign NDAs to live there, the coffee shop won't stay still, and mysterious disappearances happen like clockwork. Between your classes and your magical tutoring by the town's most powerful witch, you have the opportunity to grow closer to the group of friends that have taken you into their fold and investigate the town's oddities.</p>\n<em><strong>gameplay</strong></em>\n<p>You can choose nearly everything about your witch character. The name, pronouns (chosen by the 'daughter' (she/her), 'son' (he/him), or 'child' (they/them) selector), the magic class your witch prefers (there are six options: conjuration, divination, ecomancy, healing, illusions, and necromancy), and make choices that influence your personality. There are three main routes of investigation of the town, and those are further divided on whether you prefer to be a light or dark witch. </p>\n<p>There are six romanceable characters: three female, two male, and one nonbinary. You can build up your friendship and trust with them, and choose which (if any!) to choose as your love interest. Each character has their own subplots and they all bring a unique set of skills and challenges to the investigations.</p>\n<p>I recommend saving to disc if you clear your cache often. Twine, the software this game is built with, uses a cache system (unfortunately) to store saves. For that reason, this doesn't work if your browser is in incognito or if you have an app that blocks cookies and storage.  Also - please let me know if I make a coding error. I'm an idiot who can't proofread apparently!! </p>\n<p>This game is a <strong>WORK IN PROGRESS</strong>. </p>", "metacritic": null, "released": "2021-01-17", "tba": false, "updated": "2021-01-18T03:20:58", "background_image": "https://media.rawg.io/media/screenshots/5a9/5a9dad592606ec08d21e55421559226d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 45, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["jewpiter"], "genres": [], "publishers": [], "esrb_rating": null}