{"id": 544381, "slug": "reaper-san-wants-to-cook", "name": "reaper san wants to cook!!!", "name_original": "reaper san wants to cook!!!", "description": "<p><strong>CONTOROLS:</strong><br/></p>\r\nARROWS = MOVE<br/>Z = JUMP<br/>X = PLACE GHOST<br/>C = UNDO (easy only)<br/>R = RESET LEVEL<br/>ESC = PAUSE<br/>\n\n<p><strong>WHAT IS ABOUT:</strong><br/></p>\n<em>uhh so theres a grim reaper guy and he wants to make some yummy food but the only way he can get to some ingredients is to go to the Normal People \"World\", but like, he needs to sacrifice some of his souls he's collected to be able to platform his way through the levels to get his stuff! Thats how it fits into the theme, Yeah.</em>\n<p><strong>GAME \"PICTURES\":</strong></p>\n\r\neasy/sandbox mode is a stress free version of the game where you are free to place as many blocks as you wish, and even allows you to undo the blocks in the order they were placed. play for a casual run of the game, or try to see how few moves you can beat all 20 levels in!\r\n\r\nnormal/puzzle mode is the traditional mode of this game, where you are limited to only a slightly lenient amount of lives for every level, so you have to be smart about it! try to get the par solution for each level, they're all possible!\r\n\r\nhard/speedrun mode is where its really at! your lives are limited to the par amount for every level, so there's no room for cheesing it! your game is also timed, and deaths when your life counter is 0 are punished greater. my best run was 5:16:52, but it wasn't the most optimal so try to see if you can beat it!\r\n\n<p>game made for ISU's jan 2021 game jam in 48 hours</p>\n<p>all assets made by me except the font- thats this:</p>\n<p>https://www.dafont.com/early-gameboy.font</p>\n<p>thanks to littlelamp100 and amimifafa for playtesting!<br/></p>", "metacritic": null, "released": "2021-01-17", "tba": false, "updated": "2021-01-18T03:58:04", "background_image": "https://media.rawg.io/media/screenshots/d44/d44a3321c97f15f899f3004c4e744b77.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 31, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["junebugdreamin"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}