{"id": 544362, "slug": "mrpotato-in-potatoland-nes-version", "name": "Mr.Potato in Potatoland - NES Version", "name_original": "Mr.Potato in Potatoland - NES Version", "description": "<p>Join Mr.Potato on his quest to save his wife from the evil cook Ramsord! </p>\n<p>Evade  Ramsords possessed cooking hats and reach the exit to get to the next level.</p>\n<p>Thanks to the great little program NESMAKER this game is a real NES game,  which means you need an emulator(which can handle mapper 30) to play it. Mesen should  be a good choice for it.<br/></p>\n<p>-----------------------------------------------------------------------------------------------------------<br/></p>\n<p>This may be the most simplest stuff that NESMAKER can make but i´m still glad to be able to make a real NES game like that. While i already have a pc version of Mr.Potato i always had the NES in mind while making it. And now i was able to.</p>\n<p>There´s still a lot.. and i mean a LOT, that i don´t know about making games in NESMAKER, which means i had to change some stuff from the original version. Since i don´t know how to use keys in my game yet i had to change the level design a bit to make it work without them. The level graphic is mainly taken from the original and has just been changed to conform to NES limitations. The sprites on the other hand were too big to be easiliy adapted, so i had to redraw them. The cooking hats still need some animations, maybe i´ll do that at a later time, or maybe in another project. I still haven´t figured out why the standard enemy is changing colors over time.. all music and sound is from the tutorial assets that come with NESMAKER, making my own music and sound is going to take a while, but i´m at least going to try that for my next NES project.<br/><br/></p>", "metacritic": null, "released": "2021-01-17", "tba": false, "updated": "2021-01-18T03:51:45", "background_image": "https://media.rawg.io/media/screenshots/649/649b2eb0a468ca7b8769808444e97728.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 29, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Crazy duck games"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}