{"id": 544599, "slug": "precipice-of-the-when-demo-01", "name": "Precipice of the When (Demo 0.1)", "name_original": "Precipice of the When (Demo 0.1)", "description": "<p>This is a visual novel with mysteries for the player to solve, and a complex choice based story to unfold.</p>\n<p>Well that's the idea anyway. This is a demo version of the story's prologue. The game is in development, and any support or feedback is very welcome.</p>\n<p>The feel I'm going for: A horror mystery with a sense of humor.</p>\n<p>Synopsis:<br/>The When is a strange place. Often considered 'the bleeding reality', its invasive nature is responsible for many supernatural phenomena. Some people have made it their jobs to investigate these phenomena, and to prevent harm coming to the people involved. However, an incident in a small village in Anderland is about to escalate.</p>\n<p>The two protagonists:<br/>-Thomas Konijn, a trained investigator. He's a large man with a soft mind and a love for the unusual. <br/>-Hanneke Hermelijn, a university student who enjoys photography and has a dangerous curiosity towards the unknown.</p>\n<p>--<br/></p>\n<p>Current features:<br/></p>\n<p>-Visual Novel style story<br/>-Prologue to the game<br/>-Original Soundtrack<br/>-A working save/load system<br/>-Introduction to Thomas Konijn<br/>-Fancy screen that says 'to be continued' before kicking you back to the title screen</p>\n<p>Planned features:</p>\n<p>-Visual Novel style story alternated with exploration segments (loosely inspired by Phoenix Wright)<br/>-Mysteries and puzzles for the player to solve<br/>-A branching story with meaningful choices<br/>-A chapter select screen that allows players to easily hop from one branch to another<br/>-A bigger original soundtrack<br/>-A variety of characters to meet and interact with<br/></p>\n<p>--</p>\n<p>If you play the demo, do let me know your thoughts. I could use your feedback to improve the game.</p>\n<p>(also, donations are always welcome ;) )</p>\n<p>Note: If you play this game on stream or video, please refer your viewers to this page so the project can benefit from the exposure. Thank you :)<br/></p>\n<p>--</p>\n<p>Plans going forward:<br/></p>\n<p>-develop and release a more expansive free demo<br/>-develop the first storyline and prerelease for a small purchase price<br/>-develop the rest of the game and release for an appropriate price (I'll have to figure this out while we go, since the true scope of the game is not yet set in stone)</p>", "metacritic": null, "released": "2021-01-16", "tba": false, "updated": "2021-01-18T04:48:55", "background_image": "https://media.rawg.io/media/screenshots/257/2574906cff5e6adac59f3afdc53dd1d7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 133, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mister Spaceman Stuff"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}