{"id": 544707, "slug": "whats-left-behind-itch", "name": "What's Left Behind (itch)", "name_original": "What's Left Behind (itch)", "description": "<p>It has been 20 years since a plague ravaged the planet. The dead rose to shamble across the dense urban expanses and vast plains around the globe. Cities crumbled and humanity retreated into their last safe bastions to fend off the relentless hordes. In the preceding decades, most of the hordes have rotted away and the time has come for humanity to strike out again and reclaim what was lost. You have been chosen to lead a small party into the wasteland, clear away the rubble of what were once thriving metropolises, and raise a new settlement in its place. Can you help humanity to recover and rebuild from what's left behind?</p>\n<p>What's Left Behind is a post-apocalyptic city re-builder. Choose from five maps based around real-world cities and start your new settlement from the ground up. Clear away old buildings, gather supplies and provide for your settlers, all while keeping a vigilant eye out for the remnants of the shambling horde.</p>\n\n<p><strong>Updated Jan. 16, 2021</strong><br/>Change Log v. 1.0.1<br/>- Fixed a bug that caused upgrades to stall if changing menus while they were running<br/>- Fixed a bug that kept player from being able to research Standardized Crating<br/>- Fixed a bug that caused Resource Overlays to become stuck visible<br/>- Fixed a bug where player could not complete \"Build a...\" objectives<br/>- Fixed a bug where settlers were not visible<br/>- Fixed a bug that prevented monuments from saving properly<br/>- Fixed a bug that prevented player-built structures from loading properly when a saved game was loaded<br/>- Changed camera idle animation so that when player returns to play the camera will now snap back to last position</p>", "metacritic": null, "released": "2021-01-15", "tba": false, "updated": "2021-01-18T05:16:41", "background_image": "https://media.rawg.io/media/screenshots/fc2/fc250b40addc4a51bef649a7fd86b8d5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 189, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Hoovler Industries"], "genres": ["Strategy", "Simulation"], "publishers": [], "esrb_rating": null}