{"id": 545092, "slug": "live-inc", "name": "Live Inc.", "name_original": "Live Inc.", "description": "Live Inc. is an online multiplayer 2vs2 game set in the 80s where one team acts as infiltrators breaking into an office building at night owned by the evil corporation named Live Inc. to collect evidence that can be used to incriminate the company, while the other team takes on the role of Live Inc.'s security and tries to catch the infiltrators.<br/><br/>On each team there is one member navigating through the map in first person towards their objective, these are the spy and the security guard. The other team members are the hacker and the security system admin who act as overseers in a remote location, their goal is to guide their partner towards their objective using tools to gain control over the office's security system.<br/><br/>The office's security system consists of cameras, secured doors and laser detection sensors, these can be used to find the position of the enemy and block them in their path. Teams rely on communication to take control over the map and outsmart the opposing team.<br/><br/>We recommend playing with a partner using voice communication. You can also join our community Discord server to find people to play with.<h3>Key Features</h3><ul><li> <strong>Cat and Mouse Gameplay</strong> - Experience constant situations of pursuits and escapes. Keep track of the location of your opponent to either entrap or avoid them.<br/></li><li><strong>Gain Control</strong> - Check live video surveillance to locate the opponent, uncover codes of laser sensors and secured doors and take control by hacking them in your terminal.<br/></li><li><strong>Communication</strong> - Use in-game voice chat to communicate with your partner and come up with strategies to outsmart your opponent. Positioning your opponent and completing objectives requires communication and teamwork.<br/></li><li><strong>Short and Diverse Matches</strong> - There are four roles with their own mechanics to try out. Matches are short so you can switch between roles and teams after a game for a diverse gaming session.</li></ul><h3>Planned Features</h3><ul><li> <strong>Improved Hacking Games</strong> - We are currently developing an improved puzzle version of the hacking mechanic that requires more communication between both team members.<br/></li><li> <strong>Tutorial and HUD improvements</strong> - We are currently testing the user experience of our players and we will improve the tutorial and HUD based on feedback.<br/></li><li> <strong>Balancing and Bug Fixes</strong> - This is an early version of the game and our team is working hard to solve technical and design issues. Players can help us out by reporting bugs and leaving their feedback in our community Discord.</li></ul>", "metacritic": null, "released": "2021-01-19", "tba": false, "updated": "2021-01-22T02:50:31", "background_image": "https://media.rawg.io/media/screenshots/632/6328a875f0c823470c53cde14ee3940b.jpg", "website": "https://project.hosted.hr.nl/2020_2021/game_maestro/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 172, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Maestro Games"], "genres": ["Action", "Indie"], "publishers": ["Maestro Games"], "esrb_rating": null}