{"id": 545044, "slug": "primeval", "name": "Primeval", "name_original": "Primeval", "description": "Primeval is a turn-based strategy game where you play the part of a deity trying to build your domain and compete with other deities for power and essence. <br/><br/>Each player creates a unique domain complete with hexes/terrain, population, spells, buildings and other improvements. No two domains are the same from player to player. <br/><br/>During combat each individual domain is combined to create the battle map. As you win games your domain will increase in size and power. If you lose it will diminish. <br/><br/>The ultimate goal is to create a domain that stands the test of time. However, even if you lose your domain an entirely new world is simply waiting to be called forth.<br/><br/><br/><br/>Every player starts off in the void. It is at this point a player will generate a domain. A domain consists of a map of hexes which represents the land mass the player controls. It also contains a base population of units, buildings, spells or other features that are compatible with the world.  Players can regularly add new units, spells and buildings to this map between battles.<br/><br/>For example, if your domain was a desert and volcanic world it may populate with hydras, manticores and fire based spells. However, if it was an icy world you may end up with yetis, polar bears and cold based spells instead.<br/><br/>Every player has a castle. The castle represents the seat of power in your domain. You place it on your map where you think it can be easily defended. If you lose your castle in a battle the game is lost.<br/><br/>Battles are created combining each players’ maps together to form a much larger battle map. Each hex on a map contains different resources and each turn the current player gathers a number of resources from hexes in their domain. Resources are used to produce units, cast spells etc.  <br/><br/>Battle continues until only one castle remains. At that point the winner receives new hexes, new populations, spells or other improvements based on how many players were in the battle. Players in the battle that did not win will lose a hex from the edge of their domain. This could result in a loss of population as well if they can no longer be sustained.  Your domain also contains a special hex called the nexus. All hexes must be able to trace a path to the nexus. If a hex is lost that prevents other hexes access to the nexus they will be lost as well. If the nexus is lost the domain is lost.<br/><br/>Also, every player that participates in a battle whether they win or lose will gain essence based on the size of the map to spend upgrading their domain.<br/><br/><br/><br/><br/><br/><ul><li>Every player has a completely unique domain and population.  <br/><br/></li><li>Since no two maps or population are the same strategies that work for one player may not work for every player.  Even if you are winning and gaining hexes you will have to alter your play style in order to keep winning.<br/><br/></li><li>Maps are combined into thousands of different combinations so no two games are ever the same.<br/><br/></li><li>Dozens of units, spells, buildings, hex types and improvements with more being added regularly.  <br/><br/></li><li>In battles the map is ever changing as well.  You may be just about to win when a lava beast emerges and starts wreaking havoc across your domain, a chokehold you have been defending suddenly opens up or a mysterious pyramid appears out of the sand beckoning you to find the ankh and reap the rewards.  There are myriads of events to keep the battle interesting.<br/><br/></li><li>Battles are fought between 2-8 players.</li></ul>", "metacritic": null, "released": "2021-01-31", "tba": false, "updated": "2022-08-30T16:06:36", "background_image": "https://media.rawg.io/media/screenshots/11b/11b2fe939560e8bea59858c457ee4f8f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 14, "ratings_count": 1, "suggestions_count": 143, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "macOS", "Linux"], "developers": ["Rivstyx Games Studio"], "genres": ["Strategy"], "publishers": ["Rivstyx Games Studio"], "esrb_rating": null}