{"id": 545089, "slug": "rebels-under-the-spell-of-magic-chapter-1", "name": "Rebels - Under the Spell of Magic (Chapter 1)", "name_original": "Rebels - Under the Spell of Magic (Chapter 1)", "description": "The game is a linear visual novel. It has a few choices, but they do not have an impact on the ending, instead they provide different content to the reader.<br/><br/>Join Folken as he starts his first adventure in a world that is reigned by magic.<br/>Dive into the complex world of this fantasy story and discover creatures, lore, abilities and a lot of characters with unique personalities.<br/><br/>Gained feedback from the community will help me improve future chapter releases.<br/><br/>There are 11 CG's to unlock.<br/>A single playthrough takes about 3 to 4 hours.<h3>Story</h3>The story revolves around Folken, who is considered a low-class human by society, because he has no magic abilities. <br/>In this world, people with magic abilities are automatically vested with high privileges and the rest are not worth much and are being discriminated against.<br/>Folken has no family and has to fight for his survival each and every day.<br/>But his life changes when an old man claims to have known his father, who was a legend and had incredible powers.<br/>Does he actually have powers slumbering inside of him that he wasn't aware of?<br/>Can he change the hierarchy of this world that has treated him so badly throughout his life?<h3>Credits to the artists and music composers:</h3>Ammarhabib <br/><br/>rtx101<br/>Wmag09<br/>myphuocanime<br/>nonh333<br/>beng312<br/>Chiwa_dak<br/>RamliKew<br/>AoriSora<br/>DaHadekan<br/>zeroyama<br/>zackpyo<br/>romaniacc<br/>sofiacanoart<br/>aryaplusnine<br/>Polcastr<br/>Carlos Jiménez<br/>marshallallenv<br/>siftfolio", "metacritic": null, "released": "2021-01-19", "tba": false, "updated": "2021-01-22T02:48:12", "background_image": "https://media.rawg.io/media/screenshots/7d3/7d3b37a52edb92658c60803008112940.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 253, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["BrotherWood Games"], "genres": ["Adventure"], "publishers": ["BrotherWood Games"], "esrb_rating": null}