{"id": 545047, "slug": "hardpunch-subverse", "name": "HardPunch: Subverse", "name_original": "HardPunch: Subverse", "description": "<p>This game has a story.  but it is a pretext to show sex.  If it is not enough, just ask and we will insert more explicit sex! Said that:<br />\nThe hardPunch heroine lives in a post-apocalyptic world where the goddess Venus is the cult object of the survivors. Humanity has become sterile. Creatures are created in laboratories through genetic engineering. The world has become horrendous, wicked, and extremely dangerous.<br />\nWhat remains of society lives around sexual practices. A nuclear mutation allows some survivors to absorb energy through sex, turning that energy into a lethal weapon. After the nuclear apocalypse, a CULT of followers of the goddess Venus appears.<br />\nThis is a game with strong SEXUAL CONTENT! NSFW<br />\nIt is practically a sexual battle royale: The heroine has sex whenever an opponent is killed (!!). She goes on killing and fucking until reaching the ultimate orgasm!<br />\nHard Punch is one of those powerful survivors. The spoils are adult humans produced in a genetic engineering laboratory. They were developed to provide sexual energy. Such creatures come out of their cocoons ready for sexual practice with the sole purpose of sexually feeding some humans capable of transforming this sexual fluid into pure energy. The main objective is to obtain enough sexual energy to activate the powerful Alive-Bomb Subverse that is hidden in the last level of the game. This machine could become the only hope for this world lost to nuclear cataclysm.<br />\nThe player explores an open world in the third person. It is necessary to survive until the end. In other words, find the portal of triumph and cross it to transport yourself to a new world. During this challenge, it is important to collect items of all types (health, stamina, bladed weapons, etc.). There are no firearms in this future. Practically the weapons available are swords, knives, and shields.<br />\nAfter all, there are spoils. Dying humans are kept on platforms in order to provide energy. Whoever has the power to absorb through sex is supplied in these places. However, there will always be a creature protecting these posts. The main objective is to obtain enough sexual energy to activate the powerful Alive-Bomb Subverse that is hidden in the last level of the game. This machine could become the only hope for this world lost to nuclear cataclysm.<br />\nThis adventure is an open-world game experience. You will have an entire apocalyptic world to explore, exploring items, and mapping your location while looking for what you need to survive. Take this opportunity to understand your limits. You will always be able to count on the help of your war companion.<br />\nPlaying is extremely easy because you can use your computer&#39;s keyboard and mouse or you can choose a joystick. This game is for PC Windows and is not heavy to play. The interface offers a lot of gameplay information. In addition, you can count on the help of a complete inventory.</p>", "metacritic": null, "released": "2021-01-21", "tba": false, "updated": "2021-02-02T11:30:41", "background_image": "https://media.rawg.io/media/games/31e/31e13b0b43a1a924cd3b8ee7a20d4043.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 464, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ojoy Studios", "Orgipix Prod."], "genres": ["Action", "Adventure", "RPG"], "publishers": ["Oolahjoy Prod."], "esrb_rating": null}