{"id": 545177, "slug": "pixel-rush-epic-obstacle-course-game", "name": "Pixel Rush - Epic Obstacle Course Game", "name_original": "Pixel Rush - Epic Obstacle Course Game", "description": "RACE FOR SURVIVAL <br/><br/>Control a man made out of pixel blocks as he races through challenging obstacle courses in this fun and fast-paced running game. Watch out: as Pixel Boy bumps into obstacles, he’ll lose pixels! Run and jump over the hurdles to ensure his survival, and reach the finish line in one piece to score a PERFECT RUN! 🏃<br/><br/>Collect pixels and stars as you maneuver past all sorts of barriers to restore Pixel Boy’s lost body parts and level up. But be careful! If you knock into too many barriers, you’ll lose all your pixels and have to start again! 🙀☠️<br/><br/>PERSONALIZE YOUR PIXELS <br/><br/>Keep Pixel Boy running in style with plenty of customization options! 🤠 Unlock new character figures that you can accessorize with a wide variety of clothing and other great items. 🧢👕👖 In this 3D runner, your look is up to you! 😎<br/><br/>If you think fast while you run, you’ll even have the chance to grab new items on the obstacle course. Look out, though: an obstacle might just knock your socks—or any other item you’re wearing—right off! 😮<br/><br/>GAME FEATURES:<br/><br/>★ Easy controls but challenging and dynamic gameplay. Just tap and slide left or right as you dash down the track! Practice makes for a PERFECT RUN!<br/><br/>★ Leap off launchpads to soar over barriers on the obstacle course. Beware of the hurdles, sharp spikes, swinging knives and axes, spinning platforms, and other stumbling blocks that could smash your pixels to smithereens! Will Pixel Boy survive as you steer him through increasingly difficult levels?<br/><br/>★ Collect keys  to obtain new skins so you can play as a tree 🌳, chicken, and more wacky characters! <br/><br/>★ Unlock hundreds of items in the Shop! Earn stars to unlock unique new accessories for personalizing your character, including a top hat 🎩, crown 👑, gloves 🧤, wand ✨, boots 🥾, and a whole bunch of other options. Arrr, matey, wouldn’t you like to see Pixel Boy dressed up like a pirate? 🏴‍☠️<br/><br/>★ The better your skills, the quicker you’ll save up enough pixels to unlock Mystery Boxes with special prizes. This running game takes time and concentration to master, but it pays off with big rewards!<br/><br/>★ Plenty of opportunities to nab extra stars. Run and jump your way through bonus levels with star multipliers. Get lucky in the Chest Game, and you just might hit the jackpot!<br/><br/>★ This 3D runner will keep you hooked with its awesome graphics and fun sound effects and music. 🎶<br/><br/>★ The optional vibration setting lets you FEEL the FUN!<br/><br/>Don’t be a blockhead! 🤪 Download the Pixel Rush running game now and race through an obstacle course on a quest for survival!", "metacritic": null, "released": null, "tba": false, "updated": "2021-01-22T03:45:43", "background_image": "https://media.rawg.io/media/screenshots/ca6/ca661eaf6ce47032b0f398cf01d4ec93.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 87, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["SayGames"], "genres": ["Casual"], "publishers": [], "esrb_rating": "Teen"}