{"id": 545150, "slug": "driftland-the-magic-revival-demo", "name": "Driftland: The Magic Revival Demo", "name_original": "Driftland: The Magic Revival Demo", "description": "Driftland: The Magic Revival is available here<br/><br/>\n<br/>\nAfter a devastating war between ancient mages, a powerful spell is all that holds together the shattered planet of Driftland. Faced with the destruction of their entire civilization and life on the planet, the warring factions called a truce and tried to repair the damage – but it was already too late. By using all their remaining magic to cast a powerful spell, they managed to keep their world in relative balance.\n<br/>\n<br/>\nMany dark ages passed, but when all seemed lost, a ray of hope emerged once more: new sources of magic appeared, and new mages were given birth to across the planet. Now, as the dormant conflicts once again surface, this rediscovered power will determine whether Driftland is restored to its former glory or wiped from the cosmos entirely.\n<br/>\n<br/>\nYou take on the role of a Mage Overlord with your own castle, tower, and a small realm on one of the landmasses. With your unique powers, you can explore a procedurally generated world and connect floating lands to expand your kingdom.\n<br/>\n<br/>\n<br/>\nGameplay focuses on setting general goals for all your units without the need to micromanage each of them. The warriors, archers, and mages under your command are able to tame and ride different kinds of flying beasts and create various aerial units.\n<br/>\n<br/>\n<ul><li> Procedurally generated world\n<br/>\n</li><li> Resource- and magic-based economy\n<br/>\n</li><li> Move and terraform scattered landmasses with magic\n<br/>\n</li><li> Tame and ride dragons and other creatures\n<br/>\n</li><li> Explore and fight on the same map\n<br/>\n</li><li> Set goals instead of directly controlling units\n<br/>\n</li><li> Single player, campaigns, and multiplayer</li></ul>\n<br/>", "metacritic": null, "released": "2019-04-17", "tba": false, "updated": "2022-09-04T15:24:47", "background_image": "https://media.rawg.io/media/screenshots/3fc/3fcbb5f9ce1d88f3a0bf315fa06ab16b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 43, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 541, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Star Drifters"], "genres": [], "publishers": ["Star Drifters"], "esrb_rating": null}