{"id": 545168, "slug": "offroad-games-car-driving-4x4", "name": "Offroad Games Car Driving 4x4", "name_original": "Offroad Games Car Driving 4x4", "description": "This offroad 4x4 game contains American and German cars in an outstanding environment (muddy forest). You can drive alone in offline mode or just drive among others drivers in online ( multiplayer ) mode. <br/><br/>This off-road multiplayer car game has 4x4 SUVs cars, like Predator, Hummer, Jeep, Q7, X6, Range, Wrangler, Rover. These cars are petrol and diesel ones. The torque of this cars will help you to climb the rocks, to pass through the mud and jump over the hills, completing the challenging levels.<br/><br/>After you buy the 4x4 you want, you can customize it with wheels (this game has over 30 sets of wheels). Also, you can paint the car in which color you want from the game color pallet. The car torque, brake, transmission, steering power, nitro(NOS) and speed can be customized too, with a tuning soft in the game garage.<br/><br/>If you are ready to drive outlaw in wild forest, download the game today.<br/><br/>Game features:<br/>- Outstanding graphics<br/>- 12 challenging levels<br/>- 6 off-road cars (we add new cars)<br/>- Online and offline mode<br/>- 30 wheels sets<br/>- brake, transmission 4x4, torque and steering power tuning system<br/>- Mud forest with a river<br/>- Car color exchange<br/>- US cars<br/>- Rock crawler<br/>- Free to play", "metacritic": null, "released": "2019-02-28", "tba": false, "updated": "2021-01-22T03:40:58", "background_image": "https://media.rawg.io/media/screenshots/301/3013be72ca4ab617488cdf087e69110a_xAFM5hN.jpg", "website": "https://www.xsasoftware.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 103, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Xsa Software"], "genres": ["Simulation", "Racing"], "publishers": ["Xsa Software"], "esrb_rating": "Everyone 10+"}