{"id": 545172, "slug": "darkfire-heroes", "name": "Darkfire Heroes", "name_original": "Darkfire Heroes", "description": "Collect and battle with more than 50 heroes from 6 unique factions in this action fantasy RPG game.<br/><br/>Assemble teams, pick strategies, and lead the brave fight against evil enemies and monsters! Prove your skills as you cast magic spells and unleash powerful special attacks to save the lost realm in this battle fantasy RPG adventure. Unlike idle games, Darkfire Heroes lets you show your skills in real-time fights against evil enemies or an evil dragon boss.<br/><br/>Upgrade your hero and customize your gear to master battle and fight tactics. Play a massive campaign that pits you against evil minions, brutal boss monsters and otherworldly beasts, like ancient dragons. Go up against global opponents in the PVP Arena.<br/><br/>STRATEGIC COMBAT<br/>In this RPG fantasy adventure, your battle strategy matters. Be brave, pick the right heroes and magic spells for the fight. Equip each hero with magic gear and ensure they are fully upgraded and ready for strategic RPG battle on a quest. With more than 50 heroes, 20 magic spells, and hundreds of epic skills and gear pieces, the fight tactics are limitless. <br/><br/>COLLECT EPIC HEROES<br/>Assemble a squad of knights, sorcerers, archers, clerics, wizards, assassins, warriors, priests and more to defeat the dark forces in every level. Each hero has unique special attacks and custom battle skills. You decide if your squad focuses on area damage, single target attacks, healing or a combination of it all.<br/><br/>BRAWL IN THE PVP ARENA<br/>Show your skills in real-time battle and dominate the PVP Arena level. With many gripping PVP modes, you’ll never get bored of crushing your friends &amp; other players from around the world. This is not an idle game. Play game modes from head-to-head fights to thrilling contests. Build your squad and rule the PVP Arena. Climb the Trophy Road rankings and claim loot! <br/><br/>FIGHT EPIC BOSSES<br/>Take on challenges, show your skills, and battle the deadly boss for valuable loot. Vanquish lich lords, giant spiders, and fire breathing dragons. If your team is brave enough, begin the quest on a harder level for more powerful rewards and loot.<br/><br/>EXPLORE AN EPIC CAMPAIGN<br/>Enter the fantasy realm of Darkfire Heroes and go on a heroic adventure. Explore hundreds of levels across more than 10 breathtaking locations. Your squad will journey from ancient valleys to haunted castles, and from frozen peaks to volcanic mountains. Your heroes are the only hope to defend the free lands.<br/><br/>BUILD YOUR OWN CLAN<br/>Fight evil hordes, with support from other epic players and friends. Join a mighty clan or build your own by recruiting the best players in the free lands. Earn a valuable clan chest each week by brawling other players in the PVP Arena. Share strategies, tactics and favorite heroes in the clan chat and become the most powerful clan in the realm.<br/><br/>Download and play Darkfire Heroes<br/>- Enjoy fast-paced thrills in this epic, free-to-play fantasy RPG adventure game<br/>- Collect characters and lead teams of brave heroes in real-time battle against evil monsters and boss enemies.<br/>- Build different teams from more than 50 heroes and magic spells for each quest<br/>- Show your skills - this is not an idle game!<br/>- Brawl in the epic PVP Arena against players from all over the world<br/>- Earn chests and collect valuable loot to upgrade your hero, magic spells and gear<br/>- Save the free lands from evil monsters, like dragons, as you explore an epic massive campaign<br/><br/><br/>PLEASE NOTE:<br/><br/>- Items are available for purchase in this game. Some paid items may not be refundable depending on the type of item.<br/><br/>Official Website: https://darkfireheroes.net<br/>Support: https://support.rovio.com/<br/>Privacy Policy: https://www.rovio.com/privacy/", "metacritic": null, "released": "2020-08-11", "tba": false, "updated": "2021-01-22T03:42:40", "background_image": "https://media.rawg.io/media/screenshots/6dc/6dc74d1e4da5ccdabdb2e5452ef667a6.jpg", "website": "https://www.rovio.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 335, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Rovio Entertainment Oyj"], "genres": ["RPG", "Strategy"], "publishers": ["Rovio Entertainment Oyj"], "esrb_rating": "Teen"}