{"id": 545137, "slug": "glider-sim", "name": "Glider Sim", "name_original": "Glider Sim", "description": "Experience the ultimate sensation of gliding through the sky! <br/><br/>Glider Sim is a professional paragliding and paramotor simulator built for real pilots in mind and is aiming to achieve photo realistic graphics! The sim can be played outside VR or inside VR. We recommend playing in Virtual Reality as it provides highest level of emersion!<br/><br/>The scenery takes place in Sun Valley, ID, United States and uses real world satellite imagery. The scenery includes custom placed roads, houses, buildings, trees, power lines, soaring eagles, cruising airplanes and more! We are striving to create a beautiful living environment with many placed detailed scenery objects that you can discover as you fly and explore the map.<br/><br/>Lots of attention went into the flight physics of the gliders as well as the wind and thermal system. Set your launch point and flying conditions then takeoff into the skies! Use wind current such as ridge lift and thermals to stay airborne, or if you're using the powered paramotor (Paramotor Trike) throttle up and cruise over the detailed scenery. You can toggle on and off the wind visualization particle systems as well as change other flight conditions such as wind speed and direction.<br/><br/>More features we hope to add to the game during Early Access is as follows:<br/><ul><li>Multiplayer<br/></li><li>Scored Challenges/ Missions.<br/></li><li>Updates to scenery such as more trees, rocks, houses, road traffic and detailed buildings. <br/></li><li>More gliders to choose from such as speedwings, miniwings and hang gliders.</li></ul><br/>Don't forget to share this experience with your fellow gliding enthusiasts and we look forward to hearing your feedback in the community hub as we continue development! <br/><br/>See you in the skies!", "metacritic": null, "released": "2021-01-21", "tba": false, "updated": "2021-01-22T03:19:58", "background_image": "https://media.rawg.io/media/screenshots/944/944dfe657edba09efa163ffd144ccd9e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 293, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Joey Sipos"], "genres": ["Simulation", "Sports", "Casual", "Massively Multiplayer"], "publishers": ["5D Realities"], "esrb_rating": null}