{"id": 54515, "slug": "sin-punishment", "name": "Sin and Punishment - Successor of the Earth", "name_original": "Sin and Punishment - Successor of the Earth", "description": "<p>Sin and Punishment is a rail shooter and shooting gallery video game co-developed by Treasure and Nintendo. Originally published by Nintendo for the Nintendo 64 in 2000, Sin and Punishment takes place in the near future of 2007 when humanity is struggling with a global famine. Scientists develop a new species to raise as food, but the creatures revolt and war breaks out. The player takes on the roles of Saki and Airan as they fight to save Earth from destruction. The game employs a unique Nintendo 64 controller layout, utilizing both the D-pad and control stick. This control scheme allows the player to strafe, jump, and dodge around the screen while simultaneously aiming the targeting reticle. The player must shoot at enemies and projectiles while also dodging attacks to survive and progress through the game.<br />\nThe development of Sin and Punishment lasted longer than usual for the era. Development commenced in 1997 with only four staff and concluded in 2000 with more people involved than in any of Treasure&#39;s previous projects. The guiding inspiration to develop Sin and Punishment was the design of the Nintendo 64 controller. Treasure wanted to make a game that had the player holding the left side of the controller instead of the right which was typical across the system&#39;s library. The Treasure team encountered difficulties programming the game, citing the system&#39;s complex 3D rendering capabilities and difficulties adapting 2D gameplay ideas into 3D environments. Originally titled Glass Soldier by Treasure, the game was retitled to Sin and Punishment by Nintendo, wanting a name that stood out.<br />\nSin and Punishment was released to positive reviews. Critics highlighted the game&#39;s intensity and flashy graphics, and particularly pointed out Treasure&#39;s ability to reduce the game&#39;s polygon count to maintain smooth gameplay action while still keeping the graphics stylish. Since the game was never released in the west, it grew a cult following among import gamers, and it quickly became one of the most demanded titles for the Wii Virtual Console after its announcement. It was finally released in western territories through the Virtual Console in 2007 to positive reviews. In retrospect, Sin and Punishment is considered one of the best Nintendo 64 games. It was ported to the iQue Player in China in 2004, and a sequel was released for the Wii in 2009, Sin and Punishment: Star Successor.</p>", "metacritic": null, "released": "2007-10-01", "tba": false, "updated": "2022-11-23T12:29:36", "background_image": "https://media.rawg.io/media/games/3f1/3f109c82ff85a91ba8f1a1d9e46c6af3.jpg", "website": "", "rating": 4.4, "rating_top": 5, "added_by_status": {"yet": 5, "owned": 11, "beaten": 10, "toplay": 5, "dropped": 5}, "playtime": 0, "achievements_count": 0, "ratings_count": 9, "suggestions_count": 856, "game_series_count": 1, "reviews_count": 10, "platforms": ["Nintendo 64"], "developers": ["Treasure"], "genres": ["Action", "Shooter", "Adventure"], "publishers": ["Nintendo"], "esrb_rating": "Teen"}