{"id": 545445, "slug": "a-short-walk", "name": "A Short Walk", "name_original": "A Short Walk", "description": "<p><strong>Intro / Theme:</strong><br/></p>\n<p>A relaxing walk in the park, with a little bit of platforming. You need to explore and reach the next campfire in time, or there will be some unfortunate consequences. It's all fun and nothing  dangerous.</p>\n<p><strong>Explanation:</strong><br/></p>\n<p>This is a submission for the OST Game Jam, where you make a game out of a song from the Two Hour Album Challenge over 10 days. A Short Walk itself is inspired by the song <strong>Progress</strong> by <strong>Don't B Flat </strong><br/></p>\n<p>I wasn't aware of the meaning behind the song until much later in the Jam. When I was planning what to do, the song give me an impression of something explosive. So I went with a platformer game where the music dictates your movement.<br/></p>\n<p> I hope you enjoy A Short Walk, despite the lack of polish. I originally intended this to be a Webgl game, but problems came up during the building process. <br/></p>\n<p><strong>Credits:</strong><br/></p>\n<p>All art assets were made by me and Valkoy in Aseprite. The font used is Silver, one of my favorite. The sound effects were whatever I could get off of opengameart and google/youtube's audio library. Huge thanks to <strong>Don't B Flat</strong> for letting us to use their song for this Jam.  Check them out if you enjoy the song.</p>\n<p>Bug Notice: If you don't see particles in your game (or can only see it in the starting area), it's a known bug. I don't know why but it works fine for the Unity Editor, so it probably has something to do with my build settings. Somehow the Mac version is the buggier one despite the fact that I was developing on a Mac :( .<br/></p>", "metacritic": null, "released": "2021-01-21", "tba": false, "updated": "2021-01-22T04:50:50", "background_image": "https://media.rawg.io/media/screenshots/cdf/cdf7a274f714ec24ec7dfe1f90aed4c4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 65, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Thuleanx"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}