{"id": 545507, "slug": "hoverboy-demo-version", "name": "Hoverboy (demo version)", "name_original": "Hoverboy (demo version)", "description": "<p><em>(Description en français à la fin)</em></p>\n<p>This is a demo of the upcoming <strong>interactive musical album</strong> <em>Hoverboy</em>. This demo contains <strong>song #8 </strong>of the album.</p>\n<p>The game is currently developed in parallel to my master thesis on the idea of \"experimental game creation\". In an attempt to present rarely exploited concepts of music transposition to the video game medium, it invites players to explore various environments and manipulate visuals through controls that vary over time, along with a predefined soundtrack. Conveying no success or failure states, it offers a mean to freely engage the music with some level of visual interactivity (one may also choose to do nothing, only observe!).</p>\n<p>Once complete, the game will contain all songs from my album <em>Hoverboy </em>as well as a few bonus songs from other artists. The <em>Hoverboy </em>music album is available</p>\n<ul><li>Here (Bandcamp): https://jesseaidyn.bandcamp.com/album/hoverboy</li><li>And here (Spotify): https://open.spotify.com/album/6mJ36b94psOBE2mW4qAKSg?si=BpLJ79K1SiW9PEckzDhYfQ</li></ul>\n<p><strong>CONTROLS</strong></p>\n<ul><li><strong>Menu</strong><br/>Navigate menu: Mouse directional axes + Mouse left-click</li></ul>\n<ul><li><strong>In-game<br/></strong>Pause: ESCAPE<br/>Navigate pause menu: Mouse directional axes + Mouse left-click<br/>Hide/Show controller interface: Left-Ctrl<br/><strong>Interacting with the virtual space</strong>: At all time, the controller interface displays which actions may be used. The interface represents, to the left, the main part of the keyboard (left-shift, numbers and letters), and to the right, the mouse (directional axes and mouse buttons). When a button is red, the corresponding key, button, or mouse movement may not be used. When it is green, it means a <strong>simple control</strong> has been associated to it (you may simply press the button). When it is blue, it means a <strong>continuous control</strong> has been associated to it (you may <strong>keep</strong> this button pressed down or move the mouse). If the green or blue buttons become very small, it means those buttons are temporarily unavailable. (see screenshot)</li></ul>\n\n<p><strong>SPECS</strong></p>\n<p>Exact required specifications haven't been tested yet for the level in this demo. If tests for previous levels are any indications, it should be recommended to play the game on a high-end computer.</p>\n<p>_____________________________________________________________</p>\n<p>Ceci est un démo de l'<strong>album musical interactif</strong> <em>Hoverboy </em>en cours de développement. Ce démo contient la<strong> 8e chanson</strong> de l'album.</p>\n<p>Ce jeu est actuellement développé en parallèle à mon mémoire de maîtrise sur l'idée de \"création de jeu expérimental\". Désirant proposer des modes rarement exploités de transposition de musique dans le médium vidéoludique, il invite les joueurs et les joueuses à explorer des environnements variés et à manipuler des effets visuels à travers des contrôles qui varient au cours du temps, supportés par une trame musicale prédéfinie. Ne supposant aucune condition de victoire ou d'échec, le jeu offre un moyen d'engager librement la musique avec un certain niveau d'interactivité (il est aussi possible de ne rien faire, seulement observer!).</p>\n<p>Une fois complet, le jeu contiendra toutes les pièces de mon album <em>Hoverboy </em>ainsi que quelques chansons bonus provenant d'autres artistes. L'album musical <em>Hoverboy </em>est disponible</p>\n<ul><li>Ici (Bandcamp) : https://jesseaidyn.bandcamp.com/album/hoverboy</li><li>Et ici (Spotify) : https://open.spotify.com/album/6mJ36b94psOBE2mW4qAKSg?si=BpLJ79K1SiW9PEckzDhYfQ</li></ul>\n<p><strong>CONTRÔLES</strong></p>\n<ul><li><strong>Menu</strong>\n<br/>Naviguer le menu : Axes directionnels de la souris + clic gauche de la souris</li></ul>\n<ul><li><strong>En jeu <br/></strong>Pause : ESCAPE\r\n<br/>Naviguer le menu de pause : Axes directionnels de la souris + clic gauche de la souris<br/>Cacher/Montrer l'interface de contrôles : Ctrl gauche <br/><strong>Interagir avec l'espace virtuel </strong>: En tout temps, l'interface de contrôles affiche quelles actions peuvent être engendrées. L'interface représente, à la gauche, une partie principale du clavier (shift gauche, les chiffres et les lettres), et à la droite, la souris (axes directionnels de la souris et boutons de la souris). Lorsqu'un bouton est rouge, la touche, le bouton, ou mouvement de la souris correspondant ne peut pas être utilisé. Lorsqu'un bouton est vert, cela signifie qu'un <strong>contrôle simple</strong> y a été associé (il est possible de simplement appuyer sur la touche). Si le bouton est bleu, cela signifie qu'il a été associé à un <strong>contrôle continu </strong>(il est possible de <strong>garder </strong>ce bouton appuyé longuement ou de bouger la souris). Si des boutons verts ou bleus deviennent très petits, cela signifie qu'ils sont temporairement inaccessibles. (voir screenshot)</li></ul>\n\n<p><strong>SPECS</strong></p>\n<p>Les spécifications requises exactes n'ont pas encore été testées pour le niveau présent dans ce démo. En supposant les tests effectués sur des niveaux précédents puissent être indicatifs, il pourrait être recommandé de jouer sur un ordinateur haut-de-gamme. </p>", "metacritic": null, "released": "2021-01-20", "tba": false, "updated": "2021-01-22T05:08:03", "background_image": "https://media.rawg.io/media/screenshots/504/5048058fc10aaa5c70985d578e6a4129.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 136, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["JesseAidyn"], "genres": [], "publishers": [], "esrb_rating": null}