{"id": 545518, "slug": "one-night-at-noot-itchio-port", "name": "One Night at NOOT: itch.io port", "name_original": "One Night at NOOT: itch.io port", "description": "<p>ANTIVIRUS WARNING</p>\n<p>If your anti-virus detects ONANOOT as a virus, this is a false positive. So it's ok to get the game out of your Virus Chest.</p>\n\n<p>\"We need you because our kids have been acting strangely recently in the basement at night. In this case, Pingu had drawn things in the night. he even made himself a relaxing spot. So let me tell you about his other activity. He would walk into the office.</p>\n<p>We noticed that if Pingu sees someone sitting on the chair, (We tested it with a plush toy.) he would scream at the person or toy and carry him or her into the trash. After he does that, he'll lock up the trash can.</p>\n<p>To avoid this happening to you, close the door when Pingu is near. For some reason, the door strangely opens by itself every 30 seconds if it's closed.</p>\n<p>Now for Pinga's behavior. She will climb into the vents and crawl her way into the office. She would do the same as Pingu when entering the office. To avoid that, there is a vent on the office floor.</p>\n<p>This is the vent that she uses to enter the office. If you see her eyes glow in the vents, use the heater. Once you do that, the vents will heat up causing her to flee from the vents and not go into your office.</p>\n<p>Be warned. If you use it too much, you'll pass out. To avoid passing out, there is an air conditioner.  You can use it anytime you want. But using it too much will make you pass out as well. So use the air conditioner when needed. That's all I have to tell you. Good luck.\" -Pingu's mom</p>\n<p>Controls</p>\n<p>Space: Cameras</p>\n<p>E: Open/Close the door</p>\n<p>Q: Turn on/off the Air conditioner</p>\n<p>A: Turn on/off the heater</p>\n<p>Tips and Tricks</p>\n<p>1. There is another way to tell when Pingu is nearby the door! If you hear footsteps, SHUT THE DOOR! (Read the controls section.)</p>\n<p>2: The door will open every 30 seconds if it's closed. Is it just me or is something paranormal going on here?</p>\n<p>3: There is another way to tell when Pinga is nearby!</p>\n<p>Instead of keeping an eye on the vent on the floor, you</p>\n<p>can hear her crawling! Yep! That's the other way!</p>\n<p>4: You can't turn both the air conditioner and heater on at the same time! (This was to remove a glitch that </p>\n<p>PinguFan99 found during development.)<br/></p>\n<p>5. Are you a mobile user reading all of this? Well, guess what? You can play the game on the go now!</p>\n<p>Just read the mobile controls below.</p>\n<p>Mobile controls</p>\n<p>Grey Button: Cameras</p>\n<p>Red Button: Heater</p>\n<p>Blue Button: Fan</p>\n<p>Door: Tap/Click on it</p>\n<p>Credits</p>\n<p>10 (Same use counted) Gifs from GIPHY were used.</p>\n<p>Coding: </p>\n<p>PinguFan99<br/></p>\n<p>Title designed by </p>\n<p>PinguFan99 in Vector<br/></p>\n<p>Sounds from FNaF, whoever created the title music, Clickteam Fusion's files, and Leon Riskin.</p>\n<p>Pingu is created by Otmar Gutmann in 1986.</p>\n<p>All rights go to their respective owners.</p>\n\n<p>PinguFan99 2021<br/></p>", "metacritic": null, "released": "2021-01-20", "tba": false, "updated": "2021-01-22T05:10:20", "background_image": "https://media.rawg.io/media/screenshots/055/0555cb86ede31660ed4f685737e29d2b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 26, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["PinguFan99"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}