{"id": 54560, "slug": "wcw-mayhem", "name": "WCW Mayhem", "name_original": "WCW Mayhem", "description": "<p>WCW Mayhem is a professional wrestling video game published by Electronic Arts, based on the American promotionWorld Championship Wrestling (WCW). The first WCW game produced by EA, it was released for PlayStation and Nintendo 64 in 1999 and for the Game Boy Color the following year.<br />\nThe game featured several firsts for a wrestling title. For instance, Mayhem was the first game to feature all twelve WCW pay-per-view venues as well as all three major WCW TV shows (Nitro, Thunder, and Saturday Night). Mayhem was also the first wrestling game released in the United States to include backstage areas, a feature which would be expanded upon in its sequel, WCW Backstage Assault. It was also one of the first wrestling games to integrate audio commentary provided by Bobby Heenan and Tony Schiavone; although, only Schiavone was included in the N64 version despite some of his lines being addressed directly to Heenan.<br />\nMayhem also featured a Pay-Per-View mode which was unique from other wrestling games, in that the player could enter a code to unlock real-life pay-per-view match lineups; these codes would be given on Monday Nitro broadcasts the week before a pay-per-view. However, this only lasted for three months (ending with the pay-per-view of the same name), as the games&#39; roster was outdated soon after its release, with several of the featured wrestlers leaving the company. The game was partially sponsored by Surge soft drinks at the time of game release.</p>", "metacritic": null, "released": "1999-08-31", "tba": false, "updated": "2023-11-01T08:26:14", "background_image": "https://media.rawg.io/media/games/28b/28b2d9db8a899a4256ccfc8d6019e360.jpg", "website": "", "rating": 3.5, "rating_top": 4, "added_by_status": {"owned": 9, "beaten": 3, "toplay": 1, "dropped": 4}, "playtime": 0, "achievements_count": 0, "ratings_count": 7, "suggestions_count": 205, "game_series_count": 9, "reviews_count": 8, "platforms": ["PlayStation", "Nintendo 64"], "developers": ["Electronic Arts", "Kodiak Interactive", "2n Productions"], "genres": ["Sports", "Fighting"], "publishers": ["Electronic Arts"], "esrb_rating": "Everyone"}