{"id": 545711, "slug": "warriors-land", "name": "Warriors Land", "name_original": "Warriors Land", "description": "<p>Warriors Land is a unique massive multiplayer RPG set in a fantasy world full of goblins, orcs and dragons. Play on your <strong>smart speaker, smart display and your phone</strong>.<br/></p>\r\nHey Google, talk to Warriors Land!\r\n\n<p>Control your character with voice or suggestion buttons on the screen. Link your account with game's website where you can find a map to track position of your warrior: https://warriors-land.web.app/map</p>\r\nImmerse yourself in a massive fantasy world\r\n<p>Move in four directions and find hidden gems on the map. Enter The City of Fortune, trade with Goblins and meet the Queen of Elves. Dozens of micro adventures are waiting for the bravest warriors.</p>\r\nDefeat your enemies and become The Great Emperor of Warriors Land\r\n<p>Your ultimate goal is to find a way to the Emperors Castle and defeat him in one-to-one battle. The journey to get there won't be easy! Evil creatures and other warriors are plundering the land...</p>\r\nBuild your character! Gain strength, gold and prestige\r\n<p>Warriors Land is a survival of the fittest richest. Win fights with creatures to earn gold. Steal from other players. Win in competitions. Every move in Warriors Land counts towards your prestige - best warriors will earn their position on the Warriors Leaderboard</p>\r\nThe game is always on\r\n<p>Leaving the game will automatically save your status, but you may be prone to attacks from other players. They may attack your camp while you're away and steal your hard-earned gold... The more players engage in the game, the bigger your chance of taking it back!</p>", "metacritic": null, "released": "2021-01-20", "tba": false, "updated": "2021-01-22T05:53:54", "background_image": "https://media.rawg.io/media/screenshots/772/772af16bae2314e22bfeee4eb722e970.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 112, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Veeheister"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}