{"id": 545755, "slug": "rickinillo-juego-de-cartas", "name": "Rickinillo Juego de Cartas", "name_original": "Rickinillo Juego de Cartas", "description": "<p>Juego temático de Rick And Morty basado en un popular juego de cartas de pueblo.</p>\n<p>El objetivo principal de Rickinillo es ser el único jugador con puntos de la partida.</p>\n<p>-Cada jugador comienza la partida con <strong>5 puntos.</strong></p>\n<p>-El jugador más Joven reparte <strong>una carta</strong> a cada jugador empezando por su izquierda.</p>\n<p>-Cuando todos los jugadores tengan una carta, comienza el jugador de la izquierda del repartidor. Este decide si quedarse su carta, o cambiarla con el jugador de su izquierda. Así sucesivamente, hasta que llega el turno del jugador que reparte. Este jugador decide si quedarse con la carta, o coger una nueva del mazo. (solo puede robar una más.</p>\n<p>-Todos los jugadores muestran sus cartas, y el jugador que tenga la carta más baja, pierde un punto.</p>\n<p>-Todas las cartas se descartan, y solo se baraja de nuevo, cuando sale el <strong>Rickinillo, </strong> al jugador que se haya quedado con esa carta al final de la ronda, pierde 2 puntos en el lugar de 1. Nota: Si el jugador que reparte es el que tiene el rickinillo, no puede cambiarla por otra nueva.</p>\n<p>Hay cartas especiales con efectos, por ejemplo:</p>\n<p><strong>- El portal: </strong> Impide que el jugador de tu derecha te intercambie una carta, en su lugar te salta, y la cambia con el jugador de tu izquierda.</p>\n<p><strong>-Barrera: </strong> impide que te cambien la carta, a diferencia del portal, el jugador que intenta cambiarla, se la debe de quedar.</p>\n<p><strong>-Plumbus: </strong> Con esta carta no solo ganas la ronda, además recuperas un punto. si tienes los 5 no ganas uno extra.</p>", "metacritic": null, "released": "2021-01-20", "tba": false, "updated": "2021-01-22T06:04:53", "background_image": "https://media.rawg.io/media/screenshots/842/84231867e6bd08f2504d766938486e1f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 107, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Tsublime Games"], "genres": [], "publishers": [], "esrb_rating": null}