{"id": 545862, "slug": "segmented-txar", "name": "Segmented (Txar)", "name_original": "Segmented (Txar)", "description": "<p>Segmented is a puzzle game with just one simple idea: you are controlling a group of cells that have to get to the buttons to pass the level.<br/></p>\n\n<p><strong>Note:  to play the game you need python and pygame installed.</strong></p>\n\n<p>Controlls are just W - up, A - left,  S - down, D - right.</p>\n<p>By pressing H you can take a screenshot that will be saved in game's folder as \"screenshot.png\". That is how I made the screenshots you can see here.</p>\n<p>By pressing R, you can restart the level you are playing currently.<br/></p>\n<p>The main idea is very simple - if you move right, every cell (cells are black by default) moves right if possible. Same goes for every other direction. To pass the level, you need every button (buttons are pretty much floor but with a different color) to be pressed by a cell. </p>\n\n<p>Skins - second option in main menu (the one displayed when launching the game) is skins menu. There, you can simply change the color of your cells. Green is unlocked after passing 5 levels, red after passing 10 levels, and blue after passing 15 levels. </p>\n<p>In the bottom left corner of the game window, you can disable/enable sounds and music. </p>\n\n<p>The game does have some glitches because collisions for every cell are so complicated that I couldn't fix them all. I tried making the levels the way that the glitches wouldn't be noticable but if you try hard enough, you will find them (please don't). I just hope you won't see any, and even if, that they won't be ruining the fun. </p>\n<p>Good luck and have fun.<br/></p>", "metacritic": null, "released": "2021-01-19", "tba": false, "updated": "2021-01-22T06:26:42", "background_image": "https://media.rawg.io/media/screenshots/814/814b04df4f7e4dd241b193da3577aea8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 17, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Txar"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}