{"id": 545880, "slug": "project-terminus-vr", "name": "Project Terminus VR", "name_original": "Project Terminus VR", "description": "<h3>All change please, this train terminates here.</h3>Project TERMINUS is a survival horror VR FPS, taking place in the mighty city of Paris. <br/><br/>2021. You are in the subway, going home. <br/>The weather is clear, the sun sets. This is a peaceful afternoon... This will be the last one.<h3>Hold your breath in the Paris subway.</h3>The centers of many cities on the planet are the scene of deadly confrontations between populations and assimilated, in a world very similar to ours at the beginning of the attacks.<br/><br/>The city of Paris will gradually become a large quarantine area where the only livings are survivors, assimilated and military forces.<h3>Immerse yourself in an apocalyptic atmosphere</h3>In Terminus, immersion is key. Every interaction is as realistic as possible. Grab objects, climb ledges and ladders, loot furnitures, crawl into ventilation systems and find as much stuff you need to survive. The enemies can hear you, so you might think twice before running around in the Paris subway...<h3>Face an unprecedented threat</h3>The enemies of Project TERMINUS come from a combination of robotics and biology. They have been contaminated by swarms composed of billions of nanites that will take control of their host by replacing the functions exercised by the brain of the individual, which kills him.<br/><br/>These swarms are a constant threat in the quarantine areas seeking to infect as many living as possible. The origin of these nanites is unknown even though several theories are advanced by many people. It will be up to you to unveil this mystery.", "metacritic": null, "released": "2021-01-19", "tba": false, "updated": "2021-02-19T02:59:59", "background_image": "https://media.rawg.io/media/screenshots/564/564a7526210f12ff5a84c0560952df52.jpg", "website": "https://terminus-cvr.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 242, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "PC"], "developers": ["CVR"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["CVR"], "esrb_rating": "Mature"}