{"id": 545912, "slug": "hunyadi", "name": "Hunyadi", "name_original": "Hunyadi", "description": "<p>Hunyadi is a hexagonal strategy game based on a historical character John Hunyadi from the 15th Century. He was one of the greatest military mind of his age. His father was  a simple soldier and he rose to become governor of Hungary.  He lead military campaigns mostly against the rising Ottoman empire. But also fought battles in various countries from Italy to Bohemia. He mostly used devastating heavy cavalry with mobile light cavalry and  also incorporated Hussite war wagons into his army in large numbers. </p>\n<p>This is a early prototype only, I only started to work on the game few days ago.</p>\n<p>So please expect bugs and missing functionality. There is no AI yet and a lot more is missing. </p>\n<p>So what we have:</p>\n<p>A map set up with a few units.(Heavy and light cavalries, Hussite War wagons, , Janissary,) You can select units with left click. You can move or attack with right click. Movement points are calculated (but not the road bonuses). Melee and Ballistic attack also  works. When run out of movement points click \"End turn\" that will refill the movement points.</p>\n<p>What is planed:</p>\n<p>1. More units: Cannons,  Commanders and a lot more..</p>\n<p>2. More functionality: AI,  Unit Moral system, Fame system(for commanders), Skills(for commanders) and lot of balancing.</p>\n<p>3. More Scenarios: Many more historical battles scenes, and a campaign mode with unit progression. </p>\n<p>4. Story elements, which can alter the battles by triggering events.</p>\n<p>5. Improved graphics and some animations.</p>\n<p>I'm curios of your feedback as if there is some interest I will be happy to continue  develop it.</p>", "metacritic": null, "released": "2021-01-18", "tba": false, "updated": "2021-01-22T06:39:01", "background_image": "https://media.rawg.io/media/screenshots/7f7/7f72b599570760adad14a0064f411e3f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 52, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["kory75"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}