{"id": 545901, "slug": "compressure", "name": "ComPressure", "name_original": "ComPressure", "description": "Design increasingly complex computation units powered by high pressure steam. Each unit has four ports with a desired function. There are only three base components. The steam generator and the switch and pipes to connect them. Using these, the game guides you through creating increasingly complex composite components. Each solved challenge yields another useful element that can be used in future designs. Poor solutions in previous stages make poor components to use further on, so you will end up coming back to old designs, tuning and optimising them.<h3>The Game</h3>The following is a quick walkthrough the game dynamics.<br/>It all starts with pipes. Left click to start a pipe and click each time to extend it in the direction of the mouse pointer. Right click to end.<br/><br/>When placing more pipes, they can either cross, or join existing pipes. To join, extend the pipe in the direction of an existing pipe.<br/><br/>To delete, press or hold right mouse button.<br/><br/>In the edit menu (one with the spanner) you can select to place a steam inlet. It is also available by pressing Tab twice. There are buttons to rotate the direction before placing, but you can also use Q and E on the keyboard. Then place with the left mouse button. <br/><br/>The numbers appearing on the pipe connections show the current pressure, from 100 when connected to a steam inlet, to 0 at any uncapped pipe end.<br/><br/>The last component is the valve. If the pressure on the + side of the valve is higher than on the - side, the valve becomes open and lets steam pass through the valve. If the + and - sides are at the same pressure, of the - side is higher, then the valve is closed and does not allow steam through.<br/><br/>The design is continually examined with a series of tests. If the output is within 1% of the test target, a score is given depending on how accurate the output is. This ranges from 100 for spot on to 0 when 1% off. An average score of 75 unlocks the next level. To focus on a specific test, click the test to enter \"play one\" mode which repeats one test.<br/><br/>Each completed design can be used as a component in future designs.<br/>", "metacritic": null, "released": "2021-01-19", "tba": false, "updated": "2021-02-15T03:00:54", "background_image": "https://media.rawg.io/media/screenshots/73b/73be92a8a20ef57898d76877fb66fc27.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 1, "achievements_count": 7, "ratings_count": 0, "suggestions_count": 80, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["Charlie Brej", "brejc8"], "genres": ["Strategy", "Simulation", "Casual", "Puzzle"], "publishers": ["Charlie Brej"], "esrb_rating": null}