{"id": 546, "slug": "shark-eaters-rise-of-the-dolphins", "name": "Shark Eaters: Rise of the Dolphins", "name_original": "Shark Eaters: Rise of the Dolphins", "description": "Featured in National Geographic and The Washington Post<br/>-Pocket Gamer - Silver Award<br/>&amp;quot;Best Technical Innovation&amp;quot; 2014 aigamedev.com awards nomination.<br/><br/>&amp;quot;...remarkably lifelike movements, from the twitch of his tail to the depths of his dives...&amp;quot; <br/>-Jeremy Berlin, National Geographic<br/><br/>&amp;quot;This technology lets you become a dolphin&amp;quot;<br/>-David Kirby, TakePart<br/><br/>Also featured in<br/>-The Baltimore Sun<br/>-Fox45 News Baltimore<br/><br/>Experience the only game in the world with 100% physics-driven creature animation and true behavioral artificial intelligence.<br/><br/>Feel the thrill of battles so intense and heart pounding you will scratch your head in disbelief. Using revolutionary physics-based animation from our custom simulation engine, Shark Eaters is unlike any fighting experience you’ve ever had. <br/> <br/>Torpedo through the water, hunting down the mighty Kthulu. Crunch into a savory fish. Whip your tail to release a bolt of electrical energy, stunning your unfortunate prey. Your heart will beat faster as you lunge and swerve for your life. Chase and be chased by devious sharks and fish too smart for their species. Play with creatures whose motion is so incredibly lifelike, National Geographic wrote two stories on it.<br/> <br/>- Pure physics fun: Every creature and every movement is physics-based and procedurally generated in real time.<br/> <br/>- Unique interactive experience: Our proprietary game engine is custom designed from the ground up to create brand new gaming experiences, always at 60 fps. Nothing else compares.<br/> <br/>- Advanced artificial intelligence: Each shark and fish has unique locomotion and intelligence. Some lurk carefully, waiting for the opportune moment. Others are aggressive, betting you are not quick enough with your reflexes to turn predator into prey. Others avoid conflict and try to outsmart you.<br/> <br/>- 9 unique sharks, each with their own movement and personality: Bull, Lemon, Blue, Tiger, Blacktip, Dogfish, Hammerhead, Mako, and Great White shark (Kthulu).<br/> <br/>- 10 unique fish, far more intelligent than normal:   Mackerel, Cod, Salmon, Herring, Mullet, King Mackerel, Rainbow Runner, Mahi Mahi, Red Snapper, and Redfish.<br/> <br/>- Play as Bandit the Bottlenose Dolphin, Simon the Commerson’s Dolphin, or Zoey the Orca. Each one is special and unique.<br/> <br/>- Plays perfectly on iPhone4s or above, iPod5 or above, and iPad2 or above.<br/> <br/>- Only on the App store!", "metacritic": null, "released": "2014-10-09", "tba": false, "updated": "2019-10-22T14:27:30", "background_image": "https://media.rawg.io/media/screenshots/3a5/3a5ca97290a3b1da5dbfcd5fafcbe920.jpeg", "website": "http://maxandhaley.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 96, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Max and Haley"], "genres": ["Action", "Simulation"], "publishers": ["Max and Haley"], "esrb_rating": "Everyone 10+"}