{"id": 5460, "slug": "siren-blood-curse-episodes-9-12", "name": "Siren: Blood Curse Episodes 9-12", "name_original": "Siren: Blood Curse Episodes 9-12", "description": "Requires Episode 1 to play.<br/>\r\nAn American TV crew has arrived in Japan to film an expose on the legend of the “vanished village” only to find themselves caught in a deadly series of events. Controlling seven different playable characters, the player must uncover the mystery behind the curse that grips the eerie village of Hanuda. Intense graphics, realistic character animation and a gritty film-like graphical presentation add to the horror of Siren: Blood Curse.<br/>\n<br/>\r\nDownload Episodes 9-12 and get ready for the intense climax to Siren: Blood Curse, as paths cross and horrible, inescapable truths are revealed. Armed with knowledge and skills from previous episodes, discover the truth behind the horrors of Hanuda village and the destiny that awaits everyone involved.\r\n<br/>\n<br/>\r\nGame Features:<br/>\r\n•\tComplex story spread across 12 dramatic separate episodes with seven playable characters. <br/>\r\n•\tUnique sight jack system lets you see exactly what your enemies see. <br/>\r\n•\tSneak past the deadly Shibito or take them head on with over 50 kinds of weapons, each with unique fatal finishing moves. <br/>\r\n•\tArchive system lets player unlock a variety of story clues and information.<br/>\n<br/>\r\nSiren Blood Curse © 2008 Sony Computer Entertainment Inc. <br/>\n<br/>\r\nUse of this item is subject to the PLAYSTATION®Network Terms of Service/User Agreement. If you do not wish to accept all these terms, do not use this item. \r\nVideo output in HD requires cables and an HD-compatible display, both sold separately.  This game supports displays ranging from standard definition to 720p displays. <br/>\n<br/>\r\nSCEI may, at its sole discretion, terminate the online service at any time upon thirty (30) days notice which shall be posted on the official game website.", "metacritic": null, "released": "2008-07-24", "tba": false, "updated": "2019-08-02T16:22:14", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PlayStation 3"], "developers": ["Sony Interactive Entertainment"], "genres": ["Action"], "publishers": [], "esrb_rating": "Mature"}