{"id": 546054, "slug": "keep-jumping-and-nobody-dies", "name": "Keep Jumping And Nobody Dies", "name_original": "Keep Jumping And Nobody Dies", "description": "<p>My first \"real\" game with Unity, just after the Solar System also posted on itch.io. School project made in solo, the constraints: a platform with 2 gameplay features minimum (besides moving and jumping), and a \"correct\" interface, debug and UX. </p>\n<p>A few days of work (in parallel with the prog classes), I took advantage of this little project to test physics (I've always been fascinated by the use of physics in games), I was also very tricky on some elements, for example the platforms are hideous, but if you had seen them in Unity they were deformed, I wanted us to be able to see their shadows well (so that it makes the scene a bit more dynamic) so in reality on the depth they are very flat. It's ugly and I probably should have gone to find 3D assets, but in the rush I made LOTS of bad choices.</p>\n<p>I also wanted the jump and the jetpack to be separated, I thought the 2 mechanics really separately (to have more input and skill learning). Moreover I wanted the player to use the space bar AND the ctrl key, with the arrow keys to move the character I found the placement of the hands on the keyboard of the old doom-like. I don't recommend to play with the controller, I didn't test it much and the feeling is not the same (but if you prefer it's your own business :))<br/><br/>And yes I know, it's very hard and some people advised me to have only one touch for the Jump AND the Jetpack. If I had time I would have added an option for that. Maybe one day I'll turn this prototype into a \"real\" little game and I'll improve all these details (and I'll add other difficulty modes, so that it's less horrible during the first games, the game is really cruel).</p>\n<p>Anyway, it's a little game, really not incredible but it's the very first one I made and I've tried to make it \"fun\" (and stressful). There are a lot of worries (physics among others, often cruel and causing aberrations), but I'm still satisfied with the whole, I produced what I had in mind. If my knowledge at the time had been more advanced I would have refined the gameplay to smooth out the aberrations, I would have refined FX, UI, sound design, but overall I'm happy with it.</p>", "metacritic": null, "released": "2021-01-19", "tba": false, "updated": "2021-01-22T07:15:08", "background_image": "https://media.rawg.io/media/screenshots/2db/2db9625227a0e416cf6dfa071b24a836.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 69, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jb Dionisi"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}