{"id": 546411, "slug": "farhaven", "name": "Farhaven", "name_original": "Farhaven", "description": "HALF PRICE during pre-order!\r\n<p>Join the adventure of a lifetime in <strong>your own home</strong> with four friends from the land of Farhaven! Ruka, Diso, Oops, and Muun need <strong>your</strong> smarts, muscle, inventory, and a little magic to bring back peace and unity to their world and ours. <strong>You</strong> are one of the main characters in the story!</p>\n<p>Stuck indoors? Want to play outside? <em>Farhaven</em> is the game for you. You choose where to play!</p>\n<p>If you enjoyed classic point-and-click adventure games, you’ll enjoy this fun-filled adventure. <em>Farhaven</em> is a casual point-and-tap adventure game, inspired by the classics and brought to life by augmented reality (AR). Its interactive story connects your world with Farhaven for a truly immersive experience.</p>\n<ul><li>No In-App Purchases required. All levels are included.</li><li>Younger players will clean their bedroom floors to play this game!</li><li>Players put their brains to work while solving simple puzzles.</li><li>Players of all ages love it!</li></ul>\n\n<p><strong>REQUIRED TO PLAY</strong><br/></p>\n<ul><li>ARKit-compatible Apple iPhone, iPad, or iPod Touch.</li><li>Camera permissions for Apple ARKit to see your world.</li><li>Audio volume to hear character dialog and gameplay directions. Use a pair of headphones if needed.</li><li>Enough artificial or natural lighting wherever you choose to play.</li><li>A fixed location whenever you play—either indoors or outside. Unfortunately, the game cannot be played while driving, flying, taking public transportation, or riding horseback due to Apple ARKit requirements.</li></ul>", "metacritic": null, "released": "2021-01-18", "tba": false, "updated": "2021-01-22T08:40:41", "background_image": "https://media.rawg.io/media/screenshots/031/03153ef578e1c9a238147fb84913d8b5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Patch & Path"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}