{"id": 546488, "slug": "milkcraft", "name": "Milkcraft", "name_original": "Milkcraft", "description": "Our name? Milkcraft.<br/>Our passion? Exploring and pleasure extending.<br/><br/>Those who search for age-old sealed mysteries, self-initiated stories, here are many things you have to see, and believe.<br/>There is no shackles, there is sunlight&amp; trees<br/>There is no loneliness, there is home &amp; companions.<br/>There is no boredom, there is ream&amp;destroy.<br/>There is chaos, and for which there is “us”<br/>There is death, but there awaits the continuation of your odyssey.<br/>Go now, if you want it, there would be otherworlds awaiting.<br/>Go, into the wilderness and the twilight and the sky, what lurks inside, would surprise your eyes:<br/>Between the blooms of dream and flame echos the scream of death, while the atramentous silence blocks the way to the existence of polarize;<br/>Right afront the scorching pyramidate for the departed swoons the deadly caretaker and four-legged riddler, as the eternal resentment wanders in the midst of the shrine where the chilled faith organize.<br/>And it`s not over yet, in the places once experienced the bloody prosperity of humanity, a forefather`s eve is still giving stage by the remains of the Dominating Ones of ancientry.<br/>That`s the appearance of the chaos that awaits, waiting for your challenge for treasure and fame.<br/>And for sure, there would also be an arcadia, right inside the overworld, for peace and recuperation, just for you&amp;friends.<br/>There would also be colonies in this endless frontier, made up of the camaraderie and collective mind, claiming our existence, right on the good soil beneath us.<br/>There is far far more for you, but I could say,<br/>There`s adventure out there, and our goal is to find it.<br/>Come with Us!", "metacritic": null, "released": "2021-01-21", "tba": false, "updated": "2021-01-25T02:31:24", "background_image": "https://media.rawg.io/media/screenshots/dde/dde7c3f331cee67b4e4983294e48f245.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 35, "ratings_count": 0, "suggestions_count": 454, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Huya"], "genres": ["Adventure", "RPG", "Simulation", "Casual", "Massively Multiplayer"], "publishers": ["Huya"], "esrb_rating": null}