{"id": 546486, "slug": "poker-pretty-girls-battle-fantasy-world-edition", "name": "Poker Pretty Girls Battle: Fantasy World Edition", "name_original": "Poker Pretty Girls Battle: Fantasy World Edition", "description": "Come play some hot rounds of poker at the Fantasy World casino!  Try your luck against a total of 16 Pretty Girls including elves, magical girls, female swordsmen, and demons who are awaiting your arrival!<br/>\n<br/>\r\n■ Play poker against Fantasy World Pretty Girls<br/>\r\nThere are 16 \"kawaii\" Fantasy girls to choose from, each coming your way all dolled up in her own unique Fantasy World outfit. Start with four girls and as you progress through the game more will become available. Poker play is based on the popular Texas Hold 'em style rules.<br/>\n<br/>\r\n■ Each Pretty Girl is unique<br/>\r\nEach girl has her own unique style of play. Choose your strategy based on each one's personality! All Pretty Girls feature recorded Japanese voices. Feel their excitement as they yell out during poker play.<br/>\n<br/>\r\n■ Choose from two game modes<br/>\r\nIn Pretty Mode, collect rewards as you defeat random opponents.<br/>\r\nIn Free Play Mode, choose girls of your liking for your very own poker battles.<br/>\n<br/>\r\n※There is no undressing or nudity in this game. It is a poker game with Pretty Girl characters included for your playing enjoyment. Characters and character images are used under license from their respective owners.  <br/>\r\n* All characters depicted in this game are over 18 years old.", "metacritic": null, "released": "2021-01-21", "tba": false, "updated": "2021-01-25T02:29:40", "background_image": "https://media.rawg.io/media/screenshots/3b5/3b5e7ff38b3d171cdee9bdb4becf56a2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 7}, "playtime": 0, "achievements_count": 28, "ratings_count": 0, "suggestions_count": 200, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Zoo"], "genres": ["Casual"], "publishers": ["Zoo"], "esrb_rating": null}