{"id": 546597, "slug": "yugipedia-yugioh-deck-builder", "name": "Yugipedia: Yugioh Deck Builder", "name_original": "Yugipedia: Yugioh Deck Builder", "description": "DISCLAIMER: This app is NOT a dueling system and will never allow you to duel. This app is merely a tool to assist you with constructing decks for playing Yu-Gi-Oh. I am not endorsed by or affiliated with Konami, and the purpose of this app is to complement the game of Yu-Gi-Oh, not to usurp it or replace it. This app is only useful if you have actual Yu-Gi-Oh cards to play with, so show your support for Konami by buying real Yu-Gi-Oh cards and playing the real game. This app can help you organize your cards into decks, but this app will NEVER allow you to duel. It isn't my place to offer dueling; I merely want to offer a helpful service to duelists.<br/><br/>Build and test Yu-Gi-Oh decks using a current database of cards that is updated daily. Share decks straight to your friend's app or share deck lists anywhere.<br/><br/>UPDATED DAILY<br/>Yugipedia’s card database is updated every day, giving you the most recent cards. Most cards will be on Yugipedia within 24 hours of their details being revealed. <br/><br/>Most importantly, the app automatically gets the latest card list every time it starts, so you don’t have to wait a few days/weeks for an app update in order to get your new cards!<br/><br/>MADE BY A YUGIOH JUDGE<br/>This app was designed and created by a member of the KDE Judge Program who knows what is needed in a good Yugioh deck builder. This app is designed to be simple to use and give you up-to-date card information so you can design truly competitive decks and stay on track with the metagame.<br/><br/>TEST YOUR DECKS<br/>You can test your decks on the fully-featured Test Field. It has all the field slots as well as tokens, counters, coin, dice, and handy shortcuts for Pot of Avarice, Desires, Duality, and Extravagance.<br/><br/>The drag-and-drop interface is easy to use, so you can practice your combos and learn new strategies the same way you would test-draw with your real-life deck.<br/><br/>SHARE YOUR DECKS<br/>You can share your decks as clickable links that will open Yugipedia and import the deck. You can also share deck files or a plain text list of the cards.<br/><br/>FEATURES<br/>• Automatic card list updates<br/>• Over 10,700 Yugioh cards, with more added daily as they are released<br/>• Includes almost all official TCG cards and OCG cards<br/>• TEST YOUR DECKS with the solo Test feature (not a duel system)<br/>• Advanced search options<br/>• Automatically-updating banlists for TCG and OCG<br/>• Small, optimized card images to save storage space<br/>• Detailed full card images for extra reference<br/>• Share deck links that can be imported straight into your friend's app!<br/>• Don’t have to update the app to get an updated card list!<br/>• Simple interface, everything is only a few clicks away<br/><br/>If I’m missing any cards, send me an email so I can add them to the app. If you have time please leave a review and tell your friends!<br/><br/>Feedback is welcome and very much appreciated. I read every message I get from a user.<br/><br/>Email: support@logick.app<br/>Twitter: @LogickLLC<br/>Facebook: Logick LLC<br/>Website: logick.app<br/><br/>Please send bug reports if the app has any problems, so I can fix it right away!<br/><br/><br/>* This app is not affiliated with Konami or Yu-Gi-Oh!<br/>* Yu-Gi-Oh!, and all related materials copyright © 1996-2020 Kazuki Takahashi. Yu-Gi-Oh! Trading Card Game, and all related materials copyright © Konami Corporation.<br/>* This app is for reference only, and all card info and images are used in accordance with Fair Use as defined by United States copyright laws.", "metacritic": null, "released": "2015-08-29", "tba": false, "updated": "2021-01-25T03:35:18", "background_image": "https://media.rawg.io/media/screenshots/ecc/ecc8db70ed400217e0116170f1506b6d.jpg", "website": "https://logick.app", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 99, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Logick"], "genres": ["Strategy", "Card"], "publishers": ["Logick"], "esrb_rating": "Everyone 10+"}