{"id": 546550, "slug": "robot-invasion-earth-battle", "name": "Robot Invasion: Earth Battle", "name_original": "Robot Invasion: Earth Battle", "description": "The sky is on fire! Humankind's great war against space invaders has begun. In the near future, humankind will be dragged into a new World War – a struggle against a mighty and mysterious alien race. Huge mechanical warriors arrived through a portal in the skies in order to enslave our planet. These massive robots are landing in the streets of your city, threatening us with their advanced space technology. But the invaders underestimated humanity: the people managed to rally the remnants of civilization, blow up the portal, and destroy the connection between the alien conquers and their robots.<br/>Enter a postapocalyptic world, where humanity is hiding in an armored shelter while their abandoned cities are inhabited by uncontrolled robots. Become a scout, one of the happy few with the genetic ability to control the space machines. You can catch, reprogram, and tame them. Find them using a unique drone, capture them, create your own squad, and join the battle to save your planet.<br/>• Discover the real world with this game: Robot Invasion is a gps game that duplicates your own city. Wander familiar streets, now swarming with huge battle robots.<br/>• Go flying: you are not limited to your neighborhood. Use a drone to search for robots and resources in New York, Tokyo, Moscow, or Cape Town! In this game, the entire world is yours to explore.<br/>• Over 100 robots to collect and upgrade – build the strongest squad and challenge players around the world.<br/>• Become the strongest scout: test yourself in dynamic and spectacular battles. Train and upgrade your units to reign as champion of every contest.<br/>• Fuse: get robotic components and join them together to create the strongest war machine imaginable!<br/>• Socialize: join a guild or team up with friends to crush a common enemy, or challenge them to prove your supremacy!<br/>• Bring robots to life: use the AR feature to watch gigantic robots roam around! Take photos with your robot collections and share them with other robot commanders.", "metacritic": null, "released": "2020-09-11", "tba": false, "updated": "2021-01-25T03:12:43", "background_image": "https://media.rawg.io/media/screenshots/0d9/0d959f3a30d716b6db5a5937c5ad56ad.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 178, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["TIPPING POINT"], "genres": ["Adventure", "RPG"], "publishers": ["TIPPING POINT"], "esrb_rating": "Everyone 10+"}