{"id": 546569, "slug": "duskwood-detective-criminal", "name": "Duskwood -Detective & Criminal", "name_original": "Duskwood -Detective & Criminal", "description": "<p>It&#39;s been 72 hours since Hannah disappeared without a trace. Out of nowhere, her friends suddenly receive a message from the missing person&#39;s phone. The mysterious message only contains a number... your number!<br />\n•  Investigate in an exciting criminal case: Collect evidence and make the right decisions<br />\n•  Images, voicemails, mini games and videos: In addition to text messages and choices, you can expect varied media and game content<br />\n• Make new friends: Join the crew and make new friends. But be careful who to trust...<br />\n<strong><em> Join the start of the new series! Download Duskwood now!</em></strong><br />\nSTORY<br />\nDuskwood is a small, sleepy village surrounded by a dense forest. Strangers rarely get lost in this remote area and when they do, they always describe the place as weird or even scary. The locals of Duskwood have never been worried about this. However, in the last 72 hours, many things have changed and even among the villagers concerns are growing: A girl has disappeared and the mysterious legends that are surrounding the ancient forest seem to come alive...<br />\n•  Realistic &amp; Exciting: Play the interactive story in a real messenger<br />\n•  Spy Mode: Secretly read chats of others<br />\n•  Completely free to play: You don&#39;t have to spend a buck if you don&#39;t want to<br />\n•  From the author of Dead City: Duskwood is the brand new story by the author of the worldwide hit Dead City. Head into this new adventure alongside thousands of fans!<br />\n•  Additional game content and updates: The game is constantly being developed. The next update will be released soon!<br />\nDownload now and connect to Duskwood! No worries - Duskwood will remain free in the future, too! You can support the development of the game through in-app purchases if you like<br />\n<strong><em>Be a part of it right from the beginning! Play Duskwood now!</em></strong><br />\nDUSKWOOD IS RELEASED IN EPISODES<br />\nWe decided to publish the interactive story Duskwood in episodes. Not to annoy you - quite the contrary! It was important to us that you could start right away, even though the game is not finished. While you&#39;re already searching for Hannah, solving puzzles and making decisions, we&#39;re working on the sequel. Your feedback is important to us. If you have any suggestions, please email us at support@everbytestudio.com<br />\nSOCIAL MEDIA<br />\nhttps://www.facebook.com/PlayDuskwood<br />\nhttps://www.facebook.com/EverbyteStudio<br />\nhttps://www.instagram.com/everbytestudio/<br />\nHOW TO PLAY? DECISION GAMES, TEXT ADVENTURES, CYOA? WHAT IS THIS?<br />\nYou are connected to your friends in Duskwood via chat messenger. This allows you to receive pictures, videos, voice messages and even phone calls. Your answers, choices and decisions influence what others reveal of themselves, whether they like you, and even change the course of the story. This type of role play game (rpg) is also called text adventure, cyoa, decision- or choice games. It belongs to the genre of interactive fiction.</p>", "metacritic": null, "released": "2019-09-27", "tba": false, "updated": "2024-03-01T19:58:21", "background_image": "https://media.rawg.io/media/screenshots/350/3502cc047a27a30abc325dea00831686_1ipwDWG.jpg", "website": "https://everbytestudio.com/duskwood-interactive-thriller-for-android-ios/", "rating": 4.67, "rating_top": 5, "added_by_status": {"beaten": 3, "dropped": 2, "playing": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 6, "suggestions_count": 75, "game_series_count": 0, "reviews_count": 6, "platforms": ["iOS", "Android"], "developers": ["Everbyte"], "genres": ["Adventure", "RPG"], "publishers": ["Jan-Carl Ewald, Vanessa Riess und Kevin Dominic Scherer"], "esrb_rating": "Teen"}