{"id": 546531, "slug": "monstrum-2-beta", "name": "Monstrum 2 Beta", "name_original": "Monstrum 2 Beta", "description": "<strong>Monstrum 2</strong> is an asymmetric multiplayer game for those looking to take survival horror to the next level. Pit yourself against a terrifying monster as a team of up to 4 human prisoners, locked in a tactical struggle to escape a decrepit sea fortress, or play as one of the many horrifying monstrosities hunting them down. <br/><br/>Use your wits and cunning to navigate a complex, procedurally generated metal labyrinth that changes layout, puzzles, items, and obstacles with each playthrough, keeping each match dynamic for humans and monsters alike. <br/><br/><h3>PROCEDURAL SEA FORTRESS</h3><ul><li>Explore Sparrowlock, the Hong-Sha Miller research facility; a structure derived from an old repurposed sea fortress. Navigate an intricate mesh of rusting rooms and walkways as you adapt to the different environmental and gameplay challenges generated with every match. </li></ul><h3>PLAY AS A PRISONER</h3><ul><li>Work together with fellow teammates to scavenge items strewn across the decaying facility to overcome the obstacles that lie between you and your ticket to escape.</li></ul><ul><li>Stay stealthy and out of sight. Use various hiding spots to avoid getting seen whilst avoiding the traps that give away your position.</li></ul><ul><li>If you’re spotted, you’d better run! Stay agile and use various items you’ve gathered in your arsenal for a speedy escape. Your survival balances on a fine line.</li></ul><h3>PLAY AS THE MONSTER</h3><ul><li>Pick from a diverse range of genetically-modified monstrosities derived from failed deep-sea experiments, each with their own distinct traits for hunting down humans. </li></ul><ul><li>Smash, climb, trap, teleport. Master different monsters and use their unique abilities to tactically exploit the environment and catch your prey off-guard. </li></ul><br/><br/>Monstrum 2 hits early access in Jan 2021.", "metacritic": null, "released": "2021-01-22", "tba": false, "updated": "2023-01-16T22:58:25", "background_image": "https://media.rawg.io/media/screenshots/f55/f55a4b952ccff77cd978b697c860ce42.jpg", "website": "http://monstrumgame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 29, "toplay": 3, "dropped": 1}, "playtime": 2, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 384, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["Team Junkfish"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Junkfish"], "esrb_rating": null}