{"id": 546576, "slug": "scary-house-survival-game", "name": "Scary House: Survival Game", "name_original": "Scary House: Survival Game", "description": "In Scary Clown Survival: Clown games horror the story is about a mother Alice trying to find her little daughter Emily trapped in an Evil Clown Carnival Festival. Enjoy this adventure-filled Scary Horror Game &amp; Share your ghostbuster experiences in clown games scary. It’s been a week since the disappearance of little Emily &amp; the town. Police are unable to find her traces in the Festival which is closed now in this Evil Survival Escape Game! Now Alicia has decided that she will go on her own to find her little Emily from the haunted house. This haunted mansion is a home to some evil souls in clown games horror. There has been no resident living here in the haunted house for so long. Face the scary clown &amp; get rid of the evil ghosts to find your daughter. The evil within this scary game is a crack attack of surprises and haunted mysteries. Be a part of the survival escape adventure on a mysterious asylum with an evil neighborhood mansion in clown games scary. After reaching the festival location far outside the town she has found out that the Carnival is possessed by a Dark Evil Clown spirit &amp; each year when the festival starts the Scary Clown consumes the good energy of visitors to become stronger. For his return, the Scary clown has abducted Emily &amp; her blood can bring him back. Alice now has to find the clues to reach her daughter &amp; defeat the Evil Scary Clown to get out of the Scary Carnival alive An all new haunted house survival escape simulator game for the survival game lovers filled with horror and paranormal activities. Keep collecting clues and battery for a flashlight to survive. Surviving here is not an easy task. Survive the dangers of dark evil ghost and escape the creepy streets of the haunted town with scary neighbor graveyards. There are no police officers or army commandos or professional ghost hunter to fight your battle. Make them run away before they attack you.<br/>Features of Scary Clown Survival Game: <br/>-Dark &amp; Horrified Ambience.<br/>- Hide &amp; Seek with Evil Ghosts.<br/>- Amazing 3D Urban Legend City.<br/>-Mysterious Gameplay.<br/>- Collection of Items for Survival.<br/>- Thrilling &amp; Spine-chilling missions.<br/>-Lots of ghosts, monsters and evil creatures.", "metacritic": null, "released": "2018-07-29", "tba": false, "updated": "2021-01-25T03:25:18", "background_image": "https://media.rawg.io/media/screenshots/187/187e78c1c59e0687be744c7dbd8cbff5_I6QO7Tw.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 176, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Muhammad Razzak"], "genres": ["Action", "Adventure"], "publishers": ["Muhammad Razzak"], "esrb_rating": "Mature"}