{"id": 546671, "slug": "basketball-agent-manager-sim", "name": "Basketball Agent: Manager Sim", "name_original": "Basketball Agent: Manager Sim", "description": "“Show me the money!” In this innovative basketball management game, you are an ambitious agent. Can you negotiate with GMs to get good contracts for your players? Do you have what it takes to handle a group of egotistical young players and shape their careers? Can you get them drafted and playing in the NBA? If you think you can make money in the murky world of modern sports, leave your morals at the door and step this way…<br/><br/>Game features:<br/><br/>•\tFind promising young players and sign them up to your agency<br/>•\tWork your way up through the international leagues (Brazil, Argentina, China and the EuroLeague) towards the D-League and the NBA!<br/>•\tGet your clients through the NBA draft – can you find a number one pick?<br/>•\tOffer your players to other teams, but don’t let their GM find out!<br/>•\tNegotiate contracts and bonuses on behalf of your players<br/>•\tFind lucrative endorsement deals for your players – don’t worry, you’ll get your 10%!<br/>•\tUpgrade your office so you can represent more players<br/>•\tUpgrade your Scout to discover better players – can you find the next wonderkid?<br/>•\tUpgrade your Commercial Manager to attract better sponsors<br/>•\tUpgrade your Coach to improve your players' skill level<br/>•\tBuy luxury items and properties – show off your wealth!<br/>•\tJust one in-app purchase to unlock the full game – the first four seasons are free<br/>•\tNo ads at all, ever<br/>•\tAchievements and Leaderboards on Game Center<br/><br/>You've been a basketball manager and a basketball player – now be a basketball agent! But what type of agent will you be – will you make and take bribes or will you operate within the rules to keep your reputation intact? <br/><br/>However you choose to play the game, the ultimate aim remains the same: get filthy rich and retire a wealthy person. How quickly can you do it and get out of this dirty business?!", "metacritic": null, "released": "2017-01-10", "tba": false, "updated": "2021-01-25T04:12:52", "background_image": "https://media.rawg.io/media/screenshots/4a0/4a09855f3dd397640e5cc941915881e8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 140, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Top Drawer Games"], "genres": ["Simulation", "Sports"], "publishers": ["Top Drawer Games"], "esrb_rating": "Everyone 10+"}