{"id": 546660, "slug": "horse-riding-simulator-2020", "name": "Horse Riding Simulator 2020", "name_original": "Horse Riding Simulator 2020", "description": "riding simulator on store. Horse Racing Riding tales simulator 2020 is a new adventure and unicorn games. In this horse derby games you have to collect all the check points and clear the stage. Wild West Fantasy horse games for free kids and girls all can enjoy this stunning graphics simulator app free for horse in the dark survival.<br/><br/>In this horse jumping games free jump over the deadly object and avoid all kind of threats to win and be the best wild west fantasy cowboy horse rider there is in all the west. Learn new abilities to be the best of all the cow boys. Complete all quest and task in this derby simulation to win different prices in the horse vet.<br/><br/>There are 15 levels in this game. In Each level, You have to collect checkpoints and three stars. In every level, the checkpoints are must to get. But to unlock the next level, You must collect at least two stars. Stars are hidden in special places. Use your brain to collect them. Also in each level, there is a fixed time. Which means that you have to complete the level in a specific time otherwise the level is failed. The graphics are extremely realistic.<br/><br/>GAME FEATURES:<br/>-BEAUTIFUL HORSE SIMULATION<br/>-REALISTIC GRAPHICS<br/>-CHALLENGING GAMEPLAY<br/>-LOTS OF LEVELS<br/>-AMAZING SOUNDS AND GRAPHICS", "metacritic": null, "released": "2020-07-30", "tba": false, "updated": "2021-01-25T04:07:38", "background_image": "https://media.rawg.io/media/screenshots/517/517d2f3536437e5b7a6cf820581acf75_EIDvZqz.jpg", "website": "https://tbe6dea2b.app-ads-txt.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 175, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Pamir Khan"], "genres": ["Adventure", "Simulation"], "publishers": ["Pamir Khan"], "esrb_rating": "Everyone 10+"}