{"id": 546628, "slug": "neon-fm-music-gaming-arcade-rhythm-game", "name": "Neon FM — Music Gaming | Arcade Rhythm Game", "name_original": "Neon FM — Music Gaming | Arcade Rhythm Game", "description": "The arcade rhythm game experience of Neon FM™ is now at your fingertips!<br/>• Groove to over 130 licensed songs from labels such as Monstercat<br/>• Unlimited free music plays on new songs every week!<br/>• New music every 2 weeks!<br/>• EDM genres include Trap, Future Bass, Electro House, Synthwave, Glitch Hop, Trance, and many more<br/>• Battle in real-time with international online multiplayer games against both mobile and arcade<br/>• Rank up and unlock over 40 additional songs<br/>• Earn free plays on songs when you level up<br/>• Hardcore and casual difficulties for every song<br/>• Direct arcade game port with additional features for mobile<br/>• Available in 12 languages: English, Korean, Chinese, Japanese, German, French, Spanish, Russian, Italian, Arabic, Indonesian, and Thai<br/><br/>\"\"BEST IN SHOW, NEW PRODUCT\"\" — Replay FX<br/>\"\"SILVER MEDAL, PEOPLES' CHOICE AWARDS\"\" — BMI Gaming<br/><br/>Tap to the beat in over 130 stages of licensed electronic dance music from the latest music labels such as Monstercat, Abora Recordings, and more in the top music game for arcade &amp; mobile!<br/><br/>Introducing Neon FM™ mobile: play the arcade rhythm game on the go or at home, tap the arcade locator feature to find machines near you, and tap the QR scanner to use your mobile account (with all of your customizations and unlocked content) at the arcade!<br/><br/>===THE AUTHENTIC ARCADE GAME EXPERIENCE, PLUS FREE PLAY===<br/>Just like the original arcade music game, many difficulty options for each song allow players of all skill levels to play and compete. Preview songs for free, and groove to a new selection of free music every week. Stick to the rhythm to gain points, earn badges, unlock new songs, and win tokens for even more free play. The mobile and arcade games both receive song updates every 2 weeks or less, ensuring you're playing the newest music and keeping competition fresh! Come see why Neon FM™ is the best music game of the decade!<br/><br/>===MOBILE AND ARCADE GAMES COLLIDE===<br/>A streamlined user interface keeps menus out of the way and automatically sets up real-time online multiplayer battles against other mobile players and even arcade game players--a first for music games! See what songs are drawing the largest crowds and jump right in the groove with a tap of your finger, then smash the beats and your competition!<br/><br/>===GROOVE YOUR WAY===<br/>Completely customize your experience with a litany of options: change the game speed, shrink the note size, swap colors, invert the screen, sort the enormous music library by different criteria, and more. Numerous control schemes allow for comfortable play even on small screens as you tap tap to the beat. Play online games or by yourself. Calibrate your timing manually or through the automatic wizard. Never has a mobile rhythm game given more control to the player!<br/><br/>===FREE PLAY &amp; IN-APP PURCHASES (IAP)===<br/>Players can experience Neon FM™ absolutely free by leveling up and earning silver coins, playing free music that rotates weekly, watching videos to earn gold coins, or completing offers from our partners for tons of free gold coins at once! Want to quickly jumpstart your Neon FM™ career, collect the latest music, and beat the hidden locked tracks? Gold coins can also be purchased directly through the app. Both silver and gold coins can be used for individual plays of tracks, but gold coins can unlock songs early, purchase songs for unlimited free plays, buy packs of songs at a discount, and customize player accounts (in future updates).<br/><br/>===ENGAGE WITH DEVELOPERS AND AN ACTIVE COMMUNITY===<br/>The Neon FM™ project began in 2005 and has evolved over a decade into a top music game primarily because we turn community suggestions into game features. Rhythm gaming has never before been so deeply influenced by its players. We invite you to chat with us on the usual social media channels to help us expand and build upon this project for years to come!<br/><br/>Download Neon FM™ now and get your groove on! The latest music and the tappiest beats await!", "metacritic": null, "released": "2017-04-14", "tba": false, "updated": "2021-01-25T03:50:07", "background_image": "https://media.rawg.io/media/screenshots/25c/25c139268d2d0f7d6ff832eefcb9a1e3.jpg", "website": "https://neonfm.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 191, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Unit-e Technologies, L.C."], "genres": ["Casual"], "publishers": ["Unit-e Technologies, L.C."], "esrb_rating": "Everyone 10+"}