{"id": 546621, "slug": "tiles-puzzle-15-puzzle", "name": "Tiles Puzzle (15 puzzle)", "name_original": "Tiles Puzzle (15 puzzle)", "description": "It is the famous 15 Puzzle game! <br/>Ready for the iPhone 5!<br/><br/>Why Tiles Puzzle is the best sliding puzzle from App Store??<br/><br/>- It has the best sliding algorithm ever! The tiles movement are smooth and you can drag more than one tile at once. See for yourself!<br/><br/>- You can play with pictures taken from the camera, choose your photo albums pictures, select among 60 beautiful images included in the app or play with your Facebook friends photos!<br/><br/>- You can play against your friends online with the multiplayer mode.<br/><br/>- Is the puzzle too difficult or too easy for you? That's ok, change between the 3 difficulties available.<br/><br/>- You will play with gorgeous images taking full advantage of the Retina display from the latest generation devices.<br/><br/>- There is an option that shows the numbers in the tiles when an image is too difficult to solve.<br/><br/>- There is a preview button that shows the original image while you play.<br/><br/>- You can compare your time with millions of people around the world. Yes! We have Game Center included!<br/><br/>- It is a universal app and ready for iPhone 5!<br/><br/>- It is FREE!<br/><br/>See what people are saying about Tiles Puzzle:<br/><br/>\"I love this app. Once you get the hang of it, its really fun. Just takes a bit of logic.\"<br/><br/>\"This game is amazing it allows you to make puzzles with your pictures!\"<br/><br/>\"AWESOME!!!!! Its so much fun because u get to take a picture and make it n to a puzzle and u can take an image you like and make as a puzzle.hard but fun!!!!!!\"<br/><br/>\"It reminds me of old times, it's just like the the one I had as a kid.<br/>You know what I mean.\"<br/><br/>What are you waiting for?? Download it now! It's FREE!!<br/><br/><br/><br/>Visit our website: http://ftapps.com<br/>Follow us in twitter: @ftapps<br/>Facebook page: http://www.facebook.com/ftapps", "metacritic": null, "released": "2009-09-02", "tba": false, "updated": "2021-01-25T03:46:01", "background_image": "https://media.rawg.io/media/screenshots/e30/e30f419c700391d5897005f01716ba2e_qogduHG.jpg", "website": "http://www.ftapps.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 50, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Felipe Tumonis"], "genres": ["Board Games", "Puzzle"], "publishers": ["Felipe Tumonis"], "esrb_rating": "Everyone 10+"}