{"id": 546652, "slug": "rc-car-race-new-rc-style-game", "name": "RC Car Race: New RC Style Game", "name_original": "RC Car Race: New RC Style Game", "description": "Hey traffic racing car game lovers we are presenting you an amazing RC car race 2019 game with multiple modes and tracks. Just burn the highway road and speed up your RC car by collecting batteries under big giants trucks or cars in highway roads. You have multiple sports cars with different modes like big city, rainy, desert and much more. As much as you collect batteries you have more chances to win the race. In this RC Car Race: Extreme Traffic Racing Adventure 2019 game you can drive your toy car beneath the city highway traffic like a crazy racer to collect batteries and points. This RC car racing or traffic racing adventure 2019 will give you the amazing and most satisfying traffic race experience which you would never learn in any toy car games. Hurry up to take control of your RC toy car and prove yourself to be the king of rc car racing driver games. <br/><br/>This RC Car Race: Extreme Traffic Racing Adventure 2019 is endless racing journey with busy highway rough roads so be careful while you are driving your RC toy car make you don’t crash with other big giants on the road. Only experienced and professional crazy racer can perfectly avoid all the vehicles on the road. Every mode of this rc car game would be a new experience and each mode has its own attraction, feeling and atmosphere. Go through amazing high quality tracks with multiple points to win the RC race.  <br/><br/>Features:-<br/>\t•\tRealistic car driving feelings as toy car driver<br/>\t•\tGet batteries to enjoy this endless race<br/>\t•\tAmazing challenging levels with great animations<br/>\t•\tCustomize your own sports car<br/>\t•\tMultiple RC Cars for driving", "metacritic": null, "released": "2019-06-01", "tba": false, "updated": "2021-01-25T04:04:20", "background_image": "https://media.rawg.io/media/screenshots/f41/f41cccb44759b7b33026be12c79db29f.jpg", "website": "https://sites.google.com/view/tripletapstudio/home", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 157, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Muhammad Asghar"], "genres": ["Racing"], "publishers": ["Muhammad Asghar"], "esrb_rating": "Everyone 10+"}