{"id": 546681, "slug": "jackpot-bingo-pop-bingo-games", "name": "Jackpot Bingo: Pop Bingo Games", "name_original": "Jackpot Bingo: Pop Bingo Games", "description": "Never miss the exciting FREE Bingo games at home!  In our bingo games, Hourly FREE chips, huge JACKPOT, multiple bingo winnings, Rich Assets bingo cards, delicate puzzle collections, holiday themes, lucky wheel of fortune...it’s time to hit the blitz winning and get into the LUCKY bingo heaven in the bingo games!<br/><br/>You can earn a ton of fun for your boring time  Spin the wheel of fortune or lucky wheel and get rewards with free chips! Win big! Bring the Bingo Caller Parlor to your mobile, bingo at home!<br/><br/>Amazing Lucky Bingo Features<br/>- Play OFFLINE BINGO GAMES &amp; card games, No internet needed! You can play fun bingo at home, or anywhere, anytime.<br/>-Multiple card play: One bingo card is SO old-school - play multiple free bingo cards at the same time in!<br/>-Collect puzzle bingo cards for Rich Assets, create unique treasures from the wheel of fortune and make worldwide cuisines, then start your own bingo story!<br/>- Win rewards in daily spins wheel of fortune and try your luck every day!<br/>- Customize your bingo caller and call out your lucky numbers.<br/>- Exciting in-game events keep your fun going, blitz to collect surprising prizes!<br/>- Holiday themes update regularly with special gameplay!<br/>- 30+ Bingo rooms and themes<br/>The modern New York, the romantic Paris, the classic London, the mysterious Moscow, the wealthy Dubai, and the beautiful Bali.<br/>-Mysterious Loteria debris cards-journey around the world and collect mysterious Loteria debris cards! <br/>-Complete the task with fun! Get mysterious Loteria debris cards from the treasure chest and unlock more gameplay.<br/>-Good luck and magical props-smudge tips, instant bingo cards, Loteria, double coins... use magical props to win!<br/><br/>Disclaimer:<br/>- The games are intended for use by those 17 or older for amusement purposes only.<br/>- The games do not offer \"real money gambling\" or an opportunity to win real money or prizes.<br/>- Practice or success at social card gaming does not imply future success at \"real money gambling.\"", "metacritic": null, "released": "2020-11-16", "tba": false, "updated": "2021-01-25T04:17:49", "background_image": "https://media.rawg.io/media/screenshots/7da/7da30592543f1eff414384d9d2ee42b7_xvwMsbs.jpg", "website": "http://www.joynowstudio.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 120, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["zhu bangqing"], "genres": ["Board Games", "Casual"], "publishers": ["zhu bangqing"], "esrb_rating": "Everyone 10+"}