{"id": 546647, "slug": "pink-princess-house-craft-game", "name": "Pink Princess House Craft Game", "name_original": "Pink Princess House Craft Game", "description": "Once upon a time, a little princess decided to build a lovely pink mansion. She wanted it to look like a doll house because she adores toys and dolls. But the point is that most of these toys and dolls, she seized from children! This naughty princess also took all your toys which you now need to find and retrieve. <br/><br/>Depending on which character you choose to play, you will have a different set of toys to find in the Pink Princess House. If you select to play as a boy, you will then have to search for cars. And if you take on a girl’s role, you will have to find a pony and all dolls (rest assured there are really many of them to keep you busy and entertained)! <br/><br/>Get ready to play through an amazing doll house explore adventure! But bear in mind – the capricious pink princess and her friends are not willing to give their toys and dolls just for a thank you! <br/><br/>To outwit the girls, you will have to move around the pink mansion very quickly, and there are a lot of secret places to hide. The pink princess hates to play hide-and-seek – make her angry by hiding properly, say, under a bed, a table or in a wardrobe! <br/><br/>The Pink Princess House is awesomely huge, which makes it a perfect place to play hide-and-seek. This mansion features several floors, a large garden with a beautiful fountain, multiple rooms with posh furniture, and delicious pink blocks walls – a true embodiment of a pink princess dream! <br/><br/>Explore every corner in the princess doll house because your toys can be anywhere! Make sure you visit a store, too. There you will buy all necessary stuff to play tricks on the pink princess and her friends. In the store, you can find a plethora of useful things including a cute puppy that can bring a pony or a car to you, a potion of invisibility, the princess’s pet cat, and lots of other valuable and interesting items. <br/><br/>Once you have discovered your every toy and doll, your next objective will be to find the button, opening the exit door, and escape from the pink house. We highly recommend using the mansion’s map to easily navigate in this location. <br/><br/>On first sight, you may think it is a game for girls, but it is absolutely not! You can opt to play this game in the boy mode and search for cars, play hide-and-seek with girls, drink a speed potion, and run around the pink blocks estate like a lightning! When you get to a terrace, you will see for yourself that this mansion is a perfect doll house! <br/><br/>It is essentially a craft game, in the world of which, everything is block-shaped, and there are no round forms! If you are a fan of craft games, then you definitely should try the Pink Princess House game, which is made of hundreds of pink blocks! <br/><br/>Before you try to escape from the pink princess dream house, make sure you have explored every spot here because if you fail to find all missing toys, the exit button will not get activated. The house map will help you understand which room you have not visited yet. A pony, dolls, and cars are very small so that you should be very attentive while exploring the rooms. If you have difficulties finding the toys, just call up the puppy – he is always ready to help you. <br/><br/>Pink princess house is a game for girls and boys alike! Have fun, run around, play hide-and-seek – do anything you want in this fantastic pink world!", "metacritic": null, "released": "2020-08-20", "tba": false, "updated": "2021-01-25T04:02:19", "background_image": "https://media.rawg.io/media/screenshots/c6b/c6b69adaaaef6fc8b1849b1cdb81f417_8ZGhTxZ.jpg", "website": "http://wildgames.net/contact-us/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 52, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Vladimir Dolgov"], "genres": ["Adventure", "Puzzle"], "publishers": ["Vladimir Dolgov"], "esrb_rating": "Everyone 10+"}