{"id": 546724, "slug": "pet-world-my-animal-hospital", "name": "Pet World – My Animal Hospital", "name_original": "Pet World – My Animal Hospital", "description": "***Care for 10+ Adorable Animal Species***<br/><br/>Cute animals from all over the world are coming to you. Friendly cats and dogs from your neighborhood meet exotic species like ocelots, polar bears, koalas and pandas. All of them are waiting for your care to get well again! These adorable and realistically portrayed furry friends will make a home in your heart sooner than you know it.<br/><br/><br/>***A Variety of Minigames***<br/><br/>The first examination will show you the animal's symptoms. It lets you set up the diagnosis through exciting minigames. Once you find out what the symptoms are, the animal is brought to the appropriate station.<br/><br/><br/>***Customize Your Rooms and Wards***<br/><br/>The more patients you nurse back to full health, the more word of your success will get around. Make room for more animals by expanding your patient rooms. Decorate your corridors with new plants, paintings or carpets and place them as you like. Upgrade your outdoor area so you can offer your patients a breathtaking view of a waterfall.<br/><br/><br/>***Manage Your Own Animal Care Ward***<br/><br/>Keep an eye on your inventory and make sure there are always enough supplies. To help boost them, you'll find hidden coins or bonus bags every now and then. Or you can spin the wheel of fortune several times a day to win useful prizes.<br/><br/><br/>***Stronger Together***<br/><br/>Of course you can't complete all your tasks all alone. Hire some other people to help you. They can take over tasks for you and look after your animals.<br/><br/><br/>***Scrapbook For Thank Yous From Former Patients***<br/><br/>There is a scrapbook in the entrance area of the house. Here you can find greeting cards with thank you notes from former patients.<br/><br/><br/>***Features***<br/><br/>* Examine and care for cute new animal species<br/>* Play exciting minigames<br/>* Collect daily bonus boxes and coins<br/>* Unlock various rooms<br/>* Decorate all rooms individually<br/>* Take care of exotic species that need your help<br/><br/><br/>If you have questions or problems, please contact us via our Facebook page: facebook.de/tivolamobile.<br/><br/>Imprint:<br/>http://www.tivola-mobile.com/de/tivola-unternehmen/impressum/", "metacritic": null, "released": "2019-12-04", "tba": false, "updated": "2021-01-25T04:37:09", "background_image": "https://media.rawg.io/media/screenshots/794/794ccc02d0f9d0665068990b052155e8_liURKdx.jpg", "website": "https://www.tivola.de/en/apps/pet-world-meine-tierklinik-2/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 216, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tivola Games"], "genres": ["RPG", "Simulation"], "publishers": ["Tivola Games"], "esrb_rating": "Everyone 10+"}