{"id": 546744, "slug": "chess-tactics-and-lessons", "name": "Chess Tactics and Lessons", "name_original": "Chess Tactics and Lessons", "description": "“Chess is 99% tactics” (R. Teichmann.) From beginner to expert, practicing tactics is hands-down the best way to master the game. <br/><br/>Our app provides tactics, lessons, and openings and adjusts to your ability as you play. Join thousands of users who improve their game with tactics every day:<br/><br/>\"This app is a must have for any chess player - student or master.\"  -Tom Taylor, USA<br/>\"This is easily the best purchase I've made since owning a smartphone.\"  -Miles C. Samuels, USA<br/>\"This app has improved my game tremendously!\"  - anonymous fandom on the App Store<br/><br/>FEATURES<br/><br/>- Tactics: Play as many tactics as you want, for free.<br/><br/>- Lessons: Get deeper into strategy with detailed lessons including positions from Netflix's 'The Queen Queen's Gambit' and the 2018 World Championship.<br/><br/>- Openings: Practice makes perfect -- save and practice openings from the Grandmasters and more.<br/><br/>- Create your own tactics, lessons, and openings for others to try. Compete with others to make the leaderboard for the toughest ones.<br/><br/>- Learn from your mistakes. When you get something wrong, you can see the solution, see an explanation for the tactic, and talk to others in the comments.<br/><br/>- Join the community: comment on tactics and learn from other users.<br/><br/>- Customize your board design.<br/><br/><br/>New tactics are added every day, so you'll never run out.<br/><br/>------<br/><br/>Chess Tactics PRO subscriptions will  be charged to your iTunes account upon purchase. Subscriptions will automatically renew unless canceled within 24-hours before the end of the current period. You can cancel anytime with your iTunes account settings. See Privacy Policy and Terms of Service for more information.<br/><br/>Privacy Policy: https://chesstacticsapp.com/privacy.html<br/>Terms of Service: https://chesstacticsapp.com/terms.html<br/><br/>Acknowledgements:<br/>Chess Pieces by jurgenwesterhof on WikiCommons (adapted from work of Cburnett)<br/>Icons by bezier master, Cutiecon, and Shawn Wong from the Noun Project.", "metacritic": null, "released": "2012-06-07", "tba": false, "updated": "2021-01-25T04:46:13", "background_image": "https://media.rawg.io/media/screenshots/866/86643ddd7fa7e075692dcbd65d1f58f3_mFd9PpI.jpg", "website": "https://chesstacticsapp.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 63, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Lockwood Productions"], "genres": ["Board Games", "Educational", "Puzzle"], "publishers": ["Lockwood Productions"], "esrb_rating": "Everyone 10+"}