{"id": 546764, "slug": "king-of-steering", "name": "King of Steering", "name_original": "King of Steering", "description": "Get in gear and take on the world’s most fearless racing pros to become the king of Steering (KOS). <br/><br/>Customizations<br/>First, let's head on to the garage to choose from a wide variety of real sports cars unlike that found in any other game. Pick the dream car you need and customize it! Upgrade your car's performance or simply add cool decals! Either way it's an unparalleled level of customization! The all new paint system lets you customize body and glass color choosing from an infinite color combination making it possible to create your dream car! <br/><br/>Gameplay<br/> <br/>Time to hit the tracks! Pick Free Roam mode and smoothly glide across multiple highways and roads! Create an event and beat your friends in an exciting race. KOS has stunning, almost lifelike graphics of the cars and the environment!<br/>Connect in the multiplayer to drift it with friends. Create your own network room or join existing.<br/><br/>Gameplay Environment<br/><br/>Tired of crashing into your friends? Time to join the most popular burnout race! Check out the Tafger mode and burn your tires out on the asphalt! Whether its rainy, sunny or even night time, it’ll be a unique experience in each like never before. <br/> <br/>EASY TO PLAY, HARD TO MASTER - Play a quick race in your spare time or play the solo game and earn daily rewards. The more you play, the more you earn and the more upgradables you unlock.<br/><br/>KOS features unique drift modes that will take you to a whole new level of drift and gameplay.<br/><br/>Drift Modes<br/>Arabic Drift<br/>Burnout<br/>Classic<br/>Offroad<br/>Sports<br/><br/>Gameplay Controls<br/>Accelerometer (gyroscope) or touch steering mode.<br/>Slider or touch throttle.<br/>Automatic or manual transmission.<br/>Not only car customization you can now also select players and customize your outfit to the environment or of your choice. <br/> <br/>TROUBLESHOOTING:<br/>- If the game doesn't start up, runs slowly or crashes, please get in touch and we'll do our best to help.<br/>If you have any questions contact us through our Support system: https://umxstudio.co/en#contact-us or via e-mail at support@umxstudio.co", "metacritic": null, "released": "2016-03-04", "tba": false, "updated": "2021-01-25T04:58:10", "background_image": "https://media.rawg.io/media/screenshots/bb2/bb205793fb3be9d2ddfce4100fd6bb53_iwg7wdn.jpg", "website": "https://umxstudio.co", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 118, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["UMX STUDIO FOR TECHNOLOGY"], "genres": ["Simulation", "Racing"], "publishers": ["UMX STUDIO FOR TECHNOLOGY"], "esrb_rating": "Teen"}