{"id": 546717, "slug": "flying-formula-robot-war", "name": "Flying Formula Robot War", "name_original": "Flying Formula Robot War", "description": "Convert your dream formula car into the big giant robot. <br/><br/>The robot formula car modified conversion is totally action and racing game you as a formula car racer convert your real car into giant robot and then start you robot car war battle. In this robot formula car, convert your formula cars into giant robots &amp; enjoy the ultimate robot car battle. Play challenging mission of converting robots and beat the enemy robots to win the robot formula car battle simulator. You have played a lot of formula cars modified giant robot simulator but this game is different from other robot car games, thus it contains both conversion, racing and battle at the same time. So get your hands on the most amazing and thrilling robot formula car conversion game of the year 2021.<br/><br/>Explore the big city environment and become the winner in the ultimate thrilling robot formula car conversion simulator. Modify the robot formula car according to your own choice. Download robot car conversion games &amp; enjoy a new level of fun.<br/><br/><br/>Features<br/><br/>. Ultimate robot car challenges.<br/>. Thrilling war missions and formula race.<br/>. HD graphics and stunning animations.<br/>. Select formula car for grand robot war.<br/>. Convert you formula car into giant robots.<br/>. Collect rewards and earn coins.<br/>. Best background sound effects.<br/>. Realistic robot conversion features.<br/>. Smooth and easy control gameplay.", "metacritic": null, "released": "2020-02-19", "tba": false, "updated": "2021-01-25T04:33:49", "background_image": "https://media.rawg.io/media/screenshots/739/739a917afe00786db3b41c56572bee2f_vSzOsyE.jpg", "website": "https://thehitboxgames.com/app-store/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 148, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["HITBOX GAMES"], "genres": ["Strategy", "Racing"], "publishers": ["HITBOX GAMES"], "esrb_rating": "Everyone 10+"}