{"id": 546776, "slug": "lips-done-satisfying-lip-art", "name": "Lips Done! Satisfying Lip Art", "name_original": "Lips Done! Satisfying Lip Art", "description": "Relax &amp; rejuvenate your mind with the best Satisfying 3D lip art game. Happiness is getting your lips done with different patterns &amp; colors at your favorite beauty salon. Can you reach your potential and create your own masterpiece for a sweet satisfaction at our lip art shop? Well serve your clients with the ultimate lip makeover using the latest lip art techniques. Treat the dry &amp; damaged lips with dermatology instruments. Heal the damaged lips with lip balm &amp; lip gloss first. Then enhance the lip size using lip enhancer &amp; lip plumping device. Use the lip plumper to achieve the size desired. Once done its time to give her lips a beautiful makeover with lipstick. Learn to use beauty accessories following a very satisfying and relaxing process to give her lips an ultimate makeover. Enjoy tons and tons of options including glitter lipsticks, lip art with tattoo normal lipstick and so much more. Do you know doing makeup relieves stress and is considered one the best antistress &amp; antianxiety task as per the experts! Why not try this new satisfying lip art game with some ASMR triggers.<br/>Game Play:<br/>The first oddly satisfying makeup game with satisfying lip art.<br/>Easy to control and play.<br/>Includes more than 30 ASMR triggers for relaxation.<br/>Learn to heal damaged &amp; cracked lips.<br/>Satisfying lipstick design makeover game.<br/>Create the best lip art designs. <br/>Satisfy your clients with a new look they never forget to earn money.<br/>Rainbow lips, unicorn lips, glitter lips &amp; so much more.<br/>Biggest lipstick tutorial compilation ever with more than 1000 lip art designs.<br/>Proven to relax your eyes &amp; mind with an oddly satisfying trigger.", "metacritic": null, "released": "2020-08-18", "tba": false, "updated": "2021-01-25T05:04:38", "background_image": "https://media.rawg.io/media/screenshots/3ba/3ba75f02e780400124c626f1cab40d9b_gK1OdDe.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 56, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Shanze Shafique"], "genres": ["RPG", "Simulation"], "publishers": ["Shanze Shafique"], "esrb_rating": "Everyone 10+"}