{"id": 546735, "slug": "big-farm-home-garden", "name": "Big Farm: Home & Garden", "name_original": "Big Farm: Home & Garden", "description": "Big Farm: Home &amp; Garden is a free match-3 puzzle game where you can be the best designer and transform shabby and crumbled farmscapes  into amazing farm design makeovers. Solve challenging puzzles to help designing, customizing and decorating the perfect dream farm with beautiful furniture, decor and many cute animals. <br/><br/>Help farm friends and families and renovate their farm buildings to its former glory. Mix and match to solve fun blast puzzles. Play with themed boosters &amp; renovate the farm areas with dozens of customizations options! Dig into loveable storylines and interact with a cast of unique and colourful characters. <br/><br/>* Design Farmscapes:Renovate and decorate different farm scenes including family-friendly farmhouses, vintage barns and rustic chicken coops. Help clients ranging from the newlyweds to families and elderly people, and even cute animals. <br/><br/>* Addictive gameplay: A combination of match-3 puzzles plus home decorating gameplay brings you an overwhelming fun gaming experience! Swap and match, restore and decorate farmscapes, and be part of a breath-taking adventure all at once!<br/><br/>* Solve fun match-3 puzzle: Be challenged with hundreds of unique match-3 levels. Match various items as vegetables and tropical fruits. Enjoy a variety of game modes for endless relaxing fun. <br/><br/>* Play with cute animals on the puzzle board: Discover their special powers, match gorgeous combos with your cuddly companions and blast addictive puzzle levels! Have fun with your dog, chickens, pig and many other animal friends.<br/><br/>* Express yourself: Remodel homes with a farmhouse style or go Modern? You decide, you design! Customize with an incredible variety of high-end designer furniture, lighting, flooring and other decor. Design houses or rooms to make it just like in your dreams!<br/><br/>* Meet the Big Farm villagers: Become close friends with Benny, Lydia, and all their cheery friends are waiting for you. Learn more about the warm-hearted stories of the fun and vivid characters.They will help you decorate along the way!<br/><br/>* Enjoy country life: Escape the hustle and bustle of the city and relax in the countryside! Take a break and enjoy some sun and relaxation.<br/><br/>Big Farm: Home &amp; Garden is completely free to play with optional in-app purchases. You may disable in-app purchasing using your device settings. This game requires an internet connection. Privacy Policy, Terms &amp; Conditions, Imprint: https://www.goodgamestudios.com/terms_en/", "metacritic": null, "released": "2020-10-14", "tba": false, "updated": "2021-01-25T04:42:01", "background_image": "https://media.rawg.io/media/screenshots/17d/17d0202c088d250319bf259caf08fe75_VawNgOq.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 283, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Goodgame Studios"], "genres": ["Casual", "Puzzle"], "publishers": ["Altigi"], "esrb_rating": "Everyone 10+"}