{"id": 546746, "slug": "airplane-games-for-flying-fun", "name": "Airplane Games for Flying Fun", "name_original": "Airplane Games for Flying Fun", "description": "Do you adore airplanes and all things that fly?  Then fly into some fun with the Airplane Games for Flying Fun App!  This interactive and informative app was designed by teachers with over 15 years childcare experience, using their philosophy of learning through play.  With over 30 airplane games, sounds, and flashcards this app will get everyone excited about airplanes and the airport! <br/><br/>Airplane Flying Game<br/>Take off and have some fun flying airplanes in this interactive exciting game!  You’ll get to fly different airplanes and helicopters that are going to a birthday party, on a jungle safari, over the city to rescue superheroes, to visit the King and Queen, and even a rocket in space.  And along the way you get to collect things for your trip, like birthday presents, or jewels, but watch out for the birds in the sky as you fly!  <br/><br/>Airplane Tap Sounds<br/>If you love planes then you’ll have a blast with the Airplane Tap Sounds.  Like the old flip page comic books you tap the screen to make the airplane take-off, do stunts, float a hot air balloon, and even make another plane release a Glider plane!  These sounds are interactive fun that give you the choice of how fast or slow the planes will go, and along with the entertaining music you’ll have a blast making aircraft fly high! <br/><br/>Airplane Games<br/>These games feature 7 different aircraft that you’ll have a blast playing with!  Each plane has four games, including spot the difference, a size game, a matching puzzle, and a counting game.  These games are interactive fun and designed to promote learning through play by teaching cognitive skills, early math concepts, and size recognition.  With spot the difference you will have to look really closely to see what plane is different.  With the size game you’ll be asked to find the smallest, medium, or largest airplane on the screen.  The matching puzzle game has you find the other half of the plane, and will show you the finished plane when you choose the right one.  And in the numbers game you will be asked to count the planes on the page and find the right number in the clouds above.  All the games are interactive and entertaining and will keep any little pilot having fun! <br/><br/>Airplane and Airport Flashcards<br/>With the airplane flashcards you will find out what the different types of planes and other aircraft are really named, and hear an interesting fact about the aircraft.  With the airport flashcards you will find out about all the parts of an airport, and flying in an airplane.  Also with an interesting fact about that part of an airport.  The flashcards are super fun and will get you excited about flying and going to the airport!<br/><br/>Suitcase Game<br/>Who loves to pack a suitcase?  Then gear up for some fun with the Suitcase Game!  In this interactive game you’ll be packing a suitcase for a trip to the beach, the jungle, the North Pole, to visit the King and Queen, a birthday party, and to see pirates.  You will get four objects to choose from and you have to decide which is the right one for your trip.  In the end you will have packed 6 different items for your trip, and get to see the full suitcase.  This game promotes creativity and reasoning skills and is designed for fun!<br/><br/>Rev your engines and get ready to take-off for some fun with airplanes, aircraft, and the airport in the Airplane Games for Flying Fun app!", "metacritic": null, "released": "2020-03-20", "tba": false, "updated": "2021-01-25T04:47:30", "background_image": "https://media.rawg.io/media/screenshots/ca2/ca2f32a05398ac0941e2b05051f00739_3ucU9w6.jpg", "website": "http://playnlearnapps.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 115, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Nancy Mossman"], "genres": ["Racing"], "publishers": ["Nancy Mossman"], "esrb_rating": "Everyone 10+"}