{"id": 546765, "slug": "violas-quest-marble-blast", "name": "Viola’s Quest: Marble Blast", "name_original": "Viola’s Quest: Marble Blast", "description": "Experience the magic of MARBLE GAMES with this new MARBLE SHOOT GAME! Join Viola on her marble quest to defeat the evil Desmond and decorate you magic garden.  <br/>Violas Marble Quest is a marble shooting game that incorporates color blast puzzle solving skills into a magic quest!<br/><br/>How To Play:<br/>Match 3 marbles or more of the same color and create a magic blast to pop those marbles! Collect and use special magic blast powers-ups like the Thunderbolt or Shockwave and blast marbles away! <br/>If you’re looking for a free game that will relieve stress, Violas Marble Quest is the best game for you.  This is a great game to play with friends or as great games for kids.<br/><br/>Key features:<br/>- Match-3 or more to pop marbles in this exciting new adventure game!<br/>- Save the dragonflies, clear all the marbles, beat the time and stop Desmond from stealing all the magic! <br/>- Play engaging levels with unforgettable features that will make you completely addicted to the game! Release adorable dragonflies, blast marbles, let glowing fireflies help you win! <br/><br/>Play to discover even more outstanding features! <br/>- Boss levels: will you manage to create a gap and defeat Desmond?<br/>- Decorate your Garden with magic lantern, flowers, magic mushrooms &amp; more!<br/>- Spectacular, power-up boosters! Play marble games and unlock them all. <br/>- Many deluxe powers to discover! Create combos to get amazing power-ups. <br/>- Amazing graphics<br/>- Play with friends: Connect your Facebook account &amp; Play with FB Frineds!<br/>- Easily sync the game between different devices when connected to the Internet<br/>- No Wi-Fi connection required, but you unlock the full game features when connected to the Internet<br/><br/>Accept the challenge and have fun playing Marble Viola's Quest!<br/>Follow us to get news and updates: <br/>- Facebook: https://www.facebook.com/violasquest/<br/>- Instagram: http://instagram.com/violasquest/", "metacritic": null, "released": "2018-05-28", "tba": false, "updated": "2021-01-25T04:58:52", "background_image": "https://media.rawg.io/media/screenshots/216/216ad35c9e29676dc47f36f96fd8bad4.jpg", "website": "https://www.twodesperados.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 140, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Two Desperados"], "genres": ["Casual", "Puzzle"], "publishers": ["Two Desperados"], "esrb_rating": "Everyone 10+"}