{"id": 546796, "slug": "link-3-connect-match", "name": "Link 3 - Connect & Match", "name_original": "Link 3 - Connect & Match", "description": "LINK, MATCH &amp; HAVE A BLAST with the new fun puzzle game!<br/>Play now for free and enjoy super fun challenges and awesome brain teasers. Test your skills in this amazing memory game and have a relaxing, fun time relieving your stress. <br/><br/>In Link 3 - Connect &amp; Match, your goal is to remove all the images from the board by connecting 3 identical images. Connect lovely images of cute animals, delicious food, amazing places, and so much more. NOTE! You need to remove all the tiles before the time is up! So warm up your fingers, and it’s game on!<br/><br/>How to play Link 3 - Connect &amp; Match?<br/>* Match and connect 3 same kind tiles <br/>* Link the identical images and tap to draw a line between them <br/>* Remove the tiles before time is over! <br/>* Match farther tiles to gain more stars: longer lines=more points!<br/>* Sharpen your brain by solving all the challenges <br/>* Use the HINT to reveal a possible connection<br/>* Use the SHUFFLE to rearrange all the images randomly <br/> <br/>Download this great pairs matching game and enjoy solving well-designed puzzles and brain teasers. Play whenever and wherever you want, unwind, relax, and clear your mind as you exercise your brain and sharpen your skills. <br/> <br/>Game Features: <br/>- Awesome PUZZLES to train your brain<br/>- Easy to pick up and play tile connect game<br/>- Beautiful themes and images<br/>- HINT and SHUFFLE helpful boosters<br/>- Free to play link game<br/>- Fun for everyone! <br/>- Play ONLINE or OFFLINE: you don’t need to worry about a Wi-Fi or internet connection <br/> <br/> <br/>Link, Match, and Connect! <br/>Play now and improve your memory as you swipe and link colorful tiles and make big explosions! Plan your moves and work out a winning strategy to remove the images and reach the target. Use the hint and the shuffle boosts to help you make the right matches. <br/> <br/> <br/>Join the puzzle matching adventure NOW and enjoy hours of FUN linking tiles and solving amazing puzzles! <br/> <br/>Link 3 - Connect &amp; Mac is free to download and play, but contains in-app purchases. You can turn off the payment feature by disabling in-app purchases in your device’s settings.<br/><br/>Subscriptions automatically renew unless turned off at least 24 hrs before the current period ends. Manage subscriptions via iTunes account settings.", "metacritic": null, "released": "2020-11-23", "tba": false, "updated": "2021-01-25T05:13:02", "background_image": "https://media.rawg.io/media/screenshots/bf0/bf0b3ad6bd4b90792953227422c0adec_4TCmuVl.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 62, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Boombox Games"], "genres": ["Board Games", "Puzzle"], "publishers": ["Boombox Games"], "esrb_rating": "Everyone 10+"}