{"id": 546825, "slug": "aquaparkio-3d", "name": "Aquapark.io 3D", "name_original": "Aquapark.io 3D", "description": "Welcome to the wonderful world of fun water slide game and be the hero by beating other players!<br/><br/>Compete with others and get the real parkour experience. <br/>Gather people across the water slide and crush your opponents with your overwhelming leadership!<br/><br/>Kill the enemy<br/>Steer clear of powerful enemies who can beat you in seconds during the race in water slide. Survive to win from your multiplayer competitors. Set a new record and improve your game rankings every day.<br/><br/>Fun run racing adventure<br/>Set on a fun-filled run racing adventure to challenge your survival reflexes with this exciting game. Filled with lots of exciting gameplay elements, this game is designed to get the adrenaline pumping through your bloodstream. <br/>Every level has a new unique experience.<br/>Run and run never stop running! <br/><br/>New characters every day<br/>Apply a new strategy every day by following unique game logic and experience. Use smooth swipe game controls to clear the levels.<br/><br/>Smooth game controls<br/>Eliminate the hassle of lag-filled, slow gameplay as this 3D swimming is designed to offer you the most responsive gameplay and smooth controls. Hold your breath as you move from one barrier to next. You will never know what is coming!<br/><br/>Smooth running experience<br/>Discover the smooth running experience of fun race 3d now in multiplayer games. Be sneaky and try to bump other players during the race and finish 1st! Collect stars as you play and reach 100% to unlock new levels and bonuses!<br/><br/>How to play:<br/>- Pick your characters<br/>- Hit the play button<br/>- Beat the opponent players in water slide race<br/>- Overcome stampede to survive<br/>- Steer clear of your competitors<br/>- Collect cash and unlock cool characters<br/><br/>Features:<br/>- Attractive graphics and appealing design elements<br/>- 3D view of the game zone for a boosted thrill<br/>- Adventurous fun racer game <br/>- New challenges at every step of the way<br/>- Filled with tough levels and stampedes<br/>- Exciting new game characters to choose from the store.<br/><br/>Would you like to experience the delight of an action-filled 3D water slide game? Download Aquapark.io 3D Today!", "metacritic": null, "released": "2020-06-09", "tba": false, "updated": "2021-01-25T05:25:35", "background_image": "https://media.rawg.io/media/screenshots/860/8609769384fb61694feb9a7bf2959c8a_MOg5Gbz.jpg", "website": "https://avongames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 51, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Akbari Bhaveshbhai"], "genres": ["Racing", "Casual"], "publishers": ["Akbari Bhaveshbhai"], "esrb_rating": "Everyone 10+"}