{"id": 546890, "slug": "questland", "name": "Questland", "name_original": "Questland", "description": "Create legendary hero and dive into fantasy RPG world!<br/><br/>Featured by Apple many times in XXL RPGs collection!<br/><br/>Players are saying:<br/>“The game is addictive and fun. Love it!”<br/>“The graphics are amazing and it brings back the turn based system of fighting from older games.”<br/><br/>Join a growing community of powerful heroes and battle your way to the top of the ranking. You and your friends will love it - everyone can become a champion!<br/><br/>A real treat for all classic RPG lovers:<br/>◆ First-person perspective (FPP) with dynamic dungeon crawler battles<br/>◆ Create a legendary character from scratch! Thousands of looks to choose from<br/>◆ Duel other players online during PvP trial on the Arena<br/>◆ Battle hundreds of vile monsters during the campaign<br/>◆ Collect and upgrade your gear: from common to legendary<br/>◆ Forge epic armors, jewelry, magic swords and much more<br/>◆ Explore dungeons and locations to find treasures and gems<br/>◆ Join a guild to chat and fight bosses together<br/>◆ Fight in epic guild wars and get rewards for guild ranking<br/><br/>Embark on an adventure quest to fight and defeat the ultimate boss - the Shadow. Become a legendary hero!<br/><br/>Download Questland RPG game and start your fantasy adventure now!<br/><br/>Get to know Questland: https://www.facebook.com/questlandgame/<br/><br/>DIGITAL SUBSCRIPTIONS<br/>Auto-renewing subscriptions grant you great game benefits.<br/>Following subscription is available:<br/>- \"Basic Monthly Contract\" subscription per 1 month.<br/>Payment will be charged to your iTunes Account at confirmation of purchase. Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period. Account will be charged for renewal within 24-hours prior to the end of the current period, and identify the cost of the renewal. Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's Account Settings after purchase.<br/><br/>Privacy Policy:<br/>http://gamesture.com/gamesture-privacy-policy.pdf<br/><br/>Terms of Service:<br/>http://gamesture.com/gamesture-terms-and-conditions.pdf", "metacritic": null, "released": "2017-08-29", "tba": false, "updated": "2021-01-25T05:57:36", "background_image": "https://media.rawg.io/media/screenshots/2f9/2f9c5b7f1d65cde2da436601b8a4a080_RXpo2lS.jpg", "website": "https://www.facebook.com/questlandgame/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 320, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Gamesture"], "genres": ["RPG", "Strategy"], "publishers": ["Gamesture"], "esrb_rating": "Teen"}