{"id": 546816, "slug": "coloring-book-paint-by-number-2", "name": "Coloring Book: Paint by number", "name_original": "Coloring Book: Paint by number", "description": "Beautiful pictures！Color your favorite pictures in Coloring Book!<br/>Painting must be one of the best relaxing ways to relieve stress. Choose your favorite picture and finish your masterpiece by numbers easily! Release stress while enjoying beautiful pictures!<br/><br/>Up to 5000 pictures are free and update many beautiful pictures every day. In Coloring book we have more than 20 categories, offers you amazing coloring artworks, such as:<br/>——Fashion Girls: We have depicted beautiful and trendy girls from all over the world;<br/>——Landscape: In our coloring book gallery, there are various wonderful landscapes and buildings;<br/>——Animals: Choose your favorite animal for coloring;<br/>——Life: We collected scenes from all corners of our lives to make paintings for everyone to color;<br/>——Flowers: All kinds of beautiful flowers are waiting for you to paint;<br/><br/>In addition, there are various collections of stories waiting for you to explore, and various styles of painters are waiting for you to enjoy.<br/>Coloring and share your favorite artworks on Facebook and Instagram with friends and family so that everyone can see your beautiful artworks！<br/>Coloring Book is here for you, try our Coloring Book, discover the beauty of the world and life!<br/>Facebook page:https://www.facebook.com/ColoringBookFanpage<br/><br/>===== Coloring Book Plus Subscription<br/>- With Coloring Book Plus Subscription you can subscribe for daily new picture updates and unlimited access to all features.<br/>- Payment will be charged to iTunes Account at confirmation of purchase.<br/>- Subscription automatically renews for the same price and duration period as the original \"one week\"/\"one month\"/\"one year\" package unless auto-renew is turned off at least 24-hours before the end of the current period.<br/>- Account will be charged for renewal within 24-hours prior to the end of the current period at the cost of the chosen package (weekly, monthly or yearly package).<br/>- Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's iTunes Account Settings after purchase.<br/>- You may cancel a subscription during its free trial period via the subscription setting through your iTunes account. This must be done 24 hours before the end of the subscription period to avoid being charged. Please visit http://support.apple.com/kb/ht4098 for more information.<br/>- Any unused portion of a free-trial period, will be forfeited when the user purchases a Coloring Book Plus Subscription.<br/><br/>===== Terms of Service and Privacy Policy<br/>Privacy Policy: https://s3-us-west-2.amazonaws.com/co.colorbynumber/privacy-policy/index.html<br/>Terms of Use: https://s3-us-west-2.amazonaws.com/co.colorbynumber/terms/index.html", "metacritic": null, "released": "2020-12-28", "tba": false, "updated": "2021-01-25T05:21:39", "background_image": "https://media.rawg.io/media/screenshots/18d/18dfc270eef6fce31265323a9beaa974.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 203, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tiyao Game Co.Ltd"], "genres": ["Board Games", "Puzzle"], "publishers": ["Tiyao Game Co.Ltd"], "esrb_rating": "Everyone 10+"}