{"id": 546847, "slug": "chaos-academy", "name": "Chaos Academy", "name_original": "Chaos Academy", "description": "A hundred billion years ago, the two forces of Order and Chaos took form in the universe, engaging in a never-ending cycle in which one engulfed the other, only to be reborn once more.<br/><br/>Eventually, Order and Chaos were finally awakened to the futile nature of their ways and agreed to work towards mutual, sustainable development.<br/><br/>Upon the birth of a new civilization, Order and Chaos agreed that they would not enter the human world in their true form and worked together to seal off the plane where humans resided, preventing them from breaking their deal. But under the terms of the agreement, Chaos and Order could use the “Emperors” they created to influence the human world.<br/><br/>The emperors existed somewhere between supernatural and human world, having obtained eternal life. A period of harmonious coexistence was established between humans, gods, and demons, which lasted for tens of thousands of years. During that time, gods and demons granted humans favors and grace, humans offered them the power of faith in return. This complementary system formed a seemingly perfect circle.<br/><br/>But as humans excessively developed technology, they soon forgot about the gods above and demons below. Without the power of faith, their power waned. And the emperors, they gradually lost the power that was bestowed upon them by Chaos and Order.<br/><br/>As the power of the gods wanes, the existence of Chaos and Order has become fuzzy and unclear. The emperors who represent these two great forces know that if this continues, Chaos and Order will eventually disappear completely. Faith and the supernatural world will be gone, causing the universe to collapse.<br/><br/>Thus, the emperors have joined forces, creating an organization called - The Old Order. The Old Order consists of members from the highest levels of powerful organizations from around the world. After choosing emperors from amidst these organizations, they gathered together and used modern technology to create a man-made island that they call Chaos Academy. There, they attempt to revive the religions of mankind in the hopes of increasing the power of gods and demons.<br/><br/>The emperors summoned those humans with special ties to the supernatural to the Academy (hero cards) to act as vessels for demonic and godly power, hoping that constant battle within the Academy will increase the holy powers, thereby maintaining balance between humans and the supernatural world.<br/><br/>Thus, the gods and demons worship Chaos and Order with reverence, while the selfish emperors have their own thoughts, battling within the Academy for their continued existence and that of their respective religion...", "metacritic": null, "released": "2021-01-20", "tba": false, "updated": "2021-01-25T05:34:56", "background_image": "https://media.rawg.io/media/screenshots/7db/7dbc8bb62a3dc214842135d8d3758c29_DiNY4YF.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 196, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["chengdu longyuan Network Technology Co"], "genres": ["Strategy", "Card"], "publishers": ["chengdu longyuan Network Technology Co"], "esrb_rating": "Teen"}