{"id": 546897, "slug": "blackjack-trainer-21", "name": "BlackJack Trainer 21", "name_original": "BlackJack Trainer 21", "description": "Learn how to play BlackJack, when to Hit, Stand, Split, Double or Surrender. This application will teach you the game of BlackJack and how to play any hand, such that you maximize your chance of winning. <br/><br/>BlackJack Trainer Features: <br/>* Hit, Stand, Split, Double or Surrender to the cards dealt <br/>* Get feedback on your decision <br/>* See the basic strategy table for the selected house rules <br/>* Learn to play like a professional <br/><br/>Think of it as a school to become better at BlackJack.<br/><br/>This is NOT a blackjack game, but an application that teaches you the right play.<br/>This application will NOT teach you how to count cards in a casino or uses any kind of fictional or real money.<br/><br/>Reviews/Comments:<br/>* * * * * Very impressive. This really helped with all those hands at the casino that i always left up to chance. This app actually teaches you how to make money.<br/>* * * * *  Highly Recommend. This is great training tool for anyone interested in learning blackjack. BlackJack Trainer Rocks!<br/>* * * * * Great for learning corner cases. Finally, I remember when to double or surrender. Love the strategy table in my pocket ;)<br/><br/>Your membership starts as soon as you set up payment and subscribe with iTunes. Your monthly charge will occur on the last day of the current billing period. We'll renew your membership for you (unless auto-renew is turned off 24 hours before the end of your billing cycle). You can manage and cancel your subscription by going to your account settings on the App Store. By continuing, you are agreeing to these terms (https://hornetventures.com/tou.html). See the privacy statement (https://hornetventures.com/privacy.html).", "metacritic": null, "released": "2013-02-10", "tba": false, "updated": "2021-01-25T06:02:50", "background_image": "https://media.rawg.io/media/screenshots/c21/c2108f438665b4febd855decdb252f67_wpp78eg.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 50, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Hornet Ventures"], "genres": ["Strategy", "Educational", "Puzzle"], "publishers": ["Hornet Ventures"], "esrb_rating": "Teen"}