{"id": 546829, "slug": "archery-elite-tournament", "name": "Archery Elite - Tournament", "name_original": "Archery Elite - Tournament", "description": "Archery Elite - Tournament is THE most exhilarating and realistic Archery game of 2020!<br/><br/>Play against real people for free or enter into Cash tournaments to win real cash prizes! Practice in free tournaments to hone in your skills, then add some excitement into your game by entering into Cash tournaments. Archery Elite - Tournament guarantees a FAIR game by giving you and your opponent the exact same shooting conditions and targets... only the best will come out ahead. <br/><br/>Are YOU ready to win REAL prizes?<br/><br/>HOW TO PLAY:<br/>- Hold to draw arrow, move finger to aim and release to shoot<br/>- Aim at static and moving targets, but watch out for wind speed/direction<br/>- Score higher points by hitting on or near the target bullseye<br/>- Bonus points will be rewarded for quicker shot taken<br/>- Player with the higher total score across the 6 rounds wins<br/>- Tournament format: 6-round shootout<br/>- Every round will increase in difficulty through moving targets and wind speed<br/><br/>GAME FEATURES:<br/>- Play in live, head-to-head tournaments; compete with other archers from around the world<br/>- Win cash and prizes (where available)<br/>- Play against real players at YOUR skill level; we match your skills so it’s always fair and fun for everyone<br/>- Exciting gameplay and realistic graphics, you won’t want to stop<br/>- Multiple realistic indoor/outdoor scenery and targets<br/>- Multiple tournament levels for every type of player<br/>- Free-to-play, without any annoying ads<br/><br/>If you have any questions about the game, feel free to contact us at support@joyient.zendesk.com<br/><br/>If you have any questions about the Skillz platform please contact: support@skillz.com<br/><br/>We hope you enjoy the game. Have fun!!!", "metacritic": null, "released": "2020-10-27", "tba": false, "updated": "2021-01-25T05:27:13", "background_image": "https://media.rawg.io/media/screenshots/807/807380961d9774ad84a385e89bea5f23_5uVFv0H.jpg", "website": "https://www.crafted.games", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 160, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Crafted Games"], "genres": ["Sports", "Casual"], "publishers": ["Crafted Games"], "esrb_rating": "Mature"}