{"id": 546888, "slug": "eatmeio-hungry-fish-attack", "name": "EatMe.io: Hungry Fish Attack!", "name_original": "EatMe.io: Hungry Fish Attack!", "description": "Attack of the hungry monster fish! Escape terrifying jaws, smash the scores and get rich on ocean coins. The rules are simple - eat or be eaten! Download the fishtastic game for free and enjoy the epic underwater action adventure of feeding on other fish!<br/><br/>Hungry monster fish are everywhere, watch out and attack before they do! Eat other fish to grow bigger - munch or become someone else’s lunch!<br/><br/>Start your piscine odyssey in this fun-filled online multiplayer game as a small fish and eat squishy seaweed to gain mass. But look out! There are bigger fish out there! Escape their attack by splitting or hiding behind stun bombs. <br/><br/>In this addictive multiplayer fish game, the fun begins once you become a bigger fish! Get into a fish eating frenzy and become a monster fish.<br/><br/>EatMe.io is a new innovative fish game where your large appetite gets relieved only by feasting on other fish. Choose between different types of fishes in Eatme.io that have super powers and special skills - Take them out for a kill and enjoy your feeding frenzy. <br/><br/>Play with friends, smash the scores and battle away!<br/><br/>Take on the challenge, play your tactics in this adventure game app:<br/>- Use your coins and unlock new hungry fishes!<br/>- Earn XPs, badges and special skins<br/>- Do you like challenges? Then this is your go-to gamecenter app<br/><br/>Have fishy fun and boost your scores:<br/>- Eat and get rich – collect coins while you eat!<br/>- Beautifully crafted ocean theme graphic &amp; animated fishes<br/>- The secret to the next level up? Play and find out<br/><br/>Experience action in the aquarium:<br/>- Smash the scores and win rare fish bowls <br/>- Multiple couch controls - tap or use the virtual joystick<br/>- Make sure you escape and survive the monster fish attack<br/><br/>Explore an underwater adventure on your screen:<br/>- Daily shops and promotions for rare tanks, unlimited gold &amp; more<br/>- Unlock new fish bowls and fish tanks with shells<br/>- Roll up your sleeves and get your guns out – it’s battle time, just without the missiles!<br/><br/>It’s a smash hit with friends, a fun feeding frenzy in the fish tank:<br/>- Live-multiplayer action<br/>- Invite and battle with friends for shells and other gifts<br/>- Be the creator of your own monster fish experience<br/><br/>Fishing for compliments? Play tournaments and boost your scores:<br/>- Take part in daily tournaments and unlock epic &amp; legendary rewards!<br/>- Play with Friends through Facebook connect/game center <br/>- One coin won’t get you very far. Collect loads of coins like in a gold rush to boost your scores!<br/><br/>Don’t be shellfish – um, selfish – by playing this free addictive multiplayer game alone! Invite your Facebook friends and challenge them to a big battle sof jaws! <br/><br/>Be top of the leaderboard, earn badges and share your scores to let everyone know who the real beast is! <br/><br/>You think Jaws is the ultimate ocean experience? Hungry sharks are a thing of the past, this multiplayer virtual challenge is today’s smash hit. <br/><br/>Download for free now and become a fish monster!", "metacritic": null, "released": "2016-12-07", "tba": false, "updated": "2021-01-25T05:56:19", "background_image": "https://media.rawg.io/media/screenshots/7bf/7bf8830d6bf8e33d242c217476c0e92d_eunSBkr.jpg", "website": "http://eatme.io/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 146, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Junglee Games"], "genres": ["Action", "Strategy"], "publishers": ["Junglee Games"], "esrb_rating": "Everyone 10+"}