{"id": 546874, "slug": "crazy-hedgy-3d-platformer", "name": "Crazy Hedgy - 3D Platformer", "name_original": "Crazy Hedgy - 3D Platformer", "description": "CYBERTIME presents the world's first Beat 'em up 3D Platformer. Check out the trailer: www.crazyhedgy.com<br/><br/>Take yourself on a wild journey and experience the world of Crazy Hedgy! Use your bubble gum to cross yawning abysses, solve riddles, find buried treasures, collect diamonds and learn fantastic new abilities…but don’t let the Spankos get you down!  <br/><br/><br/>RECOGNITION &amp; PRESS COMMENTARIES<br/><br/>\"…well-designed levels, beautiful graphics, and tons of replay value...Crazy Hedgy’s features are endless…\" - apptudes.com<br/><br/>\"Crazy Hedgy is console quality, but uses iOS features to maximum advantage making for a distinct gaming experience\" - 148apps.com<br/><br/>\"Just when you think you have the measure of the proceedings, it lobs in a fresh surprise… your eyebrows will be raised as you experience one quirky feature after another.\" - Gizmodo<br/><br/>\"…Defeating enemies is completely satisfying and the game’s humour can be seen when two enemies bump into each other\" - app-score.com<br/><br/>\"You are not going to want to put it down once you have started.\" - appasnap.com<br/><br/>\"The new Super Mario from Austria\" - derstandard.at<br/><br/>\"Super Mario was yesterday - here comes the platform hero of the new century\" - bzberlin<br/><br/>\"Crazy Hedgy is a must buy for fans of 3D platformers, action games, or fans of console quality experiences on the iOS devices.\" - examiner.com<br/><br/>\"…with Crazy Hedgy we present you the new king of the genre on the App Store.\" ireviewt.com<br/><br/><br/>AWARDS<br/>Best Game of the Year - Content Award <br/>Gaming App of the day - Gizmodo<br/>Mobile Game of the Week - Paste Magazine<br/>TOUCH ARCADE GAME OF THE WEEK - toucharcade.com<br/>Game for the weekend - Gigaom.com<br/>App of the Week Award - fun2tap<br/>MAX SCORE 10/10 - app-score.com<br/>Seal Of Approval 5/5 - iphonegameruk<br/>Editor's Choice Award - 148apps.com<br/>Editor's Choice Award - apptudes.com<br/>Must-Have-Award - ireviewt.com<br/>Must-Have-Award - iplayapps.de <br/>Silver Award - pocketgamer.co.uk<br/>3/4 - slidetoplay<br/>80/100 - 4players.de<br/>featured by Apple in \"new and noteworthy\" worldwide<br/>featured on the App Store \"Best Platformers\"<br/><br/><br/>INTUITIVE CONTROL SYSTEM<br/>Jumping, capturing, bashing, direction-controlled punching and shooting – and all with a simple swipe of your finger!<br/><br/><br/>HIGHLIGHTS<br/>- level of detail engine - from iPhone 4 to iPhone 6 and full retina display support with special vfx<br/>- more than 10 hours of action-packed fun in 35+ levels<br/>- dynamic 3D world<br/>- action-filled punch-ups against fun characters<br/>- complex enemy AI, with a strong dash of humor <br/>- boss fights <br/>- real physics<br/>- lots integrated in game specials (response-, dexterity- , speed up- and tilt passages)<br/>- solve 38 achievements<br/>- facebook friends highscore table to compete and play with friends<br/><br/><br/>UPGRADE SYSTEM<br/>- learn the latest assault techniques, like Grab Attack, Slide Attack, Upper Cut and Power Slam<br/>- magnets help you collect more diamonds<br/>- get new features through various helmet upgrades<br/>- turn your bubble gum into ballistics<br/>- a variety of fighting gloves put power in your punch<br/>- many other cool items<br/><br/><br/>iOS FEATURES<br/>- iPhone 6, iPhone 6 Plus, iPad mini, air and 4th gen optimized graphic engine<br/>- iOS 8 optimizations<br/>- retina display support<br/>- iCloud support<br/><br/>Music by \"Sound of Games\"", "metacritic": null, "released": "2011-12-20", "tba": false, "updated": "2021-01-25T05:48:01", "background_image": "https://media.rawg.io/media/screenshots/83a/83aecfe6578fe430e7b25800dc015e51_AzvxmH8.jpg", "website": "http://www.crazyhedgy.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 188, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["cybertime"], "genres": ["Action", "Adventure"], "publishers": ["cybertime"], "esrb_rating": "Everyone 10+"}