{"id": 546921, "slug": "hotel-fever-doorman-mania", "name": "Hotel Fever: Doorman Mania", "name_original": "Hotel Fever: Doorman Mania", "description": "Become the hotel &amp; cooking tycoon you always dream to be! Dash into Hotel Fever, enjoy grand hotel mania &amp; cooking fever, show people your doorman story. Now team up your staff, run more luxury hotels in this hotel city, cook like you are a Crazy Chef. This highly addictive time-management game will bring you hotel &amp; restaurant experience.<br/><br/>Welcome to the hotel city - a place where travelers all over the world loves to take a vacation in. Now it's time to show your inner hotel manager talent. Get yourself into this real hotel &amp; cooking frenzy life; Prepare, cook and serve delicious meals. It has the same hotel system. Car rental services, Catering services, Room service (24-hour)... Fully simulate the real hotel service process. <br/><br/>Different levels have the unique goals, you will never feel bored in this game. Dash from different hotels to another, feel all kinds of hotel culture around the world. There is not only an intense and exciting pace of work, but also a relaxing and comfortable time. It is the best way to enjoy the wonderful and exciting hotel life. <br/><br/>Want to upgrade your motel to the five star luxury hotel? Want to expand your hotel land all over the world? This game can satisfy all your fantasies. Operate your teams and show the best hotel service to all the guests, you will earn more and more coins and recognition. Now it is time to transform your modest installations into a five-star resort. Use coins to upgrade rooms and equipment to make your guests more happy. The better your hotels are, the more money you could earn. You could open your hotel everywhere all over the world. The next hotel tycoon will be you!<br/><br/>Don't forget we also have booster system to help beat the hard time! If you feel so intense in levels, just use the boost. It could make you run like a flash, cook like the cooking master! Your guests' patience runs out? Don't worry! The booster could also bring their patience back, make them smile all the time. With the boosters, you must be the best hotel &amp; cooking master. <br/><br/>Hotel Fever is just a real small world makes you feel excited and relaxed. Are you ready to create your own hotel empire? All can come true here! Write your own name in this hotel story book, more mystery waits for you to find out!", "metacritic": null, "released": "2020-12-21", "tba": false, "updated": "2021-01-25T06:13:30", "background_image": "https://media.rawg.io/media/screenshots/6f3/6f356d75fdad7f4cabf61ee1eeee7951_1WAWYyw.jpg", "website": "https://www.kingdomjoygames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 207, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Digital Kingdom PTE.LTD."], "genres": ["Strategy", "Simulation"], "publishers": ["DIGITAL KINGDOM PTE"], "esrb_rating": "Everyone 10+"}