{"id": 546920, "slug": "asteronium-idle-space-tycoon", "name": "Asteronium: Idle Space Tycoon", "name_original": "Asteronium: Idle Space Tycoon", "description": "Build your industrial space station and become an idle miner tycoon by managing resources and energy in the most addictive clicker simulation game. Construct new buildings around the asteroid, upgrade your space colony, and continue mining on spaceships. Manage your stellar industry, foster business and generate enormous profit exploring new technologies. Gain energy, boost your production and observe the evolution of your space idle world. You can even change the appearance of your planet station.<br/><br/>GAME FEATURES:<br/>- Create astronauts to mine a valuable resource Asteronium<br/>- Build dozens of energy factories and warehouses for storing Asteronium<br/>- Sell the Asteronium resource yourself or entrust it to space drones<br/>- Explore new technologies and improve existing ones<br/>- Construct a spaceport to process asteroid ore into Asteronium<br/>- Buy rockets and spaceships to mine ore at the asteroid<br/>- Clean the station plants from space junk<br/>- Upgrade all technologies and build the thriving empire<br/>- Choose the development strategy of your civilization<br/>- Play when you have time, the gameplay will not interrupt<br/>- Get super bonuses on every new visit of the game and simulate progress<br/>- Choose what is best to build at the moment, which energy resource do you need more<br/>- Play offline, no internet needed unlike most evolution games<br/> <br/>STORY:<br/>Scientists and miners have discovered the new asteroid somewhere in space. The astronauts took an ore sample and sent it to Earth. So the world has invented the most valuable energy resource of all time – Asteronium. Asteronium contains as much energy as no other chemical element. Earthlings were able to fixate the asteroid somewhere between the Earth and Mars. After that, hundreds of aspiring enthusiasts went to build their business in a distant civilization on their rockets.<br/> <br/>Start your own business and earn money from your colony! Explore new technologies and build new buildings for mining Asteronium, sell energy, and manage the infrastructure of the station. Buy new sites for your business. Become the best manager tycoon in the entire galaxy. Earn more and more<br/><br/>Play the most exciting tycoon simulator whenever you can, gameplay continues even when the phone is off. Ready to play? Start your energy business, make money, and act as a real manager in your idle world!<br/><br/>Follow Asteronium on Instagram<br/>https://www.instagram.com/asteronium_game", "metacritic": null, "released": "2020-12-12", "tba": false, "updated": "2021-01-25T06:13:06", "background_image": "https://media.rawg.io/media/screenshots/93d/93d43286df9fdd0f52dd1c4e0f83513f.jpg", "website": "https://appquantum.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 178, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["ADQUANTUM"], "genres": ["Strategy", "Simulation"], "publishers": ["ADQUANTUM"], "esrb_rating": "Everyone 10+"}