{"id": 546962, "slug": "greg-a-mathematical-puzzle-game-to-train-your-brai", "name": "GREG - A Mathematical Puzzle Game To Train Your Brain Skills", "name_original": "GREG - A Mathematical Puzzle Game To Train Your Brain Skills", "description": "###<br/>• Apple Best New Games<br/>• #1 Puzzle Game App<br/>• “A puzzle game that will test your speed and math skills, a gameplay mechanic both invigorating and challenging.” - AppAdvice<br/>• “An excellent, fun way to kickstart the grey matter.” - Gamezebo<br/>• “A solid game with nice graphics, good gameplay and a practical learning.” - AppGefahren.de<br/><br/>WHAT OUR USERS SAY<br/>• Polished interface. Mentally beneficial and challenging gameplay. What else do you want?<br/>• Extremely addicting and fun game. Who knew that adding numbers could be so exciting!<br/>• Very fun game and it really helps me with my math skills. One of my favorite downloads.<br/>• If you love numbers, this is for you. If not, you will learn to love numbers!<br/>• In no overstated terms, I'm obsessed with the game. I hate phone games. But GREG is inescapable.<br/>###<br/><br/><br/>Do you think additions are easy?<br/>Challenge yourself and play GREG, a simple mathematical game that will enhance your mental flexibility!<br/>The main purpose of the game is to combine the numbers in the grid to match the given one. The more you go ahead, the more difficult the game will become.<br/><br/><br/>GAMEPLAY<br/>Simple and addictive gameplay, suitable for both quick and long-lasting matches.<br/>The better you play the more points and gold you earn!<br/><br/>ITEMS AND SPELLS<br/>Need some help? Use special items and spells to help you in the game!<br/>You can easily get more items by using the gold you earn within the game.<br/><br/>MULTIPLAYER<br/>Challenge your friends like never before in an innovative multiplayer mode!<br/>Show your friends who is smarter by defeating them in a game where cleverness, reflexes and strategy combine. <br/>Multiplayer is available only on iPhone 4S or newer.<br/><br/>GAME CENTER<br/>Climb the leaderboards and prove you are the best player!<br/>And if you feel good enough try to earn all the 35 engaging and unique achievements.<br/><br/>UNIVERSAL<br/>Enjoy GREG on your iPhone and your iPad too, so you can test your mathematical skills in every moment.<br/><br/>ICLOUD<br/>All your progress and game stats are synced between all your devices, so you don’t have to worry about having different data on your iPhone and your iPad. <br/><br/><br/>SPECIAL NOTES<br/>• Follow @playGREG on Twitter for the latest!<br/>• Have a problem? Want to give us a feedback? Remember: we can't respond to App Store reviews, so email us at greg@marcotorretta.com<br/>• Developed in collaboration with Stefano Figurelli.<br/><br/>Have fun playing GREG!", "metacritic": null, "released": "2014-09-03", "tba": false, "updated": "2021-01-25T06:36:22", "background_image": "https://media.rawg.io/media/screenshots/09e/09e4360be54c0db61c3260345f939fde.jpg", "website": "http://greg.marcotorretta.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 26, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Marco Torretta"], "genres": ["Strategy", "Educational", "Puzzle"], "publishers": ["Marco Torretta"], "esrb_rating": "Everyone 10+"}