{"id": 5469, "slug": "novastrike", "name": "NOVASTRIKE", "name_original": "NOVASTRIKE", "description": "NOVASTRIKE™ is a top-down arcade shooter in which you take control of a prototype advanced Scythe fighter and combat invading Draelus aliens over four different planets. You’ll take on both air and ground opponents ranging from enemy fighters to capital ships and ultimately the end-Boss. As you progress, the Scythe unlocks its full potential through upgrading its weapon systems and overall capabilities.<br/>\n<br/>\r\nFeatures include:<br/>\r\n•\tExpansive Environments: Fight over seven large and challenging stages driven by objective-based goals. <br/>\r\n•\tFree-roaming Flight: There aren’t any rails here, allowing flight in any direction. <br/>\r\n•\tProgressive Weapon Acquisition and Upgrade System: As you successfully collect weapon drop parts from destroyed enemy ships the weapons themselves become available to the Scythe – there are nine base weapon systems, each with three subsequent upgrade levels. <br/>\r\n•\tAir and Ground Targets: Separate weapon systems allow the player to combat both air and ground opponents. <br/>\r\n•\tMulti-Sectioned Capital Ships: Larger enemy capital ships have individual components that can be destroyed; for example, Carriers have hangars that launch fighters – these hangars can be destroyed independently of destroying the Carrier preventing the Carrier from launching additional fighters. <br/>\r\n•\tMultitude of Enemies: The player will combat enemy fighters, bombers, kamikazes, aces, carriers, and destroyers –all culminating in an end-Boss encounter. <br/>\r\n•\tYou’re Not Alone: Friendly fighters, bombers, and destroyers will aid you in your efforts to vanquish the Draelus invasion. <br/>\r\n•\tLeaderboards: Compare your scores against friends and other players online – each difficulty level has its own Leaderboard. <br/>\r\n•\tDUALSHOCK®3 Support: Feel impacts from enemy weapons and the rumble from enemy explosions. <br/>\r\n•\tContinued Support: Tiki Games will be developing additional content for NOVASTRIKE™.<br/>\n<br/>\r\nNOVASTRIKE™ ©2008 Tiki Games, Inc. <br/>\n<br/>\r\nPurchase or use of this item is subject to the PLAYSTATION®Network Terms of Service and User Agreement. This item has been sublicensed to you by Sony Computer Entertainment America.", "metacritic": null, "released": "2008-06-05", "tba": false, "updated": "2019-09-12T06:40:48", "background_image": "https://media.rawg.io/media/screenshots/5a2/5a208d2031b18ee0db065edc3321e10d.jpeg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 37, "beaten": 1, "dropped": 1}, "playtime": 0, "achievements_count": 13, "ratings_count": 1, "suggestions_count": 384, "game_series_count": 0, "reviews_count": 1, "platforms": ["PlayStation 3"], "developers": ["Tiki Games"], "genres": ["Action", "Shooter", "Arcade"], "publishers": [], "esrb_rating": "Everyone 10+"}