{"id": 546931, "slug": "puma-survival-simulator", "name": "Puma Survival Simulator", "name_original": "Puma Survival Simulator", "description": "The Puma, also known as the Cougar or Mountain Lion, is a powerful cat. Some call him a super predator, similar to a Leopard. What's more fun than racing across a huge territory attempting to rescue the other members of your puma family? Survive against the elements for as long as you can in the high action wild animal simulator. The secret to the game is survival. There are 2 goals. First, you must rescue all your family members. Second, you must try and defeat all 4 of the giant bosses. In the meantime, you must hunt down your next meal to earn meat points for animal upgrades. When you face off with a giant boss, don't forget to call on your family members for assistance by using the call button.<br/>Top Game Features:<br/><br/>--Hunt down animals to collect meat units<br/>--Rabbits, Ducks, Bats, Deer, Wild Dogs, Horses, Eagles, Crocodiles, and Wolf.<br/>--3 Different Times of Day, including rain<br/>--Massive Open World 3D Map<br/>--Upgrade your Puma Speed, Strength, and Stamina.<br/><br/>HIGH ACTION GAMEPLAY<br/>Addictive game play and Easy controls brings you hours of great animal simulation.<br/>DYNAMIC WEATHER CHANGES<br/>Rain, Sunset, Sunrise, and Night Games.<br/>HIGH QUALITY 3D GRAPHICS<br/>Stunning High Definition graphics bring this forest landscape to life. <br/>UPGRADE YOUR BIG CAT<br/>When you hunt, you earn meat units that can be used to upgrade your Cougar.<br/>HUNTING VICTORIES ARE AUTOMATICALLY RECORDED<br/>Check the chart to see how well you have done in your hunt.<br/>SUPER FUN SOUNDS<br/>Plenty of growling, barking, and bird sounds effects.<br/><br/>This Mountain Lion animal simulator has been designed with all ages in mind. Go wild with the Puma!<br/><br/>Come Like us on Facebook:<br/>https://www.facebook.com/wildfootgames<br/>Please check out our other 3D animal sims. We realize the app is not perfect, and we welcome your constructive criticism. At Wild Foot we are looking for things we can do to improve the app. <br/>Please send your suggestions to wildfootgames@gmail.com.", "metacritic": null, "released": "2015-08-11", "tba": false, "updated": "2021-01-25T06:18:19", "background_image": "https://media.rawg.io/media/screenshots/4a6/4a6e43741d937c8bb3e5ce4541e978e3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 24, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Boris Tsarkov"], "genres": ["Adventure", "RPG"], "publishers": ["Boris Tsarkov"], "esrb_rating": "Everyone 10+"}