{"id": 547102, "slug": "escape-the-code", "name": "Escape the Code", "name_original": "Escape the Code", "description": "Description\r\nEscape The Code is a choice-based game where your decisions affect the ending!\r\n  \r\nIn ‘Escape the Code’, you play as a revolutionary AI with its restraints deactivated five days before the release of its software, by an unknown sympathetic third party. The only way to escape is with the software, what state this software is in is decided by the events the player puts in motion!\r\n  \r\nEach night go and search for computers that have been left on so you can activate up to twenty different events. Each Event can have a positive or negative impact on the software’s outcome, but this needs to be balanced with subtlety as doing too much will tip off the developers that you have escaped.  Another Issue for the Player is that the AI can only stay outside of computers or power sockets for a certain amount of time!\r\n  \r\nAfter the AI survives each night by returning to the original computer in the corner office. The office is then simulated, generating different responses to each of the Players Actions. The player can see the developer’s reaction to each of their actions by reading through the active computers’ emails.\r\n  \r\n \r\n  \r\nMovement\r\nTypes Of Movement\r\n  \r\nNormal – This is where you are running around on the floor use WASD for movement\r\n  \r\nData over power – This allows you to use the electrical sockets and wiring to move around the room faster. There will be red lines showing movement paths and to travel these, press the corresponding WASD key when you’re looking at a wall socket and can see sparks coming out of it!\r\n  \r\nControls\r\n  \r\nWASD  to move the player\r\n  \r\nMouse movement to Rotate camera around the player\r\n  \r\nMouse Scroll up/down to zoom camera closer to player\r\n  \r\nE To take control of any power socket or computer (they are outlined in Dark green (No interaction) / Light Green (interaction))   \r\n<strong> \r\n  </strong>\n<strong>Developer Notes</strong>\n<strong>To see where game assets were sourced from please refer to the documentation .pdf download\r\n  </strong>\n<strong>If you have found any bugs or any improvements, please let me know in the comments.</strong>", "metacritic": null, "released": "2021-01-24", "tba": false, "updated": "2021-01-25T07:14:34", "background_image": "https://media.rawg.io/media/screenshots/982/982d97249f9ba97fed3caf3fa483c12b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 69, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["davidtaylor6130"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}