{"id": 547103, "slug": "dracula-vs-the-ninja-on-the-moon", "name": "Dracula Vs The Ninja On The Moon (itch)", "name_original": "Dracula Vs The Ninja On The Moon (itch)", "description": "<p>Hi I am Nick I used to make indie horror films I did it for around 15 years and recently made the switch to Game Dev and I have been converting a lot of my old films into FMV Games check out my other titles.</p>\n<p>I have been using Game Jams to help myself become better at making these crazy FMV Games and this entry for the Finally Finish Something Jam 2021 has quite a back story.\r\n  </p>\n<p> So let’s rewind back to 2008 I was at University and we where asked to make a 3 minute film to demonstrate some of the new equipment in the media studio. The task was not to go out and shoot an award winning film or even anything super good just purely a project to explore the new equipment.   </p>\n<p>Back then I used to do all my work with my close friend Marc and we would usually end up let’s say a bit wasted. And would sit up all night watching the worst movies we could find usually bad , horror and B-movies and Godforrey Ho style cut and paste Ninja films we decided to write a script for our own bad movie and we ended up writing a funny  little spoof that was way out of our league for our little class project to make a 3 minute film, we wrote a 45 page script.\r\n  </p>\n<p>We realised it was not appropriate for the project but had our hearts set on shooting it anywhere and because we had little time and not enough money or resources we would set out to make the worst thing we could possibly make but at least have 3 good minutes worth for our project.\r\n  </p>\n<p>What we ended up shooting turned out to be pretty good but to rush it out in time for the project and the end of term we purposely made it even worse in post Bad Dubbing Bad green screen it was a 45minute long mess.   </p>\n<p>But our Booze and weed filled Heads thought it was the funniest thing ever, we gave out DVD-r copies to friends and within a few weeks it was forgotten about or so we thought.\r\n  </p>\n<p>One night we where out drinking and some random student came up to us and started talking about the film saying they had seen it in someone flat on campus whilst drinking one night. Soon we discovered that this was happening a lot people where going out getting messed up then going back to places to laugh at our silly film.\r\n  </p>\n<p>We where then asked to screen it in a few bars eventually it died off we got on with the rest of Uni and I personally made lots more films and when I graduated spent a few years travelling promoting my films and winning awards.\r\n  </p>\n<p>The Next time Dracula Vs the Ninja came up was in 2011 at this point I had already released more movies and had a bit of success with them on DVD a friend asked to see all my films and wanted to watch this as he had heard about it. I watched and cringed he laughed his ass off and that night I decided to clean it up a bit and release a colour version on DVD and VHS as a limited run which sold out.   </p>\n<p>And I closed the door on the film as the years went on I tried to hide it as I was actually a little embarrassed by it after the success of some of my other films.\r\n  </p>\n<p>Id occasionally release a few more copies here and there but it was rare as I really wasn’t fond of it.\r\n  </p>\n<p>Then in November 2020 something really strange happened I woke up on a Saturday morning to loads of tweets and facebook messages and lots of traffic on my youtube basically James Rolfe the Angry Video Game Nerd had unintentionally plugged the film. He made a joke film up for the video called NINJAS ON THE MOON and asked people to search for it. It didn’t exist but Dracula Vs The Ninja on the moon did exist  so people flocked to it people asked where it could be purchased so I quickly stuck it back on sale. I also reached out to James and he gave me all the artwork they used in the show so I can make a rebranded version limited to just 30 copies and I sold just 2 copies haha. (Available here if your interested https://gogrindhouse.storenvy.com/products/31267666-ninjas-on-the-moon-limited-t...)</p>\n<p>By this point I was well into my Game Dev journey turning a lot of my old films and footage into  FMV games and usually this is fairly straightforward I use all the raw footage including unused stuff from the original films I usually have a lot to play with.\r\n  </p>\n<p>But Dracula Vs The Ninja was shot on Mini DV and whilst I still have the tapes I have no way to transfer footage at the moment and as it stood this was the only film I would not be able to turn into a game.\r\n  </p>\n<p>I was scrolling through the Jams on Itch and found the Finally Finish Something Jam and I took this as a cue to finally finish DRACULA VS THE NINJA ON THE MOON and close the book forever.\r\n  </p>\n<p>But without the original files it would be tricky.\r\n  </p>\n<p>I worked out a way to Game-Ify it just using the 2011 cut of the film I chopped it down into scenes and created what only can be described as a VHS VCR TRACKING SIMULATOR the game is fairly simple it plays the movie in it’s entirety (about 30mins for this cut) and in between each scene you have to adjust the tracking with you goal being to watch the film completely at the best possible quality. You can Track Forward or Back choosing the incorrect option will make the tape quality worse.\r\n  </p>\n<p>It’s a strange quirky little game that actually works better than I thought and does add some more appeal to this strange little film we created 12/13 years ago.\r\n  </p>\n<p>Please check out my other titles here on Itch.io my latest is Flesh Eating Geriatric Internet Predator which is particularly bonkers and Sinister Vibrations which was banned from Steam.\r\n  </p>\n<p>I put out games monthly on Itch and Steam please consider joining my Patreon for monthly keys and exclusive games only available to Patreon members as they feature Live Action Violence, Nudity, and Sex sometimes.</p>\n<p>Twitter: @NickFmvDev</p>\n<p>Patreon: https://www.patreon.com/letsgotothegrindhouse </p>\n<p>Itch.io: https://lets-go-to-the-grindhouse.itch.io/ </p>\n<p>Steam: https://store.steampowered.com/curator/38977034 </p>\n<p>Twitch: https://www.twitch.tv/letsgotothegrindhouse\r\n</p>\n<p>Youtube: https://www.youtube.com/user/dislexsicknik</p>", "metacritic": null, "released": "2021-01-24", "tba": false, "updated": "2021-01-25T07:14:56", "background_image": "https://media.rawg.io/media/screenshots/ccc/ccc7e9c29e05c334b6a78e9a835daa1d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 135, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Lets go to the grindhouse"], "genres": [], "publishers": [], "esrb_rating": null}