{"id": 547218, "slug": "apollo-red", "name": "Apollo Red", "name_original": "Apollo Red", "description": "<p>The great sage and seer Ogun has peaked into the future and in his great disappearance, a final message to the so-called Eternals of the cosmos; \"For the end of days is finally upon us, the end of all things that there ever was, and all things that will ever be, for a great void spreads across the cosmos, in its wake, a trail of death and destruction. What faith lies for us beings who have never known death? Where do we  Eternals go when we die ? \" </p>\n<p>Young acolyte, a final task for you. Journey to the center of the cosmos, deliver a final message, pass on our legacy.</p>\n<p>Controls::</p>\n<p>Only Mouse and Keyboard Supported at the moment.</p>\n<ul><li>WASD | Movement</li><li>Left Mouse Button | Shoot</li><li>Right Mouse Button | Dodge Roll</li><li>Q | Block</li><li>Z | Melee Attack</li><li>X | Interact</li><li>C | Fire Secondary</li><li>Numpad 1 | Melee Skill 1</li><li>Numpad 2 | Gun Skill 1</li><li>Numpad 3 | Melee Skill 2</li><li>Numpad 4 | Gun Skill 2</li></ul>\n<p>Apollo Red is one of the many video game prototype projects catching dust on my computer. It's an unfinished buggy mess, practically unplayable and there I say it, barely stable.  It was intended to be a small project to learn 3D game development in Unity. I can't really call it a complete 'video game', if anything, it's more like an early game concept. It's just a collection of ideas splattered all over Unity in no coherent order, with me trying to make sense of it all.  Give it a try, be gentle and tell me what you think, all constructive feedback is welcome.</p>", "metacritic": null, "released": "2021-01-24", "tba": false, "updated": "2021-01-25T07:39:27", "background_image": "https://media.rawg.io/media/screenshots/f46/f4666b88e73eb7264ba67f36c36eaad8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 109, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Apollo Black"], "genres": ["Action"], "publishers": [], "esrb_rating": null}