{"id": 54739, "slug": "sega-swirl", "name": "Sega Swirl", "name_original": "Sega Swirl", "description": "<p>Sega Swirl is a puzzle game that was created for the Dreamcast, Personal computer, and Palm OS. The game was included in various demo discs released for the Dreamcast (through the Official Dreamcast Magazine (UK) and Official Dreamcast Magazine (US) magazines, and on newly released consoles), and is free to download and play on the PC.</p>\n<p>Sega Swirl was created by Scott Hawkins, while he worked at Sega. Scott Hawkins designed the game and programmed the original PC version of the game. Scott Hawkins worked with Tremor Entertainment to develop the Dreamcast version of the game.</p>\n<p>The game presented swirls of different colors stacked upon each other. The player would try to match up as many of the same colored swirls onscreen as possible, then, when satisfied with a combo, they would press the color, making them disappear. The more swirls one can gather together, the more points earned, as well as a reward of seeing the swirls disappear in different ways. The most rewarding way to see the swirls disappear is when they all go into the air and burst with firework-like sounds and cheers. If a swirl of a certain color is alone within a stack of other colored swirls, the player actually loses points.</p>\n<p>The Dreamcast version featured a snake in the bottom right corner of the screen, who would act pleased when the player did well and shook his head when they did poorly. If the player did nothing for an extended length of time, the snake would stare at them and then gesture to the left, towards the play field.</p>\n<p>On the Dreamcast, it could be played on Versus mode (players compete with one Swirl screen) with up to four players, an Email mode (if you used the Dreamcast Modem), and it also allowed Split Screen (four players with their own swirl play fields). On the PC, split screen is not available, and versus is up to two players. Both versions allowed one to compete with another human player via email (Dreamcast players may also play against PC players through this).</p>\n<p>The Palm version of Sega Swirl includes a two player head-to-head mode that can be played in real-time over the handheld's infrared port.</p>", "metacritic": null, "released": null, "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/d57/d57b4925c8258ea89eede983529d1f5c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 110, "game_series_count": 0, "reviews_count": 0, "platforms": ["Dreamcast", "PC"], "developers": [], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}