{"id": 54742, "slug": "shenmue-ii-2001", "name": "Shenmue II", "name_original": "Shenmue II", "description": "<p>Shenmue II is an action-adventure game developed by Sega AM2 and published by Sega for the Dreamcast in 2001. It was directed, produced and written by Yu Suzuki. Like the original Shenmue, Shenmue II consists of open-world environments interspersed with brawler battles and quick time events. It features a day-and-night system, variable weather effects, non-player characters with daily schedules, and various minigames. The player controls the teenage martial artist Ryo Hazuki as he arrives in Hong Kong in 1987 in pursuit of his father&#39;s killer. His journey takes him to Kowloon and the mountains of Guilin, where he meets a young woman who is part of his destiny.<br />\nSome of Shenmue II was developed alongside the original Shenmue, which was the most expensive video game ever developed at the time. The Dreamcast version was only released in Japan and Europe; Microsoft secured console exclusivity in North America for Shenmue II, and released an enhanced port for the Xbox console in 2002 and other territories in 2003.<br />\nThe Dreamcast version of Shenmue II received positive reviews, but reviews for the Xbox port were mixed; it has since appeared in several &quot;greatest video games of all time&quot; lists. Shenmue II sold poorly and further games in the series entered a period of development hell lasting over a decade. In 2015, Suzuki and his company Ys Net began developing Shenmue III for Windows and PlayStation 4 following a successful crowdfunding campaign.</p>", "metacritic": 88, "released": "2001-09-06", "tba": false, "updated": "2024-01-02T18:55:57", "background_image": "https://media.rawg.io/media/games/a7f/a7f16e3ab0fae21f7a6ecb78bf3964af.jpg", "website": "", "rating": 4.32, "rating_top": 5, "added_by_status": {"yet": 23, "owned": 67, "beaten": 48, "toplay": 31, "dropped": 19, "playing": 4}, "playtime": 0, "achievements_count": 54, "ratings_count": 57, "suggestions_count": 421, "game_series_count": 2, "reviews_count": 57, "platforms": ["Xbox", "Dreamcast"], "developers": ["SEGA"], "genres": ["Action", "Adventure", "RPG"], "publishers": ["Microsoft Studios", "SEGA"], "esrb_rating": "Teen"}