{"id": 547707, "slug": "frenvania", "name": "FrenVania", "name_original": "FrenVania", "description": "<p>A non-official fangame featuring Vinesauce Joel's mascot, VargFren!<br/></p>\n<p>Dracula's back from the dead again, and only Fren can stop him! Is he the right hero for the job? Maybe not, but at least he's enjoying it!<br/></p>\n<ul><li>Whip, fly and inhale  your way through 6 exciting, hard-as-nails worlds!</li><li>Every enemy is a powerup - spit enemies back out at each other for devastating combo attacks, or steal their powers to turn the tables!</li><li>Precision platforming isn't an issue when you can fly! ...but anti-air enemies might be a problem.</li><li>Memes and injokes have been kept to a minimum! The game can be enjoyed even if you have no idea who any of these characters are!</li><li>Super difficult, NES-era platforming that really tests your skills! Unlike a lot of contemporary games, you've got infinite continues, and there's also an easy mode if you just can't handle the pressure.</li></ul><p>This thing is like 10 years old at this point so there might be bugs! UwU<br/></p>\r\nHow to Play\r\n\n<ul><li>Z: Jump</li><li>X: Whip attack / spit out inhaled enemy</li><li>C: Use special skill (inhales enemies if you don't have a special skill)<ul><li>Special skills use energy, keep an eye on the energy meter!</li></ul></li><li>Arrow keys: move<ul><li>Down arrow: swallow an inhaled enemy, absorbs its special skill</li><li>Up arrow: fly</li></ul></li></ul>\r\nTips\r\n<ul><li>100 Fren Points (the F symbols) give you an extra life. You also get one every 50,000 score points.</li><li>Collecting Fren Points and whipping enemies refill energy used for special skills.</li><li>You can inhale food and other powerups, not just enemies!</li><li>Spitting out an inhaled enemy does a lot of damage!</li><li>The whip is slow, but it can hit behind, above and below you!</li><li>The easy mode exists for a reason :)</li></ul>", "metacritic": null, "released": "2021-01-23", "tba": false, "updated": "2021-01-25T09:40:49", "background_image": "https://media.rawg.io/media/screenshots/41f/41fc3371fe9b1d5b900871b87bad5ef2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 158, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Yal"], "genres": ["Action", "Platformer"], "publishers": [], "esrb_rating": null}