{"id": 548055, "slug": "dungeons-cocks", "name": "Dungeons & Cocks", "name_original": "Dungeons & Cocks", "description": "<strong>Dungeons &amp; Cocks</strong> (Dungeons and Roosters, if you mind the official name) is a third-person adventure game that combines the features of good old three-dimensional platformers and ancient adventure games with shooting, puzzles, riddles and stealth mode (low-poly Lara is the closest comparasant).<br/>The plot of the game is dedicated to the life story of Matthew Delaney, an elderly Bon vivant who was forced to leave his country, after it had been captured and ravaged by the geese. Accomanied by his loyal friends: the goose merchant , the young pimp and a Conquistador the Bear, he reaches the shores of the New World, where he was going to sell the goods he had obtained with difficulty in previous wanderings. But the unknown land does not welcome old Delaney as warmly as he planned...<br/><br/><strong><h3>Features</h3></strong><br/><ul><li> Plunge you into the atmosphere of old adventure games and 3-D platformers;<br/></li><li> Combine different game mechanics: Stealth, platform, puzzle, melee and shooting combat system;<br/></li><li> Enjoy deeply developed world and culture of the Cocks. The prototypes are taken from the cultures of the Mayas, Incas and other Central American natives.<br/></li><li> Explore about thirty well developed levels in 5 different zones;<br/></li><li> Dungeons &amp; Cocks is a paradise for those who like to collect achievements and search for secrets.<br/></li><li> Luxirate latent, implicit, deeply encrypted neofreidism: coks, flying geese, cacti of unprecedented shapes and worship of black holes and red giants.</li></ul>", "metacritic": null, "released": "2021-01-27", "tba": false, "updated": "2021-01-29T02:40:26", "background_image": "https://media.rawg.io/media/screenshots/971/9716bdd23ac348bc78c2096b740cb4e4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 255, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["The Bratans"], "genres": ["Action", "Adventure", "RPG", "Casual", "Indie"], "publishers": ["the Bratans"], "esrb_rating": null}