{"id": 548070, "slug": "dasher-3", "name": "Dasher", "name_original": "Dasher", "description": "<strong>Hello, and welcome to Dasher. My name is Doctor Moonbad, and I'm not really a doctor.</strong><br/>Dasher is a short game entirely focused on collisions and mechanical reflections. You must use your dashing abilities to destroy and dismantle your enemies, by reflecting on walls or on the enemies themselves. <br/><br/><strong>How to win</strong><br/>Your goal is to survive long enough to discover an exit, and eventually escape the robotic coliseum. As time passes, the number of enemies increases, as well as their overall intelligence, which makes searching for the exit harder and harder for each second that passes. <br/><br/><strong>Death is only the begining</strong><br/>No matter how many times you die, you can always retry, although you might as well consider upgrading yourself, both physically and aesthetically. Each time you destroy an enemy, you acquire its bits, which Dasher can use to become stronger, or uselessly prettier.<br/><br/><strong>Controls</strong><br/>Every move's made by clicking and dragging. Left-Clicking anywhere on the screen creates a pivot point. The cursor's position to that point determinate the direction for Dasher to move, but only while you hold the left mouse button. Releasing it causes Dasher to dash to the last direction it was moving along. In simpler terms, always aim for where Dasher currently is, and drag to where you want it to go.", "metacritic": null, "released": "2021-01-25", "tba": false, "updated": "2021-01-29T02:51:52", "background_image": "https://media.rawg.io/media/screenshots/35f/35fc6130b471e27ffdb47818c3dd3457.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 56, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Doctor Moonbad"], "genres": ["Action", "Simulation", "Casual", "Indie"], "publishers": ["Moonbad Games"], "esrb_rating": null}