{"id": 54805, "slug": "the-black-onyx", "name": "The Black Onyx", "name_original": "The Black Onyx", "description": "<p>The Black Onyx (ザ・ブラックオニキス, Za Burakku Onikisu) is a 1984 role-playing video game released in Japan, developed by Bullet-Proof Software, with development led by Henk Rogers. It was one of the first successful Japanese-language RPGs, having sold 150,000 copies, and helped familiarize the Japanese public with RPGs. It was originally released for the NEC PC-8801, and ported to several other platforms. The Famicom version featured completely redesigned gameplay, a new map, and was retitled Super Black Onyx (スーパーブラックオニキス). The Game Boy Color port was developed by Atelier Double and published by Taito. The Game Boy Color port added enhanced visuals and included an option to play through the game with the original game's visual style.</p>\n<p>Because of memory limitations, another part of the game was released separately on some platforms as The Fire Crystal (ザ・ファイアクリスタル) (which added a magic system). Two other parts were announced, The Moonstone (ザ・ムーンストーン) (which allowed the party to explore the wilderness), and Arena (アリーナ) (which allowed the party to take part in Arena battles).</p>\n<p>The SG-1000 version was one of the last official releases for that console, succeeded only by Portrait of Loretta. An English-language fan-translation was made available for the SG-1000 version by back-porting from the abandoned source files for a similar hobby conversion project for the ColecoVision system. A group called Team Pixelboy then later on used those same source files to complete their project and released an unofficial English-language ColecoVision game in 2013.</p>", "metacritic": null, "released": "1984-01-01", "tba": false, "updated": "2019-08-28T22:01:22", "background_image": "https://media.rawg.io/media/screenshots/ac8/ac8336b4ce617c68e2eb08d2b375298c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "beaten": 2, "toplay": 3, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 192, "game_series_count": 0, "reviews_count": 1, "platforms": ["Game Boy Color", "NES"], "developers": ["Bullet-Proof Software", "Henk Rogers"], "genres": ["RPG"], "publishers": ["Bullet-Proof Software", "Blue Planet Software"], "esrb_rating": null}