{"id": 548160, "slug": "wobbledogs", "name": "Wobbledogs", "name_original": "Wobbledogs", "description": "<p>Wobbledogs is a 3D pet simulation where you raise your own personal hive of rapidly mutating dogs, physically simulated all the way down to their guts! It’s a casual and chill sandbox experience for players of all ages who want to care for their very own virtual pets in a surprising, unique, and stress-free environment. The dogs start out relatively normal, but mutate and behave in surprising ways as the game progresses and their evolutionary lines advance.<br />\nDogs have highly variable bodies controlled by a simulated genetics system. As they age, they periodically enter a pupal state and physically mutate. The foods they eat fill their guts with different flora, just like in the gif above. These flora influence the dogs&#39; mutations, letting you craft and mold them to fit your own idea of canine (im)perfection!<br />\nDogs need a place to call home, and it’s up to you to create an appealing habitat to help them thrive. As you play, you&#39;ll gain access to more and more objects and decorations. String together rooms and decorate them however you’d like. Give your dogs a relaxing place to sleep, set up an maze, or even cultivate a garden. There are no built-in goals, so you can prioritize whatever you like the most!<br />\nThe dogs in this game are physically simulated, which adds a layer of uniqueness to almost every action they take. Two dogs with separate body structures will experience the world in different ways. They also have unique personality traits that influence the types of behaviors they tend to run and govern how they interact with other dogs and objects.<br />\nWobbledogs is meant to be enjoyable simply to passively observe, but it’s also rewarding to interact with the dogs directly, whether that’s petting them to relieve some stress, tossing a pup around to watch it tumble through the pen, or helping your canine companion get free after it wriggled itself into a particularly tight space. These dogs try their best, but sometimes they need a bit of extra help!</p>", "metacritic": null, "released": "2022-03-15", "tba": false, "updated": "2023-08-09T18:28:34", "background_image": "https://media.rawg.io/media/games/16a/16afbaf470a04f16c9c7a314ed2e79d9.jpg", "website": "http://www.wobbledogs.com/", "rating": 4.2, "rating_top": 5, "added_by_status": {"yet": 2, "owned": 61, "beaten": 4, "toplay": 9, "dropped": 2, "playing": 9}, "playtime": 4, "achievements_count": 56, "ratings_count": 15, "suggestions_count": 93, "game_series_count": 0, "reviews_count": 15, "platforms": ["PC", "Nintendo Switch"], "developers": ["Animal Uprising"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["Animal Uprising"], "esrb_rating": null}