{"id": 548143, "slug": "survival-rpg-2-temple-ruins", "name": "Survival RPG 2: Temple Ruins", "name_original": "Survival RPG 2: Temple Ruins", "description": "Survival RPG 2: The temple ruins is the sequel of the first retro game : Survival RPG - The lost treasure. It is 2d RPG and survival retro game. It combines quests, exploration, crafting and survival in a 2d pixel art universe.<br/><br/>On the first game, you were exploring for a lost treasure. After many combats and adventures, you came back victorious.<br/><br/>Now, you heard rumors of a magical artifact that lies among the temple ruins. So you decide to embark on a new journey full of adventures leading you to mysterious temples in the jungle.<br/><br/>In order to succeed, you will have to explore different environments: deserts, jungles, forests, dungeons, complete quests, solve puzzles, help other characters and craft items. Adventures await you.<br/><br/><strong>Features:</strong><br/><br/>- 7 story chapters that will bring you to the artifact.<br/>- Exploration of more than 30 dungeons, caverns, jungles, temples and huts.<br/>- More than 180 items to gather, mine and craft<br/>- Multiple roleplay quests and characters to help you in your journey.<br/>- 70 crafting recipes that you will unlock during your adventure and exploration.<br/>- Craft tools to help you<br/>     - Cut trees with an axe<br/>     - Use shovel for different tasks<br/>     - Create candles or lantern to see in dark dungeons<br/>     - Use pickaxes to gather different minerals<br/>     - And many more...<br/>- Discover hidden items<br/>- Find hidden treasures with treasure maps<br/>- Fight more than 35 different monsters and bosses", "metacritic": null, "released": "2021-01-28", "tba": false, "updated": "2021-01-29T03:42:07", "background_image": "https://media.rawg.io/media/screenshots/8d9/8d91347af13ef21bb391650ce9564a7a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 190, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Bew Games"], "genres": ["Adventure", "RPG", "Casual", "Indie"], "publishers": ["Bew Games"], "esrb_rating": null}