{"id": 548136, "slug": "nuumonsters", "name": "Nuumonsters", "name_original": "Nuumonsters", "description": "Nuumonsters is a game set in the future about curious little creatures that strive to be the strongest! Power on your AR Gear and play the role of Yasaka or Yana who strives to be the highest ranking Nuumonster trainer on the global leaderboards. Do so by defeating powerful opponents in Nuumonster battles, unlocking secret training dojo's, and attending underground battling casinos.<br/>\n<br/>\r\nNuu's can learn many different movesets, evolve into stronger forms, grant you access to areas not accessible before, and follow you around as you explore a vast open world. Make friends as you collect unique monsters to maximize your collector status and battle synergy possibilities.<br/>\n<br/>\r\nTaking great inspiration from many popular titles, Nuumonsters features a classic Gameboy style look with the original 160x144 resolution and a 3 color palette. This project strives to fulfill the nostalgic feelings brought on from memorable games, but with modern day quality of life features that we often times forget didn't exist in the original games.<br/>\n<br/>\r\nNuumonsters currently includes:<br/>\r\n• Over 100 unique moves and monsters<br/>\r\n• Easy to learn elemental combat mechanics<br/>\r\n• RNG free combat system to maximize strategy and minimize luck factor<br/>\r\n• Balanced leveling system to reduce time spent grinding<br/>\r\n• Secret bases to customize with unlockable items<br/>\r\n• Ton's of unique NPC's with infinitely repeatable battles <br/>\r\n• An expansive map full of secret areas, hidden items, and rare monsters<br/>\n<br/>\r\nIn the future, we would like to include:<br/>\r\n• Additions to the map full of new monsters and NPC's<br/>\r\n• Continuation of the existing story and side stories<br/>\r\n• Online battling, trading, and MMR ranking system<br/>\r\n• General additions like new items, moves, secret areas, etc", "metacritic": null, "released": "2021-01-28", "tba": false, "updated": "2021-01-29T03:37:34", "background_image": "https://media.rawg.io/media/screenshots/338/338602f9043333a258d9856bdae7f62f.jpg", "website": "https://allmylinks.com/nyankogamedev", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 131, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Nyanko Games"], "genres": ["Adventure", "RPG", "Strategy", "Casual"], "publishers": ["Nyanko Games"], "esrb_rating": null}