{"id": 548222, "slug": "carshift", "name": "Carshift", "name_original": "Carshift", "description": "The real world of racing has finally come to you! Beat your adrenaline with the unique experience that carshift offers! Driving and drifting have never been so realistic and fun! Burn the map playing single or multiplayer with your friends.<br/>Collect coins joining different races, buy fuel and play online with your team competing on Drag Race or having fun on Infected Cars.<br/>Climb the mountains or chill in the city roads experiencing the real graphics or visuals.<br/>Make your driving ride come true.<br/>Win drag races.<br/>Make your choices and GO ON!<br/><br/>Single Player Mode<br/><br/>Play single without the need to brake! The city is all yours. Explore it. Enjoy it.<br/>Join the races around the city following the signs and get rewarded with different amount of coins!<br/>Once you have the coins, you have the chance to buy fuel and save a little to unlock your favorite car!<br/><br/>Infected cars<br/><br/>Play online with your friends and explore how fast can you ride to expand the infection or get away from it. Five players can join and only one is infected in the beginning! Will they be able to share the syndrome to other cars or not? Who will stay un-infected? Who is the fastest? There is only one way to find out. Hurry up!!<br/><br/>Drag Race <br/><br/>Gives you the opportunity to compete with your friends online, so you better prepare! Play single, win money, buy the fastest car and come to win against your competitor in the Drag Race Online.", "metacritic": null, "released": "2017-04-17", "tba": false, "updated": "2021-01-29T04:34:30", "background_image": "https://media.rawg.io/media/screenshots/9c1/9c19f2522776186c1be82763ef880964_AW30MU3.jpg", "website": "http://gencsadiku.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 87, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Genc Sadiku"], "genres": ["Racing"], "publishers": ["Genc Sadiku"], "esrb_rating": "Everyone 10+"}