{"id": 548259, "slug": "softball-club", "name": "Softball Club", "name_original": "Softball Club", "description": "Like baseball Recruit softball players and train them to build the best team of your own.<br/>Softball Club is the first globally available sports management game for softball.<br/>With its simple controls and quick gameplay, Softball Club is the game you can casually play on.<br/>Dive into the world of exciting softball games where the best players compete, and feel the thrill of it!<br/><br/>■ Build a training facility with professional training equipment.<br/>- Install a variety of training equipment to boost abilities of your players.<br/>- Build a PR Room to promote star athletes of your team &amp; get more fans.<br/>- Decorate accommodation rooms to keep your players in their best condition.<br/><br/>■ Recruit star athletes to be the pillar of your team.<br/>- Unique and talented players are waiting to be chosen. Pick the best ones to nail the game.<br/>- After recruit, freely set player positions and substitutes, and manage them systematically.<br/>- Gear up your players to boost their abilities. Or dress them up in different costumes.<br/><br/>■ Sometimes harsh training is needed to make your players stronger.<br/>- From Climbing Mt Everest to swimming battle in Hawaii and training on a desert island!<br/>- These unprecedentedly hellish trainings will maximize your player’s ability.<br/>- Don’t forget to give reward items and recover player’s HP after the training.<br/><br/>■ Compete with a rival team to get the knack of the game.<br/>-  You can have a  match with your rivals anytime.<br/>- See the result of the tough trainings. Show off your players and beat the opponent.<br/>- Utilize Chance when it occurs during the match to keep holding the lead or turn the game around.<br/><br/>Softball Club boasts quick and speedy gameplay with simple and easy, touch-based controls.<br/>Enjoy making home runs and strikeouts while you casually play anytime, anywhere!<br/><br/>Language support:English, Japanese.Simplified Chinese, Traditional Chinese, German, Italian, Spanish, French, Portuguese, Vietnamese, Turkish, Thai, Russian, Indonesian, Malaysian.<br/><br/>https://www.facebook.com/mwgame21<br/>https://www.facebook.com/mediaworkSBCå<br/>======================================================================<br/>*Back up your game data with Google Cloud Save. So you can recall your data whenver you have to re-install the game.<br/>*Deleting the app also wipes out all data.<br/>======================================================================", "metacritic": null, "released": "2020-05-26", "tba": false, "updated": "2021-01-29T04:55:31", "background_image": "https://media.rawg.io/media/screenshots/7bd/7bdd3fdd9549025d6816f3bf37a17352_XEoKRp8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 218, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mediawork"], "genres": ["Sports", "Casual"], "publishers": ["Mediawork Co"], "esrb_rating": "Everyone 10+"}