{"id": 54825, "slug": "earthworm-jim-menace-2-the-galaxy", "name": "Earthworm Jim: Menace 2 the Galaxy", "name_original": "Earthworm Jim: Menace 2 the Galaxy", "description": "<p>Since bashing the evil Buttsville Queen in a Game Boy adventure and eliminating Psycrow on the Super NES back in 1995, Earthworm Jim has enjoyed a quiet life of leisure. We tried to guess how he&#39;s been spending the last four years, but we quickly realized that some things are better left unexplained.</p>\n<p>Unfortunately for Jim, his paid vacation time has just run out. The courageous annelid made the move to the third dimension in Earthworm Jim 3D, but it&#39;s side-scrolling platform work as usual for Jim on Game Boy Color.</p>\n<p>In Menace 2 the Galaxy, Jim must jump and shoot his way through 12 perilous levels, including a frightening tour of Jim&#39;s own bedroom. There&#39;s not much of a storyline to get in the way, but classic Jimonian humor rears its ugly head from time to time. Speaking of which, Professor Monkey-for-a-Head is back in action as well.</p>\n<p>Play control doesn&#39;t stand up well next to his 16-bit hits, but Jim gets around fairly well in Menace 2 the Galaxy. Colorful graphics create an appealing visual package, with detailed backgrounds and interesting enemies.</p>\n<p>Earthworm Jim: Menace 2 the Galaxy is compatible with Game Boy Pocket and the original Game Boy as well as Game Boy Color.</p>", "metacritic": null, "released": "1999-12-07", "tba": false, "updated": "2023-06-19T22:00:08", "background_image": "https://media.rawg.io/media/screenshots/d34/d34d93883ffaf89c2440ecfa87a75c1f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4, "beaten": 3, "toplay": 5}, "playtime": 0, "achievements_count": 0, "ratings_count": 4, "suggestions_count": 257, "game_series_count": 4, "reviews_count": 4, "platforms": ["Game Boy Color"], "developers": ["David A. Palmer Productions"], "genres": ["Action", "Platformer"], "publishers": ["Crave Entertainment"], "esrb_rating": "Everyone"}