{"id": 54843, "slug": "las-vegas-cool-hand", "name": "Las Vegas Cool Hand", "name_original": "Las Vegas Cool Hand", "description": "<p>Las Vegas Cool Hand is a Game Boy Color game that was released in 1998 to a North American and European market. A version for the original Game Boy was also released in Europe under the title Cool Hand.</p>\n<p>This video game features blackjack, cribbage, and solitaire. Blackjack can be played by either Las Vegas Strip rules, Downtown Las Vegas rules, London rules, or Atlantic City rules. Cribbage simply requires players to earn 121 points in order to beat the dealer in five different variations of play. Solitaire requires players to remove cards in sequential order while placing them in order on the top of the screen. Other varieties of play for the solitaire round include Elevens, Calculation (also known as Broken Intervals), and Monte Carlo (also known as Weddings and Double and Quits).</p>\n<p>The player starts out with a certain amount of pretend money that can be used to practice for the real casino. A complete instruction manual in addition to the online help provided within the cartridges helps first-time players how to play each and every individual game. Players have an option to set the number of decks, the time limit in solitaire games, along with other options that are specific to each game. Statistics are held for each game but are deleted once the console is deactivated.</p>", "metacritic": null, "released": "1998-12-01", "tba": false, "updated": "2019-09-12T06:36:19", "background_image": "https://media.rawg.io/media/screenshots/d58/d58432bafd0a63ca0ab442f8ba95a8a4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 218, "game_series_count": 0, "reviews_count": 0, "platforms": ["Game Boy", "Game Boy Color"], "developers": ["Tarantula Studios", "Rockstar Lincoln"], "genres": [], "publishers": ["Take Two Interactive"], "esrb_rating": null}