{"id": 548474, "slug": "frequence", "name": "Fréquence", "name_original": "Fréquence", "description": "<p>\"Fréquence\" is an Endless Runner toy in a Retrowave Arcade style.</p>\n<p>In Fréquence you embody a smart bit of the U.S. military, overcoming random enemy firewalls using your anticipation and reflexes.</p>\n<p>By default Fréquence automatically shifts sinusoidally.<br/>Press \"Space\" (or press the right side of your screen) to enter stabilization mode and go straight ahead, as long as you are in this mode you are using your stabilization gauge.<br/>Press again to deactivate the stabilization mode and rejoin the sinus curve.<br/>And if you press \"Z\" (or the Dash key on the left side of the screen) you do a Dash forward, which makes you immune to the damage.</p>\n<p>The button at the top left of your screen allows you to start again if you want !</p>\n<p>But don't worry, yellow collectibles will give you back some of your gauge ! (and maybe some red ones will give you back all your gauge...)</p>\n<p>You can play as long as you want, the levels are randomly generated in order of increasing difficulty among a number of 18 different paterns!</p>\n<p>Fréquence is currently a toy in which it is impossible to lose, if your gauge is empty Fréquence will continue to move automatically in a sinusoidal way. In which case you can wait to pick up a collectible or start again. (Maybe one day we'll add a game over with a score...)<br/><br/>-------------------------------<br/><br/>Fréquence  was carried out within the framework of a biannual project by :</p>\n<p><strong>Nathan Lebocq</strong> : Game &amp; Level Design<br/><strong>Damien Saenz</strong> : Programming<br/><strong>Thibault Hourcade Dit Belloc</strong> : Sound &amp; Game Design, Art Direction<br/><strong>Arthur Roels</strong> : Artistic Direction <br/><br/>Music in menu is EVA – 失望した<br/>Music in game is Synthwave F by TeknoAXE's </p>", "metacritic": null, "released": "2021-01-28", "tba": false, "updated": "2021-01-29T05:46:29", "background_image": "https://media.rawg.io/media/screenshots/5dd/5dd6cb408580d5fdf888674d637beca4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 31, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Android"], "developers": ["Nathan Lebocq"], "genres": ["Racing"], "publishers": [], "esrb_rating": null}