{"id": 5485, "slug": "go-puzzle-full-game", "name": "Go! Puzzle Full Game", "name_original": "Go! Puzzle Full Game", "description": "In order to play Go! Puzzle, you must first download the Go! Puzzle Starter Pack.<br/>\n<br/>\r\nSwizzle Blocks is a hectic and addicting puzzle game featuring four exhilarating gameplay modes.    Aquatica is a nautical, fast-paced, mind-twisting puzzle game in which a string of three mines fall into your submarine’s playing field. Skyscraper is the most extreme, fast-paced puzzle solving race to the top. <br/>\n<br/>\r\nKEY FEATURES<br/>\r\n•\tVarious Gameplay modes – Contains single, co-op and multiplayer challenges with various play modes and infinite levels.<br/>\r\n•\tSwizzle Blocks features video chat*, 4 exhilarating modes including Puzzle, Challenge, Time Attack, and Battle.<br/> \r\n•\tAquatica features 3 fast paced modes, 50 brain cracking puzzles, and online video chat.<br/> \r\n•\tSkyscraper features 3 mind-tickling modes, 7 cities, 5-7 towers each, 50 brain-teasing puzzles, and multiplayer online video chat.<br/>\r\n•\tHigh Definition Graphics – 1080i<br/>\r\n•\tOnline Rankings – See how you stack up against other players.<br/>\n<br/>\r\n*EyeToy® video cameras supported.<br/>\n<br/>\r\nGo! Puzzle ©2007 Sony Computer Entertainment Europe. Developed by Cohort Studios Ltd in collaboration with Zoonami Ltd. EyeToy is a registered trademark of Sony Computer Entertainment Europe. All rights reserved.<br/>\n<br/>\r\nVideo output in HD requires cables and an HD-compatible display, both sold separately.  This game supports displays ranging from standard definition to 1080i displays.<br/>\n<br/>\r\nPurchase and use of this item is subject to the PLAYSTATION®Network  Terms of Service/User Agreement, this item’s use restrictions, and other terms and conditions located at www.us.playstation.com/termsofuse.  If you do not wish to accept all those terms, do not purchase this item.  One-time license fee for downloads to up to 2 console systems that are associated with the purchasing account.", "metacritic": null, "released": "2007-06-14", "tba": false, "updated": "2019-08-02T16:22:13", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PlayStation 3"], "developers": ["Sony Interactive Entertainment"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": "Everyone 10+"}