{"id": 548611, "slug": "where-the-heart-leads", "name": "Where the Heart Leads (Sky Chan)", "name_original": "Where the Heart Leads (Sky Chan)", "description": "<p>To play this game on PS5, your system may need to be updated to the latest system software. Although this game is playable on PS5, some features available on PS4 may be absent. See PlayStation.com/bc for more details.<br />\nTake the journey of a lifetime in Where the Heart Leads, a surreal narrative adventure from award-nominated indie developer Armature Studio.<br />\nOne fateful, stormy night, husband and father Whit Anderson descends down a massive sinkhole to save the family dog. Tumbling into darkness, Whit emerges in a realm beyond his imagining, where moments from his past, present and future manifest like dreams. Bearing witness to the story of his life, Whit gains the power to change it.<br />\nGiven the chance to do it all over again, what would you change? Who would you become? And who will stand by you at your end?<br />\nA lifetime of choices — Grapple with life’s difficult decisions across decades of adventure and affect the lives of memorable, complex characters.<br />\nA small town story — Discover and influence the story of Carthage, a small town filled with rich history and quirky inhabitants, presented in surreal set-pieces and a hazy, watercolor-esque art style.<br />\nUnpredictable outcomes — Make thousands of choices and see dozens of possible endings as you navigate Whit&#39;s twisting, uplifting and sometimes gut-wrenching story.<br />\nOffline single player<br />\nUses DUALSHOCK 4 vibration function<br />\nRemote Play allows users to connect to and play games on their PlayStation®4 or PlayStation®5 using a mobile device, PC, or another PlayStation®4 or PlayStation®5.<br />\nOnline features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy).<br />\nSoftware subject to license (us.playstation.com/softwarelicense).<br />\nOne-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.</p>", "metacritic": null, "released": "2021-01-28", "tba": false, "updated": "2021-06-30T18:22:31", "background_image": "https://media.rawg.io/media/screenshots/dbf/dbf6e89fa7171dda7cd92340ab72d1e3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 9, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Sky Chan"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}