{"id": 548792, "slug": "g-for-gravity", "name": "G for Gravity", "name_original": "G for Gravity", "description": "Humankind is in danger! Asteroids hit and destroyed the Earth forcing everyone to flee. Now, all that is left are little floating islands. <br/>G for Gravity is a cute take on a post-apocalyptic earth shattered by asteroids, where you take the role of a thrifty robot trying to save humankind. <br/><br/>Dive into the <strong>Story Mode</strong>, a very short experience through three completely different levels. Collect all items and repair the Gravity Devices to stabilize the floating landmasses. Keep an eye out for special tools to access blocked and hidden items. Will you restore the earth and save humankind?<br/><br/>Challenge yourself in the <strong>Marathon Mode</strong>, an endless  adventure through randomly generated levels. Explore unique environments, discover all deeply hidden items and repair the Gravity Devices.<br/><br/>Customize your robot in the <strong>Paint Lab</strong>. Progress in the Story Mode and Marathon Mode to unlock fresh new paintjobs.<br/>Explore the brand new, special-themed marathons levels Halloween Night and Waffel Heaven.<br/><br/><strong>Features</strong><br/><br/><br/>Explore three unique levels, find the missing items and restore the Gravity Devices.<br/><br/><br/>Find components and unlock helpful tools.<br/><br/><br/>Play various minigames to start the Gravity Device.<br/><br/><br/>Unlock fresh paint jobs and customize your character.<br/><br/><br/>Discover special-themed levels: Halloween Night<br/><br/><br/>Discover special-themed levels: Waffle Heaven<br/><br/>G for Gravity was created by a team of three University students in the scope of a Games Workshop. We know it's short and rough around the edges but still hope you enjoy it!", "metacritic": null, "released": "2021-01-27", "tba": false, "updated": "2021-05-10T02:22:07", "background_image": "https://media.rawg.io/media/screenshots/f7f/f7fa3d5ba3d22e32e73a8211b4ff5a42.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 6, "ratings_count": 0, "suggestions_count": 145, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MasterDroid97", "OGW G5"], "genres": ["Adventure", "Casual", "Indie", "Puzzle"], "publishers": ["MasterDroid"], "esrb_rating": null}