{"id": 548951, "slug": "collector-ninjakillzu", "name": "Collector (Ninjakillzu)", "name_original": "Collector (Ninjakillzu)", "description": "<p><strong>DISCLAIMER: This game is still in the development process and not all content is available.<br/></strong></p><p><strong>CONTENT WARNING: </strong>Contains violence, blood, strong language, use of drugs and alcohol, and suggestive themes. This game may potentially trigger seizures for people with photosensitive epilepsy.</p>\n<p><strong>Genres: </strong>Cyberpunk, Futuristic, Western RPG, Open World</p>\n\n<p>The year is 2059. New Avalon is a vast city drowned in artificial light. Utterly ruthless Mega-Corporations cast long shadows on the city’s economy and politics, while cruel gangs roam the streets hunting for their next victim. Gordon wakes up in an alleyway, remembering nothing of his past. He joins a freelancer group known as The Vigil, who’ll complete any job…If it pays well. You follow Gordon’s journey to recover his memories as he tries to make sense of a new world bathed in neon and cluttered with humanity's detritus.</p>\n<p>This game is influenced by Neuromancer, Cyberpunk 2020 PnP RPG, and Blade Runner.</p>\n<br/>\n<p><strong>CHARACTER PROGRESSION INSPIRED BY DUNGEONS AND DRAGONS, AND STAR WARS: KNIGHTS OF THE OLD REPUBLIC</strong></p>\n<p>As you increase in level, you gain attribute points, learn new class abilities, and invest in feats.</p>\n<p><strong>THREE PLAYABLE, UNIQUE CLASSES</strong></p>\n<ul><li>The <strong>Wanderer</strong> is balanced between combat ability and skill knowledge. They focus on increasing their Attack Bonus and landing more critical hits in combat.</li></ul>\n<ul><li>The <strong>Street Warrior</strong> leans more towards combat ability over skill knowledge. They focus on dealing devastating melee blows and mitigating damage in combat.</li></ul>\n<ul><li>The <strong>Techhead</strong> leans more towards skill knowledge over combat ability. They focus on weakening targets and increasing their Armor Class.</li></ul>\n<p><strong>CHALLENGING TURN-BASED COMBAT</strong></p>\n<p>Choosing your actions wisely per turn can mean the difference between living another day and dying a painful death. Will you shoot a burst of bullets, administer medical aid, throw some grenades, or pop a few street drugs? The choice is yours.</p>\n<p><strong>IMMERSE YOURSELF IN THE \"HIGH TECH, LOW LIFE\" FUTURE</strong></p>\n<ul><li>Explore the open world districts of New Avalon, in all of their beauty and cruelty. Each district has its own unique aspects and encounters setting them apart from each other. There are at least 8 planned in the final release. The final number of districts is subject to change.</li></ul>\n<ul><li>Join or destroy factions. Lay waste to gangs, become a member of organized crime, or ignore them altogether.</li></ul>\n<ul><li>Unique drug system consisting of over 20 different street, pharmaceutical, and electronic drugs, each with levels of positive and negative effects. The final number of drugs is subject to change.</li></ul>\n\n<ul><li>Sample the local cuisine. Consume food and alcohol, for minor healing and attribute bonuses. (The drink shown is Rob's Painkiller. I sure hope someone gets the reference!)</li></ul>\n\n<p><strong>BECOME A KILLING MACHINE WITH AN ARSENAL OF WEAPONS AND CYBERNETIC ENHANCEMENTS AT YOUR DISPOSAL.</strong></p>\n<ul><li>Equip over 50 unique firearms and melee weapons. Use calibers from .22LR to the mighty .50 BMG. All of the game's firearms have their counterparts in real life (some are prototypes, like the WSG2000) and use hand drawn sprite-work by me. Most are complete, but only some are in the demo.</li></ul>\n\n<ul><li>Equip over 50 unique pieces of cyberware, including cyberlimbs, cyberoptics, cyberweapons, neuralware, chipware, co-processors, implants, and bioware. Most are complete, but only some are in the demo.</li></ul>\n<br/>\n\n<p>If the game launches in windowed mode, you can make it full-screen by pressing F5.<br/><br/></p>", "metacritic": null, "released": "2021-01-27", "tba": false, "updated": "2021-01-29T07:46:32", "background_image": "https://media.rawg.io/media/screenshots/9bb/9bbcaaa1fbfdee2f291e8c4bd85153c5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 259, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ninjakillzu"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}