{"id": 549080, "slug": "maze-jol", "name": "Maze Jol", "name_original": "Maze Jol", "description": "<p><strong>ENGLISH:</strong></p>\n<p>The aim of the game is to exit the maze, each time a different maze is generated. The exit is located in the upper right part of the maze. There are three difficulty options to select from, the easy \"Easy\", the medium \"Medium\", and the difficult \"Hard\". After selecting the option you want to play, another screen will appear with the maze (which is generated randomly), on this screen, you can leave the game at any time (\"Exit\") or you can return to the initial menu (\"Menu\") to select again one of the three desired options.</p>\n<p>On Android:<br/>The options are selected by tapping them directly on the screen. To move the ball, you must touch the left, right, up, or down arrows according to the direction you want to choose.<br/>On Windows:<br/>If you have a touch screen, the options can be selected by tapping them directly on the screen. If you do not have a touch screen or you do not want to use the touch screen option, you can also select the options with the keyboard, as follows:</p>\n<p>          On the first screen: each of the three options can be selected by pressing the initial letter on the keyboard, e for \"Easy\", m for \"Medium\" and h for \"Hard\".</p>\n<p>          On the second screen: you can select the arrows by clicking with the mouse on the desired arrow or from the keyboard, pressing the left, right, up or down keys according to the action you want to perform. The option to quit the game can be executed by pressing the e key for \"Exit\" and to go to the main menu, pressing m for \"Menu\".</p>\n\n<p><strong>SPANISH:</strong></p>\n<p>El objetivo del juego es salir del laberinto, cada vez se genera un laberinto diferente. La salida se encuentra ubicada en la parte superior derecha del laberinto. Hay tres opciones de dificultad para seleccionar, la fácil \"Easy\", la media \"Medium\" y la difícil \"Hard\". Luego de seleccionar la opción que se quiere jugar, aparecerá otra pantalla con el laberinto (el cual se genera aleatoriamente), en esta pantalla, se puede abandonar el juego en cualquier momento (botón \"Exit\" o salir) o se puede regresar al menú inicial (\"Menu\" o menú) para seleccionar nuevamente una de las tres opciones deseadas.</p>\n<p>En Android:</p>\n<p>Las opciones se seleccionan topándolas con el dedo directamente sobre la pantalla. Para mover la pelota, se deben topar con el dedo las flechas izquierda, derecha, arriba o abajo de acuerdo a la dirección que se desea escoger.</p>\n<p>En Windows:</p>\n<p>Si se tiene pantalla táctil las opciones se pueden seleccionar topándolas con el dedo directamente sobre la pantalla. Si no se tiene pantalla táctil o no se quiere usar la opción de la pantalla táctil, se pueden seleccionar las opciones también con el teclado, de la siguiente manera:</p>\n<p>          En la primera pantalla: se pueden seleccionar cada una de las tres opciones, presionando en el teclado la letra inicial, es decir, e para \"Easy\", m para \"Medium\" y h para \"Hard\".</p>\n<p>          En la segunda pantalla: se pueden seleccionar las flechas dando click con el mouse sobre la flecha deseada o desde el teclado, presionar las teclas izquierda, derecha, arriba o abajo de acuerdo a la acción que se desee realizar. La opción para abandonar el juego se la puede ejecutar presionando la tecla e para \"Exit\" (salir) y para ir al menú principal, presionando m para \"Menu\" (menú).</p>", "metacritic": null, "released": "2021-01-26", "tba": false, "updated": "2021-01-29T08:20:51", "background_image": "https://media.rawg.io/media/screenshots/59c/59ca42fe34e9baef246871088d7f0bd6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 55, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Android"], "developers": ["Jol3D"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}