{"id": 549576, "slug": "life-during-the-renaissance", "name": "Life During the Renaissance", "name_original": "Life During the Renaissance", "description": "<p>This is a game made for my English class. Why did I make a game for my English class? Good question. Here you will find a rough representation of what living in the times of Shakespeare might've been like. It's... not good. I know it's not good. Feel free to tell me it's not good, if you must, but it will be fruitless because I <em>know</em> it's not good. The genre is \"Educational\" but I can't vouch for the validity of my information. Do not take it seriously. Anyway have fun!</p>\n<p>A side note: There are \"cutscenes.\" I did not know how to make them function like cutscenes so if you click through them it can mess stuff up. There is really no way to tell when you will encounter a cutscene, so just don't be trigger happy I guess. </p>\n<p>Another side note: If you are a history buff, <em>please</em> do tell me how badly I've butchered this information.<br/></p>\n<p>A final side note: There is a chance--if your computer runs Windows Defender antivirus--that the 32 bit version of the game (which is automatically included in the zip) will be detected as a trojan virus. It is <em>not</em> a trojan virus, but your computer will most likely hide/delete the file. It's not imperative to gameplay unless you're running Windows 8 or lower. <br/></p><p>Credit to https://youtube.com/channel/UC1JtQep1CcAvDuU7QAxHh0Q for the music.</p>", "metacritic": null, "released": "2021-01-25", "tba": false, "updated": "2021-01-29T10:19:24", "background_image": "https://media.rawg.io/media/screenshots/eb4/eb4b56e95ead7131aea6c4f32085453e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 72, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["Two Thirds Studio"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}