{"id": 549654, "slug": "eternal-equinox", "name": "Eternal Equinox", "name_original": "Eternal Equinox", "description": "<p> The balance of the universe is now unknown. It has been altered, and this has been felt through all that exists. Galactic titans are clashing, they seek to destroy the universe as we know it and claim it for their own. Fighting between themselves to the death as only one can stand in the end, their brawl is shattering the cosmos. The more the balance is thrown off, the more the universe will tear apart, and the damage will become irreversible. There is not much time. The last hope remains splintered in time between two realms on a celestial plane. The sun realm and moon realm. For generations, these realms have remained untouched, maintained by the Children of the Stars. But now, pieces of the realms, Sun Stones and Moon stones, are lost among them. Ancient Beings Helios and Selene have awoken. They call upon the Children of the Stars to work together to find these stones across the realms. Returning them to their rightful place will restore the balance of the shattered cosmos, and put a stop to the titans for the rest of time. <br/><br/></p>\n<p><strong>Controls PC</strong>: Move: WASD Item Interaction: Q/E Camera Control: Mouse Game Menu: Escape <br/><strong>Controls VR</strong>: Move: Joystick Item Interaction: Grip <br/><br/>*Currently matches are forced to be found by default, therefore playing \"solo\" is at the whim of other players connecting.<br/></p>", "metacritic": null, "released": "2021-02-01", "tba": false, "updated": "2021-02-01T02:39:30", "background_image": "https://media.rawg.io/media/screenshots/3bf/3bfe42343526282c6e35876cafa16380.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 37, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Android"], "developers": ["swirllyman"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}