{"id": 549604, "slug": "dark-flowersan-ran-zhi-hua", "name": "Dark Flowers(黯然之花)", "name_original": "Dark Flowers(黯然之花)", "description": "<strong>Dark Flowers</strong> is a shooting game with terror atmosphere and puzzle solving. Players are in a small town full of doubts. With a simple exploration and game mode with retro elements, they focus on the complete expression of the game script and puzzle solving Please be able to get everyone's love!<h3>Operation introduction</h3><ul> <li>The key words of \"↑↓←→\" is move, \"Z\" is \"confirm\", \"X\" is \"menu and cancel. </li></ul><ul> <li>In the scene with enemies, pressing the \"Q\" key can fire fireballs to attack the enemy. </li></ul><ul> <li>Some of the seats in the scene can rest, but even during the rest, they will be surrounded by the enemy. Please pay attention! </li></ul><ul> <li>In some scenes, wooden buckets and other objects can be moved. Press the direction key near to push, and press the OK key near to pull back. </li></ul><ul> <li>It is recommended to keep more records. </li></ul><h3>Background</h3>Meteorites falling from the sky bring disaster to the world. At the same time, they also make a small number of people have strange magic power. People who have magic power call meteorites \"the only......\"<br/>As the protagonist, she recalls the past in her sleep. When some important pictures appear, she wakes up from the dream, so she keeps following the guidance of memory and gradually goes to the unknown world.", "metacritic": null, "released": "2021-01-31", "tba": false, "updated": "2021-02-01T02:17:49", "background_image": "https://media.rawg.io/media/screenshots/856/856c635dd10bbee6df07e23c32eff565.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 140, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dawnwing House"], "genres": ["RPG", "Casual"], "publishers": ["RMking"], "esrb_rating": null}