{"id": 54977, "slug": "barbarian-the-ultimate-warrior", "name": "Barbarian: The Ultimate Warrior", "name_original": "Barbarian: The Ultimate Warrior", "description": "<p>Barbarian: The Ultimate Warrior is a video game first released for Commodore 64 personal computers in 1987; the title was developed and published by Palace Software, and ported to other computers in the following months. The developers licensed the game to Epyx, who published it as Death Sword in the United States. Barbarian is a fighting game that gives players control over sword-wielding barbarians. In the game's two-player mode, players pit their characters against each other. Barbarian also has a single-player mode, in which the player's barbarian braves a series of challenges set by an evil wizard to rescue a princess.</p>\n<p>Instead of using painted artwork for the game's box, Palace Software used photos of hired models. The photos, also used in advertising campaigns, featured Michael Van Wijk (who would later become famous as 'Wolf' in the TV series Gladiators) as the hero and bikini-clad Maria Whittaker, a model who was then associated with The Sun tabloid's Page Three topless photo shoots. Palace Software's marketing strategy provoked controversy in the United Kingdom, with protests focused on the sexual aspects of the packaging rather than decapitations and other violence within the game. The ensuing controversy boosted Barbarian's profile, helping to make it a commercial success. Game critics were impressed with its fast and furious combat, and dashes of humour. The game was Palace Software's critical hit; boosted by Barbarian's success, Palace Software expanded its operations and started publishing other developers' work. In 1988, the company released a sequel, Barbarian II: The Dungeon of Drax.</p>", "metacritic": null, "released": "1987-01-01", "tba": false, "updated": "2023-04-15T23:11:28", "background_image": "https://media.rawg.io/media/screenshots/878/87867560f72ac19d4819a1a616919284.jpg", "website": "", "rating": 0.0, "rating_top": 4, "added_by_status": {"yet": 1, "owned": 10, "beaten": 4, "toplay": 2, "dropped": 5}, "playtime": 0, "achievements_count": 0, "ratings_count": 5, "suggestions_count": 320, "game_series_count": 0, "reviews_count": 5, "platforms": ["iOS", "Atari ST", "Atari 8-bit", "PC", "Apple II", "Commodore / Amiga"], "developers": ["Palace Software"], "genres": ["Fighting"], "publishers": ["Epyx", "Palace Software"], "esrb_rating": null}