{"id": 549786, "slug": "lost-raturn", "name": "Lost & Raturn", "name_original": "Lost & Raturn", "description": "<p>Oh no! The year is 1983 and people are dropping their belongings all over the city! But don’t fear, Marshall the good rat is here to help those clumsy folks with butterfingers get their lost goods back!</p>\n<p>He sneakily climbs up pedestrians' legs to return dropped items, making sure to give the right item back to the right person. After all, what would I do with another person's wallet?<br/>Be careful not to get squashed while you are out there working hard, though! Life is tough for a little rat.</p>\n<p>Try and take on this tough challenge and beat your friends' scores!</p>\n<p>Note: high scores don't currently work in the browser. If you want to battle for high score check out our downloadable here: https://globalgamejam.org/2021/games/lost-raturned-5!</p>\n<p>HINTS: **SPOILERS AHEAD**<br/>What items go with what person:<br/>- The cowboy, who can be identified by their luxurious leather boots, often drops their six shooter. They would be in big trouble without that!<br/>- The business man can be identified by the green pants they wear. They often drop really expensive watches!<br/>- The women wearing red dresses drop rings.<br/>- The swimmer with swim trunks often drops their sunscreen. They definitely need that back because sun burn is no joke!<br/>- The construction workers drop their wrenches which they need to help build and repair the city!<br/>- The joggers, who wear jogging shorts, often drop their mp3 players while running intensely!</p>\n<p>This game was made for the 2021 Global Game Jam</p>", "metacritic": null, "released": "2021-01-31", "tba": false, "updated": "2021-02-01T03:10:41", "background_image": "https://media.rawg.io/media/screenshots/bbb/bbb4f42a5cb95067d6d7189d3b06761b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 14, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["justinro-underscore"], "genres": ["Action"], "publishers": [], "esrb_rating": null}