{"id": 54999, "slug": "countdown-to-doom", "name": "Countdown to Doom", "name_original": "Countdown to Doom", "description": "<p>Countdown to Doom is a text adventure computer game, more recently termed interactive fiction, written in 1982 by Peter Killworth. Its setting is the planet Doomawangara, which is coyly said to be shortened to \"Doom\". The game also has two sequels, Return to Doom and Last Days of Doom.</p>\n<p>The game was first published for the BBC Micro in 1982. It was ported to the Acorn Electron in 1984 but only released as a ROM cartridge for the Plus 1 expansion. This was the only game released exclusively as a ROM cart for the Electron. The game was later re-released in 1987 by Topologika (who also published the game's sequels).[1] This version was expanded by about 50% and as well as being released for the BBC and Electron (on disk only), the game was ported to many other systems including ZX Spectrum (+3 disk only), PC, Amstrad CPC, Amstrad PCW, Atari ST and RM Nimbus. It was also available for Acorn RISC OS computers as a compilation with Return to Doom and Philosopher's Quest.</p>\n<p>In this game, the player's spaceship crash-lands on Doom's inhospitable surface and they emerge from the wreckage to realise that, unless they can locate the necessary spare parts, their ship will corrode away in a mere 400 time units. There are many ways to be killed in this game.</p>", "metacritic": null, "released": "1982-01-01", "tba": false, "updated": "2023-02-08T10:52:00", "background_image": "https://media.rawg.io/media/screenshots/f7a/f7ad6dcf376a7ece3fb8eb54ef605fb2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 4, "beaten": 4, "toplay": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 60, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC", "Atari ST"], "developers": ["Peter Killworth"], "genres": [], "publishers": ["Acornsoft", "Topologika"], "esrb_rating": null}