{"id": 550003, "slug": "zeitgeist-itch", "name": "Zeitgeist (itch)", "name_original": "Zeitgeist (itch)", "description": "If we seek the singularity we must first overflow the stackus quo! -- Ai M. Yu\r\nYu and I don't always see eye to eye, but that tension is the hidden strength of Cyberpomp Industries. We need his vision, and we need my, uh, willingness to obey the law. -- Marcus Carter\r\n\r\nCome, let us traverse the inverse, Fracture the fractional, pack the packets for an extended stay. Where we're going, we don't need roads. -- Ai M. Yu\r\n\r\nYou can't seriously think I had something to do with-- that's horrible, I would never-- he was my FRIEND! -- Marcus Carter\r\n\r\nGood morning, Agent 21. Since this is a prerecorded presentation, I'll skip the pleasantries and get right to it: your new case is the 1998 disappearance of counterculture tech guru Ai M. Yu. Advance the slide.\r\n<p>This is a literal PowerPoint presentation. To play, open START.pptx in the Microsoft PowerPoint desktop app. If you don't have it, you can upload the slides to powerpoint.com for a 90%-as-good experience (I think you'll have to make a microsoft account if you don't have one). If you're playing this way, once you reach the end (the floating payphone), open secret-online.pptx and enter the password.</p>\n<p>Don't even try with Google Sheets.</p>\n<p>Made for Global Game Jam 2021 with Portland Indie Game Squad. </p>\n<p>Theme: <strong>Lost and Found</strong></p>\n<p>Diversifier: <strong>Next Slide, Please</strong> (make your game entirely in PowerPoint)</p>", "metacritic": null, "released": "2021-01-31", "tba": false, "updated": "2021-02-01T04:04:13", "background_image": "https://media.rawg.io/media/screenshots/213/2136234766b8d46a432db65e79a5dc8c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 28, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["nextlevelbanana", "Bluecolossal"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}