{"id": 550389, "slug": "robot-ricochet", "name": "Robot Ricochet", "name_original": "Robot Ricochet", "description": "<p><strong>Features in a nutshell<br/></strong></p>\n<ul><li>Simple but fun 2D top-down shooting action, with a hint of puzzling</li><li>10 levels of content</li><li>Timer and score keeping: try to beat the levels as fast as you can!</li><li>Free and open source: see how the sauce is made, mod it, build upon it</li></ul>\n<p>You can find the source code along with all the assets at https://gitlab.com/Samsai/mirrored-lasers</p>\n<p><strong>Background &amp; how to play</strong><br/></p>\n<p>You are a sneaky smuggler, who has had an unlucky encounter with the galactic police bots. Now you must evade capture by destroying the robots that have come aboard.</p>\n<p>To do this you are armed with a blaster pistol. However, your pistol is a bit broken and the robots can very quickly see you if you are out in the open.</p>\n<p>Luckily the solution to both problems is the same: you can ricochet your shots or fire through energy fields to ensure a lethal hit. Your shots will alternate between deadly and harmless based on every ricochet or an energy field it passes, so plan your shots and make them count. You can also find splitters which will split your shots into additional shots for maximum mayhem. Just, watch out to make sure you don't shoot yourself by accident, will you?</p>\n<p><strong>Controls</strong><br/></p>\n<p>To move around you use the WASD keys and to aim and shoot you use the mouse. In menus the arrow keys are used for moving, Enter is used for selections and Escape is used to move to previous menus.  Alternatively you can use gamepad controls where one stick controls movement and the other controls aiming. The Right Trigger will allow you to shoot, while A key is used to select things on menus and B is used to go back on menus.</p>\n<p><strong>Credits and attributions<br/></strong></p>\n<p>Project idea, sprite work and coding by Samsai</p>\n<ul><li>Code: GPLv3</li><li>Sprites: CC-BY-SA</li></ul>\n<p>Graphical tile work by RoxiTheUnicorn (CC-0, public domain)</p>\n\n<p>Menu sounds by broumbroum (CC-BY): https://freesound.org/people/broumbroum/</p>\n\n<p>Music by Tumocs (CC-BY-SA): https://soundcloud.com/tumocs/miami-starsky</p>\n\n<p>Various sound effects (CC-0, public domain)</p>", "metacritic": null, "released": "2021-01-31", "tba": false, "updated": "2021-02-01T05:33:27", "background_image": "https://media.rawg.io/media/screenshots/506/5067a7a5d7561cb29f8211b0e6c54641.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 42, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux"], "developers": ["Samsai"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}