{"id": 550331, "slug": "duality-itch-hypergnosys", "name": "Duality (itch) (HyperGnosys)", "name_original": "Duality (itch) (HyperGnosys)", "description": "<p>La Tierra ya pasó el punto de recuperación y construyeron un \"tren\" en el espacio que sirve para alargar la vida de la Tierra lo suficiente para construir un Arca. El personaje principal es el maquinista del tren y tiene dos personalidades. Asher y Resah. Asher es muy positivo, aprecia la belleza y la bondad en la humanidad. Resah es todo lo contrario, está obsesionado con condenar las cosas terribles que ha hecho a humanidad contra sí misma y contra la naturaleza. Con el paso del tiempo Resah se vuelve más extremo y quiere destruir el Tren porque quiere evitar que la humanidad se expanda a otro planeta y lo destruya también. Para evitarlo, Asher comienza a destruir los vagones que llevan a la cabina principal para que Resah no pueda llegar. Cuando cruza por el vagón médico, Resah toma control e intenta transferir su(s) mente(s) a un cuerpo robótico y borrar a Asher. Parece ser que accidentalmente borró a ambos. Aquí comienza el juego. El jugador despierta tras la transferencia y no sabe nada. Solo se muestra una misión en la pantalla: Alcanza el vagón principal. Los vagones que cruzarás es donde trabajabas, y hay bitácoras de audio en ellos que te cuentan la historia. Al llegar al vagón principal el jugador escoge si repara el tren y salva la belleza de la humanidad, o si escoge condenar su malicia y permite que se extinga en la Tierra. Nos relacionamos al tema de Lost and Found por esa reconstrucción de las memorias del personaje, y que al final decide qué personalidad se reencontró, Asher o Resah.</p>", "metacritic": null, "released": "2021-01-31", "tba": false, "updated": "2021-02-01T05:20:03", "background_image": "https://media.rawg.io/media/screenshots/18b/18b87800c2b259730eb26cb8e24f7a60.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 223, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["HyperGnosys"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}