{"id": 550571, "slug": "pizza-rat", "name": "Pizza Rat", "name_original": "Pizza Rat", "description": "<p>Pizza Rat<br/></p>\n<strong>Rules:</strong>\n<p>On your turn, you enter the pizzeria to add as many toppings to your pizza as you can. You will start with 16 randomized options; spinach, mushrooms, pepperoni, rats, and cats. <br/>1. The cats will automatically be added to your score card and removed from the total options going forward.</p>\n<p>2. From the remaining options, you can select one to keep. You can only select a single type of toppings once per turn but you can always select rats. <br/>3. After selecting what to keep by pressing the pizza in the middle, the remaining options are re-rolled and you continue your turn. If at any point you run out of options or wish to end your turn, hit the bell.</p>\n<p>3. To keep the toppings you collected, you must have at least the same number of rats than cats by the end of your turn. If you do not, the cat has chased you out of the pizzeria and your score is 0 for that turn!</p>\n<p>4. Everyone has the same number of turns and the person with the highest score wins!</p>\n<p>Will you settle for 1 point or stay longer in the pizzeria and risk it all for more!?</p>\n<p><strong>***Health Inspector***</strong><br/>As more and more rats enter the pizzeria, the health inspection bar fills up. The health inspection is triggered when double the total score amount of rats have been selected. If it reaches 100% on your turn, the pizzeria is closed and your turn is immediately over. Any points you may have collected for that turn are still tallied.</p>\n<p><strong>***Daily Specials &amp; Coupons***</strong><br/>At the start of each turn a new daily special or coupon is displayed on the score card. <br/>• Daily Specials are optional bonus points if you collect only the requested toppings. For example, if the Daily Special is a pepperoni mushroom pizza you would get 2 bonus points for collecting those toppings. <br/>• Coupons, while rare, deduct 1 or 2 points off your total. You will lose the coupon points whether you complete an order or not!</p>", "metacritic": null, "released": "2021-01-31", "tba": false, "updated": "2021-02-01T06:16:58", "background_image": "https://media.rawg.io/media/screenshots/f51/f51e9baafdb22ae0f3a76d575e889a1f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 49, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["FoodEtc"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}