{"id": 550520, "slug": "the-mischievous-thievery-of-jessica-the-cat-protot", "name": "The Mischievous Thievery Of Jessica The Cat (prototype)", "name_original": "The Mischievous Thievery Of Jessica The Cat (prototype)", "description": "<p>Jessica the cat has been sneaking around the neighbourhood stealing people's things. Only one detective can track her down and find the missing items. (It's you! You're the detective.)</p>\n<p>This is a prototype engine built in Twine for Global Game Jame 2021. The 2021 theme was \"Lost &amp; Found\". [GGJ Game Page]</p>\n<p>The game will launch in full screen mode.<br/><br/></p>\n<p><strong>Credits:</strong>\n</p>\n<ul>\n<li>Mandy J Watson (@mandyjwatson):<br/>Game design, narrative and writing, programming, and art</li>\n<li>Fonts:<br/>Munro by Ten By Twenty (SIL Open Font Licence 1.1); and<br/>Nevis by Ten By Twenty (SIL Open Font Licence 1.1)</li>\n</ul>\n\n<p><strong>Software Used:</strong>\n</p>\n<ul>\n<li>Base64.Guru, <em>Bitsy</em> (for quick art and layout prototyping), <em>GIMP</em>, <em>Notepad</em>, and <em>Twine</em></li>\n</ul>\n\n<p><strong>Game Notes:</strong><br/><em>My goals were</em>:<br/>\r\n- to make a map that is randomly ordered every time from a predefined set of tiles, which I achieved. (I would have preferred completely randomly generated but I didn't have enough time because it requires an extra section of coding that checks that specific tiles that you need in each game are there.)<br/>\r\n- only to reveal the contents of each tile on the map after it has been investigated, which I achieved.<br/>\r\n- to use some of the tiles as clues to help you find the missing object tile, which I didn't achieve.<br/>\n<br/>\n<em>My to do list includes:</em><br/>\r\n- fixing the variable bug. [Done!]<br/>\r\n- finishing the art.<br/>\r\n- expanding the map to add more exploration tiles to the game.<br/>\r\n- expanding the game world by adding new cases for players to investigate.</p>\n\n\n<p><strong>Changelog:</strong><br/>v0.9.1: Global Game Jam 2021 prototype<br/>- Quick fix for the bug with the variables. The game should run fine now without needing to be refreshed.</p>\n<p>v0.9: Global Game Jam 2021 prototype<br/>- Original prototype submission for Global Game Jam 2021, which contained a bug that required the browser window to be refreshed if you finished the game and wanted to play it again.</p>", "metacritic": null, "released": "2021-01-31", "tba": false, "updated": "2021-02-01T06:05:28", "background_image": "https://media.rawg.io/media/screenshots/7da/7da32cf14660a2ec648b704732533009.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 18, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["Mandy J Watson"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}