{"id": 550969, "slug": "dami-flo", "name": "Dami & Flo", "name_original": "Dami & Flo", "description": "<p>Dami and Flo are two workers on a delivery train. At each station, they have to take input packages at the bottom and store them somewhere in the wagon so they can be easily delivered at a future train stop.</p>\n<p>There is a one player mode or a two player local splitscreen mode. You can choose your difficulty with \"Timer\" option and \"Items\" quantity option. You can also choose to have more than one wagon, but it can be very difficult especially if you are not playing with a friend.</p>\n<p>Between stations, take your time to sort and store all the packages in the wagon. Clear the input area as fast as possible so new packages can be inserted at the next stop. Delivery requests for the next station are displayed at the top of the screen.</p>\n<p>You can drop off requested items in the output area, they will be picked up automatically at the next station. You can stack items on the ground up to 5 items high and your character can carry up to 10 items at a time.</p>\n<p>Controls:</p>\n<p>Player 1:<br/></p>\n<ul><li>pick package: Z or C or N</li><li>drop package: X or V or M</li><li>move character: ARROW KEYS</li></ul>\n<p>Player 2:</p>\n<ul><li>pick package: LEFT SHIFT</li><li>drop package: TAB or W or Q or A</li><li>move character:  S+F+E+D</li></ul>\n<p>Open main menu: ENTER to se stats or toggle the music</p>\n<p>You can also use a game controller</p>", "metacritic": null, "released": "2021-01-31", "tba": false, "updated": "2021-02-01T07:52:16", "background_image": "https://media.rawg.io/media/screenshots/ed7/ed716108a37d41424c686067d66a9593.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 78, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["NuSan"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}