{"id": 550971, "slug": "lost-soul-found", "name": "Lost Soul Found", "name_original": "Lost Soul Found", "description": "<p>In the one day in hell,Where bad spirits go,they have a chance for to be forgiven. If they want to take this chance they have to go to lost office and they remember their lost body. They have to had a good brain for to fix their mistakes. The lost and found office workers who steal lost souls bodies from hell's center for buying bodies  can only give them a this change. They have to carefull the find their lost body. They have to ask 4 question to find lost body. Of course this had to be price.</p>\n<p>//</p>\n<p>Günlerden bir gün kötü ruhların gittiği yer olan cehennemde herkesin affedilmesi için bir şans verilir .Bu şanstan yararlanabilmek için oranın kayıp bürosunda çalışan olan bizlerden   gelip kendi bedenlerini hatırlayarak bize tarif etmeleri gerekmektedir. Buradan kurtulmak için yeterince iyi hafızaları olması gerekmektedir. Hatırlarsalar geri dönerek hatalarını düzeltme şansını yakalayacaklardır. Onlara bu şansı verecek kişiler ise cehennemin merkezinden bütün bedenleri kaçırıp onları sahilerine satan  kayıp büro çalışanlarıdır. Yeterince dikkatli olarak doğru bedeni bulmak zorundadırlar. Tabi ki belli bir karşılıkla.</p>", "metacritic": null, "released": "2021-01-31", "tba": false, "updated": "2021-02-01T07:52:45", "background_image": "https://media.rawg.io/media/screenshots/9dd/9ddc61bfb59e06480a7ab55f329464f5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 41, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["HilamGhost"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}