{"id": 551030, "slug": "micro-entertainment-pack-brooklyn", "name": "Micro Entertainment Pack: Brooklyn", "name_original": "Micro Entertainment Pack: Brooklyn", "description": "<p>This game is part of the <strong>Micro Entertainment Pack</strong>, a collection of tiny desktop games I developed for fun.</p>\n<p>A clone of the old game Pipe Dream/Pipe Mania. Place pipe pieces before the water flows into them. Each level has a minimum length the water must flow (remaining blocks shown in bottom right). Some levels have special end pieces, where your chain of pipes must end in order to pass the level. Other special pieces include bonus points and reservoir pieces, special blockers, and one way pieces which show up in your queue in later levels. Also, some borders will be marked with arrows, which means that flow can wrap around to the other side. You can build pipes over existing pipes for a points and time penalty.  Every few levels you have a bonus level, where you instead shift pipe pieces in a sliding-block style puzzle. You can click the start pipe, press F, or use the menu to \"fast forward\" pipe flow.</p>\n<ul><li><strong>Classic Pipe Dream/Mania gameplay,  </strong>with speed gradually increasing through the levels.</li><li><strong>Bonus puzzle levels</strong> for extra points.</li><li><strong>Special pieces</strong> to add to the challenge and gameplay variety.</li><li><strong>Tiny, unobtrusive graphics</strong> and <strong>Micro Mode</strong> - The game only occupies a fraction of your screen real estate, and can even be displayed in half size on high DPI displays, making it perfect for discreetly playing at work or while watching something on your computer.</li></ul>\n<p>Currently I prioritise mac binaries, as that's the only platform I play these games on, but am also building for other platforms (they will be up in February). They are written in Rust and have a dependency on C libraries SDL2 and SDL_gfx. </p>", "metacritic": null, "released": "2021-01-31", "tba": false, "updated": "2021-02-01T08:09:56", "background_image": "https://media.rawg.io/media/screenshots/eea/eea8ed856fb7e722a4f6b215682ca271.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 49, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS"], "developers": ["Liam O'Connor"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}