{"id": 551196, "slug": "find-my-phone-app-the-game", "name": "Find My Phone App - The Game", "name_original": "Find My Phone App - The Game", "description": "<p>Your phone is missing. This is not only an outrage, it's downright dangerous. You've got to find where in the world that thing scampered off to! Thankfully you've got Find Your Phone App on your tablet! </p>\n\n<p>Scan environments for extremely unhelpful clues on where your phone is and hope that it hasn't fallen prey to a wily phone thief!</p>\n<p>This is the Global Game Jam 2021 #ggj21 entry by The Free-Range Roombas!</p>\n<p>GGJ Page: https://globalgamejam.org/2021/games/find-my-phone-app-game-2</p>\n\n\n<p><em>The Free-Range Roombas: Brennan Hatton, Clement Chan, Tim Christie, Wilson Taylor</em> </p>\n<p>Clement Chan  - An exceptionally talented audio engineer with an eye for process, and commitment to delivery. Picked him up from our partnership between The Ageing Revolution  and Equal Reality.</p>\n<p>Wilson Taylor. A video game writer who has brought laughter, romance, and tears to multiple millions of people globally with his inventive narratives. His work ranges from video games to books, comics &amp; visual novels, and we are currently collaborating on another game Dungeon Train. Check out his latest  piece, Deep  Night Detective<br/></p>\n<p>Tim Christie - is always a fantastic addition to the team, no matter what event. Sporting, Gaming, Silicon Valley AR tech, hackathons or making games. Tim is a talented techie who will always make sure it's fun, and give his best.<br/></p><p>Brennan Hatton  is a mutli-award winning VR developer who has  been building games &amp; virtual worlds for over a decade, and being involved in 100's of projects with over 50 of the worlds biggest companies in 12 different countries.</p>\r\nMore Videos:", "metacritic": null, "released": "2021-01-31", "tba": false, "updated": "2021-02-01T08:50:36", "background_image": "https://media.rawg.io/media/screenshots/d16/d1630f47954bf9738d41d35ddb7c162e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 185, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Brennan Hatton"], "genres": [], "publishers": [], "esrb_rating": null}