{"id": 551113, "slug": "dubloon-detector", "name": "Dubloon Detector", "name_original": "Dubloon Detector", "description": "<p>Dubloon Detector is a game about digging up dubloons. It holds no real challenge and acts more as a conceptual prototype. There is no failure or win state.<br/></p>\n<p>Dubloon Detector was created during Global Game Jam, 2021. <br/>The game was made by me as a solo developer, using Unity. The project's source can be found at: https://github.com/JimmyHaglund/DubloonDetector<br/>The theme for the jam was \"Lost and Found\". I tried making a mind map from the theme, initially unable to think of any good associations, and was surprised at how many exciting concepts the theme held. I settled on a game about unearthing buried pirate treasure.</p>\n<p>I was surprised at how simple it was to implement the digging mechanic for the game, though moving from testing a mechanic into a proper game is always more time-consuming than I'd like during jam settings. Things like adding a main menu and credits always take more time than expected, as does building and uploading.<br/></p>\n<p>I had a couple of ideas for how to flesh the game out more - the first was to turn the game into a wave-based shooter where the player can dig up ammo, weapons and powerups in between waves. Perhaps enemies could even be hindered by the deformed terrain. <br/></p>\n<p>The other idea was to take what the game is currently and add a timer mechanic, where a tsunami was approaching the play area and the player had to find keys for their motor boat to escape. For that to make more sense I'd like to have added some more levels - I was thinking of a second level that would take place at a rocket-launching platform where a meteor was heading towards earth and the player had to find keys for the rocket to escape. A final level was to take place on the moon, with the player escaping some galaxy-ending event or entity by going through a dimensional portal, of course unlocked by using a key that's buried somewhere in the area.<br/></p>", "metacritic": null, "released": "2021-01-31", "tba": false, "updated": "2021-02-01T08:29:14", "background_image": "https://media.rawg.io/media/screenshots/633/633d3d5c01ad407a191024c11469363e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 15, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["JimmyHaglund"], "genres": [], "publishers": [], "esrb_rating": null}