{"id": 551301, "slug": "cake-defender-phil", "name": "Cake Defender: Phil", "name_original": "Cake Defender: Phil", "description": "<p>This is my FIRST FINISHED game MADE WTH GODOT GAME ENGINE!</p>\n\n<p>Story: Phil's friend called: he wants Phil to bring a cake to his house from the bakery; Phil's friend is too busy taking care of something to do it himself. Phil startes to hesitate  becaus ehe knows what he will have to do to complete the task: he will have to go to the bakery, go through a village, then through a forest- full of crazy creature that are obsessed with cake,  and then cross a bridge, and finally reach George's house. Sounds simple, right? No, not really.  I will explain that later...</p>\n<p>Our Phil likes challenges, so he accepts his friend's request. Phil gets the cake from the bakery, and it is MASSIVE! Let me tell you...</p>\n<p>It is around 50 kg or 110 pounds, and Phil wasn't given a cart fromt he Bakery to use to move it to his friend's house. So, Phil pushes it, all the way to the village; all the way through the forest. Surprisingly, it seemed as if none of the creatures from the forest followed him. So, Phil kept going; he had one more step! Cross the bridge!</p>\n<p>Phil tries his best, but becomes fatique, just after pushing it near the other end of the bridge. Suddenly, Phil starts to hear growling behind him, so he turns around and sees the critters from the forest; THEY HAVE BEEN FOLLOWING HIM AFTER ALL! The critters growl and say, \"We want cake.\" And slwoly head for Phil and his cake.</p>\n<p>Somehow, Phil still has some energy left to fight the enemies. Also, by chance, he suddenly remembers that he put a shield on the cake right after getting the cake from the bakery; our silly Phil forgot that crucial fact. Now, your mission is to help Phil fight the enemies, so he can continue his journey: pushing the cake to his friend's house.</p>\n<p>Okay, that is all.</p>\n<p>Controls:</p>\n<p>WASD - To move Phil</p>\n<p>Space - To activate or deactivate the shield</p>\n<p>ESC - To quit the game (Only works after you press play ; when you are in the game. )</p><p>Music Used:  {Classic Carnivale} by Twin Musicom (twinmusicom.org)</p><p>Cake Defender OST (By me, GameConDev)</p>", "metacritic": null, "released": "2021-01-31", "tba": false, "updated": "2021-02-01T09:16:15", "background_image": "https://media.rawg.io/media/screenshots/470/4704a0ed3544607e4bd7add1e60a817c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 38, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["GameConDev"], "genres": ["Action", "Adventure", "Fighting"], "publishers": [], "esrb_rating": null}