{"id": 551460, "slug": "glitchpunk", "name": "Glitchpunk", "name_original": "Glitchpunk", "description": "<p>The gameplay of Glitchpunk is a feast for all fans of high-octane action, explosive shootouts and cyberpunk aesthetics. It is top-down action inspired by the classics of the genre, wrapped in a futuristic neon cloak. There’s plenty of guns, melee weapons and vehicles for you to choose from and cause havoc with. Experience frantic action and wild police chases while listening to futuristic beats on your stolen car’s radio.</p>\n<p>Run, hack, steal, drive, shoot and blast your way through the criminal underworld of the future. Make some friends, make even more enemies. Kill or be killed, even if it means killing everything you love.<br />\nWorld and Story</p>\n<p>But that’s not all: Glitchpunk’s dystopian streets, back alleys and skyscrapers are also stage for themes like transhumanism, xenophobia and religion as well as an all too human story about relationship, self-discovery and betrayal. The sex and drug infused world of the future raises many questions, only one thing seems certain: humanity is a matter of perspective.</p>\n<p>You are an android gifted with a special trait called &quot;glitch&quot;: It enables you to go against your programming. Set out to destabilize the tyrannical governments of the post-nuclear world, it&#39;s up to you to craft your own agenda. Across four unique locations filled tech-crazed gangs, drugged-up gangs and governed by ever-present megacorporations, take up contracts, earn money and upgrade yourself.</p>\n<p>Influence whether or not a gang leader stays on top of the food chain, or let heads roll. There might be something more for you to gain than just money: An ally, or a friend? Maybe even a lover.<br />\nKey Features<br />\nBrutal top-down action with a big arsenal of weapons to choose from<br />\nMany different ways of locomotion, including trains, tanks, motorbikes, buses, trucks and obviously tons of cars<br />\nFrantic police chases and up to 10 escalations of wanted-levels<br />\n12 gangs with their own stories, quests and culture<br />\n4 different cities, from the desert remains of the USA to cyberpunk Soviet Russia in a post-nuclear winter<br />\nMature story with several endings<br />\nRare artstyle mix of 2D sprites in 3D environment<br />\nIn-game radio with music by artists from all over the world, together with news stations and absurd commercials</p>", "metacritic": null, "released": "2021-08-11", "tba": false, "updated": "2023-03-18T07:25:29", "background_image": "https://media.rawg.io/media/screenshots/cd0/cd0a8419707a4d1cf1edc4c9c47f5905.jpg", "website": "http://darklord.pl/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 44, "toplay": 12, "playing": 1}, "playtime": 2, "achievements_count": 10, "ratings_count": 1, "suggestions_count": 311, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Dark Lord"], "genres": ["Action", "Indie"], "publishers": ["Daedalic Entertainment"], "esrb_rating": null}