{"id": 551484, "slug": "dread-sky", "name": "Dread Sky", "name_original": "Dread Sky", "description": "\n<p>This is the sixth day in a row you've done nothing but sit at home and watch TV.  There really isn't much else to do. You resolve to  go to the store tomorrow just to shake things up a bit. <br/></p>\n<p>As you start building a mental grocery list, an emergency alert from the National Weather Service interrupts the show you're watching.</p>\n\n<p>Something is coming, and it seems that even the NWS is not sure of what it is, or how severe it's going to be. Your county, along with several of the others surrounding it, are placed directly in its path.</p>\n<p>You begin to feel worried about the possibility of facing a natural disaster that you're not prepared to face. You wonder what the others in your small town are planning to do - are they prepared? Are they going to evacuate as advised?</p>\n<p>You decide to step outside for a while and consult with your neighbors before you pack your bags. After all, you don't even have a car right now. Maybe someone will give you a ride.</p>\n\n<p>Dread Sky is a first person horror/survival game, developed in Unreal Engine over roughly 20 days in January of 2021.</p>\n<p>In Dread Sky, you are tasked with surviving and escaping a small town after a natural disaster of inexplicable origin hits.<br/></p>\n<p>Something isn't right, though. The weather changed some things outside, as well as inside. Something's wrong with the neighbors. Something's wrong with their pets. Something's wrong with the trees. Are you still normal?</p>\n\n<p>CONTROLS:<br/><br/>WASD - Movement</p>\n<p>Shift - Sprint<br/></p>\n<p>E, F, or Left Mouse Button - Interact</p>\n\n<p>This game has roughly an hour of gameplay and two endings!</p>\n\n<p>WARNING: Game contains strong language and depictions of gore.</p>\n<p>Caution is also advised for players with photosensitive epilepsy - though efforts were taken to minimize the severity of flashing lights, some areas may still be hazardous.</p>\n\n<p>Players sensitive to infrasound or other low frequencies should take note, as anomalous space tends to exhibit these sounds. We are still working to research this phenomenon.<br/></p>", "metacritic": null, "released": "2021-01-30", "tba": false, "updated": "2021-02-01T10:05:31", "background_image": "https://media.rawg.io/media/screenshots/bfc/bfccbb184a2cacdc510132fe1abaf38e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 132, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["duckenheimer"], "genres": [], "publishers": [], "esrb_rating": null}