{"id": 551435, "slug": "perspective-itch-icysenpai", "name": "Perspective (itch) (IcySenpai)", "name_original": "Perspective (itch) (IcySenpai)", "description": "<p><em>As your childhood friend Suyika tries to painfully wake you up, threating a kiss if you don't, you feel something different... Something has changed since yesterday... As you go on with your day, you make new friends and have lots of fun... but then you encounter a strange dream which the character seems to be unable to remember... What happens next you ask? Why don't you play and find out...</em></p><p>\n</p><p><strong>WARNING-</strong></p><p>This game may contain scary scenes and is not suitable for those who are easily disturbed. The recommended age to play this game is 13 or above.</p><p><strong>C/N-</strong></p><p>This is only version 1.0 and I have only spent around a day working on it, so far the grammar/punctuation may be bad, also there is no music yet, and the game is only ~600 lines of code, hopefully, soon this game will be more interesting, right now it is just a preview, keep that in mind.</p>\n<p><strong>Credits- </strong><br/></p>\n<p>-https://itch.io/profile/sutemo (for the character art)</p>\n<p>-https://itch.io/profile/emily2 (for the character creator)</p>\n<p>-https://www.renpy.org/latest.html (for the software used to build the game)</p>\n<p>alphawolf111 - itch.io (for help with play testing and fixing bugs in first 300 lines of code)<br/></p>\n<p><strong>I AM ALSO LOOKING FOR ANY PEOPLE WHO CAN HELP ME CREATE CHARACHER SPRITES, BACKDROPS, PLAY TEST, AND SOME MORE STUFF YOU WILL BE CREDITTED ACCOURDINGLY IF YOU ARE INTERESTED ADD ME ON DISCORD</strong> (KarmaWasSnowedOn#4785) </p>", "metacritic": null, "released": "2021-01-30", "tba": false, "updated": "2021-02-01T09:49:49", "background_image": "https://media.rawg.io/media/screenshots/1f6/1f60a7fcb33efb039f2ec871b1bcaa31.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 177, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["IcySenpai"], "genres": [], "publishers": [], "esrb_rating": null}