{"id": 551439, "slug": "lofi-hip-hop-worlds-to-study-in", "name": "Lofi Hip Hop Worlds To Study In", "name_original": "Lofi Hip Hop Worlds To Study In", "description": "<p><strong>Welcome to a bunch of chill 3D worlds full of unique study spots with Lofi Hip Hop music and ASMR sounds. </strong></p>\n<p>You can explore them to relax while you take a break from studying. </p>\n<p>When it's time to study again, you can set a timer and put these worlds in the background. To help you focus, they will continue to provide relaxing sounds and beats with no ads. </p>\n<p>In these worlds, nothing is trying to hurt you.  You don't need to fight anything to win.  You set your own goals, and you can customize your own soundscape to help you meet them.   </p>\n<p>We are providing this version of the software on a pay-what-you can basis to support students and teachers engaged in remote learning during the pandemic.  Some players have compared it to the \"fidget toys\" they have on their desks to provide sensory breaks during long work sessions. </p>\n<p>---</p>\n<p><strong>Credits</strong></p>\n<p>This project  was designed and developed by Israel Jones and Matthew Hamilton<strong>, </strong>students at the University of Southern California's School of Cinematic Arts and Rossier School of Education.   Sound design is by Kaley Markes at the Berklee School of Music.  Music curation is by Israel Jones and Noah Brown from Berklee.  </p>\n<p>Our design is based on research about player experiences with mindfulness in Walden, A Game and the Headspace app. </p>\n<p>Special thanks to our professor Richard Lemarchand, our classmates in the Interactive Media and Games MFA class of 2022 cohort, and Lofi Geek, who provided much of the game's music.</p>\n<p>---</p>\n<p><strong>Contact us</strong></p>\n<p>You can email us at LoFiHipHopWorlds@gmail.com</p>\n<p>---</p>\n<p><strong>Tips and suggestions: </strong></p>\n<ul><li>If you want to listen to different music while still hearing the soundscape of these worlds, just press \"C\" and go to the Customize Audio menu.  You can turn down the music volume while keeping the effects volume at your desired level, and can open your own musical selection in a different window.  </li><li>The software should be windowed, not fullscreen by default.  If this is not the case on your computer, you can set it to windowed by pressing \"C\" and going to the Customize Graphics menu and checking the \"windowed\" checkbox.  This might also fix bugs with buttons that show up on some older Macs. </li><li>To avoid eye strain, remember to stretch your eyes every 20 minutes by looking at something at least 20 feet away for at least 20 seconds.  The software will remind you to stretch.  You might also want to use your computer's settings to adjust the screen brightness.</li><li>If you are playing on an older computer and you experience a lag in the navigation controls,  try pressing \"C\" to open the Customize Graphics menu, and then lower the resolution and graphics quality.  </li></ul>\n<p><strong>For Mac users:</strong></p>\n<ul><li>You may need to follow these instructions to authorize the game to run. </li><li>The software may ask for permission to access your Documents folder.  This because it is trying to save your preferences by creating a file there.  It is not accessing any of your files. </li></ul>", "metacritic": null, "released": "2021-01-30", "tba": false, "updated": "2021-02-01T09:51:53", "background_image": "https://media.rawg.io/media/screenshots/f47/f475c98a3b467cc1ee8ea6f281fa9283.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 216, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["LoFiWorlds"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}