{"id": 551602, "slug": "the-mausoleum-of-memory", "name": "The Mausoleum of Memory", "name_original": "The Mausoleum of Memory", "description": "<p><strong>When we lay down to sleep, our memories are consolidated and cataloged in the brain for later reference. But what happens to those memories that are lost during this process? Do they fade away never to be recalled again? Are they just filed into a different part of the brain that we do not yet know how to access? Do we really have memory at all, or is this all just a running simulation controlled by the machines that harvested our bodies as a power source? Of course not. These memories are collected and cataloged in The Mausoleum of Memory. </strong></p>\n\n<p>&lt;&gt;&lt;&gt;&lt;&gt;&lt;&gt;</p>\n\n<p><em>The Mausoleum of Memory</em> is an adventure locale for Troika!, the Other World's favorite fantasy RPG. The Mausoleum is a place <em>between</em> the spheres that one may visit on their travels across humpbacked sky. But wait, there's so much more! Included within the confines of a pair of mini-zines are the following:</p>\n<ul><li>Details on what one may find in The Mausoleum.</li><li>Loose goals to draw your intrepid party of adventurers in and connect them to a larger narrative structure (I know, I know, quite clever indeed).</li><li>A micro sized depthcrawl suitable for a session of play (who needs to spend hours just to prep an adventure when you can generate it at the table?).</li><li>A bestiary, with 6 new potential adversaries (or friends, as I have no tangible control over how you use them. Just know that I'll know.).</li><li>Some interesting ways to mess with your player's characters (with their explicit consent of course).</li></ul>\n\n<p>&lt;&gt;&lt;&gt;&lt;&gt;&lt;&gt;</p>\n\n<p>Instruction on the assembly of the mini-zine can be found here if arts and crafts are your thing. If not, the Folio Editions have been conveniently arranged for screen viewing. </p>\n\n<p>&lt;&gt;&lt;&gt;&lt;&gt;&lt;&gt;</p>\n\n<p><em>The Mausoleum of Memory</em> is an independent production by Josh Domanski and is not affiliated with the Melsonian Arts Council.</p>", "metacritic": null, "released": "2021-01-30", "tba": false, "updated": "2021-02-01T10:32:39", "background_image": "https://media.rawg.io/media/screenshots/6d1/6d19dbd220975b936aa7464e0e666121.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 54, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Unenthuser"], "genres": [], "publishers": [], "esrb_rating": null}