{"id": 551950, "slug": "squirt", "name": "Squirt", "name_original": "Squirt", "description": "<p>You're a squid. Fires have broken out around your tank and there's no fire department in sight. It's time to take things into your own two ... tentacles.</p>\n<p>This game is for the BlackthornProd Game Jam #3: Less is More</p>\n<p>I was inspired to create a conservation-themed game where the objective is using as little water as possible to get to the fires so you have enough left in the tank to put out the fires. It's a race to the finish! Good luck!</p>\n<p>Known Bugs / Improvements for when judging ends:</p><p>- Sound is wack. Plays too loudly and cacophonously. I recommend turning the sound down preemptively if you read this before playing.</p>\n<p>- strange ticking sound bug when jet is active</p>\n<p>- fires are too  hard to put out (and don't have a concrete feedback mechanism to show \"health\")</p>\n<p>- jet power is loosely tied to framerate (rigidBody physics happening in update and not fixedupdate)</p><p>- Fires are too hard to find. Needs some sort of arrow/proximity indicator. Serves two purposes: 1. reinforce the purpose of the game, 2. prevent people from getting lost</p><p>- No outer boundary. There is a floor to the scene, but no walls or ceiling. This will allow the player to get lost into the endless void. With a limited water supply, however, this should be a very minor problem as the player will likely hit the game over screen in short order</p><p>- Hitting retry doesn't immediately reset your flame counter, so until you put out one fire, it will show the previous run's score</p>", "metacritic": null, "released": "2021-01-29", "tba": false, "updated": "2021-02-01T11:59:57", "background_image": "https://media.rawg.io/media/screenshots/8ed/8ed4a87566d4bb45e360db6f31d8d210.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 55, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["parkernalch"], "genres": ["Action"], "publishers": [], "esrb_rating": null}