{"id": 551909, "slug": "dr-maniacals-monster-maker", "name": "Dr. Maniacal's Monster Maker", "name_original": "Dr. Maniacal's Monster Maker", "description": "<p>Made for BlackthornProd Game Jam 3 (2021 - Theme \"Less is More\")</p>\n<p>IF YOU CAN, PLAY THE WINDOWS DOWNLOADABLE VERSION - THE WEBGL VERSION HAS SOME AUDIO AND VISUAL COMPROMISES</p>\n<p>So, when I first saw the theme, I saw two ways to go about it. The first is the way which I think was intended: to go for design by subtraction, as Noa mentioned, like the GMTK video about <em>Ico </em>described. However, I decided to go for a second way - Focus on the drawbacks of complexity. This game focuses on the theme through it's story, and the over-complex custom monster's effect on the gameplay.  As more and more parts are added, the feel that I was going for was the player going from an apex predator, flying across the screen and defeating hundreds of knights before death, to a sluggish, slow, heavy cobble of parts. Let me know how you think I did on that!</p>\n<p>I went into this game's development with a few goals in mind: first was that I wanted to have a full soundtrack with sound effects, as I usually don't have time for that. I also wanted it to be adaptive, and add instruments as different conditions are met. Another goal, after I had the game concept, was to make a cool wheel for monster selection, and to make the monster selection make an actual composite monster and not just be \"choose what it looks like, then abilities.\" I'm really happy about how it turned out, given that I achieved all of these goals!</p>", "metacritic": null, "released": "2021-01-29", "tba": false, "updated": "2021-02-01T11:48:08", "background_image": "https://media.rawg.io/media/screenshots/47d/47d7b8599418f6b880a592d8d50245d9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 11, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["GipMedia"], "genres": ["Action", "Fighting", "Platformer"], "publishers": [], "esrb_rating": null}