{"id": 552641, "slug": "crow-story", "name": "Crow Story", "name_original": "Crow Story", "description": "Jump, dive, fly, and platform as the cute little crow, Kuroh, as he goes on a quest to save his friends. Progress through a series of levels in this 3D platformer to reach the top of the tower and discover the mysteries of the Celestial Owl and the fate of Kuroh's friends.<br/><br/><h3>Pure Platforming</h3><ul><li>Utilize a simple two-button control scheme to Jump and Dive in order to navigate platforming obstacles and puzzles.<br/></li><li>Use platforming elements such as moving platforms, jump pads, and spinning disks to find new and creative ways to navigate the world.<br/></li><li>Each level features new obstacles to hinder you and mechanics to challenge you.<br/></li><li>Find shortcuts using tricks such as B Hopping and momentum to master the environment as you progress.</li></ul><br/>Be warned - the journey to the top will not be easy. Though checkpoints and fast respawns will keep you going, each section requires precise movement and quick thinking.<h3>A Minimal Adventure</h3>Uncover the story of Crow Story through a minimalist-style narrative with no dialogue or spoken words.<h3>Features List</h3><ul><li>8 beautiful levels<br/></li><li>Boss fight<br/></li><li>Several unlockable skins<br/></li><li>Story sequence cutscenes<br/></li><li>Platforming-based obstacles and challenges<br/></li><li>Totally intended shortcuts for you to find</li></ul><br/>", "metacritic": null, "released": "2021-01-29", "tba": false, "updated": "2021-12-27T03:24:38", "background_image": "https://media.rawg.io/media/screenshots/983/983bb00089289b35360d1c6b0a467649.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 70, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Vincent Prom"], "genres": ["Adventure", "Casual", "Indie", "Platformer"], "publishers": ["Vincent Prom"], "esrb_rating": null}