{"id": 552618, "slug": "the-night-in-a-village", "name": "The Night in a Village", "name_original": "The Night in a Village", "description": "<p><strong>The Night in a village</strong> is a wave-shooter with snowball-fight mechanics. Your ammo just under your feet. Make, aim and throw as far as you can!<br/></p>\n<p>Your main goal would be to help Santa Claus to fight against snowmen. For some reason, they stopped helping him and suddenly attacked right before Christmas...</p>\n<p>During ~30 min of gameplay, you will need to bring Santa back to life. Help him get his belongings and also… yes… save Christmas!</p>\n<p>Don't forget to explore the local area… Because Santa is not the only one who lost his staff. Your hat and ultimate-super-universal belt bag are missing too!</p>\n\n<p><strong>What you will get</strong></p>\n<ul><li>Interesting snowball-fight mechanics</li><li>3 types of enemies</li><li>~30 min of gameplay, 5 stages</li><li>Game progress saved via Checkpoints</li><li>EPIC finale</li></ul>\n\n<p><strong>Word from creator</strong></p>\n<p>I started developing this game in November of last year. I have set a goal for myself to make a heart-warming and kind “greetings card game” before the end of 2020th. This idea came to me because of lockdown and all the events that we will not forget for a long time.</p>\n<p>When you can’t meet your family or friends, a snowball fight is the last thing you will come up with for your spare time. But the idea of this simple amusement as something very friendly and uniting became the base for my game.</p>\n<p>Unfortunately, as a beginner developer, I didn't manage to make it right on time. This was my first experience building a finished product. From the menu to titles! XD</p>\n<p>On December 25th, on Christmas, I was planning to release the game for the Western audience… That day I've told myself - Don't worry, you have time till New Year!</p>\n<p>On December 31st, half of the visuals weren't done, also there was no sound at all. At this point, I felt sincere sympathy towards developers at CD Projekt RED!</p>\n<p>On January 7th - at Orthodox Christmas, I just couldn't release an unfinished game, without the final part of the story I was planning to make.</p>\n<p>And now after a couple of weeks, I release this game in hope that good intentions have no expiration date and you will have fun with it! Maybe you will smile at a couple of references (“easter eggs”) to my favorite games. Or you will enjoy general game mechanics. Or maybe you will be stunned by the finale of the game (I really hope, because I think it is great)</p>\n<p>In any case, THANK YOU for considering playing my game and I wish you a Happy New Year!</p>", "metacritic": null, "released": "2021-01-29", "tba": false, "updated": "2021-02-01T14:44:33", "background_image": "https://media.rawg.io/media/screenshots/32a/32a970bc18fdbd5647196bd56a6c429f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 252, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["runuchok"], "genres": ["Action", "Shooter", "Adventure"], "publishers": [], "esrb_rating": null}