{"id": 552788, "slug": "the-cursed-mage", "name": "The Cursed Mage", "name_original": "The Cursed Mage", "description": "<p>Once upon a time, there was a powerful wizard, he thought he was the most powerful wizard in his era, soon, he was consumed by pride and got arrogant. Months has passed,   challengers who came had all failed to defeat him. Then one day, a small mage came to challenge his position as the most powerful wizard, as usual he monologued about how great he is at magic and how no one was able to defeat him, but this time the challenger's reaction was different, he seemed to not understand what he was boasting about. The wizard got angry at the small mage's obliviousness and quickly started the duel. At first the wizard seemed to got the upper hand at the duel, but quickly realized how powerful the small mage was. Soon the prideful wizard was defeated.</p><p>Later,  the wizard planted a trap on the entrance of his land to curse whoever was a magic wielder to suppress one's power until they were hurt or damaged. Unfortunately, the small mage stepped on the trap just as the wizard planned. The wizard banished the mage to a forgotten land to trap him there for eternity so the mage wouldn't come back and threaten his rule over his kingdom.</p><p>You, as the mage must defeat the enemies that the wizard has summoned, collect the 5 holy emeralds to restore your ability to wield magic fully and confront the wizard to defeat his tyrannical rule once and for all.</p><p>The controls:</p><p>To move around, press WASD</p><p>to shoot magic, left click on your mouse.</p><p>I worked really hard on this project, so enjoy.</p>", "metacritic": null, "released": "2021-01-29", "tba": false, "updated": "2021-02-01T15:23:37", "background_image": "https://media.rawg.io/media/screenshots/c31/c31cf84a030bbdcb29fef6b316f00fa1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 8, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["EmeraldGamesStudios"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}