{"id": 552986, "slug": "the-best-bj", "name": "The Best BJ", "name_original": "The Best BJ", "description": "The Best BJ is a full featured Blackjack 21 simulator that not only pits you against a virtual casino Blackjack dealer, but also against other Steam users the world over as well as your Steam friends who own \"The Best BJ\" as well!  <br/>\n<br/>\r\nThe Best BJ offers features you'd only expect to see playing for real money in casinos or in much flashier and more expensive card games.  Play for fun, and put your BJ skills against your friends and global Steam users without worrying about not being able to pay your rent or car payment!<br/>\n<br/>\r\nIn \"The Best BJ\", you'll find the following options to you as you play:<br/>\n<br/>\r\nSPLIT YOUR HAND:  When you are dealt two cards of the same kind, you can choose to double your current wager to split the cards into two separate hands to maximize your profit potential!  (Important Note: The \"Split Your Hand\" functionality will allow you to split your hand up to four times if the opportunity presents itself and will not be available on launch, but expected to be in and working with an update within 30 days after launch in version 1.0 +)<br/>\n<br/>\r\nDOUBLE DOWN:  Seeing yourself dealt two small cards can be initially scary, but when those two small cards total either 9, 10 or 11 points, you can risk double your wager for just one more card!  Surely a face card is bound to be dealt to you next right?  An exciting high risk, high reward game option for sure!<br/>\n<br/>\r\nINSURANCE PROTECTION:  Who would ever play a \"BJ\" game without the option to protect themselves?  Hopefully not you, and \"The Best BJ\" offers you the ability to buy insurance to recover those wagers when the dealer shows an ace right out of the gate!<br/>\n<br/>\r\nCHEATER PROTECTION:  With the ability to see other online Steam users balances updated in real time as you play, this game wouldn't be much fun if all those private profile haxx0rz could easily manipulate their own balance to whatever they desire!  Anti-cheat protection is built into this game to help prevent cheaters from ruling the high scores!<br/>\n<br/>\r\nEIGHT DECK SHUFFLED CARDS:  Not a card counter?  Neither are most of us, and using eight full card decks that are shuffled every time the cards go less than thirty cards means you'll experience truly random and unpredictable hands every time you play!<br/>\n<br/>\r\nNow that you've read all about this game, the only real question that remains is how good are you at BJ and are you ready to show the world your impressive BJ skills? . . . *playful wink*", "metacritic": null, "released": "2021-02-01", "tba": false, "updated": "2021-02-05T02:42:00", "background_image": "https://media.rawg.io/media/screenshots/897/89746bb682f9d652c1d0fc6be0667b9e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 51, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ZaxtorGameS"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["ZaxtorGameS"], "esrb_rating": null}