{"id": 552968, "slug": "nominal-2", "name": "Nominal", "name_original": "Nominal", "description": "<strong>Nominal</strong> is a couch co-op light-sim space game that puts you in the merciless cockpit of an alternate-history 1960's spacecraft. Your friends take on the roll of Mission Control. Unfortunately for you (the pilot), the Odyssey is a spacecraft built from bargain-bin parts, and it's unlikely the mission will be completed without any issues. <br/><br/>In the (inevitable) event of a failure, Mission Control holds the Odyssey spacecraft's Ship Operator's Manual, which details each of the ship's core and sub-systems, how they're wired up, and how to troubleshoot any potential problem. The pilot and Mission Control must work together in the face of certain death to ensure the Odyssey returns to a <strong>NOMINAL</strong> state before time runs out and the mission, and possibly your life, is forfeit.<br/><strong><h3>Best Played with Friends</h3></strong><br/>Nominal is designed from the ground up to be played with two or more players. It can be played either locally (couch-coop) or remotely through screenshare. Prepare for seriously fast-paced action, and enjoy only needing one copy of the game :).<br/><strong><h3>Fast-paced Procedural Survival</h3></strong><br/>Break out your crisis communication skills and hope that Mission Control isn't taking a coffee break. The Odyssey, while effective, is a troubled spacecraft, and things will go wrong. Each round, a random failure will occur, and you must work with Mission Control to solve it before the failure is irrecoverable, or the pilot meets a swift end.<br/><strong><h3>Highly Detailed Mechanical/Electrical Systems</h3></strong><br/>Every part of the Odyssey spacecraft has been meticulously thought out: starting with paper, and ending in the game. Every switch, button, and dial, belongs to a fully-simulated electrical system apart of a larger network of intertwining core and sub-systems. <br/><strong><h3>Thematically Accurate Operator's Manual</h3></strong><br/>Any vehicle, car, boat, plane, or spacecraft has an owner's/operator's manual. The Odyssey spacecraft is no exception. Carefully planned, the Odyssey Spacecraft Operator's Manual (available online and in PDF format) has been modeled after actual procedures manuals from Apollo-era craft. The Operator's Manual includes detailed diagrams, a bit of humor, and pre-launch, hazard, and emergency procedures, all done in an authentic 60's, government-funded style!<br/><strong><h3>Multiple Possible Failures</h3></strong><br/>There are over ten unique possible systems failures to overcome. Each failure has its own unique, detailed set of Emergency Procedures available to fix it. <br/><strong><h3>Environmental Hazards</h3></strong><br/>Systems failures are inevitable, but getting systems back online isn't the only thing to worry about. In the void of space, there are numerous environmental hazards to be aware of: oxygen and carbon dioxide levels, cabin temperatures. Do you have enough fuel to make it home, even if you do overcome a systems failure? You will need to keep all of these things in mind when troubleshooting any particular failure.<br/><strong><h3>Built with Expansion in Mind</h3></strong><br/>As a result of being built on a core of realistic electrical and mechanical systems, Nominal is fit for expansion in the future. Why have one craft when you could have multple? Why have one set of potential failures, when you could have two? Building upon the core gameplay experience will be easy moving forward, ensuring variety and new challenges in the future.<br/><strong><h3>Independently Developed</h3></strong><br/>Nominal is completely developed by a single developer (me) without any ties to publishers or external contractors. As a result, Nominal is free to be a fluid and evolving experience. An available Discord and Twitter ensures players can voice their feedback easily. No good-faith feedback will go unanswered.<br/><strong><h3>Looking Forward:</h3></strong><br/>With the potential Nominal's core systems provide, there's lots of room for further innovation. Here are some of the planned long-term features:<br/><br/><ul><li>Support for Linux and Mac OS devices<br/></li><li>Additional localization for the game and for the manual<br/></li><li>Additional Ships and Controls Layouts<br/></li><li>Additional failures and environmental hazards<br/></li><li>VR Support</li></ul>", "metacritic": null, "released": "2021-02-28", "tba": false, "updated": "2021-02-05T02:30:48", "background_image": "https://media.rawg.io/media/screenshots/946/9463794edd49071686cd1ca85691fa8d.jpg", "website": "https://offworldsystems.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 133, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Offworld Systems"], "genres": ["Action", "Simulation", "Indie"], "publishers": ["Offworld Systems"], "esrb_rating": null}