{"id": 55294, "slug": "puyo-puyo-tsu", "name": "Puyo Puyo Tsu", "name_original": "Puyo Puyo Tsu", "description": "<p>Puyo Puyo Tsu (ぷよぷよ通, Puyo Puyo Tsū, also known as Puyo Puyo 2, Puyo Puyo Tsuu or Puyo Puyo 2: Tsuu) is the second installment of the Puyo Puyo games; the sequel to Puyo Puyo, made in 1994 by Compile. Compile put more thought into this game after its predecessor became successful, but never knew how much of a turnaround the game would bring.<br />\nDue to its highly acclaimed success, it became the most predominant game of the series. Though with many of its rules being experimental, the ability of Sousai and Rensa Sibari became a top hit immediately, thus creating longer matches for better gameplay. Also due to its successes, it became the most widely known multiplatform game in Japan, appearing in the Arcade, on major domestic consoles, on major handhelds, on the NEC PC-9800 series, on the PC, and on others.<br />\nThe name of Puyo Puyo Tsu derives from an English pun, as &quot;tsu&quot; (通, tsū, meaning Expert) when spoken aloud sounds similar to the English word &quot;two&quot;. Compile continued this pun for Puyo Puyo SUN and Puyo Puyo~n.</p>", "metacritic": null, "released": "1994-07-06", "tba": false, "updated": "2023-02-08T10:41:51", "background_image": "https://media.rawg.io/media/screenshots/d6c/d6c0d64d2e36cddb69c74ce47ba5ae9d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 4, "beaten": 2, "toplay": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 262, "game_series_count": 17, "reviews_count": 1, "platforms": ["PC", "Nintendo 3DS", "Wii", "Neo Geo", "Game Boy", "PlayStation", "Classic Macintosh", "Game Gear", "SNES", "SEGA Saturn", "Genesis"], "developers": ["SEGA", "Compile", "Bits Laboratory", "Goo!"], "genres": ["Puzzle"], "publishers": ["SEGA", "SNK", "Bandai", "PAL", "Japan", "NEC", "Compile"], "esrb_rating": null}