{"id": 552959, "slug": "elios-vr", "name": "ELIOS VR", "name_original": "ELIOS VR", "description": "<h3>synopsis</h3>Elios has always been a rich, vibrant and peaceful place. That was the case until the exceptionally bright “moon” appeared. From the time people began to call the door “the portal of the alien world,” the monsters of the alien world began to appear on the earth, literally, through the door, as they have never seen before. We started a war for survival with those monsters without even having time to think about where this gate came from and how long it would last. Sometimes, giant monsters appear through the door, and these giant monsters were difficult to deal with alone, and we needed heroes to deal with these giant monsters. The heroes of our world cannot die arbitrarily or unwillingly during the time contracted with this earth. However, for a while, the soul escapes, and the hero's mysterious ability that was sealed during such time can be used, and with the activities of these heroes, he is confidently protecting this land from monsters in the alien world.<h3>Character</h3>- Basic Class<br/><br/>Article: Protecting party members on the front line with one-handed weapons and shields.<br/>Archer: Powerful rearward attack with distant bow<br/>Wizards: Attack and support with different kinds of magic<h3>Contents</h3>- Elios is divided into 5 fields and monsters with various personalities appear.<br/><br/><br/>-You can enjoy the game while progressing through various types of quests.<br/><br/>- Attack method by class<br/>* Sword swing action<br/>* Arrow shooting action<br/>* Action to draw runic shape when enchanted", "metacritic": null, "released": "2021-02-01", "tba": false, "updated": "2021-02-05T02:26:19", "background_image": "https://media.rawg.io/media/screenshots/3d6/3d6184e3514dcd3605c7d54eba6cd1f5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 358, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["FINGEREYES"], "genres": ["Action", "Massively Multiplayer", "Indie"], "publishers": ["FINGEREYES"], "esrb_rating": null}