{"id": 552909, "slug": "game-jam-eii-why-without-explanation-equipo-lolo", "name": "Game Jam EII - Why? Without Explanation - Equipo LoLo", "name_original": "Game Jam EII - Why? Without Explanation - Equipo LoLo", "description": "<p>AVISO: El ejecutable del juego no funciona (nos saltó un error a última hora y no pudimos arreglarlo) pero en el video se ve como tendría que ser.</p><p>------------------------------------------------------------------------------------------------------</p><p>En un dia tal 22 de enero del duomilesimo vigesimo primer año de la era de nuestro señor, nuestras mercedes decidimos embarcar en lo que mas tarde mirariamos, con tanto nostalgia como pena, como un viaje inolvidable de las mas altas caracteristicas.</p>\n<p>Aqueste videogioco que decidimos hacer, consistiase en un bloque que se iba moviendo por un mapa cuadriculado. Tal era su suerte, que al chocar con bloques de color, adquiria tanto este color, como nuevas y fascinantes propiedades, que le ayudarian en sus aventuras. El noble objetivo del cubo, entregado de la mismisima mano de dios, y traido a el mediante varios coros de angeles cantando nanas celestiales, seria apretar todos los botones cilindricos del mapa, en un orden secreto predicho por nuestro Señor.</p>\n<p>Mas, ¡Desastre! El mundo pacifico en el que vivia nuestro cubo cayo sumido en la miseria, y varios monstruos aterrorizantes conocidos como \"IndexOutOfBoundsException\" o \"Key not present on Dictionary\" amenazaban con la simulada vida de nuestro magnifico amigo. Tal fue asi, que su vida no pudo ser salvada. Mas no desespereis, queridos lectores, pues parte de su legado pudo ser recuperado, y aqui lo presentamos, a plena luz, sin trampa ni carton, tal y como fue, para que quede grabado en los anales de la historia, y para el disfrute de vuesas mercedes.</p>\n<p>-Lo</p>\n<p>--------------------------------------------------------------------------</p>\n<p>Ante vuestras mercedes vengo a narrar<br/>la historia de una Game Jam,<br/>una odisea sin igual,<br/>vivida por Mario y Nicolás.</p>\n<p>Habían nuestros apuestos concursantes,<br/>diseñado un juego alucinante,<br/>puzles apabullantes,<br/>con colores deslumbrantes.</p>\n<p>Pero con un obstaculo fueron a topar,<br/>nuestros valientes héroes llegando al final.<br/>Por oscuras fuerzas que no les querían ver ganar.<br/>Misteriosamente, Unity dejó de funcionar.</p>\n<p>Harta tragedia les acometió,<br/>buscaron cualquier solución,<br/>pero para su absoluta desazón,<br/>ninguno de los dos remedio encontró.</p>\n<p>Así es, que presentan ante el jurado,<br/>este video, que esperan, sea de su agrado.<br/>Saben que la victoria es solo algo soñado,<br/>así que le desean buena suerte al resto que haya concursado.</p>\n<p>-Lo</p>", "metacritic": null, "released": "2021-01-28", "tba": false, "updated": "2021-02-01T15:52:11", "background_image": "https://media.rawg.io/media/screenshots/4f2/4f2c3b7c97ed1fe594ed91097bd24cf9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 10, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["mrlozano"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}