{"id": 553034, "slug": "double-world-cave-song-castle", "name": "Double world. cave song castle", "name_original": "Double world. cave song castle", "description": "Do you believe that in the city where you live, in those dark places, beside you, there are things that break common sense?<br/><br/>It is man-made that a city happened an confused accident in a sudden?<br/>Whether the unknown thing existed in the darkest of the world.<br/>Superpower, monster, magic may be right by our side.<br/>In the dark, the ‘monsters’ from the different world, organized to investigate the unknowns.<h3>——————————Introduction to the game——————————</h3><br/>Look at the screenshot can know, this is a horizontal version of 2D fighting game.<br/>But strictly speaking, it can't be regarded as an action fighting game. After all, there are so few actions.<br/>The difficulty of the game is divided into three modes: easy, normal and hard, and it is also divided into plot mode and no plot mode, with a total of six play modes.<br/><br/><strong> Developer's recommendation: [/ b]<br/>If you only want to watch the plot, you can choose easy plot mode to play.<br/>Just want to play the game of optional normal no plot mode to play.<br/>Want to challenge the optional hard no plot mode to play.<br/>It's better to follow the advice. After all, you can't skip the plot. If you put yourself at risk to choose the hard mode, some of the testers will called you daddy.<br/><br/><strong> Game features: [/ b]<br/>The author plays fewer games, so I don't know what features can be said. Here are some unique ones<br/>——Three way attack: they are \"up\", \"middle\" and \"down\". The W and s keys can adjust the attack direction.<br/>——Tired death mechanism: in addition to movement and stillness and triggering, the object controlled by the player will consume physical strength no matter what he does. If the physical strength is exhausted, he can continue to play, but will let his health replace his physical strength.<br/>——Somersault mechanism: This is an unintentional feature / bug. The combination of Ctrl roll and space jump can form a \"somersault\" action.<br/>The rest of the mechanisms are not unique, such as the property panel. I won't list them here.<h3>——————————characters introduce——————————</h3><br/><br/><br/><h3>——————————Q &amp; A——————————</h3><br/>Q: The store display supports English. Why is it still Chinese after entering the game?<br/>A: Click option in the lower right corner to find the \"语言\" option and switch to English.</strong></strong>", "metacritic": null, "released": "2021-02-03", "tba": false, "updated": "2021-02-05T03:16:31", "background_image": "https://media.rawg.io/media/screenshots/5f1/5f14b38e41ab3f0562a476606c4aa13d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 72, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ender里特莫"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Ender里特莫"], "esrb_rating": null}