{"id": 553170, "slug": "organic-matter", "name": "Organic Matter", "name_original": "Organic Matter", "description": "<p>Русская страница игры: https://chentzilla.itch.io/organic-matter-rus</p>\n<p>At the end of the year 2143 there were more than a hundred big laboratories in space, researching and creating new organic matters. Thousands of people worked on this project for a long time, but haven't achieved much. The government started to close those starlabs because of their low profitability, turning them into giant space wanderers.</p>\n<p>And on one of those abandoned stations, an accident happened: a short circuit activated the life support system of a mutant that was bred on the station. It became alive. It was incredible. And from this moment, the troubles for humanity started.<br/>The mutant possessed an exceptional intelligence, since a dead scientist's brain was transplanted into his head. Single-handedly, he repaired the station and turned it into a battleship. He also started to create more mutants like himself. This battleship became the nemesis of all trade vessels.<br/>In this situation, the Earth Government decided to destroy this ship. To do this, its energetic power source needs to be disabled and all mutants have to be destroyed. This task is assigned to you. You are teleported to the station. Go on! Good luck!</p>\n<p>==</p>\n<p>Organic Matter is a game for ZX Spectrum. See install instructions for details.</p>\n<p>==</p>\n<p>Controls: </p>\n<p>KEYBOARD – press 1 in the main menu<br/>Q – left<br/>W – right<br/>Y – talk/use/cursor down in menus<br/>U – jump/cursor up in menus<br/>I - fire/select</p>\n<p>SINCLAIR – press 2 in the main menu<br/>6 – left<br/>7 – right<br/>8 – talk/use/cursor down in menus<br/>9 – jump/cursor up in menus<br/>0 - fire/select</p>\n<p>==\r\n</p>\n<p>A game by Ilya Chentsov and Fyodor Chentsov<br/>Extra code by Kees van Oss <br/>Created with Multi-Platform Arcade Game Designer by Jonathan Cauldwell<br/></p>\n<p>Made in Gorokhovets</p>", "metacritic": null, "released": "2021-02-04", "tba": false, "updated": "2021-02-05T04:21:30", "background_image": "https://media.rawg.io/media/screenshots/8f0/8f04a59e8aa15417cdf9271caba60d1f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 89, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Chentzilla"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}