{"id": 55322, "slug": "adventure-construction-set", "name": "Adventure Construction Set", "name_original": "Adventure Construction Set", "description": "<p>Adventure Construction Set (ACS) is a program written by Stuart Smith that is used to construct tile-based graphical adventure games. ACS was originally published by Electronic Arts (EA) in 1984 on the Commodore 64, and was later ported to the Apple II, Amiga and MS-DOS platforms. It was one of EA&#39;s biggest hits of 1985, earning an SPA &quot;Gold Disk&quot; award.<br />\nACS provided a graphical editor for the construction of maps, placement of creatures and items, and a simple menu-based scripting to control game logic. A constructed game was stored on its own disk which could be copied and shared with friends, but for some ports (such as Amiga) the ACS software was still needed to play user-constructed games.<br />\nIncluded with the system was a complete predesigned game called Rivers of Light, which was based on The Epic of Gilgamesh. It featured art by Smith and Connie Goldman and music by Dave Warhol (Goldman and Warhol also provided art and music respectively for Racing Destruction Set). The Amiga version of ACS featured art by Greg Johnson and Avril Harrison, and an additional pre-made adventure called &quot;Galactic Agent&quot; by Ken St Andre which was exclusive to that platform.<br />\nTitles influenced by ACS include The Elder Scrolls Construction Set. Project lead Todd Howard had stated, &quot;When we started Morrowind, I was really excited about making a tool like &#39;Stuart Smith&#39;s Adventure Construction Set for the Apple 2&#39;. I even used part of the name.&quot;</p>", "metacritic": null, "released": "1984-06-30", "tba": false, "updated": "2023-02-08T10:51:46", "background_image": "https://media.rawg.io/media/screenshots/f61/f61b2256f5315d4ef624e36a17876503.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 245, "game_series_count": 0, "reviews_count": 1, "platforms": ["Commodore / Amiga", "Apple II", "PC"], "developers": ["Stuart Smith", "Glen Tenney", "Fantasia Systems"], "genres": ["Adventure"], "publishers": ["Electronic Arts"], "esrb_rating": null}