{"id": 553386, "slug": "undivine-comedy-hanks-inferno-demo", "name": "Undivine Comedy: Hank's Inferno [DEMO]", "name_original": "Undivine Comedy: Hank's Inferno [DEMO]", "description": "<p><strong>Kickstarter coming soon!</strong><br/><br/>Undivine Comedy: Hank's Inferno is a game about the struggle that a set of characters experience while trying to escape from Hell. UCHI features rogue-lite styled gameplay combined with humor and rich storytelling.<br/></p>\n<p>Pirate ship Sheila was just destroyed by a kraken and all the crew eaten. The pirates find themselves in Hell, longing for a way out. Each character will have to face his own hell during the hopeful escape.<br/>Hank's an innocent pirate. He's not the most intelligent person in the group but strives to be useful. He's married to Mary and has an antagonizing relationship with his mother-in-law Molly.<br/><br/><br/>Mr. Mean is a man of few words. Charismatic and arrogant, he believes himself superior to the rest of the crew. But is he really? What's his past hiding?<br/><br/><br/>Mary is the captain of the pirate ship Sheila. Daughter to Murderin' Molly, she also has a quick temper. While everyone finds her capable, she often doubts herself.<br/><br/><br/>Molly was the former captain before her daughter took over the title. She enjoys destruction and is easily angered by mundane stuff. While she has a bitter attitude towards everyone, she has a soft spot for her children.<br/><br/><br/><br/><br/><br/><br/><br/><br/></p>\n<p><strong>Character relationships and passions</strong></p>\n<p>Characters have their own desires. Friends love to help each other but enemies... Well, they don't. You can decide who to trust or who to screw over. But remember, people have feelings.</p>\n<p><strong><br/>Combat</strong></p>\n<p>Fast-paced combat full of interactive actions, such kicking enemies into walls to make more damage.  You can freeze, shock, melt or send them to fly with real insults, because in Hell, words have power. Dodge, parry and overkill dozens of enemies with one attack. Each attack raises your rage bar and combo meter.</p>\n\n<p><strong>Insults</strong></p>\n<p>There are three schools of insults in Hell: Peculiarity, Stupidity, Worthlessness and Cattiness. Each one of it is like a magic spell but it's cast with, well, authentic real insults. Insults take rage to be casted.</p>\n\n<p><strong>Boss Form</strong></p>\n<p>Each Character has a unique Boss Form Transformation, just a stronger, faster and better version of themselves. Some will get more weapon power and other wil get... extra tentacles? You need to be full rage to activate the Boss Form.</p>\n\n<p><strong>Upgradable Equipment</strong></p>\n<p>Craft equipment and upgrade it to make your character even more powerful. You will need materials from the dungeons to keep upgrading.</p>\n\n<p><strong>Dungeon PowerUps</strong></p>\n<p>Through the exploration of a dungeon you can encounter rooms with puzzles to resolve and chests to open. Each chest has a powerful scroll that randomly powers-up one trait of your character during your  dungeon run, it's accumulative and can take you to take another strategy to combat.</p>\n\n<p><strong>Play with a friend</strong></p>\n<p>Connect two gamepads and play with your friends at any moment of the game.<br/></p>", "metacritic": null, "released": "2021-02-04", "tba": false, "updated": "2021-02-05T05:15:40", "background_image": "https://media.rawg.io/media/screenshots/019/0194fab77b1ed4b11d73e2f8610ad398.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 187, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["NoobO Games"], "genres": ["Action"], "publishers": [], "esrb_rating": null}