{"id": 553407, "slug": "nuts-noodlecake-pol-clarissou-torfi-joon", "name": "NUTS (Noodlecake, Pol Clarissou, Torfi, Joon)", "name_original": "NUTS (Noodlecake, Pol Clarissou, Torfi, Joon)", "description": "\n<p>Gear up your caravan, boot up your GPS, spread out your map and head for the depths of Melmoth Forest. As a rookie field researcher, you’ll place cameras during the day, and watch the footage at night, tracking the movements of a scurry of squirrels.</p>\n<p>Where do they hide their nuts? What puzzling routes do they take? And why do they behave so strangely?</p>\n<p><strong>Includes</strong></p>\n<ul><li>Gameplay based around surveillance and tracking</li><li>An immersive story with full voice acting</li><li>Bold visuals and foley sound effects envelop the player in a vibrant forest</li></ul>\n\n<p><strong>ARRANGE YOUR CAMERAS</strong></p>\n<p>Your mission briefing will give you a starting point, but it’ll be on you to determine the optimal layout for your equipment through trial and error. Explore the wonders and mysteries of the enigmatic Melmoth Forest at your ease during daytime, until night falls…</p>\n\n<p><strong>ANALYZE YOUR FOOTAGE</strong></p>\n<p>… when you can review all of the content you captured in your DIY control center. Comb your footage for the information needed to complete your mission and send proof to your boss Dr Nina Scholz back at the research institute. With both of you on the case, maybe you can figure out what’s really going on?</p>\n\n<p><strong>GET TO WORK</strong></p>\n<p>You are a tiny cog in the ever-grinding machinery of Viago University’s research efforts. You’ve been sent on assignment to live alone in a dinky caravan in Melmoth Forest. Your job? To figure out where the native squirrels nest and what mysterious business they get up to.</p>\n<em>NUTS is a narrative surveillance adventure with a bold visual style,<br/>made by Joon, Pol, Muuutsch, Char &amp; Torfi  <br/>with help from Marín, Freya, Kalonica and Ronja; <br/>and published by Noodlecake.<br/>\r\nMore links and press kit on the official website nuts.game.</em>", "metacritic": null, "released": "2021-02-04", "tba": false, "updated": "2021-02-05T05:20:00", "background_image": "https://media.rawg.io/media/screenshots/d1a/d1a05caed66caebb652aade34d3d0cae.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 207, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Noodlecake", "Pol Clarissou", "Joon", "Torfi"], "genres": ["Adventure", "Simulation"], "publishers": [], "esrb_rating": null}