{"id": 553516, "slug": "space-tyranny", "name": "Space Tyranny", "name_original": "Space Tyranny", "description": "<p>Originally released on GameJolt in 2018!</p>\n<p>The planet Delrone has been under attack by the Zirgols for years, and during those years, many Delronians cried in fear and asked someone for help. Planet Earth has heard their words of fear and sent a robot hero named Terabotron, whose mission is to destroy the Zirgols and protect the Delronians.</p>\n<p>The game has you take control of Terabotron in a Metroid-style environment where you have to find the way inside the core of the Zirgol planet by collecting item upgrades along the way that will help you progress through the planet.</p>\n<p>The game features a Story Mode plus 2 extra time trial modes, Time Mode and Time Mode +.</p>\n<p>In Story Mode, you start a new game or load a saved game and must play through the game by collecting the item upgrades and make it to the end to defeat the Zirgols.</p>\n<p>In Time Mode, you start off with none of the item upgrades and you must try to find them all while completing the game as fast as you can for a new time record. This mode will not affect your saved data from Story Mode.</p>\n<p>In Time Mode +, you start off with the collected item upgrades from Story Mode where you must complete the game as fast as you can for a new time record. Any new item upgrade collected in this mode will be saved on Story Mode.</p>\n<p>Controls:<br/>Arrow Keys: Move<br/>Shift: Jump<br/>Z: Shoot<br/>P: Pause Game<br/>R: Exit to Menu<br/>ESC: Exit Game</p>\n<p>*WARNING*: If your computer detects the game as a virus, please do the following. Firstly before you download it, make sure to exclude your browser's downloads folder from being scanned by your anti-virus software as well as the location where the game will be stored. That way so your anti-virus won't be able to scan any excluded areas where the game will be contained. Believe me, I had to do it too...</p>\n<p>Enjoy!!!</p>\n<p>Game by BigAl0104<br/>Created with Clickteam Fusion 2.5<br/>Sprites created with the Clickteam Built-In Image Editor</p>", "metacritic": null, "released": "2021-02-03", "tba": false, "updated": "2021-02-05T05:47:34", "background_image": "https://media.rawg.io/media/screenshots/5a1/5a172b3c2c5e67f028eaa0f47f8745ec.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 260, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Android"], "developers": ["BigAl0104"], "genres": ["Action", "Adventure", "Platformer"], "publishers": [], "esrb_rating": null}