{"id": 55357, "slug": "bionic-commando-1987", "name": "Bionic Commando (1987)", "name_original": "Bionic Commando (1987)", "description": "<p>Bionic Commando, originally released as Hitler&#39;s Resurrection: Top Secret (ヒットラーの復活 TOP SECRETトップシークレット, Hittorā no Fukkatsu: Toppu Shīkuretto) in Japan, is a platform game released by Capcom for the Family Computer and Nintendo Entertainment System in 1988 It is based on the 1987 arcade game Bionic Commando.<br />\nThe game was advertised in the United States as a sequel to Commando, going as far to refer to the game&#39;s main character as Super Joe (the protagonist of Commando) in the promotional brochure, who was originally an unnamed member of a &quot;special commando unit&quot; in the Japanese and World versions.<br />\nThe protagonist of the game is a commando equipped with a bionic arm featuring a grappling gun, allowing him to pull himself forward or swing from the ceiling. The series is notable for being one of few instances of a platform game in which the player cannot jump. To cross gaps or climb ledges, the hero must use his bionic arm. This was the first game to feature a grappling gun/hook, which later appeared in games such as Batman The Movie, Earthworm Jim and Tomb Raider.</p>", "metacritic": null, "released": "1987-03-01", "tba": false, "updated": "2023-02-08T10:50:58", "background_image": "https://media.rawg.io/media/screenshots/303/303013c31b51d7164eda306b001d75b0.jpg", "website": "", "rating": 2.75, "rating_top": 3, "added_by_status": {"yet": 2, "owned": 15, "beaten": 6, "toplay": 4, "dropped": 4}, "playtime": 0, "achievements_count": 0, "ratings_count": 8, "suggestions_count": 402, "game_series_count": 4, "reviews_count": 8, "platforms": ["Commodore / Amiga", "Atari ST", "Game Boy", "PC"], "developers": ["Capcom", "Software Creations"], "genres": ["Action"], "publishers": ["Capcom", "GO!"], "esrb_rating": "Everyone 10+"}