{"id": 553690, "slug": "sumo-balls-lewis-stephens", "name": "Sumo Balls (Lewis Stephens)", "name_original": "Sumo Balls (Lewis Stephens)", "description": "<p>In this Unit of Create with Code, I had to program an arcade-style Sumo battle with the objective of knocking increasingly difficult waves of enemies off of a floating island, using power ups to help defeat them. In creating this prototype, I learnt how to implement new gameplay mechanics, rules and systems that make the game more interesting to play. I learnt to program a powerup, which gives the player a temporary advantage, and increasingly difficult enemy waves, which make survival more challenging for the player. A good balance of powerups and increasing difficulty make for a much more interesting gameplay experience.</p>\n<p>After completing this project I am now able to:</p>\n<ul>\n<li>Apply Physics Materials to make game objects more or less bouncy\r\n</li>\n<li>Calculate new vectors to steer objects in custom directions\r\n</li>\n<li>Write more advanced custom functions and variables to make your code clean and professional\r\n</li>\n<li>Write informative debug messages with Concatenation \r\n</li>\n<li>Use IEnumerator and Coroutines to repeat and delay functions\r\n</li>\n<li>Use for loops to efficiently and dynamically run code multiple times\r\n</li>\n<li>Use SetActive to make game objects appear and disappear from the scene\r\n</li>\n<li>Use FindObjectsOfType to track the current number of objects in the scene\r\n</li><li>Use common logic structures to control the execution of code.</li></ul>", "metacritic": null, "released": "2021-02-03", "tba": false, "updated": "2021-02-05T06:33:25", "background_image": "https://media.rawg.io/media/screenshots/5ba/5babd6c4b156f3749d3a5ec8fe494031.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 8, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Lewis Stephens"], "genres": [], "publishers": [], "esrb_rating": null}