{"id": 553889, "slug": "clicky-crates-lewis-stephens", "name": "Clicky Crates (Lewis Stephens)", "name_original": "Clicky Crates (Lewis Stephens)", "description": "<p>In this Unit of Create with Code, I had to program a game to test the player’s reflexes, where the goal is to click and destroy objects randomly tossed in the air before they can fall off the screen. In creating this prototype, I learnt how to implement a User Interface into my projects. I added a title screen with a difficulty select menu that will control how challenging the gameplay is,  a score display that will track how many points the player has earned, and a Game Over screen, which will allow the player to restart and try again. In learning these skills, I am now able to create a fully “playable” experience that the user can enjoy from start to finish without having to restart the application to try it again.</p>\n<p>After completing this Unit, I am now able to:</p>\n<ul>\n<li>Create a Game Manager object that controls game states \r\n</li>\n<li>Detect where the user has clicked their mouse in order to create a click-based program\r\n</li>\n<li>Use the Canvas to create UI elements like a Title, Buttons, or score display\r\n</li>\n<li>Lock elements and objects into place on the UI with Anchors\r\n</li>\n<li>Use variables and script communication to update elements in the UI\r\n</li>\n<li>Make UI elements appear and disappear with .SetActive\r\n</li>\n<li>Use script communication and Game states to implement working “Game Over” screen\r\n</li>\n<li>Restart the game using a UI button and SceneManagement class\r\n</li>\n<li>Add listeners to detect when a UI Button has been clicked and trigger functionality \r\n</li>\n<li>Set difficulty of gameplay from title screen by passing parameters between scripts</li></ul>", "metacritic": null, "released": "2021-02-02", "tba": false, "updated": "2021-02-05T07:24:07", "background_image": "https://media.rawg.io/media/screenshots/b00/b00b2df6b17aa1d300d72fee34e984b9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 24, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Lewis Stephens"], "genres": [], "publishers": [], "esrb_rating": null}