{"id": 553920, "slug": "l1mb-0", "name": "L1MB-0", "name_original": "L1MB-0", "description": "<p>L1MB-0 is a game that was created for the global game jam 2021, under the theme 'Lost and Found'. </p>\n<p>L1MB-0 is a rogue-lite bullet hell game where you play as a robot on a mission to find an unidentified character. At the start of the game, the player knows they’re looking for someone, but it is never started who that is.<br/></p>\n<p>The main protagonist 'Bo' is a rusty robot that has been dysfunctional and decrepit for a while until they discover three other robots who are a more advanced version of the protagonist. These robots are also dysfunctional, and missing limbs with no way to recharge their battery. Throughout Bo's travels, they find different robotic limbs that correspond to each decrepit robot they find, but it is up to the player to gift those limbs back to their original owners or they can keep them for themselves to make Bo more powerful. If the player decides to give back the part (that clearly belongs to the robot they are interacting with) then they will get a limb in exchange that is a perfect fit for them (but weaker in spec). If a player doesn’t give the limb back then they keep the more powerful asset. In both scenarios, a way forward is presented by the decrepit robot NPC.</p>\n<p>These moral decisions will affect the type of ending the player unlocks. If the player keeps all of the upgraded limbs they will get a bad ending. If they give back the powerful limbs and accept their own limbs back, then they get a good ending. It will be a lot easier for the player to complete the level with the more powerful limbs but they will be making the wrong decisions morally (hence why they get the bad ending). If they accept their own limbs the game will be harder but they will get the good ending</p>\n<p>As this was a game made in 48 hours, only one of the 3 tiers was created, and all robots were put in the same tier to showcase the storyline and main mechanics</p>\n<p>We decided to use the diversified RNG - (randomise something that wouldn't usually be randomised). In L1MB-0, If the player dies they will be randomly spawned in one of the rooms within the tier.</p>", "metacritic": null, "released": "2021-02-02", "tba": false, "updated": "2021-02-05T07:30:55", "background_image": "https://media.rawg.io/media/screenshots/c8e/c8ea41736108e7d5d1c75a243b8fb2b2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 8, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["soupWench"], "genres": [], "publishers": [], "esrb_rating": null}