{"id": 554211, "slug": "nords-and-fjords", "name": "Nords and Fjords", "name_original": "Nords and Fjords", "description": "<p>Nords and Fjords is a short \"runner\" roguelite where you are traveling down a very long Fjord to reach the mystery that awaits at the end.</p>\n<p>Recruit lost Nords while on your journey who will help you reach the end. </p>\n<p>They all have special abilities that can come in handy in defeating the various obstacles in your way.</p>\n<p>Can you reach the end of the fabled Fjord?</p>\n\n<p>NOTICE:<br/></p>\n<p>If you have performance issues, please try the downloadable version of the game instead. The WebGL version has inherent performance issues because of the amount of geometry and shaders present within the game.</p>\n\n<p>INSTRUCTIONS:</p>\n<p>- Sail to the end of the fjord without dying!</p>\n<p>- Collect gold to buy things at the end of each round. You can buy upgrades and recruit Nords to help you. Different Nords have unique abilities that can help you along your journey.</p>\n<p>- Collecting gold will fill up your Algiz rune. Double click to activate it. Activating Algiz will protect you from all obstacles for a short time.</p>\n<p>- Certain Nords will increase your Algiz timer.</p>\n<p>- Getting hit will cause your boat to spring a leak. You must not take a hit for another 10 seconds while your boat is being repaired. Taking another hit will cause you to sink and end your journey!</p>\n<p>- Getting hit while your boat is leaking will cause one of your Nords to fall off into the water! Be careful!</p>\n\n<p>CONTROLS:</p>\n<p>- Mouse: Move around</p>\n<p>- Double-click: Activate shield power-up</p>\n<p>- Escape: Back/Exit game in Main Menu</p>\n\n<p>MORE INFO:<br/></p>\n<p>Website: https://lastabyss.com</p>\n<p>Twitter: https://twitter.com/LastAbyss</p>\n<p>Discord: https://discord.gg/MAtA3g8</p>\n\n<p>FINAL WORDS:</p>\n<p>Hey guys!</p>\n<p>This is an older one of our games called Nords and Fjords. We were planning on getting out there a long time ago, but life and other projects got in the way of completing it. It's shorter than our other games for this reason but still cool nonetheless.</p>\n<p>We decided to clean it up a bit and post it this year because we think it's neat and worth sharing! Have fun, and be sure to join our Discord if you liked it.</p>\n<p><em>Yes, the game is inherently not as complete as we would've liked it to be, but hey. Better to share it than to not, I'll say!</em></p>\n<p>-- NavidK0</p>", "metacritic": null, "released": "2021-02-01", "tba": false, "updated": "2021-02-05T08:44:43", "background_image": "https://media.rawg.io/media/screenshots/cd2/cd270d222df4bc87fe03d74d90837743.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 24, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["Last Abyss"], "genres": ["Action", "Platformer"], "publishers": [], "esrb_rating": null}