{"id": 554238, "slug": "sophistry", "name": "Sophistry", "name_original": "Sophistry", "description": "<p><strong>Click the button \"Download Now\" to try the FREE demo of our upcoming game.<br/></strong></p>\n<p><strong>Kickstarter coming in March 2021.</strong></p>\n<br/><p>Sophistry is an interactive romantic visual novel game, which includes a dating simulation system. The game is currently under development by our team, 2 Cubs Studio. The expected release date is scheduled for summer 2021.</p>\n<p>Sophistry is aiming to be true to the core meaning of “Visual Novel” by providing vibrant and animated visuals, as well as a very deep and rich story line reminiscent of classic Korean romantic drama series.</p>\n<p>The game will initially be available on Windows, Mac OS, and Linux, followed by a later release on Android and iOS.</p>\n\n<p>Assuming a successful Kickstarter funding in March 2021; the expected core features are:</p>\n<ul><li>6 Unique characters (3 males and 3 females), to choose from; each with their own story line and point of view. You can enjoy the game playing only one character, but you’ll only uncover all the mysteries of the stories by playing all six of them, as everything is happening from the perspective of the character you selected.</li><li>The decisions you make matters and have consequences. The character you choose to play as well as the one you choose to romance will affect your story line and the behavior of the other characters.</li><li>Each play through is approximately 10 hours long, playing once each of the characters brings the minimum game play time to at least 60 hours for a single run, trying all the core 18 routes+ will take you around 200 hours to fully explore all what Sophistry has to offer in core content (not taking in account randomized game play)!</li><li>Dynamic endings. Our endings are dynamically generated based on the paths and decisions you made along your game play, making each ending unique on its own.</li><li>Ultra HD character designs and animations. In order to meet the visual side of “Visual Novel”, the backgrounds are designed in full HD, while the characters are designed and animated in 4K resolution; some assets even have been developed in 8K! Animation is made using Live2D. Now you can truly enjoy our visual novel, regardless of your screen size, goodbye small pixilated window!</li><li>19 original songs with vocals as OST in addition to all the atmospheric scores. Each character and core path has its own score and song composed, written and sung for them by professional artists.</li><li>Fully voice acted, even the main protagonists all the way to the smallest npc.</li></ul>\n<p>All the donations, will be use for this project. Thank you for your support!</p>\n<p>Join us in different social media!</p>\n<p>Youtube ➔ https://www.youtube.com/channel/UCalgY2vlvA1JP4ifbM-DTgw<br/></p>\n<p>Facebook ➔ https://www.facebook.com/2cubsstudio<br/>Website ➔ https://2cubsstudio.com/<br/>Discord ➔ https://discord.gg/bE3JCbKnQD<br/>Twitter ➔ https://twitter.com/2CubsStudio<br/>Buy Me a Coffee! ➔ https://www.buymeacoffee.com/2CubsStudio...<br/>Redbubble ➔ https://www.redbubble.com/people/2CubsStudio...</p>\n<p><strong>###Instalation Instruction###</strong></p>\n<p>1. Extract  the zip file.</p>\n<p>2. Check the new file folder after you extracted.</p>\n<p>3. Double-click on the Sophistry Application file. </p>\n<p>4. Enjoy your game.</p>\n<p>If you have problem to run your game demo, you can right click the Sophistry Application file and run it as Administrator.</p>", "metacritic": null, "released": "2021-02-01", "tba": false, "updated": "2021-02-05T08:54:01", "background_image": "https://media.rawg.io/media/screenshots/88f/88f50271bbe21577828d697594001101.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 232, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["2 Cubs Studio"], "genres": [], "publishers": [], "esrb_rating": null}