{"id": 554274, "slug": "dawes-24-alpha", "name": "Dawes-24 Alpha", "name_original": "Dawes-24 Alpha", "description": "<p><strong>\"To win chess, you must sacrifice a pawn, in order to get their king\"</strong></p>\n<p>Rinam suffered from too many wars.<br/>The Forechaftian Government wants to stop this.<br/>G.H.M is a resistance movement on the rise.<br/>And Dawes-24 is a key member of this movement.</p>\n<p>From the aristocratic family, son of Governor August, it's a family tradition to become an Enforcer, and serve Rinam's interests, and perhaps achieve the most prestigious rank: Loyalty Officer, to continue the family's name in glory.<br/></p>\n<p>But every deployment you served, you encounter Dawes-24.<br/>An important ally for the G.H.M and a key to its success.<br/>You must stop Dawes-24 and finally eradicate this mystery.</p>\n<p>Following the trail of Dawes-24,<br/>You begin to realise that the G.H.M may not be the true threat to Rinam.</p>\n<p><strong>Characters:<br/></strong><strong>Alfred August:<br/></strong></p>\n<p>With vital decryption skills, you play as the main character. Sent to carry out the family legacy under the authority of Governor August, your father, just to find yourself investigating into Dawes-24.</p>\n<p>With the end goal of becoming a Loyalty Officer.<br/>There's a secret that lies behind that uniform.</p>\n<p><strong>Aaron Ash:<br/></strong></p>\n<p>The son of Sector Governor Ash, coming from the Capital and being part of the Elite, your friend dedicates himself to Rinam's prospects, being able to manipulate his father's influence for his own benefits.</p>\n<p>With the end goal of becoming a Quadraint Officer.<br/>There's a secret that lies behind his uniform.</p>\n<p><strong>Alexander Autumn:<br/></strong></p>\n<p>Coming from the poorer countryside, son of a farmer, Alexander struggles to deliver respect to his family name, being discriminated by those in the Capital, is an obstacle in his career path.</p>\n<p>With the end goal of becoming a Supply Officer.<br/>There's a secret that lies behind his uniform.</p>\n<p><strong>Game play:<br/></strong>The game play follows doing puzzles, which inspires from the boolean logic circuits, having to pass obstacles in order to input the binary sequence into the circuit, in order to unlock the puzzle, utilising three logic gates: AND, OR and NOT.<br/></p>\n<p><strong>Features:<br/></strong>. Original soundtrack<br/>. 3-4 hours of game play<br/>. Interactive story driven game<br/>. 16 puzzles<br/>. Multiple choices<br/>. The feeling you won't get the full story unless you know where the true hints are</p>\n<p><strong>Additional notes:<br/></strong>This game is only in Alpha so feedback will be appreciated.<br/>Controls can be changed for your liking via Options then Keyboard Config.</p>", "metacritic": null, "released": "2021-02-01", "tba": false, "updated": "2021-02-05T09:04:55", "background_image": "https://media.rawg.io/media/screenshots/e06/e06d816a4f87f8e0f8e66a5d65e3a12e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 182, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["8-BitNovels"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}