{"id": 55424, "slug": "dragons-lair-2-time-warp", "name": "Dragon's Lair II: Time Warp", "name_original": "Dragon's Lair II: Time Warp", "description": "<p>Dragon's Lair II: Time Warp is a 1991 laserdisc video game by the Leland Corporation. It is regarded as the first \"true\" sequel to Dragon's Lair. As with the original, Dragon's Lair II: Time Warp consists of an animated short film that requires the player to move the joystick or press a fire button at certain times in order to continue. It takes place years after the original Dragon's Lair. Dirk has married Daphne, and the marriage has produced many children. When Daphne is kidnapped by the evil wizard Mordroc in order to be forced into marriage, Dirk's children and his mother-in-law are clearly upset by the abduction of Daphne, and Dirk must once again save her.</p>\n<p>Home ports of the game were announced for the Sega Saturn, Philips CD-i, 3DO Interactive Multiplayer, and Jaguar CD. However, only the CD-i version was actually released, though non-playable demos of the 3DO and Jaguar CD versions appear on those consoles' respective versions of Brain Dead 13. The game was later ported to the Wii as part of the compilation release Dragon's Lair Trilogy. A PlayStation 3 port was released on June 1, 2011.</p>", "metacritic": null, "released": "1991-06-16", "tba": false, "updated": "2023-02-08T10:47:35", "background_image": "https://media.rawg.io/media/screenshots/551/55115b6a98dcb68e7e3697681d5137a3.jpg", "website": "", "rating": 4.29, "rating_top": 5, "added_by_status": {"yet": 8, "owned": 98, "beaten": 10, "toplay": 8, "dropped": 4}, "playtime": 1, "achievements_count": 14, "ratings_count": 17, "suggestions_count": 496, "game_series_count": 0, "reviews_count": 17, "platforms": ["Commodore / Amiga", "Atari ST", "Classic Macintosh", "PC", "iOS", "macOS", "Linux", "PlayStation 3", "Nintendo DS", "Android"], "developers": ["Digital Leisure", "Dragon's Lair"], "genres": ["Action", "Adventure", "Arcade", "Casual"], "publishers": ["Digital Leisure", "Dragon's Lair"], "esrb_rating": null}