{"id": 554265, "slug": "pathogen-x-demo", "name": "Pathogen-X [Demo]", "name_original": "Pathogen-X [Demo]", "description": "<em><strong>Pathogen-X</strong></em> is a return to the classic survival horror genre, inspired by games from the late 90's such as <em>Dino Crisis</em>, <em>Resident Evil</em>, and <em>Deep Fear</em>. Can you brave your way through the terrors of the Delta Corp Labs?\r\n\n<p>The virus known as <em>Pathogen-X</em> has broken out within the Delta Corp research facility without warning, infecting and producing droves of violent mutants. As special forces agent Hawk, you've been tasked with a quick search-and-retrieval mission. Infiltrate the lab, find a vaccine, and get out before the place is nuked.</p>\n\n\n<ul><li>In the demo, you'll access \"Shuffle Mode\". Fight through the sprawling underground Delta Corp Labs, where enemy encounters, item placement, and even the facility itself are all completely randomly-generated on every playthrough.</li><li>Complete your mission successfully and you'll receive a ranking at the end! Can you reach S rank?</li></ul>\n\n<ul><li>Find and equip 3 different main weapons, and 2 secret ones. Mow down foes with the standard handgun, shotgun, assault rifle, desert eagle, and missile launcher.</li></ul>\n\n<p>Thanks for checking out the demo for Pathogen-X! We hope to continue development on this in the near-term future, and add many more new features (both retro and modern!)</p>\n<ul><li>The main game will feature a dedicated story mode that has you assume the roll of Agent Hawk. You'll face new hostile creatures, collect new weapons and items, and uncover the secrets of who's behind the virus.</li><li>We'd like to add the option to enable fixed camera angles, for that added \"nostalgic\" atmosphere.</li><li>Shuffle Mode will aim to be more \"arcade-like\" in the future, with more varied locales, more choices on how to navigate, and maybe play as another character!</li><li>If there are any features you'd like to see in the finished game feel free to drop some suggestions in the community board.</li></ul>\n<p>If you'd like to stay updated on the development for this game, follow us here on itchio, or on our Twitter.</p>", "metacritic": null, "released": "2021-02-01", "tba": false, "updated": "2023-01-06T00:45:03", "background_image": "https://media.rawg.io/media/screenshots/47c/47ca522eaf1a480941efdf595cc3eadd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 369, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["sodaraptor"], "genres": ["Action"], "publishers": [], "esrb_rating": null}