{"id": 554373, "slug": "pathmaker-prototype", "name": "Pathmaker Prototype", "name_original": "Pathmaker Prototype", "description": "<p><strong><em>This is a very early playable prototype of the game \"Pathmaker\" that I am currently working on. All following graphics are subject to change and are not part of the gameplay demonstrations in the prototype.</em></strong></p>\n<p><strong>Game Concept</strong>You control a character running and jumping through short levels with a twist: There are active and inactive platforms  <em>you </em>can activate or deactivate by pressing a button.<br/></p>\n<br/><br/><strong>Artstyle</strong><p>To keep everything simple, I decided to stick with a low-resolution pixel look. The major reason to keep the artstyle simple is that I want to keep my focus more on coding the gameplay, to make sure everything is fun to play. I'm still learning to do pixel art, so pretty much all of that is subject to change and a learning process in this project.</p><br/>\n\n<p>If you want to help me out financially check out my patreon page here. <br/></p><p>Keep in mind however, that <strong>I can not afford to do this full time</strong> at the moment. If you can't or simply don't want to support me financially, following my progress or spread the word will also be a huge support. Every support is appreciated.</p><em><strong><em><strong>Thank you so much for your time you spent reading this!</strong></em></strong></em><br/>", "metacritic": null, "released": "2021-02-01", "tba": false, "updated": "2021-02-05T09:30:00", "background_image": "https://media.rawg.io/media/screenshots/d5c/d5cb88c3526a07de69be0fd6b78ff4ce.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 1, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["The Elegist"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}