{"id": 554387, "slug": "melon-seeds-zombie-defense-alpha", "name": "Melon Seeds Zombie Defense Alpha", "name_original": "Melon Seeds Zombie Defense Alpha", "description": "<p>Use seeds as ammo to kill zombies, as money to trade with the city for traps and helicopter parts and as seeds to grow melons to survive! Farm, trade, defend,melon.</p>\r\nMelon Seeds Zombie Defense\r\n<p>A zombie defense game but trading, killing and surviving depends on growing watermelons.<br/></p>\n<p>Has gamepad support!</p>\n<p>Note: Currently, the game is in alpha. This means that I'll be adding so much more to the game very soon and periodically, so please follow @melonzombiegame for updates. Upcoming changes include visual overhaul and more items.</p>\n<p>Also your windows might \"protect you\" from the game, please click \"Run anyway.\" I didn't sign it so windows doesn't trust it. If enough people play that'll be fixed.</p>\n<p>For now, trading is disabled. Also probably your save won't transfer to next updates.</p>\n<p>Thanks for checking it out and if you like the game you can follow me on @udcgame.</p>\n<p>Controls:</p>\n<p>WASD to move, F for inventory, R reloads the magazine, and the chest is opened with F closed with Q. Select items from the inventory by pressing E.</p>\n<p>1 is gun 2 is watering can 3 is items.</p>\n<p>Current mode is survival! Survive as many days as you can! </p>\n<p>Note:</p>\n<p>To get water from the well you must equip the watering can by pressing 2.</p>\n<p>To eat the watermelons you must press 3 and then select the one from the inventory.</p>", "metacritic": null, "released": "2021-02-01", "tba": false, "updated": "2021-02-05T09:33:15", "background_image": "https://media.rawg.io/media/screenshots/01d/01dc64d706dc1982e03ccc8c9b550981.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 25, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["udc"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}