{"id": 554525, "slug": "glens-dungeon", "name": "Glen's Dungeon", "name_original": "Glen's Dungeon", "description": "<p>A game initially meant for the 32 Bit Holiday Jam 2020, but since that deadline was missed the game was finished for the Finally Finish Something 2021 Jam. It's a project I worked on with my roommates, which was a great experience. It is maybe a stretch to call it completely finished, but it is the first game I've gotten to a presentable and playable form, so in that since it is finished.</p>\n<p><strong>Instructions</strong></p>\n<p>You have a map, use it to get to higher floors (stairs going up are marked with `/`). Use WASD to move, and 1,2,3... to attack. P pauses, and allows you to return to the menu (though there is no saving).</p>\n<p>If input is not working, try refreshing the page, as there seems to be some sort of infrequent issue between the game engine I'm using (Urho3D) and the itch.io integration.</p>\n<p>You can resize the Map and Player windows by dragging from the bottom right corner.</p>\n<p><strong>Acknowledgements</strong><br/></p>\n<ul><li>Music: Jacob LaBonte</li><li>Game Mechanics: Scott Cochran (who had a lot more ideas than I managed to implement)</li><li>Map Generations: Scott Hirsch (based in part on the Perl random dungeon generator https://donjon.bin.sh/code/dungeon/)</li><li>Game Library: Urho3D, an excellent C++ library for 3D (and 2D) games</li><li>Models: Adapted from several of Quaternius's model packs.</li><li>Template Project used as a base by Arnis Lielturks</li><li>Implementation: Nathanial Lydick</li></ul>\n\r\nGood News<p>Because I and my roommates are followers of Jesus, we wanted to share with you the very good news about him as relates to our general human condition:</p>\n<p>God created us to be with Him.</p>\n<ul><li>And in the beginning, we were, and everything was very good. However:</li></ul>\n<p>Our sin separates us from God.</p>\n<ul><li>Sin is basically another word for wrongdoing: lying, cheating, stealing, murder, lust, greed, etc.</li></ul>\n<p>Sins cannot be removed by good deeds.</p>\n<ul><li>Because God is perfect, there must be just punishment for sin.</li></ul>\n<p>Paying the price for our sin, Jesus died and rose again.</p>\n<ul><li>To allow us to be with Him again, God became man (Jesus), lived the perfect life that we have not lived, and then, though he was not guilty himself, he took the penalty for our sin on himself so that he might show mercy to us.</li></ul>\n<p>Everyone who trusts in Him alone has eternal life.</p>\n<ul><li>\"For God so loved the world that he gave his one and only Son [Jesus], that whoever believes in him shall not perish but have eternal life. For God did not send his Son into the world to condemn the world, but to save the world through him. Whoever believes in him is not condemned, but whoever does not believe stands condemned already because they have not believed in the name of God’s one and only Son.\"</li></ul>\n<p>Life with Jesus starts now and lasts forever.<br/></p>\n<ul><li>So, if you have not yet made your relationship with God right by trusting in Jesus, I would invite you to do so now. Admit to yourself and to God that you have sinned, that you have separated yourself from God and deserve his punishment for that sin, and trust in Jesus's offer of salvation (an offer based on his perfect life, his death on the cross, and his resurrection afterwards). Commit to following Jesus, trusting in him to save you.</li></ul>\n<p>\"For all have sinned and fall short of the glory of God.\" And \"the wages of sin is death, but the gift of God is eternal life in Christ Jesus our Lord.\" If you have any questions on the matter, feel free to reach out to me or to a local Church.</p>", "metacritic": null, "released": "2021-02-01", "tba": false, "updated": "2021-02-05T10:11:07", "background_image": "https://media.rawg.io/media/screenshots/5f3/5f347a72e9141d51c6d7671b5552c8e0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 37, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["SirNate0"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}