{"id": 554567, "slug": "fizz-fighter", "name": "Fizz Fighter", "name_original": "Fizz Fighter", "description": "<p>A fighting game all about understanding your opponent's moves as well as your own. In this dystopian world, the only thing you can rely on are your fists, and your fists are two-liter bottles of store-brand soda.<br/></p>\n<p><strong>Made for Global Game Jam 2021.</strong></p>\n<p><strong>Controls:<br/></strong>Player 1: S&amp;F move Left and Right. E jumps, D crouches. G is attack, H is defend.</p>\n<p>Player 2: Arrow Keys move left and right, jump and crouch. O is attack, P is defend.<br/></p>\n<p> <br/>Tap the attack button quickly for a fake-out, hold it down a bit longer to actually attack. The type of attack is dependent on your distance from the opponent: close-up attack is a shove that deals no damage but staggers the opponent, medium range attack is a standard punch, long-range attack is a powerful lunge that leaves you vulnerable afterward. <br/></p>\n<p>Hold the defend button to block, or quickly tap it to parry. Crouching attacks can only be blocked crouching, airborne attacks can only be blocked standing, and standing attacks can be blocked either way.</p>\n<p>Whenever an attack is blocked by either player, 'Pressure' gets built up. A successful attack adds all built-up pressure to the damage of the attack. Be careful, if the pressure level is high enough, even a single successful attack might be enough to knock you out!<br/></p>\n<p>Parrying at the right time lets you counterattack, but parrying willy-nilly will leave you vulnerable! Bait out your opponent's parries with fake-outs, find the right engagement distance, build up pressure, and let 'em have it!<br/></p>\n\n<p><strong>Contributers: </strong></p>\n<p>Justin Wang - Game design &amp; development <br/>Kerina McCarthy - Character design &amp; animation <br/>Alec Danz - Sounds, animations, GUI</p>\n<p><strong>Asset Credits</strong><br/>Rolemusic - The Pirate and the Dancer <br/>Background artwork created by Luis Zuno (@ansimuz)</p>", "metacritic": null, "released": "2021-02-01", "tba": false, "updated": "2021-02-05T10:20:41", "background_image": "https://media.rawg.io/media/screenshots/e3b/e3bc2bee16c33ad3d51c04ee16110389.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 35, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["inkear"], "genres": ["Fighting"], "publishers": [], "esrb_rating": null}