{"id": 554623, "slug": "tridequad", "name": "Tridequad", "name_original": "Tridequad", "description": "<p><strong>I recommend that you download the full version! It has full saving support, runs faster, and is in full screen. Scroll down to find it.</strong><br/></p>\n\n<p><strong>How to play:</strong><br/></p>\n<p>There exists a red Triangle, and a Blue Square. The Square will follow your mouse cursor, and the Triangle will move towards the Square when you hold left click. With the Triangle and Square being destroyed when they collide with their respective colored wall, you must carefully lead them to the goal.<br/></p>\n<p>Try to beat all 20 levels as fast as possible, or practice them individually in the level selector. Good Luck!</p>\n\n<p><strong>More Information</strong><br/></p>\n<p>This has been a project of mine for a while now, just working off and on to see what I can get done. Only now is this small game fully playable, but not what I would call \"Finished\". I'll be periodically updating the game with new content as I see fit. I plan to smooth out the game's sprites and make the game more user-friendly, along with the level editor I'm working on.</p>\n<p>If you want to be updated whenever I edit this project (or upload any other projects/game jam submissions) follow me here! I'll post devlogs to keep you up to speed. Thank You!</p>\n<p><strong>If you come across any bugs, let me know below</strong><strong> so I can fix them!</strong><br/></p>", "metacritic": null, "released": "2021-02-01", "tba": false, "updated": "2021-02-05T10:34:24", "background_image": "https://media.rawg.io/media/screenshots/58c/58c612aada4face0fe91dceccc3873ce.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 70, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["Icosmophedron"], "genres": ["Action"], "publishers": [], "esrb_rating": null}