{"id": 554625, "slug": "cinderella-tip", "name": "Cinderella Tip", "name_original": "Cinderella Tip", "description": "<p>Cinderella Tip (aka Fake Residential House HQ, aka \"Royal Citizen -1\" )</p>\n<p>Remy (F.R.) is an unemployed guy who, doing a favor for a friend (a Restaurant owner), does a delivery to the \"King of the Island\" a semi-hermit older guy.</p>\n<p>When doing so, he became involved in a murder scene, in which he is considered the main suspect. Help him to get rid of all suspicions and, perhaps, find the culprit!</p>\n<p>If you liked the game (or saw potential in it) , please follow me on Twitter\r\n</p>\n<p>[Twitter pending...]</p>\n<p>=============================================</p>\n<p>Features:</p>\n<p>-Third-person controller with movement, camera rotation, footsteps, and so forth</p>\n<p>-A Marvelous House made by me (Kept in mind the \"essence\" of the Residential House HQ)</p>\n<p>-[some] Ambient sounds</p>\n<p>-Dialogue systems (notes, characters, and inspection commentary)</p>\n<p>-Collectible Item</p>\n<p>-Multiple languages for game: English (100%), Russian (85%), Spanish (100%), Simplified Chinese (75%) [% indicates how accurate, I think, the translations are in that language]</p>\n<p>-Puzzles (Codes)</p>\n<p>-Fully functional Menu</p>\n<p>-Controller support</p>\n<p>==============================================<br/></p>\n<p>Further notes:</p>\n<p>I got into the jam because I plan to make a game in the future (this year actually), and I wanted to take the oportunity to showcase the RUUF (Rene's Unity Ultimate Framework), and also have some publicity. That being said, this game only showcases 15% of the RUUF's full potential, limiting to basics, such as dialogues, movement an interctions (100% includes weapons, much more functionalities, further optimizations,  multiple AI, and some errors you might encounter here are already fixed there). On a further note, the next game will have some historical relationship to this game. Code was made 100% by me, and house too, however, soundtrack, smaller assets such as furniture and other similar things were not made by me (credits in the game)</p>\n<p>I do want to thank John Wolf for the oportunity in any case</p>", "metacritic": null, "released": "2021-02-01", "tba": false, "updated": "2021-02-05T10:35:15", "background_image": "https://media.rawg.io/media/screenshots/69c/69cf8205313af9e9db64699c155094ab.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 356, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ShrimpTraveller"], "genres": ["RPG", "Puzzle"], "publishers": [], "esrb_rating": null}