{"id": 554726, "slug": "tda00-muv-luv-unlimited-the-day-after-episode-00", "name": "[TDA00] Muv-Luv Unlimited: THE DAY AFTER - Episode 00", "name_original": "[TDA00] Muv-Luv Unlimited: THE DAY AFTER - Episode 00", "description": "At long last, the wait is finally over! Get ready for the latest installment in the highly acclaimed Muv-Luv franchise, now officially available in English for the first time ever!<br/><br/>Picking up directly where Muv-Luv Unlimited left off, witness the aftermath of Alternative V, as the last remnants of humanity fight a desperate battle for survival on a barren and desolate Earth! Featuring a brand-new cast (with some returning fan-favorites thrown in for good measure!) and all-new challenges to face, this epic four-part saga is sure to please longtime fans and newcomers alike!<br/><br/>So strap in and get ready, because the ride didn't end with Alternative — and in keeping with Muv-Luv tradition, there is only suffering and despair on the horizon!<h3>The Story So Far</h3><br/>SPOILER ALERT: The following sections contain MAJOR SPOILERS for Muv-Luv Unlimited. If you have not yet completed the second part of the trilogy, we recommend that you tread lightly. Click here to go to the Steam store page for parts one and two.<br/><br/>February, 2004: Professor Kouzuki's last-ditch gambit has failed, and Alternative IV is no more. The fate of mankind now rests on the success of Operation Babylon — a massive, simultaneous detonation of the mysterious “G-Bombs” over every single BETA hive on Earth.<br/><br/>But in the blink of an eye, what seemed to be the hour of final victory for humanity in the decades-long BETA war turned into a colossal defeat. The alien invaders were seemingly destroyed, but at what cost? Europe and Asia were lost beneath the waves, and much of the remaining land masses are now barren deserts of salts, unfit for human life.<br/><br/>The apocalypse has come and gone, but mankind remains. This is the story of the few who were left behind to survive on a dying planet. This is the day after.<br/><br/>Stranded in the middle of the South Pacific, the future looks bleak for the men and women of the TSF Carrier USS John F. Kennedy. With their food supply dwindling, their communications down, and no improvement in sight, tensions are steadily rising among the crew, and many are fast approaching their breaking point. <br/><br/>Lieutenant Will Collins has been entrusted with the thankless task of conducting recon in the nearby salt flats. After weeks of uneventful flights, his luck changes one fateful day, when he comes across a survivor: Lieutenant Lilia Kjellberg. And while this seems to have been a fortunate happenstance at first, Will soon finds himself at odds with the new addition to the crew, as their beliefs clash on a fundamental level.<br/><br/>Can these fellow surface pilots set their differences aside and work together to survive, or will their rivalry only hasten the JFK's downfall?<h3>Features</h3><ul><li>A kinetic (linear) visual novel with full Japanese voiceover, including a series first — a voiced protagonist! <br/></li><li>All-new user interface in a rebuilt engine designed for unprecedented system compatibility!</li></ul>", "metacritic": null, "released": "2021-02-04", "tba": false, "updated": "2021-02-08T02:11:24", "background_image": "https://media.rawg.io/media/screenshots/fb0/fb01bf692fdd412110527b31f024a48b.jpg", "website": "https://muvluv.com/en/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 20, "toplay": 1}, "playtime": 4, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 377, "game_series_count": 13, "reviews_count": 0, "platforms": ["PC"], "developers": ["Anchor"], "genres": ["Adventure", "Casual"], "publishers": ["aNCHOR"], "esrb_rating": null}