{"id": 554854, "slug": "big-sister-mini-jam-73", "name": "Big Sister - Mini Jam 73", "name_original": "Big Sister - Mini Jam 73", "description": "<p><strong>A game made by Gaël Alonso, Clara Laborderie and William Bacher.</strong><br/></p>\n<p>In this game you’re the IA of a secret underground laboratory, something happened and the power income is particularly low today.<br/></p>\n<p>Manage the power outcomes carefully to make sure that the scientific datas you need to upload today will be fully transferred. </p>\r\nGoal : \r\n<p>- Upload 100% of the datas.</p>\r\nYou lose if : \r\n<p>- The electricity gauge is empty.</p>\n<p>- There is no scientific left in the lab.</p>\r\nIn game :\r\n<p><strong>Controls : </strong>Mouse</p><p>Navigate between four screens :</p>\n<ul><li><strong>Map</strong> (main screen): where you see the electricity gauge, the scientists movements and the alerts.</li><li><strong>Control </strong>: where you enable or disable the cameras, open and close the doors and call scientists in a specific room.</li><li><strong>Upload :</strong> where you toggle on and off the transfer of datas.</li><li><strong>Electricity</strong> : where you see the exact incomes and outcomes of electricity, the number of cameras on, how many scientists are alive and if an alert is currently happening in the lab.</li></ul>\n<p>Cameras, Scientists, and doors consume electricity, in addition to your own electricity running cost as an IA.</p>\n\n<p><strong><strong>Cameras :</strong> </strong>You can toggle on and off cameras on the Control screen. </p>\n<p>When cameras are off they aren’t consuming electricity.</p>\n<p>When cameras are on in a room you’re able to see the scientists that are inside and if any alert or call is currently happening in this room on the Map screen.</p>\n\n<p><strong>Doors : </strong>you can open and close all the doors of the map by clicking on them from the Control screen. Using a door (opening or closing) consume electricity.</p>\n\n<p><strong>Call a scientist : </strong>you can call a scientist in a specific room from the Control screen.</p>\n<p>If a scientist is currently in a room where an alert is happening they will automatically be the one that goes to the picked room.</p>\n\n<p><strong>Alerts :</strong> when an alert happens in a room if scientists stay more than 10sec in it they die.</p>\n<p>If an alert is currently happening somewhere in the lab it will be notified on the electricity screen.</p>\n<p>And if the camera where the alert takes place is on, the room will flash red on the map screen.</p>\n\n<p><strong>Upload :</strong> you can toggle on and off the data uploading on the Upload screen\r\nIf an alert occurs in the lab the upload is stopped and you need to toggle it back on.</p>\n<p>You can check if the upload is in progress on the Electricity screen.</p>\n\n<p><em>Created for Mini Jam 73 : Power</em><br/></p>\n<p><em>Font : </em><em>Chintzy CPU, Created by Brian Kent</em></p>", "metacritic": null, "released": "2021-02-07", "tba": false, "updated": "2021-02-08T03:13:02", "background_image": "https://media.rawg.io/media/screenshots/4de/4dee4516a1d623b0a01dde58348b3477.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 58, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["fuegosuave"], "genres": ["Strategy", "Simulation"], "publishers": [], "esrb_rating": null}