{"id": 554950, "slug": "terminal-lost", "name": "Terminal: LOST", "name_original": "Terminal: LOST", "description": "<p><strong>Terminal: LOST</strong></p>\n<p>/////////////////////////////////////////////</p>\n<p>Esse jogo foi desenvolvido durante a Global Game Jam de 2021. Nos 4 dias de evento, eu e mais dois amigos (Árnilsen e Luiz Bozzi) criamos um jogo baseado no tema \"achados e perdidos\". Terminal: LOST é um jogo que se passa nos achados e perdidos de um aeroporto, onde o player tem de decidir se a pessoa que está na sua frente é o dono do produto, ou não. Você pode conversar com a pessoa, checar seus documentos (na prancheta) e a descrição do produto (no computador) para te ajudar a chegar à decisão correta. Cada dia apresenta metas distintas a serem cumpridas e personagens especiais podem aparecer durante esse tempo.</p>\n<p>Por enquanto o jogo está apenas em português e sem tutorial. Estamos trabalhando nisso para uma futura atualização</p>\n<p>/////////////////////////////////////////////</p>\n<p>This game was developed during the 2021 online global game jam. During the four days of the event, me and other two friends created a game based on the subject \"lost and found\". Terminal: LOST is a game about an airport lost and found. The player needs to decide whether the person in front of him is the owner, or not. Each day has diferent goals to be completed, and some special characters might apear during that time.</p>\n<p>The game is entirelly in portuguese, but we are working on a update to embrace english!</p>", "metacritic": null, "released": "2021-02-07", "tba": false, "updated": "2021-02-08T03:33:40", "background_image": "https://media.rawg.io/media/screenshots/ee6/ee6717548d66c28cbd2f0f2eae74b059.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 56, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jujubs"], "genres": [], "publishers": [], "esrb_rating": null}