{"id": 5550, "slug": "driver-san-francisco", "name": "Driver San Francisco", "name_original": "Driver San Francisco", "description": "<p>Driver: San Francisco is the fifth game in the Driver franchise. It is a game about chases with a crime thriller plot.</p>\n<h3>Plot</h3>\n<p>Plotwise, Driver: San Francisco serves as a sequel to Driver 3 rather than the previous installment, Driver: Parallel Lines. As with the rest of the Driver series, the main character is John Tanner, a police detective, and a talented driver. Tanner is chasing the mobster Charles Jericho who survived the events of Driver 3. </p>\n<p>While awaiting trial in San Francisco, Jericho escapes the custody and wrecks chaos in the city. Tanner is injured and falls into a coma. While unconscious, the protagonist discovers he has a supernatural power to inhabit other people&#39;s bodies. It allows him to continue the chase.</p>\n<h3>Gameplay</h3>\n<p>The game is set in a thoroughly modeled San Francisco complete with its famous landmarks. Unlike in the three previous games, Tanner cannot leave the car and walk around. Instead, Driver: San Francisco introduces a new option called Shift, using which the protagonist instantly changes vehicles. This is explained as a supernatural ability to switch bodies. </p>\n<p>The game also reintroduces the popular Film Director mode. It allows the player to replay his or her adventures using various cameras so that the walkthrough video looks almost like a movie.</p>\n<h3>Multiplayer</h3>\n<p>The game is the first in the series to introduce both local and online multiplayer. There are several modes that include a vehicular tag game and other variations of a competitive chase game.</p>", "metacritic": 80, "released": "2011-09-01", "tba": false, "updated": "2024-04-18T21:14:03", "background_image": "https://media.rawg.io/media/games/cce/ccee39dd9977482f655f22ad35de61ce.jpg", "website": "https://www.ubisoft.com/en-gb/game/driver-san-francisco", "rating": 3.77, "rating_top": 4, "added_by_status": {"yet": 48, "owned": 1001, "beaten": 315, "toplay": 57, "dropped": 154, "playing": 12}, "playtime": 4, "achievements_count": 101, "ratings_count": 363, "suggestions_count": 405, "game_series_count": 7, "reviews_count": 365, "platforms": ["Xbox 360", "Wii", "PC", "PlayStation 3"], "developers": ["Ubisoft", "Ubisoft Reflections"], "genres": ["Action", "Racing", "Arcade"], "publishers": ["Ubisoft Entertainment"], "esrb_rating": "Teen"}