{"id": 555219, "slug": "redemptiontoys", "name": "RedemptionToys", "name_original": "RedemptionToys", "description": "<p>Redemption Toys te pone en la piel de un juguetero que utiliza la economía circular para mantenerse a flote. Tres clientes llegarán a tu tienda con un montón de juguetes para reparar. Cada juguete consta de tres materiales, en rojo verás aquellos que están rotos. Deberás repararlos con las cartas de tu mano. Cuando intercambias un material, el roto regresa a tu mano (recuerda que como máximo podrás acumular 10 cartas en mano). Si tienes dos materiales rotos del mismo tipo podrás repararlos colocando uno sobre el martillo y otro sobre el yunque. No te preocupes si no tienes materiales con los que reparar, siempre podrás comprarlos en la tienda (tercer botón), pero ten cuidado, verás que tienes una cantidad de dinero limitada. Las cartas tienen dos números, el primero es el precio de la tienda, el segundo lo que cuesta repararlo. ¡Intenta ayudar al mayor número de clientes gastando lo menor posible antes de que se agote el tiempo!. Aunque el trabajo tiene recompensa, por cada cliente obtendrás dinero y tiempo extra...<br/></p>\n<p>PD: El mismo juego puede ser encontrado en el siguiente enlace: https://binbash.itch.io/redemptiontoys<br/>Debido a que en nuestro equipo binbash hemos perdido los datos de esa cuenta, hemos vuelto a subirlo.</p>\r\nDesarrollado por el equipo binbash durante la GranadaJam de 2017:\r\n<p>* Álvaro Fernández García (alvarillo89)</p>\n<p>* Jose Manuel Torres Morales (jtorres6)</p>\n<p>* Carlos Simón Sanchez (NewoneOrate)</p>\n<p>* Jose Manuel Perez Carrasco (roulez)</p>\n<p>* Alejandro de la Plata Ramos (Superkorlas)</p>", "metacritic": null, "released": "2021-02-07", "tba": false, "updated": "2021-02-08T04:39:12", "background_image": "https://media.rawg.io/media/screenshots/5e6/5e689393f0ba1fbc4aa76873f057fe59.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 61, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Alejandro"], "genres": [], "publishers": [], "esrb_rating": null}