{"id": 555749, "slug": "telemochi", "name": "Telemochi", "name_original": "Telemochi", "description": "<p><strong>IMPORTANT!!<br/></strong><strong>This game is meant to be played by 2 players in different computers communicating through voice chat!</strong> <br/></p>\n<p>=======================================================<br/></p>\n<p>You and your friend are trying to establish a connection between your two worlds but, in doing so, you end up landing in the wrong planet! To make matters worse, the map you possess outlines the world of your friend, and your friend has the map of the world you are in!</p>\n<p>To fix the connection back and meet, you will have to co-operate to locate and complete the tasks in the world to power up both your phone booths.</p>\n<p>=======================================================</p>\n<p>HOW TO PLAY<br/></p>\n<p>The game works offline, for it to work both players need to select the same level, select a code and then input your friend's code. Confirm that these three things match and the game can begin!</p>\n<p>Keyboard:<br/></p>\n<p><strong>WASD / Arrows -</strong> Move<br/><strong>SPACEBAR -</strong> Interact<br/><strong>Shift / M - </strong>Open map</p>\n<p>Controller:</p>\n<p><strong>D-pad -</strong> Move<br/><strong>A - </strong>Interact<br/><strong>X / Y -</strong> Open Map<br/></p>\n<p>When the map is open you can move around and write  notes down to help remember what things you have visited and/or completed. Remember that you have your friend's map! Meaning you have to share information to help each other navigate around the world.</p>\n<p>Depending on the level chosen the map will show more or less information (some even are empty!). You can check the in-game manual to take a look at the 9 possible tasks that you can stumble upon.</p>\n<p>Once both players have gotten all the stars available, return to your starting point where you landed and interact with the fridge to input the final code that will establish the connection.<br/></p>\n<p>Try to beat all the levels and see how fast you can complete them! But above everything, have fun!<br/></p>\n<p>=========================================================</p>\n<p>The game was inspired by the global game jam's theme \"Lost and Found\", for various reasons we decided to take our time and make this little game stress-free for a week.</p>\n<p>=========================================================</p>\n<p>A game by<br/></p>\n<p><strong>Lune - Art<br/>Jaime Gifte - Code<br/>Rabid Tunes - Music</strong><br/></p>", "metacritic": null, "released": "2021-02-05", "tba": false, "updated": "2021-02-08T06:51:53", "background_image": "https://media.rawg.io/media/screenshots/8e5/8e500bb863d0b50ea59ea1bdc08c9a68.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 90, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jaime Gifte", "MDLune"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}