{"id": 555881, "slug": "simple-math-3d-games-2021-matches-puzzles", "name": "Simple Math 3D Games 2021: Matches Puzzles", "name_original": "Simple Math 3D Games 2021: Matches Puzzles", "description": "<p>We love match puzzles and that is the reason of this game creation.</p>\n<p>Solve matchstick simple math puzzles by moving sticks until you find the puzzle solution and making matches equation correct. Our match box is loaded with 25 levels of math puzzle and 25 levels of geometry puzzles.</p>\n<p>The game begins with easy-to-solve problems and increases the difficulty as you progress between the many stages they face. </p>\n<p>The game challenges mental imagination abilities in solving simple arithmetic problems. It is not easy to pick up sticks pass high levels.</p>\n<p>The game environment is three-dimensional with physical effects and simulation of burning matches and fire effects.</p>\n<p>Hard to find matches to fix the math? Mach videos can help you - use preview of the game for spoilers.</p>\n<p>If you despair of trying to fix seemingly unsolvable equations, you can get clues in exchange for watching short videos. </p>\n<p>Why Simple Math 3D Games 2021: Matches Puzzles is a brain trainer? <br/>Because it starts like easy game - only one move is required to complete tasks, but it continues to be more and more complex - it requires to find matches in next levels more and more moves are required. In addition correct solution may be more matches matches the result, it can be 2 or 3 different solutions, but we will approve only one of them, this way the player is stimulated to think in mind puzzle of different math variations or geometry combinations.</p>\n<p>Play Simple Math 3D Games 2021: Matches Puzzles now - it is free.</p>\n<p>Credits:<br/>Icon based on: By Yask, US https://thenounproject.com/yask <br/>Creative Commons https://creativecommons.org/licenses/by/3.0/</p>", "metacritic": null, "released": "2021-02-05", "tba": false, "updated": "2021-02-08T07:24:54", "background_image": "https://media.rawg.io/media/screenshots/a93/a930b238d4a4d86fa4db457ac1ff6fc6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 131, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["kindergarten"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}