{"id": 55599, "slug": "reach-for-the-stars", "name": "Reach for the Stars", "name_original": "Reach for the Stars", "description": "<p>Reach for the Stars is a science fiction strategy video game. It is the earliest known commercially published example of the 4X games (Explore, Expand, Exploit, Exterminate) genre. It was written by Roger Keating and Ian Trout of SSG of Australia and published in 1983 for the Commodore 64 and then the Apple II in 1985. Version 3 added an MS-DOS port, though it did not share all of the features of the other platforms. The game was eventually ported to pre-Mac OS X versions of the Macintosh operating system, such as System 6. It was also ported to the Amiga and Apple IIGS, from the Mac OS version.</p>\n<p>The player commands a home star in the galaxy, and then expands to form an interstellar empire by colonizing far-off worlds, building powerful starships, and researching new technologies.</p>\n<p>Reach for the Stars was very strongly influenced by the board game Stellar Conquest. Many of RFTS's features have direct correspondence in Stellar Conquest.</p>\n<p>Graphics are minimal, yet the tactical and strategic elements provide countless rich combinations for colony development and interstellar warfare. The software's AI also offered a challenging opponent in single-player games. It is not uncommon for a Reach for the Stars game to take over twelve hours to complete in single-player mode and 24 hours with multiple players.</p>", "metacritic": null, "released": "1983-01-01", "tba": false, "updated": "2023-02-08T10:51:49", "background_image": "https://media.rawg.io/media/screenshots/b3f/b3f08bd2e46652cd2c0f5d9d59e50e49.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 3, "beaten": 4, "toplay": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 233, "game_series_count": 0, "reviews_count": 1, "platforms": ["Commodore / Amiga", "Apple II", "Classic Macintosh", "PC"], "developers": ["Strategic Studies Group"], "genres": [], "publishers": ["Strategic Studies Group"], "esrb_rating": null}