{"id": 555990, "slug": "mereks-market", "name": "Merek's Market", "name_original": "Merek's Market", "description": "Merek’s Market is a chaotic crafting game about running a medieval shop.<br/><br/><br/><br/>We’ve all been that adventurer throwing down bags of gold to buy swords and shields, but what about the poor souls rushing around behind the shop counter? Strange customers? Yes. Over the top crafting challenges? You bet. A shop cat? Absolutely! Take ownership of Merek’s Market as you haggle, barter and craft your way through a comical single player campaign or team up with friends to supply the whole town.<h3>Craft</h3><br/><br/><br/>Do you have the skill and craftsmanship to make beautiful artisanal items? Neither does Merek but putting a few items on a crafting table and hitting them with a hammer seem to turn up decent results.<h3>Haggle</h3><br/><br/><br/>Skilfully negotiate your way into heady profits. Unethical side note, richer folk will pay through the nose for any product. Do with that information what you will.<h3>Big...Customers</h3><br/><br/><br/>Battle absurd bosses and craft custom items for them. If you can't manage that then at least try your best to keep your shop in one piece.<h3>4 Player Local Co-op</h3><br/><br/><br/><ul><li>Can't invite your friends round? You can play with your parents who will most definitely quickly grasp the controls and be useful team mates.<br/></li><li>Has the spark gone? Save the relationship with some quality time together.<br/></li><li>Do you struggle with the most basic of video games? Look like you’re doing something useful while your 3 friends carry you.</li></ul>", "metacritic": null, "released": null, "tba": true, "updated": "2023-06-01T21:52:06", "background_image": "https://media.rawg.io/media/screenshots/63e/63e7ac34e8abf2cfe0b8273019f59948.jpg", "website": "https://bigvillagegames.com/mereks-market/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1, "beaten": 1, "dropped": 1}, "playtime": 0, "achievements_count": 56, "ratings_count": 2, "suggestions_count": 363, "game_series_count": 0, "reviews_count": 2, "platforms": ["Xbox One", "PC"], "developers": ["Big Village Games"], "genres": ["Action", "Simulation", "Casual", "Indie"], "publishers": ["Big Village Games"], "esrb_rating": null}