{"id": 555997, "slug": "suicide-countdown-7-days", "name": "Suicide Countdown: 7 Days", "name_original": "Suicide Countdown: 7 Days", "description": "\"All humans are born from a warm, calm womb and also tend to return to that calm pre-life state.\"<br/><br/><br/><br/>This is a suspense style visual novel game that unfolds different branching plots in the form of choices.<br/>The player collects clues for multiple endings to make up a complete story.<br/>Unlike other games, no matter what the ending is, the protagonist will commit suicide at the end.<br/>Please remember that the character you play will die this thing, and then go to try to find meaning of your existence in these seven days.<br/><br/><br/><br/>The protagonist, Hanchuan, Assumed the position of monitor in the class.<br/>He is involved in a bizarre criminal case with the disappearance of a student in his class.<br/>The missing student is suspected to be a member of a counseling website, which gives the advice \"better to die\" to every counselor.<br/>With the aim of eternal peace, the site's followers gradually spread around Hanchuan.<br/>At the same time, criminals are also targeting Hanchuan and his friends.<br/>How will he save himself and the people who are important to him?<br/><br/><br/><br/><ul><li>Fully voiced </li><li>More natural live2d effects </li><li>Branches seen will be recorded in the flowchart system </li><li>Native Steam cloud support (can be turned off at any time)</li></ul><br/>", "metacritic": null, "released": "2021-02-11", "tba": false, "updated": "2021-02-12T02:26:45", "background_image": "https://media.rawg.io/media/screenshots/5d5/5d5b56f2f2a4722f8a6695e3061dae05.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 16, "toplay": 1, "dropped": 1}, "playtime": 3, "achievements_count": 2, "ratings_count": 1, "suggestions_count": 286, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "macOS", "Linux"], "developers": ["致意"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["致意"], "esrb_rating": null}