{"id": 555977, "slug": "cats-vs-pickles", "name": "Cats vs Pickles", "name_original": "Cats vs Pickles", "description": "<p>La historia principal trata acerca de la princesa Gerbi, los gatos Naranja y Gris que un día son secuestrados por el malvado rey de los pepinos. Entonces, el gato Comandante decide ir en busca de ellos pero no será tan fácil, ya que las luces se encontrarán apagadas en algunos niveles, debido a los estragos ocasionados por el rey de los pepinos. Esto no es suficiente para detener a Comandante porque cuenta con su maravillosa linterna que le permitirá observar lo que se esconde en las sombras. Finalmente, cada nivel es asombroso pero sobre todo el último que cuenta con un estilo similar al de TLOZ 4 swords adventure combinado con un top down shooter los gatos le harán frente al rey de los pepinos y a sus súbditos, ¿estás listo para ayudar a Comandante a rescatar a sus amigos?</p>\n\n<p>The main story is about Princess Gerbi, the Orange and Gray cats who are one day kidnapped by the evil king of cucumbers. Then, the Commander cat decides to go in search of them but it will not be so easy, since the lights will be off in some levels, due to the havoc caused by the king of cucumbers. This is not enough to stop Commander because he has his wonderful flashlight that will allow him to observe what is hidden in the shadows. Finally, each level is amazing but especially the last one that has a style similar to that of TLOZ 4 swords adventure combined with a top down shooter the cats will face the king of cucumbers and his subjects, are you ready to help Commander to rescue your friends?</p>", "metacritic": null, "released": "2021-02-05", "tba": false, "updated": "2021-02-08T07:46:46", "background_image": "https://media.rawg.io/media/screenshots/ed5/ed56c36dc516422e6f2943551613d397.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 67, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["mesquo"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}