{"id": 556014, "slug": "evade-5", "name": "Evade", "name_original": "Evade", "description": "<strong>Dodge Through Thousands of Bullets</strong><br/>Evade your way through round after round of bullet patterns, ranging for kinda tricky, to incredibly difficult. Tight inputs, fast inputs, and careful planning will be required to get passed them all.<br/><br/><strong>Control 5 Different Playable Characters</strong><br/>Unlock all 5 different playable characters, each with their own strengths, weaknesses, and dialog. Choose the character best-suited to each encounter, or just stick to your favorite. Maybe you'll even discover a backstory or two along the way.<br/><br/><strong>Challenge Powerful Foes</strong><br/>The most memorable part of any stg is the boss battles, so Evade skips straight to the good part. That doesn't mean it's thin on content though, there are 33 unique bosses for you to take down, each with their own (more or less) lovable personality.<br/><br/><strong>Recruit Defeated enemies</strong><br/>Choose between 6 different assists, unlocked by defeating them in battle. Each assist is strong against different types of enemy, and synergizes with different player characters.<br/><br/><strong>Perfect Your Highscores</strong><br/>Polish your skills to master Evade's scoring system. Defeat enemies, graze bullets, and don't get hit and you could top a leader board. Each stage has its own high score table, giving you dozens of opportunities to come out on top.", "metacritic": null, "released": "2021-02-10", "tba": false, "updated": "2021-02-12T02:37:06", "background_image": "https://media.rawg.io/media/screenshots/21e/21ece470721c579dddb0844ffed77750.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 293, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Argos Games"], "genres": ["Action", "Indie"], "publishers": ["Argos Games"], "esrb_rating": null}