{"id": 556013, "slug": "liu-bai-whitewash", "name": "留白(WhiteWash)", "name_original": "留白(WhiteWash)", "description": "There is a game, it can \"eliminate\" time, and can \"eliminate\" color.<br/>\n<br/>\r\nChinese painting pays attention to the beauty of white space, and the design circle also advocates the simple concept of \"less is more\".<br/>\n<br/>\r\nThere are too many colors  and too many thoughts in life.<br/>\n<br/>\r\nTrivial days are bittersweet. <br/>\n<br/>\r\nBoth the wonderful  and the sad can be cleared up in this game.<br/>\n<br/>\r\n+++++++++++++++++++++++++++++++++++++++++++++++++++<br/>\n<br/>\r\nThis is a casual Match-3 game.<br/>\n<br/>\r\nThe little cat is a white-space artist, and her gallery shows her paintings over the past year.<br/>\n<br/>\r\nInstead, his paintings are flooded with \"color sprites\" who move in a certain way. The little cat then travels through the world of her artwork, firing \"color sprites\" cannon balls in various ways to eliminate the \"color sprites\" before they move out the picture.<br/>\n<br/>\r\nIt sounds like Zuma. But there are lots of differences between them.<br/>\n<br/>\r\nThe \"color sprites\" can morph into any familiar object, such as flowers, fruit, balloons, etc.<br/>\n<br/>\r\nAt least two identical \"color sprites\" can be eliminated by touching.<br/>\n<br/>\r\n\"Color sprites\" don't follow exactly the trajectory, they can be knocked off track and even be crashed out of the picture.<br/>\n<br/>\r\nThere are  100 \"color sprites\" flowing into the screen in each level. Eliminate 60 of them to complete the level. Of course, the higher the score, the better.<br/>\n<br/>\r\nFollow the cat through one year, four seasons, 12 months, 48 levels of wonderful adventure!<br/>\n<br/>\r\n+++++++++++++++++++++++++++++++++++++++++++++++++++<br/>\n<br/>\r\ntips:<br/>\n<br/>\r\n1. In the gallery, click on the title below each painting to enter the highest game progress for that month. At the top of each painting, the small light bulb that has been lit can also be clicked to enter the corresponding level. Small flashing light bulbs represent levels to be crossed. You can't click if it's not lit.<br/>\n<br/>\r\n2. If you succeed in all 48 levels, a small certificate will appear in the gallery praising your efforts.", "metacritic": null, "released": "2021-02-10", "tba": false, "updated": "2021-02-12T02:36:36", "background_image": "https://media.rawg.io/media/screenshots/595/595c7b5cfd8d3dfd97f0ec71c80c812b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 95, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Zuo Yan"], "genres": ["Casual", "Indie"], "publishers": ["Zuo Yan"], "esrb_rating": null}