{"id": 556031, "slug": "centrifugal", "name": "Centrifugal", "name_original": "Centrifugal", "description": "<h3>Welcome, travelers!</h3>Our rocket is lost in nowhere of the universe. We need you to use your excellent flying skill to navigate it back! Are your ready to accept this challenging mission?<h3>How to play \"Centrifugal\":</h3>\"Centrifugal\" is a hardcore but fun game.<br/><br/>Our rocket is mounted with a unique gravity engine. Due to its special design, you are not able to rotate the rocket by itself. However, you can control the gravity that is affecting the rocket. We have to use the centripetal and centrifugal forces of the planets to make turns and navigate our rocket back!<br/><br/>When holding down [SPACE], the gravity engine is turned on. Besides accelerating, the rocket also gets rid of gravity and fly in a straight line. Look for a good opportunity and use this method to efficiently travel between planets.<br/><br/><br/>When releasing [SPACE], the gravity engine is turned off. The rocket will be captured by the planets and fly in a curved orbit. Use this method to rotate your rocket and adjust the trajectory!<br/><br/><br/>The only operating physics law in this universe is the gravity equation. Which means, larger the planet, bigger the attraction force. Closer the distance between the rocket and the planet, bigger the attraction force as well.<h3>What's inside \"Centrifugal\":</h3>We have to travel through different star systems to return home. Make sure to use the physics wisely and avoid crashing...<br/><br/><br/>Don't get hit by the meteors...<br/><br/><br/>And don't get sucked into the blackholes...<br/><h3>In \"Centrifugal\", you can:</h3><ul><li>Travel through various constellations and stars! These are real constellations in our world: Lyra, Aquila, Cygnus, Big Dipper (part of Ursa Major), and Ursa Minor.<br/></li><li>Enjoy the feeling of manipulating gravity!<br/></li><li>Achieve the highest score you can by rushing through the finish line!<br/></li><li>Explore the infinite universe and see how far you can go! Challenge yourself and break the record!<br/></li><li>Customize the appearance of your rocket! Unlock them with tokens you earned by achieving high score.<br/></li><li>Play multiplayer mode and have fun with your friend! Two players will control one rocket at a time, and each of them will control a different thruster. The key here is to have excellent collaboration with your friend!</li></ul><h3>Last but not least, Good Luck &amp; Fly Safe!</h3>", "metacritic": null, "released": "2021-02-10", "tba": false, "updated": "2021-02-12T02:48:43", "background_image": "https://media.rawg.io/media/screenshots/443/443f855e53bcff610a9eb84a8b7dfdfb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 98, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Merxon22"], "genres": ["Racing", "Casual", "Indie"], "publishers": ["Merxon22"], "esrb_rating": null}