{"id": 556069, "slug": "my-universe-pet-clinic-cats-and-dogs", "name": "My Universe - Pet Clinic Cats and Dogs", "name_original": "My Universe - Pet Clinic Cats and Dogs", "description": "To play this game on PS5, your system may need to be updated to the latest system software. Although this game is playable on PS5, some features available on PS4 may be absent. See PlayStation.com/bc for more details.<br/>Discover the veterinary profession and help cats and dogs that need you. <br/>An injury, fever, an animal that refuses to eat: it’s up to you to act! Pay close attention during the medical examination, decide what care your four-legged patients need and take care of their personal well-being through dozens of activities.<br/><br/>Become the head veterinarian<br/>Fulfill your dreams and learn to run your own clinic in an adventure full of twists and turns. Develop your veterinary career to unlock new treatments, recruit new helpers and welcome more animals in distress.<br/><br/><br/>Personalize your clinic<br/>Choose the appearance of your character and decorate the different rooms of your clinic to reflect your style. Upgrade your medical equipment, but don’t forget to give your canine and feline patients a little tenderness and petting to help them feel better!<br/><br/><br/>- Master dozens of treatments to cure animals: X-rays, bandages, a stethoscope, preparing medicine...<br/><br/>- House the animals in different rooms of the clinic and come to the aid of your four-legged patients<br/><br/>- Listen to the animals and become the best vet ever!<br/><br/>- Expand and upgrade your clinic to take advantage of the best instruments for treatment<br/><br/>- Spend time with the animals and develop a true bond with them<br/><br/><br/>Offline single player<br/>Remote Play allows users to connect to and play games on their PlayStation®4 or PlayStation®5 using a mobile device, PC, or another PlayStation®4 or PlayStation®5.<br/><br/><br/>Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy). <br/><br/>Software subject to license (us.playstation.com/softwarelicense). <br/><br/>One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.<br/>", "metacritic": null, "released": "2021-02-09", "tba": false, "updated": "2023-03-04T03:00:57", "background_image": "https://media.rawg.io/media/screenshots/9d8/9d8fa8a30fbb1f2c1e7720ce5ebd8439.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 275, "game_series_count": 0, "reviews_count": 1, "platforms": ["PlayStation 4"], "developers": [], "genres": [], "publishers": [], "esrb_rating": null}