{"id": 556043, "slug": "earth-analog", "name": "Earth Analog", "name_original": "Earth Analog", "description": "In <strong>Earth Analog</strong> you take control of the exploration vessel Eurisko XI in a quest through <strong>deep space</strong>. Your goal: find our new home.<br/><br/>In this story rich <strong>space flight adventure</strong> you must keep your ship in one piece while traveling through mysterious and often dangerous worlds. Apart from steering and landing your ship and exploring distant planetary systems you will also have to keep all the ship systems operational, which involves prospecting and mining for resources, upgrading ship systems and fixing broken parts. Hunt for precious stones and artifacts to unlock new paths in your journey. And will you be able to control the mysterious Dimension Device? It's all up to you, you are completely alone out there... or are you?<br/><br/>Earth Analog is mostly a relaxing game, with the occasional tense moment. You start the game orbiting Proxima Centauri b, a conventional and familiar planet in some ways. But as you travel deeper into space you'll discover ever so stranger worlds... can you survive in your \"tin can\"?<br/><br/>For fans of: <strong>Interstellar, 2001: A Space Odyssey</strong><br/><br/>Features:<br/><ul><li> A vast universe to explore with both hand-crafted and procedural <strong>fractal</strong>-based planets and stars.<br/></li><li> An intriguing single player adventure based on a story full of drama and plot twists.<br/></li><li> An atmospheric and newtonian flight model.<br/></li><li> Solve each planet's often dangerous mysteries.<br/></li><li> A fully ray tracing based graphics engine bringing never before seen worlds to life.<br/></li><li> HOTAS support.</li></ul><br/>The game is based on a unconventional render technique called ray marching, which allows it to visualize its fractal-based worlds. <strong>You need a good GPU to be able to play the game at higher resolutions!</strong> Please check if you system meets the minimal requirements.", "metacritic": null, "released": "2021-02-10", "tba": false, "updated": "2022-07-24T12:19:31", "background_image": "https://media.rawg.io/media/screenshots/924/92406ce8131d7b76b5acdca2929f67d0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 11, "beaten": 1}, "playtime": 1, "achievements_count": 10, "ratings_count": 1, "suggestions_count": 360, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Funcraft Games"], "genres": ["Action", "Adventure", "Simulation", "Indie"], "publishers": ["Funcraft Games"], "esrb_rating": null}