{"id": 556005, "slug": "erzurum", "name": "Erzurum", "name_original": "Erzurum", "description": "Erzurum, one of the coldest cities in Turkey. It wasn't the best idea for Taylan traveling through desolate regions of Erzurum on foot in winter. What he doesn't know yet is he's about to enter a region affected by a meteor strike. As if harsh conditions weren't enough, more troubles are waiting for him ahead.<br/><br/>Erzurum is a winter survival game which you will struggle against freezing temperatures, the wild nature, hunger and thirst. To struggle against harsh conditions, you need to find woods or coals to light a fire and keep yourself warm, find beds to sleep, find food, guns, medical items, useful tools...Whatever to keep you alive.<h3>GAME MODES</h3><br/>STORY : Play the story mode to discover occasions that the protagonist come across and his fate in the end.<br/><br/>SANDBOX : If you want an endless game with the same mechanics with the story mode, Sandbox mode is here for you. If the player dies, they can continue from the last save. It's just endless.<br/><br/>CHALLENGES : This section is for experienced players who need harder challenges. In Challenges mode, there are various types of challenges you can choose. Some of these types are endless storm, colder weather, timed missions, more populated predators, etc.<h3>BIG OPEN WORLD</h3><br/>As the size of 9 square kilometres, the game world offers a lot to discover. More than 30 locations are waiting to be discovered.<h3>DYNAMIC WEATHER, TEMPERATURE AND TIME</h3><br/>Weather, temperature and time are bound to each other and change dynamically to ensure realistic nature events like sunny or overcast day, freezing night,  morning frost, etc. Also random events like light snowfall, heavy snowfall, snow storm, foggy weather, etc.<h3>KEEP YOURSELF WARM</h3><br/>Collect woods or coals. Light a fire indoor. Lay back and watch beautiful snowing outside while you drink hot tea.<h3>FIRST PERSON AND THIRD PERSON</h3><br/>Dynamically switchable two cameras : First person and third person.<h3>LOOT THE WORLD</h3><br/>Explore the world and loot food, fuel, ammunition, clothes, medical items, tools, ingredients that help you survive.<h3>CRAFTING AND COOKING RECIPES</h3><br/>Collect ingredients to craft simple tools, advanced tools, electronic tools, ammunition and more. Collect cooking ingredients to cook delicious food like kebab, tarhana soup, Turkish coffee, bread and more.<h3>WEAPONRY</h3><br/>Find firearms like pistols, rifles to defend yourself against brutal predators.<h3>HUNT OR BE HUNTED</h3><br/>Hunt deer, rabbits, for food. Avoid being hunted by bears, wolves and boars.", "metacritic": null, "released": "2021-02-10", "tba": false, "updated": "2023-01-26T10:39:55", "background_image": "https://media.rawg.io/media/screenshots/827/8277127a641e807a7253b31ffd1e8b96.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 64}, "playtime": 4, "achievements_count": 27, "ratings_count": 1, "suggestions_count": 279, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Proximity Games"], "genres": ["Adventure", "Indie"], "publishers": ["Proximity Games"], "esrb_rating": null}