{"id": 55609, "slug": "super-robin-hood", "name": "Super Robin Hood", "name_original": "Super Robin Hood", "description": "<p>Super Robin Hood is a Robin Hood-themed platform game published in November 1985 by Codemasters. It was reworked as Robin Hood: Legend Quest in 1992 when it was also released for the Amiga and Atari ST.</p>\n<p>The Oliver twins developed the game for the Amstrad CPC when they were age 17; it and was their first game published by Codemasters. Codemasters offered the brothers £10,000 for the game, because the company expected to sell 100,000 copies with royalties of 10p per unit sold. The twins worked on a single computer in a bedroom of their parents' house. Working in shifts, they coded for 18 to 23 hours per day; they took 30 minute breaks to allow the computer to cool. Sometimes, one brother coded on paper while the other used the computer.</p>\n<p>The game was well-received by critics, and sold well. After Codemasters asked the brothers to produce another game, they developed Ghost Hunters, which was released in February 1986.</p>\n<p>Codemasters reworked Super Robin Hood for the NES (also released on the four-in-one NES cartridge Quattro Adventure, published by Camerica in 1993). This reworked version was also released as Robin Hood: Legend Quest in 1992 and 1993 on both the 8-bit home computers the first game had been released on as well as 16-bit home computers.</p>", "metacritic": null, "released": "1985-11-01", "tba": false, "updated": "2019-08-28T22:26:02", "background_image": "https://media.rawg.io/media/screenshots/4ec/4ecce0f43472b98c51f56bb5c61cddb5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4, "beaten": 2, "toplay": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 340, "game_series_count": 0, "reviews_count": 1, "platforms": ["Commodore / Amiga"], "developers": ["Oliver Twins", "The Oliver Twins"], "genres": [], "publishers": ["Codemasters"], "esrb_rating": null}