{"id": 556130, "slug": "relax-jigsaw-puzzles", "name": "Relax Jigsaw Puzzles", "name_original": "Relax Jigsaw Puzzles", "description": "Relax Puzzles (Relax Jigsaw Puzzles) are puzzles for adults and children. This puzzle game lets you complete puzzles for free offline, including puzzles made from your photos.<br/><br/> What you’ll love about Relax Puzzles: <br/>- Daily puzzles - new free puzzles every day!<br/>- You can complete puzzles offline!<br/>- A wide range of puzzles with different themed collections.<br/>- A range of difficulty levels from 24 to 294 pieces, with rotation and without!<br/>- You can create puzzles from your own photos.<br/>- You can work on several puzzles at once.<br/>- A special help button, the option to view the completed picture or even change the background.<br/>- A special game mode for left-handed players.<br/><br/>You’re sure to love doing our wonderful puzzles!<br/><br/>A jigsaw puzzle is a type of puzzle consisting of an image split into small, irregularly-shaped pieces, which then have to be fit together to form a complete picture. Completing the puzzles takes dedication, patience, and concentration.<br/>Some say that jigsaw puzzles were invented in 1760 by John Spilsbury, a London engraver, cartographer, and publisher, when he cut a paper map into a number of small pieces of various shapes.<br/><br/>Puzzles are more than just a fun way to spend time. They also enhance your fine motor skills, help you look at problems from different perspectives, develop your imagination, your spatial reasoning, your attention span, your concentration and memory, as well as your ability to make decisions independently. All of these things are particularly important for children. Relax Puzzles offers children ages 3 and up practice with all of these skills.<br/><br/>There are plenty of ways to do puzzles online on your computer, but our mobile app lets you put together puzzles wherever you want: out with friends, on public transport, even in the woods. You can still complete our puzzles, even without an Internet connection.<br/><br/>One major upside of using a jigsaw puzzle app compared to traditional puzzles is that an app takes up much less space! Think of how sad you feel when you’ve nearly completed a puzzle, but the final piece has gone missing. What game offers a free solution to this problem? Relax Puzzles, of course - a fun new competitor in the jigsaw bestgames category among puzzle games, as well the offline games category.<br/><br/>Relax Puzzles is a free-to-play game, but it does contain in-game purchases. If you have any questions or feedback, contact us at support@openmygame.com - we’ll be happy to hear from you! Who knows, maybe your suggestion for improving the game will be included in the next update!<br/><br/>OpenMyGame offers you the chance to dive headfirst into the fun and fascinating world of puzzles. This is the sign you’ve been waiting for - open the app and get one step closer to total relaxation!", "metacritic": null, "released": "2020-04-02", "tba": false, "updated": "2021-02-12T03:54:32", "background_image": "https://media.rawg.io/media/screenshots/ef2/ef28975e33849152ab02b8eec87fe7c3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 171, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["OPENMAIGEIM, OOO"], "genres": ["Board Games", "Puzzle"], "publishers": ["OPENMAIGEIM, OOO"], "esrb_rating": "Everyone 10+"}