{"id": 556138, "slug": "gold-and-goblins-idle-miner", "name": "Gold and Goblins: Idle Miner", "name_original": "Gold and Goblins: Idle Miner", "description": "Play the Best Idle Mining Game and have a Magical Adventure!<br/><br/>BUILD mineshafts and goblin cannons to help the Goblins rebuild their fortune<br/>MERGE goblins to power them up<br/>MINE rocks to find treasure and gold<br/>UNLOCK new mineshafts to boost your gold income<br/>EXPLORE tons of mines in this amazing 3D miner simulator.<br/>COLLECT cards and upgrade your mineshafts and goblins. There are tons of cards and special abilities to find.<br/><br/>Gold and Goblins: Idle Miner, brings the best of both Idle and Merging games into one amazing new experience! Merge your Goblins, mine away rocks and collect gold and treasures to help the Goblins get their mines back to their former glory. <br/><br/>Tap to collect Gold, get Rich and explore caves full of Magic and Wonder in this 3D Idle simulation game. Play in limited timed events and compete against other players to climb the leaderboards and earn amazing rewards. <br/><br/>FEATURES OF THIS GOLD IDLE MINER TYCOON SIMULATOR<br/>-Collect idle gold, even when offline<br/>-Over 45 unique mines to explore with new mines being added all the time<br/>-Complete in limited time events against other players<br/>-Collect all kinds of cards upgrades to boost gold income and get stronger goblins<br/>-Beautiful 3D environments to explore<br/>-Merge gameplay mechanics to become even more powerful<br/>-One of the most polished Idle games on the store<br/><br/>Like Gold &amp; Goblins: Idle Miner on Facebook! <br/>https://www.facebook.com/GoldGoblins<br/><br/>Twitter <br/>https://twitter.com/GoldGoblins<br/><br/>Any problems or suggestions?<br/><br/>Feel free to send a message to<br/>support@redcellgames.com<br/><br/>– We are always happy to receive our players’ feedback!", "metacritic": null, "released": "2020-09-16", "tba": false, "updated": "2021-02-12T03:58:34", "background_image": "https://media.rawg.io/media/screenshots/0e0/0e06335f4805088d73d92b0dc8c638b2.jpg", "website": "https://appquantum.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 163, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["ADQUANTUM"], "genres": ["Simulation", "Casual"], "publishers": ["ADQUANTUM"], "esrb_rating": "Everyone 10+"}