{"id": 556168, "slug": "flying-motorbike-real-sim-3d", "name": "Flying Motorbike Real Sim 3D", "name_original": "Flying Motorbike Real Sim 3D", "description": "Play new exciting motorbike driving simulator game Flying Motorbike Real Simulator by Best Free Games and ride on fast real flying bike. In latest bike driving game and flying simulation you can choose from many hi-tech flying motorbikes. Get on your bike and zoom through busy city streets with fast speed or overcome traffic rush by flying bike in the sky.<br/>Press a button to transform your bike into marvelous airplane like flying bike with wings. Just rev the bike engine to enjoy high speed limits using nitro boost. Fly high in the sky in airplane mode and touch extreme speeds with nitro boosters.<br/>You can provide flying taxi service on your flying motorcycle and collect taxi fares. Give exciting flying transportation experience to passengers with best of flying motorbikes game.<br/>Enjoy unique flying taxi service and explore huge open world when driving through streets. Be the best pilot of the flying motorbike in one of the best flying motorbike simulators!<br/>Take off to the skies in airplane flight mode and perform amazing flying stunts using flying controls. In flying motorbike games, jet engines are used to transform bike into flying taxi bike.<br/>Download free bike game Flying Motorbike Real Simulator by Best Free Games  with realistic bike driving and flying controls and use flying taxi bike to transport people to their destination in one of the best flying bike games.", "metacritic": null, "released": "2020-10-29", "tba": false, "updated": "2021-02-12T04:13:13", "background_image": "https://media.rawg.io/media/screenshots/79c/79c2e2b5dc23df0bead6c1951dc144d0_TJjHdMF.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 273, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["hamza khalid"], "genres": ["Simulation", "Racing"], "publishers": ["hamza khalid"], "esrb_rating": "Everyone 10+"}