{"id": 556187, "slug": "mini-market", "name": "Mini Market", "name_original": "Mini Market", "description": "Mini Market<br/><br/>At the Mini Market, customers are lining up to try your tasty goods in this fun sorting and cooking game. Fill their orders by finding the right foods—fruit, vegetables, candies and deli goods—as well as whipping up delicious burgers, smoothies and ice creams according to their instructions. Count the right change and send them on their way smiling, then use your takings to build your supermarket’s inventory with exciting new ingredients to keep the crowds coming.<br/><br/>All the ingredients of an absorbing game for all ages<br/><br/>• Straightforward gameplay that’s easy enough for the youngest players to master but still provides hours of fun for all age groups.<br/><br/>• Develops counting, shape recognition, differentiation, and fine motor skills, as well as attention to detail.<br/><br/>• Wide range of fruit, vegetables, and other ingredients promoting curiosity and healthy eating, as well as expanding vocabulary.<br/><br/>• Classic cooking-game scenarios in a simple-to-play and engaging format with gradual undemanding progress that encourages responsible gaming.<br/><br/>•  Clear and colorful original design that’s comfortable for kids and attractive for adults, too<br/><br/>•  Calm, cheerful music and exciting sound effects to enhance your supermarket  experience<br/><br/>•  Fun customer characters, all with a friendly comment and unique food requirements<br/><br/>•  Teaches the basic principles of commerce and customer service in a casual setting<br/><br/><br/>Come on down to the store where the fun never ends<br/><br/>Serve up a storm of mouth-watering burgers, super-healthy smoothies and delicious ice creams in this charming sorting game that’s a joy to play for all ages. Keep on sorting ingredients, serving customers and counting change to make the Mini Market the most popular food store in the neighborhood. <br/><br/>Head to the Mini Market now for hours of exciting, developmental fun.", "metacritic": null, "released": "2021-02-01", "tba": false, "updated": "2021-02-12T04:20:55", "background_image": "https://media.rawg.io/media/screenshots/8a8/8a8c020979c97bf83a7ea7320b76da44_ydREY9y.jpg", "website": "https://web.facebook.com/FAStTheory", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 54, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Aleksandr Filatov"], "genres": ["Simulation"], "publishers": ["Aleksandr Filatov"], "esrb_rating": "Teen"}