{"id": 556100, "slug": "onet-new-classic-link-puzzle", "name": "Onet New - Classic Link Puzzle", "name_original": "Onet New - Classic Link Puzzle", "description": "Onet New - Classic Link Puzzle Game is a popular and addictive pair matching puzzle game.<br/>The game has tons of challenging well-designed levels to train your brain, exercise your logical thinking and memory.<br/>It is the best time killer for you! Play for free this awesome link game and enjoy hours of fun connecting lovely images of cute christmas, animals, food, beautiful flowers, and so much more.<br/>In this exciting blast game, your goal is to remove all the images from the board by connecting pairs of identical images.<br/><br/>HOW TO PLAY?<br/>* Match and connect pairs of the same kind images<br/>* Link two identical images and tap to draw a line between them<br/>* Match farther images to gain more stars: longer lines=more points!<br/>* Use the HINT to reveal a possible connection<br/>* Use the SHUFFLE to rearrange all the images randomly<br/>* Use the SCISSORS to remove bomb<br/>* Use the SWAP to change theme image<br/>* Match Bomb tile before it explodes<br/><br/>FEATURES:<br/>- EASY to learn line connect game<br/>- Plenty of amazing THEMES<br/>- Exciting PAIR MATCHING ADVENTURE for everyone to enjoy!<br/>- HINT and SHUFFLE amazing boosters<br/>- Fun PUZZLES to train your brain<br/>- STUNNING graphics and beautiful levels<br/>- FREE to play onet MEMORY GAME<br/>- Play ONLINE or OFFLINE: you don’t need to worry about a Wi-Fi or internet connection<br/>- Levels with timed bomb cards<br/>- Revive after fail<br/>- AUTOSAVE, continue playing where you left off.<br/>- Classic \"onet connect\" game mechanics<br/><br/>Onet New - Classic Link Puzzle Game is seriously fun and addictive.<br/>Thank you for playing Onet New - Classic Link Puzzle Game! We'll update Onet New regularly, stay tuned.<br/>Please rate us 5 stars if you like game, we’re glad to hear any feedback/suggestion/request from you.", "metacritic": null, "released": "2021-01-04", "tba": false, "updated": "2021-02-12T03:38:29", "background_image": "https://media.rawg.io/media/screenshots/803/80374633b8d5f9e992a1fc07a0e06755.jpg", "website": "https://tigstudio.app", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 80, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tho Huynh Ngoc"], "genres": ["Board Games", "Puzzle"], "publishers": ["Tho Huynh Ngoc"], "esrb_rating": "Everyone 10+"}