{"id": 556214, "slug": "police-car-driving-crime-city", "name": "Police Car Driving: Crime City", "name_original": "Police Car Driving: Crime City", "description": "Ready to become the latest in the line of duty of the best police in the city? Get straight into the epic police driving action as you take to the streets and uphold the law to put a stop to dangerous drivers and ruthless criminal in one of the best first person police car driving simulator games!<br/><br/>Perform your cop duty, take on reports to find and arrest criminal drivers to help clear the city streets of crime. Choose from a wide selection of top of the line police grade cars and police motorbikes. Take the call over your police radio, blast the police car sirens, and pursue the criminal in the all-new police car driving action game!<br/><br/>!! Police Car Driving: Crime City is a new open world driving simulator !!<br/><br/>Explore the city and drive real police cop cars and motorbike in the huge open world, filled with miles of road to drive on. Exit your vehicle at any time to explore on foot, patrol the streets around the city and surrounding countryside in the exciting open world action game. Blast past busy city rush hour traffic on you police motorbike riding at top speeds!<br/><br/>Experience real police duty action, take on unique cop missions like vehicle takedowns, hostage situations, V.I.P. vehicle escorts, drug busts, and a whole load more! All-new exciting police crime-fighting action ready to play right now!<br/><br/>Example of missions:<br/>- Save victims in hostage situations<br/>- Chase and pursue dangerous criminal drivers<br/>- Take on risky crime hideout bust-ups<br/>- Protect and escort V.I.P vehicles<br/>- Stop and arrest all the gangsters with police SUVs and other cops cars<br/>- Drive quickly to stop fleeing criminals<br/><br/>Upgrade your police gear with new, more powerful weapons and vehicles. Get the keys to drive your own police vehicle from a wide selection of city cars, sports motorbikes, offroad 4x4 trucks, dirtbikes, and more fast cop vehicles! Take on the criminal robbers with Desert Eagles, M16, hand grenades, mini-guns, and a whole load more to try out!!<br/><br/>All thrills action of police motorbike riding can be played now! At any time alerts from the police radio, accept the police response and make your way to the crime to get right into the real cop action. If that doesn't sound like your style, decline the call and explore the city open world in your cop car, motorbike, or on foot. Do whatever it takes to be one of the best police officers!<br/><br/>Features:<br/>- A huge, incredibly detailed open world environment<br/>- Miles of intricate road systems to drive on, city road and offroad!<br/>- A realistic police car and motorbike driving simulator<br/>- Realistic driving and first-person gameplay physics<br/>- Real-time vehicles damage<br/>- High-quality police vehicles and weapons<br/>- Unlimited mission objectives, non-stop action!!<br/>- Dynamic camera angles<br/>- Easy to play driving controls, use touch, wheel and tilt controls!<br/><br/>Watch out for your health and your vehicle's stability, be sure to look out for garages and hospitals around the city for police vehicle repair and player health packs to keep you going longer in the line of police duty.<br/><br/>Witness non-stop action in the latest police driving game as it brings you closer to the realistic police duty. A massive open world for the best police driving simulator game experience! Drive, drift, crash, chase, and arrest criminals around a huge detailed open city with real police cars and cop motorbikes! <br/><br/>Play the most realistic action-packed police motorbike and car driving game you'll ever experience, Police Car Driving: Crime City", "metacritic": null, "released": "2018-08-16", "tba": false, "updated": "2021-02-12T04:31:57", "background_image": "https://media.rawg.io/media/screenshots/a89/a891622d01e8f68ec268530561f0ee23_N2nYphE.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 142, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["GameShark"], "genres": ["Action", "Simulation"], "publishers": ["GameShark Studios"], "esrb_rating": "Everyone 10+"}