{"id": 55621, "slug": "sensible-world-of-soccer", "name": "Sensible World of Soccer", "name_original": "Sensible World of Soccer", "description": "<p>Sensible World of Soccer was designed and developed by Sensible Software as the 1994 sequel to their 1992 game Sensible Soccer which combined a 2D football game with a comprehensive manager mode. The game includes contemporary season data of professional football from around the world, with a total amount of approximately 1,500 teams and 27,000 players.<br />\nAlthough the gameplay is simple (eight directions and one fire button) a large variety of context sensitive actions can be performed without any predefined keys.<br />\nThe game was ranked best game of all time by Amiga Power. In 2007 Henry Lowood, Curator for History of Science and Technology Collections in the Stanford University together with game designers Warren Spector and Steve Meretzky, researcher Matteo Bittanti and journalist Christopher Grant compiled a definitive list of &quot;the ten most important video games of all time&quot;. This list included Sensible World of Soccer. Sensible World of Soccer&#39;s inclusion in this list is notable on three accounts: it is the only game in the list developed in Europe, it is the only sports game in the list, and it is the most recent game in the list.</p>", "metacritic": null, "released": "1994-01-01", "tba": false, "updated": "2022-11-05T14:59:19", "background_image": "https://media.rawg.io/media/screenshots/129/1299ef5968773db7999897bc5a9fec46.jpg", "website": "", "rating": 0.0, "rating_top": 5, "added_by_status": {"yet": 6, "owned": 4, "beaten": 3, "toplay": 1, "dropped": 4}, "playtime": 0, "achievements_count": 0, "ratings_count": 5, "suggestions_count": 183, "game_series_count": 0, "reviews_count": 5, "platforms": ["Xbox One", "Commodore / Amiga", "PC", "Xbox 360"], "developers": ["Sensible Software"], "genres": ["Sports"], "publishers": ["Microsoft Studios", "Codemasters", "GT Interactive", "Renegade Software", "Renegade"], "esrb_rating": null}