{"id": 556256, "slug": "haunted-house-mysteries-full-a-hidden-object-adven", "name": "Haunted House Mysteries (full) - A Hidden Object Adventure", "name_original": "Haunted House Mysteries (full) - A Hidden Object Adventure", "description": "What better way to spend your vacation than next to a haunted house by the seaside?<br/><br/>Nancy Evans is an expert in superstition and modern societies. She's been invited by her aunt, Mary Allen, to spend a few days in a quiet cottage by the sea. What she doesn't know is that, next to the cottage, there's a large, run-down house that has a macabre atmosphere.<br/><br/>You play Nancy Evans and must investigate the strange phenomena coming from this gloomy house. According to Mary, it's haunted by ghosts. Indeed, her interest in mysticism has her thinking that the creaking that can be heard, the shadows wandering the halls, and the strange smell that sometimes prevails there are all very strange. Nancy goes there and is amazed to discover that the spirits are trying to communicate with her. They're leaving messages for help in the world of the living. What's happened in this house?<br/><br/>KEY POINTS :<br/>• Keep your cool and explore a real haunted house in the search for clues on the appearance of ghosts.<br/>• Discover the history of the house and the macabre secrets it hides.<br/>• Complete paranormal rituals to communicate with the ghosts.<br/>• Solve complex riddles to advance in your investigation.<br/>• Use the Hint: a shiny halo helps you to find one of the objects. <br/>• During the mini-games, after a few minutes you you'll be able to use the skip bar in order to solve the puzzle<br/>• Retina Display (iPad / iPhone / iPod Touch)<br/>________________________________________<br/><br/>You have a comment, an opinion, a question, a proposition about one of our games or apps?<br/> <br/>Send an email to community@anuman.fr<br/>or<br/>join our Facebook fanpage!<br/> <br/>You have a technical issue? <br/>Contact support@anuman.fr<br/>_________________________________________", "metacritic": null, "released": "2013-10-10", "tba": false, "updated": "2021-02-12T04:52:35", "background_image": "https://media.rawg.io/media/screenshots/40a/40a8dfb74d0503712a72bada70502084.jpg", "website": "http://www.anuman.fr/logiciel-iphone_et_ipod_touch.html", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 240, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Microids"], "genres": ["Adventure", "Puzzle"], "publishers": ["Microids"], "esrb_rating": "Everyone 10+"}