{"id": 556207, "slug": "flying-car-transport-simulator", "name": "Flying Car Transport Simulator", "name_original": "Flying Car Transport Simulator", "description": "Drive hi-tech flying cars in the all-new exciting car driving simulator game. Drive fast cars down city streets or fly high in the sky above the city like an airplane. Help pick up taxi fares in the latest in taxi driving experiences, fly passengers in style in the best of flying cars. The latest in driving and flying simulations with one of the best flying car games on the store!<br/><br/>!!!DOWNLOAD FLYING CAR TRANSPORT SIMULATOR FOR FREE!!!<br/><br/>Get into the driver's seat of unique vehicles, transform from a top speed racing car into an incredible fast and nimble airplane with the press of a button. Push down on the gas pedal and activate the nitro boost to reach top speed for takeoff and fly to the skies. Activate plane mode and see the wings transform from the car doors, perform aerial maneuvers to dodge city skyscrapers and other flying cars.<br/><br/>- Drive and fly cars to extreme speeds with nitro boosters<br/>- Pick up and drop off busy passengers in the most unique taxi service<br/>- Explore amazingly detailed city environment, drive through streets or fly between tall skyscrapers<br/>- Become the world's best pilot of the flying car prototype<br/><br/>One of the best flying car driving simulators, perform amazing stunts, drift around city streets, go offroad or take off to the skies in airplane flight mode. Quickly transform from a fast racing car into a unique flying car equipped with jet engines! Go from street driver to air pilot in one of the best flying car games available!<br/><br/>GAME FEATURES:<br/>- Realistic driving and flying control<br/>- Unlimited passenger pickup missions<br/>- Next-gen HD game graphics<br/>- Fly around the city with other AI flying traffic<br/>- Real life sports car modified for flight capability<br/>- Massive open world city world environment<br/>- Realistic car driving and flying controls<br/>- Dynamic HD camera angles<br/>- Simulated airplane flight physics<br/>- Free to play!!<br/><br/>Flying Car Transport Simulator is made for all flight and driving simulation games, enjoy everything about both simulators all in one awesome package. Help get passengers to the theri destination on time in one of the best flying car simulator games!", "metacritic": null, "released": "2020-03-25", "tba": false, "updated": "2021-02-12T04:29:03", "background_image": "https://media.rawg.io/media/screenshots/444/4442fd30a5016435ba857b09b276741b_RUOnsVC.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 202, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["MH Production"], "genres": ["Action", "Simulation"], "publishers": ["Phouthasone Bouapha"], "esrb_rating": "Everyone 10+"}