{"id": 556261, "slug": "cafe-twilight", "name": "Café Twilight", "name_original": "Café Twilight", "description": "\"Café Twilight\"<br/>It's somewhere far, far away, at the end of the world, and at the end of the end of the world again. It is a strange coffee shop that is only open at dusk. A lot of \"storytelling music\" from all over the world and ancient times is played there. The music played by the owner and his customers sometimes brings laughter, sometimes comforts the lonely, sometimes shares blessings, and sometimes Healing the heartbreak and gently being with you now...<br/><br/><br/>\"Game Overview\"<br/>Café, a cafe featuring original characters drawn by Hitoshizuku P While unraveling the original storyline in Twilight as a novel game It is an application to enjoy the music by Hitoshizuku x Yama△ as a rhythm game. You can overcome difficult songs by making full use of items to prevent tap errors, and this is the first time the app has released a song like this. Get the original music!<br/><br/><br/>\"Songs\"<br/>・Bad ∞ End ∞ Night<br/>・soundless voice<br/>・Synchronisity Chapter 1: The Sky Looking for You<br/>・Yamatonadeshiko<br/>・The thirteenth apocalypse.<br/>・Synchronicity Chapter 2: Light and Shadow Paradise<br/>・Karakuri 卍 Burst<br/>・Yakusoku<br/>・Onegaisekai<br/>・Crazy ∞ nighT<br/>・Magic Mirror<br/>・Song for rainy days<br/>・Butterflies, flowers and spiders<br/>・Illusionary Pianist<br/>・Portrait of the Pirate F<br/>・Liberate<br/>・Honor student syndrome<br/>・Queen Thumbelina<br/>・The Acacia Traveler<br/>・??? (This is the first original music to be released on this app.)<br/><br/><br/>\"Game features\"<br/>In this mode, you will be able to play the songs you have obtained as many times as you want in the free mode, as you progress through the story mode, and you will be able to meet new characters and play any song in the free mode.<br/>You will meet new characters as you progress through the story mode, and you can play any song in the free mode as many times as you like. You can choose freely. You can enjoy the different atmosphere of the same song because the score illustration changes depending on your opponent. You can also adjust the speed and timing to suit the player's preference.<br/>You can change the speed and timing of the game according to the player's preference.<br/>You can use the items to prevent tap errors, so even if you are not good at rhythm games, you can play at ease.<br/>You can tweet your high scores and other information directly from this app on Twitter with images, so we hope you'll be happy to share a lot of them with us.<br/><br/><br/>\"Language\"<br/>This app is currently available in two languages: Japanese and English.<br/><br/><br/>\"Compatible Models\"<br/>This app is available for iOS 13.4 or later, iPhone 6s or later, iPad 7th generation or later, iPad Pro first generation or later.<br/><br/><br/>\"Advertisement\"<br/>There is an ad feature, but it will not be displayed unless the player voluntarily views it. You can get coins that can be used in the game by viewing the ads, so please use them if you need them. <br/><br/><br/>\"In-app purchases\"<br/>You can play this app to the end without paying, but we are selling items that will help those people who want to play more easily or get new songs faster, so please make use of them if you need them.<br/><br/>Also, since this app is developed by \"Hitoshizuku\" and \"Yama△\" personally, we would be very happy if you would consider purchasing it as a show of support for the creators.<br/><br/><br/>I hope you will enjoy it to the end.<br/><br/><br/>~\"Welcome to Café Twilight. One drink will play one story for you.\"~<br/><br/><br/>=================================<br/><br/>If you need to check the operation, please use the \"Free Trial Version\". When installing the full version of this application after installing the free trial version, we recommend that you delete the trial version. Please note that we cannot be held responsible for any problems that may occur if you do not comply.<br/><br/>=================================<br/><br/>Powered by \"CRIWARE\".CRIWARE is a trademark of CRI Middleware Co., Ltd.", "metacritic": null, "released": "2021-02-05", "tba": false, "updated": "2021-02-12T04:55:30", "background_image": "https://media.rawg.io/media/screenshots/8b3/8b35246b657da803d15c118ea6f76358_YWwVP4I.jpg", "website": "http://nablatear.com/games/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 212, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Shozo Yamamoto"], "genres": ["Adventure"], "publishers": ["Shozo Yamamoto"], "esrb_rating": "Teen"}