{"id": 556262, "slug": "gravity-rider-full-throttle", "name": "Gravity Rider: Full Throttle", "name_original": "Gravity Rider: Full Throttle", "description": "What are the changes with the Full Throttle edition compared to Gravity Rider Zero?<br/>1 - No ads<br/>2 - All vehicles and paints can be unlocked by playing, no locked content<br/>3 - No continues, but we increased lives for each stage from 1 to 3<br/>4 - No in-app purchases<br/>5 - And still no grinding, no energy system and no limited garage space<br/><br/>Blaze through the full solo experience Gravity Rider has to offer in the best conditions. Go through all 99 levels, unlock all stars and collect the dozens of vehicles and paint jobs.<br/><br/>MAKE YOUR WAY OVER OBSTACLES <br/>Race over obstacles, discover new clever mechanics and trials to overcome in each level. <br/>Giant ramps, lasers, spikes, or good old gravity will try to get in your way. No sweat though, your vehicle is always optimized to have the perfect speed to pass through - with a bit of finesse, you will be fine and not fall off.<br/><br/>DOZENS OF HI-TECH PROTOTYPES TO RIDE <br/>Collect dozens of unique racing vehicles with next level designs. Unlock new bikes by completing tasks, beating challenges or breaking track records: there’s always a new objective and a new reward to look forward to. From trials bikes to ATVs, WW2 era motorbikes to space motorcycle, they’re all there.<br/><br/>FULL CAREER MODE <br/>Enjoy a classic solo career progression system: each of the 33 stages is made of 3 races - complete them in a row without losing all of your 3 lives. Each new stage features a new gimmick, so follow the track and keep your noto balanced to be a line rider. Oh and of course, your vehicle stats will increase along the way: it’s all balanced, but you will get faster.<br/><br/>COLLECT AND CUSTOMIZE <br/>Admire and customize your vehicle collection. Give your race car a new paint job, give your motorbike a different colour, or upgrade your kart with a custom rider trail. Even if your motorcycle is always perfectly tuned, that doesn’t mean you cannot upgrade your style!<br/><br/>Got a question? Contact us at support@vividgames.com<br/><br/>By downloading the game you accept our End User License Agreement, Terms of Service and Privacy Policy: http://support.vividgames.com/policies", "metacritic": null, "released": "2020-08-20", "tba": false, "updated": "2021-02-12T04:56:06", "background_image": "https://media.rawg.io/media/screenshots/2fa/2fa0009026a07ca0e756a5e0a89a56e5.jpg", "website": "https://vividgames.com/games/?lang=en", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 285, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Vivid Games"], "genres": ["Adventure", "Racing"], "publishers": ["Vivid Games"], "esrb_rating": "Everyone 10+"}