{"id": 556892, "slug": "vi-2", "name": "V.I.", "name_original": "V.I.", "description": "<p>Working with virtual reality, a question that never left my head was how I myself could enter the sphere of virtual reality. A pretty banal, but much needed step for that was to bring my body, the real-life home for my feelings, emotions and thoughts, into the virtual. This step of translating my body and its movements into virtual reality quickly became the focal point of my interest. Theoretically, I approached this project in the framework of out-of-body experiences coupled with embodiment. The first attempt to translate my body into an avatar was done by working with Pifuhd, a script that creates a 3d model based on a picture. The avatar I got from this was proportionally pretty close to how I see my body, although my face seemed unfamiliar – a kind of disassociation just with the face. \r\n  </p>\n<p>The second attempt seemed promising: Photogrammetry. However, the result was disappointing: An avatar without hands, with a hole in the stomach and a face barely recognizable. After multiple explorations of those two processes, I was left with what I am calling my failed avatars – models that originated from myself but lost (or gained?) something in the translation. Only the third attempt, a mix between the FACEBUILDER plug-in for blender and a makehuman model, yielded an avatar that I could truly identify with in the virtual. \r\n  </p>\n<p>As a crucial part of translating not only my physical body into the virtual but more so my whole self, I also experimented with motion capture, with the aim of intensifying the identification of myself with my avatar. Through this process, the question arose, if there would be any way to consolidate with my failed avatars through exploring them with my motions and through facilitating and promoting virtual out-of-body experiences.\r\n  </p>\n<p>I chose to write a meditation to facilitate this exchange between the physical and the virtual. You can download the experience to try yourself (you will need a Kinect to take part) or watch the documentation of myself having the experience.<br/></p>\n\n<p>Miro: https://miro.com/app/board/o9J_kim1iTU=/<br/></p><p>by Larissa Gross<br/></p>", "metacritic": null, "released": "2021-02-09", "tba": false, "updated": "2021-02-12T07:32:37", "background_image": "https://media.rawg.io/media/screenshots/d7b/d7b1bd76c6337003338abc208e85b891.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 91, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["./studio3 Virtual Reality Seminar"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}