{"id": 557097, "slug": "nightly-knight-adventures", "name": "Nightly Knight Adventures", "name_original": "Nightly Knight Adventures", "description": "<p><strong>Valiant and brave knight! Do you think you can find and rescue the princess? </strong></p>\n<p>If you're up for the task, set forth on your adventure and search the castle. But watch out! There are Ghostly Knights afoot, roaming the castle grounds to rid it of unwanted guests. Avoid these fiends at all costs, else you'll be sent right back to where you started. Run into them too much, and you might just find yourself dead!</p>\n<p>Wander around and collect the pellets across the castle, and continue to avoid the Ghostly Knights if possible. Collect the golden pellet, and watch as the frightening fliers run away from you, making you their new enemy. You can attack the ghosts when they are in this state, sending them back from whence they came. There is no guarantee they'll stay there, however. </p>\n<p>Collect all of the pellets, avoid the ghosts, and find the Princess! Good luck!</p>\n\n<p><strong>Meet The Team:</strong><br/></p>\n<p>Jake Vaughan</p>\n<p>Leonard Garcia</p>\n<p>Tyler Hopping</p>\n<p>Mikaeyla Gensler</p>\n\n<p><strong>Thank you for trying out our first game! </strong></p>\n<p>For our first assignment for Game Production, we were tasked with cloning Pac-Man and make it our own. We decided to go with a ghostly castle theme for ours. Though it was a little difficult to make, it was an overall fun experience. <br/></p>", "metacritic": null, "released": "2021-02-09", "tba": false, "updated": "2021-02-12T08:25:26", "background_image": "https://media.rawg.io/media/screenshots/4ca/4caee72e3d32439208c92e675c0d2532.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 106, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["CluelessAdept", "Tytyfwefwe", "Leonard_Garcia", "pechy28"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}