{"id": 557136, "slug": "the-long-mark", "name": "The Long Mark", "name_original": "The Long Mark", "description": "<p>READ BEFORE PLAYING:<br/>Current known bugs/mentions: </p>\n<p>- the campfire is targetable, it currently does not show a text label on mouse over, left click to bring up the fuel management menu. Escape is the default key to close this window (awkward in the full screened browser, sorry) -- you can also close this window by simply clicking 'add fuel' even if you have not added any.<br/>- it is not initially apparent, but press E to open the door.<br/>- I have not explicitly tried the WebGL build much, so the windows download may prove better.<br/>- sticks do not currently initially spawn, they will regularly spawn after a snowstorm.</p>\n<p>Welcome to The Long Mark. You play as Markenzie, an alcoholic pilot who crashes into a snowy wilderness. You must keep warm in the cabin by gathering sticks long enough until rescue comes to help you. (the current win state is set to survive for 5 minutes -- please comment on how feasible this is)<br/></p>\n<p>This project was a made in approximately 30 days as part of my ongoing 2021 challenge of making a game each month. There are a lot of features which were cut due to limiting the scope to meet the deadlines, and will be implemented at a further date to be determined. Certain features such as an introduction to the main character, and all my voice lines were not included in this build.<br/><br/>I would appreciate any comments, feedback and criticisms about the game, especially based around the current game mechanics in regards to difficulty of the game, if the win state is achievable, or anything else.</p>", "metacritic": null, "released": "2021-02-09", "tba": false, "updated": "2021-02-12T08:35:05", "background_image": "https://media.rawg.io/media/screenshots/a3e/a3e8b5ad5e29c521d1829d157d98f426.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 22, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["syntaxless"], "genres": [], "publishers": [], "esrb_rating": null}