{"id": 55732, "slug": "zork-zero", "name": "Zork Zero", "name_original": "Zork Zero", "description": "<p>Zork Zero: The Revenge of Megaboz is an interactive fiction video game, written by Steve Meretzky over nearly 18 months and published by Infocom in 1988. Although it is the ninth and last Zork game released by Infocom before the company's closure, Zork Zero takes place before the previous eight games (Zork I, Zork II, Zork III, Enchanter, Sorcerer, Wishbringer, Spellbreaker and Beyond Zork). Unlike its predecessors, Zork Zero is a vast game, featuring a graphical interface with scene-based colors and borders, an interactive map, menus, an in-game hints system, an interactive Encyclopedia Frobozzica, and playable graphical mini-games. The graphics were created by computer artist James Shook. It is Infocom's thirty-second game.</p>\n<p>Previous games by Infocom used a parser evolved from the one in Zork I, but for Zork Zero, they designed a new LALR parser from scratch. Zork Zero's parser has some innovative features. If it notices if a player is having trouble with it, it offers helpful suggestions, such as sample commands.</p>\n<p>Three of the four graphical mini-games are based on older logic puzzles. Peggleboz is a version of peg solitaire, Snarfem is Nim, and the Tower of Bozbar is Towers of Hanoi. Other puzzles based on established logic puzzle types include a river-crossing puzzle with a fox, a rooster, and a worm, and a Knights and Knaves puzzle in which violently xenophobic Veritassi and Prevaricons are truth-tellers and liars respectively, and peaceful Wishyfoo are alternators.</p>", "metacritic": null, "released": "1988-10-19", "tba": false, "updated": "2023-02-08T10:49:55", "background_image": "https://media.rawg.io/media/screenshots/059/05985270d274bab70db42fa6419f72dd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 4, "beaten": 2, "toplay": 5, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 179, "game_series_count": 0, "reviews_count": 1, "platforms": ["Apple II", "Classic Macintosh", "Commodore / Amiga", "PC"], "developers": ["Infocom"], "genres": [], "publishers": ["Infocom"], "esrb_rating": null}