{"id": 557324, "slug": "white-shadow-enquete-a-holtwater", "name": "White Shadow, enquête à Holtwater", "name_original": "White Shadow, enquête à Holtwater", "description": "<p>\"<strong>White Shadow, enquête à Holtwater</strong>\" est un point-and-click 2D où nous suivons une mission de <strong>Noir</strong>, un mystérieux inspecteur, dans un monde aux apparences colorées. </p>\n\n<p>L'affaire commence dans le bureau de Noir, où un étrange commanditaire nommé Blanc demande l'aide de son ancien ami, désormais inspecteur.</p>\n<p>Le topo est simple : <strong>Proteus Corp</strong>, une entreprise de développement en transhumanisme au coin de la rue, a été victime d'un cambriolage la nuit dernière. Pour Blanc, c'est une opportunité à ne pas laissé filer, il souhaite que vous en profitiez pour vous introduire dans les locaux et mettre la main sur un dispositif secret, le <strong>Projet H,</strong> afin d'y mettre un terme. Après tout vous seuls, connaissez réellement l'objectif de ce complot, Blanc et vous même êtes les premiers cobayes de cette machination.</p>\n<p>                        Il est temps pour vous de mener l'enquête                                                 et de mettre la main sur le <strong>Projet H</strong>.                   </p>\n\n<p>Ce jeu est un projet réalisé avec le logiciel Godot et plus précisément Escoria.</p>\n<p>Nous sommes trois Game artistes d'Activdesign à Rennes, Carla Gomez, Killian Dorval et Tanguy Herbert.</p>\n<p>Nous sommes en première année de Game artiste et nous avions pour objectif de réaliser un point-and-click avec pour thème graphique \"années 60\".</p>\n<p>Ce projet a été réalisé en l'espace de cinq semaines dont une pour la publication.</p>", "metacritic": null, "released": "2021-02-08", "tba": false, "updated": "2021-02-12T09:22:49", "background_image": "https://media.rawg.io/media/screenshots/196/19641d7d6f82533f061924c848b00f1a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 56, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Overshake"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}