{"id": 557351, "slug": "school-survival-glasspain", "name": "School Survival (GLASSPAIN)", "name_original": "School Survival (GLASSPAIN)", "description": "<p>We are a pair of programmers/artists trying to make games in our free time: Milky and Shineki. Yes, we are a couple. Milky is a full-time burnt out web programmer and Shineki is a student.</p>\r\nWhat we did ourselves\r\n<p>All the graphics are done by us, obviously; nothing third party there. Mostly Shineki here.</p>\n<p>Programming was pretty tough as we don’t use those gigantic frameworks and engines to do our games; a big thanks to the Go community for providing a feasible alternative. Programming was mostly on Milky.</p>\n<p>Sound effects (again, not the music) are also all done by Milky.</p>\n<p>This is our second try at a gamejam, so we don't have a proper workflow or techniques -- just trying to make <em>something</em>. <strong>It's also our first finished game!</strong></p>\r\nWhat tools we used\r\n<ul><li>Ebiten, the game framework (Pixel would be better but it didn't have web export)</li><li>Go programming language (Golang)</li><li>Aseprite</li><li>The OP-1 and Audacity for audio </li></ul>\r\nBoring dev details for nerds\r\n<p>The source code is available at gitlab, among other gamejams that we’ve attended and Milky's hobby stuff and various linux dotfiles. </p>\n<p>Any OS that has some OpenGL should be able to run our game; Go itself is cross-platform. </p>\n<p>If you've ever struggled with Pygame's performance, don't wanna bother learning Rust or C++ or you don't want to use big engines, try Go for yourself. We can wholeheartedly recommend it.</p>\r\nWe know, ok? \r\n<p>a.k.a. Known issues</p>\n<p>It's our first actual release and our first time in the library. Most technical issues are just with the web build but we really wanted to have it. Who's got the time to download it, amirite</p><p><strong>That being said, we would very much like to continue development until we're satisfied with it.</strong></p>\n<p><strong>Sound and music</strong></p>\n<ul><li>The sounds and the song sometimes don't load fast enough and plays only after restart. Don't know what causes it, first time in the library. </li><li>When the game lags, the sounds <strong>break and jitter</strong>. The library didn't let me change the buffer size so that's just how it is. On a proper non-web build it isn't an issue though.</li></ul>\n<p><strong>The Space is unresponsive</strong></p>\n<ul><li>Because we're using one key for everything, you shouldn't be able to click off and (re)start by accident... But it's weird on the web build and sometimes it just doesn't respond. Just press it a bunch if it doesn't want to restart.</li></ul>\n<p><strong>Balancing</strong>\n</p>\n<ul><li>We didn't really playtest it enough; it's kinda hard and kinda easy at the same time... yea...</li><li>The class could be longer so you can enjoy the music... But seriously, check out Bossfight instead.</li></ul>\n<p><strong>And yes, we should have randomized the words, they are the same every time. Whoops.</strong></p>", "metacritic": null, "released": "2021-02-08", "tba": false, "updated": "2021-02-12T09:29:40", "background_image": "https://media.rawg.io/media/screenshots/b65/b650ac7ca18b16f72528bb15939f9301.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 19, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["GLASSPAIN"], "genres": [], "publishers": [], "esrb_rating": null}