{"id": 557472, "slug": "aquifer", "name": "Aquifer", "name_original": "Aquifer", "description": "<p>(Made for Nokia Jam 3)</p>\n<p>\"A small group of survivors are trapped on the surface of an inhospitable planet. Their sole source of drinkable water is a nearly dried up aquifer. Rescue is due to arrive in 90 days, but can you stretch your resources thin enough to last until then?\"</p>\r\nHOW TO PLAY:\r\n<p>Survive to day 90. You lose if your shelter is destroyed or your population reaches zero.</p>\n<p>Aquifer uses the Keypad keys 0-9, plus keypad period and keypad enter.<br/>Keys 4, 8, 6, and 2 are assign tasks to the Survivors, these tasks are:</p>\n<p>Farm (4): The Survivors have access to seeds that have a high yield of edible crops and can grow in even the harshest environment. The catch is that these crops will consume a large amount of water before they're ready for harvest. The Farm task is only available when planting, once the crops are growing or ready for harvest the task becomes unavailable. Farm progress can be tracked from the Crop screen (9).</p>\n<p>Scavenge/Harvest (8): When no crops are ready for Harvest, the Survivors may scavenge nearby ruins for abandoned foodstuffs or hunt some of the local fauna. The food generated from Scavenging might start off high, but these ruins have a limited supply and will run out. When crops are ready for Harvest, however, the Survivors instead collect and prepare their crops for consumption. The Crop screen (9) indicates how many crops remain for harvest.</p>\n<p>Build/Repair (6): The Survivors can upgrade and repair their shelter. The level of their structure is indicated on the Home screen (0) by both the shelter image at the top and the shield icons above the health bar. Damage is indicated by empty shield icons.</p>\n<p>Rest (2): Rest is used to either recover HP or avoid taking damage from the weather.</p>\n<p>Keys 7, 9, 5 and 0 are used to access different screens, which are:</p>\n<p>Status screen (7): Details current day, the amount of food stored, and the current population of the Survivor camp.</p>\n<p>Crop screen (9): Indicates the amount of crops planted or still available for harvest.</p>\n<p>Pump screen (5): On this screen you press the Pump key again to toggle the water pump on or off. This pump, while active, increases the hydration level of the shelter. Be careful not to run the pump longer than you need to, water is limited.</p>\n<p>Home screen (0): Most information can be found here. The Home screen reports the structure level, structure health, if a weather effect is active, which task is currently assigned, the health level of the Survivors, and the Hydration level.</p>\n<p>The remaining keys are used to pause the game (Enter) and dismiss alerts (numpad period). Addition key uses are indicated in-game.</p>\r\nTIPS:\r\n<p>* Each day the Survivors each consume a single unit of food. If they are unable, a food crisis occurs. The penalties are initially minor, but become more dire if allow your Survivors to starve multiple days in a row.</p>\n<p>* When your crops are in the growing phase, pay close attention to your hydration level. Growing crops will drain water passively, if you allow your water to run out you will experience a water crisis, similar to a food crisis.</p>\n<p>* After the 21st day, it's possible to experience storms that can deal three tiers of structure damage in a single day. Do not neglect your structure upgrades in the early game.</p>\r\nACKNOWLEDGEMENTS:\r\n<p>Thanks to @somepx for the Ark font and @trix for his soundpack.</p>", "metacritic": null, "released": "2021-02-08", "tba": false, "updated": "2021-02-12T09:58:50", "background_image": "https://media.rawg.io/media/screenshots/31d/31d0dcbf3e40e5023ffd56132d40930b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 33, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["tonkatuff"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}