{"id": 557660, "slug": "lets-farm-incremental-game-final-version", "name": "Let's Farm Incremental Game (Final Version)", "name_original": "Let's Farm Incremental Game (Final Version)", "description": "<p>CS4700.02 Incremental Game Project by Benjamin Mai, Marcos Herrera</p>\n<p>------------------------------------------------------------------------------------------------------</p>\n<p><strong>Description:</strong></p>\n<p>If you enjoyed The Cookie Clicker Game, you are in for even more fun! Progress throughout the game to unlock different kinds of fruits, and earn cash to become the best farmer ever.  Also, earn some Trophies along the way as a reward for all your hard work! Tired of waiting too long to get rich? Buy those upgrades to ensure that picking fruit would be less tiring, and reach the max score to retire early throughout the year.  Be sure to watch out for the bonus opportunities, because only 3 times will be considered the \"charm\"! </p>\n<p>--------------------------------------------------------------------------------------------------------</p>\n<p><strong>How To Play:</strong></p>\n<p>MONEY NEEDED TO WIN: $5,000,000</p>\n<p>Blue Achievement Unlocked at $10</p>\n<p>Green Achievement Unlocked at $100</p>\n<p>Purple Achievement Unlocked at $1,000</p>\n<p>Yellow Achievement Unlocked at: $10,000</p>\n\n<p>1.) You start off with only  being able to unlock the Apple. Once you do this, you are able to increment the amount of money by clicking on the Apple until you can afford upgrades. The \"Arrow\" helps the value of each fruit/click increase by more, and the \"Hand\" upgrade  adds a certain amount of money for the \"Clicks per Second\". </p>\n<p>2.) Once you are able to unlock the Orange, you will do the exact same as step 1. Basically, you keep clicking and upgrading until you can afford the Banana. However, you notice that you have to put in more work than previously with the Apple Section.</p>\n<p>3.) Once you are able to unlock the Banana, you realize you even have to put even more work due to this representing the \"Final Round\". You keep clicking and upgrading  towards the $5,000,000 mark, but you will encounter various ways to get bonus money  at the $100,000, $500,000,  and $1,000,000 mark! Basically, a modal will pop up on the screen and showcase a specific pattern that you must follow through for bonus money. If you happen to not follow through with it, you will end up missing your chance and the modal will disappear. Once you reach $5,000,000, you will become the World's Greatest Farmer!</p>\n\n<p><strong>Game Mechanics:</strong></p>\n<p>-Ability to click on \"Lock\" to unlock fruit</p>\n<p>-Ability to click on fruit to increment  \"money\" in player's wallet</p>\n<p>-Clickable \"Hand\" Button that will allow players to earn cash for every chosen clicks</p>\n<p>-Clickable \"Arrow\" Upgrade that will allow players to increase the value of their fruit per click</p>\n<p>-Player's are given a chance  to win 4 different Achievements at $10,  $100,  $1,000, and $10,000</p>\n<p>-Players are able to follow a given pattern to earn bonus points </p>\n<p>-Player are able to unlock new fruits when they hit the corresponding amount</p>\n<p>-Players can win in the game by reaching the max score at $5,000,000</p>\n<p>-Players can play another round of the game once they finish their current one</p>\n<p><strong>Game Dynamics:</strong></p>\n<p>- When players hit \"Lock\" Button, the fruit and the section of the background will appear from the black overlay </p>\n<p>- Player will be able to see their \"wallet money\" increment as they click on the fruit</p>\n<p>-Player will notice that there is an increase of value for the fruit when they click on the \"Arrow\" upgrade</p>\n<p>-Player will be able to visually notice that there is an increase of Clicks Per Second when clicking on the \"Hand\" upgrade</p>\n<p>-Players are able to view unlocked new sections of fruits when they click on the following one</p>\n<p>-Players are able to view new backgrounds that appear for each fruit</p>\n<p>-When players unlock the achievements, they are able to view them appearing in the given slots</p>\n<p>-When players follow through the bonus combo correctly up until the given point, the \"Bonus Pattern\" will still appear in the modal</p>\n<p>-When players do not follow through correctly with the bonus combo as shown, the modal will disappear</p>\n<p>-Players are able to view \"You're a Great Farmer!\" message towards the end of the game, along with a \"Play Again\" Button</p>\n<p><strong>Game Aesthetics:</strong></p>\n<p>-Excitement towards the beginning of the game</p>\n<p>-Sense of achievement felt when Trophies are unlocked</p>\n<p>-Satisfaction felt by players when they unlock enough upgrades to speed up the increment of their money</p>\n<p>-Sense of frustration on the Orange and Banana section due to the impatient feeling towards wanting to complete the game</p>\n<p>-Music and clicks provide players an immersive experience </p>\n<p>-Happiness and excitement at the end of the game </p>", "metacritic": null, "released": "2021-02-08", "tba": false, "updated": "2021-02-12T10:40:21", "background_image": "https://media.rawg.io/media/screenshots/736/736af8512d1124063bf674c2b42e1cf2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 23, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Benjamin Mai", "Inh3ritance"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}