{"id": 557786, "slug": "scary-horror-escape-the-room", "name": "Scary Horror - Escape the room", "name_original": "Scary Horror - Escape the room", "description": "You’re coming to entertaining horror escape room game and you are greeted by a suspicious man. The first thing you’re offered to do is to sign an agreement to participate in this scary horror adventure. So here the horror adventure begins... but something went wrong... It seems like it’s not a game but a trap of some crazy madman, who made this psycho escape rooms. Now it’s time to think and escape house horror, otherwise you're dead. In this adventure escape game, you’re gonna have a long journey to escape the room aim! Well, will you open the doors can you escape the room? Fear!<br/><br/>*** \"Scary Horror - Escape the room\" - it is a full free game, without paid content! ***<br/>*** For all the fans of point and click adventure and horror escape games!  ***<br/><br/>Have you ever been in horror house? Have you ever faced terrible entity and tried to get out of dangerous places? Now you will have this opportunity. So be ready for the HQ quality horror escape room adventure game. Come and accomplish this well animated escape quest. Move through this haunted house, solve mystery puzzles, and escape the room. This scary house is terrifying, so we need to escape horror house as soon as possible! It’s a perfect opportunity to pump your logical skills by solving mysterious puzzles to escape. High quality art and exciting plot make this horror game a real masterpiece. Many interesting locations make this game special among other horror escape games. You won’t forget this creepy adventure, where you should open the doors, secret doors! Hundred percent you should do as much as you can to stay alive, it is so true fear!  <br/><br/>\"Scary Horror - Escape the room\" won't be an easy game, but with so many free hints and clues you will figure it out anyways. Fear house can bring you difficult puzles to solve as good as easy puzzles to solve. So if you like to play detective games, solve puzzles and if you’re fan of scary stories and room games free, this is perfect horror game for you! You will need a knack to get through whole game, don't forget to unlock the doors, mate. Maybe it’s gonna be challenging but definitely worth it! Here the scary game begins in the haunted house of fear. Test your logical skills and explore this escape horror game. One of the best adventure games. Goosebumps guaranteed! <br/><br/>Features of \"Scary Horror - Escape the room\" adventure game:<br/><br/>- Well animated high quality art and realistic graphics<br/>- A lot of creepy trapped locations with doors open challenge<br/>- Horror atmosphere and spooky sounds<br/>- Understandable escape room with clues and hints<br/>- Search for clues and solve difficult puzzles<br/>- Many interesting puzzles and riddles: mathematics puzzles, numbers puzzles and more!<br/>- The game is translated into 15 languages<br/>- Ambience of horror house and addictive gameplay<br/>- Intuitive interface<br/>- Escape adventure without internet connection<br/><br/>If you like \"Scary Horror - Escape the room\" and like to tickle your nerves, take a look at our other escape horror games. We have many other detective games, room escape, mystery and point and click adventure games. Play high quality escape house horror, scary games, room games free and other escape games offline free! We are constantly trying to improve the quality of our games so that you get the maximum pleasure of the game. Have fun and share with your friends!", "metacritic": null, "released": "2019-11-08", "tba": false, "updated": "2021-02-15T03:20:46", "background_image": "https://media.rawg.io/media/screenshots/f81/f818adea2e667e97bda2d00687618636_eBFYBum.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 315, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["arpaplus"], "genres": ["RPG", "Puzzle"], "publishers": ["Arpaplyus OOO"], "esrb_rating": "Teen"}