{"id": 557796, "slug": "ultimate-real-life-simulator", "name": "Ultimate Real Life Simulator", "name_original": "Ultimate Real Life Simulator", "description": "Life Sim is the ultimate life simulation featuring some of the most realistic gameplay in a life simulator game!<br/><br/>Careers<br/>Go to work and earn a living. Which career will you join? Select a career and work your way to the top. Who will you choose to emulate? Train hard and reach your potential.<br/><br/>Social Media<br/>Become an influencer and work with brands to promote your cause. <br/><br/>Talents<br/>Think you have what it takes to become a global superstar Actor? Or how about a Singer? Maybe your ambitions are a little closer to home and your passion is Vlogging? Work on your talents and become the best.<br/><br/>Property<br/>Buy houses, rent them out, sell them for a profit, keep an eye on the market prices as the economy fluctuates. Mortgage your properties and evict tenants.<br/><br/>University<br/>Go to university and study hard to unlock more advanced careers. Choose your own path. Maybe you'd like a career in Rocket Science? There's a course for that.<br/><br/>Relationships<br/>Get engaged. Take it a step further and get married. Then you'll have to think about kids. Remeber to keep your relationship in check. You don't want things getting complicated. The game sims their life too.<br/><br/>Friends<br/>Make friends, lose friends. Make new friends. Keep the conversation flowing. Visit friends, go on days out, keep them happy.<br/><br/>Health<br/>Keep fit and healthy, go to the gym, make the best decisions you can to live a long and happy life.<br/><br/>Shop or Save<br/>Shop for your favourite things, or save the pennies. Invest in stock and see the dividends.<br/><br/>Pets<br/>Adopt pets, the cute, the scary and the weird. Pets help unlock extra features or careers but they do come at a cost as well!<br/><br/>Subscriptions<br/>Subscribe to the latest fad service and keep in touch with friends on your phone. <br/><br/>Move Out<br/>Make plans to move out of your parents and start a life of your own.<br/><br/>Vacation<br/>Go on vacation with your family. Don't forget your passport.<br/><br/>Daily Rewards<br/>Keep coming back to improve your character and see what direction their life will take next<br/><br/>Hall Of Fame<br/>See your characters on your own personal leaderboard. Can you reach the top?<br/><br/>Achievements<br/>Can you unlock them all? Over 24 achievements available, easily accessible to the new player and some challenges for the veteran.<br/><br/>Got any ideas for further features? Or want to give a helping hand towards translations? Get in touch!<br/><br/>Join us on Twitter at https://twitter.com/BiddulphGames<br/><br/>Join us on Instagram at https://www.instagram.com/biddulph_games<br/><br/>Life Sim is an indie simulator game built by a sole developer. <br/><br/>The majority of icons are provided by icons8.", "metacritic": null, "released": "2020-07-29", "tba": false, "updated": "2021-02-15T03:25:02", "background_image": "https://media.rawg.io/media/screenshots/996/9968501493e9b838ee68484013f77fc1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 60, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Richard Biddulph"], "genres": ["Simulation", "Casual"], "publishers": ["Richard Biddulph"], "esrb_rating": "Teen"}