{"id": 557751, "slug": "theater-of-carnage", "name": "Theater of Carnage", "name_original": "Theater of Carnage", "description": "Clash of steel, waves of magic, the joy of battle!<br/><br/>Theater of Carnage is turn-based strategy with a wide range of options how to dominate the battlefield. <br/><br/>Engage in deep tactical combat. Choose your preferred faction and represent it in the imperial arena facing other players with your hand-picked team. All factions provide different gameplay experience. They have their own specific way how players can gather and make use of resources, in order to execute powerful abilities. Players build a team of team of 5 champions from a range of available characters. Every character possesses multiple unique skills, and mastering their proper use is crucial to victory. <br/><br/><strong>Gameplay</strong><br/><br/>At the start of each match there is preparation phase when players can place their units in a designated area of the battlefield. This allows them to position units, according to their initial battle plan. Both player’s characters take turns based on their initiative. They have a pool of action points, used to perform activities, with a wide variety of options how to spend them. The goal is to annihilate your opponent. <br/><br/>Glory awaits !<br/><br/><strong>Features </strong><br/>-\tTurn based combat in the cell based arena<br/>-\tDifferent factions, each with their own strengths, the source of their power and ways to utilize it<br/>-\tChoose a team of 5 champions <br/>-\tVariety of characters possessing unique skills that can change the flow of the battle or shape overall strategy<br/>-\tNo roll of the dice. All comes down to the player’s strategy skills <br/>-\tWide range of tactical options. <br/>-\tOnline ranked battles and local hot-seat mode<br/><br/>", "metacritic": null, "released": "2021-02-13", "tba": false, "updated": "2021-02-15T02:59:48", "background_image": "https://media.rawg.io/media/screenshots/741/741ab2856aa8de6f66a43a4723abcc10.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 193, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Arrow^2 team"], "genres": ["Strategy"], "publishers": ["Arrow^2 team"], "esrb_rating": null}