{"id": 557739, "slug": "enter-the-backrooms", "name": "Enter The Backrooms", "name_original": "Enter The Backrooms", "description": "Enter The Backrooms is a survival horror game that takes place in an infinite maze of rooms known as The Backrooms. As you wander the endless expanse of humming lights, stained carpet, and old wallpaper, you can collect items, find notes written by previous explorers, and evade glitched entities. Throughout the game, your sanity slowly decreases. The lower it gets, the more bizarre things will occur and the more horrifying beasts you'll run into. You must meditate to regain your sanity before it's too late. Enter The Backrooms takes place over many levels, each with a unique generation algorithm, varying danger, and unexpected oddities.<br/>\n<br/>\r\nEnter The Backrooms is a perfect game for anyone who wants a creepy psychological horror experience at a low price. The game comes with plenty of achievements to obtain and journal pages to collect, many items and artifacts to discover, lots of strange hallucinations to witness, and various levels to explore. Enter The Backrooms promises players an unforgettably surreal experience that no other game provides. That being said, this game is NOT for players who want gorgeous visuals, heavy story elements, intense action, or a very polished package. This game was developed by a single teenager in their spare time and is in no way professionally crafted.<br/>\n<br/>\r\nMuch of what's in Enter The Backrooms is based on a collection of fictional writing known as \"The Backrooms Database\", which includes a plethora of articles from numerous writers around the world. Some aspects of the game are based entirely on these writings, while others are their own concepts spliced in to make the experience much more cohesive.<br/>\n<br/>\r\nEnter The Backrooms is planned to evolve and update far into the future. There are dozens of concepts for levels, entities, and items that could and most likely will be added.", "metacritic": null, "released": "2021-02-12", "tba": false, "updated": "2023-12-24T09:55:56", "background_image": "https://media.rawg.io/media/screenshots/8a4/8a4f4e7c6194724bebf2636377e102c6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 7, "toplay": 3, "dropped": 1, "playing": 2}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 91, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Justin Kroh"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Cosmic Crow Creations"], "esrb_rating": null}