{"id": 557802, "slug": "traffic-racer-2019", "name": "Traffic Racer 2019", "name_original": "Traffic Racer 2019", "description": "Traffic racer 2019 is a game that takes place in an endless city. The city has a highway that crosses it, with ​big traffic. You are a racer that does not wait after all traffic cars, and you will overtake all cars with big speed. Faster you go, more points you will achieve from those overtakes. Also, if you close pass all the car, you will get extra points. Be careful, hitting a car, will cost you the round. <br/><br/>With wined points, you can buy more cars. This highway rider game has over 15 cars from famous brands. Some of them are e30, challenger, Hellcat, daemon, GTR, p1, 911, Jaguar, Mustang, Lambo, Centenario, f10, r8, m3, gt ford, muscle cars, American cars, and German cars.<br/><br/>Those cars are really easy to drive but at high speeds, you must be a skilled driver so you do not get an accident.<br/><br/>If you bought your dream car to drive on a highway, you can customize it. You can change the car color, choosing between 5 wheelsets and upgrade engine, steering, and transmission.<br/><br/>The game has 3 weather condition and 4 game modes. We implemented also the classic bomb mode, where you have to run with a buss as fast as you can.<br/><br/>Game features:<br/>- 3 weather on the highway traffic.<br/>- 4 games mode<br/>- 13+ cars<br/>- car color change<br/>- 5 wheelsets<br/>- engine, transmission and steering upgrades.<br/>- endless city highway<br/>- high-quality graphics<br/><br/>Thank you for choosing us!", "metacritic": null, "released": "2019-04-13", "tba": false, "updated": "2021-02-15T03:27:28", "background_image": "https://media.rawg.io/media/screenshots/28e/28e3ce55972a532004e8a0440718176d_bzSY7fo.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 107, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Xsa Software"], "genres": ["Simulation", "Racing"], "publishers": ["Xsa Software"], "esrb_rating": "Everyone 10+"}