{"id": 557825, "slug": "epic-stickman-fighting-game", "name": "Epic Stickman Fighting Game", "name_original": "Epic Stickman Fighting Game", "description": "The Epic Stickman - Slow Motion - the Stickman fighting game is based on realistic physics games, fighting games, oribash, ragdoll fight, It's total a Free Games on mobile.<br/><br/>STICKMAN FIGHTING GAMEPLAY<br/><br/> - Clear a chapter to get Star rewards.<br/><br/> - Use Star to upgrade your supreme stickman, Level Up supreme stickman will increase HP and Mana for your Epic Stickman<br/><br/> -  Flying, backflip, rolling, and keep balance your supreme stickman to punch, kick on the opponent supreme stickman.<br/><br/> -  Supreme Stickman complete stages when killing all opponent supreme stickman.<br/><br/> - The Stickman Slow-Motion will die when HP of the epic stickman comes to Zero.<br/><br/> - MANA of epic stickman will affect Damp Power, Flying Speed, and Backflip speed.<br/><br/> -  Slow Motion gameplay will appear when supreme cause Damp to the opponents.<br/><br/><br/>HOW TO PLAY STICKMAN FIGHTING GAME<br/><br/> -  Only Use Joystick to control all actions of supreme stickman: Flying, Backflip, Rolling, Punch, Kick, Balance<br/><br/> -  flying, backflip continuously to avoid the opponent supreme stickman, keep balance your stickman then attack the opponents<br/><br/> - Manna of supreme stickman will get Zero when supreme stickman gets hurt.<br/><br/> - Clear chapters to get Star rewards then Upgrade Supreme Stickman Level.<br/><br/><br/>SUPREME STICKMAN SLOW-MOTION FEATURED<br/><br/> - PVP Mode: play with friend, 2 player fighting in a phone.<br/> - Stickman Slow-Motion Fighting Game is Slow Motion, a physic game, fighting game.<br/><br/> - Simple Control with Joystick: control supreme stickman with action and keep Balance in the Playground easily.<br/><br/> - Classic Style: We design UI, Playground very simple, and focus on feeling playing games.<br/><br/> - Challenge Game: Epic Stickman Game design multiple Chapters with many stages with increasing levels deep.<br/><br/> - Exciting Playground: there are simple shapes such as square, bounce circle in the playground<br/><br/> - Free Game: Stickman Slow-Motion Fighting Game is a Free Game.<br/><br/>Let's play Epic Stickman - Slow Motion - Fighting Game to discover the exciting gameplay now! Stick Fight is a Free Game but it will bring to you many gameplay feelings.<br/><br/>Give us feedback for Stickman Physics Slow-Motion Fighting Game then we will update to make it better, please!", "metacritic": null, "released": "2020-08-13", "tba": false, "updated": "2021-02-15T03:38:06", "background_image": "https://media.rawg.io/media/screenshots/f12/f1299b7eeea8c413b31213a11e4117a3_vosrTdX.jpg", "website": "http://plutogame.org", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 9, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["chuong nguyen"], "genres": ["Action", "Adventure"], "publishers": ["chuong nguyen"], "esrb_rating": "Everyone 10+"}