{"id": 557831, "slug": "hotel-frenzygrand-hotel-decor", "name": "Hotel Frenzy:Grand Hotel Decor", "name_original": "Hotel Frenzy:Grand Hotel Decor", "description": "Welcome to the Grand Hotel Empire! Different doorman and waitress stories are staged here everyday! Are you ready for it?<br/><br/>Do you want to be a successful Hotel Empire Tycoon? The most real hotel scene, the most fashion home design and the most delicious food will make you feel the hottest hotel mania and cooking fever! From small hotels to luxury hotels, fast food to top food, open your hotels all around the world and write your hotel story&amp;cooking diary! Thousands of crazy customer dash into your grand hotel and you need to manage your doorman and waitress to serve them! <br/><br/>People love vacation and Hotel is one of the important parts of the vacation. Tired traveler want to enjoy the best serve in the hotel which like family hotel. You need to satisfy all their needs on time! Arrange them to check in and check out, cook food like a crazy chef, prepare their daily necessities and help them call the taxi for leaving! The doorman and waitress will receive the likes and appreciation from the guests. And you will get more money and reputation which helps you to be the Hotel Empire Tycoon!<br/><br/>Different with traditional Hotel games, Hotel frenzy can do the home renovation by yourself! If you're a super fun of home design game, you must play hotel frenzy too! The perfect combination of time-management games and house design games, Hotel Frenzy will bring you double surprise and happiness!<br/><br/>Features:<br/>-Open your Grand Hotel all around the world!<br/>-Every map has too many levels to beat and you'll never be bored!<br/>-Satisfy all needs of your guests and make them happy!<br/>-Different types of rooms are waiting for you to decorate!<br/>-Hundreds of furniture are combined to create the most fashionable decoration style!<br/>-Cook yummy food and feel the cooking frenzy!<br/>-Rich rewards and interesting events are waiting for you!<br/><br/>Use your management talent to build the most successful Grand Hotel Empire! Use your design talent to decorate the most unique room! Use your cooking talent be the most crazy chef! It's time to show yourself! Download Hotel Frenzy now!", "metacritic": null, "released": "2021-02-06", "tba": false, "updated": "2021-02-15T03:40:25", "background_image": "https://media.rawg.io/media/screenshots/d4a/d4ad389fd017a8940d51984470c235ea_cTUVngr.jpg", "website": "https://www.techvisionjoy.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 183, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["TECHVISION PTE"], "genres": ["Strategy", "Simulation"], "publishers": ["TECHVISION PTE"], "esrb_rating": "Everyone 10+"}