{"id": 557896, "slug": "kiara-and-the-case-of-the-missing-chocolates", "name": "Kiara and the Case of the Missing Chocolates", "name_original": "Kiara and the Case of the Missing Chocolates", "description": "<p>Kiara and the Case of the Missing Chocolates is a short 15ish-minute fan game about, well, Kiara and her missing chocolates. More specifically, the chocolates she made for Calli for Valentine's Day!</p>\n<p>Help Kiara find Calli's Valentine's Day gift before it's too late!</p>\n<p>There is only one ending, but dialogue may differ depending on your choices and when you speak to people.</p>\n<p>If you get stuck (though it's a linear game so that's pretty difficult) or want to make sure you interact with everything, I've written a walkthrough here.</p>\n<p><strong>WARNING:</strong> This game contains very brief flashes of light. If you are sensitive to flashing lights, please take care. These lights occur when the scene changes and last for about half a second.</p>\n<p><strong>Controls:</strong></p>\n<p>Movement -- WASD or Arrow Keys<br/>Interact -- Z (You can interact with people, some items, and doors.)<br/>Start -- Enter</p>\n<p><strong>Credits to the following people for allowing me to use and/or modify their incredible assets:</strong></p>\n<p>Tilesets -- LimeZu <br/>Music -- krümel, Ember#1765<br/>Font -- krümel<br/>Engine -- GBStudio<br/>Title Image -- Mamaloni</p>\n<p>I used Tiled to make the maps and Asesprite to make the sprites and additional tiles.</p>\n<p>Due to engine limitations, this game is only available to play on itch.io normally. If for whatever reason you want to play the gameboy file to play on an emulator or cartridge, please PM me on twitter.<br/>Additionally, you can't save. :( So try not to close the game/tab until you're finished, else you'll need to start again!</p>\n<p>This is a fan game. I am not affiliated with Hololive in any way. Do not under any circumstances redistribute, modify, or take credit for this game in any way. </p>\n<p>I challenged myself to make this in 24 hours. </p>\n<p>My twitter: @lemgyulcat<br/>Hololive: @hololive_En<br/>Thank you to Franki for helping me playtest the game!</p>", "metacritic": null, "released": "2021-02-14", "tba": false, "updated": "2021-02-15T04:06:01", "background_image": "https://media.rawg.io/media/screenshots/b52/b5236cf9d60d1a50c405405bdbf4fd6d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["lemgyulcat"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}