{"id": 557846, "slug": "cloud-chasers-journey-of-hope-2", "name": "Cloud Chasers Journey of Hope", "name_original": "Cloud Chasers Journey of Hope", "description": "Looking for an action-adventure with an epic story and unique gameplay? Search no more. Cloud Chasers - Journey of Hope is the fix.<br/><br/>Guide a trailblazing father and daughter team through the deadly deserts of a dystopian future.<br/><br/>Experience multiple narrative encounters with the weird, wicked and wondrous inhabitants of the five deserts.<br/><br/>Fly high through the clouds with your trusty glider and collect the water you will need to survive.<br/><br/>Reach the safe haven above the clouds by strategically managing your inventory and resources.<br/><br/>=======<br/><br/>STORY<br/>Cloud Chasers - Journey of Hope offers dozens of non-linear narrative encounters in a dystopian desert, allowing for multiple play-throughs and the immersion into an original and epic storyverse.  <br/><br/>ACTION<br/>Navigate your glider through the clouds to collect the last drops of precious water while dodging the deadly harvester drones from the world above.<br/><br/>SURVIVAL<br/>Survive the desert and maintain your health— manage your equipment, upgrade your glider and trade for the right items.<br/><br/>Cloud Chasers - Journey of Hope <br/><br/>The new game from Blindflug Studios, the creators of First Strike<br/><br/>=======<br/><br/>*Winner                 - \"Grand Prize\" - European Independent Game Days 2015*<br/>*Winner                 - \"Best in GDC Play\" - GDC Play 2015*<br/>*Finalist                 - \"Innovation Award\" - European Independent Game Days 2015*<br/>*Finalist                 - \"Best Mobile &amp; Tablet Game\" - Game Connection Paris 2015*<br/>*Finalist                 - \"Best Game Award\" - Best of Swiss Apps 2015*<br/>*Official Selection  - Indiecade @ E3 2015*<br/>*Official Selection  - Indie Arena Gamescom 2015*<br/>*Official Selection  - Amaze Festival Johannesburg 2015*<br/><br/>=======<br/><br/>\"It sounds like a really interesting game ... Keep an eye out for this one!\"<br/>- Carter Dotson, Toucharcade.com<br/><br/>\"Cloud Chasers looks like an audio-visual work of art, and I don’t expect anything less when it hits the app stores\"<br/>- Dan Vlasic, Pocketmeta.com<br/><br/>\"Cloud Chasers is a very compelling project that I look forward to see in its finished state\"<br/>- Jack Gardner, extralife.com<br/><br/>=======<br/><br/>Compatibility: <br/>Recommended: iPhone 5S or higher, iPad 3 or higher<br/>Required: iPhone 5 or higher, iPad 2 or higher<br/>IMPORTANT: Not compatible with iPod Touch!", "metacritic": null, "released": "2015-10-15", "tba": false, "updated": "2021-02-15T03:47:13", "background_image": "https://media.rawg.io/media/screenshots/bfd/bfd9458c93be840cd093d64ce33ee0b8_1a5cfBE.jpg", "website": "http://www.cloudchasersgame.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 161, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Blindflug"], "genres": ["Adventure", "RPG"], "publishers": ["Blindflug Studios"], "esrb_rating": "Teen"}