{"id": 557855, "slug": "santoor-pro", "name": "Santoor PRO", "name_original": "Santoor PRO", "description": "----------------------------------------<br/>HAPPY NEW YEAR ! Enjoy limited sale with  50% OFF for SANTOOR PRO until 5 March 2021<br/>----------------------------------------<br/><br/><br/>Turn Your iPhone or iPad into a musical instrument <br/><br/>Try having an expensive instrument in your hand wherever your are, with the best quality ever <br/><br/>• Why Santoor PRO ?<br/> - No Ads<br/>- Learn to play with \"Step By Step playback\"<br/><br/>-Want to learn Santour ?<br/><br/>-This version you gives access to download all playings and listen to them OFFLINE into your device !<br/><br/>-More features will be added soon<br/><br/><br/>• What is Santoor ? <br/><br/>SANTOOR (SANTOUR) is a classic Chordophone(Stringed) musical instrument that is originated in Persian Empire , This instrument is also knowns as the source of \"Hammered-Duclimer\" and idea of making Piano in Europe, Santoor is a very easy to learn instrument but it needs experience for mastering it.You can absolutely start playing Santoor and make songs with your inspiration and make progress in using this instrument.You also have a chance to download and listen to other user's playings and relax with beautiful playings that publishes in to your app for FREE. <br/><br/><br/>• Awsome ? <br/>_________________________________________ <br/><br/>Santoor app is a unique tool for adding fun to your iPhone/iPad/iPod Device and turn it into a gorgeous musical instrument.You have a chance to play &amp; hear songs with beautiful and High-quality samples that have been recorded in professional studios beside of gorgeous and High-Res user interface. <br/><br/><br/>• Download other playing and save it for yourself offline !!<br/><br/>• APP FEATURES: <br/>_________________________________________ <br/><br/><br/>- Super fast and responsive UI on touching threads <br/><br/>- Multi-touch support <br/><br/>- Hand gestures simulations <br/><br/>- Supports iPhone , iPad , iPod <br/><br/>- iPhone 5 unique design <br/><br/>- Play whatever you like by your inspiration <br/><br/>- Save your playings and enjoy playing them <br/><br/>- Maximize your enjoying with super high quality and studio recorded sounds. <br/><br/>- Publish your playings , hear it on your other iDevices and let others hear yours <br/><br/>- Browse Online and access to more playings FREE <br/><br/>- Slow down or speed up the playings. <br/><br/>- This app can help you learn playing other recorded sounds by showing the position of hands while playing. <br/><br/>- See the music notations while running iPad", "metacritic": null, "released": "2014-09-23", "tba": false, "updated": "2021-02-15T03:53:58", "background_image": "https://media.rawg.io/media/screenshots/25c/25c7295c8b4d702a72ef3680e97d72f4_OqbGOxm.jpg", "website": "http://SydneyAppDev.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 94, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Amir Kamali"], "genres": [], "publishers": ["Amir Kamali"], "esrb_rating": "Everyone 10+"}