{"id": 557801, "slug": "simmayor", "name": "SimMayor", "name_original": "SimMayor", "description": "Being a mayor is a tough job, but someone has to do it, right? <br/><br/>If you’re a fan of simulators, and even more so city building / mayor simulators, this is the game for you!<br/><br/>Summary:<br/>- Customizable settlement <br/>- Over 125 buildings to buy <br/>- You need to keep your residents happy <br/>- Respond to disasters <br/>- Fund the emergency services correctly  <br/>- Correctly fund utilities <br/>- Make Profit <br/>- Enjoy yourself! <br/><br/>SimMayor is a text based city building mayor simulator which gives you control of everything. When starting the game, you can name your mayor, the settlement and citizen names or, you can just choose to randomize them, it’s up to you!<br/><br/>Once you’ve chosen the main details, it’s time to choose your starting budget, climate you then choose if you want the real experience of being up for election each year, or to just have control indefinitely. <br/><br/>If you’re a fan of city building simulators then you’ll know that a good place to start a new settlement is to actually get some residents, right? With a choice of multiple residential buildings, you can start to create your ideal settlement. <br/><br/>Next up on the list, jobs! Nobody just wants to go through life without being able to earn a living, right? With a choice of multiple commercial and office buildings, it’s your responsibility to make sure your residents are employed. Whether it’s working for a fast-food restaurant or, for a Tech Startup, any job is better than none. <br/><br/>Along with making sure everyone has a job, you had better make sure there are enough utility buildings to keep the settlement ticking over. From making sure the garbage gets disposed of to making sure there’s water coming out of everyones taps, it's all on you! If you start to fail in this area, you’ll soon know about it! Residents will not keep quiet for long. Whether they start to talk about you on their social media or decide to riot, you need to be ready!  <br/><br/>This now leads us into the emergency services! To help keep your residents safe, you need to employ people for the police force, ambulance &amp; fire service. If not, those fires will start to spread further than some nasty gossip about the mayor. <br/><br/>Just to keep you on your toes, you will have a range of different disasters that will pop up. Will you choose to repair buildings caused by a fire or will you simply let them all burn to the ground? <br/><br/>Will you repair buildings that have been vandalised as part of the ongoing riots around you because people don’t have clean water? <br/><br/>To help raise the mood around town, you can throw events and bring your residents together to have a great time! If this can’t raise the public opinion then nothing can! <br/><br/>Finally, it’s time for you to make some money. To do this, make sure you have enough commercial buildings to bring in profit each month once the payments have been made for everything else. If you can’t get the hang of this, you can always accept a bribe that’s offered to you, but you need to cross your fingers that you don’t get found out! <br/><br/>Socials: <br/>Instagram: https://www.instagram.com/SimMayorGame <br/>Twitter: https://www.twitter.com/SimMayorGame  <br/>Reddit: https://www.reddit.com/r/simmayor <br/><br/>Latest Devlogs: <br/>https://inst.coffee/blog/", "metacritic": null, "released": "2021-01-26", "tba": false, "updated": "2021-02-15T03:27:06", "background_image": "https://media.rawg.io/media/screenshots/abf/abfda10cd9cbde7c902f401a21739072.jpg", "website": "http://inst.coffee/simmayor-press-kit/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 54, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["InstCoffee"], "genres": ["RPG", "Simulation"], "publishers": ["InstCoffee"], "esrb_rating": "Everyone 10+"}