{"id": 557848, "slug": "lazaretto-horror-premium", "name": "Lazaretto: Horror (Premium)", "name_original": "Lazaretto: Horror (Premium)", "description": "Lazaretto is an immersive first-person indie survival horror game that puts players in the shoes of an urban explorer - whose investigation of a creepy abandoned quarantine island turns into a strange and dangerous adventure. Atmospheric and surreal, Lazaretto offers a glimpse of a bizarre world beyond human consciousness.<br/><br/>It’s night. You’re all alone, exploring the terrifying ruins of an abandoned quarantine island. Find and collect mysterious clues along your journey. What happened before this strange island was suddenly closed down? Bits and pieces of forgotten artifacts reveal a dark, dramatic and haunted past. <br/><br/>This is only the beginning. You discover unsettling, living nightmares far beyond normal. A mysterious, ghostly seance from the past begs for your participation. Connection with this paranormal world leads to a physical manifestation of the subconscious. Fears and anxieties create a surreal world that you must survive if you want to see another day. You begin to wonder which of these worlds is real and more importantly, which one can you survive.<br/><br/>EXPLORE &amp; SURVIVE<br/>Set in the current day, you play the descendant of a man who once worked at an old and inactive facility rumored to be located on a haunted quarantine island.<br/><br/>WHAT IS A LAZARETTO?<br/>A lazaretto is the historical name for a quarantine station for maritime travelers. Urban exploration is the investigation of rare, abandoned, man-made ruins and structures.<br/><br/>MOOD &amp; TENTION<br/>The eerie and decaying environment coupled with haunting sounds provide an evolving span of contextual tension. You are presented with scenarios ranging from escalating terror to sheer panic.<br/><br/>SOMETHING HAPPENED HERE…BUT WHAT?<br/>You are drawn into a forgotten world where a mysterious and dark history is slowly revealed. There is no spoon-feeding. You come to your own conclusions and interpretations.<br/><br/><br/>Note: May lag on older devices (iPad mini, etc)<br/><br/>VISIT US<br/>Website: http://LazarettoGame.com<br/>Facebook: https://www.facebook.com/LazarettoGame<br/>Twitter: https://twitter.com/LazarettoGame<br/>Instagram: https://www.instagram.com/lazarettogame<br/>YouTube: https://www.youtube.com/c/solarstance", "metacritic": null, "released": "2018-05-10", "tba": false, "updated": "2021-02-15T03:48:48", "background_image": "https://media.rawg.io/media/screenshots/e76/e76d4fb72a273bd852faf192a257eae4_o477HwY.jpg", "website": "http://LazarettoGame.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 357, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Paul Osier"], "genres": ["Adventure", "Simulation"], "publishers": ["Paul Osier"], "esrb_rating": "Teen"}