{"id": 55814, "slug": "game-watch", "name": "Game & Watch", "name_original": "Game & Watch", "description": "<p>Game &amp; Watch games have had many different re-releases.</p>\n<p>The Game &amp; Watch Gallery series, known in Japan and Australia as the Game Boy Gallery (ゲームボーイギャラリー) series, is a series of compilations of some of Nintendo's original Game &amp; Watch titles first released in 1995. Five installments have been released, all for systems in the Game Boy line; three of these games have also been released on the Virtual Console for Nintendo 3DS. From Game &amp; Watch Gallery onward, the games feature Game &amp; Watch games in two styles: Classic, which features faithful reproductions of the original games, and Modern, which gives the games a different visual style using characters from the Super Mario Bros. series; however, not all Game &amp; Watch games included in a particular game include a Modern style. Also, the titles often feature actual galleries explaining the history of the Game &amp; Watch system and the various games released for it. The first four titles in the series also feature Super Game Boy borders which mimic the original Game &amp; Watch casing designs. While originally released under the title Game Boy Gallery in Australia, the Virtual Console releases use the title Game &amp; Watch Gallery.</p>\n<p>Beginning in 1998, Nintendo licensed a series of small standalone LCD remakes of the original Game &amp; Watch games called Nintendo Mini Classics.</p>\n<p>In the early 2000s, several Game &amp; Watch titles were planned for re-release as Game &amp; Watch-e (a series of Nintendo e-Reader cards); however, only one ever was.</p>\n<p>The Game &amp; Watch Collection series for Nintendo DS is a set of two games that were available exclusively from Club Nintendo.</p>\n<p>Digital versions of the games were created as DSiWare which was released for Nintendo DSi in 2009 (2010 internationally) and for Nintendo 3DS in 2011.</p>", "metacritic": null, "released": "1995-01-01", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1, "toplay": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["Game Boy"], "developers": ["Nintendo", "Tose"], "genres": [], "publishers": ["Nintendo"], "esrb_rating": null}