{"id": 558163, "slug": "rubbish-river-dash-orixon-studio", "name": "Rubbish River Dash (Orixon Studio)", "name_original": "Rubbish River Dash (Orixon Studio)", "description": "<p>Story Rubish River Dash (RRD)</p>\n<p>Berkisahkan tentang seorang perempuan bernama Olivia yang sering bermain didekat sungai, ia sering menjumpai banyak sampah di sungai tempat ia bermain, ia melihat banyak sampah yang mengambang mengalir seiring sungai, karena tidak betah melihat sungai nya tercemari dan ingin bertindak, tetapi arus sungai terlalu kuat untuk di masuki oleh Olivia, tidak lama kemudian Olivia melihat sebuah posko di dekat sungai, ternyata itu adalah posko pemungutan sampah, posko itu ada karena sampah dari masyarakat dibuang ke arus sungai ini yang mengarah ke laut sehingga pikir masyarakat sampah tersebut setidaknya menjadi makanan ikan, padahal membuang sampah kelaut hanya menyebabkan polusi yang merugikan lingkungan laut, Olivia menghampiri posko tersebut dan menghampiri pemilik posko tersebut, karena 1 pemikiran untuk membersihkan sampah-sampah tersebut, pemilik posko tersebut meminjamkan sampan untuk Olivia mengambil sampah di arus sungai.</p>\n<p>Akhirnya, Olivia bergegas dan mendayung sampan mengikuti arus sungai dan memungut sampah yang mengalir seiring arus sembari menghindari bebatuan yang ada disungai.</p>\n<p>Game Features<br/>Arus yang deras / Strong River Stream line<br/>-yang membuat player bergerak secara otomatis mengikuti arus</p>\n<p>Menghindari bebatuan<br/>-Bantu Olivia membersihkan arus sungai tempat ia bermain!</p>\n<p>Controls<br/>Boat Mode<br/>W - Move Up<br/>S - Move Down Platform</p>\n<p>Left - Move left</p>\n<p>Right - Move right</p>\n<p>Space - Jump</p>", "metacritic": null, "released": "2021-02-14", "tba": false, "updated": "2021-02-15T05:06:59", "background_image": "https://media.rawg.io/media/screenshots/a1c/a1c9203974e7a0bd0ab4348a7da0977e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 57, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Naufal Hanafi"], "genres": [], "publishers": [], "esrb_rating": null}