{"id": 558482, "slug": "mao-no-shinko", "name": "Maō no Shinkō", "name_original": "Maō no Shinkō", "description": "THIS GAME IS UNDER DEVELOPMENT, YOU CAN DONATE TO SUPPORT THIS PROJECT!\r\n<p><strong>Maō no Shinkō</strong><strong> </strong>is a new Authentic Indie JRPG Game. </p>\n<p><strong>“Maō no Shinkō” is an JRPG with one my favorite  journey (\"mystery and action\") try in RPG Development World, heavily influenced by my love of the classic JRPG games, while mixing my unique approaches to core mechanics, gameplay, and storytelling.</strong></p>\n<p><strong>Design/Programming/Pixel Art/Music/ Soundtrack:</strong>  Adnan Yousuf</p>\n<p><strong>----------------------------------------------------------------------------x</strong></p>\r\nFEATURES..? \r\n<p><strong>🔸 2D Characters, Vast World: A mix of classic JRPG and modern styles, utilizing masterful 2D animation with beautiful JRPG world-building.</strong></p>\n<p><strong>🔸 Every Character is a Warrior: 8+ playable characters ranging from a Knight to a Summoner, an Illusionist to a Gunslinger, all with magic woven deep into their combat styles. Rise up to the challenge and take on the role of powerful Warriors in this engaging, free-to-play classic JRPG title!</strong></p>\n<p><strong>🔸 Rebuild Sanctuary: The once-abandoned town progresses as you do, offering new items and equipment. See the war-torn ruins become a thriving home.</strong></p>\n<p><strong>🔸 Quest Board: Some of those that join your town can be sent as away teams, completing missions and returning with new survivors, hidden items, magic tomes, and more as you progress throughout the game!</strong></p>\n<p><strong>🔸 Awesome Classical JRPG Experience: Classical JRPG atmosphere complete with 8-Bit pixel art.</strong></p>\n<p><strong>🔸Amazing JRPG Battle System: Strategy-oriented Turn-based Battle System with Auto-Battle option, Engage in intensely animated battles with/against a captivating cast of beautifully pixel-crafted characters that are inspired by Japanese manga art, Unleash devastating combos using the Intuitive Tap Combat Mechanics and Fill up your Units’ skill gauge to launch their unique offensive / defensive Brave Bursts.</strong></p>\n<p><strong>🔸 Rich and Expansive Content: Explore Grand Kingdom and discover new worlds through more than 500 story-driven missions. Uncover compelling story arcs and legendary sagas of survivors and warriors. The plot is thickening as their fates are intertwined! Be The warrior in this JRPG Experience.</strong></p>\n<p><strong>🔸Will you rise to the challenge and go down in Grand Universe of this Indie JRPG Game's history as a legend? Join forces on your most epic journey yet!</strong></p>\n<p><strong>🔸2 is better than 1, Multiplayer System, Create you village and start your Journey with your friends, fight monster together and eat food together, in the game actually.</strong></p>\n<p><strong>----------------------------------------------------------------------------x</strong></p>\r\nDISCLAIMER..?\r\n<p><strong>This Game is under development, and right now the OST is only available publicly!</strong></p>\n<p><strong>----------------------------------------------------------------------------x</strong></p>\r\nGAME SOUNDTRACK ALBUM.!\r\n\n<p>  </p>\r\nDONATE (I NEED YOUR HELP)!\r\n<p><strong>https://www.adnanyousuf.com/fund </strong><br/></p>", "metacritic": null, "released": "2021-02-13", "tba": false, "updated": "2021-02-15T06:21:42", "background_image": "https://media.rawg.io/media/screenshots/d81/d81830cf11f653c9e8a50fc8235c2b4c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 59, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Adnan Yousuf"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}