{"id": 558564, "slug": "trap-adventure-2-origins", "name": "Trap Adventure 2: Origins", "name_original": "Trap Adventure 2: Origins", "description": "<p>Trap Adventure 2 : Origins mobile platformer contains clever design and hilarious level of difficulty.</p>\n<p>Caution!! This may be the most hardest, irritating, frustrating game EVER. If you tend to exasperate often, I recommend you not play this game. It will literally drive you insane. I PROMISE. As written above, this game is VERY STRESSFUL. You may get so irritated and frustrated that you throw your phone out the window.</p>\n<p>Trap Adventure 2 : Origins is a “masocore” game in the vein of ultra hard platformers , The random spikes that pop up on the third block will kill you. No problem, you say: I'll jump to trigger the spikes, then head back to the second block. Sorry, the third block will fall back on you and kill you. Jump over the third block? You should get nailed by some more random spikes at just where you expect to land.</p>\n<p>When playing Trap Adventure 2 :Origins Ask yourself: how would I normally do this? Then ask yourself: how would the game kill me for doing that? You'll start to be able to anticipate not only what the game expects you to do, but what you'll be able to do to get around that.</p>\n<p>Trap Adventure 2 :Origins tells you what to do in obscure ways, but it definitely tells you what to do, and then only punishes you for not executing that as well as you can. Trap Adventure 2 : Origins is much crueler than that, but that's what's fun about it.</p>", "metacritic": null, "released": "2021-02-13", "tba": false, "updated": "2021-02-15T06:42:29", "background_image": "https://media.rawg.io/media/screenshots/a53/a530fffc913811f0b63e099e91a85bd7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 97, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Circlick Tech"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}