{"id": 558579, "slug": "spellbound-itch-dapeachtv", "name": "Spellbound (itch) (DapeachTV)", "name_original": "Spellbound (itch) (DapeachTV)", "description": "OPEN INVENTORY WITH I AFTER SUBMITTING YOUR NAME TO AVOID A INVENTORY BUG.Spellbound, the #1 Spellcasting RPG Village Defense Indie Game developed on Twitch in 100 days on Twitch.tv/DapeachTV\r\n<p>Banished from The College of the Arcane, you seek refuge in a nearby town only to find out it is cursed and evil enemies are trying to destroy the village.</p>\n<p>You remember hearing about an urban legend of a mystical book owned by an evil mage that can grant the reader magical traits and the ability to cast spells. Legend goes that whoever reads the book becomes evil themselves.</p>\n<p>Will you save the village from evil but risk becoming evil yourself?</p>\n<p>Jump into Spellbound, find the book to learn spells, destroy enemies with your magic, and take back your seat at the college if you dare to become a Master Spellcaster.</p>\n\r\nControls:\r\n<p>WASD to move<br/>Space to Roll<br/>Hold Shift to Sprint<br/>Left click to attack with your equipped weapon<br/>Right click to cast spell<br/>Scroll wheel to cycle through spells<br/>C for Character Stats Panel<br/>I or B for Inventory Panel<br/>1 for Health Potion<br/>2 for Mana Potion<br/>Esc or P for pause menu</p>\n\r\nHuge thank you to everyone in the Peach Party who has helped me make this game in 100 days and over 340 hours of work.<br/> <br/>This project was meant to show what a Beginner GameDev can build in 100 sessions of 2-3 hours using (mostly) free assets. \r\nI had little knowledge of GameDev at the beginning of starting this on March 29, 2020. The goal was to learn as much as I could and implement all of the fun mechanics I can think of into a 3D game in 100 days. Completed and published on February 13 2021. <br/><br/>This game was heavily inspired by games like Diablo 2, Witcher 3, Skyrim, Soulsborne series. \r\n\r\nIf you like the game, have any comments or feedback or want to chat with me, come hang out and join the Peach Party on Twitch where I stream at twitch.tv/DapeachTV", "metacritic": null, "released": "2021-02-13", "tba": false, "updated": "2021-02-15T06:46:24", "background_image": "https://media.rawg.io/media/screenshots/e3e/e3eefdb932545b70d10479b7b5e811e0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 180, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["DapeachTV"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}