{"id": 558697, "slug": "fractal-drawer", "name": "Fractal Drawer", "name_original": "Fractal Drawer", "description": "<p>Just a tool for drawing fractals in few clicks and exploring them with zoom.</p>\n<p>Every fractal consists of Main line, from which perspective every other line is \"seen\", and Direction lines, which copy everything that Main line \"sees\", i.e. itself and all the other Direction lines, but shifted &amp; scaled &amp; rotated. Also there are Base lines, which are the only lines that are drawn in the end, but for simplicity by default the Main line itself is only line drawn.</p>\n<p>Controls:</p>\n<ul>\n<li>Ctrl+click - start or end Main line;</li>\n<li>Shift+click - start or end Direction line;</li>\n<li>Click - start or end Base line;</li>\n<li>Enter - calculate &amp; draw the fractal itself;</li>\n<li>Z, X - zoom out, zoom in;</li>\n<li>Esc - reset zoom to default;</li>\n<li>Backspace - delete all fractals;</li><li>1, 2, 3 - precalculated fractals.</li></ul>\n<p>Quick start: when app opens, you can see two Direction lines and Main line drawn for you, as well as few more layers of fractal - press Enter to see the complete Twin Dragon curve and then explore it with zoom if you wish. Also at the top of the window new Main Line for new fractal will be shown (you can hide it by double-clicking in one place with control pressed). After exploring hit Esc and Backspace. Then try this: press control, click somewhere, click somewhere else, release (this moved your Main line); don't move your mouse! - hold shift and click right where Main line has ended. You will see some sort of spiral. End your new Direction line somewhere by one more shift+click, and draw another one starting from the same spot - and you'll get a tree or a spiraly spiral. </p>\n<p>Useful tip: try to make Direction lines significantly less than Main line, otherwise created fractals will seem messy, and not all lines that should be visible will be rendered</p>\n<p>Now, I hope, you are ready to create new fractals, that nobody has ever seen!</p>", "metacritic": null, "released": "2021-02-12", "tba": false, "updated": "2021-02-15T07:19:04", "background_image": "https://media.rawg.io/media/screenshots/178/1783d29e25c301059976ee0cdc822365.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 103, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["kalmarr"], "genres": [], "publishers": [], "esrb_rating": null}