{"id": 558677, "slug": "customers-from-hell-game-for-retail-workers-surviv", "name": "Customers From Hell - Game For Retail Workers (Survival 'Zombie Karens' Game)", "name_original": "Customers From Hell - Game For Retail Workers (Survival 'Zombie Karens' Game)", "description": "<p>Welcome to <strong>Customers From Hell.</strong> A wave-survival game where you have to protect supplies and eliminate annoying customers (\"Ahem .. Karens\") and upgrade your base with each wave becoming more and more challenging as Karens gets more aggressive. <strong>Protect </strong>your supplies and base, build <strong>barricades</strong>, <strong>traps</strong>, <strong>upgrades</strong>, <strong>weapons </strong>and <strong>survive </strong> for as long as possible!</p>\n\n<p>Retail workers - now is your chance to get back to those annoying customers and Karens that made your work experience like hell. Customers From Hell is a third-person shooter and base protecting wave-survival game, where you have to eliminate all those annoying customers, thieves and 'Karens' that all they want to do is to <strong>'speak to the manager'</strong> and steal your supplies. You are in charge to protect the last remaining supplies and you will do that by building traps, barricades, barriers, closing garage doors and buying upgrades, while also eliminating these 'creatures' with many types of weapons, grenades and pure <em>destruction</em>. <strong>Each wave you survive, is another wave where the Karens will get angrier so be careful! </strong></p>\n<p>Have you ever wanted to punch a Karen in the face but though you'll get in trouble for it and probably loose your job for it? <strong>Now is your chance!</strong> Time to cause <strong>MAYHEM</strong> as it is PAYBACK TIME - <strong>BUILD, PROTECT AND DESTROY. Survive the incoming waves of zombie-like and annoying customers!</strong></p>\r\nFeatures:\r\n<ul><li>Tons of unique weapons including rifles, snipers and more.</li><li>Different types of customers including karens and old grumpy thieves!</li><li>Wave-survival endless game that becomes harder on each wave.</li><li>Chaos and destruction with grenades and more!</li><li>Build traps and barricades.</li><li>Build barriers and other stuff between waves.</li><li>UNLEASH your anger with these type of 'customers'.</li><li>Unlock-able new areas which you can move too.</li><li>Many upgrades to buy such as ramps, barriers, garage doors, player upgrades and more.</li><li>TONS of fun and other cool stuff! (Unless you are a karen)</li><li>Funny and comedic low poly style game-play.</li><li>Third person wave-survival shooter game.</li></ul>\n\n\n\n\n\n<p>P.S: Customers From Hell is a game made by one developer at Steelkrill Studio. If you can, please submit your feedback and report any bugs and this will really help speed up the progress of the development by a bunch :) .. Thank you all! Please Karens don't take anything offensive. Let me go get the manager for you .. *BEEP*<br/></p>", "metacritic": null, "released": "2021-02-12", "tba": false, "updated": "2021-02-15T07:14:13", "background_image": "https://media.rawg.io/media/screenshots/fb8/fb8064fa156a1ee792e0e1bf6b71a92e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 249, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Steelkrill Studio"], "genres": ["Action", "Shooter", "Adventure"], "publishers": [], "esrb_rating": null}