{"id": 558773, "slug": "citrine-resurrection", "name": "Citrine Resurrection", "name_original": "Citrine Resurrection", "description": "<p>//------------SCRIPTOR'S GRATITUDE------------//</p>\n<p>Syoudre here, I would like to thank Bullet Hell Artistry # 3 for giving me the chance to finally make my<br/>debut, I really hope you enjoy this script that I made, after a hundred of experimentation and nearly a<br/>year of coding in Danmakufu, I am happy to present this script for everyone to play publicly. I really<br/>dont have much to say anything else in this part, so I hope you enjoy!</p>\n<p>//------------OTHERS------------//<br/>Pressing C while having 100 Spirit or more makes Sumireko fire off an special attack, grazing a bullet<br/>gives you 2 Spirit points so higher difficulties makes it easier to increase to 200 but only if you take<br/>a risk for that, 200 Spirit makes the attack able to delete bullets as well.</p>\n<p>Pressing Up and Down keys on the Difficulty selection lets you alter the lives count you start with on<br/>the script, there are no penalities for it</p>\n<p>I got the word \"Gen'ya\" because I searched up Lotus Land Story's stage 1 and it gave me 幻野 which<br/>when I google translated, gave me Gen'ya</p>\n<p>//------------LASTLY...------------//<br/>If there's any issues with the script, please contact my Discord, Syoudre#8210 or my Twitter @TonitruaVolt<br/>if there was any problems and I will be sure to help you out on an issues</p>\n<p>Sumireko and Orange portraits and cut-ins are all made by Dairi.<br/>Pixiv link: https://www.pixiv.net/en/users/4920496</p>\n<p>Sumireko Sprite by ZUN.</p>\n<p>Hong Meiling sprite by NYAGAKIYA (or KMAP), edited by me so it can have Orange's colors(I could not find anything else).</p>\n<p>Alternative Decoration Battle is composed by Orphen Nightford from Paradise of Boundaries.<br/>Youtube link: https://www.youtube.com/channel/UC7v2DfwaQrEWt7WXzDgcLew</p>\n<p>Graze, player shoot, summon sound effects, Orange fruit and Baton/Staff/Stick sprites by me.</p>\n\n<p>I swear there is no virus on this one, the files are open-source you can check if you want to</p>", "metacritic": null, "released": "2021-02-12", "tba": false, "updated": "2021-02-15T07:37:15", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Syoudre"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}