{"id": 558715, "slug": "gates-to-chaos", "name": "Gates to Chaos", "name_original": "Gates to Chaos", "description": "<p><strong>All dreams have a meaning, but can they have consequences as well?</strong></p>\n<p><strong>Iscar had lost his memory when he was found nearly dead by Imperial soldiers. They told him it was because of a building collapse, but facts can easily be overwritten if you don't remember your past.  In a world owned by order and discipline, living as the society expected him to, Iscar feels empty.</strong></p>\n<p><strong>\"What is my purpose on this planet?\" He often asks himself.</strong></p>\n<p><strong>Little he knows that a single miraculous dream will change his existence forever, and you shall be the one guiding him to Freedom!</strong></p>\n<p><strong>Delve into an illusory world on the edge of collapse and discover what is left behind by the cause of the apocalypse: the Great Vortex. Explore the main areas, complete many challenges and find hidden treasures. You'll have to defend yourself from the monsters roaming the wastes and to defeat fierce bosses!</strong></p>\n<p><strong>Featuring</strong></p>\n<ul><li><strong>10 interconnected main areas and 20 challenge areas to explore!</strong></li><li><strong>A pixelated animated artstyle to give the proper indie game feeling!</strong></li><li><strong>Over 20 unique monsters that will test your fighting skills!</strong></li><li><strong>4 menacing bosses that will surely kill you many, many times...</strong></li><li><strong>23 original music tracks setting up an unique atmosphere~</strong></li><li><strong>Over 35 treasure chests that contain items to help you during your journey, including 9 documents that tell the story of the illusory world</strong></li><li><strong>A tragic story with a depressed protagonist that has hurtful memories to recover from the unconscious...</strong></li><li><strong>...and a chimera waifu!</strong></li></ul>\n<p>Developer's note: this is my first game I've ever finished making and I don't have much experience so please have some patience if you encounter bugs and be sure to tell me!</p>", "metacritic": null, "released": "2021-02-12", "tba": false, "updated": "2021-02-15T07:23:09", "background_image": "https://media.rawg.io/media/screenshots/3e7/3e7443137d65e3691f47198aeee6fe7d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 246, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Polonium106"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}