{"id": 559094, "slug": "the-great-empire-relic-of-egypt", "name": "The Great Empire: Relic of Egypt", "name_original": "The Great Empire: Relic of Egypt", "description": "Stop a fuming pharaoh from ravaging an island paradise and send his mummified army scrambling for safety as you rebuild and defend your land! When an ancient pharaoh goes on a rampage after being awakened from his eternal slumber, the current pharaoh puts his honeymoon on pause and sets out to capture the vile villain and restore his land to its former beauty.<br/><br/>You must be the pharaoh's hands and feet as he guides his people on their quest. Race against the clock to remove debris, gather resources and rebuild settlements. Search for ancient treasure, explore golden pyramids and do battle against mummified thugs. And research new means of construction as you reopen trade routes and do business with local merchants.<br/><br/>Even then, you will only succeed and unlock the stunning array of achievements if you earn the favor of the gods, who are ready to shower you with blessings.<br/><br/>Set against a vibrant, colorful backdrop and featuring a highly animated world, The Great Empire: Relic of Egypt offers game experiences for every kind of player, from casual users who desire a relaxing journey to experienced strategists who love a challenge.<br/><br/>Fulfill your destiny and claim the victory that is yours as the leader of the great empire!<br/><br/><ul><li>Captivating, adventurous story<br/></li><li>Dozens of cleverly designed levels<br/></li><li>Thrilling original soundtrack<br/></li><li>Learn-as-you-play instructions<br/></li><li>Simple point-and-click controls</li></ul>", "metacritic": null, "released": "2021-02-17", "tba": false, "updated": "2021-02-19T03:50:13", "background_image": "https://media.rawg.io/media/screenshots/bea/beac820fd4f79b9ade4caa70c1bf616e.jpg", "website": "https://steamcommunity.com/groups/alawargames", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 5}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 179, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Platinum Games"], "genres": ["Adventure", "Strategy", "Casual", "Indie"], "publishers": ["Alawar Entertainment"], "esrb_rating": null}