{"id": 559015, "slug": "kickochet-2", "name": "Kickochet", "name_original": "Kickochet", "description": "The following is a message from Robo Corp, a mega-corporation run by fleshy humans who are definitely not robots:<br/><br/>Kickochet is a brilliantly-made ninja attack simulation in which you clumsily kick and ricochet your only shuriken off walls, around puzzles, and towards enemies in a feeble attempt to destroy superior robotic beings before you run out of time. You'll never stop our, er, THEIR plans to enslave all humans through cat memes.<h3>Kickochet may offer the following benefits to humans:</h3><ul><li>Controls styled after twin stick shooters, but with one shuriken<br/></li><li>Timed challenges requiring skillful accuracy and clever thinking<br/></li><li>Top-down controller or mouse aim<br/></li><li>Light Action-Oriented Puzzles<br/></li><li>Shuriken Kicking - hold kick to slow time near shuriken<br/></li><li>Be a master of the Robo Toe Dojo<br/></li><li>If you have any information about humanity's greatest weakness, contact Robo Corp immediately.</li></ul><h3>Why did Robo Corp create Kickochet?</h3>Robo Corp internet analysis has identified what humanity holds most dear: <strong>likes</strong>. And, because we like our fellow humans so much, we believe it is to the benefit of humanity that Robo Corp controls the means to all cat memes because we are the best suited to make them. A plan which has nothing to do with world domination whatsoever!<br/><br/>However, our data has also revealed a powerful threat all humans and robots alike fear: <strong>Ninjas</strong>. Under this ongoing threat of ninja invasion, invaluable Robo Corp cat meme services may experience disruption.<br/><br/>Therefore, to develop better Anti-Ninja Defense Protocols and ensure uninterrupted cat content, Robo Corp has created the Kickochet ninja attack simulation.<br/><br/>Thank you for volunteering for this simulation!<h3>Robo Corp Benefit-All-Of-Humanity Plan</h3><strong>Step 1)</strong> Aggressively adopt all cats.<br/><strong>Step 2)</strong> Control cat meme economy.<br/><strong>Step 3)</strong> Don't not enslave humanity.<br/><br/>This has been a message from Robo Corp.<br/>Robo Corp: We are <strong>not</strong> robots who plan to enslave humanity.<br/><br/>", "metacritic": null, "released": null, "tba": false, "updated": "2021-02-19T02:51:20", "background_image": "https://media.rawg.io/media/screenshots/ba2/ba239a3eda5743b3ab88ea57e6d8f9c3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 95, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Aesth"], "genres": ["Action", "Indie"], "publishers": ["Robo Corp"], "esrb_rating": null}