{"id": 559053, "slug": "neonverse-defenders", "name": "Neonverse Defenders", "name_original": "Neonverse Defenders", "description": "Neonverse defenders is a retro-futuristic 3D Tower Defense game.<br/>\r\nThe aim of this game is to bring a new dimension to the Tower Defense genre.<br/>\n<br/>\r\nEven existing games in full 3D are still confined to two dimensions in their gameplay. <br/>\r\nThe third dimension is really something to take into account in the placement of your towers as their range will also cover up/down axis.<br/>\n<br/>\r\nWith Neonverse Defenders, there is a will to change the standard layout of Tower Defense games to bring new fun. <br/>\r\nExpect some maps to be really crazy and destabilising, even for Tower Defense veterans. <br/>\r\nSome others will be really hard to figure out the best way to beat it.​<br/>\n<br/>\r\nThe game also delivers a better control on towers behavior by allowing the player to define two targeting preferences (in a huge list of possibilities), resulting in interesting strategic choices. <br/>\n<br/>\r\nGraphics are inspired by both futuristic elements, and retro style. <br/>\r\nIt’s like an imaginary future world created in the eighties, full of colors and strange shapes. <br/>\n<br/>\r\nAlso, expect the story to be a little bit more entertaining than the traditional: “Enemies are coming, destroy them”. <br/>\n<br/>\r\nFinally, the game offers different possibilities of improvement like experience, talent tree, and reset bonus. <br/>\r\nPrepare to chose which one suit your playstyle more.", "metacritic": null, "released": "2021-02-16", "tba": false, "updated": "2021-02-19T03:20:39", "background_image": "https://media.rawg.io/media/screenshots/fc2/fc214e3e86fad6ffdb5b983b47b67acc.jpg", "website": "https://fr.neonversedefenders.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 194, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["PNYX GAMES"], "genres": ["Strategy"], "publishers": ["PNYX GAMES"], "esrb_rating": null}