{"id": 559051, "slug": "starlight-eye-of-the-storm", "name": "Starlight: Eye of the Storm", "name_original": "Starlight: Eye of the Storm", "description": "<h3>SHOOT 'EM UP!</h3><br/>Just keep shooting! Starlight: Eye of The Storm is a retro 2D Arcade bullet hell vertical shooter. Unleash your special powers, upgrade your weapons, get better ones! Be prepared for challenging enemies coming at you across <strong>10 stages</strong>. Danger can come from any direction, including 3D objects in the background.<h3>DRIFT MODE</h3><br/><br/>Drift (auto-pivot mode) around your enemies with style as they may challenge you to a dogfight duel!<h3>WEAPONS</h3><br/>Each playable ship has a different set of emplacements (up to 3) that can be installed with different types of weapons.<h3>WEAPON SHOP!</h3><br/><br/>Fit your ship from a huge range of weapons (up to 60 unique combinations)! Fight with skill and you'll be rewarded with <strong>Capsules</strong> necessary to upgrade your existing weapons to a higher level! <br/><br/>You'll also get to enjoy the full range of upgrades for your ship itself to improve your odds in battle!<h3>CREATE YOUR OWN SHIP!</h3><br/>Create your own customized ships with ease using your own jpg, png or tiff files with or without transparency. A set of guided criteria will help ensure that your ship is good to go! Upload your customized ship onto Steam Workshop to share with the community!<h3>Plot</h3><br/>Earth, 300 years after the devastation of the Final Nuclear War. (6 months before the events of https://store.steampowered.com/app/315080) After the experimentation of opening wormholes went awry, several massive wormholes opened up randomly near the vicinity of the already devastated Earth. <br/><br/>The Council of Foresight has since chosen you and 2 of your top ace pilot friends for the mission to re-establish contact with the Council on Mars. Your ships will therefore deliver the top secret communication data via the massive wormhole and to the orbit of Mars where the local government forces will be waiting. You'll be supported tacitly by allies of the UNC through sales of secret weapons to your team. Since your mission is under absolute secrecy, you'll be attacked by ALL forces.<br/><br/>As enemy ships (pirates) began pouring forth and your immediate mission is to protect the UNC Headquarters Space Station that is still currently under construction from attack. Henceforth, the Starlight: Eye of The Storm saga begins....", "metacritic": null, "released": "2021-02-16", "tba": false, "updated": "2021-02-19T03:19:24", "background_image": "https://media.rawg.io/media/screenshots/142/14204f01b09ce46f436d77a09433b845.jpg", "website": "http://www.stridesdev.org/starlight-landing-page/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 33, "ratings_count": 0, "suggestions_count": 388, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Strides Interactive Game Studio"], "genres": ["Action", "Indie"], "publishers": ["mNosGaming"], "esrb_rating": null}