{"id": 559080, "slug": "cats-in-space", "name": "Cats In Space", "name_original": "Cats In Space", "description": "<strong>Cats In Space</strong> is adventure and arcade game with a little storyline. In game you are taking control of two cats : Gray and Orange (You are able to dress them up in warderobe) . In space you need to move without gravitation and the only help is that you can stop by using \"freeze\" skill. You will have to fight against aliens, avoid traps and collect collectibles.  In game there is four modes listed. Carrer (over 30 levels), Time attack, Online PvP and Level constructor! You will have fun while helping the main characters.<br/><br/><strong>Career</strong> : This is main mode with the storyline. You are playing as a two cats in space. Compared to other modes this one does not count time, but draws attention to : full life, if alarm has been turned on, if star has been found. <br/><br/><strong>Time Attack</strong> : Those stages has been designed to slow you down as much as it's possible. Now you don't need to worry about buttons or collectable objects, but especially for your life and time. You can use this mode to play against your friend offline on one computer by comparing time.<br/><br/><strong>Online PvP</strong> : There you can search for opponent or play with friend. The faster and more precise player will win! Just type a room name with you would like to connect/create or leave it empty to join random room.<br/><br/><strong>Level Constructor</strong> : In this mode you can construct levels by yourself. You have plenty of options available to modificate gameplay and a lot of object to put on scene. This mode is under improve so some things might not work correctly and sharing online with friends isn't possible (what i'm working on ☺ ).<br/>", "metacritic": null, "released": "2021-02-17", "tba": false, "updated": "2021-02-19T03:39:03", "background_image": "https://media.rawg.io/media/screenshots/98a/98ab15d5e26db7dadd0c0f75222f038f.jpg", "website": "https://www.catsinspace.online", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 183, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jan Radtke"], "genres": ["Adventure"], "publishers": ["Jan Radtke"], "esrb_rating": null}