{"id": 559018, "slug": "wolfsbane-2", "name": "Wolfsbane", "name_original": "Wolfsbane", "description": "<strong>Wolfsbane is a simple, stylized multiplayer game set in a vibrant and magical world. Inspired by other social games, Wolfsbane has only one goal, to make you question your friends’ trustworthiness and provide hours of fun. Hop on a magical adventure and get ready to outsmart your way towards victory. </strong><br/><br/>The game is set in a village called Woodpine, a place where the blood moon rises up in the sky once every ten years. During the day, villagers collect various items that will help them fight off the Werewolf when the moon forces the transformation. <br/><br/>When the night comes, it’s all about communication and teamwork. Failing to do that results in getting eaten by the beast. <br/><br/>Each player is assigned a role at the start of the game. They’ll have to use the perks of their role to outplay The Werewolf and win the game.<br/><br/><br/><br/>We already have a few fully-functional roles, but we're planning to add many new ones through updates coming in the near future. Each one of these roles has a unique ability that affects the gameplay in a different way.<br/><br/>If the villagers combine their abilities through proper teamwork they will be able to achieve victory with ease. But, The Werewolf is not to be underestimated.<br/><br/><br/><br/>When the full moon rises, the player set to be The Werewolf can secretly transform and attack in the right moment, then transform back into human form. If the match progresses in the final phase, which is The Blood Moon, it's even more difficult for the villagers to achieve victory, since during this time the beast is permanently transformed and greatly empowered.<br/><br/><br/><br/>A match in Wolfsbane is divided in three different phases. The Daylight / Harvest Phase, the Full Moon Phase, and the final Blood Moon Phase. During each one of these phases, players are given different tasks they must complete, all with the ultimate goal of transforming their fellow villager who is cursed to be the evil werewolf back into human form.<br/><br/><br/><br/><strong>We recommend buying if you: </strong><br/><br/><ul><li>Like social games <br/></li><li>Enjoy the aesthetics of stylized games <br/></li><li>Want to have tons of fun lying or being lied to by your friends <br/></li><li>Eating your friends as The Werewolf <br/></li><li>Relaxing with simple gameplay after a hard day of work </li></ul><br/><strong>We don’t recommend buying if you: </strong><br/><br/><ul><li>Expect robots (we might add them in the future though) <br/></li><li>Prefer complex gameplay that takes weeks to learn <br/></li><li>Enjoy single-player more than multiplayer </li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2021-02-19T02:54:13", "background_image": "https://media.rawg.io/media/screenshots/6f7/6f744c288d3b04e15a0c255962f7b233.jpg", "website": "https://workbench-ent.com/game/wolfsbane/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 506, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Workbench Entertainment"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["Workbench Entertainment"], "esrb_rating": null}