{"id": 559095, "slug": "puppy-pipy", "name": "Puppy Pipy", "name_original": "Puppy Pipy", "description": "Puppy Pipy - a video game for all the people who love dogs. This story is about a  6 week old golden retriever puppy. When he was born he got abandoned. A young boy found him near by a trash bin, and he decided to foster this little puppy. But because of some accidents happened, they forced to be separated. Pipy’s journey to find his young master will show everyone about the wonderful relationship between human and dog.<br/><br/><br/><strong>Real Physical Puzzle</strong><br/>Puppy Pipy is a platformer puzzle game created by Unity engine, and we fully used this engine’s physical properties. In order to provide different playing experiences and the way to show the different physical properties in the 5 stages, we made 5 different core gameplay in each stage, which are gravity, bounce, rotation, fluid, and lift. Because of these physical properties are almost same as the real world, there is more than one way to beat each challenge, everyone can opens their mind and finds the fastest way and secret methods to solve all the puzzles they encountered in their journey. <br/><br/><br/><br/><strong>Unique Skills of Puppy</strong><br/>Pipy is a smart puppy, even though there are many challenges in his journey, Pipy will use his smart brain and different skills to solve the puzzles. In each stage Pipy will get a unique item, such as Dog poop, tennis, Frisbee, and water gun, these items are very helpful to help Pipy overcomes the challenge and defeat each enemy. In order to make our journey more fun and challenging, Pipy will learn many useful skills such double jump, super dash,  gliding, and emergency evasions. If you can use emergency evasion in the right timing, Pipy will move to enemies and defeat them immediately, this skill can also helps Pipy reach to many areas that he can’t get to in the normal situation. <br/><br/><br/><br/><strong>Pipy and Friends</strong><br/>Pipy will meet many friends in his adventure. A black dog will give food to Pipy when he is starved. A hamster will help Pipy escape from prison. A mother duck will ask Pipy’s help to find her son. A kind and smart old lady will give Pipy some wisdom ideas. They are not just simply interacting with Pipy, but also teach Pipy skills.<br/>", "metacritic": null, "released": "2021-02-17", "tba": false, "updated": "2021-02-19T03:51:15", "background_image": "https://media.rawg.io/media/screenshots/c7e/c7ebf1d9175d00f7b0256208c8f72181.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 329, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jet Stone Games"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Jet Stone Games"], "esrb_rating": null}