{"id": 559099, "slug": "bin-wang-dou-di-zhu", "name": "宾王斗地主", "name_original": "宾王斗地主", "description": "The classic Landlord game, with regular games, ladder games, normal games, mangy games and plenty of great rewards waiting to be redeemed!<br/>There are 13 legal types of tiles that can be played in Dojo.<br/>(1) Single: the order of size from 3 (smallest) to King (largest).<br/>(2) Pair: two cards of the same size, from 3 (smallest) to 2 (largest).<br/>(3) Three: three cards of the same size.<br/>(4) Three with one: three and bring any one card, e.g. 6-6-6-8, compared according to the size of the three cards, e.g. 9-9-9-3 over 8-8-8-A.<br/>(5) Three with a pair: three and bring a pair, similar to a side road in poker (Full House), compared according to the size of the three cards, e.g. Q-Q-Q-6-6 over 10-10-10-K-K.<br/>(6) Straight: at least five cards of consecutive sizes (from 3 to A, 2 and odd cannot be used), e.g. 8-9-10-J-Q.<br/>(7) Consecutive pairs: at least 3 pairs of consecutive sizes (from 3 to A, 2 and odd cannot be used), e.g. 10-10-J-J-Q-Q-K-K.<br/>(8) Three of a kind jokers: at least 2 three of a kind of consecutive size (from 3 to A), e.g. 4-4-4-5-5-5.<br/>(9) Planes: each triple with an extra singleton, e.g. 7-7-7-8-8-8-3-6, able to bring a singleton 2 and a king, although a triple 2 is not available.<br/>(10) Three cards with a pair of jokers: each of the three cards brings an extra pair, only the three cards need to be consecutive, for example 8-8-8-9-9-9-4-4-J-J, although the three 2s cannot be used, but can bring a pair of 2s [cannot bring a pair of kings, because the size of the two monsters is not the same], it should be noted here that the three cards with a single card and a pair cannot be mixed, for example 3-3-3-4-4-4-6-7-7 is not legal.<br/>(11) Bombs: four cards of the same size, bombs can cover all other cards except rockets, and larger bombs can cover smaller ones.<br/>(12) King Bomb: a pair of monsters, which is the largest combination, capable of covering any tile type including bombs.<br/>(13) Four with two: There are two types of cards, a four with two singles, such as 6-6-6-6-6-8-9, or a four with two pairs, such as J-J-J-J-J-9-9-Q-Q. Four with two only compares according to the size of the four, and can only cover the same type of four with two that is smaller than itself [four with two and four with two pairs belong to different types of cards and cannot cover each other], and cannot cover other types of cards, and four with two can be covered by bombs that are smaller than itself.", "metacritic": null, "released": "2021-02-18", "tba": false, "updated": "2021-02-19T03:54:54", "background_image": "https://media.rawg.io/media/screenshots/f0b/f0b4d5aaeafb65d94308296a1aebe438.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 209, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["HongKong Cards"], "genres": ["Strategy", "Simulation", "Casual", "Massively Multiplayer"], "publishers": ["HongKong Cards"], "esrb_rating": null}