{"id": 559093, "slug": "majiang", "name": "MaJiang", "name_original": "MaJiang", "description": "Sichuan Mahjong originated in the Sichuan region. In addition to the general fan style, the characteristic gameplay such as fixed deficiency, wind and rain, bloody battle to the end, etc., is full of unique and interesting. In addition to the traditional touch, kong, etc. and card rules, it also added the unique double card and match card functions-Come Game-to make your game more fun! The game uses a new Unity engine to support multi-platform interaction. [5]<br/>Main rule<br/>1. There are only 108 cards of bar (so), tube (cake), and ten thousand. There are no flower, wind, and arrow cards.<br/>2. Not to eat. (\"Pass\" on the action panel means give up) 　3. There must be a lack of cards, that is, there can be no cards of three suits when playing cards.<br/>4. The last four automatic betting, that is, when there are only the last four cards left in the wall of cards, if the player's hand has been bid and the bid is exactly any of these four cards, then when this card appears, The player who bids can only be hooped, and cannot skip the hoops to enter the subsequent search process, and the player has no right to choose. Note: The last four cards in the rules of fixed deficiency are not necessary.<br/>5. Repeatedly. That is to say, if a player plays a card, if more than one player wants it to be a bee, all can be a bee.<br/>6. Wind and rain.<br/>Windy (open bars): straight bars and face down bars.<br/>Straight bars are the three same cards in the player's hand, and when other players play the fourth same card, the player chooses the bar. Straight bars are immediately charged twice the points (basic points in the game).<br/>Curved kong, also called face down kong or paki kong, is when the player has touched three of the same cards, the player himself draws the fourth same card, then the selected kong.　When you hit the bar, you will immediately collect 1 times the points (basic points in the game).<br/>It's raining (concealed bars).<br/>Raining means that the player holds four identical cards (not touched), at this time the player can choose to take out the cards from his hand. When it rains, 2 times the points (basic points in the game) will be charged to other non-observers.<br/>When the player faces down the bar, his family can grab the bar and Hu, but it is invalid in wind and rain; when it is raining (concealed bar), he cannot grab the bar and Hu. In addition, if the player has not bid at the time of the game, he must return all the wind and rain proceeds.<br/>7. Flow Bureau Cha Hua Zhu Cha shouted<br/>In ordinary courts, the flow means that no one is playing cards. In the bloody battlefield, the flow means that there are two or more people who have no Hu cards in the end.<br/>Flow processing:<br/>Step 1: Check Sanitation (Huazhu) that the player with the 3 house card in his hand is the Huazhu, and the Huazhu pays 16 times the points to the non-huazhu player.<br/>Step 2: Check the shout<br/>The player who did not draw (the flower pig does not use it) pays the player who draws the largest possible number (yelling), and returns all the wind and rain proceeds.<br/>8. Fight to the end<br/>The bloody battle mode in the bloody battlefield means that the game is not ended by a player who has been Hu Hu, but the players who are not Hu Hu continue to play until there are 3 Hu Hu or the remaining players have lost the game. In this way, players who play first may not have the most profit, and players who fire can also turn around, which improves the game and interest, and promotes the stable development of the game. The game is over and settled together. If the player who has gone wrong leaves early, the winning number will not be given.<br/>9. Zuozhuang<br/>Non-blood battle: the player who fires the shot from the second round will be the banker, the player who fires the shot will be the banker, and the personnel change will roll the dice.<br/>Blood battle: roll dice in every round.", "metacritic": null, "released": "2021-02-17", "tba": false, "updated": "2021-02-19T03:49:04", "background_image": "https://media.rawg.io/media/screenshots/8aa/8aab75a3978039107ee408a7949ffd1e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 52, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Chengdu Haidaohai Technology Co"], "genres": ["Sports", "Casual"], "publishers": ["Chengdu Haidaohai Technology Co"], "esrb_rating": null}