{"id": 559182, "slug": "police-eagle-robot-battle", "name": "Police Eagle robot battle", "name_original": "Police Eagle robot battle", "description": "Gravity Games Studio would like to welcome you to our Police Eagle Robot Battle game of 2020! Have you ever played any transforming robot games, realtime games of eagle transform, and other transforming robotics game 2020? If not, then get ready to play this robotic battle!<br/><br/>Police Eagle Robot Battle Game Play:<br/><br/>The game play of this Police Eagle Robot Battle is very thrilling because you’re an amazing police robot and you’ve to fight against the incredible heroes, boxeo robots, cars, tanks and helicopters in the whole crime city. Transform yourself into Eagle cop like other mech games and robot transformation games. Throw your speedy combos as eagle Robot on shooting helicopters.<br/><br/>Police Eagle Robot Battle Features:<br/><br/>*  10 action pack levels of Eagle transform in air combat.<br/>*  Enjoy playing Best eagle robot simulator 2018.<br/>*  Realistic sound effects of Futuristic Battle of robot <br/>    games.<br/>*  Police robot indulge in city survival rescue mission.<br/>*  Futuristic HD, 3D Graphics of a real robot. <br/>*  Experience amazing police robot into super eagle <br/>    transformation.<br/><br/>Actually few years ago, there was no violence of mech warriors, war machines, robot wars, and mutant heroes like green hero, immortal hero and other incredible heroes in the whole futuristic city like other futuristic robot battle.<br/>But now your grand city is seized by the enemy tanks, mafia cars, and super heroes and you are the only one police robot warrior in the whole grand city to save the innocent citizens having world of warships!<br/><br/>Buckle up for US Police Eagle Robot Battle 2018. This futuristic transformation game will make you the legend of flying eagle robot simulator 2018. You as super hero of this rescue mission will attack the robot cars and real robots who have entered survival city creating destruction.<br/>Activate eagle flight mode and watch the wings coming out. Transform flying robot into robo eagle that has modern shooting weapon that will destroy robot cars with super strike. Enjoy robot eagle hero transformation into flying monster. Chase robot enemies causing destruction in futuristic city &amp; stop them with super strike.<br/><br/>A true US police flying robot transforming hero knows how to fight against the flying helicopters and mech robot in futuristic robot war 2018 with super duper strike. Fight in best flying bird eagle game making yourself as real US police cop robot &amp; Warrior of futuristic flying eagle transformation game 2018. In city survival rescue mission you have to utilize your flying eagle warfare experience to futuristic urban city from flying robot cops and dragon attack.<br/><br/>Will you fight back as monster hero in the city battle to save humanity? If yes, it’s your time to show your amazing shooting, boxing, firing and attacking skills by transforming your machine robot into flying eagle. You are equipped with weaponised monster trucks which can be transformed into fighting steel robots by pressing transformation robot button.<br/><br/>So do you have interest in transforming simulator and online war games of eagle and helicopter? If yes, then get ready to play this Battle Revolution of robot warrior and transformation of eagle. <br/><br/>WE VALUE YOUR FEEDBACK:<br/><br/>Police Eagle Robot Battle will be updated according to your suggestions. Don't forget to leave a review with your feedback.", "metacritic": null, "released": "2018-04-22", "tba": false, "updated": "2021-02-19T04:49:05", "background_image": "https://media.rawg.io/media/screenshots/dd1/dd17a5a66644d207181199a86f4d95ef_V88A50o.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 156, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Arham Ehtasham"], "genres": ["Action", "Strategy"], "publishers": ["Arham Ehtasham"], "esrb_rating": "Teen"}