{"id": 559172, "slug": "superhero-crime-fighter-rescue-super-power-hero", "name": "Superhero Crime Fighter Rescue – Super Power Hero", "name_original": "Superhero Crime Fighter Rescue – Super Power Hero", "description": "This crime fighter rescue is all about a superhero that is going to save the humanity from the wild animals. They are going to eat the city people. So you can call it a rescue pet war too. There are many action heroes around but no one is taking the charge of this flight thrills. Be the part of this superhero game and enjoy the whole thrill and enjoyment of saving someone. You have dreamt to be flying superheroes, the very first time we are giving you a chance to take part in the superhero run and win the title of futuristic robots war. This is all about to the save human beings who are suffering due to wild enemies. It is the responsibility on your shoulder to give protection them and kill the wild animals who are coming on your way. Feel yourself an extraordinary man as you have all the super powers in your hand. Download flying superheroes for FREE now! This Superhero Crime Fighter Rescue is an addictive epic and full of mission. If you love mech warrior this is perfect for you.<br/><br/>Enjoy the ultimate action packed where you are given the chance to prove your strategy of flight thrilla behaving like an action heroes to win against others. This is the war of survival you need to be very careful while saving them as you know that those wild animals are very dangerous. If you give them a single chance to attack at you they will finish you. Be a professional fighter and be careful about their moves as well. We know that you can do it but do it in the best possible way and enjoy this cool game. We assume that you are crazy about save humanity. If so, this animal rescue games free for you and we can say that this is what you need! Download the fun and feel the ultimate flying superheroes experience. Smooth construction game controls further helps to fly and fight with ease. There are many stunts which you can do. Once you download this superhero rescue we assure you will hooked in a minute. The time is limited in this battle to crash other rivals so make good use of time while killing them. Let us see how long can you survive the arena? If you are ready to take on this challenge, just download and play it. We guarantee you will not be able to stop playing this immersive and addictive pet legend.", "metacritic": null, "released": "2017-06-14", "tba": false, "updated": "2021-02-19T04:43:38", "background_image": "https://media.rawg.io/media/screenshots/a20/a2083668b3f3ab23a23ff31f25a08eaa_ksijuzO.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 189, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ahsan Imtiaz"], "genres": ["RPG", "Simulation"], "publishers": ["Ahsan Imtiaz"], "esrb_rating": "Everyone 10+"}