{"id": 559152, "slug": "girls-phone-toy-for-little-princess", "name": "Girl's phone, Toy for little princess", "name_original": "Girl's phone, Toy for little princess", "description": "Presenting all in one toy phone for your little princess .<br/>* Girly theme, cute animations<br/>* music, games and  more for your princess<br/><br/>Phone for girls has everything that your girl needs, Cute graphics, bright colors, sweet sounds, a perfect theme to adore. Give your little princess a perfect play phone of her choice.  <br/>Yes, we have all in this, a perfect application to keep little princes engaged for hours.<br/>A game that is designed just for the little girls keeping her interest throughout the application. Let her fly with the colorful butterfly.<br/>This game will give your daughter a real life experience of using a phone; they can dial numbers, answer a call, send messages, play games, and also have some fun with musical instruments.<br/>Below are the features that we have included for your baby’s phone:<br/>A specially designed theme and animations keeping in mind the taste of your daughter<br/>Dial Numbers: Dial numbers from 0 to 9 by tapping the buttons and also hear the sound of the number pressed<br/>Phone book: Predefined contact list with common names and funny characters<br/>Messages: Chat with friends, use smiley or text messages<br/>Incoming/ Missed call: Incoming calls pop up to get your little one excited to answer the call, sometimes get a missed call alert too.<br/>Music Screen: Play different musical instruments and listen to the musical notes with a tap<br/>Games: Interactive and engaging games for the little ones for hours on fun.<br/>A game that is designed to keep your baby engage on their own while you are out on a long journey or waiting in a line.", "metacritic": null, "released": "2016-09-11", "tba": false, "updated": "2021-02-19T04:34:04", "background_image": "https://media.rawg.io/media/screenshots/e47/e479f11031a1cda1a776a9e60a9f11a7_iKcQOX0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 58, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["VYAAP TECHNOLOGIES PRIVATE"], "genres": ["Simulation", "Educational"], "publishers": ["VYAAP TECHNOLOGIES PRIVATE"], "esrb_rating": "Everyone 10+"}