{"id": 559135, "slug": "kao-the-kangaroo-trilogy", "name": "Kao the Kangaroo Trilogy", "name_original": "Kao the Kangaroo Trilogy", "description": "Kao the Kangaroo\nAfter being kidnapped from his beautiful home, Kao must find his way back to Australia. Armed with comedy-sized boxing gloves, Kao hops, skips, and triple jums his way across magnificently colored landscapes. Legs the size of a professional bodybuilders aren't the only means of locomotion for this furry bundle of fury. Use hang gliders, motorboats, snowboards, and even a space scooter. \n<br/><br/>\n<ul>\n<li>5 worlds with more than 45 levels!\n</li><li>Many vehicles to ride - snowboard, space scooter, hang glider, alligator, and more!\n</li><li>Tons of enemies: pig with a lollipop club, a sailor who would love nothing more than to swab the deck with Kao, an angry Eskimo, a happy Aborigine, and a shark hungry for a kangaroo sandwich and more!\n</li><li>Incredible graphics!\n</li><li>Three difficulty levels!\n</li><li>Bonus &amp; Power-Ups to collect, such as energy, coins, power gloves, checkpoints, freeze, speed-up!\n</li><li>Awesome music &amp; sound effects within each level!</li>\n</ul><br/>\n<p>Integrated GPUs are not supported.\n</p><br/>\nLanguages available (text): English, German, Polish, Spanish, French, Italian.\n\n<br/>\nKao the Kangaroo: Round 2\nPlay as Kao! The cutest and bravest kangaroo of all video games returns in this digital version of “Kao the Kangaroo: Round 2.\"\n<br/>\nExperience the joy of playing a classic 3D single-player platformer filled with various challenges, including fighting, racing and solving puzzles.\n<br/>\nBounce through 25 levels set in 5 unique, colorful worlds to rescue your animal friends captured by the evil Hunter and his henchmen!<br/>\n<br/><ul>\n<li>Cloud saving\n<br/>\n</li><li>High resolution support\n</li><li>Controller support (Xbox 360/One and PS4)\n</li><li>Punch the baddies! Use a variety of different fighting techniques to rescue your friends\n</li><li>Approximately 30 challenging enemies to defeat\n</li><li>Boss encounters\n</li></ul><br/>\nLanguages available (text and audio): English, German, Polish, Spanish, French, Italian.<br/>\n<br/>\nKao the Kangaroo: Mystery of the Volcano\nMystery of Volcano is the third edition in the adventures of KAO the Kangaroo. \n<br/><br/>\nJoin the feisty marsupial as he bounces his way through challenging and interesting missions, whilst interacting with the inhabitants of this unique game world. \n<br/><br/>\nKAO features a vast and seamless game world, allowing players extensive freedom of movement and also the ability to replay favorite moments or go back to previously visited locations and finish incomplete tasks. Uncannily diverse gameplay also ensures there's never a dull moment in KAO's world. Whether it is sliding down jungle roots, parachuting into the unknown, flying a plane and fighting mid-air battles, or racing a virtual reality simulator build by one of KAO's friends - KAO takes adventure gaming to extreme new heights.\n<br/><br/>\nLanguages available: English (text), Spanish (text), Polish (text and audio).", "metacritic": null, "released": null, "tba": false, "updated": "2021-02-19T04:21:20", "background_image": "https://media.rawg.io/media/screenshots/9e6/9e612f2d78e2e9ec23d262878a6bf83f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 364, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Tate Multimedia"], "genres": [], "publishers": ["Tate Multimedia"], "esrb_rating": null}