{"id": 559155, "slug": "poly-island-art-tangram-puzzle", "name": "Poly Island Art-Tangram Puzzle", "name_original": "Poly Island Art-Tangram Puzzle", "description": "PolygonArt - Tangram Puzzle is the best and free new  Polygon Art Coloring Game . It is perfectly designed for both Children and Adult.<br/><br/>Very simple intuitive gameplay. Your task is to combine colorful image from pieces of different shapes and you can share them with your friends . It will give them the opportunity to develop sense of beauty and sense of art.<br/><br/>Challenge your skills in Timer mode. It seems impossible at first time, but then you will be wondered how your skills develop as you play.<br/><br/>It is the latest color by number app with beautiful low polygon artworks. It provides jigsaw and coloring puzzles of various styles, which could be 3D effect, animals, birds, cartoon, etc.<br/><br/><br/>HOW To PLAY?<br/>\t- Select your favourite art puzzle.<br/>\t- Drag polygon pieces and place them in the correct area.<br/>\t-Identify the target area either by color or shape.<br/>\t-Play like a jigsaw puzzle.<br/>\t- DONE! And don’t forget to SHARE your work with friends!<br/><br/>KEY FEATURES:<br/>\t-Two Playing Modes.<br/>\t-fantastic artworks<br/>\t-Relieve Stress<br/>\t-Advance your logical thinking and memory;<br/>\t-More Than 60+ artworks.<br/>\t-Mind Soothing Sound Effects.<br/>\t-Compete for the top-score on Game Center leaderboards<br/><br/><br/>Download this for free! Enjoy this puzzle spiel game with modern art. Have a nice day!<br/>Your Suggestions are considered as part of our regular development process. You can send us your compliments/feedback on zero.gravity.7255@gmail.com", "metacritic": null, "released": "2018-08-06", "tba": false, "updated": "2021-02-19T04:35:22", "background_image": "https://media.rawg.io/media/screenshots/245/24563f968de75f589a4ab8683f18b612.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 35, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Yash Desai"], "genres": ["Casual"], "publishers": ["Yash Desai"], "esrb_rating": "Everyone 10+"}