{"id": 559150, "slug": "merge-tactics-castle-defense", "name": "Merge Tactics: Castle Defense", "name_original": "Merge Tactics: Castle Defense", "description": "Merge Tactics is a unique tower defense game filled with elements of growth, strategy, and challenge.<br/>It lets you place blocks wherever you want, based on whatever fighting strategy you use.<br/><br/>Game Features:<br/><br/>Create Your Own Battle Decks and Strategies<br/>- You need different decks and strategies to effectively deal with the various invaders that attack your forces. <br/>- Every time you clear a wave, you'll get to expand your territory on the battlefield and employ even more diverse tower defense strategies.<br/><br/>Combine Blocks into More Powerful Units<br/>- In this game, one can be stronger than two—even three! Merge your blocks on the battlefield whenever you can to create formidable troops.<br/><br/>Collect Blocks of Various Kinds<br/>- Collect blocks of different types—Melee, Ranged, Support, etc.—to create unique decks and try out various fighting styles.<br/><br/>Grow Your Castle and Characters with Gold and Artifacts from Battles<br/>- Grow your castle and characters to unlock new skills and get special loot rewards.<br/><br/>Experience this brand new td game, Merge Tactics!<br/><br/>※ Note: Merge Tactics is free to play, but you can buy certain items with cash to enhance your experience. <br/>If you don't want to use the In-app Purchase feature, you can always disable it on your device's Settings menu.", "metacritic": null, "released": "2020-10-13", "tba": false, "updated": "2021-02-19T04:31:29", "background_image": "https://media.rawg.io/media/screenshots/2dd/2dd9f605892e74926a1079bd4c35e78e_BCbDnh6.jpg", "website": "https://www.loadcomplete.com/games", "rating": 0.0, "rating_top": 0, "added_by_status": {"playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 154, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["LoadComplete"], "genres": ["Strategy", "Board Games"], "publishers": ["LoadComplete Co"], "esrb_rating": "Everyone 10+"}