{"id": 559139, "slug": "skateboarding-breakthrough-gaming-arcade", "name": "Skateboarding - Breakthrough Gaming Arcade", "name_original": "Skateboarding - Breakthrough Gaming Arcade", "description": "To play this game on PS5, your system may need to be updated to the latest system software. Although this game is playable on PS5, some features available on PS4 may be absent. See PlayStation.com/bc for more details.<br/>Do your best and skate to get a high score in this 2D side scrolling skateboarding game from Breakthrough Gaming! As a skater, you'll need to perform tricks in the skate park to score points! So what will the score be for your run this time?<br/><br/><br/>The lesson for this game is: God wants us to enjoy this life He's given us and to have fun doing the right thing! Skateboarding in real life and in a video game can be lots of fun, so that's a way you can enjoy the life God has given you! So live for God and don't forget to have fun! Check out Psalm Chapter 118 in the Bible to read more about this!<br/><br/><br/>[Game Features]<br/>-Simple game play and controls<br/>-Classic styled arcade fun<br/>-Biblical message<br/><br/><br/>[This game is recommended for people who enjoy or are looking for...]<br/>-skateboarding games<br/>-games for skaters<br/>-a fun and entertaining game for boys and girls of all ages<br/>-2d side scrolling games<br/>-high score games<br/>-skating games<br/>-black and white graphics<br/>-skateboarders<br/>-games with tricks and trick shots<br/>-classic first generation home computer graphics and sound<br/>-a platform game with Christian themes<br/>-Bible based games<br/>-pixel art<br/>-games for a skateboarder<br/>-faith based games<br/>-a Christian themed game that anyone can play and enjoy<br/><br/><br/>[About the Breakthrough Gaming Arcade series]<br/>In the games of the Breakthrough Gaming Arcade series, you play arcade styled games that express a Biblical truth, complete with classic arcade styled music and graphics, too!<br/><br/><br/>[About Breakthrough Gaming]<br/>Breakthrough Gaming creates Christian themed entertainment in the form of video games, animation, comics, and related products! Get more information about how to purchase our products at our official website: http://www.BreakthroughGaming.com<br/><br/><br/>Offline single player<br/>Offline play enabled<br/><br/><br/>Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy). <br/><br/>Software subject to license (us.playstation.com/softwarelicense). <br/><br/>One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.<br/>", "metacritic": null, "released": "2021-02-17", "tba": false, "updated": "2021-02-19T04:25:04", "background_image": "https://media.rawg.io/media/screenshots/b95/b958f2d04e642cebd79590a1bf17f0bd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 11, "beaten": 1, "dropped": 1}, "playtime": 0, "achievements_count": 44, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["PlayStation 4"], "developers": [], "genres": ["Sports", "Arcade"], "publishers": [], "esrb_rating": null}