{"id": 559266, "slug": "puppy-spa-day", "name": "Puppy Spa Day", "name_original": "Puppy Spa Day", "description": "<p>It's puppies' spa day! Go grab all the puppies and bring them to the pet salon &lt;33<br/></p>\n<p>*Note: Avoid the corpse flowers on the way or you lose.<br/><br/>- The development process overall</p>\n<p>This is my second version of Assignment1. In the first version, I used free assets. I created my own assets in this version. It's a stressful making process but I'm glad I made it.</p>\n<p>- Successes (What went right)</p>\n<p>The collision function</p>\n<p>The tile map grid</p>\n<p>Scene switching</p>\n<p>Keyboard input</p>\n<p>Know how to draw pixel pic in Photoshop</p>\n<p>- Failures (What went wrong)</p>\n<p>The score counting UI: when the player get key after dog,  the key score ui will replace the dog score ui text</p>\n<p>The player can enter the door without the key: I think it's the problem of the code</p>\n<p>- Lessons Learned (What did you learn from your failures or how did you overcome them)<br/></p>\n<p>First, I learned how to make pixel painting in the Photoshop then import it into Unity, including fitting the block into the tile map.</p>\n<p>Second, I finally figured out how collision works in Unity2D. I been stuck at one bug for a while which is the scene doesn't change when the player reaches the door. It could be a lot reasons: collision range, coding, scene doesn't include in the scene management, etc.)</p>\n<p>Besides, I get more familiar with the UI system. I used to be annoyed by the canvas default size all the time since it's too large. Also how the button function works.</p>\n<p>- Future Development (If you were to continue working on this game how would you improve it)</p>\n<p>Sound System</p>\n<p>Animation of corpse flowers (make them moving in pingpong)</p>\n<p>more level more fun</p>\n<p>Generate trap in random position </p>", "metacritic": null, "released": "2021-02-18", "tba": false, "updated": "2021-02-19T05:16:09", "background_image": "https://media.rawg.io/media/screenshots/650/650b6ea42bb805269e5992b611d7d6ca.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 6, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Web"], "developers": ["ireneyang"], "genres": [], "publishers": [], "esrb_rating": null}