{"id": 559343, "slug": "a-freak-of-nature", "name": "A Freak of Nature", "name_original": "A Freak of Nature", "description": "<p><strong>IMPORTANT:</strong></p><ul><li>Hopping is disabled by default so the only method of movement is by jumping (unless holding shift).</li><li>Holding shift increases horizontal speed but enables hopping which is scary on narrow platforms. It also decreases jump height. For this reason, it is important to develop skill in timing the shift while in mid-air in order to have full-height jumps that can also cover more distance.</li><li>Use Microsoft Edge because Chrome lags to an unplayable extent on full-screen.</li></ul><p>A wholesome platformer with pleasant characters. The platforming can be challenging, however short, so don't let the music fool you. </p>\n<p>Some people.. ahem.. birds... can be down-right rude. Who cares? Friendly rabbits such as yourself will spare no effort to hang out with them. However, this tree climb is not for the timid of heart, especially if you haven't taken the time to understand the movement mechanics. So be careful, and happy climbing.</p>\n<p>This game was made with speed-running in mind so feel free to share final times. The timer simply stops when you reach the end, since there is no final credits UI yet. </p>\n<p>Assets:</p>\n<ul><li><strong>Music</strong>: <strong>Mourning Dove by Zachariah Hickman</strong> and\r\n<strong>The Slow Rabbit by Nat Keefe</strong> (both from the Youtube Audio Library)</li><li><strong>SFX</strong>: A mixture of sounds made with the <strong>sfxr </strong>app and downloaded from the <strong>Youtube Audio Library</strong></li><li><strong>Art</strong>: Everything made in <strong>Inkscape</strong></li><li><strong>Scripts</strong>: Everything written from scratch in <strong>GDScript</strong></li><li><strong>Engine</strong>: <strong>Godot</strong></li></ul>", "metacritic": null, "released": "2021-02-18", "tba": false, "updated": "2021-02-19T05:32:54", "background_image": "https://media.rawg.io/media/screenshots/db4/db49e6680b5a31571533669a7bd1ce60.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 24, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["KingPieEater"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}