{"id": 559393, "slug": "vr-archery", "name": "VR Archery", "name_original": "VR Archery", "description": "VR Archery is an exciting fast paced arcade / shooting gallery style game that delivers on a truly immersive approach to experiencing archery in virtual reality.<br/>\n<br/>\r\nPlease note:<br/>\r\nThis is an indie (independent/solo) developer game, so the level of quality and graphics is lower than that of most commercial games. Your feedback and bug reports are strongly appreciated and will quickly be used to make this a better game.<br/>\n<br/>\r\nPlay through several arcade style shooting galleries, after completing a tutorial level that will guide you through the basics of how to play VR Archery.<br/>\r\nThis game also features a defence (capture the flag style) level, and a practice level.<br/>\n<br/>\r\nFor playing in VR, you will require a headset with 2 controllers.<br/>\n<br/>\r\nOculus Quest 2 users: Make sure to install the Oculus app for Windows, futhermore, you will need to put on your headset and ensure that you have clicked the blue button to \"Enable\" Oculus link from within your headset.<br/>\n<br/>\r\nOculus link allows you to run this application on your PC, taking advantage of your PC's hardware, and be able to view and hear the game through your headset. You can connect your Oculus device by either a USB-C type link cable or setup Air Link. For best results the official Oculus Link Cable is recommended.", "metacritic": null, "released": "2021-02-18", "tba": false, "updated": "2023-11-06T20:06:49", "background_image": "https://media.rawg.io/media/screenshots/f9a/f9a72c42d9411726002e170b38c3835d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 9, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Karl_OA", "Wes Unwin"], "genres": ["Action", "Indie"], "publishers": ["Wes Unwin"], "esrb_rating": null}