{"id": 559362, "slug": "quick-30-labyrinth-puzzle-action", "name": "Quick 30 Labyrinth -Puzzle & Action", "name_original": "Quick 30 Labyrinth -Puzzle & Action", "description": "<p><strong>#Outline</strong><br/></p>\n<p>\"Quick 30 Labyrinth -Puzzle &amp; Action-\" is a puzzle action game where you have to escape the labyrinth one after another within 30 seconds.<br/>Swipe the UFO (player) to guide it to the door (goal) and escape the labyrinth!<br/>However, if the UFO (player) hits an electric shock wall, it will break, so aim for the goal without hitting the electric shock wall!<br/>There are also labyrinths with switches in them!<br/>Even if it looks like you can't reach the goal, touching a switch will open the way to the goal!<br/>A total of 58 stages! There are 58 stages in all, with many different types of labyrinths blocking your way!</p>\n<p><strong>#How to play</strong><br/>1.Swipe to control the UFO (player) Swipe the screen to control the UFO (player). You can control the UFO (player) by swiping anywhere on the screen.<br/><br/>2.Take the key. There are keys on the stage. Take the key to open the door (goal).<br/><br/>3.Go to the door (goal)! When you get the key, hurry to the door (goal)!<br/><br/>4.Miss when you hit the electric shock wall If you hit an electric shock wall, you will miss. Electric shock walls are not always stationary, but can be moving, bouncing, or chasing the player. It is also a mistake if the player goes off-screen or fails to reach the goal within the 30-second time limit.<br/><br/>5.Use switches to open the way to the goal. There are stages with switches. If you press a switch, various things will happen. Even if it looks like you can't reach the goal at first glance, you can open the way to the goal by using the switches.<br/><br/>6.Collect as many stars as you can and aim for a high score! There are three stars in the stage. Collect as many stars as you can and aim for the goal!<br/><br/>7.Aim to clear the stage as quickly as possible! When you clear each stage, the clear time will be recorded. Aim for the goal faster!<br/><br/></p>", "metacritic": null, "released": "2021-02-18", "tba": false, "updated": "2021-02-19T05:38:05", "background_image": "https://media.rawg.io/media/screenshots/0c3/0c3eaa3ecd0e0b2d57040de5ae459495.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 126, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["takakichi"], "genres": ["Action", "Puzzle"], "publishers": [], "esrb_rating": null}