{"id": 55944, "slug": "the-tower-of-druaga-1984", "name": "The Tower of Druaga (1984)", "name_original": "The Tower of Druaga (1984)", "description": "<p>The Tower of Druaga (ドルアーガの塔, Doruāga no Tō) is a maze-based action role-playing arcade game released by Namco in 1984. It is the first game in the Babylonian Castle Saga series, inspired by Sumerian and Babylonian mythology, including the Epic of Gilgamesh and Tower of Babel.<br />\nIt was conceived as a &quot;fantasy Pac-Man&quot; with combat, puzzle-solving and subtle role-playing elements. The Tower of Druaga was a success in Japan, where it attracted millions of fans, with its mix of arcade action and role-playing elements. It laid the foundations for the action role-playing game genre, as it largely began the trend of combining arcade-style action mechanics with RPG elements. It inspired a number of action role-playing games, including Dragon Slayer, Courageous Perseus, Hydlide, and Ys, as well as The Legend of Zelda, in addition to Dragon Quest creator Koichi Nakamura.<br />\nThe Tower of Druaga runs on Namco Super Pac-Man hardware but with a video system like that used in Mappy, and is the first game from Namco to display its year in Roman numerals on the title screen. It was later ported to the MSX, Famicom and remade for the PC Engine platform by Game Studio. Its first appearance outside Japan was in the third compilation of the Namco Museum Volume series for the PlayStation and also appears on Namco Museum compilations for Nintendo DS, PSP, and Xbox 360.<br />\nOriginally the game and its sequels had no specific setting other than &quot;the tower&quot;. However, in recent years, the series has been retconned as being set in the fantasy kingdom of &quot;Babylim&quot;. A 2008 reboot anime series, beginning with The Tower of Druaga: The Aegis of Uruk, uses the game as its back story, though is set many decades later.</p>", "metacritic": null, "released": "1984-07-20", "tba": false, "updated": "2024-01-16T16:04:13", "background_image": "https://media.rawg.io/media/games/ec4/ec41bfc591bc8afcb9b50746e97d5db4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "beaten": 2, "toplay": 3, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 105, "game_series_count": 2, "reviews_count": 1, "platforms": ["GameCube", "NES", "Game Boy", "Atari 8-bit"], "developers": ["NAMCO", "GAME STUDIO"], "genres": ["Action", "RPG"], "publishers": ["Namco"], "esrb_rating": "Everyone"}