{"id": 559595, "slug": "pizza-time-brackeys-game-jam-20211", "name": "Pizza Time - Brackeys Game Jam 2021.1", "name_original": "Pizza Time - Brackeys Game Jam 2021.1", "description": "<p>Pizza Time is a point to point time trial platformer about delivering pizza but the pizza is very heavy, to avoid being too slow and not making it in the best time possible you must pick up friends who will help you carry the pizzas to the party. </p><p><strong>I recommend you play the game in fullscreen as I don't know how to make the entire screen show on small view.</strong><br/></p>\n<p>Use A and D to move left and right, W to jump(you have a double jump). While mid air press S to kickflip it doesn't do anything but it is fun. while infront of a friends house, pizza shop or party house to interact with them.<br/></p>\n<p>-Friends House - picks up friend to help carry(literally stronger together) </p>\n<p>-Pizza Shop - picks up 3 pizzas</p>\n<p>-Party House - End game objective. When Interacted with will end game and show time and pizzas delivered.</p>\n<p>The game is very simple due to time constraint but I will work on it further after the jam and maybe release it as a mobile game. It is most enjoyed when played against friends or family however that maybe difficult due to the current pandemic. When playing with others write down your pizza delivered and time taken, which are shown at the end, and get your friend or family member to try beat the time. Alternatively if you cant play with friends or family upload your time and pizzas in the comment thread and try to beat others</p>\n<p>This project was in collaboration with Doodles9696 who did the background and environment art.</p>", "metacritic": null, "released": "2021-02-17", "tba": false, "updated": "2021-02-19T06:38:15", "background_image": "https://media.rawg.io/media/screenshots/5ca/5ca9b3d20e8477335d8fd499fdbf00eb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 20, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Finjago"], "genres": [], "publishers": [], "esrb_rating": null}