{"id": 559521, "slug": "the-disaster-itch", "name": "The Disaster (itch)", "name_original": "The Disaster (itch)", "description": "<p><strong><em>The </em><em>Disaster</em>:</strong></p>\n<p>In <em>The </em><em>Disaster</em>, the player, working as the Control Room Manager for Fieldsmen Nuclear Power Plant in the mid-1980s, will try their best to overcome pressure and make the best possible choice to take control of the situation. Knowing each choice will both positive and negative impacts, which choice is the best? This is what the player will have to decide on. </p>\n<p><strong>Details about <em>The </em><em>Disaster</em>:</strong><br/></p>\n<p>Using transitions and different shades of colors to make this experience while also using the style of 1980s work computers displays, there is an complicated story to unfold in a simple to understand user interface.  This experience was made to help bring new comers to the text-adventure genre and also interest seasoned veterans as well.</p>\n<p>With different choice leading to different endings and no way to go back, the player is has to think thoroughly and critically about which is the best choice to make. There are consequences to one's actions and <em>The Disaster </em>is built around that statement. One choice is all it takes to completely change the story.<br/></p>\n<p>This experience was made to bring awareness to these types of situations and getting to be put into that position even though one would not want to be put into it. This will make players  get a glimpse of situations where they must choose from a lesser of two evils. </p>\n<p><em><strong>Credits:</strong></em></p>\n<p>Danny Lopez - Home (weebly.com)</p>\n<p>Font used: Press Start 2P - Google Fonts</p>", "metacritic": null, "released": "2021-02-18", "tba": false, "updated": "2021-02-19T06:21:13", "background_image": "https://media.rawg.io/media/screenshots/6e0/6e0e80dc50216beea4b9c468a1ec8c9c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 3, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Invalid_Name_404"], "genres": [], "publishers": [], "esrb_rating": null}