{"id": 559675, "slug": "eggy-bunny", "name": "Eggy Bunny", "name_original": "Eggy Bunny", "description": "<p>Help bunny collect the easter eggs—watch out for the angry chickens &amp; don't be tempted to eat carrots!</p>\n<p>I chose to continue working with visual elements from my previous 3D exercise, in which I used bunny as player and had her collect carrots by avoiding monsters on the way. </p>\n<p>This 2D game, I thought of egg hunting I used to do on Easter in my childhood. By taking this element, I made the goal of this game to be to have the bunny be the easter egg scavenger. Some impediments were the carrots and angry chicken moms. </p>\n\n<p>Successes:</p>\n<p>Controlling player, sprites, scene changes, game loop, and eggs being picked up, moving angry chickens. </p>\n<p>Initially I had the bunny moving and not rotating/turning. I later applied script so that the bunny appeared like swimming in the field, and I came to like the affect it was giving. </p>\n\n<p>Failures: </p>\n<p>Making sprites drawn be more crisp. Got blurry when imported. </p>\n<p>Having chickens rebound when touches walls. It's going through now, in the x direction, appearing more like the cars in Frogger. Or have chickens keep appearing.<br/></p>\n\n<p>Lessons Learned: </p>\n<p>In the process of making this game, I learned that it is critical to sketch out my overall flow of the game in my notes. This way, I was able to focus on the key points to have this game functioning, and not be tied down by my coding skills. Even if the ideas are grand, if they can't be executed, it's a struggle and can lead to lots of time wasted. So I think it's important to get the big picture going first, and then try the special extra things (this order will make life much easier). As I'm just learning coding and Unity, this exercise really helped me see how this work live. It's like learning by doing at the same time. </p>\n\n<p>Future Development:</p>\n<p>I'd like to incorporate a smoother looping movement to attackers (the angry chicken moms in this case), to add higher levels to the game. Also, develop different conditions that can make more game scenes interesting, besides blocking and attacking via collision as of now. Game theme sound and effect sounds will benefit the intensity of the game as well. 3D version would be fun to also try, but I am more interested in examining the 2D view variations. For Eggy Bunny game, it's 2D top view, but I am curious to know the possibilities for this if it were to be sky to ground (moving vertically from top to bottom position).  </p>", "metacritic": null, "released": "2021-02-17", "tba": false, "updated": "2021-02-19T06:59:13", "background_image": "https://media.rawg.io/media/screenshots/fc2/fc232a3f997f3097a08857fa4029d66d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 6, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["helimoon"], "genres": [], "publishers": [], "esrb_rating": null}