{"id": 559606, "slug": "castle-crest", "name": "Castle Crest!", "name_original": "Castle Crest!", "description": "<p>Castle Crest is a local multiplayer platformer game that's inspired by that one Mario Battle mini-game in Mario Bros 3 on Super Mario All-Stars. That's pretty much the only game I'm actually good at, so I wanted to expand upon it a bit! The game is built in my own engine, using C++ and SDL as a base. I made everything except for the music that was made by the ever talented Distorted Schematic again &lt;3</p>\n<p>Castle Crest stars three playable characters; Stronk the resilient, Cloak the mysterious, and Squeak the nimble. Each has unique stats and abilities, and cater towards slightly different playstyles.<br/></p>\n<p>The game features two gamemodes; Arena Battle and Tower Climb! Arena battle is a single-screen battle, and Tower Climb sees you and up to three friends climbing up a pseudo-randomly generated tower that gets more and more difficult as matches go on! Tower Climb can also be played in single-player mode.</p>\n<p>In either gamemode, you will be assaulted by big bears that bounce you around, lil raccoons that throw stuff at you, and tricky fireballs that you'll need to dodge to avoid! In addition to these critters are special blocks that you can hit to draw spikes, shoot arrows, or detonate explosives.</p>\n<p>Castle Crest is a smaller side-project that I started as a simple little game that I could play with pals when they're over. It's intentionally limited in scope and pretty barebones, so that I could just get it out into the world and be done with it pretty quickly.  I'm more or less happy with it as it is, and don't really plan on doing much more with it beyond this. Either way, I hope you enjoy it!</p>\n<p>Note to linux users: I'm still trying to figure out how to properly contain SDL with my game, but in the meantime you'll need to install a couple of SDL dependencies before it will run.  There's a handy lil' script called 'installs.sh' included to help you do that!</p>", "metacritic": null, "released": "2021-02-17", "tba": false, "updated": "2021-02-19T06:41:10", "background_image": "https://media.rawg.io/media/screenshots/94d/94dccff8f7ce047c6d06dfe25ea4679d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 81, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ShazySoft"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}