{"id": 559629, "slug": "el-mandarino-zxspectrum", "name": "El Mandarino ( ZXSpectrum )", "name_original": "El Mandarino ( ZXSpectrum )", "description": "<p>ZxSpectrum 48k </p>\n<p>EL MANDARINO</p>\n<p>Historia: Mandarino ha sido reclutado por la rebelión para embarcarse en una misión suicida del más alto riesgo, localizar y rescatar a un pequeño ser secuestrado por el imperio del malvado Cabeza Lata. El ser se encuentra según nuestras últimas informaciones en una remota base imperial llamada la Naranja Moribunda, la cual está plagada de soldados, droides asesinos y demás basura espacial. Este pequeño ser es de vital importancia para el avance rebelde en su lucha contra el imperio. Rescátalo y huye lo antes posible.<br/>Objetivo del juego: Busca y rescata al pequeño ser. Necesitarás recoger todas las células de energía para activar la pasarela de emergencia y poder huir con vida de la base imperial, ahorra munición, es escasa y te hará falta en la huida…</p>\n\n<p>----------------------------------------------------------------------------------------------------------</p>\n<p>The Mandarino</p>\n<p>Story: Mandarino has been recruited by the rebellion to embark on a suicide mission of the highest risk, locate and rescue a small creature kidnapped by the empire of the evil Head Can. The creature is found according to our latest information in a remote imperial base called the Dying Orange, which is littered with soldiers, assassin droids and other space junk. This little creature is of vital importance to the rebel advance in their fight against the empire. Rescue him and flee as soon as possible.<br/>Purpose of the game: Search and rescue the little creature. You will need to collect all the energy cells to activate the emergency walkway and be able to flee from the imperial base alive, save ammunition, it is scarce and you will need it in the escape ...</p>", "metacritic": null, "released": "2021-02-17", "tba": false, "updated": "2021-02-19T06:46:46", "background_image": "https://media.rawg.io/media/screenshots/034/034ac15d48a5f24945c2b05206131b05.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 118, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mananuk"], "genres": ["Adventure", "Platformer"], "publishers": [], "esrb_rating": null}