{"id": 559760, "slug": "goblins-demo", "name": "Goblins! (Demo)", "name_original": "Goblins! (Demo)", "description": "<p>Goblins! is a two-phased tower-ish defense rogue-lite-ish game.  </p>\n<p>Each level consists of three attack waves with a build phase in between, and then an upgrade phase at the end of each level where you can permanently upgrade your catapult and defenses.</p>\n<p><strong>Build Phase</strong><br/></p>\n<p>Use gold you've accrued from defeating goblins to enhance your defenses (the demo includes mines and walls; the full version of the game will have mage towers, mud, black holes, and more). Strategic placement of buildings will help funnel enemies as well as provide additional defense during gameplay.<br/></p>\n<p><strong>Attack Phase</strong><br/></p>\n<p>Use the catapult to launch boulders at goblins to take them out. Some defensive buildings also have offensive capabilities to help take down the horde. If the goblins get away with your treasure chest, you lose.</p>\n<p><strong>Upgrade Phase</strong><br/></p>\n<p>Apply permanent upgrades to your defenses. Increase your catapult reload speed, blast radius of your mines, etc. </p>\n<p>---</p>\n<p><strong>What does launch look like?</strong><br/></p>\n<p>We're planning on rolling with about 10 different goblin types and 10 unique defenses. Defenses and goblins will counter each other, so there will be a constant balance you'll need to achieve as the game progresses. </p>\n<p>There is no set amount of levels right now, but we're planning on about 20, with an endless build-attack mode for experimentation after the main game is complete. </p>\n<p>Target time to beat the regular game is ~3hrs. </p>\n<p><strong>---</strong></p>\n<p><strong>Feedback</strong><br/></p>\n<p>Feedback is appreciated! If you fill out our survey, you'll also be entered into a draw for a Steam key on release: https://forms.gle/XFxzWVEWwEsgzAYm9</p>", "metacritic": null, "released": "2021-02-17", "tba": false, "updated": "2021-02-19T07:21:44", "background_image": "https://media.rawg.io/media/screenshots/607/6077940671d02f86db23fa2e06ccab96.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 98, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Polygon Dust Entertainment"], "genres": ["Action", "Strategy"], "publishers": [], "esrb_rating": null}