{"id": 559881, "slug": "purrfect-apawcalypse-love-at-furst-bite-itch", "name": "Purrfect Apawcalypse: Love at Furst Bite (itch)", "name_original": "Purrfect Apawcalypse: Love at Furst Bite (itch)", "description": "<p><em>Olive the mutt finds themself trapped in Hachiko High School during the apocalypse! Demons have been slaughtering their classmates and they're certain it's inevitable that they too will meet their untimely end... Which means there's only so many dogs left to spend their last moments with! <br/></em></p>\n<p><em>Join Olive in their grisly search for a special someone! Will it be Brownie the snack-loving corgi, Sparky the sporty husky or Patches the dalmatian bookworm? It's all up to you!<em><br/><br/>~~~<br/></em></em></p>\n<p><strong>This is a remake of Purrfect Apawcalypse, the original first game! All the art has been updated, complete with some new music, new dialogue and more!</strong><br/></p>\n<p><strong>This game contains cartoon gore, bifurcated dogs, headless dogs, generally dogs not having a great time! Play at your own discretion!</strong>\n</p>\n<p><strong>~~~\r\n</strong></p>\n<p>Purrfect Apawcalypse is a dark comedy interactive fiction about dogs, cats and the apocalypse. The places you go, characters you meet and choices you make will lead you either to death or happiness, so choose wisely!</p>\n<p>This game was created by Denny with programming help by Andy, created using Renpy! Follow us on social media to stay updated! Check out the OST on YouTube! Get exclusive behind the scenes content on our Patreon!</p>\n<p>~~~</p>\n<p>This is the first game in the trilogy! Play them in this order!</p>\n<ol><li>Love at Furst Bite</li><li>Purrgatory Furever</li><li>Patches' Infurno\r\n</li></ol>", "metacritic": null, "released": "2021-02-16", "tba": false, "updated": "2021-02-19T07:51:57", "background_image": "https://media.rawg.io/media/screenshots/32f/32fec5c947d31ef814855a58c86e2389.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 122, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["90% Studios"], "genres": [], "publishers": [], "esrb_rating": null}