{"id": 559825, "slug": "escape-itch-pedro-viegas", "name": "Escape (itch) (Pedro Viegas)", "name_original": "Escape (itch) (Pedro Viegas)", "description": "<p>This project aims to solve puzzles and thereby solve the case of Dr.Nuno. What experiences will he have? What happened to Dr.Nuno? Is it possible to solve your case?</p>\n<p>It is a serious first-person game, in Portuguese and that takes place in the Serra de Sintra more specifically at the home of Dr.Nuno, who has several “strange” experiences around your house, with several puzzles so that you can move from your rooms. These puzzles require good logical reasoning, good memory and an observant sense, are you able to solve these puzzles? Do you have what it takes to solve Dr. Nuno's case?\r\n</p>\n<p>During the game you will find notes left by Dr.Nuno, they are included in your diary or made available for reading only, these notes tell the story of the game and also tells how he was and what he was planning. Making sure that at the end of the game you have the complete story of this case.\r\n</p>\n<p>This game has a system that is possible to interact with different objects of the scenario, such as books and items left behind by Dr.Nuno, it is possible to move and see the same from several different angles. An impeccable and well-lit lighting system, background music that keeps you focused on the game and at the same time tense, for not knowing what the next puzzle will be and what are the experiences carried out by Dr.Nuno.\r\n</p>", "metacritic": null, "released": "2021-02-17", "tba": false, "updated": "2021-02-19T07:36:19", "background_image": "https://media.rawg.io/media/screenshots/c8a/c8a9ecc861d979c6e1240dc7028f236e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 173, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Pedro Viegas"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}