{"id": 560045, "slug": "get-out-mcassera", "name": "GET OUT! (Mcassera)", "name_original": "GET OUT! (Mcassera)", "description": "GET OUT!\r\n<p>Congratulations! You have made it to Space Station Tempest. The newly commissioned space station of the Earth Alliance. You’ve unpacked your stuff in your tiny cabin when all of a sudden, alarms start blaring all over the place. You have no idea what is going on, you’ve been on the station all of 20 minutes...<br/></p>\n<p>There is a pounding on your door.</p>\n<p>“Open up, rookie!!!”</p>\n<p>You open the door to find a grizzled old moonwalker with his space suit half on.</p>\n<p>“Come on, rookie, don’t you hear the alarms! We gotta get off this tub! The geniuses on Earth uploaded new beta control software for the station, and it’s screwing up in a huge way! The core cooling systems are offline and the tech heads can’t seem to get things working. The core is going to blow in about 3 minutes! If you don’t get off by then, you’ll be nothing but static!”</p>\n<p>“Those Earthers really mucked things up good! Gravity and life support are also offline, you probably noticed the air starting to feel sticky! Get your suit on and head for the escape pod now! Without gravity, it’s going to be tough navigating the space station. You’ll have to use the recoil from your SLED (SLug &amp; Emp Device) to maneuver around the corridors.”</p>\n<p>“If that’s not bad enough, I’ve heard the defense systems have started firing randomly in the corridors. Those things creep me out. They won’t kill you, but getting hit by one will transport you back to your starting location! I have no idea how that happens, they used some crazy alien technology from Area 51 to make a non-lethal defensive weapons to put hostile boarders back on their ship. You can shoot these guns, but don’t be surprised if they aren’t disabled on the first hit, this ain’t no game! My buddy from engineering told me that shooting the defensive guns will release some energy from the core giving you a little more time to escape. Don’t count on it though, that core is going to overload.”</p>\n<p>He hands you a simple display for your arm band with a lit bar of red, amber, and green lights. </p>\n<p>“This is the core status, and essentially how much time you have left. If you’re not in the escape pod before this runs out, you’re done for!”</p>\n<p>He heads back out into the corridor, “I know you’re new so follow.....</p>\n<p>Just then a bright yellow flash fills your vision and he's gone, hit by one of those crazy alien technology weapons. </p>\n<p>You’re alone. You get your suit on and head out. You don’t know the station so it’s a maze to you. Hopefully you’ll be able to navigate it in time to GET OUT!</p>\n\n<p>This game is has been entered in the The C64 'Cassette 50' Charity Competition.</p>", "metacritic": null, "released": "2021-02-16", "tba": false, "updated": "2021-02-19T08:35:46", "background_image": "https://media.rawg.io/media/screenshots/296/29694a1d8e8fe97b928437fc60789653.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 40, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Mcassera"], "genres": [], "publishers": [], "esrb_rating": null}