{"id": 560043, "slug": "serving-food-game", "name": "Serving Food game", "name_original": "Serving Food game", "description": "Description:\r\n<p>Following exercise2, this mini-game I continued to use the element of fast food. The player controls a bottle of Coke in the game, and then the goal of victory is to serve the burger to the plate. In addition to this, players can also pick up chicken legs to get higher scores. If the burger falls to the bottom, the game is over.<br/></p>\r\nInstruction:\r\n<p>Use WASD or arrow keys to move the bottle of coke. The burger will be pushed away if you hit it. The middle yellow bar is a bouncing bar, you need to use this elasticity to get the burger to a higher platform.</p>\n<br/>Devlog postmortem:\r\n<ul><li>The development process overall:</li></ul>\n<p>Instead of only controlling the main character in the game, the Serving food game reaches victory relying on the hit object, which is the burger. So I spent a lot of time figuring out the relationship between the coke object and the burger object. </p>\n<ul><li>Success:</li></ul>\n<p>I have tried many different things for this project that I never used before, for example, switching the scene, applying sounds, picking up objects, and exploring more on the code end.</p>\n<ul><li>Failures: </li></ul>\n<p>I thought that I can do a better job on the styling of the game, I'm not really satisfied with the visual outcome and animations. But actually, I did like the bitmap feeling, I wish I can do a better job next time.</p>\n<ul><li>Lessons learned:</li></ul>\n<p>-Arrange all the assets better into different folders so it's easier to select the right one.</p>\n<p>-Remember to override the prefabs each time.</p>\n<p>-Be careful about all the tags and layers.</p>\n<p>-Try to make the canvas 16:10 in unity since the screen is cut off a little bit on my mac right now with 16:9.</p>\n<ul><li>Future Development</li></ul>\n<p>Right now I only have one level for my game, I hope I can come up with more levels for this game, and for each level after, the difficulty should be increased.</p>", "metacritic": null, "released": "2021-02-16", "tba": false, "updated": "2021-02-19T08:35:02", "background_image": "https://media.rawg.io/media/screenshots/ebe/ebeb2d6138a4a9dc28834b33ab9d2940.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 6, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Minghui Ju"], "genres": [], "publishers": [], "esrb_rating": null}