{"id": 56004, "slug": "cel-damage", "name": "Cel Damage", "name_original": "Cel Damage", "description": "<p>Cel Damage is a vehicular combat video game for the Xbox and GameCube, developed by Pseudo Interactive and published by Electronic Arts. The game was first released for Xbox on November 14, 2001, and for GameCube on January 7, 2002, in North America respectively. In Europe, the game launched for both consoles on May 3, 2002. A PlayStation 2 port, entitled Cel Damage Overdrive, was released by Play It! on December 12, 2002 in Europe only. A high-definition remake, developed and published by Finish Line Games, and titled Cel Damage HD, was released for PlayStation 3, PlayStation 4 and PlayStation Vita on April 22, 2014 in North America and May 14, 2014 in the PAL region. An Xbox One port followed worldwide, via the Xbox Games Store, on March 11, 2016.<br />\nCel Damage is a cartoony take on vehicular combat games, like those from the Twisted Metal series. The story focuses on six cartoon characters from a fictional cartoon show called &quot;Cel Damage&quot;. The characters annihilate each other to the delight of TV audiences and, since they are cartoons, instantly regenerate. The player battles through thirteen different levels and three game modes. Weaponry for Cel Damage includes cartoon staples like vacuum nozzles and portable holes, mundane weaponry like chainsaws and baseball bats, and items like freeze rays, giant springs, and portable nuclear devices.</p>", "metacritic": 60, "released": "2001-11-14", "tba": false, "updated": "2023-08-10T01:17:33", "background_image": "https://media.rawg.io/media/games/27e/27ec6523a7784607ddcd081e449f5d2d.jpg", "website": "", "rating": 0.0, "rating_top": 5, "added_by_status": {"yet": 2, "owned": 6, "beaten": 4, "toplay": 6, "dropped": 4}, "playtime": 0, "achievements_count": 0, "ratings_count": 5, "suggestions_count": 265, "game_series_count": 0, "reviews_count": 5, "platforms": ["GameCube", "Xbox", "PlayStation 2"], "developers": ["Pseudo Interactive"], "genres": ["Simulation", "Racing", "Fighting"], "publishers": ["Electronic Arts", "Play It!"], "esrb_rating": "Teen"}