{"id": 560080, "slug": "ppizza", "name": "P..Pizza!", "name_original": "P..Pizza!", "description": "<p>Help this uncooked pizza find its missing slices. Don’t be confused\r\nby other food in the kitchen, and find the way to the pizza cooker after\r\nfinding the missing slices! There are 2 levels in this game. Press<strong>  </strong><strong>↑  ↓  ←  → </strong> to play.</p>\n\n<p>Devlog postmortem:</p>\n<p>By starting to\r\ncreate this game, I drew sketches of my scenes and sprites on papers. I first\r\nplanned out my design process based on my sketches. My first step is to build\r\nand code a game outline with simple geometries, buttons, and scene transitions.\r\nThen, I drew my sprites and game elements in Photoshop and export them as PNG.\r\nLastly, I replaced all the geometries with these PNGs, and I also adjusted my\r\nUI text, fonts, and etc.</p>\n<p>Overall, I think\r\nthings went well with my sprites and animations. I enjoyed playing with my\r\npizza animation. However, I was struggling with coding different rules for\r\ndifferent scenes(I want the player to collect different numbers of keys to\r\nwin). At first, I coded for two game scenes on the same script, and things were\r\nmessing up, so later I chose to script each scene on different scripts, and it\r\nworks. I wishes that I can find simple solution in the future.</p>\n<p>After this\r\nassignment, I learned to find alternatives when encountering errors and to just\r\ntry different ways, and I will eventually get through. I also finally learned\r\nto set the right and consistent canvas size before build and after build. That\r\nwas a struggle for me to adjust the size too. In the future, I wish I could\r\nimprove this game to have more levels with more refined game elements. I want\r\nto create more smooth scene transition, and may be more specific customized\r\nsettings in the future. I also want to create background sound too.</p>", "metacritic": null, "released": "2021-02-16", "tba": false, "updated": "2021-02-19T08:43:43", "background_image": "https://media.rawg.io/media/screenshots/208/208907928e1ff0714465d3b7b710671b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 9, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Web"], "developers": ["CrystalTan"], "genres": [], "publishers": [], "esrb_rating": null}