{"id": 560175, "slug": "dungeon-zer0", "name": "Dungeon Zer0", "name_original": "Dungeon Zer0", "description": "<p><strong>Dungeon ZER0 is an epic dungeon game, based on the legendary The\r\nLegend Of Zelda games made by Nintendo. </strong><br/></p>\n<p>In this game you embody\r\nPeter, a medium that has been all his life searching for the\r\nmagatama, a mystic amulet that will provide him with the cherished\r\nendless life. In his journey, he will get into a scary dungeon full\r\nof monsters, mysteries, dangers and puzzles. Fight strong goblins,\r\ndodge sharp starsaws and survive for the sake of finding eternity.</p>\n<p>In\r\norder to defend himself of the dangers of the dungeon, Peter will use\r\nhis sword and his skill in order to defeat the mighty goblins. He\r\nalso needs to use the Yearts to recover the lost health or the\r\ndungeon keys for opening doors. And make sure you don’t step on the\r\nspikes at the floor… cause it will hurt so much!</p>\n<p>We\r\nhave been working really hard for making the game as good and amazing\r\nas possible. We did lots of drawings and animations that were never\r\nused in the end, and made a lot of research for programming things\r\nthat didn’t even taught us in class. Everything we did was on\r\npurpose for making the best game we could. We hope you enjoy our epic\r\nadventure!</p>\n<p>This game was made as our first game and it was completed in two weeks by us, IER Studios, a small videogames studio set in Valencia, Spain.</p>\n<p><strong>Credits:</strong></p>\n<p>Javier Mollá (@aojavmo_dev): Art and Game Design<br/>Adrián Aguilar (@adrianaguilarat): Animations and Programming</p>", "metacritic": null, "released": "2021-02-15", "tba": false, "updated": "2021-02-19T09:10:05", "background_image": "https://media.rawg.io/media/screenshots/01a/01ab1fd3857e6bcf4888f09a9401bac5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 18, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["IER Studios"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}