{"id": 560128, "slug": "fungal-freedom-fighter", "name": "Fungal Freedom Fighter", "name_original": "Fungal Freedom Fighter", "description": "<p>Description:<br/></p>\n<p>This project is a 2d action rogue-like about being a mushroom and killing robots as part of a live television broadcast death gauntlet.</p>\n<ul><li>Smash robo spiders with your trusty hammer!</li><li>Get to know your fellow mushrooms and robots by talking with them!</li><li>Show off for the viewers as the broadcast audience rates each one of your runs at the end!</li><li>Pretend you're William Wallace! It's not a feature, but you could if you like.</li><li>Laugh (or, optionally, awkwardly cringe) at my style of comedy writing.</li></ul>\n\n<p>Bachelor Thesis - Abstract:</p>\n<p>This thesis examines the specific narrative needs of the rogue-like as a genre, with respect to its unique mechanics, and how it conveys narrative both explicitly and implicitly. After establishing a differential diagnosis to the applicability of prevalent narrative structures, the ludic episodic narrative structure is proposed as the solution to marrying rogue-like gameplay with rogue-like story-telling. An exploration of its benefits and drawbacks through a selection of rogue-likes assays its feasibility, guided by a set of criteria.</p>\n\n\n<p>Credits:</p>\n<p>Art, Code, Design, Narrative - Naomi Seeling<br/>1st Advisor - Prof. Florian Berger<br/>2nd Advisor - David Niclas Karlsson<br/>Menu Background &amp; Emotional Support - Carla Rother<br/>Bestest Playtester - Anna Köhler<br/>Typography - https://www.fontspace.com/minecraft-font-f28180<br/>Audio - zapsplat.com<br/></p>\n<p>This game was created as part of a bachelor's thesis in Game Design at the University of Europe for Applied Sciences. To those with access to the UE's bitbucket repositories, please find my git journey chronicled at https://bitbucket.org/btkgamedesign/2020_ba_seeling_naomi/src/master/.<br/></p>\n\n<p>The Answers to your Questions:</p>\n<p>\"The game window is, like, so small! How can I make it bigger?\"<br/>If you are on a standard windows based OS, simply press Alt + Enter to force an application to toggle into a full screen mode. This degrades texture quality however.<br/></p>\n<p>\"I can't find the way to the next scene transition, it seems blocked off.\"<br/>It seems that level generation took a day off. Unfortunately, you will have to restart by going -&gt; Pause Menu -&gt; Main Menu -&gt; Start.</p>\n<p>\"I went through a room transition and now my camera is not on my player.\"<br/>At certain framerates a room transition will sometimes trigger twice, if it's a wednesday. Again, the only real option is going -&gt; Pause Menu -&gt; Main Menu -&gt; Start.</p>", "metacritic": null, "released": "2021-02-15", "tba": false, "updated": "2021-02-19T08:56:56", "background_image": "https://media.rawg.io/media/screenshots/7b2/7b29ee6b27e3a23dfabb6f6c9ebb260b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 132, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["naomi seeling"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}