{"id": 560337, "slug": "the-white-thief", "name": "The White Thief", "name_original": "The White Thief", "description": "<p><strong>THE WHITE THIEF</strong><br/>(Oynanış öncesi gerekli bilgilendirme)</p>\n<p><strong>Bu oyun Atom Game Jam #2 için 72 saatte yapılmıştır.</strong></p>\n\n<p><strong>--------HİKAYE--------</strong></p>\n<p>----------------------------------------------------------------</p>\n<p>Arsen Lupen, herzaman yaptığı gibi zekası ve kurnazlığını kullanarak bir tren soygunu yapmaya karar verir. Bunun üzerine uzun zamandır peşinde olduğu ve bu trende olacağından emin olduğu Faberge Yumurtası'nın peşine düşer. Bu sırada Faberge Yumurtası'nı bulana kadar yolda diğer insanları da soymaya devam eder. Bu 9 Milyon değerindeki eşyayı tam bulduğu sırada kendi yazarıyla karşılaşır ve onun karşısında çaresiz olduğunu , çünkü onu yazan ve geleceğini belirleyen kişiyi hiçbir zaman alt edemeyeceğini fark eder. Daha sonra beklenmedik bir şekilde yazarının varlığını yok eden Arsen, soygunu yeniden yapmaya başlar ve Faberge Yumurtası'na ulaşır. Ama Faberge Yumurtası'nı aldıktan hemen sonra bir daha ilerleyemez ve tam olduğu yer ile geçmişi arasındaki zaman diliminde sıkışır. Bunun sebebi ise artık yazarının olmaması ve geleceğini yazacak kimsenin kalmamasıdır. Tam bu anda karşısında tanımadığı birisi belirir. Ona nasıl bir hata yaptığını anlatmaya başlayan bu kişi, daha önceden baktığımız ama hiç görmediğimiz birisidir ... ! </p>\n<p>----------------------------------------------------------------</p>\n<p><strong>Daha fazlası için oyunu oynamayı ve takipte kalmayı unutmayın!</strong></p>\n\n<p>\"The White Thief\" oyunu 2 farklı evrene sahip, ve oynanış boyunca 2 farklı evrene de<br/>ulaşabileceksiniz.<br/>Hikaye ve kurgulama Maurice Leblanc'ın kaleme aldığı Arsen Lüpen karakterini ele almıştır.<br/>Hikayelerde gerçekliklere yer verilmiş, kitapta ve filimlerden alıntılar yapılmakta olup, ara sahneler<br/>tamamen CSTF tarafından düzenlenmiştir.<br/>Her vagon sonrası geçen ara sahne sinematikleri gerçek benzetmeler ve sözlere dayalı olayları esas<br/>almıştır.<br/>Olay döngüleri karakterin topladığı eşyalarla hiçbir şekilde çelişmemekte olup tamamen mantık<br/>üzerine ilerlemektedir.</p>\n<p><strong>--OYNANIŞ--</strong></p>\n<p>Hareket = \"A\" - \"D\" veya \" Yön Tuşları\"<br/>NPC ile etkileşim = \"E\"</p>\n<p><em><strong>**HİLE**</strong></em></p>\n<p>Ana menüdeki \"OPTIONS\" bölümünde ses açma sliderların hiçbir işlevi yoktur.<br/>Sliderları \"0\" noktasına çektiğinizde karşınıza Joker kartı çıkacaktır.<br/>Joker kartı yeni evrenin PLAY tuşudur.<br/>HİLELİ EVRENDE OYUNU KAYBETMENİZE NEDEN OLACAK MAURICE LEBLANC OLMAYACAGI<br/>ICIN OYUNU KAZANACAKSINIZ!<br/>FAKAT DAHA FAZLASINI BİLMEK İSTİYORSANIZ OYUNA DEVAM EDİN!<br/>İYİ OYUNLAR...</p>\n<p>---___CST-Featuring___---</p>\n\n<p>-<strong>---------ASSET'LER-----------</strong></p>\n<p>TEXTMESHPRO Dışında başka asset kullanılmadı.<br/>Oyun sinematiklerinde kullanılan efektler After Effects'de düzenlenmiştir.<br/>Oyun siyah beyaz temalı olup Aseprite'da tasarlama yapılmıştır.</p>\n<p><strong>-----------İş Dağılımları---------</strong></p>\n<p>Kodlama , Game Developer, Level Design : Mustafa Gündüz</p>\n<p>Tasarım, Kurgu : Berkay Büyükdere,</p>\n<p>2D Pixel Art, SFX : Yunus Kopuz</p>\n\r\n//// (V 2.2 -- 15.02.2021 -- 17:43) ////\r\n//// (V 2.3 -- 15.02.2021 -- 18:14) ////", "metacritic": null, "released": "2021-02-15", "tba": false, "updated": "2021-02-19T09:52:07", "background_image": "https://media.rawg.io/media/screenshots/ac0/ac0d1602e616fdce06a8a4b3053e3d8d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 73, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["CST-Featuring"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}