{"id": 5604, "slug": "legendary", "name": "Legendary", "name_original": "Legendary", "description": "<p>The ancient myth of Pandora&#39;s box serves as the starting point of this game. Archaeologists find an artifact, a mysterious box, in ruins on the ocean floor, in the early 21st century. They can not determine what it is and put a find in one of the museums in New York, where it is well guarded.</p>\n<p>However, there is a person in the world who knows exactly what it is. This is the millionaire Ormond LeFey. LeFey hires an experienced thief Charles Deckard. Deckard must enter the museum, open this artifact and take its contents.</p>\n<h3>Pawn in someone else&#39;s game</h3>\n<p>Deckard easily bypasses the security system of the museum and opens the box. When he does this, Signet appears on his left hand, and a powerful cloud of energy rips out of the box into the sky.</p>\n<p>Deckard leaves the museum and sees that there are creatures running around the streets, which were known only from myths. The sky is also full of these creatures, and all of them, both in heaven and on earth, attack people, tear them apart, turn over cars and destroy buildings.</p>\n<h3>From Pawn to Queen</h3>\n<p>Deckard is the only person capable of removing monsters from our world. Deckard has to fight monsters with conventional weapons, but Signet on his arm absorbs the energy of dead monsters, this energy is able to heal Deckard and give him the power to &quot;kinetic strike&quot;. Some useful things also do not work unless you apply this energy to them.<br />\nDeckard has a notebook containing information about his tasks, monsters and weapons.<br />\nDuring the game, Deckard has to go to London, then again return to New York, to penetrate the headquarters of LaFay, to cope with many other missions.</p>\n<h3>Allies and multiplayer</h3>\n<p>Deckard is assisted by members of the paramilitary organization &quot;Council of 98&quot;, this organization also knows about the artifact. The millionaire LeFay, who hired Deckard to open the artifact, is also not the loner, but the head of another organization, the Black Order, which seeks to master the forces of the artifact to conquer the world.<br />\nWhen playing in multiplayer mode, up to eight people can participate in the game, and the Council of 98 and the Black Order are very relevant there.</p>", "metacritic": 50, "released": "2008-10-31", "tba": false, "updated": "2023-12-18T18:04:05", "background_image": "https://media.rawg.io/media/games/8b5/8b5517322bb1ab56b127c52d77b44cec.jpg", "website": "http://www.legendarythegame.com/", "rating": 2.76, "rating_top": 3, "added_by_status": {"yet": 48, "owned": 1058, "beaten": 79, "toplay": 16, "dropped": 51, "playing": 4}, "playtime": 1, "achievements_count": 50, "ratings_count": 122, "suggestions_count": 559, "game_series_count": 0, "reviews_count": 122, "platforms": ["PlayStation 3", "PC", "Xbox 360"], "developers": ["Spark Unlimited", "Gamecock Media Group"], "genres": ["Action", "Shooter"], "publishers": ["SouthPeak Games", "Gamecock Media Group"], "esrb_rating": "Mature"}