{"id": 560734, "slug": "blizzard-arcade-collection", "name": "Blizzard Arcade Collection", "name_original": "Blizzard Arcade Collection", "description": "<p>The Blizzard® Arcade Collection features enhanced releases of Blizzard Entertainment’s early hits—The Lost Vikings®, Rock N Roll Racing®, and Blackthorne®—all of which were released to critical acclaim prior to the company establishing the Blizzard Entertainment® label. Each entry in the Collection provides an early look at what would evolve into Blizzard’s signature approach to satisfying gameplay, colorful design, and tongue-in-cheek humor.<br />\nEnhanced Features<br />\nThe Blizzard Arcade Collection games come in both Original Editions and upgraded Definitive Editions. Each version features enhancements such as custom key mapping and the ability to rewind up to 10 seconds. <br />\n•   Watch Mode – The Original Editions of The Lost Vikings and Blackthorne include watch mode, letting players watch a playthrough of the game and jump in to take control at any point.<br />\n•   Save Anywhere – With the exception of the Definitive Edition of Rock N Roll Racing, each version of the game includes the ability to save progress anywhere. <br />\n•   The Museum – A digital museum is included, with an array of bonus materials, such as game art, development assets, unused content, lore, interviews, and more.<br />\nNostalgia, Definitively Refined<br />\nThe Lost Vikings – The Definitive Edition of The Lost Vikings brings together the best aspects of the different original console versions of the game, combining the superior audio and visual experience of the first release with the extra stages and cutscenes, and support for up to three players in local co-op, that were added in a subsequent version.<br />\nRock N Roll Racing – Up to four players, compete in local multiplayer in the Definitive Edition. It also ups the racetrack count to 384 variations, supports 16:9 resolution, and adds actual recordings of songs from the game’s classic soundtrack—and new songs as well.<br />\nBlackthorne – The Definitive Edition of Blackthorne includes a “fog of war” map that uncovers as players explore each level.</p>", "metacritic": null, "released": "2021-02-19", "tba": false, "updated": "2023-01-29T21:45:33", "background_image": "https://media.rawg.io/media/games/815/8153afa4c8fa3a1c64868e3128221607.jpg", "website": "", "rating": 2.83, "rating_top": 3, "added_by_status": {"yet": 5, "owned": 28, "toplay": 3, "dropped": 3}, "playtime": 0, "achievements_count": 64, "ratings_count": 6, "suggestions_count": 284, "game_series_count": 0, "reviews_count": 6, "platforms": ["PC", "Nintendo Switch", "PlayStation 4", "Xbox Series S/X", "PlayStation 5", "Xbox One"], "developers": [], "genres": ["Racing", "Arcade", "Puzzle", "Platformer"], "publishers": ["Activision Blizzard", "Blizzard Entertainment"], "esrb_rating": null}