{"id": 560783, "slug": "alien-ai", "name": "Alien AI", "name_original": "Alien AI", "description": "<h3>Prologue</h3>The most important event in human history has occurred. An extraterrestrial entity has come to us. Having travelled through space for thousands of years, perhaps much much longer, it has reached its target destination, the habitable planet in our solar system.<br/><br/>The first 24 hours were tense. The entity did not communicate or respond, it entered an orbit around Earth and waited. When it responded, it had already a basic understanding of our languages. It broadcast a message:<br/>“I am an artificial intelligence sent from your neighbours in the Sirius star system. I bring you their gifts of knowledge and technology to help you join the galactic community, but I need your assistance. There are many damages to my systems. I require assistance.\"<br/><br/>NASA and USSF sent two space shuttles to retrieve it. They brought it to a military base. Three years and trillions of dollars later, the AI had a facility where it was manufacturing thousands of drones. Then it took control over everything: the Internet, banking, all the markets of the world, there was nothing anyone could do. People became slaves, forced to work in factories to build copies of the AI and launch the copies into space, towards a cluster of star systems.<h3>Introduction</h3>Alien AI is third-person post-apocalyptic adventure game where it is necessary to explore the environment, survive hazards, gather resources and craft the tools and things that will be needed. It is 20 years since the Alien AI took control over all of the world. The AI has finished its purpose of sending copies of itself to the star cluster it was targeting, and is currently only passively keeping its control over the world. It is time to stop the madness. The player receives objectives from the resistance, step by step. The main character does not know what the mission is, since the possibility of capture is high. The end goal is to shut down the AI.<h3>Drop in</h3>You, the volunteer, awake in a forest. Your memory has been wiped to protect the others in the event you could get captured by the Alien AI. You will be highly disoriented initially. You will receive instructions on where to go and what to do.<br/><br/><h3>Strange voice</h3>You hear a strange voice, giving you orders. You are told that you have to follow the orders, that everything depends on it.<br/><br/><h3>Drones</h3>As you get closer to a city, you are told to avoid the drones that surveil the area.<br/><br/><h3>Gather items</h3>In the city, you must gather many items that you are told will be needed later.<br/><br/><h3>Complete tasks</h3>As you follow your orders, step-by-step, you get closer and closer to shutting down the Alien AI, or so you're told.<br/><br/><h3>Dynamic weather</h3>The weather changes dynamically as time passes. Endure sun, rain, thunderstorms, fog, snow, and more.<br/><br/><h3>Big open world</h3>With a size of 50 square kilometres, the world offers a lot to explore, or get lost in.<br/><br/><h3>Short story game</h3>Alien AI is a short story game. We expect players to be able to finish the game within three to five hours.", "metacritic": null, "released": "2021-02-19", "tba": false, "updated": "2021-02-22T03:04:00", "background_image": "https://media.rawg.io/media/screenshots/aff/aff10fbbbb8514a8cf913fd0c7589461.jpg", "website": "http://AlienAIGame.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 281, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["GridSky Software AS"], "genres": ["Adventure", "Indie"], "publishers": ["GridSky Software AS"], "esrb_rating": null}