{"id": 560745, "slug": "avalom-ancestral-heroes-2", "name": "Avalom: Ancestral Heroes", "name_original": "Avalom: Ancestral Heroes", "description": "Developed by a single person and based on an RPG book written by him! Set in a huge open world, Avalom: Ancient Heroes presents a rewarding action combat experience. Players embark on an epic adventure in a rich and alive world with their AI companions. In a world where mortals and gods coexist and live on the same plane of existence! Interpret and be whatever you want in this endless journey where anything can happen! Remember you are free and can live however you want without any linear story to follow, you are the one who tells your own story!<br/><br/><br/><br/> *<strong>Fascinating narrative driven by your choices - You don't just decide to live freely in the world of Avalom, you make important decisions that change the future. Each choice has its weight, and its actions can lead to several results. Avalom is a highly personalized journey where a false move can lead to a series of events that alter even physical aspects of the world, making you and your allies truly unique.</strong><br/><br/> *<strong>An Immense World to be Discovered - The world of Avalom has never been so large and so detailed. It is completely open and ready to be explored. Discover the enemy that is ready to act. Reveal hidden caves full of lurking creatures. Avalom is vast and dangerous, but unraveling its secrets can mean the difference between victory and defeat.</strong><br/><br/>* <strong>Intense and strategic combat - There is no wrong way to play Avalom: Ancestral Heroes, except in which you die. Fortunately, you can build characters with a giant skill tree to build unique characters on.</strong>", "metacritic": null, "released": "2021-02-21", "tba": false, "updated": "2021-02-22T02:30:31", "background_image": "https://media.rawg.io/media/screenshots/0b1/0b1954d02d305ee7643fa4a9acb0d9b9.jpg", "website": "http://rpgavalom.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 5, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 278, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["WAGNER ROCHA"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Indie"], "esrb_rating": null}