{"id": 560753, "slug": "earth-elements", "name": "Earth Elements", "name_original": "Earth Elements", "description": "<h3>Earth Elements</h3>You play with group of game characters pObjects. Yours first objective is to modify map in that way so pObject scattered initially on map can work together. They will do tasks: first and most important dig tile called pElements. Every tile on map with some effort could be accessible to digging. Next after that they can mix pElements in MIXERS, BUILD improvements on map for reason to easier access more tiles, use MACHINES which will speed up process of digging. Really fun to watch like those MACHINES are working. pObjects are very busy doing all those tasks, therefore their STAMINA is getting lower. Of course there is solution for that. You need to give them possibility to use RECHARGER, and finally they need to protect that recharger from enemy taking energy for free. To use better game BUILDS, and more efficient MACHINES Yours pObject need to advance in EPOCHs, kind of like Mankind going from stone age to bronze metal, industry age, as a bonus every BUILD group has MONUMENTAL builds, like: Great Kohakia Mounds, Stone Age, Machu Picchu, and of course Great Pyramid. After building MONUMENTAL BUILDS new pObject is added to game as a bonus. All that work of Yours pObject has one main goal: to reach portal or collect specific amount of one tile. That will grant you a title of WINNER of this game. You decide during map generation which winning condition will be in current game. Map Is randomly generated, giving you possibility to enjoy game for long time. Playing session can vary depending on map size from 30 min to a few hours.", "metacritic": null, "released": "2021-02-18", "tba": false, "updated": "2021-02-22T02:36:09", "background_image": "https://media.rawg.io/media/screenshots/111/11113182c58731f1be120d7202bed41c.jpg", "website": "https://www.youtube.com/channel/UCvwBW5Xe-FHExAOfYETylIQ", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 129, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jack G"], "genres": ["Strategy"], "publishers": ["Jack G"], "esrb_rating": null}