{"id": 56099, "slug": "mario-golf-toadstool-tour", "name": "Mario Golf: Toadstool Tour", "name_original": "Mario Golf: Toadstool Tour", "description": "<p>Mario Golf: Toadstool Tour, known in Japan as Mario Golf: Family Tour (マリオゴルフ ファミリーツアー, Mario Gorufu Famirī Tsuā), is a 2003 sports game developed by Camelot Software Planning and published by Nintendo for the Nintendo GameCube. It is the sequel to the 1999 Nintendo 64 title Mario Golf, and is the second game in the Mario Golf series. It was released in North America on July 28, 2003, in Japan on September 5, 2003, and in the PAL region on June 18, 2004.<br />\nToadstool Tour is a golf game featuring characters and elements from the Mario series. There are 16 playable characters in total, each with a set of golfing statistics defining their style of play. The game&#39;s main mode involves the player competing in tournaments to obtain new features, although there are alternative modes consisting of training session and variations to the golf format. This includes &quot;Ring Attack&quot;, requiring the player to hit the ball through rings of varying sizes while remaining on or under par. Players can transfer characters between Mario Golf: Toadstool Tour and Mario Golf: Advance Tour using the Nintendo GameCube Game Boy Advance Cable.<br />\nToadstool Tour was met with positive reception. In general, reviewers praised the game&#39;s visuals, sound, and variety of courses, although a perceived lack of advancement from its predecessor was criticised. The game became part of the Player&#39;s Choice label in 2004.</p>", "metacritic": 81, "released": "2003-07-28", "tba": false, "updated": "2023-04-28T15:21:39", "background_image": "https://media.rawg.io/media/screenshots/117/117c06f744ca4d9b6076030eb9d0ea52.jpg", "website": "", "rating": 4.09, "rating_top": 5, "added_by_status": {"yet": 4, "owned": 18, "beaten": 10, "toplay": 8, "dropped": 9, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 11, "suggestions_count": 236, "game_series_count": 7, "reviews_count": 11, "platforms": ["GameCube"], "developers": ["Camelot Software Planning"], "genres": ["Sports"], "publishers": ["Nintendo"], "esrb_rating": "Everyone"}