{"id": 56092, "slug": "the-legend-of-zelda-the-wind-waker", "name": "The Legend of Zelda: The Wind Waker", "name_original": "The Legend of Zelda: The Wind Waker", "description": "<p>The Legend of Zelda: The Wind Waker is an action-adventure game developed and published by Nintendo for the GameCube home video game console. The tenth installment in The Legend of Zelda series, it was released in Japan in December 2002, in North America in March 2003, and in Europe in May 2003.<br />\nThe game is set on a group of islands in a vast sea, a departure for the series. The player controls series protagonist Link as he attempts to save his sister from the sorcerer Ganon and becomes embroiled in a struggle for the Triforce, a sacred relic that grants its holder&#39;s wishes. Aided by allies including pirate captain Tetra – an incarnation of Princess Zelda – and a talking boat named the King of Red Lions, Link sails the ocean, explores islands, and traverses dungeons to acquire the power necessary to defeat Ganon. Wind, which facilitates sailing, plays a prominent role, and can be controlled with a magic conductor&#39;s baton called the Wind Waker.<br />\nThe Wind Waker was directed by Eiji Aonuma and produced by Shigeru Miyamoto and Takashi Tezuka. It retains the basic 3D gameplay of its predecessors, Ocarina of Time and Majora&#39;s Mask, but with a distinctive cartoon-like art style created through cel shading. The game received widespread critical acclaim, but the art style proved divisive among players, which contributed to comparatively weak sales. As a result, Nintendo changed directions with the next Zelda installment, the more realistically-styled Twilight Princess. However, The Wind Waker&#39;s reputation improved over time, and it is now widely considered one of the greatest video games ever made. The Wind Waker originated the &quot;Toon Link&quot; variant of the main character, and received two direct sequels for the Nintendo DS, Phantom Hourglass (2007) and Spirit Tracks (2009). A high-definition remaster, The Legend of Zelda: The Wind Waker HD, was released for the Wii U in 2013, to critical acclaim.</p>", "metacritic": null, "released": "2002-12-13", "tba": false, "updated": "2024-04-13T16:06:36", "background_image": "https://media.rawg.io/media/games/45f/45f6d31b0fcefe029e33d258a7beb6a2.jpg", "website": "", "rating": 4.35, "rating_top": 5, "added_by_status": {"yet": 68, "owned": 248, "beaten": 401, "toplay": 140, "dropped": 87, "playing": 20}, "playtime": 37, "achievements_count": 0, "ratings_count": 457, "suggestions_count": 281, "game_series_count": 26, "reviews_count": 460, "platforms": ["GameCube"], "developers": ["Nintendo"], "genres": ["Action"], "publishers": ["Nintendo"], "esrb_rating": "Everyone"}