{"id": 560918, "slug": "univeria", "name": "Univeria", "name_original": "Univeria", "description": "<p><strong>The </strong><strong>Brackeys Game Jam 2021.1 Submission has a build error, here is the fixed version   <br/>❌ Still has some gamebreaking bugs, but I need to sleep... Please come back tomorrow ! ❌</strong></p>\n<p>Submission page : https://lacrearthur.itch.io/univeria-bgj</p>\r\n\r\nUniveria Fixed\r\n🌠Build your universe 🌠\r\n\r\n📜 Description\r\n<p>I made sure to keep the scope small this time so I made a game where you can build the whole univers. Well... Starting very small. Like smaller than atoms small.</p>\r\n\r\n🕹 Controls\r\n<p>⌨️/🖱 : WASD to move, mouse to look, right click to aim, left click to emit/split, space to change body\r\n🎮 : Left stick to move, right stick to look, left trigger to aim, right trigger to emit/split, A to change body</p>\r\n\r\n💡 Idea\r\n<p>Inspired by Minecraft and Cosmology this game is all about discovering the origin and evolution of the universe and its matter. Based on real datas, you might need to dig up some real Wikipedia articles to find the \"crafting recipes\"</p>\r\n\r\n⏱ Limitations\r\n<p>The time constraint forced me to focus on the sub-atomic scale only, but I had an initial idea of more scales while the player advance in more complex elements (atoms, molecules, solids, planets, galaxies). If the futur allows me the time to work on updates, I would gladly add them progressively :)</p>\r\n\r\n🛠 Credits\r\n<p>Developed with Unity &amp; C# by myself. Thanks for the help of some content from InfaillibleCode, CatLikeCoding, Brackeys, Christine Nattrass, Etienne Klein talks, Wikipedia.</p>", "metacritic": null, "released": "2021-02-21", "tba": false, "updated": "2021-02-22T03:54:33", "background_image": "https://media.rawg.io/media/screenshots/e89/e8900a40822959d9846a6e9af1b14452.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 18, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["LaCrearthur"], "genres": [], "publishers": [], "esrb_rating": null}