{"id": 561008, "slug": "heart-to-beat", "name": "Heart To Beat", "name_original": "Heart To Beat", "description": "<p>Heart to Beat!<br/><br/>In our day to day functioning we take much of our bodily functions for granted. A beating heart, breathing on auto-pilot, the liver or kidneys cleansing the blood. You're already aware of what it's like to breathe manually (you're likely doing it right now 😉), but what of the other functions?<br/><br/>This game requires rhythm, multi-tasking and  a high degree if independent control, making good high scores really <em>heart</em> to beat.<br/><br/>The game features tutorial on startup, but here is a list of controls / precise rules:<br/> - [s] heart beat: try to time this when the heart hovers over the red area to get 100 points. Pressing it too early will give no points, not pressing it in time will lose you a life. Game over if three lives are lost.<br/></p>\n<p> - [d] breathe in: fill the lungs with fresh oxygen-rich air, oxygen depletes at 0.25 unit/sec and restores at 0.75 unit/sec, full fresh lungs have a capacity of 2.5 units. No oxygen in the lungs means game over.<br/></p>\n<p> - [f] breathe out: exhale oxygen-poor air (required to breathe in again)</p>\n<p>- [7, 8, 9]:  Removes the first matching number from the bottom of the screen, except it has already reached the left side and turned green. Your game is over if you press a number that is not present 50 times total. You fail if more than 20 numbers have reached the left side.<br/></p>\n<p>My entry for Godot Wild Jam #30: Heartbeat. Unfortunately I only had little over a day to make this, all assets made by me except for the default godot font (unknown) and Trueno font (KineticPlasma).<br/></p>", "metacritic": null, "released": "2021-02-21", "tba": false, "updated": "2021-02-22T04:19:31", "background_image": "https://media.rawg.io/media/screenshots/e53/e5344b957f082cc8da31d7e6a65c16f3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 10, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["PhindieGames"], "genres": [], "publishers": [], "esrb_rating": null}