{"id": 561119, "slug": "nomad-movement-demo", "name": "Nomad Movement Demo", "name_original": "Nomad Movement Demo", "description": "<p>The Nomad Movement Demo is a testing zone for platforming controls in VR.  Run, jump, and dash through a maze of areas randomly sequenced together. There's no real game here at the moment, no goal, not even a final chamber to seek out, just a small area to run around through in order to prove out player movement.</p>\n<p>This is a prototype of the movement system for Project AdVRnture (temp name), a VR adventure-platformer currently in development by Hypernoodle Games. Check the Hypernoodle Games website for more about the project or Jon Ludwig's Twitter for development updates.</p>\n<p>This demo is going to be full of jank and bugs, so please make sure you understand this when downloading, and then tell me about what bugs you find in the discussions page when you find some! On that note, this demo will be continuously updated as development continues, and as I respond to feedback from users who try the demo. So please do give feedback in the discussions page! Does it cause any motion sickness? is teleporting comfortable if you use that movement mode?  Please let me know, or add to a topic in the Discussions page if someone else has mentioned the same thing. </p>\n\r\n4 movement styles supported\r\n<ul><li><strong>Teleport </strong>- best for those sensitive to movement in VR.  Tilt your controller joystick forward to aim your teleporter, and release the stick to teleport.  </li><li><strong>Armswing</strong> - RECOMMENDED - moving your arms helps reduce discomfort and is just fun to do, so touch your controller joysticks (one for half speed or both for full speed) and move your hands in front of you as if you were walking to move forward.  You can also swing your hands behind you to move backward</li><li><strong>Joystick, Look Forward</strong> - Tilt the left controller joystick forward to move in the direction you are <strong>looking</strong>, you can also strafe and move backwards.</li><li><strong>Joystick, Hand Pointing Forward</strong> - Tilt the left controller joystick foward to move in the direction your <strong>left hand is pointing</strong>, you can also strafe and move backwards.</li></ul>\n<p><strong>Rotation</strong> is possible in all movement modes by tilting the joystick of the right controller left or right, which will Snap-turn you in that direction.</p>\n<p><strong>Jumping</strong> can be done by holding down the jump button, shown in the in-game prompts or via the steam input binding menu, throwing your hand down, and releasing the button.</p>\n<p><strong>Dashing</strong> is done by holding down the dash button, shown in the in-game prompts or via the steam input bindings menu, aiming the dash icon by looking forward, and throwing your hand forward.</p>\r\nNot yet implemented / in progress:\r\n<p>(This list will change as development continues)</p>\n<ul><li>Choose left or right hand dominance</li><li>Choose which hand performs snap rotation</li><li>Choose between snap rotation, smooth rotation, or no artificial rotation.</li><li>Toggle the comfort speed-lines and vignette, and adjust comfort vignette intensity.</li><li>add missing sound, background ambience, particle effects.</li><li>stop items grabbed at a distance from yeeting themselves away from the player under certain circumstances.</li><li>A lot more.</li></ul>", "metacritic": null, "released": "2021-02-21", "tba": false, "updated": "2021-02-22T04:49:50", "background_image": "https://media.rawg.io/media/screenshots/b51/b51fd6d180d8084f4f4dc01b176d22d4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 58, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Hypernoodle Games"], "genres": ["Adventure", "Platformer"], "publishers": [], "esrb_rating": null}