{"id": 561356, "slug": "inroads", "name": "INROADS", "name_original": "INROADS", "description": "<p>-----------------------------------------------------</p>\n<p>A game made in only one week where you play as the princess of an endangered legacy: The kingdom of Trija. In exile with a few of her remaining followers, she has to survive for as long as possible while fleeing the enemy army chasing her. Manage your individual units, send them to expeditions to gather resources and take tough decisions.</p>\n<p>-----------------------------------------------------<br/></p>\r\nStronger, together\r\n<p>-----------------------------------------------------</p>\n<br/>\n<p>The game lets you send one or more units to many simultaneous expeditions in order to gather resources. But when planning them you'll encounter an interesting dilemma: Would you rather send more people together on only one expedition and increase their chances of survival, or would you rather send as many expeditions running in parallel as possible, taking the risk of failing all of them?</p>\n<p>In this game about being in exile, you'll make tough decision, such as rejecting or accepting other migrants, sacrificing some of your crew and fleeing at the cost of leaving some behind. <br/><br/>To which extent will you manage to stay stronger together ?</p>\n<p>-----------------------------------------------------<br/></p>\r\nInroads\r\n<p>-----------------------------------------------------</p>\n\n<p><em>/ˈɪnˌroʊdz/</em> - According to merriam-webster.com :</p>\n<em>\"Inroad</em> is a combination of <em>in</em> and <em>road, both of which are pretty mundane, as far as words go. But the first-and oldest-meaning of inroad hints at a meaning of road other than the \"way for traveling\" one. Beginning back in the days of Old English, road referred to an armed hostile incursion made on horseback. (Raid comes from this use of road and also formerly specified incursions on horseback.) Road has lost all of its former violent connotations, and inroad is shedding its as well. While inroads are often made at the expense of someone or something, they are at times simply advances, as when an artist is said to be making inroads into a community.<br/></em>\n<p>-----------------------------------------------------</p>\r\nCredits\r\n<p>----------------------------------------------------\r\n<br/></p>\n<p>A game by the international Nimble Beasts collective!</p>\n<ul><li><strong>Mago</strong> the installation wizzard - <em>Code, Art assist, German localizations</em></li><li><strong>Zach</strong> - <em>Code, Design assist</em></li><li><strong>Anicet Nougaret </strong>- <em>Game design, Art, Writing, Code assist, French localizations</em></li><li><strong>maestro SpaceCastle</strong> - <em>Original soundtrack and sound effects</em></li></ul>", "metacritic": null, "released": "2021-02-21", "tba": false, "updated": "2021-02-22T05:53:42", "background_image": "https://media.rawg.io/media/screenshots/560/5605cb8a1fcc9005be3d7a4e00fbc02a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 178, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["SpaceCastle", "Nimble Beasts Collective", "Anicet Nougaret"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}