{"id": 561524, "slug": "stronger-together-sshark_b8tee3", "name": "Stronger Together (sShArk_B8teE3)", "name_original": "Stronger Together (sShArk_B8teE3)", "description": "Introduction:<p>This is my first \"full\" playable game and my first attempt at a 2D game. The game was made in Unity and is for the Brackey's 2021.1 Game Jam. Feel free to ask any questions or leave constructive feedback in the comments. Thank you for playing!<br/></p>\n<br/>Gameplay:This is a local co-op game where you and a friend are little sentient jelly cubes who are trying to escape from the facility they were created it. You will have to work together to get through the rooms and escape. You work cooperatively either together by combining  to become one large jelly cube to destroy threats and jump over large obstacles or separate to help each other progress through the rooms. When you are small you work on your own but when together you most both work together to make the same directional movements to control the large cube effectively. To separate simply travel in opposite directions from each other. <br/><br/>Controls:<p>Player One:</p><ul><li>A   D   To move left and right</li><li>W         To jump</li></ul><p>Player Two:</p><ul><li>&lt;   &gt;   To move left and right</li><li>^          To jump</li></ul><p>When combined:</p><p>You must move together cooperatively to move the large cube effectively using the same controls as the individual players. <br/></p><p>~I acquired the main song from bensound.com~</p>", "metacritic": null, "released": "2021-02-21", "tba": false, "updated": "2021-02-22T06:38:17", "background_image": "https://media.rawg.io/media/screenshots/175/17544254c3be0b9ae8118fea523d7dd2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 4, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["sShArk_B8teE3"], "genres": ["Action", "Strategy", "Platformer"], "publishers": [], "esrb_rating": null}