{"id": 56173, "slug": "pokemon-channel", "name": "Pokémon Channel", "name_original": "Pokémon Channel", "description": "<p>Pokémon Channel, released in Japan as Pokémon Channel ~Together with Pikachu!~ (ポケモンチャンネル ～ピカチュウといっしょ！～, Pokemon Channeru ~Pikachū to Issho!~), is a 2003 video game in the Pokémon series for the GameCube, developed by Ambrella, published by The Pokémon Company and distributed by Nintendo. The player's goal is to help Professor Oak refine and promote his TV network through watching broadcasts with a Pikachu. The game contains elements of the adventure, digital pet, and simulation genres. The player can explore full 3D environments, have Pikachu converse with other Pokémon, and collect various items.</p>\n<p>The game was developed rather quickly as a sequel to the Nintendo 64 title Hey You, Pikachu! and to promote the Nintendo e-Reader accessory, and uses a novel 3D texturing effect. It was first showcased at Electronic Entertainment Expo (E3) 2003 and later through a month-long series of promotional events in Sapporo, Hokkaido, Japan. It was released on July 18, 2003, in Japan, December 1 in North America, and April 2, 2004, in Europe. In Japan, the game sold 66,373 copies in its first year. It received mixed reviews, which generally criticized its low level of interactivity and repetitive sound effects, though its collecting aspects and visuals were somewhat better received.</p>", "metacritic": null, "released": "2003-07-18", "tba": false, "updated": "2023-08-30T16:06:28", "background_image": "https://media.rawg.io/media/screenshots/5a1/5a12d0d08cc473a2d87647f61e14dbbf.jpg", "website": "", "rating": 3.31, "rating_top": 4, "added_by_status": {"yet": 2, "owned": 7, "beaten": 13, "toplay": 6, "dropped": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 13, "suggestions_count": 165, "game_series_count": 0, "reviews_count": 13, "platforms": ["GameCube"], "developers": ["Ambrella"], "genres": ["Adventure", "Simulation", "Puzzle"], "publishers": ["Nintendo", "The Pokemon Company"], "esrb_rating": null}