{"id": 561719, "slug": "jello-squash", "name": "Jello Squash", "name_original": "Jello Squash", "description": "<p><strong>Game Title : JelloSquash</strong></p>\n<p><strong>Game Concept : Jello Together Strong !</strong></p>\n<p>Jello Together Strong! Player(Parent Jello) combines with children slime to increase its mass. The objective of the game is to break the trapdoor to get to another level. There are 3 levels to be beaten. Each level’s difficulty increases incrementally. The player has to kill the surrounding enemies (Yellow Jellos) to increase his mass in order to be heavy enough to break the trapdoor to go to the next level. Everytime the player breaks the trapdoor, it loses mass. If the player touches and is attacked by the enemy, it loses weight! The heavier the player, the stronger it is but gradually slowing its movement pace. If a player loses more than its original weight - &lt;1.0, the game will declare gameover ! Kill all enemy Jello and claim your Sweet Victory.</p>\n<p><strong>Game Story: </strong></p>\n<p>You are the only one Jello left who is strong enough to fight and also the only last hope of the Jello Race. One Jello, one dream. You are about to beat the evil enemy - Yellow Jello King to assert your dominance. One Lonely Jello came to fight his enemy, at the Yellow Jello’s dungeon to save his race and friends.</p>\n<p><strong>Controls and purposes:</strong></p>\n<p>Use WASD to move and find your friends. </p>\n<p>Merge with children Jello to increase your mass.\t</p>\n<p>Press space and then left click (LMB) to crush enemies to gain mass.</p>\n<p><strong>Game objectives</strong> : </p>\n<p>Kill all enemy Jello (Yellow Jello)</p>\n<p>Use Keys to open cages.</p>\n<p>Save as many Jello friends as possible.</p>\n<p>Get heavy enough to break the trap door and reach your final destination.</p>\n<p><strong>Final Objective </strong>:</p>\n<p>Kill the enemy King (Yellow Jello King) to obtain the Victory Golden Key. Use the golden key to open the golden door :3</p>\n<p>Developers:</p>\n<p>https://vincexodus.itch.io/</p>\n<p>https://slashx21.itch.io/</p>\n<p>https://andrewtch.itch.io/</p>\n<p>&amp; Me!<br/></p>", "metacritic": null, "released": "2021-02-21", "tba": false, "updated": "2021-02-22T07:29:59", "background_image": "https://media.rawg.io/media/screenshots/99e/99ef15177c651ae358e659bc888b6280.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 361, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Nixon"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}