{"id": 561855, "slug": "totem-nights", "name": "Totem Nights", "name_original": "Totem Nights", "description": "<p><strong>Every night the totems rise up to touch the sky. </strong>Help the little totem leader to gather his companions so that they can build higher totems and defeat the evil fire spirits. Of course  <strong>there is strength in numbers</strong>! (oh! It is the jam theme!). Every enemy has <strong>power points</strong> (look at his eyes), so if a<strong> totem formed by an equal or greater number of pieces</strong> falls on the enemy it will eliminate it without suffering damage (except for invincible red spirits).<br/></p>\n<p>This game has been developed in one (very long) week for the Brackeys Game Jam 2021.1. All programming, design and artwork has been done by Picodaddy (Me :D) except for the sounds (thanks buddy) and some assets like terrain tilesets, background parallax layers and music (sources coming soon, now I have to sleep).</p>\n<p><strong>Special thanks:</strong></p>\n<ul><li>David Pascual (He made the sounds).</li><li>Marci (He made the totem designs).</li><li>David (Helping me to find the music and for whatever I need).</li><li>Matías (For always being there).</li></ul>\n<p>And thank you too! I would appreciate any kind of honest feedback to keep improving.<br/></p>\n<p><strong>DEAR MAC OS USERS:<br/></strong></p>\n<p>I have no way of checking if the Mac version works properly, so I recommend you the web or PC versions. In any case, I would appreciate feedback on the Mac OS versions.<br/></p>", "metacritic": null, "released": "2021-02-21", "tba": false, "updated": "2021-02-22T08:06:36", "background_image": "https://media.rawg.io/media/screenshots/23a/23ac71c55486075e309046a7b1266a70.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 9, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Web"], "developers": ["picodaddy"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}