{"id": 56184, "slug": "resident-evil-4", "name": "Resident Evil 4 (2005)", "name_original": "Resident Evil 4 (2005)", "description": "<p>Resident Evil 4 is a third-person shooter game developed by Capcom Production Studio 4 and published by Capcom. The sixth major installment in the Resident Evil series, it was originally released for the GameCube in 2005. Players control U.S. government special agent Leon S. Kennedy, who is sent on a mission to rescue the U.S. president&#39;s daughter Ashley Graham, who has been kidnapped by a cult. In a rural part of Europe, Leon fights hordes of villagers infected by a mind-controlling parasite, and reunites with the spy Ada Wong.<br />\nDevelopment began for PlayStation 2 in 1999. Four proposed versions were discarded; the first attempt was directed by Hideki Kamiya after producer Shinji Mikami. In a departure from the fixed camera angles and slower survival horror gameplay of previous instalments, the team focused on developing more dynamic shooting action.<br />\nResident Evil 4 was announced as a GameCube exclusive as part of the Capcom Five, but was ported to numerous formats, becoming a cross-platform hit, selling over 10 million copies across all platforms. It garnered acclaim for its narrative, gameplay, voice acting, and characters, and is often named one of the best video games, winning multiple Game of the Year awards in 2005. It influenced the evolution of the survival horror and third-person genres, popularizing the &quot;over-the-shoulder&quot; third-person view. Resident Evil 5 was released in 2009.</p>\n<h1>Gameplay</h1>\n<p>The player controls the protagonist, Leon S. Kennedy, from a third-person perspective. Departing significantly from the series&#39; previous games, the gameplay focuses on action and shootouts with fewer survival horror elements. The camera is placed behind Leon and zooms in for an over-the-shoulder view when aiming a weapon, or a first-person view when aiming with a sniper rifle. There is no crosshair for firearms; instead, every firearm has a laser sight. Unlike previous games where players can only shoot straight, up, or down, players have more options. For example, shots to the feet can cause enemies to stumble, and shots to the arms can make them drop their weapons. Players can also shoot down projectiles like thrown axes or scythes.<br />\nResident Evil 4 adds context-sensitive controls. Based on the situation, players can interact with the environment: kicking down a ladder, jumping out of a window, dodging an attack or executing a &quot;finishing move&quot; on weakened enemies. There are also quick time events, in which the player must press buttons indicated on-screen to execute actions such as dodging a falling boulder or wrestling an enemy to stay alive. These are often incorporated into the game&#39;s many boss fights, in which the player must avoid instant-kill attacks.<br />\nThe main enemies are violent villagers referred to as Los Ganados (&quot;The Cattle&quot; in Spanish). Los Ganados can dodge, wield melee and projectile weapons, and are capable of working collectively and communicating with each other.<br />\nThe inventory system features a grid system, represented by an attaché case, that has each item take up a certain number of spaces. The case can be upgraded several times, allowing for more space. Weapons, ammunition, and healing items are kept in the case, while key items and treasures are kept in a separate menu. Items may be bought from and sold to a merchant that appears in various locations. He sells first aid sprays, weapons, allows for weapons to be upgraded and buys various treasures that Leon finds. The various weapons each have their own advantages and disadvantages.<br />\nCapcom added content for the PlayStation 2 version, which was later incorporated into the PC and Wii releases. The largest addition is &quot;Separate Ways&quot;, a minigame which focuses on Ada Wong&#39;s involvement in Resident Evil 4 and her connection to the series&#39; villain Albert Wesker. &quot;Ada&#39;s Report&quot;, a five-part documentary, analyzes Ada&#39;s relationship with Wesker and his role in the plot. Other unlockable content in all versions includes the minigames &quot;The Mercenaries&quot; and &quot;Assignment Ada&quot; (using Ada to retrieve Las Plagas samples), new costumes for Leon and Ashley, new weapons, and a cutscene browser.</p>\n<h1>Plot</h1>\n<p>U.S. government agent Leon S. Kennedy (Paul Mercier) is on a mission to rescue Ashley Graham (Carolyn Lawrence), the U.S. President&#39;s daughter, who has been kidnapped by a mysterious cult. He travels to a nameless rural village in Spain, where he encounters a group of hostile villagers who pledge their lives to Los Illuminados, the cult that kidnapped Ashley. The villagers were once simple farmers until becoming infected by a mind-controlling parasite known as Las Plagas.<br />\nWhile in the village, Leon is captured by its chief, Bitores Mendez, and injected with Las Plagas. He finds himself held captive with Luis Sera (Rino Romano), a former Los Illuminados researcher. The two work together to escape, but soon go their separate ways. Leon finds out Ashley is being held in a church and rescues her. They both escape from the church after Osmund Saddler (Michael Gough), leader of Los Illuminados, reveals his plan to use the plaga they injected into Ashley to manipulate her into injecting the president of the United States with a &quot;sample&quot; once she returns home, allowing Saddler to begin his conquest of the world.<br />\nAfter killing Mendez, Leon and Ashley try to take refuge in a castle but are attacked by more Illuminados under the command of Ramon Salazar (Rene Mujica), another of Saddler&#39;s henchmen who owns the castle, and the two become separated by Salazar&#39;s traps. Meanwhile, Luis searches for pills that will slow Leon and Ashley&#39;s infection, as well as a sample of Las Plagas. He brings the two items to Leon but is killed by Saddler, who takes the sample, while the pills to suppress the infection remain in Leon&#39;s hands. While in the castle, Leon briefly encounters Ada Wong (Sally Cahill), a woman from his past who supports him during his mission. He battles his way through the castle before killing Salazar.<br />\nAfterward, Leon travels to a nearby island research facility, where he continues the search for Ashley. He discovers that one of his former training comrades, Jack Krauser (Jim Ward), who was believed to have been killed in a helicopter crash two years prior, is responsible for her kidnapping. Ada and Krauser are working with Albert Wesker (Richard Waugh), for whom both intend to secure a Plagas sample. Suspicious of the mercenary&#39;s intentions, Saddler orders Krauser to kill Leon, believing that no matter which one dies, he will benefit. After Krauser&#39;s fatal defeat, Leon rescues Ashley, and they remove the Plagas from their bodies using a specialized radiotherapeutic device. Leon confronts Saddler, and with Ada&#39;s help, manages to kill him. However, Ada takes the sample from Leon at gunpoint before escaping in a helicopter, leaving Leon and Ashley to escape via her jet-ski as the island explodes.</p>", "metacritic": 83, "released": "2005-01-11", "tba": false, "updated": "2024-04-23T09:18:15", "background_image": "https://media.rawg.io/media/games/fee/fee0100afd87b52bfbd33e26689fa26c.jpg", "website": "https://www.residentevil.com/4/", "rating": 4.4, "rating_top": 5, "added_by_status": {"yet": 323, "owned": 4018, "beaten": 1617, "toplay": 248, "dropped": 288, "playing": 66}, "playtime": 5, "achievements_count": 127, "ratings_count": 1726, "suggestions_count": 491, "game_series_count": 19, "reviews_count": 1742, "platforms": ["GameCube", "Android", "PC", "iOS", "PlayStation 4", "PlayStation 2", "Wii"], "developers": ["Capcom"], "genres": ["Action", "Shooter"], "publishers": ["Ubisoft Entertainment", "Capcom", "THQ", "1C-SoftClub", "Nintendo Australia", "Red Ant Enterprises"], "esrb_rating": "Mature"}