{"id": 561920, "slug": "enter-the-dream-zone", "name": "Enter the Dream Zone", "name_original": "Enter the Dream Zone", "description": "<p>You play as the spirit of a child who enters the dream realm. He is accompanied by his Teddy bear, who came to protect him from the nightmares lurking around. Make your way through the dream world and escape by platforming across floating clouds, breaking walls and fighting off nightmare entities with the overwhelming strength of your teddy bear. The bear and the child will need each other's abilities to progress, so remember: You are always stronger when you are together.<br/></p>\n\n<p>We had a lot of fun developing this game, but who exactly is <strong>we?</strong>:</p>\n<p><strong>Gabriel</strong>: Our meme sharing code kicking badass who helped solve many problems, introduce new ways of encountering unity, and chipping in with ideas for a game and mechanic. Always there to prove why he studied programming in the first place.</p>\n<p><strong>Felix</strong>: One of the kindest and most humble programmers you will ever see, always patient, always ready to help and solve issues. He's such a good game dev when he showed one of his previous titles, he scared himself with it.</p>\n<p><strong>Dogus (Aka: Dog)</strong>: By far the most overqualified non game dev, helping us with immersive sounds, fantastic music, and the most organic animations ever, he contributed in design, in ideas, and most importantly in spirit willing to go all night.</p>\n<p><strong>Harry</strong>: I never thought I would ask for a team, but after doing so, I couldn't ask for a better one, each one of these guys taught me valuable tricks and even more valuable ideals for approaching game dev. I helped in AI, design, aesthetic, but had it not been for the 3 I mentioned, I probably wouldn't have done those at all. <br/></p>\n<p><strong>Good luck to all the participants, and we hope you enjoyed the jam as much as we did. Cheers!</strong><br/></p>", "metacritic": null, "released": "2021-02-21", "tba": false, "updated": "2021-02-22T08:23:17", "background_image": "https://media.rawg.io/media/screenshots/e4f/e4fc6db02baad49c1612a909b6736b52.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["HarryWood", "Gabo6480", "Marcoux", "Dogus Kuner"], "genres": ["Action", "Adventure", "Platformer"], "publishers": [], "esrb_rating": null}