{"id": 561907, "slug": "latched-onto-power", "name": "Latched Onto Power", "name_original": "Latched Onto Power", "description": "<p><strong>Created for the </strong>Brackeys Game Jam (2021.1)<br/></p>\n\n<p>Fly through the clouds and fight enemies in this endless top-down shooter! Avoid the clouds and face off against different types of enemies! Collect and latch onto turrets to become stronger!</p>\r\nHow to Play\r\n<p>Move around enemies and obstacles with the <strong>WASD or Arrow keys</strong>. Shooting bullets happens automatically, so there's no need to hold down a button! Every 5 points(or 5 stages,) you will encounter a stat token. This can be used to upgrade your stats, such as your fire rate, bullet size, or bullet size. You can also encounter a turret token. When collected, you will obtain a turret that you can summon/move with the <strong>Left Mouse button</strong>. There are also puzzle pieces that can appear, which allows you to attach the active turret to your ship. With a turret attached to you, you will fire that turret's bullets, but with a better fire rate, bullet size, and bullet damage, than the turret by itself. To attach your turret, simply move into it. The game will get harder over time, so you'll need to upgrade your stats carefully and weave around enemies with some skill. Don't worry, you can improve and you can get good!</p>\r\nKnown Issues\r\n<p><strong>No Windows/Downloadable Build</strong><strong>- </strong>Sorry guys! I built it recently, but I was able to attach it to the game. Oh well.</p>\n<p><strong>Getting stuck on cloud tiles- </strong>Simply move away from the tiles.<br/></p>\n<p><strong>Please let me know of any other issues that I may not have catched. It's better to have 1 comment about an issue than 100 comments.</strong><br/></p>\n\n<p>After this, I'll take a break on game jams. I have school, and I don't want game development to take over that. Before that however, I might patch my previous games to fix certain bugs. I'll also release some of my phototypes/canceled games, just for fun.</p>\n<p>ok then bye</p>", "metacritic": null, "released": "2021-02-21", "tba": false, "updated": "2021-02-22T08:20:15", "background_image": "https://media.rawg.io/media/screenshots/f9b/f9b479df975a07f1abc51918bdbddf80.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 17, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["pingedOff"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}