{"id": 56190, "slug": "future-gpx-cyber-formula", "name": "Future GPX Cyber Formula", "name_original": "Future GPX Cyber Formula", "description": "<p>Future (New Century) Grand Prix (GPX) Cyber Formula (新世紀GPX（フューチャーグランプリ）サイバーフォーミュラ) is a 37-episode anime television series by Sunrise (Hajime Yatate). It originally aired in Japan between March 15, 1991 and December 20, 1991. The TV series was later followed by four OVA series respectively titled: Double One, Zero, Saga, and Sin.</p>\n<p>Cyber Formula is a science-fiction story about racing in the future, when race cars are equipped with computer support systems called 'Cyber Systems'. The story setting back in the late 80s and early 90s of the 20th century predicted changes in auto-racing in the next century. The first episode quickly disposes the first nine seasons of cyber formula racing and opens the plot in 2015, slightly before the first race of the 10th season. Given such background, the author imagined further development of the telemetry and electronic assistance technologies in Formula 1 racing (e.g., the adoption of such technology in early stages led to Williams FW-14 that debuts in the same year when the TV series was aired, and one year later winning the 1992 Formula One Grand Prix in reality). The further development focused in several aspects: (1) the computer system, dubbed as \"Cyber Systems\", and its artificial intelligence (AI), has been improved to a level that enables direct linguistic communication and \"understands\" the user's emotion in such a way that the emotion can be used as an input to cause certain unpredictable output of the computer system; (2) the computer system controls all mechanical aspects of the racing machine, including changing mechanical aspects such as proactively changing suspension height and stiffness, transforming the aerodynamic components of the vehicle as to adapt the vehicle to various racing conditions (e.g., changing drag coefficients and down force generation as trade-offs).</p>\n<p>The TV series focused on the interaction between a special Cyber System called Asurada and its driver Hayato. Asurada helped Hayato winning the 10th Cyber Formula GPX. The first OVA Cyber Formula Double One continued Hayato's story into the next racing season, primarily describing the intellectual growth and skill development in Hayato. The second OVA Cyber Formula Zero covered the next two racing seasons, wherein Hayato discovered a mental state \"Zero Zone\" that enabled him observing and predicting in a super-human manner. The third OVA Cyber Formula SAGA continued the story by posing a situation wherein the superiority of the racing machine dictates a race's outcome. Hayato had to again collaborate with Asurada with new driving skills to challenge and beat a superior racing machine. The final OVA Cyber Formula SIN refreshes the story line by having Hayato's mentor and best friend, Bleed Kaga, came back to beat Hayato. These anime series was then followed by a PlayStation game series to further the racing stories.</p>", "metacritic": null, "released": null, "tba": false, "updated": "2019-01-09T12:41:06", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["GameCube"], "developers": [], "genres": ["Sports"], "publishers": [], "esrb_rating": null}