{"id": 56199, "slug": "sonic-gems-collection", "name": "Sonic Gems Collection", "name_original": "Sonic Gems Collection", "description": "<p>Sonic Gems Collection is a 2005 compilation of video games, particularly those in the Sonic the Hedgehog series, from the publisher Sega. The emulated games span multiple genres and consoles—from the Sega Genesis to the Sega Saturn—and retain the features of their original releases with minimal edits. Player progress is rewarded with unlockable demos of well-known Sonic games, videos, and promotional artwork spanning the history of the Sonic franchise.<br />\nThe compilation was conceived by developer Sonic Team to introduce younger players to older games in the Sonic franchise. While its predecessor, Sonic Mega Collection, surrounds the series&#39; most popular installments, Sonic Gems Collection has a greater focus on titles considered rare and obscure, such as Sonic CD and Sonic the Fighters. Sonic Team prioritized games they considered high quality; desired titles such as SegaSonic the Hedgehog and Nights into Dreams were excluded due to emulation difficulties.<br />\nSonic Gems Collection was released for the GameCube and PlayStation 2. Its reviews were mixed or average; critics were sharply divided over whether or not the package would leave players satisfied. Among its games, reviewers preferred Sonic CD and Vectorman, but found Sonic the Fighters and Sonic R mediocre, and disliked the Game Gear games. Some reviewers were disappointed by the absence of the Streets of Rage titles in the North American version due to problems with the Entertainment Software Rating Board and other Sonic games like Knuckles&#39; Chaotix and Sonic the Hedgehog Pocket Adventure. The GameCube version was branded as a Player&#39;s Choice title in 2006.</p>", "metacritic": null, "released": "2005-08-11", "tba": false, "updated": "2022-11-19T07:42:59", "background_image": null, "website": "", "rating": 3.73, "rating_top": 4, "added_by_status": {"yet": 2, "owned": 12, "beaten": 11, "toplay": 2, "dropped": 4}, "playtime": 0, "achievements_count": 0, "ratings_count": 11, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 11, "platforms": ["PlayStation 2", "GameCube"], "developers": ["Sonic Team"], "genres": ["Platformer"], "publishers": ["SEGA"], "esrb_rating": null}