{"id": 56204, "slug": "sonic-mega-collection", "name": "Sonic Mega Collection", "name_original": "Sonic Mega Collection", "description": "<p>Sonic Mega Collection (ソニック メガコレクション, Sonikku Mega Korekushon) is a video game compilation developed by Sonic Team and published by Sega in 2002 for the GameCube. The compilation contains twelve to fourteen games (depending on region) originally released on the Sega Genesis. Ten of the included games are installments of the Sonic the Hedgehog series, while the remaining two to four games are only related to the series through its publisher, Sega.<br />\nAccording to the director, Yojiro Ogawa, the purpose of the compilation was to introduce younger players to the original games in the Sonic series. The games are played through a Genesis emulator developed by Sonic Team themselves. Outside of the games, the compilation includes Sonic-themed videos and illustrations, as well as high-resolution scans of the instruction manuals and Sonic the Hedgehog comic covers.<br />\nSonic Mega Collection received positive critical reception, being recommended for its large library of titles, great emulation, and its cheap market price. The compilation was re-released with eight bonus games as Sonic Mega Collection Plus for PlayStation 2, Xbox, and Microsoft Windows. This was followed by a new compilation for the GameCube, Sonic Gems Collection, which included more obscure and rare Sonic games such as Sonic CD.</p>", "metacritic": 75, "released": "2002-11-10", "tba": false, "updated": "2023-01-05T02:08:11", "background_image": "https://media.rawg.io/media/screenshots/40d/40d936fb71dfd846350cb4443f9e037f.jpg", "website": "", "rating": 4.44, "rating_top": 4, "added_by_status": {"yet": 5, "owned": 16, "beaten": 9, "toplay": 6, "dropped": 5}, "playtime": 0, "achievements_count": 0, "ratings_count": 9, "suggestions_count": 248, "game_series_count": 0, "reviews_count": 9, "platforms": ["GameCube", "PlayStation 2"], "developers": ["Sonic Team"], "genres": ["Action", "Fighting", "Puzzle", "Platformer"], "publishers": ["SEGA", "Infogrames"], "esrb_rating": "Everyone"}