{"id": 562024, "slug": "the-guns-of-eratosthenes", "name": "The Guns of Eratosthenes", "name_original": "The Guns of Eratosthenes", "description": "<p><strong>This is a VR  test/prototype game, currently only for Oculus Quest &amp; Quest 2.</strong></p>\n<p><strong>INTRODUCTION</strong></p>\n<p>Your spaceship crash-lands outside an empty school; you are inside the school's first (and perhaps only) classroom. After spelling out your name on the letter board, you can tackle timed challenges in the room by shooting the correct answers when they appear on a blackboard. But first you'll need a gun... or a \"laser banana\"?</p>\n<p>The game features VR interactions, haptic feedback (controller vibration), thrilling sounds and music, plus a persistent high-score table to keep track of who pwned who!</p>\n<p><strong>DETAILS</strong></p>\n<p>After acquiring a laser pointer (gun, banana, whatever) you choose a challenge by <strong>tagging</strong> (shooting) an object in the room, for example the globe labelled \"Geography\". This tagging action triggers a <strong>challenge</strong>.</p>\n<p>The main blackboards present a right and wrong answer, and you tag (shoot) one of them. Each challenge lasts a fixed time (40 seconds), has three levels and rewards combos of correct answers. The challenges in the initial release are:</p>\n<ul><li>Capital cities of the World</li><li>US Presidents and their dates of tenure</li><li>US States and their capital cities</li><li>Addition (&amp; subtraction), various levels including negative numbers.</li><li>Multiplication; 2 x 2 up to 12 x 12</li><li>Chemical elements and their symbols e.g. K = Potassium</li><li>Tennis \"Grand Slam\" winners</li></ul>\n<p>You can also play in practice mode where the correct answer is highlighted or written in bright yellow, but your score won't be recorded.</p>\n<p>If you want to reset all the high scores and start again, there's a button on the teacher's desk for that.</p>\n<p><strong>Exiting the game:</strong> You can just quit the app on the Quest, but if you prefer a less abrupt exit, shoot the paper cup by the rubbish bin (garbage) in the corner. It's clearly labeled.</p>\n<p><strong>BACKGROUND</strong></p>\n<p>This game started out as a tech demo based around \"flash cards\" for these separate challenges to help kids practice their addition, multiplication, etc... There are some other interactions in the room as I experiment with VR.</p>\n<p><em><strong>What's with the name?</strong></em> There's something called the Sieve of Eratosthenes which is an algorithm for quickly finding prime numbers. I wanted to put that into this game; it didn't make it into this version but the name stuck. It's <strong>Era-Toss-The-Knees.</strong><br/></p>\n<p><strong>DEVELOPMENT PLANS</strong></p>\n<p><strong>Future plans:</strong> This is really a test area for VR ideas and interactions. There's lots of potential for improvements... robots, more letters, maybe a spelling bee? Moving targets might be fun. Or this may morph into a completely new game.<br/></p>\n<p><strong>Modding support:</strong> This game is designed to be user-moddable; question sets are simple CSV files inside the project folder and on the PC it's easy to add a new set of questions. But on the Quest, mods don't seem to be supported. So this would be a feature in the SteamVR version.</p>\n<p> Updates may include more platforms, more interaction options, etc.<br/></p>\n<p><strong>TECHNICAL</strong></p>\n<p>This project is un Unity 2020.1 (preview/non-production) using exclusively the Unity XR Interactions Toolkit, no SteamVR or any other VR/interaction package.</p><p><strong>TEAM &amp; CREDITS</strong><br/></p>\n<ul><li>Bad Penny Games, contact email:        <strong>itch</strong> @ <strong>badpennygames.com</strong></li><li>\"Space Girl\" Artwork: https://www.instagram.com/fan_art_lexy/</li><li>Voice Talent: Michelle Ticktin</li></ul>", "metacritic": null, "released": "2021-02-21", "tba": false, "updated": "2021-02-22T08:49:49", "background_image": "https://media.rawg.io/media/screenshots/59d/59dd3348d4c9d3ed7928f05fbe7bb42c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 155, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["bad.penny.games"], "genres": ["Action", "Educational"], "publishers": [], "esrb_rating": null}