{"id": 562050, "slug": "hacker-man", "name": "HACKER MAN (itch)", "name_original": "HACKER MAN (itch)", "description": "<p><strong>HACKER MAN </strong>is a funny turn-based fighting game with multiple PC.                                                                                                                                                                                               </p>\n<p><strong>Warning /// IF THE GAME CRASH AT THE BEGINNING RELOAD THE PAGE ///</strong></p>\n<p><strong>Control :</strong><br/></p>\n<p>-enter to pass/launch attack</p>\n<p>-each attack have to be taped with the keyboard</p>\n\n<p><strong>HACKER MAN</strong> is the nickname of a young employee who forgot to turn off his computer at the office. He must therefore hack the NASA servers in order to access his PC remotely. The only computer available is an old PC from his childhood. He must therefore hack 6 computers in order to obtain the computing power necessary to crack NASA's servers.</p>\n<p>‌The game is turn-based pokémon style. There are six computers to defeat. Each one will give you access to its characteristic attack. There are a total of 11 different attacks.</p>\n<p>‌ We are two to have developed the game, in 4 days. This is our very first jame game. Our team is made up of a programmer and a designer / animator.</p>\n<p>We were obviously not able to integrate all the functionalities planned at the base. </p>\n<p>Despite everything, we are very proud of the final rendering of the project. The development was difficult and tiring, but really rewarding. </p>\n\n<p>Credit: </p>\n<p>Programming: Dorian Sanjivy </p>\n<p>Visual / Animations: Abel Graux</p>\n<p>Without forgetting all our friends who supported us during this project.</p>\n<p>Thanks to Adam Haynes and ThePrimeCronus for allowing us to use their music.</p>", "metacritic": null, "released": "2021-02-21", "tba": false, "updated": "2021-02-22T08:56:51", "background_image": "https://media.rawg.io/media/screenshots/2b9/2b9b0c271bac474e7c6b602e9db7f0f4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 97, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Les Gros Shlags"], "genres": ["Adventure", "Strategy", "Fighting"], "publishers": [], "esrb_rating": null}