{"id": 562037, "slug": "fusion-defense", "name": "Fusion Defense", "name_original": "Fusion Defense", "description": "<p>Made for Brackeys 2021.1 Stronger Together. A Tower Defense game in which you can combine two towers together to form one stronger one. Careful though as that means you're also a tower short.  <br/></p>\n<p><strong>Controls &amp; How to Play:</strong></p>\n<p>- Left click in the centre of a tile to rotate it and anything on it to the left. Right click to rotate right.</p>\n<p> -Left click on a turret to stop it rotating with the tiles. left click again to allow it to be rotated with the tile</p>\n<p>- Click and<strong> hold</strong> on a combined tower to separate it back to two.  If the  left mouse button is used the second tower will rotate out to the left and it will rotate out to the right if the right mouse button is clicked.</p>\n<p>You do not build new towers, new tiles fly in throughout the game giving you access to more areas on the map and also having towers/turrets ready to use.</p>\n<p>There are 9 types of turrets in total,  can you get all the combinations ? (maybe don't try the fire and ice combo..it was meant to make a laser turret but its bugged and doesn't shoot...so 8 types of turrets..)</p>\n<p>5 waves in total.  Some turrets have armour piercing rounds for armoured enemies and some also have a slowing effect. </p>\n<p>Didn't balance this well as I ran out of time but let me know what you think anyway. Thanks</p>", "metacritic": null, "released": "2021-02-21", "tba": false, "updated": "2021-02-22T08:53:21", "background_image": "https://media.rawg.io/media/screenshots/6da/6dae303ee87d096aaa26f632f919e1d2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 8, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["DenzilG"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}