{"id": 562134, "slug": "haunt-o-mat", "name": "Haunt-o-mat", "name_original": "Haunt-o-mat", "description": "<p><strong>Haunt-o-mat</strong></p>\n<p>Hell's overpopulated, and the demons who live there are trying to invade our world! One of these demons is trying to gain the strength to escape the underworld by siphoning the electricity of a laundromat...</p>\n<p>Our protagonist is a shaman trying to save his son, and he is accompanied by strange characters made up of extraordinarily <em>sensitive</em> people. Will you seal the great evil living within the...uh...laundromat...OR will the demons take over all of Earth as we know it?!</p>\n<p><strong>Gameplay:</strong><br/></p>\n\n<p>There’s a demon hiding inside the washing machines, making them hacked. There are also people using the washing machines. If a person uses a hacked washed machine, they will become <em>possessed</em>.<br/>After a person becomes possessed, they can go and hack other washing machines, thus making the power of the demon stronger and causing more people to become possessed.<br/><br/></p>\n<p>You can fix a hacked washing machine by fixing it’s cable circuit on the back. You can do so by walking up to a washing machine that you think is hacked and interacting with it.<br/></p>\n<p>You can also exorcise people who are possessed. In order to do so, you will need to talk to people and determine by the conversation whether or not they are possessed. If you think that they are possessed, you can threaten them to bring the demon out of them. However, if you do that to a person who is not possessed, the demon will hack another washing machine.</p>\n<p>Victory is achieved by successfully fixing all hacked washing machines and exorcising all possessed people. </p>\n\n<p><strong>Controls:</strong></p>\n<p>• Movement: WASD / Arrow Keys</p>\n<p>• Interact/Talk: E</p>\n<p>• Select Option: Left-click</p>\n<p>• Rotate Washing Machine Tile: Left-click</p>\n<p><strong>Credits:</strong></p>\n<p>• Lynn Boass: Writer, UI Designer, and Pixel Artist</p>\n<p>    ° https://lynnboass.itch.io/</p>\n<p>    ° https://twitter.com/LynnBoass</p>\n<p>• Dukebot: Programmer and Level Designer</p>\n<p>    ° https://dukebot.itch.io/</p>\n<p>    ° https://twitter.com/DukebotDev</p>\n<p>• Missingfox: Composer, Sound Designer, Pixel Artist, and Level Designer</p>\n<p>    ° https://missingfox.itch.io/</p>\n<p>    ° https://twitter.com/MissingFox1</p>\n<p>• Kagenashi: Programmer, UI Designer, and Level Designer</p>\n<p>    ° https://kagenashi.itch.io/<br/></p>", "metacritic": null, "released": "2021-02-21", "tba": false, "updated": "2021-02-22T09:19:15", "background_image": "https://media.rawg.io/media/screenshots/e8f/e8ff6082cc9c26306a9f8c2556f43239.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 3, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["dukebot", "LynnBoass", "missingfox", "kagenashi"], "genres": ["RPG", "Puzzle"], "publishers": [], "esrb_rating": null}