{"id": 562335, "slug": "til-death-do-us-apart", "name": "Til Death Do Us Apart", "name_original": "Til Death Do Us Apart", "description": "<p>We were happy. We were all very happy, until that damn bunny came to my house when I was gone and stole all of my friends with him. </p>\n<p>I don't know why he took them. I don't know what's he gonna do with them. But what I do know is that he's gonna pay for what he did, and I am taking my friends back.</p>\n<p>I am nothing without my buddies.  We are only stronger together apart I am...nothing. They are a part of my soul.</p>\n<p>There are going to be many challenges, but I must complete all of them.</p>\n<p>---------------------------------------------------------------------------------------------------------</p>\n<p>The person here- ahh well this is my first game so idk tell me how you like it. Also well...sorry… I Don’t know how to do GUI’s yet that nicely, so I couldn’t exactly add a start screen or something really fancy.</p>\n<p>I mean those pictures you see in this page were actually made for the start screen and ded screen. But well...what can I say maybe I’ll add them later.</p>\n<p>Also, just in case if you’re thinking that I just made a random game and just submitted in the game jam without any relation to it well then you’re wrong this game was actually made specifically for this game jam….</p>\n<p>I mean I had the idea for something like ditto, but then I realized that it was literally what everybody else thought, and then I just tried to come up with something different and well here you go we are only stronger with our friends…</p>\n<p>If I actually knew how to do GUI I might’ve done better and even something better for the end screen thing.</p>\n<p>But what can I say I mean I started learning this literally just a week before this jam and then I was like oh yeah lt’s to join it without even thinking that I don’t know game developing yet.</p>\n<p>Also...yeah I seriously don’t know what I was supposed to write here cause this is looking like a dev blog like thing so yeah forgive me if I was supposed to write something else. I’m doing this for the first time.</p>\n<p>-----------------------------------------------------------------------------------------------------------------</p>\n<p>Credits and the assets used-</p>\n<p>Enemies and characters from - hipixelfrog@gmail.com</p>\n<p>Tileset and background from - https://www.patreon.com/ansimuz</p>\n<p>Voice Acting from - Dillon Becker (dillonbecker.com)</p>\n<p>Background Music from - https://void1gaming.itch.io/</p>\n<p>Extra Sound effects from - https://groovymaster.itch.io/</p>", "metacritic": null, "released": "2021-02-20", "tba": false, "updated": "2021-02-22T10:15:07", "background_image": "https://media.rawg.io/media/screenshots/318/3189c5d00a6868ca4d26f1049867a128.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 21, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Hole"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}