{"id": 562466, "slug": "the-pit-itch-dokdave", "name": "The Pit (itch) (DokDave)", "name_original": "The Pit (itch) (DokDave)", "description": "The Legend\r\n<p>As the tale goes, a dazzling treasure lies underground a forbidden planet. The temptation of riches beyond belief is too enticing, you must go for it.</p>\n<p>The Expedition</p>\n<p>You land your spacecraft on the unknown terrain. With the aid of lasers, the tedious tunneling begins, being ever so careful not to unlodge rocks that block your path. The lure for treasure grows stronger as you find \"Blue Gem Crytals\" in some tunnels. It can't be far off.</p>\n<p>You Are Not Alone</p>\n<p>The lust for riches extends throughout the galaxy. An alien ship joins yours on the strange planet and enemy explorers descend in the depths of the cave in an attempt to steal the treasure.</p>\n<p>The Showdown</p>\n<p>You meet your fellow space prospector face to face... you fire first, disintegrating the felon... you hasten your quest for treasure... you must reach it first.</p>\n<p>Before Your Very Eyes</p>\n<p>The treasure chamber is sighted... you blast through and your wildest dreams are satisfied... there lies the trease for the taking. Quickly you gather your bounty while avoiding crashing rocks...</p>\n\n<p>The Pit</p>\n<p>You must make your own path to return to the Base Ship... But you must cross the deadly Pit to enter the ship. Fail... and you and your riches will never be heard from.</p><p>Notes:<br/></p><p>The download files are intended for use with a ZX Spectrum emulator, or a real Spectrum Next computer.</p>\n<p>I recommend the Zesarux emulator, but any will do.</p>", "metacritic": null, "released": "2021-02-20", "tba": false, "updated": "2021-02-22T10:48:52", "background_image": "https://media.rawg.io/media/screenshots/235/2359a88989965060818e7f641dadf27f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 21, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["DokDave"], "genres": ["Action"], "publishers": [], "esrb_rating": null}