{"id": 562430, "slug": "soul-purpose-gcake-icehunter", "name": "Soul Purpose (GCake, icehunter)", "name_original": "Soul Purpose (GCake, icehunter)", "description": "<p>Made during Global Game Jam 2021. We first named it \"Evil Possession\" and renamed it \"Soul Purpose\" in the end.</p>\n<p>The theme was : Lost and Found<br/></p>\n<p>Link to the GGJ2021 page : https://globalgamejam.org/2021/games/evil-possession-7<br/></p>\n<p>------------------------------------------------------------------------<br/></p>\r\nSoul Purpose\r\n<p>Visually inspired by Diablo I and II, Soul Purpose is a puzzle adventure game in a Top-down 2D isometric view, where you will need to find your way to the surface !<br/></p>\r\nContext :\r\n<p>You are Saul. You died and your soul was brought to Hell. After seeing the landscape, you find it quite hellish (it's hell after all) and you decide to find a way back to the surface of the Earth.</p>\r\nGame :\r\n<p>Hell is inhabited by powerful demons. To make your way through the surface, you will have to pass through these demons. As a soul, you have the ability to possess them, but be aware that it won't be easy as you will have to weaken them before being able to possess them.</p>\n<p>Once you possess them, you will gain their power and ability. You will then be able to overcome some obstacles that you couldn't otherwise.<br/></p>\r\nControls :\r\n<ul><li>Move : Arrow Key or WASD (based on Qwerty but other keyboards are supported)</li><li>Attack : Mouse Left Click / A / J</li><li>Possess or Unpossess a demon : Mouse Right Click / E / K</li><li><em>Alt+F4 to quit the game, as there is no menu to quit.</em></li></ul>\r\nMissing features :\r\n<ul><li>Doors mechanism : For now, every doors can be passed through (open or closed) by everyone. What we expected to do were the following :<ul><li>Grid doors can only be passed through by Saul.</li><li>Wooden doors should be destroyed or opened first in order to pass through.</li><li>Tall wooden doors can be passed through by most characters.</li><li>Small wooden doors can only be passed through by Imp.</li></ul></li><li>Rock Fist feature : These rock fists you can see on the small long path are supposed to make you fall from the terrain (and make you die). Talking from the dev side (GCake) : I have no idea how to avoid the terrain border collider while being pushed by a rock fist, and as it's a 2D game, there is technically no depth (?). So for now, if we get hit by the rock fist, we are just being stuck between the rock fist and the terrain collider. At some point, you will just pass through the terrain collider and get stuck in the collider.\r\n<ul><li>Additionally to that feature, Rock fist are supposed to be able to be freezable, to make it stop moving for a few seconds (so you can pass). But missiles can't pass through terrain collider, so it makes it quite hard.</li></ul></li><li>Key and Goal : On the Level Design, there were supposed to be a key to retrieve and then use it to escape. We didn't have time to implement it, so for now, the game only consist of roaming around the map, possessing/unpossessing demons.</li></ul>\r\nKnown Bugs :\r\n<ul><li>Ice demon's missile doesn't pass through terrain collider.</li><li>Demons' detection goes through walls.</li><li>You can possess through walls.</li><li>You may be stuck in walls if you get hit by rock fists</li><li>You can pass through closed doors (not really a bug but a missing feature)</li><li>On GGJ version, there is a high chance you get stuck in stairs (due to colliders issues), This is fixed on Post-GGJ version.</li><li>On GGJ version, there is a chance that Imps pass through terrain collider to chase you. I have no idea why but this should somehow be fixed on the Post-GGJ version.</li></ul>\r\nSummary of the GGJ2021 :\r\n\r\n<p>Although there are many bugs, we are pretty happy of what we created. It's our first 2D isometric game we make. We learned how to make it on the fly and we learned a lot.<br/></p>\n<p>We planned a lot stuff and features and couldn't make all of it. As there was only one dev on the game, managing from development to integration take quite some time.</p>\n<p>As for why I posted the game some weeks after, I wanted to polish some stuff just in order to make the game a bit more playable. When you start the game, you will be able to choose between the Gamejam version or the post-jam version. Hope you will enjoy the game ! :)</p>\r\nTeam (3 members) :\r\n<ul><li>Jeremie 'Zehuti' Southgate (Game Designer)</li><li>Michel 'Icehunter' Wong (Game Artist)</li><li>Joel 'GCake' Huang (Developper)</li></ul>", "metacritic": null, "released": "2021-02-20", "tba": false, "updated": "2021-02-22T10:40:10", "background_image": "https://media.rawg.io/media/screenshots/dc7/dc7f5a6d889b77c9da2dc0990d140e91.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 166, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["GCake", "icehunter"], "genres": ["Action", "Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}