{"id": 562536, "slug": "samurai-slasher", "name": "Samurai Slasher", "name_original": "Samurai Slasher", "description": "<p>Samurai Slasher is a fast-paced minimalistic local multiplayer fighting game about patience, timing, and reaction speed.</p>\n<p>Up to 4 players battle it out in an intense one-hit-kill free-for-all. First to win 3 rounds is declared the Shogun.</p>\n<p>Controllers are required to play. Button prompts are for XBox controllers.</p>\n<p>Controls</p>\n<ul><li>Left stick to move</li><li>Right trigger to dash attack</li><li>Left trigger to block</li><li>A, B, X, Y for duels (follow the prompt)</li><li>D-pad for emotes</li></ul>\n<p>How to Play</p>\n<ul><li>Eliminate other players by attacking them. Last player standing wins the round. First player to win 3 rounds is The Shogun!</li><li>Blocking an opponent's attack OR attacking each other at the same time causes you and your opponent to enter a duel.</li><li>In a duel, press A, B, X, or Y as soon as the button prompt shows up. First player to hit the prompt correctly wins the duel, killing their opponent.</li><li>Hitting a button before the prompt shows up OR hitting the wrong button loses you the duel!</li><li>Blocks and attacks use energy, which is represented by a bar around your character. Attacks require 100% energy, while blocks require 50%.</li><li>Killing an opponent instantly refreshes your energy to 100%. Use this to combo kills together!</li><li>Once only two players remain, energy recharge rate will steadily increase up to a cap. Take advantage of this by being aggressive and using your moves as soon as you have enough energy!</li></ul><p>Made by Andrew Knollmeyer, Max Fortna, and Anthony Scarangello.</p>", "metacritic": null, "released": "2021-02-20", "tba": false, "updated": "2021-02-22T11:09:58", "background_image": "https://media.rawg.io/media/screenshots/ef1/ef17ba5897d83b43aae56d6211649c25.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 14, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["Andrew Knollmeyer"], "genres": ["Fighting"], "publishers": [], "esrb_rating": null}