{"id": 56263, "slug": "x-men-legends-2-rise-of-apocalypse", "name": "X-Men Legends II: Rise of Apocalypse", "name_original": "X-Men Legends II: Rise of Apocalypse", "description": "<p>X-Men Legends II: Rise of Apocalypse is an action role-playing game developed primarily by Raven Software and published by Activision. It is the follow up to 2004&#39;s X-Men Legends. It was released in September 2005 for the GameCube, Microsoft Windows, N-Gage, PlayStation 2, PlayStation Portable and Xbox. It is set after the events of X-Men Legends and features the mutant supervillain Apocalypse as the primary antagonist.<br />\nThe developers intended the game to have a greater sense of scale than its predecessor, and writers created a story where the villains known as the Brotherhood of Mutants would need to ally themselves with the heroic X-Men to defeat a greater threat. High quality cinematics were created by Blur Studio. Online multiplayer was also added.<br />\nThe game was well received by gaming critics on all platforms. Critics felt that the inclusion of online play, additional mutant powers, and a larger cast made the game an improvement over its predecessor. Some reviewers were critical of the game&#39;s voice acting and felt that the gameplay was repetitive. It sold enough copies to be added to the budget line known as PlayStation 2&#39;s Greatest Hits.</p>", "metacritic": 81, "released": "2005-09-20", "tba": false, "updated": "2024-04-15T22:26:36", "background_image": "https://media.rawg.io/media/games/ca2/ca2ca06fec7678ad81c6116455c655a4.jpg", "website": "", "rating": 4.11, "rating_top": 4, "added_by_status": {"yet": 9, "owned": 24, "beaten": 59, "toplay": 16, "dropped": 30, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 65, "suggestions_count": 565, "game_series_count": 19, "reviews_count": 66, "platforms": ["PlayStation 2", "PC", "GameCube", "Xbox", "PSP"], "developers": ["Raven Software", "Beenox", "Vicarious Visions", "SuperVillain Studios", "Barking Lizards"], "genres": ["Action", "RPG"], "publishers": ["Activision Blizzard", "Activison"], "esrb_rating": "Teen"}