{"id": 562627, "slug": "adventures-demo", "name": "Adventures Demo", "name_original": "Adventures Demo", "description": "<p>Welcome to a new 2D adventure! In this new platform game, you will get a challenging experience with classic pixel art graphics from the 90s consoles with the current 16: 9 widescreen format, in addition to the fact that the music is amazing and very nostalgic along with its effects of 8-bit type sound, in addition to a very comfortable gameplay and giant levels through which you will find different challenges</p>\n<p><strong>-</strong> Explore all levels to find new secrets, items and challenges to face<br/><strong>-</strong> Obtain and unlock all the powers to make your character more powerful and invincible<br/><strong>-</strong> Clean, brightly colored Pixel Art in modern 16: 9 widescreen format<br/><strong>-</strong> 8-bit music and effects for pure nostalgia<br/><strong>-</strong> Support for any type of controller with XInput support or Xbox Control compatible with Windows</p>\n<p><strong>System Requirements:</strong></p>\n<p><strong>Operating System:</strong> Windows 7/8 / 8.1 / 10<br/><strong>Processor:</strong> 2.0 GHz or faster<br/><strong>Memory: </strong>2GB RAM<br/><strong>Video Card:</strong> 128 MB VRAM<br/><strong>Hard Drive:</strong> 200 MB Free Space<br/><strong>DirectX:</strong> Version 9<br/><strong>Optional:</strong> XInput controller or Xbox controller compatible with Windows</p>\n<p><strong>NOTE: </strong>Thanks for downloading the game! This video game is still in full development and some bugs are still being corrected and more functions will be added, but it will be completed as quickly as possible so that its release date is in 2021, so if you liked the game, give a review and continue This account to be aware of the news about its development and possibly its future release date, and the latter is optional but it is worth mentioning it, you can collaborate economically to support and give more publicity to the game on different sites and at the same time speed up your developing. With all that said, thank you and have a nice day.</p>\n<p>\n</p>", "metacritic": null, "released": "2021-02-20", "tba": false, "updated": "2021-02-22T11:31:55", "background_image": "https://media.rawg.io/media/screenshots/fc4/fc43b676cefc2b9c5b83a9e64310dbab.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 121, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["DR Games"], "genres": ["Action", "Platformer"], "publishers": [], "esrb_rating": null}