{"id": 562834, "slug": "toxic-frenzy", "name": "Toxic Frenzy", "name_original": "Toxic Frenzy", "description": "<p><strong>THE GAME</strong><br/>\n</p>\n<p>Twas the night before Christmas, when all through the FREEZE64 house, not a creature was stirring, not even a mouse. The stockings were hung by the chimney with care, in hopes that St Nicholas soon would be there.</p>\n<p>When out in the house there arose such a clatter,<br/>Vinny sprang from his bed to see what was the matter.<br/>Away from a leaking pipe he flew in a dash,<br/>grabbed a safe bucket and ran in a flash.</p>\n<p>He sprang to his feet, with bucket in hand,<br/>and caught each drop of fluid where he stands.<br/>But I heard him exclaim, \"but Where does it go?!\",<br/>as he exits the house and poured it below.</p>\n<p><strong>PLAYING THE GAME</strong><br/>TOXIC FRENZY has hit the FREEZE64 house on Christmas eve, and only Vinny and Frank can save FREEZE64 from the leaking pipe of doom. <br/>Control Vinny with Joystick in port 2 and use your toxic-proof container to collect the leaking fluid from the damaged pipe above. Your container can only hold up to 3 drops of toxic fluid at once, and any more than 3, your container will overflow. So don't let a single drop hit the floor of the FREEZE64 office, otherwise it will cause havoc on Christmas eve and put the whole future of FREEZE64 in jeopardy - and we don't want that do we! Once you've collected some of the fluid, dash towards one of the two exits where you can pour out the oozing fluid and, hopefully, Frank will be waiting below to collect and safely dispose of it in a responsible manner. Be careful not to pour the toxic fluid over Tracy or Jason who are standing directly below each exit and panicking in a total, toxic frenzy!</p>\n<p><strong>CONTROLS</strong><br/>Use Joystick in Port 2 on your Commodore 64 or Emulator<br/></p>\n<p><strong>CREDITS</strong><br/>Developed by Blue Bilby <br/></p>\n<p>Published by Blue Bilby and FREEZE64 'zine</p>\n<p>Programming &amp; graphics &amp; level design by Jason 'WauloK' Oakley</p>\n<p>Additional programming &amp; assistance from Old Skool Coder</p>\n<p>Music &amp; sound effects by Michael Richmond</p>\n<p>Game testing, suggestions and support from Vinny Mainolfi</p>", "metacritic": null, "released": "2021-02-20", "tba": false, "updated": "2021-02-22T12:29:51", "background_image": "https://media.rawg.io/media/screenshots/6d2/6d24a83d317590585f64104cd5b48ae9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 46, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["WauloK"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}