{"id": 562944, "slug": "woobin-dub", "name": "Woobin Dub", "name_original": "Woobin Dub", "description": "<em>Act I</em>\n<p>You are surrounded by darkness. All concentration goes into memorizing the right tones. The costume itches. You hear the crowd chanting... maybe it's booing, doesn't matter. The sound of sweat dropping from your coworkers forheads on the ground as they sweat in their prop-costumes brings you back to reality. </p>\n<p>Suddenly the curtain starts moving. It's happening. The spotlight finds its way through the curtain right onto your face. It's getting hot. The costume still itches. You are blinded by the light. As your eyes slowly adapt you can see the crowd doing standing ovations... maybe they are leaving, doesn't matter. The piano starts playing. It's showtime!</p>\n<em>Act II</em>\n<p>Give your best to hit the tones at the right time. The crowd is throwing roses... maybe they are tomatoes, doesn't matter. Try to move around them. No need to get them stuck in the costume, it's already itching enough.</p>\n\n\r\nControls:\r\n<p>[A] [D]  /  [&lt;-] [-&gt;]:   To move left/right</p>\n<p>[Any Key other than the above]:   Sing</p>\n\n<p>Everything in this game is done by myself. Also the great background music, I am definitely a professional musician.</p>\n<p>Game was created in 4 days for the ScribbleJam, February 2021. <strong>Theme</strong>: Scribble / Doodle. <strong>Challenge</strong>: All text in your game must be a made up language.</p>", "metacritic": null, "released": "2021-02-19", "tba": false, "updated": "2021-02-22T12:59:48", "background_image": "https://media.rawg.io/media/screenshots/0e9/0e9ece4a3e4c5a6b3b8e7a36c9b21492.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 48, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["made3"], "genres": [], "publishers": [], "esrb_rating": null}