{"id": 563288, "slug": "togum", "name": "TOGUM", "name_original": "TOGUM", "description": "- Life starts with an egg .. and it can also end because of it.<br/><br/><strong>TOGUM</strong> is an Action RPG divided by chapters that takes place in Brazil in the near future. Created in the laboratory, TOGUM are the result of a genetic experiment that escaped their laboratory. As they reproduce quickly, in a few days, there were millions of them all over the country. Without having time to create a strategy and as they are extremely violent, it is believed that TOGUM ended up killing at least 90% of the Brazil's population, the other countries's situation is unknown.<br/><br/>You take control of the young Marshal <strong>Dante Masamune</strong>, the only human being who, by accident, became a human-togum hybrid, a fact that gave him superhuman strength and abilities. Now he, his childhood friend <strong>Nicole</strong> and his friend <strong>Danielle</strong> , go on missions together trying find who was responsible for all this and end up discovering that this is the last chance of humanity to save itself ..<br/><br/>Or they all come together ... or they will all perish.<h3>EPISODES</h3><br/>After purchasing the game, all other episodes of the main plot will be released for free as soon they are released. The game will update automatically and we will keep the players informed on our social media and on the Steam community.<br/><br/><h3>FEATURES</h3><br/>Features avaiable:<br/>* Play with 4 characters with different playing styles, camera and skills.<br/>* Inventory System.<br/>* Get raw materials to create clothes, armor, items and weapons in the next episodes.<br/>* Explore the maps and find hidden items, secret codes and more.<br/>* Your <strong>choices</strong> will affect the game's story<br/>* Craft your weapons and armor. <br/>* Possibilities of romance that will affect the whole game's story. (And maybe it's future)<br/>* Use vehicles like motorcycles, and even war tanks.<br/><br/>* Made mostly by just one person.<br/><br/>* Find out what really happened and be part of TOGUM's history!", "metacritic": null, "released": "2021-02-22", "tba": false, "updated": "2021-02-26T02:39:18", "background_image": "https://media.rawg.io/media/screenshots/71c/71c93605e5018bff1b68021bf893ba92.jpg", "website": "https://www.guaiamustudio.com.br/togum", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 532, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Guaiamu Studio"], "genres": ["Action", "RPG", "Indie"], "publishers": ["Guaiamu Studio"], "esrb_rating": null}