{"id": 563343, "slug": "football-betting-zu-cai-shang-an-ji", "name": "Football Betting 足彩上岸记", "name_original": "Football Betting 足彩上岸记", "description": "I was obsessed with football betting for a period of time. This game is to commemorate that period of time, let everyone understand the basic process of football betting, and at the same time warn everyone of the risk about gambling through this game.<h3>Features</h3><br/> ★This game shows the basic game flow of football betting, and includes both the real game simulation and fast game simulation, to try to simulate the real football game.<br/> ★This game contains 3 leagues, 60 teams and 900 players. The difference in tactical styles and player stats of different teams increases the unpredictability of football match results<br/> ★This game uses a time-advanced game process. Players need to pay off their debts and additional interest to the creditor through football lottery and work within one year.<h3>Suitable Players</h3><br/> ★Players who are interested in football betting or have some experience in football betting.<br/> ★Players who want to test their luck.<br/> ★ Players who want to quit gambling.<h3>Not Suitable For Players</h3><br/> ★Players who want to use it to generate real-world football match results.<h3>Ps</h3><br/>  This work is still under development, and some functions on Steam will be gradually improved in the future. If you have any suggestions or bugs, please contact the developer (see \"Early Access\").", "metacritic": null, "released": "2021-02-24", "tba": false, "updated": "2021-02-26T03:20:06", "background_image": "https://media.rawg.io/media/screenshots/bfe/bfe78c2dbe6d7903a23b0678301f296f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 121, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["shunYing"], "genres": ["Strategy", "Simulation", "Sports"], "publishers": ["shunYing"], "esrb_rating": null}