{"id": 563346, "slug": "cold-breath-2", "name": "Cold Breath", "name_original": "Cold Breath", "description": "Cold, wolves, bears and more.A struggle for survival in the north of Norway.<br/>Improve your skills and fight the challenges in this nature!<br/><br/><br/><br/><strong>Realistic Open World</strong><br/><br/>As you grapple with the freezing cold, you are also faced with the wild nature.<br/>While struggling with hunger and thirst, you have to collect wood and coal and burn a fire to warm up.<br/>Homes are warm and safe. search the cabinets and collect materials.<br/><br/><strong>Hunting</strong><br/>You can hunt bear, wolf and deer with a rifle or bow, cook and eat their meat.<br/>The rifle and bow can be found by researching the land or houses.<br/><br/><strong>Regions</strong><br/><br/>8 square kilometers of vast land and many regions await you to investigate.<br/>Can visit homes You can burning  a fire and cook meat or mushrooms whenever you want.<br/><br/><strong>Key Features</strong><br/><br/><ul><li>If you stay in extreme cold, make a fire or enter a house to avoid hypothermia.</li></ul><ul><li>fish by breaking ice in a frozen lake and Quench your hunger by cooking over the fire</li></ul><ul><li>If you get sick your fitness will decrease and will not increase.</li></ul><ul><li>Various improvements can be made in the game, you can produce a fishing rod.</li></ul><ul><li>Collect and cook mushrooms will Quench your hunger</li></ul><ul><li>Watch the story of the northern lights emerging at night.</li></ul><ul><li>Activities have an impact on food, water, temperature and health values.</li></ul><ul><li>A beautiful realistic open world with many views with the best graphics</li></ul>", "metacritic": null, "released": "2021-02-24", "tba": false, "updated": "2021-02-26T03:22:12", "background_image": "https://media.rawg.io/media/screenshots/d2b/d2bb9247c7803ee3e4ae348418cba3ac.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 387, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["celikgames"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["celikgames"], "esrb_rating": null}