{"id": 563391, "slug": "horror-bar-vr", "name": "Horror Bar VR", "name_original": "Horror Bar VR", "description": "<h3>🍹 FEATURES 🍹</h3>💀 Top-notch graphic design - making the zombie world fun and attractive<br/>💀 Complex interactions with the clients - based on well-prepared and customized animations with real clients’ reactions to the player’s behavior<br/>💀 Well-composed soundtrack made by highly-acclaimed composer Mikołaj Stroiński - the rhythm and pace of the music progress as you progress through the game<br/>💀 Dynamic gameplay boosted by custom-made sound effects<br/>💀 Universal artificial language of zombies designed especially for players’ entertainment<br/>💀 Skill &amp; Fun - achieve the best possible results discovering new mechanics and dishes, try not to fail, earn money, get rid of bats, spiders, but most of all... have some fun<br/>💀 Unlock new mechanics, dishes, and characters as you progress through new levels<br/>💀 Serve disgusting dishes and confront with zombies’ fail or success reaction<br/>💀 Mess up with zombie-client with unique items such as the baseball bat. <br/><h3>🍹 SUMMARY 🍹</h3>💀Taking on the role of a bartender in the Horror Bar simulator you will be serving among other horrifyingly delicious full blood drinks, using 3 different mixing methods.<br/><br/><br/>💀To face the appetite of your guest coming into your bar, you will be creating some gruesome dishes! Chop gluttonous monsters living at the bottom of the aquarium, fry cut fingers as french fries, but also take care of serving properly fried steaks from meat of an unknown source...<br/><br/>💀Beware! You may also be up for a challenge to cook a meal from dead rats, which are considered a real yummy delicacy here.<br/><br/>💀With each level you will immerse yourself in the more and more incredible atmosphere of the game. You will also get to learn more interesting techniques to serve even more zombies coming into your bar.<br/><br/>💀Thanks to stationary nature of the game - gameplay is 100% free of dizziness, sickness or headaches.<br/>", "metacritic": null, "released": "2021-02-25", "tba": false, "updated": "2021-02-26T03:55:36", "background_image": "https://media.rawg.io/media/screenshots/0c1/0c18d2f762431c2b76e86247e999a09c.jpg", "website": "https://www.horrorbarvr.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 10}, "playtime": 3, "achievements_count": 17, "ratings_count": 1, "suggestions_count": 560, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["VR Factory"], "genres": ["Simulation", "Indie"], "publishers": ["VR Factory"], "esrb_rating": null}