{"id": 563303, "slug": "battleship-apollo", "name": "BATTLESHIP APOLLO", "name_original": "BATTLESHIP APOLLO", "description": "Two hundred years have passed since the beginning of colonization and the events of Hades' Star. The Hades Galaxy is now more unstable than ever.<br/><br/>Obsessed with being the first to uncover the deepest secrets of the Universe, the Corporations are spending vast resources to gain the slightest technological advantages.<br/><br/>Massive Battleships, bigger than anything seen before, are being built in shipyards all around the Galaxy.<br/><br/>As one of many Battleship Commanders, you have a critical role to play in the War ahead.<h3>Game Description</h3><br/>In BATTLESHIP APOLLO, you create your Battleship and equip it by choosing among countless of options for weapons, support fighters, and other special abilities. You will bring your Battleship to combat in a variety of scenarios, from single player to massively multiplayer arenas. Your daily combat efforts will add up to significant rewards over time, with new areas, new Battleships, new abilities and special events making themselves available as you progress. <br/><br/><br/><br/>BATTLESHIP APOLLO respects your time, with instant load times and quick combat that usually resolves within a few minutes. At the same time, it allows you to spend as much time as you want in the game, without artificial progress walls. We have taken special care to remove superfluous RTS elements, while still keeping what's important to maintain tactical depth. <br/><br/><h3>Features</h3><br/><ul><li> Build massive Battleships, each with their own special ability, and customize them with countless options for weapons and modules.<br/></li><li> Pick from numerous units and strategies to achieve victory in diverse combat situations, from single player levels to massively multiplayer arenas.<br/></li><li> Make visible progress with your fleet and technology over weeks, months and years.<br/></li><li> Organize with other players in Corporations to share knowledge and participate in regular events together.<br/></li><li> Play at your own pace: Nobody will unfairly steal your resources or progress while you are offline.</li></ul><br/>", "metacritic": null, "released": "2021-02-22", "tba": false, "updated": "2021-11-05T05:31:44", "background_image": "https://media.rawg.io/media/screenshots/e34/e34140eb1e9ce454855238b1eac9ede3.jpg", "website": "https://www.battleship-apollo.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 257, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "iOS"], "developers": ["Parallel Space"], "genres": ["Strategy", "Simulation", "Massively Multiplayer", "Indie"], "publishers": ["Parallel Space"], "esrb_rating": "Everyone 10+"}