{"id": 563389, "slug": "yi-shi-jie-gong-lue-zu-isekai-team", "name": "异世界攻略组 Isekai Team", "name_original": "异世界攻略组 Isekai Team", "description": "___________♦The game story♦___________<br/>\r\n♦ In the  countless different world, there are some of the Isekai world because of the appearance of\" devil \", the world is the world of its control over all the world of the ancient god is identified as \"abnormal\", The ancient gods will use the power of erosion to destroy the Isekai world to prevent abnormal expansion, But the inhabitants of this Isekai world are obviously innocent.<br/>\r\n♦ As The new spokesman of god, you will lead the Isekai team to solve the \"abnormal\" crisis in each Isekai world, under the guidance of your predecessors (maybe), and stop the destruction of the Isekai world by the forces of erosion.<br/>\r\n♦ And as you continue your journey through the Isekai world, you find yourself opening Pandora's box...<br/>\n<br/>\r\n___________♦The game features♦___________<br/>\r\n♦ Fierce real-time combat, hone your strength in the world tour, and challenge more and more powerful enemies.<br/>\r\n♦ Random and changeable levels (Roguelike) , rich and spacious scenes, flexible to deal with different scenes of random enemies and machines, as well as the bad weather may appear at any time.<br/>\r\n♦ Rich and random weapon types and weapon skills, get the right weapon to crush the enemy, search the Isekai world for more powerful weapons.<br/>\r\n♦ Unlock unique new characters. Gold earned through combat unlocks each character in the group, each with its own unique talent and hidden characters waiting to be unlocked.<br/>\r\n♦ Multiple level events. Explore the random level events scattered around the level, and it pays off in a variety of ways.<br/>\r\n♦ Adjustable strategy difficulty. The yggdrasil system in the divine world adjusts the difficulty of your Isekai world journey through the buffs and debuffs.<br/>\n<br/>\r\n___________♦Update plan♦___________<br/>\r\n♦ Complete the development of story mode and experience the complete main plot.<br/>\r\n♦ Multiplayer online gameplay is planned", "metacritic": null, "released": null, "tba": false, "updated": "2021-02-26T03:53:34", "background_image": "https://media.rawg.io/media/screenshots/fa0/fa0d1f4ef3c664f19eb6de362dddcb42.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 297, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Illusion of Soul"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Illusion of Soul"], "esrb_rating": null}