{"id": 563326, "slug": "josh-journey-darkness-totems", "name": "Josh Journey: Darkness Totems", "name_original": "Josh Journey: Darkness Totems", "description": "<strong>UNVEIL THE POWER OF FOUR BRAVE HEROS IN A HAND DRAWN COUCH CO-OP JOURNEY!</strong><br/><br/><strong>Josh Journey: Darkness Totems</strong> is a hand drawn beat’em up game about four brave heroes, that use their skills to defeat the Nightmare Monsters using special combo attacks in a co-op gameplay.<br/><br/><br/><br/><br/><br/><strong>The Province World</strong> is infested by the nightmare monsters from <strong>the Dream World.</strong> <strong>The Darkness Shadow,</strong> the entity that controls the Dark Side of Dreams, are sending his creatures and implanting <strong>Darkness Totems</strong> to control the four main provinces: <strong>Wind, Water, Desert and Industrial.</strong> The main objective of our heroes are to fight against these evil forces, destroying the Totems to bring again the peace and harmony to their World.<br/><br/>Each hero in Josh Journey has unique skills, to attack face to face, using sword or hammer, or to attack from distance, using magic or gunfire. You can choose between four heroes during a local gameplay with your friends!<br/><br/><br/><br/>– <strong>Swap Heroes quickly</strong> during gameplay, providing <strong>Massive Combos</strong> in battle!<br/><br/>– All characters with traditional <strong>2D hand-drawn animation!</strong><br/><br/>– Build <strong>Ability Board</strong> to make special attacks during the battles.<br/><br/>– Explore beautiful and big environments with great parallax in different provinces, like<br/><strong>Wind, Water, Desert and Industrial.</strong><br/><br/>– A huge cast of <strong>cute and creepy enemies</strong> with different behaviors and attacks.<br/><br/>– Epic battles with <strong>Big Bosses.</strong><br/><br/> <br/><br/><strong>Josh, the Swordsman,</strong> uses the wind element. He has great dexterity, favoring quick, decisive strikes and the ability to quickly navigate his environment. He is particularly capable in aerial combat.<br/><br/><strong>Melina, the Sorceress,</strong> uses the water element. She is a slight twist on the arcanist archetype, having impressive, long-ranged projectiles and diminishing her foe’s capacities. She adds to that powerful crowd control capacities, and optional support powers.<br/><br/><strong>Farquol, the Nomad,</strong> uses the earth element. He is a tough hero who is part of a mystical and tribal community. His strikes, however, tend to be slower and harder to hit, packing a larger wallop as a counterpoint.<br/><br/><strong>Z.O.Z., the Multitask Robot,</strong> uses the fire element. He presents a wide range of skills, such as explosive long-distance projectiles and bombs, that sways between violent means and the smart usage of props and hazards.", "metacritic": null, "released": "2021-02-23", "tba": false, "updated": "2021-02-26T03:10:33", "background_image": "https://media.rawg.io/media/screenshots/0c4/0c443f075f2f10be795e8d8ad5bed6f2.jpg", "website": "http://provincia.network/joshjourney/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 346, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Provincia Studio"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Provincia Studio"], "esrb_rating": null}