{"id": 563332, "slug": "collapse-a-political-simulator", "name": "Collapse: A Political Simulator", "name_original": "Collapse: A Political Simulator", "description": "<h3>Collapse: A Political Simulator </h3><ul><li>is a grand strategy game that takes place in 1992-2004. You take lead of your own Party in the face of the total devastation of one of the fictional post-Soviet states in Europe. Try to realize your (or someone else's) political dreams in the shaky arena of this dilapidated situation. But first, you should at least get some important state positions, or do you want to stay in the opposition all your life without seeing the \"captivating star of happiness\"?</li></ul><h3>Features</h3><ul><li> Immerse yourself in the seething cauldron of politics in a fictional post-Soviet republic from 1992 to 2004.<br/></li><li> Lead one of 7 political parties, compete for power with others and solve internal conflicts.<br/></li><li> Take the reins of government, lead the young republic in this turbulent time, or criticize the government while being in the opposition.<br/></li><li> Determine the internal and external course of your country, balance between different groups and world leaders.<br/></li><li> Look for ways out of the economic and political crisis, while not completely losing the support of the population and state elites.</li></ul><h3>Or maybe the time has come for the state to become You?</h3><h3>Well, try it!</h3>", "metacritic": null, "released": "2021-02-23", "tba": false, "updated": "2021-02-26T03:14:10", "background_image": "https://media.rawg.io/media/screenshots/625/6258516fc8a1941da618f8d0ad07f5ba.jpg", "website": "http://kremlingames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 13, "beaten": 1, "toplay": 1, "dropped": 1}, "playtime": 4, "achievements_count": 76, "ratings_count": 1, "suggestions_count": 177, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "macOS", "Linux"], "developers": ["Kremlingames"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["Kremlingames"], "esrb_rating": null}