{"id": 563446, "slug": "bee-day", "name": "Bee Day", "name_original": "Bee Day", "description": "<p><em>It's Bee Day!</em></p>\n<p>The Queen has tasked you with collecting some sweet, sweet nectar to bring back to the hive, but there is a horde of bee-hating mountain critters that stand between you and the flowers. Use a small arsenal of heavy weaponry to take those varmints out and claim that nectar!</p>\n<p>How many days in a row can you bring glory and nectar to your hive before being overrun by the growing horde? </p>\n<p>This is my first game! You can expect about as much content, polish, and replay-ability as an early 2000's flash game. I thoroughly enjoyed the process and look forward to creating new and more intricate games in the future! Thanks for playing!</p>\n<p><strong>Credits:</strong></p>\n<p>Made with Unity.</p>\n<p>I fully endorse the creators of all assets I used to create Bee Day. It was nice to find affordable, high-quality assets to use as I begin my career as a game developer, especially when my interest is primarily programming. Please check out their pages!</p>\n<p><strong>Art:</strong></p>\n<p>sanctumpixel - https://sanctumpixel.itch.io/ - Gives us the beautiful pixel art used to portray the players, enemies, and scenery. Bee Day was inspired by your excellent sprites and I love your work. Thank you!</p>\n<p>Mounir Tohami - https://mounirtohami.itch.io/ - Brought a free, retro suite of pixel-art-styled GUI elements to make the HUD really pop. Thank you!</p>\n<p>VladPenn - https://vladpenn.itch.io/ - Gives us a free, high-quality selection of weapon sprites used in the HUD and projectile sprites. Thank you!</p>\n<p>Tiny Worlds - https://assetstore.unity.com/packages/2d/fonts/free-pixel-font-thaleah-140059 - The font I used for that retro, 8-bit look for all text in the game. Thank you!</p>\n<p><strong>Sounds:</strong></p>\n<p>FeslianStudios - https://www.fesliyanstudios.com/ - Most sound effects in the game came from Feslian. They are very kind to allow any game developer to use their sounds for free. Thank you!</p>\n<p>FreeSoundLibrary - http://www.freesoundslibrary.com - For the bee buzzing sound effect. Thank you!</p>\n<p>MilkyTracker - https://github.com/milkytracker/MilkyTracker - The tracker I used to create the (very simple) soundtrack. For those wondering, the song is called \"Snappy Glass\" and I wrote it initially for a 2D RPG dream that maybe become a reality in the future.</p>\n<p><strong>Special Thanks:</strong></p>\n<p>Sebastian Lague - https://www.youtube.com/user/Cercopithecan - For teaching me the power of Raycasts for collision detection instead of Unity's built in physics. Sebastian is  an educator and is excellent at their craft. Thank you so much for your excellent content and for helping me become a better, more independent programmer.</p>\n<p><strong><em>Thank you for reading!</em></strong><br/></p>", "metacritic": null, "released": "2021-02-26", "tba": false, "updated": "2021-02-26T04:35:32", "background_image": "https://media.rawg.io/media/screenshots/1f7/1f70a8da54c1b3d3cf866c1a43bf73a1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 26, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["TheIndieDream"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}