{"id": 563448, "slug": "timejump", "name": "TimeJump", "name_original": "TimeJump", "description": "<p><strong>Introduction</strong></p>\n<p>This game takes the idea of a standard 2d platformer and turns it into a fun interactive party game! In this intense battle, players fight to be the last one alive.  The  screen might appear to be going slow at first, but don't get to comfortable because it will speed up, slow down and change direction.</p>\n<p><strong>Features / Goals</strong></p>\n<p>This project is still in development and will continue to regularly receive updates.  The section that follows this will cover some of the things our team has implemented along with some of our goals for those features. </p>\n<p><em>The Map</em></p>\n<p>This game features procedural map generation.  Our goal is to create premade chunks of varying difficulty that get randomly placed in throughout the map.  These chunks will be themed according to our four different map zones.  These zones are Sci-Fi, Medieval, Rainbow, Lava. The players will traverse through a zone travel through a portal and appear at a new setting.  </p>\n<p><em>Multiplayer</em></p>\n<p>Our goal is to turn the tradition platformer experience into a  exciting fast paced party game.  You will battle your friends to the death! You can push your friends into obstacles or out of the map to kill them and secure your self victory.  Each individual game will be about a five minute or less experience so if you die you will not be sitting out for long.  </p>", "metacritic": null, "released": "2021-02-26", "tba": false, "updated": "2021-02-26T04:35:54", "background_image": "https://media.rawg.io/media/screenshots/fa8/fa8f98102024cf55a2582aeb2fac9a8d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 32, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["superfallbros"], "genres": ["Action", "Platformer"], "publishers": [], "esrb_rating": null}