{"id": 563404, "slug": "the-lost-cube", "name": "The Lost Cube", "name_original": "The Lost Cube", "description": "The Lost Cube is a challenging platformer which takes inspiration from classic titles such as Super Meat Boy and Celeste.  The story unravels in a small village nestled somewhere in northern Europe. Each day, a special melody is played upon a magical guitar bringing prosperity upon the land. <br/><br/>One day the magical red cube that holds its power goes missing and it is the quest of one brave adventurer to retrieve it and restore life to his village. You play as Ulrik, a somewhat ordinary hero on a mission. You have no weapons, so you must jump or dodge your way out of trouble. Your agility will be tested to the limit as you face a barrage of enemies over 60 levels and 2 boss fights all the while constantly avoiding unforgiving traps. <br/><br/><br/><br/><br/><strong>Features</strong><br/>The Lost cube will test your patience as you navigate 60 handcrafted levels spread through a variety of seasons. Each season has its own unique theme and enemies which will prove to be an engaging challenge. You will need great focus and a hint of luck to avoid the enemies attacks and reclaim your village from its dismal state.<br/><br/><ul><li>Experience a change of pace and challenge yourself in endless-runner style gameplay.<br/></li><li>Collect achievements by collecting guitar picks, keeping your death count low, and speedrunning your way through the levels. <br/></li><li>Lose yourself in the ambience of a silent world as you face a variety of dynamic environments. <br/></li><li>Immersive atmospheric sound effects and warm guitar melodies. </li></ul>", "metacritic": null, "released": "2021-02-25", "tba": false, "updated": "2021-03-05T05:37:39", "background_image": "https://media.rawg.io/media/screenshots/707/70750f2969076eea6e94a8b15aeb7dc1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 7, "toplay": 1}, "playtime": 0, "achievements_count": 41, "ratings_count": 0, "suggestions_count": 95, "game_series_count": 0, "reviews_count": 0, "platforms": ["Xbox One", "PC", "PlayStation 4"], "developers": ["Red Mount Media"], "genres": ["Action", "Indie"], "publishers": ["JanduSoft"], "esrb_rating": null}