{"id": 563652, "slug": "heartbeat-singularity-demo", "name": "Heartbeat Singularity (DEMO)", "name_original": "Heartbeat Singularity (DEMO)", "description": "Introduction\r\n<p>Heartbeat Singularity is a slice of life with a hint of lore visual novel that follows Alyn, a journalist, as he travels to a mysterious city state, Terrace City. He is tasked to cover various stories of the city and find out what lies within it.</p>\n<p>This demo will cover the prologue and will have 6 possible outcomes. Each decision matters so choose carefully.</p>\r\nCharacters\r\n<ul><li><strong>Alyn (protagonist):</strong>  A meek journalist. He tries his best but most of the time, it's all up to lady luck on how his life turns out.</li><li><strong>Anson: </strong>A local that works in a tucked away book café. He appears intimidating but maybe there's something more underneath that facade.</li><li><strong>Eva:  </strong>A young professor and one of the city's top contributors. She's always welcoming to those that seek knowledge but it's best to tread carefully.</li><li><strong>Robin:</strong>  A friendly local. She's always smiling and is the biggest ball of energy, but is she really?</li></ul>\r\nDev Note\r\n<p>Thank you very much taking a look at this visual novel! Heartbeat Singularity is a small solo project I started for fun and to try a hand at writing, worldbuilding and making full illustrations. Currently, I'm working on a more polished release of the visual novel with better CGs, backgrounds and hopefully some custom music! This demo will just be a sneak peak and a brief introduction to the characters and, with the right choices, some of the world lore.<br/></p>\n<p>Feel free to follow this page or go to the following links to stay up to date with the project's progress:</p>\n<p>Tumblr || Twitter thread</p>", "metacritic": null, "released": "2021-02-25", "tba": false, "updated": "2021-02-26T05:29:22", "background_image": "https://media.rawg.io/media/screenshots/6dc/6dcfab2d835f8c224d215bde0f743956.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 180, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Deen Kei"], "genres": [], "publishers": [], "esrb_rating": null}