{"id": 563828, "slug": "50-bits-pieces-an-msvu-art-gallery-retrospective", "name": "50 Bits & Pieces: An MSVU Art Gallery Retrospective", "name_original": "50 Bits & Pieces: An MSVU Art Gallery Retrospective", "description": "<p>December 12, 2021 will mark the 50th anniversary of the opening of MSVU Art Gallery in its dedicated space in Seton Academic Center on the campus of Mount Saint Vincent University. To celebrate and reflect, we will spend this year exploring and interrogating the gallery’s past. A major part in this endeavor is a new exhibition, <em>50 Bits and Pieces: an MSVU Art Gallery Retrospective.</em> With the support of an Arts Nova Scotia Commission Grant, Lisa Bouraly and David Clark, two collaborators invested in archives and digitization, were invited to scour the MSVU Art Gallery archives—media holdings, exhibition files, catalogue collections, collections, and other historical records—to find out what it said about the gallery’s history. Culled from more than 700 exhibitions, 1000 workshops, and 800 objects in the collection, <em>50 Bits and Pieces </em>presents 50 unique yet illustrative moments from MSVU Art Gallery’s past. \r\n  </p>\n<p>The original exhibition was to open in the fall of 2020, however, the global COVID-19 pandemic forced a change in plans. The exhibition was moved to the fall of 2021 and this extended timeline presented an opportunity for new ways to engage with the archival material. The result is an online interface, created by David, that offers a preview of “bits and pieces” selected by Lisa from the archive. Each month until October 2021, five moments from the Art Gallery’s history will be added to the interface in the form of digital collages, including passages and excerpts from documents, speeches, research notes, exhibition installation photographs, videos, and media coverage. In November, the culmination of these 50 moments and their corresponding archival material will be adapted into an immersive installation at the gallery, commemorating its 50th anniversary.\r\n      </p>", "metacritic": null, "released": "2021-02-24", "tba": false, "updated": "2021-02-26T06:18:02", "background_image": "https://media.rawg.io/media/screenshots/edb/edb0a0cf59a41118538f39949deceb93.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 54, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["David Clark 5"], "genres": [], "publishers": [], "esrb_rating": null}