{"id": 5640, "slug": "resistance-2", "name": "Resistance 2", "name_original": "Resistance 2", "description": "<p>Resistance 2 is a sci-fi first-person shooter developed by Insomniac Games. It is the second part of the Resistance trilogy.</p>\n<h3>Plot</h3>\n<p>The game takes place right after the ending of Resistance: Fall of Man. Nathan Hale wanders somewhere in a snowy forest after the destruction of an alien tower in London. Suddenly, a black ops squad finds him. They put their guns up on the protagonist and demand that Hale goes with them. At first, Nathan wants to blow himself and all the soldiers up with a grenade, but changes his mind and complies. His fight against the alien Chimeras continues.</p>\n<h3>Gameplay</h3>\n<p>Resistance 2 is mainly a singleplayer game. Many weapons from Fall of Man were reused, with several new additions such as the Marksman and a minigun. The game is based in the 1960s, so the weapons resemble a mix between the common weaponry of the time and advanced alien tech. Unlike the first game, the players can only carry two weapons at all times. </p>\n<p>Resistance 2 goes away from the health bar system in favor of regenerative health. That means that now the players have to stick to cover when their health is low to regenerate it.</p>\n<h3>Multiplayer</h3>\n<p>A multiplayer mode is also present in the game. However, there is no cooperative play in the singleplayer campaign. </p>\n<p>There are two multiplayer variations: a separate co-op campaign and a competitive one. The game was praised for having up to 60 players in one competitive session and up to 8 in a cooperative mode.</p>", "metacritic": 87, "released": "2008-11-04", "tba": false, "updated": "2024-03-09T21:57:25", "background_image": "https://media.rawg.io/media/games/76c/76c2e0c8186879e159fcd1ac72f12aa5.jpg", "website": "http://www.us.playstation.com/PS3/Games/Resistance_2", "rating": 3.65, "rating_top": 4, "added_by_status": {"yet": 35, "owned": 634, "beaten": 182, "toplay": 41, "dropped": 38, "playing": 2}, "playtime": 10, "achievements_count": 30, "ratings_count": 193, "suggestions_count": 678, "game_series_count": 4, "reviews_count": 195, "platforms": ["PlayStation 3"], "developers": ["Sony Interactive Entertainment", "Insomniac Games"], "genres": ["Action", "Shooter"], "publishers": ["Sony Computer Entertainment"], "esrb_rating": "Mature"}