{"id": 564222, "slug": "pyro-man", "name": "Pyro Man", "name_original": "Pyro Man", "description": "<p><strong>Francais / French :</strong></p>\n<p>C'est un jeu inspiré des jeux d'arcade de l'époque (avec les mêmes graphisme, le même gameplay et autres...). Le but est d'avoir le meilleur score possible et pour gagner un maximum de points il faut détruire cet immeuble infini.Pour cela il va d'abord commencer à détruire étage par étage, et pour détruire un étage il faut le bruler entièrement. Attention, des habitants de cet immeuble possèdent des extincteurs capables d'éteindre le feu, pour éviter ce genre de personne il faut poser un incinérateur devant leur appartement. Bien évidemment ce ne sera pas aussi simple, vous avez une jauge qui se vide quand vous crachez du feu ou quand vous posez des extincteurs, pour la reremplir il faudra soit détruire un étage entier soit trouver des appartements spéciales qui vous rempli votre jauge si vous le brûlez. Pour garder l'esprit \"jeu d'arcade de l'époque\" je ne vais pas donner plus d'informations, à vous de trouver les meilleures techniques pour avoir le plus de points !</p>\n<p><strong>Anglais / English :</strong></p>\n<p>It is a game inspired by arcade games of the time (with the same graphics, the same gameplay and others ...). The goal is to have the best possible score and to gain as many points as possible you have to destroy this infinite building. For that he will first start to destroy floor by floor, and to destroy a floor it must be burned entirely. Attention, the inhabitants of this building have extinguishers capable of extinguishing the fire, to avoid this kind of person it is necessary to put an incinerator in front of their apartment. Obviously it will not be so simple, you have a gauge that empties when you spit fire or when you put fire extinguishers, to refill it you will have to either destroy an entire floor or find special apartments that will fill your gauge if you burn it. To keep the spirit of the \"arcade game of the time\" I will not give more information, it's up to you to find the best techniques to get the most points!</p>\n<p><strong>Boutons / Buttons :</strong></p>\n<p>--&gt; : Aller à droite / Go right</p>\n<p>&lt;-- : Aller à gauche / Go left</p>\n<p>Space : Brûler / Burn</p>\n<p>Shift : Placer un incinérateur / Place an incinerator</p>\n<p>(CHEAT) Numpad 5 : Redémarrer le jeu / Restart the game</p>\n<p>(CHEAT) Numpad 8 : Augmenter de 1 la jauge / Increase the gauge by 1</p>", "metacritic": null, "released": "2021-02-23", "tba": false, "updated": "2021-02-26T08:10:34", "background_image": "https://media.rawg.io/media/screenshots/e7f/e7f10c64f74f2eb6d01d3e93ca42cd90.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 36, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Nessymixj"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}