{"id": 564495, "slug": "street-fighter-nft-game", "name": "Street Fighter NFT Game", "name_original": "Street Fighter NFT Game", "description": "<p>**WELCOME TO THE YINYANG DISCORD STREET FIGHTER WAX GAME**</p>\n<p>**First thing is first, in order to play you must own Street Fighter Wax NFTs**<br/>**This is an interface based off of the google sheets located at the link below**<br/>https://docs.google.com/spreadsheets/d/1Iduaejii2BiHk92rwPBqm6kJfG8hi7eIMmnWQ08d...</p>\n<p>**Pick your chosen Street Fighter NFT to battle for round one and select them under the character drop-down, also select the NFTs power score and rarity**</p>\n<p>**Now upgrade your base stats according to the rules based on your rarity and power score**</p>\n<p>**Upgrading Rules**</p>\n<p>With the cards Power Score, the player can evenly distribute it to any stats (Ex. if the player has a power score of 3 they have 3 stat points they can distribute to any of the 5 main stats)</p>\r\nRarities determine the max you can put into one single statBase - 1Foil - 2Battle - 3Weld - 4Action - 5CE - 5 plus 1 extra pointFor example, if you have a PS3 Base you have 3 points to disperse between the character's stats, but you can only ever put a max of 1 into each stat. (Ex. 1 in power, 1 in health, and 1 in mobility)If you have a PS4 Foil though you can do something like (Ex. 2 in power and 2 in health)\r\n\n<p>**Recommend flipping a coin to determine who will assign stats first**</p>\n<p>**Once both players have picked there NFT and stats are finalized you are ready to begin the game and hit the \"Finalize\" button**</p>\n<p>**Player with the highest mobility will go first each round, if mobility is the same the person then the person to go first will be chosen at random**</p>\n<p>**Based on who goes first, you can take turns rolling the dice, for this game at the moment you will need one person to pull it up and share their screen with you. You can let them know what Street Fighter character, PS (power score), and rarity you have as well as let them know how you want to distribute your stats**</p>\n<p>**After you roll the dice, the damage will be calculated automatically. Damage calculation is as follows: (roll * power) + (techniques + range)**</p>\n<p>**First to get the other player to 0 health or below wins!!**</p>\n<p>**You can repeat this process and do best of 3, but if you do this it may be fair to not be able to choose the same NFT you own more than once**</p>\n<p>**If any wagers take place, like whoever wins has to send a build card to the other player, I will be the middleman if needed feel free to join the discord: https://discord.gg/55x8s5kx9u**</p>\n<p>**As always enjoy and have fun!**</p>", "metacritic": null, "released": "2021-02-22", "tba": false, "updated": "2021-02-26T09:21:42", "background_image": "https://media.rawg.io/media/screenshots/88a/88a7a1b7080af4c8f8a5d2c879db8ccd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 8, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["yinyangbreaks"], "genres": [], "publishers": [], "esrb_rating": null}