{"id": 564485, "slug": "spazzs-easter-caper", "name": "Spazz's Easter Caper", "name_original": "Spazz's Easter Caper", "description": "<p><strong>Spazz's Easter Caper<br/></strong>This is a short game made for the LÖVE Jam 2021. I only had a few hours a day to work on it, so it's incredibly short (2 levels), but I hope you enjoy it anyway.<br/><br/><strong>How to play<br/></strong>This game is influenced by Adventure Island, Contra, and Jazz Jackrabbit. It uses Adventure Island's health system, which depletes over time, but you can replenish by recovering chocolates and candy hearts. The candy hearts are worth 2 health, and chocolate bars are 1.<br/>This is an auto-runner, so Spazz will constantly be running forward. However, his movement can be modified slightly by shooting his gun in the air. Shooting forwards will propel him backwards, and shooting down (Down+shoot) will make him float in the air. Be careful though, one hit and it's back to the beginning of the level! Also, walking into a wall will make Spazz lose all his momentum, so you'll need to try and propel yourself backwards to gain some acceleration.<br/><br/><strong>Bullet Kicks (headshots)<br/></strong>This is a really useful move and will help you gain height quicker while using less ammo. To perform a bullet kick, simply hold down and press the shoot button ONCE while over an enemy. If you continuously fire it will not work. It was originally a bug, but because of time constraints I'm calling it a feature.<br/><br/><strong>Enemies<br/></strong>Evil Blob - It's a blob that idles in place. Every few seconds he'll jump up at shoot at Spazz.<br/>Laser field - Don't touch any part of this or you will instantly regret it<br/>Spikes - You probably know these guys from literally every other game. Don't touch them.<br/><strong><br/>Controls<br/></strong>Keyboard/Controller<br/>Jump = X / A button<br/>Shoot = Z / X button<br/>Alt+Enter = Toggle fullscreen<br/><br/><strong>The Story<br/></strong>Evil Blobs have stolen all the children's chocolate for easter, and Spazz is not happy. Help him collect as much of it back as you can! Be wary though, Once all of his easter eggs (health) have depleted, he'll be sent back to the beginning. There's plenty of collectables, so it's very rare for this happen, so don't worry too much.<br/><br/><strong>Credits<br/></strong>Programming: Poltergasm<br/>Art: Poltergasm<br/>Music: Mahbod the 8-bit Musician<br/>Font: Super Mario Bros 2 font by Patrick Adams<br/>Sound Effects: Generated using sfxia [https://rxi.itch.io/sfxia]<br/>Director: Poltergasm<br/>Gaffer: Poltergasm<br/>Boom Operator: Poltergasm<br/>Special effects team: Poltergasm<br/>Stunts: Poltergasm<br/>Evil Blob: As himself<br/>Catering: Subway<br/></p>\n<p>And, of course, none of this would be possible without LÖVE and its helpful community (love2d.org)<br/></p><p><strong>Libraries<br/></strong>Of course, I didn't write everything myself. Here's some of the external libraries that were used.<br/><br/>- Baton (Input handling) by tesselode https://github.com/tesselode/bato<br/></p><p>- TLfres (Letter box) https://love2d.org/wiki/TLfres</p><p>- Bump (Collision detection) by kikito https://github.com/kikito/bump.lua</p>", "metacritic": null, "released": "2021-02-22", "tba": false, "updated": "2021-02-26T09:18:52", "background_image": "https://media.rawg.io/media/screenshots/2d7/2d7fcbb36d7e55da91c57c7d577677f4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 67, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["poltergasm"], "genres": ["Action", "Shooter", "Platformer"], "publishers": [], "esrb_rating": null}