{"id": 564487, "slug": "space-merchants-arena-2", "name": "Space Merchants Arena", "name_original": "Space Merchants Arena", "description": "<p><em>This is EARLY ACCESS <strong>Oculus Quest/Quest 2 </strong>version of <strong>Space Merchants Arena</strong> VR space shooter game. </em></p>\n<p><em>You need to enable developer mode on your Quest and sideload APK provided here. You can use SideQuest to help you with installation on Quest.</em></p>\n\r\nSpace Merchants Arena\r\n<p>VR multiplayer space shooter game,  in which futuristic spaceships engage in intense dogfights or tactical play. Earn experience points, improve your skills and progress to new ranks in global leaderboard table. Collect gold and buy new weapons and equipment.<br/></p>\n<ul><li>3 game modes: Free for all / Team battle (red vs blue) / Capture the Artifact</li><li>4 maps: Faarlands, Tristar, Jupiter, Naussike system</li><li>Global leaderboard of best ranking players</li><li>23 achievements</li><li>RPG-like skills and stats</li><li>Shop for weapons and equipment</li></ul>\r\nControls\r\n<p>You can steer your ship by grabbing the stick with your right hand controller (no need to hold grip button, it will lock automatically). OR you can use your right thumbstick instead, if you go to <strong>Options/Graphics</strong> and uncheck \"<strong>Turning with hand</strong>\".</p>\n<p>You can change your ship's speed by grabbing throttle handle with your left hand controller, or by using thumbstick on your left controller (this is recommended).<br/></p>\n<p>Use triggers for firing primary and secondary weapons, use button B to go back.</p>\n\r\nDetailed game description\r\n<p>After each battle player gains experience (to increase his/her skills and stats) and money (to buy and upgrade ships and equipment). Best players are shown in leaderboards and their glory persists to the end of days (obviously ;-)).<br/><br/>Game modes<br/>1) Battle - Free for all, 2-10 players, kill and avoid to be killed.<br/>2) Team Battle - Blue vs Red team, 1 vs 1 to 5 vs 5.<br/>- Faarlands map - Teams gain points just for killing opponents.<br/>- Tristar map - There is a central \"mining\" place where your team can gain a point for each 15 seconds you survive there.<br/>- Jupiter map - Capture the Artifact mode, steal your opponents' artefact and deliver it to your base.<br/>3) Training - Training arena, player vs AI player (bot). Experience and money gains are lower than in normal play against human opponents.<br/><br/>Bonuses<br/>Red bonus adds temporary damage (till the end of the battle).<br/>Green bonus repairs your armor.<br/>Blue bonus adds experience.<br/>Yellow bonus adds money.<br/><br/>Ship's Artificial Intelligence Skills<br/>Each skill increases automatically when used. E.g. when aiming at enemy Accuracy skill increases, when collecting bonuses bonus gain effect increases.<br/><br/>Special techniques<br/>Turrets in game maps can be hacked using Turrets communicator tool obtainable from the shop. Hacked turrets will fight for you and destroy your opponents.<br/>You can also hack you enemy using Hacker Tools. If the hack is successful (depends on your enemy's AI Firewall skill) he will lose control of movement and firing.<br/><br/>Achievements (23 total)<br/>For everything the player does in the game he/she gains points to achievements table. There is also special everyday reward (experience and money) when starting the game.<br/><br/>Reward points (RP)<br/>For Team Battle victory each player of the winning team receives one Reward Point. Additional Reward Points are given to Best player (most kills) and Best assistant (most assists).<br/>Player can exchange Reward Points for special rewards such as Upgrade Tools.<br/><br/>Items Upgrading<br/>Player can use Upgrade Tools to improve existing weapons, shields or armors.<br/><br/>Export/Import function<br/>This function enables player to move his/her game profile from existing device to other device or even different platform.<br/>Export will save current game profile on our server and wipe it completely on current device. The player will receive secure PIN for import operation.<br/>Import will load game profile from our server and overwrite current profile on the device.<br/>This is one-time operation, can not be performed with the same PIN second time.<br/><br/>Languages<br/>Player can choose preferred language using Main menu, Settings, Languages. Player can choose from English, Russian, Czech and Slovak.<br/></p><p>Join our Discord server! https://discord.gg/d8JthcWngr<br/></p>", "metacritic": null, "released": "2021-02-22", "tba": false, "updated": "2021-02-26T09:19:30", "background_image": "https://media.rawg.io/media/screenshots/a7b/a7baaf7e950ca113f5bb5d958659f3f0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 264, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["PLAYITO"], "genres": ["Shooter", "RPG"], "publishers": [], "esrb_rating": null}