{"id": 564773, "slug": "dungeons-and-bombs", "name": "Dungeons and Bombs", "name_original": "Dungeons and Bombs", "description": "To play this game on PS5, your system may need to be updated to the latest system software. Although this game is playable on PS5, some features available on PS4 may be absent. See PlayStation.com/bc for more details.<br/>This is dynamic fusion of classic puzzles with boxes and bombs. When enemies drag people into their dark lair and do their vile deeds there, the hero and his faithful sword always come to the rescue. But what if the hero does not have a sword, but only a lot of enthusiasm and an endless supply of explosives? Well, bad for them. Go through dark labyrinths of dungeons and try not to blast yourself up!<br/><br/>Features:<br/>- 50 entangled puzzle-levels<br/>- Limited number of moves to complete each puzzle<br/>- Unbreakable laws of logic<br/>- Bombs and explosions!<br/><br/><br/>Offline single player<br/>Remote Play allows users to connect to and play games on their PlayStation®4 or PlayStation®5 using a mobile device, PC, or another PlayStation®4 or PlayStation®5.<br/>Enhanced game play on PS4 Pro console<br/><br/><br/>Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy). <br/><br/>Software subject to license (us.playstation.com/softwarelicense). <br/><br/>One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.<br/>", "metacritic": null, "released": "2021-02-26", "tba": false, "updated": "2021-03-01T02:09:40", "background_image": "https://media.rawg.io/media/screenshots/091/0919afc7faeb01fd35903d9a7a68e741.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 199, "game_series_count": 0, "reviews_count": 0, "platforms": ["PlayStation 4"], "developers": [], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}