{"id": 564770, "slug": "coffee-noir-business-detective-game-demo", "name": "Coffee Noir - Business Detective Game DEMO", "name_original": "Coffee Noir - Business Detective Game DEMO", "description": "The full version of Coffee Noir - Business Detective Game is coming soon to GOG.COM. You can wishlist it here\n\n\n<br/>\n\n\n☕ 【﻿ＦＥＡＴＵＲＥＳ】☕\nBusiness management:\n<br/>\nmanage your team, handle production, invest in promotion, and don’t let your coffee business go bankrupt - you have to plan your strategy carefully as you deal with limited resources!\n<br/>\n<br/>\nDeep negotiations:\n<br/>\nsuccessfully negotiate to win good deals and gain the trust of your business partners to get the clues and solve the criminal mystery.\n<br/>\n<br/>\nRealistic economic strategy:\n<br/>\nthe game was developed with the support of professional economists and academics to provide you with a thorough business simulation experience.\n<br/>\n<br/>\nIntriguing crime:\n<br/>\ndeeply immerse yourself in the story of the atmospheric Neo-London and its unusual criminal case thanks to engaging narrative style inspired by Agatha Christie's books.\n<br/>\n<br/>\nNoir audio-visual setting:\n<br/>\nCoffee Noir is inspired by classic American comic books and filled to the brim with film noir mood and retro-futuristic ambiance. Feel the atmosphere of retro-style interiors, smooth jazz, dense cigarette smoke, and a smell of good coffee while wearing the classy detective outfit and listening to professional voice-acting.\n<br/>\n<br/>\n\n\n\n☕ 【﻿ＳＵＭＭＡＲＹ】☕\nCoffee Noir is a 2D business management game focused on contract negotiations, production and sales in a coffee industry along with an intriguing detective storyline with a film noir art style.\n<br/>\n<br/>\nIt’s 2021 in an alternate future - discover the mysterious world of Neo-London as Arthur Oliver - an experienced private detective. He unexpectedly becomes a part of London's dreadful puzzle and must find out why Richard Kersey - a local coffee market businessman - disappeared without a trace.\n<br/>\n<br/>\nThe worried family believes that one of Richard’s partners is to blame. For the first time in his career, the detective will have to work undercover as a businessman...\n<br/>\n<br/>\nWill you be able to manage a successful coffee business and solve the criminal case of Richard Kersey’s disappearance at the same time?\n<br/>\n<br/>", "metacritic": null, "released": "2021-02-25", "tba": false, "updated": "2021-03-01T02:06:32", "background_image": "https://media.rawg.io/media/screenshots/499/499419e603b052c3cd39190e52772174.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 45}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 301, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC", "macOS"], "developers": ["DOJI"], "genres": [], "publishers": ["DOJI"], "esrb_rating": null}