{"id": 5649, "slug": "rogue-warrior", "name": "Rogue Warrior", "name_original": "Rogue Warrior", "description": "Rogue Warrior is a character-driven, first-person-shooter, featuring Richard 'Demo Dick' Marcinko's explosive personality in an action-packed single player campaign, and intense multiplayer combat. <br/><br/>\t\t\t\t\tPlaying as Richard 'Demo Dick' Marcinko, you go behind the iron curtain to disrupt a suspected North Korean ballistic missile program. Soon into the mission, you uncover a conspiracy that could turn the tides of the Cold War in the communists' favor. You must then take the mission into your own hands as you enter into the bowels of the USSR to destroy a technology that could change the balance of geopolitical power, leaving a trail of destruction in your wake! <br/><br/> <ul><li><strong>Play as a Real Life Legend </strong> - Play as Richard \"Demo Dick\" Marcinko — a real-life American badass. His defiant, crude, and sometimes ruthless behavior has earned him both glory and infamy in the history books. Now you take on his explosive nature as you engage in black ops and go against the rules of conventional warfare to get the job done.<br/><br/> </li><li><strong>Brutal Kills </strong> - With more than 25 uniquely brutal kill moves, do what it takes to take out the enemy. No trick is too dirty as you maintain the element of surprise whenever possible - find and kill the enemy before they find you.<br/><br/> </li><li><strong>Targets of Opportunity </strong> - Be an instrument of destruction as you create tactical advantages by eliminating any and all targets that would otherwise benefit the enemy.<br/> </li><li><strong>Multiplayer Mode </strong> - Go head to head against others online and even perform brutal kill moves on your friends.<br/> </li><li><strong>Award-winning Talent </strong> - Golden Globe winner and Oscar nominee Mickey Rourke voices Dick Marcinko's in-game character.<br/> </li></ul>", "metacritic": 29, "released": "2009-11-27", "tba": false, "updated": "2024-01-20T10:56:32", "background_image": "https://media.rawg.io/media/screenshots/013/01307f219833be28e3b1ed6a4582604d.jpg", "website": "http://www.roguewarrior.com/", "rating": 2.26, "rating_top": 1, "added_by_status": {"yet": 11, "owned": 344, "beaten": 27, "toplay": 11, "dropped": 13}, "playtime": 2, "achievements_count": 136, "ratings_count": 42, "suggestions_count": 441, "game_series_count": 0, "reviews_count": 42, "platforms": ["PC", "PlayStation 3", "Xbox 360"], "developers": ["Bethesda Softworks", "Rebellion"], "genres": ["Action", "Shooter"], "publishers": ["Bethesda Softworks"], "esrb_rating": "Mature"}