{"id": 565179, "slug": "lsd-last-sweet-dream", "name": "LSD - Last Sweet Dream", "name_original": "LSD - Last Sweet Dream", "description": "<p>The conditions were to develop a game for smart phones using the Engine Construct 2.</p>\r\nIntro : \r\n<p>Confront another player in insane arenas to determinate who's the quickest to escape !</p>\r\nContext :\r\n\n<p>This is a Point and Click or Drag and Drop (on mobile phones) on a top view camera.</p>\n<p><strong><strong>- 2 players confront one another in arenas in a Turn-Based RPG.</strong></strong></p>\n<p><strong>During their turns, they have a deck of 5 different cards ; </strong></p>\n<p><strong>    Movement                Actions                    Anti-trap                Invisibility           Map Overview</strong></p>\n\n\n<ul><li>The goal is to find the key related to your avatar and get to the exit before the other player. </li><li>Each arena has a differen Level Design hiding diverse traps and NPC foes.</li><li>The 2 players also have the possibility to fight one another in direct melee combat.</li></ul>\r\nGame :\r\n<p>HOW TO PLAY</p>\n<p>The turned-based system is the main mecanic of LSD, therefore each player individually play their turn until they're out of Action Points or decide to finish their turn.</p>\n<p>                  <strong>               Action Points                                       Refresh Cards             Finish Turn</strong></p>\n<p>                                    <br/></p>\n\n<p>Once the 2 players turns are passed. the mobs turn starts. They attack players if they are adjacent to them.</p>\n<p>\n</p>\r\nControls :\r\n<ul><li><strong>Move :</strong>  Choose the movement card</li></ul>\n<p>                             </p>\n<p>And select where you want to go by clicking on the arrow you want</p>\n\n<ul><li><strong>Actions ;</strong> Attack and Potion cards </li></ul>\n<p>              <br/></p>\n<p>Those 2 cards are coming from the same card draw (Actions) and each one has a 50% chance to appear each time a AP (action point) is consumed. </p>\n<ul><li><strong>Anti-Traps :</strong> To move out from a trap</li></ul>\n<p>              <br/></p>\n<p>This card will only be active when your avatar is in a trap. You also can break a trap by being adjacent to it and attack it.</p>\n<ul><li><strong>Invisibility ;</strong> Spend 3 APs to be invisible until your next turn</li></ul>\n<p>        <br/></p>\n<p>You still can be damaged if you're attacked.</p>\n<ul><li><strong>Third Eye</strong> : Spend 3 APs to allow you to see the entire arena for a few second</li></ul>\n<p>      </p>\n<ul><li><em>Alt+F4 to quit the game, as there is no menu to quit or refresh the page.</em></li></ul>\n\n<ul><li><strong>Life or HP :</strong></li></ul>\n\n\n<p>Life can be regained by using Potion Cards. Once you're out of life, you'll automoatically repop at the start spawn and lose all your items.</p>\r\nMissing features :\r\n<ul><li>When Lazare and I started to program and design the game we created 2 new cards ; Invisibility and 3rd Eye, cards that weren't present in the initial concept. We felt more confident the more we worked on the project, therefore we had many other ideas to implant, but we had to respect the deadlines.</li><li>More levels</li><li>Polish the graphics</li><li>Other Avatars choices</li><li>How to play Menu</li><li>Mute Sound Option</li></ul>\r\nKnown Bugs :\r\n<ul><li>In the second level you don't see your avatar, you'll have to move away from the spawn tile to see it.</li><li>There are many other smal bugs here and there as it is a prototype.</li></ul>\r\nConclusion :\r\n<p>For most of the team members, that project taught us a lot in our first year of game program. Some of us crunched a lot but it was a pretty positive experience as we choose to do so and decide the time we would crunch.</p>\r\nTeam (5 members) :\r\n<ul><li>Ambre Chiasson (Game Artist)</li><li>Capucine Blaise (Game Artist)</li><li>Yanis Neit-seghir (Sound Designer)</li><li>Lazare Barré (Developper)</li><li>Jeremie 'Zehuti' Southgate (Developper and Game Designer)</li></ul>\r\nInstall instructions\r\n<p>No install exe yet as we might have other plans for this project later :)</p>", "metacritic": null, "released": "2021-02-28", "tba": false, "updated": "2021-03-01T03:57:07", "background_image": "https://media.rawg.io/media/screenshots/1d9/1d94875931a12b3b26430e4619ae4a88.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 158, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Zehuti"], "genres": ["RPG", "Strategy"], "publishers": [], "esrb_rating": null}