{"id": 565275, "slug": "pop-a-bottle-git-drunk", "name": "Pop A Bottle (Git Drunk)", "name_original": "Pop A Bottle (Git Drunk)", "description": "<p>Racy lanstrom is a American born legendary racer who won the World racing championship 4 times in a row and he wanted to win 1 more championship and retire from racing championships but unluckily he lost one of his leg in a conspiracy accident. The conspiracy creators used to mock him to race with them after losing his leg. He had many sleepless nights from then. When he was about to sleep, he used to have nightmares of losing in a race and he would wake up suddenly. Although he can’t race physically, he races every day in  his mind. But he wanted to win the 5th championship and take revenge on conspiracy creators and to do that he researches for 6 months and with the help of few scientists he prepares a perfect blend of some natural herbs to heal his leg and drinks it but nothing happens and disappointed Racy stores that blend in a green coloured bottle and sleeps for the night and in the night a bird feather falls into the bottle. Unfortunately, after feather falls into bottle, it turns out that the blend is so powerful, and the bottle gets two legs and hands and gets life. By the time racy wakes up, bottle dances Infront of him in a mocking way. Seeing that bottle dancing in front of him and he tries to create the same formula gain and again but nothing works because he doesn’t know it was because of a birds feather and irritated racy ties up bottles  hands and legs and stores him in a bullet proof shelf in his bar named revolt.</p>\n<p>              Seventy years later there was a shootout between police and a notorious gangster Rocky Bhai in a bar and bulletproof glass was hit by a misfired bullet and a small crack appeared and in order to replace the glass they called a glazier without knowing he was drunk and he accidentally set the bottle free. Because of the bottle’s blood is filled by the alcohol and since the bottle was stored for 70 years the bottle got more power and escaped the revolt bar. Sales of the revolt bar dropped from that moment and the bar owners organize a meeting and plan to catch the bottle or take revenge on bottle for their loss.\r\n  </p>\n<p>Bottle having the purest soul wanted to let every person in the world taste his drink. Since she was unable to catch, Bar owners put some ice cubes and spike balls on the way to make it slower and pop the bottle respectively. Bar owners thrashes the Drunken glazier for letting the bottle free and frustrated glazier puts some special made soda bottles on the way which has special powers to make the  bottle run faster.\r\n</p>", "metacritic": null, "released": "2021-02-28", "tba": false, "updated": "2021-03-01T04:22:28", "background_image": "https://media.rawg.io/media/screenshots/b47/b474b78f803c90542d994184de538f25.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 80, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["susheelreddy87"], "genres": ["Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}