{"id": 565605, "slug": "edda-cafe", "name": "EDDA Cafe", "name_original": "EDDA Cafe", "description": "<p><em>\"Have you ever heard a myth about cafes that turn back time?”</em></p>\n<p><em>I no longer care about anything after what happened two years ago. I made a mistake... and now I lost the most important person in my life. I don't think I deserve anything. I’m simply disgusted with myself. Guilt, regret, and loss... they will haunt me for eternity. Even the gift I have for him is meaningless now.</em></p>\n<p>Mina is a shy girl who lost her dearest one. Guilt, regret, and sadness haunt her after that accident, causing her to blame herself. Two years has passed and she's still trapped in her past. Two days before Valentine’s day, she meets Taku, a waiter who introduced her to a cafe named EDDA. Dragged by her little curiosity and her friend's compulsion, she finds out that through magic in that cafe, she was given a second chance. Will it save her heart? Will she move forward or stay in the past?</p>\n<p><em>“And when the coffee starts to drip, the magic begins...”</em></p>\n\n<br/>\n\n<br/>\n<p>EDDA Café is a visual novel made by Morinoir/Pepapen, a cute and heartwarming story about love for Valentine VN Jam 2021. This visual novel offers an unusual Valentine-theme love story that needs the reader to end the story and get unique sweets in the end.</p>\n<p>Format: Visual Novel <br/>Genre: Slice of life, fantasy, romance<br/>Length: 8000 words<br/>Language: English<br/>Platform: PC (Windows, Mac, Linux)</p>\n\n<p>Team leader &amp; Artist: Morinoir/Pepapen (Deviantart)<br/>Story writer, Logo Designer, Mina VA: Nami<br/>Editor: Clover Zero<br/>UI design, implementation and Ren’Py scripter: MadScientist (Twitter)</p>\n<p>Guest:</p>\n<p>Taku VA: Josh Portillo (Twitter)</p>\n<p><strong>Disclaimer:</strong></p>\n<p>EDDA Cafe is a short project for Valentine VN Jam 2021. This visual novel contains 3 parts. Part 1 and part 2 have been released to the public, but will still be updated in the next few weeks. Part 3 will be available at a later date. If you enjoy our game so far, please give Morinoir/Pepapen a follow to get the notification when the game is updated!</p>\n<p><strong>Looking forward to your feedback!</strong></p>", "metacritic": null, "released": "2021-02-28", "tba": false, "updated": "2021-03-01T05:50:15", "background_image": "https://media.rawg.io/media/screenshots/5ea/5ea7d1543c80c4c0ded27feb903b3068.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 144, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Android"], "developers": ["NSAID", "Pepapen", "Aiko/Clover Zero"], "genres": [], "publishers": [], "esrb_rating": null}