{"id": 565614, "slug": "the-first-date-valentines-vn-jam-2021", "name": "The First Date (Valentine's VN Jam 2021!)", "name_original": "The First Date (Valentine's VN Jam 2021!)", "description": "(If you find any problems, please let me know ~)\r\n\n\r\nOh, young love...\r\n<p>How you've ever been bothered by that oh so horrible trend? You know the one I'm talking about. The main character has a childhood friend who is the sweetest person of all time. They absolutely love our MCMcGee and would be perfect for them. But our friend decides to completely reject their feelings and goes with the new interest instead. Well, we don't like that trope here. In The First Date, the childhood friend finally will win. Out with the new, back to the old! </p>\n\n<p>In the First Date, you will take control of typically your typical high school boy, Shinji(or whatever you'd like to name him).  Like your run-of-the-mill teenager, Shinji has love on his mind. However, he's one step ahead of most his age. He already has a love interest, and he's pretty sure she likes him as well. Shinji decides that after...well, his entire life, he will finally confess to his childhood friend Rin. </p>\n\n<p>Amazingly, she says yes, and agrees to go on a date! But Shinji isn't quite smart enough to do this all by himself. That's why it's up to YOU, dear player, to make the decisions Shinji can't. With your help, the childhood friend's first date will be a day they'll remember for the rest of their lives. Or one they may want to forget. That's what's the multiple endings are for!</p>\n<ul><li>Three different fully unique routes/dates!</li><li>Multiple endings for each route!</li><li>Around an hour for the first playthrough!</li><li>Tons of humourous dialogue options</li><li>Rin!</li><li>A great and jazzy soundtrack that I do not own</li><li>Great and beautiful art that I also do not own</li></ul>\n<p>Hey, speaking of things I do not own.</p>\r\nCredits!\r\n<p>I would like to give a huge thanks to the people who made this possible. Quite frankly, the work I did is nothing compared to what these talented individuals have done for this project. Without them, there just wouldn't be a project at all!</p>\r\nArt!\r\n<p>All the wonderful character portraits of our dear friend, Rin was done by Noraneko Games. If you want to check out some amazing art you can use for your own projects; please check them out!</p>\n<p>https://noranekogames.itch.io/<br/></p>\n<p>Giving people access to this art is a wonderful thing to do, and I'm very appreciative of it, as I'm sure many others are.<br/></p>\n<p>All the other portraits for the minor characters were also made by Noraneko. So yeah, good stuff.</p>\n<p>The backgrounds were made by a few people—one by Nora, quite a few by Konett. Check them out too!</p>\n<p>https://konett.itch.io/</p>\n<p>But most of the background used came from a Japanese website. I believe the credit is Kimagure After, or at least at some point, that was right. Regardless, it was hard for me to figure it out exactly. Bless Google translate's poor soul, but it could only take me so far. So I'll instead leave you a link. There's some incredible stuff there, and quite a variety as well.</p>\n<p>https://k-after.at.webry.info/</p>\n<p>Uncle Mugen made one of the ones I used. Once again, many, many backgrounds down below.</p>\n<p>https://lemmasoft.renai.us/forums/viewtopic.php?f=52&amp;t=17302</p>\n<p>Anatoly Shaban made one. I believe that was free to use, but if not, I apologize, and I can fix that.</p>\n<p>https://www.artstation.com/artwork/oy4Nz</p>\n<p>And another came from wallpaperaccess.com</p>\n<p>https://wallpaperaccess.com/anime-room</p>\n<p>Again, pretty sure it's cool to use these, but I can do something if not for whatever reason.</p>\r\nMusic!\r\n<p>I don't have a single musical bone in my body at the moment, so the quite bopping soundtrack of this game, if I say, I again owe to other people.</p>\n<p>Them being Kevin Macleod and Tim Reichert.</p>\n<p>Per the terms of use, here's everything I used by Macleod:</p>\n<p>Continue Life: by Kevin Macleod <br/>Link: https://incompetech.filmmusic.io/song/3545-continue-life<br/>License: https://filmmusic.io/standard-license</p>\n<p>Lobby Time: by Kevin Macleod<br/>Link: https://incompetech.filmmusic.io/song/3986-lobby-time<br/>License: https://filmmusic.io/standard-license</p>\n<p>Study And Relax: by  Kevin MacLeod<br/>Link: https://incompetech.filmmusic.io/song/5764-study-and-relax<br/>License: https://filmmusic.io/standard-license</p>\n<p>Tiki Bar Mixer:  by Kevin MacLeod<br/>Link: https://incompetech.filmmusic.io/song/6836-tiki-bar-mixer<br/>License: https://filmmusic.io/standard-license</p>\n<p>These are just fantastic. I highly recommend it. I listened to some of this stuff even when I wasn't working on the game. It's just good.</p>\n<p>Tim Reichert was cool enough to make an entire visual novel audio pack with tons of cool stuff you can check out.</p>\n<p>https://timreichert.bandcamp.com/album/visual-novel-audio-pack</p>\n<p>Again, here's what I used:</p>\n<p>Guitar on the Water:  Composer/Sound Designer: Tim Reichert</p>\n<p>Jazzy Shop:  Composer/Sound Designer: Tim Reichert</p>\n<p>Letting Go Main:  Composer/Sound Designer: Tim Reichert</p>\n<p>Shenanigans:  Composer/Sound Designer: Tim Reichert</p>\n<p>Good, good stuff. There are lots more as well that I just didn't need to use.</p>\n<p>I believe that's it. If It's not, I can always correct it.</p>\r\nAnyways!\r\n<p>This was my very first time ever creating something like this. I had a blast doing it. It was hard work, and I was a little stressed because of time, but I liked it. I highly recommend you check out some other games in the jam as well. Lots of talented people worked hard this past month or so.</p>\n<p>If you'd like to read a little about my journey making this and some of the things I've learned, I wrote about it on my site down below.</p>\n<p>https://www.sideoffiction.com/2021/02/28/so-i-made-a-visual-novel-and-it-was-int...<br/></p>\n<p>I also have like a Twitter. I talk about games and anime, and my interests. No drama there, I promise. I hate it as much as you do.</p>\n<p>https://twitter.com/FriendlyOv</p>\n\n<p>Thank you so much for your time. I appreciate it ~</p>\r\nGuide!\r\n<p>Stop reading if you don't want to get spoiled. The game isn't super complicated, but I figured I'd tell people how to get the endings, just in case.</p>\r\nBeach route:\r\n<p>The good ending is achieved by using wet sand and a simple sandcastle design. You then have to challenge the outcome and choose to try and kiss Rin after. Next, you need to protect her from the rocks and try to kiss her again. Finally, you'll be set on the good end.</p>\n\n<p>Normal ending is obtained by doing any of the above as well as choosing it from the good ending.</p>\n\n<p>Bad ending is a little more complicated. You have to tie the build-off but then throw Rin in the water. Next, you need to not protect her and change the subject. You need to hate her, basically.</p>\r\nParty route: \r\n<p>to get the good ending, you need to make the chicken stew first, pork cutlets second, and the sashimi last. You also need to choose to hug Rin, let her rest, and admit that you love Rin to her mother.</p>\n<p>The normal ending is obtained by either doing one of the above or choosing not to seek Rin's parent's approval in the good ending.</p>\n<p>For the bad ending, you need to really mess things up. You need to fail the meal, do nothing when comforting her, try to kiss her when she's sleeping, and fail to admit you love her. There's also a slightly different bad ending attached to the normal one for saying you can't take care of Rin.</p>\r\nPark route:\r\n<p>You are set on the good ending by default if you choose to help Sora right away, hold Rin's hand, and scoot closer to her during the picnic.</p>\n<p>Normal ending is obtained by doing one of the above.</p>\n<p>The bad ending can be chosen in the normal ending by failing to believe in Rin.</p>", "metacritic": null, "released": "2021-02-28", "tba": false, "updated": "2021-03-01T05:53:07", "background_image": "https://media.rawg.io/media/screenshots/dff/dffa9632d6fca7628fbb6912b09ddb6f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 197, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["FriendlyOverlord"], "genres": [], "publishers": [], "esrb_rating": null}