{"id": 565817, "slug": "slime-64-movement-demo", "name": "Slime 64 Movement Demo", "name_original": "Slime 64 Movement Demo", "description": "<p>Slime 64 is a 3D Collectathon Platformer inspired by the 64-bit era!</p>\n<p>Play as four uniquely strong elemental Slimes in any order you'd like as they meet each other on their journey and combine their powers to save the world from the diabolical Wurl Tzun and his ever-expanding enterprise. The Geo Keys and Golden Bells will unlock new worlds to explore as you amass your strength in numbers (and your pile of goodies).<br/></p>\n\n\n\n\n<em>\n<p><strong>Meet the Slimes!</strong><br/>Fly through the air with Winona, zip through water at high speed with Marsh, dash and jump farther and higher with Ash, and build up insane speed rolling around as Tuff. These four slimes hail from all around the world, but through their adventures will meet and fuse, allowing their powers to be used at the same time!</p>\n<em>\n<p><strong>Choose a Visual Style</strong><br/>Some people prefer jaggy edges and scanlines, others prefer crystal clear sight. Play the game with Nostalgia Goggles set to On, HD Remaster, or <em>Blinding</em>!</p>\n<p><strong>Adaptive Soundtrack</strong><br/>Catchy tunes inspired by the style and tone of yesteryear combined with some smart programming help capture that classic exploration feel.</p>\n</em>\n<p><em><strong>All sorts of challenges!</strong><br/>Do you like platforming? How about puzzle solving? Speedrunning? As fans of all of the above, we're pushing Slime 64 to be the best it can be, and to offer something for everyone!</em><br/></p>\n<p><em><em>Slime 64 (C) WaveParadigm LLC All Rights Reserved</em></em></p>\n</em>", "metacritic": null, "released": "2021-02-27", "tba": false, "updated": "2021-03-01T06:50:50", "background_image": "https://media.rawg.io/media/screenshots/fc7/fc7b9c273f95da36441eb0eec4cbb2f8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 124, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["WaveParadigm"], "genres": [], "publishers": [], "esrb_rating": null}