{"id": 566023, "slug": "bob-n-found", "name": "Bob n' Found", "name_original": "Bob n' Found", "description": "<p>Bob n' found is an arcade game where you play as bob, the last employee of the lost and found shop in a theme park. You'll have to face a horde of people that just lost their corndogs, phones and children, beware of the Karens that will test Bob's skills! A conveyor belt will bring you all the lost items found in the park and you'll have to sort them and give them to the people waiting at the counter, you can also store objects that you dig up from the conveyor belt insibe boxes or in a children's play area if no one need them at the moment. if the boxes are full you can always throw them in the trash to remove them (yes even the children) Controls: You can play by only using your mouse, left click on the ground to have bob move there and left click on the boxes, conveyor belt, trash can or ball pit to have bob interact with them. markings on the ground and spotlights will help you know where you can click to interact with the environment. Once you have grabbed an object from the conveyor belt you can either throw it away, store it or give it to a customer at the counter. you can only give an item to the first customer in line, beware of Karens that will change what object they want over time, what a pain for poor Bob. A logo will appear on top of customers to let you know what kind of item they want, either electronics, food or a child. </p>", "metacritic": null, "released": "2021-02-27", "tba": false, "updated": "2021-03-01T07:42:54", "background_image": "https://media.rawg.io/media/screenshots/b0f/b0fdf9577729dc3498da19b83756a0f4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 28, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Nathan Garbe"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}