{"id": 566165, "slug": "double-homework-episode-17", "name": "Double Homework - Episode 17", "name_original": "Double Homework - Episode 17", "description": "<p>This is the seventeenth episode of Double Homework, a story about a guy undergoing a very tough time in his life, due to an incident that literally changed him forever. Fortunately, he lives together with two girls, and he focuses on trying to break the bad cycle he has fallen into. You can find the other sixteen episodes for free here, or play the full game on our Patreon page!</p>\n<p>The completed game is now available to all patrons – this includes Episode 1-19, along with two epilogues!</p>\n<p>You can now tweak your choices without the need to replay previous episodes using our variable editor! Click here and go through the options, then reload your game.</p>\n<p>Mobile support is currently beta and issues can potentially appear. The only supported browser for mobile is Chrome. To get fullscreen, open the game, tap the options button of the browser (“…”) and select “Add to Homescreen”. This option is also available on iOS under the share icon. </p>\n<p>Important: Do NOT minimize the game while playing on mobile, as your system may kill it and you will lose your progress. Make sure to save before you leave the game.</p>\n<p>Note that you might see a black window for a while until the game loads. Consider closing your other browser tabs before playing. Again, disable your ad-blocker! (We don’t have any ads). If the game feels laggy on desktop computers, make sure your system GPU drivers are up-do-date and that “hardware acceleration” is enabled in your browser settings (the same applies to DFD).</p>\n<p>Any bugs or issues? Please email us at support@love-joint.com or get in touch by joining our Discord channel.</p>\n<p>If you like this, please support the development of DH, and our other projects by going to our Patreon and supporting us, while getting the chapters before anybody else and other Patreon exclusives. You can find a preview of our next game here!</p>\n<p>Credits:</p>\n<p>Game Design: Palmer</p>\n<p>Writing: AW</p>\n<p>Graphics: MuseX, Catnip &amp; Rofax</p>\n<p>Programming: Ricky</p>", "metacritic": null, "released": "2021-02-26", "tba": false, "updated": "2021-03-01T08:20:45", "background_image": "https://media.rawg.io/media/screenshots/46c/46c6849e4af6b10fc1862ecacdff597b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 157, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Love-Joint"], "genres": [], "publishers": [], "esrb_rating": null}