{"id": 566246, "slug": "blethers", "name": "Blethers", "name_original": "Blethers", "description": "<p><strong>blether (</strong>′blɛðər), <em>v</em>. to talk foolishly.</p>\n<p><strong>Features</strong></p>\n<p>\n</p>\n<ul><li>Assume the role of a middle aged Scottish man called Glen </li><li>Experience 6 narrative scenes from Glen's memory of growing up in Scotland</li><li>Explore the the linguistic tension in modern day Scotland </li><li>Every line of dialogue translated</li><li>Your choice of language matters - see how events and people react to your words</li></ul>\n<p><strong>Frequently Held Beliefs</strong><br/></p>\n<p><em>\"English speakers can understand this, it's just a dialect of English\"</em></p>\n<p>Wrang! If mutual intelligibility defined languages, a hale lot o languages would be up for debate. Is Norwegian actually a dialect of Danish? Is Portuguese a dialect of Spanish? There is in fact nae agreed upon criteria that distinguishes a language fae a dialect, it is a purely cultural label that is bestowed upon varieties of language that have status<em>. </em>And Scots is seriously lacking in status.</p>\n<p><em> \"This is slang\"</em></p>\n<p>To understand Scots you need to understand that it is spoken on a spectrum: </p>\n\n<p>On the left ye've got English as spoken in a Scottish accent, and on the right you've got Scots in it's \"purest\" form. Depending on the circumstance and whae yer talking tae, Scot speakers yo-yo up and doon this spectrum. This is why folk think Scots is slang, its status has declined tae such a point that it gets maist of it's usage in informal settings, and practically never in writing outside of social media. This wisnae ayeweys the case, the language has a history thit goes back hunners and hunners of years - noo, kin that really be cried slang?</p>\n<p><em> \"No one talks like this\"</em></p>\n<p>Mibbie ye should think aboot yer ain life: where'd ye grow up? Whit's yer job? Whae's yer pals? Yer faimly? As Scotland and England got closer politically, the upper and middle classes dropped Scots in favour of English. These days Scots is maistly spoken bi the working class. This micht be why ye've never heard Scots afore, and if that's really the case, then a'm sorry ye've been deprived.</p>", "metacritic": null, "released": "2021-02-26", "tba": false, "updated": "2021-03-01T08:39:40", "background_image": "https://media.rawg.io/media/screenshots/3e3/3e38a4bf99794e18c04bdb95b9d7b00b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 95, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Darren Robertson"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}