{"id": 566354, "slug": "airo-university", "name": "Airo University", "name_original": "Airo University", "description": "<p>The first official release of Airo University is here!</p>\n<p>Airo University is a life simulator where you're a new student studying at the prestigious Airo university. During your stay there, you'll have to manage your grades, friendships, and your weight!</p>\n<p>Much of the games mechanics are explained during the tutorial of the game, but a brief overview is that you have a set amount of actions every day, and what you do with those actions is completely up to you. Go to the park, read a book, see a friend. All up to you!</p>\n<p>This game has a focus on weight gain, if you're not into that there may still be some things for you to enjoy here. But if you're not a fan of it I recommend staying away.</p>\n<p>I would really appreciate any feedback on this project, as well as bug reports.</p>\n<p>I'll be active here and on Weight Gaming Forum, so head over there if you're interested in having a say in the projects development</p>\n<p>I hope you enjoy your stay at Airo University!</p>\n<p>Quick patch!<br/></p>\n<p>Just fixed a few bugs that have been reported as well as adding an inventory screen to the town and moving the questions regarding appearance to your first visit to the mirror. I strongly recommend you download this new patch as there are some MAJOR bugs that have been fixed</p><p>Second patch!</p><p>Yeah just realised I made a spelling error on a variable, new downloads just added. If you downloaded it in the last 5 minutes please redownload. Sorry!</p>", "metacritic": null, "released": "2021-02-26", "tba": false, "updated": "2021-03-01T09:09:33", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["The_Geo"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}