{"id": 566446, "slug": "doctor-who-the-lonely-assassins", "name": "Doctor Who: The Lonely Assassins", "name_original": "Doctor Who: The Lonely Assassins", "description": "<p>Building on the terrifying legacy of the Weeping Angels, first encountered in the iconic story “Blink”, Doctor Who: The Lonely Assassins is a thrilling found-phone mystery developed by the award-winning creators of Sara Is Missing and SIMULACRA.</p>\n<p>Amidst a sinister series of events at a seemingly abandoned house in London, someone goes missing, and you find their phone. When it begins to self-destruct, ex-UNIT scientist Petronella Osgood enlists your help to uncover hidden clues and solve cryptic puzzles. Will you unravel the truth behind the chilling disappearance before it’s too late? But remember: don&#39;t turn your back, don&#39;t look away and DON’T BLINK.</p>\n<p>Key Features</p>\n<p>ORIGINAL DOCTOR WHO STORY<br />\nPicking up where the iconic episode “Blink” left off, the Weeping Angels are back to unleash terror once again…</p>\n<p>PETRIFYING NEW NEMESIS<br />\nConfront an evil like never before. No phone is safe!</p>\n<p>AUTHENTIC CHARACTERS<br />\nWork alongside Petronella Osgood (played by Ingrid Oliver) to investigate mysterious events. Also features Finlay Robertson as Larry Nightingale and a special appearance by Jodie Whittaker as the voice of the Doctor.</p>\n<p>FOUND-PHONE MYSTERY<br />\nSearch through messages, emails, videos, photographs and more to uncover clues, solve puzzles and reveal the truth.</p>", "metacritic": null, "released": "2021-03-18", "tba": false, "updated": "2021-12-16T22:42:20", "background_image": "https://media.rawg.io/media/games/58c/58c5e28a0089115fffd22e0f5f4385cd.jpg", "website": "https://www.doctorwhothelonelyassassins.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 90, "beaten": 1, "toplay": 5}, "playtime": 3, "achievements_count": 17, "ratings_count": 1, "suggestions_count": 57, "game_series_count": 14, "reviews_count": 1, "platforms": ["Android", "Xbox One", "PC"], "developers": ["Kaigan Games OÜ", "Maze Theory"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Another Indie", "Maze Theory"], "esrb_rating": "Teen"}