{"id": 566483, "slug": "magic-chess-online", "name": "Magic Chess Online", "name_original": "Magic Chess Online", "description": "Are you a professional chess player, an occasional player or a beginner? Don't wait any longer and join the most complete online chess video game ever created.<br/><br/>Magic Chess Online (MCO) modernizes this millennial game by bringing it into the new era of eSports.<br/><br/><br/><br/>Immerse yourself in the world of MCO and makes the history of chess.<br/><br/>- Tutorials to learn the basic rules<br/>- Possibility to change the view during the game (2D or 3D animated)<br/>- 3 classic levels of AI (Beginner, Intermediate, Expert)<br/>- Face the real AI of MCO in Machine Learning !<br/><br/><br/><br/>- Compete against other classified players in Blitz or Classic mode<br/>- Upgrade your ELO to unlock 11 ranks and become a World Championship Contender<br/>- ELO, national and international ranking available<br/>- Qualify for the World Championship of MCO every year and join the final show to pocket the jackpot !<br/><br/><br/><br/>- Challenge yourself by solving tens of thousands of puzzles as quickly as possible.<br/>- Add your friends and compete against them in fully customizable games<br/>- Replay and watch any game with a spectator mode and a powerful replay engine<br/><br/><br/><br/>- Animated chess boards and stunning environments<br/>- Complete achievements and quests<br/>- Continue your progress on your mobile thanks to a multiplatform online mode !<br/><br/><br/><br/>- Do you like this game and do you want to participate by increasing its influence? We will reward you with an in-app influence program !<br/>- Relax by playing the different fun modes available for a limited time, but they will certainly come back !<br/>- Create or join tournaments created by the community thanks to the most complete in-app tournament manager !<br/><br/><br/><br/>- Perfect your game with lessons created by experienced players directly in the app and become an \"instructor\" too !<br/>- Play with your community and make your stream more interesting thanks to the features that we added specially for streamers!<br/>- The physical or the virtual ? Regardless, you can play all of your games on connected chessboards if you want, and the pieces move by themselves, it's MAGIC !<br/>- Tired of using your hands? Use your voice to move the pieces with the built-in voice control system!<br/>- Immerse yourself in the various environments thanks to the Oculus Rift or the HTC Vive, we added the management of their controller!", "metacritic": null, "released": null, "tba": false, "updated": "2021-03-05T03:06:36", "background_image": "https://media.rawg.io/media/screenshots/e3a/e3a7a9a1327b83f1e143f78fefa02311.jpg", "website": "https://www.magicchessonline.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 524, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Magic Games Studios"], "genres": ["Strategy", "Casual", "Massively Multiplayer", "Indie"], "publishers": ["Magic Games Studios"], "esrb_rating": null}