{"id": 566475, "slug": "cyber-emoji-tale-2099", "name": "CYBER EMOJI TALE 2099", "name_original": "CYBER EMOJI TALE 2099", "description": "CYBER EMOJI TALE 2099 is a classic action RPG with elements of a graphic novel, set in an open-rail-world, action-adventure story set in Cyber City, which<br/>obsessed with techno-tokens, criminal and \"King of the Hill\" lifestyle. You will get a unique opportunity to experience different social strata of the city and personally live several life paths for 3 completely different characters. Attack, defend, run, argue, cry, swear, you will have to go through all this, thanks to the deepest elaborate dialogues and situations. Welcome to Cyber City, son...<h3>FUTURES:</h3><ul><li>The opportunity to fight with absolutely any citizen of Cyber ​​City<br/></li><li>A combat system with crits and various methods of fighting.<br/></li><li>A huge pumping system that opens up colossal opportunities as you level up, including new weapons.<br/></li><li>Adaptive complexity system<br/></li><li>An open rail world where you will see a terrifying metropolis on the wrong feet.<br/></li><li>The elaborate characters constantly surrounding you on your way, which will make you completely immerse yourself in the game world and literally live a whole virtual life with them.<br/></li><li>A deep life story in the era of the distant future, transhumanism and the domination of electronics<br/></li><li>Ambiguous protagonists who don't have the usual good / bad flavor. You have to personally sculpt from this shapeless emoji, a real inhabitant of the era of technocracy with its own advantages and disadvantages.<br/></li><li>A huge number of endings, each of which is unique and deep in its own way.<br/></li><li>A world consisting of references to famous works of cinema, literature and even intersections with real events, as well as a huge number of memes from different universes of science fiction and the future in the world of technocracy.</li></ul>", "metacritic": null, "released": "2021-03-03", "tba": false, "updated": "2021-03-05T02:59:44", "background_image": "https://media.rawg.io/media/screenshots/e8b/e8bf61853bb8834255cde505abc764aa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 543, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MICROCHELIK5000"], "genres": ["Action", "Adventure", "RPG", "Simulation", "Sports", "Indie"], "publishers": ["MICROCHELIK5000"], "esrb_rating": null}