{"id": 566472, "slug": "imp-of-the-sun", "name": "Imp of the Sun", "name_original": "Imp of the Sun", "description": "<strong>IMP OF THE SUN</strong><br/>“Blaze a trail and fight your way across vast deserts, darkened tombs, tangled jungles and over towering mountains, and up the heavens themselves as the Imp of the Sun in this face-paced, high-skill 2D action-platformer! The Sun itself has created the fiery Imp with its dying energy, and has sent it to reclaim its fallen kingdoms, now ruled by those that have betrayed Him. As the Imp, use your fiery will, wits and reflexes to navigate dungeons filled with unrelenting enemies, each ruled over by the Sun’s former, traitorous guardians to return light and life to the land and its people! As the Imp of the Sun, players will explore sprawling, hand-crafted 2D environments, using platforming skills to navigate complex levels, and quick reflexes to combat various enemies, while gaining new power and abilities as they progress. Along the way, the Imp can befriend the remaining human villagers, and learn about them and their history by retrieving artifacts, Quipus, that recount the glory of the days of the Sun’s rule.”<br/><br/><br/><br/><ul><strong>Features:</strong><li><strong>Play with fire!</strong> You are a son of the Sun, and can wield the Sun’s scorching power<br/></li><li><strong>Streamlined gameplay</strong> built for fluid movement and combo-based combat<br/></li><li>Unique <strong>Peruvian-influenced art</strong> style and soundtrack, inspired by real-world relics of the Andean culture<br/></li><li>Experience <strong>five unique and punishing bosses</strong> in any order you choose, each with their own complex mechanics and backstory<br/></li><li><strong>Never stop</strong> getting better!<br/></li><li>IOTS is <strong>built to be played and re-played</strong>, as players learn how to better control the Imp and its powers, and navigate the environments<br/></li><li><strong>Set record times</strong> for your friends to compete against, or try to make the global/regional leaderboards!<br/></li><li><strong>Play Eclipse Mode</strong> for the truest experience in a darkened kingdom -- all areas are shrouded in total darkness until explored by the Imp. Veterans only!<br/></li><li><strong>Play Boss Rush mode </strong>to try to fell each of the five bosses in a row in a single run<br/></li><li><strong>Play Horde mode</strong> to see how long you can last standing against a never-ending onslaught of enemies</li></ul>", "metacritic": null, "released": "2021-03-04", "tba": false, "updated": "2023-03-18T05:27:05", "background_image": "https://media.rawg.io/media/screenshots/ac8/ac8e37ccac1554002f05f92aec9446ac.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 6, "owned": 28, "beaten": 2, "toplay": 5, "dropped": 2, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 4, "suggestions_count": 294, "game_series_count": 0, "reviews_count": 4, "platforms": ["PC"], "developers": ["Sunwolf  Entertainment", "Sunwolf Entertainment"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Sold Out", "Sunwolf  Entertainment"], "esrb_rating": null}