{"id": 566449, "slug": "the-dark-side-of-the-moon-2", "name": "The Dark Side of the Moon", "name_original": "The Dark Side of the Moon", "description": "<p>The Dark Side of the Moon is a fully interactive FMV / Interactive Movie hybrid, featuring live-action video and point &amp; click elements, along with a total of 5 different outcomes.</p>\n<p>When his two children randomly vanish throughout the night, it&#39;s up to you to help Dean Hamilton bring them back home. As the mystery deepens decisions will need to be made and it&#39;s down to you to make the right ones. Who can you trust? Who&#39;s doing this? What&#39;s the significance of the impending solar eclipse? And what are those strange glowing lights in the sky?</p>\n<p>Explore the quaint little village of Marywine, solve puzzles, make some startling discoveries and help unravel what&#39;s really going on in this sci-fi thriller.</p>\n<p>Featuring the acting talents of Anarosa Butler (Contradiction:Spot The Liar!, The Shapeshifting Detective) as computer geek conspiracy theorist &quot;Alyx&quot; and Rupert Booth (Contradiction:Spot The Liar!, The Shapeshifting Detective) as the evil &quot;Gedeon&quot;, The Dark Side of the Moon promises to bring you a thrilling adventure out of this world!</p>\n<p>The clock is ticking, and that eclipse is nearly upon us...and when it is...it&#39;s bye-bye children!</p>\n<p>KEEP WATCHING THE SKIES.</p>", "metacritic": null, "released": "2021-03-12", "tba": false, "updated": "2022-11-23T21:14:29", "background_image": "https://media.rawg.io/media/screenshots/33e/33ed337ac9b459960d8afbca3fed4742.jpg", "website": "https://www.tayannastudios.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 4, "owned": 32, "toplay": 7, "dropped": 1}, "playtime": 3, "achievements_count": 17, "ratings_count": 2, "suggestions_count": 171, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC", "Linux"], "developers": ["Tayanna Studios"], "genres": ["Action", "Adventure", "RPG", "Casual", "Indie"], "publishers": ["Tayanna Studios"], "esrb_rating": null}