{"id": 566488, "slug": "take-the-throne", "name": "Take the Throne", "name_original": "Take the Throne", "description": "<strong>Take the Throne is a new Massive Multiplayer Online Battle Royale game with up to 30 players in a free-for-all bloody fight to be crowned and take the throne! Take the Throne is built on PvP encounters and is filled with comedic physics-based gameplay. </strong><br/><br/><strong><h3>FEATURES</h3></strong><br/><ul><li>Official online battle royale servers with up to 30 players (regions in NA and EU)<br/></li><li>Play online custom games with 2-10 friends<br/></li><li>Create a private, locally hosted battle royale lobby in which friends can join via a code<br/></li><li>6 Unique Classes, each with their own abilities<br/></li><li>15 Unique survival maps, 2 soccer maps, 2 capture the flag maps<br/></li><li>Advanced fighting mechanics (3 different types of swings, as well as 2 class abilities)<br/></li><li>Weapon hit force (the lower health you are, the further you get hit)<br/></li><li>Customize your character with 60+ skins (each with 4 different variations) and 100+ weapons (Some skins and weapons are only purchasable with crowns you get from winning the battle royale)<br/></li><li>Fully physics-based combat and incredibly funny ragdoll physics</li></ul><br/><strong><h3>30 PLAYER LOBBIES</h3></strong><br/><br/>Take the Throne is a new Massive Multiplayer Online Battle Royale game with up to 30 players. Each round more players are eliminated until one player takes the throne!<br/><br/><strong><h3>FUN FIGHTING MECHANICS</h3></strong><br/><br/>Take the Throne combines ragdoll physics with advanced fighting mechanics and weapon hit force - where the lower health you are, the farther you get hit.<br/><br/><strong><h3>SATISFYING PVP ENCOUNTERS</h3></strong><br/><br/>Take the Throne is built on PvP encounters. Equip your weapon and have a choice at 3 different types of swings as well as unique class abilities! If you need to be on the defensive, use the block mechanic to avoid certain death!<br/><br/><strong><h3>ENDLESS CUSTOMIZATION</h3></strong><br/><br/>Take the Throne has thousands of skin/weapon combinations! Advancing further in the rounds/winning will allow you to purchase more skins or weapons.", "metacritic": null, "released": "2022-04-20", "tba": false, "updated": "2022-04-22T05:37:31", "background_image": "https://media.rawg.io/media/screenshots/eff/eff65920f9924f6c4b8dcda5d4e00eac.jpg", "website": "http://takethethronegame.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 234, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["TopVR"], "genres": ["Action", "Strategy", "Casual", "Massively Multiplayer", "Indie"], "publishers": ["TopVR"], "esrb_rating": null}