{"id": 566450, "slug": "noch", "name": "Noch", "name_original": "Noch", "description": "<p>Imagine… Night. You’re in a car, lost among endless forest on a highway. Perhaps you will desperately try to escape... Try not to lose hope. You were in hurry to get somewhere. But does it matter now?</p>\n<p>After all, Lisa has already destroyed the world and our reality has become unsteady, like a dream. All around, or maybe only around you, was an unimaginably thick sparkling black-blue haze with no end. The worst thing happens - an animal being scared to death by jumping to the road from the forest.<br />\nCrash. You are alive. You have to get out of the broken car and face what the time-changing reality has prepared for you. Welcome to the worst! And remember, waiting for dawn is useless, but death will not bring salvation...</p>\n<p>Can you survive if the nature of things as they are is destroyed? And what will you do if you meet the one that is hard to remember and impossible to forget? The one responsible for the endless night and darkness?</p>\n<p>Your adventure begins!</p>\n<p>A deeply crafted world set in a surreal apocalypse of abandoned cars, dangers, and secrets for the most sophisticated seekers of truth</p>\n<p>A staged story adventure filled with colorful characters, combining action and puzzle elements!</p>\n<p>Challenge the most dangerous opponents and bosses of the world of Noch! But be careful - plan and use every tactical advantage!</p>\n<p>Call a friend! Full-fledged cooperative mode for up to 2 players - fight and solve secrets together or distribute roles according to game preferences and go all the way to Noch hand in hand with a faithful companion.</p>\n<p>A unique system for interacting with game objects - explore the rich assortment of game objects and learn to solve puzzles</p>\n<p>Uncover the secrets of the other world with special abilities and minigames.</p>\n<p>Strength is also the answer; use weapons and brute physical strength to overcome obstacles!</p>", "metacritic": null, "released": "2023-09-30", "tba": false, "updated": "2024-04-12T14:11:54", "background_image": "https://media.rawg.io/media/screenshots/172/1729822a31aa41d6592d0f4402592e95.jpg", "website": "http://fairgames.studio/", "rating": 0.0, "rating_top": 3, "added_by_status": {"yet": 1, "owned": 28, "beaten": 3, "toplay": 3, "dropped": 1}, "playtime": 3, "achievements_count": 95, "ratings_count": 4, "suggestions_count": 158, "game_series_count": 0, "reviews_count": 5, "platforms": ["PC"], "developers": ["Fair Games Studio", "Noostyche"], "genres": ["Action", "Adventure", "Massively Multiplayer", "Indie"], "publishers": ["Fair Games Studio", "Pleasant Rain", "Sad Horse studio"], "esrb_rating": null}