{"id": 566552, "slug": "old-voyeur-hostel", "name": "Old Voyeur Hostel", "name_original": "Old Voyeur Hostel", "description": "Overview: In this adult visual novel you play the role of Sam, a smart guy who is charged by his old uncle Gedeone to manage a crumbling hostel while he will go in retirment in Florida. No salary for Sam, but the luck of taking advantege of the hundreds of hidden cams in the hostel's rooms. The player will meet cute and hot guests, and must find the way to catch their private moments, recording them to send them to Gedeone. During the 4 part of a single day (morning, afternoon, evening and night) the player will have access to all the cams hidden in the rooms, but even to several other features: managing the secretary looking for other guests, visiting the replay gallery to rewatch all the clue scenes in the game or spending time in the several ambients of the hostel to meet the guests and to improve his relationship with them, obviously with hot aims, using a game system based on several choices, who will develop the gameplay in several ways. (New features will come soon, because the game is in early access). This product is intended just for a Legal Age audience. This is a work of fiction. Any resemblance to actual persons or events is purely coincidental. All characters, even if they're purely fictional, are totally intended as adult and of legal age. No minors are involved at all in this work.", "metacritic": null, "released": "2021-03-01", "tba": false, "updated": "2021-03-05T04:01:21", "background_image": "https://media.rawg.io/media/screenshots/c67/c674af943e833d843eccc4d53ee05fd7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 414, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ashley Ratajkowsky"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Drunk Robot"], "esrb_rating": null}