{"id": 566510, "slug": "shutter-nyang", "name": "Shutter Nyang", "name_original": "Shutter Nyang", "description": "The 'Cat' was swept away by a wind with a strange camera!<br/>In order to return the camera to a friend, little girl, the cat set out a mysterious journey.<br/><br/>Join the mysterious journey of the 'Cat' with a camera!<br/>Use your imagination to overcome challenging obstacles and guide the ‘Cat’ back to his friends!<h3>KEY FEATURES</h3><ul><li>Use Mysterious Camera to explore new places. With ‘Shutter Nyang’ unique Camera Action mechanism, play the game with your own style! (Camera Action mechanism is specifically explained down below)</li></ul><ul><li>Complete the pictures with memory of the Cat and his friend, little girl. Photos were damaged by the fall! Find missing objects in the photos with the Cat’s fading memory.</li></ul><ul><li>Collect various Posters! There are various posters all around a world. Collect them and display them on the poster room!</li></ul><ul><li>Multiple endings! Players will affect the fate of the Cat and little girl. Various ending awaits you, from Happy ending to ridiculous endings!</li></ul><ul><li>Enjoy over 30 original music!</li></ul><h3>UNIQUE MECHANISM</h3>ShutterNyang is Platformer with unique mechanism called <strong>“CAMERA ACTION”</strong>. Using the camera on the cat’s head, players can take photo of various game objects. By taking photos, the camera not only copy images but also copy function of certain objects. After taking photos, players can paste those object photos anywhere in the game. Pasted photos have same function as original objects.<br/><br/>for Example,<br/><br/>Take a photos of a ‘Brick’ which function as a platform. By placing a photo of the ‘Brick’, the cat now have new platform to step on to. Using this function, players can create their unique new path go overcome obstacles.<br/><br/><br/><br/>By taking photos of the ‘Cat’ and pasting them, players can lure enemies(Dogs, Teddy Bears, etc.) to certain directions. Also by taking photos of the ‘Rainy Cloud’ and pasting them, players can hit enemies or themselves.<br/><br/><br/><br/>", "metacritic": null, "released": "2021-02-28", "tba": false, "updated": "2021-03-05T03:27:29", "background_image": "https://media.rawg.io/media/screenshots/53d/53dd764da9ff87d03209e3b2db52a469.jpg", "website": "https://www.projectmoreum.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 1, "achievements_count": 20, "ratings_count": 0, "suggestions_count": 259, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["PROJECT MOREUM"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Project Moreum"], "esrb_rating": null}