{"id": 566540, "slug": "pre-strike", "name": "Pre-Strike", "name_original": "Pre-Strike", "description": "Notice: Pre-Strike is currently an alpha build and in early access.<br/><br/>Strike your enemies before they strike you! Pre-Strike is a casual clicker game, focused on upgrading your camp and unlocking new characters in order to build up resources. The more resources you have, the stronger you are in this post-apocalyptic idle game!<br/><br/>In Pre-Strike, you’ll never be on your own! Get to know over ten different characters, each unique and brimming with all sorts of secrets to discover. Complete their personal quests and get to know them, making them much more likely to help you run the camp!<br/><br/>With each upgrade you do to the camp, the more your fellow survivors are likely to open up to you, telling you about their journeys, and sharing with you secrets -- sometimes about other members of the camp!<br/><br/>With 8 different unique areas to build upon and upgrade, the camp is full of potential! Help your crew get settled into their new home and become a formidable group of survivors. Work on the home and build a rockin' entertainment center to help raise their morale, thus encouraging them to work even harder… earning you more resources!<br/><br/>Learning the story of Pre-Strike is completely optional. If you just want to click and idle – no reading involved – then that’s cool! But if you want to get to know the characters and learn more about the world of the game, there’s an option to do that too in the journal!<br/><br/>Achievements: There are 16 achievements to get in Pre-Strike!", "metacritic": null, "released": null, "tba": false, "updated": "2021-03-05T03:50:43", "background_image": "https://media.rawg.io/media/screenshots/78b/78b8e89800665ff794c5919363c312e2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 17, "ratings_count": 0, "suggestions_count": 127, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Faucet Software"], "genres": ["Casual"], "publishers": ["Faucet Software"], "esrb_rating": null}