{"id": 566588, "slug": "memory-illusions", "name": "Memory Illusions", "name_original": "Memory Illusions", "description": "Memory Illusions is a single player VR looter shooter featuring realistic weapons, upgrades, attachments, randomize options, and player progression in fast paced action environments. <br/><br/><br/>Most of all Memory Illusions is about gun play and choice. Where you play and how you play is defined by you.  You can choose between arcade weapons functionality like quick reloads and simplified reloading or realistic weapons actions with realistic reloading, spread, recoil, bullet penetration and fire rates.<h3>Firing Range</h3>Head over to the firing range to learn each weapon with different target types.<h3>Sandbox</h3>Play in our sandbox with a variety of features that may or may not be in each level.<h3>Levels</h3>You can choose between levels; firing range, mini boss level and 80s outbreak (wave shooter).<h3>Key Features</h3><ul><li>Arcade or realistic weapons setup, firing, and reloading.<br/></li><li>Sitting, Standing, Room Scale VR, free movement and snap turning</li></ul><h3>Warnings:</h3><ul><li>Strobe effects and loud Audio effects are in use throughout this title. Muzzle flashes, flash lights, flash bangs and more can cause flashing and strobing lights in many of our levels. If you are sensitive to these affects you should not play this title.<br/></li><li>Designed for higher end machine so we can push the graphics and overall look of Memory Illusions. There are options to reduce the quality. We start the game on a medium setting.  If you have the hardware turn it up!<br/></li><li>Designed for VR headsets with newer controllers (Rift S, Index). While the vive wand is supported you won’t have all of the same functionality due to the limited inputs.<br/></li><li>Not currently testing on WMR headsets.<br/></li><li>No teleportation<br/></li><li>There are some situations that can make some players very motion sick.  We have included several options you can affect to try and alleviate this such as tunneling and speed reductions. <br/></li><li>This is an always online title as we are working towards a friends only co-op multiplayer option we only want to design, develop and maintain one set of instructions for the player.</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2021-03-05T04:29:29", "background_image": "https://media.rawg.io/media/screenshots/8e0/8e0dd070bd57d0d397866d0e5ed031ba.jpg", "website": "http://www.memoryillusions.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 389, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Tybug Studios"], "genres": ["Action", "Indie"], "publishers": ["Tybug Studios"], "esrb_rating": null}