{"id": 566591, "slug": "spitting-z", "name": "Spitting Z", "name_original": "Spitting Z", "description": "Spit into the microphone-kill the zombies!<br/>In this exciting and dynamic game you have to protect your harvest from pumpkin-eating zombies who got into the habit to visit your garden! To do this, you have a magic spitting stick!<br/><br/>You have to protect your pumpkins for 3 minutes from the hungry, but funny zombies.<br/><br/>The game is available in two levels of \"Farm\" and \"City\", to start the level - shoot the screen where it is displayed.<br/><br/>On the easy level of difficulty, you need to protect 6 pumpkins from pumpkin-eating  zombies, on the average - 4 and on the difficult - 2 pumpkins respectively.<br/>You'll get more points at the higher levels of difficulty.<br/><br/>Also do not forget the birds - they bring more points than the zombies!<br/>You will receive your points only if you win the round - at a loss the points are not charged!<br/><br/><ul><li> Tactics is everything for us! Sometimes it is more profitable to give a pumpkin to one zombie for shooting then all the zombies that will pass by you!<br/></li><li> Use a few seconds at the beginning of each round, when the time had already started, but the zombies have not appeared yet, to shoot as many birds as possible, because during the attack of zombies it is much more difficult to do it!<br/></li><li> Try to shoot zombies in the head - so you can kill them faster!</li></ul>", "metacritic": null, "released": "2021-03-02", "tba": false, "updated": "2021-03-05T04:31:46", "background_image": "https://media.rawg.io/media/screenshots/191/1913fe4f194c7921ccd4413e77015e6b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 294, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Funny Twins"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Funny Twins"], "esrb_rating": null}