{"id": 566610, "slug": "jie-di-gate", "name": "揭谛/GATE", "name_original": "揭谛/GATE", "description": "GATE is a text-based furry homo romance game developed by NVL maker, in which the player will play the role of the protagonist to \"break the system\" as an opportunity to establish a relationship with the furries and find a way to achieve peace between races.<br/><br/>Plot summary.<br/>In the year 3059, the furries are about to release new civilian technology products, and the Homo sapiens alliance has already obtained information about the military power they are flaunting and expanding behind. Under this threat, the hacker group hired by the Homo Sapiens Alliance secretly investigated that the highest technology of the furries was a set of super computing interactive modules [Empty Infinity]. The hacker group's crack team also went to the free countries at this time, attempting to crack and master the core of the system of the [Empty Infinity].<br/><br/>Game features:<br/>·The game setting and plot are not \"real\", but \"virtual, real, dreamlike\";<br/>·There are many kinds of art forms and comprehensive expression of emotion, scenery, sound and painting in the game;<br/>·In the game, the renaming system does not affect the name of the protagonist, but has certain significance;<br/>·The game contains an \"additional content\", which will be unlocked after a certain plot line is cleared.<br/><br/>WARNING: This game contains Gore, Religion, Same-Sex Relationships, etc.", "metacritic": null, "released": "2021-03-03", "tba": false, "updated": "2021-03-05T04:45:41", "background_image": "https://media.rawg.io/media/screenshots/ab8/ab87d10176ed60cb4d98ff84eec7ddd0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 116, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["团购规划局"], "genres": ["Indie"], "publishers": ["团购规划局"], "esrb_rating": null}