{"id": 566693, "slug": "onnect-tile-connect-puzzle", "name": "Onnect - Tile Connect Puzzle", "name_original": "Onnect - Tile Connect Puzzle", "description": "Onnect 2021 is coming!<br/>Onnect is a relaxing puzzle suit for all ages, start it whenever you tired or get bored, the game helps you feel better. Solve the puzzle within few minutes and try to be a master! Various tiles including Mahjong, umbrella, cake, etc, update regularly. <br/>The FREE game is a great time-killing puzzle, play it everyday to train your brain, use the boosters if you get confused. Now download it and have fun!<br/><br/>FEATURES:<br/> - Easy to start but hard to master<br/> - Various images, Mahjong, food, emoji, animals, etc<br/> - Auto-save, convenient to pause<br/> - Two modes, normal or no-time<br/> - Relieve stress and relax yourself<br/> - Train your brain and have fun<br/><br/>HOW TO PLAY?<br/> - Match tiles with the same images<br/> - Connect 2 pairs within 3 lines<br/> - Remove all tiles within limited time<br/> - Use hint booster to get tips<br/> - Use shuffle booster to refresh the tiles<br/> - Use demolition booster to remove bomb<br/><br/>Premium Subscription:<br/>– You can subscribe for unlimited access to unlock vip themes, remove non-reward ads, double rewards and double daily bonus.<br/>– Payment will be charged to iTunes Account at confirmation of purchase<br/>– Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period<br/>– Account will be charged for renewal within 24-hours prior to the end of the current period, and identify the cost of the renewal<br/>– Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's Account Settings after purchase<br/>– Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable<br/>purchases a subscription to that content.<br/><br/>Terms of Service: http://www.faithfultrd.com/tos/<br/>Privacy Policy: http://www.faithfultrd.com/private-policy/", "metacritic": null, "released": "2021-02-09", "tba": false, "updated": "2021-03-05T05:48:47", "background_image": "https://media.rawg.io/media/screenshots/385/3855c73577cdb029d95cad283ef8f1c4.jpg", "website": "http://www.faithfultrd.com/private-policy/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 46, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["LongRunX"], "genres": ["Board Games"], "publishers": ["FAITHFUL TRADE CO.,LIMITED"], "esrb_rating": "Teen"}