{"id": 566678, "slug": "warhammer-odyssey", "name": "Warhammer: Odyssey", "name_original": "Warhammer: Odyssey", "description": "A Warhammer Fantasy MMORPG like no other.<br/><br/>Morrslieb the Chaos Moon grows large in the skies above the Old World, under its wicked visage doomsayers take to the city streets and those creatures who would bring the walls of man crumbling down become ever more bold.<br/><br/>However, all is not lost! Those that would stand against the darkness and Chaos that threatens civilization have come together once more, honoring ancient pacts as they did in times long past. Now is the time for heroes, now is the time to forge your Odyssey.<br/><br/>EXPLORE THE WARHAMMER WORLD<br/>Journey to iconic locations of the Old World in a large open world MMORPG! Explore the bustling port of Marienburg, the defiled Drakwald Forest, and more remarkable locations like never before!<br/><br/>CHOOSE YOUR PATH<br/>Choose between 6 classes and 12 specializations with dynamic skills and playstyles. Play as a devout Warrior Priest dedicated to protecting their allies or a ravaging Slayer seeking the glory of battle. <br/><br/>MEET LEGENDARY HEROES<br/>Interact and help some of the most legendary characters in the Warhammer world. Forge your odyssey alongside favorite characters and make an impact in an increasingly dangerous world.<br/><br/>JOURNEY WITH FRIENDS<br/>Play alongside with friends to form Regiments of Renown, tackle tricky monsters, and conquer challenging objectives together to reap rich rewards! Sell your loot in the Auction House and become a Master of Commerce. <br/><br/>Stay Connected<br/>Follow us on our Social Media for latest news &amp; updates!<br/>Discord: https://discord.gg/whodyssey<br/>Facebook: https://facebook.com/whodyssey<br/>Twitter: https://twitter.com/whodyssey<br/>YouTube: https://youtube.com/whodyssey <br/><br/>Note: an internet connection is required to play this game.<br/>For the best gaming experience, the following specs are recommended: 4GB RAM.<br/><br/>Warhammer: Odyssey is completely free to download. It is possible to play through the game without purchase, however some in game items, features and enhancements can be optionally purchased using real money. If you do not wish to use these features, you can disable in-app purchases in your device settings.<br/><br/>", "metacritic": null, "released": "2021-02-22", "tba": false, "updated": "2021-03-05T05:41:08", "background_image": "https://media.rawg.io/media/screenshots/779/779e304abd38c98ff18bb9bfb5a66cb6_Ku1fdyA.jpg", "website": "https://warhammerodyssey.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 219, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Virtual Realms"], "genres": ["Adventure", "RPG"], "publishers": ["Virtual Realms"], "esrb_rating": "Teen"}