{"id": 566665, "slug": "pro-deer-hunting-2", "name": "Pro Deer Hunting 2", "name_original": "Pro Deer Hunting 2", "description": "Pro Deer Hunting 2 continues the great tradition of realistic deer hunting simulations! Major graphics enhancements, inclusion of the muzzle loading<br/>\r\nrifle and climbing tree stand are just a few of the new features. The same pro and action hunt gameplay are back with enhanced<br/>\r\nartificial intelligence for the deer you pursue. Keep the tradition alive and become the next Pro Deer Hunter 2!<br/>\n<br/>\r\n* Full support for Xbox1 controller<br/>\r\n* Pro mode hunt for simulated deer hunting.<br/>\r\n* Action mode hunt for realistic deer drive style hunting.<br/>\r\n* Ability to jump bedded deer adding another dimension to your hunt.<br/>\r\n* Enhanced controller options.<br/>\r\n* Expansive hunting areas to include Beech Forest, Pine Plantation, Snow Fields, and Prairie level.<br/>\r\n* Firearm and bow range for target practice.<br/>\r\n* Choice of firearms- scoped rifle, muzzle loading rifle, pump shotgun, and compound bow.<br/>\r\n* Ability to attract bucks with grunt tube.<br/>\r\n* Deer gear- platform tree stands, climbing tree stand, grunt tube, binoculars, and wind direction indicator.<br/>\r\n* Hunting Realism- attraction to feeding areas, different antler sized bucks, bucks chasing does, scent detection, and blood trailing.", "metacritic": null, "released": "2021-03-04", "tba": false, "updated": "2023-11-04T15:50:29", "background_image": "https://media.rawg.io/media/screenshots/a97/a978b603d018878fc498e16aa66ceb95.jpg", "website": "http://www.psroutdoors.com/PSR_games_pro_deer_hunting2.aspx", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 317, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "PlayStation 4"], "developers": ["PSR Outdoors"], "genres": ["Shooter", "Adventure", "Simulation", "Sports"], "publishers": ["PSR Outdoors Games"], "esrb_rating": null}