{"id": 566661, "slug": "pharaoh-a-new-era", "name": "Pharaoh: A New Era", "name_original": "Pharaoh: A New Era", "description": "<p>Immerse yourself in the history of Ancient Egypt with 50 missions and over 100 gameplay hours in Pharaoh: A New Era, a remake of Pharaoh (and the expansion Cleopatra: Queen of the Nile), one of the best city builders from the golden age of Sierra Entertainment. Stone by stone, build your city and manage all aspects of its development to ensure it prospers and makes you a powerful and revered Pharaoh.<br />\nONCE UPON A TIME IN ANCIENT EGIPT<br />\nDevelop your city by cultivating the fertile lands along the banks of the Nile valley. Erect the iconic monuments of Ancient Egypt, including the pyramids, the Sphinx and the Lighthouse of Alexandria. Build temples and mausoleums to help manage all aspects of your city&#39;s health and culture as well as the predominant polytheistic religion of the time.<br />\nEnsure your city is prosperous enough to deal with economic or political crises, or even plundering by enemies. A Pharaoh takes care of its people and does whatever it can to earn the favour of the gods.<br />\nBUILD 4000 YEARS OF HISTORY<br />\nPharaoh: A New Era celebrates 20 years since the release of the famous franchise with a complete remake, including more than 50 playable missions and over 100 hours of gameplay. Rediscover the map and mission editor mode that allows you to shape your very own Egypt over thousands of years.<br />\nThe &quot;Campaign&quot; mode teaches you the game basics while allowing you to experience a unique story in the heart of Ancient Egypt and explore all aspects of life in a thriving city.<br />\nYou have everything at your disposal to build an entire city and manage all its fundamental elements to ensure it flourishes: the economy, internal and external trade, culture, health, agriculture, education, etc. To help you monitor your progress, various indicators show you the overall well-being of your city and its residents.<br />\nMODERNIZED GRAPHICS AND GAMEPLAY MECHANICS<br />\nThe journey back in time is really brought to life with this Ultra HD remake, which upgrades the gameplay mechanics to modern standards and completely redesigns the captivating soundtrack and gorgeous isometric 2D graphics.<br />\nFEATURES<br />\n●  Rediscover the classic city builder Pharaoh and its expansion, Cleopatra: Queen of the Nile, in an all-new remake<br />\n●  Explore Ancient Egypt and its 4,000 years of history across 50 missions<br />\n●  Marvel at Ancient Egypt&#39;s most iconic and beautiful monuments with completely overhauled Ultra HD graphics<br />\n●  Erect the Egypt of your dreams with the map editor mode</p>", "metacritic": null, "released": "2023-02-15", "tba": false, "updated": "2024-01-08T18:45:16", "background_image": "https://media.rawg.io/media/screenshots/870/8701850a04e71b241fe7d887a5e2a7f2.jpg", "website": "", "rating": 3.33, "rating_top": 4, "added_by_status": {"yet": 3, "owned": 24, "beaten": 2, "toplay": 17, "dropped": 2, "playing": 3}, "playtime": 2, "achievements_count": 47, "ratings_count": 6, "suggestions_count": 484, "game_series_count": 0, "reviews_count": 6, "platforms": ["PC"], "developers": ["Triskell Interactive", "Triskell Interactice"], "genres": ["Strategy", "Simulation"], "publishers": ["DotEmu"], "esrb_rating": null}