{"id": 566612, "slug": "gravitrex-arcade", "name": "GravitreX Arcade", "name_original": "GravitreX Arcade", "description": "GravitreX started as a contender in the Swedish Game Awards Warm-up competition \"80's Warm-up\", which had 80's as its theme. GravitreX won that competition, and was later ported to Android. After a few years on Android, it was then turned into an arcade cabinet. Two or three cabinets still exist today, in different barcades in the Phoenix Arizona region. It has now come time to complete the circle and port it back to PC and Steam.<br/><br/>This 2D physics simulation has you trying to land two ships on their respective platform. Like the old classic Lunar Lander, but much more difficult and more heavily physics based.<h3>Features:</h3><ul><li>Two ships to land, even in singleplayer<br/></li><li>Ships are equipped with a grabber which can be used to lift boxes or other ships<br/></li><li>Ships are also equipped with an AutoHover System which can be activated by holding down the Switch Ships button (B)<br/></li><li>Ships have lots of systems that can be damaged<br/></li><li>When damaged, a classic synthetic voice will say what systems are damaged<br/></li><li>The voice warnings can be acknowledged (muted) by pressing a button<br/></li><li>As this is the Arcade version, every play you will start on level one<br/></li><li>Extra ships are awarded every 30k points<br/></li><li>35 levels of increasing difficulty. We are not kidding on this one.<br/></li><li>Perfect for Arcade Cabinets, can even be set up to accept coins (See 'If you happen to have an arcade cabinet' section below)<br/></li><li>Steam achievements<br/></li><li>Classic arcade style highscore with initials, with online entries from your Steam friends (All-time), and Global (Today).<br/></li><li>The first five players to beat the game will make it onto the \"Prime Five\" list on the web page</li></ul><h3>Controls:</h3><strong>XBox 360 Controller:</strong><br/>Bumpers = Thrusters<br/>(A) = Grabber<br/>(B) = Switch Ships / AutoHover (hold)<br/>(X) = Acknowledge warnings (until something else breaks!)<br/>(Y) = Self Destruct<br/><br/><strong>Keyboard:</strong><br/>Left/Right Control = Thrusters<br/>Left Shift = Grabber<br/>Right Shift = Switch Ships / AutoHover (hold)<br/>TAB = Acknowledge warnings (until something else breaks!)<br/>X = Self Destruct<br/><br/>P2 keyboard controls:<br/>F/H = Thrusters<br/>R = Grabber<br/>U = Switch Ships / AutoHover (hold)<br/>E = Acknowledge warnings<br/>I = Self Destruct<br/>Note: Playing two players on one keyboard will likely be crowded, these are more meant to be mapped to from an I-PAC or similar arcade button to keyboard key converter.<br/><br/>Whoever first starts the game will become Player 1. Whoever next pushes a control will become Player 2. If Player 1 has switched ships Player 2 will control Ship 1 only until the end of the level. Starting next level, Player 1 controls Ship 1.<h3>Tips and tricks:</h3><ul><li>A Ship that's been turned upside-down can usually be rescued using the grabber and the other ship. Don't immediately Self Destruct!<br/></li><li>Firing both thrusters simultaneously will stop the ship's rotation. If the ship is rotating to the right and you press both thrusters, only the right thruster will fire first, until the rotation has stopped. Unless, of course, the stabilizing system on that side is damaged.<br/></li><li>If both ships are destroyed at the same time, the level will be reset. Sometimes you will need to reset a level by self destructing both ships. If one ship is destroyed and you realize the level will need to be reset, Self Destruct the other ship quickly before it respawns, otherwise it will cost an additional life!</li></ul><h3>If you happen to have an arcade cabinet</h3>This only applies to cabinets with a PC inside of them of course. In the Options screen you will find an option that may interest you:<br/><br/><br/><strong>Coin Handling:</strong><br/><ul><li>None: This is the normal PC setting. There is no concept of coins, and players can jump in from any controller<br/></li><li>Freeplay: No coins needed to play, just press 1P or 2P start.<br/></li><li>Internal: This is the normal Cabinet setting. Inserting coins increases the credits ('5' on the keyboard or Select on the controller).<br/></li><li>External: This is if you have an external coin mechanism with its own credit counter. It should send keypresses to tell the game the credits situation: '0' for No credits ('INSERT COIN' will be displayed), '8' for 1 credit ('Press 1P Start' will be displayed), or '9' for Multiple credits ('Press 1P or 2P Start' will be displayed). Also, Multiple Credits can be pressed again and again to play the coin inserted sound effect.</li></ul><br/>In all coin modes except 'None', pressing 1P start ('1' on the keyboard, or Start on Controller 1) will start a 1P game and P1 then controls the game either from keyboard or controller 1. Pressing 2P Start will start a 2P game, with P2 controlling Ship 2 from P2 keyboard controls or controller 2. In the 'None' mode, pressing any input on any controller will start a game with P1 controlling the game from that controller, and the second controller to receive a button press will join as P2.<br/><br/>If you have a cabinet with default Mame key assignments, replace the \"KeyMap.cfg\" file with the \"KeyMap_MAME.cfg\" file. If you have different keys assigned, edit the file and adjust accordingly. Because many cabinets only have three buttons, in this config the stick is used for three of the buttons. Left=Mute, Down=Self Destruct and Right=Switch ships/Autohover. Feel free to change these if you have more buttons and want to use them.<br/><br/>Most arcade frontends can be tricked into launching PC games, usually by creating a dummy \"Emulator\" called PC, and maybe a dummy file as the \"rom\". This way GravitreX can coexist with all your other arcade games! If your cabinet does not have internet access, set Highscores to local in the options, and it will save highscores locally to a file instead (local highscores can also be selected from the options menu).<br/><br/>If you have a cabinet (or plan to build one), and want to put it somewhere public and actually charge real money from people, get in touch with us about getting a commercial license and a customized non-steam version of the game.", "metacritic": null, "released": "2021-03-03", "tba": false, "updated": "2021-03-05T04:47:19", "background_image": "https://media.rawg.io/media/screenshots/f55/f550e0ea427eb19d58a50042b9c1d6a0.jpg", "website": "http://www.dynamicentertainment.se/system/gravitrex/report.php", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 109, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Martin Hjerne", "Onnie Qvickström"], "genres": ["Casual", "Indie"], "publishers": ["Dynamic Entertainment"], "esrb_rating": null}