{"id": 566682, "slug": "stickman-archery-puzzle-master", "name": "Stickman Archery Puzzle Master", "name_original": "Stickman Archery Puzzle Master", "description": "Stickman Archery Master - Archer Puzzle Warrior<br/><br/>Be an Archer Hero (Arc-hero) and join the battle. Fight enemies, shoot 'em up and become an archer legend.<br/><br/>In an Upsiverse, where everything is illogical, your archer hero - Stickman must survive in a chaos world - ruled by stick enemy, zombies and shadow bosses. All you have is a classic bow, and you need to train yourself to be master with that weapon. But more levels you passed, more legend weapons you could find, and more mystical arrows you could discover on your way.<br/><br/>This game is easy to play, but hard to master. You might overcome really fast at first time, but strong enemies are waiting for you in the next dungeons. And you must be stronger day by day. Unlock new weapon, strengthen them, equip mystical arrows and fight the Shadow War.<br/><br/>Mr Stickman, are you ready to fight ? Are you ready to be a Bow Master and rescue the world. To restore order of the Earth, the world need you Archery Master.<br/><br/>Many puzzles are set up on your way, be careful, use them to destroy stickman enemies, but burn them out if they are dangerous to you. Here are some guideline you should follows:<br/><br/>- Drag and Release the Bow to aim and shoot arrow<br/>- Use boosters to boost up your flow<br/>- Collect rewards, arrows, bow parts, and go<br/>- Upgrade weapons and enjoy the show<br/><br/>P/s: Puzzles are everywhere - Don't miss them!<br/><br/>Download the game \"Stickman Archery Master - Archer Puzzle Warrior\" now!", "metacritic": null, "released": "2021-02-05", "tba": false, "updated": "2021-03-05T05:42:55", "background_image": "https://media.rawg.io/media/screenshots/65f/65fcc5d257e839e14d4c10b84f09e1ad_o1V0ZyX.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 93, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["doan lan"], "genres": ["Adventure", "Puzzle"], "publishers": ["doan lan"], "esrb_rating": "Teen"}