{"id": 566726, "slug": "gadlingers-cog", "name": "Gadlingers: COG", "name_original": "Gadlingers: COG", "description": "Welcome to Mythologia, the best ever happy land for us all.<br/>We just opened the brand new Zone - Creation of the G...<br/><br/>……//Noise//……<br/><br/>……Hello, can you hear me?<br/>Finally, got you connected by hacking into Mythologia!<br/>We could be found any time so I will be quick.<br/><br/>DONOT PLAY THIS GAME!!!<br/><br/>This FUTURE game has only ONE purpose: <br/>to erase all human memories of the fairy tales.<br/>Once you open the game, like me, you will find y…<br/><br/>……//Noise//……<br/><br/>……My apologies, about the connection issue.<br/>Let me bring you our brand new Zone: Creation of the Gods.<br/><br/>————————————————————————<br/><br/>·Gods and Daemons, gathering in the war<br/>For this project, Mythologia invited the most popular artists, including Hihara, Kiyamachi, *zoff, Na Ruo, and many others. Together we designed hundreds of characters, based on the classic fairytale “Creation of the Gods” for you. Voice casting arranged of course. <br/>You will definitely find your favorite.<br/><br/>·Massive plot; every AI has a plan<br/>Mythologia retells the story based on the original “Creation of the Gods”.<br/>Familiar gods come together to play the great show for you.<br/><br/>·Arrange carefully, for each round<br/>Easy to play; Multiple Strategies.<br/>Take your time and enjoy.<br/><br/>·Interact with them; grow with them<br/>Gods and heroes, they are summoned to fight for you. And, they talk to you.<br/><br/>·Relax and chat with the world.<br/>In Mythologia, you can connect with every player around the whole world. Cannot wait to see your new friendships.<br/><br/>——————————————————————————<br/><br/>We hope you will like our new Zone: Creation of the Gods.<br/>See you in the game.<br/><br/>Yours,<br/>Mythologia official.", "metacritic": null, "released": "2021-02-18", "tba": false, "updated": "2021-03-05T06:07:58", "background_image": "https://media.rawg.io/media/screenshots/17a/17a08d2e82a17316bd35fb1631938496_JK5iTlI.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 273, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mitama Technology Co"], "genres": ["Strategy", "Card"], "publishers": ["Mitama Technology Co"], "esrb_rating": "Everyone 10+"}