{"id": 566750, "slug": "aimees-interiors-home-design", "name": "Aimee's Interiors Home Design", "name_original": "Aimee's Interiors Home Design", "description": "Design? Fashion? Travel? Comedy? Yes! Aimee's Interiors has it all.<br/><br/>Meet charming Aimee Cooper, a young American woman from the Midwest who is about to make it big in the interior design world. Work alongside Aimee and become a go-to decorator for celebrities as well as laypeople. Challenge home design boundaries and create the most glamorous interiors in this new relaxing home renovation game for FREE!<br/><br/><br/><br/>Sharpen your decorating skills by designing homes, cafes, outdoor bars, living rooms, and many more visually stunning three-dimensional rooms. Discover trending home design styles, varying from the Mediterranean, Scandinavian to Japandi.<br/><br/><br/><br/><br/><br/>Travel with Aimee around the world, from Paris to Hawaii, and design properties ranging from luxurious mansions to farmhouse Fixer Uppers. Enjoy delightful stories, meet funny characters, and renovate their homes. Lots of good taste, humor, and drama are waiting for you!<br/><br/><br/><br/>Features:<br/><br/>Relax through play and express your creativity in each new Episode<br/>Discover trending designs and get inspired to create your own decorating style.<br/>Renovate fresh, glamorous spaces and learn about different interior design styles.<br/>Travel around the world and create custom designs for each country<br/>Experience a story filled with funny and heartfelt dialogue!<br/><br/><br/><br/><br/>Solve challenging blast puzzles to uncover Aimee's exciting story, unlock hidden areas, and decorate new spaces in each Episode. Relax, sit down, and enjoy this exciting story!<br/><br/>If you like to watch HGTV property renovation, home design shows, like Fixer Upper and Property Brothers, then Aimee's Interiors is a perfect virtual interior design game for you<br/><br/>Aimee's Interiors will be updated with more blast puzzles to solve and more fun story chapters regularly! Already played and enjoyed the game? Stay tuned for updates and drop us a review!<br/><br/><br/><br/><br/><br/>*DEVELOPER INFO*<br/><br/>We are Purple Cow Studio at Cookapps. We all love to watch home remodeling shows and browse Pinterest for inspiring interior photos. We create home decor games we love to play ourselves.<br/><br/>If you're into home design, join our vibrant design community on:<br/><br/>Facebook: https://www.facebook.com/PurpleCowStudios/<br/>Instagram: https://www.instagram.com/purplecowstudio_cookapps/", "metacritic": null, "released": "2021-02-17", "tba": false, "updated": "2021-03-05T06:20:53", "background_image": "https://media.rawg.io/media/screenshots/aa4/aa499f2c8b1b4183beeb0d801565797b_lCoFtfd.jpg", "website": "http://www.cookapps.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 237, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["CookApps"], "genres": ["Simulation", "Puzzle"], "publishers": ["cookapps"], "esrb_rating": "Everyone 10+"}