{"id": 566719, "slug": "merge-villa", "name": "Merge Villa", "name_original": "Merge Villa", "description": "Alice really needs your help in renovating her grandparent's home and bringing comfort back to her family's mansion. The tsunami destroyed everything, but with your help, the building for sure will be restored. Even better than it was before! Open the gate and let this unforgettable adventure begin!<br/><br/>Merge items into useful tools to renovate and decorate rooms of the mansion that were destroyed. Make repairs, design a new house with luxurious exterior and interior pieces of furniture. Create an absolutely unique home with your designer’s vision, style, and creativity. <br/><br/>Unlock new rooms and give them a total makeover, so no one can say that there was a tsunami. Reveal all the secrets that are hidden in every part of the house. With all the puzzles that are waiting for you there, you would never be bored!<br/><br/>Complete tasks and earn great gifts that will help you a lot with the restoration. Collect experience and level up the game to become the coolest merge master!<br/><br/>Meet new characters that will help you with the renovation and become friends with all of them! Also, don’t forget about the animals, they all need your attention! Help all the pets to have a nice place to live. Take care of all the fluffy puppies and lovely kittens, so all of them can have a loving home. <br/><br/>The game features:<br/>● Amazing gameplay: merge items that are needed to restore and decorate the mansion, and take part in this unforgettable adventure<br/>● Hundreds of unique tools to create and use in renovation<br/>● Dozens of in-game characters will help you restore and decorate the mansion.<br/>● Adorable pets: cute puppies and lovely kittens are waiting for you <br/>● Different rooms of the house, each with unique gameplay, luxurious decorations, amazing animations, and an addictive story - you won’t be disappointed!<br/>● It is effortless to understand and relax to play - merge two items and then renovate the house. It can’t be more simple.<br/>● A super free game you can even play offline<br/>● Merge Villa is absolutely free to play.", "metacritic": null, "released": "2021-02-10", "tba": false, "updated": "2021-03-05T06:04:29", "background_image": "https://media.rawg.io/media/screenshots/a9c/a9c16fe1f9b3063c2c1e961ddb144076_rpxfEHn.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 134, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["4Enjoy Games"], "genres": ["Casual", "Puzzle"], "publishers": ["4Enjoy Games"], "esrb_rating": "Everyone 10+"}