{"id": 566782, "slug": "gun-clash-3d", "name": "Gun Clash 3D", "name_original": "Gun Clash 3D", "description": "In the fantasy world ,become a stickman cowboy in the western lands tasked with secretly gathering crowd of cowboy stickman fighting against tower defense in battle simulator does not end.<br/>Gun Clash 3D is a battle race between the shooting battle of the mob cowboy fighting each other, the last destination to fight in the battle of heroes break realm defense is the winner by gather the guns and use your gun to shoot down all enemies in battle simulator fighting areas and try to survival.<br/> Use your great brain command your cowboy gang into a battleground for eternal glory in this epic clash of warriors.<br/>This is a crowd interview game where you become a cowboy you are responsible start and running alone and gathering the professional sniper of the west fighting for justice on your way to get a big gang .<br/> Gun Clash is battle war shooting game is the front attack mob fighter game. Using your strategy to rescue and gather stickman crowd on the running and use your shooting skills and your gun to shoot down all enemies in this free shooting game with the cowboy's secret mission to final clash<br/>An extremely attractive game, you have to control the finger moving left and right on your run collect professional gunmen and gather as an army gun shooter and bombard other equivalent troops to win. In the process of running and collecting cowboy shooter try to destroy enemies along the way avoiding all dangerous obstacles. The more stickman cowboy gunmen you collect, the higher your likelihood of winning the battle. Be the smart  fighting cowboy clash 'em all and fighting the gang io battle and win.<br/>You may have played many gun strike games but to play this shooting gang game will be very different<br/>How to play<br/>+ Collect the crowd cowboy sniper<br/>+ Try to run and avoid dangerous obstacles<br/>+ Run and shoot em up destroy enemies by use your best gun shooting skills  along the way<br/>+ Attack and gun to shoot down all enemies at the end of the road<br/>+ Run and shoot to survive in the battlegroud fatasy world and win<br/>The storyline that leads the crowd of this fascinating gun strike combined with strange plays will bring you fun<br/>Gather but cowboys battle survival to destroy the enemy, become best real gun shooter today. We give you a great experience when participating in this adventure shooting battle. Download Gun Clash now!", "metacritic": null, "released": "2020-09-24", "tba": false, "updated": "2021-03-05T06:34:52", "background_image": "https://media.rawg.io/media/screenshots/71d/71df89c0db8bce21eaa17a8851bf940f.jpg", "website": "https://galaxyshooter.club/savegirl/privacy.html", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 86, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["XGame"], "genres": ["Action", "Casual"], "publishers": ["XGAME SERVICE AND TECHNOLOGY JOINT STOCK COMPANY"], "esrb_rating": "Teen"}