{"id": 566705, "slug": "highschool-lunchbox-maker", "name": "HighSchool LunchBox Maker", "name_original": "HighSchool LunchBox Maker", "description": "Hello Kids!<br/><br/>It's time to back to school. Is your high school lunch food ready to take? <br/><br/>Play Lunch Box maker games for kids that promote health and fitness. Choose the foods that has the necessary vitamins and health benefits.<br/><br/>here is a new cooking game in town , in which you can pack your own lunch box with the food items of your choice. Choose from a wide range of sandwiches, burgers, cupcakes, chocolates ,Donuts, French Fries, Fruits , favourite Drink and your favourite dessert items Create The Best Lunch Box and  and get ready to eat have best Almuezro.<br/><br/><br/>We call it the decorating the most delicious, loved, amazing, colourful lunch boxes for your schools, classrooms and share them among your class fellows.<br/>We introduce you our new cooking game , it’s a High School Lunch Box Maker.Serve healthy balanced Food Box Meals today to your kids at school!.<br/><br/>With a little practice, you’ll be the ultimate  Top Chef Jr. , Lunch Box Master and decorator!!<br/><br/>========<br/>Features<br/>========<br/><br/>-Garnish items including colourful lunch boxes<br/>-Variety of burgers to decide and delight<br/>-Eat your school lunch food with the best friends.<br/>-Vast range of donuts and sweet desserts and sweet dishes<br/>-Assemble lunch box for kids.<br/>-Select your own lunch food.<br/>-Decorate kinds of lunch food &amp; Design the lunch box in your own style.<br/>-Enjoy different fast food in this small box with favourite drink.<br/>-Kitchen Cooking Simulation game for kids and girls and even for adults.<br/><br/>Start to make quick lunch for the school lunch box and have varieties of lunch idea for kids.<br/><br/>Download this for free! Have a nice day!<br/>Your Suggestions are considered as part of our regular development process. You can send us your compliments/feedback on zero.gravity.7255@gmail.com", "metacritic": null, "released": "2018-07-29", "tba": false, "updated": "2021-03-05T05:57:21", "background_image": "https://media.rawg.io/media/screenshots/eda/edab392d397a3b9089fc13233e42754e.jpg", "website": "https://www.zerogravitygame.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 82, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Yash Desai"], "genres": ["Simulation"], "publishers": ["Yash Desai"], "esrb_rating": "Everyone 10+"}