{"id": 566817, "slug": "flying-spider-stickman-hero", "name": "Flying Spider Stickman hero", "name_original": "Flying Spider Stickman hero", "description": "Super Hero Studio would like to welcome you to our 1st amazing super interesting 3D game  Amazing flying spider stickman hero Gangster of Real Crime City.<br/><br/>First time in the history of crime City flying Spider stickman hero has step into the Real Crime City to stop the crime and help innocent people. Big gigantic monsters have occupied the Crime City and its time for the Super spider stickman Web Hero to beat them and kick them out from Vegas Crime City. Gangsters, Mafia, Thugs, and Criminals are ruling the Vegas Crime City you have to stop them and defeat them by your super natural Powers and strategies.<br/><br/>Mad Octarious The Leader of gang and his gang trying to rule over the Crime City and spreading terror and crime is increasing. Innocent people and Vegas City is in serious danger if you have a craze to be a role model and Spider Hero or rope hero then show your heroic skills by rescue the people and save Vegas City.<br/><br/>This Spider hero game is different from others and has very interesting and realistic features.<br/><br/>Flying spider Stickman hero War FEATURES:<br/><br/> Flying spider hero can rob, shoot, fight and Throw WEB to all the criminals.<br/>Flying Spider Rope hero can Snatch cars, motorbike and bus from anyone.<br/> Spider stickman Rope Hero fly from one tower to another tower with WEB and climb over the building to the top.<br/> Don’t mess with the citizen otherwise police will arive and you don’t want to have trouble with Police.<br/> Flying spider rope hero warrior have mission place to get new missions.<br/>Destroy monster hero and other evil enemies by buying knifes, guns so you can fight against monsters and gangsters.<br/><br/>So would you dare to step into the Pure Vegas City? Don’t let these gangsters, mafia, monster hero, and criminals occupied the safe land.<br/>This super amazing Flying Spider Stickman hero free action game of 2020 is for legends, We welcome you to this futuristic Vegas city.<br/><br/>If you want to check your heroic skills come and play this Spider rope hero game show us how much potential you have in you.<br/>This is not just a battle it’s a war battle against Mafia, Criminals, and terrorists.<br/><br/>If you love Super Flying Spider Web Hero or stickman rope hero and want to be in his exciting character we welcome you to Vegas City.<br/>Get a real feel of flying and realistic play in 3D secret city environment.<br/>Your spider sense and skills can help many people and society from these dangerous brutal and cruel monster heroes.<br/>If you want to take the real feel of Flying Spider Hero and rope hero with the help of his web then play this game.<br/><br/>Your movement from one dimension to another dimension will be very very helpful for innocent people and Vegas City.<br/>Don’t let these criminals and monster hero rule over the Vegas City and be a strong Spider hero for them and give them a strong reply and take a strong revenge it is Spider rope hero time to stop the gangsters crime.<br/><br/>As long as Super Spider rope Hero is alive criminals are in target of Super Spider Web Hero and every time ready for rescue the people to fulfill his duty to be a gentleman of havoc society.<br/><br/>Use your super mutant strange rope hero Powers because you are a Super Web Spider Hero and kill all your super opponent villains.<br/>These criminals want to move in the society like a gangsters and it is your time to become a mortal incredible Spider Hero and destroy them.<br/>This is an  amazing adventure homecoming action 3D free game.<br/>Survival of a kung fu Spider Hero is very important in this magnificent and interesting rope hero game to stop the thief life of criminals.<br/><br/><br/>So what are you waiting for Download this amazing Spider rope hero Game.<br/><br/><br/>WE VALUE YOUR FEEDBACK:", "metacritic": null, "released": "2020-02-28", "tba": false, "updated": "2021-03-05T06:51:29", "background_image": "https://media.rawg.io/media/screenshots/55d/55db41ac851861819da76ba7ab6bc80e_uFLQe1o.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 103, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Arham Ehtasham"], "genres": ["Action", "Strategy"], "publishers": ["Arham Ehtasham"], "esrb_rating": "Teen"}