{"id": 566831, "slug": "ifly-paper-airplane-flying-game", "name": "iFly - Paper Airplane Flying Game", "name_original": "iFly - Paper Airplane Flying Game", "description": "iFly is an exciting, fast paced, pick up &amp; play joy ride.<br/><br/>Quotes<br/>“Just finished The Crippler. Haven't put it down all day. I'm spent. Yes -- its that good\"<br/><br/>\"Amazing! Great sound effects and lots of fun. What more could you ask for?\"<br/><br/>This addictively fun new flying game was created to be the ideal quick play challenge.  Test your paper plane flying skills while gliding through a field of obstacles, looking for and  landing on the metal grate before time runs out! <br/><br/>Challenge:<br/>After take off, navigate your paper airplane through gray rectangles to gain points and avoid red rectangles which deduct points.  Score as many points as you can, looking for and successfully landing on the metal grate for extra points before the clock ticks down.  If time runs out or you journey past the landing pad the game will end.<br/><br/>Flying:<br/>Hold screen at approximately a 45 degree angle.  Tilt device forward to fly down, back to go up, etc.  <br/><br/>Tips:<br/>The smaller the rectangle the greater the points gained or lost. <br/><br/>Just like a real paper airplane if you start to go up the plane will stall and fall backwards.  To recover tilt the device forward until you gain forward control.  <br/><br/>Lose the rectangle field?  Fly left or right until you find it again.<br/><br/>Featuring<br/>-configurable controls<br/>-addictive game play<br/>-multiple levels of increasing difficulty<br/>-time and high score challenge @ each level<br/><br/>REQUIREMENTS<br/>Compatible with iPhone &amp; iPod Touch<br/>Requires iPhone 2.0 Software Update", "metacritic": null, "released": "2009-02-07", "tba": false, "updated": "2021-03-05T06:58:54", "background_image": "https://media.rawg.io/media/screenshots/f77/f77515cdb1f82c3f8f64b7d4fb1e3e67.jpg", "website": "http://www.infrared5.com/iphone/ifly/index.html", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 42, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Infrared5"], "genres": ["Simulation", "Casual"], "publishers": ["Infrared5"], "esrb_rating": "Everyone 10+"}