{"id": 566839, "slug": "tute-pro", "name": "Tute PRO", "name_original": "Tute PRO", "description": "¡Por fin Tute PRO en el App Store!<br/><br/>El tute es posiblemente el juego de cartas de baraja española más emblemático. Tute PRO ofrece La variante de cuatro jugadores organizados en parejas -la variante más popular y entretenida.<br/><br/>La máquina se hace cargo de todos los jugadores (salvo al humano, claro), pudiendo elegir el nivel de dificultad a conveniencia. Tras configurar la partida, se reparten las cartas y se empieza a jugar. En el turno del jugador se marcan las cartas válidas (para no cometer renuncio) y se pulsa en la carta que se quiera echar. <br/><br/>Tute PRO no tiene anuncios y una inteligencia artificial increíble, comparable a la de un tahúr en el nivel “Profesional”<br/><br/><br/>Con Tute PRO podrás:<br/>- Jugar al tute de cuatro jugadores<br/>- Consultar tu ranking entre todos los jugadores de Tute<br/>- Ver tus estadísticas<br/>- Elegir entre 9 personajes diferentes<br/>- Configurar la rapidez del juego, número de juegos de la partida, opciones de cante y doble, ver puntos, ajustar rapidez y sonido<br/><br/>Tute está disponible en cualquier iphone, ipad e ipod con iOS 7 o superior.<br/><br/>Si te gusta el tute éste es tu juego.<br/><br/>Puedes consultar las reglas del tute en los siguientes enlaces:<br/>http://es.wikipedia.org/wiki/Tute<br/>http://www.ludoteka.com/tute.html<br/><br/>Contacta con nosotros en producciones.don.naipe@gmail.com para contarnos tus impresiones, sugerencias de mejora o solución de problemas.<br/><br/>Puedes encontrar más información en nuestra web:<br/>http://donnaipe.com", "metacritic": null, "released": "2014-04-17", "tba": false, "updated": "2021-03-05T07:03:36", "background_image": "https://media.rawg.io/media/screenshots/f4c/f4cd58487b0feae0f3bb73a7314c7c45_u0pJtA3.jpg", "website": "http://donnaipe.com/app-ads.txt", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 70, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Guillermo Vega Gorgojo"], "genres": ["Board Games", "Card"], "publishers": ["Guillermo Vega Gorgojo"], "esrb_rating": "Everyone 10+"}