{"id": 566810, "slug": "stickman-war-legend-of-stick", "name": "Stickman War Legend of Stick", "name_original": "Stickman War Legend of Stick", "description": "Stickman War Legend of Stick - a new fun and addictive real-time strategy game with famous stickman heroes! RTS game in a medieval setting with elements of survival, you can control your army and individual warriors.<br/><br/>Get gold to recruit more fighters to your army. At your disposal: miner, stickman warrior, archer, Spartan, giant, and even a catapult. Upgrade your army by improving the skills and weapons of the stickmen. Strengthen your fortress. Get ready for the legendary battle of the stickmen. The outcome of the battle depends only on you.<br/><br/><br/>Campaign Mode<br/>Complete an exciting stickman adventure in campaign mode. Conquer new lands ranging from ancient Rome, Troy to Asia and Egypt. Immerse yourself in the era of medieval battles and the legacy of ancient civilizations. Defend your castle from the invasion of enemy troops of stickmen, Vikings, samurai and pirates. Besiege the enemy castle and destroy it to win. Use unique tactics for each battle and location. More than 20 unique tasks are waiting for you!<br/><br/><br/><br/>Survival Mode<br/>The bonus survival mode will allow you to take part in an endless battle. Earn points to upgrade your soldiers and towers. Manage your resources correctly to survive. You must survive as long as possible from the raid of enemy warriors. <br/><br/><br/>Online mode<br/>Fight against players from all over the world or friends online. Show whose army of stickmen is cooler.<br/><br/><br/>Game Features:<br/>- Many new game locations and levels<br/>- New design that will appeal to all fans of stickman games!<br/>- Unique and new characters<br/>- Large selection of game modes<br/>- Upgrade army and units<br/>- Bonus levels<br/>- Amazing stunts and animations!<br/>- Amazing HD graphics<br/>- Exclusive soundtrack<br/>- Hardcore gameplay", "metacritic": null, "released": "2021-02-15", "tba": false, "updated": "2021-03-05T06:47:55", "background_image": "https://media.rawg.io/media/screenshots/c89/c893458c5b693dc76727d2f1e8591640_xDow82N.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 110, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Anna Nikolaevna"], "genres": ["Strategy"], "publishers": ["Anna Nikolaevna"], "esrb_rating": "Everyone 10+"}