{"id": 566832, "slug": "fury-of-dracula", "name": "Fury of Dracula", "name_original": "Fury of Dracula", "description": "Fury of Dracula: Digital Edition is the digital adaptation of the much-loved board game, first published in 1987 by Games Workshop. Based on the 4th Edition of the game, this faithful adaptation allows you to re-experience this iconic game of gothic horror and deduction in a whole new way.<br/><br/>Fury of Dracula is a board game that emphasizes hidden movement and teamwork, with the hunters having to coordinate their movements to close the net on Dracula. Players take turns moving across Europe, with Dracula moving in secret as he increases his influence. Dracula has a host of tricks and traps up his sleeves, to misdirect and hide from the hunters - but the hunters are armed with plenty of tools too!<br/><br/>Each hunter provides a new way to play, with unique stats and abilities to aid them in the fight against this ancient evil. Dracula himself has a range of unholy powers to call upon, allowing him to transform and enthral humans, along with transforming into a bat or mist in order to escape the hunters.<br/><br/>Once the hunters and Dracula finally clash, bloody and gruesome combat ensues. Nobody is safe as Dracula lashes out at his pursuers, and the hunters battle against the inhuman and immortal Count. Featuring a card-based combat system that rewards bluffing and tactical choices, no two clashes are the same.<br/><br/>Features:<br/><br/>DETAILED TUTORIAL - In-depth tutorials walk you through everything to start your hunt.<br/><br/>A FAITHFUL ADAPTATION -  Based on the 4th Edition of the physical game, Fury of Dracula: Digital Edition recreates the iconic board game in its entirety.<br/><br/>MULTIPLE GAME MODES - Choose from battling against the AI, teaming up with friends locally or taking the hunt global with up to five players in online battles.<br/><br/>HAUNTING ANIMATIONS - The artwork from the original board game bursts to life with beautiful and bloody animations for every single piece.<br/><br/>A CHILLING SOUNDTRACK - Composed and created from the ground up for Fury of Dracula: Digital Edition, this soundtrack is sure to send chills down your spine.<br/><br/>ONLINE PLAY - Take the hunt online with up to 5 players, with in-game chat to help coordinate your search across Europe.<br/>Will you take on the role of Dracula as he increases his influence over Europe? Or will you and up to three friends take on the role of Dr. Abraham Van Helsing, Dr. John Seward, Lord Arthur Godalming, and Mina Harker as they attempt to stop him before his bloody plans bare fruit? Join the hunt now!", "metacritic": null, "released": "2021-02-17", "tba": false, "updated": "2021-03-05T07:00:14", "background_image": "https://media.rawg.io/media/screenshots/8e9/8e928f7a091ea809523868df8aae0070_CkjhbvZ.jpg", "website": "https://nomadgames.co.uk/contact-us", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 273, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Nomad Games"], "genres": ["Strategy", "Board Games"], "publishers": ["Nomad Games"], "esrb_rating": "Everyone 10+"}