{"id": 566927, "slug": "the-golden-rule", "name": "The Golden Rule", "name_original": "The Golden Rule", "description": "<p>If you’re just coming from playing my Twine story, you’re probably wondering how in the world I landed on this storyline. </p>\n\n<p>Our story begins in week 2 of CMI 3370 when we were asked to complete the Pixar in a Box activity. One of the prompts from this activity was a “What If” statement. It just so happened that one of the \"What If’s\" I came up with that week was “What if you could choose your own religion?”. </p>\n<p>I’d like to preface this by saying that my idea for the story has evolved over time, especially as I started to format it in a superhero context. Also in big part thanks to Professor Schweizer for his brainstorming sessions with me! Here’s where we are today: Shuri (from Black Panther) is a young girl yearning to explore the world for herself, especially after confronting the fact that she isn't ready to commit to her family’s religion. Shuri sets off on a quest to explore other religions, with the help of other Marvel superheroes, until she is eventually able to make the decision of whether or not she wants to proceed with the coronation. \r\n</p>\n<p>Her ultimate want is to have autonomy over her life and make some choices for herself, which she does (through you!). Her need — to discover her truth — leads to a series of 3 outcomes: (1) proceed with the ceremony and find peace in your decision, (2) proceed with the ceremony but only after discovering the Golden Rule, and (3) ditch the ceremony and leave Wakanda to discover life for yourself.  Or are there 4? Guess you'll have to find out!</p>\n<p>To discover each of these paths, the player first has to make an expressive choice (how to react to Mom). Each expressive choice leads them to a pair of superheroes debating their opposing religious views, who then helping Shuri make a decision by each offering their own path. This is an example of a dilemma. Most of these paths lead to the 1st and 3rd outcomes. There is only one path that leads to discovering the Golden Rule, and it’s the path I think I would take in Shuri's situation. These choices may be reflective of your personal decisions and preferences in life… or perhaps you’re looking to try out something new. All in all, there are 6 distinct paths you can take to make it to the 3 (or 4...) final outcomes. <br/></p>\n\n<p>To create a more dynamic story, I also included the use of images, link macros, colored text, dynamic text, a colored background, and a list variable that’s used in the end to recount your decisions and show you how they led you to your fate. \r\n</p>\n<p>I hope you enjoy reading this story! I may or may not dive into really exploring this religious journey outside of the superhero context in the future… guess you’ll have to stay tuned to find out!\r\n</p>", "metacritic": null, "released": "2021-03-04", "tba": false, "updated": "2021-03-05T07:28:49", "background_image": "https://media.rawg.io/media/screenshots/e2f/e2f763cbde1524e8b6438e0d113c7fb9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 57, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["mcsloth"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}