{"id": 566943, "slug": "the-beach-episode", "name": "The Beach Episode", "name_original": "The Beach Episode", "description": "<p><strong>Artists Statement: </strong></p>\n<p>The purpose of this project was to create a small adventure where the player explored a day at the beach. They go to the beach, have some fun, and go home. It’s nothing crazy complicated or anything. A far cry from the over-ambitions on my last project or the original idea.</p>\n<p>The original intentions read somewhere along this line. </p>\n<p><em>“The purpose of the project is to create a traditional \"beach\" episode. Which is a term used in anime to describe a wind down and reflection episode of the series. The characters go to the beach and deal with any issues that have been plaguing them up until that point. More often than not by talking it out. Plus, I thought the beach would be a cool setting.</em><br/></p>\n<p><em>I hope to achieve a concise story that ends once all the NPC's problems are solved. Once the character is done surfing 10 waves, completing that minigame, they come back to the beach to solve problems that occur on the beach and in the car park. After everything is solved, the player leaves the beach and goes home. This is done with recurrent variables and a new beach and car park map that look exactly like the one the player was just on, but have different sprites.”</em></p>\n<p>I still kept elements, but vastly cut my scope, mostly due to time constraints. For the conversations later in the game I used a variable to check on the amount of Wave items collected by the player, and this triggers new dialogue to the player and a special ending. Speaking of endings, you can just leave and straight up not play the game if you wanted, just take the path left and go home.<br/></p>", "metacritic": null, "released": "2021-03-04", "tba": false, "updated": "2021-03-05T07:32:50", "background_image": "https://media.rawg.io/media/screenshots/ebe/ebe8d8f11a5082798ef08d43d68432fa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Purple"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}