{"id": 566933, "slug": "operation-orbit", "name": "Operation O.R.B.I.T", "name_original": "Operation O.R.B.I.T", "description": "<p>~~~~~~~~~~~~~ English Version Below ~~~~~~~~~~~~~<br/></p>\n<p>Este jogo foi criado durante a minha incubação no Silício Fluminense. Foi meu primeiro experimento com jogos mobile multiplayer.</p>\n<p>Operation O.R.B.I.T. é um jogo para dispositivos móveis baseado no combate direto de 2 a 5 jogadores. O jogo resume-se em atirar projéteis nas bases de outros jogadores até destruí-los. Para lançar esses ataques o jogador deve preparar sua câmera de tiro, determinar seu ângulo e por fim, definir sua força.<br/><br/>Trazemos uma abordagem diferente pois o mapa é baseado em um sistema de galáxia 2D, onde os jogadores terão suas bases estabelecidas em diversos planetas e utilizarão da gravidade e do atrito do ar para percorrer o espaço.<br/><br/>O jogo tem bastante referência de jogabilidade no WORMS e Angry Birds SPACE. Além disso, sua arte e narrativa vêm da série animada \"A Turma do Bairro\".</p>\n<p> Este jogo foi produzido em 2018 e  o nome do grupo era \"Colinas Games\".<br/></p>\n<p>~~~~~~~~~~~~~ English Version ~~~~~~~~~~~~~<br/></p>\n<p>This game was created during my incubation in Silício Fluminense. It was my first experiment with mobile multiplayer games.</p>\n<p>Operation O.R.B.I.T. is a game for mobile devices based on the direct combat of 2 to 5 players. The game is all about shooting projectiles into other players' bases until you destroy them. To launch these attacks the player must prepare his camera, determine its angle and finally define its shoot strength.</p>\n<p>We bring a different approach because the map is based on a 2D galaxy system, where players will have their bases established on different planets and will use gravity and air friction to travel through space.</p>\n<p>The game has a lot of gameplay reference in WORMS and Angry Birds SPACE. In addition, his art and narrative come from the animated series Codename: Kids Next Door.</p>\n<p> This game was produced in 2018 and the group's name was \"Colinas Games\".</p>", "metacritic": null, "released": "2021-03-04", "tba": false, "updated": "2021-03-05T07:30:28", "background_image": "https://media.rawg.io/media/screenshots/f73/f73e765708418b2bcb03116519710559.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 62, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Xalomango"], "genres": ["Shooter", "Strategy"], "publishers": [], "esrb_rating": null}