{"id": 567085, "slug": "search-party-directors-cut-2", "name": "Search Party (Director's Cut)", "name_original": "Search Party (Director's Cut)", "description": "<p>SEARCH PARTY is a survival horror game inspired by the cat/mouse gameplay of Clock Tower, and the resource management of classic Resident Evil.</p>\n<strong>\n</strong><p><strong>** INCLUDES STEAM KEY **</strong><br/></p>\n<p>Claire's 8-year-old brother, Daniel, is missing. While looking for him during a search party, she finds herself completely lost and alone in the woods. She eventually spots a strange house in the distance... could Daniel be inside?</p>\n<ul><li>Search for tools and weapons to defend yourself as you sink deeper into a hopeless nightmare of despair.</li><li>Move carefully through the house. He's hiding and waiting for you.</li><li>Enjoy beautiful SNES style graphics that extend beyond the limitations of the 90s</li><li>Prepare to be shocked and sicken by this morbid true crime slasher tale.</li></ul>\n\n<p>What's New in the Director's Cut?</p>\n<ul><li>2 new (secret) endings. A total of 5 endings to discover.</li><li>A new area to explore, which expands on an existing ending for the original game.</li><li>Unlockable costumes and items, for post-game completionists.</li><li>Some re-done art assets, and additional environmental detail / interaction.</li><li>Lots of other tiny tweaks and additions that make this a more complete version over the original.</li></ul>\n<p><em>Even if you've already played the original, there's still plenty of reasons to rejoin the SEARCH PARTY!</em></p>", "metacritic": null, "released": "2021-03-04", "tba": false, "updated": "2021-03-05T08:10:45", "background_image": "https://media.rawg.io/media/screenshots/153/1538b742794da95a036da3abe1a085ae.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 126, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["TORTURE STAR VIDEO", "lum"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}