{"id": 567060, "slug": "mushroom-village", "name": "Mushroom Village", "name_original": "Mushroom Village", "description": "<p>Português</p>\n<p>Cogumelo Village foi inspirado no letramento racial, onde 07 aldeias de cogumelos separadas por ignorância de sua população deixavam as histórias dos mais antigos sobrepor a igualdade entre as aldeias.</p>\n<p>No meio dessa separação a natureza resolveu unificar e mostrar que tudo aquilo que eles sabiam estava errado. Os ents escolheram um pequeno cogumelo desajeitado para mostrar que tudo poderia mudar e a união fará com que a rivalidade desapareça e todos cresçam.</p>\n<p>Aldeia de Cogumelos Maitake nossa jornada inicia aqui, onde um cogumelo desajeitado chamado de Wesley Taikinho está correndo para a escola e no meio do caminho se depara com o primeiro Ent chamado Leo Gameleira, que ao ver o pequeno taikinho resolve então que esse seria o portador da palavra dos Ents para unificar os cogurejos.</p>\n<p>English</p>\n<p>Mushroom Mushllage has been inspired by the racial literacy where 7 mushroom mushllages were separated by its people's ignorance that let the elders’ stories overlap the equality between the mushllages. In the middle of this separation, nature chooses to unify and show that everything they knew was wrong. The <em>Ents </em>chose a little clumsy mushroom to show that everything could change and bonding can make competition disappear and so everyone can grow.</p>\n<p>Mushroom Mushllage Maitake, our journey begins here where a clumsy mushroom named Wesley Taikinho is running to school and on the way he meets the first Ent named Leo Gameleira that seeing the little Taikinho makes a decision that he would be the word bearer for the Ents so they can unify the Mushllages. Leo Gameleira starts to explain to the little one that it was time for the mushllages to come together and he would help make this happen. Leo also explains that in each mushllage one of his brothers will be there to help him.</p>", "metacritic": null, "released": "2021-03-04", "tba": false, "updated": "2021-03-05T08:03:51", "background_image": "https://media.rawg.io/media/screenshots/90a/90a5c44d29765019c94ef725d541c570.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 124, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Guaru Estudio", "vhsgamesdev"], "genres": ["Action", "RPG"], "publishers": [], "esrb_rating": null}