{"id": 567479, "slug": "beauty-and-the-thug", "name": "Beauty and the Thug", "name_original": "Beauty and the Thug", "description": "<p>Heroine moves to the big city, having a great plan for how to reach success. She studies for college, increases her different skills, learns her body, develops her sexuality, and discovers her fetishes. She would spend the whole summer studying English, math, science, and her kinks, but life makes some corrections. By the end of this summer, her life will turn into hell, or she will become the happiest girl in the world. Everything depends on your choices.</p>\n<p> The main character tends to be a good girl, but your choices could make her do weird things. Actually, she can do a lot of weird things, such as flashing her privates outdoor, playing with her butt, edging herself and ruining orgasms, tying herself to feel helpless, you name it. Overall, there’re 18 different fetishes she can learn. Only handjob and foot fetish the protagonist can learn easily; you’ll progress much slower studying all the others. You have no chance to develop all of them during one game, so she’ll need to play several times to master all of them. Of course, all extreme content is avoidable.</p>\n<p> The protagonist falls in love with a male or female character or with both of them. Though, it doesn’t prevent her from developing her fetishes. Moreover, the protagonist’s partners assist her eagerly. True love is when you love your partner for who she is with all her flaws and kinks, isn’t it?</p>\n<p> Despite being an adult novel and having a lot of hardcore scenes, I tried to make a serious story about true love and true friendship, about hard choices and their consequences.</p>\n<p> \r\n  Please, be advised that this is the very first version of the game. You can play only the first day of the novel. For now, the game contains 905 images and 83 animations.</p>\n\n<p>Patreon: Ze-game-eZ</p>", "metacritic": null, "released": "2021-03-03", "tba": false, "updated": "2021-03-05T09:42:19", "background_image": "https://media.rawg.io/media/screenshots/a05/a0545bac102f83b09d583f26e6dfaa30.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 461, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["zegamez"], "genres": [], "publishers": [], "esrb_rating": null}