{"id": 567525, "slug": "names", "name": "Names", "name_original": "Names", "description": "<p><strong>Description</strong></p>\n<p>Names is an interactive piece that allows players  to understand one aspect of the deterioration of cultural and familial history when immigrants assimilate into their country of residence. </p>\n<p><strong>Premise</strong></p>\n<p>In most cultures, names are a way for families to pass their cultural heritage and beliefs to their descendants. In a way, names are a way to preserve and establish  identities for both the named individual and their family. Through creating this piece, I wanted to understand how well this particular type of cultural heritage has been preserved amongst second generation immigrants in North America. </p>\n<p><strong>Methodology</strong></p>\n<p>As the designer and developer of this independent project, I wanted to create a simple and intuitive experience for players as they interact with and learn about each name.</p>\n<p>Because I wanted participants to feel comfortable discussing their personal experiences, I tried to keep the process of answering these questions conversational and organic, leaving my own voice in many of these stories.  Each answer is represented by the words or characters that spell out the participant's non-english name. If the participant did not know how to spell or write their name, then I replaced the missing characters with question marks. </p>\n<p>I wanted to make it easy for the player to find and choose what names they want to click on to hear a story. To do this, I placed the player at the center of the game world so they could easily turn around to see all the different names. I also want the overall visuals of the piece to  resemble a starless sky and the giant names surrounding the player to feel like celestial specters. This way the experience would not feel tied down to any particular cultural or tangible setting.  </p>\n<p><strong>Artist Statement</strong></p>\n<p>Rather than create a personal commentary on cultural diaspora, I wanted to create an experience that demonstrates one of the main effects cultural assimilation has had on immigrant families. </p>\n<p>In the process of creating this piece, I found that many individuals have answered that it was easier to keep their cultural heritage hidden due to the social pressures faced growing up. As a result, their identity inherited from their families held less meaning over time. </p>\n<p>The player’s agency in selecting a name is core to developing their interactive experience. The first aspect to this agency is the player’s action in looking around the dark space, selecting a name and choosing to listen to the associated story. The second, the player’s choice to listen to multiple names at the same time or none at all. This experience, in choosing how and how many names to listen to, aimed to build a sense of empathy between the player and the chosen name. As such, the personal connection the player might have with the associated story will be created through their choice to reach out and interact with the name. </p>\n<p>Ultimately, I hope that the collection of stories will create a space for players to identify with the struggles implied. Because many immigrant children choose to hide this part of their identity, it is hard for them to connect to others experiencing the same issue. The interaction and display of these stories was, in a way, meant to give certain players an opportunity to identify with this type of cultural diaspora, and encourage them to understand their own cultural and familial identity.</p>", "metacritic": null, "released": "2021-03-02", "tba": false, "updated": "2021-03-05T09:53:46", "background_image": "https://media.rawg.io/media/screenshots/8e1/8e1cc574f01edc49679bf8ebf9013f99.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 9, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Eragon1731"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}