{"id": 567546, "slug": "poseidons-wrath-by-sander-alsema", "name": "Poseidon's Wrath by Sander Alsema", "name_original": "Poseidon's Wrath by Sander Alsema", "description": "<p>--- Poseidon's Wrath ---</p>\n<p>Written by Sander Alsema for the 10-liner competition 2021.<br/>Language: Commodore 64 Basic v2<br/>Category: PUR-80</p>\n\n<p>--- Description &amp; Instructions ---</p>\n<p>These are dark times for the fabled sunken city of Atlantis. It is in great<br/>peril of being invaded by evil purple squids. All that stands in their way<br/>is Poseidon, Greek god of the oceans.</p>\n<p>It is your sacred task to intercept the squids before they can cross the<br/>screen. You do this by stabbing them with your trident.</p>\n<p>Here's how you operate your harpoon:<br/> - Press \"&lt;\" to move to the left.<br/> - Press \"&gt;\" to move to the right.<br/> - Press <space> to stab.</space></p>\n<p>If you fail to intercept one squid, you will lose the game.<br/>But when you have intercepted fifty of them, you will win!</p>\n<p>Unlike games that are in an infinite loop, where you just score points<br/>until you die, this game actually has a victory condition.<br/>This means you can win and feel really proud of what you have accomplished!</p>\n<p>--- Code Explanation ---</p>\n<p>Line 0: Read the data for the victory text string, the two squid animation<br/>        frame strings and the top part of the harpoon string.</p>\n<p>        Create the vertical orientation string and the bottom part of the<br/>        harpoon string.</p>\n<p>        Combine the top and bottom parts to form the complete harpoon<br/>        string.</p>\n<p>        Read the keyboard buffer to clear it.</p>\n<p>Line 1: Clear the screen and display the number of squids slain.</p>\n<p>        Set the variable for the harpoon stab phase.</p>\n<p>        Set the variable for the bitwise animation frame indicator.</p>\n<p>        Set the variable for the harpoon length.</p>\n<p>        Set the variable for the horizontal position of the squid.</p>\n<p>        Set the variable for the vertical position of the squid with a<br/>        random value, taking the squid score in account; the higher the<br/>        score, the higher up the squid.</p>\n<p>        Set the variable for the horizontal position of the harpoon.</p>\n<p>        If the score has reached 50 then jump to line 8</p>\n<p>Line 2: Display the harpoon.</p>\n<p>        Read a key from the keyboard.</p>\n<p>        If the key pressed was <space> and the harpoon is not being stabbed<br/>        with, then start the stabbing by initiating the stab phase.</space></p>\n<p>Line 3: Display a squid animation frame. Which one is decided upon the<br/>        least significant bit of the frame indicator.</p>\n<p>        Set the variable for this least significant bit.</p>\n<p>        If the harpoon is being stabbed with, then calculate the length of<br/>        the harpoon and progress the stab phase.</p>\n<p>Line 4: Set the background colour to cyan.</p>\n<p>        Move the squid to the right, depending on which frame is displayed.</p>\n<p>        Shift all bits in the frame indicator to the right and reset the<br/>        3rd bit, but only if the previous least significant bit was set.</p>\n<p>        If the key pressed was \",\" and the harpoon is not being stabbed<br/>        with and the harpoon is not to the far left, then move the harpoon<br/>        to the left.</p>\n<p>Line 5: If the key pressed was \".\" and the harpoon is not being stabbed<br/>        with and the harpoon is not to the far right, then move the harpoon<br/>        to the right.</p>\n<p>        This line also contains data for the victory text string.</p>\n<p>Line 6: Calculate the memory address of the screen position of the harpoon<br/>        tips.</p>\n<p>        If the character in that position is unequal to the other, two<br/>        positions to the right, and the harpoon is moving up then increase<br/>        the score and jump to line 1.</p>\n<p>Line 7: If the squid has not reached the right side of the screen, then<br/>        jump to line 2.</p>\n<p>        This line also contains data for the two squid animation frame<br/>        strings.</p>\n<p>Line 8: Clear the screen, display the number of squids slain and display<br/>        \"GAME OVER\".</p>\n<p>        If the score was 50, then display the victory text.</p>\n<p>Line 9: Wait for a key to be pressed and restart the game.</p>\n<p>        This line also contains data for the top part of the harpoon<br/>        string.</p>\n<p>---</p>", "metacritic": null, "released": "2021-03-02", "tba": false, "updated": "2021-03-05T09:59:56", "background_image": "https://media.rawg.io/media/screenshots/3a3/3a34cd5698077252965b6016e332c28a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 6, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BASIC 10Liner"], "genres": ["Action"], "publishers": [], "esrb_rating": null}