{"id": 567757, "slug": "jump-douzane-grerk-avilla", "name": "Jump! (Douzane, GrerK, Avilla)", "name_original": "Jump! (Douzane, GrerK, Avilla)", "description": "<p>Para o desenvolvimento desse jogando, e visando o nosso TCC. (Apelamos) e pegamos uma temática do cenário político brasileiro, onde você joga como um Ex Presidente e precisa avançar desviando de obstáculos e pegar impulso em objetos do cenário, esse meme foi escolhido no momento que se tem a notícia que  esse Ex Presidente foi solto e se tornou um <em>Trending Topic no twitter</em>. Um Sketch da idéia inicial pode ser observado a partir da <strong>Figura abaixo</strong>.<br/> Dessa forma, o jogador passaria pelas cidades do Brasil, dando a ideia de que o mesmo está fazendo campanha política em todos os estados para a tentativa de ganhar votos.</p>\n<p>As mecânicas gerais utilizadas no jogo JUMP! foram desenvolvidas tomando outros jogos do gênero hyper casual como base. Tais jogos (<em>Blast Boy</em> e <em>Jetpack Jump</em>) possuem um foco no ato de repetição de ações, simplicidade ao máximo quanto a quantidade de ações necessárias para jogar e ao mesmo tempo transmitir a sensação de progressão ao jogador. Destes, usar apenas um <em>tap</em> para realizar tudo que o jogo proporciona é um dos fatores essenciais que levamos em consideração, dessa forma, o nosso jogo trata mecânicas que precisam apenas de um <em>tap</em> para serem realizadas e tomamos a liberdade de adicionar um elemento a mais: desacelerar o tempo enquanto segura o <em>tap</em> na tela. Além disso, também existem as mecânicas de progressão que se dão através da compra de melhorias das habilidades (o pulo e a desaceleração do tempo) através da interface. </p>\n\n<p>Mecânica sem temática &gt;</p>\n\n<p>Sketch da temática</p>\n\n<p>Print do protótipo</p>", "metacritic": null, "released": "2021-03-02", "tba": false, "updated": "2021-03-05T10:51:40", "background_image": "https://media.rawg.io/media/screenshots/7b6/7b68a05b6eadfd355608edbabc81e7a5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 50, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["avilla", "Douzane", "GrerK"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}