{"id": 567828, "slug": "phantom-pang", "name": "Phantom Pang", "name_original": "Phantom Pang", "description": "<p><strong>(Spoilers)</strong></p>\n<p>A narrative-focused game that explores the Five Stages of Grief as outlined by the Kubler-Ross model. The stages, or levels, in this case, consist of denial, anger, depression, bargaining, and acceptance.</p>\n<p>While the game is centered around the Five Stages of Grief model, its end goal diverges to tell the moral of living life with the purpose of having no regrets for past actions. That is, living a life that seeks to spread happiness rather than living selfishly.</p>\n<p>The story itself is revealed in an explorative manner, fully reliant on the player interacting with non-playable characters. I place emphasis on mimicry while the player takes on the persona of the main character. The game leans towards a paidia-type of play in respect to the fact that none of the quests are required to complete the game. The player is free to complete as much or as little of the game as they wish with no obligation. The way the story is told and the quest system imply that the player has choices and that they branch to alternative endings.</p>\n<p>The title, Phantom Pang, is a play on the term “phantom pain” which is the feeling of pain coming from a body part that is no longer there (the deceased Pharaoh no longer being alive), and “pang” which is the feeling of emotional distress. The game’s main focus was on narrative and the story being told which was designed as a moral lesson to the player.<br/></p>", "metacritic": null, "released": "2021-03-02", "tba": false, "updated": "2021-03-05T11:12:58", "background_image": "https://media.rawg.io/media/screenshots/80f/80f8e544be446953edb63000692d0c38.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 18, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Wayne Huras"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}