{"id": 568244, "slug": "wizard-of-chaos", "name": "Wizard Of Chaos", "name_original": "Wizard Of Chaos", "description": "<strong>WARNING: There is a bug where the game's screen becomes grey, and the game cannot be seen, after the game has loaded - this happens sometimes, but to fix it all you have to do is press the menu button and start again. You won't lose any progress doing this, and sorry about the inconvenience!</strong>\n<p>You are a wizard of Chaos, risking your own life for more power, and your mountain hold is under attack! Will you play on a knife's edge, losing all hearts but one to maximise your damage, or will you play it safe, at the cost of less strength and score? The choice is yours!</p>\n\r\nFIGHT ENEMIES\r\n<p>Attempt to stave off a growing horde of imps, goblins and demons, as they grow in number and strength. Be warned though, that not all of them will be so weak as the first ones you encounter...</p>\n\r\nCAST SPELLS\r\n<p>With 9 unique upgrades, and a levelling system to boot, you'll grow in power as you defeat more and more enemies, upgrading your spells in number and casting vicious stat effects on your foes.</p>\n\r\n...DIE?\r\n<p>Yes, even if you face an untimely death, not all is lost! Your power increases based on your experience in a past life, so even if you do perish, you can start again and come back stronger than ever before!</p>\n\n<p>If the game is too hard or too easy for you, there are difficulty settings in the credits/options menu too.</p>\n\n<p>And since there's no in-game scoreboard, why not post your time and score below? I'd love to see how well you did! Good luck, and go vanquish some of those demons!</p>", "metacritic": null, "released": "2021-03-01", "tba": false, "updated": "2021-03-05T13:03:42", "background_image": "https://media.rawg.io/media/screenshots/c92/c928b196e6d5a4c218c430ed306a8c7b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 105, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Cakestorm"], "genres": ["Action"], "publishers": [], "esrb_rating": null}