{"id": 568487, "slug": "dungeon-defenders-itch", "name": "Dungeon Defenders (itch)", "name_original": "Dungeon Defenders (itch)", "description": "<p>Reverse pac-man. Play as ghosts trying to defend their home against adventurers who have come to loot it. 3 levels to play and 3 heroes to defeat.<br/></p>\n<p>Made for the Wowie jam 3 (https://itch.io/jam/wowie-jam-3) with the theme of Failure is Progress. The game follows this theme in that, each time a hero manages to escape the floor safely, the game progresses to another level which is more favorable to the ghosts, being larger and with special tiles that help the player succeed.<br/></p>\n<p>How to Play:<br/>The goal is to defeat each hero before they can escape from the level. Heroes need to collect 10 orbs on each level before they can advance and you need to stop them before they do. To do this you must move the ghosts around the levels using the wasd keys and the arrow keys and collect orbs before the heroes can. Once a ghost has collected 3 orbs they become enraged for a time which allows them to damage a hero. (While enraged additional orbs reset the duration back to full) <br/>The special tiles and heroes are explained in game.</p>\n<p>Note:<br/>Some people have reported the game softlocking on level 2 but it doesn't always seem to happen. <br/></p>\n<p>Attribution :<br/>The menu background was made by stealthix and can be found in an asset pack here on itch.io<br/> https://stealthix.itch.io/various-backgrounds<br/></p>", "metacritic": null, "released": "2021-03-01", "tba": false, "updated": "2021-03-05T14:13:43", "background_image": "https://media.rawg.io/media/screenshots/148/14860a7cb75ee99eb503f7cd4b44e919.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 21, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["Sisyphean Games"], "genres": ["Action"], "publishers": [], "esrb_rating": null}