{"id": 568402, "slug": "umi-64-commodore-64", "name": "Umi 64 (Commodore 64)", "name_original": "Umi 64 (Commodore 64)", "description": "<p><strong>Factsheet:</strong></p>\n<p><strong>Developer/Desarrollador:</strong> Mediatech Game Studio (Game Designer: <strong>Kabuto</strong>), Twitter: Kabuto</p>\n<p><strong>Release Date/Fecha de lanzamiento:</strong>  March, 2021</p>\n<p><strong>Platforms/Plataformas:  </strong>C64/PC with emulator C64</p>\n\n<p><strong>Objective of the game:</strong></p>\n<p>In the game there is a horde of enemies called Monstruovolos, which were peaceful animals that, due to the lack of energy from the earth, turned into monsters. Your mission is to fight them by transforming Umi with the corresponding color of each monster or colliding them so that they disappear from the city, for this you must use the joystick (PORT 2) in each direction to move and combining each direction with the FIRE button you achieve the transformation into the color needed to fight each monster (Up-Blue, Down-Green, Right-Yellow and Left-Purple). You have 60 seconds to complete the screen and at the end of killing the enemies you must take the bag of money that the city pays you to erase them from the map and be able to pass the level where new monsters appear, the speed of the enemies progressively increases screen to screen. In the end your objective is to see until which screen you arrive and what score you achieve using your skill with the joystick.</p>\n\n<p><strong>Game history:</strong></p>\n<p>Umi 64 is a reduced version of my game \"Umi against the Monstruovolos\" for PC created in the pandemic of 2020 and in parallel with the development of its older brother. It is my return to the Commodore 64 for more than 35 years using the wonderful Maker developed by the genius Garry Kitchen (@kitchengarry ) under the Activision label of the time, it helped me to stay alert and clear in the worst months of lack of work, fear for my loved ones and economic uncertainty that COVID19 brought to all of us without ever imagining what was going to change our lives. This Maker is like a Basic repowered with commands for sprites, sounds, scenes, music, samples, tables and very few variables which make programming a video game logically quite a feat, but for veterans like me it is perfect to sharpen the mind and the senses to achieve a playable work. It has modules to treat multicolored or mono-colored sprites with a very simple and complete editor to use with the same joystick (Sprite Maker), the same for the scenes (Scene Maker) that you can only have 2 in the game, the sounds separate theme ( Sound Maker) and finally a very complete music editor, I would say that it is the most worked module (Music Maker) where you can compose with musical notes the 3 glorious channels that the C64's SID chip handles. In this last section I had the collaboration of a great young musician named Giampaolo Castagnetti (@PelucaSadiconga) who luckily for me was studying virtually due to the pandemic and he made me 3 wonderful songs for the game which I hope you enjoy a lot. The Maker allows us to make games in the brick pixel resolution of the C64 that gives us 160 pixels by 200 pixels using the machine's 16-color palette, so the games that can be made are more like Atari 2600 with a fixed screen without scrolling. , but that does not limit rather fun, in my particular case I enjoyed those games a lot as a child and I still do it through emulators and now a RETRON 77 that they gave me.</p>\n<p>Apart from the Maker I used the Tape Master Pro 4.0 from the friends of The New Dimension (@Richard_of_TND) with the great help of the friend Javier Couñago from Commodore Spain, without whom I would not have been able to do it as quickly as it was done. On the other hand, the loader consists of a SID theme that was arranged by the great Narciso Quintana (@narcisound)  known throughout the Commodorian scene as the author of several important games on our beloved computer. And I would miss the intro image that His Majesty Igor Errazkin was going to do for me, which at some point will be completed and I will upload the .TAP so that they can use it in tape format.</p>\n\n<p><strong>Garry Kitchen Game Maker:</strong></p>\n<p>I leave to the community of fellow programmers who want to venture into developing games for Commodore 64 the source codes of my games with their floppy disks so that they can easily work in an emulator and begin to get into programming for a machine that is almost 40 years old and that today is with a very lively scene that produces hundreds of games a year both free and commercial. So with the listings you can understand my logic, with the manual you can know the product and with the discs you can play my code and modify it however you want. If you want to support me, you can do so by donating here or providing a coffee in Ko-fi.<br/></p>\n\n\n<p><strong>Objetivo del juego:</strong></p>\n<p>En el juego salen una horda de enemigos llamados Monstruovolos, los cuales eran animales pacíficos que por la falta de energía de la tierra se convirtieron en montruos. Tú misión es combatirlos transformando a Umi con el color correspondiente de cada monstruovolo y chocandolos para que desaparezcan de la ciudad, para ello debes usar el joystick (PORT 2) en cada dirección para desplazarte y combinando cada dirección con el botón FIRE logras la transformación en el color necesario para combatir cada monstruo (Arriba-Azul, Abajo-Verde, Derecha-Amarillo e Izquierda-Morado). Tienes 60 segundos para completar la pantalla y al final de matar a los enemigos debes tomar la bolsa de dinero que te paga la ciudad por borrarlos del mapa y poder pasar de nivel donde aparecen nuevos monstruovolos, la velocidad de los enemigos aumenta de forma progresiva pantalla a pantalla. Al final tu objetivo es ver hasta que pantalla llegas y que puntuación logras usando tú habilidad con el joystick.</p>\n\n<p><strong>Historia del juego:</strong></p>\n<p>Umi 64 es una versión reducida de mi juego <strong>\"Umi contra los Monstruovolos\"</strong> para PC creado en la pandemia del 2020 y en paralelo al desarrollo de su hermano mayor. Es mi regreso al Commodore 64 desde hace más de 35 años usando el maravilloso Maker desarrollado por el genio Garry Kitchen (@kitchengarry )bajo el sello de Activision de la época, me sirvió para mantenerme alerta y despejado en los peores meses de falta de trabajo, miedo por mis seres queridos e incertidumbre económica que nos trajo el COVID19 a todos sin imaginarnos nunca lo que nos iba a cambiar la vida a todos. Este Maker es como un Basic repotenciado con comandos para sprites, sonidos, escenas, música, samples, tablas y muy pocas variables las cuales hacen toda una hazaña programar con lógica un videojuego, pero para veteranos como yo es perfecto para agudizar la mente y los sentidos para lograr una obra jugable. Tiene módulos para tratar los sprites multicolores o monocolores con un editor muy sencillo y completo de usar con el mismo joystick (Sprite Maker), lo mismo para las escenas (Scene Maker) que solo puedes tener 2 en el juego, los sonidos tema aparte (Sound Maker) y por último un editor musical muy completo, diría que es el módulo más trabajado (Music Maker) donde puedes componer con notas musicales los 3 canales gloriosos que maneja el chip SID del C64. En este último apartado tuve la colaboración de un gran músico joven llamado Giampaolo Castagnetti (@PelucaSadiconga) que por suerte para mi estaba estudiando virtualmente por la pandemia y me hizo 3 maravillosos temas para el juego los cuales espero que disfruten mucho. El Maker permite hacer juegos en la resolución de pixel ladrillo del C64 que nos brinda 160 pixels por 200 pixels usando la paleta de 16 colores de la máquina, por lo cual los juegos que se pueden hacer son más tipo Atari 2600 de pantalla fija sin scroll, pero eso no limita más bien divierte, en mi caso particular yo disfrutaba mucho de niño esos juegos y todavía lo hago a través de emuladores y ahora de un RETRON 77 que me regalaron.</p>\n<p>Aparte del Maker usé el Tape Master Pro 4.0 de los amigos de The New Dimension (@Richard_of_TND) con la gran ayuda del amigo Javier Couñago de Commodore Spain sin el cual no hubiera logrado hacerlo de la forma tan rápida que se hizo. Por otro lado, el loader consta de un tema SID que hizo el arreglo el gran Narciso Quintana  (@narcisound) conocido por toda la escena commodoriana como autor de varios juegos importantes de nuestro querido ordenador. Y faltaría la imagen intro que me la iba a hacer su majestad Igor Errazkin que en algún momento se completará y subiré el .TAP para que lo puedan usar en formato cinta.</p>\n\n<p><strong>Game Maker de Garry Kitchen:</strong></p>\n<p>Dejo a la comunidad de colegas programadores que quieran incursionar desarrollando juegos para Commodore 64 los códigos fuentes de mis juegos con sus diskettes para que pueden trabajar facilmente en emulador y comenzar a adentrarse en la programación para una máquina de ya casi 40 años y que hoy día está con una escena muy viva que produce cientos de juegos al año tanto gratuitos como comerciales. Así que con los listados pueden entender mi lógica, con el manual pueden conocer el producto y con los discos pueden tocar mi código y modificarlo como ustedes quieran.  Si me quieren apoyar pueden hacerlo donando acá mismo o brindando un café en Ko-fi.</p>", "metacritic": null, "released": "2021-03-01", "tba": false, "updated": "2021-03-05T13:46:46", "background_image": "https://media.rawg.io/media/screenshots/5c1/5c1e3cace3f8b8a513e6804531f785d5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 167, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mediatech Game Studio"], "genres": ["Action"], "publishers": [], "esrb_rating": null}