{"id": 568692, "slug": "scienceisfailure", "name": "ScienceIsFailure", "name_original": "ScienceIsFailure", "description": "<p>This project is my <strong>FIRST</strong> ever game <strong>AND</strong> game jam!  It is definitely noticeable, but I think with my very limited knowledge on development thus far it turned out pretty okay. <br/></p>\n<p><strong>Controls:</strong><br/></p>\n<ul><li>WASD = Movement</li><li>Space = Jump (if you can)</li><li>Left MouseButton = Shoot (If you can)</li><li><strong>R to quick restart a level! This is the only one that isn't abundantly obvious in the game. </strong></li></ul>\n<p>This game follows a robot who is being tested on by a mad scientist. You must complete his puzzles by reaching and pressing the big red button. He antagonizes you along the way of course.  This \"game\" is more of an experience, based around your relationship with the scientist. </p>\n<p>This game is a entry in the Wowie Jam 3.0. Just the project to get me to actually start doing my own development. Prior to this I followed a lot of tutorials and guidance to get things done. Joining this game jam forced me to learn things for myself, and start developing on my own. It was an AMAZING experience, and I 100% intend on growing as a developer from this. <br/></p>\n<p>While playing you will notice something very fast, the sound design is lacking. I personally didn't know how to work well with sound, and opted to leave out Music and rolling / movement audio. Rather than implementing a janky version of something I assumed it would be best to leave it out all together. </p>\n<p>Assets Used:</p>\n<ul><li>Robot from Unreal Engine (adjusted in almost every level to fit what I needed though):  https://www.unrealengine.com/marketplace/en-US/product/worker-robot-01</li><li>Texture for the wall / floors: https://www.textures.com/download/PBR0065/133100</li></ul>\n<p>Everything else was made by me!</p>", "metacritic": null, "released": "2021-03-01", "tba": false, "updated": "2021-03-05T15:05:19", "background_image": "https://media.rawg.io/media/screenshots/e31/e3136e2199c58d9bf3f65351bb871940.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 84, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Winclark"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}