{"id": 56865, "slug": "ultima", "name": "Ultima I: The First Age of Darkness", "name_original": "Ultima I: The First Age of Darkness", "description": "<p>Ultima, later known as Ultima I: The First Age of Darkness or simply Ultima I, is the first game in the Ultima series of role-playing video games created by Richard Garriott. It was first published in the United States by California Pacific Computer Company, which registered a copyright for the game on September 2, 1980 and officially released it in June 1981. Since its release, the game has been completely re-coded and ported to many different platforms. The 1986 re-code of Ultima is the most commonly known and available version of the game.<br />\nUltima revolves around a quest to find and destroy the Gem of Immortality, which is being used by the evil wizard Mondain to enslave the lands of Sosaria. With the gem in his possession, he cannot be killed, and his minions roam and terrorize the countryside. The player takes on the role of &#39;The Stranger&#39;, an individual summoned from another world to end the rule of Mondain. The game follows the endeavors of the stranger in this task, which involves progressing through many aspects of game play, including dungeon crawling and space travel.<br />\nThe game was one of the first definitive commercial computer RPGs, and is considered an important and influential turning point for the development of the genre throughout years to come. In addition to its influences on the RPG genre, it is also the first open-world computer game.</p>", "metacritic": null, "released": "1981-06-01", "tba": false, "updated": "2024-01-06T10:48:07", "background_image": "https://media.rawg.io/media/screenshots/ba4/ba456796ee5e190af9cfb2e78feac2ec.jpg", "website": "", "rating": 2.78, "rating_top": 1, "added_by_status": {"yet": 13, "owned": 17, "beaten": 12, "toplay": 11, "dropped": 11, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 22, "suggestions_count": 200, "game_series_count": 21, "reviews_count": 23, "platforms": ["Atari 8-bit", "PC", "Apple II", "Commodore / Amiga"], "developers": ["Origin Systems", "Richard Garriott"], "genres": ["RPG"], "publishers": ["Electronic Arts", "Atari", "Sierra On-Line", "Origin Systems", "Pony Canyon", "Fujitsu", "California Pacific Computer Company", "'''DOS'''", "'''Commodore 64'''", "'''FM Towns'''", "'''Apple II'''", "'''MSX2'''", "California Pacific Computer Co.", "Vitesse", "'''Apple IIGS'''"], "esrb_rating": null}