{"id": 568604, "slug": "organic-orphans", "name": "Organic Orphans", "name_original": "Organic Orphans", "description": "<p>Organic Orphans is a precision platformer that will be made easier the more you die. You can use this mechanic to make your way through 6 levels that would be brutally difficult without it. There are also some puzzle elements thanks to a few routes that can be taken by creatively using the main mechanic.</p><p>This was made by two people. Me and my friend. If you agree with me that the name is odd then take it up with him. Anyways this was his first game jam and my third. I did the programming and level design and he did the art and most of the game design. Being our first jam together, we were not the best at collaboration and were barely able to submit this. It's unpolished and buggy but it's a game, and it's kinda fun.</p>\n<p>Controls:</p>\n<p>A &amp; D  / Left &amp; Right Arrows = Left &amp; Right</p>\n<p>Space / Up Arrow = Jump</p>\n<p>R = Restart Level</p>\n\n<p>This game was submitted for the Wowie Game Jam 3.0. The theme was Failure is Progress. My friend suggested that you would be a sprout and when you die, a tree grows in your place so the platforming gets easier the more you die. We rolled with it and ended up with 3 characters:</p>\n<p>Sprout: Grows a small plant you can jump on</p>\n<p>Acorn: Drops a shell-board that you can ride on through spikes</p>\n<p>Grape: You can bounce on his body. We hate the grape.</p>\n\n<p>Anyways thanks for playing and feel free to give us feedback!</p>", "metacritic": null, "released": "2021-03-01", "tba": false, "updated": "2021-03-05T14:40:17", "background_image": "https://media.rawg.io/media/screenshots/925/925379cbc865c2969c4d820f9828ae0b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Spectoby"], "genres": [], "publishers": [], "esrb_rating": null}