{"id": 568776, "slug": "space-escape-annotropical", "name": "Space Escape (annotropical)", "name_original": "Space Escape (annotropical)", "description": "<p>Hey :)</p>\n<p>This is Space Escape, an awesome Souls-Like 2D Space-Shooter like Asteroids.</p>\n<p>I made this game during the Wowie! Jam 3.0. It is the first game I made during a game jam. Please enjoy and rate the game!</p>\n<p>The game features difficult to master spaceship physics, different enemy types and has a checkpoint based progression system.</p>\n<p>It's quite difficult to beat the game, but there are a lot of checkpoints so you don't have to start over. Post your best time to beat in the comments below! (with screenshot, of course ;) )<br/></p>\n\n<p>SPOILER ALERT: The theme for the Jam was \"Failure is Progress\".<br/>During the game, you have the option to destroy defence stations using catched explosive bombs by moving over them just as you explode. So you can choose your own difficulty either by leaving them all alive or by destroying them. </p>\n<p>\n</p>\n\n\n<p>Huge thanks to my beloved girlfriend suzie, who stayed by my side during the making of this game and who contributed pixel art :)</p>\n\n<p>If you want to have a look into the source code to get inspiration for you next game, just download the .love file in the download section and extract it using any archiver (it's just .zip file renamed to .love). <br/></p>\n\n<p>Hereby I release the source code and all of the assets I made for this game to the public domain. May it be a good resource for you and your future projects.</p>\n<p>Disclaimer: I do not own all of the work in this game's distribution. Please check the ingame description and the acknwoledgement.txt file and the license.txt file in .love distribution for further details. Any files included in the distribution which are clearly recognizable as  not part of my work fall under the license of their respective copyright owners. This is especially true for the Löve Engine and the third-party libraries, which are part of the Löve Engine's distributable.</p>\n<p>PS: Just noticed, the game misses a destroyed stations counter in the end. I won't fix this for the jam, but if I have time next weekend, I will push a past-submission patch! (for the speedrunner community ;) ) [ This is truly a 1 LOC fix]<br/></p>\n<p>PSS: Yes, this game lacks a nice particle system for the player's ship acceleration and most important sound. I made the choice to not include any third party assets (apart from the font) and I sadly started this game way too late to make any appropriate soundtrack and sound effects. There we go, next game jam!<br/></p>", "metacritic": null, "released": "2021-03-01", "tba": false, "updated": "2021-03-05T15:25:31", "background_image": "https://media.rawg.io/media/screenshots/dd7/dd72a498dd36c4dab9c037a7aa5e5882.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 67, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["annotropical"], "genres": ["Action"], "publishers": [], "esrb_rating": null}