{"id": 568733, "slug": "remembering-the-good-times", "name": "Remembering The Good Times", "name_original": "Remembering The Good Times", "description": "<p>This game was made in 72 hours for the Wowie 3 game jam. The theme was \"Failure is Progress\". In this game, failing to tell the stories in the correct order will let you know how many events happened in the order you gave and how many events are in the wrong order.</p>\n<p><strong>How to Play</strong></p>\n<p>Grandpa will tell 3 stories. In each story, there are 6 events you can perform. It's your job to find out in which order 4 of these events took place. After you select 4 events (depending on the story, you'll do this differently), a notification will tell you how many of those events are in the right order and how many are in the wrong order. If you've ever played Mastermind, the board game, it's basically that. Be aware that since there are 6 possible events, there are at least 2 that didn't happen and in some stories, some events may be repeated.</p>\n<p><strong>Help! My game is stuck at the start with a kid on a bed</strong></p>\n<p>Try clicking on the game to bring it into focus and wait for sounds to start happening. If it still doesn't work, press 2 to skip to the next scene or use a different browser that handles sound better like Chrome.</p>\n<p><strong>Cheats</strong></p>\n<p>Pressing 1-7 while watching the intro will jump to that scene. 2 is the 1st story, 4 is the 2nd story, and 6 is the 3rd story.</p>\n<p><strong>Walkthrough (SPOILERS)</strong></p>\n<p>1st story - Orange, Red, Blue, Yellow (compliment hat, start raining, beckon closer, almost killed)</p>\n<p>2nd story - Red, Red, Blue, Green (block a hit, block a hit, hit the bully while he isn't blocking, leave to the left)</p>\n<p>3rd story - Red, Green, Yellow, Orange (kill red, kill green, kill yellow, die)</p>\n<p><strong>Credits</strong></p>\n<p>(Most of the) Sounds - PMSFX</p>\n<p>Fonts - The Artisan Marker , Lilita One</p>\n<p>Everything else - Vykri (me)</p>", "metacritic": null, "released": "2021-03-01", "tba": false, "updated": "2021-03-05T15:16:26", "background_image": "https://media.rawg.io/media/screenshots/f38/f38accb98a9dc611320776f71b651f3d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 57, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Vykri"], "genres": ["Fighting", "Puzzle"], "publishers": [], "esrb_rating": null}