{"id": 568887, "slug": "jei-vr", "name": "JEI VR", "name_original": "JEI VR", "description": "WorldDynamics inc.  - is the first company which created artificial intelligence capable of achieving a technological singularity. Gradually, the power and wealth of the Corporation allowed governments around the world to take control. Absolute power-corrupts absolutely.<br/>In response to lawlessness and injustice, an underground organization Cyberion appeared. Members of the underground are trying to destroy the Corporation by organizing sabotage, undermining infrastructure and freeing people from debt camps-factories. Jei is the girl who is destined to end the dictatorship.<h3>Road map</h3><h3>Gameplay</h3>When you launch Jei VR, you will immediately find yourself in the heat of battle. Your battle zone is the crossroads of a city formerly owned by civilians and now by WorldDynamics inc.<br/>You are surrounded and locked in a tight space with no escape.<br/><br/>Corporation robots will attack in waves. With each new wave, the strength of robots and their number will only increase. WorldDynamics inc. will place enemies in different locations. They can materialize in front of your face or around the corner, attacking later, causing devastating damage.<br/><br/>Take care of your health, because robots are strong. To take a break, you can use a shield or just hide for a while. But remember! The shield is not infinite, it has energy, so use it wisely.<br/><br/>You will receive a machine gun on first boot. But fighting them alone would be pretty boring. So where can you get new weapons and cartridges for the old? You just need to break the containers that remain after killing robots. Take different weapons in different hands and clear the intersection from bots by opening fire with two hands. Let's hope you unlock the entire armory.<br/><br/>But don't worry, you will be taught all this at the resistance training ground!<br/><br/>If your competitive spirit is so strong that you want to defeat not only robots, but also defeat all your friends, then welcome to Party mode, designed for 4 players.<br/><br/>The Resistance believes in you!<h3>Setting</h3>WorldDynamics inc. is the first company to create artificial intelligence capable of reaching the technological singularity. Gradually, the power and wealth of the corporation allowed the governments of all countries to take control. Absolute power-corrupts absolutely! <br/>In response to lawlessness and injustice, an underground organization Cyberion appeared. Members of the underground are trying to destroy the corporation by organizing sabotage, undermining infrastructure and freeing people from debt camps-factories. Jei is destined to put an end to the dictatorship.<br/>The girl thwarted any plan of the Corporation. WorldDynamics inc. opened a real hunt for her. So this time she was surrounded by bots. Will jei be able to fight off another attack and protect Cyberion!?<h3>Features</h3><ul><li>Single mode<br/></li><li>Party mode, for competition with friends<br/></li><li>Unique opponents, weapons and bosses</li></ul>", "metacritic": null, "released": "2021-03-05", "tba": false, "updated": "2021-03-08T02:38:54", "background_image": "https://media.rawg.io/media/screenshots/c41/c4154ffbf600951587a81330632f090c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 421, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["lineindevs"], "genres": ["Action"], "publishers": ["lineindevs"], "esrb_rating": null}