{"id": 568863, "slug": "doom-eternal-the-ancient-gods-part-two", "name": "Doom Eternal: The Ancient Gods - Part Two", "name_original": "Doom Eternal: The Ancient Gods - Part Two", "description": "<p>The Ancient Gods – Part Two is the epic conclusion to the DOOM Slayer’s Saga and the second campaign expansion to the critically acclaimed DOOM Eternal.<br />\nYou denied the gods and awoke an ancient evil. Now rally the scattered Sentinel armies, lay siege to the last bastion of Hell, break through the fortress walls, and face the Dark Lord himself. The soul of the universe hangs in the balance.<br />\nYour war against Hell ends here.EXPERIENCE THE END OF THE SLAYER’S SAGA<br />\nExperience the epic conclusion to the DOOM Slayer’s saga. From the moment you were activated by Samuel Hayden at the UAC facility on Mars to the destruction of the Icon of Sin, all your battles have led to this. Prepare to siege Immora, the last bastion of the dark realm, challenge the Dark Lord in combat, and seal the demons within Hell for good.FIGHT ACROSS EPIC BATTLEFIELDS<br />\nFrom the ruins of ancient Sentinel settlements and the cosmic wonders of the World Spear, to a devastated and overgrown city on Earth hiding a mysterious gateway, face Hell’s armies in never-before-seen locations as you fight your way to Immora, the last bastion of the Dark Lord protected by towering walls and powered by advanced technology.FACE CHALLENGING ENEMY VARIANTS<br />\nFace new, deadly variants of demons. The Armored Baron wears special armor and uses a charged fist attack. The Stone Imp possesses a nearly impenetrable hide and prefers close combat. The Screecher is a zombie that empowers nearby demons when killed. The Cursed Prowler is a mutation with venomous, cursed claws. Exploit their weaknesses to destroy them.WIELD THE SENTINEL HAMMER<br />\nDeliver more destruction with the Sentinel Hammer, an ancient weapon capable of stopping any demons caught within its shockwave. Use it to stun demons or combine it with the Ice Bomb or Flame Belch to extract much-needed health or armor.<br />\n*The Year One Pass includes two campaign expansions: The Ancient Gods -- Part One and The Ancient Gods -- Part Two.</p>", "metacritic": 78, "released": "2021-03-18", "tba": false, "updated": "2024-04-21T12:01:57", "background_image": "https://media.rawg.io/media/games/fc3/fc3aec69b074d533c43a658ca1e90b0f.jpg", "website": "https://slayersclub.bethesda.net/en", "rating": 4.12, "rating_top": 4, "added_by_status": {"yet": 23, "owned": 17, "beaten": 75, "toplay": 36, "dropped": 4, "playing": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 53, "suggestions_count": 313, "game_series_count": 0, "reviews_count": 58, "platforms": ["Xbox One", "PC", "PlayStation 4"], "developers": ["id Software"], "genres": ["Action", "Shooter"], "publishers": ["Bethesda Softworks"], "esrb_rating": null}