{"id": 56880, "slug": "way-of-the-tiger", "name": "Way of the Tiger", "name_original": "Way of the Tiger", "description": "<p>The Way of the Tiger is the name of a series of adventure gamebooks by Mark Smith and Jamie Thomson set on the fantasy world of Orb. The reader takes the part of a young monk-ninja, Avenger, on his quest to avenge his foster father and recover the Scrolls of Kettsuin. Later books present fresh challenges for Avenger to overcome.</p>\n<p>The world of Orb was originally drawn up by Mark Smith for a Dungeons and Dragons game he dungeon-mastered while a pupil at Brighton College in the mid-1970s. Orb was also used as the setting for the Fighting Fantasy gamebook Talisman of Death, again by Smith &amp; Thomson.</p>\n<p>Each book has a disclaimer at the front against performing any of the ninja related feats in the book as \"They could lead to serious injury or death to an untrained user\".</p>\n<p>The sixth book, Inferno!, ends on a cliffhanger with Avenger trapped in the web of the Black Widow, Orb's darkest blight. As no new books were released, the fate of Avenger and Orb was unknown. Mark Smith has confirmed that the cliffhanger ending was deliberate.</p>\n<p>In August 2013, the original creators of the series were working with Megara Entertainment to develop re-edited hardcover collector editions of the gamebooks (including a new prequel (Book 0) and sequel (book 7)), and potentially a role-playing game based on the series. The two new books plus the six re-edited original books were reprinted in paperback format by Megara Entertainment in 2014.</p>\n<p>In December 2013, it was announced that Tin Man Games would be releasing the original six books of the series on digital platforms in 2014 and 2015. However, as of 2017, nothing has been released.</p>", "metacritic": null, "released": null, "tba": false, "updated": "2019-01-09T12:41:06", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["Commodore / Amiga"], "developers": [], "genres": [], "publishers": [], "esrb_rating": null}