{"id": 568885, "slug": "faraway-directors-cut", "name": "Faraway: Director's Cut", "name_original": "Faraway: Director's Cut", "description": "Faraway is a puzzle adventure game set in a mysterious desert. After the mobile version, which has been downloaded more than 5 million times, Faraway finally opens its door to PC gamers with this updated Director's cut version.<br/><h3>MIND-BENDING PUZZLES</h3>Ruled by an ancient civilization, this realm is packed with carefully constructed devices. Now with two extra levels, you can explore 20 unique temples filled with puzzles. To reveal all the secrets this place hides, you will have to explore it, find unusual items, solve perplexing puzzles, and prove your worth.<br/><h3>VOICEOVER</h3>The newly-added voiceover will guide you through the alluring 3D world and let you immerse yourself into the compelling story of the Faraway.<h3>UPDATED GRAPHICS</h3>Spend hours basking in the beauty of deserts and ruins of the ancient civilization with newly updated graphics.<h3>FREE 360 FPS MOVEMENT</h3>The free 360 fps movement will let you dive into the sheer beauty of this interactive 3D world and solve the puzzles hands-on.<h3>UNIQUE SOUNDTRACK</h3>As you rummage through the ruins full of secrets, you can enjoy the original and updated soundtrack that will stick with you even after escaping the desert. <br/><br/><br/>So set off on this journey because there is more to this story than meets the eye. The only question is, <strong>are you worthy?</strong>", "metacritic": null, "released": "2021-03-05", "tba": false, "updated": "2021-03-08T02:37:43", "background_image": "https://media.rawg.io/media/screenshots/822/822af94062149fb9a84799c08bb9ab17.jpg", "website": "http://pinestudio.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 8, "owned": 11, "beaten": 1, "toplay": 2, "dropped": 1}, "playtime": 2, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 164, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "macOS", "Linux"], "developers": ["Pine Studio"], "genres": ["Adventure", "Casual"], "publishers": ["Snapbreak"], "esrb_rating": null}