{"id": 568966, "slug": "card-wars-battle-royale-ccg", "name": "Card Wars: Battle Royale CCG", "name_original": "Card Wars: Battle Royale CCG", "description": "An epic multiplayer PvP, CCG with unique cards &amp; quirky characters<br/><br/>Play for FREE with players across the world<br/>Unlock up to 15 epic cards including FIRESTORM, BURGLAR and CANNON<br/>Play with friends and strangers<br/>Level up to move up leagues<br/>Unlock heroes<br/>Fast-paced competitive and fun - for FREE!<br/>Easy enough for beginners, tough enough to keep you hooked<br/>FREE bonus rewards every day!<br/>Excellent comic graphics and funny animations<br/>Build, upgrade, customize your deck<br/>Hearthstone, Yu-Gi-Oh (Yugioh), Duel Masters, Animation throwdown &amp; Uno like card game<br/><br/>Experience a whole new world of unique characters and cards. With gameplay similar to Hearthstone, Yu-gi-oh and Duel Masters. The gameplay is simple enough for even the most novice players. Plan out your moves, grow the deck to suit your play style. Crush your opponents with brute force or outsmart them to claim your victory. Use clever tactics and strategies to eliminate your opponent. Card Battle offers a lot of heroes and abilities to choose from, which can be upgraded and evolved. Play with up to six people in a tournament like elimination structure. Play cards to deal damage to the opponents, the last survivor takes the crown, loot, cash and glory.<br/><br/>Step into the battleground with your customized decks and go head-to-head against your family and friends in a game of strategy, tactics, and brute force. Unlike Hearthstone, Yu-gi-oh (Yugioh). Experience the thrill of battling 4-6 people at once, with 6 times the twists and thrill.<br/><br/>Challenge opponents head-on, enter a world of online matchmaking and real-time matches, beat them for amazing rewards and glory. Online matchmaking allows you to clash against real people online, anytime, and anywhere. The winner gets amazing rewards, chests and loot!<br/><br/>Enjoy the nostalgia of classic trading card games (TCG) and collectible card games (CCG) like Magic! The Gathering, Hearthstone, Yu-gi-oh (Yugioh) Battle links and duel masters mixed with the quirky fun elements of a throwdown game! Build, customize, upgrade, trade, develop your own unique deck, and take on your friends with competitive matches and tournaments.  Experience unique gameplay and nail-biting matches as you play through different leagues in an amazing cross-platform experience. Play single player or multiplayer with two players, three players, four players, and five players and up to 6 people.<br/><br/>Go on an adventure in a fantasy world with human mobsters, punk-rock goblins, soda drinking orcs, and katana-wielding elves. Grow your magical and elemental powers to be the strongest of them all. Experience fun and quirky characters and amazing animations and effects that lead up to a throwdown of epic proportions.<br/><br/>Card Battle is a simple colour matching game, play cards to damage your enemies, players whose health drops to zero lose, the remaining fight till only one remains. If you can play  Uno you can play this too! Play Card Battle with up to 6 people, everyone from your family, even grandparents, and kids can enjoy a party card game along with their Friends.<br/><br/>As you level up, you unlock amazing characters, meanwhile, you upgrade and switch between old cards to create your own all-powerful and custom deck. Strategize your deck and play with 8 different cards at a given time.<br/><br/>The players have to match the color of the card or type of card to the card in the center on their turn. All cards have unique abilities and use them to unleash a FIRESTORM or to FREEZE the opponents. To turn around the flow of a game, use clever counter-attacks to deal multiplied damage! Characters have unique animation in 2D graphic novel and comic style.<br/><br/>A unique cross-platform gaming experience.<br/><br/>Please rate and give your feedback for Card War to help us improve the game on feedback@bombayplay.com", "metacritic": null, "released": "2021-02-15", "tba": false, "updated": "2021-03-08T03:33:40", "background_image": "https://media.rawg.io/media/screenshots/627/6271b353ad1949dbc4bc34b6d4435773.jpg", "website": "https://www.bombayplay.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 128, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Bombay Play"], "genres": ["Strategy", "Card"], "publishers": ["Bombay Play Private"], "esrb_rating": "Everyone 10+"}