{"id": 568952, "slug": "ludo-4", "name": "LUDO‎", "name_original": "LUDO‎", "description": "Ludo is fun to play a multiplayer board game that can be played between 2, 3 or 4 players. It is the most popular and fun game to play with family and friends. Ludo is a mind refreshing game with its lucky dice rolls and strategical gameplay. This interesting 2D Ludo game has been around us for a long time as the best game to play in our spare time.<br/><br/>How the Ludo game works:<br/>Ludo game starts with four tokens placed in each player's starting box. A dice is rolled in turns by each player during the game. The player's token will be placed on the starting point when a 6 is rolled on the dice. The main goal of the game is to take all 4 tokens inside the HOME area before the other opponents.<br/><br/>Basic rules of Ludo game:<br/>- A token can start to move only if the dice rolled is a 6.<br/>- Each player gets a turn wise chance to roll the dice. And if the player rolls a 6, they will get another chance to roll the dice again.<br/>- All the tokens must reach the center of the board to win the game.<br/>- The token move clock-wise according to the number of rolled dice.<br/>- Knocking out other's token will give you an extra chance to roll the dice again.<br/><br/>Game features:<br/><br/>Single Player - Play against the computer.<br/>Local Multiplayer - Play with friends and family offline.<br/>Play 2 to 4 players.<br/>You can continue your game anytime.<br/>Multi-colored dice for each player.<br/>Real Ludo dice roll animation.<br/>View the progress of each player in percentage.<br/>Throw dice or roll instantly.<br/>Shake your phone to roll the dice option.<br/>Customize game speed yourself.<br/>Easy single menu player selection.<br/>Play the Ludo game in your native languages.<br/>English, Hindi, Nepali, Spanish, Portuguese, French, Arabic &amp; Indonesian languages are supported in this Ludo game.<br/><br/><br/><br/>Enjoy playing the best offline version of the Ludo game anytime anywhere with your friends and family. The multiplayer version of this game is coming soon, so stay tuned.<br/><br/>Some of the people misspell \"Ludo\" as Lodo, Ledo, Lido, Loodo, Loado, Ludu, Lodu.<br/><br/>We hope you enjoy playing this Ludo (or, Fia, Fia-spel, Chevaux, Cờ cá ngựa, Le Jeu de Dada, Non t'arrabbiare, Petits Chevaux, Ki nevet a végén,  लूडो ) whatever you call it in your language.<br/><br/>Please send us your feedback, and we'll try to improve the game performance as per your requirements.<br/><br/><br/>Thank you for playing Ludo and do check out our other games.", "metacritic": null, "released": "2019-02-15", "tba": false, "updated": "2021-03-08T03:26:09", "background_image": "https://media.rawg.io/media/screenshots/52e/52ea28dd46a1f04d7481d4257b46c2dc.jpg", "website": "https://www.yarsagames.com/portfolio/ludo-the-board-game/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 87, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Yarsa Labs"], "genres": ["Board Games", "Casual"], "publishers": ["Yarsa Labs"], "esrb_rating": "Everyone 10+"}