{"id": 568932, "slug": "base-one", "name": "Base One", "name_original": "Base One", "description": "<p>Base One is a base building strategy game with an RPG twist. After a large wormhole tears the moon apart and causes unprecedented levels of natural disasters, the Earth Global Union create the Solution space exploration program in order to explore the wormhole for a new home. As the Commander of the Solution, it is up to you to expand the fleet, find valuable minerals and new planets to inhabit - and maybe even save the Earth from ecological destruction!<br />\nTake command of the EGU fleet of space stations across every corner of the galaxy.<br />\nSelect a wide range of crew members with their own unique perks, characteristics and traits to best tackle specific tasks on the space stations.<br />\nMonitor the space station network&#39;s shared resources - power, heating, oxygen and water supply. Juggling these finite supplies across each station is critical for survival!<br />\nUpgrade your artillery to make quick work out of whatever asteroid comes your way along. Keep space pirates at bay with the best military expertise EGU can provide!<br />\nBuild your own Solution expedition, listen to the various tales the crew have in store for you and explore undiscovered systems such as the Hope system. There is even a Custom Game mode for the more experienced player who want to build their own campaign with their own conditions and quests.The Solution is in your hands, Captain!</p>", "metacritic": null, "released": "2021-05-11", "tba": false, "updated": "2021-05-14T02:59:43", "background_image": "https://media.rawg.io/media/screenshots/cf8/cf8bd771d159435160a70881c29d273e.jpg", "website": "https://www.blowfishstudios.com/game/base-one", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 10, "toplay": 2, "dropped": 3}, "playtime": 1, "achievements_count": 21, "ratings_count": 2, "suggestions_count": 501, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC", "macOS"], "developers": ["Pixfroze"], "genres": ["Strategy", "Simulation"], "publishers": ["Gamera Game", "Blowfish Studios"], "esrb_rating": null}