{"id": 568931, "slug": "dorfromantik", "name": "Dorfromantik", "name_original": "Dorfromantik", "description": "<p>Dorfromantik is a relaxing building strategy and puzzle game in which you place tiles to create ever-growing, idyllic village landscapes. With Dorfromantik, you can immerse yourself in a quiet, peaceful world at any time and take a break from everyday life. At the same time, Dorfromantik offers a challenge for those who are looking for one: To beat the highscore, you need to carefully plan and strategically place your tiles.<br />\nIn Dorfromantik you start with a stack of procedurally generated tiles. One after the other, you draw the top tile of the stack, place it on one available slot and rotate for the best fit. Thereby groups and combinations of landscapes are formed, such as forests, villages or water bodies, and you are rewarded with points depending on how well the tile fits.<br />\nOn some tiles you will also encounter special objects that give you a quest: For example, the windmill wants to border 6 grain fields, the locomotive wants to be connected to 10 tracks or the deer wants to inhabit a forest with at least 50 trees. Fulfill these quests to get more tiles to continue the expansion of your landscape. The game ends when the tile stack is used up.<br />\nAs you expand the landscape, you can advance into new, colorful biomes and discover pre-placed game objects that give you long-term tasks. Through these tasks you can unlock new tiles, new biomes and new quests.<br />\nWhat Dorfromantik offersBuilding endless and beautiful landscapes<br />\nUnique mix of strategy and puzzle mechanics<br />\nRelaxing and calming gameplay<br />\nIdyllic village scenery<br />\nStrategic placement to beat the highscore<br />\nHigh replay value - every session is different<br />\nMany unlockable tiles and biomes<br />\nOriginal Artstyle with handpainted boardgame feelWhat Dorfromantik does not offer4X Strategy<br />\nTrading<br />\nResource Management<br />\nCombat &amp; Violence<br />\nMultiplayer<br />\nDorfromantik was developed by four game design students from Berlin. Together we have founded Toukana Interactive and want to develop many more small, original and high-quality indie games in the future.<br />\nWe are happy about constructive feedback of all kinds, so feel free to contact us! We will do our best to respond to messages quickly and fix any problems that may arise. :)</p>", "metacritic": null, "released": "2022-04-28", "tba": false, "updated": "2024-04-06T11:56:28", "background_image": "https://media.rawg.io/media/screenshots/b00/b00b7cc04dd09531b631ea4575696276.jpg", "website": "https://toukana.com/dorfromantik/", "rating": 3.85, "rating_top": 4, "added_by_status": {"yet": 44, "owned": 855, "beaten": 92, "toplay": 86, "dropped": 110, "playing": 35}, "playtime": 3, "achievements_count": 85, "ratings_count": 198, "suggestions_count": 258, "game_series_count": 0, "reviews_count": 201, "platforms": ["PC", "Nintendo Switch"], "developers": ["Timo Falcke", "Luca Langenberg", "Toukana Interactive", "Zwi Zausch", "hibird", "son-dro"], "genres": ["Strategy", "Simulation", "Casual", "Indie", "Puzzle"], "publishers": ["Toukana Interactive"], "esrb_rating": null}