{"id": 569002, "slug": "tankhalla-tank-arcade-game", "name": "Tankhalla: Tank arcade game", "name_original": "Tankhalla: Tank arcade game", "description": "Start the engine of your tank! It’s time to go to Tankhalla! Enjoy various game modes, easy-to-learn controls, and amazing cartoon graphics. Fight your way through hundreds of missions and dozens of dangerous bosses! And remember that you can play at any time, even without an internet connection!<br/>Tankhalla is a casual offline tank arcade that anyone can master. In this game losing is not the end of your journey, as you still earn experience and money even if your tank is destroyed. Unlock new tanks, drones, and perks to progress further and a bit of randomization will give you a new experience with each new try.<br/><br/>Tankhalla is:<br/>- 3 game modes, including a single-player campaign, all available offline;<br/>- 13 perks that can be stacked together to achieve your tank’s maximum destructive potential;<br/>- 8 ultimate abilities able to wipe out all the enemies at once;<br/>- 8 tanks, each with its unique starting perk;<br/>- 6 drones to help you on the battlefield.<br/><br/>Explore all game modes:<br/>◆ Campaign ◆<br/>Explore more than a hundred of PVE missions in 4 regions and fight humongous bosses on your way to victory!<br/>◆ Base Raid ◆<br/>Besiege enemy bases, destroy their defenses and stop the never-ending stream of enemy tanks by devastating their factories!<br/>◆ Training Grounds ◆<br/>Need more practice in close quarters battles? Then you will enjoy these skirmish fights! 3 lives, tons of upgrades and only one last tank standing!<br/><br/>CHOOSE THE TANK OF YOUR DREAMS<br/>8 tanks to choose from. Burn your enemies, strike them with lightning, snipe them down or leech health right from them – it’s up to you to choose your style!<br/><br/>GET A PET DRONE<br/>Feeling lonely? Summon this little helper to deal even more damage to your foes, or to give you a great boost! Create perk combos and make a killer duet of mass destruction!<br/><br/>FIGHT HUGE BOSSES<br/>They are literally HUGE! You will never forget your first encounter with every single one of them. Each one has its own unique abilities and behavior, and requires a special approach to be defeated.<br/><br/>FULL ARSENAL OF ULTIMATES<br/>Purge the battlefield with napalm fire, set turrets, cover yourself with an impenetrable shield or just nuke everything in your sights!<br/><br/>IDLE REWARDS<br/>Gain money and experience even when you are offline and come back stronger every day even when you decided to take a break from the game.<br/><br/>If you have any problems with the game, please let us know: tankhalla@corp.my.com<br/><br/>Join our communities to stay up to date with the latest game news:<br/>Facebook: facebook.com/Tankhalla<br/>YouTube: http://www.youtube.com/c/WHALEKITGames", "metacritic": null, "released": "2021-02-02", "tba": false, "updated": "2021-03-08T03:51:34", "background_image": "https://media.rawg.io/media/screenshots/7d3/7d3e8641d75d09becfb5b54368ffa5c7_mDLJmxC.jpg", "website": "https://bro.my.com/en/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 153, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["MY COM"], "genres": ["Action", "Casual"], "publishers": ["My.Com"], "esrb_rating": "Everyone 10+"}