{"id": 569025, "slug": "mystery-expedition-prisoners-of-ice-hidden-puzzle", "name": "Mystery Expedition: Prisoners of Ice Hidden Puzzle", "name_original": "Mystery Expedition: Prisoners of Ice Hidden Puzzle", "description": "Go on a chilling hidden object adventure to discover the legendary Inuit treasure. Find the lost expedition and solve thematic puzzles as a tale of terror unfolds.<br/><br/>Enticed by the legend of a secret temple of gold, your grandfather sailed to the icebound Arctic to never return. Follow his steps and find the hidden expedition as you collect coins and buy amusements for your penguin. Spot the beyond objects and furnish your igloo with ancient relics, dropped by your ancestor. Face the monster polar bear, which is anything but an animal, and challenge the God of Wishes himself.<br/><br/>Game features:<br/><br/>* 40+ locations with 3 types of collectibles to pick<br/>* 22 thematic mini-games and puzzlers<br/>* Over a dozen of hidden objects scenes to explore<br/>* Jigsaw puzzles as an alternative to finding tasks<br/>* Stunning cinematics and real actors as characters<br/>* Your own igloo with a playful animal companion<br/>* 3 difficulty modes and various achievements<br/><br/>Inspired by the Inuit mythology, this adventure game will squeeze the most of you logic, introducing new look to your favorite puzzles and skill games. Thus, the entanglement of ropes resembles sticks game, virus puzzle is actually bubble filler, and so on. Sudoku and pipe puzzles, as well as memory and matching games are all designed to maintain the fascination of the frozen Arctic wastelands. <br/>By the way, all find and apply hidden object puzzles have an alternative mosaic mode. If you prefer to solve jigsaw puzzles, you are welcome to switch to it any time. So, whether or not you are a fan of find it games, Mystery Expedition: Prisoners of Ice is your key to unforgettable adventure.", "metacritic": null, "released": "2017-02-10", "tba": false, "updated": "2021-03-08T04:04:40", "background_image": "https://media.rawg.io/media/screenshots/e71/e71f5f6f26019db260e0c3e62b7eff50_wChXWEq.jpg", "website": "https://www.facebook.com/Absolutist.games/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 257, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Absolutist"], "genres": ["Adventure", "Puzzle"], "publishers": ["Absolutist"], "esrb_rating": "Everyone 10+"}