{"id": 569314, "slug": "eschaton", "name": "Eschaton", "name_original": "Eschaton", "description": "\"I have come to tell you that you are free. Many ages ago, My consciousness left man, that he might develop himself. I return to find this development approaching completion, but hindered by fear and by misunderstanding.\"<br/><br/>Your final gift to humanity, stolen in it's final moments. An unheard of conspiracy spanning millennia snuffed in it's final act, only to be reborn.<br/>It's the 23rd of May, 2023 and you are about to end the world.<h3>Story</h3>You don't remember. A crashed van at the gates of a manor, a dead driver. A cold chilling fog pushes you towards the entrance where the door is curiously open. Reality ends here.<br/><br/>Presented in a late 90's low-poly style inspired by the fifth generation of games consoles,  Eschaton is a short, surreal, first person exploration game set in the Scottish Highlands. Explore, analyse the environment, talk to beings who don't quite make sense, experience a short surreal trip that lasts until midnight. Eschaton uses an experimental audio technique, headphones are recommended. <br/><br/><h3>Featuring</h3><ul><li> Simple gameplay with a experimental, surreal story<br/></li><li> A short experience which you can play at your own pace<br/></li><li> A meticulously recreated world presented in a low-poly aesthetic<br/></li><li> Surreal conspiracy themed lore that definitely doesn't include any hidden symbology or secrets</li></ul><br/>", "metacritic": null, "released": "2021-03-07", "tba": false, "updated": "2022-11-04T05:47:25", "background_image": "https://media.rawg.io/media/screenshots/c48/c4844124fdf6dffcb19ce6b373a1898e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 1, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["paradroid001", "jabuga"], "genres": ["Action", "Adventure", "Simulation", "Casual", "Indie"], "publishers": ["jabuga"], "esrb_rating": null}