{"id": 569432, "slug": "vira-8uddy", "name": "Vira (8uddy)", "name_original": "Vira (8uddy)", "description": "<p>Vira was inspired by the year 2020. I came up with my character's wants and needs based on her superpowers. Nicole or Vira is able to curate any disease or infection with her body. She has been able to since her childhood. This superpower has had its fair share of downsides as it often results in the death of others. Her parents are a prime example of that. For Vira, she WANTS to live a normal life. Throughout the story, she learns that in order to live a normal life she needs to trust another (Dan) to help her escape.   </p>\n<p>Vira’s wants and needs are similar but also different. I would say they are similar because without one you cannot have another. Without her wanting to have another life, would she still choose to escape? She is tired of harming others and wants to get out of doing the United state's dirty work. They differ because one requires her to leave her current situation and the other requires her to trust someone. As I mentioned earlier, in order for her to escape this mission she has been forced to do, she will have to trust Dan. Dan is also apart of the FBI and is one of Viras closest friends.\r\n  </p>\n<p>Her decisions in the story lead to slightly different outcomes. Vira has a hard time letting others in and we can see that throughout the passages. She is not one to always reveal information, she needs to be talked to in order for her to feel comfortable. On the other hand, she has killed a lot of people over the years and has become desensitized towards killing. It is so easy for her because she doesn’t even have to touch someone to kill them. In the passages, there is one scene in particular that really changes her. After she kills all those innocent people on the subway she realizes that this is not for her anymore.\r\n  </p>\n<p>Throughout the story, I think the most important thing to make story beats make sense was to stick to the overall needs and wants. By doing that made it so much easier because I was able to work in a box. I had clear boundaries that I knew I had to stay within to help with the continuity of the story. For example, I knew that in order for Vira to realize her need, I wanted her to make the mistake of not trusting Dan the first time. Vira would then learn that going about leaving a federal agency like the FBI would be much harder than she thought it would be alone.   </p>\n<p>I aligned the reader's interests with the character's motivations by giving the character agreeable motivations. I think we can all agree that killing is bad, so I thought about making an anti-hero that would redeem themselves by wanting to leave their current agency. Vira was born with an ability she has learned to control. I wanted readers to sympathize with her on the fact that she has been forced to be used as a biological weapon from a young age. I asked myself, what would I do in this situation? In order to help myself write the story. \r\n</p>", "metacritic": null, "released": "2021-03-07", "tba": false, "updated": "2021-03-08T05:45:21", "background_image": "https://media.rawg.io/media/screenshots/e0f/e0f11a500f4f3bcc5d46a47f1fb58345.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 49, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["8uddy"], "genres": [], "publishers": [], "esrb_rating": null}