{"id": 569410, "slug": "silverpath-online-mmorpg", "name": "Silverpath Online MMORPG", "name_original": "Silverpath Online MMORPG", "description": "<p>Silverpath Online is an action MMORPG. With a huge overworld to explore, tons of monsters to defeat and classic mmo mechanics, Silverpath Online brings you joy of nostagic RPG experience combined with oldschool openworld multiplayer. Game is released in English, Portuguese and Turkish.</p>\n\n<p>This game is a action, no-auto targeting, openworld aka no-instance online role playing game. PvE, PvP is all good and PK (after lvl.20) is enabled. Local, global, party and whisper chat is available, guild(club) system is there but needs more work, such as guild world map, which is on progress. You can create your own club and even draw your own 16x16 club flag. Trading is possible in any sense, you can use trading option for safe and important trades or just drop items on the ground. Don't forget the fact that you have to progress on mainquest to unlock further overwold maps.\r\n</p>\n<p><strong>Classes</strong>\n</p>\n<p>There are 3 classes currently, this is a sword arts game so all classes use melee weapons, yet they have magician skills too, since there are 5 different stats to distribute. Classes are Knight, Swordsman and Rogue. You can make you own build by distributing both of your stat tree limits on character creation and your stats points after each level. For Ex. You can you for Vit/Str Tank Knight or Will/Det Magic Knight. You also should have to distribute your skill points after each 5 levels.\r\n</p>\n\n<p><strong>Jobs</strong>\n</p>\n<p>There are 10 jobs for players can do. Woodcutting, Mining, Fishing, Harvesting, Archeology, Camping, Foundry, Blacksmithing, Cooking and Carpentry. With these jobs, players are able to exceed their power limits or create items that may boost their gameplay experience. Job system is really comprehensive, you should try it out yourself and discover materials, consumables and handmade gear that can be crafted.\r\n</p>\n<p><strong>PvE and Equipment</strong>\n</p>\n<p>PvE is pretty simple at first, and it gets super complex after the mid-game, you can still go for simple builds and finish the game, but it will take longer time to spend than usual. After the mid-game, you have to imbue your equipment with element pears, crystals and ores. Along with monsters having some resistance or weaknesses to certain elements, they have elemental attacks that would require counter-elemental imbued armor and accessory to lower their damage on you. So it is kinda pokemon-like to sum up.\r\n</p>\n\n<p><strong>PvP and PK</strong>\n</p>\n<p>PvP is simple, you can always send a duel request to anyone and do a battle on overworld without resulting in any death. PK on the other hand, has consequences and limitations. First you have to be level 20+ to PK or PK'ed by someone else. And then, if you change to criminal mode, you may not be able to revert it back for a minute, which means you are vunerable to any attack for that long, when you are killed on criminal mode, you will be sent to jail for a while depending on your crimes. Jail timer does reset when you background the game or exit.\r\n</p>\n<p><strong>Cash Shop, Cosmetics</strong>\n</p>\n<p>Maxing your character out in this game won't take a long time since this game is completely free to play and premium cash shop only consist of cosmetics. Also stats reset, skill reset and item protection dust is in the premium store but theese are obtainable in the game and its guaranteed that you will have them as long as you keep doing side quests.</p>\n<p>For more check Wikia</p>\n<p>Join our Discord Channel</p>", "metacritic": null, "released": "2021-03-07", "tba": false, "updated": "2021-03-08T05:40:52", "background_image": "https://media.rawg.io/media/screenshots/fa8/fa832dae3f59a98e2ddeedb5c9dec5b0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 114, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Mert OGUZ"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}