{"id": 569697, "slug": "play-with-the-ball", "name": "PLAY WITH THE BALL", "name_original": "PLAY WITH THE BALL", "description": "Descrizione del gioco\r\n<p>PY. Questo gioco è il primo che carico su questo sito. Spero che ti piaccia come piccolo hobby, anche se molto semplice è molto divertente. Spero vi piaccia.</p>\n<p>Divertiti. </p>\r\nLa mia descrizione\r\nINGLESE\r\n<p>Ciao.\r\n  </p>\n<p>Il mio nome è PY. Sono uno sviluppatore di giochi e un creatore di giochi. Creo principalmente giochi di mia invenzione a partire da 0. Tutta la grafica che vedete nei vari giochi è realizzata da me = (PY). Se trovi problemi o bug nei giochi scrivi nel commento.   \r\n  </p>\n<p>Esempio: \r\n  </p>\n<p>!!! Ho riscontrato un problema con la grafica !!! \r\n  </p>\n<p>Successivamente vedrò il commento e rilascerò una versione aggiornata ogni due settimane, con i problemi riscontrati. \r\n  </p>\n<p> Se sei un'azienda che vuole supportarmi scrivi a questa email:</p>\n<p>PYGREEK.company@gmail.com </p>\r\nITALIANO\r\n<p>Ciao.\r\n  </p>\n<p>Mi chiamo PY. Sono uno sviluppatore e creatore di giochi. Io principalmente creo giochi di mia invenzione partendo da 0. Tutta la grafica che vedete nei giochi è fatta da me. Se trovate problemi o bug nei giochi, scrivete nel commento.\r\n  </p>\n<p> Esempio:</p>\n<p>!!! Ho trovato un problema con la grafica !!! \r\n  </p>\n<p>Più tardi vedrò il commento e rilascerò una versione aggiornata ogni due settimane, con i problemi che avete incontrato. \r\n  </p>\n<p>Se sei un azienda che mi vuole sostenere scrivi a questa mail:</p>\n<p>PYGREEK.company@gmail.com <br/></p>\r\nFRANCESE\r\n<p>Ciao.\r\n  </p>\n<p>Je m'appelle PY. Je suis un développeur et un créateur de jeux. Je crée principalement des jeux de mon injection à partir de 0. Tutti i grafismi que vous voyez dans les jeux sont faits par moi. Si vous trouvez des problèmes ou des bugs in les jeux, écrivez dans le commentaire.\r\n  </p>\n<p> Esempio:</p>\n<p>!!! J'ai trouvé un problème avec les graphismes. !!!\r\n  </p>\n<p>Plus tard, je verrai il commentaire et je publierai une mise à jour toutes les deux semaines, avec les problèmes que vous avez rencontrés. \r\n  </p>\n<p>Si vous êtes une entreprise qui veut me soutenir écrivez à cet email:</p>\n<p>PYGREEK.company@gmail.com <br/></p>\r\nTEDESCO\r\n<p>Ciao.\r\n  </p>\n<p>Mein Name ist PY. Ich bin ein Entwickler und Schöpfer von Spielen. Ich erstell hauptsächlich Spiele, die ich selbst erfand, ab 0. Alle Grafiken, die Sie in den Spielen sehen, sind von mir gemacht. Wenn Sie Probleme o Bugs in den Spielen finden, schreiben Sie es in den Kommentar.\r\n  </p>\n<p> Beispiel:</p>\n<p>!!! Ich habe ein Problem mit der Grafik gefunden !!!\r\n  </p>\n<p>Später werde ich den Kommentar sehen und eine aktualisierte Version alle zwei Wochen veröffentlichen, mit den Problemen, die Sie angetroffen haben.   </p>\n<p>Wenn Sie ein Unternehmen sind, das mich unterstützen möchte, schreiben Sie an diese E-Mail:</p>\n<p>PYGREEK.company@gmail.com </p>", "metacritic": null, "released": "2021-03-06", "tba": false, "updated": "2021-03-08T06:53:48", "background_image": "https://media.rawg.io/media/screenshots/ec9/ec9ac2153eaa3091a8a51eecfd63b92e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["PYGREEK"], "genres": [], "publishers": [], "esrb_rating": null}