{"id": 569640, "slug": "take-it-racing-2", "name": "Take It Racing 2", "name_original": "Take It Racing 2", "description": "TAKE IT RACING  2! \r\n<p>This demo is a retro driving-strategy game that lets you buy and sell cars to take part in the <strong>Stock Car Racing <em>Amateur Cup</em></strong>.<em> </em>Created in GB Studio, you can play this on your Game Boy!</p>\r\nBrowser Controls \r\n<p>(Click inside the game screen to activate the game)</p>\r\nActionButtonAlternate Button<br/>Move Cursor Up<br/>Up Arrow<br/>W key<br/>Move Cursor Down<br/>Down Arrow<br/>S key<br/>Move Cursor Left<br/>Left Arrow<br/>A key<br/>Move Cursor Right<br/>Right Arrow<br/>D key<br/>Interact, Click, Skip Text<br/>Alt<br/>Z key, J key<br/>BackCtrlK key, X Key<br/>\n<p><strong>To replay the tutorial, interact with the<em> (?) </em>on the Main Menu.</strong> Save your progress by using the save icon on the Main Menu.</p>\r\nStarting in Spring 1950, you begin your racing career in the Stock Car Racing <em>Amateur Cup</em>. Pick from a choice of cars and take part in the qualifier to play the rest of the Championship. Win races to earn money and try out different cars. \r\n<p>This is a work in progress and will be continually improved upon. Any and all feedback is appreciated so please leave a comment about your experience, especially if it was negative, I want to improve this!<br/></p>\n<p>Please note: the downloadable ROM is also only the demo. Windows Executable coming soon. Please donate to support Take It Racing 2's development.<br/></p>\n<p><strong><em>Credits: </em></strong> <br/>Sole Game Developer - Robert Doman<br/>Engine - Chris Maltby, GB Studio</p>\n\n<p>The first Take It Racing was made over 1 week for GB Jam 8 and the Unexpected Jam. Take it Racing 2 has been in my mind ever since. It took 2 months to complete the demo.<br/></p>", "metacritic": null, "released": "2021-03-06", "tba": false, "updated": "2021-03-08T06:37:50", "background_image": "https://media.rawg.io/media/screenshots/3c9/3c98a4fc7af0659965560c181478c7f6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 111, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["R-Doman"], "genres": ["Strategy", "Racing"], "publishers": [], "esrb_rating": null}