{"id": 569789, "slug": "flight-from-storhavn", "name": "Flight From Storhavn", "name_original": "Flight From Storhavn", "description": "\r\nA downloadable game for Windows.\r\n\n<p>\n</p>\r\nFeatures:\r\n<p>A straightforward mini Shoot 'Em Up.<br/></p>\n<ul><li>One weapon</li><li>One kind of power-up (shield energy)</li><li>Short Levels (game progress will be saved)</li></ul>\n<p>The game is mainly but not exclusively intended for <strong>a casual game experience</strong>. A limited number of game elements and simple graphics make it easy to understand what is happening on the screen. Yet everything is designed and arranged to be varied and increasingly exciting. And whilst the game is short (flawless run: about 22min net flight time), it strives to convey an experience of an epic a tiny adventure in outer space.<br/><br/></p>\r\nStory / Gameplay:\r\n<p>This game is not about spaceship battles or starship laser fights. In fact there hasn't been a war in Storhavn for almost a century. Since then Storhavn has thrived and prospered. It is now the second largest industrial planetary system outside the Milky Way. And everything could be fine...<br/></p>\n<p>... When suddenly Storhavn's sun mysteriously explodes. There is only one way to survive: Escape!<br/></p>\n<p>Pilot your spaceship to the intergalactic transportation platform to teleport yourself home to the Milky Way. Try to avoid collisions with stray cargo containers and spaceships, which suffer from severe technical failures. Nevertheless, you should not shoot at the other spaceships - their pilots are just helpless fellow victims to this natural catastrophe. Shoot your way through asteroid fields. Try not to be destroyed by malfunctioning defence systems.<br/></p>", "metacritic": null, "released": "2021-03-05", "tba": false, "updated": "2021-03-08T07:16:02", "background_image": "https://media.rawg.io/media/screenshots/beb/beb5a1072d3f2160ea037d800c8e928e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 161, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["DePaSciFi"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}