{"id": 569852, "slug": "prisoners-in-space", "name": "Prisoners in Space", "name_original": "Prisoners in Space", "description": "<p>Hostile aliens have kidnapped a spaceship full of space pioneers as they were heading towards an earth like planet. They are being held prisoner in clusters of blocks drifting in space. Your mission is to destroy these block clusters and rescue the prisoners by catching them with your ship. Be prepared for retaliation, though. Many of these blocks are armed with missiles and smart bombs and will be deployed when destroyed.</p>\n<p>I recommend you play this game with a controller. Use the controller as follows:</p>\n<p>Left Analog Stick: Controls the left, right, down and upward movement of your ship.</p>\n<p>Right Trigger Button: Fires thruster to increase upward movement of your ship.</p>\n<p>The A Button if you're using an Xbox Controller: Fires bullets from your ship.</p>\n<p>For the keyboard Player:</p>\n<p>Left Arrow Key: Moves ship to the left.</p>\n<p>Right Arrow Key: Moves ship to the right.</p>\n<p>Up Arrow Key: Moves ship upward.</p>\n<p>Down Arrow Key: Moves ship downward.</p>\n<p>Alt Key: Fires thruster to increase upward movent of your ship.</p>\n<p>Space Bar: Fires bullets from your ship.</p>\n<p>Author's note:</p>\n<p>I only completed 3 levels in this game. I had intentions of creating a total of 10 levels, but I ran into issues with Gamemaker 2's collision detection (which was no fault of mine) and got discouraged. So for now, this is it. Maybe one day I'll get my interest back and finish the game. Until then, I hope you enjoy what I have done.</p>", "metacritic": null, "released": "2021-03-05", "tba": false, "updated": "2021-03-08T07:30:45", "background_image": "https://media.rawg.io/media/screenshots/944/944c3779e178a09d9b80832e8294ad73.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 15, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["CosmicDrifter55"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}