{"id": 569845, "slug": "morph-itch-513productions", "name": "Morph (itch) (513productions)", "name_original": "Morph (itch) (513productions)", "description": "<p>Artist Statement</p>\n<p>When we were first given the assignment, I didn’t exactly have an immediate idea for a hero or what their journey could even be. It wasn’t until I overheard this cheesy superhero show my girlfriend was watching a few weeks back when I heard a character say what her powers were. She had the ability to drain other people’s powers and I thought that’s something you don’t really see too often. From there, I borrowed that concept and thought “Okay, it’s a cool power, but where is the conflict in that? They wouldn’t hold up too well in a fight.” I decided to take it a step further and have it to where they could use a lesser version of the power they steal for a limited time. With that first coat of paint drying, I came up with both the guy’s name, Derek Perry, and his superhero alias, Morph. I almost instantly thought that his power could act as a metaphor for trying to be something that you’re not and before I knew it, I had his want/need ready to go. </p>\n<p>Derek is someone who isn’t naturally a mean person. He’s a lot like how I was in high school when I was trying to find where I “fit” into and I might’ve come across a little flaky or annoying. He <em>wants </em>to be the greatest superhero of all time and be accepted by everyone, but he <em>needs </em>to accept himself and be the best <em>he </em>can be. Little does he know that while he may not be cut out for being the poster child for superheroes, he does add value. It’s not about making sure others accept you, it’s about making sure you accept yourself. If you can’t be the greatest at something then learn to be the greatest that <em>you </em>can be for yourself.\r\n</p>\n<p>When it comes to the story, there are multiple dead ends or dips where Morph either chooses the long way of doing something or is in a kind of “slumpy” mood. Depending on how these parts within the story affect the player dictates what choice they want to make next. They also learn about each hero when they choose who they want to take their power from which in turn reveals much more fleshed out characters by the end battle.\r\n</p>\n<p>The decision for these beats comes from a simple action and then reaction. There’s danger: Morph goes to it and maybe chooses the wrong route getting there. He’s down after his talk with Myrtra: does he want to eat or sit on the couch? The character has to go from the highest high and then the lowest low and in order to reach the top again, they have to crawl their way up. Something needs to happen to turn the scene from positive to negative or negative to positive.\r\n</p>\n<p>And finally, when it comes to aligning the reader's interests with the character's motivations, you WANT to see him succeed by the end and you hope he makes the right decision. The only catch to this is the fact that you, the character, are able to make that choice. You want to see how he ends up helping by the end and how the other heroes will accept him. If he’s motivated, then the player is motivated. If he’s down, you’re (hopefully) down or at the very least feeling sorry for him.\r\n</p>", "metacritic": null, "released": "2021-03-05", "tba": false, "updated": "2021-03-08T07:28:16", "background_image": "https://media.rawg.io/media/screenshots/916/916d3c429a283b968e2f7e2cdca7b920.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 37, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["513productions"], "genres": [], "publishers": [], "esrb_rating": null}