{"id": 569923, "slug": "kerr-meaningful-choices", "name": "Kerr Meaningful Choices", "name_original": "Kerr Meaningful Choices", "description": "<p>Artist's Statement</p><p>My story is about a young woman named Rose Marie living in a small town in West Texas. Contrary to what most people might believe, she enjoys the simplicity of living in a small town and is not eager to pack up and leave. When trying to decide what my character’s unique ability would be, I started by thinking about her personality and what ability would complement her well. I used the Ramsdell brainstorming exercise to help me come up with the scenario in which the character would be in so that I could then brainstorm what her personality would be like in that situation.</p>\n<p>            In contemplating the questions about a specific event, what happened, when it took place, where it took place, and who was there, I found myself being brought to the small town my grandparents live in. I did not land on an exact event or memory to draw inspiration from; however, I was able to enter into the environment of Miles, TX, and reflect on a variety of things that always make me think of Miles. Our visits to my grandparents’ home usually included the same main events and remained fairly simple. We woke up early, drove around the dirt roads with grandpa, checked on the cows, gathered eggs, and would get dinner with my grandpa in town at the local bar and grill. I spent time writing down all the things that came to mind when I thought of my visits to Miles and began setting up the scene and world for my character to exist within.\r\n</p>\n<p>            Then, I began thinking about Rose and what her personality would be like and what her wants and needs would be. I wanted her to be someone I could relate to, so I kept her fairly simple. A small-town country girl that enjoyed the simple life of living on a farm and had a heart bigger than life itself. This helped lead me into deciding what her unique ability would be. Rose has the ability to know the deepest desires of a person’s heart upon meeting them and as she gets to know them more her heart begins to desire the same things. This leads her into caring very deeply for the people she meets and greatly wanting to help them to fulfill their deepest desires. Although this unique power gives her the ability to care for and love others in a deeper way, things can get a little uncomfortable because she cannot control these desires and how intensely they take over her own heart. In this story, the reader is walked through a particular experience in which Rose meets a guy named Austin. He is from out of town and on his way to pursuing a career in music in the big city. After meeting him, Rose begins to develop the same passion for music that Austin has and feels all of the emotions he does when thinking about pursuing his dreams.\r\n</p>\n<p>            This interaction begins to lead into the development of Rose’s wants and needs within this specific relationship and part of her life. She wants to pursue this relationship and she wants Austin to like her as much as she likes him, but in order to be truly happy, she needs to be honest with him and for him to see her for who she really is. She needs to share her own passions and desires with him and not just tell him what he wants to hear to get him to like her. The decisions the reader has to choose between relate back to deciding between the character’s wants and needs. For instance, when she first meets Austin, she has to decide whether to give him all the answers she knows he wants to hear because she knows what his heart desires or to be honest in telling him that she does not know much about music. If she chooses to tell him what he wants to hear as an attempt to bind with him, then she begins to go down a path that leaves her feeling somewhat incomplete because she is not able to fully share the truth of her heart with him. If she chooses to be honest, then she is given the opportunity to authentically learn more about his love for music directly from him instead of from her ability to already know his desires. However, rather than locking the reader into one specific path after this first decision, I wanted to give them opportunities to change the character’s course. There are more choices presented to the reader that require them to decide whether Rose will be honest with Austin and open herself up to possibly getting hurt and losing him or playing it safe and just telling him what she thinks he wants to her.\r\n</p>\n<p>            These decisions come up as the two character’s relationship begins to develop. Naturally, Austin asks questions and wants to get to know Rose better, and these are the moments that she has to decide how much of herself she will actually allow him to see. I think these decisions will make the reader think about what they would want within their own personal relationships. I think this story is one any reader could relate to. We all experience the fear of being vulnerable and getting rejected while also having a deep desire to be vulnerable and share the entirety of our own heart and desires with someone else.\r\n</p>", "metacritic": null, "released": "2021-03-05", "tba": false, "updated": "2021-03-08T07:47:14", "background_image": "https://media.rawg.io/media/screenshots/4aa/4aad41e364982cc0d32c71c62ec60709.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 1, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["ttu_ak"], "genres": [], "publishers": [], "esrb_rating": null}