{"id": 570071, "slug": "dragon-ball-z-shadow-battle", "name": "Dragon Ball Z Shadow Battle", "name_original": "Dragon Ball Z Shadow Battle", "description": "<p>New Sayain Battle and Super Dragon is a 2D action-fighting game and running game for mobile platforms A legend character of our Childhood Dragon Ball’s games succeed to join indispensable list of game fighters. As you know, while Son Goku searching dragon balls, he discovers the world and he encounters with lots of difficulties.   </p>\n<p>   </p>\n<p>The objective of Goku Saiyan is beating all of the enemies on your way. In this game, you have to transform into heroes saiyan. One Saiyan Warrior. Can turn into Super Saiyan. To protect the Earth from enemies and He placed the god of destruction Berus in the game you have to accumulate a penny earned.   </p>\n<p>   </p>\n<p>To improve blood supply, strength and skill of their saiyan. Note the magic beans in the game. We help you revitalize blood and mana Unlike comics Dragon Ball. The enemies in the game will differ slightly. Beautiful and attractive.   </p>\n<p>   </p>\n<p>Son Goku the protagonist keeps searching Dragon Balls. If you do not want your enemy to find Dragon Balls before you, get the lead out! And beat all of your enemies. You can play this game with your buddy besides playing as single. You will not realize how time passed while playing. Let’s find these New Sayain Battle and Super Dragon!</p>", "metacritic": null, "released": "2021-03-04", "tba": false, "updated": "2021-03-08T08:25:56", "background_image": "https://media.rawg.io/media/screenshots/ac6/ac6482ac2852bd3307bb8177716eee2c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 53, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["GameMe"], "genres": ["Action", "Fighting"], "publishers": [], "esrb_rating": null}