{"id": 570059, "slug": "mind-enigma", "name": "Mind Enigma", "name_original": "Mind Enigma", "description": "<p>Artist's Statement\r\n  </p>\n<p>The story of Mind Enigma took on many forms before finally landing on the final idea. At first, I thought I would use teleportation or mind-reading as the superpower the kid had. What the character wanted was sanity and simplicity in their own world. What he needed to do was help the sanity and simplicity of another before finding out how to deal with his own.\r\n  </p>\n<p><strong>*Spoiler Alert*</strong>\n</p>\n<p>The main way the main character Alex separated his wants and needs throughout the story was trying to understand that he also does not need to do it on his own. The antagonist we meet needs to understand that as well so once we figure this out and binds both character's wants and needs to the main understanding.   </p>\n<p>The biggest plot point in the story is making the main conflict of the story about preventing a school shooting. I thought long on this and questioned if it was in poor taste to make this a conflict when the actual idea has affected all of us in different ways. I grew up having to do lockdown drills for about 11 years as well as living through some tragedies, so I understand the feeling. Therefore, I kept the concept to bare bones and no actual atrocity occurs. I wanted the way you fix it to be something you fix at the heart and not by more means of destruction. I thought this conflict would hit home for some people and let them feel immersed.   </p>\n<p>Aside from that, the superpower idea was very difficult to keep in check. I wanted his power to be time travel, but he was also aware of the structure of his own life. This idea might have been too hard for me to keep up with in the end but I still enjoyed writing about it.  Next was the puzzle of the cereal and finding out that the key to the future was within the milk. I wanted to throw a simple yet funny puzzle into the story and deciding how to do that was hard. The mild idea took like 5 different forms before I decided on the last one.   </p>\n<p>The beats that held the story together were three sections I had the story split into. First was the day in the life of our main character. I had him do everything a normal kid would get ready for school then I sprinkled in multiple ways to get his power. The next section was the build-up and the conflict this was most of the parts done within the bathroom section. The last section was the future and fixing the main conflict. Once I had the main ideas down I went through and tried to make it stronger.   </p>\n<p>This was a difficult one I wanted to make the character relatable yet simple, so no one felt left out. He did everything a normal person would do in many of the situations. As I said earlier, I wanted the audience to relate to the feeling that Alex is in when he discovers the conflict. It brings out the shared mind we have on the touchy topic and I wanted to show that helping the antagonist emotionally trumps violence before anything has happened. Also, I didn’t want to actually write about something tragic so that’s why I kept it very open-ended and open to the own reader's mindset.\r\n  </p>", "metacritic": null, "released": "2021-03-05", "tba": false, "updated": "2021-03-08T08:23:45", "background_image": "https://media.rawg.io/media/screenshots/d0f/d0f7c12300594628f8c083fef49d0f84.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 25, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["PlatinumAcer"], "genres": [], "publishers": [], "esrb_rating": null}