{"id": 570050, "slug": "a-bot-alone", "name": "A Bot Alone", "name_original": "A Bot Alone", "description": "<p>      You take on the role of EXO-2584, one of thousands of extraterrestrial probes sent to explore the cosmos by a distant alien race. You are assigned Earth, a planet likely to support complex lifeforms and rich natural resources. After a thousand-year journey, you finally break the atmosphere when tragedy strikes: your landing boosters are completely offline. You strike the ocean’s surface, hard, losing a majority of your core functionality and entering sleep mode. After hours, you successfully reboot only to find you are lying on the seabed in a colorful, truly expansive and unique procedurally generated aquatic wonderland.</p>\n<p>      Picking up control, you realize you have basic underwater mobility (much like a submarine) as well as the ability to analyze and scan objects and life forms in your environment, giving you motivation to continue your mission even in these unforeseen circumstances. After scanning an object, it is entered into your data bank, which can be accessed and explored at any time. You scour the depths, searching for natural resources (primarily copper and iron) to repair your core functionality while analyzing any and all life forms you come into contact with. Taking note, you notice smaller life forms exhibit schooling behavior, interacting beautifully with the landscape. As you explore further and further, you soon realize you have but scratched the surface: you have only explored the shallows. There is much more ocean out there. In fact, it is endless. You collect resources and through your component manager application, you modify existing parts of yourself, upgrading your swim speed in order to more efficiently travel, as well as creating and attaching completely new components, like a mining laser in order to more efficiently collect natural resources. At this point, you are ready to leave the shallows.</p>\n<p>      Shortly after traveling down into a new, unique biome, you are suddenly attacked by a hostile alien (a moray eel). It confuses you for a snack! Thinking fast, you scare it away with your mining laser and are free to continue exploring. Suddenly, you come upon a coral biome. There are more fish than you’ve ever seen and you quickly move to scan them all. You continue to collect new resources and upgrade your abilities. Eventually, you become addicted to this wondrous world, perhaps even forgetting about ever reporting to home.\r\n</p>\n<p>      This project was created as a course project for my Graduate game design class in Fall 2020, where I am currently pursuing a MS in Computer Science and Software Engineering. The game is playable from start to finish but far from what I would call complete.</p>", "metacritic": null, "released": "2021-03-05", "tba": false, "updated": "2021-03-08T08:21:48", "background_image": "https://media.rawg.io/media/screenshots/a97/a97e139fbda5e6185a5744562d9c44a1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 57, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ChiirYuu"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}