{"id": 570170, "slug": "the-last-show-of-mr-chardish", "name": "The Last Show of Mr. Chardish", "name_original": "The Last Show of Mr. Chardish", "description": "<p>Buy The Last Show of Mr. Chardish on GOG and receive unique exclusive goodies!</p>\n<h3>Accolades</h3><p>\"The Last Show of Mr. Chardish will break your heart\"\n<br/>\nKotaku AU\n<br/>\n<br/>\n\"I didn’t expect the gravity of loss and loneliness that surrounds The Last Show of Mr. Chardish\"\n<br/>\nCOG Connected\n<br/>\n<br/>\n\"...a unique art style mixed with multiple chapters of unique controls and mechanics...\"\n<br/>\nHappyGamer</p>\n<br/>\n<br/>\n<br/>\n\"The Last Show of Mr. Chardish\" is a journey through the variety of worlds created by the ingenious mind of the successful Director, Robert Chardish. Take the role of Ella, the Actress and through exploring an old theatre try to unveil secrets hidden in the extraordinary, magical plays created in the imagination of Mr. Chardish.\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nWhen they were young, the Actress and the Director were full of dreams and ambitions. Decades later, the Actress returns to the theatre, to once more become the performer, the audience and the muse.\n<br/>\n<br/>\nThe performances, the letters and the radio interviews - they are all meaningful, but will the Actress find what she's looking for? Attend the last show of a famous artist reflecting on his defining moments and your role in his life. \n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nWith each play you will explore a new, incredible scenography, fully painted in VR. Each performance tells the story of different characters, with individual gameplay mechanics and a unique closure. Be a robot escaping a factory or a little, boastful musketeer - every role you take is a medium for emotional experiences of the Director.\n<br/>\n<br/>\n<br/>\n<br/>\nTo separate the performances from the real world and put the stress on their artistic nature, we decided to reach for new, creative methods of graphic design. The plays’ segments of the game are painted using virtual reality technology. Exchanging traditional 3D modeling for painterly strokes and splatters granted us more expressive freedom in shaping the artistic vision of the Director.In The Last Show of Mr. Chardish you will experience:\n<ul><li>A rich, engaging story about the relationship of two artists, who founded a theatre in a British countryside.</li></ul><ul><li>Multiple chapters with different gameplay mechanics, telling individual stories tied to the main plot.</li></ul><ul><li>A unique art style created with VR painting technology.</li></ul>", "metacritic": null, "released": "2020-11-04", "tba": false, "updated": "2024-01-30T19:11:00", "background_image": "https://media.rawg.io/media/screenshots/4fb/4fb1d4e70e414b549ad68654a7fd5864.jpg", "website": "", "rating": 0.0, "rating_top": 4, "added_by_status": {"yet": 1, "owned": 2, "beaten": 4}, "playtime": 0, "achievements_count": 13, "ratings_count": 5, "suggestions_count": 187, "game_series_count": 0, "reviews_count": 5, "platforms": ["PC", "Xbox One"], "developers": ["Punk Notion"], "genres": [], "publishers": ["Hydra Games"], "esrb_rating": null}