{"id": 570184, "slug": "evolution-board-game", "name": "Evolution Board Game", "name_original": "Evolution Board Game", "description": "Inspired by the award winning game with more than 1.6 million players, Evolution has arrived on iOS! Adapt, survive, and thrive in a beautiful and ever-changing ecosystem enhanced by incredible art and thoughtful, balanced mechanics.<br/><br/>Try before you buy!<br/><br/>Reviews:<br/><br/>\"#1 Digital Board Game of 2019\" -Ars Technica<br/><br/>\"Best Mobile Strategy Game of 2019\" -Pocket Gamer<br/><br/>\"Best Digital Board Game of 2019\" -Vulture<br/><br/>\"A powerhouse game poised to steal the thunder of some of the most popular games on the app store\" -Touch Arcade<br/><br/><br/>NATURAL SELECTION IN ACTION<br/>In the game Evolution, you adapt your species to survive, and stay one step ahead of opponents. <br/><br/>-Watering hole running dry? Evolve a long neck to reach food in the trees. <br/>-Staring down a Carnivore? Develop a hard shell to fend off an attack. <br/>-Evolve up the food chain to become a the most successful species.<br/><br/>CHALLENGING AND ADDICTIVE<br/>Do you evolve protection from Carnivores, or find a way to eat if there is no Food in the Watering Hole? The ecosystem is constantly changing, and you’ve got to figure out what your opponents are up to. <br/><br/>INTERACTIVE TUTORIAL<br/>Our friendly professor will guide you from one watering hole to the next on our learn-as-you-play tutorial, showing you how to survive before sending you off to make a name for yourself. Hone your skill as you progress from lowly Biology Intern to competing for the Nobel Prize!<br/><br/>EXPLORE THE CAMPAIGN<br/>Explore the mysteries of Evolution Island and discover distinct Boss opponents. As you move through the campaign you’ll unlock new “Apex Species” that are masters of specific strategies; defeat them to add them to your menu of single-player opponents.<br/><br/>MATCH MADE MULTIPLAYER<br/>One click and the game will match you with players of similar skill in a fast paced online game. Make friends in the game and set up custom games, or rank up in the ongoing seasonal tournaments and see how far you can go.<br/><br/>ENDLESSLY REPLAYS, ONE PRICE<br/>This isn't a collectible card game, the full set of cards are included in the base game. Thousands of possible species combinations evolve from 17 unique trait cards, meaning no two games are ever the same.<br/><br/>PACE &amp; POLISH<br/>With a smooth user interface and fast, informative animations, Evolution was built to satisfy a quick fix of intense strategic battles. Easy to learn, almost impossible to master, one game and you’ll find yourself addicted. Evolution isn’t just a top tier strategy game – it’s a whole new animal.", "metacritic": null, "released": "2019-02-12", "tba": false, "updated": "2023-05-06T13:17:22", "background_image": "https://media.rawg.io/media/screenshots/cae/cae725a604453cbcab0cc24dbf470646_2wxRKVE.jpg", "website": "http://evolutiondigitalgame.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 425, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["North Star Games"], "genres": ["Strategy", "Board Games"], "publishers": ["North Star Games"], "esrb_rating": "Everyone 10+"}