{"id": 570186, "slug": "okey", "name": "Okey!", "name_original": "Okey!", "description": "The Turkish game classic \"Okey\" in its best form on mobile devices.<br/><br/>Okey is a traditional tile-based board game with long history and many variations. It's highly popular in Turkey, played mainly in coffee houses by people in every age. It's very similar to Rummikub as it is played with the same set of boards and tiles but with different rules.<br/><br/>Realistic feeling, simple interface and exciting gameplay!<br/><br/>Game is played by four players with a set of 106 tiles and 104 of them are numbered from 1 to 13 with four different colors. During the game each player has 14 tiles on his board. On each turn a player draws one tile and discards one tile. The object of the game is to be first to form a board which consists sets and runs using all 14 tiles. There are special tiles chosen in every game, called jokers which helps the player form his 14 tiles board of sets and runs, by replacing the tile which is missing. Two last tiles from 106-tile-set represented with stars are tricky 'false jokers', which against expectations acts as normal numbered tile.<br/><br/>Features:<br/>● Advanced Artificial Intelligence<br/>● Full HD graphics (perfect for high resolution tablets)<br/>● Multitouch support<br/>● Unlimited hours of joy<br/>● Multiple game modes<br/>● High playability<br/>● High quality animations<br/>● Turkish trophies to win<br/>● Many table images to choose from<br/><br/>In Okey, when you attempt to win a game by discarding a tile to the center of table (bank), if there are any mistakes with your groups, these groups will be highlighted with red color.<br/>You can tap and hold a tile in the same place for 3 seconds to flip it. This is generally used as a reminder of joker tiles in Okey game.<br/><br/>For online version please try our new game \"Okey Pro\" !<br/><br/>--------------------------------<br/><br/>Okey<br/><br/>Türk insanının en çok sevdiği okey oyununun teknolojiyle en güzel birleşimi. Evde, yolda, bayırda, çayırda istediğiniz zaman oynayın.<br/><br/>Bu Okey oyunu online değildir. Bu Okey oyununda gelişmiş yapay zekaya karşı oynuyorsunuz.<br/><br/>Özellikler:<br/>● Gelişmiş yapay zeka<br/>● Full HD grafikler<br/>● Multitouch desteği (tabletler için mükemmel)<br/>● Mükemmel oynama kolaylığı<br/>● Sayıdan düşmeli oyun modu<br/>● Yüksek kalite animasyonlar<br/>● Oyun içi kazanılabilinen bir cok öğe<br/>● Bir çok masa resmi seçeneği<br/><br/>Online versiyon için lütfen \"Okey Pro\" adlı oyunumuzu deneyin !<br/><br/>Desteğiniz için çok teşekkür ediyoruz !", "metacritic": null, "released": "2013-07-06", "tba": false, "updated": "2021-03-12T03:55:09", "background_image": "https://media.rawg.io/media/screenshots/6ee/6ee01e33a951d2627d2293b895809f1d_yY22yYm.jpg", "website": "https://www.ahoygames.com/games/okey/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 85, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ahoy Games"], "genres": ["Board Games", "Card"], "publishers": ["Ahoy"], "esrb_rating": "Everyone 10+"}