{"id": 570175, "slug": "smashing-the-battle-ghostsoul", "name": "SMASHING THE BATTLE GHOSTSOUL", "name_original": "SMASHING THE BATTLE GHOSTSOUL", "description": "To play this game on PS5, your system may need to be updated to the latest system software. Although this game is playable on PS5, some features available on PS4 may be absent. See PlayStation.com/bc for more details.<br/>SMASHING THE BATTLE, the 3D hack-and-slash action game featuring stunning heroines, returns with a new update containing new story content and characters. Take it up 200% for the PS4 release!<br/><br/>Gameplay - Smashing the Battle is a hack-and-slash action game.<br/>You battle against robots using standard attacks, as well as combo attacks. By crushing the enemy, you can open up the way forward. By attacking the enemy, you can gain skill points, allowing you to unleash devastating attacks on large groups of enemies all at once. After clearing each stage, use the coins you have collected to strengthen your character, allowing you to take on even more enemies. You can also use coins to purchase different costumes with various abilities.<br/><br/>2086 AD - Introduction: Ghost Soul<br/>The sealed underground area - 1 year after the incident with Kate.<br/>Amano Elle, an agent of the Special Operations Division of the Metropolitan Police Department, is tailing a Republic spy, who has entered the country undercover. A legendary hacker appears on the scene when Elle breaks into a facility where the former army was conducting secret nuclear research.<br/>Elle and Alina, both agents of opposing nations, each on a mission to discover the truth! Nuclear development, Military puppet operations, Neo-biocentrism... What will they find at the end of their intersecting stories?<br/><br/>2085 AD - Introduction　　<br/>In the dead of the night, at the Highrise multiplex construction site...<br/>Sarah O'Connell and her colleague, Ivan, are suddenly surrounded by rogue robots.<br/>After being rescued by Lorien, Sarah is able to escape and takes up the Hazard Suit in order to fight her way out!<br/>As the stories of Sarah and Mary collide, will they be able to get to the bottom of the incident and find out the truth?<br/><br/><br/>Offline single player<br/>Uses DUALSHOCK 4 vibration function<br/><br/><br/>Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy). <br/><br/>Software subject to license (us.playstation.com/softwarelicense). <br/><br/>One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.<br/>", "metacritic": null, "released": "2021-03-11", "tba": false, "updated": "2021-03-12T03:46:27", "background_image": "https://media.rawg.io/media/screenshots/29d/29dc19dbee40391c6cb5c18ee59a268c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 411, "game_series_count": 0, "reviews_count": 0, "platforms": ["PlayStation 4"], "developers": [], "genres": ["Action"], "publishers": [], "esrb_rating": null}