{"id": 570171, "slug": "sunblaze", "name": "Sunblaze", "name_original": "Sunblaze", "description": "<p>”Whose blood is that on the walls?” -Josie<br />\nDo you think you’ve got what it takes to be an actual superhero? Well, then you need to help Josie to beat the superhero training simulator, and to become the hero our world needs!<br />\nIn this beautiful, hand-crafted precision platformer, you’ll play as Josie, aka. Sunblaze, with a mission to complete your superhero training. Your dad, a former superhero himself, built the training simulator dreaming of your journey to become a superhero. The simulator is full of puzzles, brain-tickling challenges, double jumps, dashes, spikes, drones... And a purrfect sidekick: the cat. You have got a cat. What else do you need?<br />\nWell, skills. That’s what you need. Do you think you’ve got ’em? Dive into Sunblaze now, and be the hero... called Sunblaze.<br />\nAll you need is a simple story<br />\nThe story takes place inside a training simulator, where Josie is being trained to be a superhero by her father. There’s witty dialogue, embarrassing moments and of course the most important part of the family — the cat!</p>\n<p>Smooth and gameplay drivenThere’s no need to take a boring pause as you complete a level in Sunblaze. The in-game simulator calculates and draws you the next level immediately as you complete one! It is a delight to look at, but remember to keep your head clear - the next level is about to start!</p>", "metacritic": null, "released": "2021-06-03", "tba": false, "updated": "2024-03-28T19:04:18", "background_image": "https://media.rawg.io/media/screenshots/375/3751567b445a703a4469d05305471feb.jpg", "website": "https://sunblazegame.com/", "rating": 3.67, "rating_top": 4, "added_by_status": {"yet": 36, "owned": 272, "beaten": 1, "toplay": 3, "dropped": 5, "playing": 2}, "playtime": 4, "achievements_count": 20, "ratings_count": 9, "suggestions_count": 264, "game_series_count": 0, "reviews_count": 9, "platforms": ["PC", "macOS", "Linux", "Nintendo Switch"], "developers": ["Games From Earth"], "genres": ["Action", "Adventure", "Indie", "Platformer"], "publishers": ["Bonus Stage Publishing"], "esrb_rating": null}