{"id": 570258, "slug": "qv-the-dimension-painter", "name": "QV - The Dimension Painter", "name_original": "QV - The Dimension Painter", "description": "The puzzle adventure game QV, which has been receiving many favorable comments, has been launched!<br/><br/>- Famitsu Cross Review The Hall of Silver<br/><br/>- 2020 BIC Festival Finalist of Excellence in Casual<br/><br/>\"QV is an enjoyable puzzler packed full of content\"<br/>-GodisaGeek<br/><br/>\"An action adventure with the harmony of familiarity and novelty\"<br/>-IGN<br/><br/>• Able to respond to various languages – Provide a total of seven languages: Korean, English, Japanese, Simplified Chinese, Traditional Chinese, German, and French<br/><br/>• A game that can be played by anyone – Consisted of four levels per each stage, and a total of 172 levels. No matter how bad you are at playing the game, you can enjoy this game with no problem.<br/><br/>• Unique journey – There are various adventures prepared for you, such as crossing the water by spreading the ink of dimension or passing the road by connecting two walls with portals. <br/><br/>• Unique companions – Enjoy your adventure with many characters such as Varon the big bird from a different dimension, an unknown shadow, violent birds, and a golem that protects the fire.<br/><br/>• Various costumes – Find the fairies hidden here and there in the ruins and get cool outfits and hairstyles by achieving the missions.<br/><br/>• Perfect controller reaction – By using the game pad, enjoy a more lively and immersive play<br/><br/>• Beautiful music – Enjoy playing QV with the background music suitable for each region", "metacritic": null, "released": "2020-12-21", "tba": false, "updated": "2021-03-12T04:33:44", "background_image": "https://media.rawg.io/media/screenshots/3aa/3aac7e13c56b7769f962ab94bb3f35ac_upqPNtW.jpg", "website": "http://www.izzle.net", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 218, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Izzle"], "genres": ["Adventure", "Puzzle"], "publishers": ["Izzle"], "esrb_rating": "Everyone 10+"}