{"id": 570291, "slug": "embedded-joe-wise", "name": "Embedded (Joe Wise)", "name_original": "Embedded (Joe Wise)", "description": "Embedded is a photography game about journalistic choice.\r\n<p>Play as Henry Moris, a retired photojournalist, as he looks back on his work during the Vietnam War. </p>\n<p>Use your camera to capture history.</p>\n<p>Ask questions of those involved to gather quotes for publication.</p>\n<p>See how your choices shape what gets reported.</p>\n\n<p>Embedded is a game about photojournalism, editorial choices, and the ways in which the media shapes public perception. It gives you the power to determine how the narrative of war is presented in American media and addresses the moral quandaries inherent in generating news. </p>\n<p>In the game, the player takes on the role of an embedded photojournalist covering the U.S. involvement in the Vietnam War. Ride along with American soldiers as they carry out a mission, and use your camera to document what you see. You may witness soldiers performing acts of heroism, or refugees fleeing their homes. The images you capture portray sentiments ranging from pro- to anti-war, and are graded on their artistic composition. At the field office, choose how you interview soldiers to gather information about and attitudes toward the ongoing war. When it’s time to report back to your editor, choose which photos to submit for publication, and decide which narrative of the war you wish to depict.</p>\n<p>Will your article support the Vietnam War as a necessary and patriotic effort, or condemn it as a haphazard and cruel action? Where will your article be published - a prestigious newspaper or a local rag? The way you conduct your interviews, the subjects you choose to photograph, and the quality of your photos will determine the article you create. </p>\n\r\nKey Features\r\n<ul><li>Take photographs in the Vietnam War</li><li>Photo analysis that judges your images based on sentiment and composition</li><li>Interview soldiers, ask different questions, get different responses</li><li>9 different articles to unlock</li></ul>", "metacritic": null, "released": "2021-03-12", "tba": false, "updated": "2021-03-12T04:44:38", "background_image": "https://media.rawg.io/media/screenshots/457/45718cd9aaa6326f1c9442b0c7933e8f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 196, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Joe Wise"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}