{"id": 570205, "slug": "baseball-game-on-offline-fun", "name": "Baseball Game On: offline fun", "name_original": "Baseball Game On: offline fun", "description": "Welcome to a fun and super real world of baseball. Ours is the most realistic mobile baseball game with motion captured animations &amp; real 3D graphics. More than 50 animations allows you to play in all possible directions - swing the baseball bat and smash the ball into the wall or launch it into orbit. Play matches against all top baseball playing nations, beat them all and lift the world baseball championship cups.<br/><br/>Wish to know more why this is the best baseball game? Here is a list of features:<br/><br/>SUPER REALISTIC GRAPHICS<br/>Unbelievably real looking batter, pitcher and fielder 3D models. We have made an effort to deliver top notch graphics quality to your mobile devices. Play the game on a big screen tablet to see the mesmerizing graphics in full glory.<br/><br/>PLAY OFFLINE<br/>You can enjoy the entire game without being connected to the internet. However, with an active internet connection, you may progress faster by watching rewarded ads.<br/><br/>REALISTIC PHYSICS &amp; GAME-PLAY<br/>Our proprietary algorithm for bat-ball collision detection &amp; response allows us to achieve very realistic feel for all the hits. Realistic physics along with motion captured animations, makes you feel as if you are part of a real baseball game.<br/><br/>SUPER SLOW MOTION<br/>Watch your hits in mesmerizing super slow motion. See closeups of the ball hitting the bat. Capture and share screenshots of the batter in various photogenic poses.<br/><br/>SUPER REPLAYS<br/>Ours is the only Mobile Baseball Game that achieves flawless bat-ball contact. We are so confident about our collision detection technology that we now allow you to watch replays in extreme super slow motion (more than 1000 times slower). Choose from many camera angles and see closeups of the ball hitting the bat at extremely low replay speeds. Unbelievable? See for yourself!<br/><br/>TOURNAMENT / WORLD BASEBALL CHAMPIONSHIP / WORLD CUP<br/>Choose your home country from an exhaustive list of 30+ baseball playing nations. Doesn't matter whether you pick a top country like United States, Japan, Australia, South Korea or whether you pick an upcoming country like India, Pakistan, Bangladesh or Saudi Arabia, you still need to perform well to reach the top. Beat all countries to win the 1, 2, 3, 5, 7 and 9 innings baseball world championships (worldcups). More than 500 games to beat, are you up for it?<br/><br/>EASY &amp; ACCURATE BATTING &amp; BOWLING CONTROLS<br/>Intuitive controls. Play on your phone with ease with a single hand. Strike the ball with millisecond accuracy - see how good your hand-eye coordination is. The unique quantized home rect control allows you to quickly &amp; effortlessly pitch the baseball wherever you like.<br/><br/>PROGRESS BACKUP<br/>When you use Apple or Facebook login, your progress is periodically backed up on our server such that even you if change your device, your progress is not lost and can be restored.<br/><br/>LEADERBOARDS: COMPETE WITH FRIENDS AND OTHER PLAYERS WORLDWIDE<br/>See your friend's score, even if they are playing on a different platform. Share your stats with your friends or on your Facebook wall. Compare yourself with other players from your friends list or from your country or globally.<br/><br/>FREE TO PLAY<br/>Progress through the game without having to spend any real money.<br/><br/>This game can be played by all sports games lovers. If you like cricket, tennis, football or basketball, you will also like this baseball game.<br/><br/>DOWNLOAD NOW!", "metacritic": null, "released": "2020-11-02", "tba": false, "updated": "2021-03-12T04:07:15", "background_image": "https://media.rawg.io/media/screenshots/e37/e378eea64d1373832b1b9178127ab65b_J99fVfz.jpg", "website": "http://www.athanggames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 225, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Chandan Pawaskar"], "genres": ["Simulation", "Sports"], "publishers": ["Chandan Pawaskar"], "esrb_rating": "Everyone 10+"}