{"id": 570252, "slug": "infinite-arena", "name": "Infinite Arena", "name_original": "Infinite Arena", "description": "COME JOIN THE IDLE COMMUNITY!<br/><br/>Recruit unique heroes from 31 jobs, customize their appearance and equip them from thousands of items. Setup the perfect formation, then sit back and watch them battle automatically in real-time! Recruit. Conquer. Craft. Dominate!<br/><br/>“Very nice and chill idle game. Seems very f2p friendly.”<br/>            -ArteAlan<br/><br/>“Seriously! I can tell love went into this game as I’m actually enjoying a phone game for once”<br/>            -Legendryy<br/><br/>“...I love my little team.”<br/>\t     -Akai inu<br/><br/>Equip and customise your heroes, setup formations, then sit back and watch them battle automatically in real-time! Cast powerful spells to turn the tide of battle!<br/><br/>*FEATURES*<br/><br/>DISTINCT HEROES<br/>Each hero is distinct! A large pool of job types, traits and body parts ensures that each hero is unique! <br/>Work your way through job specific skill trees that unlock powerful skills for each hero! <br/>Reincarnate and Promote your heroes to surpass even the strongest of enemies!<br/><br/>LOADS OF EQUIPMENT<br/>Equip your heroes from a massive selection of items! Select items that suit the role of each hero to maximise their effectiveness! Match items of the same Affinity to gain powerful bonuses!<br/><br/>CRAFTING &amp; UPGRADE SYSTEM<br/>Collect components from battle to craft and upgrade items for your heroes! Efficiently craft while offline to maximise profit and fun!<br/><br/>AUTO-CONQUEST<br/>Setup your hero formation and set them loose to clear stages automagically - earning gold, equipment and items!<br/><br/>WORLDWIDE PVP<br/>Compete with commanders from all over the world! Progress through ranked leagues for ever increasing rewards!<br/><br/>OFFLINE LOOT VAULT<br/>Clear stages and defeat players while you are online to increase the amount of gold earned while offline!<br/><br/>Discord: https://discord.gg/cwdRNPG<br/>Twitter: https://twitter.com/GamesTancho<br/>Facebook: https://www.facebook.com/Infinite-Arena-114354406881715<br/><br/>Privacy Policy: https://www.tanchogames.com/privacy<br/>Terms of Service: https://www.tanchogames.com/terms-of-service", "metacritic": null, "released": "2020-03-31", "tba": false, "updated": "2021-03-12T04:30:25", "background_image": "https://media.rawg.io/media/screenshots/817/817b0ffdcb405b0083c44f2575c8ad09_Mca9hhN.jpg", "website": "https://www.tanchogames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 287, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["ACAT Consulting"], "genres": ["RPG", "Strategy"], "publishers": ["ACAT Consulting"], "esrb_rating": "Teen"}