{"id": 570226, "slug": "wig-master", "name": "Wig Master", "name_original": "Wig Master", "description": "Ready to wig out?<br/><br/>Create your own styles and take the fashion world by storm! You are a premier wig designer and it is up to you to help your sad and bald clients rediscover the meaning of style! From sophisticated business looks to the wildest party styles and colors, it is up to you to design the hair of your dreams! <br/><br/>Your poor customers have lost all their hair. Help them to achieve stylish new looks with a variety of dye’s, colors, and decorations. Curls with orange highlights? Done! Bangs with pink streaks? Easy! Give you clients a glowing new look and unlock more tools to upgrade your business. <br/><br/>With hair this good, you’ll wonder why everyone doesn’t wear a wig! <br/> <br/> Game Features:<br/>1.      Customize your style<br/>Use all the styling tools at your disposal to create new and unique wig fashions. Unlock more tools and techniques to create the wildest wig looks <br/><br/>2.       Beautiful Graphics<br/>Have fun watching the transformation happen. Smart tools and unique animation will keep you hooked<br/><br/>3.       Keep on upgrading!<br/>Make that shop your own. Keep customers happy and earn enough to transform the wig salon into a beautiful new place that is yours.<br/><br/>4.       Relax and enjoy<br/>No need to worry what people look like. Just tap, swipe and enjoy being a stylist.<br/><br/><br/><br/><br/>Visit https://lionstudios.cc/contact-us/ if have any feedback, need help on beating a level or have any awesome ideas you would like to see in the game!<br/><br/>From the Studio that brought you Mr. Bullet, Happy Glass, Ink Inc and Love Balls!<br/><br/>Follow us to get news and updates on our other Award Winning titles;<br/>https://lionstudios.cc/<br/>Facebook.com/LionStudios.cc<br/>Instagram.com/LionStudioscc<br/>Twitter.com/LionStudiosCC<br/>Youtube.com/c/LionStudiosCC", "metacritic": null, "released": "2020-08-20", "tba": false, "updated": "2021-03-12T04:17:19", "background_image": "https://media.rawg.io/media/screenshots/29b/29b6eac65ba1f137fe2937f990336ffe.jpg", "website": "https://lionstudios.cc", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 104, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Lion Studios"], "genres": ["Simulation", "Casual"], "publishers": ["Lion Studios"], "esrb_rating": "Teen"}