{"id": 570336, "slug": "nihhus", "name": "Nihhus", "name_original": "Nihhus", "description": "<p>You descend from the stars straight into the pacific ocean to commence your new journey. An intergalactic icon forced to go back to his roots. Aquarius. Your time in space was merely the warm up for what is to come. Powers faded as fast as they were gained. The only way to regain it is to harvest souls of ancient creatures in the very place you spawned. Aeons ago...<br/></p>\r\nDive into the Depths of the Ocean\r\n<p>Nihhus is a singleplayer action game taking place in an underwater world. You are equipped with your magic chalice that can harvest fish souls. Level up by clearing the rabble until you are strong enough to harvest the Ancient Squid Soul.</p>\r\n🐠 Jellyfish and Squids\r\n<p>You are surrounded by jellyfish. Lots of jellyfish. Roam around the world with <strong>WASD (movement) </strong>and<strong> J (dash)</strong>. Dashing is the only ability in this game. You reach out your chalice and collect every soul passing through it.<br/></p>\n<p>Dashing, however, is also useful for dodging. You become invincible for a short amount of time.<br/></p>\r\n🏆 Battle of the Ancients\r\n<p>Once the game starts it's you vs. the Ancient Squid. The squid lives at the bottom of the level and constantly casts attacks your way. Ultimately you want to harvest its soul. Be patient though. The color of the squid indicates its current threat level. Once it turns green you are good to go.</p>\r\n🙏 Meet your Maker\r\n<p>Artwork, Programming and Gamedesign by Samuel Femb<strong>ö</strong>ck.<br/></p>", "metacritic": null, "released": "2021-03-11", "tba": false, "updated": "2021-03-12T04:57:08", "background_image": "https://media.rawg.io/media/screenshots/38b/38b388b8233ff3fcf795c12f11727bac.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 26, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["samYemmY"], "genres": ["Action"], "publishers": [], "esrb_rating": null}