{"id": 570402, "slug": "questysh-the-quest-of-young-sheriff", "name": "QuestYsh: The Quest of Young Sheriff", "name_original": "QuestYsh: The Quest of Young Sheriff", "description": "<p>QuestYsh: The Quest of Young Sheriff is a 15 minute homage to the original Legend of Zelda on the NES! You play as the Young Sheriff, who has to save his town from the invasion of strange monsters! I guess... </p>\n<p>NO SOUND, sorry, just didn't have the time or motivation tbh </p>\n<p>Controls</p>\n<ul><li>W, A, S, D for Moving around</li><li>K for Using an Item, Interacting with NPCs and Chests and whatnot.</li><li>I for Inventory</li></ul>\n<p>QuestYsh is Game III in a series of short minigames I'll be releasing throughout the year. Each game will pay homage to a different era in video game history. QuestYsh was clearly inspired by The Legend of Zelda on the NES, down to the tight movement, the jerky enemies and the dungeon design :) <br/></p>\n<p> Game III - [late 1980s]\r\n</p>\n<p>Total Dev Time: 8 days.</p><p>TIPS, NOTES</p><p>-&gt; If your weapon doesn't  seem to hurt an enemy, try a different weapon</p><p>-&gt; Not polished, inventory button's a little twitchy.</p><p>-&gt; Stuck? If you're literally stuck, I messed something up, (not polished), if you just don't know where to go, ask :)</p><p>-&gt; Not polished<br/><br/>If you're a publisher (yeah right), give me money, I'll give you QuestYsh 2 </p><p>if you make game music, send me a Twitter DM, I might hire you for this game's soundtrack :) </p>", "metacritic": null, "released": "2021-03-11", "tba": false, "updated": "2021-03-12T05:15:18", "background_image": "https://media.rawg.io/media/screenshots/098/098cb03ac0bdfadb645eca8c9b47fdbf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 58, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Astronaut Curve"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}