{"id": 570421, "slug": "slayers-inc", "name": "Slayers, Inc.", "name_original": "Slayers, Inc.", "description": "Slayers, Inc. is a roguelite bullet hell twin-stick shooter. Someone downstairs has gotten impatient, and they've sent an army of demons to invade the mortal realm! The only thing standing in the way of a fire-and-brimstone apocalypse is Slayers, Inc., a group of seasoned demon hunters who are ready and willing to not only stop the invasion, but destroy it at the source.<h3>Key Features</h3><ul><li><strong>Artifacts:</strong> Pick up Artifacts to customize your attacks and open new avenues of pain on your foes. With 512 possible combinations, there's no shortage of destruction, from rapid-fire, explosive poison bullets to flaming homing turrets.<br/><br/></li><li><strong>Items:</strong> Augment your Slayer with 89 different, stackable items to keep up with the competition.<br/><br/></li><li><strong>The Crew:</strong> Choose from one of eight different Slayers, each with their own playstyle and unique quirks.<br/><br/></li><li><strong>Liquid Manipulation:</strong> Crack open barrels of liquid that react to your items. Spawn colonies of slowing fungus in poison and water, electrify water and blood, and light oil on fire to give yourself some breathing room.<br/><br/></li><li><strong>Combo System:</strong> Keep the pain train going, and watch your Combo rise. Higher Combo Ranks give you rewards, but can also lead to higher risks...<br/><br/></li><li><strong>Scaling Difficulty:</strong> As time goes on, enemies will become tougher, more numerous, and may even become empowered Elites. Strike a balance between haste and gathering.<br/></li></ul>", "metacritic": null, "released": "2021-03-11", "tba": false, "updated": "2021-09-27T02:31:41", "background_image": "https://media.rawg.io/media/screenshots/3b0/3b0181698e8a5447f0618a9601ff7388.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 36, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["woogedygames", "Woogedy Games"], "genres": ["Action", "Shooter", "RPG", "Indie"], "publishers": ["Woogedy Games"], "esrb_rating": null}