{"id": 570594, "slug": "door-forest", "name": "Door Forest", "name_original": "Door Forest", "description": "<p>An important feature of my 3D chunk system is the ability of chunks to connect to neighboring chunks via doors, roads, catwalks, etc. Each chunk generates positions for these \"doors\" for each of its sides, optionally including the top or bottom, but the door positions themselves are pseudorandom. Neighboring chunks end up sampling the same starting position and thus generating the same door positions for their shared face, allowing the doors to properly align despite apparently random positions.</p>\n<p>More details on this chunk system are available on my blog at problemecium.blogspot.com along with entries about my other projects.<br/></p>\n<p>In this experiment, rather than actual doors, the system simply spawns some prefabricated trees I pulled out of some of the Unity demo projects for the horizontal faces and some simple clouds for the vertical faces. A heavy focus on performance optimization means that a huge quantity of these can be instantiated and managed at once, allowing for complex structures to be possible in the future.</p>\n<p>Left mouse and drag to aim the first-person camera.<br/>WASD to move, Space to jump, and left Shift to run.<br/>At top left is a mini-map showing the nearby tree and cloud positions.<br/>The game starts atop a small platform; jump down to the ground to start exploring!<br/>If you like you can also left and right mouse together and drag vertically to zoom between a first-person and third-person view.<br/></p>", "metacritic": null, "released": "2021-03-11", "tba": false, "updated": "2021-03-12T06:03:44", "background_image": "https://media.rawg.io/media/screenshots/215/215c13d9b72a75128ad05d94ca56d674.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 28, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["problemecium"], "genres": [], "publishers": [], "esrb_rating": null}