{"id": 570695, "slug": "bubbaruka", "name": "Bubbaruka!", "name_original": "Bubbaruka!", "description": "<strong>From: John</strong><br/><strong>Subject: Bubbaruka</strong><br/><br/>Hey, it's been a little bit!<br/><br/>I know it's a bit strange for me to Email you out of the blue, but I thought you'd be interested in this. You remember that old toy? The one that was supposed to be like a pet in your keychain? The one that never got released?<br/><br/>Well I found it.<br/><br/>I was just cruising around eBay, and I found a super cheap laptop for sale. The owner acted real weird, refused to take phone calls, only let me talk to him via Email. But you know, cheap product cheap service.<br/><br/>Turns out the laptop had something in it already, a folder called Bubbaruka. <br/><br/>The name jogged so many memories, I remember begging my mom to get me one for Christmas. Never knew why they didn't release them. They would've made tons.<br/><br/>But It's here! Seems fully functioning, just like the commercials! I didn't start much, I rushed to Email you first. I know you're into lost media, missing games, that sort of thing. This is right up your alley, right? Still, It's a bit buggy. It definitely seems unfinished, and some of the features straight up don't seem to work, but it's a fun nostalgia trip.<br/><br/>Welp, I'm gonna go play the game for like, 30 minutes before I get bored and forget it exists. Talk to you later!<br/><br/><strong>Attached: Bubbaruka.zip</strong><br/><br/><br/><br/><br/>The toy of the modern age! Endless fun for all ages! Pick an egg, and you now have your very own Bubby! Feed it, play with it, and watch it grow! The possibilities with your Bubby are endless! <br/><br/>But be careful, sometimes, things might be lurking in the shadows. Don't stray too far from the path. Don't be an explorer. Don't be a hero. <br/><br/>There's a reason the game was never released. A reason the world isn't ready for. Don't look into it. Don't follow the whispers. <br/><br/>Don't peel back the curtain. <br/>Don't go through the cracks in the surface. <br/>Don't touch them. <br/>Don't follow them. <br/>Don't let them catch you. <br/><br/>Take heed of these warnings <br/><br/><strong>Or suffer the consequences.</strong><br/><br/><h3>Features</h3><ul><li>2D Retro Graphics<br/></li><li>Cast of cute playable characters<br/></li><li>Two endings + Plenty of secrets to uncover<br/></li><li>Intense first person horror segments <br/></li><li>Ghoulish creatures stalking your every turn<br/></li><li>A hidden story that beckons you deeper into the game</li></ul>", "metacritic": null, "released": "2021-03-10", "tba": false, "updated": "2021-06-21T02:13:51", "background_image": "https://media.rawg.io/media/screenshots/205/205c8a84b9e72d51ffdde0d863fe347c.jpg", "website": "https://super-nova-studios.itch.io/bubbaruka", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 87, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Super Nova Studios", "Benjamin Schade"], "genres": ["Adventure", "Indie", "Puzzle"], "publishers": ["Benjamin Schade"], "esrb_rating": null}