{"id": 570757, "slug": "evolution-10-by-marco-spedaletti", "name": "Evolution 10 by Marco Spedaletti", "name_original": "Evolution 10 by Marco Spedaletti", "description": "INSTRUCTIONS\r\nHOW TO LOAD THE GAME\r\n<p>In order to play \"Evolution 10\" you need a COMMODORE 64 or an emulator of this computer, because the game does not work on modern computers. The game has been tried and it works correctly with <em>\"VICE - the Versatile Commodore Emulator\" ver. 3.5</em>. You can download it for free by clicking here.\r\n  </p>\n<p>Once the emulator software has been installed, follow the instructions below:\r\n  </p>\n<ul><li>start x64sc.exe program;\r\n  </li><li>click on File &gt; Attach disk image &gt; Drive 8;\r\n  </li><li>select evolution10.d64 file (click here to download);\r\n  </li><li>click on Attach;\r\n  </li><li>type LOAD \"EVOLUTION10\",8,1;\r\n  </li><li>when finished loading, type RUN\r\n  </li></ul>\r\nHOW TO PLAY\r\n<p>The game is turn-based. At the beginning of each round it is shown which individual (phenotype) is to be obtained from the genetic combination, and the available individuals are shown:\r\n  </p>\n<p>\n</p>\n<p>The player must indicate the pair of individuals that they want to \"mix\" to obtain two more. The player must choose two (different) numbers in the 1..4 interval. The player's choice should be such as to reward those individuals who individually, or combined, most closely resemble the target individual. The program therefore performs both genetic blending and phenotypic regeneration. For a more extensive explanation we recommend to read this article.\r\n  </p>\n<p>\n</p>\n<p>The game repeats itself from generation to generation, until the player gets the wanted individual.\r\n  </p>\n<p>The greater the number of generations, the worse the result the player has achieved.\r\n</p>\n\r\nSOURCE CODE (EXPLAINED)\r\n<p>Below you will find the source code of the video game. The source code has been written extensively (without abbreviations), in order to make it easier to understand. Each line has been commented to illustrate how the code works.\r\n  </p>\r\nINITIALIZATION (LINE 1)\r\n<p>0 x=53280:pokex,0:pokex+1,0\r\n  </p>\n<p>Now we set the background and border color of the screen (here for a complete map). The best is to use the black color (0) for both. This is \"classic\" color of my games.\r\n  </p>\n<p>x=rnd(-TI*peek(x-14))\r\n  </p>\n<p>We carry out a first and deep initialization of the random number generator. This form of initialization is necessary because the game relies heavily on a random component and, in the absence of this formulation, the game is likely to be repetitive with the use of emulators. So, in addition to using the internal clock (TI) we will also use the least significant byte of the electron beam position.\r\n  </p>\n<p>print\"{clear}{down}{down}{down}{down}{red}e{green}v{yellow}o{blue}l{red}u{green}t{yellow}i{blue}o{red}n {white}10\";\r\n  </p>\n<p>We print the game title.\r\n  </p>\n<p>e=5\r\n  </p>\n<p>We use this variable to maintain the number of individuals present for each generation. Individuals are made up of the four presented to the player, and which vary, plus a fifth representing the goal to be achieved.\r\n  </p>\n<p>g=5\r\n  </p>\n<p>Instead, this variable contains the number of genes that make up the genome of each individual. Each gene encodes a different aspect, and it takes 5 to draw an individual.\r\n  </p>\n<p>n$=\"1234t\"\r\n  </p>\n<p>This variable contains the title (label) of each individual. We use this technique instead of printing a number as in BASIC V2 it is not possible to print a number without having it followed by a space, which is not aesthetically acceptable.\r\n  </p>\n<p>h$=\"{red}{green}{yellow}{blue}\"\r\n  </p>\n<p>This is the set of colors encoded by gene 1.\r\n  </p>\n<p>t$=\"{171}{166}{113}#\"\r\n  </p>\n<p>This is the set of tails encoded by gene 5.\r\n  </p>\n<p>b$=\"{99}{219}{178}{177}\"\r\n  </p>\n<p>This is the set of intermediate elements of the body, including those encoded by genes 3 and 4.\r\n  </p>\n<p>1 print\r\n  </p>\n<p>We print an empty line (<em>empty lines are interleaved with the logic for a matter of occupation and respect for the length of the BASIC lines</em>).\r\n  </p>\n<p>rk=1\r\n  </p>\n<p>We initialize the number of the gene that will undergo a random mutation. This gene is reset at each turn.\r\n  </p>\n<p>dimc(e,g)\r\n  </p>\n<p>This array contains the genes of all existing individuals.\r\n  </p>\n<p>dimd(e,g)\r\n  </p>\n<p>This is an auxiliary array, which contains a copy of the genes that will take the place of those contained in the previous array when the transition to a new generation is complete.\r\n  </p>\n<p>for i=1 to e:for j=1 to g:c(i,j)=1+int(rnd(1)*3):nextj:nexti\r\n  </p>\n<p>This routine initializes the gene of all individuals to a random value.\r\n  </p>\n<p>print\"{white}choose phenotypes!\"\r\n  </p>\n<p>We print the game's pay off.\r\n  </p>\n<p>print:print:\r\n  </p>\n<p>We print empty lines (<em>empty lines are interleaved with the logic for a matter of occupation and respect for the length of the BASIC lines</em>).\r\n  </p>\n<p>i=e:gosub9:ff$=f$\r\n  </p>\n<p>In order to pre-calculate the target phenotype (the fifth), we render its genotype as a string by calling the function on line 9 and put the result into the ff$ variable.\r\n  </p>\n<p>x=1\r\n  </p>\n<p>This variable contains the number of the generation reached.\r\n  </p>\r\nGAME LOOP (LINE 2-7)\r\nPHENOTYPES PRESENT (LINE 2)\r\n<p>2 print \"{white}target: \";ff$;\r\n  </p>\n<p>We give the player an indication of which phenotype we want to achieve.\r\n  </p>\n<p>print:print\r\n  </p>\n<p>We print empty lines (<em>empty lines are interleaved with the logic for a matter of occupation and respect for the length of the BASIC lines</em>).\r\n  </p>\n<p>print \"{white}generation \";x;\":\"\r\n  </p>\n<p>We give the player indications of which generation we are showing.\r\n  </p>\n<p>for i=1 to e-1: gosub9 : print\"{white}\";mid$(n$,i,1);\"]\";f$;\" \";:nexti:\r\n  </p>\n<p>We do a loop for each individual (minus the last one, which is the goal). For each one we call the function to render the genotype and print it on the screen, with an identification number.\r\n  </p>\n<p>print\r\n  </p>\n<p>We print empty line (<em>empty lines are interleaved with the logic for a matter of occupation and respect for the length of the BASIC lines</em>).\r\n  </p>\n<p>print\"{white}choose (1-4 1-4):\";\r\n  </p>\n<p>Now let's give the player the option to indicate the two individuals that will be combined, to produce the next generation.\r\n  </p>\r\nASK FOR INDIVIDUALS TO MIX (LINE 3)\r\n<p>3 r=rnd(1): rm=rnd(1)\r\n  </p>\n<p>We pre-calculate two random values, which will be used later.\r\n  </p>\n<p>gosub 8: x$=k$\r\n  </p>\n<p>We call the subroutine that waits for the pressing of a key from 1 to 4 (on line 8) and we retrieve the key pressed, assigning it to the variable x$.\r\n  </p>\n<p>print \"{white} + \";\r\n  </p>\n<p>We print the plus symbol to indicate that the first indicated individual will be added to the second that will be typed.\r\n  </p>\n<p>gosub 8: y$=k$\r\n  </p>\n<p>We call the subroutine that waits for the pressing of a key from 1 to 4 (on line 8) and we retrieve the key pressed, assigning it to the variable y$.\r\n  </p>\n<p>print:print:\r\n  </p>\n<p>We print empty lines (<em>empty lines are interleaved with the logic for a matter of occupation and respect for the length of the BASIC lines</em>).\r\n  </p>\n<p>on -(x$&lt;&gt;y$) goto 4: print\"{red}you have to choose different phenotypes!{white}\": goto 3\r\n  </p>\n<p>If the player has indicated two equal numbers, then it is a mistake because it is not possible to combine an individual with himself. So we report it with an error message and go back to waiting for a key to be pressed.\r\n  </p>\r\nFEEDBACK ON INDIVIDUALS MIXED (LINE 4)\r\n<p>4 print\r\n  </p>\n<p>We print empty line (<em>empty lines are interleaved with the logic for a matter of occupation and respect for the length of the BASIC lines</em>).\r\n  </p>\n<p>i=val(x$): gosub 9: print \"{white}\";mid$(n$,i,1);\"]\";f$;\r\n  </p>\n<p>Now we call the function to render the genotype and print it on the screen, as the first individual to mix.\r\n  </p>\n<p>print\"{white} + \";\r\n  </p>\n<p>We print the plus symbol to indicate that the first individual will be added to the second.\r\n  </p>\n<p>i=val(y$):gosub9:print\"{white}\";mid$(n$,i,1);\"]\";f$\r\n  </p>\n<p>Now we call the function to render the genotype and print it on the screen, as the second individual to mix.\r\n  </p>\n<p>print\r\n  </p>\n<p>We print empty line (<em>empty lines are interleaved with the logic for a matter of occupation and respect for the length of the BASIC lines</em>).\r\n  </p>\r\nPRODUCE NEXT GENERATION (LINES 4-6)\r\n<p>for i=1 to g:d(1,i)=c(val(x$),i)\r\n  </p>\n<p>5 d(2,i)=c(val(y$),i) : next i\r\n  </p>\n<p>With this loop we copy the genotype of the two selected individuals as the first two (progenitors) of the others that will be generated.\r\n  </p>\n<p>for i=3 to e-1: for j=1 to g: d(i,j)=d(1-(rnd(1)&gt;.5),j) : next j : next i\r\n  </p>\n<p>All children will randomly take one of the genes from the first or second parent.\r\n  </p>\n<p>on -(r&gt;.8) goto 6: d(3-(rm&gt;.5),rk) = 1 + int(rnd(1)*3)\r\n  </p>\n<p>Sometimes, quite by chance, one of the genes of one of the children will undergo a mutation, which will cause it to be different from both the first and the second parent.\r\n  </p>\n<p>6 rk=int(rnd(1)*4)\r\n  </p>\n<p>We reload the number of the gene that will eventually undergo the random modification.\r\n  </p>\n<p>for i=1 to e-1: for j=1 to g: c(i,j)=d(i,j) : next j : gosub 9 : on-(f$=ff$) goto 7: next i\r\n  </p>\n<p>We copy the genes stored in the supporting array into the main one, in order to give rise to the new generation of individuals. In doing this, we will generate the phenotype for each and compare it with the target one. If there is an identity, the game will end and the player will be taken to line 7.\r\n  </p>\n<p>x = x + 1 : goto 2\r\n  </p>\n<p>Let's move on to the next generation, and go back to line 2.\r\n  </p>\r\nTHE PLAYER WINS! (LINE 7)\r\n<p>7 print \"{white}you win in \";x;\"generations with: \";: gosub 9 : print f$;\"{white}\" : end\r\n  </p>\n<p>In the event that the player has managed, after a certain number of generations, to obtain the requested specimen, a message will be shown on the screen showing the result and the number of generations produced.\r\n  </p>\r\nSUBROUTINES (LINES 8-9)\r\nKEYBOARD INPUT ROUTINE (LINE 8)\r\n<p>8 k$=\"\" : get k$ : on -(k$=\"\" or val(k$)&lt;1 or val(k$)&gt;4 ) goto 8: print \"{white}\";k$; : return\r\n  </p>\n<p>This routine takes care of keeping the player pressing one of the keys. The expected keys range from 1 to 4 inclusive and indicate which of the individuals will be selected for the next generation.\r\n  </p>\r\nGENOTYPE TO PHENOTYPE CONVERSION (LINE 9)\r\n<p>9 f$=mid$(h$,c(i,1),1) : for j=1 to c(i,2): f$=f$+mid$(b$,c(i,3),1) : next j : f$=f$+mid$(b$,c(i,4),1)+mid$(t$,c(i,5),1) : return\r\n  </p>\n<p>This routine deals with converting each individual's genotype into a phenotype. This conversion is not straightforward because the genotype contains only a \"recipe\" of how the individual should look, ie how it should be rendered on screen. This routine is responsible for converting the genotype (a set of numbers) into a phenotype (a string). For a details information please refer to the EVOLUTION 10'S GENOTYPE AND PHENOTYPE article on author's retroprogramming website.\r\n  </p>\n<p> \r\n</p>", "metacritic": null, "released": "2021-03-10", "tba": false, "updated": "2021-03-12T06:40:56", "background_image": "https://media.rawg.io/media/screenshots/33b/33b50419273885665e4da14ce7b71fd6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 17, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BASIC 10Liner"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}