{"id": 570785, "slug": "tug-itch-bubblenuts13", "name": "Tug (itch) (Bubblenuts13)", "name_original": "Tug (itch) (Bubblenuts13)", "description": "<p>Tug is a party game designed for 5 players. It's demo was created by Jacob Nowak for his Time To Make a Game Final project at the Academy of Interactive Entertainment. The requirements for the project were to submit a game based on a specific IP devised with a group. The IP in which Tug comes from is about a prison in which all prisoners are tied together by a single rope. This is done to prevent escape and the forming of large scale gangs. Within Tug, players will act as a member of the Stuffed Mafia. One player however is not a member but an imposter. The gang leader learns of this and orders the five stuffies to answer a series of \"Would You Rather\" questions to prove their loyalty. Instead of speaking, the gang members must pull their rope in the direction they choose, the idea being that the imposter will be the only one to answer incorrectly and be ratted out. Things turn violent quickly however as the gang members are incited into ripping each other in half. Players must prove their innocence and actions, knowing that their personal preference may be what tears their buddy in half.</p>\n<p>Music By</p>\n<p>Stasis Chamber by Apoxode (c) copyright 2021 Licensed under a Creative Commons Attribution Noncommercial  (3.0) license. http://dig.ccmixter.org/files/Apoxode/63087 Ft: BeatMachine, Martijn de Boer, spinningmerkaba<br/></p>", "metacritic": null, "released": "2021-03-10", "tba": false, "updated": "2021-03-12T06:48:24", "background_image": "https://media.rawg.io/media/screenshots/009/009f3a0b7f8a9a5d389024cde5bb1235.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 9, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Bubblenuts13"], "genres": [], "publishers": [], "esrb_rating": null}