{"id": 570841, "slug": "it201_sprint02_logan_reyes", "name": "IT201_Sprint02_Logan_Reyes", "name_original": "IT201_Sprint02_Logan_Reyes", "description": "<p>Based on user mouse input, my tool is able to draw different shapes and colors on the screen while also displaying the updated mouse position. When the user right mouse clicks, either a sphere, cube, or cylinder depending on the selection will be drawn onto the screen for 3 seconds until it is removed. The user has the option to select a sphere, cube, or cylinder and also select from the colors red, green, or blue.\r\n</p>\n<p><em>New Features:\r\n</em>\n</p>\n<p><strong>1. Background Color </strong>- Users can interact with the Background Color <em><strong>dropdown </strong></em>by left clicking their preferred background color selection, with the options being yellow, cyan, and gray. The background color of the screen will be adjusted accordingly.\r\n</p>\n<p><strong>2. Display Prefab in Random Locations</strong> - Users can interact with the Display People in Random Places <em><strong>checkbox </strong></em>which will spawn a “person” prefab in a random location on the screen. When the checkbox is checked by left clicking, the prefab will be instantiated at a random location using Unity’s <strong><em>Random Math</em></strong> Function. When the checkbox is unchecked by left clicking, the instantiated prefab will be removed from the screen. <br/></p><p><strong>3. Clear All Shapes</strong> - Users can interact with the Clear All Shapes <strong><em>button </em></strong>by left clicking it, which will immediately destroy any remaining spheres, cubes, or cylinders on\r\nthe screen. \r\n</p>\n<p><strong>4. Shape Size</strong> - Users can interact with the Shape Size <strong><em>slider </em></strong>by left clicking and dragging the slider handle to the left and right. If the handle is dragged towards the left,\r\nthe size of spheres, cubes, and cylinders will become smaller if drawn. If the handle is\r\ndragged towards the right, the size of spheres, cubes, and cylinders will become larger if\r\ndrawn.\r\n</p>\n<p><strong>5. Real Date and Time</strong> - The real-life date and <strong><em>time </em></strong>are displayed centered and at the top of the screen. The user can see that the seconds, minutes, hours, and date automatically update as needed. There is no direct user interaction with this text field besides being able to view the current date and time.\r\n</p>", "metacritic": null, "released": "2021-03-10", "tba": false, "updated": "2021-03-12T07:04:20", "background_image": "https://media.rawg.io/media/screenshots/22e/22e0b72eb85cc5d2ab2b907b51efb0ea.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 11, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["ler25"], "genres": [], "publishers": [], "esrb_rating": null}