{"id": 571216, "slug": "the-world-above-us", "name": "The World Above Us", "name_original": "The World Above Us", "description": "<p><strong>THIS GAME IS A COMPLETE EXPERIMENT...! </strong></p>\r\nTHIS GAME IS RANDOM OR IS IT...?!\r\n<p><strong>The World Above Us </strong>is an Authentic Action FPS  Game with random things added to the game as a challenge. \r\n</p>\n<p><strong>“The World Above Us” is an experiment Project and one my first try in Game Development World, this game was actually made 3-4 years ago for my school's creative fest competition as a serious project of course! Of course we were not making fun of Indian Game Developers that we can make any type of game and still win the Competition, of course not! We are 100% serious every time , btw later on I don't know how this game got selected but it also wins the Competition, So everything is true.</strong></p>\n<p><strong>Thank you NHS, very Cool.</strong></p>\n<p><strong>----------------------------------------------------------------------------x</strong>\n</p>\r\nTHE CONCEPT...? \r\n\r\n<p>Bruh Really you think this game will have a concept, this is just a game with added random things totally not as a joke in it and still you are reading this section, bruh you are joking with me right now right? Well leave the funny aside this game have literally no concept as this was my first try in Game Development World, but I can say for sure that I like it. </p>\n<p><strong>Of course the above part was joke. I am joking, actually this game has the most epic concept ever, if you don't believe me read the Features Below! </strong></p>\n<p><strong>----------------------------------------------------------------------------x</strong>\n</p>\r\nFEATURES..? \r\n<p><strong>🔸 3D Characters, Small World: A mix of one basic main character with no body only capsule as it is a FPS so who cares about the body modelling, also utilizing masterful 3D animation with almost zero world-building.</strong>\n</p>\n<p><strong>🔸 Don't Cringe at the Buildings: Those buildings are actually taken from the real world environment, and created with vast details like Elon Musk created Cyber truck or Sony created design of PS5. You will love it actually, but don't cringe at it though. </strong></p>\n<p><strong>🔸 World's Best Cutscene Ever: This game is so vast that the cutscene almost looks realistic , almost looks like you are not playing the game but you are in the game, realistic and sync cutscene animation with almost 0 frame movements, running in 166p 1 FPS (actually not).  You will surely get the same experience of an anime when the company fired all the animations, it is so relatable.</strong></p>\n<p><strong>🔸 Missions? Objective? What are those?: This Game provides most original objective or you can say most realistic objective, you see a forest in a dream and when you wake up you were on a room, then you tried to go outside the room and suddenly you transported to a place, where there are auto machine guns placed on the different part of the city. I know what are you thinking right now, how we find the best plot of a game ever, well don't worry it will get better than that just play the game already, dammit don't read this shit.</strong></p>\n<p><strong>🔸 Awesome FPS Experience: Well, what I can say here, let me think! Hmmm... Uhhh.. The Most... hmm.. actually leave it just try it by yourself.  Btw Look the Height of the Main Player Damn!</strong></p>\n<p><strong>🔸Amazing Enemies Design: Those design of enemies Ohh My Gahh!! I think you never seen anywhere, mark my words. Those Enemies/AIs are so Intelligent they can almost find you even if you and the enemy have a giant wall between them, they are the future bro! Of course they are not OP or anything, and of course you can't ignore them by using speed up powerup. Wait This Game has powerups wow super realistic, yeah yeah I know you are thinking that right now, same here bro. </strong></p>\n<p><strong>🔸 Rich and Expansive Content, Original Content: Explore the smallest Uhh sorry my bad the largest land and discover new worlds through more than 0 story-driven missions. Epic right? Uncover the non existing compelling story arcs and legendary sagas of survivors and warriors. The plot is thinning as their fates are intertwined! Be The warrior in this Epic Experience. Btw Of course we didn't add random assets in this project of course we made it ourselves right? of course why we will almost 100% random things in a project which don't fit with each other and make it work it somehow as our first try. Bro we are not asset flipper, we have TALENT! Got it?</strong></p>\n<p><strong>🔸Will you rise to the challenge and go down in Grand Universe of this 1 minute total gameplay Game's history as a legend? Join forces on your most epic journey yet ever, if you not trust me play it yourself!</strong>\n</p>\n<p><strong>🔸The Game is Cancelled now, I am very sad :( that I am not able to continue this World's Best Game Ever, but I have to work on something else now. (btw checkout my new project which We ( me and the bois) working on. It is called Mao no Shinko)  </strong></p>\n<p><strong>----------------------------------------------------------------------------x</strong>\n</p>\r\nDISCLAIMER..?\r\n<p><strong>This whole game was me experimenting on my random part of my brain. Nothing else here keep scrolling and enjoy playing the game :)</strong></p>\n<p><strong>----------------------------------------------------------------------------x</strong></p>", "metacritic": null, "released": "2021-03-09", "tba": false, "updated": "2021-03-12T08:34:38", "background_image": "https://media.rawg.io/media/screenshots/250/250bcfd11dfe265d7f18bc1c14901d9f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 142, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Adnan Yousuf", "Tuba Saleem", "Sadia Hussain"], "genres": ["Action", "Shooter", "Adventure"], "publishers": [], "esrb_rating": null}