{"id": 571693, "slug": "grapple-tournament", "name": "Grapple Tournament", "name_original": "Grapple Tournament", "description": "<p>Grapple Tournament is a VR Arcade Shooter for adrenaline-packed vertical combat. Enjoy 3D movement freedom with your grappling hook and dual wield multifunctional weapons.</p>\n<p>VIRTUAL REALITY ARCADE SHOOTER<br />\nBuilt from the ground up for virtual reality, Grapple Tournament is a thrilling VR arcade shooter where you can enjoy movement freedom using your 3D maneuver abilities and your grappling hook while fighting with a wide variety of multifunctional weapons (even dual wielding) in various multiplayer game modes and co-op challenges through an alluring stylized world.</p>\n<p>Grapple. Shoot. Score. Master the vertical combat.</p>\n<p>3D MOVEMENT FREEDOM<br />\nRun, jump and double jump to get yourself into position, wall jump to evade incoming harm, pull yourself up with the grappling hook to get the high ground or grapple-swing around corners to surprise your enemies. Learn how to chain these abilities with your 3D maneuvering gear to perform untraceable movement combos and outsmart your enemies like never before in a VR game! Maps are specifically designed with vertically in mind to get the most out of it.</p>\n<p>MULTIFUNCTIONAL WEAPONS<br />\nMore than 12 weapons eagerly await to get into battle under your command. From the common mechanical guns through the plasma pistols to the energy rifles, single-fire or automatic, instant shot or projectile based, you can have everything.<br />\nTarget-following laser? Shotguns and grenade launchers? You got them. Rockets? Let them rain! Your VR dream is to become a turret with massive firepower? Go with dual miniguns! Double handed weapons have both primary and secondary fire modes letting you choose the perfect reaction for any situation. By the way you always have your melee weapon - the energy blade - on your side. You know, for slicing cake.</p>\n<p>Play the game any way you like, use the grappling hook with a weapon or dual wield any weapon combination. Mobility versus firepower. Your call.</p>\n<p>Did we mention that you can also summon an energy bow and shoot an arrow any time?</p>", "metacritic": null, "released": "2020-11-05", "tba": false, "updated": "2023-11-06T12:24:45", "background_image": "https://media.rawg.io/media/screenshots/af5/af5f68d610fd1fe1e68b9b269a6c4ecb.jpg", "website": "https://www.grappletournament.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 46, "dropped": 1}, "playtime": 2, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 249, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Tomorrow", "Tomorrow Games"], "genres": ["Action", "Shooter", "Casual", "Indie"], "publishers": ["Tomorrow", "Tomorrow Games"], "esrb_rating": null}