{"id": 571696, "slug": "9-years-of-shadows", "name": "9 Years of Shadows", "name_original": "9 Years of Shadows", "description": "<p>9 Years of Shadows is an emotionally-driven metroidvania enhanced by healing music that tells the story of Europa, a young woman of noble birth tasked with ending the curse that plagues her people and restoring color to all lands.</p>\n<p>Immersive gameplay<br />\nShape your way into this dark 2D side-scrolling single-player adventure as you explore a timeworn mechanical giant; battle hidden bosses with an intuitive combat system, scavenge collectibles, gain power ups and discover some classic metroidvania easter-eggs. Combine Europa’s melee prowess with Apino’s ranged spirit magic as both cleanse the corrupted world around them.</p>\n<p>Compelling story<br />\nTake the role of Europa and brave the empty halls of Talos Castle as you uncover the disturbing truth of its inhabitants’ fate. A moving coming-of-age tale that stresses the importance of embracing our feelings in order to heal. Embark on a journey of friendship, where Europa and her loyal companion Apino learn to rely on each other to overcome any obstacle and help others as well.</p>\n<p>Elemental armor<br />\nHarness the wrath of nature and access both special abilities and restricted areas as you bend fire, water and earth to your will. Equip either the Helios, Gaia or Poseidon armor and experience a fresh take on how to explore a vast world and face unwavering foes in the battlefield.</p>\n<p>Restoration through healing music​<br />\nExperience a game unlike any other, with an entrancing and soothing soundtrack tuned to 432Hz composed by ​Michiru Yamane (Castlevania), Manami Matsumae (Mega Man), and ​Norihiko Hibino ​(Metal Gear Solid).</p>\n<p>Stunning pixel art​<br />\nDynamic lighting and colorful characters create a vivid setting awaiting a hero to explore it. The attention to detail in every hand-crafted scenery is a welcoming sight for metroidvania enthusiasts and newcomers alike.</p>\n<p>Lore-infused universe<br />\nWhat remains of the giant mechanical castle left as a shelter by an ancient ruler is preserved in peculiar paintings, gateways to other worlds that speak the echoes of the past. Meet enigmatic artists and travel through their depictions of eerie atmospheres.</p>", "metacritic": 74, "released": "2023-03-26", "tba": false, "updated": "2024-02-20T01:55:00", "background_image": "https://media.rawg.io/media/screenshots/dae/daee60e083357d4777f4ae649cbe4c52.jpg", "website": "http://halberdstudios.com/", "rating": 3.69, "rating_top": 4, "added_by_status": {"yet": 11, "owned": 27, "beaten": 6, "toplay": 38, "dropped": 8, "playing": 1}, "playtime": 10, "achievements_count": 23, "ratings_count": 13, "suggestions_count": 175, "game_series_count": 0, "reviews_count": 13, "platforms": ["PC", "Nintendo Switch"], "developers": ["Halberd Studios", "HelBeard"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Freedom Games"], "esrb_rating": null}