{"id": 57179, "slug": "sonic-the-hedgehog-3", "name": "Sonic the Hedgehog 3 (1994)", "name_original": "Sonic the Hedgehog 3 (1994)", "description": "<p>Sonic the Hedgehog 3 is a platform game developed and published by Sega. The fourth main game in the Sonic the Hedgehog series, it was released for the Sega Genesis worldwide in February 1994, and in Japan three months later. Following the events of Sonic the Hedgehog 2, Dr. Robotnik&#39;s spaceship, the Death Egg, crash-lands on a mysterious floating island. There, Sonic and Tails must once more retrieve the Chaos Emeralds to stop Death Egg from relaunching, while making rounds with the island&#39;s guardian, Knuckles the Echidna.<br />\nDevelopment of the game began shortly after the release of Sonic 2 in late 1992. It was developed simultaneously with Sonic &amp; Knuckles; they were developed as a single game until time constraints and cartridge costs forced the developers to split them in two projects. The Sonic &amp; Knuckles cartridge features &quot;lock-on&quot; technology that allows it to be physically attached to the Sonic 3 cartridge, creating a combined game, Sonic 3 &amp; Knuckles. A portion of the soundtrack was allegedly composed by American pop musician Michael Jackson, who left the project before completion and went uncredited.<br />\nAs with its two predecessors, Sonic 3 was a critical and commercial success, with critics seeing it as an improvement over previous installments. It sold over one million copies in the United States; though this makes it one of the best-selling Genesis games, its predecessors, bundled with the Genesis in some regions, had sold a combined 21 million. The game has been re-released in compilations and download releases for various platforms, including Sonic Mega Collection for the GameCube and Sonic&#39;s Ultimate Genesis Collection for the PlayStation 3 and Xbox 360.</p>", "metacritic": null, "released": "1994-02-02", "tba": false, "updated": "2024-01-23T12:27:20", "background_image": "https://media.rawg.io/media/games/bb0/bb0032aa8b422968ebadb01353cdd608.jpg", "website": "", "rating": 4.4, "rating_top": 5, "added_by_status": {"yet": 25, "owned": 246, "beaten": 232, "toplay": 37, "dropped": 94, "playing": 5}, "playtime": 3, "achievements_count": 12, "ratings_count": 249, "suggestions_count": 317, "game_series_count": 62, "reviews_count": 250, "platforms": ["Wii", "Genesis", "Xbox 360", "PC", "GameCube"], "developers": ["SEGA", "Sonic Team", "Backbone Entertainment"], "genres": ["Arcade"], "publishers": ["SEGA"], "esrb_rating": null}