{"id": 571735, "slug": "dungeon-of-eyden", "name": "Dungeon of Eyden", "name_original": "Dungeon of Eyden", "description": "<h3>Dungeon of Eyden is a hack &amp; slash co-op game,  with fun mechanics and simple, yet eye-catching graphics.</h3><br/><br/><h3>The Story behind the game:</h3>An admirable soul tainted by darkness has laid waste to the Land. He’s robbed civilians of their riches and lurks in a dungeon locked with sorcery and guarded by monsters. With treasure to claim, demons to slay and eternal fame to be won, adventurers Tavel, from far and wide to test their strength against this enemy. Many have tried and, not a single one has returned! Will you be the challenger who finally breaks the seal and restore peace to the land?<h3>WHAT MAKES THIS SO SPECIAL?</h3>You like games like Zelda, and you love cartoon style hand drawn graphics. You want to run around with a sword, kill enemies, equip your player with a new sword, shield or other clothes, collect magic items as well as gold and diamonds. Then you will surely become a fan of Dungeon of Eyden.<h3>RISE TO THE TOP</h3>Dungeon of Eyden is a classic role-playing game like Zelda. With the optional element of a Leaderboard, Achievements you got the possibility in this gripping and addictive old school role-playing game to fight your way to the Highscore. <br/><br/>How far can you rise to the top?<h3>Endless Fun</h3>Every time you die, the world will re-create itself, so there will always be new places, new spells, and new enemies to discover.", "metacritic": null, "released": "2021-03-12", "tba": false, "updated": "2021-03-15T02:40:37", "background_image": "https://media.rawg.io/media/screenshots/3a8/3a89b2d973f3436eb18676d25b1d97e8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 318, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Andreas Klein"], "genres": ["Action", "Adventure", "RPG"], "publishers": ["KPL"], "esrb_rating": null}