{"id": 571733, "slug": "evowave", "name": "Evo\\Wave", "name_original": "Evo\\Wave", "description": "Evo\\Wave is a 3D platformer featuring the little AI named LAI-6 who learns new programs and skills to restore the world! Travel through levels inspired by the different graphical eras of the video game, repair the Evo\\Core and gain new skills to fight the evil MagnaVex! <br/><br/><br/><br/><br/><br/>A 3D Collectathon evolving through different periods of video game history! The more you progress through the game while repairing the Evo\\Core. The more you will experience wildly different graphics styles from the history of video games!<br/><br/><br/><br/><br/><br/>A retro OutRun graphic style inspired by the '80s with Synthwave music reminiscent of Miami 80! A bold yet limited color palette permeates the landscape, purple skies and teal vegetation are the norm in this virtual world. Awesome music will follow you wherever you go, making you feel like you’re cruising through the neon sunset.<br/><br/><br/><br/><br/><br/><ul><li>Unlock skills like double jumping and the power of gliding through the air that will allow you to navigate through the levels and move around in new and fun ways!<br/><br/></li><li>Collect as many collectibles as you can, from Evo\\Core peripherals and Components or Facts Sheets that will give you historical anecdotes about video games!<br/><br/></li><li>Watch out for glitches and corrupted enemies that MagnaVex will send to counter your progress!  </li></ul><br/><br/><br/><br/><br/>Evo\\Wave is a game designed to be accessible to all age groups, both young and old, and aims to bring some LGBTQ+ representation with LAI-6, our young non-binary artificial intelligence. In addition, a lot of attention has been directed towards visual accessibility by reducing elements like flashing lights and low contrast that would prevent some people from enjoying Evo\\Wave!", "metacritic": null, "released": "2021-03-12", "tba": false, "updated": "2021-03-15T02:39:09", "background_image": "https://media.rawg.io/media/screenshots/dca/dcab5e6c8a72841c31207ac96ab58cad.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1, "beaten": 1}, "playtime": 0, "achievements_count": 25, "ratings_count": 1, "suggestions_count": 289, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["MagnaVex Entertainment"], "genres": ["Action", "Adventure"], "publishers": ["CNM"], "esrb_rating": null}