{"id": 571801, "slug": "econia-become-an-idle-tycoon", "name": "Econia. Become an idle Tycoon", "name_original": "Econia. Become an idle Tycoon", "description": "Econia is a business and city builder game that takes your management skills to the limit. It’s a mix of tycoon, idle and city builder genres: pretty close to SimCity, but smarter; similar to Adventure Capitalist, but way more complicated.<br/><br/> The rules are quite simple: make business decisions, invest in what’s worth, take care of your dwellers and workers, conduct trading and make alliances or devour your competitors leaving them with nothing. <br/><br/>It’s your choice: have fun with your cozy little business or make your enterprise grow restless until it becomes a true empire.<br/><br/><br/>— Build enterprises throughout the city and expand your areas of influence.<br/>— Think strategically as the game simulates a real-world economy.<br/>— Play with real people.<br/>— Look closely at other players’ actions because in Econia everything matters.<br/>— Take full responsibility: become a tycoon or lose everything. <br/><br/><br/>You start on a small street with a few buildings and some money in your pocket. Your success depends on your actions. Are you any good at money management? The game will show.<br/><br/><br/>Econia doesn’t require you to be online frequently, but what you should know is, every time you log in the world can be entirely different. Even when you’re at sleep, other players are changing the infrastructure and surroundings, which effectively makes the game unpredictable. <br/><br/><br/>No more simple clickers and idle pay-to-not-play games. Econia is a brand new experience for hardcore fans of money, management, and city builders. This is the world where you are easily punished for bad business decisions. Should you make a wrong move, bite the bullet and get on your feet again to start from scratch.", "metacritic": null, "released": "2020-05-04", "tba": false, "updated": "2021-03-15T03:24:12", "background_image": "https://media.rawg.io/media/screenshots/a5b/a5b831b5bccbb7a4b6e3898b2f5367c6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 166, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["FutureComes Family"], "genres": ["Strategy", "Simulation"], "publishers": ["Futurecomes family OU"], "esrb_rating": "Everyone 10+"}