{"id": 572, "slug": "eve-valkyrie", "name": "EVE: Valkyrie", "name_original": "EVE: Valkyrie", "description": "<p>Groundrush<br />\nGroundrush, is the fifth major update for EVE: Valkyrie, is now available FREE for all pilots.<br />\nGroundrush takes the fight to the surfaceGame Overview<br />\nGroundrush brings the epic fight between Valkyrie and Schism to a brand new battleground: the surface of a contested planet. The fifth major update to EVE: Valkyrie introduces the new Solitude map, a secret Schism facility carved into the craggy surface of a remote planet. With its tight tunnels, mountainous terrain, and cavernous underground spaces, Solitude will test the flight skills of even the most seasoned Valkyrie pilots.<br />\nExperience the thrill of being an elite spaceship pilot in the sprawling sci-fi universe of EVE.<br />\nJoin the Valkyrie, an outlaw band of galactic pirates, and take up arms to claim what&#39;s yours. Trade cannon fire for cash as you chase wealth and notoriety on the edge of space.<br />\nWith a wide variety of ships, customization options, weapon loadouts, and combat styles, EVE: Valkyrie™ gives you the ultimate freedom to fly. Virtual reality space dogfighting is here. Welcome to the next life.  Gameplay Details<br />\nFull cross-platform online multiplayer among three VR platforms<br />\nCutting-edge virtual reality gameplay takes space combat into the future<br />\nCompetitive multiplayer action rewards teamwork and tactics<br />\nSkill-based character progression and ship upgrades give you complete control over your pilot’s combat style<br />\nGorgeous VR visuals immerse you in the action like never before<br />\nStunning EVE Universe setting and deep backstory place you in a futuristic sci-fi world that becomes more than real.<br />\nBattle for control of orbital shipyards, infiltrate massive enemy carriers, and outmaneuver your rivals in sprawling asteroid fields.<br />\nLead your squadron to victory in competitive online multiplayer, group with friends for co-op battles, or fly solo missions to reveal the mysterious origins of the Valkyrie. The Story<br />\nCold. Disorientated. You awake in a clone tank.<br />\nAs you look around you see the frosted silhouettes of other pilots jolting to life. A memory repeats over and over in your mind. The memory of your death. Unknowingly, and against your will, you&#39;ve been recruited - stolen from your previous life and re-purposed at the hands of a man known only as Fatal.<br />\nUsing illegal tech, he is stealing the consciousnesses of dying fighter pilots and inserting them into specially designed clones at the point of death.<br />\nRán Kavik was one of the first to undergo this process but broke away when she discovered the truth behind her death. She was not saved by the notorious Guristas, but had in fact been targeted and killed by them. As had all the Valkyrie.Tough, independent and driven, she is now waging a private war against her former clan as well as the corporation that she blames for the downfall of her family.<br />\nToday, Rán leads the Valkyrie. They roam the heavens in the dark, lawless regions of New Eden. Their survival is not certain, their enemies are many. But they are faster, deadlier and more unrelenting than anything out there. The Valkyrie have scores to settle and are dying for a fight. Join them in the next life.</p>", "metacritic": 69, "released": "2016-11-17", "tba": false, "updated": "2023-09-20T08:03:45", "background_image": "https://media.rawg.io/media/games/9c2/9c23143b6d7174686bcee74c60db454d.jpg", "website": "https://www.evevalkyrie.com/", "rating": 3.29, "rating_top": 5, "added_by_status": {"yet": 2, "owned": 20, "beaten": 1, "toplay": 5, "dropped": 2}, "playtime": 2, "achievements_count": 33, "ratings_count": 7, "suggestions_count": 581, "game_series_count": 4, "reviews_count": 7, "platforms": ["PlayStation 4", "PC"], "developers": ["CCP", "CCP Games"], "genres": ["Action"], "publishers": ["CCP"], "esrb_rating": "Teen"}