{"id": 572103, "slug": "magicgunner-moestar-chan", "name": "MAGIC*GUNNER Moestar-chan", "name_original": "MAGIC*GUNNER Moestar-chan", "description": "<p>This is a roguelike game where you control MAGIC*GUNNER Moestar-chan in her quest to retrieve the Ankh of Spacetime.</p>\n<p>This game is designed to be playable from your smartphone, but it can also be played with mouse and keyboard.</p>\n<p>- Usual roguelike rules apply. The game is saved automatically, so you can close it and open it up again at any point. Death is permanent, however.<br/></p>\n<p>- You will find weapons and magical artifacts to aid you in your journey. Weapons are self-explanatory, but magical artifacts will need to be identified through trial and error.</p>\n<p>- Your goal is to travel to the bottom floor of the dungeon, retrieve the Ankh of Spacetime and make it safely to the surface.<br/></p>\n<p><strong>Touch controls:</strong></p>\n<p>- Tap on a dungeon floor tile to move towards that tile. If you tap on a tile that is some distance away from you, it may take several moves to get there.</p>\n<p>- Tap on an enemy to attack that enemy, either using your equipped melee weapon or using your equipped firearm, depending on whether the enemy is right next to you or some distance away.</p>\n<p>- Long tap on a tile, enemy etc. to get more information, controls.</p>\n<p>- Long tap on the player to reload your equipped weapon, access status and inventory screens, or transform into MAGIC*GUNNER Moestar-chan! (While in this form, enemy projectiles are slowed, you can reload every weapon in 1 turn and you can dodge enemy attacks. However, your MP will be constantly drained.)<br/></p>\n<p>- You can also access status and inventory screens by tapping the status bar at the bottom of the screen.</p>\n<p>- While on the inventory screen, double tap on a weapon to equip it or on an artifact to use it. After tapping once, a [DROP] button will appear that can be used to drop excess items. You can't drop either of your equipped weapons though.</p>\n<p>- Tap on Moestar to reload your weapon if you are out of ammo. This will use one turn to begin the reloading process, but after that you can move around while continuing to reload. If you want to reload while you still have ammo remaining, long tap on Moestar.<br/></p>\n<p><strong>Keyboard controls:</strong></p>\n<p>- Use the numpad, cursor keys or QWEADZXC to move. Hold Ctrl in conjunction with one of the above to fire your equipped firearm in that direction. Walk into enemies to attack with your melee weapon. (For attacking enemies in directions other than cardinal ones: use the mouse. You can right-click on tiles to bring up the context menu for those tiles.) <br/></p>\n<p>- Press R to reload your equipped firearm.\r\n<br/></p>\n<p>- Press space, S or numpad 5 to wait a turn.<br/></p>\n<p>- Press Ctrl+T to transform into MAGIC*GUNNER Moestar-chan!<br/></p>\n<p>- Press enter to bring up the status/inventory screen, or I to directly bring up the inventory.</p>\n<p>- Press space while on the inventory screen to equip/use an item. Press delete to drop items.</p>\n<p><strong>Hints:</strong></p>\n<p>- Magical artifacts are highly useful, but you need to experiment to find out what each artifact does. Some are instantly revealed when you invoke them, while others have passive abilities.</p>\n<p>- If you are fast enough you can dodge enemy projectiles, or even knock them out of the air with your melee weapon.</p>\n<p>- Don't be disheartened if you see the message 'The ring has no effect' or similar when invoking an artifact. Some artifacts only operate under certain conditions- for example, Restore Health requires you to have less than maximum health for it to work. It may be worth retrying artifacts you previously tried on occasion.<br/></p>\n<p><strong>This game was made using MegaZeux, a fantastic game creation system. Go check it out.</strong><br/></p>", "metacritic": null, "released": "2021-03-14", "tba": false, "updated": "2021-03-15T04:44:01", "background_image": "https://media.rawg.io/media/screenshots/55e/55ec24da666d64b479a26a396cebe547.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 30, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Mahou Shoujo ☆ Magical Moestar"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}