{"id": 572242, "slug": "escape-the-pop-shop", "name": "Escape the Pop Shop", "name_original": "Escape the Pop Shop", "description": "<p>Based on the artwork of legendary artist Keith Haring, <em>Escape the Pop Shop</em> is a maze game that puts you in control of one of Haring’s iconic figures. The goal of the game is to collect all the artifacts scattered throughout the maze in order to get passed the obstacles and escape the Pop Shop!</p>\n\n<p>The player will use the arrow keys to move in 8 directions (WASD). To proceed through the maze, the player must collect one artifact for each of the three obstacles scattered throughout the game. The first obstacle is The Machine (represented by one of Haring’s art pieces). To proceed through the maze and get rid of the Machine, the player must find and collect the Technology Artifact (represented by the three gears). After passing the Machine, the player must collect the Dance Artifact to proceed passed the DJ (represented by the dog). Once the player makes it passed the DJ, the player must collect the Love Artifact (represented by the heart) to make it passed the final obstacle (represented by the two figures holding a heart). For this final obstacle, a chaser (represented by the scissors) will also be pursuing the player while they look for the final artifact. If the chaser catches the player before they can collect the artifact, the game restarts. If the player collects the artifact, the chaser and the final obstacle are destroyed. The player can then make their way to the exit and complete the game.</p>", "metacritic": null, "released": "2021-03-14", "tba": false, "updated": "2021-03-15T05:21:51", "background_image": "https://media.rawg.io/media/screenshots/b0a/b0ab12e05669d1baa54f7bfa6feabf70.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 11, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["rpcook1"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}