{"id": 572321, "slug": "tales-of-phantasy-a-sonic-and-klonoa-rpg", "name": "Tales of Phantasy: a Sonic and Klonoa RPG", "name_original": "Tales of Phantasy: a Sonic and Klonoa RPG", "description": "<p>Hello and welcome! this is a  fan rpg that stars sonic and klonoa characters in a fantasy/sci-fi adventure hears a idea of the games story<br/><br/>(note this is subject to change later on )<br/><br/></p>\n<p><strong>Story/Setting: (W.I.P./Concept)</strong><br/> One peaceful day Klonoa and his friends are on they're way to Lolo's graduation ceremony from being a priestess-in-training. however during the Ceremony, Janga an extremely dangerous villain, attacks with an army of strange robots in Search of some powerful artifacts that's hidden with in the church. The High Priestess, knowing what Janga is after manages to give Klonoa one of the artifacts knowing that it would be safe with him however being overrun by robots Janga manages to steal one of them and retreats. Klonoa and friends follow him but end up falling right in to Janga's trap. using a strange device he creates a portal that sucks everyone in to it. In a last attempt to stop him, Klonoa throws his boomerang to stop the machines, but he only manages to change where they would end up. As it returned to him it strikes Janga in the back knocking him and the artifact in to the portal with them. Ending up on different parts of Mobius they each meet up with different sonic characters to help find they're way home. however as they travel around they end up finding out that there's alot more going on then Janga causing trouble. they'll have to work together, learn and gain new powers and magic in order not to save only Lunatea but Mobius and Earth as well.</p>\n<p>at the moment i'm in the testing phase of the game making sure everything is working right i'm also looking for testers to test the game to find bugs, glitches, or errors<br/><br/>if you like to give more input on the game join my discord server<br/>https://discord.gg/czTJ2hsp<br/></p>\n<p>this game is purely a fan made game i do not own any Sonic Characters and Klonoa Characters, only fan made characters  that i own<br/><br/>this game is 100% FREE!!<br/>if any one gives donations the money will go to resources only! nothing else<br/></p>\n\n<p>the link below to the game is the last test build i made this is to show off the game and see whats working or not. i look forward to your input <br/></p>", "metacritic": null, "released": "2021-03-14", "tba": false, "updated": "2021-03-15T05:39:24", "background_image": "https://media.rawg.io/media/screenshots/367/36793cc3c6a5f8bcf12a4b2d55ac2457.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 265, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["ScytheX"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}