{"id": 5724, "slug": "coco-loco", "name": "Coco Loco", "name_original": "Coco Loco", "description": "&amp;quot;Coco Loco is a fantastic physics based puzzle game, the best to hit the iPhone in a long time.&amp;quot; — The Smartphone App Review, 90/10<br/><br/>&amp;quot;Coco Loco is Jaw-dropping...&amp;quot; — AppCroc<br/><br/>&amp;quot;You will quite literally be hooked within the first 5 levels, fun and simple, nothing else I could ask for.&amp;quot; — App-Score, 9/10<br/><br/>&amp;quot;Coco Loco is tasty in its own right, and offers variation on a beloved theme done with charm and just enough strategic differences to keep it from being redundant.&amp;quot; — 148Apps, 4/5<br/><br/>&amp;quot;If you are looking for another good physic based puzzle game you should download this game...&amp;quot; — Internet Gumshoe, 84/100<br/><br/>&amp;quot;Coco Loco is an unexpected treat in the tired genre of 3-star physics puzzle clones on the App Store, and proves that with enough innovation, charm, and polish, any genre of game can be made fresh and fun again.&amp;quot; — TouchGen, 4.5/5<br/><br/>&amp;quot;Overall, Coco Loco is a fantastic physics based puzzle game, the best to hit the iPhone in a long time.&amp;quot; — AppAddict, 4.5/5<br/><br/>It&amp;#39;s time for the Cocoa Bean Guardians to &amp;#39;Mallow&amp;#39; out. Take control of a troop of fearless marshmallow heroes as you set out to rescue your friends from the candy clutches of the nasty chocolate guardians. Traverse across strange wildernesses using each Marshies&amp;#39; special skill and show those chocolate chumps that you&amp;#39;re not as soft as you look!<br/><br/>• SMASH MALLOWS<br/>Whack each mallow with your trusty baseball bat and watch them fly gracefully (er…sometimes) through the air and smash into the sturdy chocolate forts. Many of the Marshie have special skills from giant Jello Marshies to slice-and-dicing ninja-mallows!<br/><br/>• MYSTICAL WORLDS<br/>Your sweet adventure will take you across four vastly different environments from green rolling hills, to deep underground caverns. Each zone features 15 stages, watch as the challenge really ramps up!<br/><br/>• YOU SPILLED A BIT<br/>Use the incredible in-game physics including splashing and sloshing chocolate milk, gusts of wind, gravity and the unique effect of super sticky jelly!<br/><br/>For more information or support, please visit www.chillingo.com", "metacritic": null, "released": "2012-03-08", "tba": false, "updated": "2019-10-22T14:28:17", "background_image": "https://media.rawg.io/media/screenshots/d06/d0618231b12f5480eb413dfaa10bebfd.jpeg", "website": "http://www.twiitch.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 128, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Twiitch"], "genres": ["Arcade", "Family"], "publishers": ["Twiitch"], "esrb_rating": "Everyone 10+"}