{"id": 572423, "slug": "sunset-hotel", "name": "Sunset Hotel", "name_original": "Sunset Hotel", "description": "<p>Welcome to the Sunset Hotel! As Los Angeles’ finest five-star resort, we’ve got everything you could possibly need for a nice, relaxing getaway. Take in the sights as you enter through our grand lobby, soak up the sun as you relax by our magnificent pool, grab a bite to eat at our world-class restaurant, and, of course, spend a relaxing evening in one of our 4000 guest rooms. Our staff is <strong>always there</strong> if you need anything, so don’t hesitate to take advantage of our 24 hour room service! Feeling lucky? Check out our brand new casino, and discover why our guests <strong>never leave</strong> for Vegas ever again. Or, if you’re looking to be entertained, look no further than Serling Memorial Theater, and marvel at the elegant routines and <strong>death</strong>-defying stunts of Cirque des Étoiles (performing weekends at 6:30pm and 11:30pm)! Come see what makes our guests want to <strong>stay here forever</strong>. Thank you for choosing Sunset Hotel; we hope you enjoy your stay!<br/></p>\n<p><em>Sunset Hotel</em> is a top-down adventure where players must explore and solve puzzles in order to escape the game’s mysterious namesake. Inspired by the Eagles song <em>Hotel California</em> and the <em>Tower of Terror </em>attraction at Disney’s Hollywood Studios, with gameplay inspired by the <em>Legend of Zelda</em> series. </p>\n<p>Made for a game design class at West Virginia University</p>", "metacritic": null, "released": "2021-03-13", "tba": false, "updated": "2021-03-15T06:05:54", "background_image": "https://media.rawg.io/media/screenshots/3f8/3f825c3e7f1dbf556053ee29160298a1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["J_Sulley123"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}