{"id": 57279, "slug": "teddy-boy-blues", "name": "Teddy Boy Blues", "name_original": "Teddy Boy Blues", "description": "<p>Teddy Boy Blues – Yohko Ishino (テディボーイ・ブルース / 石野陽子, Tedibōi Burūzu / Ishino Yōko) is a 1985 arcade game made by Sega. It stars a young boy who is armed with a gun. Each level is an infinitely-repeating maze with several dice. Each die is filled with monsters which hatch out and the player must shoot to shrink, then collect them. If the player does not collect each shrunken monster quickly, it turns into a time-eating bug which flies to the time limit bar and consumes a chunk of it. If you touch one monster or run out of time then you lose a life. The game ends if all lives are lost. There are 50 distinct levels, called \"rounds\" in the game, even though the counter goes to 99 (the 100th level does not show). The player can play through the levels loops infinitely, with no apparent end. There are also \"bonus rounds\" every so often where the player can shoot colored dice to reveal prizes and increase his or her score.</p>\n<p>The name of the arcade version was a reference to a 1985 hit song entitled \"Teddy Boy Blues\" by then-popular Japanese pop star Yōko Ishino, an instrumental version of which constantly played in the background during the game. An animated version of Ishino also appeared on the title screen and during the bonus rounds.</p>", "metacritic": null, "released": "1985-01-01", "tba": false, "updated": "2019-08-28T22:25:50", "background_image": "https://media.rawg.io/media/screenshots/a8c/a8c426d2808b34871481608baddb03a3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "beaten": 1, "toplay": 1, "dropped": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 135, "game_series_count": 0, "reviews_count": 2, "platforms": ["SEGA Master System", "Genesis"], "developers": ["SEGA"], "genres": [], "publishers": ["SEGA"], "esrb_rating": null}