{"id": 572848, "slug": "animozity", "name": "Animozity", "name_original": "Animozity", "description": "<p>What if the classic arcade titles Berzerk/Frenzy had a sequel on the PS1? What if incorporated roguelike elements in its design? Animozity is the product of that thought experiment, made for both Retro-Jam and 7DRL.</p>\n<p>Travel through the rusted metal corridors and destroy any robots that try to stop you. Level up and pick perks to increase your chances of survival, but watch out as every perk comes with a negative side-effect too. Picking the right perks and weapons that work well together is the key to destroying everything in your way.<br/></p>\n<p>Features:</p>\n<ul><li>Every playthrough is different with proc gen map layouts and random perk/weapon choices</li><li>Fairly authentic PS1 limited visuals</li><li>Multiple difficulty levels to get an appropriate challenge</li><li>Support for both keyboard/mouse as well as gamepad (so if it was actually on the ps1, you'd need dual analog controller/dualshock or the ps mouse).</li></ul>\n<p>Created with the FTEQW engine, most assets created during jam period with the exception of some sounds that were lifted from my other games. The game's source code is in the game/src directory, needs FTE QuakeC Compiler (fteqcc) to compile, I license it under the MIT license.<br/></p>\n<p>Zip contains both Windows and Linux (amd64) binaries, to run it on Linux you might need to `chmod +x ./fteqw64` first</p><p>For ps1 style affine texturing, you can use console to input `gl_affinemodels 1`<br/><br/></p>", "metacritic": null, "released": "2021-03-12", "tba": false, "updated": "2021-03-15T07:51:43", "background_image": "https://media.rawg.io/media/screenshots/66e/66e93fdfe6c14a1156d9508b2fefeac9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 39, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["shp"], "genres": ["Action"], "publishers": [], "esrb_rating": null}