{"id": 572939, "slug": "extreme-asteroids-1979", "name": "Extreme Asteroids 1979", "name_original": "Extreme Asteroids 1979", "description": "<p><strong>A new, extremer version of the classical 1979 game by Atari!</strong></p>\n<p>Imagine being in the early 80s in an arcade, the sounds of clicking, old electronic-like effects from the arcades, a big room that is slighly dark, and you. In one of these arcades, a game called \"Extreme Asteroids\" appears.</p>\n<p>In this recreation of the original retro game, you fly a spaceship, while asteroids appear, and you have to shoot them in order to win points.</p>\n<p><em>However, that's not everything!</em></p>\n<p>The asteroids now appear in waves, each getting faster and faster, and you having to dodge the incoming asteroids with more and more precision in order to not get hit. Your own bullets now can push you, spinning you around, so you have to think before you shoot, if you don't want your own bullets to push you into an asteroid!</p>\n<p>And the greatest addition is the bomb! After hitting 50 asteroids, you can now launch a bomb that will launch up to 100 of bullets at fast velocity in all directions, creating a cascade of points and great destruction to the asteroids!</p>\n<p>Think strategically, when do you use the bomb, when do you shoot bullets, how do you avoid the asteroids that almost block the entire view?</p>\n<p>Find out now how many points can you collect and how much time you can survive. Can you pass 350.000 points?</p>\n<p>Controls:</p>\n<p>Up arrow key: move up</p>\n<p>Down arrow key: stop the spaceship - use with up arrow key to move slowly</p>\n<p>Left, right arrow keys: rotate the spaceship</p>\n<p>X key: shoot bullet</p>\n<p>Z key: place bomb - watch out for the bullets!</p>\n<p>R key: respawn ship on the center of the screen if you died or you can't see your ship</p>\n<p>Esc key: exit the game</p>", "metacritic": null, "released": "2021-03-12", "tba": false, "updated": "2021-03-15T08:17:25", "background_image": "https://media.rawg.io/media/screenshots/51c/51cc37bd4972f538a85d59838236b4fb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 29, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SSMAX"], "genres": ["Action"], "publishers": [], "esrb_rating": null}