{"id": 573015, "slug": "killing-words", "name": "Killing Words", "name_original": "Killing Words", "description": "<p>After having his home ransacked for the umpteenth time in a row, the <strong>Evil Overlord</strong> decides to take matters into his own hands and addresses the root of his problems: the nearby village that won't stop sending adventurers to his place because <em>apparently hiring monsters is not well-seen</em>.</p>\n<p>But he needs time to amass a small army and destroy the ignorant villagers. Watching the adventurers and villagers from afar, waiting for a weakness to exploit, the opportunity arises: <strong>the adventurers kill an unarmed villager! </strong></p>\n<p>Persuading a dead villager - <em>well, zombified now</em> - to deceive the adventurers and leading them into deadly traps should be easy.</p>\r\n\r\nType to persuade the adventurers\r\nYour weapons are your words and your cunning. Type the words to get the adventurer's attention and lead them to mortal peril!\r\n<p>You stand in the middle of the crossroads, word in tongue and angelic expression in a rotting face. An adventurer approaches you, confused and not knowing where to go. There are three paths before him; time is running out and he wants to know your opinion because you seem like a knowledgeable fella.</p>\n<p>Your words sound concerned and caring to the adventurer's ears, but he doesn't know you are deceiving him. Where should only be a measly bat there is a terrifying devil captain, ready to crush the unsuspecting adventurer!</p>\r\nMultiple levels, multiple difficulties\r\n<p>As time goes on, the adventurers step up their game and start sending more powerful units. Beware of powerful adventurers!</p>\n<p>But don't fret, you are not alone in this task. Your new boss has put some monsters at the end of the roads you can send adventurers to, and these monsters are eager to start working - <em>they've been promised a salary raise if they perform well</em>. When a monster defeats an adventurer, its maximum level will raise (up to 90) and it will start healing.</p>\n<p>Choose carefully where to send the adventurers so you can level up your monsters and make a weak bat into a powerful doped bat (<em>Strong wings and healthy gums are a must for bats!)</em>.<br/></p>\n\n\r\nA zombie main character\r\n<p>Yeah, you are a zombie! But you are not decaying yet, just pale and with dark bags under your eyes - <em>just like a normal person</em>.</p>\n\r\nThe entrepreneur Overlord\r\n<p>How can anyone dislike this guy?! Well, it's obvious the rest of the world is jealous because he is so successful in his business. He can talk about it for hours but you have yet to understand exactly what this guy does.</p>\n\n<p><em>He also breeds monsters as a hobbie.</em><br/></p>\r\nMean adventurers\r\n<p>These dudes mistreated you and ultimately killed you in cold blood for a bag of coins. Now it's your time to get revenge!</p>\n\n\n<p>It's easier saying it than doing it! Type the words to get the adventurers attention - <em>only letters will appear </em>-, then press <strong>SPACE</strong> to start choosing a direction for the gullible adventurer.</p>\n<p>When you start typing other words (or after certain time has passed) the adventurer will accept your suggestion and start walking towards his destiny (hopefully a <em>deadly</em> one).<br/></p>\n\n\n<p><strong>Did you like the game? The comment section is right here, just a few lines under this; tell us what you liked, what could be improved...</strong></p>\n<p><strong>If you liked this game, consider buying us a coffe!</strong></p>", "metacritic": null, "released": "2021-03-12", "tba": false, "updated": "2021-03-15T08:33:53", "background_image": "https://media.rawg.io/media/screenshots/eb6/eb61a6e6726d1b06805ba26b25c65fdd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 65, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["Alejandro Royo", "Patricia Lazaro", "Otter Games"], "genres": ["Action", "Educational"], "publishers": [], "esrb_rating": null}