{"id": 573008, "slug": "retro-shock", "name": "Retro Shock", "name_original": "Retro Shock", "description": "<p>Hey this is my entry for the Retro Game Jam. It's being developed with RPG Maker MV and the Chrono Engine for same allowing for real time combat with projectile physics and hit detection that mostly kind of sort of work. The premise is, what if System Shock 1 had been a SNES game, not a PC game. So the plan is for pretty pixel art and jammin chip tunes underscoring a top-down RPG/shooter hybrid and exemplifying the all-encompassing science-fiction despair/terror that is the 'Shock franchise, where ambitious people make enormous leaps forward in technology that lead to more suffering for everyone! Yay!</p>\n<p>Adult language, adult themes, extreme pixelated blood and gore.</p>\n<p>It is not literally a port of System Shock 1, mainly because I have a confession to make, I really can't make myself play the original System Shock. The controls are just too janky and weird and I can't get a setup for keyboard &amp; mouse or gamepad that doesn't feel ridiculously awkward to the point of unplayability. Also the visuals are uh...very 1994...which is not that big a deal but they don't make the game any  more appealing when one is already frantically wrestling the controls. The remake is soon. I can wait for the remake. </p>\n<p>But there are other reasons. </p>\n<p>I eventually want this to develop in the direction becoming its own thing, a thing that if it gets completed and is any good, I can sell. As I need to explain to literally no one, Intellectual Property is a thing and System Shock isn't mine. The short (maybe VERY short) version released for the jam is more like a free fan game, so it'll have undisguised plot elements, characters, proper nouns, systems and other distinctive features (plus shout-outs and homages) from the 'Shock series, but as I develop the project further, I'll gradually be transforming it into its own thing that I can sell. Retro Shock will almost certainly not be the name of that final version. And explicit references to Tri-Optimum and Edward Diego and Janet Polito and Citadel Station and Shodan and the F-5 Virus and so on won't make it into the final version. (Writing and world building is easy for me: the technical aspects of game design are very much not.) </p>\n<p>I have no idea how long the development cycle for the full thing will be, but certainly months if not years. Maybe in the interrim I can get some help from people who have talents that overlap with all the many things I can't do, like art and music.</p>\n<p>It also takes place in a universe where the events of System Shock 1 (and later SS2) happen, it's just set before any of that, in 2069. The events of it tie into the events of the two real System Shock games, but it isn't a \"direct prequel\". Think of Retro Shock as the \"System Shock 0\" that never was. In terms of the game's style, structure, and themes, it's going to be a bit more like a Bioshock game than than either of the real System Shock games (Prey (2017) by Arkane Studios which is essentially System Shock 3 in every way that matters--to me, anyway--was another huge influence). But hopefully by the time your eyes are glancing over these words I've finished and released something playable and hopefully in that case you'll already be playing it!</p>", "metacritic": null, "released": "2021-03-12", "tba": false, "updated": "2021-03-15T08:32:17", "background_image": "https://media.rawg.io/media/screenshots/df5/df5caf231aa0f747048d031de9de0a5f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 374, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["The Gentleman Loser"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}