{"id": 573069, "slug": "bloons-gb-5", "name": "Bloons GB 5", "name_original": "Bloons GB 5", "description": "<p><strong>I'll make an html build once I have the money to buy a license for html<br/><br/></strong>thanks for visiting the game page. glad to see you took some interest in what I made.<br/>this is a bloons tower defense 5 remake meant to be a GameBoy Advance type game. \"Why is it made to be like a GBA game\" you may ask. this is a submission to the Retro Game Jam 2021 where you take an existing game idea and make it to another retro console! <br/><br/>as you hop into the game you see my beautiful into screen and wonder why you downloaded this. the main premise of the game is pop bloons to collect coins and use those coins to get monkeys. every 250 bloons popped (up to 2500) the difficulty will increase, making bloons speedier and giving bloons more of a chance to spawn as a two-hit instead of a one-hit. and the game is endless so far (unless you die).<br/><br/>but no game jam comes without a theme...<br/><br/>the theme for the Retro Jam of 2021 was SIDE EFFECTS. so I implemented it in such a way that most people would, <strong><em>demon upgrades</em></strong>. you will notice you have two upgrade buttons and a reroll button on your screen. these upgrades come as little as giving you 50 coins to giving you a free power up. but of course demons will be demons. when you upgrade one of these, you get the debuff listed, whether it be lose three hearts or place a bomb that kills monkeys in a random place.<br/><br/>fun right? sometimes agonizing but hey that's just comes with the job. I'll probably add more maps and monkeys in the future because its really easy to do so and none the less I hope you enjoy.<br/><br/>please follow me for more updates to this game or my other games. considering this is only the first version of my game there is still a lot of improvements to be made. maybe your most hated bug will be fixed.</p>", "metacritic": null, "released": "2021-03-12", "tba": false, "updated": "2021-03-15T08:46:59", "background_image": "https://media.rawg.io/media/screenshots/ded/ded2b1b80cde38be7e6496ea8ca0b248.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 36, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["DiregamesOfficial"], "genres": [], "publishers": [], "esrb_rating": null}