{"id": 573193, "slug": "smash-legends", "name": "SMASH LEGENDS", "name_original": "SMASH LEGENDS", "description": "<h3>\"SMASH Must Go On!\"</h3><br/>To return the Library World back to normal, or to protect one’s honor.<br/>Each LEGENDS joined the battle for their own cause.<br/>Their ultimate brawl competition begins now.<br/>Who will prove themselves to be the true LEGENDS?!<br/><br/>SMASH LEGENDS is a casual brawl-action game that unfolds in the Library World, <br/>an island that floats above a vast sea of clouds.<br/>Join now and play for free in a cross-platform environment against players from Steam, iOS and Android devices.<br/><strong><h3>Key Feature:</h3></strong><h3>* SMASH with epic knock outs!</h3>SMASH, SMASH, BOOM! Enemies are more likely to get knocked out when their HP is low.<br/>Knock off enemies from arenas set in floating islands to achieve victory.<h3>* SMASH across variety of game modes and maps!</h3>Multiple modes are available in SMASH LEGENDS, including 3 vs. 3, 1 vs. 1 and Free-for-all.<br/>Smash your enemies in a battlefield filled with fairy tale SF fantasies.<br/>And release your energy in this thrilling world.<br/><br/>- Dominion (3 vs. 3): Capture and hold an area with your teammates to achieve victory.<br/>.<br/><br/>- Team Deathmatch (3 vs. 3): A team competition to the death.<br/>.<br/><br/>- Battle Royale (8 Player FFA): Only 1 final player will survive in this 8 player free-for-all mode.<br/>.<br/><br/>- Crown Guard (3 vs. 3): Defeat the enemy with the Crown while protecting your team’s Crown.<br/>- Harvest (4 Player FFA): Player who harvests the most fruits by destroying Mandrakes win.<br/>- Duel: A 1 vs. 1 duel where only your controls and skills count.<br/>(* Game modes will continuously be updated.)<h3>* SMASH with unique characters!</h3>There are multiple unique characters, each with a different story.<br/>You will be able to grow various Legends by playing with them, and unlock new Legends in the process.<br/>And your choices will decide whether or not you will be able to make great plays.<br/><br/>Are you ready to wreak havoc in the Library World?<br/>Experience the fun in SMASH LEGENDS now.<h3>\"SMASH Must Go On!\"</h3>- SMASH LEGENDS -", "metacritic": null, "released": "2021-03-15", "tba": false, "updated": "2024-02-12T21:25:55", "background_image": "https://media.rawg.io/media/screenshots/049/0493da9807a136fc5aae29be91d686fc.jpg", "website": "https://sl-us.floor.line.games", "rating": 2.36, "rating_top": 1, "added_by_status": {"yet": 4, "owned": 221, "toplay": 1, "dropped": 6, "playing": 2}, "playtime": 1, "achievements_count": 0, "ratings_count": 12, "suggestions_count": 320, "game_series_count": 0, "reviews_count": 11, "platforms": ["PC", "iOS"], "developers": ["LINE Games", "5minlab"], "genres": ["Action", "Casual"], "publishers": ["LINE Games"], "esrb_rating": "Teen"}