{"id": 573140, "slug": "pythian", "name": "PYTHIAN", "name_original": "PYTHIAN", "description": "Have you ever visited or dreamed of visiting a big hard dance music festivals like Masters of Hardcore, Dominator Festival or any other music event where a theme reinforced by mind-blowing show elements like lasers, fireworks, LED screens and lights transfered you to another world? What if you could actually <strong>step into</strong> that world?<br/><br/>PYTHIAN is a new way to experience hard dance music and the dedication that comes with it. The world’s leading hard dance brands invite you to immerse yourself in their worlds. Let us reform your reality and witness the power of a virtual escape.<br/> <br/><strong>LIVE EXPERIENCES</strong><br/>On March 27th of 2021, the first live experience will take place within PYTHIAN. Masters of Hardcore will present a one hour experience that transports you back to the 2016’s event theme: Raiders of Rampage. A VR experience including the hardest live sets from top of the bill hardcore artists. Immerse yourself in the world of vikings and virtually rave with people from all over the world. Obey the noise of the visionary. The world never saw them coming.<br/> <br/><strong>EVENT THROWBACKS</strong><br/>Next to participating in live experiences you will be able to relive some of the best hard dance sets in a XR experience, together with your rave buddies of course. Bring your technical skills too, cause you will be able to control the lighting in the show yourself! <br/><br/>The following event throwbacks are being developed right now, and will be added soon (more will follow!);<br/>Angerfist @ Dominator 2019 (end show)<br/>N-Vitral @ Masters of Hardcore 2019 (anthem show)<br/>Warface &amp; D-Sturb at Live For This 2019 (opening show)<br/>Crypsis @ Supremacy 2019 (anthem show)<br/> <br/><strong>DOMINATOR DRONE EXPERIENCE - (COMING SOON - RELEASE DATE TBA)</strong><br/>During COVID times Dominator Festival organised a thrilling livestream on the E3 beach in Eersel. They brought together the best artists in the hardcore scene and the sickest quad and motor racers in the area. This was all captured with racing drones and you will be able to view this from the pilot’s perspective!", "metacritic": null, "released": "2021-03-15", "tba": false, "updated": "2021-03-19T02:37:10", "background_image": "https://media.rawg.io/media/screenshots/a22/a227cdd74cea1daab198a537c7a8da01.jpg", "website": "https://www.pythianxr.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 152, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["VRROOM", "ART OF DANCE"], "genres": ["Action", "Simulation", "Casual", "Massively Multiplayer"], "publishers": ["PYTHIAN"], "esrb_rating": null}