{"id": 573151, "slug": "harmoney", "name": "HarmonEy", "name_original": "HarmonEy", "description": "<h3> Game Outline </h3><br/>Married couple's flirting marriage life!<br/><br/>Just a flirting and erotic story in a comfortable space.<br/>From the flirting sex that confirms love<br/>Sometimes even wild sex like a beast!<h3> Genre </h3><br/>Married Couple's love love adventure.<h3> Concept </h3><br/>Stay true to the basics!<br/>A work that focuses on flirting and eroticism between husband and wife!<br/><br/>Point 1<br/>Enjoy the marriage of a sweet working person freely!<br/>There are no difficult stories in this work!<br/>\"Just a flirting and erotic story in a comfortable space\"<br/>It is structured so that you can enjoy.<br/><br/>Point 2<br/>Focus on the couple's utopia!<br/>The main story is written almost only \"after returning home\" or \"holiday\".<br/>There is no binding, no dignity, no manners.<br/>The composition focuses on \"only utopia\" for the heroine.<br/>Heal the heroine who came back after being rubbed by the rough waves of society,<br/>On the contrary, it will be healed<br/><br/>Point 3<br/>Of course, also erotic!<br/>From the flirting sex that confirms love<br/>Sometimes even wild sex like a beast!<br/>You can enjoy all 10 erotic scenes.<br/>Also, please pay attention to the pillow talk after the etch!<h3>The protagonist's wife</h3><br/><strong>Ayako Ichinose</strong><br/>Height： 163cm　Blood type： O type　Nickname： Ako<br/>Favorite things： Husband, sweet things<br/>Dislike： Things that interfere with my time with my husband<br/>Hobbies： Fun and playing with my husband<br/>Pros： carefree<br/>Disadvantages： Self-deterioration at home (also cute)<br/>Weakness： Insect<br/>Liquor： Quite strong<br/><br/>A member of society who works hard in peacetime and is the wife of the main character.<br/>In my private life, I'm a little sloppy, and I'm living a free-spirited day, flirting with my husband.<br/><br/>I met the hero when I was a student and got married as it was.<br/> As a friend, a lover, and a loved one, I love my husband so much that my husband comes first in everything, and I value their time the most.<br/><br/>Housework is in charge of washing and cleaning, and cooking is left to the husband.<br/>It's not that I can't cook, but I only cook occasionally because I'm late to go home.<br/><br/>It's surprisingly expressive with a lot of overreactions, but as a result, it has a personality that makes it easy to understand what you are thinking.", "metacritic": null, "released": "2021-03-15", "tba": false, "updated": "2021-03-19T02:42:37", "background_image": "https://media.rawg.io/media/screenshots/f9b/f9b73d6396cb9a1dd2a004297649e5d8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 264, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["はちみつそふと"], "genres": ["Adventure"], "publishers": ["ARTLINK"], "esrb_rating": null}