{"id": 573229, "slug": "lets-learn-xiangqi-chinese-chess", "name": "Let's Learn Xiangqi (Chinese Chess)", "name_original": "Let's Learn Xiangqi (Chinese Chess)", "description": "Learn Xiangqi, the ancient Chinese strategy game.<br/>Examine all aspects of the art of Xiangqi, learning with interactive training boards.<br/>Study piece movements, checkmate conditions and tactics; learn Xiangqi inside out!<br/>Play your first games with helpful pictures, learning the Chinese characters for each piece when you gain more confidence.<br/>Practice strategic formations and techniques used by the masters of Xiangqi.<br/>Challenge yourself with over 60 training puzzles and become an expert in endgame strategy.<br/><br/><br/><br/>Play against a wide variety of AI opponents, choosing a difficulty to match your skill level.<br/>In-game indicators provide helpful reminders of each piece's available movements, letting you focus on choosing the best move.<br/>As you improve, you can dial up the difficulty to ensure a stimulating strategic challenge.<br/>Try playing with a handicap, to test your strategic skills to the limit!<br/><br/><br/><br/>Once you've learned the basics, why not enter the Xiangqi leagues?<br/>Choose from the Kunming, Chengdu, Shanghai and Beijing leagues. Each league has a range of AI opponents to challenge you at every level.<br/>To progress through the leagues, you'll develop your technique and employ a wide range of Xiangqi tactics.<br/>With a sound strategy, victory can be yours.<br/><br/>Are you ready? Let's learn Xiangqi!", "metacritic": null, "released": "2021-03-17", "tba": false, "updated": "2021-03-19T03:38:10", "background_image": "https://media.rawg.io/media/screenshots/bf5/bf58e28cc9f919e390492e443bf7214f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 51, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dr. Cyril Splutterworth"], "genres": ["Strategy"], "publishers": ["Dr. Cyril Splutterworth"], "esrb_rating": null}