{"id": 573225, "slug": "incremental-epic-breakers", "name": "Incremental Epic Breakers", "name_original": "Incremental Epic Breakers", "description": "<strong>Incremental Idle Breakout RPG!</strong><br/>This is the second new idle game created by Hapiwaku Project, who released Incremental Epic Hero and achieved one million plays!<br/><br/>  Red Balls woke up in the room surrounded by many blocks. Try to improve Red Balls’ stats and destroy the blocks around them. You can improve their stats even when you are offline. Unlocking various automation features will make the game hands-free.<br/><br/>  There are many monsters attacking your base. Upgrades the base's stats to defend from them. You can create crafts with the broken blocks and make them part of your base. Use your captured monsters as workers to upgrade your base's stats or send them on Expedition to get equipments.<br/><br/>  To get even stronger, use Ascension and Reincarnation. These will reborn you in a stronger state and speed up the overall progress of the game.<h3>Key Features</h3><strong>Routine and Improvement</strong><br/>    Various operations can be automated in Routine. Your stats can be improved by various Improvement upgrades. Higher-Tier Improvements that will appear later <br/>    are stronger upgrades.<br/><br/><strong>Craft</strong><br/>    You can create various Crafts, which work by being placed on the pioneered map. Craft Quality increases by completing the Progress Bar and consuming the <br/>    required blocks. The maximum Quality is 100, which will be used for higher-tier crafts.<br/><br/><strong>Mission</strong><br/>    You get a reward for Ascension Upgrades when you complete Missions. Nitro Booster is very helpful to complete them.<br/><br/><strong>Challenge</strong><br/>    Only the red balls, white balls from cannon crafts and bullets from Challenge base can damage monsters. The top left flag is the sign of Challenge Base.<br/><br/><strong>Ascension and Reincarnation</strong><br/>    Ascension resets the game and gives you Ascension Gold, which is used for Ascension Upgrades. <br/>    Reincarnation applies Reincarnation Upgrades after a deeper Ascension. <br/><br/><strong>Expedition</strong><br/>    Captured monsters make an expedition for premium treasure chests.<br/><br/><strong>Artifact</strong><br/>    Artifacts are made from fragments and elements.<br/><br/><strong>Inventory</strong><br/>    Holds premium treasure chests and Equipment.<h3>Hotkey</h3>- \"Space\" to boost<br/>- \"Arrow\" or \"WASD\" to boost in that direction<br/>- \"Z\" for x5, \"X\" for x10, \"Alt\" for xMAX<br/>- \"R\" to rotate the craft<br/>- \"C\" on a craft to lock it<br/>- \"L\" to lock the information<br/>- \"1\" to \"8\" to switch menus<br/>- \"Tab\" to switch the menu tier<br/>- \"Control-Tab\" to switch the tab menu<br/>- \"Right-Click\" on a monster to try capture with a trap<br/>- “Alt-N” to show the name on the craft\t<br/>- “Alt-C” to lock all crafts.\t<br/>- “Shift-C” to unlock all crafts.<h3>Developers</h3>We are Japanese game developer team Hapiwaku Project!<br/>\"Hapiwaku\" is a Japanese word, which means \"happy and excited\". We hope you all feel happy and excited through this game!<br/>- Discord Community<br/>- Website", "metacritic": null, "released": "2021-03-17", "tba": false, "updated": "2021-03-19T03:35:28", "background_image": "https://media.rawg.io/media/screenshots/b13/b137632d865204d838b2ff16866ccfe7.jpg", "website": "https://hapiwaku.work/2020/09/18/incremental-epic-breakers/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 23, "ratings_count": 0, "suggestions_count": 215, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Happy Wakuwaku Project", "Hapiwaku Project"], "genres": ["Action", "RPG", "Strategy", "Indie"], "publishers": ["Idle System"], "esrb_rating": null}