{"id": 573244, "slug": "lire-2", "name": "LIRE", "name_original": "LIRE", "description": "LIRE focuses on Eve Antoinette, after her family moved to another country 10 years ago. She came back to visit her favorite childhood spot along with her cat Sebastian. Unfortunately, her cat ran away deep into the forest and disappeared. Eve decided to follow and saw Sebastian jump through the window of an abandoned mansion that she had never known ever existed in this forest. She realized that while the mansion is very mysterious and scary, she still needed to find Sebastian and get out of this place which contains a dark force trapped inside.<br/><br/><br/>Eve Antoinette is a quiet girl, as if she had no emotions. She loves flowers, animals, tea, chocolate and reading books. Eve owns a black cat named Sebastian.<br/><br/><br/>Do you believe in ghost? What do you know about them?<br/>Types of ghosts :<br/><br/><ul><li>Interactive Personality : Can talk, prefers to stay in one place, not dangerous.</li></ul> <ul><li>Poltergeist : Physical disturbances such as loud noises and objects thrown around.</li></ul> <ul><li>Shocking ghost : Will appear if you trigger something, sometimes can be avoided, not too dangerous.</li></ul><ul><li>Bound ghost : Can't move, if you hit it you will get damage, not too dangerous. Some specific bound ghosts can't deal damage but they can block your path.</li></ul><ul><li>Wandering ghost : Can talk, wanders in specific areas, has a chasing limit area, dangerous.</li></ul><ul><li>Berserk Ghost : Will appear if you trigger something, can't be avoided, chases you, extremely dangerous.</li></ul><br/><br/><ul><li>Watch your back!!</li></ul><ul><li>Shout command can be useful if you use it in the right place</li></ul><ul><li>Hide before wandering ghost sees you</li></ul><ul><li>Master your run to avoid  wandering ghost's attack</li></ul><ul><li>Health and Stamina Potions can increase your survivability</li></ul><br/><br/>Hello I'm Zhero, the creator of this game : LIRE. I've been working on this project since 2018 from scratch. Because lack of budget, I split this game into several chapters with the hope that I can eventually get enough funds to develop this game continuously. With your support this game will certainly get updates to improve the story, in game quality, assets, puzzles, mechanics and much more.", "metacritic": null, "released": "2021-03-17", "tba": false, "updated": "2021-03-19T03:47:53", "background_image": "https://media.rawg.io/media/screenshots/d70/d703359bea1298b963d014b5f89ba86a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 376, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ZheroIsland"], "genres": ["Adventure", "Indie"], "publishers": ["ZheroIsland"], "esrb_rating": null}