{"id": 573235, "slug": "orkana-conflict-vr", "name": "ORKANA CONFLICT VR", "name_original": "ORKANA CONFLICT VR", "description": "Orkana Conflict VR  <br/>\n<br/>\r\nStory:<br/>\r\nWe are in a distant future and you take the role of a commander of the Earth fleet.<br/>\r\nDeployed on the planet Orkana, we are ordered to mine raw materials and secure the territory.<br/>\r\nIn the beginning it becomes clear that the planet is not abandoned and that an evil force has control over the living creatures.<br/>\r\nIt seems obvious that the conquest of the territories will be prevented by an aggressive enemy.<br/>\r\nIt will therefore be your task, as commander of the force, to bring this enemy to its knees and bring the planet and its resources into the hands of humanity.<br/>\r\nDecide the Conflict on Orkana for us and conquer the planet for humanity.<br/>\n<br/>\n<br/>\r\nGameplay:<br/>\r\nOrkana Conflict VR combines and connects the typical \"3rd person perspective\" with the \"first person perspective\" for the first time.<br/>\r\nYou mine resources, create various buildings and units like in a typical RTS game, and command them from the air.<br/>\r\nBut then you also have to play actively in the first-person mode and remove obstacles, help your army fight and find a way to defeat the aggressive enemy.<br/>\n<br/>\r\nOrkana Conflict does not want to create the depth of a full RTS game.<br/>\r\nThere is no deeper upgrade system or hours of base building or mass battles with hundreds of units.<br/>\n<br/>\r\nInstead, the focus is on a small 20-25 stong army that should be used tactically smart to overcome the obstacles together with the player and win the territory of the enemy for themselves. Can you force the enemy to his knees ?<br/>\n<br/>\n<br/>\r\nFeatures:<br/>\r\nOrkana Conflict is a 1 man project and was developed by me. The total development time was almost 2.5 years. Orkana Conflict includes a campaign with 5 missions that have a total playing time of about 5 -7 hours. However, you can play the game in 3 difficulty levels and so play much longer.<br/>\n<br/>\n<br/>\r\nHighlights<br/>\r\n- new VR game concept that switches between first-person person perspective and the 3rd person perspective to get to the goal.<br/>\n<br/>\r\n- typical basic setup of a RTS building game with base,houses,barracks,vehicle factory,defense facility....<br/>\n<br/>\r\n- build tanks,soldiers,various vehicles and face the mutant orcs,enemy vehicles and creatures.<br/>\n<br/>\r\n- Simple action elements for first person mode like simple weapons,VR hands interactions,switches,grenades,bombs to help the army.<br/>\n<br/>\r\n- 5 missions, each representing a territory to conquer, and requiring a tactical and combined effort of the player with his army.<br/>\n<br/>\r\n- Ministory that is advanced during the missions by subtle hints in exploring the game world or mission description.<br/>\n<br/>\r\n- Missions in English and German<br/>\n<br/>\n<br/>\r\nNote for Windows Mixed Reality Headsets users : please check the discussions for current support status.Thank you :)", "metacritic": null, "released": "2021-03-17", "tba": false, "updated": "2021-03-19T03:42:07", "background_image": "https://media.rawg.io/media/screenshots/e9b/e9b7e8cd42e383b34bef67ccdb30c67b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 498, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Adem Kaya RockAKGames"], "genres": ["Action", "Adventure", "Strategy", "Simulation", "Indie"], "publishers": ["Adem Kaya"], "esrb_rating": null}