{"id": 573270, "slug": "emergency-call-112-the-fire-fighting-simulation-2", "name": "Emergency Call 112 – The Fire Fighting Simulation 2", "name_original": "Emergency Call 112 – The Fire Fighting Simulation 2", "description": " is the consequent further development of the successful first part, which lets every Firefighter Fan experience the way a professional fire brigade works.<br/>The second part was also developed in cooperation with the Mülheim fire department and the support of our active  Community. We would like to thank you for your support and want to continue to include your feedback in the future.<br/><br/>The now completely newly created game world ensures more realism and atmosphere while fulfilling the diverse tasks that await you. Whether with small emergency vehicles or with an entire fire truck to fight roof truss fires, you are always in control of the action.<br/><br/>For this purpose, the control system was expanded to include a tactical mode in addition to the ability to change the task force at any time. You can switch to an overview and organize the location, post-alarms and give commands to the AI-controlled colleagues.<br/>The emergency vehicles have been completely revised and many functions have been added. New vehicles are added to reflect the current fleet of the Mülheim an der Ruhr fire department.<br/>Start your 24-hour shift individually or with other fire service enthusiasts in multiplayer mode and experience the fire service profession in all its exciting facets.<br/><br/><br/><br/>Various features turn the simulation into a realistic gaming experience with challenging tasks.<br/><br/> Open game world without loading times for a smooth gaming experience<br/> Working in a team with AI-controlled emergency services<br/> Possibility to take on the role of another emergency worker at any time<br/> Multiplayer with hot-join function and optional dedicated servers<br/> Control over the operational process through tactical overview<br/> Challenging fire truck operations with special traffic rights<br/> Diverse missions from the areas of save-extinguish-rescue-protect<br/> Simulation of 24-hour operations with line up and vehicle takeover<br/> Radio traffic during the mission and on site<br/> Replica of guard 1 of the Mülheim an der Ruhr fire department<br/> Modding support such as vehicle paintwork and much more<br/><br/><br/><br/>Become acquainted with the job of a firefighter and experience in different employments the multifaceted everyday life of the professional fire-brigade<br/><br/> Container fires<br/> Small scale fires<br/> Car and truck fires<br/> Apartment fires<br/> Roof truss fires<br/> Traffic accidents<br/> Emergency doorways<br/> Pump usage<br/> Pruning saw usage<br/> Animal rescue<br/> Oil traces<br/> Roadway cleaning<br/> Formwork<br/><br/><br/><br/>The listed vehicles can be controlled by the player. Further vehicles are also in the game and support the player during missions. <br/><br/> Command car (KdoW)<br/> Command vehicle (ELW)<br/> Laddertruck (DLK)<br/> Extinguishing group vehicle (LF24)<br/> Tank fire engine (TLF)<br/> Small emergency vehicle (KEF)<br/> Ambulance (RTW)    <br/><br/><br/>", "metacritic": null, "released": "2021-03-18", "tba": false, "updated": "2021-03-19T04:09:29", "background_image": "https://media.rawg.io/media/screenshots/191/1911b3b18865479ba77db378acc33da6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4, "toplay": 1, "dropped": 1, "playing": 1}, "playtime": 6, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 418, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Crenetic"], "genres": ["Action", "Simulation", "Casual"], "publishers": ["Aerosoft"], "esrb_rating": null}