{"id": 573499, "slug": "coin-droid-by-sander-alsema", "name": "Coin Droid by Sander Alsema", "name_original": "Coin Droid by Sander Alsema", "description": "<p>--- Coin Droid ---</p>\n<p>Written by Sander Alsema for the 10-liner competition 2021.</p>\n<p>Language: Commodore 64 Basic v2</p>\n<p>Category: PUR-80</p>\n\n<p>--- Description &amp; Instructions ---</p>\n<p>In the distant future, well after the cryptocurrency era, people have</p>\n<p>rediscovered the value of physical money. Coins made of a variety of metals</p>\n<p>have found a home in the hearts and minds of the general public. Banks are</p>\n<p>still the institutes first associated with financial activities of course,</p>\n<p>and The First Planetary Bank is no exception.</p>\n<p>This is where Marvin is employed. He is only a 17th class android, but he</p>\n<p>is ambitious. Besides electronic sheep, he dreams of one day becoming a 1st</p>\n<p>class android. You can help him achieve this. Using a special branch, found</p>\n<p>in a nearby forest one day, jab the various coins in the correct deposit</p>\n<p>boxes, as they fall from the ceiling.</p>\n<p>Every time you sort a coin correctly, you class rating increases. Besides</p>\n<p>that, Marvin moves up one position, making it harder to sort the next coin.</p>\n<p>However, if you make one mistake or if you have reached 1st class status,</p>\n<p>then you are finished and get an evaluation.</p>\n<p>To use the stick, press:</p>\n<p> - \"S\" to jab softly.</p>\n<p> - \"H\" to jab hard.</p>\n<p>The main objective of the game is to achieve a 1st class rating, by sorting</p>\n<p>the coins correctly. Their value is of no importance to you, since the</p>\n<p>money belongs to the bank and not to you. Should you be interested,</p>\n<p>however, here is what their worth:</p>\n<p> - A bronze coin only has sentimental value.</p>\n<p> - A silver coin is worth 10 Ningis.</p>\n<p> - A golden coin is worth 20 Ningis.</p>\n<p>Consult your copy of The HitchHiker's Guide To The Galaxy to learn their</p>\n<p>current exchange rate.</p>\n<p>--- Code Explanation ---</p>\n<p>Line 0: Read data for the following strings: falling down coin, moving to</p>\n<p>        the right coin, the colours brown, light grey and yellow, top part</p>\n<p>        of the android, bottom part of the android, jabbing stick, coin</p>\n<p>        deposit boxes and class rating text.</p>\n<p>        Make a string with quotation marks.</p>\n<p>        Build the final android string with both part strings and the</p>\n<p>        quotation marks string.</p>\n<p>Line 1: In a loop, create the partial background string which also doubles</p>\n<p>        as a vertical orientation string.</p>\n<p>        Also in this loop, create the android arm string.</p>\n<p>        Complete the background string with the coin deposit boxes string.</p>\n<p>        Complete the arm string with the jabbing stick string.</p>\n<p>        Set a variable for the android height/class.</p>\n<p>        Set a variable for the android arm length.</p>\n<p>Line 2: Clear the screen, display loose change amount, the background</p>\n<p>        and the android,</p>\n<p>        Set a variable for the vertical position of the coin.</p>\n<p>        Set a variable for the horizontal position of the coin.</p>\n<p>        Set a variable with a random value that represents the colour of</p>\n<p>        the coin.</p>\n<p>Line 3: Display the arm and the falling coin.</p>\n<p>Line 4: If the falling coin has reached the altitude of the arm and the</p>\n<p>        arm is stretched, then animate the coin moving to the right, above</p>\n<p>        one of the other deposit boxes.</p>\n<p>        This line also contains data for the falling coin string.</p>\n<p>Line 5: Set background colour to black.</p>\n<p>        Retract arm.</p>\n<p>        This line also contains data for the following strings: Moving</p>\n<p>        to the right coin, the colours brown, light grey and yellow and</p>\n<p>        the top part of the android.</p>\n<p>Line 6: Read the keyboard.</p>\n<p>        If the key pressed was \"S\" or \"H\" and the arm is retracted, then</p>\n<p>        stretch the arm and set a variable with the horizontal position</p>\n<p>        of the second deposit box. If the key pressed was \"H\", then set</p>\n<p>        this variable with the horizontal position of the third deposit</p>\n<p>        box.</p>\n<p>Line 7: Let the coin drop one position.</p>\n<p>        If the bottom of the screen has not yet been reached, then jump</p>\n<p>        to line 3.</p>\n<p>        This line also contains data for the following strings: bottom</p>\n<p>        part of the android, jabbing stick, coin deposit boxes.</p>\n<p>Line 8: If the coin has fallen in the correct deposit box, then adjust the</p>\n<p>        loose change amount and increase the android height/class. If the</p>\n<p>        android has not yet reached the top of the screen, then jump to</p>\n<p>        line 2.</p>\n<p>        This line also contains data for the class rating text string.</p>\n<p>Line 9: Clear the screen, display loose change amount and the class rating.</p>\n<p>        Wait for a key to be pressed.</p>\n<p>        Restart the game.</p>\n<p>---</p>", "metacritic": null, "released": "2021-03-18", "tba": false, "updated": "2021-03-19T05:31:03", "background_image": "https://media.rawg.io/media/screenshots/d55/d552f8d89651486b2898eca6d53fc478.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 22, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BASIC 10Liner"], "genres": [], "publishers": [], "esrb_rating": null}