{"id": 573771, "slug": "einuss-arena", "name": "Einus's Arena", "name_original": "Einus's Arena", "description": "<p>CONTROLS - </p>\n<p>Use the W-A-S-D keys to move, left click to shoot, and tab or esc to pause the game.</p>\n<p>Run and gun your way though endless waves of eyeball monsters! Enemies will get tougher over time, but you will get stronger and faster by picking up random power-ups from your slain enemies!</p>\n<p>For the best experience, wear headphones so that you can hear enemies coming from behind you!</p>\n\n<p>Einus's Arena is an arcadey arena FPS game, heavily inspired by the game Devil Daggers. Also, it's my first game! Initially I uploaded somewhere else, but now it's here on itch along with some touch-ups.</p>\n<p>The gameplay involves a lot of running and gunning with non-hitscan projectiles. As the game progresses, the number of enemies increases quite a lot. But as you defeat enemies, they will randomly drop power-ups that make you stronger! It's almost like a traditional top-down shooter, but in first person.</p>\n<p>Being my first game project, I had several core concepts that I wanted to implement in this project. The code for the controller was taken from a public Unity project that was on the now-defunct Unity Connect website, but required many modifications. This helped me a lot with learning about physics and translating input into actions within the code.</p>\n<p>I also wanted to learn about shader scripting in HLSL, which turned out very well in my opinion. I'm very happy with the overall look and feel over the graphics in my game. Programming my shaders from scratch really helped me understand what would be posisble for the visual aesthetics of the game. www.ronja-tutorials.com was an invaluable resource for this.</p>\n<p>Finally, I wanted to experiment with some game design elements that I've seen in other games. In particular, I wanted to see how the wave-based gameplay of Devil Daggers worked in conjunction with stackable power-ups, which often appear in rogue-likes or other arcadey games. Devil Daggers provided the main inspiration for the mechanics of Einus's Arena, especially the rapid-fire non-hitscan projectiles, the focus on large amounts of small enemies spawned by bigger enemies, the small open arena, and the focus on sound design.  </p>\n<p>I was also inspired by the creative kinds of power-ups that I saw in Risk of Rain 2. Stacking power-ups provide a great sense of progress, since each power-up will have a visible effect on the player. It also allows for crazy runs where you get lucky and have one power-up stacked a bunch of times, which can scale the power-up to ridiculous lengths. </p>\n<p>Overall, it was a big challenge to balance the power-ups and enemies, but I'm happy with how the game turned out. It might be a bit too difficult in the beginning and too easy in the later stages, but that gives it an interesting sense of power-scaling in my opinion.</p>\n<p>Also, the music in this game was all created by the mysterious @Wolfgang Fuckface. Check out his Soundcloud for more scrumptious beats like the ones you heard in-game! 🎶🎶🎶</p>", "metacritic": null, "released": "2021-03-17", "tba": false, "updated": "2021-03-19T06:32:11", "background_image": "https://media.rawg.io/media/screenshots/1f2/1f24b060277ab2ab2d88d1b3072bc8d6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 166, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["einus"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}