{"id": 573732, "slug": "simple-language-system", "name": "Simple Language System", "name_original": "Simple Language System", "description": "<p>Controls:</p>\n<p>Space/A                 - Jump</p>\n<p>Alt/B                        - Sprint</p>\n<p>Tab/Start               - Toggle Tutorial Menu</p>\n<p>Esc                             - Quit</p>\n<p>Hold Shift/L1    - Toggle Speech Mode</p>\n<p>M key                     - Toggle mouse lock</p>\n<p>This demo is a simple Character Speech system designed in Unreal. The sound events are handled by FMOD, while the logic is processed by Unreal's Blueprint system. My hope for this project was to create a new way of item acquisition and world immersion other than just simply killing an enemy or listening to dialogue. Not only does this provide something interesting for the player to do while interacting with NPC's, but this can also help train them for interaction in multiplayer environments, where historically communication is limited to gesture, text or VOIP systems. All have their perks and drawbacks. This demo is aimed at providing a competing system that provides a new dimension of player expression.</p>\n<p>This demo is limited to only 4 phonemes for simplicity's sake. However, 4 phonetic inputs can still produce quite a few words. If we calculate 4^4, we end up with 256 possible 4 character strings. In a small video game world, that should be able to cover most important items and characters. The nice thing about language is you can create conventions to compartmentalize information. You can establish rules that items always start with a particular phoneme(64), while bosses or world locations start with a different one, or maybe a faction of enemies always has two particular phonemes in their name. These systems should help make it easier for the player to pick it up they play. The character's lack of knowledge of the language could even be integrated into the story. For example they could be a sailor shipwrecked on an island and the natives there speak a completely different language. Learning how to talk to them could become a system of progression.</p>\n<p>This system may become tedious if it gets in the way of routine tasks, for example if the player needs a long list of items from a merchant. Precautions must be taken to prevent the player from accessing quality of life systems.</p>\n<p>The PVE and NPC components of a world act as a training ground for player to player interactions in online games. Associating a string of symbols in game with a certain key item makes it easier for people to communicate if there's no other means, which usually is the case. If you have NPC's that have simple dialogue systems, the player hopefully should pick it up and use it to talk with other players. They'll be able to request and trade items, or warn each other about enemies that are just around the corner. If the language system is flexible enough, players/developers may even be able to codify language to convey abstract concepts to one another. These would be useful in combat scenarios that require the player to keep moving while communicating on the battlefield or hanging out in the towns and just talking.</p>\n<p>Another perk of this system is its ability to cross language barriers and improve accesibility. A simple, easy to learn language that a person can pick up can provide players from across the globe a lingua-franca to communicate where the other methods don't have that same ability. This could also cut down on hiring translators to re-do dialogue. People who may have speech or learning disabilities would now have a new opportunity to communicate with others, provided the language is easy enough to learn. For the deaf and hard of hearing, it is a good idea to have something visual that indicates what the player is saying. In this demo, the player emits a particle that corresponds with the phoneme they speak every time they speak for visual confirmation.</p>\n<p>Voice systems like these will make it easier to moderate online interaction. VOIP and text is too much to moderate given the size and scope of most online environments. One solution some companies come up with is to have pre-determined words or phrases a player is allowed to string together, but that system is fairly limited and rarely fits the situation. This demo breaks that solution down even further and gives it a more polymorphic state with the hope that it can be more useful in a wider context. It could also help to equalize random encounters, giving solo players some ability to communicate with team mates even if they're up against players who are more organized and on mic.</p>\n<p>Areas of further study:</p>\n<p>The system can be further developed by adding modifier buttons to provide access to more characters. Character combinations with simultaneous presses can also be programmed to modify the existing phoneme and produce a new one. Adding more phonemes/characters could make room for number systems which would be useful for numerous reason.</p>\n<p>An interesting writing system to study would be Hangeul because it incorporates the phonemes in a very direct way. A similar system could be used to facilitate word recognition. It could make for a visually interesting particle system where the characters morph together in real time to produce recognizable words.</p>\n<p>Resources:</p>\n<p>Foods were free downloads from the \"Food Pack\" from the Unreal Assets Store.</p>\n<p>Character model and level template provided by \"Dev Enabled.\" You can check out their channel at youtube.com/channel/UCL1jcpKRApOp_CkW9LkFRKA. They have a website at: devenabled.com and a twitter at: twitter.com/robbcreates.</p>", "metacritic": null, "released": "2021-03-17", "tba": false, "updated": "2021-03-19T06:23:52", "background_image": "https://media.rawg.io/media/screenshots/b84/b8416cf9fe79bc361c06b26b1cf6a41f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 16, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["techdemos"], "genres": [], "publishers": [], "esrb_rating": null}