{"id": 573742, "slug": "sweet-frenzy", "name": "Sweet Frenzy", "name_original": "Sweet Frenzy", "description": "Install instructions<p>All assets are credited in the credit section of the game.  Instructions of the game are also told within the game.   Lastly, although the concept of my game is pretty much the same I will say I had to scratch off the seasonal candy ideas going a different route with a casual regular candy Tetris game with tracked high scores personalized from you playing the game.  I still made levels though, where the difficulty can be adjusted through the slider at the game menu(0 being lowest, 9 hardest). You automatically proceed to the next level if you get 10 lines in one game(Until you lose, or reach level 9 which is super quick that you'll definitely lose there).  In the end, all your high scores can be seen once you return to the menu screen from the top 3. Overall decided to change the name from Sweet Seasons to Sweet Frenzy since if I kept it at Seasons it would not make sense after scratching out that idea.</p>\n\n<p>**The game is put as a download standalone since it's meant to be played at 1920 * 1080.  I tried to put it in the browser to play for easier access, but needless to say, the change of needed resolution to play in the browser made my game unplayable(Buttons pressing at weird spots, and screen view completely off where you could not see the necessary stuff from the game).  So overall I stuck with putting the standalone build here in itch.io since it works that way without any issues.</p>", "metacritic": null, "released": "2021-03-17", "tba": false, "updated": "2021-03-19T06:26:02", "background_image": "https://media.rawg.io/media/screenshots/35d/35d68080395e870bae8e1634c448f724.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 18, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["HTGFANTASY"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}