{"id": 574174, "slug": "kingdom-builders-alpha", "name": "Kingdom Builders (alpha)", "name_original": "Kingdom Builders (alpha)", "description": "Build your Kingdom in this mix of a City-Builder and Action-RPG!\r\n<p>Build your kingdom building by building, having villagers join your side. Lead them to expand your empire, defeating foes hindering your empire's growth.<br/></p>\n\n<p>This game is still in development and currently in Alpha state. We're building this game together with our community! So join us on Discord, tell us what you think about Kingdom Builders and what features you want to see added.<br/></p>\n\r\nMain Features:\r\nLoyal companions that help you with everything!\r\n\n<p>Your villagers follow you and help you with everything! Chop down a tree, and they will chop wood aswell. Attack an enemy, and they will do the same.</p>\r\nBuild your settlement\r\n\n<p>Build houses, farms, blacksmiths and many other buildings to create a kingdom to your liking.</p>\r\nFight off foes on your adventures\r\n\r\n<p>Encounter different enemies on your explorations. Make sure to make preparations by crafting weapons at the blacksmith for your group.</p>\n\r\nOther Features:\r\n<ul><li>Smart Companions, that follow what you do</li><li>Setup Productions to fulfill your villagers needs</li><li> Explore different areas to find more resources and items</li><li>Return with your loot and expand your settlement</li><li>Relaxed playstyle - no time limits, or overly complicated management stress</li></ul>\r\nAlpha Version\r\n<ul><li>This game is still in development and will change a lot over time</li><li>Eventually, the game will be released on Steam in early access</li><li>even during early access, we will change and expand the game</li><li>for now, the alpha version is free, the early access version, however will not be free</li><li>when we go into early access, we might make the game paid on itch.io as well</li></ul>", "metacritic": null, "released": "2021-03-16", "tba": false, "updated": "2021-03-19T08:12:24", "background_image": "https://media.rawg.io/media/screenshots/7f3/7f356403b9a77a5bed361ae6e478496d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 96, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ebb & flow games"], "genres": ["RPG", "Strategy", "Simulation"], "publishers": [], "esrb_rating": null}