{"id": 574554, "slug": "battle-math", "name": "Battle Math", "name_original": "Battle Math", "description": "<p><em>Battle Math</em> is a dead simple game to help the cool kids learn their arithmetic. Add, subtract, multiply, and divide Snedronningen the Snow Queen to victory over the knight from the frozen wastes of Spitsbergen.  <strong>FYI: Snedronningen is a third-wave feminist so check the trailer before you fire up Battle Math.</strong></p>\n<p>As far as the gameplay goes, you choose an attack (or healing) and it will ask a question. Click where it says \"Your answer\", type it in <em>numerically</em>, and hit Enter. Answer correctly and your attack lands; answer incorrectly and suffer a terrible embarassment. Then click on the shield and answer a question to defend. (These will always be multiplication, but I'm thinking about changing it to be user selectable in the Parents menu.) Repeat until one of you are vanquished, then keep fighting until you know your times tables!\r\n </p>\n<p> You can set the factors to whatever range you like in the Parents menu or reset them to their defaults. \r\n </p>\n<p> The correct answer will be displayed if you get the question wrong.\r\n </p>\n<p> If people like it, I might just keep on plugging and add timers, additional enemies (maybe even some Mortal Kombat-style Towers), power-ups and a bit of story. Let me know in the comments if there's something you'd like to see. \r\n </p>\n<p> Made in Unreal. \r\n</p>", "metacritic": null, "released": "2021-03-15", "tba": false, "updated": "2021-03-19T09:39:49", "background_image": "https://media.rawg.io/media/screenshots/254/254e488b27b5a77ceec4997794d84696.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 142, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Left Turn Workshop"], "genres": ["Educational", "Fighting"], "publishers": [], "esrb_rating": null}