{"id": 574598, "slug": "super-witch-hunter-pro", "name": "Super Witch Hunter Pro", "name_original": "Super Witch Hunter Pro", "description": "<p>Don the spiffy buckled hat of Hopkins - a Puritan novice witch hunter. </p>\n<p>Keep the crowds (and Father Horatio) appeased with a steady stream of heretical souls, cleansed by raging flame.<br/></p>\n<p>How will history judge your actions? The hero of today is oft the villain on the morrow...</p>\n<p><strong>Goal</strong><br/>-Burn as many Witches to death as possible on the Pyres placed throughout the village to earn Purification Points.<br/>-If left long enough, Witches will escape. Escaped witches will reduce your Piety. If your Piety reaches zero, game over!<br/><br/><br/><strong>Controls &amp; Tips</strong><br/>-Use the arrow keys or W,A,S,D to move about the village.<br/>-Use P to pause the game.<br/>-Stand close to Pyres to start a fire and accelerate fire growth. The Pyre must have wood (and a Witch!) to start a fire.<br/>-Witches cannot escape while the Pyre is burning. Fire will diminish over time if left unattended.<br/>-Burning a witch to death or letting her escape will consume all wood from a Pyre. Gather extra wood from convenient Wood Piles at several locations.<br/>-Make sure to keep each Pyre stocked with wood so you're ready to start each fire when the Witch appears.<br/>-Righteous Speed power-up will help you cover more ground.<br/>-Holy Fire power-up will increase all active fires, and light any valid Pyres.<br/>-Chain together several completed Witch burnings to increase your Purification Point multiplier.<br/>-Banish the Goat Warlock for bonus points!</p>\n<p><strong>Game by:</strong><br/>Jerry Verhoeven https://twitter.com/JerryVerhoeven<br/>Ben Kerslake https://twitter.com/benjkers</p>\n<p>Made for Ludum Dare 25 - \"You are the Villain\"</p>", "metacritic": null, "released": "2021-03-15", "tba": false, "updated": "2021-03-19T09:50:39", "background_image": "https://media.rawg.io/media/screenshots/1b5/1b5c7b2ed68f3daa1595794c31e00ba4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 156, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jerry Verhoeven"], "genres": ["Action"], "publishers": [], "esrb_rating": null}