{"id": 5745, "slug": "the-legend-of-holy-archer", "name": "The Legend of Holy Archer", "name_original": "The Legend of Holy Archer", "description": "------------------------------------------------------------<br/>*** To All Customers Using iOS 9 ***<br/><br/>Thank you for playing SummerTimeStudio games.<br/><br/>Many reports have been coming in concerning<br/>apps not working properly on devices running iOS 9.<br/><br/>After investigating the issue, problems have been<br/>discovered with the following operating systems:<br/>a. iOS 9.0<br/>b. iOS 9.0.1<br/>c. iOS 9.0.2<br/><br/>We are currently working on fixing the problem.<br/>Once a schedule for the fix has been established,<br/>we will put out another notice.<br/><br/>We apologize for the inconvenience and ask for<br/>your patience while we focus on fixing the problem.<br/>------------------------------------------------------------<br/><br/>The 6th game brought to you from your favorite Okinawan mobile device game developers, SummerTimeStudio.<br/>We have constructed a beautiful world using console game engine technology. <br/>You can control holy arrows through the sky with just your finger.<br/><br/>Description:<br/>Once upon a time, a giant evil hole suddenly appeared in the outskirts of the legendary kingdom.<br/>From that portal out came the monsters that have only existed in legends and folktales.<br/>Then one archer with the ability to shoot holy arrows was summoned by the king to fight against the approaching monsters before they reach the kingdom. Fight as the Holy Archer to regain the peace that was lost to the forces of evil.<br/><br/>- You can play this game with a single finger. <br/>- Damage and destroy your enemies before you run out of arrows.<br/>- There isn’t a single route to clear a stage, find different paths and explore.<br/>- There are Gold, Silver, and Bronze treasure chests placed around the map. Hit them to uncover what is inside.<br/>- There are 10 monsters in all, find their weak points to take them down efficiently. <br/>- Maximum graphic quality, switch between 3 quality levels to experience the best graphics mobile games can offer.<br/><br/>-------------------------------------------------------<br/>【Recommended Model】<br/>On and after iOS 5.0.<br/>On and after iPhone 4S.", "metacritic": null, "released": "2013-04-19", "tba": false, "updated": "2019-10-22T14:28:17", "background_image": "https://media.rawg.io/media/screenshots/42f/42f1147ff1895cd16a6bba64d681561c.jpeg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 246, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["SummerTimeStudio Co,.Ltd"], "genres": ["Action", "Arcade"], "publishers": ["SummerTimeStudio Co,.Ltd"], "esrb_rating": "Teen"}