{"id": 574624, "slug": "escape-from-heaven-valerio-marty", "name": "Escape From Heaven (Valerio Marty)", "name_original": "Escape From Heaven (Valerio Marty)", "description": "<p>Escape from Heaven is my first year's (2018-2019) school project, made solo over the span of 4 months.</p>\n<p>Everything in the game is made by me, and the whole focus of the Game and Level Design orbits around the grapple mechanic, pun intended.</p>\n<p>This game is a short 1-level platformer with heavy use of the grappling hook, which can be used to swing and propel the player, as well as dodging. The level was built using a series of preconstructed rooms laid out in the world, which were designed with the grapple in mind, making sure the player has multiple movement options for both traversing and combating. The objective is simply to find and beat the Boss, and the player has a sword, a gun, and a map to do just that.</p>\n<p>Most of the development time was used making sure the grapple felt just right and integrated into the world, both on a gameplay and aesthetic level. For example, the trail of particles is not just some pretty addition but helps emphasize the movement that can be achieved with the grapple and feels rewarding when the player is able to move smoothly, generating pretty circular patterns. Special attention was given to the control scheme because for a player, playing with physics can be a steep enough curve, the grapple control must feel intuitive en easy to use. For this reason, the grapple can be controlled with just a secondary button, right-click by default. A single click acts as a swing and lets the player move around the pivot point, click and hold on the other hand also retracts the grapple, so you can climb up to the pivot. There is also a constant range indication and the right-left direction is calculated based on your initial verticality relative to the pivot point the moment you first grapple: Grappling from below and pressing right will make you move anticlockwise while grappling from above will do it clockwise, this way it feels fluid and new players don't have to think about which keys to press, it just comes out naturally.</p>\n<p>As a first year project, the level design wasn't my forte at the time, but as time passes on I might consider creating a successor to this project with proper level design that makes much better use of the uniqueness of the grappling hook because I feel there is a lot of untapped potential.</p>\n<p>Music is by me but it wasnt made from this project, I just reused it and that's why it doesnt really fit at all.</p>\n<p>Controls:</p>\n<ul><li>WASD to move</li><li>Space to jump</li><li>M for map</li><li>Esc for options</li></ul>\n<p>This game was also shown at our school's (ESI Murcia) stand at Salón del Manga de Murcia 2019, a manga/anime/videogame convention, in which I was pleasantly surprised when it gathered plenty of attention.</p>", "metacritic": null, "released": "2021-03-15", "tba": false, "updated": "2021-03-19T09:57:54", "background_image": "https://media.rawg.io/media/screenshots/cac/cacd92bc7a86ccfe3a1ad8fbd9f1810f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 81, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Valerio Marty"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}