{"id": 574638, "slug": "bear-warfare", "name": "Bear Warfare", "name_original": "Bear Warfare", "description": "<p>Have you always wanted a quick way to burn through all your loose change on your phone?<br/><br/>Here it is: a Bear Warfare arcade game!<br/><br/>Bear Warfare is a touch-based game that has extremely simple game mechanics. Its gameplay revolves around a single mechanic of requiring players to deftly tap on the screen in order to keep the onscreen bear avatar in flight to collect coins while avoiding a series of obstacles.<br/><br/>Let your bear avatar fly and collect as many stars as possible through the other bears and obstacles.<br/><br/>Collecting each coin gets you one point.<br/><br/>The higher scores, it will have more new obstacles and you need a deftly tap.<br/><br/>Play and try to get the best score to challenge other players from all over the world on the social networks!<br/><br/>You only need to tap the screen to let your bear fly up: it's easy and fun!<br/><br/>Sounds easy, right?<br/>Oh, one problem though... other stray bears are on the loose and flying on your phone screen!<br/><br/>Be careful, Flying Bears is grumpy; better not hit it unless you are deftly in hitting their balloon to make them fall!<br/><br/>In a few words: Avoid or make other bears fall by hitting on their balloon. Be aware of other bears and other obstacles ! Don't touch them!<br/><br/>Bear Warfare!<br/><br/>Free to Play:<br/><br/>The game is completely free to play! Woo! With that said, because computers have yet to evolve far enough to make games themselves, we still need to feed, clothe and I guess, pay our developers... so we do use a wee bit of advertising to monetize the experience. Nothing too obnoxious, just the occasional ad.</p>", "metacritic": null, "released": "2021-03-15", "tba": false, "updated": "2021-03-19T10:02:23", "background_image": "https://media.rawg.io/media/screenshots/670/670fc70921da715cac65b3ddd452fe0d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 16, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["amepropre"], "genres": [], "publishers": [], "esrb_rating": null}