{"id": 574790, "slug": "anime-arena-infinite-war", "name": "Anime Arena: Infinite War", "name_original": "Anime Arena: Infinite War", "description": "<strong>ANIME ARENA: INFINITE WAR</strong> is a unique action rpg game with survival elements. Zombies are everywhere and you are the only one who can defeat them! Take a cute anime girl under your control and fight against hordes of zombies. Earn money and gain experience to buy various upgrades and perks.<br/><br/><br/><strong>MIGHTY BOSSES</strong><br/>Defeat all super bosses to complete your goal. And be sure it won't be easy!<br/><br/><br/><strong>ZOMBIES ZOMBIES ZOMBIES</strong><br/>Fight your way through the 50 unique zombie enemies. They could be funny and silly but still are very deadly!<br/><br/><br/><strong>CUSTOMIZATION AND EMOTES</strong><br/>Dress up your girl as you like! Clothes, outfit, color and even bikini. Combinations are limitless! <br/>Also defeat small bosses to unlock various emotes. Let your anime girl be truly alive!<br/><br/><br/><strong>PERKS AND UPGRADES</strong><br/>Your power is infinite. Buy upgrades with money or perks with level ups and become the most powerful anime girl!<br/><br/><br/><strong>ANIME STYLE</strong><br/>Everybody loves cute anime girls! Take one under your control and let the others be your companions. <br/><br/><strong>INFINITE MODE</strong><br/>Test your skills against an infinite waves of zombies in this special mode. How long could you survive?<br/><br/><strong>BLOODY ARENA</strong> <br/>Kill dozens of zombies with a single sword hit. Make these ragdoll dummies fly off with fountains of blood!<br/><br/><strong>HARDCORE ARENA</strong><br/>Your every movement and action matters when enemies outnumber you. This arena won't spare you!<br/><br/><strong>DOUBLE SOUNDTRACK</strong><br/>Two soundtracks in a single game! What would you choose, hard rock rhythms or relaxing ambient music?<br/><br/><strong>500 LEVELS</strong><br/>Survive on 500 levels and kill all super bosses to defeat this zombie threat once and for all!", "metacritic": null, "released": null, "tba": false, "updated": "2024-01-04T23:00:17", "background_image": "https://media.rawg.io/media/screenshots/2b8/2b8200585fa2e66c528b876a3fcb1a5f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 411, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["PaulArt"], "genres": ["Action", "RPG", "Indie"], "publishers": ["PaulArt"], "esrb_rating": null}