{"id": 574765, "slug": "zorro-the-chronicles", "name": "Zorro: The Chronicles", "name_original": "Zorro: The Chronicles", "description": "<p>The Chronicles is an exciting and humorous action game featuring combat and exploration gameplay inspired by the likes of Arkham Asylum, Spider-Man and Assassin’s Creed.<br />\nZorro The Chronicles is an exciting and humorous action game that includes combat and exploration scenarios inspired by the TV series. The epic adventure immerses you in the world of the successful animated series Zorro The Chronicles. Protect vulnerable and innocent people from the evil general and his army. Restore justice in 19th century Spanish California.</p>\n<p>Play as a true hero and fight for justice.<br />\nYou can play as Zorro or his sister, Ines. Level up your heroes&#39; skills by unlocking new moves.<br />\nBecome a master sword fighter!<br />\nThrow your opponents off balance with your sword skills, disarm them with a whip lash or sword strike, and pull off spectacular moves! Use your acrobatic prowess and reflexes to dodge their attacks. Then leave your mark on them by drawing a &quot;&quot;&quot;Z&quot;&quot;&quot; with the tip of your sword!<br />\nMake the right choices!<br />\nExplore 18 levels and adapt your approach according to the situation and enemies. Use cunning to surprise your opponents, sneak around them and explore the surroundings, or take them on in action-filled sword fights.<br />\nColourful characters<br />\nEncounter a wide variety of prominent characters from the animated series Zorro The Chronicles. Some of them will get in your way and be formidable enemies, while others will help you in your fight for justice.</p>", "metacritic": null, "released": "2022-06-16", "tba": false, "updated": "2024-03-30T18:03:41", "background_image": "https://media.rawg.io/media/screenshots/ec8/ec876ee278eb324e4d76ff54bfc22832.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 9, "toplay": 2, "dropped": 4}, "playtime": 0, "achievements_count": 0, "ratings_count": 4, "suggestions_count": 405, "game_series_count": 0, "reviews_count": 4, "platforms": ["PC"], "developers": ["BKOM Studios", "BTC Studios"], "genres": ["Action", "Adventure"], "publishers": ["Nacon", "BTC Studios"], "esrb_rating": null}