{"id": 574776, "slug": "out-of-the-shelter", "name": "Out Of The Shelter", "name_original": "Out Of The Shelter", "description": "You have to get out of the huge bunker. You and the other players were locked in a terrible experiment. Only a few of you will be able to get out alive. You will need to travel the fastest route leaving the bunker through one of the exits, simultaneously fighting foes with improvised weapons. They will also try to stop you with all their might.<br/>\n<br/>\r\n1) Players can win by escaping through one of the exits. Each exit is accessed with a special key. The player must go though the intermediate stage, depending on path chosen, in order to leave the bunker.<br/>\r\n2) Dynamic gameplay stimulates radiation, which gradually accumulates. If you do not keep her level under control by picking up various medicine at, the character will be temporarily out of the game process.<br/>\r\n3) In addition to basic weapons, player can find various unique ones, which contribute to shooter gameplay elements.<br/>\r\n4) You can find multiple consumables, modifications and devices that make you stronger. Combining them should make your games feel unique. All items are locked in caches. Open them with 3 unique keys (should be found first).<br/>\r\n5) Ability to create weapons and consumables on the workbench for parts scattered across the level. This helps to reduce situations where the player cannot get something if they just have a bad luck.<br/>\r\n6) A large multi-level location with many workarounds. Players who know the map and love dynamic gameplay will be able to unfold their ideas to the fullest extend.", "metacritic": null, "released": "2021-03-21", "tba": false, "updated": "2021-03-22T02:17:52", "background_image": "https://media.rawg.io/media/screenshots/2af/2afe9f8d4e9c5729210c118d44dd14a0.jpg", "website": "https://vk.com/public202355325", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 224, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["IMBA Games"], "genres": ["Action", "Casual", "Massively Multiplayer", "Indie"], "publishers": ["IMBA Games"], "esrb_rating": null}