{"id": 574758, "slug": "lostwoodsrl", "name": "lostwoodsRL", "name_original": "lostwoodsRL", "description": "<strong>lostwoodsRL</strong>\n\n<p><strong>A game about getting lost,  made in a week for the 7DRL Challenge</strong></p>\n<p><strong>Music by CarlaDMusic - https://soundcloud.com/carladmusic</strong></p>\n<p><strong>Art by IKnowKingRabbit - https://iknowkingrabbit.itch.io</strong></p>\n<strong>Controls:</strong>\n<ul><li><strong>q w e<br/>a s d      - Eight-way movement (s is pass)<br/>z x c<br/><br/></strong></li><li><strong>1 2 3<br/>4 5 6      - Use item (only applicable for potions and arrows)<br/>7 8 9<br/><br/></strong></li><li><strong>t              - Take (picks up item)<br/></strong></li><li><strong>r              - Drop Mode, then press the number key for the item you wish to drop<br/></strong></li><li><strong>v              - View Mode, then press the number key for the corresponding item, or movement keys to inspect the grid.<br/></strong></li><li><strong>b              - Back (exits drop or view mode)<br/></strong></li></ul>\r\nTips:\r\n<ul><li>Every time you clear a level, a random item will drop and the doors to the next level unlock.</li><li>⚔️ is attack, 🔰 is armor (reduces damage taken by this amount), ❤ is health, 🐾 is move points. </li><li>You begin the game with a potion and 5 arrows, and you gain an additional potion and 5 arrows every level.</li><li>You can throw arrows with your bare hands, you don't need a bow. Use them early! Press the corresponding number key, navigate to the target tile, and press that same key again to shoot.</li><li>You start with a range of three tiles, and if you find a bow, it will increase your range. </li><li>You gain an item after clearing a level. There is also an additional starting item on the ground in the first level.</li><li>Taking an item does not use 🐾. If you are struggling early, rush to the starting item on the ground to pick it up.</li><li>Dropping an item destroys it, be careful!</li><li>Make sure to press v and view your items, they will inform your decision about what level to move into next. For example, the guitar will give you +1 ⚔️ for every beach area you travel to, or the bunny mask will give you +1  ❤ health every time you travel to the area to the left. If the area is both to the left and a beach, you would gain both bonuses by traveling to that area. Two guitars would also stack.</li><li>That being said, you cannot travel in the same direction twice.</li><li>You can see levels surrounding you in the top left. Your current level is in the middle of that grid, its slot is colored red. and certain levels might shift around you as you move from tile to tile.</li><li>🌲is a forest, 🌋is a mountain,  🏖️ is a beach</li><li>You will need to boost your attack in some way to win the game, due to enemy armor in later levels.</li><li>To win the game, clear the 10th level. The final fight will be different depending on the type of level you find yourself in.</li></ul>\r\nThank you so much for playing and good luck!\r\n<p><em>A special thanks to Carla, IKnowKingRabbit, Marty McFly, and Trezy for their support in the creation of this game</em></p>", "metacritic": null, "released": "2021-03-14", "tba": false, "updated": "2021-03-19T10:32:44", "background_image": "https://media.rawg.io/media/screenshots/061/061055be7e30fcd5d03293d38ecd2658.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 8, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["ontical"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}