{"id": 574830, "slug": "retro-sports-bundle", "name": "Retro Sports Bundle", "name_original": "Retro Sports Bundle", "description": "Capture the thrill of competition with this bundle of classic sports games from Accolade™ and MicroProse™! All four games are benchmarks in their genres, so if you’re an armchair athlete looking for some digital sports competition, then look no further. Prepare to grind out the yardage in 4th &amp; Inches , sink half-court shots in Fast Break , deliver punishing uppercuts in TKO , manage a stable of boxers in World Championship Boxing Manager™ , and race down the pitch in MicroProse™ Soccer .<br/>\n<br/>\n4th &amp; Inches : 4th &amp; Inches gives you all of the hard-hitting action of real football: the bombs, the blitzing, the goal line stands. Winning at 4th &amp; Inches will take all the moves of a #1 draft choice plus the tactical genius of a veteran head coach.<br/>\n<br/>\nFast Break : The 1989 basketball game in the classic Accolade™ sports series features one or two player action, 15 offensive and 5 defensive pro-style plays, and the ability to design your own plays.<br/>\n<br/>\nTKO : Now you can “enter the ring” in the classic first-person boxing game TKO from Accolade™ – the boxing game that sticks you right on the canvas, staring straight into the eyes of a prize fighter bent on rearranging your face.<br/>\n<br/>\nMicroProse™ Soccer : Go football crazy, football mad. MicroProse™ Soccer is fun and exciting to play, bringing you the chance to compete at world class level in the International Challenge or the indoor league.<br/>\n<br/>\nWorld Championship Boxing Manager™ : Do you have what it takes to conquer the boxing world? Scout, sign, and manage the training and tactics of a stable of fighters in this deep and detailed sports management sim.", "metacritic": null, "released": "2021-03-18", "tba": false, "updated": "2021-03-22T02:55:07", "background_image": "https://media.rawg.io/media/screenshots/d51/d5171815e4b1d60c960efcea76a0cb9b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 144, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ziggurat Interactive"], "genres": [], "publishers": ["Ziggurat Interactive"], "esrb_rating": null}