{"id": 574867, "slug": "xtreme-stunt-bike-racing-game", "name": "Xtreme Stunt Bike Racing Game", "name_original": "Xtreme Stunt Bike Racing Game", "description": "Are you ready for extreme tricky stunts in crazy moto bike stunt race game 2021? <br/><br/>Now time to test your bike riding skills with dirt bike games and heavy motorbikes. Select your motorcycle to join bike racing games and make impossible bike stunt game records. Balance your bike racer on a stunt bike and perform flips and impossible stunts with your new bike. Mega ramps and rolling circle and airplane crossing challenging impossible bike stunt game waiting for you. Try to keep your tricky stunt bike balance and land safely after high long ramp stunts.<br/><br/>Mega ramp stunt style motorcycle game is filled with challenging race and thrill. Show mad skills of moto crossing and do ultimate thrilling bike stunts. Top bike racing game with xtreme fever of moto race is here with many levels to play. Dirt bike racing for bike lovers filled with jumps and bumps. It's time to prove yourself as a top bike rider<br/><br/>Features：<br/>-Amazing and cool HD graphics.<br/>-Amazing sky&amp;hill tracks.<br/>-Easy and smooth control<br/>-Realistic bike 3d models<br/>-Enjoy smooth dirt bike on offroad<br/>-Most challenging offroad bike game<br/>-Thrilling bike racing on tricky trails<br/><br/>If you liked moto hill racing, you will definitely love the newest addition in the series. <br/>Become top extreme motorcycle stunts rider! Speed up the wheels and get ready for fun!", "metacritic": null, "released": "2021-02-20", "tba": false, "updated": "2021-03-22T03:18:34", "background_image": "https://media.rawg.io/media/screenshots/e57/e5789418072354d759c3d525000e6332_FLZdUj3.jpg", "website": "https://atm464d905415774ea0aa8d.adstxtmarket.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 261, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Melanie Thomas"], "genres": ["Sports", "Racing"], "publishers": ["Melanie Thomas"], "esrb_rating": "Everyone 10+"}