{"id": 574858, "slug": "soul-reaperbankai", "name": "Soul Reaper:BanKai", "name_original": "Soul Reaper:BanKai", "description": "The new generation of BLEACH-themed mobile fighting game - Soul Reaper: BanKai has come! Classic Blockbuster, Reignite the Fighting! Shinigami Assemble, Zanpakuto Bankai! It's in your home court this time!<br/><br/>Stories that have never ended, duels that have never been witnessed, the passion and emotion that have never been forgotten, the care and friendship that have never been let go, and the bond that cannot be parted, now have restarted anew!<br/><br/>Character Restoration<br/>Perfectly restores characters in the animation and reproduces the exclusive skills. All classic characters are at your fingertips, come and build the strongest Shinigami squad, make friends with other players, and fight side by side!<br/><br/>Diverse Development<br/>Character Ascension, Zanpakuto Advance. Super powerful characters adept at Strength, Technique, and Speed, and the diversified development paths give you a brand-new growth experience and allow you to experience the classic plots and touching moments of different characters!<br/><br/>Ultimate Duel<br/>Real-time duel in gyms, competing to be the best Shinigami! 3V3 Arena, strive to be the best of the server! Strategic combination, RP burst. The fighting will never go out!<br/><br/>Ultimate Fight<br/>Challenge combo hits and complete the Ult kill! Delightful fighting experience, meticulous maneuverability, and shocking action effects, Soul Reaper: BanKai perfectly interprets the soul of fighting games.", "metacritic": null, "released": "2021-02-02", "tba": false, "updated": "2021-03-22T03:14:12", "background_image": "https://media.rawg.io/media/screenshots/a0a/a0abf1d5ddd2a2c4332d3e474490f1a9_K9JVmlP.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 237, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["ALLIED BRIGHT TECHNOLOGY"], "genres": ["Action", "RPG"], "publishers": ["ALLIED BRIGHT TECHNOLOGY"], "esrb_rating": "Teen"}