{"id": 575152, "slug": "hachi-hachi-mystery-itch", "name": "Hachi Hachi Mystery (itch)", "name_original": "Hachi Hachi Mystery (itch)", "description": "<strong><em>ENGLISH</em></strong>\n<p><strong>(the game is only available in french)</strong></p>\n<p>Hachi Hachi Mystery is a student project I made with several other people :</p>\n<ul><li>Thomas Paulus (https://paulusthomas.fr)</li><li>Marie Semin</li><li>Elena Godinat</li><li>Sébastien Gallant</li><li>Charles Desouza</li><li>Océane Decamp</li></ul>\n<p>If you have any feedback you would like to give feel free to! But understand the game will most likely not be updated.</p>\r\nA new life!\r\n<p>Hey! Are you ready to start a new life? A new place, new people, and some unique new friends... Enough to start a great adventure!\r\n</p>\r\nNew friends!\r\n<ul><li>Meet Léo, a very friendly fan of manga and anime.\r\n</li><li>There is Lucille, a nice and cool person. Maybe you'll fall in love with her...\r\n</li><li>Ethan, a very popular boy with a tempered character. Will you be friend with him?\r\n</li><li>And then Emi, she is Léo's cousin and she also is in high school. She is quite the character!\r\n</li></ul>\n<em>FRANÇAIS</em>\n<p>Hachi Hachi Mystery est un jeu réalisé en tant que projet d'étude avec 6 autres camarades :</p>\n<ul><li>Thomas Paulus (https://paulusthomas.fr)\r\n</li><li>Marie Semin\r\n</li><li>Elena Godinat\r\n</li><li>Sébastien Gallant\r\n</li><li>Charles Desouza\r\n</li><li>Océane Decamp</li></ul>\n<p>Si vous désirez faire part de votre avis sur le jeu, n'hésitez pas ! Cependant, comprenez qu'il ne sera très probablement jamais mis à jour.</p>\r\nUne nouvelle vie\r\n<p>Hey ! Es tu prêt à commencer ta nouvelle vie étudiante ? Un appartement rien que pour toi, de nouvelle connaissances, de nouveaux amis et peut être des rencontres uniques... Un nouvel environnement pour vivre une aventure exceptionnelle !</p>\r\nNouveaux amis\r\n<ul><li>Rencontrez Léo, un Otaku attachant avec qui vous risquez d'avoir de sacrés débats sur vos animés préférés !<br/>\n</li><li>Retrouvez Lucille, une fille très douce et sympathique. Peut-être allez vous succomber à son charme...<br/>\n</li><li>Ethan, un garçon très populaire avec un caractère bien trempé! Allez vous réussir à vous entendre ?<br/>\n</li><li>Et enfin Emi, lycéene et cousine de Léo, aussi \"originale\" qu'énergique elle vous accompagnera dans votre nouvelle vie !\r\n</li></ul>", "metacritic": null, "released": "2021-03-21", "tba": false, "updated": "2021-03-22T04:36:16", "background_image": "https://media.rawg.io/media/screenshots/8b3/8b342ca897ccef866fd3bf8bc5254904.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 146, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["ArJe games"], "genres": [], "publishers": [], "esrb_rating": null}