{"id": 57533, "slug": "super-star-wars-the-empire-strikes-back", "name": "Super Star Wars: The Empire Strikes Back", "name_original": "Super Star Wars: The Empire Strikes Back", "description": "<p>The sequel to Super Star Wars is, as the name implies, based on Episode V: The Empire Strikes Back, the second of the original Star Wars movie trilogy. The game features familiar locations and events from the film, such as the ice planet Hoth, the search for Yoda on the jungle planet Dagobah, and the fight against Darth Vader. Several locations are expanded, adding places and boss enemies that did not exist in the movie, and certain key events in the story are omitted or changed.</p>\n<p>As in the previous game, the player is able to control three characters: Luke Skywalker, Han Solo, and Chewbacca. Unlike the first, each character has been given a distinct special move. Chewie spins a path of destruction through enemies, Han has grenades and a powerful slide, and Luke can switch to his lightsaber and block oncoming fire. Gameplay is very similar to the first game, mostly focusing on platforming elements. As before, there are Mode-7 vehicle levels, during which the player is able to pilot a snowspeeder against encroaching Imperial walkers, pilot the Millennium Falcon through the asteroid field, and break through Cloud City&#39;s defenses in Luke&#39;s X-Wing fighter.</p>\n<p>The game&#39;s other major addition is the inclusion of a suite of Force powers for Luke. They are learned by collecting hidden orbs on the Dagobah level, and add a second special bar that depletes with each usage of a Force power. Power-ups include health items, weapon upgrades, screen-clearing detonators, and orbs that restore Luke&#39;s Force power. Passwords have also been added, and are given upon completion of each of the game&#39;s 25 stages.</p>", "metacritic": null, "released": "1993-06-01", "tba": false, "updated": "2023-07-31T14:07:21", "background_image": "https://media.rawg.io/media/screenshots/293/2932cc6314d4705a277a17fda88b699b.jpg", "website": "", "rating": 4.17, "rating_top": 5, "added_by_status": {"yet": 6, "owned": 12, "beaten": 5, "toplay": 8, "dropped": 11}, "playtime": 0, "achievements_count": 0, "ratings_count": 12, "suggestions_count": 342, "game_series_count": 55, "reviews_count": 12, "platforms": ["Wii", "SNES"], "developers": ["LucasArts Entertainment", "Sculptured Software"], "genres": ["Action", "Platformer"], "publishers": ["THQ", "LucasArts Entertainment", "JVC"], "esrb_rating": null}