{"id": 575420, "slug": "last-in-space", "name": "Last In Space", "name_original": "Last In Space", "description": "How many robots will you disable??\r\n<p>You have landed to investigate a suspected rocket launch site. Its a trap! Now you must fight to survive and disable as many robots as you can!</p>\n<p>----------------------------------------------------------</p>\r\nOnly 4 blue health pickups! Use them wisely!\r\n<p>                              </p>\n<p>This project started out to learn Unreal Engine Blueprints. My game experience has been on the art side and I wanted to program my own game without learning a coding language. This game evolved into a small space shooter with some nostalgic toys. There is only one level. This is because I wanted to focus more on the polishing of the entire game in a short period of time. In doing so I learned a lot about how Unreal works. Took me about 3.5 months, lots of Youtube tutorials, Google searches and a little (sarcasm) help debugging/fixing with Vandervas Generator. Still lots to learn but Unreal is really amazing.</p>\n<p><strong>Programs Used</strong></p>\n<p>Unreal Engine 4 - Blender - Studio - Audacity - Photoshop - Launchpad</p>\n<p><strong>Testing</strong></p>\n<p>I had a few friends play through to check if there are any game-breaking issues. This is also a new process to me. It has proved invaluable. Not only did they find some glitches but also some gameplay issues caused by geometry in the arena. I actually removed some geo and re-positioned the saucer. This made the arena look hotter and solved issues where the enemies could not see the player. Or be blocked.</p>\n<p><strong>Future Development</strong></p>\n<p>I won't develop it further as I want to make a new game. This was a great learning process to help me prepare for my next games. </p>\n<p>Hope you have fun!</p>\n<p><strong>Move</strong> - WASD</p>\n<p><strong>Aim</strong> - mouse</p>\n<p><strong>Shoot</strong> - left mouse button</p>\n<p><strong>Pause/Restart/Quit</strong> - spacebar/escape</p>", "metacritic": null, "released": "2021-03-21", "tba": false, "updated": "2021-03-22T05:41:54", "background_image": "https://media.rawg.io/media/screenshots/533/533304990401205526b2375d795ce25c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 283, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["74bit"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}