{"id": 575891, "slug": "6k-feet-under-xalomango", "name": "6k Feet Under (Xalomango)", "name_original": "6k Feet Under (Xalomango)", "description": "<p>~~~~~~~~~~~~~ English Version Below ~~~~~~~~~~~~~</p>\n<p>6K Feet Under é um jogo de tiro em terceira pessoa onde o seu objetivo é destruir todos os alienígenas que tentarem impedir você de pegar combustível para sua nave.</p>\n<p>O jogo tem duas etapas: </p>\n<p>- A primeira onde você constrói torres para defender o ataque alienígena.</p>\n<p>- A segunda onde você precisa buscar o chefe alien para impedir que os monstros renasçam.</p>\n<p>Vai lá. Mete Bala. Mata todo mundo. E sai correndo!</p>\n<p>Este jogo tem como referências o filme Starship Troopers e foi produzido em 2017 em um projeto da faculdade.</p>\n<p>Se você gosta de jogos assim, eu recomendo fortemente o Deep Rock e o GTFO que são jogos que foram lançados com a mesma dinâmica.</p>\r\nNão esqueça de me seguir e ver meus outros jogos!\r\n<p>~~~~~~~~~~~~~ English Version ~~~~~~~~~~~~~<br/></p>\n<p>6K Feet Under is a third-person shooter and your goal is to destroy all aliens who try to stop you from getting fuel for your ship.</p>\n<p>The game has two stages:</p>\n<p>- The first one that you have to build towers to defend the alien attack.</p>\n<p>- The second that you need to seek the alien boss to prevent the monsters from being reborn.</p>\n<p>Go there. Pull the trigger. Kill everybody. And run away!</p>\n<p>This game is based on the movie Starship Troopers and was produced in 2017 on a college project.</p>\n<p>If you like games like that, I strongly recommend Deep Rock and GTFO which are games that were released with the same dynamics.</p>\r\nDont forget to follow me and see my other games!", "metacritic": null, "released": "2021-03-20", "tba": false, "updated": "2021-03-22T07:41:04", "background_image": "https://media.rawg.io/media/screenshots/6bf/6bf03b045fe711b20bd295211e58863c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 81, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Xalomango"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}