{"id": 575967, "slug": "geogometry-war", "name": "Geogometry War", "name_original": "Geogometry War", "description": "<p>Key Binding: </p>\n<p>W, A, S, D or arrow keys to move</p>\n<p>Space to jump</p>\n<p>Left Mouse Button to shoot from left </p>\n<p>Right Mouse Button to shoot from right </p>\n<p>R to play again <br/></p>\n\n<p>Play Video: </p>\n<br/>\n\n\n<p>When I made this demo, I set three rules for myself:\r\n</p>\n<ol><li>No text should be displays\r\n</li><li>Use no more than 3 colors\r\n</li><li>No traditional UI such as health bar\r\n</li></ol>\n<p>And they lead to a simple demo game use new kinds of UI.</p>\n\n<p>This is a very simple survival game that there is no way to win, the game will reset automatically after player have no hp remaining. Press and hold mouse botton will generate a bullet, release the button will shoot the bullet to the point the camera is facing at that moment. The longer you press the button, the bigger the bullet, the bigger the damage of this bullet, also the bigger consumption of energy. The growing speed of the bullet is liner to the time you hold the button, but remeber the volume is the cube of the edge length, so it will looks like the bullet is growing slower and slower, but is not actually. Same for the size of player and enemy.\r\n</p>\n<p>Every  5 seconds there will be a enemy born in the air as long as there is currently less than 8 enemies in the world. Enemies will generate bullet with random size, firstly the bullet is very small, and will grow to the determined size with constant speed in volume. Once it reach the size, it will shoot to the direction that the player is currently in.\r\n</p>\n<p>Note that the bullet before shooting can be destoryed by bullets.\r\n</p>", "metacritic": null, "released": "2021-03-20", "tba": false, "updated": "2021-03-22T08:02:54", "background_image": "https://media.rawg.io/media/screenshots/495/4950178d57ddc8cd9f2d86494afcd64b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["SuzumiyaDeno"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}