{"id": 575982, "slug": "strike-force-heroes-unification-an-unofficial-fan-", "name": "Strike Force Heroes Unification: An Unofficial Fan Game HTML5 version", "name_original": "Strike Force Heroes Unification: An Unofficial Fan Game HTML5 version", "description": "<p>Videos do not appear to be working. Please press space to skip the opening cutscene, and ignore how the is no background for the UI.</p>\n\n<p>Strike Force Heroes Unification: An unofficial fan game is a fan game for the Flash game series Strike Force Heroes. The purpose of this mod is to bring together the best aspects of all of the previous games and combine them into a single package with the main draw of multiplayer. Currently, the game only supports offline couch coop, however as of the upload of this build, development for online play will come into effect. There are 2 versions of the game available, an offline standalone version and a version that can be played on the web via HTML5. \r\n</p>\n<p>In order to have a pleasant multiplayer experience, using a first-party controller (xbox, playstation, or nintendo pro) should be used. However, the game does support input rebinding, and if you're desperate you can remap controls to be entirely on a keyboard. </p>\n<p>To play the downloadable version, go here https://smilejakoby.itch.io/strike-force-heroes-unification-a-fan-made-game</p>\n<p>Instructions:</p><p>Controller Rebinding</p>\n<p>There is a new menu screen for rebinding controls, however they are not saved and will need to be redone upon restarting the game.</p>\n<p>When rebinding, please make sure to rebind the first control, and then the second (unless if you only want one), otherwise it won't properly work.</p>\n<p>Joysticks cannot be rebound easily, so I have offered presets for them. When rebinding a joystick or Dpad manually, however, please make sure to go in the order of: Up, Down, Left, Right.</p>\n<p>All major controllers should work now, however Switch Pro Controllers seem to require a wired connection to properly work.</p>\n<p>Playstation controllers have been untested, however I expect them to work.</p>\n<p>Navigating the main menu</p>\n<p>Use WASD and space, or Dpad and the bottom button (A for Xbox, B for nintendo, X for playstation)</p>\n<p>You may press escape to go back to the previous page</p>\n<p>Credits are outdated by a few months</p>\n<p>Opening cutscene is outdated by even more months</p>\n<p>Selecting Map and Gamemode:</p>\n<p>It's not pretty, but I believe it is straightforward. </p>\n<p>Use W and S to move the menu up and down</p>\n<p>Use A and D to cycle through options.</p>\n<p>When doing Capture the Flag, please watch out, as the default teams are usually a 1v3. oops</p>\n<p>When doing FFA, I strongly recommend making every player be on a different team, however, it is possible for 2 players to be on the same team.</p>\n<p>When two players are on the same team, the only difference is that they cannot damage each other.</p>\n<p>When doing TDM... yeah nothing of note. I'll update the visuals to make it easier to distinguish friend and foe.</p>\n<p>(Default) Controls during gameplay:</p>\n<p>PC: </p>\n<p>WASD/arrow keys - move, jump, and crouch</p>\n<p>Left Click - shoot</p>\n<p>E - killstreak</p>\n<p>R - reload</p>\n<p>T - toggle laser sight</p>\n<p>Q - switch weapon</p>\n<p>Xbox One Controller:</p>\n<p>Left stick - move left and right</p>\n<p>Right stick - look</p>\n<p>A/Left Bumper - Jump</p>\n<p>X - reload</p>\n<p>Left Trigger - crouch</p>\n<p>Right Trigger - shoot</p>\n<p>Right Bumper - killstreak</p>\n<p>B - Toggle Laser sight</p>\n<p>Other controllers should by default be the Xbox equivalent</p>\n<p>Navigating the loadout menu (during respawn):</p>\n<p>PC: </p>\n<p>R - open loadout menu</p>\n<p>WASD- navigate menu</p>\n<p>E - close loadout menu</p>\n<p>Controller:</p>\n<p>X - open loadout menu</p>\n<p>Dpad - navigate menu</p>\n<p>A/B - close loadout menu</p>\n<p>Known Issues:</p>\n<p>Very few as of this moment. Ledge mantle animation is janky, there is no lava bucket on foundry, there is no spawn invincibility.</p>\n<p>Please report issues that you find, as otherwise they very likely won't be fixed. </p>", "metacritic": null, "released": "2021-03-20", "tba": false, "updated": "2021-03-22T08:07:08", "background_image": "https://media.rawg.io/media/screenshots/059/0590ff6c851bde3460e2ad703dac8807.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 49, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["SmileJakoby"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}