{"id": 576071, "slug": "sinathir", "name": "Sinathir", "name_original": "Sinathir", "description": "<p>This game is still in development and a lot if its features are either unfinished, or completely absent. This includes pretty much anything from graphics to dialogue. Bear than in mind.<br/></p>\n<p>Sinathir is a survival / raising sim set in a alternate history real world. You play as a young girl living on an island serving as a convict colony. Gather materials, craft, complete quests, learn a trade, meet new people who can train you and give you a job. Be careful though. Your sentence will end eventualy and you have to make sure you leave the island with good enough skill and knowledge to make it in the real world.</p>\n<p>This initial release is pretty much a tech demo and has about 1/5 of the planned content. Both this demo and the full game will be completely free.</p>\n<p>Don't know what to do? Read the manual in the game folder.<br/></p>\n<p>Planned features. Most of these are already in the game in some fashion:<br/></p>\n<ul><li><strong>Your character ages</strong>. This changes both your apearance and the way people treat you.</li><li><strong>Visible equipment</strong>. Your equiped clothes and weapons are visible on your character sprite</li><li><strong>No hunger / thirst bar</strong>. There is no hunger limiting your exploring. Time skips forward only if you work, train or rest and food is used to \"pay\" for those activities.</li><li><strong>Mood system</strong>. Keep your character happy by talking to other people, eating good food or just resting for a week. Or you can just buy some happy pills. Let your mood get too low and it's game over.</li><li><strong>Don't get addicted</strong>. Alcohol, drugs or bloodlust. Avoid these or keep them in moderation.</li><li><strong>Skill progression</strong>. Learn new utility skills to gain more options. Learn to skin animals to get leather, learn lockpicking to open doors and chests, improve your physical skills to climb over obstacles and unlock new shortcuts</li><li><strong>Upgrade your hideout</strong>. Gather materials and get new crafting stations to make your life easier. Dig a well, get some tools to make better items. Buy an anvil, build a furnace. Go from living in a tent to living in a mansion.</li><li><strong>Brutal combat</strong>. Preparation is everything and even the sharpest sword can't do anything againts a gun. Be prepared at all times because getting hurt has consequences.</li><li><strong>Visible damage and scars</strong>. Get hurt often enough and your wounds will leave permanent scars on your body. People will react to your injuries differently.</li><li><strong>Focus on exploration</strong>. Explore the world to find rare items, enemies or just learn about the world. The only thing stoping you from going further are your abilities.</li><li><strong>High replayability</strong>. Try learning different skills and raise different stats to get different endings. Everytime you beat the game, you unlock something new for your next playthrough.</li></ul>\n<p>The game will be released in multiple stages. </p>\n<ol><li>Initial release of the demo version. Focus on fixing bugs and refining features already present. Balancing will also take place here.</li><li>Initial release has badly writen dialogue and pretty much no story to speak of. Once the gameplay is solid, I will focus and rewriting the dialogue, preparing cutscenes and adding actual story.</li><li>This stage will be focused on making sure everything is 100% complete and set in stone. Dialogue, bug fixes and features.</li><li>Last stage. I will start working on the graphics. Get rid of the default tilesets and placeholders and focus on creating new, original ones.</li></ol>", "metacritic": null, "released": "2021-03-19", "tba": false, "updated": "2021-03-22T08:28:33", "background_image": "https://media.rawg.io/media/screenshots/9ec/9ec56aa90beacdbad6b95e854137dce4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 130, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["QuentinWH"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}