{"id": 576372, "slug": "malice-greed", "name": "Malice & Greed", "name_original": "Malice & Greed", "description": "Force bosses to join your team -- or steal their skills! A fusion of card games, roguelites, and JRPGS, Malice &amp; Greed cranks monster collecting up to 11 by giving you a massive playground of skills, teammates, &amp; items with immense amounts of combos and crazy interactions! Kill your enemies, Butcher their skills, Abduct their corpses, and give in to Malice &amp; Greed!<br/><br/><strong>Not getting enough mainline SMT? Neither was I. So here you go.<br/><br/>Made with Godot Engine</strong> <br/><br/><h3>Kill, Butcher, &amp; Abduct Your Foes</h3><ul><li>Dynamic Team Building: Abduct defeated enemies to use them on your team, including the most powerful bosses, or Butcher them to steal their skills for yourself! Explore an incredibly diverse range of playstyles as you fight your way through the city!<br/></li><li>A Transforming Nonlinear World: Uncover hidden areas, multilayered map progression with unique forms of persistence, and a variety of ways to interact with your past &amp; future self during runs. Your goals and decisions span multiple runs, and can cause you to start an entirely new type of run. Be wary of pushing your luck too far though, you never know who might be in town tonight.<br/></li><li>Ruthless Dual Soundtrack: Featuring 30+ songs, Malice &amp; Greed has a brutal metal battle soundtrack accompanied by a wide variety of musical styles throughout different locations. If metal's not your thing, you can switch to the electronic battle tracks instead!<br/></li><li>Merciless Item Combos: Gain powerful and unique effects by discovering items throughout the city, and combine them in clever &amp; creative ways to press your advantage and turn the tide of battle.</li></ul><h3>Even in Early Access, Malice &amp; Greed is already packed with:</h3><ul><li>350+ Skills to use!<br/></li><li>70+ Units to battle and abduct, each with 6 skills, with artwork by Lyfeu! Check him out on twitch as we continue making the unit art!<br/></li><li>12 Characters to form Connections with, unlocking 49 unique perks &amp; benefits!<br/></li><li>15+ Bosses to slay, and take for your own team!<br/></li><li>90+ Items to discover!<br/></li><li>50+ Dangerous battle modifiers!<br/></li><li>Body-based economy - Your party members are your currency.<br/></li><li>An endless number of random Bounties that apply perks &amp;difficulty modifiers, and offer rewards!<br/></li><li>An enormous diversity of growable random herbs that act as powerful temporary skills!</li></ul><br/>", "metacritic": null, "released": "2021-03-22", "tba": false, "updated": "2021-03-26T02:43:19", "background_image": "https://media.rawg.io/media/screenshots/799/799d044ffb176d931c842adcf3c17efc.jpg", "website": "https://discord.gg/qR7YSGd", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 3}, "playtime": 1, "achievements_count": 36, "ratings_count": 0, "suggestions_count": 152, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Xendra"], "genres": ["RPG", "Strategy", "Indie"], "publishers": ["Xendra"], "esrb_rating": null}