{"id": 5764, "slug": "chuck-gnome", "name": "Chuck Gnome", "name_original": "Chuck Gnome", "description": "* 2010 360 iDev Community App Award Winner for Best Looking Game *<br/><br/>&amp;quot;I love this one. The controls are great, the sounds are funny, and I really can’t get over how well done the art is. This is definitely a great app. CHUCK SMASH!&amp;quot; <br/>- 5/5, Joseph Ho, appsafari.com, http://cgno.me/c4Pp4w<br/><br/>&amp;quot;Graphics are nicely refined, and no one gets hurt.&amp;quot; <br/>-  New York Times, App Smart <br/><br/>&amp;quot;If you’re looking for a unique, entertaining experience involving short bearded men and big rubber bands, you need to get this game.  The rest of you ought to check it out as well... &amp;quot; <br/>- Highly Recommended, Eric Pankoke, Technobrains, http://bit.ly/cEWPPu<br/><br/>*TUAW.com Daily App 8.5.2010*<br/>- http://cgno.me/ad2n4u<br/><br/>&amp;quot;A simple, but entertaining gameplay mechanic that’s great for some quick entertainment on the go. A solid soundtrack, sleek presentation and quirky atmosphere. Chuck Gnome also scales relatively well to twice size for iPad owners as well&amp;quot; <br/>- 8/10, Alexis Santos, VGTribune.com, http://cgno.me/9Wa0B2<br/><br/>&amp;quot;For those looking for a great looking game, a game with easy but tough to master controls, and a game that can be played in short bursts, I can’t recommend Chuck Gnome enough.&amp;quot; <br/>- Ben Lehman, Platform Nation, http://bit.ly/92xoQz<br/><br/>&amp;quot;Chuck Gnome is a game that is full of challenge and a lot of silly fun&amp;quot; <br/>- Jared Nelson, TouchArcade, http://bit.ly/9423yk<br/><br/>&amp;quot;Chuck Gnome is a one of a kind game that will have you playing for hours on end.&amp;quot; <br/>- Sara Bateman, Appmodo, http://cgno.me/b0tK4X<br/><br/>&amp;quot;Chuck Gnome is good. I would say tell ur parents to buy it.&amp;quot; <br/>- Nico, The iPad Kids, http://bit.ly/arCxbt<br/><br/>DESCRIPTION<br/><br/>Chuck Gnome is an arcade-style shooting gallery game where you use a slingshot to &amp;quot;chuck&amp;quot; gnomes at moving targets and rack up major point scores, earn bonus multipliers, and unlock new levels. <br/><br/>Use your finger to aim and shoot Chuck at moving targets.   <br/><br/>Gnome Vision lets you visualize Chuck’s flight path before launch so you can achieve unmatched accuracy and rack up points.  <br/><br/>Missed the target?  You may have a second chance!  Chuck Gnome&amp;#39;s &amp;quot;2.5D&amp;quot; design makes unique use of the accelerometer.  By tilting your device left or right the stage will rotate, giving you that extra space you may need to nab &amp;#39;em before they disappear.  <br/><br/>Earn achievements and unlock new levels as you chuck Chuck and move closer to saving the princess. <br/><br/>FEATURES<br/><br/>*    Stunning artwork: Six meticulously-rendered episodes (not including mini-games!) each feature their own unique visual style<br/>*    Multi-layered environments you can only fully explore using your iPhone’s accelerometer<br/>*    Choreographed enemies that go far beyond the typical carnival game<br/>*    Orchestral soundtrack by Tapani Siirtola of Sound Real Finland<br/>*    Openfeint online Achievements and Leaderboards<br/>*    Unlimited Gnomes to Chuck! <br/><br/>www.chuckgnome.com <br/><br/>Follow Chuck on Twitter @chuckgnome or become a fan on his facebook page www.facebook.com/chuckgnomegame for the latest updates and news. <br/><br/>For Feedback: support@movablesprites.com", "metacritic": null, "released": "2010-08-04", "tba": false, "updated": "2019-10-22T14:28:18", "background_image": "https://media.rawg.io/media/screenshots/d0c/d0cd1c5f987a046f41a8e18d292ca561.jpeg", "website": "http://chuckgnome.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 172, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Precocious Peanut"], "genres": ["Adventure", "Family"], "publishers": ["Precocious Peanut"], "esrb_rating": "Everyone 10+"}