{"id": 576416, "slug": "book-of-the-old", "name": "Book of the Old", "name_original": "Book of the Old", "description": "<strong>The Old, will Return</strong><br/><br/>A puppet somehow has its own will, accidentally summoned a mystical soul from the Otherworld.<br/>Now they are trapped in a mysterious manor.<br/>What is behind all this, and what is awaiting these two souls?<br/>The answer lays in the Book of the Old.<h3>A Roguelike shooting game</h3>Dodge enemies' bullets and shoot them! Every time you start a journey, it will be all new!<br/>Adventure deeper, and new maps,  enemies, stories will appear.<br/>Decide you own adventure plan -- do you prefer easy maps, or dangerous ones with high benefits?<br/><h3>Equipment? No, they are cards!</h3>Collecting coins after cleaning rooms. Use coins to get powerful cards, or keep the coins for interest -- if you are not killed by powerful enemies.<br/>The altar will provide 5 cards each time for you to pick, and you can refresh them all if there is no your target card -- of course you should pay for that.<br/>3 same cards will became higher ranked card, witch can assist you fighting more powerful enemies.<br/>Each card has two forms of ability and two bonds. With 80 cards and 32 bonds, it's up to your wisdom and imagination how powerful you can be.<br/><h3>What's that monster?</h3>80 monsters and 23 bosses, every of them has its unique skill and action.<br/>Some of them can even cooperate.<br/>Be careful, every single kind of these monsters is fatal!<br/><br/><br/>This is a roguelike game with infinite possibilities.<br/>What is your road, you decide.", "metacritic": null, "released": "2021-03-23", "tba": false, "updated": "2021-03-26T03:16:23", "background_image": "https://media.rawg.io/media/screenshots/3b5/3b5ae6f8d98bd8ef387af159b247842c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 168, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mingcang Studio"], "genres": ["Action", "Indie"], "publishers": ["Mingcang Studio"], "esrb_rating": null}