{"id": 576488, "slug": "problem-here", "name": "Problem Here", "name_original": "Problem Here", "description": "                                                   <br/><br/>It’s little time left to enter the atmosphere, but there are some <strong>problems</strong>. As a crew, you must manage to get into the atmosphere!<br/><br/>You have to make the right decisions to succeed in Problem Here, where you can play up to a maximum of 10 people.<br/><br/>Repair the damage the Meteor showers have done to the ship! Space debris and meteorites damage the ship upon entry into the atmosphere. As a crew, your goal is to repair them before these damages reach the level of destroying the ship.<br/><br/><br/><br/>The viruses in some of the samples you took from the Red Planet Mars have spread out. These viruses infect plant samples on board and have infected some of you. The infected people change when you least expect it, their goal is to destroy the ship and you. <br/><br/><strong>I KNOW WHO YOU ARE!</strong><br/>If you have any idea who the infects among you are, share it with other crew members. If the majority decides, you can throw her / him out of the ship. Are you sure it's her or him?<br/><br/><strong>ONE MORE CHANCE</strong><br/>When the infections attack, you can shock them can survive. But remember, you will only get one chance to do this!<br/><br/><strong>SAFETY LEVELS</strong><br/>Infections do not transform so as not to reveal themselves at the initial security level. But when it gets dark, it's their turn.<br/><br/>For all this and more, <strong>Problem Here</strong> is waiting for you and your crew to succeed together.", "metacritic": null, "released": "2021-03-25", "tba": false, "updated": "2021-03-26T04:13:07", "background_image": "https://media.rawg.io/media/screenshots/ca1/ca1752bc5d31f7919913f3e2e11b1773.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 165, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Deep Range Studio"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Deep Range Studio"], "esrb_rating": null}