{"id": 576526, "slug": "mine-my-mind", "name": "Mine My Mind", "name_original": "Mine My Mind", "description": "To play this game on PS5, your system may need to be updated to the latest system software. Although this game is playable on PS5, some features available on PS4 may be absent. See PlayStation.com/bc for more details.<br/>Sit back, relax, and solve intriguing puzzles in Mine My Mind, a brand new puzzle game where the only objective is to sweep away at tiles, flag mines, and reveal a hidden image hiding underneath. <br/><br/>Like the classic game about mines and sweeping, the numbers on the tile indicate how many neighboring tiles contain a mine. Use your wit to find these mines and flag them just to be safe, and sweep away at the empty tiles around them to reveal an image hidden in the design! <br/><br/>When the image is revealed, a winner is you! Accidentally hit a mine? That’s okay too! There are no such things as mistakes, just happy little accidents! Keeping going at your own pace or restart if you’d prefer. <br/><br/>Engage in a wide variety of levels, ranging from as small as 7x5 to as large as 30x20. Each puzzle offers a unique challenge for the player to experience. The zen nature of each level is perfect for relaxing after a long day or when you need a break between busier games. Just pick up and play at your own convenience.<br/><br/>Features:<br/>- Ten 7x5 levels!<br/>- Ten 12x8 levels!<br/>- Fifteen 15x12 levels!<br/>- Five 18x15 levels!<br/>- Ten 30x20 levels!<br/>- And fun and zen gameplay throughout!<br/><br/>Do we have a plot? Probably not! (But if you prefer, pretend there’s an otterrific prince in distress, and the only way to save him is by solving every puzzle! And at the end of it all: sorry, Hero, your prince is in another castle.)<br/><br/><br/>Offline single player<br/>Remote Play allows users to connect to and play games on their PlayStation®4 or PlayStation®5 using a mobile device, PC, or another PlayStation®4 or PlayStation®5.<br/><br/><br/>Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy). <br/><br/>Software subject to license (us.playstation.com/softwarelicense). <br/><br/>One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.<br/>", "metacritic": null, "released": "2021-03-23", "tba": false, "updated": "2021-03-26T04:49:02", "background_image": "https://media.rawg.io/media/screenshots/0ac/0ac9357a6bb46770f15bf7a8ce7b9371.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 16, "ratings_count": 0, "suggestions_count": 93, "game_series_count": 0, "reviews_count": 0, "platforms": ["PlayStation 4"], "developers": [], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}