{"id": 576561, "slug": "university-empire-tycoon-idle", "name": "University Empire Tycoon－Idle", "name_original": "University Empire Tycoon－Idle", "description": "Will you be able to manage a whole University and become the best university rector?<br/><br/>Hold the reins of the business and become rich building a college campus!<br/><br/>Start running a small enclosure and work hard to make your reputation grow. Improve every detail and build new areas to turn your modest business into an educational institution, and compete with other universities!<br/><br/>Deal with the needs of employees and students, and take the proper decisions to expand your business successfully. Customize the classrooms, improve the administration department, provide the best sports facilities to students, or invest your idle money in hiring the best lecturers. Every single choice you make will have an impact on your growth strategy!<br/><br/>EXPAND YOUR CAMPUS:<br/>Add new areas to your university premises! Build new classrooms, sports grounds, or institutional buildings; open leisure zones, faculty lounges, student clubs; install better basketball hoops or modern blackboards… Inaugurate new faculties and increase the educational program: Maths, Law, Medical college, Philosophy, Literature, Physics, Chemistry, or Engineering. You must grow intelligently to reach the distinguished status that you deserve. Your wise management will allow you to have a huge university campus. Study the situation, have a look at your possibilities, and invest your balance patiently! <br/><br/>MEET THE STUDENT NEEDS: <br/>The more prestigious your university is, the more students will come and happily pay their tuition. You must be aware of all their needs and adapt your growth strategy to fulfill their expectations! Provide your pupils with the best didactic materials and scholarships, and engage the most outstanding students. Don’t forget to add after-school activities!<br/><br/>MANAGE YOUR STAFF: <br/>Your university will need an efficient working team, and you must be a worthy boss. Control your expenses and hire and fire workers depending on your workflow and your strategy. Employ maintenance personnel, builders, janitors, or office workers. Don’t forget to recruit the best teachers for all the school subjects available. Each department will cover basic needs in your business, and you should manage your team wisely to make your university profitable. <br/><br/>PARTICIPATE IN ONLINE COMPETITIONS: <br/>Compete against other universities online and work your way up to appear in the rankings! Join the different online contests and improve your status. Create the best possible educational institution and share it with your colleagues. You will have the opportunity of being a worldwide reference in different academic fields thanks to your hard work at the university. <br/><br/>If you like management and idle games, you will enjoy University Empire Tycoon! A casual easy-to-play game where strategic decisions have to be taken to grow a campus with profitable results. Expand your premises starting from a small and modest campus and unlock visible progress in your facilities. Transform your small business into the most renowned university and become the best university manager of all time!", "metacritic": null, "released": "2021-02-11", "tba": false, "updated": "2021-03-26T05:12:51", "background_image": "https://media.rawg.io/media/screenshots/bf3/bf334b997aed775b836491ae84ea7984.jpg", "website": "http://codigames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 127, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Digital Things"], "genres": ["Strategy", "Simulation"], "publishers": ["Digital Things Sociedad Limitada"], "esrb_rating": "Everyone 10+"}