{"id": 576591, "slug": "pantomime-creatures-ar", "name": "Pantomime Creatures AR", "name_original": "Pantomime Creatures AR", "description": "Play with interactive 3D creatures.  Scoop them up in a virtual cup or knock them into a collection basket.  Feed and capture them to score!<br/><br/>Pantomime Creatures introduces a new kind of real-time shared 3D augmented reality that immerses your iPad or iPhone in an interactive virtual world.<br/><br/>IMMERSED IN THE CREATURES WORLD<br/>Your phone or tablet is balanced on a icy rink with a collection basket and mirror at one end.<br/><br/>Tip your screen forward to face the mirror and see your mobile device AND your virtual hands reflected in it!  Turn your device to look around.  Tip it downward and see your device's shadow in the ice.  It's screen has been transformed into clear glass.  You’re in an amazing new kind of augmented reality<br/><br/>Baby dragons are hatching from a nest up above!<br/><br/>GET THEM IN THE BASKET<br/>You can push and paddle them in with your phone or tablet —<br/> — or knock them in with Snowballs by tapping the screen with one finger.  They’ll squeal with delight.  If you miss, they’ll fall whistling into the space below.<br/><br/>GROW THEM BIGGER<br/>Tap with 2 fingers to toss them green Growing Food.  The bigger they arrive in the basket, the higher you'll score.  10 is the highest.  But careful — overfeed them and they’ll deflate like balloons!<br/><br/>HELP THEM FLY<br/>Tap with 3 fingers to toss them sky blue Flying Food.<br/>While creatures are flying it’s a great time to shove them towards the basket.  When they run out of energy they drop right in.<br/><br/>Tap the ? button to see the basic Help.<br/><br/>NAVIGATION GESTURES<br/>• Skate across the ice by stroking the screen with 1 finger<br/>• Spin and turn by stroking horizontally with 2 fingers<br/>• Lift your device up and down in the virtual world vertically with 3 fingers<br/><br/>CONNECT WITH ANY iPAD or iPHONE<br/>Tap the Connect button and join another device running Pantomime Creatures on your WiFi network.  You'll see their mobile device and their virtual hands!<br/><br/>You’re in a new kind of augmented reality — shared worlds where no one needs to put on a headset.<br/><br/>Install Pantomime Creatures on all your iPads and iPhones -- and watch for Pantomime Creatures for Mac.", "metacritic": null, "released": "2016-09-29", "tba": false, "updated": "2021-03-26T05:27:56", "background_image": "https://media.rawg.io/media/screenshots/681/6810e376f7255c223d80f9adfc473aab_vEAntrC.jpg", "website": "http://pantomimecorp.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 157, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Pantomime"], "genres": ["Simulation"], "publishers": ["Pantomime"], "esrb_rating": "Everyone 10+"}