{"id": 576505, "slug": "tasomachi-behind-the-twilight-demo", "name": "TASOMACHI: Behind the Twilight - Demo", "name_original": "TASOMACHI: Behind the Twilight - Demo", "description": "Discover new and upcoming games with our Soon to Bloom collection of over 20 playable demos.\n\n\t\n\n<br/><br/>TASOMACHI: Behind the Twilight is Coming Soon! <br/>You can wishlist it  here.<br/>\n\nYukumo is a young girl who travels around in her airship, her pride and joy. When visiting a particular Far Eastern town to run some errands her airship suddenly breaks down. She decides to explore the town to search for parts for repair; however, the town has fallen silent with no trace of the people who live there, the only inhabitants being a strange cat-like species...\nTasomachi is an adventure game in which you can freely explore an Far Eastern Fantasy town. You will control Yukumo as you explore the mysterious town, clear dungeons and collect items in order to fix your broken down airship. \n<br/><br/>\nTasomachi is currently under development and is planned for a 2021 release on PC.\n<br/><br/>\nWonder into a mysterious and sleepy town where time flows slowly and explore to your heart’s content.<br/>\nCommunicate with the “locals”.<br/>\nExplore highways, bridges, ravines and other such scenic locations.<br/>\n<br/><br/>\nTASOGARE NI NEMURU MACHI (TASOMACHI) in Japanese means \"A city sleeping in twilight\".\n\n<br/>\n<p>\nThe game might start in Japanese by default. Language can be changed via in-game menu.</p>", "metacritic": null, "released": null, "tba": false, "updated": "2021-03-26T04:26:48", "background_image": "https://media.rawg.io/media/screenshots/45b/45b35edad5f73a3cf01410a4e72d2216.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 9}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 518, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Orbital Express"], "genres": [], "publishers": ["Playism"], "esrb_rating": null}