{"id": 576580, "slug": "trojan-war-warrior-of-sparta", "name": "Trojan War: Warrior of Sparta", "name_original": "Trojan War: Warrior of Sparta", "description": "Trojan War is a strategy game designed for iOS phones and iPad.<br/><br/>⁕ Trojan War’s introduction<br/><br/>In such a short time, Trojan War has become popular with thousands of downloads on APP STORE.<br/><br/>In the game, you will command a Greek army on the road to conquer Troy to get the beautiful Queen Helen back.<br/><br/>After each territory, you will have more types of troops. Besides, you can use coins to equip items off gods to increase your power.<br/><br/>In each battle, you have to balance the food, train the army, use the Trojan Horse as a fort to defend or use the magic books to destroy the enemy tower.<br/><br/>⁕ Features in Trojan War:<br/><br/>- Control the behavior of the army according to the commanding flag.<br/>- Control soldiers with touch controls to allow them to use their own unique skills.<br/>- Level up and equip yourself with powerful equipment to increase your stats.<br/>- Magic book - Twelve Olympian spells.<br/>- 5 divine artifacts from God, armor upgrades with their special powers.<br/>- Explore the ancient world in Greek mythology.<br/><br/>⁕ Characters:<br/><br/>- Hunter<br/>- Swordman <br/>- Bowman <br/>- Hoplite <br/>- Priest <br/>- Cyclops <br/>- Trojan Horse<br/><br/>⁕ History of Trojan War<br/><br/>The Trojan War was a famous war in Greek mythology that lasted 10 years without ending. The man who started the great war was King Menelaus (King of Sparta - Greece) when his wife - the Queen Helen who was said to have been the most beautiful woman in the world, was stolen by the second prince of Trojan, Paris.<br/><br/>It was not easy to conquer Troy because it had to move troops across the mountains, seas, deserts… and above all the famous fortified Troy was built by the hands of two gods, Apollo and Poseidon, along with a skilled army led by the talented general - Hector, the brother prince of Paris.<br/><br/>After 10 years of fighting in Troy, the Greeks could not defeat Troy by military power, so they had to follow Odyssey’s plan to take wood to make a horse (Trojan Horse), then pretend to withdraw and leave only one person. This man was responsible for deceiving Troy forces, making them think that wooden horses were a gift from the Greek army to compensate for the destroyed Athena statue. Essentially the horse is full of soldiers. When the Troy were full after the feast of victory, the Greeks in the horse broke out and opened the gates of the outside. Thanks to the wooden horse, the Greeks won and completely defeated the enemy.<br/><br/>Odysseus was one of the most influential Greek warriors in the Trojan War.  He was a very trusted counselor and adviser. Odysseus is best known as the hero character in the journey back home to Ithaca, lasting ten years as he tries to return home after the Trojan War. On the way back, he met countless difficulties from storms, 6-headed monsters...<br/><br/>Trojan War is a strategy game that describe honestly and vividly the historic battle of the Greek army and Odysseus' journey back home.<br/><br/>⁕ What you get to experience with the Trojan War game:<br/><br/>- Easy to play but still challenging<br/>- Hundreds of levels from easy to difficult and a variety of game scripts<br/>- Excellent 3D graphics and epic action sound <br/>- Game features are constantly updated<br/><br/>Please stay tuned and update new features!<br/> <br/>⁕ Gaming tips<br/><br/>- Balance the amount of meat to buy troops<br/>- Buy troops to increase army’s strength <br/>- Upgrade the power of each soldier <br/>- Equipping additional armor and weapons for each soldier <br/>- Use suitable tactics for each game script<br/><br/>Note: A network connection is required to play. <br/>Show off your ingenious military skills today by downloading the Trojan War game and have the ultimate experience!", "metacritic": null, "released": "2020-02-01", "tba": false, "updated": "2021-03-26T05:22:27", "background_image": "https://media.rawg.io/media/screenshots/331/331045086c212d5ded5d812e7e2cce2a_nj0BqJJ.jpg", "website": "http://megaads.vn/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 379, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tran Phuong"], "genres": ["Action", "Strategy"], "publishers": ["Tran Phuong"], "esrb_rating": "Teen"}