{"id": 576502, "slug": "scarlet-hood-and-the-wicked-wood", "name": "Scarlet Hood and the Wicked Wood", "name_original": "Scarlet Hood and the Wicked Wood", "description": "It’s a new day in the realm of Glome. Sunlight creeps across the land revealing a lush, vibrant world brimming with magick, beauty, and artifacts from a mysterious bygone culture. The Munchkin call this land home, but they share it with the Seven Witches, Tin Knights, talking beasts, fearsome monsters, and trader caravans. <br/><br/><br/><br/>Scarlet awakens in this strange land after getting tossed by a tornado. Through a series of unfortunate events, she finds herself in charge of leading a hapless Munchkin troupe through the Wicked Wood to safety. One problem - the cantankerous Black Witch, LeFaba, has a habit of incinerating would-be travelers that detour through her forest. Scarlet may be woefully outmatched, but a hex has her reliving the same day. Can our fledgling pathfinder take up the mantle of the Red Witch and summon the moxie to overcome the disaster that awaits her at every turn?<br/><br/><br/><br/><strong>Scarlet Hood and the Wicked Wood</strong> is a story-driven adventure game. As Scarlet, you must relive seven days of misfortune, and make a series of decisions to guide your Munchkin troupe safely out of the Wicked Wood. Experience branching outcomes based on your decisions. Most importantly, immerse yourself in a bewitching story of fantastic adventure!  <br/><br/><br/><br/><ul><li>Solve exciting puzzles.<br/></li><li>Survive a narrative time-loop.<br/></li><li>Make key decisions that permanently affect <strong>YOUR</strong> story.<br/></li><li>Evade a hungry wolf.<br/></li><li>Ogle the hand-illustrated graphics.<br/></li><li>Use Scarlet's witching skills to avoid detection.<br/></li><li>Unlock multiple endings based on how you played.</li></ul>", "metacritic": null, "released": "2021-04-08", "tba": false, "updated": "2024-01-03T16:48:34", "background_image": "https://media.rawg.io/media/screenshots/078/0786762dfc194d4ed5847b8698b95cda.jpg", "website": "https://www.devespressogames.com/", "rating": 3.57, "rating_top": 5, "added_by_status": {"yet": 5, "owned": 41, "beaten": 4, "toplay": 2, "dropped": 3}, "playtime": 3, "achievements_count": 34, "ratings_count": 7, "suggestions_count": 494, "game_series_count": 0, "reviews_count": 7, "platforms": ["macOS", "Linux", "PC"], "developers": ["Devespresso Games"], "genres": ["Adventure", "Indie"], "publishers": ["Headup Games", "WhisperGames"], "esrb_rating": null}