{"id": 576650, "slug": "moo-times-of-betsy-episode-3-the-ocarina-cow", "name": "Moo Times Of Betsy, Episode 3: The Ocarina Cow", "name_original": "Moo Times Of Betsy, Episode 3: The Ocarina Cow", "description": "<p>Chibi Betsy has a dream - to be the greatest ocarina player! With the help from her mother and her owners, she ends up winning the contest hosted by the mysterious Ocarina Cow.  Things take a different turn as they're transported to an unknown area and discover the truth about Chibi Betsy's favorite music idol.</p>\n<p>This is the third episode of the <em>Moo Times of Betsy</em> series, which is based on the<em> Lotus Cow Comics</em> on WEBTOON Canvas and Tapas. </p>\n<p>The moral behind the story is about following your heart and do what’s right. As this game has two different endings, players have the option to choose the beloved cow’s fate.</p>\n<p>Some facts behind the development of the game:\r\n</p>\n<ul><li>This visual novel was developed during the NaNoRenO 2021 game jam.</li><li>The original story was written by me using Day One journal.\r\n</li><li>Character and object sprites and the main menu GUI were created with Procreate.\r\n</li><li>Music was created through Garageband. I used my triple chamber ocarina to record the sound samples through BandLab and my keytar for recording some samples. \r\n</li><li>Backgrounds were from Unsplash and edited using ibis Paint X.\r\n</li><li>Fonts are from Google.</li></ul><p><strong>Disclaimer:</strong><br/></p>\n<p><em><strong>Please do not sell or redistribute the game as this is copyrighted by me. If you wish to review the game, please send me a message at dchin@redlotusdesignz.com with your permission to do so. Thanks!</strong></em>\n</p>", "metacritic": null, "released": "2021-03-25", "tba": false, "updated": "2021-03-26T05:42:48", "background_image": "https://media.rawg.io/media/screenshots/eeb/eebb0203f2785ed1fe6d04b54cf95b9e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 84, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Red Lotus Designz"], "genres": [], "publishers": [], "esrb_rating": null}