{"id": 576676, "slug": "lost-in-futility", "name": "Lost in Futility", "name_original": "Lost in Futility", "description": "<p>In the year 2220 an extraterrestrial empire invaded the Earth. The powerful warships that the aliens possessed wasted little time wiping out every military organization on the planet. The command ship was rumored to be stationed by Jupiter. However, aside from the rumors little else was known about the command ship. Any human who was transported to the command ship never returned. The only ships that the humans had records of was the alien transport vessels. The ships could be confused for a human naval vessel from a distance. </p>\n<p>69696969696969696969696969696969696969696969696969696969696969</p>\n<p>The aliens brought a strange disease with them. This parasite affects both aliens and humans alike. As the parasite grows in the host it slowly destroys the host’s brain. The parasite is extremely weak to changes in the hosts body temperature. Any significant change in host body temperature would kill the parasite. Humanity referred to the parasite as the living zombie. The parasite died if the host died. The only way for the parasite to send its offspring into another host was if its host dealt damage to another potential host. The host released the offspring when it sweat or through the saliva.</p>\n<p>69696969696969696969696969696969696969696969696969696969696969<br/></p>\n<p>Shortly after the military might of Earth was defeated the governments of the world were destroyed. Humanity referred to the alien invasion as the day of reckoning. Humanity was forced to accept the laws of its new overlords. Humanity had to hide its weapons manufacturing in underground factories that were constructed to be undetected from visual inspections. The only weapons factories that were allowed to exist made the weapons that the aliens used for war. The surviving soldiers banded together to form a secret resistance group.</p>\n<p>69696969696969696969696969696969696969696969696969696969696969<br/></p>\n<p>The resistance group took the name Tardigrades. They took the name to represent the name fact that they survived. They wanted to represent the fact that they survived the aliens attempt to wipe them out and would try and gather the strength of humanity. The group was able to recruit new members. However, the aliens outlawed humanity’s ability to buy, sell, and own firearms. The group slowly built an underground network. The resistance’s aim was to train the new recruits to fight or operate in various fields.</p>\n<p>69696969696969696969696969696969696969696969696969696969696969<br/></p>\n<p>Despite the growing strength of the group the aliens were able to continue their work unimpeded. One of the resistances spies confirmed the existence of an alien moon base where they were doing biological experimentation on humans. The council in charge of the organization started recruiting people from various fields to invade the base on the moon and acquire the intel that was stored on the computers there. The plan took advantage of the aliens advanced teleportation systems that were on their ships.</p>\n<p>69696969696969696969696969696969696969696969696969696969696969<br/></p>\n<p>The recruits were hand picked so that they lacked any knowledge of the resistance. The first recruit they deployed was a cadet who was training to be a member of the special forces. They made sure that the recruit was fully trained and then deployed him to various locations. This was done in an attempt to show the aliens that this recruit could be used as a test subject for their super soldier program. The first mission they sent him on was a mission located in the Saharan desert.</p>\n<p>69696969696969696969696969696969696969696969696969696969696969<br/></p>\n<p>The mission was to wipe out a local horde of zombies. While the zombies were restricted to melee combat the recruit could only carry a limited supply of ammo on their person. The hidden objective of the mission was show that their recruit was adaptable and could fight with limited resources. The recruit was deployed with a rifle, a pistol, and combat knife. The resistance operative was wearing regular civilian clothing so that nothing could be tied back to the resistance itself.</p>\n<p>69696969696969696969696969696969696969696969696969696969696969<br/></p>\n<p>The second mission that the new resistance operative was sent to was located in the Amazon Rainforest. The mission was to take out a rogue group of aliens that were controlling the local zombie population to prevent anyone from uncovering what they were doing in their hideout. The operative was deployed to wipe out the aliens and zombies guarding the facility. The hidden goal was that the resistance wanted to show case that they had no issues with the aliens that were respecting human rights. The operative kept the same loadout as the previous mission.</p>\n<p>69696969696969696969696969696969696969696969696969696969696969<br/></p>\n<p>The third mission the operative was given a shield to reflect the alien’s weapon fire. The third mission was located on an island that the aliens frequently used to transport people from earth to unknown locations. The goal was to have the operative get captured by killing as many aliens as they could. This would prove that the human had the fitness required to survive the experimentation process that aliens used. It was also a chance to see what a different species of aliens was capable of doing in combat. Due to the physiology of the alien the operative was informed that the easiest way to kill the new aliens was to use a blade instead of firearms.</p>\n<p>69696969696969696969696969696969696969696969696969696969696969<br/></p>\n<p>The aliens took the operative to the research base on the moon. The human was placed into an augmented reality battlefield. The operative was forced to a laser rifle as one of the weapons. The aliens decided to remove the threat of zombies from the combat simulation. If the human survived the two rounds of combat the aliens would put the human into their super soldier project. If not, the aliens would simply find the next test subject. The operative was forced to watch their three combat missions over again. This way they were fully recovered before they went into the combat simulation.</p>\n<p>69696969696969696969696969696969696969696969696969696969696969<br/></p>\n<p>The second round was against an alien who under went the procedure. The alien was handicapped so that the human had a chance to defeat the alien. The human had to be careful of the alien’s projectiles. The location was designed to give the human plenty of space to take a breather. Due to the location of the combat the laser rifle was constantly recharged. In order to make the combat more difficult the aliens added in a group of weaker aliens to fight alongside the boss. Should the human survive the combat the aliens intended to specialize the human into stealth oriented combat.</p>\n<p>69696969696969696969696969696969696969696969696969696969696969<br/></p>\n<p>With the combat completed the aliens were excited that the human survived. They told their top scientists to prepare a room for the human test subject. With the resistance operative passing the test the aliens marked down in their system that they had another test subject. With the successful completion of getting an operative into the super soldier program. The resistance moved onto the second stage of their plan.</p>\n<p>69696969696969696969696969696969696969696969696969696969696969</p>\n<p>pp</p>\n<p>send 0.69 bitcoin: <br/></p>\n<p>3N2xe3tnb3jdfzo5DdteL3honWfr1z1GnX<br/></p>\n<p>David Malevsky - Lead Developer, modeler, programmer, animator</p>\n<p>Gabriel Somek - programmer, modeler, animator</p>\n<p>David Serfaty - Buttons Design, music for level 3 and 4, modeler</p>\n<p>Shai Aronson - Story writer</p>\n<p>Carl-Frederic Theodate - Built a desert temple in level 1</p>", "metacritic": null, "released": "2021-03-25", "tba": false, "updated": "2021-03-26T05:49:46", "background_image": "https://media.rawg.io/media/screenshots/edd/edd6b333832acf7d205f6acf22b30ddd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 74, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["DimensionalPlayGround"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}