{"id": 57679, "slug": "persona-2-innocent-sin", "name": "Shin Megami Tensei Persona 2: Innocent Sin", "name_original": "Shin Megami Tensei Persona 2: Innocent Sin", "description": "<p>Persona 2: Innocent Sin is a Japanese role-playing video game developed and released by Atlus for the PlayStation in 1999. It is the second entry in the Persona series, itself a subseries of the Megami Tensei franchise, and acts as a sequel to the original Persona. The game was re-released in 2011 for the PlayStation Portable. The original version was not localized for western territories, however the PSP version was released in North America and Europe under the title Shin Megami Tensei: Persona 2: Innocent Sin.<br />\nInnocent Sin takes place in the fictional Sumaru City, focusing on a group of high school students from Seven Sisters High School. The protagonist, Tatsuya Suou, and a group of friends must confront a villainous figure called the Joker, who is causing the spread of reality-warping rumors through the city. The group are aided in their quest by their Personas, personified aspects of their personalities. The gameplay features turn-based battle gameplay, where characters use their Personas in battle against demons, and a separate Rumor system, where rumors spread around the city can influence events in the characters&#39; favor.<br />\nDevelopment on Innocent Sin began after the release of the original Persona, and retained most of the original&#39;s staff. The game carried over the story themes and basic gameplay mechanics of Persona, while changing and improving on some of the mechanics. The characters were designed by Kazuma Kaneko and Shigenori Soejima. The original release was not localized due to staff shortages and concerns over its content. Reception to the game was generally positive for its original release, but reviews were more mixed for its remake due to its age. A direct sequel to Innocent Sin, Persona 2: Eternal Punishment, was released in 2000 in Japan and North America.</p>", "metacritic": 75, "released": "1999-06-24", "tba": false, "updated": "2024-01-23T12:14:29", "background_image": "https://media.rawg.io/media/games/d74/d74ec29edff81490be38e218a7669901.jpg", "website": "", "rating": 4.31, "rating_top": 5, "added_by_status": {"yet": 52, "owned": 32, "beaten": 61, "toplay": 56, "dropped": 24, "playing": 16}, "playtime": 0, "achievements_count": 0, "ratings_count": 64, "suggestions_count": 520, "game_series_count": 37, "reviews_count": 64, "platforms": ["PlayStation"], "developers": ["Atlus", "Satelight"], "genres": ["RPG"], "publishers": ["Atlus", "Ghostlight"], "esrb_rating": "Teen"}