{"id": 577100, "slug": "team-fundemic-morning-commute", "name": "Team Fundemic: Morning Commute", "name_original": "Team Fundemic: Morning Commute", "description": "<p>Water poverty is an issue that plagues 1 in 10 people the world over.  As climate change begins to ravage the globe, droughts are becoming more and more common; making it even harder for people to get access to clean drinking water.</p>\n<p>We made 'The Morning Commute' for the 2021 Ukie Student #Mobojam to bring attention to the fact that every day millions of people across the globe have to travel miles to bring back water for their families. </p>\n<p>The Morning Commute will have the player making tough choices as they carry their wagon back and forth from a distant water source throughout a long drought. Obstacles, mishaps and even other desperate families will make bringing back enough precious water to keep their village alive a difficult task. </p>\n<p>The game was made by a team of two students from Norwich University of the Arts; Callum Horton and Jonathan Marshall. We received mentorship from the lovely Tiffany Wild who really helped us to cement our idea in place and kept us on track through the course of the 48 hour jam. We'd like to extend a massive thank you to her, and for Ukie Students for hosting and organising the jam. It was an awesome experience!</p>\n<p>All code and assets used in the game was the original work of myself and callum, with models produced using Kenshape and Autodesk Maya. </p>\n<p>Sounds are all sourced from freesound.org and then mixed by our team. Featured music is by Kevin Macleod, please see the licensing information below: </p>\n<p>Silver Flame by Kevin MacLeod\r\n</p>\n<p>Link: https://incompetech.filmmusic.io/song/4362-silver-flame\r\n<br/>License: https://filmmusic.io/standard-license\r\n</p>\n<p>Energizing by Kevin MacLeod\r\n</p>\n<p>Link: https://incompetech.filmmusic.io/song/5709-energizing\r\n<br/>License: https://filmmusic.io/standard-license\r\n</p>\n<p>Adding The Sun by Kevin MacLeod\r\n</p>\n<p>Link: https://incompetech.filmmusic.io/song/5708-adding-the-sun\r\n<br/>\r\nLicense: https://filmmusic.io/standard-license</p>", "metacritic": null, "released": "2021-03-24", "tba": false, "updated": "2021-03-26T07:42:25", "background_image": "https://media.rawg.io/media/screenshots/7f4/7f419e9cd41011e1e3b117646f551b72.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 64, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Valkija"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}