{"id": 577183, "slug": "molecule-lab-ionic-bonding", "name": "Molecule Lab (Ionic Bonding)", "name_original": "Molecule Lab (Ionic Bonding)", "description": "Molecule Lab (Ionic Bonding) \r\n<p>Click and drag the molecules on the screen. This chemistry lab demonstrates the attraction between two ions, or positively charged blue ion (<strong>cat</strong>ion), and a negatively charged red ion (<strong>an</strong>ion). Drag the blue ion closer to the red ions to see the attraction.</p>\n\n<p><strong>What is an ionic bond?</strong><br/></p>\n<p>The ions have opposite charges so they are attracted to each other (e.g. positive attracts negative etc., similar to magnets). This is an ionic bond. (Source).</p>\n\n<p><strong>What is Coulomb's Law?</strong></p>\n\n<p>Coulomb's law shows the bond strength between the ions. As the ions are further apart, the bond strength is weaker, and as they are closer together the bond strength is stronger. <br/><br/><br/><br/><strong>Why do the ions repel each other when they're very close?</strong><br/>Try dragging the blue ion close to the red ion. Even though they are really close, they repel each other by a small distance. This is because of the nucleus of each atom: \"Remember that the ions' nuclei are both positively charged. When the nuclei approach each other, they repel\". This is seen in the graph below at the left side called \"strong internuclear repulsion\". They repel each other when they're really close, but they still attract each other. As the graph moves to the right, the bond strength decreases because they are further and further apart.<br/><br/></p>\n\n<p><strong>References:</strong><br/></p>\n<p>https://www.sparknotes.com/chemistry/bonding/ionic/section1/<br/></p>", "metacritic": null, "released": "2021-03-24", "tba": false, "updated": "2021-03-26T08:04:22", "background_image": "https://media.rawg.io/media/screenshots/ece/ece32a722980a359b585656d726ef57d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["moduluslabs"], "genres": ["Simulation", "Educational"], "publishers": [], "esrb_rating": null}