{"id": 57737, "slug": "rugrats-search-for-reptar", "name": "Rugrats: Search for Reptar", "name_original": "Rugrats: Search for Reptar", "description": "<p>Rugrats: Search for Reptar is a platform video game that was released in 1998 for PlayStation in North America and in the PAL region by THQ. The game is based on the popular Nickelodeon cartoon Rugrats which aired from 1991 until 2004. The game follows the main character of the cartoon, Tommy Pickles, who has lost his Reptar puzzle. It features stages that are typically based on episodes from the television show.<br />\nIt was developed with the intent of appealing to ages seven through twelve. A marketing campaign, which was the second biggest of 1998, was formed in conjunction between Sony Computer Entertainment America and THQ for its North American release, in order to bolster the children&#39;s market on the PlayStation.<br />\nThe game has been met with mixed reviews from critics, though it has regularly been noted that children will enjoy it. It was criticized for its camera and gameplay by publications such as IGN and GameSpot but was given a positive reception for its presentation and was well-received commercially, being the third best-selling game in the first two weeks of its release. It was incorporated into the Greatest Hits brand and sold nearly 1.5 million copies, becoming one of the best-selling games on the PlayStation.</p>", "metacritic": null, "released": "1998-10-31", "tba": false, "updated": "2023-11-29T08:04:34", "background_image": "https://media.rawg.io/media/games/b6f/b6f92fe207e573b596e9c5db0d9a49b4.jpg", "website": "", "rating": 3.27, "rating_top": 4, "added_by_status": {"yet": 2, "owned": 8, "beaten": 17, "toplay": 5, "dropped": 6, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 11, "suggestions_count": 117, "game_series_count": 11, "reviews_count": 11, "platforms": ["PlayStation"], "developers": ["n-Space"], "genres": ["Adventure"], "publishers": ["THQ"], "esrb_rating": "Everyone"}