{"id": 577458, "slug": "x-life-modpack", "name": "X Life Modpack", "name_original": "X Life Modpack", "description": "Looking for an adventure? This is the modpack for you! The concept is simple. You start with one heart, every time you die, you gain a heart. Once you have 10 - which is your max hearts - and you die. You will not be able to respawn. So, you must be careful!     But of course, there are a bunch of extra mods thrown in to make it more interesting. For example: some enchantments can go up to level 20, you have better gear and tools and a lot of extra building blocks so you can build your ultimate dream world!\r\n\n\r\nLimited Lives- With this pack you will have limited lives. You will start with one heart and each time you die you gain a heart. Once you die on 10 hearts you will not be able to respawn and will be put into spectator mode.  Tiny Mob Farms- Makes mob farming much easier. There are single-block size mob farms that makes mob farming neater and easier. There are different tiers, some are really hard to make but are more rewarding.  High Enchantment Levels- There are many new enchantments and the enchantment levels are much higher with some enchantments as high as level 20. The enchanting table even goes up to level 150! It will allow you to become more powerful and will help you adventure out and conquer the world of X-Life.  Many new building blocks- Hundreds of new blocks are added with many colours and patterns. It brings many new options to builders and makes building much more fun and interesting. The possibilities are endless with this many blocks.  More animals and pets- There are many animals and pets in this pack. Many are tamable but others can kill you. They all come with a unique flair and aesthetic. Your Minecraft world will feel much more lively.  Custom Biomes- Many unique biomes are bought to your world. These new biomes generate in the Overworld, the Nether and the End! Each biome has many new plants, flowers, trees, building blocks, mobs, ores and much more.  Better Tools and Armor- Of course with many dangers you will need better tools and armor. There are many new tools added which can be crafted with a lot of different materials, there are even new types of tools. There are hammers and excavators which will break a 3x3 block area.\r\nMinimum allocated RAM: 3GB <br/> Recommended allocated RAM: 5-6GB", "metacritic": null, "released": "2021-03-23", "tba": false, "updated": "2021-03-26T09:17:16", "background_image": "https://media.rawg.io/media/screenshots/423/423d5e04f48467a46ed3a681d347f9d4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 10, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Hadif09"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}