{"id": 577525, "slug": "natural-selection-deno", "name": "Natural Selection (Deno)", "name_original": "Natural Selection (Deno)", "description": "NOTE: The browser version may fail to run and I don't know the reason... Please use the download version.\n<p><em>If during the long course of ages and under varying conditions of life, organic beings vary at all in the several parts of their organisation, and I think this cannot be disputed; if there be, owing to the high geometrical powers of increase of each species, at some age, season, or year, a severe struggle for life, and this certainly cannot be disputed; then, considering the infinite complexity of the relations of all organic beings to each other and to their conditions of existence, causing an infinite diversity in structure, constitution, and habits, to be advantageous to them, I think it would be a most extraordinary fact if no variation ever had occurred useful to each being's own welfare, in the same way as so many variations have occurred useful to man. But if variations useful to any organic being do occur, assuredly individuals thus characterised will have the best chance of being preserved in the struggle for life; and from the strong principle of inheritance they will tend to produce offspring similarly characterised. This principle of preservation, I have called, for the sake of brevity, Natural Selection. </em></p>\n<p>— Darwin summarising natural selection in the fourth chapter of <em>On the Origin of Species</em></p>\n\n\n<p><strong>A </strong><strong>3D simulation game that simulate the process of natural selection.</strong></p>\n\n\n<p>There are three kind of creatures in this game include plant, herbivorous animal and carnivorous animal. They can eat, move, reproduce and dead automatically, all those actions are decided by their own DNA, and the DNA will randomly change (variation of the genes) a little bit at each generation. What the players could do is to change some parameters at the beginning of the game, then sit still and see how the world will looks like after a long period of time. Due to the genes variation system and the creatures cannot be controlled by player, this game can simulate the process of natural selection very well, so for everything happened in this game, you can find an similar situation in the real world’s history of nature. I hope the players to feel how amazing the evolution is and maybe learn about how the natural selection take part in the process of evolutio</p>\n\n<p><strong>References: </strong></p>\n<p>Ground Texture 1. https://assetstore.unity.com/packages/2d/textures-materials/floors/tileablehand-... </p>\n<p>UI Images 1. https://favpng.com/png_view/place-setting-clip-art-the-noun-projectdownload-imag... </p>\n<p>2. https://www.cleanpng.com/png-drop-down-list-computer-icons-downarrow-943561/</p>", "metacritic": null, "released": "2021-03-23", "tba": false, "updated": "2021-03-26T09:32:16", "background_image": "https://media.rawg.io/media/screenshots/57a/57a3f16e70056b435275affa0a6568e8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 21, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Web"], "developers": ["Deno"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}