{"id": 57760, "slug": "shin-megami-tensei-devil-summoner-soul-hackers-199", "name": "Shin Megami Tensei: Devil Summoner: Soul Hackers (1997)", "name_original": "Shin Megami Tensei: Devil Summoner: Soul Hackers (1997)", "description": "<p>Shin Megami Tensei: Devil Summoner: Soul Hackers is a role-playing video game developed by Atlus. Forming part of the Megami Tensei series, Soul Hackers is the second game in the Devil Summoner subseries. Originally published by Atlus for the Sega Saturn in 1997, it was later ported to the PlayStation (1999) and Nintendo 3DS (2012). The latter port was released in the West in 2013: Atlus published the title in North America, while NIS America published it in Europe.<br />\nSoul Hackers takes place in the fictional Amami City, a technologically-advanced Japanese metropolis. The main protagonist, a member of a hacker group called the Spookies, gains access to the closed beta for Paradigm X, an online game designed to connect the citizens of Amami. While in there, the protagonist encounters supernatural forces, then must work with the Spookies to investigate attacks by demons across the city. Aiding him is Nemissa, a demon who possesses the body of his friend Hitomi Tono.<br />\nDevelopment of Soul Hackers began in 1996, after the success of the original Devil Summoner. Original producer Kouji Okada and character designer Kazuma Kaneko returned to their respective roles. The first two versions of Soul Hackers were never released overseas, but the Nintendo 3DS version was localized into English. The game has generally garnered a positive reception, although some reviewers criticized the visuals and music.</p>", "metacritic": null, "released": "1997-11-13", "tba": false, "updated": "2024-01-23T12:13:45", "background_image": "https://media.rawg.io/media/games/62a/62a59954677acbfadc4814409bca58ad.jpg", "website": "", "rating": 4.0, "rating_top": 5, "added_by_status": {"yet": 4, "owned": 3, "beaten": 4, "toplay": 11, "dropped": 2, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 6, "suggestions_count": 323, "game_series_count": 7, "reviews_count": 6, "platforms": ["PlayStation", "SEGA Saturn"], "developers": ["Atlus"], "genres": ["RPG"], "publishers": ["Atlus", "NIS America", "Nippon Ichi Software"], "esrb_rating": null}