{"id": 5776, "slug": "frederic-resurrection-of-music", "name": "Frederic: Resurrection of Music", "name_original": "Frederic: Resurrection of Music", "description": "Frederic Chopin – one of the world's most talented classical composers, is brought back from the afterlife and finds that he's an involuntary part of a treacherous plan. The world of music is at the edge of destruction. Soulless music labels and mass-produced popstars have hindered all creativity. And you're the only hope of bringing it back. <br/><br/>Accompany Chopin in his amazing journey full of quirky events. Battle your opponents in musical duels, intensity of which will make your palms sweat. Enjoy an hour of hand-drawn animated comic picturing the quirky story. Play through twelve catchy arrangements of Chopin's greatest classics, each in a different musical genre. Practice your skills until perfection and become the master of the piano.<br/><br/>Features<br/><br/>- 12 fantastic remixes of classical hits<br/>- 10 colorful locations from around the world full of hidden easter eggs and jokes<br/>- An hour of outstanding animated comic<br/>- Megatons of humor<br/>- 18 achievements of all difficulties<br/>- DRM-free game soundtrack included<br/>- Trading cards<br/>- Optimized for Windows 8 touch screens", "metacritic": null, "released": "2012-01-17", "tba": false, "updated": "2024-02-10T03:33:28", "background_image": "https://media.rawg.io/media/screenshots/27a/27a3b8ec5ec35dc2756f8564282b78f2.jpg", "website": "http://forever-entertainment.com/forever/fryderyk/", "rating": 2.67, "rating_top": 3, "added_by_status": {"yet": 26, "owned": 760, "beaten": 18, "toplay": 2, "dropped": 19}, "playtime": 4, "achievements_count": 18, "ratings_count": 47, "suggestions_count": 462, "game_series_count": 0, "reviews_count": 48, "platforms": ["Wii U", "Nintendo Switch", "PC", "Linux", "macOS", "iOS"], "developers": ["Forever Entertainment", "Forever Entertainment S. A."], "genres": ["Action", "Arcade", "Casual", "Indie"], "publishers": ["Forever Entertainment"], "esrb_rating": null}