{"id": 57772, "slug": "the-silver-case-1999", "name": "The Silver Case (1999)", "name_original": "The Silver Case (1999)", "description": "<p>The Silver Case (Japanese: シルバー事件, Hepburn: Shirubā Jiken) is an adventure visual novel video game developed by Grasshopper Manufacture and published by ASCII Entertainment for the PlayStation in 1999. It was directed, designed and co-written by Goichi Suda. A remastered version was released digitally by Grasshopper Manufacture worldwide for Microsoft Windows and OS X in 2016, while a port for the PlayStation 4 was released by NIS America in 2017; a Japanese release of the PlayStation 4 version is scheduled for March 2018 by Nippon Ichi Software. A port for the Nintendo DS was also in development, but never released due to Suda's dissatisfaction with the final product.</p>\n<p>The setting is contemporary Japan, and takes place in a universe which would be used by Suda in later works. Within a city called the 24 Districts, a series of bizarre murders occurs, prompting the 24 Districts Police Department to send two detectives from their High-degree Murder Division to solve the case. The killings are soon linked to Kamui Uehara, a notorious serial killer who supposedly died several years before. The gameplay revolves around text-based situations, point-and-click mechanics, and interactive question and answer segments.</p>\n<p>The Silver Case was the debut title of Grasshopper Manufacture, beginning development with the studio's formation in 1998. As they had limited staff and resources, Suda devised the window-based story-telling to make best use of their assets. The story, written by Suda, Masahi Ooka and Sako Kato revolved around themes of crime and the clashing of people on different sides: its themes would become a recurring feature in later titles developed by Suda. The character designs were done by Takashi Miyamoto, while the music was composed by Masafumi Takada.</p>\n<p>Prior to its remaster, the game did not see a release outside Japan, despite Suda wanting a Western release: this was attributed by Suda and others to concerns over properly translating and localizing the game's dialogue and text-based puzzles. The localization was handled by Active Gaming Media in collaboration with Grasshopper Manufacture. The original version was positively reviewed in Japan, while the remaster received generally mixed opinions from journalists. A sequel for mobiles was released in 2005, receiving a remake following the success of the remaster's release.</p>", "metacritic": null, "released": "1999-10-07", "tba": false, "updated": "2019-08-28T21:59:42", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 2, "beaten": 2, "toplay": 5, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 2, "platforms": ["PlayStation", "PlayStation 4", "Classic Macintosh", "Linux", "PC"], "developers": ["Grasshopper Manufacture"], "genres": ["Adventure"], "publishers": ["ASCII"], "esrb_rating": null}