{"id": 57784, "slug": "soviet-strike", "name": "Soviet Strike (1996)", "name_original": "Soviet Strike (1996)", "description": "<p>Soviet Strike is a helicopter-based shooter game developed and published by Electronic Arts for the PlayStation in 1996 and the Sega Saturn in 1997. The game is a sequel to the Strike games which began on the Sega Genesis with Desert Strike: Return to the Gulf. Soviet Strike is the series&#39; first installment for a 32-bit console and was first conceived as 32-bit Strike. Early on, it was intended for the 3DO console, before development changed to the PlayStation.<br />\nSoviet Strike is set after the disintegration of the Soviet Union, and takes place in a fictionalised Russia, Eastern Europe and around the Caspian Sea. The player pilots an Apache helicopter and battles with the forces of Shadowman, a renegade ex-communist figure. Like its predecessors, the game features shooting action mixed with strategic management of fuel and ammunition, but has more authentic 3D graphics, as well as a modified overhead - as opposed to isometric - perspective. The game also features a more realistic enemy artificial intelligence and environment. Critics received the game positively, praising the graphics and full motion video, while commentary on the gameplay and difficulty was more mixed.<br />\nIt was released on the PlayStation Store in Japan on November 11, 2009 and in North America on September 14, 2010.</p>", "metacritic": null, "released": "1996-10-31", "tba": false, "updated": "2023-10-11T19:37:13", "background_image": "https://media.rawg.io/media/games/e82/e8245c9f142791410e5db12e4044e7f5.jpg", "website": "", "rating": 3.83, "rating_top": 4, "added_by_status": {"yet": 5, "owned": 8, "beaten": 3, "toplay": 4, "dropped": 8}, "playtime": 0, "achievements_count": 0, "ratings_count": 12, "suggestions_count": 403, "game_series_count": 5, "reviews_count": 12, "platforms": ["PlayStation", "SEGA Saturn"], "developers": ["Electronic Arts", "Sony Interactive Entertainment"], "genres": ["Action", "Shooter", "Strategy", "Simulation"], "publishers": ["Electronic Arts"], "esrb_rating": "Teen"}