{"id": 577972, "slug": "whiskers-expiringegg", "name": "Whiskers (expiringegg)", "name_original": "Whiskers (expiringegg)", "description": "<strong>Project description</strong>\n<p>This is a University Project for which we were asked to create a 2D platformer that follows similar gameplay to popular titles such as <em>Hollow Knight</em>. The game is to have two levels (areas/scenes) that explore the best practices in the 2D platformer genre. This task required us to have the following requirements in the game:</p>\n<p>Player controller\r\n</p>\n<ul><li>Jump\r\n</li><li>Double Jump\r\n</li><li>Dash\r\n</li><li>Attack\r\n</li></ul>\n<p>Game Mechanics\r\n</p>\n<ul><li>AI Enemies / NPC’s\r\n</li><li>Movement / Patrols for AI\r\n</li><li>Respawning / Checkpoints\r\n</li><li>Unlockable Abilities\r\n</li><li>Dynamic Camera Controls\r\n</li></ul>\n<p>The abilities are supposed to let you progress through the game; without a certain ability the player should not be able to move onto next main area. Using combinations of abilities to traverse is desirable. The game and flow should feel good for the player and feel polished.\r\n</p>\n<p>Deadline is 19th March 2021.</p>\n<strong>Theory Explored</strong>\n<p>Main focus was on how to get engaging level design to get the player immersed in my game.\r\n</p>\n<p>The level should be fun to navigate through and this can be done through giving the player different levels of challenge. The difficulty should not be linear. It should fluctuate to reward the player with a sense of mastery when they complete the difficult area. This is an intrinsic way of providing player with motivation to keep going with the game too.\r\n</p>\n<p>I explored ways to motivate the player through my gameplay. Through exinitic, intrinsic and narrative methods. My extrinsic way is giving the player points from killing enemies and chests around every main area to give them reason to explore further. My narrative method is through the player playing my game to get that end of saving their cat. My story does not rely on words to tell the story, Letting the player find out for themselves what is happening and what is going to happen and not explicitly telling them is what makes a good design too as I found in my research.\r\n</p>\n<p>The use of mechanics to progress, was a big thing to look at too. The game should put obstacles that block the players path. My game has a wide range from enemies to rocks. Without certain ability the obstacle cannot be destroyed.\r\n</p>\n<p>Accessibility was a huge thing I tried to explore and put my time into, to give any player the best experience. I wanted the game to control through only the keyboard for someone who may have limited mobility as well as implementing a controller for the same reason as well for a player who prefers to use controller. I tried to find the best way to do this. I found that <em>Momodora: Reverie Under the Moonlight</em> has amazing controls perfect for how I want them using QWEASD for abilities and Arrow Keys for movement. it sounds like it would be hard to learn but once you get used to it, it is amazing!\r\n</p>", "metacritic": null, "released": "2021-03-22", "tba": false, "updated": "2021-03-26T11:29:59", "background_image": "https://media.rawg.io/media/screenshots/8ad/8ad158872640e413e31d75c1f5f9867a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 96, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["expiringegg"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}