{"id": 577951, "slug": "keep-trying-zombie-apocalypse", "name": "Keep Trying - Zombie Apocalypse", "name_original": "Keep Trying - Zombie Apocalypse", "description": "<p>Get ready for a third person-shooter of a very different kind. \r\n  </p>\n<p>Keep trying – Zombie Apocalypse is a single player game which is made especially for twich streamers and their community. The current version is only an alpha-version. Therefore the game will be extended by functions little by little, based on the feedback. \r\n  </p>\n<p>After her parents fell victim to zombies after a terrible incident, 19 year old Faith sets off to find her younger brother Jo. She shows no mercy towards the zombies. \r\n  </p>\n<p>Prove yourself fighting against zombies in the role of Faith in different levels – the best thing is: your community helps you. <strong>Your community is able to support you during your fight against the undead monsters with munitions and new weapons. Watch out: Simultaneously they can also set a new horde of zombies.</strong> But there is much more in this game: \r\n  </p>\n<p>1. Choose between three different long-range weapons: \r\n  </p>\n<ul><li>pistol: infinite munition but little damage \r\n  </li><li>rifle: 300 munition and medium shooting speed but little damage \r\n  </li><li>shotgun: little munition but high damage \r\n  </li></ul>\n<p>2. Collect useful items such as munitions, gold and booster for more life points, more damage and more attack speed \r\n  </p>\n<p>3. Experience points save you risings into higher levels with even more challenges \r\n  </p>\n<p>4. Defeat the final enemy and stop the zombie apocalypse \r\n  </p>\n<p>And don’t forget: “What is dead once, should stay dead.” \r\n  </p>", "metacritic": null, "released": "2021-03-22", "tba": false, "updated": "2021-03-26T11:25:17", "background_image": "https://media.rawg.io/media/screenshots/aa8/aa8a5f5bc5bbac6f926940824c4f60fe.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 214, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Upjers"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}