{"id": 5779, "slug": "synesthetic", "name": "Synesthetic", "name_original": "Synesthetic", "description": "\"Synesthetic is a game any music lover should pick up.  When I played my first round, all I could do was smile.  It looks good, it feels good.  It’s a trip.  This game won’t be leaving my iPad anytime soon.\" Gamezebo.com (4.5/5 stars)<br/><br/>\"...it’s an experience as beautiful and transcendental as it is strange and wonderfully horrifying due to the impressive neon techno visuals.\" 148Apps.com (4/5 stars)<br/><br/>\"A fusion of Audiosurf and Boost, Synesthetic takes you on a trippy ride through your own music while basing its game around the simplicity of tilting.\" AppSpy.com (4/5 stars)<br/> <br/>Experience your music like never before with Synesthetic, the first IOS game that truly syncs with your music. Embark on an out of this world rollercoaster ride, dodging obstacles and going though loops, trying to improve your highscore. Everything (the speed, obstacles and colors) is in tune to your music.<br/><br/>-any song in your iPod library is a new level<br/>-the game runs at a smooth 60 fps on all iDevices (3rd gen and later)<br/>-3 different game modes for each song<br/>-full iPad3 and iPhone 5 support<br/>-every song has its own leaderboards<br/>-GameCenter integration for achievements<br/>-multiple color themes<br/>-2 control schemes (tilt and joystick).<br/><br/>*The game doesn't work with DRM protected songs (music bought from iTunes before 2009).", "metacritic": null, "released": "2012-07-19", "tba": false, "updated": "2019-07-30T11:01:55", "background_image": "https://media.rawg.io/media/screenshots/30f/30f7470f25e242bcd34a15f8e875db4a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 192, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Alex Dantis"], "genres": ["Racing"], "publishers": ["Alexandru Eugen Dantis"], "esrb_rating": null}