{"id": 578117, "slug": "fractionmagic", "name": "FractionMagic", "name_original": "FractionMagic", "description": "<p>DelleRae, is a team of two developers, Esther Edwards and Ladelle Augustine. We came together for the MSU Texas Game Jam to create the game “Fraction Magic.” In implementing the game, the system, we used, is Construct 2. When preparing for Game Jam we brain stormed ideas and set a day on when we would narrow down the ideas. On the First day of Game Jam, we narrowed down our ideas to creating a match game that the focus was matching fractions to their visual representation of that fraction. Next, went over the rules for the contest, all the things we needed to complete and the time frame we had. Then, we designed the logo, the back and front of the cards and the board for the game.  Later, that day we watched a few tutorials about G-develop and Construct 2 to understand the systems we were going to use. On Saturday, we implemented code and fixed bugs in the program. We had a few design, grid size and card size issues, that took longer than expected.  On Sunday, we finished up the code, added music and fine tuned the game and reflected on the process. The music we used.</p>What We Learned:<br/>We learned how to use Construct 2 and G-Develop. It was not a huge learning curve, but it was nice to experience a different system.  We developed an understanding of grid sizes and the different nuances of Construct 2.<br/>Music:<br/>Jordan Ottesen – Water Theme<br/>Michael Scott Earle – Space Knight<br/>Videovo.net – Hands Clapping<br/>How to Use Game:<br/>This game’s purpose is to match the fraction with the visual representation of the fraction.  The user will click on a card and click on another card and try to match the cards. When you match a card, you will see the points to the right. The tally of the turns the user taken until they matched them all.", "metacritic": null, "released": "2021-03-22", "tba": false, "updated": "2021-03-26T12:08:51", "background_image": "https://media.rawg.io/media/screenshots/9a3/9a302ffc6824d228978c2c92efa6ec69.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 14, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["DelleRae"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}