{"id": 578158, "slug": "codewalkers", "name": "CodeWalkers", "name_original": "CodeWalkers", "description": "Raise your CodeWalker. <br/>Customize their skills. <br/>Battle the world. <br/><br/><strong>...welcome to the world of CodeWalkers. </strong><br/><br/>In the not-so-distant future, humanity’s reliance on technology has grown beyond what we could have imagined. Cyberspace connects everything, from phones to appliances and everything in-between. But while almost anyone can operate these devices, precious few know how to develop, change, or protect them. Those who do are known simply as Hackers. <br/><br/>Hackers rely on their virtual partners, sentient developmental AI known as CodeWalkers, to program changes in cyberspace. Over recent decades, these AI have branched into three main categories:<br/><br/><ul><li>The pacifist and protection-focused <strong>Whitehats</strong>.<br/></li><li>The aggressive and manipulative <strong>Blackhats</strong>. <br/></li><li>The disciplined and balanced <strong>Redhats</strong>. </li></ul><br/>Hackers work with their CodeWalkers to build their affinity toward the needed skills or abilities for their work and goals. Some focus on becoming network-repairing healers, while others focus on program-destroying capabilities. And while a never-ending rivalry exists between these ‘tribes’, a crisis arises that will require them to stand and fight side-by-side: the <strong>Vagrants</strong>. <br/><br/>Nobody knows where these corrupted and autonomous AI came from. While research is still ongoing, what we do know is that they appear to be aggressive, corrupt CodeWalkers that multiply like the computer viruses of old. You can never turn your back on a Vagrant – it will be the last thing you do. <br/><br/>Now, Hackers and their CodeWalker partners are training worldwide to face this new threat. So go, choose your partner, guide them in their growth, customize their abilities… and get ready for the fight of your life.", "metacritic": null, "released": "2021-03-26", "tba": false, "updated": "2021-03-29T02:28:25", "background_image": "https://media.rawg.io/media/screenshots/a41/a41e60dbd1be6e3bfbc3101c16f0b42d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 120, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Matt \"TheRedRanger\" Nikitakis"], "genres": ["Action", "Simulation"], "publishers": ["Matt \"TheRedRanger\" Nikitakis"], "esrb_rating": null}