{"id": 578181, "slug": "entodrive", "name": "Entodrive", "name_original": "Entodrive", "description": "<h3>Gameplay : </h3>• Hack Entodrive into your crew!<br/><br/>• Battle Entodrive in turn based combat.<br/>• Help the people of Cache Isle with Entodrive related incidents.<br/>• Thwart the Forever Corporation's raid of the Isle.<br/>• Face your dev partner Max Jai in battle.<h3>Plot : </h3>Play as one of the developer's for Entodrive AR. An augmented reality game that was made to gamify an outbreak of computer viruses. Your partner in development Max Jai was the face of business, but never got his hands dirty to develop the game. He calls upon your help when realizing Entodrive aren't behaving how they were programed. Entodrive begin attacking and possessing objects in the real world. The Entodrive have become something more than you intended. It is up to you and Max Jai to go on a quest to rediscover what Entodrive means to the people of Cache Isle and save them from Entodrive related incidents.<br/><br/><h3>State of the Early Access Build</h3>Alpha Build #0.05<br/><br/><strong>Gameplay Currently Implemented : </strong> <br/>Build state is in alpha with a vertical slice that showcases the design pillars.<br/>2 towns, a cave, and two routes to explore.<br/>Travel through Javapool, Crystal Cave, Crystal Town, Crystal Cove, Lua Road, and Python Port.<br/>Choose your starting Entodrive.<br/>Hacking Entodrive.<br/>Entodrive Upgrades.<br/>Turn based combat.<br/>Moves with different abilities.<br/>Battle other crews.<br/>Encounter Entodrive in strange locations.<br/>Character model choice selection.<br/>Fast Forward binded to a button with varying speeds in the options menu.<br/>Debug commands. (cheats)<br/><br/><strong>Build Transparency : </strong> <br/>Some future areas are explorable, but are missing key elements like NPC, dialogue, events, correct warp positions,invisible walls, battles, ext. <br/>100+ Monsters are programmed in currently. <br/>If you fall through the floor, enable moon jump in the options menu and hold v.<br/>Basic battling system is in place and is missing some key features.<br/>Missing from the battle system is, some status moves, using player Items, player battle lose sequence, and NPC challenge name plates.<br/>Some NPCs in the overworld don't have dialogue setup yet.<br/>Storage system is capped. It is recording captured data up to 150, but displays less. I'm working on UI to scroll through pc boxes, so you can access all your monsters.<br/>Overall Move Consistency, and effects need work. <br/>Items aren't usable, and obtaining dialogue is broken. <br/>Incorrect post battle level Exp scaling<br/><br/>", "metacritic": null, "released": "2021-03-26", "tba": false, "updated": "2021-03-29T02:43:56", "background_image": "https://media.rawg.io/media/screenshots/ae4/ae4940913b7f7672edc80e0b03de8cc7.jpg", "website": "https://www.indiedb.com/games/entodrive", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 173, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Noah Williams"], "genres": ["Adventure", "RPG"], "publishers": ["Day Dreamer Games"], "esrb_rating": null}