{"id": 578182, "slug": "thymesia", "name": "Thymesia", "name_original": "Thymesia", "description": "<p>Story<br />\nA kingdom once thriving on the power of alchemy enters an age of calamity. After discovering the price behind alchemy, an attempt to stop the use of  it  backfired. Within a few days, the kingdom was in chaos and the streets infested with monsters.<br />\nThe key to understanding all of this is in Corvus’  hands, but he  has  lost his memory.  The truth can only be found within his memories, but every time he dives  back in, he only finds more secrets.FeaturesHarness the Plague: Seize the disease from  gruesome bosses and wield them as weapons. Give them a taste of their own medicine. This is the only way to survive this desolate kingdom.<br />\nEmbrace the Raven: Shift into your raven form during battle. Throw your feathers like daggers and execute enemies with the swiftness of a raptor.<br />\nFight Your Way: Upgrade and modify your basic movements and plague weapons. Build your very own play-style and prepare for the challenges in your way.<br />\nShattered Memories: Recover your memories through adventures. With different choices you’ve made and items you’ve collected, you’ll get different endings. Stitch together your own truth.</p>", "metacritic": null, "released": "2022-08-18", "tba": false, "updated": "2024-04-05T13:11:46", "background_image": "https://media.rawg.io/media/games/829/829dcd5947ea2f62d66ecf2111ff2a3d.jpg", "website": "https://www.team17.com/games/thymesia/", "rating": 3.26, "rating_top": 3, "added_by_status": {"yet": 30, "owned": 150, "beaten": 38, "toplay": 70, "dropped": 24, "playing": 7}, "playtime": 3, "achievements_count": 61, "ratings_count": 54, "suggestions_count": 533, "game_series_count": 0, "reviews_count": 57, "platforms": ["PlayStation 5", "Xbox Series S/X", "PC", "Nintendo Switch"], "developers": ["OverBorder Studio"], "genres": ["Action"], "publishers": ["Team17 Digital"], "esrb_rating": "Mature"}