{"id": 578164, "slug": "out-of-the-park-baseball-22", "name": "Out of the Park Baseball 22", "name_original": "Out of the Park Baseball 22", "description": "<p>Out of the Park Baseball 22 - the 22nd version of the award-winning sports strategy series - is a giant leap forward for the beloved franchise. Unmatched depth, authenticity licensed by MLB and the MLBPA, and a bounty of offline and online gameplay make Out of the Park Baseball 22 an unparalleled experience!<br />\n“OOTP is an astonishing accomplishment!” - Boston Red Sox Principal Owner John W. Henry<br />\nOut of the Park Baseball 22 is a baseball strategy game that immerses you in a baseball universe unlike any other! Manage every aspect of your organization, from trades to free agency, finances to scouting, strategies to personnel. From the major leagues all the way down to the minor leagues, the entire operation is under your control. Start with the current real MLB or KBO teams with up-to-the-minute information, or go back in time to any club in the entire history of MLB baseball.<br />\nDiscover new talent, draft the next superstar, negotiate with free agents, enter trade talks with other teams, build your dynasty and guide a franchise into an infinite future! As a manager, dive into the more hands-on management and set your team&#39;s lineups, pitching staffs, in-game strategy and call the shots from the dugout. You can oversee your league at a high level and play entire seasons in minutes, or play out each game in the immersive 3D game mode, managing play by play or even pitch by pitch. OOTP has it all covered!<br />\nHere are just some of the new features this season!<br />\nIncredible brand-new 3D Stadiums for every MLB club<br />\nAll new coaching system with major impact across your organization<br />\nAll new team and player strategies to maintain complete control of your team<br />\nAll new Trade Settings and Strategies and Trade AI to make smarter and more realistic transactions<br />\nAll the real 2021 teams, players, schedules, and rules, including Live Starts all 2021 season long! Pick up and play at any moment in time with the latest rosters, standings, stats, trades, injuries, free agents, and more!<br />\nNewly upgraded Ballpark Construction Kit 2.0 with loads of new features and elements<br />\nAll new Perfect Draft mode in our popular Perfect Team persistent online competition<br />\nAll new Perfect Team 22 features, strategies, cards, missions, competitions, and more!<br />\nMuch more!<br />\nPlay on your own, play with friends in online leagues, and play against tens of thousands of others around the world in our persistent online Perfect Team mode! There are so many ways to have fun.<br />\nOut of the Park Baseball 22 is the best version in franchise history. Built upon the foundation of a series that has twice won Metacritic’s PC Game of the Year - the only game to ever do that - it delivers unprecedented baseball authenticity across the board.</p>", "metacritic": null, "released": "2021-03-26", "tba": false, "updated": "2023-03-31T08:12:21", "background_image": "https://media.rawg.io/media/games/4cd/4cd7fcdbb284c8b0b903e9f9ace22940.jpg", "website": "https://www.ootpdevelopments.com/out-of-the-park-baseball-home/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 20, "dropped": 1, "playing": 1}, "playtime": 17, "achievements_count": 169, "ratings_count": 2, "suggestions_count": 276, "game_series_count": 0, "reviews_count": 2, "platforms": ["Linux", "macOS", "PC"], "developers": ["Out of the Park Developments"], "genres": ["Strategy", "Simulation", "Sports", "Indie"], "publishers": ["Out of the Park Developments"], "esrb_rating": null}