{"id": 578138, "slug": "dread-x-collection-the-hunt", "name": "Dread X Collection: The Hunt", "name_original": "Dread X Collection: The Hunt", "description": "<p>The next chapter in the haunting Dread X Collection series. Co-produced by the legendary David Szymanski (DUSK, The Music Machine, Squirrel Stapler), Dread X Collection: The Hunt showcases 7 all-new short horror shooters from a handpicked selection of creative and unique indie developers.</p>\n<p>Continuing the Dread X Collection story, you play as series newcomer Artemis. Driven by a cryptic message recorded by someone from her past, Artemis makes her way to the ARK 2 research base. Explore the abandoned base and uncover the mystery of what happened. If you&#39;re tough enough, you just might save the world.</p>\n<p>The Hunt was conceived and developed as a collaborative effort between Dread XP and David Szymanski. The devs were selected to represent a mix of the wide wild world of indie shooters. The timeframe they were given was doubled (from 10 to 20 days) so as to give them more time to develop and hone their ideas. It&#39;s still the short and creative anthology horror you know and love, but with a little more shine.</p>\n<p>Features:</p>\n<p>7 new short horror shooters from talented and creative indie devs<br />\nA robust arctic base to explore<br />\nAll shooters (be it a gun, a camera, or both!)<br />\nA new mystery to uncover as part of the Dread X Collection universe<br />\n8-12 hours of playtime</p>", "metacritic": null, "released": "2021-04-12", "tba": false, "updated": "2024-01-18T08:28:21", "background_image": "https://media.rawg.io/media/screenshots/ba0/ba04e30696b428bb85285b921abe4d7a.jpg", "website": "https://www.dreadxp.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 61, "beaten": 3, "toplay": 7}, "playtime": 3, "achievements_count": 8, "ratings_count": 4, "suggestions_count": 386, "game_series_count": 3, "reviews_count": 4, "platforms": ["PC"], "developers": ["David Szymanski", "Vidas Salavejus", "DreadXP", "Dread XP", "Akuma Kira", "Wayward Preacher", "Mr. Pink", "Redact Games", "Christopher Yabsley", "Philisophic Games", "Dan McGrath", "Abbey Smith", "TorpleDook"], "genres": ["Action", "Shooter", "Adventure"], "publishers": ["DreadXP", "Dread XP"], "esrb_rating": null}