{"id": 578160, "slug": "attic-2", "name": "Attic", "name_original": "Attic", "description": "The eleven-year-old boy Theo, who had a fire in his house, had to move to live with his grandmother in a far away city. Left without friends and video games, the only thing left to think about was school. The boy's life changed even more when he met a strange creature living right above his room. During the day, when it is light, these creatures are quite harmless. But when the sun goes down and night comes... everything changes and they perceive people only as food. But who knows, what if they might be good friends?<br/><br/><br/><br/>Explore your grandmother's house day and night. Meet and chat with new people. Make different choices that can change the course of the story. Choose what to ask and what to answer, as well as make decisions at some points in the game that may affect the further plot. The more you pay attention to different characters in communication, the more often you will meet them in the further plot. Simple controls: explore objects and move between locations with one button \"Enter\". The game can be saved at any time, as it is convenient for you.<br/><br/><strong>Game Features:</strong><br/><ul><li>Pixel graphics<br/></li><li> Freedom of choice<br/></li><li> A large number of dialogues<br/></li><li> Save at any time<br/></li><li> Simple control</li></ul><br/><strong>Управление:</strong><br/><ul><li>Arrows - Movement<br/></li><li>Enter - interaction<br/></li><li>Esc - Menu</li></ul>", "metacritic": null, "released": "2021-03-31", "tba": false, "updated": "2021-03-29T02:29:43", "background_image": "https://media.rawg.io/media/screenshots/661/6611be5d0233cb814aee319c9a3ab889.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 78, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["AleksandrMelnik"], "genres": ["Adventure"], "publishers": ["AleksandrMelnik"], "esrb_rating": null}