{"id": 578287, "slug": "boom-block-puzzle", "name": "Boom: Block Puzzle", "name_original": "Boom: Block Puzzle", "description": "Block puzzle with bomb mode is ready to play now!<br/>Boom mode is new version for block puzzle games, you need to destroy the boom before it ends. You do not confuse this block puzzle games with other games, we created new block puzzle in boom mode. <br/>Awesome, Let's play this block puzzle games with boom mode.<br/><br/>HOW TO PLAY BLOCK PUZZLE: BOOM MODE?<br/>1. Simply drag the blocks to move them.<br/>2. Try to create full lines on the grid vertically or horizontally.<br/>3. Blocks can't be rotated.<br/>4. Boom is counting, try to remove them before it start a bad explosion.<br/><br/>WHY YOU NEED TO PLAY BLOCK PUZZLE: BOOM MODE?<br/>★ Exquisite Game Interface!<br/>★ Easy to play, and classic brick game for all ages!<br/>★ It is easy to play.<br/>★ Block Puzzle Classic.<br/>★ Many type of Telerisk like blocks.<br/><br/>The boom will appear to bring exciting to the game. You will find the difficulty with boom mode and especially the competition to the last seconds.<br/><br/>In the game , you can use some items for excellent:  Destroy all bomber on screen. The more boom you destroy the more score you get.<br/><br/>Try match with other block to get the combo point: you complete rows or columns can be get extra points. Let’s enjoy!<br/><br/>The great thing that you get is all interesting game by this effect so good, combos came from 2 bombs, explosion can be make a extreme effects to your puzzle block.<br/><br/>All the blocks, can be drag and color like Jewels, but, don't let boom cool-down destroy it! Score of your game can be submit to Services to create leader board - the challenge from over the world with the same hobby with Jewels Puzzle Style, or puzzle block breaking, or blocks matching game style.<br/><br/>if you like this game, please feedback, your feedback will send to us, we will upgrade the game, fix bugs, and complete free challenge for you.", "metacritic": null, "released": null, "tba": false, "updated": "2021-03-29T03:55:57", "background_image": "https://media.rawg.io/media/screenshots/888/88883ca8573a11125449c6a26c6922ca.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 102, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["KT Mob"], "genres": ["Casual"], "publishers": [], "esrb_rating": "Everyone"}