{"id": 578264, "slug": "rolly-paper-toilet-paper-line", "name": "Rolly Paper: Toilet Paper Line", "name_original": "Rolly Paper: Toilet Paper Line", "description": "• 3D PAPER ROLLING GAME<br/>Rolly Paper – Toilet Paper Line is one of the best 3D tissue paper rolling games, with high-quality graphics, One-Touch control, cool animation effects, and super game mechanics. It will take you through an awesome world filled with various quests and missions and challenging traps and obstacles for an amazing gaming experience. Take a break from your work and refresh your brain in this new toilet paper clicker game. You’re going to love it!<br/><br/>• SLIDE, DODGE, COLLECT<br/>With Rolly Paper – Toilet Paper Line, all you need to do is use your skills to slide left and right to collect as many toilet paper rolls as possible. Build your path, dodge the traps and obstacles, and enjoy a surprising level-end challenge! Everything is simple and easy with this amazing toilet paper run game!<br/><br/>• HIGH-QUALITY ARCADE GAME<br/>Rolly Paper – Toilet Paper Line has various features that will enhance your experience. Be the master of tissue paper roll game and show your sliding skills, move left and right to collect as much toilet paper as possible to get to the finish line, avoid the challenging traps and obstacles, collect coins by moving the toilet paper, increase your score and collect star bonuses at the end of the game, customize your toilet paper and try to get the jackpot, explore our challenging levels, experience the satisfaction of 3D crazy roll games, and enjoy challenging your friends and family! You won’t regret playing this amazing paper line 3D game.<br/><br/><br/>• Features •<br/>- Simple, easy, and intuitive toilet paper run game - Smooth and responsive swiping controls<br/>- Hundreds of exciting levels<br/>- Challenging traps and obstacles<br/>- Toilet paper customization<br/>- Collect coins and try to get the jackpot - Totally free<br/><br/>Are you ready to play one of the most exciting toilet roll games? If yes, the new paper run arcade game is here to free you of your boredom. Download and play Rolly Paper – Toilet Paper Line | 3D Rolling Game", "metacritic": null, "released": "2021-03-14", "tba": false, "updated": "2021-03-29T03:42:06", "background_image": "https://media.rawg.io/media/screenshots/f34/f341643e6373591311a245ebbe6e27ac_oiBVlqi.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 60, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["VULUSI KRISHNA"], "genres": ["Racing", "Casual"], "publishers": ["VULUSI KRISHNA"], "esrb_rating": "Everyone 10+"}