{"id": 578259, "slug": "cupcake-crew-yum-run", "name": "Cupcake Crew: Yum Run", "name_original": "Cupcake Crew: Yum Run", "description": "• WELCOME TO THE CREW!<br/>Come join the family and be part of Cup Cake and his Crew!  In Yum Run the Cupcake Crew are competing in a series of games that involve running, racing, sliding, flying and even freezing time.  All game modes are quick and EASY TO LEARN and tons of FUN to PLAY!<br/><br/>• GAMES IN THIS VERSION<br/>Time Freeze!  -  A single tap game where you tap and hold to freeze time.  Watch satisfying obstacles swing and twist through the air and narrowly dodge them as you time your taps to slow obstacles to sneak by.  Every fifth level you get a special surprise!  <br/><br/>Kart Race! - In Kart Race you race against other go carts to try and get to the finish line first.  The track is twisty and full of obstacles.  But there’s a secret to your kart…it can jump!  Jump off the track and find shortcuts to pass the other players to claim first place!  Easy to learn and hard to master.  <br/><br/>• NEW GAMES ADDED EVERY MONTH<br/>DISCOVER, UNLOCK and PLAY your way through multiple game modes, worlds, color schemes and more.  Come explore racing games, runner games, bonus stages and mini games.  YumRun is not like other games that get boring because they never get updated.  Yum Run constantly has new game modes and styles of games being added every single month.  From exciting new mini games to new characters and new adventures for you to play!  <br/><br/>• UPGRADES AND CUSTOMIZATION<br/>Play as your favorite snack with crazy characters such as; Magic Dein the cupcake, Goub the Ice cream bar, Funky Fries, Slushy, Hotdog, Popcorn and so many more!  Not only can you play as your favorite snack but you can customize them as well.  Pick out their faces, what their ride is and so much more customization on the way!  Each game mode allows you to upgrade your characters.  So they can run faster or have more powers.  <br/><br/>• PLAY WITH SOCIAL MEDIA INFLUENCERS<br/>Come play the game that you’ve seen on social media!  Some of the largest social media influencers in the world are behind Yum Run.  People like the magician Julius Dein or prankster Goubtube and many many more!  Be part of the excitement and play the game that will be seen across the internet!", "metacritic": null, "released": "2021-03-23", "tba": false, "updated": "2021-03-29T03:39:41", "background_image": "https://media.rawg.io/media/screenshots/5c3/5c39b9454b8743f65e5048dab43c4d11_Vo2FEz1.jpg", "website": "http://cupcakecrewyumrun.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 86, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["1208 Productions"], "genres": ["Action", "Racing"], "publishers": ["1208 Productions"], "esrb_rating": "Everyone 10+"}