{"id": 578255, "slug": "world-cricket-battle-2-wcb2", "name": "World Cricket Battle 2 (WCB2)", "name_original": "World Cricket Battle 2 (WCB2)", "description": "World Cricket Battle 2 alias WCB2 will give you a complete experience of Playing Real Cricket in your iPhones and iPads! WCB2 has plenty of first of its kind Cricket features including Multiple My Careers, Real-Time Batting Multiplayer, Rain Interruption, Ultra Edge Detection with Snickometer, Day to Night Weather Progression, D/L Method, Players Dressing Room, Players Bat Change, Hat/Cap change during gameplay, Drinks to boost batting power, Commentary Box, Cheer Leaders, Net Practice, Dream XI, Variety of World Championships like World Cup, T20 Championship, Asian Cup, Indian League, Pakistan League, Aussie League and Bangladesh Premier Leagues and Clash of Fans – A New League Tournament featuring our fans.<br/><br/>If you are a die-hard cricket fan, then World Cricket Battle will be your best cricket buddy. <br/><br/>NOTE: Your suggestions and feedbacks are welcome to worldcricketbattle@gmail.com. <br/><br/>MOST AUTHENTIC MULTIPLE MY CAREER MODES<br/>You will be starting your cricket career in Street Cricket matches and you will progress through varies stages of Cricket Journey until you reach the retirement age! In every stage, you have to accomplish certain target scores and milestones to move forward. You will be made as your Cricket Team Captain at certain stages and with your Cricket Captaincy Skills you can hold your captainship.<br/><br/>MULTIPLAYER MODE<br/>Play Real Cricket battles in Private Room or Random Match-making. Enjoy the game with fun-filled emojis.<br/><br/>AUCTION MODE<br/>Introducing Auction mode for all IPL fans!<br/><br/>RAIN INTERRUPTION &amp; D/L METHOD<br/>World Cricket Battle is the First Ever Mobile Cricket Game to feature Rain Interruption with accurate D/L Method Implementation. <br/><br/>GAME PLAY<br/>World Cricket Battle promises the most engaging &amp; thrilling gameplay ever for a mobile cricket game. <br/><br/>WEATHER PROGRESS<br/>The Complete Weather progression from Day to Night with stunning visuals.<br/><br/>TOURNAMENTS<br/>WCB has a variety of World Cricket Championships: International World Cup, World T20 Championship, Asian Cup, Premier League Cup, Pakistan Premier League, Aussie Big Bash League Cup &amp; Bangladesh Supreme League and Clash of Fans. All these teams will feature the latest updated squad and league rules.(5,10 &amp; 20 Overs available) <br/><br/>MODES<br/>Challenges Mode with 25 real-time batting challenges in it. It can be a team or partnership challenge and also playing challenges mode will help you to improve your XP Level which in turn will help you to Unlock New Features.<br/><br/>BATTING &amp; BOWLING<br/>We have included 50+ variety of Batting Shots including authentic and unorthodox shots. Also, we have included 4 types of bowling actions for Off Spin, Leg-Spin, Fast and Med-Fast.<br/><br/>STADIUMS<br/>WCB has 17 appealing International Stadiums with a cheering audience with colorful ambiance and variety of Skyboxes.<br/><br/>PLAYER CUSTOMIZATION<br/>During Batting, you can customize your batsman by Wearing Cap, Hat &amp; Changing Bat, etc.<br/><br/>Terms of Usage: <br/>http://creativemonkeygames.com/terms-of-use/<br/><br/>Privacy Policy:<br/>https://creativemonkeygames.com/privacy-policy/<br/><br/>Pro Access and VIP Premium Access are available as both Weekly and Monthly subscriptions that allow you to unlock and access various features and premium contents in the game. The feature unlocks will vary depending on the pack selected. Pro Access subscription costs 0.99 USD/week or 2.99 USD/month (or local equivalent) &amp; VIP Premium Access costs 1.99 USD/week or 3.99 USD/month (or local equivalent). The subscription costs will be charged on your iTunes account after purchase and when the subscription renews. <br/><br/>NOTE: <br/>1)\tPayment will be charged to your iTunes account at confirmation of purchase. <br/>2)\tSubscription automatically renews unless auto-renew is turned off at least 24hr before the end of the current period. <br/>3)\tSubscriptions can be managed by users. Users can cancel the subscription by going to app store account settings after purchase. <br/>4)\tThe subscription will be renewed within 24hrs of the payment date.", "metacritic": null, "released": "2018-09-14", "tba": false, "updated": "2021-03-29T03:37:51", "background_image": "https://media.rawg.io/media/screenshots/eaf/eaf21d0373622c10909f6566ab0a8fcd_EnIjCK8.jpg", "website": "https://www.facebook.com/WorldCricketBattle/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 263, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Creative Monkey Games & Technologies"], "genres": ["Simulation", "Sports"], "publishers": ["Creative Monkey Games & Technologies"], "esrb_rating": "Everyone 10+"}