{"id": 578225, "slug": "siege-of-avalon-anthology", "name": "Siege of Avalon: Anthology", "name_original": "Siege of Avalon: Anthology", "description": "Just outside the gates of Avalon, a 12 years war realizes its climax, the uneasy alliance of seven western kingdoms created the Citadel of Avalon as a mighty fortress. But in the last eight months, the Citadel has become a city of refugees, a city under siege. The Sha'ahoul, under the banner of the Shaman Warlord Mithras, are waging a genocidal war against the Citadel. Take on the role of the Hero in a richly detailed world filled with hundreds of unique NPC`s, monsters ripped from ancient lore, and invading nomadic hordes.<br/><h3> BUILD YOUR OWN CHARACTER </h3> Play as a fighter, scout, or mage, and choose from hundreds of pieces of weaponry and armor to customize your character's appearance and abilities. Learn different skills and spells to try various play styles. Add members to your Party or drop them as you advance through the game.<h3> PLAYED ANY GOOD BOOKS LATELY? </h3>Dive into the story of deception, treachery, and heroism through rich dialogues and in-game tomes. The game was designed with the idea of being a new type of book that gives a feeling of full immersion into its fantasy world.<h3> FULL ANTHOLOGY </h3> Get immediate access to the full game. Chapters one, two, and six lead you through the main story, while third, fourth and fifth chapters present the expansions that allow you to delve even further into the lore and adventures.<h3> IT'S BEEN 20 YEARS. WILL IT RUN? </h3>We are happy to bring back to life the \"Siege of Avalon: Anthology\". The game received its portion of technical care and now runs on modern operating systems without any extra shenanigans. The story, visuals, and gameplay are untouched - with all its charm and flaws. Enjoy playing the game on Windows 7 or later, improved stability and widescreen support.<h3> OPEN-SOURCE </h3>For all the years since the original release, Siege of Avalon had an incredible community around it. Once developers made the game's source code available, many fans put their time and efforts to ensure the game lives. We also want to contribute to the open source movement. Now you can find our fork of the Siege of Avalon source code over here https://github.com/SNEG-DEV/siege-of-avalon with all the enhancements done by our team. We want to thank each and every member of the community for their great support across these years.", "metacritic": null, "released": "2021-04-08", "tba": false, "updated": "2024-03-31T21:32:58", "background_image": "https://media.rawg.io/media/screenshots/60e/60e82fe9c96c8891d2c560bcd8d89a42.jpg", "website": "", "rating": 4.38, "rating_top": 5, "added_by_status": {"yet": 9, "owned": 69, "beaten": 4, "toplay": 4, "dropped": 1}, "playtime": 1, "achievements_count": 5, "ratings_count": 8, "suggestions_count": 406, "game_series_count": 0, "reviews_count": 8, "platforms": ["PC"], "developers": ["General Arcade", "Digital Tome", "Steffen Nyeland"], "genres": ["Action", "RPG"], "publishers": ["SNEG"], "esrb_rating": null}