{"id": 578376, "slug": "deja-drift", "name": "Déjà Drift", "name_original": "Déjà Drift", "description": "Stuck alone on a retro-futuristic racetrack, your only choice is to drift.  Earn as many points as possible before time runs out, and then do it again and again...  But wait, there is someone else here? And why does their driving seem so familiar?<h3>Gravity Defying Stunts</h3>Use ramps, boost pads, and alien technology to achieve unreal airtime, performing sweet flips all the while!<br/><h3>Flips!</h3>Flip and roll mid-air for a higher score! Just make sure you land on your wheels! Drift and collect tokens to earn even more points!<br/><h3>Get Rear-Ended by… Yourself?</h3>It seems you are not alone in this world, also driving around are copies of yourself! Dodge and weave between echoes of where you have been before as you navigate the stage.<br/><h3>Plan Ahead to Get Higher Scores!</h3>Your echoes aren’t just there to get in your way! Staying near them will give you points for their tricks, allowing for massive score bonuses! Try and find the optimal route and discover secrets!<br/><h3>Conquer a Variety of Game Modes</h3>Aim for a high score in the classic Echo Rally! Add a little more planning into the fold in Echo Parade! Take a tour of the scenery in Freedrive!<br/><h3>Traverse Unique Landscapes</h3>Explore a carnival suspended in space, drift through a valley derby, and discover UFOs in Area 51.", "metacritic": null, "released": "2021-03-28", "tba": false, "updated": "2022-08-19T04:43:24", "background_image": "https://media.rawg.io/media/screenshots/55b/55b2fce049f8380c20a9773af8fe4b65.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 23, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BonbonAJ", "linkoid", "rylanc9", "BAR Interactive"], "genres": ["Sports", "Racing", "Casual", "Indie"], "publishers": ["BAR Interactive"], "esrb_rating": null}