{"id": 57830, "slug": "tear-ring-saga", "name": "Tear Ring Saga", "name_original": "Tear Ring Saga", "description": "<p>Tear Ring Saga, full name Tear Ring Saga Yutona Eiyū Senki (ティアリングサーガ ユトナ英雄戦記, lit. Tear Ring Saga: Chronicles of War Hero Yutona), is a tactical role-playing game developed by Tirnanog, a development studio started by Shouzou Kaga, the creator of the Fire Emblem series, after he left Nintendo in 2000. The game featured a complicated development and initial release period, with the company receiving legal pressure multiple times from Nintendo, who felt that the game&#39;s very similar gameplay and presentation, which also featured the art of Fire Emblem: Thracia 776 artist Mayumi Hirota, infringed on their copyrights on their Fire Emblem intellectual property. Direct ties to Fire Emblem were dropped, and its original title, Emblem Saga, was changed to its final title as to not sound so similar to Fire Emblem, and the game was released in Japan on May 24, 2001, by Enterbrain, for Nintendo&#39;s competitor, Sony, on their PlayStation console. Three months after release, Nintendo took them to court over the game, and while Enterbrain was ordered to pay a fee, they ultimately retained the right to sell the game.<br />\nThe game was viewed as a success, selling over 345,000 copies in its first three months of sale in Japan. The game was never released in any other regions officially, though a rough unofficial fan translation was created and released over a decade later in 2012, with a full translation being released on November 22, 2016. Kaga and Tirnanog went on to release a vastly overhauled sequel, Tear Ring Saga: Berwick Saga, in 2005 for the PlayStation 2, though the title sold less and was ultimately the last game for the company and series.</p>", "metacritic": null, "released": "2001-05-24", "tba": false, "updated": "2019-09-12T06:38:07", "background_image": "https://media.rawg.io/media/screenshots/448/4489e1441c296a0fb04716fc6efe8cac.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 3, "toplay": 4}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 91, "game_series_count": 0, "reviews_count": 2, "platforms": ["PlayStation"], "developers": ["ASCII", "Tirnanog"], "genres": ["RPG", "Strategy"], "publishers": ["Enterbrain"], "esrb_rating": null}