{"id": 57856, "slug": "close-combat-5-invasion-normandy-utah-beach-to-che", "name": "Close Combat 5: Invasion: Normandy - Utah Beach to Cherbourg", "name_original": "Close Combat 5: Invasion: Normandy - Utah Beach to Cherbourg", "description": "<p>\n\nClose Combat 5: Invasion: Normandy - Utah Beach to Cherbourg includes a free copy of Close Combat (Windows 7 / 8 only, added as a bonus goodie)</p>\n<br/><br/>\n\nClose Combat:  Invasion: Normandy takes WWII realism back to the beaches of Northern France. Re-live the campaign that gave the Allies a foothold on the doorstep of Fortress Europe. From Utah Beach to Cherbourg, Invasion: Normandy gives you strategic and tactical control of Allied or Axis forces in the pivotal battles that determined the fate of Europe. \n\n Battle your way from Utah Beach to Cherbourg!Campain system allows movement of multiple battle groups on a strategic map of the Cotentin Peninsula.\nAccurate real-time battlefield: soldier morale and psyche model developed by a combat psychologist; realistic modeling for weapons, vehicles, historical weather and historical teams.\nTrue line-of-sight and line-of-fire gameplay; direct and indirect fire with limited ammunition.\nEasy-to-use Scenario Editor allows you to design your own battles, operations and full campaigns. You can even make special \"what-if\" scenarios to trade with other players. \nContinuity from battle to battle: your tactical successes and failure have a direct impact on the whole campaign.", "metacritic": null, "released": "1999-12-31", "tba": false, "updated": "2019-07-25T20:58:05", "background_image": "https://media.rawg.io/media/screenshots/9db/9db309932c2da3e40c4815207cdd6d05.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 10, "toplay": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 515, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Atomic Games"], "genres": [], "publishers": ["Slitherine"], "esrb_rating": null}