{"id": 579127, "slug": "stickman-hero-wizard-season", "name": "Stickman Hero Wizard Season", "name_original": "Stickman Hero Wizard Season", "description": "<p>Stickman Hero: The Wizard Seasons this is a cell phone game in the play store, if you liked the pc version you can download the cell phone version or leave a review on this link .. that would help me a lot. thanks for playing\r\n</p>\n<p>LINK: https://play.google.com/store/apps/details?id=com.alonedev.games.stickmanherowiz...\r\n</p>\n\n<p>A new battle begins, Become the stickman wizard and destroy all the enemies that pass your way.take your best weapon into battle. collect coins to test\r\n</p>\n<p>your luck in the roulette and get clothes, weapons, skills of your ancestors that will help you to finish off the enemies.\r\n</p>\n<p>Can you buy different skills rain of shots? super shots? double damage? ice shots? fire shots? all that and more to facilitate your battles, choose the best, as you can only wear 3 at the same time.\r\n</p>\n<p>you can improve your health, magic and evasion stats. remember that while you advance in level the enemies increase their statistics and become more powerful do not stay behind.\r\n</p>\n<p>complete missions and receive great rewards.\r\n</p>\n<p>Every 100 years a powerful evil force awakens that comes to end the earth, you can be the chosen one to destroy the enemies, minibosses and giants that appear in each season.\r\n</p>\n<p>Defeat the bad guys and save your world!!!!  You are the chosen one!\r\n</p>", "metacritic": null, "released": "2021-03-27", "tba": false, "updated": "2021-03-29T07:27:33", "background_image": "https://media.rawg.io/media/screenshots/756/756d0e329ddf2183ebf2f1f301232e0e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 219, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["I-ALONE-I"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}