{"id": 579359, "slug": "mildors", "name": "Mildors", "name_original": "Mildors", "description": "<p>Controls:</p>\n<p>Tap arrow keys to move, r to reset</p>\n<p>Dash mechanic:</p>\n<p>after collecting one of the dash flames, holding spacebar will slow you down for a little bit (this is shown by mildor glowing)</p>\n<p>pressing a direction while in the dash mode does a dash, this can be done multiple times for one dash orb</p>\n<p>Level select:</p>\n<p>f11 takes you to the level select, you can go to any level in the game, including unused and test ones (though you'll have to find those yourself), main levels can be assessed with the \"World\" prefix followed by the number of the level eg: World34 will put me in level 34, also the level select resets the timer so try not to go into it accidentally. Also typing \"MainMenu\" will send you back to the main menu<br/></p>\n<p>General notes:</p>\n<p>the game has a bit buggy collisions, that may or may not be fixed in the next patch, the title screen, level select and all ui are very much unfinished. Also level 50 is bad, but I don't know how to end a set of 50 levels climatically, a boss battle might work but I don't think that It really fits in with the rest of the game.</p>\n<p>if you like or dislike the game feel free to share the link to your friends :)</p>\n<p>if you dislike it feel free to give constructive criticisms in the comments<br/></p>\n<p>if you want to help give gameplay/art/ui/etc ideas you can message me on twitter @shroomium</p>\n<p>also feel free to submit full game speedruns, minimum inputs clips and glitches there aswell</p>\n\n<p>I recommend downloading instead of playing the browser version, since the browser version has some audio problems.<br/></p>", "metacritic": null, "released": "2021-03-26", "tba": false, "updated": "2021-03-29T08:28:57", "background_image": "https://media.rawg.io/media/screenshots/eeb/eebc91959db2116aaace95048cd320f8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 10, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["Shroomius"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}