{"id": 57936, "slug": "super-robot-taisen-original-generation-2", "name": "Super Robot Taisen: Original Generation 2", "name_original": "Super Robot Taisen: Original Generation 2", "description": "<p>Super Robot Taisen: Original Generation 2 (スーパーロボット大戦ORIGINAL GENERATION2, Sūpā Robotto Taisen Orijinaru Jenerēshon Tsū) is a tactical role-playing game for the Game Boy Advance. It is the second Super Robot Taisen game that was officially released in North America.<br />\nThe story selection system of Super Robot Taisen: Original Generation has been removed, replacing it with a branching storyline during certain intervals of the game. Original Generation 2 primarily focuses on one of the two selectable protagonists from the first game. In addition, a total of four new series (three of them past Super Robot Wars games, while one is a manga) appear, adding new characters, mechs, major events from the respective stories of the series and some original creations for this game itself. Coupled along with a redesigned user interface and longer battle animations, Original Generation 2 boasts an even greater amount of gameplay and background to the Original Generation universe.<br />\nOn June 27, 2007 Super Robot Wars: Original Generations, an enhanced remake of both Original Generation games, was released in Japan for the PlayStation 2.</p>", "metacritic": null, "released": "2005-02-03", "tba": false, "updated": "2023-09-22T07:38:50", "background_image": "https://media.rawg.io/media/games/eff/efffe2b87c7e3ebaf286f08135f13ee4.jpg", "website": "", "rating": 4.33, "rating_top": 5, "added_by_status": {"yet": 1, "owned": 3, "beaten": 6, "toplay": 5, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 5, "suggestions_count": 147, "game_series_count": 27, "reviews_count": 6, "platforms": ["Game Boy Advance"], "developers": ["Banpresto"], "genres": ["Action", "Strategy"], "publishers": ["Banpresto"], "esrb_rating": "Teen"}