{"id": 579483, "slug": "kazakh-jack-itch", "name": "Kazakh 'Jack (itch)", "name_original": "Kazakh 'Jack (itch)", "description": "<p>Lumberjacks normally face a lot of hazards while on the job, but this time, THE TREES FIGHT BACK.<br/>Help stranded Canadian lumberjack Forrest Woods conquer the radioactive wilds of a futuristic vision of Kazakhstan in this challenging action-adventure.<br/><br/>Featuring a fully-voiced cast, comedy-rich story, and challenging boss battles, hilarious cinematics, and 27 Steam Achievements!</p>\n<ul><li>Face hordes of mutated flora and fauna, battle fierce mutant creatures and navigate your way through a plethora of environmental hazards as you traverse the badlands of Neo Kazakhstan with your Kompany-sponsored axe.<br/><br/>\n</li><li>From the Superior National Park of Nature Reservings to the frozen steppes of the Great Northeastern Preserve Region, traverse several vast, uniquely-styled environments.<br/>\n</li><li>Multitask like a truly skilled laborer; run, jump, and crouch while swinging your axe with precision in order to survive.<br/>\n</li><li>Experience an adrenaline-pumping original instrumental soundtrack (approved by the State, of course) featuring a hybrid of traditional Russian and Kazakh music fused with futuristic electronic melodies.<br/><br/>\n</li><li>Find out whether life really is all that bad in a landlocked communist state full of monsters, inferior safety standards and pervasive nuclear fallout.\r\n</li></ul>\n<p>The year is 2025.<br/><br/>When Forrest brashly accepts a month-long contract position with Kazakh Lumber Kompany after hearing an ad on his work radio, he didn’t expect to find himself stranded in a terrifying land full of danger and mystery. The recently-elected (now diseased) dictator Maksim Hubrisovich of the nation formerly known as Russia had led his nation into a swift nuclear defeat. Following the Great Nuclear War of 2022, Russia was effectively absorbed by Kazakhstan. A few years after declaring independence from the Soviet Union, Kazakhstan was once again a communist nation. The radioactive fallout from the war impacts daily life, but the economy must continue operating. Workers must move quickly to ensure their exposure to harmful radiation does not exceed levels determined by the Ministry of Health. Forrest must chop trees faster and more accurately than he ever has before. Does he have the ability to meet Kompany standards and simultaneously procure enough Kazakh Kredits in order to safely get back to his motherland? Escape the grip of the State!</p>", "metacritic": null, "released": "2021-03-26", "tba": false, "updated": "2021-03-29T09:02:02", "background_image": "https://media.rawg.io/media/screenshots/7e0/7e0d4d314d24afb96e474b3dfdc4c2b1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 65, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mister Iwa"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}