{"id": 579548, "slug": "minigun-vs-swarms-of-the-zombie-apocalypse-simulat", "name": "Minigun VS Swarms of the Zombie Apocalypse Simulator", "name_original": "Minigun VS Swarms of the Zombie Apocalypse Simulator", "description": "10k+ zombies on the same screen, faced with the scene of the doomsday, the raging tide of corpses,  your Minigun is thirsty, yes! Hold on for 5 minutes if you think you are tough!<br/>\n<br/>\r\n(Note: The game has only completed prototype verification, and the gameplay is still under design. The following description may differ from the final version.)<br/>\n<br/>\r\nThis game is a tower defense shooting game, massive zombies zombies try to overrun your base.<br/>\n<br/>\r\nYou play as a group of soldiers. You can switch between vehicles and defensive towers, your weapons are \"toy guns\" at the beginning, there will be supplies appear in the map area according to your killing score, pick up the supplies with your vehicles.<br/>\n<br/>\r\nYou can use the supplies to upgrade your vehicles and towers, or build fences. Upgrade your \"toy guns\" to \"killing machines\", teach them a lesson before they overrun your base!<br/>\n<br/>\r\nZombies will come in different types and have different abilities,  what prevents them from waiting to be killed,  just like some other zombie games you know, maybe your are the one be beaten to the ground!<br/>\n<br/>\r\nWith some trendy \"Black Technologies\" of the Unity Engine and some smart tricks used by the developer, it will be very easy for your potato computer to render 10k+ zombies while maintaining a smooth shooting experience!<br/>\n<br/>\r\nIf you are not  sure whether your potato computer can run this game, just download and run the demo first, turn  off all the effects, and pay attention to the temperature of your CPU and GPU !!!<br/>\n<br/>\r\nIn addition, make sure that your computer has enough memory before starting the game, otherwise the game may crash!", "metacritic": null, "released": "2021-04-01", "tba": false, "updated": "2021-04-02T02:35:33", "background_image": "https://media.rawg.io/media/screenshots/fa4/fa46152d61800d8791d2627b15f25e24.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 397, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Complex Plane"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["Complex Plane"], "esrb_rating": null}