{"id": 579592, "slug": "destroy-geometric-shapes", "name": "Destroy Geometric Shapes", "name_original": "Destroy Geometric Shapes", "description": "Imagine yourself throwing balls to destroy geometric shapes like cubes, triangles, lozenges and hexagons<br/><br/><br/><br/>The big problem is, you need to find the perfect trajectory of the balls for them to destroy everything at once<br/><br/><br/><br/>But you are persistent and this is your challenge from now on, can you do it?<br/><br/>You pass the level when all the balls fall into the hole after destroying all the shapes<h3>Challenges along the way</h3><br/>Halfway there will be tunnels, invisible walls, movable cubes and rotating hexagons<br/><br/><br/><br/>They will all try to make you give up<br/><br/>Don't let that happen, use your skill to get through these challenges<h3>Original music and sound effects</h3><br/>All of this within a sound environment prepared exclusively for you<br/><br/>Don't forget to use headphones to get the most out of stereo sound<h3>Learn while playing </h3><br/>Don't you have the skill? Do not worry!<br/><br/>Levels are progressively set up for you to learn while playing<h3>Minimalist design</h3><br/>No score, no timer and no pressure<br/><br/>We don't want to rush you or embarrass you<br/><br/>Solve the puzzles in your own time and enjoy the game experience<br/><br/><ul><li>62 levels designed progressively</li></ul><ul><li>Choose the color of the game you like best</li></ul><ul><li>Go back to any level you want to challenge yourself again</li></ul><ul><li>You can use the angle system to help you or disable them if you want a real challenge</li></ul>", "metacritic": null, "released": "2021-04-01", "tba": false, "updated": "2021-04-02T03:09:04", "background_image": "https://media.rawg.io/media/screenshots/0af/0afc86a3f19941e505ac845fc6f9c394.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 23, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Sprovieri Games"], "genres": ["Casual"], "publishers": ["Sprovieri Games"], "esrb_rating": null}