{"id": 579517, "slug": "total-war-rome-remastered", "name": "Total War: ROME REMASTERED", "name_original": "Total War: ROME REMASTERED", "description": "<p>Total War: ROME REMASTERED lets you relive the legacy that defined the award-winning strategy game series. Remastered to 4K with multiple improvements to visuals as well as refinements to gameplay, it’s time to revisit a true classic. Not everyone gets a second chance to conquer the Roman Empire.</p>\n<p>ROME REMASTERED includes the Alexander and Barbarian Invasion DLCs, as well as a copy of the original ROME: Total War Collection*, if you don’t already own it.  </p>\n<p>Improved Visuals<br />\nROME REMASTERED brings the classic Rome visuals up to date, with 4K optimization, ultra-widescreen and native UHD resolution support. This visual upgrade extends across a multitude of features, including re-modeled buildings and objects, and environment effects like dust clouds and heat haze. The refreshed campaign maps also boasts new high-resolution models, and units have been remodelled and retextured to look their very best on the battlefield. </p>\n<p>Modern Features<br />\nROME REMASTERED includes a host of modern features and improvements to existing mechanics. The in-game camera has been enhanced, including map rotation and wider zoom level in Campaign mode. Heat maps and new icon overlays have been added for gameplay mechanics such as diplomacy and security. In Battle, the new tactical map, unit displays and range markers give you greater command over Rome’s battlefields.</p>\n<p>Enhanced Game Mechanics<br />\nPlayers can now expand their armies and experience 16 additional factions that were previously locked, giving a grand total of 38 playable factions. In a first for Total War, you can now take your favourite faction to battle against friends in cross-platform multiplayer between Windows, macOS and Linux. A whole new agent type has also been added to the fray; Merchants can be sent all over the world to create trade links, access resources and buy out rivals to increase your income and assert your faction’s economic power.</p>\n<p>Half-Price Offer<br />\nTo celebrate the return of Rome, we have an offer for those loyal fans that already own the original game on Steam. If you already own ROME: Total War, you can purchase ROME REMASTERED for half-price until May 31st, 16:00 PDT.</p>\n<p>*Please note, ROME: Total War Collection is only playable on Windows and will not be available to play until the release of ROME REMASTERED.</p>", "metacritic": null, "released": "2021-04-29", "tba": false, "updated": "2024-04-18T15:01:47", "background_image": "https://media.rawg.io/media/games/b5f/b5ffd063f3398b7718fcf3c407d257ea.jpg", "website": "https://store.romeremastered.totalwar.com", "rating": 3.0, "rating_top": 4, "added_by_status": {"yet": 9, "owned": 124, "beaten": 7, "toplay": 11, "dropped": 3, "playing": 3}, "playtime": 3, "achievements_count": 192, "ratings_count": 15, "suggestions_count": 451, "game_series_count": 20, "reviews_count": 15, "platforms": ["Linux", "macOS", "PC"], "developers": ["Feral Interactive", "Creative Assembly"], "genres": ["Strategy"], "publishers": ["SEGA"], "esrb_rating": "Teen"}