{"id": 579663, "slug": "spacewar-uprising", "name": "SpacewAR Uprising", "name_original": "SpacewAR Uprising", "description": "Play the exciting extra-terrestrial infinite war game SPACE UPRISING.<br/>THE GAMER<br/>\t•\tYou are one of the most intrepid military pilots on the Earth.<br/>\t•\tYou are given warships stacked with a wide range of weapons.<br/>\t•\tYou need to destroy all alien spaceships <br/>\t•\tYou need to protect X-Castera and be one of the Guardians of Earth<br/>\t•\tGet into the cockpit and fight bravely<br/>THE GAME PLAY<br/>\t•\tThe player has to move around to play this super exciting Augmented Reality game<br/>\t•\tSpaceships will come close to the player through space entrances <br/>\t•\tLocate your enemies on the RADAR screen<br/>\t•\tChoose your weapon wisely to attack the powerful battleships<br/>\t•\tDestroy the enemy spaceship and become a hero in the Universe<br/>\t•\tCollect Space Chips from the destroyed spaceships<br/>\t•\tUtilise the Space Chips to buy advanced battleships and fight better<br/>\t•\tAcquire the Protecting Shields to escape from enemy attack<br/><br/>THE STORY<br/>Clomatandria, is a miscreation, merciless and dominant alien and commander of Clomazavendra galaxy. She wanted to be God, and make her galaxy the centre of the Universe; hence is destroying other galaxies with her evil powers. When she planned to destroy Earth, the best brains of our planet developed the energy core X-Castera as a protecting shield.  X-Castera needs to be placed and activated in different parts of our planet, and it needs to be protected.  <br/>She wants to destroy X-Castera, and will send a fleet of her ferocious battle ships for this mission.<br/>The bravest fighter pilots in our planet are assigned with the ultimate mission- to activate X-Castera and protect it from the savagery alien ships<br/>THE MISSION<br/>\t•\tFind a suitable location to place and activate X-Castera <br/>\t•\tProtect X-Castera from the savagery alien spaceships. <br/>\t•\tDestroy all alien spaceships and collect space chips from them<br/>THE ENEMY SPACESHIPS<br/> *DUVINUS **OCTACLODRIAN **XAMANDRIAN               **PROGECTRANIO**    **COSPOMALEANTRA ***EMPTADRIA ***.  DUMOPUGUSTRA ***<br/>***TRACHOLOMBUDUS **** CRYNOBETTENAIHCRA ****<br/><br/>The enemy battleships are endless. Get ready to fight<br/>PURSUIT AND BATTLE<br/>\t•\tFight it out with a huge array of villainous spaceships in iconic locations<br/>\t•\tAdventure through an exciting  Sci-Fi story line in view of a fictional Galaxy<br/>\t•\tPlay it anywhere the action-packed fighting utilizing your surroundings<br/>\t•\tDeveloped specifically for the iOS devices with ARKit<br/><br/>NB: SpacewAR UPRISING is an Augmented Reality game which requires you to move around. Please pick a safe space to play and pay attention to your surroundings.<br/>\t•\tLike us on Facebook: https://www.facebook.com/ Spacewar-Uprising-584920378527033<br/>\t•\tLike us on Facebook: https://www.facebook.com/TresreisGames<br/>\t•\tFollow us on Twitter: www.twitter.com/TresreisGames<br/>\t•\tFollow us on Instagram: www.instagram.com/tresreisgames<br/>\t•\tSubscribe on YouTube: https://www.youtube.com/channel/UCXulSkV-u9elmNadXYbPAvQ <br/>www.tresreisgames.in", "metacritic": null, "released": "2018-04-11", "tba": false, "updated": "2021-04-02T03:55:16", "background_image": "https://media.rawg.io/media/screenshots/9f8/9f8cf2e260617e1198f748e84ad27776_Nk6coLJ.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 268, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tresreis Technologies"], "genres": ["Action", "Adventure"], "publishers": ["Tresreis Technologies"], "esrb_rating": "Everyone 10+"}