{"id": 579666, "slug": "robo-ki", "name": "Robo Ki", "name_original": "Robo Ki", "description": "Robo Ki is a exciting 3d survival shooter/fighter for iOS!<br/>Robo Ki is our main character, a large yellow robot, who is forced into combat with an invading alien robot army!  Your mission is to defend Robo Ki at all costs and to free the MoeBuKai from their evil oppressors!!!<br/><br/>BACKSTORY<br/>A lonely star cluster on the outer rim of the universe... hospitable planets are rare... and life... the rarest of all things.  The planet Tinfarr: the MoeBuKai homeworld and its moon Mon Mar Vee.  On Tinfarr's surface, Professor Noz and a party of MoeBuKai bid farewell to a group of robots designed to explore the far reaches of their galaxy and to colonize new worlds.  Years pass with little or no contact from the robot explorers.  Professor Noz searches the heavens in vain.  Life continues.  Progress is made with the help of new robots, like Robo Ki, built to help the MoeBuKai community with their daily chores.  On a bright, seemingly uneventful, day a familiar shape descends<br/>from the sky.  Within seconds, THE MOEBUKAI AND THEIR PLANET ARE UNDER ATTACK!!!<br/>The robot explorers have returned AS CONQUERERS!...  their programming ALTERED!!... RE-ROUTED FOR DESTRUCTION!!!  Robo Ki returns to Professor Noz's home and finds it empty.  The Professor has been captured by the  invading army!  Robo Ki prepares for battle!  He must protect his people... the MoeBuKai... from the clutches of evil!<br/><br/><br/>FEATURES<br/><br/>- Control Robo Ki with a virtual controller or physical controller!<br/>- Beautiful environments and appealing characters!<br/>- The enemies come in 3 different sizes: the small and tenacious minions, the medium sized captains and large bosses!  Destroy these guys to free the MoeBuKai.<br/><br/>- Phenominal Artwork by Mike Spring!", "metacritic": null, "released": "2009-11-24", "tba": false, "updated": "2021-04-02T03:56:31", "background_image": "https://media.rawg.io/media/screenshots/d35/d35f65c97ba8ae26a9f795bcb5209fb1.jpg", "website": "https://www.facebook.com/pages/Robo-Ki/176280317434", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 318, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["fluidImages Entertainment"], "genres": ["Action", "Casual"], "publishers": ["Sean Boyette"], "esrb_rating": "Everyone 10+"}