{"id": 579646, "slug": "candy-manor-home-design", "name": "Candy Manor - Home Design", "name_original": "Candy Manor - Home Design", "description": "Welcome to Candy Manor! Renovate the mansion and solve challenging puzzles with this new relaxing and fun free match-3 game! Create your own candy manor and restore the beautiful manor to its former glory!<br/><br/>Start your adventure in the candy world! Complete game levels and decorate different areas of the house. Become a master of home decoration and interior design! Uncover hidden secrets in the game story.<br/><br/>Charlie, the recently retired candy master, returned to his hometown and wanted to make the sweetest candy in the world. Now is the time to show your design talents and create your own candy world through Charlie. There are too many memories in this old house, let us explore together!<br/><br/>[feature]<br/>●A large number of interesting levels: many unique Match 3 levels, rich sweet candy elements and various interesting props.<br/><br/>●Innovative gameplay: exchange matching candies, complete various levels, complete tasks and decorate your own house.<br/><br/>●Mysterious storyline: discover unknown secrets and enjoy this exciting and exciting story!<br/><br/>●Hidden areas: backyard, balcony, home theater, even swimming pool dozens of hidden areas and thousands of DIY furniture, waiting for you to unlock!<br/><br/>●Lovely pet companion: cat or dog? There is always a cute pet that you love.<br/><br/>● Many characters in the game are waiting to be friends with you, meet interesting characters in the game, and follow their respective stories.<br/><br/>what are you waiting for? Download \"Candy Manor-Home Design\" now, start your home decoration journey, and make your home design dreams come true!", "metacritic": null, "released": "2020-12-29", "tba": false, "updated": "2021-04-02T03:46:35", "background_image": "https://media.rawg.io/media/screenshots/10e/10e600d9e18407496ad2a9ccdc410f4f_BvyeZnw.jpg", "website": "http://redcandygame.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 132, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sen Qiao"], "genres": ["Casual"], "publishers": ["Sen Qiao"], "esrb_rating": "Everyone 10+"}