{"id": 579645, "slug": "scary-impostor", "name": "Scary Impostor", "name_original": "Scary Impostor", "description": "The secret emergence of a mysterious green man in the town has left everyone in shock.<br/>A scary man had moved into the oldest mansion in town claiming to be the great descendant of the legendary family. The family had a spooky history with many tales and rumors surrounding it . The mansion itself holds many secrets. The residents of the house vanished long ago and since then its been empty holding many unsolved mysteries. The people believe that the new resident is an impostor.<br/><br/>Your adventure begins when you sneak inside the creepy house where you have to explore and reveal the truth about the scary impostor. Find useful things and unique items to ruin his suspicious activities by making him look like a fool. Keep an eye on him so that you know what his creepy activities are so that you can spoil them. He behaves strangely; almost as if guarding his house. You have to monitor him and avoid him so that he doesn't catch you. Everyone is scared of him. So, make some plans to punish him badly.<br/>Can you escape without being captured?<br/>Don't be scared of him, Bring out your detective mind, Enter the haunted house and explore its history. Find tricky ways to prank him. Complete various interesting missions, lay traps, escape, hide and reveal his secrets!<br/><br/>Features:<br/>• High Quality 3D Graphics!<br/>• Amazing Sounds!<br/>• Smooth and Easy Controls!<br/>• Interesting activities!<br/>• Direction map and Hints!<br/>• Addictive", "metacritic": null, "released": "2021-03-03", "tba": false, "updated": "2021-04-02T03:45:44", "background_image": "https://media.rawg.io/media/screenshots/ea0/ea09f97f38e1c727550eb5da0a7ddf02_Oq4PIZv.jpg", "website": "http://znkgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 159, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["zubair anwar"], "genres": ["Adventure", "Simulation"], "publishers": ["zubair anwar"], "esrb_rating": "Everyone 10+"}