{"id": 579604, "slug": "road-fury-2", "name": "Road Fury", "name_original": "Road Fury", "description": "To play this game on PS5, your system may need to be updated to the latest system software. Although this game is playable on PS5, some features available on PS4 may be absent. See PlayStation.com/bc for more details.<br/>Road Fury is an endless 2D shooter. Using a simple navigation system you weave your way through the traffic, overtaking the slower cars on the road and shooting anything in your way.<br/><br/>You win coins for each car you destroy, the larger cars offering a bigger reward. Some vehicles may also leave behind power-ups to help you along your way.<br/><br/>At the end of each level you’ll encounter an end of level boss who’s trying to shoot you off the road. Dodge their bullets and make each of your shots count!<br/><br/>Keep playing until your health falls to zero. If you get hit by bullets or hit other cars you will lose car health. Periodically you’ll encounter roadworks - avoid these at all costs!<br/><br/>The car’s weapons continuously shoot, so there are no weapons to control - the player’s focus is to weave around other cars collecting the coins and power ups:<br/>- Laser: maximum damage to the other vehicles<br/>- Nitro: give your car that extra speed boost<br/>- Magnet : brings all the coins to you<br/><br/>When you’re ready you can take a pit-stop to the shop and use your coins to upgrade your wheels. <br/>You can upgrade any of the six upgradable items for your car:<br/>- Shield - makes your car last longer<br/>- Guns - the better your guns the more damage they do<br/>- Side Guns - triple your weapons reach by shooting out the sides of your car too<br/>- Magnet - increase the length of time the magnet power-up operates for<br/>- Nitro - increase the length of time the nitro power-up operates for<br/>- Laser - increase the length of time the laser power-up operates for<br/><br/>Progression &amp; Challenge<br/>The player can pick from one of three cars; the player begins with only one car unlocked. The second and third cars only become available after a series of challenges have been achieved relating to the level, total distance travelled and number of cars destroyed.<br/><br/>Once the challenges have been achieved, the player can use their coins to buy the car. As the player progresses through the levels, the enemy cars become harder and harder to destroy. The player will need to keep upgrading their car to keep up!<br/><br/><br/>Offline single player<br/>Enhanced game play on PS4 Pro console<br/>Offline play enabled<br/><br/><br/>Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy). <br/><br/>Software subject to license (us.playstation.com/softwarelicense). <br/><br/>One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.<br/>", "metacritic": null, "released": "2021-04-01", "tba": false, "updated": "2021-04-02T03:19:39", "background_image": "https://media.rawg.io/media/screenshots/3e0/3e0f39eba0db4db27f39011161b8199c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 21, "ratings_count": 0, "suggestions_count": 151, "game_series_count": 0, "reviews_count": 0, "platforms": ["PlayStation 4"], "developers": [], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}