{"id": 579770, "slug": "dimlight-cafe", "name": "Dimlight Cafe", "name_original": "Dimlight Cafe", "description": "<p><em>\"Can a falling star fulfill their own wish?\"</em></p>\n<p>A wholesome, queer-friendly story in a fantasy setting, about following your dreams and bringing happiness into the world!</p>\n\n<ul><li><strong>NaNo Demo released!</strong></li><li>Extended demo is in the works!</li><li>The game is in development, you can give us constructive <strong>feedback</strong> in the comments below or in e-mail! We'll greatly appreciate it!</li><li>Follow us for <strong>progress </strong><strong>updates</strong> in dev logs, or check out our Ko-Fi for smaller updates, art sneak peaks, etc!</li><li>We're still setting up donations, so if you'd like to support us and the development of this game, you can do so by buying us a coffee! Only if you can and want to, no pressure!</li></ul>\n\n<p>As the Guiding Star, you’ve always watched over Pharandel, laughed and cried and worried with the mortals and dragons as they warred and made peace.<br/>When a miasma starts to consume Pharandel bringing chaos with it, you wish you could be closer, you wish for a way to make them happy. And your wish comes true in an unexpected way: you fall from the sky.<br/>You meet a cynical mystic elf who grants you a mortal body: at a price. They give you six moons’ time to prove that you can make the mortals of Pharandel happy: you must fill a crystal with pure happiness, or they’ll consume you to replenish their magic!<br/>And so your quest begins. Your journey to heal the mortals’ hearts brings you to Dimlight Café: a sorely under-appreciated establishment, run by a diverse group of six dragons. You decide to stay and make it your mission to make the crew happy, and so, for the coming six moons, you get entangled in the fate of the café, the crew and the creatures that patron the place. And it’s when people in need stumble into the Café and the Dimlight family slowly grows, that you realize this is where you belong.<br/>Will you manage to fulfill your wish of making the world of Pharandel happier? Can you free them from the suffocating unhappiness, and avoid being consumed by the mystic elf? And will you find your own happiness along the way?</p>\n\n<p><em>* as planned for the full release</em></p>\n<ul><li>A cute story (in 2nd person POV) centered around happiness, friendship, sentiment, and feel-good emotions<br/>\n</li><li>Fully realized character creator with options for races as well as personality traits!</li><li>Your choices actually matter! Watch how your chosen personality traits (and the choices you make) influence interactions!</li><li>Beautiful custom soundtrack!\r\n</li><li>A dynamic calendar hub to track events and even choose the order of side stories!\r\n</li><li>3 bachelors and 3 bachelorettes!</li><li>Partial voice acting to bring life to the characters!</li><li>The full game will feature 6 moons playtime</li><li>The first demo (NaNoRenO 2021 version) features the Prologue (10k+ words)</li></ul>\n\n<p>What would you like to change?</p>\n\n<p>Body type, gender and name, check!<br/></p>\n<br/>\n<p>Appearance, check!</p>\n\n<p>Personality, check!</p>\n\n<p>\n</p>\n\n<p>Yorne (voiced by Sam Marshall)\r\n</p>\n<p>The owner of Dimlight Café and older brother of Six. He’s got a reserved personality and is unused to talking to new people. He isn’t especially skilled at anything like his peers, but the things he does value are very near and dear to his heart. He’s reliable and generous though a bit aloof.<br/></p>\n\n<p>Six (voiced by Carly Danielson [WillowroamVA])</p>\n<p>Dimlight Café’s master barista and queen of plants. Six comes across as cold and icy because her face rarely changes expression, but she’s an open minded and honest girl. She has a love for plants and beverage-making, and she even grows her own tea leaves and coffee beans.</p>\n\n<p>Goro (voiced by Reed Kriner)</p>\n<p>Dimlight Café’s head chef! An exotic tropical dragon, though raised in the snowy north, Goro has a rounded love for all types of food. Pursuing his dream of creating his own cuisine, he ended up settling in Solveil City when he found his home away from home at Dimlight Café. He’s stubborn, but one of the friendliest people you could ever meet! Don’t let his massive size scare you off!</p>\n\n<p>Doroya (voiced by Alice Himora [Aaliceh])</p>\n<p>Dimlight Café’s resident baker, pastry and sous chef! Doroya is the oldest of the group, about four centuries old! She stumbled across the Café when she awoke from hibernation and found the place built only a a stone's throw away. Rather than chase Yorne and Six off, she offered to put her baking skills to use and helped them run the cafe. Wise, but flirty, Doroya is an unpredictable girl to hang around.</p>\n\n<p>Vaughn (voiced by Eli Brennan [LazEness])</p>\n<p>The youngest of the group, Vaughn is a grumpy, rebellious dragon always looking for a fight. His scales and horns are crystalline, similar to glass, which almost anyone who lays eyes of them becomes enchanted by their beauty. Though people, especially customers, quickly come to realize his attitude muddies up that beauty very quickly. He's always at odds with Arietta because he slacks off as a waiter.</p>\n\n<p>Arietta (voiced by Brittany Ann Phillips)</p>\n<p>A bubbly dragoness who's best friends with Six. Arietta is a master confectioner and skilled people-person! Her charisma and warm personality makes her the perfect waitress, and she constantly bickers with Vaughn who never fails to make her job harder. She and Six are the backbone of the cafe, making up for Yorne's mistakes and the rest of the crew's childish carelessness.<br/></p>\n\n<p>ivyThesaurus/Whimsy: Project Manager, Sprites, CGs, Writing<br/>cheonbyeol: Programming, GUI, Idea Bouncer<br/>CiaranCosway: Original soundtrack<br/>Sir Waffles: Writer, Editor<br/>Team Badass: Writer, Editor<br/></p>\n<p>email us!</p>", "metacritic": null, "released": "2021-04-01", "tba": false, "updated": "2021-04-02T04:26:16", "background_image": "https://media.rawg.io/media/screenshots/dca/dca61bb4598d415689b5f64b8e6273b6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 160, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Celestea Productions"], "genres": [], "publishers": [], "esrb_rating": null}