{"id": 579915, "slug": "your-answers-or-your-breakfast", "name": "Your Answers or Your Breakfast!", "name_original": "Your Answers or Your Breakfast!", "description": "<p>This game is made by Sergio Escuder, Eric Planas, Adrià Fret, Pau Gómez and Martí Gómez for the GDSG Intrinsic Game Jam Second Edition 2021.\r\n</p>\n<p>The theme is Communication Difficulties.\r\n</p>\n<p>The limitation used is one finger (the game is controlled using one finger or touch input) and otherness.</p>\n\n<p><strong>Welcome to Your Answers or Your Breakfast. </strong></p>\n<p>In this game you will take control of the class nerd in the last minutes of an ordinary exam. The rest of the classmates will throw you some paper balls asking for help with some exam questions. Grab the paper balls, answer the questions and send them back to their original owner without being detected by the teacher. If the owner receives the paper ball, his/her exam qualification will improve, but if the ball gets intercepted get ready for some punishment... If a classmate gets to the point where his/her exam qualification gets to 0 that classmate then will leave the exam angry and you will lose a portion of your breakfast as compensation.</p>\n<p>Will you be able to survive the exam without loosing all your breakfast?</p>\n\n<p><strong>How to play:</strong></p>\n<p>When you receive a new paper ball, click on the ball to open a menu to answer with the proper answer. </p>\n<p>Once you answer and wrap the paper into a ball again, click the ball to select the paper you want to throw back.</p>\n<p>Click and drag on the nerd character to charge and aim your throw.</p>\n<p>You can also click on other students to drag the teacher attention.</p>", "metacritic": null, "released": "2021-04-01", "tba": false, "updated": "2021-04-02T04:59:45", "background_image": "https://media.rawg.io/media/screenshots/b35/b355874e81a7f616e1f8dbbc95a9bae9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 73, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["KangKuun", "Eric Planas Canto", "MossenSaure", "Nerionde", "SergioEscuder"], "genres": ["Action"], "publishers": [], "esrb_rating": null}