{"id": 579968, "slug": "notable-flying-typing-companion-nftc", "name": "Notable Flying Typing Companion (NFTc)", "name_original": "Notable Flying Typing Companion (NFTc)", "description": "<p><strong>Notable Flying Typing companion</strong> <em><strong>(NFTc)</strong></em> is <strong>a desktop pet</strong> that wanders around your desktop on top of other applications, and reacts to key strokes. It is intended to be left running in the foreground while you work on other things and use your keyboard as you usually do.</p>\n<p><em>(for security concerns, it doesn't actually read what characters you're typing, it only reacts when you press *anything* on your keyboard + the program does not connect to the internet in any way)</em></p>\n<p><em>You can change the scale of the program at any time by right clicking on the UFO and using the scale slider.</em></p>\n<p><strong>This is a crowdfunding campaign!! Buy the game and contribute to unlocking the next typing reaction effects:</strong><br/></p>\n<ul><li><strong>fish         </strong>1  $ ~ <strong><em>REACHED</em></strong></li><li><strong>stars        </strong>50  $ ~ <strong><em>REACHED</em></strong></li><li><strong>candy        </strong>100 $ ~ <strong><em>REACHED</em></strong></li><li><strong>bird         </strong>150 $</li><li><strong>confetti  </strong>200 $</li><li><strong>shine        </strong>250 $</li><li><strong>clone        </strong>350 $</li><li><strong>bubble       </strong>500 $</li><li><strong>bomb         </strong>600 $</li><li><strong>piñata       </strong>690 $</li><li><strong>messages     </strong>800 $</li><li><strong>fireworks    </strong>1000 $</li><li><strong>falling </strong><strong>star </strong>1500 $</li><li><strong>moai pop-up</strong>  2000 $</li></ul>\n<p>By paying <strong><em>25</em></strong>$ yourself, you become <strong>a certified buyer</strong>, your name will be added to the game and I will send you an authentic certificate with a unique code*. Plus, you get access to the secret.zip file.</p>\n<p><em>*the unique code does nothing.<br/><br/></em></p>\n<p>Here are some answers to your anticipated questions:<br/></p>\r\nQ: What's going on here? Why the weird title?\r\n<p>A: This whole thing is a joke on NFTs, a disastrously capitalistic technological trend that has gained some popularity and a lot of justified controversy over the last few weeks. <em>(it's a pyramid scheme that destroys the environment)</em></p>\r\nQ: Ok, but did you have to sell it?\r\n<p>A: I took the joke too far!! I spent too much time on it and now I need to make this project pay for itself. So, I decided to crowdfund it!</p>\r\nQ: Crowdfund?\r\n<p>A: Yes! The project is pretty much done as it is, but you will have to unlock most of it, collectively. For each step that we get to in the crowdfunding, I will update the game, unlocking a new effect.</p>\r\nQ: Does the unlocking happen automatically?\r\n<p>A: Not really! I'm updating the game manually whenever I notice a step was passed. Expect a 1-24 hours delay at worst. I recommend using <strong>the itch.io game launcher</strong> so that the game updates itself automatically whenever I put out a new version.</p>\r\nQ: What happens when the crowdfunding reaches its final goal?\r\n<p>A: The game shall become free and I will remove the option to become a certified buyer, potentially until I make some more effects and do another such crowdfunding.</p>\r\nQ: What if the crowdfunding doesn't reach its goal?\r\n<p>A: The crowdfunding shall remain active until the goal is reached. If the goal isn't reached, the crowdfunding will still be going on.</p>\r\nQ: Does the money go to a good cause?\r\n<p>A: Kind of, it goes to me! I do try.</p>\r\nQ: Is this compatible with [...]?\r\n<p>A: Yes, It should be! The desktop pet should remain in the foreground whatever else you are doing, unless the software in focus will not allow anything to be displayed on top of it. <em>(rare)</em></p>\r\nQ: Can I use this desktop pet as a streaming overlay?\r\n<p>A: Yes, and please do! Use \"window capture\" and set a \"Color Key\" filter, with a custom color, set to: #291814.</p>\n<br/>Some thanks:\r\n<p>Thank you to <strong>Davemakes</strong> who inspired this whole thing with their project <strong>KnFT</strong>. I even went so far as to steal their project's description format. Hope you don't mind davemakes, love ya!</p>\n<p>Thank you to our beautiful certified buyers:<br/>Dr Jon, <em>[your name could go here]</em></p>\n<p>Thank you to my Patreon supporters:<br/>Blas, Andrew Edstrom, bbsamurai, berkfrei, Dan Rees-Jones, Jearl, Joel Jorgensen, Marty Kovach, Paul Nguyen, rotatetranslate, zep, amy, Cole Smith, David Cole, Eiyeron, Elias Alonso, Gio, Raphael Gaschignard, Sam Loeschen, Anne Le Clech, Gruber, Jakub Wasilewski, Pierre B., Sean S. LeBlanc, Simon Stalhandske, slono, vaporstack</p>\n<p>Special thanks to Elodie, Pico, Sesame, Benjamin Soulé, Adonie and Eva.</p>", "metacritic": null, "released": "2021-04-01", "tba": false, "updated": "2021-04-02T05:12:58", "background_image": "https://media.rawg.io/media/screenshots/a0e/a0effc05e92c716f2ee6006fc73d59d3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 29, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Rémy 🍬 Devaux"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}