{"id": 579994, "slug": "time-over-randomizer", "name": "Time Over: Randomizer", "name_original": "Time Over: Randomizer", "description": "<p>Time Over: Randomizer is a randomizer JRPG with a twist - you're constantly on the clock and it's game over if you run out of time. The only way to get the minutes you'll need to win is by sacrificing your fellow party members.</p>\n<p>This game is a roguelike with an intended playtime of 10 to 60 minutes per run. </p>\n<p>Consider this to be a super alpha release  -- I've only been working on this game for 2 weeks during my downtime. There's a lot of known issues like:</p>\n<ul><li>Party members randomly fall from the sky.</li><li>Running from battles allow you to re-roll an encounter.</li><li>If a randomly generated maze has the same room appear twice, some state can accidentally leak from one room to another.</li><li>The randomly generated dungeon has a super boring design and all four gates use the same dungeon.</li><li>The damage scaling is kinda busted -- for both the player and enemies. By the end of the game, it's primarily rocket tag.</li><li>The file size is mega inflated because I haven't removed all of the unused assets from the Windows/OS X builds.</li></ul>\n<p>...</p>\n<p>But despite all that, I think it's actually in a fun and playable state. I believe the game is beatable in most runs but it's pretty dang hard. With strong Talent synergy and high end gear, you can honestly one shot most bosses right now.</p>\n<p><strong>Consider the browser version of the game to be (mostly) untested because I've only played it once and I had to some hacks to hit the itch.io file limit. </strong>Not only that but the browser version is legitimately harder because the game waits to load assets from the server which takes up valuable time! If you've played the game once in the browser, it normally runs perfectly the second time because it has cached the assets.<br/></p>\n<p>Here's the elemental type chart for those who are interested.</p>\n\n<p>Credits: </p>\n<ul><li>Ækashics's fantastic enemy resources over at http://www.akashics.moe/</li><li>The Munro pixel font by Ten by Twenty</li><li>The fantastic VisuStella team and their plugins at VisuStella.com</li><li>Tsukimi and their filter plugin</li><li>Cutievirus's amazing MZ3D plugin</li><li>YouFulca's music over at Wingless Seraph</li></ul>", "metacritic": null, "released": "2021-04-01", "tba": false, "updated": "2021-04-02T05:18:50", "background_image": "https://media.rawg.io/media/screenshots/335/335259a0bfea19616c0998b579afd713.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 41, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Web"], "developers": ["SanjiWatsuki"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}