{"id": 580187, "slug": "gnam-alpha", "name": "GNAM ALPHA", "name_original": "GNAM ALPHA", "description": "<p>We are a group of Italian friends passionate about videogames who decided to have a try with VR development. We hope this game can offer you some good time and we appreciate if you decide to support us.<br/></p>\n\n<p><strong>How to play</strong><br/></p>\n<p>Stand up, grab your gear and enter the land of Gnam, where everything is gnammy, and have fun while eating all you can eat!</p>\n<p>You can play it with your friends or family and as many times as you want.</p>\n<ul><li>Eat as fast as you can to gain points in a limited time</li></ul>\n\n\n<ul><li>Complete levels and objectives to collect useful items. You can loot them from the skewer below the table</li><li>Once you drop an item it will explode in few seconds, store them in the inventory and use them when the game become rough</li></ul>\n\n\n<ul><li>Weapons can be held in a special place, when you grab a gun look at your hips and you will find a holster</li></ul>\n\n\n<ul><li>Avoid poisoned food, they can slow you</li></ul>\n\n\n<ul><li>The gummy bears will try to cause you difficulties, stun or shoot them to get extra time and bonus items</li></ul>\n\n\n<p><strong>Disclaimer</strong><br/></p>\n<p>Gnam is an Arcade game in ALPHA stage, this means that is not a complete game and it's still under development. Feel free to test it and please leave us a comment.</p>\n<p>If you want to get more info during the development or want to report bugs, feel free to leave a comment.</p>\n<p>Gnam is tested only for Oculus Quest 2 and should be fully compatible with Oculus Rift S. We're going to include other devices in the next releases.</p>\n<p>Soundtrack: Funiculì funiculà by Liberato<br/></p>\n<p><strong>Next steps</strong></p>\n<p>Our plan is to polish the game, add new minigames besides multiplayer support but first, we'd love to hear some feedback from you :)</p>\n\n<p>Discord server --&gt; https://discord.gg/TWF8NGDF</p>", "metacritic": null, "released": "2021-03-31", "tba": false, "updated": "2021-04-02T06:03:34", "background_image": "https://media.rawg.io/media/screenshots/057/0574553fb4c77d759e1ee012cd75cb66.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 135, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Android"], "developers": ["GNAM"], "genres": ["Action"], "publishers": [], "esrb_rating": null}