{"id": 580101, "slug": "soldier-of-stealth", "name": "Soldier of Stealth", "name_original": "Soldier of Stealth", "description": "<p>The game starts with you missing your drop point and landing on the beach of Normandy the day before D-Day and immediately after the bombing of the beach. The enemy soldier should be on edge in their pillboxes, alert of what might be in the shadows of the beach. With explosions still ringing in their ears, this might be your best chance to sneak along the beach and away from their line of sight. Dawn is just starting to crack, and the fog will begin to break with its arrival. It’s now or never.\r\n  </p>\n<p>            Your mission, you do not get to choose to accept it, is to make your way up the beach without getting caught. If you do, be ready for the fight of your life. This is supposed to be a stealth based game scene which is based on the beach Normandy the day before the invasion D Day. The time of day in the scene is nighttime after the initial bombing of the beach and forts further inland. You are one of the para troopers that were dropped in after the bombings to ensure that key targets were destroyed such as bridges and key roads so as to halt the flow of reinforcements. Unfortunately, your plane was shot at causing an early jump, landing you in possibly the worst place to land that didn’t result in your immediate death.   </p>\n<p>            The outside area of the level is the run up the beach, with craters that have been blown into the sands of the beach as well as some attempts into the pillboxes that survey the beach. The pillboxes have enemy soldiers on top of them since the vision of the soldiers get extremely hampered inside the boxes and I wanted a functioning primary gameplay loop. The soldiers scan the landscape in front of them, shining a spotlight to see if there is an incoming invasion that they’ll have to fend off. Getting caught by them would be a death sentence. The beach itself, aside for being pocketed with craters from the bombing run, has what are known as Czech Hedgehogs that fill the beach, just waiting to destroy a ship in high tide as well as hamper tanks from making quick ground up the beach. Fortunately, they make excellent cover for a paratrooper to make it up the beach unseen as well as sufficient cover from a hail of bullets. On top of the cover from the craters and hedgehogs, there is also a blanket of fog that will help to conceal your approach. Unfortunately, the hedgehogs aren’t the only thing littering the beach. The beach is absolutely covered with landmines! Just a single step onto them and you’ll definitely get your leg blown off and will bleed out.\r\n</p>\n\n<p>The player must use their wits and stealth to make it out of this situation alive, they must move from crater to crater, hedgehog to hedgehog and not make too much of a ruckus all while avoiding landmines. </p>", "metacritic": null, "released": "2021-04-01", "tba": false, "updated": "2021-04-02T05:40:20", "background_image": "https://media.rawg.io/media/screenshots/d04/d04cd02887ae298a462bc453a871b42a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 27, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["AmmonLawDev"], "genres": ["Action"], "publishers": [], "esrb_rating": null}