{"id": 580216, "slug": "easter-egg-challenge", "name": "Easter Egg Challenge", "name_original": "Easter Egg Challenge", "description": "Instructions\r\n<p>Throw the Easter Egg to hit all the other eggs in each level, using as few throws as possible. Each level is achievable in a single throw, although it will take some trial and error to find the correct shot!</p>\r\nControls\r\n<p>Grab the egg with the <em><strong>Left mouse button</strong></em>. Moving the mouse while grabbing will adjust the launch speed. Release the mouse button to throw the egg.</p>\n<p>Once the egg is stationary, it will automatically return to the throwing position. Alternatively, for the impatient, it can be grabbed at any time, or clicked on to return it for another attempt.</p>\n<p>For those intent on the perfect shot, pressing <em><strong>TAB</strong></em> will quickly reset the level at any time after the egg has been thrown.</p>\n<p>Pressing <em><strong>ESCAPE</strong></em> at any time will open the in-game menu, allowing you to return to the main menu.</p>\r\nMenu Screen\r\n<p>From here you can select the level to play, open the settings menu and exit to the desktop.<br/></p>\n\r\nMenu Screen\r\nIn-Game Screen\r\n\r\nIn-Game Screen\r\nSystem Requirements\r\n<p>Windows 10 (64-bit)<br/>A mouse</p>\r\nCredits\r\n<p>Coding &amp; Art - M Godfrey<br/>Additional Level Art - www.Kenney.nl<br/></p>\r\nDeveloper's Note\r\n<p>Just as an aside, I wanted to mention that this is the first game I have released, so please set your expectations accordingly!!!  I have played it extensively during development, and think I have squashed all the bugs I have come across, but inevitably I will have missed some - Feel free to report anything below, but as this game has been released for free, please don't be disappointed if they are never resolved!</p>\r\nHAVE FUN!", "metacritic": null, "released": "2021-03-31", "tba": false, "updated": "2021-04-02T06:10:40", "background_image": "https://media.rawg.io/media/screenshots/e67/e67b4f581db154d6d7efcd5df7baabf0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 23, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MartinGD3"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}