{"id": 580388, "slug": "big-quest-2-the-adventure", "name": "Big Quest 2: the Adventure", "name_original": "Big Quest 2: the Adventure", "description": "Dialogues with unique characters, city exploration, travel, logic puzzles, investigations. Quest lovers will especially appreciate it.<br/><br/>A simple city guy named Rich inherited a farm. Going to the village for the inheritance and at the same time to rest, it turns out that all the land is being sold and the whole business is under threat. Not wanting to return to town and work in the office, Rich decides to defend his rights to the farm.<br/>The local mayor has disappeared somewhere, and all the activity to restore the business in the village falls on you.<br/><br/><br/>Rich learns that to prevent the sale of land, you need to open the market and profit from it will be salvation. This is where the problems begin.<br/>In an unknown location, it is necessary to find a lighthouse keeper to start shipping and supply of goods, then organize deforestation, then help carpenters with tools, then find a loader to deliver the boards to the construction site.<br/><br/>Desert merchants also demand theirs under the contract. It is necessary to deliver sunflower oil. And where to look for it and how to do it? But a trip to the Desert will be beneficial, you will get to know the sheikh and he will help you with the oil business.<br/>Yes, you will have a share of the business in the oil rigs, but this will cause new problems. And having solved the secret of the giant, you will find unique artifacts.<br/><br/><br/>To complete tasks to improve life in the town, you will have to go to Snowland. Help the locals to re-establish contact with the expedition, and simply, you can find gold!<br/>And that is not all! You have to make your way through the cemetery, take a helicopter ride to Megapolis. Riddles, puzzles and secrets are everywhere.<br/><br/>Do you think everything? But no! You will have envious people and traitors who will be tricked into jail. You will have a chance to improve relations between prisoners and get out on freedom.<br/>This is not a complete to-do list.<br/><br/><br/>Let's go on a journey!", "metacritic": null, "released": "2021-03-31", "tba": false, "updated": "2023-03-18T22:04:42", "background_image": "https://media.rawg.io/media/screenshots/02f/02f97c32e5fbd07d7db575250841d851.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 127, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["ZeLDER"], "genres": ["Adventure", "Casual", "Indie", "Puzzle"], "publishers": ["ZeLDER"], "esrb_rating": null}