{"id": 58079, "slug": "doggy-bubble-shooter-rescue", "name": "Doggy Bubble Shooter Rescue", "name_original": "Doggy Bubble Shooter Rescue", "description": "Doggy Bubble Shooter is free to download and also good for you for your family and for your kids.<br/>Downloads it NOW! and you will have the most beautiful adventure of your life<br/><br/>- This amazing mouthwatering Doggy Bubble Shooter game it is a Bubble Game  2018 and is being presented for free  on App Store for iOS devices.<br/><br/>- This match 3 game offers you a great deal of joy and unlimited casual matching entertainment in your boring time. In this doggy mother is ready to Shoot balls and ready to rescue babies. <br/><br/>- You can explore multiple colored bubbles. You will find new interesting game features a cute dog theme, making it a doggy bubble shooter and it enhance challenging gameplay.<br/> <br/>- This Doggy theme bubble shooter game is just like other bubble shoot games where you have to pop similar color balls by shooting them using amazing bubble gun. This Doggy theme makes this game trendy and interesting with multiple colored balls and unique interface.<br/><br/>- This Doggy bubble shooter game is real addictive that offers you unlimited joy and pleasure ,but the unique shooting gun and different colors of toy balls makes this game the perfect Bubble Shooter game for you.<br/><br/>- Tap to town building blast game and drop out the disco ducks and beehives.<br/>- Don’t get angry, keep yourself calm to get special items to rescue the babies. The special dog character handling the shooting gun allows you to point towards the right direction and shoot the toy balls to bubble pop similar colors balls. <br/><br/>- You have to make the strategy to blast the similar color balls to pop them up. The more balls combinations you will pop together, the higher scores you will get.<br/><br/>- The game environment is very simple and smooth because you can easily navigate the direction of bubble shooting gun according to amazing color combinations. <br/><br/>-  Be the good friend of your little doggy bubble shooter and enter to the magic fun land.<br/><br/> -  Once you start playing it, you will get addicted to it. Enjoy multiple levels with HD graphics and amazing sound effects.<br/><br/> Doggy Bubble Shooter Features: <br/>- Have Boosters and power ups to increase your win<br/>- Have 300+ funny challenging levels <br/>- Have beautiful bubble shooter themes.<br/><br/><br/> How to Play :<br/>- Shoot  Doggy bubbles with same colors combinations<br/>- Blast doggy balls with bubble shooting guns <br/>- Get Move your fingers for shoot the target<br/>- Get multiple special items to make high score<br/>- Use boosters and power ups <br/>- Easy to play and smooth interface<br/>- HD graphics with amazing audio effects<br/><br/>Why you should download the game:  <br/><br/>- It brings more fun and joy to your life  <br/>- Can be played by every member of your family<br/>- It relaxes you when you're bored or restless<br/>- it trains your intelligence through thinking<br/>- You can save puppies ,many puppies.<br/><br/>- Download it now for free and have Match 3 fun with “Doggy Bubble Shooter Rescue “<br/><br/>- Please send us your precious feedback it helps in improving the game and in making it better for you so that you can have all fun and no headache!!!", "metacritic": null, "released": "2017-11-15", "tba": false, "updated": "2019-10-22T14:30:59", "background_image": "https://media.rawg.io/media/screenshots/227/2273156d8ab0d9a06d015d40b81b599f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ungureanu Corina"], "genres": ["Puzzle"], "publishers": ["Ungureanu Corina"], "esrb_rating": "Everyone 10+"}