{"id": 580764, "slug": "journey-of-the-broken-circle-itch", "name": "Journey of the Broken Circle (itch)", "name_original": "Journey of the Broken Circle (itch)", "description": "<p>\"Its strong characters and effective story are enough to warm even the coldest of hearts\"<br/>- Screen Rant</p>\n<p>\"Journey of the Broken Circle is a lovely, thought-provoking game that uses simplicity to explore the complexity of relationships.\"<br/>- Pure Nintendo<br/><br/>\"I cried while playing this game. It explained what I've been feeling recently, and helped me through them. I really felt as if I was going through everything with circle and connected with their character. \"<br/>- Oddishanthony</p>\n<p><em>A fun and vibrant trip about life, love, fulfilment and existentialism, where new powers come from new relationships.</em></p>\n<p>Meet fascinating characters on your quest to complete the broken Circle, and eventually pair with some! These partners bring their unique abilities to let you overcome new obstacles and keep discovering the world. They also bring their own personality to roll with...<br/><br/><br/>In this 4-5 hours adventure, full of ups and downs, but always playful and rewarding, the Circle learns about itself and you, along with it.<br/><br/>DEVELOPED BY Lovable Hat Cult<br/>“It’s a game about this little something that always seems to be missing…a better job, a nicer place to live, an ideal relationship…<br/>We wanted to tell a story of self-discovery in a fun, universal and relatable way.<br/>We probably also wanted to answer our own questions: would the Circle find what it was looking for? Or how would it all end?” - Andrea &amp; Patrick from the Copenhagen-based studio.<br/><br/>PUBLISHED BY Nakana.io<br/>“We gather games that share a strong experience to remember. We hope you’ll enjoy the sweet and tasteful food for thought served by Journey of the Broken Circle!” - Mikaël Bourget, founder of the publishing label.</p>\n\n<p>In this DEMO you will get the first 3 levels and the bonus levels. To experience the full game, go to our Steam page or get it on Nintendo Switch, Sony Playstation 4, or Xbox One. <br/></p>\n<p>See journeycirclegame.com for more info.<br/></p>", "metacritic": null, "released": "2021-03-30", "tba": false, "updated": "2021-04-02T08:20:57", "background_image": "https://media.rawg.io/media/screenshots/5f7/5f73af2c4d807d1aae568a85997dce05.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 102, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["lovablehatcult"], "genres": ["Adventure", "Platformer"], "publishers": [], "esrb_rating": null}