{"id": 580765, "slug": "the-intruder-farsmile90", "name": "The Intruder (farsmile90)", "name_original": "The Intruder (farsmile90)", "description": "<p>Control:  </p>\n<p>C- To shoot, and melee /  X- To evolved when collecting enough 5 life sources / Space- to Jump / arrow key to move // X+C: to go back to Alien level 1  // R: to reset the game when you're in stuck.</p>\n<p>A Platformer game that I solo from A to Z includes Graphic, animation, and Code except for music, sound. I don't really have enough time to finish the whole game I've planned, even I made more enemies, higher alien tier, etc... But I'm happy with what I have done in a week, YAY to me...<br/></p>\n<p>Story:</p>\n<p>A group of scientists and military personnel on a spaceship carrying an unidentified object from an undiscovered planet back to Earth for research. This is a historical discovery for mankind in their search for alien life. The unidentified artifact turns out to be a parasitic life form that can morph itself into any form that is suitable to its immediate surroundings to perform malicious actions. It can perform metamorphosis by hijacking a human host body to withdraw <em><strong>life force.</strong></em></p>\n\n<p>-Kill enemies and collect life sources to evolved your alien.</p>\n<p>-Challenging game, when game over you will start from the beginning, so be careful. Learn enemies' position and their behavior, and using the advantage of your Alien's ability to win.<br/></p>\n<p>-Kill all enemies on the level to complete the game.</p>\n<p>After this Jam is finished, I'll upload all of my assets for free. Includes all tilemap, characters, and animation and continues developing the game. Have a nice day and enjoy!!!</p>\n<p>Music and sound I'm using\"</p>\n\n\n\n<p>https://opengameart.org/content/512-sound-effects-8-bit-style</p>", "metacritic": null, "released": "2021-03-30", "tba": false, "updated": "2021-04-02T08:21:13", "background_image": "https://media.rawg.io/media/screenshots/6b6/6b626d244cf2cefbe42416e58c1e7045.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 73, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["farsmile90"], "genres": ["Action", "Platformer"], "publishers": [], "esrb_rating": null}