{"id": 58076, "slug": "ash-of-gods-redemption", "name": "Ash of Gods: Redemption", "name_original": "Ash of Gods: Redemption", "description": "<p>Ash of Gods: Redemption est un jeu de rôle au tour par tour qui allie des combats tactiques avec des éléments de jeu de cartes à collectionner, ainsi qu&#39;une histoire riche en rebondissements où personne n&#39;est à l&#39;abri d&#39;une mort soudaine, pas même les personnages principaux.<br />\nGAMEPLAY<br />\nAsh of Gods relate l&#39;histoire de trois personnages différents, prêts à repousser une menace qui pèse depuis plusieurs siècles et était autrefois considérée comme une légende.<br />\nLe scénario change constamment selon les choix du joueur, pouvant même causer la mort des personnages. Mais la partie ne s&#39;arrêtera pas pour autant. Bien au contraire, l&#39;histoire se poursuivra en incluant la mort du personnage en question et vous devrez en assumer les conséquences.<br />\nDans Ash of Gods, le combat combine la stratégie classique au tour par tour avec des éléments de jeu de cartes. Les tactiques individuelles varieront en fonction des compétences et de la classe de vos personnages et vous pourrez débloquer et collectionner des cartes capables d&#39;activer des capacités spéciales qui peuvent renverser le cours du combat.<br />\nCE QUI FAIT D&#39;ASH OF GODS UN JEU UNIQUE<br />\nDes décisions lourdes de conséquences<br />\nChaque décision, à la fois hors et sur le champ de bataille, peut altérer le cours des événements et changer le destin de vos personnages, ce qui engendrera de lourdes conséquences. Mais sachez que même la mort de l&#39;un de vos héros ne mettra pas fin à votre aventure.<br />\nRien n&#39;est décidé au hasard<br />\nCe n&#39;est pas le hasard qui déterminera vos chances de réussite ou la force d&#39;un coup. Dans Ash of Gods, les vrais stratèges devront maîtriser les compétences liées aux classes des personnages pour exploiter au mieux les pouvoirs conférés par leur stock limité de cartes, sinon ils en paieront le prix fort.<br />\nUne IA qui s&#39;adapte à votre style de jeu<br />\nL&#39;IA de Ash of Gods s&#39;adapte à votre niveau afin de vous donner constamment du fil à retordre pour que vous ne tombiez pas dans la facilité en utilisant toujours les mêmes tactiques ou en créant une équipe invincible.<br />\nMode multijoueur JcJ<br />\nMesurez-vous à d&#39;autres joueurs afin de vous hisser dans les classements. Débloquez de nouveaux personnages, améliorations et cartes pour personnaliser encore plus vos tactiques.<br />\nDes récompenses à la clé en cas de prise de risque<br />\nGagnez encore plus de points de vie en portant une attaque à la dernière minute. Partez vous battre avec une équipe plus petite afin d&#39;obtenir de meilleures cartes et réduire le temps des tours. N&#39;hésitez pas à choisir la route la plus courte, mais aussi la plus dangereuse, pour économiser vos ressources. Ash of Gods est un jeu qui récompense ceux qui n&#39;ont pas froid aux yeux.<br />\nL&#39;HISTOIRE<br />\nAu bout de 700 ans, la vie paisible de Terminus touche à sa fin. La fête de l&#39;équinoxe de printemps bat son plein lorsque le clocher de la ville retentit. Le capitaine Thorn Brenin, le garde du corps Lo Pheng, le scribe Hopper Rouley et beaucoup d&#39;autres ne savent pas encore que les moissonneurs sont revenus et ont l&#39;intention de mettre le monde à feu et à sang afin de réveiller les dieux endormis.<br />\nÉcrit par Sergey Malitsky, auteur de fantasy récompensé, Ash of Gods est un jeu doté d&#39;un riche scénario, de personnages charismatiques, de dialogues poignants et d&#39;un univers incroyable. Malitsky travaille à l&#39;heure actuelle sur un nouveau roman, basé sur les événements d&#39;Ash of Gods.<br />\nL&#39;ART GRAPHIQUE<br />\nInspiré du travail de Ralph Bakshi (Le Seigneur des Anneaux), des animations classiques de Disney et du célèbre studio soviétique Soyuzmultfilm (La Reine des Neiges), Ash of Gods offre des illustrations et des animations détaillées, dessinées à la main. Le rotoscoping, une technique où chaque scène est filmée au préalable avec un véritable acteur comme modèle, donne vie aux animations qui fourmillent de détails et de dynamisme.<br />\nLA MUSIQUE<br />\nLa bande originale est un travail collaboratif entre Adam Skorupa, Krzysztof Wierzynkiewicz et Michal Cielecki qui ont travaillé par le passé sur The Witcher, Bulletstorm, Painkiller, EVE Online, Call of Juarez et Shadow Warrior. Chaque piste a été enregistrée avec des musiciens professionnels qui ont souvent recours à des instruments de musique traditionnels, très rarement présents dans les enregistrements modernes.</p>", "metacritic": 65, "released": "2018-03-22", "tba": false, "updated": "2024-02-02T00:15:58", "background_image": "https://media.rawg.io/media/games/6bc/6bc09b2cd99b8890b6ac6f1c696cac4f.jpg", "website": "", "rating": 3.33, "rating_top": 4, "added_by_status": {"yet": 15, "owned": 45, "beaten": 24, "toplay": 32, "dropped": 12, "playing": 1}, "playtime": 17, "achievements_count": 127, "ratings_count": 31, "suggestions_count": 573, "game_series_count": 3, "reviews_count": 33, "platforms": ["PlayStation 4", "Nintendo Switch", "Linux", "macOS", "PC", "Xbox One"], "developers": ["AurumDust", "Aurum Dust"], "genres": ["RPG", "Strategy"], "publishers": ["Koch Media", "WhisperGames", "AurumDust"], "esrb_rating": "Mature"}