{"id": 58107, "slug": "fantasy-maze", "name": "Fantasy Maze", "name_original": "Fantasy Maze", "description": "Fantasy Maze <br/><br/>A great adventure in a big maze. You must defeat goblins, trolls, spiders and other unfriendly creatures and stay alive. The game involves collecting various resources and fighting creatures. This concept of the game offers different paths to victory. Randomness is very much a part of this game.<br/><br/>You can do many things in the game: fight with a sword, use the potion of transformation, use fire, hunt rats, catch fish, collect fruits, carry animals to their homes and much more. You also have a strong and dangerous dog to help you. Only you need to feed him properly. <br/><br/>HOW TO PLAY?<br/>Informations on how to play this game are included in the books, you will find in the game (in the form of pictorial information). <br/>Here is a video with instructions on how to play in Fantasy Maze: youtu.be/Lbhm9o__RPg<br/><br/><br/>The game provides many hours of entertainment. Only Grande Labyrinth (first land int this game) has about 200 rooms. New land Troll Forest is primarily a clash with trolls, the most dangerous creatures in this game.<br/><br/><br/>SAVE<br/>This is the full version of the game, which does not have a save option. Save is available in the FANTASY MAZE PLUS (for a small fee). The game can be played without save, but I hope that if you like it, you will buy a version with save, which gives you more comfort of playing and  I will have more motivation to develop the game.", "metacritic": null, "released": "2018-03-24", "tba": false, "updated": "2019-10-22T14:38:52", "background_image": "https://media.rawg.io/media/screenshots/d5a/d5a2dcf29690e5e94b48eb4384f01946.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 93, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Jacek Zawadzki"], "genres": ["Adventure", "RPG"], "publishers": ["Jacek Zawadzki"], "esrb_rating": null}