{"id": 58105, "slug": "shadowgun-legends", "name": "Shadowgun Legends", "name_original": "Shadowgun Legends", "description": "\"Shadowgun Legends is the App Store’s definitive FPS.\" - Gamezebo.com<br/>“A challenger for the best FPS on mobile” - PocketGamer.co.uk<br/>“It’s hard to believe it’s a free to play game” - 148apps<br/><br/>Download the best mobile FPS RPG shooting game for free now!<br/><br/>Experience an epic story campaign, competitive and cooperative multiplayer, and an innovative social hub, all in one game!<br/><br/>In the futuristic world of Shadowgun Legends, humanity is under attack from a deadly alien invader. The last line of defense are the Shadowguns, legendary warriors and heroes. You are a young Shadowgun recruit with limitless potential who can turn the tide of war. So what are you waiting for? Join the fight and show the galaxy who’s boss!<br/><br/>GAME FEATURES<br/><br/>THRILLING STORY CAMPAIGN<br/>Save humanity from an alien invader in an epic Story Campaign spanning over 200+ mission on 4 diverse planets<br/><br/>CO-OP MISSIONS AND RAIDS<br/>Join forces with friends and defeat giant enemy bosses for glory and legendary loot<br/><br/>REAL-TIME PLAYER VERSUS PLAYER TEAM BATTLES<br/>Fight your rivals in unique multiplayer game modes and diverse PvP arenas<br/><br/>RPG ELEMENTS AND CUSTOMIZATION<br/>Choose from over 600 unique weapons including Handguns, Assault Rifles, Sub-Machine Guns, Heavy Machine Guns, Shotguns, Sniper Rifles and Rocket Launchers. From plasma beams to good old-fashioned lead bullets.<br/>Collect over 1000 armor pieces and build your armor sets. Fortified juggernaut, sleek infiltrator or something else entirely? The choice is yours!<br/>Make your Shadowgun stand out with 250+ cosmetic items<br/>Pick your own skills and create your own playstyle - no classes, no restrictions!<br/><br/>INNOVATIVE SOCIAL FEATURES<br/>Interact with other players, visit vendors, accept missions, party hard and much more in game’s persistent Hub<br/>Chat with friends, create battle squads and form guilds<br/><br/>UNIQUE REWARD SYSTEM - FAME<br/>Become a celebrity of the Shadowgun Universe<br/>Get rewarded for how you play the game. Your every action is appreciated with our unique fame system. The more famous you are the more the world will react to your actions!<br/><br/>Play the best RPG Shooting Game for FREE! Join the fight now!<br/><br/>Shadowgun Legends is a groundbreaking mobile game that blurs the lines between console and mobile gaming.<br/><br/>Dive into this free feature-packed FPS RPG and battle a terrifying alien menace, the Torment, who are rampaging across the Galaxy destroying everything in their path.<br/><br/>As a new Shadowgun recruit, you will create your ultimate rockstar warrior with hundreds of weapons, dozens of combat skills, thousands of armor pieces, and a wild collection of cosmetic items and skins. As your fame grows you will indulge in the wild celebrity lifestyle of the most famous warriors in the Universe and carve your name into mankind’s history.<br/><br/>When you’re not mastering shooting skills you can unwind with your friends in the Shadowgun’s neighborhood, where you’ll hang out with other players, hit the bar, chat, interact with NPCs and most importantly...party!<br/><br/>You can enjoy all this with MADFINGER Games’ renowned cutting-edge visuals, intuitive controls and wicked sense of humor.<br/><br/>At MADFINGER Games we’ve always challenged ourselves to push the boundaries on mobile devices, and we’re proud of our console quality first-person shooters. From our cutting-edge graphics to our precise control system, over 180 million players worldwide have been blown away by our innovative approach and dedication to quality. Now we’re taking things to the next level. Shadowgun Legends is the ultimate persistent world shooter in the palm of your hand, a hardcore gaming experience that you can take with you anywhere.", "metacritic": null, "released": "2018-03-21", "tba": false, "updated": "2024-04-20T14:12:44", "background_image": "https://media.rawg.io/media/screenshots/e76/e767f0b35d82d2d1352854aa1877ae5f.jpg", "website": "https://www.shadowgunlegends.com/", "rating": 3.38, "rating_top": 4, "added_by_status": {"owned": 6, "beaten": 3, "toplay": 2, "dropped": 6, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 8, "suggestions_count": 609, "game_series_count": 0, "reviews_count": 8, "platforms": ["Android", "iOS"], "developers": ["MADFINGER Games"], "genres": ["Action", "Adventure", "RPG"], "publishers": ["MADFINGER Games"], "esrb_rating": "Teen"}