{"id": 581022, "slug": "neon-nights-2", "name": "Neon Nights", "name_original": "Neon Nights", "description": "<p>Lately, Kate has been a little restless. The glowing lights of Metropolis 12 simply don&#39;t hold the luster they once did in her precocious youth. Now, the only things that give her joy are intimacy, and hoverbike racing. And since the intimacy has been sparse lately, she&#39;s taken to speeding her bike through the dark alleys of the city at night, trying to outpace her life.<br />\nThis night, however, might be a little different…<br />\nTall, gorgeous, deeply sexual; you&#39;d think she&#39;d have no trouble getting laid, but there&#39;s just something about her that sends men (and most women) running the other way. Not tonight though… Tonight she&#39;s going to find the perfect pair to handle her. Or, more accurately, she will handle them. Thoroughly<br />\nA precocious little woman with a smile always on her lips, and a love of internal body augmentation – augmentation she puts to very good use. But can those expensive upgrades handle what Kate is going to give her?<br />\nViolet&#39;s best friend, and night-time partner. Unlike V, she&#39;s kept herself all-natural and un-augmented – she swears there&#39;s just something better about an all-natural body when it comes to their line of work. Secretly though, she&#39;s worried clients prefer the luxury services Violet offers, so she always works double-hard to prove herself.Features Kinetic Visual Novel.<br />\nTwo complete standalone stories.<br />\nOver 10,000 words of story.<br />\nContains ~200 CG artworks in 4K format.<br />\nFive background music tracks for you to choose from, select your favorite music.<br />\nMultiple achievements for each story.</p>", "metacritic": null, "released": "2021-04-02", "tba": false, "updated": "2022-11-28T15:43:52", "background_image": "https://media.rawg.io/media/games/783/783e2ddf8b5c2b3709d5bc2ad6cc1c8d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 12, "beaten": 1, "toplay": 3}, "playtime": 6, "achievements_count": 15, "ratings_count": 1, "suggestions_count": 608, "game_series_count": 0, "reviews_count": 1, "platforms": ["Linux", "PC"], "developers": ["CrazySky3D"], "genres": ["Simulation", "Casual"], "publishers": ["CrazySky3D"], "esrb_rating": null}