{"id": 581046, "slug": "safari-zone", "name": "Safari Zone", "name_original": "Safari Zone", "description": "<strong>Safari Zone is a creature-collection adventure!</strong><br/><br/><br/><br/>Thousands of years ago a catastrophic event destroyed cities and terraformed regions around the world causing mutations in fauna and creatures. People travel from all over to learn about the Baun Tree and now <strong>it's your turn to discover the newest Safari Zone and catalogue all of the native creatures it is home to</strong>.<br/><br/><br/><br/>Learn about all of the people who call the Safari Zone home, befriend all of the creatures in the Rocky Tundra and be the first to catalogue the mythical creature Solarin! <br/><br/><ul><li><strong>Full Controller Support:</strong> Whether you want a laid-back experience or just want to play as if you're on a home console, Safari Zone supports complete controller support.<br/></li><li><strong>Roguelike Elements:</strong> When you run out of energy in the Safari Zone you have to leave the park and rest to avoid damage from the Baun Tree. When you rejoin it's like it's your first time. Live in a loop and improve your cataloging skills by learning from your past paths.<br/></li><li><strong>Easy Entry:</strong> Creatures aren't the easiest to catch. Park guides around the Safari Zone are always happy to give you tips, you can even go through the induction with them whenever you want. Ever not sure what to do? Brush up on your skills whenever you want.<br/></li><li> <strong>Colourful Characters:</strong> Talk to everyone and learn about the lives of those in the park. From the Karmybra fanatics to the spiritual lovers, there's a story to be found everywhere.  </li></ul>", "metacritic": null, "released": "2021-04-30", "tba": false, "updated": "2021-04-12T10:48:27", "background_image": "https://media.rawg.io/media/screenshots/b3b/b3b478cc0edfa15b36b161dcb55141d6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 217, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Tiger Collins"], "genres": ["Casual", "Indie"], "publishers": ["Tiger Collins"], "esrb_rating": null}