{"id": 581104, "slug": "powerwash-simulator", "name": "PowerWash Simulator", "name_original": "PowerWash Simulator", "description": "<p>POWERWASH SIMULATORHunt down dirt wherever it’s hiding, respond to calls from across the world, build your own power-washing business and unlock new tools, upgrades and more – all with the soothing satisfaction of power-washing to a sparkling finish!RELEASE THE PRESSUREAbsorb the relaxing atmosphere and stress-free pace as you strip dirt from patios and pavements, vehicles and public parks. Stress gets to us all, so here you can channel all your tension and wash your worries down the drain!CLEANING WITH MEANINGDo you like cleaning in circles or stripes? Are you methodical or chaotic? Here you are free to express yourself by cleaning the way you want.RELAX TO THE MAXIn the campaign mode there&#39;s no right or wrong; no time pressure or final score. Just you and the tools you need to soak away your stress with relaxation and satisfaction. We truly believe this is the most satisfying and relaxing game you’ll ever play!OH, YOU’VE GOT SKILLS TOO?Of course, if you think you’ve got what it takes to be the best in the business, there are challenge modes and a leaderboard with multiplayer coming too, but that is only for people who seek it.EXERCISE YOUR CREATIVITY(Coming during Early Access)<br />\nYour nozzles are your brushes, the neighbourhood is your personal canvas. Unleash your creative instinct and transform ordinary dirt into exceptional artwork. Share your artwork and spread the relaxing power of power-washing - take photos, share your techniques and showcase your power-washing prowess and mud-caked masterpieces!MULTIPLAYER WASH TEAMS(Coming during Early Access)<br />\nInvite a friend to join you on career jobs, or create multiplayer hangouts for up to six friends. Here you’ll be able to chat whilst washing larger spaces, helping to turn your neighbourhood into the brightest place on Earth!<br />\nRelease the pressure, with PowerWash Simulator!</p>", "metacritic": null, "released": "2022-07-14", "tba": false, "updated": "2024-04-21T07:22:04", "background_image": "https://media.rawg.io/media/games/659/65959a07c4e6dc7a9034993bbb3ba232.jpg", "website": "https://futurlab.co.uk/", "rating": 3.99, "rating_top": 4, "added_by_status": {"yet": 15, "owned": 1186, "beaten": 74, "toplay": 29, "dropped": 83, "playing": 40}, "playtime": 11, "achievements_count": 239, "ratings_count": 132, "suggestions_count": 367, "game_series_count": 0, "reviews_count": 138, "platforms": ["Xbox Series S/X", "PC", "PlayStation 5", "Xbox One"], "developers": ["FuturLab"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["FuturLab"], "esrb_rating": null}