{"id": 581131, "slug": "the-moon-2050", "name": "The Moon 2050", "name_original": "The Moon 2050", "description": "The Moon 2050™ – an arcade adventure shooter based on the animated adventure web series, the space saga The Moon 2050, where the main character Harry tries to figure out why all biological beings, including his family and friends, started disappearing from the planet Moon 2050, especially his best friend Sam. But at some point, he discovers that this is happening throughout the universe and that only aliens, robots, and cyborgs are left.  <br/><br/><br/><br/>As it turns out, they are controlled by artificial intelligence (AI) and an inventor who is behind the sinister Black Hole Inc. corporation, which performs horrible experiments on biological creatures, trying to digitize their brains and use them to improve the AI for their own selfish purposes. <br/><br/>The player will have to go through an interesting adventure, together with Harry, to assemble a team and overthrow the regime, which was established by the AI and its creator. <br/><br/>Already ready for this adventure, to save the universe?<br/><br/><br/><br/>The game will be divided into several meaningful parts and you, together with Harry, will have to do the following:<br/><br/> ⁃ Find and free all the members of the team, namely General Green, Shaggy, Jimmy, Joe, Sam, Guide; <br/> ⁃ Go through all the tasks and missions with them, acting as a spy, mercenary, builder, pilot, and hand-to-hand combatant; <br/> ⁃ After that find all the items necessary for further game progress, namely the moon and black stones, currency, and find other hidden caches; <br/> ⁃ Destroy all the ringleaders created by the sinister inventor; <br/> ⁃ Destroy all enemy laboratories and weapons centers and main headquarters;<br/> ⁃ Build biological regeneration centers in their place; <br/> ⁃ Leave the planet and wait for the next part of the game. <br/><br/><br/><br/>Do not forget to watch the animated adventure series, which will further immerse the player in the atmosphere of The Moon 2050 universe and get to know our heroes. <br/><br/><br/><br/>Well, are you still hesitating whether to play or not? Definitely go for it!<br/><br/>", "metacritic": null, "released": "2021-04-08", "tba": false, "updated": "2021-04-12T11:46:13", "background_image": "https://media.rawg.io/media/screenshots/12f/12fbb14862e041256cec9f2b27bd9123.jpg", "website": "https://themoon2050.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 271, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["LAPUSHKIN PAVEL"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["LAPUSHKIN PAVEL"], "esrb_rating": null}