{"id": 581179, "slug": "hopeless-dregs", "name": "Hopeless Dregs", "name_original": "Hopeless Dregs", "description": "Hopeless Dregs is a turn based game with RPG elements. In a world full of evil there will be destiny of a team of hopeless dregs in your hands. Each of them you'll be able to equip and teach new abilities. There are no almighty people in this world, therefore you will need to find strengths and weaknesses of your dregs and build a team in such a way to unleash their potential.<br/><br/>The game will offer you to go the way from town to town along selected route, upgrade your team in towns and take battles between them. Do you have enough strength and hope to finish this hopeless journey?<br/><br/><ul><li>Fast game session - enjoy upgrading your characters from zero to hero for a short time. It will allow you to try many strategies without losing tones of time but still enjoying it.<br/></li><li>Permanent death - characters will die permanently what will make you caring about each team member.<br/></li><li>Bosses - each boss has his own abilities and team. You'll have to know weaknesses and strengths of each of them to be successful in beating the game.<br/></li><li>Synergy - due to flexible ability system, you'll manage your team members in a such way that they will support each other.<br/></li><li>Unique abilities - each character will have unique abilities depending on what equipment and class he has.</li></ul>", "metacritic": null, "released": "2021-04-09", "tba": false, "updated": "2021-04-12T12:20:52", "background_image": "https://media.rawg.io/media/screenshots/a01/a0100064f153c44bfa0c2bba12926a93.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 331, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Discrete Tense"], "genres": ["RPG", "Strategy", "Indie"], "publishers": ["Discrete Tense"], "esrb_rating": null}