{"id": 581177, "slug": "pixel-art-coloring-book", "name": "Pixel Art Coloring Book", "name_original": "Pixel Art Coloring Book", "description": "<strong>What others say: </strong><br/>“I found painting these pictures very relaxing, love all the beautiful and bright colours. When the painting is finished, it is quite an achievement. Thank you.”<br/><br/>Color by number, relax and enjoy while creating your masterpiece! Ultimate de-stress and relaxing coloring by number is suitable for any taste and age. These fascinating pixel art coloring images with easy &amp; challenging pixel art pictures are JUST FOR YOU to relax and nourish your mind. <br/><br/>Pixel Art Coloring Book contains too loveable, too curious, too cute pixel art images to color by number all day long! The game offers a lot of cool pixel art images. Try coloring animals, anime, mandalas, beautiful pop art and many different pixel coloring pages. <br/><br/>Just open relaxing pixel art coloring pages &amp; let your stress go away! Enjoy pixel art from adorable and beautiful to cheeky and funny images! <br/><br/><strong>PIXEL ART COLORING BOOK FEATURES:</strong><br/><br/>🎨FREE COLOR BY NUMBER IMAGES<br/>🎨Categories for any taste: animal, architecture, food<br/>🎨Turn your pics into pixel art<br/>🎨Tools: use magic wand to paint cells of the same color or use a tool to paint entire areas<br/>🎨Zoom in and out<br/>🎨Long press to color continuously<br/>🎨Use different textures &amp; filters and create magic<br/>🎨No stress of picking colors<br/>🎨Color by number in offline mode<br/>🎨Just relax and paint by number<br/>🎨COLOR SPLASH – color pixels of the same color in the entire picture<br/>🎨Color 50% = Tornado??? -----&gt; TORNADOOO!!!<br/><br/><br/>Bring colors and numbers to life! Get Pixel Art Coloring Book and create cool pixel art masterpieces. Pixel Art Coloring Book will take you to a whole new world of colors and numbers. Coloring books have never been so fun!", "metacritic": null, "released": "2021-04-09", "tba": false, "updated": "2022-10-09T23:48:24", "background_image": "https://media.rawg.io/media/screenshots/c78/c78d8a3de1ba1c0ef58a8654e8d24339.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 195, "beaten": 1, "toplay": 1, "playing": 2}, "playtime": 1, "achievements_count": 16, "ratings_count": 2, "suggestions_count": 167, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC", "macOS"], "developers": ["Peaksel"], "genres": ["Casual"], "publishers": ["Peaksel"], "esrb_rating": null}