{"id": 581125, "slug": "a-guard-walks-into-a-tavern", "name": "a guard walks into a tavern", "name_original": "a guard walks into a tavern", "description": "<h3>WARNING</h3>This game will only support Simplified Chinese in Early Access.<h3>Introduction</h3>The Dark Ages are over and the heroes have formed a guild to make the charges for eliminating monsters more transparent and also to provide corresponding receipts.<br/>You will play as a guard appointed by His Majesty. You need to work with an imp to deal with all the monster events in the kingdom, posting rewards for monsters and asking heroes to investigate strange things and destroy monsters.<br/><br/>This is a simulation and strategy game.You need to entrust different levels(or character) of heroes to deal with the different events. You need to ensure that the heroes can undertake enough tasks to raise the level to cope with the future more vicious monster events, and also to ensure that the heroes will not leave the kingdom because of dissatisfaction.<br/><br/>At the same time, you need to make sure yourself survive. As a low-status guard, you not only needs to work hard to raise your family, but also to maintain the support of the court, the people and the Heroes Guild to ensure that you will not be fired or assassinated or executed.<br/><br/>Every playthrough will have a different random storyline, which include a main story of 2 branches and 4 endings, and more than a dozen side stories. The choices players make in these stories will have different effects. You can choose to help former princes back to throne, or you can help a cult summon ancient evil gods to destroy mankind, but if you want to achieve these grand goals, you have to work hard to deal with all kinds of complicated things to keep your job.<h3>How to play</h3>Receive events from all over the kingdom and talk to various clients who are in trouble<br/>Decide how to deal with these events, you can post them or let them burn.<br/><br/><br/>Talk to heroes<br/><br/><br/>Decide how to assign heroes.<br/>Team up multiple heroes to complete a difficult task, or single heroes to investigate alone to uncover the truth.<br/><br/><br/>Work hard and bring back food for your family.<br/>Deal with family chores and pry into the rumors that have been spreading around lately.<br/>", "metacritic": null, "released": "2021-04-07", "tba": false, "updated": "2021-04-12T11:41:42", "background_image": "https://media.rawg.io/media/screenshots/99f/99ffcdcaf0122cfdae833378e2304b10.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 136, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SuQing"], "genres": ["RPG", "Strategy", "Simulation", "Indie"], "publishers": ["SuQing"], "esrb_rating": null}