{"id": 581249, "slug": "kotodama-diary", "name": "Kotodama Diary", "name_original": "Kotodama Diary", "description": "\"Are you looking for a cute pet? Too bad!<br/>Kotadama Diary's characters evolve depending on the words which you feed them, and could even grow up into something... unexpected. <br/>Weird characters, happy characters, sad characters, lovely characters, rude characters, and even, yes, simply cute characters—There's something for everyone!<br/>Can you feed them the right words to make them evolve into a new species? Try your best while you decorate your room with your favorite furniture. And you don't even need to clean up!<br/>Kotodama Diary is a simple, entertaining game that lets you have fun with bizarre characters that evolve depending on your choices!<br/>There are more than 100 different species of these weird characters, known as the \"\"kotodummies\"\".<br/>And, maybe, you'll find that the words you chose tell you something about yourself...<br/><br/>●○ How to play ○●<br/>- Touch or swipe on the hearts to collect them<br/>- When you have enough hearts, words will appear<br/>- Choose one of the words<br/>- Depending on which word you chose, the kotodummy will evolve<br/>- Use gems or tickets to draw fortunes and get accessories<br/>- The kotodummies will wear the accessories you give them, and, if they like them, they'll give you useful items in return<br/>- The kotodummies will collect coins which you can use to buy furniture<br/>- Furniture helps you progress through the game faster<br/>Decorate your room, play with your favorite kotodummies, and create your very own Kotodama Diary!<br/><br/>●○●You'll like this game if●○● <br/><br/>- You like slow-paced, relaxing games<br/>- You want to pass some time for free<br/>- You want more than just cutesy characters<br/>- You want to speak with your pets<br/>- You want some absurd screenshots to share<br/>- You like pixel art<br/>- You like rolling those sweet gachas<br/>- You love putting accessories on things/people/animals<br/>- You enjoy the occasional weird character<br/>- You could do with some giggles<br/>- You like bringin up virtual characters<br/>- You want to decorate your room<br/>- You like collecting things<br/>- You want some very unique \"\"pets\"\"\"", "metacritic": null, "released": "2020-12-10", "tba": false, "updated": "2021-04-12T13:12:04", "background_image": "https://media.rawg.io/media/screenshots/f67/f67f2735cfd6494378ef78f12156213d_zNq376g.jpg", "website": "https://kc-works.com/kotodama-diary", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 90, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["POLARIS-X"], "genres": ["Simulation", "Casual"], "publishers": ["POLARIS-X"], "esrb_rating": "Everyone 10+"}