{"id": 581236, "slug": "truck-simulator-2", "name": "Truck Simulator", "name_original": "Truck Simulator", "description": "Truck Simulator is a great app for your action packed driving games. Have you ever wanted to become a real trucker?  This is a very interesting job!  You need to spend most of your life behind the wheel, leaving your family, friends, cat or dog at home.  You can travel to different locations and get unreal emotions!  You must complete all tasks in order to successfully carry the load and earn money.<br/> Don't forget to upgrade your car or buy more modern trucks like in other racing games.  Choose the best options for yourself!<br/>To safely move a large truck on twisty roads, you need to drive slowly when there is a tight turn ahead.<br/> On the way, you can listen to your favorite music to satisfy your desires and feel great while driving during heavy traffic.  Featuring cool trucks with lots of customization, this simulator provides an immersive driving experience that will make you feel like a real trucker!  During transport activities you need to cope with realistic missions.  There can be a lot of them and there are really difficult ones, but you can handle everything.  Your skills will be tested in this game!  It's time to war and take part in battle games!  With addictive games, you have a chance to become a real driver in the world of trucking.<br/><br/>Luxury FEATURES allow you:<br/>- Drive a realistic truck with different weights and sizes<br/>- Complete exciting missions<br/>- Realistic travel to different cities and countries<br/>- Add and update vehicles<br/><br/>* Upon confirmation of purchase of your subscription, payment will be charged to your iTunes account.<br/>* Subscription will automatically renew unless auto-renew is turned off at least 24 hours before the end of the current period and payment is charged to your iTunes account.<br/>The renewal cost depends on your subscription plan. Our standard subscription plans:<br/>1 week subscription is $ 5.99<br/>For other currencies, the price matches the price level in the App Store Price Matrix.<br/>* Subscription with a free trial period automatically renews to a paid subscription. You can cancel or manage the automatic renewal of the free trial by going to your Account Settings after purchase. Cancellation will take effect 24 hours after the last day of the current subscription period and you will be transferred to a free service.<br/>* Please note: Any unused portion of the three-day free trial period (if offered) will be forfeited when purchasing a premium subscription during the free trial period.<br/>* If you have any questions or suggestions on how we can improve the app, do not hesitate to contact us at kudmytro@gmail.com<br/>* For any other information, see our privacy policy and terms of use.<br/>Privacy Policy: https://docs.google.com/document/d/10xBwWOKHLbjx3__ZZuw62CxA14NqX-6ApU_GSLXdFjw/edit?usp=sharing<br/>Terms of use: https://docs.google.com/document/d/1TI5fh8FZeZRxs9hFQ8gne2ObdhW6N4hKRIsqq7-96YE/edit?usp=sharing", "metacritic": null, "released": "2021-03-25", "tba": false, "updated": "2021-04-12T13:05:44", "background_image": "https://media.rawg.io/media/screenshots/b9d/b9d7c2661e5857a9c0f6e8cd449f54d3_FSSZMOy.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 142, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Maksym Tokhtaryts"], "genres": ["Adventure", "Simulation"], "publishers": ["Maksym Tokhtaryts"], "esrb_rating": "Everyone 10+"}