{"id": 581291, "slug": "outbreak-the-zombie-slayer", "name": "Outbreak: The Zombie Slayer", "name_original": "Outbreak: The Zombie Slayer", "description": "Save the city and shoot zombies in our exciting offline zombie shooting games - OUTBREAK.<br/><br/>In 2020, a new animal transmitted disease spreads in humans and makes them into cannibalistic zombies, a special sniper, Alex, must fight to save his life and massacre the zombies to save what’s left of the human race.<br/>This could be your last day on Earth so defend yourself &amp; cleanse the city of the fast spreading disease to save human race. Fight for survival in a zombie apocalypse with offline shooting games. If you wish to survive, don’t deny your duty and try your best to massacre the zombies before they take over!<br/><br/>This offline zombie games is a gun games where you can:<br/>- Kill zombies with legendary 3D weapons &amp; attractive skins<br/>- Upgrade guns and snipers<br/>- Experience 3D shooting as a true zombie shooter<br/>- Slay zombies of all types from a short and long range<br/>-------<br/>OUTBREAK – CAN YOU SURVIVE?<br/>Non-stop zombies are coming your way. Shoot zombies before the invasion comes to you and kills you since the dead can come anytime in these offline zombie games. Kill zombies &amp; survive the true offline shooting games!<br/>Keep your finger on the trigger, ready for shooting, zombies will appear and run towards you to devour your body.<br/><br/>INSANE ZOMBIE GAMES DESIGN<br/>In this zombie game, 3D zombies are designed with various deadly killing abilities. They’re not stupid, some of them could be infected with the virus! Players can find loads of zombie types in this offline shooting game as well!<br/>Zombies are walking towards you, let’s hunt them down &amp; cleanse the city of the disease!<br/><br/>MANY OFFLINE SHOOTING UNIQUE GUNS<br/>Supply yourself with a huge real arsenal. Many deadly guns and more to come for thrilling experience in sniper offline games. You can upgrade your weaponry for better precision and damage.<br/><br/>APPEALING OFFLINE ZOMBIE GAMES’ QUESTS<br/>Complete quests to earn medals and unlock better guns, upgrade armory and earn health for your sniper. Kill more zombies and get a change to become a legendary sniper. Medals are collectable once a quest is completed. <br/><br/>SIMPLE &amp; ADDICTIVE GAMEPLAY<br/>Shooting games’ auto-fire system helps zombie shooters focus more on shooting and surviving from the undead.<br/>Modern control that brings you a fun and exciting combat. Your duty is to shoot and kill zombies to save yourself and the remaining humans! It’s time to take action for your city! The future of mankind depends on you. Shoot to kill, be quick on the trigger and survive in this 3D Zombie apocalypse game!<br/><br/>ADDICTIVE FREE OFFLINE GAMES<br/>OUTBREAK is one of the offline sniper games, which means you can shoot and defeat zombies whenever and wherever you want! We recommend that you connect to a Wi-Fi to download the game, but you don't need Wi-Fi to play the game and enjoy your gaming experience.<br/><br/>Be the hope for the survival of humans and bring the disease outbreak to an end. Download &amp; fight against the zombie apocalypse in OUTBREAK for free now!", "metacritic": null, "released": "2021-02-06", "tba": false, "updated": "2022-06-27T13:28:47", "background_image": "https://media.rawg.io/media/screenshots/c7d/c7d2aa3b5af647943fadc1271faf00ec.jpg", "website": "https://www.solaristek.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 501, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Android", "iOS"], "developers": ["Solaris", "Solaris Studio"], "genres": ["Action", "Shooter", "Adventure"], "publishers": ["Solaris"], "esrb_rating": "Mature"}