{"id": 581279, "slug": "red-blue-stickman", "name": "Red & Blue Stickman", "name_original": "Red & Blue Stickman", "description": "Perfect news for the lovers of blue girl and Fire red boy! Your favorite chapter of fireman and  aqua girl is now available on mobile as Water and Fire: Forest Maze! Who thinks fire (fire red boy - red boy) and water (water blue girl - bluegirl) could be the best of friends?! How well do your hands work together? The Forest Temple is an addictive platform puzzle game, where you have to control two characters synchronously. Control both creatures at the same time and activate buttons to move platforms, push boxes and collect diamonds to get to the exit door of the forest temple? That’s what the brave heroes Water blue girl and Fire red boy are about to find out for themselves in this amazing teamwork adventure game.<br/><br/>The best maze game, teamwork game and adventure game ever in Water and Fire stick: Forest Temple Maze! It's addictive and very fun to play with your kids or your friends. Have a good time with Lava Red boy and IceCool girl!<br/><br/>One day, fire and ice go together and hotboy (fire boy - red boy) has lost the map and the ice girl (blue girl – water blue girl - cool girl) want to go home. But the Temple Forest Jungle has many traps and topass it, they must solve many quest of maze puzzle. Go with them on love adventure, escape the temple forest and go home safe.<br/><br/>In this cool teamwork game, Fireman (red boy - hot boy) can control powerful flames while his friend, Water blue girl (blue girl - cool girl - icegirl) keeps things cool with her awesome aquatic abilities. Redboy can slide across frosty surfaces but this hot boy going to have a hard time climbing up any slopes that have snow on them. He’ll slide right off. Meanwhile, Bluegirl gets slowed down whenever her feet touch flat areas covered in snow and ice. Snowy slopes are no problem for this cool girl, though. She can blast right up them! So this dynamic duo is going to once again need to team up while they jump across all of the temple’s platforms and race towards each exit door. It’s the only way for Lava Red Boy and Blue Ice girl make it through all the levels and collect tons of precious, color-coded jewels along the way. They’re bound to encounter lots of traps and puzzles, too, and that’s where you come in. Hotboy and Icegirl will need your help while they try to figure out how to pass over lakes by freezing them with lasers or get around pools filled with bubbling molten lava. These two heroes Lava Boy and Icegirl love a good adventure and they’re hoping that you do as well.<br/><br/>Features of Red Hot boy and Water Blue girl: Forest Temple Maze <br/>- Various maps and levels being updated frequently <br/>- Easy but addictive teamwork gameplay <br/>- Nice characters and design <br/>- Smooth control <br/><br/>How to play Red Lava boy and Water blue girl: Forest Temple Maze<br/>- Move Lavaboy and Ice Water girl by arrows and avoid obstacles. Red boy must avoid the water while Blue girl must avoid the fire. <br/>- Just tap the button \"\"Change\"\" to change from Water blue girl stick to Fire red boy <br/>- Collect gems as many as possible <br/><br/>Download Water blue girl and Fire red boy: Forest Temple Maze now! Help Hotboy and Coolgirl get through each level quickly in this challenging game. Do not waste your time, and get started your journey right away!", "metacritic": null, "released": "2021-04-03", "tba": false, "updated": "2021-04-12T13:25:52", "background_image": "https://media.rawg.io/media/screenshots/fa2/fa214d88f60a7f8ecc4a835bd03f971d.jpg", "website": "https://dmobin.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 39, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tingo"], "genres": ["Adventure", "Casual"], "publishers": ["TINGO INTERNATIONAL TRAVEL COMPANY"], "esrb_rating": "Everyone 10+"}