{"id": 581258, "slug": "racing-outlaws-drag-car-race", "name": "Racing Outlaws - Drag Car Race", "name_original": "Racing Outlaws - Drag Car Race", "description": "Best Drag n Drift Car Racing Games on App Store....Period.<br/><br/>Mega Racing Game in less than 150 MB.<br/> <br/>Join the most furious Offroad Outlaws on racing tracks<br/><br/>Quench your thirst for unruly racing , release your stress while you dash destroy and crash the objects on the road as you race along the most realistic racing tracks with most furious competitors.<br/><br/>Experience the lawlessness at its peak,love of brutal destruction at its height and the never quenching thirst for the absolute madness called Redline Racing. <br/><br/>If you are a fan of CSR SUP Need for speed Asphalt MMX hill dash 2 Hill climb racing color road need for speed or Smashy road- You should try this game first and see the adrenaline flow through your every pore of your skin. The world where winning is more beloved than life, crashing is preffered over passivity and craziness is preffered over sanity. Welcome to the insane world of racing called ....REDLINE Racing.      <br/><br/>If you are a fan of CSR SUP Need for speed Asphalt MMX hill dash 2 Hill climb racing color road need for speed or Smashy road- You should try this game first and see the adrenaline flow through your every pore of your skin.<br/><br/><br/>Redline Race is heart-pounding, visually astounding 3D racing game that puts the steering wheel directly in your hands.<br/><br/>Experience all of the excitement, competition and glory of championship racing. This is handheld racing like you've never seen before, in the most stunning, realistic and intuitive racer on iPhone, iPod Touch and iPad. Get Redline Race today, and find out what everyone is raving about! <br/><br/>Features:<br/>-30 visually amazing and challenging Levels<br/>-Simple,Smooth and effective Controls<br/>-Astonishing physics brings chaos to another level<br/>-Intelligent enemies driving beautiful racing cars<br/>-Highly detailed 3D Graphics<br/>-Supports both Touch Controls and Tilt Controls", "metacritic": null, "released": "2012-04-20", "tba": false, "updated": "2021-04-13T13:16:32", "background_image": "https://media.rawg.io/media/screenshots/787/78786bcdd4f8c174285c9050c28a10e9_5MVAQxA.jpg", "website": "http://al-khawarizimisoft.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 104, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Games", "Top Free 3D Car", "Bike Racing and Shooting Game"], "genres": ["Sports", "Racing"], "publishers": ["AL-KHAWARIZMI SOFTWARE DEVELOPMENT & SERVICES"], "esrb_rating": "Teen"}