{"id": 581214, "slug": "super-chopper", "name": "Super Chopper", "name_original": "Super Chopper", "description": "Climb into the cockpit of a military attack helicopter and take on five life or death scenarios. Use your bristling arsenal of weapons, speed and superior maneuverability to take down enemy tanks, helicopters and missile platforms. <br/><br/>Whether you’re rescuing stranded soldiers, putting out fires with your water cannon, or escorting VIP convoys, you’ll need to keep your eyes up and your finger on the trigger. Take down enemy air support with target locked missiles, blast apart armored ground targets with bombs or lay down a spray of machine gun fire. <br/><br/>Super Chopper comes with 50 unique missions set in five different environments; red rock canyons, grassy plains, jungle, snowy mountains and desolate desert. The action doesn't stop there thanks to the level editor tool which lets you build your own missions and share them through Steam Workshop. Select a map and mission type, then decide the placement and number of objectives and enemies to build challenging levels you can share with friends.<br/><br/>Features:<br/><ul><li>Pick-up-and-Play: Super Chopper makes it easy to jump into the action with intuitive flight controls, no pilot's license required. <br/></li><li>Airborne Arsenal: Quickly swap between 4 weapon types, standard machine gun, rapid fire machine gun, missiles and bombs.<br/></li><li>Five Environments: red rock canyons, grassy plains, jungle, snowy mountains and desolate desert with a variety of weather conditions.<br/></li><li>Mission Briefing: Master 5 mission types: stealth, combat, rescue, escort, and fire patrol.<br/></li><li>Hours of Fun: Play through all 50 missions to become a true ace pilot<br/></li><li>Level Editor: Create your own custom missions with the robust editor tool. </li></ul>", "metacritic": null, "released": "2021-04-21", "tba": false, "updated": "2021-04-23T03:38:23", "background_image": "https://media.rawg.io/media/screenshots/bcc/bcc809dbecf65fd74ca99ba7320150d3.jpg", "website": "https://www.ziggurat.games/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 265, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Webfoot"], "genres": ["Action", "Simulation"], "publishers": ["Ziggurat", "Ziggurat Interactive"], "esrb_rating": null}