{"id": 581243, "slug": "ginst-gravity-instrument", "name": "Ginst - Gravity Instrument", "name_original": "Ginst - Gravity Instrument", "description": "Extraordinary music game which uses your phone's G-sensor data as input parameters for note pitch and player positioning.<br/>Learning to play music can be fun, inspiring, time consuming, but one thing is certain – it’s never easy. It is necessary to choose the appropriate instrument, to spend money and time for music classes and to ensure patience for everything ahead. Not anymore.<br/>Thanks to the intuitive interface, Ginst allows you to easily master the basics of playing, the easiest way – just enjoy the game.<br/>Whether you are a beginner who only ever listened and watched others play an instrument or a professional looking for a new musical challenge, Ginst is the right choice for you.<br/>Whether you use the mobile phone version where your mobile phone becomes a musical instrument, or a version designed for personal computers where music magic begins with the Vayu controller, this is your chance to turn your movements into music.<br/>Enjoy our original music themes.<br/>Ginst - the right move for your ears.<br/><br/>GAME BASICS<br/>Use your mobile G sensor as Note Pitch to get the right tone. Tap when note enters hexagonal keyboard to play the instrument.<br/><br/>GAME MODES<br/>Arcade - Master your skills through a series of tutorial and songs. Every song you play, unlocks Quick Play, Multiplayer and Free-play.<br/>Quick Play - Play your song in three mode Lead, Bass, Percussive. Change your difficulty:<br/>\t* Easy - just tap with left and right thumbs to produce note sound when note hits hexagonal keyboard<br/>\t* Medium - use G sensor on your phone to get the right pitch position. Playing range is larger to help catching the notes.<br/>\t* Hard - Same as medium, but Playing range is exactly one note pitch.<br/>\t* Expert - Play your song with G sensor on your phone with no visual data. You must use right move for your ears :) .<br/>Free Play - Import your favorite midi songs, take your instrument, select track to play and enjoy harmony.<br/>\t* Musician - Play your music with moving your phone in freestyle. Use G sensor and specific thumbs moves to make polyphony.<br/>Multiplayer - Play Ginst with your friends in local network. Select Lead, Bass or Percussive track for every player. Play your instruments and songs with your band.<br/>Preview - Watch and listen. See how our AI plays songs and learn.<br/>Musical Instruments - You can change your musical instrument and play every mode with your desired sound.<br/><br/>LICENCES<br/>Ginst - Gravity Instrument uses Unreal® Engine. Unreal® is a trademark or registered trademark of Epic Games, Inc. in the United States of America and elsewhere. Unreal® Engine, Copyright 1998 – 2020, Epic Games, Inc. All rights reserved.<br/>This application uses a FluidSynth Library. You can find its source code at: https://github.com/FluidSynth/fluidsynth.<br/>In accordance with FluidSynth library LGPL 2.1 licence, you can replace it with a modified version and test it with our binaries, using Xcode Project we provided at: https://www.d-logic.net/code/ginst_public/ginst_ios<br/>PRIVACY POLICY<br/>https://www.g2ames.com/privacy-policy/", "metacritic": null, "released": "2020-12-20", "tba": false, "updated": "2021-04-12T13:09:34", "background_image": "https://media.rawg.io/media/screenshots/c87/c8761890f5230e5b56ee38312e89b272_zrzUrN7.jpg", "website": "https://www.g2ames.com/ginst/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 278, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Gravity Games"], "genres": ["Casual"], "publishers": ["Gravity Games DOO"], "esrb_rating": "Teen"}