{"id": 581239, "slug": "dead-mans-phone", "name": "Dead Man's Phone", "name_original": "Dead Man's Phone", "description": "Play the lead in a BAFTA-nominated crime drama. You are a London Yard detective who solves murders through the smartphone of victims.<br/><br/>**Dead Man's Phone is reinventing gaming for the crime podcast age** WIRED<br/><br/>Imagine having the smartphone of a murder victim. Finding clues in their personal messages, photos &amp; apps. Introducing Dead Man’s Phone – a police crime drama – starring YOU as the lead character.<br/><br/>- Search the victim’s personal messages, photos &amp; social media for clues<br/>- Command your police team on the ground and in the lab<br/>- Conduct *FaceTime* Interrogations<br/>- Make Calls<br/>- Affect National Headlines<br/>- Find the Killer<br/>- Multiple endings – you choices matter<br/><br/><br/>Run an ENTIRE murder investigation from your phone.<br/><br/>If you enjoy Netflix crime dramas or true crime podcats, you will be hooked by Dead Man’s Phone.<br/><br/>--<br/><br/>Dead Man’s Phone is a totally live-action experience featuring an ensemble cast of actors.<br/><br/>The app pushes the boundaries of immersive storytelling – your detective partner in the narrative, DCI Michael Sutherland, is voiced by a REAL homicide detective, Detective Sergeant Simeon Cryer.<br/><br/>Det Cryer has spent 20 years as homicide detective in the Bristol Major Crime Team pioneering the use of data in crime-solving. <br/><br/>SEASON 1<br/><br/>16-year-old, Jerome Jacobs, is thrown from the twelfth floor of a London tower block. Jerome is a smart, talented and popular young man. His death stuns the community.<br/><br/>Witnesses believe they heard Jerome shout the word ‘redman’ before he fell...<br/><br/>Run the Jerome Jacobs murder investigation from your phone. Uncover the mystery of redman &amp; bring his killer to justice.<br/><br/>Search Jerome’s personal messages, photos &amp; social media for clues<br/>Experience &amp; understand Jerome’s life in a unique and powerful way<br/>Become intimately connected with Jerome’s family and friends<br/>See your choices affect national news headlines", "metacritic": null, "released": "2021-03-29", "tba": false, "updated": "2021-04-12T13:07:18", "background_image": "https://media.rawg.io/media/screenshots/54e/54ea098b67589274a3c555934001a820_6ps5zIY.jpg", "website": "https://www.deadmansphone.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 235, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Electric Noir Studios"], "genres": ["RPG", "Simulation"], "publishers": ["Electric Noir Studios"], "esrb_rating": "Mature"}