{"id": 581213, "slug": "intravenous", "name": "Intravenous", "name_original": "Intravenous", "description": "<p>A LOVE LETTER TO EARLY SPLINTER CELL GAMES<br />\nYou just entered the warehouse through the vent shaft as you hear voices from outside. They know you’re here. Someone must have tipped them off.<br />\nYou continue to stay in the shadows. You shoot out lights, flip off circuit breakers and lockpick doors. You are a silent assassin.<br />\nYou distract the guards by throwing bottles or imitating their wives voices. One by one you pick their lights out.<br />\nFuck. You’ve been compromised. You shoot out the next door lock and go in guns-blazing. In an adrenaline filled shootout you eliminate your target and barely manage to escape. Well done!<br />\nEnter the world of Intravenous as Steve Robbins - a man set out for revenge after losing his brother to low-life junkies. Delve deep into the criminal world under the guise of darkness or go armed to the teeth, guns-blazing, and padded with armor.<br />\nOld-school stealth. Your visibility depends on how well-lit the environment is, and every step you take makes noise.<br />\nTeeth-grinding action. Fun stealth gameplay does not exclude fun gunplay. Intravenous is meticulously designed to offer stealth for those looking for it, as well as no-brakes gunplay to those itching for a gunfight.<br />\nReactive AI. Your enemies will do more than just rush straight at you. If they&#39;ve found a dead body they will alert their friends in hopes of finding you. If they hear you sneaking about, they will investigate. If they see you, they will open fire. If they&#39;re unarmed, they will try to find their friends and warn them of you.<br />\nCapable enemies. Enemies take cover during gunfights, use flashlights in darkness, and radio in suspicious activity. Any misstep you make will result in your opponents responding appropriately.<br />\nLots of weapons. Multiple weapons, each with their unique handling. Each works best in a specific situation. You&#39;re sure to find your personal favorite here.<br />\nChoose your loadout. Pick a rifle, a pistol, and a bulletproof vest to be ready for combat, or just a pistol and naught else, to be quick, agile, and silent- ready for improvisation.<br />\nAdapt to your surroundings. Shoot lights out, crawl through vent shafts, flip circuit breakers off, throw bottles to distract your foes, lockpick doors to find alternative ways in - or simply shoot the door lock out, and go in guns-blazing.<br />\nA gritty story. Steve Robbins lost the single most important person in his life - his brother. With aid from a mysterious person claiming to have suffered a similar fate, he decides it&#39;s time to take matters into his own hands after the police turns up empty-handed. Nothing is as clear cut as it seems to be.<br />\nUncapped frames per second. 60hz display? Yep. 144hz? No problem. Enjoy the swift action or edge-of-the-seat stealth on your preferred monitor refresh rate.</p>", "metacritic": null, "released": "2021-07-26", "tba": false, "updated": "2024-03-10T07:51:55", "background_image": "https://media.rawg.io/media/games/d39/d39681042f1ba444be99340c89db4528.jpg", "website": "", "rating": 3.86, "rating_top": 4, "added_by_status": {"yet": 20, "owned": 262, "beaten": 10, "toplay": 24, "dropped": 11, "playing": 5}, "playtime": 1, "achievements_count": 40, "ratings_count": 22, "suggestions_count": 345, "game_series_count": 0, "reviews_count": 22, "platforms": ["PC"], "developers": ["Roman Glebenkov"], "genres": ["Action", "Indie"], "publishers": ["Roman Glebenkov"], "esrb_rating": null}