{"id": 581276, "slug": "mech-arena-robot-showdown", "name": "Mech Arena: Robot Showdown", "name_original": "Mech Arena: Robot Showdown", "description": "Mech Arena: Robot Showdown is a FREE competitive multiplayer mech shooter with deep gameplay, intense team battles, and lush 3D graphics.<br/> <br/>With levels designed for tight, fast PvP game play, battles take about five minutes. You’ll spend all of those with guns blazing. Real-time multiplayer 5 vs 5 big bad robot combat never looked this good!<br/><br/>Choose from dozens of weapons and mechs with special abilities for endless combinations, then customize them for each new challenge. Meet friends and form teams to help you dominate lightning-fast Control Point Capture matches or brutal Team Deathmatch battles.<br/><br/>Like taking the high ground? Back up your team with a sniper mech. Want to get up close and personal? Respawn, re-arm with autocannons, and jump back in. With instant live match-making, you can go from pocket to live battle in less than 30 seconds!<br/><br/>Pulverize the rankings, crush global Tournaments, customize everything, and carve out your legend as the baddest pilot in the Mech Arena League. Shoot smart... the world is watching!<br/><br/>⋇FEATURES⋇<br/><br/>REAL-TIME 5v5 MULTIPLAYER <br/><br/>Test your skill against real players from around the world in live matches. Take your shooter friends with you in complex team gameplay as you conquer the rankings together.<br/><br/>COMPETITIVE GAMEPLAY<br/><br/>With rankings and achievements, there’s more than one way to take home medals, prizes, and free gear for your mechs. When you’re ready, join in Tournaments to prove your worth. Rise up the brackets, pick up the prize, and strike fear in your enemies.<br/><br/>JUST POINT AND SHOOT<br/><br/>Simple and intuitive controls make it easy to get the hang of things even in your first PvP battle. Want to play it your way? Customize your controls the way you want them.<br/><br/>THE RIGHT MECH FOR THE RIGHT JOB<br/><br/>Are you a scout? Sniper? Support? There’s a mech chassis and weapon loadout for you. Apply unique skins or add paint jobs to make your mech stand out in the crowd.<br/><br/>FORM A TEAM<br/><br/>Get your friends together, plan your strategies, design complimentary Mechs, and fight side-by-side. Bring in allies from Facebook, or find new ones on the battlefield. Mech Arena is like a LAN party you carry in your pocket!<br/><br/>UNIQUE GAME MAPS<br/><br/>Fight up close in the Mech Arena. Run missions at the Mesa Verde facility, or take your combat to the stars at Elon Station Gray. Shoot down enemy mechs under the neon lights of Neo Hokkaido, or fight through the frost of Patterson Station. The world and beyond is your arena.<br/><br/>TONS OF WEAPONS<br/><br/>Attack from cover with devastating long-range artillery, shoot around corners with smart missiles, freeze targets with stasis guns, or rely on good old kinetic and energy weapons. They’re all fully upgradeable, so go nuts.<br/><br/>SPECIAL MECH ABILITIES<br/><br/>Blind your opponents with targeting jammers. Shoot forward at ramming speed. Deploy energy shields, repair fields, jump jets, mines, and more. Every map is different - find the right mix for your winning tactic.<br/><br/>NO WIFI? NO PROBLEM.<br/><br/>Mech Arena: Robot Showdown is a shooter designed to work on most 4G/LTE networks. It should work as well as your carrier does. You can (and should) play it wherever you can get away with it.<br/><br/>PLEASE NOTE:<br/><br/>• Items are available for purchase in this game. Some paid items may not be refundable depending on the type of item.<br/>• Mech Arena is available in English, Russian and Japanese.<br/>• This is an early Beta version of the game. We need your help to make it better, so please give us your feedback at: arena.support@plarium.com<br/><br/>Official Website:  https://plarium.com/<br/>Support: arena.support@plarium.com<br/>Community: https://plarium.com/forum/en/mech-arena/<br/>Privacy Policy: https://plarium.com/en/legal/privacy-and-cookie-policy/<br/>Terms of Use: https://plarium.com/en/legal/terms-of-use/<br/>Privacy Request: https://plarium-dsr.zendesk.com/hc/en-us/requests/new", "metacritic": null, "released": "2020-07-10", "tba": false, "updated": "2024-03-09T16:32:00", "background_image": "https://media.rawg.io/media/screenshots/3ad/3ad215144ce8292dfc392b3f648bc92f_hQND6gf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 6, "toplay": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 4, "suggestions_count": 233, "game_series_count": 0, "reviews_count": 4, "platforms": ["iOS", "Android"], "developers": ["Plarium"], "genres": ["Action"], "publishers": ["Plarium"], "esrb_rating": null}