{"id": 581219, "slug": "potion-craft-alchemist-simulator-demo", "name": "Potion Craft: Alchemist Simulator Demo", "name_original": "Potion Craft: Alchemist Simulator Demo", "description": "Potion Craft is an alchemist simulator where you physically interact with your tools and ingredients to brew potions. You're in full control of the whole shop: invent new recipes, attract customers and experiment to your heart's content. Just remember: the whole town is counting on you\n<br/><br/><br/>\n\nJoin our Discord:\n\n<br/>\n\nFeatures:<ul><li>Unique visuals inspired by medieval manuscripts and medical books.\n<br/>\n</li><li>Hyper satisfying physical interactions with ingredients and equipment.\n<br/>\n</li><li>Sandbox style gameplay where you have many different avenues available, and it’s up to you to figure out the best way to complete each task.\n<br/>\n</li><li>Sell your potions to the townsfolk while roleplaying as a noble artisan, a greedy weasel, an occult dark master, or whomever else you may wish to be!</li></ul>Work with all sorts of ingredientsLeaves, flowers, berries, roots, fruits, minerals, and a plethora of mushrooms are at the ready for your mortar and pestle. Just like espresso, the fineness of the grind matters!\n<br/>\n<br/>\n<br/>\n\n  Learn the art of potion makingConcoct your potion plan. Grind ingredients and carefully mix them in your cauldron. Heat the coals. Boil and stir. Add the base: water, oil, or… something else. Congrats on your first potion! Was it easy to learn? Now try mastering it!\n<br/>\n<br/>\n<br/>\n\n  Experiment and invent new recipesCarefully plan your route via the Alchemy Map to combine different effects. Be mindful of common sense: you won’t find a market for a poisonous healing potion… right? Or would you?\n<br/>\n<br/>\n<br/>\nSell potionsEvery day customers will come to your store looking for solutions to their problems. You will face consequences depending on what you decide to sell them. Attract guilds, befriend notable figures (or feud with them), gain riches and influence - and one day, you may even decide the fate of the whole town.\n<br/>\n<br/>\n<br/>\n\n  Buy ingredients or grow your ownEvery alchemist needs ingredients. You can buy them from traveling merchants: it can be pricey, but successful haggling may save you some coin. Or you can just grow your own!\n<br/>\n<br/>\n<br/>\n\n  Get creative with customizingWant to give a special appearance to your best potions? Go ahead! Change bottle shape, label type, icon, and colors. You can even give it a custom name and label description. Carefully arrange your unique potions to showcase them on your shop’s shelves and tables… or carelessly throw them around - we’re not gonna tell you what to do, just have fun!\n<br/>\n<br/>\n<br/>", "metacritic": null, "released": null, "tba": false, "updated": "2023-12-02T15:00:15", "background_image": "https://media.rawg.io/media/screenshots/713/7136f51bb191c09ca0dea8530508c5ff.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 45, "beaten": 2, "dropped": 2}, "playtime": 2, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 309, "game_series_count": 0, "reviews_count": 4, "platforms": ["PC"], "developers": ["niceplay games"], "genres": [], "publishers": ["tinyBuild"], "esrb_rating": null}