{"id": 581317, "slug": "the-first-16-bit-video-game-borned-from-me-years-a", "name": "The first 16 bit video game borned from me years ago", "name_original": "The first 16 bit video game borned from me years ago", "description": "<p>BACCI and the ducklings v.2.4:<br/>-----------------------------:</p>\n<p>In this tiny video game, Bacci is<br/>a super-equipped hunter of the Alps<br/>Liguri who is in the midst of flocks of<br/>birds of various kinds.<br/>The aim of the game is to take down all the<br/>birds, without running out of ammunition.<br/>When the number of live birds is greater<br/>the number of ammunition available to<br/>BACCI, he has to go home with the<br/>pive in the bag.<br/>Attention, however: BACCI has rivals; Yes<br/>it deals with reckless and envious hunters,<br/>who, stealing the wings of Icarus, will try to<br/>steal the game from BACCI, only afterwards<br/>having reduced it to game.<br/>BACCI has a jacket at his disposal<br/>bulletproof, a rifle, a machine gun and a<br/>radar.<br/>By hitting a macroscopic letter, it<br/>it will explode, taking both him to hell<br/>birds than hunters who are close to it.<br/>If the time available to you is<br/>exhausted, BACCI must catch up with great<br/>I regret his wife, who is waiting for him furiously<br/>on the door, but in this case he lost one<br/>bet with his friends; if instead he is<br/>managed to clear the sky of all<br/>birds, she'll have to cook for a year<br/>whole meat to the little bird, with great<br/>pleasure of her husband, who is very fond of it.<br/>Have fun from the author of this<br/>software, Paolo Fassin (seven \"paintings\"<br/>consecutive).</p>\n<p>Mouse functions:<br/>------------------:</p>\n<p>LEFT CLICK: Shoot.</p>\n<p>RIGHT CLICK + movement:<br/>Fast forward / backward.</p>\n<p>Keyboard functions:<br/>-----------------------:</p>\n<p>ENTER: Shoot.</p>\n<p>KEYPAD-2,4,6,8 (or arrow keys): Moves the<br/>viewfinder horizontally or vertically.</p>\n<p>KEYPAD-1,3,7,9 (or END, PG_DOWN, HOME,<br/>PG_UP): Moves the viewfinder diagonally.</p>\n<p>BACKSPACE: Fast relegation.</p>\n<p>TAB: Change the type of radar (scanning or<br/>linear, small or large, computerized or<br/>not) or disable it.</p>\n<p>M: Enable / disable the machine gun (use the<br/>configuration program to change the<br/>speed of the machine gun or to disable it).</p>\n<p>T: Enable / disable text in<br/>overlay (information on<br/>game).</p>\n<p>S: Enable / disable sounds and music<br/>(use the configuration program for<br/>choose active sounds).</p>\n<p>L: Enable / disable shot flashes<br/>(use the configuration program for<br/>change the color and / or speed of the<br/>lightnings).</p>\n<p>P: Enter or exit the pause mode.</p>\n<p>SPACE: Start over.</p>\n<p>ESC: Returns to the initial screen and, from<br/>there, to the operating system.</p>\n<p>Screen Description:<br/>-------------------:</p>\n<p>No. top left of the radar: time a<br/>arrangement.</p>\n<p>Color bar to the right of the time: health of<br/>BACCI.</p>\n<p>Image of a flash to the right of the health:<br/>flashes of opponents' shots<br/>enabled.</p>\n<p>Image of a note to the right of the flash:<br/>sound effects enabled.</p>\n<p>Image of a machine gun to the right of the note:<br/>machine gun enabled.</p>\n<p>No. bottom left of radar: number of<br/>live birds / number of live opponents.</p>\n<p>Bottom right of radar: aim from 0.0% to<br/>100.0%.</p>\n<p>SCORE: Score of the match.</p>\n<p>AMMUNITION: Bullets available to<br/>Bacci.</p>\n<p>Preference programming (CONFIG.EXE):<br/>--------------------------------------------:</p>\n<p>As has been said, this game is small;<br/>to make it more interesting it was<br/>added the configuration program<br/>CONFIG.EXE.<br/>It allows you to customize \"BACCI &amp; the<br/>ducklings \", changing the weapons available,<br/>the radar, the sounds and all<br/>images / animations of the game, choosing them<br/>among a decent range of variants.<br/>Finally, with CONFIG.EXE, it is possible to create<br/>new episodes up to a maximum even number<br/>to 100 (this option is quite complex<br/>and it is recommended to see the documentation<br/>following before creating a new episode).<br/>Since not all images / animations are<br/>suitable for a specific purpose, \"BACCI &amp; the<br/>ducklings \"may not work; in this<br/>case, exit the game and select the item<br/>\"standard reset\" from the menu<br/>main CONFIG.EXE (in this version<br/>every risky operation is undertaken<br/>after consulting the user, that<br/>will be able to confirm or cancel it; moreover i<br/>installed data are now more<br/>protected).<br/>Then save the changes with F10.</p>\n<p>NOTE: If you want to delete all scores<br/>from the special scoreboard that appears before<br/>playing with BACCI.EXE, use the item<br/>STANDARD RESET of the program<br/>CONFIG.EXE.</p>\n<p>Notes on programming a new one<br/>episode (CONFIG.EXE):<br/>-------------------------------------------------- ---------:<br/>Once the CONFIG program has started, choose the<br/>LOAD CONFIGURATION item and select<br/>the desired level (BACCILxx.CFG, where xx<br/>is the level number); after that it will be<br/>You can change the configuration of a<br/>level, customizing it with new data<br/>(new level).<br/>Then choose the item SAVE<br/>CONFIGURATION and use a new number xx<br/>for the new level BACCILxx.CFG; the new<br/>level saved in this way will be executed in<br/>order specified by xx.</p>", "metacritic": null, "released": "2020-08-20", "tba": false, "updated": "2021-04-12T13:43:36", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Paolo Fassin"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}