{"id": 581399, "slug": "its-over-i-have-the-high-ground", "name": "It's Over! I Have the High Ground!", "name_original": "It's Over! I Have the High Ground!", "description": "<p><strong><strong>Two</strong> lava scientists try to escape the lava! Don't touch the lava and stomp on your opponent for points!<br/></strong></p>\n\n<p><strong>Player 1 (Orange)</strong>\n</p>\n<p>A: Move left\r\n</p>\n<p>D: Move Right\r\n</p><p>Left-Shift: Boost</p>\n<p><strong>Player 2 (Green)</strong>\n</p>\n<p>Left Key: Move left\r\n</p>\n<p>Right key: Move right\r\n</p><p>Right-Shift: Boost<br/></p>\n<p><em>It’s Over! I Have The High Ground! </em>is a local multiplayer 2D endless runner action game in which two players control their own lava scientist who is trapped in a volcano where they must compete by stomping on each other to gain points and at the same time landing on the rocks so they don’t fall into the lava. Player 1 (Orange) uses the A and D keys to move left to right while Player 2 (Green) uses the left and right arrow keys for the same controls. The game features rocks falling towards the lava and it is up to the players to use them to stay away from the lava.<br/></p>\n<p>To give the players more stakes and an incentive to not fall, I make the bottom of the room where the player collides when they are knocked out appear more hazardous and thus. I created a lava pool to show the players of the dire consequences shall they not be careful. To match the lava pool, I changed the sprites for the players by giving them thermal suits to suit the world they are situated in and creating a narrative to support that they are rivals who will stomp each other into the lava pit below. I also changed my background to show rocky textures with lava oozing from them to make the environment look more gruesome.\r\n</p>\n<p>For the gameplay, I decided to focus on my main verb of surviving. I wanted my players to feel trapped by the environment around them and create an endless runner that facilitated this design. In order to do this, I revised my rocks spawning areas so that they spawned higher and away from the bottom of the screen. This gave players more advantage so that when they spawn, they could find a rock to boost themselves to a higher level instead of failing to find one near the bottom which could lead to them falling into the lava and becoming frustrated. I also created my own sound effects with Adobe Audition since I couldn’t find the ones that fit my game. \r\n</p>\n<p>One of the iterations I made from the playtest was in the camera since there were feedback that the movement wasn’t smooth and it felt disorientating. So I decreased the lerp in the code by creating a new variable in the “Create” event of the camera called “lerpSpeed” and replaced all the lerp values in the parameters with that variable. I found this method easier since I could just tweak the variable value in one place without having to go through each of the same values to change them. I will continue to use this technique in the future. In addition, I was also given feedback on the visual design and decided to add another visual stage for the rocks when they get closer to the lava.\r\n</p>\n<p>Overall, I’m proud of the finished game because it was pretty hard to simulate the physics using GameMaker since I’m used to using Unity’s physics engine itself. Making this game has taught me how to think from a more mathematical and logical standpoint so that I don’t have to rely on pre-made physics. If I have more time to improve on my game, I will change my two scientists characters to Anakin Skywalker and Obi-Wan Kenobi since the current title of the game alludes to a famous line from the climactic scene of <em>Star Wars Revenge of the Sith</em>. If  I do change those two characters, I will also include a fighting mechanic.\r\n</p>\n\n<p><strong>Initial Playtest Feedback:</strong></p>\n\n<p><strong>What Works:</strong> </p>\n<p>- Player movement is smooth and the inclusion of having the player be able to move from one side of the screen to the other is fun.</p>\n<p> - Sound design is hilarious (in a good way) and makes sense with what they are assigned. I'm assuming you did the VA for the player objects? </p>\n<p>- Both player collisions and rock spawn locations/counter is fair and does not feel like one player has an advantage over the other.</p>\n<p> - Actual design of the sprites for the background and player have a consistently great theme of trying to escape hot lava while wearing thermal suits. </p>\n<p>-nice sounds <br/></p>\n<p><strong>What Needs to Be Worked On:</strong></p>\n<p> - When the game starts, there is an odd gray line that appears on the top left near the P1 score (not sure what that is, but is a bit of an odd placement, might just be sprite background issues).</p>\n<p> - If P2 reaches a score of double digits (especially in the negatives), the score goes a bit off the frame/viewport (just need to slightly adjust its position to the left).</p>\n<p> - If one player dies and the other one keeps getting higher to the point of leaving the frame, for some reason the camera does not follow them (not sure if that is intentional)? </p>\n<p>- I would love to see the rocks be destroyed or \"melted\" if they touch the lava instead of just have the rock object overlapping it.</p>\n\n<p>-camera sometimes snaps instantly when one player dies even when both players are alive the camera sometimes moves really fast between them which is disorienting </p>\n<p>- the players move really fast and are kinda hard to control (not necessarily a bad thing if thats what you're going for)</p>", "metacritic": null, "released": "2021-03-29", "tba": false, "updated": "2021-04-12T14:07:38", "background_image": "https://media.rawg.io/media/screenshots/1d7/1d73866c4192a1db13829beeecb3d44c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 95, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["roccowu"], "genres": [], "publishers": [], "esrb_rating": null}