{"id": 58147, "slug": "cow-land", "name": "Cow Land", "name_original": "Cow Land", "description": "Welcome to Cow Land! Help Old Cornell, Little Amy and Uncle Farrokh discover what‘s happening in their farms... The clouds went dark and cows started fallingfrom the sky... Save all the cows!<br/><br/>Complete everylevels while you explore all of Cow Land‘s sites... <br/><br/>Game Features<br/><br/>- SIMPLE &amp; ADDICTIVE game. Tap the cows to save them!<br/>- 3 modes! NORMAL, CRAZY and INSANE. Will give you hours and hours of play game.<br/>- Lots of MISSIONS to complete while delving into adventure and... the DAILY QUEST.<br/>- A complete story narrated by the three main characters in a comic style and divided in... three acts?<br/>- A long adventure lots of play hours, with more than 200 LEVELS and more than 20 ACHIEVEMENTS.<br/>- Help repair and UPGRADE the main characters‘ farms and get more coins and special items.<br/>- Visit Desert Rock's shop where you will find SPECIAL ITEMS you can use in your adventure... <br/>- Get to the TOP of the COW LAND LEADERBOARD by saving cows...<br/><br/><br/>Special Items<br/><br/>- Cow Runes: It will save the cows you can't save.<br/>- Time Potion: When you use it, time slows down for a few seconds. <br/>- Energy Grenade: Use it to save everyone around you.<br/>- Leather Gloves: TNT barrels won't  hurt you.<br/>- Lucky Amulet: You will have a higher probabilty of finding coins.<br/><br/>and more...<br/><br/><br/>Cow Land is a FREE app game. The game also contains ads or optional in-app purchases to get in-game coins.<br/><br/>Discover more details on Cow Land and its characters here:<br/>- Facebook: https://www.facebook.com/Cow-Land-369667053443984/<br/>- Instagram: https://www.instagram.com/cowland_app/<br/><br/>If you have any question, please contact us here:<br/>contact@seishorasgames.com<br/><br/><br/>Thanks for playing.", "metacritic": null, "released": "2018-03-15", "tba": false, "updated": "2019-10-22T14:00:38", "background_image": "https://media.rawg.io/media/screenshots/af9/af95331d12dee0deb0ef89bacb98020b.jpg", "website": "https://www.youtube.com/watch?v=hOvpcxgRYRI", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 140, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Pedro Jose Torres Trivino"], "genres": ["Adventure", "Arcade"], "publishers": ["Pedro Jose Torres Trivino"], "esrb_rating": "Everyone 10+"}