{"id": 58148, "slug": "infinite-defense-survival", "name": "Infinite Defense-Survival", "name_original": "Infinite Defense-Survival", "description": "In Infinite Defense, you will control different heroes in shooting battles. Accomplish missions, take down the other team. Step on the battlefield, and create your brilliant career.<br/><br/>Game Features<br/><br/>Free to play, fair to win<br/>You can obtain every contain in the game from battles, including the heros, skins, actives. No compulsory pay.<br/><br/>Diverse contents,never same game.<br/>There are so many components effect on the final result.You can play as different heroes in different maps with different missions. For new or old players, there's always something new to discover. <br/><br/>Break tradition, choose your way <br/>Playing Solo or Co-op with your friends. Whichever, you can enjoy a highly competitive, fast paced game. Unlike traditional shooting, each map has a different strategic goal, two teams fight against with different ideas. There is no limitations on you, you can express your own style.<br/><br/>Custom battle, custom play<br/>You can also try the custom mode. Choose your map and the lineup to get a pleasure for you only. In addition to this, you can also define the position of your buttons to find the most suitable sense of your own.<br/><br/>Wonderful update, continuous update<br/>More heroes, maps and modes are developing. Which will come to you with regular updates later. The game is alive and is growing up with you.", "metacritic": null, "released": "2017-12-22", "tba": false, "updated": "2019-10-22T14:06:25", "background_image": "https://media.rawg.io/media/screenshots/0a0/0a059875d761ef94a8a9dae75edc38dd.jpg", "website": "https://www.facebook.com/ID.HalcyonNetwork/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 315, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["BEIJING HALCYON NETWORK TECHNOLOGY CO"], "genres": ["Action", "RPG"], "publishers": ["BEIJING HALCYON NETWORK TECHNOLOGY CO"], "esrb_rating": null}