{"id": 58149, "slug": "joindispatch", "name": "JoinDispatch", "name_original": "JoinDispatch", "description": "*Note from the Team* <br/>We want to give you a chance to try out the gameplay style so you can be sure it's something you're into before paying for the game. For that reason we've made it free to download.  You'll experience a short manager training and a replayable trial call - approx 5-10 minutes of play.  Then you'll be presented with a single in-app purchase for 99 cents to unlock the rest of the game.  There are no other purchases, ads, or microtransactions. That is the only purchase and it unlocks the complete experience - approximately 1.5-3 hours of gameplay per play through depending on your choices and reading speed. The game has a high replayability as we've randomized the events and tried hard to always make your choices have direct effects on the calls story lines as well as hiding various lore and scenarios deeper within.  We realize we failed the community with how we presented the pricing of the game and never meant to confuse anyone.  We're sorry to have not met your expectations and will always try our best to be totally transparent with our players and the mobile gaming community.<br/>Thank you!<br/>*End Note*<br/><br/>SpectreVision Presents JoinDispatch.<br/><br/>It's your first day on the job...<br/><br/>The state-run emergency dispatch systems have all become sluggish and bogged down.  Privatized, CrowdSourced Dispatch response is now the wave of the present, with JoinDispatch leading the pack thanks to their Rapid Response Server.  Anyone can join up and start a shift from their phone or JoinDispatch Home Terminal.  It's your first day and you'll be working closely with your manager to make sure you're on track to earn stars - and save lives of course.<br/><br/>However, perhaps there's a bit more afoot than it would seem.<br/><br/><br/>Some recent employees have reported strange caller interactions and even direct evidence of attempted hacks into the JoinDispatch OS. Though no one is quite certain why this is occurring, we can assure you - everything's fine and secure. <br/><br/>The systems are functioning at 100% efficiency. <br/><br/><br/>JoinDispatch is an opportunity for you to engage and assist a collection of characters through thrilling real-time conversations with a collection of characters calling in for emergency help.<br/>How will you handle the father with a bleeding child, thanks to a foolish and preventable slide n' slip injury?<br/>Will you send a fire truck to assist the poor soul whose cell phone burst into flames while he slept? Or will you convince him of his inner strength and get him to fight the fire himself?<br/>Will you CHHOOOOOOS <br/><br/>ERROR 612-11. <br/><br/>OBFUSCATED STRING DETECTED.  <br/><br/>NEW STRING ACCEPTED. <br/><br/>FORMATTING: 100%.<br/><br/>STRING DISPLAY:<br/>HELP US. FIND CALLER 771-07. FIND JENSEN. <br/><br/><br/><br/>Features:<br/><br/>-Strive to achieve a coveted 5-Star rating.  <br/><br/>-Earn skills that will help you meet your goals and unlock new opportunities and characters.<br/><br/>-Protect and Conserve:  use your resources wisely, they are highly limited.<br/><br/>-Rewind Time Itself: Only the JoinDispatch system offers you our patented rewind function, allowing you to undo that last mistake.<br/><br/>-Simplified decisions and seamless navigation will have you clicking your way to great success.<br/><br/>-Play again and again. Your choices will carve a new path through each shift each time you play.<br/><br/>-Uncover all the mysteries... if there are any... but there's probably not, because it's all totally normal!<br/><br/>-Featuring Original Music by Kreng.<br/><br/>-A throwback to the text-based adventure games of yesteryear.<br/><br/>Presented by SpectreVision, JoinDispatch is a text-based adventure game written by Kyle McCullough &amp; Suki-Rose Simakis. Developed by Kyle McCullough. Original Music by Kreng.", "metacritic": null, "released": "2018-04-01", "tba": false, "updated": "2019-10-22T14:30:59", "background_image": "https://media.rawg.io/media/screenshots/90e/90ecff461a6811dca4b831fad760c66e.jpg", "website": "http://www.joindispatch.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 65, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Kyle McCullough"], "genres": ["Adventure", "Simulation"], "publishers": ["Kyle McCullough"], "esrb_rating": "Teen"}