{"id": 581664, "slug": "make-your-choice", "name": "Make Your Choice", "name_original": "Make Your Choice", "description": "<p>            Добро пожаловать в «Make your choice»!\r\n  </p>\n<p>            Вы — маленькая, но очень упорная игрушка, которая хочет вырваться из стен странной огромной комнаты. Для этого нужно пройти несколько уровней, в каждом из которых необходимо всего-то выбрать одну из кнопок (синюю или красную) и нажать на нее. Но будьте осторожны! Каждое ваше решение будет влиять на вас в дальнейшем, помогая, или, наоборот, препятствуя прохождению следующего уровня.</p>\n<p>Правила.</p>\n<p>            На каждом уровне есть 2 кнопки — синяя и красная. Для прохождения уровня необходимо добраться при помощи блоков «лего» до нужной вам кнопки и нажать на нее. Как это сделать?\r\n  </p>\n<ul><li>Для перемещения персонажа используйте «W», «A», «S», «D» или стрелки;\r\n  </li><li>Чтобы смотреть по сторонам, перемещайте мышку;\r\n  </li><li>Чтобы прыгнуть, нажмите пробел;\r\n  </li><li>Чтобы взять блок «лего», подойдите к нему (выделится контур блока) и нажмите «E»;\r\n  </li><li>Чтобы бросить блок в любом месте, нажмите левую кнопку мыши(ЛКМ);\r\n  </li><li>Вместе с блоком дойдите до построенного пути и подойдите к месту, куда надо поставить блок. Игра предложит вам варианты размещения. Выберите нужный и нажмите левую кнопку мыши(ЛКМ);\r\n  </li><li>Чтобы повернуть блок при размещении, используйте колесико мыши;\r\n  </li><li>Путь должен начинаться с белого блока, такие базовые блоки уже ждут вас на каждом уровне;\r\n  </li><li>На каждый блок можно поставить сверху только один блок.</li></ul>\n<p> Одна из кнопок всегда кажется доступнее и привлекательнее, но будьте внимательны, так как каждая из них имеет положительный или отрицательный эффект для следующего уровня. Кто знает, может в доме выключится свет, и вы будете собирать следующий путь при свете маленького фонарика, либо же вы научитесь летать и сможете нажать на кнопку без построения пути…  Выбирайте на свой страх и риск. Удачи!</p>\n<p>===========================================================</p>\n<p>            Welcome to the “Make your choice”!\r\n  </p>\n<p>            You are small, but very tenacious toy, that wants to escape from strange huge room. To do this you should complete several levels and in every level it is necessary to just choose one of the buttons(blue or red) and press on it. But be carefully! Every your decision will affect you in the future, helping or conversely preventing next level’s passing.</p>\n<p>Rules.\r\n  </p>\n<p>            Every level has 2 buttons – blue and red. To complete level it is necessary to reach one of the buttons, using “lego” blocks, and press on it. Who should you do it?\r\n  </p>\n<ul><li>To move character use “W”, “A”, “S”, “D” or arrows;\r\n  </li><li>To watch on sides move mouse;\r\n  </li><li>To jump press space;\r\n  </li><li>To take “lego” block approach it(you will see contour of the block) and press “E”;\r\n  </li><li>To throw block on random place press left mouse button(LBM);\r\n  </li><li>Transfer block to your path and come to place where you want to put block. Game shows you variants of placement. Choose necessary one and press left button on mouse(LBM);\r\n  </li><li>To rotate block while during placement use mouse wheel;\r\n  </li><li>Path must start from white block. It’s already waiting for you on every level;\r\n  </li><li>On every block it is possible to put just one block.</li></ul>\n<p>One of the buttons always seems more attractive and available than another, but be careful, because every of them has positive or negative affect on next level. Who knows, maybe electricity will turn off and you will build next path with just small lamp or you will be able to fly and you will can press every button without any blocks… Choose at your own risk. Good luck!</p>", "metacritic": null, "released": "2021-04-12", "tba": false, "updated": "2021-04-12T15:20:47", "background_image": "https://media.rawg.io/media/screenshots/5b2/5b22d3f967371902a5b105fff52b2fdc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 36, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["vika98z"], "genres": [], "publishers": [], "esrb_rating": null}