{"id": 581654, "slug": "cancer-immunology-game", "name": "Cancer Immunology Game", "name_original": "Cancer Immunology Game", "description": "<p> </p>\n<p>Take control of a cancer-fighting T killer cell inside the body and learn: what mechanisms tumour cell use to cause harm and remain undetected from your immune system; how your body defends itself from such malignancies; what benefit can immunotherapies provide in this eternal battle.</p>\n<p>The demo is uploaded in a lower quality on the browser build to accommodate a better gameplay experience. Please leave any feedback on what you would like to see in the final game and page itself. Leave a comment or sign the survey provided in the game or by going directly to the survey! </p>\n<p>We would like to thank the Wellcome-Trust for the ISSF3 Grant that enabled us to develop this game, along with thanks to Cardiff University, the GW4 Biomed DTP and Cancer Research Wales.</p>\n\n<p>Better builds available for download below.</p>\n<ul><li>PC -&gt; no specific requirements</li><li>MacOS -&gt; need to call -chmod from terminal to give rights</li><li>Linux -&gt; wildcard (no where to test it)</li></ul>\n\r\n Developed by: \r\n<ul><li>Lorenzo Capitani (Research background on the topic)</li><li>Boyan Yotov (Programming)</li><li>Alex Mitev (Art)</li></ul>\r\n Credits to: \r\n<p>Eric Matyas - Background Music (soungimage.org)</p>\n\r\n Update List \r\nApril \r\n<p> Added new enemies cancer-associated fibroblast, killer cell behaviour tree AI, switch to Unity 2020LTS, rendering pipeline switch to URP with 2D Renderer. New level a.k.a the next level i.e. level 2.</p>\r\nFebruary \r\n<p> Added background music and royalty-free non-matching sounds :). Update of the player UI and combat mechanics. Cardiovascular system travelling. Cellpedia for the open book exams a.k.a the microscope. Pathfinding in prep for AI. \r\n</p>\r\nDecember \r\n<p> Added cancer cell division. Reworked the game flow. Implemented storytelling/tutorials to guide the player through the learning experience. </p>", "metacritic": null, "released": "2021-04-12", "tba": false, "updated": "2021-04-12T15:18:27", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Web"], "developers": ["wolfstrasz"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}