{"id": 581688, "slug": "doctor-poo-an-adventure-in-time-and-space-modified", "name": "Doctor Poo: An Adventure in Time and Space (Modified Edition)", "name_original": "Doctor Poo: An Adventure in Time and Space (Modified Edition)", "description": "<p>(Now with minor bug improvements)</p>\n<p>1) You begin in present day America (2021), only to find that it's in ruin. There, you meet the President of the USA, and she explains that a piece of modern warfare has mysteriously found itself in the middle of the Revolutionary War (1781). If gone uncorrected, this time anomaly will result  in King George  using the weapon during the Battle of Yorktown, which is the battle in which the rebels turned the tide of the war.\r\n</p>\n<p>2) You find yourself in the TURDIS, your time ship. You have three options to choose from after calculating the correct coordinates for 1781 (just a few weeks before the Battle of Yorktown) into the ship's console unit. You may either travel to George Washington's base of operation, to France to speak with Thomas Jefferson, or to Great Britain, in King George's royal throne room\r\n</p>\n<p>3) Using the TURDIS to travel to George Washington's base of operations, you meet George Washington and Alexander Hamilton, who  both confirm that King George does have a weapon that is \"out of this world\",  and it is up to you to retrieve it. You learn that the weapon was stolen by the British in France,  as they robbed it off of Thomas Jefferson. George Washington reveals that in retaliation, his spies were able to retrieve some kind of key. He gives it to you.\r\n</p>\n<p>4) Using the TURDIS to travel to King George's throne room,  you run across a guard who is blocking the path to the weapon, He mentions that he may be willing to turn a blind eye if properly compensated. \r\n</p>\n<p>5) Using the TURDIS to travel to France, you find yourself in Thomas Jefferson's living quarters, where he is spending time with Lafayette,  and American ally. Here, Jefferson mentions that the mysterious weapon appeared out of nowhere, and before he was able to promptly analyze it, it was stolen by King George. In hopes of persuading you to help him retrieve the weapon, he offers you money. In the basement you may find the Time Vortex, a tear in the fabric of reality. Before traveling through the vortex however, you must retrieve the weapon.\r\n</p>\n<p>6) Upon returning to the Royal Throne room, you are able to pay the guard for his silence using the money that Thomas Jefferson gave you. As you walk down the hallway, you find the weapon secured under lock and key. Here you will use the key that George Washington gave you (YOU WILL NOT BE ABLE TO RETRIEVE THE WEAPON WITHOUT FIRST OBTAINING THE KEY). Now you have the weapon and may return to the Time Vortex.\r\n</p>\n<p>7) After returning to the Time Vortex in Thomas Jefferson's basement, you are immediately transported to the fixed timeline. It is here you notice that you are in the American military base from which the weapon was first lost. In the main room, you find the President awaiting your return, alongside your TURDIS. She congratulates you and affirms that you have indeed set history back on track by recovering the weapon. The game is now over.\r\n</p>\n<p>I created the interior of the TURDIS first, and it's meant to be from a birds-eye point of view.  I tried to stay as accurate to the show as I could, despite making an 8-bit game, and I believe it turned out wonderfully. The border is made of up tiny TARDIS's (or TURDs, if you will) to symbolize that the timeship is \"bigger on the inside\",  just as it is in the show. In the middle we have the iconic center console, (again from the perspective of the bird's eye point of view), and in the center is meant to represent the spinning cylinder from the show.  Each room has little speech bubbles to indicate your character (Doctor Poo) speaking aloud to himself, thus giving you expositional clues that the sprites are unable to provide.\r\n</p>\n<p>The \"Present Day 2021 in Distress\" was possibly the most fun for me to create, I used a series of sprites that distort in some areas to represent fire, as well as using wiggly lines to represent smoke. If you approach the President a subsequent time after your initial encounter, she will urge you to stop wasting time and to fix the timeline.\r\n</p>\n<p>The Royal Throne room was quite fun to design as well, as I incorporated not one but two lock and key exits/entrances. The first with the prison guard, who is programmed to let you move around him after bribing him some money. The second of course is when actually procuring the weapon itself. I added King George on the second floor, for contextual purposes as well as just for fun.  (Each room has at least one spare character that I included for this exact purpose. ie, Alexander Hamilton, King George, and Lafayette. (I'm a  big fan of the show Hamilton, if I haven't made myself obnoxiously clear by now- I even saw the live show in Oklahoma City back in 2019)\r\n</p>\n<p>George Washington's base of operations was a fun room to create, as it was the first room I began designing with moving tiles. It's nothing too complex, just an open grassy field with a couple of buildings made up of multiple sprites.  Here we meet Alexander Hamilton, George Washington (who gives you the key), and an unnamed soldier. If you walk up to Washington a second time after your first conversation, he pleads with you to use the key with care.\r\n</p>\n<p>Thomas Jefferson's living space is made up of four different levels. The top one is where he resides, and this is where he grants you some money that you will later use for the guard. Then you have the main level in which you first arrive, then the lower level where you meet Lafayette, and finally the basement, where you come across the crack in space and time. This is where the weapon first appeared, and it is where you will make your escape after obtaining it.\r\n</p>\n<p>The time vortex transports you to the final room in the game- the military base. Here you meet the President once again who congratulates you. Once you step into your TURDIS, the game is over.\r\n</p>", "metacritic": null, "released": "2021-04-12", "tba": false, "updated": "2021-04-12T15:26:03", "background_image": "https://media.rawg.io/media/screenshots/83a/83a2098c2b0af15349f8ce4333d5cb01.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ivan.Valeveski"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}