{"id": 581605, "slug": "pizza-portal-lelart", "name": "Pizza Portal (LELART)", "name_original": "Pizza Portal (LELART)", "description": "<p><strong>PIZZA PORTAL</strong></p>\n<p>Have you ever had the opportunity to deliver pizza to the elusive cryptid Big Foot? No? Would you like the chance to you? Pizza Portal employers pride themselves in providing an exciting and stable job opportunity that serves the community while strengthening relationships between workers and citizens of this city. At this job, you will work with your coworkers to provide and deliver pizzas to Pizza Portal customers, which may or may not happen to be a variety of monsters and creatures.\r\n  </p>\n<p>Explore the characters of this town by playing the visual novel Pizza Portal, an interactive text-based story with narrative style storytelling aided by static or sprite-based visuals. This game acts as an interactive comic the player is thrown into to deal with awkward situations they are unfamiliar with. In Pizza Portal, you will play as a new hire who has arrived for their first day as a pizza delivery driver for Pizza Portal, the pizza shop of this town. You make a bet with a new coworker that you will get a certain number of tips which you can only achieve by choosing the correct dialogue options in every customer interaction. \r\n</p>\n<p>So, the ultimate question stands. Do you play this game? That depends. Do you want to know how much pizza dragons normally order? If Moth man likes your monster jokes? Can ghosts pay for food? Would zombies be meat lover pizza fans? If so, this game is the game for you! \r\n</p>\n<p>*Pizza Portal is not responsible for any harm that comes to employees when interacting with customers. This is acknowledged in the application for employment.\r\n</p>", "metacritic": null, "released": "2021-03-29", "tba": false, "updated": "2021-04-12T15:06:09", "background_image": "https://media.rawg.io/media/screenshots/39f/39f81a8be40a8bc1254c82963059c996.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 142, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["LELART"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}