{"id": 581721, "slug": "t-minus-15", "name": "T-Minus 15", "name_original": "T-Minus 15", "description": "<p>SPOILERS BELOW!</p>\n<p>If you have completed the game, feel free to read below for explanations for each room and the overall design of the game.</p>\n<p>______________________</p>\n<p>Rooms Created:</p>\n<p>1) Room 1 - Test Site: Los Alamos, NM in 1941 - Establishes location and timeframe and throws the player into an environment where context tells them of the situation they are in.</p>\n<p>2) Room 2 - Test Site Bunker: Reinforces location and severity of where the player has landed.  </p>\n<p>3) Room 3 - Hazmat Laboratory: Tells the player they are being taken in under precautions due to irradiated areas.  </p>\n<p>4) Room 4 - Brass' Office: Climax, displays the symbiotic relationship between US Gov and the player for knowledge.  </p>\n<p>5) Room 5 - Test Site Bunker: Revisits original bunker but has a change of design due to the player commencing time travel. Resolution &amp; Dissolution, tying in historical events to fictional events in-game.  </p>\n<p>6) Alt Room - Closet: Expository, and gives the player more information regarding their location and time-frame.  </p>\n\n<p>I utilized Scott McCloud's concept of Timeframes, where I visualized \"time as a rope. Each inch represents a second... portraying time on a line moving left to right, putting all the images on the same vertical axis\" (McCloud 96-97).  The structure of the game in room transitions reads like a book would, or a \"rope\"; for example, the transition between the hazmat room and the brass' office goes from left to right - exemplifying this concept.  This causes an easier grasp for the player to immerse themselves in the story, rather than having to focus on plot structure.  </p>\n\n<p>The lessons used from the theme park readings/videos were utilized in building an immersive world narratively.  There's multiple objects that can be interacted with to give more information to the player about the location and timeframe of the game.  Additionally, building sets and rooms where their purpose can be easily identified is imperative to player retention.  When a player has to spend cognitive effort and time processing what they are even seeing, it detracts from the narrative.  </p>\n\n<p>Bitsy's 2D aspect allowed me to design the game with a top-down perspective, which made for an exciting set design.  The overall simplicity of the platform made for an easy experience in telling an interactive historical fiction narrative of the Manhattan Project in 1941. </p>", "metacritic": null, "released": "2021-04-12", "tba": false, "updated": "2021-04-12T15:33:11", "background_image": "https://media.rawg.io/media/screenshots/3c3/3c372f7e05b7a0fa27accd9e5a80f88d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 6, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["cadthomp"], "genres": [], "publishers": [], "esrb_rating": null}