{"id": 581827, "slug": "a-100-totally-accurate-depiction-of-the-red-scare", "name": "A 100% Totally Accurate Depiction of the Red Scare", "name_original": "A 100% Totally Accurate Depiction of the Red Scare", "description": "<p>1. You are a consumer of time travel for sale. After finding a broken Time Pod, you come across an enticing offer from a sketchy looking man by a broken wall.</p>\n<p>2. You find a hidden room covered in police tape. You discover the real intentions behind the sketchy man’s offer and accept to test his pod.\r\n</p>\n<p>3. You warp into an alley in the 1950s, surrounded by reminders of the Cold war and potential nuclear warfare, but you notice something is off when you see the robots.\r\n</p>\n<p>4. You enter a diner, and after helping out the lone waitress, you are betrayed.\r\n</p>\n<p>5A. You wake up in a lab and you must escape or risk being turned into a robot.\r\n</p>\n<p>5B. You must work your way through a maze of robot parts and piles of junk to get the key to the first part of the lab and escape.\r\n</p>\n<p>6. You escape only to find yourself surrounded by robots and barely warp out unharmed.\r\n</p>\n<p>7. You find yourself back in the hidden room, begrudgingly admitting you enjoyed yourself despite the danger.\r\n</p>\n<p>In Understanding Comics, Scott McCloud describes the simplicity and abstraction of a cartoon as “an empty shell that we inhabit which enables us to travel to another realm” (pg 36). For this project, I used that definition of abstraction to create simplistic characters and sprites that the player could then project themselves onto and feel as if they were really part of this world I created. He also calls words “the ultimate abstraction” (pg 47), so I made sure to use dialogue when an image required more detail than I could represent with Bitsy, such as the poster the player finds outside the diner. \r\n</p>\n<p>For transitions such as walking into the hidden room in the store, entering the diner, and making the escape from the lab, I used what McCloud describes as action-to-action transitions (pg 70). These transitions, like McCloud describes, follow a single subject, the player, from action to action as the player moves through the story. The spatial transition from the hidden room to outside the diner, however, would be more of a scene-to scene transition (pg 71). Since that scene transports the player across a significant distance of time and space, I used the scene-to scene transition along with a color palette change to represent such a huge change.\r\n</p>\n<p>In order to represent the time frame, I used McCloud’s analogy of a rope winding through each panel, or in this case, room (pg 96). As the player follows the imaginary path of the rope, time passes with each conversation and action.\r\n</p>\n<p>Although the title of this game claims otherwise, this story is not a completely accurate representation of life in the 1950s. It is actually more about the way fear controlled people during the Red Scare. When considering ideas for the theme of this story, I thought back to one of the lessons about theme in Imagineering in a Box. According to the Imagineers, the theme was an idea that held the story together. I used this idea within all of the characters, from the little girl practicing for seemingly inevitable nuclear warfare to the frightened waitress who turns you in for “sympathizing with the enemy”. Knowing my theme of fear and its tight control of the people at the time allowed me to use the player character as a foil for the time represented. The player character is bold and finds the fear driven decisions ridiculous and strange. \r\n</p>\n<p>Another lesson I used in the making of this game was from the Game Maker’s Toolkit video. In that video, the speaker references a game developer, Emilia Schatz, who discusses game environments and their emotional impact. I used this idea throughout the game as I designed the many environments, but I really focused on this lesson in the escape from the lab. I surrounded the player in robots, creating a tight, cramped area for the player to work in. This created a panicked response as the player has to figure out how to get away from the many enemies.</p>", "metacritic": null, "released": "2021-04-11", "tba": false, "updated": "2021-04-12T16:00:00", "background_image": "https://media.rawg.io/media/screenshots/5e2/5e2554d3ad436919609bd05b33cdb39a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 3, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["veryrealname"], "genres": [], "publishers": [], "esrb_rating": null}