{"id": 581987, "slug": "tracks-of-war", "name": "Tracks Of War", "name_original": "Tracks Of War", "description": "<p>First of all, the game is FREE. But any contributions to support the developer are welcome.<br/><br/>This game is inspired by the classic and famous game for NES - BATTLE CITY (1985). I loved it much (especially the bugged version with super strong tanks firing from the tail but not from the gun itself...) and wanted to build smth like that many times for many years. And this time has come, finally!</p>\n<p> Though it’s neither the same game or the mindless copy of it, it still pays my respect and rises the spirit of nostalgy for the everlasting past, for the missing 80-s and 90-s. When the grass was greener and the trees were taller and the people were... You should know that... You MUST! \\m/</p>\n<p> Well, anyway. This is my 1st 2D game dev experience, everything is built from the scratch, and there is a plenty of room for improvements. Many ideas came to my mind, many desires of what to do, to add, to implement during the development process... But many were left behind or postponed. For now... I wish I had 72 hours in a day and a couple of clones to bring all of those ideas and more to life! But those things are yet to come...</p>\n<p> You are welcome to play my game and share your thoughts and feedback with me. You are welcome to contribute to this game and support the development of the current or upcoming releases and future games. Also you are welcome to listen my music (for this game or other compositions). Who knows, maybe you are on the same sound wave as me. Or me on your wave!..</p>\n<p>   With regards, Oleg <knight rider=\"\"> Tolmachev.</knight></p>", "metacritic": null, "released": "2021-04-11", "tba": false, "updated": "2021-04-12T16:38:54", "background_image": "https://media.rawg.io/media/screenshots/f70/f70c2f48b39e70b2405c505bfce30e09.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 107, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Oleg T."], "genres": [], "publishers": [], "esrb_rating": null}