{"id": 582156, "slug": "le-lac-des-cils", "name": "Le Lac des Cils", "name_original": "Le Lac des Cils", "description": "<strong>[DISCLAIMER : la version V5 visible sur la page web a été débuguée après 17h. Pour les dernières uploadées avant la limite, voir la V2 pour le niveau 1, et V4 pour le niveau 2, disponibles en téléchargement en bas de la page]</strong>\r\nDESCRIPTION\r\n<p><strong><em>Jean-Baptiste Grenouille est un parfumeur de génie. Il peut créer le parfum idéal d'une personne avant même de la rencontrer.  Il met Dracula, Marcel Proust et Cyrano de Bergerac au défi de trouver d'identifier les arômes contenus dans leur fragrance.</em></strong><br/></p>\n<p>Bienvenue au lac des cils : le mucus qui tapisse votre épithélium olfactif au fin fond de votre cavité nasale. Dans ce jeu d'arcade, vous incarnez une protéine de transport. Votre mission est d'apporter les molécules odorantes qui entrent dans le mucus jusqu'aux récepteurs adéquats situés sur les cils olfactifs.</p>\r\nCONTRÔLES\r\nGAUCHE-DROITE-BAS<br/>Déplacer la moléculeESPACEPivoter la moléculeR<br/>Recommencer le niveauECHAPMenu\r\nLA THÈSE\r\n<p>Les jeux créés lors d'une Scientific Game Jam s'appuient sur une thèse doctorale. <br/></p>\n<p>Maëlle Moranges est en doctorat au Centre de Recherche en Neurosciences de Lyon. Son sujet de recherche à la croisée des neurosciences cognitive et de l'intelligence artificielle, s'intitule<em> \"Variabilité émotionnelle et variabilité neurophysiologique dans la perception olfactive : étude par l'intelligence artificielle\"</em>.</p>\n<p>\n</p>\r\nCrédits\r\n<p>Jeu réalisé lors de la Scientific Game Jam Lyon 2021, lors du festival La Science Entre En Jeu du 09 au 14 avril </p>\n<p>Doctorante : Maëlle Moranges<br/>Game Designer : Marlene Ason <br/>Développeur : Alexandre Buzon\r\n<br/>Graphiste : Solenne Marty<br/>Sound Designer : Nathan Chambrette<br/></p>\n<p>Le schéma de l'olfaction a été créé par Arnaud Fournel. Il est adapté et partagé ici sous licence CC-BY-NC-SA. <br/></p>\n<p>Le Lac des Cils est sous licence Creative Commons CC-BY-ND-ND.</p>\n<p>Merci à Lyon Game Dev pour l'organisation.</p>", "metacritic": null, "released": "2021-04-11", "tba": false, "updated": "2021-04-12T17:23:29", "background_image": "https://media.rawg.io/media/screenshots/d5c/d5c0e0d71d89ddd928d057ca11602942.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 53, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Marlynastre"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}