{"id": 582363, "slug": "checkpoints-une-soiree-a-nicosie", "name": "Checkpoints - Une soirée à Nicosie", "name_original": "Checkpoints - Une soirée à Nicosie", "description": "<p><em><strong>Fait pendant la Scientific Game Jam d'avril 2021 !</strong></em></p>\n\n<p><em><strong>Checkpoints, une soirée à Nicosie</strong></em> est une mini-aventure narrative qui place les joueurs et joueuses dans la peau d’une touriste française qui veut simplement prendre un verre entre amis dans la partie nord du centre historique de Nicosie. Mais cette quête, simple en apparence, amène le personnage à se confronter aux réalités du passage d’une frontière aussi complexe. Nous avons voulu confronter les joueur.se.s à cette expérience particulière à travers trois éléments.</p>\n<p><strong>L’exploration d'abord.</strong> Elle joue un rôle important pour que les joueur.se.s fasse l’expérience d’une mobilité fortement impactée par l’existence de la Ligne Verte. Sur une carte restreinte, qui reprend le tracé réel des rues de la vieille ville de Nicosie, le parcours des joueur.se.s va et vient entre les éléments nécessaires pour accomplir sa quête.\r\n</p>\n<p><strong>Les dialogues ensuite.</strong> C’est à travers des discussions avec les PNJs que les joueur.se.s pourra, à son rythme, découvrir la réalité du conflit à Chypre et des conséquences de la Ligne Verte sur les Chypriotes.\r\n</p>\n<p><strong>Enfin, un système de quête.</strong> Avec ce système, on compte mettre les joueur.se.s face à la découverte de nouvelles informations et au côté inhabituel des éléments nécessaires pour simplement prendre un verre à quelques centaines de mètres de chez soi.</p>\n<p><strong>Contrôles </strong> : </p>\n<p>Souris ou barre espace pour valider le texte</p>\n<p>Flèches pour se déplacer<br/><br/></p>", "metacritic": null, "released": "2021-04-10", "tba": false, "updated": "2021-04-12T18:14:48", "background_image": "https://media.rawg.io/media/screenshots/342/342d1eff7e2401c42b9a6007153d8bf0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 10, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["matote", "Roilbauk", "Drestin", "Barbiche", "Lehomar2vinci"], "genres": [], "publishers": [], "esrb_rating": null}