{"id": 58232, "slug": "ninja-striker", "name": "Ninja Striker!", "name_original": "Ninja Striker!", "description": "If you want quickfire combos and fast-paced retro action, Ninja Striker is the game for you!<br/>\n<br/>\r\nNinja Striker takes visuals and music inspired by the 8-bit era and fires them up with modern touches. Heavily stylised around Japanese themes, your goal is to advance forward with as much speed, flair and combo power as possible. You have double jumps, homing attacks and a special ‘Shinobi Action’ at your disposal; only by mastering each with sharp reflexes will you make it through your quest!<br/>\n<br/>\r\nYou can choose between four characters, each with different abilities, and dash through a range of stages and Boss encounters. Each character changes up the way you play, meaning there’s a lot of fun to be had in battling through the campaign with each warrior. <br/>\n<br/>\r\nNinja – This deadly fighter has a Spinning Slash attack and ‘Storm Attack’ special.<br/>\r\nKunoichi – She carries plenty of threat and should not be underestimated, with a Spinning Shot attack and ‘Kunai’ special.<br/>\r\nChain Sickle – This mysterious fighter’s unique style gives him incredible range, with a Chain Attack and ‘Sickle Slash’ special.<br/>\r\nRobot Ninja – Slower than his human counterpart but with more health points and the ability to boost through stages, this metallic warrior has a Drill attack and ‘Hammer Attack’ special.<br/>\n<br/>\r\nWith catchy music, varied locations and increasingly dangerous foes, Ninja Striker will keep you coming back for ‘one more try’. Boost and fight your way through for the highest combos, with maximum rankings of three stars per stage reserved for the most skilled of players!<br/>\n<br/>\r\nAre you up for the challenge in Ninja Striker?", "metacritic": null, "released": "2018-04-18", "tba": false, "updated": "2019-08-28T21:59:34", "background_image": "https://media.rawg.io/media/screenshots/d7c/d7c3af1f6aba0f29e3e2289949ea333d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 205, "game_series_count": 0, "reviews_count": 0, "platforms": ["Nintendo Switch", "PC"], "developers": ["Q-Cumber Factory"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Flyhigh Works"], "esrb_rating": null}