{"id": 582552, "slug": "not-right", "name": "Not Right", "name_original": "Not Right", "description": "Not Right\r\n<p><strong>Play in Full Screen mode and set Graphics to Medium for better experience.</strong></p>\n<p>A Game made in one week for The Potter's School Spring Game Jam.</p>\n<p>Made for speed running, You must take Flint through 5 rooms to reach the exit and avoid a fiery end. This game fits the theme of <strong>Opposite</strong> as unlike most games of the genre you are <strong>not</strong> heading in the <strong>right</strong> direction, but instead left. Also the experiment in the game  did <strong>not</strong> go <strong>right</strong>. Instead of containing lava inside a person (read story below), the <strong>opposite</strong> happened and it took over their lab.</p>\r\nSpeed Run Leaderboard:\r\n<p>(Comment with you best Speed Run of this Game. Include a Screen shot for proof. Note: 120.00 is the default time.)<br/></p>\n<p>1st -  Ijo.: Time:  56. 69 (time sent to me)</p>\n<p>2nd -Shadowstriker; Time: 59 .64 (time sent to me)</p>\n<p>3rd - MigDev; Time: 60 .18</p>\r\nStory: \r\n<p>Researchers were attempting to give beings the ability to control lava. Unfortunately their experiment failed and lava erupted, slowly engulfing the entire lab.  Luckily most, escaped quickly, except for thier test subject, Flint, who is now part lava.</p>\r\nHow to Play:\r\n<p>Use A and D keys or the Left and Right arrow keys to move Flint left and right. </p>\n<p>Use the Space Bar or Up Arrow to Jump. And press twice to Double Jump.</p>\n<p>Thats all, head left as fast as you can, make your way through 5 color coded rooms, avoid spikes and lava and beat the game.</p>\r\nKnown Bugs:\r\n<p>Player randomly does not double Jump.</p>\n<p>Room Count Overlaps Time count when not played in full screen Mode.</p>\r\nCredits:\r\n<p>This Game was Made entirely by me in one week.</p>\n<p>Art by Me.</p>\n<p>Some Sound effects were made from scratch, some from sfxr, and others were obtained from the Wowie Asset Pack by Jonas Tyroller.</p>\n<p>Music was obtained from the Wowie Asset Pack by Jonas Tyroller.</p>", "metacritic": null, "released": "2021-04-10", "tba": false, "updated": "2021-04-12T19:05:26", "background_image": "https://media.rawg.io/media/screenshots/5cb/5cb4c451ba583ffb5afd9d745a605801.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 28, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["MigDev"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}