{"id": 58255, "slug": "rise-of-industry-demo", "name": "Rise of Industry Demo", "name_original": "Rise of Industry Demo", "description": "NOTE: Rise of Industry is still in development. Please only buy the game if you want to support its ongoing development based on what is in the game now – not what might be in the game on release.\nIn Development Update\nWith Rise of Industry we're set on resurrecting the good old industrial tycoon games of the 90s, with modern twists. The game is still under development, and major game-changing updates are constantly rolled out. With your feedback and support we can make this game a real classic of the genre. Made by fans, for fans!\n<br/><br/>\nWe are always adding new features to the game and are currently working hard on the next update for Rise of Industry (Alpha 6). We have listened to community feedback and are implementing big changes to increase the enjoyment of the game.\n<br/><br/>\nDEVELOPER PROMISE: We are extremely active in the community and we will always be open with our plans for the future of the game. However, we need your help to improve the game further – you can do so by visiting our Discord channel. Thank you.\n<br/><br/>\nTake a look at our development roadmap to see what is already in the game and what is planned. \nAbout the game\nRise of Industry is a deep strategic tycoon game which focuses heavily on production and town interaction.  It’s a lot of fun right now, but we need your feedback and ideas to help improve and enhance the game. Feedback already gathered means that we can deliver a very stable build with a host of exciting and enjoyable features.\n<br/><br/>\nAs a budding entrepreneur, you will build factories, construct efficient transport lines, move raw materials, produce finished goods, and arrange trade with the world's developing cities, providing them with the resources they need to flourish - for as they grow and prosper, so do you.\n<br/><br/>\nDesigned with an eye towards both accessibility and depth, Rise of Industry has enough strategic complexity and replayability to satisfy the most experienced fans of the genre, while its simple-to-understand mechanics ensure that new players will love it as well.\nFeaturesExperience tailored for every player - Specialise in just trading, production, gathering or any combination and research your way to bigger and better things.\nUse PR &amp; Marketing to gain favour (or repair damage) with your business partners.\nChoose from over 100 individual products and manage the manufacturing process from harvesting raw materials all the way to delivering the end product to local stores &amp; townspeople\nBuild and manage a solid transportation network to enable the efficient transfer of goods via plentiful trucks, speedy trains and high capacity airships. \nBe prepared for fierce competition – Advanced town and city A.I., make for an intelligent and changing game world so you won’t be the only one looking for the best deal.\nTown personalities – adapt a suitable approach for every town or face their economic backlash.\nHuge, procedurally generated maps mean that you’ll always have room to expand your empire into whether in testing scenarios or sandbox mode where imagination is your only limit.\nBe quick to adapt to the current business climate with contracts, random events and quests keeping you on your toes and cash flowing in.\nBalance environmental impact with productivity, trying to meet your neighbouring town's demands.\nEver-changing biomes will present different environmental challenges as you aim to make the most out of the map - Lose potential oil reserves as polluted tundra melts into fields or fertile grassland wilts and dies into arid desert.\nReady for global domination? Bend and break your friends into economic submission in multiplayer-mode*<br/> *multiplayer mode coming post release", "metacritic": null, "released": null, "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/835/835c3a438b5a497e3a2ec34da2ac7cdf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 29, "dropped": 1}, "playtime": 2, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 184, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "Linux"], "developers": ["Dapper Penguin Studios"], "genres": [], "publishers": ["Kasedo Games"], "esrb_rating": null}