{"id": 58254, "slug": "spellcasting-123", "name": "Spellcasting 1+2+3", "name_original": "Spellcasting 1+2+3", "description": "\nSorcerer University: Dangerously Close to a Real Education<br/>\nSo you want to be a sorcerer, eh? Want to wave that wand of yours in front of beautiful women and watch 'em swoon, don't you?\nWell, you're definitely going to need magic. And Sorcerer University is the place to get it. Sorcerer U. offers everything an apprentice wizard needs to make it big in the real world.\n<br/><br/>\nSocial Clubs. Join the famous Tappa Kegga Bru or I Pheltha Thi fraternities. Make friendships that last the rest of your life, whether you want them to or not. Attend fun-filled frat parties where the brew is cold, but the women aren't.\n<br/><br/>\nInteresting People. Sorcerer University is famous for its friendly and robust student body (quite a few of them, actually) eager to help freshmen find their way around and get most out of those late night cramming sessions.\n<br/><br/>\nField Trips. Visit the most fascinating places in Peloria, from the Island of Horny Women to the Island Where Time Runs Backwards to the Restaurant at the End of the Ocean. No, you can't skip right to the Island of Horny Women.\n<br/><br/>\nIntellectual Challenge. Learn the art of sorcery from the masters themselves. Refine your skills in the Simulation Lab, where you'll challenge a ferocious dragon and rescue an imprisoned damsel. Of course, which skills you choose to refine is entirely up to you.\n<br/><br/>\nAdventure. You've got a mission to accomplish, and it's not some cheapo Find-The-Missing-Magic Sword quest, either. We're talking END OF THE WORLD type-stuff here - and if you blow it, you can forget that frat party next week.\n<br/><br/>\nSorcerers Get All The Girls can be played in either \"naughty\" or \"nice\" mode. With its obvious satirical content, the game is intended for the amusement of adults, or at least those old enough to see an R-rated movie (or sneak into one). It contains language and a general moral attitude that may offend some. It is recommended that these people buy the game, and then hide it from their shelf as a form of protest.\n<br/><br/>\nAward-winning game designer Steve Meretzky's latest graphic adventure contains the same wicked sense of humor, devilish puzzles and bawdy satire found in his other works, notably The Hitchhiker's Guide To The Galaxy,Leather Goddesses of Phobos, Planetfall and Zork Zero.\nSteve profoundly apologizes and promises never to do it again. Honest. \n<br/><br/>\n<br/><br/>\n<br/><br/>\nMore babes. More brewskis. More bad jokes.\n<br/><br/>\nA flash of light... a puff of smoke, and... EUREKA! the perfect woman steps out of The Sorcerer's Appliance. You've just created Eve! (It's only been done once before, and that time it cost the guy a rib).\n<br/><br/>\nReturn to Animal House. It's pledge week at Sorcerer University, and with Eve's magical help, you'll survive a series of ridiculously impossible hazing tasks. But life isn't all dancing bananas, shower rooms and melodious moodhorns; and soon you find yourself in a desperate race to save the University from certain destruction.\n<br/><br/>\nA Tale of High Education and Low Morals. Ernie Eaglebeak is once again the unlikely hero in this hilarious romp through the bedrooms, turrets and tunnels of Sorcerer University and nearby Barmaid U (where grading on a curve takes on a whole different meaning). To pass this course, you'll need to cast ridiculous spells, solve ribald puzzles and \"interact\" with gorgeous women. Any questions? We didn't think so.\n<br/><br/>\nClass dismissed.\n<br/><br/>\nFrom the scandalous imagination of Steve Meretzky, Spellcasting 201 is a sequel to his award-winning hit game, Spellcasting 101: Sorcerers Get All The Girls. Although this game may be played in either \"naughty\" or \"nice\" mode, it may be considered unsuitable for young minds, as it contains material and situations that children have already seen in far greater detail on daytime television..\n<br/><br/>\n<br/><br/>\n<br/><br/>\nFollow the sun and the scent of coconut oil straight to Fort Naughtytail where Ernie Eaglebeak parties hardy with his fraternity pals in this high energy seaside romp. Ernie is hoping to find sand in all the wrong places, but ends up battling a rival fraternity from back home in a series of zany beach contests complete with gorgeous babes, wet T-shirts, mud wrestling and body surfing.\n<br/><br/>\nErnie must use his wits and a healthy dose of magic to save the honor of his fraternity. There's a lot to do, and the Ft. Naughtytail Police Dept. is desperately trying to keep everyone from doing it!", "metacritic": null, "released": "1989-12-31", "tba": false, "updated": "2023-02-08T10:49:18", "background_image": "https://media.rawg.io/media/screenshots/14e/14e8044e7e97fc9d23fcf53c2b78b9a1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 19, "beaten": 2, "toplay": 2, "dropped": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 268, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "Linux", "macOS"], "developers": ["Legend Entertainment"], "genres": [], "publishers": ["Piko Interactive"], "esrb_rating": null}