{"id": 58253, "slug": "solo", "name": "Solo", "name_original": "Solo", "description": "<strong>Solo</strong> is an introspective puzzler set on a gorgeous and surreal archipelago. Reflect on your loving relationships by exploring contemplative, dream-like islands.<br/><br/><br/><br/><br/><br/>Solo is a game about love. About love as fuel, the force that drives us.<br/><br/>It is a universal feeling, but each of us experiences it in a different way. Individually, it holds different meanings depending on a variety of factors such as culture, gender, sexuality or traumas. That's why Solo will explore this theme in an introspective way, to have the players identify and reflect on their own experiences. <br/><br/><br/><br/><br/><br/><ul><li>Reflect on love’s place in your life with a personal and introspective branching narrative.<br/></li><li>Combine blocks with different properties offering multiple solutions for most puzzles.<br/></li><li>Contemplate and explore a living world: take photos of the charming, colorful islands amidst tranquil tunes or play the guitar for cute creatures.</li></ul><br/>The world is divided into archipelagos, and each archipelago is formed by small islands. Each island represents a unique puzzle the sailor will have to solve before getting to the Sleeping Totems and awakening them to answer a question about love and relationships.<br/><br/><br/><br/>Using boxes, each with different properties and behaviors, the sailors can build their own paths to the Sleeping Totems on each island. <br/><br/>As love does, most puzzles have no unique solution.<br/><br/><br/><br/>Nature and contemplation are also a huge part of Solo: pull out your camera and capture the moment, play the guitar, feed the animals or just sit on a bench and think.<br/><br/><br/><br/><br/><br/>Solo was successfully funded on Fig by 543 backers who could both pledge and invest during the Fig campaign. <br/><br/>", "metacritic": null, "released": "2018-04-25", "tba": false, "updated": "2019-08-28T21:59:34", "background_image": "https://media.rawg.io/media/screenshots/28d/28ded944274b2da7b58f242a1356728c.jpg", "website": "http://www.teamgothammadrid.com/", "rating": 0.0, "rating_top": 3, "added_by_status": {"yet": 4, "owned": 25, "beaten": 2, "toplay": 2, "dropped": 6}, "playtime": 3, "achievements_count": 37, "ratings_count": 5, "suggestions_count": 234, "game_series_count": 0, "reviews_count": 5, "platforms": ["PC"], "developers": ["Team Gotham"], "genres": ["Adventure", "Indie"], "publishers": ["Team Gotham"], "esrb_rating": null}