{"id": 582676, "slug": "caissa", "name": "Caïssa", "name_original": "Caïssa", "description": "<p>Caïssa is a small tactical RPG with light rogue and chess like elements. Travel across the kingdom of Light, battling your way through forces of mysterious foes while learning the secrets of your kingdoms past. Along the way recruit new allies to aid you in battle and learn new abilities to change the way you take on each challenge.<br/></p>\n<p>Caïssa is a solo project I have been working on and off for about a year now. Any feedback or suggestions are greatly appreciated.  I plan to make changes based on feedback and possible content updates in the future. The game is currently supported on windows, mac and linux with web coming soon. I had a lot of fun making it and hope you enjoy playing it as well!<br/></p>\n\n<p>Features</p>\n<ul><li><strong>Some standard rogue-like themes</strong>: Play through a series of uniquely created maps, enemies and dialog.</li><li><strong>Some non-standard chess-like themes?</strong> Players can only move one unit per turn. All units have one health.</li><li><strong>A pettable dog</strong>: In the year 2021 a pettable dog is sometimes just what you need.<br/>\n</li><li>8 unique classes with multiple skills per class</li><li><strong>Some witty dialog</strong>: I laughed a few times and I hope you will too.</li><li><strong>Art</strong>: Contains several accidental <strong>anthropomorphic</strong> faces.. whoops how did those get in there.</li><li>hour of content!</li></ul>\n\n<p>Shameless Plug</p>\n<p>Hey! If you like this game and want to stay in the know about any updates or, god forbid, my next game, follow me on itch and twitter @hlgott1593.</p>\n\n<p>Battle music by Abstraction from Three Red Hearts. Check his stuff out its super cool!</p>\n<p>http://www.abstractionmusic.com/</p>", "metacritic": null, "released": "2021-04-09", "tba": false, "updated": "2021-04-12T19:33:21", "background_image": "https://media.rawg.io/media/screenshots/7ba/7ba136c1426b500be7279a7663d48356.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 103, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["harrisongottlieb"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}