{"id": 58261, "slug": "code51mecha-arena", "name": "Code51:Mecha Arena", "name_original": "Code51:Mecha Arena", "description": "Code51:Mecha Arena is a wasteland-style mech arena game. As a pilot, you put on your VR device and drive your giant mech, sitting in the cockpit and fight your foes – mechs driven by rival players.<br/><br/><br/><br/>Unlike most VR shooter games, you won’t need to stand and move around. Simply sit in your chair just like the way you do in a mech cockpit, and wear your VR device like a helmet, you will be brought into the immersive battleground and enjoy fighting with other players. <br/><br/><br/><br/><br/>  · Story2040 A.D., the world condition continues to deteriorate. Fighting for very limited living resources, World War III had broken among the major forces. The great war exhausted almost all regular energy sources of the world, human civilization was mostly destroyed…            <br/><br/>People who survived the cataclysm reunited to find new energy sources. During which, they found the so-called Document of Code51, in which a mystery energy substance Code51 has been revealed.<br/><br/>With its discovery, mechas were made with this new energy. Warlords rose, factions formed. The union is as fragile as post-apocalyptic humanity. With these giant war gears, factions conflicted for exploiting Code 51 , another great war is breeding on the bruised earth…<br/><br/> · Immersive Cockpit DesignThe game uses an in-cockpit camera, through which you can see the interior structure and your weapon. Clear at a glance!      <br/><br/><br/> · Player-Friendly ControlsAll the controls are designed according to real world vehicles, and mapped to VR controllers perfectly. Very intuitive and easy to learn!      <br/><br/> · Different types of  mecha，every type of mecha has two skills and a skill.  <br/>9 different types of mecha<br/><br/><br/>10 different types of weapons<br/><br/><br/>Several different types of weapons<br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/>  · Sit，Relax and playCode 51 can be played without moving your body, which frees you from struggling with the wires, base stations and environmental dangers. Unlike other VR games, this game is merely energy-consuming, allowing you to play it for a long time without being tired.<br/><br/>", "metacritic": null, "released": "2018-04-24", "tba": false, "updated": "2019-08-28T21:59:34", "background_image": "https://media.rawg.io/media/screenshots/845/845eb9846619d9cfadb8b97acd329178.jpg", "website": "http://www.mechaarena.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 506, "game_series_count": 0, "reviews_count": 1, "platforms": ["PlayStation 4", "PC"], "developers": ["DeerVR", "SmellyRiver"], "genres": ["Action", "Shooter", "RPG", "Simulation", "Massively Multiplayer"], "publishers": ["SmellyRiver"], "esrb_rating": "Teen"}