{"id": 5826, "slug": "hunger-games-girl-on-fire", "name": "Hunger Games: Girl on Fire", "name_original": "Hunger Games: Girl on Fire", "description": "DEFEND KATNISS AGAINST THE CAPITOL! From an award-winning dream team comes the *official* FREE teaser game for the movie event of the year — THE HUNGER GAMES - and one of the top games in the App Store!<br/><br/>***UPDATE 1.0.2: See your score on the leaderboard and play against your friends in GameCenter! Follow @TheHungerGames on Twitter for news regarding an upcoming BIG update!***<br/><br/><br/>****************************************<br/><br/>Critics are loving Girl on Fire!<br/><br/>- An IGN Game of the Week!<br/> <br/>- A Pocket Gamer Top 10 Game of the Month!<br/> <br/>- “Taps the very heart of The Hunger Games Trilogy: a girl constantly on the run, constantly fighting for her life.” – Jack Broida, CNET.com<br/> <br/>- “We recommend it without pause! A conceptually solid runner that boasts a tremendous look and introduces some new ideas to its clotted genre.” – Brad Nicholson, TouchArcade.com<br/> <br/>- “Fun and addictive! Would make any fan happy!” – Rebecca Tarnopal, Appstorm.net<br/> <br/>- “Intense action, great music, and fun graphics seal the deal!” – Hamilton, MyHungerGames.com<br/> <br/>- &amp;quot;Breaks the mold, a surprisingly fun experience!” – Kyle Orland, Arstechnica.com<br/> <br/>****************************************<br/><br/>In THE HUNGER GAMES: GIRL ON FIRE, you&amp;#39;ll play as KATNISS EVERDEEN, the young heroine from District 12, whose sharp instincts are matched only by her even sharper bow-and-arrow shot.<br/><br/>With just weeks to go before the 74th Hunger Games, Katniss ventures past the fence and into the woods beyond District 12 to hunt for food for her starving family... only to run right into a swarm of Capitol-created TRACKER JACKER wasps!<br/><br/>Help Katniss find her way back home, while taking down the tracker jackers with your bow and arrow — but be careful once you get to District 12... The Capitol&amp;#39;s hovercrafts may come looking for you!<br/><br/>May the odds be ever in your favor…<br/><br/>***FEATURES***<br/>Guide Katniss&amp;#39;s escape with simple touch controls:<br/>- TAP on Tracker Jackers to shoot them down<br/>- SWIPE UP to leap up into the tree tops and avoid enemy fire<br/>- SWIPE DOWN to leap back down to the ground <br/><br/>Compete for high scores against friends on GameCenter!<br/><br/>Presented by Lionsgate and created by an indie game dream-team including Adam Saltsman, Danny Baranowsky and Paul Veer!<br/><br/>***ABOUT THE HUNGER GAMES***<br/>Every year in the ruins of what was once North America, the evil Capitol of the nation of Panem forces each of its twelve districts to send a teenage boy and girl to compete in the Hunger Games.  A twisted punishment for a past uprising and an ongoing government intimidation tactic, The Hunger Games are a nationally televised event in which “Tributes” must fight with one another until one survivor remains. <br/>more…<br/><br/>Pitted against highly-trained Tributes who have prepared for these Games their entire lives, Katniss is forced to rely upon her sharp instincts as well as the mentorship of drunken former victor Haymitch Abernathy.  If she’s ever to return home to District 12, Katniss must make impossible choices in the arena that weigh survival against humanity and life against love.<br/><br/>THE HUNGER GAMES is directed by Gary Ross, with a screenplay by Gary Ross and Suzanne Collins and Billy Ray, and produced by Nina Jacobson’s Color Force in tandem with producer Jon Kilik.  Suzanne Collins’ best-selling novel, the first in a trilogy published by Scholastic that has over 26 million copies in print in the United States alone, has developed a massive global following.  It has spent more than 160 consecutive weeks/more than three consecutive years to date on The NYT bestseller list since its publication in September 2008, and has also appeared consistently on USA Today and Publishers Weekly bestseller lists. A Lionsgate presentation, of a Color Force / Lionsgate production, a Gary Ross film.", "metacritic": null, "released": "2012-03-22", "tba": false, "updated": "2019-10-22T13:57:45", "background_image": "https://media.rawg.io/media/screenshots/635/6355cf6aeb229d21cca183b2ed3ff1a8.jpeg", "website": "http://www.TheHungerGamesGirlOnFire.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 239, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Lions Gate Films"], "genres": ["Action", "Arcade"], "publishers": ["Lions Gate Films"], "esrb_rating": "Everyone 10+"}