{"id": 582647, "slug": "hellbullet", "name": "HellBullet", "name_original": "HellBullet", "description": "<p>A game of the genre \"bullet hell\", avoid enemies, bullets and obstacles, get help from various items, get the greatest distance traveled, highest score or the most stars to enter to the tops records online, the appearance of enemies and obstacles is procedural and with an increase of these as you progress through the game.<br/></p>\n<ul><li> Languages available Spanish, English and Portuguese.<br/></li><li>Four levels of difficulty (easy, standard, difficult and extreme).<br/></li><li> Two skins for the player's ship. <br/></li><li>Online tops (distance, score and stars), separated by difficulty level (1).<br/></li><li>Four different types of enemies. <br/></li></ul>\n<p><strong>Collectable items</strong><br/></p>\n<p> Bullet D. </p>\n\n<p>Type horizontal range shot, increases number of bullets fired simultaneously by the player (3). <br/></p>\n<p>Bullet C. <br/></p>\n\n<p>Type of linear-continuous shooting, increases number of bullets fired simultaneously by the player (3). <br/></p>\n<p>Percing<br/></p>\n\n<p>Grant the bullets fired by the player the ability to pass through obstacles and enemies causing damage at the same time (4). <br/></p>\n<p>Cadence <br/></p>\n<p>Increase the frequency between player's shooting. <br/></p>\n<p>Power<br/><br/></p>\n<p>Increase the damage caused by each bullet fired by the player.<br/></p>\n<p> Slow <br/></p>\n\n<p>Reduces the speed of the player's ship (5).<br/></p>\n<p>Nuke<br/></p>\n\n<p>Explosion of great range that causes constant damage to enemies (2).<br/></p>\n<p> Energy shield <br/></p>\n\n<p>It absorbs the impacts of enemy shots without receiving damage. <br/></p>\n<p>1-To see different tops levels it is necessary to change the difficulty from the title screen before entering the tops screen. <br/></p>\n<p>2-The nukes in Windows are launched with the space bar and will be directed up and to the center, if you press the space bar again, it will explote in that place. <br/></p>\n<p>3-Five simultaneous bullets is the maximum amount of bullets fired by the player.<br/></p>\n<p> 4-Each piercing item collected gives a round of 30 shots.<br/></p>\n<p> 5-The speed of the player constantly increases to a certain limit depending on the selected difficulty.</p>\n<p>*********************************************************************************<br/></p>\n<p>Es un juego del genero \"bullet hell\", evita los enemigos, balas y obstáculos, obtén ayuda de los distintos items, logra la mayor distancia recorrida, puntaje mas alto o la mayor cantidad de estrellas para logran entrar a la tabla de récords en linea, la aparición de enemigos y obstáculos es de forma procedural y con incremento de estos al avanzar en el juego.</p>\n<ul><li>Lenguajes disponibles español, inglés y portugués.</li><li>Cuatro niveles de dificultad (fácil, norma, difícil y extremo).</li><li>Dos skins para la nave del jugador.</li><li>Tops Online (Distancia, Marcador y Estrellas), separados por nivel de dificultad (1).</li><li>Cuatro distintos tipos de enemigos.</li></ul>\n<p><strong>Items colectables</strong></p>\n<p>Bala D</p>\n\n<p>Tipo de disparo de gran rango horizontal, aumenta cantidad de balas disparadas simultáneamente por el jugador (3).</p>\n<p>Bala C</p>\n\n<p>    Tipo de disparo lineal-continuo, aumenta cantidad de balas disparadas simultáneamente por el jugador (3).</p>\n<p>Perforante</p>\n\n<p>    Otorga a las balas disparadas por el jugador la capacidad de pasar a través de  y enemigos causándoles daño al mismo tiempo (4).</p>\n<p>Cadencia</p>\n\n<p>    Incrementa la frecuencia entre disparos del jugador.</p>\n<p>Poder</p>\n\n<p>    Aumenta el daño que causa cada bala disparada por el jugador.</p>\n<p>Lento</p>\n\n<p>    Reduce la velocidad de la nave del jugador (5).</p>\n<p>Carga explosiva</p>\n\n<p>    Explosión de gran rango que causa daño constante a los enemigos (2).</p>\n<p>Escudo de energía</p>\n\n<p>    Absorbe los impactos de los disparos enemigos sin recibir daño.</p>\n\n<p>1-Para ver los Tops de los diferentes niveles de dificultad es necesario cambiar la dificultad desde la pantalla de Titulo antes de entrar a la pantalla de Tops.</p>\n<p>2-Las Cargas explosivas en Windows se lanzan con la barra espaciadora y se dirigirán hacia arriba y al centro de la pantalla, si oprimen nuevamente la barra espaciadora esta explorara en ese lugar.</p>\n<p>3-Cinco balas simultaneas es la cantidad máxima de balas disparadas por el jugador.</p>\n<p>4-Cada item de bala perforante recogido da una ronda de 30 disparos.</p>\n<p>5-La velocidad del jugador incrementa constantemente hasta cierto limite dependiendo la dificultad seleccionada.</p>", "metacritic": null, "released": "2021-04-09", "tba": false, "updated": "2021-04-12T19:27:25", "background_image": "https://media.rawg.io/media/screenshots/aa3/aa3ffeb687360f2bafe680b4094cc224.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 82, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["La Red Games"], "genres": [], "publishers": [], "esrb_rating": null}