{"id": 58277, "slug": "harry-potter-hogwarts-mystery", "name": "Harry Potter: Hogwarts Mystery", "name_original": "Harry Potter: Hogwarts Mystery", "description": "<p>YOU have been chosen to attend Hogwarts School of Witchcraft and Wizardry! Embark on your own adventure in this all new RPG set in the wizarding world, years before Harry Potter received his Hogwarts letter. Explore never-before-seen rooms of Hogwarts Castle and investigate ancient mysteries. Learn powerful magic and knowledge from Professors Dumbledore, Snape, and more. Duel against your rivals and forge alliances with new friends to help you on your adventures. As part of WBIE’s Portkey Games label, this groundbreaking mobile game puts you at the center of an all-new story in the wizarding world.<br />\nWhen your mettle is tested, what kind of witch or wizard will you be? A heroic Gryffindor? A cunning Slytherin? You decide! After all, this is your Hogwarts story.<br />\nGame Features:<br />\nMagic Spells, Potions &amp; More<br />\n-       Attend classes to learn and master magical skills like casting spells and brewing potions.<br />\n-       Unlock new characters, spells, potions and locations as you advance through the years of Hogwarts.<br />\n-       Customize your student avatar.<br />\nMystery and Adventure<br />\n-       Use your magical skills to investigate mysteries at Hogwarts.<br />\n-       Discover the truth behind the Cursed Vaults and your brother&#39;s disappearance in an all new story.<br />\nFriendships that Matter<br />\n-       Bond with your housemates to win the House Cup.<br />\n-       Go on quests to help friends and fellow students…or frustrate rivals.<br />\n-       Earn respect and build relationships by adventuring together.<br />\nPlease note that Harry Potter: Hogwarts Mystery is free to download and play, however, you can purchase some in-game items with real money. If you want to limit this feature, please disable in-app purchases in your device&#39;s settings.<br />\nUnder our Terms of Service and Privacy Policy, you must be at least 13 years of age to play or download Harry Potter: Hogwarts Mystery. A network connection is also required.<br />\nPrivacy Policy: http://www.jamcity.com/privacy/<br />\nTerms of Service: http://www.jamcity.com/terms-of-service/<br />\nCheck out all the latest news &amp; updates for Harry Potter: Hogwarts Mystery<br />\n• Like us on Facebook: www.facebook.com/HPHogwartsMystery<br />\n• Follow us on Twitter: www.twitter.com/HogwartsMystery<br />\n• Follow us on Instagram: www.instagram.com/HPHogwartsMystery</p>", "metacritic": 43, "released": "2018-04-25", "tba": false, "updated": "2023-12-11T19:49:54", "background_image": "https://media.rawg.io/media/games/04c/04c5980dc9c0091654752957f94dc944.jpg", "website": "https://www.harrypotterhogwartsmystery.com/", "rating": 2.56, "rating_top": 3, "added_by_status": {"owned": 8, "beaten": 8, "toplay": 2, "dropped": 44, "playing": 14}, "playtime": 0, "achievements_count": 0, "ratings_count": 49, "suggestions_count": 429, "game_series_count": 0, "reviews_count": 52, "platforms": ["iOS", "Android"], "developers": ["Jam City"], "genres": ["Adventure", "Simulation"], "publishers": ["Jam City"], "esrb_rating": null}