{"id": 58295, "slug": "murderous-pursuits", "name": "Murderous Pursuits", "name_original": "Murderous Pursuits", "description": "<p>Murderous Pursuits is a kill-or-be-killed stealth-em-up multiplayer game for 1-8 players. Smartly stalk your target – the Victorian’s call that Quarry -  and wait for just the right moment to pounce on your prey. But be careful not to give yourself away to the other players hunting you!</p>\n<p>Act like an unassuming passenger to avoid revealing yourself, locate high-scoring weapons, and stalk and kill your targets in a manner that befits your station as a &#39;right dodgy villain&#39;.</p>\n<p>The Best – And Smartest - Killer Wins<br />\nGain the highest number of points by the end of the round to win. Optimize your points by finding higher value weapons and keeping your exposure low, all while scoring glorious kills. Be too careful and you’ll fall behind. Be too bold and other hunters will take advantage.</p>\n<p>Employ a variety of abilities, including disguise, flash, and counter, to outmanoeuvre your adversaries and carry out your diabolical plan.</p>\n<p>Track and Avoid<br />\nUse the Quarry Tracker to locate your target. Keep an eye on the Hunter Indicator to avoid getting killed. But beware as your Quarry may be watching too.</p>\n<p>Keep your cool and use the busy passenger environments to your advantage by hiding in plain sight. Forget to blend in and you’ll raise your exposure, revealing yourself to your Quarry, and your Hunter.</p>\n<p>Watch Out For The Guards<br />\nGuards are on board to keep the passengers safe.  Beware:  they are on the lookout for killers. Anyone caught in the act will be stalled and left open to attack from other hunters.</p>\n<p>Take your pick from a line-up of eight nefarious killers – each as deadly as the next. From the cold and calculating Duchess to the wise-guy Dodger, it is your choice of which version of evil you feel will serve you best.</p>\n<p>Prove Yourself<br />\nClimb the ranks to become number 1 in the world for most number of kills... or most number of pies eaten!</p>\n<p>Key Features:<br />\nPlay solo or online with up to 8 players, featuring support for custom game options and wickedly intelligent bots. Identify your quarry, plan their extravagant murder and set it into motion, all before another player wises up and does the same to you!<br />\nHunt in four sumptuous locations aboard the HMCS Britannic - a state-of-the-art, colonial time ship. Blend in with the festivities in the richly decorated Music Hall or wait in the dark corners of the Engine House to pounce on your prey<br />\nChoose from eight playable characters. Pick your preferred archetype and skin, then blend in with the crowd to avoid detection<br />\nMaster the use of five abilities – only two of which can be chosen each match, so choose wisely<br />\nEarn favour to win - Simple killing won’t cut it. Be discreet, commandeer a high-value weapon, strike quickly and dance over your Quarry’s lifeless body to earn Mr. X’s ultimate favour<br />\nProve yourself – skill-based matchmaking will ensure you face appropriate opponents, so no slacking!</p>", "metacritic": null, "released": "2018-04-26", "tba": false, "updated": "2023-12-18T17:35:01", "background_image": "https://media.rawg.io/media/games/534/534d61ab5c9bfe29d94466377f6d0d6b.jpg", "website": "http://www.blazinggriffin.com/game/murderous-pursuits/", "rating": 2.35, "rating_top": 1, "added_by_status": {"yet": 189, "owned": 1971, "beaten": 10, "toplay": 16, "dropped": 68}, "playtime": 3, "achievements_count": 145, "ratings_count": 199, "suggestions_count": 235, "game_series_count": 0, "reviews_count": 201, "platforms": ["iOS", "PC"], "developers": ["Blazing Griffin", "NETEASE INTERACTIVE ENTERTAINMENT PTE"], "genres": ["Action", "RPG", "Strategy", "Simulation", "Indie"], "publishers": ["Blazing Griffin", "Netease"], "esrb_rating": "Teen"}