{"id": 583080, "slug": "amelias-flight-around-the-world", "name": "Amelia's Flight Around the World", "name_original": "Amelia's Flight Around the World", "description": "<p>Room 1: </p><p>-       Dropped back in time and you don’t know where you are</p><p>-       You explore the things around you</p><p>-       Look out the window and see a bunch of planes, you must be at an airfield</p><p>-       You see a newspaper with the date May 28, 1937, and the headline “Amelia’s Historic Flight”</p>\n<p>-       You know that you are here to prevent her from disappearing in her flight around the world\r\n</p>\n<p>Room 2:\r\n</p>\n<p>-       You find Amelia on the airbase and convince her to let you come with her on her flight\r\n</p>\n<p>-       Before you can convince Amelia to let you travel with her, she makes you collect several items that might be helpful on the flight.\r\n</p>\n<p>Room 3:\r\n</p>\n<p>-       We are in the cockpit of the plane flying, Amelia at the controls.\r\n</p>\n<p>-       She notices that it is looking a bit foggy and calls for us to look at the navigational materials located at a small table in the back of the plane\r\n</p>\n<p>-       You see\r\n</p>\n<p>o   Fog out the windows\r\n</p>\n<p>Room 3b:\r\n</p>\n<p>-       When you get to the materials at the back of the plane you see that we are potentially way off course. The thick clouds are preventing you and Amelia from seeing any distinguishing landmarks down below\r\n</p>\n<p>-       Using the navigational book and radio that you picked up prior to taking off you radio to those down below expecting your arrival in Howland Island and keep checking the navigation book.\r\n</p>\n<p>Room 4:\r\n</p>\n<p>-       Amelia Plane lands safe and sound on Howland Island the next morning and is revered for what she has accomplished\r\n</p>\n<p>-       We see that the island is beautiful and a quite the sight to see after a harrowing night in the sky\r\n</p>\n<p>Room 5:\r\n</p>\n<p>-       We jump to many, many years later when Amelia is old and long retired from flying.\r\n</p>\n<p>-       She sits and remines on the front porch of her house while planes fly overhead.\r\n</p>\n<p>-       Nobody knows any different from what could have been.\r\n</p>\n<p> In terms of the McCloud text and some of the concepts addressed in the book, my bitsy game “Amelia’s Flight Around the World” utilizes the concepts of abstraction, transitions, and timeframes. </p>\n<p>Considering that Bitsy is generally simplistic in that you can only design items in 8x8 boxes there is quite a bit of abstraction taking place in my game. While you can use several 8x8 squares to create images/pictures on a larger scale there is still a certain level of abstractness to the pictures because of the way you have to create them. McCloud essentially says in the text cartooned images with less complexity emphasize the concepts of the objects (pg. 41). In this regard, I would say that my game focuses more on the general ideas/concepts of saving Amelia, not specifically the complexity of the world in the game.\r\n</p>\n<p>The transitions talked about in the McCloud text generally refer to the gutter between frames in a comic book, however, the ‘gutter’ in regard to my bitsy game would be the transition from room to room. There are several transitions in my game that require the player to infer what has happened from the current room to the one before, for example, between the fifth and sixth room many, many years have passed and so when the player first arrives in the fifth room, there is some closure the player must complete in their mind. McCloud says that the intimacy with the comic created by closure is only surpassed by the written word (pg. 69). Going from room to room in my game there are several spots where I force the player to interact with text that will give the player needed context for the new space. In these situations, I believe that the player doesn’t have to work as hard to close the scene in their mind, because they have text to help them complete the picture.\r\n</p>\n<p>The timeframes between rooms in my game jump around quite a bit. Between the first and second room, only a few minutes may have passed from the player being in a room to walking out and finding Amelia. Whereas, between the last two rooms many years have passed.\r\n</p>\n<p>I think the biggest thing that helped me design my Bitsy game was the attention to the smallest of details we learned through the videos and readings. In the videos they discuss how when they are creating a world or ride the attention to minor details is very important because these are the details that sell riders on the space that they are in. All of the Disney people went to extreme lengths to design the space in a very specific way, for example in the article about the design of the Incredibles movies, the designers went to home showings just to better design the house in the movie.\r\n</p>\n<p>The other thing that was helpful was understanding ‘what would people see if they were actually in this space in real life. This is something we look at in class for example the Everest ride cue lines at Disney. This helped me to think like what would be on the inside of Amelia Earhart’s plane, so probably a tabletop area to look at maps and navigational materials, buttons, and levers coving the dashboard of the plane, and enough seats for her and anyone who would fly with her. All these things went into consideration when I was trying to complete the rooms in my Bitsy game.\r\n</p>", "metacritic": null, "released": "2021-04-08", "tba": false, "updated": "2021-04-12T21:23:07", "background_image": "https://media.rawg.io/media/screenshots/fa1/fa1b89526325ebcb8e5b3f1b8ca5811f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 6, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Murr_MIlano"], "genres": [], "publishers": [], "esrb_rating": null}