{"id": 583024, "slug": "retro-time-1950", "name": "Retro Time 1950", "name_original": "Retro Time 1950", "description": "<p>Artist Statement </p>\n<p>Room Outline: </p><p>Room 1: This is our establishing scene of the outside of our main protagonist’s house. Within this area, there are 3 exits you can interact with before going inside.   </p>\n<p>Room 2: This is the interior of the house where the first part of the story develops. After watching the TV, you learn of the first struggle of our protagonist.   </p>\n<p>Room 3: This is the fallout shelter the protagonist attempts to enter.  \r\n  </p>\n<p>Room 3A: This is just a transition scene to simulate the nuke going off and the travel of time.   </p>\n<p>Room 4: Here is the Diner where you are faced with the characters and a locked door. You talk to these characters and develop the story.   </p>\n<p>Room 5: This is the back of the diner where you find out the real date of 1950. From here you meet a trucker who helps you along the way.  \r\n  </p>\n<p>Room 6: The protagonist enters the city and is faced with buildings and people to talk to.   </p>\n<p>Room 6A: This is the Ritz-Carlton Hotel which indicates you are in New York. You meet a few characters in here who progress the story a bit more.\r\n  </p>\n<p>Room 6B: In the last room and the ending you are faced with one last interaction the triggers the end of our story.   </p>\n<p>Using McCloud:\r\n  </p>\n<p>The main parts I pulled from McCloud are his ideas of the Six Steps. These steps are idea, form, idiom, structure, craft, and surface. The way I used this was for room building and structure. Each room is a blank slate, and you need to use what you can in Bitsy to tell that story. First, I thought about where I was in the story and what Idea/Purpose this room would have. Second, the Form was how will I then convey this idea into an 8x8 grid? Would it be top-down or a side view? Third was Idiom which would be how do I express the time frame I am in which is the 1950s. Which Items belong in the 1950s and how can I show that in pixel art. Fourth is structure once I have all my items in then build the world fully from sprites to blocks. Fifth is Craft which is applying the storytelling aspect of it. In my case, it is dialog and making the world seem alive. Lastly, its surface is playing the game itself and making sure everything runs smoothly. Fixing any bugs and making it look as pretty as possible. (pg. 170-184) </p><p> \r\n   \r\n   \r\n  Using Theme Parks: \r\n  </p>\n<p>The readings and the videos helped immensely during the construction of the Bitsy project. You would not think that understanding everything that goes into a theme park from rides and the actual concept of a park would help you make a bitsy game, but it honestly does. One major takes away I tried using was the element of choice and subtlety influencing where the players should go. Whether it be through moving a character closer to the player or making a door locked so they would look around in different places first. Theme parks do the same thing though making pathways or having sounds or video play during a ride to fixate your attention on what they want. The other thing I used was using a sense of abstraction that all theme parks use in some way. They make the unfamiliarity of the world and make it familiar through disgusting items as something a normal person would know. In this case in bitsy being restricted to an 8x8 grid for world-building is a difficult task. Therefore, how do I make items look like what someone would think they look like in real life. For example, how do I make a 1950s diner in an 8-bit world? I started with color and items you would find in this 50s diner.   </p>", "metacritic": null, "released": "2021-04-08", "tba": false, "updated": "2021-04-12T21:08:31", "background_image": "https://media.rawg.io/media/screenshots/8f2/8f2cae23697c7e471e78febe2c0056b6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 6, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["PlatinumAcer"], "genres": [], "publishers": [], "esrb_rating": null}