{"id": 583045, "slug": "escape-from-rome", "name": "Escape from Rome!", "name_original": "Escape from Rome!", "description": "<ol><li>In the first room, the main character picks up a translator, and a military diploma so he can pass as a roman citizen.\r\n  </li><li>In the second room, you pick up a sword and a shield then are mistaken for a gladiator by a guard who tells you to proceed toward the Colosseum.\r\n  </li><li>In the third room, you pick up a legionnaire’s badge that will be used to impersonate a guard in the next room, as well as a watch to tell the character the time going forward. As you walk in the room you speak to two fellow warriors, one confident, and one self-deprecating.\r\n  </li><li>In the fourth room, you’re supposed to prep for the upcoming battle, but the only thing you find in the room is notes left by gladiators before they fell in the colosseum.\r\n  </li><li>In the fifth room, you find what is supposed to be the corpse of the confident gladiator with the scared sounding one standing over them waiting to fight you.\r\n  </li><li>In the final room, they allow you to pass and pay you off for the mistake, you then get back to your time machine, go home, and the game ends.   </li></ol>\n<p>Taking McCloud’s concept of time from chapter 4 of the text into account, I tried to focus on using color to depict the passage of time, preferring to use certain colors to show the early morning, mid-day, noon, and night. As you could tell from the design of the game, I tried to make simple rooms that would lead the player to the next story beat without taking too much time going between each room. The player should be able to quickly see what items they need to collect, without getting lost or confused about where to go. While we can’t quite translate a stellar chase scene into Bitsy, I tried my best to use the passage of time to show how the player progresses throughout the story. While their lines are limited, I wanted to take into account McCloud’s words on combining pictures and words (pg.152) by giving more personality to the characters through their dialogue, and providing a history to the world through the notes left in the colosseum. Overall, Understanding Comics gave me better understanding of how to incorporate dialogue in comics, though I feel as if I couldn’t quite incorporate McCloud’s teachings on how the story is affected by the art.\r\n  </p>\n<p>One of the most noteworthy topics of the lessons on theme parks was the focus on ambience and the emotions evoked in the guests from the entrance, throughout the park, and right up to their exit from the park. What resonated with me the most was their insistence on immersion, the way they incorporated everything from the crew to the park’s facilities for the sake of their immersion showed a serious commitment and dedication to their craft as well as to their narrative. For my game, instead of committing to the setting I wanted to convey a laid back comedic approach. From the guards to the items, I chose to aim for laughs rather than the serious tone of the subject matter, being stuck in the past and forced into a battle to the death. The majority of the guards behave and look the same way in order to further the story, they needed to be simple enough not to draw any attention or demand any backstory. Even though the guards were simple enough I at least wanted to provide a background for one of the gladiators, so I chose to include notes left behind as the last words of other dead gladiators, who all lost to the scared, meek seeming gladiator.\r\n</p>", "metacritic": null, "released": "2021-04-08", "tba": false, "updated": "2021-04-12T21:13:30", "background_image": "https://media.rawg.io/media/screenshots/269/2698f21cfb7339f32b9edc597348f49e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 3, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Eldritch T"], "genres": [], "publishers": [], "esrb_rating": null}