{"id": 583022, "slug": "dash-force", "name": "Dash Force", "name_original": "Dash Force", "description": "<p>This is a pre-alpha version.  There is no ingame tutorial yet.<br/>There will be 3 acts. Act 1 is quite done. Act 2 is a randomized copy of Act 1 and Act 3 consists only of a few rooms (for now).<br/></p>\n<p>You start with a set of abilities and have to cycle through them to stay efficient. Whenever you use an ability, you lose power. Your ability damage and shields gained from abilities will decrease when you have less power. Power will regenerate quickly though, once you switch to your next abilities.<br/>Complete rooms, by destroying the leader-robot of the room (usually the largest one). After each fight, gain coins and a new ability (optional). More difficult fights will give you better rewards, including powerful passive effects for your character.<br/>As you play through the randomly generated dungeon, you may gain access to additional ability slots, but you start off with only one or two slots. Cycle through them quickly to stay effective.<br/></p>\n<p>Use your W,A,S,D keys to move and your mouse to aim.<br/>Left mouse button: ability 1<br/>Right mouse button: ability 2<br/>Q: Ability 3<br/>E: Ability 4<br/>Space: Switch to your next set of abilities.</p>\n<p>I wish you a lot of fun playing this version of the game. As I am still working on the game, I would appreciate it, if you could give me some feedback.<br/>If you could leave me a small donation, you would really help me out, but since the game is not finished, it is for free and it is totally ok if you just grab the game and never look back.<br/>Smash those robots!<br/></p>", "metacritic": null, "released": "2021-04-08", "tba": false, "updated": "2021-04-12T21:08:13", "background_image": "https://media.rawg.io/media/screenshots/195/19559ab064d05367ae6c7102cb7200b4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 136, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ToFro"], "genres": ["Action"], "publishers": [], "esrb_rating": null}