{"id": 58328, "slug": "lilys-epic-quest-for-lost-gems", "name": "Lily's Epic Quest for Lost Gems", "name_original": "Lily's Epic Quest for Lost Gems", "description": "<p>Embark on an epic puzzle quest full of adventure and exploration.<br />\nYou play as Lily, a young archeologist who enters in her grandfather’s footsteps in a quest for the ultimate treasure, fame and glory.<br />\nThis puzzle adventure uses the match 3 puzzle mechanics, known from games like Candy Crush Saga or Bejeweled Blitz. By making combination of 3 or more blocks, Lily will be able to clear a path through different ground layers, in a search for rare Gems &amp; Artifacts. Our hero needs to explore 10 magic worlds and dig towards the center of the earth, to find all 250 collectables.<br />\n“Lily’s Epic Quest for Lost Gems” is an innovative enhancement to the match 3 genre. Most match 3 games stick to a fixed field of elements and, each time a combination of 3 or more is created, they are removed and new elements are added to the field. Lily’s Epic Quest has a process based on the classic 3-match principles with a free roaming playfield, where the player can decide where to dig or how to solve the puzzles.<br />\nThe player is limited to the view of the camera and needs to move the Hero around to view more of the playfield. Any combination of 3 or more will remove the blocks clearing the field and giving to the Hero more space to run around.<br />\nThe game contains more than 250 Gems &amp; Artifacts, some common and others very rare. It is up to the player to collect them all. Cracking all 150 puzzles will not be enough. New tools will open more possibilities and provide access to the new parts of the world.</p>", "metacritic": null, "released": "2018-05-16", "tba": false, "updated": "2019-10-29T16:02:14", "background_image": "https://media.rawg.io/media/screenshots/23f/23f75c8b968ec87d6de6d611d5cb243a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 196, "game_series_count": 0, "reviews_count": 0, "platforms": ["Xbox One"], "developers": [], "genres": ["Puzzle"], "publishers": [], "esrb_rating": "Everyone"}