{"id": 583546, "slug": "ankehoteps-prison", "name": "Ankehotep's Prison", "name_original": "Ankehotep's Prison", "description": "<p><em>For a 1000 years, the great pharaoh Ankehotep has been imprisoned in his tomb.\r\n</em></p>\n<p><em>Today, he awakens from his slumber. However, his prison is as tricky as the shifting sands of the desert... and there is the matter of his missing legs.</em><br/></p>\n<p><em>Should you be defeated, you will awaken on the same level, but it may no longer look familiar.</em><br/></p>\n<p><em>Rise Ankehotep, reclaim your canopic jars from the sons of Horus and crawl your way out of the pits of eternity!</em></p>\n<p>This game was made in a week for the Dungeon Crawler Jam 2021 and the goal was to create an old-school, first person, grid-based, turn-based dungeon exploration game.</p>\n<p>Ankehotep's Prison is a maze that moves in three dimension, and every time you play, a new labyrinth will be generated. There is no game saving because there was not enough time to implement it, but if you die, you restart in the same level -- though it will look different!<br/></p>\n<p>The game can be played with the keyboard or a gamepad, which works really nice!<br/></p>\n<p>As Ankehotep, you can not just move around the dungeon but you can crawl on the walls and ceiling and drop on unsuspecting enemies.<br/></p>\r\nControls<p><strong>PLEASE NOTE:</strong> The tutorial erroneously says that rotation is Q and R, it's Q and E! I'll update the game after the jam judging period.</p>\r\n KeyboardGamepadMove and Strafe<br/>WASDLeft Stick<br/>Rotate left and right<br/>Q and E<br/>Right Stick<br/>Action<br/>SpaceAPlace Ankh<br/>ShiftXWaitTLeft Bumper<br/>ClimbLRight Bumper<br/>Let go and reorient to ground<br/>EnterY\r\nBugs\r\n<p>Since the game was done in a week there are still a few bugs:</p>\n<ul><li>Sometimes, skeletons will walk on your square. That's not supposed to happen. They can't see or attack you and you can't attack them</li><li>You can place and Ankh though a wall. Don't worry, if you press the button again you can get it back</li><li>You can sometimes attack more often than you should... don't abuse it :D</li></ul>\r\nVersions\r\n<p>I've provided downloadable versions for macOS and Linux but I'm unable to test them, please let me know if they work for you.<br/></p>\r\nCredits\r\n<p>The game's code, art, and sounds were made by me. I had some extra help from by buddy Eric Manley who modeled, rigged, and textured Ankehotep's arms. The background music is from a music pack by Joel Steudler.</p>", "metacritic": null, "released": "2021-04-07", "tba": false, "updated": "2021-04-12T23:32:40", "background_image": "https://media.rawg.io/media/screenshots/446/446e338ea8d66fc8f60a00560cc4f1e2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 83, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["steamknight"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}