{"id": 583522, "slug": "evolution-itch-bodnarescu", "name": "EVOLUTION (itch) (bodnarescu)", "name_original": "EVOLUTION (itch) (bodnarescu)", "description": "<p>a Virtual Interactive Museum of Humanity's Evolution<br/></p>\n<p><strong>Concept</strong></p>\n<p>I imagined a space that brings together 6 million years of evolution in only 3 rooms, which are representative of the past, the present and the future. Going through each of them the user experiences how the limits of humanity as we know it, transcend from the first signs of civilization towards a metaphorical transhumanism, when data has taken over.</p>\n<p>I tried to capture the evolution of humanity through sound, as it has an important narrative part, leading the user into better grasping the concept of the experience. Each object in the <strong>Past</strong> room emits the soundscape of an epoch, ranging from the most natural habitat filled with wild and some imagined extinct animals, moving towards the first known signs of civilization and then, more closely, to our times, touching on our first Moon landing. \r\n  </p>\n<p>In the room of <strong>Present,</strong> the walls are equipped with very large LCDs that display live tweets from ‘today’ containing the ‘#news’ (in the desktop version). In the center lies an installation made out of old TVs that show the user’s face (stream from webcam). A metaphor to the egocentric era we live in. Notification sounds are louder when the user is near the TVs, suggesting his relevance in our common contemporaneity. The internet has offered fake hopes by giving everyone a voice and a sense of importance, making the human being once more feel so proud to be at the top of the pyramid. When the user approaches the walls with screens on them, he listens to unintelligible gibberish, people chattering, screaming and arguing, while news from all over the world appear on a screen. But all these technological advancements that we are happy with today, have only made it difficult for us, humans, to be humane.  \r\n  </p>\n<p>The rapid development of so-called NBIC technologies – nanotechnology, biotechnology, information technology and cognitive science – are giving rise to possibilities that have been the domain of science fiction. “Transhumanism” is the idea that humans should transcend their current natural state and limitations through the use of technology – that we should embrace self-directed human evolution. A transhumanist approach on <strong>future</strong> is portrayed in the last room of the experience. I imagined humanity linked to a brain-computer interface that allows for radical changes in what we might understand as a body-less world, with only consciousness being preserved. Humanity is becoming data flowing in a particle system that resembles a neural network. \r\n</p>\n<p>\n</p>", "metacritic": null, "released": "2021-04-07", "tba": false, "updated": "2021-04-12T23:26:45", "background_image": "https://media.rawg.io/media/screenshots/9f5/9f59382ec07b8754bc8d4b7e9b51a2b4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 113, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["bodnarescu"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}