{"id": 583572, "slug": "flarpy-dumbow-in-crackpipe-city", "name": "Flarpy Dumbow in Crackpipe City", "name_original": "Flarpy Dumbow in Crackpipe City", "description": "<p>A Flappy Bird parody to teach myself the GameMaker ropes and the arcane secrets of pixel art . Project highlight I feel is the procedurally generated parallax scrolling skyscrapers. </p>\n<p>I've also added in a local scoring system, not too hard to hack if you know where to look:</p>\n\n<p>Dumbow, portmanteau for Dumb + Cow is a curious stuffed animal my younger  sister received as a present for having reached x number of points at a general store when we were kids.</p>\n<p> Funnily enough, the stuffed toy had a seventy year old grumpy man frown on his face, we later discovered he was going through an identity crisis, it was very hard to identify whether it was a cow, a hippo or something else entirely. </p>\n\n<p>This fact, along with being somewhat, let's say, slow,  would have brought him to the dangerous life of crime in our little theatrical representations on the kitchen counter. Tales of drug deals gone wrong, double crossing of friends and family, addiction to hard drugs and the occasional mass murder of Barbie dolls - all in the name of personal profits and assuaging his crack cocaine addiction.</p>\n<p>Dumbow had a hair extension and I didn't want to touch it to avoid getting him mad in the next picture, he actually has pink hair.<br/></p>", "metacritic": null, "released": "2021-04-07", "tba": false, "updated": "2021-04-12T23:40:26", "background_image": "https://media.rawg.io/media/screenshots/0db/0db23966a0d6b9471b330ac9686f8070.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 34, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Gotham Hex Games"], "genres": ["Action"], "publishers": [], "esrb_rating": null}