{"id": 583770, "slug": "minervas-lost", "name": "Minerva's Lost", "name_original": "Minerva's Lost", "description": "<p>Izil's Father owns a powerful amulet. After the death of Izil's Mother, the true power of the amulet was unlocked, giving the holder the ability to transform into a powerful being. </p>\n<p>Izil and his father have been on the run for two years from Captain Copperhead, who is intent on taking the amulet's power for himself. The pair are trying to reach some of Izil's Father's old pirate buddies.  </p>\n<p>With only a few days travel left the two are ambushed by Captain Copperhead's forces. Will the owls reach their pirate friends before Captain Copperhead catches them?</p>\n<p><strong>Controls: </strong>Gamepad required. (tested with Xbox 360 &amp; Xbox One gamepads) Seems as though it doesn't work on Mac.<br/></p>\n<p><strong>Game Length</strong>: 30 - 40 minutes.</p>\n<p><strong>Knows Bugs:</strong></p>\n<ul><li>After defeating Dark Schippie the dialogue on morning 3 sometimes fails to load. You can still progress the story by pressing B through the invisible text. If this happens, you can see the dialogue by closing the game and loading your save, the choose to skip the Schippie fight and the dialogue should be visible on morning 3.</li><li>The B button is used to progress dialogue, however (for the best experience)  only push B once the first dialogue bubble has appeared on each screen. Pressing it before a dialogue bubble has appeared can sometimes cause the order of animations to mess up and on very rare occasions cause the text to disappear completely.  <strong>As long as the first dialogue bubble has spawned on each screen the pressing B won't cause any issues.</strong></li><li>Some screens wait up to 7 seconds to spawn dialogue. I fixed some of these before the deadline but there are still some screens where it takes a while to initiate the scene.</li><li>In scenes where Izil is holding his gun but the player does not have control, it is still possible to aim and shoot. Though this doesn't have an effect on the game, it does break immersion.</li><li>While Izil defends the ship, there should be a silhouette animation of Izil's father fighting an enemy ship in the background. This doesn't always spawn, which sucks because I think it is a cool detail. I know how to fix it but don't want to cause any controversy by updating it after the jam is over. (this also happens with an animated sun in each background during the daytime.)</li><li>There is a brutal save point. The games save at the end of each day when Izil goes to bed. This means that if you defeat Dark Schippie Dues and then fail to protect the ship on the first day it will put you back to before the Dark Schippie boss fight. He is skippable though, so I guess it isn't too big a deal.</li><li>The final boss is JANKY.</li><li>There is a glitch in the Dark Schippie boss battle, but it is spoilers to say what it is. It just makes the fight easier and a bit less interesting, doesn't effect the overall game.</li><li>I did not have enough time to change the character mapping for the final cutscene. Meaning Izil will be wearing his original clothes and holding his original gun.</li><li>A couple of spelling errors.</li></ul>\n\n<p><strong>Tips:</strong></p>\n<ul><li>If you want to make the game easier for yourself, upgrade the guns fire rate (bullets per second) first. It maxes out at 10 bullets per second, this can be done the first time you tinker with your gun. </li><li>You can tinker with your gun every night! Don't forget to upgrade before Izil goes to sleep.</li><li>Pressing down while in the air makes Izil fast fall. Without this he is very floaty. For the more intense encounters, it is a valuable maneuver to get around the ship quickly. </li><li>After Izil learns the \"Gift of Death\"; it is on a cooldown timer shown in the top left  of the HUD.</li><li>\"Troopers\"  on the ship, don't actually damage the hull unless they hit Izil. If they knock you down, you can keep shooting them. They can stun lock you if 2 or 3 team up on you. But you can keep shooting while down!</li></ul>\n\n<p><strong>My thoughts:</strong><br/></p><p>Every asset was created from the ground up during this game jam (except for the sound effects).  </p>\n<p>10 Minutes to spare and I finally got a working version uploaded. With an hour before the deadline, I exported it to discover that multiple sprites failed to load. My brain basically shut down. I had just spent 48 hours of non stop work, I mean literally in that time I ate one pizza and slept from 6am to 9am.  It was BRUTAL.  But by some miracle I manages to get it to work right before the deadline. </p>\n<p>200+ hours spent on this. I was super proud of it, probably the most I've ever been of one of my creative projects, until I exported it and it turns out its janky as hell.</p>\n<p>My anxiety will be through the roof hoping it doesn't break on steam. </p>\n<p>These game jams seriously push my physical and mental strength to the limits!</p>\n<p>Thank you in advance to anyone who plays this. The story was my focus for this one and though the game might be a bit janky, I'm super proud of the story. </p>", "metacritic": null, "released": "2021-04-07", "tba": false, "updated": "2021-04-13T00:42:17", "background_image": "https://media.rawg.io/media/screenshots/431/4310cd3a0d212b3f30761b4260d55bfc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 85, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["GGladam"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}