{"id": 58370, "slug": "fairune-collection", "name": "Fairune Collection", "name_original": "Fairune Collection", "description": "Fairune Collection includes four games in one package – Fairune, Fairune 2, Fairune Origin and Fairune Blast!<br/>\n<br/>\r\nFairune is a retro-styled adventure RPG. Our heroine embarks upon a journey to unlock three mysterious statues and seal away a great evil. Throughout the journey she will need to solve puzzles, fight monsters, discover new weapons and improve her abilities. <br/>\n<br/>\r\nFairune 2 brings our heroine back for another perilous quest, this time to find a lost fairy. This sequel delivers a bigger world for those that are ready for the challenge.<br/>\n<br/>\r\nFairune Origin offers an intriguing look at the beginnings of the IP. It provides a short but fun adventure and illustrates how SKIPMORE conceptualised the gameplay of the two games that followed.<br/>\n<br/>\r\nFairune Blast is an unlockable treat, meanwhile, to offer something completely different. It’s a colourful shoot-em-up and a fun diversion from the main adventures!<br/>\n<br/>\r\nFeatures:<br/>\r\n•\tFairune and Fairune 2 have been redesigned for this PC release.<br/>\r\n•\tExplore, solve puzzles, level up and fight monsters on your journeys. <br/>\r\n•\tSimple controls make it accessible to all players ready for adventure!<br/>\r\n•\tFairune Origin and Fairune Blast bring the game total to 4!<br/>\r\n•\tRetro 8-bit style visuals, designed for the modern era.<br/>\r\n•\tPerfect for headphones with a catchy chiptune soundtrack.", "metacritic": null, "released": "2018-05-16", "tba": false, "updated": "2019-08-28T21:59:33", "background_image": "https://media.rawg.io/media/screenshots/c47/c470e80070a5465267b060409539f87c.jpg", "website": "http://flyhighworks.heteml.jp/games/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 13, "toplay": 2, "dropped": 1}, "playtime": 1, "achievements_count": 21, "ratings_count": 1, "suggestions_count": 245, "game_series_count": 0, "reviews_count": 1, "platforms": ["Nintendo Switch", "PC"], "developers": ["SKIPMORE", "ESQUADRA"], "genres": ["Adventure", "RPG"], "publishers": ["Flyhigh Works"], "esrb_rating": null}