{"id": 58373, "slug": "taptap-heroes", "name": "Taptap Heroes", "name_original": "Taptap Heroes", "description": "\"TapTap Heroes will change the way you think about idle RPGs\" – PocketGamer<br/><br/>Storyline:<br/><br/>Tap Tap Heroes finds you centered in the continent of Mystia where heroes gather. In Mystia, a holy sword which carries the power of creation has been discovered by Freya, the queen of hell. As a result, Freya has plans to exploit the power of the holy sword and take over the world. The Alliance knights in their castles, the Horde warriors in their caves, the Elven mages in their forests, the Undead spirits in their tombs and the Holy beings in the heavens, all begin their journeys to find the power of creation. Together with over 200 heroes across six different factions, you too find yourself on a quest to find the holy sword and offset Freya’s plans before it’s too late. <br/><br/>【Note: This game requires an internet connection to play】<br/><br/>Features: <br/>√ Tapping Feature: <br/>- Enjoy the highly addictive tapping feature which adds a twist to the Idle RPG genre. Simply tap the screen to defeat the various ‘waves of enemies’ before you progressing to an idle boss battle!<br/><br/>√ Idle Gameplay: <br/>- Too lazy to tap? Don’t worry, once you log out the game for 7 hours or less, your heroes will fight automatically.<br/><br/>√ Character Evolution: <br/>- Upgrade your heroes and enjoy new costumes &amp; armor to strengthen your team to victory!<br/><br/>√ Countless Characters: <br/>- Boasting over 200 heroes across six different factions, collect new heroes along your quest!  <br/><br/>√ Free Daily Rewards: <br/>- Earn free diamonds and coins daily! The more you play, the more rewards you earn! <br/><br/>√ Earn and Receive: <br/>- Earn coins and diamonds, collect shards to summon heroes and use soul to upgrade existing heroes on your quest for supremacy!<br/><br/>√ Illusive Goblin: <br/>- Keep your eyes peeled for the illusive Goblin who will attempt to steal your earnings and rewards from your chest! Tap to defeat him! <br/><br/>√ Competitive Gameplay: <br/>- Rise through the leaderboards and see how you rank against other players online. Cement your legacy as a Tap Tap Hero in our competitive leaderboard!<br/><br/>√ Guild Arena: <br/>- Play with friends in the action-packed Guild Arena which enables you to play guild-boss battles and join different guild factions!<br/><br/>◆ Join your Taptap Heroes Friends on ◆ <br/>Facebook:https://www.facebook.com/WestbundGame<br/>Discord:https://discordapp.com/invite/WKTT967<br/>Reddit:https://www.reddit.com/r/TapTapHeroes", "metacritic": null, "released": null, "tba": false, "updated": "2019-07-30T22:24:28", "background_image": "https://media.rawg.io/media/screenshots/38f/38f950005e7e791889913645c6304d59.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 227, "game_series_count": 0, "reviews_count": 2, "platforms": ["Android"], "developers": ["Ajoy Lab Games"], "genres": ["RPG"], "publishers": [], "esrb_rating": "Everyone 10+"}