{"id": 583786, "slug": "dungeon-retest", "name": "Dungeon retest", "name_original": "Dungeon retest", "description": "<p>(Hope I'm not gonna get in trouble for having \"test\" in the name; I swear it's fully playable. I just don't feel like changing the project title)</p>\n<p><strong>Current Features:</strong><br/></p>\n<ul><li>Mostly first person view (there's only one map that isn't)</li><li>A not very well implemented monster capture system (most monsters can be captured, except for the slime, spider and snake [they weren't added yet] The only capture skill is instant because it was taking too long to setup by rates. Monsters are added after a battle is over. If I ever come back to this I'm going to be overhauling this system by a lot)</li><li>Captured monsters are set to auto battle</li><li>Honestly, probably not balanced all that well, but that really should be expected</li><li>The 2 human characters are set to somewhat level up automatically (you can pick what parameters go up each level) but I can't get the added monster actors to work the same way. For the time being any actor that can level up has an icon on them in the menu. The level up screen is accessed from the status menu (I'm going to have to figure out a different way to handle this)</li><li>Unfortunately, the story got a bit sidelined so that there could be playable content for the jam (something that will definitely be added back in if I come back to this)  </li></ul>\n<p>I apologize in advance for any bugs; I've been trying to fully bug test, but I also have a migraine that is making it hard to stare at screens (and I really take that kind of thing seriously)</p>\n<p>There are at least a few minor graphical glitches I already know about (they don't really impact the gameplay any, so I'm not going to fix those. Things like lights not being fully against walls) but if any really game breaking bugs occur please let me know.  </p>", "metacritic": null, "released": "2021-04-06", "tba": false, "updated": "2021-04-13T00:48:35", "background_image": "https://media.rawg.io/media/screenshots/294/2943524d893468d5d92742eb0e890436.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 188, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["lemongreen"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}