{"id": 58385, "slug": "rage-2", "name": "Rage 2", "name_original": "Rage 2", "description": "<p>RAGE 2 is the second installment in the RAGE series of post-apocalyptic action games. It is inspired by the Mad Max movie series.</p>\n<h3>Plot and setting</h3>\n<p>The game is set in 2165, thirty years after the events of the original Rage. More than a century before that, the Apophis asteroid fell on Earth, causing mass destruction and driving humanity to near-extinction. The few remaining people hide in the few safe oases, while the rest of the world is a post-apocalyptic wasteland raided by gangsters and evil mutants. The main protagonist is a man named Walker, who is the last ranger of the wasteland and a wielder of superhuman powers. He fights against the totalitarian organization called The Authority.</p>\n<h3>Gameplay</h3>\n<p>Like in the original RAGE, the sequel emphasizes its over-the-top action. The player controls Walker from the first person view and uses his huge guns and other weapons to fight monsters. The protagonist can also drive any vehicle that can be found in the game and engage in vehicular battles. When the player is driving, the game switches to the third person view. A new feature introduced in RAGE 2 is its Overdrive system that encourages aggressive playing style. By killing multiple enemies in a short amount of time, the player can enter Overdrive mode, which increases the guns&#39; power and the amount of loot. There is also a multiplayer mode.</p>", "metacritic": 71, "released": "2019-05-14", "tba": false, "updated": "2024-03-26T15:29:18", "background_image": "https://media.rawg.io/media/games/662/66261db966238da20c306c4b78ae4603.jpg", "website": "https://bethesda.net/game/rage2", "rating": 3.24, "rating_top": 3, "added_by_status": {"yet": 273, "owned": 1529, "beaten": 390, "toplay": 302, "dropped": 294, "playing": 55}, "playtime": 11, "achievements_count": 284, "ratings_count": 692, "suggestions_count": 538, "game_series_count": 1, "reviews_count": 708, "platforms": ["PlayStation 4", "Xbox One", "PC"], "developers": ["id Software", "Avalanche Studios", "Virtuos", "Goodbye Kansas Games", "Passion Republic Games", "Isbit Games"], "genres": ["Action", "Shooter", "Racing"], "publishers": ["Bethesda Softworks"], "esrb_rating": "Mature"}