{"id": 583805, "slug": "retribution-ludeshka", "name": "Retribution (ludeshka)", "name_original": "Retribution (ludeshka)", "description": "<p><strong><em>This story was written for the Bruised Egos Game Jam.</em></strong></p>\n\n<p>When you grow up, your past becomes an ever heavy part of yourself.</p>\n<p>How can I condense 25 years of fandom drama?<br/></p>\n<p> \"It was the 90's, bro. You had to be there\"</p>\n<p>Argentinians were lucky we even got the european translation, mistake ridden as it was.</p>\n<p>The internet was simply not what it is today, so to know the actual backstories of the characters, You had to (by being insanely rich) import The Perfect Image books all the way from Japan.</p>\n<p>So to us, the game was the only canon we knew.</p>\n<p>Limitations gave way to creativity, as I truly believe they always do.  From victory phrases and taunt animations we built our world, and we let our imagination fill the blanks.</p>\n<p>The fanwork was sometimes hilarious (Scratch &amp; Sniff!!), sometimes insanely tragic ( The Waffle House !!) and sometimes plain horny (ExecuteCobra69, wherever you are, I still think you're a deviant) but what I would like to stress is this:</p>\n<p> <strong>Every single fansite from that era is gone <br/></strong></p>\n\n<p>(R.I.P Geocities, R.I.P every single Webring, R.I.P those Yahoo Mailing Lists)  <br/></p>\n\n<p>Do you see the connection?</p>\n<p>I'm not saying Darschipidous burnt my village, lol.</p>\n<p>What I am  saying is, sometimes, your own past is worth fighting for.</p>\n<p>I know this isn't fully canon compliant, and I know I'm using the european naming conventions, and I know I am making a text adventure out of a fighting game.</p>\n<p>But as Areksa herself said \"My past is heavy on my bones, but it is a weight I carry with love\"</p>", "metacritic": null, "released": "2021-04-06", "tba": false, "updated": "2021-04-13T00:54:22", "background_image": "https://media.rawg.io/media/screenshots/a66/a665fbdd7388fcd00f709cf93041d94e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 18, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["ludeshka"], "genres": [], "publishers": [], "esrb_rating": null}