{"id": 583976, "slug": "box-stack-a-forklift-game", "name": "Box Stack: A Forklift Game", "name_original": "Box Stack: A Forklift Game", "description": "<p><strong>[Box Stack: A Forklift Game]</strong> is based on the prototype game with the similar title \"A Forklift Game\" that was made during a game jam hosted on itch.io</p>\n<p>After some time we decided to take the game further and make it into a complete game for you to enjoy. And for us to learn more about game development. This will be our first complete released title.</p>\n<p>The premise of the game is simple. You take control of a Forklift and now run the show at the warehouse. Sort, stack and deliver boxes to it's correct location. Or if you feel like making a mess, feel free. But remember, there is a \"cost\" of being messy.</p>\n<p><strong>[The state of the game]</strong><br/></p>\n<p>This version of the game is a \"Beta test\". We have done internally testing before and the game has seen some changes over the past few months. If you play the game and want to give us feedback, feel free to do so. In the complete release of the game, we will include more floors, quests, secrets and adventures to explore. Some floors can already be hinted at in this version.</p>\n<p>We would love to know what <strong>you</strong> think of the game, and how we can perhaps improve and design a more compelling experience for your enjoyment. So when you have played the game give us a comment and perhaps a rating, it really helps.</p>\n\n<p><strong>[How to play] </strong></p>\n<p>The controls of the game can be found in the Main menu when the game is started. But following is a summary of how to play the game:</p>\n<p><strong>Driving the forklift:</strong> Using the key \"W\" drives the forklift forward and the \"S\" key makes it go backwards. To turn while driving use keys \"A\" &amp; \"D\".</p>\n<p><strong>Lifting and lowering the forks:</strong> Use the keys \"Q\" &amp; \"E\" to control the position of the forks.</p>\n<p><strong>Locking objects to the forks: </strong>Simply press down the \"space bar\" key to lock an object to the forks when it's in the correct position. A simple \"locking sound\" will be played when the locking has been completed. Repeat to unlock an object.<br/></p>\n<p><strong>Look at the quest log: </strong>By pressing the \"TAB\" key you will be able to track your progress during play. Here you can also find some other options and reset the forklifts' rotation, if it's sort of drifting forward while driving.</p>\n<p><strong>Installing: </strong>Download the files and extract them to somewhere on your computer. Then, open the folder and launch the game.<br/></p>\n\n<p><strong>Whats next?</strong><br/></p>\n<p>When we feel like there is enough feedback from the beta test of this version, we will analyze it and make the changes that feels right to make. Depending somewhat on the amount of changes that needs to be made, we will aim for a full release before or early summer. Follow the project and get updated on the dates.</p>\n<p>As mentioned before, there is more coming to the game on full release. Right now, the basic systems for the game is working (some things are subjected to change) so most of the work that remains to be done is levels, quests and other fun mechanics for you to explore.</p>\n\n<p>[Credits]</p>\n<p>Alexander Tallnäs - Programming, Technical Artist, Level Design, Game Design - Games By Alexander</p>\n<p>Lukas Ax - Game Design, Level Design, 3D Artist, 2D Artist - Games By Lukas</p>", "metacritic": null, "released": "2021-04-06", "tba": false, "updated": "2021-04-13T01:46:00", "background_image": "https://media.rawg.io/media/screenshots/4b6/4b6888dc87675581b89603e14ee16fdc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 63, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["lukasax", "TallnasGames"], "genres": ["Simulation", "Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}