{"id": 58407, "slug": "idle-champions", "name": "Idle Champions", "name_original": "Idle Champions", "description": "Idle Champions challenges players to assemble a party of Champions and master the art of Formation Strategy. Players unlock new heroes, upgrade them to reveal special abilities, and collect epic gear. The key to glory is learning how to combine Champion abilities to defeat an onslaught of powerful monsters.<br/><br/>Unlock Renowned Champions<br/>Collect renowned Champions from the world of Dungeons &amp; Dragons, including fan-favourites from the Force Grey series. Unlock more Champions and gear to add to your party in limited-time events. <br/><br/>Formation Strategy<br/>Mastering the position of each Champion to maximize their special abilities is the key to completing each adventure. Each Champion's abilities and gear requires careful thought to create the best combination. Only the most powerful formations will defeat the waves of Dungeons &amp; Dragons monsters.<br/><br/>Explore the Forgotten Realms<br/>Take your Champions on a journey through the Sword Coast. Players will be able to explore familiar locations within the Forgotten Realms as they tackle each adventure. <br/><br/>Regular Events<br/>The game is updated regularly with limited-time events. Completing events unlocks new Champions and gear to add to the player's collection.<br/><br/>- You can download and play Idle Champions of the Forgotten Realms for free, however some premium in-game items can also be purchased for real money.<br/>- Gems earned for free in-game by killing bosses and completing adventures can be redeemed in the in-game Shop for Silver and Gold Chests that contain equipment, potions, contracts, and gold. Gold Chests can be purchased for real money if you do not want to wait and save up gems for them.<br/>- Silver Chests contain three cards of Common to Rare rarity. Silver Chests have a chance of dropping Rare equipment cards, but do not contain Epic equipment cards. (1)<br/>- Gold Chests contain five cards of Uncommon to Epic rarity. Gold Chests always contain at least one Rare equipment card and have a chance of dropping Epic equipment cards. (2)<br/>- Basic Silver and Gold Chests can drop equipment for all basic non-event Champions, including Hitch and Drizzt. They will not drop equipment for event Champions (for example Gromma, Krond, or Barrowin).<br/>- Event and Promo Chests function the same as basic Silver and Gold Chests, however, they only drop equipment cards for specific Champions. Check the description in the in-game Shop to determine whose items they can drop.<br/>- Guaranteed “Shiny” equipment cards are available as a reward for real money purchases, however, they also have a small chance of appearing in any Silver Chests or Gold Chests that you purchase for free. (3)<br/>- Bonus “Golden Epic” equipment cards are generally only available as a purchase bonus for real money transactions, however, specific Golden Epic cards may become available through free means at Codename Entertainment's discretion.<br/>- In-game purchases range from $2.99–$49.99 USD (or equivalent local currency) per item.<br/><br/>(1) Chance of a Rare equipment card in a Silver Chest is approximately 3.2%.<br/>(2) Chance of a Rare equipment card in a Gold Chest is 100%. Chance of an Epic equipment card in a Gold Chest is approximately 12%. To mitigate bad luck, a system exists to guarantee at least one Epic equipment card within every 10 Gold Chests.<br/>(3) Chance of a Shiny equipment card in a Silver or Gold Chest is approximately 0.1% per equipment card.\"<br/><br/>", "metacritic": null, "released": "2018-05-15", "tba": false, "updated": "2019-10-22T14:31:03", "background_image": "https://media.rawg.io/media/screenshots/343/34316c64938d9869187963c8845231fc.jpg", "website": "http://idlechampions.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 236, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Codename Entertainment"], "genres": [], "publishers": ["Codename Entertainment"], "esrb_rating": "Teen"}