{"id": 584047, "slug": "the-adora-project-teamdu", "name": "The Adora Project (TeamDU)", "name_original": "The Adora Project (TeamDU)", "description": "<p>TeamDU's first game project!\r\nCheck out our Facebook and Patreon for other projects and \"The Adora Project\" updates -</p>\n<ul><li>Facebook: https://www.facebook.com/TeamDUOfficial\r\n</li><li>Patreon: https://www.patreon.com/TeamDU\r\n</li></ul>\n<p>The Adora Project is a Detective-Thriller / Visual Novel-like game made using RPG Maker MV, inspired by classic horror games made through the engine, such as Corpse Party and Mad Father. The game is also inspired by Danganronpa, an adventure styled visual novel developed by Spike Chunsoft.\r\n</p>\n<p><strong><em>The Adora Project</em></strong>\n</p>\n<p>The Adora Project sees you take the role of Araki Ayumi, a High School student who has recently found himself in a terrifying situation. Araki, along with 9 other Students and Teachers, have been kidnapped and locked away in an unfamiliar, abandoned building.\r\n</p>\n<p>To uncover the truth behind their kidnapping, they must all work together to figure out a way out of their over-sized cell.\r\n</p>\n<p>Their investigations of their surroundings are cut short after just a few days, when one of their fellow students turns up dead...\r\n</p>\n<p>They must use their wits and willpower to find a way out, with the stakes growing ever higher. . .\r\n</p>\n<p><strong>Features</strong>\n</p>\n<ul><li>Ten unique characters, Eight Students and Two Teachers.\r\n</li><li>A sprawling, massive building to explore, that reveals more secrets than answers. . .\r\n</li><li>The Thinker System: Akin to Classes from RPGs, The Thinker System determines how a character participates in Investigations and how they solve puzzles around the building.\r\n</li><li>A well crafted story, with the characters at center stage. There are many twists, turns, and even an outcome that you wouldn't expect. . .\r\n</li><li>Original Soundtrack and Character Designs, OST provided by {Sku!l} - https://www.youtube.com/channel/UCvjKmSHhfpFfyF7iKEpEmJg\r\n</li></ul>\n<p><strong>Current Build Information</strong>\n</p>\n<p>The current demo available to download and play is called \"The Adora Project / Side: Hugo\". It was made using (Mostly) original assets (The tile sets are from the program itself.)\r\n</p>\n<p>It was made as a \"Proof-Of-Concept\", to get a feel for the mechanics and interactions between characters.\r\n</p>\n<p>\"The Adora Project / Side: Hugo\" is a story-based demo that follows Hugo Muramasa and his companions through a not-so normal day of school at Yosada High. This demo was made with the intent to show off what to expect from the main game, and to gather feedback for the future. The plot of the demo is canon, and worth playing even after the main game's release.</p>", "metacritic": null, "released": "2021-04-06", "tba": false, "updated": "2021-04-13T02:10:26", "background_image": "https://media.rawg.io/media/screenshots/b69/b69a1642091226062e04183005000e3b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 212, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["TeamDU"], "genres": ["Action", "Adventure", "RPG", "Puzzle"], "publishers": [], "esrb_rating": null}