{"id": 584067, "slug": "a-red-sky-demo-alpha-v013", "name": "A Red Sky - Demo Alpha v0.1.3", "name_original": "A Red Sky - Demo Alpha v0.1.3", "description": "<p>In a distant countryside in Chile, The Legend of a witch, owner of a gigantic and aged circus that appears from time to time, is told. This witch has a troop of \"dehumanized ones,\" which mainly captures children to turn them into creatures. The witch provides various shows that the circus offers.  In The Legend of the Witch and the ghost circus, this stage is called \"Hunting.\" This event is held days before the circus opens its doors to “customers.” Most of the peasants lost in the area are captured and bewitched by the witch for the reason that they work for her and the gigantic circus, which seems to have a life of its own.</p>\n<p>A Red Sky has taken elements from different genres of video games without getting to be pigeonholed into one, so our best description would be \"an adventure and action video game with RPG elements.</p>\n<br/>\n<p>Many of these features are designed and developed, however, some are still in development. All these are within the GDD of a Red Sky; therefore, all of them will be in the final release of the game.</p>\n\n<ul><li>Fluid Combat.\r\n</li><li>Bosses have two or more phases (transformations and attacks)\r\n</li><li>Many weapons, powers and items you will get throughout the adventure.\r\n</li><li>Charismatic and varied characters. You will love them and some you will hate.\r\n</li><li>A story about friendship, the path to determination, selfishness and hope. This story has various revelations or thrilling twists and large handfuls of science fiction.\r\n<ul><li>A wide variety of ways to move through the world (construction of structures, More than one path)\r\n</li></ul></li><li>Animated cinematics for various events throughout the adventure.\r\n</li><li>The world of the game has freedom of exploration, you can come and go as many times as you want.\r\n</li><li>A detailed and carefully drawn and animated environment with detailed pixel art. The world is completely hand-drawn, almost completely avoiding the use of \"tiles\" or repetitive elements.\r\n</li></ul>", "metacritic": null, "released": "2021-04-06", "tba": false, "updated": "2021-04-13T02:16:19", "background_image": "https://media.rawg.io/media/screenshots/e2e/e2e621c48c55df493e5697c1221e5fa9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 479, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["TeamRobotBlackHat"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}