{"id": 58412, "slug": "calculation-castle-grecos-ghostly-challenge-subtra", "name": "Calculation Castle: Greco's Ghostly Challenge \"Subtraction\"", "name_original": "Calculation Castle: Greco's Ghostly Challenge \"Subtraction\"", "description": "<p>\n      Finally, on the Nintendo Switch, a game that lets your child enjoy \n      studying while challenging their skills in math has entered the world of \n      gaming. It contains a collection of subtraction problems and math drills \n      learned at the elementary level. There are up to 10 steps of learning, \n      starting with Elementary 1st grade level 1-digit math problems to \n      developing skills such as borrowing numbers with 2-digit math problems \n      and more. Advancing through the levels, your child can naturally become \n      able to solve 4-digit subtraction problems with ease.\n    </p><p>\n      The Story (setting)\n    </p><p>\n      \"The name's Greco. I'm sendin you an invite to face the challenges that \n      await in my castle! So, let's play a game!! I live at the very top of my \n      castle! Do you got what it takes to reach me? It won't be easy. In order \n      to get to me, you gotta pass through several rooms. In these rooms, \n      you'll have to solve subtraction problems to pass. That's why my castle \n      is called the Calculation Castle! Moreover, my castle is full of ghosts \n      with many tricks standing in your way, so good luck and do your best! If \n      you manage to beat my ghostly henchmen and get through the rooms, you'll \n      receive lots of hidden rewards…but can you do it? I guess I'll wait and \n      see! Heh heh heh…\"\n    </p><ul>\n<li>\n        The game is composed of a series of stages and there are ghosts and \n        locked doors within each stage. Greco and his ghosts will present the \n        player with problems that they will need to solve in order to defeat \n        the ghosts, unlock the doors, and proceed to the next stage.\n      </li>\n<li>\n        The player can face off against and defeat ghosts. Doing so will earn \n        the player treasures(items) and ghost coins which can be used to \n        reveal hints and unlock special bonus stages.\n      </li>\n<li>\n        Your child can happily play while studying math and develop stronger \n        skills regarding subtraction after some time.\n      </li>\n</ul><p>\n      Learning System (Game Contents)\n    </p><p>\n      [Select Problem]-----Players answer the questions by choosing the \n      correct answer of the question from a series of numbers shown using \n      cards.\n    </p><ul>\n<li>\n        Choosing the correct number will cause the ghost to take damage, \n        reducing its HP(health points) by a set amount and earning the player \n        some ghost coins.\n      </li>\n<li>\n        If the player reduces the ghosts HP to 0, the ghost will be defeated, \n        and the player will receive items and ghost coins.\n      </li>\n<li>\n        By selecting and pushing [Hint] the player will be able to see a hint \n        that can aid them in solving the question. Choosing to reveal a hint \n        will require the player to spend ghost coins.\n      </li>\n</ul><p>\n      [Unlock ]-----Remove the lock hung on the door by using the correct \n      answer to the problem.\n    </p><ul>\n<li>\n        If certain conditions are met and the numbers on the lock match with \n        the numbers of problems solved correctly, then the lock will be \n        removed.\n      </li>\n<li>\n        If all the locks on a door are removed then the door will open, and \n        the player can advance further through the game.\n      </li>\n<li>\n        By selecting and pushing [Hint] the player will be able to see a hint \n        that can aid them in solving the question. Choosing to reveal a hint \n        will require the player to spend ghost coins.\n      </li>\n</ul><p>\n      [Bonus Stage] By acquiring the required item or \"key,\" the player can \n      advance to a special bonus stage.\n    </p><ul>\n<li>\n        In this game mode, players must defeat as many ghosts as possible \n        within the time limit.\n      </li>\n<li>\n        When the player exterminates ghosts, they will receive ghost coins.\n      </li>\n</ul><p>\n      So, let's aim for the final stage where the decisive battle with Greco \n      awaits! A game that lets your child enjoy learning and studying math is \n      coming to the Nintendo Switch. Greco and his ghosts are waiting for the \n      next challenger!\n    </p><p>\n      With Nintendo Parental Controls, you can utilize your smart phone to \n      monitor your child's activities. For example, the feature can be used in \n      such a way that for every hour your child spends playing a game, you can \n      encourage them to play a study game, such as Greco's Calculation Castle, \n      for 30 minutes. So, how about deciding the rules with your child?\n    </p>", "metacritic": null, "released": "2018-05-15", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/bd8/bd8dc3a3a2a048cc92c924f703fa13fe.jpg", "website": "http://www.media-5.co.jp/switch/gureko/calculation/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 117, "game_series_count": 0, "reviews_count": 0, "platforms": ["Nintendo Switch"], "developers": ["media5 corporation."], "genres": [], "publishers": ["media5"], "esrb_rating": null}