{"id": 584253, "slug": "pong-16", "name": "PONG ✰", "name_original": "PONG ✰", "description": "<p>Découvrez une toute nouvelle version du grand classique <strong>Pong</strong> de 1972.</p>\n<p>Cette version se joue en 1 joueur contre le mur, telle une pelote basque. Repoussez les limites: Déplacez-vous verticalement ET horizontalement ! Inclinez votre barre pour orienter la balle.</p>\n<p>Mais surtout, ce jeu a pour objectif d'être rendu accessible. À terme, les personnes atteintes de daltonisme, celles n'ayant pas l'usage d'une main ou d'un bras, ou encore les personnes non-voyantes pourront profiter pleinement de ce jeu.</p>\n<p>Comment ?</p>\n<ul><li>La palette de couleurs a été choisie de sorte à être visible par la majorité.</li><li>Ce jeu a pour ambition de proposer un système de réattribution des touches performant. Ainsi il sera possible de jouer au jeu par le biais, par exemple, d'une kinect ou d'un quadstick.</li></ul>\n<p><strong>Suggestion d'affectation des touches:</strong></p>\n<p><strong>Kinect</strong></p>\n<ul><li>Déplacer la barre en orientant la tête dans une direction.</li><li>Incliner la barre en souriant ou en faisant la moue.</li></ul>\n<p><strong>Quadstick</strong><br/></p>\n<ul><li>Déplacer la barre avec le stick.</li><li>Incliner la barre en soufflant ou un inspirant.</li></ul>\n<p>Pour les non-voyants: Il sera possible de se repérer dans le jeu uniquement grâce au son. </p>\n<ul><li>Plus un objet émet un son fort, plus il est proche du but. À contrario, plus il est faible, plus il s'en éloigne. Ceci est valable pour la barre comme la balle.</li><li>Plus le son sera aigüe, plus l'objet sera en haut, plus le son sera grave, plus l'objet sera bas.</li><li>Sur un système stéréo, plus ce son sera concentré à gauche, plus l'objet sera à gauche, plus il sera concentré à droite, plus l'objet sera à droite.</li></ul>\n<p>Avec ce mécanisme, les joueurs non-voyants devront chercher à produire la même tonalité avec les deux sons pour taper la balle.</p>", "metacritic": null, "released": "2021-04-05", "tba": false, "updated": "2021-04-13T03:14:42", "background_image": "https://media.rawg.io/media/screenshots/caf/caf2d3f484e7c35a328f24d587ce367e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 10, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["The-SamL"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}