{"id": 584486, "slug": "for-the-swarm", "name": "For The Swarm", "name_original": "For The Swarm", "description": "<p>Made for the College Game Jam</p>\n<p>I'd love feedback on the concept of the game and whether people would like to see it developed further, in my head i'd like to see it as become like a mix between starcraft and factorio.</p>\n<p>The theme for the jam was connection, and what's more connected than a ravenous hive mind constantly looking to expand? Grow your swarm by hunting 'animals' and then drive the human invaders out of your territory with overwhelming numbers.</p>\n<p>My second game and first time making art and music assets as well as making an RTS.</p>\n<p>Controls (mostly standard rts):</p>\n<p>Camera: </p>\n<p>WASD = move</p>\n<p>Hold left shift to move camera faster</p>\n<p>Use mouse wheel to zoom in and out</p>\n<p>Unit orders:</p>\n<p>Left click to select units and drag selection box</p>\n<p>Right click to move or attack if mouse is on enemy</p>\n<p>Hold left control and click right mouse to issue move attack order(units attack anything on their way there)</p>\n<p>No pathfinding? ah I think you'll find the units are actually blind, if they get stuck that's definitely on u and definitely not down to my inexperience in coding</p>\n\n<p>Known Issues: </p>\n<p>Hunters will sometime move to the top right of the screen after beating an enemy, <strong>you can get around this by using move attack orders</strong></p>\n<p>Selection groups over about 150 may cause hunters within to ignore laws of physics and cause performance issues.</p>\n<p>some humans have higher fire rates for some reason</p>\n<p>Highlight colour for hunters when selected or holding biomass should be different as it doesn't really contrast with background</p>\n<p>(I didn't have time to playtest so a few small bugs got by but I hope you still enjoy it!)</p>", "metacritic": null, "released": "2021-04-05", "tba": false, "updated": "2021-04-13T04:26:01", "background_image": "https://media.rawg.io/media/screenshots/2e5/2e5e02673d240bae29209ad07c2b7628.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 17, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Graugen"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}