{"id": 58453, "slug": "armagad-also-tetrageddon-games", "name": "ARMAGAD (also Tetrageddon Games)", "name_original": "ARMAGAD (also Tetrageddon Games)", "description": "\"Tetrageddon is what the internet does to people.\"<br/>- alienmelon (prior to her untimely demise)<br/><br/>\"This sounds edgy, what is this?\" You may ask, followed by... What exactly are Electric Love Potatoes, and what is their purpose? Why frogs? Where are all these errors coming from? Are Electric Love Potatoes even a good thing?? What is wrong with cybermonkeys and why must they all die (or is it just that one)? Who is ARMAGAD and what has it done to my computer? Will I ever be normal again?<br/><br/>Will anyone ever be normal again?<br/><br/>What is normal?<br/><br/>Normal?<br/><br/>Yes. Discover some answers to these questions in ARMAGAD (also Tetrageddon Games).<br/><br/>ARMAGAD (also Tetrageddon Games) includes a plethora of features (not bugs), and feature enhancing bugs, such as:<br/><br/>* HTML5<br/><br/>* ARMAGAD (also Tetrageddon Games) brings the internet to your desktop with stunning 8-bit graphics, monkeys, and a mild lack of self respect that games can be proud of today.<br/><br/>* ARMAGAD (also Tetrageddon Games) contains one cat picture.<br/><br/>* ARMAGAD (also Tetrageddon Games) features a strong frog presence, without being Frog Fractions II, III or IV. This promotes diversity in frog entertainment, as a whole. Although, for the record, FFV had nothing to do with frogs therefore we don't see cause for comparison. Thank you for understanding.<br/><br/>* If you play ARMAGAD (also Tetrageddon Games) you will be more appreciative of the nice things in your life.<br/><br/>* Frames mixed with HTML5 (this is both morally reprehensible and kinda edgy)<br/><br/>Note: This is a professional game made by a professional from a very professional background. No drugs where used in the making of this game.<br/><br/>Photosynthesis warning: Photosynthsensisitive individuals should not play this game.<br/><br/>Allergy warning: Contains 1 cat.gif<br/><br/>Alert: Proceeds from ARMAGAD (also Tetrageddon Games) go to funding the next game from this developer. Thank you for your support, weirdo.", "metacritic": null, "released": "2016-05-11", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/games/f9d/f9d015877594de91d0dcf3c082570a43.jpg", "website": "http://tetrageddon.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 270, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "macOS"], "developers": ["alienmelon"], "genres": [], "publishers": [], "esrb_rating": null}