{"id": 584593, "slug": "battle-of-sycotle", "name": "Battle Of Sycotle", "name_original": "Battle Of Sycotle", "description": "<p>In the year 2021, Scientists from Earth spotted a planet far away from Earth named Sycotle. They sent a team to do some research on the planet. While on the planet, their spaceship broke down and the aliens had captured them. The humans couldn't send any information back to earth, hence they were completely stuck in Sycotle. After a few years of fighting and losing against the Aliens, the humans laid low and did some research and made their own weapons, and were finally able to battle against the Aliens.</p>\n<p>In this game, the objective is to use this army to defeat the alien army.</p>\n<p>Instructions: </p>\n<p>Click on the type of troop you want and click on a spawn point to deploy the selected troop.</p>\n<p>You will have four types of troops: Light, Heavy, Tank, Sniper each containing different characteristics.</p>\n<p>Courage bar: There is an UI sprite on the bottom left, which is a metric of your army's courage to fight. It lowers when one of your troops dies and it increases when one member of the alien's army dies.</p>\n<p>Courage cost: This is the cost to deploy your troops,</p>\n<ol><li>20- Light </li><li>30- Heavy</li><li>40- Tank</li><li>50- Sniper</li></ol>\n<p>This cost will also be the amount of courage that decreases in the Courage bar.</p>\n<p>If the alien's army gets to your troops base and takes it down, you will lose the battle.</p>\n<p>If you can get through the waves of alien's army, you will win the battle.</p>\n<p>This is just a prototype! Bug fixes, Visual updates and additional gameplay features will be implemented soon. :) </p>", "metacritic": null, "released": "2021-04-05", "tba": false, "updated": "2021-04-13T04:57:52", "background_image": "https://media.rawg.io/media/screenshots/aec/aec98c86d0fdddddc19bf33993907867.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 17, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Daniel Ebenezer", "Logesh G"], "genres": ["RPG", "Strategy"], "publishers": [], "esrb_rating": null}