{"id": 584696, "slug": "the-last-beacon-lophee", "name": "The Last Beacon (Lophee)", "name_original": "The Last Beacon (Lophee)", "description": "<p>The last beacon is a project I made for my participation in the Untitled Game Jam #46 with the theme Darkness!</p>\n\r\nDescription\r\n<p>You slept for 17 years. The old man that took care of you tells you the story of the battles that got you into the weakened state you're in. It was a fierce battle between light and dark that turned out bad for both sides. You must go on a journey to regain your strength and restore light in the world.</p>\n<p>You control yourself and a light which in return guides you through the darkness. Destroy evil creatures and dodge contraptions of darkness while maneuvering through a platformer world, get stronger and banish the darkness!</p>\n\r\nFeedback\r\n<p>I would love to hear what you think! Either comment here or message me on Discord (Lophee#4625) if you want. Don't be shy, feedback is always welcome :)\r\n</p>\n\r\nKnown Issues\r\n<p>There is no way to reset a level currently, so if you miss some of your shots, some levels may become exponentially harder (maybe even impossible, not tested, more in Developer Notes).</p>\n<p>Sometimes, when respawning inside of terrain, the player transforms really weird before actually respawning, but thats not gamebreaking.</p>\n<p>When moving the mouse in the same directions as a returning projectile, they are sometimes not being caught.</p>\n<p>Let me know if you find any bugs!</p>\n\r\nDeveloper Notes\r\n<p>After I had a blast working on my first game jam entry ever, I decided to participate in another one. I had previously started experimenting with 2D-Lights and wanted to continue where I left off, so the theme Darkness was just perfect. With what I thought would be a weeks time on my hand, I primarily wanted to just experiment and learn a little. In the end I had much less time than anticipated, so I had to cut down on some major parts of the original idea and then some. That’s also the reason why I basically didn’t do any testing and bughunting. Still, for the little time I had, I think the result is not half bad.</p>\n\n\r\nLegal stuff\r\n<p>All assets in this game are either free to use, already owned by me or made by myself. No copyright infrignement or any sort of violation intended. Should I have somehow missed any details, failed to mention any creators or used anything without permission, please contact me and I will sort it out ASAP.\r\n</p>", "metacritic": null, "released": "2021-04-05", "tba": false, "updated": "2021-04-13T05:28:12", "background_image": "https://media.rawg.io/media/screenshots/ccf/ccf311a4fd8e38f3e92bcb9bbf1efc2d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 40, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Lophee"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}