{"id": 584785, "slug": "1-button", "name": "1 Button", "name_original": "1 Button", "description": "Welcome to <em>1 Button</em>,\r\n<p>where the goal is to press as many \"1\" buttons as possible in 1 minute! Messing up resets your score and timer.</p>\n<p>While I tried to put instructions in the game itself, their brevity made them hard to understand. Just imagine this text here is the manual booklet that came with your retro game.</p>\r\nMouse/touchscreen controls\r\n<p>Simply click/tap the \"1\" button.</p>\n<p>Click or tap to start.</p>\r\nKeyboard controls\r\n<p>Press the key on your numpad that corresponds with where the \"1\" button is.  For example, if the \"1\" button is at the top-left, press the top-left key on your numpad (7). Make sure numlock is on.</p>\n<p>If you don't have a numpad and your laptop doesn't have a numlock key, you can still use other keys as a makeshift numpad ─ either 789 UIO JKL or 234 WER SDF. I find this awkward and would not recommend it.</p>\n<p>Press any numpad or makeshift numpad key to start. If this doesn't work, click the game to focus it.</p>\r\nThe game screen\r\n<ul><li>The left number at the top is your current score.</li><li>The right number is your high score.</li><li>The bar running down the right of the screen is your time remaining.</li></ul>\r\nOther info\r\n<p>The full screen button at the bottom-right of the game window on PC is an Itch.io thing, so let's just accept the fact that isn't 1-bit.<br/></p>\n<p>If enough people send me their scores (James on Discord), I'm happy to set up a leaderboard section here. Would be cool to see a video if you break the 100 mark.</p>\n<p>Have fun!</p>", "metacritic": null, "released": "2021-04-04", "tba": false, "updated": "2021-04-13T05:54:12", "background_image": "https://media.rawg.io/media/screenshots/d71/d71e478fe2b05984f03e15109d44e212.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 4, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["James"], "genres": ["Action"], "publishers": [], "esrb_rating": null}