{"id": 584731, "slug": "meteo-strike", "name": "Meteo Strike", "name_original": "Meteo Strike", "description": "<p>ENGLISH</p>\n<p>Meteo Strike is a project created for <em>Gamecodeur </em>Gamejam # 31, on the \"Weather\" theme.</p>\n<p>You fly a rescue helicopter right in the middle of an area where the weather won't be your friend, most of the time. Bring civilians back to safety aboard your ship and bring water to drought-stricken cities. Also, beware of storms ...</p>\n<p>As the name suggests, I was strongly inspired by the gameplay of the Strike series (Desert, Jungle, Urban ...), in particular trying to get as close as possible to the sensations when piloting the helicopter. Just like in this series, we can carry resources (here, water tanks) and save civilians.</p>\n<p>You will therefore have to complete objectives in order to successfully achieve your mission, some of which are optional.</p>\n<p>Hope you'll have fun playing Meteo Strike!</p>\n<p>--------------------------------------------------------------------------------</p>\n<p>FRANÇAIS</p>\n<p>Meteo Strike est un projet réalisé pour la Gamecodeur Gamejam #31, sur le thème \"Météo\".</p>\n<p>Vous pilotez un hélicoptère de secours au beau milieu d'une zone où le climat ne sera pas votre allié, la plupart du temps. Ramenez les civils en lieu sûr, à bord de votre navire, et apporter de l'eau aux cités en proie à la sécheresse. Gare aux tempêtes...</p>\n<p>Comme son nom l'indique, je me suis fortement inspiré du gameplay de la série des Strike (Desert, Jungle, Urban...), en essayant notamment de me rapprocher au plus près des sensations lorsqu'on pilotait l'hélico. Tout comme dans cette série, on peut tracter des ressources (ici, des réserves d'eau) et sauver des civils.</p>\n<p>Vous aurez donc à remplir des objectifs afin de mener à bien votre mission, dont certains d'entre eux sont optionnels.</p>\n<p>J'espère que vous vous amuserez en jouant à <strong>Meteo Strike</strong> !</p>", "metacritic": null, "released": "2021-04-04", "tba": false, "updated": "2021-04-13T05:38:19", "background_image": "https://media.rawg.io/media/screenshots/e10/e1052506e84ba3f74c67321018168344.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 80, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Android"], "developers": ["Lysenti"], "genres": ["Action"], "publishers": [], "esrb_rating": null}