{"id": 584855, "slug": "gluttony-extra-vegan-edition", "name": "Gluttony: EXTRA Vegan Edition", "name_original": "Gluttony: EXTRA Vegan Edition", "description": "<p><strong><strong>GLUTTONY</strong>: <em>EXTRA Vegan Edition</em> </strong>- <em>COW MILK IS MEANT FOR COW BABIES!</em>\n</p>\n<p>You BETTER not eat meat and dairy or you WILL disgrace yourself! Avoid  gluten like the plague and aim for healthier options like Brussels  sprouts and carrots to earn points and achieve immortality. \r\n </p>\n<p>Worst case scenario you’ll have a great time playing this game and  best case you’ll finally drop those hard-to-shake inhumane habits of  yours and change your life for the better. Either way this game will  prove a net plus for your life.\r\n </p>\n<p>This is a hyper casual endless game where you have to collect (eat)  vegetables and avoid non-vegan junk food, with a progressively increasing difficulty.\r\n </p>\n<p><em>This is meant to be an offiline, hyper-casual, mobile  game, designed to kill your time so expect the dimensions to resemble a  phone (in full 4K). For the full mobile experience you can download the  app on Google Play: https://play.google.com/store/apps/details?id=com.panteliskassotis.gluttonyvegan</em>\n</p>\n<p><strong>PC Controls</strong>:   </p>\n<ul><li>Arrows or WASD - Moving \r\n</li><li>Mouse - Menu interactions \r\n</li><li>Alt+Enter - Toggle fullscreend\r\n</li><li>Escape - Exit game\r\n</li></ul>\n<p> <em>Please note that the game price allows us to keep the experience free of ads and microtransactions. Pay once, keep it forever. The way it used to be.  We even added some extra content to show our appreciation. The mobile version of the game on Google Play (iOS coming soon) is free of charge!<br/></em></p>\n<p><em>Be sure to check out \"<strong>GLUTTONY: Vanilla Edition\"</strong> for Android, Windows, Linux and macOS!</em></p>", "metacritic": null, "released": "2021-04-04", "tba": false, "updated": "2021-04-13T06:14:15", "background_image": "https://media.rawg.io/media/screenshots/37b/37bfb22d2303f711c373598375bce32f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 16, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Android"], "developers": ["TETHORAX"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}