{"id": 585135, "slug": "get-money-jokehboy", "name": "Get money (jokehboy)", "name_original": "Get money (jokehboy)", "description": "<p>Get money is an incremental game where you spend money to make money.</p>\n<p><strong>A game first and a study second (read on for more info).</strong></p>\n<p>This game was created for my honours project (links below). I wanted to create a study that wasn't as boring as forcing people to fill in a questionnaire and then making them play something that is very clearly a hastily put together prototype made to answer a question. <strong>So I made this, it's a game first and a study second. And by complete accident, I created something that allows anyone to take part in my research.</strong></p>\n<p> If you want to help me in my study, please download the game and play it for as long as you want. </p>\n<p><strong>If you just want to play the game as an incremental game, then by all means opt out from the settings menu. </strong></p>\n<p><em>The next part is just so that I don't get sent to jail.</em></p>\n\n<p><strong>By downloading and playing this game, you are agreeing to take part in a study.  By taking part in this study, you agree to have gameplay based analytical data collected. If you want more information, or do not want to take part in the study, please go to the settings section of the game and select the opt out option.</strong></p>\n<p>https://github.com/jokehboy/Incremental-Honours-game/blob/main/README.md<br/><strong>If you want to update to a new version, simply export your save data from the settings and import it into the new version</strong></p>", "metacritic": null, "released": "2021-04-04", "tba": false, "updated": "2021-04-13T07:37:56", "background_image": "https://media.rawg.io/media/screenshots/d16/d16058a56f44fef694e3c185d07b7f46.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 6, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Android"], "developers": ["jokehboy"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}