{"id": 585143, "slug": "freebooter-of-splorr", "name": "Freebooter of SPLORR!!", "name_original": "Freebooter of SPLORR!!", "description": "Freebooter of SPLORR!! is a minimalist dungeon crawler where you take the role of the freebooter.  A freebooter is a \"lawless adventurer\". SPLORR!! is a rough place.<br/>\n<br/>\r\nAfter an all night binge drinking session, you awaken in a dungeon maze filled with monsters.  But at least you still have yer trousers.<br/>\n<br/>\r\nIn order to leave this dungeon, you will need to combat all of its denizens. These can be anything from the introductory Evil Bat all the way up to the might Wyvern.<br/>\n<br/>\r\nIs this dungeon maze real, or is it all in yer head? I leave that to the interpretation of the player.<br/>\n<br/>\r\nTo combat the monster, be they real or imagined, it is not a matter of melee prowess, but a matter of... successfully predicting whether the next card drawn will be higher or lower than the previous.<br/>\n<br/>\r\nAlong the way, you'll get hungry. You'll need food. You will need courage and alertness in order to better combat yer foes!<br/>\n<br/>\r\nFortunately, the dungeon is filled with helpful items like beer and wine, to help you be courageous. Coffee to help keep you alert.<br/>\n<br/>\r\nAnd above all else, there are Jools Galore!<br/>\n<br/>\r\nDefeat all of the enemies, and emerge victoriously with your hard-won Jools!<br/>\n<br/>\r\nGet defeated, and the grim reaper will mock you.<br/>\n<br/>\r\nIn either case, try to keep yer trousers on, and for all our sakes, try not to soil them!", "metacritic": null, "released": "2021-04-04", "tba": false, "updated": "2021-07-02T03:41:11", "background_image": "https://media.rawg.io/media/screenshots/d9b/d9b78db41df0230481fd1a2584bd3a62.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 79, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["The Grumpy GameDev", "TheGrumpyGameDev"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["TheGrumpyGameDev"], "esrb_rating": null}