{"id": 585512, "slug": "the-campsite-guillem-espias", "name": "The Campsite (Guillem Espias)", "name_original": "The Campsite (Guillem Espias)", "description": "<p>The Campsite is a short point-and-click adventure game in development, inspired and crafted in the style of the early classics of the genre. It aims to bring you the vibes of those times in a small and casual format, while it's being designed to be a game that makes sense today.</p>\n<p>If you are a fan of this genre, but you never find time to play, this might be what you are looking for. With about 30 minutes of gameplay, a simplified UI, a balanced level of difficulty and the absence of dialogue trees, The Campsite is a game that can be played anytime, alone or in company, and suitable for all ages.</p>\n<p>If you are new to the genre, this might be your game too. It has the perfect format to get started, and perhaps, you will get a spark of that magic that makes this genre so especial, and arouse your interest.</p>\r\nCurrent state\r\n\n<p>The release of the game is expected by the second half of 2021. While the game is being developed, I wanted to share with you the prototype I've been using in order to proof-test the concept, so you can give it a try before the final version is released. Most of the art and music you'll find on this version is provisional and will be completely renewed. However, you will get the mood of the game on this prototype, and you'll be able to play it from beginning to end and solve most of the puzzles you'll find in the final version.</p>\r\nCredits\r\n<p><strong>Game Design:</strong> Guillem Espias\r\n<br/><strong>Engine:</strong> Unity, Adventure Creator\r\n<br/><strong>Sound FX:</strong> Freesound, BBC Sound Effects\r\n<br/><strong>Music: </strong>Free-stock-music\n<br/>Mirage, <em>Hyden Folker</em>\n<br/>Lurking Sloth, <em>Alexander Nakarada</em>\n</p>\n<p>I hope you enjoy it! And please, feel free to reach me out for any questions or feedback, it will be very appreciated! :)</p>\n<p><strong>Contact:</strong> Website, Twitter, Discord, Patreon</p>", "metacritic": null, "released": "2021-04-03", "tba": false, "updated": "2021-04-13T09:30:44", "background_image": "https://media.rawg.io/media/screenshots/ac7/ac774c61a24d31aed1bf0a9d4e3f51e2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 108, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Guillem Espias"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}