{"id": 585578, "slug": "tea-minus", "name": "Tea Minus", "name_original": "Tea Minus", "description": "<p><strong>CTRL is supposed to skip, although due to a bug the speed isn't much different than normal. It's also only like 10 minutes long though :)<br/></strong></p>\n<p><strong>-------------------------------------------------------------------</strong></p>\n<p><strong>Story<br/></strong></p>\n<p>The story mainly follows Eira, the one running the tea house, although it's constructed more like a bar than anything. A few different customers wander in throughout the story, all with their own share of interests/problems. There may even be something linking them...<br/></p>\n<p><strong>-------------------------------------------------------------------</strong><br/></p>\n<p><strong>Development</strong><br/>This was a solo effort, and also my first time writing anything outside of engineering reports and code haha, so it is probably nothing special. It is also very short, probably not much more than 10 minutes. Lots of things I would've liked to do, but the month of the jam was a busy one.<br/><br/>The VN was created using Ink and Unity. A very nice asset exists allowing interaction between the two, but I still had to create the VN framework on the Unity side, so it's quite incomplete. A good start though.<br/><br/>To make up a bit for my lack of artistry I enlisted the use of AbundantMusic to help create the tunes, as well as Artbreeder to get some base character designs that I worked off of. <br/></p>", "metacritic": null, "released": "2021-04-03", "tba": false, "updated": "2021-04-13T09:49:23", "background_image": "https://media.rawg.io/media/screenshots/6b6/6b64b221d5b14311bf8b5830d9309c49.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 19, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["Tsunscreen"], "genres": [], "publishers": [], "esrb_rating": null}