{"id": 58566, "slug": "g30-a-memory-maze", "name": "G30 – A Memory Maze", "name_original": "G30 – A Memory Maze", "description": "G30 – A Memory Maze is a unique and minimalistic take on the puzzle genre, where each level is hand-crafted and meaningful. It’s a story of a person with a cognitive disorder, who is trying to recollect the elusive past – before the disease takes over and everything will fade away.\r\n<br/><br/>\r\nHow would you feel, if you couldn’t recognise your life, your loved ones and even yourself? Could you find a light in the dark maze of human consciousness? Could you remember the story?\r\n<br/><br/>\r\nINNOVATIVE PUZZLES THAT ARE THE STORY\r\n<br/><br/>\r\nEach level sparks a little memory of the person’s life. It’s a two-part puzzle: a visual image of the memory and a telescopic text, that reveals itself with every step. You start with fragmented pieces of the picture attached to dashed lines. Dragging them like strings, you move parts of the image to restore it. In turn telescopic text reacts to your every step – the closer you are to the solution, the more text unfolds. And if you're not moving in the right direction, the story piece too can drift away from the truth. You are indeed remembering – adding details to the memory and forming a clear picture.\r\n<br/><br/>\r\nRELAXING AND ATMOSPHERIC\r\n<br/><br/>\r\nThe game has a delightful relaxing flow with atmospheric music and haptic feedback - all this helps you to dive into this compelling story even more. No scores, no timers, no \"game over\".\r\n<br/><br/>\r\nA DEEP AND MYSTERIOUS STORY\r\n<br/><br/>\r\nG30 is about memory and consciousness – and what they mean for a human being. There are people around who are losing their ability to remember – some kinds of mental diseases do that to a person. G30 shows how they see the world, how they feel about the past they can’t remember and the reality they can’t recognize.\r\n<br/><br/>\r\nAWARDS\r\n<br/><br/>\r\nThe “Most Innovative Game” award at both Casual Connect USA and Casual Connect Kyiv, “Best Mobile Game” and “Critics' Choice” at GTP Indie Cup, “GDC Special Award” and “Amazon Special Award” at Get IT Conference.", "metacritic": null, "released": "2018-05-17", "tba": false, "updated": "2019-10-22T14:00:39", "background_image": "https://media.rawg.io/media/games/19d/19de1fe4d98060d901ecc738bb63940e.jpg", "website": "http://g30game.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 2, "platforms": ["iOS"], "developers": [], "genres": ["Puzzle"], "publishers": [], "esrb_rating": "Everyone 10+"}