{"id": 5856, "slug": "aqua-moto-racing-2", "name": "Aqua Moto Racing 2", "name_original": "Aqua Moto Racing 2", "description": "Dohi Entertainment is proud to present the sequel to it's widely popular and critically acclaimed Aqua Moto Racing.<br/><br/>Aqua Moto Racing 2 offers great water racing with some of the best graphics seen on the iPhone platform. With state of the art wave physics this game truly has to be seen to be believed.<br/><br/>Race in exotic world locations with amazing details set in the Tropics, Greece and Egypt. Start earning cash by participating in races and winning Championships and spend them on better JetSkis. Unlock new Championhips and Achievements on your quest for Legendary Status.<br/><br/>Perform insane Stunts and round buoys to charge your Turbo to get the edge against your Opponents. Level up your Rider to a higher Rank by beating set target times and unlocking Medals and winning Championships. Connect to OpenFeint to challenge and compare your race results with friends all over the world.<br/><br/>Get Ready For The Splashdown Of Your Life!<br/><br/><br/>Key Features: <br/><br/>- Next-Gen Graphics with Dynamic Waves<br/>- Enjoy an Epic Career with 14 Championships<br/>- 6 Exotic Locations with different daylight<br/>- 48 challenging Courses<br/>- Perform gut-wrenching Stunts<br/>- Beat Target Times and unlock Medals<br/>- Collect Race Bonuses to buy new JetSkis<br/>- 10 Ranks for Rider to Level Up<br/>- 12 unique JetSkis<br/>- 25 Achievements<br/>- OpenFeint Leaderboards<br/>- OpenFeint Challenges<br/><br/>=====================================<br/><br/>AppSmile: \"Whether you were a fan of the first Aqua Moto Racing game or not, this game’s beautiful graphics, amazing controls, and competitive nature will leave you soaked and wanting more.\"<br/><br/>PocketGamer: \"Pumped and packed with action\" - \"Water here is a wild, untamed beast, feeling realistically fluid\"<br/><br/>iLounge: \"Aqua Moto Racing 2 comes closer to Wave Race 64 than most of the clones that have appeared over the years, and that’s really saying something.\"<br/><br/>AppSpy: \"Aqua Moto Racing 2 has upped the ante and fans of jet-ski racers need look no further than this excellent example of fun, adrenaline pumping aquatic mayhem.\"<br/><br/>CNET: \"Aqua Moto Racing 2 will appeal to anyone who likes unique racing games.\" - \"Am I crazy to say Aqua Moto Racing could ever touch the likes of Wave Race 64?\" <br/><br/>AppAdvice: \"What I love about this app is the actual gameplay: racing over waves, launching over ramps, twisting around buoys – it’s extremely enjoyable\" - \"All in all, it’s a brilliant game.\"<br/><br/>Appmodo: \"Aqua Moto Racing 2 is one app to grab!\" - \"The graphics and water motion are amazing and you can race over wakes &amp; swells in an arcade style of racing.\"<br/><br/>Touch Arcade: \"An Already Great Game Gets an Even Better Sequel\" - \"this sequel is getting even closer to Wave Race perfection\"<br/><br/>=====================================<br/>Follow us on Facebook<br/>Support, Promo Codes, Press Releases and Game Updates<br/><br/>http://www.facebook.com/pages/Aqua-Moto-Racing-2/117785711629891<br/><br/>For all our games, see:<br/>http://www.dohi.se/entertainment<br/>=====================================", "metacritic": null, "released": "2010-07-28", "tba": false, "updated": "2019-10-22T14:28:29", "background_image": "https://media.rawg.io/media/screenshots/532/532da02e1428d9cb54873d29ad5ffc90.jpg", "website": "http://www.dohi.se/entertainment", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 182, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Dohi Sweden"], "genres": ["Sports", "Racing"], "publishers": ["Dohi Sweden"], "esrb_rating": "Everyone 10+"}