{"id": 585738, "slug": "parahumans-srpg-fangame", "name": "Parahumans SRPG Fangame", "name_original": "Parahumans SRPG Fangame", "description": "<p>Fanmade prototype for the intro sequence of an SRPG based on the Webserial Worm and by Wildbow with outlines and inspirations used from the Worm SRPG concept.</p>\n<p> The WIP prototype so far mainly centers around the power generation system that pulls from a set of building blocks to form Skills, Manton benefits, Mutations into a single 'Power' for the character. So far some Shakers, Changers, Brutes, Strikers, and Blasters are available. Music with the exception of the Trigger theme was produced by Husr.</p>\n<p><strong>Sequence:</strong></p>\n<p>Build a character, go through the intro, attempt to fight off your attacker, trigger, gain your power, listen to the sick soundtrack, defeat your attacker, repeat.</p>\n<p><strong>Features:</strong></p>\n<p>Character creation sequence, power generation with a variety of elements, mutations, skins, skill mods, powered and non-powered skills, an enemy to fight, an initiative system, stats, surfaces and matter.</p>\n<p><strong>Gameplay Mechanics:</strong></p>\n<p><strong>Actions</strong></p>\n<p>Each combatant gets two actions they can take in a turn. Currently they can Move, Attack with their Basic Attack, Recover, Defend, or use a Powered skill, Social, or Action Skill.</p>\n<p><strong>Stats</strong></p>\n<p>Each of your base stats (Brawn, Dexterity, Athletics, Wits, Social, Knowledge, Guts) correspond and impact derived stats in small or major ways. For example the Strength Damage Mod derived stat is entirely based off of your Brawn base stat, while your Hitpoints are calculated by mainly Guts, with Dexterity and Brawn playing a role. For the sake of the prototype the most important stats are:</p>\n\n\n\n\n<p><strong>Status Effects</strong></p>\n<p>Usually affects the stats on a combatant with varying conditions for removal. Usually turn based. A status effects may be ranked in severity from I - III with Burn III being more impactful than Burn I for example. The arrows mark their disposition, positive or negative, towards the combatant.</p>\n\n<p><strong>Initiative</strong><br/></p>\n<p>The order in which combatants take their turns. Uses their Initiative scores in a rolling calculation that may see them taking multiple turns in a row with high enough Initiative compared to others.</p>\n\n<p><strong>Power Generation</strong></p>\n<p>A complete power is composed of Primary Skills, Secondary Skills, Manton Benefits and additional modifiers. Your power subtype (ex Etch Striker) determines which Skills you get among a few other things like how many Manton benefits and certain secondary passives. Skills are composed of mods that change how they function which are derived from elements (Flame, Spark, Glacier, Winter, Tidal in this case) or Skins (Beetle, Bat). Manton benefits are derived from the same element that gets chosen and express themselves as passives and general buffs. Secondary skills are usually derived from Supertypes or from mods as subskills of a primary skill. Supertypes are meant to add additional twist to the power like adding secondary passives, skills or throwing in some weird mods into the mix that change up how the skill or power functions gameplay wise.</p>\n<p><strong>Helpful Play Tips:</strong></p>\n<p>Clicking on your portrait on the bottom left centers the camera on your combatant.</p>\n<p>Right clicking while casting a skill ends the cast mode for that skill.</p>\n<p>Right clicking while highlighting over a combatant locks their information panel on the right hand side of the screen. Resets when you hover over another combatant.</p>\n<p>Arrow keys to move the camera.</p>\n<p><strong>Notes:</strong><br/></p>\n<p>Mac &amp; Linux builds are being weird but they're WIP</p>", "metacritic": null, "released": "2021-04-02", "tba": false, "updated": "2021-04-13T10:33:35", "background_image": "https://media.rawg.io/media/screenshots/b62/b6201a85ddbea2676ad16f0c00a0fdb6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 154, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ShadowsOptional"], "genres": ["Action", "RPG", "Strategy"], "publishers": [], "esrb_rating": null}