{"id": 585970, "slug": "songpop-party", "name": "SongPop Part‪y‬", "name_original": "SongPop Part‪y‬", "description": "<p>Step up and prove your music knowledge with this fast-paced, competitive music-based trivia game.</p>\n<p>SongPop Party by Gameloft — Step up and prove your music knowledge with this fast-paced, competitive music-based trivia game. SongPop Party is the latest addition in the biggest music trivia franchise in the world with a huge catalog from cult classics to today&#39;s top hits, and hundreds of thousands of unlockable songs curated by genre, artists, decade, topics and more. Bringing music fans together around the globe, players can pit their knowledge against opponents online in the Arena mode based on their skill level and music preferences. Or jump into the new local and online multiplayer party mode where players can link up and compete with their friends and family to determine who is the best. Can you guess the song?</p>\n<p>Highlights</p>\n<p>Party: Challenge up to 8 friends and family online or locally in a music trivia frenzy. Only one champion will prevail!<br />\nArena: Test your music knowledge against other players. Who will be the winner?<br />\nSolo: Play against the game to discover new playlists and train to be the best.<br />\nFor all generations: Looking for a blast from the past or today’s greatest hits? SongPop Party has it all, from the 1960s to yesterday, everyone can play!<br />\nFun avatars to suit your music personality: Pop aficionado, EDM fan, or metalhead? Find your favorite avatar to tag along in all your challenges.</p>\n<p>Not a sing along… Or is it?: You know it’s gonna to happen, you won’t be able to help yourself!</p>\n<p>Dive into the world of Music Trivia with SongPop Party and become the ultimate music master!</p>", "metacritic": null, "released": "2021-04-02", "tba": false, "updated": "2021-04-13T11:42:03", "background_image": null, "website": "https://songpop-party.com/index.html", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Gameloft"], "genres": ["Casual"], "publishers": [], "esrb_rating": null}