{"id": 585910, "slug": "value-of-experience-vox", "name": "Value of Experience/ V.O.X.", "name_original": "Value of Experience/ V.O.X.", "description": "<strong>Greetings to the entire itch.io community!</strong>\n\n<p>We present you a prototype of the game under development with well-known rules, but with its own original feature.<br/></p>\n<p>The rules of our game are easy to learn, but in order to achieve mastery, you will have to spend a lot of time playing the game. Everyone knows the principle - \"Rock-paper-scissors\" - three mutually exclusive \"figures\". But in V.O.X. there is one significant difference - the \"pieces\" must be distributed in five slots, in any order, but no more than two identical ones per round. Thus, three identical \"figures\" cannot be placed on the playing field. Three pairs - five slots. One of the \"pieces\" will remain unplayed. It provides balance and brings an element of suspense to the game. After all, you never know what \"figures\" your opponent has filled in his slots with.</p>\n\n<strong><em>Scissors cut paper, paper covers rock, rock blunts scissors</em></strong>\n<p><strong><em>This version serves to test the gameplay and collect player feedback.</em></strong></p>\n<p>In the future the game will be transformed into something completely unlike the current build. We plan to add tournaments between players as a basic gameplay experience and visualize gameplay as a mech squad battle. </p>\n<p><strong><em>Leave your feedback and ideas in the comments on how you'd like to improve the game.</em></strong></p>", "metacritic": null, "released": "2021-04-02", "tba": false, "updated": "2021-04-13T11:26:54", "background_image": "https://media.rawg.io/media/screenshots/a4f/a4fd24deef504642ca7f7019d4957458.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 27, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["IKKI Games"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}