{"id": 585908, "slug": "sunny", "name": "Sunny", "name_original": "Sunny", "description": "<p>Aide Sunny à retrouver sa princesse Sunnie, évite le mauvais temps en chemin et récupère tous les soleils !</p>\n<p>- Elèves Premium de Gamecodeur : vesgames, Yoann, jhice, plusieurs années environ.</p>\n<p>- Langage et Framework utilisé : Lua/Defold</p>\n<p>- Code par jhice, Yoann, vesgames<br/>- Graphismes par vesgames<br/>- Musique originale composée par Yoann, sons glanés sur le net.</p>\n<p>- Utilisation de librairies et codes externes : base de platformer Defold modifiée.</p>\n<p>- Temps passé : approximativement entre 20 et 30 heures cumulées (peut-être plus).</p>\n<p>- Petit postmortem (avis sur le langage/framework utilisés, difficultés, succès, choix, bilan personnel rapide, etc...)\r\n</p>\n<p>jhice a choisi de travailler avec Defold (sur suggestion de Yoann) pour commencer un environnement tout prêt. Ce moteur demande une certaine rigueur pour bien l'appréhender sans faire n'importe quoi :D Yoann a pu donner quelques conseils sur Defold. L'objectif était de retranscrire l'idée d'origine proposée par vesgames. On a décidé de créer une team assez rapidement sur Discord après l'annonce de la jam. On est plutôt contents du résultat au vu du temps passé et surtout, la collaboration s'est très bien passée.</p>\n<p>Malgré tout le jeu pourrait être plus abouti, il n'y a que la pluie qui est un peu originale au niveau du gameplay. Etaient prévus le vent, les orages, pour varier les types d'ennemis.</p>\n<p>Le thème et les graphismes, proposés par vesgames, est plutôt plaisant et donne un côté enfantin au jeu, ce qui fait aussi son style.</p>\n<p>Yoann a composé la musique en s'inspirant du thème du jeu, d'où ce côté joyeux teinté d'une légère mélancolie.</p>\n<p>Améliorable sur ce proto :</p>\n<ul><li>gestion des collisions avec les plateformes en mouvement (le personnage glisse dessus et ne peut sauter en descente - car il ne touche pas toujours la plateforme).</li><li>un objectif clair pour le niveau : par ex. attraper tous les soleils du niveau, afin de libérer l'accès à la princesse Soleil.</li></ul>", "metacritic": null, "released": "2021-04-02", "tba": false, "updated": "2021-04-13T11:26:22", "background_image": "https://media.rawg.io/media/screenshots/95f/95f236f83b5ee827fe0231609e2e98e7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 4, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["vesgames", "jhice", "YoannClaude"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}