{"id": 585953, "slug": "solenars-edge-ii-aurora-of-the-seventh-dawn-itch", "name": "Solenars Edge II: Aurora of The Seventh Dawn (itch)", "name_original": "Solenars Edge II: Aurora of The Seventh Dawn (itch)", "description": "<p>This is the Steam store page: https://store.steampowered.com/app/1283810/Solenars_Edge_II_Aurora_of_The_Sevent...<br/></p>\n<p>https://store.steampowered.com/app/1371350/Solenars_Edge_II_Champions/</p>\n<p>Please check out the Steam store page for guides, tips and extra help.<br/></p>\n<p>Solenars Edge II: Aurora of The Seventh Dawn is the sequel to Solenars Edge Rebirth and takes place three years after the events of Solenars Edge: Afterstory.<br/> In Solenars Edge II: Aurora of The Seventh Dawn. <br/></p>\n<p>You take on the role of Thedo and Aionis as they struggle to solve the mystery of the connection between Alcornagia and Deminastia. Venture across familiar lands in Alcornagia as you play as Thedo and discover new ones as you traverse Deminastia for the first time in the series as Aionis.</p>\n<p> One soul trying to find his missing friends and another soul trying to find his way back home. Two lost souls with a mission to accomplish and a burning desire to accomplish their goal. Will you help guide them to their final destination or will they remain lost forever?</p>\n<p> Alcornagia Synopsis:<br/> </p>\n<p>Long ago, the Archieves (An originally created word for the type of enemy) attacked the world of Alcornagia and decimated around 80 percent of the population. Years later, King Thedo of Ternesta struggles to recover from the devastation from that day known as the \"Archieves Massacre\". <br/></p>\n<p>Though several of his friends had perished in front of his very eyes. There have been rumors of random disappearances seemingly related to that event. Thedo, convinced that some of his friends may still be alive, embarks on a quest alongside Yenta and Nerine to locate his missing friends and discover the mystery of Deminastia.<br/> </p>\n<p>Deminastia Synopsis:</p>\n<p> Aionis is a shy 17 year old homeless student who has no connections or friends. His father, Phyrith who was one of the chosen's group back in the battle for the Solenars Edge, was killed during the Archieves Massacre. Bound to a lonely dwelling within a cave, Aionis only eats at his run-down school on the week days and starves on the weekends. His life seemingly going nowhere until he stumbles upon a book called \"The Aurora of The Seventh Dawn\".</p>\n<p> Upon opening the book, Aionis is transported into another world named Deminastia. He is soon greeted by Solenia, a young Elven girl who is a bit of a prodigy and Atsumora, who was one of the heroes who was assumed dead. Aionis, at the suggestion of Solenia and Atsumora, enrolls in Nelditus Academy. An elitist school that practices the art of Raiken slaying. Raikens are horrific beasts that prey on the living mainly at night, and sometimes the day.</p>\n<p> Before Aionis can enroll, he is given a task by headmaster Inuzuka and must complete it before he can become a student. Balancing his daily school life, Raiken Slaying and his ongoing desire to return home. Aionis' life has suddenly turned upside down. Will he be able to accomplish his goal or will he end up trapped in Deminastia forever? Only you can find out.<br/> </p>\n<p>Features:<br/> -Engaging turn-based battle system similar to Estellium Legends.<br/> -Two world game-play that swaps between different main characters throughout the story.<br/> -A wonderful and profound soundtrack.<br/> -3 party member battles with the ability to swap party members in and out of combat.<br/> -A simple, yet diverse and unique character trait system.<br/> (Ex: Aionis can unlock and equip different outfits and Solenia can utilize event based summons).<br/> -Multiple skills and weapons to utilize.<br/> -Several Mini-Games to play and areas to explore.<br/> -Multiple secret bosses to discover and fight to unlock rare rewards, extra Kacha and exp! (Each boss comes with their own unique battle theme).<br/> -A heart-touching story that spans between two worlds.</p>\n<p>SE II: Champions :<br/></p>\n\n<p>Create your character, pick your ally and assemble a powerful team of over 70 champions. Fight your way through the VR Arena and become the greatest champion of the entire universe.</p>\n\n<p>Solenars Edge II: Champions is a team-based Arena JRPG that features many playable characters throughout the Solenars Edge series.<br/> In Solenars Edge II: Champions you will pick or create your character, grab an ally and assemble a team from over 70 characters.<br/> Buy, fight, unlock, gear up, train and work your way up through the VR Arena to become the greatest Champion in all of the universe.<br/> -Features-<br/> -4 party member combat with the ability to swap between many characters in and out of battle.<br/> -Many Items, Weapons, Armors, Characters Etc to utilize.<br/> -Lots of goodies and hidden gems.</p>", "metacritic": null, "released": "2021-04-02", "tba": false, "updated": "2021-04-13T11:38:24", "background_image": "https://media.rawg.io/media/screenshots/669/669fd9590fa6192d2b7ecaa2cc721a89.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 436, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Team Syukino"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}