{"id": 585968, "slug": "the-diygame", "name": "The DIYGame", "name_original": "The DIYGame", "description": "<p>The DIYGame is an ambitious undertaking. A revolutionary game about making games, it aims to make game design accessible to anyone and everyone. Balancing a meta plot about a struggling game designer, pressured from society at all sides, with fun and interactive mechanics allowing you to design your own games, this game is a true once in a generation experience. It is both easy to learn and complex enough to build any kind of game imaginable. It has both the capabilities to make a masterpiece on the level of Sneak King, the greatest game of all time, as well a shitpost for April Fools day. </p>\n<p>Armed with nothing more than this, you too can finally create the game of your dreams!</p>\n<p>Don't believe me? See what my playtesters had to say about it:</p>\n<ul><li>\"A true work of art. 5 Games out of 4. Worth every penny. Even though it was free.\" - Cahatstrophe</li><li>\"Magnificent. Within a week, I had successfully built an amazing game, I think, I mean I was high for most of it and this \"amazing game\" appears to actually be a frog\" - Cahatstrophe in a fake mustache</li><li>\"She gave me 5 bucks to say something nice about this, you know\" - Cahatstrophe with Groucho Marx Glasses on</li><li>\"DOWNLOAD THIS NOW\" - Cahatstrophe hiding behind a newspaper</li><li>\"This game saved my marriage, and my relationship with my girlfriend\" - Two Cahatstrophes stacked on top of each other wearing a trenchcoat</li></ul>\n<p>Download now and start making memes games already!<br/></p>", "metacritic": null, "released": "2021-04-02", "tba": false, "updated": "2021-04-13T11:41:58", "background_image": "https://media.rawg.io/media/screenshots/8b7/8b710c31e96b81d3ede9d8cb774b5be0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 4, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Cahatstrophe Games"], "genres": [], "publishers": [], "esrb_rating": null}