{"id": 586081, "slug": "shadow-dreams", "name": "Shadow Dreams", "name_original": "Shadow Dreams", "description": "Developed by Khosouf Studio in Abu Dhabi- United Arab Emirates, A very ambitious project, inspired by real life, that took 5 years to be made, \"Shadow Dreams: The last thought of Hope \"is a magic based first person shooter, with a psychological take on the story. <br/>\n<br/>\n<br/>\r\nSTORY: <br/>\r\nin every one's life, comes a point where the stress is too much to bear, where you see no point in living and you decide to end it all...<br/>\r\nat that exact moment, one last thought of hope is born in your mind, embarking on a journey to restore the balance to your world, facing the ruthless monsters of your own creation,  and wielding your emotions as magical weapons to fend against the beasts of your conscious and sub conscious.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\r\nKEY FEATURES:<br/>\n<br/>\r\nDynamic Magic System<br/>\r\n6 Elements (Fire, Ice, Light, Lightning, Life, Death)<br/>\r\nA Complex yet intuitive magic system, where you upgrade, mix and match between the elements to find the spells that fit your play style.<br/>\n<br/>\r\nVariety of lands to explore<br/>\r\nEach kingdom has a different theme, with different  monsters, traps and challenges to overcome.<br/>\n<br/>\r\nChallenging boss fights<br/>\r\nEach kingdom is ruled by a knight that represents the pure untamed emotion, each boss was programmed with the utmost care to challenge you in very creative ways<br/>\n<br/>\r\nA touch of Open world exploration<br/>\r\nMorph into your spirit animal and take flight in the open world area where you transverse between the 6 kingdoms.<br/>\n<br/>\r\nPhysiologically inspired story<br/>\r\nExplore the emotions, feelings and thoughts of the king and learn from their wisdom.", "metacritic": null, "released": null, "tba": false, "updated": "2021-04-16T02:39:25", "background_image": "https://media.rawg.io/media/screenshots/098/098f65ebc9cbf27b0c0ffabd7eb3a18d.jpg", "website": "http://www.Khosouf.com/Shadow", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 337, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Khosouf Studio", "Ahmad Al-Natsheh"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Khosouf Studio"], "esrb_rating": null}