{"id": 586045, "slug": "beasts-of-maravilla-island", "name": "Beasts of Maravilla Island", "name_original": "Beasts of Maravilla Island", "description": "<p>Beasts of Maravilla Island is a 3D adventure game where you take on the role of a young wildlife photographer who traverses Maravilla Island&#39;s magical ecosystems to discover extraordinary creatures, learn their behaviors, and, most importantly, photograph their majesty!<br />\nThe protective magic of Maravilla Island is waning, and the only way to save it is to restore humanity&#39;s belief in the magical. Assume the role of Marina Montez, an aspiring wildlife photographer who is armed with her grandfather&#39;s journal of Maravilla and his camera. To save Maravilla Island, you must climb, explore, and solve puzzles with the island&#39;s flora and fauna to find and photograph its fabulous beasts.<br />\nYou&#39;ll also need to coax out their unique behaviors! Play with a rambunctious otter-crocodile. Be the wingman for a lovestruck bird-monkey. Discover the favorite hiding spots of birds disguised as bananas. Beasts of Maravilla Island is filled with enchanting opportunities to engage with creatures in unique, wholesome ways!<br />\nCapture your magic moments with majestic animals, and share Maravilla Island&#39;s magic with the world!</p>\n<p>Features:<br />\n50+ Unique Creatures, big and small, to engage with and photograph<br />\nExploration of 3 distinct ecological zones, each containing their own unique species!<br />\nEndless possibilities to photograph the game’s beautiful ecosystem.<br />\nPuzzles that emphasize interacting and cooperating with creatures and plant life</p>", "metacritic": null, "released": null, "tba": true, "updated": "2023-11-06T23:16:23", "background_image": "https://media.rawg.io/media/screenshots/a9e/a9e320d8d172f420c9eb19038bfa2010.jpg", "website": "https://www.beastsofmaravillaisland.com", "rating": 3.25, "rating_top": 4, "added_by_status": {"yet": 25, "owned": 156, "beaten": 7, "toplay": 10, "dropped": 3}, "playtime": 1, "achievements_count": 61, "ratings_count": 7, "suggestions_count": 432, "game_series_count": 0, "reviews_count": 8, "platforms": ["Nintendo Switch", "PlayStation 4", "PC", "Xbox One"], "developers": ["Banana Bird Studios"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Whitethorn Digital"], "esrb_rating": null}