{"id": 586128, "slug": "beachousex", "name": "BeacHouSeX", "name_original": "BeacHouSeX", "description": "<p>This experience supports both the Oculus Rift and HTC Vive as well as Oculus Quests 1 &amp; 2 via ALVR<br />\nFinally, The BeachHouSeX, a Virtual Reality Sex Simulation game is here!<br />\nThis is our first collaboration with Japanese MMD modeler &quot;Kakomiki&quot;.<br />\nIn this scene, his lovely AB4 model makes it&#39;s appearance!<br />\nImagine, you have spent a beautiful afternoon by the beach alone. You head back to your house and hear a knock at the door. Who could it be? You open the door and the first thing you see is are those amazing eyes. She looks at you and says she is AB4. It&#39;s time to change room towels. She looks at you and you can see the burn of lust in her eyes. The towels will have to wait now!<br />\nIn this game, you enter a simulated sexual encounter and can control which acts are performed between you and the woman. She maintains eye contact the entire time and can handle different positions in the hotel room. You can even see yourself on a monitor from within the room. You can modify her look as detailed below and control when you want your happy ending.<br />\nThis game can be played without HMD as well.<br />\nGame Controls:<br />\nOculus Rift &amp; 2D:<br />\n1-2-3-4-5 or mouse scroll wheel - Change location in room<br />\nM – Pause the simulation<br />\nN or middle mouse button – switch pubic hair on/off<br />\nSPACE or left mouse button – Happy end<br />\nF12 or right mouse button – Reset HMD position<br />\nHTC Vive:<br />\nTouchpad right side - Scene up<br />\nTouchpad left side - Scene down<br />\nGrip – Reset HMD position<br />\nTrigger – Happy end<br />\nOther controls:<br />\nM - Pause the simulation<br />\nN or middle mouse button – switch pubic hair on/off<br />\nKeyboard and Mouse can work. Some users find it best to map the 5 key to the X button.</p>", "metacritic": null, "released": "2021-04-14", "tba": false, "updated": "2021-04-27T11:36:05", "background_image": "https://media.rawg.io/media/games/65d/65d310cbfa348d9143819e22e825b74c.jpg", "website": "https://beta.imaginevr.io/product/3258985113", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 274, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Citor3 Entertainment Studio"], "genres": ["Simulation"], "publishers": ["ImagineVR"], "esrb_rating": null}