{"id": 586236, "slug": "dirt-bike-motocross-trials-3d", "name": "Dirt Bike Motocross Trials 3D", "name_original": "Dirt Bike Motocross Trials 3D", "description": "A smooth race never made a skillful racer!<br/><br/>In this game Motorbike Offroad Rider you need to complete the racing challenge and arrive faster to the finish line to get higher scores and compare them with your friends. Choose your motorbike or dirt bike with a rider and prepare your mind for the extreme conditions and tough tracks. It’s not easy to compete strong opponent who are mentally prepared to beat you. Now accelerate your bike until you have reached to the finished line and try to avoid the hurdles and obstacles in this motorbike racing.<br/><br/>Just follow the bike racing rules and prove your trail bike racing skills. In this bike rider challenge game you will experience the next level of high-speed moto racing simulation game play. Swing your motocross wheels, chin up your heads, put down your egos on the ground and ride to the off roads as insane to get first position. love to race on a dirt bike, trail bike and motorbike to show their driving skills to their friends. This is the ultimate and unlimited fun racing game you as a kid have ever played.<br/><br/><br/>Game Features:<br/>CHOOSE from the wide variety of motorbikes.<br/>RACE and compete with the opponent and complete the laps as fast as you can to maintain the top position.<br/>DRIVE with your extreme motocross stunts on a dangerous offroads and hilly mountains.<br/>EXPLORE all the skid marks of wheels on the offroad tracks with different laps.<br/>AVOID colliding the opponent motorbikes because it can slow you down in this dangerous offroad racing games.<br/>MASTER your motorbike driving skills while racing in this bike race games.", "metacritic": null, "released": "2017-06-15", "tba": false, "updated": "2021-04-16T04:23:37", "background_image": "https://media.rawg.io/media/screenshots/089/0898bacdb33b644dd924613719e9f2cd_P2J6Ia0.jpg", "website": "http://metadort.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 136, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Meta Dort"], "genres": ["Simulation", "Racing"], "publishers": ["Meta Dort"], "esrb_rating": "Everyone 10+"}