{"id": 586226, "slug": "beam-of-magic-hit-and-run", "name": "Beam of Magic: Hit and Run", "name_original": "Beam of Magic: Hit and Run", "description": "Beam of Magic is a multiplayer RPG game in which you explore dungeons and open-world locations, destroy a bunch of enemies, and fight bosses. You can play this exciting RPG multiplayer alone or in an online co-op with friends.<br/><br/>Magic Shooter Features:<br/><br/>- Huge map – fight against hordes of enemies in PvE mode on big locations. We are updating maps all the time, making gameplay more diverse and keeping you on your toes.<br/><br/>- Monsters and beasts – learn how to defeat scary creatures living in the dungeons and deep inside the forest. There’s going to be more and more of them! If you are on your own, things might get desperate. Invite friends to join the magic adventure and get to know this arcade hunter together.<br/><br/>- Level-up system – level up your hero over the course of the game. Choose one of three random perks that will define your tactics in this exciting RPG adventure.<br/><br/>- Challenging bosses – enjoy all the advantages of this magic shooter. Destroy big bosses and get a massive reward.<br/><br/>- Online multiplayer  – play with other players or with your friends. Battle multiplayer mode can bring your gameplay to new heights! <br/><br/>Looking for dope roguelike games? Stop right now, you’ve just found the game you’ve been looking for! Try it out online!<br/><br/>Beam of Magic is a top-down age-of-knight adventure with a choice of 3 random skills per level up. As you progress through the map, you will discover several different sections with multiple bosses. Each location brings a new inventory and equipment. Stronger enemies will spice up your progress in this PvE shooter.<br/><br/>Killing monsters together with other players makes it more fun. Action-adventure games online like this won’t let you get bored. Ready to impress everyone with your skills? <br/><br/>Beam of Magic combines the best of fantasy games, magic RPG online, as well as dungeon games. Your way won’t be easy - follow it through multiple dungeons filled with monsters and treasure. <br/><br/>Join thousands of players who have already started playing Beam of Magic - one of the best magic games out there. We continue to work on the gameplay, adding new locations and levels to keep it nice and fun.<br/><br/>Do you like PvE online, multiplayers, battle simulators, or games similar to “Enter the Gungeon”? Try Beam of Magic today to add a new title to your list of favorite games!", "metacritic": null, "released": "2021-03-19", "tba": false, "updated": "2021-04-16T04:19:24", "background_image": "https://media.rawg.io/media/screenshots/468/4688b8d445c9e201df763064683c1110_U00qp3j.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 124, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Zillion Whales"], "genres": ["Action", "RPG"], "publishers": ["Zillion Whales"], "esrb_rating": "Everyone 10+"}