{"id": 586243, "slug": "puzzle-combat-match-3-rpg", "name": "Puzzle Combat: Match-3 RPG", "name_original": "Puzzle Combat: Match-3 RPG", "description": "Battle endless waves of enemies in this fast-paced puzzle RPG! Only the right moves will secure your survival. Use your brain to clear levels before the zombies attack.<br/><br/>Assemble your hero roster from hundreds of amazing characters. Equip your team with unique upgradeable weapons, go to battle against PVP opponents, bosses, and rival alliance clans in this thrilling story-based RPG.<br/><br/>Enter the world of PUZZLE COMBAT and experience these exciting features:<br/><br/>LEVEL UP YOUR TEAM OF HEROES<br/>Collect and level up awesome heroes like brawlers, warriors, droids, zombies and more. Summon hundreds of unique heroes with new exclusive heroes added every month! <br/><br/>JOIN AN ALLIANCE<br/>Play with friends and work together in massive 30 vs 30 PVP wars and PVE missions. Collaborate with your clan in epic boss fight raids to collect incredible loot.<br/><br/>CUSTOMIZE YOUR WEAPONS<br/>Discover and craft powerful unique weapons to build up your arsenal. Turn old into new by continually upgrading to maximize weapon stats.<br/><br/>DESIGN YOUR BASE<br/>Construct and upgrade buildings to train your recruits into heroes. Harvest food, mine metal, and craft critical battle items to survive. <br/><br/>TAKE PART IN LIMITED TIME EVENTS <br/>Compete in challenging weekly tournaments and monthly challenges for amazing rewards. Immerse yourself in fantastic worlds of apocalyptic raiders, cyberpunk explorers, lawless cowboys, and more. <br/><br/>ENGAGE IN PVP COMBAT<br/>Defeat real players in PVP battles to climb the leaderboards. Take revenge on your opponents for even better rewards.<br/><br/>COMPLETE THE STORY CAMPAIGN<br/>Battle your way through hordes of monsters, zombies and mutant beasts. Complete hundreds of levels on 3 difficulty modes or test your skill in zombie mode.<br/><br/>BATTLE PASS<br/>Complete daily tasks for great rewards from the Path of Valor. Achieve greater rewards the further you get!<br/><br/>Follow us: https://www.facebook.com/PuzzleCombat/", "metacritic": null, "released": "2021-04-06", "tba": false, "updated": "2021-04-16T04:26:51", "background_image": "https://media.rawg.io/media/screenshots/1b9/1b9447ca89bb67ab32536e1bf0125981.jpg", "website": "https://www.smallgiantgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 233, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Small Giant Games"], "genres": ["RPG", "Puzzle"], "publishers": ["Small Giant Games Oy"], "esrb_rating": "Teen"}