{"id": 586208, "slug": "f1-2021", "name": "F1 2021", "name_original": "F1 2021", "description": "<p>• The entire F1® 2021 game<br />\n• Braking Point Content Pack<br />\n• Celebrate the release of F1® 2021 with exclusive in-game items inspired by the fictional stars of the new ‘Braking Point’ story experience. Equip them to race as Devon Butler, Aiden Jackson, and Casper Akkerman: Character avatar | Car livery | Suit | Gloves | Helmet | Victory radio voices<br />\n• 5,000 PitCoin virtual currency to spend in-game<br />\nEvery story has a beginning in F1® 2021, the official videogame of the 2021 FIA FORMULA ONE WORLD CHAMPIONSHIP™. Enjoy the stunning new features of F1® 2021, including the thrilling story experience ‘Braking Point’, two-player Career, and get even closer to the grid with ‘Real-Season Start’. Take your team to the top in the acclaimed ten-year ‘My Team’ Career mode, or race head-to-head in split-screen and multiplayer. Immerse yourself in the greatest racing spectacle on the planet and race with the authentic lineup of twenty heroic drivers and ten iconic teams from the 2021 season:<br />\n- ‘Braking Point’ – the thrilling new story experience<br />\n- New ways to play: two-player Career and ‘Real-Season Start’<br />\n- Acclaimed ‘My Team’, split-screen and multiplayer<br />\n* Online connection required to download the final F1® teams’ 2021 cars, full-season circuit selection, content (as applicable) and F2™ 2021 season update.<br />\nONLINE CONNECTION REQUIRED TO DOWNLOAD THE FINAL F1® TEAMS’ 2021 CARS, FULL SEASON CIRCUIT SELECTION, CONTENT (AS APPLICABLE) AND F2™ 2021 SEASON UPDATE. ACCEPTANCE OF EA USER AGREEMENT (terms.ea.com) REQUIRED TO PLAY. EA&#39;S PRIVACY &amp; COOKIE POLICY APPLIES (privacy.ea.com). YOU CONSENT TO ANY PERSONAL DATA COLLECTED THROUGH YOUR USE OF EA’S SERVICES BEING TRANSFERRED TO THE UNITED STATES, AS FURTHER EXPLAINED IN THE PRIVACY &amp; COOKIE POLICY. EA MAY PROVIDE CERTAIN FREE INCREMENTAL CONTENT &amp;/OR UPDATES. MANDATORY CONTENT UPDATES MAY BE DOWNLOADED AUTOMATICALLY, REQUIRE ADDITIONAL STORAGE, INCUR BANDWIDTH USAGE FEES, &amp; REQUIRE AN ADDITIONAL PURCHASE TO ACCESS. EA MAY RETIRE ONLINE FEATURES AFTER 30 DAYS NOTICE POSTED ON ea.com/service-updates.<br />\nF1® 2021 Game - an official product of the FIA FORMULA ONE WORLD CHAMPIONSHIP. © 2021 Electronic Arts Inc. The F1 logo, F1, FORMULA 1 and related marks are trademarks of Formula One Licensing BV, a Formula 1 company. Licensed by Formula One World Championship Limited. The F2 FIA FORMULA 2 CHAMPIONSHIP logo, FORMULA 2, F2 and related marks are trademarks of the Federation Internationale de l’Automobile and used exclusively under licence.  All rights reserved.</p>", "metacritic": null, "released": "2021-07-16", "tba": false, "updated": "2024-03-09T11:05:28", "background_image": "https://media.rawg.io/media/games/882/8820b0bc5ec9c135aca22389d105b566.jpg", "website": "http://www.formula1game.com/", "rating": 3.73, "rating_top": 4, "added_by_status": {"yet": 17, "owned": 587, "beaten": 31, "toplay": 20, "dropped": 27, "playing": 13}, "playtime": 16, "achievements_count": 237, "ratings_count": 60, "suggestions_count": 83, "game_series_count": 0, "reviews_count": 60, "platforms": ["Xbox Series S/X", "PlayStation 5", "PlayStation 4", "PC", "Xbox One"], "developers": ["Codemasters"], "genres": ["Simulation", "Sports", "Racing"], "publishers": ["Electronic Arts", "EA SPORTS"], "esrb_rating": "Everyone"}