{"id": 586219, "slug": "dirt-bikes-craft-survival-shooting-motorcross-race", "name": "Dirt Bikes Craft Survival. Shooting Motorcross Race For Boys Free", "name_original": "Dirt Bikes Craft Survival. Shooting Motorcross Race For Boys Free", "description": "If you love the Dirt Bikes, pixel retro art and fast speed on two wheels this is the game you were been waiting for to have lots of fun!<br/><br/>Download the best shooting motorcycle pixel game for free now to feel like a true master driving in an adventure that you will never forget!<br/><br/>Drive as fast as you can and shoot to other vehicles. The best gun power, missiles and other armory is available in this amazing game. You have an amazing motorcycle; speed up on the road, jump, shoot and drive faster than never before.<br/><br/>Survive in this crazy fight of shooting war vehicles. All art is like mini crafted all pure pixel retro designed.<br/><br/>What are you waiting for download this game now!!!<br/><br/>Incredible Dirt Bikes Motorcycle<br/><br/>You will be surprised by the pixelated design of the game. as you climb your driving experience level until you are able to drive faster and with more power gun! This game is ideal for blocky games lovers!<br/><br/>The controls are very simple and intuitive so you will feel the game play very easy.<br/><br/>Features of Dirt Bikes Pixel Shooting Race<br/><br/>• Blocky Dirt Bike Motorcycles!<br/>• Incredible pixel and block graphics!<br/>• Extreme fast so you can speed up!<br/>• Very simple controls and intuitive design!<br/>• Best Leaderboards!<br/>• Endure Environment!<br/>• Cool and different missions!<br/>• Engaging Music!<br/><br/>Drive and live a unique experience by downloading this mini racing game. We are here for you so tell us what you think to keep improving the game. We will answer to all the comments!<br/><br/>Tell your friends and recommend them to play and challenge each other to see who the best driver in the world rankings table is!<br/><br/>Do You Have What It Takes To Be The Best Driver? <br/><br/>Follow us on Twitter: @bravocterogames<br/>Like us on Facebook: www.facebook.com/bravocterogames", "metacritic": null, "released": "2016-01-27", "tba": false, "updated": "2021-04-16T04:15:36", "background_image": "https://media.rawg.io/media/screenshots/424/424228eadda26b884e8fd39611bb52bf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 167, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["FREESTYLE GAMES"], "genres": ["Action"], "publishers": ["FREESTYLE GAMES"], "esrb_rating": "Everyone 10+"}