{"id": 586452, "slug": "spacetrash", "name": "SpaceTrash", "name_original": "SpaceTrash", "description": "<p><strong>Control</strong></p>\n<p>Use your finger or mouse. Just drag your finger (mouse) in different directions, as if you were controlling a joystick.</p>\n<p><strong>Helping the planet</strong></p>\n<p>The game deals with the topic of space debris. If you like the game, it would be great if you donate. Half of all the money raised will go towards saving the planet.</p>\n<p><strong>History</strong></p>\n<p>Hello everyone! My name is Mike and I am from Russia. Some time ago I was eager to create my own game, everyone creates, but why am I worse? And now I will tell you about how I created my first game.\r\n</p>\n\n<p>It is clear that first I needed a game development tool and, as you probably already guessed, I chose Unity. After downloading the engine, I needed an idea to start drawing graphics. The idea came to me pretty quickly, it was not revolutionary, it did not use mechanics that had not yet been created. The mechanics were already used by someone, but I adapted it a bit and came up with my own gameplay. We had an astronaut, and meteorites were flying at him, cool, right?\r\n</p>\n\n<p>Then I wrote the code for 2 minutes, then Google it for 2 hours and so on in a circle. As a result, the main mechanics of the game were ready.<br/></p>\r\n             <br/>\n<p>Then I decided that it would be cool if this game raises the problem of garbage (again) and decided to put this game on itch.io and collect donations, but not just donations, but half of which donates will go to clean up our planet, I think this is cool. If you care about the place where you live - play my game and donate, together we will make the planet cleaner!</p>", "metacritic": null, "released": "2021-04-15", "tba": false, "updated": "2021-04-16T05:26:35", "background_image": "https://media.rawg.io/media/screenshots/615/61573b59d66ddf5a34a0887376a03a1e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 37, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Lou Games"], "genres": ["Action"], "publishers": [], "esrb_rating": null}