{"id": 58654, "slug": "hitman-2", "name": "Hitman 2", "name_original": "Hitman 2", "description": "<p>Hitman 2 is the seventh game in its series. It is the sequel to Hitman and a prequel to all other entries of the franchise.</p>\n<h3>Plot</h3>\n<p>As with all Hitman series, the game follows Agent 47, a hitman for hire and a member of a secret assassins&#39; organization called International Contract Agency. His missions are tied together by a story that continues the plot of 2016&#39;s Hitman. The protagonist is searching for an anonymous opponent known as Shadow Client, who was also the main antagonist of the previous game. Hitman 2 also provides insight into Agent 47&#39;s mysterious past. The hunt for Shadow Client and his militia takes Agent 47 to new locations, such as a motor race on the sunny streets of Miami and a deadly tropical rainforest in Colombia.</p>\n<h3>Gameplay</h3>\n<p>As usual for Hitman series, the player controls Agent 47 from the third person view (switching to the first person when using sniper rifles) in a 3D environment. The game consists of several missions in which the protagonist has to assassinate various targets around the world using non-conventional tactics, stealth, and camouflage. Hitman 2 features an advanced crowd AI and an improved stealth system that allows the player to hide between the trees and in the crowd. The game also features new weapons, such as concussion gadgets that the player can use to knock people out.</p>\n<h3>Multiplayer</h3>\n<p>The game introduces a new mode called Sniper Assassin that allows the players to cooperate online.</p>", "metacritic": 83, "released": "2018-11-13", "tba": false, "updated": "2024-04-18T21:21:16", "background_image": "https://media.rawg.io/media/games/858/858c016de0cf7bc21a57dcc698a04a0c.jpg", "website": "https://hitman.com", "rating": 4.03, "rating_top": 4, "added_by_status": {"yet": 600, "owned": 5563, "beaten": 652, "toplay": 396, "dropped": 308, "playing": 126}, "playtime": 5, "achievements_count": 667, "ratings_count": 1186, "suggestions_count": 299, "game_series_count": 9, "reviews_count": 1195, "platforms": ["Xbox One", "PC", "PlayStation 4"], "developers": ["IO Interactive"], "genres": ["Action", "Shooter"], "publishers": ["Warner Bros. Interactive"], "esrb_rating": "Mature"}