{"id": 586545, "slug": "ayuda-mystery-adventure", "name": "AYUDA - Mystery Adventure", "name_original": "AYUDA - Mystery Adventure", "description": "<p>AYUDA is a first person point and click graphic puzzle adventure, similar to games you may have played in the ’90’s. A simple gameplay interface consisting of the world that you explore and an inventory panel where you can collect, combine and use items you find along the way to solve puzzles.</p>\n<p>Explore areas, collect hidden objects and take in your surroundings. You will need all of your puzzle solving skills to put together a plan to make your way through the island, solving riddles and down the many paths towards the secret treasure of AYUDA.</p>\n<p>How you tackle the puzzles is down to you. Each puzzle has a logical solution, so take your time, there is no rush and enjoy the process of understanding what you have to do.</p>\n\n<p><strong>FEATURES</strong></p>\n<p>• Easy to play, touch the screen to move around. Use the arrow to move back</p>\n<p>• Use the inventory to collect, combine and use objects</p>\n<p>• Beautiful all original mystery adventure 3D graphics, environments and atmosphere to explore</p>\n<p>• Immersive backing soundtrack and effects to pull you into the puzzle adventure</p>\n<p>• Automatic saving - Use the ‘Continue’ button on the main menu to pick up where you left off</p>\n\n<p><strong>HINTS &amp; TIPS</strong></p>\n<p>If you need a hint or clue while playing AYUDA then please reach out over email or social media (contact links can be found on my website) and I will be more than happy to help you.</p>\n<p><strong>SMALL PRINT</strong></p>\n<p>AYUDA was created from the imagination of a solo indie developer. </p>\n<p>“I am always excited to hear people playing my games and their experience along the way. Adventure gaming is my passion and your feedback helps my games get better.“</p>\n<p>AYUDA is compatible with all devices and has been designed to be as resource efficient as possible to allow play on many different devices. With that said, if you do run into any difficulties please email so I can provide updates that help everyone enjoy the adventure.</p>", "metacritic": null, "released": "2021-04-14", "tba": false, "updated": "2021-06-04T04:49:00", "background_image": "https://media.rawg.io/media/screenshots/ce7/ce7a0fe2de45a601f246a9551ee3f585.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 341, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "iOS"], "developers": ["M9 Packaging", "M9 GAMES"], "genres": ["Adventure", "Casual", "Puzzle"], "publishers": ["M9 Packaging"], "esrb_rating": "Everyone 10+"}