{"id": 586521, "slug": "decaying-delicacy", "name": "Decaying Delicacy", "name_original": "Decaying Delicacy", "description": "You can't read the form, but they want you to sign it. All you're really after is the one delicacy you crave, a hot-spanking Bar to dissolve in your mouth. It's gonna' take you places. But at least it's better than dying.<br/><br/>Collect keys to unlock gates to get those delicious delicacies while avoiding strange threats in a 2.5D arcade collection game, or at least that's the game some of the time. Read your diary, or don't. The game has several different endings based on your performance, and a number of alternative paths based on your choices and how you're doing.<br/><br/>This game is a psychedelic trip into a simple yet chaotic story of a girl who's too delicious for her own good.<br/><br/><strong>FEATURES:</strong><br/><ul><li>A psychedelic and colorfully strange 2.5D style.<br/></li><li>A chaotic energy meshing with a collectathon arcade game.<br/></li><li>A story that slowly opens up with branching pathways.<br/></li><li>A strange horror feel, uncertainty of what might come next.<br/></li><li>Several different endings to obtain.</li></ul><br/>\"Poor girl, sweet thing. Licked like a lollipop. This world is going to consume her. She's just too tasty for her own good. Run, run for your life, you poor unfortunate girl! Wash in the colors, break through your walls! You're my favorite flavor, I'm gonna' catch you~\"", "metacritic": null, "released": "2021-04-15", "tba": false, "updated": "2021-04-30T04:25:01", "background_image": "https://media.rawg.io/media/screenshots/4db/4db70d294c517f5e300d732f175ec7fb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 155, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Yai Gameworks", "AestheticGamer"], "genres": ["Adventure", "Indie"], "publishers": ["Yai Gameworks"], "esrb_rating": null}