{"id": 586669, "slug": "spirit-battle", "name": "Spirit Battle", "name_original": "Spirit Battle", "description": "<p>In a world protected by <em>Elemental Spirits</em>, kingdoms coexist peacefully. However, this perfect balance has been compromised by mysterious entities so that spirits will no longer protect the world.</p>\n<p>A group of brave soldiers wants to shed light on this mystery and try to stop the war that is inevitably going to start. Help the warriors save the world by traveling from the medieval water kingdom, through the modern thunder kingdom, the ancient fire kingdom, the floating city in the wind kingdom, and much more in this 20+ hours game!</p>\n<p><em>Note</em>: the game is 100% complete, including optional missions. It is still in development because there are some minor bugs and I only tested on few computers. Last but not least, I would welcome any constructive feedback and I may update the game with new features, enhanced storyline, bug fixes depending on how much time I have/priority.</p>\n<p>You can report a bug here or leave a comment below. If you submit a bug report, it is nice if you include the save file where the bug occurs.<br/></p>\n<p>Contact xlevonox@gmail.com for any questions related to the game.</p>\n<p><strong>Requirements</strong></p>\r\nMinimumRecommendedOperating SystemWindows 7/8/10Windows 10CPUIntel Core 2 DuoCPU Passmark score at least <em>4000 </em>(e.g. i5-2500)RAM2 GB4 GBGPUDirectX 9 compatible<br/>Graphics card or Integrated Graphics (e.g. HD Graphics 620)1GB Graphics card DirectX 9 compatible (e.g. GeForce GTX 550 Ti)Screen Resolution1280x7201920x1080DiskHDD with 2GB of free spaceSSD with 2GB of free space\r\n<p>If you are playing the game on a low-end laptop, please make sure power settings are set to performance and you are properly cooling the computer, otherwise the game may be lagging.</p>\n<p><strong>Terms of use</strong><br/></p>\n<p>You are free to play Spirit Battle as long as you want but you are not allowed to redistribute this game for commercial or non-commercial purposes or claim that you are the author. You should only play Spirit Battle if you were able to download it from the Download link on this web page.</p>\n<p>The game resources in Spirit Battle (music, animations, pictures, scripts, etc.) are encrypted because some of them are protected by copyright. If you want to use one resource in Spirit Battle whose author is not me (including the RPG Maker RTP) outside of the scope of the game (e.g. in another game), the license of the respective author applies. If you want to use one of the resources made by me, please contact me at xlevonox@gmail.com and do not use them outside of Spirit Battle before contacting me.</p>", "metacritic": null, "released": "2021-04-14", "tba": false, "updated": "2021-04-16T06:21:09", "background_image": "https://media.rawg.io/media/screenshots/442/4428742099cfddb15abaa10d718d629a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 151, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Levonox"], "genres": ["Action", "RPG"], "publishers": [], "esrb_rating": null}