{"id": 586804, "slug": "surf-clarinet", "name": "Surf Clarinet", "name_original": "Surf Clarinet", "description": "<p>One night there was big waves on the Kama river, and a moored boat was making loud knocking sounds. These sounds had a very unpredictable rhythm. Mixed with the sound of waves it adds up to the music that I've listened for a long time. It was like a beat of life. </p>\n<p>It was at the Young composers Academy in the Tchaikovsky city, and I wrote a piece \"A boat. A berth\" for bass clarinet solo with this boat beat in mind. After the premiere I was pondering about interactive version to make those sounds completely unpredictable and free of any precomposed rhythm. So, the idea arose to make an interactive program in which the rhythm is created anew each time right during the game. </p>\n<p>In collaboration with an artist Elena Mikulinskaya we've found a solution where the bass clarinet becomes the 3D-boat in the virtual sea. The ball there acts like a visualization of sound, and all clarinet sounds are depends of its spontaneous motion. It makes all the way down from the blowing mouth through the body of the instrument to the listener's ear, dodging the giant playing hand in the middle. In addition, many chaotic factors affect the sound: the bass clarinet sways on the waves, the mouth blows differently every time, the hand can knock the ball out of the way, and the ball itself can suddenly not fit into the twist of the clarinet's tube. </p>\n<p>Elena modelled all objects in Cinema 4D, and I've put it together using Unreal Engine 4. The game has four levels with difficulty progression. The goal is to play music on bass clarinet and to deliver the sound to the ear of a potential listener. The main game design concept is to make a quite simple control with complex consequences, so the only way to interact is to press Spacebar key. Players might feel themthelves like an amateur clarinet performer who tries to make a good sound but fails most of the time. When he tries harder, he finally makes a move but simultaneously damages an instrument. Music is like a river which you cannot visit twice because it will be a different river every time.</p>\n<p><strong>Features:</strong></p>\n<ul><li>try to guide the ball through the bass clarinet to the ear of your listener</li><li>control the airflow of the bass clarinet player with a Spacebar</li><li>the hand of a performer will try to kick your ball out into the sea</li><li>real water physics</li><li>real sounds of the bass clarinet</li><li>every time your will create unique soundtrack by playing this game</li></ul>\n<p><strong>Credits:</strong></p>\n<ul><li>Music and Programming – Mikhail Puchkov</li><li>Visual idea and 3D Modelling – Elena Mikulinskaya</li><li>Musical performance – Oleg Tantsov</li></ul>\n<p><strong>System requirements:</strong></p>\n<p>Windows 8 or later, Intel i5 or higher, Nvidia GT 1030 or higher, 4 GB RAM, ~680 Mb on hard drive.</p>", "metacritic": null, "released": "2021-04-14", "tba": false, "updated": "2021-04-16T06:53:53", "background_image": "https://media.rawg.io/media/screenshots/dfc/dfc04163929f254f4971360be6f055c2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 113, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["sonongames"], "genres": [], "publishers": [], "esrb_rating": null}