{"id": 58699, "slug": "shaq-fu-a-legend-reborn", "name": "Shaq Fu: A Legend Reborn", "name_original": "Shaq Fu: A Legend Reborn", "description": "The world is on the brink of disaster. Our biggest celebrities have revealed their true faces -- demons intent on moronizing the public to assume control of the planet. Only one man can save us: a towering Chinese orphan named Shaq Fei Hung. Trained by a kung fu master, Shaq must journey to the most perilous corners of the world to fight evil and realize his destiny as the chosen one.<br/>\n<br/>\r\nShaquille O’Neal returns to “settle the score of ‘94” in this complete reimagining of the Shaq Fu legend. Players take control of the unstoppable Big Diesel as he brawls his way through the hordes of Hollywood and Hell in classic side-scrolling beat ‘em up style. <br/>\n<br/>\r\n•\tFight your way through the mean streets of China, a South American compound, LA, Fiji, and the Inferno itself.<br/>\r\n•\tVoiced by the real deal, Shaquille O’Neal.<br/>\r\n•\tFight powerful, outlandish celebrities in boss battles that will make your eyes water.<br/>\r\n•\tMaster devastating combos, earth-shattering power moves, and a variety of weapons to conquer the evil hordes.<br/>\r\n•\tRevel in an exclusive new rap track from Shaq Daddy himself.<br/>\r\n•\tTransform into the legendary Big Diesel and Shaqtus to swiftly dispatch your enemies en masse.", "metacritic": null, "released": "2018-06-04", "tba": false, "updated": "2022-11-09T14:38:06", "background_image": "https://media.rawg.io/media/screenshots/8bd/8bd5180e0ae9871ed2972732481dc2b9.jpg", "website": "http://www.alegendreborn.com/", "rating": 2.67, "rating_top": 3, "added_by_status": {"yet": 17, "owned": 99, "beaten": 4, "toplay": 7, "dropped": 1}, "playtime": 3, "achievements_count": 222, "ratings_count": 9, "suggestions_count": 587, "game_series_count": 0, "reviews_count": 9, "platforms": ["Xbox One", "Nintendo Switch", "PlayStation 4", "PC"], "developers": ["Mad Dog Games", "Big Deez Productions"], "genres": ["Action", "Indie"], "publishers": ["Saber Interactive", "Mad Dog Games"], "esrb_rating": null}