{"id": 58698, "slug": "just-cause-4", "name": "Just Cause 4", "name_original": "Just Cause 4", "description": "<p>Just Cause 4 is the fourth game in the action series that follows the same protagonist, mercenary Rico Rodriguez. The game is powered by an updated version of the APEX engine.</p>\n<h3>Plot</h3>\n<p>The game takes place in the near future in Solis, a fictional country in South America. There, Rico Rodriguez engages in a fight with the local mercenary organization called Black Hand that was already featured in the first Just Cause game. The new Black Hand gang leader is Gabriela. Rodriguez explores the jungle, beaches, and ruins of ancient temples in Solis.</p>\n<h3>Gameplay</h3>\n<p>Just Cause 4 is set in an open world. The player assumes the role of Rodriguez from the third person view. The main character uses a variety of advanced weapons and gadgets, such as a grappling hook, a parachute and Rodriguez&#39;s trademark wingsuit. The grappling hook can be updated with mods that allow using it as a weapon. The game also introduces a new gadget called Air Lifter that attaches inflatable balloons to opponents. Rico can also travel using various vehicles, such as water scooters, motorcycles, and buggies.</p>\n<p>The AI of the opponents was improved, making them more dangerous, according to the game&#39;s developers. The protagonist has to battle not only his enemies but also nature&#39;s elements. The game emphasizes the extreme weather. Rodriguez has to survive such events as tornadoes, lightning storms, sandstorms, and snowstorms.</p>", "metacritic": 68, "released": "2018-12-04", "tba": false, "updated": "2024-03-26T16:45:08", "background_image": "https://media.rawg.io/media/games/02a/02a7f96f5a1156642bc0f827fd1b63f0.jpg", "website": "https://www.justcause.com", "rating": 3.04, "rating_top": 3, "added_by_status": {"yet": 276, "owned": 2471, "beaten": 174, "toplay": 161, "dropped": 290, "playing": 30}, "playtime": 5, "achievements_count": 472, "ratings_count": 491, "suggestions_count": 531, "game_series_count": 4, "reviews_count": 495, "platforms": ["PC", "PlayStation 4", "Xbox One"], "developers": ["Square Enix", "Avalanche Studios"], "genres": ["Action", "Adventure"], "publishers": ["Square Enix"], "esrb_rating": "Mature"}