{"id": 587242, "slug": "monster-collector-vr-demo", "name": "Monster Collector VR Demo", "name_original": "Monster Collector VR Demo", "description": "<p>Monster Collector is a physics-based VR melee combat game. You can fight all kinds of unique monsters in the sandbox. Dragons, Demons, Mythological Creatures. Each creature can bring you a different experience. You can tear them apart, slice them in half.</p>\n<p>Physics-based combat + all kinds of unique monsters (and of course dragons). </p>\n<p><strong>Unique Monsters</strong></p>\n<p>Each monster is totally unique. Different look. Different body structures. Different attack. Different experience.</p>\n\n<p><strong>Physics System</strong></p>\n<p>The physics in Monster Collector is very realistic.  You can pull monsters around (if they are not too big). You can punch the monster away and they will get balance again from the ground. You can grab monsters and jump with them.</p>\n<p><strong>Slice System</strong></p>\n<p>You can use the sword to slice the monster apart from almost every body part. Slice legs? yes, you can. Slice head? yes, you can.  Slice body? yes, you can. Slice tail? Yes, you can. </p>\n\n<p><strong>Stab Slash system</strong></p>\n<p>Try to stab your monster on the wall. or just stab its sliced body part on the wall. Or even stab 3 monsters altogether. Use your imagination.</p>\n\n<p><strong>Tear system</strong></p>\n<p>Slice is cool. But how about tear the monster apart with your bare hands?  For some monster, you can even tear them apart from their long nose. (Elephant? maybe)</p>\n\n<p>Combine all these systems with all the unique monsters together. The gameplays are endless. You can kill monsters in million ways. Just use your bloody imagination.</p>\n<p>(More monsters are planed to add into the game)</p>", "metacritic": null, "released": "2021-04-13", "tba": false, "updated": "2021-04-16T08:43:22", "background_image": "https://media.rawg.io/media/screenshots/f74/f746e1494a39085a6f3a8dd5febe43fc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 166, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["songjiekun"], "genres": ["Action", "Simulation"], "publishers": [], "esrb_rating": null}