{"id": 587518, "slug": "mana-match-alpha", "name": "Mana Match (Alpha)", "name_original": "Mana Match (Alpha)", "description": "<p><em>Mana Match is <strong>very early </strong>in development and most of the <strong>art is placeholder</strong>, this project will be continuously updated and may change significantly. Use the itch.io client so it automatically updates!</em></p>\n\n<p><strong>Note on Web version:</strong> For now, the web player is a bit finnick, specially if your connection has a bit of latency, you may need to reload the page if it doesn't load properly. The download size is around 7MB total for the WASM version.</p>\n<p><strong>If you are on a mobile</strong>, use your phone on landscape, you may need to unlock 🔓 your phone portrait orientation through it's menu.</p>\n\n<p>Playing on the desktop should not have problems. Linux version for now is not compatible with multi monitor setup - this will be fixed in a future version.</p>\n\n<p>When I was a kid I played a lot of Tetris Attack and later  I played Pieces (SNES). When I was bit older I went to a friend's house to play Heroes of Might and Magic Clash of Heroes on his Xbox360. This game will be a side project that I will slowly evolve towards a mix of these ideas. I am making it public so it's a bit easier for my close friends to try it, but feel free to play too. There's very little game at this point, so be aware.</p>\n\n<p>Music: Adventure by SubspaceAudio</p>\n<p>Background: stealthix</p>", "metacritic": null, "released": "2021-04-12", "tba": false, "updated": "2021-04-16T09:52:09", "background_image": "https://media.rawg.io/media/screenshots/c4e/c4e37ba90e834bf0bd74b73ddb500652.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 41, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux", "Web"], "developers": ["eri0o"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}