{"id": 58757, "slug": "jump-force", "name": "Jump Force", "name_original": "Jump Force", "description": "<p>Jump Force is a crossover game based on the characters from various anime and manga franchises. It is based on the propriety featured in Weekly Shonen Jump magazine and is meant as a celebration of its 50th anniversary. The game is powered by Unreal Engine 4.</p>\n<h3>Plot</h3>\n<p>A cataclysmic event caused the Shonen Jump world to collide with our real world. Both heroes and villains from various manga series appear on our Earth and fight in a chaotic battle for the survival of humanity.</p>\n<h3>Gameplay</h3>\n<p>The characters face each other on an arena in teams of up to three players. </p>\n<h3>Characters</h3>\n<p>The game includes more than 20 popular characters. Most famously, it features characters from franchises like Bleach (Ichigo, Rukia, and Sosuke), Dragon Ball (Son Goku, Vegeta, and Frieza), Naruto (Naruto and Sasuke) and One Piece (Luffy, Zoro, Sanji, Sabo, and Blackbeard), as well as several characters from Yu Yu Hakusho, Hunter x Hunter and Yu-Gi-Oh!. The story mode also includes two of Death Note characters (Light and Ryuk). Some of the characters make their first appearance in a video game, and some feature several forms. There are also completely original fighters created for the game. Many of the location backgrounds are also based on the anime/manga series as well as on the real places like New York and the Alps.</p>", "metacritic": 59, "released": "2019-02-15", "tba": false, "updated": "2024-03-20T13:41:05", "background_image": "https://media.rawg.io/media/games/bac/bac558c863989fadc4fede908c15cd64.jpg", "website": "https://www.bandainamcoent.com/games/jump-force", "rating": 2.52, "rating_top": 3, "added_by_status": {"yet": 30, "owned": 1061, "beaten": 38, "toplay": 49, "dropped": 135, "playing": 20}, "playtime": 4, "achievements_count": 252, "ratings_count": 184, "suggestions_count": 590, "game_series_count": 3, "reviews_count": 185, "platforms": ["Xbox One", "PlayStation 4", "Nintendo Switch", "PC"], "developers": ["BANDAI NAMCO Entertainment America", "Spike Chunsoft"], "genres": ["Action", "RPG", "Fighting"], "publishers": ["Bandai Namco Entertainment", "BANDAI NAMCO Entertainment US"], "esrb_rating": null}