{"id": 58752, "slug": "the-awesome-adventures-of-capitan-spirit", "name": "The Awesome Adventures of Captain Spirit", "name_original": "The Awesome Adventures of Captain Spirit", "description": "<p>The Awesome Adventures of Captain Spirit is an adventure game set in the &#39;Life is Strange&#39; universe. The game is considered to be a promo for the second part of the series — the entire walkthrough would take roughly more than 2 hours.</p>\n<h3>Connection with the series</h3>\n<p>The title indirectly connects the two parts of the game by sharing the characters and following the original timeline — the events depicted in The Awesome Adventures take place three years after the ending of Chloe and Maxes adventures. The game is being distributed for free. The title inherits the importance of the dialogue and in-game choices and emphasizes them by transferring all the options chosen in The Awesome Adventures into Life is Strange 2 by detecting the save file.</p>\n<h3>Plot</h3>\n<p>As this was the case with the &#39;Life is Strange,&#39; the main accent in the Captain Spirit is made on the storytelling.  The events center around Chris Eriksen — the nine-years-old protagonists who are coping with the loss of his mother with the help of made-out alter ago sharing the name with the game&#39;s title.</p>\n<h3>Gameplay</h3>\n<p>The game consists of several quests player needs to accomplish before finishing the walkthrough. The activities like microwaving the food, supposedly, using the Chris&#39; ultra-abilities are accompanied by a lot of dialogues and in-game puzzles.</p>", "metacritic": 77, "released": "2018-06-25", "tba": false, "updated": "2024-04-16T14:08:30", "background_image": "https://media.rawg.io/media/games/efd/efd6b2cb621c41a2b6580d8ac260b8ba.jpg", "website": "http://www.captainspirit.com", "rating": 3.62, "rating_top": 4, "added_by_status": {"yet": 327, "owned": 2916, "beaten": 896, "toplay": 140, "dropped": 88, "playing": 10}, "playtime": 2, "achievements_count": 0, "ratings_count": 911, "suggestions_count": 354, "game_series_count": 4, "reviews_count": 923, "platforms": ["PlayStation 4", "Xbox One", "PC"], "developers": ["DONTNOD Entertainment"], "genres": ["Adventure"], "publishers": ["Square Enix"], "esrb_rating": null}