{"id": 58754, "slug": "division-2", "name": "Tom Clancy’s The Division 2", "name_original": "Tom Clancy’s The Division 2", "description": "<p>Tom Clancy&#39;s The Division 2 is the sequel to the 2016 Tom Clancy&#39;s The Division. The game is inspired by the Tom Clancy political thriller books.</p>\n<h3>Plot</h3>\n<p>The game is set in the ruins of Washington D.C. in the near future, some seven months after the events of the original game. The smallpox epidemic devastated much of the United States, leaving it with multiple contamination zones. A civil war breaks out among the factions of survivors as the gangs of raiders terrorize the capital. The main characters are the elite members of the Strategic Homeland Division. Their task is to bring law and order back to Washington.</p>\n<h3>Gameplay</h3>\n<p>The player controls his or her Division agent from the third person view. The game is set in an open world modeled after the real Washington D.C., including all of its famous landmarks. Tom Clancy&#39;s The Division 2 combines elements of tactical shooters and role-playing games. The agents have customizable abilities, weapons, and tools, and can level up. When they reach level 30, they receive a specialization: Survivalist, Demolitionist, or Sharpshooter. The game also unlocks new co-op missions.</p>\n<h3>Modes</h3>\n<p>Besides the story campaign mode, the game has two multiplayer modes: player versus player and cooperative. Up to eight players can join forces on a raid.</p>", "metacritic": 83, "released": "2019-03-15", "tba": false, "updated": "2024-03-04T16:10:35", "background_image": "https://media.rawg.io/media/games/0e5/0e5e869f2e8f496b3f09e00187ea94fc.jpg", "website": "https://tomclancy-thedivision.ubisoft.com/game/en-us/home", "rating": 3.73, "rating_top": 4, "added_by_status": {"yet": 178, "owned": 1968, "beaten": 310, "toplay": 227, "dropped": 323, "playing": 160}, "playtime": 6, "achievements_count": 332, "ratings_count": 755, "suggestions_count": 645, "game_series_count": 3, "reviews_count": 761, "platforms": ["PC", "PlayStation 4", "Web", "Xbox One"], "developers": ["Ubisoft", "Massive Entertainment"], "genres": ["Action", "Shooter", "Adventure", "RPG"], "publishers": ["Ubisoft Entertainment"], "esrb_rating": null}