{"id": 587669, "slug": "mystery-trackers-forgotten-voices-collectors-editi", "name": "Mystery Trackers: Forgotten Voices Collector's Edition", "name_original": "Mystery Trackers: Forgotten Voices Collector's Edition", "description": "<strong>Elephant Games </strong>presents another captivating entry in the mind-boggling Mystery Trackers series!<br/><br/>The Mystery Trackers jump to action once again when a distress call comes in from Misthill College. Thing get strange when the team discovers that the call is from one year ago, and what’s more, the students who made the call are missing and nobody seems to remember them! Can you make the grade by helping the Mystery Trackers find the cause of the mysterious anomaly that plagues Misthill College and rescue the missing students? There’s only one way to find out, but be sure to bring your “A” game in this electrifying new Hidden-Object Puzzle Adventure!<br/><br/>This is a special Collector’s Edition release full of exclusive extras you won’t find in the standard version. The Collector’s Edition includes:<br/><br/>•\tHelp save the students of Misthill College.<br/>•\tEarn achievements and view them in your gallery!<br/>•\tDownload themed music, wallpapers, and screensavers. <br/>•\tReplay HOPs again and again with the HO viewer. <br/>•\tNever get lost with the strategy guide!<br/><br/>This is a Hidden Object Puzzle Adventure game, meaning a specific genre of story-driven, point &amp; click adventures. Throughout the game, players are tasked to find a list of objects hidden within a particular scene, and to occasionally complete various mini-games/puzzles.", "metacritic": null, "released": "2021-04-16", "tba": false, "updated": "2021-04-19T02:29:06", "background_image": "https://media.rawg.io/media/screenshots/e26/e26016844442a969fb2d8a4e44a849bc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 5, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 579, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Elephant Games"], "genres": ["Adventure", "Casual"], "publishers": ["Big Fish Games"], "esrb_rating": null}