{"id": 587671, "slug": "gnomes-build-and-survive", "name": "Gnomes: build and survive", "name_original": "Gnomes: build and survive", "description": "<h3>Gnomes: Build and survive</h3>      A difficult time has come for the gnomes, all the former greatness has sunk into oblivion. Permafrost has descended on the lands full of riches and food.<br/>An evil sorcerer in order to take the gold of the dwarves caught up famously on their land. Cold and hunger forced the inhabitants to leave their home and wander around the world, looking for a new home. Not everyone was able to overcome such a difficult path through severe snow and frost.<br/>Raving for many months, the gnomes still managed to find a land as beautiful as their home, but not everything is so simple, these places are teeming with hordes of goblins and orcs.<br/>      A swarm of goblins swept down from the hills, blocking the way for the wanderers. The dwarves were too few, but they still managed to repel the enemy, albeit at a great cost.<br/>Many brave warriors have fallen. And there were no songs or cheers that day, the remaining dwarves continued on their way to the \"New Home\".<br/>      You have to play as one of the surviving dwarves, take an axe and a hammer in your hands, and start building a new settlement, look for food, and defend against enemies.<br/>Will you be able to prove that it was not in vain that such a difficult path was passed and return to the former greatness of the gnomes?<br/>In the game you will need to:<br/> - cut down trees and break stones to get resources, (resources are needed to make different buildings);<br/>- build buildings to defend against the raids of goblins, orcs and other enemies;<br/> - collect food and hunt to survive;<br/>- travel around the game world in search of new items, weapons, and other things.<br/>- play with your friends in co-op mode.", "metacritic": null, "released": "2021-04-16", "tba": false, "updated": "2021-04-19T02:30:16", "background_image": "https://media.rawg.io/media/screenshots/d50/d50beca3304076b4152215b1aa20dea9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 179, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Merragamm"], "genres": ["Adventure", "RPG", "Simulation", "Indie"], "publishers": ["Merragamm"], "esrb_rating": null}