{"id": 58766, "slug": "kingdom-two-crowns", "name": "Kingdom: Two Crowns", "name_original": "Kingdom: Two Crowns", "description": "<p>In the award-winning Kingdom series, players took on the role of a monarch struggling to build their kingdom up from nothing. Hundreds of thousands of players across the world explored, recruited loyal subjects, and defended nightly against the persistent threat of the Greed – but they did so in isolation, and as with all things in Kingdom, nothing lasts… until now.</p>\n<p>Kingdom Two Crowns builds upon the challenging micro strategy experience with an evolution of the celebrated franchise. Introducing the brand-new campaign mode, monarchs must now work to build a kingdom that stands over time until finding a way to defeat the Greed for good. Recruit new unit types and develop advanced technologies to bolster your defenses. Explore fresh environments to discover new mounts and secrets hidden in the deep. Revisit and revitalize your kingdom in its entirety as you move onward through the campaign.</p>\n<p>But you don’t have to rule alone! Introducing a cooperative play experience that is totally unique to Kingdom Two Crowns, monarchs can now choose between a classic solo experience or seek the assistance of a friend, working together locally or online, dropping in or out at will.<br />\nA challenge awaits all who seek it here, whether you are a first-time ruler or a longtime fan. So be brave, great monarchs, for in the end Two Crowns shall reign stronger than one!</p>\n<p>Key Features:<br />\n👑 <strong>BRAND-NEW CAMPAIGN MODE:</strong> Built upon the classic micro strategy that made Kingdom successful, monarchs can now build lasting kingdoms in a multi-stage campaign to stop the assault of the Greed for good.<br />\n👑 <strong>TWO CROWNS TO RULE THEM ALL:</strong> The struggle to build your kingdom need not be ventured alone! Strategize and defend your realm together in local or online drop-in/drop out co-op.<br />\n👑 <strong>NEW FEATURES, NEW STRATEGIES:</strong> A wealth of new features from technology upgrades to unit types to secrets to enemies, monarchs will need to plan wisely to see their kingdom flourish.<br />\n👑 <strong>FORMIDABLE CHALLENGE ISLANDS:</strong> Whether you seek the fierce threat of Skull Island or unique lands that modify the gameplay through special rules, the secret challenge islands expand the Kingdom experience to all players new and loyal.</p>", "metacritic": 85, "released": "2018-12-10", "tba": false, "updated": "2024-04-18T06:53:00", "background_image": "https://media.rawg.io/media/games/f15/f15236ba62fdb1c04cfb4d5a40168f54.jpg", "website": "https://www.kingdomthegame.com/kingdom-two-crowns/", "rating": 4.09, "rating_top": 4, "added_by_status": {"yet": 77, "owned": 1684, "beaten": 91, "toplay": 58, "dropped": 55, "playing": 21}, "playtime": 6, "achievements_count": 212, "ratings_count": 173, "suggestions_count": 453, "game_series_count": 2, "reviews_count": 173, "platforms": ["PlayStation 4", "Nintendo Switch", "macOS", "PC", "iOS", "Xbox One", "Android"], "developers": ["Noio", "Raw Fury", "Coatsink", "Fury Studios", "StumpySquid"], "genres": ["Adventure", "RPG", "Strategy", "Simulation", "Indie"], "publishers": ["Raw Fury"], "esrb_rating": "Everyone 10+"}