{"id": 587730, "slug": "astonishing-baseball-21", "name": "Astonishing Baseball 21", "name_original": "Astonishing Baseball 21", "description": "Astonishing Baseball is your daily dose of baseball management on your smartphone or tablet, and for free, with no ads. Become the manager of an astonishing sports team full of stars, and as the GM, lead your players to the ultimate reward: the Baseball Cup!<br/><br/>Astonishing Baseball is not your usual baseball simulation game. It's not only about tables full of players and stats. It's not just trading players and signing free agents. In Astonishing Baseball, you're writing your own story with one goal in mind: win the Baseball Cup. And for that, you'll need all kind of skills.<br/><br/>*A living world<br/>Astonishing Baseball features an artificial but living world. Fans are posting about the game and your brand new rookie. Journalists write articles about your starter's last night performance and interview you. Players send you messages about their concerns, their contract... Or maybe they're inviting you for dinner! It's all about baseball!<br/><br/>*The lineup of your dreams<br/>Astonishing Baseball allows you to create the team you've always dreamed of. Make trades with the greedy other teams of the league, or sign free agents during the offseason. Draft talented prospects and train them to the rank of baseball stars during the Legends Contest. You're the coach!<br/><br/>For baseball fans and stats nerds<br/>Astonishing Baseball is very easy to learn. If you know the game rules, you'll know how to play! But if you're a sabermetrics savant, you'll find all kind of stats to satisfy your nerdy instinct! And in AB21, we've added some niceties, like charts and WAR projections!<br/><br/>*Play on your own terms<br/>Astonishing Baseball can be played offline, as much as you want. You don't need to wait between games. You don't need a data connection or Wi-Fi to save a game result. You don't need to create an account to build your team. You don't even have to pay. Just play now! Seriously, just tap that download button and enjoy it!<br/><br/>*Get international<br/>Not enough talent in your league? Send your incredible and local scouts to find the best prospects in the world, and then invite the most promising player to your team! But be careful, even the best scouts can make mistakes...<br/><br/>*A Prodigious Story<br/>Create your own player and follow his adventures through high school and college. Will he join the Emerald University of Seattle, or travel to Japan to study baseball? Can he find love, and keep his best friend close while becoming a local superstar? Is that legendary Cap of Neva really worth it? Play through dozens of events and storylines until your young prodigy joins your team!<br/><br/>*A fierce online competition<br/>Even if the entire solo mode can be played offline, you can also decide to play online anytime, and participate in one of our many multiplayer modes! Try to become the King of Baseball in the Astonishing Contest, or conquer the title of World Champion. Except if you want to play with friends, and go on a road trip with your guild to conquer cities! <br/><br/>*A Tremendous Rivalry<br/>Maybe you're going to have success with your team, but at the top of your fame, a talented coach might come to steal your throne! Will you be good enough to get him out of this league? But beware, because the Dargor family is ready to sabotage you. And Regis might not be your worst enemy in this...<br/><br/>*Live incredible stories<br/>As a coach, you do have a life too! In Astonishing Baseball, you can take your team to a burger restaurant, help local associations, but also meet your favorite author, become a rock star and even marry the love of your life!<br/><br/>*New challenges await you<br/>In AB21, you can now play one of our many scenarios! Go back in time to manage the famous 1927 superstars, or try to rebuild Detroit in extreme mode!<br/><br/>If you like baseball, fantasy sports and GM simulation games, you'll love Astonishing Baseball Manager!<br/><br/><br/>Join our Discord server: https://discord.astonishing-sports.app<br/>Or join the Reddit: https://www.reddit.com/r/AstonishingSports/", "metacritic": null, "released": "2021-03-25", "tba": false, "updated": "2021-04-19T03:11:06", "background_image": "https://media.rawg.io/media/screenshots/9de/9de0911076bd554d11f9b99590a56f03_zO3leJW.jpg", "website": "https://astonishing-sports.app/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 95, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Zero One SAS"], "genres": ["Simulation", "Sports"], "publishers": ["Zero One SAS"], "esrb_rating": "Everyone 10+"}