{"id": 58773, "slug": "sable", "name": "Sable", "name_original": "Sable", "description": "<p>Sable is a coming-of-age tale of discovery through exploration across a strikingly rendered open world desert. Go on a deeply personal journey across an alien planet as the young Sable, exploring ancient monuments, ruined architecture, and ships fallen from the cosmos, all while learning the history of its inhabitants and discovering her place in the world.</p>\n<p>What is the history behind these broken monuments scattered about the land? How did the nomadic clans come here, and what made them stay? What&#39;s the greater importance that Sable must come to understand as part of this rite of passage? Only the inquisitive mind will come to understand the lessons held within the sandy confines of the planet&#39;s secrets: lessons of life, family, and being a part of something greater than one&#39;s self.</p>\n<p>KEY FEATURES:<br />\n• <strong>A WORLD OF ADVENTURE:</strong> Travel across a far-way desert planet on the back of your hoverbike to uncover relics of an ancient past.<br />\n• <strong>A VOYAGE OF EXPLORATION:</strong> Meet nomadic peoples and assist with their quests to learn their stories, as they lead you to the far reaches and hidden secrets of the sand-weathered planet.<br />\n• <strong>A QUEST OF SELF-DISCOVERY:</strong> Accompany Sable through this rite of passage as she learns valuable lessons of the clan, and the people and culture of her world.</p>", "metacritic": 74, "released": "2021-09-23", "tba": false, "updated": "2024-04-22T22:35:49", "background_image": "https://media.rawg.io/media/games/46a/46acc41c5ee0aea0e2d9c685a9a7427b.jpg", "website": "https://www.shed-works.co.uk/", "rating": 3.46, "rating_top": 4, "added_by_status": {"yet": 134, "owned": 757, "beaten": 59, "toplay": 277, "dropped": 110, "playing": 28}, "playtime": 4, "achievements_count": 110, "ratings_count": 145, "suggestions_count": 278, "game_series_count": 0, "reviews_count": 152, "platforms": ["macOS", "PC", "Xbox Series S/X", "PlayStation 4", "PlayStation 5", "Xbox One"], "developers": ["Shedworks"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Raw Fury"], "esrb_rating": "Rating Pending"}