{"id": 587705, "slug": "outbreak-endless-nightmares", "name": "Outbreak: Endless Nightmares", "name_original": "Outbreak: Endless Nightmares", "description": "<p>Outbreak: Endless Nightmares twists the series&#39; survival horror gameplay by adding elements of roguelike gameplay. You&#39;ll need to explore, hunt for supplies, uncover clues, and fight your way through each anomaly – each consisting of semi-procedurally generated instances where both the environment, and the undead, are out to kill you!<br />\nImmediately after the events of Outbreak: The Nightmare Chronicles, you find yourself trapped within the remains of Arzt Memorial Hospital – the hub to organize your inventory and storage cache, level up your character, or just to take a breather before venturing back out into the chaos. There’s more to discover in the world besides murderous hordes of the undead – find the journals scattered about to learn more about the outbreak and ultimately where to find refuge! Don’t think death can save you – every time you die, you&#39;ll awake trapped in this nexus.<br />\nOutbreak: Endless Nightmares focuses on extreme replayability by offering multiple character options – each with their own abilities, upgrade paths and more! Each time you venture into the anomaly, it’ll change and become increasingly difficult as you grow in power. You&#39;ll need to think carefully about what weapons, healing items, and other supplies you&#39;ll bring along. If you&#39;re lucky, you may find storage caches that give you access to your expanded inventory, and offer an opportunity to restock. But it&#39;s all on you to search your environment for supplies. If you run out ... your fate is sealed!</p>", "metacritic": null, "released": "2021-05-19", "tba": false, "updated": "2021-05-21T04:14:25", "background_image": "https://media.rawg.io/media/screenshots/0d2/0d22999bde4032422a9049c6d34518a9.jpg", "website": "http://www.outbreakzone.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 2, "dropped": 1}, "playtime": 0, "achievements_count": 11, "ratings_count": 0, "suggestions_count": 435, "game_series_count": 0, "reviews_count": 0, "platforms": ["Xbox One", "PC", "PlayStation 4"], "developers": ["Dead Drop Studios"], "genres": ["Action", "Shooter", "Adventure", "RPG", "Indie"], "publishers": ["Dead Drop Studios"], "esrb_rating": null}