{"id": 587750, "slug": "mini-world-block-art-3", "name": "Mini World-Block Art", "name_original": "Mini World-Block Art", "description": "BUILD YOUR OWN ADVENTURE GAME<br/>Mini World is the ultimate dream game for you to let your creativity fly! Create and build anything you can imagine, a house, apartment, castle or even a city of your own! This is the best free game for teens, join now to play and have fun with millions of players in the Mini World global community.<br/>Your adventure begins now!<br/>SANDBOX WORLD WITH INFINITE CONTENTS <br/>Explore an expansive sandbox world with a variety of unique cute monsters, blocks, materials. Survival mode, creation mode, epic role playing mode, and various mini games created by the community.<br/>PLAY FREE AND BE SOCIAL! <br/>Jump into a friend's game with friendly fire turned on, or start a new world on your own. Chat with your friends’ game buddies online using private chat or group chat. Share your game with friends, or join other players from all over the world. Colorful boys &amp; girls skins to customize your own character.<br/>POWERFUL GAME-EDITOR <br/>Various types of mini-games available, from parkour, to puzzle, to FPS, to strategy etc... all can be built by our powerful game-editor that is available even on mobile devices. You can truly build your own world anywhere.<br/>JOIN OUR COMMUNITY <br/>Facebook: https://www.facebook.com/miniworldtech<br/>Twitter: @miniwantech<br/>Discord: https://discord.gg/88GZq34<br/>Developer email: miniwantech@gmail.com<br/>CS email: MiniworldCustomerService@gmail.com", "metacritic": null, "released": "2021-03-02", "tba": false, "updated": "2021-04-19T03:20:58", "background_image": "https://media.rawg.io/media/screenshots/4ed/4ede386940ed42a6fb0a36b5606c35ba_ov3gSmU.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 212, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Miniwan Tech"], "genres": ["Adventure", "Simulation"], "publishers": ["SHENZHEN MINIWAN TECHNOLOGY CO"], "esrb_rating": "Everyone 10+"}