{"id": 587736, "slug": "euro-2020-panini-sticker-album", "name": "EURO 2020 Panini sticker album", "name_original": "EURO 2020 Panini sticker album", "description": "Welcome to the official Panini virtual sticker album for UEFA EURO 2020. Open, collect and swap virtual stickers of your favourite footballers in the tournament.<br/><br/>UEFA, Panini and Coca-Cola bring you all the fun of collecting football stickers on your mobile.<br/><br/>Get excited about UEFA EURO 2020 by filling your album with all the players from the 24 teams in the EUROs. Each soccer team competing in EURO 2020 has a dedicated page. See if you can fill each page and complete your album!<br/><br/>- Get new packs of stickers every day<br/>- Glue stickers into your virtual album or exchange your swaps<br/>- Swap with your friends or with all collectors<br/>- Earn special golden stickers<br/>- Complete challenges to earn more stickers<br/>- Scan promo codes to get special bonus packs<br/><br/>The app has special features that include scanning promotional items. Throughout UEFA EURO 2020, there are codes hidden on Coca-Cola bottle caps and other items that you can scan with the app to earn extra stickers for your album.<br/><br/>Collect special Fan Stickers, tournament stickers and badges as you complete challenges in the app.<br/><br/>This app is a must for any soccer fan this summer!<br/><br/>Ready to take UEFA EURO 2020 to the next level? Download the app today!", "metacritic": null, "released": "2021-03-20", "tba": false, "updated": "2021-04-19T03:13:54", "background_image": "https://media.rawg.io/media/screenshots/899/899584732986ead1fb795e07c51e69a6_u3b0PTf.jpg", "website": "https://paninistickeralbum.uefa.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "toplay": 2, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 116, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["UEFA"], "genres": ["Sports", "Card"], "publishers": ["UEFA"], "esrb_rating": "Everyone 10+"}