{"id": 587714, "slug": "have-play-piano-music-tiles", "name": "HAVE: Play Piano Music Tiles", "name_original": "HAVE: Play Piano Music Tiles", "description": "Piano Music Tiles Brain Trainer is an empowering and entertaining mobile game that will give your memory a boost and help you polish your cognitive skills.<br/><br/><br/>Tap tap on the piano tiles to play the song as the screen rapidly gets darker and you HAVE to use your memory to remember the tune. Work your memory muscle while you remember the tunes played by Robbie, the piano master.<br/><br/><br/>Robbie used to love playing the piano! That was until he got struck by electricity which broke his visual processing unit. He has lost his confidence and is worried about his dream of being a famous pianist is over. Robbie is wondering where the keys are. Can you help him achieve his goal and play the piano together?<br/><br/><br/>His tunes are addictive and challenging. His audience is eager to hear him play the tunes again.<br/><br/><br/>Play this engaging brain trainer game and be part of an exclusive audience.<br/><br/><br/>Enjoy our awesome casual game and do social good! At HAVE we are committed to supporting our partner charity, Sightsavers, who protect sight and fight for disability rights around the world. With many physical fundraising events cancelled due to COVID-19, charities need us now more than ever to build the foundation for a stronger society in the digital world!<br/> <br/><br/>FEATURES - Piano Music Tiles Brain Trainer:<br/><br/><br/>* A bright, interactive and user-friendly interface that makes this piano game simulation app absorbing, engaging and loads of fun. Help Robbie to remember what he does best with this quirky little music runner mobile game<br/><br/>* Challenging levels and tunes - designed to keep you challenged and entertained while you potentially get slightly addicted while you try to move to the next level and play the funky rhythm music <br/><br/>* Tied to a social cause - help Robbie to spread some social good! The more players that help him, the more he can donate to charity, so invite all your friends and let's fight for a good cause together<br/><br/>* Simulation app - raising awareness of just a little bit of what it is like to suffer from visual impairments<br/><br/>* Entertaining music tiles simulator - engaging graphics, catchy tunes and an empowering and emotional storyline like no other piano game <br/><br/><br/>Play from your memory, not with your eyes!<br/><br/><br/>Follow us:<br/><br/>Facebook @OfficialHAVE<br/>Instagram @official_have<br/><br/><br/>Visit our website for more socially good games and entertainment: www.haveandshare.com<br/><br/><br/>Contact: support@haveandshare.com<br/>Privacy Policy: https://www.haveandshare.com/privacy-policy<br/>Terms of Service: https://www.haveandshare.com/terms-of-service", "metacritic": null, "released": "2020-12-05", "tba": false, "updated": "2021-04-19T03:02:56", "background_image": "https://media.rawg.io/media/screenshots/491/4915fb2a1a427c4474c2eb1f1f9568b3_Kl58BJW.jpg", "website": "http://www.haveandshare.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 107, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Have and Share"], "genres": ["Casual"], "publishers": ["Have and Share"], "esrb_rating": "Everyone 10+"}