{"id": 587880, "slug": "planet-born", "name": "Planet Born", "name_original": "Planet Born", "description": "<p>Basta ya de siempre destruir asteroides, ¡esta vez vamos a juntarlos! </p>\n<p>El objetivo es crear planetas uniendo asteroides para que nazca nuestra propia galaxia (sí, funciona así que lo dijo Newton el otro día). Para ello pilotaremos lo último en naves espaciales: N.A.V.E. (Nave Azul Voladora Espacial).</p>\n<p>N.A.V.E. cuenta con las mejores herramientas para traslado de asteroides de la galaxia: atractor y repulsor gravitatorio, barrera metálica para empujar asteroides, escudos recargables, saltos al hiperespacio (también conocido como boost de velocidad) y... el gaaanchooooo.</p>\n<p>Pero no todo son buenas noticias, el espacio está lleno de asteroides que impactarán contra nosotros y peor aún: meteoritos rojos que nos provocarán más daños y destruirán los planetas que estemos construyendo.</p>\n<p>Si siempre has sabido que la creación de planetas es tu vocación o simplemente te aburres no esperes más a probar el espectacular juego PLANET BORN.</p>\n<p>Controles:</p>\n<ul><li>WASD para moverse.</li><li>Q para atraer asteroides.</li><li>E para repeler asteroides.</li><li>R para usar el gaaanchooooo.</li><li>F para desplegar una barrera que permite empujar los asteroides sin recibir daño.</li><li>Barra espaciadora para mejorar la velocidad de movimiento de la nave.</li><li>Tabulador para cambiar entre la vista de nave y la vista del mapa.</li></ul>\n<p>Se han de juntar los asteroides azules y verdes hasta que alcancen su tamaño máximo. Luego, al juntar uno azul y uno verde se creará un planeta. Si no se juntan dos de tamaño máximo, usa Tabulador para ver el mapa ya que solo se puede crear un planeta.</p>\n<p>Para ganar la partida se ha de hacer crecer el planeta juntándolo con otros asteroides de tamaño máximo.</p>\n<p>¡Buena suerte!</p>\n<p>Juego desarrollado en una semana para la primera edición de la #JamOnFDI2021.</p>\n<p>Desarrolladores:</p>\n<ul><li>Juan Sánchez Blanco (Pepi) @pepii08</li><li>Carlos Jiménez Álvarez @xcjgames</li><li>Alejandro Marín Pérez @TheMrCorner</li></ul>", "metacritic": null, "released": "2021-04-18", "tba": false, "updated": "2021-04-19T03:58:15", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["XCJGames", "TheMrCorner", "P3PI"], "genres": ["Action"], "publishers": [], "esrb_rating": null}