{"id": 58782, "slug": "wolfenstein-youngblood", "name": "Wolfenstein: Youngblood", "name_original": "Wolfenstein: Youngblood", "description": "<p>Wolfenstein: Youngblood is a spin-off installment of the Wolfenstein series. It fills the gap between Wolfenstein II: The New Colossus and the upcoming Wolfenstein 3. </p>\n<h3>Setting</h3>\n<p>Like its predecessors, Wolfenstein: Youngblood is set in an alternate reality, in which Nazi Germany won World War II by using anachronistically developed tech. The Third Reich managed to conquer Europe and North America. The spin-off is set in an alternate 1980. Nineteen years have passed since the events of Wolfenstein II: The New Colossus, which are now known as the Second American Revolution. The US is now free from German occupation, but the battle continues as Nazi still control most of Europe. </p>\n<h3>Plot</h3>\n<p>The game&#39;s main protagonists are Jessica and Sophia, the twin sisters and daughters of the Wolfenstein series&#39; trademark protagonist, war veteran B.J. Blazkowicz. Their father trained them as fighters and shooters, and as they reached adulthood, they joined the Global Resistance to fight against the Nazis. When Blazkowicz goes missing on a secret mission in the Vichy France, the twins set out to search him in the Nazi-occupied Paris. They also assist the French Resistance in fighting the occupants.</p>\n<h3>Multiplayer</h3>\n<p>The game allows two players to cooperate online by controlling two sisters at once as they walk through the story campaign.</p>", "metacritic": 66, "released": "2019-07-26", "tba": false, "updated": "2024-02-27T16:20:27", "background_image": "https://media.rawg.io/media/games/c64/c64d2f63cabeab9126693b7d39539c8d.jpg", "website": "https://wolfenstein.bethesda.net/", "rating": 2.68, "rating_top": 3, "added_by_status": {"yet": 173, "owned": 1405, "beaten": 218, "toplay": 273, "dropped": 154, "playing": 37}, "playtime": 6, "achievements_count": 268, "ratings_count": 399, "suggestions_count": 164, "game_series_count": 9, "reviews_count": 411, "platforms": ["Xbox One", "PC", "PlayStation 4", "Nintendo Switch"], "developers": ["Bethesda Softworks", "Arkane Studios", "Machine Games"], "genres": ["Action", "Shooter"], "publishers": ["Bethesda Softworks"], "esrb_rating": "Mature"}