{"id": 58801, "slug": "caves-roguelike", "name": "Caves (Roguelike)", "name_original": "Caves (Roguelike)", "description": "A classical turn-based roguelike* styled game, with pixel art graphics. The main feature of the game are caves, that you can dig through using your pickaxe. Both magic and high technology go together here. <br/><br/>*From Wikipedia:<br/>\"Roguelike is a subgenre of RPG games that are characterized by random level generation, turn-based gameplay, tile-based graphics, and permanent death of the player-character.\"<br/><br/>Also features:<br/>- Your own main base, with a cloning system and upgrade station<br/>- Hightech armor with the capability to choose one of five special abilities<br/>- Find resources and craft unique and powerful items in a Crafting Station on your base<br/>- Hordes of skeletons<br/>- When I say hordes, I mean it. We even have a robot-skeleton :-)<br/>- You can make your unique character by choosing different stats<br/>- Big, randomly generated areas to explore<br/>- Many interesting items<br/>- A big weapons arsenal, from bows and daggers to plasma guns and energy swords<br/>- Each weapon has it's own unique ability<br/>- Comfortable controls<br/>- Constantly updating<br/><br/>The game is in early development and I am actively working on new content and gameplay elements.<br/>Twitter: https://twitter.com/36dev_<br/>Reddit: https://www.reddit.com/r/cavesrl/<br/>Discord: https://discord.gg/dBhKMah", "metacritic": null, "released": "2015-11-14", "tba": false, "updated": "2019-10-30T14:09:29", "background_image": "https://media.rawg.io/media/games/b82/b82a499a08caf3f5dc2a86a8cb11d57f.jpg", "website": "https://play.google.com/store/apps/details?id=thirty.six.dev.underworld", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 2, "toplay": 1, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 155, "game_series_count": 0, "reviews_count": 3, "platforms": ["Android"], "developers": ["36dev"], "genres": ["RPG"], "publishers": ["36dev"], "esrb_rating": null}