{"id": 588292, "slug": "saving-private-liberty", "name": "Saving Private Liberty", "name_original": "Saving Private Liberty", "description": "<p>The web game <em>Saving Private Liberty</em> attempts to create a speculative piece of propaganda entertainment (<em>Propatainment</em>) in order to expand on a theory: “that the medium is the message” (<em>Marshal McLuhan</em>). Such recognition of this concept affirms a reality wherein interactive media can be used to mold and change already established idealogy. It allows for the recognition that video games can be used as devices capable of newspeak.</p>\n\n<p><em>Saving Private Liberty </em>is a video game set within the printed constraints of a propaganda poster; there, the audience controls a lone patriotic soldier, <em>Private Liberty</em>, as she combats hordes of soldiers. The gameplay is simple; players can move left, right, up, and down avoiding enemies similar to the NES classic “<em>Mario Bros</em>;” the longer the player survives in-game, the greater the difficulty increases. With the integration of western militarist tropes typical in first-person war-shooter games and photomontage techniques practiced during the soviet constructivist movement, <em>Saving Private Liberty</em> creates an opportunity for all to interact with <em>Propatainment.</em> \r\n</p>\n\n<p>Much like how propaganda provokes its people, hardships and challenges made within this game world attempt to provoke the audience. It uses the strengths and limitations of its medium to deliver its message: that freedom is in danger and that we must constantly fight to protect it. No matter the effectiveness of such a message, <em>Saving Private Liberty</em> attempts to question the legitimacy of <em>Propatainment </em>within our present and future media landscape. It creates the needed consideration of the impact that media has in shaping the public mindset.\r\n</p>", "metacritic": null, "released": "2021-04-18", "tba": false, "updated": "2021-04-19T05:44:31", "background_image": "https://media.rawg.io/media/screenshots/8b0/8b0cb9d2603385c14458f0909971b524.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 133, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["SBrianZ"], "genres": ["Action"], "publishers": [], "esrb_rating": null}