{"id": 58829, "slug": "super-smash-bros-ultimate", "name": "Super Smash Bros. Ultimate", "name_original": "Super Smash Bros. Ultimate", "description": "<p>Super Smash Bros. Ultimate is the fifth game in its franchise. It is also the first game in its series to be released for Nintendo Switch.</p>\n<h3>Premise</h3>\n<p>The series is a crossover of characters from various video game franchises, such as The Legend of Zelda, Pokemon, Sonic the Hedgehog, Super Mario, Metroid, and Mega Man, among many others. Their famous protagonists fight each other on an arena. In accordance with its name, the game is the “ultimate” installment of the series, in that it offers the players all the characters ever featured in Super Smash Bros. The game also introduces five new characters, most famously, Castlevania&#39;s Simon Belmont.</p>\n<h3>Gameplay</h3>\n<p>Unlike most fighting games, Super Smash Bros. series is built around knocking opponents out of the arena rather than lowering their health bars. However, the damage meter increases the character&#39;s chances to be knocked out. Each fighter has a limited number of lives and loses one when he or she is knocked out. The player is eliminated when he or she loses all lives.</p>\n<h3>Multiplayer</h3>\n<p>Super Smash Bros. Ultimate includes several competitive multiplayer modes. Besides the traditional versus mode, there are several new modes not featured in the previous games. These include Tournament (the playoff mode for 32 players), Smash Squad (team multiplayer), Smashdown (a mode in which the defeated characters are eliminated).</p>", "metacritic": 93, "released": "2018-12-07", "tba": false, "updated": "2024-04-13T17:19:02", "background_image": "https://media.rawg.io/media/games/9f3/9f3c513b301d8d7250a64dd7e73c62df.jpg", "website": "https://www.smashbros.com/", "rating": 4.37, "rating_top": 5, "added_by_status": {"yet": 88, "owned": 484, "beaten": 573, "toplay": 252, "dropped": 350, "playing": 404}, "playtime": 0, "achievements_count": 0, "ratings_count": 1050, "suggestions_count": 500, "game_series_count": 5, "reviews_count": 1074, "platforms": ["Nintendo Switch"], "developers": ["Nintendo", "Bandai Namco Entertainment", "Sora"], "genres": ["Fighting"], "publishers": ["Nintendo"], "esrb_rating": null}