{"id": 588365, "slug": "complex-manufacturing", "name": "Complex Manufacturing", "name_original": "Complex Manufacturing", "description": "<p>Complex Manufacturing is my entry in the Farewell North game jam.  With a week to create a game from scratch following a theme of Light and Dark I created a factory building game. Hey, it makes flashlights to light up the dark so yeah, it fits. </p>\n<p>Dev Log at https://youtu.be/O9hRVFi9fgA</p>\n<p>Instructions and controls in the game and repeated below.</p>\n<p>The goal is to make four different kinds of flashlights. They may take an incandescent bulb or an LED bulb and they come in 8 different colors. Start out by harvesting the materials and then start to combine them to produce components. Combine the components into bigger items until eventually producing your first flashlight. Make sure you box it up before shipping it to the warehouse.</p>\n<p>Controls: Mouse to move, Left click to place a selected building and Right click to cancel placement. Right click an existing building to destroy it. Use WASD to move the camera around (hold shift to move faster) and Q and E to zoom in and out. Finally buildings can be rotated by pressing R.</p>\n<p>What I feel to be part of the fun is figuring out just how to build something. However if you'd like a spoiler, the next paragraph will describe one of the processes. Skip it if you want to try it first.</p>\n\n<p>To make a Green flashlight, start out by harvesting Sulpher (Yellow) and Cobalt (Blue) and routing each through a refiner to create Yellow and Blue paint. Feed both of these into a Mixer to create Green paint. Find Carbon (Black) and Iron Ore (Dark Red) and harvest both of these. Feed them into a Merger to yield Metal. Feed the Metal and the Green Paint into a Painter to get Green Metal. Now go find Silica (very light yellow) and Tungsten (Grey) and feed both through Refiners to get Glass and Filaments. Merge these together to get a Bulb. Now Merge the Bulb and the Green Metal to get a Green Flashlight. Find Trees (Green) and Harvest and Refine them to get Cardboard. Merge the Cardboard with the Green Flashlight and you have a finished product. Route this to the Warehouse (in the center of the field). Since you'll need up to 100 of any given flashlight be sure to leave your assembly line intact when making the next one.</p>", "metacritic": null, "released": "2021-04-18", "tba": false, "updated": "2021-04-19T06:04:10", "background_image": "https://media.rawg.io/media/screenshots/90d/90dc0eb7e5e5534809b4b93fe06457af.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 87, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["HungryCatGames"], "genres": ["Simulation", "Puzzle"], "publishers": [], "esrb_rating": null}