{"id": 58835, "slug": "yakuza-kiwami-2", "name": "Yakuza Kiwami 2", "name_original": "Yakuza Kiwami 2", "description": "<p>Kazuma Kiryu thought his Tojo Clan days were behind him. He and the young girl in his care, Haruka Sawamura, have built a peaceful life from the ashes of conflict. All it took was a single gunshot to shatter that peace. Yukio Terada, the Fifth Chairman of the Tojo Clan, has been assassinated. With war on the horizon, the legendary Dragon of Dojima is pulled back into the world he wanted to leave behind. <br />\nKiryu must travel to Sotenbori, Osaka in an attempt to broker peace between the rival clans, but Ryuji Goda, known as the Dragon of Kansai, will stop at nothing to get his war. In this world, there can only be one dragon.</p>\n<p>Rebuilt from the ground up, Yakuza Kiwami 2 uses the Dragon Engine to update one of the series stand-out titles into a modern classic. The PC version includes all the enthusiast features you’ve come to expect: 4K resolution, unlocked framerates, customizable controls, and robust graphics options.<br />\nPlay fan favorite minigames including updated versions of the Cabaret Club simulator and Clan Creator, or check out all new additions like an arcade port of Virtual On, golf bingo, and Toylets. <br />\nAlso new to Kiwami 2 is the &#39;Majima Saga&#39; which features Goro Majima in his own playable adventure revealing events that occur prior to the game.</p>", "metacritic": 85, "released": "2017-12-07", "tba": false, "updated": "2024-03-27T12:55:42", "background_image": "https://media.rawg.io/media/games/b32/b32735e3f7d95959cc39265f555f2aa8.jpg", "website": "http://yakuza.sega.com/kiwami2/home.html", "rating": 4.37, "rating_top": 5, "added_by_status": {"yet": 227, "owned": 1965, "beaten": 364, "toplay": 246, "dropped": 27, "playing": 34}, "playtime": 11, "achievements_count": 286, "ratings_count": 370, "suggestions_count": 366, "game_series_count": 14, "reviews_count": 379, "platforms": ["PC", "PlayStation 4", "Xbox One"], "developers": ["SEGA", "Ryu ga Gotoku Studio"], "genres": ["Action", "Adventure", "RPG"], "publishers": ["SEGA"], "esrb_rating": "Mature"}