{"id": 58836, "slug": "xcom-enemy-unknown-complete-pack", "name": "XCOM: Enemy Unknown Complete Pack", "name_original": "XCOM: Enemy Unknown Complete Pack", "description": "<p>\n\nXCOM: Enemy Unknown Complete Pack inclut XCOM: Enemy Unknown, ainsi que les DLC suivants : XCOM: Enemy Within, XCOM: Enemy Unknown - Pack Soldat d'Élite, and XCOM: Enemy Unknown - Pack Slingshot.</p>\n<br/><br/>\nIssu des créateurs de Sid Meier’s Civilization, ce jeu représente l'ultime soulèvement d'une civilisation. Commandant d'une organisation paramilitaire d'élite connue sous le nom de XCOM, vous devez protéger la Terre contre une terrible invasion extraterrestre. Ce pack inclut le jeu primé XCOM: Enemy Unknown et l'extension XCOM: Enemy Within, ainsi que tous les autres extensions déjà sorties.\n<br/><br/>\n\nCaractéristiques de XCOM: Enemy Unknown\n<ul>\n<li>Base stratégique : vous devez repérer et intercepter la menace extraterrestre, tout en développant et en améliorant le quartier général XCOM. Recrutez, personnalisez et faites évoluer des agents uniques, gérez le personnel et négociez avec les gouvernements du monde entier.</li>\n<li>Combat tactique : dirigez votre escouade lors de redoutables batailles terrestres au tour par tour, effectuez des opérations clandestines et sauvez les civils au sein de villes bondées ou de régions éloignées désertes à travers le monde.</li>\n<li>Recherche sur la technologie extraterrestre : embauchez des scientifiques et des ingénieurs pour débloquer plus d'aptitudes, d'armes et d'armures sophistiquées.</li>\n</ul>\n<br/><br/>\nCaractéristiques de XCOM: Enemy Within\n<ul>\n<li>Plus de capacités de soldats : étudiez une nouvelle technologie extraterrestre pour faire évoluer les aptitudes de vos agents au niveau génétique ou créez des armures spéciales pour venir en renfort sur le champ de bataille.</li>\n<li>Plus d'armes et d'équipement : donnez un avantage tactique à vos agents grâce aux nouveaux projets de vos ingénieurs et à la fonderie.</li>\n<li>Plus de menaces ennemies : adoptez de nouvelles tactiques pour repousser les menaces de deux nouvelles races extraterrestres et d’une organisation dangereuse appelée EXALT.</li>\n<li>Nouvelle ressource stratégique : une nouvelle ressource extraterrestre de grande valeur, connue sous le nom de Mêlée, a été découverte. Récupérez-en sur le champ de bataille pour débloquer de nouvelles recherches et améliorations.</li>\n</ul>", "metacritic": null, "released": "2014-03-06", "tba": false, "updated": "2023-09-26T20:55:50", "background_image": "https://media.rawg.io/media/screenshots/d03/d033929ec29d13fb171659607cbd19d9.jpg", "website": "", "rating": 3.95, "rating_top": 5, "added_by_status": {"yet": 6, "owned": 39, "beaten": 11, "toplay": 2, "dropped": 3, "playing": 1}, "playtime": 7, "achievements_count": 0, "ratings_count": 20, "suggestions_count": 537, "game_series_count": 0, "reviews_count": 20, "platforms": ["PC"], "developers": ["Firaxis"], "genres": [], "publishers": ["2K Games"], "esrb_rating": null}