{"id": 588463, "slug": "mycorrhiza-fulminisictus", "name": "Mycorrhiza (FulminisIctus)", "name_original": "Mycorrhiza (FulminisIctus)", "description": "Welcome to a world of distorted minds. \r\n<p>Mycorrhiza is a love letter to horror manga in the form of a visualnovel. Some of our biggest inspirations include the works of Junji Ito and Masaaki Nakayama.</p>\n<p>While the protagonist is trying to find a way back home, reality distorts and people’s morals start shifting in cruel and unexpected ways. A strange plant transforming animals, a strange comedy trend and a strange building trapping people. Each of the three arcs explores different terrors.</p>\n<p>The game features a manga aesthetic (with CGs drawn by a manga artist), as well as a higher focus on dynamic audio.</p>\n<p>Join us on our adventure into despair.\r\n</p>\n<p>----------</p>\n\n<p>In the demo you'll be able to explore what lurks behind the first door. Doors two and three will follow over the course of development.</p>\n<p>Please share your opinion on the game with us! You can participate in our quick survey (https://forms.gle/3fEECYGWdGKpjjy99) or leave a comment below.<br/>You can also follow us on Twitter (@Mycorrhiza) if you'd like to be kept up to date on the game's progress and chat with us about horror manga!<br/></p>\n<p>----------</p>\n<p>If you have problems running this game on mac (\"the developer cannot be verified\") then this might be a possible solution, as confirmed by another user:<br/>https://apple.stackexchange.com/questions/408752/the-message-you-do-not-have-per...</p>\n<p>----------<br/></p>\n<p>This game was made by:</p>\n<ul><li>Game Design, Writing, Audio - Tim Reichert</li><li>Editing - Sam Carpenter</li><li>Proofreading, Editing - Tristan \"Wolf\" Barber</li><li>Programming - AlfredPros</li><li>Kinetic Text Tags - Daniel Westfall</li><li>Art Direction Assistance - Tekijaki</li><li>Monster CGs - Black Wing Bin Lan 黑翼冰嵐</li><li>Title Screen Art - missyozart</li><li>Sprites - Tokudaya</li><li>Testers - bleep, Deepest Lore, Kevin Gems</li><li>Backgrounds (Unsplash) - Liv Cashman, Jean-Philippe Delberghe, Susan Q Yin, Call Me Fred, Michael Chambers, Cole Parrant, Karla Alexander, Jonathan Borba, Bannon Morrissy, Francesca Tosolini, Nick Hillier, Nguyen Dang Hoang Nhu, Greg Panagiotoglou, Nathan Anderson</li><li>CGs (Unsplash) - Chris Benson, Prophsee Journals, Matt Artz, Crew</li></ul>", "metacritic": null, "released": "2021-04-17", "tba": false, "updated": "2021-04-19T06:27:17", "background_image": "https://media.rawg.io/media/screenshots/78f/78f4d80c4115c088ed3a30ed32867fbd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 131, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["FulminisIctus"], "genres": [], "publishers": [], "esrb_rating": null}