{"id": 588602, "slug": "breaker-castle", "name": "Breaker Castle", "name_original": "Breaker Castle", "description": "<p>Breaker Castle is a strategy game with the theme of destroying a castle with an arrangement of stones accompanied by guarding the castle as protection using arrows, spears, and gear.</p>\n<p>The iron knights fight to destroy the castle using iron balls and are supported by mass weapon attacks from the knight support troops.</p>\n<p><strong>Game modes in this game:</strong></p>\n<ul><li>This game has a total of <strong>150</strong> levels divided into three difficulty levels consisting of <strong>50 easy levels, 50 medium levels, 50 hard levels</strong>.</li></ul>\n<ul><li>Additional game mode surprises in every game update. For that, look forward to the latest version of each update of this game.</li></ul>\n<p><strong>How to play this game:</strong></p>\n<ul><li>Touch the screen by moving the iron knight left and right to bounce the iron ball in destroying boulders, guard towers and castles.</li></ul>\n<ul><li>Touch button on the screen for mass attack support with various weapons.</li></ul>\n<p><strong>Support features in this game:</strong></p>\n<ol><li> Added the arrow feature to support attacks by using coins as purchases.</li><li>Added the spiked ball feature to support attacks by using coins as purchases.</li><li>Added a catapult stone feature to support attacks by using coins as purchases.</li><li>Added the fireball feature as attack support by using coins as purchases </li><li>Added a medical support feature as healing support by using coins as purchases.</li><li>Increase the iron ball power feature by using coins as an upgrade fee. </li><li>Increase iron knight's health feature by using coins as an upgrade fee. </li><li>Quickly increase in resources can be obtained in the shop column.</li></ol>\n<p>Therefor, immediately become a part of the iron knights who are fighting to destroy the castle and use the right strategy in using attack support.</p>\n\n\n<p>Note: </p>\n<p>By paying the price listed, you can get free update service from us. The game runs without ads because you have paid, but if you want the game for free, you can download it via Google Playstore.<br/></p>", "metacritic": null, "released": "2021-04-17", "tba": false, "updated": "2021-04-19T07:03:54", "background_image": "https://media.rawg.io/media/screenshots/d89/d89c6093ac78a827942dfce88de69d7e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 183, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["DnsonGames"], "genres": ["Action"], "publishers": [], "esrb_rating": null}