{"id": 588748, "slug": "the-laboratory-collection", "name": "The Laboratory Collection", "name_original": "The Laboratory Collection", "description": "<p>“The Laboratory Collection” is a game consisting of 2 smaller games “Nancy's Quest” and “The Grand Escape” which both fall under an overarching dark story. Each in the style of a 1980s platformer and consisting of 12-14 levels</p>\n\n<p>This game is still very early development and is basically a prototype of a bigger more expanded game. For the future, we would like to add more to the story and add a lot more dialogue and overall gameplay. We plan on having it stick with the current style but possibly change game types depending on what we think will suit it best, we would appreciate any extra donations to help the development but it isn't necessary, Overall we are just super excited to see where this story and game takes us!</p>\n\n<p>Special Thanks to our voice actors https://www.castingcall.club/m/LillyL and https://www.castingcall.club/m/smoothieman22 as the voices of Nancy and William, who have made this project possible.  Also, I wanted to say thank you to the people who made the laboratory and who have worked with me and allowed me to take their story and turn it into this game! so go check them out at their youtube channel https://www.youtube.com/channel/UC3fjQC286AYHVmUjR_YG1OA that's all, have a good time playing!</p>\n\n\n\n<p><strong>Play with headphones for a better experience</strong><br/></p>", "metacritic": null, "released": "2021-04-16", "tba": false, "updated": "2021-04-19T07:38:45", "background_image": "https://media.rawg.io/media/screenshots/b06/b06612af90c8e67927275ab6c6dc5be5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 33, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["TheLaboratory1981"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}