{"id": 588788, "slug": "dreams-of-an-exile-yuri-visual-novel", "name": "Dreams of an Exile - Yuri Visual Novel", "name_original": "Dreams of an Exile - Yuri Visual Novel", "description": "<p><strong>Dreams of an Exile is a yuri visual novel with exploration elements. </strong></p>\n<p>Play as Lyra, Explore the world, Meet other exiled girls, Experience your first love, Use a super boot to jump the pits, Cut the trees, Break stones, Swim, and much more. Everything in a cute pixel art style.</p>\r\n- THIS IS A PROTOTYPE! -\r\n\n<p>Visual novel, exploration, romance, yuri, fantasy, G+G<br/><br/><br/><br/>Lyra is a half-elf who lives in a village where elves and humans have lived together in peace for centuries, protected from the monsters from outside by a magical barrier. Everything seemed peaceful until a mysterious mist started to cover the village making people sick, including her mother. Searching for a way to save her, Lyra finds in her father's notes that the solution would be outside the barrier. However, whoever crosses it can never return and becomes an exile.<br/><br/>Determined, Lyra sets out on her journey of no return and finds that the stories she heard were a farce. Investigating the reasons that led to so many lies, she meets other exiled girls. Now, she is faced with the mission of clearing the barrier and returning to her village, at the same time she can experience her first love.<br/><br/><br/><br/>💛 A cute story about a girl discovering the meaning of love, everything in an amazing pixel art style;<br/>💛 Make your own choices and experience different routes;<br/>💛 Different endings (including one without a romance);<br/>💛 A game without battles;<br/>💛 Exploration mechanics;<br/>💛 Colorful visuals;</p>", "metacritic": null, "released": "2021-04-16", "tba": false, "updated": "2021-04-19T07:49:16", "background_image": "https://media.rawg.io/media/screenshots/3b9/3b9e89bf7be740b799ec280e355b5616.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 195, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Male Doll"], "genres": [], "publishers": [], "esrb_rating": null}