{"id": 5888, "slug": "rayman-adventures", "name": "Rayman Adventures", "name_original": "Rayman Adventures", "description": "<p>The enchanted forest is in trouble; the ancient eggs that sustain the sacred tree have been stolen and scattered across the world.<br />\nEmbark on an amazing adventure through legendary worlds to help Rayman and his friends rescue the Incrediballs’ eggs to breathe new life into the sacred tree!<br />\nFEATURES<br />\n· Experience an exciting mix of ACTION and EXPLORATION.<br />\n· SEEK OUT and COLLECT all of the Incrediballs and bring them home.<br />\n· Unleash the POWER of the Incrediballs to conquer epic adventures!<br />\n· CARE for the Incrediballs: feed them, play with them and even MAKE MUSIC together!<br />\n· GROW the tallest TREE in the world and soar above the COMPETITION!<br />\n· Set off on a gorgeous adventure with AMAZING VISUALS and CONTROLS!<br />\nJump into the action and battle minotaurs, bandits and many other monsters in Rayman Adventures!<br />\nJourney through various mysterious lands, haunted medieval castles and the mythical worlds of Olympus and unravel their hidden secrets!<br />\nGame available in: English, French, Italian, German, Spanish, Russian, Brazilian Portuguese, Danish, Finnish, Norwegian, Swedish, Turkish, Korean, Japanese<br />\nPLEASE NOTE: This game is free to download and play but some game items can be purchased for real money. You can disable in-app purchases in your device&#39;s settings.</p>", "metacritic": 73, "released": "2015-10-20", "tba": false, "updated": "2023-10-10T16:59:28", "background_image": "https://media.rawg.io/media/games/66a/66ab8ca9d0d31d7f45507e5aaad976e4.jpg", "website": "http://ubi.com", "rating": 3.93, "rating_top": 4, "added_by_status": {"yet": 5, "owned": 5, "beaten": 5, "toplay": 4, "dropped": 12, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 14, "suggestions_count": 250, "game_series_count": 24, "reviews_count": 14, "platforms": ["Android", "iOS"], "developers": ["Ubisoft"], "genres": ["Action", "Adventure"], "publishers": ["Ubisoft Entertainment"], "esrb_rating": null}