{"id": 588834, "slug": "project-osiris", "name": "Project Osiris", "name_original": "Project Osiris", "description": "<p>Project Osiris is a remake/reimagining of the Amiga FPS game Alien Breed 3D, using the GZDoom engine.</p>\n<p>Alien Breed 3D was a valiant attempt at creating Doom but for the Amiga, a machine that really wasn't suited for such tasks. The pixels were huge and the viewport was tiny, but it was a technically impressive shooter considering the limitations. It even had some features over Doom - the water effects were amazing and it supported room-over-room and even texture-mapped 3D models. It was my first real experience of a proper 3D first person world in a video game so it was somewhat of a revelation to me. It may not be as tightly designed as Doom (honestly some of maps are pretty bad), but I have a lot of nostalgia for it, and it has a place in my heart.</p>\n<p>----</p>\n<p><strong>Features</strong></p>\n<ul><li>All 16 maps from the original game converted and adapted. <br/>\n</li><li>Overhauled graphics, textures and visual effects.<br/>\n</li><li>New HUD, designed not to take up most of the screen this time!<br/>\n</li><li>All 5 weapons from the original game, including new redrawn graphics - also an additional one that didn't make it into the original game, the knife.<br/>\n</li><li>Various new items including body armor, small health packs, ammo drops and and map terminals have been added.<br/>\n</li><li>All the original aliens are present and are angrier than ever with improved graphics and mechanics.<br/>\n</li><li>Three difficulty levels, that do more than just increase monster counts.<br/>\n</li><li>A new soundtrack by me under my musical name, Null Divisor, featuring 17 music tracks in total. Also lots of additional sound effects added!</li></ul>\n<p>----</p>\n<p>This is not a 1:1 recreation of the original AB3D. Lot's of things are different either on purpose to improve the experience for a modern audience, or due to limitations of the engine or my coding ability.</p>\n<p>I will continue to update the game as necessary. I also plan to add more maps from coverdisk demos of the game, but these have a different visual style and different enemies and weapons, so they will take some more time to finish. Look out for these in the future!</p>\n<p>----</p>\n<p>Thanks to Rayman the Hedgehog, Ozymandias81, Kinsie and DrPyspy for helping me out and/or letting me use stuff they made! Also HUGE shoutouts to John Girvin, whose work on extracting the original AB3D maps was basically vital for this project not to take a million years. There are further credits given inside the .ipk3 and/or during the end credits roll of the game.</p>\n<p>This is my first Doom engine project and the first time I've released a big project to the world in general. Aside from the awesome help I've gotten this is mostly a solo effort by me, and I'm not a pro at game design or anything like that, so please bear with me if you have any problems!</p>", "metacritic": null, "released": "2021-04-16", "tba": false, "updated": "2024-04-03T19:39:53", "background_image": "https://media.rawg.io/media/screenshots/0f5/0f5a93f4afd6c01e5df8aabfdf5d8b74.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 241, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["ArcturusDeluxe"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}