{"id": 589069, "slug": "boss-battle-gluttonborg", "name": "Boss Battle: Gluttonborg", "name_original": "Boss Battle: Gluttonborg", "description": "<p>X to Attack, Hold C to Heal. Healing depletes Magic and you can heal up to three hearts with a full magic meter.\r\n</p>\n<p>You can attack in every direction and if you attack downward on the enemy, you can pogo off of him like in Hollow Knight.</p>\n<p>If you can't see the Hearts or Magic Meter, trying zooming in or out on the browser. I'm not experienced with WebGL and it wouldn't let me automatically detect the size.\r\n</p>\n<p>If your browser is stuck loading, refresh the page and the progress bar should move again.\r\n</p>\n<p>My effects have improved since my first project, but I still use Instantiate vs Object Pooling and complicated coding. I'm a character artist and animator and don't have that much experience rendering backgrounds.\r\n</p>\n<p>Will have more of these boss/enemy demos in the future, but once I collect everything into a big project, most of the game won't be playable till a beta release. Follow me for more updates!\r\n</p>\n<p>This game was coded in C# using what I learned off of Youtube and Udemy, while the spritesheets were made in ToonBoom and Krita. I only have experience in 2D graphics right now.\r\n</p>\n<p>Expect many more combat options as game development progresses, like using magic for ranged/AOE attacks, dashing, wall-jump, and double jump -- basically the whole Hollow Knight schtick :D</p>", "metacritic": null, "released": "2021-04-16", "tba": false, "updated": "2021-04-19T09:03:40", "background_image": "https://media.rawg.io/media/screenshots/d43/d438ec4a34ab164ab91cc2b9f3dd7ff8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 129, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["CaptainAfrica"], "genres": ["Action", "Adventure", "Fighting"], "publishers": [], "esrb_rating": null}