{"id": 589184, "slug": "evirons-chronicles", "name": "Eviron's Chronicles", "name_original": "Eviron's Chronicles", "description": "Pour a coffee, sit comfortably in your chair and get ready to immerse yourself in the atmosphere of intellectual battles and grandiose battles. What is hidden in the ancient gaming table?<br/>\n<br/>\r\n- hundreds of creatures that can be improved and developed;<br/>\r\n- dozens of deadly spells and traps;<br/>\r\n- six brilliant generals who are waiting for the order of their sovereign to join the battle and lead the troops to attack;<br/>\r\n- battle modes with opponents-players and instances full of secrets and mysteries;<br/>\r\n- plot and daily tasks;<br/>\r\n- three worlds, united by an evil fate and exhausting war.<br/>\n<br/>\r\nIn the name of glory and power, money and new experiences you can compete in strategy and tactics with other players, or plunge into the gloomy atmosphere of mysterious dungeons, where an ancient evil that threatens the World lurks. It’s a wonderful plan to spend the coming weekend: don’t leave a comfortable chair and collect an invincible deck to bring peace to the world of Eviron.<br/>\n<br/>\r\nThe game seems incredibly simple at first glance, however, even the most sophisticated fans of collectible card games will find something to puzzle over. Regardless of experience, age and knowledge, each player will be able to choose his own playing style, ‘cos fortune favors everyone equally.", "metacritic": null, "released": "2021-04-22", "tba": false, "updated": "2021-04-23T03:33:48", "background_image": "https://media.rawg.io/media/screenshots/1b4/1b4737b06de1fb39424c3779c8dbdef8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 273, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Time Stealers Studio"], "genres": ["RPG", "Strategy", "Massively Multiplayer"], "publishers": ["Time Stealers Studio"], "esrb_rating": null}