{"id": 589177, "slug": "cognition-method-initiation", "name": "Cognition Method: Initiation", "name_original": "Cognition Method: Initiation", "description": "Cognition Method is a story-driven, first-person puzzle game combining innovative gameplay mechanics of altering gravity and a surreal, otherworldly setting. Earth is on the brink of demise when the scientists discover the Cube, a mysterious space structure of unknown origin. The Cube is believed to hold the key to solving humanity's problems and transforming mankind once and for all.<br/>Shortly after a scientific expedition reaches the core of the artifact, all contact with it is lost.<br/>It is now up to you to venture into the artifact and uncover its' secrets. You will soon learn, however, that the Cube is a bizarre and perilous place, and its' secrets are protected by a series of trials featuring impossible geometry and changing gravity.<br/>The first few levels are now available for free via a demo, to give you a glimpse of what is in store in the full game.<h3>FEATURES</h3><br/><ul><li> Look at the world from different angles - altering gravity is the core mechanic of the game, allowing the player to bend the laws of physics;<br/></li><li> Enjoy unique aesthetic of minimalist architecture, with visually clean levels constructed from concrete and sunlight;<br/></li><li> Explore the environment, full of narrative secrets to discover.</li></ul>", "metacritic": null, "released": "2021-04-22", "tba": false, "updated": "2021-04-23T03:27:46", "background_image": "https://media.rawg.io/media/screenshots/f38/f3861f263cd2891a43cab7e7a8cc4b79.jpg", "website": "http://cognitionmethod.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1, "toplay": 1, "dropped": 1}, "playtime": 0, "achievements_count": 6, "ratings_count": 1, "suggestions_count": 196, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Team Cognition"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Team Cognition"], "esrb_rating": null}