{"id": 589198, "slug": "lacuna-a-sci-fi-noir-adventure", "name": "Lacuna – A Sci-Fi Noir Adventure", "name_original": "Lacuna – A Sci-Fi Noir Adventure", "description": "<p>Another cigarette tumbles into the abyss. The sun is slowly coming up,<br />\nglistening in the sea of buildings below.<br />\nI look up at the stars one last time before they disappear.<br />\nThey don&#39;t provide any guidance. They don&#39;t give a f*ck.<br />\nI have to make this decision on my own, and very soon. Problem is, I don&#39;t know how.<br />\nI&#39;ve never been able to figure out why I do what I do. Not really.<br />\nNo more time to think. I have to go.<br />\nHere’s the deal<br />\nYou are Neil Conrad, CDI agent. Awoken by the news of a murder, you rush into a case that will soon turn your life and the whole solar system upside down. Ask questions, collect evidence, and put the pieces together until the ugly truth reveals itself... or not.<br />\nNo takebacks<br />\nThe story branches and ends based on your actions. There&#39;s no going back. Sure, you can rush your way to the end – if you don&#39;t mind paying the price. Play your cards right, and you might make it out alive.<br />\nHow far will you go?<br />\nSome questions don&#39;t have a right answer. Will you sell out a friend to protect your family? Will you endanger a loved one in exchange for public safety? Will you keep the peace or reveal the horrible, world-shattering truth?<br />\nHungry for Point &amp; Click Adventure?<br />\nWhile the classics were great in their time, Lacuna does away with the baggage of many adventure game tropes:<br />\nPointing &amp; clicking Platformer movement controls (WASD / controller)<br />\nSelecting all dialog options one by one anyway Non-repeating conversations and choices<br />\nInventory management and counter-intuitive puzzles Immersive, story-driven mysteries<br />\nPixel hunting Optional outlines on anything interactable<br />\nStory grinds to a halt at every puzzle can always be driven forward<br />\n&quot;x will remember this&quot; Real choices and multiple endings</p>", "metacritic": null, "released": "2021-05-20", "tba": false, "updated": "2023-12-28T20:41:50", "background_image": "https://media.rawg.io/media/games/fa8/fa82bd27f3b93ec4dc34572126736bc5.jpg", "website": "https://digitales.games/", "rating": 3.68, "rating_top": 4, "added_by_status": {"yet": 37, "owned": 141, "beaten": 14, "toplay": 28, "dropped": 7, "playing": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 21, "suggestions_count": 325, "game_series_count": 0, "reviews_count": 22, "platforms": ["PlayStation 5", "Xbox Series S/X", "PlayStation 4", "Nintendo Switch", "PC", "Xbox One"], "developers": ["DigiTales Interactive"], "genres": ["Adventure", "Indie"], "publishers": ["Assemble Entertainment", "WhisperGames", "Mayflower Entertainment"], "esrb_rating": "Mature"}