{"id": 589145, "slug": "suez-canal-simulator", "name": "Suez Canal Simulator", "name_original": "Suez Canal Simulator", "description": "Review from TheDad.com:  “Suez Canal Simulator Next Step in Simulator Game Evolution... Simulator games are all the rage these days. We've got the Farming Simulator series selling millions of copies. Microsoft Flight Simulator wowed players with its realistic flight physics. There’s even Lawn Mowing Simulator launching later this summer and dads everywhere are losing their minds. You’d think simulator games couldn’t get any better than this, right? … Wrong! Jason Dial’s ‘Suez Canal Simulator’ looks to shake things up and has me asking myself questions like: “Is it possible for simulator games to evolve to even greater heights?”  Read the review at: https://www.thedad.com/suez-canal-simulator-game/ <br/><br/>TAKE CONTROL OF THE SUEZ CANAL <br/><br/>Take control of the Suez Canal with this commercial-grade PC simulator that will visually and intellectually blow your mind! Pilot a ship from the Mediterranean to the Red Sea and back. Take part in prototypical northbound or southbound convoys. Travel thru Egypt and feel the wind in your hair and the sand in your eyes. A full 1:1 scale re-creation of the 193-kilometer-long waterway that changed the world, the Suez Canal!<br/><br/>BREAKING NEWS... The real Suez Canal has reopened after a nearly week-long closure due to the grounding of the 400-meter container ship Ever Given on Tuesday, March 23, 2021 due to high winds and sandstorm. Efforts to free the massive container ship succeeded early Monday, March 29, but the Suez Canal Authority needed time to inspect and repair damage to the canal before it reopened late Monday afternoon.<br/><br/><br/>While the dredgers worked to free the ship, the Internet went mad with Suez Canal memes.<br/><br/>A LITTLE HISTORY<br/><br/>The history of the Suez Canal predates Cleopatra with a manmade waterway linking the ancient cities surrounding Cairo with the Red Sea. Built under the leadership of Ferdinand de Lesseps, the Suez Canal opened for passage in 1869 and instantly revolutionized global travel and commerce. The canal was operated by the British and the French until 1956 when it was nationalized by Egyptian President Gamal Abdel Nasser. <br/><br/>The Suez Crisis of 1956 was an ill-fated attempt by the British, French, and Israelis to seize control of the canal. The Six Days War found a fleet of 15 ships stranded in the canal from 1967 until 1975, nicknamed the 'Yellow Fleet' from their decks always being covered with blowing sand. The 1973 Yom Kippur War littered the banks of the canal with the remnants of war, much of which is still visible today.<br/><br/>WHAT TO EXPECT<br/><br/>Simulating a journey thru the Suez Canal allows you to gain an understanding of what to expect on the real journey. After a trip through my Suez Canal, you will be graced with the knowledge a seasoned mariner would need in order to approach such a journey with confidence. If you plan on taking a trip through the Suez Canal then this simulator will teach you the canal waterways, the sea approaches, anchorage and port locations, and the locations of lighthouses, range lights, buoys, and signal stations.<br/><br/>If you've never been thru the Suez Canal in real life and never expect to take such a journey, have no fear, a trip thru my Suez Canal will satisfy your desire to travel through such an exotic and meaningful place with no risk at all. You'll be able to discuss this journey and its importance with anyone who has taken the real thing. And you'll probably be able to teach them a thing or two.<br/><br/>A SPECTACULAR PC SIMULATOR<br/><br/>Start just outside the canal and follow the buoys and range lights into the canal, or take the long approach from north or south and spend some time at sea as you look for land and lights. Choose your time of day. Transit the canal at night using nothing but the lights. Accelerate time or immerse yourself in a real-time simulation of a 14-hour canal transit and hours at open sea.<br/><br/>Drive legendary ocean liners, massive container ships, or Suezmax oil tankers and sail thru the canal on the winds of Egypt's fertile plain and the Sinai Peninsula. Meet ships along the way and take care to avoid collisions in the canal. Watch for traffic and signals in the canal or watch the sun rise and set over the Mediterranean and the Red Sea. With buttery-smooth physics, rich vivid graphics, and ultra-realistic atmosphere and lighting, Suez Canal Simulator will set the standard for PC simulator games for years to come.<br/><br/>FEATURES GALORE<br/><br/>Current Features: Features Include Over 600 Kilometers Of Continuous Uninterrupted Ship Tracks For Hundreds Of Hours Of Enjoyment, Travel In Either Direction North Or South From 100 Kilometers Out In The Mediterranean Sea Or The Red Sea Thru The 193-Kilometer-Long Suez Canal. Full Journeys Take Over 24 Hours. Other Features Include: Save Game, Resume, Replay, Time Compression and Manipulation, Manual and AI Weather Variability, AI Traffic Variability, Moving Map, and more!<br/><br/>Future Goals: Game Map Expansion to Increase Ship Track Distances And Time At Sea, New Journeys, Multiplayer Capability, Improved 3D Models and Textures, Wider Selection of Ships and Paint Schemes, And Soon.. Expansion To Include The New Suez Canal Channels!<br/><br/>Do you like modding games to make them your own? Suez Canal Simulator is a modder's dream - all aspects of the game world are at your fingertips. Featuring over 120,000 square kilometers of bitmapped terrain, water, and objects, you will be completely free to modify any aspect of Suez Canal Simulator in any way you choose! Use Blender or Sketchup to add new objects, make new ships and drive them in the simulator, recolor anything you want.. this platform is completely open to whatever your mind desires.<br/><br/>WITH SOMETHING FOR EVERYONE<br/><br/>Simple and fun enough for kids and accurate and thorough enough for professional training, Suez Canal Simulator offers something for everyone! Hardcore simulator fans will revel in the advanced propulsion model, video game novices will appreciate the easy-to-use menus and controls that make playing super easy! Start the simulation and your ship is underway. Increase speed with the 'D' key. Slow by cutting your power with the 'A' key, and toggle your ship's anchor with the 'Back' key to stop. Press F5 to toggle the HUD, F6 to show landmarks, and F7 to show other vessel traffic. Sound your ship's horn with the 'Space' key and change views with keys 1 thru 6. It's as simple as that. The ship is on a track and the water is holographic.. there's no chance you'll get lost and there's no chance of seasickness.<br/><br/>Own one of human engineering's most epic achievements.. own the Suez Canal!.. Get underway now, add Suez Canal Simulator to your Steam Library today!<br/><br/>SUEZ CANAL SIMULATOR... AVAILABLE NOW ON STEAM! BUY IT TODAY!<br/><br/>And Coming August 2021... PANAMA CANAL SIMULATOR.. Drive Panamax passenger and cargo ships from the Atlantic to the Pacific thru one of the Seven Wonders of the Modern World, the Panama Canal!<br/><br/>Panama Canal Simulator on Steam Coming August 2021<br/><br/>Attention Content Developers: Suez Canal SImulator needs your content to grow.. I can't build all the great ships that transit the Suez Canal by myself, I need your help. Content developers who wish to offer add-on DLC such as new ships, objects, tools, or scenery for free or for a fee in the Suez Canal Simulator Steam Store are invited to contact us at the support address on this page for more info.<br/><br/>", "metacritic": null, "released": "2021-04-20", "tba": false, "updated": "2021-04-23T03:02:53", "background_image": "https://media.rawg.io/media/screenshots/f21/f210d1fb5c28605bd36635d508f7a11f.jpg", "website": "http://suezcanalsimulator.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 171, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jason Dial"], "genres": ["Adventure", "Simulation"], "publishers": ["digitallightfoundation.com"], "esrb_rating": null}