{"id": 589135, "slug": "broken-dungeon", "name": "Broken Dungeon", "name_original": "Broken Dungeon", "description": "The Broken Dungeon calls to you, adventurer!<br/>\n<br/>\r\nBroken Dungeon is a VR roguelike game featuring procedurally generated dungeon layouts, randomized loot with stacking effects, melee and magic combat, and near unlimited replayability.  You can accomplish challenges to unlock new loot for future dungeon runs, try to beat your highest scores...or you can troll your friends as the Dungeon Master.<br/>\n<br/>\r\nBroken Dungeon supports asymmetrical local multiplayer.  While the adventurer dawns the VR headset, the Dungeon Master uses the mouse and keyboard.  As the Dungeon Master, you understand the layout of the dungeon, spend mana to spawn monsters of your choice, cast dungeon wide abilities to buff your monsters or debuff the adventurer, and send out ethereal skulls to try and attack your dungeon's invader when they least expect it.  Should all of your efforts fail to stop the adventurer, you are the final boss.  Directly fight against the adventurer on the final dungeon floor in your most powerful demonic form.<br/>\n<br/>\r\nKey Features:<br/>\r\n- Single player VR experience with AI controlled Dungeon Master<br/>\r\n- Asymmetrical local multiplayer where the VR player and mouse/keyboard player dawn two different roles against each other<br/>\r\n- Dungeons procedurally generated from a library of hand-crafted dungeon chunks<br/>\r\n- Challenges that can be completed to unlock new types of loot for your current and future dungeon runs<br/>\r\n- Multiple magic and melee weapon types, each with their own unique playstyle<br/>\r\n- Both the adventurer and the Dungeon Master scale in power and abilities<br/>\r\n- Near unlimited replayability.  Every dungeon run is different.<br/>\n<br/>\r\nCan you conquer the Broken Dungeon, or will it conquer you?<br/>\n<br/>\r\n**MOTION SICKNESS WARNING**<br/>\r\nBroken Dungeon employs both a dash/dodge mechanic as well as a gradually increasing movement speed buff.  Although, some motion sickness effects can be mitigated by playing this game while sitting on a chair or stool, individuals who are heavily prone to motion sickness should consider carefully before playing this game.", "metacritic": null, "released": "2021-04-19", "tba": false, "updated": "2021-04-23T02:55:04", "background_image": "https://media.rawg.io/media/screenshots/d26/d26b8caee5a883adfe4631e655bbacf3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 370, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SLAMS Games"], "genres": ["Action", "Indie"], "publishers": ["SLAMS Games"], "esrb_rating": null}