{"id": 589187, "slug": "slime-kingdom-an-unlikely-adventure", "name": "Slime Kingdom - An Unlikely Adventure!", "name_original": "Slime Kingdom - An Unlikely Adventure!", "description": "A lowly slime barely survives an encounter with a hero and limps(?)  his way home. He's mad about his lot in life as just a exp grab for some  dimwitted hero. He's tired of the oppression of those wandering brutes  and their swords and spells. He decides to fight back and create a safe place for slimes of all kinds to ooze about their lives.<br/><br/>This is his story...<br/><br/>You know the basic trope. A mob decides to be a hero, after some kind of  miraculous event. But THIS time, it's a slime determined to make a safe  space for him and his. The world is just like any RPG world with heroes, demon kings, dragons, etc and our gooey little friend has to  overcome them. He'll need some help to avoid being a smear on some adventurer's boot. Can he recruit a strong enough team to all to accomplish his almost impossible goal?<br/><br/><br/><strong><h3>FEATURES</h3></strong><br/><br/><strong>Meet quirky and hilarious characters in you journey.</strong><br/><br/><br/><strong>A cute, friendly, web comic feel, reminiscent of Order of the Stick and 8-Bit Theater!</strong><br/> <br/><br/><strong>Synergy-centered game mechanics based on closeness party members.</strong><br/> <br/><br/><strong>Helpful abilities called “GIFTS” that activate depending on who leads the party!</strong><br/><br/><br/><strong>Customize your party by giving them \"Talents\" learned from their enemies! <br/><br/><br/><strong>Other Features</strong><br/><ul><li>A storyline that somehow similar to That time I was Reincarnated as a Slime (even thought I NEVER watched it).<br/><br/> </li><li>Off-beat, cheesy humor that sometimes drop-kicks the Fourth Wall!!<br/><br/> </li><li>Did I mention it was CUTE?</li></ul></strong>", "metacritic": null, "released": null, "tba": false, "updated": "2021-04-23T03:35:30", "background_image": "https://media.rawg.io/media/screenshots/a6d/a6d022cb66688ef33de5028cfe82753a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 14, "ratings_count": 0, "suggestions_count": 123, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Al Baker"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["One-Man Indie L.L.C."], "esrb_rating": null}