{"id": 589170, "slug": "devathe-haunted-game", "name": "Deva｜The Haunted Game", "name_original": "Deva｜The Haunted Game", "description": "Deva is a game that is supposed to be haunted by an evil entity. It contains 4 different games that tell the story of different characters from different periods of time but have a strong connection between them.<br/><br/> Each game has its own style of gameplay and the action takes place in different years over time: <br/>-1692 which presents the foundation of the game and the appearance of the demon.<br/>-1989 which shows the rediscovery of a box lost in 1692 possessed by this demon.<br/>-1997 the game showing how the box reached a school and how a massacre took place there because of it, the school being forced to be abandoned.<br/>-2020, which tells the story of two paranormal investigators and how they find the possessed box in the school and how the demon making the transition to that object on a DVD with a video game in order to reach as many people as possible, including you!<br/><br/> The games have different gameplay, 1612 being a 2d pixelated game, 1983 a third-person game, 1997 a first-person game, and 2020 will be a game seen from the perspective of a different character than the one you control who follows you with the help of surveillance cameras, but still, you remain the protagonist of the main game, because, through all these games, the demon wants to introduce himself and communicate with you!<br/><br/><strong> Key features:</strong><br/>Enter a sinister and strange game and enjoy the terrifying atmosphere and the 4 games available!<br/>*Solve different puzzles.<br/>*Enjoy different gameplay.<br/>*Interact with other players using Deva's chat.<br/>*Use the clues you will find in the game and discover the sinister secret behind it!<br/>*Enjoy the experience!", "metacritic": null, "released": null, "tba": false, "updated": "2021-04-23T03:22:54", "background_image": "https://media.rawg.io/media/screenshots/36a/36a163c1ee8f942991e03fcf7cdd5a67.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 195, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ClawsDev"], "genres": ["Action", "Indie"], "publishers": ["ClawsDev"], "esrb_rating": null}