{"id": 589225, "slug": "my-home-my-world-design-games", "name": "My Home My World: Design Games", "name_original": "My Home My World: Design Games", "description": "Do you want to have a perfect dream home?<br/>Do you desire to have the abilities to design homes?<br/>If your answer is yes, join My Home My World: Idle Design Master  now!<br/><br/>This is a new and innovative home design game where you can freely design the home of your dream. Create your own home as you would imagine in building games or home design games.  We hope every gamer to have this feeling “my home, my design!” in the game.<br/>It is also a novel idle game, where you get to build homes entirely, as if you were living within the building game. We’ve added fresh slot machine game elements so you can easily become a coin master!<br/><br/>Unlike traditional idle games, you are not playing just one game, here you will experience the fun of many games combined, and have emotions found in home design games, coin master games, building games, etc. No matter which games, home design games, coin master games, building games or idle games, not a single one can bring you the satisfaction this game offers!<br/>It’s an idle game, but not as dull as traditional idle games!<br/>It’s a home design game, but not as wearying as traditional home design games!<br/>It’s a coin master, but it doesn’t bring anxiety due to coin scarcity as in the same old coin master games!<br/>It’s a building game, but much simpler and intriguing than traditional building games!<br/><br/>Features: <br/>● Gorgeous graphics<br/>● Large variety of unique 3D house styles, American, British, Chinese, Japanese, etc<br/>● Surreal building experience<br/>● Beautiful artwork and fine décor details<br/><br/>This is a totally free idle game! Without spending a dime, we guarantee you a super cool gaming experience no other idle games can offer. You don’t have to spend anything to become a coin master. Without spending a dime, you can design thousands of homes! We hope this will become your home design game of choice.<br/><br/>No need to invest much time in our game, you can even enjoy a cup of coffee while playing. Our idle game can keep both of your hands free! Our idle game allows you to efficiently use fragmented time to play. Anytime and anywhere you just need a couple of minutes to complete what other idle games require you one day to achieve. If you like idle games, our game will certainly become one of your favorites. Even if you don’t like idle games, you will surely accept our new definition of idle games! Because we have elements of home design games that are so hard to resist, this game especially resonates with those who feel like “I want to have my home of my dream”.<br/><br/>Full 3D home design: flooring, brushes, painting, etc, all aspects found in home design games. Windmill, villa, farm house, etc choose your own house.<br/>Finally, we’ve added some home design game extras, such as balloons or plants around your home, that will help you feel at ease.", "metacritic": null, "released": "2020-11-13", "tba": false, "updated": "2021-04-23T04:04:39", "background_image": "https://media.rawg.io/media/screenshots/ded/deda7e08ea92765fca5ab1d74946fdb4_Dtw5m6H.jpg", "website": "http://house.jxqygames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 87, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Solitaire Farm Co.,Limited"], "genres": ["Simulation", "Casual"], "publishers": ["Solitaire Farm Co.,Limited"], "esrb_rating": "Mature"}