{"id": 589231, "slug": "dragon-wars-io-click-merge", "name": "Dragon Wars io: Click & Merge", "name_original": "Dragon Wars io: Click & Merge", "description": "Become a cute dragon, destroy the city and battle against other monster creatures. Your goal is to eat everything in your path and grow bigger. Fight your way to the top of the leaderboard in this fast-paced online multiplayer game! <br/><br/>GROW THE BIGGEST<br/>Smash everything! Rampage across dragon city, eat objects and evolve into a dragon king! The more you grow, the taller the objects you can destroy! Be the biggest at the end of the round and be named Dragon King!  <br/><br/>SURVIVE DRAGON BATTLES<br/>Brawl in an arena full of other players! Challenge opponents from all over the world online. As you grow in size, you can bash smaller players and kick them out of the dragon game! Fight multiple enemies at ones or clash in PvP duels! Don’t let the bigger dragons eat you!  <br/><br/>MERGE DRAGONS<br/>Match dragons and breed the cutest and most powerful creatures you’ve ever seen! Develop your dragon nest to hold more little monsters and even earn rewards offline! The more high-level dragons you have, the more dragon coins they farm for you. Unlock them all! <br/><br/>CLIMB THE LEADERBOARD<br/>Become a monster legend! Collect as many energy points as you can before time runs out, climb to the top of the leaderboard and get the biggest reward! <br/><br/>PLAY OFFLINE<br/>Merge dragons and destroy the city without Wi-Fi! Don't worry about your internet connection, enjoy one of the best dragon games ever offline! <br/><br/>Try the best PvP IO game right now! Play for free now, join dragon wars and win! Only the biggest dragons survive in the battle arena!", "metacritic": null, "released": "2021-03-17", "tba": false, "updated": "2021-04-23T04:07:54", "background_image": "https://media.rawg.io/media/screenshots/b1c/b1c01f176805551c876bc7a3569f1a18_AENfyhW.jpg", "website": "https://devgame.me/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 132, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["DEVGEIM"], "genres": ["Simulation", "Casual"], "publishers": ["DEVGEIM, OOO"], "esrb_rating": "Everyone 10+"}