{"id": 589242, "slug": "blackout-age-rpg-survival-game", "name": "Blackout Age RPG Survival Game", "name_original": "Blackout Age RPG Survival Game", "description": "This survival game is set in a post-apocalyptic world generated on a real map. Players can start from their real GPS position, however it is possible to play without geolocation.<br/>In this top geo-survival game, the player takes care of their Shelter, hunt wild Aliens, craft Weapons, and participate in GPS Missions on the map generated around real cities. Blackout Age is a story driven RPG adventure game located in the real world.<br/>The player leads a group of scavengers who Search buildings for loot and resources, take care of other Survivors and bring the fight against the Aliens who spread like a Virus on the Earth after a global blackout.<br/><br/>Blackout Age a World full of unique aliens from around the whole Galaxy that came from far Planets and invaded Earth through the Stream of Worlds system: sci-fi technology designed for interstellar travel designed by an ancient Civilization.<br/> <br/>Hardcor Survival fans will have plenty to do in this tactical and real time survival game. They not only scavenge around their own home but they can also search the real map for unique spots in the neighborhood.<br/><br/>They can also travel and/or teleport to other player's Cities and Countries. All around the world is playable!!!<br/>So yes it is possible to scavenge Paris, London, New York, Tokyo, Beijing, Berlin, Sydney, Dubaj, Chicago, Rome and over 30000 other cities even every building be it office, store, restaurants, factories and many others .<br/><br/>This is a very important aspect to survival as Police spawn guns, Hospital gives medical supplies, local Shops have Food, Forest provides wood, Gas Station gives fuel, Kindergarten spawns toys.<br/>For players we have a real time open world sandbox survival game with millions of different buildings, ready for scavenging or shelter.<br/><br/> <br/>Unique Features<br/><br/>WORLD WIDE WAR<br/>It is the last days of the human race and we have to fight the aliens across the globe.  Each play leads scavengers to greatness and glory until the last man falls. Players are competing from over 3,500 city leaderboards. In our country Great Britain we have different leaderboards for players in London, Manchester, Liverpool, Birmingham, Leeds, Glasgoman, Nottingham, Newcastle and many more.<br/><br/>REAL WORLD APOCALYPSE<br/>Every building in real life is available for Scavenging. The player can move and start scavenging from his gps position.<br/><br/>CRAFT AND SURVIVE<br/>The player can build upgrades, and facilities inside the shelter. It is also possible to craft unique alien weapons in typical Survival Style and much needed Survival Equipment. Players can also construct buildings in their own city or country!<br/> <br/>ADVANCED LEVELING SYSTEM<br/>You can attack your enemies from a distance, defend at close quarters, increase Scouting or Scavenging Skills or any other 7 skills. Did you know that your Hero can be ex. Game Designer, Taxi-driver, Bitcoin Miner,ex- Killer or a Politician? We have 900+ different professions! Your hero has a unique approach to the world and personalities for example Sarcastic or Aggressive.<br/> <br/>STRATEGIC GAMEPLAY<br/>You have to be very careful - this is war, real war, wild and brutal. Your Heroes have perma-death! So choose wisely before you start a battle and when you should escape to avoid a situation that will be the last day they live.<br/><br/>MIXED REALITY<br/>Players can visit and loot real buildings like London Bridge, Buckingham Palace, Big Ben, The Shard, Windsor Castle, Lincoln Cathedral, Lloyd’s Building and more. For more famous buildings we prepared pictures for more immersive gameplay!<br/><br/>HUNTING TIME<br/>To be ready in this state of survival you have to fulfill many missions to understand what really happened. Why the Hoppers tribe want to spread an Epidemic to kill all mankind. How Crabbers are overtaking each planet by manipulating biological DNA. How the Demons are killing people and why they are doing this!<br/><br/><br/>Join us on Facebook &amp; Instagram<br/>https://www.facebook.com/blackoutage/<br/>https://www.instagram.com/blackout_age_survival_game/", "metacritic": null, "released": "2020-03-04", "tba": false, "updated": "2021-04-23T04:13:47", "background_image": "https://media.rawg.io/media/screenshots/879/879073ba0fa18ac47463f14dbce7daad_qb3R2Fx.jpg", "website": "https://blackoutage.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 357, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Datastrophic Games"], "genres": ["Adventure", "RPG"], "publishers": ["Datastrophic Games"], "esrb_rating": "Everyone 10+"}