{"id": 589263, "slug": "dungeon-falan", "name": "Dungeon Falan", "name_original": "Dungeon Falan", "description": "DUNGEON FALAN is a meticulously polished Match 3+ RPG Puzzle with Rogue-like elements.<br/><br/>Trace a path and match weapons with monsters to defeat them, match treasure to earn gold and buy new ITEMS, match shields to LEVEL UP your gear! Whatever you do, you gain experience and unlock SKILLS when you level up!<br/><br/>Features:<br/>- 4 Character Classes. Each class has a their own strengths and weaknesses and also features unique skills that are not available to others.<br/>- Unique skills with interesting synergies! Will you combine your skills to earn more gold and buy powerful items? Or maybe you're more into \"crowd control\" and and \"nuke damage\". Find your favourite combinations!<br/>- 4 Board Skins to choose from! Choose a different skin every run to set the mood of your adventure!<br/>- 70+ items (Weapons, Shields, Armors, Helmets)<br/>- In a rush? Try out the \"Mayhem Mode\" that lasts only for 100 turns, with 2x XP, coins, shields and skill cooldowns halved! What better way to spend your commute than grinding your way through the dungeons and unlock stuff twice as fast?<br/>- Enjoy the painstakingly crafted haptic feedback on supported phones. Like real life a board game, you will feel every tile you touch. Like a real battle, you will feel every damage you receive and inflict! Need silence? Forgot your headphones at home? You'll almost hear the sound on your fingers!<br/>- Daily Leaderboards! Compete with fellow dungeoneers and see who went deeper underground today!<br/>- Hall of Fame Leaderboard! Climb up the ladder to unlock new classes and board skins! Show your fellow dungeoneers how much you've seen in the deep underground arenas of Dungeon Falan in this \"life-time\" leaderboard!<br/>- Achievements that drive you to go deeper underground!<br/>- 120 FPS ProMotion supported for iPad Pro models!<br/><br/>Dungeon Falan is a PREMIUM game providing a unique experience with a distinct mood that shouldn't be ruined by intrusive marketing tactics. So it follows a strict NO ADS and NO IAP rule. It's a \"one person development project\" fuelled by a couple of hundred cups of coffee!", "metacritic": null, "released": "2020-10-19", "tba": false, "updated": "2021-04-23T04:24:57", "background_image": "https://media.rawg.io/media/screenshots/6b3/6b3da91f389f2ec6c152c94f64093665_VpUc9n1.jpg", "website": "http://dungeonfalan.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 83, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Burc Tuncer"], "genres": ["RPG", "Puzzle"], "publishers": ["Burc Tuncer"], "esrb_rating": "Everyone 10+"}