{"id": 589213, "slug": "piano-fire", "name": "Piano Fire", "name_original": "Piano Fire", "description": "Ever heard of EDM music? Ever had a dream of becoming a musician?<br/>Isn’t it boring to just listen to masterpieces without even trying to play them yourself? <br/><br/>Try Piano Fire now to play your favorite songs like a master without any special skills! Piano Fire is an amazing game in different genres of piano games and wonderful gameplay. It changes your smart phone into a piano in your pocket, but more than that! Piano Fire blends EDM music and piano perfectly! You can feel the collision of ice and fire, get addicted to hot and popular songs around the world! <br/><br/>Let the melody flow and feel the beat in this game!<br/><br/>How to play? It’s similar to other piano games, BUT more fun!<br/>Tap tiles continuously to follow the music melody and remember: Do not miss any tiles! Catch all the tiles to prove how fast and accurate can you play! In Piano Fire, the tiles move faster and faster gradually and you can enjoy the improve of your finger speed! Hope you can master that!<br/><br/>Features? Yes, it’s similar to other piano games, BUT not the same!<br/>-Real music feeling when tapping the tiles!<br/>-Many albums and popular songs of various styles that suit different tastes: EDM, electronic, pop, classic, rock, and more!<br/>-Cool design and incomparable visual effect.<br/>-Top-notch sound quality.<br/>-Multiple levels of increasing difficulty make this game simple to play but hard to master. Challenge the speed of your fingers!<br/><br/>Why just listen to music if you can also play with it? Do not hesitate to try Piano Fire. Here music lovers can interact with their favorite songs! This excellent piano game has more surprises in store for you than you can imagine. Play NOW!<br/><br/>We would love to hear your precious feedback to help us improve this game. If you have any suggestions for our music game or if you want us to add any songs that you like, please feel free to contact us!", "metacritic": null, "released": "2021-01-27", "tba": false, "updated": "2021-04-23T03:58:16", "background_image": "https://media.rawg.io/media/screenshots/38c/38c13dacd66b8b6ce3d488922bf4b5a3_hTh6vhK.jpg", "website": "http://musicgamestudio.top", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 86, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Shanghai Adaric Information Tech Co"], "genres": ["Casual"], "publishers": ["Shanghai Adaric Information Tech Co"], "esrb_rating": "Everyone 10+"}