{"id": 589261, "slug": "the-dark-side-2", "name": "The Dark Side", "name_original": "The Dark Side", "description": "<strong>Genre:</strong> visual novel, otome, ADV, romance, fantasy, mystic<br/><br/><strong>Average reading time:</strong> 5-8 hours<br/><br/><strong>What if the world is completely different from what you are used to seeing it? What if there are a lot of secrets in it which are protected by Guardians at all times?</strong><br/><br/>The main character of the visual novel is Diana, an ordinary girl who was brought up by a loving father. Her life was quite unremarkable until her small family was forced to move to a small town. They settled in the house of Diana’s departed grandmother. The girl is sure that the only thing that awaits her now is boredom and longing for her old friends. But things turn out to be a surprise. What if all she believed in was wrong? Will Diana be able to reveal the secret of her family and find her love?<br/><br/><strong>Features:</strong><br/><br/><ul><li>10 ending options;<br/></li><li>Fascinating plot: a mystical story in which there is a place for love, friendship and self-sacrifice;<br/></li><li>Four main male characters, each of them with his own personality, story and several endings;<br/></li><li>No in-app purchases! Once you have purchased the game, you get access to the full content of the game;<br/></li><li>Game engine. We have developed our own game engine specifically for visual novels based on Unity 3D;<br/></li><li>In-game gallery. Save your favourite images to your device.</li></ul>", "metacritic": null, "released": "2018-12-23", "tba": false, "updated": "2023-11-05T01:39:46", "background_image": "https://media.rawg.io/media/screenshots/446/446f6ef6e49ef4a9b854ce692014cae9_B3qqOzc.jpg", "website": "http://darksidegame.ru", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 231, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "iOS"], "developers": ["EyeContact Games", "Timur Gimadiev"], "genres": ["Adventure", "RPG", "Casual", "Indie"], "publishers": ["Timur Gimadiev", "EyeContact Games"], "esrb_rating": "Everyone 10+"}