{"id": 589245, "slug": "mobilesuitgd", "name": "MobileSuitGD", "name_original": "MobileSuitGD", "description": "The strategically idle mobile game MobileSuitGD is officially launched! Select your mecha and battleship, and set foot on the journey of the universe with players around the world to explore the vast galaxy!<br/><br/>Game Features<br/><br/>Casual idle, auto battle and easy upgrade<br/>Automatic collect various resources offline, you just need to allocate resources reasonably. Deploy the lineup, form a formation, and build a powerful team with the least time investment!<br/><br/>Diverse gameplay, winner takes all<br/>Say no to dull gameplay, 6 regular modes and 4 entertaining events rotate weekly, rich gameplay await for you to challenge!<br/><br/>Full series, set out on the adventure with like-minded<br/>More than ten classic animes, hundreds of mechas are going to appear to the stage, as well as popular pilots: Amuro and ν Gundam, Char and the Red Comet... we have everything you want, recruit and create your own fleet!<br/><br/>Classic retro, break the fortress with strategies<br/>Long-range precision shooting, close-range beam saber collisions, battle queues to resist the impact, give orders and switch from defense to offense. Here, you can feel the fun of being a commander in the battlefield. The rich strategy and diverse gameplay are perfectly blended, and you can write a new chapter in the vast universe!<br/><br/>This game is free to play, but there are paid services such as purchasing virtual game coins and items in the game. Please make appropriate consumption based on personal interests and abilities.<br/>Please pay attention to your gaming time and avoid indulging. Playing games for a long time could affect your work and rest. We recommend players to rest and exercise regularly.", "metacritic": null, "released": "2021-04-01", "tba": false, "updated": "2021-04-23T04:15:50", "background_image": "https://media.rawg.io/media/screenshots/ea8/ea8617c661fbfda9cc54b18122daea59_sXawqlR.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 173, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["FARNHAM REP"], "genres": ["Adventure", "RPG"], "publishers": ["FARNHAM REP"], "esrb_rating": "Teen"}