{"id": 589333, "slug": "allstar-classic", "name": "AllStar Classic", "name_original": "AllStar Classic", "description": "<p><strong>AllStar Classic is a multiplayer-only game I made years ago in my own homemade engine; I have no idea if it will run on your specific machine and make no guarantees. Please don't donate any money until you've confirmed that you can play and enjoy it first! &lt;3<br/><br/></strong><strong>I will be remaking AllStar in the future as a full release, so any feedback or ideas you may have would be stellar! Thank you so much!</strong><br/><br/>AllStar Classic is a multiplayer couch-competitive preparathon game where players build up spaceships to compete in a gauntlet of minigames. The game was created for my Master's Thesis, built from the ground up using my own homemade engine, written in C++ and using OpenGL for rendering.</p>\n<p>The game has two phases, the Assembly phase and the Challenge phase. Players start in Assembly mode, where they are dropped into an open arena.\r\n</p>\n<p>Players are given 5 minutes to roam around the arena and collect various pickups and equipment for their ships, fight AI enemies and players, and prepare for the unknown challenges upcoming Challenge Phase. Once the 5 minutes are up, players are thrown into a gauntlet of 3 random minigames, using their custom built ships to compete. Whoever wins the most points during the minigames will be crowned the winner!<br/><br/><br/><strong>Music was made by the wonderful and extraordinarily talented Fotts! Go check out their bandcamp!! </strong><br/>https://fotts.bandcamp.com/</p>\n<p><strong>Controls:</strong><br/></p>\n<p>This game supports 2-4 XInput controllers (Xbox 360, Xbox One, etc.)</p>\n<p>(<strong>Please note, you can play with one player or with keyboard/mouse setup, but these were created for debugging purposes. Some content may not work or might not be fun when played alone.</strong>)</p>\n<p>Left Stick: Move</p>\n<p>Right Stick: Shoot</p>\n<p>Left Trigger: Use Active</p>\n<p>Right Trigger: Teleport</p>\n<p>A button: Pick up/Swap active equipment</p>\n<p>B button: Pick up/Swap weapon</p>\n<p>X button: Pick up/Swap passive equipment</p>\n<p>Y button: Pick up/Swap ship chassis</p>", "metacritic": null, "released": "2021-04-22", "tba": false, "updated": "2021-04-23T04:44:45", "background_image": "https://media.rawg.io/media/screenshots/c52/c5290997bde195ed9585bfedf2e67c69.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 77, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Cloudy Games"], "genres": ["Action"], "publishers": [], "esrb_rating": null}