{"id": 589422, "slug": "ten-second-arena", "name": "Ten Second Arena", "name_original": "Ten Second Arena", "description": "<p><em>Made by Terminalmax and Adam Leon for Bullet Hell Game Jam 2021</em></p>\n\n<p>Howdy! Our first game jam (and game!) and it's been a lot of fun. From the process of choosing an engine, watching tutorials, solving problems in interesting ways, exploring different perspectives for pixel art and coming up with a fun game design, the entire process has been a blast (pun intended)! Unfortunately, we were unable to complete the game the way we wanted to. Scope-creep got the better of us and we tragically underestimated the level of work we would have to accomplish within a week! The original Game idea would have included a changing environment alongside the ten second waves of enemies, fun little themes like \"Hot Lava!\" \"Shiny Spikes!\" and \"Lights Out!\". It would be a dream to one day add a multiplayer function into this game for players to enjoy battles with friends! But that will have to come after the Game Jam. Despite all the shortcomings, we were able to finish the game with a small wave system, only a handful of the robots we designed in-game (as more than 18 different enemies were originally designed) and a shop menu system for upgrading your bot with each battle! We know it's not great but this is our first game, we have so much to learn and can only go up from here! We hope you enjoy it! </p>\n<p>P.S: Don't go easy on the critiques! We need all the helpful criticism we can get! -FGL Dev Team</p>", "metacritic": null, "released": "2021-04-22", "tba": false, "updated": "2021-04-23T05:12:22", "background_image": "https://media.rawg.io/media/screenshots/18b/18b7f20a66e678b00f00387c70f5cf16.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 43, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["terminalmax"], "genres": ["Action"], "publishers": [], "esrb_rating": null}