{"id": 589441, "slug": "sky-overflow-demo", "name": "Sky Overflow (Demo)", "name_original": "Sky Overflow (Demo)", "description": "Submission for the Bullet Hell Jam 2021<br/>GAME DOES NOT USE THEME\r\n\n\r\nRetro-inspired bullet hell shoot 'em up!\r\n<p>Inspired by <strong>Touhou series</strong> and retro games like <strong>Aero Fighters</strong> and <strong>Space Megaforce</strong>,  Sky Overflow is a classic shoot 'em up with bullet hell elements! <br/>\n</p>\n<p>Battle your way through a level full of enemies and bullets and try to defeat the boss!<br/>Optimize your way and achieve the highest score possible!</p>\r\nControls:\r\n<p><strong>In-game:</strong><br/>Arrow keys - Move<br/>Z - Shoot<br/>X - Bomb<br/>Left Shift - Focus</p>\n<p><strong>UI:</strong><br/>Arrow keys - Move<br/>Z - Submit</p>\r\nCredits\r\n<p>This game is my entry for the <strong>Bullet Hell Jam 2021</strong> and was made in 7 days. All programming and art /3d assets was made by me. <br/>SFX generated in jfxr.frozenfractal.com<br/>Music licensed by Waterflame (https://waterflame.newgrounds.com/) </p>\r\nDevelopment Notes\r\n<p>My second game jam ever, third-ish full/decent looking game developed. I'm a lot more experienced than my first jam, but still in the beginner-intermediate transition. I already had an idea for a bullet hell shoot 'em up game but never took the time to start making it, and this jam was the perfect moment. Couldn't think of anything with the 10 Seconds, but I could at least make a demo of my original idea. And the results are better than expected! Really fun working with shoot 'em up mechanics, specially bullet hell patterns. <br/>There's a lot more that I wanted to do and will do sometime, but for a 7-day game jam, this first level ended up really nice. This ain't going to be the last of Sky Overflow for sure!</p>\r\nKnown bugs\r\n<ul><li>FPS counter may or may not be right. Don't know for sure.</li><li>Bullet Counter was a testing feature, but I really liked so it ended up on the final game. But apparently it doesn't work properly, so it can be totally wrong sometimes, lol</li><li>In the 6th wave, there's a lonely enemy. He's supposed to have 4 patterns and leave, but the first doesn't activate, so that's why he keeps static while doing nothing for a few seconds</li></ul>", "metacritic": null, "released": "2021-04-22", "tba": false, "updated": "2021-04-23T05:16:45", "background_image": "https://media.rawg.io/media/screenshots/548/548db5496f98e502c5bfdbfb78ae7eb7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 81, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["pedroaurelio_n"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}