{"id": 589552, "slug": "courier-connect", "name": "Courier Connect", "name_original": "Courier Connect", "description": "Controls\r\n<p>W/A/S/D: Movement</p>\n<p><em><strong>You have invincibility on your dash so make sure to use it!</strong></em></p>\n<p>Scroll to the bottom of this page for hints!</p>\r\nDescription\r\n<p>This is our first project as Coffee Break Game Studio! We are a team of three individuals who all love video games and wanted to try our hand at making them.</p>\n<p>For Bullet Hell Jam, we took the theme of 10 seconds and extrapolated that to be a blitz of levels each 10 seconds long at the maximum. To allow players to improve over time, their position and timer is instantly reset once they get hit for instant feedback.</p>\n<p>All assets, except for the font in the top left, were created after the start of the game jam by us. Credit for that goes to Tiny Worlds!</p>\n<p>We love how this turned out, and we plan on continuing development past the jam! Stay tuned and watch our dev log for more news on that.</p>\r\nCredits\r\n<ul><li>@cath_biscuits: art</li><li>@hedgejess: programming</li><li>@juniper_dusk: programming/music</li><li>The entire team contributed to the design of the game!</li></ul>\n\r\n\r\nLevel Hints\r\n\n<ol><li>This is the \"tutorial\" level, there's no timer. Feel free to get a hang of the movement here before reaching the balloon.</li><li>Try to focus on dashing forward past the bullets at the right time.</li><li>Wait for the laser, snake left/right to dodge the boomerangs, and then dash for the goal.</li><li>Be patient, get into a safe spot, and dodge the bullets coming down by moving left to right. Then, time your invincibility going up, similar to the second level.</li><li>Find the \"safe path\" and then do two well-timed dashes upwards towards the balloon at the very end.</li></ol>", "metacritic": null, "released": "2021-04-22", "tba": false, "updated": "2021-04-23T05:44:05", "background_image": "https://media.rawg.io/media/screenshots/875/875e630e49f328414e3d5ed2dda7fa2d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 9, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["Coffee Break Game Studio", "juniper"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}