{"id": 589557, "slug": "the-night-deliverer", "name": "The Night Deliverer", "name_original": "The Night Deliverer", "description": "<p>Design and coding: @RejectCode on Discord</p><p>Coding: @raptor0999 on Discord</p><p>Music: lightvgm on Itch</p><p>You grew up poor and never had anything you wanted, but one day you won the  lottery (800 million!) and after a while felt hollow, like nothing that you would ever do mattered. But then you realized you could fix things for people that were once like you. You could deliver what they wanted in secret, because a millionaire giving out free stuff brings too much attention and prevents themselves from finding out who really needs things.</p>\n<p>CONTROLS</p>\n<p>Move - WASD or Left Control stick</p><p>Note: You may have to use Shift + U and Shift + ] below with the HTML browser build for some reason.</p>\n<p>Deliver item - U (as in use) key or X/A button on game pad while touching the house to deliver to</p>\n<p>Next item - ] key or Triangle/Y button on game pad to shift to next item in inventory to deliver</p>\n<p>GAMEPLAY</p>\n<p>The map is divided up into quadrants A B C D that start in the top left and go to the top right counterclockwise. Use the UI at the top to find what quadrant the house to deliver to is in, then match up the picture with the actual house, touch the house, then deliver the item!</p>\n<p>Watch out for guards as you are delivering items to houses, they will deduct from your score if they get close enough to see you and alert!</p>\n<p>You have 3 minutes of game time for each night to deliver all items, whereafter you are taken to the next night. See how much score you can rack up!</p>", "metacritic": null, "released": "2021-04-22", "tba": false, "updated": "2021-04-23T05:45:19", "background_image": "https://media.rawg.io/media/screenshots/03e/03e1838b6ec18a7602ebe1fff765ce2c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["raptor9999"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}