{"id": 589754, "slug": "gatotkaca-adventure", "name": "Gatotkaca Adventure", "name_original": "Gatotkaca Adventure", "description": "<p>This game was made by adapting one of the famous Wayang figures in Indonesia, namely Gatotkaca.  Gatotkaca is a puppet character who has his own \"charisma\" compared to other figures. Wire muscles and iron bones for which he is nicknamed.</p>\n\n<p>Gatotkaca<br/></p>\n<p>This Brajamusti Gugat chapter tells the story of Gatotkaca trying to reclaim his throne in the Pringgodani kingdom from Brajamusti who is the uncle of Gatotkaca himself. Will gatotkaca succeed in stopping Brajamusti?</p>\n\n<p>Brajamusti<br/></p>\n<p>In this game Gatotkaca can jump as high as the sky until it reaches the clouds because Gatotkaca is wearing an Antrakusomo Kotang shirt. Gatotkaca's supernatural powers are the magic of the soul that can penetrate the enemy's soul and destroy it from within.</p>\n\n<p>Brajamusti's Minion<br/></p>\n<p>Be careful with Brajamusti soldiers who block Gatotkaca from going to the Pringgodani kingdom. The soldiers carried large stones and threw them into the air to prevent the gatotkaca from flying. Sometimes it would be more effective to destroy the soldiers from below before jumping up.</p>\n<p>Note :</p>\n<p>I'm Sorry my game is in  Bahasa Indonesia Language </p>\n<p>I will translate it in English soon</p><p>Still in development :)</p><p>I will add more chapter / story about Gatotkaca</p>", "metacritic": null, "released": "2021-04-22", "tba": false, "updated": "2021-04-23T06:37:34", "background_image": "https://media.rawg.io/media/screenshots/89e/89eea26d028f528c609cf1589e2b58b1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Android"], "developers": ["Fridianto"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}