{"id": 58989, "slug": "the-night-journey", "name": "The Night Journey", "name_original": "The Night Journey", "description": "<p>Explore a vast, mysterious landscape on a spiritual journey. Immerse yourself in the visual artwork of internationally acclaimed media artist Bill Viola and the interactive designs of the award winning team at the USC Game Innovation Lab. Discover the secrets of this seminal experimental art game, re-mastered with new Bill Viola footage for PlayStation®4.<br />\nThe Night Journey (2007-2018) was one of the earliest experimental art games conceived. It uses both game and video techniques to tell the universal story of an individual’s journey towards enlightenment. The game design explores a challenging question: what is the game mechanic of enlightenment? How can we model such an intensely personal yet archetypal experience?<br />\nThe game has been exhibited in galleries worldwide and was awarded IndieCade’s “Most Sublime Experience” award. The project stands as a milestone in the search to expand the boundaries of what game experiences may communicate through their game mechanics and world design.<br />\n1 player<br />\n4GB minimum save size<br />\nDUALSHOCK®4<br />\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.<br />\nThe Night Journey software is © 2007–2018 USC Game Innovation Lab. All Rights Reserved.</p>", "metacritic": null, "released": "2018-06-26", "tba": false, "updated": "2020-06-11T22:36:17", "background_image": "https://media.rawg.io/media/screenshots/085/0850c28c5f0eee2740921122e7efc1f9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 4, "toplay": 1}, "playtime": 0, "achievements_count": 13, "ratings_count": 0, "suggestions_count": 216, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "PlayStation 4"], "developers": ["University of Southern California"], "genres": ["Adventure"], "publishers": [], "esrb_rating": "Teen"}