{"id": 589832, "slug": "wreck-on-the-highway", "name": "Wreck On The Highway", "name_original": "Wreck On The Highway", "description": "<p>I set out to create a twine story in three hours using the following story elements:\r\n</p>\n<p>Magnifying glass, fountain, clock, compass, eye</p>\n<p>These elements could be metaphorical or actual physical items. The core story began to take shape as I started riffing on the idea of driving down a country road at night, coming upon a wreck. That scene seemed ripe for all kinds of questions about one's mortality and the value of life. </p>\n<p>Running with that idea, in addition to the aforementioned rules, I set out to accomplish three things:</p>\n<p><strong>High player anxiety and tension throughout the game.</strong></p>\n<p>I wanted the player to feel the weight of split second decisions that have lofty repercussions. </p>\n<p><strong>Reflection on how finite and short our lives can be.</strong></p>\n<p>By the end of the story I hoped the player would not only take a good look at just how finite our time in this life can be, but also recognize the slippery slope of making a judgement on the value of human life. </p>\n<p><strong>Multiple endings.</strong></p>\n<p>I was shooting for 3, I got 5. I wanted the endings to be triggered not only by the choices you made, but also what you had in your inventory at the moment of certain choices. </p>\n<p><strong>Make the stakes seem personal.</strong></p>\n<p>To make the stakes of the game more real, I added custom info about the player's life from user input. </p>\n<p>The actual first pass time was about three hours as noted, but I could only get about 1/4th of the way through the twine before time expired. It was also my second twine story ever, so there was the obvious syntax and CSS research that accompanied the inexperience. I spent another few hours finishing it and sanding off as many rough edges as possible after my initial timeframe. </p>\n<p>Thanks for playing and would love any feedback or thoughts you might have!</p>", "metacritic": null, "released": "2021-04-22", "tba": false, "updated": "2021-04-23T06:59:21", "background_image": "https://media.rawg.io/media/screenshots/331/3314edb2c9cce894f33d2ed442c7d2dd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 31, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Chad Briggs"], "genres": [], "publishers": [], "esrb_rating": null}