{"id": 589994, "slug": "gridlock-gamma_delta", "name": "Gridlock (gamma_delta)", "name_original": "Gridlock (gamma_delta)", "description": "<p><strong>Gridlock</strong></p>\n<p>for the Weekly Game Jam with prompt \"delivery\"</p>\n<p><strong>How to Play</strong></p>\n<p>Your objective is to make as much money as possible by delivering fruit to markets on your trucks.</p>\n<p>You can place trucks and instructions from your hand onto the hex grid using your mouse, and use the scroll-wheel or A &amp; D keys to change their direction. Unless otherwise instructed, trucks move in a straight line. When they drive into a factory, they'll pick up an item and turn around. When they drive into a market, they'll drop their item off, and make you money if that's what the market requested.</p>\n<p>Factories each produce a certain kind of fruit. The fruit, and the number of fruits it has left, are marked on the factory.</p>\n<p>Markets may require a certain kind of fruit, or not care and accept any fruit. You get some money for selling the correct fruit. The amount of money, and the number of fruits the market wants, are marked on the factory. The sell price may vary over time.</p>\n<p>Control your trucks by placing instructions onto the board. When a truck drives over it, it will follow the instruction.</p>\n<p>Every so often, you get a new card and have to pay your taxes. Your tax starts low, but every mistake you make raises your tax rate. It also passively increases over time. To keep your taxes nice and low:</p>\n<ul><li>Don't let trucks collide or drive off the board</li><li>Don't try to pick up an item with a full truck</li><li>Don't drop off the wrong item at a market</li></ul>\n<p>You can force a tax cycle by clicking on your stats.</p>\n<p>If a truck crashes (into the extremely beautiful and high effort wreckage texture) you can remove the wreckage with a Cleanup.</p>\n<p>Make as much money as you can!</p>\n<p><strong>Credits</strong></p>\n<ul><li>The item textures are OpenMoji, the open-source emoji and icon project. License: CC BY-SA 4.0</li><li>The font is Open Sans by Steve Matteson. License: Apache 2.0</li></ul>", "metacritic": null, "released": "2021-04-21", "tba": false, "updated": "2021-04-23T07:39:56", "background_image": "https://media.rawg.io/media/screenshots/2d7/2d764264b8a8496a3578ccf7717407cc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 10, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["gamma_delta"], "genres": ["Action", "Puzzle"], "publishers": [], "esrb_rating": null}