{"id": 59019, "slug": "sengoku-asuka-zero", "name": "Sengoku Asuka ZERO", "name_original": "Sengoku Asuka ZERO", "description": "Samurai reborn as cute anime girls! Over 300 memorable characters!<br/><br/>Beloved in Japan with over 2 million downloads, Sengoku Asuka ZERO is finally available in English, German, and French!<br/><br/>This anime style RPG will take you back to the Sengoku period in Japan, where all its most famous warriors have been turned into cute anime girls! <br/><br/>— STORY —<br/><br/>The powerful yet mysterious Kokujō clan emerge from the chaos of battle, and their Dark Generals embark on a campaign of complete domination over western Japan.<br/><br/>You will be supporting the young and willful Sakihime, who returns home to her castle of Aoba from distant travels, only to discover it has been laid to waste by the Kokujō. As her regent, you will be tasked with taking back the country from the encroaching darkness and restoring balance to the war-torn lands of Japan!<br/><br/>— GAME FEATURES —<br/><br/>◆ Build an Army with your Favorite Sengoku Warriors ◆<br/>Create your own formidable army of ninjas and samurai from Japanese history, all re-imagined with anime visuals! Get over 300 beautifully animated and memorable characters, all fully voiced by popular voice actresses!<br/><br/>◆ Lead Your City ◆<br/>Listen to your warriors' suggestions to build a bustling town that will exceed any other! You can increase your strength while raising the fealty of your army and building your relationship with them!<br/><br/>◆ Be Tactical ◆<br/>Battle through an epic story and unleash devastating EX skills on your enemies. Knowing your warrior's elemental attributes, weapon types, and their unique skills is your key to victory!<br/><br/>◆ Join Raids, Sieges &amp; PvP Battle ◆<br/>Compete with other players or your friends in PvP and climb to the top of the leaderboards, or join them in powerful co-operative Raid battles with up to 30 players!<br/><br/>◆ Enjoy an Epic Story in Single Player Mode ◆<br/>Play through a beautifully crafted story in Sengoku Japan! Join Sakihime and her retainers across many adventures, and meet the likes of Oda Nobunaga, Tokugawa Ieyasu, and many other historical figures along the way.<br/><br/>Visit our official sites for more information!<br/><br/>Sengoku Asuka ZERO Official Homepage<br/>https://www.sengokuasuka.com/<br/><br/>Follow us on Facebook for our latest information, giveaways and events<br/>https://www.facebook.com/SengokuAsukaZERO/<br/><br/>Visit our Official Gamepedia Wiki<br/>https://sengokuasukazero.gamepedia.com/<br/><br/>Contact us for technical support at:<br/>support.sengokuasuka@zigzagame.com", "metacritic": null, "released": "2018-05-24", "tba": false, "updated": "2019-07-30T15:42:14", "background_image": "https://media.rawg.io/media/screenshots/2ce/2ce6a316917ded6c3665db3d3a99c802.jpg", "website": "https://www.facebook.com/SengokuAsukaZERO/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 389, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["ZigZaGame"], "genres": ["RPG", "Simulation"], "publishers": ["ZigZaGame"], "esrb_rating": "Teen"}