{"id": 590122, "slug": "war-of-tanks-tech-company", "name": "War Of Tanks (Tech Company)", "name_original": "War Of Tanks (Tech Company)", "description": "<p><strong> </strong>ATTENZIONE: la versione web di War Of Tanks disponibile sopra vuole essere una semplice presentazione del gioco, può dunque, presentare problemi o bug. Per godere di una esperienza di gioco ottimale e di tutte le sue funzionalità si consiglia di scaricare il gioco sul proprio dispositivo mediante i pulsanti presenti a fondo pagina!</p>\n<p>Scopri l'innovativo sparatutto 2D free-to-play per dispositivi mobili dedicato ai carri armati! Combatti battaglie 1 vs 1 contro l'IA, sali di grado e potenzia i tuoi veicoli corazzati, usa varie tattiche per vincere, quali feroci cariche o rimanere nascosto per sopravvivere. Scegli un corazzato e diventa l'eroe del campo di battaglia!\r\n</p>\n<p><strong>CARATTERISTICHE DEL GIOCO</strong><br/>• Un enorme mondo di corazzati: oltre 30 diversi pezzi per veicoli da combattimento unici ed esclusivi con modelli 2D accuratamente elaborati! Veicoli storicamente accurati, mostri corazzati provenienti da famosi universi alternativi: qui combattono fianco a fianco!<br/>• Dinamici scontri 1 vs 1 contro l'IA in 3 scenari differenti. Ogni combattimento è imprevedibile: l’esito dipende SOLO da te.<br/>• Uno sparatutto con sistema di progressione ben sviluppato. Sali di grado e sblocca gli innumerevoli componenti per il tuo personale carro. Cambia cannoni, installa equipaggiamenti, applica mimetiche e aumenta le tue probabilità di sopravvivere. Modifica i tuoi veicoli da combattimento per adattarli al tuo stile di gioco e colpisci gli avversari con la potente forza bruta della ferrea macchina da guerra del tuo dispositivo mobile!<br/>• Spettacolare grafica 2D ottimizzata automaticamente per il tuo dispositivo. Goditi le caratteristiche appariscenti di ogni arena di battaglia, modelli dettagliati dei carri, esplosioni grandiose e torrette che saltano in aria.\r\n</p>\n<p>Sito Web: https://techcompany.altervista.org/</p>\n<p> WARNING: the web version of War Of Tanks available above wants to be a simple presentation of the game, can therefore, present problems or bugs. To enjoy an optimal gaming experience and all its features we recommend to download the game on your device using the buttons at the bottom of the page!</p>\n<p>Discover the innovative free-to-play 2D shooter for mobile devices dedicated to tanks! Fight 1 vs 1 battles against AI, step up and upgrade your armored vehicles, use various tactics to win, such as fierce charges or stay hidden to survive. Choose a battleship and become the hero of the battlefield!</p>\n<p>CHARACTERISTICS OF THE GAME</p>\n<p>• A huge world of armor: over 30 different pieces for unique and exclusive combat vehicles with carefully crafted 2D models! Historically accurate vehicles, armored monsters from famous alternate universes: here they fight side by side!</p>\n<p>• Dynamic 1 vs 1 fights against AI in 3 different scenarios. Each fight is unpredictable: the outcome depends ONLY on you.</p>\n<p>• A well-developed shooter with progression system. Step up and unlock the countless components for your personal wagon. Change cannons, install equipment, apply camouflage, and increase your chances of survival. Modify your combat vehicles to suit your style of play and strike your opponents with the powerful brute force of the iron-clad war machine of your mobile device!</p>\n<p>• Spectacular 2D graphics automatically optimized for your device. Enjoy the flashy features of each battle arena, detailed tank models, grand explosions, and airborne turrets.</p>\n<p>Web Site: https://techcompany.altervista.org/</p>", "metacritic": null, "released": "2021-04-21", "tba": false, "updated": "2021-04-23T08:18:37", "background_image": "https://media.rawg.io/media/screenshots/a85/a8501f9bc951c44115eaeba1df38ef63.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 95, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Android", "Web"], "developers": ["Tech Company"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}