{"id": 5906, "slug": "fading-fairytales", "name": "Fading Fairytales", "name_original": "Fading Fairytales", "description": "Prepare to liberate the Fairytale world! Fading Fairytales is an epic roleplaying game. Meet familiar faces, enjoy addictive battles and dive into a magical story of friendship and danger!<br/><br/>• “Loving the game!”<br/>•“I like tactics games and I love how this game has got a humor touch!”<br/>•“The gameplay is great and addicting!”<br/>•“Cheers for an entertaining, addictive and well-thought game. Will be playing this in the future as well.”<br/><br/>Fading Fairytales brings together familiar fairytale characters with a unique twist. The world’s craziness is elevated to a whole new level with the emergence of a mysterious dark force. Fight the corruption of formerly good fairytale folk and take out the likes of Robin Hood, Pinocchio and Aladdin as you explore and battle through the vibrantly colorful world inhabited by some of the wackiest personas you have ever seen!<br/><br/>= FEATURES =<br/>• FREE TO PLAY<br/>• Meet familiar faces such as Robin Hood, Pinocchio and Little Red Riding Hood<br/>• Feast your eyes on beautiful visuals and animations<br/>• Follow a cinematic story with a great cast of characters<br/>• Enjoy addictive turn-based battles<br/>• Learn the basics with the help of light-weight tutorials<br/>• Gather tons of equipment and use skills to add variety<br/>• Celebrate plenty of content and gameplay to last for hours and hours <br/><br/>For customer support and any and all feedback, contact fadingfairytales@dodreams.com<br/><br/>Follow us for the latest info and game news!<br/><br/>• http://crescentmoongames.com/other-games/<br/>• http://facebook.com/crescentmoongames<br/>• http://facebook.com/Fadingfairytalesgame<br/>• http://twitter.com/cm_games<br/>• http://twitter.com/DodreamsGames", "metacritic": null, "released": "2013-04-14", "tba": false, "updated": "2019-07-30T01:27:26", "background_image": "https://media.rawg.io/media/screenshots/43b/43b997047fa36592c67d115646a9e29b.jpeg", "website": "http://crescentmoongames.com/other-games/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 147, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Crescent Moon Games"], "genres": ["RPG", "Strategy"], "publishers": ["Crescent Moon Games"], "esrb_rating": "Everyone 10+"}