{"id": 59081, "slug": "creative-destruction", "name": "Creative Destruction", "name_original": "Creative Destruction", "description": "<p>Welcome to the world of Creative Destruction where everything is fully destructible! Creative Destruction is a new FPS/TPS sandbox survival game that features the utmost fun of building and firing.<br />\nIn this virtual world, explorers can experience:Various ResortsIn this large-scale battlefield of 16,000,000 square meters, there are 13 interesting enchanted spots. In this wonderland, you can experience varied weather and time systems. There are always surprises waiting to be explored!<br />\nFree dismantling &amp; Interesting buildingBeware, all elements in sight can be built or dismantled. You are born to be armed with an secret weapon named Destructor, whereby anything can be harvested and transformed into building materials. You can build bastions at your fingertips via an innovative workshop system.<br />\nUnique WeaponryPick creative weapons, race against snowstorms, and dive into the do-or-die battle! There are 14 basic weapons including pistols, shotguns, submachine guns, rifles and sniper rifles, and also special weapons like Flame Thrower and Bowling Bomb.<br />\nDiverse gameplayOther than the classic battle royale mode, explorers can participate in various battle modes during specific time. We have developed an all-round system that integrates functions like Season, Friend, Look, Supply, Gallery, Chat and so on. Explorers will have everything they need in game. Besides, we also prepared some fun stuff hidden somewhere in the game. Hope you can find it!</p>", "metacritic": null, "released": "2018-08-02", "tba": false, "updated": "2024-04-15T13:03:00", "background_image": "https://media.rawg.io/media/screenshots/ff0/ff06832f9468edafdf4d5b3c45131545.jpg", "website": "https://www.creative-destruction.com", "rating": 2.94, "rating_top": 4, "added_by_status": {"yet": 10, "owned": 348, "beaten": 2, "toplay": 2, "dropped": 26, "playing": 2}, "playtime": 2, "achievements_count": 0, "ratings_count": 30, "suggestions_count": 415, "game_series_count": 0, "reviews_count": 31, "platforms": ["PC", "Android", "iOS"], "developers": ["NetEase Games", "ZuoMasterDeveloper", "Titan Studio", "Yuan Zuo"], "genres": ["Action", "Adventure", "Casual", "Massively Multiplayer"], "publishers": ["Netease", "Titan Studio", "Yuan Zuo"], "esrb_rating": "Teen"}