{"id": 590871, "slug": "hockey-caiman-3d", "name": "Hockey Caiman 3D", "name_original": "Hockey Caiman 3D", "description": "In Development...\r\n<p>The development of the game is not finished, your suggestions are well received.<br/>You can play as many times as you want, it's free!<br/>(thanks to everyone who supports with their donations)</p>\r\n\r\nNo está terminado el desarrollo del juego, sus sugerencias son bien recibidas. Puedes jugar todas las veces que quieras, es gratis! (gracias a todos los que apoyan con sus donaciones)\r\n\r\nHockey Table 3D\r\n<p>I making a Hockey Table 3D, it was planned as a game to be spent with family or friends, maybe make single player option, i will have to figure out how pc will play by itself.</p>\r\n\r\nHice una mesa de hockey en 3D, se planeó como un juego para gastar con la familia o amigos, tal vez hacer la opción de un solo jugador, tendré que averiguar cómo jugará la PC por sí sola.\r\n\r\n3D For PC\r\n<p>On PC you can have 2 players at the same time on split screen, up / down, they can have a score, pause the game and leave the game to restart.</p>\n<p>\r\nThere is no option to play over Wi-Fi or servers, only on the same PC.\r\n</p>\r\n\r\nEn PC puedes tener 2 jugadores al mismo tiempo en pantalla dividida, arriba / abajo, pueden tener una puntuación, pausar el juego y dejar el juego para reiniciar.  No hay opción para jugar a través de Wi-Fi o servidores, solo en la misma PC.\r\n\r\n2D For Android\r\n<p>On mobiles it is also necessary 2 players, there is still no single player option.<br/>The mobile is the game table and each player will slide his cue to try to score with the token.<br/>It is advisable to close all applications if you have a low-performance mobile.\r\n<br/>There are no costs of any kind, the game is completely free.</p>\r\n\r\nEn móviles también son necesarios 2 jugadores, todavía no existe la opción de un solo jugador.\r\nEl móvil es la mesa de juego y cada jugador deslizará su taco para intentar anotar con la ficha.\r\nEs recomendable cerrar todas las aplicaciones si tienes un móvil de bajo rendimiento.\r\nNo hay costes de ningún tipo, el juego es completamente gratuito.\r\n\r\n\r\nFind me on this links...\r\n\r\n<ul>\n<li>\r\nFacebook\r\n</li>\n<li>\r\nTwitter\r\n</li>\n<li>\r\nYouTube\r\n</li>\n</ul>", "metacritic": null, "released": "2021-04-19", "tba": false, "updated": "2021-04-23T11:31:57", "background_image": "https://media.rawg.io/media/screenshots/db4/db4595420469114773c45d8b7f9d34f5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 42, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["caimaneitor"], "genres": ["Sports"], "publishers": [], "esrb_rating": null}