{"id": 59094, "slug": "youropa", "name": "Youropa", "name_original": "Youropa", "description": "<p>Waking up trapped in a tree, with no recollection of anything, you must explore a strange fragmented city floating in the sky to learn who you are and where you fit into the world.<br />\nGravity Defying Gameplay - Walk upside down, on walls, in fact walk anywhere you can get to. Your suction cup feet let&#39;s you stick to any surface.<br />\nMind Bending Puzzles - Solve complex logical &amp; physical puzzles using your unique abilities.<br />\nEvolve &amp; Explore - Learn new abilities and use them to explore the fragmented city further.<br />\nCreate Your Own Game - Built-in level, map and character editors let&#39;s you build an entirely new game using simple tools. You&#39;ll be creating in minutes.<br />\nYou play a You (short for Youropean), a small humanoid with suction cups instead of feet, which allows you to walk up walls and on ceilings. You must use your unique ability to solve a constantly evolving set of challenges. You will encounter physical puzzles, riddles, ferocious enemies, environmental hazards and more, in an abstract but logical universe that challenges your perception of the 3rd dimension.<br />\nExpand the game by building your own levels, cities and creating your own characters. The entire game is created using the incredibly easy to use built-in editing tools. Unlock more than 450 building blocks, construct amazing levels and build entire adventures by linking the levels together on the map.<br />\nYouropa is a game about breaking rules, being upside down and thinking outside the box.</p>", "metacritic": 74, "released": "2018-06-27", "tba": false, "updated": "2023-09-03T19:32:19", "background_image": "https://media.rawg.io/media/games/fee/feee3f23f3d9cd5518f280a60e5ebbb9.jpg", "website": "http://www.frecle.net", "rating": 3.11, "rating_top": 4, "added_by_status": {"yet": 43, "owned": 775, "beaten": 6, "toplay": 9, "dropped": 9, "playing": 3}, "playtime": 1, "achievements_count": 15, "ratings_count": 19, "suggestions_count": 291, "game_series_count": 0, "reviews_count": 19, "platforms": ["Nintendo Switch", "PC"], "developers": ["frecle ApS"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["frecle ApS"], "esrb_rating": "Everyone"}