{"id": 591074, "slug": "dragon-quest-builders2", "name": "DRAGON QUEST BUILDERS2", "name_original": "DRAGON QUEST BUILDERS2", "description": "DRAGON QUEST BUILDERS™ 2 is the critically acclaimed block-building RPG from DRAGON QUEST series creators Yuji Horii, character designer Akira Toriyama and composer Koichi Sugiyama. \r\nEmbark on an epic journey and become the master Builder! Customize your character and set off to revive a forsaken world alongside a mysterious companion named Malroth. Then, take your builder online and join your friends to collaborate and create something truly magnificent. <br/><br/>Don’t let the name fool you, despite the 2, this is a completely standalone experience featuring new characters, an expansive world, unlimited building combinations, and a storyline that’s sure to satisfy long-time fans and newcomers alike!<br/><br/>This version includes: Hotto Stuff Pack, Modernist Pack, Aquarium Pack, Designer’s Sunglasses, Historic Headwear, Dragonlord’s Throne, and more!<br/><br/>STORY<br/><br/>The evil Children of Hargon are determined to eradicate all creators and have outlawed the building, cooking, and creation of all things. To spread their destructive dogma, the calamitous cult captures the builders of the world. All hope seems to be lost until you, a young apprentice builder, manage to escape from the clutches of evil.<br/><br/>After washing up on the shores of the deserted Isle of Awakening, you encounter the spirited Malroth, a mysterious youth with no memory of his past. With the help of your fearless new friend, you embark on a grand adventure to gather the skills required to become a full-fledged builder, but the road you build is paved with peril. Only you can defeat the Children of Hargon, uncover the secrets of Malroth’s past, and unravel the riddles of this mysterious land.", "metacritic": null, "released": "2021-05-04", "tba": false, "updated": "2021-04-26T03:33:07", "background_image": "https://media.rawg.io/media/screenshots/53d/53d252da5c9ddfe20816bbc90e11b727.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 243, "game_series_count": 0, "reviews_count": 0, "platforms": ["Xbox One"], "developers": [], "genres": [], "publishers": [], "esrb_rating": null}