{"id": 591022, "slug": "after-3", "name": "After", "name_original": "After", "description": "<h3>Game Play</h3>AFTER is an urban escape/exploration/survival game with original music by Brian Ring.<br/><br/>You are alone in a large city after an event has depopulated it. All you have to survive in the ruins are your two hands and the left behind junk of the city—scrounge for food to keep yourself moving while you find ways to get out of town: power the train, launch a rocket, or find less obvious ways to escape.<br/><br/>...Or just explore!<br/><br/>Whatever you do, be quick about it, because the sun is setting ...<h3>Neighborhoods</h3>The city is divided into neighborhoods of semi-randomly placed building tiles. As you explore, the city builds itself in front of you—and takes itself apart behind you!<br/><br/>The city is not entirely unpredictable, though: certain features like train lines, canals, expressways, and others will appear at predictable intervals or in the same spot—it's up to you to map them out.<br/><br/>If you find a bed, you can use it to go to sleep and save your game (as well as whichever tiles are on screen).<br/><br/>You will find that certain items will tend to spawn in similar locations: you can most often find a flashlight in an apartment bedroom, for instance.<h3>Day and Night</h3>The sun rises and sets; a full day lasts twenty minutes. Nighttime can get dark, so it's a good idea to have a flashlight on hand! And beware, at night the streets may not be entirely empty...", "metacritic": null, "released": "2021-04-23", "tba": false, "updated": "2022-10-07T04:01:21", "background_image": "https://media.rawg.io/media/screenshots/a62/a62508cf2b919d6c1224a3a3db41265d.jpg", "website": "http://www.hyperdrivegamingstudio.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 496, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Hyperdrive Gaming Studio", "MoonBat Software"], "genres": ["Action", "Adventure", "RPG", "Casual", "Indie"], "publishers": ["Hyperdrive Gaming Studio", "MoonBat Software"], "esrb_rating": null}