{"id": 591025, "slug": "sparkles-gems", "name": "Sparkles & Gems", "name_original": "Sparkles & Gems", "description": "Sparkles &amp; Gems is a unique take on the classic ball-and-paddle game, with wild power-ups, a fun and deep story, and many little treasures along the way!<br/><br/>The cast of this adventure includes four main protagonists:<br/>Softie Meow the ice cream cat<br/>Sandway the business horse<br/>OAT the plushie ferret<br/>Geometry Clown the geometry clown<h3>Story Mode</h3>A visual novel-esque experience with a wide range of characters and emotions. Dive into the character's lives and aspirations as their paths converge. Laugh, cry, and sparkle! Follow the drama of Softie Meow's journey as they contemplate their life after graduating University. What will OAT's experience be after struggling at their newest job? Can Geometry Clown find some way to move out of their extra-dimensional mom's house and live their true life as a clown bringing edutainment to all? And what exactly is Sandway's true motive? He is all about the business... but to what end? Oh, the adventures that await these four beings as they make their way through this beautiful thing called Sparkles &amp; Gems.<h3>Treasure Mode</h3>Play for treasure chests full of goodies. Defeat as many opponents in a row as you can to gain experience points, level up, and collect resources. You can use these resources you've gathered to buy and cast spells and win more matches. Try to top your high score! But not least of all, you can spend your haul to get 50 unique objects to decorate your room with! View your room from above to see your toaster, electronics, little knick-knacks, the special \"ooloophant\", and even maple syrup. They can all be yours when you conquer your opponents and increasingly level up your treasure-hunting power in this arcadey adventure!<h3>2P Mode</h3>Quick and easy local multiplayer like the olden days (or take it online with Steam's Remote Play Together). No one's victory is assured when wacky things can happen. There are only 2 buttons (left &amp; right) so anyone can play! Just jump right in!<h3>Other Features</h3><ul><li>\"Reduce flashiness\" option<br/></li><li>Character cards<br/></li><li>The Real-life Business Horse - a mini-\"documentary\"<br/></li><li>Tutorial covering the basics<br/></li><li>Customizable gameplay settings<br/></li><li>Sound and music test<br/></li><li>Dancing gremlin</li></ul>", "metacritic": null, "released": "2021-04-23", "tba": false, "updated": "2021-04-26T02:54:18", "background_image": "https://media.rawg.io/media/screenshots/40e/40e83980359dfa447af84d9fdad44dbe.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 239, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Resni", "j a r s"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Resnijars"], "esrb_rating": null}