{"id": 59102, "slug": "gene-rain", "name": "Gene Rain", "name_original": "Gene Rain", "description": "Death is always fair. He treats both the poor and the rich equally. This is the concept of the \"Death Squad\". We will control a \"Death Squad\" in the game, fighting to end the conflicts afflicting the whole world.<br/>\n<br/>\r\nWe have set 3 forces in the game. The background of the story is the beginning of the conflict between these 3 forces. Each force has its own ideas and goals that it strives for; in the game, following the story, players must control 3 main characters: Alex (half human and half robot), Salman (robot) and Li Ying (human). They will fight to end the world conflicts no matter the cost.<br/>\n<br/>\r\nThe game has a simple upgrading system. There are 9 weapons + a variety of character attributes in the game. Amongst them, 3 main weapons and all character attributes can be upgraded.<br/>\n<br/>\r\nThere are 4 types of scenes in the game: destroyed cities, quiet towns, deep canyons, and cities in dark night. There are more than 12 types of enemies in the game. We input sensations, data, and behavior into the game’s AI to let it have a human-like characteristics. Each enemy has unique attributes and detailed behavior in the game.<br/>\n<br/>\n<br/>\r\nStory background：<br/>\n<br/>\r\nIn 2049, the quantum equation proposed by Bill Feynman was satisfied. <br/>\r\nIn 2051, the operating rate of the global computers had increased by 3500 times, which made Bill Feynman a leading figure in the field of science and technology.<br/>\r\nIn 2055, Bill Feynman had successfully obtained various core human gene combinations by boosting the computer performance.<br/>\r\nIn 2057, Bill Feynman Research Institute was established.<br/>\r\nIn 2059, the world was at chaos. The disorderly development of AI had led to the increasing number of refugees. The rationality of existence was reassessed by humans.<br/>\r\nIn 2060, Bill Feynman Research Institute found a solution to change the human gene sequence and relied on its amazing technical strength to develop the airborne fog. <br/>\r\nIn 2089, humans abandoned the Common Era and then established the Gene rain as the first year of an era. <br/>\r\nTwenty years after Gene rain, the drawbacks of gene sequence came to emerge and the unknown creatures entered the human world. This is where our story begins.", "metacritic": null, "released": "2018-07-17", "tba": false, "updated": "2019-08-28T21:59:25", "background_image": "https://media.rawg.io/media/screenshots/343/343c68cbb2cdba8f16bd766493523311.jpg", "website": "http://www.deelinetwork.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4, "toplay": 1}, "playtime": 0, "achievements_count": 31, "ratings_count": 0, "suggestions_count": 624, "game_series_count": 0, "reviews_count": 0, "platforms": ["PlayStation 4", "Xbox One", "PC"], "developers": ["Deeli Network Technology Co", "Deeli network"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Deeli network"], "esrb_rating": "Teen"}