{"id": 591056, "slug": "fisherman-classic", "name": "Fisherman Classic", "name_original": "Fisherman Classic", "description": "Welcome to Fishy Archipelago! Go fishing, catalog your most rare fishes and sea creatures, buy and find skins, hats, boats and properties. Build your fishy empire. The retro world is yours! Fisherman Classic is a retro top-down Adventure/RPG game about fishing, exploring an open world full of beautiful scenarios and building your empire of rare fishes, money, hats, skins, boats and real estate properties.<h3>GO FISHING</h3>Fisherman Classic is set in a city called Fishy Archipelago. It consist on a very large series of islands, lakes and sea, where in each bioma you might caught different species of fishes and sea creatures. The fishes you hook depend on your boat capacity, so be sure to have a big boat if you want big fishes!<h3>CATALOG YOUR FISH AND SEA CREATURES</h3>Everything you caught is automatically placed in your Catalogue. The game will keep introducting new species during Early Access. Be sure to catch'em all!<h3>COMPLETE QUESTS</h3>Don't feel like fishing today? Go search for some quests. They're spotted on the radar and will be updated monthly. Quests may give to you money and items!<h3>BUY AND FIND BOATS, HATS, SKINS AND PROPERTIES</h3>In order to buy boats and other items you need to get money either by selling your fishes or completing quests. You can also find boats and items that are hide throughout the map! But be aware: you're going to need fuel to explore the Fishy Archipelago!", "metacritic": null, "released": "2021-04-23", "tba": false, "updated": "2021-04-26T03:19:02", "background_image": "https://media.rawg.io/media/screenshots/0bd/0bdc1b6d0db5f32a8e57825a18995dc6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 203, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["LGV"], "genres": ["Action", "Adventure", "RPG", "Sports", "Casual", "Indie"], "publishers": ["LGV"], "esrb_rating": null}