{"id": 591035, "slug": "no-plan-b-prologue", "name": "No Plan B: Prologue", "name_original": "No Plan B: Prologue", "description": "No Plan B: Prologue is a first taste of the upcoming tactical planning game No Plan B. It contains 3 skirmish missions and 3 randomly generated challenge missions.<br/>Try it for free and if you like what you see, please consider adding the full game to your wishlist! It's planned for release by the end of this year.<br/><br/>In No Plan B, every choice you make, however small, may decide the fate of your team.<br/>Assemble your squad. Work out the perfect plan. Watch it play out in real time.<br/><br/><br/><br/><br/><br/><br/>Pick your squad’s entry points and gear them up with the arsenal at your disposal.<br/>Choose from a list of firearms, armor and grenades - each with their pros and cons - to make sure your team has the right gear for the situation.<br/><br/><br/><br/><br/><br/><br/>Study the 3D map carefully and use the innovative timeline system to move and synchronize your team. Coordinate your movements, grenades and room entries to take the enemy by surprise.<br/><br/>One wrong move, one corner left unchecked, could be fatal to your mission - there’s no plan B!<br/><br/><br/><br/><br/><br/><br/>Once you’re confident your plan is perfect, the time has come to execute your actions and press that play button. Watch your orders unfold, and get right into the middle of the action with the full-control camera.<br/><br/>Planned a perfect mission? Share your replays and show off those tactical skills!<br/><br/><br/><br/><br/><ul><li>Plan, Preview, Proceed: Use the innovative timeline system and the full-control 3D camera to design and execute a perfect plan.<br/></li><li>No-fuss interface and wide-ranging mechanics with deep tactical layers.<br/></li><li>Infinite replayability: Play daily, weekly and monthly challenges.<br/></li><li>Hero or villain: Take on different missions with different stakes, rescue hostages or prep for a bank heist (we’re not judging)</li></ul><br/>", "metacritic": null, "released": "2021-04-23", "tba": false, "updated": "2021-04-26T03:03:35", "background_image": "https://media.rawg.io/media/screenshots/a21/a21b78b2e190107ae664b4126227aeb1.jpg", "website": "https://noplanbgame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 367, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["GFX47"], "genres": ["Action", "Strategy", "Simulation", "Indie"], "publishers": ["GFX47"], "esrb_rating": null}