{"id": 591042, "slug": "ludonarracon-supporter-pack-featuring-cyrano", "name": "LudoNarraCon Supporter Pack featuring Cyrano", "name_original": "LudoNarraCon Supporter Pack featuring Cyrano", "description": "We commissioned Popcannibal, developers of Kind Words, to create a brand new short game especially for LudoNarraCon 2021. The result is <strong>Cyrano</strong>!<br/><br/>This one hour adaptation of the classic stage play, Cyrano de Bergerac, invites you to fight with blades and wits. Cyrano is the greatest swordsman and wordsmith in all of France. He also has the largest nose and the fiercest temper. He has stood alone against a hundred soldiers and can best the wits of any poet alive, but when he falls in love with Roxane, he is hopeless. How could she ever love such a ridiculous nose?<br/><br/>When Roxane falls for a beautiful young soldier, Cyrano sees an opportunity to share his heart but hide his face. <br/><br/><br/><br/><ul><li> Command your small band of friends in turn based battles as you journey from Paris to Arras to fight for friendship, honor and love. <br/></li><li> Compose love letters using your own words to win Roxane’s heart. <br/></li><li> Take center stage in one of the greatest plays ever written!</li></ul><br/><br/><br/><br/><br/>Our lovely cohort of exhibitors for the 2021 event have contributed tracks from their soundtracks to create this amazing compilation of the sounds of LudoNarraCon. <br/><br/>The album includes 36 tracks of music from Haven, Genesis Noir, Not for Broadcast, Teacup, Paradise Killer and many more and comes with WAV files.<br/><br/><br/><br/>Feast your eyes for days with this treasure chest of wallpapers from over 30 games, as well as the poster art from all three LudoNarraCon events. The pack will include desktop &amp; mobile wallpapers in a range of resolutions, with gorgeous art from more than 30 games!<br/><br/><br/>All of Fellow Traveller’s proceeds from this supporter pack will go towards the costs for running LudoNarraCon. The more money we raise from sales of this pack, the bigger and better we can make future events.<br/><br/>We also have ideas for other initiatives to support narrative game developers all year round including a podcast focused on narrative games and their development, a newsletter highlighting interesting indie narrative games and a program to help emerging developers get their narrative games on to Steam. Any money raised beyond our target will go into pursuing some of these initiatives.<br/><br/>", "metacritic": null, "released": "2021-04-23", "tba": false, "updated": "2021-04-26T03:09:37", "background_image": "https://media.rawg.io/media/screenshots/e67/e6703b1f86a5dc7d4b6aea788d4cc39c.jpg", "website": "http://ludonarracon.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 28}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 301, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["Popcannibal", "LudoNarraCon"], "genres": ["Adventure", "Indie"], "publishers": ["Fellow Traveller"], "esrb_rating": null}