{"id": 591103, "slug": "score-hero-2", "name": "Score! Hero 2", "name_original": "Score! Hero 2", "description": "A NEW HERO! The brand new sequel to the award winning, chart topping, mobile smash hit! <br/><br/>You are unknown but your potential is extraordinary. You know your talents must be released for the world to see!  Unleash your Hero on a glittering career by shooting, passing and scoring your way to superstardom!   <br/><br/>Incredible graphics, showcasing glorious animations and hyper-realistic gameplay! Now with officially licensed, REAL clubs and leagues! Authentic kits and badges give the ultimate soccer experience! You'll be at the heart of the action as you guide your Hero from hot prospect to global superstar!  <br/><br/>This is a soccer sequel like no other for a game that is like no other!!!<br/><br/>FEATURES<br/>• REVEL in an exciting new story following your Hero's soccer career!<br/>• SCORE amazing goals, PICK out that killer pass and CURL your screaming shots into the top corner!<br/>• PACKED with over 90 officially licensed teams from some of the world's greatest leagues! Who will you sign for?<br/>• ENHANCED graphics, ENRICHED motion-captured animations and with the same instantly recognisable \"pick-up and go\" gameplay<br/>• BRAND NEW Infinite Hero mode, How far will you go?<br/>• INSTANTLY RECOGNISABLE commentary from one of the world's top commentators, ARLO WHITE!!<br/>• HAND-PICK your Hero's unique look and customise his appearance.<br/>• TRIUMPH WITH TROPHIES as you progress through your career and unlock great prizes!<br/>• CONNECT to Facebook to sync your progress across devices<br/><br/>Take your chances, score the goals, be the HERO!<br/><br/>IMPORTANT<br/>• This game is free to play, but additional content and in-game items may be purchased for real money. To disable In App Purchases, go to Settings/General/Restrictions.<br/>• This app contains third party advertising.<br/><br/>VISIT US: www.ftgames.com<br/>LIKE US: facebook.com/scoreherogame<br/>FOLLOW US: twitter.com/firsttouchgames<br/>WATCH US: youtube.com/firsttouchgames", "metacritic": null, "released": "2021-04-21", "tba": false, "updated": "2021-04-26T03:47:16", "background_image": "https://media.rawg.io/media/screenshots/ec0/ec0c281b5f5fc943adbdd824698af343_nZMNNvS.jpg", "website": "http://www.ftgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 201, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["First Touch Games"], "genres": ["Action", "Sports"], "publishers": ["First Touch Games"], "esrb_rating": "Everyone 10+"}