{"id": 591119, "slug": "cyberika-action-adventure-cyberpunk-rpg", "name": "Cyberika: Action Adventure Cyberpunk RPG", "name_original": "Cyberika: Action Adventure Cyberpunk RPG", "description": "<p>Cyberika is an action-adventure MMORPG with a deep storyline set in a cyberpunk universe. Are you ready to explore a city in the near future called Bradbury Complex?<br />\nMeet its inhabitants, complete important quests, fight with freaky punks in dark backstreets and race through neon lit streets in your sports car. Who knows, maybe on your way home you’ll stop in downtown to install another body implant or grab some ramen?</p>\n<p>[ CYBERPUNK RIGHT NOW ]<br />\nThe city is full of contradictions, the streets overflow with poverty and future technology side-by-side. Money and guns solve most problems here. The police are powerless. Survival of the fittest is the only law. An exciting adventure awaits as you start your journey in a humble apartment on the city’s outskirts. In time you’ll be able to buy fashionable clothes, finest weapons, get the fastest car imaginable and move into a penthouse in the Downtown.</p>\n<p>[ BE THE BEST. BE UNIQUE ]<br />\nIn this cyberpunk world there’s no place for weakness. If you lack of speed, strength or hacking skills, just go and get your body improved. It’s what in Bradbury Complex we call Get-The-Augmentation. Upgrade your weapon, skills and body to be the best hired gun in the city. And to make sure you always stand out in the crowd, customize your car, jacket or gun.</p>\n<p>[ HEART OF THE CITY ]<br />\nMove to Downtown to be in the center of the action, and the nightlife. Here you’ll always find a huge number of other players, as well as stores, cafes, casinos and nightclubs at your service.</p>\n<p>[ IMPRESS YOURSELF IN THE STORY ]<br />\nThe city’s neighborhoods look nothing alike and each is controlled by a different gang. Our immersive storyline will take you to every corner of Bradbury Complex. Ready to drop in on another hacker to make plans for robbing a secret laboratory? What about jacking a rare sports car for a favorite auto mechanic?</p>\n<p>[ ADVANCED COMBAT SYSTEM ]<br />\nThere’s a whole arsenal of weapons available to you, from bats and pistols to laser swords and energy rifles. Don’t forget about the cyber implants that can give you superhuman abilities in battle. Find your own tactics to defeat different opponents, from your everyday street punks and cyber-hounds all the way up to military robots, cyber-ninjas and bosses.<br />\n[ SPEED IS FREEDOM ]<br />\nYour awesome car is more than a convenient way of getting around the city’s neighborhoods. It has style and soul. You can trust the autopilot with your route, but sometimes it’s better to take the wheel in your hands to get somewhere in time or escape a high-speed chase.<br />\n[ UPGRADE YOUR HOME ]<br />\nThere’s a place where you can relax, take a shower, and order your favorite noodles from The Slurp Shop. A place where you can fix up your guns and equipment or install new implants. A place where you’re safe. Your apartment. It might not look like a lot, but it’s functional, and you’ve got an uplink to the net and virtual reality. And, sooner or later, you’re gonna move up in the world, literally.<br />\n[ ON WAVES OF SOUND ]<br />\nEvery minute, every adventure in Cyberika is accompanied by the leading exponents of retrowave and synthwave, Magic Sword and Power Glove among them.</p>\n<p>[ WANT MORE? ]<br />\nComing soon are major events in multiplayer mode, including co-op raids and clan wars. You can also get access to cyberspace, the battle for which will be even fiercer. Careful or you might end up in cyber-prison (and escaping is easier planned than done).<br />\nCheck our website http://cyberika.online<br />\nJoin our Facebook community: https://facebook.com/cyberikagame<br />\nOur Instagram: https://instagram.com/cyberikagame/<br />\nDiscord community: https://discord.gg/Sx2DzMQ<br />\nOur Twitter: https://twitter.com/cyberikagame</p>", "metacritic": null, "released": "2021-04-10", "tba": false, "updated": "2023-11-23T11:48:38", "background_image": "https://media.rawg.io/media/games/2c3/2c3dbc66b884587ea1eb3ab7d6f1fe00.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 437, "game_series_count": 1, "reviews_count": 2, "platforms": ["Android"], "developers": ["Kefir!"], "genres": ["RPG"], "publishers": [], "esrb_rating": "Teen"}