{"id": 59119, "slug": "motorsport-manager-mobile-3", "name": "Motorsport Manager Mobile 3", "name_original": "Motorsport Manager Mobile 3", "description": "<p>Motorsport Manager Mobile 3 is the ultimate race team strategy game.<br />\nBuild up your very own motorsport team from scratch, making every big decision. Hire the drivers, assemble the team, develop your car and mastermind your way to glory.<br />\n• This is your racing team. Hire drivers, develop your car and invest in technology.<br />\n• Work with your drivers to achieve the perfect qualifying lap.<br />\n• Formulate the ideal pitstop strategy to win races.<br />\n• Watch the race in real-time or jump into the strategy screens to take control of the action.<br />\n• React to weather changes, crashes and safety car periods.<br />\n• Win championships across the world to reach the pinnacle of motorsport.<br />\nNew in MM Mobile 3<br />\n=====================<br />\nGT AND ENDURANCE RACING<br />\nWith 6 new championships, MM Mobile 3 is bigger and better than ever before. GT races bring action-packed, wheel-to-wheel action, while Endurance is a Motorsport Manager’s ultimate strategic challenge, with 3 drivers per car and timed races!<br />\nA STUNNING SETTING<br />\nMonaco makes its Motorsport Manager debut! Manage your cars around la Rascasse, Casino Square and the Swimming Pool. It’s the ultimate test, rendered in a beautiful, detailed new art style.<br />\nNEW FEATURES<br />\nThe Supplier Network sees managers grow their team’s presence around the globe, while Invitational Races are huge annual events, bringing international races with a unique twist. Mechanics are the new members of your team, and their relationship with the driver is all-important!<br />\nGAME CHANGERS<br />\nVotes on rule changes, dynamic AI team movement (including teams going bust and being replaced) and new difficulty settings mean that the world of motorsport constantly evolves – but the challenge stays at your level.<br />\nON-TRACK ACTION<br />\nEnergy Recovery System, with Hybrid and Power modes, mixes up every race! Will you boost your way past your rivals into clear air, or smartly manage your fuel levels to pull off a genius strategy?</p>", "metacritic": null, "released": "2018-07-18", "tba": false, "updated": "2019-08-02T04:40:00", "background_image": "https://media.rawg.io/media/screenshots/c42/c42ef5b894e116fac1c4c3d485df2b9d.jpg", "website": "http://www.playsportgames.com/games/motorsport-manager-mobile-3/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "beaten": 2, "toplay": 1, "dropped": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 4, "suggestions_count": 360, "game_series_count": 0, "reviews_count": 4, "platforms": ["Android", "iOS"], "developers": ["Playsport Games"], "genres": ["Strategy", "Sports", "Racing"], "publishers": ["Playsport Games"], "esrb_rating": null}