{"id": 59123, "slug": "battlezone-1980", "name": "Battlezone (1980)", "name_original": "Battlezone (1980)", "description": "The year is 1999, and the nations of the earth have declared a world-wide peace plan. But there is a problem with the proposed truce. A council of military commanders has unleashed battalions of automated weapons into the countryside. These aerial fighters, flying saucers, tanks, and supertanks will turn the world into a lifeless landscape unless you can stop them.<br/>\n<br/>\r\nLuckily, you've discovered an old military tank hidden inside the museum. Use your Joystick to steer the tank as you search for enemy automatons. Since your electronic periscope only gives you a front view from the tank, you'll have to rely heavily on your radar screen to detect the enemy. If you see a blip on the radar, you need to move fast! Use your Joystick to turn your tank until the enemy appears on the screen; press the red controller button to fire your turret gun.<br/>\n<br/>\r\nYou have five tanks to complete your mission. Your tank will be destroyed each time it is hit by enemy fire.<br/>\n<br/>\r\nThe enemies you'll encounter are:<br/>\n<br/>\r\nTANKS<br/>\r\nTanks are your most common enemy. They move a bit slower than your tank, and can be identified by their blue turrets.<br/>\n<br/>\r\nSUPERTANKS<br/>\r\nThese look like regular tanks, but have yellow turrets and can move faster than your tank.<br/>\n<br/>\r\nFIGHTERS<br/>\r\nFighters always appear directly in front of you then zigzag toward your tank. When a fighter reaches point-blank range, it will veer to the side and fire an anti-tank shell directly at you. You can identify a fighter by the \"buzz\" sound it makes as it flies.<br/>\n<br/>\r\nFLYING SAUCERS <br/>\r\nFlying saucers do not fire at you, but are hard to hit and can distract you when a tank, a fighter, or a supertank is firing at you.", "metacritic": null, "released": "1980-01-01", "tba": false, "updated": "2023-11-11T14:51:09", "background_image": "https://media.rawg.io/media/games/0d2/0d2d6f345cd77639d65a235cb7dd0a21.jpg", "website": "", "rating": 3.17, "rating_top": 4, "added_by_status": {"yet": 3, "owned": 13, "beaten": 10, "toplay": 6, "dropped": 8, "playing": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 12, "suggestions_count": 115, "game_series_count": 0, "reviews_count": 12, "platforms": ["Atari 2600", "Apple II", "Atari 8-bit", "Atari ST", "Commodore / Amiga", "Atari Lynx", "Game Boy"], "developers": ["Atari"], "genres": [], "publishers": ["Atari"], "esrb_rating": null}