{"id": 591217, "slug": "dahlas-journey", "name": "Dahla's Journey", "name_original": "Dahla's Journey", "description": "<p><em>After a lifetime of working on a meaningless dead-end job for The Corporation, a small sentient being named Dahla embarks on a journey to discover the meaning of life. After exhausting her resources and spending all her savings, she travels far and reaches The Tower, where all living things go to be granted their Final Wish by The Power and then be released to transcend this life. The growling voice of The Power sounds astonished by her straightforward, unusual request, and throws her in the depths of The Pit, the infamous underground levels of The Tower. She must now face grave dangers unknown to her kind, with the promise of the greatest reward of all — pure, unfiltered knowledge.</em><br/><br/>This is a turn-based game!<br/><br/>Use the ARROW KEYS or WASD to move to an adjacent tile or attack an enemy on an adjacent tile. After you move, enemies will take their turn and move. Beware, they're unpredictable!</p>\n<p>Look where you're going! If you stop on a tile adjacent to an enemy, the enemy will attack you. Every time you get attacked, you lose one damage, and if your health goes to zero, you die -- permanently! No backsies.</p>\n<p>Reach the vortex to advance to the next level. How deep can you go?<br/><br/>All art, music and programming was created by PiJaMar using Construct 3, ASeprite, Beepbox and SFXR.<br/><br/>This game was created for the 48th edition of the Ludum Dare Jam (Compo).<br/><br/>Font \"Matchup PRO\" created by Eeve Somepx.</p>", "metacritic": null, "released": "2021-04-26", "tba": false, "updated": "2021-04-26T04:24:28", "background_image": "https://media.rawg.io/media/screenshots/3c7/3c7acd52e4d733ca223bb14998525d09.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 24, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["PiJaMar"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}