{"id": 59153, "slug": "battlezone-combat-commander-multiplayer-free-weeke", "name": "Battlezone: Combat Commander - Multiplayer Free Weekend", "name_original": "Battlezone: Combat Commander - Multiplayer Free Weekend", "description": "Le week-end multijoueur gratuit s'achèvera le 30 juillet à 19 h CEST.\nAprès cela, la version démo sera automatiquement supprimée de votre bibliothèque de jeux.\n<br/><br/>\n<p>\nConsultez notre promo sur la franchise Battlezone, jusqu'à -75%</p>\n<br/><br/>\nJadis des ennemis jurés, les États-Unis et la Russie ont abandonné leur course à l'espace et unissent désormais leurs forces pour faire face à une attaque extraterrestre imminente. Formant ainsi le groupe d'élite International Space Defence Force, ils vous recrutent pour les aider à mener la résistance, avant que la race humaine ne soit totalement anéantie.\n<br/><br/>\nLe système solaire est en guerre. À vous de prendre les commandes.\n<br/><br/>\nBattlezone: Combat Commander est de retour, avec des graphismes plus beaux que jamais, des succès inédits, une aide au modding et bien plus encore ! \n<br/><br/>\nBattez-vous dans 24 missions intenses, à travers 6 mondes vivants et exotiques, en quête d'un métal organique abandonné sur les champs de bataille, afin de pouvoir créer des unités puissantes, des défenses imprenables et des installations importantes.\n<br/><br/>\nCOMMANDEZ UN BATAILLON\nPrenez le contrôle de plus de 30 types d'unités différentes, comme des chars destructeurs et des unités terrestres coriaces ou encore des marcheurs imposants et un soutien aérien acharné, pour combattre l'ennemi dans des combats intenses à la première personne.\n<br/><br/>\nUNE IA AVANCÉE\nLes unités se développent et s'améliorent en gagnant de l'expérience au combat : les nouvelles unités se battent comme des recrues, tandis que les unités plus expérimentées seront plus efficaces et effectueront des manœuvres de déplacement, changeront d'arme en fonction de leur situation ou se replieront même en cas d'urgence.\n<br/><br/>\nDES GRAPHISMES REMASTERISÉS\nDécouvrez Battlezone: Combat Commander sous un tout nouveau jour, doté d'un rendu DX11 inédit avec shader et d'un terrain plus détaillé avec de toutes nouvelles textures.\n<br/><br/>\nMESUREZ-VOUS À D'AUTRES JOUEURS\nInvitez vos amis pour une expérience multijoueur en cross-play, incluant le mode classique de Match à mort et un mode coopératif \"MPI\" où les joueurs doivent faire équipe pour l'emporter, en organisant leurs capacités offensives et défensives, ainsi que leur collection de pièces détachées.\n<br/><br/>\nAIDE AU MODDING\nProfitez des mods créés par la communauté grâce au système de modding comme, par exemple, de nouveaux mods de cartes à un joueur et multijoueur, de nouveaux véhicules, interfaces, ressources, scripts personnalisés et bien plus.", "metacritic": null, "released": "2018-02-28", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/c7a/c7ae34b4e0a9e204f8271a09563dc8d4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 418, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Big Boat Interactive"], "genres": [], "publishers": ["Rebellion"], "esrb_rating": null}