{"id": 591545, "slug": "search-and-resque", "name": "Search and Resque", "name_original": "Search and Resque", "description": "WARNING! The web version is NOT WORKING AS INTENDED. The map is supposed to have a mass of digable ground that blocks some of the passages. Unfortunatelly WebGL does not handle that.  You can still explore the facility and find all the miners, but the key mechanic of the game is missing. If you want to play the game as it was intended to me played - use one of the downloaded versions.\r\n\n<p>Welcome to Search and Resque. A game where you have to take up a mantle of a search and resque operative and descend into a mining facility that sustaind some damage from eathquake.</p>\n<p>You need to find all the miners who are still stranded down there.\r\n</p>\n\n<p>The game contains a tutorial within it, but just in case you are wondering - WASD for movement and mouse for look direction. Left and Right mouse button activate your lock opening and Digging tools respectively.\r\n</p>\n<p>The game contains no sound - this is quite usual for my games, and this one is not an exception. Still going to leave sound voting on to let you guys gem more karma - feel free to rate it a 1.\r\n</p>\n<p>The game utilizes a marching cubes algorythm to generate mesh for digable area. It is written in such a way so if you so wish you can find an exit on the lowest level of the facility and keep diffing deeper and deeper and it will not limit you. Unfortunately this came with a hefty performance cost. I pulled every trick to optimize the code (except offloading the computations to GPU which is arguably the only correct fix to this algorytm) but it might still take a toll on your CPU.\r\n</p>\n<p>Hope you have fun!</p>", "metacritic": null, "released": "2021-04-25", "tba": false, "updated": "2021-04-26T05:43:36", "background_image": "https://media.rawg.io/media/screenshots/709/709adf7598bd04e13f95b40042339af3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 4, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["Hilvon"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}