{"id": 591659, "slug": "canyoneer", "name": "Canyoneer", "name_original": "Canyoneer", "description": "<p>My entry for the Ludum Dare 48 Compo game jam!</p>\n<p>The theme is <strong>Deeper and Deeper</strong>.</p>\n<p>Well, try exploring deeper and deeper down this canyon with nothing but your trusty rope. Can you survive all the way? Can you be the fastest to reach the floor?</p>\n<p>As in the Ludum Dare Compo rules, everything was made by my fair hands in just 48 hours.</p>\n<p>If you're interested in how my jam went, there's more info below. Otherwise, I hope you enjoy, and don't forget to post your best scores in the comments!</p>\r\nSource\r\n<p>The source code and all assets are freely available here:</p>\n<p>https://github.com/kwoodhouse93/LD48</p>\n<p>Be warned, it's a bit of a mess.<br/></p>\r\nHow my LD48 went\r\n<p>I tried to avoid the most obvious interpretations of the theme, but still ended up with something pretty literal - trying to get deeper down a canyon. I had the idea of using a physics-based rope to negotiate a rocky environment where falls kill you easily.</p>\n<p>To begin, I made a simple ground sprite in Photoshop, slapped on a 2D physics collider and started playing around with a few movement mechanics: jumping, walking, and eventually using a rope to descend and swing.<br/></p>\n\n<p>Once I had some satisfying movement mechanics down, I looked into terrain generation (more on that below). Once I was able to generate a simple canyon for the player to navigate (the red pixels above), I moved on to prettying it up a bit.</p>\n\n<p>With the core gameplay mostly sorted (but a bit buggy), I cracked on with putting together some UI.  That left me with the screenshot below by the end of day 1.</p>\n\n\n<p>Day 2 picked up with creating sound effects, music, a title menu, tutorial/intro scene. Also plenty of playtesting and fixing as many of the slightly broken bits as I could, plus adding a little bonus music and visuals for anyone who makes it to the bottom of the canyon!</p>\n<br/>\n\n<p>I'm pretty happy with how this has turned out in the time.</p>\n<p>Finally, I'll just pick out a couple of highlights and some major issues I wish I could have fixed already.</p>\r\nHighlight: Background and player rendering\r\n<p>I really like the visual effect on the background and the player. To do this, I created a texture in code with a low pixel count. For each pixel, we sample a colour from a gradient, but with just a bit of randomness to make the image a bit 'noisy'. It's essentially dithering, but we redraw the image every 200ms with new random samples, producing this effect of constantly shifting noise.</p>\r\nIssue: Rope physics\r\n<p>The rope is simulated using Unity's 2D physics simulation. It works well most of the time, but occasionally behaves really weirdly. I think it happens when it can't meet the constraints on the joints between each rope segment. This sometimes causes the rope to violently shake, usually killing the player if they try to dismount.</p>\n<p>I think the fix is to reimplement the rope physics another way. I tried implementing it with Verlet integration. It actually worked fairly well, but I had trouble getting it to interact nicely with Unity's 2D physics engine. I think I'd need to do quite a lot to get this to work.</p>\r\nIssue: Terrain generation\r\n<p>This is the first time I've tried procedurally generating any kind of terrain. My approach was to generate a height map from a 1D Perlin noise for each wall of the canyon. That gives a fairly nice shape to the canyon wall, but there's not much there for the player to actually stand on.</p>\n<p>I'd love to have come up with an algorithm for placing features like caves, ledges and forks. In the interest of time, I settled for just placing ledge prefabs randomly in the canyon, aiming for a distribution that is usually somewhat playable. You still sometimes end up with gaps you can't actually negotiate without dying, which is really frustrating to play. This might be a topic to revisit and experiment with some more.</p>", "metacritic": null, "released": "2021-04-25", "tba": false, "updated": "2021-04-26T06:14:06", "background_image": "https://media.rawg.io/media/screenshots/b13/b13b255dec27bbca4f8523a9de222741.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 9, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["Kieron"], "genres": ["Adventure", "Simulation", "Platformer"], "publishers": [], "esrb_rating": null}