{"id": 592046, "slug": "max-in-the-2c-verse", "name": "Max in the 2C-verse", "name_original": "Max in the 2C-verse", "description": "<p>After an incident Max is trapped between 2 color dimensions the black and the white. No more shade of grey everything is black or white around him. His only chance to get out of this is to travel through dimensional portals, hopping one will free him...<br/><br/>How to play:<br/></p>\n<p>This game is a 2-player network game. There are severals options to try it:</p>\n<ul><li>Ideally you have 2 players and 2 computers in the same local network (connected to the same router) in this case players can simply connect with local ip. (The local ip of the host is diplayed on the host screen).</li><li>Otherwise you can play via internet with anybody around the world by port forwarding the port 7777 from your router to your host computer. The second player will then put your ipv4 adress to connect. There are lots of tutorials on internet to setup port forwarding. Be carefull to close your port after the end of your playing session.</li><li>You can also use softwares simulating local network between users over internet (Hamachi for exemple).</li><li>Finally you can try it alone opening 2 instance of the game on the same computer and put \"localhost\" to connect. This is of course the last option as the game is designed for 2 players.</li></ul>\n<p>The character is control by both player, left click on the character or objects that sparkle will put them in the other dimension (controled by the second player). You need to reach the portal to go to next level. Only object in the same dimension (black or white) can interact.<br/></p>\n<p>Credits:</p>\n<ul><li>Music: lightvgm (https://austinlight.itch.io/)</li><li>Game design: Zhelloz (https://zhelloz.itch.io/)</li></ul>", "metacritic": null, "released": "2021-04-25", "tba": false, "updated": "2021-04-26T07:51:16", "background_image": "https://media.rawg.io/media/screenshots/2d1/2d12a699c0b65138023e4d49cd732ac9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 6, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Zhelloz"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}