{"id": 592134, "slug": "vodonaut", "name": "Vodonaut", "name_original": "Vodonaut", "description": "<p>In 1958, the last of the Hardtack I Series Nuclear tests finished in Bikini Atoll, reef having endured 23 nuclear explosions. Two years after the final test, a Soviet Submarine investigates, hoping to learn from the US’s tests. It only manages a few hours below the waves of the Atoll’s inner lagoon before it disappears, the last message states the existence of a great ‘wall’ of coral, over twenty miles in length. <br/></p>\n<p>You are <em>Valentin Begichev</em> a member of SOL, a joint operation team between Sharashka penal research facilities and the KGB. The special research vessel known as свет now carries you to the wall beneath the atoll, with intent on discovering the fate of the missing submarine, and the truth of what lay beneath the wall.  Even the beauty of the world of coral, to one who has endured the Sharaska, is bleak as snow and ash.</p>\n<p><strong>How to Play</strong><br/></p>\n<p>Vodonaut is a game of survival in the deep dark. Manipulate your suit and navigate the great wall of coral. You have a few tools in your arsenal to help you. Your Light will provide you with perfect vision, and will scare away any pesky predators. The Infrared beam is much quicker to reveal potential threats. Radar will let you know everything in your immediate vicinity, but cannot distinguish between moving objects. Follow the objective arrow, find the holes, and descend into the wall in this three level demo.</p>\n\n<p><strong>Controls: </strong></p>\n<p>WASD - Movement</p>\n<p>EQ - Rotate</p><p>Left Control - Activate IR</p>\n<p>Left &amp; Right Arrow - Rotate Infrared Beam</p>\n<p>Sonar - Space</p>\n<p>Interact - F</p>\n<p>Mouse - Move Camera</p><p>Escape - Quit Game</p>", "metacritic": null, "released": "2021-04-25", "tba": false, "updated": "2021-04-26T08:16:15", "background_image": "https://media.rawg.io/media/screenshots/039/0399ed7d37b0d62e1cd0ac90a010163a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 131, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SCR183"], "genres": [], "publishers": [], "esrb_rating": null}