{"id": 592162, "slug": "the-chronicles-of-narnia-the-lion-the-witch-and-th", "name": "The Chronicles of Narnia: The Lion, the Witch and the Wardrobe the card game", "name_original": "The Chronicles of Narnia: The Lion, the Witch and the Wardrobe the card game", "description": "<p><strong>How to play</strong>\n</p>\n<p>Starting the game-\r\n  </p>\n<p>One player plays the good characters, and one player plays the bad characters. Shuffle the cards in your deck and pick the top 8 cards. If there is less than 3 characters, re-shuffle the deck and pick the top 8 cards.   </p>\n<p>Then, roll a dice. If it lands on an odd number, the good side moves first and if it lands on an even number, the bad moves first. Whoever moves first will move first for the entire game.\r\n  </p>\n<p>Choose your move-\r\n  </p>\n<p>Both players choose a Basic character or their weakest character on the first turn and place it on the ACTIVE CHARACTER space. This is your active character.   </p>\n<p>Each character is Basic, Advanced or Powerful. This shows how strong a character is.\r\n  </p>\n<p>Then, each player chooses a move.   </p>\n<p>Power and Moves-\r\n  </p>\n<p>Each move requires a certain amount of power. This is shown by the symbols next to a move.   </p>\n<p>There are 2 types of power, attack power      and defense power.          \r\n  </p>\n<p>To use power, you have to equip it by putting it under the character card from your hand. Once you equip a character with power, they can use moves that require the same or less amount of power that you have attached.   </p>\n<p>Once you equip a character with power, it cannot be removed or used for anything else. Attack and shield power count as separate powers, and you can equip as much power as you want from your hand.\r\n  </p>\n<p>For example, if I equip a Gryphon with 2 attack power, it can use the moves that require 2 or 1 attack power, but not the moves that require 3 attack power or defers power.\r\n  </p>\n<p>If you are unable to use a move due to having no energy, reshuffle all your cards except the active character and pick the top 7 cards.   </p>\n<p>If you have no energy in your hand before you choose a character, play a character before you re- shuffle your cards.\r\n  </p>\n<p>Moves-\r\n  </p>\n<p>Once you choose a move, the amount of damage that is dealt is shown by the number next to ATK. To show how much damage is dealt to your opponent, take the damage tile that says the amount of damage dealt that is the same as how much damage the move did.   </p>\n<p>There can be some moves that have side effects. These will be explained underneath the move.   </p>\n<p>Moves that do no damage will have a side effect that can help you. These normally require Shield Power.\r\n  </p>\n<p>Killing and Switching\r\n  </p>\n<p>Once a character has taken enough damage that is higher or the same as their HP in the top right corner, they get defeated and their card, aswell as the energy attached to that card will go in the Discard Pile.   </p>\n<p>Then, you will play your second character. Your second character can be any character that you choose.   </p>\n<p>You can also switch out your character in battle whenever you choose. When you switch out a character, you will take out another character, but you cannot do anything else on that turn. Characters will carry over any energy they have, even when being switched out of battle.\r\n  </p>\n<p>Once a character is defeated, you will get a flag for your side and put it on one of the flag spaces.\r\n  </p>\n<p> \r\n  </p>\n<p> \r\n  </p>\n<p> \r\n  </p>\n<p> \r\n  </p>\n<p> \r\n  </p>\n<p> \r\n  </p>\n<p> \r\n  </p>\n<p> \r\n  </p>\n<p> \r\n  </p>\n<p> \r\n  </p>\n<p> \r\n  </p>\n<p> \r\n  </p>\n<p> \r\n  </p>\n<p> \r\n  </p>\n<p> \r\n  </p>\n<p> \r\n</p>", "metacritic": null, "released": "2021-04-25", "tba": false, "updated": "2021-04-26T08:23:01", "background_image": "https://media.rawg.io/media/screenshots/559/559b147e4603e8d06af979f33b354d0c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 20, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["mousepoo"], "genres": [], "publishers": [], "esrb_rating": null}