{"id": 59214, "slug": "growlanser-generations", "name": "Growlanser Generations", "name_original": "Growlanser Generations", "description": "<p>Growlanswer Generations is a spellbinding set of two complete RPGs (Role Playing Games) that span space and time itself. Growlanswer: The Sense of Justice introduces players to Growlanser&#39;s world of swordplay and magic, where peace between three kingdoms is on the verge of shattering. Growlanser: The Dual Darkness takes players back to the place, time, and planet where the series began. In both games, players control the hero, and four to seven of his companions in ever more massive, strategic battles against the enemy forces in a variety of scenarios. Customizable characters with upgradeable magic, skills and power rings, as well as multiple story branches make Growlanser Generations one of the most flexible Strategy/RPGs to date. Developed by Atlus and CareerSoft, the Growlanser saga is an epic fantasy tale featuring a unique mix of strategic, menu-driven combat and real-time character movement and fighting. Its sublime combination of action and strategy was crafted by the key team members responsible for the long-running hit series Langrisser in japan. A deep story with over 80 hours of gameplay, more than ten solid hours of voice work, and fantastic character designs by anime artist Satoshi Urushihara compliment the gameplay and will keep players glued to the screen.</p>", "metacritic": 81, "released": "2004-12-07", "tba": false, "updated": "2024-04-11T07:52:43", "background_image": "https://media.rawg.io/media/games/497/497b0124bb7e27de8636c74fd815c2d8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 2, "toplay": 5, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 496, "game_series_count": 0, "reviews_count": 0, "platforms": ["PlayStation 2"], "developers": ["Career Soft"], "genres": ["RPG", "Strategy"], "publishers": ["Working Designs"], "esrb_rating": "Teen"}