{"id": 592179, "slug": "ready-to-shoot", "name": "Ready to shoot", "name_original": "Ready to shoot", "description": "<p><em>Le jeu est fait pour être utilisé sur smartphone en format paysage et est optimisé pour, si celui-ci s'affiche en portrait il faut régler le paramétrage de votre navigateur, ou en changer (sur chrome aucun soucis lors des tests).</em><br/></p>\n<p><strong>\"Le monde se divise en deux catégories, ceux qui ont un pistolet chargé, et ceux qui creusent\". </strong><br/></p>\n<p>Grâce a \"Ready to shoot\" tu peux enfin faire parti de la première catégorie , et te défouler sur un ensemble de cibles à travers les 8 niveaux de l'aventure.</p>\n<p> Arrivera tu a atteindre le score maximal du dernier niveau du premier coup ?</p>\n<p>Rejoint moi sur ma page en cliquant sur la photo ci-dessous \"jv perso\", et viens me dire ce que tu as pensé du jeu.</p>\n<p> <strong>Si tu as passé un bon moment, et que tu te sens d'humeur généreuse, tu peux aussi me laisser un petit pourboire de 1$ (environ 0.79€ au moment ou j'écris ces lignes) via paypal, en cliquant sur \"soutenir ce ready to shoot\". </strong><br/></p>\n<p>Merci d'avance et comme le dit le grand Eli Wallach aka Tuco , dans le bon la brute et le truand : \"Quand on tire, on raconte pas sa vie !\"</p>\n<br/><br/>Musique libres de droit : démarrage : A ghost Town - Quincas Moreira<br/>Menu niveaux : Western Spaghetti - Chris Haugen<br/>Niveau Bouteille : Happy Birthday Old Timey - E's Jammy Jams<br/>Niveaux fun fair : Alpine Bierhalle - Aaron Kelly<br/>Niveaux Saloon : Reuben's Train - Nat Keefe with the Bow Ties<br/>", "metacritic": null, "released": "2021-04-25", "tba": false, "updated": "2021-04-26T08:27:41", "background_image": "https://media.rawg.io/media/screenshots/d52/d52ea5d20b92651efd5e5e58f5c02958.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 132, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["JH10"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}