{"id": 592274, "slug": "dawncaster-deckbuilding-rpg", "name": "Dawncaster: Deckbuilding RPG (itch)", "name_original": "Dawncaster: Deckbuilding RPG (itch)", "description": "<p>Dive into the dark fantasy world of the Shattered Realms and join the battle against evil. Play as a cunning rogue, a brutal warrior or a mysterious Seeker wielding arcane magic. Or create your own class and play as who- or whatever you want to be! Start playing today, create a unique deck with access to over 300 cards and see how far you can venture into the corrupted lands of Umbris.</p>\n<p>STRATEGICALLY CHALLENGING<br />\nEvery step of your heroic journey offers new tactical choices to improve your deck and strategy. Collect cards that match your playstyle, avoid disastrous events and build your strategy before the forces of evil overwhelm you.</p>\n<p>UNIQUE TAKE ON CARD GAMES<br />\nDawncaster offers unique mechanics to even the most veteran of card game players. Though most of the gameplay should feel familiar, the ability to combine class mechanics into deck building, weapons, enchantments and its unique energy system are exciting additions to the cardgame genre!</p>\n<p>VENTURE INTO DARKNESS<br />\nDiscover the mystery of the missing ‘Dawncaster’, a hero of legend who has been lost in the corrupted realm of Umbris. Slay monsters and explore the darkest depths of a desperate world through handcrafted illustrations, dialogue and shape its future through your choices.</p>\n<p>ACCESS TO ALL CARDS &amp; CONTENT<br />\nDawncaster is offered as a complete deck builder cardgame. You get access to all cards, classes and content with your purchase. No need to buy packs, tokens or waste time on timers or ads. Future content will be offered through expansions at the same, single price per adventure kind of deal.</p>\n<p>ROGUELITE GAMEPLAY<br />\nWith randomized encounters, unique classes and choices to explore, playtime could easily reach the tens of hours for those that enjoy a challenge! Additional difficulty options are available for those that seek to push the limits of their strategic insight (and/or luck).</p>\n<p>JOIN OUR COMMUNITY<br />\nAs a (very) small indie development studio we’d love to hear from you on our discord server. Drop in, give us your feedback and/or support and get involved in the next step for Dawncaster.<br />\nDiscord: https://discord.com/invite/pfeMG9c<br />\nWebsite: https://dawncaster.wanderlost.games</p>", "metacritic": null, "released": "2021-03-11", "tba": false, "updated": "2021-09-13T02:58:42", "background_image": "https://media.rawg.io/media/screenshots/bee/bee21c63d7c1515998713dd3310d4851.jpg", "website": "https://www.wanderlost.games", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 296, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Android", "iOS"], "developers": ["WanderlostInteractive", "Rick van der Wal"], "genres": ["Action", "Adventure", "RPG", "Casual", "Card"], "publishers": ["Rick van der Wal"], "esrb_rating": "Everyone 10+"}