{"id": 59227, "slug": "hokuto-ga-gotoku", "name": "Fist of The North Star: Lost Paradise", "name_original": "Fist of The North Star: Lost Paradise", "description": "<p>Year 199X, the world has been ruined by nuclear war, but humanity has survived. Centuries of civilizations are ruined forever, in this new savage era, only the strongest have access to food, water, and resources to live a little better life. In this world dominated by violence and mistreatment, there’s a place called Eden, also known as “the city of miracles”. This city is full of energy and water which is provided by a giant building, and this means that its citizens can live a relaxed life compared with the other people…<br />\nOne day, Kenshiro, the savior of the century&#39;s end, and 64th successor of Hokuto Shinken – an ancient martial art which uses the opponent’s hidden meridian points – arrives in Eden to find his long-lost love Yuria.<br />\nWhat destiny awaits them in Eden? Discover it with Hokuto ga Gotoku for PlayStation 4, developed by Toshiro Nagoshi, this new adventure game melt seamlessly the luxurious gameplay mechanics of &quot;Yakuza&quot; series with the exciting world of &quot;Hokuto no Ken&quot;, the worldwide beloved manga series written by Buronson and drawn by Tetsuo Hara.</p>", "metacritic": 72, "released": "2018-03-08", "tba": false, "updated": "2023-12-25T21:45:27", "background_image": "https://media.rawg.io/media/games/38e/38e483287f8e1cf6dd6aebba47d43770.jpg", "website": "http://ryu-ga-gotoku.com/hokuto-ga-gotoku/", "rating": 3.45, "rating_top": 4, "added_by_status": {"yet": 20, "owned": 258, "beaten": 13, "toplay": 39, "dropped": 20, "playing": 6}, "playtime": 0, "achievements_count": 144, "ratings_count": 43, "suggestions_count": 404, "game_series_count": 12, "reviews_count": 44, "platforms": ["PlayStation 4", "PlayStation 5"], "developers": ["SEGA", "Ryu ga Gotoku Studio"], "genres": ["Action", "Adventure"], "publishers": ["SEGA"], "esrb_rating": "Mature"}