{"id": 592636, "slug": "ancient-maze", "name": "A(ncient) Maze", "name_original": "A(ncient) Maze", "description": "<p>Link to a youtube video talking about the game.<br/></p>\n<p>A maze game with a twist. You start in the middle and have to try to get out. Except, every now and then you have to make sure that the higher beings are satisfied, and so must sacrifice an item in the middle room. Memorization comes in handy, and so does time management. </p>\r\nBackstory:\r\n<p>So... A couple years back I wanted to participate in Ludum Dare 43. However, I am not the fastest coder so I didn't get much done in the 48 hours I had. But the idea I came up with seemed intriguing and so I came back to it now. <br/></p>\n\r\nGameplay:\r\n<p>Really it's just about exploring the maze. Not only will you gather items, but you will also gain an idea of all the pathways. Eventually you will come across a door. You must find a key to open this door so that you can progress further out of the maze. </p>\n<p>It is ideal to keep the Gods' satisfaction high, as this restricts the amount of enemies that spawn, and thus makes exploration quite  a bit easier. This will also be important on your final run out of the maze, where you have to make sure that it doesn't drop too low and mess up your escape plans. </p>\n<p>Strategies include dropping off items close to the main room (you can't drop items within the main room, but just outside will do), marking pathways with less useful items, and managing the Gods's satisfaction based on your situation. Fact is, enemies drop food, which is important, as low hunger slows you down and eventually kills you.</p>\n<p>Also, enemies cannot enter the golden middle room, so if you need safety, just run there. </p>\n\n<p>If you want to know more, I recommend watching the video. Enjoy!</p>", "metacritic": null, "released": "2021-04-24", "tba": false, "updated": "2021-04-26T10:24:57", "background_image": "https://media.rawg.io/media/screenshots/01c/01ce147dc33fe5d67bce177468b65daa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 32, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["ZeSardine"], "genres": ["Action", "Adventure"], "publishers": [], "esrb_rating": null}