{"id": 5926, "slug": "democracy-3", "name": "Democracy 3", "name_original": "Democracy 3", "description": "<p>Democracy 3 is a government simulation video game developed by Positech Games in 2013. This is a sequel of Democracy which was released in 2005. </p>\n<h3>Plot</h3>\n<p>The player’s goal is to create a democratic government while performing as a president or a prime minister. For the sake of it, he can implement and develop tax, economy, foreign and other policies, which affects the society. Smart policies can attract future voters and help win the elections. The player should also deal with appearing problems such as homelessness, strike actions, and crises. </p>\n<h3>Gameplay</h3>\n<p>The player can choose the nation to play for. Then his first aim is to win the elections; it includes building a strong campaign, winning the factions support, making up the electorate, and hold power in the government. New events and dilemmas keep happening during the game, so the player should also be able to refocus and deal with a situation; otherwise, an event might have ongoing consequences. </p>\n<h3>Key features</h3>\n<p>The player can change the flyers to change the amount of funding, regulate taxes or laws of a particular area. It is important to balance the government budget through the whole game as to change policies; one should spend political capital held by ministers. Each political decision requires funding and has its aftereffects. There are 21 electorate groups, and as the player makes political decisions, each group changes its attitude towards him.</p>", "metacritic": 70, "released": "2013-10-14", "tba": false, "updated": "2023-08-31T14:29:10", "background_image": "https://media.rawg.io/media/screenshots/f69/f690eafb7cbb29778d129aac3772d433.jpeg", "website": "http://www.positech.co.uk/democracy3", "rating": 3.58, "rating_top": 4, "added_by_status": {"yet": 46, "owned": 830, "beaten": 59, "toplay": 12, "dropped": 62, "playing": 3}, "playtime": 3, "achievements_count": 42, "ratings_count": 124, "suggestions_count": 288, "game_series_count": 3, "reviews_count": 125, "platforms": ["PC", "macOS", "Linux"], "developers": ["Positech Games"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["Positech Games", "Tri Synergy"], "esrb_rating": "Teen"}