{"id": 592957, "slug": "paranoid-40xx", "name": "Paranoid 40XX", "name_original": "Paranoid 40XX", "description": "<strong>Welcome to Paranoid 40XX</strong>\n<p>a new take on the classic arcade ame Arkanoid. As an ongoing project we will be creating more and more features as well as new puzzles.</p>\n\r\nMuch larger puzzles than what was in the original Arkanoid<br/><br/>\r\nHow to Play:\r\n<p>Keep the ball in the play area by hitting it with the defence drone away from the bottom of the arena until all the blocks are destroyed, powerups will drop from time to time to either help or hinder your game. </p>\n<p>You have a set number of lives which when they drop below 0 will end the game,  as of version 1.0 there is 33 classic puzzles which will loop through until either game over or you quit the game.</p>\r\nPowerups and Blocks:<br/><br/>\n<p>This is an ongoing project and below are the features that we are currently attempting to impliment</p>\n<p><strong>Additions:</strong></p>\n<ul><li>Enemies</li><li>Bosses</li><li>Story Mode</li><li>Powerup Additions</li><li>Powerup Storing</li><li>More Puzzle sets</li><li>Puzzle editor</li></ul>\n<p><strong>Known Bugs / Issues:</strong><br/></p>\n<ol><li>(Sticky Ball) Ball can get stuck to the underside of the Defender Racket blocking the character from relaunching the ball.</li><li>(Sticky Ball) If the ball impacts the Defender Racket a certain way it causes the ball to slowly rise away from the Racket </li><li>(Speed Up) this is practically impossible to catch due to the shear speed of it we are looking into either speeding the bat movement up or worse case scenario slow down the speed up booster.</li><li>(Barrier) Stays enable Indefinately which should be looked at as soon as possible because with this enables it disables the need to move when this is active cheesing the current puzzle</li><li>No way of controlling The GUI with a control pad or Keyboard only the mouse can select which needs to be fixed</li><li>In the current Alpha, you cannot change difficulty or control mode but can change volumes and reset the hi-score</li></ol>", "metacritic": null, "released": "2021-04-23", "tba": false, "updated": "2021-04-26T11:45:20", "background_image": "https://media.rawg.io/media/screenshots/cab/cab77cbfb27b8e0c034f8b0968661fb4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 93, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MSE Europe"], "genres": ["Action", "Puzzle"], "publishers": [], "esrb_rating": null}