{"id": 593001, "slug": "outer-wonders", "name": "Outer Wonders", "name_original": "Outer Wonders", "description": "A cute and whimsical puzzle game\r\n<p>Explore the whimsical pixel art-based nature in this top-down puzzle game where you play as Bibi, a cute round monkey who enjoys rolling.</p>\n<p>This playable demo features 7 puzzles, requiring 15-30 minutes overall.<br/></p>\n\r\nHow to play\r\n<p>Playing as Bibi, your goal is to reach the exit of each puzzle by taking advantage of the <em>slippery maze</em> rules:</p>\n<ul><li>you can move in only one of the 4 possible directions at a time: left, up, right, down, using your keyboard or controller;</li><li>once you start a move, <strong>your move stops only once you've hit an obstacle</strong> (but you can chain moves);</li></ul>\n\n<ul><li>some pieces of the environment will take you one floor upwards, and some other will take you one floor downwards;</li></ul>\n\n<ul><li>interacting with some elements (i.e.  moving over them) can also <strong>alter the environment</strong>, thereby opening new paths and closing other paths.</li></ul>\n\r\nRequirements\r\n<p>Outer Wonders requires your monitor to support at least the HD (<strong>1280</strong><strong>×720</strong>) resolution (which your monitor most likely does).<br/></p>\r\nWindows\r\n<p><em>Outer Wonders</em> has been thoroughly tested on a wide range of Windows computers, and <strong>should work seamlessly on any PC</strong> running <strong>Windows Vista SP2</strong> or any later Windows version. This includes very-low-end PCs.</p>\n<p>Some antivirus software may flag <em>Outer Wonders</em> as malware and block it, in which case you should consider adding an exception to let <em>Outer Wonders</em> run on your computer.<br/></p>\n<p>Please report any issue about running the game here, and we'll look into it ASAP.</p>\r\nLinux\r\n<p>We don't have a Linux-powered computer available for testing yet so <em><strong>Outer Wonders</strong></em><strong> has been tested only in virtual Ubuntu machines</strong> so far.</p>\n<p>With <em>Outer Wonders</em> being developed as an SDL2-based game, we expect most physical machines to be properly supported, though.</p>\n<p>All you need is:<br/></p>\n<p>\n</p>\n<ul><li>a <strong>64-bit</strong> Linux machine;</li><li><strong>glibc 2.18 or higher</strong>;<br/>\n</li><li>a GPU and graphics driver supporting <strong>OpenGL 3.3 or higher</strong>. If your GPU supports Vulkan, you may want to edit the <em>config.ini</em> configuration file and set <em>renderer=vulkan</em> to play a Vulkan-powered version of <em>Outer Wonders</em>.</li></ul>\n<p>Please report any issue about running the game here, and we'll look into it ASAP.\r\n</p>\r\nFuture of <em>Outer Wonders<br/></em>\n<p>This is an early playable demo meant to show the basic gameplay of <em>Outer Wonders</em>. What we envision for the full game is a <strong>puzzle-based open adventure game</strong> with a focus on <strong>exploration</strong>. We're aiming for a release of the full game on Windows, Linux, macOS, and possibly the Nintendo Switch in 2022.</p>\n\r\nFollow <em>Outer Wonders</em> on social media!\r\n<p>We're on Discord, Twitter, Facebook, Instagram where we post weekly puzzles for you to try out besides this playable demo. Feel free to reach out! <br/></p>", "metacritic": null, "released": "2021-04-23", "tba": false, "updated": "2021-04-26T11:58:53", "background_image": "https://media.rawg.io/media/screenshots/cc2/cc20c16d92d2450d6b65ea99bdcf6dda.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 90, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["Utopixel"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}