{"id": 59319, "slug": "creed-rise-to-glory", "name": "Creed: Rise to Glory", "name_original": "Creed: Rise to Glory", "description": "<p>Train. Fight. Win.<br />\nGot what it takes to become a champion? You are Adonis Creed, fighting toe-to-toe with the world’s top opponents to establish your boxing legacy. This intense cinematic experience features new Phantom Melee Technology for impactful VR melee combat so you can train, fight, and win like Creed.<br />\nLive Your Legacy<br />\nChallenge both your body and mind as you experience the ascent of Adonis Creed from undiscovered underdog to world-class fighter, all within an immersive universe inspired by the Creed™ films. Train with the legendary Rocky Balboa in iconic gyms, including Mighty Mick’s and Front Street Gym, then step into the spotlight and take down a cast of champion-level opponents in high-stakes fights with reactive commentators, gritty visual effects, and dynamic music.<br />\nPlay Your Way<br />\nMultiple game modes let you choose your path to glory. Live the saga of Adonis Creed in the story-based Career mode, learning and growing alongside Rocky as you train for bigger and more prestigious championship fights. Want to polish your punches and sharpen your reaction time? Let Training mode get you in shape with fun, physical minigame montages. And when you just feel like a fight, create custom matches in Freeplay against a wide range of opponents.<br />\nFeel the Impact<br />\nPhysically active 1:1 boxing gameplay features Survios’s newest proprietary VR innovation: Phantom Melee Technology™, which utilizes Responsive Control and Virtual Stamina to mimic the real-life effects of punching and being hit in the ring. Throw a variety of punches like uppercuts, jabs, and flurries in satisfying, impactful combat. But don’t let your guard down: punch too much and you’ll suffer from fatigue, and always be prepared to dodge and defend against incoming blows. Too many hits will stagger or completely knock out of your body—race back to your avatar before the ref counts down to show that the fight’s far from over.</p>", "metacritic": null, "released": "2018-09-25", "tba": false, "updated": "2023-02-24T20:06:47", "background_image": "https://media.rawg.io/media/games/0d1/0d14552f01148041afe62f74dbdfb830.jpg", "website": "https://survios.com/creed", "rating": 3.65, "rating_top": 4, "added_by_status": {"yet": 13, "owned": 377, "beaten": 10, "toplay": 6, "dropped": 8, "playing": 7}, "playtime": 1, "achievements_count": 123, "ratings_count": 34, "suggestions_count": 170, "game_series_count": 0, "reviews_count": 34, "platforms": ["PlayStation 4", "PC"], "developers": ["Survios"], "genres": ["Action", "Simulation", "Sports"], "publishers": ["Survios"], "esrb_rating": "Teen"}