{"id": 593125, "slug": "parashuuthem-v10", "name": "ParaShuuthem v1.0", "name_original": "ParaShuuthem v1.0", "description": "<p>It is a game to challenge your ability, try to survive more than 15 days avoiding the waves of cyber paratroopers destroy your base, but if one arrives and begins to destroy your base do not worry, you will have the opportunity to rebuild it as well as improve the speed of the cannon and the bullet, but do it wisely since the cost of the improvements will increase each time.</p>\n<p>Challenge your friends to see who has the best record, you can win a record of the most days survived, the highest score obtained , but who definitely wins is who gets the best record in days survived with the best score.</p>\n<p>ParaShuuthem is an intuitive, fun and challenging game, you can configure it in 3 languages:\r\n</p>\n<p>English.\r\n</p>\n<p>Spanish.\r\n</p>\n<p>Italian.\r\n</p>\n<p>Use the Right and Left movement keys to move the cannon from side to side, use the \"z\" key to shoot.\r\n</p>\n<p>Select with the mouse the options shown on the screen and do not worry, if you forget what are the keys to play, you will always have an icon with the question mark \"?\" On the main menu. that will show you the keys that are used to play.\r\n</p>\n<p>In future versions there will be updates with new options for improvements of defense, as well as new enemies and deliveries of special seasons Christmas and Haloween.\r\n</p>\n<p>Please feel free to notify if during your gaming experience in the web version or in the download version for PC detect any bug or other problem, I thank you in advance as this way I can improve the game and make it more enjoyable the experience for your entertainment.\r\n</p>", "metacritic": null, "released": "2021-04-23", "tba": false, "updated": "2021-04-26T12:32:10", "background_image": "https://media.rawg.io/media/screenshots/898/898570dd398eeae2fd770713f44079a7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 80, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Angel_MC"], "genres": ["Action"], "publishers": [], "esrb_rating": null}