{"id": 59321, "slug": "vroom-kaboom", "name": "VROOM KABOOM", "name_original": "VROOM KABOOM", "description": "<strong>VROOM KABOOM</strong> is a brand-new type of gameplay experience. A \"Tower Rush with Vehicles\", this game combines elements from collectible card games, tower defense and multiplayer online battles. With a wide variety of physics driven vehicles, <strong>VROOM KABOOM </strong>is a crazy mash up of emergent action gameplay and tactical choices. Engage in 1v1, 2v2 or 3v3 battles and even take to the roads in our full featured VR mode!FAQ &amp; VIDEO TUTORIALSVisit our FAQ: https://www.ratloopgamescanada.com/faq/ for questions <br/>And YouTube channel: https://www.youtube.com/playlist?list=PLuRZCiYYL08f3mAgT-Qpp4stQe9kQkqvF for tutorials about the game!DECK BUILDINGWith over 70 different vehicles and units to choose from, build a deck that fits any strategy and playstyle. Play and win matches to gain new cards and scraps, and in turn unlock new and more powerful units to add to your collection. <br/><br/>Collectible cards range from motorbikes, trucks, cars, tanks, helicopters, missiles to planes… oh my!<br/>DEPLOY, DRIVE, DESTROY!Strategically use your cards to summon vehicles and <strong>DEPLOY</strong> them on the battlefield. <strong>DRIVE</strong>, jump, shoot, bomb and ram your way to victory! Crash into your enemy’s vehicles, blow up their defenses and <strong>DESTROY</strong> their oil tanks to secure the win.<br/>Don't be a rookie, try summoning multiple vehicles at the same time!<br/>FACTIONSChoose from our 3 playable factions: SkullBorough, Drift City and Soul Station. Each contain unique cards to collect, vehicles to drive, environments to play in and music to enjoy! <br/><br/>We’ve even added a set of single player missions to complete for each faction.<br/>VRAnd just when you thought that was all… Take to the roads in a whole new way with our fully featured VR version of <strong>VROOM KABOOM</strong>. While a VR headset is not required to play, <strong>VROOM KABOOM VR</strong> takes the insanity to a whole new dimension!<br/>Imagine collecting, customizing and playing with cars just like matchbox cars in real life!", "metacritic": null, "released": "2018-08-13", "tba": false, "updated": "2019-08-28T21:59:23", "background_image": "https://media.rawg.io/media/screenshots/455/455d848388fadd6bc4c8b2c2529d1c13.jpg", "website": "http://www.vroomkaboom.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 13}, "playtime": 0, "achievements_count": 36, "ratings_count": 1, "suggestions_count": 478, "game_series_count": 0, "reviews_count": 1, "platforms": ["PlayStation 4", "PC"], "developers": ["Ratloop Games Canada"], "genres": ["Action", "Strategy", "Racing", "Indie"], "publishers": ["Ratloop Games Canada"], "esrb_rating": "Everyone 10+"}