{"id": 593256, "slug": "zar-2", "name": "ZAR", "name_original": "ZAR", "description": "<strong>  ZAR (zombie apocalypse in Russia)  </strong> is an indie first person shooter made in 3D graphics.<h3> 2023. </h3> After another outbreak of the coronavirus, the authorities decided to test a new vaccine and sprayed it over in the outback of the Russian province. The vaccine helped and the epidemic was extinguished, but six months later, everyone who died and was buried during the epidemic began to rise from the ground, turning into zombies.<br/>The area was fenced off by the military.<br/>To study this phenomenon, volunteers began to be sent to the quarantine zone for a small fee.<br/>From all over the country, the unemployed rushed into the quarantine zone in search of work.<br/>You are one of those volunteers. Your task is to survive as long as possible in the zone, study the strengths and weaknesses of the zombies, and also kill two special zombies, which, for some unknown reason, received special abilities.<br/> Gravedigger.  Appears at the cemetery in the village. Very strong. In close combat, hits with a shovel. In the far distance, summons three more zombies near you.<br/> Fisherman.  Spawns near the waterfall. In close combat, it hits with a hook and a fish. In the far distance, it dries up a person, causing intense thirst.<br/>Also, people remained in the quarantine zone.<br/> Hunter.  All his life he lived in the taiga, and when the dead began to rise from the ground, he finally lost his mind and now kills everyone who approaches his hut in the forest. In close combat, it hits with a hunting knife. shoots from afar from its double-barreled sawn-off shotgun. The knife and sawed-off shotgun, if you're lucky, can be picked up as a trophy after killing a hunter.<br/>Also in the village live  food vendor ,  weapon vendor  and  doctor . They are just like you came to the quarantine zone to earn money and they are paid, but they must give out food, weapons and medicine to the rest of the players for free.", "metacritic": null, "released": "2021-04-26", "tba": false, "updated": "2021-04-30T03:08:43", "background_image": "https://media.rawg.io/media/screenshots/f53/f532fadf85cc68f396af270c88e6fc64.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 393, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["PancakeGames"], "genres": ["Adventure", "Simulation", "Indie"], "publishers": ["Piece Of Voxel"], "esrb_rating": null}