{"id": 593339, "slug": "art-of-space", "name": "Art of Space", "name_original": "Art of Space", "description": "Note that this game is still in alpha and that the game experience may not be fully complete and bug-free.<h3>What is ART OF SPACE ?</h3><br/>Do you love fast-paced 2D space shooters? Where timing is crucial and success is sweet? With lots of satisfying destruction and explosions? Then read no further, this should be very much to your liking. (Just kidding, do keep on reading.)<br/><br/>Art of Space is essentially madness, as can be seen below.<br/><br/><br/><br/>Inspired by online and offline space shooters of the last two decades, Art of Space aims to provide a similar feel/atmosphere, putting an emphasis on fun gameplay mechanics while the campaign is reminiscent of the early days of online gaming.<br/><br/>Art of Space gives you the chance to build a spaceship and tweak it to your very own tastes, both visually and stats-wise. This game is for people who love to try all sorts of different combinations to figure out that ONE sweet-spot build that feels just right.<br/><br/><br/><br/>If you're more of a \"mad skillz!!\" person, you will love the combat in Art of Space as fast-paced is what we do, and perfect timing is what we love. Your spaceship is a modular machine that can be destroyed and rebuilt bit by bit, all in the heat of battle.<br/><br/><br/><br/>Meanwhile, our single-player story-driven campaign aims to provide a narrative around the world of Art of Space, while providing many hours of entertainment to the player.<h3>For the price of a hot meal, here's what this game offers:</h3><br/><ul><li> Manoeuvre your weapon of destruction through hazardous asteroid fields as you take out foes and defend allies using a wide array of weapons and utilities.<br/></li><li> Build a fully modular spacecraft from a pool of ship parts and weapons.<br/></li><li> Tweak your ship's stats and utility slots.<br/></li><li> Follow along a story-driven campaign that will provide many hours of entertainment.<br/></li><li> Test your skills in the Endless mode to see how you measure up to others, or just take it easy and use it as a playground to try out your newest configuration.</li></ul>", "metacritic": null, "released": "2021-04-28", "tba": false, "updated": "2021-04-30T04:08:48", "background_image": "https://media.rawg.io/media/screenshots/f5b/f5b8075a098a2eaa3810832d72cbd741.jpg", "website": "https://xfgamingstudios.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 177, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["xfgamingstudios"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["xfgamingstudios"], "esrb_rating": null}