{"id": 593383, "slug": "skip-rummy-card-game", "name": "Skip Rummy card game", "name_original": "Skip Rummy card game", "description": "Lovers of Rummy, Solitaire and \"Spite and Malice\" try the refreshing new and easy to understand card game \"Skip Rummy\".<br/><br/>The objective of the game is to get rid of all cards from your own player deck. To achieve this, each player gets a certain number of auxiliary cards in hand.<br/><br/>Cards may be discarded on the discard pile in the middle of the table. Discard piles are formed by placing cards on them either in the order 1 to 12 or as sets with the same card values ​​(e.g. 2,2,2,2). Newly started discard piles must be at least 3 cards in size.<br/><br/> 'J' cards act as wild cards. You can represent any number you want.<br/><br/>The game round begins with the player picking up a minimum number of auxiliary cards from the deck. If he has at least 3 cards in a sequence or set, he can start building a discard pile in the middle of the table.<br/>A player can discard as many cards as possible in a round.<br/><br/>If he cannot discard a card or if he does not want to, he ends his turn. Then it is the next player's turn.<br/><br/>*** Disclaimer ***<br/>* The game is intended for an adult audience.<br/>* The game does not provide \"real money play\" or an opportunity to win real money or prizes.<br/>* Practice or success in social casino games does not imply future success in \"real money games\".", "metacritic": null, "released": "2021-02-11", "tba": false, "updated": "2021-04-30T04:37:00", "background_image": "https://media.rawg.io/media/screenshots/f48/f488289117537785fa050d64477dd5bb_cJmZQ2e.jpg", "website": "https://burlov.de", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 37, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Paul Burlov"], "genres": ["Casual", "Card"], "publishers": ["Paul Burlov"], "esrb_rating": "Everyone 10+"}