{"id": 59330, "slug": "elea-episode-1", "name": "Elea - Episode 1", "name_original": "Elea - Episode 1", "description": "Elea: MemoriesElea is a surreal sci-fi adventure game in which you play as space scientist Elea. In 2073, Earth was struck by a horrid childhood disease and Elea’s husband Ethan joined an expedition to colonize Solace, a habitable exoplanet, to save humanity from extinction. The interstellar ship he was on, Pilgrimage, went radio silent shortly after it reached planet Solace. Thirteen years later, Elea joins a recovery mission to investigate the faith of the expedition. What follows is a wondrous journey through space.<br/><br/><br/>Features<ul><li>Unravel a rich, touching story inspired by books of classic sci-fi writers<br/></li><li>Submerge yourself in amazing graphics powered by Unreal Engine 4<br/></li><li>Discover gorgeous space environments, spectacular vistas and detailed interiors<br/></li><li>Expect the unexpected on this curious journey through outer space</li></ul><br/>StoryElea is a game that takes the player on the deeply personal journey of a woman, whose life is marked by loss, grief and self-accusation in the aftermath of a global pandemic that turned her youngest boy into a raging psychopath. Luckily, an Earth-like exoplanet within an achievable distance from the Solar system had been recently discovered. Pooling volunteers from around the globe, a first-of-a-kind interstellar spacecraft was built and sent to colonize the yet unexplored planet. The gargantuan ship was named Pilgrimage, embodying the hopes of all of the humanity. To everyone’s dismay, shortly after a successful arrival, the Pilgrimage went on total radio silence. What caused it remains a mystery.<br/><br/><br/>13 years later, research starship Recovery has arrived on site to investigate the fate of the expedition. The player takes the role of the space scientist River Elea Catherine Jones. She is driven above all by a personal goal – to find her husband Ethan, who occupied a prominent position on the Pilgrimage’s scientific crew. By putting the character up against events and phenomena which are beyond human grasp, the game aims to defy the conventional notions of personal accountability, choice and meaning of life. It is a story about our fragility as a species, about finding solace through surrender.<br/><br/>", "metacritic": null, "released": "2018-04-24", "tba": false, "updated": "2019-08-28T21:59:23", "background_image": "https://media.rawg.io/media/screenshots/450/4504e106a17d8d81db0373e96ff9b989_x2iRwMd.jpg", "website": "http://www.projectelea.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 33, "beaten": 2, "toplay": 1}, "playtime": 5, "achievements_count": 29, "ratings_count": 3, "suggestions_count": 336, "game_series_count": 0, "reviews_count": 3, "platforms": ["Xbox One", "PC"], "developers": ["Kyodai"], "genres": ["Adventure", "Indie"], "publishers": ["Soedesco"], "esrb_rating": "Teen"}