{"id": 593359, "slug": "good-mourning", "name": "Good Mourning", "name_original": "Good Mourning", "description": "<h3>Good Mourning – Linear Narrative Redefined</h3> <br/>Good Mourning tells a compelling story about rejoice and regrets, redemption and letting go. It’s a tale about good and bad, self-reflection, choices and chances, all the ups and downs of ordinary life, but through a filter of fantasy. <br/><br/>Good Mourning is a narrative game with high emphasis on replayability. The main storyline consists of hand-crafted elements, which are randomized for every playthrough. The goal is to generate emergent narrative through gameplay, which evolves alongside with the actual story.<br/><br/><br/> <br/>Following in the footsteps of critically acclaimed Lydia, Good Mourning doesn’t shy away from serious themes, but at the same time it’s also a warm-hearted take on the little things that make everyday life worth living.<br/> <br/>Just as important as the story itself, is the way it’s presented. Good Mourning is a run-based visual novel, which builds upon playthroughs. Different outcomes portray the story from very different perspectives, which will affect the way the narrative is interpreted. The ultimate ending is covered in the shrouds of mystery, and it’s up to the player to uncover all the facets of the story. During the course of the game the story can evolve to unexpected directions.<br/><br/><br/> <br/>The structure of Good Mourning is all about breaking the form. Traditional linear narrative is a poor fit for a digital game, for games revolve around choices and interactivity. And as software products games offer a possibility for randomly generated content. This is impossible for other mediums, such as literature and film. We see these factors as possibilities rather than restrictions, and we want to explore how deep this rabbit hole actually is.<h3>Gameplay</h3><ul><li>Good Mourning combines visual novels into a collection of mini games.</li></ul><ul><li>Emphasis is on a story and players are encouraged to experience it through several playthroughs. </li></ul><ul><li>The story adapts to the choices players make, and portions of it are randomly selected to ensure replay value.</li></ul><ul><li>Replayability is also a key element in the story, as well as the ability to choose and how other people perceive you. Choosing differently has an impact on the story and how it is interpreted.</li></ul><ul><li>The interpretation of the story is where the emergent narrative comes to play: the player sees only segments of the storyline, and the bigger picture has to be formed through imagination.</li></ul>", "metacritic": null, "released": "2021-04-29", "tba": false, "updated": "2021-04-30T04:20:23", "background_image": "https://media.rawg.io/media/screenshots/bf9/bf92bbda8ff97ec5f2c3fa297d072b6f.jpg", "website": "https://platonicpartnership.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2}, "playtime": 0, "achievements_count": 100, "ratings_count": 0, "suggestions_count": 312, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Platonic Partnership"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Platonic Partnership"], "esrb_rating": null}