{"id": 593368, "slug": "heli-yeah-bundle", "name": "Heli-Yeah! Bundle", "name_original": "Heli-Yeah! Bundle", "description": "Buckle up for high (and low) flying adventure in this compendium of copter capers! This collection of helicopter games takes you on a journey from popular retro sims to modern arcade-style action games. These titles will give you the lift you need to master these choppers across a wide range of varied missions. Can you become the best pilot there is? Give these games a whirl and find out!<br/>\n<br/>\nSuper Huey™ 1 &amp; 2 Airdrop<br/>\nIn 1985, Cosmi stunned the gaming world with the first helicopter flight simulator for the Commodore 64, then followed it up with an amazing sequel. Now, the original groundbreaking series returns together in one package! Pilot an experimental helicopter in these groundbreaking 8-bit sims.<br/>\n<br/>\nSuper Huey™ III<br/>\nSuper Huey™ III is a direct sequel to the PC’s first helicopter simulation, featuring tense combat and daring rescues in over 35 dramatic missions! This revamped version of the 2003 classic enhances the original while still packing all the high-flying and explosive action you remember.<br/>\n<br/>\nSuper Chopper<br/>\nClimb into the cockpit of a military attack helicopter and take on a 50-mission campaign with five life or death scenarios, or make your own missions in the included level editor! Use your arsenal of weapons, speed, and superior maneuverability to rescue soldiers, put out fires, and take down enemy tanks, helicopters and missile platforms.<br/>", "metacritic": null, "released": "2021-04-26", "tba": false, "updated": "2021-04-30T04:27:02", "background_image": "https://media.rawg.io/media/screenshots/a5e/a5ef8382347bb18b6e6dd11a4a420f76.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 214, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Webfoot"], "genres": [], "publishers": ["Ziggurat Interactive"], "esrb_rating": null}