{"id": 593307, "slug": "regain-earth-first-strike", "name": "Regain Earth: First Strike", "name_original": "Regain Earth: First Strike", "description": "<strong>Regain Earth: First Strike</strong> is a<strong> third-person</strong><strong> Sci-Fi</strong> <strong>shooter</strong> game.<br/>Take the <strong>tough challenge</strong> of surviving waves of increasingly difficult evil <strong>mutants and robots</strong>! Grab a friend or two to hunt and slay them all. Crush up to 6 enemy waves with help of <strong>randomly dropped weapons and enhancements</strong>. <br/><br/>Achieve the top of the leaderboard! Earn rewards to unlock new game features and new maps!<br/>This is a <strong>Community-driven solo-gamedev project</strong>. Help <strong>shape the future of this game</strong>!<br/><br/>Stunning action awaits you and your friends in<strong> co-operative multiplayer</strong>! <strong>No </strong>long and boring storytelling, just <strong>jump right into the action with your friends</strong> and enjoy the entertaining and challenge co-op gameplay!<br/><br/><h3>Just having fun!</h3>Our main goal is to offer our dear players an exciting, entertaining and not too complex shooter game. <strong>Just enjoy the fun gameplay</strong>.<h3>Gameplay</h3>Choose a map and try to survive and score as many points as you can, to get your name to the top of the leaderboard. <br/>Fight waves of different types of mutants and robots, surviving each and every assault until the last one. Once you have beaten the last wave, teammates from your spaceship will support and protect you.<br/>Collect scores over time to build up your skills, receive rewards and unlock new character classes. Also unlock new maps, new boss fights and higher difficulty levels for a never-ending Regain Earth gaming experience.<br/><br/><h3>Story</h3>300 years into the future, Earth is lost and YOU are the forefront of soldiers trying to get the upper hand against a very strong, unknown enemy in order to regain the earth.<h3>Great Graphics</h3>As an indie game studio we cannot provide AAA graphics, but we do deliver amazing A+ graphics and lots of great action scenes to your screen. Control your avatar, a futuristic soldier, in an awesome third-person perspective with lots of amazing effects that will blow your mind.<h3>Game with your friends!</h3>You can fight as a lone wolf in Single-player or together with your friends in Multiplayer Co-Op mode to fight for humanity on earth! Achieve new high scores with your teammates and explore new weapons, tactics and weaknesses of your enemies together.<h3>Key Features ready</h3>- Third-person perspective and shooting action<br/><br/>- <strong>Co-op</strong> Multiplayer or Single-player<br/>- <strong>Co-op</strong> multiplayer features like reviving your teammate<br/>- Weapons and gadgets with significant differences by type<br/>- Different kind of enemies, some with special abilities<br/>- Score system and leaderboard system<br/>- Steam Achievements and Statistics<br/>- Fun and casual gameplay<br/>- First Boss Fights<br/><br/><h3>Key Features planned</h3>- More weapons and gadgets with significant differences by type<br/>- At least 3 maps / levels with own settings, own theme, own leaderboard<br/>- More great <strong>Boss fights</strong>!<br/>- Unlock new character classes, weapon <strong>skins</strong>, character skins, new abilities &amp; <strong>skills</strong>, <strong>weapon attachments</strong>, higher difficulty levels, new <strong>boss fights</strong>, more rounds per map and completely new maps<br/>- <strong>There are tons of more ideas in our Discord server. Just join Discord and vote for your favorite upcoming feature that I should implement into the game next!</strong><br/><br/><h3>Join us! Support us! Be aware, this is a Solo-Developer-Indie-Game</h3>Regain Earth: First Strike can only be one of the best games if you are involved from the start! Regain Earth: First Strike will be my first indie game and the goal is to develop the next game features with community feedback. It will be impossible for a one-person indie game development project to deliver a co-op multiplayer action shooter game without community feedback. I want to dig deeply with you and the rest of the community to hear your amazing suggestions and feedback.<br/><br/>A <strong>Discord</strong> server is up and running. Join us on Discord and tell us your suggestions and game feedback, or just ask for a beta tester key if you want to support during the \"closed beta\".<br/>You can also receive notification of important updates being released by subscribing to the newsletter on our website.<br/><br/>", "metacritic": null, "released": "2021-04-28", "tba": false, "updated": "2021-04-30T03:40:41", "background_image": "https://media.rawg.io/media/screenshots/d64/d64b3af81412816f005b2424188ca704.jpg", "website": "https://regain-earth.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 498, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["GameFlow Studios"], "genres": ["Action", "Indie"], "publishers": ["GameFlow Studios"], "esrb_rating": null}