{"id": 593386, "slug": "warzone-turn-based-strategy", "name": "Warzone - turn based strategy", "name_original": "Warzone - turn based strategy", "description": "If you like Hasbro's RISK® game, you'll love Warzone!<br/><br/>• No pay-to-win: All games are equally fair for all players, like a board game. You win or lose Warzone games based on your strategy, not your wallet.<br/>• Single-player and multi-player: Play against real people, or play any of the thousands of single-player levels against the computer.  Both are 100% free.<br/>• Active community: Over 10,000 multi-player games are played every day. Games can be up to 40 players, and can be free-for-alls, teams, co-op, and more!<br/>• Cross-platform: You can play from your phone, tablet, or computer. You can play against other players no matter what platform they're on. All for free!<br/>• Asynchronous games: Warzone games can be played at your own pace. Your friends don't need to be all be online at the same time to play with them. Take your turns when it's convenient and Warzone will wait for you.<br/>• Customizable: Warzone has a very flexible engine. When creating games, you have hundreds of settings you can tweak to create anything from a minor variant to a whole new experience.<br/>• Luck-free: By default, Warzone games are determined entirely by your skill. There is no randomness of the dice like in Risk.<br/>• Maps: Warzone has thousands of maps to choose from, all made by the community. Or you can design your own! Maps range from small brawls to epic conquests with over 3000 territories!<br/>• Faster games: All players can take their turn at the same time, which allows Warzone games to move along significantly faster than other Risk-like games.<br/>• Community levels: Play single-player levels from the community, or make your own level and watch replays of other players defeating it.<br/>• Clans: Join a clan, compete in clan wars!<br/>• Cards: Warzone has a variety of cards with varying effects, like the Diplomacy Card, Spy Card, Airlift Card, Blockade Card, and more!<br/>• Tournaments: Join tournaments and compete, or create your own!<br/>• Ladders: Warzone has several ladders, which are competitive arenas where everyone competes for the top spot.<br/>• Quickmatch: QM makes it easy to jump into multi-player by matching you with players of equal skill on templates you like playing.<br/>• Open Games: If Quickmatch isn't to your liking, you can always browse through a list of games made by other players, or make your own!<br/>• Mods: Mods allow extending the game engine.  Mods run on all platforms, even on phones/tablets.  No installation is required; simply check the box next to the mods you want to use and they're automatically distributed to everyone who joins that game.<br/><br/>Warzone can be played completely for free, or you can upgrade to a membership via a monthly subscription to disable advertisements and unlock additional features such as mods. Payment will be charged to iTunes Account at confirmation of purchase. Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period. Account will be charged for renewal within 24-hours prior to the end of the current period. Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's Account Settings after purchase.<br/><br/>Terms of service: http://warzone.com/TermsOfService<br/><br/>RISK® is a registered trademark of Hasbro, Inc.  Warzone is not affiliated with Hasbro, Inc.", "metacritic": null, "released": "2013-08-16", "tba": false, "updated": "2021-04-30T04:38:25", "background_image": "https://media.rawg.io/media/screenshots/1e2/1e2d7cb3109d5d32020447d912a65d49_3ZavHVg.jpg", "website": "https://www.warzone.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 179, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Randy Ficker"], "genres": ["Strategy", "Board Games"], "publishers": ["Randy Ficker"], "esrb_rating": "Everyone 10+"}