{"id": 593478, "slug": "6-apm", "name": "6 APM", "name_original": "6 APM", "description": "<p><strong>An experimental real-time strategy game: you are limited to exactly 6 Actions Per Minute (APM).</strong>\n</p>\n<p>Did you ever have the feeling that RTS games like Command &amp; Conquer, Starcraft or Company of Heroes are somehow stressful? There are always useful orders to give, but trying to perform 200 APM just isn't relaxing anymore.\r\n </p>\n<p>We'll, I had this feeling, that's why I developed this game. It's a quite normal RTS game with units shooting at each other, control points, bases to spawn units. However, you are only allowed to give a move order (to an existing or new spawned unit) every 10 seconds, resulting in exactly 6 APM. Not the quickness of the commander is decisive, but good decisions – the game gives you enough time to analyse the situation and plan your next move. <br/></p>\n<p>\n</p>\n\n\n<p>To win a game, bring the health bar of you opponent to zero by holding the majority of the control points or by damaging the opponents base.\r\n </p>\n\n<p>Available game modes:\r\n </p>\n<ul><li> <p>versus AI (five \tdifficulties: easy, normal, hard, extreme, \tinsane)\r\n \t\r\n</p></li><li> <p>multiplayer \t(two players, local \thotseat)\r\n \r\n</p></li></ul>\n<p>To learn how to play the game, see the ingame tutorial.\r\n </p>\n<p>Controls: keyboard and mouse.</p>\n\n<p><em><strong>The web app is a demo that can be played in a browser, but performance and graphics are limited (see videos for comparison). For a better experience, download the full game.</strong><br/></em></p>", "metacritic": null, "released": "2021-04-29", "tba": false, "updated": "2021-04-30T05:14:03", "background_image": "https://media.rawg.io/media/screenshots/39e/39edf40b40583645b00842c768edb8f9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 173, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["mattflat"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}