{"id": 593409, "slug": "fury-shot-3d-magnet-master", "name": "Fury Shot 3D: Magnet Master", "name_original": "Fury Shot 3D: Magnet Master", "description": "Watch out! You are surrounded! The only way to freedom is to fight against hordes of stickmen trying to catch you.<br/><br/>You won’t find any guns or knives in the arsenal, but magnet balls. All you need to disarm the stickman foes is using your brain and the strength of magnetic fields to stick the ragdoll enemies to the objects around you or simply knock ‘em down.<br/><br/>It’s much harder than you think! The further you go, the stronger enemies you should take down. Quickly recall physics lessons from school to figure out the best way to magnetize heavy stickmen to the surroundings.<br/><br/>No way to stick your rivals to the ground? Don’t worry! Throw the magnet balls right at your aims like a hit master! Show the enemies who is a real JT sniper and don’t let anyone catch you. <br/><br/>There are exploding barrels, burning doors, dynamites, and tons of other interactive objects to use against the hordes of stickman enemies at each game level. Throw the magnet balls wisely to create traps for your ragdoll enemies. You’ll never get bored playing this shooting game!<br/><br/>Why you won’t stop playing Fury Shot:<br/><br/>- Action-packed gameplay<br/>- Interactive environment<br/>- Realistic ragdoll physics<br/>- Hundreds of challenging levels<br/>- Bright 3D graphics<br/>- Simple game controls<br/><br/>Well, what are you waiting for? Feel the spirit of real adventure in this addictive shooting game! Download Fury Shot for free now and turn your fury on stickman enemies!", "metacritic": null, "released": "2021-03-30", "tba": false, "updated": "2021-04-30T04:49:44", "background_image": "https://media.rawg.io/media/screenshots/d8a/d8a7cd5f4ec198c3e61c8c8ccdfd6eb4.jpg", "website": "https://aigames.ae/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 44, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["AI GAMES FZ"], "genres": ["Action", "Casual"], "publishers": ["AI GAMES FZ"], "esrb_rating": "Everyone 10+"}