{"id": 59346, "slug": "desperados-iii", "name": "Desperados III", "name_original": "Desperados III", "description": "<p>Desperados III is a modern real-time tactics game set in a ruthless Wild West scenario.<br />\nYou take control of a ragtag band becoming a highly functional group of unlikely heroes and heroines. The very different strong personalities struggle to cooperate at first, but ultimately join forces to combine their distinctive specialties and challenge a seemingly superior foe. Hunted by ruthless bandits and corrupt lawmen, the Desperados III need to turn the tables with every mission.<br />\nOn an epic journey through 1870s USA and Mexico, the team will face incredibly difficult odds and must outsmart vastly outnumbering gangs. On their mission to track down a nemesis whilst derailing a relentless corporate tycoon, the five distinctive characters use a wide array of skills to infiltrate, spy, sabotage, elude, steal, abduct, deviate, assassinate, blow stuff up… and as a last resort: shoot &#39;em down.<br />\nCombine your specialists to overcome tough challenges in many different ways. Plan your moves wisely and execute them perfectly in real time to sneak past your enemies while remaining undetected.<br />\nCommand up to five Desperados and use their lethal skills to stealthily thin out the enemy rows<br />\nApproach each mission with a big variety of different solutions and paths<br />\nResolve seemingly impossible large enemy setups with careful planning and perfectly timed execution of the team’s special skills<br />\nWitness the glory of classic Wild West scenarios like frontier towns, desert canyons, Mississippi swamps, sprawling modern cities and many more by day and night.<br />\nDefeat your foes choosing between deadly and non-lethal options, stealth and blazing guns and further adjust the game to your playstyle with various difficulty settings and special replayability challenges</p>", "metacritic": 84, "released": "2020-06-15", "tba": false, "updated": "2024-03-13T21:03:30", "background_image": "https://media.rawg.io/media/games/71d/71d5c7bed835c723486f7f6e78fca9fd.jpg", "website": "https://desperadosgame.com", "rating": 4.32, "rating_top": 5, "added_by_status": {"yet": 137, "owned": 1368, "beaten": 134, "toplay": 202, "dropped": 83, "playing": 31}, "playtime": 5, "achievements_count": 117, "ratings_count": 196, "suggestions_count": 408, "game_series_count": 0, "reviews_count": 199, "platforms": ["Xbox One", "PlayStation 4", "macOS", "PC"], "developers": ["Mimimi Productions"], "genres": ["Action", "Strategy"], "publishers": ["THQ Nordic"], "esrb_rating": "Mature"}