{"id": 59356, "slug": "deathgarden", "name": "Deathgarden", "name_original": "Deathgarden", "description": "Set in the near future, DEATHGARDEN™ revolves around a spectacular real blood sport that became the most popular entertainment on the planet. Players choose to team up as one of the five agile Runners or to embody the Hunter, a heavily armed competitor whose mission is to kill the Runners, preventing them from escaping The Garden.<br />\nDeathgarden pits individual cunning against strategy and teamwork–a lone but lethal Hunter against a team of dextrous Runners. Both sides must prove their skills and take control of the procedurally-generated Garden.<br />\nAsymmetric Confrontation<br />\nPower vs Agility: In this fast-paced action title, one powerful Hunter must hunt down five agile Runners, who seek to complete an objective and escape the Garden.The Garden<br />\nA Procedurally Generated Garden: Each map is procedurally generated within the ‘Garden’, a nano-printed environment in which Runners willingly enter to compete against the powerful Hunter. Each match boasts a different ‘Garden’ layout, which forces both sides to adapt their strategy to the environment and creates exhilarating, memorable moments.Long Term Support<br />\nGameplay First: Deathgarden embraces the “no grind” or “no pay to win” philosophy. New gameplay content (Gardens, Weapons, Abilities &amp; Perks, etc.) will be instantly available to all players upon the content’s release.</p>", "metacritic": null, "released": "2018-08-14", "tba": false, "updated": "2023-07-29T14:49:04", "background_image": "https://media.rawg.io/media/games/af8/af8eb3684d5990e3414aeb2949a5352c.jpg", "website": "http://www.deathgardengame.com", "rating": 2.67, "rating_top": 3, "added_by_status": {"yet": 15, "owned": 573, "beaten": 3, "toplay": 4, "dropped": 37, "playing": 2}, "playtime": 2, "achievements_count": 5, "ratings_count": 43, "suggestions_count": 343, "game_series_count": 0, "reviews_count": 43, "platforms": ["Xbox One", "PlayStation 4", "PC"], "developers": ["Behaviour Digital"], "genres": ["Action", "Shooter"], "publishers": ["Behaviour Digital"], "esrb_rating": null}