{"id": 59354, "slug": "my-hero-ones-justice", "name": "My Hero One’s Justice", "name_original": "My Hero One’s Justice", "description": "<p>Whether you want to see the destruction of humanity or believe heroes should defend those in need, fight to prove your justice in MY HERO ONE’S JUSTICE.  The popular Weekly Shonen Jump manga series comes to life, as players experience the abilities of fan favorite characters such as Izuku Midoriya, Katsuki Bakugo, Tomura Shigaraki, and many more in this arena brawler, where you’ll get to choose between hero and villain in your path to justice. </p>\n<p>Utilize Quirks and call upon your side-kicks to activate powerful attacks where your environments are at your disposal in total field destruction. The battle doesn’t just confine you to the ground - take the fight upwards where buildings and walls become a part of the action. </p>\n<p>Plus Ultra! – Based on the hit weekly Shonen Jump manga series</p>\n<p>Heroes or Villains – Choose between fan favorite characters like Deku, All Might, Tomura, and many more in your path to justice</p>\n<p>Total Destruction – The environments are at your disposal as players can destroy their surroundings in fierce battles </p>\n<p>Join Forces – Choose up to 2 sidekicks to unleash powerful combos</p>\n<p>Unleash Superpowers – Utilize each character’s Quirks to plant explosive attack</p>", "metacritic": 70, "released": "2018-10-26", "tba": false, "updated": "2023-12-25T21:42:17", "background_image": "https://media.rawg.io/media/games/d3b/d3bf5fdcc86ed61032d90022b2c13196.jpg", "website": "https://www.bandainamcoent.com/games/my-hero-ones-justice", "rating": 3.14, "rating_top": 3, "added_by_status": {"yet": 8, "owned": 171, "beaten": 27, "toplay": 25, "dropped": 33, "playing": 4}, "playtime": 2, "achievements_count": 288, "ratings_count": 49, "suggestions_count": 537, "game_series_count": 0, "reviews_count": 51, "platforms": ["Xbox One", "PlayStation 4", "PC", "Nintendo Switch"], "developers": ["BANDAI NAMCO Entertainment America", "Bandai Namco Entertainment", "Byking"], "genres": ["Action", "Fighting"], "publishers": ["Bandai Namco Entertainment", "BANDAI NAMCO Entertainment US"], "esrb_rating": "Teen"}