{"id": 59361, "slug": "drakengard", "name": "Drakengard", "name_original": "Drakengard", "description": "<p>Conflict has erupted between the Empire and the Union. The Empire, once part of the Union itself, has forsaken peace and accumulated awesome power in a surprisingly short time. Caim, a Union warrior and former prince of a small kingdom destroyed by the Empire, has received word that his castle is under attack. To make matters worse, his sister, Furiae, is still trapped within its walls. In an effort to save her, Caim manages to infiltrate the castle gates, but is mortally wounded in the battle. Slowly dying from his wounds, Caim comes upon a captured red dragon that also lies on the brink of death. Desperate to survive and continue his battle with the hated Empire, Caim decides to enter a pact with thedragon. By nature, the dragon herself is a proud beast that is unwilling to cooperate with humans, but she, too, has no choice but to accept Caims offer in order to live. The pact is a bitter compromise, as it requires the human partner to sacrifice some part of his or her body; the price for Caim is the power of speech. But the instant Caim joins souls with the dragon, the two pactpartners are given new life, and become bound together until death. With his strength restored, Caim rescues Furiae and sends her away to safety with a childhood friend, Inuart. Caim and the dragon then begin their quest to unravel the mystery behind the Empires sudden rise to power.</p>", "metacritic": 63, "released": "2003-09-11", "tba": false, "updated": "2024-04-09T17:25:22", "background_image": "https://media.rawg.io/media/games/9eb/9ebb26d197a75b8c62c52a1aa3e45ff6.jpg", "website": "", "rating": 3.38, "rating_top": 4, "added_by_status": {"yet": 24, "owned": 13, "beaten": 47, "toplay": 34, "dropped": 14, "playing": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 44, "suggestions_count": 205, "game_series_count": 8, "reviews_count": 48, "platforms": ["PlayStation 2"], "developers": [], "genres": ["Action", "RPG"], "publishers": ["Square Enix"], "esrb_rating": "Mature"}