{"id": 59366, "slug": "hypergun", "name": "HYPERGUN", "name_original": "HYPERGUN", "description": "<strong>Build the HYPERGUN!</strong><br/>Save the world as DevTech Labs' fearless intern, Dewey Owens in HYPERGUN! A fast-paced roguelite shooter centering around a procedural weapon of questionable effectiveness, it's up to Dewey to master the ultimate combat simulator. Fighting through waves of alien interlopers in a simulation designed to create the ultimate weapon, players will unlock exciting new classes all while gaining powerful abilities in their journey to create the HYPERGUN!<br/><br/><strong>Features</strong><br/><ul><li>Fast paced, FPS Rogue-lite gameplay<br/></li><li>Create the HYPERGUN - With over 150 weapon modules to collect, no two runs in the simulation will be the same. Each module you pick up will change your weapon in exciting and sometimes questionable ways, all in the name of determining the ultimate weapon to defeat our alien oppressors.<br/></li><li>Procedural Levels - Fight through increasingly difficult simulated arenas which are randomly generated with each playthrough.<br/></li><li>Alien Horde - Take on a host of (simulated) vicious alien invaders, recreated in immaculate detail.<br/></li><li>Badass Bosses - Throw down against epically powerful bosses at the end of each level to put your skills and weapon to the test.<br/></li><li>Unlockable Classes and Abilities - Unlock your co-worker's simulation profiles to gain access to a selection of more than 40 unique abilities to gain the upper hand in the simulation.<br/></li><li>Office Politics - Explore the DevTech offices as the intern Dewey Owens, who's somehow managed to sneak in over the weekend. Even at the end of the world, there's time to track down passive aggressive post-it notes from coworkers.</li></ul><br/><strong>Your Mission</strong><br/>The year is 2038, and a highly advanced alien race has occupied planet Earth. Humanity is at its breaking point, and the fate of the human race now depends on the top-secret HYPERGUN program: a highly advanced simulation that is designed to create the ultimate weapon to combat the alien oppressors by combining weapon components across countless simulations. <br/><br/>The intern at DevTech Labs, Dewey Owens, has managed to sneak into the facility over the weekend (even at the end of the world, we still need weekends!). Is he trying to prove himself to Roger, the hard-nosed CEO, or is he up to something nefarious? We may never know, but he just might save the world along the way.<br/><br/>", "metacritic": null, "released": "2018-08-22", "tba": false, "updated": "2019-08-28T21:59:22", "background_image": "https://media.rawg.io/media/screenshots/cf2/cf25f0e5e40119cd5484ddb7e488f120.jpg", "website": "http://nvyvestudios.com/games/hypergun/", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 28, "ratings_count": 0, "suggestions_count": 455, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["NVYVE® Studios"], "genres": ["Action", "Indie"], "publishers": ["NVYVE® Studios"], "esrb_rating": null}