{"id": 593663, "slug": "aleph-qoph-duat", "name": "Aleph Qoph / Duat", "name_original": "Aleph Qoph / Duat", "description": "<p>Seek out and bond with other wanderers. Bring lost words you have found to the oasis to get seeds. With these seeds you can plant trees and let the oasis grow deeper into the desert. Place the words you dont need into the sand, to help you orientate and find back home again.<br/><br/>play it here!</p>\n<p><strong>The good:</strong></p>\n<p>The core and minimal product was possible to finish in time and I learned a whole bunch for my main project. Like how to gain performance even in such vast and open spaces like this desert. My pseudo 3d implementation already culls the quads to render quite good. But its still a problem to go through very large arrays of objects and check stuff (eg which to draw) I finally got to draw a font again! (albeit a last minute thing, bc nothing fit)<br/></p>\n<p>Not immediately telling, that this game has an online multiplayer (not AI) worked out really good. Telling from the comments and the online reactions. It is more fun to stumble upon other players, jumping around and get each other to follow each other. I hope you´ll have someone to meet if you play it - but if you wander off solo, fear not, there is a story to explore and the game works as well as it would with other players :)</p>\n<p><strong>The bad:</strong></p>\n<p>Many things had to be cut. I wanted more player interactions, more gamejuice and different ways of exploration, like a hawk for scouting, dropping items, interact with the trees for small puzzles etc - feature creep was big - at least in my head^^ Also I had to drop the mobile support, bc it was just too much. The power of HTML5 didnt suffice XD</p>\n<p><strong>The ugly:</strong></p>\n<p>I havent tutorialilzed how you plant trees, thats a big error on my side. You need to activate the word you are holding when you are <strong>in the water</strong> to get a seed, only then with now the seed in your hand, you can plant a tree, instead of a navigation stone.</p>\n<p><strong>Controls:</strong></p>\n\n<p>you can play with keyboard and mouse or with a gamepad<br/>to see the controls press ESC ingame and click on the little <strong>?</strong> in the lower right corner\r\n</p>\n<p>WASD/left stick - move<br/>LSHIFT/left trigger - run\r\nSPACEBAR/right bumper - jump\r\nARROWS/MOUSE/right stick - look<br/>LMB/gamepad A - use\r\n</p>\n<p>thank you, have fun playing and please give me your feedback, thoughts and ideas :)</p>", "metacritic": null, "released": "2021-04-29", "tba": false, "updated": "2021-04-30T06:05:13", "background_image": "https://media.rawg.io/media/screenshots/d29/d29d4aebd0a8ca1b835024b2b9253585.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 143, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["ancientpixel"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}