{"id": 593796, "slug": "admiring-art-love-on-library-walk", "name": "Admiring Art: Love on Library Walk", "name_original": "Admiring Art: Love on Library Walk", "description": "Fallin' in Love, Fall Quarter!\r\n<p>An original dating simulator made by UCSD's The MQ Studios, this game puts you in the shoes of a first-year on UC San Diego’s campus. While some first-years would be focusing on starting classes, making friends, or developing a caffeine dependency, you are looking for love in all the right places. </p>\n<p>Romance all the wonderfully beautiful Stuart Art Collection pieces, from the shy What Hath God Wrought, the cool and collected Rock Bear, or even the braggadocious Sun God. In any case, you’ll be loving this art about loving art!</p>\r\nMeet the Cast!\r\n<p>Get to know some of the loveable art installations you'll meet on campus! Meet such eligible and attractive characters as...</p>\n\n<ul><li><strong>Sun God:</strong> While Sun God may appear to be just another sexy jock who loves to work out, once you get to know this all-powerful deity, you may find them to be quite the enigma. Sure they love their frat, ΣΥΝ, but they also value community service, and the philosophical queries they posit from classic literature are surprisingly thorough. Their body is a temple, will you get on your knees to worship? </li><li><strong>Snake Path</strong>: UC San Diego is chock-full of nerd and dweebs, and Snake Path is no different. But who said intellect doesn’t have sex appeal? Despite their serpentine form, this theater kid is quite the bookworm. Ask them about the Dewey Decimal system, or perhaps — see what you can get away with while being quiet enough for the seventh floor in Geisel!</li><li><strong>What Hath God Wrought</strong>: You’ve always seen them out of the corner of your eye, but now you’re looking at them head on. And what a bright visage you see — full of passions, quiet contemplation and the knowledge that they could find out anyone’s social security number, but choose not to. You don’t really understand them, but that’s fine. Some things don’t need to be understood to be loved. \r\n</li><li><strong>And all the others! </strong>Who could forget Silent Tree, Rock Bear, or Fallen Star? And keep those eyes peeled, dear player, for the three secret endings!</li></ul>\r\nMeet the MQ !\r\n<p>AALLW was produced by The MQ, UCSD's number one source for satirical news publications. Find us at our website for more jokes, satire, and interactive content!</p>\n<p>Game design, art, programming, and some writing was done by me, Jack Yang!</p>\n<p>Many thanks to writers / contributors: Aniela Drumonde, Dan Kaliblotzky, Hanaa Moosavi, Jacob King, Kaz Nuckowski, Matt Miltimore, Maria Dhilla! Further thanks to the whole MQ family for helping this one-off joke idea become a reality, couldn't have done it without you all!</p>\n<p>&lt;3</p>", "metacritic": null, "released": "2021-04-29", "tba": false, "updated": "2021-04-30T06:38:50", "background_image": "https://media.rawg.io/media/screenshots/607/60757a9193bf7d419b9e051c9def0d05.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 143, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Jack Yang"], "genres": [], "publishers": [], "esrb_rating": null}