{"id": 593789, "slug": "artifact-itch-scenicbanker", "name": "Artifact (itch) (scenicbanker)", "name_original": "Artifact (itch) (scenicbanker)", "description": "<p><strong>Navigate your treadmill with WASD and the mouse/trackpad. To gain altitude, move the mouse/trackpad down. Press Escape to restart at any time.</strong></p>\n<p><em>Artifact</em> is a surrealist racing game where you run on a flying treadmill in a fitness-themed hellscape. You navigate smartwatch waypoints around mountainous terrain, with a quartet of business bros riding their jet desk always just-so-slightly ahead of you. <em>Artifact</em> is about the futility and hollow facade of the hustle mentality, when so much of success is based on the cards you’re dealt. You can jump through hoops to get a trophy, but sometimes it all feels like running in place. You’re encouraged to turn inwards to perfect and discipline your body in a system where you have so little control over everything else. <em>Artifact </em>imagines what a future civilization might make of our present society from the media detritus that will outlive us.<br/></p>\n<p>After taking off from a bandaid runway, you pass through a series of camouflage billboards in a barren flatland beset by dust storms. You then wind through artificial-looking metallic mountains. At the center of it all is a gigantic bodybuilder trophy-king-God, glimmering with the energy being created by its subjects. The subjects prostrate themselves on the surrounding angular scaffolding, performing burpees, squats and other glorifying exercises <em>ad infinitum</em>.\r\n</p>\n<p>After briefly breaching the atmosphere, your path leads to the trophy-king-God, where a sliding door on its behind beckons. As you approach, it opens, and as you enter, the world goes pitch black.\r\n</p>\n<p>Players may be accustomed to the rules of other racing games, and initially choose to proceed through the waypoints following the course. However, no rules are enforced in this game, so they may take any path without consequence directly to the trophy-king-God’s door, or just explore the landscape aimlessly.\r\n</p><p>Concept, development and original music by Ashlin Aronin.</p><p>Thanks to Unity Standard Assets, Mixamo, buffalo85, TechnicalGym, wther, itdoes-interactive, jakesull, humanalloy-com, som_render and mrGarret for assets. All assets have royalty-free licenses and this game is for experimental fun purposes only.</p>", "metacritic": null, "released": "2021-04-29", "tba": false, "updated": "2021-04-30T06:37:23", "background_image": "https://media.rawg.io/media/screenshots/e7d/e7ddd525fc9fe6dd185bd7b20850875a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 108, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS"], "developers": ["scenicbanker"], "genres": ["Racing"], "publishers": [], "esrb_rating": null}