{"id": 593848, "slug": "social-moth", "name": "Social Moth", "name_original": "Social Moth", "description": "<strong>Social Moth is a narrative platformer where you play as a small moth contending with social anxiety. Set in a close-knit community on the forest floor, the game allows the player to explore themes of mental health, relationships, and finding a sense of belonging.</strong><br/><br/>Play as Aletris, a moth, struggling through interactions with other community members through dialogue choices that alter their anxiety level. Platform through the area surrounding your lantern home, finding collectibles and helpful friends throughout the environment that will lower your constantly rising anxiety. If Aletris gets too anxious and is unable to find any way to ground themselves, they'll come face to face with a manifestation of their anxiety...<br/><br/>Our goal is for players who have experience with social anxiety to find a comforting and relatable story in Social Moth. For those unfamiliar with social anxiety, the game offers a compelling lens into ways anxiety can manifest itself even in seemingly mundane interactions, in hopes of inspiring more compassion and support for those who struggle with social anxiety.<br/><br/><strong><h3>Features!</h3></strong><br/>- An endearing narrative that acts as a lens into how some may experience social anxiety<br/><br/>- Dynamic platforming with fully configurable controls<br/><br/>- A beautiful hand-drawn art-style that brings the world to life<br/><br/>- Fully voice acted dialogue from a talented cast of professional actors<br/><br/>- Dynamic music layering that responds to Aletris' level of anxiety<br/><br/>- Two distinct endings that depend on how you guide Aletris through a pivotal encounter<br/><br/>- A wonderful community full of bugs of diverse gender-identities including our non-binary lead, Aletris!", "metacritic": null, "released": "2021-04-29", "tba": false, "updated": "2022-05-13T04:41:34", "background_image": "https://media.rawg.io/media/screenshots/e02/e029978d28df22589e1478a84f8a2d8a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC", "Web"], "developers": ["shroonchu", "Social Moth Dev Team"], "genres": ["Casual", "Indie", "Platformer"], "publishers": ["Tiny Fury Games"], "esrb_rating": null}