{"id": 593883, "slug": "camp-wiggly", "name": "Camp Wiggly", "name_original": "Camp Wiggly", "description": "<p>Wiggly Loaf has a rustic summer camp in Maine, so come and play along with all the little loaves of the Blue and Gray team. Earn a nifty patch when you accomplish each task. Earn all 10 patches and become a Team Leader!<br/><br/>The first challenge is Arrival Day when all the little loaves get off Gus the Bus. You must sort out the Blue and Gray team to earn the 2 patches. Get a patch when you sort 100 Blue, and also when you sort 100 Gray.<br/><br/>The Trip Staff will take you out on an adventure so you can earn 3 more patches. Clean up the environment by removing 100 pieces of litter and trash. Learn how to build a fire to earn a patch, but don't get burned! Bug Bites are something to be proud of in this game. Flaunt them. When you get 50 Bug Bites, you earn another patch.<br/><br/>The Waterfront is open and Swim Meet is today! Can you beat the War Canoe Challenge? Jump in time to each canoe. Reach a winning distance of 20,000 feet to earn the Waterfront Patch and Moe will be there to congratulate you.<br/><br/>Riding horses is serious stuff. Viana is yelling commands, but one horse will not listen and is spazzing out. Tap the spaz 3 times to earn a Riding Patch.<br/><br/>Land Sports is all set up for a game of Jr. Newcomb. You must repeatedly tap the Newcomb Ball before it passes by. If you can tap 3 Newcomb Balls to get a HIT, you will earn a patch.<br/><br/>Arts &amp; Crafts is open and has the Color Wheel Challenge ready for you. Answer all the questions to earn the AC Patch.<br/><br/>The Theater is alive and the Juniors are performing a skit they made up called, A Junior Wedding. Just sit back and enjoy the show. If you are a good audience, you will earn a Drama Patch.<br/><br/>Shaun is in the kitchen every morning and he makes up a huge vat of Magic Coffee for the counselors. Fill your mug to the brim with fresh hot coffee, but you must do it right, or Shaun will make you do it again.<br/><br/>Campfire includes Red's Song for your listening enjoyment. Game also has Camp Songs by the Blue and Gray teams, and Justin's Song is here too.<br/><br/>This game is dedicated to all the campers, staff, and leadership team who I have shared a summer home with since 1984. Support summer camps! Kids need to be outdoors and together all summer long!<br/><br/>Wiggly Loaf and I thank you for playing Indie Games.<br/><br/>See ya at camp! Jay~</p>", "metacritic": null, "released": "2021-04-28", "tba": false, "updated": "2021-04-30T07:02:30", "background_image": "https://media.rawg.io/media/screenshots/aff/affab2779c2369ed9233694c0aea2ef1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 235, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["JEMoores"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}