{"id": 593871, "slug": "roadtrips-and-reststops-first-edition", "name": "Roadtrips and Reststops: First Edition", "name_original": "Roadtrips and Reststops: First Edition", "description": "<p>\"Roadtrips and Reststops: First Edition\" Is a game you can use to turn Google Streetview into a fun physics based board game experience! </p>\n\n<p>Click <strong><em>Here</em></strong> to Open a random google Streetview!  Select \"Urban\" &amp; \"All Countries\" for Optimal results. This website will open automatically when the \"Start\" button is pressed.<br/></p>\n<p><strong>HOW TO PLAY! \"Roadtrips and Reststops: First Edition\" </strong></p>\r\nLeft Click:Hold left click on any physics object to pick them up!<br/>left click on any buttons to select themRight Click:Right click on food, water and entertainment physics objects to use them, they will disappear and their respective meter will go up.Meters:<br/><br/>If any of these meters reach zero the game will end.<br/>the large white meter is the \"dice meter\"<br/>when the dice meter hits 0 the d20 dice will roll. depending on what you get a random event will happen, experiment and find out what you can do with these events!Move Button:<br/>                                                                                                                                                                                                                                             <br/>Every time you make one movement on google Streetview, you click the turn button. The rules are very flexible, so you can click this button with every 2 Streetview movements if you'd like. the possibilities are endless.Food Button:<br/>Press this button if you find anywhere that you think you could find food, this could be from a restaurant or a farm near you.<br/>The rules are very flexible, you can press this as much as you want per location, it will give you food to stack on your truck.<br/><br/>Water Button:<br/>Press this button if you find anywhere that you think you could find water, this could be from a coffee shop to a body of water near you. The rules are very flexible, you can press this as much as you want per location, it will give you (nonalcoholic) drinks to stack on your truck.<br/>Entertainment Button:<br/>Press this button if you find anywhere that you think you could find Entertainment, this could be from a certain store, roadside attractions, to historical sites or museums near you. The rules are very flexible, you can press this as much as you want per location, it will give you fun things to stack on your truck.Gas Button:<br/>Press this button if you find anywhere that you think you could find gas, this could be gas stations or garages, The rules are very flexible, you can press this as much as you want per location, it will give fill your gas meter.Hygiene Button:<br/>Press this button if you find anywhere that you think you could clean up, this could be public restroom to a carwash, The rules are very flexible, you can press this as much as you want per location, it will give fill your hygiene meter.Scaffolding Button:<br/>Press this button if you find anywhere that you think you could get metal parts, this could be a hardware store to even other cars or construction sites. The rules are very flexible, you can press this as much as you want per location, it will give you a scaffolding part you can attach to the truck and other scaffolding parts you have placed. if a scaffolding part is not connected to either of these it will fall.Rest Button:<br/>Press this button if you find anywhere that you think you could get rest, this could be hotel to any old house, The rules are very flexible, you can press this as much as you want per location, it will give fill your awareness meter.\r\n<p><em>This game is not affiliated with google/google maps or the creators of mapcrunch.com</em><br/></p>\n<p><strong><em>ASSET CREDITS:</em></strong></p>\n<p><em>“Grape Soda from fontenddev.com”</em><br/></p>", "metacritic": null, "released": "2021-04-29", "tba": false, "updated": "2021-04-30T06:58:49", "background_image": "https://media.rawg.io/media/screenshots/a24/a24a5cdf8cc7b7cf97ae2808f3c9d986.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 22, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Hexablu"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}