{"id": 594087, "slug": "deeppsy", "name": "DeepPsy", "name_original": "DeepPsy", "description": "<p>Collect everything you can.\r\n</p>\n<p>Win the psychological war in your mind and make it to the end of the day.\r\n</p>\n<p>Every day is a victory, don't give up.\r\n</p>\n\r\nThe browser version may be a little unstable. If possible, prefer the downloadable version for a better experience.\r\n\n<p><strong>How to Play:</strong></p>\n<p>Just collect everything and find the exit (use the <strong>W</strong>, <strong>A</strong>, <strong>S</strong>, <strong>D</strong> keys and the <strong>mouse </strong>to walk)<br/></p>\n<p>   The game offers three possible gameplay experiences based on different psychological disorders.<br/></p>\n<p>   Psychological disorders are not fun, this game is about experience and overcoming. I tried to send a message of support and respect simulating the different cases so, no, you can't die in this game. You always win.</p>\n<p><strong>On the idea behind the simulation:\r\n</strong></p>\n<p>At first things seem to be fine until you fall and get hit by one of them:\r\n</p>\n<ul><li><strong>Deepression</strong>: you walk as if you have no desire to walk, without spirit, almost as if you are dragging yourself.\r\n</li></ul>\n<ul><li><strong>Anxiety</strong>: you are walking fast, you get nervous and start to shake.\r\n</li></ul>\n<ul><li><strong>Panic</strong>: You are very anxious, running and do not know where to go.\r\n</li></ul>\n<p>   These disorders are part of many people's lives and with the arrival of the corona virus pandemic things are not getting any easier so I hope you are all well.<br/></p>\n<p>   If you believe that you may be experiencing a psychological disorder, seek medical attention.\r\n</p>\n<p>Things will get better, you are not alone.</p>\n<p>   Unfortunately, I couldn't dedicate myself to Jam as much as I would like, but here is my submission and this is my first time, as a programmer, using <em>Unity </em>for a Jam!<br/> </p>\n\n<p>Colete tudo que você puder.<br/></p>\n<p>Vença a guerra psicológica em sua mente e chegue até o final do dia.</p>\n<p>Cada dia é uma vitória, não desista.</p>\n\r\nA versão do navegador pode ser um pouco instável. Se possível, prefira a versão para download para uma melhor experiência.\r\n\n<p><strong>Como jogar:</strong></p>\n<p>Basta coletar tudo e localizar a saída (use as teclas <strong>W</strong>, <strong>A</strong>, <strong>S</strong>, <strong>D</strong> e o <strong>mouse </strong>para andar)</p>\n<p>   O jogo oferece três experiências de gameplay possíveis com base em diferentes distúrbios psicológicos.<br/></p>\n<p>   Distúrbios psicológicos não são divertidos, esse jogo é sobre experiência e superação. Procurei passar uma mensagem de apoio e respeito simulando os diferentes casos então, não, você não pode morrer neste jogo. Você sempre ganha.</p>\n<p><strong>Sobre a ideia por trás da simulação:</strong></p>\n<p>No inicio as coisas parecem estar bem até você cair e ser atingido por uma delas:</p>\n<ul><li><strong>Depressão</strong>: você anda sem vontade, sem ânimo, quase como se estivesse se arrastando.</li></ul>\n<ul><li><strong>Ansiedade</strong>: você está andando rápido, frequentemente fica nervoso e começa a tremer.</li></ul>\n<ul><li><strong>Pânico</strong>: Você está muito ansioso, correndo e não sabe para onde ir.</li></ul>\n<p>   Estes transtornos fazem parte da vida de muitas pessoas e com a chegada da pandemia do corona vírus as coisas não ficaram mais fáceis então, espero que vocês todos estejam bem.<br/></p>\n<p>   Se você acredita que possa estar passando por algum transtorno psicológico, busque assistência médica.</p>\n<p>As coisas vão melhorar, você não está só.</p>\n<p>   Infelizmente não pude me dedicar à Jam o quanto gostaria, mas aqui está o meu envio e é a minha primeira vez, como programador, usando a <em>Unity</em> para uma Jam!</p>", "metacritic": null, "released": "2021-04-28", "tba": false, "updated": "2021-04-30T07:52:37", "background_image": "https://media.rawg.io/media/screenshots/8c4/8c46bb19557511eb6e4a69affafe9e14.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 9, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["joaog"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}