{"id": 594035, "slug": "when-there-is-no-more-snow", "name": "When There Is No More Snow", "name_original": "When There Is No More Snow", "description": "<p>When There Is No More Snow is a HYPER LOW RES SUPER RETRO visual novel made in ZZT! It's a semi-autobiographical story about a bunch of 8th graders in rural Michigan in 1995.</p>\n<p>Content warning: animal death, parental abuse, bullying, mild swearing</p>\n<p>When you start the game, it will ask you for a game controller. Pick K for Keyboard! Then it will ask you for a video mode. Pick C for Color! Hit the Enter key to clear the license screen and then either hit P to play the game or W to bring up the Worlds menu, where you can hit the down arrow key to select NSBONUS. Then hit Enter and P for play and you can play the bonus world! You can also select NOSNOWNF, which is the same game but without any flashing. Good for photosensitive people and also if you are trying to use OpenZoo PSP or another one of those ZZT forks that crashes on certain flashing colored text.</p>\n<p>Features:</p>\n<p>*10 unique endings!</p>\n<p>*A giant self-indulgent bonus features package with deleted scenes, sound test, and a travelogue!</p>\n<p>*Teen angst!</p>\n<p>*Saxophones!</p>\n<p>*UFOs!</p>\n<p>Credits:</p>\n<p>Writing, Art, Music, Coding: Jeremy W. Kaufmann</p>\n<p>Animated Gifs: KKairos</p>\n<p>Testing: Pogesoft, Johns, Lancer-X, Adult_Witch</p>\n<p>Tools: Zeta, Zima, OpenZoo by Asie, Zedit2 by Lancer-X, SFX Tracker by Lachesis, Fuse and Mixamo by Adobe, Blender by Blender Foundation, FL Studio Pro by Image-Line, ZZT by Tim Sweeney. Yes, I made 3D models to create ascii graphics.</p>\n<p>Minimum specs: This will run on basically any computer that supports HTML5 and if you do the downloadable version, basically anything at all. You can even use real ZZT and run it on a 286 if you're so inclined.</p>", "metacritic": null, "released": "2021-04-28", "tba": false, "updated": "2021-04-30T07:39:14", "background_image": "https://media.rawg.io/media/screenshots/80e/80e478f3a7c8fda8754cb642dc8d9f3c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 94, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Jeremy W. Kaufmann"], "genres": [], "publishers": [], "esrb_rating": null}