{"id": 5942, "slug": "retro-decathlon-2012-run-jump-and-throw-with-us", "name": "Retro Decathlon 2012: Run, Jump and Throw with us!", "name_original": "Retro Decathlon 2012: Run, Jump and Throw with us!", "description": "***** Online Leaderboards: http://leaderboards.decathlon2012.com/ <br/><br/>Retro Decathlon 2012: Run, Jump and Throw with us! allows you to experience ten track and field events in an adorable retro graphics and compare your results with the rest of the world in online leaderboards. <br/><br/>***** In-Game Footage: http://www.youtube.com/watch?v=muUSkHDtHV8 <br/><br/>10 games in one: 100 meters sprint, long jump, shot put, high jump, 400 meters run, 110 meters hurdles, discus throw, pole vault, javelin throw, and finally the exhausting 1500 meters run. <br/><br/>Actual world record of 9039 points is shaking at its roots. <br/><br/>The time has come for a competition in the premiere athletic discipline—the decathlon. After hard training only the most versatile athlete will win. Every error will be mercilessly penalized and the chance to create a new world record will vanish away in the London fog. <br/><br/>In each discipline you control your athlete simply with a finger, but you won’t succeed without proper timing, speed, and managing your stamina. Results achieved in individual disciplines are stored in a table and compared with the best world scores. The total score in the decathlon is calculated using a real-world formula, thus it is possible to accurately compare your score not only to the world record but also to the other athletes participating in the competition. <br/><br/>Enjoy a stylish design which naturally complements the great playability of original sports games. But this time you don’t have to worry about breaking your joystick. During the track events you have to move a finger with the correct frequency and not waste your stamina. When jumping, you have to attain the necessary speed and time your take-off correctly, and when throwing you won’t succeed without totally concentrating on your technique. <br/><br/>Only one athlete will get the gold medal for his country. <br/><br/>Run, Jump and Throw with us! <br/><br/>• 10 disciplines, a training mode, and a competition for the gold medal <br/>• A world records table <br/>• A stylish design in the style of classic sporting games", "metacritic": null, "released": "2012-08-01", "tba": false, "updated": "2019-10-22T14:28:32", "background_image": "https://media.rawg.io/media/screenshots/3bc/3bcf1d93fa0d9e1e644c0225f1930ad1.jpeg", "website": "http://games.cinemax.cz/retrodecathlon2012", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 137, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["CINEMAX"], "genres": ["Sports", "Arcade"], "publishers": ["Cinemax"], "esrb_rating": "Everyone 10+"}