{"id": 594470, "slug": "vermillion", "name": "Vermillion", "name_original": "Vermillion", "description": "Vermillion is a VR painting simulator, bringing the full analogue joy of oil painting into the digital world. Get the unrivaled sense of accomplishment from creating something beautiful on the canvas, without the messy living room. With the same ease-of-use as real life, it is accessible to both complete novices as well as seasoned (digital) artists. Mix up your desired color on the palette, make your mark on the canvas with the wide range of unique brushes, and get going on your first (or next) masterpiece.<h3>FEATURES:</h3><br/><strong>Analogue color mixing</strong><br/><br/>Vermillion allows you to blend colors as you would with real paints. Dip your brush into multiple colors, and mix a new color by whisking the brush on the palette - and yes, yellow and blue make green!<br/><br/><br/><br/><strong>Integrated web browser with canvas projector</strong><br/><br/>Never painted before? No problem! The easel has a web browser right next to it, allowing you to paint along with your favorite artists on YouTube for the first time without needing physical equipment, and giving you convenient access to the internet's vast library of learning resources and reference material. The browser can even be projected onto the canvas, so you can easily trace your reference. You can also display local images on the browser.<br/><br/><strong>Designed for wet-on-wet painting</strong><br/><br/>Vermillion is made for wet-on-wet painting. It mixes color not only on the palette, but also on the canvas, allowing you to create perfectly smooth gradients with just a few strokes. Use a dry brush to blend colors further, or to move paint around to create a variety of effects from reflections to grass.<br/><br/><br/><br/><br/><br/><strong>Layers</strong><br/><br/>While Vermillion is made to be the ultimate wet-on-wet experience, sometimes you just need to paint on another layer for detail work. Which is why it's fortunate that there is currently support for four separate layers!<br/><br/><strong>Fine control over every mark</strong><br/><br/>Exert fine-grained control over your brushwork through the pressure with which you press the brush into the surface. Use the hand steadying tool to compensate for the lack of a physical canvas to rest your hand against.<br/><br/><strong>Distinct brushes</strong><br/><br/>From the two inch brush all the way down to the rigger, there's a brush for every occasion.<br/><br/><strong>Sharable</strong><br/><br/>Vermillion offers up to 8k export of your finished piece, as well as a controllable spectator camera to offer great views of the process while streaming or recording.", "metacritic": null, "released": "2021-04-27", "tba": false, "updated": "2021-07-30T02:35:25", "background_image": "https://media.rawg.io/media/screenshots/78c/78c628723196f0737d4de5d691cf5ef6.jpg", "website": "https://vermillion-vr.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 39, "dropped": 1}, "playtime": 2, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 236, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["blairbobaggins", "Thomas van den Berge"], "genres": ["Adventure", "Simulation", "Casual", "Indie"], "publishers": ["The Aviary"], "esrb_rating": null}