{"id": 594634, "slug": "planetgem-gb", "name": "PlanetGem GB", "name_original": "PlanetGem GB", "description": "<p>The PlanetGem is a crystal that holds the Planet of Gold together. The GeeBees live in harmony with the PlanetGem... but one day, space pirates steal it! The player takes the role the leader GeeBee, chasing after intergalactic bandits and fighting beasts created from the PlanetGem's corruption.</p>\n<p>PlanetGem GB is a short bullethell inspired by the audio and visual limitations of the Game Boy Color.<br/></p>\n<p><strong>Features</strong></p>\n<ul><li><strong>Story mode</strong> - Three stages with unique enemies and bosses. Designed to get harder as you progress. A secret boss appears if you beat the last stage with a high enough score!</li><li><strong>Endless mode</strong> - Play through infinite stages with randomly selected enemies. Two unique enemies are chosen and a boss is also selected at random. Health carries between stages, so you have a choice... heal and survive longer, or increase your score and try to hold on!</li><li><strong>Accessibility options</strong> - Toggle screenshake, assign colors to game objects, and fade the background. </li></ul>\n<p><strong>Default controls </strong>(Game contains two keyboard presets and a controller preset)</p>\n<ul><li>Move cursor/player - Arrow Keys</li><li>Fire weapon/Select: C</li><li>Fire Laser/Go back: X</li><li>Pause: Escape</li></ul>\n<p><strong>Other options</strong></p>\n<ul><li>Fullscreen toggle - Press Backspace (also available in settings menu)</li><li>Windowed mode resize - Press Tab</li><li>Save deletion menu - Available in settings menu</li></ul>", "metacritic": null, "released": "2021-04-27", "tba": false, "updated": "2021-04-30T10:15:59", "background_image": "https://media.rawg.io/media/screenshots/58a/58a155640575d41a10f2daae2c68bc60.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 37, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ForteFortissimo"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}