{"id": 594788, "slug": "gem-raiders", "name": "Gem Raiders", "name_original": "Gem Raiders", "description": "Gem Raiders\r\n<p>Made in 72 hours.</p>\n<p>The Arex Corporation has recently found green crystals that emit large amounts of energy, these are the so-called “Power Gems”. It will be your task to control a group of workers to extract these power gems from beneath the ground. In order to do so you will have to extend your base and ensure the safety of your workers.</p>\r\nFeatures\r\n<ul><li>Stylish pixel art</li><li>Basic base building</li><li>Real Time Strategy</li><li>A lot of shiny gems</li></ul>\r\nHow to play\r\nMining\r\n<p>In order to mine the walls, you need to assign an order. This can be down with the two buttons in the left bottom corner. Soft rock walls require shovels to be mined and hard rock walls require pickaxes to be mined. Diggers have shovels and Miners have pickaxes and they will automatically start performing the orders they are fit for. Once a rock wall is mined, it will drop rocks. If a gem wall is mined, it will drop both rocks and gems. Soft Rock walls will not drop anything.</p>\r\nBuildings\r\n<p>You can place down a building order and your workers will construct it once all the mining orders are completed and all the resources are picked off the ground. Do not starting mining new walls if you want construction to be completed.</p>\r\nCombat\r\n<p>Danger lurks in the walls, but it will only reveal itself once the wall is mined. You can protect against these dangers by placing guards near your workers.\r\n</p>\n<p>Information is also provided when hovering over the button.\r\n</p>\r\nBest of luck and I hope you have fun!", "metacritic": null, "released": "2021-04-27", "tba": false, "updated": "2021-04-30T10:57:54", "background_image": "https://media.rawg.io/media/screenshots/063/0634f1c3854ac72f53f1502fd51cf4d5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Hare Software"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}