{"id": 594930, "slug": "mushroom-mine", "name": "Mushroom Mine", "name_original": "Mushroom Mine", "description": "<p>This game is really rough and sometimes it doesn't work properly, so hopefully, this will help you to be able to get to the bottom (if the game doesn't laggout before you get there, I'm sorry)</p>\n<p>Controls: </p>\n<p>Select a unit by clicking them, or drag-select to select multiple. Right-click somewhere they can move to have them move there. This will make a mining icon appear where your mouse is and when you finish selecting your blocks, it'll auto change back to a normal icon. </p>\n<p>On the left side, you have buttons. The first is to mine. You can click to select a block to mine or you can drag select to select large chunks of blocks to mine. This will make a mining icon appear where your mouse is and when you finish selecting your blocks, it'll auto change back to a normal icon. p.s. Mining has issues sometimes where the kind of the unit of just give up when they do this you can tell them to move somewhere or click the cancel button then get them back to mining. </p>\n<p>The second command is to grab clay, this is the resource used to build ladders and allies. This has an issue where your golems are unable to pick up clay if they're already in the same space as the clay, so you might have to tell them to move off of the stop than click the clay button.</p>\n<p>The third command is to build ladders. This will grab clay if you don't have it and use that to build a ladder. </p>\n<p>The fourth will build another golem. This will require 2 clay. The first will build the legs and the second will build the body. Once built you will be able to control the golem and have him help with your digging endeavors. </p>\n<p>The fifth action is to cancel other actions. This will tell the golems to stop doing what they're doing. Sometimes the golems get stuck on random tasks so using this will allow you to cancel their tasks and move on to better things than standing around. </p>", "metacritic": null, "released": "2021-04-27", "tba": false, "updated": "2021-04-30T11:37:28", "background_image": "https://media.rawg.io/media/screenshots/e2a/e2a738a70ddee62734444f17537af8da.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 57, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["ArithMetic"], "genres": [], "publishers": [], "esrb_rating": null}