{"id": 594948, "slug": "fishnship", "name": "Fish'n'Ship", "name_original": "Fish'n'Ship", "description": "<p>You've been nominated as the Captain of the Atlantis Mission. Your goal is to go as deep as possible down the ocean to reach the possible coordinates of the famous Atlantis!</p>\n<p>To achieve that goal, you've been granted a big submarine. But the depth of the ocean are full of dangerous fishes which will attack you. From the datas you gathered over time, you know that all thoses fishes have one weakness :</p>\n<p>- Some fishes will be afraid of light</p>\n<p>- Others will be afraid of noises</p>\n<p>- Some will let you alone if you give them food</p>\n<p>- Or they won't like ghosts</p>\n<p>Engineers are building modules that will create different types of diversion to make fishes run away. But thoses modules will cost you and you'll need to mine gold on your way down...</p>\n<p>You'll probably won't make it to the end the first time, so don't forget to call the end of the mission before you run out of oxygen!</p>\n<p><strong>MODULES DESCRIPTION:</strong></p>\n<p><strong>CONTROLS:</strong></p>\n<p>- Right click on a crewmate to select it</p>\n<p>- Right click on a module to move the selected crewmate</p>\n<p>- Click on the button on the left bottom side to bring the ship back to the surface</p>\n<p><em>Piloting module:</em> the ship go down as far as there is a crewmate assigned to it!</p>\n\n<p>\n</p>\n<p><em>Mining module:</em> you'll collect gold if a crewmate is assigned to it and if your ship is moving.</p>\n\n<p><em>Air blast module:</em> it has been conceived to eject some air on the water. It will cost you some oxygen but it will make run away all the fishes, but slower than with their weakness</p>\n\n<p>\n</p>\n<p><em>Radio module:</em> you'll need this module to make contact with the surface when they send you a message. Respond to it quickly enough, and you will receive a certain amount of gold!</p>\n<p>    <br/></p>\n<p><em>Attack modules:</em> These four modules are the ones to make your fishes run away faster than with the Air Blast Module!</p>", "metacritic": null, "released": "2021-04-27", "tba": false, "updated": "2021-04-30T11:43:00", "background_image": "https://media.rawg.io/media/screenshots/68a/68a45744229072b4d91957e7a09401ea.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 59, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Snappy Sloth"], "genres": [], "publishers": [], "esrb_rating": null}