{"id": 595074, "slug": "storm-last-resort", "name": "Storm: Last Resort", "name_original": "Storm: Last Resort", "description": "Storm: Last Resort\r\n<p>In <strong>Storm: Last Resort </strong>you play as the captain of a pirate ship. You plundered and struck fear in the heart of many people of the Caribbean. This, of course, did not remain unnoticed and so you find yourself in an invidious situation.</p>\r\nGameplay\r\n<p>In the game you steer a ship in a top-down view and have to beat the enemies in fight. You can set and strike sails with W and S, steer with A and D and fire your cannons by left-clicking in the firing arc.</p>\n<p>Between the battles there are small events and story parts where you choose upgrades for your ship.</p>\r\nGameplay hints\r\n<p>If you struggle with the fights, here are some hints:</p>\n<ul><li>following ships isn't a particularly great idea, they will get the better of you</li><li>if a ship is damaged it will move more slowly</li><li>if the crew of a ship takes damage, they won't be able to reload as fast as usual</li><li>after you lost a battle, you can choose to try again or even let your ship and crew be healed/repaired and try again</li></ul>\r\nLudum Dare Notes\r\n<p>This game is a jam submission for Ludum Dare 48 and was made in the time of 72 hours, I think I spent around 45 hours actively working on it.</p>\n<p>This time I switched back to Unity to develop the game (more about this in my post-mortem, if I manage to write one). Sadly I had no time to make any music, the sounds are mixed and edited from the #GameAudioGDC Bundles, thus I won't take any ratings in the audio category. All the graphics are made by myself.</p>\r\nSource code\r\n<p>Full source code is available under https://github.com/Skosnowich/storm-last-resort-ldjam48<br/></p>", "metacritic": null, "released": "2021-04-27", "tba": false, "updated": "2021-04-30T12:17:16", "background_image": "https://media.rawg.io/media/screenshots/22a/22a5f7f4b1d274ec7028185727000b8a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 52, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Skosnowich"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}