{"id": 595316, "slug": "minecrawler", "name": "Minecrawler", "name_original": "Minecrawler", "description": "<p>Play as a <strong>imortal </strong>adventurer that was called to help a miner conquer a land infested of monsters and obviously, ores and treasures.</p>\n<p>Your goal is to mine as much as your hand can take. Be prepared to slay a lot of monsters while you mine tho.</p>\n<p>The game has a total of 9 layers, starting as with simple grass blocks till some hot lava, will you be able to explore all of them?</p>\n\n<p>Minecrawler has a <strong>clicker </strong>combat style for the encounter with the mobs, you can click as fast as you can to damage them, be careful because the monster can hit you after 5 seconds from their last attack.</p>\n<p>You will encounter 4 different monsters on your journey:</p>\n<p><strong>-Punchi: </strong>little stones with a punch heavy as a car, those can be pretty tanky sometimes.<br/></p>\n<p>-<strong>Sharklin: </strong>stones in shape of sharks that will hunt you down. be careful because they can bite you pretty hard.</p>\n<p><strong>-Crab: </strong>i wouldnt care about those.<br/></p>\n<p><strong>-Golem: </strong>in the end of each layer you will have to face those massive stone creatures.<br/></p>\n\n<p>If you are good enough to get a lot of resources you will be able to build the <strong>forge </strong>this structure will be used to melt your ores into bars, you know what you will have to do with the bars right? Of course, you will be able to craft <strong>SOME AWESOME STUFF.</strong></p><p><strong>BUGFIX 1.01:</strong></p><p>-Fixed the health scale for the punchis in the third layer</p><p>-Fixed spam clicking reducing the enemies issue</p>", "metacritic": null, "released": "2021-04-27", "tba": false, "updated": "2021-04-30T13:22:30", "background_image": "https://media.rawg.io/media/screenshots/1f6/1f677b29b62f5e5f8c7df566da9d6586.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 42, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["bigassopper"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}