{"id": 595747, "slug": "vulcans-tomb", "name": "Vulcan's Tomb", "name_original": "Vulcan's Tomb", "description": "<p><strong>This game is a submission for Ludum Dare 48 by Simul and Snas!</strong></p>\n<p>Vulcan's Tomb is a game that takes you down between three different floors, as the treasure you're hunting is its own defense! Take flight as you fight for your life and the treasure at stake, dodging attacks and smacking them against this beast as it takes you down lower and lower into Vulcan's Tomb! The treasure can only fight for so long, so live on for as long as you can!  <br/></p>\n<p>  </p>\n<p><strong>Storyline</strong></p>\n<p>It's been a couple years now since you started exploring to find a tomb of myth and legend- said to hold treasure quite unlike any other throughout the realm. You've been hunting down the treasures held by Vulcan, the god of volcanoes himself! The adventure has been a hefty back and forth journey as you search and search for this land of great mystery, until finally.. it comes to you. The hint you've been looking for, and the key to unlock the treasures within...</p>\n<p><strong>Vulcan's Tomb!</strong></p>\n<p>Join us as we begin the story of this great adventurer, as things go awry the very moment he steps inside! The treasure he so sought after has turned against him, in its last ditch effort to remain the greatest mystery left in the world.</p>\n<p>  </p>\n<p><strong>Gameplay</strong></p>\n<p>The controls are as simple as they get! The WASD and arrow keys provide movement, while your spacebar will be your jump!    </p>\n<p>The overall goal of this game is to run out of time. The clock in the top left will show you how long you have left! By making Vulcan's Treasure attack himself, whether it be with his own rocks or punch attack, your time will go down. Be way however- being attacked will only add onto the time to spend before your victory!  </p>", "metacritic": null, "released": "2021-04-26", "tba": false, "updated": "2021-04-30T15:20:18", "background_image": "https://media.rawg.io/media/screenshots/7ab/7abac06e4919182725a98717fbb3db8d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 44, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Wild Espeon"], "genres": ["Action", "Platformer"], "publishers": [], "esrb_rating": null}