{"id": 595700, "slug": "sleep-deprived", "name": "Sleep Deprived", "name_original": "Sleep Deprived", "description": "<p><strong>Description:</strong> A quiet Shepherd is trying to get a good nights rest for the first time in awhile. Unfortunately Sleep Demons are haunting his dreams. Help him and his trusty sheep fight off the demons and get a good nights sleep for once. <br/><br/><strong>Goal:</strong> Try and get your Shepherd to the far <strong>Left</strong> side of the map to move onto the next stage. Don't let yourself be pulled to the far <strong>Right</strong> side of the map or you'll lose the stage Try and win every stage! <br/><br/><strong>Controls:</strong> WASD or Arrow Keys - Move around. Left Mouse Button - Select things Right Mouse Button - Cancel Actions OR Free Look activation/deactivation <br/><br/><strong>Abilities:</strong> </p>\n<p><em>Shepherd</em> </p>\n<p>Basic Attack - Plus-shape, Deals no Damage - Applies stacks of yellow orbs to demons </p>\n<p>Slow Shleepy - Slows everything in its AOE also applies yellow orb stacks to sleep demons </p>\n<p>Shleep Swap - Switch places with any other entity. </p>\n<p><em>Sheep</em> </p>\n<p>Basic Attack - 2 range single target attack. Deals small amount of damage unless there are yellow orbs </p>\n<p>Ram - Same damage as basic attack but in a line. </p>\n<p>For the Shleep - Heals itself and removes all purple stacks.<br/><br/><strong>Special Thanks</strong> </p>\n<p>We wouldn't have been able to get this far if it wasn't for turn-based RPG tutorials by http://theliquidfire.com/projects/ </p>\n<p>For Audio we used the Royalty Free song \"Reservoir Sunset (Remastered)\" by Axletree https://freemusicarchive.org/music/Axletree#contact-artist</p>", "metacritic": null, "released": "2021-04-26", "tba": false, "updated": "2021-04-30T15:06:40", "background_image": "https://media.rawg.io/media/screenshots/dbe/dbe7f7bfd6e182e4ef299473dfc09977.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 45, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["IDaedalusI"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}