{"id": 595745, "slug": "deep-waste", "name": "Deep Waste", "name_original": "Deep Waste", "description": "Intro &amp; Explanation\r\n<p>You are a marine biologist and your mission is to clear the ocean of trash and record every living beeing found in there.</p>\n<p>You have a (ECO) sub marine that functions only if you feed it with material to recycle. To help with that the sub marine is equipt with an GRAB-O-TRON to easily grab trash that floats in the water. If you find all the fish and finsih the last trash list (with nuclear waste) than you win!</p>\n\r\nHUD\r\n<p> The HUD on the left top side, shows you which trash is needed for the next upgrade to be activated.</p>\n<p>The HUD on the left bottom side, shows you the barometer and how much pressure the sub marine can resist. Above that you see the hull status and how much hull damage you can get before the sub marine is broken.</p>\n<p>If you unlocked the scanner you can see on the right top side all ocean creatures you already discovered and which you are missing.</p>\r\nUpgrades\r\n<p>Following Upgrades can be unlocked:</p>\n<ul><li>Barometer Upgrade: You can resist higher pressure and so you can divedeeper and deeper into the ocean</li><li>Light Upgrade: its really dark down there, so you will need some light around you. </li><li>Flash Upgrade: As I said, its really, really dark down there, so you maybe want to look ahead what comes next.</li><li>Scanner: If you want to document which beeing are living down there, you need some device to record the behavour of those creatures.</li></ul>\r\nControls\r\n<ul><li>WASD or arrow keys to move</li><li>Left Mouse Button to grapple trash (or stun sharks!)</li><li>Right Mouse Button to active scanner (hold it to scan, it may take a while to fully scan a creature)</li><li>F to toggle light if you have unlocked it</li><li>R to restart the game after game over</li><li>M to toggle music and sound</li></ul>\n\r\nCredits\r\n<ul><li>Sound Effects and Music from https://www.zapsplat.com</li></ul>Change-Log (V1.1)<ul><li>Removed hidden debug mode to instantly win</li></ul>", "metacritic": null, "released": "2021-04-26", "tba": false, "updated": "2021-04-30T15:19:51", "background_image": "https://media.rawg.io/media/screenshots/32a/32a9bdac5b3aa74e3f78ee77c2d6e033.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 36, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["shadow3777"], "genres": [], "publishers": [], "esrb_rating": null}