{"id": 59589, "slug": "coven-and-labyrinth-of-refrain", "name": "Labyrinth of Refrain: Coven of Dusk", "name_original": "Labyrinth of Refrain: Coven of Dusk", "description": "<p>Become the living book, Tractatus de Monstrum, and command a brigade of puppet soldiers as you navigate the twisting passageways of the Labyrinth of Refrain.<br />\nWhen at your base, prepare for your journey by upgrading your brigade! Create new puppet soldiers, assign them different squads and formations, synthesize better equipment, take requests from townsfolk, and get assistance from Dronya in the form of Witch Petitions.<br />\nOnce you&#39;ve entered the labyrinth, be sure to search every nook and cranny as you jump over barricades, solve puzzles, and smash your way through walls to delve further and further downward in search of treasure and rare artifacts. But be careful, the more riches you obtain, the more vicious the dungeon becomes. Can you survive long enough to bring your haul back?<br />\nFight past terrifying monsters by giving orders to your puppet brigade. Change their formation, use special skills, or call for an all-out attack! The battles you face will be challenging, so your success depends on your preparation and your strategy.KEY FEATURESA Massive MazeDive into the miasma-filled labyrinth as the Tractatus de Monstrum along with your brigade of puppet soldiers to smite monsters and uncover dark secrets.Fast-Paced Combat!Strange creatures and traps of all sorts will stand in your path as you go deeper in the maze. Give orders to your army and crush them with special skills!Build an Undefeatable ArmyCreate your very own puppet soldiers, grant them a variety of different roles, and assign them to specialized squads to make your own unique brigade!</p>", "metacritic": 75, "released": "2016-06-23", "tba": false, "updated": "2023-11-26T19:23:52", "background_image": "https://media.rawg.io/media/games/10b/10b021c299c55cf3875e9cb4f9b5c5d1.jpg", "website": "http://nisamerica.com/games/labyrinth-of-refrain/index.html", "rating": 4.0, "rating_top": 4, "added_by_status": {"yet": 14, "owned": 82, "beaten": 5, "toplay": 15, "dropped": 4, "playing": 8}, "playtime": 7, "achievements_count": 1, "ratings_count": 14, "suggestions_count": 520, "game_series_count": 2, "reviews_count": 14, "platforms": ["PS Vita", "Nintendo Switch", "PC", "PlayStation 4"], "developers": ["NIS America", "Nippon Ichi Software"], "genres": ["RPG", "Strategy"], "publishers": ["NIS America", "Nippon Ichi Software"], "esrb_rating": "Mature"}