{"id": 595958, "slug": "deep-dark-okaylobster", "name": "Deep Dark (OkayLobster)", "name_original": "Deep Dark (OkayLobster)", "description": "<p><strong>Welcome!</strong></p>\n<p>Brave the deep! Find treasure! Bring a friend!</p>\n<p><strong><em>But</em></strong> whatever you do....</p>\n<p>Don't let your torch go out!</p>\n<p><strong>Gameplay</strong></p>\n<p>The goal of the game is to see how far you can get in the cave. Getting deeper into the cave and collecting gems will increase your score.</p>\n<p>This game has local co-op! You and a friend can play together by using the keyboard.  Just press the buttons for the characters and they will jump to life! But beware! If your characters get too far away from each other then it's lights out for you and your friend!               </p>\n<p>Prefer playing solo? Thats fine! Just press the buttons for one character and jump on in!</p>\n<p>As you go further into the cave your torch will begin to go out. If your torch goes fully out that that's it for you! You can refuel your torch by walking over braziers that can be found in the cave.</p>\n<p><strong>Controls</strong></p>\n<p><strong>Player 1</strong></p>\n<p>W = Jump</p>\n<p>A = Move Left</p>\n<p>S = Slide Down (When on walls)</p>\n<p>D = Move Right</p>\n<p><strong>Player 2</strong></p>\n<p>Up Arrow = Jump</p>\n<p>Left Arrow = Move Left</p>\n<p>Down Arrow = Slide Down (When on walls)</p>\n<p>Right Arrow = Move Right</p>\n<p><strong>Tips</strong></p>\n<p>-You can grab and slide on the walls to slow down your descent </p>\n<p>-Try to stay on the same screen when playing with a friend</p>\n<p>-Whatever you do don't run into the monster when you first see it</p>\n<p>**Bug Fixes/Changes**</p>\n<p>28/04/2021</p>\n<p>-Fixed the braziers so they can be seen more clearly when the screen is getting dark and they spawn more often</p>\n<p>-Decreased the max darkness so you can still see the player and level when the torch is almost going out</p>\n<p>-Added a tips area in the description to explain so of the gameplay features that were left out before</p><p>-Decreased the fall speed of the character based on feedback saying he was too difficult to control at that speed<br/></p>\n<p>**Credits**</p>\n<p>OkayLobster - Art and Gamedesign</p>\n<p>Swerlin - Codewizard and Audio</p>\n<p>**Final thoughts**</p>\n<p>This has been my first ever jam of any kind and it was a blast! (It was also extremely tiring and I need sleep, but you know..)</p>\n<p>Big thanks to Swerlin for helping me with this, I literally could not have made it otherwise.</p>\n<p>And thanks to you for playing the game, I hope you had fun!</p>", "metacritic": null, "released": "2021-04-26", "tba": false, "updated": "2021-04-30T16:18:49", "background_image": "https://media.rawg.io/media/screenshots/ced/ced1beb6e71bf6276f81be666f8b46df.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 56, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["OkayLobster"], "genres": ["Action"], "publishers": [], "esrb_rating": null}