{"id": 596174, "slug": "bee-beesness", "name": "Bee Beesness", "name_original": "Bee Beesness", "description": "<p>If you experience issues with the web version, the download might run better 😊</p>\n<p>In this bee RTS, the goal is to grow your hive, allowing your queen to go <strong>deeper and deeper</strong> into the safety of your hive and growing in numbers until your hive is big enough to split.  The more splits you pull off, the higher your score. But beeware, you also have to survive through the winter! ❄️</p>\n<p>Made with Godot for Ludum Dare 48! The hive is inspired by real-life hives.</p>\n\n<p>⚠️ Sadly, we didn't have time to implement some of the features (including guard mechanics) before the jam ended, but we might implement them in the future :)</p>\n<p><strong>Meet the bees</strong> 🐝</p>\n\n<p>These are the bees you have at your disposal!<br/><br/><strong>Builder bees</strong><br/>Builder bees are the bees that stay inside the hive, building honeycomb and taking care of the queen and larvae. If all your honeycomb cells fill out, you won't be able to lay eggs or create honey!</p>\n<p><strong>Foragers</strong><br/>Foraging is another task worker bees can have. Forager bees are the ones that go out into the world and bring back delicious nectar and pollen. Yum! After being laid inside cells, nectar becomes valuable honey.<br/><br/><strong>Guards</strong><br/>Sometimes, foreign bees or other dangers come to the hive. Guards make sure to stay by the entrance and only let allied bees come in. They'll fend off any opponent for as long as they live.<br/><br/><strong>The Queen</strong></p>\n<p>The queen is the most important bee in the hive! She lays all the eggs, including the ones that will create her own replacement. If your queen bee gets killed and you can't replace her, your hive will perish! You'll need to lay another queen before you can split.</p>\n<p><strong>Drones</strong></p>\n<p>Drones are born to mate with queens from other hives. They are so dedicated to this one and only goal that they die after fulfilling their purpose. Ouch. You'll need four drones before you can split your hive.</p>\n<p>Bees are amazing creatures, and quite intelligent ones too! Let's all take care of them.</p>\n\n<p>All sounds are open source sounds from opengameart.org and freesound.org. For more of our projects, feel free to follow us on Twitter!</p>\n\n<p>Thanks for playing!<br/></p>", "metacritic": null, "released": "2021-04-26", "tba": false, "updated": "2021-04-30T17:15:58", "background_image": "https://media.rawg.io/media/screenshots/f50/f50fce0d5425d0f94e14346da2efab47.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 58, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Anaxie Studio"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}