{"id": 596231, "slug": "deeper-caverns", "name": "Deeper Caverns", "name_original": "Deeper Caverns", "description": "<p>Deeper Caverns is a simple Isometric Puzzler Game where you attempt to get through the Dragons evil Puzzles and slay the Dragon to save the Princess!</p>\n\n<p>The Princess has been captured by a dragon and the king has called to the most courageous Princes to save the Princess! You are the prince who must make their way through the different layers of obstacles to travel Deeper and Deeper into the Dragon Dens and finally slay the dragon and save the Princess.</p>\n\n\n<p><strong>Playing the game is very simple.</strong>\n</p>\n<p>Use the WASD keys to move.<br/>Press (K) to Enable or Disable the Directional Arrow.<br/>Press (R) to Reset the Current Level.<br/>Press (Escape) to return to the Menu.<br/>Evade Spike traps, Dodge Fireballs, Defeat Skeleton Warriors and push boulders to reach the end level gate!\r\n</p>\n<p><strong>There are 6 Obstlaces in the Ludum Dare 48 version.</strong>\n</p>\n<p>Rocks<br/>Immovable obstacles that just block your path.</p>\n<p>Bridges<br/>Use these to get over the water.</p>\n<p>Boulder Rocks<br/>A movable obstacle that you can push in a given direction.</p>\n<p>Spike Traps<br/>Sneaky holes that will shoot spikes every now and then.</p>\n<p>Fireball Dispenser<br/>Will spit out fireballs that fly across the room.</p>\n<p>Skeleton Warriors<br/>These bad boys will follow you around and try to kill you!</p>", "metacritic": null, "released": "2021-04-26", "tba": false, "updated": "2021-04-30T17:31:16", "background_image": "https://media.rawg.io/media/screenshots/2c1/2c1435a04d93bd79e3e0a80d2b254be9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 38, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["Quartzified Studios"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}