{"id": 59624, "slug": "v-rally-4", "name": "V-Rally 4", "name_original": "V-Rally 4", "description": "<p>The return of a legendary off-road racing game! Enjoy an extreme experience while becoming an expert in a demanding simulation. Take on the challenges of rallies, rallycross, drifts, buggies and hill climbs, and set off on a spectacular journey across every continent.<br />\nDominate dangerous roads, hostile conditions and environments, constantly striving for more speed and with adrenaline boosting your reflexes. At the wheel of the most legendary off-road vehicles in each category, take on the most difficult routes in fabulous surroundings.<br />\nRally: from Kenya to Sequoia Park, dominate the most difficult routes in conditions that are often extreme, at the wheel of modern and historic vehicles.<br />\nV-Rally Cross: intense 8-way races on dirt/tarmac tracks.<br />\nExtreme-Khana: drift, precision and speed, with traps scattered over the roads, putting your driving and showmanship skills to the test!<br />\nBuggy: become an expert at driving through hilly terrain, adopt the special reflexes and learn the particular physics needed to win these fierce races.<br />\nHillclimb: reach the peaks at the wheel of these powerful, twitchy monsters.<br />\nOver 50 car models, including the most famous in rallying and extreme motor sport, for you to test drive, collect, upgrade, customise and, above all, excel at!<br />\nDeveloped by Kylotonn Racing Games, a studio specialising in racing simulations, V-Rally 4 has all the latest physics and graphics developments of the KT Engine.<br />\nAs the trip is worth nothing unless it is shared, V-Rally 4 has a Career mode and an innovative online mode to transform your experience and progress.</p>", "metacritic": 59, "released": "2018-09-11", "tba": false, "updated": "2023-09-01T17:56:19", "background_image": "https://media.rawg.io/media/games/5ad/5ada98a9fa27f9f0eb43bc4e08829b97.jpg", "website": "http://vrallygame.com", "rating": 3.0, "rating_top": 3, "added_by_status": {"yet": 16, "owned": 530, "beaten": 2, "toplay": 8, "dropped": 20, "playing": 4}, "playtime": 1, "achievements_count": 198, "ratings_count": 38, "suggestions_count": 478, "game_series_count": 0, "reviews_count": 38, "platforms": ["PlayStation 4", "Xbox One", "Nintendo Switch", "PC"], "developers": ["Kylotonn Entertainment"], "genres": ["Racing"], "publishers": ["Bigben Interactive"], "esrb_rating": "Everyone"}