{"id": 596383, "slug": "mixed-allegories", "name": "Mixed Allegories", "name_original": "Mixed Allegories", "description": "Mixed Allegories\r\n<p>You are deep within Plato's allegorical cave where the forms have been found - it's your mission to retrieve them and establish Kallipolis.<br/></p>\n<p>Grab the forms with your claw by pressing ❎ when they are in reach.</p>\n<p>Pass through fuel rings to top up your rapidly depleting fuel and avoid the dangers of the cave.</p>\r\nControls\r\n<ul><li><strong>Movement</strong> — ⬅️ ➡️ \r\n</li><li><strong>Grab / Start</strong> — ❎ / X   \r\n</li></ul>\r\nGame Jam\r\n<p>This is an entry for the third Eggplant Community Game Jam #3 where the theme is \"Keep it short\". The source for the cart can be be found in this pico8-carts repo.</p>\r\nReferences\r\n<p>The mixed allegories alluded to in the title are:</p>\r\n\r\nAllegory of the caveThe allegorical cave is the setting of the game's levels, each is randomly varied according to some general parameters. This is definitively not symbolic—it's an actual cave.\r\nTheory of forms\r\nEach level has 4 collectable forms (in 3 variations) which determine the outcome for Kallipolis. Problem of universals solved, they're just collectables in games.\r\nPlato's five regimesThe five regimes outlined by Socrates in The Republic are used for the end–of–level scoring. This author does not endorse aristocracy as the highest level of government.\r\n\r\nThanks\r\n<p>This is the third game I've completed and released, I hope you enjoy it!\r\n    <br/></p>\n<p>Thanks to Lexaloffle for making PICO-8, it was a real pleasure to work with.\r\n    </p>\n<p>A big thank you to the Eggplant Show community who inspired me to make another game and have given great feedback along the way.\r\n</p>", "metacritic": null, "released": "2021-04-26", "tba": false, "updated": "2021-04-30T18:11:36", "background_image": "https://media.rawg.io/media/screenshots/761/7610e5846d90ddbace3934f3fb749458.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 59, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["broquaint"], "genres": ["Action"], "publishers": [], "esrb_rating": null}