{"id": 59632, "slug": "super-mario-odyssey-starter-pack", "name": "Super Mario Odyssey: Starter Pack", "name_original": "Super Mario Odyssey: Starter Pack", "description": "This Starter Pack includes the Super Mario Odyssey™ game for the Nintendo Switch™ system and a Traveler’s Guide book.\nUse amazing new abilities—like the power to capture and control objects, animals, and enemies—to collect Power Moons so you can power up the Odyssey airship and save Princess Peach from Bowser's wedding plans!\nThanks to heroic, hat-shaped Cappy, Mario's got new moves that'll make you rethink his traditional run-and-jump gameplay—like cap jump, cap throw, and capture. Use captured cohorts such as enemies, objects, and animals to progress through the game and uncover loads of hidden collectibles. And if you feel like playing with a friend, just pass them a Joy-Con™ controller! Player 1 controls Mario while Player 2 controls Cappy. This sandbox-style 3D Mario adventure—the first since 1996's beloved Super Mario 64™ and 2002's Nintendo GameCube™ classic Super Mario Sunshine™—is packed with secrets and surprises, plus exciting new kingdoms to explore.\n\nExplore astonishing new locales like skyscraper-packed New Donk City to your heart's content, and run into familiar friends and foes as you try to save Princess Peach from Bowser's dastardly wedding plans.\nFind something interesting? Toss your cap at it and see what happens! There are lots of fun and surprising ways to interact with your surroundings.\nBe sure to bring any coins you find to a Crazy Cap store, where you can exchange them for decorative souvenirs for the Odyssey and new outfits for Mario! Some destinations have very exclusive dress codes, after all…\nHand a Joy-Con™ controller to a friend to enjoy simultaneous multiplayer: Player 1 controls Mario while Player 2 controls Mario's new ally Cappy.\nUse Snapshot Mode to freeze time while playing the game and take screenshots that you can customize using various options and filters. Screenshots can be shared via social media or uploaded to PCs and smart devices* using all of the Nintendo Switch™ system's built-in screenshot tools.\nA special edition Nintendo Switch™ hardware bundle will launch alongside the game. This special edition includes a download code for the full game, red left and right Joy-Con™ controllers, and a Super Mario Odyssey™ themed Nintendo Switch carrying case.", "metacritic": null, "released": "2018-09-27", "tba": false, "updated": "2019-11-19T17:47:55", "background_image": "https://media.rawg.io/media/screenshots/114/114bd115895412641186145e0f42f76f.jpg", "website": "https://supermario.nintendo.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 276, "game_series_count": 0, "reviews_count": 1, "platforms": ["Nintendo Switch"], "developers": ["Nintendo"], "genres": [], "publishers": ["Nintendo"], "esrb_rating": "Everyone 10+"}