{"id": 59653, "slug": "bugout", "name": "BugOut", "name_original": "BugOut", "description": "WARNING: THIS GAME IS EARLY ACCESS ALPHA. PLEASE DO NOT PURCHASE IT UNLESS YOU WANT TO ACTIVELY SUPPORT DEVELOPMENT OF THE GAME AND ARE PREPARED TO HANDLE WITH SERIOUS ISSUES AND POSSIBLE INTERRUPTIONS OF GAME FUNCTIONING.<br/><br/><strong>Short Description</strong><br/><br/>A Modern Day Survival Simulator<br/><br/><br/>The year is 2019, the news is crawling with fear mongering stories of things to come, the end is near, climate change, WW3, Asteroids, Civil Unrest and anything else they can think of, but in the background, you can see the government preparing for something, but what. You decide its time to go off the grid and prepare for the worst.<br/><br/><br/><br/>Welcome to BugOut.<br/><br/><br/>The fear of something major coming soon has taken its effect on you. You feel like you need to do something to prepare yourself to survive the unknown catastrophe coming soon. You sell all of your personal belongings and head off to the mountains to start a new life leaving this old one behind. With only a backpack and a few things to eat you really don't have much to start with. You do have a few hundred dollars to get you started but how long will that last, after hitching a ride into the Appalachians, you are dropped off at a mountainside trading post, your adventure starts here.<br/><br/> <br/>Before you can do anything you will need to get some experience in bugging out. The game starts off in the Appalachian Mountains at a mountainside trading post. Talk to people at the trading post to learn how to get started. Here you can buy some starter gear and head off into the mountains. You can freely hike around the mountains and learn survival skills, or you can accept one of the challenges from the Trading post to receive a reward and maybe some extra skill points if you complete the challenge. As you gain more experience, you will be able to craft more items do more things. While on your Hiking and Camping you can gather extra herbs and other items, and sell them to the trader for some extra cash. The cash can then be used to better your gear. After you have reached enough experience, the piece of land beside the trading post will be available to you at a price. Raise some money and buy the land to start building a full out BugOut home and prepare for the upcoming world-changing event. You can even make it completely self-sufficient and Off-grid with solar power and a water well. If you want you can also choose to grow and jar your own food or use the money to buy long-term storable food. Upgrade your home to survive many different scenarios or if you really want to go all out build a bunker, then stockpile your bunker with everything you think you will need.Be sure get a radio or PC so you can keep up with what is going on, you never know when the time will come that you will need to BugOut.<br/><br/><br/>Be sure get a radio or PC so you can keep up with what is going on, you never know when the time will come that you will need to BugOut.<br/><br/><br/><br/>Will you be prepared?<br/><br/><br/>Prepare as much as you can, an event can happen at random times. <br/>Increase your skills in hunting, fishing, herbalism, building and much more. The better your skill level, the easier it will be to survive when the disaster strikes.<br/><br/><br/>Disaster Events will not be available during stage 1 or 2 of Early access<br/><br/><br/><br/>When a world disaster strikes you will need to use all you have learned to survive the event. <br/><br/><br/>( Example : If a nuclear war was to happen, you would have to be in a sealed living area, with enough food, water and other resources you would need to survive the fallout, and then enough to use after the event until you can acquire more, plus you would need gear to test for radiation and explore infected areas) This is only one example, other events may affect you in an opposite way. <br/>After the main event has happened at you come out of your home or bunker, you will be faced with lots of new challenges and a huge open world to explore. Stay in the mountains if you can still sustain, or explore the towns and cities, travel around and gather more resources to survive. Depending on the event you may have to deal with AI players, or different types of animals, you just don't know, thats why it is best to prepare all you can before the event. <br/><br/><br/><br/><br/><br/><br/><br/><br/><br/>Game Features<br/><br/><br/>Crafting<br/>Hunting<br/>Fishing<br/>Gathering<br/>Building<br/>Exploring<br/>Surviving<br/><br/><br/><br/>More to come", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:59:21", "background_image": "https://media.rawg.io/media/screenshots/1c8/1c80b1a4f3f83820eb016ff315b6bc47.jpg", "website": "https://www.addicted2gaming.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 449, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["A2G Studios"], "genres": ["Action", "Adventure", "RPG", "Simulation", "Indie"], "publishers": ["A2G Studios"], "esrb_rating": null}