{"id": 59668, "slug": "huge-enemy-worldbreakers", "name": "Huge Enemy - Worldbreakers", "name_original": "Huge Enemy - Worldbreakers", "description": "Huge Enemy - Worldbreakers is a side-scrolling Shootem'Em Up that takes place in a rich environment designed in Full HD. <br/>Immerse yourself in a Dark Sci-Fi universe with Japanese influences.<br/><br/>Fight huge bosses on multiple fields of depth. <br/>Escape from bullets and enemies by using the dodge action. Perform paybacks and regenerate your life-bar by absorbing your opponent's energy.<br/><br/>Use your joypad's twinstick or play with your mouse and keyboard to move freely and shoot anywhere on the screen. <br/><br/>CONTENT<br/><ul><li>Eleven playable levels including two survival challenges and a speedrun<br/></li><li>Longplay<br/></li><li>Fourteen animated end-level bosses<br/></li><li>Up to 25 000 ennemies displayed by level<br/></li><li>Quantities of pyrotechnic effects for shots and explosions<br/></li><li>High définition \"Pixel Art\" for a modern and very detailed design</li></ul>GAMEPLAY<br/><ul><li>Dodge into the background to avoid bullets and ennemies<br/></li><li>Shoot into the foreground and also into the background<br/></li><li>Payback function, perform dazzling counter-strikes when hit<br/></li><li>Reshield to regenerate your life while fighting bosses</li></ul>TRAINING<br/><ul><li>Master your flight skills in the training room </li></ul>TACTIC<br/><ul><li>Define your style by chosing an offensive or defensive payback<br/></li><li>Chose your tactic in the Dashboard before any level and before any boss encounter</li></ul>GEAR<br/><ul><li>Chose between two different kind of spaceships<br/></li><li>Four weapons available and upgradable to five levels   <br/></li><li>Use three Mega Weapons anytime<br/></li><li>Enhance your weapons by collecting money and spending it at any checkpoint</li></ul>MUSIC<br/><ul><li>Twenty two original and intense tracks for more than sixty minutes of listening<br/></li><li>Each level has his own musical signature with styles melting electro-rock, jazz and symphonic music<br/></li><li>Spatial sound effects for a better control of fightings</li></ul>INCENTIVES<br/><ul><li>Unlock twenty Steam successes to win avatars and more game money<br/></li><li>Replay the levels to strengthen your arsenal<br/></li><li>Play the game in hard mode to discover hidden elements <br/></li><li>Compete with other players by marking your name on the Online Leaderboard</li></ul><br/>", "metacritic": null, "released": "2018-09-07", "tba": false, "updated": "2019-08-28T21:59:20", "background_image": "https://media.rawg.io/media/screenshots/fec/fecd2245910ebb99961ff17c45410ca1.jpg", "website": "http://www.hugeenemy.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 128}, "playtime": 1, "achievements_count": 19, "ratings_count": 0, "suggestions_count": 373, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Huge Enemy Production"], "genres": ["Action", "Indie"], "publishers": ["Plug In Digital", "Huge Enemy Production"], "esrb_rating": null}