{"id": 59685, "slug": "kitty-play", "name": "Kitty Play", "name_original": "Kitty Play", "description": "Who said being a kitten would be easy?<br/><br/>Sure, the owners feed you and the bowl is full of water! But growing up is so hard!<br/>After all, in order to grow tall and strong, you'll have to develop your skills by playing learning games, and sometimes you just want to mess around.<br/>You can't mess around, though, because it's very important that the family you live in loves you, and that's a tall order!<br/><br/><br/><br/><ul><li>Porfirio must develop, and with each level of development, he'll learn to run faster, jump higher and get access to new games that let him grow even further!<br/></li><li>Porfirio must not fall from grace, and for that, he'll have to avoid making a mess during his games - no breaking vases, no throwing the little one's favourite toys around and, of course, always using the litter box instead of anything else!<br/></li><li>If Porfirio behaves himself well, his family will love him even more and gift him various things, ranging from cat houses to improved litter boxes that let you skip washing afterwards!<br/></li><li>Numerous tasks await Porfirio - from a simple ball game and a scavenger hunt for hidden delicacies to repelling a mouse invasion and a battle with the neighbours' bull-terrier.<br/></li><li>In little Porfirio's day-to-day activities he will be helped out by the mischievous parrot Steven, the kind old street cat Murz and the smart white rat that lives in the walls.</li></ul><br/>", "metacritic": null, "released": "2018-08-30", "tba": false, "updated": "2019-08-28T21:59:20", "background_image": "https://media.rawg.io/media/screenshots/3c9/3c9a127fd92b919d5960e9233ef6106f.jpg", "website": "http://catswhoplay.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 240, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Cats Who Play"], "genres": ["Adventure", "Indie"], "publishers": ["Cats Who Play"], "esrb_rating": null}