{"id": 596867, "slug": "block-party-beta-launch", "name": "Block Party Beta Launch", "name_original": "Block Party Beta Launch", "description": "<p>There are currently 2 student developers working on this 6-month long project. We are both computer science majors at California State University Long Beach and officers of the Video Game Development Association; a club dedicated to helping other students create video games and hosting many different game development-related activities. </p>\r\nMini-Games\r\nTrailblazers\r\nGet ready to blast your friends and perform evasive maneuvers in this Tron-inspired game! Players must outsmart their enemies and ram them into the ever-moving walls or their own trails to be crowned the winner.\r\n\r\n\r\nScurvy Scramblers\r\n<p>Keep moving or they will get yer' booty! The ground is collapsing beneath you and space is scarce, trick your friends into falling into the sea below. Watch out for skeletons and obstacles as they can stop or slow your movement, leaving you vulnerable!</p>\n\r\nKing of the Hill\r\n<p>Home sweet home, what could go wrong? Well for starters, there's a ginormous sinkhole consuming your house. To make matters worse, your house is slowly breaking plank by plank! Use your environment and agility to be the last player standing!</p>\n\r\nBuild-a-Burger\r\n<p>Your boss has had enough and your job is on the line. Avoid being fired and be the only employee standing. The longer the players are alive, the more complex burgers the customers want! Race against your boss's anger and build as many burgers as you can in this fast-paced button combination game! </p>\n\r\nWhat the Puck\r\n<p>You've somehow been shrunken down to the size of a hockey puck... wait there's a hockey puck coming right toward you! Do everything you can to avoid the hockey pucks and be the last man standing! Use your fists to reflect them or stomp on your opponent's heads to stun them! Oh, and let's just say you're not wearing the right footwear. </p>\r\nTreadmill Trials\r\n<p>You've found yourself stuck on a couple of conveyor belts. The drop seems a little too high to survive and the treadmills won't turn off! Not to mention, the warehouse's inventory is being routed onto those exact treadmills! Jump in between the treadmills to avoid being pushed off by the product and be the last one standing in this hectic survival minigame!</p>", "metacritic": null, "released": "2021-04-26", "tba": false, "updated": "2021-04-30T20:14:59", "background_image": "https://media.rawg.io/media/screenshots/baa/baac7a1a0ac51dca1ee3a737d1e8b64d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 29, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Chloe Culver", "BlackSwissCheese"], "genres": ["Action"], "publishers": [], "esrb_rating": null}