{"id": 596986, "slug": "drilling-with-dice", "name": "Drilling With Dice", "name_original": "Drilling With Dice", "description": "<p>You are a failing mining company who has 30 days to fine the rare mineral Ludarium, which is 3500 meters down. If you cannot then your company will go bankrupt. You start with $1,000,000.</p>\n<p>You start by DRILLING the ground in hopes of finding something you can sell to continue to fund this expedition. Your drill and processing machine are old and have a 34% chance of failing on any given day. It costs $250,000 to replace your drill bit and $200,000 to fix the processing machine.\r\n</p>\n<p>You have 3 depths you can drill at, 100m, 200m, or 300m. It costs $100,000 per 100m. If you were to drill 300m then it would cost $300,000. Your drill can fail no matter how deep you go but you need to reach 3500m before the end of 30 days or the mining company will go bankrupt.\r\n</p>\n<p>To Drill you need to place pairs of dice into each depth slot you want to drill. For instance if you want to drill 300m then you would need 3 pairs of dice, one for each depth.\r\n</p>\n<p>A full day consists of Drilling and Processing.\r\n</p>\n<p>If the drill does fail then you only need to pay to have it repaired but you will lose an extra day because of it.\r\n</p>\n<p>If you are successful with the Drilling you will then move on to Processing the ground you just drilled in hopes of finding something useful to sell.\r\n</p>\n<p>Processing just requires you to place the dice in the Processing slots. The larger the numbers then more money you will make as all of the numbers on the dice are added together.\r\n</p>\n<p>You only get one Reroll per Drilling and Processing.\r\n</p>\n<p>You can still fail while Processing and it will take a day to get the machine up and running.\r\n</p>\n<p>Good Luck!!\r\n</p>", "metacritic": null, "released": "2021-04-26", "tba": false, "updated": "2021-04-30T20:40:08", "background_image": "https://media.rawg.io/media/screenshots/43c/43c1c1dbc02adec5fca84663135f4d2d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 16, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["KunoNoOni"], "genres": [], "publishers": [], "esrb_rating": null}