{"id": 59691, "slug": "icons-combat-arena", "name": "Icons: Combat Arena", "name_original": "Icons: Combat Arena", "description": "<strong><strong>Icons: Combat Arena</strong> is currently only available for download in North America.  Please visit our forums for more information!</strong><br/><br/>Designed to be the most responsive and competitive platform fighting game on Steam, <strong>Icons: Combat Arena</strong> provides a fully supported multiplayer experience, tight controls, intuitive movement, powerful special attacks, and tons of customization, including gorgeous skins, rousing taunts and emotes, holograms, custom player portraits, and more.<br/><br/>Featuring an ever-expanding roster of iconic combatants, each with their own colorful backstory, <strong>Icons: Combat Arena</strong> is a rich and memorable gaming experience. Our commitment to flawless online play, balanced combat, tournament support and deep competitive gameplay makes Icons the ultimate fighting game.<br/><br/>Whether it’s for fame, fortune, or fun - those entering the arena share one goal: to win the intergalactic League and become an icon of their homeworld.Key Features:<ul><li><strong>Lightning Fast Gameplay:</strong> Movement controls are precise and responsive while unique combinations of mechanics create strategic depth.<br/><br/></li><li><strong>Flawless Online Play:</strong> Best of all is the netcode, which is custom-built to prioritize control of your character and combos, as if playing offline.<br/><br/></li><li><strong>Iconic Fighters:</strong> Some fight for fame, some for fortune, some for the fun of fighting itself, but they all fight for the same reason… to WIN! With seven playable characters at Early Access launch and much more to come, players can explore an endless world of matchups and mechanics.<br/><br/></li><li><strong>Express Yourself:</strong> Want to play a cyberpunk sharpshooter or an elegant swordswoman ninja? Icons features skins, taunts, emotes, player portraits, and other customization items bursting with personality.<br/><br/></li><li><strong>Free to Play:</strong> Icons is free to play and shop items do not affect game balance. Almost all purchasable content can be earned through gameplay.<br/><br/></li><li><strong>Multiple Game Modes:</strong> Finding a worthy opponent is as easy as hooking up local multiplayer, jumping into our online matchmaking system, or browsing custom matches. Test your skills against multiple opponents with Free For All! Additional game modes coming soon: 2v2 teams, single player modes worthy of speed running, and entirely new team-based modes not yet seen in a platform fighter.<br/><br/></li><li><strong>Customizable Controls:</strong> Icons is compatible with many input devices, including GameCube controller, gamepad, keyboard, or dual shock. Control schemes can be mapped using in-game settings, and input will always feel precise and responsive.<br/></li><li><strong>Built for Competition:</strong> Icons is designed from the ground up for competitive balance, no matter the matchup. There are no combat items or powerups - just a pure test of skill. </li></ul><ul><li><strong>Esports Ecosystem:</strong> Icons developer Wavedash Games will host open-entry online and offline tournaments. Follow us on social media for updates!<br/></li><li>Designed with Passion: Icons is created by a group of seasoned experts from every era of platform fighting games.</li></ul>", "metacritic": null, "released": "2018-07-12", "tba": false, "updated": "2023-02-20T23:19:52", "background_image": "https://media.rawg.io/media/screenshots/584/58498a0b75cbc5741f4e46fd9dfc1052.jpg", "website": "http://icons.gg", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 267, "dropped": 5}, "playtime": 1, "achievements_count": 0, "ratings_count": 4, "suggestions_count": 378, "game_series_count": 0, "reviews_count": 4, "platforms": ["PC"], "developers": ["Wavedash Games"], "genres": ["Indie"], "publishers": ["Wavedash Games"], "esrb_rating": null}