{"id": 59699, "slug": "yiik-a-postmodern-rpg", "name": "YIIK: A Postmodern RPG", "name_original": "YIIK: A Postmodern RPG", "description": "<p>After witnessing a woman vanish from an elevator, college graduate Alex embarks on an adventure to rescue her, which spirals into an epic quest with stakes higher than he could have ever imagined.<br />\nAlex’s search for the woman and the truth behind her disappearance lead him and his companions towards the new millennium, on a journey rife with mystery and danger... or so goes the tale of YIIK: A Postmodern RPG, the surreal Japanese-style RPG from Ackk Studios and Ysbryd Games.<br />\nBattle through dungeons littered with puzzles, traps, and bizarre monsters with a party of up to eight members, using a combat system that blends twitchy minigames with turn-based combat. Brandish records, cameras, musical instruments and more against enemies ranging from floating, yammering skulls to tortoise samurais.<br />\nYIIK has more than 30 hours of content including a fully-voiced main story campaign featuring talents such as Chris Niosi (Tales of Zestiria, Disgaea 5), Clifford Chapin (Borderlands: The Pre-Sequel, Attack on Titan, RWBY) and more.<br />\nPolygonal rendering, lack of textures and a rich, saturated color scheme lend to the dreamlike, otherworldly qualities of the environments and their inhabitants. The soundtrack – including contributions from composers such as Toby Fox (Undertale) and Hiroki Kikuta (Secret of Mana) – is as eclectic as the gameplay, featuring an electroacoustic fusion of jazz, funk, traditional JRPG-style tunes and swing.</p>", "metacritic": null, "released": "2019-01-17", "tba": false, "updated": "2020-01-21T13:57:39", "background_image": "https://media.rawg.io/media/screenshots/ddd/ddd43214a80cfce86bcf074f68d4f157.jpg", "website": "http://www.yiikrpg.com", "rating": 1.62, "rating_top": 1, "added_by_status": {"yet": 7, "owned": 42, "beaten": 3, "toplay": 16, "dropped": 5}, "playtime": 6, "achievements_count": 79, "ratings_count": 13, "suggestions_count": 359, "game_series_count": 0, "reviews_count": 13, "platforms": ["PlayStation 4", "Nintendo Switch", "PC", "macOS"], "developers": ["Ysbryd Games Worldwide", "Ackk Studios", "AckkStudios"], "genres": ["RPG", "Indie"], "publishers": ["Ysbryd Games"], "esrb_rating": "Mature"}