{"id": 597002, "slug": "resurface-an-ld48-compo-entry", "name": "Resurface - An LD48 Compo Entry", "name_original": "Resurface - An LD48 Compo Entry", "description": "<p><em>NOTICE: Resurface is a 6-degrees-of-freedom game that may present problems for players prone to motion sickness.<br/></em></p>\n<p><em>Standalone download recommended; WebGL build has some audio issues.</em></p>\n<strong><em>Three years after a devastating crash, the story of the HMS Good Omens resurfaces.</em></strong>\n\n<p>Join a small recovery crew on an expedition to Omen's Rest, an  infamous cove on the Martian Orange Sea where a once-luxurious cruise  liner has permanently made itself a new resting place.        The friends and families of its former passengers have offered to pay  great sums should you come across any of their valuables, both  sentimental and otherwise, on your journey.  Be warned: the  roughly-terraformed environment will be tough on even the highest  quality deep sea gear, and you will need to keep an eye on your Air  Meter to make sure you don't end up like the rest of the ship.          Delve into the decaying halls of the ship and make enough back from  returning cherished items to gain access to the furthest reaches of the  ship's interior.  If you keep your wits about you, you may be able to  spot something of your own interest...</p>\r\n\r\nControls\r\n<ul><li>W/S: Move Forward/Back\r\n</li><li>A/D: Move Left/Right\r\n</li><li>Q/E: Roll Left/Right\r\n</li><li>MouseLook: Turn the Camera (Navigation Mode only)\r\n</li><li>Mouse1: Interact (Interact Mode Only)\r\n</li><li>Mouse2: Toggle Interact/Navigation Mode\r\n</li><li>F: Return to Surface (context-sensitive)\r\n</li><li>T: Drop Glowstick</li><li>Shift: Show Mementos List</li></ul>\r\n\r\nHow to play\r\n<p>Explore the ship from the entrance point your team has picked, and keep a mental note of this location so that you can find your way back.  On your journey, keep an eye out and listen for items that hold sentimental value to the crew.<br/></p>\n<p>When low on air, return to the entrance to refill your air tank.  You can also use your funds from item bounties to buy upgrades for the more perilous aspects of your journey, from glowsticks that will mark your path in green light to an upgraded suit filter that can maintain safe pressure for 2-4x times as long.</p>\n<p>To interact with items, flip into Interact Mode with the right mouse button and use your mouse cursor to click on objects.</p>\r\n\r\nOfficial Soundtrack<br/>\n<p>anchorlight · Resurface - Official Soundtrack</p>\r\n\r\nCreated in 48 hours for Ludum Dare 48.", "metacritic": null, "released": "2021-04-26", "tba": false, "updated": "2021-04-30T20:43:45", "background_image": "https://media.rawg.io/media/screenshots/3b7/3b78ff638a87a585f11fefcc23b3bb78.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 81, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["anchorlight"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}