{"id": 597031, "slug": "shiny-depths", "name": "Shiny Depths", "name_original": "Shiny Depths", "description": "<p><strong><em>Bug fix update: Just fixed a number of small bugs and a reasonable improvement in performance. Version 1.1 (the first file listed, named \"v1.1 bug fixes\") is strongly recommended. No new gameplay features were introduced. You can check the full commit message on the Bitbucket code repository listed below. Thanks for the patience!</em></strong></p>\r\nPremise\r\n<p>You are an expert miner who has decided to explore the Dareum mine nearby, a procedurally generated mine. You will try to dig deeper and deeper, while mining precious materials on the way!</p>\n<p>Mining is dangerous, so you need to be agile to survive. Your health will decrease in the depths, your headlight will eventually run out of battery and your pickaxe will grow dull. Also, if you don't dig carefully, you can end up trapped forever, having no way to ascend!</p>\n<p>Fortunately, a small table/shop is available just outside the mine entrance. Use it to sell your precious jewels and ores to repair your gear, restore your health and upgrade your stuff.</p>\n<p>See if you can make it all the way to depth 150, the center of the very Earth! <strong>Who knows what cool stuff will you find there?!?</strong></p>\r\nControls\r\n<ul><li>By default, <strong>WASD</strong> to move (A and D to move, W to jump/ascend, S to descend). You can remap these in Options.</li><li><strong>Left mouse button</strong> to dig/mine or enter the shop/interact.</li><li><strong>Right mouse button</strong> to toggle your headlight on/off (while underground) or exit the shop.</li><li><strong>ESC </strong>pauses the game.</li><li>You can use <strong>middle mouse button </strong>to pan the camera.</li></ul>\r\nTips and Tricks\r\n<ol><li>Be careful how you mine! If you don't think forward, you might get stuck, unable to ascend, and you'll eventually die.</li><li>If you accidentally get stuck into a shaft three blocks deep, try jumping and digging at the same time, it might just be what you need :D</li><li>Always keep an eye on your health, battery level and pickaxe sharpness. Try to upgrade your light and pickaxe as soon as possible.</li><li>The deeper you go, the more health you lose, but the more precious gems and materials you might be able to mine!</li></ol>\r\nCredits\r\n<ul><li>This game was made all by myself, for Ludum Dare 48 Compo, in 48 hours. I created all art (Aseprite), programming (Gamemaker Studio 2.3), sounds (bfxr + my Roland piano + Audacity) and music (I composed and played both songs in my Roland piano).</li><li>I used my existing template for new projects (also created by me), as well as the string formatting library I created (<strong>TypeFormatted</strong>).</li><li>I used the free <strong>JujuAdams's Bulb library </strong>for the lighting effects, available here: https://github.com/JujuAdams/Bulb</li><li>Fonts used downloaded from:</li><li>\"No Virus\":  https://www.dafont.com/no-virus.font<br/>\"Poetsen One\": https://www.dafont.com/poetsen-one.font</li><li>Source code (Bitbucket repository)<strong>: </strong>https://bitbucket.org/biyectivo/ld48/src/master/</li></ul>\r\nExtra\r\n<p>I will reward the first player to post a screenshot in the comments who has found the cool stuff lying in the final depth of the Earth. No cheating by modding the code!!!<br/></p>", "metacritic": null, "released": "2021-04-26", "tba": false, "updated": "2021-04-30T20:50:57", "background_image": "https://media.rawg.io/media/screenshots/c08/c08b0b685086012b55ad3acb3b7508c8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 32, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["biyectivo"], "genres": ["Action", "Adventure"], "publishers": [], "esrb_rating": null}