{"id": 597055, "slug": "ancient-civilizations", "name": "Ancient Civilizations", "name_original": "Ancient Civilizations", "description": "<p>You are at a dig site. Your job is to go \"deeper and deeper\" into the caverns and find ancient artifacts that can make you rich. However, there are monsters from all different time periods ( only mummies since I didn't get as far as I wanted ) that will try and stop you. Can you find all the artifacts? If you do, then you will have a lovely retirement. </p>\n\n<p>Controls:</p>\n<p>Left mouse click: Attack</p>\n<p>E: Inspect/Climb Ropes/Mine Rocks</p>\n<p>W: Jump</p>\n<p>A: Move Left</p>\n<p>D: Move Right</p>\n<p>1: Pickaxe</p>\n<p>2: Sword</p><p>( NOTE: Please be aware, that the attacking does work. However, you aren't able to \"swing\" unless you're attacking an enemy. Also there is swing speed on the weapons which don't let you spam attack. Furthermore, even if the swinging animation isn't playing you're more than likely still doing damage. This isn't an \"attack\" or code issue, just my rushed animation system issue. The best way to tell is if you hear the enemy \"ugh\" sound effect that let's you know they are taking damage. Thank you. )</p>\n\n<p>Please be kind. The art and music were the last part I worked on and had very limited time. The code is optimized as much as possible with very little amounts of bugs in the game. If you find any bugs please let me know. Thank you for playing.</p>\n\n<p>#LudumDare48</p>", "metacritic": null, "released": "2021-04-26", "tba": false, "updated": "2021-04-30T20:56:50", "background_image": "https://media.rawg.io/media/screenshots/cbc/cbca0c5ce816c508b679a1f77d8a996d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 22, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["ForeverTrash"], "genres": ["Action", "Adventure"], "publishers": [], "esrb_rating": null}