{"id": 597120, "slug": "8-bitsy", "name": "8-Bitsy", "name_original": "8-Bitsy", "description": "<p>8-Bitsy is a simple tool, built using the Honeylisp programming environment, to make simple Bitsy-like worlds that run on the Apple ][.</p>\n<p><em>What's Honeylisp?</em> Honeylisp is the lite text editor, running inside the love2d game engine, with a bunch of plugins and libraries that support creating Apple ][ software using fennel. It comprises a lispy 6502 assembler, a Forth-like direct-threaded code interpreter,  tools integrated into the editor for creating graphics and maps, and tools to integrate with actual Apple II hardware (via serial or cassette port) or MAME (providing a Fennel nREPL as a MAME plugin). Prior to the jam, it was used to create Neu] [ower.</p>\n<p><em>What's Bitsy?</em> Bitsy is a very accessible web-based tool by Adam LeDoux that allows anyone to make little worlds filled with little pixel guys that you can talk to. It does not require any programming, but is very hackable, and has a vibrant community of cool people making cool stuff with it.</p>\n<p><em>What work did you actually do for the Lisp Game Jam?</em> All of the Neu] [ower-specific code was pulled out, to provide a simplified engine. The data format was reworked so that, instead of each editor working on independent files, there is now a single file containing all graphics, maps, and object data.  New tiles created in the tile editor now immediately appear inside the map editor. Finally, the map editor was extended so that objects' behaviour could be programmed directly from inside the editor, without having to write any code. The old way of working - specifying object behaviour by typing in the name of a subroutine to run - is now hidden behind an \"advanced\"  mode.<br/></p>\n<p><em>What is this .dsk file?</em> The file you can download here is a sort of \"demo game\" - a tiny little world you can wander around in and explore. You can play it with your favourite Apple II emulator, or use ADT Pro to write it to a real floppy disk and play it on real hardware, if you have it.</p>\n<p><em>How can I use 8-Bitsy to make my own Apple ][ games?</em> Please note that neither Honeylisp nor 8-bitsy have  been tested on any systems besides the author's, so you may run into problems. You require, at minimum, love2d installed.</p>\n<ul><li>Download and unzip the latest source code from bitbucket - https://bitbucket.org/SpindleyQ/honeylisp/get/springlispjam2021.zip<ul><li>(I've also uploaded it to the itch page, to ensure I comply completely with the rules, but you should grab the latest version from bitbucket just to be sure.)</li></ul></li><li>From inside the directory you unzipped it to, run \"love .\"</li></ul>\n<p>You should now see a text editor like this:</p>\n\n<p>To run any of the special Honeylisp commands, press Ctrl-Shift-P to bring up the command menu, and start typing the name of the command you want to run. Some useful ones:<br/></p>\r\nHoneylisp: Tile Editor<br/>Tool for drawing 14x16 pixel tilesHoneylisp: Map Editor<br/>Main tool for creating maps and specifying object behaviourHoneylisp: Portrait EditorTool for creating 28x32 pixel portrait images, used when displaying dialogue<br/>Honeylisp: Font Editor<br/>Tool for modifying the font used in dialogueHoneylisp: RebuildGenerates a new 8bitsy.dsk fileLink: Switch to {Serial, Tape, Mame}Determine which Apple ][ integration link should be active<br/>Link: Boot<br/>Starts an Apple ][ in MAME with the Honeylisp integration plugin enabled<br/>Honeylisp: Upload<br/>Uploads the game directly into memory and runs it<br/>\n<p>Additionally, the following shortcut keys are often useful:</p>\r\nCtrl-SSaveAlt-RIn Honeylisp editors, reverts the game to the previous version saved to disk. In Fennel editors, performs a hot-code-reload operation on the currently-open module; this allows custom editors to be built and improved without leaving the Honeylisp environment.<br/>Alt-LWhen connected to MAME, rebuilds the project, and performs a hot-code-reload operation to load the latest version of the game into Apple ][ memory, without requiring a restart.<br/>\n<p><em>What license is Honeylisp / 8-Bitsy / the demo game released under?</em> Everything is hereby released under the GPLv3 license, with the exception of the bundled third-party components under the \"vendor\" directory, which are licensed according to their accompanying LICENSE files.<br/></p>", "metacritic": null, "released": "2021-04-25", "tba": false, "updated": "2021-04-30T21:12:56", "background_image": "https://media.rawg.io/media/screenshots/282/282363be418725215d0e5b6977e7b9db.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 60, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SpindleyQ"], "genres": [], "publishers": [], "esrb_rating": null}