{"id": 59718, "slug": "garrison-archangel", "name": "Garrison: Archangel", "name_original": "Garrison: Archangel", "description": "Garrison: Archangel is a fast-paced, customizable, mecha fighting game designed for one-on-one and multiplayer team battles <strong>coming soon for Early Access on Steam!</strong><br/><br/><br/><br/>These are the features to expect when Garrison: Archangel is completed!<br/><ul><li>Design a custom Archangel down to the colors of each part.<br/></li><li>Battle friends and foes in various maps and arenas.<br/></li><li>Custom Game mode allows you to set up your own local games with changeable rules, stats, teams and options! Have duels, deathmatches, free-for-alls and survival games with your friends and the AI!<br/></li><li>Couch split-screen of up to four players! (Controllers required!)<br/></li><li>Connect and fight with players around the globe.</li></ul><br/><br/><br/><br/>Create the mech of your dreams choosing from a range of carefully designed components and weapons.<br/><br/>Archangels can wield a huge arsenal of weapons each having unique mechanics and gameplay. Each handcrafted weapon allows players to play the way they want whether it’s beating down opponents with the Dominus Sword or blasting them with rockets. Or both.<br/><br/>You and your friends can pilot Archangels from the comfort of your sofa with 4-player local gameplay!<br/><br/>Battle through a variety of arenas that vary from stadiums to trap-filled death pits in our Custom Game mode!<br/><br/><br/> <br/><br/>The developers plan for this to be an expansive project with continuous updates. These updates will include new mecha parts, armaments, attachments, maps and game modes.<br/><br/>It will also have a heavily community-driven development cycle so that the players get what they want in terms of content. The development team is opening up multiple avenues for contact and will continue to stay active on social media and the Discord channel. So please feel free to share your thoughts with us!", "metacritic": null, "released": "2018-03-28", "tba": false, "updated": "2019-08-28T21:59:18", "background_image": "https://media.rawg.io/media/screenshots/b93/b930cc8000947b30e151c6d9a943a439.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 24}, "playtime": 8, "achievements_count": 30, "ratings_count": 0, "suggestions_count": 429, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Indigo Entertainment"], "genres": ["Action", "Indie"], "publishers": ["Indigo Entertainment"], "esrb_rating": null}