{"id": 597134, "slug": "diggings-afoot", "name": "Digging's Afoot!", "name_original": "Digging's Afoot!", "description": "Digging’s Afoot!\r\nan autobiographical tale\r\n<p><strong>Controls:</strong></p>\n<ul><li><strong>move:</strong> arrow keys </li><li><strong>pause:</strong> p/escape</li><li><strong>dig/drop dirt:</strong> enter key</li></ul>\n\n<p><strong>Objective:</strong> dig a hole. spread the dirt all over the backyard. don't get stuck. or called in for dinner!</p>\r\nHelp\r\n<p>\r\nIf you <em>do</em> get stuck in a corner between some dirt piles you press \"P\" to get to the pause menu &amp; quit back to the main menu.</p>\r\nGame Mode Options\r\n<p>Enjoy the relaxed pace of an infinite summer's day in \"Free Roam\" mode--no score, no time limit, just the pure joy of digging a hole in the backyard just for the sake of it.</p>\n<p>Or, if you're the more competitive sort, play game mode--there's a score, a time limit and combo bonuses!<br/></p>\r\nInspired by true events!\r\n<p><em>a game dedicated to my loving Mum &amp; Dad :)</em><br/></p>\n<p>The story goes that when I was a kid I really liked to dig holes in the backyard.</p>\n<p>Problem was, my uncles--when they were kids--had also really liked to dig holes in their backyard.</p>\n<p>And, years later, their mother found out exactly how deep they dug...</p>\n<p>...so given my Mum had learned about that family history, I had to live with a strict \"stop digging a hole when you reach clay\" rule! :) (Probably a mere 0.5-0.75m or so.)</p>\n<p>And that's the story that inspired this Ludum Dare \"Deeper &amp; Deeper\" themed game where you dig a hole in your backyard...</p>\n<p>\"Digging's Afoot!\" is what might have happened if I'd watched more POW escape movies when I was a kid--and if I'd learned the \"spread dirt dug out of a hole around the yard\" trick they contained. :)</p>\r\nGameplay images\r\n\n\n\r\nCheck out the development thread on Twitter\r\n<ul><li>\"Digging's Afoot\" behind the scenes development thread</li></ul>\r\nChangelog\r\n<p>v0.1.0 -- Pre-compo deadline upload.</p>\n<p>v0.2.0 -- Pre-jam deadline upload. WIP. Now includes game mode in addition to the previously existing free roam mode.</p>\n<p>v0.2.1 -- Pre-jam deadline upload. Added pause menu with resume/quit game support.<br/></p>", "metacritic": null, "released": "2021-04-25", "tba": false, "updated": "2021-04-30T21:15:46", "background_image": "https://media.rawg.io/media/screenshots/c04/c044226892be4581e72d8847b06e8597.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 20, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux", "Web"], "developers": ["rancidbacon"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}