{"id": 597163, "slug": "age-of-legion", "name": "Age of Legion", "name_original": "Age of Legion", "description": "Age of Legions is a single-player strategy. The player must manage their territory and use its population and income to hire more troops and expand their influence.<h3>Manage troops and conquer the continent</h3>The player should garrison their territory with troops led by commanders. Commanders specializing in different areas can be hired from the tavern. Form your garrison army with your commanders, troops, skills and set up an appropriate formation for them.<br/><br/><br/><br/><br/><br/>Of course, the running speed of the game can be adjusted.<br/><br/><br/><h3>Real time battles and lead the charge</h3>Apart from managing the legion on the map, players can also take the battle in their own hands and control a squad of heroes. Heroes can be given different commands with the mouse scroll to help them achieve victory.<br/><br/><h3>What is the Band of Heroes?</h3>The Band of Heroes is made up of Heroes, troops, and skills.<br/><br/><br/>Like the name suggests, the Heroes are the core of the Band of Heroes. Each Hero has their own strengths and troops that they specialize in leading.<br/><br/><br/><br/>Each troops type counters and supports each other in different ways, so apart from thinking about a way to defeat the enemy's attacking troops, players must take enemy counters into consideration as well.<br/><br/><br/><br/>Skills can be activated during battle by using energy. Different skills are able to deal with different situations, so players should use them according to the scenario.<br/>", "metacritic": null, "released": "2021-04-30", "tba": false, "updated": "2021-05-03T02:20:12", "background_image": "https://media.rawg.io/media/screenshots/ff2/ff2f69694a7e703ff515c807455b192a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 263, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Gravity Field Games"], "genres": ["RPG", "Strategy", "Simulation", "Indie"], "publishers": ["firepillar2"], "esrb_rating": null}