{"id": 5971, "slug": "terra-monsters-2", "name": "Terra Monsters 2", "name_original": "Terra Monsters 2", "description": "**If you came here looking for Terra Monsters 3 this isn&amp;#39;t it, go to this store page instead! https://itunes.apple.com/us/app/terra-monsters-3/id977256145?ls=1&amp;amp;mt=8 **<br/><br/>You and your small village is plunged in the midst of all out war! You will embark on an adventure of a lifetime exploring a massive open world, partake in explosive 3vs3 battles and capture and train 200 unique Terra Monsters.<br/><br/>Afer has been plunged into conflict in recent times, the tribes of the region have been plagued with mistrust and frequent fights amongst one another. It is down to you, and your Terra Monsters to find out the true reason behind the turmoil and restore peace back to the region.<br/>Will you, and your new ability to bond with Terra Monsters be able to save the region of Afer from further chaos?<br/><br/>… And what secrets of Terrarium will you unlock along the way?<br/><br/>- DYNAMIC AND ENGAGING BATTLE ACTION!<br/><br/>The newly designed 3 versus 3 Terra Monsters battle will leave you on the edge of your seats. Amazing new attack animations and hundreds of moves to unlock and assign will test your skills as a Terra Rancher.<br/><br/>- ASSEMBLE THE MOST POWERFUL TEAM!<br/><br/>Power up over 200 unique Terra Monsters and watch them evolve into their epic final stages. With endless combinations of Terra Monsters and new team-oriented support moves, will your team of Terra Monster reign supreme?<br/><br/>- MASSIVE OPEN WORLD!<br/><br/>You’ve never seen a game like this. Spend hours on end exploring this vast open world with unique territory and landscapes. Be completely immersed in a thrilling story of friendship and war and help uncover the truth behind the conflict that plagues the land. <br/><br/>- PUT YOUR SKILLS TO THE TEST!<br/><br/>Do you, and your Terra Monsters have what it takes to beat your friends or enemies? Challenge them in the PvP Arena and see who comes out victorious.", "metacritic": null, "released": "2015-03-21", "tba": false, "updated": "2019-10-22T14:28:32", "background_image": "https://media.rawg.io/media/screenshots/a6b/a6b5e45e487ea64a1859ae8f17a70c40.jpeg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 155, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Social Titans"], "genres": ["Adventure", "RPG"], "publishers": ["Social Titans"], "esrb_rating": "Everyone 10+"}