{"id": 597178, "slug": "squeaky-clean", "name": "Squeaky Clean", "name_original": "Squeaky Clean", "description": "It's 2016, a string of murders across the United States has suddenly revived an old urban legend known as the \"Shower Slasher\" a mysterious figured associated with similar murders dating back generations.<br/><br/>Keep your ears open as you try to enjoy your otherwise relaxing shower and try to ignore the sensation you have that days seem to be repeating, that figures are darting around in your peripheral, and that unshakable feeling that you are being watched.<br/><br/>Ignore it.<br/><br/>Respond to your friends texts, let them know that nothing is wrong.<br/>Envelope yourself in Steam and the tunes playing in your head.<br/><br/><br/>Make yourself Squeaky Clean.<br/><br/>Squeaky Clean is a psychological horror game set entirely in the shower. Manage your cleanliness while strange ghost-like beings haunt you. Simple controls and quick but challenging levels ensure that Squeaky Clean can be played and feared by everyone<br/><br/><ul><li>Experience the horror of your average shower!<br/></li><li>Absorb hot shower tunes by Hoovobot<br/></li><li>Watch the fate of five very clean shower-folk<br/></li><li>Endure the challenge of survival!</li></ul><br/>Squeaky Clean is best enjoyed in a dark room with headphones and includes many jump scares, flashing lights, adult language, and occasional intense scenes.", "metacritic": null, "released": "2021-05-01", "tba": false, "updated": "2021-05-03T02:31:39", "background_image": "https://media.rawg.io/media/screenshots/ad9/ad9a81fa67377f246b5fbef91e6c5638.jpg", "website": "https://wrongfire.wixsite.com/carrionwave", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 207, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Carrion Wave"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["Carrion Wave"], "esrb_rating": null}