{"id": 597181, "slug": "magical-otoge-iris-2", "name": "Magical Otoge Iris", "name_original": "Magical Otoge Iris", "description": "Iris works as a Purifier, a person who helps spirits move onto the afterlife. This is a story with comedy, romance, and heart... hopefully. At least, it has a lot of puns and glasses jokes.<br/><br/><strong>✦ Characters ✦</strong><br/><br/>Iris: The heroine. A gentle, awkward, and surprisingly brave girl who tries her best.<br/><br/>Rieffe: Iris' kind but detached childhood friend who always worries about her.<br/><br/>Lanneis: A strict and sarcastic person who glares and pushes up his glasses way too often.<br/><br/>Reqieu: Used to be Iris' teacher. Serious, but gentle and low-key sarcastic.<br/><br/>Septem: A serious, kind, and dutiful boy who likes flowers. He's kind of shy once you talk to him. Always polite.<br/><br/><br/><br/><strong>✦ Warnings: light/moderate blood, themes of death</strong><br/>✦ Standalone game but with references to the other Magical Otoge games (Ciel, Anholly)<br/>✦ Stretch goal bonus routes added for free after purchase milestones (details in the Google Form after purchasing the game)<br/><br/>This game is a <strong>straightforward visual novel, so there's no walkthrough necessary.</strong> It will be very obvious when a choice will affect the ending. After clearing the game once, a guide will appear in the Extras that explains how to get the Good/Bad Ends.<br/><br/>", "metacritic": null, "released": "2021-05-01", "tba": false, "updated": "2021-05-03T02:33:44", "background_image": "https://media.rawg.io/media/screenshots/400/400116baf35b54d50abed36b614033d3.jpg", "website": "https://batensan.carrd.co/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 251, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["batensan"], "genres": ["Simulation"], "publishers": ["batensan"], "esrb_rating": null}