{"id": 597150, "slug": "twilight-wars", "name": "Twilight Wars", "name_original": "Twilight Wars", "description": "<p>Twilight Wars is a dungeon crawler in a cyberpunk setting, where teams of secret agents fight for the interests of corporations. Revive a secret organization, recruit and equip a team of specialists - and neutralize those who stand in your way!</p>\n<p>Features:</p>\n<ul>\n<li>\n<p>Dungeon Crawler in an unusual setting of spy cyberpunk: tactical turn-based battles, dangerous missions and irreversible death of agents in a stylish entangled with spy networks world of high technology.</p>\n</li>\n<li>\n<p>Original art style: immerse yourself in the atmosphere of cozy Russian cyberpunk.</p>\n</li>\n<li>\n<p>The power of the word: the future of the Agency and the entire world depends not only on the decisions made on the battlefield but also on the position that you maintain in interactive dialogues with characters.</p>\n</li>\n<li>\n<p>Squad for any playing style: 8 unique agent specializations, with their advantages and disadvantages, as well as a flexible system of class development and synergy of skills between specialists are available to you. Gather the right squad for you from hundreds of possible combinations of units.</p>\n</li>\n<li>\n<p>Think ahead: the missions are dynamically bound, and the complexity of completing global missions and the number of rewards depend on the decisions you make. Take risky decisions or act carefully, but remember - the cost of a mistake can be high!</p>\n</li>\n<li>\n<p>Each agent is an individual: monitor the level of stress and loyalty, take into account their fears and quirks, as well as the relationships in the squad. This can save you from the mission failure, specialists leaving the Agency, or dying.</p>\n</li>\n<li>\n<p>The Old Guard in the state of the Agency: engage for service 8 legendary agents from the special ops &quot;Mediator&quot; and use their unique abilities.</p>\n</li>\n<li>\n<p>In the era of cyberpunk, energy is as needed as oxygen: provide agents with enough batteries to recharge before the mission; otherwise, weapons and implants will be disabled, some skills will become unavailable, and the сomm for connecting the squad with you will stop working.</p>\n</li>\n</ul>", "metacritic": null, "released": null, "tba": true, "updated": "2021-05-03T12:18:49", "background_image": "https://media.rawg.io/media/screenshots/93a/93a0876bff06426c1f7eb6e5bc81f2ff.jpg", "website": "https://www.comradebear.games/", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 388, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": [], "genres": ["Strategy", "Indie"], "publishers": [], "esrb_rating": "Teen"}