{"id": 597252, "slug": "card-quest-card-combat", "name": "Card Quest: Card Combat", "name_original": "Card Quest: Card Combat", "description": "Card Quest is a dungeon crawling adventure game with unique card combat. Play with a variety of unique character classes, and customize decks to fit your playstyle. Explore the strategic depth of tactical roguelike gameplay, and crush your enemies.<br/><br/><br/><br/>◙ Diverse Classes:<br/><br/><br/>Play as a Rogue, Wizard, Fighter or Hunter. The choice is yours. Each has its own unique gameplay style and 3 custom specializations to add even more variety! Turn your rogue into a Swashbuckler or an Assassin, your wizard into a Pyromancer or Necromancer, your fighter into a Berserker or a Paladin and your Hunter into a Sharpshooter or a Fey Archer!<br/><br/><br/><br/>◙ Powerful Equipment:<br/><br/><br/>Unlock new items by defeating mighty bosses. There are dozens of different pieces of equipment and items for each class to further customize your heroes; granting them new cards and abilities.<br/><br/>◙ Streamlined Progression:<br/>Level up your heroes to increase their stamina and health and gain useful passives and unlock new specializations.<br/><br/><br/><br/>◙ Fantastical Dungeons:<br/><br/><br/>Dungeons to explore. Traverse a city cursed with an undead plague, a dwarven mountain full of dangers and treasure, and an enchanted forest where few come out alive, each with over 12 different areas to explore and lots of items to unlock!<br/><br/><br/><br/>◙ Challenging Enemies:<br/><br/><br/>Fight over 25 different bosses and more than 90 enemies! Many of them with unique skills that require creative strategies to defeat.", "metacritic": null, "released": "2021-04-29", "tba": false, "updated": "2021-05-03T03:17:10", "background_image": "https://media.rawg.io/media/screenshots/eb3/eb3deed0aefb71a3d27e76818bd3cb5b_bUhEm6l.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 219, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Plug In Digital"], "genres": ["RPG", "Strategy"], "publishers": ["Plug In Digital"], "esrb_rating": "Teen"}