{"id": 597244, "slug": "astrokings-space-starships", "name": "ASTROKINGS - Space Starships", "name_original": "ASTROKINGS - Space Starships", "description": "[ASTROKINGS] X [STARGATE] EVENT!<br/>Members of the STARGATE universe await you in the world of ASTROKINGS! Join forces with key STARGATE SG-1 characters such as Teal’C, Samantha Carter, and Daniel Jackson, among many others!<br/>Take control of the powerful Odyssey flagship and defend the galaxy!  <br/>Log-in during the Collaboration period and get S-Grade Hero [Vala Mal Doran]! among other rewards!<br/>Collaboration Period: April 28 (UTC) – May 26 (UTC)<br/><br/>Clash with rivals in powerful cosmic battles, manage futuristic resources and build planetary facilities on countless worlds in a bid to become the absolute galactic imperator in this epic, sci-fi real-time strategy multiplayer saga. Download ASTROKINGS to experience PvP on a universal scale!<br/><br/>Game story collaboration with New York Times bestselling authors Amie Kaufman and Jay Kristoff of the Illuminae Files series, which won numerous awards such as the esteemed Aurealis Award for Best Science Fiction novel in 2015 and 2016!<br/><br/>The Nebula Imperium is no more – the emperor is dead. Untold number of worlds that served as the second cradle of mankind now lie in ruins. The unfathomable alien invaders -the Crux- and vile pirates are razing civilizations to the ground. In midst of the chaos, various factions forge federations to vie for supremacy and dominance. It is time for you to rewrite history and carve your throne in the stars.<br/><br/>FEATURES<br/>≛ Revitalize your planet!<br/>-  Construct and upgrade buildings and rebuild your planet in ruins.<br/>-  Recruit galactic heroes to set planetary policies, harvest resources and lead your fleets to victory and conquest.<br/>-  Vanquish space pirates and galactic criminals to gain spoils of war.<br/><br/>≛ Crush your rivals in all-out space fleet battles!<br/>-  Build frigates, interceptors and motherships to amass powerful fleets to wage war. <br/>-  Research weapons and technologies to strengthen your nation’s power and prestige.<br/>-  Join or lead a galactic federation with players around the world to drive out alien fleets and aspire to become the defender of humanity.<br/> <br/>≛ 4X MMO space war<br/>-  Defeat hordes of enemy forces with your allies in massive PvP clashes.<br/>-  Gain state-of-the-art equipment and arms through your federation and dominate your foes.<br/>-  Battle and conquer enemies to secure precious resources in the mobile strategy game of cosmic scale!<br/><br/>＞ Official Facebook:  www.facebook.com/playastrokings<br/><br/>＞ Official Twitter:  www.twitter.com/playastrokings<br/><br/>＞ Homepage:  www.playastrokings.com", "metacritic": null, "released": "2019-04-04", "tba": false, "updated": "2021-05-03T03:12:45", "background_image": "https://media.rawg.io/media/screenshots/435/435ea3e47f4712082e1b7670a06043a6_ehSQFWV.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 337, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["ANGames"], "genres": ["Strategy"], "publishers": ["ANGames"], "esrb_rating": "Everyone 10+"}