{"id": 597292, "slug": "flamingmillion-comics-x-games-2021", "name": "flaming/million - comics x games 2021", "name_original": "flaming/million - comics x games 2021", "description": "<p>Hello : 3 <br/><br/>My name is nilson, I run a tiny queer game art organization called swampbabes. I'm an archivist, glitch artist, bad poet, ROM hacker, and barista.<br/><br/>During Comics x Games, I'll have this bundle for <em>flaming/million</em> plus TONS of other weird items available for download here. Any $$$$ thrown my way will go right back into creating more weird objects ~ <br/><br/><em>video games have been queer </em>is a 32-page extended zine essay on my relation to queer games and all games. It's currently being presented as part of my MFA thesis at Visual Studies Workshop.<br/><br/>I'm also excited to revive two ancient experimental rpgs, <em>the killers</em>, a short nihilist narrative about JRPGs, and <em>at the foot of a baldaquin</em>, a puzzle game that became GraveCamp, long thought to be lost forever on a dead hard drive on the floor of my ex's pick-up truck (unfortunately PC only due to being made in VX Ace). Circa 2015.</p>\n<p>What's included in this bundle:</p>\n<ul><li>flaming/million (experimental RPG)</li><li>video games have been queer (extended zine - discount price! usually $4.20)</li><li>at the foot of a baldaquin (very esoteric roguelite-inspired rpg)</li><li>the killers (short nihilist horror narrative rpg)</li><li>midnight mass/magic circle (super sad games essay)</li><li>game boy advance (digital copy of sexy riso zine)</li><li>? ? ? ? (mystery folder of random files from pc)</li></ul>\n<p>If you're still reading this, swing by our Queer Games Bundle, too, which goes live in June 2021 &lt; 3<br/><br/>Any questions or incantations, please reach out via nilsonthomascarroll @ gmail.com! I basically do all this so cool people will dm me, lol.</p>\n<p>Thanks for stopping by, s p a c e c o w b o y<br/><br/>nilson<br/>(▰˘◡˘▰)<br/><br/><br/></p>", "metacritic": null, "released": "2021-05-03", "tba": false, "updated": "2021-05-03T03:27:18", "background_image": "https://media.rawg.io/media/screenshots/68a/68adc886d8a6ae81b98c5530da50a146.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 153, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["nilson"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}