{"id": 597242, "slug": "scorch-injector", "name": "Scorch Injector", "name_original": "Scorch Injector", "description": "You’re ANDOUILLE, an Aqueous Neutralizing Delivery Object Utilizing Intense Low Level Energy, launched into the Cajun Science Institute's first accidental patient, its chief scientist. You have one mission: defeat the BLAND. Use your hot sauce to destroy all copies of the BLAND you find before all your boudin tastes like white bread. <br/><br/>Using the iPhone's sensors, the BLAND tracks where you are in space and attempts to hide from your food injector filled with hot sauce. <br/><br/>Limited battery life means your time will run out without a recharge. Watch your onboard clock to see how many seconds you have left. Yes, seconds. We’re trying to defeat the BLAND and each moment counts. Every BLAND eradicated helps put time on the clock and spice back into the taste buds.<br/><br/>But the BLAND creates more and more copies as you advance. You've got eight shots, maximum, but there are more than eight BLANDs out there. Reload when you run out, even if that eats precious time. Also, don't waste your shots: this hot sauce is the nation’s blue-ribbon best.<br/><br/>Do you have the guts for the challenge? You're faster and a sharper shooter, but will you be able to navigate through the body’s digestive tract to the final battle inside the stomach? <br/><br/>The Cajun Science Institute hopes so. Our nation’s good taste depends on you.<br/><br/>Take out your frustration with this innovative medical action game with a food lover’s twist. Scorch Injector is the stress-relieving boredom buster that will spice up your 2021.", "metacritic": null, "released": "2021-02-18", "tba": false, "updated": "2021-05-03T03:11:46", "background_image": "https://media.rawg.io/media/screenshots/3ef/3ef965634243457a29f0e1054ab3f10f_LUsinMZ.jpg", "website": "https://scorchinjector.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 84, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Matthew Larsen"], "genres": ["Action", "Simulation"], "publishers": ["Matthew Larsen"], "esrb_rating": "Everyone 10+"}