{"id": 597201, "slug": "magic-tiles-tiles-hop-2021", "name": "Magic Tiles: Tiles Hop 2021", "name_original": "Magic Tiles: Tiles Hop 2021", "description": "Play the best Piano Tiles: Tiles Hop 2021! black tiles or white tiles amazing.<br/><br/>Have you ever dreamed of becoming a professional pianist? Have you ever dreamed of playing classical songs on a piano?<br/><br/>Now your dream can come true with the Piano Tiles: Tiles Hop 2021. With this piano app even everyone can play classical songs like a real piano master. It’s easy to learn and incredibly fun to play! With Piano Tiles: Tiles Hop 2021s your mobile phone becomes a magic piano, by tapping on the piano tiles, you can play your favorite songs like the best pianists!<br/><br/>HOW TO PLAY:<br/><br/>Piano Tiles: Tiles Hop 2021 is very easy to play. The rule is simple. Tap on the black piano tiles continuously to play the music. Watch out for the white tiles and never miss any black piano tiles to complete every song!<br/><br/>Features:<br/>1. Awesome graphics and sound effect.<br/>2. High quality piano music soundtracks.<br/>3. Simple to play, difficult to master. Tapping only the Piano Tiles: Tiles Hop 2021 in some high speed songs can be a real challenge!<br/>4. Smooth gaming experience. We tried our best to turn your mobile phone into a magic piano with real sound effects.<br/>5. Regular Updates! We are frequently updating Piano Tiles: Tiles Hop 2021 to fix any bugs and come up with new awesome features that every player will love.<br/><br/>Download now and play, while improving your reaction speed and musical skills! Become the best music player!<br/><br/>We will keep updating, adding more songs and gameplay funny!", "metacritic": null, "released": "2021-01-09", "tba": false, "updated": "2021-05-03T02:50:08", "background_image": "https://media.rawg.io/media/screenshots/277/277ab4d4a380c3dcf1ff8eb29049bee9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 45, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Be Nguyen"], "genres": [], "publishers": ["Be Nguyen"], "esrb_rating": "Everyone 10+"}