{"id": 597238, "slug": "summoners-war-lost-centuria", "name": "Summoners War: Lost Centuria", "name_original": "Summoners War: Lost Centuria", "description": "From the creators of the global hit game Summoners War: Sky Arena comes an addicting real-time strategy RPG with all your favorite Summoners War monsters. <br/><br/>Collect and upgrade cards featuring iconic monsters from the Summoners War world to use in battle. Equip your monsters with unique combinations of Runes and Skill Stones. Join an Alliance with friends to share monster cards and earn additional rewards. Craft the perfect strategies and teams to battle your way through an epic adventure. <br/><br/>▶ You Against the World<br/>- Fight with Summoners around the world in real-time battles.<br/>- Breathtaking real-time battles with spectacular skill animations.<br/>- Compete for the top rank against players worldwide.<br/><br/>▶ Experience a Deeper Level of Strategy<br/>- Real-time strategic action with unpredictable counterattack mechanics<br/>- Fast-paced dynamic battles that require a quick mind and a quicker finger.<br/>- Claim victory with surprise counterattacks in epic 8v8 battles.<br/>- Strategize for a variety of PvE and PvP content.<br/><br/>▶ Collect Unique Monsters<br/>- Summon the iconic monsters that captured 100M summoners around the world from the popular RPG, Summoners War: Sky Arena.<br/>- Earn a legendary monster through battle rewards.<br/>- Experience your favorite Summoners War monsters brought to life with reinterpreted styles and graphics.<br/><br/>▶ Create Your Dream Team<br/>- Craft Runes and equip Skill Stones to upgrade your favorite monsters.<br/>- Choose from 12 different Rune sets and 3 types of Skill Stones to find the ultimate combination.<br/><br/>▶ Call in the squad!<br/>- Form an Alliance with players around the world.<br/>- Work together with Alliance members to upgrade your monsters with card sharing.<br/>- Earn and redeem Alliance points for more summons and other amazing rewards.<br/><br/>▶ Let us hear from you!<br/>Visit the official Summoners War: Lost Centuria community channels<br/>Website: https://summonerswar.com/LostCenturia<br/>Facebook: https://www.facebook.com/LostCenturia<br/>YouTube: https://www.youtube.com/SummonersWarLostCenturia<br/><br/>***<br/>Device App Access Permission Notice<br/><br/>▶ Notice per access permission<br/>Access permissions are requested in order for us to provide you with the following service when you use the app.<br/><br/>[Required]<br/>None<br/><br/>[Optional Access Rights]<br/>- Camera: This is the right to request when using the camera in the in-game profile.<br/>- Photos: This is the right to request when uploading photos from your device to the in-game profile.<br/>- Push Notification: This is the right to request when you want to receive push messages for the game.<br/>- ID for Advertisers: This is the right to request the use of ID for Advertisers (IDFA) for promotion targeting and tracking analysis.<br/><br/>※ You'll be able to enjoy the service except features related to above authorities even if you don't give permission to the above.<br/><br/>▶ How to remove access permissions<br/>After allowing the access permission, you can revoke or modify the access permissions as follows:<br/>- Settings &gt; Privacy &gt; Select the corresponding app &gt; Choose either to enable/disable access<br/><br/>Summoners War: Lost Centuria is available in 15 different languages:<br/>English, 한국어, 日本語, 中文简体, 中文繁體, Deutsch, Français, Português, Español, Русский, Bahasa Indonesia, Tiếng Việt, Türkçe, Italiano and ไทย!<br/><br/>Items are available for purchase in this game.<br/><br/>For Com2uS Mobile Game Terms of Service, visit <br/>www.withhive.com.<br/>Terms of Service: http://terms.withhive.com/terms/policy/view/M9/T1<br/>Privacy Policy: http://terms.withhive.com/terms/policy/view/M9/T3<br/>For questions or customer support, please contact our Customer Support by visiting http://customer-m.withhive.com/ask", "metacritic": null, "released": "2021-04-27", "tba": false, "updated": "2021-05-03T03:09:42", "background_image": "https://media.rawg.io/media/screenshots/705/705f37f7895aae6920263ef5d7e51f20.jpeg", "website": "http://www.withhive.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 56, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Com2uS"], "genres": ["Action", "Strategy"], "publishers": ["Com2uS"], "esrb_rating": "Teen"}