{"id": 59731, "slug": "worbital", "name": "Worbital", "name_original": "Worbital", "description": "<p>NOTE: See the community announcements to find out more about Worbital beta.<br />\nArtillery, Gravity… Chaos!<br />\nWorbital is space war in real-time with tension-filled gameplay and gravitational destruction. Each player commandeers a planet, building support structures and increasingly powerful weapons. Use your weaponry to destroy enemy planets and wreak total havoc to the solar system. The goal: be the last civilization standing!<br />\nInterplanetary Artillery Warfare — Engage in real-time planet-to-planet cannonade in a shifting solar system, with the gravity as your ally… or enemy.<br />\nPreparation, Building, Tactics — Plan your loadout, build and upgrade weapons ranging from simple railguns to planet-derailing World Rammers.<br />\nPlanetary Destruction — Aim and fire your artillery through space to chip away at enemies’ planet surface, reveal their core and blow it up.<br />\nHype-Filled Obliteration — Wage orbital war against AI or challenge your friends in Online and Local Multiplayer (controller required for Local).<br />\nCosmic Chaos — Survive as chunks of exploding planets, asteroids and other celestial objects threaten your planet, with explosive chain reactions eventually destroying the sun itself!</p>", "metacritic": null, "released": "2019-01-31", "tba": false, "updated": "2019-11-19T19:20:28", "background_image": "https://media.rawg.io/media/screenshots/2a4/2a4d97f769fc807d8aff0b44efdc6090.jpg", "website": "https://www.worbital.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 16, "dropped": 1}, "playtime": 2, "achievements_count": 36, "ratings_count": 4, "suggestions_count": 168, "game_series_count": 0, "reviews_count": 4, "platforms": ["PlayStation 4", "Xbox One", "Nintendo Switch", "PC"], "developers": ["Team Jolly Roger"], "genres": ["Action", "Strategy", "Indie"], "publishers": ["Team Jolly Roger", "Advanced Interactive Gaming", "TJR Games"], "esrb_rating": "Everyone 10+"}