{"id": 59733, "slug": "revelation-online", "name": "Revelation Online", "name_original": "Revelation Online", "description": "Revelation Online is a breathtaking Massive Multiplayer Online Role Playing Game set in the lively, fantasy world of Nuanor. Discover amazing adventures and explore a vibrant world of ancient mystery using the power of character flight without boundaries.<br/><br/>Unravel a legendary myth, told throughout solo adventures, gripping group expeditions, a great variety of dungeons, and raids. See the story unfold in exciting cut-scenes or fly to fabled places where you will always find something new to undertake and new friends to do it with.<br/><br/>Band together as you soar through the skies or battle each other in Revelation Online’s competitive play modes. The dynamic combat system delivers a fun PvP combat experience for casual and hardcore players alike. Exciting challenges range from smaller scale arena duels to epic scale territory sieges and cross server warfare. Join intense battles with hundreds of players simultaneously, PvP is boundless in Revelation Online.<br/><br/>Please note, Revelation Online is still in Open-Beta and has not officially been released.<br/><br/><br/><br/>Explore a vibrant world of ancient mystery. Experience absolute freedom of exploration with the power of flight and admire stunning views - cliffs, forests, mountains, and cities.<br/><br/><br/>Spread your wings or master one of the many aerial mounts to soar through the skies of Nuanor. Dive into the waters or climb to the top of the world – in Revelation Online you can reach any place freely.<br/><br/><br/><br/>Unravel the legend of a mysterious artefact unfolding in exciting cut-scenes throughout solo adventures, fascinating group quests and a great variety of dungeons. Immerse yourself in a thrilling adventure, full of excitement and betrayal<br/><br/><br/>Fly to fabled places where you will always find new friends to storm a myriad of dungeons located in caves, blighted deserts and realms of eternal shadow. Gather your group of 5, 10 or 20 to overcome obstacles and defeat the bosses within to be awarded glory and unique outfits.<br/><br/>Even at maximum level, the game has just begun! Hone your tactical skills and gain epic equipment by gathering your allies and taking on towering bosses in multiphase raids with up to 20 players. Prevailing in these challenges will prove your mettle and rank you amongst Nuanor's greatest heroes!<br/><br/><br/><br/>The fight for a guild territory in Nuanor can turn into a massive scale conflict. Literally, hundreds of players can take defensive positions on the ramparts or attack forts and bastions shoulder to shoulder with their friends. Fight for the glory and prestige of your guild and wave your banner on your conquered territory.<br/><br/><br/>Once you reach the right level and are willing to take the chance, you can participate in open world PvP. Kill offenders, avenge fallen friends or defend a rare spawn together with your allies. Declare personal wars on your own, but be wary of the penalizing system. This is a system of high risks and high rewards.<br/><br/><br/><br/>Test your battle prowess in more than 6 different PvP maps: from \"classic\" battlegrounds and \"capture the flag\" to a massive cross-server battle and special PvPvE zones with unique gameplay.<br/><br/><br/>This is your chance to discover new and exciting opportunities in Revelation Online. Together with players who share a common goal, you can achieve unprecedented heights! Fight shoulder to shoulder with your fellow comrades! Work together and build your guild a home, where you can relax after adventuring.<br/><br/><br/>Make your character look the way you want with a multitude of hair and appearance choices! Along with accessories and masks, create a style that suits you and set trends that others will follow!<br/><br/><br/>From finding your soulmate to getting embroiled in turf wars, you'll have plenty of occasions to display your intentions, both good and bad. Jump from having a ceremony with your pact mate to provoking battles against your enemies.<br/><br/><br/><br/>Revelation Online has a unique system of player housing where players (upon reaching level 40) can gain access to their own free apartment, which they can then upgrade and stylize to their liking with a wide range of furniture and accessories. They can invite friends over and even share living space with their pact mate!", "metacritic": null, "released": "2018-08-07", "tba": false, "updated": "2023-04-05T16:15:19", "background_image": "https://media.rawg.io/media/screenshots/df8/df85dcd65d28b5c8a9073eedf1194d82.jpg", "website": "https://ro.my.com/en", "rating": 2.14, "rating_top": 1, "added_by_status": {"yet": 4, "owned": 188, "beaten": 6, "toplay": 1, "dropped": 12}, "playtime": 2, "achievements_count": 0, "ratings_count": 21, "suggestions_count": 569, "game_series_count": 0, "reviews_count": 21, "platforms": ["PC"], "developers": ["NetEase Games"], "genres": ["RPG", "Massively Multiplayer"], "publishers": ["My.Com"], "esrb_rating": null}