{"id": 5974, "slug": "eggggg-the-platform-puker", "name": "Eggggg - The Platform Puker", "name_original": "Eggggg - The Platform Puker", "description": "Eggggg is a ridiculous two-button platform game about vomit. It's an action packed and crazy experience. Gilbert has an extreme allergy to eggs. Eating them will literally make him vomit like a fountain. He escapes from his mean aunt Doris in order to get to a birthday party, and needs to use his vomiting superpower to survive a world of angry cyborg chickens... of course.<br/>\n<br/>\r\nIf you're looking for just another normal platfomer, this is not it. But if you're looking for a really fun and quirky experience, and enjoy a good challenge - keep reading.<br/>\n<br/>\r\nA few months back we released this ridiculous game for mobile and Apple TV. Although we released it on mobile first, the team always played using keyboard in development - and that is what feels most natural to us. Playing using actual buttons really makes the game an even better experience.<br/>\n<br/>\r\nThe controls are simple to understand but hard to master, you only use two buttons. Left/Right on keyboard and triggers or bumpers on game controllers. The first time you press in a direction, the character will run in that direction. The second time you press in the same direction he will jump. Sounds strange? It is, but once you get the hang of it it offers really great and accurate control.<br/>\n<br/>\r\nThe game realse date is TBA, but we'll get it out as soon as we can!<br/>\n<br/>\r\nThanks,<br/>\r\nHyper Games", "metacritic": null, "released": "2016-10-19", "tba": false, "updated": "2019-08-28T22:15:10", "background_image": "https://media.rawg.io/media/screenshots/92c/92c533d63ac4a08bc79f5321b87397a4.jpeg", "website": "http://eggg.gg", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 2, "toplay": 2, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 150, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android", "Nintendo Switch", "Linux", "macOS", "PC", "iOS"], "developers": ["Hyper Games"], "genres": ["Action", "Arcade", "Casual", "Indie"], "publishers": ["Hyper Games", "Hyper Games AS"], "esrb_rating": null}