{"id": 59749, "slug": "order-of-the-assassin", "name": "Order of the Assassin", "name_original": "Order of the Assassin", "description": "<strong>Order of the Assassin</strong> is an online free-for-all player vs. player game, in which you will play as various races that make up \"The Order.\"  In the single player campaign it will be up to you to decide the difference between right and wrong, thus affecting the environment around you.   Your choices in the story-line will have the potential to save Avalon, your home world, or set it ablaze by Sevaroth's evil hand.  If you tire of questing, go online with your friends.  Play as your favorite assassin in a very unique score-based player vs. player game mode where you and up to eleven other friends will each hunt for assassin targets and each other.  The twist is, you can't let the guards catch you in an assassination, or they will be after you as well!<br/><br/>Note:The game-play in the Kickstarter trailer is NOT finished game-play.  I have not yet added hit reactions to characters.  Expect blood splatter and on-hit animations in the finished product!<br/><br/>Features in development:<br/>12 Stage campaign with interactive questing system!<br/>Online Custom Games<br/>15+ Playable Assassin Characters each with 3 of their own specialized talent trees.  One utility based tree, attack based tree and defense based tree per assassin.  Choose your own play-style!<br/>Additional Skins for Each Character<br/>Achievements", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:59:17", "background_image": "https://media.rawg.io/media/screenshots/640/640d04fe0ca012445eec0b7ed8bf3834.jpg", "website": "http://www.orderoftheassassin.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 384, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jeffrey O'Neal"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Jeffrey O'Neal"], "esrb_rating": null}