{"id": 59763, "slug": "neon-knight-vengeance-from-the-grave", "name": "Neon Knight: Vengeance From The Grave", "name_original": "Neon Knight: Vengeance From The Grave", "description": "<strong>Welcome to the dark world of the Neon Knight:</strong><br/><br/>Neon Knight is a 2D action side-scroller developed for Windows PC. It is the epic tale of supernatural resurrected warrior who travels dystopian kingdom with the aim to end the current reign of terror, and find his family. It partly draws inspiration from the classic 2D games from the past, but also adding modern gameplay elements and compelling story.<br/><br/><br/><br/><strong>Gameplay:</strong><br/><br/>Basically, this game is a platformer with a strong focus on fast-paced action and atmosphere. The main character has the skills of fast and fluid movement, but also a number of combat abilities that players will have to use to overcome a variety of enemies and obstacles.<br/><br/>When it comes to the fight, Neon Knight has two types of weapons. The first is the SPAS-12 shotgun, strong and deadly, for a fight at a distance, and the other is a neon sword, which is the standard weapon of the protectors of the realm, intended primarily for close combat, but also can have a number of other purposes. Both weapons have their advantages, disadvantages, limitations and a different effect depending on the type of enemies that player encounter.<br/><br/>Beside standard methods of fighting, in the game will be present numerous magics. Players will be able to master them by advancing the levels. Each of them is unique in its own way, stronger or weaker, for defense or attack. At any time, the player will be able to be equipped with one of them, but will also be able to change them during the game, depending on which is more needed.<br/><br/><br/><br/><strong>Story:</strong><br/><br/>This game will gradually discover its dark secrets and a story full of reversals about ancient resurrected warrior, once powerful protector of the luxurious kingdom, who is now trying to adapt to the new world that is falling apart. From the moment he crawled out from his grave, Neon Knight is aware that he is in a dark and apocalyptic environment. What has led to this state of the world in which the game is located, and how will Neon Knight handle it, it will be discovered, more by \"showing\" rather than by narrative sequences. However, players will be able to find documents, diaries, letters and the like, which could provide a number of important details and help them to understand the world of the Neon Knight.<br/><br/>During the story, the main campaign will present a number of different locations and characters. The characters are impressive and ranges from medieval knights and wizards to modern zombie-soldiers equipped with the latest technology. Most of them are determined to stop the Neon Knight on his way to overthrow the new evil ruler, in which he sees the culprit and the cause of the tragedy of the whole kingdom.<br/><br/><br/><br/><strong>The graphics and style:</strong><br/><br/>Looking at the graphics, this is strictly a 2D game with monochrome graphic style, which is not so often present in games of this type. It adds intensity to the atmosphere of this dark world that is full of details that contribute to the overall impression. Every shot, explosion or strike has its effect on the environment that is interactive and dynamic. Everything happens in real time.<br/><br/>The characters you encounter, friends or enemies, have been designed in detail and are easily identifiable in the game, just as the locations which you will visit. Although the game is monochrome, really just in the foreground, the backgrounds are colorful and different and you will always be able to distinguish the levels based on them, or topics represented in them. Theme varies depending on the part of the game. It is always specific and introduces new elements, but in essence captures the atmosphere of dystopian, ravaged world.<br/><br/><br/><br/><strong>The content:</strong><br/><br/>In Neon Knight emphasis will be on the main campaign as the core of the game, which, although significantly shorter, will be full of content, with great number of accessories, hidden levels and characters that can be unlocked, which will encourage players to replay the game.<br/><br/>In addition to the main campaign of the game, it is planned to be present \"Versus\" and \"Survive\" mode.<br/><br/>Versus will allow two player competition in the arenas specially designed for this showdown. In it, players will be able to choose some of the characters that are encountered during the main campaign, and which have their own unique weapons and abilities.<br/><br/>In Survive mode the player will face waves of enemies while trying to survive as long as possible and achieve a better result. Naturally, with better results and higher number of survived waves, comes stronger enemies, but also additional magic and rewards for the achieved level.", "metacritic": null, "released": "2018-12-02", "tba": false, "updated": "2020-03-19T14:18:45", "background_image": "https://media.rawg.io/media/screenshots/86b/86b81f501c9c188407672c214a96f783.jpg", "website": "http://www.indiedb.com/games/neon-knigh", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 230, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Marko Vukovic", "Marko Vuković"], "genres": ["Action", "Shooter", "Adventure", "Indie"], "publishers": ["MakaB"], "esrb_rating": null}