{"id": 59762, "slug": "deluded-mind", "name": "Deluded Mind", "name_original": "Deluded Mind", "description": "Storyline<br/>In Deluded Mind, you take on the role of Dean Catrall, an FBI agent whose daughter was murdered by a criminal organization looking for revenge. In spite of the tragic loss, you continue to work as an FBI agent and will be incapacitated and kidnapped during an operation.<br/><br/>You wake up at the psychiatric institution \"Hillstone Asylum\" and find that you have been given a potent hallucinogen. Your kidnapper's note tells you that your FBI partner Robert Page is also inside the institution.<br/><br/>As you cross the corridors of Hillstone Asylum, you notice that there's something wrong with you: The hallucinogen shows its effects and literally puts you in hell on earth.<br/><br/>How can you tell reality from illusion?Features<br/><ul><li> Extreme horror: Due to a hallucinogen, you literally experience hell on earth. Feel reality and fantasy merge into an unforgettable experience.<br/></li><li> Stunning graphics: High-quality graphics offer you an incredibly detailed yet terrifying environment.<br/></li><li> Overwhelming story: Uncover your past and confront things beyond our imagination.<br/></li><li> World-class sound effects: Every sound will freeze the blood in your veins.<br/></li><li> Ruthless punishments: The longer you need to solve a puzzle or solve it incorrectly, the harder the hallucinogen will punish you.<br/></li><li> Random generator: Randomly generated events provide a diversified gaming experience.</li></ul>", "metacritic": null, "released": "2018-06-15", "tba": false, "updated": "2019-08-28T21:59:17", "background_image": "https://media.rawg.io/media/screenshots/6b7/6b77ad35173644016818e44a225b816f.jpg", "website": "https://www.deludedmindgame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 11, "beaten": 1, "toplay": 1}, "playtime": 5, "achievements_count": 8, "ratings_count": 0, "suggestions_count": 210, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Pyxton Studios"], "genres": ["Adventure", "Indie"], "publishers": ["Pyxton Studios"], "esrb_rating": null}