{"id": 5978, "slug": "human-resource-machine", "name": "Human Resource Machine", "name_original": "Human Resource Machine", "description": "<p>Human Resource Machine is an educational game in which the player assumes the role of a program algorithm. The gameplay is a metaphorical representation of a visual programming language. The protagonist represents the processor register, and the player&#39;s instructions to the character stand in for the opcodes.</p>\n<h3>Premise</h3>\n<p>The main character is an office clerk who works in a storage department. His career lasts 40 years, each of them corresponding to an in-game puzzle. Two conveyor belts in the protagonist&#39;s office work as the input and the output devices, respectively. The input conveyor brings in the numbers and letters in the form of boxes. The protagonist is instructed to perform certain tasks and calculations with the boxes before sending them back through the output conveyor. The tasks usually require simple mathematical actions such as sorting and addition. The boxes remain stored on the office floor until the task is completed.</p>\n<h3>Gameplay</h3>\n<p>The player controls the character using commands that remind the assembly language. The handwritten notes represent the instructions the player gives to the character. As the player progresses through the puzzles, the game introduces more complicated concepts and mechanics, such as memory addresses. This feature allows the player to order the character to perform operations in the certain place of the office. The goal of each level is to create a program. The game will test the results and inform the player if it works or not (through a supervisor character).</p>", "metacritic": 78, "released": "2015-10-14", "tba": false, "updated": "2024-03-20T22:08:13", "background_image": "https://media.rawg.io/media/screenshots/8ab/8abf17ba4f55182f37b2eb2866fae35d.jpg", "website": "http://tomorrowcorporation.com/humanresourcemachine", "rating": 4.01, "rating_top": 4, "added_by_status": {"yet": 117, "owned": 1218, "beaten": 66, "toplay": 27, "dropped": 94, "playing": 26}, "playtime": 3, "achievements_count": 16, "ratings_count": 197, "suggestions_count": 168, "game_series_count": 0, "reviews_count": 197, "platforms": ["Android", "Wii U", "Linux", "macOS", "PC", "iOS", "PS Vita", "Nintendo Switch"], "developers": ["Tomorrow", "Experimental Gameplay Group"], "genres": ["Simulation", "Casual", "Educational", "Indie", "Puzzle"], "publishers": ["Tomorrow", "Experimental Gameplay Group"], "esrb_rating": "Everyone 10+"}