{"id": 59780, "slug": "kaleido-chaos", "name": "Kaleido Chaos", "name_original": "Kaleido Chaos", "description": "Have you played a game about \"move the red block avoiding crashing with the blue ones\", which flourished in the years around 2010? It was said that the game was one of the training programs for the pilots from some countries air forces. <strong>Kaleido Chaos</strong> is a little similar to that game but more flexible and playable.It is a game of reaction and attention, it can help people improve their concentration, reflexes and reaction time. In the game, player controls the Kaleido Cube to hit the right balls to get score and dodge the wrong balls to prevent losing score. To get high score, you need to be patient, calm, undistracted and with short reaction time --it is really a tough training rather than an easy game! <br/><br/><strong>If you can reach more than 600 score in 7 Colors Mode of INIFINITE, you must be a genius!</strong><br/>(Click the INFINITE button on the main UI and then select \"7 Colors Mode\", you can play that \"7 Colors Mode of INIFINITE\" tough game mode.)<br/><br/><strong>NOTE: </strong><br/><ul><li><strong>You might be a little bit  hard to get how to play this game, please download the manual right here to get more details and it is really helpful!</strong></li></ul><ul><li><strong>Global Ranks and Leaderboard are only available for the GAME MODE of INFINITE and FUNNYLUCK, not for the CHALLENGE! So, if you want to review your records and global ranks, please play the game mode of FUNNYLUCK and INFINITE!</strong><br/></li></ul><ul><li><strong>1 Color Mode can help people get the rules of Kaleid Chaos, but it can't shows the  real fun of this game. Please have a try of the game modes of multiple-Colors(Such as 3 Colors Mode , 5 Colors Mode and 7 Colors Mode)  under FUNNYLUCK and INFINITE, it will show you the real fun of Kaleido Chaos!</strong></li></ul><br/><strong>Game's Details</strong><br/><ul><li>Kaleido Cube and Kaleido Balls move faster and faster with play time. So, the game difficulty also grows with play time!</li></ul><ul><li>The right balls are the balls with positive <strong>ColorValue</strong> when Kaleido Cube is at the state of \"+\". Otherwise, negative!</li></ul><ul><li>ColorValues shown in the right side of game scene change when the Countdown in the lower-left corner reaches zero.</li></ul><ul><li>Magic items could emerge in the game scene of FUNNYLUCK mode.</li></ul><br/><strong>Operation Guide</strong><br/><ul><li>Press keys WASD or ↑↓←→ to change the moving direction of Kaleido Cube.</li></ul><ul><li>Press left Ctrl or left mouse to switch the state of Kaleido Cube between \"+\" and \"-\".</li></ul><br/><strong>Key Features</strong><br/><ul><li>Two main game modes: INFINITE and FUNNYLUCK</li></ul><ul><li>Four sub-modes: 1 Color Mode, 3 Colors Mode, 5 Colors Mode and 7 Colors Mode(The game difficulty grows with more colors available)</li></ul><ul><li>Challenge with 9 levels</li></ul><ul><li>Records review, globle ranks and leaderboards are also available for the game mode of INFINITE and FUNNYLUCK</li></ul>", "metacritic": null, "released": "2018-08-28", "tba": false, "updated": "2019-08-28T21:59:16", "background_image": "https://media.rawg.io/media/screenshots/856/856aee360cb21a311bd6b7b3db1eb3a2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 29, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Weiqiang Ou"], "genres": ["Sports", "Racing", "Casual", "Indie"], "publishers": ["Weiqiang Ou"], "esrb_rating": null}