{"id": 597916, "slug": "the-worry-hotel", "name": "The Worry Hotel", "name_original": "The Worry Hotel", "description": "<p>You are the new owner of \"The Worry Hotel\" - a ramshackle, run-down hotel where you manage small monsters in different rooms which change the mental values of the monsters in a positive or negative way. You want to renovate the hotel and return it to its former glory! </p>\n\n<p>This is a mobile game. The setting is a timeless hotel with many run-down rooms. You are guided through the tutorial by the hotel's receptionist which, according to her mood, seems to have been sitting here for an eternity between the hotel's ramshackle walls. The player takes care of the mental values of their monstrous guests, to kick them out of the hotel after a few days as mentally stable as possible. To do this, they have to move the monsters into different rooms at the right time, and have them switch rooms when it becomes prudent to do so. The more mental values of the respective guest are ideally balanced, the more MonCoins (used for renovating the hotel) the player receives. The goal of the game is to collect as many MonCoins as necessary to restore the hotel to its former glory!<br/></p><p>Andreas Fernau - Programming </p><p>Yasmin Juncker - Programming </p><p>Vanessa Hoff - Programming &amp; UI Design </p><p>Alena Braune - 2D Art &amp; Animation </p><p>Katja Bliß - 2D Art, Animation &amp; Writing </p><p>Inka McAtee - 2D Art, Animation &amp; Producing </p><p>Philipp Grzemba - Music &amp; Sound Desig</p><br/>", "metacritic": null, "released": "2021-05-02", "tba": false, "updated": "2021-05-03T05:51:43", "background_image": "https://media.rawg.io/media/screenshots/6e0/6e0dcdf6750fd4753eaea944990bd1d0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 88, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Android"], "developers": ["Inka_McAtee"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}