{"id": 598149, "slug": "just-like-grandma-used-to-make", "name": "Just Like Grandma Used To Make...", "name_original": "Just Like Grandma Used To Make...", "description": "<p><em>Just Like Grandma Used To Make...</em> is a haunted cooking sim where you assemble a recipe step by step with ghostly assistance. In this multiplayer, asymmetric, alt ctrl VR game, players work together to assemble a recipe, with one player able to move objects, and the other players only able to move the VR player's arms. The game has two interfaces: one player, in the VR headset, can interact with a kitchen, while other players, outside the headset, can see a computer monitor with a third person view of the VR player.  In addition, the players outside of the headset can see an interface on their monitor that has a step by step recipe to assemble. The crux of <em>Just Like Grandma Used To Make... </em>is that the non-VR players are the ghost of granny, the only one who knows how to make the recipe. Since ghosts cant talk, the non VR players must guide the VR player to bake the required dish without talking. Instead, these players must physically move the chefs arms to guide them into the proper steps and gestures required by the recipe.<br/></p>\n\n<p>To Play Just Like Grandma Used To Make, You Need:</p>\n<ul><li>15' x 15' space (for optimal play)</li><li>One VR Ready Computer with SteamVR and compatible headset</li><li>External Monitor perpendicular to VR player</li><li>Chef's Apron and Chef's Hat [required]</li><li>Granny wigs [optional]</li><li>2 short poles or sticks, along with a way to attach them to one's arms <ul><li>If you don't wish to play by grabbing your VR player's arms, try this!</li></ul></li></ul>\n\n<p>Huge Thanks To:</p>\n<ul><li>VR With Andrew on YouTube for the VR ready tutorials on a liquid pour effect!</li><li>Kevin Macleod for the game's song, Bushwick Tarantella</li><li>Patricia, for listening to me talk about this game for hours on end and playing it with me :)</li><li>@dbybr, @bignastytruck, @alt254, @spookybotGG, @scifig0th, and @Erica_Aelia_x1 for feedback, encouragement, and answering questions! </li></ul>\n<p>NOTE: <br/><br/>This game is in its early stages and may have some compatibility issues or bugs. Feel free to contact me at jwhopkins.dev@gmail.com with issues!</p>", "metacritic": null, "released": "2021-05-01", "tba": false, "updated": "2021-05-03T06:44:43", "background_image": "https://media.rawg.io/media/screenshots/676/676444c842291191efdb56e924d745df.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 87, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["jwhop"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}