{"id": 59823, "slug": "exiled-kingdoms", "name": "Exiled Kingdoms", "name_original": "Exiled Kingdoms", "description": "<p>Exiled Kingdoms is a single-player Action-RPG that allows you to roam freely through a unique world, full with surprises and adventure. It is an isometric game, inspired by the classics in many ways: a challenging environment to explore, choices with consequences, and a simple but versatile rulesystem enabling endless ways to develop your character. Each of your character stats will make a difference, and the world is highly reactive; new conversation options might be enabled with high intelligence, or vary depending of your standing with the many factions or your previous actions.<br />\nExplore a vast world: no one will point you to the best hidden secrets in the 135 areas. Talk to over 300 NPCs with unique dialogues, and solve 90 quests ranging from the &quot;stereotypical&quot; menial tasks in early levels, to epic-scale plots full with twists and hard choices. Customize your character with 70 skills and hundreds of different items. Overcome all kind of monsters and antagonists, choosing carefully the weapons or powers for each encounter if you want to have a chance. And return to the classical dungeon crawl, with traps and secret doors, and death awaiting the unwary adventurer behind every corner.<br />\nExiled Kingdoms is a huge game, with content hand-crafted during 4 years of development and writing.  It easily counts 120+ hours of gameplay for the average player, and much more taking into account replayability.Story introduction: A dark tale, and a brave new world<br />\nA century ago, the Andorian Empire was destroyed by a magical cataclysm that brought The Horrors into our world; humanity was nearly annihilated. Many thousand managed to escape sailing away to the Imperial Colony of Varannar: a savage island, dangerous and unexplored. Mistrust and blame made impossible to elect a new Emperor, and the four Exiled Kingdoms were proclaimed.<br />\nNowadays, the ragtag kingdoms still struggle to survive in a harsh land, often waging war on each other and slowly declining into barbarism. Empire and the Horrors are, for many, just old legends and fairytales. But as a novice adventurer you rarely pay attention to such old stories; you&#39;re more concerned with your latest misfortunes and chronically empty purse.<br />\nBut for once, luck seems to be on your side. A magical letter from New Garand materialized in your hands; it states that you are the sole beneficiary of a big inheritance. You don’t remember any relatives in the capital of the Kingdom of Varsilia, but certainly that won’t stop you from an opportunity like this! The road to New Garand will reveal many surprises, and will teach you that fairytales and legends can become, in fact, very real.<br />\nNote about assets: part of the art used in the game, trailer and screenshots is shared under different open licenses. You can check a full list at the Exiled Kingdoms website which includes all the details about license and the original authors.</p>", "metacritic": null, "released": "2018-02-22", "tba": false, "updated": "2023-02-21T00:38:21", "background_image": "https://media.rawg.io/media/screenshots/8e3/8e31fa96861bbfe2540ef9844917bef4.jpg", "website": "http://www.exiledkingdoms.com", "rating": 4.09, "rating_top": 4, "added_by_status": {"yet": 2, "owned": 49, "beaten": 4, "toplay": 3, "dropped": 3}, "playtime": 2, "achievements_count": 67, "ratings_count": 11, "suggestions_count": 418, "game_series_count": 0, "reviews_count": 11, "platforms": ["Linux", "macOS", "PC", "Android", "iOS"], "developers": ["4 Dimension Games"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["4 Dimension Games"], "esrb_rating": null}