{"id": 59822, "slug": "hipster-attack", "name": "Hipster Attack", "name_original": "Hipster Attack", "description": "<strong>Hipster Attack</strong> is a classic tower defense game with lots of humor and cartoonish graphics in which players defend the local coffee shop from massive hipster invasion with the help of corporate workers.Key Features:<br/><strong><ul><li>Unconventional Weapons and Abilities</li></ul></strong>Use your HR reps to chuck job applications, resumes and wads of paper at the hipsters! Power up Coffee Makers to shoot coffee balls at incoming enemies, cast the Statue of Hipsterity to freeze hipsters in place, or set an Urban Trap filled with stylish sunglasses and hot espresso as bait.<br/><br/><br/><br/><strong><ul><li>Hipsters of all Shapes and Sizes</li></ul></strong>The game abounds with hilarious hipsters that come in all shapes and sizes, and there’s no end to their absurd behavior! From the Trendsetter, Hisperazzo to the Music Master and... the horrific being known only as Flying Tofu! The game abounds with a variety of hilarious hipsters to destroy.<br/><br/><br/><br/><strong><ul><li>Variety of Characters</li></ul></strong>Send Logistics Manager’s trained pigeons to fend off waves of know-it-all Music Masters and wool-loving Pullovereds, knock the gibberish out of Heavy Blogger’s head with the Cleaning Lady’s fearsome mop, and utilize the snoozing Guard to wipe the smile off Ironic Pro Skater’s face! Hungry for more nonsense? Check out the in-game encyclopedia!<br/><br/><br/><br/><strong><ul><li>Coffee &amp; Cash</li></ul></strong>In-game economy is based off of two types of resources: coffee and money. Coffee provides energy and cash is motivation for workers - what more do you need?<br/><br/>", "metacritic": null, "released": "2018-08-23", "tba": false, "updated": "2019-10-22T14:20:08", "background_image": "https://media.rawg.io/media/screenshots/383/383f5e880694be2b6a0cde13d7c287fa.jpg", "website": "https://www.hipsterattack.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 128, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "PC"], "developers": ["Televisor"], "genres": ["Strategy", "Casual", "Indie"], "publishers": ["Televisor", "Enzyme"], "esrb_rating": "Teen"}