{"id": 59864, "slug": "eonia", "name": "EONIA", "name_original": "EONIA", "description": "EONIA is a charming open-world Adventure RPG, with a colorful and intriguing world, filled with many mysteries to unravel. Draw maps, document the flora and fauna, make potions, repair structures, manipulate minerals and explore every corner while you delve into a fascinating and surprising plot. You will be constantly attracted by the searches and secrets that will challenge you at every step.<br/>\r\nYou have a magical pet named Flino that will accompany you in your great adventure. It will help you distract npcs, grab unreachable objects, activate unreachable levers and buttons and show you the way if you cannot find it. Among other things. You can do some comforting petting, too. It is always nice to be gratefull to such a faithful friend.<br/>\r\nThe game will have +300 NPCs. Yes, +300 NPCs! Living in towns, cities and, who knows where! A whole world full of life!<br/>\r\nThus we will meet with the dear Master Enodio, with Lanius, the faithful friend of Albius, with the eight Master Explorers, with the unique and perfect Artist, Writer and Inventor Mivos Esterus, with the alchemist, the botanist, the zoologist, the blacksmith, the carpenter, the musicians, the poets, the sculptors, the jeweler, the farmer, the postmen, and many others who carried out dozens of activities. Also, there are those that will be essential to the story and those who will only tell us the tales, legends and stories, or simply give us a greeting. But that will not prevent them from being intriguing or interesting.<br/>\r\nThere will be dozens of merchants with whom we can buy, sell and even exchange the most varied items! Without forgetting the mysterious Nomads! That will travel the roads from site to site. And of course, the ... well, I do not want to spoil the surprise.<br/>\r\nYou will run into countless books and scrolls that will help you learn new skills and unveil the rich history that surrounds it all. There are hundreds of objects and weapons to find and use, and a huge variety of skills:<br/>\n<br/>\r\n• Crafting tools and items.<br/>\r\n• Construction and repair of structures.<br/>\r\n• Brewing potions.<br/>\r\n• Use of rings and amulets with magical powers.<br/>\r\n• Search and manipulate dozens of different minerals.<br/>\r\n• Search and manipulate hundreds of animals and plants ingredients.<br/>\r\n• Mapping the vast territory and drawing hundreds of animals, creatures and beasts.<br/>\r\n• Blacksmithing and repairing tools and weapons.<br/>\r\n• Lock picking.<br/>\r\n• Fishing.<br/>\r\n• Stealth and Subtlety.<br/>\r\n• Travel through Magical Portals.<br/>\r\n• Sailing and Navigating in different types of boats.<br/>\r\n• Combat with swords, shields, and spears.<br/>\r\n• And much more...<br/>\n<br/>\r\nEONIA is a game to be enjoyed alone. It is an adventure and rpg game in an open world. A vast and colorful place where you must explore each nook and cranny to understand it and know its mysteries. Their stories and their legends. There are hundreds of objects to gather. From jars to plants, going through all kinds of minerals and ingredients of animals, creatures and beasts, a variety of tools and weapons such as swords and various types of spears and shields with which to protect yourself from the danger that always appears when you least expect it. Without forgetting those magical and fantastic objects with which we will meet and that also will intrigue us.<br/>\r\nWe can move by water with the help of different types of rowboats and sails. Which can be improved with sails and different types of oars, witch will not only help us navigate faster through the waters, but also to escape the dangers that the depths contain. By land we can travel long distances in seconds thanks to the Magic Portals  that apparently the disappeared Strange Civilization built millennia ago. We can make potions of all kinds and power. Also manipulate minerals to transform them and that could be useful in any adventure or work. And repair tools, weapons and build structures of all kinds and complexity. The chests and their mysteries will not be a chore if you have a lockpick.<br/>\r\nA Skill Tree will show us everything we already know and how much we still lack. Let's not forget that Albius is a fifteen-year-old boy and a simple apprentice. A complete Inventory will let us keep track of the objects we have and know their characteristics and uses. A Quest Journal will allow us to understand what remains to be done and what adventure to continue.<br/>\r\nLife surrounds each stone and we will have to understand it and know it through books to see what advantage we can obtain from them. And maybe in other times we will only have to fight it without mercy.<br/>\r\nBooks are an inexhaustible source of knowledge in the world of EONIA and there are dozens of them. They will tell us the forgotten story. They will tell us about the present and, why not, they will show us a glimpse of the future. And just like that, and maybe with a little luck, we can solve the mysteries of EONIA. And let's not forget what Master Enodio always says, \"He who seeks shall find his reward.\"", "metacritic": null, "released": "2018-05-24", "tba": false, "updated": "2023-02-07T02:13:42", "background_image": "https://media.rawg.io/media/screenshots/48b/48bcae15fd1dc448ffa603619caaafa9.jpg", "website": "http://www.eoniagame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 24}, "playtime": 4, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 399, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["GEOMETRIC BYTES"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["GEOMETRIC BYTES"], "esrb_rating": null}