{"id": 59863, "slug": "monster-farm", "name": "Monster Farm", "name_original": "Monster Farm", "description": "We are pleased to offer you an interesting game in which you will become a real farmer. But you will not grow cucumbers and tomatoes, and scary zombies, ogres, skeletons and other horrible creatures! As the population increases, you can improve your creatures and turn them into more and more new species, gradually increasing your income. Also don't forget to feed your creatures to make your income become bigger and bigger. Gradually, your farm will grow to huge sizes, and you can become the richest Keeper of monsters of all time!Features:<ul><li>Cool farm game<br/></li><li>Many monsters<br/></li><li>Nice graphics<br/></li><li>Suitable for Windows, Mac and Linux</li></ul><br/>Do you want to compete with your friends in the ability to build a real farm with monsters? Now you have the opportunity, because there are leaderboards and you can easily understand who is the best farmer. The game has a lot of improvements that you can buy with honestly earned money. And these improvements will only increase your income, so that gradually it can become really very large. In addition, you can buy ready-made monsters of different levels. However, their cost is quite high, but they can be a reliable help in the economy. The game is simple and perfect for children. Breeding monsters will give you a lot of joy. In addition, it will allow you to develop economic skills and care.", "metacritic": null, "released": "2018-08-31", "tba": false, "updated": "2019-08-28T21:59:13", "background_image": "https://media.rawg.io/media/screenshots/76f/76fc12acf783d6e3ba59a685e845be56.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 32, "ratings_count": 0, "suggestions_count": 85, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Educational Games"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["Educational Games"], "esrb_rating": null}