{"id": 598780, "slug": "the-garrison", "name": "The Garrison", "name_original": "The Garrison", "description": "<p><strong>JOIN  THE  BATTLE  OF  THE  TANKS</strong></p>\n<p><strong>Place different buildings, Generate money, Produce fighting units and Attack the enemy! </strong></p>\n<p>This fast-paced RTS game will surely test your reflexes to their limits. Connect with your friends and battle with each other to find out who is the best!</p>\n<ul><li>Defend your home base before the enemy destroys it.</li><li>Choose your units wisely and produce them according to your plan and defeat the enemy.</li><li>Check every corner through your mini map to see and prevent any sneak attacks happening on your base.</li></ul>\r\nHow to connect:\r\n<ul><li>One player will host the lobby by clicking <strong>Host Lobby</strong> button.</li><li><strong>Joining Lobby-</strong><ul><li><strong>IP Manual Build</strong> <strong>-</strong> Every player should be connected to the same wi-fi network. Click on the <strong>Join Lobby</strong> button and enter the IP (IPv4) address of the Host and click join.</li><li><strong>Steam Build -</strong> Open the game and then <strong>Shift+Tab</strong> to open steam community overlay. There you will find your friend who is the host of the game. Right click on your friend's name and hit the join button.</li></ul></li></ul>\r\nHow to play:\r\n<ul><li><strong>Camera Controls -</strong><ul><li>Control your camera with WSAD / Arrow keys  OR  using your mouse by moving to the edge of the screen in the direction you want to move.  <br/>\n</li><li>Click on a spot on the mini map to quickly move camera to that location on map.</li></ul></li><li><strong>Placing Buildings - </strong><ul><li>Drag and drop the building type that you want to place from the buttons on the bottom right of screen and place it near your home base if you have enough resources(money).</li><li>The distance up to which you can place your building from your home base will depend on the building farthest from your home base.</li></ul></li><li><strong>Producing Units -</strong><ul><li>Click on the building whose unit you want to produce.</li><li>You can produce multiple units by clicking multiple times on the building.</li><li>The time and number of units queued for production will be shown on the top of that building.</li></ul></li><li><strong>Tank Controls -</strong><ul><li>Left click on a unit to select it.</li><li>Click and drag your mouse in the area to select multiple units.</li><li>Hold Left Shift key and click on your units to select multiple units.</li><li>Right click on an enemy tank or building to attack.</li></ul></li></ul>", "metacritic": null, "released": "2021-04-30", "tba": false, "updated": "2021-05-03T09:15:39", "background_image": "https://media.rawg.io/media/screenshots/fdb/fdb172a5eab70e1b661d24e8d7f32807.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 70, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Himanshu0047"], "genres": ["Action", "Shooter", "Strategy"], "publishers": [], "esrb_rating": null}