{"id": 59874, "slug": "finalfire", "name": "FinalFire", "name_original": "FinalFire", "description": "\"FF\" is an athletic online game with background setting of China modern armored warfare. This game is an encyclopedia of the worldwide tanks. As an athletic battle game, it owns simple but quick battle rhythm and fluent operation feeling for your wonderful game experiencing. It also contains elements like team and tactical cooperation which help beat your competitor by outwitting. <br/>\n<br/>\r\n There are few types of tanks such as: main battle tanks, light tank, infantry fighting vehicles, supporting carrier, detective and air defense carriers. <br/>\n<br/>\r\n  Main battle tanks: A type of tank with frontal attack ability to enemies, typical styles like Chinese 96A, Anglo-US M1A1, Challenger in “FF” series. It owns stable firepower output and high-level defense, absolutely a main force of the battle field. <br/>\n<br/>\r\n  Light tank: The Chinese 63 &amp; Sheridan of Anglo-US are typical types of FF series. Classified based on the early gun barrel caliber, it was mainly used on detecting and guarding aspects. Also, can be used for war conflicts under certain circumstance. <br/>\n<br/>\r\n  Infantry fighting vehicles: it is an armored battle vehicle used for infantry maneuver warfare, with prevail performance over the firepower, defense power and maneuverability aspects than the armored personnel carrier. Mainly works as the cooperative combater with tank. The most famous infantry fighting vehicles in LAST GUN is Bradley of Anglo-US system, it shares some loading of the main battle tanks in the frontline battlefield.<br/>\n<br/>\r\n Detective carrier: offers visual supporting for team in FF series. This kind of carries has advantages like high motivation &amp; wide detective scope. However, it is inferior in defensing and firepower, like Brave Warrior of Chines system and EE9 of Anglo-US system. <br/>\n<br/>\r\n  Supporting carrier: can be fast combat supporting for the comrade in war with using its strong firepower or missiles. Most of the supporting carriers are wheel structure in FF series, such as Chinses BK1990.<br/>\n<br/>\r\n  Anti-air craft vehicles: it is weapon system with effective defensing air crafts with forming powerful anti-air craft barrage by high speed shooting. Like Chinese 80 &amp; 88 antiaircraft gun, and M163 fire gold of Anglo-US", "metacritic": null, "released": "2018-05-09", "tba": false, "updated": "2019-08-28T21:59:13", "background_image": "https://media.rawg.io/media/screenshots/843/843b6283f4a29afc31963e55f19aa7c0.jpg", "website": "http://ff.zqgame.com/index.html", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 105}, "playtime": 31, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 444, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["深圳中青宝互动网络股份有限公司"], "genres": ["Strategy", "Racing", "Massively Multiplayer"], "publishers": ["深圳中青宝互动网络股份有限公司"], "esrb_rating": null}