{"id": 598891, "slug": "killer-19", "name": "Killer 19", "name_original": "Killer 19", "description": "<h3>play a killer of amnesia - killer 19 series games come on stage. </h3>\"It's a good feeling to strike. It's a good feeling to kill! This is the real feast ——Player Reviews.<br/>The thick and thin level plot, the joyful feeling of killing and poking, will disappear in your memory when the sharp blade passes the other person's body without leaving blood;<br/>The bizarre flow of the plot, the elusive weight of the decision, in you scold the other side, showing your disgust for all fatuous ideas, slowly may also be hidden;<br/>The heart shaking idea of killing people and the unbreakable firmness of holding the sword show the feeling of heartless indifference and shock when you draw the sword to the other side, but it will be recorded forever like sin<h3> how to play </h3>This game is a horizontal version of the action plot game, you may need a little bit of thinking to choose your way of speaking, level may have some difficulty.<h3> key position introduction </h3>You can use W key to jump, s key to squat to avoid bullets, a key to move left, D key to move right. When you press the CTRL key (you also need to press the A or D key), you can run. When you press the e key, you can use the bullet time function.<h3> what will you play in the game? </h3>A total of 6 days of level, every day there are different wonderful branch level. The difficulty will go from easy to difficult, and will not remain difficult from beginning to end.<br/>We retain a strong sense of attack, killing without leaving blood, and the design of turning into smoke is even more shocking!", "metacritic": null, "released": null, "tba": false, "updated": "2021-05-07T02:45:49", "background_image": "https://media.rawg.io/media/screenshots/784/78411fb6cd88a983308743c0a4ff1d16.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 71, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SkyLine Studio", "熊昊思成", "徐熙尧"], "genres": ["Action", "RPG", "Indie"], "publishers": ["SkyLine Studio"], "esrb_rating": null}