{"id": 59885, "slug": "wheelbarrow-warrior", "name": "Wheelbarrow Warrior", "name_original": "Wheelbarrow Warrior", "description": "Wheelbarrow Warrior is a 3-D orthographic beat'em up game where players use the surprisingly best tool for the job--their wheelbarrow--to defeat hordes of challenging enemies and bosses by utilizing a plethora of abilities that includes unlockable combo finishers, level-specific interactable objects, and more!<br/><br/>You must survive wave after wave of distinct evil creatures and prove yourself capable through strength and strategy than the mightiest bosses that the enemy can muster.  You will 'barrow your way through waves of enemies in diverse, linear levels to earn the right to challenge each region's boss.   Defeat bosses to learn new combos, and then use those combos to find out which combos works best against the enemies you face; or whack and wheel your way through the old-fashioned way!  Prove victorious by executing insane wheelbarrow combos to slay the monsters and free your farm!<br/><br/>As a special reward, if you are diligent as you explore each challenging level you will be rewarded with magical seeds that will restore your farm's crops and grant access to unique mini-games! Find all the seeds to fully restore the crops and unlock every mini-game!<br/><br/>Dispatch tenacious enemies.  Execute insane wheelbarrow combo finishers.  Outplay mighty bosses.  Become the Wheelbarrow Warrior.Key Features<ul>-Powerful Wheelbarrow Attacks!</ul><ul>-7 Unique Combos!</ul><ul>-7 Challenging Enemy Types!</ul><ul>-3 Puzzle-like Bosses waiting to be solved!</ul><ul>-6 Fantastic Environmental Levels</ul><ul>-3 Fun and Challenging Mini-games</ul><ul>-Wheelbarrows</ul><ul>-Multiple Character Skins</ul>", "metacritic": null, "released": "2018-09-28", "tba": false, "updated": "2019-08-28T21:59:12", "background_image": "https://media.rawg.io/media/screenshots/4cb/4cb20d4913c0ad7737b8a3786f7f7831.jpg", "website": "https://twitter.com/wheelbarrowWar", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 322, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Flight 115"], "genres": ["Adventure", "Indie"], "publishers": ["Flight 115"], "esrb_rating": null}