{"id": 59899, "slug": "turbo-soccer-vr", "name": "Turbo Soccer VR", "name_original": "Turbo Soccer VR", "description": "Turbo Soccer VR is a soccer simulator designed for Virtual Reality. Step into shoes of real soccer players in our innovative Replay Mode and play real life soccer actions yourself! Dive deep into exciting soccer experience playing as a striker or goalkeeper and feel the immersion of a soccer stadium.<br/><br/><br/><br/>After putting on a VR headset, players are taken to a virtual soccer field, where they can see everything from the first person perspective. Depending on the game mode they choose, they can score goals, pass the ball or become the goalkeeper and save their team from losing a goal. The game detects your movements using special sensors located at the hands and feet of the player and transfers them to virtual reality. <br/><br/>Turbo Soccer VR uses HTC Vive, VR headset with wireless controllers on hands and feet. The use of a movement sensor, gyroscope and two laser sensors allows the player to kick the ball with very high precision, defend goals as a goalkeeper and look around the digital football pitch. <br/><br/><br/><br/><strong>GOALKEEPER MODE: </strong><br/>You play as a goalkeeper and face teams from all over the world. The difficulty increases with every game and the shots of your opponents gradually become more difficult to defend.  <br/><br/><strong>STRIKER MODE: </strong><br/>You play as an striker scoring goals against teams from all over the world. Every stage means different obstacles, more demanding defenders and better goalkeepers from the opposing teams. <br/><br/><strong>REPLAY MODE: </strong><br/>In this mode, you can replay scoring chances from real matches. You can see a replay and then move to the virtual pitch and try to score your own goal. The game contains a special package of the best goals by Kamil Grosicki. In June and July, the game will be regularly updated by the best scoring chances and goals from the real matches. <br/><br/><br/><br/>Kamil Grosicki is one of the best players of the Polish national soccer team and English Championship Club, Hull City A.F.C. Previously he played for teams such as the Turkish Sivasspor or French Stade Rennais. Recently he joined the team of Turbo Soccer VR, a new game using virtual reality technology, developed by Dodo4Story GamesNoteTurbo Soccer VR can be played in a room just 2 meters wide, although we recommend a room measuring 3 meters to ensure you can play more comfortably. Pay attention to the limits of the surroundings while you enjoy immersive experiences of our game to ensure you play without risks.<br/><br/>The game supports additional HTC trackers but all modes can be also used without them.<br/>", "metacritic": null, "released": "2018-06-14", "tba": false, "updated": "2019-08-28T21:59:12", "background_image": "https://media.rawg.io/media/screenshots/8ff/8ff979ef6b3c1b2d5dd7934ca73a726f.jpg", "website": "https://www.facebook.com/Turbo-Soccer-VR-218861618701410/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 291, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dodo4Story Games"], "genres": ["Action", "Simulation", "Sports", "Casual", "Indie"], "publishers": ["Dodo4Story Games"], "esrb_rating": null}