{"id": 598908, "slug": "flow-weaver", "name": "Flow Weaver", "name_original": "Flow Weaver", "description": "Flow Weaver is a \"multidimensional\" VR escape room game. You are a Flow Weaver, a powerful wizard-traveler familiar with the dimensions of magic. Trapped and shackled in a closed cell with only a few objects around, you need to use your powers to learn about the Flows of this strange new world -- and learn about your captors.<h3>Features:</h3><ul><li> A seated VR experience<br/></li><li> Fully voiced narrative dialogue featuring Ciarán Strange (Borderlands 3) as the Flow Weaver<br/></li><li> Beautiful original soundtrack</li></ul><br/><br/><br/>Observe and experiment with your environment to learn the magical laws of Kelemspar. Challenge your wit and ability to think outside of the box with multidimensional puzzles.<br/><br/><br/><br/>Immerse yourself in beautifully-rendered realms as the story unfolds.<br/><br/><br/><br/>Transition between your cell and different dimensions (or “Flows”) as you discover them, learning how each Flow affects the world in different ways. Gain allies, learn new magic, and uncover the secrets of your captors to orchestrate your escape.<br/><br/>Flow Weaver is made with the generous support of the Canada Media Fund, Ontario Creates and the Games Institute.<h3>Reviews</h3><br/>\"Flow Weaver is a worthy addition in the VR escape room game catalog.\"<br/>No Proscenium<br/><br/>“If you have some patience and you’re up for a challenge, then this might be the VR puzzler for you”<br/>VRScout<br/><br/>“You really have to think around edges and switch dimensions, and take items to other dimensions - It’s absolutely crazy. But I love it!”<br/>VoodooDE VR", "metacritic": null, "released": "2021-05-03", "tba": false, "updated": "2021-05-07T02:59:05", "background_image": "https://media.rawg.io/media/screenshots/e6f/e6fd146451a0443eff5a34858ec0aee6.jpg", "website": "https://flow-weaver.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 447, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Silverstring Media", "Stitch Media"], "genres": ["Adventure", "Indie"], "publishers": ["Oculus"], "esrb_rating": null}