{"id": 598970, "slug": "barbaros", "name": "BARBAROS", "name_original": "BARBAROS", "description": "<strong>STORY:</strong><br/>When we awaken on an island and study the mysteries of the island. We spilled blood using our sword and pistol for the greatest treasure in the history of piracy. Make sure you have a good time with its action while dragging this game story in which we strive to rule the seas.<br/><br/>Be careful and don't overlook the clues. Solving the mystery of an island will never be easy. Find explorable areas, access the knowledge and glory of the pirates who have already ridden the island. Learn from the mistakes of others and do not succumb to your ambition.<br/><br/><strong>USABLE WEAPONS:</strong><br/>You can use your sword or gun to defeat enemies and reach the treasure, so you can reach your target by defeating the enemies that come in front of you. Let's remind that it is more difficult to hit the target with a gun.<br/><br/><strong>CAMERA ANGLE:</strong><br/>Our game, which has a third person perspective, has been used to provide a more comfortable control with a better observation of the environment.<br/><br/><strong>GRAPHIC AND MAP DESIGN:</strong><br/>Our game is to immerse you in that atmosphere and to do it to increase the sense of exploration.<br/><br/><strong>OPEN THE WORLD:</strong><br/>You are on an island that offers different discoverable regions in a vast open world and there are enemies that will not leave you alone.", "metacritic": null, "released": "2021-05-05", "tba": false, "updated": "2021-05-07T03:43:16", "background_image": "https://media.rawg.io/media/screenshots/3ba/3ba62708ace8731808c4080e1664e6a7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 296, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Indie developer"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["Indie Developer"], "esrb_rating": null}