{"id": 598949, "slug": "astronite", "name": "Astronite", "name_original": "Astronite", "description": "<strong>Astronite</strong> is a metroidvania that combines action, exploration, puzzles and platforms.<br/>It recovers the planet in which you and yours lived before it was invaded by strange creatures.<br/><br/><strong>Some features:</strong><br/>- Explore an uncharted planet with the help of your skills.<br/>- Shoot, jump, use the dash or fly to overcome all the challenges and advance to the planet's core.<br/>- Improve your skills with permanent powerups spread throughout the planet.<br/>- Explore all the corners to find hidden paths or items that will help you in your adventure.<br/>- Find the Echo gates and overcome its challenge inspired by great video game classics.<br/>- Meet intriguing characters that can help you in your adventure or make things complicated.<br/>- Solve the puzzles scattered around the planet to get prizes, items or improvements that will allow you to continue your journey.<br/>- Fight against various bosses throughout your adventure and participate in a fighting festival to demonstrate your skills.<br/>- Buy items in the shop with the shpirti (spirits of dead enemies) you get by killing enemies or finding hidden chests.<br/>- A captivating and atmospheric soundtrack by zeeWave Sound.<br/>- Includes Achievements.<br/><br/><strong>Note from the creator:</strong><br/>I am not a programmer. I've been a big fan of video games since I was a child. <br/>This game represents a great part of my experience in the world of video games and a small tribute to the great metroidvania of history. I have dedicated a lot of time of my personal life to it. <br/>I hope you like it.", "metacritic": null, "released": null, "tba": false, "updated": "2021-05-07T03:28:19", "background_image": "https://media.rawg.io/media/screenshots/e45/e451006681c3dcfe12a55afc324a9f57.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "toplay": 2, "dropped": 1}, "playtime": 0, "achievements_count": 13, "ratings_count": 0, "suggestions_count": 191, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dume Games Studio"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Dume Games Studio"], "esrb_rating": "Everyone 10+"}