{"id": 598913, "slug": "wizards-duty", "name": "Wizard's Duty", "name_original": "Wizard's Duty", "description": "This is a first-person game with simple mechanics and controls (Mouse, WASD, E, Space). You play as a young man who wants to take the position of a court wizard. To win, you need to survive 7 days of the trial period on your new job - during each level, you need to prepare a potion for a limited period of time and do not forget about the side tasks. Every day, the time to complete the main task will become less and less, and distracting and complicating the gameplay circumstances-more. <br/>\n<br/>\r\nTo achieve victory you need:<br/>\r\n- Search and sell items from the lab to earn money and buy the reagents needed for the main task. <br/>\r\n- Buy upgrades for the tower to simplify your task. <br/>\r\n- Use the well to replenish your stamina - remember that almost every action consumes your stamina. If you run out of stamina, you will lose. <br/>\r\n- Don't forget to pay the dwarf builders, otherwise the well will stop working.<br/>\n<br/>\r\nIf any level seems too difficult to you - remember: in your laboratory you will also be able to find useful items and small chests of gold!<br/>\n<br/>\r\nThe game does not have a save system, but it is possible to replay the current scene in case of defeat - and if successful, move further along the plot.<br/>\r\nThe story messages are available in English and Russian languages. <br/>\r\nHave a nice game!", "metacritic": null, "released": "2021-05-03", "tba": false, "updated": "2021-05-07T03:02:54", "background_image": "https://media.rawg.io/media/screenshots/b40/b4088248006e4ddcc720c8f95825411e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 226, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["One Face Studio", "Koroteyev Viktor"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["One Face Studio"], "esrb_rating": null}