{"id": 599016, "slug": "galactic-crew-ii", "name": "Galactic Crew II", "name_original": "Galactic Crew II", "description": "Galactic Crew II is a roguelike sci-fi exploration game that takes place in a procedurally generated galaxy full of ruthless criminals, notorious pirates, monsters, miners, and merchants. With nary any credits or crew, you have to acquire goods, mine, and loot to build up your spaceship and crew to contend with the harshness of this galaxy. A wrong decision could bring death to you and your crew. Will you risk your life and ship to obtain the goods you need to survive this galaxy?<h3>Explore a galaxy</h3><br/>Different galaxies are yours to navigate at the press of a button and the warp of a jump gate. Each new planet is an opportunity to leave your stamp on the universe. Build colonies with resources mined in asteroid belts, raid nearby dungeons for loot, get your spaceship in top shape with shipyards and start new adventurous missions at the next space station.<h3>Explore planets and colonize</h3><br/>Explore an endless number of procedurally generated planets offering unique experiences in various settings from crashed spaceships to pirate hideouts, miner outposts, medieval villages, archeological dig sites, or pure horror scenarios. Colonize any number of planets by establishing fully customizable outposts. Each new room that you build adds new features like managing trade routes to space stations, mining, manufacturing, and storage solutions.<h3>Fully customized games</h3>When starting a new game, you can customize your game at will. Use any combination of game-altering cards to create a fully customized game. Combine any number of story lines to create a unique campaign. Alter the strengths and weaknesses of you and your enemies. Make missions even more rewarding and add new game content like jump gates or deadly Nemesis ships. Only some cards are unlocked at the beginning, while most cards are unlocked through achievements as you play the game. Mix your cards to get a truly unique experience that will make any run fresh and allow for infinite replay value.<h3>Ship customization</h3><br/>All purchasable spaceships have their own unique layout. You can customize the ship at any space station or shipyard, replacing rooms to change your ship's functionality. Utility improvements can see the addition of crew quarters, engines, and power generators, while combat improvements involve replacing turrets and adding shield generators. Capture enemy spaceships with teleporters, create drones for mining, combat, and salvaging, and create goods with item processors or botanical gardens.", "metacritic": null, "released": "2021-05-06", "tba": false, "updated": "2021-05-07T04:20:14", "background_image": "https://media.rawg.io/media/screenshots/787/78722d7065d46303221aa8851aeb49c9.jpg", "website": "http://game-creation.tech/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 332, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Benjamin Rommel Games"], "genres": ["Action", "Strategy", "Simulation", "Casual", "Indie"], "publishers": ["Benjamin Rommel Games"], "esrb_rating": null}