{"id": 599074, "slug": "mylittlecat-cat-simulation", "name": "MyLittleCat - Cat Simulation", "name_original": "MyLittleCat - Cat Simulation", "description": "MyLittleCat is a unique cat simulation game. You create your own cat, raise her carefully and make her happy! Let's start the virtual pet life!<br/><br/>1. Cat Editor - Create Your Own Cat!<br/>You can create your cat easily. The Cat Editor has 11 skin colors/patterns and 17 body parts sliders. So you can create a wide variety of cats you like just by swiping the sliders. If you use the random generator, you'll create cats beyond your imaginings! In addition, you can customize your cat's voice, walking speed, personality and relationship with you. You can customize the game difficulty by the combination of a fatness and a relationship. The higher the game difficulty is, the more you can enjoy a fun of puzzle to balance the fatness and the relationship.<br/><br/>2. Cat Room - Let's Start Your Pet Life!<br/>You raise your cat in the Cat Room. The Cat Room is a living room with a food bowl, a litter box, a scratching post, a toy mouse and a cat tower which the cat needs. You can play in portrait and landscape. The game camera can be switched the Follow-Cat and FPS (First Person) views.<br/><br/>The cat autonomously acts by the Cat AI (artificial intelligence). You can see how the cat feels now by the status UI (on the top of the screen). So be careful about the cat's feelings and interact with her. The main interactions you can do is...<br/><br/>Feed the cat (selecting dry food or milk, the amount of food)<br/>Clean the litter box<br/>Stroke/Poke the cat<br/>Call the cat<br/><br/>You can also customize the game options, such as the UI font colors, the display style of the clock time and the pausing when the the dialog appears.<br/><br/>3. Goal - Make Your Cat Happy!<br/>You can freewheelingly play with your cat but there is a goal in the game. The goal is to make your cat happy and the Best Cat. To make her the Best Cat, you should be careful about her fatness and relationship with you and get as many cat-happiness points as possible. If the cat gets the most cat-happiness points, the cat will be recorded as the Best Cat. It's also fun to compete for the cat-happiness points with your friends or within the time limit.<br/><br/>4. Safety, Requests and Contact<br/>MyLittleCat has no advertisement or no In-App Purchase so the app can be used safely even for juveniles. We'd like to keep updating the app as long as possible. So please feel free to ask or request for anything about MyLittleCat. Our contact is...<br/>Twitter:<br/>https://twitter.com/ItasanStudioJP<br/>Email:<br/>itasanStudio@gmail.com<br/><br/>5. Credit<br/>The game uses some sounds thanks to Koukaon Sozai:Pocket Sound - https://pocket-se.info/.", "metacritic": null, "released": "2019-01-23", "tba": false, "updated": "2021-05-07T04:59:09", "background_image": "https://media.rawg.io/media/screenshots/4e3/4e3318811eeba62f8dfbebdc7c06968a_I4h8sdk.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 170, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Itasaka Tsuyoshi"], "genres": ["Simulation", "Puzzle"], "publishers": ["Itasaka Tsuyoshi"], "esrb_rating": "Everyone 10+"}