{"id": 599191, "slug": "zwitter", "name": "Zwitter", "name_original": "Zwitter", "description": "<p>This project is <strong>FULLY PLAYABLE</strong>! This means that all of the gameplay is accessible (with some bugs probably), with three difficulty levels, and a functioning options menu. It has been tested with a standard xinput controller, but I am not sure about others. However, the start menu has unfinished visuals, additional narrative content is not in place, including two short 'cutscene levels', and if you complete the game's final level it will crash.</p>\n<p>I have been sitting on this for years, so it's unlikely it will ever be finished. Lore/story-wise, the things that are missing are that the Zwitter was thrown out of the western town for being intersex by the religious leadership, and was taken in by a race of beast folk. The game's beginning is an attack on the beast folk and an attempt on the Zwitter's life as a wedding gift to the new monarchs. The rest is mostly apparent while playing. (<strong>I started making this game quite a few years ago and am not german, so please let me know if the title term is offensive! I can always take this down or find a different word to use if need be.</strong>)</p>\n\n<p>Default Controls:<br/></p>\n<p>alt / start: pause, menu activation<br/>ctrl / select: bomb, menu selection<br/>wasd / dpad: movement, crouch (weight in air)<br/>space / A: jump<br/>shift / B: walk (hover in air)</p>\n\n<p>Difficulties:</p>\n<p>narrative: when hit, you recieve a moment of invulnerability and muted music, and a counter in the top left ticks up. Recommended for new players! This is the only difficulty I have finished the game on, so don't feel like you have to do more.</p>\n<p>normal: when hit, you are made to restart the level. this is the mode that was playtested during development, so while I have never done a full run, it is possible to complete the game. the Password menu only works with this difficulty.</p>\n<p>lunatic: the same as normal, except you cannot hover in the air using B. If you send me unedited footage of yourself completing lunatic mode from the start menu to the game crashing, I will venmo you $20. At least, the first person to do that. I just want to know if it's possible.</p>\n\n<p>Music:<br/></p>\n<p>yeah, the game's got music. You can listen to all of it fully at https://trashmaker.bandcamp.com/album/zwitter. There's even a little extra story over there if you look for it...</p>", "metacritic": null, "released": "2021-05-06", "tba": false, "updated": "2021-05-07T05:29:03", "background_image": "https://media.rawg.io/media/screenshots/425/425d2d4aaa92a0727332c7ed95d03777.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 28, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Echo Reece"], "genres": ["Action"], "publishers": [], "esrb_rating": null}