{"id": 59938, "slug": "war-ender", "name": "War Ender", "name_original": "War Ender", "description": "War Ender is an action platformer where players assume the role of Red, known within the The City as \"the greatest fighter.\" One night, Red was wandering the streets of The City when he found his friends dead. The investigation that followed revealed that a group of people plotting against The City attacked and killed Red's friends. Out of rage, our hero determined to eradicate The City of these villains and thus joined a new movement headed by Cyrus, the CEO of Cycorp. This endeavor promises safety and security from the villains now referred to as The Outsiders.<br/><br/>Red has earned his title due to his great speed and even greater aim, matched only by his ferocity and undying spirit. Even those beyond The City have heard of Red's amazing accomplishments. After joining The Outsider Resistance Movement, Red received a recently completed weapon from Cycorp that gave Red powerful energy shots, unlimited ammo, and even the ability to defy gravity. With this, his physical might, and his ferocious persona, The Outsiders don't stand a chance!<br/><br/><strong>FEATURES:</strong><br/><br/><ul><li>Float in the air by firing down. Use this tactic to cross gaps and destroy enemies!<br/></li><li>A weapon with incredible range. Pick off Outsiders up close or far away.<br/></li><li>Quick movements help Red get in and out of battles at incredible speeds!<br/></li><li>No random chance. Every success is down to your skill.<br/></li><li>Prove just how hardcore you are by destroying checkpoints. Unlock unique bonus levels for doing so.<br/></li><li>Bring carnage to the beat of some head banging tunes</li></ul>", "metacritic": null, "released": "2018-07-26", "tba": false, "updated": "2019-08-28T21:59:10", "background_image": "https://media.rawg.io/media/screenshots/acc/acc836432cdce9e2827df637f1400e45.jpg", "website": "https://www.warendergame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 50, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Infinite Level"], "genres": ["Action"], "publishers": ["Infinite Level"], "esrb_rating": null}