{"id": 59949, "slug": "vr-jogger", "name": "VR Jogger", "name_original": "VR Jogger", "description": "Jogging is a softer alternative to running and is one of the oldest and most popular forms of aerobic exercise. It can help you burn calories and strengthen muscles as well as improve cardiovascular fitness. Jogging is also a great way to help lower your blood pressure and relieve stress. It helps put you in a more peaceful state of mind and helps promote an upbeat attitude. The WHO recommends that adults aged 18 to 64 years should get in at least 150 minutes of exercise a week. That can be hard to accomplish with today’s busy lifestyles!<br/><br/><strong>VR Jogger</strong> is great solution as it is Free and easy to use regardless of where you are and whatever your schedule. It has short, medium and long trails that are around 4 minutes, 7 minutes and 14 minutes long. All of the trails take place on a beautiful island that has plenty to see and watch in case you need to take a break and catch your breath or just to enjoy the beauty of it all. You just swing your arms with controller in each hand to move along the trails.<br/><br/>Are you overweight or out of shape? You control the pace and can start with brisk walking motions and the short trail and then move up to longer courses and jogging over time. VR Jogger is a great way to get your body moving again in your own space and your own pace. While we recommend you play the game standing up, it can be played sitting down if you are getting started or incapacitated. It can also be played only with left or right arm if that is needed as well. It also keeps the best time for each trail and you can watch your current time on your in game wristwatch as you jog. This helps you maintain motivation and can be fun to compete with friends and family.<br/><br/>Get started on the trail to a healthier you with VR Jogger today!", "metacritic": null, "released": "2018-08-17", "tba": false, "updated": "2019-08-28T21:59:10", "background_image": "https://media.rawg.io/media/screenshots/ffe/ffe85555bd9301ad3728f623aa2336ba.jpg", "website": "http://www.vrjogger.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 391, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["EnsenaSoft"], "genres": ["Simulation", "Sports", "Casual"], "publishers": ["EnsenaSoft"], "esrb_rating": null}