{"id": 599593, "slug": "kukutankukutan", "name": "ククタン(kukutan)", "name_original": "ククタン(kukutan)", "description": "<p>Kukutan is an 8-bit side-scrolling action where a boy and karakasa explore a dungeon, </p>\n<p>hit, grab, shake, jump and fly to reach the goal.</p>\n<p>「ククタン」は、少年と唐傘がダンジョンを探検し、</p>\n<p>叩いて掴んで振るって跳んで飛んでゴールを目指す、8bit横スクロールACTです！</p>\n\n\r\nBrowser version description\r\n<p>The content is almost the same as the download version,  but The download version has a little bonus elements after clearing the main story.</p>\n\r\nStory\r\n<p>The boy was brought up by tsukumo, an autonomous tool, such as the karakasa on his back. The two who continue their journey today see a mysterious sight in the land they arrived at. There is a space where the times and places are disturbed, and tsukumo people gather and wander...</p>\n<p>Feeling the anomaly of the tsukumo people who are similar to the parents who raised them, the boy grasps the Kara umbrella and jumps in</p>\n<p>What is the answer that awaits you ...「IZA!」</p>\n\r\nSystem\r\n<p>Movement includes walking and jumping, as well as gliding and wall climbing with the help of a karakasa.</p>\n<p>In addition to hitting with a karakasa, the enemy's tsukumo can be itemized by defeating it once, and by grabbing it and shaking it, you can launch an attack according to the original enemy's ability.</p>\n<p>3 life. Hair color and sound effects change with each damage.</p>\n<p>Please note that if you jump out of the screen, it will fail.</p>\n<p>Items will disappear in a certain amount of time if not picked up.</p>\n<p>If you sleep completely, you will recover 1 life.</p>\n\r\nHow to play\r\n<p>Wait a moment on the title and the tutorial start.</p>\n<p>←→: Move left and right</p>\n<p>Ｚ: Attack　Ｘ: Jump</p>\n<p>Ｘ-&gt;(Touching the side of the wall)Ｘ: With wall</p>\n<p>(Sticking to the wall)Ｘ: Wall Jump </p>\n<p>Ｘ-&gt;(Again in the air)Ｘ: Gliding</p>\n<p>While touching the enemy (item) after defeating,</p>\n<p>↑: Pick up item　↓: Put item</p>\n<p>With the item picked up,</p>\n<p>Ｚ: Shake item　Ｘ: Jump</p>\n<p>to press nothing for a while―――</p>", "metacritic": null, "released": "2021-05-04", "tba": false, "updated": "2021-05-07T07:14:19", "background_image": "https://media.rawg.io/media/screenshots/333/3334174f9d2556a13beddea39e56438f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 131, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["udonko"], "genres": ["Action"], "publishers": [], "esrb_rating": null}