{"id": 599586, "slug": "rift-defenders", "name": "Rift Defenders", "name_original": "Rift Defenders", "description": "<p>Rift Defenders is a Tower Defense game focused on building a maze and strategic hero upgrading. There are three base Heroes that are able to be upgraded into twelve unique Heroes.  There are two different resources, the first being gold to hire heroes and the second is Exp to upgrade heroes. Gold is gained at the end of waves and Exp is gained from killing monsters.  Gold can be converted into Exp by using the Sacrifice mechanic, note sacrificing an upgraded Hero does not give more Exp. this allows you to stop building your maze when you decide it is big enough.  All heroes have four different targeting methods which are First, Last, Weakest and Strongest. There are a total of 42 Waves of monsters, a boss at every seventh level, and a Bonus round at the end.  </p>\n<p>Controls:</p>\n<ul><li>You can Hit the C key to show the grid(this was mainly for development but I found it useful when playing so I left it in.)</li><li>Escape - will pause the game and allow you to quit or restart.</li><li>Clicking is most of it.</li></ul>\n<p>Tips:</p>\n<ul><li>Building around the end point( the light pink Rift at the bottom).</li><li>Start Sacrificing every new tower after your maze feels long enough.</li><li>Build a variety of Heroes </li></ul>\n<p>Enjoy,</p>\n<p>here is a link to my page, there isn't much there yet but there is more to come.</p>\n<p>https://doodskidev.itch.io<br/></p>", "metacritic": null, "released": "2021-05-05", "tba": false, "updated": "2021-05-07T07:12:14", "background_image": "https://media.rawg.io/media/screenshots/7b1/7b1a4b5dc341d50c29e46cc307c223b3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 76, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Doodski Dev"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}