{"id": 599579, "slug": "strife-the-expanse", "name": "Strife: The Expanse (itch)", "name_original": "Strife: The Expanse (itch)", "description": "<p><em>Strife: The Expanse</em> is a Hex-Grid style turn based strategy game. Recruit an assortment of units from across the expanse and do battle with your friends on procedurally generated battlegrounds! Inspired by tabletop board games from the past decade, <em>Strife: The Expanse </em>aims to provide a replayable and customizable experience.</p>\n<p>A steam version releases May 14th however the itch version will remain updated as a DRM free version. <strong>$2+ Donators will recieve a steam key, and will gain access to the game when the Steam Version Releases. </strong>Note: If there is no keys remaining please check back in a day or so.</p>\r\nFeatures:\r\n<p><em>Strife: The Expanse</em> currently boasts a wide variety of features aimed to give you control over your game!<br/></p>\n<ul><li>Keyboard and Controller Support.</li><li><strong>Optional  Virtual Reality with Oculus Rift: Play with your friends but in VR! Witness the expanse with your own virtual eyes!</strong></li><li>Online Multiplayer via Direct Connection &amp; Offline vs AI. </li><li>Utilize seven* different Units, each with their own abilities to crush your enemies and lead your team to victory! From defence debuffs to AoE's to passives each unit has its own niche!</li><li>3 Gamemodes (Free For All, Team Elimination, or Capture The Flag)</li><li>Map Customization Options such as elevation variance, size, and even the ability to select the map seed! Up to 150x150  and 50+ units are supported at this time.</li><li>Height Matter! Units will take more or less damage depending on their height advantage to other units!<br/>\n</li><li>Adjustable point handicaps: Have a friend who is really bad or really good? Adjust their point handicap to make them sweat! Want to set up a 3v1? Give the lone-wolf some extra points so that your battles are fair and balanced for everyone!</li><li>Entirely DRM Free on itch.io <strong>($2+ Donators will recieve a Steam Key)</strong></li></ul>\n<p>*Five units are available in the free version. There is no other feature restrictions. See below.Multiplayer Hosting Requires Port Forwarding!</p>\r\nMultiplayer Requires Port Forwarding\r\n<p>You can find a few good resources here, here and here. You will need to port forward the <strong>7777</strong> port.  Select \"Both\" for transport method. <strong>The steam version bypasses this and allows you to join friends via the overlay. </strong>If you wish to play against bots by yourself this is not required.</p>\r\nControls:\r\n<p>Keyboard and mouse and controller controls are found below. Controller support begins once you are loaded into the main game. You can switch between them on the fly in game so try them out!  I recommend playing one game before trying VR to familiarize yourself with the game and to ensure IP and username text-boxes auto-populate. </p>\n<strong>Action</strong><strong>Keyboard</strong><strong>Xbox Controller (Playstation)</strong><strong>Oculus Rift</strong>SelectMouse Click*A (X)*Right/Left TriggerMoveWASDLeft StickLeft JoystickSpeed Up MovementShiftRight Trigger (R2)Click Left JoystickRotate ViewQ &amp; ERight Stick Left/RightRight JoystickQuick Select UnitFRMB &amp; LMB (R1 &amp; R2)Left/Right GripSwitch Attack/Move ModeSpaceX (Square)AZoomScroll WheelRight Stick Up/DownRight Stick Up/DownEnd TurnTabYYToggle Chat OnCSelectn/aSubmit ChatEntern/an/aGame MenuEscStartRight Stick Click\r\n<p>*Mouse and keyboard select where you click, controller selects from center of screen. A target reticle will appear the first time you use a controller.</p>\r\nFree Version Vs Donation Only:\r\n<p>For $2 USD you will gain access to the donation only version. Additionally you will receive a steam key for the game. <strong>The free version's multiplayer is compatible with the donation version.</strong></p>\r\nFeatureFree VersionDonation OnlyFounder VersionPriceFree$2 USD$3.50 USDUsable Units577Oculus VRYesYesYesSteam KeyNoYesYesYour Name In GameNoNoYes\r\n<p>Financial support will allow me to add additional content such as new units.</p>\r\nRecommended Settings:\r\n<ul><li>CPU: i5-4570 or newer (mostly for 150x150 maps). </li><li>GPU: GTX-960 or newer (mostly for VR).</li><li>Ram: 8+ Gig</li></ul>\r\nAcknowledgements:\r\n<ul><li>Shoutout to my  solid group of friends for beta testing and listening to me drone on about programming.</li><li>As always, shoutout to you, whoever is reading this. I do this for fun and anytime one of my games are downloaded it makes my day!</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2021-05-07T07:10:01", "background_image": "https://media.rawg.io/media/screenshots/0bd/0bd49ba3758fbbcf599363298eed118d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 183, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Falling Ash Games", "Ommageden"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}