{"id": 5996, "slug": "hyperlight", "name": "Hyperlight", "name_original": "Hyperlight", "description": "** &amp;quot;Hyperlight EX&amp;quot; is NOW available in the Apple AppStore!! **<br/><br/>* Hyperlight has got nominations for &amp;quot;Most Innovative Game of the Year&amp;quot; by PocketGamer!<br/>* Hyperlight was featured by Apple in &amp;quot;New and Noteworthy&amp;quot; and &amp;quot;WHAT&amp;#39;S HOT&amp;quot; !!<br/><br/>Take control of the Hyperlight and burn your enemies faster-than-light in this innovative, psychedelic and super-fast retro arcade space shooter!<br/><br/>********************<br/><br/>&amp;quot;Innovative and unique, Hyperlight may look as derivative as they come, but is a breath of fresh air to the Market Place.&amp;quot; PocketGamer.co.uk<br/><br/>&amp;quot;Factor in tight controls and sharp neon graphics, and you have a leading candidate for App Store game of the year.&amp;quot; MoDojo.com<br/><br/>&amp;quot;Hyperlight is a unique experience with outstanding HD visuals, all for a low price. It might be difficult, but it can easily be mastered with some practice. Definitely check it out!&amp;quot; Appolicious.com<br/><br/>&amp;quot;Hyperlight is a feast for the senses and a worthy successor to the twin-stick shooters that led up to this title.&amp;quot; AppSpy.com<br/><br/>&amp;quot;Beyond a doubt, Hyperlight offers an immense amount of gameplay. Add a tasty difficulty and two different game modes, and what you have is a piece of iOS gaming art.&amp;quot;  TheiPhoneAppReview.com<br/><br/>&amp;quot;Overall the game gives you complete value for your money. Hyperlight is a kind of game you will end up playing for hour’s non-stop.&amp;quot; iPhoneFootPrint.com<br/><br/>&amp;quot;It’s an exciting, adrenaline-pumping game that eschews traditional shooter gameplay!&amp;quot; FreshApps.com<br/><br/>********************<br/><br/>Take control of the Hyperlight in this psychedelic cosmic environment where countless evil beings try to destroy you, the last human fighter. However, your ship posses an incredible power! If successfully used, it can wipe out all your foes: it can travel at faster-than-light speed (FTL) making it impossible for anyone to catch it and is also able to disintegrate everything it touches! <br/><br/>With simple gestures, you can move your spaceship at regular speed but also turn on its FTL engine to perform incredibly rapid attacks! Controls are simple and you can choose from touch only controls, tilt only or the exotic tilt &amp;amp; touch.<br/><br/>There are also dozens of power ups and weapons you can easily activate simply by gathering them on the battlefield. Hyperlight is easy to play but hard to master, there are so many ways to improve your skills that you will find yourself playing it for months! For a complete list of all the gameplay secrets of this game see the guide included! <br/><br/>Can you survive these incredible hordes of enemies? <br/>Enemies will try to do everything to stop you, assuming several attack formations, different strategies, also leaving powerful dimensional trails on the battlefield that only at FTL speed you can cross! <br/><br/>And watch out for the evil commanders: huge bosses await the Hyperlight in the dark corners of the universe!<br/><br/>Features:<br/>* Universal App: runs in HD on iPad and Retina Display devices.<br/>* Extremely innovative gameplay: burn your enemies faster-than-light!<br/>* 3 Control systems to meet your taste: Virtual Joystick, Tilt only and Tilt &amp;amp; Touch.<br/>* Stunning 2.5D neon-style graphics, effects and animated backgrounds.<br/>* Arcade mode with 40 different levels.<br/>* Infinity mode for an endless fun.<br/>* Several huge bosses to face.<br/>* Exciting techno and rock musics!<br/>* GameCenter support, with leaderboards and 24 achievements.<br/><br/>For any question about this game contact us at support@catfishbluesgames.com", "metacritic": null, "released": "2011-04-19", "tba": false, "updated": "2019-10-22T14:28:33", "background_image": "https://media.rawg.io/media/screenshots/58a/58a53fcb47454faa23ba0d15f4a812f6.jpg", "website": "http://www.catfishbluesgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 297, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["Alessandro Avigni", "CatfishBlues Games"], "genres": ["Action", "Arcade"], "publishers": ["Alessandro Avigni"], "esrb_rating": "Everyone 10+"}