{"id": 59970, "slug": "bulletrage", "name": "BulletRage", "name_original": "BulletRage", "description": "Welcome to BulletRage, a retro-revolutionary spin on the twin-stick arcade shooter. Hardcore and casual players alike will enjoy the nostalgic arcade gameplay paired with non-stop adrenaline action. Dash around corners and leap into the fray to battle swarms of enemies with a thirst for your blood. Use overwhelming firepower and join up to three friends in the battle for the fate of humanity! You’ve never experienced an old school arcade shooter quite like BulletRage.Story:Aliens have conquered the human race, and now they’ve put us on trial in a twisted game show broadcasted live throughout the galaxy. It’s up to you to use oversized weaponry and insane power-ups to ensure our continued existence. Are you up for the challenge?Features:Customize your character with hundreds of deadly weapon loadout combinations, then tear through over 40 levels of relentless traps and enemies to win humanity’s survival. Fight through the campaign story, battle to the top of leaderboards, or use the level editor to make and share devious levels of your own design.<ul><li> Hundreds of unlockable weapon loadout configurations<br/></li><li> 5 difficulties fine-tuned for casual to competitive gameplay<br/></li><li> Up to 4 players with local or online multiplayer <br/></li><li> Giant boss fights of epic proportions<br/></li><li> More than 40 hand-crafted levels in campaign mode<br/></li><li> Acquire achievements to unlock player and weapon skins<br/></li><li> Use the built-in level editor to create levels you can share with world<br/></li><li> Twitch Dungeon Master Mode: Viewers have the ability to unleash deadly enemies and effects<br/></li><li> Dozens of exciting arcade power-ups and unique enemies<br/></li><li> Cross-platform leaderboards<br/></li><li> Multi-platform release, with initial release on Windows, OS X, and Linux</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:59:09", "background_image": "https://media.rawg.io/media/screenshots/16e/16e8ccd791c950a702c7918dacae15fa.jpg", "website": "http://bulletrage.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 300, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Chimera One Games"], "genres": ["Action", "Indie"], "publishers": ["Chimera One Games"], "esrb_rating": null}