{"id": 599733, "slug": "reborn-the-mark-of-the-blood", "name": "Reborn: The Mark Of The Blood", "name_original": "Reborn: The Mark Of The Blood", "description": "<p><strong>THE STORY</strong>\n</p>\n<p><strong>2066</strong>...\r\n</p>\n<p>....<strong>The awakening</strong> \r\n</p>\n<p>in a world destroyed, poor and populated by the last surviving human beings, the city is the last bastion of the human race. Protected by a barrier created by the scientist <strong>Kazeki</strong>, considered by many to be a mad man, it is the last surviving city on earth, after \"<strong>The Red Swarm</strong>\" of meteors completely destroyed it. Outside of the city, nobody knows what is going on... the only thing we know is that the population of the earth has shrunk to <strong>66666 units</strong>... no one knows about events outside the city, whoever it is gone out of town, never came back.\r\n</p>\n<p>\n</p>\n<p><strong>\n</strong>\n</p>\n<p><strong>MISSIONS AND QUEST</strong> \r\n</p>\n<p><em><strong>There will be four types of missions in the game</strong>:</em>\n</p>\n<ul><li><strong>Story Mission</strong>: These missions are closely related to the story. Each mission can have multiple objectives to complete in order to complete the mission.\r\n</li><li><strong>Side Mission</strong>: The secondary missions are always part of the story but not necessary to carry out the same. Generally these missions will give you new items, skills, recipes for crafting. These missions will make you discover new details of the Reborn world.\r\n</li><li><strong>Master Mission</strong>: When you understand that you are the son of a demon, the master missions will begin to be available to make you acquire new abilities, different transformations into demonic form.\r\n</li><li><strong>Arcade Mission</strong>: These are missions in which you will discover fun things from the world of Reborn. You will earn Arcade Coins that will give you access to the arcade of the main city where you can play the remake of great arcades of the past in a comic key.\r\n</li></ul>\n<p>There are also special missions that you can only acquire with a sufficient degree of reputation with the factions. AICs will be able to help you complete missions by providing information, providing more relevant information to mission resolution as it unfolds.\r\n</p>\n<p>\n</p>\n<p><em><strong>The following missions are currently implemented</strong>:</em>\n</p>\n<ul><li><strong>Location</strong>: Discover a new location.\r\n</li><li><strong>Interact</strong>: Interacting with a specific AIC.\r\n</li><li><strong>Collect</strong>: Collect a certain number of items required for the mission.\r\n</li><li><strong>Kill</strong>: Kill enemies.\r\n</li><li><strong>Craft</strong>: Craft a certain item that you will need during the progression.\r\n</li><li><strong>Escort</strong>: Escort a character so that he is not killed.\r\n</li><li><strong>Timed</strong>: Timed mission.\r\n</li><li><strong>Buy</strong>: Find a particular store and buy the items an AIC needs.\r\n</li><li><strong>Delivery</strong>: To deliver something from one AIC to another.\r\n</li><li><strong>Hacking</strong>: Introduce yourself to a networked system in the game.\r\n</li></ul>\n<p>FACTIONS AND INTERACTION IN THE GAME\r\n</p>\n<p>Every action you take in the game will have a consequence in the consideration that the AICs will have of you. All AICs are part of one of several factions and your every action affects the way they see and interact with you.\r\n</p>\n<p><em><strong>These factions are currently implemented in the game</strong>:</em>\n</p>\n<ul><li><strong>Demons</strong>\n</li><li><strong>Humans</strong>\n</li><li><strong>Hamatzu BrotherHood</strong>\n</li><li><strong>Little Italy</strong>\n</li><li><strong>Neo Shinjuku</strong>\n</li><li><strong>Church of Apocalypse</strong>\n</li><li><strong>Slums</strong>\n</li><li><strong>Rebels</strong>\n</li></ul>\n<p>Some factions are at war with each other and therefore you will have to carefully choose which faction missions you will choose\r\n</p>\n<p>\n</p>\n<p><strong>AIC'S</strong>\n</p>\n<p>All non-story related AIC are created dynamically from a hardware seed. This means that at the first start the game calculates a number, based on some components of your computer, which is used for the creation of each AIC: You will never find the same AIC on another computer. This means that the game experience will be REALLY different from one computer to another!\r\n</p>\n<p>The names of the AICs are created from a <strong>database of 12.000 names and surnames, belonging to 8 different races!</strong>\n</p>\n<p>\n</p>\n<p><strong>Quest for Santa 15-day Demo</strong>\n</p>\n<p><strong> </strong>\n</p>\n<p><strong>REBORN: QUEST FOR SANTA MINIGAME</strong> It's Chrismas eve and Santa is Disappeared, noone in \"<strong>The City</strong>\" knows something about it. The little kids ay wammy's orphanage will not have their presents and they will not believe anymore in Santa Claus. The situation here is really heavy. Will you be the hero who will save the chrismas for this little orphans?\r\n</p>\n<p>\n</p>\n<p>It is with great satisfaction that after years of work and devotion Reborn is ready to show itself in a <strong>FREE 15-DAY DEMO (The Demo will expire 05-15-2021) </strong>in a minigame crafted and created in 1 month, using the Reborn Game Engine (created in Unreal Engine), to show you the universe in which the main story takes place and introduce to the mechanics of the game. <strong>Reborn</strong> deserves attention, for those who love the world of videogames and have the passion to live and identify with an original story, immersive and full of emotions, a journey for lovers of storytelling in a world full of quests and features that Gameplay offers to players.\r\n</p>\n<p><strong>Reborn: Quest for Santa, represent an alternative story line crafted to introduce you into the Reborn Universe. We adopted this method to let you try the game and don't spoil the main story line which comes from a 300 pages novel written 8 years ago. This Demo is free for everyone and we encourage you to share the installer with your friends and stream it.</strong>\n</p>\n<p><strong>Please consider it as a demo, not a finished product.</strong> <strong>If you are an influencer please join the Reborn Partners Network (Partners.rebornthemarkoftheblood.com) to immediately get the full minigame version( without time limit ), and so be able to stream and promote the game earning a revenue share for any preorder made with your referral code</strong>\n</p>\n<p>\n</p>\n<p>\n</p>\n<p>\n</p>\n<p><strong>ROADMAP<br/><br/><br/></strong></p>\n<p><strong>For more information follow us on</strong><br/></p>\n<p>Website\r\n</p>\n<p>IndieDB\r\n</p>\n<p>Discord\r\n</p>\n<p>Facebook\r\n</p>\n<p>Twitter\r\n</p>\n<p>Twitch\r\n</p>\n<p>Reddit\r\n</p>\n<p>Youtube\r\n</p>", "metacritic": null, "released": "2021-05-05", "tba": false, "updated": "2021-05-07T07:47:30", "background_image": "https://media.rawg.io/media/screenshots/ca2/ca2e1fa5a454867c6fb2cb5abe175192.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 63, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Exodus Team"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}