{"id": 59976, "slug": "raygun-gadabout", "name": "Raygun Gadabout", "name_original": "Raygun Gadabout", "description": "Freely explore a strange galaxy teeming with danger and wonder. Befriend helpful aliens, solve puzzles and equip new abilities. Battle evil space pirates and liberate the galaxy from the clutches of the Space Gopher Empire. Grab your raygun and board your ship. You are the RAYGUN GADABOUT!<br/><br/><br/><strong>Warp To Adventure:</strong>  Use your ship to travel between planets, explore the cosmos, discover spatial anomalies and derelict ships<br/><br/><br/><strong>Dynamic Combat:</strong>  Adapt to your enemy, switch between ranged/melee attacks. defend yourself with your shield, reflect enemy attacks back at them.<br/><br/><br/><strong>Discover New Powers:</strong> New abilities allow you to explore previously unreachable places. Bring the fight to the toughest foes with equippable perks like improved shield reflect damage, health regeneration, charged shots and many more!<br/><br/><br/><strong>Meet the galaxy’s colourful cast of characters:</strong>   Encounter friendly aliens, cold-blooded space pirates, merciless bounty hunters and fascist space gophers.<br/><br/><br/><br/><br/>Raygun Gadabout is a <strong>game about exploration</strong>. There are two main components: <strong>Planet side and galactic travel.</strong> The goal is to give you the freedom to explore, do some platforming, solve fun puzzles, and blast hostile aliens into oblivion!<br/><br/>The combat is built around<strong> shooting and melee</strong> and you need to switch up your tactics depending on what enemy you are fighting. You have <strong>unique abilities</strong> to help you deal with the lasers, deadly raptorial limbs, gnashing teeth, and toxic bile blobs that the galaxy’s denizens will hurl your way. <br/><br/><strong>Shielding is a great way to stay alive</strong> (you want this!). What's the fun in cowering behind cover when you <strong>can jump into the fray reflecting enemy projectiles</strong> back in their ugly faces.<br/><br/>And if your foe is trying to dice you up you can <strong>dodge roll behind them</strong> and give them a hardy whack with your <strong>plasma sword</strong> to teach them a lesson they won't forget.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:59:09", "background_image": "https://media.rawg.io/media/screenshots/853/853496600a95d96e2a8c45f7271f512d.jpg", "website": "http://raygungadabout.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 327, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Quantum Duck Studio"], "genres": ["Adventure"], "publishers": ["Quantum Duck Studio"], "esrb_rating": null}