{"id": 59999, "slug": "my-free-farm-2", "name": "My Free Farm 2", "name_original": "My Free Farm 2", "description": "Experience a Unique Farm Game<br/>Your ambition got the best of you: This little plot of land can be shaped up into a thriving farm – you just knew it the first moment you set foot on it. In this entertaining building game, you can be a successful online farmer. You've set lofty goals for yourself: A flourishing farm with its own gastronomic business and extensive productions. Better get started! A wonderful farm simulation full of limitless opportunities awaits you!<br/><br/>An Extraordinary Farm Game – Organize, Structure, Invest <br/>Organize and structure your farm, expand your animal stock, process plant and animal products into sought-after goods for your virtual customers, increase your profits and invest them in the continuous expansion of your farm. Over the course of the game, you'll be able to try your hand at a wide variety of exciting farm game challenges and experience fantastic features:<br/><br/><ul><li>Seasonal events<br/></li><li>Regular updates and patches<br/></li><li>Customizable farm design<br/></li><li>Friendship features<br/></li><li>Expansive quests<br/></li><li>Animal agriculture with cows, pigs, chickens, goats, and more!<br/></li><li>Sowing and harvesting of cereals, fruits, vegetables and other farm simulation crops<br/></li><li>Processing of plant and animal products<br/></li><li>Colorful 3D cartoon setting<br/></li><li>Intuitive controls<br/></li><li>Long-lasting tycoon fun<br/></li><li>New challenges</li></ul><br/>Day and Night on the Farm <br/>Nighttime adds another riveting component to the farm simulation. Certain crops such as mushrooms can only be grown at night. <br/>A beautiful riverside bistro is another intriguing aspect of the game – serve customers with home-cooked meals made from  your farm's produce. The possibilities are endless in this captivating farm game!<br/><br/>Download and Get Started<br/>Start your farming career! Prove your strategic talent in this thrilling farm game – grow and sell crops, keep animals, increase your profits and design your property in the farm simulation. Let's go!<br/><br/>My Free Farm 2 can only be played online. You can link My Free Farm 2 app accounts to your Steam account.", "metacritic": null, "released": "2018-04-03", "tba": false, "updated": "2022-08-30T15:50:36", "background_image": "https://media.rawg.io/media/screenshots/901/9015e27722d05484a675edf9fae23542.jpg", "website": "https://en.upjers.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 144, "dropped": 1}, "playtime": 1, "achievements_count": 40, "ratings_count": 1, "suggestions_count": 271, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android", "PC"], "developers": ["Upjers"], "genres": ["Adventure", "Simulation", "Casual"], "publishers": ["Upjers"], "esrb_rating": null}