{"id": 600064, "slug": "sonic-sphere", "name": "Sonic Sphere", "name_original": "Sonic Sphere", "description": "<p>Sonic Sphere is a stealth/puzzle game that utilises sound mechanics to allow you to avoid your enemies and escape your creators. As a newly manufactured piece of AI the protagonist has been created to test the newest on stealth technology; as the player you are given access to projectiles that rebound around the environment to provide both information and distraction. This information comes in the form of both audio and visual cues that allow you to see objects through walls and see the shape of the environment around corners. The distractions are sound waves that alert enemies and security cameras causing them to focus on where the sound wave came from; these sound waves get dampened through walls and the projectiles gain more distance the longer they are charged. Certain surfaces can stop these projectiles on impact causing them to perform their unique effect and stopping them in place. This creates an interesting puzzle dynamic where the player has to rebound their projectiles to either avoid or target given surfaces.</p><p> Throughout the game you will undergo a series of trials to test out this new technology. Due to the nature of these trials however, you will come to realise that they are merely a puppet and wish to escape the facility; thankfully for you, you have the latest in stealth technology at your fingertips.<br/><br/></p>", "metacritic": null, "released": "2021-05-04", "tba": false, "updated": "2021-05-07T09:21:01", "background_image": "https://media.rawg.io/media/screenshots/61a/61a4f3bf670912c2578f81142a5b34f8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 4, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["KM1888"], "genres": ["Action", "Puzzle"], "publishers": [], "esrb_rating": null}