{"id": 60002, "slug": "virtual-fighting-championship-vfc", "name": "Virtual Fighting Championship (VFC)", "name_original": "Virtual Fighting Championship (VFC)", "description": "What is Virtual Fighting Championship<br/><strong>VFC is an action fighting game that includes both PvP and PvE/Co-op elements.</strong>PvP<br/>In PvP you fight against another player in a square sized free roam arena with your fist and abilities and is done in true fighting game style of combat.Single-player/Co-op<br/>Inspired by 'Dark Soul' stylistic combat experience, and Monster hunter's progression system. Players will venture into a Colosseum arena that is filled with magnificent war machines and robotic warriors, you will be pitted against them and fight for your life and glory. Each win will grant you spoils of the victory, which will be the ingredients for you to craft/conjure better gears which can specialises you in a certain fighting style: may that be melee strength, armour level, ability power, or crowd control specialist, you can use that specialisation and team up with other players to fight in even more epic battles!Word from developer<br/>As it currently stands, VFC in this early access stage is a PvP centric game, featuring a 1v1 cage fight game mode, where two players will teleport into a virtual arena to duke it out. However, rest assured that a fun and compelling single player game modes and Co-op modes will be added to the game progressively after release.<br/><br/>In VFC's final form, competitive PvP element will represent 20-30% of its value, Single-player/Co-op content will be of equivalent 30-40%, and there will also be various fun modes and training modules, which is a place where we want to mesh in all the small good mini game ideas.<br/><br/>Featuring a melee combat mechanism built from the ground up for VR multiplayer, VFC will deliver best of quality of multiplayer content for both PvP and PvE!What are the features in Virtual Fighting Championship at it’s full release<br/><ul><li>1v1 PvP cage fight (exists)<br/></li><li>Global competitive PvP ladder system (exists)<br/></li><li>Single-player one vs many colosseum fight (coming soon)<br/></li><li>Co-op colosseum fight (coming soon)<br/></li><li>Training Mode (coming soon)<br/></li><li>Fun Modes (coming soon)</li></ul>One vs One Cage Fight Mode<br/>You can absolutely do it all: Jabs, hooks, crossovers, Dempsey rolls, fiery fists, lightning strike… you name it, all your favourite reality &amp; fantasy fighting moves can now be done inside the virtual world. You have been granted an injury and jail-free opportunity to brutally smash a ‘someone’, dodging and parry all his/her moves and plotting your own match-winning manoeuvres. Make no mistake, your opponent is a real person, and this next-gen PvP Fighter game was made possible by VR and brought to you by Virtual Fighting Championship.<br/><br/>Players will be choosing one out of an ever expanding pool of ‘avatars’ to fight as, and through the game design of each of those unique character, VFC is able to achieve it’s core design philosophy of allowing players of all fighting calibre to be able to enjoy the game at a competitive level. <br/><br/>For the sake of explaining, let’s pretend that each physical punch you are throwing out to your opponent is like an ‘auto-attack’ in your traditional mouse click action game, then each special ability that we have in VFC will also be comparable to the ‘ability spell’ that costs mana to cast in the traditional mouse clicking games. <br/><br/>In VFC, there will be a diverse range of characters, some will put an emphasis on your actual fighting skills in real life (emphasis on auto attack damage), and some will put an emphasis on your quick wit and tactical thinking (emphasis on smart usage of your ability spells).Current roster of avatars: (Visit https://www.vfcgame.com/game-guide/ to see character description in more detail)<br/><br/>Karl: A taste of true fighter, bring out your true fighting skills!<br/>Poison: Fighting pace manipulator, control the pace of your fight, fight with a strategy!<br/>Fala: A graceful trap master, fight smart and use your ability skillfully!<br/><br/>What VFC brings to the table<br/>1. Frame to frame accuracy in PvP melee combat interactions<br/>     • Each ‘physical assault’ is tracked based on its speed of movement and calculated to quantify their power and hence translate into damage dealt with each hit.<br/>     • A sandbox fighting experience using true physics calculation on the strength of your attacks. You should perform the proper punching technique not because game tells you to, but because it is actually THE better way to win a game.<br/>     • Highly accurate real-time hit-box recognition (many game suffers from this, because VR tracking doesn't perform well under high speed movements, but VFC solved this problem with high satisfaction.)<br/>     • The player can parry, and dodge with highly intuitive sensory accuracy.<br/><br/>2. Real-time body posture reconstruction - enabling all your boxing moves<br/>     • Using only the hand held VR controllers, VFC simulates the player’s body posture using reverse engineering mechanics, so, inside the game, your in-game avatar will track your actual body movements quite closely (of course let's not pretend weird things wouldn't happen haha!)<br/><br/>3. Motion Sickness Free<br/>We have had thousands of game trails with different individuals when we exhibited VFC at 2016 PAX AUS and received only one case of motion sickness response, which we think are an outlier consider our sample size is large enough.<br/><br/><strong>4. Online combat smoothing<br/>It is obvious to many knowledgeable minds, that a fighting game especially in VR requires for a very strict connection speed. VFC has made an attempt to smooth out the game-play even under higher latency environment, and during both our internal and closed beta tests, the results are positive, that even under high latency environment (~250 ping), the game can still be played with a reasonable satisfaction</strong>Supported VR Headsets:<br/>HTC VIVE is fully supported<br/><br/>For Oculus, to get the best experience a 360 degree tracking is optimal, but without 360, the game is still good (we tested the game using only 180 degree tracking, and we felt it played quite well)<br/><br/>We haven't tested extensively for WMR just yet (will do in the near future), but we had a WMR user in our closed beta test, and he didn't experience any major issue<br/><br/>Full body tracking using either VIVE trackers or potentially Kinect tracking for Oculus and other compatible headsets (to enable kicking!) will be added to single-player and Co-op mode later down the road.<br/><br/><br/>*search for tech issue or bug, visit https://www.vfcgame.com/tech-faq<br/><br/>Available for Arcades on SynthesisVR<br/>Available for Arcades on PrivateLabelVR<br/> Available for Arcades on SpringboardVR", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-23T12:11:57", "background_image": "https://media.rawg.io/media/screenshots/3d2/3d2d902b704dc60ba4a3f5093f66b290.jpg", "website": "https://www.vfcgame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 9}, "playtime": 1, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 416, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["L&L Studio"], "genres": ["Action", "Sports", "Indie"], "publishers": ["L&L Studio"], "esrb_rating": null}