{"id": 600001, "slug": "greenstone-town-esi69", "name": "GreenStone Town (Esi69)", "name_original": "GreenStone Town (Esi69)", "description": "<p>GreenStone Town is a free to play online 2D role-playing game, which is being developed by using intersect engine. The game is based on the famous \"Legend of Zelda the Minish Cap\", and it is welcoming anyone who is wishing to have a great time of adventuring and magic.</p>\r\nFeatures \r\n<p>* Real Time Action</p>\n<p>* Battle Arena</p>\n<p>* Amazing PVE</p>\n<p>* Dungeons</p>\n<p>* Bosses</p>\n<p>* Quests</p>\r\nRaces and Classes \r\n\n<p><strong>Humans</strong></p>\n<p>* The Swordsman at the moment is the class that does a very high damage, but nothing that undercut other classes. Damage is instantaneous and without delay. They are great in PVP and essential in dungeons. This class uses different buffs to strengthen themselves as to deal more damage and to tank.</p>\n<p>*The Mage class are the owners of skills extremely powerful, precise and planned. Struggle with a scepter, not always, uses his skills to release. Comprised of great buffs and debuffs,</p>\n\n\n\n<p><strong>Dwarfs (</strong>not added yet but on the future updates)<br/></p>\n<p>*The Engineers are mechanics and inventors who build weapons and utilize technology. They will be capable of using long range attacks for PVE and PVP.</p>\n<p>*The Fighters are known to be solid in the art of war. They wield huge axes that make them formidable opponents in the battlefield..</p>", "metacritic": null, "released": "2021-05-04", "tba": false, "updated": "2021-05-07T09:06:03", "background_image": "https://media.rawg.io/media/screenshots/cb2/cb20babf221044916250e9efbc025218.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 254, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Esi69"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}