{"id": 600191, "slug": "klondike-solvability", "name": "Klondike Solvability", "name_original": "Klondike Solvability", "description": "Description\r\n<p>Developed as a bachelors thesis project for Tampere University of Applied Sciences (TAMK UAS). The game prototype was used as a testbed to develop tools for studying card configuration solvability.</p>\r\nControls &amp; Features\r\n<ul><li>Mouse controls</li><li>The stock scrolls forwards and backwards with mouse wheel</li><li>Pressing mouse wheel (mouse 3), mouse 4, or mouse 5 highlights card solutions</li><li>Double click or right click moves eligible cards to Foundation</li><li>Auto-Stack moves all available cards to Foundation</li></ul>\r\nVisual aids\r\n\r\n<ul><li>Cards with green outline can be solved to Foundation</li><li>Cards with orange outline can only be solved to Foundation. In the picture the C8 blocks both black tens, and as such must be solved to Foundation. The information is passed on recursively down the suit to warn the player.</li><li>Red outline means a card blocks one of the it's solutions cards:<br/>eg. the rightmost Black Jack blocks a Red Queen.</li><li>Yellow outline suggests a lower priority: the leftmost Black Jack should be solved after the rightmost Black Jack is solved first (in most cases).</li></ul>\r\nUnsolvable game detection\r\n<p>The project features a new recursive method of tracing card solution routes available. If all routes are blocked a card is detected as impossible (red). This is used to detect unsolvable card configurations when the cards are randomly dealt. It also detects when a card becomes impossible during a game.</p>\n<p>This recursive method was tested on a sample of 1 000 000 games. 2,4% were detected as unsolvable by the recursive method/algorithm. More complex unsolvable card configurations fall outside the method search space or depth. At least 81% of games are known to be solvable but the upper bound for draw-1 Klondike is unknown.</p><p>The \"New Rare Unsolvable\" -button is a development tool to test the recursive method. It generates new card configurations until it detects an unsolvable one. This feature was used for sanity checks to verify the games the feature detected really are unsolvable. As a human challenge is's a kind of pessimistic challenge in reverse: the game is already lost but you have to figure out why that's the case.</p>", "metacritic": null, "released": "2021-05-04", "tba": false, "updated": "2021-05-07T09:56:34", "background_image": "https://media.rawg.io/media/screenshots/13b/13bbe2ef2084161641c29228d62c5199.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["ForceVoima"], "genres": [], "publishers": [], "esrb_rating": null}