{"id": 60012, "slug": "pathway", "name": "Pathway", "name_original": "Pathway", "description": "<p>FROM THE MAKERS OF HALFWAY...<br />\nTHE YEAR IS 1936...It is a time of global unrest as German military influence is spreading throughout Europe and the Middle East. Rumors of frantic excavations and strange artifacts, not to mention ghastly occult rituals, have begun to surface across secret communication channels...THEY TOOK OUR FRIEND...Morten has vanished. The Nazis took him because he interfered with their occult research. We have to rescue him before it&#39;s too late. And afterwards, who knows what other adventures await?<br />\nKEY FEATURES:<br />\nTHRILLING VISUALS - Classic 16-bit pixel art enhanced with unprecedented depth, lighting and shadows using Pixel/Voxel Hybrid Technology.<br />\nDYNAMIC ADVENTURES - No two adventures are the same; each campaign generates a new procedural map and a different set of unique story encounters.<br />\nTOUGH CHOICES - Every location you visit presents a new hand-crafted story event to explore. Search the well? Save the villagers? It&#39;s up to you!<br />\nDECISIVE CONFLICTS - Use cover and positioning in exciting turn-based squad combat. Learn to maximize your items and abilities, as well as your team members&#39; strengths, in ruthless and clever ways!<br />\nHIDDEN TREASURES - Discover rare artifacts to unlock new content and adventures! Recruit from 16 unique companions, each with their own starting equipment and skill trees!<br />\nWith soundtrack by the critically-acclaimed composer, Gavin Harrison of Halfway fame!</p>", "metacritic": 68, "released": "2019-04-11", "tba": false, "updated": "2023-12-18T12:07:53", "background_image": "https://media.rawg.io/media/screenshots/5be/5bef7d4db9d5ba2e83d94160baf3dcbc.jpg", "website": "http://www.pathway-game.com/", "rating": 3.35, "rating_top": 4, "added_by_status": {"yet": 123, "owned": 778, "beaten": 12, "toplay": 48, "dropped": 35, "playing": 6}, "playtime": 3, "achievements_count": 148, "ratings_count": 50, "suggestions_count": 513, "game_series_count": 0, "reviews_count": 51, "platforms": ["Nintendo Switch", "PC", "macOS", "Linux"], "developers": ["Robotality"], "genres": ["Adventure", "RPG", "Strategy", "Indie"], "publishers": ["Chucklefish"], "esrb_rating": null}