{"id": 600121, "slug": "keizudo", "name": "Keizudo", "name_original": "Keizudo", "description": "<ul><li><strong>Summary</strong>\n<ul><li>Keizudo is a command based visual novel that uses pre-rendered low polygon graphics. It has a sci-fi romance story with cyberpunk aesthetics reminiscent of 90s video games and anime.</li></ul></li></ul>\n\n<ul><li><strong>Content</strong>\n<ul><li>Over 350 pre-rendered 3D CGs\r\n  </li><li>Over 50 original background music tracks\r\n  </li><li>English, French, and Japanese versions\r\n  </li><li>27000 words (English version)\r\n  </li><li>Explorable city\r\n  </li><li>4 mecha\r\n  </li><li>6 characters\r\n  </li><li>Hand drawn portraits\r\n  </li></ul></li></ul>\n\n<ul><li><strong>Story</strong>\n<ul><li>Four people have been granted by a mysterious corporation the power to use giant robots powerful enough to take over the world. Those robots are called Keizudo. The four chosen ones all have completely different views of what would be an ideal world. Therefore, they must fight each other to determine who’s the worthiest of ruling the world.\r\n  </li></ul></li></ul>\n\n<ul><li><strong>Mecha</strong>\n<ul><li>A Keizudo is a machine infused with the soul of a demon allowing it to use demonic power powerful enough to defeat any army in the world. Its appearance is the manifestation of the mind and body of the person who has the ability to control it.\r\n  </li></ul></li></ul>\n\n<ul><li><strong>Characters</strong></li></ul>\n\n<ul><li><strong>Zakumi</strong>\n<ul><li>The main protagonist of this story. He has been granted the ability to control a Keizudo. However, he doesn’t have any desire to rule the world. He just wants to protect the ones he loves.\r\n  </li></ul></li></ul>\n\n<ul><li><strong>Zarius</strong>\n<ul><li>Zakumi’s younger brother. He sees his brother as a rival and wants to become stronger than him. He worked on the creation of the Keizudo. He wants to use the power of Keizudo to destroy the world.\r\n  </li></ul></li></ul>\n\n<ul><li><strong>Akemi</strong>\n<ul><li>Zakumi’s girlfriend and childhood friend. She works at her father’s lawyer agency. She’s also studying to become a lawyer. Her relationship with Zakumi doesn’t seem to be going that well.\r\n  </li></ul></li></ul>\n\n<ul><li><strong>Yayoi</strong>\n<ul><li>Zakumi’s ex-girlfriend. She’s a journalist currently investigating some mysterious organization. Like Akemi, she knows Zakumi since childhood. She seems to still have feelings for him.\r\n  </li></ul></li></ul>\n\n<ul><li><strong>Zagan</strong>\n<ul><li>Zagan’s past is unknown. He wants to use the power of his Keizudo to rule the world with strict laws and control. His ultimate goal is to make everybody equal.\r\n  </li></ul></li></ul>\n\n<ul><li><strong>Zackt</strong>\n<ul><li>Zackt is the opposite of Zagan.  He believes in survival of the fittest, that the most powerful should be on top. He wants to bring chaos and anarchy to the world. There seems to be not much humanity left in him.</li></ul></li></ul>", "metacritic": null, "released": "2021-05-03", "tba": false, "updated": "2021-05-07T09:36:10", "background_image": "https://media.rawg.io/media/screenshots/071/07149905e538199fcb0f83c53f8e5a2d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 419, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mathieu Pronovost"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}