{"id": 600189, "slug": "ford-fiesta-racing-challenge", "name": "Ford Fiesta Racing Challenge", "name_original": "Ford Fiesta Racing Challenge", "description": "Try Sunset Racer 2 Full Version\r\n\n<p>Both these games were produced for Ford and TopGear, a well known motoring program in the UK. The aim of the game was to show the Fiesta as a fun and exhilerating vehicle, as the ZETEC version of the Fiesta really is a sporting little car..<br/><br/><strong>Game II </strong><br/>The second game for TopGear, Ford Fiesta racing Challenge II. It is a 2 lap racing challenge, featuring the new Ford Fiesta Sport. The game has two tracks, and an innovative replay feature, that lets you see a replay of your own best race, or the race from the top player of the High Score boardsl. Click the links below to play the game, or click the picture below, to have a look at some screenshots from the game. <br/><br/><strong>Game I </strong><br/>The Top Gear / Ford - Racing Challenge (TGFR), is a a fairly extensive update of our previous racing game, Smarpis. Updates include everthing from visuals to car behaviour.<br/><br/>In the game, the new Ford Fiesta Sports, is the star, and you can choose one of the four colours the car comes in, as your race car colour. Since the game is produced in conjuntion with an advertorial on the Top Gear website, the game will be available on the Top Gear website during its part of the Ford Fiesta launch campaign.<br/><br/>The game itself is a time challenge, where the aim is to drive four laps in the best time possible. It features a High Score list, where the 100 best times will be shown. Click the links below to play the game, or click the picture below, to have a look at some screenshots from the game.</p>\n\n<p>Thanks For Standalone By Nox... Thanks To Him</p>", "metacritic": null, "released": "2021-05-04", "tba": false, "updated": "2021-05-07T09:55:19", "background_image": "https://media.rawg.io/media/screenshots/e2d/e2dd2c95a7cb7459928e8e24c3f015fd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 23, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Inludo"], "genres": ["Racing"], "publishers": [], "esrb_rating": null}