{"id": 60020, "slug": "5-star-hawaii-resort-your-resort", "name": "5 Star Hawaii Resort - Your Resort", "name_original": "5 Star Hawaii Resort - Your Resort", "description": "Build a Super Luxury Resort with Aloha feeling!<br/><br/><br/>In the 2nd instalment of our \"5 Star Resort\" series Lucy gets a follow-up job from her father, hotel mega mogul Mr. Rich. A new luxury resort is to be built on Hawaii, and management will have to be perfect in the first few months. Guests visiting Hawaii are famous for being notoriously dainty. Lucy accepts the challenge and once again trusts her established team. What Lucy didn't expect: On this hotel project every wish and whim of the guests will be even more important, and when things get rough, she'll have to get involved herself. In lightning-quick time management games you will help her serving the many impatient guests queuing hungrily at the buffet. Will Lucy be able to satisfy their high expectations?<br/><br/>Once again you can look forward to entertaining tasks and exciting challenges with some serious Aloha feeling.<br/><br/><br/><ul><li>Relax Mode<br/></li><li>Build your own luxury resort with 25 buildings <br/></li><li>15 tricky achievements<br/></li><li>Even more holiday feeling and puzzle pleasure<br/></li><li>Time management game: Serve your guests at the buffet just on time<br/></li><li>Helpful Power-Ups<br/></li><li>Hand-drawn Full HD graphics<br/></li><li>100 challenging levels</li></ul><br/>", "metacritic": null, "released": "2018-03-09", "tba": false, "updated": "2019-08-28T21:59:07", "background_image": "https://media.rawg.io/media/screenshots/05c/05cdf51543aff662b93e50004670e366.jpg", "website": "https://www.rokapublish.de", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 5}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 314, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["rokaplay"], "genres": ["Casual"], "publishers": ["rokaplay"], "esrb_rating": null}