{"id": 60024, "slug": "hyperparasite", "name": "HyperParasite", "name_original": "HyperParasite", "description": "<p>It’s the 80’s all over again. Only this time, the human race has more than an obnoxious pop culture to contend with.<br />\nWith World War III nearing its demise, Earth only just begins to catch its breath when it is threatened by yet another menace. Unlike the preposterous mullets of its inhabitants however, this one’s invisible – a parasitic organism capable of making hosts of unsuspecting human beings, consuming what’s left of their souls and wreaking unfathomable havoc.<br />\nAnd it’s spreading. With a vengeance.<br />\nMartial laws have been declared to make way for a global hunt, battle-hardened law enforcers have made allies of the most degenerate of criminals, while the rest of the world is paralysed with paranoia; yet who can be trusted? Who can see it, let alone destroy it? That’s for them to worry about. For you are the enemy.<br />\nYou are the organism with a mission. You are… HyperParasite.<br />\nSnatch. Zap. Repeat.<br />\nFeatures<br />\nRelentless top-down, shoot ‘em up action!<br />\nBeing able to snatch the bodies of nearly every weapon-wielding homosapien you encounter ensures bullet hell almost never ceases.<br />\nIntelligent zapping!<br />\nA happy trigger-finger alone won’t suffice; multiple character classes, host-specific abilities and a skill-based progression system means you’ll be working to one-up the human race even without bullets.<br />\nExtreme level re-playability<br />\nProcedurally generated levels, multiple game-play objectives, grueling waves of enemies and deranged bosses, all while the possibility of perma-death looms; prepare to die. A lot.<br />\nNostalgia<br />\n…perpetuated by a unique 3D-pixelated art style, absurdly bright neons, obnoxious styling and robotic synthesizer sounds. It’s the roaring 80’s alright, with a dash of dystopia.</p>", "metacritic": null, "released": "2020-03-03", "tba": false, "updated": "2023-11-04T21:02:26", "background_image": "https://media.rawg.io/media/screenshots/500/500075705623dbc3ebeb200003a9663b.jpg", "website": "http://www.hyperparasite.com", "rating": 0.0, "rating_top": 3, "added_by_status": {"yet": 1, "owned": 32, "toplay": 6, "dropped": 5, "playing": 1}, "playtime": 2, "achievements_count": 88, "ratings_count": 5, "suggestions_count": 322, "game_series_count": 0, "reviews_count": 5, "platforms": ["PC", "PlayStation 4", "Xbox One", "Nintendo Switch"], "developers": ["Troglobytes Games", "Troglobytes", "Hound Picked Games"], "genres": ["Action", "Shooter", "Adventure", "Indie"], "publishers": ["Nicalis", "QubicGames", "Hound Picked Games", "Troglobytes Games"], "esrb_rating": "Teen"}