{"id": 600330, "slug": "crotyxs-end", "name": "Crotyx's End", "name_original": "Crotyx's End", "description": "<p>Fan game of Destiny: The Dark Below</p>\n<p>The Vox (not the Vex; Vox are the main enemies of a completely separate game I am creating) have taken over Crota's Realm, and have housed one of their strongest HyprenaMinds inside. Push through the hellmouth and to Crota's temple to destroy the HyprenaMind Crotyx. </p>\n<p>Pro tip: when you get the crossbow from one of the three mega enemies during the fight against Crotyx, DO NOT USE IT ON ANY ENEMY EXCEPT CROTYX. The crossbow is the only weapon that can damage Crotyx. I repeat: the crossbows each have 20 ammo, and it takes 60 shots to kill Crotyx, so don't waste ammunition, or you'll have to wait 6 minutes for the crossbow to reload.</p>\n<p>Pro tip: When you get the launcher after killing Crotyx, shoot it as soon as you get it, because it will disable all enemy spawning as soon as you shoot it, then you can finish off all of the remaining minor enemies and finish up the level. It will slightly damage you, but as long as your not on a tiny sliver of health you should be just fine.</p>\n<p>This game was primarily made using the Unity Asset FPS Microgame, which included the scripts, the animation controllers (not the animations themselves, those were provided my Mixamo), the weapon controller, the blaster rifle, the launcher, and a bunch of other stuff. </p>\n<p>Railgun: https://assetstore.unity.com/packages/3d/props/guns/sci-fi-gun-heavy-87878</p>\n<p>Rifle used by Vox soldiers: https://assetstore.unity.com/packages/3d/props/guns/sci-fi-gun-light-87916</p>\n<p>Animations: Mixamo.com </p>\n<p>Crossbow: https://assetstore.unity.com/packages/3d/props/weapons/sci-fi-crossbow-119816</p>\n<p>Railgun sound effect: https://assetstore.unity.com/packages/audio/sound-fx/free-sound-effects-pack-155...</p>\n<p>Recommended songs to play (trust me, makes the game a bajillion times better):</p>\n<p>At the Hellmouth, play \"Into the Pit\" destiny soundtrack.</p>\n<p>As soon as you land in the abyss play \"The Taken\" destiny soundtrack.</p>\n<p>When you exit the abyss play \"The Court of Oryx\" destiny soundtrack.</p>\n<p>When you get inside Crota's temple play \"Long Live the King\" destiny soundtrack.</p>\n<p>When you get to fighting the Deathbringer (after destroying the Deathbringer' s shriekers) play \"Dark Blade\" destiny soundtrack.</p>\n<p>Then, when you actually get to fighting Crotyx, play either \"Siege Engine\" destiny soundtrack on repeat or \"The Archpriest\" destiny soundtrack on repeat, although I personally prefer Siege Engine.</p>", "metacritic": null, "released": "2021-05-04", "tba": false, "updated": "2021-05-07T10:32:30", "background_image": "https://media.rawg.io/media/screenshots/1b2/1b25f6a687b2edeb670ce22e3fb39542.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 9, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["HyperVaxa"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}