{"id": 60043, "slug": "kill-em-all", "name": "Kill 'Em All", "name_original": "Kill 'Em All", "description": "<strong>Developer’s Note:</strong> Yes, you have seen games here with similar looking graphics. Just check out the gameplay footage - you'll see the difference. We are a small indie studio and this little shooter game, born out of our passion for FPS games, is our humble tribute to those evergreen classics. Now let's have some fun killing zombies!<br/><br/><br/><br/><br/><br/>Bored of cover shooters? This is not just another zombie shooter. With miles to run but no place to hide and plenty of zombies to kill. Awesome no?<strong>What’s the story bro?</strong><br/><ul><li>Just another ordinary day in the life of…<br/></li><li>Ka-boom! (cliched random explosion)<br/></li><li>Voila! Instant Zombie Apocalypse.<br/></li><li>Survive now, biatch!</li></ul><strong>What’s in it for me?</strong><br/><strong>Campaign:</strong> Shoot through 10 mind-numbing, screen-shattering, keyboard-banging levels with a neat range of weapons that could probably annihilate the world as we know it. Can you complete them all? In time?<br/><br/><strong>Arcade:</strong> Survive through endless waves of flesh-eating zombies who don't stop and keep on coming. The faster and aggressive you are, the better. As you progress, you’re rewarded with weapon upgrades and ammo drops. The zombies keep on increasing - in number, in speed and damage! Question is, will you survive it all?<br/><br/><strong>Hidden Gems:</strong> There are easter eggs, big and small, hidden across the levels. Do they serve a purpose? Yes! It’s for us to know and for you to find out! Get busy hunting! <br/><br/><strong>&gt;Not-Tip:</strong> You Will Die. Die A Lot!<strong>“I Need More!”</strong><br/>Sure, here’s what’s in store for you:<br/><br/><ul><li>Arcade Maps;<br/></li><li>Multiplayer Mode;<br/></li><li>\"Be-the-Zombie\" Mode;<br/></li><li>Controller Support;<br/></li><li>DLCs.</li></ul><br/><br/>So whatcha waiting for buddy? <br/><strong>Go Kill ‘em All!</strong> <br/>(but first give us your money, ok? wink! wink!) :)<br/><br/><br/>---------------------------------------------------------------------------------------<br/><br/><strong>AppRoarr Studios</strong><br/>AppRoarr Studios is an Indie Game Company founded by Jaskaran Singh based in New Delhi, India. We aspire to become a leader in first-person shooters for the Indian Game Industry.<br/><br/><strong>Support/Disclaimer</strong><br/>You may encounter a few bugs/issues, some of which may be intentional and can act as exploits. But still, do let us know. Feel free to send us any sort of feedback your heart desires - we love players who are polite &amp; constructive. You can reach us at hello@approarr.com.", "metacritic": null, "released": "2018-05-31", "tba": false, "updated": "2019-08-28T21:59:06", "background_image": "https://media.rawg.io/media/screenshots/4c3/4c38728df63beac2ed58451151f11fbf.jpg", "website": "http://approarr.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 238, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["AppRoarr Studios"], "genres": ["Action", "Indie"], "publishers": ["AppRoarr Studios"], "esrb_rating": null}