{"id": 60042, "slug": "fhtagn-tales-of-the-creeping-madness", "name": "Fhtagn! - Tales of the Creeping Madness", "name_original": "Fhtagn! - Tales of the Creeping Madness", "description": "Developer notes<br/>Fhtagn! is intended to be a short, replayable game where you experience ludicrous, action-packed and hilarious stories in a Lovecraftian setting. In short, there's reading involved, not a lot, but if you don't like reading a few sentences of text, this might not be the game for you. If in doubt, we recommend that you watch a few gameplay videos and see if we can lure you to the dark side with one of our knee-slappers!<br/><br/>The game is also short, so expect a game to take about 15 minutes if you're playing on your own or about 30 minutes if you are playing with friends… or enemies. We are fully committed to bring out more stories, Ancient Ones to summon, items and modes, but it is expected that you will rush through these quicker than we can generate content. To help with content fatigue, we encourage players to make use of our Steam Workshop feature to create their own stories and share them with the community, so that we all can enjoy new, fun and silly encounters. If you are interested in creating your own stories, you can check out more information on our Content Creator, on our forum page.<br/><br/>We want your experience with Fhtagn! to be as enjoyable as possible, so please do not hesitate to provide us with any feedback. If you want to just chat, report some bugs or if you find anything misleading on our store page, we'd like to hear from you on our social media or here on the forums.<br/><br/>Thank you for taking the time to read about our game and we hope you will enjoy playing it (seriously if you could read this you'll cruise through the in-game text). <br/><br/>Gameplay<ul><li>You are a cultist intent on destroying the universe by summoning the Ancient One. Why? Damned if we know… <br/></li><li>You can play on your own or with up to 3 friends in couch co-op.<br/></li><li>You have 6 rounds to build up the required stats needed to use the ritual items, but you will need to figure out which stats those are through some trial and error.<br/></li><li>You can visit 1 location per round and attempt the Lovecraftian stories at that location, to improve your stats.<br/></li><li>Finally, put your stats to the test as you try to summon the Ancient One.<br/></li><li>Will everyone pass or fail or will one of you betray the rest and grab all the glory? </li></ul><br/>Features<ul><li>Short and silly events in a Lovecraftian universe.<br/></li><li>Randomized stories based on location.<br/></li><li>Community created content. Experience new stories from the community or create your own.<br/></li><li>Replayability and minimization of content fatigue by giving new or unseen stories a higher chance of appearing.<br/></li><li>Short gameplay, ideal for those downtime moments or while in a queue for another game.<br/></li><li>Non-linear gameplay.<br/></li><li>Multiple endings.<br/></li><li>Multiple Ancient Ones, items and opponents. (Available shortly after release).<br/></li><li>Steam Achievements.<br/></li><li>Steam Cloud Support, to track your progress.<br/></li><li>Play cooperatively or be a backstabbing traitor.</li></ul><br/>Language<br/>Unfortunately, Fhtagn! is only available in English. We currently don’t have the resources to produce the game in other languages, in a way that is authentic and will do the stories and humor in it justice. However, we encourage players to create content in any languages they want and spread the madness that is Fhtagn! We will happily support any UI language localization changes should there be sufficient need.", "metacritic": null, "released": "2018-05-22", "tba": false, "updated": "2019-08-28T21:59:06", "background_image": "https://media.rawg.io/media/screenshots/bc3/bc3ef9c0287ab2ff9c3721a31960e32c.jpg", "website": "https://designimps.com/fhtagn", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 15, "toplay": 1, "dropped": 1}, "playtime": 3, "achievements_count": 43, "ratings_count": 0, "suggestions_count": 404, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Design Imps"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Design Imps"], "esrb_rating": null}