{"id": 60057, "slug": "spacebourne", "name": "SpaceBourne", "name_original": "SpaceBourne", "description": "<p>SpaceBourne is a Space Simulation / Arcade / Open World / RPG game.<br />\nSpaceBourne’s universe has over 100 Solar Systems, over 400 planets and 37 landable Space Stations.<br />\nSpaceBourne is designed so the player can have total freedom. In SpaceBourne the player can mine astroids, salvage wrecks, bounty hunt, discover black holes, come accross space anomalies, become a pirate, discover uncharted systems; as well as following the main storyline, choose to accept side missions, help the races that are at war with each other, create a pirate organization and form his own army, form his own space station and produce ships, or trade. In all of these activities the player gets to make choices, he can choose to trade slaves, of start a war against them and end slavery.<br />\nIn order to accomplish all of this, one needs a good ship. Player character progresses through leveling, acquire new ships, modify the ships, create new and different weapons. ( As of Beta Ver. 5.0, the game has 144 different weapons and the number keeps going up with each update.)<br />\nPlayer Character has active and passive traits. Passive traits ( such as Piloting, Trade, Charisma etc. ) gets better or not according to the playstyle. Active traits on the other hand is left to the player to choose and pick up as the character levels up.<br />\nExcept the main storyline SpaceBourne’s content is randomly generated. Every System is randomly generated at game initialization. This allows for the player to come across different events in every new map. This design choice was made in order to bring replayability to the game and allow the player to encounter different events on same maps.<br />\nSpaceBourne includes 4 distinct races with different ships, and different specialties. There are more than 3.000 entities for you to interact.<br />\nYou can play SpaceBourne with Keyboard &amp; Mouse, Gamepad or JoyStick, the game supports Force Feedback.<br />\nThe Story:<br />\nEverything starts on a regular day of July 2029 with the appearance of an Unidentified Flying Objects. That day is the first day of earth’s residents meeting their new guests. These guests just wait motionless for a long while... their purpose unclear. In order to be ready for the worst scenerio a committee is assembled by the world’s nations, Wolrd Air Defence Platform. One man is chosen to lead this new organisation, a man everyone calls “The Commander”.<br />\nBy February 2030 people start getting sick. This new disease with no cure starts to kill people in a year after its infection. What doctors call HX4, the people call “guest influenza”.<br />\nAt the year 2032 while the world is struggling with the disease, WADP plans an attack against the aliens who are believed to be behind the disease. But they attack first.<br />\nWhile at first heavy casualties are taken, later on under the leadership of the “Commander” great victories start to come. More than 20 enemy ships are destroeyed in the next 3 years.<br />\nBy 2035, three quartes of the world’s population is gone and almost half of the enemy ships are cleared from the skies. While the people await news of a total victory, something shifts the balance... The Commander gets sick.<br />\nAn emergency meeting is held. The doctors increases all research efforts to no avail. Any passing day bring the inevitable closer for the Commander.<br />\n12th of December 2037 it is decided that the Commander is to be frozen until a cure is found. The next day Commander closes his eyes in a sleeping chamber.<br />\nWhen he opens his eyes again, he is in an abondoned space station in Earth’s orbit. The end had come for Earth, and he is still sick. He has tons of questions in his head, but no one around to answer.<br />\nAll he has is a deserted space station with a ship at the hangar, and an infinite universe.<br />\nYou can watch the introductory video of the newspapers from this link:<br />\nhttps://youtu.be/nTdAuBDbpag</p>", "metacritic": null, "released": "2018-10-05", "tba": false, "updated": "2023-02-18T23:20:28", "background_image": "https://media.rawg.io/media/screenshots/80f/80f732a6b70e736bee502707a26fa253.jpg", "website": "https://www.dbkgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 38, "toplay": 5, "dropped": 1}, "playtime": 3, "achievements_count": 29, "ratings_count": 2, "suggestions_count": 502, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Burak Dabak"], "genres": ["RPG", "Simulation", "Indie"], "publishers": ["Burak Dabak"], "esrb_rating": null}