{"id": 600607, "slug": "moenablocks", "name": "Moenablocks", "name_original": "Moenablocks", "description": "<p>Moenablocks is an upcoming 4d block world game in pre-alpha early access. Moenablocks is like other block world games, except that the blocks are 4d hypercubes. The world is in 4d space, and you can move in all four dimensions at once. </p>\n<p>\r\nCurrently there is a singleplayer sandbox mode available, with one terrain type and 30 block types. As development goes on, I'll be adding more content and gameplay, and also an API so people can make their own content and games.</p>\n<p>\r\nMoenablocks is being developed with the Moena 4d game engine. You can find the project page here. By purchasing this game you're also supporting development of the Moena engine — development of these projects is intertwined. I hope you enjoy this game, now and as development progresses.\r\n</p>\r\nGetting started\r\n<p><em>View the quickstart guide (PDF)</em><br/></p>\n<p>Use the <strong>WASD </strong>keys and mouse for primary movement:<br/><br/>\n<br/></p>\n<p>Press<strong> R</strong> and <strong>F </strong>to move along the fourth dimension:<br/><br/><br/><br/>Press <strong>Z</strong>, <strong>X,</strong> or <strong>C</strong> to rotate the slice you are viewing in:<br/></p>\n\n<p>Press <strong>TAB</strong> to change the view:</p>\n\n<p><em>View the quickstart guide (PDF)</em><br/></p>\r\nFrequently asked questions\r\nI don't get it.\r\n<p>\r\nIt takes a while. I'm doing my best to make this game easy to get started with, but it takes time and practice to become familiar with moving a 4d vehicle. Read the quickstart guide and ask questions if you get stuck. Keep at it.<br/>\n</p>\r\nA lot of 4d games are vaporware. Is this going to be vaporware?\r\n<p>No, no it won't. I've put a ton of time into this project and I did not come this far to make vaporware.\r\n</p>\n<p>\r\nI'd like to release a finished product within 18 months. If it takes longer that's fine as long as the people are excited about the progress, but however long it takes I'll be constantly keeping the project moving, putting out updates and talking with the community.\r\n</p>\r\nTime is the fourth dimension, so isn't this a 5d game?\r\n<p>No it doesn't make sense to call this a 5d game. People don't call <em>Mario Bros</em> a 3d game, and they don't call <em>Doom</em> or <em>3d Monster Maze</em> a 4d game. Calling this a 5d game is just going to confuse people.</p>\r\nIs this game like Miegakure?\r\n<p>Yes but there are a lot of differences. For example, this game has a first-person view whereas other 4d games typically have some sort of third-person view. Also, there are options for four-dimensional movement rather than movement being confined to a 3d slice. See the Moena engine page for an explanation on this.\r\n</p>\r\nWill there be a Mac version?\r\n<p>\r\nYes, maybe later this year. There's a lot of stuff to do.\r\n</p>\r\nIs this going to be available on consoles/mobile/VR?\r\n<p>\r\nMaybe. It depends on the success of the game and how much resources I have to continue development and port to other platforms. If there's a large enough outcry for a particular platform I may do a Kickstarter for it.\r\n</p>\n\r\nCurrent state\r\nSystem Requirements\r\n<ul>\n<li><strong>OS: </strong>64-bit Windows 7 or higher / 64 bit Linux\r\n</li>\n<li><strong>CPU/GPU (recommended):<br/>\r\n   </strong>Intel i7 4790S + Nvidia GTX 960 <strong>OR</strong><br/>\r\n   Intel 9th Gen i7 w/ UHD graphics.</li>\n<li><strong>RAM: </strong>8GB</li>\n</ul>", "metacritic": null, "released": "2021-05-03", "tba": false, "updated": "2021-05-07T11:43:40", "background_image": "https://media.rawg.io/media/screenshots/dff/dff2e04011bd24ec76a698042b324be8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 17, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["Medenacci"], "genres": [], "publishers": [], "esrb_rating": null}