{"id": 600641, "slug": "skidstar", "name": "Skidstar", "name_original": "Skidstar", "description": "<p>Five years after the end of the alien wars, veteran fighter pilots,  once viewed as heroes, struggled to integrate with society as the galaxy  sought new forms of entertainment.  Therefore the Skidstar Network was  formed, broadcasting the hottest space fights to an audience of  billions.  Now it’s time to show the galaxy who you are.  Are you a  washed up has been, or the best there ever was?\r\n          </p>\n<p>Skidstar is a classic space combat game featuring:<br/>\r\n • Screen-Wrapping, because of course it does.<br/>\r\n • A charge shot favoring calculated hits over firing wildly. <br/> • Weighty physics that won’t be easy to master.\r\n <br/>• Very fast ships and very fast combat.\r\n <br/>• Brakes if you need them.\r\n <br/>• A button that turns off momentum assists that may or may not have a use. <br/></p>\n<p>Skidstar is the first game of the Synchrocade rollback platform.  Synchrocade is an online multiplayer arcade featuring its own custom rollback netcode. Our goal is to build a strong community of players around an ever-growing library of online pvp games inspired by your favorite arcade games of the 80s.  Online of the Synchrocade platform requires an account at Synchrocade and is bound by the Synchrocade Terms of Service.  This product is a key to register the game to an account for play on the service.  The software for our platform is freely available here, including the ability to play locally for any of our offline compatible games.  We recommend creating an account and trying out our games before purchase.</p>\n<p>If you need help or have any questions, please email support@synchrocade.com or join our Discord.<br/></p>", "metacritic": null, "released": "2021-05-02", "tba": false, "updated": "2021-05-07T11:54:47", "background_image": "https://media.rawg.io/media/screenshots/6bf/6bf98dcf153f386c51b924c73d86aaaa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 32, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Synchrocade"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}