{"id": 600688, "slug": "urbeka-farming-simulator", "name": "Urbeka Farming Simulator", "name_original": "Urbeka Farming Simulator", "description": "<p>You are playing as a field researcher for a large company that researches new species of plants and crops. You are tasked with searching around this new planet nicknamed Urbeka for new species' of plants/crops for research into how they work and what they are capable of. After acquiring new species of plants/crops you can send them back to Earth for money to continue the research operation on Urbeka. Urbeka is a hostile environment much like Mars but we all know what happened to Mars back in 2160. The CEO of the company you work for is hoping this mission will give better results then previous missions because based upon previous scans of the planet hopes are high.</p>\n<p>Hello! My name is Spoons and I worked on this project with a close friend of mine as a submission for Jamulator 2021 - https://itch.io/jam/jamulator-2021 This was our first time creating a game together and thought it came out pretty good. During this game jam we have developed significant interest in perusing a continuous development. So, please any feedback whatsoever is greatly appreciated and we decided if this prototype and story brought enough attention we would continue.</p><p>Discord coming soon!</p><p>Trello Roadmap coming soon if enough interest is gained!<br/><br/></p><p>*Disclaimer*</p><p>Extremely relaxing music ahead of you!</p><p>Radiation is a thing watch out!<br/></p>", "metacritic": null, "released": "2021-05-03", "tba": false, "updated": "2021-05-07T12:09:01", "background_image": "https://media.rawg.io/media/screenshots/f9a/f9a7fe8445160fd51f551e590deec60c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SpoonsTheUtensil", "Kazuto455"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}