{"id": 600762, "slug": "true-king-prototype-heir-to-the-resurrection", "name": "True King (prototype) - Heir To The Resurrection", "name_original": "True King (prototype) - Heir To The Resurrection", "description": "<p><strong>(DISCLAIMER: This is a pre-alpha of a game over 5 years in the making, released here for free under the assumption that it will never be finished. For more information, please read: https://www.fromdustscratch.com/2021/04/true-king-2021-release-faq/ )</strong></p>\n\n<p><em>\"This was supposed to be over a long time ago... you're supposed to be dead...\"</em><br/></p>\n<p>“<strong>True King (prototype)</strong><strong> </strong><strong>– Heir to the Resurrection</strong>” is a hand-painted 3D turn-based strategy RPG for PC platforms.<br/></p>\n<p>The King and Queen of Renatus have been killed. Their newborn child thrown in the river, drowned. The kingdom is now run by a imposter, the False King. Years later, you return, the true heir, resurrected. Rumors spread across the land: “has our King returned?”\r\n</p>\n<p>Travel the open-world fantasy landscape to each town, fighting to free each village from the royal guard. Convince them to join your forces, and challenge the castle with your army. If you fail, be resurrected again, observing the effect your actions had on a evolving population.\r\n</p>\n<p>Do you have the soul of a True King?\r\n</p>\n<ul><li>Play as the rightful heir, lead the villages against their the castle's soldiers, and prepare to seize back the kingdom. A open-world 3D environment, with turn-based strategy gameplay to free each village from the royal guard.\r\n</li><li>Stay in favor of the people, or they will not support you as the rightful king. If you perish, be reincarnated again years later, and observe how the kingdom changes from your actions.\r\n</li><li>(Digitally) Hand-painted characters and environments, pioneering new character-animation techniques.\r\n</li></ul>\n\n\n<p><em>Minimum System Requirements:</em>\n</p>\n<p>CPU: Intel i5 3rd gen or better</p>\n<p>GPU: Intel UHD 620 or better</p>\n<p>RAM: 4 GB</p>\n<p>Storage: 1.9 GB available\r\n</p>", "metacritic": null, "released": "2021-05-03", "tba": false, "updated": "2021-05-07T12:28:10", "background_image": "https://media.rawg.io/media/screenshots/ef9/ef991d22b3347278cd5a274b4f88444f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 121, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dust Scratch Games"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}