{"id": 60077, "slug": "beat-the-song", "name": "Beat the Song", "name_original": "Beat the Song", "description": "You are the one playingMusic at half the volume is playing in the background with different missing instruments. You are in charge of these. If you hit the falling icons at the right time by pressing the right keys, the missing instrument will play. This way you play the song and compose it to its original state.You are the one spoiling itIf you skip some icons or play them too early or too late, you will play these instruments at the wrong time or not at all and the result will be a mess. Not to mention you probably won’t get to the end this way and will lose the game.You are the one who is godIf you persist and take a while to learn the songs, you will get better. You will find that the feeling from playing them is EPIC! In a real band, you would usually play just one instrument and you would have to spend years learning it. In Beat the Song you only have to learn for a few hours (yes, it will seem difficult at first, if you’ve never played a similar game) and you will find that you can “play” any instrument and a different one at any moment! It’s an incredible feeling that you have to experience yourself.You are the one who will discover the beauty of musicShould you hear the songs from this game on radio or play them on the internet, you would probably pass them without noticing. As with 99% of the others. But now that you have the option to “play” them, you will discover their spirit, uncover the sounds you would otherwise miss and find that they are beautiful.You are the one who won’t be understoodWhen you show the game to somebody or if they watch you playing, then in most cases they won’t get what is going on and what’s so great about it. Maybe it can’t even be described. You have to learn it and play.DifficultyDoes the game seem too hard? Try different songs at easy difficulty. Even that is sometimes a bit easier or harder. The right feeling comes with medium difficulty and up.Full length songsMost of the songs are unabridged. You have heard it - “it should be shortened to not be boring, the right song must have such and such length”... No. Why shorten a great experience? Yes, it would be a lot less work to just use shortened versions, but surprisingly with full unabridged songs you won’t get bored and won’t even notice that instead of 30 seconds you play 5 minutes.How to play?", "metacritic": null, "released": "2018-08-28", "tba": false, "updated": "2019-08-28T21:59:05", "background_image": "https://media.rawg.io/media/screenshots/633/633aaf0bf5889fa5b5efacd4dc5e7495.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 259, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["AAAGAMES"], "genres": ["Indie"], "publishers": ["AAAGAMES"], "esrb_rating": null}