{"id": 60081, "slug": "the-8th-day", "name": "The 8th Day", "name_original": "The 8th Day", "description": "Trapped in an abandoned asylum, terror awaits. Behind every corner, an evil presence lurks. The only sense of safety comes from the light.<br/>\r\nExperience The 8th Day, a procedurally-generated, psychological horror for the PC. Get lost in a world that changes every time you load the game, allowing for unlimited replayability and unpredictability at every turn. Navigate to safety while avoiding what lies in the shadows. What will you discover in the darkness?<br/>\n<br/>\r\nFeatures:<br/>\r\nStory Mode: Survive through a classic survival horror experience in a first person perpective.<br/>\r\nWorld: procedurally generated and recursive game-play in a haunted asylum.<br/>\r\nPuzzles: Keys, locked doors and many was to get lost.<br/>\r\nCinematic: Experience your last moments through the eye's of Rex, a Regular Joe in the wrong place at the right time.<br/>\r\nExplore: Search rooms and read logs to find keys and solve puzzles to survive.<br/>\r\nFight or Flee: Engage threats directly or run away to safety in another room or use the light to banish the demos.<br/>\r\nProgress: Saving is limited and restricted. find computers to record your progress.<br/>\r\nStorage: Manage your limited inventory by finding items in lockers and desk drawers.<br/>\r\nDefense: Utilize numerous light sources”flashlight, glow sticks” to banish demons. other light sources will be added in future updates.", "metacritic": null, "released": "2018-08-15", "tba": false, "updated": "2019-08-28T21:59:05", "background_image": "https://media.rawg.io/media/screenshots/b52/b52df544acb1de5849a0b27a4aaf8d69.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 300, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Tainted Games"], "genres": ["Indie"], "publishers": ["Steam"], "esrb_rating": null}