{"id": 600876, "slug": "kaeru-thebigplum", "name": "Kaeru (thebigplum)", "name_original": "Kaeru (thebigplum)", "description": "<p>\"Kaeru\" is a synonym for both \"frog\" and \"return home\" in Japanese.</p>\n<p>Inspired by games like Crypt of the Necrodancer, help your frog return home to their partner while avoiding the dangers that lurk nearby.</p>\n\n<p>Reflection:</p>\n<p>Built for the \"Mini Jam 79: Frogs\".</p><p>Limitations were the theme of \"frogs\" and \"only one level\".</p><p>\"Frogs\" is pretty self-explanatory.</p><p>For  \"Only one level\" I literally interpreted as creating only one level. This level is procedurally generated and you can choose the difficulty which spawns more enemies and has more water tiles. In retrospect, it does come across as having multiple levels... Eh... too late. I should have reinforced that the changes are only difficulty rather than completely separate levels. </p><p>This was my first game jam and my first \"finished\" game. I'm fairly happy with how far I got. I think I bit off more than I could chew in terms of graphics. With that said, I think the concept was great, just the time and my own skill weren't enough to pull it off well. <br/></p>\n<p>In terms of gameplay, I think I got the core mechanics there. I particularly like the missed turn that transitioning from a surface tile to a water tile creates.</p>\n<p>Things I'd liked to have added:</p>\n<p>- Two more enemies (crane and duck) Their mechanics would have differed quite differently.</p>\n<p>- Points system. (eating bugs)  I started implementing this but cut it due to time.<br/></p>\n<p>-General refinement. Especially in terms of graphics.</p>", "metacritic": null, "released": "2021-05-03", "tba": false, "updated": "2021-05-07T12:56:02", "background_image": "https://media.rawg.io/media/screenshots/f1f/f1fb77bdb8ec3085e1c17d49f2642791.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 22, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["thebigplum"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}