{"id": 6008, "slug": "bears-vs-art", "name": "Bears vs. Art", "name_original": "Bears vs. Art", "description": "Greedy millionaires have opened abstract art galleries to display and admire their latest work. Now Rory the bear is ready to fight back against the pointless pieces invading his home!<br/><br/>Bears vs. Art – a puzzling postmodern expression of the fight against subtext, from the creators of Fruit Ninja and Jetpack Joyride!<br/><br/>Discover 150 galleries with exciting puzzles around every corner. Plan your moves carefully or race the clock in timed challenges to destroy every painting on every wall!<br/><br/>Each painting is protected by sneaky security measures including lasers, spikes and mind-bending portals. Not to mention snooty guests, nosy security guards and art-snatching thieves!<br/><br/>Bears vs. Art is fun, furry and free. Try it now and see for yourself!<br/><br/>150 PUZZLES AND COUNTING<br/>More and more added on a regular basis!<br/><br/>FIND ART AND RIP IT TO SHREDS<br/>Abstract art? Subtext? Unbearable!<br/><br/>AVOID CUNNING TRAPS<br/>Roar and roll your way to success!<br/><br/>COLLECT COLORFUL COSTUMES<br/>Gain special abilities that change the way you play!<br/><br/>COMPETE IN EVENTS<br/>Win awesome prizes with new events all the time!<br/><br/>PLAY WITH FRIENDS<br/>Journey together on a grand adventure!<br/><br/>***<br/>IMPORTANT NOTICE:<br/><br/>This game contains optional in-app purchases. You can disable this feature in the settings menu of your device.<br/>View our privacy policy at http://halfbrick.com/pp<br/>View our terms of service at http://halfbrick.com/tos", "metacritic": null, "released": "2015-04-09", "tba": false, "updated": "2019-10-22T14:28:34", "background_image": "https://media.rawg.io/media/screenshots/ceb/ceb7b7bd15daf008fc5ffac3d22c3cd9.jpeg", "website": "http://www.bearsvsart.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 138, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Halfbrick Studios"], "genres": ["Action", "Puzzle"], "publishers": ["Halfbrick"], "esrb_rating": "Everyone 10+"}