{"id": 60093, "slug": "treasure-hunter-claire", "name": "Treasure Hunter Claire", "name_original": "Treasure Hunter Claire", "description": "<p>The battle between the Hero and the Demon King has come to an end and the world was at peace.  However, with monsters still wrecking havoc, humans teamed up with Demons in an effort to subdue the rampaging monsters. In this peaceful world, there lived a Treasure Hunter, the protagonist, Claire. Hearing a rumor of a treasure that could grant any wish, Claire traveled to the fabled land of Alstroemeria. Word of the treasure being in Alstroemeria had caused it to explode with activity. And Claire was not alone, as many other adventurers also came in search of the treasure. She arrived in the town that acted as a staging ground, and as she walked through it, she came across a mysterious shop and met its owner.<br />\nShe introduced herself as Milith, and said that there was treasure at the shrine in the temple to the north.  Claire didn’t fully trust her, but with no other leads, she decided to investigate. The temple had an ethereal air about it, and gave off a strange aura. Regardless, Claire finally arrived at the shrine in the back of the temple. She found something that seemed to be treasure and grabbed it, only to be enveloped in a bright light. Before she knew what was happening, Claire found herself face to face with a beautiful woman. She introduced herself as the Goddess that protects the island, and said that Claire had the power of the Hero within her. She said that while everyone was scrambling for treasure, a villain who sought to bring the world to ruin had also begun to search for it.<br />\nAnd so, she wished for Claire to obtain the treasure before the villain.  The Goddess said that she believed that blood of the Hero was lying dormant within Claire. While performing a ceremony to awaken it, Claire could feel the Hero’s power swelling within her. It was most certainly the power of the Hero. The Goddess explained that the Hero’s power could be strengthened by gathering life essences. Claire would need to gather essences in order to power up. Despite this, Claire vowed to keep searching for the treasure to obtain her wish. And so began her exciting journey with her friends to obtain treasure!<br />\nExperience the biggest RPG of this genre brought to you in native English!<br />\nFeaturesOver 90 Unique CG and Sprites with multiple variationsOver 600 Unique ScenesVoiced Main CastMultiple EndingsMultilayered Corruption SystemClothing SystemA Large Ensemble Cast of CharactersTrading Cards</p>", "metacritic": null, "released": "2018-07-19", "tba": false, "updated": "2024-02-05T18:15:24", "background_image": "https://media.rawg.io/media/screenshots/eec/eec224a6025b22eb13b62906e7d8f99c.jpg", "website": "http://www.kaguragames.com", "rating": 0.0, "rating_top": 5, "added_by_status": {"yet": 4, "owned": 37, "beaten": 2, "toplay": 5, "dropped": 2, "playing": 2}, "playtime": 4, "achievements_count": 0, "ratings_count": 5, "suggestions_count": 222, "game_series_count": 0, "reviews_count": 5, "platforms": ["PC"], "developers": ["Acerola"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Kagura Games"], "esrb_rating": "Adults Only"}