{"id": 600953, "slug": "rescue-rover-collection", "name": "Rescue Rover Collection", "name_original": "Rescue Rover Collection", "description": "<strong>Dogs: Man’s best friend.<br/>Evil Robots: Dog’s worst enemy.</strong><br/><br/>Experience the original Rescue Rover 1 &amp; 2, originally created for Softdisk by legendary developers John Carmack and John Romero, together in one package!<br/><br/>There’s something about your dog Rover that evil robots absolutely LOVE. It seems like every time you look away, those evil robots come around to steal Rover away to their underground hideout. You’ve lost count of how many times you’ve had to go down there, redirect lasers with giant mirrors, rearrange crates, create bridges, and unlock doors to find your beloved dog. Maybe one day those evil robots will cease their dognapping ways. Maybe. Probably not.<br/><br/>Enjoy this pair of whimsical and challenging grid-based action puzzle games where you, the loyal owner of a special dog named Rover, must repeatedly venture into the evil robots’ lair to rescue your stolen pup by foiling traps and mazes designed to keep Rover locked up. Lucky for you, the robots can be outsmarted. Unlucky for you, they’re persistent!<br/><br/><ul><li>Rescue your dog Rover from evil robots across two full games with a combined total of 60 levels.<br/></li><li>Solve fiendishly complex environmental puzzles by redirecting laser beams, moving crates, bridging moats, avoiding security robots, and more to retrieve your dear pup and make it safely back to the exit.<br/></li><li>View hilarious animated cutscenes between stages and whenever you fail a puzzle.</li></ul>", "metacritic": null, "released": "1990-12-31", "tba": false, "updated": "2023-02-08T10:48:24", "background_image": "https://media.rawg.io/media/screenshots/69b/69b8cf4857e573babf5235369a7fec8b.jpg", "website": "https://www.ziggurat.games/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 5, "dropped": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 228, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["id Software", "Softdisk"], "genres": ["Action"], "publishers": ["Ziggurat", "Ziggurat Interactive"], "esrb_rating": null}