{"id": 600952, "slug": "scubaventure-the-search-for-pirates-treasure", "name": "ScubaVenture: The Search for Pirate's Treasure", "name_original": "ScubaVenture: The Search for Pirate's Treasure", "description": "<p>Treasure in the abyss.<br />\nThe wreckage of the Barbosa, one of the last terrible pirate ships to sail in Caribbean waters, rests at the bottom of the sea with its cargo of pillaged gold and valuables. The journal your father left behind before he mysteriously disappeared while searching for the Barbosa’s lost treasure holds the secret to locating its sunken remains. Strap on an oxygen tank and flippers, it’s time to finish your father’s work and go diving for fortune!<br />\nPlunder the submerged wreckage of a pirate ship in this colorful 2D side scrolling underwater action adventure originally developed by Apogee Software Productions for the pioneering PC publisher Softdisk. All manner of deadly sea life, hostile divers, and even spooky ghosts seek to prevent unwary adventurers from obtaining the lost treasure. Will you return to the surface with immense riches, or will you perish along with the pirates in a watery grave?<br />\nScour the wreckage of the Barbosa to find all eight hidden treasures.<br />\nFight off sea creatures and rival divers with your harpoon gun and bombs.<br />\nPlan your route and watch your oxygen level carefully so you don’t run out of air.<br />\nBeware of vengeful pirate ghost bosses who haunt the wreckage to protect their treasure!</p>", "metacritic": null, "released": "1993-12-30", "tba": false, "updated": "2023-02-08T10:43:37", "background_image": "https://media.rawg.io/media/screenshots/bd9/bd9bb997ea3b00058360160ecb6f034e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 6, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 196, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Apogee Software"], "genres": ["Action", "Arcade", "Platformer"], "publishers": ["Softdisk Publishing", "Softdisk"], "esrb_rating": null}