{"id": 601008, "slug": "shoot-bubble-bubble-shooter", "name": "Shoot Bubble - Bubble Shooter", "name_original": "Shoot Bubble - Bubble Shooter", "description": "Shoot Bubble, classical bubble shooter game and poping all bubbles in each level.<br/><br/>Do you know how to crush bubbles?  <br/>Find the bubbles of the same color, aim and shoot, you can eliminate all bubbles on the field. <br/>It is simple and easy to learn and quickly get started. There is no network requirement. <br/>You'll be addticed to shooting bubbles anytime and anywhere, suitable for players of any age.<br/><br/>Are you ready to enter the paradise of Bubble Shooter?<br/>On the basis of the classic bubble gameplay, Shoot Bubble has many innovative gameplay, rich elimination gameplay and interesting crushing rules are waiting for you to discover. It has so many surprise activities to add color to your adventure!<br/><br/>GAMEPLAY<br/>* Classic bubble elimination<br/>Launch the bubbles through the aiming line, more than 3 bubbles of the same color can trigger the smashing effect, which is simple and easy to learn.<br/><br/>* Innovative gameplay with powerful props<br/>There are also many fun and powerful props. Using props reasonably can help you pass the level faster.<br/><br/>* Interesting activities<br/>Pass the levels, become the champion, and get the richest rewards<br/><br/>GAME FEATURES<br/>- 3000+ fun and interesting levels, continuously updated<br/>- Distinctive element design and new gameplay<br/>- Dynamic decompression of crushing sounds and effects<br/>- Rich daily rewards<br/>- Fun activities give you a different experience<br/>- Collect special items and stay first<br/>- Continuous elimination to obtain powerful props<br/>- Challenge the champion to win the biggest reward<br/>- No internet required, you can play anytime, anywhere<br/><br/>Shoot Bubble, a casual game suitable for all ages and can be played in any environment, come and enjoy the leisure time.", "metacritic": null, "released": "2021-04-29", "tba": false, "updated": "2021-05-10T03:19:19", "background_image": "https://media.rawg.io/media/screenshots/d7b/d7b2473f64748844c927c2a9540af232_E7iBoMD.jpg", "website": "http://www.flyyestechnology.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 24, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["FLYYES TECHNOLOGY"], "genres": ["Casual", "Puzzle"], "publishers": ["FLYYES TECHNOLOGY"], "esrb_rating": "Everyone 10+"}