{"id": 601027, "slug": "aglet", "name": "Aglet", "name_original": "Aglet", "description": "You’ve seen Sneaker Shopping on YouTube, right? Your favorite celebrities spending HELLA cash on their favorite sneakers and clothes. When will you get that chance to shop and money isn’t an issue? Well, you’ve got your chance right here on Aglet. The first location-based, virtual shopping game for sneakerheads around the world; and you can play it without leaving your house. <br/><br/>Join sneakerheads and gamers everywhere who are exploring their cities, earning Aglet and building the sickest virtual sneaker collection in the world. Who’s going to become the Sneaker Don and collect all the Holy Grails? DJ Khaled and Lil Yachty won’t want any part of your collection ;) Got what it takes? <br/><br/>Make sure you TURN ON PUSH NOTIFICATIONS so you never miss our VIRTUAL SNEAKER DROPS in your city. Never miss new chances to cop REAL SNEAKERS. <br/><br/>EARN AGLET<br/>You earn our in-game currency, Aglet, by moving and walking through the town. Your steps and swag will be converted into AGLET. Or, find VIRTUAL SNEAKERBOXES placed around your city at special locations. Who’s gonna earn HOV money? <br/><br/>EXPLORE YOUR CITY<br/>Explore your city and go to the dopest spots in your town to FIND AND COLLECT VIRTUAL SNEAKERS USING YOUR MOBILE PHONE. You can find and unbox virtual sneakers at hidden locations and retail stores placed around town. <br/><br/>VIRTUAL SNEAKER SHOPPING<br/>It’s your turn to go sneaker shopping. All those GRAILS you’ve been taking an L on? Get the virtual sneakers versions here on Aglet. Grow your COLLECTION and FLEX your shelf. <br/><br/>COLLECT SPECIAL 1 OF 1 SNEAKERS<br/>Certain sneakers are so limited, there’s only one of them in the world. Good thing we’ve got you covered. The sandals that Jesus wore during the Resurrection? Bet. Neal Armstrong’s boots he wore on the moon? Check. The New Balance that Steve Jobs wore when announcing the iPhone? Put that on wax. <br/><br/>RECHARGE YOUR SNEAKERS<br/>At the freshest retail shops in your area! Your kicks get worn out when you wear them, and it's no different when playing Aglet. When your sneaker starts losing its earning power, hit up your local sneaker and streetwear shops, as well as special locations in your city to recharge for additional power. <br/><br/>FIGHT IT OUT<br/>COMPETE against other SNEAKERHEADS around the world in a VIRTUAL SNEAKER BATTLE ROYALE to solve clues, check-in to destinations, and WIN SOME REAL heat. Yeezys, Jordans, Air Max, etc. Gotta EARN your keep on Aglets. No bots here. <br/><br/><br/><br/>Notes:<br/>- This app is free-to-play and offers in-game purchases. It is optimized for smartphones.<br/>- We recommend playing while connected to mobile data or Wifi in order to obtain accurate location information.<br/>- Compatibility is not guaranteed for devices without GPS capabilities or devices that are connected only to Wi-Fi networks. This is not going to rock on an iPhone 6, OK?<br/>- Compatibility information may be changed at any time.<br/>- Compatible with iPhone® 7 / 7 Plus / 8 / 8 Plus / devices with iOS Version 11 or later installed.<br/>- Not compatible with 5th generation iPod Touch devices or iPhone 6S or earlier iPhone devices.<br/>- Continued use of the GPS in the background can reduce battery life, but it is much better these days!<br/>- Compatibility is not guaranteed for all devices.<br/>- Information current as of March 17, 2020.", "metacritic": null, "released": "2020-04-11", "tba": false, "updated": "2021-05-10T03:28:55", "background_image": "https://media.rawg.io/media/screenshots/20b/20b7f2124322dbb0164e0070429eb7eb.jpg", "website": "https://www.aglet.app", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 53, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Onlife"], "genres": ["Adventure", "Strategy"], "publishers": ["ONLIFE"], "esrb_rating": "Teen"}