{"id": 601054, "slug": "solitaire-my-farm-friends", "name": "Solitaire - My Farm Friends", "name_original": "Solitaire - My Farm Friends", "description": "Solitaire - My Farm Friends is a classic card game (also known as Klondike or Patience) with AMAZING farm theme. With dozens of cute animal friends to play with, you can not only enjoy the classic solitaire game to keep your brain sharp but also collect dozens of cute little animals to build your UNIQUE farm.<br/><br/>Besides the classic solitaire challenges, there are dozens of cute animals (such as lambs, cows, spotted dogs, bunnies, roosters, horses, etc.) for you to make friends with,  and more animal friends are waiting for you to discover.<br/><br/><br/>HIGHLIGHTS<br/><br/>Creative Solitaire Game<br/>Based on the classic solitaire game (also known as Klondike or Patience), the vibrant \"Farm Friends Land\" is ready for you to collect dozens of cute animals. And you can play with your animal friends to build a UNIQUE farm of your own.<br/><br/>Challenging Deals<br/>Besides the classic Klondike or Patience games, there are plenty of challenging card games to train your brain by completing challenging daily challenges. You can earn magnificent medals for completing the daily challenges. The more you complete, the more medals and rewards you'll get.<br/><br/>Interesting &amp; Special Events<br/>There will be plenty of special events for you and it will always make you fresh to this game. Don't forget to enjoy the fun time and participate in the events and get extra rewards.<br/><br/>Unique Cards &amp; Animations<br/>All cards(both card backs and card fronts) and animations have been delicately designed. You can get them by collecting enough stars to open \"Star Chests\" or purchase them with game coins.<br/><br/><br/>CONTACT US<br/>Please try to email us winy questions or feedback to [support@kinggame.freshdesk.com]. Once received your emails, there will be a specialist to answer any questions as soon as possible.<br/><br/><br/>If you like classic card games, you'll love this classic Klondike or Patience card game with the farmhouse theme. Don't hesitate to download and explore more creative features of this amazing solitaire game NOW!", "metacritic": null, "released": "2021-02-23", "tba": false, "updated": "2022-11-18T07:45:38", "background_image": "https://media.rawg.io/media/screenshots/8f0/8f0f2fdaefc0bd67f5b88cfb61bbf28b.jpg", "website": "https://games.seeyatech.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 136, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["Kings Solitaire Game", "SEEYA"], "genres": ["Card", "Puzzle"], "publishers": ["Seeya Technologies"], "esrb_rating": null}