{"id": 60114, "slug": "unsolved-stories", "name": "Unsolved Stories", "name_original": "Unsolved Stories", "description": "Welcome to Unsolved Stories which adorns the open world games  with next generation graphics. Chicago is an exciting and fascinating city with its absolute beauty, history and great locations. The very first part, prepared for Unsolved Stories presents the whole glory of Chicago to you. New generation, highly detailed, stunning graphic engine will portray the magnificent atmosphere of the city. You can visit the most beautiful parks of the city. From the magnificent waterfront skyscrapers to the mess of the ghetto neighborhood. Freely explore the crowded and spectacular environment of the city besides its deserted and abandoned places. In each added new episode, you will find the story of a character and its game play. Unsolved Stories offers you an exciting and fascinating environment of the city in which you can use \"First Person\" view.<br/><br/><strong>Current Build</strong><br/>A small part of the original map is the Goose Island region 5.<br/>You can see the atmosphere of the game and the dynamic lighting system.<br/>You can freely navigate through the first person's point of view.<br/>Single Player : Free For All game mode prototype has been added to the current version. In this mode you can play against boots.<br/>Single Player : Free Roam Mode has been added to the current version. In this mode you can freely navigate. You have a Mad Hound M15 weapon.<br/>Single Player : Camera Rec Mode has been added to the current version. In this mode you can freely navigate. You have a camera and a flashlight.<br/>Multiplayer : Free For All game mode prototype has been added to the current version.<br/>Multiplayer : Team Death Match game mode prototype has been added to the current version.<br/>Single Player : New Free Roaming Mode prototype has been added to the current version.<br/><br/><br/><strong>Future Content</strong><br/><br/>LandScape with City Roads 10km X 10km - Completed<br/><br/>Building exterior and environmental designs - Completed<br/><br/>Building interior - Incomplete<br/><br/>Sky and day-night cycle system - Completed<br/><br/>Weather system for rain and snow - Incomplete<br/><br/>Water and river system - Completed<br/><br/>Underwater spaces - Incomplete<br/><br/>Underground channels - Work In Progress<br/><br/>Dynamic Global Illumination - Completed<br/><br/>HBAO+ Horizon-Based Ambient Occlusion - Completed<br/><br/>Volumetric Lighting - Completed<br/><br/>First Person and Third Person views. - Work In Progress<br/><br/>Weapon pick-up and drop-down system - Work In Progress<br/><br/>Weapon Recoil system - Work In Progress<br/><br/>Driving and traffic system - Work In Progress<br/><br/>Character basic movement system - Work In Progress<br/><br/>Character advanced movement system - Cover - Work In Progress<br/><br/>Character advanced movement system - Ladder - Work In Progress<br/><br/>Character advanced movement system - Evade - Work In Progress<br/><br/>Character advanced movement system - Slow Motion - Work In Progress<br/><br/>Character advanced movement system - Energy - Work In Progress<br/><br/>Character advanced movement system - Injury - Work In Progress<br/><br/>Door opening / closing system - Work In Progress<br/><br/>Quick Time Event system - Work In Progress<br/><br/>Crowd animation and AI system - Work In Progress<br/><br/>Multiplayer Game Types - Planned<br/><br/>Adventure-Based Story Episodes - Planned<br/><br/>And Many More !!!", "metacritic": null, "released": "2018-03-14", "tba": false, "updated": "2019-08-28T21:59:04", "background_image": "https://media.rawg.io/media/screenshots/799/799eba63f87c0fcdf44e771d9fae92fe.jpg", "website": "http://madhoundgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 361, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MadHoundGames"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["MadHoundGames"], "esrb_rating": null}