{"id": 601635, "slug": "an-laoch-ri", "name": "An Laoch Ri", "name_original": "An Laoch Ri", "description": "<p><strong>The Historical Arthur and the Battle for Britain!</strong></p>\n<p><em>“Then it was, that the magnanimous Arthur, with all the kings and military force of Britain, fought against the Saxons.  And though there were many more noble than himself, yet he was twelve times chosen their commander, and was as often conqueror. ” – Nennius</em>\n</p>\n\n<p><strong>An Laoch Ri, The Warrior King</strong>\n</p>\n<p>An action packed abstract level turn-based combat game that puts you in command of Arthur and the Britons battling against Saxon expansion and Pict Rebellion during the early period of the Dark Ages in Britain.\r\n</p>\n<p><strong>Dark Ages Britain…</strong>\n</p>\n<p>Savage war bands, ominous dark forests, rising mists, moon lit raids, battle standards rippling in the breeze, camp sites and buildings ablaze, carnage littered battle fields… The Dark Ages!\r\n</p>\n<p>Striking fully animated 3D Graphics, Immersive Sound and Special Effects, all combine in an action packed Medieval combat game that brings a sense of immediacy and danger at every turn.\r\n</p>\n<p>A ‘feast for crows’ indeed!\r\n</p>\n<p><strong>Dragon vs Wolf…</strong>\n</p>\n<p>Intense Medieval combat within an accessible quick play game system that keeps you involved and keeps the battles moving.\r\n</p>\n<p>While staying true to turn-based mechanics, the system’s command activation and initiative control system reflects the uncertainty of early Medieval combat while maintaining engaging play.\r\n</p>\n<p>The game’s abstracted level and focused scenarios will have your attention from the very first turn. Randomly generated forces and positions add to the game’s replay value.\r\n</p>\n<p><strong>Game Features:</strong>\n</p>\n<p>– From the initial raids along the Glein and Dublglas to the pitched battles of Agned and Badon Hill, ALR includes ten scenarios covering the Battles of Arthur as chronicled by Nennius in the 8th century.\r\n</p>\n<p>– AI Assisted Command, Movement, Combat, Rallying, and Objective capture, allow you to command your forces with just a few clicks of the mouse.\r\n</p>\n<p>– Beautifully rendered battle maps, fully animated units including Warriors, Riders, Shield Walls, Skirmishers and War Wolves!\r\n</p>\n<p><strong>An Laoch Ri The Warrior King</strong>\n</p>\n<p>Platforms: Windows (DX9+) DeskTop (Mac OSX Version available at the AppStore)</p>", "metacritic": null, "released": "2021-05-08", "tba": false, "updated": "2021-05-10T06:19:21", "background_image": "https://media.rawg.io/media/screenshots/df3/df307056afe9427d548749069a32dbb4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 287, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["digitalGameworks"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}