{"id": 6016, "slug": "smash-frenzy-2", "name": "Smash Frenzy 2", "name_original": "Smash Frenzy 2", "description": "___________<br/>Reviewers said:<br/><br/>&amp;quot;...Think EA’s Boom Blox meets Atari’s Breakout... Definitely a winner for both adults and kids alike, especially considering how much gameplay you get for the price. &amp;quot;<br/>Arthur Datangel, appofmyeye.com<br/><br/>&amp;quot;Ever feel like causing mass destruction, in a brick-breaker game type manner, but don’t feel like going to jail? I think I have found the solution to your predicament, and it’s called Magic Ball 2.&amp;quot;<br/>Kevin, appinspectors.wordpress.com<br/>___________<br/><br/>Magic Ball 2 gives you a ball, a paddle and a pile of bricks, and then sets you loose to indulge your destructive sensibilities. The 3D levels in this out-and-out assault on the senses seem to pop out of the screen, immersing you in the action and allowing you to launch missiles, rack up points and put multiple balls into play. Magic Ball 2 ups the ante even further with explosive bricks, fireballs, teleporters and more insanely fun ideas! Best of all, Magic Ball 2 is easy to play, making it a favorite of gamers worldwide!<br/><br/>GAME FEATURES: <br/>◇ 100 levels featuring real-world objects and locations<br/>◇ Creative powerups and weapons<br/>◇ On-screen characters <br/>◇ Stunning and colorful 3D graphics<br/>◇ 3 controls type: tilt, touch and buttons<br/>----------------------------------------- <br/>STILL NOT CONVINCED? Try the Lite version for FREE by searching for &amp;quot;Smash Frenzy 2 Lite&amp;quot; in the App Store. <br/>----------------------------------------- <br/>More fun games from Alawar: <br/>★ TANK-O-BOX – Play our action-packed remake of a classic arcade battle tank game!<br/>★ GOURMANIA – Become the world&amp;#39;s top chef in this addictive hidden object smash hit!<br/>★ THE TREASURES OF MONTEZUMA – Trigger Power Totems in this dazzling match-three adventure!<br/>★ HAMLET – Mayhem and hilarity ensue as you save the day in this eccentric puzzle adventure game!<br/><br/>For more games, visit us at iphone.alawar.com! <br/>----------------------------------------- <br/>FIND US in FACEBOOK: AlawarEntertainment <br/>FOLLOW US in TWITTER: @AlawarMobile <br/>Be the first to hear about our new games and awesome contests!", "metacritic": null, "released": "2009-04-14", "tba": false, "updated": "2019-10-22T14:28:34", "background_image": "https://media.rawg.io/media/screenshots/340/340df270f55570d8f034e4cd0ca019fd.jpeg", "website": "http://iphone.alawar.com/?p=19", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 119, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Alawar Entertainment"], "genres": ["Action", "Arcade"], "publishers": ["Alawar Entertainment"], "esrb_rating": "Everyone 10+"}