{"id": 601640, "slug": "petipave-11", "name": "Petipavé 1.1", "name_original": "Petipavé 1.1", "description": "<p><strong>Je vous explique le jeu Petipavé  :</strong></p>\n<ul><li>Nota : Le mode 1 joueur a été implémenté mais il me semble buggé. </li><li>C’est un jeu de carte très très simple. Il n’y a que 2 joueurs. Chacun a un certain nombre de carte en pioche et un certain nombre de carte visibles à la fois. \r\n</li><li>Au début, vous pouvez choisir le niveau (qui va donner le nombre de case de votre grille et le nombre de carte de votre main).</li><li>Vous pouvez choisir le nombre de joueur humain avec les touches droites et gauches</li></ul>\n<ul><li>La grille de jeu fait de 2x2 à 6x6 (3x3 par défaut) et vous devez y placer votre pioche pour faire le plus haut score. </li><li>Les cartes possèdent 4 nombres (en haut, en bas, à gauche et à droite) allant de 0 à 9. Une fois la carte posée, on compare les valeurs horizontales et verticales. \r\n</li><li>Le nombre de pixel du symbole présent sur un des coins de la carte représente sa force (1 pixel = 1 de force, par exemple). La force va de 0 à 9</li></ul>\n<ul><li>Si vous battez au moins une carte, vous gagnez un point et cette carte disparait de la grille centrale. Sinon, pas de point et votre carte disparait. En cas d’égalité, aucun point et aucune carte ne disparait.\r\n</li><li>Le jeu se termine quand il n’y a plus de carte en pioche ou qu’il n’y a plus de place sur la grille.\r\n</li></ul>\n<ul><li>Pour sélectionner une carte ce sont les touches haut et bas. Pour sélectionner une case de la grille, c’est haut, bas, gauche et droite. Pour validez un choix, c’est toujours « X ». Vous pouvez revenir sur la selection d’une carte en appuyant sur « C ».\r\n</li></ul>", "metacritic": null, "released": "2021-05-08", "tba": false, "updated": "2021-05-10T06:20:32", "background_image": "https://media.rawg.io/media/screenshots/730/730ccb647fc0f9fdb9754e82384d8b54.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 29, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Android"], "developers": ["David PETIPAS"], "genres": [], "publishers": [], "esrb_rating": null}