{"id": 60181, "slug": "internet-simulator", "name": "Internet Simulator", "name_original": "Internet Simulator", "description": "Welcome to Internet Simulator's store page!<br/>In the game you can browse the Internet from beautiful locations, interact with the computer and the environment. <br/>The game will evolve a lot, and I was thinking about launching it in Early Access, but it's better for me to go with full release model, just keep in mind that game willl evolve extremely.<br/><br/>Description of the game at the moment:<br/><br/>-Ability to browse the internet via a virtual computer<br/>-OS on the computer with mail and gallery, PC can be turned off via a button within the OS interface<br/>-Comments when you visit certain web-sites<br/>-3 Levels to choose from (much more to come)<br/>-Interactivity and a feature of the level \"Room\" - you can turn on and off the lights, turn off the computer through the PC case, and you can also kill the character forcing him to jump out the window.<br/>-Interactive objects that can be moved<br/>-Ability to walk, run, sit on a chair <br/>-Steam Achievements<br/>-Ability to pray to Putin and get money for that (Tab to pray, E to stop praying)<br/>-Ability to buy furniture for that money in online store<br/>-Ability to call dancers<br/>-3 different characters<br/>-2 camera modes<br/><br/>Current levels:<br/>-Room<br/>-Toilet<br/>-Beach<br/><br/>The main goals of this project are to give a person an ability to browse the internet from really bueatiful places. To relax, escape from reailty being surrounded by mountains.<br/>It's a place where you can morally rest, forget about everything. Just be surrounded by beauty, believe what you find there and for example watch movies or listen to relaxing music. You can even use forums and imageboads inside this game.<br/>In a few months after release next to the player there will be optional to sit a friend (female or male AI) that will comment on the sites on which the player enters. With a friend you can also talk on different topics, and I'll try to make as many dialogs as possible so that the player won't be sad from the fact that his friend is just an AI.", "metacritic": null, "released": "2018-03-15", "tba": false, "updated": "2019-08-28T21:59:01", "background_image": "https://media.rawg.io/media/screenshots/7e3/7e3234539c7828e3e4b9d2e2120cfa6c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 24}, "playtime": 1, "achievements_count": 19, "ratings_count": 0, "suggestions_count": 324, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Regime X"], "genres": ["Simulation", "Indie"], "publishers": ["Regime X"], "esrb_rating": "Adults Only"}