{"id": 60184, "slug": "the-loop-vr", "name": "The Loop VR", "name_original": "The Loop VR", "description": "<strong>The Loop </strong>-  escape room game, which is closely intertwined with the traditional for this genre gameplay, a surreal story, flavored with Virtual Reality technology, which creates a truly unique gaming experience.<br/><br/><strong>Open your mind for the brand new story:</strong><br/>Office. A routine work of messenger boy. Serve, bring, give, and so on to. The Wheel of Sansara has gone on a new turn, but you still rub pants at the stuffy warehouse day by day. Manager stalking with new orders. The mind continues to fade into white torture chambers, but one day everything would change. Chain of mad events will carry you away into its vortex only those whose mind is open.<br/><br/><strong>Features:</strong><br/>- Cold story, in which you will take on the role of 3 different people and learn their story.<br/>- Full immersion in the game by use the VR technology.<br/>- The game is full of mysteries, the solution of which will help you to learn the history of each character.<br/>- Three stories closely related to each other through the fabric of space and time.<br/>- Playing with reality - every turn of the camera. You'll never guess what's waiting for you around the corner!<br/>- Three completely different locations with their unique design: the office, the abandoned prison and the laboratory hide many secrets.<br/>- Dark and deep music create and support a game-induced suspense", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:59:01", "background_image": "https://media.rawg.io/media/screenshots/897/89708bd171977dcbd295b64b622b1200.jpg", "website": "http://judasbrothers.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 234, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Judas Brothers", "Rassco"], "genres": ["Action", "Adventure", "Simulation", "Indie"], "publishers": ["Judas Brothers"], "esrb_rating": "Adults Only"}