{"id": 60191, "slug": "bulletwitch", "name": "Bullet Witch", "name_original": "Bullet Witch", "description": "<p>First, there was the earthquake. Then the war, then the plague, then the riots. In the span of a few short years, humanity suffered every disaster imaginable — and all as a prelude to the one we couldn&#39;t have imagined.<br />\nAn army of literal demons marched straight out of Hell, trampling over the survivors wherever they found them. When they killed, they wore their victims&#39; skins. When they conquered, they seized their enemies&#39; weapons. Powered by supernatural evil and loaded with military hardware, they scattered us and ran us down.<br />\nBut then she came. At first, we thought she was one of them — a woman in black, with a long gun like a witch&#39;s broom and the magical powers to match. Survivors whispered her stories in the alleyways: stories of battles so intense that they leveled whole city blocks, during which she mowed down entire demon regiments with flaming bullets, then shared her own blood to save the wounded. They say she can summon clouds of ravens, call up thorns from the ground, and even conjure up lightning and tornadoes at will.<br />\nMaybe she flew down from Heaven. Maybe Hell spat her back out. Either way, she&#39;s all we&#39;ve got.<br />\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~<br />\nFirst released on the Xbox 360 in 2006, Bullet Witch offered a unique combination of Japanese dark-fantasy aesthetics and Western-style military action. This PC re-release brings the title to a new generation of gamers, improving the resolution, framerate, lighting, and game balance.<br />\nAfter an army of demons takes over the world, the human resistance is on the brink of collapse. Just when all hope seems lost, a woman in black appears on the battlefield. She possesses a long gun like a witch&#39;s broom and an array of magical powers to match. Taking on the role of this mysterious savior, Alicia, you’ll fight through hordes of demon soldiers, mutated civilians, and even giants.KEY FEATURES<br />\nThis Is My Broomstick<br />\nAlicia&#39;s gunrod can transform on the fly into four different weapons, each of which can be enchanted for extra punch and special perks. Mow down enemies to charge your magic meter, then can call down thunderbolts, tornadoes, and even meteors to blast the rest of them to kingdom come. Few gaming heroines have ever wielded as much raw power as Alicia at her peak.<br />\nThe Path of Destruction<br />\nNothing is safe from your wrath, least of all the environment around you. Your magic can tear the roofs off of buildings, ignite an entire gas station, or level towers. If any enemies survive, use your telekinesis on the rubble to throw it at them and crush them flat.<br />\nYou Are Not Alone<br />\nYour strength and bravery will inspire the battle-hardened resistance fighters around you, and soon enough, they&#39;ll fight by your side. Use your magic to keep them alive, and they just might return the favor.<br />\nAll DLC Included<br />\nThe PC release of Bullet Witch includes all the original game&#39;s costumes and bonus missions for free. (Beat the game once to unlock the latter; the costumes are available from the start.)</p>", "metacritic": null, "released": "2006-07-27", "tba": false, "updated": "2024-01-23T12:13:05", "background_image": "https://media.rawg.io/media/screenshots/5fb/5fbad757fa71162546f26440d62e966a.jpg", "website": "http://bulletwitch.com", "rating": 3.18, "rating_top": 4, "added_by_status": {"yet": 19, "owned": 205, "beaten": 15, "toplay": 8, "dropped": 9}, "playtime": 3, "achievements_count": 35, "ratings_count": 34, "suggestions_count": 572, "game_series_count": 0, "reviews_count": 34, "platforms": ["Xbox 360", "PC"], "developers": ["Marvelous", "MarvelousAQL"], "genres": ["Action", "Adventure"], "publishers": ["XSEED Games", "Marvelous USA", "Marvelous", "XSEED"], "esrb_rating": null}