{"id": 602278, "slug": "anna-the-series-test", "name": "Anna: The Series Test", "name_original": "Anna: The Series Test", "description": "<strong>Welcome to the Anna Series test Volunteer! Dr Alleyne thanks you for your participation!</strong><br/><br/><br/><br/>Confused, alone and suffering from chronic narcolepsy you awake in the presence of the sadistic Dr Alleyne who informs you that you agreed to volunteer in her psychological experiment testing the humanity of artificial intelligence in exchange for a hefty sum of credits. That sounds like something you would do, right? It must be because you're here and you don't remember anything from before. So, where is here exactly and what's your job?<br/><br/>The Anna series test is set in five stages with five different participants, artificially intelligent replicas of a real person. To push through Alleyne's test and make it out the other side, hopefully alive, you'll have to converse with the replicas. Follow their stories and make them believe they are human. The complication? Only one replica is needed to end the test.<br/><br/>Each phase Dr Alleyne will have you power down one of the machines. Removing them from testing and ending their stories. Sounds simple enough on paper. Flick a switch and turn off a machine. But you've got to know these women, their stories, their lives, seen their humanity. Can you bring yourself to keep flicking the switches? Can you separate their humanity from your own? Should you feel guilt for sentencing a machine to an unknown fate? <br/><br/>Take a psychological trip into Alleyne's deprived test of mental stability to find out. Good luck Volunteer. <br/><br/><br/><br/>Anna: The Series Test! How will you fare?<h3>Features</h3><ul><li> Every choice matters! Each play-through is unique to the choices you make and the way you make them.<br/></li><li> Feel human! Detailed stories, characters and personalities make each replica feel human. Feel real. <br/></li><li> The replayability, experience everything! Your choices drastically change the test, meaning not every story can be completed in a single play-through. Making the game re-playable many times over.<br/></li><li> 15+ different unique endings! Based off how you play you. Some bad, some good. The story all yours to create.<br/></li><li> Fantasy mode! This adult mode becomes available after one completion. Replay the game again, make different choices or not, but this time around the woman are nude throughout. Plus the stories vary fitting the more adult theme.<br/></li><li> One playthrough up to the end of early access is 5+ hours, not including the replay value and fantasy mode.<br/></li><li> 2 different dateable women! Romance options are available if you choose to pursue them.<br/></li><li> Active pathing varies each story, each phase! Example; speak to girl 1 to get one version of her story, but speak to girl 2 before 1 and the story changes. <br/></li><li> Special events! Expand on the base story by accessing special events each phase if you speak to the girls in the right order and make the right choices.<br/></li><li> Full HD renders and animations!<br/></li><li> Adult themes, nudity and sex! What's an adult game without adult themes. All are story based and make sense to your choices.<br/></li><li> Currently there are over 2500 renders in this game, plus shorts videos. Climbing with each update and phase.<br/><br/></li></ul>", "metacritic": null, "released": "2021-05-10", "tba": false, "updated": "2021-05-14T02:44:09", "background_image": "https://media.rawg.io/media/screenshots/ea4/ea4ca5d76f0740429875ffe0974fef5b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 513, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["AnnaSeries"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["AnnaSeries"], "esrb_rating": null}