{"id": 602263, "slug": "the-exaggerated-epoch-of-edward-ohare", "name": "The Exaggerated Epoch of Edward O'Hare", "name_original": "The Exaggerated Epoch of Edward O'Hare", "description": "Assume the role of Edward O’Hare, reliving his younger years with his son Alex and his grandson Colin as his small, mundane tales become larger than life epics before their very eyes. Small rats become vicious beasts, creeks become roaring rivers, and school buses become terrifying metal monstrosities. Edward will be jumping, fighting, and puzzling his way through a variety of environments, all made from the toys of his grandson listening along to the story. <br/>\n<br/>\r\nPlayers are given a variety of weapons to aid them in the adventure. Each has their own unique combos that can be combined together for extremely powerful attacks. Break shields, toss them into the air, or land an attack from mid air. The enemy roll call includes rats that can swarm you or charge you using their sturdy shields, and other children's toys turned sinister foes! <br/>\n<br/>\r\nThese weapons are also used to solve different puzzles via different buttons and other obstacles. Push blocks (or hit them with your trusty hammer) to open doors, or use your spear to reach those buttons beyond your reach. <br/>\n<br/>\r\nThe Exaggerated Epoch of Edward O’Hare is driven by its third person action and its narrative that encompases the three main characters. As the story and the gameplay progress, we learn more about these characters and watch their relationships grow.", "metacritic": null, "released": "2021-05-13", "tba": false, "updated": "2021-05-14T02:35:14", "background_image": "https://media.rawg.io/media/screenshots/c8b/c8b8ff5ee60fbea55dae21fc58b78e3b.jpg", "website": "https://storyendstudios.wixsite.com/storyendstudios", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 144, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Storyend Studios"], "genres": ["Action", "Adventure"], "publishers": ["Storyend Studios"], "esrb_rating": null}