{"id": 602260, "slug": "vr-fight-covid-19", "name": "VR Fight COVID-19", "name_original": "VR Fight COVID-19", "description": "n 2020, the new crown pneumonia has swept the world. In order to save people in pain, Dr. A has developed nano-robots that can enter the body to eliminate viruses. Everyone hopes that nano-robots can help them get rid of the disease.<br/>\r\nPlayers will incarnate nano robots into the human body to destroy all kinds of viruses. They are big and small, some are meek, some are violent, find virus zero and destroy it, you will save a person. Note: Don't hurt your red blood cells, the new coronavirus and HIV will attack you.<br/>\r\nPlayers shoot various viruses with guns, including Staphylococcus, Bifidobacterium, Haemophilus, Coronavirus, Rabies virus, Meningitis virus, Liver virus, Adenovirus, HIV and so on. Every time you hit to eliminate the virus, you can score points, and if the red blood cells are eliminated, the points will be reduced. The whole game is divided into three stages, the first stage is the germs that are easier to eliminate. The second stage is a variety of viruses; the last stage is the zero virus war.<br/>\n<br/>\r\nInstructions:<br/>\r\nLeft controller:  trigger button to select and confirm; <br/>\r\n\t        press the menu button to call out the menu;<br/>\r\nRight controller: trigger button to shot; <br/>\r\n                         grip button to replace the magazine;<br/>\r\n                         press the Touchpad/Thumbsitck to change the field of view.", "metacritic": null, "released": "2021-05-13", "tba": false, "updated": "2021-05-14T02:33:34", "background_image": "https://media.rawg.io/media/screenshots/fe1/fe1181c3c7cde2aa7a509014ab1b77c8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 148, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["VR RETRO REMASTER"], "genres": ["Simulation", "Casual"], "publishers": ["VR RETRO REMASTER"], "esrb_rating": null}