{"id": 602232, "slug": "digital-devil-story-megami-tensei", "name": "Digital Devil Story: Megami Tensei", "name_original": "Digital Devil Story: Megami Tensei", "description": "<p>A high-school student and skillful computer programmer named Akemi Nakajima created a software called &quot;Devil Summoning Program&quot;. At first Nakajima intended to use the software to gain revenge on a classmate who bullied him. However, things went out of control, and the malicious demon Loki was unleashed into the world. Soon, a demonic invasion of the Earth began. Aided by the lovely Yumiko Shirasagi, a transfer student who seems to be interested in him, Nakajima decides to undo his wrongs and defeat the demons. In order to do that, the young couple will need to learn how to use the program for good purposes, and uncover the truth about their own previous incarnations.</p>\n<p>Based on a series of horror novels by the Japanese author Aya Nishitani (the first of which is named Digital Devil Story), Megami Tensei marks the birth of the eponymous role-playing franchise. The game is a first-person RPG with turn-based combat, set entirely in large, maze-like dungeon areas. Unlike in most Japanese-style RPGs, the player can manually increase combat parameters of Nakajima and Yumiko when they gain a level.</p>\n<p>The game introduces the demon summoning feature that has since become the distinguishing gameplay element of the series. The player is able to communicate with randomly encountered demons through Nakajima&#39;s computer software, summon them, and make them fight as members of the controlled party. Communications with randomly encountered demons usually involve offering them money or magnetite (energy they consume); the outcome of the communication depends on the demon&#39;s race, alignment, and the phase of the moon. Demons can also be &quot;fused&quot; with each other in special facilities, creating more powerful species.</p>", "metacritic": null, "released": "1987-09-11", "tba": false, "updated": "2024-03-26T06:42:04", "background_image": "https://media.rawg.io/media/games/771/771578207eb14c014873144d1600c41d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "beaten": 3, "toplay": 6, "dropped": 3, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 4, "suggestions_count": 84, "game_series_count": 39, "reviews_count": 4, "platforms": ["NES"], "developers": ["Atlus"], "genres": ["RPG"], "publishers": ["Namcot"], "esrb_rating": null}