{"id": 602421, "slug": "age-of-valanti-tribe-heroes", "name": "Age of Valanti: Tribe heroes", "name_original": "Age of Valanti: Tribe heroes", "description": "Welcome to Valanti, where you will embark on your legendary adventure as the chief of your tribe! Summon heroes from all over the world to fight together to defeat mighty monsters! Build your own tribe and strive to become the top tribe in the world of Valanti.<br/><br/>Don't worry about time commitment: Age of Valanti has been designed as a casual and relaxing gaming experience and is perfect for short bursts or longer play sessions.<br/><br/>[Game Features]<br/><br/>Immersive Art Style<br/>Breathtaking visuals! A true visual gem rendered with PBR, transporting you to a world filled with wonder and excitement.<br/><br/>Intuitive Gameplay<br/>Battle with extreme ease! Control heroes and show their skills with just a slide or tap of the finger and let the AI take care of the rest!<br/><br/>Various Unique Heroes<br/>Choice matters! 6 factions, 4 careers. A total of 23 legendary tribal heroes are waiting for you to experiment with!<br/><br/>Choose your own Tactics<br/>Strategy is key! Choose the right hero for each battle and equip them with the right gear to complement their unique skills and easily secure victory for your tribe.<br/><br/>Non-stop Battle System<br/>The fun never stops! Heroes will continue to fight for you and obtain countless items and gold coins even when you're offline.<br/><br/>Grow your Tribe<br/>Experience it all! Participate in tribe construction, resource production, trade with other tribes, and experience true tribal life.<br/><br/>[Join us]<br/>Facebook: https://www.facebook.com/AgeofValanti<br/>Discord: https://discord.gg/ZdEyXCpnpE<br/><br/>[Contact us]<br/>Email: idletribecs@gmail.com", "metacritic": null, "released": "2021-01-21", "tba": false, "updated": "2021-05-14T04:28:37", "background_image": "https://media.rawg.io/media/screenshots/34a/34ada3cc62bd32d15bc2d190ad413838.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 243, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Jade Interactive"], "genres": ["Action", "RPG"], "publishers": ["Shanghai Yaocao Technology Co"], "esrb_rating": "Everyone 10+"}