{"id": 602405, "slug": "basketball-star-sports-game", "name": "Basketball Star Sports Game", "name_original": "Basketball Star Sports Game", "description": "Live to be an nba star? Download this legend game now.<br/><br/>Two old school modes of play:<br/>- Classic Arcade: Shoot the goal every 30 seconds to continue progressing. Game gets harder each level!<br/>- Endless Arcade: Shoot with 3 balls, don't miss a throw or you lose a ball!<br/>New Courts, New Ball packs. Change the way your game looks, or don't! Be a legend like jordan.<br/>Check out the best Sporty iMessage Stickers for your chat messages! To send a sticker, open your Messages app. Tap the Apps button (which looks like the App Store icon), then select our Basketball icon to view and pick from the sticker pack.<br/><br/>Think you can shoot hoops the best? With Apple's Game Center enabled, you can check the Game Center leaderboards to see how your net skills stack up against top players all around the world! espn for your pocket!<br/><br/>Experience the next generation of input with haptic touch. Nothing but net!<br/><br/>Basketball is a universal app, playable in the best resolution available for each Apple mobile device.<br/><br/>FEATURES:<br/>- One Swipe Gameplay<br/>- Easy to pick-up, challenging to master<br/>- NEW iMessage Stickers<br/>- Get a frictionless perfect throw!<br/>- Polished 3D Graphics<br/>- Dozens of Balls to Unlock<br/>- Dozen Courts to Unlock<br/>- Game Center leaderboards<br/>- Classic Arcade Championship<br/>- Endless Arcade Championship<br/>- Portrait<br/>- Achievements<br/>- Taptick feedback<br/><br/>The addicting game you’ve been playing at the arcade for years now goes wherever you do. Download Free Basketball today! No In Abc Payments. Fully free!<br/><br/>For the latest info and what we are up to, check out", "metacritic": null, "released": "2018-07-29", "tba": false, "updated": "2021-05-14T04:20:40", "background_image": "https://media.rawg.io/media/screenshots/39c/39cf28a680afe2d4ee8fda57a4b6bbce_YLfNzBr.jpg", "website": "http://basketball.freefungames.xyz", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 120, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Best Basketball Game for Free"], "genres": ["Simulation", "Sports"], "publishers": ["Best Basketball for Free"], "esrb_rating": "Everyone 10+"}