{"id": 602651, "slug": "summer-in-mara-itch", "name": "Summer in Mara (itch)", "name_original": "Summer in Mara (itch)", "description": "<p><strong>Summer in Mara</strong> is a summer adventure with farming, crafting, and exploring mechanics set in a tropical archipelago.</p>\r\n\r\nA relaxing farming adventure\r\n<p>‘Summer in Mara is a single-player experience in a calm, relaxing environment, with a handmade look and an exciting narrative. You will be <strong>Koa</strong>, a little adventurer girl who wants to explore the world that surrounds her.</p>\n<p>In Summer in Mara you’ll have to take care of your own island, harvest your crops, create new tools and buildings, and sail with your boat to discover new islands and secrets.</p>\n<p><strong>Features</strong></p>\n<p>- An open ocean with over 20 islands to explore.<br/><br/>- Customize your own island with buildings, crops and farm animals.<br/><br/>- Over 25 characters to meet and befriend.<br/><br/>- More than 300 quests to make Mara a better place.<br/><br/>- Day and night cycle that have an effect on the world with climatic events.<br/></p>\n<p>Harvest, take care of your animals, fish in open sea, meet new people and live exciting adventures with Koa!<br/><br/>Not everything will be friendly though. An evil corporation called Elit wants to conquer Mara and exploit the ocean. Napopo is one of their first victims, a strange creature that will seek Koa for help.</p>\n<p><strong>Get a Steam key and the official artbook with your purchase!</strong></p>", "metacritic": null, "released": "2021-05-13", "tba": false, "updated": "2021-05-14T05:34:01", "background_image": "https://media.rawg.io/media/screenshots/766/7669489c91ba30fbbde47cad59621a0e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 280, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Chibig"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}