{"id": 602729, "slug": "smithy-wars", "name": "Smithy Wars", "name_original": "Smithy Wars", "description": "Did you enjoy a bit too much experimental crafting on games like Legend of Mana? Did you LOVE customizing your spells and minmaxing them on Oblivion? Would you like to try tactical ideas with these things?<br/><br/>Fight endless mobs of monsters, earn gems to buy better gear or stick to cheap but greatly enchanted items!<br/>Each level will get harder. Can you get to level 200 by geeking out on stats?<h3>Unleash your inner minmaxer in Smithy Wars!</h3><br/><br/><br/><ul><li>Multiplayer, fight with your friends! ELO system!<br/></li><li>Craft and customize your team completely in 3 vs 3 fights<br/></li><li>Go on adventures! Solve puzzles and gain loots!<br/></li><li>Defend your capital with walls and outposts! Raid other cities!<br/></li><li>Prepare your team, watch them fight and see what went wrong<br/></li><li>Equip your team to specialize each teammate as a healer, tank, assassin, mage or archer!<br/></li><li>Enchant your equipment ala Legend of Mana. Cards for all!<br/></li><li>Create your own spells ala Oblivion<br/></li><li>Buy the best equipment or buy bad equipment and enchant it to make it the best!<br/></li><li>Daily training IRL makes your team stronger</li></ul><h3>Epic Spells</h3><br/>Customize your spells whether they are thunder, fireballs or healing! Go for an MP expensive spell that can only be cast twice, something in between or whatever rocks your boat!<br/><br/><br/><h3>Go on adventures!</h3><br/><br/><br/>Explore different places with puzzles to solve, loot to earn and enemies to defeat! Each tile can be claimed as part of your territory and have walls or outposts to fend off enemy invaders! <br/><br/><br/><br/>Solve sokoban puzzles while on adventures to earn precious loot!<h3>Complex Enchant System</h3><br/><br/><br/>Create the perfect sword! Improve your armor and learn the system to unleash great power!<br/>Each ingredient may add a special effect to your item but be careful! Some evil ingredients may curse your weapon if the requirements are not met! Experiment to create the most powerful items and start the Smithy Wars now!<br/><br/><br/>----<br/><br/>\"Make life rue the day it thought it could give you lemons\"<br/>Made in Argentina!<br/>-Bigboot", "metacritic": null, "released": "2021-05-13", "tba": false, "updated": "2023-11-06T17:38:23", "background_image": "https://media.rawg.io/media/screenshots/c54/c5446c667a907f3277cf0aa686d97018.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 257, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["Bigboot Studios", "Dante"], "genres": ["Action", "Adventure", "RPG", "Simulation", "Casual", "Massively Multiplayer", "Indie"], "publishers": ["Bigboot Studios"], "esrb_rating": null}