{"id": 60278, "slug": "arkhangel-the-house-of-the-seven-stars", "name": "Arkhangel: The House of the Seven Stars", "name_original": "Arkhangel: The House of the Seven Stars", "description": "Michael, Lily, and Gabrielle have recently moved to the frigid town of Haven under tragic circumstances. As they begin to rebuild their lives in this new home and meet the townsfolk of Haven, they quickly discover that not everything is what it appears to be. Michael struggles with dreams of dark waters and an unknown ancient evil resting beneath the cold waves. Are these simply dreams or are they a premonition of things to come?<br/><br/>Inspired by the classic point &amp; click adventure games of yesteryear, Arkhangel: The House of the Seven Stars is a story told through the eyes of a family that has recently moved to an isolated town in the frozen wilderness. Explore, unearth dark mysteries, solve puzzles, engross yourself with deep lore, and interact with a large cast of characters in this rich and layered narrative.<br/><br/><ul><li>3D point &amp; click adventure game created with Unity3D.<br/></li><li>Deep narrative with abundant lore to discover and absorb.<br/></li><li>Gorgeous environments in a moody and atmospheric world.<br/></li><li>Large cast of characters to interact with.<br/></li><li>Cinematic, live orchestral musical score by composer and conductor Chad Seiter (ReCore, Super Lucky's Tale, Star Trek, FRINGE, Lego Jurassic World, The Legend of Zelda: Symphony of the Goddesses).<br/></li><li>Direct tie-in to the tabletop game, The Great Nameless.<br/></li><li>Windows &amp; Mac OSX.</li></ul><br/><strong>WINTER NIGHT GAMES</strong> was borne from the collective imagination of two dorky brothers.  A lifelong interest in video games, pen &amp; paper role playing games, and horror stories compelled us to start our own company, where we make the kind of games we like to play and telling the stories we like to tell. WNG came out of what started as a collaborative effort to write a horror novella.  While iterating and fleshing out the structure of the story, it became apparent this story would lend itself to being told within the medium of an adventure game.  A larger framework was then conceived, which could support an overarching story that could be told through various gaming media, both digital and analog.<br/><br/><strong>A SPECIAL NOTE FROM THE DEVELOPER:</strong><br/>While there isn't overt gore or on-screen violence in Arkhangel, there is subject matter and imagery that some might find disturbing.  This is a mature game experience.", "metacritic": null, "released": "2018-07-27", "tba": false, "updated": "2020-04-15T10:23:56", "background_image": "https://media.rawg.io/media/screenshots/d49/d490c32b17ec60d46365b2ac9e27f37a.jpg", "website": "https://winternightgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 32}, "playtime": 4, "achievements_count": 7, "ratings_count": 0, "suggestions_count": 439, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Winter Night Games"], "genres": ["Adventure", "Indie"], "publishers": ["Winter Night Games"], "esrb_rating": null}