{"id": 602865, "slug": "space-hop-episode-1", "name": "Space Hop: Episode 1", "name_original": "Space Hop: Episode 1", "description": "<p>space hop: episode 1 is the beginning of a long story about ambition, family, and weird little guys shooting rayguns in space. ye-rin and their co-hop annie are space hoppers, adventurers for hire except in outer space. the two are very different- one full of more ambition than their body can hold, and the other wondering where her ambition went. despite all odds, they stick together. when they are confronted with quite a large setback, they set out to fix it, and along the way come to understand why that won't ever change. also, there are funny aliens, and magic, or something like that. <br/></p>\n<p>space hop was originally a webcomic that i made in college. it was super ambitious, and i never got to finish it, because, well, i was in college. in 2020 i couldnt get the story out of my head, and wanted to try to re-do it to make it the best it could be, and maybe get some closure along with it. because (despite my best efforts) im still super ambitious, i decided to try and make a visual novel. i became kind of manically obsessed with the project, but ended up losing steam again. i was originally going to release it as a four episode volume one, and continue in more volumes, but this first chapter is all i managed.  so i decided to just post what i have, even if its unfinished and unpolished. </p>\n<p>who knows if ill ever finish it. maybe if enough people seem to like it! if it resonates with you, id love to hear about it! but for now, here is this little piece of myself that i put into being to share with you. its not much, but its also so much, so i couldn't bare to keep it private anymore. i hope one day, it can be finished. but if that day never comes, that's ok too.</p>\n<p>the \"game\" is still unfinished- the bare minimum has gone into it's menus and interface. youll notice that some assets are straight out of tyranobuilder's defaults, but they do the job. apologies if you experience any trouble with it. i hope at the very least, you can read the story! oh yeah, and this is a kinetic vn- there aren't any choices or brances. so dont expect that!</p>\n<p>thank you to every one who offered a piece of themself into this story, and who supported me even when i had lofty, ambitious goals. thank you to everyone who read my modest little webcomic in 2016, and who shared how much it meant to you. this wouldn't exist without you.  </p>\n<p>please enjoy the game!</p>\n<p>PS. I've currently only got a PC build up, but please let me know if you'd like to play and would require a mac build. I can see what I can do!</p>\n<p>PSS! theres a discord for the old webcomic thats still a little active, if youd like to talk about the vn with some folks. : ) https://discord.gg/WMzKQQ2T27<br/></p><p>PSSSSSSSSSSS. here's the soundtrack. https://curryswirl.bandcamp.com/album/space-hop-ost</p>", "metacritic": null, "released": "2021-05-12", "tba": false, "updated": "2021-05-14T06:31:08", "background_image": "https://media.rawg.io/media/screenshots/979/979304a9f263e0161bd671aa30538ceb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 127, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["curryswirl"], "genres": [], "publishers": [], "esrb_rating": null}