{"id": 60296, "slug": "grisaia-phantom-trigger-vol5", "name": "Grisaia Phantom Trigger Vol.5", "name_original": "Grisaia Phantom Trigger Vol.5", "description": "\"Grisaia: Phantom Trigger\" is a visual novel. More specifically, it is a kinetic novel, without any branching routes. Returning character artist Akio Watanabe and writer Ryuta Fujisaki bring you the latest installment in the acclaimed Grisaia series, \"Grisaia: Phantom Trigger\".<br/>\n<br/>\r\nStory:<br/>\r\nA few weeks have passed since SORD successfully resolved the Kitaoka University terrorist incident - albeit with some sacrifices - when Murasaki's older sister Yuuki returns to Japan to rejoin Class A.<br/>\r\nBeing more sociable and capable than her sister, Yuuki immediately befriends the other students and builds a trusting relationship with them.<br/>\n<br/>\r\n\"There's no reason for me to be at Mihama anymore...\"<br/>\n<br/>\r\nAs Murasaki starts questioning her raison d'etre, she reminisces about the time when she first met Haruto.<br/>\r\nLamenting his lack of experience, he had come to her village hidden deep in the mountains in search of new skills. <br/>\r\nWhere could he find this supposed \"secret art\" that is said to have been passed down for generations...?<br/>\n<br/>\r\n\"I'll never forgive you...!!\"<br/>\n<br/>\r\n\"It's okay... Don't worry... I'm not... going anywhere... I'm here with you...\"<br/>\n<br/>\r\n\"I'm stumped... It's exactly as she said - and there's no way to cut a phantom...\"<br/>\n<br/>\r\n\"Come on. Chin up... Show me your courage...\"<br/>\n<br/>\r\nTheir fateful meeting was also the beginning of a tragic story...<br/>\n<br/>\r\n\"Won't you... give me the order to kill my sister?\"", "metacritic": null, "released": "2018-07-26", "tba": false, "updated": "2019-08-28T21:58:56", "background_image": "https://media.rawg.io/media/screenshots/2f3/2f34037ce546f233efe45e754fa4b1ea.jpg", "website": "http://grisaia-pt.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 5, "owned": 17, "toplay": 1}, "playtime": 4, "achievements_count": 21, "ratings_count": 0, "suggestions_count": 294, "game_series_count": 18, "reviews_count": 0, "platforms": ["PC"], "developers": ["Frontwing"], "genres": ["Adventure", "Casual"], "publishers": ["Frontwing USA"], "esrb_rating": null}