{"id": 60306, "slug": "the-initiate-2-the-first-interviews", "name": "The Initiate 2: The First Interviews", "name_original": "The Initiate 2: The First Interviews", "description": "<strong>The Initiate 2: The First Interviews</strong> is a first person mystery puzzle game set in a remote location in Salt Lake City, Utah, and tells the story of three individuals as they try to escape their mysterious captors.  <br/><br/><br/><br/><br/>With little memory of how they got there, three people awake in adjacent cells. A voice bellows from a wall speaker. \"Welcome to your trial - Your goal is simple, escape or die\". <br/><br/>This is the story of <strong> Samantha Blake</strong>  - a distraught mother who lost her child during complex brain surgery, <strong> Benjamin Clarke</strong>  - an alcoholic whose life was turned upside down with the death of his wife in a horrific car accident and <strong> Stephen Parfitt</strong>  - a college professor and author who is starting to give up on life with an ever changing World.  <br/><br/>Three strangers - forced to work together to survive captivity - each searching the answers, the redemption and the peace of mind that they so desire.<br/><br/>Can you unravel the mystery behind your captivity, and most importantly, can you escape this treacherous and sinister ordeal?<br/><br/><strong>Remember: No-one is safe. Nothing is as it appears.</strong><br/><br/><br/><br/><br/><br/><ul><li><strong> A UNIQUE MYSTERY PUZZLE STORY AND EXPERIENCE</strong> <br/>Play as three characters, each with a unique background, in an attempt to escape your captivity. Encounter a unique story shrouded in mystery and conspiracy told over the course of this mystery puzzle horror adventure.<br/></li><li><strong> VOICE ACTING</strong> <br/>The game features fully voice acting for real immersion.<br/></li><li><strong> PUZZLES </strong> <br/>Many items and puzzles hide within the world, can you find and solve them all? Look everywhere, listen to everything. <br/></li><li><strong> INTERACTION </strong> <br/>Interact or examine over 70% of the items in game for a real immersive experience. Can you find everything the world has to offer?<br/></li><li><strong> ATMOSPHERIC SOUND</strong> <br/>The Initiate: First Interviews features a great soundtrack and immersive ambience, which enhances game-play and tension.<br/></li><li><strong> IMMERSIVE GRAPHICS</strong> <br/>The Initiate uses Physical Based Shaders (PBS) for AAA-quality graphics that give players a detailed world to explore.<br/></li><li><strong> ENDING</strong> <br/>Your choice matters, and will result in the ending you achieve.</li></ul>", "metacritic": null, "released": "2018-06-26", "tba": false, "updated": "2019-08-28T21:58:56", "background_image": "https://media.rawg.io/media/screenshots/56b/56bc1826cd05050ac725b4ffd89d4df4.jpg", "website": "http://www.games.deceptive-games.com/initiate2/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 46, "beaten": 1, "toplay": 3}, "playtime": 4, "achievements_count": 27, "ratings_count": 2, "suggestions_count": 380, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC", "macOS"], "developers": ["Deceptive Games"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Deceptive Games"], "esrb_rating": null}