{"id": 603045, "slug": "endix-entertaining-digitized-expo", "name": "Endix - Entertaining Digitized Expo", "name_original": "Endix - Entertaining Digitized Expo", "description": "What is Endix - Entertaining Digitized Expo?\r\n\r\n(I'm Endy the Mascot)\r\n<p>Hey Fellow gamer,\r\n</p>\n<p>What you are about to experience is a demo version of <strong>Endix Expo</strong>. \r\n</p>\n<p><strong>Endix </strong>is a fully digital multiplayer video game event, created by gamers for gamers, to make gaming events an accessible reality for the industry and fans all around the world, regardless of their financial budget or geographical proximity.\r\n</p>\n\r\n(Me, trying to visit a video game event irl)<br/><br/>\n<p>With your support and promotion, we can make <strong>Endix </strong>an event for every gamer worldwide. Endless possibilities await us, with more and more gamers, indie and AAA studios participating in an event like you have never seen before.\r\n</p>\n\r\n(Welcome fellow gamer...)<br/><br/>\n<p>The following Demo includes only a glimpse of the experience. In the 3-days event launch, <strong>KEY FEATURES will be,</strong>\n</p>\n<ul><li>Create your own avatar \r\n</li><li>Join alone or with friends \r\n</li><li>Explore the city hosting the event but also the expo center and experience the thrill of a video game event but in a digital world.\r\n</li><li>Interact with the worldwide gaming community (influencers, streamers, other gamers, developers, etc.)\r\n</li><li>Challenge your friends and the whole community in mini-game challenges\r\n</li><li>Experience booths like never before and play participating titles on the spot with no additional downloading time required\r\n</li></ul>\r\nWhat is unique about Endix Expo?\r\n<p>All of the features that are built and that we plan on building in the future, aim at transferring a physical event's experience in a digital world where physical limitations do not apply. In a physical event, you have to spend hours playing your favorite demo and the booths are booths bound by physical restrictions. However, in <strong>Endix</strong>, game creators shape their own booth as they like. If you like what you see you can play on the spot, the game itself.</p>\n\n<p>\n</p>\n<p>(<strong>Legal Lines</strong>: While the game itself features no violence, gore, or any inappropriate material, there are trailers and gameplay of other games that players can experience that may contain violent scenes.)\r\n</p>\n<p><strong>Release Date</strong>: Event Dates: Fall 2021\r\n</p>\n<p>Website: https://endix-expo.com/\r\n</p>\n<p>Trailer: https://youtu.be/cx1eb863_tg\r\n</p>\n<p><strong>Message to Influencers</strong>: \r\n</p>\n<p>Upon discussion, we could: \r\n</p>\n<ol><li>Create your digital branded NPC character \r\n</li><li>Connect you with organizations and game creators for sponsorships and extra content \r\n</li><li>Give you discount codes and commission-based partnership models.\r\n</li></ol>\n\r\n(e-sports teams, influencers and game-related stands)\r\n<p>We are flexible to additional requests/suggestions as we want to create <em><strong>the most gamer-centric exhibition out there!\r\n</strong></em><br/>\n</p>\n<p><strong>!GIVEAWAYS!\r\n</strong></p>\n<p>Every influencer will get 10 free tickets for a giveaway priced at <strong>49.99 Euros </strong>to share as he/she pleases. Contact us for more details!\r\n</p>\n<p><strong>You can reach out to us on our social media, on Discord at Korregart#6909, at info@endix-expo.com or through our website www.endix-expo.com</strong>\n</p>\n<p>http://bit.ly/EndixExpo<br/></p>\r\nNote and Thank You \r\n<p>All gamers want the same thing and have the same needs when it comes to gaming. The hype, the sense of a community, the exploration of the unknown, the thrill of a new game, you name it.\r\n</p>\n<p>Supporting us means you understand how such an expo could connect us in a world we all understand, the digital one. Therefore, we would like to thank you for helping us make such a world a reality!\r\n</p>\n<p>Share your thoughts on our Discord. We can't wait to <strong>\"Endix\" </strong>with you and to tell you \"You are Breathtaking\" inside the world of <strong>Endix - Entertaining Digitized Expo</strong>. <br/></p>\n<p>\n</p>", "metacritic": null, "released": "2021-05-12", "tba": false, "updated": "2021-05-14T07:20:32", "background_image": "https://media.rawg.io/media/screenshots/372/37242623a6b0329320ff8b9717892f84.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 255, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Endix Expo"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}