{"id": 60329, "slug": "the-road-trip", "name": "The Road Trip", "name_original": "The Road Trip", "description": "During this adventure horror game you and your uncle will hit the road in search for the amazing MrRibs! You are just an average overweight man in his mid thirties that wants nothing more then to accomplish his dream of buying all the MrRibs he can. The MrRibs is only available for one week then moves on to the next city.  You and your uncle have no idea what to expect on this wild journey!<br/><br/><br/><br/>During this amazing journey you will encounter a whole world of trouble when picking up complete strangers with colorful backgrounds. You will be chased around by wanted serial killers and you will be dangling off dangerous cliffs in the Canadian wilderness. Your main goal is to stop at nothing until you have accomplished your search for the MrRibs, night or day, raining or snowing, you will persevere!<br/><br/>Listen to smooth music while driving all around Canada looking for the MrRibs, this game can be very relaxing and calming at times depending on your choices through out the game. Through this game there will be different opportunities you can take which will give you some different outcomes of what you will go through, we wish you the best through this journey!<br/><br/><strong>Features</strong> <br/><br/>• Player choices and actions within the game that can change the story (choosing different routes, changing decisions to achieve different endings) <br/><br/>• Relaxing and calming gameplay, game moves at your pace <br/><br/>• Meeting and chatting with interesting characters through out the game (different characters have their own backstory and you are able to ask them questions) <br/><br/>• Heart pumping horror situations (Being chased by serial killers or picking up dangerous hitchhikers) <br/><br/>• Wandering around and viewing the beautiful nature that surrounds you <br/><br/>• Driving in dangerous conditions and avoid smashing into pieces (realistic driving physics)", "metacritic": null, "released": "2018-05-26", "tba": false, "updated": "2019-08-28T21:58:55", "background_image": "https://media.rawg.io/media/screenshots/91a/91a9c511d505fd79e7c6c2af25d93819.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 373, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Red Sky Studios"], "genres": ["Action", "Adventure", "Racing", "Casual", "Indie"], "publishers": ["Red Sky Studios"], "esrb_rating": null}