{"id": 603459, "slug": "le-sauvetage-de-santarus-saving-santarus", "name": "Le Sauvetage de Santarus / Saving Santarus", "name_original": "Le Sauvetage de Santarus / Saving Santarus", "description": "<p>Grâce à ce scénario pour Pathfinder 2ème édition, vous allez pouvoir vous passer du traditionnel film de Noël cette année, car vous <em>jouerez</em> le film de Noël !<br/><br/>Noël n'existe plus depuis longtemps en Golarion. Mais de courageux héros sont appelés à le faire renaître. Y parviendront-ils ? Vaincront-ils le démon qui s'est immiscé dans le Pays Blanc ?<br/><br/>J'ai écrit Le Sauvetage de Santarus pour faire jouer à mes joueurs un film de Noël en décembre 2020. J'ai fais tous les plans moi-même, en plus du scénario en lui-même, donc n'hésitez pas à laisser un petit don pour me soutenir. Merci ! &lt;3<br/><br/>N'hésitez pas à venir me voir sur Discord : https://discord.gg/EbjCd9khu4<br/><br/>____________________________________________________________________________________________<br/><br/></p>\n<p>Thanks to this scenario based on Pathfinder 2nd edition, you won’t need the traditional christmas movie this year, you’ll be playing it yourself.<br/><br/>Christmas hasn’t been a thing in Golarion in a long time, but brave heroes are called upon to help it re-emerge. Will they succeed ? Will they be able to defeat the demon who entered the White Lands ?<br/><br/>English version is available !<br/><br/>I wrote Saving Santarus for my players in December of 2020. I created all the battle maps and wrote the scenario myself. Make a donation if you like it. Thanks </p>", "metacritic": null, "released": "2021-05-11", "tba": false, "updated": "2021-05-14T09:15:50", "background_image": "https://media.rawg.io/media/screenshots/fdf/fdf862efd71ef165efdb47fba608e6b0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 20, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Manea"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}