{"id": 603423, "slug": "recycle-mission", "name": "Recycle Mission", "name_original": "Recycle Mission", "description": "<p>Hello everyone!</p>\n<p>This is the new project that I have worked during college with a few friends. </p>\n<p>Our theme was to create a game that could pass a message to a young audience of how they can influence and change/save the world around them. We feel we have fulfilled that theme with our Recycle Mission game.  A game about picking up rubbish and depositing it in bens. As you play the game you can see the difference that your actions make and we feel that can send a good message to everyone.</p>\n<p>Recycle Mission is a 2D platformer that controls with arrow keys or WASD, space is jumping. You have a minimap to guide you alongside the level so you don't get lost as the level is pretty big. </p>\n<p>People involved:</p>\n<p>Ryan- Worked on some coding and art as well as tested the game. <br/></p>\n<p>Will - Worked on some coding majority of the art of the game as well as tilesets.</p>\n<p>Ethan- did some concept art for the game. </p>\n<p>Silviu (noeLstudios)-  Ran project lead on this one. Worked on allocating tasks and did some programming and concept art. Worked on finding music and did most of the UI.</p>\n<p>We all worked together on storyboarding, the idea of the game concept, and testing. </p>\n<p>Everyone's Twitter page to follow is on credits for the game.</p>\n<p>Thank you for playing!</p>", "metacritic": null, "released": "2021-05-11", "tba": false, "updated": "2021-05-14T09:07:08", "background_image": "https://media.rawg.io/media/screenshots/91a/91afe64c9a607eae1afec6a1294a2cc1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 82, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Noel Studios"], "genres": ["Adventure", "Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}