{"id": 60348, "slug": "shrinking-pains", "name": "Shrinking Pains", "name_original": "Shrinking Pains", "description": "Did your ceiling always look like that?<br/><br/>Your vision peels at the edges, folding in. Everything is white, empty. You spend a day seeing how many coins you can fit into the hollows above your collarbones. <br/><br/>You wonder how long it will take until there is nothing left of you to touch.<br/><br/><strong>Overview</strong><br/>Made in 48 hours for the Global Game Jam 2018, Shrinking Pains is a short narrative experience that explores a semi-autobiographical struggle with anorexia.<br/><br/><strong>Story</strong><br/>Play as a sufferer of anorexia as they navigate their life and relationships.<br/><br/><strong>Features</strong><br/><ul><li> Choose your partner preference before you play.<br/></li><li> Strong black and white visuals.<br/></li><li> Immersive original soundtrack.<br/></li><li> Multiple endings.<br/></li><li> Explores mental health.<br/></li><li> Narrative driven visual novel.</li></ul><br/><strong>Characters</strong><br/><br/>Isabella is a gentle girl with a wicked sense of humour. She is a professional violinist with a great love of sitcoms. <br/><br/><br/><br/>Taylor is prickly young man with a warm heart. He works as a software engineer by day and sells his knitting on Etsy in his spare time. <br/><br/><br/><br/>Yuuto has been your best friend for years and put up with your emotional baggage as long as he's known you. He's reliable, dependable and can't text to save his life. <br/><br/><br/><br/>Vivienne's claw-like nails chime against her wineglass when she's talking. They leave long red marks against your skin as she pulls you to the door...<br/><br/><br/><br/>Hunter looks good smoking in his leather jacket. When he puts his hand on your neck you don't know if you feel excited or scared... <br/><br/><strong>Content Warning</strong><br/>Shrinking Pains deals with potentially distressing themes of mental illness and destructive behaviour. Be warned that some of the content is fairly graphic and may be upsetting to some players.", "metacritic": null, "released": "2018-04-27", "tba": false, "updated": "2023-08-08T20:26:50", "background_image": "https://media.rawg.io/media/screenshots/209/209fe80a8a7e9ae0fefaed3d53a0b08b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 130, "beaten": 2}, "playtime": 1, "achievements_count": 0, "ratings_count": 4, "suggestions_count": 176, "game_series_count": 0, "reviews_count": 4, "platforms": ["PC"], "developers": ["Bedtime Phobias"], "genres": ["Indie"], "publishers": ["Bedtime Phobias"], "esrb_rating": null}