{"id": 603621, "slug": "headhunter-society", "name": "Headhunter Society", "name_original": "Headhunter Society", "description": "\n<p><strong>TLDR:  This is an early prototype and we need players to help test out the gameplay loop while we develop it.  I’m going to break the game a lot, things will be half done, and sometimes your player might just explode.</strong>\n</p>\n<p>Thanks for checking out my game!  The long term plan for this game is to have a fun quick play style game where you hunt other players and unlock cosmetics (hats, clothes, anything to give you that unique look for your hunter’s photos).  \r\n</p>\n<p><strong>Currently things are about half finished.</strong>  Art, Maps, Weapons, Sounds, and Player Cosmetics all barely exist and most only exist in a tentative sense. \r\n</p>\n<p><strong>Before I dive into finishing all that, I want to make sure the gameplay is solid! </strong> That’s where you come in.  As this is a multiplayer game, I need players to know if it’s fun!\r\n</p>\n<p><strong>I’ll try and be online around</strong> <strong>7pm CST</strong> (This might change from time to time depending on players)<strong> </strong>to help fill space in matches.  I hope to see you there, and I welcome feedback in the game.</p>\n<p>P.S.\r\n</p>\n<p><strong>Sad to say, but I am a solo developer.</strong>  Please bear with me as I might not always be around to fix builds or maintain the server.  All donations are very much appreciated and will go straight to keeping myself alive (and in turn the game).</p>\n\n\n<p>Tentative Plan:  Headhunter Society is a neon noir multiplayer action stealth game, where 12 players are tasked with hunting each other down one at a time.</p>\n\n<br/>\n\n<p>Once players are gathered, you are given a photo of another player to hunt down, but there is a catch.  One random player is also trying to hunt you.\r\n</p>\n<p>Successfully hunting your target rewards you with the photo of the player they were hunting (who becomes your new target) and a full heal.  Failure means elimination.\r\n</p>\n\n\n\n<p>Attacking players that are not yet your target and that are not hunting you is forbidden, and doing so will result in a small punishment.<br/></p>\n<p><em>Tentative:  Due to low player count, if your match is started with 6 or less players you will all be given additional lives.  Killing your targets will set more and more players against you until you are finally killed.  Running out of lives results in elimination.</em>\n</p>\n\n\n\n<p>Running, Slamming doors, breaking glass… Your actions produce noise that other players can see in the world.  Be stealthy, prepare traps, and hunt your targets efficiently. </p>\n\n\n<p>Various Items can be found and used to your advantage.</p>", "metacritic": null, "released": "2021-05-10", "tba": false, "updated": "2021-05-14T09:59:09", "background_image": "https://media.rawg.io/media/screenshots/7a5/7a5fc3f8929c6aedf881f8b1c45ebee4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 105, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["LiveJoel"], "genres": ["Action"], "publishers": [], "esrb_rating": null}