{"id": 603600, "slug": "ponto-refugio", "name": "Ponto Refúgio", "name_original": "Ponto Refúgio", "description": "<p>A cause that is constantly overlooked in society is that of refugees, regardless of the countries they have left and to which they will go. Probably xenophobia and prejudices rooted in the population of recipient countries are the main reason for ignorance about this cause.</p>\n<p>The lack of government support for the integration of the refugee in the country generates the marginalization of the individual, which causes him to depend on social organs of the community, these being NGOs and institutions. As they are social organizations, they will depend on donations and government assistance so that they can offer quality of life to the refugee, as well as its implementation in the society that had abandoned him.</p>\n<p>Therefore, the concept of this game is based on social awareness, leading the player to have a real experience of how an NGO that welcomes refugees works, highlighting the difficulties faced by all.</p>\n<p>Unfortunately, there are refugees from the most diverse countries, especially those with a lot of poverty and internal conflicts. Because of this, we chose the countries Venezuela, Syria and Haiti to be the countries of origin of the five characters in the game: Kaled Al-Abadi, Najya, Soraya Salib, Fatima Al-Madini, Raíza González, Alejandro Pérez, Zuri Ahmed and Jafari Saidi. Each of the characters presents a unique personal story and came to Brazil in search of a new beginning, however, as mentioned initially, the support offered is almost never enough.</p>\n<p>This mobile game is aimed at social awareness through mechanics such as: simulation and resource management, leading the player to have a real experience of the administration of an NGO for refugees, highlighting the difficulties faced in the form of choices and events within the game .</p>\n<p>During gameplay the player will have to deal with resources, which are: money, infrastructure, mental health, knowledge, popularity, fluency in the foreign language, work and manpower. Each character represents a stage within the game in which the player will have to manage his resources. The player will only lose if he has no strategy to regulate the resources by zeroing any of them.</p>", "metacritic": null, "released": "2021-05-10", "tba": false, "updated": "2021-05-14T09:52:47", "background_image": "https://media.rawg.io/media/screenshots/1e4/1e4d15d8f4032626cc10570a341de5e5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 107, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Lichgames"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}