{"id": 60362, "slug": "my-mad-road", "name": "My Mad Road", "name_original": "My Mad Road", "description": "Welcome to an unpredictable cartoon world, where you play by your own rules. From crazy fun to brutal deeds. Earn cash peacefully or at any cost. Do you prefer action or peace? Good and evil – that's what the world you'll find yourself in is going to pay you back with.<br/><br/><br/><br/><strong>WE RECOMMEND THE PLAYERS TO DISTANCE THEMSELVES FROM THE EVENTS AND TAKE THEM WITH TONGUE IN CHEEK.</strong><br/><br/><strong>Gameplay:</strong><br/>Tank up your ride, take a dog, abduct a girl, shoot or befriend something. Focus on the missions or wreak havoc – the most important thing is to have some bucks in your pocket. <br/><br/><br/><br/><strong>My Mad Road</strong> is a completely new game where the main rule is powerful fun. You play as a controversial character who prefers to get around by car, but often needs to get out of it to take care of some business. Time passes in the game, so it's divided into days, during which you carry out selected missions. The world's full of life, so the missions are just a side goal, while the rest lives at its own pace. Unleash your imagination and join the events unfolding in the world of My Mad Road.<br/><br/><br/><br/><strong>Many paths and solutions</strong><br/>In every situation, you can act in multiple ways. We keep striving to make the gameplay unlimited by anything.<br/>Some actions in the game are only available upon approaching an object or a person. The character keeps growing, so they aren't able to do everything at the first stages of the game.<br/><br/><strong>The greater the risk, the greater the reward</strong><br/>Remember not to make too many enemies, as they can break or kill even the biggest badass.<br/><br/><strong>The game's atmosphere</strong><br/>The game is teeming with life (animals, people) you can interact with. The game is dominated by desert and farmland views, but there's also a good deal of fantasy and modern views.<br/><br/><strong>What's next?</strong><br/>You can find sample scenes in the trailer, and the most recent content is listed in the News section.<br/>We keep working on developing the game world and further adventures, so we encourage you to join the community to aid us.", "metacritic": null, "released": "2018-09-13", "tba": false, "updated": "2019-08-28T21:58:54", "background_image": "https://media.rawg.io/media/screenshots/337/337028fa5a8b17f9f232a4a43d8ab6f6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 382, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Crabby Team"], "genres": ["Action", "Adventure", "RPG", "Simulation", "Racing", "Indie"], "publishers": ["Crabby Team"], "esrb_rating": null}