{"id": 60370, "slug": "dimension-drifter", "name": "Dimension Drifter", "name_original": "Dimension Drifter", "description": "Dimension Drifter is a fast paced, ultra-violent action shooter with a non-linear storyline.<br/><br/>Our timeline has collapsed and many didn't even notice. Since then, inexplicable mysteries started happening all over the world. Strange sightings of objects and beings. Crop circles appeared. Cattle mutilation. Memories that didn't reflect reality anymore. The list gets longer every day...<br/><br/>All of this was just the beginning. Since then, hundreds of years have passed. It all spiraled out of control. One day, strange portals to another dimension have opened and Demons poured out. An endless war began. Some cities have created plasma domes around them, protecting them from the eternal onslaught. But most now lie in ruins.<br/><br/>Some extraordinary people who were able to survive long enough in the ruins have harnessed special abilities. In the eye of the public, these powers are deemed evil and it is said they are of demonic nature. These special people are outcasts, not allowed to enter the Domes of safety anymore. They are called Drifters.Features<ul><li>Super fluid hyper-speed gameplay. Your actions cancel restrictive animations, giving you absolute control in every situation.</li><li>Customize your character from hair color to weapon loadout. Attach individual mods to your weapons to change their behavior and make your playstyle your own.</li><li>Endless levels that are randomly arranged each time you play. Each room piece is designed by hand, making the whole map feel like it's manmade.</li><li>Episodic storytelling with different timelines. In a choose-your-own-adventure style, the story is told in episodes that you can shift to different outcomes. If for some reason one timeline ends, replay it with your new knowledge and unlock new paths that lead to a totally different outcome.</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:58:53", "background_image": "https://media.rawg.io/media/screenshots/7a7/7a714b3ef578c33832597a857a1b6032.jpg", "website": "http://www.paulinthenet.de/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 13, "ratings_count": 0, "suggestions_count": 451, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BlueEagle Productions"], "genres": ["Action", "Indie"], "publishers": ["Paul Schneider"], "esrb_rating": null}