{"id": 603879, "slug": "project-sub-deep", "name": "Project Sub-Deep", "name_original": "Project Sub-Deep", "description": "<p>Thanks for Checking out our game!\r\n</p>\n<p>Project Sub-Deep is a 3D first person survival horror game where the player pilots a submarine back up to the surface while collecting other sunken submarine’s black boxes along the way with a tractor beam. Throughout the ascent the player will need to use stealth and the natural environment to avoid detection from a giant enemy fish. Piloting the ship will require the player to balance the remaining electricity to the lights, sonar, and life support. This game was made as a semester long group assignment for an Indie Game Development class at Miami University.</p>\n<p>Game Description:\r\n</p>\n<p>Escape from the depths of the ocean in Project Sub-Deep! You are the pilot of a deep sea submarine and after an encounter with an unknown creature, your co pilot is left badly wounded and your ship is losing energy and life support fast. Navigate your way back up to the surface and discover what happened to the ships that came before you. Don't get caught by that creature or you might face the same fate as those other ships.</p>\n<p>Credits:</p>\n<p>Emily Waugh - Mechanics, Level, and VFX Design, Project Management, Coder, Environment, Graphic Design, Lighting, and Sound </p>\n<p>Bryan Afadzi - Coder </p>\n<p>Jonathan Byrne - Coder, and Character Design, Writer </p>\n<p>Patrick Larmon - Coder, and Environment</p>", "metacritic": null, "released": "2021-05-10", "tba": false, "updated": "2021-05-14T11:14:02", "background_image": "https://media.rawg.io/media/screenshots/d64/d64fa62d7cdb8b663e93ea426da000f1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 67, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["budy_paco"], "genres": [], "publishers": [], "esrb_rating": null}