{"id": 603979, "slug": "edens-ritter-12-priestess-of-pleasure", "name": "Eden's Ritter 1:2 - Priestess of Pleasure", "name_original": "Eden's Ritter 1:2 - Priestess of Pleasure", "description": "Eden’s Ritter: Priestess of Pleasure is a darkly erotic medieval fantasy visual novel developed by Waffle, the second entry chronologically in the Eden's Ritter series. Six months after the events of  Eden's Ritter: Paladins of Ecstasy, new tendrils of conspiracy stretch towards Princess Cecily and her knight Noein, lusting more fiercely than ever to destroy and degrade them!<br/><br/><br/><br/><ul><li>Narrative-based visual novel with multiple endings.<br/></li><li>A wide variety of vulgar monsters to defeat... or be defeated by.<br/></li><li>Stunning, high-resolution art from renowned artists Q-Gaku and Mogudan.</li></ul><br/><br/><br/>Half a year after the lustfiend invasion initiated by the traitor Archbishop Rudolf—<br/>The Elleraldian throne is Cecily's, and to her too fall two heavy burdens: she must rebuild the nation into prosperity while fending off the ever-growing lustfiend threat.<br/><br/>Through countless lewd and diabolical trials, Cecily has grown into a strong woman worthy of her reputation as a saint.<br/><br/>Her strength will soon be tested, though, as an ominous shadow encroaches on her holy kingdom. Foul undead trample the sacred soil, tracking gravedirt into the cathedrals that are the strongholds of Ellerald's uniting faith. Meanwhile, along the northern border with the militaristic empire of Galveria, hitherto unknown monsters wreak havoc on the land. And around Cecily a rising darkness coils, lurking in plain sight, awaiting the moment to ensnare the royal priestess-knight and once more subject her to torments anew...", "metacritic": null, "released": "2021-05-14", "tba": false, "updated": "2021-05-17T02:44:55", "background_image": "https://media.rawg.io/media/screenshots/50f/50ffbef8d51a71f8e348f8aa65a3c4a9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 8, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 546, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Waffle"], "genres": ["Adventure"], "publishers": ["Shiravune"], "esrb_rating": null}