{"id": 603998, "slug": "cyberpunkdreams", "name": "cyberpunkdreams", "name_original": "cyberpunkdreams", "description": "The city is spread before you, horizon to horizon, a vast sore squatting on the world. 24 million people, most of it lawless slum and favela. The last outpost of civilisation on the edge of the badlands. One of the most relevant, cosmopolitan cities in the world. Is it any wonder you ended up here?<br/><br/><strong>cyberpunkdreams</strong> is an evolving text-based role-playing adventure with countless opportunities, and endless chances for destruction. Take on the role of a lone wanderer sent to the gates of 2090s Cincinnati. The dirt and grit from the badlands coats your clothes - with your memories torn from you, all you have is a weapon across your back and a mission to complete. <br/><br/>Enter a living, growing world, with new stories and other content each month, plus regular limited time events. You’ll always find new surprises waiting for you in Cinci's dark and dirty alleys.<br/><br/>Who will you become in this cesspool of a city? Will you play the games and climb to the top, or be forgotten amongst the march of time and tyranny? <br/><br/><br/><br/><br/><strong>Simple, uncompromising cyberpunk narrative</strong><br/>Enter a future grounded in reality: a world distorted by corporations and dominated by poverty. This is down to the bone cyberpunk, as raw as it gets. Experience just a turn of a corner away from our own, whether you're a genre expert or getting into cyberpunk for the first time.<br/><br/><br/><br/><br/><strong>Learn who you are through your actions &amp; choices</strong><br/>Your abilities are intrinsically tied to your successes and failures. There are a multitude of ways to solve each problem you’ll encounter -- what you choose impacts not only your chances of making it out alive, but also how your character grows and experiences the world. <br/><br/><br/><br/><br/><strong>Choices have consequences, and the city remembers</strong><br/>Your choices aren’t detached from the lives of the people around you. Richly detailed NPCs will evolve on their own, remember and react to the alliances you announce, the mercy you give and the morals you stand by. If you’re looking for a true lesson of consequence, you’ve come to the right city.<br/><br/><br/><br/><br/><strong>Embrace yourself, flaws and all</strong><br/>cyberpunkdreams offers a highly customisable character creation system that continues throughout your entire time in Cincinnati. From your clothes and equipment, to your loadout and cybernetics, you are free to constantly upgrade and augment yourself however you choose... if you've got the cash.<br/><br/>With over <strong>1.7 million</strong> words of content and updates at least once per month, you're in for one wild ride.", "metacritic": null, "released": "2021-05-14", "tba": false, "updated": "2021-05-17T03:00:47", "background_image": "https://media.rawg.io/media/screenshots/81a/81a1cc2d79347f089b7dcc515582474b.jpg", "website": "https://cyberpunkdreams.net/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 61, "playing": 1}, "playtime": 5, "achievements_count": 63, "ratings_count": 0, "suggestions_count": 295, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["Late Night Games"], "genres": ["RPG", "Indie"], "publishers": ["Late Night Games"], "esrb_rating": null}