{"id": 60401, "slug": "the-ballad-singer", "name": "The Ballad Singer", "name_original": "The Ballad Singer", "description": "The Ballad Singer is an RPG/Graphic Adventure, set in a fantasy world completely controlled by the player's choices.<br/><br/>We've taken elements from game-books and visual novels to develop a videogame with an unprecedented format. TBS offers a fantasy story yet to be written, where the world changes and reacts to the player's actions. This will allow you to live up to 1700 stories and 40 different endings, your decisions will affect the way the tale unfolds. Every single development and subplot in the story is <strong>completely narrated and illustrated</strong>, even the smallest ones. In TBS, every choice is crucial.<br/><br/><ul><li> Four heroes with different narrative developments<br/></li><li> Asymmetric stories intertwining one to the other<br/></li><li> During a single run with a character you will never face two fights alike<br/></li><li> Your choices really matter, you can completely change the fate of the heroes through your decisions<br/></li><li> Three degrees of challenge: deceive death and repeat mortal choices through powerful artefacts<br/></li><li> Replayability: only by replaying TBS you will be able to discover the different decisional paths of each hero<br/></li><li> Domino System: a choice in the first minutes of play could have strong repercussions throughout the course of the adventure<br/></li><li> Fully narrated story, over 400,000 words and 40 hours of narration<br/></li><li> More than 700 HD illustrations<br/></li><li> Over 40 musical tracks<br/></li><li> 400 different detailed deaths<br/></li><li> Dying is part of the story, so there is no \"Game Over\". When a character you're playing as dies, you will play as a new hero, within the same story, in a different narrative path</li></ul><br/><strong>How many roads are you willing to take?</strong>", "metacritic": null, "released": null, "tba": false, "updated": "2023-01-10T20:19:28", "background_image": "https://media.rawg.io/media/screenshots/f47/f4730de27325b072a52ce102b296f590.jpg", "website": "https://www.theballadsinger.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 21, "beaten": 1, "toplay": 2}, "playtime": 3, "achievements_count": 40, "ratings_count": 1, "suggestions_count": 342, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "macOS"], "developers": ["Curtel Games"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Curtel Games"], "esrb_rating": null}