{"id": 604075, "slug": "anime-gacha-sim", "name": "Anime Gacha Sim", "name_original": "Anime Gacha Sim", "description": "Welcome to the world of mini anime where everything is cute! Here, you will start splendid two-dimensional cute-character casual development adventure games!<br/><br/>Anime Gacha Sim is a two-dimensional style, super healing and cute character costume adventure game with Q cute screen designs, rich clothing &amp; weapons tools, superb background scenes and dazzling NPCs. You can match different costumes and styles as much as you want, create your own personalized fan characters, interact freely with different NPCs, and complete various simple &amp; interesting game tasks!<br/><br/>Are you ready to start your adventures in Anime Gacha Sim? Players can create their favorite cartoon characters through thousands of materials given in the list, and use the created cute characters to interact with various NPCs in various scenes. Players can also use the created characters to design various scenes to create a perfect and interesting scene story!<br/><br/>Game features:<br/>--Create your own &amp; unique characters, and define her/his name, gender, specialty, and preferences!<br/>--Customize your character's personal appearance, freely change her/his hairstyle, skin color, eyes, mouth, expressions, etc.!<br/>--Dress up your character with the most fashionable anime fashion costumes! Mix and match hundreds of clothes, weapons, hair accessories, jewelry, hats and more!<br/>--Create a variety of smooth actions for characters, and get extraordinary fun &amp; experience by combining actions!<br/>--Explore different scenes with your own characters, discover new NPCs and design free chats with them!<br/>--Make your own anime story! Use hundreds of props to decorate multiple scenes and create exclusive story sketches!<br/>--Fun and interesting sushi restaurant upgrade games, unlock delicious sushi, get more coins and bonus diamonds!<br/>--Super-cute pet planting synthesis games, unlock more pet props and get bonus diamonds!<br/>--Save the super beautiful scene pictures and character design pictures locally and share them with your friends through the camera function!<br/>--Super healing &amp; relaxing casual game!<br/>--Play without Wi-Fi!", "metacritic": null, "released": "2021-01-05", "tba": false, "updated": "2021-05-17T03:55:51", "background_image": "https://media.rawg.io/media/screenshots/303/3030b4ce06925bea59fc4d580dc1015c_KUFRzGR.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 168, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["月 张"], "genres": ["RPG", "Simulation"], "publishers": ["月 张"], "esrb_rating": "Everyone 10+"}