{"id": 604022, "slug": "alan-sharp", "name": "Alan Sharp", "name_original": "Alan Sharp", "description": "<h3>Chapter 0: Prologue</h3>Dive into a dark world by taking the role of Sam Whithers - a young detective and ex-assistant of the legendary Alan Sharp. Unfold events that happened before Alan's arrival at the crime scene and find out the horrible truth. On the way, besides the investigation which brought him to Beggers Hole, Sam will face the demons of his past. Will his own sanity stop him from realizing the terrible truth? Or will the unholy entity consume him in the abyss before he finds out the tale of the Regan family?<br/><br/><br/><br/><br/>Get into the shoes of Alan Sharp, a private detective in the 1970s, retired and shattered due to the murder of a beloved one. A single call by an old friend takes Alan back on his track, leading you to a small town where a boy was butchered. The parents are missing, strange rumors spread among the folk talking of madness that consumed the father. Furthermore, others foretell of peculiar events and occurrences in the Regans’ home. Inspired by various psychological horror games and detective fiction, Alan Sharp takes the best elements of the horror games genre. Using uncertainty and fear of the unknown, above all, it provides a chilling atmosphere for the players to experience. As you investigate the mysterious murder, death lurks behind every corner. It lingers for a right moment to consume you in the dark and bury the truth of what happened to the Regan family.<br/><br/><h3>Features</h3><br/><br/>- <strong>Challenging Puzzles</strong> – Uncover the mystery case of a sinister evil by deciphering challenging puzzles that will test your logic, intelligence, and detective skills, keeping you on the edge of your seat<br/><br/><br/><br/>- <strong>Engage in Dialogue</strong> – Finding clues in objects is not enough for your investigation? Engage in conversation with the town’s folk. Doubt everyone, trust no one! Even your own senses!<br/><br/><br/><br/>- <strong>Search &amp; Acquire</strong> – Look for hidden clues in almost every object of the game. Be careful! The amount of usable objects you can possess is limited. Use your briefcase to store items for later use<br/><br/><br/><br/>- <strong>Journal</strong> – No need to know it by heart when there is a faithful journal in your pocket. Make sure to check it out if you need to remind yourself, it might assist you in deciding your next move.<br/><br/><br/><br/>- <strong>Wander</strong> the streets of Beggers Hole, stroll in a dark, vast forest, feel the chilling air of the beach and lose yourself in mysterious, strange corridors where hell is but a beginning.<br/><br/><br/><br/>- <strong>Psychological Horror</strong> – A sinister presence looms over you every step of the way, twisting your thoughts, bending your reality until you are utterly lost in the terror that rises.<br/><br/><br/><br/>- <strong>Survive</strong> – Look for a place to hide when a horrible danger tracks your steps<br/><br/><br/><br/>Alan Sharp has been in the works since 2015, developed by two developers. It is made with 0$ external funding, completely financed by the team behind it. Passion, motivation and dedication are the fuel pushing us all these years, as well as the love for game development. Have fun, peeps!", "metacritic": null, "released": null, "tba": false, "updated": "2021-05-17T03:20:23", "background_image": "https://media.rawg.io/media/screenshots/031/03153457120790b926d20399257a369e.jpg", "website": "https://www.alansharpgame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 415, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mystive Studios"], "genres": ["Adventure", "Indie"], "publishers": ["Mystive Studios"], "esrb_rating": null}