{"id": 604029, "slug": "whispered-secrets-ripple-of-the-heart-collectors-e", "name": "Whispered Secrets: Ripple of the Heart Collector's Edition", "name_original": "Whispered Secrets: Ripple of the Heart Collector's Edition", "description": "<strong>GrandMA Studios </strong>is back with the latest spellbinding installment in the Whispered Secrets series!<br/><br/>The son of an old friend is getting married, and you’re off to Flusstal for the wedding! But instead of festivities celebrating the happy couple, you arrive to find a town terrorized by dark magic! Something unnatural is lurking in the forests, and strange disappearances have citizens living in fear. Your only leads are rumors and a human-like fox that’s much more than meets the eye. Can you uncover the town’s dark past and stop it from destroying the present before it’s too late? Find out in this otherworldly Hidden-Object Puzzle adventure!<br/><br/>This is a special Collector’s Edition release full of exclusive extras you won’t find in the standard version. The Collector’s Edition includes:<br/><br/>•\tUncover the secrets of Ursula's past!<br/>•\tSee if you can seal away the Grimoire once and for all!<br/>•\tFind all the puzzle pieces and use them to complete the jigsaw puzzle!<br/>•\tEnjoy exclusive music, wallpapers, movies, and more!<br/>•\tComplete strategy guide included! Never get lost!<br/><br/>This is a Hidden Object Puzzle Adventure game, meaning a specific genre of story-driven, point &amp; click adventures. Throughout the game, players are tasked to find a list of objects hidden within a particular scene, and to occasionally complete various mini-games/puzzles.", "metacritic": null, "released": "2021-05-14", "tba": false, "updated": "2021-05-17T03:26:55", "background_image": "https://media.rawg.io/media/screenshots/ac6/ac6ec7a790116f414c63b71f5c4e0a1e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 5, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 580, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Grandma Studios"], "genres": ["Adventure", "Casual"], "publishers": ["Big Fish Games"], "esrb_rating": null}