{"id": 604093, "slug": "crime-streettrouble-maker", "name": "Crime Street:Trouble Maker", "name_original": "Crime Street:Trouble Maker", "description": "Do you love Kong Fu? Do you love action movies? Have you ever dreamed to be a hero likes Bruce Li? Then welcome to this famous street fighting game Crime Street! It will revive all those nostalgic memories and allow you to relive the classic arcade strategy games you grew up on!<br/>“Kick them all, make them fall!”<br/>As a kid who loves action movies and dreams of becoming a kung Fu star, accidentally falls into the movie world, in the face of axe gang you must clench your fist, fight your way out! Imagine that how quirky adventures and exciting battles you will experience?<br/>Now it's time for you to be a hero!<br/>In this funny and excellent fighting game where you can show off your special fighting styles and skills，there are no any complex operations: Crime Street provides an automatic combat mode which will search enemies and combo automatically, the only thing you need to do is taping the suspending icon to release different cool moves to defeat your enemies. It’s not easy to be a winner in a brutal showdown. Face different enemies defeat them and knock down them from the ring. Use quick reflexes and special moves, unleash hard punches, hit perfect kick and combos, beat all opponents and become the King of battle. <br/><br/><br/>[Game Features]<br/>-Interesting Characters: Funny rubber character, cute but full of energy - Classic controls have been made even better!<br/>- Roguelike Gameplay: exciting random combos <br/>-Amazing graphics and smooth animations!<br/>- More Real looking street fighting effects! Enjoy crushing your enemies!<br/>- Arm your Fist, learn varied skills.<br/>- Face varies of enemies! Defeat them and take all their territories!<br/><br/>* Language available: English<br/>* More languages are coming soon<br/><br/>Crime Street is free to download and play, but we offer in-app purchases for a richer gaming experience. This game is simple to play and extremely addictive.<br/><br/>Pre-registering it will be the best decision you ever make.<br/><br/><br/>SUPPORT：<br/><br/>Each feedback and creative idea are really appreciated!<br/>Please email us at crimestreetgames@outlook.com.", "metacritic": null, "released": "2021-01-21", "tba": false, "updated": "2021-05-17T04:05:25", "background_image": "https://media.rawg.io/media/screenshots/593/59347880f3dec47949f7a145543a2985.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 152, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Glory Star"], "genres": ["Action"], "publishers": ["Glory Star"], "esrb_rating": "Everyone 10+"}