{"id": 604065, "slug": "real-dj-club-spider-simulator", "name": "Real DJ Club Spider Simulator", "name_original": "Real DJ Club Spider Simulator", "description": "Real Dj Club Spider Simulator - create author's electronic music!<br/>Unique Dj console in the style of a spider in your phone!<br/>The design of the spider will be pleased with the richness of colors and the brightness of the design.<br/>Make music compositions by combining different sound effects and bits into one.<br/>The presented library of bits and finished tracks will please with the variety even the sophisticated players!<br/>A clear and simple menu allows you to turn the mixing process into a real attraction of electronic music!<br/>Rotate the plates, getting a timeless, legendary sound effect!<br/>Mix the tracks into a quality mix.<br/><br/>Share the application with your friends and create together!<br/>Happy family and relatives with the resulting songs!<br/>Get experience points and open access to high-grade quality tracks, for further information in a single set!<br/>Collect the entire collection and make incendiary parties!<br/>Save the resulting music!<br/>Start taking the first steps in the electronic music industry right now.<br/>Develop a sense of rhythm and creative imagination.<br/>Train your ears by learning all the subtleties of making music.<br/>Who knows, maybe it will be you who will submit to the big stage of the most famous openair!<br/> <br/>Share your ratings and comments.<br/>Create music with us!", "metacritic": null, "released": "2018-06-04", "tba": false, "updated": "2021-05-17T03:50:46", "background_image": "https://media.rawg.io/media/screenshots/3fd/3fdf30fbcde4343bb393a147efd51cc8_rtUBT9f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 66, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Irina Ivanova"], "genres": ["Simulation"], "publishers": ["Irina Ivanova"], "esrb_rating": "Everyone 10+"}