{"id": 60409, "slug": "alders-blood", "name": "Alder's Blood", "name_original": "Alder's Blood", "description": "<p>What is Alder&#39;s Blood?<br />\nAlder’s Blood, a fresh take on the tactial genre, which raises the tactical decisions of the player over the mere luck of RNG rolls.<br />\nLead the group of legendary monster slayers in the dark, twisted remnants of civilization. Gear up, scout ahead and hunt throughout putrid forests, forsaken castles, corrupted hamlets and cursed coves. Battle feral monsters and the Darkness itself, the corrupting force of the entire land.<br />\nAlder&#39;s Blood is a 2D fuse of stealth tactical and strategy game mixed with a few twists and fresh approach to the genre. We removed the RNG systems from core mechanics of the combat, as we believe that we can provide interesting and surprising experience without implementing the dice rolls.<br />\nKey features:<br />\nno RNG system in the base mechanics; forget all the missed shots fired just 1 meter in front of your enemy;<br />\nDarkness System can surprise you by changing the rules on the game in the middle of the fight;<br />\nStamina System - fail miserably just by losing your breath during combat;<br />\nSenses System - monsters can hear and SMELL you! Beware of the wind;<br />\nStrategy - a second gameplay layer, where you can research new gear, craft items and prepare for the next encouter;</p>", "metacritic": null, "released": "2020-03-13", "tba": false, "updated": "2020-12-16T14:41:59", "background_image": "https://media.rawg.io/media/screenshots/dd8/dd837665c628f12e9172c035f025db7f.jpg", "website": "http://aldersblood.com", "rating": 2.67, "rating_top": 4, "added_by_status": {"yet": 10, "owned": 45, "toplay": 24, "dropped": 4}, "playtime": 1, "achievements_count": 113, "ratings_count": 6, "suggestions_count": 246, "game_series_count": 1, "reviews_count": 6, "platforms": ["PC", "Nintendo Switch"], "developers": ["Shockwork Games"], "genres": ["Strategy", "Indie"], "publishers": ["No Gravity Games", "Fat Dog Games"], "esrb_rating": "Teen"}