{"id": 604100, "slug": "coin-merger-clicker-game", "name": "Coin Merger: Clicker Game", "name_original": "Coin Merger: Clicker Game", "description": "In the cold street, you hand the last money (two coins) to the little girl begging from you!Miracle happened! Two dollar coin, automatically merged into a 10 dollar coin!!<br/><br/>At the same time, a voice sounded in your mind, \"your kindness has moved me. The great God of wealth has given you the ability to merge coins. Come and have fun!...\"<br/><br/>Coin Merger is a wonderful casual game for people who want to kill time, reduce pressure and train brain<br/><br/>Features<br/>●  Coin Merging: merge the most precious and rare coins with the dropped base coins! Simple, fun, but also a little skill and luck!<br/>● Challenge Record: your every effort will be recorded. Can you synthesize the ultimate coin? How many ultimate coins can you synthesize? Break your own highest record and compete with players all over the world!<br/>● Cultivate the Golden Tree: the God of wealth gives you a golden tree. Whenever you synthesize the ultimate coin, the income of the golden tree will double! Build your strongest golden tree and get a lot of gold coins continuously!<br/>● Change Tools: use to change props. If the coin with drop is not what you want, you can use props to change to other coins;<br/>● Chance of Resurrection: when you are on the verge of failure, you can get a chance of resurrection in each game;<br/>● Rich Coins: up to 11 types of coins, each with its own unique style;<br/><br/>Now you can download and play this game for free!", "metacritic": null, "released": "2021-04-30", "tba": false, "updated": "2021-05-17T04:10:40", "background_image": "https://media.rawg.io/media/screenshots/9ae/9aefa5d4b51c34431befe3558dfd34ef.jpg", "website": "https://wow.deltafun.pro/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 85, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["振 李"], "genres": ["Strategy", "Casual"], "publishers": ["振 李"], "esrb_rating": "Everyone 10+"}