{"id": 60425, "slug": "alive", "name": "Alive", "name_original": "Alive", "description": "Alive is an 18+ Visual novel where the choices you make matter. There are optional minigames which can affect the outcome of different scenarios and the story as  whole. They can also be disabled if you prefer a more story-driven experience with less interactivity. <br/><br/>Alive contains over 6000 images, over a hundred animations, and a carefully selected soundtrack to enhance the experience along with multiple paths that make the story of each playthrough different.<br/><br/><br/><br/>Erin, the wild child and Nikki, her \"rock\". <br/><br/><br/><br/><br/>Mary the \"innocent\" barista, and Stacey the rich girlfriend of your best friend. You wouldn't betray him, would you?<br/><br/>Alive is a story of romance, drama, and maybe even betrayal. As you meet the characters and are introduced to the world, Erin's ex threatens everything. What does he want, and how will it end? That's up to you. And maybe you'll even have a little fun along the way.....<br/><br/><br/><br/>Maybe at the bar with Tonya...<br/><br/><br/><br/>Or Nikki at the pool...<br/><br/><br/><br/>Or even a night in with Erin...<br/><br/>Alive focuses first on the story and burgeoning relationships between the characters - and every new relationship has it's ups and downs  -<br/><br/><br/><br/>But what's a good story without a little bit of fun? Alive asks the simple question - what would you do, to feel Alive?", "metacritic": null, "released": "2019-07-11", "tba": false, "updated": "2023-04-17T08:09:12", "background_image": "https://media.rawg.io/media/screenshots/d55/d5512edc9eb07842185224eeb0cf7cde.jpg", "website": "https://opendoorgames.net/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 22, "ratings_count": 0, "suggestions_count": 285, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["OldGHZ", "Open Door Games", "Cskin Games"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Casual", "Massively Multiplayer", "Indie"], "publishers": ["OldGHZ", "Open Door Games", "Cskin Games"], "esrb_rating": null}