{"id": 604420, "slug": "iron-blood-itch", "name": "Iron Blood (itch)", "name_original": "Iron Blood (itch)", "description": "<p>Following a devastating pyrrhic defeat, our young knight wakes up under the dead weight of a nameless soldier and into a heart wrenching sight. As all is already lost, the knight decides to drag the last remaining commander down into the grave with him.</p>\n<p><em>The Iron Smell of Burning Blood</em> is a one-way adventure that follows a young knight in his quest for revenge. With a death wish and a deteriorating mental health, try to drag his constantly weakening body to either fulfill its spiteful oath or it's originally intended fate.\r\n</p>\n<ul><li>Recall your training by picking through 7 different skills, each with it's own perks, and choose one out of 3 weapons to wield.</li><li>Fight unique characters with unique sets of skills... before you equalize them all in death.\r\n</li><li>Your wounds, body fatigue and pain carry over from battle to battle. Every swing you make will take that little bit of energy you might need in your final moments.\r\n</li><li>Lastly.. enjoy a fancy UI.\r\n</li></ul>\n<p>A unique mix of lite text-adventure and turn-based combat topped with RPG elements such as skill-checks and lite skill-based progression.\r\n</p>\n<p>Cut your way through every obstacle, combat gruesome wounds, bodily fatigue and mind-numbing pain.  The state of your body and mind will decide whether you're up to the final challenge, just make sure you forgo any thought of living through it.\r\n</p>\n<p>-------------</p>\n<p>Installation guide:\r\n</p>\n<p>Simply extract and boot the executable. Try the .jar in case you have java installed and the executable isn't working.</p>", "metacritic": null, "released": "2021-05-16", "tba": false, "updated": "2021-05-17T05:34:30", "background_image": "https://media.rawg.io/media/screenshots/9e5/9e5b64e48ee45642dfb349bdf1a38078.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 145, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["ArchMason"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}