{"id": 60449, "slug": "bsl-winter-game-challenge", "name": "BSL Winter Game Challenge", "name_original": "BSL Winter Game Challenge", "description": "BSL Winter Games Challenge has now been updated to include Multi-Player mode. The game also includes Single-Player and Multi-Player Leaderboards. Play your friends and family on-line for bragging rights on the games multiple tracks and sleds. There are four (4) fast pace exciting tracks that are challenging with dramatic turns and length of course. Test your Speed and Time Skills against your favorite Country Team in the upcoming Winter Games. Choose between Keyboard, Mouse or Game Controller Input to best fit your style of play. Play either the Bobsled, Skeleton, or Luge in this 3 in 1 game. Try and beat your high scores and speed records each time you play. Twenty-four (24) teams to choose from and 3 different Camera Angles to enhance your gaming skills. This 3 games in 1 challenge play will keep you engaged each time you play. The game also includes a Holiday Bonus Track.<br/>\n<br/>\r\n•  User sets the Speed, Crash Sensitivity, and Input Control Type<br/>\n<br/>\r\n•  Four (4) challenging course runs with dramatic turns and different lengths of play. The game also includes a Bonus Holiday course.<br/>\n<br/>\r\n•  24 Teams to choose from<br/>\n<br/>\r\n•  Try and beat your high scores and high speed each time you play<br/>\n<br/>\r\n•  3 games in 1 challenge will keep you engaged each time you play", "metacritic": null, "released": "2018-03-07", "tba": false, "updated": "2019-08-28T21:58:51", "background_image": "https://media.rawg.io/media/screenshots/34a/34a14a9b2adc731c8399856c8cd80098.jpg", "website": "http://vtreeentertainment.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 219, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Vtree"], "genres": ["Action", "Simulation", "Sports", "Racing", "Casual"], "publishers": ["VTree"], "esrb_rating": null}