{"id": 60448, "slug": "retrowar-8bit-party-battle", "name": "RETRO\\war! 8bit party battle", "name_original": "RETRO\\war! 8bit party battle", "description": "<strong>RetroWar</strong> is a collection of 8-bit retro style arcade games.  For the Early Access release we are focused on <strong>single-screen multiplayer games</strong> that you play with your friends locally (i.e. sitting on the couch together.)  <strong>There is no single player mode</strong> (yet).Games<br/><ul><li> <strong>Ships</strong> - battle in the tradition of SpaceWar / Asteroids / Thrust / Subspace<br/></li><li> <strong>Droids</strong> - fast-paced twin stick shooter<br/></li><li> <strong>Tanks</strong> - tactical sniping game <br/></li><li> <strong>BombBots</strong> - drop bombs to blow up your opponents, but don't get caught in the blast<br/></li><li> <strong>GhostJumpers</strong> - platform race to be first while jumping over spooky enemies</li></ul><br/>Most of these games are made with our <strong>UniBlaster</strong> engine.  It's  designed with the specs of a 'fantasy' 1980s console, akin to an NES, but with modern standards for framerate, aspect ratio and controller input.  It's easily extensible, so you can mod games, mash up different games, or even create your own.Features<br/><ul><li>Old school low resolution gaming - no mixing of different sized pixels here.<br/></li><li>Authentic sound track of soundtracker mods and  8-bit chiptunes.<br/></li><li>Highly modable - change the music, graphics, rules, or write your own games.<br/></li><li>Play with controller or mouse/keyboard<br/></li><li>Designed for 4 players, but supports up to 16.</li></ul>Early Access plans<br/>We want feedback from you as to what you would like to play.  None of these features are guaranteed, but we plan to work on the features you support.<br/><br/><ul><li>Workshop support - download games made by other people<br/></li><li>Online multiplayer<br/></li><li>Steam Input (Steam Controller) support<br/></li><li>Linux and Mac support</li></ul>Known bugs<br/>If you plug in a new controller or change the screen mode you must quit the game and re-start it for the change to be recognised.  This is caused by a bug in a library we rely on, LibGDX.  We plan to replace LibGDX with Steam Input in the future.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T17:04:55", "background_image": "https://media.rawg.io/media/screenshots/a8e/a8eba43410a88faf87fa5e535d5a89b7.jpg", "website": "http://electronstudio.co.uk", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 88, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Electron Studio"], "genres": ["Action", "Indie"], "publishers": ["Electron Studio"], "esrb_rating": null}