{"id": 604474, "slug": "ragnarok-fragment-the-ice-goddess", "name": "Ragnarok Fragment - The Ice Goddess", "name_original": "Ragnarok Fragment - The Ice Goddess", "description": "<p><strong><em>Rag'narök Fragment - The Ice Goddess</em></strong></p>\n<p><strong>Intro<br/></strong>This is a very old project on mine, something I started over six years ago but I never decided to continue. Well, here I am today, trying to give this project on mine a second chance. The game was <em>almost </em>complete when I left it years ago, but I decided to make it go through a complete overhaul and maybe even add more bits to it as I grew more experienced with time, so... <br/>It'll take time and testing (although, much less. Especially balancing).</p>\n<p>To this day, I'm still not sure I want to invest my time into this project, thus why I decided to make a DEMO version of the prologue + the first hour and half of gameplay; based on how this project of mine will be welcomed, I'll decide if it'll be worth to continue or not.<br/>Also worth to note, English is not my native language.</p>\n\n<p><strong>What is <em>Rag'narök Fragment </em>?<br/></strong><em>Rag'narök Fragment</em> was and still is a very ambitious project; I had a clear vision in mind: A long and satisfying old-school RPG experienced which dwells deep into not only narrative, but also into character grown and... Challange.<br/>The game will have many, many side events and side bosses, with a few of them being extremely challanging to the point that extreme knowledge of the game (and proper gear, of cours) will be required to even dare start the fight.</p>\n<p><strong>Battle System<br/></strong>I know, many people raise a brow when they see a turn-based combat system, but I've always been a fan of it since the glorious old days. Though, I decided to spice it up. Advanced boss fights will be extremely challanging, and not only because of the damage output those mosnters will be able to inflict, but because they will ask the player to think about every single move they'll make, and will punish those who will tackle a hard boss with the \"smash attack and most powerful spell to win\". Hard boss fights will require strategy, well time actions and awareness; this was my biggest goal. And, as time went by during the earliest development of the game, I would say I was very satisfied with the outcome and the challange I was able to provide.</p>\n<p><strong>Story<br/></strong>Narrative is the main focus of the game. <strong><em>Rag'narök Fragment</em> </strong>universe is massive, and the events who will take place in this game have deep roots in it's past.. and future.<br/>When I said this project was ambitious I wasn't kidding; to be able to finish the full narrative, I had and still have planned a trilogy... But now, let's focus on what to expect on this chapter, shall we?</p>\n<p><em><br/>A long, everlasting war has afflicted the world of Ebon for over five hundred years, and the fate of the entire universe depends of it's outcome.<br/>One after another, the Gods have fallen to a monstrous entity known as <strong>Nykephoros</strong>, who only seeks the destruction of all Gods; but why? What could this bring to him?<br/></em><em>Only one Deity remains alive to this day, all alone, fighting still to this day against a monstrous Demon. <br/>Will she survive, or will she fall?</em></p>\n<p><strong>The Ice Goddess </strong>will be the fist episode of <strong><em>Rag'narök Fragment</em>, </strong>and will see the player tackling it's story with <strong><em>Arrowny, </em></strong>a twenty-one years old girl who lost her memories when she was only seven.<br/>A grand total of nine main characters are present in the game, with the addiction of a few guests ones to spice things up! Every single one of those characters has an important role in battle; A tank, a healer, a mage, a debuffer... What to use during battle, is up to you; find the most powerful combination, and tackle on the challanges this world has to offer you.<br/><br/></p>\n<p><strong>Characters<br/></strong>As of right now, I don't think is time to discuss about the characters, but what I can say is that, as stated before, the focus of this project is narrative; and no good story is every memorable without it's characters.<br/>Every single character that will join your party, and even the side ones, has a backstory of it's own and a conclusion, but discovering all the pieces and details... is up to the player.</p>\n<p><strong>Conclusion </strong>(for now!)<br/>I really hope this little DEMO will be enough to atleast showcase the potential and charm of this project of mine and please, let me know any of your thoughts as you play through it.<br/></p>\n<p>The DEMO is up for free but any donation will be appreciated. Thank you in advance if you decide to support this project!</p>", "metacritic": null, "released": "2021-05-16", "tba": false, "updated": "2021-05-17T05:48:49", "background_image": "https://media.rawg.io/media/screenshots/fd7/fd70ebfcddb9a903ff732a5e63fd9e2f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 131, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ElgarS"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}