{"id": 60452, "slug": "break-the-blocks", "name": "Break the Blocks", "name_original": "Break the Blocks", "description": "Break the blocks with anger, because not only do you have to break them because you want to pass the game. Break the blocks because those blocks symbolize the many barriers and obstacles that you encounter in your life that prevent you from being happy<br/>\r\nMaybe you think it's the typical game of breaking blocks without meaning, but it's not like that, as you've already seen the philosophy in this game is very intense.<br/>\r\nDrive the ball (your life) with the platform that you move (your decisions) in order to get rid of everything that bothers you. And keep in mind that the way you move the platform (the decisions you make) can make you break the blocks better or worse.<br/>\r\nSo if you want to stop being a wretch and become a winner buy \"Break the blocks\" and play it to prepare for the battle against the particular blocks of your life.<br/>\n<br/>\n<br/>\r\nBreak the blocks is a game that reminds the old retro games from a lot of years ago, his art style and gameplay are compleatly inspired in those games.<br/>\n<br/>\r\nThe objetive of this game is to break all the bricks (with alien form) that will be on the top of the level, forming different levels.<br/>\r\nYou need to control \"your magic table\" to make the ball move and destroy that alien breaks by touching them.<br/>\r\nThe idea is to make it without losing any points and in the less time possible, you may need to do it with strategy and ability moving the ball.<br/>\n<br/>\r\nWhat to expect:<br/>\n<br/>\r\n-Retro style in all gameplay aspects<br/>\n<br/>\r\n-Good sound effects<br/>\n<br/>\r\n-You can play various levels while you go on in gameplay<br/>\n<br/>\r\n-Every level has different \"block building\" in order to have a different gameplay experience in each level<br/>\n<br/>\r\n-Difficulty level also increases while you go in in gameplay and levels<br/>\n<br/>\r\n-3 lifes avalible in every levels, giving you the possibilite of failure in all the levels you play<br/>\n<br/>\n<br/>\r\nHow to play:<br/>\n<br/>\r\n-AD to move the \"magic table\" and move the ball<br/>\n<br/>\r\n-Mouse to navigate and push buttons", "metacritic": null, "released": "2015-05-06", "tba": false, "updated": "2019-10-18T04:20:41", "background_image": "https://media.rawg.io/media/screenshots/985/9850868149477d33ecef6424a146e793.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 52, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "PC"], "developers": ["Miroslaw Zielinski", "Garnudo Games"], "genres": ["Strategy", "Simulation", "Board Games", "Casual", "Indie", "Puzzle"], "publishers": ["Miroslaw Zielinski", "Garnudo Games"], "esrb_rating": "Everyone 10+"}