{"id": 604541, "slug": "o-chao-e-lava-demo", "name": "O Chão é Lava DEMO", "name_original": "O Chão é Lava DEMO", "description": "<p><strong>WARNING: </strong>The game were made using Unreal Engine 4, but the characters and helicopter models were made using Autodesk 3ds Max Student version just for my studies on how to start creating a game, which means that you and I cannot profit from it or reuse the models! Autodesk and Epic Games, please don't sue me! However, the final version will be made with other 3D modeling software so that we can use the models normally!</p>\n<p>With that in mind, I hope you have fun with this short demo, here we have the Earth that was dominated by lava aliens that seek to feed on everything that is organic, from living beings to objects. You are a trained soldier who must end these aliens and save humanity! This game is in English and Portuguese!</p>\n<p>This is the first game i made, i hope you like it! Have a good time!</p>\n<p><strong>AVISO: </strong>O jogo foi feito usando Unreal Engine 4, mas os modelos de personagens e helicópteros foram feitos usando a versão Autodesk 3ds Max Student apenas para meus estudos sobre como começar a criar um jogo, o que significa que você e eu não podemos lucrar com isso ou reutilizar o modelos! Autodesk e Epic Games, por favor, não me processe! Porém, a versão final será feita com outro software de modelagem 3D para que possamos usar os modelos normalmente!<br/></p>\n<p>Com isso em mente, eu espero que você se divirta com essa pequena demo, aqui temos a Terra que foi dominada por aliens de lava que buscam se alimentar de tudo que for orgânico, desde seres vivos até objetos. Você é um soldado treinado que deve acabar com esses aliens e salvar a humanidade! Esse jogo está em Português e Inglês!</p>\n<p>Este é o primeiro jogo que eu fiz, eu espero que goste! Divirta-se!</p>", "metacritic": null, "released": "2021-05-16", "tba": false, "updated": "2021-05-17T06:07:42", "background_image": "https://media.rawg.io/media/screenshots/170/170801c0a8bcdecdeed46ec3e6db27c4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 156, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Braian Alves Pereira"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}