{"id": 60456, "slug": "pass-the-wall", "name": "Pass the wall", "name_original": "Pass the wall", "description": "This may seem like a simple game to entertain, without more pretensions than that, but if philosophy hides something else.<br/>\r\nIn this game you drive to a cube that has to be placed correctly to go through a wall with holes, if it is not placed well it will not pass and it will lose.<br/>\r\nThis symbolizes how the cube (a person) has to be placed in the right way to pass each level (behave as society dictates) if you do not want to lose<br/>\r\nThis points out how society obliges individuals to behave in the way society dictates, and if you do not behave like that, you are out, and you \"lose\" in life.<br/>\n<br/>\r\nPass the wall is an easy and simple indie game needed of good reflexes and fast thinking to play.<br/>\r\nThe goal of \"Pass the wall\" is to get through every wall that you find every few seconds. All the walls have holes in them, 1 hole for the cube you are controling and the rest of the holes are in the same position as the columns.<br/>\r\nEnjoyable gameplay and lots of fun will be achieved while playing<br/>\n<br/>\r\nWhat to expect:<br/>\n<br/>\r\n-Good sound effects and music while playing<br/>\n<br/>\r\n-Best score will be stored in the game, you can try to beat your highscore<br/>\n<br/>\r\n-Apart from passing the wall, you can take points passing through collectible objetets to get more points<br/>\n<br/>\r\n-The walls' order is compleatly random, so every time you play will seem different to the previous time<br/>\n<br/>\r\nHow to play:<br/>\n<br/>\r\n     -You just need to get a mouse to use the menus and play", "metacritic": null, "released": "2018-09-21", "tba": false, "updated": "2019-08-28T21:58:50", "background_image": "https://media.rawg.io/media/screenshots/101/1012b8c0d201a9ae27c6cb57f8583e9c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 48, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Garnudo Games"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["Garnudo Games"], "esrb_rating": null}