{"id": 604880, "slug": "overtime-simulator", "name": "Overtime Simulator", "name_original": "Overtime Simulator", "description": "<p>let's say, in a hypothetical situation, if your boss asked you to build something for him that had no initial appearance of anything that could possibly have any tangible value or real purpose at 7pm on a Wednesday especially considering you've already been staying late, would you build it?<br/></p>\n<p>you might. and you'd try really hard to also, wouldn't you?</p>\n<p>and you'd run to his office after you completed it, slowing down just before the door and opening it cool-mannered to show how casual you are about the whole thing, also showing him how dependable you are and how much initiative you have even at 7:30 pm, and then you'd hand him his weird seemingly meaningless gizmo he wanted built, expecting a reaction of pleasant surprise and gratitude, right?</p>\n<p>It's definitely possible that you would.</p>\n<p>and the best part is, you can</p>\n<p>in......</p>\n<p>OVERTIME SIMULATOR</p>\n\n\n<p>Disclaimer: this game is kind of frustrating i'm sorry in advance</p>\n<p>Pressing ESC will quit the game, there's no confirmation or anything so be careful pressing it unless you are intending to quit</p>\n<p>If you're having trouble getting it to run on mac, LynxesExe's answer on this thread may help you get it running: https://itch.io/t/656311/i-cant-open-the-game-on-mac-os-catalina-maybe-because-i...</p>\n\n<p>also pro tip: Play with your index finger on lmb, middle finger on mmb, and ring finger on rmb. That may sound crazy but trust me\r\n</p>\n\n\n<p>CREDITS</p>\n<p>Design, programming and art by Shane Torres </p>\n<p>Elevator song by Shane Torres. Listen here on soundcloud! https://soundcloud.com/shane_torres/730-pm</p>\n\n<p>Janitor song: What Else You Got Left by Rozkol</p>\n<p>Icons from Pixel Perfect, freepik, Creaticca Creative Agency, and bqlqn</p>", "metacritic": null, "released": "2021-05-15", "tba": false, "updated": "2021-05-17T07:33:26", "background_image": "https://media.rawg.io/media/screenshots/2f5/2f5843265de6da5526da466c995ce3eb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 31, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["stor314"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}