{"id": 604899, "slug": "pop-art-drink-smart", "name": "Pop Art Drink Smart", "name_original": "Pop Art Drink Smart", "description": "<p>Pop Art Drink Smart is a very simple drinking game simulation that allows you to play in Free For All or in Teams mode. The goal of the game is to collect points by doing various tasks which cards give you. If you refuse to do the task you lose 10 points. The player loses additional points if he breaks the glass, vomits, or gives up the game. Before starting the game in a mode you set the score which has to be beaten in order to win the game. Currently, there are 110 different cards every with different artwork presenting pop art artworks downloaded from Freepik. com which I used very often doing freelance in graphic design looking for mockups and stock images. In the future, we are planning to add more cards and different decks. To be specific plan is to develop an Anime card deck and deck with cards drawn digitally from artists in our team. So for the start, we put into the game a couple of cards from those other decks which are in development. Cards are repeating so the game can continue until the score is beaten. The maximum score is 10 000 points so one game can last very long but the question is can you or your liver handle it.</p>\n<p>As a bonus for now I also put apk. file which you can put on your Android and install it and play it. Android version, for now, has only a Free For All game with 50 cards because the game would be 300+ Mb if I made the same version like Desktop App for Windows.</p>\n<p>Thank you for using our software</p>\n<p>This was a group project in game development education at PISMO INKUBATOR</p>\n<p>We would like to thank our mentor Dominik Cvetkovski</p>\n<p>We are:</p>\n<p>Dejan Seretinek - Game Designer, Graphic Design, UI Designer</p>\n<p>Saša Borojević - Man Menu Designer</p>\n<p>Matej Jelić - Programmer</p>\n<p>Domagoj Petrović - Programmer</p>", "metacritic": null, "released": "2021-05-15", "tba": false, "updated": "2021-05-17T07:40:16", "background_image": "https://media.rawg.io/media/screenshots/7e8/7e87418c7e15e94b9332f97a996c0d89.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 212, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["iDejo"], "genres": [], "publishers": [], "esrb_rating": null}