{"id": 604981, "slug": "mt-typing-test-free-version", "name": "MT Typing Test | Free Version", "name_original": "MT Typing Test | Free Version", "description": "<p>A minimalistic, fully customizable typing program. Challenge yourself in typing, and track your results from time to time. Want to test your new employee at your company? or see how fast you can type than anyone else? MT Typing Test is the answer.</p>\n<p>MT Typing Test is a semi-game typing program that you can track your skill at typing,<br/>In the MT Typing Test, you can practice and improve your typing skills and compete with other typists. </p>\n<p><strong>- Our Focus is to make you Focus</strong><br/>We will make sure that when you type, nothing gets in the way, So you can focus on what you're doing. Smooth animation, transition, and good user experience will make you in love with typing.</p>\n<p><strong>- Fully Customizable Background, Image, Font, Color, Text, Keyboard Sound, and much more!</strong><br/>Are you bored with just that same typing test theme? Try the MT Typing Test. Here you can customize almost everything in the app to keep you from getting bored and the best typing experience possible. with minimalist and professional appearance will make you look like a master of typing.</p>\n<p><strong>- Timer, Stopwatch &amp; Difficulty Settings</strong><br/>With support for up to <strong>300+ words </strong>in 6 different languages<strong> </strong>and 3 difficulty options: Normal, Hard, and Master. Or you don't want a fast timer? You can change the timer from 15 to 180 seconds.</p>\n<p><strong>- Custom Text<br/></strong>Want to write quotes? or write long paragraphs for thesis practice? You can write your custom paragraph with the MT Typing Test.</p>\n<p>- <strong>Faulty Keyboard Test</strong><br/>With this feature, you can check your keyboard per key. With the press &amp; release history, you can also monitor double clicks or unregistered keys.</p>\n<p><strong>- Detailed Results<br/></strong>You can track your words per minute to characters per minute. With very detailed results, you can find out your real ability to type. You can even screenshot your result and share it with other people!<br/></p>\n<p><strong>- Leaderboard<br/></strong>Compete with other typists to find out how fast you can type with other people. 100WPM? 200WPM? Who knows?</p>\n<p><strong>Other Features :</strong><br/>- Full Cloud Services<br/>- Account &amp; Company Profile<br/>- Recording Mode<br/>- Custom Keyboard Sound<br/>- Result Screenshot<br/>- Multi-Languages Support<br/>- Customizable Font Size even words per row <br/>- Active Support<br/></p>\n<p>Purchase the full version here</p>", "metacritic": null, "released": "2021-05-15", "tba": false, "updated": "2021-05-17T08:02:45", "background_image": "https://media.rawg.io/media/screenshots/41f/41ffe8a7fe180409cf3de4bb571d8fb2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 116, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MelvinTang Games"], "genres": [], "publishers": [], "esrb_rating": null}