{"id": 605009, "slug": "recycle-mission-twistdrabbit", "name": "Recycle Mission (TwistdRabbit)", "name_original": "Recycle Mission (TwistdRabbit)", "description": "<p>Simple 16-bit platformer, collect the items if rubbish and deposit them into the bins, once all 40 are collected head back to the start area and touch the spinning star.</p>\n<p>As part of my HNC Year studying Game Development, I was tasked with working in a small team to  prototype a  game based on the theme of \"Save the Earth\" and a target audience of \"School Kids between 9 and 11 years old\".<br/><br/>Myself and my team, Silviu, Ryan and Ethan Brainstormed ideas as we could interpret Save the Earth any way we liked.<br/></p>\n<p>We decided to focus on environmental education and geared the game towards Recycling, the game world reacts to the players actions, as more rubbish is collected and deposited into the bins plants will begin to appear and the drab grey background will begin to brighten, eventually the world will be filled with beautiful flowers and the sky will be blue, giving players a sense of accomplishment and showing them the potential benefits of recycling in real life.</p>\n<p>Ryan- Worked on some coding and art as well as tested the game. \r\n</p>\n<p>Ethan- did some concept art for the game. <br/></p>\n<p>Silviu (https://noelstudios.itch.io/)-  Ran project lead on this one. Worked on allocating tasks and did some programming and concept art. Worked on finding music and did most of the UI.<br/>Myself - I created some of the artwork, all of the in-game assets, bug testing, some debug coding and created the in-game audio.</p>", "metacritic": null, "released": "2021-05-15", "tba": false, "updated": "2021-05-17T08:11:14", "background_image": "https://media.rawg.io/media/screenshots/6f0/6f0ec25d4d5b684e08886c1e98c67575.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 72, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["TwistdRabbit"], "genres": ["Educational", "Platformer"], "publishers": [], "esrb_rating": null}