{"id": 605187, "slug": "ecuminopolis", "name": "Ecuminopolis", "name_original": "Ecuminopolis", "description": "<p>In the Ecuminopolis, there are few things that are guaranteed to the citizens that live there. In Block 118, you'd be lucky to scrape by with your boots still on until the following day. You play as a police officer, trying to help out the good people of Block 118, maybe giving some people there a glimmer of hope. In a hopeless land, you can be the light that people need. </p><p>This is a third person narrative experience that focuses a lot on environmental story telling. I wanted the player to understand the space that they were in without being told explicitly what was going on. Such as there being a space in the experience where it tells the player how the citizens get their drinking water. There's trash all over the ground to imply that there isn't much in terms of maintenance, especially with all of the dirt around. There's also some dialogue with four different NPC's. Each of them with their own reasons for being where they are in that moment. Such as a segment where the player encounters four NPC's partaking in an auction for a hunting rifle. These events are all things that would have happened had the player come across the character's or not. There is an instance of a person waiting for the player to talk to them, and that's because Vincent had called ahead and wanted the character to talk to the player. </p>\n<p>To open the Quest Log, press the \"J\" key on your keyboard.</p>\n<p>Link to my portfolio! -  https://jakereilly20.wixsite.com/jakebuildsgames<br/></p>\n<p>Vision Document - https://docs.google.com/document/d/1PRGzgb72TsBrS8R2EgybcYJM6R-ShweRzq0IcuU_5HY/...</p>\n<p>Credits </p><p>Design by Jake Reilly</p>\n<p> Sci-Fi City by Synty Studioshttps://assetstore.unity.com/packages/3d/environments/sci-fi/polygon-sci-fi-city...</p>\n<p>Urban Night Sky by Kendal Weaver https://assetstore.unity.com/publishers/40099</p>\n<p>Music - Intuit by Kevin MacLeod</p>\n<p>Link: https://incompetech.filmmusic.io/song/3922-intuit</p>\n<p>License: https://filmmusic.io/standard-license</p>\n<p>Rain Sound Effect by Inuetc https://freesound.org/people/inuetc/sounds/507902/</p>", "metacritic": null, "released": "2021-05-14", "tba": false, "updated": "2021-05-17T09:00:37", "background_image": "https://media.rawg.io/media/screenshots/b64/b64cae7e7a2b111e8b280e34505ff4b1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 140, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mercenary Studios"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}