{"id": 605227, "slug": "youre-cute-a-princess-panic-interlude", "name": "\"You're Cute\" a Princess Panic! interlude", "name_original": "\"You're Cute\" a Princess Panic! interlude", "description": "<p><strong>Ren'Py Web is still in beta. If the game above doesn't work in your browser, fret not, there are Win/Mac/etc downloadable versions below!</strong><br/></p>\n<p><strong>Princess Panic!</strong> is a story about two princesses who both find themselves on a quest to rescue each other! It started out as a game idea back in the early 2010s, finally got goin in webcomic form in 2020 ( princesspanic.website ), and now, after 3 chapters, is continuing on in the form of Visual Novels.</p>\n<p>This is the first one! And to help Jackie ease herself into the new format, it's somewhat short and linear... It's a starting point, a demo of things to come, as it were! But most of all, it's a cute little story &amp; she hopes it'll make people happy~</p>\n<p>Princess Panic! mostly focuses on Princess A and Princess B, and their individual quests to rescue each other. As such, the main story won't involve the couple being together very much, which is a bit of a shame! So Jackie created interludes for the story that will always focus on the past, and the things A &amp; B did together before this silliness started. And <strong>\"You're Cute\"</strong> is the story about the day they first properly meet.<br/></p>\n<p>There will be more Princess Panic VNs in the future, all of which should be a bit longer and more elaborate than this one. Needless to say, the more support Jackie gets, the easier time she'll have making these!<br/></p>\n<p>Please enjoy! Thank you!<br/></p><p>The DL version of the VN is below. The game is free, with an option to donate if ya want. The web version above may or may not work for ya, but the DL version should work just about everywhere.</p><p><strong>Support Jackie at patreon.com/timeforjackie</strong><br/></p>", "metacritic": null, "released": "2021-05-14", "tba": false, "updated": "2021-05-17T09:12:39", "background_image": "https://media.rawg.io/media/screenshots/7b9/7b9ea44722d28654e37fe2d87c0f15b1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 76, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["Jackie Lesnick"], "genres": [], "publishers": [], "esrb_rating": null}