{"id": 605379, "slug": "candleman-itch", "name": "CandleMan (itch)", "name_original": "CandleMan (itch)", "description": "Install instructions<p>L'idée :<br/></p>\n<p>Le but du jeu est d'allumer des bougies sur un gâteau d'anniversaire tout en essayant d'évitez les ennemies ou de les éliminer. Merci à FightersTube vous le concept du jeu ! Car j'était perdu l'ors de l'annonce du thème de la deuxième GAWC.\r\n</p>\n<p>Ce qui c'est bien passé :\r\n</p>\n<p>Tous c'est globalement bien passé sauf quelque petites chose dont je parle plus bas.\r\n</p>\n<p>Ce qu'il c'est mal passé :\r\n</p>\n<p>Au début j'ai trouvé l'idée du jeu superbe, et elle l'est ! Donc je par dessus les yeux fermé (comme j'ai l'habitude de faire). Un peux plus tard je me rend compte que je reste trop dans ma zone de confort, Donc moins de motivation, Je me forçait à continuer tout en espérant d'avancer. Cela a durer 1 jour Puis je n'ai plus ouvert le projet avant lundi, Mais ma motivation n'était toujours pas présente, J'avais abandonné le projet en quelque sorte, je m'y suis remis mercredi pour continuer rapidement car j'avais la motivation de continuer. Ma motivation viens de : ( Je ne peux pas rendre un projet sans avoir au moins fait la moitié ), donc j'ai continuer jusqu'à faire la moitié et je le rend sans lui faire de prochaine mise à jour, Tous simplement car je n'ai plus envie de développer sur ce projet.\r\n</p>\n<p>Ce que j'ai appris :\r\n</p>\n<p>Ne jamais rester dans sa zone de confort car cela est voué à l'échec.\r\n</p>", "metacritic": null, "released": "2021-05-14", "tba": false, "updated": "2021-05-17T09:51:20", "background_image": "https://media.rawg.io/media/screenshots/2b6/2b698b87b37bb42ac87e07b1aa5c6c5c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 11, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MilkerBretzel404"], "genres": ["Action"], "publishers": [], "esrb_rating": null}