{"id": 60533, "slug": "idol-manager", "name": "Idol Manager", "name_original": "Idol Manager", "description": "You take on the role of manager at a small (but growing!) talent agency. As you cultivate and train the newest generation of young pop stars, you&#39;ll have to decide who to hire and who to fire, who gets promoted when things go well and who gets reprimanded when things get sour. The personal lives of these young celebrities are a part of your business, and the life of a pop star isn&#39;t always a happy one. Their crowning personal achievements can be your greatest commercial successes, but their emotional meltdowns and PR nightmares can spell financial disaster for your company.<br />\nIt&#39;s not just the idols you have to worry about. The world is full of gossip magazines, super fans, and rival groups, all thirsty for a scoop on the latest scandal. There&#39;s a lot of people who want to tear you down and are willing to play dirty, but try not to let it get to you. It&#39;s not personal, it&#39;s business.FeaturesDecide how to deal with crises including gossip, vandalism, stalkers, or threats directed at your agency and the pop idols you manage.<br />\nManage relationships between the different idols in your group, as you deal with cliques, internal feuds, and bullying.<br />\nGrow your fanbase by varying your tactics and appealing to a wide variety of demographics.<br />\nProduce singles, hold concerts, organize huge TV events and overseas tours to capitalize on your group&#39;s popularity and bring in revenue.<br />\nDevelop your agency&#39;s building. Start with simple offices and dance rooms to produce content and train your idols, and end with your own cafe and theater to create a steady stream of revenue. Hire and train staffers to help deal with logistics and keep your agency running smoothly.<br />\nDiscover substories - chains of events and visual novel segments, many of which are triggered by your play style. Each substory can play out in multiple different ways based on your decisions, often causing serious consequences for your playthrough.</p>", "metacritic": null, "released": "2021-07-27", "tba": false, "updated": "2024-04-15T20:00:15", "background_image": "https://media.rawg.io/media/screenshots/930/9305c117592f89420ff452ffcda105f9.jpg", "website": "https://idolmanager.net/", "rating": 3.48, "rating_top": 4, "added_by_status": {"yet": 7, "owned": 141, "beaten": 9, "toplay": 11, "dropped": 16, "playing": 3}, "playtime": 7, "achievements_count": 95, "ratings_count": 22, "suggestions_count": 223, "game_series_count": 0, "reviews_count": 23, "platforms": ["PC"], "developers": ["GlitchPitch"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["GlitchPitch"], "esrb_rating": null}