{"id": 60554, "slug": "heathen-the-sons-of-the-law", "name": "Heathen - The sons of the law", "name_original": "Heathen - The sons of the law", "description": "HEATHEN is a solo story driven adventure with an immersive First Person view. (F.P.S)<strong>Inspired by the novel \"The island of Doctor Moreau\" by HG Wells.</strong> <br/><br/>The English expedition \"Peary &amp; Scott\" discovers an island populated by strange and ferocious creatures. Half-human, half-animal, they were created by the famous Dr. Moreau. Peary, a scientist and biologist, resumes his work.<br/><br/>At a time when the abolition of slavery continues to grow worldwide, Scott, a wealthy industrialist and close to the royal family, sees huge potential in those \"beasts\": Cheap, hardworking manpower, easily renewable, and gifted with remarkable physical abilities.<br/><br/>In just 20 years, in secret, Peary and Scott will create hundreds of these \"beasts\" and build an empire. Inevitably, however, humans will lose control of the island: The north is occupied by humans, trapped and hidden behind their wall; while the rest of the island is populated by various generations of \"beasts\", which are often hostile towards each other. Most degenerate very quickly, and fall in bestial madness.<br/><br/>This is where your story begins: you are one of those \"beasts\". Your task will be long and difficult: Explore, develop, understand and reclaim the island, while respecting the law of Moreau.<br/><br/>Will you keep your faith in humanity until the end of this journey ?<strong>Key Features:</strong><br/><br/><ul> <li>Get ready for a great challenge and an eerie atmosphere.<br/> </li><li>Fight types of original enemies with different behaviors and unique attacks.<br/> </li><li>Kill your opponents with different fire weapons and melee moves or use your stealth to avoid the dangers.<br/> </li><li>Become a beast to liberate yourself from difficult situations.<br/> </li><li>Resolve riddles to find a passage through the world and a path to your soul.<br/> </li><li>Search for items and pages to discover your story and unlock achievements.</li></ul><strong>“I must confess that I lost faith in the sanity of the world”</strong><br/>― H.G. Wells, The Island of Dr. Moreau<br/><br/>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:58:47", "background_image": "https://media.rawg.io/media/screenshots/a36/a3663ac1e26943baa14242818f12d75a.jpg", "website": "http://www.heathengame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 6, "toplay": 1}, "playtime": 5, "achievements_count": 48, "ratings_count": 1, "suggestions_count": 541, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Frog Factory"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["The Box Studio"], "esrb_rating": null}