{"id": 605549, "slug": "last-blossom-roleplaying-tabletop-based-scene", "name": "Last Blossom: Roleplaying tabletop based scene", "name_original": "Last Blossom: Roleplaying tabletop based scene", "description": "<strong>Last Blossom</strong> it's a short game scene, based on one well-known tabletop roleplaying game. I tried to reproduce the game rules with some accuracy, so it contains, if I may say, only a few \"home rules\". So this scene may help to understand some of the basic rules of roleplaying tabletop games.<br/><br/><br/><br/> If you are a lonely adventurer that standing on a crossroad with grey, boring and empty life on one way and creative, unbelievable and full of discoveries life of a roleplayer in another hand - i hope Last Blossom will help you to choose the right road.<br/> And if you will not be quite inspired about all of this - just be sure that real roleplaying games with the right people are way better, so please don't give up!<br/><br/><br/><br/> This scene is pretty short, so if you don't want to have more spoilers - you may consider just to try it first. But if you need a features list, well...<br/><strong>Features:</strong><br/><ul><li>Dice rolls - cruel but honest random and its deadly consequences!<br/></li><li>Tense conversation<br/></li><li>Turn-based battle<br/></li><li>3 playable characters<br/></li><li>Different ways to achieve the goal<br/></li><li>Fantasy adventure atmosphere, made of Low poly, patchy animation, 8-bit sounds, and Unreal Engine 4 features</li></ul><br/>I tried to put in this scene more or less full tutorial and <strong>detailed \"Help\"</strong> section, so if you are a beginner in this kind of genre, or maybe you not quite often playing in videogames at all - you still have a chance to figure out how it works.<br/> If you will have some trouble in understanding of what's happening in the game, or what you need to do - i would be grateful if you let me know about you're problem.<br/><br/><br/><br/> OGL notice:<br/> This game contains some of the Open Game Content that  used under and in terms of Open Gaming License Version 1.0a.", "metacritic": null, "released": "2021-05-20", "tba": false, "updated": "2021-05-21T02:33:23", "background_image": "https://media.rawg.io/media/screenshots/194/1948516569500dc708c5dde3f03e6649.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 346, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Vadym Lysytsia"], "genres": ["RPG", "Strategy", "Indie"], "publishers": ["Vadym Lysytsia"], "esrb_rating": null}