{"id": 605574, "slug": "catsperience", "name": "Catsperience", "name_original": "Catsperience", "description": "Are you curious what it's like to be a cat? This is your chance. Eat, sleep, be a jerk. Repeat. Oh wait, there is a problem. The food provider is missing, what will you do now? A blue-blooded cat doesn't hunt after all. Find him befur you will be in need of such a menial task.<h3>Experience what it’s like to live like a real cat</h3><ul><li>Climb up the furniture, push things off the table and show that human who is the boss in da house.<br/></li><li>The destructible items of the mansion are waiting for your devastating paws.<br/></li><li>Hunt those pesky running squeaking meatbags.<br/></li><li>Speak in sarcastic tone to be be a real aristocratic jerk.<br/></li><li>Rest in cosy boxes, and feel the purrfection.<br/></li><li>Be a smart cat and find out how you can get in and out of places where you don't belong.</li></ul><h3>Do you like it dry? Here it is</h3>In Catsperience you play as a sarcastic tomcat addicted to catnip. The story is heavily based on cat humour and the daily struggles of being a cat. The gameplay is like an escape room game with some 3D platformer elements.<br/><br/>You find yourself in a difficult situation, when one day all the food and the provider are gone. Discover clues, solve puzzles, and explore the mansion room by room with the help of the magical catnip in order to find a way out from the old, victorian-style manor house.<br/><br/>Attention: According to feedback, the puzzles in this game are extremely challenging. Most of the puzzles are level 7-9, it will probably take hours to solve them.<h3>Note frome the developers</h3>Before you purchase please consider that this game was developed by a very passionate cat lovin' couple and not by a huge company with the help of Cirmi, the demonic tomcat who helped a lot with voice acting. He meowed hard during the whole recording and tried to give his best performance. He will recieve his fair share of our sales in his favorite snack. We assume that Cirmi sends his best regards or he might be just sleeping and doesn't give a damn:<br/><br/><br/><br/>Thanks for your support.", "metacritic": null, "released": "2021-05-17", "tba": false, "updated": "2021-05-21T02:48:23", "background_image": "https://media.rawg.io/media/screenshots/c28/c2871c582658c035023bd1d6174af2e8.jpg", "website": "https://blackvertigo.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 435, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Black Vertigo"], "genres": ["Adventure", "Simulation", "Indie"], "publishers": ["Black Vertigo"], "esrb_rating": null}