{"id": 605618, "slug": "fail-to-win-2", "name": "Fail to Win", "name_original": "Fail to Win", "description": "Abuse the game's quirks to progress through sophisticated slapstick deathtrap puzzles, uncovering the secrets of a world going through an identity crisis.<br/><br/>Death is your friend. As the avatar suffers, the player lives on, using the ragdoll corpse to progress through a combination of timing, precision, observation, and ingenuity.<br/><br/>The challenges center around the idea of game state persisting after a respawn. You can reach a new checkpoint even in death. You can clear traps by sacrificing one of your avatar's infinite lives. You can even respawn mid-ragdoll-flight to fly away from the checkpoint in the same direction. Basically, the solution to most problems is to hurl your puppet at powerful explosives.<h3>FAQ</h3><br/>Is this my kind of game?<br/><br/>I hope so! I'd classify it as a metafictional puzzle-platforming comedy game. It's narrative style is similar to The Stanley Parable / The Beginner's Guide, but mechanically it is probably more similar to something like Portal because of its puzzles. I call them \"puzzles\", but in addition to logical reasoning, some of these challenges do require some level of timing, precision, and careful observation.<br/><br/>What's this about a demo?<br/><br/>A while back I released something called \"Fail to Win: Chapter 1\" for free on Itchio. This was originally designed to be a vertical slice of the full game with later chapters building off these early puzzles. As I've gotten helpful feedback from that chapter, it has undergone major revisions. The first chapter is now very different from the one in the demo.<br/><br/>How long is it?<br/><br/>Play times from testers have varied quite a bit. If you already know all the solutions to all the puzzles, and have master the art of controlled ragdolling, then you could speed through it in about an hour. Although, most players will take much longer.", "metacritic": null, "released": "2021-05-19", "tba": false, "updated": "2021-05-21T03:19:45", "background_image": "https://media.rawg.io/media/screenshots/a83/a83ec349a080c2a6940c3105af279274.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 113, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ty Kennington"], "genres": ["Indie"], "publishers": ["Ty Kennington"], "esrb_rating": null}