{"id": 605689, "slug": "0-degrees", "name": "0 Degrees", "name_original": "0 Degrees", "description": "To play this game on PS5, your system may need to be updated to the latest system software. Although this game is playable on PS5, some features available on PS4 may be absent. See PlayStation.com/bc for more details.<br/>A snow-covered wonderland of platforming action awaits in 0 Degrees, a chill puzzle experience for players of any age or skill level! Take control of a bundled-up pixel art climber as they make their way across icefields, up frosted peaks, through dark caves and over treacherous pitfalls! Help them survive mysterious hazards and overcome brain-teasing obstacles that span 40 unique levels.<br/><br/>The objective is simple, to navigate single-screen challenges from entry to exit, then warp to the next level of escalating complexity. Locate and unlock warp points by activating switches, opening doors and finding special crystals. You’ll even be able to form ice blocks to help you negotiate dangerous gaps or reach high ledges. Stack them on top of one another, knock them over or toss them on top of spikes and switches. And if you get in a tight spot or plummet off a cliff, no worries! You can restart at the beginning of any level you’ve reached, allowing you to try again or go for better times.<br/><br/>Features:<br/><br/>• Experience a chill adventure through puzzling landscapes.<br/>• Run and jump through 40 levels of increasing challenge!<br/>• Form ice blocks to navigate terrain or avoid deadly hazards.<br/>• Enjoy cute pixel art graphics with a wintry aesthetic!<br/><br/><br/>Offline single player<br/>Offline play enabled<br/><br/><br/>Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy). <br/><br/>Software subject to license (us.playstation.com/softwarelicense). <br/><br/>One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.<br/>", "metacritic": null, "released": "2021-05-19", "tba": false, "updated": "2021-05-21T04:16:44", "background_image": "https://media.rawg.io/media/screenshots/0f8/0f82abb62e4693f06e025fd8ac2e6d7f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 9, "beaten": 1, "toplay": 1, "dropped": 1}, "playtime": 0, "achievements_count": 25, "ratings_count": 0, "suggestions_count": 196, "game_series_count": 0, "reviews_count": 0, "platforms": ["Xbox One", "PlayStation 4"], "developers": [], "genres": ["Action", "Puzzle"], "publishers": [], "esrb_rating": null}