{"id": 605668, "slug": "fabled-lands", "name": "Fabled Lands", "name_original": "Fabled Lands", "description": "The original <strong>Fabled Lands</strong> gamebooks, written by <strong>Dave Morris</strong> and <strong>Jamie Thomson</strong>, and beloved by many, have been transformed into an epic, digital adventure of interactive fiction with a massive game world. Be anyone you want: explorer, merchant, priest, scholar, thief, wizard, or soldier of fortune. Buy ships, goods, and townhouses, join a temple, risk desperate adventures in the wilderness, or embroil yourself in court intrigues and the sudden violence of city backstreets. Undertake missions that will earn you allies and enemies, or remain a free agent and choose your own objectives. With hundreds of quests and locations to explore, <strong>the choices are all yours</strong>.<br/><br/><h3>EXPLORE THE FABLED LANDS</h3><br/><ul><li> <strong>Open World</strong><br/>War always leaves its mark: villages lie in ruins, dungeons are infested with monsters and old roads are abandoned. Travel across the continent of Harkuna and learn more about its past.<br/></li><li><strong>Economy</strong><br/>The economy is ruthless, but it also presents many opportunities: fulfill contracts and quests, hunt for treasure, buy a ship and trade goods, or travel the land to earn your fortune.</li></ul><br/><h3>CHOOSE YOUR PATH</h3><br/><ul><li> <strong>An old-school RPG</strong><br/>A solitaire role playing game in a pick your own adventure style like no other. Explore a giant open-ended world, where you can truly travel, investigate, and meddle with things, when and as you see fit to do so.<br/></li><li> <strong>Character Development</strong><br/>Experiment with different professions, abilities and spells, items, and quests. Create your very own playstyle!<br/></li><li><strong>Enemy Variety</strong><br/>Take part in intense battles against numerous enemies. Brigands, trolls, golems, flying heads, assassins, vampires, kelpies, demons, abominable cults, the undead, and many more - all of them will vanquish the unsuspecting adventurer.<br/></li><li><strong>Tactical Battles</strong><br/>There is no handholding. Only the thoughtful ones shall prevail - plan your turns ahead, adapt to your surroundings and fully utilize your character’s strengths.</li></ul><br/><h3>SURVIVE AGAINST THE ODDS</h3><br/><ul><li> <strong>Permadeath</strong><br/>Do you like risk? Then try out the Ironman mode, where every decision is irreversible and your character dies once and for all.<br/></li><li> <strong>Temples</strong><br/>Devote yourself to an enigmatic deity and obtain its blessing. But remember: some blessings have their price. Are you ready to make a pact?<br/></li><li><strong>Ships</strong><br/>Buy your own ship: upgrade it, find new routes and recruit a crew - their abilities might prove the difference when surviving a storm or vicious buccaneers. Fill your ship with valuable cargo and find where to sell it for profit.</li></ul><br/>", "metacritic": null, "released": "2021-05-20", "tba": false, "updated": "2023-02-18T10:02:12", "background_image": "https://media.rawg.io/media/screenshots/ac6/ac6849d9aa60df09d76d281731d72e31.jpg", "website": "https://www.primegames.bg/en/blog/big-announcement", "rating": 0.0, "rating_top": 4, "added_by_status": {"yet": 2, "owned": 19, "toplay": 8, "dropped": 2}, "playtime": 1, "achievements_count": 73, "ratings_count": 5, "suggestions_count": 503, "game_series_count": 0, "reviews_count": 5, "platforms": ["macOS", "PC"], "developers": ["Prime Games"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Prime Games"], "esrb_rating": null}