{"id": 605629, "slug": "kosmo-laika-guide-to-space", "name": "Kosmo Laika: Guide to Space", "name_original": "Kosmo Laika: Guide to Space", "description": "<strong> Do you know who was the first woman to go to space? What about the first animal? Don't panic! Laika will guide you through these discoveries and many more! </strong><br/><br/>Kosmo Laika: Guide to Space is a puzzle game of curiosities about space. You will be challenged to test your knowledge, <strong>combine exclusive patches to find the first visionaries in space, meet the \"animalnauts\" and conquerors of the Moon.</strong>  In this game, Laika will be your guide, taking you into space and beyond, like you never imagined.<br/><br/><strong>Featuring: </strong><br/><br/><ul><li>70 different patches to combine and discover historical facts and important moments of the space missions; <br/><br/><br/></li><li>Complete over 25 moments of the space race; <br/><br/></li><li>Drag and drop the patches in the right places and complete the mission; <br/><br/><br/><br/></li><li>Earn exclusive stamps; <br/><br/><br/></li><li>Increase your knowledge of the history of astronomy; <br/><br/></li><li>Learn all about space heroes; <br/><br/></li><li>Meet the first animalnauts  of the missions. <br/><br/><br/></li><li>Great soundtrack. Original sound effects designed exclusively for the best experience. </li></ul><br/>Test your knowledge of space exploration and the achievements that are part of the history of the world, with the help of Laika, the first space astronaut puppy. <br/><br/>For all lovers of trivia and puzzle games and who admire the stars!", "metacritic": null, "released": "2021-05-19", "tba": false, "updated": "2021-05-21T03:26:19", "background_image": "https://media.rawg.io/media/screenshots/420/420088bffadcafcb10a5b3f08b14dd4e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 268, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Animalle Studio"], "genres": ["Casual"], "publishers": ["Animalle Studio"], "esrb_rating": null}