{"id": 605683, "slug": "strategic-mind-fight-for-freedom-demo", "name": "Strategic Mind: Fight for Freedom Demo", "name_original": "Strategic Mind: Fight for Freedom Demo", "description": "Strategic Mind: Fight for Freedom is a history-driven turn-based strategy set in WW2. You will fight across Europe, Africa, and Burma. Will you spend the time on proper reconnaissance before the attack, or rely on aggressive tactics? Will you use night time or rain to your advantage, sneaking up on enemy positions, or just complain that the weather was unfavorable? Will you help the locals or leave them to their fate? It is up to you to save the stronghold of Democracy and Freedom in Europe from the totalitarian oppression of the Axis powers.\n<br/>\n<br/>\nWITNESS WW2 FROM TWO DIFFERENT PERSPECTIVESThe game has 2 campaigns: the British one features fully historical battles, while the US one has historical operations up to the defeat of Germany and also features a number of alternate history battles against the USSR afterward. It is created with great care and attention to historical detail by a team that is passionate about WW2 history.\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nLead the British Army as Sir Harold Alexander\n<br/>\nGo all the way from Norway landings to the liberation of northern Italy. Command your troops in bitter defeats and in the moments of triumph. Take charge of the Dunkirk evacuation. Fight the Japanese in Burma, and Italians in Africa. Turn the tide of war against Germany at El Alamein. Finish the war in North Africa and lead the victorious landing in Italy in 1943. \n<br/>\n<br/>\n<br/>\n<br/>\nLead the US Army as General Dwight Eisenhower\n<br/>\nGo all the way from D-Day landings to the fall of Berlin. Ensure the success of Operation Market Garden, repel the last German offensive at the Ardennes, and strike the killing blow into the heart of the Reich. Then move into the alternate history of 1946 and face your strongest adversary yet - the Red Army. Command US and Allied forces and minimize your losses. Employ the units of all Allied and liberated countries to achieve maximum synergy. Exploit all available means to bring Freedom and Democracy to Eastern Europe.\n<br/>\n<br/>\n\n  HISTORICAL OPERATIONS AND “WHAT IF” SCENARIOSTake part in historic events\n<br/>\nMake sure all of your troops manage to escape the Dunkirk trap. Show the Italian troops they should choose their allies more carefully by conducting operation Compass flawlessly. Change the course of the entire war in Africa by defeating Rommel in the Second Battle of El-Alamein. Go back to Europe by landing in Italy. Commence the D-Day landing and fight your way to Berlin to put an end to the Nazi regime and its crimes.\n<br/>\n<br/>\n<br/>\n<br/>\nSate your curiosity of alternate history flow\n<br/>\nWhat would have happened if the Allies had to go to war against USSR in 1946, following the ideas of Operation Unthinkable? Now you can take the lead and explore such possibilities. Free the Eastern European countries from Communist rule!MEET THE TOP BRASSThe gameplay is plot-driven and features many historical personalities such as Winston Churchill, Franklin Delano Roosevelt, Harold Alexander, Bernard Law Montgomery, Dwight D. Eisenhower, George S. Patton, and others.GAMEPLAY FEATURESImmerse yourself in history\n<br/>\nEnjoy the narrative-driven gameplay with lots of dialogues between the historical characters throughout each operation. The dialogues are affected by your actions. Dive deeper into the events of 1939-1946 by watching plot-driven cinematics before and after every operation.\n<br/>\n<br/>\nManage your Army\n<br/>\nChoose the composition of your forces. Acquire new units, upgrade or dismiss the outdated ones. There are 10 unit classes available in the game, with lots of models in each.\n<br/>\n<br/>\n<br/>\n<br/>\nUpgrade your units to newer models\n<br/>\nGet new unit models as soon as they become available. As the campaign progresses you gain access to more advanced units at historically accurate periods.\n<br/>\n<br/>\n<br/>\n<br/>\nChoose the best equipment for each operation\n<br/>\nMake sure that your forces have all the necessary tools for the upcoming battle. All units can employ various equipment and transport.\n<br/>\n<br/>\n<br/>\n<br/>\nTrain your troops and choose new abilities for them\n<br/>\nOversee your forces getting combat experience and choose news skills for them that best suit your strategy and tactics.\n<br/>\n<br/>\nAssign heroes\n<br/>\nAssign heroes to the units of your choosing and get access to special skills. All heroes are real historical personalities. \n<br/>\n<br/>\nDevelop your headquarters’ skills and employ advanced combat tactics\n<br/>\nLearn new HQ skills before every operation and use your newly-acquired knowledge to make a difference on the battlefield. \n<br/>\n<br/>\n<br/>\n<br/>\nUse the enemy`s most advanced units against him\n<br/>\nCapture the best enemy units and add them to your forces. Then crash the enemy using his own strength. \n<br/>\n<br/>\n<br/>\n<br/>\nEnjoy realistic 3D graphics\n<br/>\nStudy the battle map and take advantage of 3D graphics, featuring volumetric terrain and physically-simulated movement of units. All units are very detailed representations of real models. \n<br/>\n<br/>\nWELCOME THE SUCCESSORStrategic Mind: Fight for Freedom is the fourth installment in the Strategic Mind line of games, featuring both the United Kingdom and the United States in WW2.\n<br/>\n<br/>\nPrevious titles in the series:\n<br/>\n<br/>\n<ul><li>Strategic Mind: The Pacific - the first game, featuring both the United States and the Empire of Japan waging war in the Pacific. \n<br/>\n</li><li>Strategic Mind: Blitzkrieg - the second game, featuring Germany in WW2.\n<br/>\n</li><li>Strategic Mind: Spectre of Communism - the third game, featuring the USSR in WW2.</li></ul>\n<br/>", "metacritic": null, "released": null, "tba": false, "updated": "2021-05-21T04:08:02", "background_image": "https://media.rawg.io/media/screenshots/fbe/fbeeec3045f8d8c42a00d9f99ccfaba4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 33}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 491, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Starni Games"], "genres": [], "publishers": ["Starni Games"], "esrb_rating": null}