{"id": 605724, "slug": "cooking-yummy-restaurant-game", "name": "Cooking Yummy-Restaurant Game", "name_original": "Cooking Yummy-Restaurant Game", "description": "Wanna play a restaurant game with a time limit? Check out the madness of Cooking Yummy now! You will be a super crazy chef to cook delicious burgers, drinks, and other dishes. Begin your bakery story, improve your time-management skill, and enjoy a happy food game! <br/>From Fast Food and Desserts to Chinese and American cuisines, from a yummy bakery, juicy burgers, mouth-watering BBQ, tasty ice cream to lip-smacking Peking duck, you will cook and serve these tasty meals worldwide like a crazy chef! Do you wanna a quick diner dash? You can play magic kitchen for quick baking games. It’s a baking game that gives you a different experience. <br/>In Cooking Yummy, this food game offers endless fun levels with challenging missions set up in each level to give you a special experience! Besides, upgrading your meals and kitchen can help complete the level in a shorter time! But be careful, playing fast is not enough as keeping your customers happy can get more coins and gems as gifts to unlock more surprises. Accept this challenge! Get started enjoying the cooking world! <br/>In this cooking adventure, you will: <br/>-Cook correct dishes quickly without burned food <br/>-Serve your hungry customers for a better experience <br/>-Use powerful boosts to improve your cooking skills <br/>-Create more combos to get big bonus and achievements <br/>-Unlock and upgrade your special ingredients and kitchenware <br/>-Collect nine chefs pieces respectively to unlock more chefs’ features <br/>-Complete special missions and achievements to claim rewards and gifts <br/>-Enjoy this highly addictive time-management cooking game anytime, anywhere <br/>Game features: <br/>-5+ unique theme restaurants for the cook <br/>-Cook delicious dishes with the best quality ingredients <br/>-Complete more than 400 fun levels with different goals <br/>-Unlock your chef characters to start a grand cooking adventure <br/>-Challenge in Magic Kitchen three times a day for more rewards <br/>-Manage time efficiently by upgrading ingredients and kitchen appliances <br/>-Play online or offline without WiFi or internet anytime, anywhere <br/>Cooking Yummy is a high-quality cooking game full of sincerity, and has an incredibly stable and consistent game experience. <br/>Follow us to get news and updates: <br/>https://www.facebook.com/cookingyummygame/ <br/>https://studio.youtube.com/channel/UCm9o7b2753obadAb0lhQiSw <br/>No time to waste! Download now, join Cooking Yummy, and play the cooking games anytime, anywhere!", "metacritic": null, "released": "2021-02-21", "tba": false, "updated": "2021-05-21T04:33:11", "background_image": "https://media.rawg.io/media/screenshots/722/722e3c0ee6eee3b6690a13e774c2cfc6_7bQ82Or.jpg", "website": "https://www.adevote.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 47, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Adevote Interactive"], "genres": ["Simulation", "Casual"], "publishers": ["HK Adevote Interactive"], "esrb_rating": "Everyone 10+"}