{"id": 60575, "slug": "jolly-battle", "name": "Jolly Battle", "name_original": "Jolly Battle", "description": "This is not a fight to the death, but a fight for the tastiest pie! It's a challenge for those hardened in battles with tons of lollipops and candies. Battleship, a favourite board game of many parents, is now available in a completely new version for children. Don’t panic under fire, as many sweets and delicious cakes await instead of a navy fleet; and caramel instead of cannonballs.<br/> <br/>Develop your own strategy and don’t give your opponents a shot at livin’ the dolce vita! Gather a team of friends and get an unforgettable battle of cakes underway! For the very bravest player there are battles against AI players, with different levels of difficulty available (you can always call your mom or dad for help!).<br/><br/><strong>Game Rules</strong><br/><br/>Jolly Battle is played using the rules of the classic game Battleship. The players do battle with a fleet of funny animated cakes. Firepower is brought to bear through caramel bombs, which zero in on the cakes that the players take aim at. Players take turns to attack. So choose where to place your fighting cakes and try to ‘chow down’ on the enemy fleet faster than it can devour your own!<br/> <br/><strong>Game Features</strong><br/><br/><ul><li>Simple, classic rules<br/></li><li>Attractive graphics<br/></li><li>Entertaining soundtrack</li></ul> <br/><strong>Developers</strong><br/><br/>The indie development team nurtures and cherishes its projects like they were their own children. And of course, they pay close attention to every last detail. We made this game with loving care and attention, as we would for family and friends.", "metacritic": null, "released": "2018-07-27", "tba": false, "updated": "2019-08-28T21:58:46", "background_image": "https://media.rawg.io/media/screenshots/05a/05a97005e667d269d8f2e1236f93b8f1.jpg", "website": "https://jollybattle.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 96, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Avantaj Prim"], "genres": ["Strategy", "Casual", "Indie"], "publishers": ["Avantaj Prim"], "esrb_rating": null}