{"id": 605702, "slug": "find-3d-match-items", "name": "Find 3D - Match Items", "name_original": "Find 3D - Match Items", "description": "Get ready to have a blast with a new fun puzzle game- Find 3D - Match Items!<br/><br/><br/>Play now and discover plenty of challenging levels filled with fun missions that make this time-killing game one of a kind. <br/><br/><br/><br/>Relax and enjoy this addictive 3d matching game as you collect items and complete different missions! <br/><br/><br/><br/>Train your brain, match cute items, explore fun quests, and win awesome rewards! It’s super fun and entertaining!<br/><br/><br/><br/>COOL FEATURES:<br/><br/>* Beautifully designed puzzle match 3d levels<br/>* Fun brain training challenges<br/>* Easy and relaxing time killer game<br/>* Awesome boosters and hints to help you along the way <br/>* Free to play online or offline, no Wi-Fi or internet connection is required! <br/>* Amazing new game filled with match 3 quests and cool missions<br/><br/>Try out a new style of the popular match 3d games!  <br/><br/><br/><br/>HOW TO PLAY<br/>* Tap and drag different items to collect them<br/>* Complete the goal that is set at the start of the level<br/>* Enjoy a fun gameplay and cool features like cards and gem collections<br/>* Complete the different missions and win great rewards<br/>* NOTE! Each level has a timer, so you must move fast &amp; reach the level goal!<br/>* Use the boosters to help you pass tricky levels<br/>* Use Shuffle to rearrange the items on the board<br/>* Boost your game with the Hint and Super Hint <br/><br/>Find 3D - Match Items is free to download and play, but contains in-app purchases. You can turn off the payment feature by disabling in-app purchases in your device’s settings.<br/><br/><br/><br/>Subscriptions automatically renew unless turned off at least 24 hrs before the current period ends. Manage subscriptions via iTunes account settings.", "metacritic": null, "released": "2021-05-12", "tba": false, "updated": "2021-05-21T04:23:23", "background_image": "https://media.rawg.io/media/screenshots/228/2281de5fb8d4292630efafb75f43e71f.jpg", "website": "https://www.boomboxgames.net/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 25, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Boombox Games"], "genres": ["Board Games", "Puzzle"], "publishers": ["Boombox Games"], "esrb_rating": "Everyone 10+"}