{"id": 605749, "slug": "alien-jelly-food-for-thought-2", "name": "Alien Jelly: Food For Thought", "name_original": "Alien Jelly: Food For Thought", "description": "Alien Jelly is a brand new type of puzzle game with oodles of brain numbing fun! Rotate the world and navigate through deadly obstacles to solve 50 levels!<br/><br/>Key Features:<br/>• 50 carefully crafted levels<br/>• 3 bizarre characters with unique abilities<br/>• 3 beautiful galactic environments<br/>• 10 hidden treasures<br/>• Brand new mobile puzzle mechanic<br/>• Plenty of platforming action<br/>• Rewind time!<br/><br/>If you are in the mood for a little puzzle action, Alien Jelly: Food For Thought will deliver in shovel fulls! This premium puzzler is a little bit of platformer mixed with a lot of spatial puzzles, and of course, there are crates. The highly polished 3D visuals and a 50's b-movie sci-fi aesthetic, makes this game very easy on the eyes and ears. Take the time to listen to the audio, it adds to the whole vibe and the squishy movement sounds are always fun. The game has 50 levels, with the difficulty ramp getting nice and steep towards the end of the game. I'm warning you right now, the last level is not for the faint of heart! The game also has three different characters, each with their own abilities, which keeps the puzzles interesting. In later levels, you will need to use all of the characters together, ala Lost Vikings.<br/><br/>This game is actually based on an old XBox Live Indie game but completely rewritten for mobile. The reimagining of the core concept makes the game a lot more accessible while maintaining its puzzle trickiness. It's been a passion project of a lone indie developer for quite a few years with lots of help from friends.", "metacritic": null, "released": "2016-07-09", "tba": false, "updated": "2021-05-21T04:46:10", "background_image": "https://media.rawg.io/media/screenshots/f4e/f4e08ca79035a4a3fdfab590049d5456_N8Mq5Pa.jpg", "website": "http://www.alienjelly.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 116, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Collective Mass"], "genres": ["Casual", "Puzzle"], "publishers": ["Collective Mass"], "esrb_rating": "Everyone 10+"}