{"id": 605748, "slug": "lost-memories-2", "name": "Lost Memories", "name_original": "Lost Memories", "description": "Overview of the game:<br/>\r\nGetting lost and completing puzzles to continue on the path. With roguelike elements mixed in with horror and storytelling.  If you are into speed running through games there is a mode for you! Lost Memories has a lot to offer for all players to enjoy.<br/>\n<br/>\r\nGameplay features: <br/>\r\nAn action horror game where are you running hide and solve puzzles. <br/>\r\nFear system: if you aren’t in a building or around a campfire, you will start the game fear which will make your vision, cloudy, and your movement slower. <br/>\r\nWeapons: there is one single weapon that can disable the enemies movement if you can find it. <br/>\r\nFlashlight: the flashlight is used for finding your way through Lost memories. <br/>\n<br/>\n<br/>\r\nWhy I made this game:<br/>\r\nI made this game for the players to experience a simple roguelike horror game with passionate storytelling.<br/>\n<br/>\r\nWhat this game expresses:<br/>\r\nI want Lost Memories to have the players feel like no matter the memory no matter how long it has been since the memory. It will never be lost. I hope everyone enjoys my game and can find peace when they play and challenge themselves.<br/>\n<br/>\r\nContent:<br/>\r\nBeing early but ready for the public. I wanted the game to be released so they can experience the single-player mode. I have a multiplayer mode in mind that will be released at a later time.", "metacritic": null, "released": "2020-03-29", "tba": false, "updated": "2022-11-14T03:26:46", "background_image": "https://media.rawg.io/media/screenshots/292/292a62442068526ea81c5e15b754ec00.jpg", "website": "http://gmgamestudios.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 252, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "iOS"], "developers": ["Sheer Studios", "George Hamoush"], "genres": ["Action", "Adventure", "Strategy", "Casual", "Indie", "Puzzle"], "publishers": ["Sheer Studios", "George Hamoush"], "esrb_rating": "Everyone 10+"}