{"id": 605853, "slug": "yerba-mate-tycoon-early-access", "name": "Yerba Mate Tycoon (Early Access)", "name_original": "Yerba Mate Tycoon (Early Access)", "description": "<p><strong>The version before Steam early access (Very early access)</strong></p>\n\n<p>Yerba Mate Tycoon is a unique management game. You will take care of a yerba mate production business: creating and customizing various yerba mates, unlocking new upgrades, and growing your company. Yerba mate is a coffee alternative in South American countries, and the national drink of Argentina, Paraguay, and Uruguay!</p>\n<p><strong>Create your yerba mate</strong><br/>Over 156 additives to chose from, with unique stats and qualities. Set your price, logo, package sizes, target group, drying method, and much more. Create something unique or just appeal to the crowd and get marketing your product.</p>\n<p><strong>Manage company</strong><br/>Take care of taxes, fans, company workers (fire/hire/train them), monitor your company rank, loan rank. Buy other companies, unlock new upgrades, raise yerba mate popularity, fight with coffee. Discover various events, make multiple decisions.</p>\n<p><strong>Unique gameplay</strong><br/>The best Yerba Mate Tycoon game (and the only one). Many Easter eggs, references, jokes. Casual Indie Management game from one developer.</p>\n<p><strong>Features:</strong></p>\n<ul><li>New update = new bugs</li><li>Poor graphic and sounds</li><li>Over 156 additives to chose from in your yerba creation, with unique qualities and events - including apple, orange, pomelo, honey, and uranium!</li><li>Create, customize, market, and sell your yerba mate. Set its price, type, package type/logo, distribution, additives, drying method, and much more.</li><li>Take various decisions (try to avoid tax system? Ignore workers' rights? What will you do in a crisis?) (still yet not added)</li><li>Chose one country from 19 available in the game, set company and CEO stats. </li><li>Countries got various tax rates, yerba popularity rate, workers salary, workers education, and change over time.</li><li>Discover various events (pandemic, crisis, export blockades) and others.(still yet not added)</li><li>Rival with other companies, sabotage them, steal their technology, or buy them. ((still yet not added))</li><li>Unlock new upgrades and fight with coffee.  </li><li>Hire/Train workers, discover their personalities</li><li>Discover the unique world of yerba mate</li><li>Tons of references to yerba mate</li><li>Dynamic system means constantly evolving tax rates, loan availability, yerba popularity, workers' salaries and behavior</li><li>Easter eggs</li></ul>\n<p>And a lot more, the list is too long:-}</p>\n<p>Polish/English are the official game translations. The community does other language translations. This game will not have any office building or customizing office system, or online mode.</p>\n<p>Remember, this game is in early access. It may lack balance, stability, or content, which will be added during EA.</p>\n\n<p>Wishlist on Steam<br/></p>\n\n<p>PS: If you are from Argentina, other countries with Steam regional prices (that got lower prices compared to USD one), you can wait for the Steam Release. In Argentina, this game will be cheaper, but here I can't set regional prices. <br/></p>", "metacritic": null, "released": "2021-05-20", "tba": false, "updated": "2021-05-21T05:15:07", "background_image": "https://media.rawg.io/media/screenshots/efc/efcf4dcad84234c5db575312d4313370.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 182, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["DonislawDev"], "genres": ["Strategy", "Simulation"], "publishers": [], "esrb_rating": null}