{"id": 60585, "slug": "bqm-blockquest-maker", "name": "BQM - BlockQuest Maker", "name_original": "BQM - BlockQuest Maker", "description": "Create &amp; play! New, instant death dungeon RPG “BQM -Block Quest Maker” is here!<br/>\n<br/>\r\nBQM enables you to create your very own dungeon RPG, packed with puzzles and traps. Secret doors, falling rocks, strong mobs – challenge them all and level up. <br/>\r\nWhat lies within the box? Unveil the secrets or… create them!<br/>\n<br/>\r\nBut wait. Isn’t the stage design difficult?<br/>\r\nNo, not with this maker!<br/>\r\nWith just a click of a mouse it’s easy like playing with blocks.<br/>\r\nControls may be easy, but dungeons you create can be as canny and deadly as your imagination dictates. Just use your head and BQM’s traps and gimmicks. Be it puzzle, action or story – which dungeon will you make?<br/>\r\nShare maze of your design with players all around the world and challenge them to beat your wit.<br/>\n<br/>\r\nBut do not fret my friend. If you don’t feel like creating is your cup of tea, you can focus only on playing dungeons made by other users.<br/>\n<br/>\r\n★ “PLAY” Take on dungeons!<br/>\r\nLet’s battle players around the world and their instant death dungeons. All kinds of mazes await you. Use items like bombs, arrows or magic wands and reveal all secrets.<br/>\n<br/>\r\n★ “CREATE” Design dungeons and earn gold!<br/>\r\nIt’s your turn to make dungeon and embarrass others. At your disposal is Dungeon Editor - create original dungeon and test players around the world. Everything depends on you! Fix the entrance fee and set your eyes on becoming most popular creator. Become wealthy!", "metacritic": null, "released": "2018-07-26", "tba": false, "updated": "2023-01-19T20:24:17", "background_image": "https://media.rawg.io/media/screenshots/a56/a56372bcd683d53b26bbb31b0b8a2d07.jpg", "website": "http://bqm.blk-quest.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 16, "dropped": 1}, "playtime": 4, "achievements_count": 62, "ratings_count": 2, "suggestions_count": 228, "game_series_count": 0, "reviews_count": 2, "platforms": ["Xbox One", "PC", "macOS"], "developers": ["WonderlandKazakiri"], "genres": ["Action", "RPG", "Indie"], "publishers": ["Gamera Game"], "esrb_rating": null}