{"id": 60587, "slug": "a-long-way-down", "name": "A Long Way Down", "name_original": "A Long Way Down", "description": "<p>The game draws inspiration from hits like Darkest Dungeon, Slay the Spire and Hand of Fate.<br />\nA Long way down is a mash-up between an RPG and a deck-building game. Embody Sam and try escaping this maze where a sneaky and evil mastermind reigns. Let your memories and your morality guide you... but don&#39;t fall into darkness.<br />\nBy virtue or by sin, you will be judged!Every choice will impact your fate. Are you a virtuous hero or a sinner?Craft a deckThe cards you choose will determine how you explore the dungeon and how you defend yourself from the horrors it contains.Fight your way through the unforgiving monster maze Great challenges await you as you go deeper into the dungeon. Use your cards and cunning, adapt your playstyle and overcome all enemies.Gather your partyYou’ll meet many fellow adventurers down in the dark - will you gain allies or make enemies?Traverse the mazeUse your cards to bridge gaps and defy dead ends as you travel through the maze. Rush to escape or take time to explore, the choice is yours.Upgrade your items and equipmentCollect rewards and use them to grow your power to take on what lies in the depths.Confront the evil overlordEvery choice you made will affect the final battle - can you defeat the mastermind in its lair?</p>", "metacritic": null, "released": "2020-08-28", "tba": false, "updated": "2021-03-31T14:58:49", "background_image": "https://media.rawg.io/media/screenshots/71d/71da501cb70f9c4af49163bc378c0428.jpg", "website": "https://alwd.seenapsis.studio/", "rating": 3.29, "rating_top": 3, "added_by_status": {"yet": 5, "owned": 107, "beaten": 2, "toplay": 6, "dropped": 4}, "playtime": 2, "achievements_count": 9, "ratings_count": 7, "suggestions_count": 194, "game_series_count": 0, "reviews_count": 7, "platforms": ["Linux", "Nintendo Switch", "PC", "macOS"], "developers": ["Seenapsis Studio"], "genres": ["Adventure", "RPG", "Strategy", "Indie"], "publishers": ["Seenapsis Studio"], "esrb_rating": null}