{"id": 6060, "slug": "tiny-troopers-alliance", "name": "Tiny Troopers: Alliance", "name_original": "Tiny Troopers: Alliance", "description": "Lead your troops into battle with the combat strategy game that gives you full tactical control.<br/><br/>This app offers in-app purchases. You may restrict in-app purchasing using your device settings.<br/><br/>Join forces to wipe out the competition! Team up with other players to form powerful Alliances and compete in Weekly Wars against players around the globe for top prizes. <br/><br/>Build and fortify your base and lead your troopers into epic real-time conflicts. Tactile controls give you full command over your infantry units, vehicles, and air units as you plot and execute lethal assaults in battles.<br/><br/>Unlock, upgrade, and dispatch everything from grenadiers and gunships to artillery strikes and nuclear missiles as you obliterate bases created by other players, or by the dreaded rogue General Wolf.<br/><br/>TINY TROOPERS: ALLIANCE FEATURES:<br/>•        Tiny Troopers warfare on an even bigger scale!<br/>•        Form an Alliance with others and fight in global weekly wars.<br/>•        Take complete control of your troops in the heat of battle at any time.<br/>•        Out-think your opponent tactically to wipe out their base!<br/>•        Massive campaign for single player experience!<br/>•        Gorgeous visuals make every unit and explosion come to life!<br/><br/><br/> “Like” us on Facebook for the latest news: https://www.facebook.com/tinytroopers<br/><br/>Join the community on our forums: http://kukouri.com/ttaforum.php<br/><br/>Need help? Please visit: http://kukouri.com/ttafaq.php<br/><br/>Visit the Chillingo room on the App Store to see more of our great games: appstore.com/chillingo <br/><br/>Important Consumer Information. This app: Requires acceptance of EA&amp;#39;s Privacy &amp;amp; Cookie Policy, TOS and EULA. Includes in-game advertising. Collects data through third party ad serving and analytics technology (see Privacy &amp;amp; Cookie Policy for details). Requires a persistent Internet connection (network fees may apply). Contains direct links to the Internet and social networking sites intended for an audience over 13. Allows players to communicate via Facebook notifications and gifting. To disable see the settings in-game. The app uses Game Center.  Log out of Game Center before installation if you don’t want to share your game play with friends. <br/><br/>Terms of Service : http://terms.ea.com/en<br/>Privacy &amp;amp; Cookie Policy : http://privacy-policy.truste.com/certified-policy/mobile/app/en/TinyTroopersAlliance.com/index_EN.html<br/>EULA : http://tos.ea.com/legalapp/mobileeula/US/en/OTHER/<br/>Visit http://www.chillingo.com/about/game-faqs/ for assistance or inquiries.<br/><br/>EA may retire online features and services after 30 days notice posted on www.ea.com/1/service-updates", "metacritic": null, "released": "2014-08-21", "tba": false, "updated": "2019-10-22T14:28:36", "background_image": "https://media.rawg.io/media/screenshots/b73/b735253b07224e378edcc6fb4c7f2cb4.jpeg", "website": "https://chillingosupport.zendesk.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 273, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": [], "genres": ["Action", "Strategy"], "publishers": ["Chillingo"], "esrb_rating": "Everyone 10+"}