{"id": 60606, "slug": "sagebrush", "name": "Sagebrush", "name_original": "Sagebrush", "description": "\"I met Anne first, waiting for the bus. I asked her what she was selling and she laughed and said nothing, nothing at all, that what she had to offer was free for anyone who wanted it bad enough. I asked her what had helped her. She just said 'James.'\"<br/><br/><strong>Sagebrush</strong> is a short-form first-person narrative adventure about exploring the compound of an apocalyptic Millenialist cult in remote New Mexico years after they collectively took their lives in a mass suicide event.<br/><br/>In <strong>Sagebrush</strong>, you'll investigate the long-abandoned Black Sage Ranch, the former home of Perfect Heaven, an apocalyptic cult formed in the early 1990s under the guiding hand of the prophet Father James.Inspired by Real-World Apocalyptic CultsBased on extensive research into cult groups both famous and obscure, large and small, Sagebrush avoids simplistic motivations and easy answers. The members of the Flock are diverse and complex people with varied needs, hopes, and fears.An Immersive, Lo-Fi 3D WorldSagebrush features an evocative low-poly, low-resolution, less-is-more art style that combines retro aesthetics with modern technology, along with a fully-realized soundscape and an original ambient musical score that immerses you in the remote New Mexico desert.A Whole Compound to ExploreBlack Sage Ranch is yours to wander, from the trailers that housed the cultists, to the halls where they gathered for food and prayer, to the old mines that stretch out below the compound, untouched for nearly a century.Uncover the Real StoryFind notes, recordings, and belongings that give insight into the people who lived at Black Sage Ranch. What did they believe? Why did they join? Were they happy? And why did they choose to end it all?<br/><br/>Estimated Playtime: 60-120 minutes", "metacritic": null, "released": "2018-09-18", "tba": false, "updated": "2023-08-12T11:32:57", "background_image": "https://media.rawg.io/media/screenshots/f16/f162610475c9afac1eeac31db3e90b6d.jpg", "website": "http://redactgames.com/", "rating": 3.96, "rating_top": 4, "added_by_status": {"yet": 10, "owned": 78, "beaten": 18, "toplay": 9, "dropped": 2}, "playtime": 2, "achievements_count": 71, "ratings_count": 22, "suggestions_count": 227, "game_series_count": 0, "reviews_count": 23, "platforms": ["Nintendo Switch", "PlayStation 4", "Xbox One", "PC", "macOS"], "developers": ["Redact Games"], "genres": ["Adventure", "Indie"], "publishers": ["Ratalaika Games", "Redact Games"], "esrb_rating": "Mature"}