{"id": 60614, "slug": "7-soccer-a-sci-fi-soccer-tale", "name": "7 Soccer: a sci-fi soccer tale", "name_original": "7 Soccer: a sci-fi soccer tale", "description": "Firstly born as a simple 7 soccer game, Seven Soccer has grown up and now it presents itself as a sci-fi soccer tale.<br/>\n<br/>\r\nInspired by some old sci-fi tv series, a short tale with a electrifying ending was added, in order to justify the events that were told.<br/>\n<br/>\r\nBefore entering the heart of the game, it will be a short tutorial phase, in which you will learn the basic commands to play the matches.<br/>\r\nYou begin as a child, with your mother teaching you to kick the ball (and in this phase you already notice the post-apocalyptic scenery); then you’ll be in the public gardens with your friends, when the benches were the goal; and then you’ll be in a park where you will learn to save the shots of the opponents. In 7 Soccer, in fact, the goalkeeper is completely under your control and you will decide if you want him to dive and when.<br/>\n<br/>\r\nTHE LEAGUE <br/>\r\nOnce completed the tutorial, the difficult phase of the league will begin, where you will have to face nine teams of different difficulty.<br/>\r\nThe final position in the table will have a certain importance, because once finished the league you will be able to challenge the national teams of the various countries, but only if you unlock them from your score.<br/>\r\nWinning against the national teams will let you gain tickets to enter the DOME (the more national teams you face, the more tickets you gain - from here the importance of a good classification).<br/>\n<br/>\r\nDOME <br/>\r\nThe Dome is a place of challenges, through rooms in which obstacles of increasing difficulty are randomly placed. It will be through this structure that you will be able to follow the evolving of the plot and to understand what happened to the human kind.<br/>\r\nJust the ones who will complete the Dome with a high general score, will unlock the complete final.", "metacritic": null, "released": "2018-02-14", "tba": false, "updated": "2019-08-28T21:58:45", "background_image": "https://media.rawg.io/media/screenshots/7a1/7a160fc39737e2a7358a09ee1f4b7565.jpg", "website": "http://www.elis-d.com/7soccer/en/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 136, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mario D'Eliso \"Elis-D\""], "genres": ["Action", "Sports", "Casual", "Indie"], "publishers": ["Mario D'Eliso"], "esrb_rating": null}