{"id": 60616, "slug": "swords-and-souls-neverseen", "name": "Swords and Souls: Neverseen", "name_original": "Swords and Souls: Neverseen", "description": "<p>If you&#39;ve been looking for an RPG that takes a light-hearted story and wraps it up with tasty combat-focused gameplay and addictive level grinding, then welcome to Swords &amp; Souls: Neverseen! Following a shipwreck on a strange island, you set out to explore the wild, untamed lands. Go up against orcs, goblins, golems and more in combat where you must block, dodge, and counter in real time. Master your abilities through fun and addictive arcade minigames that evolve as you play. When you need a break from scouring the map for secrets and enemies, return to the Haven, where you can relax with fishing, improve your home, find a loyal pet or companion, or maybe even... true love? Swords &amp; Souls: Neverseen aims to provide a fun and addictive RPG experience that you can dip in and out of whenever you want.Key Features:Master a dynamic combat system which involves stats, timing, and thinking.<br />\nEngage in skill-based training mini-games that reward your efforts and mastery.<br />\nDesign your hero and customize them with tons of equipment and abilities.<br />\nJourney through dozens of encounters and locations, including an endgame arena.<br />\nEnhance your town and home with upgrades to improve both looks and stats.<br />\nTrain pets, fill a museum, get trophies, discover secrets, and more...</p>", "metacritic": null, "released": null, "tba": false, "updated": "2024-03-13T21:14:01", "background_image": "https://media.rawg.io/media/screenshots/863/86349f6e32c4e39484a3209d10d0ebbc.jpg", "website": "", "rating": 4.11, "rating_top": 5, "added_by_status": {"yet": 4, "owned": 130, "beaten": 15, "toplay": 4, "dropped": 5, "playing": 2}, "playtime": 8, "achievements_count": 39, "ratings_count": 19, "suggestions_count": 344, "game_series_count": 0, "reviews_count": 19, "platforms": ["PC"], "developers": ["SoulGame Studio"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Armor Games Studios"], "esrb_rating": null}