{"id": 60621, "slug": "beast-agenda-2030", "name": "Beast Agenda 2030", "name_original": "Beast Agenda 2030", "description": "In 2028, the Watchers surfaced. They claimed to be the ancient alien progenitors of the human race. They rode in on a Trojan Horse of advanced knowledge and a peaceful World Government. They were, to all who believed, the Saviors of the Earth and all mankind. The truth was that these tentacled abominations came from the bottomless depths of The Sea, chained up for thousands of years, and unshackled in these final days.<br/> <br/>The Watcher’s promised a new age of enlightenment and directed evolution, if only one accepted the Watcher’s authority and took their Mark. Those who refused were exiled to the island of Fleece, to live unhindered, yet disconnected from the rest of the enlightened world. By 2030 all the Earth was claimed. Now the Watchers’ army has come for Fleece. The remaining few Resisters are fighting to survive and ultimately escape the New World Order.<br/><br/><br/> <br/><br/> <br/><strong>Features:</strong><br/><br/><ul><li>\tHack, sneak, and loot your way through procedurally generated cities. </li></ul><br/><ul><li>\tAcquire missions, level up, and buy equipment in your sewer base. </li></ul><br/><ul><li>\tRescue fellow Resisters, that allow the player to employ and level up new abilities. Give survivors assignments that will make missions easier, or send them out to acquire resources that increase community morale. </li></ul><br/><ul><li>\tGet creative with systems based gameplay. For instance: Arniss finds a locked door: How does he open it? Disable the lock if Arniss’ skill is leveled. Control the console on a vehicle to crash into the door. Hack a chipped enemy brain to download the door code. Or hitch a ride on a UFO with your grappling hook to enter through the backdoor!</li></ul><br/><ul><li>\tComplete mission goals to acquire components to build your submarine and escape the grasp of the NWO!</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:58:44", "background_image": "https://media.rawg.io/media/screenshots/aa4/aa41e8f905775e45b46364ce65b24a77.jpg", "website": "https://www.ouchgivergames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 36, "ratings_count": 0, "suggestions_count": 247, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ouch Giver Games"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Ouch Giver Games"], "esrb_rating": null}