{"id": 606337, "slug": "bluetooth-bot-battles", "name": "Bluetooth Bot Battles", "name_original": "Bluetooth Bot Battles", "description": "<p>This is the perfect game for family gatherings or being around friends where social distancing is a necessity, you can stand or sit far apart and still play against each other!</p>\n<p>**Update: New vs CPU feature will allow you to train your Bot's without being connected to another device!<br/><br/>** Update: 11 new Attack Items to use in Battle!<br/><br/>Become the trainer of a team of up to 4 Bot's in this Turn-Based 1 VS 1 stand-alone Bluetooth powered game.<br/><br/>Create a new Bot and challenge a friend to Battle you locally. There is no need for a Wifi or Data connection to play the game.<br/><br/>Each Player device connects to the other via Bluetooth and you will be taken to the Battle Arena where you Battle to see who is victorious.<br/><br/>Gain XP, earn Credits, and level your Bot up through Battling with Friends and Family.<br/><br/>The game comes with 7 different Casing (skins) options for you to choose from, so pick your favorite color scheme.<br/><br/>There is an In-Game store where you can purchase variant Casings, Software, Hardware, and Physical Upgrades for your Bot.<br/><br/>There is 1 Equip slot available for low-level Bot's that you can use to Equip an upgrade Chip or any other Equippable item you purchase in the store.<br/><br/>Store items are purchased using in-game credits, there will NEVER be any In-App purchases or Pay-To-Play associated with this game.<br/><br/>Challenge your Family and Friends and have a fun time!<br/>The working range is limited to the power of your device's Bluetooth transmitter.</p>\n<p>Join us on Discord to stay up to date with new features: https://discord.gg/hxAnk4wx</p>", "metacritic": null, "released": "2021-05-19", "tba": false, "updated": "2021-05-21T07:17:50", "background_image": "https://media.rawg.io/media/screenshots/4b4/4b4f1140e88a7e887a5db76dd6cc3a06.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 101, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Ravalox"], "genres": ["Strategy", "Fighting"], "publishers": [], "esrb_rating": null}