{"id": 606447, "slug": "zooswat", "name": "ZooSWAT", "name_original": "ZooSWAT", "description": "<p>ZooSWAT is a turn-based tactical game, a simulator of a special squad of beastmen.<br/></p>\n<p>For jam bcgjam.com we put together a team of 2 programmers and 1 lvl designer, and here is our result.</p>\n<p>Game Build https://cld.rockbee.org/s/KYCAi3TK9GT9w5A</p>\n<p>All the work except for the graphical assets and a few time frames that facilitate development was done in 3 days.</p>\n<p>Zootopia - a world where animals live and thrive-developed beastmen who have created a developed society based on law and order.</p>\n<p>But the animal idyll is broken by one nuance - side by side with them, live much more aggressive and dangerous creatures-people… At first, the species tried to live together, but the more success and progress the animals achieved, the more their nature manifested in people - envy, cunning and a tendency to self-destruction, they increasingly turned into a criminal element of society.</p>\n<p>The war between the species was only a matter of time, and the humans lost it. Now, they live on the fringes of civilization in special reservations, unite in criminal syndicates and secret societies, hatching insidious plans to take over or destroy the world.</p>\n<p>Для джема bcgjam.com мы собрали команду из 2х программистов и 1 lvl дизайнера, и вот наш результат.</p>\n<p>Билд игры https://cld.rockbee.org/s/KYCAi3TK9GT9w5A</p>\n<p>Все работы кроме графических ассетов и нескольких вреймворков облегчающих разработку были сделаны за 3 дня.</p>\n<p>ZooSWAT - пошаговая тактическая игра, симулятор спецотряда зверолюдей.</p>\n<p>Зоотопия - мир где живут и процветают зверяне - развитые зверолюди, создавшие развитое общество, в основе которого лежат закон и порядок.</p>\n<p>Но звериную идиллию нарушает один нюанс - бок о бок с ними, живут куда более агрессивные и опасные существа - люди… Сперва, виды пытались жить вместе, но чем больших успехов и прогресса достигали зверяне, тем больше в людях проявлялись их натура - зависть, коварство и склонность к саморазрушению, они все больше превращались в криминальный элемент общества.</p>\n<p>Война между видами была лишь вопросом времени, и люди ее проиграли. Теперь, они живут на задворках цивилизации в специальных резервациях, объединяются в преступные синдикаты и тайные общества, вынашивая коварные планы по захвату или уничтожению мира.</p>", "metacritic": null, "released": "2021-05-19", "tba": false, "updated": "2021-05-21T07:44:17", "background_image": "https://media.rawg.io/media/screenshots/ad0/ad0b6f250ba48929036a8255f17b34f1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 81, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Rockbee"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}