{"id": 6064, "slug": "blowfish-meets-meteor-a-brick-breaker-adventure", "name": "Blowfish Meets Meteor: A Brick-Breaker Adventure", "name_original": "Blowfish Meets Meteor: A Brick-Breaker Adventure", "description": "“5/5: A must have!” - iOS Etc.<br/>“The most interesting Arkanoid-like game I have played thus far” - ShineApp<br/>“One of the best BreakOut clones on the iPhone” - Family Friendly Gaming“<br/>A block breaking game with more imagination than most” - 148Apps<br/>“A brick breaker game with a  bite” - AppAdvice<br/><br/>Blowfish Meets Meteor is a fresh, new evolution of the brick-breaker genre! Rescue your mermaid daughters, slay gigantic sea monsters, and smash a few gajillion bricks while doing it in this stunning brick-breaker-meets-puzzle-platformer hybrid. <br/><br/>•A massive adventure with over 10 hours of content!<br/>•Six gigantic, unique worlds!<br/>•Thousands of frames of hand-drawn animation! <br/>•Nearly thirty minutes of original music!<br/><br/>Take an epic journey from the surface of the waves to the mysterious, alien trenches at the bottom of the ocean. New surprises lurk around every corner: you&amp;#39;ll summon fluffy penguins to aid you, flee zombified pirate ships, create makeshift platforms from the lingering ghosts of jellyfish, use gigantic laser beams to blow up entire levels, fight to escape from the belly of a vengeful whale, and more. At the end of it all, you&amp;#39;ll battle an unmatched evil and uncover the secrets of a mysterious underwater world. <br/><br/>Do you have what it takes to rescue your mermaid daughters? There&amp;#39;s only one way to find out! Let&amp;#39;s do this!", "metacritic": null, "released": "2014-02-14", "tba": false, "updated": "2019-10-22T14:28:36", "background_image": "https://media.rawg.io/media/screenshots/1f2/1f2811b3edb04e752034f999387c83b3.jpeg", "website": "http://www.skytyrannosaur.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 124, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sky Tyrannosaur"], "genres": ["Action", "Puzzle"], "publishers": ["Sky Tyrannosaur"], "esrb_rating": "Everyone 10+"}