{"id": 606763, "slug": "electrobits", "name": "Electrobits", "name_original": "Electrobits", "description": "<p>Electrobits is a cute 2D puzzle platformer about tiny creatures who live in and fix electrical circuits. After a massive solar flare hits earth and damages most technology, it's up to you and the Electrobits to fix it.</p>\n<p>Each level is a one screen puzzle where you have to use Electrobits to fill gaps in circuits, You win the level if you complete the circuit and it stays completed for a count of 3. In every level, you can  control 3  different Electrobits to solve puzzles. You can cycle between Electrobits by pressing the W, S, or Enter keys or select one to control by clicking on it.</p>\n<p> As an Electrobit, you can move left and right with the A and D keys, as well as jump with the space key. Your goal is to maneuver yourself to fill a gap in the circuit. It's not that simple though, there are multiple gaps in every circuit so the 3 Electrobits have to work together in order to succeed. For example, you can jump on one of your fellow Electrobits to reach higher platforms than you can normally jump to . <br/></p>\n<p>In each level, you\"ll find obstacles that you have to overcome. Luckily, items can help with this. Simply walk into one of the items with your Electrobit to have them equip the item. Once you pick up an item, you can't uniquip it but items are helpful so that's not a bad thing. Each Electrobit can only equip one item  and you'll have to use these items together to solve some puzzles. Items range from a trampoline that makes other Electrobits jump higher off of you to a defensive shield that blocks  dangerous lasers. If one Electorbit gets hurt, they all get hurt so be careful!</p>\n<p>When you start the game, you can use the escape key to close it from the main menu. If you are in a level or another menu screen, pressing the escape key will take you back to the main menu. From the main menu, you can select the Start or Levels option. Start has you play through every level in order from start to finish while Levels lets you select an individual one of the game's levels to play. It is recommended for first time player to try the start option first, but if you get stuck or want to replay a level, the Levels option is always there.</p>\n<p>Can you harness the power of the Electorbits to save Earth's technology? Find out now by clicking the play game button, and have fun!'</p>", "metacritic": null, "released": "2021-05-18", "tba": false, "updated": "2021-05-21T09:07:47", "background_image": "https://media.rawg.io/media/screenshots/fd2/fd217b8c77336d03c882f430d32abdb4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 37, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["benhen_26"], "genres": ["Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}