{"id": 60680, "slug": "strategeist", "name": "Strategeist", "name_original": "Strategeist", "description": "Strategeist is a grand strategy game in which you take on the mantle of a national spirit and guide a nation through time to build an empire and secure your place in history.  Starting in the year 1206, at the beginning of the Mongol Invasions, you will pick one of over a thousand countries and attempt to forge a new destiny by making strategic decisions about diplomacy, technology, economy, internal politics, and war.<br/><br/>As a Strategeist, your goal is to establish a powerful nation that stands proud and strong amongst the chaos of the world. However, you are not alone; other Strategeists also vie for dominion over the world and there are many among them who would happily see you fail.<br/><br/>In order to succeed, you must be willing to tackle internal rifts and negotiate skillfully with the other spirits playing on the cosmic chessboard. You must also shepherd and inspire men and women devoted to your cause to feats of glory in your name. When necessary you will have to scheme like Machiavelli, strategize like Bismarck, and when all else fails, unleash the dogs of war like Sun Tzu. You are.... a <strong>Strategeist</strong>.<br/><br/>Features<br/><br/><strong>Build a nation</strong> in a world teeming with nomadic tribes, bustling cities, thrifty merchants, brilliant scientists, and upstart kings.<br/><strong>Explore a beautiful 3D spherical globe</strong> with over 5000 territories, suitable for the most maniacal of conquerors.<br/><strong>Rewrite history</strong> for one of more than one thousand countries over two centuries.<br/><strong>Manage internal politics</strong> and navigate relations with internal factions as well as current issues.<br/><strong>Develop your economy</strong> and found cities, develop trade routes, and expand infrastructure.<br/><strong>Conduct diplomacy</strong> to improve your security and advance your goals.<br/><strong>Advance technology</strong> to increase your strength.<br/><strong>Experience an original soundtrack</strong> over one hour long.<br/><strong>Recruit talented people</strong> to further your civilization.<br/><strong>Unleash armies and navies</strong> to flatten your foes.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:58:42", "background_image": "https://media.rawg.io/media/screenshots/428/428a273641266b3545a546840104558d.jpg", "website": "http://www.strategeist.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 337, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Galactic Starfish"], "genres": ["Strategy", "Simulation"], "publishers": ["Galactic Starfish"], "esrb_rating": null}