{"id": 60697, "slug": "tian-ming-qi-yu-fate-seeker", "name": "天命奇御 Fate Seeker", "name_original": "天命奇御 Fate Seeker", "description": "<p>Produced by JSL ENTERTAINMENT, Fate Seeker is an original oriental role-playing action game set in the stunning KongFu universe. You play as the unruly teen, Stormy Chai, who accidentally unveiled conspiracy and hunted ever since. Escaping from death, Stormy decided to carry on the fate of “the Chosen One” to save the world. Journey on as the master of swordsman with open world mission for you to explore intensive live combat to challenge and overflowing plots to be enchanted. Your choice defines your destiny, and alter endings. Will you be the conquerer the world or the mighty hermit? Step into this universe to find out!FeatureVarious plots with multi-ending! Unrestricted to main storyline, as a free universe with endless tasks is for you to explore<br />\nMaster and mix-match martial art as you wish with addictive thrilling live combat!<br />\nThe Eight Divinatory Trigrams to train in endless ways, infused with story, combats and missions. Define your true fate!<br />\nFascinating side quests with unpredictable hidden plots will create unlimited surprises for you to discover!</p>", "metacritic": null, "released": "2018-08-07", "tba": false, "updated": "2024-03-02T09:26:58", "background_image": "https://media.rawg.io/media/screenshots/333/3331dbca65c5b78a48474fbded153727.jpg", "website": "https://goo.gl/LptgqS", "rating": 3.67, "rating_top": 5, "added_by_status": {"yet": 5, "owned": 86, "beaten": 4, "toplay": 1, "dropped": 3}, "playtime": 9, "achievements_count": 80, "ratings_count": 6, "suggestions_count": 331, "game_series_count": 0, "reviews_count": 6, "platforms": ["PC"], "developers": ["甲山林娛樂股份有限公司"], "genres": ["RPG"], "publishers": ["甲山林娛樂股份有限公司"], "esrb_rating": null}