{"id": 6072, "slug": "rival-stars-basketball", "name": "Rival Stars Basketball", "name_original": "Rival Stars Basketball", "description": "The power to create the ultimate basketball team… is in your hands.<br/> <br/>Rival Stars Basketball gives you the control. Draft extraordinary players, plan your strategy and unleash your team on real opponents from around the world in thrilling card battles. Make heat of the moment plays to gain the lead as tension builds. Then at pivotal moments get thrown into 3D on court action! Do you pass or do you go for the 3 pointer? Your choice can make or break your success.<br/> <br/>There are tons of ways to win powerful rare players and a world of ever-evolving rivals to pit them against. Shoot for Stardom, with Rival Stars Basketball!<br/> <br/>Rival Stars Basketball features:<br/>· Hundreds of fully-animated 3D player cards to draft, collect, and evolve. Intensify your team with special skills, bonuses, and more!<br/>· Immerse yourself in deep card management with infinite strategy and plays<br/>· On court action moments with steals, passes, shots, and dunks. Can you make the buzzer shot for the win?<br/>· Thrilling live global tournaments have you battling real-world opponents! Work your way up the ranks and challenge the very best for bigger rewards!<br/>· Heaps of other game modes with prizes galore!<br/>· Sweet achievement rewards for expanding your card collection and games well played!<br/>· Regular bonus events and promotions brought to you by the Rival Stars live team!<br/><br/>Rival Stars Basketball is free to play but offers some game items for purchase with real money.<br/><br/>We love to hear from our players!<br/>On Twitter? Drop us a line @PikPokGames and join the conversation with #RivalStars!", "metacritic": null, "released": "2014-10-23", "tba": false, "updated": "2019-07-29T15:04:56", "background_image": "https://media.rawg.io/media/screenshots/4f3/4f3c20b581781d9ab38bc097f8bea50a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 322, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["PikPok"], "genres": ["Sports", "Card"], "publishers": ["Prodigy Design Limited T/A Sidhe Interactive"], "esrb_rating": "Everyone 10+"}