{"id": 60721, "slug": "combat-rush", "name": "Combat Rush", "name_original": "Combat Rush", "description": "This \"snake\", but instead of the snake you have mercenaries with weapons in their hands!<br/>\r\nGather your own squad of professional mercenaries and defeat enemies who threaten the world with their weapons!<br/>\r\n* Non-stop action and easy squad control<br/>\r\n* 12 types of modern combat mercenaries with the personal weapon (sniper, shooter, machine gunner, etc.)<br/>\r\n* Call for the assistance on the battlegrounds for support in the operations (medic, combat drone, helicopter)<br/>\r\n* Collect tokens of defeated enemies and exchange them for new types of mercenaries and support<br/>\r\n* Dangerous bosses and enemy vehicles (jeeps, tanks, helicopters, war robots)<br/>\r\n* Various combat locations (snow, jungle, desert, urban, military base)<br/>\n<br/>\r\nA new mode is available - Arena. Every 60 seconds a new, more powerful, wave of enemies. Kill the maximum number of enemies and get rewards (a new mercenary for 150 dead enemies) and new color uniforms for your mercenaries, improving their characteristics (speed, vitality, damage, rate of fire).<br/>\r\nHard mode - that there are not enough enemies and your squad is too strong? Then this mode is for you!<br/>\n<br/>\r\nHints<br/>\r\n* Try not to crash into obstacles. If the commander dies you will start the game over<br/>\r\n* Release captive soldiers and collect tokens from the dead enemies<br/>\r\n* Buy new mercenaries with more powerful weapons<br/>\r\n* Buy new types of support<br/>\r\n* In a collision with the enemy, beat him with a knife<br/>\r\n* Grenades are well thrown through the walls<br/>\r\n* Buy or pick up on the battlefield body armor for your commander, to improve its survivability<br/>\r\n* Buy a new color of the mercenary form that would improve their characteristics<br/>\r\n* Do not blow up on mines<br/>\r\nSupport<br/>\r\n1. Call a mercenary on the battlefield<br/>\r\n2. Call a medic on the battlefield<br/>\r\n3. Automatic collection of tokens<br/>\r\n4. Call a airstrike<br/>\r\n5. Call a combat drone on the battlefield<br/>\r\n6. Call a helicopter on the battlefield", "metacritic": null, "released": "2018-08-14", "tba": false, "updated": "2019-08-28T21:58:41", "background_image": "https://media.rawg.io/media/screenshots/7e5/7e5c5e1f70278f613fe2e3d7e691846a.jpg", "website": "https://twitter.com/CreptsyStudio?lang=ru", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 374, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["CreptsyStudio"], "genres": ["Action", "Indie"], "publishers": ["CreptsyStudio"], "esrb_rating": null}