{"id": 60720, "slug": "who-wants-to-destroy-an-alien", "name": "Who Wants To Destroy An Alien", "name_original": "Who Wants To Destroy An Alien", "description": "<strong>Synopsis</strong><br/><br/>The universally famous TV Show, Who Wants To Destroy An Alien, is hosting its cyclical 'Rumble Royale' event! Combatants from all over the Universe have arrived in good sport, to get their wish granted or die trying! Of the hundreds of degenerates who arrive seeking fulfillment, thirteen stand apart as the potential victors. Who will win? That's for you to decide.<br/><br/><br/><br/><strong>Key Features:</strong><br/><ul><li> Experience a Battle Royale delivered in event-driven, classic, JRPG style!<br/></li><li> Choose from 13 characters each with their own psychology, wish, and unique ending.<br/></li><li> Place Traps, Sabotage Tech, or just Fight. Approach situations based on your character's strengths.<br/></li><li> Like MOBA games, build your character your way. Tweak passives, nitpick skills, and select the devices for your playstyle.<br/></li><li> A regenerating energy system for ground combat. Balance your energy. Choose your skills wisely.<br/></li><li> Visit various locations within this dystopian sector, such as Junkyards, Pawn Shops, Fast Foods, Workshops, and Public Transportation Stations!<br/></li><li> 2 Different Combat Modes: Ground Combat &amp; Ship Combat (both shown in Pre-Alpha video)!<br/></li><li> Upgrade System for your Weapon, Armor, and Ship<br/></li><li> Ditch your ship and take Public Transportation all the way!<br/></li><li> Board enemy ships, kill them, and take their ships (just like Battle Royale should be).<br/></li><li> Make your way to the final arena for the final showdown.<br/></li><li> The later you arrive, the stronger the remaining combatants. The sooner you arrive, the more of them.<br/></li><li> Event-driven storyline, based on how you choose to explore the map.<br/></li><li> Twisted aliens get twisted endings.</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:58:41", "background_image": "https://media.rawg.io/media/screenshots/858/8585e6303956e415138d831e8ad5d4fd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 209, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["SypherZent"], "genres": ["RPG", "Simulation", "Indie"], "publishers": ["SypherZent"], "esrb_rating": null}