{"id": 607402, "slug": "bomber-league", "name": "Bomber League", "name_original": "Bomber League", "description": "A bomberman a little more complex than usual. <br/>Choose your character who has his own special skill, make your choices strategically because you will need it to hope to win in this great Bombers tournament!<br/><br/><strong><h3>Characters:</h3></strong><br/>Each character has his own special skill, a skill that he can only use at specific times by earning enough points.<br/><br/><ul><li> Agent S.: Drops a smoke grenade to smother the bombs in the radius.<br/></li><li> Ramboum : Launches an atomic bomb that sprays absolutely everyone in its path, beware, it's more than deadly!<br/></li><li> Icy : throws a modified water bomb. Beware, in reality it's nitrogen and freezes everything in its path, even the blocks are not safe.<br/></li><li> Raiden : fascinated by electricity and lightning, he created a bomb that could paralyze all his enemies who would cause him even the slightest bit of trouble.</li></ul><br/><strong><h3>Items:</h3></strong><br/>To add a little more life to the field, we have a few items that might be interesting for anyone in the middle of a fight!<br/><ul><li> Rocket launcher: Shoots and destroys all the blocks in its path until it explodes and projects a long flame perpendicularly.<br/></li><li> Recharge Bonus: Allows you to recharge your special ability faster.<br/></li><li> Speed Bonus: Allows you to move at the speed of light.<br/></li><li> Mines: Be careful where you walk, one wrong step and it's the end for you because even the terrain could play tricks on you.<br/></li><li> C4: a little technological gem allowing you to make a good racket and good damage whenever and wherever you want.<br/></li><li> Shield : Protects you from a deadly explosion...</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2021-05-24T03:50:48", "background_image": "https://media.rawg.io/media/screenshots/c09/c0950e4ea4c1bb83458bb44dc162ec99.jpg", "website": "https://libertystudios.be", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 161, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Liberty Studios"], "genres": ["Action", "Adventure", "Strategy", "Indie"], "publishers": ["Liberty Studios"], "esrb_rating": null}