{"id": 607446, "slug": "sonar-islands", "name": "Sonar Islands", "name_original": "Sonar Islands", "description": "Sonar Islands is a MULTIPLAYER ONLINE game, where all relevant events happen in your ears. <br/><br/>On various islands you explore and discover, seek hidden TREASURES and conquer OBSTACLES. Every new island has a special atmosphere and a different gameplay. Do your best to fortify your islands and be clever enough to take the gold from your opponents.<br/><br/>Visit the ancient TEMPLE island, the ancestors built, where snakes are biting and down falling parts may block your way.<br/><br/>Take a trip to the JUNGLE island, watch abandoned lions on your way, but be aware of the tree traps, set up by the natives. You can go up, but there is no coming down.<br/><br/>The FUN FAIR island is a happy place to be. You can shoot toys coming towards you. Some carry a treasure, some carry a bomb, that's the risk.<br/><br/>The VOLCANO island is a chilly place, for some too hot, especially if you step near the lava flows. Ash and stone rain down due to the eruptions of terraforming, raise your shield to protect you.<br/><br/>In the MACHINE HALL you will meet the friendly robots from Feer, but this time you carry a stun gun to short-circuit their brains, at least for a while, till their self-repair is complete.<br/><br/>On PING island you will get a sonar device for orientation, send out a tone and the echo tells you, where to go. That’s good, because you may discover, this island is a labyrinth.<br/><br/>High up on the TREETOP island you have to deal with wind and mosquitos. The wind is really disorientating, leaves are rustling, while the mosquitos chase you. And don't fall, while balancing on the twigs.<br/><br/>On the ELECTRO island you face the invisible power of ELECTRICITY. Tesla coils sparkle round their high voltage, better shoot some metal confetti to divert the current. The nice thing here are catapult plates, they make you fly all over the island. A pity, that you don’t know where you will end up.<br/><br/>Happy vacation!<br/><br/><br/>Sonar Islands comes with a tutorial, a training island and a story island. To get full access to the game, Sonar Islands offers a monthly and a yearly subscription. When you purchase a subscription, payments will be charged to your App Store account at the confirmation of purchase and will automatically renew unless canceled within 24-hours before the end of the current period. For more information, see our Terms of Use (https://www.mentalhome.eu/terms-of-use/) and our Privacy Policy (https://www.mentalhome.eu/privacy-policy/).", "metacritic": null, "released": "2021-04-16", "tba": false, "updated": "2021-05-24T04:15:56", "background_image": "https://media.rawg.io/media/screenshots/860/8608b473409f3b4e56a0f40d498751c0_YnLLVPu.jpg", "website": "https://www.mentalhome.eu/sonar-islands/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 157, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Hansjoerg Mikesch"], "genres": ["Action", "Adventure"], "publishers": ["Hansjoerg Mikesch"], "esrb_rating": "Everyone 10+"}