{"id": 607558, "slug": "push-button-twotwos", "name": "PUSH BUTTON (twotwos)", "name_original": "PUSH BUTTON (twotwos)", "description": "<p>PUSH BUTTON is a local multiplayer fighting game for up to 26 players, depending on how fancy your keyboard is*. Once you've selected your buttons, the fight begins. Pushing makes you fire, firing moves you forward, and letting go reverses your direction of fire (as a hint, this means that pushing your button repeatedly moves and fires in a roughly straight line). Your goal is of course to be the last circle remaining in the ever-shrinking arena, but being knocked out of it isn't a death sentence: if you're clever and time it well enough, you can make it back before fading away. Allowing sabotage of other players' buttons is an optional rule that all players should agree on before starting...</p>\n<p>*if you're having trouble getting all the letters you want in a game, your keyboard probably doesn't have sufficient rollover. You should be able to manage 6 players at once on most keyboards if you choose the letters carefully enough. If you want to play with more, I recommend plugging in some extra USB keyboards (though be warned that this makes it easier to sabotage other players!). If you really like the game, I suggest making 26 separate large buttons for optimal play. Also note that I have only tested this game up to around 8 players, and it gets very chaotic! 26 may be a few players too many. If you try it, let me know how it goes :).<br/></p>\r\nHistory\r\n<p>This is a game I made for a games programming class some time ago. It's not extremely polished, and I admit the graphics are rather basic, but I hope you enjoy it anyway. I had a lot of fun playtesting this game! As this is something I've made in the past and am essentially finished with, I may not fix any bugs you report. But I appreciate any reports you have anyway.<br/></p>\r\nAcknowledgements\r\n<p>Made with the Godot Engine. The only sound effect in the game is from <em>The Roland MC-202 Sample Pack! #2</em> (1997) presented by shawn202 of N.O.I.S.E. music. The only font used is m6x11 by Daniel Linssen.<br/></p>\n<p>This is my first project uploaded to itch.io, so please let me know if I've done something wrong!<br/></p>", "metacritic": null, "released": "2021-05-23", "tba": false, "updated": "2021-05-24T04:45:35", "background_image": "https://media.rawg.io/media/screenshots/63e/63e3b7e32aad6be72de0159cf0003c0b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 36, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Web"], "developers": ["twotwos"], "genres": ["Action", "Fighting"], "publishers": [], "esrb_rating": null}