{"id": 60751, "slug": "depraved", "name": "Depraved", "name_original": "Depraved", "description": "In Depraved you are the leader of the pioneers in the Wild West. You are about to start your adventure in a procedurally generated world with only one carriage full of resources. Select a suitable place for your first settlement and procure building materials from mother nature or by trading to create a new home country for your residents. The happier your residents are, the faster your town will grow.<br/>Supply your residents with food and water, so that they won't starve or die of thirst. Protect them against the weather and against illnesses by supplying them with clothes and fire wood.<br/><br/>You will have to face numerous dangers. Storms, illnesses and bandits will strike at you, and also your own residents can become a danger, if you do not meet their needs. Are you ready for this challenge?<br/>NeedsThe residents of Drepraved have needs. Their basic needs are hunger and thirst which you can satisfy with food and water. In addition, every population type needs another food source. If your population type experiences a shortage of food and the preferential food is not available, you can nourish them with an alternative food source - however, this will affect the mood of your residents in a negative way. Unhappy residents commit raids and other criminal offenses or simply leave the town.<br/><br/><br/>The happier the residents of your town are, the more popular life in your town will become and more and more colonist will join you. If your town experiences famines, illnesses or lawlessness, the residents of the town will turn their backs and the streets will resemble a ghost town.DangersThe Wild West is dangerous! Dozens of challenges must be faced. There are different areas in which your residents can settle down - however, each of them is known for its own challenges. While in the desert the food and water supply remains a difficulty, in the snowy areas you can only resist by a constant supply with fire wood.<br/><br/><br/>Another danger comes from the surrounding animals. Even if most animals avoid humans, you should be cautious with wolves or bears. They can cause heavy injuries to your residents or kill them.<br/><br/><br/>Also surrounding camps and bandits can become dangerous. Do not underestimate them, because they rob your residents and commit raids. Such attacks affect the safety feeling of your residents and cost you valuable resources.<br/>", "metacritic": null, "released": "2018-07-20", "tba": false, "updated": "2019-08-28T21:58:39", "background_image": "https://media.rawg.io/media/screenshots/55a/55a84311546e99dc0e163bb9f0ecea47.jpg", "website": "http://evilbite.com/depraved", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 79, "beaten": 1, "toplay": 1, "dropped": 3}, "playtime": 8, "achievements_count": 13, "ratings_count": 3, "suggestions_count": 522, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["Evil Bite"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["Evil Bite"], "esrb_rating": null}