{"id": 60760, "slug": "prank-bros", "name": "Prank Bros", "name_original": "Prank Bros", "description": "The Prank Bros is a funny and chaotic multiplayer party game that supports one to eight players. Players can play individually or in a team. You and your friends can use up to 30 kinds of skills and weapons to fight and capture the flag. Turn your opponents down with stinky fart or electric stick. You can also use the lift and the teleportor to get the opponent out of the field, or capture the flag then use acceleration to run away! The player or the team with the highest score wins!<br/><br/>Do you want to enjoy the joy of throwing your opponent into the sky?<br/>Do you want to enjoy the excitement of winning when you almost lose?<br/>Do you want to enjoy the thrill of playing skill combo with your teammates?<br/>if you want! Then come join us!<br/><br/><strong>Funny and Chaotic Multiplayer Party Game</strong><br/><br/>You can play with your friends in real life, or you can join online rooms created by other players. The game supports voice chat, so you don't have to worry about friends cannot communicate with each other. You can exchange strategy, share joy, ridicule each other and provoke opponents.  Disturbing the opponent's psychology may also help you win. <br/><br/><strong>Based on the Physics in Real Life</strong><br/>With the support of the physics engine, the combat performance will be difficult to predict. You may kick the opponent to the sky with one big hit. The opponent can be bounced out of the clouds by the bouncer, be hit by the train, and be kicked by a dangerous ball! There is no limit. The situation is waiting for you to experiment!<br/><br/><strong>Hilarious Skills and Weapons</strong><br/>We designed more than 30 performance-specific skills and weapons. There is a India flute that lets your enemy to dance, toilet sucker that sucks your opponent, teleportor that breaks the time and the space, skills and weapons can bring you a different gaming experience every time.<br/><br/><strong>Various Maps</strong><br/>In the field of the Antarctic scientific research station, there are dangerous ice floats, deep oceans, and cute penguins; on the ocean drilling platform, there are bouncers and the endless ocean; there are also fast trains in huge cities etc...<br/><br/><strong>Cooperate with Your Friends!</strong><br/>In the team mode, you can coordinate with your teammates, use different skills and weapons to create combos! Smart positioning and reasonable strategy will make your team extraordinary!", "metacritic": null, "released": "2018-07-31", "tba": false, "updated": "2019-08-28T21:58:39", "background_image": "https://media.rawg.io/media/screenshots/acc/accba5d4dd5fa527a0124a6fca82ebc7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 279, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Rocky Games"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Rocky Games"], "esrb_rating": null}