{"id": 607734, "slug": "teino", "name": "Teino", "name_original": "Teino", "description": "Setting Information\r\n<p>Teino is set in an early neolithic inspired stone punk world, which is also called Teino. Teino is a force that allows a user to manipulate the flow of time around them. The story of Teino follows the descendent of the greatest user ever known throughout the vast and once united tribes. The protagonist goal is to reclaim his Great Grandfathers masks of Teino, once-powerful artefacts, now in the hands of the malicious tribes; the masks are meer ways to extort and harm the weaker tribes. The power of the masks corrupting them, making them savage and more primal. With elements of both an arena fighter and a platformer, we plan to provide a skill-based experience while telling a story through the world.</p>\n\r\nGameplay Information\r\n<p><strong>Our three main design pillars are:</strong>\n</p>\n<ul><li>Fast-Paced and Active Gameplay to employ a sense of enjoyment.</li><li>Combat that feels 'Dangerous' and engaging, promoting quick responses from the player using the differing Teino States. \r\n</li><li>Focus on player skill and reaction over interactivity with the world. \r\n</li></ul>\n<p><strong>USP:</strong></p>\n<p>The Teino System grants the player the ability to speed up and slow downtime with the press of a button via switching between stances <em>(Keys Q &amp; E)</em>. In these altered states, the player will have alternative ways of engaging with their environment.</p>\n<p>Overall the player will be able to enter five states total, with the two on each end being a more extreme version of each shift to be used at the players’ discretion. These extra states exist to give the player both an added layer to the risk/rewards system of Teino <em>(Adding more risks for more possible gains)</em> as well as increasing the level of platforming complexity available, with a heavier modification to the jump arcs and the turning radius of the player mid-jump.</p>\n\r\nControls\r\n\r\nThe Team\r\n<p><strong>Trailer - </strong>Tolu Ogbaro</p>\n<p><strong>Audio </strong>- Joe Bramhill &amp; Ben Micallef</p>\n<p><strong>SFX modifications from Soundly</strong> - Jack Davis &amp; Ben Micallef</p>\n<p><strong>Animation &amp; Rigging - </strong>Mixamo<br/></p>", "metacritic": null, "released": "2021-05-21", "tba": false, "updated": "2021-05-24T05:31:10", "background_image": "https://media.rawg.io/media/screenshots/a61/a61381dbb2e4a59669ac1ec26fcf64f2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 113, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Sam33BringItOn", "Searoges", "AhhJimbo"], "genres": ["Action", "Adventure", "Fighting", "Platformer"], "publishers": [], "esrb_rating": null}