{"id": 607898, "slug": "lost-in-my-spectrum", "name": "LOST IN MY SPECTRUM", "name_original": "LOST IN MY SPECTRUM", "description": "LOST IN MY SPECTRUM\r\nUn raccoglitutto psichedelico e postmoderno<br/>per lo ZX SPECTRUM 48/128K\r\nA psychedelic and post-modern collect-em-up<br/>for the 48/128 ZX SPECTRUM\r\nUn juego \"recolecta-todo\" psicodélico y postmoderno<br/>para ZX SPECTRUM 48/128K\r\nGioco e manuale in:<br/>\r\n\r\nGame and manual in:<br/>\r\n\r\nJuego y manual en:\r\nITALIANO - ENGLISH - FRANCAIS -<br/>\r\n\r\nDEUTSCH - ESPAÑOL - PORTUGUÊS\r\n\n<p><strong>*** ITALIANO ***</strong></p>\n<p>Alessandro ha giocato troppo col suo Spectrum ed è rimasto intrappolato al suo interno! Sarete in grado di tirarlo fuori da lì?</p>\n<p><em>LOST IN MY SPECTRUM</em> è stato il mio primissimo gioco per lo Spectrum, e come spesso accade in questi casi, è un raccoglitutto in stile <em>Manic Miner. </em>Poiché di giochi del genere ce ne sono a tonnellate, ho cercato di realizzarlo in modo da renderlo unico. Coloratissimo e pieno di citazioni di ogni genere, dalla filosofia medievale ai Kraftwerk, da Mondrian al \"R Tape loading error\" che gli appassionati di Spectrum ben conoscono, <em>LOST IN MY SPECTRUM</em> giunge adesso alla versione 2.1.</p>\n<p>Novità: il tempo scorre un po' più lentamente; quando il giocatore perde tutte le vite ricomincia dall'ultimo schermo raggiunto, anziché dal primo del livello corrente; un leggero sfarfallìo degli sprite che poteva verificarsi in alcuni casi è stato eliminato (grazie a un accorgimento ideato da Allan Turvey).</p>\n<p>Buon divertimento!</p>\n<p><em>- L'Autore</em></p>\n\n<p><strong>*** ENGLISH ***</strong><br/></p>\n<p>Alessandro played too much with his Spectrum and got trapped inside it! Will you be able to get him out of there?</p>\n<p><em>LOST IN MY SPECTRUM </em>was my very first Spectrum game, and as it often happens in such cases, it is a collect-em-up a là <em>Manic Miner. </em>Since games like that are a dime a dozen, I tried to make it unique. Extremely colorful and full of references, from medieval philosophy to the Kraftwerk, from Mondrian to the \"R Tape loading error\" that Spectrum aficionados know well, <em>LOST IN MY SPECTRUM</em> has now been updated to version 2.1.</p>\n<p>What's new: time runs a little slower; when you lose all of your lives, you restart from the last screen reached, rather than from the first of the current level; a slight flicker of sprites that could occur in some circumstances has been eliminated (thanks to a code devised by Allan Turvey).</p>\n<p>Enjoy!</p>\n<p><em>- The Author</em></p>\n\n<p><strong>*** ESPAÑOL ***</strong></p>\n<p>¡Alessandro jugó demasiado con su Spectrum y quedó atrapado adentro! ¿Podrás sacarlo de ahí?</p>\n<p><em>LOST IN MY SPECTRUM</em> fue mi primer juego para Spectrum y, como suele pasar en estos casos, es un \"recolecta-todo\" al estilo de<em> Manic Miner. </em>Como hay juegos como este a tutiplén, traté de hacerlo único. Colorido y lleno de citas de todo tipo, desde la filosofía medieval hasta los Kraftwerk, desde Mondrian hasta el \"R Tape loading error\" que los aficionados del Spectrum conocen bien, <em>LOST IN MY SPECTRUM</em> está ahora a la versión 2.1.</p>\n<p>Que hay de nuevo: el tiempo corre un poco más despacio; cuando se pierden todas las vidas, se vuelve a empezar desde la última pantalla alcanzada, en lugar de la primera del nivel actual; se ha eliminado un ligero parpadeo de los sprites que podía ocurrir en algunos casos (gracias a un código realizado por Allan Turvey).</p>\n<p>¡Que se diviertan!</p>\n<p><em>- El Autor</em></p>", "metacritic": null, "released": "2021-05-22", "tba": false, "updated": "2021-05-24T06:15:17", "background_image": "https://media.rawg.io/media/screenshots/7ec/7eccc1934a5bddca53e51c306c1e02af.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 149, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["zanklesoft"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}