{"id": 607907, "slug": "three-body", "name": "Three-Body", "name_original": "Three-Body", "description": "<p><strong>A Sci-Fi Walking-Simulator.</strong></p>\n\n<p><strong>Key Binding:</strong></p>\n<p>Move<strong> Mouse</strong> to move the camera</p>\n<p>Press <strong>W, S, </strong><strong>A</strong>  and <strong>D </strong>to move\r\n</p>\n<p>Press <strong>Space </strong>to jump</p>\n<p>Press <strong>Esc  </strong>to quit the game</p>\n\n<p>The name Three Body is from a very famous Sci-Fi novel with the same name written by Cixin Liu. It tells a story about an alien civilization wants to conquer earth as new home because its own planet is in a solar system with three suns, which has an extreme environment and possible to be destroy by one of the suns at any time. I used only the setting of a planet with three suns, which I think is very cool. I made the planet cubic instead of a sphere to make it far more cool. The game is start with a rocket crashing to this cubic planet and then the player can explore the planet, which is kind of an unexpected journey. What I want is just show something weird and cool to the players along with exploring this strange world. </p>\n\n\n<p>I mainly used models and textures assets due to these two are the most difficult, especially textures. Two of the sides of the cube was made only with models from assets store, I just arranged them to make a scene I want. I used to download some assets of trees, but I discard them because I found out it was not so suitable to such a weird planet. I had an idea about made the planet allude to different possibilities of a civilization’s history. Top side is ancient civilization, four sides around indicates this civilization went too far in four different ways separately, War, Religion, Science (the fourth one I did not decide). But I realized it was so hard to make it easy to understand, and not so cool. So, I abandoned this idea and changed to make it just weird and cool, no more meanings. </p>\n\n<p>As I mentioned before, the first scene of this game is in a rocket approaching the cubic planet, so that the players will have an overall image of what the world like and definitely interested in what will happen when jump from the edge of the cube or what the other three sides look like. </p>\n\n\n<p>The most memorable moment of this game must be this scene at the bottom of the cube. There is a strange shape like an armillary sphere in the air and a set of hexagonal prisms which will rise when those rings from armillary sphere went close to them. They will also rise when player step on it, other pillars around it will rise a little bit, too, which will form a shape like a mountain, so cool! That thing takes me a lot of time and I like it best.</p>\n\n\n<p>I want my level weird but cool, which I think is attractive. For example, as shown in the picture below, there is 4 rings with different number of edges rotate around one point with different speed. Each ring shoots a laser from one of the vertices, and once laser hit the center of the wall, one part of the stair will appear, and disappear after 3 second. Due to ring have different speed, four lasers will hit at the same time about once per half minute, which will form a complete stair. </p>\n\n<p><strong>References: </strong></p>\n<p>Assets and tools used: 1. ProBuilder 2.x - https://assetstore.unity.com/packages/tools/modeling/probuilder-2-x111418 </p>\n<p>2. Yughues Free Metal Materials - https://assetstore.unity.com/packages/2d/texturesmaterials/metals/yughues-free-m... </p>\n<p>3. Yughues Free Ground Materials - https://assetstore.unity.com/packages/2d/texturesmaterials/floors/yughues-free-g... </p>\n<p>4. Yughues Free Architectural Materials - https://assetstore.unity.com/packages/2d/textures-materials/yughues-freearchitec... </p>\n<p>5. Standard Assets - https://assetstore.unity.com/packages/essentials/assetpacks/standard-assets-3235... </p>\n<p>6. Lens Flares - https://assetstore.unity.com/packages/tools/particles-effects/lens-flares-5 </p>\n<p>7. low poly lava Plants - https://assetstore.unity.com/packages/3d/environments/fantasy/low-poly-lava-plan... </p>\n<p>8. Flooded Grounds - https://assetstore.unity.com/packages/3d/environments/floodedgrounds-48529 </p>\n<p>9. Sun Temple - https://assetstore.unity.com/packages/3d/environments/sun-temple115417 </p>\n<p>10. Atom Rocket Model - https://assetstore.unity.com/packages/3d/vehicles/space/atomrocket-model-140021 </p>\n<p>11. Milky Way Skybox - https://assetstore.unity.com/packages/2d/textures-materials/milkyway-skybox-9400...</p>\n\n<p><strong> </strong></p>", "metacritic": null, "released": "2021-05-22", "tba": false, "updated": "2021-05-24T06:17:16", "background_image": "https://media.rawg.io/media/screenshots/794/794a67d0d2c635833fbee0411668fa2d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 95, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Deno"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}