{"id": 608150, "slug": "sariel-goes-on-a-walk", "name": "Sariel Goes on a Walk", "name_original": "Sariel Goes on a Walk", "description": "<p><strong>Sariel Goes on a Walk</strong> is a short game I made in a few days. Take control of wherever Sariel decides to take his afternoon walk! To the beach? Sure! Grab a bite to eat? Hell yeah, do what you want, bro! The Library? Woohoo, books! The choice is yours. There are five different routes to go down, each one with it's own separate character to meet and have a small chat with. Estimated playtime is about <strong>20-25 minutes</strong>.</p>\n<p>I would personally recommend you do the <strong>Library</strong> route first. Reason for this being that it provides context to lore talked about in several other routes. Feel free to do what you like, though!</p>\n<p>This game covers a bit of lore in my larger ocverse and these characters have already existed for quite some time prior to this game's creation. I apologize if anything is confusing to you! I plan to continue releasing much more content for this world, so if you enjoyed this, then I hope you will look forward to it.</p>\n<p><strong>CONTENT ADVISORY</strong>: This game contains no triggering imagery, however there are passing mentions of slavery, cults, murder, abuse, human experimentation and general violence. A character also has a mental breakdown in one of the routes, as well as minor screen shakes here and there. Please take care.</p><p><strong>MUSIC CREDITS:</strong><br/></p><p>hmix</p><p>aoitorinouta</p><p>ontama</p><p>musmus</p>", "metacritic": null, "released": "2021-05-23", "tba": false, "updated": "2021-05-24T07:25:12", "background_image": "https://media.rawg.io/media/screenshots/b04/b04ec63b355e21dde14134c9eb1ef0aa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 126, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["psychosomatia"], "genres": [], "publishers": [], "esrb_rating": null}