{"id": 608257, "slug": "one-week-shop-keep-gwj-33", "name": "One Week Shop Keep (GWJ-33)", "name_original": "One Week Shop Keep (GWJ-33)", "description": "<p>One Week Shop Keep is a game where you don't play as the hero, instead, you play as the shopkeeper, Bramble. Your job is to supply the heroes of the story with potions that fulfill their request. This game was initially made for Godot Wild Jam #33 and may continue development as time goes on. This was my first game that was primarily UI focused rather than physics / gameplay focused.</p>\n<p>When creating a potion, you need to click and drag materials from their boxes. With each request you are only given a few ingredients to work with, so make sure not to waste all of them. You can place the ingredients back into their container if you wish to save them (You get more upon the next request). To add an ingredient to the cauldron, simply drag, and drop it in the center of the screen. Each ingredient slightly adjusts the compositon, so play around with different ingredients and try to figure out how you can efficiently create various effects!<br/></p>\n<p>Controls:</p>\n<ul><li>Enter: Forward Dialogue</li><li>Left Click: Pickup/Release Item, Select Choice</li></ul>\n<p>The game was made by three people,</p>\n<ul><li>Programming/Sounds: Gabriel Russell</li><li>Artwork: Little Ly Arts</li><li>Music: SleepyUFO</li></ul>\n<p>The game was made with the Godot engine, and makes use of the GodotTIE plugin by Henrique Alves.<br/></p>", "metacritic": null, "released": "2021-05-23", "tba": false, "updated": "2021-05-24T07:48:14", "background_image": "https://media.rawg.io/media/screenshots/b17/b1757bd2942bbd8e184a5c2b23b858cb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 60, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["GabrielRRussell"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}