{"id": 608223, "slug": "healer-in-chaos", "name": "Healer in Chaos", "name_original": "Healer in Chaos", "description": "<p>Hi !</p>\n<p>This game was submitted to the Godot Wild Jam #33, to answer to the theme \"You aren't the hero\".</p>\n<p>It is a tribute to every healer protagonist and player who sadly aren't as considered as heroic as they should be !</p>\n<p>You play as a White Mage who joined a group of famous adventurers. Your role is to keep them alive, by casting spells to heal and cure them from ailments they inflict on themselves. Each spell has its own properties, from its range to its heal value.</p>\n<p>To keep your friends alive, you're going to need to be aware of their health points, but also ready to cure them in case they go insane and put everybody in danger. The spells dont have any cooldowns, but they do cost mana points, and you will have to be careful about this.</p>\n<p>Beside the chaos your team generates, they will beat a lot of enemies ; you should probably gather experience by looting them, so you can level up your spells and mana gauge. And who knows, maybe, some enemies will drop mana potions ?</p>\n<p>------ CONTROLS ------</p>\n<p>WASD : Move the character</p>\n<p>Mouse : Interact</p>\n<p>Controls are detailed in the game menu.</p>\n<p>-----------------</p>\n<p>This was our second Godot Wild Jam together, and our second Godot project. We submitted <em>Cave of Dizziness</em> a year ago for the 22th GWJ, and we were not able to do as much as we wanted to. This time went way better than the last, and we hope you'll enjoy playing <em>Healer in Chaos !</em></p>\n<p>Game design/Developement/Composition : Eric LAMAISON (Kikopu)</p>\n<p>Lead developement : Enora GICQUEL (Kahmeset)</p>\n<p>Graphic Art : Joris MAGRAS (jorismag)</p>", "metacritic": null, "released": "2021-05-23", "tba": false, "updated": "2021-05-24T07:40:30", "background_image": "https://media.rawg.io/media/screenshots/2a3/2a3fafc8c4be0aca288debd78ec478ad.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 45, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux", "Web"], "developers": ["Kikopu"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}