{"id": 60833, "slug": "gibbous-a-cthulhu-adventure", "name": "Gibbous - A Cthulhu Adventure", "name_original": "Gibbous - A Cthulhu Adventure", "description": "<p>A comedy cosmic horrror adventure made in Transylvania.<br />\nDarkham, with its crooked gambrel roofs, dark alleys, and a past shrouded in secrecy, never really was a welcoming place, but nowadays?  Kooky cults are popping up everywhere, and that most evil book, the Necronomicon, is spoken of in trembling whispers once more.<br />\nDetective Don R. Ketype is on the case to retrieve the mysterious evil tome, but unsuspecting librarian Buzz Kerwan stumbles upon it and accidentally transforms his cat, Kitteh, into a walking, talking abomination. Being humanized? Quite a downgrade.<br />\nGibbous is a comedy cosmic horror game - a modern adventure that is classically inspired, features gorgeous HD art, detailed traditional animation, and a lengthy story that will see the three protagonists travel around the world and deal with abominations both cosmic and human-made, voodoo, and Things That Should Not Be. From Lovecraft Country to Transylvania, set off on a quest to  get a very cynical cat to stop talking.<br />\n• Over 60 hand-painted, detailed environments inspired by Transylvanian architecture and nature;<br />\n• Fluid traditional 2d animation with a Disney-esque look and feel;<br />\n• Two protagonists and a talking ca--- Okay, three. Three protagonists;<br />\n• Upwards of 70 fully voiced, crazy characters;<br />\n• Special guest appearance by Doug Cockle, voice of the Witcher;<br />\n• Contains most genuine Transylvanian accent in games and media, like, ever;<br />\n• Over 4 hours of lush original soundtrack featuring live instruments;<br />\n• A lengthy cinematic story that spans continents and more;<br />\n• Moment to moment humor, darker arching plot;<br />\n• Dynamic lighting, real time reflections and weather system;<br />\n• Integrated hint system to help you when you’re stuck;<br />\n• Fully animated cartoon cutscenes that punctuate important story beats;<br />\n• Over 12,000 voiced dialogue lines;<br />\n• Custom voiced responses for all the crazy combinations you can think of;<br />\n• Lovingly made near Vlad the Impaler’s birthplace;<br />\n• No cutesifying or making fun of the Old Ones, praise their Dark Names;<br />\n• Did we mention the talking cat?</p>", "metacritic": null, "released": "2019-08-07", "tba": false, "updated": "2023-05-13T20:36:01", "background_image": "https://media.rawg.io/media/screenshots/078/078c4c985fbe53c65143730a445c77f6.jpg", "website": "http://gibbousgame.com/", "rating": 3.78, "rating_top": 4, "added_by_status": {"yet": 27, "owned": 198, "beaten": 33, "toplay": 45, "dropped": 11, "playing": 4}, "playtime": 4, "achievements_count": 24, "ratings_count": 38, "suggestions_count": 416, "game_series_count": 0, "reviews_count": 41, "platforms": ["PC", "macOS", "Linux"], "developers": ["Stuck In Attic"], "genres": ["Adventure"], "publishers": ["Stuck In Attic"], "esrb_rating": null}