{"id": 60845, "slug": "achtung-cthulhu-tactics", "name": "Achtung! Cthulhu Tactics", "name_original": "Achtung! Cthulhu Tactics", "description": "<p>Challenge the horrifying reign of Nazi terror and battle an immortal evil in Achtung! Cthulhu Tactics; a turn-based tactical strategy game set in the award-winning Achtung! Cthulhu universe.<br />\nIn this raging Secret War across Europe, an untold darkness spreads deep beneath the Earth and throughout the Forest of Fear. The unknown lurks in the shadows and you must claim victory at any cost, because whilst Nazi factions terrorise these lands, they are not the darkest foe you face…<br />\nBehind enemy lines and tasked with overthrowing a nightmare alliance of dark science and the occult, you hold the fate of humanity in your hands. Lead your elite squad of allied forces to victory using daring tactics and cunning strategies to overthrow the Cult of the Black Sun and destroy the Mythos secrets they plan to use.<br />\nKey Features<br />\nTactical Combat: direct a squad of allied heroes in innovative turn-based ground battles.<br />\nMomentum System: perform well in combat by racking up kills and executing critical hits to earn Momentum and turn the tide of battle in your favour.<br />\nLight vs Dark: harness the power of the light to expose and suppress the spawn of Cthulhu hiding in wait in the oppressive darkness.<br />\nAP System: every decision is important and the Action Point System gives you the flexibility to put as much emphasis into heavy combat or nimble movement as you like.<br />\nPsychological System: witness too many horrors of war and watch as your unit&#39;s sanity begins to unravel mid-fight.<br />\nBuild Your Team: characters have unique skills that can be unlocked and levelled up in different ways, and weapons can be modified to give a variety of benefits. This lets you customise your squad to better vanquish Nazi scum.<br />\nWeird World War: explore the Lovecraft-meets-WW2 universe of Achtung! Cthulhu like never before with Mythos-inspired enemies and a story-driven campaign handcrafted by John Houlihan which ties directly into the pen and paper roleplaying game narrative.</p>", "metacritic": null, "released": "2018-11-04", "tba": false, "updated": "2019-08-28T21:58:35", "background_image": "https://media.rawg.io/media/games/515/5155d326c4c783f0dd1a476022777f9b.jpg", "website": "https://ripstone.com/game/achtungcthulhutactics/", "rating": 2.5, "rating_top": 3, "added_by_status": {"yet": 3, "owned": 82, "beaten": 1, "toplay": 2, "dropped": 3}, "playtime": 7, "achievements_count": 75, "ratings_count": 6, "suggestions_count": 310, "game_series_count": 0, "reviews_count": 6, "platforms": ["PlayStation 4", "Xbox One", "Nintendo Switch", "PC"], "developers": ["Auroch Digital", "Ripstone"], "genres": ["Action", "RPG", "Strategy", "Indie"], "publishers": ["Ripstone"], "esrb_rating": null}