{"id": 60858, "slug": "operation-lone-wolf", "name": "Operation Lone Wolf", "name_original": "Operation Lone Wolf", "description": "<strong>Game Info and Features</strong><br/>Operation Lone Wolf is a multiplayer first person shooter, set in the second World War. You can play with up to 10 players, in different free for all gamemodes. At the moment this game has 8 of them, including: standard free for all, gungame, sniper, shotgun and pistol-only and more. <br/><br/>You can choose from a wide variety of weapons, from 5 different catagories. By playing with a weapon, you get upgrade points for that specific weapon, to improve your weapon statistics. For certain weapons you can buy optics or silencers. You can also buy weapon skins in the shop, when you have reached player level 3. Skins, weapons and weapon attachments can only be bought with in-game money.<br/><br/><br/>There are also 18 different perks to choose from, to make your character the way you want. Playing well will be rewarded with killstreaks, like a radar, a bomber plane or a bomb you can control falling down on the map. Also, the higher your killstreak is, the stronger your soldier will get. For example faster sprint speed, and a little bit more health.<br/><br/>You can play on 10 different maps, set on all kinds of different locations. Operation Lone Wolf has small and fast paced maps, and big, more open maps for a little bit more tactical gameplay, so there are many gameplay options available for the players. This game is not trying to be a realistic representation of WW2, but more of an arcade, fast paced version of it, in which having fun is the main goal. Post launch updates like new maps, new gamemodes etc. will all be free, and there are no in-game purchases or lootboxes in Operation Lone Wolf. You can also play offline with bots, to test your skills and improve in the game, or play without an internet connection.<br/><br/><br/><strong>Early Access</strong><br/>All the things above are already in the game at the moment. But during Early Access we want to use player feedback to improve the game, and balance weapons, perks, and killstreaks. The game will also be updated with skins, new weapons, new maps, new gamemodes, new perks, and all of those updates will be completely free.<br/><br/><strong>Servers</strong><br/>Right now, servers are available in the following regions:<br/>-Asia<br/>-Australia<br/>-Canada<br/>-Europe<br/>-India<br/>-Japan<br/>-Russia<br/>-East Russia<br/>-South America<br/>-South Korea<br/>-USA East<br/>-USA West", "metacritic": null, "released": "2018-10-01", "tba": false, "updated": "2019-08-23T12:11:53", "background_image": "https://media.rawg.io/media/screenshots/5ea/5eacec94641ea12df2d663a9ebcf7555.jpg", "website": "https://www.operationlonewolf.ga", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 330, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Operation Games"], "genres": ["Action", "Indie"], "publishers": ["Operation Games"], "esrb_rating": null}