{"id": 60856, "slug": "uppers", "name": "UPPERS", "name_original": "UPPERS", "description": "<p>Last Resort Island is a city consumed by desire - for those that live on the island, the greatest amusement is violence. A single person’s strength alone can build great fortune, and earn the admiration of the populace.<br />\nWith strength, motivation and fire in their eyes, two young men, Ranma and Michiru, arrive at Last Resort Island to begin their quest, their sights aimed for the top - but they aren’t the only ones on Last Resort Island with lofty ambitions.<br />\nUPPERS tells the story of two men and their journey to the top, using 12 varied fighters and eight support characters - discover their drive, their heartbreaking backgrounds, and fight to be crowned the strongest in Last Resort Island!<br />\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~<br />\nUPPERS, a beat-em-up brawler originally released as a Japanese PlayStation®Vita exclusive, has been fully remastered for the PC. The game puts you in control of up to 13 fighters, including bonus character Daidoji-Senpai of the SENRAN KAGURA series. Follow their journey through seven varied Chapters across multiple difficulty levels and a multitude of locations!KEY FEATURES<br />\nFully Remastered &amp; Multi-Language Support!<br />\nExperience the game like never before fully remastered in 1080p, 60FPS with native support for even higher resolutions and offers full text localisation for English, French, Japanese, Korean, Traditional Chinese &amp; Simplified Chinese.</p>\n<p>Varied Character Roster<br />\nControl two of thirteen varied fighters each with their own fiery combos and bodacious finishing moves. From Kickboxing to Martial Arts, Kenka and Wrestling, each fighter brings their A-game to the show!</p>\n<p>Explosive, Action-Packed Combat!<br />\nPlease your streetside fans and charge your VOLTAGE! RISE-UP and augment your combos with even more spectacle and fighting style before unleashing your fury with the Upper Rush - pummeling your opponent with hundreds of attacks before your fans’ very eyes! Perhaps your adoring fans will reward you handsomely by showing you their favorite pair of underwear!</p>\n<p>Crazy Environmental Interactions<br />\nUtilise the environment to your advantage, throw cars, throw bicycles, throw motorbikes or choose to slam-dunk your opponent into a manhole or uppercut him into a passing by Helicopter - the possibilities are both ludicrous and crazy!</p>", "metacritic": 60, "released": "2020-10-21", "tba": false, "updated": "2023-06-08T06:14:11", "background_image": "https://media.rawg.io/media/games/972/9720323259e41e30b20efe57cc1bf36a.jpg", "website": "", "rating": 0.0, "rating_top": 4, "added_by_status": {"yet": 2, "owned": 36, "beaten": 1, "toplay": 1, "dropped": 1}, "playtime": 6, "achievements_count": 62, "ratings_count": 5, "suggestions_count": 453, "game_series_count": 0, "reviews_count": 5, "platforms": ["PC", "PS Vita"], "developers": ["Bullets"], "genres": ["Action", "Fighting"], "publishers": ["Marvelous"], "esrb_rating": "Teen"}