{"id": 608697, "slug": "akibas-trip-hellbound-debriefed", "name": "AKIBA'S TRIP: Hellbound & Debriefed", "name_original": "AKIBA'S TRIP: Hellbound & Debriefed", "description": "<p>Supernatural creatures are stalking the pop culture mecca of Akihabara—and you know that because they&#39;ve turned you into one of them. Their only weakness, and yours, is sunlight, which means there&#39;s only one way to stop them: call them out on the streets, knock their clothes off, and expose their skin before they can do it to you.<br />\nArm yourself with a rolled-up poster, a guitar, a laptop, a magical girl wand, or (if you insist) an actual weapon, then hit Akihabara&#39;s colorful streets. Browse recreations of real-life shops circa 2011, mingle with Akiba&#39;s residents and tourists, and discover the town&#39;s many secrets.<br />\nWill you work with the secret paranormal-hunting agency, give the creatures a fair shake (hey, some of them seem all right), or just look out for your otaku friends? Choose your side, choose your missions, and enjoy a freewheeling adventure with AKIBA&#39;S TRIP: Hellbound &amp; Debriefed.Key Features<br />\nPlayful Reimagining of Japan’s Electronics Mecca<br />\nTake a virtual tour of 2011’s Akihabara district recreated in painstaking detail, complete with accurate street layouts and shops based on real businesses operating at the time.<br />\nFight Like a Nerd<br />\nWield an arsenal of replicas, collectibles, and other amusing objects as you humiliate vampires into submission in this playful twist on the 3D beat &#39;em up genre, all while wearing a stylish array of customizable clothes and costumes.<br />\nYour Choices Matter<br />\nChoose which faction to support in the fight for Akihabara and watch as your decisions affect the course of the story, culminating in one of several different endings.<br />\nFull Dual Audio<br />\nEnjoy hours of voiced-over banter in your choice of English or the original Japanese.<br />\nDigital Deluxe Edition</p>", "metacritic": null, "released": "2021-07-20", "tba": false, "updated": "2023-04-27T08:24:35", "background_image": "https://media.rawg.io/media/games/923/923bfa66369c2b9917ec467adf1a4a3c.jpg", "website": "http://www.akibastrip.com/hellbound/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 30, "beaten": 3, "toplay": 7}, "playtime": 2, "achievements_count": 105, "ratings_count": 2, "suggestions_count": 399, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC", "PlayStation 4", "Nintendo Switch"], "developers": ["Acquire"], "genres": ["Action", "Adventure", "RPG"], "publishers": ["XSEED Games", "Marvelous USA"], "esrb_rating": "Mature"}