{"id": 608650, "slug": "world-of-aircraft-glider-simulator", "name": "World of Aircraft: Glider Simulator", "name_original": "World of Aircraft: Glider Simulator", "description": "Experience general aviation as never before! World of Aircraft is a series of stand-alone simulators that each focus on a specific kind of flying. World of Aircraft: Glider Simulator includes a series of (motor-) gliders and tow aircraft based on a high definition flying area.<br/><br/>World of Aircraft uses a dedicated graphics and physics engine to simulate small aviation. Each edition focuses on one specific kind of aviation and will always contain the area, airport(s), and aircraft you need to explore that kind of aviation. Because it does not want to cover all the world and all kinds of aviation you get more detail for the parts that are in the simulation when compared with full-blown simulators. <br/><br/>It’s a pure VFR simulator so it only simulates flights done without complex instruments and you navigate with your compass and your eyes. It’s about the joy of being in the air and mastering your machine.<br/><br/>The first release, World of Aircraft – Glider Simulator, puts you in the cockpit of the aircraft you find on an airfield dedicated to gliders. You will find older and modern gliders, even a motor glider and a glider with an auxiliary engine waiting for you. You will even find a high detailed tow aircraft to get your gliders in the air.<h3>USER INTERFACE</h3><ul><li>Very easy to use interface, avoiding complex choices<br/></li><li>Six languages for user Interface, radio, and audio  (English, Russian, German, French, Spanish, Dutch)<br/></li><li>Three languages manuals (English, German, French, more to come)</li></ul><h3>GAMEPLAY</h3><ul><li>Training for many flight stages for Wilga and Blanik.<br/></li><li>Free flight with all models<br/></li><li>Multiplayer mode with Aero tow (Wilga and Blanik)</li></ul><h3>CONTENT</h3><ul><li>2.500 km2 handcrafted terrain, near Mannheim, the border of the river Rhein<br/></li><li>One high detail (Herrenteich), one low end detail airport, Speyer, close the Technik Museum Speyer<br/></li><li>Five usable aircraft: </li></ul> <ul><li>Diamond HK36 Dimona, a two-seater motor glider <br/> <br/><br/> </li><li>LET L-13 Blaník, a world-renowned glider, often used for training<br/> <br/><br/> </li><li>Schleicher ASK21, two-seater glider with good performance and solid aerobatics capacity<br/> <br/><br/> </li><li>Schleicher ASK21 Mi, motorized self-launching glider with small rotary engine<br/> <br/><br/> </li><li>PLZ-104 Wilga, robust four-seater aircraft, used for many roles, very suitable to aero-tow<br/> <h3>GRAPHICS</h3><ul><li>Animated road traffic, ships<br/></li><li>Ray-marched clouds<br/></li><li>Animated windsocks<br/></li><li>Birds in thermals<br/></li><li>Cloud shadows<br/></li><li>Advanced effects model, including dust</li></ul><h3>FLIGHT MODEL</h3><ul>Per-element based flight model: each surface split into many sections, aerodynamic forces computed for each section individually, then integrated. 360x360 deg flow provides for natural and seamless stalls, spins, tailslide, hammerhead turn and so on<li>Blade element model (BEM) for variable pitch props provides for very precise computation of both linear (thrust) and rotational (asymmetric propwash) components<br/></li><li>Mass-flow based model for internal combustion engine, correct computation of manifold pressure<br/></li><li>Correct coupling of the prop to the engine (torque developed equalized by torque consumed by the prop)<br/></li><li>Full computation of windmilling mode, including backward flow conditions<br/></li><li>Gyroscope effect, p-factor effect computation</li></ul><h3>SOUND MODEL</h3><ul><li>Many sound effects normally not seen in simulators, for example the stick hitting its stops<br/></li><li>Flow sounds depend on angle of attack, not only airspeed<br/></li><li>Far distance prop sounds</li></ul><h3>ATMOSPHERE MODEL</h3><ul><li>Thermals model based on real life flight test data<br/></li><li>Thermals emerge, dissipate with time, get blown away with the wind<br/></li><li>Velocity gradient across the upstream of thermals (so you can feel at which side of your aircraft the lift is highest</li></ul><h3>AREA &amp; AIRPORTS</h3>WoA – Glider Edition is located at Herrenteich airport, a small airfield on the borders of the Rhine river, close to Speyer (and Speyer airport is included). A 50 by 50-kilometer area is modeled in high detail with tens of thousands of trees, houses,s and commercial buildings. A 30-centimeter ground image provides a perfect backdrop for the area.<h3>ADDITIONAL FEATURES</h3>When you are done with the training missions, you can connect to your friends and fly together. Use the Wilga to tow your friends to altitude or see who can perform the most precise landing. You could even try aerobatics as a team. The sky is the limit. This time for real. See you at the field!</li></ul>", "metacritic": null, "released": "2021-05-26", "tba": false, "updated": "2021-05-28T03:32:30", "background_image": "https://media.rawg.io/media/screenshots/708/708e5bd7611a65a889c8be7c4108bdf5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 394, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["World of Aircraft Team"], "genres": ["Simulation", "Casual"], "publishers": ["Aerosoft"], "esrb_rating": null}