{"id": 608666, "slug": "horse-club-adventures", "name": "Horse Club Adventures", "name_original": "Horse Club Adventures", "description": "Horse Club Adventures carries you off to the wonderful world that revolves around the Lakeside Riding Stable. Together with Hannah, Sarah, Lisa, Sofia and their <br/>horses, you experience lots of thrilling adventures!<br/><br/>There is an amazing amount to discover in this open world game. The popular Horse Club game characters and the lovingly designed locations in Lakeside, such as the café, the caravan and the riding stable, are brought to life here. <br/><br/>Horse Club Adventures is an excitement-packed action adventure with numerous missions, popular mini-games, intriguing secrets to be revealed and loads of unlockable objects, as well as collectibles and customisation options.<br/><br/><strong>FEATURES</strong><br/><br/><ul><li>Lively, colourful and detailed world including many familiar and new characters along with the settings from the Horse Club world!<br/></li><li>Over 40 different main missions with a gripping story revolving around Lakeside! <br/></li><li>30 optional sidequests, including a thrilling tale about the mysterious Edith Jacobs that involves her, too!<br/></li><li>Numerous optional mini-games, such as horse grooming and cleaning hooves! <br/></li><li>All sorts of unlockable new outfits and embellishments for the game character. For example, new hairstyles, breeches, blouses, boots, riding helmets in the widest variety of colours.<br/></li><li>Numerous unlockable embellishments for your own horse, such as tail types, manes, saddles, blankets and colours for a maximum degree of customising.<br/></li><li>Fabulous collectibles, such as stickers and photos that are unlocked one after the other.<br/></li><li>90 racecourses with three degrees of difficulty are distributed across the world and invite to galloping to achieve the fastest lap time. <br/></li><li>Marvellous soundtrack with numerous electrifying pieces of music.<br/></li></ul>", "metacritic": null, "released": "2021-05-26", "tba": false, "updated": "2021-05-28T04:24:00", "background_image": "https://media.rawg.io/media/screenshots/69e/69e2059e761f0878055f4ed1aeee628b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "playing": 1}, "playtime": 2, "achievements_count": 54, "ratings_count": 0, "suggestions_count": 201, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "PlayStation 4", "Xbox One"], "developers": ["Wild River Games"], "genres": ["Adventure"], "publishers": ["Wild River Games"], "esrb_rating": null}