{"id": 60861, "slug": "crazy-justice", "name": "Crazy Justice", "name_original": "Crazy Justice", "description": "Be the last one standing in Crazy Justice! Choose a Hero, then select &amp; customize your skills and loot powerful weapons to be the best Champion. Travel across the World to save it from the forces of evil with your friends or be the best in the FREE 100-player PvP mode. The last one standing wins.<br/><br/><br/>Explore a fantasy world in Crazy Justice, the new Battle Royale sensation. Do you like heroes? Choose your favorite one from dozens of Heroes, select your skills then loot some incredible weapons to create your own customized character. Always stay in the safe zone! Will you be the last Hero standing?<br/><br/><br/><br/>Travel through the desert area, find the hidden loots in Temple of Osiris, visit the Great Vulcano in the snow-bound area. The best part: you don’t have to walk around this incredibly huge area, just pick up a vehicle and explore the amazing world of Crazy Justice.<br/><br/><br/><br/>Play the normal Battle Royale, without any abilities or select the Skill Royale mode and choose your Hero before every match, each of them has its own game-changing special skill. Become a poisoner with Kane, use Hegarts strength or hide somewhere on a rooftop and let the hunt begin with Spy. Deploy turrets, walls, stairs, shields, wormholes or use some other skills, it's up to you what your deck contains.<br/><br/><br/><br/>Call your friends: It’s time to squad up. Use the Cross-Play feature of Crazy Justice to invite your friends from PC, Xbox One or Nintendo Switch. Help your team by dropping a bandage, or create a defense system together to reveal incoming enemies. Each Hero has strengths and weaknesses, but by working together the success could be yours.<br/><br/><br/><br/>In Crazy Justice, you can explore a more than 6 km2 area with full of incredible loots, hidden areas, underwater places. But beware! Staying a lot under the water or camping in the winter area cause damage after a while. We aim to create a story based multiplayer which means that the map is going to change during the upcoming updates based on the story elements. <br/><br/><br/><br/>No matter what your playstyle is, you’ll find it in Crazy Justice. With Crazy Justice' deckbuilding system, you can become a defense builder, \"Flash\" or an assassin – all as the same Hero. Choose from dozens of cards to customize your skills next to the Hero's special skill and make each Hero your very own.<br/><br/><br/><br/>Do you like Co-op games? You will be able to play Crazy Justice story mode with your friend and explore the amazing, mainly fantasy-inspired world of it. Imagine yourself as your favorite Hero. Complete dozens of insane missions. Save the World from the forces of evil. Accomplish dozens of new missions as we extend the world of Crazy Justice. <br/><br/><br/><br/><strong>Dear Backers,</strong><br/>    first and foremost, we would like to say <strong>thank you for your lasting trust and support</strong>. This has been an amazing journey so far that would not have been possible without You and the Crazy Justice community. You are helping us to shape the game into the right direction and make the right decisions.<br/>    You helped us understand what`s the best for the Game and its community. This is why we are making the Battle Royale and Skill Royale game modes free-to-play, while other multiplayer modes and the story stay paid.<br/>    To honor the backers who has been supporting us through this time - besides the current rewards - we would like to amplify our respect to You with further incredible in-game contents: <strong>All-time Battle Pass access with all-time +50% XP Boost, two amazing and exclusive backer graffities moreover we triple your in-game coins based on the value of your bundle</strong> (CrazyCoins can be used to buy costumes, emotes, accessories, graffities, new drones, drone skins, vehicle skins etc...). <br/>    Thank you again for your support and patience, stay with us while preparing for the battle. Early Access is coming in the near future with an amazing story-based Battle Royale.<br/><br/><strong>Black Riddles Studios</strong><strong>Are you a Fig Backer? Visit our official website or Fig page for your extended rewards!</strong><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:58:34", "background_image": "https://media.rawg.io/media/screenshots/d25/d25bbdf84a658dfcdc1c5904d58bf0e4.jpg", "website": "https://www.crazyjustice.co", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 264, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Black Riddles Studio"], "genres": ["Action", "Adventure", "Massively Multiplayer", "Indie"], "publishers": ["Fig Publishing", "Black Riddles Studio Publishing"], "esrb_rating": null}