{"id": 608677, "slug": "mahjong-gold-2-pirates-island", "name": "Mahjong Gold 2. Pirates Island", "name_original": "Mahjong Gold 2. Pirates Island", "description": "Captain on the bridge! Cast off the lines!<br/>\r\nWilliam Kidd's treasure awaits you. Collect all the gold bars by solving the infamous pirate's clues.<br/>\r\nSet sail from Port Royal on a ship called the Golden Hind and head for Hard Luck Island. Legend has it that untold treasures are hidden there. The treasure trove's location is encoded in special tiles which you have to remove to reach the gold! To reach the prized hoard, you must complete 6 stages of varying difficulty: you'll encounter themed, grandiose levels with 300 tiles, high levels with 15 layers and levels made entirely of gold! The greed and generosity of pirates knew no bounds. The smuggler's path wasn't easy – point goals and limited moves will present a serious challenge to your abilities.<br/>\r\nThe game is excellently balanced for new and experienced players alike, and is perfectly suited for passing the time while increasing your concentration and attention span.<br/>\r\nWhat are you waiting for? Become the next legend of the Caribbean sea!<br/>\n<br/>\r\n- Grandiose levels with 300 chips, 15 layers and made entirely of gold.<br/>\r\n- A sea voyage for puzzle fans<br/>\r\n- A real treasure in the form of a new set of Mahjong tiles<br/>\r\n- 10 beautiful musical compositions in a 16th century style<br/>\r\n- William Kidd's treasure awaits you", "metacritic": null, "released": "2021-05-27", "tba": false, "updated": "2021-05-28T03:53:05", "background_image": "https://media.rawg.io/media/screenshots/f41/f418b80711a0d0ead07a0760e556f25e.jpg", "website": "https://www.facebook.com/8FloorGames/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 6}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 206, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Creobit"], "genres": ["Casual"], "publishers": ["8Floor"], "esrb_rating": null}