{"id": 60875, "slug": "kings", "name": "Kings", "name_original": "Kings", "description": "Kings is a massively multiplayer medieval survival game. Please note that the current trailer only shows a very brief snapshot of what will be included. We are still currently in development!Servers    <br/>Each server is aimed to have a capacity of 100 players. Most servers will have a ping-limit to minimize lag and increase the player experience.Crafting Stations    <br/>There will be different crafting stations within Kings. These include: smelters, forge, workbenches, anvils and more! Each of these have a specific use within the world, and to become more technologically advanced the player must construct these stations.Building System    <br/>The building system is a block building system. This allows the player maximum flexibility over their bases. They can choose whether to create a small dwelling or a huge fortress. The choice is yours.Siege System    <br/>This siege system allows a fully immersive experience. With weapons such as the trebuchet and ballista you can show your enemies who is more powerful.King System    <br/>This king system allows players to rule over the server. There will be multiple thrones placed throughout the world, and each king will be able to rule over a certain area on the map. Each king can place a tax on that specific area, and players can choose which king to support.Combat System    <br/>The combat system will be a major point in Kings. The player will be able to perform different moves against their opponent, and the player will more skill will win.Clan System    <br/>The clan system will allow players to join with each other. The clan system will have different levels so if someone tries to betray the guild it cannot be done.Hacking Prevention    <br/>This is a major part of any multiplayer game. More information about hacking prevention will be shared prior to Early Access release.", "metacritic": null, "released": "2018-08-03", "tba": false, "updated": "2019-08-28T21:58:32", "background_image": "https://media.rawg.io/media/screenshots/50b/50b4454d22b097962a2fdc6cf59a3f4b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 45, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Rewindapp", "Interactive Gaming Studios", "Garnudo Games"], "genres": ["Action", "Adventure", "Strategy", "Simulation", "Casual", "Massively Multiplayer", "Indie"], "publishers": ["Rewindapp", "Interactive Gaming Studios", "Garnudo Games"], "esrb_rating": null}