{"id": 608747, "slug": "big-city-wheels-courier-sim", "name": "Big City Wheels: Courier Sim", "name_original": "Big City Wheels: Courier Sim", "description": "Become a professional courier in a sprawling fictional metropolis, inspired by the cities of Siberia. Take orders, deliver various items of interest... and find yourself in the middle of an exciting story.<br/>Your character was a typical office worker who hated his (or her) dull job, but one day, as a result of one sudden meeting, the life of our hero has changed dramatically. Now you are a courier providing services for an unusual auto repair shop.<br/>What is so unusual about this auto repair shop, you wonder? Oh, these guys are not as simple as they might seem at first glance. Firstly, they are creative individuals and enthusiastic video bloggers: they treat their work like art and they have their own channel full of interesting videos dedicated to their work. Secondly, this team has a secret life! During the light of the day they are engaged in their usual work routine - but when the night falls down on the city, they reveal their hidden identity of fighters against evil and injustice. Well, basically against such kind of injustice that threatens cars and car owners.<br/>And it turns out that the threat is quite real: a powerful corporation puts its tentacles into the city. These greedy business sharks are pressuring the mayor's office, as they want to ban the use of private cars, route taxi minivans and trucks in the city. These unscrupulous tycoons desire to replace route taxi with soulless unmanned public transport and cargo trucks - with autonomous drones. Also these corpo-rats intend to force car owners to use bicycles under the far-fetched pretext of \"promoting healthy lifestyle and care for the environment.\"<br/>But who would believe in the good intentions of these corporate bigwigs? Definitely not our hero! Together with your fellow car enthusiasts, you go on the warpath. More precisely, on the highway of war! You, as a courier, are entrusted with the responsible task of restoring connections. Unite those who really care about cars, establish a network of the indifferent forces, restore the Brotherhood of Crossed Wrenches and save the city.<br/><br/>Features of the game:<br/>- A large city, inspired by various Siberian cities. If you are from Russia, and especially from Siberia, you will surely find something familiar there;<br/>- A dozen cars with customizable characteristics;<br/>- Exciting storyline, as well as an unlimited number of side missions.", "metacritic": null, "released": "2021-04-28", "tba": false, "updated": "2021-05-28T04:44:10", "background_image": "https://media.rawg.io/media/screenshots/c15/c150b298f62a1617274da11b59be9e1e_gVUGFM5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 181, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Alexandr Lukyanov"], "genres": ["Simulation", "Racing"], "publishers": ["Alexandr Lukyanov"], "esrb_rating": "Everyone 10+"}