{"id": 608744, "slug": "racing-xperience-real-race", "name": "Racing Xperience: Real Race", "name_original": "Racing Xperience: Real Race", "description": "Racing Xperience brings you a unique perspective in terms of gaming as it features real driving physics and stunning detailed cars. You have the possibility to drive supercars and hypercars, hill climb drifting, race against opponents, cruise on a large map and even overtake traffic on highway asphalt at high speed. Build the ride that shows your style with a large range of cars and customizations. Racing Xperience is free to play!<br/><br/><br/>REAL CARS CUSTOMIZATION<br/>Take the wheel of over 80 meticulously detailed vehicles: sport cars, supercars, hypercars. Customize your dream cars with a wide range of rims, neon lights, suspension adjustments, performance upgrades, car paints and wraps, rim paints, carbon spoilers and window tint just as you would in real life. <br/><br/>Immerse yourself in one of the most hyper-realistic free car racing games of 2021 and get to experience stunning visual effects, detailed interior view, real weather effects, realistic mechanical damage, real drift, adjustable driving assists, realistic engine sounds, tire and asphalt grip depending on weather conditions, console experience with wireless Controller, as well as a touch camera. <br/><br/>Unlock new powerful car upgrades to bring your street racer to the next level! Download now for free to enjoy a real driving game and race your favorite supercar!<br/><br/><br/>DOMINATE THE RACE <br/>Compete against opponents and prove your skills on the asphalt in different race types: circuit, sprint, drift, free roam, lap knockout, survival, time trail, speed trap. <br/><br/>Get to experience 30 stunning race environments with dynamic weather and effects based on season. With realistic car physics, Racing Xperience brings you various sceneries: race tracks, street racing, touge, hill climb, free roam, cities, drift tracks, highway with traffic, frozen lake.<br/><br/><br/>GAME MODES<br/>Start your journey and get the most of this real car racing &amp; drifting game through his modes. The Career mode allows you to take part in a long and challenging racing career, buy and sell cars, unlock new tracks, rival race where you can win rivals car, speed challenge races and even more.<br/><br/>The Quick Race mode permits you to take a quick race in order to learn the tracks. You can adjust the opponent’s difficulty, the time, weather or season to your preferences. <br/><br/>The Practice mode gives you the chance to grow your driving skills, enjoy testing tracks, cruise with traffic, drift on a frozen lake or hill climb, test your car's top speed on the highway through traffic, doing donuts on the asphalt.<br/><br/>Last but not least, the Challenges test your driving and drifting skills in order to earn rewards to unlock new cars.<br/><br/><br/>CONTROLS<br/>Racing Xperience offers you console driving experience thanks to wireless Controller/Gamepad compatibility, Touch Buttons, Touch Steering Wheel, Touch Joysticks, Tilt and possibility to customize controls so you can adjust sensitivity to your own preferences, flip or save controls settings up to 3 presets.<br/><br/>Photo Mode allows you to take breathtaking shots of the cars and surroundings so you can share them with your friends!<br/><br/>This new game is free to play! If you like racing games, drifting games, driving simulation games, this game is for you. Download NOW for free!<br/><br/><br/>Follow Racing Xperience on social media :<br/>  Discord: https://discord.gg/gHjEn7nVCQ<br/>  Facebook : https://www.facebook.com/bmzgames<br/>  Instagram : https://www.instagram.com/bmzgames<br/>  Twitter : https://twitter.com/BMZ_Games", "metacritic": null, "released": "2020-09-06", "tba": false, "updated": "2021-05-28T04:42:34", "background_image": "https://media.rawg.io/media/screenshots/e31/e31d9e83c78478ad0e25994e6b82e64e_YjYdLt3.jpg", "website": "https://www.facebook.com/bmzgames", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 335, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Beniamin Mazilu"], "genres": ["Simulation", "Racing"], "publishers": ["Beniamin Mazilu"], "esrb_rating": "Everyone 10+"}