{"id": 608701, "slug": "torn-away", "name": "Torn Away", "name_original": "Torn Away", "description": "<p>Torn Away is an interactive story with a unique blend of adventure games, stealth side-scrollers, and cinematic first-person sequences.<br />\nAs the fires of World War II rage across Europe, yet another life is ruined when Asya, an ordinary 10-year-old, is torn away from her home. Just like millions of others, she becomes an Ostarbeiter, a common worker in a forced labor camp.  Now through the darkest of times, Asya has to find a glimmer of hope and endure if she ever wants to be free. When an opportunity arises, she runs away, fleeing eastward across Germany and Poland. To her home.<br />\nPersevere through the harsh elements of nature, hide and evade soldiers, and look for shelter and food in order to survive. In a war-torn world where violence and terror reign, you have to stay strong. You have to survive without losing what makes us human.<br />\nFeatures:<br />\nA game about war with a non-violent protagonist<br />\nA blend of story-driven adventure gameplay, a side-scroller, and cinematic first-person sequences<br />\nA unique view on the tragedy of war from a child&#39;s perspective<br />\nBased on children&#39;s war diaries<br />\nA beautiful art style inspired by social realists and French animation</p>", "metacritic": null, "released": "2023-09-29", "tba": false, "updated": "2024-03-13T20:07:49", "background_image": "https://media.rawg.io/media/games/5f7/5f7164cb1814638d60857125ae063089.jpg", "website": "https://www.perelesoq.com/", "rating": 3.33, "rating_top": 4, "added_by_status": {"yet": 6, "owned": 4, "beaten": 13, "toplay": 24, "dropped": 1, "playing": 1}, "playtime": 3, "achievements_count": 0, "ratings_count": 14, "suggestions_count": 176, "game_series_count": 0, "reviews_count": 15, "platforms": ["PC"], "developers": ["Perelesoq"], "genres": ["Adventure", "Indie"], "publishers": ["Nordcurrent", "Hawthorn Games", "perelesoq"], "esrb_rating": null}