{"id": 60883, "slug": "mowin-throwin", "name": "Mowin' & Throwin'", "name_original": "Mowin' & Throwin'", "description": "Requires 2 Xbox Compatible Controllers to Play!<br/>Mowin' &amp; Throwin' is an insane 1 vs 1, 2 vs 2 local multiplayer game featuring lawn-obsessed gnomes who drive riding mowers! Each match is a constant tug-of-war as you work with your teammate to mow your lawn and sabotage the other team's lawn. The team who has the least amount of grass on their lawn when time ends, wins! Matches tend to be very close, so don't be surprised if you and your friends get excited and start yelling at the screen! If you are a fan of local multiplayer favorites like Overcooked, Lovers in Dangerous Spacetime, Gang Beasts, or Crawl  you'll have fun with Mowin' &amp; Throwin!Key Features: Mowing<br/>Ever wonder what it's like to drive a riding mower that's souped up with nitrous and a tank cannon!? Experience the thrill of mowing at breakneck speeds to gather grass bag ammo to shoot at your rival team's yard!Sabotage<br/>During the match, a variety of items drop from the sky that you use to stun your opponents, regrow their lawn, and more!Local Multiplayer <br/>Keeping the couch fun! Great for parties, families, breaking the ice, or when you need a break from the online world.Quick/Exciting Matches + Replayability  <br/>A single match only takes a few minutes, but Mowin' &amp; Throwin' can keep you and your friends occupied for hours.Lawn Specific Challenges <br/>Each level has a unique mechanic that offers you an interesting choice of how to best mow &amp; throw. Some examples include shifting terrain, elevators, destructible environments, darkness, and more!Easy to Learn/Challenging to Master <br/>It typically only takes about 10 minutes to grasp the basic game play and strategy of Mowin' &amp; Throwin'.  To become a gnome master, you must learn how to turn each lawn's unique challenge to your advantage!", "metacritic": null, "released": "2018-07-26", "tba": false, "updated": "2019-11-29T01:50:38", "background_image": "https://media.rawg.io/media/screenshots/c72/c72064a4004871a180663b07d4bcbed2.jpg", "website": "http://mowinandthrowingame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 0, "achievements_count": 27, "ratings_count": 0, "suggestions_count": 405, "game_series_count": 0, "reviews_count": 0, "platforms": ["Xbox One", "Nintendo Switch", "PC"], "developers": ["House Pixel Games"], "genres": ["Action", "Casual", "Indie"], "publishers": ["House Pixel Games"], "esrb_rating": "Everyone"}