{"id": 608808, "slug": "bixie", "name": "Bìxié", "name_original": "Bìxié", "description": "<p><strong>Bìxié is a two player, couch co-op, puzzle beat-em-up that follows the Dragon Princess Mei Lien and her Lion-Dancing bodyguard Qinyang on an adventure to save their kingdom.</strong></p>\n<p><strong>Bixie focuses on themes of culture, cooperation, community, individualism and responsibility. Inspired by Chinese tradition, the game observes the two characters traveling across the kingdom, relighting lanterns and firecrackers to protect civilians from enemy monsters.</strong>\n</p>\n<p><strong>Bìxié’s primary gameplay mode is a side-scrolling beat-em-up, combining puzzle-solving with button-mashing combat. Between levels, the game features visual novel story segments.</strong>\n</p>\n<p><strong>The art style consists of animated pixel art for the main gameplay, as well as static hand-drawn images for the visual novel sections. The game has traditional Chinese aesthetics along with some fantasy aspects.</strong>\n</p>\n<p>Bixie is a 2-Player game to be played by you and a friend.\r\n</p>\n<p>To simulate the couch co-op experience, we recommend playing the game with a friend to experience the story of Bixie.\r\n</p>\n<p><strong>To play the game, you need a controller and a keyboard. You can play locally or enter in a Online Lobby with a friend.  You need to enter into the same lobby as the other player when selecting Online Co-op.</strong>\n</p>", "metacritic": null, "released": "2021-05-28", "tba": false, "updated": "2021-05-28T05:12:33", "background_image": "https://media.rawg.io/media/screenshots/698/6983fad2961924217d5e644e0049f26f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 68, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["bixie"], "genres": [], "publishers": [], "esrb_rating": null}