{"id": 608945, "slug": "hill-climber-muscle-heroes", "name": "Hill Climber Muscle Heroes", "name_original": "Hill Climber Muscle Heroes", "description": "<p>Juega con tu héroes favoritos y escala a la cima.</p>\n<p>Hill Climber Muscle Heroes es un juego casual de escalar, debes llegar lo más alto posible en sus dos modos de juego. Juega partidas rápidas y demuestra tu habilidad escalando montañas y consiguiendo monedas para desbloquear a todos los personajes.</p>\n<p>Control muy sencillo de un solo toque, manten pulsado para calcular, y suelta para clavar el pico en la montañan en el punto exacto para poder escalar. </p>\n<p>Gráficos espectaculares y desenfadados creados por Isem y una banda sonora relajante para este reto. </p>\n<p>Hay dos modos de juego, el normal donde conseguirás monedas para ir desbloqueando a los personajes del juego, y el modo infinito donde te reta a superar tu propio record, cuanta altura eres capaz de escalar?</p>\n<p>Hill Climber Muscle Heroes:</p>\n<p>- Bonitos gráficos de alta calidad</p>\n<p>- Jugabilidad sencilla a un solo toque</p>\n<p>- Para todas las edades</p>\n<p>- 8 heroes para desbloquear</p>\n<p>- B.S.O. Relajante</p>\n<p>- Partidas rápidas y divertidas</p>\n<p>- 2 modos de juego</p>\n<p>Juega a Hill Climber Muscle Heroes y desbloquea a todos tu héroes.</p>\n\n<p>--------------------------------------------------------------------------------------------</p>\n\n<p>Play with your favorite heroes and climb to the top.</p>\n<p>Hill Climber Muscle Heroes is a casual climbing game, you must get as high as possible in its two game modes. Play quick games and show your skills by climbing mountains and getting coins to unlock all the characters.</p>\n<p>Very simple one-touch control, hold down to calculate, and release to drive the peak into the mountain at the exact point for climbing.</p>\n<p>Spectacular and carefree graphics created by Isem and a relaxing soundtrack for this challenge.</p>\n<p>There are two game modes, the normal one where you will get coins to unlock the characters of the game, and the infinite mode where it challenges you to beat your own record, how much height are you able to climb?</p>\n<p>Hill Climber Muscle Heroes:</p>\n<p>- Beautiful high-quality graphics</p>\n<p>- Simple one-touch gameplay</p>\n<p>- For all ages</p>\n<p>- 8 heroes to unlock</p>\n<p>- B.S.O. Relaxing</p>\n<p>- Fast and fun games</p>\n<p>- 2 game modes</p>\n<p>Play Hill Climber Muscle Heroes and unlock all your heroes.</p>", "metacritic": null, "released": "2021-05-27", "tba": false, "updated": "2021-05-28T05:47:04", "background_image": "https://media.rawg.io/media/screenshots/718/71801693ac792acbcbdec5cd91845b03.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 83, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Ixel Games"], "genres": [], "publishers": [], "esrb_rating": null}