{"id": 6091, "slug": "premiumrpg-asdivine-dios", "name": "[Premium]RPG Asdivine Dios", "name_original": "[Premium]RPG Asdivine Dios", "description": "SPECIAL PRICE<br/>38% OFF(USD 7.99 -&amp;gt; USD 4.99)!!!<br/><br/>Welcome to the new Asdivine and get ready as a tale about divine encounters with mankind and mankind&amp;#39;s encounters with the divine is about to unfold...<br/><br/>Purchase the Premium Edition of Asdivine Dios and receive 1000 in-app points as a bonus! A &amp;quot;Freemium&amp;quot; Edition that can be played to the end as well is also available for download!<br/><br/><br/>** An Adventure of Divine Proportions!\t\t\t\t\t<br/>Among the many worlds the deities have created, there is one world that abounds with life known as Asdivine. But when a spate of disturbances erupts across the globe and an ever spreading murk threatens to destroy it, Izayoi, the deity of Asdivine himself, takes up his cause to save the world he created with his own hands. Unfortunately, suffering from a loss of his own divine powers, is there any hope he can he succeed? Find out as the curtain raises on this adventure of divine proportions!<br/><br/><br/>** A New Benchmark in Quality<br/>Following in the footsteps of the critically acclaimed Asdivine Hearts, Asdivine Dios further enhances its palette of visual expressions. While still maintaining the beauty of the original 2D artwork, some of the most fluid character motion and bold effects ever seen in a handheld RPG have been realized with amazing results!<br/><br/><br/>** Biggger and Better than Ever Before!<br/>Boasting a voluminous story, an expansive world, treasure filled dungeons, exciting battles, weapon creation, and more… the all-inclusive RPG experience is finally here! Not only does quality, but content also goes hand in hand as players are now able to customize weapons and even combine magic and skills to rack up damage to new heights!<br/>Plus, with more options than ever before, battling it out with hordes of foes has never been so fulfilling! But wait, that&amp;#39;s not all! In Asdivine Dios, limitless enemies and loot, a multitude of subquests, and even bosses that will blow your mind await!<br/><br/><br/>*Asdivine Dios can also be enjoyed in its entirety without the need for additional purchases. While in-app-purchase content requires additional fees, it is not necessary for finishing the game.<br/>*The actual price might differ depending on the region.", "metacritic": null, "released": "2015-09-03", "tba": false, "updated": "2019-08-02T03:28:57", "background_image": "https://media.rawg.io/media/screenshots/5bd/5bd3e5c68ecb40e5baf6cb73efd97fef.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 276, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["KEMCO", "Kotobuki Solution Co"], "genres": ["Adventure", "RPG"], "publishers": ["Kotobuki Solution Co"], "esrb_rating": "Everyone 10+"}