{"id": 609231, "slug": "happy-graphs", "name": "Happy Graphs", "name_original": "Happy Graphs", "description": "<p><strong>Happy Graphs</strong></p>\n<p>Implemented by Mint Gould, WispyMouse @wispymouse</p>\n<p>Designed and commissioned by Caidence @caidence<br/></p>\n<p>Based on Caidence's Happy Graphs card game</p>\n<p><strong>How to Play<br/></strong></p>\n<p>The goal of Happy Graphs is to make as many of your cards happy as you can. Cards are happy when they have a number of neighbors equal to their value. You can see a card's value by the number of pips on them, or by holding LEFTSHIFT to see the number value of each card.<br/></p>\n<p>You'll start with a card already in play, and a number of cards in hand, and play one card per turn to the field. You can only play a card next to an existing one. You can't play cards next to cards that are already happy, and you can't play cards to a spot if it would have too many neighbors there already. If no plays are possible, a new board is created with a new starting card.<br/></p>\n<p>Repeat placing cards down until you've gone through the deck, and try to make as many cards as happy as you can! Read Caidence's Happy Graphs for more rules.<br/></p>\n<p><strong>Visual Aides<br/></strong></p>\n\n<p>A red x shows that you can't place a card there. This 1 card only wants a single neighbor, and placing it in that spot would give it two neighbors, so we can't put the card there.<br/></p>\n\n<p>A yellow squiggly indicates that if you placed a card there, it can't possibly become happy due to not enough neighbor spaces being open. If you put this 4 card in this yellow spot, it wouldn't be able to have four neighbors because you can't place a card above it.<br/></p>\n\n<p>Dragging a card over a spot and hovering will also preview what'll happen. Cards that will become happy if you place a card in that spot will have all their pips light up, and glow green. Cards that will become impossible to make happy will dim their color. If you put this new card in this spot, the 4 above can't possibly become happy because it can't place a neighbor below it.</p>\n<p><strong>Rules Menu<br/></strong></p>\n<p>Some of the rules for Happy Graphs are customizable in the Rules menu. From here, you can set a few variables for your gameplay. The most essential version of Happy Graphs is with Basic 4s, but you can also play on a 6-way grid or an 8-way grid.</p>\n<p>When you've selected the rules you want to play with, click Restart in the top right to begin a game with those rules.<br/></p>\n\n\n<p><strong>Development Notes<br/></strong></p>\n<p>This was a project Mint and Caidence collaborated on for about a month, in October 2019. We're planning on updating it for general engineering improvements and to test Unity features.</p>\n<p>The code for this can be found at this public git repository.<br/></p>", "metacritic": null, "released": "2021-05-26", "tba": false, "updated": "2021-05-28T06:59:25", "background_image": "https://media.rawg.io/media/screenshots/183/183c5dcb48d0c188968a151ea237ab2c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 20, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["WispyMouse"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}