{"id": 609379, "slug": "wormwood-bulldoggames", "name": "Wormwood (BulldogGames)", "name_original": "Wormwood (BulldogGames)", "description": "1st Place : 2019 Technology Student Association Video Game Design National Competition\r\n\r\nWormwood.zip includes two folders:\r\n<ul><li>VR version for use with the Oculus Rift or Rift S </li><li>non-VR version</li></ul>\n<p>Wormwood is a simulation / survival game with horror elements that takes place in the fictitious small southern town of Wormwood abandoned for nearly 30 years after a catastrophic nuclear power plant accident. Gameplay focuses on strategic movement through a dangerous town filled with radioactive items and unknown anomalies. To avoid these obstacles, the player has been supplied with a remote controlled robot (player controlled or autonomous mode) to clean up the sources of radiation throughout the town. The robot was modeled by our team look like a VEX robot used in the TSA competitions.</p>\n<p>The player’s first mission is to locate 10 radioactive sources in the town using a Geiger Counter. In order to avoid the radiation, the player must use the robot, controlling both its movement and its articulated arm to pick up the radiation source. The player then must drive the robot to the Radiation Disposal Unit, while holding the radiation source in the claw, and safely dispose of the radiation source by dropping it into the RDU.  </p>\n<br/>\n<p>During the course of the game, the player must alternate between the human (wearing a hazmat suit) and the robot. Both human and robot must be used to successfully complete the missions. In some cases it is more beneficial to play as the human, while in other cases playing as the robot is required. For instance, the player must use the robot, which is immune to the radiation, in order to safely navigate high radiation hot spots and other anomalies such as the Blue Flame circling the area around the restaurant. Playing as the human, the player must use the Geiger counter to locate the exact position of the radiation source, while avoiding too much radiation. The dosimeter will indicate the total dose of radiation in millisieverts. The reading on the dosimeter is cumulative, adding up over time. If the player receives a total dose of over 50 millisieverts, the mission fails and the game restarts. The robot will run out of battery power over time, and must be recharged by approaching close to the robot with the human.</p>\n<p>One purpose of Wormwood is to show the dangers of technology, in the form of a nuclear power plant meltdown and its catastrophic effects on the surrounding environment. Radiation lingers years later and must be cleaned up by the player. On the other hand, Wormwood also shows how technology can be used to benefit society. The player must manipulate the robot in areas dangerous to humans, such as in locations of high radiation. The idea that technology can be used as a tool for good is an essential part of the game, since both robotic and human interactions are required to successfully complete the missions.  \r\n</p>\n<p>created in the Unity Game Engine for Windows PC<br/></p>", "metacritic": null, "released": "2021-05-26", "tba": false, "updated": "2021-05-28T07:48:07", "background_image": "https://media.rawg.io/media/screenshots/fed/fed9798900c3b27cd90b638582703ff6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 273, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BulldogGames"], "genres": ["Adventure", "Simulation"], "publishers": [], "esrb_rating": null}