{"id": 60948, "slug": "firmament-wars", "name": "Firmament Wars", "name_original": "Firmament Wars", "description": "Firmament Wars is a multiplayer real-time strategy game where you clash for military domination of your foes in this fast-paced warfare simulator. <br/><br/>Duke it out in tile-based combat in multiple modes of play including Free-For-All, Team, and Head-to-Head Ranked play. Select from seven different governments, each of which offers different styles of gameplay! The game begins with players in their capital. Send forth troops to conquer territory with the ultimate goal of eliminating your opponents! Use a variety of tactics and technology to get an edge on your opponents—research technologies, build walls, fire cannons, launch missiles, and more! <br/><br/>Up to eight players can play simultaneously in a highly flexible game creation system that even allows computer opponents to join your team! Serious competitors can test their mettle in ranked head-to-head combat and climb the leaderboard!<br/><br/><ul><li>Seven different governments with varying perks.<br/></li><li>Select from over 140 current, historic, and fictional flags!<br/></li><li>Fast-paced gameplay keeps average games about 15 minutes in length.<br/></li><li>Complete stat tracking and leaderboards let the whole world know who is the best.<br/></li><li>Game creation and chat system make it easy to setup and configure new games.<br/></li><li>A simple technology tree allow you to unlock offensive and defensive technologies that give you the edge in combat.<br/></li><li>Gather resources, food, science, and culture, from every tile that you occupy! Gathering resources is crucial to receiving troops, building walls, launching missiles, and even triggering a cultural revolution in your enemy's territory!</li></ul><br/>Go forth and conquer!<br/><br/>Translation Contributors:<br/>Simplified Chinese: [HAN]BROKEN GUARD", "metacritic": null, "released": "2018-06-23", "tba": false, "updated": "2019-08-28T21:58:27", "background_image": "https://media.rawg.io/media/screenshots/44d/44d4c081ebe64769a54a282bb0edecc0.jpg", "website": "https://nevergrind.com/blog/about-firmament-wars/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 355, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Neverworks Games"], "genres": ["Strategy", "Indie"], "publishers": ["Neverworks Games"], "esrb_rating": null}