{"id": 60944, "slug": "hum-drum-experiences", "name": "Hum Drum Experiences", "name_original": "Hum Drum Experiences", "description": "Experience above and beyond the most unconventional visual-novel based RPG, built with a unique 3D environment just for you!<br/><br/>\"But Thou Must!\" <br/><br/>Take on the role of a person hovering between life and death. Journey through a vibrant world while collecting masks, which help you along in your adventure. Moral ambiguity, questionable ethics and fully-fleshed out characters await in this new RPG adventure.<br/><br/>\"No really... Thou Must!\" <br/><br/><strong>Features:</strong><br/><ul><li> Meet Handsome, the body pillow which finds you insanely attractive. Yes, this is the first feature we developed. No, we don’t regret listing it as such!<br/></li><li> Journey through a wide variety of interesting new worlds as you discover secrets!<br/></li><li> Become a master of the unique combat system, designed to keep you on your toes and anxious!<br/></li><li> Influence battle by unlocking new abilities or by purchasing items (-Internal Screaming-)<br/></li><li> Satisfy your need to collect by finding various masks, which are also used to unlock new powers in and out of combat.<br/></li><li> Seek out, confront and challenge several hidden bosses.<br/></li><li> Over 700+ lines of unique dialogue. The denizens of this world are living and breathing the story along with you as you progress through every single square inch of the game.<br/></li><li> Level up your stats at your own pace. No leveling requirements means you create your own difficulty as you play. In fact, leveling is completely optional!<br/></li><li> Enjoy interacting with a wide range of quirky and unusual characters displaying humor, personality, life crises and their own jobs to do.<br/></li><li> Immerse yourself into a story filled with moral choices, questionable ethics and plenty of humor, drama and everything in between.</li></ul>", "metacritic": null, "released": "2018-09-28", "tba": false, "updated": "2019-08-28T21:58:28", "background_image": "https://media.rawg.io/media/screenshots/97b/97bb5c6ad5ee6bfa668a981a2b1c66a7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 383, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SceneSoft"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["SceneSoft"], "esrb_rating": null}