{"id": 60951, "slug": "jagged-alliance-rage", "name": "Jagged Alliance: Rage!", "name_original": "Jagged Alliance: Rage!", "description": "<p>Jagged Alliance is back – With a new take on turn-based tactics, adventure elements and the well-known quirky mercenaries!<br />\nSet 20 years after the first Jagged Alliance, this spin-off lets you experience a road trip into a jungle hell to test your mind and body to the limits!<br />\nThis time it’s just you and a few allies versus an entire island ruled by a drug overlord and his crazed army.<br />\nConstantly on the brink of breakdown, faced with dehydration and no support from home, you lead a team of seasoned mercenaries against vastly outnumbering armed forces.<br />\nUse tactical brilliance and guerilla tactics to destroy their structures and strengthen the island’s population to take back what is rightfully theirs.<br />\nDo you have what it takes to rise to old glory?<br />\nFeatures:<br />\n2 Player online co-op mode<br />\nDeep turn-based tactical gameplay mixed with adventure elements<br />\nChoose a variety of tactics ranging from stealth to brute force<br />\nStrong character personalities with own skills, desires and personal conflicts<br />\nRage skills: Unique character abilities that get more powerful over the course of the battle<br />\nPowerful Commanders coordinate enemy troops on the battlefields<br />\nFace terrifying experimental drugs and use them to manipulate your enemies</p>", "metacritic": null, "released": "2018-12-05", "tba": false, "updated": "2023-12-05T14:10:18", "background_image": "https://media.rawg.io/media/games/c51/c517f52611e107d90ba75ca508387484.jpg", "website": "https://jaggedalliance.com/", "rating": 2.0, "rating_top": 1, "added_by_status": {"yet": 6, "owned": 106, "beaten": 3, "toplay": 8, "dropped": 4}, "playtime": 1, "achievements_count": 55, "ratings_count": 11, "suggestions_count": 546, "game_series_count": 14, "reviews_count": 11, "platforms": ["PC", "PlayStation 4", "Xbox One"], "developers": ["THQ Nordic", "Cliffhanger Productions", "Cliffhanger Games"], "genres": ["Adventure", "RPG", "Strategy", "Simulation"], "publishers": ["HandyGames"], "esrb_rating": null}