{"id": 60967, "slug": "pas", "name": "P.A.S.", "name_original": "P.A.S.", "description": "Imagine yourself being sentenced to death, and the only way to escape is to participate in a television show, the rules of which are very simple: only one team should remain alive.<br/>\n<br/>\r\nA total number of players in the show is 64. In total 2 locations 2x2 km are prepared for battles. The radiation zone will force players to look constantly for new shelters and sooner or later come face to face.<br/>\r\nTraditionally, players can find weapons, armor, ammunition, grenades and first-aid kits at the location of players.<br/>\n<br/>\r\nBut what did the organizers of the show come up with to make the show more spectacular and interesting?<br/>\n<br/>\r\nThe main features of PAS:<br/>\r\n1 each armor has its own unique set of characteristics and helps to choose the right tactics of behavior in combat.<br/>\r\n2 collecting credits concentrated on the location the player can use additional features in the game:<br/>\r\nturning into an object for camouflage on the location<br/>\r\nactivation of fighting chicken (Chicken Rush)<br/>\r\n3 Even after the death the player continues to help teammates using the collected credits:<br/>\r\nto cure the team-mate<br/>\r\nactivate fighting chicken (Chicken Rush)<br/>\r\nthrow a grenade<br/>\r\nto replenish ammunition for weapons<br/>\r\nreplenish the player's grenade<br/>\r\nspeed up the player's movement by 20 percent<br/>\r\nIncrease the maximum player's HP by 20<br/>\r\nput a sniper rifle in your inventory<br/>\r\nincrease the chance of critical damage to 50 percent<br/>\n<br/>\r\nWell, of course, zombies will prevent you from getting close to places with top loot.<br/>\n<br/>\r\nThere will be no time to be bored!", "metacritic": null, "released": "2018-08-08", "tba": false, "updated": "2019-08-23T12:11:52", "background_image": "https://media.rawg.io/media/screenshots/763/7632639b45da021a1bb60102195738eb.jpg", "website": "https://postapocalypticshow.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 325, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Eforb"], "genres": ["Action", "Massively Multiplayer", "Indie"], "publishers": ["Eforb"], "esrb_rating": null}