{"id": 609631, "slug": "yeti-horror-game-final-major-project", "name": "Yeti Horror Game - Final Major Project", "name_original": "Yeti Horror Game - Final Major Project", "description": "<p>Idea: <br/></p>\n<p>This was the final game that I had developed for my first year of college. Here we were given a country to base the game on but other than that we were allowed to make anything we wanted. I was randomly assigned Nepal which I then researched heavily to learn about the culture, special information and to gain inspiration for what I could create. In the end, I ended up choosing to do a 3D horror game based on the Yeti rumours of the Himalayan mountains but due to covid, I lost access to good hardware and had to downscale the project heavily with the main change being going from 3D to 2D. Ultimately, the project was never finished due to us being marked for our old work but I managed to make some progress on it regardless.<br/></p>\n\n<p>Positives: <br/></p>\n<p>Considering the fact that I had to work from home on a weak laptop, I feel like I managed to make a great effort with what I had available. I was also able to very quickly adapt to my new situation and prepare myself for the new development approach that I had to follow. My programming skills expanded further that prior projects as I started learning more complex mechanics and learning to take apart scripts and modify them to my needs. The amount of work that I had done and got working was quite good and it really helped expand my skillset.<br/></p>\n\n<p>Negatives: <br/></p>\n<p>The first negative that comes to mind instantly is that I never got to finish this project (which is the only time this has happened). Coupled with the major changes to the project itself, it was quite sad as I was strongly motivated to get this project completed and playable. I also wish I spent more time working on programming rather than putting as much of a focus into design and art as I knew back then that those weren't going to be my specialties and I should have instead put more effort into building skills for the future.<br/></p>\n\n<p>Evaluation: <br/></p>\n<p>In the end, I feel like this was a good wrap up to my first year of Level 3 Games Development at college. I had learnt both 2D and 3D beforehand and this was very helpful when it came down to getting this project up and running. I'm also quite proud of the ideas I was able to come up with having just been given a country and left to figure it out. It would have been great if I had a developed game but the outcome that I got ended up being quite an accomplishment anyways.<br/></p>\n\n<p>Stats:    </p>\n<p>Lines of code: approximately 1986<br/></p>\n<p>How enjoyable was development of this project: 9/10      </p>\n<p>How much I learnt throughout this project: 8/10      </p>\n<p>Difficulty of this project: 4/10    \r\n</p>", "metacritic": null, "released": "2021-05-25", "tba": false, "updated": "2021-05-28T08:59:10", "background_image": "https://media.rawg.io/media/screenshots/b5a/b5ad9cbd53ca24b62ddda0e10db2d610.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 11, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["0xDaniooo"], "genres": [], "publishers": [], "esrb_rating": null}