{"id": 60978, "slug": "speedway-challenge-career", "name": "Speedway Challenge Career", "name_original": "Speedway Challenge Career", "description": "<strong>Speedway Challenge Career</strong> is a 2D speedway game.<br/>Were you ever thinking about speedway career? Now you can start one in Speedway Challenge Career!<br/>Setup yourself at the gate, twist the throttle and blast out from the gate. Pass the license exam, compete for a place in the team, earn money, upgrade your equipment and get to the top.<br/><br/>Become a real speedway rider thanks to new, more realistic riding model. Lead your career from the very beginning, take the challenges and relax during matches between your favourite teams. For each ride you will get SCP points, which will let you unlock new tracks.<br/><br/>4 game modes to choose:<br/>- career mode (after extra purchase in the game),<br/>- challenge mode,<br/>- quick game mode - friendly match between 2 teams,<br/>- local tournament mode - play up to 4 players on one PC (controll by keyboard, mouse or pad)<br/><br/>Career mode's key features:<br/>- creating your own rider,<br/>- license exam - pass it to sign your first contract,<br/>- equipment - complete yours and upgrade it,<br/>- bike parts - invest in your bike to gain advantage over rivals,<br/>- rider's budget - grow your income step by step, but never spend all of your funds if you don't want to finish your career too quickly,<br/>- riding in a few leagues - choose the best offers and start in many leagues at one time (senior leagues available - Polish, Swedish, British, Danish, German, Czech and junior leagues - Polish, Swedish, British),<br/>- individual championships - become a junior or senior country champion,<br/>- individual world championships - become a speedway world champion,<br/>- injuries - different types of injuries with different recovery time,<br/>- complex statistics - monitor your results in comparison to others,<br/>- variable all riders skills, during the season,<br/><br/>Game's key features:<br/>- realistic riding model, including contact between riders,<br/>- extended starting procedure,<br/>- configurable camera view (zoom in, zoom out),<br/>- real time referee decisions,<br/>- 3 difficulty levels,<br/>- real leagues rules,<br/>- changing weather conditions,<br/>- 82 teams (league and national),<br/>- almost 1000 riders with diversified skills,<br/>- 24 tracks with different lines,", "metacritic": null, "released": "2018-03-02", "tba": false, "updated": "2019-10-22T14:37:27", "background_image": "https://media.rawg.io/media/screenshots/c2a/c2a076f6db206ba879421adef46c4395.jpg", "website": "http://speedwaychallenge.pl/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 195, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "iOS"], "developers": ["Artur Berkowski Berobasket", "Artur Berkowski"], "genres": ["Sports", "Racing"], "publishers": ["Artur Berkowski Berobasket", "Artur Berkowski"], "esrb_rating": "Everyone 10+"}