{"id": 609900, "slug": "exospace", "name": "ExoSpace", "name_original": "ExoSpace", "description": "<p><em>The year is 2486. Situated on the far side of the galaxy, approximately 30,000 light years from Earth, is the Ferus Quadrant. This region of the Milky Way is filled to the brim with space-faring humans, the Exoborns, cast away from their ancestral home.</em></p>\n<p><em>However, a shadow is looming in the depths of space, the Maz'jok Empire. A ruthless galactic nation with no concept of mercy and no reverence for life, they will  consume the galaxy in an age of darkness and desolation. But for now, they have yet to show themselves.\r\n</em></p>\n<p><em>A few, having marked their approach, have made plans to defeat them. From the ranks of the space-faring humans, a bounty hunter has been chosen. Orphaned at a young age and brought up among criminals and wanderers, this skilled assassin is about to be pulled into a larger universe than he could have ever predicted.\r\n</em></p>\n<p><em>Follow the exploits of Xander, a bounty hunter with a sweet-as-hell eyepatch, as he discovers friendship, hardship, relationships, and spaceships across the Ferus Quadrant!</em>\n</p>\n<p>= = = = = = = =</p>\n<p>ExoSpace is a massive and passionate singleplayer sci-fi JRPG experience, filled to the brim with professional and semi-professional voice acting, deep morality choices, fun easter eggs in every nook and cranny, detail-filled worlds across the stars of the Ferus Quadrant, challenging semi-turn combat systems, a rich and heartfelt story that will make you laugh and cry, and so much more to discover! </p>\n<p>ExoSpace - Act 1 is the first in a set of episodic releases that will release and expand upon the previous one, each act released when ready and sufficiently tested. </p>\n<p>Act 1 in of itself is currently full of five chapters worth of engaging and thrilling story, six massive and captivating planets to explore full of detail and humor, and at least 8 hours worth of overall content depending on playspeed.</p>\n<p>May the stars guide your way, bounty hunter!</p>\n<p><strong>As ExoSpace is an ongoing project, development is subject to change at any point, including updates to existing releases that may impact save data.  You have been warned.</strong></p>\n<p><em>ExoSpace contains frequent profanity, suggestive themes, simulated gambling, and minor bloodshed, and should not be played by those under the age of 16. For those with potential triggers to heavy themes such as abuse, there is an in-game toggle to Censor Sensitive Content. </em></p><p><em>Credits are listed in-game.</em></p>", "metacritic": null, "released": "2021-05-24", "tba": false, "updated": "2021-05-28T10:12:29", "background_image": "https://media.rawg.io/media/screenshots/fbd/fbd26600cbec30ffe60473a270f162f2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 151, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Star Magi Games"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}