{"id": 610163, "slug": "legends-of-mathmatica2-under-the-shadow-of-certain", "name": "Legends of Mathmatica²: Under The Shadow of Certainty (itch)", "name_original": "Legends of Mathmatica²: Under The Shadow of Certainty (itch)", "description": "<p>Legends of Mathmatica2: Under the Shadow of Certainty is a humorous retro style JRPG, featuring a 16-bit aesthetic, an active time battle system, old school puzzle dungeons, and a comedic storyline that is filled with word play and genre savvy silliness.</p>\n<p>You’ll guide the protagonist, Hiro, as he travels the land of Mathmatica in search of the man who destroyed Six o’ Clock Town, Hiro’s home town. Like any good JRPG protagonist our Hiro will gather a band of heroes and misfits to his cause, save a few lives and complete a couple errands along the way (Those cats won’t walk themselves!). And while our Hiro may not be the sharpest sword in the armory, his adventure savvy intuition grants him an uncanny knack for getting out of (and into) all sorts of crazy situations.\r\n</p>\r\n                                                                                              Our Heroes...\r\n<p>Friends in tow, and determination unyielding, our hero may just have what it takes to save the kingdom...or screw things up beyond recognition.<br/><br/>The game is currently doing a run on Kickstarter! If you'd like to support its development, consider hopping over to the page and donating:<br/></p>\n<p>The Kickstarter Page:<br/>https://www.kickstarter.com/projects/vernaculargames/legends-of-mathmatica-under...<br/></p>", "metacritic": null, "released": "2021-05-24", "tba": false, "updated": "2021-05-28T11:19:46", "background_image": "https://media.rawg.io/media/screenshots/d77/d77f71e18ed6f2efaddacfb42d396a09.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 136, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Vernacular Games"], "genres": ["Adventure", "RPG", "Puzzle"], "publishers": [], "esrb_rating": null}