{"id": 610240, "slug": "the-blind-of-the-new-world", "name": "The Blind Of The New World", "name_original": "The Blind Of The New World", "description": "This game is a story-centered visual novel equal in length to a paperback novel.<br/>\n<br/>\n<br/>\r\nSynopsis:<br/>\n<br/>\r\nIn the near future with the invention and adoption of the Electron Corneas, augmented reality is now the only reality humanity knows.<br/>\r\nBut for Seejay, 'the blindness' has stripped him of his ability to exist in this new reality and has cut him off from the rest of the world.<br/>\r\nOne day, as he is walking through this bustling city of monotony, moving through the crowds of people all dressed exactly the same...<br/>\r\nSomething actually stands out—a girl dressed in a traditional school uniform from ages past…<br/>\n<br/>\r\nBecome one of the blind as you live through this story with our protagonist and his classical-minded heroine.<br/>\n<br/>\n<br/>\r\nGame features:<br/>\n<br/>\r\n1) Updated and reworked for the Unity engine, this port of the 2017 mobile hit was met with praise throughout Korea for its romantic story and dystopian sci-fi themes.<br/>\n<br/>\r\n2) Written by the award-winning visual novel author Kil-ke (Winner of the Novel Engine free topic story award)<br/>\n<br/>\r\n3) An emotional story and a rich soundtrack (6+ hours playtime, 100k word count): Your choices lead you to one of four endings. As such, there is no \"gameplay\" in the normal sense of the word.<br/>\n<br/>\r\n4) Both female leads are fully-voiced by professional Korean voice actors (Mi Jang &amp; Yoomi Jeong)", "metacritic": null, "released": "2021-05-28", "tba": false, "updated": "2021-05-31T02:33:05", "background_image": "https://media.rawg.io/media/screenshots/1de/1de3b0f1284645c7c7bbe5c4b87dde16.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 6, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 166, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["TALESSHOP Co"], "genres": ["Casual", "Indie"], "publishers": ["TALESSHOP Co"], "esrb_rating": null}