{"id": 610296, "slug": "kraken-academy", "name": "Kraken Academy!!", "name_original": "Kraken Academy!!", "description": "<p>Kraken Academy is no ordinary high school. Ghosts fill the art department, cultists meet below the monkey bars and now crocodiles are eating children.<br />\nJoin forces with a magical Kraken to uncover the Traitor, a malevolent mastermind, who could be anyone at the school. With each time loop you’ll get closer to saving Kraken Academy.<br />\nWhile saving the world is definitely an important goal there&#39;s a whole range of other activities to dive into. Learn teachers’ and students’ routines as you explore every corner of the campus during this three day loop. Attend a costume party, become a detective, and help the school&#39;s janitor bring down a crime syndicate.<br />\nKraken Academy is split into four clubs: Music, Art, Sports and Drama:<br />\nJoin the alternative Music Club and complete the school’s edgiest rock band.<br />\nFlex your creative flair in the Art Club and show off your work at an exhibition.<br />\nCompete in challenges to become the ultimate warrior in the Sports Club.<br />\nThe Drama Club may be full of snobs, but if you can&#39;t beat &#39;em, join em! Who knows, you may even become a star in their next extravagant play.<br />\nLucky for you, you can join them all! With the help of your magical amulet, become a member of a different club during each time loop.<br />\nKraken Academy is a melting pot of wacky personalities. In the Music Club alone you will meet pretty boy and lead vocalist, Vladimir, who struggles with keeping his hysterical fangirls at bay; ill-tempered bassist, Simona, always seen in her giraffe hoodie, who hates everyone (including you); and Broccoli Girl, the drummer, who just can’t get over her ex.<br />\nSo come on! Grab your uniform, magical time-travelling amulet, and ignore the voice in your head that says this is a terrible idea!</p>", "metacritic": null, "released": "2021-09-10", "tba": false, "updated": "2023-11-28T06:37:37", "background_image": "https://media.rawg.io/media/games/ae3/ae33061011b43b679b307adbcf492ef2.jpg", "website": "", "rating": 4.04, "rating_top": 4, "added_by_status": {"yet": 14, "owned": 57, "beaten": 20, "toplay": 11, "dropped": 4, "playing": 2}, "playtime": 0, "achievements_count": 48, "ratings_count": 26, "suggestions_count": 268, "game_series_count": 0, "reviews_count": 26, "platforms": ["Nintendo Switch", "PC"], "developers": ["Happy Broccoli Games"], "genres": ["Adventure", "RPG"], "publishers": ["Fellow Traveller"], "esrb_rating": null}