{"id": 610243, "slug": "horny-fantasy-girl-hentai", "name": "Horny Fantasy Girl Hentai", "name_original": "Horny Fantasy Girl Hentai", "description": "Join the game and get your hands on ten incredible beauties. This game is a perfect combination of shooting range and gachi, implemented in the form of roulette-<strong>HornyFantasyGirlHentai</strong>.<br/>You are destined to get them all!<br/>Problems? You're not too lucky and roulette doesn't like you?<br/>Don't be shy and don't worry, just shoot a little more to spin it again!<br/>Get your beauties, and don't stop there. Beat out all the available animations for each of them, because this will make the girls like you even more.<br/><br/><br/>A unique combination of two gameplay styles. The first part is a shooting range, where you can show all your dexterity and quick reaction to score the most points. The second part is gacha, implemented in the form of a roulette. Spend the points earned in the dash to spin it again and again, testing your luck and knocking out beautiful girls. But even if it didn't work out, don't worry, earn points to unlock new animations for those girls you've already managed to get. Or just shoot at the shooting range a little more and come back to check your luck. HornyFantasyGirlHentai is waiting for you.<br/><br/><br/>- a unique combination of two game mechanics: shooting gallery and gacha-roulette.<br/>- beautiful images and high-quality animation.<br/>- nice sound and visual effects.<br/>- a gallery where you can admire your animated girls at any time.<br/><br/><br/>Trading cards will be added as soon as Valve grants us access to them!<br/><br/><br/><br/><strong>Artist: 馬克杯(Magukappu)</strong>  -  https://www.pixiv.net/en/users/75567<br/><strong>All characters are over 20 years old.</strong>", "metacritic": null, "released": "2021-05-28", "tba": false, "updated": "2021-05-31T02:35:00", "background_image": "https://media.rawg.io/media/screenshots/a6d/a6d9ed4f6f265c3a6053936893acc84f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 152, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["HornyStudio"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["HornyStudio"], "esrb_rating": null}