{"id": 610304, "slug": "stickman-smasher-clash3d-game", "name": "Stickman Smasher: Clash3D game", "name_original": "Stickman Smasher: Clash3D game", "description": "Stickman smashers 3D - clash stick fight io game, the next addicted version of smashers game of all the time!<br/>You are a big fan of smashers io game? You love running, clashing and smashing other players in massive crowd to become the last stick heroes in io battlefield?  <br/>Stickman Smasher io - the amazing integration of smasher io and stickman heroes in only one battle arena. Exploring endless funny moment in unlimited sessions by using your massive weapons like hammer, spear, sword to smash others mobs and don't get hit. To become stronger, use your hammer smartly to squish others into piecces, absorb their power, get bigger and be the last stick survival smasher! <br/><br/>GAME FEATURE<br/>- Simple and funny io smasher game  <br/>- Excellent 3D clash graphics, realistic background and amazing sound effects<br/>- Multiplayer battle royales in massive crowd io game  <br/>- Various stickman character with awesome skins and skills <br/>- Easy to control with only 1 finger<br/>- Enjoy stickman smashers in offline popular game <br/>- All for free!<br/>- Fun and addictive stickman fight mobile game<br/>HOW TO PLAY<br/>- Run, clash and smash other stick fighter mobs<br/>- Absorb enemies' power to become bigger, stronger and having better skills <br/>- Try to be the last stick survival smasher  <br/><br/>Run, clash, smash &amp; be the last survival one in this addictive Stickman smashers 3D - clash stick fight io game. INSTALL NOW!", "metacritic": null, "released": "2021-05-21", "tba": false, "updated": "2021-05-31T03:26:39", "background_image": "https://media.rawg.io/media/screenshots/a08/a086d847c55dfb96a476a39bac295019_WsAIfjw.jpg", "website": "http://rocketadsltd.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["ROCKET GO GLOBAL PTE"], "genres": ["Action", "Casual"], "publishers": ["ROCKET GO GLOBAL PTE"], "esrb_rating": "Teen"}