{"id": 610302, "slug": "family-mysteries-collection", "name": "Family Mysteries Collection", "name_original": "Family Mysteries Collection", "description": "This bundle includes:<br/><br/>- Family Mysteries: Poisonous Promises\r\nEntertaining plunge into the world of debauched elites, alluring women and corrupted cops, where power is the ultimate currency. This is a thrilling introduction to the brand new Hidden Object Game series in the tradition of best police dramas.\r\nEver-present danger, glitzy surroundings and a unique rhythm of the glamorous yet deadly city, evoking a fanciful nostalgia for such TV hits like Miami Vice, Beverly Hills Cop and CSI.<br/><br/>- Family Mysteries 2: Echoes of Tomorrow\r\nFramed scientist travels through time to save his beloved wife and reveal kidnapper's identity. Find hidden objects in the post-apocalyptic world, solve cyberpunk puzzles and embrace the future full of adventures!\r\nSecond part of the Family Mysteries series introduces a post-apocalyptic vision of dystopian future where human race is at the brink of extinction. You'll be dealing with high-tech, mutinous software as well as bunch of challenging riddles and - as usual - exigent hidden object scenes.<br/><br/>- Family Mysteries 3: Criminal Mindset\r\nTake on a role of a famous scientist drawn into a dangerous game, where the goal is to save the mankind and uncover family secret. Get ready for a pulse-pounding adventure in the world of experiments, mysteries and espionage!\r\nThird instalment of the Family Mysteries series plunges you into a sea of action, double agents, brainwashed patients, murky experiments, nerds and conspiracy theories. A thrilling example of spy fiction with upfront overtones of X-Files, that should satisfy even the pickiest fans of the genre as the story unfolds at a breakneck pace and keeps you immersed to the very last minute!", "metacritic": null, "released": "2021-05-28", "tba": false, "updated": "2021-06-14T03:35:34", "background_image": "https://media.rawg.io/media/screenshots/04b/04b1c4413a272f4e63a00e2af014e428.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 488, "game_series_count": 0, "reviews_count": 0, "platforms": ["Xbox One", "PlayStation 4"], "developers": [], "genres": ["Adventure", "Casual", "Puzzle"], "publishers": [], "esrb_rating": null}