{"id": 610343, "slug": "high-ground-sports-bike-sim-3d", "name": "High Ground Sports Bike Sim 3D", "name_original": "High Ground Sports Bike Sim 3D", "description": "Are you a bike racing fan? Because to become a high ground city jumper motorbike rider? Play the motorbike simulator to become an extreme bike rider. Start the engine and go on an adventure of a lifetime with desert stunts bike racing thrill in motorbike racing game.<br/><br/>GAME PLAY<br/><br/>Get ready for an exotic stunt master &amp; adventurous high ground city jumper sports bike simulator game. For bike racing fans and motor bike riders this exotic sports bike simulator is a real fun game. Just start your engine and hit the gas or an extreme bike to experience the stunt master thrill or high ground city jumper motorbike racing &amp; enjoy sports bike sound. In a sports bike simulator, mania racing game you can perform insane stunt actions to join the group of elite riders in the world championship or motorbike simulator. Enjoy the adrenaline rush and jump high with the exotic racing action in motorbike racer and ride the fastest high ground city rooftop jumper extreme motorbik. 3d motor sports stunt mania is xtreme bike racing game full of thrill master challenge and action. Ride the fastest bikes to win in this motorbike racing game. Drive and ride the bike on dangerous racing tracks. Motorbike riders will surely enjoy the immersive fast-paced gameplay or motorbike simulator. Choose from a variety of unique and fast sports motorbike fun driving to start the exotic motorbike racing game. Xtreme stunt rider or xtreme bike can perform super insane stunt actions in extreme bike racing. The adventure for motorbike racer in this motorbike simulator game with realistic 3d graphics is like no other motorbike 2018 city rush racing games.<br/>Motorbike simulator racing game is realistic simulation or high ground city rooftop jumper motorbike racing. Race your rivals as an xtreme rider with extreme stunt master bike. Jump, crash and race like an extreme motorbike kids rider on exotic yet dangerous tracks. Master the skills of bike racing with high speed racing adventure in motorbike simulator. Become the most fast xtreme biker in history or motorbike in traffic. With fastest sports bike simulator to choose from it is the best motor racing game by game tap or all the motorcycle games. Motorcycle racer is a fast bike racing game. This game lets you ride a sports bike simulator at xtreme fast speeds. As highway rider dodge traffic on highway in fast real racing challenge or motorbike racing. Dodging cars and trucks while you speed up on the highway is a real challenge. Motorbike simulator racing game with insane and stunt action is best motorbike 2018 game with realistic motorbike physics or extreme stunt bike on highway with heavy traffic.<br/><br/>GAME FEATURES<br/><br/>▶ Realistic Motorbike Physics.<br/>▶ Great Collection of Latest Motorbikes.<br/>▶ High Definition Graphics.<br/>▶ Multiple Camera Views.<br/>▶ Easy to Play with Dynamic Controls (Tilt, Buttons, Accelerometer).", "metacritic": null, "released": "2019-04-13", "tba": false, "updated": "2021-05-31T03:48:16", "background_image": "https://media.rawg.io/media/screenshots/24b/24bea438cae8bcd45ff7dba078ff2dc8_AzIxIW5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 159, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["hamza khalid"], "genres": ["Sports", "Racing"], "publishers": ["hamza khalid"], "esrb_rating": "Everyone 10+"}