{"id": 610321, "slug": "devil-amongst-us-hide-n-seek", "name": "Devil Amongst Us Hide N Seek", "name_original": "Devil Amongst Us Hide N Seek", "description": "Devils Amongst Us is a real-time online multipyer game played with 4-10 players in a haunted mansion.  <br/>Create your own Silly Avatar and get selected to play as a \"Silly\" or a \"Devil\". <br/><br/>► Game Modes Choose between playing our 3 Modes<br/>1. Murder Mystery which is a social deduction game<br/>2. Hide N Seek <br/>3. Jailbreak or Cops and Robbers which is coming soon <br/>We also allow you to customize your Game Settings for a Private Match<br/><br/>► Voice Chat - We now support Voice Chat in all Private Rooms<br/>Hide and Seek supports an always On Voice Chat. Tell your friends when the devil is near by. <br/>Murder Mystery supports 3 Voice Modes<br/>1. Default Meetings Only (Everyone can speak at meetings, Ghost can only listen)<br/>2. Murder Mystery Mode (Everyone can speak always, Ghosts can listen but not speak)<br/>3. Always On (Everyone Abides by an Honor Code)<br/><br/>► Story-line Evil spirits have been residing in a huge Mansion for many years. The only way to set the mansion free from these spirits is by completing all the mini tasks inside the mansion, but beware of these impostors who will sabotage your task. The game is similar to werewolf &amp; mafia that you have been playing all this while.  <br/>► GamePlay All the players enter the haunted mansion and a few get possessed by the Devil to play the role of imposter in the game. Every player will have a task to complete.<br/>► Vote There is a voting round after every dead body reported or when an emergency  call is made. Vote to evict the Devil, but be careful not to evict an Innocent Silly since you will be helping the Devils win the game. <br/><br/>► Devils Goal - Devils win the game by eliminating the rest of the Silly's <br/>► Sillys Goal - Complete all the mini tasks inside the mansion or Find and Vote out Devils Among Us in the Murder Mystery Mode.<br/>► Identify Suspects - See who is on Sus behavior and see who is a genuine player.<br/>► Vote out Imposters - Impostors should be voted out of the game before time runs out. Be mindful to not vote out a Silly. <br/><br/>Silly Universe - Customize your Silly with many different skins and hat combinations <br/><br/>Coming Soon <br/>Cops N Robbers - Jail Break <br/>In our Cops and Robbers Mode, we have eight prisoners and two cops. <br/>Prisoners do tasks to try and escape the Prison while Cops seek them and keep them locked up again. Will the Cops succeed or will the prisoners escape the Jail. <br/>Play to Find Out in our new mode coming soon. <br/><br/>► Let's Play Devils Amongst Us ! with our classic Social Deduction Game where you identify Suspects, Eliminate Imposters or our all new Hide and Seek mode where you chase and seek other players.", "metacritic": null, "released": "2021-05-21", "tba": false, "updated": "2021-05-31T03:35:40", "background_image": "https://media.rawg.io/media/screenshots/47f/47f2d37a642b34208fb211b71d6d57e4_c95FPYs.jpg", "website": "https://www.supergaming.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 190, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Supergaming"], "genres": ["Action", "RPG"], "publishers": ["SuperGaming Pte"], "esrb_rating": "Everyone 10+"}