{"id": 610346, "slug": "game-of-nations-idle-rpg", "name": "Game of Nations: Idle RPG", "name_original": "Game of Nations: Idle RPG", "description": "Take a break now and then and discover the joys of world domination in the NEW IDLE RPG Game of Nations. You won’t have to lift a finger, just swipe away and start today! <br/><br/>Don’t worry, you’re not alone in this! The wisdom of Plato will be your guide and show you the ropes once you get started. Can you believe he was a wrestler once? <br/><br/>Sit back and relax as you unlock special Units from Legendary Nations each with its unique abilities. You will enjoy the company of Epic Heroes, mythical creatures and Gods alike who will rally to your cause and obey your commands in battle. <br/><br/>Control your enemies with the help of Cleopatra’s entrancing gaze and use her Aura to heal your legions! Enlist the aid of Loki, the god of mischief who surely has some tricks up his sleeve. We got word Thor might join the brawl. Or perhaps, if you’re all about offence then the mythical Minotaur should do quick work once you face the goddess Athena who will make for a worthy opponent in your first battles.  <br/><br/>Embark on an epic fantasy adventure! Roam the World Map to discover the fiercest warriors and lead them in the ultimate battle of nations!<br/><br/>If you like your army disciplined, then you’ll love the Greek Units as well as famous Gods from Greek Mythology. Explore the Sun warmed temples of Egypt, whose dunes hold more than just sand! Or travel to the wintry forests of the north where Dark Elves still roam and the old gods walk. Don’t let them walk alone! Instead, make use of their unique skills in the Campaign Mode or AFK Battles in the Arena.<br/><br/>Make sure you upgrade your Heroes and Units to keep them in tip-top shape and enhance their skills. Explore all Nations in the game’s Campaign Mode, enjoy their unique art style and collect each Unit to achieve the ultimate army!<br/><br/>Even more, mix and match your Units to find that killer combo and wreak havoc on your opponents.<br/><br/>Test out your tactics and your army’s special skills against other players from all over the world in the Arena to discover all sorts of fun ways to combine your units. Not only that but you can unlock awesome rewards while fighting other opponents in the Arena as well as in Campaign Mode. Make sure to gather all the keys in PvP Arena to unlock your 3 Daily Chests and collect amazing loot! To top this, you get idle loot in your own chest when you’re not with us. <br/><br/>Need some extra help? No worries, we’ve got you covered. You can always summon Heroes and units from any distant Nation who will surely lend a hand.<br/><br/>Conquer the World in your spare time and jump right into the IDLE RPG Game of Nations to start living the dream. <br/><br/>Features: <br/><br/>- Recruit mighty warriors for your army and unique Heroes to fight for your cause.<br/>- Upgrade your troops to make them stronger and unlock unique skills for your Heroes.<br/>- Arrange and rearrangeUnits to get the perfect combo, make a better team and try out different formations.<br/>- Summon the best Heroes or units from wild beasts to mythical creatures.<br/>- Complete missions and earn massive rewards in Campaign mode as well as the AFK Arena<br/>- Collect Daily Loot from your chest and see what treasures await along your adventure.<br/>- Match up against other players in competitive PvP mode and climb up the ranks in the leaderboards as well as earn amazing prizes in special tournaments and seasons.<br/>- Explore ancient civilizations and embark on an epic adventure by completing the missions on the world map as well as enjoy our colorful fantasy art style.<br/>- Enjoy a casual game and chat for fun or debate strategies with other players<br/>- Carefree and easy competitive gameplay mechanics BUT with countless strategic options to help you on your epic adventure as well as earn awesome rewards. <br/><br/>Enjoy the adventure, gather the greatest army, make new friends or taunt your rivals! Go conquer your World and join us on: <br/><br/>https://discord.gg/sRWgxRz", "metacritic": null, "released": "2021-05-24", "tba": false, "updated": "2021-05-31T03:50:10", "background_image": "https://media.rawg.io/media/screenshots/4d0/4d0297d694fd06c7f583c2bd4e1cfb67_BG2CRHQ.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 170, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Erepublik Labs"], "genres": ["RPG", "Strategy"], "publishers": ["eRepublik Labs"], "esrb_rating": "Teen"}