{"id": 610325, "slug": "kings-choice", "name": "King's Choice", "name_original": "King's Choice", "description": "King's Choice is an exciting RPG game simulating life at the European medieval royal court. Become a legendary king and recruit famous generals, meet stunning beauties, raise your heirs, suppress rebellions, and expand your empire with the ultimate goal of becoming the supreme emperor!<br/><br/>Game Features<br/>1. Experience the splendor of the medieval royal court - resplendent garments, luxurious palaces, lavish banquets, loyal knights, gorgeous concubines, and so much more! Live the marvelous life of a medieval European king!<br/>2. Build and rule your own kingdom - handle government affairs, confer titles of nobility, build alliances, defeat enemies, and develop trade!<br/>3. Join the prom with peerless beauty - Peerless beauty invites you to join the dance party！ After dance, you may also fall in love and get marry!<br/>4. Raise your heirs - Raise your sons and daughters, and marry them to other players' heirs to make your kingdom even stronger!<br/>5. Collect legendary heroes - Summon heroes, and compete with other players!<br/>6. Join PvP - Rally players from across the world, and defeat your enemies!<br/>7. Build alliances - Rally your allies and wage bloody wars!<br/><br/>——————————<br/>Subscribe to the Weekly Pack: <br/>[Subscription Content]: Enjoy valuable 7-day in-game privileges, including:<br/>Purchase to get 120 Gold instantly and then 50 more Gold each day. The Auto-play privilege will be unlocked too.<br/>[Subscription Period]: 7 days<br/>[Subscription Price]: $1.99/week<br/>•After you subscribe, you'll enjoy privileges for 7 days.<br/>•Apple will monitor and manage all transactions made through iTunes.<br/>•When you confirm your purchase, you'll be charged from your iTunes account.<br/>•Subscriptions automatically renew. The account will be charged within 24 hours prior to the end of the current subscription, at which point the renewal fee will be determined.<br/>•Subscriptions can be managed by the users themselves, and you can turn off automatic renewal after you subscribe via your account settings.<br/>•Try it free for 3 days! Once your trial is over, subscription fees will be taken each week. Subscriptions can be canceled at any time.<br/>Privacy Policy: http://www.onemt.com/abroadgame/outer/policy<br/>Terms of Service: http://www.onemt.com/abroadgame/outer/terms<br/>——————————<br/><br/>Facebook: https://www.facebook.com/KingsChoiceGame<br/>Twitter: https://twitter.com/kingschoicegame<br/>YouTube: https://www.youtube.com/channel/UC3RBWqzeyQ0LNruSuIszMww<br/>Discord: https://discord.gg/ZMwAH7BYa8<br/>Official Website: kc.onemt.com<br/>Customer Support: servicekc@onemt.com", "metacritic": null, "released": "2021-05-17", "tba": false, "updated": "2021-05-31T03:37:45", "background_image": "https://media.rawg.io/media/screenshots/ea6/ea6f4c178f0825dd379170359cf85a95.jpg", "website": "http://www.onemt.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "playing": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 251, "game_series_count": 0, "reviews_count": 3, "platforms": ["iOS"], "developers": ["ONEMT"], "genres": ["RPG", "Strategy"], "publishers": ["Lokka Entertainment Hong Kong"], "esrb_rating": "Teen"}