{"id": 610300, "slug": "wonder-boy-asha-in-monster-world", "name": "WONDER BOY ASHA in Monster World", "name_original": "WONDER BOY ASHA in Monster World", "description": "<p>To play this game on PS5, your system may need to be updated to the latest system software. Although this game is playable on PS5, some features available on PS4 may be absent. See PlayStation.com/bc for more details.<br />\nThe adventures of Asha and her mysterious sidekick Pepelogoo are about to begin!<br />\nWork together to overcome a variety of action stages and save the Monster World from danger!<br />\nAsha, the warrior protagonist of the game, is involved in a serious incident that will affect the survival of her world. Our green-haired heroine doesn’t have to save the world all alone, and sets off on an adventure with her cute flying friend, the blue Pepelogoo. Asha and the Pepelogoo have to work together to become the heroes the world needs them to be. The road ahead is long - will they be able to save their world?<br />\n■A side-scrolling action game that is light and easy to play.<br />\nThe action is fast and challenging, but the game is tuned for easy retrying, making it easy to try again.<br />\n■Call it, grab it, throw it, move it, her blue buddy Pepelogoo.<br />\nJoin forces with your partner to overcome gimmicks and powerful enemies.<br />\n■Various action levels<br />\nHigh mountains, volcanoes, ice worlds, the sky...<br />\nLet&#39;s run through the various areas with Pepelogoo.<br />\n■Explore the vastness of the world!<br />\nThe vast world is full of unknown encounters, events, and discoveries. Even if you&#39;ve cleared a stage once, you might discover something if you visit it again.<br />\n■Power up Asha and you&#39;ll be ready for the difficulties!<br />\nBy acquiring items and equipment, you can strengthen your attack and defense capabilities.<br />\nGet ready to face the powerful enemies.<br />\n■Staying true to the series legacy<br />\nFor Wonder Boy - Asha in Monster World, the original staff from the former Westone Bit Entertainment gathered together to create a game that stays true to the spirit of the original games. The team is led, and directed, by the creator of the Wonder Boy series, Ryuichi Nishizawa and supported by Shinichi Sakamoto (sound), Maki Ōzora (character design) and Takanori Kurihara (creative management). You can&#39;t get more Wonder Boy than that!<br />\nOffline single player<br />\nUses DUALSHOCK 4 vibration function<br />\nOffline play enabled<br />\nOnline features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service &amp; playstationnetwork.com/privacy-policy).<br />\nSoftware subject to license (us.playstation.com/softwarelicense).<br />\nOne-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.</p>", "metacritic": null, "released": "2021-05-28", "tba": false, "updated": "2023-10-12T11:41:15", "background_image": "https://media.rawg.io/media/screenshots/41e/41e90b6e1f09b0e7116c16ab84da2565.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 10, "beaten": 3, "toplay": 4, "dropped": 1}, "playtime": 0, "achievements_count": 21, "ratings_count": 3, "suggestions_count": 398, "game_series_count": 10, "reviews_count": 4, "platforms": ["PC", "Nintendo Switch", "PlayStation 4"], "developers": ["G CHOICE"], "genres": ["Action", "Platformer"], "publishers": ["Artdink", "ININ Games"], "esrb_rating": "Everyone 10+"}