{"id": 610357, "slug": "dino-evolution-2", "name": "Dino Evolution", "name_original": "Dino Evolution", "description": "Once upon a time, planet Earth was dominated by the dinosaurs, a species far more advanced than mankind: towering, powerful beings, and some of them could even fly!<br/><br/>Then a tiny rock fell from the sky and wiped them all out...but you can help them turn this dinoSOUR tale around!<br/><br/>Combine the different dinosaurs to create new mutations and bring an entire species back from the darkness of extinction!<br/><br/>After you’re done with that, you can even put your miraculous dino-creations on display on a jurassic era themed park built on a remote island. No one has ever tried that!<br/><br/>What could possibly go wrong, right?<br/><br/>JURASSIC FEATURES<br/>• Pantheon: a new place for supreme beings to look down on us mortals and laugh at our misery<br/>• Impostors: watch out for impostors trying to steal the spotlight from the dinosaurs<br/><br/>HOW TO PLAY<br/>• Drag and drop similar dinosaurs to create new mysterious creatures<br/>• Use dinosaur eggs to earn coins, buy new creatures and make even more money<br/>• Alternatively, fiercely tap a dinosaur to make coins pop from their eggs<br/><br/>HIGHLIGHTS<br/>• Different stages and many dino species to discover<br/>• A mind-blowing story with paleolithic twists!<br/>• The unexpected mix of alpaca-like evolution and incremental clicker games<br/>• Doodle-like illustrations<br/>• Various possible endings: find your destiny<br/>• No dinosaurs were harmed in the making of this game, only developers<br/><br/>Just don’t forget to say the magic word. Ah, ah, ah!<br/><br/>Disclaimer: While this App is completely free to play, some additional content can be purchased for real money in-game. If you do not want to use this feature, please turn off in-app purchases in your device's settings.<br/><br/>Like our page on Facebook and be the first to know about our upcoming games and updates! http://fb.com/tappshq", "metacritic": null, "released": "2017-08-27", "tba": false, "updated": "2021-05-31T03:56:32", "background_image": "https://media.rawg.io/media/screenshots/0b0/0b0e423294ab5df1bb5859bf2c60dfec_MGyxsAX.jpg", "website": "http://tappsgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 112, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tapps Tecnologia da Informação Ltda."], "genres": ["RPG", "Strategy"], "publishers": ["Tapps Tecnologia da Informacao LTDA."], "esrb_rating": "Everyone 10+"}