{"id": 610567, "slug": "dungeon-lad", "name": "Dungeon Lad", "name_original": "Dungeon Lad", "description": "Explore a randomly generated dungeon as you juggle your health, gold, and remaining time. Complete floors and defeat enemies in order to unlock more powerful upgrades for subsequent runs to delve deeper and deeper. Unlock more upgrades, enemies and more as you explore infinite dungeons.<h3>Gameplay</h3><br/><br/>Dungeon Lad is pretty simple. You want to find the stair case on each level to proceed to the next level. Each run is timed, so you want to be quick. Each enemy has it's own power level, denoted by a number next to it. Colliding with that enemy lowers your health by that number, but also grants you that much gold. You use gold in between levels to buy upgrades for you character to make going deeper in the dungeon easier.  While you make your way through the dungeon, collect orbs to unlock more items in between runs. Some of these unlocks alter the character directly by increasing starting health or time. Others unlock stronger items for the in-dungeon shop.  There are over 70 unique upgrades to unlock, and each one will make it easier to post a good score on the leader board.<h3>Features</h3><ul><li>Low Time Commitment: Runs can be completed in just a few minutes while still progressing your character.<br/></li><li>Simple Gameplay: Just 4 buttons and a mouse are needed to explore the depths.<br/></li><li>Tons of Content to Unlock: Unlock more upgrades, more enemies, and other game altering items.<br/></li><li>Online Leaderboard: Compete to see who is the ultimate dungeon lad.</li></ul>", "metacritic": null, "released": "2021-05-30", "tba": false, "updated": "2023-11-06T20:48:06", "background_image": "https://media.rawg.io/media/screenshots/1e1/1e180fc62ac0877dde3bdba0edd36519.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["GhostGoats", "Ghost Goats Games"], "genres": ["Adventure"], "publishers": ["Ghost Goats Games"], "esrb_rating": null}