{"id": 61067, "slug": "soul-reaper-unreap-commander", "name": "Soul Reaper: Unreap Commander", "name_original": "Soul Reaper: Unreap Commander", "description": "*Alpha Version Only Supports 16:9 Aspect RatioSoul Reaper<br/>Soul Reaper is a Square Enix Collective alumni. Soul Reaper is a not-so-serious grim reaper in search of succulent souls. His journey is split into two different games: Unreap Commander and Rise of the Unreaps. Unreap Commander is an Online Strategy RPG for PC and Mac, drawing inspiration from classic JRPGs, Tower Defense games and Idle Clicker games. Rise of the Unreaps is a single-player exploration and story driven game for PC, Mac, and consoles.Unreap CommanderSoul Reaper: Unreap Commander is an asynchronous multiplayer version of Soul Reaper, focusing on monster team building as well as Soul Reaper's signature fast turn-based combat, and loot and souls systems.<br/><br/>Assemble teams of Unreaps and train them against pre-defined challenges, or compete online against other players' teams and earn epic loot and souls!<br/><br/>Some games that Soul Reaper might remind you of are:<br/><br/><ul><li>Pokemon: (Once you're hooked on soul-collecting, you'll wanna reap 'em all)<br/></li><li>Diablo: (Loot with more stats than you can shake a '+50% stick-shaking' stick at)<br/></li><li>Final Fantasy: (Side view turn-based combat)<br/></li><li>Castlevania: Aria/Dawn of Sorrow (Kill monsters, get souls!)</li></ul>Features<ul><li>Turn-based classic RPG style combat. You hit me, I hit you, you hit me, I reap your soul. That sort of thing!<br/></li><li>Collect every soul and explore all of the hidden powers within their Soul Gems.<br/></li><li>Find treasure chests full of loot and gear with tons of useful (or bizarre) stat boosts. Wanna pair gloves that make you run faster with shoes that make you punch harder? Then open up those chests and start accessorizing!</li></ul>", "metacritic": null, "released": "2018-04-24", "tba": false, "updated": "2019-08-28T21:58:21", "background_image": "https://media.rawg.io/media/screenshots/fa9/fa946541422a47b8ccb2c82c33f8a3dd.jpg", "website": "http://powerlevelstudios.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 14}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 317, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Power Level Studios"], "genres": ["RPG", "Strategy", "Indie"], "publishers": ["Power Level Studios"], "esrb_rating": null}