{"id": 610622, "slug": "the-physics-laboratory", "name": "The Physics Laboratory", "name_original": "The Physics Laboratory", "description": "<p>The Physics Laboratory was created for a dissertation titled \"An Exploration Of Reinforced Physics In Virtual Reality\" which can be read here:<br/></p>\n<p>https://pdfhost.io/v/pTevEme2~_An_exploration_of_reinforced_physics_in_virtual_r...</p>\n<p>The aim of the project was to explore how physics methods could be used in a virtual reality setting. This included but was not limited to: The player rig; the player’s interaction with props or objects; and how the player interacts with the environment. Furthermore, the project aimed to recreate the results of the study mentioned in the paper, were players were asked to lift a virtual weight, and see if physics could provide the illusion of weight, this was accomplished by allowing project participants to interact with virtual weights and asked about their experience handling the weights. Before and after the participants play the project, they were asked a number of questions similar to the questions presented in the questionnaire to see if more experience in virtual reality has any effect on their opinion about the role physics plays in virtual reality. The questions were also  tailored to allow analysis with the results from the online questionnaire.</p>\n\n<p>Created By Gwydion LLyr Meredydd\r\n</p>\n<p>*Disclaimer This Game was created for educational Purposes Only! Some third party assets were used and are listed on the document below. The Game does not mean to infringe or profit from these respected properties, only to use them for the University assignment.*\r\n</p>\n<p>https://pdfhost.io/v/9P2wL4.LN_An_exploration_of_reinforced_physics_in_virtual_r...</p>", "metacritic": null, "released": "2021-05-30", "tba": false, "updated": "2021-05-31T05:07:52", "background_image": "https://media.rawg.io/media/screenshots/790/79049dc7c3ea96c4537d4a1788d11264.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 164, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Gwydion-Meredydd"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}