{"id": 61069, "slug": "age-of-space", "name": "Age of Space", "name_original": "Age of Space", "description": "<strong>tower defense versus</strong>. You play as the commander of a massive capital spaceship and your job is to make preparations and tactical decisions to defeat the enemy commander.<br/><br/>Features:<br/><ul><li>3 playable factions with their own campaign.<br/></li><li>Online multiplayer.<br/></li><li>Deep ship customization.<br/></li><li>Endless replayability with dynamic changes of meta.</li></ul><br/><br/><br/>The game is played in two different phases; first is the preparation phase where you configure your fleet. Each ship can be modified with it's own set of modules, weapons, and orders. The player will spend a lot of time refining the fleet setup and trying out different approaches to defeat the opponent with a superior setup and battle plan.<br/><br/><br/><br/>Next up is the actual battle phase, either online against other players or versus the AI. In battle, your first concern should be to set up your mining operation to supply you with the minerals you need to purchase ships. All ships except for the miners will automatically engage nearby hostiles on sight. The ships will act based on how they are configured in the first phase, but you can also select primary targets for your fleet to override their preconfigured behavior.<br/><br/><br/><br/>Matches can end with a win, lose or draw. Depending on the fortunes of war, you either destroy your enemy, force him to leave the battlefield, flee like a coward or go down with your ship. Each outcome provides the player with rewards reflecting his performance. No matter the outcome, you’re richer in experience (and hopefully salvage!) and it’s back to the drawing board to perfect your fleet.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:58:21", "background_image": "https://media.rawg.io/media/screenshots/9fe/9fec71161db4002e56b24b3109b57095.jpg", "website": "http://www.aosgame.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 283, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["PodPal Games"], "genres": ["Strategy", "Indie"], "publishers": ["PodPal Games"], "esrb_rating": null}