{"id": 61074, "slug": "loves-sweet-garnish", "name": "Love's Sweet Garnish", "name_original": "Love's Sweet Garnish", "description": "A visual novel from the talented doujin circle, Canvas+Garden featuring their mascot characters who come to life in this youthful story!<br/><br/><strong>Story</strong><br/><br/>Spring break at the school academy.  It is a season filled with both expectation and hesitation as I enter my new life as a student at a new school. I, Ogisawa Asaki, have just moved from the quaint surroundings of my hometown to a new place: the town of Hanao Usaka.<br/><br/>My new home is my grandmother’s house that also functions as a café. Due to my grandmother’s recent illness and hospitalization, however, she was forced to close the café until further notice. When I heard about my grandmother’s situation from Chisato Komada (a childhood friend who is like an older sister to me), I looked around the desolate café and my heart was filled with a sense of loneliness. It was then I immediately thought:<br/><br/>“I want to bring the shop back to life again and show it to grandmother…!!!” <br/><br/><strong>Café Caramella</strong><br/><br/>We renovated the inside of the shop and gave it a new name. We prepared a new menu and café uniforms and began the hiring process to find new, part-time staff. Right away two girls, Niwasaka Rira and Shionomiya Richer came into the cafe.<br/><br/>“Um… would it be ok if we worked here?”<br/><br/>An unusually strong breeze blew cherry blossom petals inside the shop and they fluttered and danced around the cafe, myself, and the girls around me. This could only be a premonition of the bittersweet tale that would soon follow…<br/><br/><strong>Features</strong><br/><br/><ul><li>Fully voiced in Japanese (except main character)<br/></li><li>English, Japanese, and Chinese Language Support<br/></li><li>CG Gallery<br/></li><li>Music Gallery<br/></li><li>Character Designs by Miyasaka Miyu and Miyasaka Nako<br/></li><li>Two Routes</li></ul>", "metacritic": null, "released": "2018-09-07", "tba": false, "updated": "2019-08-28T21:58:21", "background_image": "https://media.rawg.io/media/screenshots/d15/d156e7f67a18af403a94681d20e67a41.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 15, "playing": 1}, "playtime": 6, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 397, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Canvas+Garden"], "genres": ["Casual", "Indie"], "publishers": ["Sekai Project"], "esrb_rating": null}