{"id": 610782, "slug": "apulija-13", "name": "APULIJA-13", "name_original": "APULIJA-13", "description": "APULIJA-13\r\nUn gioco per lo ZX SPECTRUM 48/128K\r\nA game for the 48/128K ZX SPECTRUM\r\nUn juego para ZX SPECTRUM 48/128K\r\nGioco e manuale in:<br/>Game and manual in:<br/>Juego y manual en:\r\nITALIANO - ENGLISH - FRANCAIS -<br/>DEUTSCH -  ESPAÑOL - PORTUGUÊS\r\n\r\n<p>\n</p>\n<p><strong><br/>*** ITALIANO ***</strong>\n</p>\n<p>Il Caporale Jonlan è impegnato in una pericolosa missione per conto dei Ribelli: infiltrarsi nella base della Omni Corp. sul pianeta Apulija-13 e rubare i piani di una nuova arma sperimentale. Proprio mentre sta per giungere a destinazione, un misterioso raggio di energia colpisce la sua nave spaziale, costringendolo ad un atterraggio di fortuna. Ma il peggio deve ancora venire...</p>\n<p><em>APULIJA-13</em> giunge alla versione 2.1 con le seguenti novità:<br/>- un leggero sfarfallìo degli sprite che poteva verificarsi in alcuni casi è stato eliminato (grazie a un accorgimento ideato da Allan Turvey);<br/>- alcuni oggetti di gioco sono stati ridisegnati;<br/>- alcune piccole correzioni ai testi.<br/><br/></p>\n<p><strong>*** ENGLISH ***</strong>\n</p>\n<p>Corporal Jonlan is engaged in a dangerous mission for the Rebels: infiltrate Omni Corp's base on the planet Apulija-13 and steal the blueprints of a new experimental weapon. As soon as he approaches his destination, a mysterious energy ray hits his spacecraft and he is forced to perform an emergency landing. But the worst is yet to come... </p>\n<p><em>APULIJA-13</em> is updated to version 2.1 with the following new features:<br/>- a slight flicker of sprites that could occur in some circumstances has been eliminated (thanks to a code devised by Allan Turvey);<br/>- some game objects have been redesigned;<br/>- some minor corrections to in-game texts.<br/><br/></p>\n<p><strong>*** ESPAÑOL ***</strong>\n</p>\n<p>El cabo Jonlan está en una misión peligrosa para los Rebeldes: infiltrarse en la base de Omni Corp. en el planeta Apulija-13 y robar los planos de una nueva arma experimental. Justo cuando está a punto de llegar a su destino, un misterioso rayo de energía golpea su nave espacial y lo obliga a realizar un aterrizaje forzoso. Pero lo peor está aún por llegar ...</p>\n<p><em>APULIJA-13</em> llega a la versión 2.1 con las siguentes actualizaciones:<br/>- se ha eliminado un ligero parpadeo de los sprites que podía ocurrir en algunos casos (gracias a un código realizado por Allan Turvey);<br/>- algunos objetos del juego fueron rediseñados;<br/>- algunas pequeñas correcciones a los textos.<br/></p>\n<p>\n</p>", "metacritic": null, "released": "2021-05-30", "tba": false, "updated": "2021-05-31T05:48:33", "background_image": "https://media.rawg.io/media/screenshots/84b/84b460bffcc7d820c4ba83ac1074eb34.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 206, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["zanklesoft"], "genres": [], "publishers": [], "esrb_rating": null}