{"id": 61090, "slug": "star-advent", "name": "Star Advent", "name_original": "Star Advent", "description": "For those who want to relax and try something new, the game will do just fine!<br/><br/>Managing your ship, you have to avoid dangerous objects and collect various bonuses that await you on the way to your goal.<br/><br/>Your path will be the shortest, and at the same time the most dangerous, but you no longer have time! Plot: It all started with the fact that after a high flash, problems with communication started, and I do not fully know what exactly happened, at first there were short time communication gaps, but from what I know, several of our stations have already failed, I expect that we something does not finish, the supplies that we deliver from warehouses have greatly decreased<br/><br/>...<br/>Strong problems have begun, the cargo ship brings very little supplies and our station lacks them! You have to save. Also, 6 remote stations no longer respond to messages, this has not happened before, I feel uncomfortable!<br/>...<br/>It seems the problems are much worse than I could even imagine, intelligence reported that the station E11, was lost, only debris ... just debris.<br/>...<br/>I was assigned the task: Send to the C sector all the reports after the outbreak, the time is short and the path path is not so simple! Advantages: <ul><li> Nice music and sound effects<br/></li><li> Very easy to learn<br/></li><li> 3D graphics and effects<br/></li><li> Nice atmosphere in the game</li></ul>", "metacritic": null, "released": "2018-03-10", "tba": false, "updated": "2022-10-18T19:42:15", "background_image": "https://media.rawg.io/media/screenshots/c9e/c9edffc940596f65f21264f627b4e6b5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 129, "beaten": 1}, "playtime": 1, "achievements_count": 5000, "ratings_count": 2, "suggestions_count": 50, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Maraby"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["КиКо"], "esrb_rating": null}