{"id": 61097, "slug": "mini-battlegrounds", "name": "Mini Battlegrounds", "name_original": "Mini Battlegrounds", "description": "* Similar gameplay with fortnite and pubg, but more casual and easier to learn and enjoy. *<br/><br/>Mini Battlegrounds is a multiplayer last-man-standing battle royale full of adrenaline-packed combat! With simple controls, this game is easy to pick up for new players, while maintaining a high skill cap to entertain the seasoned veterans of the genre.<br/><br/>Using an isometric view rather than the traditional first-person view that is so common to the genre adds a unique feel to the game that separates it from its competitors, and adds a new layer of strategy and skill.<br/><br/>Join up to 50 other players in an abandoned town with one goal: survive. Gather armor, a plethora of weapons and other unique boosts, and use them to slay your enemies. It's kill or be killed, and only one person will be left alive; you.<br/><br/>Mini Battlegrounds shakes the dynamic of the genre, being heavily optimized to combat cheating, where similar titles fail. Whether you choose to be a casual player and focus on collecting rare skins and beautiful cosmetics, or a God on the battlegrounds, skill reigns supreme, and you must forge your own destiny.Features<ul><li> Intuitive control, easy to learn yet hard to master <br/></li><li> Vast amounts of weapons with more added frequently <br/></li><li> Fast games with meaningful rewards <br/></li><li> No pay-to-win <br/></li><li> Anti-Cheating optimization so true skill shines</li></ul>", "metacritic": null, "released": "2018-08-20", "tba": false, "updated": "2022-10-18T19:40:54", "background_image": "https://media.rawg.io/media/screenshots/9bc/9bcf48b89e69913acf39a226da387b41.jpg", "website": "https://www.facebook.com/minibattlegrounds/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 141, "playing": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 193, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["IOA Games"], "genres": ["Action", "Strategy", "Casual", "Massively Multiplayer", "Indie"], "publishers": ["IOA Games"], "esrb_rating": null}