{"id": 61094, "slug": "lost-region", "name": "Lost Region", "name_original": "Lost Region", "description": "A third-person, open world Survival Action sandbox with combat, looting, crafting, building, leveling and diplomacy, that will take you to the world after civilization crisis.<br/><br/>Join a group of people or create your own faction, build your base or capture it from your enemies. Create your own world where you can be proud loner, or create a group with your friends. The entire subsequent history of the world depends on you.<br/><br/><br/><br/>World – Large realistic US themed open world covering over 64sq.km(39sq.miles). Every building in this world is explorable, you can search loot or create your base in every building in the world.<br/><br/>Build system – You can either build temporal camps to store found loot, or huge bases for you and your personal faction.<br/><br/>Combat – The combat system is designed more for stealth or fighting from ambush. Attack on the forehead is not so rational. Also you can take your friends in the fight or hired NPCs. If you are a solo player you can crouch and sneak your way past enemies or throw objects to distract them.<br/><br/><br/><br/>Huge expanses of Lost Region are fully open and how explore them is up to you.<br/>You can explore world by yourself or with your friends, gather resources and build camps or bases, craft, hunt, run NPS missions, fight with other players, arrange raids on their bases or even capture their buildings to raise your influence in world.<br/>World covers approximately 64 sq. km. with vast forests, big city, and underground locations.<br/>The world population will react to your actions. If you injure NPCs, their attitude towards you will get worse and vice versa, by assisting and completing missions of fractions you will increase your authority.<br/>Also, your relationship with the factions of the other players will be affected in many ways on the game.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:58:21", "background_image": "https://media.rawg.io/media/screenshots/764/764dc38ab7532b86cd12f1b010decd77.jpg", "website": "https://www.faromstudio.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 5, "toplay": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 517, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Farom Studio"], "genres": ["Action", "Adventure", "Strategy", "Simulation", "Massively Multiplayer"], "publishers": ["Farom Studio"], "esrb_rating": null}