{"id": 611097, "slug": "lundi-4-decembre-2084", "name": "Lundi 4 décembre 2084", "name_original": "Lundi 4 décembre 2084", "description": "<p>Un jeu narratif par Bérenger Scheuer &amp; Hélène Sellier</p>\n<p>En tentant de définir des structures vidéoludiques ouvertes permettant l’expressivité du joueur ou de la joueuse, notamment par l’usage de la procéduralité et de l’aléatoire, Rémi Cayatte (2021) explique que « des aberrations » apparaissent et que « c’est à l’utilisateur de prendre le relais pour faire fonctionner le contenu de jeu, pour y injecter du sens ». Dans le cadre de la Paper Jam « Aberrations Numériques » et dans une démarche de recherche-création, inspirés de travaux en Narrative Design sur les modèles de conversation, nous avons voulu créer un jeu qui exploite l’idée de bug narratif et utilise l’esthétique du glitch à travers la représentation de ces étrangetés numériques que sont les IA.  \r\n</p>\n<p>Le jeu se veut ainsi traiter de l’aléatoire à plusieurs niveaux : \r\n</p>\n<ul><li>Thématique, en parlant IA\r\n</li><li>Visuel, en utilisant l’esthétique du glitch  \r\n</li><li>Sonore, en utilisant des sons déformés\r\n</li><li>Narratif, en incitant la machine à produire des récits incohérents\r\n</li><li>Structurel, en proposant un code non-optimisé et peu commenté\r\n</li></ul>\n<p>Le jeu consiste en une conversation par visio pendant laquelle le joueur ou la joueuse doit déterminer si l’IA qui se trouve en face est défaillante ou non. L’interrogatoire est découpé en 20 phases pendant lesquelles alternativement, le joueur ou la joueuse puis l’IA pose une question et écoute la réponse. Les questions et les réponses pendant cet échange sont en partie déterminées aléatoirement. Les potentielles répétitions participent à la création d’un effet d’étrangeté. De plus, aléatoirement aussi, les images des caméras de l’avatar et de l’interlocuteur peuvent glitcher et des sons étranges peuvent être entendus. Pendant l’échange, progressivement, le joueur ou la joueuse peut (ou non) se rendre compte que son avatar est aussi une IA qui fonctionne mal. Au bout des 20 rounds, il y a trois fins possibles. Si l’avatar a glitché plus de 8 fois, il est arrêté et va être reprogrammé. Si ce n’est pas le cas, le joueur ou la joueuse doit décider si son interlocuteur est une IA défaillante ou non. Si c’est le premier choix qui est fait, l’avatar glitch avant que le jeu s’arrête. Sinon, la partie est directement finie. \r\n</p>\n<p>L’aléatoire prend deux formes (avec un poids sur chaque item ou non) et porte sur : \r\n</p>\n<ul><li>les questions que peut poser le joueur ou la joueuse\r\n</li><li>les réponses données par l’interlocuteur\r\n</li><li>les questions posées par l’interlocuteur (à deux niveaux)\r\n</li><li>les images affichées à l’écran\r\n</li><li>les bruits émis \r\n</li></ul>\n<p>Outils utilisés:\r\n</p>\n<p>Ren’Py\r\n</p>\n<p>MetaHuman\r\n</p>\n<p>Photoshop\r\n</p>\n<p>https://photomosh.com/\r\n</p>\n<p>https://freesound.org/ \r\n</p>", "metacritic": null, "released": "2021-05-29", "tba": false, "updated": "2021-05-31T07:13:54", "background_image": "https://media.rawg.io/media/screenshots/779/77999105598bff21b16e5ca50695c14c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 10, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ln_sellier"], "genres": [], "publishers": [], "esrb_rating": null}