{"id": 611000, "slug": "death-saw-challenge-commodore-64", "name": "Death Saw Challenge [Commodore 64]", "name_original": "Death Saw Challenge [Commodore 64]", "description": "<p>This game mysteriously disappeared last week, due to accidental deletion. Now this game has been restored.</p>\n<p>Death Saw Challenge is a Public Domain C64 hi score attack game which was made for Halloween. 2020. It is a really spooky game, which may not be suitable for all game players,  due to the horrid nature of the game. - Although it was just made for fun anyway :)<br/><br/>Death Saw Challenge is compatible with theC64, and also both PAL and NTSC machines. <br/><br/><strong>Scenario</strong><br/></p>\n<p>You have been thrown into a deadly and bloody dungeon. Your chance of survival is very slim. You have been given a challenge which is to run around the arena and survive for as long as you can scoring as many points where possible. You will not be alone, because out from nowhere, a siren will  go off and shortly later, out  comes a deadly saw blade. After the seventh blade ... ooer :)<br/></p>\n<p>How long can you survive the DEATH SAW CHALLENGE?<br/><br/><strong>Credits:<br/><br/></strong>Code, graphics, sound effects and music by <br/><strong>Richard Bayliss<br/><br/></strong>Tape loader<strong> source by<br/></strong><strong>Martin Piper</strong><br/><br/><strong>(C)2020 The New Dimension<br/></strong>This production is okay to be copied, but is not okay to be sold in digital or physical format without permission from TND Games. TND Games is NOT a business or a company. We like to create and develop games on C64 for fun. <br/></p>", "metacritic": null, "released": "2021-05-29", "tba": false, "updated": "2021-05-31T06:46:27", "background_image": "https://media.rawg.io/media/screenshots/77a/77aee9061e0419c666be47f2947fdb74.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 121, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Richard of TND"], "genres": [], "publishers": [], "esrb_rating": null}