{"id": 61119, "slug": "animyst", "name": "Animyst", "name_original": "Animyst", "description": "Explore and dominate in a new kind of Player Vs. Player sandbox experience. Scavenge a desert infested with ruins and combine secret items to make your own personalized load-out of magic spells and armor. There are no rounds or matches, just a growing world to learn in your search for player blood.<br/>\n<br/>\r\nWith multiple updates directly influenced by player feedback, come join the discussion and experience Animyst as it evolves into a full PVP MMORPG unlike any other.<br/>\n<br/>\r\n-Gear up and get ready to fight quickly, without a grind.<br/>\r\n-Perpetual open world.<br/>\r\n-Craft powerful spells from gathered ingredients.<br/>\r\n-”Reduced-Rage” Partial Full-Loot System: Players drop only equipped items on death.<br/>\r\n-No classes. No champions or heroes.  Freely customize your character's abilities.<br/>\r\n-Easy and unique local speaking system.<br/>\r\n-No quests. No hints.  Explore and discover in a world where knowledge is power.<br/>\r\n-Craft and place towering stone structures and ruins.<br/>\n<br/>\r\nCome experience the future of PVP, drawing from the best in battle royale and persistent world survival games.  This game will be receiving numerous frequent updates to add more content including spells, building pieces, clothing items, as well as, many gameplay enhancing changes and visual updates.", "metacritic": null, "released": "2018-07-02", "tba": false, "updated": "2019-08-23T12:11:51", "background_image": "https://media.rawg.io/media/screenshots/d22/d223a2a1753b0ef5bc163ea11cf93dcd.jpg", "website": "http://www.animystmmo.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 212, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Animyst Games"], "genres": ["Indie"], "publishers": ["Animyst Games"], "esrb_rating": null}