{"id": 611161, "slug": "i-am-a-vague-rainbow", "name": "I am a vague rainbow.", "name_original": "I am a vague rainbow.", "description": "<p>Your aim is to try to unscramble after scrambling the balls. My aim is to find out what the puzzle toy that I played with when I was little was.</p>\n<p>And thanks to maladroit, I now know that the physical puzzle is called Atomic Chaos. Power of Post! The web is a marvellous place. If only I knew more people.<br/></p>\n<p>X to select which half to rotate.</p>\n<p>Up/Down to rotate the selected half.</p>\n<p>Left/Right to shift balls.</p>\n\n<p>I was given a puzzle toy to play when I was little and I failed to solve it. I would like to know what the toy was so that I can try solving it again. Due to my vague memory, I don't remember how it worked. This Puzzlescript game is to the best of my knowledge.</p>\n<p>There were 5 - 7 transparent tubes of different lengths mounted on a central axis lengthwise. There were two parts and one could rotate the parts separately. Initially each tube contained balls of a single colour. One could roll the balls to the other end of the tubes and via twisting the tubes with respect to the axis one could thus mix up the balls. One was supposed to resort the coloured balls after scrambling. As implemented here, I do not see the operations being invertible, so I do not know this is solvable yet. Anyhow I don't know if the original toy worked like this or not, because my memory is vague...<br/></p>\n<p>I have asked around and googled to no avail. Please let me know if you have any clue. Thank you in advance!<br/></p>", "metacritic": null, "released": "2021-05-29", "tba": false, "updated": "2021-05-31T07:28:54", "background_image": "https://media.rawg.io/media/screenshots/7fc/7fc61ea22a6766e7446742b36869c7c5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 4, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["heiegg"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}