{"id": 611209, "slug": "stardust-kingdoms-crying-moon", "name": "Stardust Kingdoms: Crying Moon", "name_original": "Stardust Kingdoms: Crying Moon", "description": "<p>NOTE: Be sure to download the file that correlates to your operating system.</p>\n\n<p>\"Many years ago, in the frontier called Trinity Isles, a magical pendant called the Amulet of Light was created, allowing whoever wears it to manipulate the cycle of night and day. For 1000 years, the Order of Light hid it away in the Mirror Tower. However, recently, the tower was overran by vampires, who are in search of a way to break through their final defenses. It is up to you to save the Amulet and the world!\"<br/></p>\n<p>Explore an open world with over 20 enemies, dozens of NPCs, various quests, and epic weapons, armors, and spells to use! Build your character how you please with Perk Tokens, use various spells to summons weapons or provide light, and use magic stones to enhance your weaponry!</p>\n<p>Made with a retro style in mind, inspired by the original Elder Scrolls game \"Arena\", the original DOOM, and other games of that era.</p>\n<p>Installing and running:</p>\n<p>All you need to do is unzip the file you downloaded.</p>\n<p>For Windows, simply run the \"Crying Moon.exe\" file found inside.</p>\n<p>For Mac, once you have dragged SKCM into the Application folder, you may or may not have to use the following command as an Admin to gain permissions to run the game: \"<strong>sudo chmod -R 755 </strong>(insert application directory)\". You can insert the game's directory by simply dragging and dropping it into the Terminal window.</p>\n<p>For Linux, you may have to tick the game to be an executable.</p>", "metacritic": null, "released": "2021-05-28", "tba": false, "updated": "2021-05-31T07:41:12", "background_image": "https://media.rawg.io/media/screenshots/526/52612a63eab27a344dbca7720ac69c06.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 19, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["The Mattbat999"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}