{"id": 61137, "slug": "them-us", "name": "Them & Us", "name_original": "Them & Us", "description": "<p>Them &amp; Us is a hardcore, survival horror game with a focus on atmosphere and player immersion.The Story:<br />\nThe year is 1978 A lone bus, A terrible crash, out upon the old and winding dirt roads which skirt a vast American wilderness. A survivor. A young woman, her mind scarred by a life of tragedy, her name is Alicia. She is alone. She is injured. And around her, quietly, slowly, a surreal and deadly nightmare unfolds.<br />\nFighting for her life, Alicia she finds herself in the midst of events she does not understand- a ‘change’ taking grip on the world around her. It’s nature, it’s cause, unknown.<br />\nAs night descends, as she pushes further into the unknown - Will she survive? Will you?Key Features:<br />\nType: Third person view / Mixed camera view<br />\nStunning &amp; Smooth: Beautiful graphics running at 60 frames per second.<br />\nBlood &amp; Gore: Fully dismemberment system, cut them, dismember them, set their limbs flying.<br />\nDiscover: Explore and find the mystery behind Silent Grove.<br />\nPuzzles: Solve different puzzles to proceed forward on your journey.<br />\nSurvive: With limited resources at your disposal, fight to survive.<br />\nRun, Hide or Fight: The dead are not the only enemy here. Watch out!<br />\nLearn: Practice and learn how to use different weapons, and craft objects to use.<br />\nSneak: Use stealth and the environment to your advantage.<br />\nRemember:  Collect reminders to trigger clues to your past.<br />\nFight Your Darkest Nightmares:  Your mind is scarred by a life of tragedy, discover what drives you on....</p>", "metacritic": null, "released": "2021-09-29", "tba": false, "updated": "2023-02-11T19:57:22", "background_image": "https://media.rawg.io/media/screenshots/0a0/0a0e840346b3e4663248c1d59802b009.jpg", "website": "https://www.tendogames.com/themandus/", "rating": 3.55, "rating_top": 4, "added_by_status": {"yet": 13, "owned": 63, "beaten": 8, "toplay": 14, "dropped": 2, "playing": 1}, "playtime": 5, "achievements_count": 23, "ratings_count": 11, "suggestions_count": 473, "game_series_count": 0, "reviews_count": 11, "platforms": ["PC"], "developers": ["Tendogames"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Tendogames"], "esrb_rating": null}