{"id": 611406, "slug": "tower-domination", "name": "Tower Domination", "name_original": "Tower Domination", "description": "<p><em>Tower Domination</em> is a roguelike deck-builder game. The gameplay relies on various encounters with enemies, where players will have to use their cards to win those same battles - necessary to move forward - to always reach the most desired point, while also upgrading their deck.<br/></p>\n<p>\r\n  The design of this game relies mostly on the deck-building component, inspired by games like <em>Slay the Spire</em>. However, for the player to acquire the cards they can use to make up their deck, a system like that of the game <em>Dominion</em> will be used, in hopes of giving this component of the game a less random feel. However, there will be other random events and items, but they are not connected to the deck building aspect - or at least not directly and in a very impactful way.</p>\n<p><strong>Backstory:</strong></p>\n<p>\n</p>\n<p>After the prayer to the God of War, due to the full moon, the entire population headed for their dwellings. Night thus fell in <em>Turrim</em>.\r\n  </p>\n<p>A night that did not look turbulent. It all started when the Vigilant Protector, responsible for the night watch, decided to abandon the Tower in the middle of the night. A decision agreed upon a few days earlier with a great enemy - BOSS - who threatened the Watcher's family if the latter did not help him. A threat that made him relive the past when his community was brutally attacked by humans. Fear thus ended up overriding his mission and gratitude to <em>Turrim</em>. And so, the Vigilant resigned himself to helping the BOSS to invade the city secretly and passively.</p>\n<p>The plan was as follows: The Vigilant would provide a map of the city, so that the BOSS could enter and circulate at will, without getting lost. The BOSS would wear a black cloak, with a hood that covered his face, and would enter the city through the <em>Sanctus</em> river. Meanwhile, the Vigilant would go about his work naturally and quietly, and as soon as the moon is in the center of the sky, he would leave the Tower at his mercy. The BOSS, on the other hand, without making noise or risky movements, would roam the streets like a ghost, until he reached the Tower. Once in the Tower, it would claim <em>Turrim</em> as its own. And everything happened as planned.</p>\n<p> As this mission aims, you will be forced to face fights with all enemies, which you will have to defeat, using a deck of cards. The objective is to reach the Tower, where they will face the BOSS. By winning this final combat, not only will they recover the city, but the player himself will be able to move on to the next level.</p>\n<p><strong>Controls: </strong><br/></p>\n<ul><li>Left-Click -&gt; Play/Buy Card</li><li>S - Open Shop</li><li>Escape - Options Menu</li></ul>\n<p><strong>Symbol cheat-sheet:<br/></strong></p>\n<p>The enemies you will face will have different actions. Each icon symbolizes the action the enemy will make in the next turn, followed by a number X indicating the power of the action.<br/></p>\n<p>The enemy will attack you and deal X damage.<br/></p>\n<p>The enemy will heal itself X amount of health points.<br/></p>\n<p>The player will receive 1 injury card.<br/></p>\n<p>The enemy will block the next X damage in the following turn.<br/></p>\n<p>The enemy will idle.<br/></p>\n<p>Player icons:<br/></p>\n<p>The amount of damage the player will block this turn.<br/></p>\n<p>The amount of treasures you earned this turn.<br/></p>\n<p><strong>Playtesting:</strong><br/></p>\n<p>This prototype experiences the first floor of the tower, which depicts the city grounds. You can play as many runs as you like and if you defeat the Boss ( final level), you win the game.</p>\n<p>After the playtesting, we would be thankful if you could upload the files existent in the Logs folder, inside the game folder into this drive :</p>\n<p>https://docs.google.com/forms/d/e/1FAIpQLScFGoGiAN9x224li3AqXzYvCWo5JtexYMbpcBR231sEFSZ6MA/viewform?usp=sf_link<br/></p>\n<p>We would also be thankful if you could answer the following questionnaire about the gameplay experience : </p>\n<p>https://docs.google.com/forms/d/e/1FAIpQLSfujCUNybgbKk524YDPSCfPu2Q5KuJ1KnT9FxP8...</p>\n<p>This will provide important information and feedback about the game and what were the problems.</p>\n\n<p>Development Team</p>\n<ul><li>Hélio Martins</li><li>Miguel Malheiro</li><li>Paulo Alexandre</li></ul>\n<p>Art Team</p>\n<ul><li>Ana Oliveira</li><li>Beatriz Marques</li></ul>\n<p>Writing Team</p>\n<ul><li>Marta Pimpão</li></ul>", "metacritic": null, "released": "2021-05-28", "tba": false, "updated": "2021-05-31T08:36:19", "background_image": "https://media.rawg.io/media/screenshots/b06/b0608403e7a92cd3decf38df64710699.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 30, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["pnaa", "Helio Martins", "Maldracus"], "genres": [], "publishers": [], "esrb_rating": null}