{"id": 611445, "slug": "eyes-of-souls", "name": "Eyes Of Souls", "name_original": "Eyes Of Souls", "description": "<p><em>Hello!\r\n</em></p>\n<p><em>Eyes of Souls is a semi-linear LGBT Furry Visual Novel that focuses on magic and society.\r\n</em></p>\n<p><em>Let me introduce you to the characters!</em></p>\n<p>1. <strong>Wen Long Xi (温龙西) \r\n</strong></p>\n<p><em>The main character. The whole story revolves from the point of view of this guy. </em></p>\n<p><em>A Chinese Dragon that has exceptional abilities in magic, especially traditional magic.  Due to complications, he is visually impaired and cannot see the world properly through light. Instead, he sees magical energy, or what he likes to call \"Aura\" of everything through his eyes. </em><em>He uses glasses to supress his \"Aura Vision\". He says that he gets dizzy easily if he uses his \"Aura Vision\" 24/7.\r\n</em></p>\n<p><em>Abit mysterious at rare times. Always laid back and calm, but always rational, cares for the person that respects and cares for him and thinks first before doing anything. Though... sometimes might overthink useless stuff, and go on either a lecture or a rant</em><em>. If left alone for long periods of times, he can be abit hyperactive.</em>\n<br/></p>\n<p>2. <strong>Ren Excel Gloria</strong>\n</p>\n<p><em>A Black Wolf specializing in thermonuclear magic. (Yes, there are physics and science in this universe too).</em></p>\n<p><em>Always light hearted. A little forgetful at times. Tries to be positive whenever he can, but he can come off as light-headed at times.  Though, when times asks him to be serious, he can. And you definitely don't want to anger this guy. </em><br/></p>\n<p>3. <strong>Lien Hexagria<br/></strong></p>\n<p><em>A Canine (He would not rather specify) Spirit that specializes in mind manipulation, and spiritual magic.<br/></em></p>\n<p><em>Loves fighting strong opponent., Always have respect for those who are strong. Though he might have abit of a superiority complex, he always pity those who is weak. Have a small anger issue, and holds a grudge against person he dislikes. Always \"brings\" his trusty gun and pet \"dog\" everywhere.  Despite being a fight junkie, inside he's abit of a nerd and loves playing video games.<br/></em></p>\n<p><em>It is advised for you to not ever mention his last name, if possible. </em>\n<br/></p>\n<p>4. <strong>Gunho Armeria\r\n</strong></p>\n<p><em>A Raccoon Dog (Tanuki) that has an unique talent to read one's mental state and visualize it. Though he seems to be oblivious to these visualization. Specialized in light magic and illusion magic. <br/></em></p>\n<p><em>A shy, yet sympathetical person. Can be childish and naive at times, despite his age. Don't let his appearance fool you. Prefers to be silent, but knows how to talk clearly when he needs to. Sometimes, if backed into a corner, can come off as sadistic, and empty headed. Can use magic to psychologically break someone</em><em> through hallucinations, fear, and nightmares. </em><br/></p>\n<p>4. <strong>Yoel Artemisia<br/></strong></p>\n<p><em>A Giant Sumatran Tiger, mostly work as a travelling blacksmith and uses Friction, and Density manipulation magic. <br/></em></p>\n<p><em>A straightforward, and no nonsense guy. Have an unnatural strenght and can easily break hard materials with bare hands if not careful. Always talks in really short sentences. Dislikes useless chit-chat. Very reserved and silent. Quite monotone, but can be expressive when he's with close friends. Mumbles in a different language when he's alone most of the time. A good listener. </em><br/></p>\n<p> </p>\n<p><strong><em>Short Summary: <br/></em></strong></p>\n<p><strong><em>A peaceful, small rural town. But is it truly peaceful? War, History, and Society. Knowledge, Pilosophy, and Magic. All of those looms over the town and the world. Will the world survive? Or will it just crumble little by little, until nothing is left?<br/></em></strong></p>\n\n<p>A/N: </p>\n<p>This Visual Novel is a passion project, it will be 100% free when completed. However, please do note that the updates are going to be inconsistent since i am still focusing on my studies, and the artist of this Visual Novel (@DeignasTen on Twitter) doesn't have 24/7 free time to work on it. <br/></p>\n<p>There's a total of 6 chapter including prolouge and an epilouge (The epilouge depends on who you you are the most closest to). </p>\n<p><strong><em>Disclaimer: minor epilepsy warning and a minor graphic warning. </em></strong></p>\n<p>Credits: </p>\n<p>Artist: Deignas Ten</p>\n<p>https://twitter.com/DeignasTen</p>\n<p>Writer: Mielium/Mikairium (Both are the same guy, just different names. Due to privacy reasons i have 2 fake names.) </p>\n<p>https://twitter.com/RielStudios <strong>/ </strong>https://www.instagram.com/mikairium/ <br/><br/></p>", "metacritic": null, "released": "2021-05-28", "tba": false, "updated": "2021-05-31T08:46:44", "background_image": "https://media.rawg.io/media/screenshots/9cb/9cb004ed967370b42c19cada8aa6012b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 16, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Riel VN Studio"], "genres": [], "publishers": [], "esrb_rating": null}