{"id": 611594, "slug": "power-of-ten", "name": "Power of Ten", "name_original": "Power of Ten", "description": "<p>A single star fighter trying to save as many civilians as possible before they are overrun by a marauder armada.</p>\n<p>You&#39;ll need to gather new weapons, upgrade your ship, find resources, trade with other ships and more to overcome the challenge before you. Each run is a uniquely created journey where you&#39;ll utilize your flight skills and strategy you&#39;ve built over many runs to crush the challenges ahead.</p>\n<p>Features<br />\n7+ unique playable ships you can discover and unlock.<br />\nProcedurally crafted star systems, every run is uniquely challenging<br />\nDozens of unique and powerful weapons, items and upgrades to find, equip and progress your fighter<br />\nWeapon hybrid system that allows for hundreds of unique combinations of weapons<br />\nDozens of challenging and diverse enemy ships to test your flight skills. You&#39;ll never know what you&#39;ll face next!</p>\n<p>Gather resources to power up shield generators to save civilians<br />\nFind special events and secrets hidden in the stars<br />\nTrade with roaming star ships to increase your odds of success<br />\nImmersive blend of pixel art and procedural generated art to create beautiful galaxies<br />\nThree unique regions to progress through, each with unique vibes, character and mechanics to discover</p>", "metacritic": null, "released": "2021-06-03", "tba": false, "updated": "2023-06-03T22:53:44", "background_image": "https://media.rawg.io/media/screenshots/c96/c9635698d6f0bf52b426c9a1578014d6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 26, "toplay": 3, "dropped": 1}, "playtime": 2, "achievements_count": 48, "ratings_count": 1, "suggestions_count": 170, "game_series_count": 0, "reviews_count": 1, "platforms": ["macOS", "PC"], "developers": ["Pew Times Three"], "genres": ["Action", "Indie"], "publishers": ["Pew Times Three"], "esrb_rating": null}