{"id": 61152, "slug": "green-hell", "name": "Green Hell", "name_original": "Green Hell", "description": "<p>GREEN HELL is an Open World Survival Simulator set in the uncharted unique setting of the Amazonian rainforest.</p>\n<p>You are left alone in the jungle without any food or equipment, trying to survive and find your way out. Clinging to life, the player is set on a journey of durability as the effects of solitude wear heavy not only on the body but also the mind. How long can you survive against the dangers of the unknown?</p>\n<p>On this journey, you won’t get any help from the outside world. Equipped only with your bare hands you’ll have to learn actual survival techniques to build shelters, make tools, and craft weapons in order to hunt and defend yourself. Constantly threatened by the jungle you’ll fight with both wild animals and tropical sicknesses. Players will also have to face the traps set by your own mind and fears that crawl in the darkness of the endless jungle.</p>\n<p>STORY</p>\n<p>You are thrown deep into the emerald and impenetrable Amazonian rain forest. The green hell. Your goal is to survive in the depths of a nightmarish environment using truly intuitive means to escape. Having only a radio at your disposal you will follow the familiar voice of a loved one through this endless and inhospitable jungle, unveiling bit by bit how you got there in the first place. What you discover will be worse than what you fought so hard against to survive.</p>\n<p>THE QUESTION</p>\n<p>Where can the human mind wander?</p>\n<p>GAME PILLARS</p>\n<p>REALISTIC SURVIVAL SIM</p>\n<p>• Use of true survival techniques (including starting fires, camp building, animal traps construction)<br />\n• Sourcing and composing objects allowing survival (including weapons and tools)<br />\n• Food sourcing (hunting, cropping)<br />\n• Wound, disease and other injuries treatment, depending on the situation</p>\n<p>PSYCHOLOGICAL THRILLER</p>\n<p>Green Hell&#39;s story emphasizes psychological aspects of survival in extreme conditions. The player faces a ruthless situation, isolated, and fighting to survive another day. The players battle will not only be against the environment as you fight to keep your sanity. Will you succeed or fall into the depths of your mind? To unveil the truth the player will have to fight the hardest battle they will ever fight - the fight against themselves, their weaknesses and fears.</p>\n<p>AMAZONIAN RAINFOREST SETTING</p>\n<p>Amazonian rainforest is the richest natural environment in the world. Exotically breathtaking, spectacular, multicolored, full of tones and sounds but mortal, deadly, uncompromising for the ignorant.</p>\n<p>• Part of the Amazonian rainforest as a map of the world for the setting<br />\n• The richness of plants and multitude of animal species (mammals, reptiles, birds, and insects)<br />\n• Simulation of animals natural occurrence and behavior<br />\n• Dynamically changing environment due to the weather</p>\n<p>UNIQUE MECHANICS</p>\n<p>Survival in such extreme conditions requires willpower - without it we are sentenced only to madness and death. In green Hell, your wellbeing, both physical and psychological, are strictly related. Body inspection mode allows the player to diagnose themselves and heal their body. In this mode, we can also remove all kinds of parasites that decided to make a home out of your body.</p>\n<p>Psychophysical parameters of the player include:</p>\n<p>• psychological condition<br />\n• physical condition</p>\n<p>UNIQUE FEATURES</p>\n<p>• Setting: deadly yet beautiful Amazonian rainforest<br />\n• Body inspection mode<br />\n• A multitude of fauna and flora and the dangers awaiting the player<br />\n• Environment and situation impact on the player’s psychology<br />\n• Impact of environment changes to the ecosystem<br />\n• An addictive story<br />\n• Dynamically changing environment</p>", "metacritic": 78, "released": "2018-08-29", "tba": false, "updated": "2024-04-09T00:42:50", "background_image": "https://media.rawg.io/media/screenshots/afa/afafe78f1c6356cc423b1ec9a68f9c7d.jpg", "website": "http://www.greenhell-game.com", "rating": 3.77, "rating_top": 4, "added_by_status": {"yet": 49, "owned": 711, "beaten": 61, "toplay": 58, "dropped": 65, "playing": 15}, "playtime": 6, "achievements_count": 162, "ratings_count": 120, "suggestions_count": 374, "game_series_count": 0, "reviews_count": 121, "platforms": ["Xbox One", "PlayStation 4", "PC", "Nintendo Switch"], "developers": ["Creepy Jar"], "genres": ["Action", "Adventure", "Simulation", "Indie"], "publishers": ["Creepy Jar"], "esrb_rating": null}