{"id": 611637, "slug": "loot-slider", "name": "Loot Slider", "name_original": "Loot Slider", "description": "In Loot Slider, your goal is to get treasure chests to their correct locations on grid-like levels. To accomplish this, you place and aim cannons, making sure that they fire and push chests in correct order.<br/><br/>As you get further, new environments with more types of cannons and obstacles are introduced. Depending on how good of a solution you find on a level, you either get 1, 2 or 3 stars. The ultimate goal of the game is to get all 168 stars.<h3>Key Features</h3><ul><li><strong>Tricky puzzles</strong><br/>Loot Slider challenges you to figure out where to place cannons, in what direction to aim them and in what order they should fire. This creates a ton of variety, and lots of tricky levels.<br/><br/></li><li><strong>Relaxing gameplay</strong><br/>You can take as much time as you need to solve a level, and you can try as many times as you want. Loot Slider also has nice and soothing background music.<br/><br/></li><li><strong>Clever mechanics</strong><br/>As you get further in the game, new cannons are introduced - the Repeater and Heavy Cannon. Each new world comes with its own set of unique obstacles, such as totems, ice and lava cracks, furthering the variety in the game.<br/><br/></li><li><strong>Star collection</strong><br/>Getting all 3 stars in a level is usually challenging to figure out, but you're going to have to do it if you want all 168 stars in the game. But if you can't figure out the optimal solution for a level, you can just go for 1 or 2 stars and beat the game anyway. And you can always come back later to any level if you wish to retry it and find a better solution!</li></ul>", "metacritic": null, "released": "2021-06-01", "tba": false, "updated": "2021-06-04T03:11:03", "background_image": "https://media.rawg.io/media/screenshots/c9c/c9cfa8b6121fc2c8f9ed226673fcdb87.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 132, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Retrofied Games"], "genres": ["Casual"], "publishers": ["Retrofied Games"], "esrb_rating": null}