{"id": 611666, "slug": "legacies-2", "name": "Legacies", "name_original": "Legacies", "description": "Conservation. Sabotage. Stealth.<br/>\n<br/>\r\nTake control of a submarine and disrupt the forces that seek to plunder the ocean for wealth. Sabotage engines, steal information by hacking into secret radio channels, defend and heal dying ocean life. <br/>\n<br/>\r\nYou're a pilot and this is wartime, but our enemies are not other nations, and your weapons are unconventional. Use the ocean to fight its oppressors - plant shark pheromones to prevent illegal divers from poaching and fishing. Place destructive barnacles on the boats of your enemies to degrade their hulls. Sometimes, you may have to resort to using good, old-fashioned explosives to disrupt the efforts of profit-seekers lacking a conscience for the loss of ocean life. <br/>\n<br/>\r\nPilot through the depths as Max, a blind young adult who just lost his estranged mother. In possibly the strangest inheritance in history, all she left him was this old submarine. Retrace her steps as an ecological vigilante and team up with fellow crusaders, Roger and Bazza.<br/>\n<br/>\r\nThe immersive underwater environment is shown through the stunning colours and visual effects as well as through the strangely calming rush and flow over water around the walls of your sub in the deep ocean. Serene, beautiful, and dangerous. <br/>\n<br/>\r\nThe game supports its' stealth based gameplay through sound: as you pilot through shark infested waters, or slink over the ocean floor to remain undetected, the submarine's audio-based sonar system assists your journey. Listen closely and learn of dangers that you might not see on screen.<br/>\n<br/>\r\nJoin Max as he reconnects with his mother, protects the ocean and heals himself.", "metacritic": null, "released": null, "tba": false, "updated": "2021-06-04T03:31:25", "background_image": "https://media.rawg.io/media/screenshots/d5b/d5b7e855d7b0d0cb0cb56e2bf916aad8.jpg", "website": "https://legaciesthegame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 183, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Daisy Ale Soundworks"], "genres": ["Indie"], "publishers": ["Daisy Ale Soundworks"], "esrb_rating": null}