{"id": 611754, "slug": "american-truck-simulator-usa", "name": "American Truck Simulator USA", "name_original": "American Truck Simulator USA", "description": "Drive a real truck in American Truck Simulator USA ! <br/>Become an American truck driver and show your driver skills.<br/> Choose cargo and drive it. Transport cargo to city warehouses.<br/> Upgrade your truck for better driving and earning more money. Fix and refuel an American truck at service stations, fuel station.<br/> Avoid driving cargo above speed limit, follow driving rules for the transport. Spend money wisely and enjoy day and night driving.<br/> Features of American Truck Simulator USA  : <br/>- Transport missions<br/>- Different cargo<br/>- Real USA trucks <br/>- Game economy simulator <br/>- Day and night transport driving <br/>- Truck service stations <br/>- Fuel service stations<br/>- Gas stations on the roadAmerican Truck Simulator USA  is for real truck drivers. <br/>THE USA IN YOUR POCKET. Explore a huge open world across North America. Start your career on the East Coast and unlock more states and cities as you progress. Discover narrow country roads, large highway intersections as well as farmland and desert regions, all created with attention to detail.<br/>Good transport controls help your be a driver in the simulator. Continue cargo driving even at night. Choose missions for your big USA truck. Spend your evening on the road, driver! Be accurate American cargo truck driver. Keep your transport in good condition for executing more missions. Feel what is American road in American Truck Simulator USA . Upgrade the transport, prepare it for road, the simulator is challenging for you.<br/><br/><br/>Privacy Policy:<br/>https://vitpavad.xyz/privacy.html<br/>Terms and conditions:<br/>https://vitpavad.xyz/terms.html", "metacritic": null, "released": "2021-05-22", "tba": false, "updated": "2021-06-04T04:42:27", "background_image": "https://media.rawg.io/media/screenshots/77a/77ab9e49975c4e71ca6c537ae52fc9b6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 142, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Victor Paiu"], "genres": ["Simulation", "Racing"], "publishers": ["Victor Paiu"], "esrb_rating": "Everyone 10+"}