{"id": 61176, "slug": "bloodstained-ritual-of-the-night", "name": "Bloodstained: Ritual of the Night", "name_original": "Bloodstained: Ritual of the Night", "description": "<p>Bloodstained is an exploration-focused, side-scroller action RPG packing all of the best features you&#39;ve come to know and love from the Metroidvania genre into a single, content-packed game.<br />\nPlay as Miriam, an orphan scarred by an alchemist’s curse which slowly crystallizes her body. In order to save herself, and indeed, all of humanity, she must battle her way through a demon-infested castle summoned by Gebel, her old friend whose body and mind has become more crystal than flesh.<br />\nWHAT&#39;S IN THE GAME?<br />\n- Addictingly tight and satisfying gameplay alongside a rich new story in the gothic dark fantasy style of Koji Igarashi, the celebrated godfather of &quot;Igavania&quot; games.<br />\n- A game soundtrack by genre and industry veteran Michiru Yamane, performed by a full live orchestra ensemble.<br />\n- Story cut scenes and NPC interactions fully voice acted by a star-studded cast, including actors like David Hayter, Ray Chase and Erica Lindbeck to name just a few. (Seriously, we have a lot of voice acting star power in this game, it&#39;s kinda nuts...)<br />\n- A total of three playable characters, two of which have yet to be revealed...<br />\n- Literally a metric ton of weapons and spells, which you can upgrade, level up and visually customize.<br />\n- Beautiful 2.5D graphics: 3D models crafted with a lot of love and care on a 2D game environment. That means lots of cool tricks that &quot;regular&quot; 2D can&#39;t do...<br />\nWHEN?<br />\nWe&#39;re going to be revealing the release window of the game very soon.<br />\nTHE FUTURE<br />\nExpect a worryingly large amount of announcements and updates, everything from updating the look of this Steam page to the game in general. It&#39;s going to be one wild ride.</p>", "metacritic": 81, "released": "2019-06-18", "tba": false, "updated": "2024-04-08T03:31:07", "background_image": "https://media.rawg.io/media/games/26c/26cacc55399ed6b2c14e20d2eca0620a.jpg", "website": "https://505games.com/games/bloodstained", "rating": 4.01, "rating_top": 4, "added_by_status": {"yet": 198, "owned": 2219, "beaten": 314, "toplay": 255, "dropped": 131, "playing": 58}, "playtime": 6, "achievements_count": 214, "ratings_count": 435, "suggestions_count": 637, "game_series_count": 2, "reviews_count": 443, "platforms": ["Xbox One", "Android", "iOS", "PC", "Nintendo Switch", "PlayStation 4"], "developers": ["505 Games", "Armature Studio", "Inti Creates", "Dico", "ArtPlay"], "genres": ["Action", "Adventure"], "publishers": ["505 Games"], "esrb_rating": "Teen"}