{"id": 611729, "slug": "shell-shockers", "name": "Shell Shockers", "name_original": "Shell Shockers", "description": "Shell Shockers is the world’s most popular egg-based multiplayer first person shooter! Take control of a heavily armed egg and battle real players across multiplayer maps in private or public arenas. The hit web FPS game comes to your mobile device for eggciting free-range action!<br/><br/>FREE TO PLAY ON MOBILE<br/><br/>Gear up with eight different weapons: Crackshot, Scrambler, Tri-Hard, Whipper, Free Ranger, Cluck 9mm and Eggk47. Then customize your eggatar with crazy hats, skins, colors and decals before taking the fight to your opponents!<br/><br/>CHOOSE YOUR GAME<br/><br/>Play in Free-For-Alls to take on all comers, or join Team mode to battle red vs blue… or try the zany Capture the Spatula mode, where you battle for possession of the amazing Spatula. Play on public servers around the world or create your own private game to play an eggciting shooting game with friends!<br/><br/>CROSS PLATFORM PLAY WITH WEB <br/><br/>Keep your account from the io web game and play cross-platform battles with your friends on desktop or laptop devices! <br/><br/>EARN GOLDEN EGGS<br/><br/>Score golden eggs as you destroy your enemies, then spend them on hundreds of different gun skins, grenades, hats, decals and other flair for your eggatar. Be the best-dressed egg around!<br/><br/>COMPETITIVE AND SOCIAL PLAY<br/><br/>Join millions of worldwide players in a global community of Shell Shockers! Have what it takes to compete with the best? Download Shell Shockers mobile now.<br/> <br/>Note: An internet connection is required to play this game.", "metacritic": null, "released": "2021-05-27", "tba": false, "updated": "2022-11-15T02:42:57", "background_image": "https://media.rawg.io/media/screenshots/40f/40fb13537b53f4d838eaa026fd9cd7c8_ub7iQVG.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 92, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Blue Wizard Digital LP"], "genres": ["Action", "Casual"], "publishers": ["Blue Wizard Digital LP"], "esrb_rating": "Teen"}