{"id": 611770, "slug": "count-masters-crowd-clash-stickman-running-game", "name": "Count Masters: Crowd Clash & Stickman running game", "name_original": "Count Masters: Crowd Clash & Stickman running game", "description": "Choose the best gate, pass through it, and bring stickman warriors together to clash with the opposing crowd. Become the crowd master and lead your people through the crowded city till the end of this epic race. Crash obstacles and beat everyone on your way, collect coins and upgrade your levels. Defeat the King-stickman in the final battle and take the castle!<br/><br/>Looking for some fun and thrill? Then this 3d running game is just for you.<br/><br/>Count Masters is one of the most exciting clash games of all times! You start the battle alone but trust us: there are no chances for you to feel lonely.<br/><br/>This city takeover game features fascinating graphics and simple mechanics. You have a chance to get absorbed in the bright world of Count Masters full of gang fights and stickman battles. Get ready to spend hours playing one of the most thrilling running games. We promise: you won’t get bored! <br/> <br/>FEATURES:<br/>Dynamic race. You are not a simple runner but the boss of a whole crowd of stickmen. Gather your gang and lead them to the main clash of their life!<br/> <br/>Educational running game. Count, increase and multiply the runners in your team. Choose the right gate and win the most furious stickman fights.<br/> <br/>Fun race 3d gameplay. Simple, realistic, and competitive. Crush them all and become a master of the coin rush!<br/> <br/>Multiple levels with increasing difficulty. You’ll face a lot of challenges, but don’t worry: you have your stickman crowd to clash with the bitterest enemies.<br/> <br/>Perfect obstacle course game for the whole family!  Count Masters is a fun game for everyone and a cool time-killer for everyone. Download it now and escape from your daily worries for hours!<br/><br/>Enjoy this running game for free while we’ll be keeping a keen eye on your feedback to make it the best fun race ever. So we can’t wait for your review to hear what you think!", "metacritic": null, "released": null, "tba": false, "updated": "2021-06-04T04:51:54", "background_image": "https://media.rawg.io/media/screenshots/37e/37e1f00e5a39478fb1e13b9622b968c7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 55, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Freeplay"], "genres": ["Action"], "publishers": [], "esrb_rating": "Everyone"}