{"id": 611771, "slug": "3-tiles-tile-connect-and-block-matching-puzzle", "name": "3 Tiles - Tile Connect and Block Matching Puzzle", "name_original": "3 Tiles - Tile Connect and Block Matching Puzzle", "description": "Fond of different board games? Well, you’ve made the right choice – we have some excellent free match games right here! Mahjong+, tile master, different matching games, tile craft, mahjong games (even mahjong solitaire), and some popular tile games were combined together and thought over to get the perfect embodiment of a matching game. And behold, we’ve made it – the newest match 3 legend!<br/><br/>Join us on Instagram: https://www.instagram.com/3tiles_game/<br/>Join us on Facebook: https://www.facebook.com/3Tiles.game<br/><br/>3 Tiles is one of the newest free match 3 games. Most board games are suitable for casual entertaining, while memory match games help to relax after stressful studying and working hours. In matching games, you need to connect 3 similar tiles with vivid pictures, for instance, avocados, guitars, ice cream, sausages, and many other tiles with interesting items. Match triple items of the same type to pass the current level! <br/><br/>HOW TO PLAY A TILE MATCHING GAME? <br/><br/>Matching puzzle games can be tricky, but all tile games have some common connect game mechanics. After all, you still need to connect blocks with pictures, right? Most free match games have the same rules as free tile games. And here’s ours.<br/><br/>- Well, you should match 3 tiles! Match triple tiles to put them into the stack. Three similar tiles will be matched and removed from your tile stack. <br/><br/>- When the playing field is cleared, you win! Continue your tile match practice to become a real match master one day! <br/><br/>- You fail, if you don't get at least one merge for 7 tiles in your stack. Keep this reminder from our match masters: you have a maximum of seven moves to make one tile match. Each match block matters!<br/><br/>- If you want to get a high score in memory match games, you should merge those tiles faster to activate the score multiplier. <br/><br/>3 TILES KEY FEATURES:  <br/><br/>Every tile-matching game has unique game features and 3 Tiles is no exception! Let’s make the tile connect process fun again! So, what’s on the menu?<br/><br/>- No 3d match involved. Some games force players to match triple 3d tiles, and that can be really annoying, especially with those “flipping tiles” mechanics, that prevent you from seeing the picture on every tile. No need to match triple 3d objects here, everything is in the player’s sight!<br/><br/>- Each match block selection has a completely unique distribution on the board that surprises with variety - you have an extremely diverse gaming flow for each new level! The tile spread changes on every level, so you won’t get any “ordinary” tile connect pattern.<br/><br/>- You can play as you like! Whether it’s a fast-paced combo-rush or a meditative and thoughtful approach, you’ll find exactly what you want in 3 Tiles. This game suits all game styles! <br/><br/>- Offline availability. No need to worry about those matching puzzle games that require constant Internet or Wi-Fi connection – you can play in offline mode whenever you want it!<br/><br/>- Free matching games classics. 3 Tiles is the matching game for adults and the matching game for kids at the same time! The simple match block rules and relaxing gameplay mean that anyone can enjoy a round of 3 Tiles. <br/><br/>Let’s play!", "metacritic": null, "released": null, "tba": false, "updated": "2021-06-04T04:52:36", "background_image": "https://media.rawg.io/media/screenshots/1b8/1b84fa1b276636b51b9aa86a806468c7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 116, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["LiftApp"], "genres": ["Board Games"], "publishers": [], "esrb_rating": "Everyone"}