{"id": 611891, "slug": "granny-itch", "name": "Granny (itch)", "name_original": "Granny (itch)", "description": "<p>Welcome to Granny.<br/><br/>Granny keeps you locked in her house and she will not let you go.<br/>You wake up in a dark room, you have a headache and it feels like someone have hit you in the head.<br/>The only thing that lights up the room is your flashlight lying on a table.<br/><br/>The main door is covered with different locks and now you have to search the house and find keys and other objects to unlock the door and escape this house.<br/>But you have to be careful because Granny hears everything and if you drop something on the floor or walking on a creaking floor she will start running to the place she heard that sound.<br/>You also need to watch out for her bear traps and other things lurking in the dark, like her pets, for example.<br/>You can hide in wardrobes and coffins but be careful that she does not see you where you are hiding.<br/><br/>There is another way to escape.<br/>At the bottom of this house there is a garage. In the garage there is an old car. If you manage to start it and open the garage door you can escape that way.<br/><br/>You can protect yourself from Granny using one of the two different types of weapons you can find in the house. But it only stops her for a while. But it's worth it.<br/><br/>There are five different levels of difficulty.<br/>Extreme, Hard, Normal, Easy and Practice.<br/>If you play in Practice mode, you are in the house without Granny and have the opportunity to try different things without major difficulties. But the house is not completely free from dangers.<br/><br/>Granny gives you five days in the house but you can earn a extra day if you do something for her.<br/>If you have failed to escape after the last day... well, probably you can figure out what happens then.<br/><br/><br/>Good luck!</p>", "metacritic": null, "released": "2021-05-28", "tba": false, "updated": "2021-06-04T05:28:37", "background_image": "https://media.rawg.io/media/screenshots/172/1725c8e56a5454cfc481acfb48543411.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 285, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["DVloper"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}