{"id": 61195, "slug": "last-wood", "name": "Last Wood", "name_original": "Last Wood", "description": "<p>Last Wood is an open-world survival game.<br />\nIt is a world after The Apocalypse, continents disappeared mostly, meanwhile the rest turned to be pieces of islands.<br />\nYou will guide several survivors in the ocean from pieces of rafts, survive, build rafts, defense the threats, explore the unknown world, even have their offsprings, and find the truth of the world eventually.<br />\nLast Wood has a mixture of prescripted storyline and procedural generated content, manipulated by an intellegent AI storyteller.<br />\nYou could have different experiences every play.<br />\nSurvivors:<br />\nMeet survivors with diverse backstories, characteristics and specialties. Guide them to build and craft handworks to meet their needs of water, food, shelter. Help them develop skills, technology, and even relationships with each other.<br />\nThreats:<br />\nAnimals, raiders, deep ones, Kraken by building traps, equipments. Defeat your enemies with strategy and skill.<br />\nSettlements and Locations:<br />\nSail to settlements, make alliance or raid them for resources and slaves. Exploring ruins of the old world or mysterious shrine of other species. Find out the truth of The Apocalypse.<br />\nNature:<br />\nOvercome disasters such as storm or hailstone by loading your storage with supplies.<br />\nLast Wood was first a prototype on itch. We received amazing support from the community (~250k views so far). So we decided to put an Early Access version with tons of new contents in Q4 2018.</p>", "metacritic": null, "released": "2022-01-27", "tba": false, "updated": "2023-01-16T12:34:58", "background_image": "https://media.rawg.io/media/screenshots/43d/43d09508b5fb2b9fd0c96029d71436a4.jpg", "website": "https://lastwood.github.io/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 6, "toplay": 1, "dropped": 1}, "playtime": 2, "achievements_count": 48, "ratings_count": 2, "suggestions_count": 140, "game_series_count": 0, "reviews_count": 2, "platforms": ["macOS", "PC"], "developers": ["Just Us GameLab"], "genres": ["Adventure", "RPG", "Simulation", "Indie"], "publishers": ["Just Us GameLab"], "esrb_rating": null}