{"id": 6120, "slug": "starbase-command", "name": "Starbase Command", "name_original": "Starbase Command", "description": "From the creators of Starbase Orion, the premier 4X space strategy game for iOS, comes a space survival game that will have you firing your turrets and scrambling your fighters to protect your starbase from swarms of enemy invaders.<br/><br/>Starbase Command is a strategy game which puts you in control of a starbase on the fringes of the Empire. Your goal is to survive for as long as possible, driving up your score as you build new defenses and destroy incoming waves of enemies.  Merchant vessels bring in much needed wealth to fuel your endeavors. Starbase Command is game of economy, of learning what to build and when, and in what order. It is also a game of tactics, of knowing what enemies you should destroy when.<br/><br/>Watch the gameplay video: http://www.youtube.com/watch?v=i-VHvOR1sCI<br/><br/>----------------------------------------------<br/><br/>\"This game is very addictive ^^\" MichelG, user comment from Touch Arcade<br/><br/>\"This game is really a gem for me under the iPhone games. My favorite games are Spaceminer, Rimelands, Warpgate, Angrybirds, Settlers Star defense, Fly Kiwi, Galaxy on fire (2). I give this list so you guys can see how good this game is according to me because Starbase Command belongs in this list with my favorite iPhone games.\" - Wilbair, user comment from Touch Arcade<br/><br/>\"Really fun and simple game to play.\" 1body4u, user comment from iTunes<br/><br/>\"Brilliant game, already had new updates and now hanging out for more!!\" Bladeslapper, user comment from iTunes<br/><br/>\"If you like Spacestation HD, this is recommended. Same defend base concept, but different gameplay and style.\" Jadis777, user comment from iTunes<br/><br/>----------------------------------------------", "metacritic": null, "released": "2010-08-27", "tba": false, "updated": "2019-07-30T16:04:19", "background_image": "https://media.rawg.io/media/screenshots/e5e/e5ee9577c85f213a27faa7eefa7a2558.jpeg", "website": "http://www.chimerasw.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 162, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Chimera Software"], "genres": ["Action", "Strategy"], "publishers": ["Chimera Software"], "esrb_rating": null}