{"id": 61204, "slug": "codename-ghost-hunt", "name": "Codename Ghost Hunt", "name_original": "Codename Ghost Hunt", "description": "Prepare your Squad and engage your enemy in a Turn Based Battle of seek and destroy.  Ghost Hunt is a Turn based PVP Action Strategy game, where player compete to prove supremacy on the battlefield through Educated decisions they make to accomplish own tactics over that of enemy’s.<br/><br/>Create a Squad with 4 different Classes of Units , each with Unique Gameplay Style, Skills and Expertise. Customize them to reflect your unique persona. Equip them with Weapons intelligently, to counter enemy Squad. Dive into a shot span , Turn based PVP Battle. Earn Ghost Coins by wagering and winning battles and get better equipped for the next Challenging Enemy Players.GamePlayThere is a reason why its called Operation Ghost Hunt , Each Unit in your squad is  supposed to be a Ghost , Lurking in the Shadows while taking Enemy Ghosts out One by one. Battle is not an open war, they are strategic engagements ,in shot spans of matches.<br/><br/><ul><li>  Prepare your squad for next opponent accordingly, based on the data available on enemy squad prior to a battle.<br/></li><li>     In the battlefield you try to keep your squad hidden, while eliminating opponent’s Ghost. Being hidden is the key as “a visible unit is a dead unit”.<br/></li><li>     Change the terrain by creating defenses around your Ghosts in eminent danger, while flanking on enemy and quickly finishing them off.<br/></li><li>    Use various Ghost Tactics and Expertise to gather information on enemy Positions and improvise, or Unleash Chaos over them.<br/></li><li>     Set up Ambushes Or Confuse Your enemy with false Information. Anything which wins you the Battle is fair.</li></ul>", "metacritic": null, "released": "2018-09-02", "tba": false, "updated": "2019-08-23T12:11:50", "background_image": "https://media.rawg.io/media/screenshots/77f/77f0945085ac6a2c538f45b7ca53faff.jpg", "website": "https://mbsgamestudios.wordpress.com/operation-ghost-hunt/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 232, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Rahul Martin"], "genres": ["Action", "RPG", "Strategy", "Indie"], "publishers": ["Rahul Martin"], "esrb_rating": null}