{"id": 612116, "slug": "the-lighthouse-at-the-edge-of-the-universe", "name": "The Lighthouse At The Edge Of The Universe", "name_original": "The Lighthouse At The Edge Of The Universe", "description": "<p><em>The lighthouse was an ordinary structure, except for the fact that it was balanced on the very edge of the universe. It had, some speculated, been standing since the universe began. Maintained by a solitary keeper, the lighthouse has been keeping travellers and spaceships from falling</em> <em>off the</em> <em>edge. Its</em> <em>steady beam can be seen galaxies away and is used as a guiding star for navigators. </em></p>\n<p><em>You are the current keeper of the lighthouse. Whatever happens, you must keep the light running. You and the lighthouse live perched on the edge of the universe. It is a rocky, mostly barren place (it would look like any rocky island back on earth) where it is beaten by solar winds and sometimes run into by space whales. Not all of it is terrible though, high in the top of the lighthouse you get to witness strange lights dance, the</em> <em>solar winds whispering fortunes in your ears,</em> <em>shoals of sky fish migrating</em> <em>past.</em> <em>Maybe you'll find some solitude and peace in the under the dark, lonely sky. Sometimes a lone traveller may even cross your path. </em>\n</p>\n<p><em>The Lighthouse </em>is a solo journalling game best played at nighttime before bed or for when you can't sleep. You are the current lighthouse keeper of the Lighthouse. Record your duties, thoughts and observations. Your notes in the logbook will be a record of your time in the lighthouse and the lighthouse itself. </p>\n<p>Each night in the lighthouse will be a little different. The game is designed to be played over and over as you and the lighthouse evolve, change and get to know each other. It is reflective and meditative.</p>\n<p>Game versions be soon added: </p>\n<p><em>Italian, German &amp; French translations, screen reader friendly version, dyslexia friendly version. </em></p><p>Physical zines will be available after Kickstarter rewards are packed, expected mid July 2021</p>\n<p>This project was part of Zine Quest 3 on Kickstarter and supported by 1,636 lighthouse keepers. </p>", "metacritic": null, "released": "2021-06-03", "tba": false, "updated": "2021-06-04T06:27:51", "background_image": "https://media.rawg.io/media/screenshots/c58/c583cb829c5b80e18691425eac66b9a2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 31, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["lostwaysclub"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}