{"id": 612170, "slug": "he-keeps-me-here-aaron-wise", "name": "He Keeps Me Here (Aaron Wise)", "name_original": "He Keeps Me Here (Aaron Wise)", "description": "<p>This game was created in it's entirety within a week originally for fun as a way for me to appreciate the love &amp; coaching that the original Developer Matt Reeves had instilled in me. </p>\n<p>For those of you that know my personal journey on switching careers &amp; becoming an indie game developer, this was the game that started it all. My interaction with developers, my passion for wanting to make games &amp; inspiration &amp; courage to do what I wanted to do for a change. </p>\n<p>He keeps me here is about a guy struggling with his own reality, feeling no self worth, trapped in what feels like an alternate world. That said, the game starts pretty abruptly, and doesn't tell you much. I think that's the best way for this game to start, and I think it's better to play it for yourself, as the story is intended to be discovered rather than explained. There is a depth to this story, separate from my own story.<br/></p>\n<p>I highly recommend you go &amp; check out the original version either first or after this as both are not long at all. Matt put a lot of time into the original of this game &amp; it would great if people could not only support me as you all have, but also support him. Without Matt, I wouldn't be here making games, that's the simple truth. He works hard at everything he does &amp; is making some killer games that I can't wait to show you all. <br/><br/>Thanks for checking out this remake/homage to \"He Keeps Me Here\" &amp; I look forward to you all playing! Please check out my Twitter &amp; Patreon which are linked in the credits of the game :)<br/><br/>Original Game Link</p>\n<p>https://mattreeves.itch.io/he-keeps-me-here<br/><br/>Matt Reeves Twitter<br/><br/>https://twitter.com/mattreevesdev<br/><br/>Patreon <br/><br/>https://www.patreon.com/MattReeves<br/><br/>YouTube<br/><br/>https://www.youtube.com/c/mattreevesproduction<br/></p>", "metacritic": null, "released": "2021-06-03", "tba": false, "updated": "2022-11-06T22:20:53", "background_image": "https://media.rawg.io/media/screenshots/033/03354b91baab0fbb819a2eadba6e8cb9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 97, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Aaron Wise"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}