{"id": 612181, "slug": "slasher-escape", "name": "Slasher Escape", "name_original": "Slasher Escape", "description": "<p>In this game you must try to escape the slasher! You do this by gathering all three car parts and bringing them to the car. The idea for this game was inspired by Friday The 13th. It was made with SDL2 and C.<br/></p>\n<p>The objective of this game is to escape. To do this, you will have to look for items, which are scattered randomly in cabinets all over the map. You can search these using Z. When you are holding a car part, an arrow will direct you to the location of the car.<br/></p>\n<p>An important element of this game is throwing items, mainly to smash windows as you flee the killer. Pressing X normally will switch items, but holding it will throw them. You can use this to your advantage, as where there isn't a door, there is often a window. But be careful - once you get your first item, the player can smash windows too (and doors). You will also have to throw the car parts into the car.<br/></p>\n<p>Besides car parts, there are various other items around the map: the shotgun stuns the killer, the axe chops down trees and can serve as a one-time shield against the killer, and the taser stuns the killer for a shorter time but has unlimited ammo. Beware though; he can't be killed.</p>\n<p>Also, it's worth noting that the sound is a bit bugged.<br/></p>\n<p>This is my submission for the 4MB jam. I hope you enjoy, and would appreciate feedback :&gt;<br/></p>", "metacritic": null, "released": "2021-06-03", "tba": false, "updated": "2021-06-04T06:44:11", "background_image": "https://media.rawg.io/media/screenshots/830/8308a0a5fb13d4afb859d7f40051b21e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 33, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["TylerDWSL"], "genres": ["Action"], "publishers": [], "esrb_rating": null}