{"id": 61211, "slug": "need-for-spirit-drink-drive-simulator", "name": "Need for Spirit: Drink & Drive Simulator", "name_original": "Need for Spirit: Drink & Drive Simulator", "description": "<strong>Need for Spirit: Drink &amp; Drive Simulator</strong> is a tongue-in-cheek racer, unique through its approach to the racing topic. You step into the shoes of a hapless professional driver tasked with transporting various alcoholic beverages such as beer, spirits, wine and brandy to certain venues like birthdays and other miscellaneous celebrations.<br/><br/>If you thought this mission will be easy, think again. The infrastructure will be challenging to say the least. Country roads, mountains and highways that resemble dirt roads will all prove to be worthy adversaries on your path towards a successful delivery.<br/><br/>Abysmal roads aside, the biggest enemy will be your very own addiction to the booze you’re transporting. Potholes seem harmless after you’ve transformed into an insatiable drunkard which suddenly thinks that he’s got the off-road skills to take as many shortcuts as needed. The most inaccessible corners of the map no longer seem like obstacles.<br/><br/><strong>Really, what are YOU waiting for?</strong> Rev that engine, empty a couple of bottles and put your own skills to the test in a parody that absolutely does not encourage drunk driving in real life. Stick to video games and that hangover will disappear faster than flipping the wheels in this simulation!<br/><br/><strong>Key features :</strong><br/>-          Unique gameplay featuring eight levels with deserts, forests, rural roads and highways.<br/>-          Three camera modes.<br/>-          Four booze types as the main commodity and foe.<br/>-          The high probability of experiencing drunk vision.<br/>-          Challenging driving highlighted by obstacles and time limits.", "metacritic": null, "released": "2018-09-05", "tba": false, "updated": "2020-03-20T13:54:01", "background_image": "https://media.rawg.io/media/screenshots/765/765d77d561bed29ac420ada1f6bfe9f5.jpg", "website": "https://www.atomicfabrik.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 414, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Atomic Fabrik", "Cristian Manolachi", "Atomic Fabrik Game Studio"], "genres": ["Adventure", "Simulation", "Sports", "Racing", "Casual", "Indie"], "publishers": ["Atomic Fabrik", "Cristian Manolachi"], "esrb_rating": null}