{"id": 61236, "slug": "cross-racing-championship-2005", "name": "Cross Racing Championship Extreme 2005", "name_original": "Cross Racing Championship Extreme 2005", "description": "<p>Cross Racing Championship (CRC) allows players to experience the thrills of high-speed on and off road racing across vast open terrains.<br />\nRacers can contest over 60 races across six distinct environments, ranging from icy mountainous regions and lush countryside to parched desert areas and beaches.<br />\nCRC appeals to rally and road-racing fans with its crossover approach to vehicles and race circuits.<br />\nCRC features multiplayer action and extensive set-up options which are integral parts of the game along with realistic real-time damage and stunning graphical effects.<br />\nThe vehicles are fully customisable both in their appearance and performance using an intuitive and powerful interface.</p>\n<hr />\n<p>CRC EXTREME edition includes all patches and addons made for CRC, including:<br />\n- 60 multiplayer maps; 10 multiplayer gamemodes such as Cross-Race, Return the Flag, Sumo, Capture the Flag, Catch the Flag, Destruction Zone, Free Ride, Gate Hunt, Jamboree and King Zone. Current version also supports Windows 10 and 16:9, 16:10 aspect ratio screens and windowed mode.</p>\n<hr />\n<p>Specifications:<br />\nAI<br />\nAI drivers have the ability to learn the various tracks to offer the player a realistic and continually challenging racing experience.<br />\nAI drivers can react emotionally and can become angry or they can be afraid of the player and can be as unpredictable as human players.<br />\nPhysics<br />\nIncredibly accurate handling system<br />\nRealtime damage system<br />\n100% simulation, no cheat forces.<br />\nDynamic modelling of tyres, surfaces and aero-dynamics<br />\nGameplay<br />\nMultiple gameplay modes including various single player and multiplayer dedicated game modes (see above).<br />\nNon linear career mode<br />\nSpecial “hot seat” mode<br />\nFully player customisable cars including race number, decals, paint job and performance tuning.<br />\nGraphics<br />\nHighly detailed interiors, particle effects, detailed car components including articulated suspension systems and glowing disc brakes.<br />\nDetailed and living environments.<br />\nReal time environment mapping<br />\nHigh Dynamic Range imaging<br />\nBump mapping<br />\nSpecular highlights<br />\nFlare and Glow effects<br />\nAnimated textures<br />\nPixel shader water reflection effects for lakes, rivers, ponds and Waterfalls<br />\nMotion Blur<br />\nNoise Effects<br />\nAutomatic Contrast Balancing</p>", "metacritic": 77, "released": "2005-06-03", "tba": false, "updated": "2023-05-01T19:47:31", "background_image": "https://media.rawg.io/media/games/0a5/0a575e76cd8a8405386dd584d1a7eef8.jpg", "website": "http://invictus.com/content/cross-racing-championship-21/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 14, "beaten": 1, "toplay": 3, "dropped": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 810, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["Invictus Games"], "genres": ["Simulation", "Sports", "Racing", "Arcade"], "publishers": ["Invictus Games", "Project Three Interactive"], "esrb_rating": "Everyone"}