{"id": 61240, "slug": "typing-game", "name": "Typing game", "name_original": "Typing game", "description": "\"Typing Game\" is a perfect indie game to train typing. It is very easy to understand how it works, and the way in which the game is construed is very easy to get used to.<br/>\r\nWhen you enter \"Typing Game\" you have to select a difficulty before you start. You have 3 different difficulty levels, easy, normal and difficult. In addition, each level of difficulty corresponds to a different background, changing the setting of the game.<br/>\r\nInside the game, you will see how several words go down, the only thing you have to do is write them and hold as much as possible. But there are several rules:<br/>\n<br/>\r\n-There is a line of danger that unwritten words can not pass, each game can allow you to pass a word, if there is a second word that passes, you lose the game.<br/>\n<br/>\r\n-When you write the first letter of a word, you will see how this word lights up blue, and from there you can only write that word, any letter of another word that you are seeing will not count. So you must decide why to go first without going over the danger line.<br/>\n<br/>\r\nAlso, the words that appear are random, you will never play an equal level in this game, also those words are adjusted to the level of difficulty.<br/>\n<br/>\r\nWhat to expect:<br/>\n<br/>\r\n-Random generated gameplay<br/>\n<br/>\r\n-3 difficulty levels<br/>\n<br/>\r\n-Perfect game to practice typing in the simplest way<br/>\n<br/>\r\nHow to play:<br/>\n<br/>\r\n     -Use your mouse to navigate through menu and use your keyboard to play.", "metacritic": null, "released": "2018-09-28", "tba": false, "updated": "2019-08-28T21:58:14", "background_image": "https://media.rawg.io/media/screenshots/488/4885d2054ddfd48002e98ecdb32376a4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 90, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Garnudo Games"], "genres": ["Strategy", "Simulation", "Casual", "Indie"], "publishers": ["Garnudo Games"], "esrb_rating": null}