{"id": 612566, "slug": "journey-of-a-cursed-fool", "name": "Journey of a Cursed Fool", "name_original": "Journey of a Cursed Fool", "description": "<p>This is my entry for Go Godot Jam 2021. My original idea was to make a game where you travel the world in search of a relic and when you die you pass on your skills to your descendant who takes over from there. You would have been able to learn new skills and combine them with skills your ancestors knew. Obviously that was to complex for me to finish in a week so I introduce to you Misadventures of Whole Fool: Journey of a Cursed Fool.  I did this jam mainly because I needed a break from my main project, Super Spades Budokai, and because Godot is awesome. I didn't take myself too seriously here and  I truly hope you enjoy the game and if you got a laugh out of it or two then think about checking out Misadventures of Whole Fool: The Animated Series!</p>\n<p><strong>Rules:</strong></p>\n<p>The game is basically became a convoluted version of the game MasterMind. I always seem to come back to this game, but anyway... Each turn you'll have to decided to travel between three different locations. After selecting a location and event will play out and you'll select again. After doing this five times the game will check to see if you selected the right path. If you did then you'll win and see the ending, but if not you'll be given a hint and start over.</p>\n<p>You skills in battle will get strong the more you use them, but after every turn you'll get older and thus your skills will deteriorate. However when you die you will retain your skill levels from the past life.</p>\n<p>Also remember that monster get stronger as the game goes on. </p>\n<p><strong>Controls:</strong></p>\n<p>All you'll need for this game is the arrow keys and the enter button.</p>\n<p><strong>Credits:</strong></p>\n<p>Graphics: Krishna Palacio<br/>Fonts: Somepx<br/>Audio: Asix Benson<br/>Love and Support: Destenie aka The Social Work Unicorn aka My Wife<br/>Everything Else: The Sexy &amp; Beautiful Black King Asix</p>", "metacritic": null, "released": "2021-06-01", "tba": false, "updated": "2021-06-04T08:26:50", "background_image": "https://media.rawg.io/media/screenshots/874/87439003ff55a3af7e6b79bcb38e97aa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 14, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Asix"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}