{"id": 612570, "slug": "dark-path-rauldeniainf", "name": "Dark Path (rauldeniainf)", "name_original": "Dark Path (rauldeniainf)", "description": "<p><strong>Equipo</strong>: JOGOTEAM</p>\n<p><strong>Integrantes</strong>: Jaume, Alex, Pau, Joan, Núria, Carla, Minerva, Mar, Pablo, Miguel, Toni, Tania.</p>\n<p><strong>Dark Path</strong> ha sido desarrollado mediante el motor Unity. El juego se puede jugar en su versión WEBGL desde el propio navegador o bien descargarse el juego (ver más abajo) para Windows. Para ejecutarlo en Windows sólo hace falta descomprimir el archivo y ejecutarlo. El juego consiste en un mundo abierto donde el personaje se puede mover libremente entre escenas accediendo a ellas a través de escaleras. El jugador se deberá mover por todas ellas eliminando todos los enemigos y buscando enfrentarse al jefe final. Durante su recorrido podrá recolectar monedas para poder utilizar en la tienda e items que podrá obtener a eliminar los enemigos. Cada item le otorga una propiedades especiales al jugador como por ejemplo el chili que le otorga el poder de la FireBall.</p><p>La música ambiente del juego es completamente original compuesta por un integrante del equipo mediante Musescore.</p>\n<p><strong>Introducción</strong><br/></p>\n<p>Nuestro aventurero Perky se embarca en una peligrosa aventura en un desconocido mundo lleno de peligros para poder salvar su pueblo de la raza de los demonios.</p>\n<p>Todo empieza con la invasión de demonios en su pueblo, Perky lleno de ira, irá a investigar una extraña cueva cerca de su pueblo dónde desde tiempos inmemoriales se cree que habitan los demonios. Ya dentro de la cueva, cuando todo estaba tranquilo, sintió un ruido muy raro y de repente todo se volvió oscuro… </p>\n<p><strong>Introducció</strong>\n</p>\n<p>El nostre aventurer Perky s'embarca en una perillosa aventura en un desconegut món ple de perills per a poder salvar el seu poble de la raça dels dimonis.\r\n</p>\n<p>Tot comença amb la invasió de dimonis al seu poble, Perky ple d'ira, anirà a investigar una estranya cova prop del seu poble on des de temps immemorials es creu que habiten els dimonis. Ja dins de la cova, quan tot estava tranquil, va sentir un soroll molt rar i de sobte tot es va tornar fosc… \r\n</p>\n\n<p><strong><em>URL Jugable</em></strong></p>\n\n<p><strong><em>Instrucciones</em></strong></p>\n<p><strong>A-D</strong>: Caminar (LShift pulsat per correr)</p>\n<p><strong>W</strong>: Salt</p>\n<p><strong>SPACE</strong>: Atac Melee</p>\n<p><strong>F</strong>: Tirar pedres (<strong>Soles podrás tirar pedres cada 2 segons per lo que hauras d'atacar també amb el puny</strong>)</p>\n<p><strong>Fletxes dreta i esquerra</strong>: Seleccionar item del inventari</p>\n<p><strong>Q:</strong> Consumir item del inventari</p>\n<p><strong>I</strong>: Accedir al inventari  (<strong>Cada item del inventari té unes propietats especials, més velocitat, pedra de foc, més salt, etc...al situar el ratolí damunt ix el que fa cada item</strong>)</p>\n<p><strong>E:</strong> Al estar al costat de la tenda, es pot polsar E i accedir a comprar items amb les monedes<br/></p>\n\n<p> <br/></p>", "metacritic": null, "released": "2021-06-01", "tba": false, "updated": "2021-06-04T08:28:03", "background_image": "https://media.rawg.io/media/screenshots/76d/76d3e016a734628dfece972f7b97aa84.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 111, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux", "Web"], "developers": ["rauldeniainf"], "genres": ["Adventure", "Platformer"], "publishers": [], "esrb_rating": null}