{"id": 612695, "slug": "mourning-in-greenwood-demo", "name": "Mourning in Greenwood Demo", "name_original": "Mourning in Greenwood Demo", "description": "<p>You've been out of town for a few days now, when you receive a phone call from your wife. She sounds really frustrated, and...scared. The only thing that you pick up from your conversation with her is that you NEED to be back in town.</p>\n<p>After returning back, things do seem strange and <em>abnormal</em>. The town doesn't feel familiar... <em>it doesn't feel like home.</em></p>\n<p><strong>The game is an emotional, story driven platformer</strong></p>\n<p>(Controls - A,D for movement/ E to equip gun)</p>\n\n<p>I have uploaded the demo version. It contains the first few seconds/minutes of the game. It isn't too long, nor is it<strong> completely</strong> polished as it doesn't have all the sounds or scenes(gun not finished as well). However <em>the point is just to show u the overall vibe of the game and how it has been pictured by the developer.</em></p>\n<p>Hope you like it!✌</p>\n\n\n<p>Being a solo indie game developer, it takes time developing a game and doing every aspect of it by yourself.</p>\n<p>To continue development on this game, it would be <strong>highly encouraging </strong>for me if you consider funding the game. Y'all I would really appreciate any type of support, be it just the rating :)</p>\n<p>Plus my laptop can't really much handle unity anymore and hence I need a new one to progress further on my game🙁🤞</p>\n<p><strong> Guys again, any help would be appreciated🙏</strong></p>\n\n<p><strong><em>I know I will finish the game no matter what :)</em></strong></p>\n\n<p><em>Thank You</em> 🙏</p>", "metacritic": null, "released": "2021-06-01", "tba": false, "updated": "2021-06-04T09:00:37", "background_image": "https://media.rawg.io/media/screenshots/140/14077ebabf11a0aeb8a04213d6e27627.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 85, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SoulTrader"], "genres": ["Action", "Adventure", "Platformer"], "publishers": [], "esrb_rating": null}