{"id": 61268, "slug": "lawless-lands", "name": "Lawless Lands", "name_original": "Lawless Lands", "description": "Lawless Lands<br/><strong>Arise:</strong><br/><ul>Plunge into the Lawless Lands of Crossia, a once great kingdom where chaos slowly consumes more and more of the country. The cities have plummeted into poverty and crime, and the surrounding countryside is littered with famine and death. The army is close to collapse from an ever-lasting war and cannot stop the spread of the disorder. Hope is almost nonexistent, restoring order is believed to be futile, and panic lingers everywhere. Take on the role of a champion who rises from the ashes to end the suffering.</ul><br/><strong>Muster and Rally:</strong><br/><ul>Create the character of your dreams with complete customization including traits, skills, training, abilities, companions, appearance, and an open-ended advancement system that allows you to improve and expand however you wish, without being limited by a class or tier based leveling system. Then, play how you choose with whatever equipment and gear that suits your favored playstyle for your adventures!</ul><br/><strong>Stand Firm:</strong><br/><ul>Arm and upgrade your character with skills and a huge armament to better allow them to face constant and ever growing challenges. Enemies improve as you and your company do, and so do the other various dangers and threats that stand in your way. Plan accordingly for each and every adventure.</ul><br/><strong>Main Features:</strong><br/><ul><li>Epic main storyline with hours of diverse gameplay<br/></li><li>Sprawling open world on a massive scale<br/></li><li>Intricate character development with familial backgrounds, occupations, traits, 36 different skins, a vast number of skills, abilities, spells, and more<br/></li><li>Countless side quests and activities that add to the lore of the game world<br/></li><li>Randomized loot and encounters<br/></li><li>Hundreds of items, gear, and equipment choices<br/></li><li>Durability and degradation system for weapons and armor<br/></li><li>Dozens of different enemies, each with their own behaviors, tactics, and personalities<br/></li><li>Extensive and easy-to-use crafting system</li></ul><br/><strong>Other Features:</strong><br/><ul><li>Original soundtrack themes<br/></li><li>Day/night cycle (1 hour real-time is 1 day in game)<br/></li><li>Dynamic and randomized weather patterns<br/></li><li>High quality/custom-made graphics and artwork<br/></li><li>Support for all Windows computers</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:58:13", "background_image": "https://media.rawg.io/media/screenshots/eaf/eafc86342f5cfac06773e2324331d68f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 16, "toplay": 1, "dropped": 1}, "playtime": 5, "achievements_count": 122, "ratings_count": 0, "suggestions_count": 281, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Corrosive Studios"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Indie"], "publishers": ["Corrosive Studios"], "esrb_rating": null}