{"id": 6127, "slug": "cashmachine", "name": "CashMachine", "name_original": "CashMachine", "description": "CashMachine is a puzzle game based on the match3 concept but with a innovative idea. Each time you match 3 or more items of the same kind, they transform into another kind of item of higher value.<br/><br/>For example, you match three silver coins, they turn into one gold coin. Then you match three gold coins and they turn into one bank note and so on... Each time you match three of one kind of items it begins to fall on the board increasing the difficulty at the same time. With 12 different kind of items this is hours of challenge for sure !<br/><br/>You can also try the &amp;quot;Time Attack&amp;quot; mode. In this mode you begin the game with 3 minutes. Each time you match items you earn extra time but the clock never stop running so don&amp;#39;t think too slow...<br/><br/>Thanks to the OpenFeint plateform you will be able to send you score to a global online leaderboard and show your score to your friends on Facebook and Twitter.<br/><br/>There is also many awards to unlock by completing different actions on the game, try to unlock all !<br/><br/>- Simple and addictive gameplay with a really innovative touch, unique on the iPhone<br/>- Progressive difficulty<br/>- Two different game modes, normal and time limited<br/>- Many awards to unlock<br/>- Community : powered by Agon Online, submit your score online, show your score on Facebook and Twitter<br/><br/>More information and video on :<br/>http://www.smallgames.fr", "metacritic": null, "released": "2009-09-12", "tba": false, "updated": "2019-10-22T14:28:38", "background_image": "https://media.rawg.io/media/screenshots/643/643a62cd281b42a7fb90ddf182dc86eb.jpeg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 89, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["GreenMines Games"], "genres": ["Strategy", "Puzzle"], "publishers": ["Christophe Cuoq"], "esrb_rating": "Everyone 10+"}