{"id": 612898, "slug": "prototype-building-sim-x-incremental-game", "name": "[Prototype] Building Sim x Incremental Game", "name_original": "[Prototype] Building Sim x Incremental Game", "description": "<p>Experience a city building simulator with incremental systems intertwined. This is an <strong>early prototype</strong>, released to gauge interest in the game, and what people like and dislike about it.</p>\n<p>In this<strong> </strong>demo, you will be able to experience building a city from scratch. Grow your cities with the free form building system, and create the busy and bustling city you have always dreamed of! </p>\n<p>The game is currently untitled, but with this <strong>early prototype</strong> I hope to capture people with a different building sim experience. The demo will not showcase the entire game just yet, but hopefully it gives you an idea of the premise behind the game. </p>\n\n<p>---------------------------------------------------------------------------------------------------</p>\r\nMust Read\r\n<ul><li>The game currently does not have any save state or system, meaning that if you were to close the game and open it again, you will lose all your progress (this is currently in development, and will be ready for another future demo release).</li><li>Currently many of the base systems of the game have been implemented, but many more are hidden or in current progress. </li><li>I would greatly appreciate comments, I would love to hear what you enjoyed or disliked about the game. I may take some time to respond to enquiries because in addition to being the sole developer of this game I also have a full job and am a father to a toddler. </li></ul>\n<p>---------------------------------------------------------------------------------------------------\r\n</p>\r\nFuture Features\r\n<ul><li>The game will have an ending that you can achieve. I am a very goal orienteted person, so I am planning on creating a structure for players to follow where they will be able to 'complete the game'. Once players have reached the ending, they can continue playing their save in a more sandboxy mode if they wish.</li><li>I also plan on having plenty of systems which will 'unfold' the more you play. Once you reach certain checkpoints in your save, you will unlock more game mechanics, more things to purchase and place, and more things to do. </li><li>I am hoping to also strike a great balance between active gameplay and afk gameplay. That way players still feel as if they are playing and experiencing a game, without needing to have the game open all the time to progress.</li><li>Although the art has yet to be implemented, the buildings will be designed with the concept of a dystopian future. Buildings built in different terrains, will naturally change visually.</li></ul>\n\n<p>---------------------------------------------------------------------------------------------------<br/></p>\r\nExtra\r\n<p>I greatly appreciate all who open this page, and play my prototype. I genuinely hope you enjoy your experience. Please don't forget to leave a comment about your experience, and if you would like to keep up to date on the game follow my twitter.</p>\n<p>https://twitter.com/PapaMoseph</p>", "metacritic": null, "released": "2021-06-01", "tba": false, "updated": "2021-06-04T09:55:33", "background_image": "https://media.rawg.io/media/screenshots/cfc/cfc73cd29d7c08fea721b65615386c90.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 84, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["PapaMoseph"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}