{"id": 61296, "slug": "supralympic-runners", "name": "Supralympic Runners", "name_original": "Supralympic Runners", "description": "Supralympic Runners is a <strong>first-person competition-focused endless runner</strong>.<br/><br/>You play an heavily fitted athletic champion, like you've never seen before in sport. But nerves of steel are highly required to <strong>compete for the worldwide leading position!</strong>MAIN FEATURES<br/><ul><li>Procedural generation of race tracks: theoretically infinite.<br/></li><li>Vicious game mechanism built to crush athletes between <strong>time pressure</strong> &amp; <strong>destruction threat</strong>.<br/></li><li>10 types of deadly obstacles to spell the end of each and every round.<br/></li><li>Rocket-powered running : run over 60 mph thanks to the back thruster.<br/></li><li>Dash : break through obstacles thanks to the rocket-shield.<br/></li><li>Bullet-time : experience the world in slow-motion thanks to the chronostaser.<br/></li><li>8 types of collectable bonus to get extra-backing.<br/></li><li>3 ranges of armor kits to push the deadline back.<br/></li><li>Dynamic music to suit race speed.<br/></li><li>Express tutorial during mecha embodiment process.</li></ul>STUNGATE MECHANISM<br/>Run as far as you can, avoid obstacles and hurry up while the <strong>Stungate</strong> is still open !<br/><br/><br/><br/>What the hell is a <strong>Stungate</strong>? It's a gate kept by a giant compressor! It's <strong>50,000 tons of tungsten-titanium</strong> waiting to fall upon your head if you are late!<br/><br/>Let's say you get through, what then?<br/>If you manage to cross 5 <strong>Stungates</strong>, you complete a stage. You have a few seconds of respite during which you can take a look at the cityscape. But don't relax too much, each completed stage means a new deadly obstacle into the death row!DESTRUCTION<br/>There are many ways to terminate your running in Supralympic Runners, but none is happy...<br/><br/><br/><br/>You could end up <strong>ROASTED</strong> by electric shocks, <strong>DISSOLVED</strong> into the slime, <strong>MELTED</strong> by lava, <strong>SLICED</strong> by lasers, <strong>SMASHED</strong> against walls, <strong>CRUSHED</strong> by compressors, <strong>FALLEN</strong> into the depths or <strong>PURGED</strong> under timeout.<br/>No one will be spared…CORE GAMEPLAY<br/>Since you seem interested, let’s see under the hood...<br/><br/><br/><br/><ul><li>Forward Speed Control</li></ul>Unlike many endless runners you can manage your running speed thanks to your back thruster. This speed is driven with physic-based parameters : thrust of motor and legs and body drag.<br/>Indeed it’s <strong>not an automatic-forward but a minimal-forward mechanic</strong> forcing you to run.<br/><br/><ul><li>Lateral Control</li></ul>The runway has <strong>no railroads</strong>. It means that you can <strong>freely and continuously move laterally</strong> between bounding walls.<br/>Also, the runner lateral speed is non-linearly affected by its forward speed, it means the fastest you run forward, the slowest you run laterally, following a specific curve.<br/><br/><ul><li>Vertical Control</li></ul>Well you can obviously <strong>jump</strong> and <strong>slide</strong>, but we took care to improve the vertical mobility of the runner : vertical speed is not only driven by gravity but also by motor thrust. This means you have the ability not only to sustain jumps but also to dive lightning-fast into the ground.<br/><br/><ul><li>Special Actions</li></ul>You can <strong>dash forward</strong> making your runner invulnerable to minor damages during the thrust.<br/>You can also experience the world in <strong>slow motion</strong>, thanks to the chronostaser that comes within your running avatar.<br/><br/><ul><li>Collisions</li></ul>Because of the fine control considerations above, <strong>the collisions are physic-based</strong>. The game accurately detect them based on each body part colliders of your runner.THE SUPRALYMPIC WORLD<br/>Several hundred years after the technological revolution, the Supralympic Games became the world's foremost sports competition. They reflect the values and human aspirations of a sunless future.<br/><br/>You were born during the reign of manufactured products, long after the replacement of nature wherever it could be replaced. You even left your flesh body for the promise of technological eternity.<br/><br/>But while you could experience an infinity of forms, you embraced the life of a supralympian athlete. You have been training over and over to master and improve this high-tech body. In the hope that one day <strong>the Supralympic champion’s title</strong> will be yours…<br/><br/>", "metacritic": null, "released": "2018-05-18", "tba": false, "updated": "2019-08-28T21:58:13", "background_image": "https://media.rawg.io/media/screenshots/ddf/ddfb608920f18d34b3c72d38740ce17d.jpg", "website": "http://uraniumsoda.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 86}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 174, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Uranium Soda Studio"], "genres": ["Action", "Sports", "Racing", "Indie"], "publishers": ["Uranium Soda Studio"], "esrb_rating": null}