{"id": 61309, "slug": "mard", "name": "MÅRD", "name_original": "MÅRD", "description": "You are a detective who takes some time off from the precinct to drive up to your late father's cabin, which he has left you, somewhere in the woods of northern Sweden. On your journey you are accompanied by your dog \"Speck\", a German shorthaired pointer. The cabin itself seems to be left in the same condition as your father left it and you find a wide assortment of old strange books. They tell of an ancient legend of a mythological creature which the native people believed to have protected the land. You also find a collection of notes left by your father.<br/><br/>But everything is not what it seems. Determined to find out what drove your father to spend his final months in isolation in the cabin, you set out to investigate.<br/><br/><strong>MÅRD</strong> is a first &amp; third person action/exploration/horror fusion, set in the open-world wilderness of northern Sweden. To reach your goal and find out what happened with your father, you must: <ul><li>Look for clues in notes </li><li>Explore key areas </li><li>Use the help of your dog to get past obstacles </li><li> Find weapons to defend yourself against the dangers of the wild</li></ul>Features:<ul><li>Man’s best friendThe wilderness is wild and you will need to be cautious of every step you take. Fortunately, you are not alone, as by your side you have Speck— a well trained Pointer who will alert you of danger whenever it’s close. If anything of interest is nearby, Speck will be the first to know and, in turn, so will you. He will also help you carry important items along the way and help you get past tricky obstacles.<br/><br/></li><li>Respect the wildernessFar from any civilization, your journey will begin. Out here, landmarks are few and far between. It’s not much, but your crudely drawn map will come in handy in marking out important locations. Utilize the compass to be sure to navigate in the right direction— don’t leave the safety of the cabin without it. You will encounter wildlife that can attack and you will need to defend yourself against. Stay on your course or walk off the beaten track to discover the wildlife.<br/><br/></li><li>Your safe havenUse the cabin for protection and vantage point. Keep the door closed to prevent anything from getting inside. However, the door won't hold forever. Also, don’t forget to stock up on spare ammunition before you leave. Finally, look around for any notes that your father might have left behind— they can give you clues of what you need to investigate.<br/><br/></li><li>Against the elementsIn your exploration you will not only face the vastness of the forest and its wildlife, but also take on the elements of the beautiful Scandinavian nature. Day and night will pass naturally as the story progresses— be prepared with your flashlight as some areas will be pitch black even in day time.</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:58:12", "background_image": "https://media.rawg.io/media/screenshots/6c4/6c466a86cd2aefd93db5d8e0feab0256.jpg", "website": "https://www.mardgame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 247, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Black Curtain Studio"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Black Curtain Studio"], "esrb_rating": null}