{"id": 613081, "slug": "making-magic", "name": "Making Magic", "name_original": "Making Magic", "description": "<p><strong>What is this?</strong></p>\n<p>This game stared with the idea of casting spells from ingredients in a match-3 style space. <br/><br/>I had a lot of fun doodling little pixel art spell casting components, most of which did not make it into this game. </p>\n<p>In the end, I think this idea shows some promise. However, it seems like it will take a lot of work and polish to make it any more interesting than a normal match-3 style game. I will probably not be going down this road any further, but perhaps it will inspire someone else!</p>\n<p><strong>What are the rules?</strong><br/></p>\n<p>Due to lack of polish time, a lot of the mechanics going on in this game are pretty unclear.</p>\n<ul><li>Try to get the <strong>highest score possible</strong>\n</li><li>Each column has a heart, if all your hearts are killed you lose!</li><li>Drag on items to select a spell<ul><li>Dragging is a bit wonky. :-)</li><li>Click on the heart row to clear your selection</li></ul></li><li>Click on a glowing selection of items to cast your selected spell</li><li>Valid spells are:<ul><li>1 of a kind: remove the item, take a damage in that column</li><li>2 of a kind: remove both items, take no damage</li><li>3 of a kind: remove all items, get 10 points each</li><li>4+ of a kind: remove all items, get 10 points each, get the special spell effect for the ingredient type<ul><li>leaf: 50 bonus points</li><li>feather: replace feathers with clouds, clouds disappear next move</li><li>mushroom: shield the hearts in these columns</li><li>acorns: remove adjacent items as well</li></ul></li></ul></li></ul>", "metacritic": null, "released": "2021-05-31", "tba": false, "updated": "2021-06-04T10:41:11", "background_image": "https://media.rawg.io/media/screenshots/601/6018f55fc3e5bd421e39a91a8ca4e994.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 3, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Ryan Kubik"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}