{"id": 61303, "slug": "adeptus-titanicus-dominus", "name": "Adeptus Titanicus: Dominus", "name_original": "Adeptus Titanicus: Dominus", "description": "Coming soon to Steam Early Access, Adeptus Titanicus: Dominus features a Skirmish mode against an AI opponent for single-player and an online multi-player mode. Upon full release, the game will also offer an exciting single-player campaign.<br />\nControl a force of Titans<br />\nIn Dominus, choose to control a force of Titans from the loyalist Legions of Astorum (Warp Runners), Gryphonicus (War Griffons), Crucius (Warmongers) or Osedax (The Cockatrices), or choose from the traitorous Chaos Legions of Mortis (Death Heads), Vulcanum (Dark Fire), Damnosus (Lords of Ruin) and Fureans (Tiger Eyes).<br />\n⠀<br />\n⠀<br />\n⠀⠀⠀⠀⠀⠀⠀<br />\nFuturistic warfare<br />\nUtilising the tabletop Titan Legions rules system as its foundation, Dominus features an easy-to-play yet deep strategic and tactical experience via its streamlined command system, which sees you and your opponent giving activation orders to your Titans, resulting in fast-paced battles. It successfully marries this strategic play with action sequences as the gargantuan Titans exchange volleys of cannon shots, blistering laser blasts and other epic, super-powered weapons of the far off future!<br />\nEasy to play, challenging to master<br />\nWhile luck will play a part as you trade blows with your foe on the futuristic battlefields of the 41st Millennium, your path to victory lies in your army list building and how you manoeuvre your units upon the battlefield. As a commander, you will have access to the most classic, iconic Titan units from the Warhammer 40,000 universe: Warhounds, Reavers and the gigantic Warlord, for both the Imperial and Chaos factions. Each of these Titans will have multiple variants available, featuring different weapon configurations, thereby enabling your Titans to fulfil the battlefield role your strategy demands.<br />\nA living battlefield<br />\nAdeptus Titanicus: Dominus will feature a &quot;living battlefield&quot; that employs unit and battlefield animations to show players the Warhammer 40,000 universe they know and love.ABOUT MEMBRAINEMembraine Studios is a small indie team based in Sydney, Australia. The team is Glenn Osmond-McLeod and Mark Sheppard - both avid tabletop gamers and indie developers with more than 16 years game development experience between them. In recent years, Membraine has focused on the turn-based strategy genre.CURRENTLY PLAYABLEThe current Early Access build of Adeptus Titanicus: Dominus features the following:<br />\nA true-to-source adaptation of the Titan Legions tabletop rules, streamlined for PC<br />\nTwelve Titan variants, three each for the Warlord, Reaver and Warhound<br />\nFour Loyalist Legios and four Chaos Legios to choose from<br />\nThree battlefields, each with distinct environments<br />\nDestructible terrain features - watch buildings collapse as stray weapons fire obliterates their structural integrity<br />\nSeveral game modes with multiple victory conditions - there is more than one way to win<br />\n12 fixed-forces scenarios to challenge your skills as Legate of a Maniple of Titans<br />\nDiscover the strategic depth underlying the game, with points-based army list building in Skirmish and Multi-Player via the Detachment BuilderTHE ROAD AHEADOver time, we plan to release a series of updates to the game as it progresses towards the full version of the title.<br />\nUpdate One (currently in development)<br />\nThe first major update planned for Adeptus Titanicus: Dominus focuses on gameplay additions::<br />\nStress (suppression mechanics) - an additional layer of tactical concern that adds depth!<br />\nClose Assault and Fire Fight - engage with your enemy in deadly close-quarters combat!<br />\nSteam Achievements (first grouping)<br />\nA loot-drop system (initial implementation)<br />\nGeneral quality-of-life improvements<br />\nFuture updates<br />\nThe scope of the next major updates has not yet been announced. Follow us for news about the next exciting instalment of Adeptus Titanicus: Dominus&#39; Early Access journey!</p>", "metacritic": null, "released": "2018-05-31", "tba": false, "updated": "2022-08-18T12:26:53", "background_image": "https://media.rawg.io/media/games/c40/c40f3b049e6e30d2dc625a6621ea954d.jpg", "website": "http://adeptustitanicus-dominus.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 46, "toplay": 3, "playing": 1}, "playtime": 2, "achievements_count": 43, "ratings_count": 3, "suggestions_count": 465, "game_series_count": 39, "reviews_count": 3, "platforms": ["PC"], "developers": ["Membraine Studios"], "genres": ["Strategy"], "publishers": ["Membraine Studios"], "esrb_rating": null}