{"id": 613018, "slug": "blackvoid", "name": "BLACKVOID", "name_original": "BLACKVOID", "description": "Hello, World!\r\n\n<p>BLACKVOID is roguelike shooter tower-defense-like Arcade game where you defend your ship and shoot asteroids with challenging difficulty.</p>\n<p>The game is made for DragonRuby Classics Jam: Gauntlet Edition game jam, And it takes concepts of shooting and difficulty from Gauntlet, With tower-defense-like Arcade inspired mechanics!</p>\n\r\nGameplay\r\n\n<p>You play as ship and as the game goal is to protect the ship, You will shoot the asteroids to prevent your ship to crash.</p>\n<p>The asteroids come in form of \"Waves\", And their number increase by each wave as you destroy them to reach each wave (That's what makes it challenging)</p>\n<p>Each time you destroy asteroid, Combo increases and it affects your score and gameplay very well as it consists of 2 modes:</p>\n<p>1. Normal Mode: The default mode, You lose if you hit by asteroid in case your combo is lower than 2 (1 or 0)</p>\n<p>2. Void Mode: The hard mode and designed originally for the game, You lose with any hit whatever combo you have.</p>\n<p>So yeah, Enjoy being striked by those asteroids :D<br/></p>\n\r\nFAQ\r\nWhy there is no save button?\r\n<p>Each time you finish wave game saves automatically, But if you lose game resets everything (Stats or highscore and these won't reset)</p>\n\r\nI lose really fast!\r\n<p>Well the game is challenging and for people with nerves of steel, Well did you forgot reading above about being hard? :)</p>\n\r\nWhy Game resets once i lose?\r\n<p>The game is roguelike, Meaning that if you lose you'll start everything again...</p>\n\r\nHow many levels game has?\r\n<p>The game has no levels but \"Waves\" and it's endless until you lose the game.</p>\n\r\nHow can i change game mode somewhere?\r\n<p>You can't so you would like to restart all the game with mode you want from \"START NEW GAME\" since changing mode would breaks game difficulty and meant to be some sort of cheating.</p>\n\r\nWhat this game made with?\r\n<p>This game made with DragonRuby Game Toolkit in Ruby programming language, It uses the fast and minimal Ruby implementation mruby and well-known library SDL2, You can get it here: https://dragonruby.org/toolkit/game<br/></p>\n\r\nCan i have source code?\r\n<p>Even i didn't uploaded it to GitHub, Working on fixing touch for Android and if well i would release and put link so come back later :)<br/><br/><br/></p>\r\nSpecial Thanks\r\n<p>Thanks to everyone in DragonRuby Game Toolkit Discord server, They helped me a lot when got stuck in a lot of issues, I really believe that i won't complete this without their help...<br/></p>\n\r\n3rd party stuff\r\nImages\r\n\n<p>1. Background used for the game, Which is from link below:</p>\n<p>https://wallpaperaccess.com/download/black-space-1268183</p>\n<p>2. Also i used prompts for Keyboard and Joystick from link below:</p>\n<p>https://thoseawesomeguys.com/prompts<br/></p>\n\r\nSounds\r\n\n<p>Sounds used from freesound.org site:</p>\n<p>1. https://freesound.org/people/medetix/sounds/177906 <br/>2. https://freesound.org/people/Sjonas88/sounds/538548</p>\n<p>3. https://freesound.org/people/old_waveplay/sounds/399934</p>\n\r\nOther\r\n\n<p>Also, Game font and most game images and sounds are from Kenney assets from here: https://www.kenney.nl</p>\n<p>1. https://www.kenney.nl/assets/space-shooter-redux <br/>2. https://www.kenney.nl/assets/sci-fi-sounds</p>\n<p>(Sounds and Kenney content licensed under Creative Commons 0 License)</p>", "metacritic": null, "released": "2021-05-31", "tba": false, "updated": "2021-06-04T10:26:32", "background_image": "https://media.rawg.io/media/screenshots/361/36188e71c9ab0c618c7f6275126f4171.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 123, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["Steria773"], "genres": ["Action"], "publishers": [], "esrb_rating": null}