{"id": 61317, "slug": "in-league", "name": "In League", "name_original": "In League", "description": "Join our Discord to meet other players!<br/>Battle online across diverse maps in this VR shooter with realistic gun mechanics, and deep gameplay mechanics rife with endless possibilities. Outrageous but realistic combat situations. Wild fun, contains gameplay elements to master, and features unique gameplay mechanics. Tactical teamwork and strategy is required to win across all our target rich environments.<br/><br/>Three game modes: <br/>-Hunt - Load out you character and team through loot boxes with a shared pool of lives you have to preserve. <br/>-Hostage - Either defend or rescue the hostages to win.<br/>-SLAYER Coop or single player - Survive with friends against an onslaught of challenging enemies<br/><br/>Gameplay:<br/>-Wide array of guns, characters, melee weapons, and explosives.<br/>- Full roomscale support, run in place sprinting, climbing, and zip lines! <br/>-Weapons have interactive sweep. You can rest guns on ledges and melee requires velocity when swinging to do damage.<br/>-Interactive levels with working doors, loot boxes, and explosive barrels. (More to come VERY soon.)<br/>-Weapon attachments to enhance capabilities depending on the environment<br/>-Unique inventory system with great reliability and quick management.<br/>-In game team VOIP<br/>-Bot support to fill teams if selected", "metacritic": null, "released": "2018-09-04", "tba": false, "updated": "2019-08-23T12:11:49", "background_image": "https://media.rawg.io/media/screenshots/e22/e225b889b21175a54e7f8fc76d8e21f2.jpg", "website": "https://www.inleaguevr.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 485, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Fatmoth Interactive", "Potato Face Games"], "genres": ["Action", "Adventure"], "publishers": ["Fatmoth Interactive"], "esrb_rating": null}