{"id": 613251, "slug": "aprenciencia", "name": "Aprenciencia", "name_original": "Aprenciencia", "description": "<p>HakerMate3</p>\n<p>Parque Colegio Santa Ana (Valencia)\r\n</p>\n<p>Miembros del equipo: Miguel Angel Monfort Cabeza, Santiago de Taranco Domenech, Silvia Llopis Ruiz y Sofía Martínez Caballero</p>\n<p>AprenCiencia ha sido creada con la idea de motivar a los niños a aprender ciencia con experimentos, de ahí su nombre.\r\n</p>\n<p>Después de poner en común varias ideas vimos que muchos de los experimentos que se plantean a partir de los 8 años son con materiales que no tenemos en casa o que no son tan fáciles de conseguir, como ir a un supermercado o tienda de barrio. Por eso, decidimos hacer una aplicación donde coleccionar experimentos fáciles para sembrar la semilla de la investigación en todos los niños que la utilicen.\r\n</p>\n<p>Su utilización es muy sencilla. Antes de ver el experimento encontrarás una curiosidad sobre el mismo. Puedes volver a la lista de experimentos en todo momento.\r\n</p>\n<p>Hemos diseñado las pantallas (diseño) de la aplicación buscando que los colores sean los mismos en todos los botones y que la imagen al abrir la aplicación sea sencilla para centrar la atención en los experimentos que presentamos. Hemos utilizado botones y disposiciones horizontales y verticales para que todo aparezca en el sitio correspondiente con el diseño del mockup. La lista de experimentos es un visor de lista.\r\n</p>\n<p>Para la parte de programación (bloques) hemos utilizado control, matemáticas, texto, listas, variables y procedimientos. Lo más importante que queremos destacar es que teníamos varias opciones de programación para llegar al mismo resultado y fuimos probando hasta dar con la que menos ocupa.\r\n</p>\n<p><strong>Usamos cuatro ventanas, y al seleccionar de la lista pasamos el título y el índice seleccionado a la nueva ventana. </strong> Además, hemos conseguido que las listas salgan cada una en un renglón diferente y por último introdujimos un botón de CONSEGUIDO para seguir motivando a los niños.\r\n</p>\n<p>Tenemos idea de realizar versiones posteriores con mejoras. El primer objetivo es ampliar con más experimentos. El segundo es clasificarlos por nivel de dificultad, pero no por edades para que nadie tenga límites. Y para terminar queremos que más gente pueda crear sus propios experimentos y ampliar la app con ellos <strong>usando una base de datos.</strong>\n</p>", "metacritic": null, "released": "2021-05-31", "tba": false, "updated": "2021-06-04T11:28:07", "background_image": "https://media.rawg.io/media/screenshots/e39/e399b2cf6892f71d98a82d8b553cdb68.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 108, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["HakerMate3"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}