{"id": 613205, "slug": "grow-slime-grow", "name": "Grow Slime, Grow", "name_original": "Grow Slime, Grow", "description": "<p>Use <tab> twice for the game to capture the mouse.</tab></p>\n<p>WASD move. Use your food for upgrades. </p>\n<p>Your goal is to \"clean the world of bad things\", so if you kill a spider you get score, if you eat food from the ground you lose score. Try to balance how much food you need to get just enough upgrades to be able to kill the spiders.</p>\n<p>There are 4 spider nests around the world, each with bigger spiders and also bigger food pallets to consume, which of course decrease even more your score if you eat them. Increase your defence and acid so that you don't die while spiders hurt themselves when they attack you.</p>\n<p>You stomach can hold a limited amount of food. Don't over eat! You have to grow your body first to grow your stomach so it can hold more food, but a bigger body makes you sluggish, so be careful!</p>\n<p>You also consume food over time. The bigger the body, the more food you consume, so think before you grow!</p>\n<p>Try to get a high score and comment down yours.</p>\n<p>Performance is not that great. For better experience, try out the executables.<br/></p>\n<p>Enjoy trying to break the game, haha! Its fairly easy. There is a cheat code which makes you invincible. Comment down if you find it (with no spoilers please) :D</p>\n\n<p>A small game made for Gogodot Jam.</p>\n<p>Eat as much as you can and try to become the largest slime around.</p>\n<p>Be careful with the dangerous monsters.</p>\n<p>And finally, go to my YouTube channel and tell me how much I need to improve: https://www.youtube.com/channel/UCiaBqW7PxoQ1hZcuSpLL3GA</p>", "metacritic": null, "released": "2021-05-31", "tba": false, "updated": "2021-06-04T11:16:37", "background_image": "https://media.rawg.io/media/screenshots/eae/eae8abc63131a2a4d65a4e7f072fcbac.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 51, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["Aknakos"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}