{"id": 61324, "slug": "wrack-exoverse", "name": "Wrack: Exoverse", "name_original": "Wrack: Exoverse", "description": "Introducing the first ever tower defense first-person shooter... with rogue-like elements! Wrack: Exoverse is the follow-up to the 2014 FPS Wrack, and continues the tradition of cel-shaded graphics, kill streaks, power shots, and kicking alien ass!Key Features<ul><li><strong>Defend ever-changing worlds!</strong> It’s a new world every time you play Exoverse. Construct a deadly maze for your enemies and see what awaits you in the item room before each wave.<br/></li><li><strong>Assemble your inventory!</strong> Collect consumables, runes, and artifacts with game-changing properties. These spawn in before waves, are dropped by champion monsters, and can be bought.<br/></li><li><strong>Unlock new weapons, areas, and items!</strong> As you progress through the game, unlock bigger, badder, deadlier weapons and other items to aid you along the way.<br/></li><li><strong>Unleash power shots!</strong> Every time you damage an enemy, you build up your power shot gauge. Once it’s full, fire a deadly power shot to wipe out enemies, shatter shields, and earn a ton of money through power combos!<br/></li><li><strong>Shop until you drop!</strong> Each new world starts at the Nebula Omnis – a central hub and shop. Use the money you’ve earned throughout the game to buy new weapons, items, towers, and even gamble!<br/></li><li><strong>Earn rewards for feats!</strong> Get money from kills, streaks, combos, headshots, and so on. Spend that money on towers, upgrades, the shop, or pocket it to increase your final score.</li></ul>", "metacritic": null, "released": "2018-03-06", "tba": false, "updated": "2019-08-28T21:58:12", "background_image": "https://media.rawg.io/media/screenshots/3a6/3a698179f3b02717a52e58ffeb392e51.jpg", "website": "http://www.wrackgame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 16, "toplay": 1}, "playtime": 1, "achievements_count": 56, "ratings_count": 1, "suggestions_count": 257, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Final Boss Entertainment"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Final Boss Entertainment"], "esrb_rating": null}