{"id": 61330, "slug": "vox-machinae", "name": "Vox Machinae", "name_original": "Vox Machinae", "description": "Game Description<br/>Take command and pilot a giant fighting machine in an escalating war between powerful corporations. Select your GDR (\"Grinder\") chassis and customize it with a powerful arsenal of lasers, missiles, cannons and more as you’re pitted against rival Grinder squads. Engage in seamless drop-in multiplayer action with no loot-box or micro-transaction nonsense. Vox Machinae respects your time, and your wallet.Key Features<ul><li>A weighty tactical VR simulator blended with responsive actionExperience the ultimate giant robot combat action-simulator that’s strong enough for your average screen, but BUILT for VR. An immersive physics simulation drives movement and combat, allowing you unleash your massive momentum on both ground and in aerial jumpjet battles. <br/></li><li>Crossplay between PC VR and Standard ScreensFight Together with your friends both inside and outside of VR. And with full support for Rift, Vive, and Mixed Reality, everyone can take part in the fray. </li></ul><br/><br/><ul><li>Experience Mega Multiplayer Mayhem with Unique Game ModesPlay offline, on a local network, or online with up to 16 players. Work with your team to recover and protect the monolithic Decker machine in Salvage mode. Control the most factories scattered across the battlefield as your team reaps the benefits of their production in Stockpile mode. All modes can be played with 2-4 teams, making it easy to squad up with your comrades.<br/></li><li>Fully Immersive Motion Control Cockpit OperationsBe the pilot and immerse yourself in VR, operating a giant grinder with your real hands. Fully motion control supported with a myriad of grabbable controls, each carefully arranged for maximum usability. Turn the ignition key to start’er up, tilt the sticks to guide your metal beast and jam on the throttle when you really need to punch it.</li></ul><br/><br/><ul><li>Customize your Giant Grinder, loadout, and Pilot tooChoose between five Grinder chassis, each with their own unique strengths and weaknesses. Then, deck your Grinder out with an array of devastating weaponry that caters to your preferred play-style. Finally make sure you’re looking your best for team VOIP comms with an assortment of headgear styles earned by proving yourself in the field.<br/></li><li>Bot Resistance, Bot AssistanceStave off those solitary moments with full bot support across all modes of gameplay. Whether you’re filling some empty seats on your server or honing your skills offline, our competent bots will gladly fight with or against you in epic battles.</li></ul>Setting<br/>Earth's resources have been depleted. People try to migrate to where there is work, but many end up detained in border camps living off what scraps the governments are able to provide. Powerful corporations explore the heavens in search of raw materials. You are one of the lucky few to be a certified pilot, able to take on the distant mining jobs. The rough alien landscapes can only be navigated by enormous walking robots called GDRs or \"Grinders\". Rivalry between the corporations is heating up, your job is about to get a lot more dangerous.", "metacritic": null, "released": null, "tba": false, "updated": "2023-12-16T00:09:44", "background_image": "https://media.rawg.io/media/screenshots/7c5/7c561f0bed066e7f4a794b0a40ecc51b.jpg", "website": "http://www.voxmachinae.com", "rating": 2.67, "rating_top": 4, "added_by_status": {"yet": 5, "owned": 66, "toplay": 2, "dropped": 6, "playing": 1}, "playtime": 1, "achievements_count": 30, "ratings_count": 6, "suggestions_count": 633, "game_series_count": 0, "reviews_count": 6, "platforms": ["PC"], "developers": ["Space Bullet Dynamics"], "genres": ["Action", "Simulation", "Indie"], "publishers": ["Space Bullet Dynamics"], "esrb_rating": null}