{"id": 61349, "slug": "car-battle-royale", "name": "Car Battle Royale", "name_original": "Car Battle Royale", "description": "<strong>ATTENTION: THE CAR BATTLE ROYALE</strong> is in developing. Perhaps, you better wait till it comes out, if you don't want to be disappointed. However, if you want to help us with your support and feedback, feel free to buy this game and be the one, who participates in the development process.<br/><br/><strong>THE CAR BATTLE ROYALE</strong> is а post-apocalyptic shooter on cars in the world where people forget what the humanity is. The only way they love to entertain themselves is smashing cars on the car battle arena. Only the bravest or sick have courage to participate in that kind of show. Who are you? If you are a great driver and better sniper, choose your death machine and crush everyone you meet on the way. There must be only one who can stay alive! <br/><br/><strong>EARLY ACCESS GAMEPLAY:</strong><br/>Pick the car you like best. Go onto the starting grid and wait for other players join the game. Choose the spot your car will be catapulted to. When the match begins, start looking for weapons! There are 9 types you can find on the location – from simple to legendary ones. Do not forget to provide yourself with ammo. You will come across various traps on your way, so watch out. Moreover, some location zones can have electromagnetic waves which appear from time to time and can damage your vehicle badly. Find a special toolbox and fix your car if needed. Destroy all your rivals and stay alive till the match ends.<br/><br/> <br/><strong>EARLY ACCESS GAME FEATURES:</strong><br/><ul><li>Absolutely sick cars with variety of stats and characters.<br/></li><li>Outstanding graphics and realistic post-apocalypse environment.<br/></li><li>Intuitive and simple controls.<br/></li><li>Unique background music and sound effects.<br/></li><li>Ratings and leaderboards.<br/></li><li>Several game modes for future updates.</li></ul><br/><strong>Do you know the taste of the win?</strong>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:58:11", "background_image": "https://media.rawg.io/media/screenshots/ba1/ba1db5af657ad91966774e9c16807cb8.jpg", "website": "https://bigbro.games/ru/cbr", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 17, "ratings_count": 0, "suggestions_count": 397, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BigBro Games"], "genres": ["Action", "Adventure", "Racing", "Massively Multiplayer"], "publishers": ["BigBro Games"], "esrb_rating": null}