{"id": 613413, "slug": "shadow-bouncer", "name": "Shadow Bouncer", "name_original": "Shadow Bouncer", "description": "Shadow Bouncer\r\n<p>You fiddled with the Boss's new invention and managed to separate yourself from your own shadow.<br/></p>\n<p>BIG MISTAKE!</p>\n<p>Using your shadow's insatiable need to copy your every move, trap it next to electric coils and pull the lever to capture it. You can fix this...</p>\r\nJam Notes\r\n<p>Following the jam theme \"The Big Mistake\" I built the game around a story in which an inventor's apprentice messes with a new invention and accidentally separates himself from his shadow. Like in Peter Pan. The rest of the game is the apprentice trying to fix his \"big mistake.\" </p>\n<p>I wrote and recorded my own music for this game. I thought it would be a good homage to include a sound sample from the original Peter Pan movie. If you listen closely to the music in this game, you can hear Wendy talking about missing one's shadow. I like adding these little touches.</p>\n<p>I honestly didn't know if I'd have time for this Jam. I had a trip planned for this weekend that I ended up canceling last minute because I was sick. Silver lining I suppose.</p>\n<p>Hope you enjoy this game! One of these days I sit down with one of my Jam games and build it into something bigger. I certainly have a lot of ideas to flesh this game out into more puzzles and detailed storyline.</p>\r\nCredits\r\n<p>Jordan Ottesen (me): Development, Music, Art, SFX</p><p><strong>Special Thanks</strong></p><p>@Tacosaurus: Background Art</p><p>Freesound.org: SFX</p>", "metacritic": null, "released": "2021-05-31", "tba": false, "updated": "2021-06-04T12:12:38", "background_image": "https://media.rawg.io/media/screenshots/5db/5db0ac3eac47bd65892d8ef99c8ecb72.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 36, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["Jordan Ottesen"], "genres": ["Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}