{"id": 613511, "slug": "shadoworlds", "name": "Shadoworlds", "name_original": "Shadoworlds", "description": "<strong>Deafening silence in the deep darkness of space.</strong><br/><br/>The Magna 6 system is home to the most advanced weapons lab the universe has ever known. Two months ago, communications with the orbiting facility mysteriously went dead without any warning. If the cutting edge weapons in the station were to fall into the wrong hands, the results would be cataclysmic. Knowing that quick action is necessary, but unaware of what terrors might have caused the break in communication, you are called in to lead a small team of brave but expendable explorers through the imperiled space station with a mission to ascertain the fate of its crew.<br/><br/>Krisalis Software and Teque London’s gripping isometric squad-based sci-fi action RPG follows your team of four explorers as they trek through the dark environments of the Weapons Research Facility to uncover the mystery of what went wrong. Each member of the team is chosen by the player based on their strengths and weaknesses, as well as their personality and individual history. As the leader of the unit, you have full control over the inventories and actions of your squad, even down to deciding when to use headlamps to illuminate the darkness. But watch out – the inky blackness of space hides friend and foe alike.<br/><br/><ul><li>Traverse the dimly lit corridors of the Weapons Research Facility and beam down to the planet surface for terrestrial excursions.<br/></li><li>Craft weapons by combining interchangeable items found on your mission and use them to battle against hostile defense robots and other menacing threats.<br/></li><li>Marvel at the real-time dynamic lighting powered by impressive Super Photoscaping lighting techniques. Watch lamps and explosions cast lights and shadows on the environment, and use your squad’s headlamps to illuminate puzzles along your route.<br/></li><li>Take full control of your team of explorers as you manage their inventories, guide their individual actions, and keep tabs on their life-giving fluid levels.</li></ul>", "metacritic": null, "released": "1991-12-31", "tba": false, "updated": "2023-02-08T10:46:58", "background_image": "https://media.rawg.io/media/screenshots/11e/11eadf761310500673c81d423519286e.jpg", "website": "https://www.ziggurat.games/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 9, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 229, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Krisalis Software", "Teque London"], "genres": ["Adventure", "RPG", "Strategy"], "publishers": ["Ziggurat", "Ziggurat Interactive"], "esrb_rating": null}