{"id": 613544, "slug": "operation-fate", "name": "Operation F.A.T.E.", "name_original": "Operation F.A.T.E.", "description": "It's 2123 and robots have invaded the Earth. Humanity has been forced to evacuate the planet in search of a new home out in space. An organization called Invasion Force (I.F.) has assembled to investigate the cause and find any means of reclaiming the planet.<br/><br/>Enter Ark, a young member of I.F. who's been tasked with fighting off the robots/automata on Earth, as well as reconnaissance duties. But his recurring eerie dreams as of late speak a mystery he is determined to pursue no matter what in hopes of finding answers to his long lost past...<br/><br/><br/><br/><br/>This game (will/already) feature(s):<br/><br/>- Bullet hell elements, toned down (made easier) for the general public + a unique bullet hell concept to make the game a little more interesting.<br/><br/>- Random generation (RNG). Tons of it. For this game, it means:<br/><br/><ul> <li> A hidden, randomly generated mystery (yes, randomly generated).<br/><br/> </li><li> An infinite number of bosses. Certain enemies (including bosses) are randomly generated, meaning they may have different weapon attachments, phases, and even behaviors.<br/><br/> </li><li> Levels are randomly generated, as is the world map (which of course extends to different types of enemies, items, etc.)<br/>Randomly generated dialogue options for the player to choose from.<br/><br/> </li><li> A chat feature with infinite dialogue possibilities where the player can talk to the characters. This has been implemented at a basic form, but is not included in Early Access.</li></ul><br/>- An immersive plot<br/><br/>- 3+ lovable characters (with depth of personality). <br/><br/>** If you are prone to epileptic seizures or anything of the sort when playing games with flashing lights/screens, I would advise you not to play this game.<br/><br/>** There are some horror elements, but they are \"polite\" (no instant jumpscares with loud noises).", "metacritic": null, "released": "2021-06-04", "tba": false, "updated": "2021-06-07T02:55:31", "background_image": "https://media.rawg.io/media/screenshots/076/076ea0f70649c20557b8b58d15bc0528.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 81, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Flash Phase Studios"], "genres": ["Action", "Adventure"], "publishers": ["Flash Phase Studios"], "esrb_rating": null}