{"id": 613536, "slug": "the-spirit-2", "name": "The Spirit", "name_original": "The Spirit", "description": " <br/>The Spirit is an Action Role-Playing game rogue like with elements of old school dungeon crawlers. <br/><br/>Our protagonist wakes up in a strange world looking for answers. He learns that he has died and returned to the realm as a spirit. The only way he can find his way back to the living is to find the Rift Keeper. He soon learns that the world is being overrun by creatures and demons entering through the Rift. The people of the realm need him, but so does his family.<br/><br/>One thing that I tried to focus on was to have NPC characters explain or tell little bits of the story. So, even though it is not necessary always for completing a level, the players might find it useful and hopefully interesting to chat to the NPC characters!<br/> <br/>Some NPC characters will be able to join you and help you fight your way through hoards of enemies. It will be your task to help heal them. The game features branching dialogue, so if an NPC offers to help you, it is possible to decline his offer.<br/><br/> <br/>Environments range from mystical forests, dark dungeons, villages, caves and citadels. The goal was to create \"pretty\", yet dark and gloomy environments for players to explore. There is even a haunted cemetery with massive hoards of enemies to slash down.<br/><br/><br/> <br/>There are many items in the game. The items can be purchased from merchants/traders in the game, or if you are really lucky, find them in a loot chest or crate.<br/>Items in the game are seen more as \"powerups\" than exchangeable items. Players can only equip 1 of each powerup item at a time. Items are used to increase the damage to the players attacks or give them abilities like mana or health rejuvenation.<br/> <br/>There is a gem slot in the players abilities that they will need to make use of. Players can equip a Fire Gem or Lightning Gem. This will give extra lightning or flaming damage to their melee attacks. They will not be able to slot both gems at the same time. These will be hard to find in the game, but players will be able to swap them out in game.<br/><br/> <br/>Along with many items available within the game for players to find in loot chests or crates, there will be items that will be useful in other ways. These seemingly useless items can be taken to a Crafting Altar. Players can then summon potions, weapons or useful items in a random fashion. <br/> <br/><br/> <br/>-      Discover the secrets of the new Realm you have woken up in.<br/>-\tBattle your way through branching level design. Play side-quests to earn extra loot and XP.<br/>-\tDiscover secret portals and areas that take you to new locations.<br/>-      Collect items in the game world and use them to craft weapons, potions or items at a Crafting Altar.<br/>-\tLearn to master many different spells. Some more powerful than others.<br/>-\tColorful, beautiful and vibrant worlds to explore.<br/>-\tFind different types of weapons like swords, spears and maces with varying damage. Use them to crush these beasts!<br/>-      Ragdoll physics makes for some fun killing of enemies.<br/>-\tGet NPC characters to join you on your quest and help you fight.<br/>-       Gain experience and level up from quests and killing enemies to gain more powers and become stronger.<br/><br/><br/> <br/>Dark Faction Games is a Solo-Indie game development company that has been making games since forever! The goal when creating this game was to try and build something solid for players to enjoy, and stay away from things that where too big or technical this time round. I want to learn as much as I can in all areas of game development. The funds and knowledge received from this game, will be used mostly to fund the next project and attempt something much more technical. I hope all of you find some value in this game. I love this game. Thank you for supporting DFG.", "metacritic": null, "released": "2021-06-04", "tba": false, "updated": "2021-06-07T02:47:54", "background_image": "https://media.rawg.io/media/screenshots/edc/edcc6d2438edf4fb4a3a9386e18e603a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 392, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dark Faction Games"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Dark Faction Games"], "esrb_rating": null}