{"id": 613588, "slug": "godswar-mobile", "name": "Godswar Mobile", "name_original": "Godswar Mobile", "description": "Take up your sword and earn your place on Olympus!<br/>Your destiny awaits!<br/><br/>Godswar Mobile is a new rpg in which you can meet Gods and legends from Greek mythology. You play as Achilles in the Siege of Troy before continuing on an epic journey of romance, war, and conquest. You must build a city, recruit talent, raise an army, conquer the world, and ascend to Olympus!<br/><br/>[Love Knows no Bounds]<br/>Fall in love with the noble Athena, or make the valient Ares fall in love with you! Your story, your rules.<br/><br/>[Recreate Legends, Rewrite Fate]<br/>Open Pandora's Box, steal the Golden Apple, or meet a singing Siren. Play an active role through these epic mythological stories. Will you save your people? Or will you embrace Chaos?<br/><br/>[Build a Utopia]<br/>Work together to build a powerful city. Send Ares to conquer new lands. Ask Prometheus to handle government affairs. You can even have Cerberus guard your granary.<br/><br/>[War and Glory]<br/>Recruit legendary Heroes and equip them with powerful Artifacts. Raise an army and train them into the most powerful force in the world. Form an alliance with other Lords and fight across battlefields of myth and legend. Fight for honor and glory!<br/><br/>[Relationships]<br/>Build strong and healthy relationships with the Greek legends. Create powerful heirs who bear divine blood. Build strong alliances with other players through marriage.", "metacritic": null, "released": "2021-06-03", "tba": false, "updated": "2021-06-07T03:28:44", "background_image": "https://media.rawg.io/media/screenshots/0ed/0ed86609cffbf7a70b834533f09fff8e_trRPoyy.jpg", "website": "http://www.igg.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 233, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["SkyRise Digital"], "genres": ["RPG"], "publishers": ["SkyRise Digital"], "esrb_rating": "Teen"}