{"id": 613542, "slug": "sex-with-the-devil", "name": "Sex with the Devil", "name_original": "Sex with the Devil", "description": "&quot;Hypocrites are people. They are all like that by nature. Imagine a masquerade ball. One dozen, two, three, a hundred or more people Dancing and spinning in the rhythm of music. But everyone is wearing a mask.&quot;<br />\nWhat is forgiveness and what is a lie? Where does desire end and vice begins? The project &quot;Sex with the Devil&quot; will allow you to ask these and many other frank questions about the greatest personification of evil in human culture.<br />\nThe ancient tempter always liked to watch your sinful life, and after death you appear before him in hell. Knowing that you can induce people to fall into sin on social networks, Satan offers to have fun and play a game. The reward will be answers to your deepest questions and fulfillment of your carnal desires.<br />\nKey features:<br />\nBeautiful and juicy demonesses;<br />\nAn abundance of hot scenes;<br />\nA unique atmosphere of grotesque in the game incarnation of hell;<br />\nExplicit scenes of madness and ultra-violence;<br />\nThe opportunity to get answers to many pressing questions;<br />\nIntriguing plot.<br />\nGameplay contains:<br />\n1. Conversation with the Devil. At this point you can communicate with the Devil and prepare to play with him;<br />\n2. Hell game. For his entertainment the Devil will send you to his labyrinth, full of traps, and start a hunt. If you&#39;ll be able to find an exit, as a reward he will grant you one wish;<br />\n3. Making a wish come true. For your victory in the previous round, Satan will fulfill your dirty dream. It can be sex with the Satan, beating him up or just a friendly handshake. Also, the Devil can answer any new questions you might have.</p>", "metacritic": null, "released": "2021-06-04", "tba": false, "updated": "2024-01-27T20:06:08", "background_image": "https://media.rawg.io/media/screenshots/55f/55feb29817d6076b61a54b5cd0adec81.jpg", "website": "", "rating": 3.12, "rating_top": 3, "added_by_status": {"yet": 3, "owned": 155, "beaten": 20, "toplay": 10, "dropped": 6}, "playtime": 2, "achievements_count": 4, "ratings_count": 24, "suggestions_count": 493, "game_series_count": 1, "reviews_count": 25, "platforms": ["PC"], "developers": ["Evil Boobs Cult"], "genres": ["Action", "Simulation", "Indie"], "publishers": ["Evil Boobs Cult"], "esrb_rating": "Adults Only"}