{"id": 613540, "slug": "desolatium-prologue", "name": "Desolatium: Prologue", "name_original": "Desolatium: Prologue", "description": "We have always believed that God sent his son into the world to save us. But, what if that is not what happened? What if the world cannot be saved? <strong>The real story is about to be revealed</strong>. <br/><br/>It all begins in the Massacre of the Innocents by the infamous King Herod. The player will walk in the shoes of Samara, a young woman who has just lost her child. As she wanders around the desert, praying to her God for help, something answers her call… something very ancient. A primal being, the closest thing to a creator that exists in this world.<br/><br/>This being has decided to grant her a central role in its return, so that the world finally knows the terrible intentions of their true god. To do this, she will be carried to a strange place where, finally, her fate will be revealed. <br/><br/><strong>Explore </strong>a city outside the limits of time and space; <strong>meet </strong>mysterious characters who will guide you on your journey; <strong>interact </strong>with the objects around you to <strong>solve </strong>complex puzzles in order to get to the terrible presence of a cosmic entity of immense power: <strong>Cthulhu</strong>.<br/><br/>The time has come to answer the call of <strong>The Great Dreamer</strong>.<br/><br/><br/><br/><br/><br/><ul><li><strong>Hyper-realistic graphics:</strong> All levels have been generated by shooting real locations in 360º and the integration of 3D elements in post-production.<br/></li><li><strong>Graphic point &amp; click adventure</strong> full of mystery.<br/></li><li><strong>Ambisonic Audio (8D):</strong> It generates an immersive sound effect that seems to come from all around the player. You will only need your headphones to live this experience.<br/></li><li><strong>Full immersion: </strong>Desolatium will be available for PC and, if you want to achieve total immersion, you will be able to use a Virtual Reality device (Steam and Oculus).</li></ul><br/><br/><br/><br/>\"Thank you very much for this new experience which is really good in terms of atmosphere and visuals and audio. I really like walking around and looking for objects and intersections with the game mechanics\" - Olivier<br/><br/>\"I really enjoyed playing the Prologue and looking forward to get the full Version\" - Blacky", "metacritic": null, "released": "2021-06-04", "tba": false, "updated": "2021-06-07T02:51:13", "background_image": "https://media.rawg.io/media/screenshots/468/4686732a9048452cf602be52c98bccea.jpg", "website": "https://desolatium.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 4, "owned": 153, "toplay": 1}, "playtime": 1, "achievements_count": 7, "ratings_count": 0, "suggestions_count": 185, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Superlumen"], "genres": ["Adventure", "Indie"], "publishers": ["SUPERLUMEN"], "esrb_rating": null}