{"id": 613560, "slug": "chubby-bear-smash", "name": "Chubby Bear Smash", "name_original": "Chubby Bear Smash", "description": "From the developer of Runster and Fitforce.<br/><br/>A fantasy adventure of a bear looking for delicious honey, but will he be able to complete his journey?<br/><br/>The forest is acting strange and the bees are evolving somehow, they are getting bigger and stronger but your tummy is growling so hard for something sweet. As a bear, you will have to overcome these bees to get your claw on yummy honey inside. Let's get moving, your tummy can't wait any longer!<h3>Motion-sensing control through a webcam:</h3>Use your body movement to attack the tree and fight angry bees until the beehive falls.<br/><br/><br/><h3>3 Gameplay modes available:</h3>train yourself and take on the challenges.<br/><br/><br/>(1) <strong>Journey:</strong> Encounter a series of enemies, beat those bees. Complete the journey and eat the most delicious honey.<br/><br/>(2) <strong>Quick Fight:</strong> Short fight with the enemies you have encountered. Revisit them for fun or to train yourself for the rematch.<br/><br/>(3) <strong>Endless:</strong> Fight endless waves of stronger enemies. Every time you defeat the enemy, you can choose a new talent to upgrade and customize the play style in your way.<br/>Your result will be recorded on the leaderboard, challenge yourself and become the strongest bear in the world!<br/><br/><h3>Be cool or cute or whatever:</h3>Customize your bear with costume and dance emotes received by completing stages in the game.<br/><br/><br/>", "metacritic": null, "released": "2021-06-04", "tba": false, "updated": "2021-06-07T03:09:45", "background_image": "https://media.rawg.io/media/screenshots/528/528c737dd0e60e73287357baffd71ead.jpg", "website": "https://chubbybearsmash.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 246, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Runnex Technology"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Runnex technology"], "esrb_rating": null}