{"id": 613620, "slug": "amaranthine-voyage-the-orb-of-purity-full", "name": "Amaranthine Voyage: The Orb of Purity (Full)", "name_original": "Amaranthine Voyage: The Orb of Purity (Full)", "description": "Unlock the complete adventure with a single purchase! No in-app purchases!<br/><br/>When Professor Bennett made another big breakthrough in the field of Harmonium research, she was naturally excited. But when a strange man falls through her new portal, she immediately calls you in to help. The man is deadly ill, and warns that his world is in terrible danger. Dark Harmonium is threatening to destroy his home, and apparently you’re the only one who can save it!<br/><br/>• WHAT AWAITS YOU BEYOND THE PORTAL?<br/>This visitor’s planet is being ripped apart, but by coming through the gateway, he’s brought that destruction to Earth as well. You must stop this dark force from tearing both worlds to pieces!<br/><br/>• EXPLORE A STRANGE NEW WORLD!<br/>Hunt for clues through a fantastic land of colorful hidden object scenes.<br/> <br/>• COLLECT HARMONIUM ENERGY WITH A SPECIAL GAUNTLET<br/>Harness this alien power by solving cryptic puzzles and mysterious mini-games.<br/><br/>• PREVENT A KIDNAPPING IN THE EXCITING BONUS CHAPTER<br/>Continue this astonishing story and enjoy additional Collector’s Edition exclusives including collectible Owls, morphing objects, and more!<br/><br/>*** Discover more from Big Fish! ***<br/><br/>Check out our entire game library with our Big Fish Games app absolutely FREE here: http://bigfi.sh/BigFishGamesApp<br/><br/>Sign up for our newsletter and never miss a new release or promotion again: http://bigfi.sh/iSplashNewsletter<br/><br/>Big Fish is the leading global marketplace to discover and enjoy casual games. You can enjoy our virtually endless selection of games anytime, anywhere — on your PC, Mac, mobile phone, or tablet. Learn more at bigfishgames.com! <br/><br/>Become a fan on Facebook: http://www.facebook.com/BigFishGames<br/><br/>Follow us on Twitter: http://bigfi.sh/BigFishTwitter", "metacritic": null, "released": "2016-10-19", "tba": false, "updated": "2021-06-07T03:44:03", "background_image": "https://media.rawg.io/media/screenshots/f3e/f3e13cea253b0d1ce931a720c626ba4b_OEmkGsa.jpg", "website": "http://www.bigfishgames.com/mobile-games/ios-games/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 249, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Big Fish Games"], "genres": ["Adventure", "Puzzle"], "publishers": ["Big Fish Games"], "esrb_rating": "Everyone 10+"}