{"id": 6137, "slug": "chain-quest", "name": "Chain Quest", "name_original": "Chain Quest", "description": "--- RECEPTION ---<br/><br/>&amp;quot;When you can combine role-playing action with puzzles, this makes for a very interesting experience. That’s just what you get in Chain Quest, an addictive puzzle game with a nice twist of fantasy role-playing mechanics.&amp;quot; - Jeff Byrnes (AppAdvice) <br/><br/>&amp;quot;I can see this being a game you’ll keep coming back to, I couldn’t bring myself to stop playing it!&amp;quot; - Christopher Hannah (AppRecap) <br/><br/>&amp;quot;Combine the addictive nature of match three games with leveling up and battle. Thats right, you get an extremely addicting game called Chain Quest.&amp;quot; - Ryan Poolos (Ray Wenderlich Reader&amp;#39;s App Reviews) <br/><br/>--- ABOUT ---<br/><br/>Defeat your enemies and break all highscores in Chain Quest! Every fight is a thrilling puzzle of attack and defense. Level up your hero, unlock mighty skills and befriend frightening monsters.  <br/>Only if you master all your abilities you will have a chance to be one of the best in Chain Quest!<br/>Can you become a champion of the chains?<br/><br/>Features<br/><br/>- Choose from three fearless heroes<br/>- Defeat your enemies in an innovative puzzle fight system<br/>- Earn experience and develop your hero as you like<br/>- Unlock 50 unique skills and unleash them in the fight<br/>- Collect different monsters and let them fight for you<br/>- Set highscores and compete in global Game Center leaderboards<br/>- Challenge your friends in local multiplayer<br/>- Premium game: No in-app-purchases or hidden costs<br/>- Universal app, play on your iPhone or iPad", "metacritic": null, "released": "2015-12-16", "tba": false, "updated": "2019-10-22T14:28:39", "background_image": "https://media.rawg.io/media/screenshots/84f/84f82afc4df56cbd7e813b1622f55888.jpeg", "website": "http://devbats.com/chainquest", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Maximilian Opitz"], "genres": ["RPG", "Puzzle"], "publishers": ["Maximilian Opitz"], "esrb_rating": "Everyone 10+"}