{"id": 61389, "slug": "fast-cars-racing", "name": "Fast cars racing", "name_original": "Fast cars racing", "description": "Fast cars racing is an incredible, amazing and endless racing game! This game has all the racing enthusiasts want to have: cool cars, high speed, different tracks and much more.<br/><br/>Become the king of street racing with the game Fast cars racing! Race the faster you can, outrun your opponents, but be careful, you can fly out of the track! If you would be lucky, you can land on the other level, if no...<br/><br/>Try out different cars, adjust their settings, make your own, perfect personal racing car! As an excellent car driver you need to drive speed car precisely, at fast pace and become the best one! Climb up the leaderboards!<br/><br/>Key features of Fast cars racing game:<br/><br/><ul><li> Super 3D graphics<br/></li><li> Smooth and realistic car handling<br/></li><li> 10 different cars to choose from<br/></li><li> 5 game modes: racing, arcade, drift, fun and custom<br/></li><li> Many different tracks<br/></li><li> Possibility to turn ON or OFF ABS, ESP, TCS and SH<br/></li><li> Several different cameras<br/></li><li> Possibility to choose the number of opponents from 1 to 19 (with 19 opponents game may slow down, please choose the best suitable number of opponents for your PC)</li></ul><br/>Feel the thrill of gravity-defying racing across many high-speed tracks! Thrust yourself into another level of adrenaline-fueled driving and drifting. Enjoy the cutting edge 3D graphics with realistically created environments and amazing cars.", "metacritic": null, "released": "2018-08-24", "tba": false, "updated": "2019-08-28T21:58:09", "background_image": "https://media.rawg.io/media/screenshots/e53/e53dc5379fca1d8dc7cdf32065a28fb9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 93, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC", "macOS"], "developers": ["Tetyana Kozlovska"], "genres": ["Action", "Simulation", "Sports", "Racing", "Indie"], "publishers": ["Tetyana Kozlovska"], "esrb_rating": null}