{"id": 613956, "slug": "astwrong", "name": "Astwrong", "name_original": "Astwrong", "description": "<p>Bu oyun Boğaziçi Gamejam için 48 saatte yapılmıştır.</p>\n<p>Boğaziçi Gamejam için bu oyun 48 saattir.</p>\n<p><strong>\"İyi Olan Kaybetsin\"</strong><br/></p>\n<p>Boğaziçi Gamejam tarafından belirlenen tema olan \"İyi olan kaybetsin\" kapsamında geliştirilen Astwrong'ta yaşadığımız gezegende iyi (normal) olan şeyler ya başka bir gezegende bir şeyleri kaybetmemize neden olsaydı. İşte Astwrong bunun üzerine geliştirildi. Oyunumuzda duvarlardan geçebilirsiniz ama merdivenlerden çıkamazsınız gibi olağan şartlarda iyi olan şeylerin kaybettirdiğini göreceksiniz.</p>\n<p><strong>ASTWRONG</strong></p>\n<p> Astwrong!! Astwrongta iyi bir oyuncu olmanızın hiçbir önemi yok. Derin uzay araştırmaları için görevde olan bir astronotu canlandırdığımız Astwrongta bildiğimiz doğruların yanlış bildiğimiz yanlışların da doğru olduğu bir gezegene düşüyoruz. Amacımız da bu kafa karıştırıcı gezegenden bir an önce kaçmak. Astwrong acımasız bir oyun. Ne yapacağınıza karar veremediğiniz hangi yolun doğru olduğunu her seferinde sorgulamanız gereken bir oyun. Bu yüzden ilerledikçe daha da gerilecek ve karar verme yeteneğinizi kaybedeceksiniz. Simurg Universe ekini olarak her şeyin mümkün olduğu evrenler yaratıyoruz. Ve Astwrongta başınıza her şeyin gelmesi mümkün… Denemek için cesaretiniz var mı?</p>\n\n<p><strong>Not :</strong> Oyundaki asset, kod ve diğer varlıklar Simurg Universe' e aittir. Kullanılan arka plan sesi Boğaziçi Gamejam sponsoru MadRooster tarafından sağlanan SFX'lerden kullanılmıştır.<br/></p>\n<p>Soru, sorun, destek, öneri bildirmek ve proje ortaklarımıza dahil olmak için discord sunucumuza gelebilirsiniz https://discord.gg/ZUsanPb99f</p>", "metacritic": null, "released": "2021-06-06", "tba": false, "updated": "2021-06-07T05:11:36", "background_image": "https://media.rawg.io/media/screenshots/280/280d48178ed65b74692acd6a04ef7156.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 34, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Simurg Universe"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}