{"id": 613986, "slug": "nightcats-train", "name": "Nightcats' Train", "name_original": "Nightcats' Train", "description": "<em>Oyundaki kod, modeller, UI, ses, muzik, efekt ve animasyon ekibimiz Nightcats (Berivan &amp; Ogulcan) tarafindan gamejam sirasinda uretilmis, 48 saatlik sure icinde tamamlanmistir.</em>\n\n<p>Post-apocalyptic bir dunyada, dunya artik insan yasamina uygun olmadigindan dolayi; Olci adinda bir yapay zeka insanligi kurtarmak icin bir gorev baslatiyor. Oyuncu bir treni kontrol ediyor ve her durakta farkli hikayeleri olan farkli insan topluluklarini trene alarak kurtarip kurtarmamayi seciyor. Ancak trenin kapasitesi sinirli, bu nedenle oyuncu hangi insanlarin kurtarilmaya deger olduguna karar veriyor.</p>\n\n<p>Bu kararlari verirken kapasite, trendeki mevcut insan sayisi ve gelecek duraktaki insan sayisina ve insanlarin hikayelerine dikkat etmeli.  Ancak hikaye bununla sinirli degil ve oyuncu beklenmedik bir sonla karsilasiyor.</p>\n\r\nOyun Ici Kisa Video \r\n\r\n\n\r\nFull Gameplay\r\n\r\n\r\n\n\r\n*************  SPOILER  *************\r\n*\r\n*\r\n*\r\n<p>AI icin acidan kurtulusun iki yontemi var: biri hic dogmamis olmak. Ancak bunu gerceklestiremeyecegi icin ikinci secenek olarak insanlari olume (evrensel et ogutucusune) goturmeyi seciyor. \r\n</p>\n<p>Oyuncu iyi ve ahlaki kararlar vererek insanlari kurtardigini sanarken aslinda onlari olume goturuyor. \r\n</p>\n\n\n<p>Skybox - https://assetstore.unity.com/packages/2d/textures-materials/sky/skybox-series-fr...</p>\n<p> Font - https://www.1001freefonts.com/unity-titling.font<br/></p>", "metacritic": null, "released": "2021-06-06", "tba": false, "updated": "2021-06-07T05:18:57", "background_image": "https://media.rawg.io/media/screenshots/7be/7bededdc24d3c254ee6aa1df279aade4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 178, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["berivanucan"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}