{"id": 61415, "slug": "pummel-party", "name": "Pummel Party", "name_original": "Pummel Party", "description": "<strong>Pummel Party is a 4-player online and local-multiplayer party game. Pummel friends or AI using a wide array of absurd items in the board mode and compete to destroy friendships in the entertaining collection of minigames.</strong>ONLINE AND LOCAL MULTIPLAYERPlay how you want. Pummel Party allows 1 to 4 players to compete both online or locally on the same screen. Whether its online, or in person, it's all the same friendship ruining fun.<br/><br/><br/>BOARD MODEThere can only be one winner here, and you know it has to be you! Battle through hazardous terrain to acquire an arsenal of weapons and items and employ them however you can to make sure that you reign victorious over your friends.<br/><br/><br/>ITEMSIt's all out war! Use an array of absurd weapons and objects to claw your way to victory.<br/>From the simple 'Punching Glove' to the ridiculous 'Remote Controlled Eggplant' the items in Pummel Party will lead to many funny and rage enducing moments. It's never been easier or more satisfying to crush your friends aspirations of winning!MINIGAMESFrom simple nostalgic fun to unique and evolutionary Pummel Party contains a wide array of exciting minigames. Knock your friends in to the abyss in 'Snowy Spin', dig three dimensionally in 'Sandy Search' to be the first to find the treasure and make sure you're not holding the bomb when it goes off in 'Explosive Exchange'.MINIGAME MODEJust want to jump in to the action? Pummel Party includes a minigame mode so that you can get straight to the games!BOTSAlready destroyed all your friendships or just need to fill out your roster? Pummel Party includes full bot integration meaning you can still play or practice Pummel Party with any number of real players.", "metacritic": null, "released": "2018-09-20", "tba": false, "updated": "2024-03-17T10:34:00", "background_image": "https://media.rawg.io/media/screenshots/c96/c968a71ce3529528065cc27385c1e0a9.jpg", "website": "http://www.rebuiltgames.com/", "rating": 3.89, "rating_top": 4, "added_by_status": {"yet": 35, "owned": 1081, "beaten": 65, "toplay": 16, "dropped": 108, "playing": 23}, "playtime": 4, "achievements_count": 31, "ratings_count": 159, "suggestions_count": 382, "game_series_count": 0, "reviews_count": 163, "platforms": ["PC"], "developers": ["Rebuilt Games"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Rebuilt Games"], "esrb_rating": null}