{"id": 61433, "slug": "tony-slopes", "name": "Tony Slopes", "name_original": "Tony Slopes", "description": "IntroductionHumans were never meant to fly... But then the double bass was never meant to be raced down a cliff face at 100mph either! Its the 21st Century people. We need to adapt and evolve. <br/>Why? Because today’s extreme sports don’t seem to offer the adrenaline rush of the good old days. <br/>Now, every desk-junkie keyboard-warrior,  every uptown’ funk-lovin’ hippy, every rodeo-ridin’ country bumpkin and every knuckle-dragging 300lb primate demands so much more! <br/><br/>Jump into the world of Tony Slopes and race a whole host of utterly useless (but entertaining) vehicles across some of the most ridiculous and terrifying downhill terrains. Put your pedal to the metal, or whatever your vehicle’s equivalent is... and find that thrill-seeking experience you’ve been so longingly craving. Whether you’re riding a rubber dingy, an office chair or a humpback whale, we advise you to keep all hands inside the vehicle at all times! <br/><br/>Race in single or multiplayer mode and tackle some of the most extreme races, from the Snowman’s Deathdrop up in Snowy Peaks to the Ring of Fire at Mount St.Tonys. Single player racing is your time to build up skills to unlock new levels and vehicles, whilst multiplayer is where you will be able to earn the funds you need to pick up some brand new safety gear from the Haberdasher! After all, nothing says extreme protection like donning a fluorescent orange traffic cone! <br/><br/>With 16 hilarious races to compete on, over 9 unique vehicles and 20 outlandish headpieces to show off, Tony Slopes is bound to keep you and your friends entertained for hours on end.<br/><br/>We urge all followers of Tony Slopes to not recreate anything you see here at home...or anywhere else for that matter! Remember this is still a video game and frankly if you’re going to try and race a living breathing crocodile down the side of mountain, you deserve to get eaten!ReleaseComing January 2019!", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:58:07", "background_image": "https://media.rawg.io/media/screenshots/98a/98a1fdc8b754be5407d4ec19dd70d632.jpg", "website": "http://www.tonyslopes.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 228, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["PrimevalGames"], "genres": ["Racing", "Casual", "Indie"], "publishers": ["PrimevalGames"], "esrb_rating": null}