{"id": 614401, "slug": "out-of-sight-out-of-my-mind", "name": "Out of Sight, Out of My Mind", "name_original": "Out of Sight, Out of My Mind", "description": "<p>An infinite runner, zombie survival game, \"Out of Sight\" is my first playable game and first game jam entry, representing my submission for Trijam #123. Any and all feedback would be hugely appreciated!</p>\n<p>By using the perfect logic of every little kid, \"hide\" from the monsters by closing your eyes. Get as far as you can without getting caught!</p>\n<p>Move left/right with A/D and forward with W. \"Close your eyes\" with SPACE in order to freeze the monsters where they are. Get points by making forward progress, and don't get touched by a monster. The zombies will not move while your eyes are closed, but if you run into them, they will still get you!</p>\n<p>In spite of the \"3 hour\" recommendation, development took almost double that, with plenty more work that could be done. The game was developed using Unity, and several assets were found through OpenGameArt.org, (see below).</p>\n<p>Music: \"Horror Game Chase Theme\" by Seizawa - https://opengameart.org/content/horror-game-chase-theme - License: CC-BY-SA 4.0 </p>\n<p>Zombie Sound Effects: \"Zombies Sounds Pack\" by artisticdude - https://opengameart.org/content/zombies-sound-pack - License: CC0</p>\n<p>Zombie Sprite: \"[LPC] Zombie\" by Benjamin K. Smith, commissioned by castelonia. Based on the male LPC base by Stephen Challener (Redshrike) and the thrust and shoot animations by Johannes Sjölund (wulax). - https://opengameart.org/content/lpc-zombie - License: CC-BY-SA 3.0, GPL 3.0</p>", "metacritic": null, "released": "2021-06-05", "tba": false, "updated": "2021-06-07T07:04:42", "background_image": "https://media.rawg.io/media/screenshots/0ec/0ec1d8a544232277675634dafc5cee14.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 39, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["McMac"], "genres": [], "publishers": [], "esrb_rating": null}