{"id": 614495, "slug": "rps-rock-paper-scissor", "name": "R.P.S. Rock Paper Scissor", "name_original": "R.P.S. Rock Paper Scissor", "description": "<p>Because of exams. I couldnt finish my game in time sadly. So here is a messy try at a game.<br/></p>\n<p>Here was the main ideas for the game: You are kidnapped by an organisation that forces you to play rock paper scissor competition with a bunch of AIs, to win you need to identify the logic behind the IA choices. (Only pick rocks/pick rock the next round after you pick scissors...). <br/></p>\n<p>The only rule is no cheating. You will win money each round that you can use \"without cheating\" to increase your health/time allowed, watch replay of past match of the IA, or \"with cheating\" by buying hints about your next opponent, or even hacks that breaks the IA for a few rounds. <br/></p>\n<p>The first duels were supposed to be very easy with predictable behaviours(picks only rock, pick in a circular pattern,picks the last choice you took), <br/></p>\n<p>the middle duels were supposed to be tough to beat without hints(If you play the same thing twice it will react in a way that wins if you do it again else it will take a choice randomly),</p>\n<p> and the last ones could be next to impossible without cheating (will take the winning move if you take less than 10 seconds to pick/will act as if he is playing against the win-stay, lose-shift strategy: https://arstechnica.com/science/2014/05/win-at-rock-paper-scissors-by-knowing-thy-opponent/)</p>\n<p>1st round:  picks randomly for the 1st turn then picks the choice that would have beat your last turn choice.<br/></p>\n<p>2nd and + round: random<br/></p>\n<p>There is no ending ;(.</p>\n<p>I'll try finishing it after the jam.<br/></p>", "metacritic": null, "released": "2021-06-04", "tba": false, "updated": "2021-06-07T07:27:02", "background_image": "https://media.rawg.io/media/screenshots/827/82737d188b535599f789da014e7c1d75.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 4, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Herweins"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}