{"id": 61450, "slug": "planetary-settlers", "name": "Planetary Settlers", "name_original": "Planetary Settlers", "description": "<strong>Summary:</strong><br/>This is a game with real benefits!  You can learn facts about the solar system and science as you play!  Planetary Settlers is a family friendly video game about exploring the solar system.  Experience realistic gravity as you control Blue 42 on each planet, completing mini games, uncovering secrets, and completing quizzes to enhance your abilities as you explore and help humanity reach out into the solar system!<br/><br/><strong>Early Access:</strong><br/>Planetary Settlers is playable, with many more features in development, and you have the opportunity to suggest additional features and provide other suggestions to guide the future of the game.  I currently have the inner solar system, with a level each for Mercury, Venus, Earth, the Moon, and Mars.<br/><br/><strong>Planned updates:</strong><br/><ul><li>Add a level for each of the other planets, as well as Pluto, some of the more notable moons, and more! <br/></li><li>Add more minigames to each of the existing inner planet levels. <br/></li><li>Add a leveling system (e.g. more nanites gives more powerful abilities)<br/></li><li>Add text color customization option</li></ul><br/><strong>Details:</strong><br/>Planetary Settlers is currently in development.  Take control of an advanced AI robot named Blue 42, and explore the vast solar system, to include the different planets and many of the moons.  Explore our possible future in the year 2142, with realistic environments based on imagery and data we have gathered on the various planets and moons.  Gravity is accurate, when you jump, throw a rock, or fly, you will experience the actual gravity of the planet / moon.<br/><br/>Blue 42 has the following features, which can be enhanced through collecting more nanites:<br/><ul><li> Various technologies to shield against the harsh environments of space and various worlds, to include extreme heat, extreme cold, low pressure, high pressure, corrosive chemicals, radiation, and harmful dust.<br/></li><li> A color customizable light, with adjustable brightness<br/></li><li> An color customizable projectile generator, a \"gravity probe\" to see the effect of gravity on each world, and to have fun with.  You can even make the projectiles glow a color of your choosing.  More nanites allow you to increase velocity<br/></li><li> Treads, to move along the surface.  Can be adjusted to go very fast if you collect enough nanites!<br/></li><li> Tread jumper - Jumps by launching the treads down quickly (sort of like how a grasshopper hops).  Power can be boosted to allow you to leap over a building!<br/></li><li> Jetpack to fly!<br/></li><li> Grabber beam to hold and release large objects.  Note: It is fun to throw things by grabbing them, running at high velocity, and releasing, or by grabbing, rotating quickly and releasing.</li></ul><br/>This game is being developed first for Windows PCs / laptops, but I plan to expand into other languages and other platforms later.", "metacritic": null, "released": "2018-05-30", "tba": false, "updated": "2019-08-28T21:58:07", "background_image": "https://media.rawg.io/media/screenshots/2e4/2e4eabf2fefa85ea432a1cee2fe26543.jpg", "website": "https://levgames.wixsite.com/planetary", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 5}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 272, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Leveler Games"], "genres": ["Adventure", "Indie"], "publishers": ["Leveler Games"], "esrb_rating": null}