{"id": 614500, "slug": "when-the-winter-comes", "name": "When the Winter Comes", "name_original": "When the Winter Comes", "description": "<p>When the Winter Comes is an experience about meeting a character and going through trauma in the worst storm since the Great Blizzard of 1899. </p>\n<p>With this Visual Novel, we wanted the focus to be on really getting to know the character, learning about her life, likes and issues, using the information you have not only in a \"Dating Simulator\" setting, but in a real setting. of having to help and be there for that person, keeping them comfortable during the hardest day of their lives, and also trying to stay alive. </p>\n<p>We want the blizzard setting to look as real as possible emphasizing all the dangers that come with a storm of this size and all the care needed to survive such an event, we also want the characters' psychological to have a big impact, having to stay sane in the face of such difficulties to have the energy to continue fighting for their lives.</p>\n<p> The first chapter of the game is very calm, made so you can calmly know a little about the character before the difficulties start, just a friendly conversation between two neighbors, in the following chapters, the cold and the need to maintain a certain temperature will be introduced. to stay alive and healthy. </p>\n<p>The game is designed to be a short experience that must be repeated several times making different choices each time to see everything that has to be offered, the game will have persistence of the information obtained in each gameplay, so your character will remember everything that learned from previous plays, thus allowing you to access previously impossible dialogues and unlock the true end of the game.</p>\n<p> In technical matters, the game is being developed on the Godot Engine, using a scripting system developed by the team that will be made available with each copy of the game in an open source way when the game is published. </p>\n<p>The game will feature 4 main gameplay systems, choices, which the player will use to make their decisions and choose their path in the story, affection, which will measure how well the player and the main character are getting along, temperature, which will monitor the temperature of the player's and character's body and must be kept at healthy temperatures with the player's choices and finally, the knowledge system, that while you talk to the main character you can see words marked in blue, that it means it's information your character will remember in the future and can use to make different decisions.</p>\n\n\n\n\n\n\n\n\n\n<p>The game is schedule to release on February 22, 2022</p>\n<p>We will be releasing private demos for our buyers in the meantime with every new breakthrough.<br/></p><p>Yuki, our main character, also has a instagram account, its in portuguese, but you can still see her beautiful photos even if you dont speak the language, its @YukiTheSheep</p>", "metacritic": null, "released": "2021-06-04", "tba": false, "updated": "2021-06-07T07:28:13", "background_image": "https://media.rawg.io/media/screenshots/757/75710bd1d415d0bb441100658077afdc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 34, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["White Lotus Digital"], "genres": [], "publishers": [], "esrb_rating": null}