{"id": 614749, "slug": "transition-space-an-interactive-final-design-proje", "name": "Transition Space: An Interactive Final Design Project v2", "name_original": "Transition Space: An Interactive Final Design Project v2", "description": "<p>This interactive game is the final deliverable for my Basis Independent senior research project, \"A Study Of Liminal Space In The Architecture Of Transportation Facilities\"!</p>\n<p>In this game, the player is free to explore a number of virtual spaces showcasing architectural elements in transition spaces such as airports and train terminals. Half of these spaces serve as my proposal for transportation architecture that creates \"sense of place\", based on the findings of my research.</p>\n\n<p><strong>How to play:</strong></p>\n<p>There are two ways to play this game. The first is to click \"Select\" from the start menu to choose which space you would like to walk through (recommended). The second is to click \"Start\" from the start menu. This will place you in a hub area where you can explore each of the spaces in a sequence, accessible by walking down either of the two hallways.</p>\n<p>Exit \"portals\" are hidden somewhere in each space! You'll know when you have found one when the screen starts to fade to white. These transport you to another scene.</p>\n<p><strong>Controls:</strong></p>\n<p>WASD: Move</p>\n<p>Mouse/Touchpad: Look around</p>\n<p>Escape: Pause menu</p>\n<p><strong>A Note About Browser Version:</strong></p>\n<p>Click \"run game\" above to run the browser version. Due to WebGL-related limitations, I had to remove the performance-heavy \"storage\" scene which you can walk through in the Windows/Mac versions to save space. I also had to reduce the quality of lightmaps, so if you would like to play the high fidelity version I will show during my presentation, feel free to download.</p>\n\n<p>I'd like to give a special thanks to my advisors Mr. Opirhory and Jonathan Toews for all of the insight, guidance, and interesting conversation they have provided over the course of this project, as well as my parents for sharing their expert knowledge with me during the data-analytical portion of my project.<br/></p>\n<p>I'd also like to give many thanks the Senior Project Committee for making this project possible, as well as Michigan State University for the excellent online course in Game Development using Unity and for many of the assets used in this project.</p>\n<p>Link to my project blog:</p><p>https://brooklyn.basisindependent.com/author/jacobh/?_ga=2.128284748.1132024536....<br/></p>", "metacritic": null, "released": "2021-06-04", "tba": false, "updated": "2021-06-07T08:37:04", "background_image": "https://media.rawg.io/media/screenshots/74d/74dae77e801c6b258c22c5c312cb71fc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 70, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Web"], "developers": ["thenoseofsauron"], "genres": [], "publishers": [], "esrb_rating": null}