{"id": 6148, "slug": "zombies-board-game", "name": "Zombies !!! Board Game", "name_original": "Zombies !!! Board Game", "description": "Zombies!!!  : This one's a no brainer!<br/><br/>• Play up to 4 friends : local and cross-platform<br/>• Survival mode<br/>• Build a city or play in a prebuilt city<br/>• Expansion Pack : Not Dead Yet<br/><br/>Zombies!!! puts you in the middle of the action in this video game adaptation of the hit board game. <br/><br/>In order to escape the ever advancing zombie horde, players must use a combination of wits and brawn to be the first to the heliport and certain escape. The only problem is, the zombies are everywhere, they appear to be very hungry and your opponents would really prefer if you didn't escape. However, there’s no need to take this horde on your own. The game allows up to 4 other human or AI players to join in on the fun. AI players can be chosen from 10 different characters, each with a unique play style.<br/><br/>Take on the Standard Game Mode, building your game board one tile at a time and killing zombies within the confines of the official Zombies!!! rules. Generated Town Mode drops the players into a premade town with Zombies in wait to make you their next meal. Survival Mode is the ultimate test: You versus a town full of zombies! How long can you last?<br/><br/>Not Dead Yet is a fun expansion on the board game that includes additional cards and animations.<br/><br/>If you have any questions, requests, ideas, or want to report bugs, please send us an email from ‘how to play’ menu. Or visit our support site at <br/><br/>http://zombies.babaroga.com http://facebook.com/babarogagames. <br/>Twitter: @babarogatweet<br/><br/>We care deeply about this game, and if there are any suggestions about how to make it better, we will do it in future updates. We care about you, the game and your experience", "metacritic": null, "released": "2013-07-15", "tba": false, "updated": "2019-07-30T07:56:36", "background_image": "https://media.rawg.io/media/screenshots/342/34237ad35e94a48daf5ad48b7a401a86.jpg", "website": "http://zombies.babaroga.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 221, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Babaroga"], "genres": ["Board Games", "Card"], "publishers": ["babaroga"], "esrb_rating": null}