{"id": 61486, "slug": "medieval-shopkeeper-simulator", "name": "Medieval Shopkeeper Simulator", "name_original": "Medieval Shopkeeper Simulator", "description": "Medieval Shopkeeper Simulator is a medieval management, exploration and adventure game currently under development by Breakfast Studio.<br/><br/><br/><br/>Create, manage and expand your merchant empire, explore the borders of the world and properly manage your stores to become the most important trader in the kingdom.<br/><br/>Manage your stores, organize your workers, deliver orders, exchange and create unique items, unlock new skills and advantages, hire warriors for adventures, explore the world, resist global events like a plague or a war, plan your financial strategy supporting or confronting the crown and the church, alter the economy of the kingdom and its laws and face consequences of your decisions.<br/><br/>Depending on the king or queen that governs, there will be laws that will suit you more or less depending on your way of playing. The world of MSS reacts to every decision and even prices in stores, punishing mistakes with your reputation. Be careful and make wise decisions, visit the seer to reveal future events and prepare yourself to them.<br/><br/><br/>Now that we move to the alpha stage, you can expect the following content in the coming months:<br/><br/><strong>MORE REAL LAWS</strong><br/>For now there are only a few types of laws such as the prohibition of the sale of some objects. In the future, each king/queen will be a unique event that will have a lot of weight in the balance of the game and your way of playing. (Second quarter of 2018).<br/><br/><strong>CUSTOMIZATION OF HOUSES</strong><br/>You can combine different models acquired in the architect to create your dream house. (First quarter of 2018).<br/><br/><strong>STORAGE REFACTORING</strong><br/>The management of objects will become a totally new and improved game mechanic: players can organize their stock of objects as they wish. Do you need more space to store objects? Buy and improve an empty warehouse in the city. (First quarter of 2018).<br/><br/><strong>KINGDOM 2.0</strong><br/>A new generation system by a procedure that will improve performance and allow you to explore in each game a new, different kingdom. These new realms will contain more diverse buildings, specific events, more characters and much more. (Second quarter of 2018).<br/><br/><strong>CLIMATE AND DANGERS</strong><br/>A totally new system that challenges players during the gaming experience. Confront the environmental effects by preventing them or fighting with different global diseases and neighboring wars. (First quarter of 2018).<br/><br/><strong>KNOWN ISSUES:</strong><br/>There are some problems you might experience in the Alpha version of the game:<br/><ul><li> bugs<br/></li><li> freezing<br/></li><li> loss of saved games</li></ul><br/><br/>If the essential game mechanics is attractive and you want to give your support to Medieval Shopkeeper Simulator while you are in early access, we would love to have you. Otherwise, we recommend waiting until MSS exceeds the alpha stage when the game is more stable, and the game mechanics are more developed. I am committed to converting Medieval Shopkeeper Simulator into the best possible game, and your help during this early phase of development is crucial for us to achieve our goal.<br/><br/>If it intrigues you to know where we will take Medieval Shopkeeper Simulator, consult our roadmap and the development vlogs that I publish several times per month.", "metacritic": null, "released": "2018-05-11", "tba": false, "updated": "2022-08-22T06:22:39", "background_image": "https://media.rawg.io/media/screenshots/0e7/0e761d312325fbced7cbf4e2eed3b637.jpg", "website": "", "rating": 0.0, "rating_top": 3, "added_by_status": {"yet": 1, "owned": 225, "beaten": 1, "toplay": 1, "playing": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 5, "suggestions_count": 341, "game_series_count": 0, "reviews_count": 5, "platforms": ["PC"], "developers": ["David Moralejo Sánchez"], "genres": ["Adventure", "RPG", "Simulation", "Indie"], "publishers": ["GrabTheGames"], "esrb_rating": null}