{"id": 614968, "slug": "the-anacrusis", "name": "The Anacrusis", "name_original": "The Anacrusis", "description": "<p>The Anacrusis is a four-player, cooperative first-person shooter set aboard a massive starship stranded at the edge of explored space. Team up with your friends in an infinitely-replayable fight against alien hordes to unlock perks, weapons, and new ways to play that you can share with your team!<br />\nJoin the Community</p>\n<p>Wishlist The Anacrusis on Steam for regular development updates. Join the Discord for exclusive access.<br />\nNever Fight the Same Battle Twice</p>\n<p>In The Anacrusis, the AI Driver controls every aspect of the game. It spawns every enemy, directs each boss, and places every weapon, gadget, and health kit. No matter your skill level, you&#39;ll find the perfect level of challenge. More than that, the AI Driver creates the kinds of video game moments that you can’t wait to tell your friends about.<br />\nFight Aliens Using Fantastical Weapons</p>\n<p>Battle the alien menace using an astounding arsenal of classic sci-fi weapons. Buy yourself some time with a stasis grenade, toss a shield grenade to provide instant cover while you pop off a heal, and bring your friends back to life using the Respawner. Or throw caution to the wind and burn friend and foe alike with the laser rifle.<br />\nEarn New Perks and Change the Way You Play</p>\n<p>Matter compilers spread throughout the game give you access to dozens of perks that will change the way you play. Stack all of your upgrades to power up the last-resort pistol or boost your defense by supercharging your shield pulse. Unlock new perks as you play, and share your unlocks with everyone on your team!<br />\nSurvive the Alien Infestation!</p>\n<p>In the distant future, mighty corporations have carried humanity to the fringes of the galaxy. After expanding unfettered across tens of thousands of systems--all devoid of intelligent life--humanity has grown complacent, until disaster strikes. Work together and survive the alien hordes!<br />\nA Fight For Survival Is Just the Beginning</p>\n<p>The first season of The Anacrusis tells the story of four unlikely survivors--Nessa, Guion, Liu, and Lance--who are unwilling combatants in the battle to defend humanity from the alien menace. Play more and unlock more of the unfolding mystery of the alien attack.<br />\nWe Love Mods!</p>\n<p>At Stray Bombay, we think that mods, and the modders who make them, make games better. We’re launching with a selection of mods created by community members. Want to create mods for The Anacrusis? Join our Discord for updates and conversation about mod support.</p>\n<p>If you’ve gotten this far, smash that Wishlist button. It’s free and fun!</p>", "metacritic": null, "released": "2022-01-13", "tba": false, "updated": "2024-03-25T20:21:21", "background_image": "https://media.rawg.io/media/games/d27/d275ae07be7d308bbd020fd719ce8910.jpg", "website": "https://theanacrusis.com", "rating": 3.0, "rating_top": 3, "added_by_status": {"yet": 6, "owned": 104, "beaten": 3, "toplay": 15, "dropped": 5, "playing": 1}, "playtime": 2, "achievements_count": 16, "ratings_count": 9, "suggestions_count": 464, "game_series_count": 0, "reviews_count": 10, "platforms": ["Xbox One", "PC", "Xbox Series S/X"], "developers": ["Stray Bombay"], "genres": ["Action", "Shooter", "Indie"], "publishers": ["Stray Bombay"], "esrb_rating": null}