{"id": 614971, "slug": "the-last-oricru", "name": "The Last Oricru", "name_original": "The Last Oricru", "description": "<p>The Last Oricru is an action RPG, that puts you in the middle of ongoing conflict under the protective shield on the otherwise abandoned planet. Your decisions bring interesting twists into the gameplay as you can heavily influence the conflict and its outcome. You will experience hundreds of intense fights in a brutal medieval sci-fi world, where every action has its consequences. Level up your hero and improve your skills before facing one of many boss fights.<br />\nIntriguing Story<br />\nIn the world of The Last Oricru the advanced technology is mostly forgotten. The last remains are perceived as magical objects and only a few chosen ones can be used. Some of the advanced technology such as Cradle of Life, can be used by The Last Oricru only.<br />\nImpactful Decisions<br />\nMassive decision tree in which your decisions lead to a different outcome, affecting story, characters, game endings but also visuals of levels or the gameplay flow. Every action, sub-quest or death can affect your reputation with each faction. There are multiple ways to play through The Last Oricru - befriend everyone or be the bad guy with all the consequences.<br />\nChallenging Combat<br />\nThe combat is complex and aims to create a tough but rewarding experience. You will encounter various mass fights, in which you can influence already raging battles – take down enemy soldiers or come to their aid. Melee and ranged attacks, elemental damage (magic) and weight management offers a wide range of customization. Be prepared to die... A lot!<br />\nCouch Coop<br />\nThe game offers many situations that can be solved in co-op differently than in the single player. You can find new fun ways of how to win in boss fights or reach special secret areas. At the end of the day, combat is the bread and butter of any RPG so if you for example play as a melee tank, while the second player plays a magic support, you will enjoy tens of awesome hours of shared fun!</p>", "metacritic": null, "released": "2022-10-13", "tba": false, "updated": "2023-10-10T18:31:59", "background_image": "https://media.rawg.io/media/screenshots/966/966a466dcb2e7fae1bf77aafdbb5c8eb.jpg", "website": "https://lastoricru.com/", "rating": 2.3, "rating_top": 3, "added_by_status": {"yet": 3, "owned": 14, "beaten": 4, "toplay": 11, "dropped": 6, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 10, "suggestions_count": 409, "game_series_count": 0, "reviews_count": 10, "platforms": ["PC", "PlayStation 5", "Xbox Series S/X"], "developers": ["GoldKnights"], "genres": ["Action", "Adventure", "RPG"], "publishers": ["Prime Matter"], "esrb_rating": null}