{"id": 61492, "slug": "mr-dirt-poor", "name": "Mr Dirt Poor", "name_original": "Mr Dirt Poor", "description": "Game background:《Mr Dirt Poor》is a simulation game.In this game,players are part-time workers without wealth and status.So you have to start with some simple part-time job,improve  ourselves and learn new knowledge. You may choose your own favorite career afterwards.It is your effort to decide whether you would succeed in the endGame features:<br/>⦁Game Development system: If capable, you may develop your own game to make some money. It is not only the quality of the game matters, but also you have to seize the chance of marketing.<br/><br/>⦁Random plot: Random events make you excited or upset everyday, bringing you entirely different game experience.<br/><br/>⦁Built-in Games: Each job has a mini game built in. What you will be doing are completely different among the works. And of course, the plots during the work are also different each day.<br/><br/>⦁24/7 mode: In the unique 24/7 mode,you will stay up all night to work or play.<br/><br/>⦁Reappearance of the scenes: You will discover something special about this game!<br/><br/>⦁L interaction system: A system for players to have fun with NPCs.<br/><br/>⦁L system: This is a mysterious system!Part-time system:<br/>⦁Handing leaflets: In this job,players will hand out leaflets by the street. But as long as you can have some paycheck, what does it matter?<br/><br/>⦁Promoters: In this job, players act as promoters. You are responsible for Pleasing customers,invoicing, packing stuffs, and so on.But what if you encounter customers with troubles?<br/><br/>⦁Restaurant cashier: In this job,players act as front desk cashiers. You will chat with customers, billing, packing things and so much more.Career system:<br/>A spotlight of this game is that players can choose every single career to master, but will it be successful finally?Art style:<br/>The game uses the cartoon style for players to experience different feeling!Easter egg:<br/>The game has an unique L system hidden and highly related to the game. The system can help you acomplish almost all the tasks or jobs.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:58:05", "background_image": "https://media.rawg.io/media/screenshots/be1/be114e511359efc33453ca26b55677ac.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 311, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Lcc"], "genres": ["RPG", "Strategy", "Simulation", "Casual", "Indie"], "publishers": ["Lcc"], "esrb_rating": null}