{"id": 614915, "slug": "irradiated-watering-hole", "name": "irradiated watering hole", "name_original": "irradiated watering hole", "description": "<p>unfortunately I did not complete this project (roughly 20% complete in current state)<br/><br/>simple demo/prototype built with unreal engine 4 for windows OS, press ESC key to close, click around to move character<br/><br/>initial concept outline - <br/></p>\n<p>theme - <em>breaking the rules</em></p>\n<p><em>use roadside picnic as core inspiration</em></p>\n<p><strong>procedural level generation ai focused</strong></p>\r\nlevel gen part\r\n<p>zone creation - place anomalies around points of interest</p>\n<p>points of interests (buildings, natural formations, etc) have point value - use basic point system to randomize anomaly distrubution: i.e high points = high % of anomaly </p>\n<p>try to edit landmass &amp; water with anomalies</p>\r\ngame part\r\n<p>ai agents (stalkers) roam around zone - start with initial population and have them attempt to traverse zone</p>\n<p>on death stalkers leave behind remnants (acts as markers visually &amp; statistically) </p>\n<p>game will focus on being a barman/blackmarket trader</p>\n<p>    - attempt basic bar management game to get basic income</p>\n<p>    - set bounties on different types of zone artifacts</p>\n<p>    - have basic reputation as bar owner (too many dangerous requests, low pay, etc gives negative rep)</p>\n<p>    - can hire special stalkers with adequate rep &amp; $</p>\n<p>goal is to obtain forbidden wishmaker artifact</p>\n<p>--------</p>\n<p>Final goal for the game is to have a basic turn based store management style game where ai agents frequent a bar; the player must manage the bar and buy &amp; sell goods from the stalkers of the zone. The player makes money by selling goods collected by the stalkers in the zone on the blackmarket. And the player can request specific things from the ai characters (i.e collect certain rare artifacts). I also want many core aspects of the game to be driven systematically by stats and/or parts of the simulation layer.<br/><br/>The game in this current state is little more than a simple prototype with 2 ai agents running around the game world randomly and looking for anomaly objects to collect. That's about it; no actual game yet :( . There is a player character to run around and look at stuff - hope to add enough pieces to make this a complete rudimentary game (basic simulation with game logic and hud). If I worked on it more during the game jam time I might've gotten closer to a complete thing but I still had fun making what little I did :)</p>", "metacritic": null, "released": "2021-06-04", "tba": false, "updated": "2021-06-07T09:21:52", "background_image": "https://media.rawg.io/media/screenshots/1c1/1c1b6bfd9c87cb577ccf63f85222692b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["joshy_kashi"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}