{"id": 615073, "slug": "herman-electro", "name": "Herman Electro", "name_original": "Herman Electro", "description": "<h3>The Prison</h3>Explore six floors of puzzles, and help Herman and his friends reach the outside world. Each floor is filled with puzzles, an exit, and some special rooms. To escape, you'll have to explore each floor by solving puzzles. As you do so, you'll collect an assortment of tools to help you in your journey. But every time you play, the layout of the factory changes completely. Each escape attempt you will need to explore an entirely new factory, so make sure to think on your feet.<h3>The Puzzles</h3>Most rooms in the prison contain an electricity-based puzzle, which you'll need to use your tools to escape. There is no one way to solve each puzzle. Perhaps you cut a critical wire and collapse the integrity of the puzzle. Or maybe you'll use a bomb and smash the room to smithereens. Trick a guard into falling into a pit, disable a long sequence of electric floors, or find the exit by cutting through a mass of walls. You will need to use all your wits to find the most appropriate way to escape each room.<h3>The Tools</h3>These tools will be your best friend and your closest ally as you guide Herman to victory. Each has unique merits, so spend them cunningly.<br/><br/><strong>The Saw</strong>: Cut down walls and make a direct path to the exit with the saw.<br/><strong>The Plank</strong>: Cover up pits or block off the guards using the plank.<br/><strong>The Wire Cutters</strong>: Cut a wire and destroy a malevolent circuit with the wire cutters.<br/><strong>The Water Bucket</strong>: Short out a power supply or create a deadly puddle of electrified water with the water bucket.<br/><strong>The Sponge</strong>: Clean.<br/><strong>The Brick</strong>: Break glass with the brick.<br/><strong>The Gun</strong>: Protect yourself from guards with the gun.<h3>Supertools</h3>In addition to the run-of-the-mill basic tools listed above, you will also discover rare supertools hidden throughout the prison. These tools can be used to invent unique and creative solutions to a seemingly impossible puzzle. Although much more powerful than basic tools, supertools are much rarer, so use them wisely!<br/><br/><strong>The Bomb</strong>: Wreck people, things, and hopefully not yourself.<br/><strong>The Crowbar</strong>: \"Unlock\" doors within rooms. <br/><strong>The Spring</strong>: Jump really, really far. Look before you leap.<br/>and 25 more!<h3>Key Features</h3><ul><li>7 basic tools and 28 supertools for a total of 35 different tools<br/></li><li>4 characters with radically different playstyles<br/></li><li>Over 30 tiles<br/></li><li>Over 400 puzzles<br/></li><li>A final challenge which will make you crumble<br/></li><li>51 achievements<br/></li><li>A minimum security metashop<br/></li><li>Hat-wearing shopkeepers<br/></li><li>Lots and lots of mushrooms<br/></li><li>Adjustable wire-size<br/></li><li>Lots of mushrooms<br/></li><li>Do not eat the mushrooms!<br/></li><li>Do NOt eAt the Mushrooms!!<br/></li><li>EDAATR TKHWE IMTUISNHHLRIOGOMHST</li></ul>", "metacritic": null, "released": "2021-06-10", "tba": false, "updated": "2021-06-11T03:49:26", "background_image": "https://media.rawg.io/media/screenshots/30f/30ff358db03b6eb7a5d1dcc7f4a87313.jpg", "website": "https://www.hermanelectro.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 80, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["3:15 Software"], "genres": ["Strategy", "Indie"], "publishers": ["3:15 Software"], "esrb_rating": null}