{"id": 61501, "slug": "hotel-transylvania-popstic", "name": "Hotel Transylvania Popstic", "name_original": "Hotel Transylvania Popstic", "description": "AVAILABLE FOR STEAM COMMERCIAL LICENSING ONLY.  This title is only available to license at VR Arcades and Family Entertainment Centers worldwide. <br/><br/>Sony Pictures Virtual Reality has partnered with Specular Theory’s ‘Popstic™’ VR game to create Hotel Transylvania Popstic, an exciting new VR music game designed exclusively for VR arcades that’s fun for the whole family! <br/><br/>Featuring the popular movie franchise, premium gameplay, and an optional custom peripheral attachment (called the Popstic), Hotel Transylvania Popstic is a new take on music rhythm games that appeals to all ages and skill levels. It’s easy to learn but impossible to master, which makes it super fun and addicting to play.   <br/><br/>Play the game in Wands mode using two Vive controllers or in *Popstic mode with one Vive controller if you have the Popstic attachment.    <br/>*Popstic mode is optional but we highly recommend it. To play in Popstic mode, you will need a special peripheral accessory called the ‘Popstic’ which can easily (and quickly) be attached or detached to a single Vive controller. Hold the Popstic with both hands like a staff similar to a bo staff or poi staff.<br/> <br/>Players of all ages can now choose their favorite characters from Sony’s popular movie franchise and connect with them in a VR world. <br/><ul><li>Select a character from the movie to be your DJ (choose from Mavis, Drac or Johnny) <br/></li><li>then select songs from their playlist inspired by the character's personality! <br/></li><li>Hotel Transylvania's Griffin (the Invisible Man) guides you throughout the game with helpful tips and fun commentary.  <br/><br/>The goal of the game is use your agility and dancing skills to move in time with the music, hitting incoming targets and avoiding obstacles. <br/><br/>Features: <br/></li><li>Local and global leaderboards for competitive fun <br/></li><li>A popular movie franchise and family-friendly gameplay that will drive traffic to your arcade. <br/></li><li>Exciting to play and watch.<br/></li><li>Great for new and experienced players. <br/></li><li>Hotel Transylvania is a globally recognized movie brand, and the newest film comes out in theaters worldwide on July 13th<br/></li><li>It’s only available to play in VR arcades. It is not available in the home market.<br/></li><li>Popstic is a clever accessory for arcades -- and something consumers can't get anywhere else.</li></ul>", "metacritic": null, "released": "2018-09-25", "tba": false, "updated": "2019-08-28T21:58:05", "background_image": "https://media.rawg.io/media/screenshots/06d/06dde07ec135bda030b6c1d6cfd4f8a2.jpg", "website": "http://www.speculartheory.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 490, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Specular Theory"], "genres": ["Action", "Adventure", "Strategy", "Casual", "Indie"], "publishers": ["Sony Interactive Entertainment", "Specular Theory"], "esrb_rating": null}