{"id": 615089, "slug": "witchaven-i-ii-bundle", "name": "Witchaven I & II Bundle", "name_original": "Witchaven I & II Bundle", "description": "Witchaven I &amp; II bundle includes:\n\n\n\nWitchaven - Descend into a dark and gruesome nightmare! You alone must face the evil within the volcanic pit of the Island of Cha. Witchaven is a first-person fantasy slasher set in dark medieval times. Dare to enter this 3D Hell... Dare to enter Witchaven!\n\n\n\n\n\nWitchaven II: Blood Vengeance\n - Continue the story of the knight Grondoval in this first-person fantasy slasher. Get ready for bloody encounters with vile creatures and vicious warriors. Stop an evil witch from carrying a titular blood vengeance in revenge for him having slain her sister.\n\n<br/>\nWHAT'S INSIDE THIS RELEASE\nYou're getting two builds per each game: patched (Enhanced) and retail (Original) for those of you who prefer an unaltered experience as a bonus. All builds are running on DOSBox with a custom configuration tool. The Enhanced builds feature fixes introduced in EGwhaven, a must-have community project, which addresses an array of bugs and issues with the both games (we'd like to thank ETTiNGRiNDER for the contribution to this release). Additionally, the controls are re-mapped to what you'd expect to see as a default in a first-person game nowadays.<br/>\n<br/>\n<p>You can access the Original Build through Additional Executables section in GOG GALAXY or find it in the game folder.</p>\n<br/>\n<p>System requirements, bonus goodies, and features may vary between games - please check individual product pages for details.</p>", "metacritic": null, "released": null, "tba": false, "updated": "2021-06-11T04:05:27", "background_image": "https://media.rawg.io/media/screenshots/77a/77aa01665ece6333829701f7ed07de2b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 279, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Capstone Software"], "genres": [], "publishers": ["SNEG"], "esrb_rating": null}