{"id": 615142, "slug": "not-exactly-a-hero", "name": "Not Exactly A Hero!", "name_original": "Not Exactly A Hero!", "description": "Sick and tired of your usual typical superhero plots full of clichés? Wonder what it's like to live as an everyday citizen in a superhero universe? Play 'Not Exactly A Hero: Visual Novel, Story-driven Adventure Game' and find out!<br/><br/>\"Not Exactly A Hero\"<br/>Riley, the game's player character, is a substitute agent with the purpose of supporting a superhero's everyday activities. But essentially, Riley is an everyday citizen. Yes - just like you and me.<br/><br/>\"Relationship matters\"<br/>In the game, you will go through numerous encounters with all kinds of characters in between cases:<br/>Your boss, Chief, who's constantly under stress from low budget issues;<br/>Your team's new recruit, Chris, who tries to scratch your ego all the time;<br/>An 'Oobur' driver with a knack for stirring up other people's minds;<br/>A kebab truck guy with a weird and wonky personality...<br/>You may befriend some of them. Some might turn their backs on you. It's all up to you and the choices you make.<br/><br/>\"Every playthrough is like playing a new game\"<br/>As the plot unravels, there will be a LOT of decisions you have to make.<br/>Each and every one of those choices will build up as you proceed, and will ultimately decide the final outcome.<br/>This game is packed with 3 starting points, 4 side character routes, 9 different endings and a bonus route for completionists.<br/>You are the protagonist. Everything is up to your choice.<br/><br/>Main Features<br/>- Intriguing novel-style adventure game<br/>- Marvel-esque light and witty atmostphere<br/>- Stylish illustrations drawn by the artist from the game 'Underworld Office'<br/>- Unique messenger-style gameplay<br/>- 4 main characters aside from the player character - many different events and routes based on the interactions with each of the characters<br/>- 9 different endings + completionist bonus route<br/>- 32 achievements + 48 collectible illustrations<br/><br/>Are you a fan of story-driven games, choice-based games, visual novel games, and/or games where you interact and build connections with other characters? Then you will love this game as well!<br/><br/>More things to point out!<br/>- This adventure game is FREE TO PLAY (F2P)!<br/>- This game is a story-driven visual novel where you get to live as an everyday citizen within a superhero universe<br/>- Meet and interact with various characters with different personalities. The characters may look cold and with an attitude on the outside, but are kindhearted on the inside<br/>- Progress through the missions given by your boss and solve unique puzzles in a \"time attack\" fashion<br/>- This game is a choice-based game - storyline and ending will differ based on the decisions you make<br/>- We still have so much more stories to tell. We will be bringing more visual novels, text-based, story-driven adventure games in the future<br/>- If you like this game, take a look at our other games, '7 Days' and 'Underworld Office'. You won't be disappointed!<br/><br/>We recommend this game to...<br/>- Gamers with a passion for visual novel games, adventure games, messenger style games, and/or games where you actively build connections with other characters<br/>- Gamers who love light-themed superhero movies, comics, etc., or novels<br/>- Someone who doesn't think their life is special - this game will give you the feels<br/>- Gamers looking for Free to Play (F2P) games, indie games, heartwarming and wholesome games<br/>- Someone who likes Marvel films and novel-based games<br/>- Best game for people who find your same old usual copy-paste story-driven games boring<br/>- Gamers who are looking for OG indie games such as Undertale", "metacritic": null, "released": "2021-06-03", "tba": false, "updated": "2023-10-19T08:48:11", "background_image": "https://media.rawg.io/media/screenshots/367/3678d7a6f3990580f77c140ab4154525_UKw3Gnu.jpg", "website": "http://www.buffstudio.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 114, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Buff Studio"], "genres": ["Adventure", "Simulation"], "publishers": ["Buff Studio"], "esrb_rating": "Teen"}