{"id": 61514, "slug": "escape-the-omnochronom", "name": "Escape the Omnochronom!", "name_original": "Escape the Omnochronom!", "description": "Escape the Omnochronom! is a single player turn based strategy game that combines Roguelike and MOBA elements into something new.<br/><br/>You just got sucked into the Omnochronom (Om-KNOCK-Row-Nom), an ancient, mysterious device. Inside the device are mechanical minions, strange characters and spirits trapped there for eternity. Some say that the Omnochronom gives its owner eternal life by sapping all the energy from those captured. Some say it's simply a twisted prison invented by an evil god. Whatever the case, you know you can't stay here long.<br/><br/>There's a huge exit door up top. All you need to do is get one of these Key Minions up to the top before you're completely destroyed.<br/><br/>You can find weapons, tools, and other treasures left behind by others who have been trapped here before you. Because of a strange temporal quality of the Omnochronom, you can also find things left behind from people captured *after* you, as well. And you'll need everything you can get your hands on, because there are eight different horrifying Guardians, who power up minions, throw you around, destroy your base, and worse.<br/><br/>Collect special cards that power you up and give you access to new abilities. Unlock new playable characters that each have their own unique playstyle. Discover the secrets of the procedurally-generated Omnochronom. Purchase randomly generated items, use tactical abilities, power up, and push the lanes. <br/><br/>With any luck, you just might be able to ESCAPE THE OMNOCHRONOM!<br/><strong>FEATURES</strong><br/><ul><li>A bunch of fun characters to play with their own special powers<br/></li><li>Lots of cool items to collect and unlock, with random ones available each game<br/></li><li>Smart, balanced procedural generation presents an interesting but fair challenge every time<br/></li><li>Single-player Elo system keeps the game challenging and fun at any level of play<br/></li><li>Colorful pixel art<br/></li><li>Original soundtrack</li></ul>", "metacritic": null, "released": "2018-08-09", "tba": false, "updated": "2020-04-15T10:24:46", "background_image": "https://media.rawg.io/media/screenshots/c71/c7149390a05b5eb45c1160c452e9b346.jpg", "website": "http://www.escapetheomnochronom.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 175, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Keith Burgun Games"], "genres": ["Strategy", "Indie"], "publishers": ["Keith Burgun Games"], "esrb_rating": null}