{"id": 61529, "slug": "packed-train", "name": "Packed Train", "name_original": "Packed Train", "description": "Packed Train is a casual puzzle game in which the player has to take cute little creatures of all sorts of shapes and pack them onto a train. Yeah, it's weird, but it's super fun! Enjoy the endless experience of beautiful and cute characters, colorful levels and cool gameplay.<br/>The game features gameplay that can entertain for hours and hours, leaderboards (and achievements) in timed mode that will test your skills, speed and perception. Get those cute creatures up there before the train leaves forever, without them! <br/>Chill mode is for those who like to carefully craft their highscores and don’t like any interruptions. They can play at their own pace and never care about time! Isn't that like a dream come true?<br/>Challenge your mind with puzzles that keep on coming and coming. This is a perfect game for a short break at work or a longer session at home. It's suitable for everyone as well. Keep your tracks clean and your eyes open - there’s always something to solve!Key Features<ul><li>Quick gameplay that can entertain for hours at a time <br/></li><li>Chill mode for those who like to carefully craft their highscores <br/></li><li>Timed mode that will test your skill and perception<br/></li><li>Endless number of levels<br/></li><li>Daily Quests for skilled players<br/></li><li>Steam Achievements <br/></li><li>Steam Trading Cards <br/></li><li>Leaderboards <br/></li><li>Collect letters to gain puzzles</li></ul>", "metacritic": null, "released": "2018-07-26", "tba": false, "updated": "2019-08-28T21:58:04", "background_image": "https://media.rawg.io/media/screenshots/3ca/3ca39b61a96d8f599680b0f11eaf21b6.jpg", "website": "http://icecodegames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 4, "owned": 23, "dropped": 1}, "playtime": 5, "achievements_count": 15, "ratings_count": 0, "suggestions_count": 136, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC", "macOS"], "developers": ["Ice Code Games"], "genres": ["Casual", "Indie"], "publishers": ["GrabTheGames"], "esrb_rating": null}