{"id": 615319, "slug": "talking-to-myself-talkingtomyself", "name": "Talking to Myself (TalkingToMyself)", "name_original": "Talking to Myself (TalkingToMyself)", "description": "<em>El Juego</em>\n<p><strong>\"Talking to Myself\"</strong><strong> </strong>es un videojuego de género novela visual donde se tratarán temas como la psicología y la salud mental. El objetivo de este videojuego es visibilizar el tema de la salud mental e informar a través de una serie diálogos sobre los distintos trastornos más comunes. Se trata de un videojuego con el que el jugador aprenderá bastante sobre un tema que está muy presente en la actualidad y al que no se le da la importancia que se merece.<br/></p>\n<em>Características</em>\n<ul><li>El juego consta de una barra de afecto de personajes que cambia la jugabilidad por completo en base a tus decisiones.</li><li>El objetivo del juego es transmitir un mensaje a la sociedad y dar visibilidad a un tema tan importante como la salud mental</li></ul>\n<em>¿Cómo jugar?</em>\n<p>El videojuego comenzará con la primera decisión que tiene que tomar el jugador al ponerle nombre a su personaje. Tras esta decisión, comenzará la historia. La historia habla sobre un/una psicólogo/a que tiene varias consultas con una serie de pacientes a través de videollamadas. En estas consultas mantendrá unas conversaciones con cada paciente que variarán en base a las decisiones que tome el jugador. En cada consulta habrá una serie de momentos clave donde el jugador deberá tomar la decisión de cómo reconducir la conversación y por dónde tirar.</p>\n<em>Equipo de Desarrollo</em>\n<p>Somos distintos alumnos de la Escuela Superior de Videojuegos y Arte Digital de Málaga (EVAD) cuyos roles dentro de este videojuego han sido los siguientes:</p>\n<ul><li>Iván González  - Diseñador Narrativo. Twitter Instagram</li><li>Enrique Botella - Programador. Twitter</li><li>Candela Robles - Artista 2D. Instagram</li></ul>", "metacritic": null, "released": "2021-06-10", "tba": false, "updated": "2021-06-11T05:35:53", "background_image": "https://media.rawg.io/media/screenshots/38e/38ed65e043d529bcae7c3bff53503ef1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 125, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["TalkingToMyself"], "genres": [], "publishers": [], "esrb_rating": null}