{"id": 61559, "slug": "welcome-to-bummertown", "name": "Welcome to Bummertown", "name_original": "Welcome to Bummertown", "description": "This is the developers of Think Inside the Box writing a cry for help.<br/>Our beloved game character, an experienced doctor and farming enthusiast, Bedford went missing. He was last seen by a woozy cow at his farm (located in the lovely place of Bummertown), raking dead rats on his porch.<br/><br/><br/>- The red circle marks the spot where Bedford was last seen. Ignore the upside-down bird, it’s not a glitch, only a photographic illusion.<br/><br/><br/><br/>This is what the cow had to say:<br/>\"Yeah I saw him, standing there in front of his hut raking something. When all of a sudden the usual glitch* occurred that pushed Bedford's rake out of his hands and into the sky. All I remember after that was Bedford's red face, his barrage of curses, and him walking into the woods.\"<br/>*We, as the developers of the wonderful Bummertown, do not agree with said statement. There are no glitches in this town.<br/><br/><br/>- The cow that saw it all (not the glitches though, as there are none).<br/><br/><br/><br/>We are searching for brave souls who are willing to go head first into what maybe a dangerous* journey.**<br/>*In reality, it won’t actually impose any danger to the player at all.<br/>**Technically, it’s more of a task than a journey.<br/><br/>If you think you have what it takes to find Bedford, then it’s likely you’ll have to do the following:<br/><br/><ul><li>Collect items and use them as needed.<br/></li><li>Talk to imbecilic characters.<br/></li><li>T̶a̶l̶k̶ ̶t̶o̶ ̶i̶n̶t̶e̶l̶l̶i̶g̶e̶n̶t̶ ̶c̶h̶a̶r̶a̶c̶t̶e̶r̶s̶.̶<br/></li><li>Solve puzzles.<br/></li><li>Talk to animals.<br/></li><li>Start a bar fight.<br/></li><li>Search for treasure.<br/></li><li>Watch an old lady dance in a bikini.</li></ul><br/>As creators of Bummertown, we can confirm that it is a magnificent place, filled with joy and happy faces everywhere you look; it’s a digital heaven. You’ll most certainly enjoy your visit. Also, there are no glitches anywhere in Bummertown, everything works fine and dandy. Yup…<br/><br/><br/><br/>In order to find Bedford, you’ll also need some information regarding his appearance:<br/><br/><ul><li>Name: Dr. Bedford.<br/></li><li>Weight: 30 kB.<br/></li><li>Height: 28 px.<br/></li><li>Width: 15 px.<br/></li><li>Outline: 2 px.<br/></li><li>Eyes: Black.<br/></li><li>Hair: Balding, has some gray patches on the back of his head.<br/></li><li>Unique signs: Smells like a combination of dirty socks and expired meat.</li></ul><br/><br/>-Some recent photos of Bedford.<br/><br/><br/><br/>If you manage to find him or have gathered any valuable information, please let us know in the comment section below.<br/><br/><br/><br/>THANK YOU FOR YOUR HELP!<br/><br/>", "metacritic": null, "released": "2018-09-11", "tba": false, "updated": "2019-08-28T21:58:02", "background_image": "https://media.rawg.io/media/screenshots/302/3028546d5b58f3c64bd053f89e9bb9df.jpg", "website": "http://thinkinsidethebox.games/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 2, "ratings_count": 0, "suggestions_count": 184, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Think Inside The Box"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Think Inside The Box"], "esrb_rating": null}