{"id": 61560, "slug": "gleaner-heights", "name": "Gleaner Heights", "name_original": "Gleaner Heights", "description": "\"Today is another typical day in Gleaner Heights. I got up, went to the general store, bought some seeds, planted them. Cooked some spaghetti bolognese, went out to chop wood. Milked my cows, fed them too. Got in my boat, went underwater with my diving suit. Found a cave entrance, fought a giant crab, grabbed some treasure. Got back up, went to the showroom for a drink. I think the hotel owner's daughter is throwing funny glances at me. I shouldn't have gifted her that boot I fished out the other day...\"<br/><br/><strong>For those of you who are in for the farming...</strong><br/>  Grab your trusty tools and transform your farm into the richest field in town! Over 40 crops await for you to discover and plant them!<br/>  Tend to your animals, make them happy and collect their produce! Keep them either inside the barn or make fenced perimeters outside to let them graze under the sun!<br/>  Lose yourself in a slew of different activities, from fishing to crafting machines and items, from cooking delicious meals with over 110 recipes to upgrading your home and farm buildings!<br/>  Make friends with the townsfolk and learn about them and the history of Gleaner Heights! When the time and person is right, choose to have a life together!<br/>  Explore the town’s surroundings, discover secret places and hunt creatures! Dig deep into the mines to get precious metal and stones! Sail your very own boat and explore underwater with your diving suit!<br/>  Get your hands on over 300 items and wear over 45 unique pieces of clothing and equipment!<br/><br/><br/><strong>For those of you who are in for the mystery...</strong><br/>  Witness the double lives of townsfolk, their plottings and betrayals. Help them or destroy them as you see fit.<br/>  Discover the haunting past of Gleaner Heights, from its early days to the terrible events that occured just prior to your arrival. Confront the supernatural horror that lurks in the bowels of the earth. Break the cycle of destruction...or inherit it.<br/>  Fight powerful creatures guarding lost, forgotten treasures. Dash, roll, shoot arrows - prevail or perish.<br/><br/><br/><strong>Features</strong><br/><br/><ul><li>Play as a male or female character.<br/></li><li>Over 30 villagers with their own schedules, habits, likes and dislikes.<br/></li><li>Extended farming mechanics with over 40 different crops.<br/></li><li>Animals like chickens and cows, as well as a horse. Extended sub-mechanics include growing mushrooms in a mysterious cave, or breeding silkworms.<br/></li><li>Extended crafting system with lots of recipes, from fences to explosive arrows to cheese makers.<br/></li><li>Cooking with over 110 recipes.<br/></li><li>Complete town upgrade projects. Have your very own boat and explore the river and waterfall, and even explore underwater with your diving suit!<br/></li><li>Romantic interests and marriage.<br/></li><li>Day/night cycle, seasons, and weather system.<br/></li><li>Skills, perks and equipment (clothing) with set bonuses.<br/></li><li>Tool upgrades and mining.<br/></li><li>Fishing! Over 40 fishes populate various water bodies around the town and in underground lakes.<br/></li><li>Town events and festivals.<br/></li><li>Main plot with different \"endings\".<br/></li><li>Explore and discover hidden areas and dungeons.<br/></li><li>Surprisingly fluid combat for a game of this genre, with players being able to charge ther tool attacks while moving, roll, dash, perform power attacks etc.<br/></li><li>Multi-language support (in progress).<br/></li><li>Gamepad/mouse support.</li></ul><br/>NOTE: The game  supports trading cards, and they will be automatically added according to this announcement.", "metacritic": null, "released": "2018-02-21", "tba": false, "updated": "2019-11-19T19:17:58", "background_image": "https://media.rawg.io/media/screenshots/381/38117dfe8bee4e49df17af4d44fe15a3.jpg", "website": "https://www.gleanerheights.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 16, "toplay": 1}, "playtime": 6, "achievements_count": 25, "ratings_count": 1, "suggestions_count": 255, "game_series_count": 0, "reviews_count": 1, "platforms": ["Nintendo Switch", "Xbox One", "PC", "Linux"], "developers": ["Emilios Manolidis"], "genres": ["Action", "Adventure", "RPG", "Simulation", "Casual", "Indie"], "publishers": ["Emilios Manolidis", "ManolidisAimilios"], "esrb_rating": "Mature"}