{"id": 615666, "slug": "cave-confectioner-itch", "name": "Cave Confectioner (itch)", "name_original": "Cave Confectioner (itch)", "description": "<p>You are a cave dweller with a massive appetite. Armed with only your wits, you set out to build a dessert empire. Collect, process, and combine ingredients. Farm crops, discover new recipes, and cook over an open fire. Explore an open world in search of customers for your tasty treats.</p>\n<p>Cave Confectioner is a back-to-the-land farming and cooking game. Make things. Sell things. Get to know the locals.<br/></p>\r\nExplore an open world\r\n<p>Go almost anywhere, do almost anything, eat almost anything. The temperate climate makes crops grow fast and food plentiful. Meander through meadows or sprint ahead and grab all you can.<br/></p>\r\nCombine ingredients\r\n<p>An intuitive crafting system lets you at least <em>attempt</em> to combine everything with everything, whether or not the things go together. Combine natural ingredients with manmade things and fixtures of the world. Dozens of end products are formed by unique recipes, and only the correct combinations yield the goods.<br/></p>\r\nChoose your own path\r\n<p>Craft things, sell foodstuffs to cave people, poke around and see how nature reacts. There is no \"quest\" or \"mission\" dialog box telling you where to go. Advancement is achieved through secrets and exploration.<br/></p>\r\nBuilt to last\r\n<p><em>This developer has done the heavy lifting to give you a constant 60 FPS.</em> A custom C++/OpenGL engine is used, Windows executables are built with MinGW, Linux executables are built against glibc 2.25 and tested on the latest versions of Ubuntu. There is no third-party proprietary software outside of Apple platforms. Anything that breaks is fixable.</p>", "metacritic": null, "released": "2021-06-02", "tba": false, "updated": "2021-06-11T07:05:02", "background_image": "https://media.rawg.io/media/screenshots/ce3/ce36b80a462edf23c1583ff1b09f3df4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 113, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["motorstripentertainment"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}