{"id": 615620, "slug": "chameleon-rush", "name": "Chameleon RUSH", "name_original": "Chameleon RUSH", "description": "<p>Chameleon RUSH is an old game I made from Scratch 2.0 when I was 13. I recalled having made it myself without using other people's engines. It's a top-down, endless all-you-can-collect game that lets you control a chameleon and eat as much fruit as you can. I might consider remaking this into a much better game without using the Scratch engine, but maybe time will tell.</p>\n<p>This game is best played on computer.</p>\n<p><strong>Plot (from the original version)</strong></p>\n<p>Most chameleons are insectivores. They enjoy eating bugs &amp; insects with their long tongues. But one day, one of them is not like the others. This chameleon likes to eat... fruit?<br/></p>\n<p><strong>Controls</strong></p>\n<ul><li>Use Arrow keys to move around</li><li>On the start menu, clicking on the chameleon can change it's colors.</li></ul>\n<p><strong>Gameplay</strong><br/></p>\n<p>The only goal of the game is to eat as many fruits as you can. Avoid bad fruits and bombs. Regular fruits yield 1 point, while golden fruits yield 2.</p>\n<p><strong>Changes from the original</strong>\n</p>\n<p>There are changes I have made about it:\r\n</p>\n<ul><li>I had to tone down the contrast of all the sprites, just so it's more accessible to those who can't stand bright colors. Also, the stage no longer changes color overtime.\r\n</li><li>Added a lives system. Bad fruits can now just deplete your lives than just cause a game over (unless... your lives are at 0... so yeah).\r\n</li><li>Also added two new objects that weren't present in the original: Gold fruits and bombs.\r\n</li><li>Because of legal issues, there used to be music from a different video game, which I have omitted.\r\n</li><li>The original version of this game used cloud variables, but I since had it removed due to privacy concerns.\r\n</li></ul>\n<p>The original version is still up on Scratch, and can be played here. Also yes that's one of my old Scratch accounts (Warning for bright colors/strobe effects btw).\r\n</p>\n<p><strong>Note</strong></p>\n<p>The game could probably be a bit too easy for some of you, so feel free to ask for alterations. It was exported through Project HTMLifier.</p>\n<p>Also, if you get a gameover, just note that it says \"Click the flag to restart\". You just have to click the \"↶\" on the top right corner to do that.</p>", "metacritic": null, "released": "2021-06-09", "tba": false, "updated": "2021-06-11T06:52:32", "background_image": "https://media.rawg.io/media/screenshots/c69/c69d8db60987d098d7bb4f6de357e10c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 25, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Aestas"], "genres": [], "publishers": [], "esrb_rating": null}