{"id": 61567, "slug": "to-the-core", "name": "To the Core", "name_original": "To the Core", "description": "<p>To the Core is a third-person action-platforming speedrunner with a roguelite structure.<br />\nRun, jump and dash your way through procedurally generated levels filled with obstacles and hazards. Fight through heaps of enemies to save your father and set record times.</p>\n<pre><code>Procedurally Generated Worlds: Explore new levels, encounters and structures every time you play!  \nRoguelite Aspects: Built for replayability and difficulty, To the Core is a challenge meant to be played multiple times.  \nMastery of Mechanics: Master the simple controls of To the Core and combine them in interesting ways to find new ways to beat the game.  \nOnline Leaderboards: Compete against your friends or the world to show that you master the game.  \nWeekly Challenges: Test your skills against the world by playing the same level and seed as everyone else.\n</code></pre>\n<p>You are Emily, the daughter of a brilliant but absent-minded inventor. Your father has been experimenting with robots and machinery for years, throwing his failed inventions in his interdimensional trash bin, saving big on cleaning costs. However, these inventions have built a world of their own and decided to kidnap your father to wreak havoc on the real world! It is your task to go in, save your father and get home before dinner!</p>\n<p>To the Core is a free-to-play demo created as a student project from the NHTV Breda University of Applied Sciences.<br />\nWe hope you enjoy playing the game as much as we liked making it.</p>", "metacritic": null, "released": "2018-07-23", "tba": false, "updated": "2023-12-28T08:06:55", "background_image": "https://media.rawg.io/media/screenshots/bae/baedbcf14e5f1fe81fb4a67ad07232e3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 13, "beaten": 1, "toplay": 1, "dropped": 1}, "playtime": 7, "achievements_count": 35, "ratings_count": 4, "suggestions_count": 297, "game_series_count": 0, "reviews_count": 4, "platforms": ["PC"], "developers": ["NHTV Breda University of Applied Sciences"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["NHTV Breda University of Applied Sciences"], "esrb_rating": null}