{"id": 615795, "slug": "robot-burger-mania", "name": "Robot Burger Mania", "name_original": "Robot Burger Mania", "description": "<p><strong>Hook</strong></p>\n\n<p>The World of Robot Burger Mania was overrun by genetically modified fast food. As their last hope, humanity created the FFA, the fast food annihilator. Slip into the role of the FFA, traverse levels with amazin 2D graphics and do what you were build to do, destroy that fast food.</p>\n\n\n<p><strong>Description</strong></p>\n\n<p>Genetically modified vegetables, genetically modified meat and genetically modified bread. At a certain point it all just took over and threatened to destroy humanity instead of feed it.</p>\n<p>But humanity wouldn`t be humanity if they were to go down this quickly. So the smartest of the smartest came together to create the FFA, the fast food annihilator.</p>\n\n<p>Play as the FFA and show the fast food monster what organically grown, patiently nurtured, cold, unfeeling metal is capable of. This handdrawn 2D world with its attention to detail will keep you on your toes in order to overcome the multitude of enemy units. Control the FFA throuhg the air, dodge attacks and deal some serious damage so that you and the world of the humans isnt lost to this threat.</p>\n<p>-traverse the beautifully designed world</p>\n<p>-defeat interesting enemies</p>\n<p>-master the challanging combat</p>\n<p>-combine movement and surroundings to gain the advantage</p>", "metacritic": null, "released": "2021-06-09", "tba": false, "updated": "2021-06-11T07:36:32", "background_image": "https://media.rawg.io/media/screenshots/6cf/6cff9ba048fe3cd4eb0dd86b7a267f27.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 98, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["DeCaffed", "Snuzz Games", "SkeletonKing20", "LevinDuerrschmid", "Eraide", "SuppMainiac"], "genres": ["Action"], "publishers": [], "esrb_rating": null}