{"id": 61581, "slug": "moonquest", "name": "MoonQuest", "name_original": "MoonQuest", "description": "A wizard seeks to illuminate a nocturnal world. He summons a hero to find the fallen moonstones that will power a great moon machine.<br/><br/><strong>MoonQuest </strong> is a procedurally-generated adventure game with roguelike and minecraftian gameplay. Seek out the lost forest, delve into the spider caves, storm the castle of the Silver King, discover vast seams of gold ore, and craft a hat of such splendour that the cosmos will be jealous.<br/><br/><strong>Important:</strong> MoonQuest requires a dedicated graphics card! See the minimum specs below. If you just have an Intel HD graphics chip and nothing else then it's likely the game won't run.<br/><br/>Key Features<br/><ul><li>A new world to explore every game, with frozen forests, hollow mountains, dangerous dungeons and populated towns;<br/></li><li>Strange alien creatures, wandering merchants, and relentless enemies;<br/></li><li>A rich environment with destructible tiles, ambient wildlife, and weather effects;<br/></li><li>Strange moons that influence the game in unique ways (e.g., the Giant moon spawns giant versions of animals and enemies);<br/></li><li>Hundreds of items including weapons, tools, hats, armour, shields, blocks, toolbenches, and so on;<br/></li><li>Many resources to mine or harvest like silver, gold, sugar, salt, fur, and fruit; and<br/></li><li>Several playable characters, each with different abilities and items;<br/><ul><li>Moonman, who illuminates with a moonly glow;<br/></li><li>Amphibian, who breathes underwater;<br/></li><li>Elemental, who detects ore with his antennae; and,<br/></li><li>The Crusader, who starts the game with full armour;</li></ul></li></ul><br/>Example Gameplay<ul><li>Plunder an ancient tomb for <strong>Regalia</strong>;<br/></li><li>Net some snails and make <strong>Snail Pie</strong>;<br/></li><li>Build a temporary hut from <strong>Wooden Planks</strong>;<br/></li><li>Smelt gold into a <strong>Plumed Gold Helmet</strong>;<br/></li><li>Find the <strong>Knight Doll</strong> and unlock the Crusader;</li></ul><br/><br/><br/>Found a bug? Please report it here.", "metacritic": null, "released": "2018-07-13", "tba": false, "updated": "2023-03-09T23:06:12", "background_image": "https://media.rawg.io/media/screenshots/23d/23dae8f3822270717e7420393936bd0e.jpg", "website": "https://playmoonquest.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 15, "toplay": 3, "dropped": 2}, "playtime": 1, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 406, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Wizard Mode"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Wizard Mode"], "esrb_rating": null}