{"id": 61591, "slug": "blazing-core-beta", "name": "Blazing Core (beta)", "name_original": "Blazing Core (beta)", "description": "<strong>Beta version of game</strong><br/><br/>...The path of the knight is the gaze directed inwards.<br/><br/><strong>Blazing Core</strong> is a multiplayer epic shooter about mech knights. The giant battle machines have been created to be as perfect as one can get and are suitable for various combat styles. For its heroic pilot the mech can become their armor, weapon, and even a noble steed.<br/>All machines are unique and differ in looks and functionality. However, all of them carry inside a core of pulsing energy – and without it the battle giants are just heaps of high tech scrap. In turn, the pilots are united by the code of chivalry – after all, without any moral values humans are just animals. Let this boundless power be directed by human hands and not beastly paws!<br/><br/>Blaze, oh knight! Don the futuristic armor and blaze!<br/><br/>Blazing Core features:<br/><ul><li>The fusion of chivalry and giant robots<br/></li><li>Your skills at combining the character’s abilities effectively are more important than your reflexes <br/></li><li>Choosing your mech-hero doesn’t limit your actions on the battlefield. You, and only you, decide what to do, based on your team’s tactics or heat of the moment   <br/></li><li>You can customize and upgrade your mech-hero. Unlocking new weapons lets you fine tune your mech according to your play style and adds gameplay variety  <br/></li><li>Mindless rushes are crushed by teamwork and tactics, while smart mech-hero synergy gives you a real edge in combat.</li></ul><br/>Fulfill your hero’s potential, cooperate with your team, and enjoy the game.", "metacritic": null, "released": "2018-09-07", "tba": false, "updated": "2019-08-23T12:11:47", "background_image": "https://media.rawg.io/media/screenshots/bb3/bb3a2a6aacc3354a59a595bccf4d452e.jpg", "website": "http://blazing-core.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 508, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Octobox Interactive"], "genres": ["Action", "Massively Multiplayer"], "publishers": ["OctoBox Interactive"], "esrb_rating": null}