{"id": 61593, "slug": "what-would-google-say", "name": "What would Google say?", "name_original": "What would Google say?", "description": "Do you know what Google would say? Do you think you know what other people think and put into their google searches? “What would Google say?” Is a quiz game where you need to figure out which of the answers is the top google auto correction and therefore which answer most people search. The premise is easy yet entertaining and sometimes you will be surprised what people are actually searching for on the internet. The game also offers stages so that you can try to reach the top and become the keeper of the infinite google knowledge.<br/><br/><br/><br/>🔸 More than 1000 auto-completions<br/>🔸 Randomized answers for unlimited trivia fun<br/>🔸 Earn more points for every answer<br/>🔸 Reach be highest points and beat the game by answering 12 questions in a row<br/>🔸 Be surprised by the search results<br/>🔸 See the top 10 of all the search results after every question<br/><br/><br/><br/>We are just two friendly apes who learned how to make games in our free time and now love to bring our often crazy ideas to live in all kinds of games. Please expect our games to be smaller, raw experiences. We always love to chat with you and greatly appreciate all of your feedback in order to become better game creators. Also if you encounter bugs or any problems, tell us in the Forum and we will do all we can to ensure the best support that a drunken ape could possibly give.", "metacritic": null, "released": "2018-09-07", "tba": false, "updated": "2019-08-28T21:58:01", "background_image": "https://media.rawg.io/media/screenshots/19c/19c8be1397926db754245cbf71af3617.jpg", "website": "http://drunkenapes.wixsite.com/drunkenapesgames/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 4, "ratings_count": 0, "suggestions_count": 76, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["DRUNKEN APES"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["DRUNKEN APES"], "esrb_rating": null}