{"id": 616399, "slug": "forest-run-vanerb-games", "name": "Forest Run (Vanerb Games)", "name_original": "Forest Run (Vanerb Games)", "description": "Español\r\n<p>Hola, Forest Run es mi primer juego se trata de un \"Endless Runner\" donde tendrás que esquivar distintos obstáculos y superar tu marca.</p>\n<p>Dicho esto, ¿hasta donde podrás llegar? Supérate en cada partida y bate tu récord personal.</p>\n<p>Forest Run esta tanto en Español como en Ingles podrás cambiar el idioma en cualquier momento</p>\n<p>Forest Run se encuentra en desarrollo, es decir, se ira actualizando con mas y mas mejoras así que para tener una idea que hay que cambiar me ayudaría mucho que comentéis fallos del juego, que cosas cambiaríais, cosas a añadir etc.</p>\n<p>Ahora si Muchas Gracias por descargar Forest Run</p>\r\nEnglish\r\n<p> Hello, Forest Run is my first game, it is an \"Endless Runner\" where you will have to dodge different obstacles and overcome your mark. </p>\n<p> That said, how far can you go? Get better in each game and beat your personal record. </p>\n<p> Forest Run is in both Spanish and English, you can change the language at any time </p>\n<p> Forest Run is in development, that is, it will be updated with more and more improvements so to have an idea that needs to be changed, it would help me a lot if you comment on bugs in the game, what things would you change, things to add etc. \r\n</p>\n<p> Now, Thank you very much for downloading Forest Run </p>", "metacritic": null, "released": "2021-06-07", "tba": false, "updated": "2021-06-11T10:18:07", "background_image": "https://media.rawg.io/media/screenshots/439/439d1715b8edc03c5b5d63935f040496.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 50, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Vanerb Games"], "genres": ["Adventure", "Platformer"], "publishers": [], "esrb_rating": null}