{"id": 61636, "slug": "evoloevolution", "name": "Evolo.Evolution", "name_original": "Evolo.Evolution", "description": "Evolo.Evolution - an exciting strategy in real time with elements of the sandbox.<br/>Go through several stages of evolution, from the usual rabbit, to the local ruler of these lands. Fight other sentient beings and build your tribe.<br/><br/>Combine different creatures and objects in order to reach the apex of evolution.<br/>Manage and capture the essence of other creatures and create your own unique tribe.Evolo.Evolution is in alpha stage<br/>We are in the alpha stage and you can expect the following content in the near future:<br/><br/>-A lot of different quests<br/>The gods in this game will not leave their being without unique tasks and will make them work<br/><br/>-New species of monsters and evolutions<br/>Evolution does not stand still and over time, more and more new mutations<br/><br/>-New buildings<br/>Development of creatures does not stand still, and they learned to build new buildings by combining new materials<br/><br/>-More deep transitions from one stage of evolution to another<br/>The tribe? What kind of tribe can do without their campfire and dances around it<br/><br/>And many many others.<br/><br/><br/><br/>If you like thoughtful and complex sandboxes, do not be afraid to immerse yourself in the mechanics of this game, then you will be satisfied.<br/>Welcome to the world of Evolo. Chaotic world of evolution.", "metacritic": null, "released": "2018-09-05", "tba": false, "updated": "2019-08-28T21:57:59", "background_image": "https://media.rawg.io/media/screenshots/050/05089b01c9be9f0008f95456a5e691e0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 29, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["OurLastSpring"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["Metal Fox"], "esrb_rating": null}