{"id": 6163, "slug": "truck-trials-2-farm-house-4x4", "name": "Truck Trials 2: Farm House 4x4", "name_original": "Truck Trials 2: Farm House 4x4", "description": "Take on treacherous terrain, upgrade and customize your vehicle, and compete against the world or just your friends online in this insane offroad adventure! Complete each level in the fastest time possible while avoiding damage to your vehicle and knocking over cones, you have to be careful but quick if you want to win!<br/><br/>Features:<br/>•Incredibly realistic physics, watch the springs flex and compress as you take on crazy terrain!<br/><br/>•50+ increasingly difficult levels featuring tons of obstacles, puzzles, and challenges! From realistic rocky trails to high flying roller coasters, there's sure to be something for everyone!<br/><br/>•8 unique vehicles inspired by real life offroad legends! +4 new speical vehicles!<br/><br/>•Upgrade your vehicle and make it your own! Paint it, lift it, turn it into a monster truck, the choice is yours!<br/><br/>•Newly added winter mode! The entire game with a new winter setting, slippery physics, and new leaderboards, doubling the content!<br/><br/>•New Long Haul Mode! An endless style mode where you play through every level back to back competing to get through the most checkpoints possible in the least amount of time!<br/><br/>•Share replays online through EveryPlay, Twitter, Facebook or Youtube!<br/><br/>•Full online leader-boards! Compete against the world, check your global rank, and challenge your friends!<br/><br/>•Real time procedural damage! Try not to wreck your truck too badly!<br/><br/>•First person camera! Time for a real challenge!<br/><br/>•Free drive on every level in the game! Hone your skills, or just goof off!", "metacritic": null, "released": "2015-05-30", "tba": false, "updated": "2019-10-22T14:08:38", "background_image": "https://media.rawg.io/media/screenshots/2d4/2d4ef02f02b5810b1935b322a725e847.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 162, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Brandon Proulx"], "genres": ["Simulation", "Racing"], "publishers": ["Brandon Proulx"], "esrb_rating": "Everyone 10+"}