{"id": 61642, "slug": "memory-trainer", "name": "Memory Trainer", "name_original": "Memory Trainer", "description": "Here is a game that will help to improve your mental abilities and develop excellent memory. On the table is a set of cards with different images, each of which has its own pair. You can only open 2 cards at a time. When you open new card - previous cards are closed again and you need to remember their location. When you open 2 identical cards, they will disappear from the Board. Thus, you need to clear the entire game Board, keeping in mind the location of the pictures.<br/><br/>Features of the game:<ul><li>Improves memory<br/></li><li>Many levels of varying difficulty<br/></li><li>Very nice graphics<br/></li><li>Has Steam achievements<br/></li><li>Suitable for Windows, Mac and Linux</li></ul><br/>Do you think you have a great visual memory? Perhaps this is so, and this game will help you once again to see this. Or Vice versa, it will help to develop these useful skills. One way or another, it is sure to be useful to you. Simple control of the game allows you to play it even for children, which of course will help them learn how to better remember and learn the various objects. For fans of high complexity, you can turn on the timer and control the time for which you pass a particular level. By the way the levels in the game are quite a lot and they vary in complexity and size, so you can always choose an interesting task on the shoulder.<br/><br/>", "metacritic": null, "released": "2018-07-19", "tba": false, "updated": "2019-08-28T21:57:59", "background_image": "https://media.rawg.io/media/screenshots/325/3256cdaabaf24d93abe88db0f91a492b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 63, "ratings_count": 0, "suggestions_count": 52, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Educational Games"], "genres": ["Casual", "Indie"], "publishers": ["Educational Games"], "esrb_rating": null}