{"id": 61648, "slug": "subway-simulator", "name": "Subway Simulator", "name_original": "Subway Simulator", "description": "This game takes place in a subway, bits of which can look pleasantly familiar for players from different cities and countries. As a subway train driver, you have to bear your underground conduct.SUBWAY SIMULATOR LETS YOU:<ul><li>Improve your driver‘s experience and make an illustrious career;<br/></li><li>Choose from variety of subway trains and customize them;<br/></li><li>Discover 4 intricate routes;<br/></li><li>Switch between the views: from cab view to car view.</li></ul><br/>SUBWAY CAREERYou can improve your driver‘s level. Collect authority points and get a promotion to unlock more routes and trains. Reach the highest rank to unlock all of them. Points are given to you for each completed route, but also for the total number of passengers you delivered.<br/><br/>KEY FEATURES<ul><li>Mood of passengers that is affected by the driver‘s skill. Be accurate and punctual to keep the people happy!<br/></li><li>Weekly statistics of the driver‘s results.<br/></li><li>Ability of painting the train and creating your own individual design.<br/></li><li>Station informer (with female and male voices to choose from).<br/></li><li>Information about almost all models of trains.</li></ul>HOW TO DRIVE<ul><li>Choose a route and a train: you can drive up to 3 cars;<br/></li><li>Make doors open/close using the “door” button;<br/></li><li>Use the lever to speed up/slow down;<br/></li><li>Track the number of passengers: deliver as many as you can;<br/></li><li>Change the camera view to see how many passengers there are in a car;<br/></li><li>Track your speed or get fined – follow the speed limit instructions;<br/></li><li>Use voice alert system to inform your passengers about stations, or talk straight into the microphone if you want to say it in your own words.<br/></li><li>Out of time to stop the train properly? Use emergency braking to avoid accidents.<br/></li><li>If you did not succeed in avoiding the accident, you have to hurry in the depot, where the firefighters will be ready to take care of you burning train!</li></ul><br/>", "metacritic": null, "released": "2018-03-16", "tba": false, "updated": "2019-08-28T21:57:59", "background_image": "https://media.rawg.io/media/screenshots/151/15108a6fa408996035cf14bcd1348c3b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 13, "toplay": 1, "dropped": 1, "playing": 1}, "playtime": 4, "achievements_count": 20, "ratings_count": 1, "suggestions_count": 271, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "macOS"], "developers": ["Simulators Live"], "genres": ["Simulation", "Indie"], "publishers": ["Simulators Live"], "esrb_rating": null}