{"id": 61649, "slug": "realms-of-supremacy", "name": "Realms of Supremacy", "name_original": "Realms of Supremacy", "description": "A realm that knew peace for 100,000 years is now being disturbed by a dark figure. It becomes a race to gather the nine planetary orbs before darkness rules enough of them to bring the last realm to darkness and add it to the forces of hell. Will light conquer the darkness and try to bring the light to the other realms? Or will darkness take the final realm and rule for all eternity? Is it light or darkness that will reign supreme over the 10 realms? Light has a long way to go to extinguish the darkness once and for all.<br/><br/>The game is Adventure / RPG <br/><br/>Alt + F4 exits the game (will be fixing that in a later build)<br/>Next build will allow you to change keyboard settings as shown in image<br/>The game can be played by just using the mouse as well<br/>Left Click: OK<br/>Right Click: Menu / Cancel<br/><br/>The battle system is turn based and order of turns is based on how high everyone's average stats are<br/><br/>Currently the number of items available in game are as follows:<br/><br/><ul><li>17 Items<br/></li><li>9 Swords<br/></li><li>6 Bows<br/></li><li>4 Staffs<br/></li><li>9 Shields<br/></li><li>5 Helmets<br/></li><li>7 Body Armor<br/></li><li>4 Wristbands<br/></li><li>6 Gloves<br/></li><li>9 Accessories</li></ul><br/>All weapons and armor can be upgraded and have their durability repaired. There is also an item available to make your weapons and armor unbreakable.<br/>All skills can be learned early through the JP learning system.<br/>After completing the first 8 dungeons you can craft all items, weapons, and armor, through the synthesis system.<br/>At the end of the game you will have access to the save+ system. You start the game over and choose your game difficulty using the in town doorway. Your starting equipment varies depending on what difficulty you choose.", "metacritic": null, "released": "2018-06-15", "tba": false, "updated": "2019-08-28T21:57:59", "background_image": "https://media.rawg.io/media/screenshots/8ce/8ce30a29c46b619860c4d6511188de96.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 103, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Glenn Whitfield"], "genres": ["RPG"], "publishers": ["Glenn Whitfield"], "esrb_rating": null}