{"id": 616490, "slug": "the-spaceman-chronicles-2021-demo", "name": "The Spaceman Chronicles (2021 Demo)", "name_original": "The Spaceman Chronicles (2021 Demo)", "description": "Stranded in Strange Worlds \r\n<p>There was a flash, a loud noise, the irritating feeling of a lack of gravity - followed by the nauseating swirl of the great dark evacuating the tiny tin can constructed to travel through the star fields. An asteroid, just the size of a walnut, hit the ship with almost 10% of the speed of light, tearing an orifice, set with sharp metal teeth, in the silver hull. \r\n  </p>\n<p>\n</p>\n<p>The flexible substitute skin of the rocket managed to close the hole and stopped the maelstrom of space's vacuum, leaving them with the shock of their life - and a severely damaged ship drifting though the darkness, minimally manoeuvrable.\r\n  </p>\n<p>\n</p>\n<p>The ships reactor was leaking and the energy reserves where dwindling. Their only option was to make it to one of the solitary unknown moons revolving around the great gas giant reigning the star system they were currently travelling through.\r\n  </p>\n\n<p>The severely damaged ship managed to crawl through the atmosphere of one of the tinier moons, cut through the sky and landed on the grey rocks of this ominous celestial body. They stepped outside in search of urgently needed fuel.\r\n  </p>\n<p> And this is where the story begins…</p>\n\n<p>This is were your adventure - the Spaceman Chronicles - start.</p>\n<p>Make your way in this Demo through the celestial canyons of a tiny moon in search for batteries to power your ship. Master platforming challenges, meet strangers, survive the danger of a strange environment and explore the caves of a new world.</p>\n<p>This Demo is the Start of the Spaceman Chronicles Project - a metroidvanian platformer, which is being solo-developed since late March 2021.</p>\n<p>Please download the game, play it, have fun and leave me some feedback as you people are my most important QA team :)</p>", "metacritic": null, "released": "2021-06-07", "tba": false, "updated": "2021-06-11T10:40:34", "background_image": "https://media.rawg.io/media/screenshots/530/5308ef630b203ac365446c032cbc7703.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 214, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Pidibidi"], "genres": ["Adventure", "Platformer"], "publishers": [], "esrb_rating": null}