{"id": 616685, "slug": "survival-machine", "name": "Survival Machine", "name_original": "Survival Machine", "description": "<p>Survival Machine is a 3rd person survival-adventure game with a colourful theme. You travel through ever-changing lands on the great machine which serves as your base. Play solo or in co-op with friends.</p>\n<p>Base building and fun crafting</p>\n<p>Survival Machine is your precious home. You can build on top of this ever-moving base and adapt it to your needs. An upgraded engine will consume less fuel but a new shiny cannon would smash some zombies into pieces… it’s up to you to decide!<br />\nAlso, it’s probably a good idea to craft some weapon and armor before jumping straight into the wild. But then explore freely to find new resources and mysteries of this bright, beautiful, yet unknown world.</p>\n<p>Exploration</p>\n<p>Discovering the world and various landscapes is fun and easy here. Forests, deserts, tundra… Survival Machine constantly drives forward through all kinds of environments and lets you just jump off of it whenever you want to start your own small expeditions. Finding new rare resources, items, fighting out a zombie here and there, or discovering a history of this world - anything can make a journey so exciting!</p>\n<p>Defending is fun!</p>\n<p>Zombies will surely try to invade your machine during the night. It’s because they are stronger then. The trick is to prepare yourself for their attacks. Planning your defenses, using special stationary weapons, and building walls in strategic places will make it easier to survive. And trust me, you will get some laughs while doing so!</p>", "metacritic": null, "released": null, "tba": true, "updated": "2021-06-13T10:46:06", "background_image": "https://media.rawg.io/media/screenshots/67e/67e1c508c666a01bbfe2a0534613da97.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 293, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": [], "genres": ["Action", "Adventure"], "publishers": [], "esrb_rating": null}