{"id": 616642, "slug": "trash-master-chazz_burger", "name": "Trash Master (Chazz_Burger)", "name_original": "Trash Master (Chazz_Burger)", "description": "<p><strong>Welcome to Trash Master, a game where the protaginist (Ashley</strong><strong>) is put on a job to clean up the enviroment in many places.</strong></p>\n<p><strong>Level 1 - Cityscape</strong><br/></p>\n<p>Cityscape is a place with  many people who do not care about the environment as much as they should. They go around throwing rubbish on the ground while doing other things as they should.</p>\n<p>Ashley is tasked with the mission of cleaning up the city by picking up the rubbish of these people and turning it into Rubbish co.</p>\n<p><strong>HOW TO PLAY</strong><br/><strong>-----------------------------</strong><br/>1. Download the .zip file of the game<br/>2. With the file, right click, then \"Extract All...\" and choose where you want the game to be.<br/>3. Open the file and open \"TrashMaster.exe\"<br/>4. It may show a popup saying \"Windows protected your pc\", if it does, click \"more info\" and then click run anyway.<br/><strong>-----------------------------</strong></p>\n<p><strong>Why does the game show up with \"Windows protected your pc\"?<br/></strong>This is happening becuase we do not have a certificate for the game which means that we cannot immediatly build trust with the ScreenSmart service with windows.<br/><br/>We can begin to prevent this by just running the app anyway and windows will eventually pick up that multiple people are allowing this app and make the popup not appear for others.<br/></p>\n<p><strong>It is still being worked on and is at the start of Early Access so it is not near done yet. Even though it is not in the greatest state at the moment, we hope that it is enjoyed and can't wait for you guys to play it!</strong></p>\n<p><strong>Hope you guys enjoy the game at its current state and don't forget to report bugs or submit feedback into the comments section</strong><br/></p>", "metacritic": null, "released": "2021-06-07", "tba": false, "updated": "2021-06-11T11:25:14", "background_image": "https://media.rawg.io/media/screenshots/6bc/6bc0ab07fd02749aaf34725e9f326c39.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 48, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Chazz_Burger"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}