{"id": 61661, "slug": "the-real-laser-ball", "name": "The Real Laser Ball", "name_original": "The Real Laser Ball", "description": "The Real Laser Ball is a short, straightforward game meant to be played in brief intervals (10 to 30 minutes at a time), while also maintaining a sense of progression between each session. Blast your enemies, collect some coin, upgrade your ball, and chase your (and the leaderboard’s) high score... all while huffing that sweet 80’s nostalgia. Expect a difficult score chasing arcade game.<br/><br/>Why \"The Real\"? Laser Ball is a pretty rad name, and an accurate description. However, the game took a little longer to make than planned and someone else snagged the name. \"Laser Sphere\", \"Laser Orb\", \"Bally Laser Firey PEW PEW\" just didn't have the same ring to it. So, I took a page out of Ghosbuster's book and it became \"The Real Laser Ball\". <br/><br/><br/><ul><li>You control a ball. That ball fires a laser. Get it?<br/></li><li>The laser is your main weapon and your only way of moving around the screen<br/></li><li>Picking up credits will allow you to upgrade various aspects of both the ball and the laser.<br/></li><li>As your level increases, the amount, difficulty, and score value of enemies also increases. <br/></li><li>Get hit without your shield or leave the screen and it’s game over.</li></ul><br/><br/>Hit boost to zoom across the screen, fight gravity, or deal extra damage to your enemies. Shut down the laser to spin your ball around faster to avoid that approaching wall, snag some credits before they disappear, or escape the approaching bomb. Destroy the enemies as fast as you can to keep your score multiplier going. Drop a screen clearing pulse and hope to pick up another shield charge to stay in the fight a little longer. <br/><br/><br/><ul><li>Difficult skill based twitch gameplay<br/></li><li>Easy to understand but hard to master controls<br/></li><li>Endless arcade style that gets harder the longer you live<br/></li><li>Upgrade system that increases your shield, damage, score multiplier, and more!<br/></li><li>Great for both short and long term game sessions.<br/></li><li>Steam Leader board, Achievements, Cloud support, and (Coming Soon) Trading cards.<br/></li><li>Full Controller Support.<br/></li><li>Neon 80’s aesthetic.<br/></li><li>80’s synth soundtrack</li></ul>", "metacritic": null, "released": "2018-08-21", "tba": false, "updated": "2019-08-28T21:57:58", "background_image": "https://media.rawg.io/media/screenshots/ac8/ac814eaee79765554bc9437bc894545b.jpg", "website": "http://holmsario.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 26, "ratings_count": 0, "suggestions_count": 106, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Holmsario Games"], "genres": ["Action", "Indie"], "publishers": ["Holmsario Games"], "esrb_rating": null}