{"id": 6166, "slug": "word-science", "name": "Word Science", "name_original": "Word Science", "description": "“As a score chasing title, Word Science is one to dive into for short periods of time but it’s surprising how often one comes back for more.” -148Apps<br/><br/>Get ready for some spellbinding, wordsmithing fun with Word Science!<br/><br/>In this fast-paced spelling game, your words power Dr. Von Vocab’s crazy lab!  Grab letters as they whiz by on conveyor belts and form words as fast as you can to keep Dr. Von Vocab’s experiments going… or else.  Are you ready for Word Science, a new word game that only science could create? <br/><br/>To make the game even more interesting, Doctor Von Vocab has included some mad word technology for you to use:<br/><br/>BLANK TILES! Not seeing that letter you need?  Put in a blank tile, which can stand in for any letter. <br/><br/>SPELLEMENTS! Spellemental tiles have twice as many letters on them and earn you more points.<br/><br/>SCORE BOOST! Green tiles offer you a straight up point bonus, because, clearly, GREEN has MORE SCIENCE.<br/><br/>EXTRA TIME! With the press of a button, add time to the clock.  The 4th dimension is yours to control!<br/><br/>SCRAMBLE! With the flick of a switch, speed up all the belts in the lab for a new selection of letters to choose from.<br/><br/>FRIENDLY COMPETITION! Challenge your friends on Game Center and Facebook.  Wow them with your words!", "metacritic": null, "released": "2014-01-08", "tba": false, "updated": "2019-10-22T14:28:43", "background_image": "https://media.rawg.io/media/screenshots/f53/f53cee3f2cdd452a4c806afc7bf0f2f4.jpeg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 104, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["WildTangent"], "genres": ["Family"], "publishers": ["WildTangent"], "esrb_rating": "Everyone 10+"}