{"id": 616690, "slug": "blacktail", "name": "Blacktail", "name_original": "Blacktail", "description": "<p>You are Yaga, a 16-year-old girl accused of witchcraft and expelled from an early medieval Slavic settlement. When living memories of her past return as foul spirits walking the earth, Yaga’s best choice is to do what she does best: hunt them down.</p>\n<p>Create the myth of Baba Yaga by living out the origins of this classic Slavic folk story in BLACKTAIL, the first-person action-adventure from THE PARASIGHT. Experience a one-of-a-kind blend of intense archery combat and dark storytelling. Choose your path to become the guardian of the woods or the terror nightmares are based on.</p>\n<p>Use your trusty bow and gauntlet to defeat enemies throughout your journey<br />\nCraft arrows and potions, hunt wild game, and harvest herbs to survive in the uncanny woods<br />\nFind hidden treasures and pieces of Slavic legends</p>\n<p>Follow a mysterious voice leading Yaga down the dark path to power and discover your own past along the way<br />\nTrack down elusive spirits and engage in thrilling boss fights to recollect Yaga&#39;s missing memories<br />\nRelive memories to gather clues and solve the mystery of Yaga’s lost friends<br />\nDive beyond the surreal. Every memory is an artfully crafted 2.5D narrative episode — each a trippy vision shedding light on Yaga’s heart and soul, as well as her mysterious origin</p>\n<p>Define your alliances and beliefs through story-driven side quests. Decide the fate of the land and its inhabitants: be vengeful and manipulative, or honest and compassionate<br />\nBLACKTAIL&#39;s Morality System will significantly impact your gameplay experience. Watch your skillset change as you make story defining choices that shift your morality<br />\nCollect lost recipes from the ancient Grimoire, brew elixirs in the Cauldron to unlock skill upgrades and grow into a great power</p>\n<p>Choose your final fate and write your own fairy tale. Will you uphold the light, or will you slide into darkness?</p>", "metacritic": null, "released": "2022-12-15", "tba": false, "updated": "2023-12-30T17:26:32", "background_image": "https://media.rawg.io/media/games/d00/d0045250cc21dfd18987a8986004262a.jpg", "website": "https://www.focus-entmt.com/games/blacktail", "rating": 3.57, "rating_top": 3, "added_by_status": {"yet": 24, "owned": 102, "beaten": 17, "toplay": 69, "dropped": 14, "playing": 6}, "playtime": 2, "achievements_count": 38, "ratings_count": 30, "suggestions_count": 429, "game_series_count": 0, "reviews_count": 30, "platforms": ["PC", "PlayStation 5", "Xbox Series S/X"], "developers": ["THE PARASIGHT"], "genres": ["Action", "Adventure", "RPG"], "publishers": ["Focus Entertainment", "THE PARASIGHT"], "esrb_rating": null}