{"id": 616732, "slug": "my-new-memories", "name": "My New Memories", "name_original": "My New Memories", "description": "<p>In My New Memories you play a (male) character that lost his memories after a terrible car accident. You wake up in a hospital, confused and lost with no idea how you landed there. But you are not alone. Your family is there to slowly help you back into your life. Your wife, who was also involved in the car accident, has fallen into a coma. But that doesn&#39;t mean that she is gone. Through circumstances that you don&#39;t yet understand, she appears in your dreams, showing you things from your past life that you forgot.<br />\nOn your journey to finding New Memories you will uncover things that seem unspeakable to you; moments you experienced with your wife that are of a more precarious nature. Will you embrace this side of your life or will the morality that you didn&#39;t care for before your accident come back? You can decide everything yourself.<br />\nThis game is very story heavy, please keep that in mind before you buy it. It focuses more on the story than it does on the lewds. While there are lewd scenes in the game, they are not the focus.<br />\nThe first release that is available right now contains the full prologue:<br />\n~1300 Renders<br />\n~70k words<br />\nWhich should lead to around 3 to 4 hours of playtime, depending on your reading speed. Each update will be as long as this prologue and will add a new chapter to the game. All future updates will be free. So if you buy into the early access version, you will get access to all future updates!<br />\nA Story-Rich Visual Novel  that includes character interactions, development and extremely wholesome moments<br />\nHigh quality images and animations<br />\nNo game overs, no bad endings.</p>", "metacritic": null, "released": "2021-06-11", "tba": false, "updated": "2023-02-16T15:29:59", "background_image": "https://media.rawg.io/media/screenshots/8be/8be959717c2ff86e7699353a6c8f81c6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 31, "toplay": 12, "playing": 2}, "playtime": 1, "achievements_count": 8, "ratings_count": 3, "suggestions_count": 342, "game_series_count": 0, "reviews_count": 4, "platforms": ["Linux", "macOS", "PC"], "developers": ["Killer7"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Killer7"], "esrb_rating": "Adults Only"}