{"id": 616702, "slug": "hentai-jigsaw-photo-studio-fruit-girls", "name": "Hentai Jigsaw Photo Studio: Fruit Girls", "name_original": "Hentai Jigsaw Photo Studio: Fruit Girls", "description": "<p>WELCOME TO THE JUICY WORLD OF THE FRUIT GIRLS!<br />\nThis is the perfect game for those who want to enjoy the famous and juicy Fruit Girls while playing with just one hand. Complete puzzles by choosing your challenge level and indulge yourself in the most delicious photo shoots you&#39;ve ever seen. Unlock all Fruit Girls for a special surprise! Come see the hottest and most coveted girls of the moment. We also have a special surprise for you at the end of the game. Be sure to unlock our Fruit Salad in the final puzzle! We wish you to delight in the exuberant forms and sweet taste of these hentai girls.<br />\nUNIQUE HOT HENTAI GIRLS:<br />\nAmphira, The Sweet Strawberry: As sweet as they come, but can be quite salty when challenged. She is a successful tattoo artist that practices pole and chair dancing to keep all those curves how we love&#39;em!<br />\nJunipher, The Shy Papaya: Gamer, otaku and fanatic kpop fan, she is famous for being the most seductive face of all e-sports player of all times and for her &quot;accidental&quot; nip slips to distract opponents and fans.<br />\nLollaia, The Soft Peach: She is the eccentric sole heir to a vast fortune of a mining company. When she dresses as a maid she always dons a smile that hides her constant S&amp;M desires.<br />\nNerin, The Naughty Banana: She is a college sophomore. Our Naughty Banana is smart, beautiful, knows her own qualities and dreams of being a professional model. She has a lovable and friendly personality that melts hearts.<br />\nRhenelis, The Creamy Jabuticaba: Elegance, perseverance e resistance are words that define her. She loves dancing, swimming and writing. Want to seduce her? You&#39;ll have to impress this beauty with physical and intellectual prowess!GAME FEATURES:<br />\nHot hentai girls with distinctive looks and unique personalities!<br />\nA delicious Fruit Salad scene where all Fruit Girls participate!<br />\nCustomize your experience and difficulty level at will!<br />\nSee all girls that you have unlocked in one place!<br />\nOriginal music with a lo-fi feel!<br />\nSexy sound effects recorded by a real voice actress!<br />\nMultiple achievements!<br />\nExtra content in free updates!</p>", "metacritic": null, "released": "2021-06-13", "tba": false, "updated": "2021-06-21T13:25:44", "background_image": "https://media.rawg.io/media/games/04a/04ab0af54039c1e8ff35b0ac88beae46.jpg", "website": "https://tabbuentertainment.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 210, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Tabbu Entertainment Games"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["Tabbu Entertainment Games"], "esrb_rating": null}