{"id": 616791, "slug": "bermuda-adventures-farm-games", "name": "Bermuda Adventures: Farm Games", "name_original": "Bermuda Adventures: Farm Games", "description": "Raise animals, harvest crops, craft new recipes and trade with your friends in Bermuda Adventures!<br/><br/>Imagine that your big family gets together to celebrate their birthday in a paradise tropical resort! But suddenly something went wrong, your plane lost control and made an emergency landing on a desert island and family members were scattered in all directions. Maybe you shouldn't have built a route through the Bermuda Triangle? Now they must not only learn to live on a tropical paradise island, but also find all the relatives lost during landing.<br/><br/>Help a family arrange their everyday life, teach them how to grow plants and get food. Watch how production grows and new characters appear on the island. Solve their family issues and don't let them quarrel over trifles. Be amazed with them at the mysterious secrets and unusual finds that the Bermuda Triangle hides.<br/><br/>And soon you won't want to leave the wonderful Bermuda Adventures!<br/><br/>Main features:<br/><br/>- Huge territory of a tropical farm<br/>- Dozens of islands with exciting expeditions<br/>- A lot of members with unique characters and behaviors<br/>- Hundreds of interesting and funny dialogues<br/>- Unique farm animals, plants and buildings<br/>- A tribe of natives, an Ancient city of wild monkeys, travelers from the past and other interesting neighbours<br/>- Family members customisation<br/>- Hundreds of township quests<br/>- And tons of humor and fun!<br/><br/>Are you ready to become a farmer and city manager to build your dream? Explore the Bermuda Triangle with Mom Jenny, Dad Steve and Daughter Sandy in this farming simulator game. Develop your own island farm and discover new territories!<br/><br/>Build a cozy villa and farm, extract resources and produce everything you need for exciting expeditions quests, construction and trading with other inhabitants of the Bermuda Triangle.<br/><br/>Set up your family ranch, raise animals, harvest crops, produce food for your family and trade with your neighbours. <br/><br/>Welcome to Bermuda Adventures!", "metacritic": null, "released": "2021-06-08", "tba": false, "updated": "2021-06-14T03:55:29", "background_image": "https://media.rawg.io/media/screenshots/737/737a7b75f749365f8504e5ba9b401df2_I1IyZpX.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 192, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["BELKA GAMES"], "genres": ["Adventure", "Casual"], "publishers": ["Belka Games"], "esrb_rating": "Everyone 10+"}