{"id": 616782, "slug": "merge-elves-new-home", "name": "Merge Elves: New Home", "name_original": "Merge Elves: New Home", "description": "In your free time, explore all that this incredible magic world has to offer. <br/>Explore elves, magic and mysterious secret places, face all kinds of challenges in the Merge Elves. <br/>Combine various objects through matching and merging, countless rewards are waiting for you to collect.  <br/>At the intersection of light and dark - the fairy garden, there's a mysterious witch. <br/>As a gril, she fell in love with human, but was betrayed. <br/>She stole the lover's child, and hid her to the fairy garden. <br/>She not only has to fight the evil dragon as a witch, but also takes care of baby and builds a warm home for her as a novice mom! <br/>Can she really do it? <br/>A story about healing and redemption unfolds in this magical garden.  <br/>The world you want to have is created by yourself. <br/>Merge Elves will definitely bring you a different experience, join in now and more full of joy than you could have ever imagined.   <br/><br/>Merge Elves Features: <br/><br/>Baby raising <br/>- Complete mission and fight off the evil dragon to collect food to feed baby; <br/>- By collecting stars, you can exchange various beautiful clothes for your baby from the elves. <br/>- Use puzzles to record beautiful moments and help the witch create a warm childhood for the baby.  <br/><br/>Match <br/>- Explore a variety of objects, match them to complete the challenge. <br/>- Move objects in the world at will, and match 3 objects of the same species to evolve them. Tap it to release its power and heal your garden cottage. <br/>- Find the mermaid statue on the cursed land. Match them to solve the dilemma and restore the vitality of the past.  <br/><br/>Collect New Elves <br/>- Discover brand new elf who lives in the magic forest, 4 growth stages, every stage can surprise you. <br/>- Match elves eggs and harvest items for you to use or match. Adventure and Dilemma <br/>- Hundreds of adventure levels to challenge your mind. <br/>- Solve the dilemma will improve your state, and how you come across, rich prizes to help you build your garden cottage. <br/>- In the journey of Merge Elves, you may encounter different challenges and get into difficult situations, watch out and be careful. Your wisdom and courage will help you to the end.  <br/><br/>Create Garden cottage <br/>- Evil has taken over the garden cottage, fight against them and heal the land to restore and take back the elf home. <br/>- Collect elf eggs, hatch them in the garden cottage, use our strength to restore the former beauty of our homeland.   <br/><br/>Social Convenience <br/>- Add your friends, chat in real time, visit their garden cottage for more inspiration. <br/>- Give each other gifts and items to improve your intimacy. It’s also fun to share with friends.  <br/><br/>Download now and discover where Merge Elves with your families and friends.  <br/>Merge Elves will bring you more fantasy experience, and travel with us in the beautiful world of magic. <br/>All suggestions and questions related to the game can be contacted through official channels. <br/>https://www.facebook.com/mergeelves <br/>G-mail: mergeelves@gmail.com", "metacritic": null, "released": "2021-06-02", "tba": false, "updated": "2021-06-14T03:50:42", "background_image": "https://media.rawg.io/media/screenshots/156/156e50b2d59a01328727855ceef57f11_fVhkPvR.jpg", "website": "https://mergeelves.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 159, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["IvyMobile"], "genres": ["RPG", "Puzzle"], "publishers": ["IVYMOBI"], "esrb_rating": "Everyone 10+"}