{"id": 616763, "slug": "diablo-prime-evil-collection", "name": "Diablo Prime Evil Collection", "name_original": "Diablo Prime Evil Collection", "description": "The Diablo® Prime Evil Collection includes: \r\n- Diablo® III: Eternal Collection game which is immediately playable upon pre-order \r\n- Diablo® II: Resurrected™ game\r\n- Diablo® III: Hatred’s Grasp Wings DLC\r\n- Diablo® III: Mephisto Pet DLC<br/><br/>Diablo® II: Resurrected™ is the definitive remastering of Diablo® II and its Lord of Destruction® expansion—two hallmark entries in Blizzard Entertainment’s genre-defining action role-playing series. Veteran players, as well as those who missed out when the original game was first released on PC twenty years ago, can now experience Diablo® II’s timeless gameplay with modern visuals and audio that take advantage of today’s gaming hardware. <br/><br/>Ascend the Forgotten Tower, blaze a trail through the jungles of Kurast, and storm the gates of Hell to defeat Diablo himself. Then, scale the peak of Mount Arreat to face Baal, the Lord of Destruction, in Worldstone Keep. <br/><br/>Seven of Sanctuary’s greatest champions await at the iconic campfire screen—the Amazon, Assassin, Barbarian, Druid, Necromancer, Paladin, and Sorceress. Each is highly customizable with countless build and gear options for players to explore. <br/><br/>Diablo® II: Resurrected can be played as a solo experience, or grab some friends on your preferred platform and enjoy up to 8-player co-op. Then blow off some steam and claim a few ears by engaging in thrilling PvP duels outside of town.<br/><br/>Find your way back to New Tristram in Diablo® III: Eternal Collection, 20 years following the events in Diablo II: Resurrected. Return to where it all began and investigate rumors of a fallen star: the first sign of evil's rebirth, and an omen that the End Times have begun. Harness the might of your heroic birthright as one of seven playable classes.<br/><br/>\r\nDiablo® II: ResurrectedTM supports English (US), Spanish (EU), Spanish (AL), Portuguese (BR), French (France), German, Italian, Polish, Russian, Korean, Traditional Chinese, Simplified Chinese and Japanese.  <br/><br/>Diablo® III supports English (US), Spanish (EU), Spanish (AL), Portuguese (BR), French (France), German, Italian, Polish and Russian. It does not support Korean, Traditional Chinese, Simplified Chinese or Japanese.<br/><br/>See https://news.blizzard.com/en-us/diablo2 for more details. Limited time only. Internet connection required. Online Multiplayer subscription may be required.", "metacritic": null, "released": "2021-09-23", "tba": false, "updated": "2021-09-24T03:41:19", "background_image": "https://media.rawg.io/media/screenshots/1e2/1e21096cf53f0426f26c1778b307287a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 23, "game_series_count": 0, "reviews_count": 0, "platforms": ["Xbox One"], "developers": [], "genres": [], "publishers": [], "esrb_rating": null}