{"id": 616838, "slug": "virulent", "name": "Virulent", "name_original": "Virulent", "description": "I dedicate this game to every person who has been separated from  their family or loved ones during the tragic corona virus outbreak of  2020. We miss you dearly.\r\nInstructions\r\n<p>Virulent is a turn-based game where you use action points to manage a  viral outbreak on earth. The story is that the earth is hit by  asteroids carrying a deadly virus, your task is to launch missiles to  prevent any more infections, while administering remedies to infected  countries and cure them.\r\n  </p>\r\nMute\r\n<p>Press control + m to mute/unmute audio.\r\n  </p>\n<p>\n</p>\r\nControls\r\n<p>To highlight a country, choose a remedy or select an asteroid:\r\n  </p>\n<p>up, down, left, right arrow keys.\r\n  </p>\r\nActions\r\n<p>To open country details or press a toolbar button:\r\n  </p>\n<p>Press the X key.\r\n  </p>\r\nShortcut key\r\n<p>Press the Z key.\r\n  </p>\n<p>On all screens you can use the Z key as a shortcut instead of using the toolbar.\r\n  </p>\n<ul><li>On the Regional screen, it opens the remedy screen if a remedy can be applied.\r\n</li><li>On the Remedy screen, it applies the selected remedy.\r\n</li><li>On the Radar screen, it launches a missile.\r\n</li><li>On the Command screen, it ends the turn (only when no more actions can be performed).\r\n</li></ul>\r\nThe Toolbar\r\n<p>The toolbar is located at the bottom of the screen. Use the arrow keys to highlight a button, and X to press it.\r\n  </p>\n<p>On the Command Station screen, press the down key to focus the toolbar at the bottom. To return to country selection, press the up key.\r\n  </p>\n<p>Instructions are in-game. Choose the Help toolbar icon to read them.\r\n  </p>\r\nHistory\r\n<p>Virulent is a remake of an Atari game called “Epidemic!” by Steven Faber (1982).\r\n  </p>\n<p>I started the project in July 2020 for the Pico-8 fantasy console. It took 4 weekends to complete. I referenced the original game manual  to derive the game mechanics. I updated the world data to reflect  modern country names and statistics, and added three new countries -  Madagascar, Southeast Asia and South Africa.\r\n  <br/></p>", "metacritic": null, "released": "2021-06-14", "tba": false, "updated": "2021-06-14T04:13:10", "background_image": "https://media.rawg.io/media/screenshots/37f/37fa8b6561197882246bdf8ac70555de.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 133, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Wesley"], "genres": ["Strategy", "Simulation"], "publishers": [], "esrb_rating": null}