{"id": 616808, "slug": "black-border-border-patrol-simulator-game", "name": "Black Border: Border Patrol Simulator Game", "name_original": "Black Border: Border Patrol Simulator Game", "description": "Black Border is a border simulator game 🛂 that simulated the life of a real border patrol officer 👮. In this game, you play as a border officer of the border cross entry and exit gates, who supposed to check the passengers' papers and stop the smuggling of illegal items and bribery.<br/><br/>As a border officer 👮, you have to check entrants' papers and use all of your objects and tools to arresting people like terrorists, wanted criminals, smugglers, and passengers with forged or stolen documents.<br/><br/>They don't want you to do your duty; they want you to obey. <br/>-Mark Madison<br/><br/>Brothers and Sisters, Alanan greets you. <br/>After the independence of the states of our motherland, Mudland, we were the only ones who stayed true to the ideals of Mudland. Based on our leader's speeches, we looked for nothing but freedom, but the intrusive and corrupted regimes of Partakna And Denber were against our country's independence. After years of bloody war with enemies of the people and the killing of innocent women and children of Alanan, now is time to rebuild the country. Let's unite once more and create Alanan anew. May our Great Leader be with us along this journey. <br/>-David Sullivan, Alanan's Prime Minister<br/><br/><h3>The followings are some items that the border officer (you) is supposed to check carefully and prevent illegal border crossing of passengers and other forbidden objects:</h3><br/>✅\tThe Full name of each person is mentioned in all the papers.<br/>✅\tCheck The weight and height of the passengers to not be against the ones mentioned in the papers.<br/>✅\tCheck the expiry date of their passport or entry permit and other papers.<br/>✅\tFrisk passengers for weapons and illegal items and preventing their entrance to the country.<br/>✅\tCheck passengers' faces to be the same as photos in their documents.<br/><br/><h3>The followings are some features of Black Border: Border Simulator Game:</h3><br/>✅\tSimple but addicting mechanics.<br/>✅\tNew Game Modes continuously getting added.<br/>✅\tBeautiful graphics!<br/>✅\tRich story<br/>✅\tStory based<br/>✅\tMultiple endings<br/>✅\tDisguised communications<br/>✅\tOpposition Groups Communication<br/><br/>Border officer duty is to perform like the security of border force simulator and control transportation of prohibited items like weapons, antiques, toxic, narcotics, and other illegal items. Black Border: Border Simulator Game is a great combination of papers please games, border force games, border patrol games, and other best simulator games.<br/><br/>Follow our official website and socials to get the latest news and updates:<br/>Website: https://blackbordergame.com/<br/>Twitter: https://twitter.com/blackbordergame<br/>Facebook: https://www.facebook.com/blackbordergame<br/>YouTube: https://www.youtube.com/channel/UCyI-eZJNH8Gq4loPFiSDpRQ<br/><br/>We are always collecting user feedback and emails that help us to apply them in updates. We appreciate it if you kindly let us know your detailed feedback. Please email us to this address support@blackbordergame.com.", "metacritic": null, "released": null, "tba": false, "updated": "2021-06-14T04:06:11", "background_image": "https://media.rawg.io/media/screenshots/5c4/5c45605c18e3d96a8442b3c4d15a68e1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 219, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Bitzooma Game Studio"], "genres": ["Simulation"], "publishers": [], "esrb_rating": "Teen"}