{"id": 617016, "slug": "re_connect", "name": "RE_CONNECT", "name_original": "RE_CONNECT", "description": "<strong>NOTE:</strong> Press <strong>T</strong> to restart levels, or <strong>Escape</strong> to go back to the title screen\r\nRE_CONNECT: Neon Generic Escalation\r\n<p>This game was made in under 48 hours for GMTK Game Jam 2021. I definitely lost some hours because Surviving Mars was free on Humble Bundle that weekend, and not all planned features made it - but that's what jams are for!</p>\r\nGameplay\r\n<p>In a similar vein to my previous game Colorbound, this is a puzzle-platformer, in which you have multiple levels that you have to unlock.</p>\n<p>You play as a little cube with a beautiful placeholder art, and to clear a room you have to establish a connection between the two gold plates, to let the neon lights flow through the magenta &amp; cyan lanes. To help you, more little cubes are dispersed around the level, and you will snap to them as soon as you touch, allowing you to be taller, wider, have weird angles, or be a bigger cube if you want - any shape becomes possible!</p>\r\nChallenge modes\r\n<p>- Speedrun: each level has a set time (in gray) which you have to beat. It won't always be easy, but you'll get to be proud of your best times displayed on the title screen!</p>\n<p>- All-Stars: each level has one to three optional stars you can collect. This often requires some thinking to get the weirdest ones, and you won't beat any speed record while gathering stars - but they're so shiny!<br/></p>\r\nControls\r\n<p>[A]/[D] or [left]/[right] to move around, [W], [up] or [space] to jump. If you're on an AZERTY keyboard, [Q]/[D] and [Z] work as well :)</p>\n<p>You can press [T] at any time to restart a level, or [Escape] to return to the title screen.</p>\r\nCredits\r\n<p>The game itself, all graphical assets and the music were made by myself during the jam, using Godot Engine, Aseprite, Krita and VCV Rack. Sounds were created with jsfxr or downloaded from freesound.org.<br/></p>", "metacritic": null, "released": "2021-06-13", "tba": false, "updated": "2021-06-14T04:50:16", "background_image": "https://media.rawg.io/media/screenshots/915/915beae5c2ac81b636b00beceab0fd5e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 24, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux", "Web"], "developers": ["Zeroji"], "genres": ["Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}