{"id": 617123, "slug": "connector-poetahto", "name": "Connector (poetahto)", "name_original": "Connector (poetahto)", "description": "<p><strong>A first-person puzzle game about controlling various objects to reach your goal.</strong></p>\n<p>Use <strong>WASD </strong>to move and press <strong>E</strong> while looking at an object to control it. Press <strong>SPACEBAR</strong> to jump - smaller objects may have increased mobility such as double jumps. The goal of each level is to bring your original body to the exit (a yellow sphere).</p>\n<p><strong>Known Issues:</strong> In the first level, there are several ways to softlock by trapping yourself. Holding escape to return to the menu should allow you to try again. Other issues include the laser cube in level 1 being able to fall off the table and certain doors in level 2 not having sounds.</p>\n<p><strong>Final notes: </strong>This game was a lot of fun to work on, and I was sad we didn't get to add more levels and mechanics. The cutting mechanic that is usable in the playground was really impressively done by Rain, and I was really sad that we didn't get to integrate it into a level. I thought the mechanic was still fun enough on its own and wanted to show it off, hence the creation of the playground.</p>\n\n<p><em>This game was made for the GMTK Game Jam 2021 over 48 hours by:\r\n</em></p>\n<p><em> poetahto - https://poetahto.itch.io/ \r\n</em></p>\n<p><em>RainDance - </em><em>https://lordraindance2.itch.io/</em></p>", "metacritic": null, "released": "2021-06-13", "tba": false, "updated": "2021-06-14T05:16:52", "background_image": "https://media.rawg.io/media/screenshots/dc2/dc2cb896bd1f58f35fd3bcdf83d8c085.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 19, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["poetahto"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}