{"id": 617209, "slug": "redfall", "name": "Redfall", "name_original": "Redfall", "description": "<p>Announced during the Xbox &amp; Bethesda Games Showcase, Redfall is a new co-op, open-world first-person shooter from Arkane Austin, the award-winning team behind Prey and Dishonored. Play it solo or in co-op with up to four players to face off against a legion of vampires that have overtaken the once-quaint island town of Redfall. In signature Arkane style, you will choose your path across the island and through the vampire masses as you discover what caused this plague of bloodsuckers, then put an end to the threat. Pick from a roster of heroes with unique skills and gear them up with customizable weaponry found throughout the island. Do whatever it takes to build the perfect team of vampire slayers.</p>\n<p>Redfall is coming exclusively to Xbox X|S and PC in Summer 2022 and will be available with Game Pass on day one.</p>\n<p>This Used to be Such a Nice Place</p>\n<p>Redfall used to be a bustling, beautiful island community. It had everything a coastal town in Massachusetts should have: a lighthouse, a lobster shack, a boardwalk…</p>\n<p>When the vampires took over, they blocked out the sun, pushed back the tides, and effectively walled off the island from the rest of society, trapping everyone who remained. Now vampires rule the town by night and the human cultists who worship them patrol the streets by day. Not too many people venturing out of safety to check out the boardwalk these days, and forget about getting fresh lobster.</p>\n<p>Enter: You.</p>\n<p>In Redfall, you’ll choose from a lineup of unconventional heroes, each with their own unique abilities and specialized weaponry, and face off against the bloodsucking legions threatening the island. You can go it alone, building your chosen character around solo play, or you can select the perfect character to round out a roster of heroes in up to four-player co-op.</p>\n<p>Meet the Squad</p>\n<p>“We wanted players to have an Arkane experience, but with the option of playing with friends this time,” says Co-Creative Director Ricardo Bare. “As a result, we thought going for heroes with strong personalities and distinctive backgrounds would make for a stronger game. We think players are going to enjoy not only the interaction of their various abilities as they fight the vampires, but also seeing their chemistry develop over time as they liberate Redfall.”</p>\n<p>Redfall features a rich campaign that explores not only the story of the island and the creatures plaguing its streets, but the stories of our four heroes as well.</p>\n<p>Layla Ellison – She may be the youngest member of the team, but there isn’t much she can’t handle with her wits and wildly powerful telekinetic abilities.</p>\n<p>Jacob Boyer – Jacob is an ex-military sharpshooter with a penchant for dark clothing and a mysterious vampiric eye. If you need to find him on the field, look for his spectral raven circling overhead. Jacob won’t be far away.</p>\n<p>Remi de la Rosa – Always spotted with her robotic compatriot, Bribón, Remi lives on the frontlines of conflict, using her brilliant mind and strong sense of empathy to protect her loved ones and help those in need around the world.</p>\n<p>Devinder Crousley – Inventor and internet-famous paranormal investigator, Devinder is ready to prove to the world that vampires are real – but he’s going to need to survive them first.</p>\n<p>How did they end up in Redfall? Why are they fighting to save what remains? Why do Layla’s powers manifest in the forms of an old-fashioned elevator and an umbrella? You’ll answer these questions and more as you explore Redfall.</p>\n<p>The Things that Bite in the Night</p>\n<p>The Arkane vampire isn’t afraid of crosses or allergic to garlic. They probably don’t sleep in coffins or need an invite to come into your house. Not that long ago, these vampires were just normal people. Well, normal, greedy people. People who were so obsessed with the idea of eternity that they used science to turn themselves into monsters.</p>\n<p>“Vampires are perennially fun, classical villains, because they’re ripe for every generation to reinvent and experience in a new light,” says Bare. “In our case, Redfall vampires are science-inspired, triggered by biotech longevity experimentation.”</p>\n<p>Now they’re building an army on Redfall, and there’s a clear hierarchy of power. After their transformation, some vampires develop abilities like the Angler (seen in the trailer), who uses a psychic harpoon to drag you away from your team. These vampires are getting stronger and stronger as they grow their numbers and you’ll need to ascend a ladder dripping with blood in order to reach the creatures at the top that started it all.</p>", "metacritic": null, "released": "2023-05-01", "tba": false, "updated": "2024-04-12T09:03:27", "background_image": "https://media.rawg.io/media/games/683/6834c702c73e28ef2b3b003bb2c54567.jpg", "website": "http://Redfall.com", "rating": 1.91, "rating_top": 1, "added_by_status": {"yet": 50, "owned": 98, "beaten": 15, "toplay": 144, "dropped": 61, "playing": 6}, "playtime": 8, "achievements_count": 120, "ratings_count": 80, "suggestions_count": 555, "game_series_count": 0, "reviews_count": 81, "platforms": ["PC", "Xbox Series S/X"], "developers": ["Arkane Studios", "Arkane Austin"], "genres": ["Action", "Shooter", "Adventure"], "publishers": ["Bethesda Softworks"], "esrb_rating": "Adults Only"}