{"id": 61720, "slug": "evergate", "name": "Evergate", "name_original": "Evergate", "description": "<p>Evergate transports you to an imaginative afterlife where two souls must overcome fate to be reunited. This challenging puzzle platformer weaves a heart-warming story through stunning artwork, emotive music and genre-bending mechanics.<br />\nThe gameplay is simple: break all the crystals by focusing their energy into targets. Each crystal unleashes different powers. Harness these different powers with ingenuity and skill to solve each puzzle.<br />\nUnique aim-TO-shoot mechanic. Your aim only energizes when it connects with an afterlife target. This small twist on the classic aim-AND-shoot mechanic opens up brand new challenges.<br />\nWorld filled with crystal powers. New powers keep the simple premise fresh while adding nuance and depth.<br />\nOver 100 challenging puzzles. Perfect for quick, casual play and competitive speed-running.<br />\nOne puzzle, many solutions. Explore a creative space full of possibilities. Find solutions we didn&#39;t intend!<br />\nSimple to learn. Hard to master.<br />\nStorytelling with style. Emotional and gripping narrative told through hand-crafted art and music.<br />\nEvergate is the first project to come out of Stone Lantern Games and has already received fantastic reviews from testers at PAX East 2018. Evergate was selected by PAX for the coveted PAX Rising selection at PAX West 2018 and was chosen to be showcased at the Boston Festival for Independent Games (BFIG).<br />\nStone Lantern Games is a Boston-based studios comprised of 4 MIT graduates. Like a gamer choosing a character class, each engineer on the team specializes in one of four proficiencies: Visual Effects, Art, Music, or Narrative.</p>", "metacritic": null, "released": "2020-02-15", "tba": false, "updated": "2022-08-08T18:43:32", "background_image": "https://media.rawg.io/media/screenshots/0f5/0f5b8f27c5c8f6cdbc70a41c63cf19cb.jpg", "website": "http://evergategame.com", "rating": 0.0, "rating_top": 5, "added_by_status": {"yet": 6, "owned": 36, "beaten": 3, "toplay": 4, "dropped": 3}, "playtime": 2, "achievements_count": 96, "ratings_count": 5, "suggestions_count": 134, "game_series_count": 0, "reviews_count": 5, "platforms": ["Xbox One", "Nintendo Switch", "PC"], "developers": ["Stone Lantern Games"], "genres": ["Adventure", "Indie"], "publishers": ["Stone Lantern Games"], "esrb_rating": null}