{"id": 617469, "slug": "molecular-assembly", "name": "Molecular Assembly", "name_original": "Molecular Assembly", "description": "<p>Assemble molecules from isolated atoms before the instable environment blows your lab up!</p>\n<p>In this arcade-like puzzle game, the stability meter acts as a timer, and you'll need to be fast! Creating a stable molecule will stabilize your machine, but non-regulated ones will make it worse.</p>\n<p>Spot compatible atoms, group them together, validate. As simple as that on paper. On practice however, your fingers will betray you more than once!<br/></p>\r\nHOW TO PLAY\r\n<p>All you need is a keyboard, the ability to read, and dexterity. <em>(some chemistry knowldge may help you, but is of course not required)</em><br/></p>\n<p>Use the <strong>[Arrow keys]</strong> to move around, <strong>[Enter]</strong> to select, and <strong>[Space]</strong> for toggling the Selection mode (you can read more about it in the Instructions manual)</p><p>If nothing happens when using the keyboard, it's because the window is out of focus. Click on the machine's screen to make it work!<br/></p>\r\nWHAT IS THE GOAL?\r\n<p>The goal is to creat the most molecules possible from the atoms that will be presented to you. The more you create, the more stable your lab environment will be.<br/><br/>Oh yeah, everything unstable! You're playing with split up matter after all. The longer you'll play, the less stable your machine will be. Check the \"Stability gauge\" on the top right corner to know how much time is left before everything blows up.<br/></p>\n<p>Some actions will make it go down, some will make is more stable. But in any case, you'll have to be fast!</p>\n<p>Your score is counted as \"Profit\". If you create a valid molecule, you'll make some. The more complex/rarer the molecule, the more profit of course!</p>\n<p>All additional rules are listed in the Instruction manual.</p>\n\n<p>Have fun, <strong>and </strong><strong>do it fast</strong>!<br/></p>", "metacritic": null, "released": "2021-06-13", "tba": false, "updated": "2021-06-14T06:41:42", "background_image": "https://media.rawg.io/media/screenshots/a83/a8315ba707a38f95f85daff71a106b64.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 38, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Exylas"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}