{"id": 6176, "slug": "tmnt-brothers-unite", "name": "TMNT: Brothers Unite", "name_original": "TMNT: Brothers Unite", "description": "Take back the streets of NYC with the most shell-tastic team of secret superdudes EVER! Play as Leonardo, Michelangelo, Donatello or Raphael and combat the Foot Clan, mutants, and bosses with fierce Ninjutsu attacks. It’s time to protect the city!<br/><br/>FEATURES:<br/>• Get ready for fast paced brawling action with Leo, Mikey, Donnie and Raph <br/>• Exciting and intuitive combat controls immerse you in the game<br/>• Jump, spin, punch, and kick waves of street gangs, mutants, Foot Clan, and legendary bosses<br/>• Upgrade each turtle with unique ninjutsu attacks, weapons, training, and boosts like the Freak Streak and Whack Attack<br/>• Chain attacks to trigger an awesome TURTLE POWER mini-game and fight up close with ALL 4 TURTLES<br/>• Play through STORY MODE, written by Tom Waltz, contributing author of the beloved comic series from IDW Publishing<br/>• Stay alive in SURVIVAL MODE against endless waves of enemies<br/>• Test your skills with in-game challenges<br/>• Compete against your friends’ high scores<br/>• Developed by the makers of the acclaimed game Combo Crew<br/><br/>This game offers in-app purchases and charges real money for additional in-app content. You may lock out the ability to purchase in-app content by adjusting your device settings. Apple will keep you logged on for an additional period of time after an initial in-app purchase. Additional purchases won’t require a re-entry of the password during this additional period of time. This is a function of Apple&amp;#39;s software and not within our control.<br/><br/>TEENAGE MUTANT NINJA TURTLES: BROTHERS UNITE collects personal user data as well as non-personal user data (including aggregated data) and connects with 3rd party social media applications. User data collection is in accordance with applicable law, such as COPPA. User data may be used, for example, to respond to user requests; enable users to take advantage of certain features and services; personalize content and advertising; and manage and improve Nickelodeon&amp;#39;s services. For more information regarding Nickelodeon’s use of personal user data, please visit the Nickelodeon Group Privacy Policy below. Our Privacy Policy is in addition to any terms, conditions or policies agreed to between you and Apple. Nickelodeon and its affiliated entities are not responsible for Apple&amp;#39;s collection or use of your personal user data and information. Use of this app is subject to the Nickelodeon End User License Agreement.<br/><br/>Privacy Policy:<br/>http://www.nick.com/info/privacy-policy.html<br/><br/>End User License Agreement:<br/>http://www.nick.com/info/eula.html<br/><br/>", "metacritic": null, "released": "2014-07-24", "tba": false, "updated": "2019-07-30T22:16:09", "background_image": "https://media.rawg.io/media/screenshots/009/009efb275f5b7ec759e0d55927238af1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 279, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Nickelodeon"], "genres": ["Action", "Arcade", "Casual"], "publishers": ["Viacom International"], "esrb_rating": null}