{"id": 617649, "slug": "the-hunter-of-falkenberg-rite-of-sundering", "name": "The Hunter of Falkenberg - Rite of Sundering", "name_original": "The Hunter of Falkenberg - Rite of Sundering", "description": "<p><strong>RITE OF SUNDERING</strong><strong> </strong>has been developed for the <strong>GMTK JAM 2021 in only <em>48 hours</em>.</strong></p>\n<p>In this action RPG you play as Lilly, the demon hunter apprentice. Her <strong>last test, </strong>before being grated the title of <strong>a full-fledged hunter, </strong>is the mysterious <strong>Rite of Sundering. </strong>During this ancient exam Lilly ventures into the spirit realm to be tested on how she will react when confronted with an unwinnable, critical situation. </p>\n<p><strong>She doesn´t know</strong> but no matter how hard she may try - <strong>she will eventually lose</strong>.</p>\n<p>Come and complete your own <strong>RITE OF SUNDERING, a 16 bit </strong>roguelike arcade experience!</p>\n<ul><li>Become a demon hunter and <strong>hack and slash</strong> through an endless wave of monsters and other foes.</li><li>Collect new skills, items and magic to prolong your <strong>inevevidable failure</strong>.</li><li>Compete on the global online high score list for eternal glory in the <strong>SLEIPNIR DREAMWARE hunters guild hall of fame</strong>.</li><li>Learn more about Lilly and Sigurd from our upcoming game <strong>THE HUNTER OF FALKENBERG.</strong></li><li>Experience our interpretation of the jam's theme \"linked together\", in which actions in the real world have linked consequences in the spirit realm (and vice versa!).</li></ul>\n\n<p><strong>Known bugs (will be fixed in the next non-jam version) : </strong></p>\n<p>- Dying crashed the game (your highscore will be transmitted anyway, dont worry)<br/>- Ingame menu (ESC) not working in this version <br/>- Enemies in tunnels can be attacked<br/>- Sometimes enemies can't be attacked when standing on a tunnel (game needs to be restarted then)<br/>- Sometimes layer errors occur (standing on foreground objects<br/>- Items have no description</p>\n<p><strong>Important Information:</strong></p>\n<p>Virus warnings when executing the game on Windows operating systems can be ignored, as they are false alerts which may occur due to our customized icon.<br/></p>", "metacritic": null, "released": "2021-06-13", "tba": false, "updated": "2021-06-14T07:27:31", "background_image": "https://media.rawg.io/media/screenshots/937/937198583b802b702bd8e40a46982e34.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 159, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["sleipnirdreamware"], "genres": ["Action", "RPG"], "publishers": [], "esrb_rating": null}