{"id": 617639, "slug": "featurecreeps", "name": "FeatureCreeps", "name_original": "FeatureCreeps", "description": "<p>Imagine leading a team of extremely talented game developers while</p><ul><li>they can create literally any feature of any quality, but they only decide for themselves what that feature would be</li><li>your producer wants to look like he is doing something when actually he only cares about photos of some Bug... Man..?</li><li>your publisher requests games based only on a vague theme-title and expects you to understand what features you need in such a project</li><li>you can throw money at your team and hire an outsourcer, but it only speeds up their creative process, they still don't care what features you actually need</li></ul><p>Notes:</p><p>The game is infinite, the only goal is to amass good income to be able to produce features faster and figure out the perfect formula for each theme.</p><p>Project themes are very limited, expect them to repeat often, it was a 48 hour jam after all :)</p><p>Known Issues:</p><p>You may randomly encounter a <missing entry=\"\" string=\"\" table=\"\"> instead of much-needed text. We are very sad and angry that it seems like this bug stayed till the end, but we've already spent a lot of time trying to fix it. Unreal is weird sometimes. :)<br/>If you encounter this a lot, try to restart the game several times while letting it play itself for a while, sometimes the bug ceases to appear for the following startups.</missing></p><p>Sometimes employees stop producing features for some reason that we haven't had time to figure out since it appears extremely rarely and seems to reliably get fixed by Boosting the employee.</p><p>Sometimes conveyor animation stops playing while everything else is working fine, this does not affect gameplay in any way, so the same \"only 48 hours\" excuse applies. :)</p><p>Have a great time playing and many thanks for noticing our project! :D</p>", "metacritic": null, "released": "2021-06-13", "tba": false, "updated": "2021-06-14T07:25:18", "background_image": "https://media.rawg.io/media/screenshots/95b/95b3f4bc1bd052e5763fa62445c2f3f4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 25, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["Marbasius"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}