{"id": 61798, "slug": "pingpong-kings-vr", "name": "PingPong Kings VR", "name_original": "PingPong Kings VR", "description": "<strong>EARLY ACCESS TITLE: Expect glitches, and new content soon!</strong><br/>PingPong Kings VR is aimed at realistic Table Tennis games using virtual reality systems. <br/>If you want to enjoy racket sports through VR, PingPong kings VR will be a choice without regret!<br/><strong>Features</strong><br/>- Simple UI and easy control to play<br/>- Advanced AI divided by 5 difficulty levels<br/>- Variety of rackets from standard to funny style<br/>- Applied the basic rules of Table Tennis <br/>- Optimized with combination of vive racket sports set and tracker<br/><br/>Realistic physics, immersive sound, and fluid animation make you feel like you’re really in the PingPong court.<br/>With physics designed to be as real as ever achieved in a PingPong simulator, you will forget you are in VR environment.<br/><strong>How to Play</strong><br/><br/>Table tennis, also known as ping pong, is a sport in which two or four players hit a lightweight ball back and forth across a table using small bats. The game takes place on a hard table divided by a net. Except for the initial serve, the rules are generally as follows: players must allow a ball played toward them to bounce one time on their side of the table, and must return it so that it bounces on the opposite side at least once. A point is scored when a player fails to return the ball within the rules. Play is fast and demands quick reactions. Spinning the ball alters its trajectory and limits an opponent's options, giving the hitter a great advantage.<br/><br/><strong>Notes for Tracker Users</strong><br/><br/>If you are a user using Tracker, pay attention to this article.<br/><br/>The basic settings in PingPong Kings VR are two controllers, the left controller means a ball for a serve, and the right controller means a racket.<br/><br/>If you want to use the tracker that is attached to the racket, turn off one of the controllers and then connect the tracker. After that, the tracker automatically means right racket.<br/><br/>", "metacritic": null, "released": "2018-03-15", "tba": false, "updated": "2019-08-28T21:57:53", "background_image": "https://media.rawg.io/media/screenshots/1c5/1c57e72e6f27f92cd577566c65ffaf63.jpg", "website": "http://www.appnori.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 192, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Appnori"], "genres": ["Simulation", "Sports", "Casual", "Indie"], "publishers": ["Appnori"], "esrb_rating": null}