{"id": 617967, "slug": "rhythmic-time-strategy", "name": "Rhythmic Time Strategy", "name_original": "Rhythmic Time Strategy", "description": "<p>Rhythmic Time Strategy is a rhythm based RTS in which you are in charge of a robot uprising! Control your minion robots, that consist of <strong> miners</strong>, <strong>pylon units</strong> and <strong>fighter bots</strong> to fight off enemy humans! All of  this goes in sync with an awesome and catchy upbeat track, making  decisions fun while being displayed and heard in perfect fashion with  the sound of incredible music. This game was made for the GDC GMTK Jam  2021 in under 48 hours.\r\n  </p>\n<p><strong>HOW TO PLAY:</strong></p>\n\n<p><strong>~Use WASD to move Camera</strong>\n</p>\n<p><strong>Miners</strong>: These are  your main resource in progressing through the game. Use your miners to  mine crystal resources, which are displayed in the top left, these are  used to create more miners, pylon units, and fighter bots!  \r\n    </p>\n<p><strong>Pylons</strong>: These allow you to progress forward and travel with your miner and fighter  bots, you can also chain multiple pylon units together for maximum  range, be sure to not make too many or you'll run out of resources!\r\n    </p>\n<p><strong>Fighter bots</strong>: These fight off enemy humans! Some will kill  multiple humans while others may die instantly upon impact, be sure to  plan strategically of where you place these units, as you have a limited  resource.\r\n    </p>\n<p>Left click on your pylon units to move them, when you left click on  your miner units, you can have them mine with the mine command. These  miners will mine anything within proximity, which you can see by  hovering over them with your mouse. You will need to move your pylon  units so your miners can have access to the crystal resources, and  construct pylon chains to move these units forward.\r\n    </p>\n<p>When you left click on a tile, you can create fighter bots, miners,  or more pylon units. You will need a pylon unit within range to make  fighter bots or miners as these need to be connected to your main hub.\r\n    </p>\n<p><em><strong>Game Design/Programming:</strong></em> Ben, Mark, Tùng\r\n    </p>\n<p><em><strong>Main Tile and Unit Assets:</strong></em> Ben\r\n    </p>\n<p><em><strong>Music and Sound Effects:</strong></em> Alex\r\n    </p>\n<p><em><strong>Additional assets, design and animations:</strong> </em>Nik\r\n    </p>\n<p>\n</p>", "metacritic": null, "released": "2021-06-13", "tba": false, "updated": "2021-06-14T08:44:41", "background_image": "https://media.rawg.io/media/screenshots/6ef/6efb07f64c654f6f6afed4f629b8d13c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 71, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["botmark", "Bobo_Baqa", "SADragonMaker", "nashdashin"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}