{"id": 617957, "slug": "outpost-tower", "name": "Outpost Tower", "name_original": "Outpost Tower", "description": "<p>In the wake of a catastrophe, all communications are down. Outpost Tower stands as the only link between the people of this battered region, the only way they might be saved.</p>\n<p>Part puzzle, part strategy, you must incrementally rebuild a communication network across this region. Connect medical and supply posts with the civilians who will perish without their aid. Quickly and carefully plot and reconfigure the pieces on the map to ensure everyone survives to the end.</p>\n<p>Your Goal: completely reconnect all the map's nodes on one active network... before anybody dies!</p>\n\n<p>Created for the GMTK 2021 Game Jam with the theme: \"Joined Together\"</p>\n<p>The mechanic of joining the nodes in this game is everything. You can only direct assistance to civilians if they are on your network at the same time as the places providing aid, and even if you have connected with a civilian in past, once you disconnect, your only record of them is their status the last time you were linked. In order to reach the edges of the map before the fringe inhabitants run out of supplies, you must constantly expand and double back.</p>\n<p>Dev Note: There may have been an error with flagging the win condition in the final jam build. If you manage to connect all the nodes together without any casualties, you've won, whether you receive a final title card saying so or not. Congrats!</p>\n<p>Controls:</p>\n<p>Pan Camera with WASD or directional arrows</p>\n<p>Zoom Camera Out/In with Q &amp; E</p>\n<p>Point and click to select nodes and make/break connections</p>\n\n<p>Solo Project, so design, code, art, etc by me</p>\n\n<p>Music:</p>\n<p>Art of silence by uniq</p>\n<p>https://soundcloud.com/uniqofficial</p>\n<p>Attribution 4.0 International (CC BY 4.0)</p>\n<p>https://creativecommons.org/licenses/by/4.0</p>\n<p>Music promoted by https://www.chosic.com </p>\n\n<p>SFX:</p>\n<p>http://www.littlerobotsoundfactory.com/</p>\n<p>https://paularthurmusic.com/<br/></p>\n\n<p>Icons: Freepik, Pixel Perfect, mavadee</p>", "metacritic": null, "released": "2021-06-13", "tba": false, "updated": "2021-06-14T08:42:18", "background_image": "https://media.rawg.io/media/screenshots/41d/41d256c6820abe2bd0b1c413e0d18f3e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 59, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["ArkfulDodger"], "genres": ["Strategy", "Puzzle"], "publishers": [], "esrb_rating": null}