{"id": 618012, "slug": "xkskino", "name": "XΞKINO", "name_original": "XΞKINO", "description": "<p>Joined Together - GMTK Jam 2021 - Xekino</p>\n<p><strong>This was originally for the GMTK Jam, however, the build of that version didn't work at all. Unfortunately, it was after the grace period. I've removed the submission of the jam, so this build works now. :(</strong><br/></p>\r\nXΞKINO /zeh-ki-no/\r\n<p>a local multiplayer game in which you are joined together by a tether (or something like that) which has the ability to destroy enemies!</p>\r\nStory\r\n<p>In the distant future, the company XΞKONYX uses it's abundant wealth to build a new city: XΞKINO. At first, everyone's excited; it seems great, enough space, clean air, beautiful horizons. What's not to like?</p>\n<p>XΞKONYX wasn't pleased, however. They weren't gaining enough profit off this. Sure, there was marketing everywhere. But it just didn't sit right with the company's mindset. To solve this, they released drones all around the city, in order to spy on the civilians... maybe that could leave them a fat-stack of cash on the side.</p>\n<p>You've been tasked to defeat the drones in XΞKINO. Using your tether, fight against the drones and rid the city of this evil!</p>\r\nCredits\r\n<p>Programming - Primed Pixel / Malachy Moran-Tun<br/></p>\n<p>Music - Primed Pixel / Malachy Moran-Tun</p>\n<p>SFX - Kenney https://kenney.nl</p>\n<p>Art - ansimuz https://ansimuz.itch.io/warped-city</p>\r\nGMTK Jam 2021 Stuff\r\n<p>All code was programmed during the jam. The first music track was fully composed and mixed during the jam, whereas the second was not.</p>\n<p>This game is local multiplayer, meaning it requires two players at the same computer. However, it is possible to use GMTogether to play online! This is <strong>not</strong> necessary for the game to function. Luckily, it is free (unless you want the Steam version, which rids the need of port forwarding)</p>\n<p>https://yellowafterlife.itch.io/gmtogether</p>", "metacritic": null, "released": "2021-06-13", "tba": false, "updated": "2021-06-14T08:57:03", "background_image": "https://media.rawg.io/media/screenshots/b4b/b4b76fdd61cd2bd7e9f1f8a3af78fe7e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 99, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Primed Pixel"], "genres": ["Action", "Platformer"], "publishers": [], "esrb_rating": null}