{"id": 618071, "slug": "love-is-in-the-arrow", "name": "Love is in the Arrow", "name_original": "Love is in the Arrow", "description": "<p>On a beautiful sunny day, several lonely souls are walking on the bridge of lovers. They cross each other, without paying attention. What a shame ... Fortunately, you are here to help.\r\n</p>\n<p>Use your bow to shoot arrows at passers-by and form bonds between them. Be careful, however, to involve passers-by who have the same fashion tastes!\r\n</p>\n<p>Form groups of any size you want: the main thing is that everyone has at least one element of clothing in common. When you are sure of the links you have established, validate your shoot and watch all these souls fall in love.\r\n</p>\n<p>Be careful not to put together those who might not get along: you risk losing your hard-earned love points.\r\n</p>\n<p>Groups with the most clothing items in common earn you more points! The color doesn't matter, so don't let that fool you.\r\n</p>\n<p>Your love gauge decreases over time, but forming happy groups forever allows you to refill it. On the other hand, making bad matches also diminishes it.\r\n</p>\n<p>Use your arrows wisely and don't just empty your quiver.\r\n</p>\n<p>Try to get the highest score possible.\r\n</p>\n\r\nCONTROLS:\r\n<p> Use ZQSD/WASD to move around <br/></p>\n<p>Use Space to ascend and Shift to descend <br/></p>\n<p>Use your mouse to aim for a target, and hit left-click to shoot an arrow. <br/></p>\n<p>Use right-click to validate one series of shots. <br/></p>\n<p>Use C or click wheel to cancel one series of shots.</p>CREDITS:\r\n<ul><li>Elodie Bouziat</li><li>Kévin Bassard </li><li>Pierrick Pamart</li><li>Guillaume Paris</li><li>Pierre-Marie Plans</li></ul>", "metacritic": null, "released": "2021-06-13", "tba": false, "updated": "2021-06-14T09:13:34", "background_image": "https://media.rawg.io/media/screenshots/64a/64a3b80b5fc0a784af3197bf2326326b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 89, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["QueenDae", "Kwakwaouaite", "Hiilton"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}