{"id": 618195, "slug": "sim-stem", "name": "SiM-STEM", "name_original": "SiM-STEM", "description": "<p>Try to keep planets from crashing, you must place planets and set their velocities in order to complete level objectives.</p>\n<p>You either have to hit all the checkpoints and reach the goal, or survive a set amount of time without planets colliding in order to beat the levels.</p>\n<p>There are 15 levels as well as a sandbox mode with a few fun presets that we thought were cool.</p>\n<p>NOTE: This was made and tested on windows, we built to mac too, but have no idea if it works (sorry!)<br/><br/></p>\n<p>Tutorial:<br/></p>\r\nCheckpoint<br/>These stars are checkpoints, hit all of them before you hit the goal (some require multiple planets to hit it before it will complete)<br/><br/>Goal<br/>These are the goals, some require multiple bodies to hit it, and it must be reached after each checkpoint.<br/><br/>Planet<br/>Yellow bodies are fixed and cannot be moved, though some have an initial velocity so watch out!<br/><br/>Dock<br/>This is the planet dock, click on the planet icon to grab it and place it in the scene, then move your mouse around and click again to set its velocity (denoted by a blue arrow).<br/>Move a planet again by clicking on it, and put it in the trash can to the left of the dock to erase it (it will go back in the dock on actual levels).<br/><br/>Bar<br/>This is the simulation bar at the top of the screen. The first button on the left will turn on/off grid placement. The second button will restart a simulation once it has been played. The middle button will start the simulation (grayed out until all required bodies have been placed in a level). The trash can will clear the simulation and reset the level (use this if any big bugs appear!). And the final x will open a prompt to go back to the main menu.<br/><br/>\n<p>Enjoy!\r\n</p>\n<p>\r\n(Hint: zoom out on the Solar System sandbox preset)\r\n</p>", "metacritic": null, "released": "2021-06-13", "tba": false, "updated": "2021-06-14T09:42:17", "background_image": "https://media.rawg.io/media/screenshots/8eb/8ebf6ba0482641b4bb0bba062f827b49.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 49, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "macOS"], "developers": ["TheShoes"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}