{"id": 618184, "slug": "flower-dance-with-butterfly", "name": "Flower Dance with Butterfly", "name_original": "Flower Dance with Butterfly", "description": "<p>It is the work created for GMTK Game Jam 2021.</p>\n<p>In this game, the player will use the wind to control a flower that can guide the butterfly to the destination. The flower and the butterfly are the two elements that are joined together by the scent.</p>\n<p>Here is a short introduction about the story and mechanics:</p>\n<p>On a lovely day, a gust of wind takes a beautiful flower which is the favorite thing of a little butterfly. The cute creature chases his treasure for a long distance. When he gets his flower back, he has got lost. Now, as the master of controlling the wind, you will help the poor butterfly back home by controlling the movement of flowers by the wind.</p>\n<ul><li><strong>Click the left button on the mouse to create a wind to control the nearby flower.</strong> The direction of the wind is from the position of the mouse to the position of the flower.\r\n  </li><li><strong>Press Space to left the smell of the flower. </strong>Sometimes the little flower may be attracted by wildflowers and leave his flower for a while. When he cannot see his flower, he will track the smell of it which is in his sight.\r\n  </li><li>If the <strong>butterfly cannot see his flower or its smell for 2 seconds,</strong> he will be lost and the mission fails.\r\n  </li><li>The flower is a precious and pure life and it cannot be dirty. <strong>If the flower touched the ground, the mission fails.</strong></li><li><strong>The butterfly cannot touch the green fog. The flower cannot touch the blue fog.</strong>\n</li></ul>\n<p><strong>Staff:</strong></p>\n<p>Design: Peiyu Ling</p>\n<p>Programming: Peiyu Ling</p>\n<p>Art: Yunshan Huang</p>\n<p>Music: Yang Li</p>", "metacritic": null, "released": "2021-06-13", "tba": false, "updated": "2021-06-14T09:40:06", "background_image": "https://media.rawg.io/media/screenshots/649/649e5ee008bead66e6831c9886c867ae.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 83, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ling Peiyu"], "genres": ["Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}