{"id": 61838, "slug": "throw-anything", "name": "Throw Anything", "name_original": "Throw Anything", "description": "There is nowhere to run... and nowhere to hide as zombies climb up the walls hoping to satisfy their appetite for brains. The only way to survive: reload your guns, destroy all furniture in the room, grab them all, and throw anything you can find to take them down.. and we mean ANYTHING.<br/>Face off against starving zombies in high-rise buildings across the globe in the VR action defense game, <strong>Throw Anything</strong>!<br/><br/><br/><br/>ㆍ\tEnjoy laying waste to fully destructible environments!<br/><br/>ㆍ\tThrow any object within reach – humans included!<br/><br/>ㆍ\tTake on 6 challenging stages about to be overrun by the zombie horde!<br/><br/>ㆍ\tDefeat 5 mid bosses and 6 powerful “main” bosses!<br/><br/>ㆍ\tCollect ancient relics to save the world!<br/><br/>ㆍ\tDefeat zombies and get powerful weapons as rewards!<br/><br/>ㆍ\tTest your limits at various difficulty levels!<br/><br/><br/>The mysterious “Scientist X” has decided to play God – conducting secret, forbidden experiments in secluded laboratories throughout the world.. To conquer whole world by spreading zombie virus using ubiquitous cube..<br/><br/>However, five scientist who oppose X's terrible plan divide ubiquitous cube into 5 pieces and hid throughout the world and enraged mystery Scientist X invades the world using zombies to find cube!<br/><br/>The world is quickly being overrun by these undead abominations – turning everyday peace into a never ending cycle of pain and suffering. <br/><br/>Get secret missions from Secret Delivery Agency (SDA) and collect cubes to save the world from zombie horde!<br/><br/>", "metacritic": null, "released": "2018-07-26", "tba": false, "updated": "2020-02-07T01:57:27", "background_image": "https://media.rawg.io/media/screenshots/dcb/dcbc6191bb2c92114b60ef2c58d6aef9.jpg", "website": "http://www.vltgame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 6, "beaten": 1}, "playtime": 3, "achievements_count": 44, "ratings_count": 1, "suggestions_count": 369, "game_series_count": 0, "reviews_count": 1, "platforms": ["PlayStation 4", "PC"], "developers": ["Visual light"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["Visual light"], "esrb_rating": null}