{"id": 618320, "slug": "the-battle-of-everpizza", "name": "The Battle of Everpizza", "name_original": "The Battle of Everpizza", "description": "<p>Battle of the Everpizza - A top-down bullet hell made for GMTK Game Jam 2021.<br/><br/></p>\n<p>How does my game fit the theme?</p>\n<p>- The game's main mechanic is to manipulate the Stars, get them to join together to create interesting scenarios.</p>\n<p>Control: <br/>- WSAD to move<br/>- Left Mouse to shoot<br/>- R to Reload<br/>- Q and E to rotate  the Stars<br/>- 1, 2 and 3 to change weapons<br/><br/></p>\n<p>Rules:<br/>- Survive against waves of enemy<br/>- Protect the red dude in the middle of the pizza<br/>- You have 3 unique guns, which will be useful in certain circumstances<br/>- You can rotate the Static Stars by pressing Q or E<br/>- The playground is divided into 3 sections. There are 2 sections that have a Star attached. These are called Static Stars.<br/>- There is 1 Star that moves around the pizza. It is called Moving Star</p>\n<p>- You can not move or change the orbit of the Moving Star<br/>- When Moving Star joins other Star's section, things get interesting: Your gun becomes MORE POWERFUL and shoot FASTER. But guest what? The enemies are also get spawned MUCH QUICKER and SHOOT A LOT FASTER.<br/></p>\n<p>- If a section has no Star around, it behavior also changes: Enemies take more time to spawned. But you have to be careful, your guns become much weaker here. <br/>- Manipulate the Stars and deploy your best strategy to win the game. Chaotic or easy cake? It's your choice.</p>", "metacritic": null, "released": "2021-06-13", "tba": false, "updated": "2021-06-14T10:15:29", "background_image": "https://media.rawg.io/media/screenshots/e00/e00ac7f4d9aaf2663fec609e3d672f47.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["khiemnguyenba181"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}