{"id": 61840, "slug": "when-they-arrived", "name": "When They Arrived", "name_original": "When They Arrived", "description": "<strong>The protagonist went hunting in his grandfather's country house. There was an invasion of the aliens. Cities are destroyed. You need to use survival skills and ingenuity to survive and save the planet. Build, explode, explore the world, develop your skills, try all ways to stop the invasion of the aliens.</strong><br/><br/><strong>\"What would I do after the alien invasion?\"  <br/>It's a question you've probably asked yourself, and it's a question we want to help you answer!  </strong><br/><br/><strong>Key features:</strong><br/><ul><li> you are completely free in action and a huge world to research ;<br/></li><li> build, blow up and defend from enemies;  <br/></li><li> mine ores, use it to create various useful objects ;  <br/></li><li> hunt wild boars and deer, as they can become an excellent sources of food, but beware of bears and wolves ;  <br/></li><li> construct various structures, including traps ;  <br/></li><li> look for provisions, drive on an old ATV among a bunch of enemies;<br/></li><li> study the legend of the 'Witnesses of the second coming ', perhaps there you will find some answers;  <br/></li><li> increase your combat skills and not only (for this there is a especial panel of cards);  <br/></li><li> survive by fighting with an enemy unknown to you, try to have an influence on the invasion and much more;<br/></li><li> collect the parts and find the blueprints to create a \"mini - mole hole\";<br/></li><li> repair the spacesuit, collect all the equipment you need, and go to Mars to destroy the bridgehead of the aliens.</li></ul>Mars in When They Arrived<br/><strong>Mars location has not yet been added to the game, but the team is in progress of its deep development. In the further updates, we'll polish and add it.<br/>Now we are working on implementation of the most realistic conditions and the gameplay on Mars so you can completely immerse yourself in the atmosphere of the game and the red planet!</strong><br/><br/>", "metacritic": null, "released": "2018-06-05", "tba": false, "updated": "2019-08-28T21:57:52", "background_image": "https://media.rawg.io/media/screenshots/4af/4afde023f83b13a2b33e83981e1b79fc.jpg", "website": "https://www.facebook.com/When-They-Arrived-1974012882927202/", "rating": 0.0, "rating_top": 1, "added_by_status": {"yet": 2, "owned": 43, "beaten": 1, "dropped": 2}, "playtime": 1, "achievements_count": 0, "ratings_count": 5, "suggestions_count": 430, "game_series_count": 0, "reviews_count": 5, "platforms": ["PC"], "developers": ["Second Reality"], "genres": ["Action", "Adventure", "Simulation", "Indie"], "publishers": ["Second Reality"], "esrb_rating": null}