{"id": 618597, "slug": "marriage-mages", "name": "Marriage Mages", "name_original": "Marriage Mages", "description": "<p>A Two Player Scrolling Shooter with an... interesting control scheme.</p>\n<p>Player One, the black mage, uses the 'A' and 'D' keys to strafe, while using the arrow keys to control their crosshair.  Spacebar fires a projectile towards their crosshair, and holding shift slows movement of both.</p>\n<p>Player Two, the white mage, uses the mouse to aim their crosshair.  Holding the right mouse button strafes in the direction of the crosshair, while holding the middle mouse button strafes slowly.  Left clicking fires a projectile towards their crosshair.</p>\n<p>This control scheme makes it difficult for player one to fire effectively, and for player two to move effectively.  However, the two players can join forces and eliminate their weaknesses.  By tapping or double clicking the 'careful movement' key while near their partner, the two mages will link together.  The black mage takes over for both player's movement, while her wife focuses on firing at enemies.  They even split damage taken! </p>\n<p> Either player can un-link from her partner by tapping or double clicking their careful movement key again.</p>\n\n<p>As this product is a prototype, several systems are unfinished.  Hopefully I've eliminated all the bugs, but nothing is balanced, and there isn't even a game over or scoring system yet.  Hopefully you enjoy your time with it anyways!</p>", "metacritic": null, "released": "2021-06-13", "tba": false, "updated": "2021-06-14T11:19:56", "background_image": "https://media.rawg.io/media/screenshots/31f/31f22dbe347ebf96ca373f09874880cc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Sienna Blossom"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}