{"id": 618532, "slug": "covradio", "name": "COVRADIO", "name_original": "COVRADIO", "description": "- All good. It's time to go online, P.<br/>- Oh great, we made it! Thanks to your help.   We are just kinda out of maintenance these days.   Anyway, I'll go green.\r\n- Good evening, ladies and gentlemen, and those nonbinary people and non-people!   This is P, your beloved DJ for the COVRADIO tonight.   We shall answer the first hotline after a pleasing music...\r\n- Hello? This is COVRADIO, your nightkeeper.<br/>- ...<br/>- Are you still there? Can you hear me?<br/>- Oh, sure, thank God! Can we hold on a bit longer?   Please... I haven't been talking to someone for so long...\r\n\n<p>During the pandemic era, people have been taken apart. Love ones separated; close friend hospitalized; parties no long held... but still, we have COVRADIOconnected us together.</p>\n<p>Feel lonely and just want to talk? Just call the COVRADIO.</p>\n<p>Feel anxious and don't know what to do? Just call the COVRADIO.</p>\n<ul><li>You, as the radio DJ, will have to decide what to broadcast.It can be either some tranquil music, some exotic ads, or calls from your loyal audience.</li><li>You need to keep an eye on the audience. If you lose them, you lose the game. </li><li>You should also take care of the budget. We don't do charity at the broadcasting company.</li><li>Music can draw some audience, whilst ads will make the audience leave. And calls? They are just myth depending on your response. People react to your answers as you react to theirs. That is how the myth is called.</li></ul>\n<p>But anyway, do remember, take good care of yourself in the pandemic: wear a mask, wash your hands, and keep social distancing!</p><p>Controls:</p><ul><li>Mouse</li></ul><p>Made by: Lynn Wang &amp; Jarry Shaw</p>", "metacritic": null, "released": "2021-06-13", "tba": false, "updated": "2021-06-14T11:04:35", "background_image": "https://media.rawg.io/media/screenshots/731/731885e7a9cfc34d789d56b00e90f5eb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 22, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["somecat1996"], "genres": [], "publishers": [], "esrb_rating": null}