{"id": 618602, "slug": "kea-bound", "name": "KeA BounD", "name_original": "KeA BounD", "description": "<p>KeA BounD is my submission to the GMTK 2021 48 hour Game Jam!</p><p>*If the game runs in chrome at a really low framerate, try using a different browser. Chrome just really doesn't like my game for some reason, but Mozilla and Edge are fine!</p>\n<p>The game only has two buttons: A and D. But when you have four different actions, how are you supposed to use them when you only have two buttons? Simple! Just bind multiple actions to the same key!</p>\n<p>Every level will require you to rebind your keys in a different way in order to complete it. Some actions even have special interactions depending on what other actions they are bound to...</p>\n\n<p>The Jam's theme, \"Joined Together,\" had me thinking a lot about how things change when they are connected. Particularly, I wanted a game that experimented with not only combining multiple things, but also explored how things changed when you separated them. And thus, KeA BounD was made!</p>\n\n<p>If I move forward with this game, on top of stuff like menus and QoL changes, I also have ideas about how to further this mechanic. Future levels may have multiples of the same actions, like having 2 jumps or 3 rights, and binding multiple actions to the same key would cause them to stack multiplicatively! Future levels may also have checkpoints halfway through them that allow you to rebind your keys midway through the level, which exponentially opens up future puzzle possibilities.</p>", "metacritic": null, "released": "2021-06-13", "tba": false, "updated": "2021-06-14T11:20:52", "background_image": "https://media.rawg.io/media/screenshots/03f/03f61f90b6cf03bac88ee56aef12e349.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 43, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Garrett Dockins"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}