{"id": 618600, "slug": "solitary-accompanied", "name": "Solitary Accompanied", "name_original": "Solitary Accompanied", "description": "<p><strong>Solitary Accompanied<br/></strong></p>\n<p>Couple gets separated and lost in the desert after their anniversary sightseeing flight ends abruptly due to the plane malfunction.</p>\n<p>Can they find each other again or will they perish in the desert? That is up to you!</p>\n\n<p><strong>How to play?</strong></p>\n<p><em>Flying level</em></p>\n<p>Your plane is malfunctioning and tends to lose control unexpectedly. Every time the plane starts to steer up or down, press the same key or arrow key that is displayed. Try to keep plane’s angle correct.</p>\n<p>The plane will not survive an angle that is too steep, so try your hardest to keep it flying in the straight line!</p>\n<p><em>Desert level</em><br/></p>\n<p>You are lost in the desert - your goal is to find your significant other. The game is tracking following properties:</p>\n<ul><li>Thirst - you can deal with thirst by eating or drinking from the oasis.</li><li>Battery Level - if you call your significant other to encourage them to keep going, the battery will be drained a little.</li><li>Sanity - sanity is gained back by eating, standing in the shadow under the trees or by being encouraged by the other partner.</li></ul>\n<p>If your sanity goes too low, you will go into lethargic state and your character will not be able to move. If you get into this state, switch to the other partner with Tab and press E to encourage them. Lethargic partner is doomed to the death by thirst, so make sure it is always filled at least a little!</p>\n<p>There are two sources of food - prickley pear and dates. In order to pick them up, you have to walk to the opuntia cactuses or date tree and press Space. Sometimes you need to give it few pushes before the fruit is retrieved. Every plant can give you 3 fruits. Once retrieved, go to it and eat it by pressing Space.</p>\n<p><strong>Known issues:</strong></p>\n<ul><li>Level bars are not displaying 0 correctly, they always overflow a little - no time to fix this.</li><li>The cactus fruit sometimes disappears.</li><li>No music and only few sounds - no time left for making music and sounds, so feel free to play some your music.</li></ul>", "metacritic": null, "released": "2021-06-13", "tba": false, "updated": "2021-06-14T11:20:24", "background_image": "https://media.rawg.io/media/screenshots/2e9/2e9dc8516ecf0a6d28822894ddd8a8ce.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 8, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["dzejpi"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}