{"id": 618799, "slug": "corebound", "name": "COREbound", "name_original": "COREbound", "description": "<p>INTRODUCTION:</p>\n<p>&gt;Welcome to COREbound! This is a rudimentary \"mining platformer\" made for the GMTK Game Jam of 2021. You play as an astronaut accompanying The Source to a fresh planet, it's your job to connect The Source to the planet's core with the use of repeaters The Source provides you with. However, repeaters require both stone and ore held within the planet in order to be made, so you must go and harvest these resources. Always remember that The Source is your source of life, stray too far for too long, and you won't make it back alive.</p>\n<p>CONTROLS:</p>\n<p>&gt; WASD / Arrow keys: movement</p>\n<p>&gt; space / x: jump</p>\n<p>&gt; left shift: open oxygen &amp; fuel</p>\n<p>&gt; e: craft repeater</p>\n<p>&gt; f / z: place repeater</p>\n<p>&gt; enter / return: start game</p>\n<p>THEME:</p>\n<p>&gt;The theme of the jam was \"Joined Together\".  COREbound utilizes this theme in the connection between The Source and the player. The Source and the player are joined together through more of a symbiotic relationship as opposed to a physical one. The player needs The Source in order to survive, but The Source needs the player in order to access the planet's core. This was the main idea behind the development of the game's mechanics. If the thematic reasoning sounds like a stretch, that's because it is. I really didn't want to fall into the pretty obvious trap of making a game where two characters are tethered through some form of rope, so i somehow went in like the complete opposite direction and i think it still works as a more abstract interpretation of the theme.</p><p>AUTHOR'S NOTES:</p><p>&gt;At least on my end the web version of the game doesn't seem to be working. probably come combination of my stupidity and unity not liking me, but sorry if you are forced to download the game in order to play it.</p><p>&gt;The glaring issue. I'll be the first to say it, the player sprite looks reasonably like the among us characters. I came to the realization after drawing it, and after messing around in a pixel editor for like an hour came to the conclusion that it's the only real way to draw a stock cartoonish astronaut. Of course to top it off, using the original plan of black blended into the background too much, white just looks bad, and I couldn't find an aesthetically pleasing way to put an outline on the character, so of course I had to go with red.</p><p>&gt;This game isn't really in a finished state. The original plans didn't even have a tile breaking system, instead having randomly generated caves that one could explore to find ores and stuff with player upgrades (y'know, actually compelling gameplay). Instead I scraped those ideas in favour of time, and luckily I did so or I wouldn't have a finished project here. I don't really expect this to go anywhere, I just wanted to have something at least somewhat compelling and functional as this is my first game jam, it's like a rite of passage, even if it ain't too pretty.</p>", "metacritic": null, "released": "2021-06-13", "tba": false, "updated": "2021-06-14T12:07:18", "background_image": "https://media.rawg.io/media/screenshots/950/950c4347061a4b992ef2b5781685a178.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 3, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["UltimateGaming"], "genres": [], "publishers": [], "esrb_rating": null}