{"id": 618900, "slug": "never-alone-itch-narcisorosario-ruhan-kael-angeli", "name": "Never Alone (itch) (NarcisoRosario, Ruhan, Kael Angeli)", "name_original": "Never Alone (itch) (NarcisoRosario, Ruhan, Kael Angeli)", "description": "<p><strong>Resume</strong><br/></p>\n<p> An adventure through the cursed forest of Venth is what sisters Marin and Dara wanted the least, but fate has led them to this point. With every step they take, sword and magic seem not to be the only thing they need to use to escape this place.</p>\n\n<p><strong>How to Play</strong><br/></p>\n<p>At the top of the window, you'll find a link between Dara and Marins, her sister. Every dialogue choice on the game will affect the link between them.</p>\n<p>The weaker the link is, the weaker is the <strong>Light</strong> from each character, and the lower is their <strong>Health Points</strong>.</p>\n<p>Make good dialogue choices in order to keep a good relationship between the sisters...otherwise, perish to the forest's doom.</p>\n<p>If any of the sisters die, it's game over.</p>\n\n<p><strong>Controls</strong><br/></p>\n<p>WASD - Movement</p>\n<p>LMB - Cast Fireball</p>\n\n<p><strong>Dara</strong> </p>\n<p>Dara is an expert combat magician, when her parents realized her affinity with magic she was soon enrolled in a renowned school of magic and witchcraft, if she had dedicated herself more maybe she would not have been in the situation in which she finds herself, but Dara was pretty lazy though talented. The world grew scarier after leaving school and real life embraced him like a nightmare. On her journey back to her parents' house, the mage ended up meeting her older sister, Marin. </p>\n\n<p><strong>Marin</strong> </p>\n<p>Marin is Dara's older sister, and despite not having many memories together, she decided to go in search of her sister. Things at home got a little complicated and both are needed there. If Marin hadn't found her sister, things could have been better, however she is a good tracker among the green warriors, Dara has been found and is not in the best of situations. What he had left of options was to face the dangers and secure a way back, together with his sister.</p>", "metacritic": null, "released": "2021-06-13", "tba": false, "updated": "2021-06-14T12:29:45", "background_image": "https://media.rawg.io/media/screenshots/48d/48d820fcac0c2538c76aae57cd673815.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 117, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ruhan", "NarcisoRosario", "Kael Angeli"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}