{"id": 61937, "slug": "alter-cosmos", "name": "Alter Cosmos", "name_original": "Alter Cosmos", "description": "Experience comic book style adventure with Aliencat in a world taken over by a global totalitarian system. Find a way through dangerous situations, gather your crew, find and prepare a ship and escape into cosmos – an infinitive space where everything is possible. Unlock the secrets of The Waves of Distortions.MAIN FEATURES<br/>    • interactive comic book game<br/>    • point and click adveture, science-fiction, horror, black humor<br/>    • oryginal 2d ilustrations, concept and script - by Zimzonowicz<br/>    • original music, futuristic posthardcore/rockabilly/surff/punk/funk created by talented multiinstrumentalist Przemysław Bielecki and Damian ZwolińskiBEHOLD THE ALIENCAT!...mutated, dangerous, predator. Experimental hybrid of cat, human and genes of extraterrestrial race No. AX-221/Nostromo. An every day lazy glutton fond of beer and regenerative naps in peace and quiet...STORY IN SHORT &amp; GAMEPLAY<br/>ONE OF THE MANY THEORIES CLAIMS THAT ONCE IN A FEW BILLION YEARS AN UNCANNY RADIATION EMERGES. IT'S SOURCE REMAINS UNKNOWN. SOME BELIEVE THIS OCCURRENCE MARKS AN END TO THEIR LABORIOUSLY CREATED CIVILIZATION. AN END TO THEIR DOMINATION. OTHERS TAKE IT FOR AN INVIGORATING IMPULSE OF UNKNOWN POWERS, A POSSIBILITY FOR ANOTHER STEP OF COSMIC EVOLUTION TO TAKE PLACE.<br/>OF COURSE. THAT'S JUST A THEORY...<br/><br/>    • Interactive adventure in a comic book style. <br/>    • Original visual design.<br/>    • Point-and-click to use objects.<br/>    • Collect and apply varied items.<br/>    • Hand-to-hand or ranged combat.<br/>    • Character dialogue interaction.<br/>    • Genre: Adventure. Platform: PCINSPRATIONS<br/>Films: Alien, Mad Max, The Walking Dead, Star Wars. Comic characters: Lobo, Batman, Aliens, Wolverine. Games: Machinarium.ABOUT GRAPHICS AUTHOR<br/>ZIMZONOWICZ [real name: Łukasz Samsonowicz]<br/>Born in 1983 in Lubsko in Poland, obtained Masters in Fine Art in 2007. Comic artist, illustrator, painter and graphic designer. I find inspiration in every day life. I like horror and science fiction movies, comics, music hardcore punk and rock'n'roll.ABOUT PYRAMID.GAMES<br/>We are game development studio located in Lublin, Poland, City of Inspiration :) We create cutting-edge games for PC, mobile and web. Our team is a mix of developers, artists, designers and gamedev passionates. We love creating games we want to play.GAME OVER IS JUST THE BEGINNING...<br/>There is a comic book adaptation in the works which expands the Alter Cosmos world with new plots, characters and locations. This project is a beginning of a new adventure. And with your support we can make that happen!", "metacritic": null, "released": "2018-07-10", "tba": false, "updated": "2023-07-29T11:48:53", "background_image": "https://media.rawg.io/media/screenshots/1b3/1b336d01d2eecb25d76f2881036ceb5e.jpg", "website": "http://pyramid.games/#game-altercosmos", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 31, "beaten": 1, "toplay": 1}, "playtime": 0, "achievements_count": 7, "ratings_count": 1, "suggestions_count": 340, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Pyramid Games"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Pyramid Games"], "esrb_rating": null}