{"id": 61946, "slug": "infinite-world-generate-any-terrain", "name": "Infinite World: Generate Any Terrain", "name_original": "Infinite World: Generate Any Terrain", "description": "Infinite World  is a game aimed at freedom<br/><br/>Like Minecraft,the map is procedural random generated. but the unit of Minecraft  is cube,Infinity World is voxel<br/>so it is far more realistic than Minecraft, and every player will has a unique experience. and no border and limits for you create on the map<br/><br/>the fight system has lots of weapons to choose,and the battle system is super smooth, because Most  NPCs use receiving attack force to react to a player's attack(Real-time Physics Simulation)<br/><br/>you will not get tired of the map,because <strong>the scene use algorithm to generate all kinds of terrain like forest,grassland.hill,desert,lake.sea and so on</strong>,<strong>Nearly tens of billions of maps</strong><br/><br/>The game has modes:<br/>1.Infinite Killing Mode(new)<br/>2.Relax mode<br/>3.Survival mode<br/>4.God mode<br/>5.Dig mode<br/><br/>in infinite killing mode ,you can Kill zombies and robots without limits,Free to choose any weapon<br/><br/>in relax mode ,You can relax by listening to <strong>procedurally generated music</strong>(artificial intelligence[AI] music ,It's always different when you enter the game. <strong>It doesn't repeat for 24 hours</strong>)，or run on the <strong>endless map</strong>. The mode has no tasks. no aim, just relax yourself。If you want to relax after work, it is the best mode<br/><br/>in survival mode, just like Minecraft or other survival game,but the map can generate huge robot at night ,and you can build robot army, its the different<br/><br/>in god mode, you can take a nice picture if you find a fantastic procedural scenery,and the resource is infinite, you can add log plank metal etc any number<br/><br/>in dig mode , you can Destroy the entire map by your pickaxe ,dig hole and explore,  because whole map uses voxel to generate<br/><br/>this game used all kinds of cutting-edge technology and may have many bugs and annoying settings, if you meet error and annoying bugs,please tell VicX Studio,VicX Studio will fix it as soon as possible.", "metacritic": null, "released": "2018-06-12", "tba": false, "updated": "2019-08-28T21:57:48", "background_image": "https://media.rawg.io/media/screenshots/b23/b233a8dabc0a107c52633dee2ae0b310.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 386, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["VicX Studio"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["VicX Studio"], "esrb_rating": null}