{"id": 619436, "slug": "a-ball-of-yarn", "name": "A Ball of Yarn", "name_original": "A Ball of Yarn", "description": "<p><strong>A Ball of Yarn</strong><br/></p>\n<p>Can you join together all the clues to determine which cat committed the crime? Can you choose which cat should lose it's ninth life?<br/></p>\n<p>Frantically sift through papers and join the right clues together, while your colleagues at the police department dump all the information they can find onto your desk. Time is of the essence, so you'll have to make quick judgements to ascertain which cat committed the crime!</p>\n\n<p><strong>How to Play:<br/></strong></p>\n<p>Once you select a case the chaos will ensue. Move the papers you think will be useful to the pinboard but be careful as once the timer is up you can no longer move them. When the second phase begins you can place pins on the board to connect the dots and join the evidence together. Once you think you know the culprit click on them and see how well chosen your evidence was. Don't be disheartened if you cannot get it first try, this game is brutally difficult.</p>\n<p><strong>Controls:<br/></strong></p>\n<p>F1 -&gt; Toggles Fullscreen</p>\n<p>F2 -&gt; Toggles Mute</p>\n<p>Click and Drag to move the papers</p>\n<p>Click on the pinboard during the second phase to place pins</p>\n\n<p><strong>Credits:</strong><br/></p>\n<p>A Ball of Yarn is a why-are-there-so-many-papers-on-my-desk simulator made by Aero (Programming, Game Design, Music) and wilm0x42 (Sound Design, Art, Writing) in 48 hours for the GMTK 2021 Game Jam.</p>\n<p>Special thanks to A and VoidableTone for playtesting!<br/></p>\n\n<p><strong>Programs Used: </strong>Godot, Audacity, Reaper, Waveform, Musescore, Gimp, Paint.net, Github<br/></p>", "metacritic": null, "released": "2021-06-13", "tba": false, "updated": "2021-06-14T14:42:17", "background_image": "https://media.rawg.io/media/screenshots/024/024159cbf53b83f49bf1f4fda7d477cc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 68, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux", "Web"], "developers": ["wilm0x42", "Aero"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}