{"id": 61961, "slug": "headsnatchers", "name": "Headsnatchers", "name_original": "Headsnatchers", "description": "<strong>Hold onto your head with Headsnatchers, a stupidly hectic up-to-4-player local and online multiplayer party-game where you snatch your friends’ heads to come out victorious. Because, let’s face it, you’ll do anything to win.</strong>LOCAL AND ONLINE MULTIPLAYER, BUT SUPER WEIRD<br/>Challenge your friends to insane brawls, where the goal is to pluck heads from shoulders and use them to get that much-desired victory! Headsnatchers has 25 ridiculous maps with unique, yet unlikely, weapons and features, with their own steps and rules to follow. Well, they’re more like guidelines. Nobody likes rules. Dunk your buddies’ heads through hoops like LeBron, kick your grandpa’s gobbler through a portal to hell like Doomguy™ and flush your sister’s brain-basket down the toilet like the dooky you pushed out five hours after you shoved that XL pizza down your face. You name it, Headsnatchers has got it. Probably.<br/><br/>*The online mode currently has 6 playable maps, but that number will grow as Headsnatchers continues development in Early Access. Custom heads aren’t supported in the online mode at this time. Keep an eye on the Steam announcements and forum to stay up to date!<br/><br/>OFF WITH THEIR (100+) HEADS<br/>Because apparently kids nowadays are all about self-expression and unique identifiers, we felt we couldn’t stay behind the times. With over 100 unique heads to choose from, there’s a head for everyone. Did we mention there are pop culture references? There’s a head that resembles that one angry guy from that anime you used to love, and one from a children's show with a certain mathematically challenged Count. If you don’t like any of those, make your own heads using the Headitor! You can save up to 20 heads, so go nuts trying to recreate those school dweebs who used to pick you last for gym.<br/><br/>A SINGLE-PLAYER MODE MADE JUST FOR YOU<br/>Sometimes you just need a little me-time - we totally get it. Rip it up in the single-player Zombie Castle-mode! This single-player feature spans across three different difficulty levels. “But, my dudes, every game has multiple difficulties nowadays”, we hear you thinking. Zombie Castle is different throughout its easy, normal and hard modes. Different levels, different everything, same zombies. We’re calling it right now: you can’t beat them all. Probably.OBLIGATORY KEY FEATURE BULLET POINTS<br/>We’re sorry, but we just have to go over all of the features one last time. Okay, ready?<br/><br/><ul><li>Local and online* multiplayer, support up to 4 players<br/></li><li>4 game modes and 25 unique levels<br/></li><li>Zombie Castle single-player mode, for when you really need some me-time<br/></li><li>Choose from 100 heads<br/></li><li>A limitless custom head creator* (yes, we’re calling it the Headitor, and there’s nothing you can do about it) that allows you to save up to 20 custom heads*</li></ul><br/>*The online mode currently has 6 playable maps, but that number will grow as Headsnatchers continues development in Early Access. Custom heads aren’t supported in the online mode at this time. Keep an eye on the Steam announcements and forum to stay up to date!", "metacritic": null, "released": "2018-07-24", "tba": false, "updated": "2023-12-18T17:37:27", "background_image": "https://media.rawg.io/media/screenshots/831/8317fca646c75922f2ba6f291f6aac6d.jpg", "website": "http://www.headsnatchers.com", "rating": 1.84, "rating_top": 1, "added_by_status": {"yet": 192, "owned": 3004, "beaten": 1, "toplay": 2, "dropped": 45, "playing": 3}, "playtime": 2, "achievements_count": 72, "ratings_count": 128, "suggestions_count": 277, "game_series_count": 0, "reviews_count": 128, "platforms": ["Nintendo Switch", "PlayStation 4", "PC"], "developers": ["IguanaBee"], "genres": ["Action", "Sports", "Casual", "Indie"], "publishers": ["Iceberg Interactive"], "esrb_rating": "Everyone 10+"}