{"id": 619729, "slug": "next-space-rebels", "name": "Next Space Rebels", "name_original": "Next Space Rebels", "description": "<p>Order some parts online, get your camera, and grow your StarTube channel through rocket tinkering and often wacky challenges! With great fame comes great responsibility, and a sudden wrench in your path to greatness will take you on a journey towards space.</p>\n<p>The mysterious Next Space Rebels know that those who control the satellites now control the future of the internet. Will you join them in their race to internet freedom?</p>\n<p>Next Space Rebels enables the joy of creation, lessons of failure, and progress of experimentation, generally reserved for complex sim games, through its accessible “notepad-style” creation tools and intertwined narrative.</p>\n<p>Key Features:<br />\nPowerful yet easy-to-use rocket creation tools that will let any budding rocketeer express their full creative potential.<br />\nEarn and gather new parts by completing challenges to grow from a hobbyist rocket builder to an advanced satellite-launching rocket scientist.<br />\nGrow your online StarTube channel! Share your recorded creations in-game to grow your channel, then export them to share in real life.<br />\nFully live-action cutscenes! Meet an extensive cast of extravagant internet characters on your journey towards becoming a Next Space Rebel.<br />\nFreeplay mode to create the Frankensteinian rocket of your dreams!</p>", "metacritic": null, "released": null, "tba": true, "updated": "2021-11-19T04:17:06", "background_image": "https://media.rawg.io/media/games/18a/18a248d5c21a921593077e92ab47f3b8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 81, "toplay": 4, "dropped": 6, "playing": 1}, "playtime": 16, "achievements_count": 50, "ratings_count": 3, "suggestions_count": 319, "game_series_count": 0, "reviews_count": 4, "platforms": ["PC", "macOS"], "developers": ["Studio Floris Kaayk"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["Humble Games"], "esrb_rating": null}