{"id": 619806, "slug": "far-changing-tides", "name": "FAR: Changing Tides", "name_original": "FAR: Changing Tides", "description": "<p>Set sail and discover the wonders of a flooded world filled with mystery. Traverse the ruins of a once great society and use the pieces from its past to build a brighter future. Dive into unknown depths on the hunt for precious fuel and salvage, devise innovative solutions to overcome intricate obstacles, and unearth forgotten relics lost to time. Carry their memories and don’t give up hope.</p>\n<p>CAPTAIN YOUR SHIP<br />\nExperience the thrill of captaining a unique seafaring vessel with a mind of its own. More than a ship, this is a friend. Together you’ll brave high seas, navigate intense storms, and plumb the perils of a briny deep, growing as an inseparable partnership. Along the way you’ll need to keep things functioning by unlocking parts and fixing faults. The farther you travel, the more you’ll learn about your ship’s fascinating complexities.</p>\n<p>A CAPTIVATING WORLD<br />\nContend with both the fantastical and familiar in a richly detailed environment to charm and challenge. From bleak shorelines lapped by tides, to desolate basins in flooded forest valleys, to submerged enclaves frozen in time, each lovingly hand-painted location tells its own incredible story.</p>\n<p>A MEDITATIVE EXPERIENCE<br />\nFAR: Changing Tides is a relaxing, accessible and meditative adventure for everyone to enjoy. Set against exquisite and elegant scenery, and scored by a hauntingly beautiful soundtrack, this game transcends language to deliver an enthralling, warm-hearted, life-affirming experience that will stay with you.</p>\n<p>A LONE SAILS LEGACY<br />\nImmerse yourself in an entrancing odyssey like no other. FAR: Changing Tides is the sister title to 2018’s multi-award-winning FAR: Lone Sails. Like the critically acclaimed first game, it encompasses ecstatic highs, mournful lows, and great mysteries to uncover. At the centre of this evocative and poetic journey is the unforgettable tale of a boy and his ship, searching the world for answers.</p>", "metacritic": null, "released": "2022-03-01", "tba": false, "updated": "2024-04-10T05:06:16", "background_image": "https://media.rawg.io/media/games/d70/d70084559f41e7a7d4b1cc441c163763.jpg", "website": "", "rating": 3.81, "rating_top": 4, "added_by_status": {"yet": 54, "owned": 397, "beaten": 85, "toplay": 116, "dropped": 28, "playing": 11}, "playtime": 5, "achievements_count": 36, "ratings_count": 105, "suggestions_count": 377, "game_series_count": 1, "reviews_count": 107, "platforms": ["Xbox One", "Nintendo Switch", "PlayStation 4", "Xbox Series S/X", "PlayStation 5", "PC"], "developers": ["Okomotive"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Frontier Foundry"], "esrb_rating": null}