{"id": 619898, "slug": "warhammer-40000-chaos-gate-daemonhunters", "name": "Warhammer 40,000: Chaos Gate - Daemonhunters", "name_original": "Warhammer 40,000: Chaos Gate - Daemonhunters", "description": "<p>Lead humanity’s greatest weapon, the Grey Knights, in this fast-paced turn-based tactical RPG. Root out and purge a galaxy-spanning plague in a cinematic, story-driven campaign, using the tactics and talents of your own personalised squad of Daemonhunters.<br />\nForge Your Champions<br />\nGrey Knights are humanity’s greatest weapon. A secretive yet supremely powerful chapter of Space Marines sworn to eradicate corruption, these legendary Daemonhunters are dedicated to combating the minions of Chaos. Lead your own personalised squad against a galaxy-wide plot to infect worlds with a cosmic plague, The Bloom.<br />\nPlan Your Strategy<br />\nMaster a turn-based tactical game full of satisfyingly strategic action. Choose powerful classes, wield incredible weapons, use environments to your advantage, and target specific enemy weak points to hinder the advance of an ever-evolving and mutating threat.<br />\nEnter the 41st Millennium<br />\nPenned by acclaimed Black Library author Aaron Dembski-Bowden, immerse yourself in a compelling story set in the grimdark universe of Warhammer 40,000. Meet famous faces, engage iconic foes, and discover what it takes to lead a squad of elite warriors battling to prevent galaxy-wide destruction in the 41st millennium.</p>", "metacritic": null, "released": "2022-05-05", "tba": false, "updated": "2023-08-31T08:23:06", "background_image": "https://media.rawg.io/media/games/336/336e70370ffaba298628fb42a588988f.jpg", "website": "https://www.chaosgate.com/", "rating": 3.9, "rating_top": 5, "added_by_status": {"yet": 24, "owned": 248, "beaten": 5, "toplay": 39, "dropped": 3, "playing": 6}, "playtime": 5, "achievements_count": 38, "ratings_count": 8, "suggestions_count": 274, "game_series_count": 39, "reviews_count": 10, "platforms": ["PC"], "developers": ["Complex Games"], "genres": ["RPG", "Strategy"], "publishers": ["Frontier Foundry"], "esrb_rating": "Adults Only"}