{"id": 619867, "slug": "soulstice-2", "name": "Soulstice", "name_original": "Soulstice", "description": "<p>The balance of the Holy Kingdom of Keidas is compromised when powerful, feral creatures known as “Wraiths” invade from the other side of the Veil, threatening to consume the living. Wraiths corrupt their victims and can even possess their bodies, turning into unstoppable monsters that prey upon the common folk. The “Chimeras”, hybrid warriors born of the union of two souls, are the only ones who can protect humankind.</p>\n<p>Briar and Lute are two sisters who have been reborn as a Chimera. The transformation has granted Briar superhuman strength and resilience, while Lute, who was sacrificed in order to bind her soul to her sister’s, has become a ghost with mystical powers. Voiced by Stefanie Joosten (Metal Gear Solid 5), Briar and Lute are sent on a mission to reclaim a city in ruins that has been ravaged by the Wraiths, only to discover that the Order they belong to has a far more complex plan in mind.</p>\n<p>Explore a dark world brimming with hidden mysteries, master a diverse combat system, and inhabit the dual forces of two sisters in a coming-of-age fantasy story with fast-paced action, vicious enemies and breathtaking boss fights.</p>\n<p>Key Features<br />\nFight in synergy - Manage both characters simultaneously. Briar masters melee attacks and combos, while Lute controls the battlefield with her otherworldly abilities. Combine their strengths to unlock powerful transformations and fulfill their true potential as a Chimera.</p>\n<p>Customize weapons and abilities - Weapons are unlocked and upgraded throughout the game and can be switched even in the middle of a combo to deal greater damage to opponents.</p>\n<p>Explore the city of Ilden - Discover puzzles and secrets in diverse locations within a troubled city in ruins. A Tear in the Sky has opened above Ilden; as Briar and Lute get closer to it, their surroundings become more menacing and twisted.</p>\n<p>Experience a grim world - Plunge into a dark story of sisterly love heightened by stylish and sleek art inspired by classic Japanese fantasy.</p>\n<p>Combat different enemy classes - Wraiths, Corrupted and Possessed have trespassed into the world from beyond the Veil. Use Lute’s auras to weaken or expose them and adapt to a flow of battle that never feels the same.</p>\n<p>Uncover the truth of your origin - Throughout the game, Briar and Lute will discover the truth about themselves and their power but must work together to stay true to their unbreakable bond.</p>", "metacritic": null, "released": "2022-09-19", "tba": false, "updated": "2024-04-05T13:11:27", "background_image": "https://media.rawg.io/media/games/43e/43e1a4f86ff59d70624d7e7c608e58c3.jpg", "website": "https://soulsticegame.com/", "rating": 2.41, "rating_top": 3, "added_by_status": {"yet": 65, "owned": 150, "beaten": 10, "toplay": 59, "dropped": 20, "playing": 5}, "playtime": 2, "achievements_count": 48, "ratings_count": 27, "suggestions_count": 409, "game_series_count": 0, "reviews_count": 27, "platforms": ["PC", "Xbox Series S/X", "PlayStation 5"], "developers": ["Reply Game Studios"], "genres": ["Action", "Adventure"], "publishers": ["Modus Games"], "esrb_rating": null}