{"id": 61998, "slug": "techwars-deathmatch", "name": "Techwars Deathmatch", "name_original": "Techwars Deathmatch", "description": "Techwars Deathmatch is a top-down ММО action game with battle mechs. The game has an advanced system for destroying mechs and buildings. Pick a side and destroy the enemy in Siberia, Kazakhstan, Sochi and Alaska!<br/>\n<br/>\r\nThe new Deathmatch mode in the Techwars game series brings you battles with huge mechs, in which you must destroy the enemy army.<br/>\n<br/>\r\nEnjoy juicy fully detailed mech destruction. You can damage each arm, each leg and the body of the battle mech. Armor plates tearing off in real time, and all true to the laws of physics.<br/>\n<br/>\r\nEach battle mech has unique abilities and weaponry. In addition, there are mechs of different classes: Stormtroopers, Scouts, Destroyers, Support and Titans.<br/>\n<br/>\r\nThe year 2050. The American KATO corporation demands that the Russian Dominion corporation refrains from using stolen battle mech technology. To force their demands, KATO must begin a global campaign on Russian territory.<br/>\n<br/>\r\nYou are a battle mech pilot, a mechdriver, and you decide whose side you fight on. Protect technology and your native land (Dominion) or try to restore justice and bring peace and control over the armaments on the planet (KATO).<br/>\n<br/>\r\nAttention! A Techwars Deathmatch account is fully compatible with Techwars Online 2.", "metacritic": null, "released": "2018-04-17", "tba": false, "updated": "2019-08-23T12:11:45", "background_image": "https://media.rawg.io/media/screenshots/100/100708a3f8800dfb0897f612b309cced.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 23, "playing": 1}, "playtime": 2, "achievements_count": 46, "ratings_count": 0, "suggestions_count": 596, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Argus Games"], "genres": ["Action", "Strategy", "Massively Multiplayer", "Indie"], "publishers": ["Argus Games"], "esrb_rating": null}