{"id": 62006, "slug": "fading-visage", "name": "Fading Visage", "name_original": "Fading Visage", "description": "Where am I? This place frightens me. How can I get out of here?<br/>I've lost my way in a thick fog. Wherever I go, I keep coming back here, again and again, as if I have to finish something. I can dimly remember that I've been here already...<br/>What are these shadows? Ghosts? I don't believe in ghosts! They're coming closer... Are they real? They don't let me escape from this damned place... How can I make them let me go?..<br/><br/>Fading Visage is a mystical horror game where you are to explore gloomy locations and reveal a terrible secret. The abandoned house will be your shelter, however you'll have to go outside from time to time and search for clues that can shed light on a long forgotten incident. The incident that YOU are somehow involved in - that's for sure, otherwise the mysterious spirit wouldn't call you so persistently and show you the way to the evidences hidden somewhere in these woods and marshes!<br/><br/>Be careful, it's dangerous to go at night to the haunted forest. However you have to be wary even in the daytime, and if the strange entities start to chase you, run for your life!<br/>At the end of the game (if you're lucky enough to make it through – it's not so easy to survive here) you'll find out what brought you to this creepy place. ...And the moment when you'll discover the truth will be as much horrible as all the events you'll witness before it.", "metacritic": null, "released": "2018-05-29", "tba": false, "updated": "2019-08-28T21:57:45", "background_image": "https://media.rawg.io/media/screenshots/ecf/ecffa69ea88857475abcfed2f9f0ca60.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 15}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 221, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Joystick Knights"], "genres": ["Action", "Indie"], "publishers": ["Joystick Knights"], "esrb_rating": null}