{"id": 620034, "slug": "debug-mode-icypenguin_-steve-the-bartender", "name": "Debug Mode (IcyPenguin_, Steve The Bartender)", "name_original": "Debug Mode (IcyPenguin_, Steve The Bartender)", "description": "The developers of this game couldn't finish their game in time for the game jam. In fact, the game is so unfinished that you’re forced to use the not-very-well-hidden debug mode to beat it! Now that the game is at least possible, let’s see what got finished.\r\n[ATTENTION. OUR GAME DOES NOT FEATURE AN IN-GAME TUTORIAL. PLEASE REVIEW CONTROLS AND OBJECT BEHAVIORS ON THIS PAGE BEFORE PLAYING.]\r\nControls: \r\n<p>A/D - Move left/right</p>\n<p>W/S - Navigate menu, cling to ladder</p>\n<p>Space - Jump</p>\n<p>Left-click (in-game) - Shoot projectile</p>\n<p>Shift - Access Debug Mode</p>\n<p>Scroll Down - Select the next object in the palette</p>\n<p>Scroll Up - Select the previous object in the palette</p>\n<p>Left-click (in Debug Mode) - Place selected object</p>\n<p>Right-click (in Debug Mode) - Delete placed objects</p>\r\nThe Many Objects of Debug Mode: \r\n<p>  Ground - Your basic ground tile. A solid object with a collision on all four sides and isn't affected by gravity.</p>\n<p>  Ladder - Press up or down to climb it. Press jump while attached to it to let go.</p>\n<p>  Water - Slows your descent and allows you to swim through the power of infinite jumps.</p>\n<p>  Air Boosters - The direction of the arrow design determines the direction you will be flung. Gravity will not affect you during the speed boost granted from this object, but neither will your inputs.</p>\n<p>  Ammo Pack - Restores 5 ammo when collected. Spawn one if you're running low.</p>\n<p>  Health Pack - Restores 1 HP when collected. Spawn one if you're running low.</p>\n<p>  Crate - A box that can be pushed and is affected by gravity. Enemies will bounce off of it like a regular wall. Speaking of which...</p>\n<p>  Enemy - A bug who just wants to run into walls over and over again. It may not be very smart, but colliding with one will almost certainly knock the debug button out of your hands.</p>\n<p>  Bomb - A few sticks of dynamite and a little bit of time can destroy anything you need it to: crates, enemies, and even you if you're not careful.</p>\n\r\nOther Stuff (Jam theme applications and other inspirations)\r\n<p>This game was made for the GMTK Game Jam 2021 with the theme of \"joined together\". We interpreted the theme as joining the elements of traditional level builders with the elements of a run-and-gun platformer with very little interruption between the two modes of gameplay. In most level creation games that come to mind, it often takes a while to go back and forth between the level editor and playing the level itself. We aimed to destroy as much of this barrier as possible and link these two aspects seamlessly. Whatever you placed in the debug mode, the game world would be altered accordingly and instantaneously. We also added the ability to lose your access to debug mode if you're hit by an enemy, severing the connection between the player and what is considered their most useful tool. The use of debug mode can be regained by recollecting the shift key that flies out of the player. We were inspired by the celestial brush mechanic in Okami and the famous debug mode from Sonic the Hedgehog 2.</p>\n\r\nCredits:\r\n<p>Programming, Music, Level Design, General Design - IcyPenguin_</p>\n<p>Art, General Design - Steve the Bartender</p>\n<p>Explosion animation - JROB774 on opengameart.org</p>\n<p>Original shift key art - mnilsson on opengameart.org  (Modifications - IcyPenguin_)</p>\r\nSoftware:\r\n<p>Pixel Art - Aseprite</p>\n<p>Image Editing Software - paint.NET</p>\n<p>Music - FamiTracker</p>\n<p>Sound Effects - BFXR</p>\n<p>Programming - GameMaker Studio 2.3</p>", "metacritic": null, "released": "2021-06-13", "tba": false, "updated": "2021-06-14T17:10:15", "background_image": "https://media.rawg.io/media/screenshots/3cd/3cd0edb4a0180637d3127926469b5c90.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 30, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Steve The Bartender", "IcyPenguin_"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}