{"id": 62014, "slug": "typical", "name": "Typical", "name_original": "Typical", "description": "Genre: Otomé, everyday life, romance<br/>Duration 2-4 hours.<br/><br/><br/>A romance, comedy <strong>Visual Novel</strong> - follow the story of Amaterasu.<br/>Amaterasu is a carefree art student in the University of Tokyo Amaterasu who enjoys spending her free time with her friends: the genius-artist Subaru, the friendly senpai Suzuki, and the incomparable  Kagari. The quartet of friends are popular and successful at the university, but things are not always as they seem. Teru’s patience is running out. Who will she choose? What is more important: friendship or love? Only you can decide!Features:<br/><ul><li><strong>Female protagonist: </strong>Play as Amaterasu, art student in the University of Tokyo<br/></li><li><strong>2 charming characters to build relationship with:</strong> Romance Suzuki and Subaru<br/></li><li><strong>50k+ words with an estimated 2-4 hours of gameplay:</strong> A cute and fun set of well written story-lines<br/></li><li><strong>Multiple endings:</strong> Three main endings based on your choices<br/></li><li><strong>Point-and-click minigame:</strong> Examine objects in the room<br/></li><li><strong>Soundtrack:</strong> Enjoy the unique soundtrack composed exclusively for Typical<br/></li><li><strong>Beautiful art:</strong> 20+ Unlockable CGs<br/><br/><br/><br/>Amaterasu (Teru to her friends)<br/>Bright, active, and fashionable. The art student is restless in her pursuits, but cheerful in any situation. However, uncertainty and distrust often interferes with her ability to make the right choices.<br/><br/><br/>Kagari (Kaga to her friends)<br/>A refined young woman with the face of an angel, but beneath her angelic exterior lies a real demon. <br/>Kagari is very intelligent and favored by students and teachers alike. However, when others are not looking, she can be quick to anger and determined to achieve her goals at any cost. Despite being Teru’s best friend, will her friendship be tested when they become rivals in love?<br/><br/><br/>Suzuki <br/>A year ahead of Subaru and Teru, Suzuki (aka Senpai) will soon graduate. He is friendly, kind, and unyielding in his friendship. As a member of the student council, he has has many friends, both in school and out. His excellent reputation and connections make him an indispensable friend. <br/><br/><br/>Subaru<br/>The virtuoso artist is a workaholic and lover of lemon sorbet. Subaru is 100% naturally talented at drawing, although he comes off unsociable and rude to others. He is often so focused on work that he ignores everything else around him.</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:57:45", "background_image": "https://media.rawg.io/media/screenshots/d45/d455e4c7db885f0ae42a965502e3748e.jpg", "website": "https://twitter.com/Tsunami__Games", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 9, "beaten": 2}, "playtime": 20, "achievements_count": 31, "ratings_count": 1, "suggestions_count": 211, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["kalanhow"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["TsunamiGames"], "esrb_rating": null}