{"id": 6202, "slug": "midnight-star-renegade", "name": "Midnight Star Renegade", "name_original": "Midnight Star Renegade", "description": "* IMPORTANT * Midnight Star: Renegade requires an iPhone 5s (or newer), an iPad Mini 2 (or newer), or an iPad Air (or newer).<br/><br/>Get on your jump boots and pack your grenades and rocket mags. It&amp;#39;s time for FPS madness!<br/><br/>Craft your own weapons and gear while ascending the ranks of the GMSC&amp;#39;s elite Renegade forces. Shooting combat spans fast, action-packed levels as you unravel the mysteries left behind by a space faring civilization that went missing 22,000 years ago.<br/><br/>SHOOT ALIENS<br/>Born on mobile, Renegade offers the best in shooting action on your touchscreen. Run around levels using directional swipes and touch to shoot a wide range of pistols, rifles, rockets and grenades.<br/><br/>CRAFT WEAPONS<br/>Play the way you want as you build your Renegade&amp;#39;s gear from a huge variety of available parts. Choose burst fire over auto fire for close quarters or explosive rocket ordinance and jump boots to let you fly and destroy- the options are limitless.<br/><br/>EARN RANK<br/>Multiplayer mode lets you compete against your fellow Renegades. Upgrade your gear and enter the fray with versus mode plus daily and weekly challenges for huge rewards.<br/><br/>A DEEP STORY<br/>Crafted with Hugo-winning author John Scalzi, Renegade puts you in the pivotal role of an elite GMSC soldier fighting to unlock the secrets of a long lost alien race before the Dust Empire beats us to it! You&amp;#39;ll shoot aliens, recover archives, rescue POWs and a lot more on your journey to victory.", "metacritic": null, "released": "2016-08-13", "tba": false, "updated": "2019-10-22T14:28:44", "background_image": "https://media.rawg.io/media/screenshots/3c3/3c35ce97d0d1f4a35afe8bfda7ae27d1.jpeg", "website": "http://www.renegadeprogram.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 192, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Industrial Toys"], "genres": ["Action", "Adventure"], "publishers": ["Industrial Toys"], "esrb_rating": "Teen"}