{"id": 620419, "slug": "gourney", "name": "Gourney", "name_original": "Gourney", "description": "Buckle up in GOURNEY - A Gravity Journey!\r\n\r\nSolve puzzles, shoot physics-bending bullets and explore the wonders of wild wild space today. \r\n<p>\n</p>\r\n\r\nRevenge with a bit of moon dust tea\r\n<p>Meet Space Ranger. Once betrayed, now they're on a mission for revenge on their old gun slinger gang. But he needs your help. Before you do, why don't you sit down and warm yourself up with some moon dust tea from wise old Uncle Bronco (or don't, we've heard it tastes terrible). If Ranger helps Bronco out with some yard work and reparations, they can borrow his old spaceship to travel the galaxy. Are you up for the task, pardner?<br/><br/></p>\n\n<p>- Travel the galaxy and meet an interesting bunch of characters</p>\n<p>- Solve mind-bendingly tricky puzzles. From yardwork to space basketball in a forgotten civilization, there's no telling what crazy tasks you will have to do. <br/></p>\n<p>- Use three physics-based weapons: the pistol curves around objects, the rifle bounces from one object to the next, and the grenade launcher... is fun. Use at your own discretion<br/></p>\n<p>Go and fix up Uncle Bronco's moon by using physics and the three guns at your disposal. Then launch yourself onto planet Polisand and find the power cores from an old civilisation to rebuild the ship. Jump, run, shoot and most importantly <em>think</em> in order for you to beat the game. <br/></p>\n\r\n\r\nMinimum Requirements: \r\n<p>- Ram: 16.0 GB<br/>- OS: Windows 10<br/>- Processor: Intel(R) Core (TM) i7 - 3820 CPU @ 3.60GHz, 3601 Mhz, 4 Core(s)<br/> - Storage: 980 MB<br/>- Graphics Card: Nvidia Geforce GTX 1050 Ti<br/><br/></p>\n<p>Who are we? What are we doing? We hardly know ourselves lmao. <br/><br/></p>\n\r\nJason\r\n<p>Our super coder game developer. Responsible for gravity mechanic etcetc like holy moly. <br/></p>\n\n\r\nMikhail\r\n<p>The art rat. Concept art, level art, animations, level design, is there anything this boi can't do? Actually yes it seems he can't sleep or be a happy little rat. </p>\n\n\r\nAxel \r\n<p>The tech art goblin. Rigs, shaders, level art, level design and general \"get your shit together\"- man. <br/></p>\n\n\r\nLinnea\r\n<p>The art baby. Has made most of the graphical design bits. Also some concept art and some 3D assets. Has  a tendency of crying for no good reason. <br/></p>\n\r\n\r\nYannick \r\n<p>Mainly responsible for the level design of the game. Play testing and bug fixing.</p>\n\r\n\r\nAdam\r\n\r\n<p>Story man and also some level design and code<br/></p>\n\n\r\nHisham\r\n<p>Worked on UI and gameplay programming/designing. Worked on music production</p>", "metacritic": null, "released": "2021-06-13", "tba": false, "updated": "2021-06-14T18:48:37", "background_image": "https://media.rawg.io/media/screenshots/fee/feec27ecb5d670d74706ad5d9f5e7169.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 324, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["GourneyGang"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}