{"id": 620743, "slug": "manifesto-mekasasquatch-diogo45", "name": "Manifesto (MekaSasquatch, Diogo45)", "name_original": "Manifesto (MekaSasquatch, Diogo45)", "description": "<p><strong>Warning:  Web version might lag a bit. Windows version should probably be smoother.   (The web version has a bug at the end of the second stage. If it looks like it got stuck, you won and we apologize for the lack of confetti)<br/></strong><br/></p>\n<p><strong>Manifesto </strong>is a game about joining together with your peers to retake public spaces.</p>\n<p>Gather a protest and manifest on landmarks to retake them to the people.</p>\n<p>Controls<br/></p>\n<p>1.  Move the Camera with WASD (and Zoom with the mousewheel)<br/></p>\n<p>2.  Move your Riot aggregator by clicking on the ground, crowds will gather there.</p>\n<p>3.  Crowds gather to the Riot Aggregator ( the grey cube you control). White crowds will follow your aggregator and move around together. You can pick stragglers back up. <br/></p>\n<p>4.  Aggregate a lot of people around the purple landmark posts to start capturing them.</p>\n<p>5. Landmarks turn green as they are being captured.<br/></p>\n<p>6.  Avoid being dispersed by the Counterprotestors and stick to the Landmarks until they turn completely. (The police also has a riot aggregator pointer.  At least its blue.)<br/></p>\n\n\n<p>There might still be a few bugs!<br/></p>\n<p>Thanks for playing and have fun!<br/></p>\n\n<p>This game was made by André Antonitsch and Diogo Müller for the GMKT  Jam 2021.<br/><br/></p>", "metacritic": null, "released": "2021-06-13", "tba": false, "updated": "2021-06-14T20:07:00", "background_image": "https://media.rawg.io/media/screenshots/648/648061c10b47b9c683e8e1de1e55d0ea.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 32, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["MekaSasquatch", "Diogo45"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}