{"id": 62099, "slug": "port-valley", "name": "Port Valley", "name_original": "Port Valley", "description": "<p>Port Valley is a (not so) classic Point &amp; Click adventure where a certain choice changes everything.<br />\nThe game follows the story of an unnamed guy fed up with his job who just wants to have a calm life, but that&#39;s not an option in this town. At least not during the mayoral elections.<br />\nYou&#39;ll see Port Valley&#39;s Election Day from three different perspectives. Three parallel versions of our main character attempting three different jobs while trying to understand a bigger and obscure plot that&#39;ll only make sense after witnessing the three available points of view.<br />\nAnd if everything goes wrong… just start all over again.Key Features<br />\nThree difficulties, three plots, three mayoral candidates, three endings… three points of view of a bigger and complex story.<br />\nA renewed yet classic Point &amp; Click verb interface with a non-intrusive menu.<br />\nActive NPCs. They&#39;re not just there to give you items. They also have their businesses and objectives, which may be more important than yours.<br />\nAnnoying puzzles with different ways to solve them. For real.<br />\nEven more annoying self-aware humor. Sorry!<br />\nTONS of hidden secrets. I love doing that.<br />\nA dog.<br />\nThe Demo<br />\nThe demo is an hour-long alternative version of one of the three parts of the game:<br />\nThe Delivery Guy plot.<br />\nThe puzzles have been simplified and the story has been modified to fit the new length, but it may work as a first taste of Port Valley&#39;s mechanics and characters.</p>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:57:41", "background_image": "https://media.rawg.io/media/screenshots/5f8/5f8f0cc76f1bf095ecec063b96b6b059.jpg", "website": "https://portvalley.org/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 205, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC", "macOS"], "developers": ["WrongPixel"], "genres": ["Adventure", "Indie"], "publishers": ["WrongPixel"], "esrb_rating": null}