{"id": 62093, "slug": "blood-will-be-spilled", "name": "Blood will be Spilled", "name_original": "Blood will be Spilled", "description": "Blood will be Spilled is a narrative spaghetti western platformer with tactical turn-based combat, taking place in a completely hand drawn harsh world inhabited by insects. <br/><br/><br/><br/>You follow the story of Jack - a mosquito bounty hunter, on his path of revenge. Soon however, he finds himself neck-deep in a vicious scheme that is far more than he bargained for. Heavily outgunned and outnumbered, Jack will need help from a few rather unusual allies to even the odds. In the land with no laws, from deserted anthills and dusty mines, through badland battlefields to treacherous swamps, he's on a hunt for the Calaveras gang. And they are wanted alive...or dead. <br/><br/><ul><li> Epic adventure of blood and revenge, featuring guns, explosives, trains and insects (with even more guns!)<br/></li><li> With a narrator, accompanying you through the story (voiced by Tim Simmons)<br/></li><li> Jack is voiced by legendary Elias Toufexis (Adam Jensen from DeusEx)<br/></li><li> Outstanding cast of more than 15 fully voiced and rather peculiar characters<br/></li><li> Fully hand drawn visuals in a distinct comic book style</li></ul><br/><br/><br/><ul><li> Classic side-scrolling action in a charming handcrafted world of “the Wild West with an insect twist” <br/></li><li> Tactical turn-based shoot-outs - always outgunned, use every advantage and dirty trick to get an edge over your enemies: Hide behind covers, exploit the environment, suck the blood of your enemies and make sure that you're the last bug standing<br/></li><li>  Use 12 active and 3 passive abilities in 3 different paths - The Good, The Bad or The Ugly, and dispose of your enemies with a ricochet, a shotgun or a shovel<br/></li><li>  Pack 7 magnificent revolvers, inspired by western classics, that'll fill your enemies with enough lead they would probably die of poisoning if only the shots didn't kill them first<br/></li><li>  Battle 9 types of enemies - from ferocious mites, nasty fly-banditos, aggressive wasp-sharpshooters to crooked cockroach brawlers and explosive bugs<br/></li><li>  Face 4 sinister gang leaders with bounties  on their heads -  will you drag them back to town alive or dead?<br/></li><li>  Scattered secrets and hidden collectibles for explorers and treasure hunters to find<br/></li><li>  Beautiful acoustic soundtrack that pays tribute to the old classics of the genre</li></ul>", "metacritic": null, "released": "2020-02-20", "tba": false, "updated": "2020-12-16T14:28:57", "background_image": "https://media.rawg.io/media/screenshots/0d9/0d939547327813d641d3e05d12aacbee.jpg", "website": "https://www.bloodwillbespilled.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 2}, "playtime": 0, "achievements_count": 17, "ratings_count": 0, "suggestions_count": 367, "game_series_count": 0, "reviews_count": 0, "platforms": ["Nintendo Switch", "PC"], "developers": ["Attu Games", "Doublequote Studio"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Indie"], "publishers": ["Attu Games", "Doublequote Studio"], "esrb_rating": "Teen"}