{"id": 62104, "slug": "break-the-targets", "name": "Break The Targets", "name_original": "Break The Targets", "description": "Break the Targets is a unique time-trial platformer game with simple controls featuring hundreds of levels and an online leaderboard for competitive placing.<strong>CONTENT:</strong><ul><li>140 Increasingly challenging levels to be completed under 30 seconds<br/></li><li>25 SSBM Tribute Stages with online leaderboards<br/></li><li>Level Editor - Create and share levels with the Community<br/></li><li>Hundreds of Community Levels<br/></li><li>2 Characters with unique properties, attacks, and unlockable special attacks<br/></li><li>TOP 500 Leaderboard available ingame for each level<br/></li><li>Clean, responsive controls as well as beautiful visual elements<br/></li><li>Play against yourself, the Author, or against a Leaderboard Ghost<br/></li><li>Share a replay with your friends or spectate amazing replays from the community<br/></li><li>Gamepad support + configuration<br/></li><li>TAS Support with Action Script Editor and Dedicated leaderboards</li></ul><strong>BONUS GAME MODES</strong>Juggle - Hit the ball trought various stage as fast as possible.<br/>Battle Discord - Play against other players in real time on a unique random level.<br/>Target Buster Mode - How many targets can you destroy in 1 minute?<br/>Running Buster Mode - How far can you go in 2 minutes?<br/>Powershield Mode - Increase your powershielding reflexes!<br/>Canon Mode - Catch the targets before they crash on the ground<br/>Endurance Mode - A long level with increasing difficulty and checkpoints along the way<br/>Survival - Stay Alive as long as possible<br/>Marathon - Speedrun all levels or a segment of the game in one single run<br/>Random Mode - How many micro levels can you complete in 60 seconds?<br/>Tribute Pack Riddle - Collect as many targets as possible without touching the ground<br/>Tribute Pack Mode5 - Timer stop at 5 targets<br/>Advanced BTT School - Complete technical challenges to earn badges<br/>And even more!Misc165 hidden Silver Bolts to find<br/>+180 cards to collect<br/>Discord Integration with bot features and dedicated mode<br/>Online shareable profile<br/>Wiki availableControls <ul><li>Attacks:<strong> Default controls use WASD</strong>, so be sure to change adapt it to your keyboard settings.<br/></li><li>Press the Rope Button to create a rope while close enough to an attachable object to traverse dangerous terrain.<br/></li><li>Use your shield (Airdodge in air) to avoid getting hit by the charge shot and other projectiles!<br/></li><li>Additional characters abilities like laser, bomb, phantasm or teleport are also unlockable after reaching the required XP level.<br/>These techniques add a new dimension to the game and provide new ways to complete all levels in a shorter time.</li></ul><br/>Join the discord to seek for help, find opponents for Discord Battles or to discuss with experienced players about the game.<br/><br/>If you find any bug, please use the bug tracker to be sure I've officially took care of it.  <br/><br/>Credits:<br/>Music by Ozzed (Licenced CC-BY 3.0) <br/>Music by Eric Skiff (Licenced CC-BY 3.0)<br/>Trailer Music by NeXsard (Licenced CC-BY 3.0)<br/>Sweden Translation by Charleon", "metacritic": null, "released": "2018-06-21", "tba": false, "updated": "2019-08-28T21:57:41", "background_image": "https://media.rawg.io/media/screenshots/ae4/ae4a26ccb13c8fa35abd1dd440470e1c.jpg", "website": "http://btt.q-prod.net", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 201, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Q'Prod"], "genres": ["Action", "Strategy", "Indie"], "publishers": ["Q'Prod"], "esrb_rating": null}