{"id": 62111, "slug": "dead-mayhem", "name": "Dead Mayhem", "name_original": "Dead Mayhem", "description": "One day the world suddenly changed due to an outbreak of the zombie virus!<br/><br/>No matter where you are, zombies can hear and smell you from all directions... And they will bite your neck off! Find a safe hiding place, and there will already be other hostile survivors!<br/>Those who attack you are fast, powerful, and will use special mutant abilities.<br/><br/>You can dash away for a short time or push away the zombies, but that won't be enough to keep you alive.<br/>To survive, explore the surroundings, build walls out of junk, and have your weapons ready at all time (however lousy they may be!)<br/>Build a safe area and teach yourself how to survive!<br/><br/>Help your survivor get a better chance of surviving by using equipment that you can get from combats.<br/><br/><br/><br/><br/>Your survivor can craft various weapons!<br/><br/>Pistols that are powerful but slow, weaker but fast-firing submachine guns, rifles with average efficiency, shotguns that destroy everything nearby...<br/><br/>Large-caliber rifles, high-tech railguns... Just name it.<br/>Not enough power to stop the swarm of enemies? Try bombs!<br/><br/>All the weapons have their pros and cons, but you can carry up to five weapons that suit your taste and use them at the right time.<br/><br/><br/><br/><br/>Install structures wherever, however you want.<br/>The walls block projectiles and the enemies from getting to you, and you can set up traps between the walls to inflict damage on any enemy passing by.<br/><br/>You can also boost your firepower with automatic turrets that use loaded bullets.<br/><br/>Build your own safety zone with a wide variety of traps!<br/><br/><br/><br/><br/>Many PvE and PvP modes are available, including Survival mode where you survive from zombie attacks with up to four people, and The Last Survivor mode where you must survive from other survivors.<br/><br/>We will continue to update game modes as well as customizing items, weapons, and traps.", "metacritic": null, "released": "2018-07-19", "tba": false, "updated": "2019-08-28T21:57:41", "background_image": "https://media.rawg.io/media/screenshots/58e/58e6e0816ae9ea6945cb9a6077564967.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 390, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["EnchantedLands"], "genres": ["Action", "Indie"], "publishers": ["Cetus Lab"], "esrb_rating": null}