{"id": 62110, "slug": "chewbrick", "name": "Chewbrick", "name_original": "Chewbrick", "description": "Year 2048. Planet Brickantine.<br/><br/>Just a simple brickguy Chewbrick lives in a small town of Bricksville. As usual, after work, he was playing video games and was listening to music. But suddenly thunderstorm began, rock shower covered Chewbrick's house.<br/><br/>It turned out these rocks were Orbital Reducers of the Biosphere (ORBs). Then lightning stroke game console, and it must have short-circuited. This gave him super abilities, which he didn't possess before. Bullets began to fly out from his head, just like in his game. Also, he's got the power - Impulse - which could push everything away.<br/><br/>Such disaster wasn't only in his house, all planet is in trouble. Why did they come? You have to save brickind and find this out in exciting adventures of Chewbrick!Gameplay<ul><li>It's arcade shoot'em up, in which you need to kill and evade spherical-shaped ORBs.<br/></li><li>Patinas (it looks like crystals, for which you can improve character), as well as positive and negative bonuses, can fall out of them.<br/></li><li>The player can move left-right, and also jump-crouch.<br/></li><li>Before the level start, you can choose weapon and superpower.<br/></li><li>There are different types of ORBs could be, each one has its own characteristics and behavior, but in one they are all alike - they want to kill you!<br/></li><li>If you'll hit the ORB - two smaller ones will fall out. Then hit smaller ones - another two smaller will fall, and so on, until they are destroyed.<br/></li><li>Every location starts with different mini-game. Every location ends with unique Boss-level.</li></ul>Power of Seven<ul><li>7 various locations<br/></li><li>7 levels on each location<br/></li><li>7 types of ORBs, each one has its own behavior<br/></li><li>7 challenging Bosses<br/></li><li>7 different weapons<br/></li><li>7 unique super-powers<br/></li><li>7 foreign crystals, called Patina, dropped on each level from ORBs<br/></li><li>7 positive bonuses<br/></li><li>7 negative bonuses<br/></li><li>7 years of development (nope)</li></ul>", "metacritic": null, "released": "2018-09-13", "tba": false, "updated": "2019-08-28T21:57:41", "background_image": "https://media.rawg.io/media/screenshots/750/750e66dce603c4e18fa3a7c76c59942c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 492, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Decabry"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Decabry"], "esrb_rating": null}