{"id": 6212, "slug": "stickman-downhill", "name": "Stickman Downhill", "name_original": "Stickman Downhill", "description": "Experience ultra realistic and fast paced action packed downhill biking in stunning environments. Choose from more than 15 different bikes, including full suspension bikes, retro bikes or even electro bikes. Bike in various different locations, ranging from tracks in deep forest to mountain tracks high up in the air. All bikes are unique designed with stunning realistic physics. <br/><br/>Additionally, Compete with your friends at special ranked event tracks, share your gameplay videos and watch others people best ride.<br/><br/>• From the makers of various top hits like Stick Stunt Biker, Stickman Cliff Diving, Stickman Base Jumper, Rope'n'Fly and more...<br/>• Main featured by Apple in various countries<br/>• Top #1 game in multiple countries<br/>• More than 3 million downloads<br/><br/>FEATURES<br/>• Unique and beautiful graphic style<br/>• Stickman Downhill supports MOGA and other MFi game controllers on iOS7 <br/>• More than 90 beautiful designed tracks, set in stunning atmospheres like Woods, Ocean, Night, etc.<br/>• Downhill tracks, Trial tracks, Free ride tracks, etc.<br/>• More than 17 unique designed ultra realistic bikes, including E-bikes, retro bikes, future bikes, rocket bikes and many more<br/>• Fully physic enabled bike and physic enabled player for spectacular crashes<br/>• Different unique amazing atmospheric locations, from forest to mountains, day and night, etc.<br/>• Get achievements for special stunts<br/>• Directly compare to your friends and all other players with the builtin leaderboard and tournament tracks<br/>• Directly record your gameplay and share your best rides or crashes with your friends on Facebook, Youtube or Twitter<br/>• Tilt or button control, whichever you prefer<br/>• Integrated gameplay recording and video sharing<br/><br/>No in-app purchase is required, you can play and complete the entire game without having to purchase anything, everything can be unlocked by progressing through the game.<br/><br/>Take a look at the Stickman Downhill Trailer : http://www.youtube.com/watch?v=vdPIOWL9qhE<br/><br/>Feel free to post your ideas, we will try to implement them as soon as possible<br/>Thank you very much for all your support and interest in our games! We would love to hear your suggestions!", "metacritic": null, "released": "2013-08-31", "tba": false, "updated": "2019-07-29T22:42:40", "background_image": "https://media.rawg.io/media/screenshots/bf0/bf054f55e0701e54e4818517e1569909.jpg", "website": "http://www.djinnworks.at", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 154, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Djinnworks"], "genres": ["Racing", "Arcade", "Casual"], "publishers": ["Djinnworks"], "esrb_rating": "Everyone 10+"}