{"id": 62120, "slug": "revolt-1917", "name": "REVOLT 1917", "name_original": "REVOLT 1917", "description": "Inspired by the works of T.E. Lawrence, enter the world of the ARAB REVOLT.  Fight and survive the Turkish attack on Yenbo of 1916, trek the uninhabitable expanse of the Sinai deserts, search for and destroy the railways of the Hejaz and fight alongside the soldiers of the revolt to launch the climactic 1917 Battle of Akaba.  <br/><br/>REVOLT 1917 is an indie first person shooter set in the World War I Middle East.  Blending survival and military shooter elements into several vast locales, REVOLT 1917 features gameplay elements such as:<br/><br/><br/><strong>A MULTI-CHAPTER SINGLEPLAYER DESERT CAMPAIGN</strong><br/>-Follow in the footsteps of the Arab tribal leaders as you explore the history and lands of the Arab Revolt.  Play over multiple key locations in the events of the time with each chapter promising a new gameplay focus.<br/><br/><strong>A FULLY DYNAMIC DAY/NIGHT/WEATHER/TEMPERATURE SYSTEM</strong><br/>-Plan expeditions carefully to not fall victim to the perils of extreme desert heat or an unsuspecting sandstorm.<br/><br/><strong>AN IN DEPTH TIME AND CALENDAR SYSTEM</strong><br/>-Launch attacks with hourly precision utilizing a full 24 hour time cycle and time sensitive objectives.<br/> <br/><strong>LARGE 2 SQ. KILOMETER ENVIRONMENTS</strong><br/>-Locales include city interiors, small desert villages scattered across desert dunes, narrow rocky canyons and coastal ports; each forcing a differing play style.<br/><br/><strong>A COMPLEX HEALTH/STAMINA/HYDRATION SURVIVAL SYSTEM</strong><br/>-Simple on the surface; complex behind the scenes.  Every degree of temperature, second spent sprinting through the heat, varying time of day, etc. will affect the player's characteristics.  As you fall to dehydration and exhaustion your vision will blur and your agility will diminish.<br/><br/><br/>**For best results do not play on integrated graphics**", "metacritic": null, "released": "2018-04-11", "tba": false, "updated": "2019-08-28T21:57:40", "background_image": "https://media.rawg.io/media/screenshots/e11/e11d3de0cf1e28d0925d48a1011da8c1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 15}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 437, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["juhbee"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["juhbee"], "esrb_rating": null}