{"id": 621246, "slug": "elemental-craft", "name": "Elemental Craft", "name_original": "Elemental Craft", "description": "<p>This game is the result of the GMTK game jam of 2021</p><p>THE FINAL BOSS FIGHT IS SUPER GLITHY (SORRY) I DID IT IN LIKE TWO HOURS SOOOOOO..... </p>\n<p>This game was made in scratch and I couldn't fit the aspect ratio so sorry if it looks a bit wonky, if someone knows how to fix it please put it in the comments, I would hugely appreciate it.</p>\n<p>It is a difficult puzzle game with a unique crafting mechanic combined with a dungeon crawler top-down style.</p>\n<p>Please play in Full Screen mode!!!!</p>\n<p>This game was made in less than two days and there were several things that I wasn't able to add that I really wanted to add, those include: A hint system, More levels, A tutorial, and cutscenes. Because I wasn't able to add those things in the small time frame I had I have different solutions. I will be releasing the full version of this game one day on itch.io for $0.50 or something like that. It will be free here for a few updates https://scratch.mit.edu/projects/543808519/ I would also recommend this link if the game is too buggy as this was made in scratch which does not support HTML builds, so I used a 3rd party program which could have resulted in some issues. I will be updating the scratch version of this game every once and a while but if it is functional please use the built in version for the jam so that I don't have any advantage.</p>\n<p>Since I wasn't able to create a hint system I am putting them here so if you don't want hints don't look passed this point...</p>\n\n\n<p>Hints</p>\n\n\n<p>Level 1: Search the chests to craft a weapon</p>\n\n\n\n<p>Level 2: Maybe try freezing the water to walk over it...</p>\n\n\n\n<p>Level 3: Harness the power of wind to blow the key under the spikes</p>\n\n\n<p>Level 4: Only lightning can disable the King Goblin's force field</p>", "metacritic": null, "released": "2021-06-13", "tba": false, "updated": "2021-06-14T22:05:28", "background_image": "https://media.rawg.io/media/screenshots/cc4/cc4c40f1737c629e738d518f358dffab.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 14, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Spider-Sam"], "genres": ["RPG", "Puzzle"], "publishers": [], "esrb_rating": null}