{"id": 62130, "slug": "make-it-rain-love-of-money", "name": "Make It Rain: Love of Money", "name_original": "Make It Rain: Love of Money", "description": "How fast can you make it rain? No, really… how fast??<br/>\n<br/>\r\nIt’s a fiendishly clever game, that’s too simple and too easy and too hard and too fun. But what does it all mean…<br/>\n<br/>\r\nWell, just start swiping and watch the money pile up. Hundreds, then thousands, then millions, then billions, then kili-billies, mega-billies, and beyond. But to get that much you’ll have to make some wise investments!<br/>\n<br/>\r\nMaybe you’ll invest in venture capital, loan sharking, or offshore drilling.<br/>\n<br/>\r\nMaybe you’ll start a lemonade stand or a casino or a clown college.<br/>\n<br/>\r\nOr maybe you’ll buy off a federal judge and watch the dollars roll in!<br/>\n<br/>\r\nOr maaaaaybe you prefer to die and share your patrimony with your descendency and be richer again but faster.<br/>\n<br/>\n<br/>\r\nSo swipe, swipe, swipe, swipe, swipe, swipe, swipe, swipe, swipe, swipe, swipe, swipe, swipe, swipe, swipe, swipe, swipe, swipe, swipe, swipe, swipe, swipe, swipe, swipe, swipe, swipe, swipe, swipe, swipe, swipe, swipe, swipe, swipe, swipe, swipe, swipe, swipe, swipe, swipe, swipe, swipe, swipe, swipe your way to glory.<br/>\n<br/>\r\nIs it a stupid game? Or are you just falling behind your friends and looking for excuses?<br/>\n<br/>\r\nOh, and don’t forget to get the bucket. Even someone as vibrant and dashing as you can’t keep swiping forever…", "metacritic": null, "released": "2014-04-01", "tba": false, "updated": "2022-09-29T23:21:43", "background_image": "https://media.rawg.io/media/screenshots/dde/ddef4c70f50619dda7c332602c518733.jpg", "website": "http://gametroopers.net", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 126, "dropped": 1}, "playtime": 1, "achievements_count": 12, "ratings_count": 4, "suggestions_count": 91, "game_series_count": 0, "reviews_count": 4, "platforms": ["PC", "iOS"], "developers": ["Space Inch", "Game Troopers"], "genres": ["Action", "Strategy", "Simulation", "Casual"], "publishers": ["Game Troopers", "Space Inch"], "esrb_rating": null}