{"id": 62140, "slug": "eswoosh", "name": "Eswoosh", "name_original": "Eswoosh", "description": "Eswoosh is a VR multiplayer kart-racing game with wheelchairs, featuring fast paced wheelchair-like controls and competitive racing gameplay. Do not play this game standing up unless you are trying to impress friends and loved ones with your ability to sustain head injuries.Key Features<ul><li>Race online against your friends, other people and AI<br/></li><li>Physically throw bombs and more at your opponents<br/></li><li>Customize your loadout with two out of several items to use during the race<br/></li><li>Choose your character, wheelchair and favorite color<br/></li><li>Race to reach the top of the leaderboards<br/></li><li>Flip people off<br/></li><li>Play online with up to 5 other human or AI players<br/></li><li>Risk getting a minor workout<br/></li><li>Witness level design on a level you've never seen before<br/></li><li>Beautiful programmer art</li></ul>WheelchairThe game offers a different way of moving around in VR by making you physically responsible for moving in the game. Only by making long swinging strokes with your arms to simulate pushing the wheels of a wheelchair will you be able to move. No more pressing a directional button to eerily glide along the landscape, or pointing somewhere and teleporting like a space-bending wizard from the future.<br/><br/><br/>Wheelchairs normally don't handle racing with sharp turns too well, and so our wheelchairs aren't very true to nature. The game has a learning curve, as moving and turning can challenge new players, especially those inexperienced with VR. There is an in-game tutorial that gives advice on the proper gestures to make to reliably gain speed and turn the wheelchair, and this should help any player along the way towards mastery. As you master the movement and get more comfortable, prepare for an exciting fast-paced experience as you drift around corners at high speeds.MultiplayerThis is a kill or be killed race. While trying to get to the goal as fast as possible, you also have to heed the uses and dangers of various items. Every racer has the Eswoosh lever, which when activated allows them to gain a sudden burst of speed - a strategy which can be used both tactically and moronically. Racers can also use various offensive and defensive items, such as bombs and shields. Each racer will be able to customize their loadout choosing two such items out of a roster of several, giving them three items to use when including the Eswoosh lever. All three of these regenerate over time after use, at different rates depending on the power of the item. The good players will reach the goal unharmed, and the bad and unlucky players will die a lot.<br/><br/><br/>Racers can also interact outside of the items. You get to choose between several wheelchair and character models to customize your look, and you get to choose which color your wheelchair, character model and in-game name has. Additionally you can bash into each other or land on top of each other to nudge, harass and damage wheelchairs. Most importantly, when the other racers are really getting on your nerves, or you feel your own harassment doesn't come with a sharp enough edge, you can also flip anyone off at any time.<br/><br/>LeaderboardsThe game features Steam leaderboards, where you can compete against other players for the fastest lap times and fastest race times on each individual level. These leaderboards can be filtered to see global scores, friends scores and personal scores. Because playing with other racers lead to fighting, dying and various occurrences of bad luck, there are also several types of leaderboards to account for different scenarios.<br/><br/><br/><ul><li> Solo Leaderboards: Leaderboards for those racing entirely alone<br/></li><li> Partial Race Leaderboards: Leaderboards for those racing with 1-4 other racers<br/></li><li> Full Race Leaderboards: Leaderboards for those racing with the maximum amount of racers (6)</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:57:39", "background_image": "https://media.rawg.io/media/screenshots/e8b/e8b3269f1a6c75684b88dbfd754b131e.jpg", "website": "https://www.classicmoose.com/games/eswoosh", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 135, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Classic Moose"], "genres": ["Racing", "Casual", "Indie"], "publishers": ["Classic Moose"], "esrb_rating": null}