{"id": 621473, "slug": "winchess", "name": "WINCHESS", "name_original": "WINCHESS", "description": "<p><em>WINCHESS is a 2-player chess-like digital boardgame inspired by the legends surrounding the Winchester Mystery House.</em>  Both players control a Sarah Winchester piece, three “casualty” pieces, and one Winchester Rifle.  All pieces can capture, and if your Sarah Winchester piece is captured, the game ends.  </p>\n<p>When casualties or Sarah Winchester are captured, they return as move-replaying spirits that haunt the board.  Spirits can only be seen with the crystal diviner—a special piece that switches control every 3 turns—but they are dangerous whether you can see them or not (spirits will capture any pieces if they linger on them).  Columns block all spirits’ movement (and also their captures).  Blocked spirits become enraged, and while they remain angry, the crystal shrinks each turn.  \r\n</p>\n<p>But the end of the current game isn’t the end: when Sarah Winchester is captured, a new game begins and all previous spirits remain.  Play continues until the crystal diviner sees the ghost of its owner’s Sarah Winchester.  When this happens, it shatters, and the next player to capture their opponent’s Sarah is the winner.  \r\n</p>\n<p>Alternately, if the crystal becomes too tiny to see, the spirits take over the house and both players lose!  (Beware poltergeist activity when the crystal is small).</p>\n<p>More complete rules are available in the \"Rules\" section of the game client.</p>\n<p>---------<br/></p>\n<p><strong>CONTROLS</strong></p>\n<p>Click a piece.  Green tiles show movement, red are enemies.  Drag a piece to a colored tile to move it.</p>\n<p>Right click any columns on your turn to rotate them.</p>\n<p>Hold down the Left Mouse Button for a couple seconds while over the crystal to start dragging it.  Release the button to drop it.  </p>\n<p>ESC exits the rules screen.</p>\n<p>---------</p>\n<p>The client linked to above is the local multiplayer version.  For a peer2peer multiplayer version that you can play with friends online, click here.  Both versions are WIP.</p>\n<p>The local multiplayer version is faster (ghosts move every time any piece moves and the board is more chaotic), while the peer2peer version is slower and more \"chess-like\", whatever that means!</p>\r\npeer2peerlocal( 1 ) ghosts move every other move<br/>( 2 ) ghosts can only interact with the player who killed them<br/>( 3 ) play over internetz<br/>( 4 ) slower, chess-like pacing<br/>( 5 ) maybe has higher-level strategy?( 1 ) ghosts move every time any player moves<br/>( 2 ) ghosts are visible to everyone and can kill everyone<br/>( 3 ) play locally and pass the mouse<br/>( 4 ) faster pacing <br/>( 5 ) inscrutable lunacy\r\n<p>---------</p>\n<p>CREDITS:</p>\n<p>Public domain images from pixabay and wikipedia.  Construct 3 rawks.  Thanks to chess for being such a dogshit game.  Big ups to everyone who got blasted by a Winchester rifle and chased Sarah around her labyrinthine estate.</p>", "metacritic": null, "released": "2021-06-13", "tba": false, "updated": "2021-06-14T22:55:18", "background_image": "https://media.rawg.io/media/screenshots/957/9571472ac49b924523dc4708c27c5822.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 56, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["miserytourism"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}