{"id": 62141, "slug": "bounty-battle", "name": "Bounty Battle", "name_original": "Bounty Battle", "description": "<p>OverviewBounty Battle is the indie fighting game -- a new multiplayer 2D fighting game, where you can square off as your favorite indie hero against other indie heroes from games like Guacamelee!, Darkest Dungeon, Dead Cells, and Psychonauts 2 among other awesome indies. The game features more than 30 character, each with their own companion Minion and unique abilities. It’s Super Smash Bros. meets indie games where you battle across levels inspired from indie game worlds with up to 4 players.CharactersBounty Battle showcases your favorite characters from these beloved indie games:<br />\nGuacamelee!Darkest DungeonPsychonauts 2Dead CellsAwesomenautsNuclear ThroneOwlboyAxiom VergeSteamWorld DigJotunSunderedBattle Chasers NightwarDeath’s GambitBlasphemousEITRSuper CombomanMutant MuddsOddmarPankapuFlinthookDoko RokoTower of SamsaraMookaBlubber BustersRad RodgersRuin of the RecklessThe Bug ButcherBlocks that MatterUndungeonThe Metronomicon<br />\nAnd more to be added! You won&#39;t find another indie mash up like this!The StoryA violent brilliance crosses the sky. . .  huge vortexes form above all worlds, caused by Ethereal Mana, a strange foreign material. It has bestowed magical powers to the chosen few.<br />\nNow is the time to decide who will control the Universe. Each world designates its champion - each with a bounty placed on their head. All worlds collide in this final confrontation to determine the fate of the Universe.<br />\nThis is the Bounty Battle.<br />\nBounty Battle was successfully crowdfunded on Fig by backers who could both pledge and invest in 2017.</p>", "metacritic": 33, "released": "2020-07-23", "tba": false, "updated": "2020-12-16T15:31:30", "background_image": "https://media.rawg.io/media/games/d7d/d7debf5ad85cd347b6c3cfd0493890ee.jpg", "website": "http://www.darkscreengames.com/bounty-battle", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 11, "toplay": 4, "dropped": 1}, "playtime": 0, "achievements_count": 44, "ratings_count": 1, "suggestions_count": 523, "game_series_count": 0, "reviews_count": 1, "platforms": ["Nintendo Switch", "Xbox One", "PlayStation 4", "PC"], "developers": ["Dark Screen Games", "DarkScreen Games"], "genres": ["Action", "Fighting", "Indie"], "publishers": ["Merge Games", "Fig Publishing"], "esrb_rating": null}