{"id": 621652, "slug": "project-invasion-demo", "name": "Project Invasion Demo", "name_original": "Project Invasion Demo", "description": "<p>Project Invasion is a strategy game inspired by games similar to Plants vs. Zombies. Enemies will work their way down several lanes with the goal of destroying your castle. Protect it by placing defenders and structures in order to kill or impede the invaders. </p>\n<p><strong>What makes Project Invasion unique:</strong></p>\n<ul><li>Rather than individual units, defenders are placed down in squads...each squad consisting of several units and a squad leader.</li><li>If the squad leader dies, units under his command will retreat.</li><li>Place squads on your castle's walls for a wider view of the battlefield and as a last line of defense.</li><li>Each squad has unlockable abilities to be used in combat (such as fire arrows for archers or resurrect for priests).</li><li>Each squad's unit and leader power can also be upgraded in between levels using earned upgrade points.</li><li>Structures are another defensive option, that when used effectively can turn the tide of the battle.</li><li>Squads, structures and abilities cost resources. Mine gold with your laborers and scavenge supplies from dead enemies.</li><li>Each level introduces either a new enemy type, a new defender type, or a new structure.</li></ul>\n<p>This game is still a work in progress and may or may not come to full fruition. Currently the first 10 levels are available. At this point I am just looking for feedback. Enjoy!</p>", "metacritic": null, "released": "2021-06-12", "tba": false, "updated": "2021-06-14T23:36:18", "background_image": "https://media.rawg.io/media/screenshots/5a6/5a649b00b5c518a6feadc0a4c262f2d2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 74, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ToastandBananas9"], "genres": ["RPG", "Strategy"], "publishers": [], "esrb_rating": null}