{"id": 62166, "slug": "how-to-date-a-magical-girl", "name": "How To Date A Magical Girl!", "name_original": "How To Date A Magical Girl!", "description": "Imagine if you had the opportunity to attend class at an elite academy for magical girls... Do you think you'd take the opportunity to make new friends? Learn magic? Or... Would you try and date a cute magical girl?<br/><br/>Although you show only a pathetic amount of magical talent, the academy has decided to let you in. You're not sure why, but this is probably a good opportunity to meet some girls! However, you only have one year to prove that you're suitable for the academy. You'll have to balance your studies and chasing girls in order to succeed!<br/><br/>Take time out of your busy schedule to go shopping, attend the debate club, work a part-time job or just relax and see the sights. The choice is yours!<br/><br/>As you get closer to winning the heart of your dream girl, you might find that not everything at the academy is what it seems.<br/><br/><strong>An overwhelming sense of foreboding hangs above the academy like a dark cloud.</strong><br/><br/>There's more to this place than the happy-go-lucky students are letting on...FEATURES<br/><ul><li> Meet a unique cast of magical girls. Select your favorite one and try to win her heart!<br/></li><li> Use your free time as you see fit. Study, practice magic, brew potions or just chill out.<br/></li><li> Get to know each girl by taking her out on dates. Give her gifts to improve her affection!<br/></li><li> Over 40 high-quality CG scenes.<br/></li><li> Lots of alternate costumes and outfits for each girl.<br/></li><li> Original soundtrack.<br/></li><li> In-game calendar system with special event days.<br/></li><li> Alchemy system for collecting and combining ingredients.<br/></li><li> Multiple endings.</li></ul><br/>", "metacritic": null, "released": "2019-02-13", "tba": false, "updated": "2019-08-28T21:57:38", "background_image": "https://media.rawg.io/media/screenshots/a3b/a3b83a83fa3e8c998da980821f17ebba.jpg", "website": "https://www.cafeshiba.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 5, "owned": 80, "beaten": 3, "toplay": 2}, "playtime": 4, "achievements_count": 30, "ratings_count": 3, "suggestions_count": 471, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC", "macOS"], "developers": ["Cafe Shiba"], "genres": ["Adventure", "RPG", "Simulation"], "publishers": ["Cafe Shiba"], "esrb_rating": null}