{"id": 621775, "slug": "dragging-your-coins-out-of-the-sewers", "name": "Dragging Your Coins Out Of The Sewers", "name_original": "Dragging Your Coins Out Of The Sewers", "description": "<p><em>\"The monarch has accidentally dropped you, a magical ruby, into the sewer entrance that is conveniently next to their chest. You have used enough magic to join yourself to the coins next to you, but you can only move one of them at a time. Click and drag coins on the screen to navigate your way out of the treacherous sewers, and make sure you return yourself and all the coins to your liege's coffers.\"</em><br/></p>\n<p>A short and mildly frustrating game made for GMTK game jam 2021, following the theme \"Joined Together\". Game made entirely by Indigoli<br/></p><p><strong>This game is intended to be played with a mouse and keyboard.</strong></p>\n<p>Art used either from Kenny or drawn for the jam.<br/>Music made in Beepbox.<br/>Fonts used from: https://managore.itch.io/m3x6 and https://w.itch.io/world-of-fonts<br/><br/>I had a really strong idea of what I wanted in this game, but as I started making it I began to realize it wasn't a lot of fun, and tended to feel more like a \"frustration game\", so I leaned into that aspect by keeping it short and hopefully difficult. The game has been checked so that you can't accidentally softlock, if you think you have gotten stuck try backing up and trying again, or moving a different coin in the chain. The lack of a \"mid-level\" restart button is on purpose, as is what happens when you complete the game.</p>\n<p>I hope you enjoy! Let me know your best scores or if you discover any movement glitches/techniques that can allow you to move extra fast!<br/><br/></p>", "metacritic": null, "released": "2021-06-12", "tba": false, "updated": "2021-06-15T00:09:21", "background_image": "https://media.rawg.io/media/screenshots/c0f/c0f39cfaa1f67b36f8be0d87a3fcb2e2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 76, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Indigoli"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}