{"id": 621838, "slug": "loneworld", "name": "LoneWorld", "name_original": "LoneWorld", "description": "Story:\r\n<p>In another universe, the <strong>[Gunkol]</strong> an oppressive alien race has control over the world.\r\nThey believe to be the supreme race and took advantage of the other creatures' skills for personal use, some have been captured as slaves, some become part of their food chain and others are constantly used for experiments to make their race's evolution process as fast as possible to the perfect race.<br/><br/>\r\nIn one of the <strong>[Gunkol]</strong> laboratory used for extreme mental experimentation,where drastic and cruel method were used to push the mental power of the creature to their limit with the only scope of extracting and collect DNA to be used on future breeding experiments, the laboratory as many other is managed by the <strong>[Evoph] </strong>a devoted race to the <strong>[Gunkol]</strong> not interest on government power as such but much more on the science with a side of sadism by seeing other creatures suffer,  those characteristic made them perfect workers for those tasks allowing the <strong>[Gunkol] </strong>to focus more on other important matters and let them do the dirty work. </p>\n<p>In the middle of an experiment aimed to enhance telepathic powers an innocent <strong>[Eken] </strong>named <strong>[Filt] </strong>unlock a gateway to another dimension using his telepathic powers, (not a common skill for an <strong>[Eken]</strong>) due to strange experiments that have been run on <strong>[Flit] </strong>in the past, have somehow evolved him to something much more than a common <strong>[Eken]</strong>. </p>\n<p>The gateway had been open for a few seconds but what they could see there made them excited due to their natural curiosity and ambition for science progress, part of the documentation of that day went destroyed so that they could keep this secret from the <strong>[Gunkol]</strong>  until they knew more on how to reproduce and stabilise the gateway.\r\nFrom that point <strong>[Flit]</strong> became a really valuable subject for the <strong>[Evoph] </strong> and the tests became more and more painful for him, so much that he would rather go back to his slave condition rather than support this one more time.</p>\n<p> Those feelings made his powers strangers, so much that he been able to open the portal one more time but this time something come out from it and made the laboratory on emergency status, this allowed <strong>[Flit] </strong>to escape the room and give him an opportunity to seek his freedom....\r\n</p>", "metacritic": null, "released": "2021-06-12", "tba": false, "updated": "2021-06-15T00:23:39", "background_image": "https://media.rawg.io/media/screenshots/c35/c3515583fa6feb266518b1fc1d89126b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 73, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Web"], "developers": ["Degrand"], "genres": ["Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}