{"id": 622006, "slug": "startup-tophat", "name": "Startup Tophat", "name_original": "Startup Tophat", "description": "<p>Migrated from its original page to Itch at long last, Startup Tophat is the debut Hindbodes game about an odd hat of indeterminate size which has to navigate a short but memorable gauntlet of three zones in an unexplained quest that requires you to learn challenging and awkward but fluid and ultimately rewarding controls. Startup Tophat was made in LÖVE using the inbuilt library that you probably know as Box2D, using this and other compromises to work around my inexperience of the year 2018. The result is an unusual game where instead of the controls making the main character jump and walk in a rigid and \"normal\" platformy way, the four arrow keys being used will behave more like moving a paper bag around with a blow-dryer, and your jumps come in threes every time you come to rest on the vertical dimension. The hat can also freely rotate, which is a movement completely controlled by nuance and the interactions of your inputs with gravity, physics, and the environment.<br/></p>\n<p>Try it, though. The game is better than I just made it sound, and is completely free, and is weirdly good for a first game, unless you count Bunny Horrors as the first Hindbodes game...</p>\n<p>Eventually, under Rodent Predator, this game will be getting an upgraded version built called Startup Tophat: Deluxe Edition, which will be paid. The deluxe edition will play very much the same way, but that game is not this game. This game has no paywall. This game awaits.<br/><br/><br/></p>", "metacritic": null, "released": "2021-06-12", "tba": false, "updated": "2021-06-15T01:07:40", "background_image": "https://media.rawg.io/media/screenshots/114/1140b1f6c4aaaae7571c17821b633856.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Hindbodes"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}