{"id": 622185, "slug": "umwelt-demo", "name": "Umwelt-Demo", "name_original": "Umwelt-Demo", "description": "<p>To improve computational thinking skills and second language acquisition in primary schoolers whose learning has been impacted by COVID-19, Umwelt presents a game that simulates real-life interactions and simple tasks (e.g., collecting several items given in the form of a computation problem, selecting an object with an identified color)  to demonstrate the place of computation and language in everyday life through an XR system. The game consists of challenges that test the abilities of kids to break problems down into smaller parts, recognize patterns and important details amongst them, and develop step-by-step strategies to solve these challenges. These problems will require sizable amounts of interaction where kids will gain language learning skills in addition to computational thinking skills. Umwelt is built on the fundamentals of Krashen's Theory of Second Language Acquisition (SLA) and Natural Language Processing (NLP) systems. Noting the portability of Umwelt, children will have the opportunity to tackle problem sets and immerse themselves in new languages wherever they feel most comfortable and confident. The implemented Interactive Voice Response (IVR) system will guide users as they continue to understand the given questions, solve the tasks and familiarize themselves with these applications. Children will be able to enhance their computational abilities through these interactive activities. This method of gamification takes advantage of XR technology to provide all the necessary grounds for learning through games, a channel common amongst children. These principles, coupled with creative problem sets, prepare students for the immediate future based on Computer-Human Interaction while simultaneously raising them as world citizens. Considering the impact of COVID-19, houses have become the new learning environments of primary schoolers, and Umwelt’s XR based structure builds on this by bringing the world to these children.</p>", "metacritic": null, "released": "2021-06-11", "tba": false, "updated": "2021-06-15T01:49:09", "background_image": "https://media.rawg.io/media/screenshots/756/756ed32b04c924e7e489ae7535371a54.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 77, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["LesPoar"], "genres": ["Simulation", "Educational", "Puzzle"], "publishers": [], "esrb_rating": null}