{"id": 622197, "slug": "trans-sphere", "name": "Trans Sphere", "name_original": "Trans Sphere", "description": "<p>French version below English one<br/></p>\n<p>This Game was made for Game a week challenge #3 organised by Evans from Game Dev Teacher ( https://www.youtube.com/c/GamedevTeacher ).\r\n </p>\n<p>Theme was \"Transformation\".\r\n  </p>\n<p>In this game you're goal is to reach the finish line as quicly as possible !\r\n  </p>\n<p><strong>IDEA\r\n</strong>\n</p>\n<p>This is my second game, so I decided to keep KISS principle for this game.\r\n </p>\n<p>I start with a simple shape that I could transform. I wanted to use cube, sphere plane and base game play around transformation of this shape, but I finally decided to only to manage Sphere as ball. And enable user to change its size and weight to run through the race.<br/></p>\n<p><strong>What went well</strong><br/></p>\n<p>I never be blocked. I success in simplify my task, to finally deliver something, as near as I have in mind.<br/></p>\n<p><strong>What went wrong</strong></p>\n<p>I wanted to add a lot more traps and puzzle to solve thanks to size of ball, but time is running out and I had to make concessions. I also wanted to work more on tweak and gameplay adjustement. <br/>\n</p>\n<p><strong>What I learned\r\n</strong>\n</p>\n<p>A lot of things :) First physics mecanism, second decals and finally some FX for smoke. I also be able to make a boilerplate that I will be able to re use in future GAWC.</p>\n<p>En français<br/></p>\n\n<p>Ce jeu a été conçu pour le Game a week Challenge #3 organisé par Evans de Game Dev Teacher ( https://www.youtube.com/c/GamedevTeacher ).<br/>Le thème était \"Transformation\". Dans ce jeu, votre objectif est d'atteindre la ligne d'arrivée le plus rapidement possible ! <br/></p>\n<p>IDÉE <br/></p>\n<p>C'est mon deuxième jeu, j'ai donc décidé de garder le principe de KISS pour ce jeu. Je commence avec une forme simple que je pourrais transformer. Je voulais utiliser le cube, le plan et la sphère de base autour de la transformation de ces formes, mais j'ai finalement décidé de ne gérer que la sphère comme une balle. Et de permettre à l'utilisateur de changer sa taille et son poids pour éviter les obstacles tout au long de la course. <br/></p>\n<p>Ce qui s'est bien passé : Que je ne sois jamais bloqué. Je réussis à simplifier mes tâches, à livrer quelque chose, aussi proche que ce que j'avaisi en tête. <br/></p>\n<p>Ce qui ne s'est pas bien passé : Je voulais ajouter beaucoup plus de pièges et d'énigmes à résoudre grâce à la taille de la balle, mais le temps presse et j'ai dû faire des concessions. Je voulais aussi travailler davantage sur les réglages et les ajustements de gameplay. <br/></p>\n<p>Ce que j'ai appris : Beaucoup de choses :) Premièrement la physique dans UE, deuxièmement les decals et enfin quelques effets pour la fumée. J'ai aussi créé un squelette applicatif que je pourrai réutiliser dans les futurs GAWC.</p>\n\n<p><strong>ISSUES</strong>\n</p>\n<p>it remains some issues that I will fix later :\r\n </p>\n<ul><li> Physics is not really accurate, but this problem enable to take a lot of shortcut ;)</li></ul>\n<p><strong>Next Features</strong>\n</p>\n<p>Will be added if I have time :\r\n </p>\n<ul><li>options menu\r\n</li><li>a better physics</li><li>more trap and puzzle challenging weight &amp; size transform </li><li>High Score billboard\r\n</li><li>more Levels</li></ul>", "metacritic": null, "released": "2021-06-11", "tba": false, "updated": "2021-06-15T01:52:04", "background_image": "https://media.rawg.io/media/screenshots/9e2/9e220801dace6e6ee18be36f60752cb3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 34, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["LoganBlack"], "genres": ["Racing", "Platformer"], "publishers": [], "esrb_rating": null}