{"id": 62223, "slug": "stories-in-stone", "name": "Stories In Stone", "name_original": "Stories In Stone", "description": "An RPG about a tribe exploring an ancient world.  Forge a bond with your wolf and help your tribe survive!  <br/>You must settle in a new land, so collect resources, train with your master, and grow stronger by learning powerful skills!!<br/><br/>For those just looking to experience the story, there are 2 distinct modes.<br/><br/><ul><li>\tFull rpg experience with combat (10-18 hours), or…<br/></li><li>\t“Adventure Mode” (4-6 hours), which removes the element of combat and strategy, <br/>        but leaves the story, puzzles, and exploration to enjoy!Key Features/Mechanics<ul><li>\tA cave painting come to life!<br/><br/></li><li>\tMost progression comes from exploration,  find items to raise your stats.  Some of the best skills require items to learn too, so choose wisely!<br/></li><li>\tHeal in between battles by eating/hunting the small animals such as bats, squirrels, and lizards.  Also recovers SP used for many skills, so you can keep on moving.  Just make sure to have enough stamina in order to DASH.<br/></li><li>\tMany skills push or pull enemies. This changes what skills they can use in battle as well as some stats.   Line them up strategically to hit multiple enemies with a single attack!<br/></li><li>\tTimed button presses are needed for some skills, so stay on your toes!<br/><br/><br/></li><li>\tOpen progression system:<br/> </li><li>Animals in your party can be upgraded by finding items.  Their HP and SP will go up with each level but the other stats are up to you!<br/> </li><li>Choose many new skills to learn with EV points, even from the start!  Create some powerful synergies with your team!<br/><br/></li><li>\tPuzzles and variety in every area:<br/> </li><li>Use clues in your journal to solve various puzzles.  Or just figure them out on your own… maybe…<br/> </li><li> Use various plants in the environment to refill stamina instantly, see hidden tracks, or gain temporary power<br/><br/></li></ul><ul><li>\t2 versions; one for RPG veterans and one for those who just want to experience the story<br/></li><li>\t10-18 hours to complete the game in the normal version</li></ul>Developer Profile:<br/><br/>I am a therapist in Santa Ana, California.  I currently live with my wife, two cats, and one dog. <br/>This is my first game, To Ash.  I’m a life-long gamer, (growing up with two brothers, we played a ton of different games) and an RPG lover. I worked on this by myself, but had input from testers, family, and friends.  Big thanks to the creators of many useful plugins too!<br/><br/>So you know where some of my influences come from, some of my favorite games are; Castlevania, Mario RPG, Panzer Dragoon Saga, Smash Bros., ‘Tales of’ games, Zelda, and Albert Odyssey.</li></ul>", "metacritic": null, "released": "2018-08-08", "tba": false, "updated": "2019-08-28T21:57:36", "background_image": "https://media.rawg.io/media/screenshots/46c/46c654820bc8738562ed63a042f5912c.jpg", "website": "https://16bitpsych.wordpress.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 257, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["16 Bit Psych", "Kyle B"], "genres": ["Adventure", "RPG"], "publishers": ["Self-Publish"], "esrb_rating": null}