{"id": 622223, "slug": "shadow-tag", "name": "Shadow Tag", "name_original": "Shadow Tag", "description": "<p>\"Only one color, but not one size<br/>\r\nStuck at the bottom, but easily flies<br/>\r\nPresent in sun, but not in rain<br/>\r\nDoing no harm, feeling no pain<br/>\r\nWhat am I?<br/></p>\n<p>A shadow.\"</p>\n\n<p>In a certain part of the world, the awakening, individuation, and separation of the shadows of learned witches is a rite of passage. Penn, a witch's apprentice, woke up to a surprise one night: their shadow has awoken early...<br/><br/>\r\nShadow Tag is a 2D light-based block-pushing puzzle game, in which Penn and their newly-awoken shadow Umbra must enter the Shapes Dimension to recover the Severing Scissors!</p>\n<p><strong>CONTROLS:</strong></p>\n<p>WASD - movement</p>\n<p>L - toggle light</p>\n<p>Spacebar - Grab wooden blocks</p>\n<p>OBJECTS:<br/><br/>   <br/>Wooden Box: Can be pushed or pulled. Creates a cube in the shadow world that Umbra can jump on.<br/></p>\n<p> <br/>Mimic: Can't be pushed or pulled. Creates a cube in the shadow world that Umbra can jump on.</p><p>   <br/>Shapes Container: Can be pushed or pulled.  Creates a cube in the shadow world with spikes that will banish Umbra if touched. The spikes can be covered by other shadows to bypass it.<br/>   <br/>Prism: Can be pushed but not pulled. Moves shadows of objects it is put in front of. The shadow will be moved different amounts based on how close or far away it is to the object. 1 being the farthest and 3 the closest.<br/>   <br/>Glass: Can't be pushed or pulled. Prevents Penn's movement but does not cast a shadow. Can be told apart from a prism by its clear base<br/> <br/>Barrels: Can't be pushed or pulled. Creates a cube three tiles tall in the shadow world. Can perhaps be helpful in creating a way to climb?<br/>   <br/>Switch: Activate this switch with \"L\" in the light world to turn on the light and summon Umbra. Other switches found throughout the level  can be activated with \"L\"</p>\n<p>   <br/>Rough Terrain: Blue rocky terrain that prevents the sliding of objects. Penn can move freely over this terrain.<br/></p>", "metacritic": null, "released": "2021-06-11", "tba": false, "updated": "2021-06-15T01:59:28", "background_image": "https://media.rawg.io/media/screenshots/433/4335b1784083392872be998dae1df055.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 2, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["LandsharkRAWR", "LFOB", "cobaltexe", "Makers From Smile's", "sofsh", "infinitebrians", "worldparty", "Q-Bit", "Lady Saytenn", "Mech64", "Princess Madelyn", "JUST WHATEVER, IDK"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}