{"id": 62224, "slug": "beard-axe", "name": "Beard & Axe", "name_original": "Beard & Axe", "description": "Beard and Axe is a top-down, action adventure rogue-lite from Dwarfaparte, a one man indie dev.<br/>\n<br/>\r\nThe Dwarf King of Half-Axe Hold has decided that his time to rule has grown overlong, and drinks from the ancient beer cask. Creeping up slowly from his feet, the King's body turns to stone, preparing his entry into the hall of ancestral rulers that preceded him. All would be successors will need to swear and fulfill many oaths if they wish to rule the hold.<br/>\n<br/>\r\nAs Old Beard, you will venture out into the world above to recover your clan's lost relics, collect magical powders and ammunitions, and fight a wide variety of foul creatures. Failure means loss of the honor that has been added to your clan name through the ages, and if too much is lost, your quest will be over before you can complete it!<br/>\n<br/>\r\nBut it's not as simple as it seems.<br/>\n<br/>\r\nBefore each quest you decide to embark upon, you must swear and sign solemn oaths. Going to the lost mines? How much black powder will you bring back? How many balls of shot? Will you be attempting to recover your families ancestral rune stein? Even if you survive and make it back to the exit, if you lack even one of the amount you swore to return with, you'll lose half of everything you carry and any artifact you found!<br/>\n<br/>\r\nOther dwarfs also are fulfilling their own oaths, and if you're not quick enough, instead of becoming king, you'll end up as one of their thanes or (beards forbid!) merely master of arms. To become king, you'll not only need to fulfill your oaths to the letter, but complete them all before your competitors!<br/>\n<br/>\r\n- A challenging rogue lite adventure<br/>\r\n- Decide how much you want to achieve and bring how much you want to risk on each quest<br/>\r\n- Use various magic gun powders and runic bullets to gain an advantage over 50+ unique enemy types<br/>\r\n- Drink Dwarven Ale to restore your health, just remember too much can lead to poor aim and tripping over your own beard!<br/>\r\n- Procedurally generated levels for every adventure<br/>\r\n- Irondwarf mode! (Yes it's Ironman mode)<br/>\r\n- 4 unique endings", "metacritic": null, "released": "2018-07-12", "tba": false, "updated": "2019-08-28T21:57:36", "background_image": "https://media.rawg.io/media/screenshots/054/05493953fe3d4903203473682f70b0ab.jpg", "website": "http://dwarfaparte.com/beardandaxe/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 274, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dwarfaparte"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Dwarfaparte"], "esrb_rating": null}