{"id": 622393, "slug": "without", "name": "Without", "name_original": "Without", "description": "<p>Documento de diseño</p>\n\n\n<p><strong>High concept</strong><br/></p>\n<p>Without es un juego de plataformas 2D ambientado en un futuro donde nuestro planeta agotó sus recursos y los residuos tóxicos amenazan la vida, nuestro protagonista se embarca en la aventura de subir a la torre más alta, para esparcir un antígeno que frenará las toxinas. </p>\n\n<p><strong>Unique selling points</strong></p>\n<ul><li>Se plantea una problemática singular en el que los problemas sociales están solucionados, pero el cuidado del medio ambiente se ignoró por completo.\r\n</li><li>Propone un reto de mejorar siempre el puntaje en el cual se completa el juego.  \r\n</li><li>Mecánicas de desplazamiento pulidas las cuales tienen importancia a la hora de mejorar el tiempo en el cual se completa el juego.\r\n</li><li>Escenario con un estilo gráfico atractivo y correspondiente con la historia planteada en el juego.\r\n</li></ul>\n\n<p><strong>Synopsis</strong></p>\n<p>En un futuro muy cercano la humanidad ha llevado al límite de la extinción los recursos naturales, las grandes empresas se apoderaron de la mayor parte de las zonas habitables de nuestro planeta, generando una enorme e incontrolable cantidad de residuos tóxicos que amenazan con la vida de la raza humana. Como contramedida, los científicos crearon una cápsula capaz de eliminar los efectos que causa la contaminación ambiental en el cuerpo humano, convirtiéndola en la única forma de sobrevivir dentro de nuestro planeta.\r\n</p>\n\n<p><strong>Game objective</strong></p>\n<p>El objetivo del juego es subir lo más alto posible, sin tocar los barriles tóxicos y tomando las capsulas para no quedarse sin aire, ayudándose de las plataformas sobresalientes de los edificios.</p>\n\n\n<p><strong>Serious objective</strong></p>\n<p>Se busca crear una reflexión en el jugador sobre qué pasaría si no se le presta el cuidado necesario al medio ambiente, mostrando un futuro distópico donde el aire es tóxico, las ciudades han crecido en base a la explotación sin cuidado de los recursos naturales.</p>\n\n\n<p><strong>Game rules</strong></p>\n<ul><li>Se tienen un número limitado de vidas, las cuales son marcadas por un número de corazones, se pierde vida al tocar los barriles tóxicos.\r\n</li><li>El jugador opcionalmente puede tomar unos elementos a medida que juega los cuales le darán más puntuación\r\n</li><li>Además del sistema de vidas que tiene, existe una barra que baja con el tiempo, si se acaba la barra, el juego termina. Para recargar la barra el jugador debe tomar unas capsulas regadas por el mapa.\r\n</li></ul>\n\n\n<p><strong>Gameplay</strong></p>\n\n\n\n<p><strong>HUD</strong></p>", "metacritic": null, "released": "2021-06-11", "tba": false, "updated": "2021-06-15T02:41:14", "background_image": "https://media.rawg.io/media/screenshots/b06/b065f262d84a3bcb2634f1d9c1032e71.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 104, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["chernandez115"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}