{"id": 62235, "slug": "teleblast", "name": "TeleBlast", "name_original": "TeleBlast", "description": "TELEBLAST is a fast-paced, local multiplayer, combat game set in a time of explosive teleportation. Up to 4 players can take to the arena to try to outplay and outblast their opponents in a round-by-round battle for supremacy.<br/><br/>Each player will be in control of a teleporter which they can shoot out and then activate to teleport to with the distance that the teleporter traveled influencing the size of the resulting explosion.<br/><br/>So do you remain mobile by teleporting short distances but only causing small explosions or do you remain immobile and cause a massive explosion trapping your opponents with nowhere to go?<br/><br/>The game features a wide array of maps, game modes, and modifiers that allow you to customize your game and keep each match fresh and exciting. The simple concept will keep you and your friends engaged for hours!Features<br/><ul><li><strong>Easy to grasp hectic multiplayer action.</strong> New players can pick up and play quickly and easily through intuitive controls and simple mechanics.<br/></li><li><strong>A wide range of maps to play.</strong> Challenge each other on a number of maps with more on the way; each of which can be customised with different colours and backgrounds.<br/></li><li><strong>Multiple game modes and modifiers under development.</strong> The simple gameplay can be modified and customised to your liking with more options always being added.</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T17:04:49", "background_image": "https://media.rawg.io/media/screenshots/9e7/9e7683eef6d1635428e2078c01071c62.jpg", "website": "https://teleblastgame.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 37, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Tim Veletta"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Tim Veletta"], "esrb_rating": null}