{"id": 622459, "slug": "andrew-cox-prototypes", "name": "Andrew Cox - Prototypes", "name_original": "Andrew Cox - Prototypes", "description": "<p><strong>Challenge 1:  Changing Seasons</strong></p>\n<p><strong> WhaleLife </strong></p>\n<p>Avoid the trawlers as you explore the ocean, find your friends and get to a safe place. </p>\n<p>The idea for this game came from whale season. You play as a whale that doesn't want to get caught, on your journey you will find other whales that are in the same situation.  You explore the oceans and try find a safe place to live. </p>\n<p><strong>Challenge 2: Space (one click)</strong></p>\n<p><strong>Space Man</strong></p>\n<p>The ship is on FIRE, get to the hatch to make it out safe. </p>\n<p>This game only uses one button to thrust the player upwards. You must dodge the oncoming obstacles to get to the hatch. The game is not available for download as there was too many bugs. Sorry</p>\n<p><strong>Challenge 3: Revenge Racing (single screen) </strong></p>\n<p><strong>Race to the Top</strong></p>\n<p>First to the top is the rotten egg, well not really, they are the winner. </p>\n<p>This game is 2 players, you can use one keyboard for both players to battle it out. The players can shoot at each to slow them down (damage is not implemented in the game yet) Race them to the star to win. </p>\n<p><strong>Challenge 4: Tangible Media</strong></p>\n<p><strong>School Bus Run</strong></p>\n<p>We're late, got to get those kids to school  </p>\n<p>In this game your aim is to get the school bus to school without crashing. On the way there are bus stops where you can pick up kids. You would use your voice to control the bus with a simple \"go\" and \"stop\" unfortunately I could not get this function to work, to control the bus you use the arrow keys. </p>", "metacritic": null, "released": "2021-06-11", "tba": false, "updated": "2021-06-15T02:59:02", "background_image": "https://media.rawg.io/media/screenshots/d10/d1011a6ba3d86f9d33ac638aa166c263.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 87, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS"], "developers": ["Experimental Game Design"], "genres": [], "publishers": [], "esrb_rating": null}