{"id": 622570, "slug": "arena-tactics", "name": "Arena Tactics", "name_original": "Arena Tactics", "description": "Enter the Arena to fight in real-time in exciting PVP battles with players from all over the World. <br/>Use Champions from various myths and folklore, lead them on the battlefield in a turn-based and fast-paced tactical strategy battle.<h3>TURN-BASED STRATEGY BATTLE</h3><br/>Control your Champions on the hexagonal battlefield, the fast and fun battle system is easy to play but hard to master. Each Champion has a full set of abilities, stats and a specific playstyle.<h3>GLORY ROAD &amp; BATTLE PASS</h3><br/>Fight and progress in the game to unlock rewards, Champions and special prizes<h3>UNLOCK AND UPGRADE CHAMPIONS\t</h3><br/>Dozen Champions to collect, upgrade and level up for multiple strategies and combinations.<h3>FEATURES</h3><h3>● 18 Champions (and Counting)</h3><h3>● 3 Factions: Heroes, Monsters and Gods</h3><h3>● Unlock, Level Up and Upgrade Your Champions</h3><h3>● Send your Champions to special missions for great rewards </h3><h3>● 4 PvP modes </h3><h3>● eSports mode </h3><h3>● Global Rankings </h3><h3>● Players Clans and Chat </h3><h3>● Progress in Brawl Pass and Glory Road to claim great rewards </h3>● Challenge 40 adventure puzzling stages for perfect completion/h2]<h3>Please Note</h3>● Arena Tactics is currently in beta testing, under heavy development and with fast updates, don’t lose the chance to give your feedback from your game experience<br/>● Arena Tactics is free to download and play, some in-app items can also be purchased for real money. In-app purchases can be disabled through your device’s settings.<br/>● Network connection is required to play", "metacritic": null, "released": "2021-06-14", "tba": false, "updated": "2021-06-18T02:59:49", "background_image": "https://media.rawg.io/media/screenshots/a69/a697dffaacd515604715d9af46e4f4ab.jpg", "website": "http://www.arenatacticsgame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 107, "toplay": 1, "dropped": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 307, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Camex Games"], "genres": ["Strategy"], "publishers": ["Camex Games"], "esrb_rating": null}