{"id": 622568, "slug": "brytag-studio", "name": "Brytag Studio", "name_original": "Brytag Studio", "description": "Brytag STUDIO is a revolutionary Free To Play creative experience. STUDIO is an open world sandbox application allowing you to create your world and tell your story. <br/><br/>Your Story is the Game.<br/><br/>With a fantasy theme, you pick your characters, props, weapons, and action.  Control time to pose and manipulate the moment in order to create the perfect shot. You can create your own landscape and even control the time of day.<br/><br/><strong>Nvidia RTX Required</strong><br/><br/>As a CG artists with nearly 20 years of film credits, the developer is excited to bring cutting edge raytracing technology previously reserved to big budget blockbuster films to your fingertips.<br/><br/>Brytag STUDIO is built by movie lovers for movie lovers and story tellers. STUDIO allows you to:<br/><br/><ul><li> Add trees/rocks/shrubs/etc to build out your own environment.<br/></li><li> Choose between a variety of skins for your character.<br/></li><li> Customize your character with a variety of weapons.<br/></li><li> Choose the actions for your character.  You can then use time control to pick the perfect pose.<br/></li><li> Dynamic lighting controls.<br/></li><li> Control camera depth of field and fog for the perfect cinematic shot.</li></ul><br/>STUDIO is Early Access and so has some rough edges and there is a long list of features we would like to add.  I look forward to hearing your feedback so we can build this studio together!", "metacritic": null, "released": null, "tba": false, "updated": "2021-06-18T02:58:27", "background_image": "https://media.rawg.io/media/screenshots/95c/95c81561cc59fccf2ca8bf471e51e4ac.jpg", "website": "https://brytagstudio.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 173, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Brytag Creative"], "genres": ["Adventure", "Simulation"], "publishers": ["Brytag Creative"], "esrb_rating": null}