{"id": 622611, "slug": "dice-tactics", "name": "Dice Tactics", "name_original": "Dice Tactics", "description": "Do you have what it takes to battle the undead horde of the Necros? To find the artifacts of an ancient world? To change the course of history?<br/>\r\nJourney through the campaigns of Dice Tactics to explore the world, harness your power and use the power of mystical objects for good or evil. Local Tavern Masters will guide you through the stories of this unique mobile board game.<br/>\n<br/>\r\nFAMILIAR MECHANICS, NEW DEPTH<br/>\r\nDICE TACTICS delves deep into dice mechanics to create a brand new tabletop-like experience that is designed specifically to play as an RPG. We worked hard to design an immersive dice experience, where each roll shows the dice spin across the screen then skip until finally landing on a number - just like physical dice. The 3-D polyhedral dice are crafted to also incorporate roll effects like blaze a trail of fire or spark upon landing or several other neat visual impacts.<br/>\n<br/>\r\nCRAFT YOUR OWN STORY<br/>\r\nYou decide where the story goes by choosing the next move: Do you burn the bandit camp? Do you take the shortcut through the dark forest? And many other choices!<br/>\n<br/>\r\nYOU KNOW WE GOT THE LOOT<br/>\r\nAfter every battle, you earn the chance to collect dice. In turn, these dice can be used to roll for upgrades. Some of the upgrades for the current version can increase the number of turns for your character or make weapons hit harder.<br/>\n<br/>\r\nLORE<br/>\r\nRelics, magics, and Undead, oh my! The official history of Kalheed as written by the empire. Click on the Ancient Texts to the right to read on.", "metacritic": null, "released": "2021-06-16", "tba": false, "updated": "2021-06-18T03:27:49", "background_image": "https://media.rawg.io/media/screenshots/b82/b82d310d22c7fd21a51f178aef4eaf03.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 157, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Game Wave Studios"], "genres": ["Adventure", "RPG", "Strategy", "Indie"], "publishers": ["Game Wave Studios"], "esrb_rating": null}