{"id": 622685, "slug": "centerfire-musical-dna", "name": "CenterFire - Musical DNA", "name_original": "CenterFire - Musical DNA", "description": "Musical DNA’s CenterFire™ is a Tap Along music game that lets you play along with and see the magical, hidden language of music!<br/><br/>Music is actually 'shapes fitting together' like pieces of a puzzle.  Musical DNA® successfully reveals this beautiful puzzle — for the very first time — letting you see how music really works!<br/><br/>CenterFire comes with 13 songs — with multiple games per song — providing a rich, initial gameplay experience.<br/><br/>• Score points based on Accuracy.<br/>• Earn Multiplier Streak Bonuses.<br/>• Master three different types of Mini Challenges.<br/>• Earn up to four different types of Medals per Song ‘Part’.<br/>• Build up your musical ‘expertise’ and gradually increase your Musical Lifetime ‘Rank.’<br/>• Keep track of your musical accomplishments in your MDNA Trophy Case.<br/>• Work on particularly difficult game passages in the Practice Area.<br/>• Create (and recall) any number of new CenterFire users on your device.<br/><br/>And MOST IMPORTANTLY — Watch all of your song parts overlap in one, Beautiful Musical Experience — in the 3D Musical DNA Viewer!<br/><br/>A growing catalog of music is available in our MDNA Music Store!<br/><br/>Every piece of music in the world — no matter the genre — no matter the style — all comes from the same, Universal Language!  <br/><br/>Have fun exploring, and be on the lookout for a few more surprises we thought it would be best for you to discover on your own! <br/><br/>We hope you enjoy Musical DNA’s CenterFire and that it furthers your appreciation and understanding of our Shared Musical Language!<br/><br/>[If you are a musician and would like us to ‘light up’ your music in our MDNA Store, please email us at: info@musicaldna.com]", "metacritic": null, "released": "2016-01-28", "tba": false, "updated": "2021-06-18T04:23:12", "background_image": "https://media.rawg.io/media/screenshots/1a2/1a2cf6ad3b90a95f49f6f4177f7ae0c0_yKqVNB7.jpg", "website": "http://musicaldna.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 141, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Musical DNA"], "genres": ["Casual"], "publishers": ["Musical DNA Software"], "esrb_rating": "Everyone 10+"}