{"id": 622661, "slug": "office-love-affair", "name": "Office Love Affair", "name_original": "Office Love Affair", "description": "Office Love affair - This is a casual game with a wide variety of puzzles. A guy that looks for a job, stumbles upon a vacancy announcement at a sex toy company. Gathering the rest of his courage, he decides to try his best and successfully passes the casting. He gets into female staff, where he is captured by the abyss of erotic desires with each of them.<br/>Will he be able to bring them to life? The fate of the main hero is now in your hands!<br/><br/><br/><br/><strong>Features:</strong><br/><br/> - 4 sexy girls who have the boss is in charge of them<br/>-Every girl is trying to conquer your attention, with her beatiful body and charm<br/>-Each girl is just like a puzzle, if you manage to solve her - you will get the coveted key to her body<br/>-Skimpy outfits and voloptuous shapes<br/>-Exciting mini-games with each girl that will help you to close the distance between you.<br/>-The atmosphere is full of flirt and sexual provocations<br/>-Musical accompaniment which creates the right mood throughout the game<br/><br/>:<br/><br/><strong>Characters:</strong><br/><br/>-Kate - is a girl with a strong character who knows what she wants and gets it. But at the same time she is compassionate to others and if you tug on her heartstrings, you can get almost everything you want from her.<br/>-Emily - despite her pretty appearance, she suffers from loneliness. All of her relationship ended in a week and the men who used her left her with a broken heart.<br/>-Phoebe - a real fan of BDSM. She finds her victims in a night clubs, baiting them to her house, where she literally sucks all the juices out of them.<br/>-Boss - a moderately strict and generally pleasant girl. Loves a relaxed atmosphere in a team. She is always there for you to help with an advice. Smart, that's why it is very hard to find her a man.", "metacritic": null, "released": "2021-06-17", "tba": false, "updated": "2021-06-18T04:07:19", "background_image": "https://media.rawg.io/media/screenshots/a50/a502e8b1a3509ec396689a43469a49c7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 5, "ratings_count": 0, "suggestions_count": 272, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["hungrykittystudio"], "genres": ["Adventure", "RPG", "Casual", "Indie"], "publishers": ["hungrykittystudio"], "esrb_rating": null}