{"id": 622694, "slug": "speed-square-slide-puzzle", "name": "Speed Square: Slide Puzzle", "name_original": "Speed Square: Slide Puzzle", "description": "A creative twist on the world-famous Rubik's Cube, Speed Square is an exciting and challenging slide puzzle game! The rules are simple: swipe to move the tiles on the board until there's only one color in each row or column.<br/><br/>If you are a fan of classic color matching games, this new twist on the Rubik’s cube is here to offer you endless hours of fun. Whether you are an adult or a young player, this color matching game will challenge your strategic gaming skills as well as your patience.<br/><br/>This brain training game is designed to challenge your puzzle solving skills, so you can practice your abilities and join the ranks of leading tile matching players on the Game Center leaderboards. You will be presented with a new color arrangement in every new level to make the most of your strategic puzzle solving experience.<br/><br/>TWO GAMEPLAY MODES<br/><br/>Quick Play: Solve the puzzle faster and faster to rank up on the global leaderboard!<br/><br/>Levels: Solve each level to unlock the next one. In this strategic mode, some tiles have a limit on the number of times you can move them. There are four difficulty options for players of all skill levels!<br/><br/>MORE FUN FEATURES<br/><br/>- Game Center leaderboards for all gameplay modes<br/>- Cool new Game Center achievements to unlock and enjoy in the color matching puzzle<br/>- Swap power-ups to use if you get stuck in the challenging brain training levels<br/>- Includes an unlimited number of puzzles and levels<br/>- Simple and easy to play sliding puzzle game UI/UX<br/><br/>MADE FOR EVERYONE<br/><br/>- Fun for all ages<br/>- Includes colorblind mode<br/>- Supports dark mode<br/>- Available in 10 languages<br/>- Works with VoiceOver<br/><br/>Are you looking for a modern match puzzle that follows the classic rules? Would you like to participate in endless sliding puzzle challenges? With this brand new brain training Rubik’s cube variation, you can unlock new levels of your mental potential. Whether you are looking for new color matching puzzle skills or you want to play a challenging brain training game to sharpen your skills, this creative tile matching game is the perfect pick for you.<br/><br/>Download and play Speed Square – Rubik’s Solver Block Puzzle today!", "metacritic": null, "released": "2021-06-14", "tba": false, "updated": "2021-06-18T04:27:21", "background_image": "https://media.rawg.io/media/screenshots/735/735225526958e9d97fba6d6bb634e2da_6kwI9j6.jpg", "website": "https://speedsquaregame.com/contact/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 47, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Kennan Mell"], "genres": ["Strategy", "Puzzle"], "publishers": ["Kennan Mell"], "esrb_rating": "Everyone 10+"}