{"id": 622692, "slug": "woody-pop-brick-breaker", "name": "Woody Pop: Brick Breaker", "name_original": "Woody Pop: Brick Breaker", "description": "Woody Pop Brick Breaker is a perfect combination of ball shooting and woody puzzle games. Get ready to blast and pop all the blocks, solve the fun colorful puzzles, and beat your high score! The game is interesting and very easy to get addicted to it.<br/><br/>This relaxing game is to shoot the block up in the same color to match and blast them. Woody Pop Brick Breaker is a game with an endless mode that makes your days more fun. There is no level, so you just keep playing. Try your best to play with all the blocks as long as possible and beat your high record. Colorful blocks that reinforce the cute impression are guaranteed to make you feel at home playing this game for long!<br/><br/>If you are interested, then you should first read out the features of this game, given below.<br/>The fabulous combination of ball shooting and woody puzzle games<br/>One of the most lightweight block puzzle gaming app<br/>There is a number on the special block indicating the move limits. If you don’t follow that, this block will turn into a different color.<br/>Minimalism graphics<br/>No time limit<br/>Beat your high score and challenge other players<br/>Relaxing &amp; Addictive<br/><br/>Let’s play this addictive Woody Pop Brick Breaker to test your puzzle-solving skills. It’s fun and simple to play, but it will take time and skill to become a master! <br/><br/>Ideas on how we can make Woody Pop Brick Breaker even better? Need help with the game? We love to hear from our players! Email us at support@athena.studio", "metacritic": null, "released": "2020-09-19", "tba": false, "updated": "2021-06-18T04:26:21", "background_image": "https://media.rawg.io/media/screenshots/0e8/0e8d771b2700f92b312ee06a0ba11349_XSzql16.jpg", "website": "https://athena.studio", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 64, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Athena Studio"], "genres": ["Board Games", "Puzzle"], "publishers": ["Athena FZE"], "esrb_rating": "Everyone 10+"}