{"id": 622735, "slug": "crop-circles-puzzle", "name": "Crop Circles Puzzle", "name_original": "Crop Circles Puzzle", "description": "A game developed especially for ufos, crop circles and puzzles enthusiasts. A theme that fascinates, intrigues, attracts<br/>attention and stirs the imagination of so many people.<br/><br/><br/>- A mysterious, immersive and minimalist experience.<br/><br/>- Tap to spin the pieces and solve the puzzle.<br/><br/>- Stay tuned! Small parts make some levels more difficult.<br/><br/>- Instigating, mysterious! Are you able to discover the messages and the hidden meaning of each circle?<br/><br/>- Solve the puzzles and find out where and when the circles appeared.<br/><br/>- Discover great pictures.<br/><br/>- Addictive, intuitive, relaxing and easy to play. Develop your focus and attention!<br/><br/>- No ADS / without additional purchases<br/><br/><br/>Crop Circles Puzzle is a minimalist game based on the mysterious forms that have appeared for decades in plantations around the world, especially<br/>in England. There are incredible cases, where giant and complex forms appeared from one hour to another, near roads and inhabited places.<br/>Who created them is still a great mystery.<br/><br/>Ideal to pass the time, Crop Circles Puzzle is extremely relaxing and provides a mysterious and immersive experience.<br/>The combination of enigmatic and soft music with intriguing images builds a perfect environment to escape the stressful situations of everyday.<br/>Addictive and intuitive, Crop Circles Puzzle will take you on a journey towards mystical places.<br/>Are you able to discover the messages and the hidden meaning of each circle?<br/><br/><br/>You will love Crop Circles Puzzle:<br/><br/>-100 incredible levels<br/>-Without stopwatch or pressure<br/>-Develop your focus and attention<br/>-Simple and fun: fit the pieces correctly and solve the mystery<br/>-Fantastic and mysterious images<br/>-Relaxing music and environment <br/>-Instructive: complete the forms to know when and where they appeared<br/>-Addictive. You always want to solve a new mystery, find out what the next image is<br/>-Without advertisements or additional purchases<br/><br/><br/><br/>How to play Crop Circles Puzzle?<br/>The goal is simple. To complete the level, tap the parts to rotate and engage. Look for the perfect fit and complete intriguing images.<br/>When all the pieces are connected and the level is completed, images that will open your mind will emerge and then you will know the place and<br/>year the crop circle have appeared. Stay tuned! Small parts make some levels more difficult. Always look for the perfect links between shapes.<br/><br/><br/>Is it possible to save game progress?<br/>The progress of the game will be instantly recorded in your application. So you can return in the exact level<br/>in which stopped playing. If you encounter any difficulties, please contact us and we will try to solve it.<br/><br/><br/>Do I need to pay to play?<br/>Crop Circles Puzzle costs the price of a coffee and you can enjoy a clean version of the game without annoying ads or additional purchases.<br/><br/><br/>Take the challenge and solve this mystery!<br/><br/><br/>Have fun with Crop Circles Puzzle!", "metacritic": null, "released": "2021-05-26", "tba": false, "updated": "2021-06-18T04:46:28", "background_image": "https://media.rawg.io/media/screenshots/746/746579a263ee6042e7e54a491ae5ba7d.jpg", "website": "https://www.facebook.com/onoffgames/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 74, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Adriano Muniz da Silva"], "genres": ["Casual", "Puzzle"], "publishers": ["Adriano Muniz da Silva"], "esrb_rating": "Everyone 10+"}