{"id": 622802, "slug": "avian", "name": "Avian", "name_original": "Avian", "description": "In Avian you play as a guardian of an ancient and forgotten civilization gone long ago. <br/>A dark matter has infested your homeland and you must use your ancestral instrument, the Anavi, to bend the alien-like plants of the world to your will.<br/><br/><br/><br/>The Anavi, your musical instrument, is not a weapon but a tool from the civilization you sworn to protect. It will help you control the different plants by playing 4 notes. Each note will let you interact with a certain plant and explore the environnement. Propulse yourself across a river thanks to a blue catapult plant, jump across a ravine by using a green plateform plant and many more!<br/><br/><br/><br/><br/><br/>Dive into a subterranean world that the Avian civilization use to call home. The caves are filled with a rich flora and fauna. However since the disappearance of your people, a strange evil has plagued this world. A dark corruption invaded most of the old ruins of the Avian and it is now starting to kill the environnement. Discover a way to cleanse this dark matter and restore the balance to the Avian world.<br/><br/><br/><br/><br/><br/>Find what’s left of the Avians to help you fight the corruption. Find the old instruments to purify the caves and restore your dying world. Dive into the ruins of this old civilization and try to save it from the chaos of the corruption.<br/><br/><br/><br/><br/><br/>Your objective is to reactivate old statues in order to cleanse the corruption inside the caves. To do so, you will have to solve puzzles and let a strange character guide your footsteps to your final destination.<br/><br/>", "metacritic": null, "released": "2021-06-17", "tba": false, "updated": "2022-01-10T02:44:36", "background_image": "https://media.rawg.io/media/screenshots/d5f/d5f5e4bf71631cb31eb1691eb0ac3904.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 315, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Royale Monkey"], "genres": ["Adventure", "Indie", "Platformer"], "publishers": ["IIM - Institute of Internet & Multimedia"], "esrb_rating": null}