{"id": 623047, "slug": "enfonsa-el-vaixell", "name": "Enfonsa el Vaixell", "name_original": "Enfonsa el Vaixell", "description": "<p>El <strong>Programa de Noves Tecnologies</strong> de la <strong>Auria Fundació</strong> hem desenvolupat un nou joc de caire educatiu i pensat per a jugar amb polsador.<br/></p>\n<p><strong>Enfonsa el vaixell </strong> té com a idea  principal treballar la temporalització i la paciència. En quant a temporalització ens referim al fet d'esperar a que un objecte estigui en el punt optim per dur a terme una acció, tocar la pantalla, premer un boto, etc.</p>\n<p> L'objectiu del joc és que els jugadors aconsegueixin enfonsar els diferents vaixells que apareixen des de la part dreta de la pantalla. Aquests vaixells aniran apareixen en diferents posicions i velocitats de forma aleatoria.<br/></p>\n<p>En el moment en que el jugador enfonsa un vaixell sumarà  punts en aquesta ocasió si dispara i no aconsegueix enfonsar un vaixell no se li restaran punts. Hem decidit que aquest joc no tindrà un sistema de vides, d'aquesta forma facilitem l'aprenentatge del joc mitjançat la prova i error.<br/></p>\n<p>Existeixen avisos sonors per tal d'anunciar si la resposta que s'ha  escollit és correcta o no. <br/></p>\n<p>Per la versió Android també hi ha alternativa per jugar-la amb polsador això si necessitarem un polsadro Blue2 o un cable OTG on connectar-hi un ratoli adaptat per a polsadors.<br/></p>\n<p>Si voleu més informació sobre nosaltres ús animem a visitar el nostre blog.\r\n</p>", "metacritic": null, "released": "2021-06-17", "tba": false, "updated": "2021-06-18T06:10:08", "background_image": "https://media.rawg.io/media/screenshots/76e/76e353d38451ee02dc076c05a1fb63d3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 6, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Android", "Web"], "developers": ["Programa de Noves Tecnologies"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}