{"id": 623055, "slug": "timecrashers", "name": "TimeCrashers", "name_original": "TimeCrashers", "description": "<p>You are invited to TimeCrashers, the one and only time travelling nightclub, put on your favourite dancing shoes and have some time travelling fun!<br/></p>\n<p>Lose yourself in an immersive online experience which takes you on a unique virtual journey. Set in Sheffield’s<em> only</em> time-travelling nightclub, you are invited to travel back through time and experience a number of different historical eras each with a link to Sheffield's colourful history. Take a nostalgic trip to 1980s Park Hill Flats, witness the beautiful love story of Frank and Joy, inspired by artwork of Pete McKee and journey through some of Sheffield’s most haunted locations.\r\n</p>\n<p>TimeCrashers’ has been developed and created as part of Chol’s Tall Shadow’s Programme. A year long project using co-creation to produce a number of new artworks. The creative team of TimeCrashers was made up of young people working alongside industry professionals to produce this ‘one of a kind’ event. \r\n</p>\n<p>The process began with a number of creative sessions where Chol’s core team met with the Tall Shadows Young Producer Interns, emerging young artists and experienced professionals to imagine a final ‘show stopping’ event to complete the year long programme . Starting from scratch the group explored a number of themes, ideas and outcomes before deciding on the final time traveling  theme. Each member of the creative team worked as ‘Equal Players’ to develop the idea, create the narrative and decide on the final product. Each section has been carefully crafted by small working groups of film makers, performers, producers and directors before being pulled together to create the final event. \r\n</p>\n<p>The script and story was first developed into an online immersive performance before being reworked into the final gaming experience with expertise and support from NMV and Digital Game Artist Lex Roberts. The live performance event received glowing feedback from audience members, being described as ‘innovative,’ ‘thoughtful’ and ‘educational’. The team are looking forward to finding out how audiences will receive the reworked interactive game. Creative Director Lauren Ash said, ‘I am immensely proud of the achievements of this talented group of individuals. Each and every one of them has worked extremely hard to turn our fantastical idea into a reality. We started with huge ambitions and I am happy to say we created a product that is truly one of a kind.’</p>", "metacritic": null, "released": "2021-06-17", "tba": false, "updated": "2021-06-18T06:12:06", "background_image": "https://media.rawg.io/media/screenshots/d7a/d7aed452a75cb0bba34d7628dc3792c6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 157, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["CholTheatre"], "genres": [], "publishers": [], "esrb_rating": null}