{"id": 62318, "slug": "board-battlefield", "name": "Board Battlefield", "name_original": "Board Battlefield", "description": "Board Battlefield is a turn based strategy game that plays like a simplified version of Chess, with dice. Get the satisfaction of the strategic play of Chess but at a much lower investment of time and effort. A single game lasts around 10 minutes. Good for a quick strategy fix! Plus, the ability to play multiplayer with friends adds lots of replay value.<br/>\n<br/>\r\nThe game is played between two players(one can be A.I.) on a 9x9 square grid. The objective is to capture the 'Flag Square' of the opponent while preventing the opponent from capturing yours. You have infantry, tanks and rocket artillery to help you accomplish this and with further options to unlock paratroopers, strike aircraft, missile cruisers and more.<br/>\n<br/>\r\n- Multi-player gameplay: Play vs your Steam friends or with opponents from around the world<br/>\n<br/>\r\n- Single-player gameplay: Play vs the A.I. with customizable play styles and deployments<br/>\n<br/>\r\n- Hot Seat gameplay: Play vs a friend on the same PC<br/>\n<br/>\r\n- Three basic unit types: Infantry, Tanks and Rocket Artillery<br/>\n<br/>\r\n- Earn reputation and gold for every enemy you destroy and for every match you win<br/>\n<br/>\r\n- Level up to unlock and deploy more options like the landmine, transport helicopter, fighter aircraft and missile cruiser<br/>\n<br/>\r\n- Plant landmines to surprise enemy infantry<br/>\n<br/>\r\n- Use helicopters to airdrop your forces behind enemy lines<br/>\n<br/>\r\n- Call in air strikes to destroy enemies on the ground<br/>\n<br/>\r\n- Deploy a missile cruiser to strike deep into enemy territory", "metacritic": null, "released": "2018-08-10", "tba": false, "updated": "2019-08-28T21:57:32", "background_image": "https://media.rawg.io/media/screenshots/6ba/6baf15f24806689a59fb85fb93b19407.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 217, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Surrealscape Studios"], "genres": ["Strategy", "Casual"], "publishers": ["Surrealscape Studios"], "esrb_rating": null}