{"id": 623216, "slug": "el-malabarista-kitty-2000", "name": "El malabarista Kitty 2000", "name_original": "El malabarista Kitty 2000", "description": "<p>Español:</p>\n<p>A Kitty, el gato amable y robótico, le encantaba contemplar cómo las águilas se estrellaban contra el piso del patio y explotaban en una nube de colores azul, verde y primavera. Un día de esos, mientras Kitty se deleitaba con ese espectáculo, su dueño intentaba abrir una lata de gaseosa, ¡Cuando ésta empezó a prenderse fuego a causa del efecto invernadero! D:</p>\n<p>Su dueño la soltó, ya que era una persona muy irresponsable, pero Kitty logró atraparla justo antes de que se cayera al suelo y prendiera fuego su sushi con leche. El problema es que su dueño continuó abriendo más y más latas...</p>\n<p>¿Logrará Kitty salvar su delicioso almuerzo? ¡Toma el control remoto con dos botones y controla sus manos para poder ayudarlo!</p>\n<p>English:<br/></p>\n<p>Kitty, the friendly, robotic cat, loved to watch the eagles crash to the garden's floor and explode in a cloud of blue, green and spring colors. One such day, while Kitty was reveling in that spectacle, her owner was trying to open a soda can, when it started to catch fire because of the greenhouse effect! D:</p>\n<p>Her owner let it go, as he was a very irresponsible person, but Kitty managed to catch it just before it fell to the ground and set her sushi with milk on fire. The problem is that his owner kept on opening more and more cans...</p>\n<p>Will Kitty manage to save her delicious lunch? Take the remote control with two buttons and control his hands to help him!</p>", "metacritic": null, "released": "2021-06-16", "tba": false, "updated": "2021-06-18T06:49:56", "background_image": "https://media.rawg.io/media/screenshots/908/908c56b99c2907e5c9f7bd63755d43db.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 52, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["SoyFranco"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}