{"id": 623500, "slug": "dont-sleep-walking-together-v0-2", "name": "Dont Sleep Walking Together v0 .2", "name_original": "Dont Sleep Walking Together v0 .2", "description": "<p>This is a story similar to Zhuang Zhou Meng Die. Renko and Merry are connected through dreams. Renko and Merry also don't know whether they dreamed of each other or appeared in each other's dreams, whether they saw each other during sleepwalking, or saw each other during sleepwalking.</p>\n<p>In the game, when a character is in the \"sleepwalking\" state, her behavior is controlled by the dream (computer), and the character controlled by the player can interact with the environment, thereby achieving simple control of the sleepwalking character. A character in a sleepwalking state can also provide action convenience for a character controlled by the player.</p>\n<p>The status of Renko and Merry can be switched, but there is a limit on the number of times. The goal of the game is to make full use of the \"sleepwalking\" relationship between Lianzi and Meili, so that they can safely reach the designated area in the level.</p>\n<p>This game I Uploaded in GMTK 2021, and I made a few changes based on the feedback.</p>\n<p>I adjusted the control problem and physical inspection, made it easier to play.</p>\n<p>The rating of GMTK 2021 is not over, so I can not upload this update directly, I will delete this page later when rating GMTK 2021 is finished.</p>\n<p>I wish you will have a good time to enjoy this.</p>\n\n<p>Music: Valse Gymnopedie by Kevin MacLeod</p>\n<p>https://incompetech.filmmusic.io/song/7928-valse-gymnopedie</p>", "metacritic": null, "released": "2021-06-16", "tba": false, "updated": "2021-06-18T08:07:42", "background_image": "https://media.rawg.io/media/screenshots/3b5/3b5a20adc6e3bd03f8f7ea42b1fe7e21.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 19, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Nusn"], "genres": ["Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}