{"id": 623648, "slug": "clue-murder-by-death", "name": "Clue: Murder by Death", "name_original": "Clue: Murder by Death", "description": "<p>An adventure game where you must survive a night in an English castle after a murder has taken place during dinner. Set in the early twentieth century, it is a modern parody of detective adventures where, in addition to surviving, you must discover who the murderer is by playing with different characters.</p><p>This is a game by the EverDevs community. We host a game jam for each step of the development process (the idea, prototype, game mechanics, artwork, music, etc..). The work of the winning submissions in the game jams is chosen to be used in the final game. Every contestant that goes beyond the call of duty, gets to share in 80% of any net profits generated by the final game.</p>\n<p><strong>**Download the Game Design Document below for detailed information about the game.</strong></p>\n\n<strong>Current Game Jams</strong>\n<strong>Game Jam</strong><strong>GitHub Project Link</strong>Prototype Jam Challengehttps://github.com/everdevs-apps/mbd-prototype-jam.git\r\n\n<strong>Prototype Jam Challenge Details</strong>\n<p>All prototypes must be made with iOS and Android touchscreens in mind. Refer to the TouchExamples scene and the TouchExample.cs script in the provided GitHub Unity project for examples of how to include touches quickly and easily with the included TouchKit touch recognizers from prime31. We made a few minor modifications to the existing touch recognizers in the kit and created a new recognizer called the TKDragRecognizer, which will be perfect for the character controller (so please use it). We included pinch, swipe, tap, and drag recognizers in the TouchExamples scene.\r\n</p>\n<p>Each prototype has a scene named after it in the provided Unity project, so please create your prototypes in the appropriate scenes.\r\n</p>\n<p><strong>Character control with invisible touchscreen joystick\r\n</strong></p>\n<ul><li>Be creative and show us the most elegant solution for your character controller. Please refer to the TouchExamples scene for a look at how to use the TKDragRecognizer because it will be a perfect tool for the character controller without a visible joystick. If you need a reference, take a look at Space Marshals, they have a very elegant character controller with no visible joystick needed.</li></ul>\n<p><strong>Context menu\r\n</strong></p>\n<ul><li>Refer to the explanation on pages 30-31 of the Game Design Document (downloadable below). Get creative!</li></ul>\n<p><strong>Dialogue system\r\n</strong></p>\n<ul><li>We imagine a little popup over each character's head when they are speaking or the player's head when they're thinking, but get as creative as you want.\r\n</li></ul>\n<p><strong>Wall fade of closest walls on camera rotation\r\n</strong></p>\n<ul><li>Again, refer to the above. It might help you to work on the camera rotations around rooms to help put this prototype into context, but we are open to ideas here. Should walls fade to full transparency? Semi-transparency?? Or maybe the option to have both to test is best... It's up to you.\r\n</li></ul>\n<p><strong>Timer/countdown system and UI element\r\n</strong></p>\n<ul><li>Get creative with this one. Is it a traditional clock? Does it have a cuckoo bird that pops out every hour on the hour??\r\n</li></ul>\n<p><strong>Camera rotation around rooms\r\n</strong></p>\n<ul><li>This is a nice arced 90º rotation from one corner of the room to the other. There aren't too many ways to skin this cat, but where should the camera rotation button go? Maybe you want to work on the wall fading behavior since it somewhat depends on the camera rotation.\r\n</li></ul>\n<p><strong>2 object inventory system\r\n</strong></p>\n<ul><li>This one is pretty self-explanatory, but the prototype should show at least three collectible items in a room, and a UI with two slots. If the player has two items in the inventory, a third item cannot be picked up until one of the inventory items has been dropped. How do you drop items?? How do you pick them up?? Maybe you want to work on the context menu as well.\r\n</li></ul>\n<p><strong>Room transitions\r\n</strong></p>\n<ul><li>Room transitions should be fairly straightforward. Should it be a smooth camera transition with room fades or a quick flicker?? Maybe you want to show both... Just make sure the character ends up in the correct location in the adjacent room. We have supplied multiple rooms in the Assets/Prefabs/Geometry/_Rooms folder of the Unity project.\r\n</li></ul>\n<p><strong>Bonus points (Secret point value)\r\n</strong></p>\n<ul><li>Create a way for the player to visually identify if the edges of a room with the hidden walls closest to the camera have doors, openings, or no walls at all. If they have doors, are they locked?? How do we know??\r\n</li></ul>\n\n<strong>Join Us</strong>\n\r\nCreate Account\r\n\r\n\r\n<strong>Follow Us</strong>\n<p>                                 \r\n</p>\n\n<strong>Let's create together!!</strong>", "metacritic": null, "released": "2021-06-15", "tba": false, "updated": "2021-06-18T08:40:25", "background_image": "https://media.rawg.io/media/screenshots/47f/47f98c35f2de2b7dd4c84ac04cd096aa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 21, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Everdevs"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}