{"id": 623812, "slug": "the-last-cadet", "name": "The Last Cadet", "name_original": "The Last Cadet", "description": "A private military company is hired to escort a laboratory team in a submarine to recover a valuable specimen near an abandoned, long dormant deep sea facility. As the laboratory team and military personnel explore the target site, things go wrong almost immediately. An ancient monster attacks the submarine and badly damages it, causing widespread flooding and destroying all communication links in the process. Cadet Flash Pan is the last survivor in the submarine and the only escape route is a mini-sub that has badly damaged electronics but is salvageable with replacement parts found throughout the submarine. Meanwhile, Sergeant Buenrostro is the only surviving member of the team that explored the target site. Play the individual stories of Flash Pan and Sergeant Buenrostro to discover the truth behind the ill-fated mission and unravel the not so dormant deep sea facility while surviving the wrath of an ancient monster.<br/><br/>Danger is all around as highly aggressive eels, jellyfish, and sharks prowl the scene, not to mention the ever-lurking monster. Light is scarce with the only source being the few working lamps, resident bioluminescent marine life, and each character's own deep sea suit. Use twin stick controls to survive the horrors that are drifting in the darkness. Use multiple weapons, some of which can be used in unique ways like dashing with the harpoon gun, high jumping with the shotgun's recoil, and busting open stuck doors with a flamethrower-like welding kit.<br/><br/>Also included at launch is a multiplayer system with two local co-op modes. One features multiple stages with waves of enemies coming at you with everything they've got. The other mode features missions to be completed varying from clearing enemies from specific areas to scavenger hunts. Additionally, there is an achievements system for completionists and a built-in timer just for speedrunners.<h3>Features</h3><br/><ul><li> Twin-stick controls<br/></li><li> Deep sea sci-fi metroidvania<br/></li><li> Two individual campaigns in Cadet Flash Pan and Sergeant Buenrostro<br/></li><li> Co-op multiplayer modes<br/></li><li> Built-in achievement system and timer for speedrunners! </li></ul>", "metacritic": null, "released": "2021-06-15", "tba": false, "updated": "2021-11-29T02:57:24", "background_image": "https://media.rawg.io/media/screenshots/01b/01bf7f5cfe02991d018c7f03623a5bf1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 23, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["tertiarymap", "Debonair Aesthetics"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Debonair Aesthetics"], "esrb_rating": null}