{"id": 62397, "slug": "maitetsu", "name": "Maitetsu", "name_original": "Maitetsu", "description": "<p>After hearing that an industrial factory is to possibly be built along a landmark river in his hometown of Ohitoyo, Migita Sotetsu returns home to change the minds of those in charge of the factory proposal. Although half of the town&#39;s citizens support the building of such a mill, the other half fear the potential for pollution and contamination of their beloved river. Recognizing Ohitoyo&#39;s budgetary decline over the last few decades, Sotetsu believes that the town requires a system that allows it to be fiscally independent instead of reliant upon a factory to stimulate its economy, and sets out to identify an alternative method in achieving this goal. It&#39;s during this time that Sotetsu comes across an android-like being--a &quot;Raillord&quot; named Hachiroku--while looking through his late adoptive father&#39;s belongings. Although inanimate, Hachiroku and Sotetsu forge a deep, unlikely connection, and from this bond, work together in hopes of restoring Ohitoyo to its former glory.<br />\nFully voiced in Japanese including the protagonist!<br />\nIncludes dual language support<br />\nFully animated sprites and events<br />\nScene select to jump to your favorite in game scenes<br />\nIncludes tips for detailed information about trains and the game<br />\nA gallery to pose character stands, listen to in game music, view CGs, and view scenes</p>", "metacritic": null, "released": "2018-06-29", "tba": false, "updated": "2022-02-23T02:41:47", "background_image": "https://media.rawg.io/media/screenshots/81c/81cc85b5b8e56c7ba7c8d0cfd0395a5d.jpg", "website": "https://sekaiproject.com/products/maitetsu/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 4, "owned": 36, "toplay": 3, "dropped": 1}, "playtime": 2, "achievements_count": 11, "ratings_count": 2, "suggestions_count": 510, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Lose"], "genres": ["Casual"], "publishers": ["Sekai Project"], "esrb_rating": "Adults Only"}