{"id": 623968, "slug": "wire-you-doing-this", "name": "Wire You Doing This?", "name_original": "Wire You Doing This?", "description": "<p>You play as a rogue bomb squad operative, your goal is to delay the defusal of the bomb. Betray your allies and survive for as long as possible.</p>\n<p>Movement: WASD</p>\n<p>Shoot: Left click<br/></p>\n<p>This is my first ever game. It is a simple 2D arena shooter, which will get increasingly harder as time goes on. I decided to throw most ideas out the window to get out at least a playable game before the deadline, then it was extended and my schedule did not allow for me to utilize the extra time.  Any feedback is greatly appreciated.<br/></p>\n<p>I am aware of some bugs, and the fact that it's a bit bland and boring, but I do like how movement being locked during shooting feels. To me it emphasizes using cover, and feels good to successfully swap between shooting and moving to dodge incoming fire. Given more time I would add health bars, the defuser-bot I had planned, and a wire snipping minigame to disable it. A proper intro would also be on my radar and general polish and tuning. I would also like to experiment with moving the bomb around, adding new enemy types, and more drops.</p>\n\n\r\nThe defuser-bot that never made it in.<br/><br/><br/>\n\r\nThe plan was to be able to disable the defuser-bot for a short time with a minigame. It could be used as cover.\r\n\n<p>It may not be ground breaking, but I learned a LOT about Unity's new input system, and concocted my own way to avoid the animation spiderweb nonsense that Unity's animator turns into. Overall I learned a lot, which I would call a success.</p>\n\n<p>All art was made by me in Aseprite, it is the first pixel art I've ever done.<br/></p>\n<p>Sounds were created in SFXR, with the exception of the gunshot sound and music.</p>\n<p>Gunshot sound is \"Game gun shot\": https://mixkit.co/free-sound-effects/gun/</p>\n<p>Music is \"Chipped Urgency\": https://opengameart.org/content/chipped-urgencycombat<br/></p>", "metacritic": null, "released": "2021-06-14", "tba": false, "updated": "2021-06-18T10:02:57", "background_image": "https://media.rawg.io/media/screenshots/6de/6de6ca673d4d699a121d17e04679809c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 11, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Blackdima"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}