{"id": 6240, "slug": "dungeon-hearts", "name": "Dungeon Hearts", "name_original": "Dungeon Hearts", "description": "Dungeon Hearts fuses the strategy and pattern matching of puzzle games with the kinetic pace of action games. Align magical runes as they flow along the Fatestream to attack, defend, and conjure magic in frenetic battles against a bestiary of fantastic creatures out to use those same runes against you. Chain together multiple attacks and unleash powerful combos or call upon each hero's special attacks to devastate your enemies to survive the twists and turns of Dungeon Heart's evolving gameplay. Strike down all that stand in your way and level up your brave warriors as each foe grows more powerful than the last, culminating in the final battle with The Dark One himself! <br/><br/><br/>\"Four spirits race across the land, burdened with tragedy. Within each lies the specter of guilt and fear, which The Dark One bends to his will to enact his resurrection. They realize the deception too late as the promise of salvation turns to betrayal. A black wind washes over the planes, turning all to ash. As the fallen heroes face the engulfing void, a spark of hope clings to life. When the demon peered into their hearts to learn their secrets, so too did they learn his...\"Features<br/><ul><li>Puzzle/RPG Hybrid – Quickly align runes within the rapid match-three puzzle system to wield devastating attacks, defend against enemy offensives, and unleash multi-hero combos.</li></ul><ul><li>The Fatestream – Plan your strategy under pressure with dozens of different runes linked to each hero and defend against powerful attacks and dreaded hexes cast by enemies against your heroes. </li></ul><ul><li>Four Unique Heroes – Balance the individual skills of each hero and level them up to unlock and unleash a dozen different special powers for new attacks, healing magic, and time-altering spells. </li></ul><ul><li>Limitless Adventure – Face a randomly generated battle sequence with every new adventure and battle against a bestiary of over 40 creatures and 7 bosses lurking around ten unique environments. </li></ul><ul><li>Brimming with Secrets – Each defeated enemy reveals a sliver of the world's lore and the heroes' history. </li></ul><ul><li>A Vibrant Soundscape – Unlock 4 bonus soundtracks, each in a different musical genre.</li></ul>", "metacritic": 73, "released": "2013-03-28", "tba": false, "updated": "2023-12-19T12:43:52", "background_image": "https://media.rawg.io/media/screenshots/177/177597ee68f288406e67037547aaca9f.jpeg", "website": "http://cube-roots.com/", "rating": 2.57, "rating_top": 3, "added_by_status": {"yet": 23, "owned": 554, "beaten": 3, "toplay": 1, "dropped": 16}, "playtime": 2, "achievements_count": 17, "ratings_count": 28, "suggestions_count": 348, "game_series_count": 1, "reviews_count": 28, "platforms": ["iOS", "Linux", "PC", "macOS"], "developers": ["Devolver Digital", "Cube Roots"], "genres": ["RPG", "Strategy", "Casual", "Indie", "Puzzle"], "publishers": ["Devolver Digital", "GHI Media"], "esrb_rating": null}