{"id": 62402, "slug": "dark-sasi", "name": "Dark SASI", "name_original": "Dark SASI", "description": "History: <br/>Once a year, in an unknown world called \"Dark SASI\" is a celebration of all the great souls. The main entertainment are considered the \"test of death\". <br/>Great souls throw out a book on this holiday, which falls into one of the many corners of our world. <br/>Once the book gets into the hands of a mortal, he falls into a coma and his soul moves into the world of Great souls. <br/>At this point, they begin their game by betting on how many times the mortal soul will be able to endure suffering. <br/><br/><br/>Plot: <br/>You are unlucky: you play for the main character, who was not lucky enough to find a book. <br/>After the move, you're in shock and you don't know what's going on. You are met by the Secretary of the shower, trying to calm and explain everything. <br/>The Secretary says that we need to do to get out of the coma and be free: to pass all the tests, but you should be careful, as the soul of the main character tied to the \"world of souls\", and if the hero dies, to be reborn you need to have the last teleport. <br/><br/><br/>Gameplay: <br/>Dark SASI is an adventure in the style of an RPG, with its own characteristics.<br/>Immerse yourself in the gloom and gloomy atmosphere of \"Dark SASI\". <br/>Any wrong move or reckless act will lead to death. <br/>You are waited for by big and psychologically difficult BOSSES. <br/>Your soul is saved only by the \"teleport souls\", but not so much. Proceed with caution. <br/>You will be accompanied by more than 20 tracks, giving the opportunity to dive headlong into fear and depression.<br/>", "metacritic": null, "released": "2018-05-18", "tba": false, "updated": "2019-08-28T21:57:29", "background_image": "https://media.rawg.io/media/screenshots/e1b/e1bcfeb118b475b7207ccc288ac89d74.jpg", "website": "https://vk.com/narkogamess", "rating": 1.67, "rating_top": 1, "added_by_status": {"yet": 7, "owned": 86, "beaten": 3, "toplay": 2, "dropped": 5}, "playtime": 1, "achievements_count": 6, "ratings_count": 9, "suggestions_count": 550, "game_series_count": 0, "reviews_count": 9, "platforms": ["PC"], "developers": ["Narko Games"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Simulation", "Sports", "Indie"], "publishers": ["Narko Games"], "esrb_rating": null}