{"id": 624191, "slug": "wasteland-tactics", "name": "Wasteland Tactics", "name_original": "Wasteland Tactics", "description": "<p><em>Another settlement needs your help. And by help I mean it needs to be cleansed with fire. I remember days when there was nothing but empty wasteland as far as the eye can see, but these days there is a damn settlement every couple hundreds of meters. <br/></em></p>\n<p><em>You were always playing with those metal scraps and throwing them around. How about we throw some of them in our neighbours' direction?<br/></em></p>\n<p>Wasteland Tactics can be described as roguelike artillery game. Created for Monogamejam Theme - \"Low budget\" this game will make you value every resource available. Use makeshift rocket launcher to bring down post apocalyptic settlements. Send expeditions to find new parts to build your rockets. Extend your reach, destructivity and precision, explore what post apocalyptic desert has to offer.</p>\n<p>There are plenty things I've planned for this game but I've managed to fit only this much into gamejam's limit. Game offers persistent achievement system to increase longevity a bit. Game was made in about 9 days. 9 pretty long but enjoyable days.</p>\n<p>Controls:<br/></p>\n<p>Use <strong>Sliders</strong> to adjust launch power and angle. <br/></p>\n<p>Alternatively use <strong>Arrow keys</strong>. Hold<strong> Lshift</strong> to increase step.</p>\n<p>Press <strong>Space</strong> to reload and launch projectile.</p>\n<p>Hold <strong>Lshift</strong> to initiate thrust. Provided you have engine... and fueltank.. without hole..</p>\n<p>Press F key to activate some of the warheads.</p>\n<p><strong>WASD</strong> to move camera around.</p>\n<p>You can click on <strong>Names of Settlements</strong> at top of the screen to quickly navigate.</p>\n<p>Notes:</p>\n<p>Use the <strong>Settings </strong>to set preferred resolution. 1366x768 is bit problematic for pixel art, there is a more optimal solution for that one, but outside of scope of the gamejam. If you have any problem with settings, you can delete config.json, game will create a default one, alternatively you can edit it in a notepad to change resolution, however it shouldn't be required and ingame settings should provide you with all the options. </p>\n<p>Game is definitely finishable, however might take bit of a practice and dare I say, skill. If you run out of scraps with nothing in reach then that's restart time. Good luck and mainly, have fun.<br/></p>", "metacritic": null, "released": "2021-06-14", "tba": false, "updated": "2021-06-18T10:58:52", "background_image": "https://media.rawg.io/media/screenshots/4c0/4c064c5222521b41a3891cc76565bf70.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 150, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ravendarke"], "genres": [], "publishers": [], "esrb_rating": null}