{"id": 6242, "slug": "wordsworth", "name": "WordsWorth", "name_original": "WordsWorth", "description": "Get set to challenge over 1 Million players from all across the globe with New Power-Ups!<br/><br/>Thanks for making WordsWorth the #1 Word Game on the Mac App Store <br/><br/>Here’s what gamers had to say: <br/>- Next best thing since Scrabble board… Kind of Angry Birds with intelligence!!!\u2028 <br/>- I love this game! I’ve met people from all over the world playing this game\u2028 <br/>- My kids love to play and it’s a family affair with an educational edge!!\u2028 <br/>- I’ve played it everyday for about 2 years so far, with no plans to stop anytime soon <br/><br/>- ‘Scrabble on Steroids!’ – Macworld <br/>- ‘Challenging &amp;amp; Addictive Gameplay’ – Gamezebo <br/>- ‘It’s one of the best Word Games for iPhone!’ - cnet <br/>- ‘WordsWorth is a great game that you&amp;#39;ll want to play again and again!’ - TopTenREVIEWS<br/><br/>Is it any wonder then that WordsWorth has received so much adulation? <br/>- Silver Award from PocketGamer <br/>- Honorable Mention among Word Games in the 2009 and 2012 Best App Ever Awards. <br/><br/><br/>CALLING ALL WORDCRUNCHERS ABOARD! <br/>Calling all Word champs! Experience the thrill of wordplay as you link letters to trace words on a beautiful honeycomb structure. Create longer words using Letters with more &amp;#39;Dots&amp;#39; to earn hefty points and unlock quests! Play with our rapidly increasing community of players and befriend Word Pros from all across the globe!<br/><br/>AMP UP YOUR GAME WITH POWER-UPS! <br/>Earn Stars based on the words you create; words with more &amp;#39;Dots&amp;#39; get you <br/>Stars faster. Then use them to unlock 4 Power-Ups and dominate your word battles! <br/>- FINDER: Locates the best word in the grid for you! <br/>- REPLACER: Replaces all instances of a letter with one of your choice! <br/>- RESETTER: Resets the Timed Tile back to zero! <br/>- REVIVER: Game Over? Use the Reviver to earn a new life and continue the game from where you lost. <br/><br/>FEATURES <br/>* Play it on the gorgeous 4&amp;quot; display of the iPhone 5 <br/>* Universal Binary: Enjoy the WordsWorth experience on iPhone and iPad <br/>* Play alone or challenge your Facebook friends online <br/>* 3 exciting game modes - Classic, Timed and Tumble <br/>* Choose from 6x6, 7x7 and 8x8 grids <br/>* Unlock special tiles and new strategies as you progress <br/>* Use Power-Ups – Finder, Replacer, Resetter and Reviver to dominate the word battles <br/>* Earn Stars as you play to unlock Power-Ups<br/>* Check meaning of words formed and expand your vocabulary <br/>* Chat with friends as you play <br/>* Complete numerous levels with different rankings <br/>* Supports official Scrabble word lists – TWL/SOWPODS/ENABLE <br/>* Hop on the global leaderboard and Improve your Vocab Power <br/><br/>Follow us on Twitter <br/>https://www.twitter.com/99Games <br/><br/>Like us on Facebook <br/>https://www.facebook.com/99Games <br/><br/>Subscribe to our YouTube Channel <br/>https://www.youtube.com/ninetyninegames", "metacritic": null, "released": "2010-07-09", "tba": false, "updated": "2019-10-22T14:28:45", "background_image": "https://media.rawg.io/media/screenshots/2f1/2f16e66e1ef3da05289d5d3955a5ad95.jpeg", "website": "http://www.99games.in/wordsworth.html", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 60, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["99Games Online"], "genres": ["Board Games"], "publishers": ["99Games Online Private"], "esrb_rating": "Everyone 10+"}