{"id": 6243, "slug": "asphalt-6-adrenaline-hd", "name": "Asphalt 6: Adrenaline HD", "name_original": "Asphalt 6: Adrenaline HD", "description": "<p>Prepare for the ride of your life with the new iPad Retina display and improved visual effects!<br />\nFeel the thrill of racing like never before in the newest adrenaline-pumping edition of the Asphalt series with new features specially designed to show off the full potential of the new iPad.<br />\nEVEN MORE AMAZING ON THE NEW iPad<br />\nAsphalt has never looked so breathtaking thanks to real time reflections on cars, specular and bump mapping for richer surface textures, more realistic shadows, cinematic blur effects for boosts and crashes, deeper draw distances, improved particle effects for smoke, collisions &amp; more, and anti-aliasing for smoother edges on all 3D objects.<br />\nBUILD YOUR DREAM COLLECTION<br />\nDiscover 42 cars and bikes from Ferrari, Lamborghini, Aston Martin, Ducati and other world class manufacturers.<br />\nRACE YOUR FRIENDS<br />\nYou can even take on friends in Online and Local Multiplayer mode for up to 6 racers. Climb the online leaderboard to be the best in the world!<br />\nLEAVE THE WORLD IN YOUR DUST<br />\nThese street races will have you tearing up city streets in L.A., Tokyo, the Bahamas and more. Each location is rendered in beautiful HD graphics that take full advantage of the Retina display.<br />\nCHALLENGE THE BEST<br />\nDon’t take your eyes off the road for a second, because you’ll be driving against tough<br />\nopponents in 11 different leagues and 55 events.<br />\nTUNED TO PERFECTION<br />\nTake advantage of numerous tuning options to help your vehicles reach peak performance on any track. You can even customize your vehicles with decals to give them your own style.</p>\n<hr />\n<p>Visit our official site at www.gameloft.com<br />\nFollow us on Twitter at http://twitter.com/gameloft or like us on Facebook at http://facebook.com/gameloft to get more info about all our upcoming titles.<br />\nCheck out our videos and game trailers on www.youtube.com/gameloft.<br />\nDiscover our blog at http://blog.gameloft.com/ for the inside scoop on everything Gameloft.<br />\nCertain apps allow you to purchase virtual items within the app and may contain third party advertisements that may redirect you to a third party site.<br />\nPrivacy Policy : http://www.gameloft.com/privacy-notice/<br />\nTerms of Use : http://www.gameloft.com/conditions/<br />\nEnd User License Agreement : http://www.gameloft.com/eula/</p>", "metacritic": null, "released": "2010-12-21", "tba": false, "updated": "2020-01-07T16:19:16", "background_image": "https://media.rawg.io/media/screenshots/35b/35ba2826afb73ce66234b48ccbe8a7d9.jpeg", "website": "http://www.gameloft.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 4, "beaten": 1, "toplay": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 313, "game_series_count": 15, "reviews_count": 2, "platforms": ["Android", "iOS"], "developers": ["Gameloft"], "genres": ["Racing", "Arcade"], "publishers": ["Gameloft"], "esrb_rating": "Everyone 10+"}