{"id": 624430, "slug": "makeup-artist-perfect-design", "name": "Makeup Artist: Perfect Design", "name_original": "Makeup Artist: Perfect Design", "description": "Why not become a makeup artist?<br/><br/>Make up with your style and pick your favorite match. In Makeup Artist, you can use foundation, eye makeup, lipstick, hairstyle, necklace and earrings to dress up.<br/><br/>Tons of different design for you to discover, cloud, butterfly, rainbow, Christmas and Halloween, everything in trend can be an inspiration for your style.<br/><br/>Use eye shadow brush to create the most beautiful gradient, lipstick to outline the perfect lip shape, different hairstyles and jewelries with different makeup styles, you are the makeup artist.<br/><br/>Come and challenge your fashion skill now!<br/><br/>Premium Subscription:<br/><br/>\u2028- You can subscribe for unlimited access to all contents with all makeup materials unlocked and remove all ads.\u2028<br/>– You can subscribe for unlimited access to unlock vip themes, remove non-reward ads, double rewards and double daily bonus.<br/>– Payment will be charged to iTunes Account at confirmation of purchase<br/>– Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period<br/>– Account will be charged for renewal within 24-hours prior to the end of the current period, and identify the cost of the renewal<br/>– Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's Account Settings after purchase<br/>– Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable purchases a subscription to that content.\u2028\u2028<br/><br/>Terms of Service:www.yentstarco.com/tos/<br/>Privacy Policy:www.yentstarco.com", "metacritic": null, "released": "2021-04-15", "tba": false, "updated": "2021-06-21T02:54:27", "background_image": "https://media.rawg.io/media/screenshots/259/259b90c82f5d8cc2ecf51a2b80337fd9_q7Km6BX.jpg", "website": "https://www.yentstarco.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 63, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Beauty salon Studio"], "genres": ["Simulation", "Casual"], "publishers": ["YENT STAR"], "esrb_rating": "Everyone 10+"}