{"id": 624474, "slug": "tag-of-war", "name": "Tag of War", "name_original": "Tag of War", "description": "<p>Tag of War is designed to be played with friends in local multiplayer on a single PC. Due to the 2-button control scheme, players can compete on the same computer without getting in each other's way. <br/></p>\n<p><strong>For single players</strong>, there is a sophisticated and human-like AI with adjustable difficulty to compete against. <strong><br/>Online multiplayer is possible using Parsec! https://parsec.app/ <br/></strong><br/></p>\n\n<p>Possible input methods:<br/>Keyboard, Mouse, Gamepad (only 1)<br/></p>\n\n<p>The objective of the game is to cover as much of screen as possible in your color. Every 15 seconds, the player whose color dominates the playfield gets a point until one player wins the game.</p>\n\n<p><strong>Powerups:</strong><br/>Powerups periodically spawn on the playfield, they can <br/>- Make the player's color \"invulnerable\" for a short time<br/>- Grant a short burst of movement speed to the player<br/>- Increase the size of the player's trail for a short time<br/>- Create a temporary clone of the player that mirrors their movement<br/>- Make the player explode, covering a large area with their paint<br/>- Draw a straight line in the player's color to all other players<br/>- Give the player a hammer that stuns the first opponent hit</p>\n<p><strong>Events:</strong><br/>Events mix up the pacing of the game every now and then. They can completely reset the screen to an empty slate or give the players new ways to spread their respective colors. Some examples include:<br/>- Spawn an AI that leaves a black trail and acts like a player character<br/>- Heavy rain washes away most of the color on screen<br/>- A shadow demon unleashes a barrage of projeciles in every direction that burn away paint an stun players.<br/>- Powerups spawn much more frequent for a short time<br/>- Generic football minigame<br/>- An explosion wipes away most of the color on screen, except for sections shielded by a player<br/></p>\n<p>Tag of War and all of it's music, sound, art and assets were created for the Amaze Me Game Jam 2021 by me (Abfalter Bernhard). I uploaded the OST for anyone interested, you have my permission to do what you want with it.<br/></p>\n<p>Special thanks go to <br/></p>\n<p>- my brother Abfalter Daniel for musical advice <br/>- Auer Felix for event ideas and feedback <br/>\r\n- Auer Felix, Jakob Abfalter, Julia Karamell, Michael Klammer and Mathias Klammer for playtesting <br/>- The lovely people on Freesound.org, from whom I got sound raw sound files with creative commons licensing</p>", "metacritic": null, "released": "2021-06-21", "tba": false, "updated": "2021-06-21T03:11:36", "background_image": "https://media.rawg.io/media/screenshots/71b/71bce55b792d83073ead2fc64d5b3577.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 144, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Verburner"], "genres": ["Racing"], "publishers": [], "esrb_rating": null}