{"id": 624401, "slug": "world-end-diner", "name": "World End Diner", "name_original": "World End Diner", "description": "World End Diner is a game of cooking, farm management and running a diner. The player runs a diner for the cute animals and robots that survived on the last island in the world after the destruction of humankind. Players collect fruits and herbs from the woods, harvest crops from the fields, and cook. You will meet lots of animals and robots, explore the forest and discover the history of what happened in the past. As the game progresses, you'll be able to install ovens, juice mixers, refrigerators and more, creating new items in farming, cooking, alchemy and construction to build the best diner.<br/><br/><h3>Game progress</h3>Pancakes, bacon scrambled eggs, burgers, hot dogs, coffee, soda! At World End Diner, you can make a lot of food, drinks and items as well as the standard diner menu. Players can increase the reputation of the diner, gain experience and level up. You can accumulate skill points and acquire abundant skills prepared in the skill tree. Acquire various skills such as harvesting, cooking, agriculture, facilities, crafting, alchemy and so on.<br/><br/><h3>Diner</h3>Let's run the world's last diner in a forest of only animals and robots where humanity has disappeared! Set up tables, chairs and decorations for them, build your diner's reputation, get rewards and unlock new features.<br/><br/><br/><h3>Exploration and gathering</h3>Explore the last island on earth. From the woods, you can collect fruits, herbs, and wild strawberries that are the ingredients for cooking. Various other things are sleeping in the forest, waiting for you to discover them.<br/>", "metacritic": null, "released": "2021-06-18", "tba": false, "updated": "2021-06-21T02:38:22", "background_image": "https://media.rawg.io/media/screenshots/3e2/3e2007abbe7f7c5bd35f6961242bbc4d.jpg", "website": "http://andymente.moo.jp/html/game2/world_end_diner/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 5}, "playtime": 9, "achievements_count": 73, "ratings_count": 0, "suggestions_count": 328, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Andymente"], "genres": ["Adventure", "Simulation", "Indie"], "publishers": ["Andymente"], "esrb_rating": null}