{"id": 624444, "slug": "german-shepherd-crime-chaser", "name": "German Shepherd Crime Chaser", "name_original": "German Shepherd Crime Chaser", "description": "Become one of the bravest dogs ever – German Shepherd working at the police station and catching criminals! Join German Shepherd Crime Chaser and live the life of this brave and brutal dog!<br/><br/>This dog is really smart, so it’s an amazing chance to become this fantastic breed! Explore the large modern city filled with dangerous people committing crimes and cruel stray dogs! Help the police to dispense justice in such an unusual way and become the real mascot of the local police station! Be attentive and careful, otherwise cruel criminals would kick the spirit out of your dog’s body!<br/>Just earn points for successfully completed missions and unlock different colorful skins for your super German Shepherd police dog and customize it as you wish! Power your German Shepherd dog characteristics up to become faster, stronger and summon more allies who would help you to catch different criminals! <br/>Mind your health indicator – if it drops, you won’t help the police anymore! Become the best German Shepherd ever, faithful and strong, and protect this city not only from criminals, but from aggressive dogs too! Remember: they would attack you at the right moment of seeing, so watch out attentively!<br/>Are you ready to become fantastically skillful dog? Of course you are! Live a life of the smartest dog ever – German Shepherd! Find suspicious objects, catch the criminals, fight with dangerous people and dogs and have fun playing German Shepherd Crime Chaser!<br/>German Shepherd Crime Chaser features:<br/>•\tOutstanding city police German Shepherd dog simulator<br/>•\tWide range of different missions for more fun<br/>•\tFight with criminal rivals with special abilities<br/>•\tOpportunity to summon allies for help<br/>•\tRealistic 3D surroundings", "metacritic": null, "released": "2017-07-25", "tba": false, "updated": "2021-06-21T03:02:40", "background_image": "https://media.rawg.io/media/screenshots/aa4/aa4e38c797ef2a60337d27b6e9956a1f_g4EEDMY.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 137, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tayga Games OOO"], "genres": ["Action", "Simulation"], "publishers": ["Tayga Games OOO"], "esrb_rating": "Teen"}