{"id": 6245, "slug": "a-doodle-fly-fly-to-mars", "name": "A Doodle Fly - Fly to Mars", "name_original": "A Doodle Fly - Fly to Mars", "description": "&amp;quot;Like a preschooler&amp;#39;s macaroni sculpture, this game is ugly but charming.&amp;quot; - slidetoplay.com<br/><br/>&amp;quot;Fly to the AppStore and get this highly entertaining game for just $ 0.99!&amp;quot; - app-reciationreviews.blogspot.com<br/><br/>&amp;quot;For $0.99, this is a must pickup. Soon enough you’ll find yourself creating weirder characters than what Jerry created by default.&amp;quot; - theappera.com<br/><br/>&amp;quot;A Doodle Fly is addictive as anything. We recommend that you get this game.&amp;quot; - weplayiphone.com<br/><br/>------------------------------------------<br/>Hold on folks, it could be a bumpy ride! This simple-looking app is going to take you to the moon and back in an attempt to answer the age-old question “Is the moon rabbit real?” Ancient Chinese philosophers agree that there is such a creature lurking about the lunar surface. However, no one has ever been able to confirm or deny the existence of this elusive animal with any amount of certainty. That is, until now. This is your mission, if you choose to accept it.<br/><br/>With A Doodle Fly-Fly To The Moon on your iPhone or iPod Touch, you customize virtually everything to make this game uniquely yours to increase your odds of encountering “The rabbit on the moon”. Begin by either drawing your own customized character on paper and taking a picture of it to download, import one from the internet that you feel is up to this task by saving it, (tap then hold an image in Safari, and an option will pop up to save the image.) and importing it into the game, or choose from one of our pre-selected default characters which we have tucked away in our arsenal. Next, customize your characters with any accessories that you feel will help them. Simply draw them onto the character, and away you go!<br/><br/>A Doodle Fly-Fly To The Moon is an absolute “blast” as you rocket yourself toward outer space with the aid of propeller beanies, springboards, rockets, planes and clouds which all help carry you to greater heights, distances, and levels as you continue your endeavor of attaining knowledge of the moon rabbit. Each time you hitch a ride along with one of these helpers, just watch your elevation and distance elevate as it increases your score.<br/><br/>This addictive game is sure to capture your attention and test the boundaries of your sanity. You’ll find yourself playing this game at all hours of the day and night. Be careful though, or those around you will become curious as to what is so interesting on your phone. You’ll feel it necessary to keep your secret hidden as your levels increase. Eventually someone is bound to ask you what you’re doing on your iPhone or iPod Touch, that’s so important; and you’ll simply reply “Oh, I’m just doodling.”<br/><br/>Follow us on Twitter for updates on our games:<br/>@PrinceHaHata (http://twitter.com/PrinceHaHata)", "metacritic": null, "released": "2009-11-19", "tba": false, "updated": "2019-10-22T14:28:45", "background_image": "https://media.rawg.io/media/screenshots/581/58104f7abc8b4b49d84339835cee18d2.jpeg", "website": "http://j2sighte.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 86, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["j2sighte"], "genres": ["Arcade"], "publishers": ["Jerry Lee"], "esrb_rating": "Everyone 10+"}