{"id": 6246, "slug": "wonderputt", "name": "Wonderputt", "name_original": "Wonderputt", "description": "Award winning Adventure Golf with cows, toads, ski slopes, torpedoes and a sprinkle of alien abduction for good measure.<br/><br/>\"Wonderputt is one of those sharp apps you just have to show everyone\" - Touch Arcade<br/><br/>ADVENTURE GOLF LIKE NO OTHER<br/>From the creator of Icycle: On Thin Ice, Damp Gnat takes you on a putting adventure through a diorama of scientific wonder.  Experience the innocent joy of miniature golf over a polymorphing world while you discover its secrets and indulge in its animated surprises.<br/><br/>• EASY touch and drag control for simple intuitive play<br/>• UNRAVEL Wonderputt's world of geographic delight on 18 unique holes<br/>• UNLOCK Wonder to enable rainbow collectables for that added layer of challenge<br/>• JUMP to any unlocked hole to practice and hone your skills<br/>• COMPETE and refine your scores in 3 Game Center Leaderboards<br/>• COLLECT all 16 challenging Game Center Achievements<br/>• No IAPs or Adverts, just instant relaxing pleasure<br/><br/>\"Ingenious and imaginative level design, with a crisp interface and a great deal of replayability\" - Modojo<br/><br/>\"That's some seriously wonderful art there, and wait until you see it animated\" - Jay is Games<br/><br/>\"It's easy to succeed, and really difficult to master. We are left open-mouthed by this one.\" - E4<br/><br/>AWARDS<br/>• Best Tablet Game Finalist at the Webby Awards 2012<br/>• 2nd Best Mobile Physics Game on Jayisgames 2012<br/>• Best Art Winner at BIG Festival 2012<br/>• Visual Arts Finalist at the IGF 2012<br/>• Visual Arts Finalist at the Develop Awards 2012<br/><br/>Compatible with devices running iOS 8 or later", "metacritic": null, "released": "2011-08-15", "tba": false, "updated": "2019-10-22T14:20:38", "background_image": "https://media.rawg.io/media/screenshots/695/695dcfa538b91d7dd6be54a0c404a013.jpg", "website": "http://www.dampgnat.com/wonderputt/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 5, "beaten": 2, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 119, "game_series_count": 0, "reviews_count": 2, "platforms": ["iOS", "Web"], "developers": ["Damp Gnat"], "genres": ["Adventure", "Sports"], "publishers": ["Damp Gnat"], "esrb_rating": null}