{"id": 624664, "slug": "ghost-n-demon-thesalmonsushi", "name": "Ghost n Demon (TheSalmonSushi)", "name_original": "Ghost n Demon (TheSalmonSushi)", "description": "<p>Control:<br/>Move Right:  \"D\"</p>\n<p>Move Left: \"A\"</p>\n<p>Jump: \"Space\"</p>\n<p>Switch Character :  Press 1 for Demon, Press 2 for Ghost</p>\n<p>Shoot Projectile ability: First change ur character to Demon. Because demon is a mysterious creature to shoot right press N and press A. To shoot left press N and press D. Don't worry you'll get the hang of it  ; ).</p>\n<p>Go Through Walls Ability: First change ur character to Ghost. And then Press R if R doesn't work press T</p>\n<p>BUG FIX:<br/>Indonesian :<br/>- Kalo Gabisa loncat coba ganti2 character pencet 1 terus 2 atau 2 terus 1 <br/></p>\n<p>English:<br/>- If u suddenly can't jump u might want to press 1 and then 2 or 2 and then 1</p>\n<p>Tutorial  in Bahasa Indonesia: <br/>Kalo ada pintu coklat berarti harus cari tombol warna merah gaperlu diteken cukup di kenain sama karakter kita dan pintu coklatnya bakal ilang dan kita bisa lanjut. Kalo ada tembok yang harus kita tembus entah untuk lanjut jalan atau untuk pergi ke tombol merah pake ability Go Through Walls. Kalo ada pintu merah pake ability Shoot Projectile.</p>\n<p>Tutorial in English: <br/>If you see a brown door you have to find the red button, you don't have to press it just make sure ur character touches it, and then the brown door will magically disappear and u can continue into the game. If there is a wall, that u have to go through in order to progress or to reach the red button then use the Go Through Walls ability (To find out more look in Control). If there is a red door blocking you, use the Shoot Projectile Ability (To find out more look in Control).</p>\n<p>P.S.: In level 1 you have 200 seconds to finish the level<br/></p>\n<p>That's it good luck ;))</p>", "metacritic": null, "released": "2021-06-20", "tba": false, "updated": "2021-06-21T03:57:31", "background_image": "https://media.rawg.io/media/screenshots/53d/53d9262d21a7fa3e7d0b0511af37e78a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 78, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["TheSalmonSushi"], "genres": ["Adventure", "Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}