{"id": 62470, "slug": "queens-quest-4-sacred-truce", "name": "Queen's Quest 4: Sacred Truce", "name_original": "Queen's Quest 4: Sacred Truce", "description": "The realm of the Five Kingdoms faces a formidable challenge. A mysterious power is trying to destroy the relationship between humans and elves and start a conflict. What will happen to this legendary world when the covenant of magic between humans, elves, dwarves, goblins and hobbits ends?<br/><br/>After many years of peace between the Five Kingdoms, dark clouds are gathering over the realm of humans and elves. After an attempt to assassinate the Elf King, life's delicate balance, which was only maintained through the magic of the Sacred Truce, has come to end. Friends and neighbors are beginning to turn against each other. Suddenly the tiny village of Saddletown becomes the centre of attention for the entire kingdom – according to the elves it's where the would-be assassin is hiding. It seems that the people of the town must answer for his crimes. <br/>The mayor of Saddletown invites the emissary of the Peacekeepers Guild for a meeting.  The ongoing peace between humans and elves and the fate of Five Kingdoms are in his hands.<br/><br/>Features<ul><li> Play 32 minigames to discover the history of the Five Kingdoms! <br/></li><li> Visit 43 unique places in the world of the elves!<br/></li><li> Travel through a land of magnificent adventure!<br/></li><li> Find cleverly hidden objects!<br/></li><li> Face the magical runes and unlock all 24 achievements.</li></ul>", "metacritic": null, "released": "2018-04-26", "tba": false, "updated": "2020-09-11T12:00:56", "background_image": "https://media.rawg.io/media/screenshots/e10/e10b7ab6d6294cb71a60bdb0cd83bf39.jpg", "website": "http://www.artifexmundi.com/", "rating": 3.83, "rating_top": 4, "added_by_status": {"yet": 2, "owned": 110, "beaten": 4, "dropped": 1}, "playtime": 3, "achievements_count": 73, "ratings_count": 6, "suggestions_count": 621, "game_series_count": 0, "reviews_count": 6, "platforms": ["Xbox One", "Nintendo Switch", "PlayStation 4", "Linux", "macOS", "Android", "PC"], "developers": ["Artifex Mundi", "Brave Giant"], "genres": ["Adventure", "Casual", "Puzzle"], "publishers": ["Artifex Mundi"], "esrb_rating": "Everyone 10+"}