{"id": 62476, "slug": "ghostly-matter", "name": "Ghostly Matter", "name_original": "Ghostly Matter", "description": "Professor Penderghast, the world's leading expert in the capture of ghosts and other supernatural creatures, receives a desperate cry for help over the radio: it's Melvil, his old friend and colleague.<br/>All clues lead to the mysterious Blackwood mansion: an estate located in a remote area of northern Scotland, which is said to be afflicted by a terrible curse. Guide the professor through the darkness and solve the mystery of the haunted house as you try to find out what happened to your missing friend. Solving puzzles, exploring, collecting items and uncovering a mystery form the basis of the game; but there will be no shortage of deadly weapons and explosions, disgusting enemies popping up everywhere and frenetic action.<br/>The first game from the Small Bros studio and developed by single person, Ghostly Matter is a typical metroidvania where mechanics borrowed from graphic adventures combine for an exciting genre crossover.<br/><br/><ul><li>Fully explorable open world map: over 600 rooms with more than 20 evocative, detail-rich settings<br/></li><li>40+ enemies divided into 3 categories<br/></li><li>10 bosses<br/></li><li>14 power-ups that will help you in your adventure, some inspired by the world of ghost hunters<br/></li><li>6 weapons with different behaviours depending on the class of the enemy<br/></li><li>More than 100 collectible items<br/></li><li>Use the \"polterscope\" visor to see ghosts and other hidden items<br/></li><li>Fully customisable CRT filter: decide the blur, curved screen, desaturation and glitch effects<br/></li><li>Dozens of references to the pop culture of the 80s<br/></li><li>Platforming and action combine with graphic adventure mechanics<br/></li><li>Lots of puzzles to solve<br/></li><li>Discover the story little by little by finding clues and talking to NPCs</li></ul>", "metacritic": null, "released": "2018-07-12", "tba": false, "updated": "2019-08-28T21:57:26", "background_image": "https://media.rawg.io/media/screenshots/58e/58e85891a11f7947bccc96ce98f81058.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 30, "dropped": 1}, "playtime": 1, "achievements_count": 35, "ratings_count": 1, "suggestions_count": 308, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Small Bros"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Milestone"], "esrb_rating": null}