{"id": 62475, "slug": "greedy-developers-cash-grab", "name": "Greedy Developer's Cash Grab", "name_original": "Greedy Developer's Cash Grab", "description": "We set out to create an online action game that would be state of the art. It would be set in an immersive world with beautiful art, and a fully realized set of characters with convincing backstories and motivations. It would have responsive, intuitive controls, a class-leading UI system, and a full orchestral soundtrack. Then, about 10 minutes into development, someone reminded us that we are much too lazy to make that game so we made this one instead: <br/><br/>Grab cash, drop bombs, and run from Haters in this thinly veiled attempt to make quick money with a reskin of some Snake game we found on the Internet. In this MMO (Moderately Multiplayer Only) Action game, you'll compete online against other players to see who can stay at the top of the cash score table. Coded in the finest HTML with some art and audio we got on sale from the asset store, this game is a state of the art Steam release.<strong>Features:</strong><ul><li>You want Loot Boxes? We got Loot Boxes! Kind of.<br/></li><li>Dubious DLC that should be part of the main game!<br/></li><li>Fully Pay-To-Win!<br/></li><li>Low Player Population means more room for you in the game!<br/></li><li>Almost Free to Play!<br/></li><li>Chat!<br/></li><li>Annoying Chat Bot that you can't disable!<br/></li><li>Angry Bosses!<br/></li><li>Poo!<br/></li><li>Free Ads! Ad Free!</li></ul><br/><br/>Surprisingly, the game turned out to be really fun.   We saw an opportunity to fill our sports cars with gas and bikini models - so spend, spend, spend!  Your sacrifice of a few dollars helps us stay focused on making more greedy games.<br/><br/>- Greedy.<br/><br/>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-23T12:11:44", "background_image": "https://media.rawg.io/media/screenshots/8e3/8e300e9879425205f72528f68828de40.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 98, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Greedy Developer"], "genres": ["Action", "Casual", "Massively Multiplayer", "Indie"], "publishers": ["Greedy Publisher"], "esrb_rating": null}