{"id": 62486, "slug": "moai-v-collectors-edition", "name": "MOAI V: Collector’s Edition", "name_original": "MOAI V: Collector’s Edition", "description": "Powerful magic is at your fingertips as you prepare for a ceremony that will protect your island home! Guide the young twins Hika-Ri and Kao-Ri as they go their separate ways on a journey that will culminate in a once-in-a-lifetime experience. As they gather the items and skills they will need to perform a ritual that will save their people from disaster, you will control them one at a time, strategically gathering and managing resources, repairing villages and completing quests for the natives they encounter.<br/><br/>You will also unleash the power of nature to ward off hurricanes, droughts, floods and more by drawing elemental signs on your screen using your mouse cursor. This innovative approach to casting spells will save you precious time as you race against the clock to earn achievements, unlock bonus levels and find magic items that can help you complete levels even faster.<br/><br/>Containing dozens of levels set in lush tropical environments, eerie caves, fiery deserts, snow-capped mountains and an underwater kingdom, Moai 5 is packed with jaw-dropping visuals and animations. All this and more is wrapped up in a thrilling narrative told through gorgeous hand-drawn story scenes.<br/><br/>Hika-Ri and Kao-Ri are ready to begin the adventure of a lifetime. Will you join them?<br/><br/><br/><ul><li>Dozens of captivating levels<br/></li><li>An easy mode for new players<br/></li><li>Downloadable artwork and music<br/></li><li>A detailed walkthrough of each level<br/></li><li>A step-by-step tutorial</li></ul>How to play:<br/>1. Remove obstacles.<br/>2. Collect resources.<br/>3. Build and repair production facilities.<br/>4. Complete the quests for the level.", "metacritic": null, "released": "2018-03-29", "tba": false, "updated": "2023-01-02T18:25:40", "background_image": "https://media.rawg.io/media/screenshots/b92/b9224336a7602261c8731c5bbdf3e821.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 14, "dropped": 1}, "playtime": 6, "achievements_count": 71, "ratings_count": 2, "suggestions_count": 354, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Toyman Interactive"], "genres": ["Simulation", "Casual"], "publishers": ["Buka Entertainment"], "esrb_rating": null}