{"id": 625082, "slug": "sea-of-graves", "name": "Sea of Graves", "name_original": "Sea of Graves", "description": "<p>In Hazelwood, everyone has a secret. Dark things lurk in the shadows, behind the hedges, and sometimes even in your neighbor. You can never tell with these things, really.\r\nNow there’s a new mystery: teens have been going missing, all determined to be runaways, all written off and forgotten. But someone has to do something, someone has to figure out what’s going on and who (or <em>what</em>) is behind it all.\r\n</p>\n<p>Can the truth be uncovered before it’s too late?\r\n</p>\n<p>And what if the truth is something you don’t want to know…\r\n</p>\n<p><strong>Rowan “Ro” Locke: Main Character</strong>\n</p>\n<p>Sent away at fourteen to a school for rejects and delinquents, she decided to do everything she could to become the person no one ever thought she could be. Upon graduation, she was offered a job in a prestigious organization with a mysterious reputation.\r\n</p>\n<p>After years of work as an archival assistant, she finally gets to become a field agent… and is promptly transferred to the one place she never thought she’d have to come back to.\r\n</p>\n<p><strong>Kit Evans: The Nemesis</strong>\n</p>\n<p>There was something about them that always rubbed Ro the wrong way. But that seemed to be mutual. Since the moment the two met, they did not get along. From stolen pencils to black eyes and broken noses, Rowan and Kit have gone through it all in the worst of ways.\r\n</p>\n<p>The return of their old enemy changes things in ways that they would have never guessed. Whether that’s a good or a bad thing is up for debate.\r\n</p>\n<p><strong>Dwyn Douglas: The Old Partner-in-Crime</strong>\n</p>\n<p>The smartass old friend who always had Ro’s back, no matter what kind of dangerous nonsense they got into. After her sudden disappearance, he was devastated, but there was little he could do to get her back.\r\n</p>\n<p>Being the son of the owner of the oldest pub in town has its perks: Dwyn is the person you want to talk to when you want to know anything about anyone. But in Hazelwood, knowing things doesn’t always pay off.\r\n</p>\n<p><strong>John Hollins: The New Guy</strong>\n</p>\n<p>John moved to town a few years ago for work and to be closer to his grandma so that he could take care of her.\r\n</p>\n<p>As a part of the Blackthorn Institute, John is a <em>somewhat</em> senior agent to Rowan.\r\n</p>\n<p>There are many unknowns when it comes to him, but one thing is very clear: he wants to help (even if he doesn’t always know what to do).\r\n</p>\n<ul><li>A small-town mystery\r\n</li><li>A disastrous (?) investigation and a shadowy organization\r\n</li><li>3 potential love interests. You choose what kind of relationships you want: romantic, platonic, or antagonistic. Romances are 100% optional!\r\n</li><li>Your answers will shape you as a person and alter which paths become open to you\r\n</li><li>+more\r\n</li></ul>\n<p>Maybe a little unusually, Sea of Graves begins its life as an Interactive Fiction story, that will eventually turn into a visual novel.\r\n</p>\n<p>More choices will eventually be added! Along with (possibly) even more features. </p>\n\n<p><strong>Currently, in the demo:</strong>\n</p>\n<ul><li>Read Chapter 1 + Extra Materials\r\n</li><li>Meet 2/3 of the potential RO's\r\n</li><li>Get to experience the definitely very normal and not weird at all things that happen in Hazelwood\r\n</li><li>Total word count (so far): 11.5k+\r\n</li></ul>\n<p>Tumblr || Twitter</p>", "metacritic": null, "released": "2021-06-19", "tba": false, "updated": "2021-06-21T05:37:42", "background_image": "https://media.rawg.io/media/screenshots/8ec/8ec6bd4a42ace478a65b7e7a20da017e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 52, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["House Miroe"], "genres": [], "publishers": [], "esrb_rating": null}