{"id": 62505, "slug": "genesis-noir", "name": "Genesis Noir", "name_original": "Genesis Noir", "description": "<p>Genesis Noir is set before, during, and after The Big Bang. To save your love, you must stop the expansion of the universe.<br />\nA love triangle gone askew as cosmic beings quarrel in the dark nether of pre-creation. Confrontation and a shot fired. A Big Bang. The birth of the universe, an expanding force of destruction, the Earth a fragment of shrapnel hurtling towards the fragile heart of a god.<br />\nCan you find a way to stop the Big Bang and save her?<br />\nWe&#39;ve made a short story on the web that will give you a taste of the tone and interactions you&#39;ll find in Genesis Noir. Try the teaser experience at http://GenesisNoirGame.com/teaser</p>\n<p>The Game<br />\nGenesis Noir is an adventure game with an emphasis on exploration, tactile interactions, and generative art. You will wander around 3D starscapes and 2D vignettes. You will collect cosmic clues solve little puzzles and play with particles. You might even destroy the universe.</p>\n<p>Discover worlds familiar and alien. Explore nebulae, asteroid fields, black holes, primordial Earth, and jazz cafes. Become acquainted with the massive, the microscopic, and everything in between.</p>\n<p>Play with generative systems and discover what they create. Express yourself by planting seeds, transforming landscapes, creating and destroying stars, or improvising a jazz duet.</p>", "metacritic": 80, "released": "2021-03-26", "tba": false, "updated": "2024-04-14T17:04:43", "background_image": "https://media.rawg.io/media/games/dec/decdfa154a72265cd2914097666a99d5.jpg", "website": "http://genesisnoirgame.com", "rating": 3.61, "rating_top": 4, "added_by_status": {"yet": 70, "owned": 804, "beaten": 57, "toplay": 89, "dropped": 43, "playing": 5}, "playtime": 2, "achievements_count": 14, "ratings_count": 77, "suggestions_count": 492, "game_series_count": 0, "reviews_count": 77, "platforms": ["macOS", "Xbox One", "Nintendo Switch", "PC"], "developers": ["Feral Cat Den"], "genres": ["Adventure"], "publishers": ["Fellow Traveller"], "esrb_rating": null}