{"id": 625008, "slug": "orbes-inter-orbes", "name": "Orbes Inter Orbes", "name_original": "Orbes Inter Orbes", "description": "<p>Orbes Inter Orbes</p>\n<p>-----------------------</p>\n<p>Controls:\r\n</p>\n<p>Up Arrow Key: Apply thrust away from the sun\r\n</p>\n<p>Left Arrow Key: Apply thrust to move yourself counterclockwise around the sun\r\n</p>\n<p>Right Arrow Key: Apply thrust to move yourself clockwise around the sun\r\n</p>\n<p>Run into the orbiting canisters to pick them up and regain a small amount of power and a point, don't run out of power or crash into a planetary body!</p>\n<p>------------------------</p>\n<p>Disaster! \r\n</p>\n<p>Moving into an uncharted system, your ship has suffered a mishap, losing most of its power cells and scattering your reserves (and you!!!) into orbit around the nearby sun! Grab as many of your lost power cells as you can before you run out of power and/or crash into a planet and/or sun!</p>\n<p>--------------------------</p>\n<p>This project was made over about a half-day in Pico8 as part of the Tweettweet jam, challenging people to make a game having the length of 2 tweets (560 characters) or fewer. I ended up hacking this down from slightly over 1000 characters to dead on 560, which was extremely hard. It mostly survived intact, albeit with slightly worse collision and being forced to run at 30fps rather than 60 unfortunately. The very last thing did was removing an entire button input, you used to be able to thrust both towards and away from the sun!There is one potential bug that I'm aware of. If you spawn and a planet instantly spawns on top of you, reload the game. I would fix this behaviour, but doing so in 0 characters or fewer is quite the ask! I hope you enjoy it!</p>\n<p>Devlog: https://aristaeus.neocities.org/posts/2021-06-20-Bits-and-Bobs:Orbes-Inter-Orbes...</p>", "metacritic": null, "released": "2021-06-19", "tba": false, "updated": "2021-06-21T05:21:56", "background_image": "https://media.rawg.io/media/screenshots/7fd/7fd3a75d1748da823ab8225bb12a7133.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Aristaeus890"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}