{"id": 625068, "slug": "fathers-day-quantum-sheep", "name": "Father's Day (Quantum Sheep)", "name_original": "Father's Day (Quantum Sheep)", "description": "What is this, Sheepy?\r\n<p>The Fathersheep has been incredibly patient and supportive this last year, so I wanted to make him a tiny 'adventure card' to say 'thank you' :)<br/></p>\n<p>While making it, I figured I could make multiple versions so that other people could pick the 'card' with the most appropriate message. </p>\n<p>So this is for you and your dad. It has son/daughter versions, different message types (like you get in a card, right?) and I'll be adding the source project so you can edit it to better fit your needs!</p>\n<p>The game itself is really simple and tiny. It's supposed to be like an interactive card or something.</p>\n\r\nDownloads:\r\n<p>You'll need a spectrum emulator to be able to play these!</p>\n<p>I've divided the files into (d) and (s) variants. D = from a daughter, S = from a son.</p>\n<p>There are four messages in each son/daughter zip file (.tap download 1-4)</p>\n<strong>Message 1:</strong> <em>Thank you. For everything.</em>\n\r\nMessage 2: <em>I'm grateful for you, Dad, and I'm not sure I'll ever be able to pay you back for all that you've done for me.</em>\r\n\r\nMessage 3:<em> I'm so lucky to have you in my life, Dad</em>\r\n\r\nMessage 4: <em>Thanks for being the coolest Dad on the block!</em>\n\n<p>I hope that makes sense!</p>\r\n\r\nExtras:\r\n<p>I've also attached the original project file: fathersday2021_template.xml</p>\n<p>You will need a copy of Lantern to open it up, which you can get for free here.<br/></p>\n<p>You'll be able to edit all sorts, really, so have a look if you'd like to further personalise the card!</p>\n<p>If your Dad gets stuck, the solution to the game (SPOILERS) can be seen in the tiny text below:</p>\r\nTake drink, drink drink, take key, unlock drawer, take tape, put tape in VCR, play tape\r\n\r\nFinal Thought:\r\n<p>And finally, for those whose Fathers aren't with them anymore. I'm sorry. You have lived my greatest fear, and I know one day I'll share that awful sense of loss :(</p>\n<p>For now, all I can offer are my sincere sympathies and the hope that I've not made anyone feel worse with this.</p>\n<p>*sheepyhugs*</p>", "metacritic": null, "released": "2021-06-19", "tba": false, "updated": "2021-06-21T05:34:50", "background_image": "https://media.rawg.io/media/screenshots/236/2366602d218d76af022b851586d8eeda.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 74, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Quantum Sheep"], "genres": [], "publishers": [], "esrb_rating": null}