{"id": 625158, "slug": "the-doom-of-the-pond-la-coza-de-la-poza", "name": "The Doom Of The Pond (La coza de la poza)", "name_original": "The Doom Of The Pond (La coza de la poza)", "description": "<p><strong>The manual in Spanish is below the manual in English.  <br/>El manual en castellano está debajo del manual en inglés.<br/></strong></p>\n<p><strong>Technical Info / Datos técnicos:</strong><br/></p>\n<p>- <strong>Furillo Productions</strong> are / <strong>Furillo Productions</strong> somos: <strong>IADVD &amp; Molomazo</strong>.<br/></p>\n<p>- Original concept &amp; characters / Idea original y personajes: <strong>Molomazo</strong>.</p>\n<p>- Design &amp; graphics / Diseño y gráficos: <strong>Molomazo</strong>.</p>\n<p>- Code &amp; FX / Programación y FX: <strong>IADVD</strong>.</p>\n<p>- Music/Música: <strong>IADVD</strong>.</p>\n<p><strong>- Created under a customization of the MK1 128K Framework from the Mojon Twins / Creado con una especialización de creación propia del entorno de trabajo MK1 128K de los Mojon Twins.</strong><br/></p>\n\n<p><strong>MANUAL IN ENGLISH</strong><br/></p>\n<p><strong>Furillo Productions</strong> presents: \r\n  </p>\n<p><strong>The Doom of the Pond</strong>\n</p>\n<p> </p>\n<p>An antihero, an ancient legend, a cult of priestesses, horrible monsters, killer clowns, strange messages, old pictures...  all this and much more on Furillo Productions' first interactive text adventure for the ZX Spectrum  128k! Are you going to miss it?\r\n </p>\n<p><strong>IMPORTANT! There are two downloadables in the English version! One of them is the game itself (.tap) and the other one is a JUKEBOX (also .tap) including all the soundtracks of the game. All for free. If you like them and you feel that you want to make a donation, it will help us to continue doing free games. But the most important thing is your feedback: please let us know your thoughts about the game below, at the comments block(*). Cheers!<br/></strong></p>\n<p><strong>(*) Grammar and syntax corrections about the texts are also very welcomed! we are not English-spoken natives and probably they are not very accurate.</strong>\n</p>\n<p><strong>Story:\r\n    </strong></p>\n<p>Bernard Valley, a dystopian June 1980...  <strong>Peter  Parrish</strong> is a lonesome and shady ex-director of obscure \"customer  service\" companies. He is  about to leave <strong>Arrollito and Pozolón</strong>, the  turtles that his nephews gave him for his birthday that does not want to  clean and feed, at the pond of the village, the place where everybody  abandons their pets... <strong>Parrish</strong> will soon realize that his life will  change forever.\r\n    </p>\n<p><strong>Controls (by default, can be redefined):     \r\n    </strong><br/></p>\n<p>       O / joystick left: left.<br/></p>\n<p>       P / joystick right: right.</p>\n<p>      Q / joystick up: up.         </p>\n<p>      A / joystick down: down.         </p>\n<p>      SPACE / joystick fire: select / fire.               <br/>\n</p>\n<p><strong>The Game:</strong><br/></p>\n<p><strong>Will you survive the pond and its beings? </strong><br/></p>\n<p>\"The Doom of The Pond\" is an interactive survival horror text  adventure. Our approach has been using a menu (keyboard + fire for  selection) instead of a parser based input (by typing commands, e.g.  \"get\", \"eat\"...).\r\n    </p>\n<p><strong>The main menu:\r\n    </strong><br/>\n</p>\n<p>The default keyboard is Q, A (up-down) and space to select.</p>\n<p>Once you redefine the keys, you can use the new set to move along the main menu. If you play with a joystick, if you die and return to the main menu, you can use the joystick to move along the menu as well.</p>\n<p><strong>Content of the Main Menu:     \r\n    </strong></p>\n<p>- KEYBOARD: play using the keys.       </p>\n<p>- KEMPSTON, SINCLAIR: play using the desired joystick.       </p>\n<p>- TROPHIES: will show the trophy room where you can check the monsters  of the pond that you were able to hunt  (the game explains the story  about the monsters).           </p>\n<p>- PICTURES: see the pictures that you have found along the pond.       </p>\n<p>- PASSWORD: see the current password. If you copy it somewhere and  another day you load the game and introduce the password, you can start  the game with the monsters you already hunted, the pictures you have  already found and from the last in-game save point you reached before. Hint: when you recover a game the pictures that you still did not found can appear in any place of the pond, even in the same places where you found the ones you already have.<br/></p>\n<p>- REDEFINE: redefine the keys of the game.\r\n    <br/>\n</p>\n<p><strong>The in-game menu:</strong><br/> </p>\n<p>In order to control the game you have a in-game action menu with the following options:\r\n    </p>\n<p>- Search / Get:  search things and take them in the place where you are right now.\r\n    </p>\n<p>- Give / Use: select one object from your inventory and use it or give it to somebody else.\r\n    </p>\n<p>Important! When you want to use or give something, just go to the  Give / Use inventory, and if the object that you want to give or use can  be given or used in the present location, the action will appear below  the name of the object.  If nothing appears below of the object, it  means that right now that object is not meant to be given or used in the  current location.     </p>\n<p>- Eat / Drink: eat or drink something from your inventory.\r\n    </p>\n<p>- Music On / Off: switch on/off the background music of the game.\r\n    </p>\n<p>- Go to/ Action: go to a different place or perform an action related with the present location.\r\n    </p>\n<p>- See Pictures: see the pictures you found along the pond so far.\r\n    </p>\n<p>- See Trophies: see the monsters you hunted so far.\r\n    </p>\n<p>- Hunt Monsters: hunt the monsters of the pond. This option will appear later while playing the game.\r\n    <br/></p>\n<p><strong> \r\n  At the pond there are three types of objects:\r\n    </strong></p>\n<p>- Food / Drinks (when you find them they will appear at the Eat / Drink inventory).\r\n    </p>\n<p>- Objects that can be given or used (when you find them they will appear at the Give / Use inventory).\r\n    </p>\n<p>- Weapons: they will be use randomly when a battle happens (if they attack you or you go hunting).\r\n    <br/></p>\n<p><strong>Life:\r\n    </strong><br/>\n</p>\n<p>You've got 255 energy points. The energy (or life) is lost when  fighting with monsters or when you take a wrong decision in the history  and you die: in that case, if you still got enough energy, you will be  resurrected back to the last location where you made the wrong decision  (you will be penalized -20 energy points to be resurrected).     </p>\n<p>The game will last until you lose all your energy. Do not forget  checking the remaining energy from time to time, at the Give / Use  inventory, at the Eat / Drink inventory, or at the battle screen.\r\n    <br/></p>\n<p><strong>Fights (hunting monsters):\r\n    </strong></p>\n<p>There are aplenty of monsters at the pond! The will attack you  randomly, but you can also hunt them. In the battle screen you can check  the remaining energy of the monster and your remaining energy. You can  capture a monster when it has 0 points of energy and you touch it with  the red skull. If you touch it with the red skull and still has some  energy, it will flee. Be careful because if you lost all your energy, you  will die and return to the main menu. If you do not want to fight you  can flee. Initially it is difficult to hunt the monsters, but as soon as  you start finding weapons here and there it gets easier to hunt them  all!\r\n    <br/></p>\n<p><strong>Important points:\r\n    </strong><br/>\n</p>\n<p>- Even if you die and return to the main menu, all the pictures that  you found and the monsters that you hunted will be kept. So if you  start again the game, you still will have them. \r\n    </p>\n<p>- There are in-game save points (the lighthouses). If you die and  return to the main menu, if you start again, you will be prompted if you  wish to start from the last saved point.     <br/>\n</p>\n<p><strong>MANUAL EN CASTELLANO</strong><br/></p>\n<p><strong>Furillo Productions</strong> presenta:<br/><br/><strong>La Coza de la Poza</strong><br/><br/></p>\n\n<p>Un antihéroe, una antigua leyenda, un culto de sacerdotisas, horribles montruos, payasos asesinos, mensajes de sabiduría popular, fotografías antiguas... ¡todo eso y muchísimo mas en la primera aventura conversacional interactiva de Furillo Productions para el ZX Spectrum 128k! ¿Te lo vas a perder?</p>\n<p><strong>¡Importante! Hay dos archivos para descargar en castellano. Uno es el juego (formato .tap) y una gramola (también en formato .tap en el archivo llamado JUKEBOX) que incluye todas las canciones del juego para ser escuchadas como si fuese un cd de música. Todo totalmente gratis. Si te gusta y te apetece puedes hacer una donación al descargar que nos ayudará a seguir haciendo juegos. Y lo que mas nos ayuda: déjanos comentarios acerca del juego en la zona de comentarios de esta página. ¡Gracias!</strong></p>\n<p><strong>Historia:</strong><br/></p>\n<p>Bernard Valley, junio de un distópico 1980...  <strong>Peter Parrish</strong> es un solitario y turbio ex-director de empresas de servicios venido a menos. Se dirige a dejar a su suerte a <strong>Arrollito y Pozolón</strong>, las dos tortugas de agua que le regalaron sus sobrinos, que, con tal de no limpiar y dar de comer, pretende tirar a la poza del pueblo, donde todo el mundo abandona a sus mascotas... lo que <strong>Parrish</strong> no sabe es que su vida cambiará para siempre.</p>\n<p><strong>Controles por defecto (redefinibles):\r\n    </strong><br/></p>\n<p>      O / joystick izquierda: izquierda.\r\n    </p>\n<p>      P / joystick derecha: derecha.\r\n    </p>\n<p>      Q / joystick arriba: arriba.\r\n    </p>\n<p>      A / joystick abajo: abajo.\r\n    </p>\n<p>      ESPACIO / joystick disparo: seleccionar / disparo.</p>\n<p><strong>El juego:</strong><br/></p>\n<p><strong>¿Podrás sobrevivir a la poza y sus seres? </strong></p>\n<p>\"La coza de la poza\" es una aventura de texto interactiva de terror de supervivencia.  Nuestra versión ha elegido en vez de la interacción clásica escribiendo el texto (tipo escribir \"busca\", \"usa\", etc.) la interacción a través de un menú que siempre está disponible en pantalla (se mueve con el teclado y se elige con disparo).</p>\n<p><strong>Menú principal:</strong><br/></p>\n<p>\r\nPara moverse por el menú por defecto, usa Q, A y espacio para seleccionar.\r\n</p>\n<p>Una vez que redefinas las teclas podrás usar dichas teclas. Después de jugar con un joystick, si regresas al menú principal también puedes usar el joystick para moverte o seleccionar las opciones.</p>\n<p>Contenido del Menú:</p>\n<p>- TECLADO: empezar el juego con teclado.</p>\n<p>- KEMPSTON, SINCLAIR: jugar con joystick.</p>\n<p>- TROFEOS: ir a la sala de trofeos donde puedes ver los monstruos capturados (el juego te contará la historia de los monstruos).</p>\n<p>- MENSAJES: ver los mensajes de sabiduría popular encontrados en la poza. Nota: ¡si juegas la versión inglesa son fotografías misteriosas, así que si te atreves con el inglés tienes otro juego distinto que probar!<br/></p>\n<p>- CLAVE: ver la actual clave del juego. Otro día puedes jugar si escribes esta clave y recuperarás los mensajes encontrados y los monstruos capturados y podrás empezar desde el último punto de salvado automático del juego. Pista: cuando cargas el juego otro día, los mensajes que todavía no hayas encontrado pueden aparecer en cualquier lugar de la poza donde aparecen normalmente los mensajes (incluso en los mismos lugares donde encontraste los que ya tienes, así que busca bien).<br/></p>\n<p>- REDEFINE: redefinir las teclas del juego</p>\n<p><strong>El menú de control del juego:</strong><br/></p>\n<p>El juego se controla con un menú de acciones, que dispones de las siguientes opciones:\r\n</p>\n<p>- Buscar / Coger:  buscar objectos en el lugar donde estás y añadirlos a tu inventario.\r\n</p>\n<p>- Dar / Usar: elegir un objeto de tu inventario y usarlo o dárselo a alguien. </p>\n<p>Importante! Cuando quieras usar o dar algo, entra al inventario de Dar / Usar y, debajo del objeto que quieres dar o usar, si en la pantalla de la historia donde estas ahora se puede usar, entonces saldra un mensaje con la acción que puedes hacer. Si no sale nada debajo del nombre del objeto, entonces no puedes hacer nada con ese objeto en ese punto de la historia/lugar en concreto.</p>\n<p>- Comer / Beber: comer o beber algo de tu inventario.</p>\n<p>- Musica On / Off: poner o quitar la música de fondo del juego.\r\n</p>\n<p>- Ir a / Accion: ir a otro lugar o realizar una acción que esté disponible en el lugar actual.\r\n</p>\n<p>- Ver mensaje: ver los mensajes de sabiduría popular que hayas encontrado hasta el ;momento por la poza (en la versión inglesa verás las fotografías que hayas encontrado hasta el momento por la poza).\r\n</p>\n<p>- Ver trofeos: ver los monstruos de la poza que has capturado hasta el momento.\r\n</p>\n<p>- Cazar monstruos: cazar monstruos de la poza. Esta opción aparece en el menú más tarde a lo largo del juego.</p>\n<p><strong>Tipos de objetos: </strong><br/></p>\n<p>En la poza puedes encontrar tres tipos de objetos:</p>\n<p>- Que se pueden comer (cuando los encuentres aparecerán en el inventario de Comer / Beber) .</p>\n<p>- Que se pueden usar o dar (cuando los encuentres aparecerán en el inventario de Dar / Usar).</p>\n<p>- Armas: se usarán de forma aleatoria en las batallas contra los monstruos, cuando ellos te ataquen o tu vayas de caza.</p>\n<p><strong>Vida: </strong><br/></p>\n<p>Dispones de 255 puntos de energía / vida. La energía se pierde en las peleas con monstruos, o cuando tomas una opción equivocada en la historia y mueres (en cuyo caso mientras tengas energía \"resucitas\" en la última pantalla donde te equivocaste, penalizando -20 puntos de energía por resucitar).</p>\n<p>El juego durara mientras tengas energía /  vida, así que puedes morirte varias veces y seguir jugando. Revisa la energía que te queda en el menú de Comer / Beber, en el de Dar / Usar o en la pantalla de las batallas con monstruos. Recuerda comer de vez en cuando para recuperar energía, no te despistes.</p>\n<p><strong>Peleas (cazar monstruos):</strong><br/></p>\n<p>¡En la poza hay monstruos en todos los sitios! Te atacarán aleatoriamente, aunque tu también podrás decidir cuando atacarlos a lo largo de la historia. En las batallas podrás observar la energía que le queda al monstruo para poder ser capturado y la que te queda a ti. Ojo: si pierdes toda la energía peleando se acabó el juego. Puedes huir cuando no te interese pelear porque tengas poca energía. Un monstruo es capturado cuando su energía es cero y consigues que la calavera le toque. Si la calavera le toca pero le queda energía, entonces huirá y no le capturarás. Al principio es difícil ganar a los monstruos, pero todo sera más fácil según vayas encontrando armas por ahí.</p>\n<p><strong>Puntos importantes:</strong><br/></p>\n<p>- Aunque pierdas y vuelvas al menú principal, los monstruos y mensajes que ya hayas encontrado NO los pierdes. Al empezar el juego los tienes de nuevo.</p>\n<p>-  Hay puntos en el juego que salvan la partida (los faros), si mueres y vuelves al menú principal, al jugar de nuevo te preguntará si quieres empezar desde el último punto guardado.</p>", "metacritic": null, "released": "2021-06-19", "tba": false, "updated": "2021-06-21T05:56:57", "background_image": "https://media.rawg.io/media/screenshots/8dc/8dc0e97f585ea80c1db7ed5ceb4cef23.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 348, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Furillo Productions"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}