{"id": 62520, "slug": "shantae-half-genie-hero-ultimate-edition", "name": "Shantae: Half-Genie Hero Ultimate Edition", "name_original": "Shantae: Half-Genie Hero Ultimate Edition", "description": "<p>Shantae embarks on her first full HD adventure! When a mysterious crime wave sweeps Sequin Land, it’s up to Half-Genie Hero Shantae to save the day! Use Shantae’s devastating Hair-Whip Attack to send monsters flying, or Belly Dance to transform into a more powerful creature form! Topple the masterminds behind each criminal caper and prepare for the ultimate showdown against Shantae’s arch nemesis - the bodacious buccaneer Risky Boots!<br />\nKey Features:<br />\n• Shantae’s trademark moves return! Dance to transform into all-new and classic creatures, or summon magical attacks! Over a dozen dances to discover in all!<br />\n• New Relic System allows players to unlock new powers and customize moves for Shantae and her many forms!<br />\n• Conquer arcade-style action stages that unfold into a full world to explore. Fast action and quest-style exploration rolled into one!<br />\n• When Shantae’s story ends, you’re just getting started! DLC Modes introduce new characters, levels, and bosses!<br />\n• Huge Bosses, humorous dialogue, and the wonderfully weird Shantae cast return, now in fully animated HD!<br />\nThis all-inclusive version comes with all of the previously released DLC, Modes, and Costumes!<br />\nSave the day as belly dancing half-genie Shantae! Conquer Sequin Land as the evil Risky Boots in ‘Pirate Queen’s Quest’! Swap between Sky, Bolo, and Rottytops in ‘Friends to the End’! And finally, wall-jump as Ninja Shantae, soak up sun as Beach Shantae, serve justice as Officer Shantae!<br />\nAlso includes Tinkerbat Transformation, Blue Shantae &amp; Classic Risky costumes!</p>", "metacritic": null, "released": "2018-05-08", "tba": false, "updated": "2023-09-10T06:07:02", "background_image": "https://media.rawg.io/media/screenshots/6fa/6fa0b933431114c24980219204923bc7.jpg", "website": "https://wayforward.com/games/shantae-half-genie-hero/", "rating": 3.84, "rating_top": 4, "added_by_status": {"yet": 17, "owned": 234, "beaten": 31, "toplay": 28, "dropped": 5, "playing": 5}, "playtime": 3, "achievements_count": 213, "ratings_count": 35, "suggestions_count": 477, "game_series_count": 0, "reviews_count": 37, "platforms": ["Xbox One", "PlayStation 4", "Nintendo Switch", "PC"], "developers": ["WayForward Technologies"], "genres": ["Action", "Adventure", "Indie", "Platformer"], "publishers": ["WayForward"], "esrb_rating": null}