{"id": 6252, "slug": "colords", "name": "Colords", "name_original": "Colords", "description": "Become the best warrior and get the max rank and score in this highly addictive game.<br/><br/>Merge characters cells with the same color to create a more value cell that will allow you to attack the enemies with the same color.<br/><br/>Colords is a endless game where the target is simple: GET THE MAXIMUM SCORE AND RANK ATTACKING ENEMIES !!<br/><br/>With nice characters and colorful graphics and effects, is an amazing game for the entire family. <br/><br/>Colords is user friendly and intuitive. Fast learning and very easy controls.<br/>All you have to do is drag the finger in the board horizontally and vertically to move the cells  and merge cells of the same color and launch your attacks against your enemies.<br/><br/>Colords offers:<br/><br/>* Addicting gameplay. Play once and once and make different strategies to get more points.<br/>* Infinite fun. You can not stop to play to try to improve your score.<br/>* Colorful and friendly graphics for everyone.<br/>* Combos that boost your score.<br/>* Special items to improve your game.<br/>* World-wide Leaderboard - Try to be the first one in the global ranking of GameCenter.<br/>* Achievements - Try to unlock all the achievements of the game. Can you be the best?<br/><br/>Interested on know more about Colords? Start your fantasy adventure today!<br/><br/>Already a fan of Colords? Be sure to visit Colords Facebook page, or follow Colords on<br/>Twitter to stay up to date with everything!<br/><br/>https://www.facebook.com/colordsgame<br/>https://twitter.com/colords_game", "metacritic": null, "released": "2014-10-08", "tba": false, "updated": "2019-10-22T14:28:46", "background_image": "https://media.rawg.io/media/screenshots/dfa/dfaa02084c12627d3932d257a8f5f4c3.jpeg", "website": "http://www.massivefun3d.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 81, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Fernando Ruiz"], "genres": ["Arcade", "Puzzle"], "publishers": ["Fernando Ruiz"], "esrb_rating": "Everyone 10+"}