{"id": 625374, "slug": "scrapyard-junkbots", "name": "Scrapyard Junkbots", "name_original": "Scrapyard Junkbots", "description": "YOU ARE A ROBOT\r\n<p>The world is a harsh and dangerous place for a rag-tag group of self-made bots. When your home’s energy core begins to deteriorate, it is up to you to seek out the lost arcano-tech to fix it. When news reaches you of a coven of eldritch machines approaching from the East, it is up to you to learn whether they might be trusted to join you, or whether their intentions are to turn your home back into scrap metal. And when the hordes of the Singularity blot out the sun, it’s up to you to save your little robot family from annihilation.</p>\n<p><em>Scrapyard Junkbots</em> is a fast-paced, high-action roleplaying game illuminated by the LUMEN system by Spencer Campbell of GIla RPGs. In it, you play junky, scrappy, yet incredibly powerful robots fighting to save your home. </p>\r\nQUICKSTART\r\n<p>The quickstart can be downloaded for free, and includes everything you need to run a basic game, including: </p>\n<ul><li>Basic Rules</li><li>3 Character Models with Quickstart Character Sheets (Mechanic, Tank, and Ghost)</li><li>5 Enemy Statblocks</li></ul>\r\nTHE FULL GAME INCLUDES\r\n<ul><li>Full Rules</li><li>7 Character Models with Unique Power and Abilities (Mechanic, Tank, Ghost, Necromech, Crowbot, Eldritch Machine, and Swarmcrafter)</li><li>9 Weapon Upgrades</li><li>17 Enemy Statblocks</li><li>Robot Identity Mechanics</li><li>Blank Character Sheet</li><li>7 Quickstart Character Sheets, 1 for each Model</li></ul>\r\nITCHFUNDING\r\n<p>This game is part of the Lux Collective, and currently itchfunding through August 2021! Currently my only goal for this is to write and release a more complete and expanded version of the game, including:</p>\n<ul><li>More Augments and Modular Character Creation options, allowing you to build the perfect robot to suit your playstyle</li><li>More Weapon Upgrades</li><li>Character Leveling Options</li></ul>\n<p>And if I blow past this goal, we may be looking at some stretch goals such as:</p>\n<ul><li>Pre-written adventures?</li><li>Maps??</li><li>More???</li></ul>", "metacritic": null, "released": "2021-06-18", "tba": false, "updated": "2021-06-21T06:49:20", "background_image": "https://media.rawg.io/media/screenshots/a59/a59f924d8aaaaf7e09acdeb3e655002a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 71, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["André Geleynse"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}