{"id": 625437, "slug": "the-last-poem-trials-of-poe", "name": "The Last Poem: Trials of Poe", "name_original": "The Last Poem: Trials of Poe", "description": "<p>NOTE: The demo is a tad too large (by .7gb) so, here's the link to it on Dropbox or you can download it from the Steam page here!</p>\n<p>PLEASE READ BEFORE DOWNLOADING THE DEMO, Thank you!! :)<br/><br/>Keyboard Controls:<br/>Arrows: Movement<br/>F: Interaction / Ok for Dialogue Progression<br/>Q: Basic Attack<br/>W, E, R: Skill Attacks (Once Equipped)<br/>A: Skill Tree<br/>D: Inventory<br/>L Shift: Sprint<br/>Space: Roll<br/>Esc: In Game Menu<br/><br/>The Last Poem – The Trials of Poe is a third person Action RPG set in the mid-1800s that sends the player into the shoes of Edgar Allan Poe. The unfortunate Poe made a deal with the god of poetry, Bragi and now at the age of 31, payment has no come due. Wrought with the pain of such an early departure, thinking about what he’d be leaving behind, not his wife, Virginia, but his literary genius that he had now been reminded was not of his own creations but the god turned muse that he’s made this deal with.<br/><br/>Player’s battle through the worlds of Edgar Allan Poe’s creations, fighting hordes of monsters, demons, even poets of a time since past. With one goal in mind, Bring the Soul of Poe to Bragi. What will you do? Will you succumb to the whims of a mischievous and evil god or will you free your soul and keep on living to write much more wonderful literary works?</p>\n<p>The Demo is of course free but if you'd like to help with the development (I got approved to build it for PS4/5 and Xbox One and while the Xbox Dev kit is free, the PS dev kits aren't lol. </p>\n<p>Kickstarter coming soon!</p>", "metacritic": null, "released": "2021-06-18", "tba": false, "updated": "2021-06-21T07:08:50", "background_image": "https://media.rawg.io/media/screenshots/f64/f645ae818bf8d81844a51833094b66d2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 87, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["rdmartyr7"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}