{"id": 62554, "slug": "fast-beat-loop-racer-gt-huan-zhuang-sai-che-gt", "name": "FAST BEAT LOOP RACER GT | 環狀賽車GT", "name_original": "FAST BEAT LOOP RACER GT | 環狀賽車GT", "description": "Straight from coin-op to your PC comes the fuel soaked, turbo fired, 1 to 4 player arcade action of FAST BEAT LOOP RACER GT. Race your friends around the world as you compete on 48 tracks set against the cityscapes of Tokyo, Osaka, Shanghai and Beijing. The fast beat never stops with a rich and detailed story, classic Time Attack, Mileage Mode, or online multiplayer racing.Key Features<br/><ul><li><strong>Slipstream (Drafting)</strong><br/><br/>Get bumper to bumper friendly and let the slip stream slingshot you past your rivals. By using the reduced air resistance, rookie drivers can apply this technique to become an outstanding racer. Experienced pros can enjoy this new way to pass other cars.<br/><br/></li><li><strong>The Best Street Racing on the Planet!</strong><br/><br/>Revel in open-traffic street racing and explore the splendor and excitement of Osaka, Tokyo, Shanghai and Beijing, all with dozens of different tracks and options.<br/><br/></li><li><strong>Customizable Cars</strong><br/><br/>You can choose from 10 blazingly fast street racers and use racing experience to pimp your ride with a variety of power and performance upgrades.<br/><br/></li><li><strong>Story Mode </strong><br/><br/>Let the addictive character based story of FAST BEAT LOOP RACER GT lead through the game. When players upgrade to another level, they can tune their rides according to different courses, and customize their ideal Racing Car.<br/><br/></li><li><strong>Mileage Mode</strong><br/><br/>Fast Beat across Asia, challenging story mode drivers in grueling tests of endurance.<br/><br/></li><li><strong>Time Attack Mode</strong><br/><br/>Players will be challenged to race against themselves and beat their best all time scores.<br/><br/></li><li><strong>Online-Multiplayer Mode</strong><br/><br/>2-to-4 Player racing against up to 3 other online players. You can invite friends and play in a private group.<br/><br/></li><li><strong>Star Wager Mode</strong><br/><br/>Better than racing for pink slips, beating other racers in Multiplayer Mode gives players Battle Stars to activate Star Wager Mode - not for the faint of heart! </li></ul>", "metacritic": null, "released": "2018-05-17", "tba": false, "updated": "2019-08-28T21:57:23", "background_image": "https://media.rawg.io/media/screenshots/558/558a7bf29292b03e224fd5c31be0f8a7.jpg", "website": "https://www.ufointeractivegames.com/fastbeat-loopracer", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 23}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 276, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SAINT-FUN INTERNATIONAL CO"], "genres": ["Racing"], "publishers": ["UFO Interactive Games"], "esrb_rating": null}