{"id": 625695, "slug": "antiprism", "name": "Antiprism", "name_original": "Antiprism", "description": "Follow the two misfit pilots Jexen and Malik as they stumble upon an ancient artifact that binds them together and takes them on a perilous adventure through the most dangerous place in the galaxy: The Gone.<br/>Fight your way through bands of space pirates, armies of the Selysian Dominion, swarms of insect-like Kheelee, and even face Vel Selysian - the mysterious prophet-like leader of the Dominion. <br/>Collect items and credits from your encounters and use them to customize and upgrade parts of your ships - you will need all the firepower you can get in order to reach the end of our pilots' journey. <br/>Test your aim and dodging abilities against elite enemies, unique bosses and environmental hazards, as you uncover the secrets of the Antiprism and its connection to the extinct civilization of Arn.<br/><br/><br/>- Twin-ship single-player VR gameplay<br/>- Customizable &amp; upgradeable ship systems including lots of different weapons<br/>- Several enemy factions, each with its own unique units<br/>- Challenging and epic boss fights<br/>- Environmental hazards triggered by space anomalies<br/>- Campaign mode featuring main and side missions across multiple chapters<br/>- Endless Survivor mode with infinite procedurally generated stages<br/><br/><br/>Leave the flat screen behind because Antiprism has been designed from the ground up as a VR-only experience. <br/>We're working to make the game comfortable to play in any room setup, whether seated, standing or room-scale. <br/>Antiprism's unique gameplay only works in a VR setting with two controllers and can't be played with a gamepad or mouse and keyboard.<br/><br/><br/>Antiprism is under active development. We host playtesting sessions and listen to our community for ways in which to improve the game. Join our Discord server if you have any questions or want to connect with the developers and other players!", "metacritic": null, "released": "2021-06-21", "tba": false, "updated": "2021-06-25T02:32:42", "background_image": "https://media.rawg.io/media/screenshots/fc1/fc1390738f364bdcb1d73c70320a296c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 160, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Zero Fun"], "genres": ["Action", "Indie"], "publishers": ["Zero Fun"], "esrb_rating": null}