{"id": 625639, "slug": "fleetjumpers", "name": "Fleetjumpers", "name_original": "Fleetjumpers", "description": "<p>A space simulation game made in 2 weeks by a single developer.  I hope you enjoy it as much as I enjoyed making it =]  The web version has simplified shaders for performance reasons, screenshots are from the standalone windows version.</p>\n<p>================</p>\n<p>Far in the future, mankind has tested the first faster than light jump drive.  In doing so, they've attracted a monstrous alien horde that has driven a motley crew out of our birth home of Sol into the vast unknown.  Run.  Survive.  Build a Fleet.  Then return to reclaim your home.</p>\n<p>================</p>\n<p>Hopefully the game is self explanatory, but there is a basic intro story / tutorial as well as a manual in-game if you need help.  The purpose of this jam was to try and give me more time to focus on practicing my game design.  The game is still poorly balanced, very short, and has lots of flaws, (and exploits) but I definitely feel like I leveled up and learned a lot.</p>\n<p>My goal was to try and capture the feeling of triumph.  Conceptually I was inspired by the movie Alien, where you spend the whole movie running from a big bad scary invincible monster.  Then there is the moment where Ripley steps out of the shadows in a power suit and you think \"Hell yeah!  Now we get to be the big bad\".  I fell short of that in this game, of course, but that was the motivation.</p>\n<p>Gameplay wise I was heavily influenced by X-Com (the original simulation-y one) and was watching a lot of Winters SEO playing Warhammer 40k BatReps in the background while working.</p>\n<p>Any feedback or suggestions are welcome.</p>\n<p>All art, code, etc I made while making this game is released under MIT creative commons. You can get it all here:</p>\n<p>https://gitlab.com/game-jammers/fleet<br/></p>\n<p>Thank you to the open source / asset community for their contributions to this game as well:</p>\r\nMusicScott Buckleyhttps://www.scottbuckley.com.au/Resurrect 64 Color PaletteKerrie Lakehttps://lospec.com/palette-list/resurrect-64Mumble DialogThe Atomic Brainhttps://freesound.org/people/TheAtomicBrain/sounds/394082/Explosion and Warp Particle FXJean Morenohttps://assetstore.unity.com/packages/vfx/particles/cartoon-fx-free-109565Stone, Leaf, Diamond Resource IconsFreepik www.flaticon.comFontsGooglehttps://fonts.google.com\r\n<p>Complete credits (including thanks to creators of assets used during development but not shipped in the final game) in game under the lore section of the Data Log.</p>", "metacritic": null, "released": "2021-06-18", "tba": false, "updated": "2021-06-21T08:01:13", "background_image": "https://media.rawg.io/media/screenshots/615/61552ea92abd810780a1042b7ef45c5f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 83, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["Jamming Games"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}