{"id": 625723, "slug": "mindmist", "name": "MINDMIST", "name_original": "MINDMIST", "description": "<strong>GET LOST IN AN IMMERSIVE STORY</strong><br/><br/>After losing his spouse, Alya, Kıvanç devoted himself to his project for the hope of finding happiness. Kıvanç completed his project within 7 years of hard work. To honor his spouse's name, Kıvanç gave her name to the project. Through A.L.I.A., he would have a chance to relive his memories of her once again. At the same time, he would commercialize his project and enable people to witness the past. Perhaps, on account of his work, Kıvanç would be able to fill in the gaps in the history written for thousands of years. However, he was unaware that the extraterrestrial who visited Kıvanç one day would show him how wild and ruthless human history is through his project A.L.I.A.<br/><br/><strong>DISCOVER DIFFERENT ENVIRONMENTS</strong><br/><br/>There are 3 main regions and plenty of relatively small areas waiting for you to discover in MINDMIST. Each region is unique in terms of its looks and atmosphere. Developed with Unreal Engine 4, MINDMIST offers photo-realistic visuals.<br/><br/><strong>ENJOY RELAXING GAMEPLAY</strong><br/><br/>Play the game at your own pace. Interact with the surrounding objects to uncover the background story as you progress and witness some of the brutal historical events in the main story. Also, expect some light puzzles!<br/><br/>Note : MINDMIST is recommended for the players who like Firewatch, Gone Home, What Remains of Edith Finch type of games.<br/>Additional Note : MINDMIST is designed in a way that can be completed in one sitting, approximately between 90-120 minutes.", "metacritic": null, "released": "2021-06-21", "tba": false, "updated": "2021-06-25T02:54:03", "background_image": "https://media.rawg.io/media/screenshots/bc6/bc600c23e1014072b4f25704c841b07d.jpg", "website": "https://dragonlandingstudios.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 453, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dragon Landing"], "genres": ["Adventure", "Indie"], "publishers": ["Dragon Landing"], "esrb_rating": null}