{"id": 625738, "slug": "maguntsche-chapter-one-remastered", "name": "Maguntsche: Chapter One Remastered", "name_original": "Maguntsche: Chapter One Remastered", "description": "<h3>Introduction:</h3><br/>It's Halloween night in the small town of Macungie. A great terror emerges after a massive power outage strikes the community, plunging the streets into darkness. As the hands of supernatural forces take control over your perception of reality, the only way to defend yourself is by locating Essence Shards, mystical fragments that enable you to restore your connection to your home dimension. It's a race against time and a race to save your soul...The Maguntsche Demon is afoot.<br/><br/>The Remastered Edition of Maguntsche Chapter One further develops the original narrative with enhanced graphics and improved stability. Explore an all-new archives system that dives deeper into the universe than ever before. This updated version of the game is built from the ground up with new mechanics that can be utilized to diversify your gameplay experience.<h3>Evade The Maguntsche Demon:</h3><br/>As you begin your search for essence shards, it is important to know the demon's whereabouts are in the house at all times. The Maguntsche Demon is a dark entity that will feed off of your soul any chance it gets. As he gradually breaks you down, he will gain energy that enables him to perform deadly attacks and surely give you a good scare.<h3>Collect The Essence Shards</h3><br/>You begin your path to safety in search of the essence shards. These fragments of reality will spawn around the house. The catch is that you can only see and interact with them when in the Realmverse. The Realmverse is a mirrored reality full of danger and surprises around every corner. As you collect more of these reality fragments, they will begin spawning deeper in the realm, revealing passages and corridors not seen otherwise. Your presence in this realm of reality is determined by how often you blink. One moment you could be at home, and the next, you could find yourself in this horrid dimension.<h3>Gain Insight About The Past, Present, and Future:</h3><br/>As a secondary objective, the player is able to discover various documents around the house that provide insight into the story and universe. Collecting these documents will allow the player to view them in the new archives system, which has been reworked to provide greater insight and depth to the story of The Maguntsche Series. You can only discover two documents at any given playthrough, and the location of these documents is randomized.<h3>Future Content Update:</h3><br/>After the initial launch of Maguntsche Chapter One Remastered, the game will be given support for bug fixes and a content update. The upcoming content release will be made available on the anniversary of Maguntsche: Chapter One this October. This content update will add some replayability to the game by allowing players to customize their experience with the Maguntsche Demon in a new game mode never before seen in the franchise.", "metacritic": null, "released": "2021-06-22", "tba": false, "updated": "2021-06-25T03:09:58", "background_image": "https://media.rawg.io/media/screenshots/98e/98e11db68ab59827ab22e100aaad9d47.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 13, "ratings_count": 0, "suggestions_count": 134, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Kaleb Wassa"], "genres": ["Action", "Adventure"], "publishers": ["GlassDev Games"], "esrb_rating": null}