{"id": 625722, "slug": "fate-of-windshift", "name": "Fate of WINDSHIFT", "name_original": "Fate of WINDSHIFT", "description": "\"The Country of wind\"  - The land is blessed with warm wind, rich soil all year around and a fruitful harvest is expected every year.<br/>\r\nThis country claims the largest territory in the world, various incidents occur on a daily basis due to immigrants, thieves, and even demons.<br/>\r\nThe 64th Platoon was a small unit organized to solve such cases, and all the members were strong men familiar with their work. <br/>\n<br/>\r\nToday is the day of the platoon's enlistment examination. Plenty of young men have gathered at the castle.<br/>\r\nThe matoi style swordsman 'Onikirimaru' also went through the gate of the castle town, squinting at the sight of the light-bird that heralded the coming of spring.<br/>\n<br/>\r\nCharacteristics of this game.<br/>\r\nThis game is RPG+ADV. The description of the topics are as follows.<br/>\n<br/>\r\n◇Battle<br/>\r\nStrategic battles CTB .<br/>\r\nUp to four members will participate in the battle. The members can be replaced on the field at any time, except for the fixed characters. Each character has its own commands. Special commands include:<br/>\r\nPowerful actions that can change the phase of the battle instantly.<br/>\r\nOnikirimaru: Charge<br/>\r\nRyokusui: Songs<br/>\r\nShuntatsu: God Speed<br/>\r\nEtc...<br/>\n<br/>\r\nSome of the skills and weapons your character uses have unique attributes attached to them. There are also attributes in the battlefield. Each ability has different qualities. Some that are compatible and some that are less compatible. With effective abilities you can gain an advantage when attacking the enemy.<br/>\n<br/>\r\nThere are also times when the characters will talk to each other during the battles. They may give you hints on how to gain an advantage, so please make use of them when you are struggling to fight against a strong opponent.<br/>\n<br/>\r\nField <br/>\r\nThe vast world full of Feng-shui is expressed with delicate graphics.<br/>\r\nTime passes as you move through the field. Some enemies only appear during the day and some only at night.<br/>\n<br/>\r\nTown<br/>\r\nIn the town you can find hints to continue with your adventure. You can also shop for several different things. <br/>\r\nThese are the kinds of stores that 'Onikirimaru' first visits in the castle town.<br/>\r\nArms dealer, armory, tool store, accessory store, seed store, grocery store and the inn.<br/>\r\nThere are many more shops and buildings in the area.<br/>\n<br/>\r\nCharacter Status<br/>\r\nIn addition to common RPG stats such as HP, there are also specific status values such as CP, which can cause various effects such as changing the abilities of the weapons you have, improving the abilities of your skills, and so on.<br/>\r\nYou can also set your own characteristics (jobs), which allows you to adjust your skills and ability values to match your characteristics.<br/>\r\nThere are more than 100 skills you can acquire.<br/>\n<br/>\r\nAdventure<br/>\r\nThe adventure part uses high-resolution character graphics. There are many characters that appear so you can find your favorite character!<br/>\n<br/>\r\nExtra functions<br/>\r\nThe \"Character Chat\" function allows you to enjoy the extra events within the game.<br/>\r\nEtc...<br/>\n<br/>\r\nControls <br/>\r\nFull controller support. For those who don't have a controller, the game can be played with a keyboard.<br/>\n<br/>\r\nMusic<br/>\r\nThe game contains a lot of dynamic music that matches with the scenes.", "metacritic": null, "released": "2021-06-21", "tba": false, "updated": "2021-06-25T02:52:37", "background_image": "https://media.rawg.io/media/screenshots/2ea/2ea2e332a008d982367b6b13d217afde.jpg", "website": "https://twitter.com/BladeWindshift", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 512, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["REAL GAME PROJECT FATE"], "genres": ["RPG", "Indie"], "publishers": ["REAL Co.Ltd"], "esrb_rating": null}