{"id": 625755, "slug": "crazy-foods", "name": "Crazy Foods", "name_original": "Crazy Foods", "description": "<strong>Crazy Foods</strong> is a massively multiplayer online battle arena game with upcoming crazy modes where foods are going crazy eliminating each other until one winner or team will get the fork throne!<br/><br/>Crazy foods coming with 2 maps - <strong>Grocery</strong> and <strong>Hypermarket</strong>.<br/><br/><strong>Grocery:</strong> - Will be available soon<br/><br/><strong>Base Defend</strong> - In grocery you have to defend your base on the shelf cooperating with your team mates building blocks and guns and also try to attack other teams bases to win. Total 4 teams with 4 online players each. Each game session lasts for 10 minutes with unlimited rounds. Each time when you die, you will be spammed back to your base and continue your game without gun. You have to reach middle table in order to get the gun and continue the battle.<br/><br/><strong>Hypermarket:</strong><br/><br/>In Hypermarket you will have 2 modes:<br/><strong>Free-for-All</strong> - every food for himself! Every online player will be against each other and who gets the most number of kills, will be the winner. Each time when you die, you will be spammed alive and continue the battle.<br/><strong>Team Deathmatch</strong> - you will fight against other teams cooperating with your team mates and the team who gets the most number of kills, will be the winner. Each time when you die, you will be spammed back to your base and continue the battle. Total 2 teams with 4 online players each.<br/><br/>", "metacritic": null, "released": null, "tba": false, "updated": "2022-08-30T12:57:54", "background_image": "https://media.rawg.io/media/screenshots/1b4/1b4b54f7c068ac165c751fd49619f618.jpg", "website": "https://crazyfoodsgame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 158, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["LOF Studios"], "genres": ["Action", "Casual", "Massively Multiplayer", "Indie"], "publishers": ["LOF Studios"], "esrb_rating": null}