{"id": 62578, "slug": "pilot-rudder-vr", "name": "Pilot Rudder VR", "name_original": "Pilot Rudder VR", "description": "It is time to go inside those old arcade machines and become the ultimate pilot. Grab your VR headset, a pair of motion controllers and get ready to take loads of passengers all around the world in a VR experience like no other.<br/><br/>Pilot Rudder VR takes all the nostalgia for the old \"how-far-can-you-go\" arcade games and transforms it into an all new immersive adventure where you have full control.<br/><br/>As in real life, pilots will face several challenges during their flights that can put the aircraft at risk. It will be up to you and your skills to avoid dangers like turbulence, lack of fuel or extreme cross-winds and arrive safely at your destination.<br/><br/>Are you up to the challenge? With three different game modes, a plane customization system and a leaderboard league aginst other players, it is your time to become the ruler of the skies.<br/><br/><br/>-Complete freedom of movement thanks to the room scale tracking. You can get closer or further away from your plane to get the view that best fits your style.<br/><br/>-Each plane is different. In real life each aircraft is designed with a specific goal in mind, as some planes fly faster while others fly for a longer period of time. Choose your aircraft wisely according to your needs.<br/><br/>-Complete all the challenges to go around the world or compete against other players to be the one that can fly the longest.<br/><br/>-No two games are the same. Each time you play the conditions are generated randomly in real time to create a unique experience.<br/><br/><br/>-World Trip: Complete each leg and make sure that all the passengers arrive safely at their destinations all around the world. <br/><br/>-Championship: You got what it takes to climb up to the top of the leaderboard? Fly as much as you can and prove yourself as the best pilot online.<br/><br/>-Training: Just relax and enjoy yourself while flying and perfecting your skills.<br/><br/>-Customizations: You prefer blue over red? Or sunset over noon? We got you covered. Earn \"game money\" by playing and unlock new colors and features for your planes. Also, forget about microtransactions. We don't have any of those in our game.<br/><br/><br/><strong>Now it's your turn to become the ultimate pilot!</strong><br/>", "metacritic": null, "released": "2018-08-07", "tba": false, "updated": "2019-08-28T21:57:22", "background_image": "https://media.rawg.io/media/screenshots/7b8/7b8927bdaf04930003ac4a28cbad0f5f.jpg", "website": "http://www.gurashop.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 199, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["GuraShop"], "genres": ["Simulation", "Casual"], "publishers": ["GuraShop"], "esrb_rating": null}