{"id": 625732, "slug": "exodus-borealis", "name": "Exodus Borealis", "name_original": "Exodus Borealis", "description": "A community of Vupfox flee their homeland and seek refuge across the perilous north sea. Only a few are fortunate to survive the journey, ending with a crash upon an island. This fertile isle offers sanctuary, a chance to rebuild. But something is not right; any attempt to sail away results in crashing back upon the island. Ominously, along the backside in the cliffs, lies a narrow slot canyon. A menacing arch sits at the canyon’s entrance. <br/><br/>In this city builder and tower defense strategy game, it is up to you to guide the few remaining survivors. Progress from from just hoping to survive to ultimately overcoming the challenges with an efficient and prospering society. Design a the new settlement, task the colonists with jobs, manage resources, and architect a defense from the whatever comes from beyond the gate.<h3>BUILD YOUR COLONY</h3><br/><ul><li><strong>Settle the islands</strong>: Build your way across unique islands.<br/></li><li><strong>Survive the environment</strong>: Each day, season, and generation faces tough challenges to overcome.<br/></li><li><strong>Research</strong>: New buildings, resources, and citizen efficiencies will have to be researched in order to face the trials ahead. <br/></li><li><strong>Build a production machine</strong>: Balance building construction, jobs, research, resources, and citizen needs to create an effective society.</li></ul><h3>DEFEND YOUR COLONY</h3><br/><ul><li><strong>Guide the invaders</strong>: The invading forces blindly seek their targets to destroy. Use this to your advantage and create a clever labyrinth to maximize damage.<br/></li><li><strong>Make use of the elemental gems</strong>: Mining the island has unveiled powerful elemental gems. These gems can be used by an array of offensive towers, applying unique elemental effects to the invading forces. Conversely the elemental gems can be applied to boosts towers, applying unique buffs to near by towers.<br/></li><li><strong>Master elemental synergy and nullification strategy</strong>: Elements boost the effect of neighboring elemental damage effects, while nullifying opposing elements. Taking advantage of this will be key to creating a dominate defense.</li></ul>", "metacritic": null, "released": "2021-06-22", "tba": false, "updated": "2021-06-25T03:04:38", "background_image": "https://media.rawg.io/media/screenshots/d72/d729a27010cef18997129240585364fe.jpg", "website": "https://smugmarmot.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 10}, "playtime": 9, "achievements_count": 12, "ratings_count": 0, "suggestions_count": 425, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Smug Marmot Studios"], "genres": ["Strategy"], "publishers": ["Smug Marmot Studios"], "esrb_rating": null}