{"id": 625862, "slug": "gangscity", "name": "GangsCity", "name_original": "GangsCity", "description": "GamePad Controller MFI<br/>--------------------------<br/>· Stick or dPad, Crosshair moves.<br/>· Button A, Shoot.  <br/>· Button B, Cover.<br/>  <br/>  Touch Screen Controls<br/>-------------------------<br/>· Slide and hold to move Crosshair, the background scroll and you must locate gangster.<br/>· Tap to shoot.<br/>· Tap with three finger or more to defend.<br/>  <br/><br/>  History<br/>----------<br/>Gangs city is a shooting game has players taking on the mafia by gunning down gangster one by one.<br/>The player controls a police man . Over a period of several months, he targets gangster, culminating with the boss.<br/><br/>Move the crosshair around the screen to aim and shoot at gangster one at a time. They lurk around various areas,<br/>including on the street and in windows. An arrow appears that helps direct players to the location of the next gangster onscreen.<br/>Players have a set amount of time to find and shoot each enemy. If time is running out, a speech bubble appears counting down the<br/>last five seconds on the timer. When the timer reaches zero, the gangster is shot and the screen pans to the location of the enemy.<br/><br/>A defend is available as a last resort to avoid being shot.<br/><br/>Police man can replenish their ammo by shooting hidden ammunition boxes.<br/><br/>Levels are cleared after a set number of gangster are eliminated. In the game's final level, the police man has only one opportunity<br/>to kill the boss as he runs in a room.<br/><br/>After the final level is completed, the game loops back to the beginning.", "metacritic": null, "released": "2020-01-16", "tba": false, "updated": "2021-06-25T04:38:14", "background_image": "https://media.rawg.io/media/screenshots/d15/d152b031736e52f40ef37d1a1995dea5.jpg", "website": "http://apps.ivancerra.com/gangscity.html", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 208, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ivan Cerra"], "genres": ["Action", "Casual"], "publishers": ["Ivan Cerra de Castro"], "esrb_rating": "Teen"}