{"id": 625878, "slug": "be-the-judge-ethical-puzzles-brain-games-test", "name": "Be The Judge - Ethical Puzzles, Brain Games Test", "name_original": "Be The Judge - Ethical Puzzles, Brain Games Test", "description": "Your Honor! We can start if you are ready. The court is yours and suspects’ fates will be determined by you. Be the Judge!<br/><br/>Be The Judge - Ethical Puzzles, Brain Games is a very funny version of brain test games. It will blow your brain out with its brain puzzles and riddles that you will crack the mystery. If you play the brain teaser games as Braindom 2 you will like this game.  Find out the evidence, figure out who is guilty and who did it for what reason.<br/><br/>Are you willing to search for the main reasons behind the scene as a detective and trace the truth? Solve the mystery of the crime, find who is guilty and innocent in this law and court game and throw light on the cases. Become the riddle master in this object hunt game. Now you can judge!<br/><br/>There are lots of incidents and accidents in daily life that anyone may face with suspicion. Every day, every moment, someone is arrested with the suspicion of committing a crime and appears before a judge.<br/><br/>What will you do? Will you empathize with them and rule with your conscience and intelligence in the light of evidence or will you rule unmercifully? But first, you should find out the evidence as a detective. As you find the clue and solve the mystery, you are ready to judge in this object hunt game.<br/><br/>As you enlighten the cases, you will see options for a sentence or return a verdict of not guilty. Suspects robbed the bank, stole a bike, damaged property, and broke public decency. Find the hidden object or the clue to crack the mystery.<br/><br/>There are bonus levels for you to put yourself in their shoes. There are cases where you should act to save one while the other one suffers. Will you act ethically in these dilemmas?<br/><br/>Will you be a righteous judge? Are you ready to do what's right?<br/><br/>Game Features:<br/><br/>1. Original Scenarios<br/>Each level brings you to hilarious or dramatic cases where you must figure out behind the scenes.<br/><br/>2. Test your Brain Power<br/>Find the clues, solve the riddles, crack the mystery to trace and reach the truth.<br/><br/>3. Improve Yourself<br/>You will see that incidents may not be as they appear at the first sight. This game will help you to improve your ability for empathy, common sense, and ethical approach.<br/><br/>4. Relax and Enjoy<br/>Great time-killer game to enjoy as much as you play. You won’t want it to end.<br/><br/>• Improve yourself with this version of thinking games, word games!<br/>• Imaginative and cool iq games, who is, who did it questions.<br/>• Apply real-life logic puzzles to beat the challenges.<br/>• Test your imagination and logic skills of puzzle games.<br/>• Focus on the details and boost your brain out!<br/>• Find solutions to the riddles!<br/>• Tricky &amp; Mindblowing Brain Teaser Games<br/>• Great exercise for brain test.<br/>• Easy-game for all, stupid test, brain games and brain puzzles for adults<br/>• Great time killer, there are smart games for a brain wash experience<br/>• Brain-teasers including word games, Braindom 2 type of puzzles<br/><br/>Be the Judge - Ethical Puzzles is the best of brain games, a kind of brain test with different riddles as you play in Braindom 2. It will blow your brain out and become the riddle master.<br/><br/>Be the Judge is one of the newest brainly puzzle games that break common sense and bring you an excellent brainwash experience within the scope of brain teaser games. Ready for the brain out in these smart games! Try this impossible mindblowing game, solve the mystery and crime as a detective, find who is guilty and innocent, and crush each level in this court and law game.<br/><br/>This game is unique, original, and creative, designed not only to push yourself with mind games but also to brain wash. You can enjoy this free iq game to brainwash. What a cool brain test and brain-teasers in this easy-game!<br/><br/>It’s designed with multiple brain teaser games, tricky puzzles,mind and brain games, logic puzzles, riddles, also cool smart games, and Braindom 2 type of riddles.<br/><br/>You will like Be The Judge's attractive graphics with easy and fun gameplay!<br/><br/>Enjoy the game committed to fun!", "metacritic": null, "released": null, "tba": false, "updated": "2021-06-25T04:48:32", "background_image": "https://media.rawg.io/media/screenshots/53f/53f13e55bf7978f05cf69e281ba088d4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 117, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["MATCHINGHAM GAMES"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": "Everyone"}