{"id": 625871, "slug": "memory-2-premium", "name": "Memory 2 • Premium", "name_original": "Memory 2 • Premium", "description": "Memo 2 is a game of memory skills, designed for the entire family and suitable for people of all ages. It is inspired by the popular game of pairs where the player requires concentration and memory.<br/>\u2028In this version for iPad, iPhone and iPod Touch, the game is composed of 4 game modes and more than 100 levels, where images are shuffled and placed face down on the screen. The player must discover two pictures (animals or food theme), letters (you can choose upper or lower case), or numbers whether these form a pair disappear, otherwise, are again covered and remittances in their original location on the screen.<br/><br/>The aim is to guess all pairs as quickly as possible. Faster you will be more up your score will be. You can compare yourself to friends or other players on Apple Game Center. <br/><br/>A Two-Player modes is available, and a great Educative mode let you chose the cards images you want to play with, to display or not text below images and to read loud the text with speech synthesis. Moreover, you can learn spanish or french by chosing different languages for first and second card. A really great valuable mode!  <br/><br/><br/>Train your memory with this simple game and have fun ! <br/><br/>• Memo 2 is supported on all iOS 6 &amp; 7 devices (iPad iPhone and iPod Touch)<br/>• Memo 2 has a  unique and addictive Gameplay<br/>• Memo 2 let you add new card sets (Word, Images, Letters, Numbers, etc…)<br/>• Memo 2 is connected to Apple Game Center to share and compare Highscore all over the world<br/>• Memo 2 support Retina Display<br/>• Memo 2 support English, Spanish and French languages<br/><br/>For any problem or suggestion, please feel free to contact us : contact@vision-apps.com<br/><br/>The Vision-Apps Team", "metacritic": null, "released": "2014-05-03", "tba": false, "updated": "2021-06-25T04:42:43", "background_image": "https://media.rawg.io/media/screenshots/58b/58bc9270d9eddb0c00b2f284e70db5d3.jpg", "website": "http://www.vision-apps.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 121, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Clement Marty"], "genres": ["Educational", "Puzzle"], "publishers": ["Clement Marty"], "esrb_rating": "Everyone 10+"}