{"id": 625870, "slug": "niche-breed-and-evolve", "name": "Niche - Breed and Evolve", "name_original": "Niche - Breed and Evolve", "description": "NICHE - BREED AND EVOLVE: A BREEDING AND SIMULATION GAME FOR GENETICS FANS<br/><br/><br/><br/>Welcome to the world of Nichelings, a secret world, with unique animals, real genetics and many adventures! Do you have what it takes to be a pack leader?<br/><br/>Experience a genetics &amp; breeding simulation game with cute animals and thousands of different gene combinations! Grow and strengthen your pack through selective breeding based on real genetics. Go on a journey of discovery with your animals and encounter new islands, animals, enemies and genes!<br/><br/><br/><br/>BREED NICHELINGS WITH REAL GENETICS AND STRENGTHEN YOUR PACK<br/><br/>The Nichelings need you: Help them strengthen their pack and adapt to different biomes! Skillfully breed Nichelings by comparing their genes and making smart breeding decisions. Mutate genes to make them stronger. Breed thousands of possible combinations and play with the cute cubs! <br/><br/><br/><br/>GO FORAGING, HUNT PREY AND FIGHT PREDATORS<br/><br/>Send your animals to different biomes to forage, fish and fight against predators! Join your Nichelings on their missions and help them in the Mini Game. Adapt your pack to new challenges in biomes and unlock new islands! <br/><br/><br/><br/>MEET WILD NICHELINGS WITH SPECIAL GENES <br/><br/>Meet wild Nichelings with special genes and abilities on your adventures. Invite them into your pack to strengthen it and breed them to collect all the genes!<br/><br/><br/><br/>DISCOVER NEW ISLANDS AND COLLECT ALL THE GENES<br/><br/>Level up biomes to unlock new islands where unique genes can be found. Collect over 120 genes in different biomes and discover the many possible combinations!<br/><br/><br/><br/>PET YOUR NICHELINGS AND BUILD YOUR BOND<br/><br/>Pet your Nichelings and strengthen your bond with them. Get bonuses that will help you forage and find new pack members! <br/><br/>Experience a genetic adventure: Breed and develop strong Nichelings and make your pack the strongest in the world of Niche!<br/><br/>_____________________________________________<br/><br/>Follow us on:<br/>Facebook: https://www.facebook.com/StrayFawnStudio/<br/>Twitter: https://twitter.com/strayfawnstudio<br/>Instagram: https://www.instagram.com/strayfawnstudio<br/>YouTube: https://www.youtube.com/channel/UCZ4Wt7t1egezRLvwkCVnJ2Q<br/>Forum: https://strayfawnstudio.com/community/", "metacritic": null, "released": "2021-06-23", "tba": false, "updated": "2021-06-25T04:42:12", "background_image": "https://media.rawg.io/media/screenshots/f8f/f8f6af75c81329ee1271191e3e143d2c_BHr3zjS.jpg", "website": "https://niche-game.com/mobile/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 154, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Stray Fawn Studio"], "genres": ["Simulation", "Casual", "Educational"], "publishers": ["Stray Fawn"], "esrb_rating": "Everyone 10+"}