{"id": 625923, "slug": "vira-kyunru", "name": "Vira (Kyunru)", "name_original": "Vira (Kyunru)", "description": "<p>The Earth is overpopulated, so most people live in so called Cubes and spend almost their entire lives in the virtual world VIRA.</p>\n<p>Only a small percentage still lives in the real world - the Elite, who belong to the higher society, and the Offliners, who are so poor that they can't even afford a cube to enter VIRA.</p>\n<p>The cubes, live mostly online, because they no longer see any point in the real world. Some try to rise to the elite, which is no easy feat. And last we have the Onliners, these are Artificial Intelligence who populate VIRA and know nothing about the existence of a real world.</p>\n<p>You play as Dex, who mostly lives in VIRA and only logout for the his basic needs like changing his nutrition tank. In the real world he is far down in the hierarchy. He has just enough to survive.</p>\n<p>In VIRA he is one of the best. But since he puts almost all his money into the game, he doesn't have much in the real world.</p>\n<p>To earn money he completes mission after mission and thus upgrades his character with weapons, shields and skills.</p>\n<p>His goal is to defeat the 'game' and thereby rise in real life in society and eventually be at the top. So that he can then redistribute the wealth and offer everyone a better life in the real world. So that it would not be necessary to escape into VIRA.</p>\n<p>Collect cards to open gate to next level.</p>\n<p>Collect coins to buy upgrades.</p>\n<p>\n</p>\n<p><strong>Controls:</strong><br/>Move:                    Array Keys<br/>Shoot:                   Space Key<br/>Pull/Push:            'P' Key</p>\n<p>Intro unfortunately does not play in the web version,  just skip it. <br/>Please download the game to see the intro.</p>", "metacritic": null, "released": "2021-06-24", "tba": false, "updated": "2021-06-25T05:00:37", "background_image": "https://media.rawg.io/media/screenshots/0c4/0c4228c9ded355e98fd1a27114d8e8bb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["kyunru"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}