{"id": 62590, "slug": "naked-sun", "name": "Naked Sun", "name_original": "Naked Sun", "description": "Naked Sun is a fast-paced futuristic VR shooter.<br/><br/>In the beginning of the 23rd century, humans lost the Earth. Artificial intelligence turned against its creator, and every android was updated with a new directive- to eliminate humans.<br/><br/>Cities are abandoned, radiation levels are too high, and remaining people are slowly dying out. Some of the survivors are hiding in the Deadlands, ruins of ancient cities destroyed by past nuclear wars, and are fighting back. But the enemy is stronger, and the only way for humans to survive is to attack.<br/><br/>Mexico City arcology, once the global capital, is the ultimate goal. Deadly machines and hostile androids protect the mainframe of a supercomputer that controls the planet. Getting back Mexico City is the only way to turn the tide of war.<br/><br/>You are codenamed Blackbird, the first successful hybrid of a human brain and a machine. Tomorrow morning, in a desperate attempt to turn the tide of war, you will intercept a cargo train bound for Mexico City, infiltrate deep inside enemy territory and try to bring city defense systems down from the inside.<br/><br/>Once resistance assault ships are inside, the ultimate battle for the future of humanity is set to begin.<br/><br/>---<br/><br/>Key game features:<br/><br/><ul><li>Field of action 180 degrees, which allows for smooth gameplay on devices with non-roomscale tracking.<br/></li><li>Can be played both in standing and seated position.<br/></li><li>Traveling through diverse and feature-rich futuristic locations at high speeds, within a dynamic environment.<br/></li><li>No motion sickness.<br/></li><li>Arcade mode where you can challenge your combat skills, and see how you compare to your friends and players around the world.<br/></li><li>Easily adjusted difficulty settings - the game will appeal both to VR novices as well as experienced players. <br/></li><li>Destructible environment creates opportunities for variable tactical play.<br/></li><li>Multiple weapon types and special character abilities add to gameplay variability.</li></ul>", "metacritic": null, "released": "2018-07-17", "tba": false, "updated": "2023-12-16T00:10:56", "background_image": "https://media.rawg.io/media/screenshots/6cb/6cbc61888ad4225d884bcb9824600174.jpg", "website": "http://doorz.studio", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 26, "dropped": 1}, "playtime": 3, "achievements_count": 24, "ratings_count": 2, "suggestions_count": 444, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Door Z Studio"], "genres": ["Action", "Indie"], "publishers": ["Door Z Studio"], "esrb_rating": null}