{"id": 6259, "slug": "jenga", "name": "Jenga", "name_original": "Jenga", "description": "** Now with ONLINE MULTIPLAYER! **<br/><br/>The official Jenga® game is here! Designed in consultation with Leslie Scott, the original creator of Jenga®, Jenga for iPhone/iPod touch lets you take the tower building experience anywhere.<br/><br/>SLASHGEAR<br/>&amp;quot;Completely excellent! Hours of fun!&amp;quot;<br/><br/>POCKETGAMER<br/>&amp;quot;Pitch-perfect physics. Thoroughly enjoyable!&amp;quot;<br/><br/>TUAW<br/>&amp;quot;Gorgeous graphics. VERY addictive. The only reason I stopped was my battery was drained!&amp;quot;<br/><br/>Follow us on Twitter (@NMGames)<br/>Get the latest news on our Facebook page (www.facebook.com/naturalmotiongames)<br/>________________________________________<br/><br/>REALISTIC PHYSICS<br/>Real-time 3D physics simulation, authentically recreating the behavior of a real wooden Jenga tower. Each block is realistically affected by the surrounding blocks, recreating the same strategic depth as the original game.<br/><br/>TOUCH CONTROL<br/>Anyone who’s played Jenga knows how delicate your touch needs to be. The iPhone’s super-accurate touch screen gives you the control you’ll need to go for world record heights (incidentally… the record is 40 2/3 layers!). Blocks can be teased out using a mix of gentle tapping and drag controls. It’s easy to begin with, but you’ll soon find it tough when the pressure is on and the tower is wobbling!<br/><br/>GYROSCOPE INTEGRATION<br/>View the tower just as you would in real life by moving the device around it. The built-in gyroscopic mechanisms allow for unprecedented control of your viewpoint. Study the structure of the blocks to plan your next move.<br/><br/>SOCIAL GAMEPLAY<br/>Obviously the best part of Jenga is putting off your friends as they are making their move. The four-player Pass’n’Play mode truly reproduces the nail-biting tension of the real thing… but you can play it anywhere!<br/>And what’s more, Jenga for iPhone lets you compare your current tower height against that of friends around the world – while you play! A little friendly competition is the best motivator...<br/><br/>ARCADE MODE<br/>Jenga on iPhone introduces a brand new mode: Jenga Arcade. Match colors for extra points and score multipliers by moving fast – but don’t topple the tower! While you play, you earn coins which you can spend on special boosts like collapse reverse, multipliers, and wildcards. It’s fast and frantic… totally turning Jenga on its head.<br/><br/>STUNNING VISUALS<br/>Jenga for iPhone is beautiful. With full Retina display support, you won’t see a single pixel. Advanced wood shaders make the tower pop out and let you gauge its stability. And everything is set in beautiful environments, rivalling the quality of modern games consoles.<br/><br/>GAME CENTER INTEGRATION<br/>Like all titles from NaturalMotion Games, Jenga fully supports Apple’s Game Center including leaderboards, achievements and easy friend comparisons.<br/><br/>AUTHENTICITY<br/>Designed in consultation with Leslie Scott, the inventor of Jenga, to create the most authentic Jenga experience ever.<br/>________________________________________<br/><br/>** DON’T MISS OUR OTHER GAMES!! Clumsy Ninja, CSR Racing, CSR Classics, Backbreaker, Backbreaker 2, Icebreaker Hockey, and My Horse; find them on the app store now!**<br/><br/>Privacy Policy: http://www.naturalmotion.com/privacy-policy/<br/>Terms of Use: http://www.naturalmotion.com/terms-of-use/", "metacritic": null, "released": "2007-11-13", "tba": false, "updated": "2019-10-22T13:55:13", "background_image": "https://media.rawg.io/media/screenshots/481/481f847beed86841c171cd3dee8b8c7c.jpg", "website": "http://www.naturalmotiongames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 6}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 296, "game_series_count": 0, "reviews_count": 0, "platforms": ["Wii", "Nintendo DS", "iOS", "Android"], "developers": ["NaturalMotion", "NaturalMotionGames"], "genres": ["Board Games", "Casual", "Puzzle"], "publishers": ["Atari", "NaturalMotion Games"], "esrb_rating": "Everyone 10+"}