{"id": 626, "slug": "powerstar-golf", "name": "Powerstar Golf", "name_original": "Powerstar Golf", "description": "<p>Free Version contains: a selection of events including a hole from every course. Play stroke or match play, earn XP and credits and collect new gear to improve your abilities. All progress will be saved.<br />\nPowerstar Golf takes your game to new heights with innovative new features never before seen in a golf game. Enjoy beautifully stylized 18-hole courses in exotic locations, playing as a variety of characters and utilizing a huge range of gear. Each unique character has strengths to leverage, customized gear to obtain, and a special ability all their own. With hundreds of clubs, balls, and unique sets of gear, you’ll find a million ways to step up your game and impress your friends!<br />\nPowerstar Golf is a skill-based game that’s easy to pick up and play, but challenging to master. Your friends can see exactly how you’re smashing records with leaderboards built right into the course. When you have an amazing round, rivals can play against you from their couch through Xbox One’s cloud. And with Powerstar Golf’s caddie sharing system, you’ll be able to leverage your social circle to unlock cool new rewards within your game, even when you’re offline. Whether you’re playing to relax and enjoy a round of golf, or fiercely competing in a local multiplayer match with your friends, Powerstar Golf promises great fun and hours of challenge to sink your teeth into.<br />\nThe downloadable version of this game supports English, French, Italian, German, Spanish, Danish, Dutch, Finnish, Norwegian, Polish, Portuguese, Russian, Swedish, Turkish, Japanese, Korean, Chinese.</p>", "metacritic": null, "released": "2013-11-22", "tba": false, "updated": "2023-05-16T19:36:19", "background_image": "https://media.rawg.io/media/screenshots/233/2334cbeaa8251758e9f26e70fd601220.jpg", "website": "", "rating": 3.45, "rating_top": 3, "added_by_status": {"yet": 3, "owned": 98, "beaten": 3, "dropped": 8}, "playtime": 0, "achievements_count": 64, "ratings_count": 11, "suggestions_count": 432, "game_series_count": 0, "reviews_count": 11, "platforms": ["Xbox One"], "developers": [], "genres": ["Sports"], "publishers": ["Microsoft Studios"], "esrb_rating": "Everyone"}