{"id": 626058, "slug": "world-turtles-demo", "name": "World Turtles Demo", "name_original": "World Turtles Demo", "description": "Join our Discord Server\r\n\n<p>World Turtles is a wholesome strategy game where you guide a tribe of creatures called Meeps in their mission to save themselves and the life of the World Turtle they live on. Only through your guidance can the Meeps learn about the world and push the boundaries of physics to advance and work with the environment where it won’t come to a catastrophic end. Can you help them save their turtle? It would mean the world to them!<br/></p>\n<br/>\n\n<p>In World Turtles the player must guide the Meeps in their journey to save both their World Turtle and themselves. To do this they need you. Help them with gathering resources, constructing buildings, expanding their skills, improving their efficiency, forming societies and researching new ways of advancing and improving the environment.</p>\n<p>They and their children are going to need all the help they can get if they are to have a chance of saving their turtle. And who knows? Along the way, you may meet and save others too.</p>\n<ul><li>Lead a small tribe of Meeps and evolve them into a thriving self-sufficient and efficient community.</li><li>Research new technological advancements pushing the boundaries of physics to find new methods of saving your turtle</li><li>Explore the far reaches of your turtle to find new lands and cooperate with other bands of Meeps.</li><li>Learn about the world your Meeps inhabit and discover ways of working with the environment to improve it and most of all avoid destruction.</li></ul>\n\n<p>I am a solo indie developer. I joined the Game Dev party quite late in life and got my first glimpse of Unity almost exactly 2 years before making the first demo of World Turtles, my very first game, available. I'm amazed at the progress I’d been able to make during these two years and owe a great deal of gratitude to various tutorial channels, plug-ins and artists whom I leaned on during the development. None more than Catlike Coding, whose brilliant Hex Map tutorial series kickstarted this entire endeavour.</p>\n<p>I would love to develop World Turtles further alongside a group of enthusiastic real-world Meeps.</p>\n<p><strong>Please, join me and be a part of the journey!</strong></p>", "metacritic": null, "released": "2021-06-24", "tba": false, "updated": "2021-06-25T05:34:11", "background_image": "https://media.rawg.io/media/screenshots/cf9/cf9e00fa972822fddf4fe5d294b78cf4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 326, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Re cOg Mission"], "genres": ["Strategy", "Simulation"], "publishers": [], "esrb_rating": null}