{"id": 62608, "slug": "miney-company-a-data-racket", "name": "Miney Company: A Data Racket", "name_original": "Miney Company: A Data Racket", "description": "Miney Company: A VR physics-based racquetball-inspired game where you 'work from home' for your new employers Miney Company. Your job is to collect data blocks from around the universe for Miney Company to profit from by selling to the highest-bidding potentially nefarious multinational corporations. With 13 playable levels, multiple types of data-collecting mechanics, and different types of rackets, you can smash, hunt, and protect your data from rival data miners while hanging out with your location coordinators Albert, Benjamin, and Cecil. <br/>\n<br/>\r\nMiney Company wants to connect VR enthusiasts with the data mining needs of fictitious multinational corporations. Our online data gathering matches freelance labor with borderless corporations and their bottomless demands for data, allowing labor flexibility and low overhead as well as high employment satisfaction for people who like to work in their pajamas from home.<br/>\n<br/>\r\n\"‘Eh, It’s a job. And it’s flexible enough that it doesn’t take away from my ride-share driving gig.  I also don’t have to put on pants for it, so there’s that. Unlike my ride-share gig…\"  —Albert<br/>\n<br/>\r\n\"Miney Company sure knows how to look out for their employees! Wait, I mean look at their employees. They aren't too into data privacy if you know what I mean.\"  —Benjamin<br/>\n<br/>\r\n\"It's not so much of a job as it is something you waste time doing and are rewarded with a fiat currency.\" —Cecil", "metacritic": null, "released": "2018-02-22", "tba": false, "updated": "2019-08-28T21:57:21", "background_image": "https://media.rawg.io/media/screenshots/e52/e5270e85133a8ed0989df03d02c38fbf.jpg", "website": "http://www.mineycompany.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 102}, "playtime": 1, "achievements_count": 12, "ratings_count": 0, "suggestions_count": 117, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Glass Temple Games"], "genres": ["Action", "Simulation", "Sports", "Casual", "Indie"], "publishers": ["Glass Temple Games"], "esrb_rating": null}