{"id": 626119, "slug": "barao-vermelho", "name": "Barão Vermelho", "name_original": "Barão Vermelho", "description": "Visão Geral \r\n<p><strong>Controle Manfred von Richthofen (O Barão Vermelho) um dos maiores “ás dos ares” da história. O jogo se passa durante uma Primeira Guerra Mundial fantasiosa mais tecnológica onde o Império Alemão tem o melhor piloto de avião da época e tenta usá-lo como trunfo para vencer as batalhas aéreas. Jogue esta insana aventura cheia de adrenalina e desafios.</strong>\n</p>\r\nHistória\r\n<p>Abril de 1918 (final da primeira guerra mundial), durante a Batalha de Morlancourt, o Barão Vermelho vai à uma investida da Jast 11 do Império Alemão na França (próximo ao front australiano). Lá será a primeira missão de seu jovem primo Wolfram von Richthofen recém formado na academia alemã. Manfred tentará a todo custo proteger seu primo novato na pilotagem de ser abatido pelos aviões das forças da Tríplice Entente. Sobretudo os caças franceses, ingleses e canadenses (aos quais ele foi seu histórico algoz).\r\n</p>\n<p>\n</p>\r\nControles do(a) jogador(a)\r\n<p>O Barão Vermelho é controlado pelo teclado. Suas ações possíveis são o movimento horizontal e vertical, e o uso das armas de seu caça. Assim sendo, o esquema de controles é simples:\r\n</p>\n<ul><li><strong>Setas:</strong> movem o(a) jogador(a) para a direção correspondente dependendo da direção indicada nas setas.\r\n</li><li><strong>Z:</strong> atira os projéteis verdes para eliminar os aviões verdes\r\n</li><li><strong>X:</strong> atirar mísseis amarelos para destruir os aviões amarelos\r\n</li><li>C: atirar mísseis azuis para destruir os aviões azuis e os escudos azuis dos aviões verdes a partir da fase 4\r\n</li><li><strong>Barra de espaço: </strong>ao comprar o item bomba na loja é possível utiliza-la na próxima vez que jogar usando a barra de espaço<br/>\n</li></ul>\n<p>\n</p>\n<p><strong>Objetivo:</strong> Sobreviver o máximo de tempo possível e conseguir ultrapassar seu recorde assim como maximizar os atributos do Jast 11.\r\n</p>\n<p><strong>Condição de Derrota:</strong> Deixar os inimigos ultrapassarem os limites da fase e/ou eles acertando o(a) jogador(a) com misseis até zerar seus pontos de vida.\r\n</p>\r\nDestaques (<em>Features</em>):\r\n<ul><li><strong>Jogabilidade simples, ágil e sempre divertida.</strong> Com controles super simples de aprender, e um ritmo sempre emocionante, qualquer um pode se divertir com Barão Vermelho em poucos minutos!\r\n</li><li><strong>Vários mísseis (a favor e contra)</strong><strong>. </strong>Em Barão Vermelho, cada novo míssil confere poderes ou dificuldades que tornam o jogo mais diverso e interessante!</li></ul>", "metacritic": null, "released": "2021-06-24", "tba": false, "updated": "2021-06-25T05:48:44", "background_image": "https://media.rawg.io/media/screenshots/62c/62ce6d97f77465760e9b008a8b59e00a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 96, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["King_Feitoza"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}