{"id": 626143, "slug": "obs-studio", "name": "OBS Studio", "name_original": "OBS Studio", "description": "<p>Free and open source software for video recording and live streaming.\r\nDownload and start streaming quickly and easily on Windows, Mac or Linux.\r\n</p>\n\n<p>The OBS Project is made possible thanks to generous contributions from our sponsors and backers. Learn more about how you can become a sponsor.</p>\r\nFeatures\r\n\r\n<p>High performance real time video/audio capturing and mixing. Create scenes made up of multiple sources including window captures, images, text, browser windows, webcams, capture cards and more.\r\n</p>\n<p>Set up an unlimited number of scenes you can switch between seamlessly via custom transitions.\r\n</p>\n<p>Intuitive audio mixer with per-source filters such as noise gate, noise suppression, and gain. Take full control with VST plugin support.\r\n</p>\n<p>Powerful and easy to use configuration options. Add new Sources, duplicate existing ones, and adjust their properties effortlessly.\r\n</p>\n<p>Streamlined Settings panel gives you access to a wide array of configuration options to tweak every aspect of your broadcast or recording.\r\n</p>\n<p>Modular 'Dock' UI allows you to rearrange the layout exactly as you like. You can even pop out each individual Dock to its own window.\r\n</p>\n<p>OBS supports all your favorite streaming platforms and more.\r\n</p>\r\nCreate Professional Productions\r\n\r\n<p>Choose from a number of different and customizable transitions for when you switch between your scenes or add your own stinger video files.\r\n</p>\n<p>Set hotkeys for nearly every sort of action, such as switching between scenes, starting/stopping streams or recordings, muting audio sources, push to talk, and more.\r\n</p>\n<p><strong>Studio Mode</strong> lets you preview your scenes and sources before pushing them live. Adjust your scenes and sources or create new ones and ensure they're perfect before your viewers ever see them.\r\n</p>\n<p>Get a high level view of your production using the Multiview. Monitor 8 different scenes and easily cue or transition to any of them with merely a single or double click.\r\n</p>", "metacritic": null, "released": "2021-06-24", "tba": false, "updated": "2023-07-29T14:42:53", "background_image": "https://media.rawg.io/media/screenshots/d46/d46cb762295c92f32611f4ba71d14f37.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 3, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "macOS"], "developers": ["OBS Studio"], "genres": [], "publishers": [], "esrb_rating": null}