{"id": 626272, "slug": "escape-from-donald-city", "name": "ESCAPE FROM DONALD CITY", "name_original": "ESCAPE FROM DONALD CITY", "description": "<p>Simple petit jeu pour une gamejam...(le but étant de me lancer et d'éditer mon premier jeu) j'ai voulu recréer un jeu listing BASIC de mon vieil amstrad cpc 664 (\"bombardier\" de mémoire)  :</p><p>L'avion descend d'un cran à chaque fois qu'il atteint le bord droit de l'écran.</p><p>Il faut juste appuyer sur X ou O de la console PICO-8 (Z, X, C ou V sur un clavier) pour larguer une bombe à la fois pour détruire tous les immeubles et pouvoir atterrir.</p>\n<p>J'ajouterais prochainement un autre niveau reproduisant un autre jeu listing de mon vieil amstrad bla bla bla (\"tank\" de mémoire) où il s'agira de traverser un pont rempli de mines pour s'échapper de donald city.\r\n</p>\n<p>\n</p>\n<p>Pour info :\r\n</p>\n<p>-élève premium gamecodeur depuis 2 mois (mais j'avance comme je peux entre mon boulot, ma femme ma fille mon fils ma bataille, mon sport, mes loisirs... heureusement que je suis un couche-tard ;-P... d'ailleurs je n'ai attaqué la gamejam que lundi soir... mais je suis là !!!)\r\n</p>\n<p>-j'ai utilisé LUA sur PICO-8\r\n</p>\n<p>-pas de librairie ou codes externes\r\n</p>\n<p>-une dizaines d'heures pour ce petit début... j'aimerais compléter bientôt avec un nouveau niveau et... tout une partie style nouvelle comique... à suivre!\r\n</p>\n<p>- j'ai attaqué la formation avec une idée de jeu que j'ai depuis... 1993... autant dire que je fais des pas de géant depuis ces 2 derniers mois...\r\n</p>\n<p>La gamejam m'a permis de voir que je pouvais accélérer mon code si je me fixe une deadline et j'ai aussi trouvé une façon de gérer plusieurs niveaux... même si je vais me replonger dans les cours gamecodeur pour bien assimiler les nombreux concepts qui me manquent encore aujourd'hui pour aller au bout de mon projet... à long terme...\r\n</p>\n<p>Dans un premier temps j'ai eu du mal à me dire qu'il fallait que je mette de côté ma progression dans les cours gamecodeur pour pouvoir attaquer la gamejam mais je ne regrette pas... au contraire... j'ai gagné en confiance et j'ai appris et assimilé des trucs que j'aurais vu bien plus tard sinon.... VIVEMENT LA  PROCHAINE GAMEJAM !!!\r\n</p>", "metacritic": null, "released": "2021-06-23", "tba": false, "updated": "2021-06-25T06:30:01", "background_image": "https://media.rawg.io/media/screenshots/4af/4afd0883b703a6e2dbf3386de24000d9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 16, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Komlesky"], "genres": ["Action"], "publishers": [], "esrb_rating": null}