{"id": 62627, "slug": "iron-danger", "name": "Iron Danger", "name_original": "Iron Danger", "description": "<p>Iron Danger is a story-driven, turn-based, tactical RPG with simultaneous turns and time manipulation mechanics. A never before seen combination, which brings new level of depth into tactical combat.<br />\nIt is a streamlined, action-packed single-player game in which repetitive grinding is kept to a minimum and every moment advances the story.<br />\nIn this fresh fantasy world of warrior shamans and machine fumes, you take on the role of Kipuna, a simple village girl, who becomes imbued with a cosmic power that grants dominion over time and death. The player controls Kipuna and one of two individual companion characters in tactically challenging battles against a variety of different threats. At center stage in combat is the unique time shifting mechanic that represents Kipuna’s magical influence over the flow of time. It gives the player the ability to rewind at any point with fraction-of-a-second precision, pinpointing strikes to enemies’ unguarded moments, deflecting and dodging attacks exactly when they happen, synchronizing magical and physical attacks to overwhelm difficult enemies, and overcoming impossible odds through trial and error.<br />\nIron Danger challenges you to think of combat and puzzles from a different perspective: you may be an experienced gamer, who knows all the tricks, but you’ve never played a game like this.FEATURESUse unique time-rewind mechanics and experience totally new take on tactical combat and puzzles<br />\nEnter into deep tactical combat with simultaneous turns and take advantage of highly interactive environment to succeed<br />\nAdventure in a world of steampunk fantasy and meet it’s unique inhabitants inspired by Finnish folklore<br />\nFight epic boss monsters on the path to fulfill your destiny<br />\nNo grinding.  Character development is tied to actions that player characters will take.WORLD OF IRON DANGERIron Danger is set in a world of lofty fells, primeval forest, and placid lakes... as well as living gods, monsters of steel and smoke, and supernatural doom dwelling beneath the earth. The city of Kalevala, home of the humans who rebelled against the gods and forsook their protection, shines in the middle of this world, surrounded by towns, sea lanes and and woodlands under its protection. But from the frozen north, a witch queen is leading her army on a quest for vengeance against the lords of Kalevala. Ancient ruins from the days when gods dwelled on the earth are opening to unleash forgotten powers, tempting humans and striving to overtake the wo<br />\nrld.</p>", "metacritic": 73, "released": "2020-03-24", "tba": false, "updated": "2023-12-19T12:48:17", "background_image": "https://media.rawg.io/media/games/043/043e69bc15cc6dfbf2222f9f5878bfb3.jpg", "website": "https://www.irondanger.com", "rating": 2.63, "rating_top": 3, "added_by_status": {"yet": 60, "owned": 1087, "beaten": 6, "toplay": 38, "dropped": 14}, "playtime": 1, "achievements_count": 13, "ratings_count": 28, "suggestions_count": 337, "game_series_count": 0, "reviews_count": 30, "platforms": ["PC"], "developers": ["Action Squad Studios"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Daedalic Entertainment", "Action Squad Studios"], "esrb_rating": null}