{"id": 62630, "slug": "lordian-karma", "name": "Lordian: Karma", "name_original": "Lordian: Karma", "description": "The war of six tribes that destroyed the continent of Lordian ended with only destructive damage to all. <br/>The balance of power has collapsed and created a massive rift inside a barrier dimension where the mad tyrant \"The Emperor\", an ancient god was sent to exile.<br/>It took a very long time for The Emperor, who had been slowly recovering his strength to find the rift.<br/>At the end, The Emperor commanded his troops to split open more and more rifts and started cross over into Lordian.<br/><br/>You are the first alchemist hero who arrived in this mythical world after the aftermath of Millennial War between The Emperor and the six tribes.<br/>Your mission is to defeat the resurrected tyrant and rebuild the shattered land of Lordian.<br/><br/><br/><br/>Destroy waves of monsters with your powerful magic crossbow and alchemical traps. <br/>Freeze, blow, trample, even burn your enemies with various traps available.<br/>From extreme difficulty which can only be experienced through multiplayer to various stages of difficulties for single player.<br/>Test your skill and challenge your limits in the highest quality action defense VR games, <strong>Lordian: Karma</strong>.Key Features<ul><li>Highest quality VR graphic. Brilliant effects and fantastic modeling using Unreal Engine.<br/></li><li>Multiplayer - Challenge the most difficult level of the game with you friend. Up to 2 players.<br/></li><li>3 single stages and 4 multi stages. Different level designs require different strategies.<br/></li><li>Maximize effects of virtual reality and provide various realistic environment, such as snow, underground, and heavy rains.<br/></li><li>10 different kinds of monsters. Kobold, Gargoyle, Ogre and many more.<br/></li><li>8 diverse and effective traps such as Bomb Barrel, Claymore, Mighty Stamper and more.<br/></li><li>Score system and Leaderboard. Compete with other players and earn the Best Slaughterer title!</li></ul>", "metacritic": null, "released": "2018-05-29", "tba": false, "updated": "2019-08-28T21:57:20", "background_image": "https://media.rawg.io/media/screenshots/8ec/8ecc1da4e6d8004a56d8bdf20f83f5fe.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 542, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["oneIMMERS"], "genres": ["Action", "Strategy"], "publishers": ["YJM GAMES"], "esrb_rating": null}