{"id": 626300, "slug": "snakes-redemption", "name": "Snake's Redemption", "name_original": "Snake's Redemption", "description": "[EN] Presentation\r\n\r\n<p>Snake's Redemption is a shooter game where the player can switch between different points of view. Each point of view gives different gameplay mechanisms to the player :\r\n</p>\n<ul><li>First person view: the player can interact with a circuit-breaker which can turn on/off all the lights of the street and activate/deactivate the night vision. When the lights are off, all the enemies have a reduced field of view. This option gives the player the opportunity to take them down more easily.\r\n</li><li>Side view/Platformer view: the player can jump and push some crates on the level. Those mechanics can be useful to reach some checkpoint without being detected by enemies.\r\n</li><li>Top down view: the player has an extended view of the level. He can anticipate the future enemies position and obstacles.\r\n</li></ul>\r\nSynopsis\r\n\r\n<p>Despite your rescue mission as Snake Plissken, the President of the United States is dead after he takes a bullet in the head from a criminal. You’re surrounded by many thugs and you have to flee from Manhattan as soon as possible. \r\n</p>\r\nHow to play\r\n\r\n<p>The whole prototype is playable with a keyboard only. Here are the inputs to play the game :\r\n</p>\n<ul><li>General<ul><li>Z,Q,S,D: Move\r\n</li><li>1: First Person View\r\n</li><li>2: Side View/Platformer view\r\n</li><li>3: Top down view\r\n</li><li>Mouse left click: Shoot\r\n</li></ul>\n</li><li>First Person View<ul><li>Mouse: Move the gun\r\n</li><li>E: Interact with circuit-breaker\r\n</li></ul>\n</li><li>Side View/Plateformer view<ul><li>Space: Jump\r\n</li><li>Hold E : Push a crate\r\n</li></ul>\n</li></ul>\r\nSome tips\r\n\r\n<ul><li>To push the crate on the side view, you have to move in the direction of the crate.\r\n</li><li>There is just one type of crate that you can push.\r\n</li></ul>\r\nCredits\r\n\r\n<ul><li>AurePixel: Producer/Game designer/Level designer\r\n</li><li>Z0hung44r: Developer\r\n</li><li>Streaper2: Developer\r\n</li><li>Padawan: Artist/Level builder\r\n</li></ul>\n\r\nShoot enemies in different views\r\n\n\r\nUse jump in the side view\r\n\r\nPush crates in the side view to progress in the level<br/>\n\r\n[FR] Présentation\r\n<p>Snake's Redemption est un jeu de tir dans lequel le joueur peut passer d'un point de vue à un autre. Chaque point de vue offre des mécanismes de jeu différents au joueur :\r\n</p>\n<ul><li>Vue à la première personne : le joueur peut interagir avec un disjoncteur qui peut allumer/éteindre toutes les lumières de la rue et activer/désactiver la vision nocturne. Lorsque les lumières sont éteintes, tous les ennemis ont un champ de vision réduit. Cette option donne au joueur la possibilité de les abattre plus facilement.\r\n</li><li>Vue de côté/Platformer : le joueur peut sauter et pousser certaines caisses dans le niveau. Ces mécanismes peuvent être utiles pour atteindre un checkpoint sans être détecté par les ennemis.\r\n</li><li>Vue de haut en bas : le joueur a une vue étendue du niveau. Il peut anticiper la position des ennemis et les obstacles à venir.</li></ul>\r\nSynopsis\r\n<p>Malgré votre mission de sauvetage en tant que Snake Plissken, le Président des Etats-Unis est mort après avoir reçu une balle dans la tête d'un criminel. Vous êtes entouré de nombreux malfrats et vous devez fuir Manhattan au plus vite. </p>\r\nComment jouer\r\n<p>\tL'ensemble du prototype est jouable uniquement avec une souris et un clavier. Voici les entrées pour jouer le jeu :\r\n</p>\n<ul><li>Général\r\n<ul><li>Z,Q,S,D : Déplacement\r\n</li><li>1 : Vue à la première personne\r\n</li><li>2 : Vue de côté/Platformer\r\n</li><li>3 : Vue de haut en bas\r\n</li><li>Clic gauche de la souris : Tirer\r\n</li></ul></li></ul>\n<ul><li>Vue à la première personne\r\n<ul><li>Souris : Déplacer l'arme\r\n</li><li>E : Interagir avec le disjoncteur\r\n</li></ul></li><li>Vue de côté/Plateformer view\r\n<ul><li>Espace : Sauter\r\n</li><li>Maintenir E enfoncée: Pousser une caisse</li></ul></li></ul>\r\nQuelques conseils\r\n<ul><li>Pour pousser la caisse en vue latérale, vous devez vous déplacer dans la direction de la caisse.\r\n</li><li>Il n'y a qu'un seul type de caisse que vous pouvez pousser.</li></ul>\r\nCrédits\r\n<ul><li>AurePixel : Producteur/Concepteur de jeu/Concepteur de niveau\r\n</li><li>Z0hung44r : Développeur\r\n</li><li>Streaper2 : Développeur\r\n</li><li>Padawan : Artiste/Constructeur de niveau</li></ul>\r\nAbattez vos enemis en vous servant des différents points de vue\r\nSauter en par dessus les obstacles en vous servant de la vue de côté\r\nPousser les caisses en vue de côté et frayez-vous un chemin à travers le niveau", "metacritic": null, "released": "2021-06-23", "tba": false, "updated": "2021-06-25T06:37:32", "background_image": "https://media.rawg.io/media/screenshots/595/59579df511e4e632ca382f5f53aad9fe.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 130, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Padawan", "streaper2", "Z0hung44r", "AurePixel"], "genres": ["Action", "Shooter", "Platformer"], "publishers": [], "esrb_rating": null}