{"id": 626507, "slug": "sair", "name": "SAIR", "name_original": "SAIR", "description": "Install instructions<p>SAIR is a multiplayer game and it can be played by 2 or 3 players. SAIR can be played in one computer where two players will share the screen or in more than one machines. In that case one of those machines will act as the server.\r\n </p>\n<p>SAIR is not taxing on the hardware, but you will need an internet connection if you play in more than one PCs. For the downloads see below depending on your OS. Links\r\n </p>\n<p>After you click the correct link from the list, you will be taken to a new page, from which the download of the required zip file will start. <br/></p>\n<strong>Connecting in SAIR</strong>\n<p><strong>Case 1 - 1 Computer</strong>\n</p>\n<p>If two players use the same computer, this is called the split screen mode. In that case both players use the same computer screen, divided into two smaller game screens. The first player is assigned to the mouse and the second to the keyboard keys. The steps that need to be followed for that kind of connection would be:\r\n </p>\n<ol><li>Player 1 interacts with the post in the first screen of the game. - A message will be displayed.\r\n</li></ol>\n<p>Connecting 1</p>\n<p>Player 1 then interacts with the tent in the first screen of the game. - A message regarding two players in the same PC will be displayed.</p>\n<ol><li> <p>A second game screen will appear. That is the screen of the second player. There, the second player should guide their avatar to interact with the road in the starting screen. After they complete this step, the two players should be able to see each other.\r\n </p><p>https://youtu.be/oMkzzFHEGzY<br/></p></li><li><strong>Case 2 - 2 Computers with the same IP (LAN)</strong><br/>\n<ol><li>Player 1 interacts with the post in the first screen of the game. - A message will be displayed.\r\n</li><li>Player 2 interacts with the road in the first screen of the game. When they answer “yes” to the question that will be answered they should be able to connect with player 1.\r\n</li></ol></li><li><strong>Case 3 - 2 Computers with different IPs - Remote connection</strong><br/>\n<ol><li>Player 1 interacts with the post in the first screen of the game. - A message will be displayed.\r\n</li><li>Player 1 and player 2 and 3 run hamachi\r\n</li><li>All players should be connected to each other through hamachi, setting a network.\r\n</li></ol> <em>\r\n \r\nPlayers open the menu then, by pressing the ESC button, or the right mouse button and choose options and then network —&gt;IP . There, they have to input the hamachi address of the first player, which acts as the server. All the players have to input <strong>the hamachi address of the first player</strong>.\r\n \r\n<em>\r\n \r\nAfter the previous step is completed successfully, the second and third player have to interact with the road. If everything is done correctly they should be able to see each other. Follow this link to download Hamachi which is suggested to be used if the two computers do not share an IP.\r\n \r\n<ul><li>Navigate to the folder that was created, and run the Game.exe file.\r\n</li></ul> Download code\r\n The code of SAIR is freeware. That means that anyone can download it, use it, expand it, and modify it. In order to do so they must have the RPG Maker MV software which can be downloaded from here.\r\n \r\nThe tool that was used\r\n The tool that was used for the creation of SAIR, was RPG Maker MV from the RPG Maker series. The specific software was chosen for the design and development process due to its usability, graphical results, and low level programming skills required as well as the ease with which a multiplayer game could be realized.\r\n \r\nRPG Maker MV and Plugins\r\n In RPG Maker MV plugins can be used. As a result a large community has grown around RPG Maker MV, in which plugins are developed which add things to the game making editor. The editor itself has a plugin manager for the better introduction of plugins to the game.</em></em><p>\n</p></li></ol>", "metacritic": null, "released": "2021-06-23", "tba": false, "updated": "2021-06-25T07:32:17", "background_image": "https://media.rawg.io/media/screenshots/303/30312aa95b0ab83517f8efe2c5869496.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["IonioGames"], "genres": ["RPG", "Educational"], "publishers": [], "esrb_rating": null}