{"id": 626870, "slug": "hover-gulch", "name": "Hover Gulch!", "name_original": "Hover Gulch!", "description": "You are a futuristic hovercar developed by the trillionaire owner of a stagnant maze-racing circuit. He has loaded you up with special powers so you can embarrass all the league's other cars.\r\n\n<p>Skip to Downloads</p>\n\r\nHow to Play\r\n<ul><li>You must spin out rival cars by <strong>ramming</strong> them, catching them in your <strong>boost trail,</strong> or <strong>spinning </strong><strong>another car </strong>into them.</li><li>Spin out the required number of cars on each level to unlock the checkered <strong>flag.</strong> Grab the <strong>flag</strong> to advance.</li><li>You are <strong>invincible</strong> while using your powers but vulnerable while you are not. Walls never hurt you, thanks to advanced bouncing science.</li><li>All your special powers always trigger at the same time. This consumes <strong>gel</strong> because nothing is truly free.</li><li>If you run out of <strong>lives</strong> or gel, the game is over... until you are brave enough to restart.</li><li>After you clear a level, your leftover <strong>gel</strong> will convert to <strong>flex,</strong> which is like a kind of score that measures how hard you have flexed in Hover Gulch.</li></ul>\r\nKeyboard controls\r\n<ul><li><strong>Arrow keys</strong> to turn</li><li><strong>X</strong> to <strong>boost speed,</strong> engage your <strong>ram,</strong> and become <strong>invincible,</strong> all at the same time</li><li><strong>Z</strong> to skip scenes you've seen before</li><li><strong>Enter</strong> to pause (and to quick-restart)</li></ul>\r\nHints\r\n<ul><li>As a hovercar, you have to complete your turn rotation before you start moving in the new direction. It's just how hovercars work, especially in the future. (Try turning a little on the early side)</li><li>There's a way to get one extra life per level, but it's risky. </li><li>There's an even bigger secret, but it's <em>very</em> risky.</li></ul>\r\nCredits\r\n<p>Audio, code, design, graphics, and writing by me, Rob Dubbin.</p>\n<p>Thanks to RALLY-X, Rocket League, Alfonzo's Bowling Challenge, and One Must Fall: 2097 for inspiring Hover Gulch in various ways. Thanks to Bennett Foddy for inspiring the project in the first place with a well-timed homework assignment even though I was not his student. Thanks to zep for pico-8 and especially for \"The Search for Cosy Design Spaces,\" a perfect conference talk that should be on the next Golden Record.</p>\n<p>Thanks to Kittenm4ster, Cabledragon, Michael Cook, seleb, and 8 Bit Caaz for sharing their secrets of the Fisher-Yates shuffle, ZSPR zoomed-sprite rendering, cellular-automata cave generation, token-saving, and camera-easing, respectively.</p>\n<p>Thanks to the pico-8 community for all the brilliant work: games, tweetcarts, and the 100,000 small tricks I looked up on here while making this.</p>\n<p>Thanks to everyone who I can remember playtesting this over various points in its history: 0xcafed00d, Adam Miller, Alexander King, Andy Dubbin, Asher Vollmer, Augustus Heagerty, Bennett Foddy, Bijan Stephen, Chris Xu, Colleen Macklin, Dylan Saunders, Frank Lantz, Fred Benenson, Garrett Miller, Greg Wohlwend, Kevin Cancienne, M@ Boch, Nick Sylvester, Patrick McHale, Pen Ward, Sarah Pavis, Sean Vanaman, Stacy-Marie Ishmael, TC Sottek, Xalavier Nelson Jr., and Zach Gage.</p>\n<p>Thanks to Sandy Allen for pretty much everything else.</p>\r\nThanks for checking it out\r\n<p>My finest flex is <strong>398</strong> -- see ya on the road!</p>", "metacritic": null, "released": "2021-06-22", "tba": false, "updated": "2021-06-25T09:12:51", "background_image": "https://media.rawg.io/media/screenshots/586/58607ca3704c695736c2affd2635f28d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 17, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["dubbin"], "genres": ["Action", "Adventure", "Racing"], "publishers": [], "esrb_rating": null}