{"id": 626879, "slug": "path-of-slime", "name": "Path Of Slime", "name_original": "Path Of Slime", "description": "<p><strong>The Slime is back full of adventure paths and full of traps.</strong> Slide your way through a tough and vibrant environment &amp; stretch your way to a goal before your life ends. Do you love games with tons of exciting levels &amp; real fun? Then this game is best for you.</p>\n<p>Path of Slime is an addictive game that owns plenty of levels, challenging modes, and so on. Guide the slime to reach the endpoint and unlock the new challenges and surprises. The whole surroundings are full of dangerous obstacles, help slime to reach the endpoint without losing its life. </p>\n<p><strong>Features </strong>\n</p>\n<ul><li>Simple control: Touch and slide to reach your endpoint. </li><li>Challenging and fun levels: You will feel addicted and enjoy the challenging levels. </li><li>Traps are more challenging as you reach higher levels</li><li>Easy to learn! Too hard to be a pro!</li></ul>\n<p><strong>Be careful! This game is addictive</strong>. You won't stop after passing the exciting levels. Take a surreal journey through an otherworldly dimension, move in harmony with sound and music &amp; reach the goal by defending the attacks. You have three lives in a game. After losing your whole life, you need to restart the game from starting point. Try to pass over all tricky obstacles in the dangerous path. \r\n</p>\n<p>The <strong>Path Of Slime</strong> is a classic game with slime as the main character. Our task is to reach slime at the endpoint without losing life in tricky obstacles. \r\n</p>\n<p>The <strong>game will challenge you</strong> to how far you can slide the slime without losing your life. Learn the patterns and come up with the moves and proper timing to pass it! Do not give up, challenge yourself and play the game. \r\n</p>\n<p>Path Of Slime is designed for smooth &amp; fast performance, with a simple one-finger control design. <strong>Challenge your friends</strong> to play the game and see who is the best! End your search for an adventurous challenging game here. Download and play the \"Path Of Slime\".\r\n</p>", "metacritic": null, "released": "2021-06-22", "tba": false, "updated": "2021-06-25T09:14:54", "background_image": "https://media.rawg.io/media/screenshots/992/99230fcd917689e7df16f3b69e9f5de4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 80, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Studio Adriatic"], "genres": ["Action"], "publishers": [], "esrb_rating": null}