{"id": 62690, "slug": "operation-chromite-1950-vr", "name": "Operation Chromite 1950 VR", "name_original": "Operation Chromite 1950 VR", "description": "<strong>Incheon landing operation on 1950</strong><br/><br/>Background of this game is ‘Incheon landing operation’ as crucial reason of victory <br/>in Korean war on 1950. This game is made under real historical event with added fiction.<br/><br/><br/><br/>You experience war situation as an unit of landing troops.<br/>This game contains total 3 main missions and 9 sub missions.<br/>Player experience really occurred situations gradually as same as real war.<br/><br/><strong>Mission1_Palmi lighthouse occupation</strong> <br/>Sep.14.1950 PM 19:00<br/>You join the operation as a special force soldier of KELO'<br/>The main mission is to occupy coastal line, demolition of guard posts, and capture of lighthouse.<br/><br/><strong>Mission2_Green Beach Operation : Occupy the Wolmi island</strong><br/><br/>Sep.15.1950 AM 06:30<br/>After bombimg by US battle ships and aircraft, US marine landed on Green beach.<br/>You join the operation as a soldier of marine.<br/>The main mission is to annihilate the North Korea soldiers in Wolmi island and raise the Korean flag in the top of island.<br/><br/><strong>Mission3_Depense of Wolmi island bank</strong><br/><br/>Sep.15.1950 AM 09:30<br/>The operation to defense North Korea's attach till accomplishment of landing.<br/>You defense the enemy's attack in the defensive camp as a marine.<br/>The main mission is to remove enemy's infiltration units, annihilate the retreated North Korea soldiers <br/>and destroy the enemy's fire units to attack Wolmi island.<br/><br/><br/><br/><br/>2 way of moving is available in this game.<br/>These are operated by left controller of Vive<br/>First way to move up/down and left/right is controlled by pushing pad of left controller. <br/>But, long time play of VR may cause motion sickness so we may add one more way.<br/><br/>Second way is teleport.<br/>Teleport function is activated to push above menu button of pad on left controller.<br/>Teleport caused by long line from controller appoint to destination. <br/>Under this condition, push to pad move to required destination by teleport.<br/>Player can play to choose a way of moving among two according to circumstance.<br/><br/><br/><br/>Basic using arms on this game are main arm(carbine rifle) sub arm and grenade.<br/>After starting game, player choose arms to push right pad button.<br/>During games, player can acquire other arms.<br/>Acquired available arms are displayed at certain area as the acquire available items.<br/>If player acquired other arms, he can use it until use up all bullets.<br/><br/><br/><br/>This game is made as the part of Incheon landing operation.<br/>We plan to add more stories and functions under base of Korean war.<br/>In addition, we plan to add North Korean troops arms and event operations.", "metacritic": null, "released": "2018-02-04", "tba": false, "updated": "2019-08-28T21:57:17", "background_image": "https://media.rawg.io/media/screenshots/b4f/b4fc1ed0804c617fe9fd63dbde39a7e6.jpg", "website": "http://www.einpictures.co.kr/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 407, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["eiNpictures"], "genres": ["Action", "Simulation", "Indie"], "publishers": ["eiNpictures"], "esrb_rating": null}