{"id": 627254, "slug": "8bitminer", "name": "8BitMiner", "name_original": "8BitMiner", "description": "<p>Português</p>\n<p>Um jogo de plataforma em pixel onde você controla um personagem que quer usar seu tempo trabalhando com <strong>“CriptoMoedas”</strong>. Então com sua ideia ele consegue adquirir placas de vídeo fazendo códigos dentro do jogo, gerado de forma aleatória. Com os códigos digitados corretamente você ganha uma quantidade em dinheiro que você pode usar para comprar mais quantidades ou evoluir sua placa de vídeo. Este é um jogo sem fim, porém se você quebrar suas placas de vídeo ou deixar o seu saldo negativo, você acabará perdendo o jogo, ou com o sonho do personagem em ser um minerador nato.</p>\n<p>  <br/>Setas ou WASD para andar.<br/>Shift para Dash.<br/>E para interagir com objetos.</p>\n\n<p>English</p>\n<p>A pixel platform game where you control a character who wants to spend his time working with <strong>“CryptoCoins”</strong>. So with his idea he can acquire video cards by making codes inside the game, generated randomly.  With the codes typed correctly you earn an amount of money that you can use to buy more amounts or upgrade your video card.  This is an endless game, however if you break your graphics cards or run your negative balance, you will end up losing the game, or your character's dream of being a natural miner.</p>\n<p>  Arrows or WASD to walk.<br/>  Shift to Dash.<br/>\"E\" to interact with objects.<br/><br/><br/>Only working on windows 64 bits (for now...)<br/>Apenas funcionando em windows 65 bits (por agora...)</p>", "metacritic": null, "released": "2021-06-21", "tba": false, "updated": "2021-06-25T10:47:48", "background_image": "https://media.rawg.io/media/screenshots/7de/7dec97aacad7246a6a40f2990267aec4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 9, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BonnBonn", "Mark Jogos"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}