{"id": 627280, "slug": "neon-blood-lakedead", "name": "Neon Blood (LakeDead)", "name_original": "Neon Blood (LakeDead)", "description": "<p>Eero Höök's (aka Roikku's) Submission for 2021 Amaze Me Game Jam GMS2.</p>\n<p><strong>Created completely during the jam within 4 days.</strong> Not including some of the audio assets.<br/></p>\n<p>To my knowledge, the source code isn't required with the project, as was stated on the yoyogames forums. <br/></p><p>Audio assets are not available for public distribution, only for my use, so please approach me about validating the usage of GMS2 engine if required.</p>\n<p><strong>Neon Blood</strong> is a top down shooter designed for 2-4 player couch coop teamplay with gamepads, either physically with friends or via Parsec online service.</p>\n<p>There is a singleplayer mode with keyboard + mouse controls as well.</p>\n<p>The game is quite hard difficulty, and the default Pansy (easiest) mode is for a normal experience. The rest of the difficulty levels may require focused multiplayer teamwork.</p>\n<p>A level selector is also present in the main menu  in order to either continue where you died or to see all of the current build's content, which is about 4 levels and on the last one is a boss fight.</p>\n<p>The use of the jam's theme \"<strong>Neon</strong>\" is mainly focused on the enemies being attracted to low health, bleeding players, which spill Neon Blood as the player characters are genetically altered super soldiers. It had to have a downside to be powerful.</p>\n\n\n<p>Fun trivia:</p>\n<p>I worked alone and with GMS2 IDE version 2.3.2.560.</p>\n<p>My project only got corrupted 2 times during the jam, but I powered through it!</p>\n\n\n\n<p>You can support further games development via https://paypal.me/roikkudev</p>", "metacritic": null, "released": "2021-06-21", "tba": false, "updated": "2021-06-25T10:55:16", "background_image": "https://media.rawg.io/media/screenshots/44a/44a433c15f2bf6d2d87be74cf7792ad5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 65, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["LakeDead"], "genres": ["Action"], "publishers": [], "esrb_rating": null}