{"id": 627282, "slug": "wired-and-flagged", "name": "Wired and Flagged", "name_original": "Wired and Flagged", "description": "<p>Greets.<br/></p>\n\n<p><strong>DESCRIPTION<br/></strong></p>\n<p>Preferring to use brain cells to reflexes? Or rather both in parallel? <br/>Customize the game to your play style or mood: thinker or shooter.<br/></p>\n<p>Try it with some funny companions, baddies  &amp; electricity.<br/><br/>When gathering sufficient points, a helpful feature (\"Joker\", which shows the globe) will guide you onwards, especially if you know - or would like to know - a bit about geography in general.<br/></p>\n<p>(All these in Neon theme, as was pointed out by this GMS JAM)</p>\n<p><em>Watch the gameplay video! <br/><br/></em></p>\n<p>O<strong>BJECTIVES</strong></p>\n<p><em>1 - Guess the country name, whose flag can be seen in the background. </em><br/></p>\n<p>For this, gather the suitable neon letters appearing, and carry them one by one to the stage. That blue stage has as many stands, as many letters the country name consists of.  If a carried letter is correct, it will stay on the stage, otherwise not (if flies to the upper part of the screen, so that you could see which guesses were wrong).</p>\n<p><em>2 - Repair the damaged floor-wired electricity circuit with the help of your REPAIRMAN,<br/><br/></em> who follows you, after you meet (collide) with him. <br/>It is easy to recognize a damaged wire piece, as there are sparkles on that place, and a horizontal wire can also be clearly seen. <br/><br/>(<em>Damaged wire-tiles</em> will also have a chance to <em>electrically shock and kill</em> most actors in the game (except for your repairmen and certain kinds of baddies), especially if one is standing on those damaged wire-tiles for long)</p>\n<p>If you are done with all these, the level is cleared, and you can go on till level 10. At every level, you meet new challenges:<br/>-a new flag and a country name to guess, <br/>-and a new level layout where you are about to carry the correct letters to the stage, but baddies will try to stop you.</p>\n<p><em>REPAIRMEN will also give you (in timed intervals) most of the letters necessary to guess the current country name,</em> so close cooperation with them is advisable.<br/></p>\n<p>If that help is insufficient for you to guess the county name, <em>the globe can be summoned (\"Joker\" function)</em> showing where the to-be-guessed country is geographically situated.</p>\n\n<p><strong>CONTROLS</strong><br/></p>\n<p>Movement:  ASWD / cursor keys<br/>Shoot:  SPACE<br/>Activate Joker (show the globe): CONTROL <br/><br/></p><p>----------<br/>Edit: <br/>uploaded a <strong>more easy, balanced version</strong>, which will help &amp; teach much more, especially in shooter mode. </p>", "metacritic": null, "released": "2021-06-21", "tba": false, "updated": "2021-06-25T10:55:47", "background_image": "https://media.rawg.io/media/screenshots/18a/18ab2c3db2c47cfe73092d2eef7af92b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 68, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Elodman"], "genres": [], "publishers": [], "esrb_rating": null}