{"id": 627318, "slug": "one-million-monkeys", "name": "One Million Monkeys", "name_original": "One Million Monkeys", "description": "<p><em>\"It is said that one million monkeys on one million typewriters will eventually produce the full works of Shakespeare\"</em><br/></p>\n<p><em>- Mr. Burns Probably</em></p>\n<p>You've been skipping on your studies for the whole college semester, and finally sat down to finish your essays for History, Literature and Science. The only problem however is that they are almost due with only minutes to spare.</p>\n<p>Luckily you have trained your various monkeys in the art of essay writing, and have them do the bulk of the work, even if they just often smash keys at random. You can choose either multiple words, or choose none and wait for them to disappear.<br/></p>\n<p>Can you and the monkeys finish your three essays before the submission period ends?</p>\n<p>This game was made in the 72 hour Mashup GameJam 2, with the theme being UNCONVENTIONAL MEANS. You use the monkey's random words in place of any actual essay writing skills. It was conceived of while simultaneously watching a Simpsons episode, writing an essay and listening to the jam announcement at the same time. All assets were made from scratch, although we were unable to come up with all of the music on time.<br/></p>\n\n<p><strong>Credits:<br/></strong></p>\n<p>Equilius Fromjaf - Programming</p>\n<p>Mr Craft(ron) - Art</p>\n<p>This was  Equilius first jam game, so expect a few bugs and stuff.<br/>Be sure to contact Equilius through his Twitter @fromjaf<br/></p>", "metacritic": null, "released": "2021-06-21", "tba": false, "updated": "2021-06-25T11:07:00", "background_image": "https://media.rawg.io/media/screenshots/bc3/bc38bfb53afd4b7a58e4d4eeecc1e3b3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 91, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["Equilius", "Mr Craft"], "genres": [], "publishers": [], "esrb_rating": null}