{"id": 627322, "slug": "snakeroot", "name": "Snakeroot.", "name_original": "Snakeroot.", "description": "<p><strong>Snakeroot</strong> is a fantasy horror interactive fiction WIP about monsters, haunted forests, and surviving when the odds are stacked against you. It is set in the original modern fantasy world of Siressea, inspired by TTRPG formats D&amp;D and MoTW. <br/></p>\n<p>In it, you play as a hunter in the employ of the Vanguard, an organisation of monster-hunters dedicated to combating a magical curse known as the Rot.</p>\n\n<strong>General content warnings:</strong> injury to major characters, gore, body horror. More specific content warnings will be provided at the start of each chapter.\r\n\n\n<p><em>THERE IS SOMETHING WRONG BEYOND THE TREES.\r\n</em><br/></p>\n<p>A strange magic infects these lands.</p>\n<p>They call it the Rot, a curse that distorts the lands and creatures around it. For years, its tide has been stemmed by magical barriers, dutifully enforced by the Vanguard's hunters. For years, the strategy has worked... until now.</p>\n<p>The barrier has cracked. Something slithers through.</p>\n<p>Why now?</p>\n<p>\r\nWhy <em>you</em>?</p>\n<br/>Snakeroot contains...<br/>\n<ul><li>An original modern fantasy setting, for you to pick apart as an intrepid monster hunter. Explore a haunted forest, and uncover the secrets that lie behind your forgotten past and mysterious magic.</li><li>Customisable protagonist — hone your skills, choose from four playable races (human, merfolk, chimaera, &amp; shifter) and more!</li><li>Friendly &amp; not-so-friendly faces, including three fellow unfortunate souls with unique backstories and powers. Death is but an impermanent acquaintance, but there's many bad decisions to be made.</li><li>10+ original illustrations accompanying codex and companion entries, with plans for greater incorporation into the story.</li><li>Adjustable UI design with a mobile-friendly format, toggeable light and dark themes, and font adjustments for readability.</li></ul>\n\n<ul><em>\n<br/></em></ul>\n\n<p><em><strong>LUX</strong>. <em>Gender selectable (she/he/they).</em> <em>Merfolk (shark).</em> </em>As blunt and honest as their path is true, Lux's specific skillset makes them an indispensable asset on all mobile hunting teams. <br/></p>\n<p><strong>RAINE</strong>. <em>Gender selectable (she/he/they).</em> <em>Chimaera (aetheric).</em> Polite but reserved, Raine possesses an unusual talent for magic and a sharp mind. They specialise in healing, but watches every battle with an unerringly keen eye.</p>\n\n<p><strong>MALLORY</strong>. <em>Trans male (he/him).</em> <em>Chimaera (aetheric).</em> Raine's younger brother is bright and disarmingly cheerful, with a reputation as a frighteningly effective hunter that precedes him. <br/></p>\n\n\n\n<p>Writing, coding, &amp; original art (logo &amp; portraits): Cerberus (Cer) - Tumblr</p>", "metacritic": null, "released": "2021-06-21", "tba": false, "updated": "2021-06-25T11:07:56", "background_image": "https://media.rawg.io/media/screenshots/b3a/b3adf76f2bd3cfd3fa483813a3b5c27d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 17, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Cerberus"], "genres": [], "publishers": [], "esrb_rating": null}