{"id": 62737, "slug": "pirate-mosaic-puzzle-caribbean-treasures", "name": "Pirate Mosaic Puzzle. Caribbean Treasures", "name_original": "Pirate Mosaic Puzzle. Caribbean Treasures", "description": "Pirate Mosaic Puzzle. Caribbean Treasures has 120 mosaic puzzles just waiting for you to assemble them. Among them you’ll find easy ones, hard ones, long ones and short ones. The mosaic pieces are made of various materials – tree, wood, cloth, glass, paper, precious stones and metals.<br/>\n<br/>\r\nThis game genre is also known as jigsaw, puzzle, mosaic, patchwork, guess the picture, logic game. But whatever you call it, fun gameplay is guaranteed!<br/>\n<br/>\r\nTo complete a level in Pirate Mosaic Puzzle. Caribbean Treasures, all you have to do is assemble a picture. But having fulfilled the level’s main requirements, you can increase your rank and unlock the next area.<br/>\n<br/>\r\nSix legendary captains met on a mysterious island to piece together the fragments of Captain Flint’s map. Assemble patchwork-style puzzles and guess the picture: ocean views, mythical monsters, pirate tales, sea battles and mysterious artifacts.<br/>\n<br/>\r\nBecome a legend of the seven seas alongside Pirate Mosaic Puzzle. Caribbean Treasures.<br/>\n<br/>\r\n- 120 unique puzzles patchwork mosaics<br/>\r\n- Make any purchase - turn off ads! <br/>\r\n- 6 locations and 6 different materials<br/>\r\n- Pirate setting<br/>\r\n- Special quests and 18 trophies for the real pros<br/>\r\n- More than 10 hours of gameplay with beautiful calming and cheerful music<br/>\r\n- Entertaining gameplay for players of all ages<br/>\r\n- Use bonuses and earn new ranks", "metacritic": null, "released": "2018-08-03", "tba": false, "updated": "2019-08-28T21:57:15", "background_image": "https://media.rawg.io/media/screenshots/643/64369da0ec4ec7a50ebf0ff902172b94.jpg", "website": "https://www.facebook.com/8FloorGames/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 13}, "playtime": 4, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 178, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Creobit"], "genres": ["Casual"], "publishers": ["8Floor"], "esrb_rating": null}