{"id": 62739, "slug": "merlin-soccer", "name": "Merlin Soccer", "name_original": "Merlin Soccer", "description": "Have you ever wanted to play magic football? Now you will have the opportunity. In this game you have to control the flight of magic balls and score them into the goal, simultaneously destroying the monsters that protect them. The balls are of various kinds. Some of them can be launched only once, and some do not succumb to spells, so you have to use the other balls to move them from their place.<br/><br/>Features:<ul><li>Many levels<br/></li><li>Suitable for children<br/></li><li>Nice graphics<br/></li><li>Has many Steam achievements<br/></li><li>Compatible with Windows, Mac and Linux</li></ul><br/>This game is just what you need if you want to play something original. After all, here in front of you is a real arcade magic football! Of course, this is not a team game. Here everything is controlled by a single magician, that is you. But your power is not unlimited. To win you will need to defeat the evil Troll and decide how to move some swords from their place. It sometimes looks like a puzzle, so you will not be bored! In addition, the game is quite exciting and contains many levels. Pass the levels themselves are not too difficult, but to do it with the maximum rating - that is, destroying all the monsters - can be a real problem. The game is well developed various skills and will be very useful for children.<br/><br/>", "metacritic": null, "released": "2018-08-03", "tba": false, "updated": "2019-08-28T21:57:15", "background_image": "https://media.rawg.io/media/screenshots/ad9/ad958ddd102e523ae87339391e40a396.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 50, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Educational Games"], "genres": ["Casual", "Indie"], "publishers": ["Educational Games"], "esrb_rating": null}