{"id": 627426, "slug": "memory-the-rpg", "name": "Memory. The RPG", "name_original": "Memory. The RPG", "description": "<p>Memory. The RPG. is a game created for MashUp jam 2. It combines a retro RPG item and battle system with the timeless game of memory. The world is made up of cards that you reveal in pairs. Your goal is to match all the cards, but matching enemies is a bit more dangerous than the other cards!<br/></p>\n<p>This game is more or less an early prototype. For the jam, everything had to be created from scratch in less than 72 hours. There may be bugs, and it's unfortunately lacking audio, but if you enjoy the concept, please let me know! It was a lot of fun to build so far and may get worked on more in the future.</p>\n<p>Controls:</p>\n<p>Use mouse to navigate menus.</p>\n<p>Keyboard and mouse is recommended in game. Mouse can be used to select tiles, and click them. Arrow up an down, or `W` and `A` can be used to navigate battle menu. Use `space` to select items in the battle menu.</p>\n<p>There is some controller support in game, but it is not configurable. The left joystick should move the cursor, and navigate battle menus. The other buttons change name a lot, but there is a button to flip tiles, and another to select menu items. Better support to come in the future! </p><p>Downloads:</p><p>- windows and mac installs are available for download. it is the same as the web version, but should run a bit more stable.</p>\n<p>Thanks for checking out the game! Have fun!</p>", "metacritic": null, "released": "2021-06-21", "tba": false, "updated": "2021-06-25T11:33:44", "background_image": "https://media.rawg.io/media/screenshots/e86/e8660459aefd74733eb4ecddfe985ab9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 30, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["ahhsumx", "kromphroy"], "genres": ["RPG", "Puzzle"], "publishers": [], "esrb_rating": null}