{"id": 627466, "slug": "zbyu", "name": "Zbyu", "name_original": "Zbyu", "description": "<p><strong>If it's too laggy on browser, try downloading</strong><br/></p>\n<p><strong><em>The enemy is trying to attack your home base, use your invincible ship to fend off the attackers for as long as you can</em></strong></p><p><strong>How to play:</strong></p>\n<p>Right or Left Click + drag to move (can be changed in settings)</p>\n<p>C, V to change background colour (kills some enemies)</p>\n<p>Q, W, E, R to use skills, mouse to aim</p>\n<p>Up and Down Arrow to change skills (only before use)</p>\n<p><strong>Objective:</strong> defend the home base from enemies, kill enemies by hitting them with the player or with skills. Change the background colour to take out enemies the same colour. </p>\n<p><strong>Enemies:</strong></p>\n<p>Square: Normal enemies, takes 1 hit to take out</p>\n<p>Speedy: Is faster, 1 hit to take out</p>\n<p>Uncoloured: Can't be killed by changing background colour</p>\n<p>Beefy: Larger, can tank 3 hits but is slower, deals more damage to base</p>\n<p>Spawned: Small, fast enemies that may or may not be spawned by a Spawner. Will die when parent is killed (note: it can spawn by itself, don't count on it dying when you kill a Spawner)</p>\n<p>Spawner: Spawns Spawned at regular intervals, all Spawned spawned by it dies when it is killed. Can tank 2 shots</p>\n<p>Invisible: Is actually not invisible, just disguises itself as the background colour, can't be killed by changing the background colour, deals more damage to base</p>\n<p>Boss: Big, slow, and can't be killed by changing the background colour. Has lots of health, deals lots of damage to base</p>\n<p><strong>Skills: </strong>Set your skills by using the up and down arrow keys. Using a skill locks it from being changed.</p>\n<p>Hard Headed: any enemies that come in contact with the player takes damage</p>\n<p>Piercing Shot: shoots a piercing bullet that pierces through enemies</p>\n<p>Shell: shoots a explosive shell that detonates upon reaching the enemy or reaching the mouse</p>\n<p>Wall: when moving, leaves behind a wall that destroys enemies, lasts for 10 seconds</p>\n<p>Freeze: freezes enemies for 5 seconds, attacks deal 1 additional damage to frozen enemies</p>\n<p>Absorb: deploys a small circle around the home base to turn close enemies to health</p>", "metacritic": null, "released": "2021-06-21", "tba": false, "updated": "2021-06-25T11:43:40", "background_image": "https://media.rawg.io/media/screenshots/2e7/2e76957facd5b57fb920544e08712d50.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 15, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["TaterTime"], "genres": ["Action"], "publishers": [], "esrb_rating": null}