{"id": 627524, "slug": "blaster-master-zero-3", "name": "Blaster Master Zero 3", "name_original": "Blaster Master Zero 3", "description": "<p>The Pinnacle of Mutant Blasting Action Is Here!</p>\n<p>In Blaster Master Zero 3, it&#39;s time to hop aboard the all-terrain battle tank G-SOPHIA SV and explore the world around you in sideview mode, then travel into the depths of numerous dungeons on foot in top-down mode as the series protagonist Jason! With a host of new abilities and weapons in your arsenal, Blaster Master Zero 3&#39;s hybrid of side-scrolling and top-down action is more intense than ever before!</p>\n<p>Blaster Master Zero 3 brings Jason back to where the series all began, the planet Sophia, in order to save series heroine Eve in this final installment of the BMZ trilogy.</p>\n<ul>\n<li>The finale of the &quot;Jason Saga&quot; is here!  </li>\n</ul>\n<p>From the depths of planet Earth, to outer space, and now beyond dimensional rifts, this charming intergalactic story comes to its epic conclusion!</p>\n<ul>\n<li>&quot;Reverse&quot; the situation with the VRV system to forge a new path forward!  </li>\n</ul>\n<p>Jason now has the power to cross over dimensions!<br />\nWith the new &quot;VRV system,&quot; venture into super-dimensional space and conquer tricky areas using the power of &quot;reversal&quot; as your guide.</p>", "metacritic": null, "released": "2021-07-29", "tba": false, "updated": "2021-07-30T03:39:33", "background_image": "https://media.rawg.io/media/screenshots/d80/d806e0fdfb46687e177e742a7568fa31.jpg", "website": "http://blastermaster-zero.com/en/zero3/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 30, "beaten": 1, "toplay": 4, "dropped": 1, "playing": 1}, "playtime": 2, "achievements_count": 10, "ratings_count": 2, "suggestions_count": 455, "game_series_count": 9, "reviews_count": 2, "platforms": ["PlayStation 4", "Nintendo Switch", "Xbox One", "PC"], "developers": ["Inti Creates"], "genres": ["Action", "Adventure", "Indie", "Platformer"], "publishers": ["Inti Creates"], "esrb_rating": null}