{"id": 627549, "slug": "space-station-sprint", "name": "Space Station Sprint", "name_original": "Space Station Sprint", "description": "Infiltrate each space station and complete your objective before your escape ship is spotted by the enemy. Sprint your way to find the quickest path to the objective and Space Jump back to your escape ship. Use your slide, grenade, shockwave, and slow motion abilities to increase your chance to survive. Find permanent upgrades, time bonuses, collectibles, and secrets throughout each space station. <br/><br/><h3>FAST PACED FPS ACTION</h3>You need to keep moving, keep shooting, and keep exploring if you are going to be complete each level before your escape ship is spotted!<br/><br/><h3>ABILITIES</h3>Slide to dodge enemy projectiles and use slow motion to line up your best shot. Launch your grenade or get up close and personal and use your Shockwave to send enemies flying.<br/><br/><br/><h3>PERMANENT UPGRADES AND SECRETS</h3>Explore each level to find permanent upgrades for weapon, health, abilities, and your SPRINT speed! Find secondary objectives in every level to gain time bonuses to help explore all areas of every level!<br/><br/><br/>Your tiny home planet intercepted communications of an unknown alien species and learned of their plans to invade your planet. Volt must discretely travel the galaxy to the scattered enemy space stations to gather intel and sabotage the enemy plans while your home planet is preparing themselves to defend against this hostile alien species. Enter each space station and complete your objective before your escape ship is detected by the enemy.<br/><br/>", "metacritic": null, "released": "2021-08-27", "tba": false, "updated": "2021-07-30T04:22:47", "background_image": "https://media.rawg.io/media/screenshots/5f3/5f3469d8a5cd3d6e714fdac21f911f9c.jpg", "website": "http://www.snowdaysoftware.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 3, "toplay": 1}, "playtime": 0, "achievements_count": 24, "ratings_count": 0, "suggestions_count": 216, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Xbox One"], "developers": ["Snow Day Software"], "genres": ["Action", "RPG", "Indie"], "publishers": ["Snow Day Software"], "esrb_rating": null}