{"id": 627579, "slug": "abducted-the-night-hunters", "name": "Abducted: The Night Hunters", "name_original": "Abducted: The Night Hunters", "description": "Nobody know when it started, people began to disappear all arround the country, it escalated quickly to cases of mass disappearances around the entire world. Communications started to fail and so did our leaders, it was over before we knew it. <br/><br/>As far as you know everyone has been abducted, every night you can hear them getting closer to you, deep down you know that your time has come.<br/>Do your best to stay away from them, don't let them get you!<br/><br/>Game Features:<br/><br/><ul><li>Open world, you are free to travel the world and to discover its secrets at your own pace.<br/></li><li>Foo Fighters, UFOs and Grays will come to get you during the night, the game will get harder as the night goes on.<br/></li><li>Day / Night cycle (Survive at night and rest while the sun is up).<br/></li><li>Inventory System.<br/></li><li>Thirst, Hunger and sleep system.<br/></li><li>Sleep on beds to rest but be careful as you won't be safe and time will run faster.<br/></li><li>Scavenge for items to increase your chances of survival.<br/></li><li>Collect files and read them to learn about the events that are taking place in game.<br/></li><li>Get some gas, a vehicle and drive for your life!.</li></ul><br/><br/><br/>Your survival will take place at the Howling Mountains National Park and its surroundings.<br/>Abandoned by its park rangers now its a place where survivors hide to avoid being abducted.<br/>The park is filled with interesting places to discover and hide from the aliens.<br/><br/>", "metacritic": null, "released": "2021-06-30", "tba": false, "updated": "2021-07-02T03:02:58", "background_image": "https://media.rawg.io/media/screenshots/63b/63b9b752bb788a3619f9780e4b2df778.jpg", "website": "https://abductedgame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 259, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": [".Cat"], "genres": ["Action", "Simulation", "Indie"], "publishers": [".Cat"], "esrb_rating": null}