{"id": 627566, "slug": "eiyusenki-gold-a-new-conquest", "name": "Eiyu*Senki Gold – A New Conquest", "name_original": "Eiyu*Senki Gold – A New Conquest", "description": "<h3>Story</h3>In the ancient far Eastern country of Zipang, a storm is brewing. The country enjoys a period of peace and its unique culture flourishes thanks to the isolationism imposed by the great Ancient Hero, Yamato Takeru. But the heart of one lone hero, Masamune Date, burns with the fire of ambition in this seemingly content land. After coming across an young man, void of all his memories, on the shores of Zipang, she puts her plans in motion to challenge to Takeru. Should they succeed, they will force open the country's borders and begin an epic adventure filled with exotic lands, fierce battles, and new conquests!<h3>Features</h3><br/><ul><li>An epic journey that jumps to the screen in colorful 2D – beautifully drawn by acclaimed artist Ashito Oyari, immersing you into the fun fantasy world of Eiyu*Senki.<br/></li><li>Over 70 recruitable characters, each with unique powers and abilities, to add to your army. Use them well and claim victory.<br/></li><li>Turn-based strategic combat playing to the strengths of your allies while covering their weaknesses. With each new conquest, the battles intensify and enemy tactics evolve.<br/></li><li>Embark on side quests to shore up the loyalty of your heroes, unlocking new abilities and even romance.<br/></li><li>Over 150 unique craftable items, enlisting the aid of the fusion blacksmith.<br/></li><li>New game plus mode that boosts your experience with unique bonuses acquired through each playthrough.</li></ul><br/><strong>This is the newest game in the Eiyu*Senki universe, bringing back familiar faces and introducing new characters!</strong>", "metacritic": null, "released": "2021-06-25", "tba": false, "updated": "2023-10-14T16:31:44", "background_image": "https://media.rawg.io/media/screenshots/fc2/fc21743790b19c4fa5ffc3d6f4032fdf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 14, "toplay": 1, "dropped": 1, "playing": 1}, "playtime": 6, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 445, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Tenco"], "genres": ["Adventure", "RPG", "Strategy"], "publishers": ["Kagura Games", "JAST USA"], "esrb_rating": null}