{"id": 627593, "slug": "ambardia", "name": "Ambardia", "name_original": "Ambardia", "description": "Long ago, an adventurer named Ambard made a shocking discovery about his world: it was being devoured by an entity of chaos and destruction! Armed with the ability to create by the agents of order, Ambard slowly re-introduced magic and learning back into the world, and he and his descendants began to rebuild the world of Ambardia. Come, adventurer! Come and be a part of the creation of a world! Come and live, fight, and reap rewards in a realm ruled by imagination! The denizens of Ambardia await you.<br/><br/><br/><br/><br/><br/>Players can use the extensive storyline, world mythology, and quest-driven gameplay as tools to help determine a destiny for their characters. The game graphics are based on tilesets from the Golden Age of MMORPGs, and an original soundtrack accompanies players on their adventures, providing a classic ambience as they explore everything the world has to offer.<br/><br/><br/><br/><br/><br/>A nonlinear skill system with numerous options allows players to tailor their characters towards a host of activities and professions. The player arena offers opportunities for both competitive and cooperative play, with regular events and rewards for participating. PvP opportunities abound, both in the arena and in designated game areas throughout the lands. Feeling lonely? Join a guild and join forces with friends to adventure together and customize your guild hall. Not ready for commitment? Party up with players temporarily to share loot, experience, and defeat difficult maps and bosses more easily.<br/><br/><br/><br/><br/><br/>Ambardia has been in development since 2006 and has seen several engines, iterations, and versions. Originally hosted in Ambard’s home on a relatively low spec PC, the game eventually attracted a small but dedicated group of players and developers. Today the collective imagination of the dev team is finally being realized with an updated engine and the opportunity to develop the vision of Ambardia better than ever before!<br/><br/><br/><br/><br/><br/>Since its conception, Ambardia has relied on its community of dedicated players for feedback. One of our players is even on our development team today! Join our community, get involved, and be a part of the continuing story of Ambardia. Live the adventure!<br/><br/><br/><br/><br/><br/>Continuous development of new maps, quests, player areas, and other game content will ensure regular expansion releases for a long time to come. There will always be a new adventure right around the corner.", "metacritic": null, "released": null, "tba": false, "updated": "2021-07-02T03:15:16", "background_image": "https://media.rawg.io/media/screenshots/37e/37e7f70c03d2883d42472ebfcd17e0a6.jpg", "website": "https://www.ambardia.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 446, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Ambardia Productions"], "genres": ["Action", "Adventure", "RPG", "Massively Multiplayer"], "publishers": ["Ambardia Productions"], "esrb_rating": null}