{"id": 627526, "slug": "horror-tales-the-wine", "name": "HORROR TALES: The Wine", "name_original": "HORROR TALES: The Wine", "description": "<p>WARNING: Certain effects that may potentially trigger seizures for people with photosensitive epilepsy can be disabled in the Accessibility Menu included in the game.</p>\n<p>Mediterranean Horror: Explore the forsaken capital of an awe-inspiring archipelago. Do not let yourself be fooled by the gentle sea breeze, the Mediterranean vistas or the comforting summer sun. Since the Devil&#39;s Fevers pandemic ravaged the city, it was abandoned, and now only horrific nightmares await there.</p>\n<p>Survive your Nemesis: Someone is relentlessly hunting you. Suffer and agonize while you try to run away from the encounters with this strange stalker obsessed with you.</p>\n<p>Intense Challenges: Solve environmental riddles, physics puzzles and other similar challenges in an interconnected vertical world. Even while being chased and hunted.</p>\n<p>Accessibility and Photomode: Tweak more than 20 Accessibility settings to create a tailored experience for you. Use the Photomode to make perfect shots and unlock many secrets using it.</p>\n<p>A pandemic which causes strong fevers, terrible delirium and death has relentlessly decimated the inhabitants of the archipelago. Rumor has it that a prestigious red wine produced in the capital can cure the sick.</p>\n<p>You are Martí Vermelló. In a desperate attempt to cure the infection of your loved ones, you steal a boat and head to the winery where the red wine is made, somewhere in the capital.<br />\nIf you find just one unopened bottle of red wine it will be enough.</p>\n<p>On reaching the island you decide to go to the winery owners&#39; estate to try your luck there. The Banydebosc family estate is close and has a dock.</p>\n<p>A cold smell of death, calm and silence comes over your body when you arrive at the dock. They sealed off the infected families in their own homes without food or water but even then the quarantine didn&#39;t work.</p>\n<p>There is no one left alive…</p>\n<p>…so it seems.</p>", "metacritic": null, "released": "2021-07-30", "tba": false, "updated": "2023-11-19T12:54:34", "background_image": "https://media.rawg.io/media/screenshots/c9d/c9d5517e5b058a4859d4c892829dd4ee.jpg", "website": "", "rating": 3.08, "rating_top": 3, "added_by_status": {"yet": 5, "owned": 53, "beaten": 9, "toplay": 7, "dropped": 4}, "playtime": 4, "achievements_count": 86, "ratings_count": 12, "suggestions_count": 321, "game_series_count": 0, "reviews_count": 13, "platforms": ["PC", "Xbox One"], "developers": ["Carlos Coronado"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Carlos Coronado"], "esrb_rating": null}