{"id": 627584, "slug": "girls-lovecast-prologue", "name": "Girl's Lovecast - Prologue", "name_original": "Girl's Lovecast - Prologue", "description": "Girl's Lovecast - Prologue is a free standalone version of the game 'Girl's Lovecast,' a game in which girls try their best and defeat darkness. It is a 2D, top-down action-adventure RPG.<br/><br/>In this game, you explore an abandoned hotel and a casino in order to exorcise demons and extinguish darkness. Some of the features of Girl's Lovecast - Prologue include:<br/><br/>- Fast and flashy real-time combat<br/>- Exploration<br/>- Branching dialogue decisions<br/>- 4 boss fights<br/>- Optional Side Quests<br/>- Roughly 2+ hours of content<br/><br/><br/><br/>In this game, you control Magical Girls and use their various powers to fight demons, criminals, and other types of villains. It uses a fast and flashy real-time combat system. The core of this combat system is the idea that the player should have a lot of different powers and abilities to use in battle, and the ability to move really fast in order to maneuver around enemies and dodge their attacks.<br/><br/>Each character has a standard attack that the player will use for most of the time by using the \"attack\" button. The type of attack varies from character to character. Each character also has the ability to dodge by pressing the \"dodge\" button. While dodging, the character will be thrust into the direction she is currently facing, and she will be invincible for that brief period of time that she is dodging. Additionally, each character has the ability to use something called \"focus mode,\" where the player can hold down the \"focus\" key to move slower and more accurately. This helps with aiming and dodging elaborate enemy attack patterns.<br/><br/>Each character also has a unique set of spells and abilities, ranging from healing and defensive abilities, to special attacks and debuffs.<br/><br/><br/><br/>Finally, each character has a unique set of ultimate moves, referred to as Lovecasts. Lovecasts can be used by filling up a character's Lovecast Gauge, which is done by dealing damage, taking damage, and defeating enemies.", "metacritic": null, "released": "2021-07-01", "tba": false, "updated": "2021-07-02T03:08:14", "background_image": "https://media.rawg.io/media/screenshots/857/857b2d8b77d3d70566ca1713d4758043.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 257, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["mikamiga"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["MIKAMIGA STUDIOS"], "esrb_rating": null}