{"id": 627601, "slug": "overlord-rpg-online-battle", "name": "Overlord - RPG Online Battle", "name_original": "Overlord - RPG Online Battle", "description": "Enjoy awesome Real-time Multiplayer Battles PVP. Use your excellent skills to kill other players to become survival and winner.<br/>\n<br/>\r\nOverlord: Fantasy Battle Royale is a real-time battle online game. Allow 10 players in the battle, with many modes and awesome features, Overlord is the best real-time PVP game experience on mobile!<br/>\n<br/>\r\nPlayers can craft unlimited equipment with different styles, can customize your character's appearance as you want, and many more features are waiting for you to explore.<br/>\n<br/>\r\nREAL-TIME COMBAT BATTLE<br/>\r\nA stable game online multiplayer, you can immerse yourself in online fierce battles, fight with players around the world with no lag, and smoothly from any country on the world.<br/>\r\nChallenge your skills against other players in real-time multiplayer action-packed tactical PvP combat<br/>\n<br/>\r\nMANY GAME MODES AND MAPS<br/>\r\nSolo, Survival, Deathmatch...<br/>\r\nEach mode will have different gameplay, which will make you have different experiences and improve your skills.<br/>\n<br/>\r\nAWESOME SKILLS<br/>\r\nThere are many skills to you can use to fight against other players. Tactics using your skills will greatly affect combat. Play hard and you will learn how to control these skills.<br/>\n<br/>\r\nDIVERSE EQUIPMENT<br/>\r\nThere are tons of equipment you can craft and upgrade.<br/>\r\nSword, Bow, Wand, Armor, Helmet, Shoulder, Glove, Boot, Cloak, Accessories…each equipment has many different styles. So you can customize your character as you want and become unique.<br/>\n<br/>\r\nAMAZING PET SYSTEM<br/>\r\nYou will have companionship in battles, it's your Pet.<br/>\r\nPet can help you stronger and join battle with you to fight against these other players.<br/>\r\nEach Pet has a different ability and stats. Try to get unlock more pets and upgrade them to stronger.<br/>\n<br/>\r\nDIVERSE GEMSTONE SYSTEM<br/>\r\nThis is one of the most important to make you stronger. Many Gemstones are waiting for you to unlock and upgrade.", "metacritic": null, "released": "2021-07-01", "tba": false, "updated": "2021-07-02T03:20:47", "background_image": "https://media.rawg.io/media/screenshots/c2a/c2ac1c00a7502b8aa694b3acacae1ae8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 284, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["NexC Games"], "genres": ["Action", "Adventure", "RPG"], "publishers": ["NexC Games"], "esrb_rating": null}