{"id": 62768, "slug": "space-fighters", "name": "Space Fighters", "name_original": "Space Fighters", "description": "Three gamemodes to choose from<ul><li> <strong>King of The Hill</strong> - Work together with your team to capture floating control devices and gain points for your team to win the game.<br/></li><li> <strong>Team Deathmatch</strong> - The simple and classic gamemode that pins teams against each other. Fly around, dogfight, and gain team points by killing enemy ships.<br/></li><li> <strong>Free for All</strong> - Everyone is fair game. Shoot anything that moves and be the first to get the designated amount of kills needed to win the game.</li></ul><br/>Action packed, fast-paced, quick 10-15 minutes rounds of maneuvering and shooting are just the start of the entertaining gameplay!<ul><li> Player-made lobbies, so that players could play with their fellow spaceship pilots. Players looking for a quick game can also join an already-made random suitable lobby. Lobby options allow for each player in their own gameplay style or preference.<br/></li><li> Each round consists of 2-8 players with 8 different teams to choose from for a variety of teams facing off each other.<br/></li><li> A pleasant and fitting soundtrack and even more to explore.</li></ul><br/>If multiplayer is not your cup of tea, there is also singleplayer! Play against swarms of enemy AI and survive for as long as possible!", "metacritic": null, "released": "2018-04-02", "tba": false, "updated": "2019-08-23T12:11:42", "background_image": "https://media.rawg.io/media/screenshots/581/581f6da1bbc49fac0e0abfaff5892313.jpg", "website": "http://spacefighters.zerobyter.net/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 191, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ZeroByter"], "genres": ["Action", "Indie"], "publishers": ["ZeroByter Games"], "esrb_rating": null}