{"id": 627681, "slug": "basketball-legends-tycoon", "name": "Basketball Legends Tycoon", "name_original": "Basketball Legends Tycoon", "description": "Build a team of the best basketball players, upgrade their skills and abilities, and shoot the basketball!<br/><br/>Collect cards to unlock new star basketball players. Hire a manager to help you run your team. Cheerleaders, mascots and DJ’s are here to boost your basketball players. Unlock different courts in this free tapping idle sports manager game. Become a tycoon and be the best sports manager.<br/><br/>FEATURES OF THIS GREAT IDLE CLICKER GAME<br/><br/>Best Basketball Players and Legends<br/>Legendary star basketball players; collect all 60 basketball players. They come in four different classes; common, rare, epic and legendary. Collect their cards and increase their stars with upgrades. All your favorite players are here, ready to play for your team!<br/><br/>Boosters<br/>Can’t imagine a good basketball game without a cheerleader,  a mascot to boost and a partying DJ. Use boosters to increase your earnings and proceed faster.<br/>And without a trainer who would make them shoot?<br/>But be careful! They come in different classes and all have specific powers!<br/><br/>Courts<br/>Whether it’s on a street in the middle of New York or deep in the Grand Canyon. Maybe you prefer a sunny day at Venice Beach! Or want to buy yourself an Arena. You better upgrade your floor, hoops and seats to speed up your progress. <br/>You will love all the courts and won’t want to miss a second to unlock all of them. Of course more will come!<br/><br/>Dunks<br/>Who doesn’t love a slam dunk? Whether you play street basketball or play in the courts you gotta dunk! Thanks to slam dunks such as tomahawk, windmill, double clutch and tens of others, you will multiply your earnings easily. <br/><br/>Offline Earnings<br/>Basketball legends tycoon is a free idle game! This means you will keep earning and progressing even when you are offline. And you can hire a manager to keep earning for longer when you are away. <br/><br/>Legendary  basketball players from around the world, street basketball style slam dunks, lovely cheerleaders, crazy mascots and DJ’s, unexpected trainers are waiting for you! Lead your team of basketball players through fame and glory to live the street basketball life! Download this IDLE basketball managing clicker game for free and start your tycoon journey to the top!<br/><br/>ATTENTION! Basketball Legends Tycoon - Idle Sports Manager game can be downloaded for free.", "metacritic": null, "released": "2021-06-17", "tba": false, "updated": "2021-07-02T04:22:04", "background_image": "https://media.rawg.io/media/screenshots/988/9889d70374ff8ad14e311af9c63feacc.jpg", "website": "https://www.tiramisu.game", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 147, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tiramisu Studios"], "genres": ["Sports", "Casual"], "publishers": ["TIRAMISU STUDIOS YAZILIM HIZMETLERI LIMITED SIRKETI"], "esrb_rating": "Everyone 10+"}