{"id": 627626, "slug": "death-realm", "name": "Death Realm", "name_original": "Death Realm", "description": "<strong>The Story</strong><br/>Death Realm is a brand new action - adventure RPG brought to you by PEPOLA . Death Realm has a Gothic Dark Fantasy, dungeon crawling universe. Where you face tough and fearsome foes throughout your journey. Get ready to experience a Journey of Despair; of a Knight, who once was known as a force to be reckoned with, now reclaiming his power who will face the strongest elite demons from the Abyss and The Underworld who were born to destroy; The King of Flames, The Gatekeepers and Dragons of the underworld and many more!<br/><br/>Death Realm is a game which highly focuses on player's skills. You shall visualize and execute, Learn from your mistakes and remember that everything in this world is trying to kill you. <br/><br/><br/><strong>Key Features</strong> <br/>- Extreme Difficulty: Death Realm is challenging and unforgiving but its always going to be a fair fight. Follow the enemies' way of fighting and strategize to sabotage.<br/><br/>- Progression: You will be offered multiple paths to progress, it will be choice - based which means the game's consequences depends on the choices you make and the routes you take.<br/><br/>- Combat: Players will be able to choose between a variety of weapons ranging from swords, daggers, maces to powerful elemental magic.", "metacritic": null, "released": "2021-07-31", "tba": false, "updated": "2021-07-02T03:40:17", "background_image": "https://media.rawg.io/media/screenshots/bdf/bdf8807a2cfd26b68398fc6e38e5210c.jpg", "website": "https://deathrealm.shop/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 272, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["PEPOLA INDIA Pvt"], "genres": ["Action", "Adventure", "RPG"], "publishers": ["PEPOLA INDIA Pvt"], "esrb_rating": null}