{"id": 627638, "slug": "tour-de-france-2021-xbox-series-xs", "name": "Tour de France 2021 Xbox Series X|S", "name_original": "Tour de France 2021 Xbox Series X|S", "description": "Xbox Series X|S version of Tour de France 2021  NOT playable on Xbox One.<br/><br/>New features:\r\n-All 21 stages of the 2021 route faithfully reproduced\r\n- A redesigned My Tour mode with more customisation options\r\n- More realistic peloton behaviour\r\n- Revamped objective system \r\n- A new recovery mechanic \r\n- Official brands (Lazer, Specialized, Vision, Rudy project, Corima, HJC, Canyon, POC, Merida)\r\n- Updated database (riders, ratings)<br/><br/>Play as your own rider or manage your team\r\nIn Pro Team mode you lead a team that must prove itself to reach the top of the Pro Cycling team rankings. Your team starts at the bottom, but you may be invited to take part in the major races if the organisers see that your results are good enough. \r\nYou can create and gradually level up your own rider in Pro Leader mode as you strive to become the next cycling legend to compete with the likes of Primoz Roglic, Tedej Pogacar and others. You can choose from four different profiles: climber, sprinter, puncher and versatile. Your choice will be crucial if your aim is to win a Grand Tour or be a specialist in the Classics!<br/><br/>Create your own Tour\r\nMy Tour mode has been redesigned to offer you more freedom. With the new interface it is now easier to customise your \"My Tour\" (rest days, stages, teams). You can now choose the list of participating teams and national teams. Choose from 89 stages to create your race. <br/><br/>Enjoy a wide range of content<br/><br/>The game includes the 19 World Tour teams and their jerseys as well as the teams Alpecin-Fenix, B&amp;B Hotels P/B KTM, Team Arkéa - Samsic and Total Direct Energie. There are also many official races (Paris-Roubaix, Paris-Nice, LBL, etc.) <br/><br/>More realistic peloton\r\nWe have redesigned the actions of riders in the peloton to recreate the behaviour found in real races:\r\n-Favourites ride closer to each other\r\n- The yellow jersey is better placed at the front of the peloton\r\n-Pursuit of the early breakaway is more realistic with fewer teams getting involved, which gives the leader's team the upper hand, just like in real life\r\n- Teams that want to catch the breakaway but don't attack or that reduce the peloton in the race on the flat now have consistent behaviour<br/><br/>Revamped objectives<br/><br/>Before the start of each stage, you can now set the objective for each rider thanks to a new \"Select Rider\" page, which includes all the information you need to make a choice (ranking, role, race-day condition). Your choice obviously influences the behaviour and decisions of riders during the race. <br/><br/>A new recovery mechanic\r\nOur aim is to offer better visibility of change in condition and to give more importance to riders that recover well in the Grand Tours. \r\nRecovery between stages and races is crucial for the success of your riders. In Tour de France 2021 , we have developed a recovery profile based on the recovery rating. The lower the rating, the more the recovery profile penalises the race-day condition.", "metacritic": null, "released": "2021-07-01", "tba": false, "updated": "2021-07-02T03:52:00", "background_image": "https://media.rawg.io/media/screenshots/fee/fee6755e48c5f02e412cc70cef225de0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 303, "game_series_count": 0, "reviews_count": 0, "platforms": ["Xbox One"], "developers": [], "genres": [], "publishers": [], "esrb_rating": null}