{"id": 627671, "slug": "runestrike-ccg", "name": "Runestrike CCG", "name_original": "Runestrike CCG", "description": "Enter the world of Runestrike, where mortal Champions battle to master powerful runes and overthrow ancient gods. Runestrike is an online turn-based strategy game that offers brisk play and deep strategy built on straight-forward mechanics. Download today to build decks, level your Champions, and enjoy both challenging single-player content and pvp.<br/><br/>BEAUTIFUL ART<br/>Build your collection with beautifully drawn runes, whether it’s a common Hammerfist Giant or the legendary Jupiter himself. Stunning Champions and a gorgeous world map make Runestrike a visual treat you can indulge in.<br/><br/>COMPELLING STORY<br/>As ancient gods engage in a titanic clash, the veil separating mortal from immortal tears open, and runes rain from the heavens. The world is infused with magic, wild beasts become fantastic monstrosities, and powerful Champions arise among mortals. Ascend your Champions to godhood as they learn to harness the runes once held by the gods.<br/><br/>ENGAGING PVE CONTENT<br/>Explore the world of Runestrike in rewarding single-player campaigns. Overcome Jupiter in the Trials of Olympus. Survive the perils of ancient Egypt in the Eye of Ra.<br/><br/>SOLO AND VERSUS ARENA<br/>Battle other players for weekly rewards in the Versus Arena. Play against the AI in the Solo Arena where you pit your Champions against others; the more you win, the more rewards you gain.<br/><br/>UNIQUE CHAMPIONS<br/>Collect unique Champions who engage in every battle, attacking their foes through direct combat and with powerful divine abilities. Ascend your Champion to unlock new powers and earn rewards.<br/><br/>With over a dozen Champions and hundreds of runes, players will find countless strategies. Download Runestrike today and enter a living world where new content is regularly released, player feedback is welcomed, and the battles never stop.<br/><br/>-Visit www.runestrike.com to learn more.<br/>-Join the Runestrike community on Discord. https://discord.gg/RqrJpUX<br/>-Visit our Facebook page. https://www.facebook.com/RunestrikeGame/<br/>-Meet other players on the Runestrike forum. http://forum.makingfun.com/forum/runestrike/<br/>- Follow us on Twitter: https://twitter.com/runestrike", "metacritic": null, "released": "2021-06-11", "tba": false, "updated": "2022-11-03T18:53:40", "background_image": "https://media.rawg.io/media/screenshots/c06/c0616bb3c54bc61914391310c6300acb_KwWi8wp.jpg", "website": "https://www.runestrike.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 302, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Making Fun"], "genres": ["Strategy", "Card"], "publishers": ["Making Fun"], "esrb_rating": "Teen"}