{"id": 627717, "slug": "awesome-shape-puzzles-123", "name": "Awesome Shape Puzzles 123", "name_original": "Awesome Shape Puzzles 123", "description": "- Let learning become your children's favourite pastime with this fun shape puzzle game that doubles as a picture dictionary featuring more than 150 new words!<br/>- Multiple play modes to choose from, including a basic shape-fitting mode, an easy mode with 2-4 piece puzzles and a hard mode with 7-10 piece puzzles. <br/>- Play Awesome Shape Puzzles 123 in more languages! Have fun learning new words in different languages including: English, French, Spanish, Japanese, German, Swedish, Russian, Dutch, Portuguese, Norwegian, Danish, Korean, Chinese and Italian. <br/><br/>Discover an enjoyable way of learning first words with this originally illustrated shape puzzle created especially for young minds aged 1 to 6. Children will have a blast playing with dancing dolphins, flying airplanes, roaring dinosaurs and more, all the while developing problem solving and shape, pattern, and color recognition skills.<br/><br/>Choose from 12 different categories of everyday words (including numbers and letters) and for each object, drag the scrambled puzzle pieces to their right place to complete the picture. Once completed, the object's name will be spelled onscreen and read aloud. For each successfully completed puzzle, the player will be rewarded with a new sticker to add to his/her collection!<br/><br/>Accompanied by a friendly voice guidance, children are encouraged to play and learn at their own pace. Multiple play modes allow even the youngest mind to learn and explore with a basic shape-fitting mode, an easy puzzle mode, and a hard puzzle mode for the bigger kids.<br/><br/>Awesome Shape Puzzles 123 is the latest all new educational app to join the much-loved Jigsaw Puzzles 123 family which has been among the best-selling kids' games all over the world and has been featured by Apple's App Store.<br/><br/>Features:<br/>- Child-friendly interface specifically designed for small fingers<br/>- More than 150 puzzles to solve and new words to learn<br/>- Multiple game modes: ‘single piece’ (whole objects), ‘easy puzzle’ (2-4 piece) and ‘hard puzzle’ (7-10 piece)<br/>- Balloon Pop! Pop as many balloons as you can! A fun little reward for finished puzzles<br/>- Bonus sticker book fun<br/>- A Demo Button that enables auto-fill for optional assistance <br/>- Helpful voice guidance<br/>- Beautifully illustrated original cartoons<br/>- Cheery background music track that can be easily switched on or off<br/>- For iPhone, iPod Touch and iPad<br/><br/>Categories featured in Awesome Shape Puzzles 123 include:<br/>+ My First Shapes – Squares, circles, triangles, pentagons, and more.<br/>+ Dinoland – All your child's favourite dinosaurs!<br/>+ Fruity Fun – Apple, strawberry, pear and all their yummy friends.<br/>+ Veggie Party – Let's not forget the veggies! Pumpkin, peas, carrots and more.<br/>+ Toy Wonderland – All our beloved childhood friends. Teddy bear, robot, doll, and more. <br/>+ Busy Wheels – Helicopters, motorcycles and other cool vehicles. <br/>+ Ocean Adventure – The exciting world under the sea and all its amazing creatures. <br/>+ Band Jam! - Learn all the musical instruments.<br/>+ Silly Billy Farm – Old farmer and all your farm animal friends!<br/>+ Playground Fun – Slides, merry-go-rounds, swings and more. <br/>+ My Alphabet Book – Featuring letters A to Z.<br/>+ Numbers and Me – Featuring numbers 1 to 20.<br/>+ ...more categories coming in free future updates!<br/><br/>Endless fun and learning to be enjoyed all for the price of one. <br/><br/>Or, try our bite-sized version for FREE!<br/>Simply search for Awesome Shape Puzzles 123 FREE in the App Store.<br/><br/>--------------<br/><br/>Connect with us!<br/><br/>Visit us: http://www.GiggleUp.com<br/>Like us: facebook.com/GiggleUpApps<br/>Follow us: twitter.com/GiggleUpApps<br/>Email us: Support@GiggleUp.com<br/><br/>Brought to you by GiggleUp, creators of the award-winning Interactive Telling Time and other educational apps for kids. Our goal is to promote learning through play with the purpose of helping children develop useful learning skills. Our apps have been enjoyed by children and used in classrooms all around the world!", "metacritic": null, "released": "2012-03-22", "tba": false, "updated": "2021-07-02T04:39:42", "background_image": "https://media.rawg.io/media/screenshots/ecd/ecda378d78a5d6927c48f826cad5784c.jpg", "website": "http://www.giggleup.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 116, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["GiggleUp Kids Apps And Educational Games"], "genres": ["Educational", "Puzzle"], "publishers": ["GiggleUp Kids Apps And Educational Games"], "esrb_rating": "Everyone 10+"}