{"id": 627703, "slug": "basketrio-back-in-the-game", "name": "Basketrio: Back in the Game", "name_original": "Basketrio: Back in the Game", "description": "Pre-Order now to claim the \"IBM Outfit\"(7D) on launch! Stay tuned and remember to visit the official page for more freebies! Remember to join our Facebook: https://www.facebook.com/jj.basketrio.na<br/><br/><br/><br/><br/>[My Style, my rules!]<br/>Built on motion capture technology, Basketrio is a next-gen basketball mobile game that challenges both your skills and imagination. Equip your player with unique sneakers, outfits and your own customized moves. Take your build to the streets around the world with real-time, skill-centric 3v3 games. Embrace the grind, showcase your style and become a streetball legend.<br/><br/><br/><br/>[Real-time Competitive Matches]<br/>Easy to play, hard to master! Basketrio brings in classic 3 on 3 half court basketball matches at a fast gaming pace. Three minutes per match, 100% skill-centric, perfect for showing off your unique style! Lone wolf? Go duel in a 1 on 1 match and become legendary.<br/><br/><br/><br/>[Train your Future Star]<br/>Basketrio gives you the most freedom in customizing your character! Sign contracts with a diverse cast of players in Basketrio, each with their own unique characteristics, talents, and abilities. Train them however best fits your playstyle. Receive massive rewards as you achieve various training goals!<br/><br/><br/><br/>[Flashy Moves and Emotes]<br/>Create your very own wombo-combos and trick your opponents with our exclusive Drive-Assist System. Equip special “tricks” to perform majestic animations as you dunk, lay-up, or shoot a three pointer! Then taunt your opponents with your favorite emotes as you score!<br/><br/><br/><br/>[Head-to-toe Customize Options]<br/>Hundreds of costumes and accessories are there for you to choose from, giving your avatar a new look every game! Street wear, exotic, cosplay, steam-punk, futuristic sci-fi… All styles are covered. Collect new outfits and show off your style! We consistently add new outfits, making sure that the game keeps up with new trends.<br/><br/><br/><br/><br/><br/><br/><br/>Facebook: https://www.facebook.com/jj.basketrio.na<br/>Discord: https://discord.gg/CfwZfrj", "metacritic": null, "released": "2021-06-28", "tba": false, "updated": "2021-07-02T04:32:36", "background_image": "https://media.rawg.io/media/screenshots/dad/dadb78a6a4b81154e72562f6f8142d02.jpg", "website": "https://www.facebook.com/jj.basketrio.na", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 317, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["ALL9FUN"], "genres": ["Action", "Sports"], "publishers": ["ALL9FUN"], "esrb_rating": "Everyone 10+"}