{"id": 627849, "slug": "time-bandit-prologue", "name": "Time Bandit – Prologue", "name_original": "Time Bandit – Prologue", "description": "A Game That Takes Time\r\n\r\n<p>Discover the unique real-time mechanics and anti-capitalist premise of Time Bandit in this <strong>Prologue Chapter</strong> in the style of a classic PS1 demo.<br/></p>\n\n<p><em>\n</em></p>\n<p>\n</p>\n<p>A dark life sim that unfolds slowly in real time, with an unusual combination of elements from idle, stealth, and puzzle genres.       Make your choices carefully, because everything you start will take   time to finish--just like in real life.</p>\n<p>Place down one of these   automated forklifts to push a box for you, for example, and it'll take   an actual half an hour to finish moving it: <br/></p>\n\n\n<p>You'll just have to go and do other stuff and come back later.\r\n </p>\n<p>You work as an independent contractor for a mining company, but soon  you discover they’re trying to take control of time in order to make you  work for them forever. Manage your money, fuel, and energy while slowly  solving puzzles to collect the time crystals and then pull off  high-stakes stealthy heists to steal back from your employer.</p>\n\n<p>Featuring tons of real-time game mechanics: <br/></p>\n<ul><li>Move boxes, grow trees, build bridges, and compact trash--and wait for them to finish.</li><li>A story  that unfolds slowly through conversations that work like  real-life  phone calls. Characters will only call you periodically to  advance the  story over the course of days and weeks of playtime.</li><li>Your energy meter goes down while you play, and it takes up to 8 real-time hours of good sleep to fill it up all the way.</li><li>Real-time dynamic music.<br/>\n</li><li>And much more.</li></ul>\r\nA Story of Political Intrigue\r\n<p>The prologue chapter of an epic, explicitly anti-capitalist melodrama, told through lowpoly cutscenes and radio conversations inspired by early cinematic games. The company's CEO and shareholders have come up with a scheme to live forever, but it will mean sacrificing the lives of their workers. Fight for a world where everyone has a right to their time.</p>\n<p>Use the realistic radio to call characters anytime for dialogue about whatever situation you're in. You'll find hints on what to do next, details that expand the story, fourth wall–breaking humor, and more.</p>\n<p>A challenge with real consequences: Don't get caught by guards or let yourself fall asleep, or you might end up stuck waiting it out in jail or the hospital.</p>\n<p>Fixed camera angles in gameplay, just like in the old days. With a real-time day-and-night cycle, to make the game integrate more with your life.<br/></p>\n\r\nJoin Time Bandit's community Discord\r\n\r\n \r\nWishlist on Steam<br/>\r\nPresskit", "metacritic": null, "released": "2021-07-01", "tba": false, "updated": "2021-07-02T05:21:50", "background_image": "https://media.rawg.io/media/screenshots/7ce/7ce35c5c0cdc8b2dcdd5d56dd5fd6959.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 296, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["phoenixup"], "genres": ["Adventure", "Simulation", "Puzzle"], "publishers": [], "esrb_rating": null}