{"id": 628091, "slug": "dingus-poker", "name": "Dingus Poker", "name_original": "Dingus Poker", "description": "<p><strong>EARLY WIP BUILD</strong></p>\n<p>Work in progress for a PS1 style inspired online poker game. Currently only the offline mode works which contains an early prototype of the poker game and logic. You play everyone's hand at the table, switching between whoever's go it is. Simulation of the poker logic itself is mainly done and some of the graphics are completed such as the cards. Polishing the poker game logic and adapting it into online play is next to be implemented.</p>\n<p>It is currently somewhat hard to see what's going on so it's recommended you use the debug console which prints every poker action by pressing <strong>L</strong> to toggle and <strong>up and down</strong> to scroll the menu.</p>\n<p><strong>PRESS SPACE WHEN IN THE POKER SCENE TO START A GAME</strong><br/></p>\n<p><strong>Controls</strong><br/></p>\n<ul><li>Navigate menus with mouse</li><li>L - Toggles Console (up and down arrows scroll console text)</li><li>Space - Starts new poker game if there is no poker game or current game is finished</li><li>Hold Left Click - In game this allows you to move the camera around, scroll while holding left click to zoom</li></ul>\n<p><strong>Known Issues</strong><br/></p>\n<ul><li>If everyone folds then the game crashes</li><li>Dealer/BB/SB buttons are unintelligible </li><li>Unable to back out of menu or quit without Alt+F4</li></ul>\n<p>All sprites, fonts and models were created by me.</p>", "metacritic": null, "released": "2021-06-30", "tba": false, "updated": "2021-07-02T06:28:28", "background_image": "https://media.rawg.io/media/screenshots/5e7/5e71980496d9096c030060bafe58e65c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 91, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["PublicStaticDylan"], "genres": [], "publishers": [], "esrb_rating": null}