{"id": 628034, "slug": "4-elements-itch-tbrooks3", "name": "4 Elements (itch) (tbrooks3)", "name_original": "4 Elements (itch) (tbrooks3)", "description": "<p>This is a simple first person game inspired by the theme 4 Elements. The goal is to traverse the map, discover the 4 different challenges to find the 4 different elements, and escape. If you get caught by the other characters, touch any fire, or drink the wrong drink the game restarts. I used to Blender to make the first person character and AI and used Unreal Marketplace assets to build the map and other models. </p>\n<p>Below I explain how I meet all of the requirements for my BSU Game Development class assignment. All requirements can also be seen if playing the game. </p>\n<p>1. Custom Modeled Mesh</p>\n<ul><li>I have an animated first person character and AI (walk, run, and idle)</li><li>The character has 11 bones</li><li>I used a Blend Space to make a smooth transition between the 3 animations dependent on speed of the character.</li></ul>\n<p>2. Polish</p>\n<ul><li>The game is very linear with checkpoints along the way to help guide the player. Everything fades in and out and is not sudden.</li><li>Menus and HUD animations fade in and out.</li><li>Although sometimes buggy with the AI, the character animations are all smooth, including the elements and platforms moving around.</li><li>I built the game using the same asset pack and attempted to make the other objects resemble that same style.</li><li>The asset pack came with great lighting and sound options that are also present.</li></ul>\n<p>3. Fun or enjoyment</p>\n<ul><li>The theme was 4 elements and all of the challenges somewhat resemble those elements and the goal is to collect all 4.</li><li>If you follow the exclamation points and accept the theme the story makes sense. </li><li>Some of the challenges have surprises if you fall down as well as somewhat of a riddle/puzzle to get the water element.</li><li>The game is relatively difficult to complete at least in one life so I believe there is some replayability to get better and try in one life.</li><li>I would hope that someone would recommend it. At least some of us in the class to become intrigued.  </li></ul>\n<p>4. Posted to Itch.io</p>\n<ul><li>These can be seen on this page.</li><li>This can be seen on this page.</li><li>On my game page it is now customized with color and organization.</li></ul>", "metacritic": null, "released": "2021-07-01", "tba": false, "updated": "2021-07-02T06:13:57", "background_image": "https://media.rawg.io/media/screenshots/989/9899b4d298f7b83627e95c45cf00adf6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 80, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["tbrooks3"], "genres": [], "publishers": [], "esrb_rating": null}