{"id": 62816, "slug": "star-pit-starship", "name": "Star-Pit Starship", "name_original": "Star-Pit Starship", "description": "Welcome to the Star-Pit! This is a small, re-playable, single player arcade score-chaser. It's simple: build your ship and blast everything that comes your way. Wrack up points as you go and keep the Graps (future space money) earned from everything you destroy. The more Graps you make, the better you can equip your next ship, and the better chance you'll stand of lasting longer in the pit. The goal? Set the high score and become champion of the Star-Pit! <br/><br/><br/><br/>This is my first attempt at making this style of game, and I sincerely hope it provides you plenty of entertainment. If you encounter any issues along the way or just want to say hello, feel free to reach out to me on Twitter or through my website. I'm always looking for feedback so I can improve, so don't hesitate to reach out! Thanks for checking out the game, and good luck in the pit! <br/><br/>Matthew Milson - Puddledock Games<br/><br/><br/><br/>Starships are made up of individual components called 'Star-Chips'. They are the guts of the ship: thrusters, laser guns, shields, etc. They can be placed in whatever arrangement you want. Once your ship is designed, you are placed in the Star-Pit to battle enemy starships and put your creation to the ultimate test. As chips on the ship are destroyed, the ship loses whatever functionality they provided. Earn points and Graps for destroying enemies starships chip-by-chip and spend those hard earned funds on your next starship. Enemy ships get increasingly more difficult the longer you last in the pit. Also there's space mines. Watch out for those.<br/><br/><br/><br/><ul><li>Easy to learn controls (not a twin stick shooter)<br/></li><li>Keyboard, Mouse, and Gamepad support<br/></li><li>Steam Achievements<br/></li><li>Steam Leaderboard<br/></li><li>Steam Cloud support<br/></li><li>Infinite replayability<br/></li><li>A dozen different ship modules to construct a starship to suit any strategy</li></ul>", "metacritic": null, "released": "2018-04-10", "tba": false, "updated": "2019-08-28T21:57:11", "background_image": "https://media.rawg.io/media/screenshots/00b/00bb83f83ccb2ce42aea2f1cdc2935fe.jpg", "website": "http://puddledockgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 50, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Puddledock Games"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Puddledock Games"], "esrb_rating": null}