{"id": 628152, "slug": "magnetic-bonds", "name": "Magnetic Bonds", "name_original": "Magnetic Bonds", "description": "<p><strong>Magnetic Bonds</strong> is a hybrid between a visual novel and turn-based RPG. Players can explore a science-fantasy universe, befriending characters and building relationships as they progress through battles. This is planned to be an <strong>episodic series</strong>, with episodes released at regular intervals. <em>Currently, the game contains 1 episode. Future episodes will be in the form of an updated download package, and once downloaded, the story will pick up from where you left off! </em></p>\n\n\r\nCurrent Game Length: 1-1.5 hours (Relaxed pace)\r\nFeatures\r\n<ul><li>A turn-based battle system that combines quick-thinking and resource management!</li><li>An epic storyline inspired by shonen manga!</li><li>Robust cooking system!</li><li>Hand-drawn artwork!</li><li>Over 600 voiced lines!</li></ul>\r\nReleased Episodes\r\n<p>So far, there is one released episode, which takes about an hour and half to complete at a relaxed pace. Consider this a tutorial and introduction to the story. <strong>Episode 2</strong> planned for late 2021, is a <strong>free update</strong> that will contain the <strong>following features</strong> in addition to <strong>continuing the story</strong>. </p>\n<ul><li>A training mode for those who want to grind or enjoy extra battles</li><li>Cook whenever you want for additional bonuses, also, expand your ingredient selection and recipe selection by using gold earned from battles</li><li>An additional bonding-minigame on the Scarecrow's Haven</li><li>Bestiary and Datalog</li><li>More playable characters</li><li><em>And more!</em></li></ul>\n<p>The number of episodes will be indicated by the version number. The version number will increase by 1 for each additional episode.</p>\r\nDeveloper\r\nmagboArt, Design, Programming, Writing\r\nVoice Talent\r\nXuan Vinh Huynh<br/>IsaacKatlyn DannesJean GigantPatrick LangnerRhett GaussBrandon NguyenDr. GigantPatrick HurtThe Imposter &amp; BM Lackey\r\nMusic\r\nsyncopika<br/>Title Theme: Dusk<br/>YouFulca<br/>wingless-seraph.net<br/>Kevin McLeod<br/>Additional Details\r\nTools\r\n<p>This game and its non-auditory assets were made using Unity (2019.3.0f3) and Clip Studio Paint. Sourcetree and Bitbucket were used to maintain the project.</p>\r\nThank you!\r\n<p>If you encounter any bugs you would like to report, please do so in the comments here.  Be sure to follow me here or on Twitter account for future updates. If you enjoyed the game, consider leaving a comment. If you want to financially support future development, consider either donating here or purchasing a sticker from the RedBubble shop.</p>\n<p>Thanks again!</p>", "metacritic": null, "released": "2021-06-30", "tba": false, "updated": "2021-07-02T06:43:52", "background_image": "https://media.rawg.io/media/screenshots/0fc/0fcf35f55fdc2f216a524c8493994023.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 140, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["MagBo"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}