{"id": 628159, "slug": "among-bus-desert-edition", "name": "Among Bus: Desert Edition", "name_original": "Among Bus: Desert Edition", "description": "<p>Tired of games that end in a flash? Bored of games that simply won't hold your attention? Outraged by the fact that the gaming industry doesn't give a hoot about the massive Among Us/CrazyBus/Desert Bus fandom? Well, have I got the game for you! In this beautifully-rendered* open-world** epic***, you're not the driver of the Crazy Bus, but the engineer, and you must complete your tasks in order to prevent the mean ol' Impostor from crashing the bus. During the eight-hour trip to god-knows-where, you will learn important life lessons, such as the fact that the CrazyBus theme is actually kind of a bop.<br/></p>\n<p>Features:<br/></p>\n<ul><li>You can press 1,2, and 3 to change the resolution! Wow!</li><li>Two incredibly distinct endings. You won't want to miss them!</li><li>~16 hours of gameplay if you're aiming for both endings (though the ending you get <em>is</em> random, so if you're lucky, you could get hundreds of hours of entertainment out of this game!)</li><li>Very little accessibility. Sorry if you wanted to torture yourselves with this game, deaf people.</li><li>At least one Impostor</li><li>An eye-searing \"\"CRT\"\" filter (that you can turn off (see, I <em>can</em> do accessibility!))</li><li>Sound effects from your favorite Among Us game; Among Us!</li><li>Music from your least favorite bus game; CrazyBus!</li><li>Graphics from a guy you probably don't have much of an opinion on; me!</li><li>Jerma's probably somewhere in there.</li><li>Buttons</li></ul>\n\n\n<p>* It's actually kind of ugly.\r\n</p>\n<p>** It's <em>kind of</em> open-world, if you consider going into one direction endlessly an \"open world.\"</p>\n<p>*** Epic <em>fail</em>, maybe.</p>", "metacritic": null, "released": "2021-06-30", "tba": false, "updated": "2021-07-02T06:45:29", "background_image": "https://media.rawg.io/media/screenshots/e80/e8024601cd8b9d1685cb4d894a733ab4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 141, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Rooie"], "genres": [], "publishers": [], "esrb_rating": null}