{"id": 62829, "slug": "v-racer-hoverbike", "name": "V-Racer Hoverbike", "name_original": "V-Racer Hoverbike", "description": "Join the fast-paced racing competition in VR with V-RACER HOVERBIKE !<br/>Ever wanted to ride a futuristic motorbike floating over the ground, fully loaded with lethal weapons? Well, we've got you covered!<br/>Put on your VR Headset and hit the track!<br/>Challenge your friends in time-trial mode with online ghosts, race against bots in a fun shooting feast, or play with your friends in the local party game mode.<br/><br/>V-RACER HOVERBIKE was designed for VR from the ground up. It's not a port. It can't be played without a headset, as the control system is VR-only.<br/><br/><br/><br/><strong>TRACKS</strong><br/><br/>From quiet highlands to arid desert mining facility planet, to mega-city planet, you'll race over the galaxy to become the fastest rider of the universe. Will you master the hardest tracks of saturn rings ?<br/><br/>You'll also be able to race on popular Earth tracks from the 20th century, built when cars and bikes still had wheels.<br/><br/>Early access will start with 4 tracks (4 more tracks added since then). The first two are fast and easy, well suited to get you up and running. They're also ideal for combat. The other two are much more technical, and will push your driving skills way further.<br/><br/>We've got a lot more tracks in the works, with some crazy locations coming, but we first want to gather community feedback to make decisions on which types of track to focus on.<br/><br/><br/><br/><strong>GAME MODES</strong><br/><br/>- <strong>TIME TRIAL</strong> with online leaderboards : race against your friend's ghost and beat them on the finish line, or go up against world top leaderboard players.<br/>- <strong>COMBAT RACE:</strong> race against bots, pick up weapons including mines and missiles, and clear your way to the finish line.<br/>- <strong>PARTY GAME:</strong> invite your friends at home to participate in a local turn-based time trial challenge<br/><br/><strong>WEAPONS</strong><br/><br/>We've got the basic weapon system in place, so you'll be able to play with these from day one : missiles, mines, homing missiles. We also have turbo and shield. We plan to add more to balance the gameplay. Killer drone, EMP Wave, Plasma, you name it! We're eager to hear the crazy ideas the community can come up with.<br/><br/><br/>- <strong>TRACKS:</strong> more tracks coming on a regular basis<br/>- <strong>WEAPONS:</strong> based on community feedback, we will include more weapons to the quick race experience<br/>- <strong>CAREER MODE:</strong> participate in championships, win stars and XP, and get rewarded for achievements<br/>- <strong>MULTIPLAYER:</strong> challenge your friends online in real-time in a race where all hell breaks loose<br/><br/> Available for Arcades on SpringboardVR", "metacritic": null, "released": "2018-04-13", "tba": false, "updated": "2023-05-23T00:36:02", "background_image": "https://media.rawg.io/media/screenshots/63e/63ee2d0c6f3ff12d5a5df15a9cf19c6c.jpg", "website": "http://www.v-racer.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 7, "dropped": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 448, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["VertexBreakers"], "genres": ["Action", "Simulation", "Sports", "Racing", "Indie"], "publishers": ["VertexBreakers"], "esrb_rating": null}