{"id": 62830, "slug": "foreveracers", "name": "Foreveracers", "name_original": "Foreveracers", "description": "Foreveracers is an arcade multiplayer driving game, with a focus on removing a lot of the faff and waiting around often associated with online racing games. Just join a game when you're ready, and start driving.<br/><br/>Each car in the game has a distinct feel and unique characteristics, and the physics model means that balance is as much part of challenge (and fun) as the optimal racing line. These cars can wobble and be a handful to control (especially if you're playing on keyboard). Also each car has their own 'optimal racing line', since as long as you hit the checkpoints in order, you're free to find your own route around the circuit!<br/><br/>You can challenge (and be challenged by) other players in the game to races or to special challenge modes. Everyone that accepts the challenge will join that game mode, and anyone that doesn't can just carry on driving as they were, maybe to join or issue the next challenge.<br/><br/>When not in a challenge, just drive through a start line to begin a lap, drive somewhere else to find another circuit whenever you want, or maybe explore to see if you can find an unlock for the hidden circuits. Or if you just want to quickly change car or jump to a different circuit, you can do so too.Features<ul><li> All one world - You're free to drive between the different circuits, and explore the world, without any reloading.<br/></li><li> Day/Night cycle - The racing in Foreveracers never ends, so keep driving night and day.<br/></li><li> Over 12 circuits - 4 initial circuits, 4 hidden circuits to find, and additional mirrored variants to then unlock.<br/></li><li> Race challenge - Issue a race challenge to other players, those that accept will line up and race to the finish line.<br/></li><li> Special Challenge Modes - If you want  a break from the racing, then challenge players to a Scavenge Hunt or Rust-Bucket Survival challenge<br/></li><li> 6 Main Vehicles - from the slow and steady Starter Car, through to the 'too fast' Sports Car, and the frankly ridiculous Clown Car.<br/></li><li> Leaderboards - See how your lap times compare to others<br/></li><li> Live world rank - Your current world rank is displayed for whichever circuit you currently have active, try to improve your best time and move up to #1!<br/></li><li> Ghosts - If you're just lapping alone then the 'ghost' of your best lap will start when you do.</li></ul>Note For Solo PlayersWe believe there is fun to be had with this game even if playing alone - start an online game and while waiting for others to join, you can drive, explore, time trial, try to improve your world ranking and unlock the extra circuits. However, we do want to make it clear that there is no single player 'story' or challenge structure, there are no AI racers in the game, so if you're only looking for a game to play alone/offline, then this may not be for you.Future DevelopmentWe have a number of ideas and plans to how we could further expand the game in future, and we intend for those additions to be free updates. However, we are just a 2 person team working in our spare time around our day jobs, so our focus initially has been to try to make a small, fun game and offer it for what we hope is a fair price. Post release our priority will be to support any issues with the game to make sure it works as we intended.  After that, we will review the feedback from the community to help decide which areas to work on first, so be sure to join the discussions to have your say!", "metacritic": null, "released": "2018-03-29", "tba": false, "updated": "2019-08-23T12:11:41", "background_image": "https://media.rawg.io/media/screenshots/cfd/cfda915e97071b991242c4644d0fa386.jpg", "website": "https://ssgg.uk/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 17}, "playtime": 1, "achievements_count": 16, "ratings_count": 0, "suggestions_count": 181, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["SuperSmashingGreat Games"], "genres": ["Action", "Sports", "Racing", "Casual", "Indie"], "publishers": ["SuperSmashingGreat Games"], "esrb_rating": null}