{"id": 628492, "slug": "warrior-battle", "name": "Warrior Battle", "name_original": "Warrior Battle", "description": "Bushi is very early in development. We plan to do a few closed alpha tests in the near future. The core mechanics are in place and the game is fully playable, but it is missing many quality of life features. We hope you enjoy the foundation of the game and help us see it to completion.<h3>Story</h3><br/>You are Son Goku, shape-shifting Warrior King. After traveling the world to master duplication and transformation, you return home despondent and bored. You have challenged everyone and won. Now what? One day while slouching in your throne, a cunning (conniving) river-dragon approaches you with a wager. She bets that you can’t win a fight against your own clones. You’re a little disappointed you didn’t think of it before. She’s confident you’ll lose and sign your titles over to her. Being arrogant and bored senseless, you accept the terms without hesitating, and summon your clones. Let’s rock.<h3>Key Features</h3><br/><strong>Intense Combat -</strong> Fast paced skilled based action with up to 10 players online. Master the sword and bow to gracefully dispatch your friends and foes. Slash through your enemies with a high speed dash. Outplay your opponents with a directional dodge. Turn the tables as you parry an incoming enemy attack and strike them down. Control your opponents with distant arrow projectiles.<br/><br/><strong>Gameplay Customization -</strong> Play the game the way you want with the ability to change any value in the game. Change the move speed of your character, modify the damage of your abilities, and everything in-between. We want you to create new experiences for everyone to enjoy.<br/><br/><strong>Dynamic Parkour-</strong> Move seamlessly and quickly across the map while fighting simultaneously. Run, jump, dash, and mantle quickly through beautiful Japanese themed environments. Scale up walls to gain a vertical advantage. Run along walls to lose or catch up to your enemies. Jump off and between walls to confuse your opponents.", "metacritic": null, "released": "2021-06-29", "tba": false, "updated": "2022-06-03T04:16:46", "background_image": "https://media.rawg.io/media/screenshots/6ef/6efe5f8fb331bfd8772763f7cf57f501.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 2, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["HyperCritical", "Afrowhale"], "genres": ["Action", "Adventure", "Strategy", "Casual"], "publishers": ["Afrowhale"], "esrb_rating": null}