{"id": 62853, "slug": "football-story", "name": "Football Story", "name_original": "Football Story", "description": "Want to participate in Closed Beta Test of our new games?<br/> Subscribe to the Newsletter to get notifications about upcoming matches.<br/><br/>Football Story is a multiplayer football game that pits full teams of players against one another. Each player controls their own character, instead of a full team. In Football Story, you step into the cleats of a player in a small neighborhood club. You are new in town, which means you’ve got a lot to prove. You can start making a name for yourself by participating in matches against other neighborhood teams, while growing your skills and meeting new players. Eventually, if you work hard enough, you’ll earn the opportunity to compete against a team of professional footballers when they swing around for the holidays!<br/><br/>Choose your character and work alongside other players as you compete against opposing clubs. Victory depends on how well you coordinate with your teammates. Ball handling, gaining position, disturbing the keepers, and outsmarting your opponents will all form key components of your strategy as you play. Analyse the situation and play smart! <br/><br/>As your skills grow, so do the challenges. You will be matched with better players as you improve, culminating in your chance to play against a professional football team that happens to be in town for the holidays.<br/><br/><strong>Core Features</strong><br/><br/>- Story mode (TBD): make your mark and get a feel for the controls.<br/>- Multiplayer football experience: take the world by storm! Each player controls their own character on the field, making teamwork essential. <br/>- Earn experience, gain levels, and hone your skills to increase your reputation. <br/>- Multiplatform support, from PC to Apple TV and smartphones. Different, optimized controls for each platform.<br/>- Opposing teams are formed through a skill-based matchmaking system.<br/>- MMR is based on your personal performance.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:57:09", "background_image": "https://media.rawg.io/media/screenshots/3de/3def90414e1903cb201a9bb3d8375bda.jpg", "website": "http://crytivo.com/football-story", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 4}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 299, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["fructus temporum"], "genres": ["Adventure", "Sports", "Massively Multiplayer", "Indie"], "publishers": ["Crytivo"], "esrb_rating": null}