{"id": 62865, "slug": "fun-hospital", "name": "Fun Hospital", "name_original": "Fun Hospital", "description": "You are invited to build a fantastic theme hospital! Build a hospital with your smart strategy NOW! And expand it to the most famous and supreme hospital in the world!  <br/><br/>▶ <strong>BUILD A HOSPITAL FREELY</strong><br/>There are plenty of rooms with different functions, as the boss you need to decide which, where and when to build these to save more patients. Building, placing and upgrading your rooms strategically will keep the treatment going and your profit growing.<br/><br/>▶ <strong>CREATE YOUR MEDICAL TEAM</strong><br/>Hire doctors, nurses and cleaners according to their capabilities, place them in work positions to treat patients! Train, equip and upgrade them to improve their work performance, and manage their work and rest policy to keep them in a good condition.<br/><br/>▶ <strong>CURE VARIOUS PATIENTS</strong><br/>Enjoy your leisure time watching hundreds of cute little patients walking, sitting and receiving medical treatment in your hospital! Each of them has unique appearances before and after treatment. More importantly, the rooms, facilities and staff members will have a real-time influence on patient’s behavior, in other words, your decision and strategy determine their treatment results!<br/><br/>▶ <strong>CHALLENGE HUNDREDS OF DISEASES</strong><br/>Upgrade your technology to unlock more diseases. You will be able to save patients from the pain of fever, baldness, OCD, pregnancy, fart, zombie curse, blood phobia, pig head, muscle injury, cat slave, mermaid, game addict …<br/><br/>▶ <strong>COMPETE TO EARN REWARDS</strong><br/>Create or join a union. Help your union mates and complete union tasks to increase your union ranking in the weekly Medical Tournament! The Top Hospital Unions will earn great rewards and trophies every week!<br/><br/>Tycoon’s back! Fun Hospital is the greatest hospital simulator ever! Play with people all over the world in this amazing online building &amp; simulation game!<br/><br/>Fun Hospital is free to play. However some in-app items can be purchased for real money.", "metacritic": null, "released": "2018-06-21", "tba": false, "updated": "2019-08-28T21:57:08", "background_image": "https://media.rawg.io/media/screenshots/ea0/ea029af6cb437540615686f67924ef14.jpg", "website": "http://www.oranges-game.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 50}, "playtime": 7, "achievements_count": 186, "ratings_count": 0, "suggestions_count": 201, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["OrangesGame Technology"], "genres": ["Strategy", "Simulation", "Casual", "Indie"], "publishers": ["OrangesGame Technology"], "esrb_rating": null}