{"id": 62885, "slug": "balance-of-soccer-2018", "name": "Balance of Soccer 2018", "name_original": "Balance of Soccer 2018", "description": "This is a football strategy simulation game with  3D scenes and real-time control.<br/>You can either win by setting a reasonable team strategy or you can beat the opponent by controlling the players.------------------------------- The basic game process ---------------------------● Select the game mode (currently there are friendly matches, the 2018 World Cup 32 finals or the 22 wild card teams competition), and then select your team.<br/><br/>● After entering the game, the soccer players will automatically play the game through AI thinking. You can observe the two teams' match without any operation.<br/>● You can take over the AI at any time and perform full control over the team's players, such as dribbling, passing, shooting, tackle, or any teammate's running.<br/>● You can also set up formations, tactics and take effect in real time like a coach; you can also pause the game to make tactical-board-like arrangements.<br/>In general, this game is similar to the traditional Football Manager games, in addition, each player can be controlled in real time.<br/>For you, it is as if you are free to switch between coaching and player roles.------------------------------------- Features----------------------------------------<strong>●2018 World Cup </strong><br/>Contains the complete schedule of the 2018 World Cup 32 Finals.<br/>22 teams that have not yet reached the finals, including Italy, the Netherlands, the United States, and China, can also be selected to reach the final through a round of Wild Card games.<br/><strong>●Classic realistic style</strong><br/>3D stadium and players,  set the value according to the true proportion, player AI behavior and the game process as close to reality as possible.<br/>Basically complete football elements such as throw in, corner kick, offside, foul, free kick and penalty kick. There will be extra time and penalty shootout in the knockout stage!<br/><strong>●Team Tactical Settings</strong><br/>Achieve the most basic and intuitive 10 tactical options, such as:<br/>-- Offensive/defense ratio<br/>-- Holding ball/Passing ratio<br/>- Short pass /Long  passing Tendency<br/>-- Shooting frequency<br/>-- The overall position baseline of the attack (or defense)<br/>-- Player spacing when defending<br/>Of course, template tactical options, such as [All-Out Attacks] and [Counter Attacks], can be set in one click.<br/>Tactical options are effective immediately after modification in the game, each option may change the style of the team.<br/>If you want to achieve the best tactical effect, you may need to observe and think and adjust many times like a coach.<br/>With more than 50 optional team formations and differences in player abilities, each game will have a lot of changes.<br/><br/><strong>●Unique and convenient operation method</strong><br/>Different from the traditional idea of  only controlling the ball holder, this game is based on controlling the whole team.<br/>There are two kinds of operation: fuzzy instruction and precise control: <br/><strong>-- Fuzzy instructions</strong>:<br/>Click on the four buttons at the bottom of the screen, as if the coach giving directions to the players:<br/>(When attacking) - Break through! Hurry pass! Take a shot!<br/>(When defensive)- Go chasing the ball!  Intercept his ball!  Slide Tackle!<br/>At this time, a player will be automatically selected, and he will execute the instructions according to his ability and team tactics.<br/>For example, if you press the [Tackle] button while defending, the nearest player close to the ball will begin tackle.<br/>Another example is that if you press the [Pass] key during an attack, the ball holder will automatically choose to pass a ball to a teammate in front of him. <br/>So this is an inaccurate command, and the effect may be beyond your expectations.<br/><strong>-- Precise control</strong>:<br/>By clicking and dragging directly on the field, you can accurately control passing and moving.<br/>Ball holder: Dribble according to the direction of dragging on the field; Click on the field to pass the ball to the click position .<br/>Teammates: Run according to the route of dragging; While in defense, clicking on the field will make one player to run to the click position.<br/>In this way, you can precisely control multiple players at the same time, so that you can organize attacks or defenses according to your own ideas.<br/>The following animation example shows a Dribble-Run-Pass cooperation between two teammates formed by two drag operations:<br/><br/>Of course, you can also use the keyboard arrow keys + buttons to complete the above control.<br/><br/>(For other game content and features, please see the Early Access  description)----------------------------------------------------------------------------------------Thank you for reading so much content! But please believe that playing this game will not be so tired! <br/><br/><strong>Hope you enjoy it!</strong><br/><br/>(Stepiral Studio  Email: stepiral@163.com)", "metacritic": null, "released": "2018-05-31", "tba": false, "updated": "2019-08-28T21:57:07", "background_image": "https://media.rawg.io/media/screenshots/174/1746a4a8728419c80bbc6892455ca7ae.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 245, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Stepiral Studio"], "genres": ["Action", "Simulation", "Sports", "Casual", "Indie"], "publishers": ["Stepiral Studio"], "esrb_rating": null}