{"id": 629065, "slug": "rise-of-the-rhubarbarian-game-jam", "name": "Rise of the Rhubarbarian - Game Jam", "name_original": "Rise of the Rhubarbarian - Game Jam", "description": "<p>Team:</p>\n<p>Onanefe Adjenughure - Game designer and producer<br/></p>\n<p>Alexander Herda - Artist</p>\n<p>Julius Bacauskas- Concept artist</p>\n<p>Daniel Kasprzyk (me) - Programmer<br/></p>\n\n<p>Overview:<br/></p>\n<p>This is the end result that me and my team of 3 people were able to create as part of a game jam for the final weeks of college. This game jam lasted two weeks and within this time period we put in all our effort to quickly make something out of the assets we were given. We were provided with the basic level, scripting for general game functionality as well as a few prefabs. <br/></p>\n<p>The rest was up to us to add in and expand on our skillsets. The only restrictions were that we had to stick to the theme of rhubarbs (as this correlates to the title) and we needed to make a platformer. In the end we ended up creating a puzzle platformer that would be played in first person perspective.<br/></p>\n\n<p>Positives: <br/></p>\n<p>The collaberative effort of everyone involved meant we could all focus on our specialisms in games development which allowed us to create things we could be proud of. We had also managed to come  up with the ideas for the game quite quickly which allowed us to spend more time on development and in the end we had created a playable game.<br/></p>\n\n<p>Negatives: <br/></p>\n<p>A few times during development, we experienced miscommunications which was expected as we all worked from home and weren't expecting to be working together near the end of the year. Another problem was time management which thankfully wasn't too much of an issue as we were able to complete the game whilst also sadly cutting out a few of the things we were hoping to implement. We were hoping to have 4 levels as well as feature more art that was made by our team members but due to time constraints we had to settle on 2 levels and no art.<br/></p>\n\n<p>Evaluation: <br/></p>\n<p>Overall, this project went quite well considering we haven't done any team projects beforehand and with the limited time we had. All of us had created quality work that allowed us to expand our talents and showcase them appropriately. If we were given another shot at this, I think we would collectively agree that time management would have been a  bigger priority so that we could get everything done on time.<br/></p>\n\n<p>Stats:          </p>\n<p>Lines of code: approximately _____ (to be counted)<br/></p>\n<p>How enjoyable was development of this project: 9/10            </p>\n<p>How much I learnt throughout this project: 4/10            </p>\n<p>Difficulty of this project: 7/10      \r\n</p>", "metacritic": null, "released": "2021-06-28", "tba": false, "updated": "2021-07-02T10:53:48", "background_image": "https://media.rawg.io/media/screenshots/869/869ed8f000db84b263b54107599e8aa7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 11, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["0xDaniooo"], "genres": ["Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}