{"id": 62902, "slug": "yakuza-kiss", "name": "Yakuza Kiss", "name_original": "Yakuza Kiss", "description": "Please note that you only pay once and you get all future updates and chapters for free! As new content is released, the price will go up, so the earlier you buy Yakuza Kiss, the less you end up paying!<br/><br/>Offering the <strong>feminine adult visual novel audience</strong> <strong>something new and exciting</strong>, Yakuza Kiss combines elements from <strong>Western romance novels</strong> and <strong>Asian TV dramas</strong> into an experience spanning multiple genres - from<strong> romance and erotica</strong> to <strong>action and crime</strong>. We take all the classic visual novel features you love and add some new ones.<br/><br/><strong>We prioritize immersion, excitement and enjoyment! </strong><br/><br/><br/><br/><ul><li>LIVE2D animated characters</li></ul><ul><li>Animated backgrounds with sprite animations and particle effects</li></ul><ul><li>Comic book style illustrations for important scenes</li></ul><ul><li>Karma system - your choices lead you to different outcomes</li></ul><ul><li>Immersive soundtrack, SFXs and visual effects</li></ul><ul><li>Chapter-by-chapter release - follow along &amp; support us on the way</li></ul><br/><br/><br/>\"Turn darkness to light, weakness to strength.\"<br/><br/>Some call it a neon paradise, but in reality, <strong>Cyan City</strong> is a hell on earth where the strong prey on the weak. Rays of sunlight seldom breach the thick smog of pollution looming over the city, creating an endless night where the criminal underworld never sleeps.<br/><br/><strong>Jeong Moon</strong> had lost everything and everyone. Living in the slum district, she was barely scraping by. Finally pushed to her breaking point, she wanted to leave it all behind. Instead she was pulled even deeper into the belly of the beast and forced to become a member of the <strong>Yakuza</strong>.<br/><br/>Within their ranks, working to conceal her true identity, she would catch the attention of a dangerous and tormented yakuza leader - <strong>Yuki Yamaguchi</strong> - a man who had nothing left except his inner demons. To survive in his world, she would have to face her deepest fears and give in to her darkest desires...", "metacritic": null, "released": "2018-06-19", "tba": false, "updated": "2019-08-28T21:57:06", "background_image": "https://media.rawg.io/media/screenshots/c8a/c8adb18638127c32852ff741bd3c4f4f.jpg", "website": "http://pinkpotiongames.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 273, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Pink Potion"], "genres": ["Indie"], "publishers": ["Pink Potion"], "esrb_rating": null}