{"id": 62903, "slug": "melting-world-online", "name": "Melting World Online", "name_original": "Melting World Online", "description": "After the cataclysm that led to the destruction of Earth, a handful of survivors found a new home on a faraway planet. Overcoming the resistance of local forms of life, people have built cities, factories, farms… It seemed that humanity got a second chance. But the destructive war, called the Invasion, in just a few days, threw the settlers back into the past for decades. Take on the role of a commander of resistance and take a squad of Battle Mechs in the massively multiplayer game Melting World Online!LEAD A FIRETEAM OF BATTLE MECHSDozens of types of mechs in turn-based tactical battles with a unique system of calculating damage. Use environment to defeat enemies.IMPROVE SKILLS OF PILOTSThere is a team of hired pilots at your disposal. Develop their perks and skills. Earn rewards for completing quests.EQUIPMENT AND CUSTOMIZATIONA huge combat arsenal. Hundreds of equipment items - weapons, armor and outfits. Combine the equipment of the mechs and use paints.PRODUCTION, RESEARCHING AND TRADINGCollect materials and craft. Conduct a technology research. Catch and examine local wildlife. Trade items with other players.DUELS AND ARENAS. SINGLE AND COOPERATIVE BATTLES.Fight alone or team with up to 4 players. Compete in duels and PvP arenas.", "metacritic": null, "released": "2018-06-15", "tba": false, "updated": "2019-08-23T12:11:41", "background_image": "https://media.rawg.io/media/screenshots/156/15625ff27a47296710282aa5d00e7756.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 370, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Juvty Worlds"], "genres": ["Adventure", "RPG", "Strategy", "Massively Multiplayer", "Indie"], "publishers": ["Juvty Worlds"], "esrb_rating": null}