{"id": 62918, "slug": "football-drama", "name": "Football Drama", "name_original": "Football Drama", "description": "<p>You are Rocco Galliano, the Marseillaise new manager of Calchester Assembled Football Club.<br />\nAfter the abrupt ending of your coaching career seven years ago, the hysterical attention of the press quickly faded. But struggling results by Calchester FC convinced Boris Aluminovitch, its billionaire president, to axe the previous beleaguered manager and give you a new chance.</p>\n<p>Will your raucous shouts from the bench change the fate of the team? Will you find wiseness and karma leadership with the help of the Book of Changes? Will your shady past reach back to you and make you crumble?</p>\n<p>Chances that you can make it through a full season are slim. Corruption, crime, drugs and romance are all paths that you may take - for better or worse.<br />\nThis is the only football game where you may lose the championship and win the game!Key features<br />\nInteractive narrative with meaningful game-changing choices<br />\nKarma or chaos: life choices, game choices<br />\nTurn-based match play with live-action animations<br />\n18 dramatic weeks of procedural championship where you can be fired at any time<br />\nDeck-building mechanics determined by life choices and game results<br />\nRidiculous cards about the craziest aspects of today&#39;s football<br />\nIllustrated log of each of your matches<br />\nSilly main commentator with his obligatory colourful sidekick<br />\nReplayable - every championship is unique, several different endings<br />\nNicely designed user interface by Pino Panzarella<br />\nStunning illustrated cards and characters by Daniele Giardini &quot;Demigiant&quot;<br />\nShare your wins with friends and enemies</p>\n<p>Why another game on football? Football Drama was started after discovering and exploring the richness and quality of the literature about football. Novelists and poets like Pasolini, Galeano, Soriano, Hornby, Saba, Handke, Wenders have written about football and its evocative and poetic power. Same in movies, with fringe and beautiful works like The Lost World Cup or Wender&#39;s The Goalie&#39;s Anxiety at the Penalty Kick. Another great inspiration was the book Football Clichés by Adam Hurrey. This naturally lead to the question: why people love football so much? So we started designing a new, unique game around football, as we believe games can be a wonderful media for storytelling.</p>", "metacritic": null, "released": "2019-09-18", "tba": false, "updated": "2019-09-20T04:20:55", "background_image": "https://media.rawg.io/media/screenshots/480/4806f225c95d4d678c50277b8234276b.jpg", "website": "https://www.open-lab.com/footballdrama/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 17, "toplay": 4}, "playtime": 2, "achievements_count": 12, "ratings_count": 0, "suggestions_count": 249, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "iOS", "PC"], "developers": ["Open Lab", "Open Lab Games & Demigiant"], "genres": ["Adventure", "Strategy", "Sports", "Indie"], "publishers": ["Open Lab Games", "Open Lab"], "esrb_rating": null}