{"id": 6292, "slug": "mega-tank", "name": "Mega Tank", "name_original": "Mega Tank", "description": "“The sheer carnage that you can unleash is just too much fun.” – Touch Arcade<br/><br/>Earthmart Corporation wants to recycle the old robots to create new model shiny high tech versions.  <br/><br/>But there is one thing standing in the way of their devious plan to press you into an iron pancake... your ride...Mega Tank.     <br/> <br/>-Action and Strategy Gameplay<br/>-Endless Runner + Castle Defense<br/>-Customizable Tank.   Build it up and decorate it the way you want!<br/>-Use Weapons like saw blades, flamethrowers, mortars, grenade launchers, cannons, gatling guns, lasers, missile launchers, smashers, heat rays, and chain lightning to destroy everything in your path!<br/>-Three starting Battles including Bot City, Electro Lotus Jungle, and Metal Desert<br/>-Background gradient colors change based on time of day for nearly endless variety<br/>-Evil robot bosses, including the Mega Robo-Chicken, Not-So-Mega Tank and the Helzacopter<br/>-Game Center Achievements and Leaderboards<br/>-Collectible Weapon System to form the unstoppable Machine Gun Nukinator<br/>-Power-Ups to help the tank through rough patches including Boost Packs, Finger-Of-Death, and the Death Ray weapon among a host of others.  <br/>-Share Epic Replays <br/>-Crane Game to collect weapon pieces, win continues, and extra scrap <br/>-Music by MaXXX<br/>-Art by Poor Al <br/><br/>Build up the stack-able death machine Mega Tank, crush the enemy beneath your weight, and roll until the treads fall off.<br/><br/>If you run into the zero health bug, please just hard quit the app and restart. It will fix the issue.  For any issues please e:mail support@gamegardeners.com", "metacritic": null, "released": "2016-05-24", "tba": false, "updated": "2019-10-22T14:28:47", "background_image": "https://media.rawg.io/media/screenshots/1e2/1e2ef422bcd2912ed42853ee8855790c.jpeg", "website": "http://www.facebook.com/megatankgame", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 248, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Game Gardeners"], "genres": ["Action", "Strategy"], "publishers": ["Game Gardeners"], "esrb_rating": "Everyone 10+"}