{"id": 629271, "slug": "battle-paddles", "name": "Battle Paddles", "name_original": "Battle Paddles", "description": "<p><em><strong>BATTLE PADDLES</strong>  - a pong clone with an explosive twist. (<strong>2 -player only!</strong><strong> no AI</strong>) <br/></em></p>\n<p><em>In the year 40XX, Mars mining colony - Penitentiary District.</em></p>\n<p><em>At the end of each mining cycle, inmates volunteer to compete in the arena.</em></p>\n<p><em>Winners earn their freedom to go back to the mines. Losers are destroyed for entertainment..<br/></em></p>\n<p><strong>HOW TO PLAY:</strong><br/></p>\n<p>- Bounce the disc behind the opposing players paddle to score <strong>1 point</strong>. Score <strong>10 points <em>OR </em></strong>destroy the opponents paddle and pilot to WIN!</p>\n<p>-Watch out! The disc will explode after too many bounces. Both LEFT &amp; RIGHT sides of the paddles, as well as the pilots protective canopy are destructible by these explosions. (leaving a smaller paddle to bounce back the disc for the rest of the game or killing the pilot, causing an immediate loss) <br/></p>\n<p>-The audience will throw a <strong>repair kit</strong> if a player is 3Pts behind and <strong>fully broken</strong>. There is only one repair kit per game.</p>\n<p>**************************************************************************************<br/></p>\n<p>Message from the Developer:<br/></p>\n<p><strong>Hello and welcome! </strong>Thank you for checking out BattlePaddles<strong>! <br/></strong></p>\n<p>\n</p>\n<p>BattlePaddles is my very first game and I'm nervously proud to share it. My intent on this project was to try my hand at each part of game creation (design, programming, art, sound, UI etc) in order to understand how much work it is to tie everything together and discover where my strengths are.  It's clear how badly this game needs AI, a clearer repair item appearance mechanic and a settings menu but I've spent too long on this project and must move on. I'll tackle AI in the next one!</p>\n<p>BattlePaddles was an idea I had in high school in the early 2000's but I was overwhelmed by programming and quit my game design aspirations. I regretted it ever since. It feels good to go back and finish what I started, this time with C# and Unity instead of the  OOT Turing language and ms paint.</p>\n<p> I'm anxious to move forward and continue where I left off in my gamedev aspirations. <br/></p>\n<p>Thank you for playing!</p>\n<p><em>-Snowdrift Games</em></p>", "metacritic": null, "released": "2021-06-28", "tba": false, "updated": "2021-07-02T11:51:07", "background_image": "https://media.rawg.io/media/screenshots/311/311a0c40fc885b6f6aea54ba02f96fd5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 31, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SnowdriftGames"], "genres": ["Action"], "publishers": [], "esrb_rating": null}