{"id": 629398, "slug": "dicey-tank-king", "name": "Dicey (tank king)", "name_original": "Dicey (tank king)", "description": "<p>This is a simple puzzle-platformer made using p5.js, made for the Mini Jam 83: Dread. [Limitation: Dice must be a mechanic]</p>\n<p>This is the first time I made a game using p5.js and I learnt it while doing the jam, so this is what I could put together so far. The game contains only 5 levels for now.</p>\n<p>A brief introduction to the game:</p>\n<p>Dicey has Nyctophobia, the fear of darkness!<br/>Play as Dicey and help him overcome his fear by completing the levels.</p>\n<p>Press V or H to toggle the Vertical or Horizontal Shift modes respectively. <br/> Use WASD or Arrow Keys to move, and Ctrl or Enter to roll the dice.</p>\n<p>If you roll the dice in Shift mode then you can shift the platforms too!<br/>The dice picks up a number from 1 to 6 randomly. Based on the number chosen it turns left if the new number is lesser than or equal to the current number or else it turns right if the new number is greater than the current number. The dice rotates as many times as the difference in the values of new and old numbers. <br/>When the dice is in Shift mode then the platforms which fall under it's range will get selected, and if that happens then the player can wrap at edges vertically or horizontally depending on the Shift mode provided at least one platform falls within the range of the player.</p>\n<p>If you get out of bounds of the screen while not in Shift mode then the level will automatically reset. </p>\n<p>And, Dicey has the ability to double jump, which can be helpful in many cases, specially to make long distance jumps.</p>\n<p>To complete each level you need to touch the red door, indicated by the tilted stripes.</p>\n<p>Also there is a darkness wave that tries to engulf the player slowly. If the darkness covers the screen entirely then you have to start over from level 1. The rate at which the darkness approaches increases with the level.</p>\n<p>However, once you complete the levels, Dicey will have overcome his fears by then, all thanks to You!</p>", "metacritic": null, "released": "2021-06-27", "tba": false, "updated": "2021-07-02T12:27:45", "background_image": "https://media.rawg.io/media/screenshots/b8c/b8c05a85fc9dd269e8f485bdadf4f5d0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 24, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["tank king"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}