{"id": 629347, "slug": "the-original-voyagers", "name": "The Original Voyagers", "name_original": "The Original Voyagers", "description": "<p>This game was made during the:</p>\n<p>Historically Accurate Game Jam 4</p>\n<p>I did not have enough time to implement an in-game tutorial, so please read how to play before starting.</p>\n<p>The Polynesians believed in a lifeforce called \"Mana.\" Mana could inhabit people, stone, animals, and even whole islands. Your task is to lead a fledgling group of people in restoring the balance of Mana in the world. To accomplish this, you must go out in search of new land and construct great temples there.</p>\r\nControls:\r\n<p>In general, the game should control similar to a typical RTS or strategy game.</p>\n<p>Move camera:</p>\n<p>with keyboard keys: W A S D</p>\n<p>Select units:</p>\n<p>Left click/left click + drag</p>\n<p>Instruct units:</p>\n<p>Right click</p>\n<p>Build structure:</p>\n<p>Left click icon, then left click within a valid location (typically an island)</p>\n<p>Controls video<br/></p>\r\nGoal of the game:\r\n<p>Build a Temple on each island.</p>\n<p>To avoid losing, ensure that you have Food wherever you have population.</p>\n<p>When placing structures, be aware that they will take up a lot of space, and will require you to consider which structures are worth building on an island.</p>\n<p>Structures require the Wood resource, collect Wood by constructing \"Wood Camps\" near a set of trees, then sending up to 5 people to work near it. (Tell them to stand near the structure).</p>\n<p>To collect the Food resource, construct a \"Fishing boat\" near a set of fish, then send up to 5 people to work near it. (Tell them to stand near the structure).</p>\n<p>Resources are \"divided\" or \"stockpiled\" into separate locations. These locations will either be each island or a voyaging boat.</p>\n<p>Food will periodically be consumed by people.</p>\n<p>Temples will periodically add new people to an island.</p>\n<p>In order to seek out new land, you must build a Voyager (boat).</p>\n<p>If you are trying to send new people to an island using a Voyager, make sure you use the \"Transfer Resources\" button to add enough resources and people to the Voyager to make the trip. You may need to come back to your starting island if you miscalculate how many resources you should send!</p>\n<p> Once you've reached a new island, use the \"Transfer Resources\" button again to unload them.</p>\r\nKnown issues:\r\n<p>Be careful telling many people to move to the same spot all at once, they can bug out and end up all on the same spot. Try to unentangle them before this happens if you are able to.</p>\n<p>If you see a bunch of \"white ground\" you have probably gone beyond the boundaries of the map.</p>\n<p>If a Voyager gets too close to a resource collection structure, it will prevent resources from being collected there.</p>\r\nCredits:\r\n<p>Everything in game is made by me using: Unreal Engine, Blender, Krita, and VS.</p>", "metacritic": null, "released": "2021-06-27", "tba": false, "updated": "2021-07-02T12:14:35", "background_image": "https://media.rawg.io/media/screenshots/378/3785ee6b5018d249b9831ef0d3d89c0b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 34, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Tewesday"], "genres": ["Strategy", "Simulation"], "publishers": [], "esrb_rating": null}