{"id": 629642, "slug": "dice-domain", "name": "Dice Domain", "name_original": "Dice Domain", "description": "<em>God does not play dice. I do.<br/></em>- Baron Von Datum\r\n<p>You are Baron Von Datum, the most heinous villain in the whole county of Alea's Port. Unleash your latest evil invention, the majestic <strong>Die-Cey</strong>, on the oblivious population of the neighboring cities.</p>\n\r\nHow to use a Die-Cey:\r\n<p><em>Muhahahaha!</em> The Die-Cey is so technologically advanced that is indistinguishable from a normal dice. I mean, except the fact that it is 100 meters tall. And that sometimes explodes.</p>\n<p>Just drag the <em>Elast-O-Matic </em>(patent pending) with your mouse to load the Die-Cey and release to bring destruction to those stupid monkeys. <em>Muahahaha!<br/></em><br/></p>\n<p>But Beware, you fool! The Die-Cey needs power, so <strong>you have a limited number of shots to cause as much destruction as possible!</strong><br/></p>\n\n\r\nWhat do you mean with \"Explodes\"?\r\n<p>The Die-Cey is equipped with a multitude of horrifying weapons that activate whenever you roll a specific number. Here is the list:<br/></p>\n<p><strong>\r\nI. Bullet Dice! </strong></p>\n<p>When rolling 1, the Die-Cey becomes supercharged. The next shot will disintegrate everything on its path.<br/></p>\n\n<p><strong>\n</strong></p>\n<p><strong><strong>II. Clones!</strong></strong></p>\n\n<p> You know what's better than 1 Die-Cey? Four of them! The next shot will generate three additional destructive Die-Ceys (slightly under-powered versions, unfortunately.)<br/></p>\n\n\n\n\n\n<p><strong>III. MegaDice!</strong></p>\n<p>Sometimes you just need to obliterate everything on a vast area. A half a km Die-Cey may help.</p>\n\n\n\n\n\n\n<p><strong><strong>IV. Exploding Clones!</strong></strong></p>\n<p> You know what's better than many Die-Ceys? Many EXPLODING ones! Every clone left on the city soil will explode, obliterating everything nearby.</p>\n\n\n\n\n\n<p><strong>V. Dynamite!</strong></p>\n<p> ...Or you could just use your main Die-Cey. It's only one, but the effect is considerably stronger!<br/></p>\n\n\n\n\n\n\n<p><strong><strong>VI. Second Chance!</strong></strong></p>\n<p> My grandma always used to say: <em>\"Sometimes you need another two shots with your enormous dice!\"</em>. Weird woman. To honor her, rolling a 6 with the Die-Cey will give you two additional shots.<br/></p>\n\n\n\n\n\n\r\nWhat should I destroy then?\r\n<p>EVERYTHING! <em>Spread destruction! Scatter dread!</em> And remember: you are a super-villain! Hospitals and sensitive targets will increase considerably fear in the general population! And if you happen to destroy a Nuclear Plant or a Firework Factory....Muhahahaha!</p>\n<br/>Challenge: Do you feel like a supervillain?\r\nTry the Metropolis map on Overlord difficulty and post here your Dread score!\r\n<p><strong>Credits:<br/></strong></p>\n<ul><li><em>Francesco Abbonizio:</em> World creation, explosions\r\n</li><li><em>Gabriele D'Amen:</em> World destruction, summoned the Die-Cey</li><li><em>External:</em> Cipher and Jerry Five are royalty free creations by <em>Kevin Macleod\r\n</em></li></ul>\n\r\nNotes:<ul><li>Linux Users: to run the game, extract the archive and open a terminal inside the game folder. Run the command \"<strong>chmod +x build.x86_64</strong>\" and then \"<strong>./build.x86_64</strong>\" to execute</li></ul>", "metacritic": null, "released": "2021-06-27", "tba": false, "updated": "2021-07-02T13:36:05", "background_image": "https://media.rawg.io/media/screenshots/116/116943b44eeb4bc8f48922d3b6809741.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 133, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["Anthair"], "genres": ["Action"], "publishers": [], "esrb_rating": null}