{"id": 629732, "slug": "star-struck", "name": "Star Struck", "name_original": "Star Struck", "description": "<p>All you need to play the game is the [<strong>SPACE</strong>] key!</p>\n<p>I made this for the Boundless Game Jam! The restriction was \"One Button\", and it was a fun restriction to work around!</p>\r\nDescription &amp; Thoughts\r\n<p>Alright, it's finally done! I had a lot of fun with this but it also gave me a headache, I'm too much of a goblin to focus to long on these. I made this in 72 hours, since yeah, of course, I'm late to the jam <em>again</em>, and I had to rush, but this was still really fun!</p>\n<p>I think this is the first time I make music for a game in a while, and definitely the first time I had time to make music for my game in a game jam! This is also the third jam I've ever joined, and I'm still a little anxious about everything, I really hope I'm doing this right. : '3x</p>\n<p>I also wanted to make a little \"shop\" where you could buy hats for the cat with points and such, but I ended up not having enough time and the one button restriction also made that tricky to think about, I still have no idea how I could make it work. I think I'll add it after the jam though, if I have the inspiration to do so! </p>\n<p>Also, the 'meow'-esque sound in the music is a synth, which I absolutely adore. That's what synth plugins are for: cat sounds.</p>\n<p>I'm sorry if you find any bugs, I tried hard to fix all of them but I'm sorry in advance if you come across any bugs I didn't notice!</p>\n<p>I wish I could've added more difficulty, but I ran out of time to do so.  :c I'm definitely considering doing so after the jam is over though!</p>\n<p>Also, the game saves your highscore in the browser's web storage by default, which is a fun new thing I've always wanted to implement in a game and I finally had the time to do so this time around! I'm sorry if there are any glitches with that though!</p>\n<p>I think <em>all</em> of my games have to include cats at this point. They <em>have</em> to. Always!</p>\n\n<p>All art, music and design by me!<br/></p>\n<p>Software used: GDevelop, Piskel, Medibang Paint, Synfig, LMMS, JFXR.</p>\n<p>Font used in the game is Fixedsys Excelsior 3.01!</p>", "metacritic": null, "released": "2021-06-27", "tba": false, "updated": "2021-07-02T14:03:12", "background_image": "https://media.rawg.io/media/screenshots/7ae/7ae2321746f83214e88b61ed473c241c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 22, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["MayhemCats"], "genres": [], "publishers": [], "esrb_rating": null}