{"id": 62975, "slug": "higher-ground", "name": "HIGHER GROUND", "name_original": "HIGHER GROUND", "description": "<strong>Will You Survive?</strong><br/><br/>Higher Ground is a 3D racing-like adventure game. You are Hoffman, a genius scientist who left behind in the polluted Earth, dedicates himself to escape to Mars. With your \"friend\" Swimmy, a one-manned spaceship, you will escape from Megaquake and harsh natural conditions such as flood, blizzard and strong magnetic flux. You will navigate into abandoned cities to avoid touching the surface and head for the higher ground. But don't worry. Your spaceship, Swimmy has numerous amazing modules to help you find a way to the extraction point. Test your driving skill from collapsing cities and devastating Earth environment. Good luck with your trip.<strong>Key Features</strong><br/><br/><strong>3D racing-like adventure.</strong><br/>You will drive a spaceship, \"Swimmy\" to navigate the skyline of the city. It has incredible speed and propulsion that allows you fly and jump above buildings. You have to travel further and faster to avoid death.<br/><br/><strong>Don't touch the ground.</strong><br/>Surface is very unstable due to strong geomagnetic flux. Navigate with rooftops of buildings to avoid getting close to the ground. Always look for HIGHER GROUND. Ocean is also not safe to land since your spaceship will sink. <br/><br/><strong>Megaquake will destroy cities.</strong><br/>If you delay, Megaquake will devastate everything including you and the city. You have to escape from the city before destructive L-wave catches you. Buildings will likely fall and collapse on your way. Moreover, buildings will be destroyed randomly and unpredictable ways. Move faster, otherwise you will have no place to step on. Drive while you can. <br/><br/><strong>Advanced Modules.</strong><br/>Your spaceship is equipped with very high-tech modules, which is intended for space travel. But still, it can help you to navigate from desolated cities to HIGHER GROUND. Modules are from Hoffman's three academic majors 1) Graviton Mechanics 2) Material Transmission and 3) Time Distortion. Unlock your modules and use them effectively.<br/><br/><strong>Randomized City.</strong><br/>HIGHER GROUND supports progressive random map generation. In challenge mode, the map and weather will continuously change each time with preset difficulty. In campaign mode, random seeds are fixed so you can practice your basic navigation skills.", "metacritic": null, "released": "2018-07-25", "tba": false, "updated": "2019-08-28T21:57:03", "background_image": "https://media.rawg.io/media/screenshots/51f/51fbff29946841d666f5d08e9e5cce3d.jpg", "website": "https://ledooykedooy.wixsite.com/mysite/higher-ground", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 280, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Yeong Beum Lee"], "genres": ["Action", "Adventure", "Racing", "Indie"], "publishers": ["RUBIEST GAMEZ"], "esrb_rating": null}