{"id": 629931, "slug": "gun-abundanzza", "name": "Gun Abundanzza", "name_original": "Gun Abundanzza", "description": "<p>My first working try to make a random dungeon generator, mixed with an auto aim system, with a switch button, if needed.<br/><br/>This far I have the basic logic for the MOOB enemy (MObile OBject type) not so clever. Wanders around if the player is near and chases him when he gets closer.<br/><br/>The logic for showing the damage done are ready too, just need to add the damage code for both the enemy and the player. And then, to expand the type of enemies you will face.<br/><br/>Right now I want help to test the performance of the game on different mobile devices, since my phone was born old. Thanks a lot for your help<br/><br/>Second enemy is ready now: Sneakers. They move in camo so you can't hurt them while they move. When they finally show themselves, is to shoot you.<br/>---------------------------------------------------------------------------<br/>Mi primer intento de hacer un generador de mazmorras aleatorias que si funciona, mezclado con sistema de auto mira, y un botón de cambio, por si acaso.<br/><br/>Hasta este momento tengo la lógica básica para el enemigo simple, no muy brillante. Camina sin rumbo si el jugador está cerca, y comienza a perseguirlo si se acerca aún más.<br/><br/>Me gustaría un poco de ayuda para probar el desempeño de el juego en diferentes dispositivos móviles, ya que mi celular está algo viejo. Muchas gracias por su ayuda.</p>\n<p>Segundo enemigo listo: Acechadores. Se mueven usando camuflaje así que no los puedes dañar mientras se mueven. Cuando se muestran, es para dispararte.<br/><br/></p>", "metacritic": null, "released": "2021-06-27", "tba": false, "updated": "2021-07-02T14:58:55", "background_image": "https://media.rawg.io/media/screenshots/7db/7db4847113d0bd83ec6c3f2e45c0911f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 29, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "Web"], "developers": ["oscuridad666"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}