{"id": 630060, "slug": "deadly-dice", "name": "Deadly Dice", "name_original": "Deadly Dice", "description": "<p>Deadly Dice is an arcade style game where you shoot flying dice to gamble for your life. </p>\n<p>You play as a traveler who has stopped by the Deadly Dice Casino to take part in the ultimate gamble. Your goal? Shoot the flying dice to make them fall to the ground. Blue Dice add their number to your score while Red Dice subtract their number for the score. If your score equals the target score before the timer runs out, you win and move on to the next round. If not, you're dead.</p>\n<p>Move the traveler left and right with the A and D keys respectively and press the Space Key to jump. Use your mouse to aim with your cursor and click to shoot. When you hit a dice, it will fall to the ground and add or subtract to your score. While these aren't dice, they are not the dice you are used to - they're one sided! That's right, the number you see is the number you get, no tricks. Speaking of tricks, deadly black dice fall from the sky too, and if you don't shoot them before they hit the ground, they'll shoot out mini projectiles, so watch out!</p>\n<p>Can you survive the ultimate gamble and master the deadly dice?</p>\n\n<p>This game was made for the Mini Game Jam 83 with the theme of \"Dread\" and the requirement that dice must be a mechanic in some form. I didn't utilize the theme of dread as much as I originally planned, but it is still definitely present with the timer and instant death mechanics when you fail or get hit by a projectile. All art was made by me within Game Maker Studio 2 and all sound was taken from Freesound.org.</p>", "metacritic": null, "released": "2021-06-26", "tba": false, "updated": "2021-07-02T15:34:33", "background_image": "https://media.rawg.io/media/screenshots/752/752b1114da46674713065a2a477042ec.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["benhen_26"], "genres": ["Action", "Shooter", "Platformer"], "publishers": [], "esrb_rating": null}