{"id": 630093, "slug": "agent-37", "name": "Agent 37", "name_original": "Agent 37", "description": "<p><em>Agent 37 – Collateral Damage</em> is a first-person story-based shooter that boasts a vibrant cyberpunk setting. The player takes on the role of the robot E37 tasked with one directive: destroy all the obsolete robots. E37 can move in a 3D environment and is equipped with a gun capable of swapping between two types of bullets: regular and explosive. Regular bullets will inflict damage to the enemy, while the explosive bullets create an explosion with damage on contact. These are used to unlock zones and defeat specific enemies. The gun’s iron sights can be used to aim more accurately.  The HUD shows both remaining health and ammo, and when the player takes damage, health is reduced. To recover health and ammo the player must “recharge” through a charging station and if the player is killed, it will respawn from the last checkpoint.  The player can upgrade their weapon to add new functions, like the explosive bullets, which will unlock new levels and new areas in the already explored sections allowing for faster backtracking and navigation.</p>\n<p>This was a student team project made in May 2020<br/></p>\n<p><strong>Team and Design Lead –Dipo Master</strong>\n</p>\n<p><strong>Production Lead - KRF</strong>\n</p>\n<p><strong>QA Lead – DTM</strong>\n</p>\n<p><strong>Art &amp; Audio Lead –NM</strong>\n</p>\n<p><strong>Tech Lead - DB</strong>\n</p>\n\n<p>WASD to move. Hold Left Shift to Run;<br/></p>\n<p>Left-mouse click to shoot, Right-click to aim;<br/></p>\n<p>Once unlocked:<br/></p>\n<p>Q  to change fire speed;</p>\n<p>E to change bullet type;<br/></p>", "metacritic": null, "released": "2021-06-26", "tba": false, "updated": "2021-07-02T15:43:14", "background_image": "https://media.rawg.io/media/screenshots/911/9111e9f67877adce9b26a4f1f47dfc89.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 14, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["D. Master"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}