{"id": 63017, "slug": "rafa", "name": "R.A.F.A.", "name_original": "R.A.F.A.", "description": "R.A.F.A. is a 3rd person view platformer happening in a solar system. <br/>\n<br/>\r\nExplore, jump, shoot and have some fun across space<br/>\n<br/>\r\nYou control an astronaut, he starts the game by appearing on a particular planet.<br/>\r\nThe planets have two different types of fuel (blue and green) and are distributed randomly on each half of a planet each.<br/>\r\nA single type of fuel is not very useful, it is required to accumulate both to give some use to it.<br/>\r\nFuel may be used to use a sort of railgun (sorry quake) and / or to power the astronaut jetpack.<br/>\r\nSo it is understood that you can freely explore the planet, dodging enemies and collecting score, and / or you can use the fuel acquired to try to travel to another planet.<br/>\r\nI mean “try” because fuel is not abundant and may not be enough to reach another planet. As the solar system is dynamic one must be cautious and try to wait for the moment your planet and your destination get as close as possible.<br/>\n<br/>\n<br/>\r\nWhat sets this project apart?<br/>\r\n\t- Indie development<br/>\r\n\t- Gameplay across an entire solar system (generated procedurally)<br/>\r\n\t- Sort of 16 bit Arcade style but in 3D.<br/>\n<br/>\r\n2 types of games modes, time attack and story mode.<br/>\r\n•\tIn time attack you will challenge yourself to explore all planets as quick as possible.<br/>\r\n•\tIn story mode you will find a new friend that will help you revealing mysteries around you.<br/>\n<br/>\r\nImportant regarding gameplay:<br/>\r\nR.A.F.A. is really simple, one button to shoot and one to jump....and if you maintain the jump for a while you will activate the jetpack.<br/>\r\nThere are some tutorial messages right before the action starts but If you have a fast computer maybe you wont see it ;)", "metacritic": null, "released": "2018-04-06", "tba": false, "updated": "2019-08-28T21:57:00", "background_image": "https://media.rawg.io/media/screenshots/266/26698a140ec4731a37530569493a33de.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 5}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 153, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Cristian Villalba"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Cristian Villalba"], "esrb_rating": null}