{"id": 63029, "slug": "species-artificial-life-real-evolution", "name": "Species: Artificial Life, Real Evolution", "name_original": "Species: Artificial Life, Real Evolution", "description": "Species: Artificial Life Real Evolution is an evolution simulator that allows you to create, destroy, observe and tinker with life on it's never ending, harsh march of refinement!  Simulated from the very first principles of evolutionary science:Variation <ul><li>Every creature is uniquely defined by its genes.</li></ul>Mutation <ul><li>Child creatures are slightly randomly modified versions of their parent(s).</li></ul>Natural Selection <ul><li>The environment affects every creature in their struggle to survive.</li></ul>Observe or GuideWhether you just want to observe, watch and study as the tree of life constructs itself from a single species, or you want to be an active influence on the development of the species in the game, the choice is up to you!  Take a hands-on approach by using the nursery, an isolated area where you can tinker with the gene pool to your heart’s content.  Use rovers to decide which creatures get to eat today and which ones starve!  Create global catastrophes like an ice-age or a world-spanning flood to weed out the most vulnerable species.  Or simply sit back and watch the life-and-death saga unfold!<br/><br/>Tell Your StoryHowever you treat your evolutionary sandbox, we give you the tools to tell it’s story!  View every single evolutionary step in detail using the clade diagram, see where each species are living using the satellite map, get a better picture of how varied your gene pool actually is with the web of life, and view every possible detail on each creature using the creature inspection tools.<br/><br/>", "metacritic": null, "released": "2018-09-28", "tba": false, "updated": "2019-09-04T12:50:53", "background_image": "https://media.rawg.io/media/screenshots/4e4/4e4011158d42196d2dddca091174f8c5.jpg", "website": "http://www.speciesgame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 7, "toplay": 1, "dropped": 3}, "playtime": 4, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 300, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["Quasar"], "genres": ["Simulation"], "publishers": ["Quasar"], "esrb_rating": null}