{"id": 630533, "slug": "budis-revenge", "name": "Budi's Revenge", "name_original": "Budi's Revenge", "description": "<p>=========================ENG===============================<br/>Budi's Revenge is a game which the gameplay is based by \"Kingdom Heart Re: Chain of memories\". Player fight with card, combine different card to use different skill, use the card number to counter the enemy., also this game have cutscene (low budget) story.<br/><br/>Reminding you again this is based by Kingdom Heart Re: Chain of Memories, i love the game and im curios about the system and want to make it for the purpose of learning.<br/><br/></p>\n<p>How To Play  :<br/>1. First phase is build your deck, every card have their own card point (CP) and every level have max cp. every card have their own move, sword, fire, freeze and heal.</p>\n<p>2. you can combo your card in- game so check the \"Combo List\" button and think the right combo</p>\n<p>3. after you finish the deck by pushing the Finish Deck button you fight with waves of enemies</p>\n<p>4. Left click to play 1 card and perform a move from the card, The number of the card is important to decide who is playing, so when you play a card, the number of the card will appear, if the enemy play card number greater than you when you play the card you will get stunned and enemy will attack, if the enemy play card number is equal than you when your card is playing, both will get stunned and nobody attack, if the enemy play card number is less than you when your card is playing, the enemy will get stunned itself, same if you did to them.</p>\n<p>5. Right Click to insert card to combo card, when the combo card count is 3, the combo card based on 3 card will be played. the formula is from the combo list in the deck building phase, the number of the card will equal the 3 card you insert to combo card, (if you play 4, 6, and 8 it will be 4+6+8 = 18).</p>\n<p>6. Press R to cycle the target lock,</p>\n<p>7. Press F to toogle lock Target Camera.</p>\n<p>This is a prototype and will be buggy this time, sorry if this is not perfect and This game i made is for learning new things.</p>\n<p>=========================INDO===============================<br/></p>\n<p>Budi' Revenge adalah Game yang kubuat dari referensi \"Kingdom Heart Re:Chain of Memories\", iya yang game kartu kartu itu, seru banget aku suka banget ama gameplaynya, beda banget ama yang laen, nyerang nya pake kartu, kita sebagai player dipaksa fokus merhatiin kartu yang kita mainin, kartu yang dimainin musuh, dan keadaan sekitar char kita, apalagi pas Boss Fight, Fokusnya kerasa banget, yang bikin ini lebih seru lagi adalah kita bisa ngekomboin kartu kartu kita, memakai jurus jurus yang digabungin, memakai imajinasi kita buat clearing musuh secara cepat, dealing damage terbesar, dll. Nah karena aku suka game itu, aku penasaran sama sistem nya dan pengen bikin juga sekalian ngasah skill ngoding ku, terlintas di pikiran jadinya game ini deh hehehe \"Budi's Revenge\"</p>\n<p>Game ini ada cutscene nya hehe, maenin imajinasi dikit boleh kali biar ga bosen ngodingnya, ya walaupun keliatan ga niat soalnya ga ada waktu buat bikin bagus bagus wkwkwk, namanya juga masih belajar. </p>\n\n<p>Cara Main :</p>\n<p>1. Tahap pertama u bikin dek dlu, tiap kartu punya cp nya sendiri, dan tipenya macem macem, ada sword (attack), fire (sihir nembakin api), freeze (ngelempar bola es nyebar kyk shotgun), sama heal (ngeheal dirisendiri)</p>\n<p>2. bisa menggabungkan macem macem tipe kartu buat skill skill berbeda, dan bisa di cek di tombol \"Combo List\" di kanan atas sebelah finish deck. di situ tertulis semua kartu yang di kombinasikan beserta skill nya.</p>\n<p>3. abis mencet Finish dek kamu langsung mulai bertarung dengan musuhnya yang datang bergelombang</p>\n<p>4.Klik kiri untuk maenin 1 kartu dan bergerak sesuai tipe kartunya, angka di kartu penting untuk menentukan siapa yang nyerang, jadi kalo kamu lagi maen kartu, muncul angka kartunya nah kalo musuh maen kartu yang lebih besar pas kartu kamu lagi dimaenin, maka kamu kena stun dan musuh nyerang karna jumlah angkanya lebih besar yang kamu maenin (counter) , nah kalo kartu musuh sama dengan kartu yang lagi kamu maenin kalian berdua kena stun dan ga ada yang nyerang, kalo kartu musuh kurang dari yang kamu mainin, maka malah musuhnya doang yang kena stun begitu juga sebaliknya.<br/></p>\n<p>5. Klik kanan untuk masukin kartu ke combo card, kalo combo cardnya udah 3, combo kartu dari ketiga kartu tersebut akan dimainkan, kombo yang bisa di liat di tombol Combo List pas bikin dek awal, nah angka yang dimainkan adalah jumlah dari ketiga kartu yang kamu taruh di combo card, (kalo kamu masukin 4, 6, dan 8 jadi 4+6+8 = 18).</p>\n<p>6. Pencet R untuk ganti lock target.</p>\n<p>7. Pencet F untuk Ngelock target Kamera (Kamera fokus ke target itu).\r\n</p>\n<p>Game Ini masih prototype dan kalian akan jumpa banyak bug, jadi... maap wkwkwkwk</p>", "metacritic": null, "released": "2021-06-25", "tba": false, "updated": "2021-07-02T17:58:50", "background_image": "https://media.rawg.io/media/screenshots/8be/8be7772d9a389810c4c9fa46cc321969.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 102, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Barquest"], "genres": ["Action", "Strategy", "Fighting"], "publishers": [], "esrb_rating": null}