{"id": 63056, "slug": "squirrel-sphere", "name": "Squirrel Sphere", "name_original": "Squirrel Sphere", "description": "In this videogame, you play as a Squirrel Rolling in a Sphere<br/><br/>[ RECREATIONAL RODENT ROLLING ]<ul><li>Roll through 60 levels across 6 worlds, get to the goal while collecting the acorns!<br/></li><li>Use balloons, bounce on springs, ride on UFOs, pinball flippers, cannons &amp; other fun mechanics!<br/></li><li>Have a blast with friends in split-screen multiplayer!<br/></li><li>Tight camera &amp; controls allow precise trajectory &amp; control over your balled squirrel</li></ul>[ MULTIPLAYER SPLIT SCREEN ]Roll your balls with up to 3 friends (4 total). Work together to beat the main game &amp; compete for best scores. <br/>Multiplayer supports all levels, boss fights &amp; the Squirrel Glass Smash minigame. [ STORY ]Shadowtail has trapped all the squirrels inside balls, travel across the land to reach his hideout, defeat him, &amp; free the squirrels! [ 6 Unique Worlds ]<ul><li>Nut-Tree Forest - The native home of Squirrels, a comfy introduction to the game<br/></li><li>Arctic Mountain - Snowy Hills under the glimmering Northern lights, pop some balloons and enjoy the calm winter feel<br/></li><li>Haunted Woods - A sanctuary to ghosts and traps galore<br/></li><li>Acorn City - The bustling hub of planet Squirreltopia, take a ride on cars and scale skyscrapers, but watch your step<br/></li><li>Cosmic Galaxy - The dark corners of space where you will use everything you've learned so far and more<br/></li><li>??? - ?????</li></ul>[ CUSTOMIZE YOUR SQUIRREL &amp; DECORATE YOUR BALLS ]<ul><li>Change Sphere color, details (such as a cage or spikes), neon glow, &amp; trails.<br/></li><li>Personalize your squirrel with accessories like sunglasses, hats &amp; different colors<br/></li><li>Unlock new custom parts for your squirrel by finding &amp; collecting Squirrel Coins</li></ul>[ MINIGAME MADNESS ]Squirrel Sphere features many unique minigames to play in addition to the main game.<br/>Find the hidden retro game carts in the main game to unlock them!<br/><ul><li>Squirrel Smash - Break all the glass/objects, spans across many levels such as graveyard, Xmas tree, &amp; museum<br/></li><li>Squirrel Bowling - Knock over the pins in different lanes, you get one shot<br/></li><li>Sqiball- Roll into a Skiball table, try to earn the most points, you get 3 balls<br/></li><li>Squirrel Pinball - Play on a traditional Pinball machine<br/></li><li>Squirrel Basketball - Play hoops, try to get a squirrel swish!</li></ul>[ DANGEROUS BOSS FIGHTS ]Shadowtail has brought to life monsters &amp; built machines to stop you on your adventure. Each World is guarded by a fierce boss. You'll need to figure out their weak spot &amp; attack it for massive damage...[ REPLAYABILTY ]<ul><li>Each level &amp; minigame keeps track of your best score/time<br/></li><li>Try to find all the secrets &amp; collectables!<br/></li><li>Unlock cheats &amp; have some extra fun!</li></ul>[ THANK YOU FOR LOOKING! Try Squirrel Sphere today!]<br/>Note: This page may show non-final footage, all screens/video are subject to change", "metacritic": null, "released": "2018-06-29", "tba": false, "updated": "2019-08-28T21:56:58", "background_image": "https://media.rawg.io/media/screenshots/85e/85e908b3f577dbdd48afe35334fa3dc1.jpg", "website": "http://www.surrealdistractions.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 293, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Sean Davy"], "genres": ["Action", "Indie"], "publishers": ["Sean Davy"], "esrb_rating": null}