{"id": 630741, "slug": "complete-car-driving-simulator", "name": "Complete Car Driving Simulator", "name_original": "Complete Car Driving Simulator", "description": "REAL DRIVING EXPERIENCE<br/><br/>Enjoy the most realistic driving experience to the fullest with gorgeous graphics and impeccable feel! Become an expert on racetracks, ramps or just explore the vast city with Complete Car Driving Simulator! Take your pick among a plethora of high-performance vehicles and prove your skills.<br/><br/>LARGEST MOBILE MAP<br/><br/>Complete Car Driving Simulator is absolutely rewriting the standards of the gaming world with the largest mobile map as big as 5000x5000 meters!<br/><br/>BEST VEHICLES, BEST VENUES<br/><br/>Experience the unique driving experience in many areas from off-road to inner city, from airports to F1 racetracks, from specialized drift areas to harbours! With Formula, SUV, Super Sport and normal segment vehicle options to choose from, simply make your choice and start driving! Forget limits, there are none in this game. Test your skills and immerse yourself in your own unique adventure!<br/><br/>ADVANCED FEATURES THAT SIMPLY AREN’T THERE IN SIMILAR GAMES<br/><br/>Customize your own vehicles and share your wacky cars with your friends! You don’t want to miss this enhanced gaming experience courtesy of Complete Car Driving Simulator; with activities such as advanced AI races, manual gear selection and advanced steering, taxi missions, multiplayer games to keep you busy for as long as you please!<br/>Feel the real driving experience to the max with Complete Car Driving Simulator! So what are you waiting for? Buckle up and put the pedal to the medal already!", "metacritic": null, "released": "2021-06-02", "tba": false, "updated": "2021-07-05T02:43:43", "background_image": "https://media.rawg.io/media/screenshots/552/5522afc191c08950b3373aceb88ab243_FYkYmzn.jpg", "website": "https://www.oviostudios.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 249, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["OVIO STUDIOS"], "genres": ["Simulation", "Racing"], "publishers": ["OVIO STUDIOS OYUN YAZILIM VE PAZARLAMA ANONIM SIRKETI"], "esrb_rating": "Everyone 10+"}