{"id": 63078, "slug": "mayonez-dark-comedy-slav-adventure-rpg", "name": "Mayonez - Dark Comedy Slav Adventure RPG", "name_original": "Mayonez - Dark Comedy Slav Adventure RPG", "description": "A dark comedy adventure RPG, set in the fictional Slavic industrial town of Mayonez. <br/><br/>Story and Gameplay<br/>You find yourself in the dilapidated industrial town of Mayonez where you ended up unexpectedly after being used to a comfortable life in the West. Being unhappy with the current situation, you seek your way to the glorious leader’s office. The waiting list is long, but some citizens are willing to hand you their ticket in exchange for help. <br/><br/>These residents all have unique personalities that enrich Mayonez and make it slightly more alive. Characters are almost always eager to talk about the latest village scandals and ask for free help - sending you on quests! Quests can have different outcomes depending on your choices. You can learn new skills through our small RPG system that affects your dialogue choices, making every playthrough a little bit different.<br/><br/>The quests will send you through a non-linear story, with multiple locations such as the city, forest and farms that are always open to explore freely.  <br/><br/>Slav life is hard life<br/>As the focus is noticeably on Slavic culture, we’ve done a lot of research not just on modern life in Slavic countries, but also traditional customs and folklore. We find that it’s a highly underrepresented group of people that’s barely made itself known globally, so we hope to bring it a bit more attention.<br/><br/>In this world, reality and mythology are closely intertwined. Among regular folk lurk various well-known figures, such as Baba Yaga and Slavic gods.Stuff you can do and see<ul><li>Complex dialogue options and story branching<br/></li><li>Hand-drawn and animated world<br/></li><li>A dark and silly sense of humor<br/></li><li>Open exploration of Mayonez and its surroundings<br/></li><li>An array of interesting and unusual characters with unique quests<br/></li><li>A new take on Slavic culture<br/></li><li>Cool mini games<br/></li><li>Lots of mayonnaise! </li></ul><br/>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:56:57", "background_image": "https://media.rawg.io/media/screenshots/08f/08fbec89ebfcb1aefe80bf78abeb5275.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 152, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Tiny Mold"], "genres": ["Adventure", "RPG", "Casual", "Indie"], "publishers": ["Tiny Mold"], "esrb_rating": null}