{"id": 630726, "slug": "infinite-islands", "name": "Infinite Islands", "name_original": "Infinite Islands", "description": "Test your reflexes in an infinitely generated pixel art world! Enjoy the scenery with a working day/night cycle and weather system. Unlock new items in the ingame store. Play with one hand and try to beat your friends on the global leaderboards!<br/><br/>Infinite Islands is a pixelart platformer game where the goal is to survive as long as possible without hitting spikes or falling to your doom. This game requires fast reflexes and proper timing to master. Infinite Islands can be played with only one hand, leaving your other hand free for a variety of tasks, like eating a banana or holding a second phone with infinite islands installed.<br/><br/>[FEATURES]:<br/>-No advertisements or In-App-Purchases!<br/>-Free to play<br/>-One-tap gameplay<br/>-Compete against your friends on the global leaderboards<br/>-Collect gems ingame to unlock new app icons and themes<br/>-Hand created pixel art backgrounds and graphics<br/>-Dynamically changing day/night and weather system<br/>-Get one extra chance each round<br/>-Save your scores across multiple devices using game center<br/>-Unique soundtrack<br/>-Enter minimal mode by hitting the setting marked \"?\" to hide some of the menu buttons for a more immersive experience<br/>-Did I mention that this game has an infinite amount of islands? You may be starting to catch on to how I came up with the name<br/><br/>[HOW TO PLAY]:<br/>This game has simple controls, you get 2 jumps every time you touch the ground.  The longer you hold, the higher you jump! If you need to practice the mechanics click on the \"tutorial\" button to practice in a death-free environment.", "metacritic": null, "released": "2018-08-04", "tba": false, "updated": "2021-07-05T02:36:32", "background_image": "https://media.rawg.io/media/screenshots/955/9553ec37980d1dc338177b6f22629fc2.jpg", "website": "https://gavinshrader.com/infinite-islands", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 136, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Gavin Shrader"], "genres": ["Casual"], "publishers": ["Gavin Shrader"], "esrb_rating": "Everyone 10+"}