{"id": 630736, "slug": "solitaire-pet-haven", "name": "Solitaire Pet Haven", "name_original": "Solitaire Pet Haven", "description": "Play the most fun and relaxing TriPeaks Solitaire with beautifully crafted levels as you restore Pet Haven to its former glory! Clear fun levels to rescue cute pets, build homes for them, add decorations for each pet, and design your Pet Haven exactly like how you want it! Discover the amazing story-line of Katy's life, mend broken family ties and maybe, find love along the way!<br/><br/>So, what are you waiting for? Your furry friends and possibly, the love of your life, are waiting for you! Jump right in and start your pets filled adventure! Download Now!<br/><br/><br/><br/>Game Features:-<br/>• RENOVATE the rundown Pet Haven to a glorious paradise for pets!<br/>• DESIGN the Pet Haven to look like exactly how you want it, EXPRESS YOURSELF!<br/>• ENJOY fun and challenging TriPeaks solitaire experience anytime, anywhere <br/>• EXPLORE the story of Katy’s life with all the twists and turns and the drama!<br/>• ADOPT the most adorable pets like a dog, cat, macaw, rabbit and many more!<br/>• BEAUTIFUL and perfectly designed levels with Unique and Interesting layouts<br/>• LOVE all the different characters from Katy to her dad George, or the potential love interest Rafael or the town’s snooty Mayor Billy Rich!<br/>• BUILD the best Pet Haven! With many areas to renovate and decorate and endless expansion, build the best version of your Pet Haven, just the way you want it!<br/><br/><br/><br/>Solitaire Pet Haven is the best solitaire game you can play! Say goodbye to boredom and a big hello to endless fun and relaxation! Give your brain an exercise as well by clearing the challenging levels! Don’t wait, Download Now!", "metacritic": null, "released": "2021-06-16", "tba": false, "updated": "2021-07-05T02:41:03", "background_image": "https://media.rawg.io/media/screenshots/3f7/3f70300b1d5396b048d9269b8d19c6be.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 183, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["PLAY GAMES24X7 PVT"], "genres": ["Card", "Puzzle"], "publishers": ["PLAY GAMES24X7"], "esrb_rating": "Everyone 10+"}