{"id": 63077, "slug": "pegasus-5-gone-astray", "name": "Pegasus-5: Gone Astray", "name_original": "Pegasus-5: Gone Astray", "description": "<strong>Features:</strong><br/><br/><ul><li> Follow an intense and thrill-inducing sci-fi story set in outer space!<br/></li><li> <strong>Choices matter</strong> – The choices you make have an impact on events in the story, how other characters feel about you, and who survives in the end.<br/></li><li> <strong>Relationship building</strong> – What you choose to say or to do will cause you to win or lose reputation with your fellow crewmates.<br/></li><li> <strong>Romance</strong> – A chance to develop a romantic connection with the female crew members.<br/></li><li> <strong>Skills Specialisation</strong> – Your Medicine, Engineering, Athletics, and Charisma attributes will open up some new dialogue options and interactions with the world, but you will need to decide which of them to specialise in or whether to simply be a jack of all trades.<br/></li><li> <strong>Morale is your currency</strong> – Making progress and winning trust will increase your morale, which is required for completion of the more technical and challenging tasks.</li></ul><br/><br/><strong>Synopsis:</strong><br/><br/>You are Edan Vargas, a new member aboard Pegasus-5 Trade Ship. The ship is set to make a pretty standard trade route with only a small detour to sell a special rare item. However, before long after departure, the crew wakes up to discover that many of the ship’s systems have been compromised and they are lost in space, unable to establish exactly where they are and how far they’ve gone off the course. Who aboard is responsible for this and why?<br/><br/>As the new guy aboard, you’ll have to build trust with your crewmates and develop friendships with them, for their loyalty can be very invaluable in what you are going to face. You may even build romantic relationships with some of them!<br/><br/>The journey ahead will be a harrowing one. You will make stops in unfamiliar locations, tackle environmental hazards, and get hunted by organized gangs operating in space. Apart from your crewmates, you also have your unique talents to help you out, and you will need to decide which of those talents to specialise in if you are to get through this in one piece. Your choices will affect how your teammates feel about you, how certain events will develop, and even who survives at the end!<br/><br/>Good luck, brave adventurer, and godspeed, for you will need it!<br/><br/>", "metacritic": null, "released": "2018-07-11", "tba": false, "updated": "2019-08-28T21:56:57", "background_image": "https://media.rawg.io/media/screenshots/3dd/3dd85611521438ee3e65ec16400f74fd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 302, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Astronomic Games"], "genres": ["Adventure", "RPG", "Casual", "Indie"], "publishers": ["Astronomic Games"], "esrb_rating": null}