{"id": 63075, "slug": "stick-arena", "name": "Stick Arena", "name_original": "Stick Arena", "description": "Stick Arena Dimensions is the latest and greatest of the epic classic multiplayer Stick Arena by XGen Studios. <br/><br/>Controlling a single stickman, you must compete against other players in intense online deathmatches. Starting armed with nothing but your bare hands you must explore the levels and collect new weapons to take down your opponents with The Flamethrower, Chain Gun or Railgun or even kick it old school with the original AK-47, Shotgun or sledgehammer.  Please note some of these weapons require micro-transaction purchases and will not be available in the free version of the game.<br/><br/>Moving around levels and attempting to destroy other players through kills, the winner becomes the player with the most kills in the allotted time. You can join a game anytime and start fighting!<br/><br/>The graphics are retro, and the gameplay is intense, you won't want to quit until you are the first place on the leaderboard!<br/><br/><strong>Key Features</strong><br/>•\tOver 15+ weapon choices (Certain weapons require a purchased Lab Pass)<br/>•\tBattle it out in existing settings such as the Space Lab, Sky Island &amp; void maps, or classic office construction yard and sewer settings<br/>•\tOr create your vicious arenas of death using a robust map editor (Available through micro-transactions purchase)<br/>•\tCreate a free account to customize your character, save your combat stats and earn higher ranks<br/>•\tEarn credit to purchase new spinners, pets and map slots<br/>•\tClimb the leaderboard in a bid for 1st place", "metacritic": null, "released": "2018-07-24", "tba": false, "updated": "2019-08-23T12:11:40", "background_image": "https://media.rawg.io/media/screenshots/541/541f9813221a4bb868f03cdf0f2d30ff.jpg", "website": "http://www.xgenstudios.com/play/stickarena", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 91}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 167, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["XGen Studios"], "genres": ["Action", "Indie"], "publishers": ["XGen Studios"], "esrb_rating": null}