{"id": 630817, "slug": "vamp-ramp", "name": "Vamp Ramp", "name_original": "Vamp Ramp", "description": "Leaderboard\r\n<p>Post a pic of your high score in the comments to be added here!\r\n</p>\r\nRank\r\nName\r\nScore\r\n1-\r\nDarzington (the dev)\r\n13310\r\n2-MorganQ556\r\n\n\n<p>Have you been waiting all these years to play Bop-It, but reimagined as a video game featuring the coolest skateboarding vampire? Wait no longer!<br/><br/><br/></p>\r\nThe Story\r\n<p><strong>Vamp </strong>had a genius idea: he could suck blood from beautiful babes so much faster if he had some sweet wheels. So he's hopped on his great grandpappy's enchanted skateboard, and taken to the streets in the cover of night. But with great power comes great responsibility, and great danger! The faster he skateboards, the faster various obstacles speed towards him. Will he be able to react and use his vampiric powers fast enough to stay safe and get to those babes?<br/></p>\r\nHow to Play\r\n<p>Press the button displayed to use your vampire powers and deal with the oncoming obstacles. You can listen to the audio prompts to know which action to take.</p>\n<p>When you encounter a <em>babe</em>, mash the displayed button to suck blood and regain health.</p>\n<p>Pay attention, because after a while the button prompts are hidden and you must remember how to use each power.</p>\n<p>As the game speeds up, try to survive as long as possible to get a high score!<br/><br/><br/>The Mac build isn't tested because I only have a PC, sorry!!<br/><br/></p>\r\nThe Jam\r\n<p>Vamp Ramp was made over 10 days for the Bingo Jam, and met the following tropes for a bingo score of 24/25 :</p>\n<ol><li>Game name is a pun, alliteration, wordplay, or includes the theme or jam name\r\n</li><li>Provide extensive lore/backstory on the itch page\r\n</li><li>Do not include a main menu\r\n</li><li>Use Kevin McLeod music</li><li>Use Kenney assets\r\n</li><li>Make home-recorded sounds</li><li>Use disjointed art asset styles\r\n</li><li>Use the default Unity skybox somehow (fall through a pothole to see it!)</li><li>Make a janky player character animation\r\n</li><li>Font is Comic Sans</li><li>Include a box/rock pushing puzzle\r\n</li><li>Post WIP images/gifs in the Discord\r\n</li><li>Hide an easter egg</li><li>Give the exe/zip and the game different names\r\n</li><li>Hint at a feature, but apologize in-game for running out of time\r\n</li><li>Esc button quits the game \r\n</li><li>No failure/death screen, game just restarts\r\n</li><li>Player can fall out of the world, especially when they don't expect it\r\n</li><li>Game crashes (ideally not in a way that prevents winning)\r\n</li><li>Post the final game submission in the Discord\r\n</li><li>Include a sweet gameplay gif on the itch page\r\n</li><li>Upload an untested build for a system mentioning that you don't have access to it (i.e. Mac users post a PC build, and vice versa)\r\n</li><li>Submit the game within 1 hour or less of the deadline\r\n</li><li>Include a cat in the game<br/> FREE SPACE - Submit to the jam\r\n</li></ol>", "metacritic": null, "released": "2021-07-04", "tba": false, "updated": "2021-07-05T03:10:43", "background_image": "https://media.rawg.io/media/screenshots/97d/97d83199df317e3503e820eb1cab115c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 18, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Web"], "developers": ["Darzington"], "genres": ["Action"], "publishers": [], "esrb_rating": null}