{"id": 630804, "slug": "bin-go", "name": "Bin-Go!", "name_original": "Bin-Go!", "description": "Bin-Go!\r\n<p><strong><em>In a world full of rubbish, one man wants to take out the trash!</em></strong></p>\n<p>Bin-Go! is an action-packed adventure game, allowing the player to fulfil their dreams of working as a binman. As the Binman, you must take out the bins, feed energy to the incinerator, and stop evil!</p>\n\n<p><strong>Context:</strong><br/></p>\n<p>Mr Bin Mann, Born July 4th 1973, lived in an unknown country in an unknown province. One thing was sure though. There was a lot of bins, and a need for them to be emptied. Mr Mann spent his childhood learning the methods of Garbage collection from his master, Mr Garb Age. At 18, Bin Mann started his long career in Garbage collection, and hasn't looked back since.</p>\n<p>Incinerator Plants are a perfect way of generating electricity (if not for all of it's imperfections). The idea of powering a nation using their waste sounds very appealing, especially to the entrepreneurial Binman. In the Bin-Go! extended universe, all power is generated by such means.</p>\n<p>Disclaimer, do not try to resurrect your beloved pet using 20,000V of electricity, no matter how cherished they were. </p>\n<p><strong>More Context:</strong><br/></p>\n<p>This game was made by Ned Reid over two days for Bingo Jam. In this jam, we were tasked to fulfil 25 bingo slots for our jam game, and this manages all 25*!!!!</p>\n<p>After finishing this game, be sure to shout \"BINGO!\", as you have reached the jackpot. A full list of the 25 Game Jam tropes this game includes can be found here.</p>\n<p><strong>Controls:</strong><br/></p>\n<ul><li>WASD - Move</li><li>Space - Interact</li><li>O - Restart</li><li>P - Pause</li><li>Esc - Quit</li></ul>\n\n<p><strong>Content Warning:</strong></p>\n<ul><li>Blood/Gore</li><li>Mistreatment of animals</li><li>Flashing lights</li></ul><p>There is also a build written in Casio Basic for Casio CG-series calculators. Please be aware that I have not tested this, and there is no assurances that the game will work.</p>", "metacritic": null, "released": "2021-07-04", "tba": false, "updated": "2021-07-05T03:06:46", "background_image": "https://media.rawg.io/media/screenshots/385/38521aaf7c90ab35daa26f98e77e156b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 67, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ned Reid"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}