{"id": 630860, "slug": "avventure-dellaltro-mondo-aam-italian-version", "name": "Avventure dell'altro mondo (AAM) - Italian Version", "name_original": "Avventure dell'altro mondo (AAM) - Italian Version", "description": "I giochi di ruolo non devono per forza intimidire!\r\n<p>Leggere manuali giganteschi e prepararsi per ore può essere divertente, ma cosa succede se vuoi fare una partita all'ultimo minuto? O se per te questo genere è una novità e vuoi solo un assaggio veloce? O se vuoi solo far conoscere ai tuoi figli i giochi di ruolo usando qualcosa di veloce e divertente?<br/></p>\n<p>Abbiamo una soluzione a tutto questo: <strong><em>Avventure dell'altro mondo</em></strong>.</p>\n<p><strong><em>Avventure dell'altro mondo</em></strong>, o <strong><em>AAM</em></strong>, è un adattamento del popolare Fate Edizione Accelerata che condensa tutta la flessibilità e la potenza di Fate in una formula versatile e facile da leggere.</p>\n<p><strong><em>AAM</em></strong> ti permette di vivere le avventure dei tuoi libri, film e serie televisive preferite, o di creare un mondo completamente nuovo con i tuoi amici. E la preparazione è così semplice che potrete giocare in pochi minuti!</p>\n<p>Che per te sia la prima o l'ennesima volta che giochi a un GDR, <strong><em>AAM</em></strong> avrà qualcosa di speciale per te.</p>\n\n<p>Ideato da Alain Dellepiane per la LocJAM e sotto licenza Creative Commons Attribuzione - Non commerciale 4.0 Internazionale. Quest'opera si basa su Fate Sistema Base e Fate Edizione Accelerata (disponibili all’indirizzo http://www.faterpg.com/), prodotti da Evil Hat Productions, LLC, sviluppati, scritti e modificati da Leonard Balsera, Brian Engard, Jeremy Keller, Ryan Macklin, Mike Olson, Clark Valentine, Amanda Valentine, Fred Hicks e Rob Donoghue, e concessi in licenza per il nostro uso ai sensi della licenza Creative Commons Attribuzione 3.0 Unported (https://creativecommons.org/licenses/by/3.0/deed.it). Le immagini utilizzate in questa opera sono prese dal Digital Comic Museum. Si ritiene che siano di dominio pubblico negli Stati Uniti poiché sono state riprodotte da un libro o documento per il quale si sostiene che il copyright sia scaduto negli Stati Uniti.</p>\n<p>L'opera è stata tradotta in italiano dal team Tetri5 per la LocJAM RPG.</p>", "metacritic": null, "released": "2021-07-04", "tba": false, "updated": "2021-07-05T03:21:10", "background_image": "https://media.rawg.io/media/screenshots/00a/00ae9d6fe2de8a5ecac1497e851dcfe3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 123, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Tetri5", "Timehusk", "Saeglopur", "Lucifer M.", "alliecice", "bananaword"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}