{"id": 630932, "slug": "on-a-cliff-edge-prologue", "name": "On a Cliff Edge: Prologue", "name_original": "On a Cliff Edge: Prologue", "description": "<p>\"On a Cliff Edge\" is an interactive story set in a fictional setting ravaged by the effects of rising sea levels. You will play as Elesha's inner voice, supporting her and assisting her as she navigates the sinking island of Eerlond. </p>\n<p>The Prologue is an introduction to Elesha and her character. You will explore her dreamscape, learning more about her desires, her fears, and her personality.  In future chapters,  you will guide her through the decisions that will shape the fate of herself, her brother, her community, and perhaps even the island of Eerlond itself.</p>\n<p><strong>CW</strong>: Climate Catastrophe; Anxiety; Violence</p>\n<p><em><strong>Note from the author:</strong></em><br/></p>\n<p><em>\"Ello, so I'm James, the writer of \"On a Cliff Edge\". I've been working hard on this for about 6 months now while working full-time as a game writer for Wolcen Studio. It has taken longer than I'd like, but I hope to write future chapters more quickly in the future, and when each one is finished I'll just update the game to include them. Oh, and if you enjoy the experience, please let me know in the comments, or email me (james.symondnicholls@gmail.com). If you don't enjoy it, I would love to hear why so I can take that feedback into the writing of future chapters. Also, if you want to check out some of my other writing, please visit my website: https://jnichollsgamedesigner.wpcomstaging.com/ </em></p>\n<p><em>Cover art is by Ephraim Johnson. He's also a great writer and I have the pleasure of working with him at Wolcen so please go check out his website: https://courageouscotinga.tumblr.com/. Twitter: @bravecotinga\"</em><br/></p>", "metacritic": null, "released": "2021-07-04", "tba": false, "updated": "2021-07-05T03:38:59", "background_image": "https://media.rawg.io/media/screenshots/514/514d3c1fd8ab4c6cc78316c6a112a1e2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 93, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Jimothy"], "genres": [], "publishers": [], "esrb_rating": null}