{"id": 630930, "slug": "plumbing-crash", "name": "Plumbing Crash", "name_original": "Plumbing Crash", "description": "Plumbing Crash trata-se de um puzzle em 2D, onde os jogadores têm como desafio ligar os canos de saída e de chegada de água, através de outros canos que estarão em cena e alguns que os jogadores entraram na cena, onde a canos que podem ser movimentados, rotacionados ou serem estáticos. \r\n\r\nNo início um timer é acionado e ao fim desse tempo, a água é acionada a partir da cano de saída, e quando a água chega ao cano de chegada, os jogadores vencem e ganham pontos, caso a água não chegue os jogadores perdem e não ganham nenhum ponto.\r\n\r\nAlguns canos podem apresentar um Power Up, onde a água ao passar por este cano trava o progresso d'água por um determinado intervalo dando tempo para se concluir o trajeto.\r\n\r\nEntão chame seus amigos para uma empolgante partida, onde em pouco tempo vocês já estarão se divertindo.\r\n\r\nOnde juntos, sua equipe deve pensar rápido para formar uma estratégia, guiar a água para o final e completar o desafio!\r\n\r\nUse os canos especiais para congelar a água e ganhar tempo!\r\nTrabalhe ao redor dos canos estáticos, que podem tanto te atrapalhar, como salvar a rodada.\r\nUtilize canos extras para resolver o problema.\r\nCanos com várias saídas podem facilitar a sua vida!\r\nMas cuidado! Eles também podem dificultar o seu controle sobre a água", "metacritic": null, "released": "2021-07-04", "tba": false, "updated": "2021-07-05T03:38:35", "background_image": "https://media.rawg.io/media/screenshots/c3f/c3ff3515e1b4513de608e201ae231c2e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 176, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Andi BD", "Artur Nista"], "genres": ["Strategy", "Puzzle"], "publishers": [], "esrb_rating": null}