{"id": 63109, "slug": "rising-lords", "name": "Rising Lords", "name_original": "Rising Lords", "description": "<strong>Rising Lords</strong><br/><br/>Rising Lords is a medieval turn-based strategy game with card and board game elements. Send your serfs to fight and die in your name... or let them prosper, and use them to your advantage!<br/><br/>Collect taxes and resources. Dictate rations and field work. Forge weapons, reshape the battlefield, raise armies, and build mighty fortified cities. Help your people become knights, or dump them on a battlefield far away, but be careful: even the most humble peasants will revolt eventually…<br/><br/>In addition to its campaign mode, Rising Lords features robust multiplayer functionality. Play a quick game, or settle in for an evening or more. Play mind games with your friends with Rising Lords’ advanced social interactivity, and let them pay for their insolence in questioning your right to rule!<br/><br/><strong>Features</strong><br/>●\t<strong>Find the perfect balance</strong> - juggle production, resource gathering, diplomacy and treason, tax and rations - all vital in the success of your provinces<br/>●\t<strong>Strategic battles</strong> - besiege your enemy’s cities to starve them out, go all-out attack, or wait for them to come to you<br/>●\t<strong>Up to 4-player simultaneous multiplayer</strong> - no need to wait for each individual player to take their turn<br/>●\t<strong>The psychology of war</strong> - Play mind games with your opponents with advanced social interactions <br/>●\t<strong>Subtle variables </strong>- Morale, terrain and fortifications have a huge impact on battle, and the tide can turn quickly<br/>●\t<strong>Customisation</strong> - Tailor your leader’s look and skills, and craft your perfect cities and troops<br/>●\t<strong>Risks and opportunities</strong> - React to figures that visit your province. Find ways to take advantage, and work quickly to eliminate threats!<br/>●\t<strong>Take your pick</strong> - React to 50 different events and collect unique cards to surprise your enemy!", "metacritic": null, "released": null, "tba": false, "updated": "2023-09-09T13:57:26", "background_image": "https://media.rawg.io/media/screenshots/23e/23ef892e8f7fe33371afcec686d3cd91.jpg", "website": "https://www.Argonwood.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 26, "toplay": 5, "dropped": 1}, "playtime": 2, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 295, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Argonwood"], "genres": ["Strategy", "Indie"], "publishers": ["Argonwood"], "esrb_rating": null}