{"id": 631077, "slug": "escape-the-house-of-hell-point-click-adventure", "name": "Escape the House of Hell: Point & Click Adventure", "name_original": "Escape the House of Hell: Point & Click Adventure", "description": "<p>Escape the House of Hell is a first person point and click graphic puzzle adventure, similar to games you may have played in the ’90’s or similar to a virtual escape rooms you may have played. A simple gameplay interface consisting of the world that you explore and an inventory panel where you can collect, combine and use items you find along the way to solve puzzles.\r\n</p>\n<p>Explore areas, collect hidden objects and take in your surroundings. You will need all of your puzzle solving skills to put together a plan to make your way through the house, solving riddles and down the many paths..\r\n</p>\n<p>How you tackle the puzzles is down to you. Each puzzle has a logical solution, so take your time, there is no rush and enjoy the process of understanding what you have to do.\r\n</p>\n\r\nFEATURES:\r\n<ul><li>Simple, intuitive point and click tap-to-play gameplay</li><li>Beautiful 3D, original graphics with over 70 interactive scenes</li><li>Captivating and unique story – excite your imagination!</li><li>Future updates to improve play and interactive new elements</li><li>Compatible with all devices</li></ul>\n<p>Escape the House of Hell is one of a number of adventures.</p>\n\n<p><em>Thanks for supporting original, British made, independent game development – your feedback is much appreciated!</em></p>", "metacritic": null, "released": "2021-07-04", "tba": false, "updated": "2021-07-05T04:19:57", "background_image": "https://media.rawg.io/media/screenshots/976/976c10b0ec802fdf4c4669e2a6610bf3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 329, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["M9 GAMES"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}