{"id": 631159, "slug": "jet-iv-isekai-project", "name": "JET IV: Isekai Project", "name_original": "JET IV: Isekai Project", "description": "<p>The fourth game in the RTF Series.</p><p>An elderly man who loves to fish is whisked away to a strange fantasy world. What does he do there? Go fishing, of course.</p><p>This game has no combat. Instead, it has a basic fishing minigame. The overwhelming majority of the game's content is simply reading text, to the point where you could almost get away with calling this a visual novel. It's also the fourth game in the series, meaning that if you are unfamiliar with the previous games, you may not get as much entertainment out of it, though if you are interested, please go ahead and play it anyway.</p><p>Thank you to Bukarett for the use of their fish sprites. I couldn't have made this game without them.</p><p>CONTENT WARNING - This game features some minor sex talk and sex jokes, as well as allusions to and depictions of cruel and extreme violence. There's also an alcohol reference in a joke at one point. If you're a minor, or somebody who is averse to the above content, you've been warned.</p><p>This game was made for the fourth (You)RPGM Game Jam! Go check out the other entries, too! This is also the fourth entry in the RTF series: Check out the other games while you're here:</p><p>If Jet Got a Girlfriend: https://minkulus.itch.io/jetgf<br/></p><p>Emilia and the Endless Winter: https://minkulus.itch.io/emilia</p><p>The Sixth Sentinel and the Dark Lord: https://minkulus.itch.io/sixth</p><p>Alrighty, I think that's everything! Please enjoy this game responsibly!</p>", "metacritic": null, "released": "2021-07-04", "tba": false, "updated": "2021-07-05T04:39:43", "background_image": "https://media.rawg.io/media/screenshots/812/81252ff8d465e04a3de4745a6639b2c1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 106, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["minkulus"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}