{"id": 631364, "slug": "halloween-night-gacha", "name": "halloween night gacha", "name_original": "halloween night gacha", "description": "<p>halloween night gacha</p>\n<p>This is my first game, a halloween themed gacha style world exploration. A lot of time was spent on the environment building, gameobject placement, scripting, proofreading.</p>\n<p>This game has a simple objective which can be accomplished in less than 5 minutes, to reach level 10 and gain 200XP without losing life. In every house there is a hidden interactable item which will be revealed as the player crosses the perimeter.  The players stats will change accordingly as you interact with 4 items. The 4 particular items are:</p>\n<p>Candy: +10XP</p>\n<p>Soda: +20Health</p>\n<p>Tainted: -20Health</p>\n<p>Pumpkin: Varies: +60Health(2.5%), +40 Health(13.5%), +20Health(34%), -20Health(34%), -40 Health(13.5%), -60Health(2.5%).</p>\n<p>At any time you can pause or reload the game with the on screen buttons at the top right corner. The credits can be clearly seen on the pause scene.</p>\n<p>I had fun making this, I hope you have as much fun playing this. I will work on more games in the future as gain more knowledge of the nuances of programming and game engines.</p>\n<p>I do not own any of the unity assets, font or the music. The unity assets I used are free, and the use is covered under EULA and licensed to my unity account for personal use. The author of the font Nishiki Teki states on the official download page: \"Feel free to use for your creative works and other purposes.\", and on the official YouTube music video for Happy Haunts, where my background derives, states \"You're free to use this song and monetize your video.\". In the folder there will be a document crediting the property that I do not own. If there are any problems of my usage or distribution of the assets, please contact me at presidentofterre@gmail.com.</p>", "metacritic": null, "released": "2021-07-03", "tba": false, "updated": "2021-07-05T05:40:20", "background_image": "https://media.rawg.io/media/screenshots/a7f/a7f0ea62abe4ab66aaf8759f61af479e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 37, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["shiromune"], "genres": [], "publishers": [], "esrb_rating": null}