{"id": 631490, "slug": "prototype-breakout-rpg", "name": "Prototype breakout RPG", "name_original": "Prototype breakout RPG", "description": "<p><strong><em>Public ALPHA is now OPEN.</em></strong></p><p>Kitsune Lab will like to present to you a prototype game.</p>\n<p>I have taken the concept of the breakout game and turned it into an RPG. The basic story is the player is a Psyonist that uses psychic powers to fight enemies in their mind-scape. The story is a work in progress and is not present in this prototype engine.</p>\n<p>The purpose is to use the mouse (On PC) or you can tilt (Android phones.) to control a paddle. Your aim is to bounce the energy ball around to collect energy to attack with. You have a chance to collect ability shards to learn new elemental attacks.</p>\n<p>Each map is procedurally generated so you get a random map every time. </p>\n<p>Created using GameMakerStudio 2.3</p>\n<p>EXE file is untested on other types of window products.</p>\n<p>APK should be compatible with android 7 and above.</p>\n<p><strong>Please note:</strong> This is a<em> PROTOTYPE. </em>There are many bugs present and the game is incomplete. Only the first level is implemented. art is NOT final. it is just placeholder art as I program.</p>\n<p>Known bugs: Collision is not perfect and there is code in place to reset the ball position if the ball becomes 'stuck'.</p>\n<p>Please note any bugs and consider donating to help this project to grow.</p>\n<p>Many features set for updates. Please leave any positive and helpful feedback.</p>\n\n<p>Update log:</p>\n<p>7/2/21 Prototype 0002 released for public testing.</p>", "metacritic": null, "released": "2021-07-03", "tba": false, "updated": "2021-07-05T06:15:45", "background_image": "https://media.rawg.io/media/screenshots/56c/56c7a4556c5b91179ef131ef8a097000.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 40, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Android"], "developers": ["Hakuzo"], "genres": ["RPG", "Puzzle"], "publishers": [], "esrb_rating": null}