{"id": 63143, "slug": "achievement-machine", "name": "Achievement Machine", "name_original": "Achievement Machine", "description": "Achievement Machine is a colorful clicker game for those who wants not only to get tons of achievements in no time, but also to enjoy real gameplay and various game modes!<br/><br/><br/><br/>We at Playloft don't like boring spamming games, but knowing your true love of achievements and interesting gameplay we've taken the liberty to make both colorful and enjoyable clicker game with lots and lots of achievements.<br/><br/>Rules: Click the icons to clear the game field. Every new click can bring you another achievement. There are some special icons hidden among the regular ones:<br/><ul><li>Explosive icons — explode the icons placed around them;<br/></li><li>Armed icons — extra strong;<br/></li><li>Energy icons – let you clear the whole row of icons.</li></ul><br/>Sometimes you can unlock one of the secret icons, that activate an additional game mode. Try to find them all!<br/><br/>A UNIQUE CLICKERAchievement Machine combines both achievement farming and fun gameplay with several modes - find a special icon on the field to start them.5000 ACHIEVEMENTSA simple and fun way to expand your collection with tons of new achievements. Decorate your Steam profile with amazing well-drawn icons!A SECRET ACHIEVEMENT #5000Did you think that it would be that simple? To get a secret achievement you'll need to give it your best shot. Let's see if you're lucky enough to unlock it!", "metacritic": null, "released": "2018-05-25", "tba": false, "updated": "2019-08-28T21:56:54", "background_image": "https://media.rawg.io/media/screenshots/505/505ee0c55d4f678383ff6e9bb0f365be.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 40, "toplay": 1}, "playtime": 1, "achievements_count": 5000, "ratings_count": 0, "suggestions_count": 56, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Playloft"], "genres": ["Casual", "Indie"], "publishers": ["Playloft"], "esrb_rating": null}