{"id": 63163, "slug": "horizon-sourcetian-ji-qi-yuan", "name": "Horizon Source(天际起源)", "name_original": "Horizon Source(天际起源)", "description": "This is a free-to-play survival game which supports 100 players in a game.<br/>After the game starts, 100 players will be dropped to an abandoned island. The players need to search for equipment quickly from the surrounding buildings to enhance their viability. During the game, the player will play against all the other players, and surviving players will win the game.<br/><br/><ul><li>Background： </li></ul>After successfully invented the SUPER-SPEED Aircraft in 2100 A.D., the Community of Common Destiny decided to build a team of superheroes to explore the origin of life in the universe using SS Aircraft. Global elites are eager to apply to the best team, so the CCD is hosting a virtual-reality competition now. <br/>Competitors including soldiers, rangers, doctors, scientists, everyone is doing their best to pass the competition and join in the team. The winners of every 100 people are eligible to enter the final exploration team.<br/>Whether winners or losers, they all deserve our most respect from fighting for the origin and for the fate. Are you coming or not?<br/><br/><ul><li>Core play：</li></ul><strong>Equipment Collection </strong>: Players can enter the building to search for equipment or to look for airdrops in the scene.<br/><strong>Heroes and Skills </strong>: There are distinct divisions of heroes in this game, each hero has his own unique weapon and skills, a reasonable combination of heroes can strengthen the team's competitiveness.<br/><strong>Building Construction </strong>: Using construction to build fortresses or obstacles can diversify the tactics during the game.", "metacritic": null, "released": "2018-03-20", "tba": false, "updated": "2019-09-17T12:27:41", "background_image": "https://media.rawg.io/media/screenshots/998/9983308a5579d47890611d6d740746b0.jpg", "website": "http://tjqy.5277.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 67}, "playtime": 1, "achievements_count": 0, "ratings_count": 4, "suggestions_count": 529, "game_series_count": 0, "reviews_count": 4, "platforms": ["PC"], "developers": ["Zhong Chongren"], "genres": ["Adventure", "Massively Multiplayer", "Indie"], "publishers": ["Zhong Chongren"], "esrb_rating": null}