{"id": 631688, "slug": "worlds-hardest-15-puzzle", "name": "World's Hardest 15-Puzzle", "name_original": "World's Hardest 15-Puzzle", "description": "World's Hardest 15-Puzzle\r\n<p>This is a surprinsing version of the 15-puzzle game I found in my great-great-great-grandfather's trunk. Whereas the original 140 years old game has its 15 pieces numbered from 1 to 15 (hence its name), this one has no numbers, all pieces are the same. At first I wondered what kind of joke this was, with its boasting \"World's Hardest 15-puzzle\"? All pieces are identical, game's resolved! That is, until I began fiddling with it and saw some pieces lighting on! Then I figured each piece has its intended place where it lights up, and the game's done once all pieces shine.</p>\n<p>I also found a vintage printed ad about this game which confirms this. It looks like the game was a novelty trinket from the Wild West era, and from what I've been told about my ancestor that would quite fit his adventurous personnality. But, this is still bewildering. I never heard of this, had it any success? Is there any other copy of this? How does it work? How come it still works after more than a century? It seems this was manufactured in France, I wonder whether I can find any more information here.\r\n </p>\n<p>Anyway, here's a rough copy of that ad, I hope I'll find some time to scan it:\r\n </p>\r\nYou already know the 15 puzzle which recently became a widespread phenomon. A mere toy for children, may you think? Yet let us show you how demanding that game can be with this amazing brain twister coming straight from France! Imagine:<br/>- All pieces are strictly identical, with no distinguishable detail.<br/>- Where the hole should be changes with every game.<br/>- Each block lights on only once in place, thanks to the magic of electricity!<br/>\r\n \r\n\r\nOnly possible thanks to modern science!\r\n<br/>\r\nTrain your brain, improve your hand &amp; eye coordination!\r\n <br/>\r\nEach play is a new game!\r\n <br/>\r\nTotally safe!\r\n <br/>\r\nHigh durability!\r\n <br/>\r\nPlay it everywhere!\r\n <br/>\r\nMade with the most delicate materials from France!\r\n <br/>\r\nIt'll cost you only what you want!\r\n\r\n\r\nControls\r\n<ul><li>Arrow keys or gamepad to switch hole with a piece next to it.</li><li>To start another game press Enter and select \"Reset cart\".</li></ul>\n\n<p>The game was made for the Thinky Puzzle Game Jam and in 560 chars or less for the Tweet Tweet Jam 6. If you have Pico-8 you can copy &amp; paste the code below to play the exact same game on it.<br/></p>\r\n\r\nfunction m(b)\r\ns=u+({1,-1,4,-4})[b+1]\r\nif((b&lt;2and u\\4==s\\4)or(b&gt;1and s&gt;=0and s&lt;16))t[s+1],t[u+1]=t[u+1],t[s+1]u=s\r\nend\r\ni=\"\\^y9world's hardest\\n\\^t\\^w\\-a15-puzzle\"t={}h=rnd(16)\\1u=h\r\nfor n=0,15 do\r\nadd(t,n)end\r\nfor n=0,999do m(rnd(4)\\1)end::_::cls(4)\r\n?i,34,14,2\r\n?i,35,13,9\r\nfor n=-1,#t-1 do\r\nl=-2x=30y=38w=66k=0d=2j=0c=circ\r\nif(n&gt;-1)x=n%4*16+32y=(n-n%4)*4+40l=t[n+1]w=14k=2j=4d=1\r\nif(l==n)k=9j=10d=4c=circfill\r\nif(l==h)w=12k=1j=1d=1y+=2\r\nrectfill(x,y,x+w,y+w,k)\r\nfor o=0,3do pset(x+o%2*w,y+o\\2*w,d)end c(x+7,y+7,3,j)\r\nend\r\nfor b=0,3 do\r\nif(btnp(b))m(b)\r\nend\r\nflip()goto _", "metacritic": null, "released": "2021-07-02", "tba": false, "updated": "2021-07-05T07:10:53", "background_image": "https://media.rawg.io/media/screenshots/01d/01dca4c24b33eed0711edb329072ba00.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 27, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["ElGregos"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}