{"id": 631625, "slug": "takeover-incorporated", "name": "Takeover Incorporated", "name_original": "Takeover Incorporated", "description": "<p>When you're someone who has everything, what more do you need? Why everything of course. Take on the role of an enterprising billionaire mogul. Compete with your peers to buy out the best and brightest companies in existence. Use your cunning to make the best deals. Work quickly to overtake the competition. Avoid those pesky regulators, as while you are above punishment, they can still prevent you from completing your deal. </p>\n<p>Takeover Incorporated is a classic territory acquisition game featuring:</p>\n<ul><li>Super fast addictive games.</li><li>No buttons, only movement.</li><li>2-4 player rollback online multiplayer.</li><li>Victory via score. Do you take risks for bonus points, or play it safe to avoid failed captures.</li><li>Non player enemies that are perfectly predictable, and perfectly manipulable.</li></ul>\n<p>\n</p>\n<p>Takeover Incorporated is the second game of the Synchrocade rollback platform.  Synchrocade is an online multiplayer arcade featuring its own custom rollback netcode. Our goal is to build a strong community of players around an ever-growing library of online pvp games inspired by your favorite arcade games of the 80s.  Online of the Synchrocade platform requires an account at Synchrocade and is bound by the Synchrocade Terms of Service.  This product is a key to register the game to an account for play on the service.  The software for our platform is freely available here, including the ability to play locally for any of our offline compatible games.  We recommend creating an account and trying out our games before purchase. If you need help or have any questions, please email support@synchrocade.com or join our Discord.</p>", "metacritic": null, "released": "2021-07-01", "tba": false, "updated": "2021-07-05T06:50:30", "background_image": "https://media.rawg.io/media/screenshots/3e7/3e73c81f3f0ceaadeae41e5e928b2bf1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 21, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Synchrocade"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}