{"id": 631781, "slug": "adventure-3d-miskin", "name": "Adventure 3D (Miskin)", "name_original": "Adventure 3D (Miskin)", "description": "<p>The goal of this game is to find the Enchanted Chalice and bring it into the gold castle.  Use arrow keys or WASD to move; space bar to pick up or drop objects; F5 to restart; ESC to hide (or show) the help UI; and / or ? to hide (or show) the instructions UI, which displays all of these controls pictorially.<br/></p>\n<p>This game was created for the summer 2021 Unity Create with Code Game Jam.  The theme of the jam was \"Modernizing a Classic\", so I decided to do a 3D version of my favorite game from my early childhood (I am old).  If you're not familiar with the original Atari 2600 Adventure, you can play it online.</p>\n<p>There's a lot more I'd intended to add to this game; right now it only includes Variation 1 of the game, and a couple of nonessential objects are missing (the magnet and the bridge—well, the bridge is essential for Variation 2, but Variation 1 is winnable without it).  I'd even bought a paid asset for the bridge from the Unity Asset Store, but ran out of time to implement it... bah.  I may add to this game later, but at least it's working and winnable as it is now.</p>\n<p>Oh—there were also some optional \"diversifiers\" we could apply for the game jam, and I went with \"Language Independent\".  There's no written language in the game, unless you count a question mark and the labels of keys in the instructions screen.</p>\n<p>I'm going to make a post on my blog about my experience in this game jam, but... not right now.  I need to get some sleep.  It should be up later today.</p>\n<p>Oh, wait... one more thing.  I should credit the assets I used from the Unity Asset Store:</p>\n<ul><li>Animated Witch and Dragon Monster by masatomo</li><li>Cartoon Castle Building Kit by A3D</li><li>Dragonblade - PBR Fantasy Sword by Nordvale</li><li>Fantasy Skybox FREE by RenderKnight</li><li>Hand Painted Seamless Ground Texture by Innovana Games</li><li>Horror Starter Pack FREE by Instant Zoomies</li></ul>", "metacritic": null, "released": "2021-07-02", "tba": false, "updated": "2021-07-05T07:33:29", "background_image": "https://media.rawg.io/media/screenshots/a93/a9382979de720f272f60c845473b3555.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Miskin"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}