{"id": 631985, "slug": "vr-balloon-flying-over-tokyo-and-hokkaido", "name": "VR Balloon Flying over Tokyo and Hokkaido", "name_original": "VR Balloon Flying over Tokyo and Hokkaido", "description": "In this VR interactive game, with a helmet, players can experience the beautiful natural scenery of Japan from different perspectives, allowing players to live in a unique cultural environment built in Japanese-style scenes, and enjoy the rich experience after busy work. Exotic.<br/>\r\nPlayers can take a hot air balloon to travel around Japan. During the flight, you can see several wooden houses of varying heights among the rugged rocks, which look lonely and mysterious; the sun shines on the snow-capped mountains, and the hot air balloon is in the white snow. Slowly rise from the top of the mountain to enjoy the scenery of snow-capped mountains. Players can also fly over the creek in the deep mountains and pinnacles from the perspective of Griffins, and feel the willows and flowers in the next village during the flight; in the red and yellow maple leaf forest, a Japanese-style hut stands alone, and the player can fly freely. Among the trees, feel the charm of autumn; fly over the traditional Japanese-style streets to take you away from the busy life for a while; fly into the armored samurai room, they seem to be telling the last glory of the cold weapon era.<br/>\n<br/>\r\nmovement:<br/>\r\nThe left handle touchpad controls the movement back and forth, left and right, and the grip button switches the viewing angle;<br/>\r\nThe right handle touchpad controls up and down movement and left and right rotation, and the grip button adjusts the browsing speed;<br/>\n<br/>\r\nmenu:<br/>\r\nThe trigger button on the left handle can interact with the menu button;<br/>\r\nIn the scene browsing, press the menu button to call up the menu bar.", "metacritic": null, "released": "2021-07-06", "tba": false, "updated": "2021-07-09T02:28:57", "background_image": "https://media.rawg.io/media/screenshots/cc0/cc04a137742951d37c55cae37d941239.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 311, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["VR RETRO REMASTER"], "genres": ["Casual"], "publishers": ["VR RETRO REMASTER"], "esrb_rating": null}