{"id": 631979, "slug": "the-wolfs-den", "name": "The Wolf's Den", "name_original": "The Wolf's Den", "description": "There are forces in the world that no man should ever tinker with. However, that didn't stop two alchemists, Caesar and Marcus, from performing their wretched experiments with the unknown. Disaster strikes, and Marcus now finds himself in mortal peril trying to escape the ruins of his old laboratory in a seemingly deserted train tunnel, running through the heart of the mountain. Unbeknownst to him, something lurks in the dark of the passageway, something never before seen by mortal eyes. Can you help Marcus escape the clutches of this unseen terror? <br/><br/>In order to do that, you must enter <strong>The Wolf's Den</strong>! <br/><br/>The Wolf's Den is a short first person experience through a dark and mysterious world. Explore a dark mysterious train tunnel on your way to escape from a tragic accident that destroyed you and your partner's lab. Something is not quite right though and it's not just the uncomfortable noises emanating from the darkness. You will have to use your wits to uncover the mysteries of what happened to your partner Caesar, to figure out who is writing these mysterious notes, and to make sense of everything that's going on around you!<br/><br/>Features include:<br/><ul><li> Short linear single-player experience. Complete it within a day!<br/></li><li> Suspenseful first-person exploration in an atmospheric world. <br/></li><li> Full voice acting with subtitle support.<br/></li><li> Hidden secrets for extra replayability. <br/></li><li> Steam achievements and cloud saves.</li></ul>", "metacritic": null, "released": "2021-07-06", "tba": false, "updated": "2021-07-09T02:25:07", "background_image": "https://media.rawg.io/media/screenshots/c53/c5358f0df598efa45eef182fc77dd64b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 166, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Takoyaki"], "genres": ["Adventure", "Indie"], "publishers": ["Takoyaki"], "esrb_rating": null}