{"id": 631987, "slug": "horror-royale", "name": "Horror Royale", "name_original": "Horror Royale", "description": "Horror Royale is a split-screen and online multiplayer psychological horror game that involves trying to escape a level as monsters try to hunt you down and kill you. With three different game modes, lots of options to customise how the game plays, five different monsters and tons of human skins to unlock and use, scream and cheer with your friends as you try to survive.<h3>The Multiplayer:</h3>Play up to 4 player split-screen and online multiplayer, where the only limit to how many players there can be in one game is how far you can push your hardware and network.<h3>The Game Modes:</h3><br/>PvP<br/>When the other humans have succumbed to the monsters and you are the last one left alive the door will open, find it to survive.<br/><br/>Survive The Night<br/>Hide and survive from the monsters until the clock strikes 6 AM at which point the door will open and you will be able to escape.<br/><br/>Objectives<br/>Collect keycards, turn on the power and open the door, all while avoiding monsters, in order to survive.<h3>Game Customisation:</h3>The host will be able to choose a wide variety of different options that will change the game drastically. These options include but are not limited to:<br/><ul><li>Difficulty<br/></li><li>Monster spawn rate<br/></li><li>Types of monsters<br/></li><li>Monster movement speed<br/></li><li>Player movement speed<br/></li><li>FOV (ranging from 5 to 170) for all players</li></ul><h3>Human AI:</h3>Choose to add up to 100 human AI which will make the game more populated and add more death and chaos.", "metacritic": null, "released": "2021-07-06", "tba": false, "updated": "2021-07-09T02:30:14", "background_image": "https://media.rawg.io/media/screenshots/8f7/8f7fe4aaa44f48ce141e6bda55a911be.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 127, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ben Wade"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["Ben Wade"], "esrb_rating": null}