{"id": 631946, "slug": "rims-racing", "name": "RiMS Racing", "name_original": "RiMS Racing", "description": "<p>The first motorbike simulation that combines a realistic racing challenge with engineering and mechanics! Ride the world&#39;s most powerful motorbikes and optimise their performance by swapping out parts and analysing data in real time.</p>\n<p>A race is not won purely on the track, so you need to become more than a rider by understanding motorbike behaviour like a real engineer. Traction, angle, braking, torque, trajectory, speed… every factor must be considered before heading to the workshop to change certain components and configuring the optimal set-up.<br />\nA DREAM GARAGE<br />\nYour adventure starts by choosing your dream motorbike. In RiMS Racing, you can ride the world&#39;s 8 most powerful European and Japanese motorbikes: Ducati Panigale V4 R, MV Agusta F4 RC, Aprilia RSV4, BMW M 1000 RR, Suzuki GSX-R1000R, Honda CBR1000RR, Kawasaki Ninja ZX-10RR, Yamaha YZF-R1. Recreated with an unmatched level of detail thanks to close collaboration with each manufacturer, these motorbikes also provide a highly accurate and realistic riding experience. They are true rough diamonds that only need a few cuts to shine their brightest!<br />\nOPTIMISE YOUR MOTORBIKE<br />\nWith a mechanics management system never before seen in a motorbike simulation, you can dismantle all your bike&#39;s parts to maintain them after each race or to upgrade them and boost your performance. You will become familiar with every last screw in your motorbike. Browse a catalogue of over 500 official spare parts from the biggest names in the industry along with over 200 official equipment items to personalise your rider!<br />\nANALYSE YOUR PERFORMANCE<br />\nRiMS Racing thrusts you straight into the heart of the action with the Motorbike Status Check (MSC), which helps you analyse your bike&#39;s behaviour in real time and understand how to optimise your performance. Brake disc temperature, tyre compound and pressure pressure, suspension behaviour affecting stability, electronic settings… Just like for a real rider, your motorbike&#39;s configuration can be adapted to your riding style!<br />\nACCURATE AND REALISTIC PHYSICS<br />\nThe level of accuracy and details provided by the mechanics management and MSC is matched by realistic motorbike physics that will thrill the most demanding of track racers. But thanks to the various ride assist technologies, less experienced players can still learn the techniques that will take them to the top.<br />\nTHE MOST ICONIC CIRCUITS<br />\nSilverstone, Laguna Seca, Suzuka, Nürburgring, Paul Ricard… Travel the world and enjoy thrilling races on 10 faithfully recreated official circuits. For those who prefer roads, five routes in the stunning landscapes of the United States, Norway, Australia, Spain and Italy have been recreated for a different racing experience on two wheels!<br />\nMANAGE YOUR CAREER AND TEAM<br />\nCareer mode in RiMS Racing gives you control of a team. Build your rider by managing their race calendar, choose which R&amp;D areas to invest in, and upgrade the team&#39;s skills. If you make the right decisions and improve your racing performances, opportunities with other manufacturers will become available to you!</p>", "metacritic": null, "released": "2021-08-19", "tba": false, "updated": "2023-04-28T11:00:27", "background_image": "https://media.rawg.io/media/games/917/917d59fa6ac74edda337330e376fcf4e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 56, "toplay": 5, "dropped": 3}, "playtime": 1, "achievements_count": 82, "ratings_count": 3, "suggestions_count": 258, "game_series_count": 0, "reviews_count": 3, "platforms": ["Xbox One", "PlayStation 4", "Xbox Series S/X", "PlayStation 5", "PC", "Nintendo Switch"], "developers": ["Raceward Studio"], "genres": ["Simulation", "Sports", "Racing"], "publishers": ["Nacon"], "esrb_rating": null}