{"id": 632028, "slug": "mysterious-puzzles-collection-nemezis-schizm-reah", "name": "Mysterious Puzzles Collection: Nemezis, Schizm, Reah", "name_original": "Mysterious Puzzles Collection: Nemezis, Schizm, Reah", "description": "<p>Mysterious Puzzles Collection includes Nemezis: Mysterious Journey III,<br/>Schizm: Mysterious Journey and Reah: Face the Unknown</p><br/>\nNemezis: Mysterious Journey III\nTravel and explore\n<br/>\n<br/>\nThis is the planet Regilus - a dazzlingly beautiful, exotic, multi-layered and mysterious ecosystem. No wonder that colonial syndicates and private explorers fought for it. In the end, the oasis of natural deposits and minerals found on Regilus was deemed too small to fight for, and with no more hostilities, various Teleportation Travel Agencies turned the place into a one-of-a-kind tourist attraction.\n<br/>\n<br/>\n<br/>\n<br/>\nLost in space\n<br/>\n<br/>\nNemezis: Mysterious Journey III is a puzzle adventure game with countless brain teasers, in which two tourists - Bogard and Amia - find themselves engaged in a series of mysterious events. The protagonists are separated and, in order to find each other, must rely on a guide whose behaviour becomes more and more grotesque with every passing minute. \n<br/>\n<br/>\n<br/>\n<br/>\nFind your companion\n<br/>\n<br/>\nDuring their adventure on Regilus, the protagonists will visit seven different locations - each one a completely new artistic experience altogether. In order to find one another, Bogard and Amia must solve many intriguing puzzles with varying levels of complexity. Nemezis: Mysterious Journey III is a very player-friendly game. Choose a level of puzzle difficulty appropriate to your experience with games of this type. You will also have access to a digital guide, whose advice can be crucial in many situations. But are you sure you can trust it?\n<br/>\n<br/>\n<br/>\n<br/>\nThe game's creator and puzzle designer is the legendary Roland Pantoła - creator of critically acclaimed adventure titles such as AD 2044, Reah and the Schizm series.\n<br/>\n<br/>\n<br/>\n<br/>\nGame features:\n<br/>\n<br/>\n- Intriguing and engrossing puzzles that will test your ability to quickly associate facts and think abstractly.\n<br/>\n- A dark and stunningly beautiful ecosystem on the planet Regilus.\n<br/>\n- Superbly written, deep characters.\n<br/>\n- A compelling and exciting story, whose finale will surprise even the most seasoned fans of the genre.\n<br/>\n- A digital guide to help you in difficult situations and multiple difficulty levels to suit your experience.<br/>\nSchizm: Mysterious Journey\nYou are about to embark on an incredible adventure.<br/><br/>\n\nSeveral exploration attempts of Argilus have failed to reveal the secrets behind it's mysterious abandoned condition. <br/><br/>\n\nPrevious exploration teams had reported unusual findings, prior to them mysteriously going missing themselves. Their garbled messages speak of a world containing large habitable organic vessels aimlessly floating, and abandoned. These messages are the only legacy that remains of a missing race. <br/><br/>\n\nNow you must travel to the strange and exotic lands of Argilus, on a quest to uncover the secrets behind a strange phenomenon. Here you will discover the mysteries and the secrets that, until now, have been lying dormant waiting to be revealed.<br/><br/>\n\nEmbrace the challenge and allow your instincts and ingenuity to help you unlock the ultimate mystery. \n\nReah: Face the Unknown\nOne of the most atmospheric games ever, Reah is an arcade adventure which sees you on your quest to find your way back to the real world, after you have accidentally been transported to an alternate reality. An extremely fast graphics engine allows you to swifty explore the surreal and beautifully depicted world of Reah where numerous puzzles have to be solved in order to escape from the strange reality in which the player is trapped. During your travels, you will meet the ancient inhabitants of Reah, who will slowly reveal the truth behind the great mystery that surrounds the world of Reah. Little by little it becomes clear that escape from Reah looks impossible, unless...", "metacritic": null, "released": null, "tba": false, "updated": "2021-07-09T02:59:31", "background_image": "https://media.rawg.io/media/screenshots/134/1349dd760dcd32468774e62d87776abc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 623, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Detalion Games"], "genres": [], "publishers": ["PlayWay", "Detalion Games"], "esrb_rating": null}