{"id": 632049, "slug": "coins-mania-king-of-coins", "name": "Coins Mania - King of Coins", "name_original": "Coins Mania - King of Coins", "description": "Come on! Join your Facebook friends to get your coins mania! Play in spins, attacks and raids to build your kingdom!<br/><br/>Spin to Earn Your Rewards<br/>Spend spins, roll the dice then your fortune will come to you. Be it attack, raids, loot and shields. Your loot will be shown when you land on coins and gold sacks, thus you can make your orders and collect hammers to build your own kingdom. Win shields to guard your kingdom from others trying to attack you. Become the master of your kingdom with the most loot!<br/><br/>Attack and Raid others kingdom!<br/>Earning coins through spins isn’t the only way to get rich, you can steal and attack others to get coins too! Attack or raid friend to save enough loot to finish orders, collect hammers to build your kingdom. Revenge those who have attacked your kingdom and take whats rightfully yours! Bring back your coins and get rich again! You never know what you can get in others kingdom!<br/><br/>Collect All the Cards<br/>Attack or raid other players, complete challenges and get abundant rewards, including spins and card chests. Collect a whole set of cards to get a lot of rewards.<br/><br/>Build &amp; Upgrade Your Building<br/>Build your Power Station, Weapons Station, Vault and Defensive Base. Upgrade Power Station, get more rewards. Upgrade Weapons Station, get more rewards when you attack others. Upgrade Vault, get more rewards when you raid others. Upgrade Defensive Base, increase the chance to protect your town from attack or add one shield.<br/><br/>Play with Friends<br/>Communicate and trade cards with the players all around the world to collect full sets quickly. Hurry up! Join in us to meet new friends! Become the strongest one with the most advanced kingdom!<br/><br/>Join our community:<br/>https://www.facebook.com/Coins-Mania-106344048008723/", "metacritic": null, "released": "2021-04-06", "tba": false, "updated": "2021-07-09T03:15:26", "background_image": "https://media.rawg.io/media/screenshots/7de/7de59915cf11c700c808432a219f70b5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Zhuhai Zhangyou Technology"], "genres": ["Board Games", "Casual"], "publishers": ["Zhuhai Zhangyou Technology"], "esrb_rating": "Teen"}