{"id": 632050, "slug": "solitaire-4", "name": "Solitaire !*", "name_original": "Solitaire !*", "description": "Enjoy the excellent classic and popular Solitaire card games at any time and place! It's time to relax, relieve stress, train your brain, challenge yourself and be a Klondike or Patience master, try this classic Klondike Solitaire cards game!<br/><br/>Solitaire games, also known as Patience in Europe (such as the United Kingdom, French, etc.), are Solitaire card games, and can be played by a single player. <br/><br/>To solve this Solitaire Klondike card puzzle, you should move all cards of 4 suits - hearts, diamonds, spades and crosses to the Foundations. There is one deck - 52 cards in the classic Solitaire Klondike game. <br/><br/>You need to stack cards by suit, from Aces to King (A, 2, 3 and more). You can also move cards between columns, and stack cards in descending order and differentiate between red and black suits. For example, a black 10 could only be followed by a red 9. Only a King could be placed in the Free Column. You can move the stack of cards by dragging the whole stack to another column.<br/><br/>Solitaire Klondike game is an addictive card game from the Classic Solitaire collection, which is similar to other Solitaire card/board games, such as Cube, Freecell, Spider, Tri Peaks, Pyramind, Golf, Mahjong and Yukon. Classic never fades. Solitaire Klondike is the best way for you to relax and pass the time, play it anytime, anywhere with patience and insistence. You would absolutely love playing this Solitaire Klondike card game. <br/><br/>Key Features<br/>- Classic solitaire gameplay, super fun and addictive<br/>- Left-hand mode, more convenient for you<br/>- 3 Draw Mode, more challenging to play games<br/>- Statistics section, keep improving and challenging yourself<br/>- Unlimited hints and undo<br/><br/>Privacy Policy: https://solitaire.fungame.studio/policy.html<br/>Terms of Service: https://solitaire.fungame.studio/termsofservice.html", "metacritic": null, "released": "2021-06-23", "tba": false, "updated": "2021-07-09T03:15:54", "background_image": "https://media.rawg.io/media/screenshots/609/609e847c2e7efeb88138746e52056f9d.jpg", "website": "https://solitaire.fungame.studio/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 124, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Guru Smart Holding"], "genres": ["Card", "Puzzle"], "publishers": ["Guru Smart Holding"], "esrb_rating": "Everyone 10+"}