{"id": 632167, "slug": "wolfpack-hunter-adventure-2", "name": "Wolfpack Hunter Adventure 2", "name_original": "Wolfpack Hunter Adventure 2", "description": "<p>Welcome to Wolfpack Hunter Adventure 2!</p>\n<p>The sequel to the amazing platformer game: Wolfpack Hunter Adventure!</p>\n<p>This game includes 50 levels and 5 exotic lands to discover! And there are more features and levels coming soon!</p>\n<p>There is a Control Room so you can know how to play!</p>\n<p>There are four playable characters in this game!</p>\n<p>Don't forget to join the discord server to get more information about our games:  https://discord.gg/NdYXqAz</p>\n<p>And also check our YouTube channel too: : https://www.youtube.com/channel/UCyrUd15KBG7I7x8Y_SsuM4w?view_as=subscriber</p>\n<p>STORY: After exploring so many lands and areas of the World of Wolfpack, Cosine and the gang have finally reached the Evil Inferno! But once they found Cosine's gold wolf in Coslash's Castle, Coslash smackled the gang, by taking Maxwell, Tifftoad, Jack, and Rocket AGAIN! along with the gold wolf. Coslash sent them to an even further land in the far southeast of the World Of Wolfpack: AMETHYST SANCTUARY! Coslash even used his mysterious spell to teleport Cosine back to Friendly Hills where he started his adventures. while Cosine was alone, He decided that needs some help, so he joined in with his older brother Dosine, and his younger brother Bosine. He also invited Lina, a resident of Gerundwald Village to go with him too. She accepted the request, So all four of the Sackpeople started their journey to reach the Amethyst Sanctuary so they can save all of Cosine's friends! But warning: This adventure is gonna be harder than the last one! This is the second quest for Cosine!</p>", "metacritic": null, "released": "2021-07-08", "tba": false, "updated": "2021-07-09T03:57:28", "background_image": "https://media.rawg.io/media/screenshots/3dd/3dddea391cd7173a7ce23eaba1196488.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 17, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Wolfpack Hunter Studios"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}