{"id": 632193, "slug": "the-falcon-shuffle-a-visual-novella", "name": "THE FALCON SHUFFLE: A Visual Novella", "name_original": "THE FALCON SHUFFLE: A Visual Novella", "description": "I'M NOT SURE WHY I MADE THIS\r\n<p><em><strong>Note:</strong> You can go fullscreen in the Preferences menu (you might need to click in the window after selecting fullscreen for it to start working)</em></p><p>I recently released a playable demo for a new spaceship shootin', deckbuildin', roguelite game called THE FALCON SHUFFLE <em>(you'll want to at least just give its trailer a watch first!)</em></p>\n<p>I also recently got curious about what visual novel editors are out there for some reason, so a couple of evenings messing about with Ren'Py on a whim and reusing a handful of assets from my game later, here we are, whatever this is!<br/></p>\n<p>So what is this? It's a <strong>roughly 3-4 minute long</strong> sort of visual novel thing that's basically one long meta ramble written more or less as a stream of consciousness in one evening with the telly on in the background.</p>\n<p>Anyhoo, you can play it in your browser above (Ren'Py's browser support is in beta and images sometimes look a little funky when they load in, but it's pretty solid) OR you can download it below if for some reason you want to keep this thing I cobbled together safe for all of time (or until computers stop being a thing).</p><p><strong>Note 2</strong>: Yes the characters' names are Carl and Not Carl, this is a thing you can find out if you play the demo for The Falcon Shuffle itself enough times...</p>\n<p>ENJOY?</p>", "metacritic": null, "released": "2021-07-08", "tba": false, "updated": "2021-07-09T04:04:29", "background_image": "https://media.rawg.io/media/screenshots/f56/f56cfc415c6c5843c15493e59c1136a7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 61, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["RobGamesThingy"], "genres": [], "publishers": [], "esrb_rating": null}