{"id": 6322, "slug": "adventure-land-rogue-runner-game", "name": "Adventure Land - Rogue Runner Game", "name_original": "Adventure Land - Rogue Runner Game", "description": "Get ready for the ride of your life! In Adventure Land you never know how your the next run is going to be. Create characters with crazy combinations of attributes and skills, take them for a walk across the lands of a wacky world and fight against even crazier monsters. Ready? Let the adventure begin!<br/><br/>Featured by Apple in Best New Games<br/>&amp;quot;Adventure Land is well worth your time to check out.&amp;quot; -- TouchArcade<br/><br/>A FRESH START<br/>Before each run your destiny will be chosen at random and your brand new hero can be incredibly awesome or just plain… well... stupid. Dozens of traits can be combined into millions combinations of heroes. How your next runner will be?<br/><br/>CHEATING DESTINY<br/>Loved your hero too much to let it go? Well, use magic gems to fool the destiny and save your hero combination to use him as much as you want. Neat, eh?<br/><br/>CRAZY MINIONS<br/>Use special weapons to fight against enemy monsters like wild bats, mad bonfires, fighting eyeballs, frog warriors, geysers, tsunamis and even the sun!<br/><br/>HIGHLIGHTS<br/>• Simple RUN, JUMP and FIGHT gameplay<br/>• 45 UNIQUE traits<br/>• MILLIONS of possible combinations<br/>• UNPREDICTABLE hilarious heroes<br/>• WACKY villains<br/>• QUICK and EASY gameplay<br/><br/>It’s time! Get ready for some adventure!<br/><br/>Disclaimer: While this App is completely free to play, some additional content can be purchased for real money in-game. If you do not want to use this feature, please turn off in-app purchases in your device&amp;#39;s settings.<br/><br/>Like our page on Facebook and be the first to know about our upcoming games and updates! http://fb.com/tappshq", "metacritic": null, "released": "2014-03-04", "tba": false, "updated": "2019-10-22T14:28:48", "background_image": "https://media.rawg.io/media/screenshots/ef1/ef19abd14a4abd115373d5111a868b7a.jpeg", "website": "http://tappsgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 73, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tapps Tecnologia da Informação Ltda."], "genres": ["Adventure", "Strategy"], "publishers": ["Tapps Tecnologia da Informacao LTDA."], "esrb_rating": "Teen"}