{"id": 63229, "slug": "slime-sports", "name": "Slime Sports", "name_original": "Slime Sports", "description": "In <strong>Slime Sports</strong>, you'll take control of slimes in their quest to become champions. <br/><br/>The variety of playable slimes is the heart of the game. There is no one-size-fits-all strategy for any sport; each power demands a different play style, so learning the advantages and disadvantages of each slime is key to victory. The game features four fast-paced sports: Soccer, Racketball, Volleyball, and Paintball. Every slime can play every sport. With 36 powers, 11 stages, 4 sports, and dozens of achievements, the game offers hours and hours of gameplay.<br/><br/>Features in <strong>Slime Sports</strong> include:<br/><ul><li> 4 sports: Soccer, Volleyball, Racketball, and Paintball.<br/></li><li> 36 unique slimes (and counting!), each with their own powers.<br/></li><li> Tons of achievements and secrets to unlock.<br/></li><li> First class couch multiplayer: up to 4 players, with any combination of controllers, joysticks, and keyboards.  <br/></li><li> Tournament Mode: Unlock new characters, costumes, stages, and more by playing in tournaments - single player or co-op. <br/></li><li> Arcade Mode: Customize every aspect of your match and build your perfect game!</li></ul><br/>Slime Sports was inspired by the fantastic \"Super Slime Soccer\" available completely free at http://mollerhoj.com/", "metacritic": null, "released": "2018-02-21", "tba": false, "updated": "2019-08-28T21:56:50", "background_image": "https://media.rawg.io/media/screenshots/1d5/1d5271832d4b64913420455e59203cdf.jpg", "website": "http://www.dribblegames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 267, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Dribble Games"], "genres": ["Action", "Sports", "Casual", "Indie"], "publishers": ["Dribble Games"], "esrb_rating": null}