{"id": 632461, "slug": "virtual-reality-sickness-experiment", "name": "Virtual Reality Sickness Experiment", "name_original": "Virtual Reality Sickness Experiment", "description": "<p><strong><em>This application was developed for my honours project. It was used to test virtual reality sickness caused by different locomotion methods and a potential form of visual mitigation.</em></strong></p>\n<em>Hello and welcome!</em>\n<p>This page contains the application for the Virtual Reality Sickness experiments and some instructions.</p>\n<strong><em>Download and Installation</em></strong>\n<p>Please download the software and ensure your VR device is set up on your computer before the web interview takes place.<br/></p>\n<p>You will be carrying out this test whilst standing in place. To turn left or right, you will need to rotate your head/body left or right.</p>\n<p>You will find the Application zip file at the bottom of this page (VRExperiment.zip).\r\n</p>\n<p>Once downloaded,  unzip the contents to a memorable location, e.g. desktop, \"My Documents\" folder, etc).  Once unzipped, look for the executable \"VirtualRealitySickness.exe\".  </p>\n<p>Ensure your VR system is connected to your computer, then double click the executable. The application will then load up and the main menu will appear before you. </p>\n<p><strong>Note:- </strong>If you are using an Oculus device and it doesn't display on the headset screen, you may need to enable the \"Unknown Sources\" option. This can be found in the Oculus desktop app &gt; Settings &gt; General &gt; Enable the Unknow<br/></p>\n<em>Experiment Procedure</em>\n<p>The experiment will be carried out at the same time as the web interview.  Please ensure you have selected a timeslot from the Doodle link (emailed to you) and you have added me on Discord (my Discord tag is included in the email). If there are any issues with this, please let me know.</p>\n<p>Whilst the experiment is expected to last <strong>90 minutes</strong>, it will likely take  closer to <strong>60 minutes</strong> to complete.</p>\n<p>During the interview, you will have the application running, whilst I tell you which experiment to carry out. I am looking for you to screen share the application running from your computer, but if you have reservations about this, please let me know.</p>\n<p>Whilst you are carrying out the test, you will be asked how you are managing with the experiment. Once you have completed the experiment, I will ask you a few questions, then you will be given a 5 minute break before carrying out the next experiment.</p>\n<em>Locomotion and Controls</em>\n<p>For this study, you will be using two types of Locomotion: Teleportation and Continuous. </p>\n<p>Teleportation allows you move from one place to another instantly, where as continuous motion will allow you to move in the direction you are looking at. All movement controls are mapped to the left controller, which are as follows.</p>\r\nTeleportation Controls\r\n<p>To teleport in a scene with teleportation, first hold down the trigger button. This will highlight the teleportable floor and a line will appear from the VR left controller. </p>\n<p>Whilst holding the button down, aim at the highlighted floor and a circular target ring will appear indicating the point where you want to teleport to. If the target ring and teleport line are green, this indicates a position where you can teleport to. If the teleport ring are line are red, this indicates you can't teleport as you have hit an object (e.g. a wall). If the teleport line is black but no ring appears, then the position is too far away and you will need to aim towards you.</p>\n<p>Once the teleport line and ring are green, release the left trigger and you will then instantly teleport to the position.</p>\r\nContinuous Controls\r\n<p>To move in a scene with continuous controls enabled, look in the direction you want to move to. </p>\n<p>If you're using the HTC Vive wands, move hold your thumb at the top of the left wand trackpad and you will begin to move in the direction you want. If you need to move back, move and hold your thumb at the bottom of the HTC Vive wand trackpad. </p>\n<p>If you're using the Oculus Touch controller, push the left controller analogue stick forward and you will begin to move in the direction you want. If you need to move back, push the left analogue stick back.</p>\n<p>Whilst you are moving, you can change direction by turning your head/ turning your body. </p>\r\nMain Menu\r\n<p>When in the main menu, you will use the right controller to select an experiment. A blue line and target ring are used to show what your controller is aiming at. To select an item from the menu, aim the target ring and line at menu item. The menu item will highlight with a pink colour.  Whilst highlighted, press the right trigger button and you will be instantly put into a scene and ready to start the experiment.</p>", "metacritic": null, "released": "2021-07-07", "tba": false, "updated": "2021-07-09T05:09:41", "background_image": "https://media.rawg.io/media/screenshots/3bb/3bb7cd505e26bc6132c1d67b0184a9f3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 8, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Graeme"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}