{"id": 632592, "slug": "heartbeatvr", "name": "HeartBeatVR", "name_original": "HeartBeatVR", "description": "<p>Local cooperative VR game(PC+VR).</p>\n<p>Platform: PC &amp; Steam VR</p>\n<p>the game requires at least 2 players, 1 PC monitor, Keyboard+Mouse, Valve Index VR headset and knuckle controllers.</p>\n<p><strong>Note</strong>: the game does not support other VR devices at the moment.</p>\n<p>PC player is the supporter of VR player, read the map, plan the route,  find the location and supply to help VR player escape the facility.\r\n</p>\n<p>VR player will try to finish a few missions under the guide of PC player.\r\n</p>\n<p>The enemy only can be observed via the goggle while VR player has a high heart rate, they will raise the player's heart rate slowly, Closer, Higher. The enemy will chase the player if the player enters a certain distance from the enemy.  Watch the heart Cam to avoid the enemy.</p>\n\n\n<p><strong>Control:</strong></p>\n<p>PC: Keyboard to input the code to interact with the map. e.g: ROOM325.UNLOCK</p>\n<p>↑↓→←arrow keys to control the minimap. Mouse and keyboard to control the mini puzzle games.</p>\n<p>VR player: Left joy-stick to move the character. Simply Grabbing is the only action to interact with the item (e.g Mag, Pistol). The watch on the back of left hand is monitoring the heart rate of VR player. the number in the reverse side is the ammo that player has in their backpack. The goggle can be lifted up by holding it over player's head.</p>\n<p>How to operate a pistol----Search how to fire a Glock on youtube.  The gun system in this game is super realistic.  \"A\" button of controller (the hand holding the pistol) is to release the magazine, \"B\" is to release the slide stop, use for reloading ( you can also pull the slider of the pistol to reload). </p>\n<p>updated: </p>\n<br/>\n<p>This is how you will control the pistol in game.</p>\n\n<p>Magazine is kept in the backpack of player, to grab a magazine,  use your hand to reach behind your back, and grab. To keep a magazine, put it on your back. release the mag from your hand.</p>", "metacritic": null, "released": "2021-07-07", "tba": false, "updated": "2021-07-09T05:41:07", "background_image": "https://media.rawg.io/media/screenshots/c19/c19949c9837d2993ea74305e2d7ce648.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 33, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Gdrinks"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}