{"id": 63258, "slug": "imperialism-the-dark-continent", "name": "Imperialism: The Dark Continent", "name_original": "Imperialism: The Dark Continent", "description": "You are in 1870s. The New World and Asia are divided among the European colonizers. There is only one continent, which mysterious depths still have never witnessed the presence of any European traveler. But everything will change very soon. The Scramble for Africa is just about to start.<br/>In the game you act as the Minister for Colonies of any of the available countries. You send expeditions to explore new territories, and then you have to commence colonization, build colonial facilities and extract valuable resources.<br/>There are 8 playable great powers: Great Britain, France, Germany, Italy, Spain, Portugal, Belgium and even Russia. Historically, some of them got a solid piece of the African pie, some others limited themselves to crumbs from the table, and some did not participate in the colonial race at all.<br/>Colonial RivalryOne province can be simultaneously colonized by two or more powers - but there can be only one winner. There’ll be many situations where you will have to choose whether to spend an increased amount of your influence and grab the desired province at any cost, or leave it and concentrate on other regions.Economy and DevelopmentAfrica is full of natural resources and trade goods. Coffee, diamonds, peanuts, rubber... Some goods are ubiquitous, some are very rare. Expect that the richest regions can become the arenas of fierce struggle.<br/>While expanding, do not forget to develop those lands that are already under your control. When you build new plantations and mines, you increase your income. When you build schools, hospitals, railways and cultural institutions, you increase the growth of your colonial influence, thus earning even more legitimate moral rights for further expansion!<br/>Goals of the GameThe game goes until the 20s of the 20th century, and when the time is over, the results are summed up. There is no any strict final goal in the game - you define your goal by yourself. Conquer the whole continent? Build a railway from Cairo to Cape Town for Her Majesty Queen Victoria? Banish everyone from Central Africa, playing as Germany? Create New Brazil by uniting the Portuguese colonies? Or maybe suddenly emerge on the continent as Russia?History repeats itself - but not always and not in exact wayVirtual Africa lives its life: you will encounter a large number of events - both historical and random. All your actions and choices have consequences!<br/>Variety of ActionsWhen the entire continent is divided into zones of influence, what should you do if, in your opinion, the boundaries were established unfairly? You have three ways of dealing with your European rivals:<br/>You can attack the enemy who occupied the desired province and capture it by force. Without any doubts, it will lead to hostile and vengeful response. Or you can play on the greed of your rivals and try to buy out the colony you need. Finally, you can perform miracles of diplomacy, trying to negotiate the transfer of the desired colony, spending points of influence on it. Choose your actions wisely!", "metacritic": null, "released": "2018-05-18", "tba": false, "updated": "2019-08-28T21:56:48", "background_image": "https://media.rawg.io/media/screenshots/d1d/d1d78c20d5af4655add2c0f2268ccf27.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 7}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 164, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Gamenesis"], "genres": ["Strategy", "Indie"], "publishers": ["Gamenesis"], "esrb_rating": null}