{"id": 632668, "slug": "satans-assistant", "name": "Satan's Assistant", "name_original": "Satan's Assistant", "description": "<p><em>June 2021</em></p>\n<p>Satan's Assistant was done on Unity for an assignement / scholar game jam during my first year of Bachelor Game Design.</p>\n<p>We were quickly set with our ideas : incarnate the reaper of death and travel between the overworld and the underworld. To give more depth to the game, we decided to include Satan as our lord, to whom we have to fullfill Death contracts by killing the target from the overworld.</p>\n\r\nCONTROLS\r\n<ul><li>Space bar : Switch of world\r\n</li><li>Left click : Attack / Kill\r\n</li><li>ZQSD or WASD : Movement\r\n</li></ul>\n\r\nTHEME\r\n<p>The constraints was to chose two themes among different ones. For this game, we chosen <strong>Death is usefull </strong>and <strong>Parallal universes</strong>.</p>\n\r\nMECHANICS\r\n<em>WORLDS</em>\n<p>There are two world, the UNDERWORLD (the hell) and the OVERWORLD (normal world). You can switch of world whenever you want by pressing the SPACE key.\r\n</p>\n<em>DEATH CONTRACT</em>\n<p>From the UNDERWORLD, Satan gives you a DEATH CONTRACT with a target that you have to kill to succeed it. Each contract fullfield and given back to Satan make you earn time. You may kill everybody but you need at least to kill the target to succeed.</p>\n<em>TIMER</em>\n<p>If your timer reaches 0, the game is over. Complete contract to earn time.\r\n</p>\n<p>If someone see you, he/she will be scared and run. It gives you a malus to your timer that will decrease faster. Do not hesitate to kill other people than your target.\r\n</p>\n<em>INTERACTION WITH POPULATION</em>\n<p>From the OVERWORLD, you can only see the silouhette of the population, you can't touch them or even kill them, but you can guess who is your target.\r\n</p>\n<p>From the OVERWORLD, you are able to fully see the population in color, you can collide and kill them, but they can see you and the Scared People counter increase.</p>\n\r\nOTHER\r\n<p>Each person are randomly generated to make them as funny as possible, creating a bit of funny confusion when there are seen as silhouette.\r\n</p>\n<em>SKIN (88 combinations)</em>\n<p>Its skin is composed of one random head and one random body.\r\n</p>\n<em>NAME (195 combinations)</em>\n<p>Their full name are composed of one random first name and one random last name.</p>\n\r\nCREDIT\r\n<p><strong>GAME DESIGN</strong></p>\n<p>Axel FAUX &amp; Maxence JACQUOT</p>\n\n<p><strong>PROGRAMMING &amp; ENGINE ONBOARDING</strong>\n</p>\n<p>Axel FAUX</p>\n\n<p><strong>PIXEL ART</strong>\n</p>\n<p>Maxence JACQUOT</p>\n<p>GrafixKid<br/></p>\n\n<p><strong>SOUND DESIGN</strong>\n</p>\n<p>Axel FAUX</p>\n\n<p><strong>VOICES</strong>\n</p>\n<p>Maxence JACQUOT</p>\n\r\nThank you for reading and have fun :)", "metacritic": null, "released": "2021-07-07", "tba": false, "updated": "2021-07-09T06:03:46", "background_image": "https://media.rawg.io/media/screenshots/d2d/d2d34e8dec58c3823bbff493c14dd389.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 104, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Maxence Jacquot", "Axel Faux"], "genres": ["Action"], "publishers": [], "esrb_rating": null}