{"id": 632613, "slug": "boda-send-the-plant-home", "name": "B.O.D.A. — Send the Plant Home", "name_original": "B.O.D.A. — Send the Plant Home", "description": "B.O.D.A. — Send the Plant Home\r\n\r\n<p>In the distant future, desperate humans watched the unmanned spaceship lift-off, carrying hundreds of small robots to an unknown galaxy. There is only one purpose of the journey: to bring back what humans already lost in tens of decades - the plant. The mission takes 3,240 years to accomplished. When the spaceship is making its way home, it met the terrible meteoric shower, which put the whole mission stuck in despair...</p>\n<p>B.O.D.A. is a fascinating puzzle game that is presented with 30 handcrafted levels, The game title B.O.D.A. is named after the little robot - <em>Botanical Observation and Delivery Android.</em> Your job is to guide the little tiny robot to complete its mission: re-activate the hyper engine of the stranded spaceship to send the plant home. The plant is the only hope to save the Earth's ecology. \r\n</p>\n<p>However, the journey in front of the robot and the plant is tough and long. There are so many unknown threats hiding in the darkness of the spaceship. Would you help the robot finish its mission? Would you help to send the plant home to save the Earth? It will all depend on your wise decision. \r\n</p>\n\r\nThe Gameplay\r\n\r\n<p>Within 30 handcrafted levels in the game, B.O.D.A. will faces lots of exciting obstacles: aliens, misbehaving robots, lasers, and so on. The tiny robot - B.O.D.A. - will explore the stranded and visit lots of outer-space environments from the oxygen lab, engine room to the final destination -- the bridge. Would you please make sure you will protect the plant carefully and not break any poor spaceship computers anymore?</p>\n\r\nHow to play B.O.D.A.\r\n<p>Arrow Keys: Move the Robot</p>\n\n<p>X + Arrow Keys: Move the Plant (within the signal range)</p>\n\n<p>Drag the Plant to attack enemies</p>\n\n<p>Solve the puzzles</p>\n<p>\n</p>\r\nMaking Of\r\n\r\n<p>The game is designed and created by Wei-Fan Chen.  The game is fully created with PICO-8. Pixel art and music are both created by Wei-Fan Chen. The journey of creating the game is really enjoyed. I have not use any other software when creating the art and music, everything is in PICO-8, such a wonderful journey. The trailer has been made with Splice app. </p>\n<p>This is the second PICO-8 game of Wei-Fan Chen. Thanks to Dylan Bennett's awesome zine <em>Game Development of PICO-8 and </em>Krystian Majewski<em>'s Making a Roguelike </em>YouTube tutorial, I've really learned lots of thing from the them.</p>\n<p>Thank you for playing. Hope you enjoy the game. <br/></p>", "metacritic": null, "released": "2021-07-07", "tba": false, "updated": "2021-07-09T05:47:01", "background_image": "https://media.rawg.io/media/screenshots/2bc/2bc9b9a59d64ad61e39b4a8071de4895.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 109, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["Wei-Fan Chen"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}