{"id": 632862, "slug": "toyshooters", "name": "ToyShooters", "name_original": "ToyShooters", "description": "<p>ToyShooters is a miniature figure themed free to play third-person shooter with fast-paced gameplay.<br/>Having 7 weapons available at all times makes the gameplay unique.<br/>Master all the weapons and their mechanics to become the best player anyone has seen.</p>\n<strong>Weapons</strong>\n<p>There are 5 types of weapons available.</p>\n<p>\n<br/></p>\n<p><strong>Melee</strong> <br/>They have short attacking ranges, which means you'll need to get nice and close to your target. But that shouldn't be a problem, as their light weight increases your speed in battle. On top of that, melee weapons also give you the double jump ability!</p>\n<p><strong>Rifle</strong><br/> These rapid firing firearms are deadly accurate and deal a good amount of damage to your enemies from all distances. Movement in battle does not suffer when handling a rifle, giving you all the agility you'll need to outmaneuver your opponents.</p>\n<p><strong>Shotgun</strong><br/> Their low accuracy will prevent you from using them to shoot your targets from long distance. But as every good player knows, nothing beats a good shotgun blast to stop your enemies in their tracks. Recommended for players with revenge on the mind your opponents.</p>\n<p><strong>Sniper Rifle</strong><br/>Snipers are extremely accurate over long distances, and a confident shooter can take out an opponent with a single shot. It also helps to have a scope zoom, so you can get a close look at your next unsuspecting victim. Pro snipers be warned, jealous enemies will accuse you of camping.</p>\n<p><strong>Grenade Launcher</strong><br/>Grenade Launchers are equipped with multiple firing special rounds that will instantly terminate your target. They are most efficient for tactical strikes against unsuspecting victims and overly confident enemies. Experts will rain destruction from above upon all their opponents.</p>\n<strong>Gamemodes</strong>\n<p>\r\n </p>\n<p><strong>Team Death Match</strong><br/> Go, go, go! Team Deathmatch challenges players to work together to kill the opposing team and reach the target kill goal. Utilizing weapon combos and organizing strategic team play will help teams get ahead of the competition. Do not underestimate the value of good team play. The team who works together best will usually end up the victors of the match. Communicate, combat, and conquer!</p>\n<p><strong>Free for All</strong><br/> It's every toy for themselves! Players must keep their eyes and ears open, as enemies will be ambushing from every direction. Free for all is where individual skill is on display, as players must fend for themselves against a number of other fierce competitors. The first player to reach the target kills wins the match. Forget team work and team play. This mode is for the lone wolves. This is Free For All.</p>\n<p><strong>Elimination</strong><br/> Hunt or be hunted! Elimination is a team-based mode that rewards strategic, aggressive offense. When a player is killed, they're out for the round! The Radar item spawns in the middle of the map when there is 1 minute left of the round. Grab it and you'll be able to see every remaining enemy on the map. It's a fight for map control! Hang back, and you'll surely be eliminated. Push forward, and you'll be the eliminator.</p>\n<p><strong>Close Combat</strong><br/> Sharpen up your melee weapons, because Close Combat is all about getting up close and personal with your enemy! This specialty mode restricts players to using only melee weapons. Test your timing and refine your reactions through repeated close-range battles with your enemy!</p>\n<p><strong>Sniper Mode</strong><br/> Teams must work together to kill the opposing team and reach the target kill goal. But only with snipers! Bring your friends and play against each other to see who will dominate the battlefield with his sniping skills! Don't forget, keep low and move fast, that's the only way to win in Sniper Mode!</p>\n<strong>Maps</strong>\n<p>1) Chess</p>\n<p>2) Bitmap</p>\n<p>3) Castle</p>\n<p>4) Neighborhood</p>\n<p>5) Rumpus Room</p>\n<p>6) PVC Factory</p>\n<p>7) Hobby Shop</p>\n<p>8) Toy Garden</p>\n<strong>System Requirements</strong>\n<strong> System Requirements</strong>\n<strong> Minimum</strong>\n<strong> Recommended</strong>\r\n\r\n\r\n CPU\r\n 2.0 GHz\r\n 2.0 GHz or higher\r\n\r\n\r\n Memory\r\n 1 GB\r\n 2 GB\r\n\r\n\r\n Video Card\r\n Intel HD Graphics\r\n Intel HD Graphics\r\n\r\n\r\n Hard Disk\r\n 500 MB\r\n 1 GB\r\n\r\n\r\n System\r\n Windows 8\r\n Windows 8 or higher\r\n\r\n\r\n Direct X\r\n 9\r\n 9 or higher\r\n\r\n\r\n Internet\r\n Cable/DSL\r\n Cable/DSL or better", "metacritic": null, "released": "2021-07-06", "tba": false, "updated": "2021-07-09T06:53:22", "background_image": "https://media.rawg.io/media/screenshots/fc5/fc5dc89d4b183d68e0aa52849ad5fd70.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 184, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Remake Network"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}