{"id": 632851, "slug": "project-wizzy", "name": "Project Wizzy", "name_original": "Project Wizzy", "description": "<p><strong>Informationen</strong><br/></p>\n<p>Ein Point&amp;Click-Adventure entwickelt von Midnight Magic im Rahmen des Projektmanagement-Kurses im Studiengang Game Produktion und Management an der Hochschule Neu-Ulm im Sommersemster 2021.<br/></p>\n\n<p><strong>Project Wizzy</strong><br/></p>\n<p> Der Tag der Aufnahmeprüfung steht vor der Tür und Wizzy will keine Zeit verlieren. Wie üblich sitzt er an seinem Lieblings Platz vor dem großen Fenster. Unermüdlich bereitete er sich in der letzten Zeit auf die Aufnahmeprüfung vor und so langsam holte ihn die Müdigkeit ein. Die Zeit verfliegt und die Augenlieder des kleinen Zauberers werden immer schwerer. Und so, ohne dass es Wizzy bemerkte, wird die Welt um ihn herum langsam schwarz, bis er in einen tiefen Schlaf sinkt.</p>\n<p>Mehrere Stunden später erwacht Wizzy aus seinem Schlummer. Schnell bemerkt er, dass es draußen mittlerweile dunkel ist und er ganz allein in der Bibliothek übriggeblieben ist. Hastig richtet er sich auf und springt vom Stuhl. Sein Notizbuch reagiert rasch und empört darüber, dass es eine recht lange Zeit in einer ungünstigen Position verbracht hat. Immer noch leicht verwirrt, fängt Wizzy an langsam zu realisieren, in was für einer Situation er sich gerade befindet. Furcht steigt in ihm auf, ganz allein, in der Akademie bei Nacht. Der kleine Magier muss nun seinen ganzen Mut zusammenfassen und es schaffen seine Ängste vor der Dunkelheit zu überwinden, um die Akademie verlassen zu können.</p>", "metacritic": null, "released": "2021-07-06", "tba": false, "updated": "2021-07-09T06:50:04", "background_image": "https://media.rawg.io/media/screenshots/801/801a871370486fd3c3d4cd0bb2801e88.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 119, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Midnight Magic"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}