{"id": 63306, "slug": "trains-things", "name": "Trains & Things", "name_original": "Trains & Things", "description": "Features<br/><br/><strong>Multiplayer via the Internet and LAN</strong> is what sits at the heart of Trains &amp; Things. Designed from the ground around multiplayer. I don't know about you but trains are fun, but what is better is trains with your friends (or against them?)!<br/><br/><strong>Real time economic strategy</strong> means no waiting around for people to take their long winded turns. The battle, er business, waits for no man. As the saying goes, time is money, so take every second to get leverage over the competition.<br/><br/><strong>Manage a logistics company</strong> by your self or in partnership with your friends. Take out a loan from the bank to build your empire and try not to sink in debt before your rise to corporate domination.<br/><br/><strong>Build railways</strong> as you extend your reach and your profits. Use what ever means secures the resources that will bring in the cash. <br/><br/><br/><br/><strong>Transport numerous goods to meet supply and demand</strong>, because diversifying is safer than putting all your eggs in one basket where the competition is likely to make an impact.<br/><br/><strong>Custom maps</strong> allow for you to not only take your corporation to Hawaii, Australia or Europe but also to the rest of the world... and maybe even mars! It all comes down to the creativity of the Trains &amp; Things community.<br/><br/><strong>Mod support</strong> helps extend a game's life time. Games without mod support are played once and fall into the vortex of unforgettable games. Yet those games with great mod support last longer and allows for those budding developers in the community to sharpen their craft.<br/><br/><br/><br/><strong>Simple and easy track building</strong> makes laying down tracks a pleasure. If you've ever played other games that require you to lay down tracks and roads you will know how frustrating this can be. We have taken the time to implement a system that is quick, easy and intuitive and a system that does not offend your OCD.<br/><br/><strong>Cross platform multiplayer</strong> between Windows and Linux works out of the box because your OS shouldn't be a barrier to playing. We also have a Mac build on the drawing board, we aren't totally sure yet if this will pan out.<br/><br/><br/><br/><strong>Strategic zoom</strong> is a feature of some of the best RTS games which has been thrown out in this modern era of console gaming. You will not have to grind your face along the ground. We let you take in the whole world and see it through the eyes of astronauts! This means your UI isn't cluttered with unnecessary mini maps.<br/><br/><strong>Built on Godot and open source tools</strong>. We tried Unity on our last project, Dog Fight, but it was severely limited so we moved to UE4 which was which significantly better but not without its own problems. This time around we are working with the Godot engine which has improved the turn around time to go from idea, to development, to reality.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:56:46", "background_image": "https://media.rawg.io/media/screenshots/ec2/ec23b156e82c2ab488db7cedc66c1c14.jpg", "website": "http://bitshift.io/trains-and-things/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 105, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC", "macOS"], "developers": ["bitshift"], "genres": ["Strategy"], "publishers": ["bitshift"], "esrb_rating": null}