{"id": 633102, "slug": "traction-downhill-rally", "name": "Traction - Downhill Rally", "name_original": "Traction - Downhill Rally", "description": "NEW RELEASE\r\n<p>Drift your way down the mountain in style as you race against the clock, or take your time... enjoy the views in a beautifully hand crafted world. <br/></p>\n\n<p>Traction - Downhill rally is an arcade like racing game with a focus on flow and feel as you race, jump, drift and slide your way to the finish line. This game will have you on your toes ready for what's around the next corner as you make quick decisions and act fast to keep your times up and your car in tact. </p>\n<p>Enjoy the wonders of four beautifully hand crafted maps as you race and explore. Compete against the clock and land yourself a high score on the global leaderboard or cruise the map and find hidden secrets and shortcuts as you descend the unforgiving mountainous terrain.</p>\r\nGameplay:\r\n<p>Traction - Downhill Rally features a unique top down camera playstyle that will have your spatial awareness and reflexes challenged at every corner. Once the learning curve has been overcome you will find yourself in a state of flow as you continue to improve your handling and memory of the tracks.</p>\n<p>There are currently four stages to be completed each with a global leader board all set in a beautiful pine mountain environment. Each stage is unique and will require a different skill to complete. </p>\r\nControls:\r\nMouse &amp; Keyboard:\r\n<ul><li> W/S - Accelerate/Brake</li><li>A/D - Steer</li><li>Spacebar - Handbrake</li><li>RMB - Boost</li><li>Esc - Pause</li></ul>\r\nPlaystation Controller:\r\n<ul><li>R2 - Drive</li><li>L2 - Brake/reverse </li><li>Left joystick - steer</li><li>Square - Handbrake</li><li>x - boost</li><li>options - pause</li></ul>\r\nXbox controller: (NOT YET SUPPORTED)\r\n<ul><li>RT- Drive</li><li>LT - Brake/reverse</li><li>Left joystick - steer</li><li>X - Handbrake</li><li>A - boost</li><li>Start - Pause</li></ul>\r\nAlpha testers comments:\r\n<p>\"Once I got the hang of the driving, it was beautiful sliding down those hills\"</p>\n<p>\"Interesting concept and a great execution\"</p>\n<p>\"Definitely a great game for those up to a new challenge\"</p>\n<p>\"I am in love with the art style\"</p>\r\nDevelopment:\r\n<p>This game is still under development. Those who get in early through itch will be able to obtain the game for FREE until the end of February 2021 and become a part of the journey as we wrap up the final steps of development. There are plenty of updates and free DLC planned after initial release to bring new features and content to this game. A steam update is planned for May 2021 where any users who have purchased the game from itch will receive a free steam key.</p>\r\nPlanned Features:\r\n<ul><li>Vehicle selection</li><li>Vehicle customisation</li><li>Additional rally trials</li><li>Playground track to practise your skills</li><li>Full controller support</li><li>Mac support</li><li>Profile features</li><li>Map creator</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2021-07-09T07:55:34", "background_image": "https://media.rawg.io/media/screenshots/379/379714bbd8c7c1ba3320eb054fd9b77f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 47, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["F3four"], "genres": ["Racing"], "publishers": [], "esrb_rating": null}