{"id": 633123, "slug": "gridlocked-a-puzzle-game", "name": "Gridlocked - a puzzle game", "name_original": "Gridlocked - a puzzle game", "description": "Connect the houses\r\n<p>Houses exist on a grid, and you need to connect them to the power station or water tower. Tap blocks to rotate them and line up wires or pipes. Once every block is powered, you win!</p>\n<p>Tap the lightning bolt or water drop to switch between the power station and the water tower.<br/></p>\n<p>A simple and addictive puzzle game, good for passing the time and exercising your logical mind.<br/></p>\r\nTwo difficulties to solve\r\n<p>Beat every puzzle on two separate difficulties:</p>\n<ul><li><strong>Normal</strong> - Solve as usual. Rotate blocks to connect them to each other.</li><li><strong>Gridlocked</strong> - Once you're done rotating a block, it locks into place. No take backs!</li></ul>\r\nMade for mobile\r\n<p>Gridlocked is for casual, mobile gaming, but it can be easily played on the computer as well. Your progress can be backed up and transferred between devices.</p>\r\nFree and Open Source\r\n<p>Gridlocked's code is licensed by Alex Leone under GNU GPL 3.0, a free software license. Graphics are released by Alex Leone under CC-BY-SA 4.0, a free culture license. You can download the source code and assets for free on GitLab.</p>\n<p>You can download Gridlocked for <strong>free</strong> on the <strong>Google Play Store</strong>.<br/></p>\r\nMac and Linux versions\r\n<p>We're currently working on Gridlocked for Mac and Linux. Hopefully they'll be done soon. Follow this project to be notified when they're available!</p>\r\nTranslators\r\n<ul><li>Spanish - Katie Kolodzie  \r\n</li><li>Dutch - Andrew Donders</li><li>Norwegian - Alex Leone\r\n</li></ul>\n<p>If you'd like Gridlocked to be translated to another language, or if you'd like to translate Gridlocked to another language, leave a comment below!</p>\r\nContact\r\n<p>Report bugs you find by submitting an issue here. Direct all other questions and feedback to me@alexjleone.com, or leave a comment below! I'd love to hear what you think.<br/></p>", "metacritic": null, "released": "2021-07-04", "tba": false, "updated": "2021-07-09T08:02:22", "background_image": "https://media.rawg.io/media/screenshots/c3a/c3a5e3b0dfce133f2545868c528c1ada.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 56, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Android"], "developers": ["Alex Leone"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}