{"id": 633168, "slug": "the-rhythm-hunting-half-demon", "name": "The Rhythm Hunting Half-Demon", "name_original": "The Rhythm Hunting Half-Demon", "description": "<p>This is a project made for a personal 72-hour game jam, it's a part of an idea I've had for a little bit, taken out of the larger concept and made into it's own little roguelite dungeon crawler.</p>\n<p>I tried some lighting and normal mapping stuff I haven't had a chance to experiment with and I think it makes this at the very least my most interesting looking game I've made.</p>\n<p>The artstyle ended up a bit darker and edgier than what I normally make but it was a nice change of pace, I'm quite happy with how the main character's animations turned out, but the creature designs and animations are quite lacking since I ran out of time.</p>\n<p>While I wish I had an nice in-game tutorial or other learning materials, I wasn't able to fit them into the time period of my game jam so a wall of text will have to do.</p>\n\n<p><strong>Controls:</strong></p>\n<p>Z - Parry</p>\n<p>X - Attack</p>\n<p>C - Grab</p>\n<p>V (Hold) - Vision</p>\n<p>Tab - Switch Spirit</p>\n<p>You can also click on spirits at the top of your screen to switch to use their active ability.</p>\n\n<p><strong>Guide:</strong></p>\n<p>Enemies will attack you to the beat of the music, so audio is required and headphones are recommended.</p>\n<p>You can parry attacks my pressing Z shortly on the beat, then counterattack with X!</p>\n<p>Additionally, if an enemy's health is the colour of their soul and they are below 20% health, you can grab them right as they attack you with C to replace your currently select soul with theirs, to see the colour and stats of a soul, hold V.</p>\n<p>Souls have two stats, power and magic, power effects how much damage you deal by attacking with X, magic affects you passive and active abilities, which depends on which element you are using. Active abilities can be used by clicking on the spirit at the top of your screen, passive abilities are always in effect.</p>\n\n<p><em>Active</em></p>\n<p>Fire - Deals minor damage to all enemies</p>\n<p>Earth - Deals major damage to a single, random enemy</p>\n<p>Water - Heals the user</p>\n<p>Dark - Deals damage to <strong>everyone</strong></p>\n<p>Light - Deals damage to all dark creatures</p>\n\n<p><em>Passive</em></p>\n<p>Fire - Deal 10% extra damage and deal bonus damage to <strong>Earth</strong></p>\n<p>Earth - Take 10% less damage and deal bonus damage to <strong>Water</strong></p>\n<p>Water - Heal damage at the end of your turn and deal bonus damage to <strong>Fire</strong></p>\n<p>Dark - Deal extra damage if you have taken a hit this turn and deal bonus damage to <strong>Light</strong></p>\n<p>Light - Deal extra damage if you have not taken a hit this turn and deal bonus damage to <strong>Dark</strong></p>\n\n<p>At the end of each battle, you will get the opportunity to increase the power or magic of a randomly pre-defined spirit, or increase your maximum health.</p>\n<p>After finishing a floor, you can choose a new door to travel through, different doors have different quirks on the following rooms in the floor, so choose carefully.</p>\n\n<p>There are more things to discover because scope creep is a lie and I have no restraint, but you should be able to pick up the rest as you go, have fun and happy dungeon diving!</p>", "metacritic": null, "released": "2021-07-05", "tba": false, "updated": "2021-07-09T08:15:34", "background_image": "https://media.rawg.io/media/screenshots/60f/60f55069cb9b786c1dae79d6523076ee.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 340, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Tim David"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}