{"id": 633101, "slug": "mindflip-mindflip", "name": "MindFlip (MindFlip)", "name_original": "MindFlip (MindFlip)", "description": "<p>&gt;ATTENTION:  VERSION IS 0.9   ENGLISH LANGUAGE WILL BE READY BY THE END OF JULY, THE GAME MAY STILL PRESENT BUGS AND HICCUPS, BUT IT IS STILL FULLY PLAYABLE&lt;</p>\n<p>LANGUAGES:</p>\n<p>-ITALIAN<br/>-ENGLISH<br/></p>\n<p>In the game you will play the role of Finn Ethan. a young man that,  after murdering his parents,  embarks on a rehabilitation journey under the treatment of the psychoanalyst Arthur Eleazar. The healing process splits the game into a Platform phase and a Visual Novel phase. <br/><br/>FOUR DOORS, ONE ANSWER</p>\n<p> With a specific question, Doctor Eleazar will introduce the player to one of the 5 Platform levels, forgotten  representations of Finn's past. Inside each of them you will have to avoid the memory's enemies and reach one of the 4 Doors. Skills and reflexes will be required while the difficulty will rise to overcome Finn's fears and reach the truth. Each Door leads to a different response, deep in details or not, depending on your skill as a player<br/></p>\n\n<p> A PAST TO ANALYZE <br/></p>\n\n<p>To treat the young man's trauma, Doctor Eleazar will analyze Finn's past, studying how the brain stores information and transforms them into memories. The Door that you decide to open will lead to a response in the Visual Novel which will then reveal a part of Finn's backstory. There is a recurring theme in the patient's reminiscences: what is the motivation that led Finn to kill his parents?</p>\n\n\n\n\n\n\n<p>Check out our youtube channel :)<br/></p>", "metacritic": null, "released": "2021-07-05", "tba": false, "updated": "2021-07-09T07:55:14", "background_image": "https://media.rawg.io/media/screenshots/ab5/ab59316ebcae75dba8d407bd6c2a0a69.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 162, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["MindFlip"], "genres": ["Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}