{"id": 633404, "slug": "wu-lin-han-dao-xing", "name": "武林悍刀行", "name_original": "武林悍刀行", "description": "The Devil's Cult invaded the Martial Union, and there were corpses and blood everywhere! Only the protagonist escaped, from then on the burden of saving the jianghu falls on your shoulders. In the classical game of fighting bosses and dropping equipment, there are many novelties added to the game. There are also more than 10,000 yuan treasures and a lot of rewards for all new players!<br/><br/><strong>◆Lots of benefits◆</strong><br/>The first seven days for new players, you can log in every day to receive a generous amount of Yuan Bao, worth no less than 10,000 yuan!<br/>Achievement system is the only way to get VIP experience, all VIP experience can be obtained for free!<br/><br/><strong>◆Game features◆</strong><br/>Three occupations to choose from<br/>Each occupation has more than ten kinds of skills, and can also form continuous techniques<br/>Hundreds of pieces of equipment can be obtained for free in various ways in the game<br/>The guild can be formed to teach with other guilds, and can also be the master of the martial arts<br/><br/><strong>◆Profession introduction◆</strong><br/>Knives: high damage, melee occupation, good at damage reduction<br/>Assassin: high burst, melee occupation, good at control skills<br/>The piano master: high damage, long-range occupation, good at damage enhancement<br/><br/><strong>◆Rich levels◆</strong><br/>Dozens of levels of varying difficulty for players to explore, dozens of BOSSes of varying strength waiting for players to challenge, the legend is yours to build! You can choose to confront the evil BOSS with your comrades, or you can face the heavy challenge difficulties alone.<br/><br/><strong>◆Diverse equipment◆</strong><br/>Hundreds of pieces of equipment drop randomly from different bosses, and as long as you have patience, all equipment can be obtained. Choose different equipment to face different environments, skill and strategy co-exist. High-level equipment also has a set effect, together with a set can get a great strength increase!<br/><br/><strong>◆Many ways to play◆</strong><br/>Every day at a fixed time there will be a rich reward activities open<br/>The role of reputation: you can get a lot of yuan treasure<br/>The role of prestige: you can get a lot of prestige and open the title of storming<br/>The group of heroes: the winner can get a lot of rewards<br/>Heavenly descent: you can get more mall props and even SSS-level equipment may be obtained<br/>White's secret: you can get a lot of equipment<br/>Guild Brawl: the whole service guild to compete, the winner can get a lot of yuan treasure<br/>In addition, there are a lot of random activities open, unlimited passion!", "metacritic": null, "released": "2021-07-08", "tba": false, "updated": "2021-07-12T02:11:59", "background_image": "https://media.rawg.io/media/screenshots/ad2/ad2cef7ab8a00621e21d382b999a1710.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 454, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Wuxia"], "genres": ["Action", "Adventure", "RPG", "Casual", "Massively Multiplayer", "Indie"], "publishers": ["Wuxia"], "esrb_rating": null}