{"id": 633466, "slug": "block-blast-sudoku-puzzle", "name": "Block Blast: Sudoku Puzzle", "name_original": "Block Blast: Sudoku Puzzle", "description": "If you are into exciting block games with fantastic visual and sound effects, you must get Block Blast: Sudoku Puzzle. Its classical woody design and minimal color scheme allow you to focus on the game in a very relaxing way, making it perfect for helping you unwind.<br/><br/>This brand new game has everything you could want in a block puzzle! The gameplay of Block Blast: Sudoku Puzzle is exciting and relatively unique. You'll need to use limited moves to hit the set goal in each game to unlock the new levels as well as the powerful boosters. Various game levels are waiting for you. <br/>This 9-in-1 block puzzle has you match different-shaped blocks in horizontal, vertical, or designated 3x3 grids to clear them and complete the challenge. To keep things interesting, you can choose so many different powerful boosters such as Firecracker, Firework, Dynamite, Wooden hammer, Kettlebell, and so on.<br/><br/>Block Blast: Sudoku Puzzle is complex but straightforward simultaneously, so it never gets boring. The game is challenging enough that your mind gets a workout but easy enough that you're never stuck on the same level for so long.<br/><br/>HIGHLIGHT FEATURES<br/>● 9-in-1 block puzzle<br/>● Various levels are waiting for you<br/>● Interesting with unique gameplay<br/>● Fantastic visual &amp; sound effects<br/>● Easily rotate the blocks<br/>● Many powerful boosters to choose from<br/>● Simple but challenging<br/>● Good for relaxing and brainstorming<br/>● Free to pass time<br/><br/>The entire concept of Block Blast: Sudoku Puzzle is something you've not seen before in other puzzle games, so it's well worth picking up if you're a puzzle fan.", "metacritic": null, "released": "2021-07-05", "tba": false, "updated": "2021-07-12T02:52:36", "background_image": "https://media.rawg.io/media/screenshots/c52/c523eba0f449a1a2e9e7c188f62924da_qqUuzfM.jpg", "website": "https://athena.studio/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 127, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Athena Studio"], "genres": ["Board Games", "Puzzle"], "publishers": ["Athena FZE"], "esrb_rating": "Everyone 10+"}