{"id": 633414, "slug": "ravensword-undaunted", "name": "Ravensword: Undaunted", "name_original": "Ravensword: Undaunted", "description": "Ravensword: Undaunted is a hexen-like shooter RPG spinoff set within the Ravensword universe, focusing on dungeon crawling experience with intense melee and staff combat.<h3>THE SOULBOUND ONE</h3>A mysterious island suddenly hangs in the sky above Tyreas. As the Watch, your task is to investigate and seek a way to destroy it. But alas, once you reached the island, your soul is now bound to the devil of the Keep. Becoming a deathless, you now bound for a painful endless cycle of resurrection with no end. You can never go back to Tyreas again, and only by ending the Island curse you shall be granted eternal death. Break the curse and earn your peace to be buried within the Hall of the Heroes.<br/><br/><br/><h3>HACK AND SLASH UNTIL IT'S DONE</h3>With varying degrees of an arsenal left by the cults and inhabitants of the mysterious island, use it to overcome the vile armies or sell them for shards, the only currency accepted by inhabitant of the island. Slash through hordes of undead with any Swords, Maces, and Axes you found; or outsmart them with various devastating Staves that can obliterate them in a second.<br/><br/><br/><h3>TRAVEL THROUGH FORSAKEN PLACES</h3>From foggy wood outskirts to damp abandoned old castle, explore an ever-shifting places infested by undead in a stage-based world system with various encounter types waiting for your death.  Explore, plunder, and send the island back to the void.<br/><br/><br/><h3>CHARACTER PROGRESSION</h3>Level up and spend your skill points to upgrade your character stats in a class-less system. Be a warlock with potent arcane reserve, or a brute melee knight that slices through enemy like butter, it is up to your choice.<br/><br/><br/><h3>Early Access Contents:</h3><ul><li>3 themed zones<br/></li><li>10+ melee weapons and staves<br/></li><li>6 enemy types<br/></li><li>30 - 60 minutes of gameplay</li></ul>", "metacritic": null, "released": "2021-07-09", "tba": false, "updated": "2021-07-12T02:19:08", "background_image": "https://media.rawg.io/media/screenshots/12f/12fd08240743f0ec4f5b1f1b388bef0d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 12}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 458, "game_series_count": 2, "reviews_count": 0, "platforms": ["PC"], "developers": ["Trimatra Interactive"], "genres": ["Action", "RPG", "Indie"], "publishers": ["Crescent Moon Games"], "esrb_rating": null}