{"id": 633441, "slug": "cyber-defense-2088", "name": "Cyber Defense 2088", "name_original": "Cyber Defense 2088", "description": "Its the 80s again, the 2080s, and your mainframe is under attack from rival factions who want to take our city and all we have achieved. Multiple generations of people have settled here since 1986 and called this place their home. They are in trouble and you decide the best defense is a good offence and allow yourself to be transformed into pure energy. You leave behind the physical world and enter this new virtual reality called cyberspace! Your first priority is New Zylon, save it from these attacks, capture the enemy's code and use it unlock more weapons, turrets, and powerful AI bots in this epic tower defense shooter!<br/>\n<br/>\r\nCyber Defense 2088 is a fully immersive, 3D VR tower defense shooter. Take a journey into one of the first VR tower defense game that puts you into the action as a first person shooter with full 6 DOF movement. You will fly around in this new cyberspace world to stop attacks with many weapons and defenses. Use the parts of destroyed enemies to build turrets and unlock upgrades. Enjoy dozens of cyberpunk music tracks as you defend your city and save its citizens.<br/>\n<br/>\r\nOur game was inspired by cult classics like The Lawnmower Man and Tron. Back when the dream of Virtual Reality was still 30 years away, but now is the time!<br/>\n<br/>\r\nSome music by (Creative Commons) Jason Shaw on audionautix.", "metacritic": null, "released": "2021-07-09", "tba": false, "updated": "2021-07-12T02:37:18", "background_image": "https://media.rawg.io/media/screenshots/414/414525d08d0b0a376ba4c3b598f4e793.jpg", "website": "https://www.facebook.com/CalmingWindsProductions", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 202, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Tazzo"], "genres": ["Action", "Strategy"], "publishers": ["Calming Winds Productions"], "esrb_rating": null}