{"id": 63354, "slug": "dont-pray-to-satan", "name": "Don't Pray To Satan", "name_original": "Don't Pray To Satan", "description": "YOUR CITY HANGS IN THE BALANCE -<br/>YOU MUST SHOW THEM THE WAY<br/><br/>Don't Pray To Satan is an unforgiving city simulator/strategy game, where you must monitor and prevent your city's inhabitants from praying to Satan and bringing about the end of days. <br/><br/><ul><li>Feel vexation like never before as the city you just spent 4 hours keeping alive sacrifices themselves to unholy hellfire at their own hands.<br/></li><li>Monitor each of your citizens for signs of corruption, and try and mitigate the damage the corrupt can do.<br/></li><li>Call upon a variety of divine powers to stem the flow of Satanism.<br/></li><li>Recruit citizens to become your Vessel to aid you in your struggle.<br/></li><li>Prepare daily for the Black Mass - the Satanist's nightly ritual which accelerates them to their goal.<br/></li><li>A fully-fledged artificial life system: citizens have homes, jobs, hobbies, interests, a daily schedule that varies... and dark secrets they keep from their neighbors.<br/></li><li>Randomly generated cities: buildings, townsfolk, jobs, businesses, everything: no two cities or its populace will ever be alike.<br/></li><li>Full day-night cycle: you must carefully monitor your citizens habits during the day, and watch out for those who stay out at night.</li></ul>", "metacritic": null, "released": "2018-04-19", "tba": false, "updated": "2019-08-28T21:56:44", "background_image": "https://media.rawg.io/media/screenshots/75f/75f9a61724708aac94c8eb64f833f4cb.jpg", "website": "http://www.dontpraytosatan.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 12}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 332, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Milkjug Studios"], "genres": ["Adventure", "Strategy", "Casual", "Indie"], "publishers": ["Milkjug Studios"], "esrb_rating": null}