{"id": 6335, "slug": "jump-jack", "name": "Jump Jack", "name_original": "Jump Jack", "description": "Get ready for a retro challenge in Jump Jack: an action platformer reminiscent of 2d side scrolling classics. Play as Jack, the game creator’s son, as he sets out to save his baby sister from the evil robots who have kidnapped her. Jump, shoot, and use a number of other abilities to maneuver through four action packed worlds and destroy any robot trash that get in your way. Simple and straightforward controls make for precise and strategic platforming action. This is not an endless runner, Jump Jack’s story unfolds from an opening cutscene all the way to an epic final boss battle. Along the way build some insanely fun combos to earn high scores, power ups, and level achievements. Can you destroy all the robots in each level in a single combo? Collecting combos is way more fun than collecting coins in Jump Jack’s combo system that is unlike any other platformer. Top it off with achievements, online leaderboards, unlockable nightmare levels, and multiple difficulty levels and you’ve got yourself  a classic platforming experience that will keep you busy for hours. <br/><br/>Do you have what it takes to save your sister from these evil robots? See for yourself in Jump Jack.<br/><br/>Features:<br/><br/>-A retro challenge reminiscent of platforming classics.<br/>-Precise and straightforward touch controls that make for an action packed, strategic platforming experience. <br/>-Insanely fun combo system unlike any other platformer. String together actions for high scores, level achievements, and power ups.<br/>-Three difficulty modes: Normal, Retro Hard, and Casual Easy (Something for everyone).<br/>-An epic adventure played throughout 20 levels across 4 worlds and an intense final boss.<br/>-Unlockable levels in “Jack’s Nightmare” for the most hardcore gamers.<br/>-Gamecenter leaderboards and achievements. <br/><br/>Check out the live action trailer at rossmanbrosgames.com<br/>Follow us on twitter: @RossmanBros", "metacritic": null, "released": "2015-10-11", "tba": false, "updated": "2019-10-22T14:28:50", "background_image": "https://media.rawg.io/media/screenshots/011/011dfe60ee63f78f159e60e49050c9cd.jpeg", "website": "http://rossmanbrosgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 78, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Rossman Bros Games"], "genres": ["Action", "Adventure"], "publishers": ["Rossman Bros Games"], "esrb_rating": "Everyone 10+"}