{"id": 633609, "slug": "switcharoom", "name": "Switcharoom", "name_original": "Switcharoom", "description": "<p>For some reason there is a delay with the sound effects in the html build, so if it bothers anyone I've provided a windows download as well.<br/><br/>Note: You can read all of this in the game's help panel while listening to the music made by bobosupreme and enjoy the font made by codeman38 which is used in the game.<br/></p>\n<p>Switcharoom was made for the first Indie Tales game jam hosted by Adam C Younis in less than 72 hours by SteveMCWin and bobosupreme.</p>\n<p>Items in your room magically change their appearence (color or shape) when you enter it. The room shown in the main menu is how the room is supposed to look like: red curtains, red lazy bag, long table etc. Anything in the room that has a white outline once you hover over it with your cursor has a chance of changing. An item has an ability of being changed multiple times, even a couple of times in a row, so don't let them fool you! Your goal is to click only on the items which have changed and confirm your guess, if you select more or less items than needed, or if you select items that haven't changed you lose, otherwise you go onto the next level. Keep in mind there is a limited amount of time to complete each level (displayed by the bar above each room) with the time frame shortening as the levels increase. Note that running out of time won't necessarily result in a loss, as it is the same as you hitting the \"Confirm button\". Also I recommend you play a couple of games while having a screenshot of the original room (the one in the menu) ready as the game can be quite hard, especially in the beginning. And most importantly, have fun!</p>", "metacritic": null, "released": "2021-07-11", "tba": false, "updated": "2021-07-12T03:35:56", "background_image": "https://media.rawg.io/media/screenshots/045/04519c87c7e37f1b37a95ee4d48aea8f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 22, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["stevemcwin"], "genres": [], "publishers": [], "esrb_rating": null}