{"id": 633798, "slug": "sindirilmeyen-sistem", "name": "Sindirilmeyen Sistem", "name_original": "Sindirilmeyen Sistem", "description": "<p>ATOM MağaraJam#3’te yaklaşık 48 saatte (Cumartesi-Pazar) yapılmıştır. (Etkinlik 72 saatti fakat grup olarak yaklaşık 48 saatlik bir süre kadar toplanabildik.)\r\n  </p>\n<p><strong>Oyunun Özeti/Hikayesi:</strong>\n</p>\n<p>Oyunun başlangıcında masadan bir yemek tercih edilir. Karakter o seçilen yemeği yer. Daha sonra yenilen yemek sindirim sisteminin ilk aşamsı olan ağızda bulamaç şeklini alır. Bu bulamaç belirli koşullara bağlı olarak yemek borusu, mide ve bağırsakta sırasıyla gezinir. Yemek borusundan geçirilemeyen bulamaç kusmaya, mideyi etkileyen yemek reflüye ve bağırsağı etkileyen yemek(ler) ishale neden olmaktadır. Her yemek seçeneği karakterin sindirim sistemini bozarak sistem hatasına neden olmaktadır.   </p>\n<p><strong>Oyunun Oynanması:</strong>\n</p>\n<p>1. Ana Menü: Ana menüde üç adet buton bulunmaktadır. İşlevleri butonun üzerinde belirtilmiştir.\r\n  </p>\n<p>2. Oyunun ilk kısmı: Masanın üstündeki tabaklar butondur. Herhangi bir yemeğin üstüne mouse’ın sol tıkı ile bir defa tıklamanız yeterlidir. Bu kısımda başka bir seçenek yoktur.\r\n  </p>\n<p>3. Oyunun ikinci kısmı: Karakter seçilen yemeği yer. Ara sahnedir, kullanıcıdan herhangi bir faaliyet gerektirmez.\r\n  </p>\n<p>4.Oyunun üçüncü kısmı:  Uyarı ara sahnesi bulunur. Bu ara sahnede bu kısmın oynanışı özetlenmiştir. Engeller 30 saniye boyunca aşılabilirse bir sonraki kısma geçilir. Hareketsiz bırakarak engellerden kurtulabilirsiniz.   </p>\n<p>5. Oyunun dördüncü kısmı: Kullanıcı bu kısımda mide öz suyunda yüzen bulamaç ile mide duvarında konumu rastgele çıkan mide asidi damlacıklarını 5 defa yakalamalıdır.\r\n  </p>\n<p>6. Oyunun son kısmı: Kullanıcı bağırsaktaki bulamacı ilerletmelidir. Bu kısma kadar ulaştırılmış bulamaç yine bu kısımda sistem hatası ile son bulacaktır.\r\n  </p>\n<p>Not: Karakterin tişörtündeki yazı sahnelere göre değişebiliyor. Ayrıca Oyunda hedeflenen bazı detaylar yetiştirilememiştir. Örneğin, çiğ köfte ishali, acılı lahmacun reflüyü tetiklerken acılı adana ise her iki duruma (reflü veya ishal) da neden olmaktadır. Ancak adana için mideye geçen bulamaç belirli süre zarfında midedeki görevini yerine getirebilirse yine bağırsakta sistem hatasına neden olacaktı. Midedeki süre kısıtlaması eklenememiştir.</p>\n<p><strong>MağaraJam #3 Takım Üyeleri:</strong>\n</p>\n<p>Naci Sözer (Game Developer &amp; konsept kurma) - Unity&amp;C#</p>\n<p>linkedIn_link: https://www.linkedin.com/in/naci-s%C3%B6zer-9baa78191/?originalSubdomain=tr</p>\n<p>Hüseyin Sözer (2D Artist &amp; konsept kurma) - Adobe Illustrator</p>\n<p>linkedIn_link: https://www.linkedin.com/in/h%C3%BCseyin-s%C3%B6zer-98970a159/</p>\n<p>Merve Sözer (Konsept kurma ve feedback verme)</p>\n<p>Hazır asset kullanılmamıştır. Bunun dışında ses dosyaları da bize aittir.</p>", "metacritic": null, "released": "2021-07-11", "tba": false, "updated": "2021-07-12T04:22:58", "background_image": "https://media.rawg.io/media/screenshots/e8a/e8a4d9a564f4327e4eafd99a5fbb68f0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 34, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["huseyinsozer"], "genres": [], "publishers": [], "esrb_rating": null}