{"id": 633817, "slug": "pipespin", "name": "PipeSpin", "name_original": "PipeSpin", "description": "<p>PipeSpin is an action puzzle game for the Game Boy Advance, that involves making loops out of pieces of pipe. The gameplay takes inspiration from the venerable Pipe Mania (Pipe Dream in the US) and the GBA classic Guru Logic Champ. The hiscore music is a tribute to one of the all-time classics - actually one of the classic games and one of the classic game music composers - Tetris on the original Game Boy (which also inspired the overall game structure), whose music was composed by Hirokazu \"Hip\" Tanaka.</p><p>PipeSpin was created for GBA Jam 2021, a three-month long jam to make games for the Game Boy Advance, in celebration of the handheld's 20th anniversary. It's a system I loved in its time, and have been revisiting recently having bought a Game Boy Micro last year. It's a fun one to develop for too, and this jam has been very good experience for me in terms of following through with adding all the bits and pieces that turn a project from a playable prototype into something more resembling an actual game. I have more ideas I want to add to this game, including one or two alternate play modes, and improvements I might want to make, but I feel happy that what I've managed to get done within the jam's time limit resembles a complete, if small, package (Minimum Viable Product is the technical term).</p>How to play<p>PipeSpin is a Game Boy Advance game, so it comes in the form of a .gba file which can be played with an emulator (recommended mGBA) or loaded onto a flash cart to be played on a real GBA/DS console. There will also be a link to play it online in your browser, available soon.</p><p>See the README for full details of gameplay and controls.</p>Credits/Licence<p>See the README for full details.</p>Source<p>PipeSpin's source code is available on github under GPL v3.0<br/></p>", "metacritic": null, "released": "2021-07-11", "tba": false, "updated": "2021-07-12T04:27:08", "background_image": "https://media.rawg.io/media/screenshots/865/865599f0e1181a5d52e32f9666c04b14.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 103, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["hippydave"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}