{"id": 63384, "slug": "awakengunpowder-adventurer-daydream", "name": "AWAKEN：Gunpowder Adventurer Day.Dream", "name_original": "AWAKEN：Gunpowder Adventurer Day.Dream", "description": "Awaken as an action RPG game has a wealth of levels and a variety of way to play. We hope that players who love this type of game can experience the core content of the game as well as the overall story of the game. Adopting the Early Access mode also hopes that players can put forward valuable suggestions and suggestions for our games in the first time. This will allow us to better optimize the game and improve the game content in the later update of the game.<br/>\n<br/>\r\nThe Early Access currently includes all the main characters of the No. 1 protagonist (Day.Dream). There are a total of 24 levels, including four parkour-type recreational levels and 20 battle levels. Day.Dream's full talent panel, bomb maker panel, to better integrate into this game by experiencing the first story of the great adventures of Day.Dream.<br/>\n<br/>\r\nThe full version will include online clearances between players, local and online multiplayer modes, including confrontation mode and cooperation mode.<br/>\r\nIn addition, there will be more updates to the game's level content.<br/>\r\nIn the follow-up content, new chapters and more different characters will be added. <br/>\r\nAnd the complement of the background story of the entire hero's adventure world will describe from multiple angles.<br/>\r\nWhile enriching content, the full version will also have more complete actions and special effects, as well as UI optimization.", "metacritic": null, "released": "2018-04-27", "tba": false, "updated": "2019-08-28T21:56:42", "background_image": "https://media.rawg.io/media/screenshots/e2a/e2a63b7e66ea08b1836a4349a4c7caa2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 381, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Wheeler Studio"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["Wheeler Studio"], "esrb_rating": null}