{"id": 633885, "slug": "solar-guard", "name": "Solar Guard", "name_original": "Solar Guard", "description": "<p>A homebrew Game Boy Advance game made for GBA Jam 2021.\r\n </p>\n<p>The game is a space shooter where you complete various missions. These missions take place in the solar system.\r\n </p>\n<p>This game is in a state of development (i.e. any build thus far can  be considered a development version as the game is not feature/content  complete).\r\n </p>\n<p>This game was made using GValiente's Butano engine).\r\n </p>\r\n Butano is a modern C++ high level engine for the Game Boy Advance.\r\n \r\nRunning the Game\r\nUsing a GBA Emulator on PC\r\n<p>To run the game, download a GBA emulator (mGBA is a good choice) and run the .gba file in it.\r\n </p>\n<p>Alternatively, any hardware that runs .gba files on an actual Game Boy Advance (e.g. Everdrive or EZ-FLASH) can be used to run <em>Solar Guard</em> on a GBA (or DS with backwards compatibility).\r\n </p>\n<p>If you have a modded 3DS, the .cia file made using Ultimate GBA VC Injector for 3DS by Asdolo can be used to install <em>Solar Guard</em> as a <em>Virtual Console</em> GBA title.\r\n </p>\n<p>Running the .gba file using a GBA emulator that runs on the 3DS also gets the job done.\r\n </p>\r\nOpen Source on GitHub\r\n<p>This game is open source on GitHub, under the GPL-3.0 license. More information about the game from a development perspective is available in the repository on GitHub.</p>\r\nArt Acknowledgements\r\n<p>This game uses artwork from Open Game Art and elsewhere, please see the Art Acknowledgements folder in the GitHub repository or go to <strong>Information</strong> <strong>&gt; Art Acknowledgements</strong> in the game's main menu to see attribution information for others' art assets used in <em>Solar Guard</em>.<br/></p>", "metacritic": null, "released": "2021-07-11", "tba": false, "updated": "2021-07-12T04:41:49", "background_image": "https://media.rawg.io/media/screenshots/004/0043671c76b64d01bc442e88c8c79de8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 207, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Deft Spade"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}