{"id": 63393, "slug": "mars-horizon", "name": "Mars Horizon", "name_original": "Mars Horizon", "description": "<p>In Mars Horizon the player is tasked with leading a major space agency from the dawn of the space age though to humanity&#39;s journey to Mars.<br />\nPlayers run a government space agency from when the first rockets launched into the atmosphere, right through to the first crewed mission to Mars.<br />\nResearch new tech, expand your agency base, build rockets, send satellites into orbit, and launch a variety of missions. As the player, you’re in charge of every element of the journey into space.<br />\nYOUR RACE INTO SPACE: All your decision-making and strategic prowess counts. Will you be patient in crafting the most high-tech base or strive to get the first human on Mars?<br />\nSCIENTIFIC ACCURACY: Auroch Digital has been developing Mars Horizon in affiliation with the UK Space Agency to ensure absolute detail in space travel, engineering, and the preparation needed for a successful mission into space.<br />\nCREW MANAGEMENT: Management is a key aspect of Mars Horizon and you’ll need to hire the right crew to successfully build, launch, and land on Mars.<br />\nDIPLOMATIC ALLIANCES: Enter into diplomatic partnerships with other agencies to share the rewards of space exploration, or risk going it alone for even greater benefits.<br />\nBUILD &amp; DESIGN: Construct your dream rocket from multiple vehicle parts and store its design for later missions.<br />\nCOMPONENT EXPERIENCE: Level up your vehicle parts after repeated missions to increase its reliability, and use upgrade slots for even more improvements.<br />\nUNIQUE CONTRACTORS: Agencies have a number of contractors they can call on for construction of vehicles, each with their own selection of unique benefits...</p>", "metacritic": 72, "released": "2020-11-16", "tba": false, "updated": "2023-08-14T17:18:57", "background_image": "https://media.rawg.io/media/screenshots/2c4/2c41461912eeb724f3cf0ef92daa32fa.jpg", "website": "http://www.aurochdigital.com/marshorizonvideogame", "rating": 3.43, "rating_top": 4, "added_by_status": {"yet": 8, "owned": 138, "beaten": 8, "toplay": 16, "dropped": 4, "playing": 2}, "playtime": 5, "achievements_count": 260, "ratings_count": 7, "suggestions_count": 230, "game_series_count": 1, "reviews_count": 7, "platforms": ["Xbox One", "Nintendo Switch", "macOS", "PC", "PlayStation 4"], "developers": ["Auroch Digital"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["Irregular", "Auroch Digital"], "esrb_rating": null}