{"id": 6341, "slug": "my-kingdom-for-the-princess-hd-lite", "name": "My Kingdom for the Princess HD Lite", "name_original": "My Kingdom for the Princess HD Lite", "description": "It offers plenty of hours of entertainment in a simple resource management framework, making it an impressive casual game - GameZebo.com (4.0/5.0)<br/><br/>I just had to review \"My Kingdom For The Princess\" because I think it is probably one of the best games currently available for the iPad - KitGuru Gaming<br/><br/>A horrible tornado hit King Sigmund's kingdon and woke up an evil dragon. Now it's up to you, Arthur, a brave knight, to restore the land and roads to escort Princess Helen back to her uncle. <br/><br/>My Kingdom for the Princess is an addictive, award-winning game with unique gameplay that combines time management, strategy, and simulation. Your goal within each level is to make all the repairs you need to get to the next board: fix bridges, remove trees that were blown down by the storm, break rocks and repair various structures. Manage your workers wisely to get the work done on time!<br/><br/>Features: <br/>- Unique mixture of genres - time-management, strategy, and simulation<br/>- Smooth graphics, soundtrack and voice over<br/>- Special temporary bonuses during the game - additional worker, increased worker's speed, etc.<br/>- Plenty of special tasks to keep you on toes<br/>- Diverse achievements for excellent performance<br/><br/>My Kingdom for the Princess has easy to learn rules, and offers lots of opportunities to create different strategies. Let the quest for Princess Helen's heart begin! <br/>----------------------------------------- <br/>Like games by Nevosoft?<br/>Why not try some of our other games! <br/><br/>Supercow: super-dynamic arcade game about the adventures of a new character that deserves everyone's attention! Supercow doesn’t give milk, she just rocks! <br/><br/>Magic Academy: fascinating adventure game that mixes hidden object hunts with mini-games and sorcery <br/><br/>My Kingdom for the Princess 2: The adventures of Arthur and Princess Helen continue in this long awaited sequel to the addictive strategy, time management, simulation game <br/><br/>Zzed: a logic marble-popper game filled with fun and humor! <br/><br/>Dream Sleuth: Travel in the world of your dreams and save the girl in this thrilling hidden object puzzle adventure! <br/><br/>Laura Jones and the Gates of Good and Evil: Meet amusing characters and hunt for hidden objects as you try to save the world. <br/><br/>Laura Jones and the Secret Legacy of Nikola Tesla: Test your Hidden Object skills as you race against time and the other people chasing down Tesla's invention! <br/><br/>Pantheon: Unlock magic artifacts of ancient deities on an amazing match-3 journey through beautiful locations of the Ancient India. <br/><br/>10 Talismans: Set to stunning oriental vistas, this match-3 puzzle game puts you on a quest to collect ten powerful talismans. <br/>----------------------------------------- <br/>Get the inside scoop on Nevosoft Games: <br/>Join us on Facebook: www.facebook.com/Nevosoft <br/>Follow us on Twitter: http://twitter.com/NevosoftGames <br/>Watch us on YouTube: http://www.youtube.com/NevosoftCOM <br/>Visit our site: http://www.iphone.nevosoft.com", "metacritic": null, "released": "2010-07-02", "tba": false, "updated": "2019-10-22T14:28:50", "background_image": "https://media.rawg.io/media/screenshots/1c6/1c65bf14ad917128e13f06e5cfe72c41.jpg", "website": "http://iphone.nevosoft.com/games/my-kingdom-princess", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 256, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Nevosoft"], "genres": ["Strategy", "Puzzle"], "publishers": ["Nevosoft"], "esrb_rating": null}