{"id": 63449, "slug": "racing-glider", "name": "Racing Glider", "name_original": "Racing Glider", "description": "<strong>IMPORTANT NOTE:</strong> I'm still at work on Racing Glider! It will be greatly improved! Try it right away with the first vehicle in Time Attack Mode, and get ready for new vehicles, game modes and all good things coming in later update.<br/><br/>Racing Glider reinvents old classics of futuristic racing games by offering rally type circuits in natural and fantastic environments.<br/>You will need to master the inertia, speed and physics of each vehicle you will play to beat the times set and grab all medals.<br/>Racing Glider offers a gameplay between speed and control that will make you discover a new kind of racing game.<br/><br/><br/><strong>Main Features:</strong><br/>-Unique gameplay based on physics. Anticipate and master the forces in application on the vehicle to beat the best times.<br/><br/>-Each vehicle will have unique features as well as a dedicated circuit type. (Only one vehicle is available at the moment)<br/><br/>-Face the clock by discovering a new world at each circuit.<br/><br/>-An original soundtrack fully composed for the game.<br/><br/><br/><strong>Content planned during the early access:</strong><br/>- Mode \"Time Attack\". You will win medals to unlock other tracks.<br/><br/>- Always more tracks throughout the development.<br/><br/>- Addition of game modes such as a mode \"Survival\" and \"endurance\".<br/><br/>- Addition of other types of vehicles. Each with his own physics, speed and game mode.<br/><br/>- Addition of challenges to unlock.<br/><br/>- Addition and improvement of \"in-air\" gameplay phase .<br/><br/>- And many more good things I can do.", "metacritic": null, "released": "2018-05-03", "tba": false, "updated": "2019-08-28T21:56:39", "background_image": "https://media.rawg.io/media/screenshots/ccc/ccca565e7927c0be57c29b98a0238a37.jpg", "website": "http://mystikart.fr/games-2/racing-glider/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 20, "toplay": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 315, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mystik'Art"], "genres": ["Sports", "Racing", "Casual", "Indie"], "publishers": ["Mystik'Art"], "esrb_rating": null}