{"id": 63443, "slug": "pixelum", "name": "Pixelum", "name_original": "Pixelum", "description": "<strong>Pixelum</strong> is a whole world made up entirely from interactive pixels, open to the players for exploration and all sorts of different interactions, combining fully destructible environment comparable to such in Worms and survival/building elements similar to Minecraft. This game has it’s own advanced system of advanced physics inspired by such simulators as Conway’s Game of Life and Powder Toy.Features at the moment<ul><li>An open, potentially endless procedurally generated 2D world<br/></li><li>Fully destructible terrain<br/></li><li>Dynamic environment with day-night and weather cycles.<br/></li><li>Hardcore survival simulator with brand new substractive health mechanics<br/></li><li>Particle and rigid body physics</li></ul>This list will get longer over time, because I have got tons of different ideas (as Multiplayer) on which I’m working really hard at the moment.Questions &amp; AnswersQ: Does this video show us how the game will look like in future?<br/>A: No, not really. I do realize there must be done significant progress and improvements upon the graphics, so we are working on it heavily with 2D artist at the moment, implementing lot of ideas and making the gameplay and the graphics truly unique and fascinating right now.<br/><br/>Q: But how intense is the development process now?<br/>A: Every day I work on a project and feel quite confident about the final results (see more at 'Why Early Access?')", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:56:39", "background_image": "https://media.rawg.io/media/screenshots/80b/80bd93e9514bdf94dce7d14a4089f179.jpg", "website": "http://pixelum.net", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 182, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ZXC Games"], "genres": ["Adventure", "Simulation", "Indie"], "publishers": ["ZXC Games"], "esrb_rating": null}