{"id": 634631, "slug": "parasocial", "name": "Parasocial", "name_original": "Parasocial", "description": "<p><strong><em>Note: Was made within 24 logged hours as a self-imposed game jam. Parasocial is a recreation of Discount Slender</em></strong></p>\n<p>Throw rubbish at the parasocial andy to slow them down and gain your viewers!</p>\n<p><strong>Developed proudly by</strong><br/></p>\n<ul><li>Tiger Collins - itch.io , portfolio</li></ul>\n<p><strong>Parasocial relationships can be simplified to the following; Having an affinity or liking to someone you've never met or doesn't know you exist, resulting in possessive behaviour over the other person.</strong><br/></p>\n<p><strong>These relationships are common amongst those who consume content on social media, especially Youtube and Twitch.tv.  </strong></p>\n<p>So, how about you live a moment in the life of a streamer who is broadcasting their camping trip but you're being followed by a viewer. Unfortunately, you also want to grow your audience, so you have to balance entertaining your gremlin viewers with surviving the parasocial andy</p>\n<p><strong>Features</strong>\n</p>\n<ul><li><strong>Full Controller Support:</strong> Whether you want a laid-back experience or just want to play as if you're on a home console, Parasocial has complete controller support.\r\n</li><li><strong>Environment:  </strong>You the environment to lose track of the parasocial andy, but will your viewers find it interesting?</li><li><strong>Changing Enemies:</strong> Parasocial andy's change appearance every time and change speed depending on how long you're streaming for, so it's never the same each moment!</li></ul>", "metacritic": null, "released": "2021-07-10", "tba": false, "updated": "2021-07-12T07:43:24", "background_image": "https://media.rawg.io/media/screenshots/0cc/0ccd7d2b6bf30f71eac38df42f2502b6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 128, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Tiger Collins"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}