{"id": 634776, "slug": "little-dungeon-town", "name": "Little Dungeon Town", "name_original": "Little Dungeon Town", "description": "<p>Build a village in front of the nearby dungeon, exploit adventurers for profit &lt;3</p>\n<p>This is another small game I made over a few weekends. I <em>might </em>add more in the future/fix bugs so please let comments and thoughts on the game. </p>\n<p><strong>How to Play</strong></p>\n<p>General</p>\n<ul><li>WASD pan camera</li><li>Hold Right Mouse to rotate the camera</li><li>Scroll wheel to zoom</li><li>Use the number keys to navigate the build menu<br/>\n</li><li>Tab or Escape to return to the root of the build menu</li></ul><p>Extra Shortcuts</p><ul><li>Pressing R will cycle the selection through all adventurers in town\r\n</li><li>Pressing F will cycle the selection through all towns people\r\n</li><li>Time can be controlled from with the buttons in the bottom right corner of the screen<br/>\n</li></ul><br/>\n<p>Building</p><ul><li>After building your town hall you can recruit more villagers or upgrade the dungeon<br/>\n</li><li>Hover over build items with your mouse to see how much it will cost to build</li><li>Left click once a valid building is highlight to try and place it down</li></ul>\n<p>Workers</p>\n<ul><li>Villagers need jobs, select them with left mouse and then use the assign job button to give them a job<ul><li>Option one allows you to clunkily assign them to a building, once assigned they will produce resources for that building or sell to adventurers</li><li>Option two and three tell the worker to begin harvesting food or trees respecitively</li></ul></li></ul><p>Apologies to anyone playing on a non-16:9 monitor, the UI scales very poorly. <br/></p>\n\n<p>Special Thanks</p>\n<p>-Thanks to the spunk crew for answering my programming questions</p>\n<p>-I used a few spunk tools building this so also thanks to spunk for that :)</p>", "metacritic": null, "released": "2021-07-10", "tba": false, "updated": "2021-07-12T08:20:47", "background_image": "https://media.rawg.io/media/screenshots/c27/c2767d19c3e33c669989aa3e706451b3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 34, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Nicholas McDonnell"], "genres": ["RPG", "Strategy", "Simulation"], "publishers": [], "esrb_rating": null}