{"id": 634951, "slug": "expand-your-land", "name": "Expand Your Land", "name_original": "Expand Your Land", "description": "<p>:</p>\n<p>The game is about taking over \"key\" tiles (yellow tiles) to create connections to Extend Your Land.  If one key tile is able to reach another key tile by traversing down a straight line, then a connection is made, and the land between the key tiles belongs to you. Each owned land generates 1 gold per day. <strong>Your goal is to destroy all enemy units.</strong></p>\n<p>In the game there are two kinds of key tiles. Player owned key tiles and neutral key tiles. The neutral key tiles are tiles that have not yet been claimed by a player. Neutral key tiles become part of a player's land if it exists in a connection between two player owned key tiles, and as a result creates additional connections for the player while the connection exists.<br/></p>\n<p>The game can be played with 2-4 players locally. The game has an easy/normal difficulty AI that you can play against. Toggle between CPU and Player in the Menu screen.</p>\n<p><strong>Rules</strong>:</p>\n<p>The game is turn-based.  In each turn, the player has a maximum of 2 moves. If you end turn without performing a move, then you pass for the remainder of the day. After all players have passed, a new day starts. Upon a new day, all units become ready, and all players gain 1 gold for each land they control.</p>\n<p>Starting turn order changes systematically every day. The player that started the first day, will be last in the turn order the next day.</p>\n<p><strong>Actions</strong>: </p>\n<ul><li>Buy a new Unit</li><li>Upgrade an existing Unit</li><li>Move a Unit.</li></ul>\n<p>Each action exhausts the unit for the remainder of the day. <br/></p>\n<p>To move a unit, first press on one of your units, and then choose a destination, and finally confirm the move by pressing the \"Move Unit\" button.</p>\n<p>An unit can be bought by selecting a non-occupied key tile that you control (yellow tile with a border of your player specific color).</p>\n<p>Unit cost is incremented by 5 for each unit bought, but the price is not updated until a new day starts.</p>\n<p>A unit can be upgraded twice. The first upgrade costs 20 gold, while the second upgrade cost 40 gold. A level 1 unit can move a distance of 2 hexagons. The distance a unit can move is increased by 1 for each time the unit is upgraded.</p>\n<p>A unit can destroy another player's unit by placing your unit on top of the enemy unit, but only if the other player's unit is the same or lower level compared to your unit. <br/></p>\n<p>Lose condition: You lost all your units.</p>\n<p>Win condition: The only remaining units in a game belongs to one player.</p>", "metacritic": null, "released": "2021-07-09", "tba": false, "updated": "2021-07-12T09:04:29", "background_image": "https://media.rawg.io/media/screenshots/71f/71fd7ffd6e9351e3228449ef504db6b5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["IceBear's Untold Tales"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}