{"id": 634914, "slug": "vaporized", "name": "Vaporized", "name_original": "Vaporized", "description": "<p>A short adventure game developed for https://itch.io/jam/vaporjam. What if your apartment was haunted by vaporwave?</p>\n<p><strong>IMPORTANT NOTE:</strong> Do not use alt+enter to run this in fullscreen if you do not have a 16:9 display that is an exact multiple of 320x180, it will not function properly (I know what the problem is but I don't have time within the scope of the jam to fix it since it involves a built-in Unity function that I would need to replace from scratch). 1920x1080 or 3840x2160 (4k) are fine. If your base resolution is below 1080p, the game will be fine, but you will have to press page down after the game launches until the window fits on your screen properly.<br/></p>\n<p><strong>CONTROLS</strong>: </p>\n<p><strong>Left-Click</strong> to move and interact with objects, and select items from your inventory. Holding <strong>shift</strong> will allow clicking through objects to move to a specific spot<br/><strong>Right-Click</strong> to examine objects with no item selected, or clear your currently selected inventory item<br/>Move the mouse to the top of the screen to display the inventory<br/><strong>Page Up/Page Down</strong> will resize the game window<br/></p>\n<p>(Left and right click functionality are swapped if you have the primary button set to right in windows)</p>\n<p>Sometimes examining objects more than once will give you different dialogue. You may also get a different description if something about the object changes.</p>\n<p>Interactions with objects and your currently equipped item (including no item) will be displayed in parentheses in the mouseover text. Not all interactions are marked like this, and not every marked interaction is important, but every important interaction is marked.</p>\n<p>Music is L A T E N C Y by Mystery Mammal, from https://freemusicarchive.org/music/Mystery_Mammal/Latent/L_A_T_E_N_C_Y_online-au...</p>", "metacritic": null, "released": "2021-07-09", "tba": false, "updated": "2021-07-12T08:54:14", "background_image": "https://media.rawg.io/media/screenshots/7a2/7a2ec14d2d1886230903c9088c660aec.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 69, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["The Cheshire Cat"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}