{"id": 635084, "slug": "coins-machine", "name": "Coins Machine", "name_original": "Coins Machine", "description": "<p>French version below English one\r\n</p>\n<p>This Game was made for Game a week challenge #4 organised by Evans from Game Dev Teacher ( https://www.youtube.com/c/GamedevTeacher ).\r\n</p>\n<p>Theme was \"Heads or Tails\".\r\n</p>\n<p>Make a high score before you're run out of coins !<br/></p>\n<p><strong>IDEA</strong>\n</p>\n<p>In this game I wanted to recreate an old reminiscence of my childhood, Coins machine at Fun fair, but with rules that take advantage of heads or tails.\r\n</p>\n<p>I rapidly went into game development thanks to sketches of level design and rules.  <br/></p>\n<p><strong>What went well</strong>\n</p>\n<p>After resolving some weird behaviors of my UE editor, project quickly became final. Rules and level design worked well. My precedent projects help me to make a base project that I could re use.<br/></p>\n<p><strong>What went wrong</strong>\n</p>\n<p>When i started the project, I decided to use UE5, cause I wanted to progress in this version, but after a quick level design and set of base rules, I obtained weird physics behaviors.After many tests and helps of Happy tikys community I found that the problems were not in UE4 with exactly the same code. So I switch to UE4 and everything went almost well, also an update of my CG driver were incompatible with last version of UE4, because of DLSS or GSYNC, but I quickly resolved it.<br/></p>\n<p><strong>What I learned</strong>\n</p>\n<p>I better used Game Mode, Player Controller and HUD classes, Thanks to learning session of an epic game convention video, that explain différence et tips to use with. I learned to separate my specific game rules than my reusable ones. <br/><br/></p>\n<p>En français\r\n</p>\n<p>Ce jeu a été conçu pour le Game a week Challenge #4 organisé par Evans de Game Dev Teacher ( https://www.youtube.com/c/GamedevTeacher ).\r\nLe thème était \"Pile ou face\". Maxez votre score avant d'être à court de pièces !\r\n\r\n</p>\n<p><strong>IDÉE</strong>\n</p>\n\n<p>Dans ce jeu, j'ai voulu recréer une vieille réminiscence de mon enfance, la machine à pièces de la fête foraine, mais avec des règles qui profitent du pile ou face. <br/>Je me suis rapidement lancé dans le développement de jeux grâce à des esquisses de level design et de règles. <br/></p>\n<p><strong>Qu'est-ce qui s'est bien passé </strong><br/>Après avoir résolu certains comportements étranges de mon éditeur UE, J'ai pu avancer rapidement. Les règles et le level design ont bien fonctionné. J'ai pu capitaliser sur mes projets précédent. <br/></p>\n<p><strong>Qu'est ce qui ne s'est pas bien passé </strong><br/>Quand j'ai commencé le projet, j'ai décidé d'utiliser UE5, car je voulais progresser dans cette version, mais après une conception de niveau rapide et un ensemble de règles de base, j'ai obtenu des comportements physiques étranges. Après de nombreux tests et aides de la communauté des Happy tikys, j'ai pu me rendre compte que les problèmes n'étaient pas dans UE4 alors que mes paramétrages étaient strictement identiques. Je suis donc passé à UE4 et tout s'est presque bien passé, car une mise à jour de mon pilote graphique était incompatible avec la dernière version de UE4, à cause de DLSS ou GSYNC, mais j'ai vite résolu le problème. <br/></p>\n<p><strong>Ce que j'ai appris </strong><br/>J'ai mieux utilisé les classes Game Mode, Player Controller et HUD, grâce à la session d'apprentissage d'une vidéo d'une convention Epic Games, qui explique la différences et les astuces d'utilisation ce ces classes. J'ai appris à séparer mes règles de jeu spécifiques de mes règles réutilisables.</p>\n\n<p><strong>ISSUES</strong>\n</p>\n<p>it remains some issues that I will fix later :\r\n</p>\n<ul><li> Displaying correct Face in coins history (works in editor mode but not after packing :( )</li></ul>\n<p><strong>Next Features</strong>\n</p>\n<p>Will be added if I have time :\r\n</p>\n<ul><li>Start screen</li><li>options menu\r\n</li><li>High Score billboard\r\n</li><li>more Levels\r\n</li><li>Additional random bonus</li></ul>", "metacritic": null, "released": "2021-07-09", "tba": false, "updated": "2021-07-12T09:37:35", "background_image": "https://media.rawg.io/media/screenshots/e1a/e1af7c0bde1abe6aba1e9e38c4a6ac4f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 10, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["LoganBlack"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}