{"id": 635227, "slug": "pest-control-2021", "name": "Pest Control (2021)", "name_original": "Pest Control (2021)", "description": "<p>Pest Control is a combination of a simulator and a turn-based strategy, where the main task of the player is to get rid of pests .. Every assignment is a war - small, hairy, full of fangs and legs. Pests have no mercy. When Lenny finds himself alone with them, they only want one thing: to tear him apart! Yes... the job of an exterminator is a challenge! Remember, they are closer than you think!<br />\nKey features:<br />\nAn extensive system for creating machines, traps, sprays and weapons<br />\n(Collect parts, modify and improve, you have a whole arsenal at your disposal, from a hammer to a remote-controlled robot)<br />\nA total of 87 missions (side, story, adventure)<br />\n(Various types of tasks: neutralize, capture, chase, get rid of any way you want, clean traces)<br />\n39 different locations<br />\n(Villas, ruined apartments, camping sites, warehouses and others)<br />\n24 pests<br />\n(From a rat to a shape-shifting raccoon)<br />\nBase together with day and night system<br />\n(Grow your company&#39;s headquarters by improving rooms, but remember - time is money!)<br />\nUnique ways to fight each pest<br />\n(Set traps, use a swatter or a vacuum cleaner, it’s up to you to choose a method)<br />\nA wide range of sprays<br />\n(To get rid of impurities or weaken the opponent, use one of the six substances available in the game)<br />\nSkill tree<br />\n(Grow your character as a scientist and engineer, and improve his passive skills)<br />\nAdditional game modes<br />\n(In addition to story missions and regular tasks, you have special modes, such as: adventure, terror and tower defense)<br />\nBuild traps</p>\n<p>In the heart of your office you will find a laboratory and a workshop where you can design and modify the most sophisticated traps. The materials that will be used for this can be found in the store as well as during missions. Those can be later used to upgrade traps and weapons.<br />\nDiscover the city</p>\n<p>You start your work in one of the Cherryhood districts, but as you progress and your reputation grows, you will gain access to new parts of the city. There, of course, the orders will be paid better and the items found will be more and more interesting. The battlefront of your fight with pests runs through home rooms, hotels, factories, laboratories, warehouses and many other unique locations.<br />\nUpgrade your headquarters</p>\n<p>Everyone needs a place to return to after work, so you have your own base that you can upgrade. Each of the rooms (gym, laboratory, scrapper) can be expanded, which will bring you new bonuses!<br />\nCatch pests</p>\n<p>The tasks are different: sometimes it’s a simple neutralization, sometimes you have to catch a living animal, but each pest requires a different approach. Many of them also have their version on steroids, much stronger and more dangerous than a standard representative. Also, remember to clean up after work: get rid of excrement, lairs, nests, corpses... Nobody likes it when you have to clean up after professionals.</p>\n<p>PS. During the game creation no animals were harmed.</p>", "metacritic": null, "released": "2021-07-15", "tba": false, "updated": "2021-07-15T15:21:32", "background_image": "https://media.rawg.io/media/screenshots/468/4685f7075c6188e8c3a3645013a4d4ac.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 331, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["EON46"], "genres": ["Strategy", "Casual"], "publishers": ["Ritual Interactive"], "esrb_rating": null}