{"id": 635263, "slug": "pocket-mina", "name": "Pocket Mina", "name_original": "Pocket Mina", "description": "<h3>Overview</h3><br/>The story is about heroine trying to find a cure for an unknown disease. This game was made with RMXP.  It has J-RPG Turn-Based Battle with unique Custom Script. Gameplay will mainly focus on battle enemy by using items.<h3>Story</h3><br/>One upon a time there is an ever peaceful village. But one night, it's been invaded by monsters. Bringing an unknown disease to the villager. The legend says \"Meradic Herb\" which growth far away can be used to cure this disease. Despise what seems to be dangerous, the heroine ultimately decides to go there to find a way to help everyone.<h3>Features</h3><br/><ul><li> Item Synergy --&gt; You need to rely on using items to perform any traditional command-based JRPG battle such as normal attack and skills. If you run out of certain items, you will be unable to perform certain actions. Twist it a bit with Tech Upgrade to come up with difference effects out of the same type of items.<br/></li><li> Familiar Partner --&gt; In this game, you're alone. But you can choose to have an A.I. Partner traveling with you. In which you can indirectly command it. You can also use cooperate action for a greater damage or ask it to stay in defend stance.<br/></li><li> Defend Break --&gt; You convert half of your receiving damage to your defend command. Which you can unleash it back to your enemy while performing defend (defend quarter damage received). Your limit depends on your DEF value.<br/></li><li> Guarantee Escape --&gt; Escape command in this game is guaranteed to have 100% success rate. You can opt out of battle anytime you desire.<br/></li><li> Aggressive Ailment --&gt; When you use your ailment, it will always have a high success rate at 95%. While if the enemy uses it, the success rate is kept at a lower, default rate. So understanding each ailment, stocking item and using it. At the right enemy and at the right time is also an important aspect of the game. Especially in later area. <br/></li><li> Difficulty Selection --&gt; Aside from Hard Mode is harder. Hard Mode requires a different approach in order to win. Due to certain structures of the game, you can't rely on what's work in Normal Mode.</li></ul>", "metacritic": null, "released": "2021-07-12", "tba": false, "updated": "2021-07-16T03:02:14", "background_image": "https://media.rawg.io/media/screenshots/ac0/ac0aa572a6835e391843bf8d4f1af866.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 182, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["acet"], "genres": ["RPG"], "publishers": ["acet"], "esrb_rating": null}