{"id": 635265, "slug": "triversal", "name": "Triversal", "name_original": "Triversal", "description": "<strong>Triversal</strong> is a satisfying  puzzle game that offers the perfect balance of chill and challenge. <br/>Use spatial logic to suspend a light orb over a black hole by connecting it to stretchy tethers.<br/><br/><strong>A Snack for your Brain:</strong> A perfect palette cleanser between intense tasks, whether you have a couple minutes or a couple hours to unwind.<br/><br/><br/><br/><strong>Pick Up and Play:</strong> Triversal is easy to learn and satisfying to master; simply add and remove elastic tethers to pull the light orb so it lines up with the black hole. Play with mouse, keyboard or a controller.  It’s as easy as 1-2-3.<br/><br/><strong>A Perfect Balance of Chill and Challenge:</strong> Triversal offers a gentle learning curve, thousands of levels and a range of puzzle modes to suit your mood.<br/><br/> <ul><li><strong>Puzzle Packs:</strong>  Thousands of levels to work through at your own pace. </li></ul> <ul><li><strong>Daily Puzzle:</strong>  Rack up perfect streaks and compete for a high score on a new challenge daily.  </li></ul> <ul><li><strong>Endurance:</strong>  Complete level after level of progressively more difficult puzzles where each move costs a coin. Try to beat your high score before you run out of coins altogether.</li></ul> <ul><li><strong>Sandbox:</strong>  Customize your level of challenge on the fly as you play through endless puzzles. With unlimited coins, there is no risk, so play how you like.</li></ul><br/><strong>Streamer Assist:</strong> Collaborate with your streaming audience with the Streamer Assist feature, an optional overlay that adds numbered labels to your puzzles, allowing viewers to play along in chat by suggesting solutions.<br/><br/>", "metacritic": null, "released": "2021-07-13", "tba": false, "updated": "2021-07-16T03:04:16", "background_image": "https://media.rawg.io/media/screenshots/4d0/4d05084ba56d9d83ec1ee9a319f094d8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 162, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Phantom Compass"], "genres": ["Casual", "Indie"], "publishers": ["Phantom Compass"], "esrb_rating": null}