{"id": 635241, "slug": "castle-formers", "name": "Castle Formers", "name_original": "Castle Formers", "description": "🍊<strong>Castle Formers</strong> is a mashup of two game genres that I love. <br/><strong>Castle Defense</strong> and <strong>Platform. </strong> That came out more like a strategic and survivor game. <br/><br/>Unlike traditional castle defenses that usually use the mouse to activate commands, in Castle Formers you choose to control a king or queen using the keyboard or game pad on a platform game mechanic to navigate and interact with NPCs and the environment.<br/><br/>The game takes place in only one scenario with night and day cycles.<br/><strong>You must survive 30 days to complete the game.</strong>  (3min a day and 3min a night).<br/><br/>During the day you must collect resources by interacting with bushes, cutting plants, hunting or finding treasures. <br/>To be able to use gold to train soldiers, improve your weapon, prepare food, use spells and defend against enemies that will come at night.<br/><br/>This game was meant to be learned during gameplay, <strong>there is no tutorial.</strong> The player will have to discover the best way to battle and find secrets that will allow the survival of his kingdom. It is about trial-and-error learning.<br/><br/>There are several NPCs that at your command and with the right amount of coins will execute a different function to help you defend the castle.<br/><br/><strong>Collect coins, interact with the elements of the game, discover, explore, learn and survive.</strong><br/><br/><br/><br/>Protect your <strong>gate </strong>and<strong> statue of life</strong> <br/>and if it is not obvious, protect <strong>yourself.</strong><br/><br/><br/><br/><br/><strong>Call your disciples to defend.</strong><br/><br/><br/><br/>There are two<strong> keyboard </strong>configurations and a <strong>gamepad</strong> configuration, it is not possible to change and choose the buttons, just use one of the three <strong>pre-established configurations</strong>.<br/><br/><strong>1.Right Keyboard</strong><br/><br/><br/><strong>2.Left Keyboard</strong><br/><br/><br/><strong>3.Gamepad</strong><br/><br/><br/><br/>Resolution:<strong>Monitors with 16: 9 resolutions are strongly recommended</strong><br/>Graphics Settings:<strong> Does not have built-in graphic options or a graphics menu</strong><br/><strong>High refresh rate monitors are NOT recommended.<br/>Slowing down the Hz may solve the problem.</strong><br/><br/>The game has<strong> no adaptation</strong> for other resolutions<br/>there is a <strong>windowed mode</strong> which allows you to resize the size manually or <strong>fullscreen mode.</strong><br/>If it is not possible to access the menu you can use the commands ALT + Enter or F11<br/><br/>Unfortunately the engine used in this project is outdated and <strong>does not support gamepad vibration.</strong><br/><br/>Audio adjustments are available in game<br/><br/><br/><br/><br/>🧡The game was made with a lot of love, I appreciate your feedback, I will be seeking to improve your experience. if you find any bug, I count on your help to report and register any problem or suggestion through our community on steam.🧡<br/><br/><br/> <h3>🍊HAVE FUN!</h3>", "metacritic": null, "released": "2021-07-12", "tba": false, "updated": "2021-07-16T02:41:44", "background_image": "https://media.rawg.io/media/screenshots/56d/56d0f9c2fdda8c7c26fe4722760ffda4.jpg", "website": "https://www.facebook.com/Inkeyegames/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 5}, "playtime": 0, "achievements_count": 23, "ratings_count": 0, "suggestions_count": 235, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Fernando Araujo"], "genres": ["Adventure", "Strategy", "Simulation", "Indie"], "publishers": ["INK EYE Games"], "esrb_rating": null}