{"id": 635358, "slug": "childhood-gone-shadowed-wand", "name": "CHILDHOOD GONE: SHADOWED WAND", "name_original": "CHILDHOOD GONE: SHADOWED WAND", "description": "Have you all heard about this game?<br/><br/>It's this odd pixel game with retro looking graphics! Designed to make you remember all of your fondest retro handheld memories.<br/>You get to explore this world as an Evoker wizard person, defeat enemies with magical spells and explore dungeons to get treasures and save the Kingdom!<br/><br/><strong><h3>STUFF TO DO:</h3></strong><br/><ul><li> Explore the world openly!<br/></li><li> Progress through deadly Temples in any order!<br/></li><li> Find collectible RARE BOOKS and mysterious yet powerful CHARMS!<br/></li><li> Complete the TRADE quest that takes place throughout the world!<br/></li><li> Recruit and name the not very memorable flunkies to do your bidding!<br/></li><li> Interact with the strange people that live in the Kingdom!<br/></li><li> Save the Kingdom!<br/></li><li>(Encounter the paranormal...)</li></ul><br/>From what I heard ... the game is haunted. Supposedly if you play it long enough ... strange things start to happen.<br/>It is said that things may appear on screen to watch you, or the dungeons will change and be completely different every time you go into them!<br/>Your character sprite may change into something ... unsettling.<br/>You may find your character's name has been changed to something ... upsetting. Or an item you've never heard of or seen before appeared in your inventory with little to no description. Should you even try to use it...? (Maybe save first)<br/><br/>This game gives you the opportunity to enjoy a fun, classic, exploration adventure in an interesting and funny fantasy world!<br/>But something inside of the game doesn't want you to play it...<br/><br/>Have fun!", "metacritic": null, "released": "2021-07-15", "tba": false, "updated": "2021-07-16T04:14:23", "background_image": "https://media.rawg.io/media/screenshots/a5a/a5af4d54d000634a0007259f91e44e95.jpg", "website": "https://www.olivango.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 151, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["OLIVANGO"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["OLIVANGO"], "esrb_rating": null}