{"id": 6353, "slug": "oddwings-escape", "name": "Oddwings Escape", "name_original": "Oddwings Escape", "description": "Fly like never before! Soar through beautiful islands, solving exciting physics based challenges. Unlock and upgrade amazing new characters to unleash their powers. Race against your friends and other players for fame and glory!<br/><br/>FEATURES:<br/>• Unique physics based flying adventure<br/>• Discover secret paths and avoid tricky hazards<br/>• Multiplayer action! - Compete and fly with your friends even without constant internet connection<br/>• Bust your friends best scores to get extra rewards<br/>• Unlock all quirky Oddwings with different special powers, such as Speed Boost and Teleport<br/>• All new touch controls make flying super fun!<br/>• Free to play<br/><br/>Your mission is to fly as far as possible, collect coins and discover keys to release the Oddwings from the evil Dr. Rooster&amp;#39;s lab.<br/><br/>While you explore beautiful worlds, maneuver your way through the mad doctor&amp;#39;s dangerous traps and obstacles: air bombs, poison gases and other exotic perils.<br/><br/>Download now, and find out if you’ve got the wings to make it!<br/><br/>Oddwings Escape is free to play, but some in-game items can also be bought with real money. You can disable in-app purchases on your device&amp;#39;s settings if you don’t want these items.<br/><br/>Note: Due to the graphical nature of Oddwings Escape, we strongly recommend playing the game on iPhone 4S and newer, iPod Touch 5th gen, or iPad 2 and newer.", "metacritic": null, "released": "2015-05-13", "tba": false, "updated": "2019-10-22T14:28:50", "background_image": "https://media.rawg.io/media/screenshots/513/513e694817bfa51c81ca954ae187ec1b.jpeg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 167, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Small Giant Games"], "genres": ["Action", "Adventure"], "publishers": ["Small Giant Games Oy"], "esrb_rating": "Everyone 10+"}