{"id": 63538, "slug": "one-way-ticket-dan-cheng-piao", "name": "One-Way Ticket / 单程票", "name_original": "One-Way Ticket / 单程票", "description": "Adapt text AVG / visual novel based on real events.<br/><br/>Deep sea fishing boats horizons are sailing towards Pacific that side of the fish, set foot on this promising gold trip people unaware of their values is quietly changing rot, and gave birth to the new order on this decay of debris - people who tore the mask of that a moment, the narrow and closed world will achieve more cruel than the primeval forest depths.Tokyo ·again to the Miracle journey across Pacific OceanFrom Japan to Solomon Islands in the South Pacific Ocean perhaps ends up not as far as you think it is enough to require only one ticket.<br/><br/>Real cruel little known ocean experienceSea is another gate keeper of the world, attempts to break into sea search for wealth crew, trapped by sea firmly in boats. They may be lonely but perhaps they may glimpse the beautiful wonders that people cannot imagine living on land throughout their lives.<br/><br/>Gold Rush ·escape ·survival Game between crew members of each pregnant womanTo avoid bullies, wealthy families who come to shabby fishing boats, who have acquired crew positions on board, seems to have their own purpose, and what is true when they unload masks? How do you become final winner in this chaotic order?<br/><br/><br/>——The world became strange layers of earth when I found myself in deep depths.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:56:33", "background_image": "https://media.rawg.io/media/screenshots/c49/c49715a61dc2b6edb5d092daf13f1de5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 19, "toplay": 1}, "playtime": 4, "achievements_count": 10, "ratings_count": 1, "suggestions_count": 329, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Light & Digital Technology"], "genres": ["Adventure", "RPG", "Casual", "Indie"], "publishers": ["Zodiac Interactive"], "esrb_rating": null}