{"id": 635345, "slug": "aces-in-the-dust", "name": "Aces in the Dust", "name_original": "Aces in the Dust", "description": "In an alternative world to ours, only a few years have passed since the discovery of the great capabilities and military uses of Mitrilia, a very rare and complicated to treat mineral. This discovery led to disputes between different countries that have ended in a war and various battles, which we will live through from the perspective of a group of elite airmen sent to defeat the enemy.<br/>\n<br/>\r\nIn Aces in the Dust you are in the shoes of this elite group, made up of Varick, Dimitrii and Victoria, each one piloting a state-of-the-art warplane with unique characteristics that differentiate them.<br/>\n<br/>\r\nYou must shoot enemies, avoid obstacles, know which weapon to use at all times and dodge hundreds of bullets if you want your pilots to survive each mission and get the highest scores possible.<br/>\n<br/>\r\nSo prepare your weapons, aim well and ... finish the enemy!<br/>\n<br/>\r\nAces in the Dust is inspired by classic rail shooter games such as Panzer Dragoon and Star Fox.<br/>\n<br/>\n<br/>\r\nMain features:<br/>\n<br/>\r\n- Play as a trio of pilots, each flying a unique plane with different characteristics.<br/>\n<br/>\r\n- Advance through the levels alternating between the different pilots to face different situations in the most favorable way.<br/>\n<br/>\r\n- Take out an array of enemies and a powerful final boss as you advance through enemy territory in a large rocky desert.<br/>\n<br/>\r\n- Dodge terrain obstacles while defeating enemies.<br/>\n<br/>\r\n- Defeat enemies without taking damage to achieve a good score at the end of levels.", "metacritic": null, "released": "2021-07-15", "tba": false, "updated": "2021-07-16T04:03:43", "background_image": "https://media.rawg.io/media/screenshots/df9/df904830fa57bb57ed1e8d3d61b17383.jpg", "website": "https://www.esat.es/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 22, "ratings_count": 0, "suggestions_count": 488, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ESAT", "DUV Studios"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["ESAT"], "esrb_rating": null}