{"id": 635318, "slug": "anatomy-of-fear", "name": "Anatomy of Fear", "name_original": "Anatomy of Fear", "description": "A group of scientists travel to the place where the project started to unravel the mystery and results of the Bellatrix project. But a place called Bellatrix has not existed since work stopped. Your task is to reactivate and destroy the interconnected signals to bring Bellatrix to light, and all the while to stay alive!<br/><br/><h3>SINGLE PLAYER</h3>It is not recommended to play this mode if you are not experienced. Because the size of the map and the difficulties you will encounter can affect your mental health.<h3>MULTIPLAYER </h3>This game mode can be played between a minimum of 2 and a maximum of 4 people. You can create a lobby, press shift+tab and invite your online friends. If you have the same internet access point as your friends, after one of you has set up the lobby, the person who wants to join will only need to press the lobby button. If you're having trouble creating a lobby, exit and re-enter the game with all your teammates. You can increase your chances of survival by cooperating with other players, continue the story together and bring about the sad end of the company!<br/><br/><br/><br/><h3>CONTINUITY</h3>Every time you restart Anatomy Of Fear, there will be limited possibilities waiting for you, so you can reconcile with your teammates and have more fun.<h3>HIGH QUALITY</h3>Not having RTX support doesn't change anything! The high image quality in Anatomy Of Fear will make you feel the fear in your veins due to its realism.<h3>RTX SUPPORT</h3>RTX game mode, which is the first in Turkey, which has just started to spread around the world, will give you a high-level image quality experience, provided you have enough hardware!<br/><br/>", "metacritic": null, "released": "2021-07-14", "tba": false, "updated": "2021-07-16T03:42:45", "background_image": "https://media.rawg.io/media/screenshots/67d/67dfcf36713a3d055e7a6153d259277d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 378, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Emir Teker", "Engin Can Aydoğdu"], "genres": ["Indie"], "publishers": ["EvE"], "esrb_rating": null}