{"id": 635335, "slug": "ambush-convoy-strike", "name": "Ambush: Convoy Strike", "name_original": "Ambush: Convoy Strike", "description": "<strong>Stop the enemy convoys!</strong><br/>Your mission is to destroy enemy convoys passing through your territory by deploying turrets and stop their advance!<br/><br/><strong>22 unique and diverse turrets</strong><br/>Ambush: Convoy Strike has a variety of unique style turrets. Machinegun, shotgun, and Anti-Tank rocket, Surface-To-Air seeker missile, cryogenic, flame, and don't forget the 20mm Gatlings!<br/><br/><strong>Build your strategy</strong><br/>Every turret has its own damage type, and also every enemy has its own armor type. <br/>You have to decide which turret you need in the field every moment, and find out what's the best position and formation to stop advancing enemies, from various battlefields.<br/><br/><strong>Ground? Air?</strong><br/>Don't expect your enemies are only passing on the ground! Pay attention to approaching through the air, you must prepare a proper Anti-Air backup!<br/><br/><strong>Best deployment and upgrades</strong><br/>Choose the proper turret and find the best position. Every turret has its own unique damage type, rate of fire, and range. Also, you must choose what's the best target priority to maximize the turret's capability.<br/><br/><strong>Fire Support</strong><br/>Does your strategy don't work? Don't worry, various powerful Fire Support is ready for you. Request EMP Strike, call the Close Air Support and Artillery firing!<br/><br/><strong>Armamanents</strong><br/>Does your turret reach the max level? Does your income is too insufficient to deploy and maintain your turrets? Use the armament system to lower the various restrictions and upgrade multiple features that make your combat easy.<br/><br/><strong>Boss battles</strong><br/>Every 30 waves, the boss units approaching. You must use everything you got to stop them!<br/><br/><strong>Was it too hard? Try to upgrade your turrets!</strong><br/>Don't be disappointed that you didn't reach the goal wave! Upgrade turret and fire support permanently, extend lives and try to reach the goal next time!<br/><br/><strong>Challenge to the world</strong><br/>Compare your scores with a variety of users around the world!", "metacritic": null, "released": "2021-07-14", "tba": false, "updated": "2021-07-16T03:55:35", "background_image": "https://media.rawg.io/media/screenshots/2dc/2dcaa21a597393f549ab258b58c15ba7.jpg", "website": "http://modernator.me/en", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 346, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Team Modernator"], "genres": ["Action", "Strategy", "Simulation"], "publishers": ["Team Modernator"], "esrb_rating": null}