{"id": 635357, "slug": "ming-mo-bian-jun", "name": "明末边军", "name_original": "明末边军", "description": "<strong>The real battle is certainly bad and bloody, but in all kinds of game works, the creator adds some ornamental artistic elements to the weapon or human action. We abandoned this traditional way, this game will reveal to you the truth of the cold weapon battlefield, no beautiful special effects and magic, only splash of blood! Scattered limbs! Use every means you can think of to kill the enemy in front of you!——by Taizhou Blue Game Co.Ltd.</strong><h3>Real 17th century cold weapon ancient war!</h3><br/>The 17th century is a special period of alternation of cold and hot weapons. The long gunners and heavy cavalry equipped with heavy plate armor can no longer fully occupy the advantage. The muskets and cannons smashed the Knights' heavy armor and the illusion of one against one hundred. Lead your army, reasonable allocation of arms ratio, to ensure that in a complex battlefield environment to deal with a variety of enemies! If you can put in the right Legion to suppress the enemy at the right time, it will be an epic victory to meet you!<h3>Build your front camp!</h3><br/>This is not a simple Legion fighting game. You can only lead a small group of reconnaissance troops into the battlefield, investigate the surrounding environment and potential resources, quickly organize personnel to collect materials and booty, build camp related facilities, and use the support of factions to win the powerful reinforcement of the Empire. A steady stream of supplies and troops will be transported to and dispatched by you. It should be noted that this process will not be so easy and comfortable. The enemy will continue to charge, and the offensive will become more and more intense. You must resist the powerful enemy and develop yourself at the same time. Only in this way can you gather a large number of troops to carry out a decisive counterattack!<h3>Complex and changeable battlefield!</h3><br/>The weather system will interfere with the operations of both sides. In rainy days, guns and cannons will be unable to use because of damp. If you are equipped with a large number of guns, then the situation is not good; The visibility in foggy weather is extremely low, and the character's vision is very narrow. When you see the enemy, they have come to you; The cold current in winter is fatal! If your troops can't stay by the warm fire, they are likely to die slowly in the cold wind.<h3>Magnificent picture of history!</h3><br/>There may be some unique mechanisms in different battlefields. When you lead your troops to Liaodong, you can make the nomadic tribes scattered in the White Mountains and black waters submit to you, and recruit their unique troops to join your camp; When you go to the new world, the great pyramids and treasures hidden in the woods by the Mayans can make you experience an exciting adventure; In Central Asia, a large area of desert will lead to the setting of supply lines. You need to build supply stations every other distance to maintain your military operations. It's better to buy local Arabs with a lot of money to stop attacking you and put pressure on your enemies instead.", "metacritic": null, "released": "2021-07-31", "tba": false, "updated": "2021-07-16T04:13:45", "background_image": "https://media.rawg.io/media/screenshots/dc2/dc2d90f230ca98c19b8fd77c0dd64af6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 154, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Taizhou Blue Game"], "genres": ["Action", "RPG", "Strategy", "Indie"], "publishers": ["Taizhou Blue Game"], "esrb_rating": null}