{"id": 635401, "slug": "happy-tree-friends-deadeye", "name": "Happy Tree Friends Deadeye", "name_original": "Happy Tree Friends Deadeye", "description": "--- Thanks for your support since launch! ---<br/>* Ranked in Top #1 in Germany, Mexico, Poland, Bolivia, Greece, Nicaragua, El Salvador, Argentina, Chile, Peru, Ecuador<br/>* Ranked in Top #5 United States, Belarus<br/><br/>Welcome to Camp Pokeneyeout where camping fun turns to bloodthirsty mayhem! Join the gang to compete in the camp’s “maim” event, the Deadeye Derby! Play a battle of one-on-one revenge as your favorite Happy Tree Friends characters in four unique environments while firing your slingshot at real-time opponents from around the world. Upgrade your slingshot for better performance and customize your cart to monster proportions. Take control of the action with your device’s gyro capabilities for aiming and shooting in the most exciting Happy Tree Friends game ever!<br/><br/>TAKE CONTROL OF THE ACTION<br/>Take aim at opponents with your device's gyroscope and accelerometer and master your aiming skills to become a dangerous deadeye sharpshooter.<br/><br/>BECOME A FEARSOME KILLING MACHINE<br/>Use the spoils of war to customize your cart with a new chassis for strength, engine for speed, and wheels for stability, plus you can upgrade your slingshot to a damage dealing weapon of mass destruction.<br/><br/>DIFFERENT ENVIRONMENTS FEATURE UNIQUE GAMEPLAY<br/>Adventure and danger await in four unique themed areas of the Deadeye Derby. Compete in a treacherous trip through the trails, a murderous mud-fest, a high speed river run and even a rollicking railroad ride through spooky lost mines.<br/><br/>THE WORLD IS YOUR BATTLEFIELD<br/>Challenge your Facebook friends or battle random opponents live from around the globe in synchronous multiplayer combat. Complete daily goals, earn hundreds of achievements, and compete for the top spot on weekly and all-time leaderboards.<br/><br/>PLAY AS YOUR FAVORITE HAPPY TREE FRIENDS CHARACTER<br/>Each character brings their own unique skill to the fight and in classic Happy Tree Friend’s style gruesome mutilation and dismemberment can happen at any moment. Play as Giggles, Cuddles and the HTF gang in fast-paced combat and discover surprise Boss Battles that feature even more of your favorite characters.<br/><br/>Features:<br/>• Become a fearsome killing machine as you customize  your cart and buff up your skills<br/>• Encounter one of a kind Boss Battles featuring surprise guest characters<br/>• Harness fire, lightning, and poison ammo and wield them against your foes<br/>• Take control of the action with your device’s gyro capability for aiming and shooting<br/>• Play as your favorite characters with custom animation, music, and sound<br/>• Challenge Facebook friends or battle random opponents live from around the world<br/>• Claw your way to the top of multiple leaderboards", "metacritic": null, "released": "2014-01-16", "tba": false, "updated": "2021-07-16T04:47:04", "background_image": "https://media.rawg.io/media/screenshots/492/4926d4a409d1351cb9981910b7377230.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 121, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Alexander Wong"], "genres": ["Action", "Casual"], "publishers": ["Alexander Wong"], "esrb_rating": "Teen"}