{"id": 635420, "slug": "dream-home-house-design", "name": "Dream Home-House Design", "name_original": "Dream Home-House Design", "description": "Do you like decorating and refurbishing houses? Do you like playing home design makeover games? Would you like to remodel or rebuild the property homes? Welcome to Home Design! You can be the most famous interior decorating designer and help people build their perfect sweet home!<br/><br/>GAME FEATURES<br/>1. Puzzle Matching Games with hundreds of levels<br/>2. Win puzzle games to collect parts for decoration<br/>3. Vivid and lovely graphic design, you can choose the furniture and design you like to decorate the house<br/>4. Customize your decoration and express your style<br/>5. Easy to play but hard to master, you need to finish the game with limited moves and time<br/>6. Solve the puzzles and win the game by using and combining different boosters and power-ups<br/>7. Play anywhere and play anytime (No Internet connection required)<br/>8. New models, furniture and design are coming right up!<br/><br/>Relax and fun home decoration puzzle game that you can play and also learn about different interior design styles, you can express yourself with an incredible variety of choices, such as Princess style, Country style, Victorian style, Renaissance style, etc.<br/><br/>If You like home decor, you will definitely like playing Home Design!<br/><br/>How to play?<br/>1.At each game, you will find out a list of goals that you have to complete them all before you run out of moves and time.<br/>2. Swipe and switch two elements next to each other and get three or more similar elements in a row to smash them<br/>3. Collect coins and powers and use them to decorate the houses<br/>4. Choose the styles you like and become the greatest designer!<br/><br/>For a well-respected interior designer, you are known as “The Magical Dream Making Decorator”. Even the trashiest house can be redecorated as the most outstanding block in the neighborhood. Play a variety of fun match3 puzzles, collect energies or coins to rebuild the property into breathtaking design house with different style makeovers. <br/><br/>Enjoy to build your dream design houses for FREE at Home Design! Build your dreamy home with different designs and decorations.<br/><br/>Please Note: This home decoration puzzle game is suitable for kids and adults, and it is completely free to play but some optional in-game items will require payment.", "metacritic": null, "released": "2021-05-17", "tba": false, "updated": "2021-07-16T04:58:16", "background_image": "https://media.rawg.io/media/screenshots/3cd/3cdf0a12811d3731bceda1bbc7b85c3e_wKl01pQ.jpg", "website": "https://www.firedragongame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 79, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["games mint"], "genres": ["Casual", "Puzzle"], "publishers": ["games mint"], "esrb_rating": "Everyone 10+"}