{"id": 63545, "slug": "gaze-at-maze", "name": "Gaze At Maze", "name_original": "Gaze At Maze", "description": "Jack, an innocent boy, suddenly found a globe in a garden near his house. When he touched the globe out of curiosity, he found himself in a weird maze world which is full of weird monsters, and robots. He soon came to know that these creatures were created by genetic modification of human embryo. The mastermind behind this Evil scheme is still unknown. Various weird experiments were performed on the human beings who were trapped inside the globe. But, Jack refused to give in. He found a beautiful princess in a punishment chamber who was about to become the victim of genetic modification experiment. Will Jack be able to rescue the princess and those who were trapped in the weird maze world?<strong>Key Features:</strong><br/><ul><li>22 Levels to play.</li></ul><ul><li>Different kinds of items to collect like yellow, red and blue cubes.</li></ul><ul><li>Challenging situations and different kinds of enemies, and bots.</li></ul><ul><li>Hack the security system.</li></ul><ul><li>Finding Key cards to unlock doors.</li></ul><ul><li>Explore the Maze world and find a way out.</li></ul><br/>Developer's Note:<br/>Being a solo developer, I have worked very hard on  every aspect of this game including graphics, art work, programming, level design and so on except the music. I really hope that you enjoy the game. Thank you for your support and encouragement!", "metacritic": null, "released": "2018-07-13", "tba": false, "updated": "2019-08-28T21:56:33", "background_image": "https://media.rawg.io/media/screenshots/bb4/bb45b41e87c28fd1a9305d2a01cf4f24.jpg", "website": "http://www.amaxang-games.com/2015/01/gaze-at-maze-game-purchase-full-version.html", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 231, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["Anamik Majumdar"], "genres": ["Casual", "Indie"], "publishers": ["Anamik Majumdar"], "esrb_rating": null}