{"id": 635582, "slug": "mon-village-est-magique-twotio-demo", "name": "Mon Village est Magique: TWOTIO DEMO", "name_original": "Mon Village est Magique: TWOTIO DEMO", "description": "<p><strong>//ENG//</strong><br/></p>\n<p>\"Mumuton the dust bunny has disappeared! Seb and Tommy need to investigate to find their magical friend.\"</p>\n<em>The central concept of Mon Village est Magique (abbreviated to MVEM) is that the real world is surrounded by multiple, invisible Magical Worlds. Seb and Tommy travel to some of these places. They are all connected to a mysterious location called the Infinite Ocean ...</em>\n<p>A narrative adventure game with a rich story and inventory puzzles, available in English and French. Originally made in 2 weeks during Adventure Jam 2019. <br/></p>\n<ul><li><strong>Gameplay:</strong>\r\nMVEM:TWOTIO is a point and click adventure game in 3rd person view. The player will go through the story and will have to solve a few puzzles. It is intended to be played by young people, so the game will be quite easy and will more focus on the quest, narration and world immersion.\r\n</li><li><strong>Music:</strong><br/>\r\nThe music of the game is composed by \r\n@Yazorius <em> </em><em>\n</em></li></ul>\n<p>If you liked the demo, please support the game: Learn more about the world of Mon Village est Magique and subscribe to the newsletter! https://www.monvillageestmagique.fr<br/></p>\n<p>                                                                                ***</p>\n<p><strong>//FR//\r\n</strong></p>\n<p>\"Moumoute le mouton de poussière a disparu ! Seb et Tommy doivent enquêter pour retrouver leur ami magique.\"</p>\nLe concept central de Mon Village est Magique (abrégé en MVEM) est que le monde réel est entouré de multiples mondes magiques invisibles. Seb et Tommy voyagent dans certains de ces endroits. Ils sont tous reliés à un endroit mystérieux appelé l'Océan Infini ...\r\n<p>Un jeu d'aventure narratif avec une histoire riche et des énigmes d'inventaire, disponible en anglais et en français. Réalisé à l'origine en 2 semaines lors de l'Adventure Jam 2019.<br/></p>\n<ul><li><strong>Gameplay:</strong> MVEM:TWOTIO est un jeu d'aventure de type point and click en vue à la 3ème personne. Le joueur suivra l'histoire et devra résoudre quelques énigmes. Il est destiné à être joué par des jeunes, le jeu sera donc assez facile et se concentrera davantage sur la quête, la narration et l'immersion dans le monde.</li><li><strong>Musique:</strong> La musique du jeu est composée par   @Yazorius <em> </em><em> </em>\n</li></ul>\n\n<p>Si vous avez aimé la démo, soutenez le jeu : Apprenez-en plus sur l'univers de Mon Village est Magique et inscrivez-vous à la newsletter !<br/>https://www.monvillageestmagique.fr\r\n</p>", "metacritic": null, "released": "2021-07-15", "tba": false, "updated": "2021-07-16T05:50:45", "background_image": "https://media.rawg.io/media/screenshots/d10/d10692ae3d2021cb56f305caeb614dc9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 289, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["The Icehouse"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}