{"id": 63558, "slug": "friendzoned-archer", "name": "FriendZoned Archer", "name_original": "FriendZoned Archer", "description": "FriendZoned Archer is an action adventure game inspired by the classic NES Zelda. There is complete freedom of exploration, hidden Areas, hidden dungeons and key items to help you ease through the open world. The combat focuses on shooting and combos and the key items can interact with enemies, world and bosses thus drawing inspirations from the sandbox nature of open world games.  <br/><br/>You would think that nothing is more sad than the grief of your waifu being kidnapped by monsters and trapped far away inside a dungeon,<br/>But, multiply that sadness by 4 and you have the story of our Archer whose all 4 waifus are kidnapped by 4 monsters of the underworld of <br/>Albagooniya land.<br/><br/>Play the role of a brave Archer who sets afoot in the land of Albagooniya to save his waifus from Monsters, And try to make more waifus there <br/>just in case!<br/><strong>Features :-</strong><br/><br/><strong>Open World</strong><br/>You know what that means? \"You see that hill in a distance, you can go there - and you can make waifus there\"<br/><br/><br/><strong>Exploration and Freedom</strong><br/>There will be little to no hand holding in your adventure. Take your time to uncover the secrets of land and find your waifus. \"Take your time\" <br/>- Although thats not what your Waifus want as they are abducted, but, we are willing to compromise their feelings for your experience.<br/><br/><strong>Grapple Hook </strong><br/>This will help you cross rivers and grapple hook enemies/bosses and it will be useful in side quests. <br/><br/><br/><strong>Cleaner</strong><br/>Enemies and monsters do not disappear after you kill them. Cleaner will help you clean all the dead bodies which in turn will reward you with <br/>useful items.<br/><br/><br/><strong>Stone ball </strong><br/>Stone Ball breaks stuff. It can break walls. It can blast off Enemies.<br/><br/><br/><strong>SkullBat</strong><br/>It can sense Hidden Holes all through out the Albagooniya. Very helpful.<br/><br/><br/><strong>Bone Boomerang</strong><br/>It can reach places and turn switches which you cannot. Also it can stop moving enemies. <br/><br/><br/><strong>Boss Humiliation</strong><br/>Every Time you defeat a boss, they run away and hide in the land of Albagooniya. You have to find them, Grapple them and trap them in cages to <br/>reveal the items that bosses use. These items will help you rescue your waifus.<br/>", "metacritic": null, "released": "2018-02-27", "tba": false, "updated": "2019-08-28T21:56:32", "background_image": "https://media.rawg.io/media/screenshots/a57/a57cd1ea25fd4763ea2fa5f5d66a1bfc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 5}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 88, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Centipede Game Studios"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Centipede Game Studios"], "esrb_rating": null}