{"id": 63564, "slug": "eat-my-shuriken-and-die", "name": "Eat my Shuriken and Die!", "name_original": "Eat my Shuriken and Die!", "description": "We created a game that we wanted to play ourselves during parties without overwhelming the experience with new-fangled concepts like respawns or unlimited ammo.<br/><br/>In Eat my Shuriken and Die! you need to first pick up a shuriken before you can throw it at your opponents and there are a fixed number of shurikens for a given round, creating some incredible tension. By default players do not respawn and the last player standing wins, although this can be adjusted using the options if you prefer respawning score-driven gameplay instead. There are several different powerups that enhance either the player or the shuriken.<br/><br/>The chipmusic soundtrack is supplied by Daniel Johansson and consists of a curated selection from his \"Skogens Djur\" series of Amiga mods created under the name Coma of 3LE. The title theme is composed by fegolhuzz specifically for the game.<br/><br/>The nine levels are either hand-drawn or pre-rendered and features force-fields that players can pass through while shurikens bounce off them, and teleporters through which both can travel for a sneaky surprise attack. The in-game characters differ only in appearance and their names are shamelessly stolen directly from the creators of the game itself in a twisted sense of not-so-much-humor.<br/><br/>Eat my Shuriken and Die! <strong>only supports local multiplayer</strong>, has no single-player mode whatsoever and was originally made for consoles. It therefore requires Xbox controllers though two players can use the keyboard in a pinch.", "metacritic": null, "released": "2018-10-26", "tba": false, "updated": "2019-08-28T17:04:43", "background_image": "https://media.rawg.io/media/screenshots/a8a/a8ab4ecb657998ccae4e492cebb917a6.jpg", "website": "http://www.flowersfx.com/page/projects/eat-my-shuriken-and-die", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 158, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["FlowersFX"], "genres": ["Action"], "publishers": ["FlowersFX"], "esrb_rating": null}