{"id": 635759, "slug": "mirror-itch-acid", "name": "Mirror (itch) (Acid)", "name_original": "Mirror (itch) (Acid)", "description": "<p>Hogwarts, Eighth Year. Harry Potter must choose: talk about a secret or keep it. Place trust in one teacher or keep silent. Speak up in support of a war hero or let the weight of public opinion take its toll. Will Harry's reflection in the Mirror of Erised offer guidance? Mirror is a choice and consequence game with ~12,000 words of dialogue. What's next, treacle tart or flying? Was it really Snape that Harry saw in the Mirror of Erised? Will Harriet tell the Headmistress all about her crush on Ginny Weasley? Will Harry ever feel as free on the ground as he does in the sky with Ron? Will Severus Snape keep his job? It's up to you.</p>\n<p>Mirror was made over the Spring and Summer of 2018, to answer a question, how would Harry Potter's story unfold differently if it had been about Harriet Potter? It then became a personal study of sex and gender, and various closets we hide in.  Drawing and writing for this game put a smile on my face. If you choose to play it, I hope it does the same for you.<br/></p>\n<p><strong>How much time will I need to get to the end?</strong></p>\n<p>A little less than thirty minutes, perhaps? Quicker if you're replaying various storylines to get the achievements.</p>\n<p><strong>Is this a dating sim?</strong></p>\n<p>No. It also contains no nudity and you cannot die. You have to read a lot of dialogue lines and make some (hopefully meaningful) choices. </p>\n<p><strong>What is your favorite storyline?</strong></p>\n<p>\"Two Steps Up\" and \"Free to Fly\". They were written first and I used them as a base to write others. They also have slightly more dialogue content than the rest.</p>\n<p>That said, am also fond of \"When Ginny Met Harriet\" Harry, she is pretty amazing.</p>\n<p><strong>What came first, the art or the text?</strong></p>\n<p>Both. I drew when I was procrastinating on writing the script, and vice versa.</p>\n<p><strong>Will you make another game?</strong></p>\n<p>Not sure. This has been pretty labor-intensive. All my video-game playing time for about half of a year went into making one. Perhaps?</p>\n<p><strong>So, how do I get to date Ginny?</strong></p>\n<p>Choose seeing her over the treacle tart or a chance to go flying.</p>\n<p><strong>So, how do I get to date Snape?</strong></p>\n<p>Annoy him the least during your conversations with him: don't lie, provide meaningful answers. Grow fond of his eyes or his hands. Defend him in front of the Headmistress. Finish the game.</p>\n<p><strong>How do I play a pairing-free game?</strong></p>\n<p>Avoid seeing Ginny. Don't show interest in Snape.<br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/></p>\n<p><strong>Spoilers ahead.</strong>\n</p>\n<p> \r\n</p>\n<p> \r\n</p>\n<p> \r\n</p>\n<p> \r\n</p>\n<p> \r\n</p>\n<p> \r\n</p>\n<p> \r\n</p>\n<p> \r\n</p>\n<p> \r\n</p>\n<p> \r\n</p>\n<p> \r\n</p>\n<p> \r\n</p>\n<p> \r\n</p>\n<p> \r\n</p>\n<p> \r\n</p>\r\nMirror 1.0 Walkthrough\r\n<p><strong>Summary</strong>\n</p>\n<p>This is a story of closets and coming out of one. After the war, Snape is about to be sacked, then Harry steps in, forcing Snape to have a tough conversation with his student.\r\n</p>\n<p> \r\n</p>\n<p><strong>Main choices</strong>\r\n- Harry Potter vs Harriet 'Harry' Potter in the introduction dictate main character graphics (with short or long hair) for the majority of the play-through.\r\n- Harry seeing the reflection of the opposite sex they're presenting as in the Mirror of Erised will start transgender Harry story lines.\r\n- Harry choosing to see Ginny in the evening will assume Harry is interested in Ginny.\r\n- Harry's interest in Snape is decided by Snape's approval points, awarded throughout the dialogue. (ie: Don't lie to Snape when Harry's heading back to the dorms for extra approval points.)\r\n</p>\n<p> \r\n</p>\n<p><strong>Storylines</strong>\n</p>\n<p>There are six basic storylines you can play through, each with its own underlying theme to explore.\r\n- \"Free to fly\" storyline (FTM Harry, with either love interest.)\r\n- \"Two Steps Up\" storyline (MTF Harry, with either love interest.)\r\n- \"Fellow Soldiers\" storyline. (Cis Harry interested in Ginny.)\r\n- \"When Ginny Met Harriet\" storyline. (Cis Harriet interested in Ginny.)\r\n- \"Thinking of Severus\" storyline. (Cis Harry interested in Snape.)\r\n- \"Turn to page 486\" storyline. (Cis Harriet interested in Snape.)\r\n</p>\n<p> \r\n</p>\n<p><strong>Approval Points</strong>\n</p>\n<p>Snape and McGonagall both accumulate approval points throughout Harry's dialogue choices.\r\n- McGonagall's approval dictates whether Snape is let go or stays on as a teacher.\r\n- Snape's approval dictates whether he stays in touch with Harry after the school year, thus triggering additional encounter (date) scenes. \r\n</p>\n<p> \r\n</p>\n<p> \r\n</p>\n<p><strong>Achievements</strong>\n</p>\n<p>- <strong>Nose of a Gargoyle</strong> - saw Snape in the mirror of Erised\r\n</p>\n<p>- <strong>Hello, Hedwig</strong> - saw Hedwig's feathers in the mirror of Erised\r\n</p>\n<p>- <strong>Turn to Page 486</strong> - Harriet brewed a potion under Snape's instruction\r\n</p>\n<p>- <strong>Two Steps Up</strong> - took two steps up the staircase up to the girls' dormitory\r\n</p>\n<p>-<strong> Free to Fly</strong> - reminisced about the freedom to fly, among other freedoms\r\n</p>\n<p>-<strong> When Ginny met Harriet</strong> - completed relevant storyline while interested in Ginny\r\n</p>\n<p>- <strong>Thinking of Severus</strong> - completed relevant storyline while interested in Severus\r\n</p>\n<p>- <strong>Sweet Tooth</strong> - really liked the treacle tart\r\n</p>\n<p>-<strong> We Don't Need No Education</strong> - gave the worst possible answers to the teachers all the way throughout the game\r\n</p>\n<p>-<strong> Fellow Soldiers</strong> - sought help from Snape while haunted by wartime memories\r\n</p>\n<p>- <strong>Harriet</strong> - mentioned 'Harriet' in the conversation with Snape\r\n</p>\n<p>- <strong>Harold</strong> - mentioned 'Harold' in the conversation with Snape\r\n</p>\n<p>-<strong> The Potions Master</strong> - Snape kept his job\r\n</p>\n<p>-<strong> The Potions Brewer</strong> - Snape had to find a new profession\r\n</p>\n<p>- <strong>The Stranger</strong> - Harry never saw Snape again\r\n</p>\n<p>- <strong>Legilimens and Chill</strong> - spent an evening with Snape at the end of the game\r\n</p>\n<p>- <strong>100 Percent</strong> - completed all possible achievements\r\n</p>", "metacritic": null, "released": "2021-07-15", "tba": false, "updated": "2021-07-16T06:39:38", "background_image": "https://media.rawg.io/media/screenshots/2c3/2c396ff467c95bd4e0d6ba6a398fa34d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 52, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["Acid"], "genres": [], "publishers": [], "esrb_rating": null}