{"id": 635846, "slug": "30days30games", "name": "30days30games", "name_original": "30days30games", "description": "<p>🇬🇧</p>\n<p> In June 2021, I challenged myself to make one game a day for 30 consecutive days. </p>\n<p> This pack contains the untouched result of this challenge. </p>\n<p> The games in this pack are as they were at the end of each corresponding day, without the touch-ups and fixes that I would have liked to do with more time. </p>\n<p> For the best experience, therefore, I highly recommend that you read the README.en.txt files of the games you would like to try. </p>\n<p> Despite a few issues of varying severity, the games are all playable and hopefully show their respective potential. </p>\n<p>🇫🇷</p>\n<p>En juin 2021, je me suis lancé le défi de réaliser un jeu par jour pendant 30 jours consécutifs.</p>\n<p>Ce pack contient le résultat brut de ce défi.</p>\n<p>Les jeux de ce pack sont donc dans l'état où ils étaient à la fin de chaque journée correspondante, sans les retouches et corrections que j'aurais aimé apporter avec plus de temps.</p>\n<p>Pour une meilleure expérience, je recommande donc fortement de lire les README.fr.txt des jeux que vous voudriez essayer.</p>\n<p>Malgré des problèmes certains à gravités variables, les jeux restent tous jouable et j'espère laissent entrevoir leur potentiel respectif.</p>\n<p>🐦 The Twitter thread with the 30 games.</p>\n<p>🗨 Join our Discord server!</p>\n<p>☕ Please consider making a $3 donation, so I can make more games. That's 10¢ a game.</p>", "metacritic": null, "released": "2021-07-14", "tba": false, "updated": "2021-07-16T07:05:19", "background_image": "https://media.rawg.io/media/screenshots/52b/52b9f2b46a0ef41d85e49fd60930119f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 24, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Lou Aimé"], "genres": ["Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}