{"id": 635910, "slug": "ruby-endless-mars-runner", "name": "RUBY - Endless Mars Runner", "name_original": "RUBY - Endless Mars Runner", "description": "<p>RUBY is an endless runner set on Mars. Boost over obstacles to collect orbs, blast your way through enemies, and level up to unlock weapons and skins.</p>\n<p>• CLASSIC ENDLESS RUNNER EXPERIENCE: The game is never over. Uniquely, designed obstacles are randomly ordered for a new experience each run.\r\n<br/></p>\n<p>• SURVIVE IN STYLE: Press and hold the jump button to hover over obstacles using the Prospect standard-issue utility jet boots.\r\n<br/></p>\n<p>• FIRE AWAY: Select one of four different weapon types and destroy the enemies standing in RUBY's way of surviving the harsh terrain of Mars.\r\n<br/></p>\n<p>• COLLECT AND LEVEL UP: Collect orbs along your run to gain experience and level up. Each level earns you 1,000 Universal Credits.\r\n<br/></p>\n<p>• TERMINAL INITIATED: Boot up The Terminal to spend your credits on weapons, character skins, weapon colors, and gameplay mods. Access The Terminal and change your loadout at any point during your run!\r\n<br/></p>\n<p>• ENHANCE WITH MODS: Increase the challenge, take the pressure off, or earn more experience with gameplay-enhancing modifiers.\r\n<br/></p>\n<p>• CRUISE THROUGH MARS: Sit back and take in the beautiful visuals of RUBY from award-winning designers, all set to chill hip-hop and lo-fi beats.\r\n<br/></p>\n<p>• FLASHLIGHT: You have a flashlight! For those spooky Martian nights. O_o\r\n<br/></p>\n<p>• INTEGRATED WITH GAMECENTER: Track your stats and mark your best runs with more than 25 achievements. Compete against your friends and other people around the world's high scores on the leaderboards!\r\n<br/></p>\n<p>• GO AD-FREE: Enjoy all the fun uninterrupted by removing the minimal ads and getting a free bonus to your UCs.\r\n<br/></p>\n<p>-\r\n<br/></p>\n<p>Thanks for supporting the first release from the indie game studio, UMOK Games!\r\n</p>", "metacritic": null, "released": "2021-07-14", "tba": false, "updated": "2021-07-16T07:22:34", "background_image": "https://media.rawg.io/media/screenshots/31a/31a74430c1b36ff884d9c038fa8d7eda.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 84, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["UMOK Games"], "genres": ["Action"], "publishers": [], "esrb_rating": null}