{"id": 635911, "slug": "ctrlalt-zombie-esc", "name": "CTRL+ALT ZOMBIE ESC", "name_original": "CTRL+ALT ZOMBIE ESC", "description": "<p>A solo game jam made in ~50 hours about surviving a zombie apocalypse.  There are 4 different endings (5 if you count dying) that you can uncover.  A single playthrough can take as little as a few minutes if you know what to do and the RNG gods are on your side.  Average playthrough seems ~30 minutes.</p>\n<p># INSTRUCTIONS</p>\n<ul><li>Press \"?\" to open up the help menu. (`Shift+/` sorry non EN keyboard / dvorak users)</li><li>Generally read the screen, anything in square brackets can be pressed on the keyboard to activate it.  i.e. press the [t] key to \"Play with [T]urtles\", etc</li><li>\"Shift+I\" opens up your inventory, and shows how many HP you have.</li><li>Go to your bedroom (where you start) and press [R] to rest.  It will pass the time until the next morning.  If you have any food, you'll eat it and regenerate your HP.</li><li>Killing enough zombies will get you more max HP after a sleep.</li><li>Read descriptions, they change based on what items you have in your inventory.</li><li>Every action progresses time.  The clock is displayed at the top.</li></ul>\n<p># Hints</p>\n<ul><li>Watch the clock! Night is dangerous, more encounters, harder to run away.  More likely to run into giant hordes that will mess up your face.</li><li>Hidden stats like: noise weapons make, critical strikes, etc.  Play around with different weapons.</li><li>Scavenge a lot: drop rates are really low.</li></ul>\n<p># Source Code</p>\n<p>All source code, including the python script that generates the ASCII art is available here:</p>\n<p>https://gitlab.com/game-jammers/zombie</p>\n<p>Bleeding edge version of the game can be played on gitlab pages (ie: this gets updated whenever I push to master, may or may not be working at any given time)</p>\n<p>https://game-jammers.gitlab.io/zombie/<br/></p>\n<p># Dev Notes</p>\n<p>I've been trying to do a game a month, but this month I won't have access to my computer for 2 weeks so I had to rush.  I waffled a while and couldn't figure out what to make, this game was a happy accident.  There's a few endings I missed, and I was planning on going through and rewriting everything with more of an Earthbound flavor (my first pass was generic zombie stuff) but ran out of time.  Oh well.</p>\n<p>I wanted to practice my JavaScript and try this UI library called SVELTE and this sort of just happened.</p>\n<p>I'm posting this a little early since I will be AFK and not able to make updates if there are game breaking bugs.</p>", "metacritic": null, "released": "2021-07-14", "tba": false, "updated": "2021-07-16T07:22:48", "background_image": "https://media.rawg.io/media/screenshots/9d4/9d45051c847732ff931ae1f862e40990.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 29, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Jamming Games"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}