{"id": 635976, "slug": "bullet-priest", "name": "Bullet Priest", "name_original": "Bullet Priest", "description": "<p>An in-development subversive bullet-hell. Convert your enemy's bullets to your side and use them against your opponents. The faster your bullets go, the more damage the enemy takes &amp; vice-versa. You can move freely through enemies, but their bullets will hurt you.<br/></p>\n<p><strong>Player Stats<br/></strong></p>\n<ul><li>Bounces: How many times your bullets will bounce. Enemy bullets do not bounce (currently).</li><li>Conversion Rate: Chance of your bullets to convert enemy bullets to your side on collision. Starts at 10% and increases per level.</li></ul>\n<p><strong>Abilities</strong></p>\n<p>More to be added. The plan is to have you start with one or two abilities that you select, and to have others drop during the game.<br/></p>\n<ul><li>Left Click: Gravity Pull - Pulls in nearby bullets and converts them, before repelling them away at high speed. Makes you invincible while active.</li><li>Right Click: Wave Attack - Sends out a shockwave and stays around for a bit, converting any bullets touching it. Great for bumping enemy bullets. Makes you invincible while</li><li>Q: Bullet Time - Slows bullets.</li><li>W: Missionaryism - Sets your bullet conversion rate to 100%.</li><li>E: Conversion Therapy - Try to convert all enemy bullets on screen at your current conversion rate.</li><li>Space: Recall - Call back all of your bullets to your player, and reset the bounce count.</li></ul><p>You can press tab to view your stats and escape to pause. Expected release price: $3<br/></p>\n<p>Uses this artwork pack: https://vectorpixelstar.itch.io/1-bit-icons<br/></p>", "metacritic": null, "released": "2021-07-14", "tba": false, "updated": "2021-07-16T07:38:37", "background_image": "https://media.rawg.io/media/screenshots/04c/04c80166dabff157d65132aaad9a7d77.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 60, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Infatuation"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}