{"id": 636000, "slug": "bhabhi", "name": "Bhabhi", "name_original": "Bhabhi", "description": "<p>Bhabhi Card Game<br/><br/>Getway - Thulla is played in the punjab region of India, Pakistan and Bangladesh. The objective of the game is to \"get away\" all the cards he/she have by playing. The one who fails to get away all his/her cards is the loser.<br/><br/>This game is popularly known as Bhabhi which in Hindi means \"brother's wife\". Bhabhi name is given to the loser of the game. The game is sometimes known as Bhabhi Thulla, \"thulla\" being a Hindi slang word for police, applied to a card of a different suit that interrupts the play of a trick.<br/><br/>If you are a cards lover than Get Away - Bhabhi Thulla is a great game for you. A very addictive &amp; cards loving game - Bhabhi. It is so common to play Bhabhi cards game in different countries of world like India, England, Pakistan, U.S.A and Bangladesh.<br/><br/>The objective of this game is to get away by playing all card and the one who can not get away his/her cards and remain holding cards will be a looser. This game is popularly known as Bhabhi in Asian-countires like India, Pakistan &amp; Bangladesh and get away in European countries or all round the world.<br/><br/>Bhabhi Thoso has lots of challenges which makes it addictive.<br/><br/>Modes:<br/>Bhabhi cards game has 3 modes.<br/><br/>1 Classic Mode: Each player is given 13 cards &amp; the one who has Ace of spades will make the first move.<br/><br/>2 Challenging Mode: Only you will get 16 cards and everyone else will get 12 cards each.<br/><br/>3 Pro Mode: Only you will get 19 cards and everyone else will get 11 cards each.<br/><br/>Features:<br/><br/>- Custom table: Enables user to select limit of table/coins.<br/><br/>- Coin box: Get free coins while playing.<br/><br/>- Daily Reward: Get rewards by playing game daily in a row.<br/><br/>- Offline game: Internet is not required for playing this game.<br/><br/>- Player Avatar: There are 4 avatar to choose from for your player id. To choose avatar, click on your profile photo, and then choose one from the given or set your own from the gallery.<br/><br/>- Multi-language: Supports Hindi, English and Gujarati languages.<br/><br/>- Beautiful UI and amazing sound effects, to provide you an extraordinary experience.<br/><br/>- Automatic card arranging, which gives your more freedom to think.</p>", "metacritic": null, "released": "2021-07-14", "tba": false, "updated": "2021-07-16T07:45:13", "background_image": "https://media.rawg.io/media/screenshots/880/8809468f2e790dab2b1da7f30635b77a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 142, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Free Card Games Offline"], "genres": [], "publishers": [], "esrb_rating": null}