{"id": 636160, "slug": "i-wish-you-good-hug", "name": "I Wish You Good Hug", "name_original": "I Wish You Good Hug", "description": "<p>You have been given the most important task known to mankind: making sure that teddybears get the soft, warm hugs they deserve!</p>\n<p>In \"I Wish You Good Hug\", 1-4 players will cooperatively try to grab teddy bears (by hugging them) and (gently) throw them in the arms of their fellow players. Why? So they'll eventually end up in a warm soft bed!</p>\n<p>But ... you can only <em>move</em> and <em>rotate</em>.</p>\n<p>So we've added some very special cells to help you, such as trampolines that periodically shoot the teddy bears, stores where you can buy pillows, and holes where you can throw away those prickly cacti that sometimes appear.</p>\n<p>A short couch coop chaos game for 1-4 players. A campaign with 27 levels. A cute and warm hug, in video game form.</p>\r\nControls\r\n<p>This game is playable ... </p>\n<ul>\n<li>On Windows/Mac/Linux with any combination of keyboard and controllers</li>\n<li>On Android. Make sure multitouch is on and (media) gestures are off.</li>\n</ul>\n<p>The full game only has two controls: move your character around and rotate it.</p>\n<p>This means it's simple to pick up and playable by literally anyone. But not because it's an easy game — oh no, properly hugging is never easy!</p>\n\r\nWhat do I do?\r\n<p>The objective is the same throughout the whole game: get teddy bears to where they want to go!</p>\n<p>However, you can only grab bears by hugging them, and there are a great many thorny obstacles to avoid on your way. You must move past cacti, alarm clocks, shooters, and more, whilst being correctly rotated to hug the things you want to hug.</p>\n\n<p>Additionally, there's an annoying but necessary secret ingredient called <em>teamwork</em>. Each player has their own area and cannot (easily) visit others, which means you'll have to communicate, hand your bears to your teammates, and make sure they are rotated correctly to receive them.</p>\n<p>In other words: throwing a bear in this game is the ultimate trust hug.</p>\n\r\nThe 1-week challenge\r\n<p>I love couch co-op games and have tons of cute, little ideas for them.</p>\n<p>However, I have the tendency to make every project TOO BIG, so I challenged myself to make those tiny ideas in just a week. This is the second game made via this challenge. The first game was A Recipe for Disaster\r\n\t\t\t\t\r\n\t\t\t\t</p>\n<p>Originally, this game was called <em>Huggy Bastard</em> ... but that didn't seem very family friendly and might have given the wrong impression. So I changed it last-minute.</p>\n<p>If you have any <em>feedback</em> (improvements, bugs, things that are unclear/too hard/too easy, etc.), never hesitate to let me know. Even though I can do a lot of development in a week, these games are bound to have areas that can be greatly improved with your feedback.</p>\n<p>For a more detailed \"devlog\" (with the lessons I learned, the original idea, etcetera), visit: I Wish You Good Hug: What I've Learned<br/></p><p>And as always: if you have any feedback or encounter problems, let me know.\r\n\t\t\t\t\r\n\t\t\t</p>", "metacritic": null, "released": "2021-07-13", "tba": false, "updated": "2021-07-16T08:31:41", "background_image": "https://media.rawg.io/media/screenshots/a27/a27b71b895c4ac0d223c343714d7f2c4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 35, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Android"], "developers": ["Pandaqi"], "genres": ["Action"], "publishers": [], "esrb_rating": null}