{"id": 636282, "slug": "suki-story-rpg", "name": "Suki Story RPG", "name_original": "Suki Story RPG", "description": "<strong>UPDATE :   La 1ère démo du  RPG Suki Story est dispo  /   Suki Story RPG Alpha Demo is available  !</strong>\n<p><strong><em>Aujourd'hui c'est    la fête des amants de Tanabata et la démo du nouveau RPG est sortie... Le RPG contient de nombreux spoilers puisqu'il découle du Visual Novel. Il y a peut-être aussi quelques bugs vu que c'est une version alpha...</em></strong></p>\n<p><strong><em>Today it's Tanabata, and the 1st alpha version of the new Suki Story videogame is released. The RPG may  contains some spoilers because it's a  spin off episode of   the Visual Novel. Maybe there are also a few bugs because it's an alpha version of the videogame...</em></strong></p>\n\n<em>L'aventure Suki Story</em>  ⛩  continue avec un   RPG<em>  qui reprendra l'histoire  du  visual  novel et une route non explorée du roman   :</em>\n<p>\n</p>\n<p><em>Pour la suite de mon Visual Novel  Suki Story   https://srmedias.itch.io/sukistory  je cherchais comment raccrocher l'histoire de mon visual novel à celle de mon rpg, puis je me suis souvenu que j'avais pas traité une des parties dans mon roman visuel, faute de ressources graphiques...</em></p>\n\n<p>\n</p>\n<p><em>C'est une partie qui nécessitait également des combats et une évolution des personnages, du coup le rpg s'imposait... mais j'ai quand même écrit une fin simplifiée à l'histoire dans le visual novel.</em></p>\n\n<p>\n</p>\n<p><em>Du coup ce RPG va s'intercaler vers les 2/3 du VN où un évènement surnaturel se produit sur la vieille route menant vers Edo (Old Tokaido Road). C'est un lieu plein de mystères dans la forêt, et on dit qu'on y croise parfois des Yōkai...</em></p>\n\n<p><em>Deux nouveaux personnages vont également se joindre à nous au cours de l'aventure... Il y aura toujours le fil conducteur des fleurs dans le jeu, avec un univers moins photoréaliste et plus fantasy cette fois.</em></p>", "metacritic": null, "released": "2021-07-13", "tba": false, "updated": "2021-07-16T09:06:39", "background_image": "https://media.rawg.io/media/screenshots/f0c/f0c5a4356f4c5434afc2c6c3d585f1d7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 85, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["srmedias"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}