{"id": 636305, "slug": "berry", "name": "Berry", "name_original": "Berry", "description": "<strong>Berry</strong> is a short orthogonal 3D platformer centered on delivering light bullet-hell challenges and precise projectile manipulation using its unique web-orbiting systems. Fight unique bosses and unlock new abilities in this tiny Metroidvania adventure!<br/><br/><h3>Welcome! Welcome!</h3>Embark on a small and crunchy adventure up Yamakuu mountain's somewhat treacherous terrain to reach an illumination brighter than any spider has ever achieved. Explore over <strong>50 maps</strong> and combat multiple bosses while platforming, dodging, and vibing within the world of bugs. Try and consume all the flies hidden throughout the world!<br/><br/><h3>New Features!</h3>As the 1st place winner of the Touch the Stars game jam, Berry was already packed with tons of challenging and unique platforming mechanics; however, upon being published to Steam, Berry has been updated with new features based on user feedback!<br/><ul> <li>Collect hundreds of NOMI spread across the world to spend on newly added shops!<br/> </li><li>Track down each of the 4 terrains’ shops, each with unique items that provide new combat, cosmetic, and utility capabilities to your tiny spider!<br/> </li><li>Make use of the new shield system! Either use the shields to provide yourself with additional health or find methods to dispose and gain more NOMI!<br/> </li><li>There are now a total of 20 flies hidden in the world! The more you collect, the more powerful your abilities become.<br/> </li><li>Added a complete options menu and the ability to reference the game controls from the pause menu.</li></ul> <br/><h3>Multiple Endings!</h3>Depending on the number of flies that are collected and consumed, the game may end with any of the 5 available endings (with a 6th true ending that requires additional conditions to be fulfilled). Will you remain a weak spider for the sake of the mindless flies? Or will you consume everything in your path and become an unstoppable force?<br/><br/><br/>", "metacritic": null, "released": "2021-07-13", "tba": false, "updated": "2021-12-10T02:54:04", "background_image": "https://media.rawg.io/media/screenshots/62a/62a9cedefd0fb4a404c589b4a8864e2d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 114}, "playtime": 1, "achievements_count": 13, "ratings_count": 0, "suggestions_count": 92, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["Leuns", "ProjectESPider"], "genres": ["Action", "Adventure", "Educational", "Indie"], "publishers": ["Degica"], "esrb_rating": null}