{"id": 636358, "slug": "bubblehead-bash-nao-perca-a-cabeca", "name": "Bubblehead Bash (Não Perca a Cabeça!)", "name_original": "Bubblehead Bash (Não Perca a Cabeça!)", "description": "<p>* PT-BR: Para jogar em portugues, aperte F1 dentro do jogo, clique \"Settings\" en cima a esquerda, muda a lingua para portuguese e <strong>aperte OK</strong>. </p>\n<p>________________________</p>\n<p><strong><em>EN</em></strong></p>\n<p>My submission for the GDJA JAM #01!</p>\n<p>In it, you play a Blue Bubblehead and face off against the Red Bubbleheads in a modified dodgeball game. The dodgeballs, of course, are your own heads!\r\n</p>\n<p>The game has a timer of 60 seconds. Your goal is to extend that timer as much as you can. \r\n</p>\n<p>You gain 10 seconds to the timer when you bring a Red Team Head inside their goal line (to the left, on the 2nd screenshot), but beware, because you can lose 10 seconds if they bring a Blue Bubblehead's head in your goal line instead.</p>\n<p>You can pick up and throw your heads to stun the enemy team. Just make sure you're throwing the right color!\r\n</p>\n<p>Stunned characters will be unable to move for a few seconds, they will lose what they had picked up and will drop their own head.\r\n</p>\n<p>JAM SPECIFICITIES</p>\n<p>There are two versions of this project because I submitted the game to two different Game Jams. I started working on this project on July 9th at 5 PM EST, which fits in the timeline of both submitted jams. All assets are my own &amp; made during the timeframe of the jams.<br/>BGM can be listened to here: https://soundcloud.com/user-565668188/bubblehead-bash<br/>Here is the Mini-Jam 84 version (unpolished &amp; untranslated): https://harieiv.itch.io/bubblehead-bash</p>\n<p>INSTRUCTIONS (can be found in-game, in Game Data)</p>\n<p>- Move with Arrow Keys <br/>- Press X to detach/respawn your head\r\n<br/>\r\n- Press Z to grab a bubblehead/throw a grabbed bubblehead\r\n<br/>\r\n- Press F5 to restart the game<br/>- Press ENTER to skip the tutorial</p>\n<p>_____________________________________</p>\n<p><strong><em>PT</em></strong></p>\n<p>Minha contribução para o GDJA JAM # 01!</p>\n<p>Você é um Blue Bubblehead e enfrenta os Red Bubbleheads em um jogo de queimada modificado. As bolas, é claro, são suas próprias cabeças!</p>\n<p>O jogo tem um cronômetro de 60 segundos. Seu objetivo é estender esse cronômetro o máximo que puder.</p>\n<p>Você ganha 10 segundos para o cronômetro quando traz uma cabeça de equipe vermelha para dentro da linha de gol vermelha (à esquerda, na segunda imagem), mas cuidado, porque você pode perder 10 segundos se eles colocarem uma cabeça de bolha azul em sua linha de gol.</p>\n<p>Você pode pegar e jogar suas cabeças para atordoar o inimigo. Certifique-se de que está jogando a cor da sua equipe!</p>\n<p>Personagens atordoados serão incapazes de se mover por alguns segundos, eles perderão o que estavam caregando e deixarão cair suas próprias cabeças.</p>\n<p>ESPECIFICIDADES DO JAM</p>\n<p>Existem duas versões deste projeto porque eu enviei o jogo para dois Game Jams diferentes. Comecei a trabalhar neste projeto no 9 de julho às 17h EST, o que se encaixa na linha do tempo de ambos os jams enviados. Toda a arte, efeitos e musica são meus e feitos durante o período dos jams.</p>\n<p>BGM pode ser ouvido aqui: https://soundcloud.com/user-565668188/bubblehead-bash</p>\n<p>Aqui está a versão do Mini-Jam 84 (sem efeitos especiais ou tradução): https://harieiv.itch.io/bubblehead-bash</p>\n<p>INSTRUÇÕES (podem ser encontradas dentro do jogo, em \"Game Data\")</p>\n<p>- Mova-se com as setas<br/>- Pressione X para separar / regenerar sua cabeça de bolha<br/>- Pressione Z para pegar / lançar uma cabeça de bolha<br/>- Pressione F5 para reiniciar o jogo<br/>- Pressione ENTER para pular o tutorial</p>\n<p>_____________________________________</p>\n<p>PT</p>", "metacritic": null, "released": "2021-07-13", "tba": false, "updated": "2021-07-16T09:30:54", "background_image": "https://media.rawg.io/media/screenshots/668/668370bb19f911ceaad9cec1e9ea197d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 51, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Harieiv"], "genres": ["Sports"], "publishers": [], "esrb_rating": null}