{"id": 63644, "slug": "fairyland-power-dice", "name": "Fairyland: Power Dice", "name_original": "Fairyland: Power Dice", "description": "This is a small board game for 1-4 players based on Fairyland’s universe. It is created by the fans of the game series and it allows you to look at the war of Fairyland and the Rukand Kingdom from an entirely new angle. It will definitely not leave the fans of the game series indifferent and you will enjoy playing a couple of hours together with your friends. Get the power crystals, change the course of the war in your favor, and let the dice decide Fairyland’s fate!<br/>\r\nThe rules are simple:<br/>\r\nUp to 4 players can participate in the game. The main goal of players is to lead all their characters around the circle to the crystal.<br/>\r\nIf at least one die rolls 6, then you can get your character out of the house.<br/>\r\nIf two dice roll the same number, you can move your character's piece four times.<br/>\r\nThe number of cells for the move is selected after you click on your character’s piece.<br/>\r\nIf your character’s piece gets to the cell occupied by another player’s character piece, then the other player’s character piece flies back to his house and must start the circle from the beginning.<br/>\r\nIf it’s impossible to make a move, you need to click on the symbol in the center of the screen to transfer the move to the next player.", "metacritic": null, "released": "2018-07-09", "tba": false, "updated": "2022-08-30T14:11:04", "background_image": "https://media.rawg.io/media/screenshots/511/511a18e1241d4f4c91d0b24652df521e.jpg", "website": "http://naarassusi-game.ru/", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 130, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["peter8031983"], "genres": ["Strategy", "Casual", "Massively Multiplayer", "Indie"], "publishers": ["Naarassusi Publisher"], "esrb_rating": null}