{"id": 636577, "slug": "sanaltopia", "name": "SANALTOPIA", "name_original": "SANALTOPIA", "description": "<p><strong>OYUN HİKAYESİ</strong></p>\n<p> Karakterimiz Emre oldukça karamsar ve çekingen. Hatta bu konuda psikolojik destek dahi alıyor. Emre'nin yatakta uyanmasıyla başlıyor hikayemiz. Uyku halinden kurtulmak için odasında gezinen karakterimizin moralini dışarıdaki güzel hava ve kuş sesleri bile düzeltemiyor. Odasından çıkıp evi gezen Emre aşağı kata indiğinde çıkış kapısının önünde Prof. Dr. Çetin Ceylan'dan gelen zarf ile şaşkına dönüyor. Başının belada olup olmadığını merak edip okumaya başlıyor. Zarfta psikolojik destek alan insanlar için alternatif bir yaşam simülasyonu geliştirdikleri, oyundaki huzurlu ve eğlenceli ortam sayesinde insanları zihinsel anlamda rahatlattıkları hatta iyileştirdikleri yazıyor. Simülasyonun dosyalarına mailinden ulaşabileceğini de ekliyorlar. Bunun üzerine Emre simülasyonu bilgisayarına yükleyip, oyunu başlatıyor. Simülasyonun başlangıcındaki video ile o dünyanın içine çekiliyor. İçeride her şey çok güzel giderken sistemdeki bir hata yüzünden tüm dosyalar silinmeye başlıyor. Emre dışında simülasyondaki diğer insanlar dünyadan çıkabiliyor ancak Emre dünyadan tam anlamıyla çıkamıyor. Simülasyon ile gerçek dünya arasında sıkışıyor. Tek seçenek Profesörün oluşturacağı geçitten geçip kendi dünyasına dönmek fakat ne profesör o geçidi oluşturabiliyor ne de karakterimiz kendi dünyasına dönebiliyor.  Emre oyunun içindeyken siliniyor sonucunda bedeni de ölüyor. Yaptıkları hatanın anlaşılmasını istemeyen profesör eve gelip bedeni yakıyor ve oyun bitiyor.</p>\n<p><strong>AÇIKLAMA</strong></p>\n<p>Ortağımın ve benim ilk oyunumuz olduğu için oyun içinde eksiklerimizin olduğunun farkındayız. Yorumlarda veya bize ulaşarak bu eksikleri iletmeniz kendimizi geliştirmemiz açısından çok önemli. Değerli vaktinizi ayırıp oyunu oynadığınız veya veya bu sayfaya göz attığınız için hepinize çok teşekkür ederiz.</p>\n<p><strong>TAKIMIMIZ</strong></p>\n<p>Mustafa Emre Şahan(@emresahan https://emresahan.itch.io/) : Musics &amp; Sounds and Images</p>\n<p>Engin Can Yalçın(@ihopeitsover https://ihopeitsover.itch.io/) : Game Devoloper &amp; Coder</p>\n<p>                                                                  <strong> MÜZİKLER VE TİLESETS</strong></p>\n<p>Müzikler:<br/>Alternatif Dünya Arkaplan müziği: Megan McDuffee - Don't Go In There<br/>Oyun Giriş Menüsü Arkaplan Müziği: Chill Lofi background Music to vibe to<br/>Oyun İçi Arkaplan Müziği: No Copyright Music] Free Chill Lofi Instrumental (Copyright Free) Chill Lofi Piano Music<br/></p>\n<p>Tilesets: Comshou ve RPG Maker Mv hazır tileset</p>\n<p>Site Fon: https://wallpaperaccess.com/city-pixel-art</p>", "metacritic": null, "released": "2021-07-12", "tba": false, "updated": "2021-07-16T10:35:23", "background_image": "https://media.rawg.io/media/screenshots/989/989a5d26c50a3efad9e0b9bec8d1c4c0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 101, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mustafa Emre Şahan"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}