{"id": 636575, "slug": "a-journey-to-the-dead-world", "name": "A JOURNEY TO THE DEAD WORLD", "name_original": "A JOURNEY TO THE DEAD WORLD", "description": "<p>Sene 2173 Kuraklık ile savaşı kaybeden Dünya, canlı yaşamının bir çoğunu kaybederek insanlık için yaşanmaz bir duruma gelmiştir. Bunun sonucunda insanlık, kolonileşmeye başladığı Mars'ta yaşama tutunmayı başararak orada yaşamaya başlamştır. Medeniyetini artık Mars'ta sürdüren insanlık, geliştirdiği siber teknoloji ile birlikte insanlar arasındaki işçi sınıfı yerini robotlara bırakmıştır. Teknoloji ile paralel olarak gelişen sağlık sektörü sayesinde ortalama insan ömrü 150 seneye ulaşmıştır. Ancak gelişen teknoloji bir gün aniden sarsılır. İnsanların evine kadar girmiş olan robotların bir çoğu kendini imha etmiş geriye kalanlar ise canlı-cansız fark etmeksizin, önüne çıkan nesneye saldırmaya başlamıştır. Bunun nedenini araştıran mühendisler ve bilim adamaları sorunun, Dünya'da bulunan ana bilgisayarda gerçekleşen bir sistem hatası olduğunu anlar. GAHA(Galactic Human Army) askerleri çığrından çıkmış olan robotlar ve ayak sesleri yükselmekte olan anarşi ile uğraşırken genç bir asker olan \"sen\" bu mühim sorunu çözmek ile görevlendirildin. Haydi asker ölü Dünya'ya yolculuk vakti!</p>\n\n<p>kontroller</p>\n<p>Hareket: WASD</p>\n<p>Onaylama : E</p>\n<p>Yapımcılar : </p>\n<p>Mehmet Furkan Ünler</p>\n<p>Cem Yağız Tolun</p>\n<p>Doğan Baysülen </p>\n<p>Kullanılan AssetLer :</p>\n<p>Cinemachine </p>", "metacritic": null, "released": "2021-07-12", "tba": false, "updated": "2021-07-16T10:34:44", "background_image": "https://media.rawg.io/media/screenshots/855/855be7298e6dbea255b8ab2e6e1c6fc9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 78, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["mehmet7882"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}