{"id": 63669, "slug": "alien-worms-invasion", "name": "Alien Worms Invasion", "name_original": "Alien Worms Invasion", "description": "<strong>overview</strong>       Alien Worms Invasion is a game of futuristic exploration and tower defense. In the game, you can explore unknown areas and build bases and units to defense the attack of the worms which would be killed in the end. At the same time, you can produce various kinds of soldiers by rescuing the tripped people in the wild or building the armies in order to protect the base and even to attack the worms’ nests. The longer time you play the game for, the stronger the enemies will be in the game. Whether you can finish the tasks in the game depends on how to balance the power between the defense and the attack.<br/><br/><strong>Background setting </strong><br/>       With the high development of the society in the future, the earth is invaded by the worms.The human beings fought fiercely and were defeated finally. With the help of the armies, the survived people flee from the earth to the outer space for an unknown exploration. The main character was once a captain of a spaceship. He gradually takes revenge of the worm during the flee with his men in the spaceship.<strong>Units introduction</strong>Refugees<br/>The human beings captured by the worms can be rescued to become the civilians.<br/>Civilians<br/>The plain human beings can be armed by producing armies to become any kind of soldiers.<br/>Engineering Airplanes<br/>the Engineering Airplanes can be transformed into the energy of the trees in the worms forests during the battle and can be used to upgrade any kind of buildings.<br/>Soldiers<br/>soldierscan be armed to be army soldiers in the military and are the basic units of attack. They can attack the nearby worms.At the same time they can attack the worms near the base in order to obtain energy.<br/>Cannons<br/>Cannons can be produced by the armory and can do great harm to the worms.<br/>Mecha commanders<br/>The Mecha commanders can defense the attack of the worms and do great harm to the worms with the help of the mechas produced by the base. They can also lead the armies to attack the worms.<br/>...", "metacritic": null, "released": "2018-03-12", "tba": false, "updated": "2019-08-28T21:56:25", "background_image": "https://media.rawg.io/media/screenshots/e7f/e7f7c726bdbc0645dd7b3e5cd761800e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 297, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mímir Studio"], "genres": ["Strategy", "Indie"], "publishers": ["Mímir Studio"], "esrb_rating": null}