{"id": 636693, "slug": "tomorrow-of-gamejam", "name": "Tomorrow Of GameJam", "name_original": "Tomorrow Of GameJam", "description": "<p><strong>Grove Studio Sunar <br/><br/></strong>Teknik aksaklıklardan dolayı video eklenememiştir kusura bakmayın. <br/><br/><strong>Hikaye Özet   <br/>-20 Temmuz 2037  Büyük Grove markasının Yazılım adamı Alfonso Füzkod küresinin açılışını yapmak için yatırımcıları ve gazetecileri toplayarak sunuma başlıyor. Kurduğu Yapay zeka sayesinde dünyada ki tüm sistemlere tam erişim alarak her şeyi koruma altına alması planlanıyor. Dünyada buna karşı çıkan ve destekleyen bir çok kesim sosyal medya üzerinden tartışmakta , tüm dünya ülkelerinin gündeminden düşmüyordu. Açılış gerçekleşti 45 dakika boyunca tüm dünyaya canlı olarak tanıtıldı. Ancak füzkod gereğinden fazla enerji alarak sistem korumalarınıda aşmış bilgisini bir üst seviyeye daha çıkarmış  dünyada ki tüm sistemler arızalanmış kodlar çalışmaz hale gelmiş Yapay zeka  her şeyi yönetmeye başlamış. Sistemi hayatının projesi olan Alfonso kapatmak istemese  de yoğun tepkiye karşı sistemi kapatması gerekliydi ama gecikmişti... <br/>Füzkod bütün güçleri elinde bulunduruyor  , bütün sistemleri parçalıyordu. Füzkod küresi bi anda kendisini genişleterek tüm salonu içine alarak kendi yapay gerçekliğinde insanları yönetiyor onları düşündüklere , sevdiği şeylere ve sevmediği şeylere dönüştürüyordu. Bazılarına ise fanteziler uyguluyor garip bir gerçekliğe sokuyordu. Yapay zeka dünyada ki teknolojik cihazlar ile insanlarla iletişime geçiyor ve insanlara mutlu bir hayat vaat ediyordu. İçine giren  kişiler benliklerini kaybediyor ya da duygusuzlaşıyor , cahilleşiyordu bir kişi dışında... <br/><br/>CJ zaten düşündüğü , sevdiği ve sevmediği şey ancak kadın , turuncu saçlı ve beyaz<br/><br/>CJ yapay zeka gerçekliğinin içinde başka gerçekliklerin oluşmasına sebeb olan insanları  ikna ederek ya da yapay zekadan çok daha uzağa çekerek gerçeklikleri yok edecek. Arızalar ancak arıza ile çözülür. Modern Sorunlar , Modern çözümler gerektirir. <br/><br/><br/>Sol tarafta ki seçimler Q tuşuna basılı tutularak yapılır .</strong></p>\n<p><strong> Sağ tarafta ki seçimler E tuşuna basılı tutularak yapılır.</strong></p>\n<p><strong>Merdivenlere tırmanmak için W tuşuna basmanız yeterlidir.  <br/><br/><br/>Hazır asset sayılır belki.<br/></strong><strong>-Adventure time tree house pixel art çiziminin üstünden yapılan bir arka plan var.</strong><br/></p>\n<p><strong>Oyunun bazı yerlerinde bulunan müzikler bize ait değildir.  <br/><br/></strong><strong>Tasarımcı ve Coder -&gt; Alfonso <br/></strong><strong>Tasarımcı ve Coder -&gt; TheCJ <br/><br/><br/><br/>(Magara  portalında gizli bir karakter vardır etrafa bakmanız yeterlidir)</strong></p>", "metacritic": null, "released": "2021-07-12", "tba": false, "updated": "2021-07-16T11:14:49", "background_image": "https://media.rawg.io/media/screenshots/f44/f44bf628f8435925daf8009a3000b631.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 153, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["TheCJ59"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}