{"id": 63663, "slug": "vinnies-diary", "name": "Vinnie's Diary", "name_original": "Vinnie's Diary", "description": "Protaganist's WordThis is indeed an intriguing case. My doctorate supervisor introduced a patient with a difficult condition to me after my graduation. At the age of six, the boy had hallucinations and often fantasized about traveling with his other persona. I had to say that the treatment process was quite unusual. I went on a trip to his imaginary world. How did I do it? It is hard to explain. You will have to see it yourself and all puzzles will be solved at the end.Brief Introduction of The StoryAfter 20 years of meeting with Vinson Gogh, our protagonist Dr. Shawn received a letter and some souvenirs from Vinson. These things brought back some memories for Shawn from the treatment process. Now, let us follow Edward Shawn back to 20 years ago to witness Vinson's magical world. In this journey, you will play as Vinson's psychologist, step into his heart, solve the mystery and reveal the story behind it.Solve PuzzlesYour patient will not open up to you at first, and you will face all kinds of obstacles in this journey. Incarnate as a kind traveler, and unearth the fantasies in his heart . Clear your mind, and engage in intricate puzzle, as long as you think carefully, nothing can stop you from understanding his deep mind.Make Your Choices It takes patience to understand a young heart, but don't forget that a word or two from a child means much more than you imagine. Are you his doctor or spiritual mentor?Place Yourself in Fantasy WorldsWhat are the origins of Vinson's fantasies? What makes his fantasies so real? All is left for you, a professional child psychology expert to answer.Make Up The StoryAre you able to reveal the whole story by getting the pieces of information from the fantasy worlds? A psychologist had his rules of conduct, what decisions would you, Dr. Shawn, make to save the patient?What Would I Experience in Vinnie's Diary?Hear-Warming story and solving carefully-designed puzzles. During these hours of gameplay, in these colorful dreams, unravel the riddles and Vinson's secrets. <br/>Can you help this six-year-old boy to let his dreams fly, becoming the person he wishes to see?", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:56:25", "background_image": "https://media.rawg.io/media/screenshots/a75/a759b2699da5ed57781b123dadf317b3.jpg", "website": "http://vinniesdiary.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 376, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Entangle Games"], "genres": ["Adventure", "Indie"], "publishers": ["Entangle Games"], "esrb_rating": null}