{"id": 636756, "slug": "mismatched-cable", "name": "Mismatched Cable", "name_original": "Mismatched Cable", "description": "<p>Arkadaşımla beraber <strong>Magara Jam #3</strong> için 72 saatte yaptığımız bir oyundur.</p>\n<p>Far82ten-US veya kısaca Fanus, yıllardır geliştirilmekte olan bir cyborg projesiydi. Bir gün, kablo tabanlı bir donanım arızası nedeniyle bilinci yerine gelir ve Savaş ya da kaç mekanizması devreye girer. Kaçmaya karar verir, ancak oluşturduğu tehdit nedeniyle buna izin verilmeyecektir...\r\n</p>\n<p>Bu çeşitli zorluklara karşı hayatta kalmaya çalıştığınız bir oyundur. 3 aşamadan oluşur ve her aşamada oyun daha da zorlaşır. Bu aşamalar puan toplayarak açılır.\r\n</p>\n<p>Bu bizim ilk geliştirdiğimiz oyun , eğer oyunu oynadıysanız bir yorum bırakarak bize oyunla ilgili bir geri bildirim verebilirsiniz. İyi eğlenceler. \r\n</p>\n<p>oyunu beğendiyseniz oylayarak bize yardımcı olabilirsiniz. İyi eğlenceler!\r\n</p>\n<p>Oyunu motoru olarak Unity'yi, Pixel artlar için ise Aseprite'ı kullandık.\r\n</p>\n<p><strong>Senaryo/OyunGeliştiricisi: Ferona</strong> --&gt; https://ferona.itch.io/\r\n</p>\n<p>\n</p>\n<p><strong>Pixel/2D Artist: Quaky </strong>--&gt; https://kuaki.itch.io/\r\n</p>\n\n<p>Müzikler ve  ses efektleri dışındaki bütün assetler bize aittir.</p>\n<p>---------------------------------------------------------------------</p>\n<p>The game we made with my friend for <strong>Magara Jam #3</strong> in 72 hours. </p>\n<p>Far82ten-US, or Fanus for short, was a cyborg project in development for years. One day, due to a cable based hardware failure, he regains consciousness and the Fight-or-flight mechanism kicks in. He decides to flee, but due to the threat he poses, he will not be allowed... </p>\n<p>This is a simple game about surviving a variety of challenges. The game is divided into two phases, each of which makes it more difficult to survive. These phases are unlocked by collecting points.</p>\n<p> Controls: Movement W, A, S, D (little spoiler alert) this may change during the game. </p>\n<p>This is the first game that we developed, if you did play it you can leave a comment we would be happy to take your feedback about the game.</p>\n<p> If you enjoyed the game, please give it a rating. Have fun! </p>\n<p>We used Unity as game engine and Aseprite as pixel art software. </p>\n<p>\n</p>\n<p><strong>Senario/Game Developer: Ferona</strong> --&gt; https://ferona.itch.io/</p>\n<p>\n</p>\n<p><strong>Pixel/2D Artist: Quaky</strong> --&gt; https://kuaki.itch.io/ </p>\n\n<p>Apart from sound effects and music, we didn't use any other assets.<br/></p>", "metacritic": null, "released": "2021-07-12", "tba": false, "updated": "2021-07-16T11:33:23", "background_image": "https://media.rawg.io/media/screenshots/dfd/dfd2413e0f886f759c04363cca1a34fa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 115, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ferona", "Kuaki"], "genres": ["Action"], "publishers": [], "esrb_rating": null}