{"id": 636868, "slug": "vita-stingy-developer-oboyunbaskani", "name": "VITA (Stingy Developer, OBOyunBaskani)", "name_original": "VITA (Stingy Developer, OBOyunBaskani)", "description": "<p>Bu oyun Mağara Game Jam için 72 saatte yapılmıştır.</p>\n\n<br/>\r\nOyunun Hikayesi\r\n<p>Hikayemiz 2045 yılında kimyasal savaşların yoğun olarak yapıldığı bir dönemde geçmektedir. Savy, Las Vegas'da kimyasal saldırı yüzünden ailesini kaybetmiştir. Bu nedenle kimyasal savaşa karşıdır ve kendini geliştirip bir profesör olmuştur. Üniversitedeki öğretmeni bunu bildiği için kendisinin de çalıştığı gizli bir laboratuvara stajyer olarak gelmesini istemiştir. Greenland Laboratuvarı olarak anılan bu laboratuvarda kimysal saldırıya uğramış insanlar bulunmakta ve bu insanları iyleştirmek için çalışmalar yapılmaktadır.</p>\n<p>Laboratuvarda yapılan çalışmalar ile \"Vita\" adında bir virüs sınıfı evrimleşmiştir. Bu bakteri sınıfı birçok bakterinin özelleşmesiyle oluşmuştur. Bu bakteri sınıfını diğer bakterilerder ayıran en önemli özellik \"kendibilinci\" olmasıdır.  Fakat profesörlerin bundan haberleri yoktur. Aynı zamanda Vita bakterisinin diğer bakterilere göre çok daha fazla besine ihtiyaç duyması, bir taşıyıcı üzerinde  yaşamasını elzem hale getirmiştir. </p>\n<p>10.07.2045 tarihinde yaşanan bir elektrik kesintisi yüzünden bakteri saklama sisteminde arıza oluşmuştur. Bu arıza sırasında kuluçka aşamasında bulunan bir Vita bakterisi bakteri saklama sisteminden kaçarak profesörlerden birine bulaşmıştır. Profesörün zihnini kontrol etmeye başlayan Vita bakterisi, daha gelişmiş Vita bakterileri üretmek için profesörü çalıştırmaktadır. Tüm bunlar olurken, Savy ise  bunlardan habersiz uzun bir süre Greenland labaratuarında staj yapmaya devam etmiştir.  Fakat son zamanlarda tanıdığı Profesörlerin bir garip davrandığını ve geç saatlere kadar çalıştığını fark eder. Bu dönemde kendisinde de bir gariplik vardır. Çok fazla rüya görmeye başlar ve gün içerisinde yalnızken sesler duymaya başlar. </p>\n<p>23.08.2045 de akşam eve gitmek için üzerini değiştirir ve çıkışa yürür. Ancak kapılar kapalıdır ve tüm binada kırmızı alarm çalmaya başlar. Etraftaki iletişim araçlarının da çalışmadığını fark eder. Binanın dış dünya ile iletişimi kesilmiştir. Bunun bir sistem arızası olduğunu düşünerek laboratuvarda sistemin düzelmesini bekler. Fakat bir süre sonra kafasında sesler duymaya başlar. Duyuğu sesin kendisine bulaşan Vita bakterisi ile alakalı olduğunu anlar ve onla konuşmaya başlar. Konuşma sırasında yavaş yavaş taşlar yerine oturur ve tanıdığı profesörlerin neden garip davrandığını anlar. Profesörler bakterilerin kontrolündedir. Konuşma sırasında neden kendini kontrol edemediğini sorar. Kendine ulaşan Vita bakterisinin üretilen ilk bakteri  olduğunu ve üstünde yapılan deneyler, canlı denekler de denenmesi sonucu zekasının  daha gelişmiş  olduğunu söyler.  Onu kontrol edememesinin nedeni ise ailesini kaybetmesi ve bir ideojiye tüm benliği ile bağlandığı için onu kontrol edemediğini söyler. Sonrasında ise laboratuvardan çıkmak için havalandırmayı kullanmaya karar verirler.  Ancak bu sandıkları kadar kolay olmayacaktır.</p>\r\nKontroller\r\n\r\nTuşAksiyonWYukarıASolaSAşağıDSağaSağ TıkSaldırı ( Sadece Canavar Formunda )EscPause\r\nTakım\r\n<ul><li>Hekimoğlu - Senarist / Project Manager</li><li>Oyun Başkanı - Developer<br/>\n</li><li>ÖmerFi - Developer</li><li>SciMask - Pixel Artist<br/>\n</li><li>LivMoore - Pixel Artist</li><li>Comic Stylish - Pixel Artist<br/>\n</li><li>Ozan Demirarslan - Pixel Artist</li><li>Furkan \"Stingy Developer\" Zerman - Web Developer</li><li>Can Şeker - Web Designer</li></ul>", "metacritic": null, "released": "2021-07-12", "tba": false, "updated": "2021-07-16T12:09:28", "background_image": "https://media.rawg.io/media/screenshots/b8f/b8fa31b75d50a3973742c21fc7499f05.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 80, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Stingy Developer", "OBOyunBaskani"], "genres": ["Action"], "publishers": [], "esrb_rating": null}