{"id": 636831, "slug": "berbat-bitmemis-bir-oyunx5a3", "name": "Berbat Bitmemiş Bir Oyun:X5A3", "name_original": "Berbat Bitmemiş Bir Oyun:X5A3", "description": "<p><strong><em>MAĞARA JAM #3 için yapılmıştır.</em></strong></p>\n<p>Dünyadaki Edigenyum rezervleri tükenmek üzeredir. Bunun üzerine insanlık öte gezegenlerden Edigenyum rezervi araştırmasına başlamıştır. Edigenyum, dünyayı değiştirebilecek potansiyele sahip bir hammaddedir ve nerdeyse tüm elementlere çevrilebilir. Ayrıca insanları ikna etmek için de Edigenyum gazı kullanılmaktadır. Edigenyum'un en çok kullanılış biçimi budur. Fatih'te bu araştırma için başka gezegenlere gönderilen kişilerden biridir. X5A3 gezegenine gönderilmek için seçilir. 12 yıllık bir yolculuk için uyutulur. Gezegene inince uyandırılacaktır. Ancak bir sistem hatası nedeniyle erkenden uyanır ve terminaldeki yetkili ile konuşmaya başlar. Bu konuşma sırasında terminaldeki adam biri tarafından vurulur ve olaylar başlar.<br/><br/></p>\n<p>3 adet özel modu olan bir silaha sahibiz. Bu silahımızın üç moduda oyuna farklı bir dinamik katıyor.(Bak şu an inandınız.)<br/><br/><strong>1. Materyal Özümseme</strong></p>\n<p><em>Materyal özümseme</em> modu sayesinde etraftaki ağaç ve kaya gibi nesnelerin elementlerini özümseyebilir ve yeni eşyalar üretebilirsin.</p>\n\n\n<p><strong>2. Platform Oluşturucu</strong></p>\n<p><em>Platform oluşturucu</em> modu sayesinde yükseklere kolaylıkla çıkabilirsin.</p>\n\n\n<p><strong>3. Silah</strong></p>\n<p>Klasik silah. Bu modu olmayan düşmanlarını öldürmek için kullanabilirsin.</p>\n<p>Bütün bu modları klavyenin <em>1,2 ve 3 tuşlarından</em> değiştirebilirsin.</p>\n\n<p>Giysinin 3 adet temel modu vardır.</p>\n<p><strong>1. Üretim</strong></p>\n<p>Bu özellik sayesinde Drone, Çift Zıplama gibi yetenekler edinebilirsin.</p>\n<p><strong>2. Drone</strong></p>\n<p>Drone ile gökyüzünden X5A3'e bir göz atabilirsin.</p>\n<p><strong>3. Çift Zıplama</strong></p>\n<p>İşte hani bazen platform yaparken elin ayağın birbirine dolanır, saatlerce uğraşıp geldiğin o yerden düşersin, en baştan başlarsın. İşte bu sana bir şans daha verir. (Çift zıplama daha iyi pazarlanamazdı.)</p>\n\n\n\n\n<p>Mesela bunun gibi.</p>\n<p><em>(Çaktırmayın, sadece bu var. Belki de daha fazla da vardır ama sürpriz olsun diye söylemiyorumdur.)</em><br/><br/><br/></p>\n\n<ul><li>Oyun bitmedi. Berbat bir oyun oldu. İsmi bu yüzden. Hatta oyunu yükleyemeyecektim diye ama anı olsun hem katılan kişi sayısı bir fazla olsun diye yükledim. </li><li>Bu berbat şaheserin nasıl yapıldığını anlatan devlogumsu bir video hazırlayacağım kanalıma. Bir iki gün içinde hazırlar, linkini buraya koyarım.</li><li>Buraları okuyan var mı?</li></ul>\n\n\n<p>Yalnızım a dostlar.</p>\n<p>Yazan yöneten buglayan: EdgeTypE</p>\n\n<p>-Post Process Shader Pack v1.2</p>\n\n<br/>\n\n\n<p><strong>-WAS</strong><strong>D,</strong> acaba ne işe yarıyor? EVET DOĞRU BİLDİN!! Yürüme tuşları.<br/><strong>-4</strong><strong>,</strong> Kaset dinleme.<br/><strong>-Q</strong><strong>,</strong> Drone<br/><strong>-Boşluk</strong> tuşu da zıplama işte. Çok şaşırdınız değil mi?<br/><strong>-1,2 ve 3'</strong>te silah modu değişir.<br/><strong>-</strong><strong>R,</strong> Üretim Menüsü<br/><strong>-</strong><strong>E, </strong>Etkileşim</p>", "metacritic": null, "released": "2021-07-12", "tba": false, "updated": "2021-07-16T11:56:12", "background_image": "https://media.rawg.io/media/screenshots/85a/85aec8925156c3deae2d1163cbddb956.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 164, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["EdgeTypE"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}