{"id": 636847, "slug": "definitely-not-touhou", "name": "Definitely Not Touhou", "name_original": "Definitely Not Touhou", "description": "<p>So my college had this Holiday Camp where the hosts teach kids how to develop games in GDevelop 5 over on Zoom over the course of two days. By the end of it, they also gave us homework of making a game, of whatever genre, with at least two stages submitted the within a time limit of no less than a week on this site and award 'e-money' to whoever made the best. However, this little contest is only reserved for kids outside of my college, meaning participants from the college, like me, are not allowed in.  That's said, I still made one because I want to. I already had an idea of what game I want to make and there's nothing that will stop me.  </p>\n<p>As the title suggests, it's a Touhou fangame, except none of the assets are related to it. Because one thing leads to the other, I decided to strictly use the assets given by the hosts that they used for the Holiday Camp and whatever rudimentary sprites I managed to create on Piskel (which include a loosely accurate sprite for Point Item and Green Point Item, hence the 'maybe almost?'), and make the game under the time limit the hosts gave. Problem is, the hosts taught us how to make a platformer, so naturally the sprites and sound effects are all for a platformer, not a shmup (which is bad for the player sprite). The results are well... I got really creative, especially with the sound effects - playing around with extreme pitches to somehow make the given sound effects sound loosely similar to Touhou's, and make use of the only music file given (there is another one, but it's a game over music that I don't want to use.</p>\n<p>All in all, I did my best to faithfully replicate all the mechanics of a Touhou game and I am pretty proud of what I made, even though the bullets are kinda large and the patterns are a bit too easy for a Touhou game. This is also the first game I've ever made and published. Anyway, enjoy.</p>\n<p>---</p>\n<p><strong>How to Play:</strong><br/></p>\n<p>You play it just like any Touhou game, Arrow Keys to move, Z to shoot, X to bomb, LShift to slow down and show hitbox.</p>\n<p>Additionally, because the game is just a two-stage boss rush, there are no P Items, you instead press 1-4 to toggle between the Power (though for some reason button 1 doesn't work when focusing and shooting at the same time). Also, you can press C to go invincible for a few seconds (I decided to keep it while testing the game out).</p>\n<p>To pause the game, press Esc or P (when in fullscreen).</p>\n<p>At the title screen, after Start and Exit (that doesn't do anything in web) pop out, press R to reset High Score.</p>\n<p>---</p>\n<p><strong>Scoring:</strong><br/></p>\n<p>Player bullet: 10</p>\n<p>Green Point Item: 50</p>\n<p>Point Item: 100</p>\n<p>Graze: 1000</p>\n<p>Spell Card Capture: 10000</p>\n<p>---</p>\n<p><strong>Music Credit:</strong></p>\n<p>Forest Walk by Alexander Nakarada | https://www.serpentsoundstudios.com</p>\n<p>Music promoted by https://www.chosic.com/</p>\n<p>Attribution 4.0 International (CC BY 4.0)</p>\n<p>https://creativecommons.org/licenses/by/4.0/</p>\n<p>---</p>\n<p><strong>Sound Credit:</strong></p>\n<p>bow-release : https://freesound.org/people/Samulis/sounds/209399/</p>\n<p>sword-slash : https://freesound.org/people/wesleyextreme_gamer/sounds/574821/</p>\n<p>sword-slash2 : https://freesound.org/people/lmbubec/sounds/118792/</p>\n<p>blood-spill : https://freesound.org/people/squareal/sounds/237387/</p>\n<p>Footstep : https://freesound.org/people/FallujahQc/sounds/403164/</p>\n<p>get-health : https://freesound.org/people/JustInvoke/sounds/138486/</p>\n<p>As stated before, for each sound listed above, I used them for multiple sound effects in different pitches. So I'll just list the names according to the txt file included in the assets given by the host.</p>\n<p>---</p>\n<p><strong>Sprite Credit:</strong></p>\n<p>As for the sprites given by the hosts, I do not know where they got them from, there are no txt files related to them.  If any of you know, tell me in the comments.</p>\n<p>And I believe the hosts told us the assets are free to use, so I'm assuming so.</p>", "metacritic": null, "released": "2021-07-12", "tba": false, "updated": "2021-07-16T12:01:58", "background_image": "https://media.rawg.io/media/screenshots/d55/d553e81293b50b31d8e4394f5fc73f94.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 41, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Azhure Raven"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}