{"id": 637028, "slug": "skillfull-carpenter", "name": "Skillfull Carpenter", "name_original": "Skillfull Carpenter", "description": "<p>Very short and horrible game made for the Indie Tales Game Jam. You play a carpenter who needs to fix one single room that the house owners decided it would be just great to break holes in the walls and put spikes that might lead to the unfortunate demise of the carpenter. Get abilities to be able to get past parts in the level.<br/><br/>Controls:</p><p>Right and Left: A and D</p><p>Acquire Ability or Fix Wall: Press E when near (Indication given on game screen)</p><p>Pause Game/Resume Game: Escape</p>\n<p>Controls for Abilities that you can get:</p><p> Rotating the background: Space (Hold Shift and Press space to rotate the other way)</p><p> Sword: Left click to swing sword</p><p> Grapple: (Sword required for this ability) Hold down Right Click to Aim; Release to grapple</p><p> Rotate Single Objects: (Can only rotate certain objects) Hover over an object that can be rotated and hold C to rotate (Hold shift and C at the same time to rotate the other way)</p>\n<p>I'm very sorry for any bugs that I have not found and fixed in the game. Enjoy. If you can enjoy with this very boring short game. I couldn't export for WebGL in time because the export was taking too long, and (as of writing this its 3:14, 14 minutes after the end of the jam) the export is at 30 minutes and 35 seconds. Well, that's unfortunate. I could only export for Windows.</p>", "metacritic": null, "released": "2021-07-12", "tba": false, "updated": "2021-07-16T13:01:30", "background_image": "https://media.rawg.io/media/screenshots/063/0633722dbb16dde82e953bac32462535.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 11, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["TheUnknown1050"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}