{"id": 637180, "slug": "the-10-trials-of-the-little-blue-man", "name": "The 10 Trials of the Little Blue Man", "name_original": "The 10 Trials of the Little Blue Man", "description": "<p>Move: WASD or arrow keys<br/>Jump: Space<br/>Reset level: R<br/>Collect keys as required by each trial<br/></p><p><strong>NOTE: I forgot to take my last test out of the game before submitting to the jam, which makes you start on the last trial That means it's going to be really hard. I've fixed the bug, but I can't change it until after the game is over.<br/></strong></p><p>My entry for the 2021 Indie Tales Jam. This is the first jam that I've done where I did everything on my own, with no outside assets (art, music, etc.). I feel at home programming, but not so much with art or music production. Thanks to Wishforge Games for a great tutorial on pixel art for grass tiles.<br/></p>\n<p>The theme for the jam was One Room. Thus, the entire game takes place in the same level, whose structure does not change, although gun turrets and keys are added to it to increase the difficulty. It ended up being quite hard (which was partly unintentional, at least to the degree that it is), which, couples with the bad spritework, reminds me a little of IWBTG.</p>\n<p>There's no deep message to the name. Because of the One Room theme, it's technically only 1 level, so I used the word \"trial\" instead. Because I'm better at underwater basket weaving than pixel art, I followed a tutorial for a very basic player character, and I ended up creating the little blue man.<br/></p>", "metacritic": null, "released": "2021-07-12", "tba": false, "updated": "2021-07-16T13:44:20", "background_image": "https://media.rawg.io/media/screenshots/136/1368564007e870e6d60bb727f05bd109.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Nirc"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}