{"id": 637172, "slug": "galaxybrain", "name": "Galaxybrain", "name_original": "Galaxybrain", "description": "<p>The optimal way to play <em>Mastermind</em> is to craft guesses so they eliminate as many of the remaining patterns as possible: on your turn you can go through every possible guess, tabulate the responses that guess would get for every possible target pattern that remains, and pick a guess where the options are spread evenly across several responses and not just clustered into one, so that no matter what response you get it eliminates a large number of other possibilities. With a good starting guess, you can beat the game on average in only 4–5 guesses.</p>\n<p>Well, two can play at that game.</p>\n<p><em>Galaxybrain</em> is an adversarial <em>Mastermind</em> that tries to extend the game as long as possible by not actually picking a pattern at the start, but instead keeping track of all patterns you haven't eliminated through your guesses and giving you whatever answer will eliminate the least number of those possibilities. It can't increase the worst-case performance of a given strategy, but it'll ensure you never get lucky and guess the correct answer early by making you tediously eliminate every other possibility every time.</p>\n<p>Will you actually notice a difference with vanilla <em>Mastermind</em> when you play this? I dunno! This is just a random idea I had that was inspired by jan Misali's video \"hangman is a weird game\" and I wanted to see what would happen.</p>\n<p>I made everything here except the background image, which is a Transparent Textures modification of a Toptal Subtle Patterns texture by Atle Mo. The source code is on Bitbucket, if you dare (I would personally recommend not daring): https://bitbucket.org/CHz16/galaxybrain</p>", "metacritic": null, "released": "2021-07-12", "tba": false, "updated": "2021-07-16T13:42:18", "background_image": "https://media.rawg.io/media/screenshots/e9a/e9a60c4098996c7dd9821a5c367fe178.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 23, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["CHz"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}