{"id": 637170, "slug": "one-room-one-jam", "name": "One Room, One Jam", "name_original": "One Room, One Jam", "description": "<p><strong>PLEASE DO NOT PLAY THIS GAME IN FULLSCREEN -  THE UI WOULD BE MESSED UP A LITTLE (thx)</strong></p>\n\n\n<p><em>The game is about struggles and joys of the game jam. Game jam is usually hard work under a time pressure where you need to balance between proper rest and non-stop work.</em></p>\n<p><em>Here is a oportunity for you \"the player\" to try how it \"can feel\" to participate in a game jam. Hope you will enjoy this little game where many things were cut off and many things does not work as it was originally intended. But the game is playable at least.</em></p>\n<p><strong>INSTRUCTIONS</strong></p>\n<p>In game itself, you can enjoy just 1 minigame of \"coding\" where you need to write all the words you see. You also need to watch your energy and go to the bed if it is low to regain it back. There are 3 more activities, but those are just animation as I did not have time to implement any other minigame. You should end your run with \"Publish\" in order to get to the \"win\" screen.</p>\n<p><strong>As in any game-jam, remember that it is not important to have everything done to 100%, but to participate and finish.</strong></p>\n<p>You can navigate with arrows or A/D. The rest of the controsl should be covered in-game.</p>\n\n\n<p>I have used <strong>Aseprite </strong>for pixel art, <strong>Unity </strong>as a game engine, <strong>FL Studio</strong> for sounds and everything has been created from scratch during the jam within 48hrs.</p>\n<p>Link to my code if anyone would be interested.</p>\n<p>Thank you for Your time, </p>\n<p>Jin</p>", "metacritic": null, "released": "2021-07-12", "tba": false, "updated": "2021-07-16T13:41:51", "background_image": "https://media.rawg.io/media/screenshots/82b/82baf7628d2ece2e3d33f102191f3daa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 33, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Jin9310"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}