{"id": 637249, "slug": "kyeps", "name": "Kye.ps", "name_original": "Kye.ps", "description": "<p><strong>Note:  Although Kye.ps is completely free, the original Kye was Charity Ware. If you like what you see, please donate to any Charity that assists children. </strong><br/></p>\n\n<p>Kye.ps is a puzzlescript port of Kye, a puzzle game from the nighties.</p>\n<p>Kye is notable because it combines elements that folk wisdom would tell you do not belong in puzzles: It is a real-time game, it has monsters that chase you around and levels tend to be large combinations of smaller sub-puzzles connected in some way. At its root it is a block-pushing puzzle, but the blocks have many behaviors and ways to interact with each other.<br/></p>\n<p>My intention was to make as close and accurate of a port as possible, while coding it in puzzlescript. It was initially just meant as a way to challenge myself (those familiar with both puzzlescript and Kye should know that puzzlescript was definitely not inteded as a way to reproduce Kye).</p>\n<p>But with time it started to look like something more. First of all, since it is puzzle script, it runs in HTML5 so it's highly portable. It also has an undo button which makes playing Kye levels so much better. And the sprites scale up pretty well in puzzlescript. Other ports go for the smooth look, but there's something nice about the original, very pixelated sprites. Another thing about puzzlescript is that it is really easy to expand on existing scripts, source code is released under a permissive free  software license.  With some knowledge of the kye level format, you can add levels or even add new objects or modify the sprites in a very open way...<br/></p>\n<p>I want this to be a very good sample of the Kye experience. So that people can understand that it has a very powerful set of play pieces. It's really strange as a puzzle game. So I tried to make a nice selection of levels. I have taken a couple of levels from Colin Garbutt's original default.kye file. But I have also taken many levels from Colin Phipps' Python Kye site  and a couple of levels that I've made and released in the past, either as part of Xye or as \"vexkye.kye\". </p>\n<p>Controls:</p>\n<ul><li> up , down, left , right:  Move Kye around</li><li>X :  make the game go (slightly) faster : This is sometimes necessary in some levels that might require you to wait while something else happens.</li><li>Z or U : Undo</li><li>X while in a door's cell (Doors are vertical or horizontal red things that only allow movement in a particular direction, other objects other than Kye can't enter) . Create checkpoint (pressing R will take you here. To undo a checkpoint, press escape and select the level again in the level selector).</li></ul>\n<p>Although all of the rules and logic are compatible with vanilla puzzlescript, I had to use Auroriax Puzzle Script + fork for things such as case-sensitive characters in the level format and the larger sprites. As a bonus, there is a level selector you can easily access by pressing escape.<br/></p>\n<p>Unfortunately , the level format is not exactly equal to Kye's level format due to puzzlescript limitations. Basically, if you want to add existing Kye levels, you'd have to replace all the spaces in the level with a . (dot) character).</p>\n<p>I've tried to make everything work as closely as possible as in Kye. However, there are some differences:</p>\n<ul><li>Some sprites were modified a bit to improve clarity:</li></ul>\n<ul><ul><li> Clockwise/anti-clockwise turner sprites are flipped so that the symbol actually matches the movement. </li><li>Auto-Sliders have a more square shape, to further distinguish them from Auto-Rockies.</li><li>Added a red line to the Door sprites so that it is much easier to distinguish their direction.</li></ul><li>As much as I tried to reproduce timings and movement direction priorities, it is simply impossible to do a 1:1 copy from Kye behavior in puzzlescript, So definitely don't expect to be able to play Colin Phipps' mystical.kye here.</li><li>Diagonal movement is NOT allowed. I don't think this is a very big deal, but the one level from shareware kye that required diagonal movement is now broken.</li><li> Although  Kye.ps does have 3 extra lives like in the Original Kye, there is no HUD  so you'll have to remember your number of lives.  I picked levels in which re-spawning is not necessary. Undoing a movement is much easier than relying on extra lives anyway...</li><li> A lot of things are more deterministic than original Kye. There used to be a random or hard-to-predict element in some things like timer blocks. </li></ul>\n<p>Special thanks to jcGyo  for help with the movement logic.</p>\n<p>If you want more Kye, take a look to \"My Kye Page\"  , it has some level sets, and info about other ports, including a modern Unity remake, a python version that works quite well in modern Operating systems and a really ridiculous fan sequel that adds way too many new objects and concepts.<br/></p>\n<p>I really hope you enjoy the included levels.</p>", "metacritic": null, "released": "2021-07-12", "tba": false, "updated": "2021-07-16T14:07:16", "background_image": "https://media.rawg.io/media/screenshots/d76/d7620291cebffdbf66f4c4dd5953754e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 86, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["vexorian"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}