{"id": 63737, "slug": "vad-virtually-assured-destruction", "name": "VAD - Virtually Assured Destruction", "name_original": "VAD - Virtually Assured Destruction", "description": "<strong>V.A.D - Virtually Assured Destruction is a single player, sci-fi based multi genre VR game for PC, Oculus Rift. </strong> <br/>You battle your way through a myriad of different challenges from exploring space stations, shooting drones, commanding a space shuttle, to defending against giant enemy bosses, surviving intense trap rooms and figuring out how to control devices to defeat your enemies. Also there is The Game Hub, which is full of puzzles and achievements to unlock, as well as a bunch of mini games, for when you need a relaxing break from the intensity of V.A.D itself.<br/><br/><strong>FEATURES</strong><br/><br/><strong>V.A.D</strong><br/>- Explore, destroy and defend against drones, traps and defense systems.<br/>- Pilot your space shuttle and defeat the giant alien boss and it's hordes.<br/>- Survive the enemies trap laden room while launching mines with your tractor beam.<br/>- Take down the huge robotic defense machine with your gatling laser.<br/>- Defeat the ultimate weapon using laser control consoles and missile launchers.<br/>- Try to survive.<br/>​<br/><strong>THE GAME HUB</strong><br/>- Explore at your own pace and interact with most everything around you.<br/>- Grow Large or Small, and explore the world from a different perspective.<br/>- Play instruments, shoot arrows and even turn The Hub into a giant ball pit.<br/>- Fire the cannon, blow up the room, blow up the moon, everything has consequences.<br/>- Turn your hands into claws or lasers or force waves.<br/>- And many, many more hidden surprises.<br/><br/><strong>THE HUB MINI-GAMES / ROOM TRANSFORMATIONS</strong><br/>- Boxing Ring - Punch the correct bags at the right time.<br/>- Slice Beats - Use your claws to slice the oncoming orbs to the beat of the music.<br/>- Simon Says - Shoot the targets in the correct order and see how far you can go.<br/>- Forever Jogger - Play the arcade machine through 3 separate levels.<br/>- Targets - Practice slicing, shooting and firing arrows at resetting targets.<br/>- Ball Pit - Fill the room with hundreds of giant destructible balls.<br/>- Voxel Fighter - Transport yourself inside a retro arcade machine for a 3D VR take on classic style gaming.<br/>- Punch Bots - Take control of a giant robot and do battle with your opposing Punch Bot.", "metacritic": null, "released": "2018-06-29", "tba": false, "updated": "2019-08-28T21:56:20", "background_image": "https://media.rawg.io/media/screenshots/ec5/ec57bb93edcc6e972fc547392b599c53.jpg", "website": "http://www.litmusvr.com.au/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 529, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Litmus VR"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Litmus VR"], "esrb_rating": null}