{"id": 6373, "slug": "strikefleet-omega", "name": "Strikefleet Omega", "name_original": "Strikefleet Omega", "description": "Download the @FreeAppADay.com Store App and wish for more top rated apps like Strikefleet Omega to be featured on FAAD!<br/><br/>“Strikefleet Omega may very well be the best strategy game available for phones and tablets right now.” - EGM<br/><br/>“It's a must-download for anyone who enjoys games that require fast reflexes and quick thinking, or just wants to have a blast while making sure humanity sticks around for a while.” - Gamezebo<br/><br/>From Harebrained Schemes, creators of Apple's Benchmark Game of 2011, CRIMSON STEAM PIRATES, comes STRIKEFLEET OMEGA! <br/><br/>                           *** Earth’s finest fleet, Humanity’s final hour. ***<br/><br/>Earth has been destroyed by the Hive Queen and her Brood and you command Humanity's last defender, Strikefleet Omega. As Omega's Admiral, you are charged with a desperate mission--find the Queen and stop her before she obliterates our remaining colonies. <br/><br/>Warping from star system to star system in your search, Strikefleet Omega struggles to survive wave after wave of enemy attacks while mining precious crystals that allow you to warp in reinforcements from the last remaining shipyard in the Armada. <br/><br/>Warp in reinforcements such as:<br/><br/>•         Starfighter Carriers launch fighter squadrons you control with a drag of your finger<br/>•         Artillery Gunships fire devastating area-effect salvos with just a tap<br/>•         Advanced Mining ships gather warp crystals faster and more efficiently<br/>•         Bomber Carriers launch bomber groups to assault huge alien capital ships <br/>•         Particle Projection Cannons destroy anything touched by the target line you drag <br/> <br/>And a many, many more—including the devastating Death Blossom, which unleashes the full power of your command ship, destroying entire waves of enemies at once!<br/> <br/>Join the Armada and take your place as the Admiral of Strikefleet Omega!<br/><br/>        Epic space combat awaits!<br/><br/>               Humanity depends on you!", "metacritic": null, "released": "2012-05-11", "tba": false, "updated": "2019-08-02T03:14:40", "background_image": "https://media.rawg.io/media/screenshots/13b/13bc871512dc246531fd2061dae92b05.jpeg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 236, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Six Waves"], "genres": ["Action", "Strategy"], "publishers": ["Six Waves"], "esrb_rating": null}