{"id": 63744, "slug": "marginal-act", "name": "Marginal act", "name_original": "Marginal act", "description": "Marginal act takes place in the middle of a global extinction, taking down half of a huge metropolis. Time inside a small district stopped by the action of the mechanism, hidden inside the theater in the middle of the district. Our character worked as illuminator in the theater. The player will have to solve the game situation, where all citizens are caught in a trap. People can’t leave the district, but they will not be able to live long in stoppeed time.<br/><br/>Features:<br/>• Unique gaming space exploring with theater decoration system.<br/>• Puzzles depend on activation and deactivation of various buildings.<br/>• An original visualization.<br/>• Plot and art-style orientation.<br/>• Several different endings, depends on the segment’s arguments of the game quarter.<br/>• There are six segments for decorations on the theater’s stage. Player can put a several decorations into each one on the segments. <br/>• There are several brands of decoration, which are represents real buildings on the map. The stage itself represents all game space. City building appears in the direction corresponding to the filled segment on the stage.<br/><br/>Marginal act shares the universe with the Line<br/>http://store.steampowered.com/app/738760/the_Line/<br/>and Blind Boris <br/>http://store.steampowered.com/app/789930/Blind_Boris/", "metacritic": null, "released": "2018-03-27", "tba": false, "updated": "2022-08-10T14:39:36", "background_image": "https://media.rawg.io/media/screenshots/8f3/8f37d35b024abca6ea0bb5bdbd9bfa28.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 16, "toplay": 1, "dropped": 1}, "playtime": 1, "achievements_count": 12, "ratings_count": 2, "suggestions_count": 418, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC", "Linux"], "developers": ["Marginal act"], "genres": ["Adventure", "Indie"], "publishers": ["Marginal act"], "esrb_rating": null}