{"id": 637462, "slug": "veronicas-body", "name": "Veronica's Body", "name_original": "Veronica's Body", "description": "Veronica Silvers is your friendly neighborhood vampire hunter. When tracking down the powerful vampire Victoria, she becomes enamored with the idea of dominating the undead woman and melting her icy heart. When Veronica's sleepy little village is invaded by the trickster demon, Hanaja, she gets her golden opportunity to capture the vampire once and for all... if she can resist transforming into the very creatures that attempt to stop her from succeeding.<br/><br/>Veronica's Body is a transformation fetish RPG and  the sequel to Victoria's Body. Play as Veronica and fight through waves of enemies as they try to humiliate and pervert her into kinky versions of themselves. These transformations change her actions in battle and may even grant her special abilities outside of battle. These erotic transformations aren't necessarily a bad thing, however, because they may be necessary to progress through the dungeon or discover sultry secrets!<br/><br/><ul><li>    Mix and match transformations from six different types to progress through the game<br/></li><li>    Manage the build up of transformation energy in battle to gain the advantage<br/></li><li>    Travel throughout the land to several unique areas full of tricks and traps<br/></li><li>    Gaze upon eight fully illustrated and highly erotic CGs<br/></li><li>    18 Achievements for the challenge hungry masochists and completionists<br/></li><li>    A lighthearted story filled with bright and colorful characters</li></ul><br/><br/>Controls:<br/><br/><strong>Arrow Keys or Left Mouse Click</strong> - Move <br/><strong>Enter or Z or Left Mouse Click</strong> - Confirm<br/><strong>Esc or X or Right Mouse Click</strong> - Cancel or Menu (Outside of Battle)<br/><strong>Shift Key (Hold)</strong> - Sprint/Move Fast<br/><strong>Tab Key (Hold)</strong> - Skip Dialogue<br/><br/><br/>Let's promote sex positivity and stay kinky my lovely perverts!", "metacritic": null, "released": "2021-07-16", "tba": false, "updated": "2021-07-19T02:31:28", "background_image": "https://media.rawg.io/media/screenshots/8d6/8d66e1750a4ad8f379fe1400eaac5881.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 271, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Overlord Empire"], "genres": ["RPG"], "publishers": ["Overlord Empire"], "esrb_rating": null}