{"id": 637493, "slug": "evil-teacher-3d-scary-pranks", "name": "Evil Teacher 3D: Scary Pranks", "name_original": "Evil Teacher 3D: Scary Pranks", "description": "Scary Evil Teacher: Scary Games is not just another 3d game about school horrors. This spooky game takes you on an evil ride full of spooky adventures, it showcases the horrors that our scary teachers brought upon us in our childhood. This 3d simulation game is interesting because it has all the elements of school horrors, evil plans of naughty students taking revenge from their creepy teacher.<br/>The background of this new scary teacher game is that a creepy and spooky teacher punishes her students in classroom and brings down different horror and scary punishments on them. Until one student decides to get revenge on this scary teacher and guides her into his traps that are full of scare mods by playing Spooky &amp; Scary Games and makes a spooky pranks on the evil teacher. Student starts haunting on the scary teacher in classroom of the scary school as well as sets horrifying and scary pranks in the scary classroom, auditorium of the school and all the different areas of the scary school. School becomes haunted night mare for the scary teacher because the kids have started playing creepy pranks on her scary teacher. The new 3d game of scary teacher guides you through different levels to provide the kids unlimited entertainment.<br/>At this time when there are a lot of different new scary games being produced every day our gaming studio brings you all together a different experience of scary teacher 3d games. Spooky &amp; Scary Games are a fun way of learning for smart kinds and blow of some steam in their fantasy world and also have some sun with their scary teacher in this spooky neighbor 3d game this is exactly what's happening.<br/>Download scary teacher 3d game if you are someone who enjoys teacher games or scary teacher games especially if you are into 3d games this will be a perfect fit for you.<br/><br/>We are waiting of your feedback about Scary Teacher to make more interesting.", "metacritic": null, "released": "2020-12-10", "tba": false, "updated": "2021-07-19T02:53:26", "background_image": "https://media.rawg.io/media/screenshots/ca3/ca3cfa23f595746b00c8796365cc23d4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 303, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Saad Bin Shafqat"], "genres": ["Adventure", "RPG"], "publishers": ["Saad Bin Shafqat"], "esrb_rating": "Teen"}