{"id": 637440, "slug": "space-ship-infinity", "name": "Space Ship Infinity", "name_original": "Space Ship Infinity", "description": "<strong>- Developer Notes</strong><br/><br/>I have started developing games recently and hope this is fun to play, this is a small re-playable arcade where the only goals are to constantly beat your previous score and unlock some perks and improve skills. I will do my best to ensure support for my games.<br/><br/>Lucas Lima - Made In House Studios<br/><br/><strong>- Gameplay</strong><br/><br/><ul><li>Your ship cannot stop moving, then you must turn left and right and avoid colliding with an increasing amount of enemies.<br/></li><li>Your ship can fire all the time, so don't worry about ammo but make sure you destroy enemy ships often to keep yourself surviving and don't forget about power-ups to help you survive longer.<br/></li><li>Get the highest score possible by collecting coins to buy upgrades for your ship to become faster, more resistant and increase your firepower.</li></ul><br/><strong>- Features</strong><br/><br/><ul><li>A throwback to the classic arcade game room of the 80s. Space Ship Infinity is a retro-style, addictive and fast-paced arcade shoot 'em up!<br/></li><li>Easy to learn, arcade style controls are simple to move and shoot. Keyboard and Mouse Support.<br/></li><li>Initially three power ups are Triple Shot, Double Points, Healer all to help your survival.<br/></li><li>Status upgrades available for your ship speed, health and damage.<br/></li><li>Collect coins to unlock power ups and upgrades to reach your best score.<br/></li><li>Infinite (infinite) survival chasing the best score game with a classic 'bullet hell'-like arcade style.<br/></li><li>Steam Achievements</li></ul>", "metacritic": null, "released": "2021-07-16", "tba": false, "updated": "2021-07-19T02:16:30", "background_image": "https://media.rawg.io/media/screenshots/99e/99e4a35054ccc4dc3bb03d2618c5cba6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 8, "ratings_count": 0, "suggestions_count": 21, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Lucas Lima"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Made In House"], "esrb_rating": null}