{"id": 637489, "slug": "satisfying-lips-asmr-mukbang", "name": "Satisfying Lips! ASMR Mukbang", "name_original": "Satisfying Lips! ASMR Mukbang", "description": "Eating ASMR lips based videos had always been an obsession.  Feed the hungry mouth with jelly fruit &amp; different objects. Beat your stress with this new ASMR lip teeth grinding &amp; crushing simulator based game. Now you can Enjoy playing this new eating asmr lips based game with relaxing &amp; satisfying ASMR sounds with amazing lip based ASMR triggers. This amazing animation will make you play this oddly satisfying crushing asmr game all day long. Enjoy crushing things with the mouth using hard &amp; soft different objects. You can also enjoy jelly fruit challenge using these 3d lips and create your own popping &amp; bursting sound with eye relaxing animation where you ll see the jelly fruit popping &amp; bursting followed by a tempting pop it sound. <br/>Feed the ASMR lips with tons of different objects from different range of sensation including soft, hard, crunchy, popping obejcts of your choice and enjoy this oddly satisfying game. Enjoy crunchy sounds, crushing of objects with teeth in front of your eyes that will produce ASMR tingles in your head. You might have played of lot of crushing games but this teeth crushing game will satisfy your ASMR crushing &amp; popping experience to another level. This is an amazing game for people who are obsessed with grinding objects with teeth, have ADHD,  asmr crushing obsessions or stress disorders. Now you don’t have to grind objects with teeth or watch eating asmr videos, you can rather play this game and grind, crush and destroy your favorite objects.", "metacritic": null, "released": "2021-06-21", "tba": false, "updated": "2021-07-19T02:50:58", "background_image": "https://media.rawg.io/media/screenshots/6b1/6b19c0884eb7b97817d218876fede413_NtBoWAC.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 59, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sarah Shahzad"], "genres": ["RPG", "Simulation"], "publishers": ["Sarah Shahzad"], "esrb_rating": "Everyone 10+"}