{"id": 637478, "slug": "kingdom-the-blood-pledge", "name": "Kingdom: The Blood Pledge", "name_original": "Kingdom: The Blood Pledge", "description": "No.1 Open World PVP!<br/><br/>Kingdom: The Blood Pledge is now live throughout the globe! Kingdom is an MMORPG with the most ruthless open world PVP! Join us in this blood pact and battle with players from 150 countries around the world!<br/><br/>Kingdom: The Blood Pledge is dedicated to true hardcore players and pays absolute homage to classical PC MMO titles. In this truly open world, you can allocate stat points at will, learn over a hundred unique skills, and empower your character using runes and crystals to forge your very own character. Trade freely and rack up the money overnight! Engage in ruthless pursuit and epic sieges anytime, anywhere with players from across the globe.<br/><br/>▶Seamless Open World<br/>Say goodbye to loading screens! Kingdom: The Blood Pledge features a true 360° seamless open world map! Traverse freely across plains, wastelands, deserts, beaches and dozens of other settings with ZERO loading time. Start exploring this majestic world and fight hostile players anytime and anywhere! <br/><br/>▶Immersive PVP Experience<br/>Kill other players to be tagged as a red name, loot their drops, taunt them, and engage in an endless cycle of vengeance until they are stripped out all their gear and beg for your mercy, for the red name is a title to be worn proudly. But be wary of enemies who rally their friends and seek petty revenge. This is a ruthless world where might is everything.<br/><br/>▶Team up against Wild Bosses<br/>Need rare, legendary gear? Take down a wild boss in this free-for-all boss fight where loot is awarded to the quick and deadly! Team up with allies to boost your combat efficiency, but be wary of sneaky players who will do anything to steal your boss kill.<br/><br/>▶Forge Unique Weapons<br/>Unique gear crafting system that lets you craft EVERYTHING! Forge thousands of priceless, awesome gear and pump that power rating beyond all recognition!<br/> <br/>▶Truly Free Trading<br/>The Market is a fair and just place where any weapon, defensive gear, accessory, or consumable can be traded freely! Set your own price and profit off the quick trade function to strike it rich!<br/><br/>▶Blood Pumping Global Siege Battles<br/>The first-ever 300 vs 300 epic Siege War! Join Kingdom players from 150 countries across the globe and join epic battles! Coordinate your attacks with fellow guild members to earn victory! Breach the gates to take over the territory and the loots!<br/><br/>Join the official Facebook page of Kingdom: The Blood Pledge and get the latest news: https://bit.ly/2Szalb3", "metacritic": null, "released": "2021-07-12", "tba": false, "updated": "2021-07-19T02:43:58", "background_image": "https://media.rawg.io/media/screenshots/2b8/2b84b0c135098df1a38799a7bde5529d_yzN73aI.jpg", "website": "https://aekdios.efunen.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 315, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Shanghai Efun Technology Co"], "genres": ["Action", "RPG"], "publishers": ["Shanghai Efun Technology Co"], "esrb_rating": "Teen"}