{"id": 637472, "slug": "winkeltje-the-little-shop", "name": "Winkeltje: The Little Shop", "name_original": "Winkeltje: The Little Shop", "description": "Run your own old-world fantasy shop in Winkeltje: The Little Shop!  Build, decorate, craft, sell, and become the master of your own shop in this timeless management game.\n<br/>\n<br/>\n<br/>\nAs the shopkeeper of your very own shop, you are in charge of buying, selling, keeping stock of your inventory, and making a profit. Items can be bought from traders or delivered at a fee.\n<br/>\n<br/>\n<ul><li>Buy low, sell high, and make sure to satisfy your customers’ demands.\n<br/>\n</li><li>A large variety of items: from bulk goods and resources to vegetables and other food, clothes, tools, and even alchemical elixirs!\n<br/>\n</li><li>Play at your own pace and open your shop when you feel ready for a day of trading.</li></ul>\n<br/>\n<br/>\nBring out your interior designing skills by freely placing furniture and displays.\n<br/>\nDecorate your shop well to attract even more customers.\n<br/>\n<br/>\n<ul><li>Tons of different furniture options, from tables and display shelves to counters and storage pallets and crafting stations.\n<br/>\n</li><li>Expertly place decorations to impress your customers and sell more!\n<br/>\n</li><li>Fine-tuned controls allow you to arrange the furniture with the greatest ease.</li></ul>\n<br/>\n<br/>\nExpand your shop when you have amassed enough wealth. Be your own architect when building your fantasy shop.\n<br/>\n<br/>\n<ul><li>Decide the shop’s floor plan and where to place doors, windows, or archways.\n<br/>\n</li><li>Increase the size of your store and make it more appealing, having all the items on sale.\n<br/>\n</li><li>Combine different wall and floor tiles to your heart’s desire. </li></ul>\n<br/>\n<br/>\nGather resources and decide which items to craft for the best profit margins. \n<br/>\n<br/>\n<ul><li>Craft items at dedicated crafting stations, from tailor’s desk and forges to alchemy tables.  \n<br/>\n</li><li>Gain experience to craft higher quality items (and sell them for more!).</li></ul>\n<br/>\n<br/>\nExpand the store’s food stocks and grow delicious artichokes, cauliflowers, potatoes and other crops from your own vegetable garden.\n<br/>\n<br/>\n<ul><li>Buy seeds, plant them, give them plenty of water (and love). Harvest the crops to sell in your store.\n<br/>\n</li><li>Be careful about your home-grown produce. If they aren’t cared for, they might wither and die.</li></ul>\n<br/>\n<br/>\nBe prepared for customers’ needs to change with each new season. Random events can affect the supply and demand of goods and might give you an extra challenge (or a tidy profit if you play your cards right).", "metacritic": null, "released": null, "tba": false, "updated": "2023-10-26T20:59:25", "background_image": "https://media.rawg.io/media/screenshots/451/45103648fd412d08e8671cc33fc0dade.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 3, "beaten": 1, "toplay": 2, "dropped": 1}, "playtime": 0, "achievements_count": 12, "ratings_count": 1, "suggestions_count": 221, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Sassybot"], "genres": [], "publishers": ["Sassybot"], "esrb_rating": null}