{"id": 637520, "slug": "monstet-vs-zombie-vip", "name": "Monstet VS Zombie VIP", "name_original": "Monstet VS Zombie VIP", "description": "9FACTORY, an independent game developer, finally broke out after a long hiatus and came back with the new title, 'Earth Protectors'!<br/>9FACTORY presents you the amazing defense game, even better than the previous '9 Heroes Defense.'<br/>Super System that you haven't even seen before will be there to help you with your gameplay.<br/>Eliminate the zombies swarming from multiple lines and save the Earth!<br/>Sounds easy? It's easier said than done.<br/>Why don't you try it?<br/><br/>[Featured]<br/> - Multi Line<br/>This is not a typical battle system that takes place in a single line - all the battles waging in 4 lines at the same time will totally blow you away.<br/><br/> - Super System<br/>Launch a normal monster for a certain number of times and it transforms into Super Monster.<br/>Use the powerful super monsters and win your battle.<br/><br/> - Various Objects<br/>Objects placed across the map such as portals, moving walkways and hard gravestones will add the fun to the gameplay.<br/><br/> - Sticker System<br/>Enjoy various stickers to upgrade the stats of your monsters and super monsters.<br/><br/> - Game Mode<br/>Total of 4 exciting game modes<br/>Day time Mode: 100 stages to play<br/>Night time Mode: 100 stages to play<br/>Station Assault in Day time: 90 stages to play<br/>Station Assault in Night time: 90 stages to play<br/>Zombie Rush: Unlimited stages", "metacritic": null, "released": "2016-10-23", "tba": false, "updated": "2021-07-19T03:10:34", "background_image": "https://media.rawg.io/media/screenshots/d52/d5245eae5396080c22b5eefc115438f4_kH0omKi.jpg", "website": "https://www.facebook.com/9factorygame", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 202, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["9 FACTORY"], "genres": ["RPG", "Strategy"], "publishers": ["9FACTORY"], "esrb_rating": "Everyone 10+"}