{"id": 637506, "slug": "mergecrafter-magical-world", "name": "MergeCrafter - Magical World", "name_original": "MergeCrafter - Magical World", "description": "Adventure through the magical world of MergeCrafter!<br/>* Merge items, craft pickaxes<br/>* Chop trees with axes<br/>* Mine ores in dungeons<br/>* Collect magic treasures<br/><br/>Pre-Order this puzzle merge game for free and meet characters as you quest through the mysterious lands of Runaria, where you can merge everything into better and more powerful items for your magical journey! Match 3 to level up an item. Combine 5 for a bonus. Craft gear like an axe, shovel, or even a fishing rod! Enchant your tools with magic! Dig for treasure, collect blocks, and mine ores with a big drill.<br/><br/>MergeCrafter is a unique tycoon game to heal and merge on new lands. Delve into dragon guarded dungeons to solve puzzles and learn new merge magic mechanics!<br/><br/>Manage and merge on your home camp even when you're offline no internet connection is required in this free game! Boost production and merge everything into better and more powerful items full of magic for your journey.<br/><br/>In this simulation magic merge game, the most challenging missions await you! Set foot in the Forest, Cave, Desert, Tundra, and beyond. Find iron, gold, emeralds, and diamonds. Start the quest for axe crafting now and explore the universe!<br/><br/>Tap, Drag, Merge &amp; Build! Conquer Runaria with your own 3D pixel block simulator! Play this incremental merge game now and join the world exploration race!<br/><br/>Features:<br/>* Merge 3 items to reach the next level! <br/>* Merge 5 for a bonus!<br/>* Discover all the Biomes<br/>* Grow Trees from Acorns<br/>* Mine ores for Iron, Gold, and Diamond!<br/>* Enchant epic Axes and Pickaxes<br/>* Play through unique dungeon quests<br/>* Heal all the dark lands to restore and take back your world<br/>* On your quest journey, you can meet charming characters<br/>* Play offline when no internet is available<br/><br/>Have a problem? Want to suggest a cool new feature? We love to hear from our players! Send your feedback to contact@mergecrafter.com<br/> <br/>Be sure to check for updates. We're still working on improving gameplay and adding new features!", "metacritic": null, "released": "2021-06-30", "tba": false, "updated": "2021-07-19T03:00:48", "background_image": "https://media.rawg.io/media/screenshots/9ac/9ac3108c8607ef07fbb8badaef5c234e_fr8lkGH.jpg", "website": "https://mergecrafter.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 322, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Fiveamp"], "genres": ["Adventure", "Puzzle"], "publishers": ["Fiveamp"], "esrb_rating": "Everyone 10+"}