{"id": 637521, "slug": "brain-love-story-brain-puzzle-games", "name": "Brain Love Story - Brain Puzzle Games", "name_original": "Brain Love Story - Brain Puzzle Games", "description": "What's up! Bro. It's me, your crazy brain! Let's talk a little, I have a surprise for you… If you're brave enough, ask yourself three simple questions:<br/><br/>1. Are you tired of following the rules?<br/>Great. Next question, please.<br/>2. Want renewed ideas and rare insights?<br/>And last but not least:<br/>3. Do you know how to start thinking in a different and unique way?<br/>You probably failed just now. But don't worry! I know the exact solution, 'cause you can't imagine how sick I am of stereotypical thinking!<br/><br/>This brain puzzle game  is a magical tool that will help us think differently and solve fun, unpredictable tasks.<br/>Let exercise every part of your brain <br/><br/>Identify the missing element and add it to the drawing in this delightful puzzle game that will get you thinking and make you smile time and time again<br/>Just touch the screen and drag your finger to erase part of the drawing and see what lies behind it<br/>Like a detective’s magnifying glass, your finger is the key to unraveling the hidden behind each character<br/><br/>Brain Love  game’s feature <br/>Investigate hundreds of entertaining levels chock-full of tricky brain teasers<br/>Discover the unexpected twists hiding behind every image<br/>Enjoy the delightful graphics with their unique cartoon style and cute animations<br/>The optional music, sound effects, and vibration settings give you more control over your gameplay experience<br/><br/>Try, try and try again. There’s no penalty for failure in Brain Love. If you can’t find the right answer the first time, keep on thinking and keep on experimenting until you hit on the solution. What are you waiting for? Download the game: choose the best online store for your device (Keep in mind! There are only two possible options). Do it, I'm watching you!", "metacritic": null, "released": null, "tba": false, "updated": "2021-07-19T03:11:53", "background_image": "https://media.rawg.io/media/screenshots/256/2568ee97399815693a645989b92bc2c8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 46, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Zego Global Publishing"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": "Teen"}