{"id": 637587, "slug": "on-the-acquisition-and-distribution-of-happiness", "name": "On The Acquisition and Distribution of Happiness", "name_original": "On The Acquisition and Distribution of Happiness", "description": "On the Acquisition and Distribution of Happiness is a game about exploring, caring and giving. Wander around your home village, looking to find a way to make everyone's day brighter.\r\n\n\n<p>Made over a week for the Games Jobs Live Game Parade Summer 2021 jam by Marlon Stein and Samuel Hollywood-Summers</p>\r\nObjective\r\n<p>Explore the village. Find people to cheer up. Find items, equip them before starting a conversation to offer them to the other villagers. Can you find a way to turn a single coin into an entire village of happy inhabitants?</p>\n\n<p>Some villagers can be cheered up with several items, and there are several ways of getting specific items, but can you find the way to make sure everyone gets what they want?</p>\r\nControls\r\nMain Menu:\r\n<p>Left and right arrow keys to turn pages</p>\n<p>Mouse to adjust settings, start the game or quit</p>\r\nIn-game:\r\n<p>WASD to move</p>\n<p>Up and down arrow keys to change equipped item in the inventory</p>\n<p>'E' key to interact (when you see the speech bubble icon)</p>\n<p>'J' key brings up your journal, where automatic notes are taken, and you can add your own with the mouse and keyboard.</p>\n<p><strong>Journal controls are the same as in the main menu.</strong></p>\r\nCredits\r\n<p>Concept, design, art, code and writing by Marlon Stein</p>\n<p>https://twitter.com/TheFieryChocobo</p>\n<p>Sound design and music by Samuel Hollywood-Summers (all created during the jam)</p>\n<p>https://www.samuelhollywoodsummers.com/</p>\r\nTools\r\n<p>Made in Unity</p>\n<p>Art assets made in Piskel</p>\n<p>Audio assets and music made in Pro Tools and Logic Pro</p>\r\nAsset packs used\r\n<p>Pixel button promtes - Pixel media<br/></p>\n<p>Pixel art top down - Basic Cainos</p>\r\n\r\n\r\nIf you enjoyed the game, please let us know in the comments. Any suggestions for what to improve? Let us know, let us grow.\r\n\r\nThanks for playing.", "metacritic": null, "released": "2021-07-18", "tba": false, "updated": "2021-07-19T03:28:45", "background_image": "https://media.rawg.io/media/screenshots/cf7/cf72374fc499240b862b63a525ec837e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 55, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Samuel Hollywood-Summers", "FieryChocobo"], "genres": [], "publishers": [], "esrb_rating": null}