{"id": 6378, "slug": "dungeon-legends-top-action-mmo-rpg-online-games", "name": "Dungeon Legends - Top Action MMO RPG Online Games", "name_original": "Dungeon Legends - Top Action MMO RPG Online Games", "description": "Help your people! Join the fight against the Skeleton King, and become a hero in the dungeons.<br/><br/>Enjoy a true action RPG experience with Dungeon Legends.<br/><br/>Challenge other players in REAL TIME in the arena and become a legend of the dungeons. Go through the levels in search of incredible TREASURE or for help to overcome the challenges in CO-OPERATIVE MODE. Join a clan and fight for control of the dungeons.<br/><br/>Develop your skills and adapt your character to your style of play. Select your skills and become a WARRIOR, HEALER or DEFENDER before you start a game.<br/><br/>As a Dwarf, there comes a time when you have to leave your town in search of gold and glory. Take on the challenges of the dungeons to earn experience and gain the respect of your people.<br/><br/>DISCOVER AN ENDLESS WORLD OF ADVENTURE<br/>Enter the dungeons and take part in the weekly events. In each unique journey you will get new rewards that will help you improve our skills.<br/><br/>FIGHT IN THE ARENA<br/>Fight against other players in real-time battles where your skills will make the difference. Enter the arena alone or with friends, and prove you are the greatest warrior.<br/><br/>A TRUE ACTION RPG<br/>The controls are designed for touch devices. Guide your character through the passageways and find the right strategy to defeat the hordes of enemies, using a combination of your special abilities to vanquish them.<br/><br/>SHARE YOUR ADVENTURES<br/>Explore the dungeons with your friends in online co-op mode. Team up with them to complete the hardest challenges and obtain powerful items.<br/><br/>MAIN FEATURES:<br/>- Fight real-time battles against other players<br/>- Join a clan and conquer the dungeons<br/>- Fight in PvP matches<br/>- All game modes can be played for free<br/>- Team up with your friends to explore the dungeons in co-op mode<br/>- Chat with other players<br/>- High-resolution graphics<br/>- Sign in to Game Center to play on various devices<br/>- Optimized for iPhone 7 and iPhone 7 Plus", "metacritic": null, "released": "2015-09-02", "tba": false, "updated": "2019-10-22T14:28:51", "background_image": "https://media.rawg.io/media/screenshots/89f/89f5a0c2cf74a197fd5d593f520071ff.jpeg", "website": "http://codigames.com/portfolio/dungeon-legends/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 244, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Digital Things"], "genres": ["Action", "RPG"], "publishers": ["Digital Things Sociedad Limitada"], "esrb_rating": "Teen"}