{"id": 63810, "slug": "off-grid", "name": "Off Grid", "name_original": "Off Grid", "description": "Off Grid is a 3rd person stealth hacking game where data is your most powerful weapon. Off Grid forgoes combat for hacking tools and ingenuity, and is completely moddable.<br/><br/>Gameplay utilises unique mechanics that allow you to manipulate the world and people around you with the data they unwittingly leave behind. It’s a stealth game where the player can truly hack and manipulate objects in the environment.<br/><br/><strong>Players, modders, and hackers will be able to use the game to create new and interesting levels with stories about surveillance, hacking and the internet of things.</strong>Features:<br/><ul><li>Stealth and hacking gameplay based on use of data and environments rather than weapons and combat<br/><br/></li><li>Hack into lifelike simulated networks and data with realistic hacking techniques and tools including SSH, sidejacking, and social engineering of the AI<br/><br/></li><li>Contemporary storyline and missions related to real-world events surrounding data privacy and mass surveillance<br/><br/></li><li>Fully moddable content encouraging players to create new and interesting levels, whether complete fantasy or mimicking hacking in the real world around them<br/><br/></li><li>Outstanding audio and original soundtrack from Jonas Jensen and Lyndon Holland, the BAFTA-winning composer from the game Virginia</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:56:13", "background_image": "https://media.rawg.io/media/screenshots/62e/62e148d75143437312371c1144782409.jpg", "website": "http://offgridthegame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 226, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Semaeopus"], "genres": ["Action", "Adventure", "Strategy", "Simulation", "Indie"], "publishers": ["Semaeopus"], "esrb_rating": null}