{"id": 63817, "slug": "attack-of-the-killer-furries", "name": "ATTACK OF THE KILLER FURRIES", "name_original": "ATTACK OF THE KILLER FURRIES", "description": "We are just two friendly apes who learned how to make games in our free time and now love to bring our often crazy ideas to live in all kinds of games. Please expect our games to be smaller, raw experiences. We always love to chat with you guys and greatly appreciate all of your feedback in order to become better game creators. <br/>Just tell us your questions or ideas on the forums, Twitter or Facebook. If you encounter bugs or any problems, we will do all we can to ensure the best support that a drunken ape could possibly give.<br/><br/><br/><br/><br/>Everyone always thought they are cute... <br/>But this will never again be the case... <br/>The little furries have decided to once and for all show everyone that they are evil dangerous creatures... <br/>They have decided to go to war...<br/><br/>Well, not all of them...<br/>A small village of furries has choosen to stop this war before it gets out of hand...<br/>Therefore, they have hired you as a professional killer to murder the leader of the furries...<br/><br/>It's your time to stop the furries!<br/><br/>ATTACK OF THE KILLER FURRIES is a cute but gore and action packed first person shooter. Live throuht the Story of our hero on the quest to stop the furries. Explore more of the world with every Mission and end this fight with killing the boss. <br/><br/><br/><br/>🔸Unlock new missions on your way to the leader of the furries and strike him down<br/>🔸Play mission of 4 different types:<br/>       🔸The score based furry hunt <br/>       🔸Find the secret exit<br/>       🔸The fluffy boss battle<br/>       🔸The furry survival<br/>🔸Play the game in 3 different difficulties, so anyone can play it their way (even game journalists...)<br/>🔸Find and use different weapons to hunt down hordes of evil furries<br/>🔸Play 4 different levels and a arena<br/>🔸Play the survival mode on the isle royal against endless waves of furries<br/>🔸Juciest blood and guts yu have ever seen, its like their made of gummybears!<br/>🔸Collect fancy shancy gold statues and steal them from the furries<br/>🔸Trading Cards (coming as soon as possible, well when it sells enough...)<br/>🔸 Even more content updates in the future!<br/><br/>So what are you waiting for? Let the bloody furry hunt begin!<br/><br/>DRUNKEN APES OUT", "metacritic": null, "released": "2018-05-18", "tba": false, "updated": "2019-08-28T21:56:13", "background_image": "https://media.rawg.io/media/screenshots/8e5/8e5214e6d0d2b04e95eea90a5b39c5be.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 6}, "playtime": 0, "achievements_count": 66, "ratings_count": 0, "suggestions_count": 250, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["DRUNKEN APES"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["DRUNKEN APES"], "esrb_rating": null}