{"id": 638203, "slug": "abandoned-croxon-mansion-itch", "name": "Abandoned Croxon Mansion (itch)", "name_original": "Abandoned Croxon Mansion (itch)", "description": "<p><strong>Abandoned Croxon Mansion</strong> is a 2D Top-Down Survival Horror game based on the story of the Haunted Mansion, built during the 1960s. <br/></p>\n\n<p>The mansion was built in Kentucky during the 1960s and was owned by a billionaire, Dr. William. Some tragic incidents occurred during the 1960s which marked the beginning of the Paranormal activities in the mansion. Some of the family members of Dr. Williams passed away due to illness and it was said that the mansion was haunted by the spirits of the deceased. During the 1990s, the paranormal activity escalated to the point that it compelled Dr. William and his family members to move out of the mansion and settle in a different state. Since then, the mansion was left abandoned and the various Voodoo rituals were also performed in that property. It is now said to be haunted by the demons.</p>\n<p>Steve, a paranormal enthusiast, decided to investigate the haunted mansion for the proof of the paranormal. You play as Steve and your mission is to investigate the Mansion thoroughly for the Paranormal evidence. Will you be able to escape the Haunted mansion alive?</p>\n\n<p><strong>KEY FEATURES:</strong><br/></p>\n<ul><li>Explore the entire Mansion!</li><li>Experience the Poltergeist activities while exploring the mansion!</li><li>Collect items like keys, axe, match box etc.</li><li>Come face to face with the Demons, shadow figures etc.</li><li>Explore the parallel world!</li><li>Nearly half an hour of Paranormal investigation!</li></ul>", "metacritic": null, "released": "2021-07-17", "tba": false, "updated": "2021-07-19T06:15:13", "background_image": "https://media.rawg.io/media/screenshots/3f3/3f30953cf5b7d18f93e9316fac09f462.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 177, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["AMAXANG GAMES"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}