{"id": 638462, "slug": "grief-of-the-evergreen", "name": "Grief of the Evergreen", "name_original": "Grief of the Evergreen", "description": "<p>\"Grief of the Evergreen\" is an indie project developed by a member of Team Bacon x Pogo. The game revolves around a desecrated plant race trying to revolt against the humans, using their carnivorous gift. The world works in a simple principle: the larger eats the smaller, and by eating smaller organisms, you grow bigger and bigger.</p>\n<p>The game is in its alpha state and there is no stable build yet, however, we still offer 5 different levels with a full jump at the mechanics for players to enjoy.</p>\n\n<p><strong>MECHANICS:</strong></p>\n<p>- You know Feeding Frenzy? The game where you play as a fish and eat smaller fish till you get bigger and eat other ones. Similarly, our game requires you to fill the \"Prey\" meter by eating the highlighted animals while avoiding the bigger predators.</p>\n<p>- You have limited lives, so be careful not to get eaten so much. The running mushrooms will give you extra lives. Your character is slow at first, so use the dash mechanics to move faster.</p>\n<p>- As you eat enemies, you gain score. You can eat them in succession and gain a combo. The score will be extracted into \"leaves\", a currency in the game which you can use to buy upgrades, skins for your character.</p>\n<p>- If you manage to fill the \"Grief\" bar by eating a certain number of enemies, you enter the \"Grief\" state where you become a literal Godlike being that devours anything in your way (it is short-lived though).</p>\n\n<p><strong>CONTROLS:</strong></p>\n<p>- WASD or Arrow keys or Mouse: Move around</p>\n<p>- Space or LMB Hold: Dash</p>\n<p>- Mouse: Interact with GUI and system</p>", "metacritic": null, "released": "2021-07-16", "tba": false, "updated": "2021-07-19T07:26:07", "background_image": "https://media.rawg.io/media/screenshots/d89/d893a3325301b588e7754a923379b7e2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 74, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["Team Bacon x Pogo"], "genres": ["Action"], "publishers": [], "esrb_rating": null}