{"id": 638561, "slug": "gin-rummy-offline-2", "name": "Gin Rummy Offline", "name_original": "Gin Rummy Offline", "description": "<p>Gin Rummy is a two-player popular card game created in 1909. It is played with a standard 52-card deck. This is a nice card game where each player takes turns drawing from either the deck or discard pile, then discard one card from their hand. A player's cards are grouped in two categories in this rummy card game: melds and deadwood. Melds are combinations of three or more cards consisting of a straight (3 cards in a sequence of the same suit) of 3 or 4 of a kind. Any card in a player's hand that is not a part of a meld counted as deadwood. Your Deadwood count is determined by the sum of the face values of your Deadwood (J/Q/K are all 10 points). This is the best gin rummy game that contains card games for free. Anyone can easily find these card games free just by searching gin rummy download.<br/><br/>Each player takes turns picking up and discarding cards until one player \"knocks.\" A player can only knock when their Deadwood count is below 10 (for Regular Gin Rummy). Then both player's cards are revealed for the layoff. Points are awarded to the player with the least deadwood. Bonus points are awarded for having deadwood of 0 (Gin).<br/><br/>The Deal<br/>- In the classic gin rummy game, the dealer alternates between players from hand to hand. The first dealer is picked at random at the start of the game. The dealer deals 10 cards to each player, reveals the 21st card, and moves it to the top of the discard pile.<br/>- The non-dealing player has the first option of taking the first discard. Then, if the player doesn't want the card, he can choose to Pass, giving the dealer a chance to take it.<br/><br/>Game Play<br/>- In this tricky rummy card game, Each turn involves players drawing then discarding a card. The player must first draw a card from either the discard pile or the deck. The player will then either go Gin or discard one of his cards to the discard pile.<br/>- Player takes a turn until one of the players either go Gin or knock<br/><br/>Knocking<br/>- A player can knock once his deadwood count is less than or equal to 10 after the discard. The option to knock must be selected before discarding the card and will only be made available if a knock is possible. A player may also go Gin. A Gin is a hand that contains only melds, no deadwood. A Big Gin is an 11-card Gin that Determines the Deadwood needed to knock. The card is an Ace, and the players must go Gin to end the hand. In Straight mode, all hands are played to either Gin or Big Gin.<br/><br/>Layoffs<br/>- If a player knocks and does not go Gin, The opposing player gets a chance to remove some of their deadwood before scores are counted. Cards that can be added to the knocking player's melds are not counted as deadwood.<br/><br/>Scoring<br/>- The winner of the hand is the player with the lowest deadwood count after Layoffs. That player earns the difference between the two deadwood. Bonuses can also be earned for going Gin and for an Undercut. In Oklahoma, if the upturned card is a Spade, the hands' points and bonuses count as double.<br/>- Aces are worth 1 point, figures (J, Q, K) are worth 10, and other cards are worth their numerical value. In Oklahoma, if the upturned card is a Spade, the hand's points and bonus count as double.<br/><br/>Undercut<br/>- An undercut occurs when the knocking player loses the hand. If the opponent has a lower deadwood count before or after layoffs, that player wins the hand and earns an undercut bonus of 25 points.<br/>- An undercut occurs when the defending player has a deadwood count lower than or equal to the knocking player.<br/><br/>Features:<br/>- Multi-language: Supports Hindi, English, and Gujarati languages.<br/>- Beautiful UI and amazing sound effects to provide you an extraordinary experience.<br/>- Automatic card arranging, which gives your more freedom to think.<br/>- Smart drag and drop.<br/><br/>Disclaimer: Gin Rummy Offline is an offline card game. This game doesn't deal with any kind of gambling or money-related matters. This is just for entertainment purposes only. We don't do not promote any kind of gambling.</p>", "metacritic": null, "released": "2021-07-16", "tba": false, "updated": "2021-07-19T07:53:47", "background_image": "https://media.rawg.io/media/screenshots/a35/a35227055dcfdc38f062b2238aa91bc1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 156, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Free Card Games Offline"], "genres": [], "publishers": [], "esrb_rating": null}