{"id": 638546, "slug": "lost-sword", "name": "Lost Sword", "name_original": "Lost Sword", "description": "<p>This is my capstone project for coursera Game Design and Development.<br/>My project is called Lost Sword.</p>\n<p>My game is a 2D Action platformer.<br/></p>\n<p>The only asset i used from MCU was some audio.<br/></p>\n<p>The sprites you can see in game are from different assets in the Unity Asset Store</p>\n<p>You can check the full credits inside the game.</p>\n<p>All the things i did on my project where:<br/></p>\n<ol><li>Created 3 different types of enemies, as well as their animator state machine and their scripts to control them which include combat, health and animations.</li><li>Created the character and made all the scripts for him (Controller, Health, check collisions, combat, checkpoints, etc..)</li><li>Created different type of pick-ups (health and lives)</li><li>Created the Main Menu, and all it's logic and scripting</li><li>Designed the whole level with different type of biomes.</li><li>Created the checkpoints and it's animations</li><li>Created the pause menu in game, as well as the death and win screens.</li><li>Utilized the Audio asset i got from MCU and Unity Asset Store to had extra depth to the feel of the game (character and enemy sounds, background music, etc...)</li><li>Created the UI</li><li>Created the camera script to follow the player and also move up and down.</li></ol>\n<p>As said this project was made from scratch (with the exception for the Audio and Art assets)</p>\n<p>All the scripting for the game was done by me.</p>\n<p>Created by Gonçalo Lopes\r\n</p>", "metacritic": null, "released": "2021-07-16", "tba": false, "updated": "2021-07-19T07:48:48", "background_image": "https://media.rawg.io/media/screenshots/736/73601aebe5a36779cb9655187ed44b6a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 257, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Web"], "developers": ["cookiesstyle"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}