{"id": 638523, "slug": "maze-hero", "name": "Maze Hero!", "name_original": "Maze Hero!", "description": "<p><strong>Introduction</strong></p>\n<p>Here it is my latest effort made in a few months exclusively in my free time: a \"rogue like/te\" playable directly on the web (for now only from Desktop).<br/>Every time you play, the levels of the dungeon are randomly generated (but controlled), so the \"run\" is always different.<br/>Technically it was written from scratch without the use of frameworks in plain html/css (no canvas) and of course a lot of javascript: it was quite a challenge.<br/>It all started when I became passionate about algorithms to generate random mazes ... then what comes from what and the project got a bit out of hand (but those who know me know that I never start a thing without completing it in some way).<br/>Finally, as usual, the game overflows with quotes or references to the masterpieces of the genre (or related genres).<br/>I hope you enjoy this game as much as I enjoyed making it.</p>\n<p><strong>Instructions</strong></p>\n<p>Use \"<strong>WASD</strong>\" to move (or arrow cursors), press \"<strong>E</strong>\" (or space bar) to interact with some objects (e.g. torches, chests, bonfires...).<br/>During combat, when is your turn, click on the attack bar to land a blow: be sure to click when the indicator is inside the hit area or you'll miss.<br/>Different weapons have different attack bars.<br/>You can click on any enemy to get informations about his power and his stack.<br/>You can click on any item to get various informations about it.<br/>To split in half the quantity of an item, press \"<strong>SHIFT</strong>\" and then drag the item.<br/>Please note that the game saves automatically at the very beginning of every level so if you have to quit please do it at that point and you can resume you game later.</p>\n<p>\n</p>\n<p><strong>Known issues</strong></p>\n<p>No sound or music.<br/>On Firefox scrollbars are ugly.<br/>For sure there are bugs, if you find one please email me, best would be if you explain how to reproduce it.</p>\n<p>\n</p>\n<p><strong>Graphics</strong></p>\n<p>Hero, monsters, interiors and furnitures by Pita.<br/>Items and icons by Pixeltier and Cyangmou.<br/>Fireplace by @nyk_nck.<br/>Game user interface and font by Craftpix.net.<br/>Share icons by Spoopdee.<br/>Some graphics have been edited by me so maybe they probably look a bit odd.</p>", "metacritic": null, "released": "2021-07-16", "tba": false, "updated": "2021-07-19T07:42:24", "background_image": "https://media.rawg.io/media/screenshots/59d/59d0bb68824fbe9cdc625274a7b6e7e4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 22, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["IlTimido"], "genres": ["Action"], "publishers": [], "esrb_rating": null}