{"id": 638696, "slug": "perfect-affection-plan-cassiopeia", "name": "Perfect Affection Plan: Cassiopeia", "name_original": "Perfect Affection Plan: Cassiopeia", "description": "<p>[STORY]<br />\nKaede Uzuki, Everyone loves her... But since she has entered into adulthood and moved away from home, her life has become complex... She has become irritated with everyone... Her cheerful personality has faded... Her eye gaze becomes cold... Her friends start to make a distance with her... Her loneliness is unbearable...<br />\nYou&#39;re a college student who just moved from the next city... every night... You always find her above the bridge staring at the sky emotionless... You&#39;re starting to feel interested in her... At first, she doesn&#39;t have any interest in you... But you&#39;re fighting so hard to get attention from her... -<br />\nTime just flies... You&#39;ve become a lovey-dovey lover... She&#39;s was thirsty for affection... What are you planning to do to fulfill her thirstiness?<br />\n[SUMMARY]<br />\nIn this version, you just need to fulfill her thirstiness for affection. reach a higher level of H-level to unlock some features. there are 2 modes you can play. Normal mode and SD mode.<br />\n[FEATURES]<br />\nBasic translation (English/Japanese).<br />\n150+ total of UNCENSORED H-animated scenes.<br />\nAdult woman trying on her old schoolgirl uniforms in role-playing<br />\nVoiced by Yuu Kawase.<br />\n1280x720 resolution with 60fps.<br />\n[NOTE]<br />\nThis is an instant date version. that means there&#39;s no story in the gameplay itself. it focused on simulation.<br />\nThe story version of this game is under development.<br />\nUpdate:<br />\nNov 2020 ver.1.1<br />\n- Anti-aliasing<br />\n- Extacy* lock<br />\n- Minor graphic enhancement</p>", "metacritic": null, "released": "2021-07-20", "tba": false, "updated": "2021-08-02T14:33:54", "background_image": "https://media.rawg.io/media/games/896/896eb38469f2e931d4c1ad9103a88d44.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 271, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Genesis Arthangel"], "genres": ["Simulation"], "publishers": ["ImagineVR/ImaginePLAY"], "esrb_rating": null}