{"id": 638678, "slug": "kanamono", "name": "Kanamono", "name_original": "Kanamono", "description": "<h3>Overview</h3><br/>\"Kanamono\" is a 2D side-scrolling shooting game.<br/>We aim to clear all 6 stages + challenge mode.<br/>You can make a powerful attack by using the scraps that come out when you destroy the enemy, or you can make a shield that prevents the enemy's attack.<br/>You can get a high score by destroying many enemies and scraps within a certain period of time.<h3>Story</h3><br/>Mankind was invaded by mechanical creatures that emerged from space.<br/>Mankind surrendered to the overwhelming power of mechanical creatures and lived an inconvenient but peaceful life.<br/>However, such peace was about to end.<h3>Keyboard operation method</h3><br/>z: Shot<br/>x: Bomb<br/>Esc: Pause<br/><br/>Shot<br/>Press once to fire a several bullets straight.<br/>Hold down the shot button fire a wide range of bullets.<br/>Hold down, player's move speed slow down.<br/><br/>Bomb<br/>Hold down the bomb button absorb enemy scrap.<br/>With 1 or more scrap absorbed, release the bomb button to fire the bomb.<br/>When absorbing scrap, you can create a shield that protects against enemy bullets only once.<br/><br/>Pause<br/>Display the pause menu.<h3>Combo</h3><br/><br/><br/><br/>When destroy enemies and scraps, \"Combo Count\" start.<br/>Destroy enemies and scraps during Combo Count, combo will be added.<br/>After certain period of time, Combo Count ends and get score based on the number of combo.<br/>The Combo Count stop while absorbing scrap.<br/>The Combo Count does not end while the bomb remains.(Combo Count advances)<h3>Option</h3><br/><ul><li>Full screen ON / OFF can be set. Also change it with Alt + Enter.<br/></li><li>Default resolution is 640x480. Black frame is displayed except for multiples of this.<br/></li><li>If the frame rate is abnormally fast, turn off VSync.</li></ul><h3>Other</h3><br/><ul><li>Difficulty is Normal and Hard.<br/></li><li>You can increase initial life.<br/></li><li>You can take a screenshot with the q key.</li></ul>", "metacritic": null, "released": "2021-07-19", "tba": false, "updated": "2021-07-23T02:39:46", "background_image": "https://media.rawg.io/media/screenshots/984/9845853d6c24db660f697949e742c722.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 311, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Karai"], "genres": ["Action", "Indie"], "publishers": ["Karai"], "esrb_rating": null}