{"id": 638764, "slug": "ru-ti-ren-replacer", "name": "入替人-ReplaceR", "name_original": "入替人-ReplaceR", "description": "<h3>- Genre -</h3>A 2D action game. It might be better to call it Metroidvania.<br/>It's an action game where you switch between multiple special guns that swap things around and aim to step through the stages.<br/><br/><br/><ul><li>Straight Line Shot Move in a straight line and swap the position of the object and the player.<br/></li><li>Parabolic Shot Moves in a parabolic line, strongly affected by gravity, and swaps the position of the object and the player.<br/></li><li>Bounce Shot Bounces off a wall, swapping the position of the object and the player.<br/></li><li>Reposition Shot Allows the player to change the position of an object.<br/></li><li>Swap Positions Shot Allows you to swap the positions of two objects. </li></ul><br/><ul><li>Special Jump Allows you to jump once in the air after swapping places with an object.<br/></li><li>Floating Holding down the jump key while in the air will cause you to fall gently. </li></ul><br/>The basic mechanism is that touching the four colored key triggers will release the closed routes.<br/><br/><br/>The game is designed to traverse dungeons by using the special actions described above.<br/><br/>As a casual game, it is designed to take about an hour per play.<br/><br/>A good way to play might be to aim for first place in the nation in the time attack ranking.<h3>- Story -</h3>What awaits you inside the mysterious structure that towers over a corner of the universe?<br/>The story begins when you touch a glowing body drifting on the surface of the earth.<br/><h3>- Operation -</h3>You can use the mouse wheel QE 12345 to switch weapons.<br/>", "metacritic": null, "released": "2021-07-22", "tba": false, "updated": "2021-07-23T03:53:30", "background_image": "https://media.rawg.io/media/screenshots/0bd/0bd7cad312dad2aa2c1468dc6c38ec6c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1}, "playtime": 0, "achievements_count": 11, "ratings_count": 0, "suggestions_count": 184, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ラルカス"], "genres": ["Action", "Casual", "Indie"], "publishers": ["O.Y.G"], "esrb_rating": null}