{"id": 638800, "slug": "hindsight-2020-wrath-of-the-raakshasa", "name": "Hindsight 20/20 - Wrath of the Raakshasa", "name_original": "Hindsight 20/20 - Wrath of the Raakshasa", "description": "<p>Hindsight 20/20 - Wrath of the Raakshasa is a 3D third-person action RPG where players can fix mistakes from past playthroughs and relive them for vastly different gameplay and story experiences. Discover the power of morality in each journey where choices and actions have meaningful consequences.<br />\nHindsight 20/20 is founded on five pillars:<br />\n1. Choice in Combat:<br />\nDecide the fate of two kingdoms as one-armed warrior Jehan. Will he choose to respect the values of his former home by respecting life in all forms? Or will he choose the path of conflict and violence? Before every battle, make the conscious decision to wield a non-lethal stun rod to pacify enemies or a ruthless sword to put them down for good.<br />\n2. A Malleable World:<br />\nChampaner and its inhabitants switch between several states of disdain or acceptance for Jehan. Each playthrough shows only one version of the world as both the town and its inhabitants experience the effects of Jehan’s choices and actions.<br />\n3. Interesting AI and Bosses:<br />\nAll NPCs react to the world Jehan shapes. Dialogue options and weapon choice are only two factors in how the AI behaves. Hindsight 20/20’s bosses exhibit emotion, making them more relatable. Nuances in their personality come to light as Jehan continues on his journey. The line between good and evil blurs as they react to Jehan.<br />\n4. The Experience Engine:<br />\nThe Experience Engine is a hand-crafted, in-house gameplay engine driven by player choice. This engine is solely responsible for creating the dynamic gameplay and story experiences Jehan witnesses. Every action and choice made is observed and recorded by the Experience Engine leading to a high level of replayability. This feedback loop of choices, actions, and reactions affect the flow of the story and drives the gameplay of Hindsight 20/20.<br />\n5. Ten different endings:<br />\nHindsight 20/20 has 10 different endings and four of those endings have absolutely no overlap. Each ending is carefully tailored to the choices and actions made in that journey. And unlocking each ending grants specific achievements as well.</p>", "metacritic": null, "released": "2021-09-09", "tba": false, "updated": "2022-12-17T08:26:39", "background_image": "https://media.rawg.io/media/screenshots/023/02361dafca2e73151fbb6b50ab5e6017.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4, "dropped": 1}, "playtime": 0, "achievements_count": 18, "ratings_count": 2, "suggestions_count": 435, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox Series S/X", "Nintendo Switch", "Xbox One"], "developers": ["Triple-I Games"], "genres": ["Action", "Adventure", "RPG"], "publishers": ["Triple-I Games"], "esrb_rating": null}