{"id": 638983, "slug": "catchygem", "name": "CatchyGem", "name_original": "CatchyGem", "description": "<p>Playing CatchyGem is a visual treat! All age group people can play this game. It is a very simple game, with attractive and colorful elements.</p>\n<p><strong>Aim - </strong><em>To catch the <strong>CatchyGem and reach \"Immortal Space\".</strong></em></p>\n<p><strong>Description</strong></p>\n<p>There are 3 gems in this game. Each Gem, while collecting will give 10+  points.</p>\n<br/>\n<p>You will be playing as <strong>\"Orangy\" </strong> You will be given this character while playing. There will be updates on coming versions, where you can purchase your own character in the game store.</p>\n<p>There is one enemy <strong>\"Boo\" </strong> If you hit this, you will lose 1 life. You have to play without hitting the \"Boo\". You will be given 5 lives when you start a fresh game. If you lose 5 lives, there is an option available to get into <strong>\"Life Fountain\"</strong> where you can collect more lives for your game and you can continue your game from where you left off.</p>\n\n<p>Hey, there is more! There are <strong>3 power ups.</strong> Each will give you a super power.</p>\n<p><strong>\"Two Way Shield\"</strong> - It will protect you from enemy and also it will destroy the enemy. This power lasts for 5 seconds. Also you can move freely without fear of \"Boo\" and you can collect gems easily.  </p>\n<p><strong>\"Lava Burst\" - </strong>This is a dramatic power. It will burst all the Boo's in the scene in one hit. You can use this power for two times. After collecting the lava power you can see small lava indication at the bottom right of the game window. To do the dramatic hit, click that button or enter \"SPACE\" bar.</p>\n<p><strong>\"Magnet Power\" </strong>- It can attract all CatchyGems nearby. This power lasts for few seconds.</p>\n<p>There is one more enemy, <strong>\"Voo\" </strong> He won't disturb you while playing. But he will destroy everything on its way. It can be a gem or \"Boo\" or even power up. Of-course this is disturbing the player indirectly. So there is a way to defeat this \"Voo\". By using <strong>3 lava power hits</strong> you can vanish this \"Voo\". Number of hits can be easily identified by Voo's energy bar. However he will be back to life by himself within some seconds, so you have to repeat the same to get rid of \"Voo\".</p>\n\n<p><strong>Environment Setup</strong></p>\n<p>Attractive scenes available for each level. All these backgrounds (HD resolution) can be downloaded for free. You can use them as wallpapers.</p>\n\n<p><strong>Download Free Backgrounds</strong></p>\n<p>In future updates, more new scenes are available in game store.<br/></p>\n\n<p>On successful completion of each level, \"Orangy\" will place  winning flag in the respective planets. These winning scene backgrounds will come along with the game purchase.</p>\n<p>On completion of 1st level, Orangy will place winning flag on <strong>\"Rock Planet\".</strong></p>\n<p> </p>\n\n\n<p>On completion of 2nd level, Orangy will place winning flag on <strong>\"Blue Planet\".</strong></p>\n\n<p> </p>\n\n<p>On completion of 3rd level, Orangy will place winning flag on <strong>\"Lava Planet\".</strong></p>\n\n<p> </p>\n\n<p>On completion of 4th level, Orangy will place winning flag on <strong>\"Magnetic Planet\".</strong></p>\n\n<p> </p>\n\n<p>After completing all the levels Orangy enters into <strong>\"Immortal Space\".</strong></p>\n\n\n<p><strong>Make your Orangy to reach \"Immortal Space\", All the very Best! </strong></p>\n<p>I am sure you will enjoy playing this game. If you love this game, please share with your friends and family. Feedbacks are welcome.  Your help and support is needed.</p>\n<p><em>Thank You! </em></p>\n<p><em>- Developer</em></p>\n<p>FYI - This is my very first game, I hope it will make you happy while playing :) I am very excited to see the response and your feedback.</p>", "metacritic": null, "released": "2021-07-21", "tba": false, "updated": "2021-07-23T05:30:44", "background_image": "https://media.rawg.io/media/screenshots/d54/d548447a818f7c814bb2af73dead779c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 84, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["acmgame"], "genres": [], "publishers": [], "esrb_rating": null}