{"id": 639024, "slug": "move-or-fire-space-desire", "name": "Move or Fire: Space Desire", "name_original": "Move or Fire: Space Desire", "description": "<p>Move Or Fire: Space Desire is a fresh take on the iconic Asteroids game</p>\n<p>Alternately control the spaceship and the viewfinder to achieve the best result in several point categories!<br/></p>\n<p>Destroy asteroids and flying saucers. Avoid rockets. But bear in mind - when you are moving, you are not shooting! When you don't shoot - you charge the bomb or the plasma!</p>\n<p>Choose your favorite spaceship and favorite soundtrack from among 3 types of spaceships and 3 amazing soundtracks<br/></p>\n<p>Collect the bonuses appearing on the screen to facilitate the game. Among them: slowing down time, double-sided shooting, bullet rain, additional energy, larger missiles, bombs or plasma that pierces all enemies through!</p>\n<p>The more crystals you collect, the greater the range of the bomb or plasma</p>\n<p>The difficulty level increases over time. The longer you play, the newer challenges await you<br/></p>\n<p>Collect dollars for which you can buy upgrades that increase the strength and endurance of your ship</p>\n<p>The game is free and has no ads appearing during the game. The only advertisement is optional and watching it will reward you with additional dollars for which you will buy 1 of 12 upgrades for your ship (on mobile)<br/></p>\n<p>Have fun and get the best results in Move or Fire: Space Desire!</p>\n<p>Credits</p>", "metacritic": null, "released": "2021-07-22", "tba": false, "updated": "2021-07-23T05:40:41", "background_image": "https://media.rawg.io/media/screenshots/3bf/3bf7cbaef4c7b20eeff3659ab1d6b13f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 101, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["AndrzejKowol"], "genres": ["Action"], "publishers": [], "esrb_rating": null}