{"id": 639039, "slug": "welcome-to-the-pit", "name": "Welcome to the P.I.T", "name_original": "Welcome to the P.I.T", "description": "<p>\"Welcome to the P.I.T\" es un proyecto que nació de mi adicción con juegos de misterio y crímenes. La idea era hacer un juego multijugador que genere casos de manera aleatoria cada partida - ¡Las evidencias que necesitas y sus ubicaciones serán totalmente aleatorias cada vez que juegues! </p>\n<p>Hay 4 tipos de casos:</p>\n<ul><li>Asesinato local, donde al menos un jugador es el asesino de la víctima</li><li>Asesinato de terceros, donde la víctima fue asesinada pero todos los jugadores son inocentes</li><li>Accidente, donde la víctima murió por selección natural</li><li>Suicidio, donde la víctima se fue bajo sus propios términos</li></ul>\n<p>A lo largo de la partida, deberás explorar la casa y buscar en cada mueble y rincón para encontrar evidencias que te ayuden a resolver el caso. ¿Una camiseta con manchas de cloro? ¿Un bate ensangrentado? ¿Evidencias destruidas? ¡¿PERO QUÉ SIGNIFICA?!</p>\n<p>El juego está en desarrollo \"pausado\", el MVP funciona (multijugador, casos procedurales, etc.) y no he tenido tiempo para terminarlo - pero el juego es medianamente divertido cuando le entiendes y bastante interesante con multijugador.</p>\n<p>Por el momento, el juego cuenta con 5 casos y únicamente un modo multijugador - aunque el online es funcional, no tengo los servidores corriendo porque valoro mi economía :^)</p>\n<p>Planeo terminarlo eventualmente, pero por el momento toca lanzar el alpha nomás</p>", "metacritic": null, "released": "2021-07-22", "tba": false, "updated": "2021-07-23T05:44:09", "background_image": "https://media.rawg.io/media/screenshots/595/595093e90eb5b7a47eb658d383b57b76.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 48, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Watanoge"], "genres": [], "publishers": [], "esrb_rating": null}