{"id": 639243, "slug": "origin-staytoasty", "name": "Origin (StayToasty)", "name_original": "Origin (StayToasty)", "description": "Can you start the end?\r\n<p>The first zombie rises... Take control and see how long you can survive! Eat all who roam to increase the hoard and avoid being taken down!\r\n</p>\r\nControls:\r\nMouse:\r\n<p>- <strong>Move</strong> the mouse change the <strong>direction</strong> the zombie is <strong>looking</strong>\n</p>\n<p>- When in <strong>contact</strong> with a meal, repeatedly <strong>right click</strong> until you start to dig in. <strong>Just one click can result in a miss.</strong>\n</p>\r\nMovement:\r\n<p>- Press <strong>W</strong> to <strong>walk</strong> in the direction you are <strong>looking</strong>\n</p>\r\nRetry:\r\n<p>- Press <strong>Space</strong> in the game over screen to <strong>try again</strong>.</p>\r\nQuit:\r\n<p>- Press <strong>ESC </strong>at anypoint in-game to <strong>close</strong> the game\r\n</p>\r\nBored Pixels Jam 8:\r\n<p>This is my entry for the Bored Pixels Jam 8 game jam, and my first entry to any game jam. I'm afraid I might miss the deadline due to work and life getting in the way, so I'm going to submit what I have. There's no sound, but I hope you manage to find some enjoyment. Thanks for playing!\r\n</p>\n<p>- - - - -\r\n</p>\n<p>It's definitely a game I'd like to continue working on.  Mechanics and features I would of liked to add that were planned were:\r\n</p>\n<p>- A GTA wanted-like system where the higher your score, the stronger and more varied the opposition becomes.\r\n</p>\n<p>- Being able to make a few zombies follow you.\r\n</p>\n<p>- A bigger stage or different stages to choose from. \r\n</p>\n<p>I should have made the AI smarter, it's so simple as it stands at the moment. This makes the game pretty simple and repetitive, with the different enemy types this wouldn't be so apparent but i definitely cheaped out there. Also I would have got people to play test it.. I was so focused on making it I completely overlooked getting opinions on it. total oversight.\r\n</p>\n<p>Just some notes on the game. Thanks for reading if you did, hope you enjoy the project!\r\n</p>", "metacritic": null, "released": "2021-07-22", "tba": false, "updated": "2021-07-23T06:42:23", "background_image": "https://media.rawg.io/media/screenshots/2a2/2a21f379600c8a953d452f6099956fd1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 52, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["StayToasty"], "genres": ["Action"], "publishers": [], "esrb_rating": null}