{"id": 639221, "slug": "unreliable-bio", "name": "Unreliable Bio", "name_original": "Unreliable Bio", "description": "<p>Cute guys with sketchy profiles! Unreliable Bio is a arcade dating-sim where you attempt to differentiate between someone real and a catfish.</p>\n<p>The title of the game was given to me by a random name generator. I made it for RND GAME JAM II in the Godot engine (my prompt was Unreliable Bio as you have guessed)<br/></p>\n<p>The game is completely SFW and gets about as spicy as a Simpson's episode</p>\n<p>It's still a work in progress; I plan to add more stuff in the future (like music?). I apologize for any glitches ;___;.<br/></p>\n<p><strong>INSTRUCTIONS:</strong></p>\n<p>This game operates like a dating app. Swipe right to like someone, swipe left to reject them! Swipe up and down to read their profiles. Arrow keys can be used too.<br/></p>\n<p>Your goal is to read their profile carefully, and from their profile, guess if the person is a catfish or not. Then, swipe right on a real person to get points! Woohoo! It's like Papers, Please but dumb<br/></p>\n<p>However, swiping right on a catfish will lose you lives. Lose all 3 lives and it's game over!</p>\n<p>Thankfully, catfishes cannot make perfect profiles; everything they make is just slightly off. Read the profile carefully (but not slowly! You only got 60 seconds to find hot dates!)<br/></p>\n<p>Guessing if they are a catfish is intuitive; don't think about it too hard. If you're having trouble, here's a list of all possible catfish properties:</p>\n<ul><li>Their species doesn't match their profile picture</li><li>Their height is freakishly tall (8 feet and above)</li><li>Their career (below their name) is something wacky, like Time Traveler or Space Doctor</li><li>Their hobbies include something wacky, like Eating Marbles or Drying Paint</li><li>Their \"About Me\" section includes something wacky, like \"Help I'm trapped inside your phone!\"</li></ul>\n<p><strong>Credits:</strong><br/></p>\n<p>Writing: @sebthederg_ad, @doomboy64, @LeoWolperting, @thebarabandit<br/></p>\n<p>Photos Used (All under Unsplash License): Jelmer Assink (@jelmerassink), Pietro De Grandi (@peter_mc_greats), Q.U.I (@quinguyen), Jamie Fenn (@jamie_fenn), Patrick Szylar (@patrick_szylar)<br/></p>\n<p>Sounds used: Sidearm Studios (https://sidearm-studios.itch.io/ultimate-sound-fx-bundle)<br/></p>", "metacritic": null, "released": "2021-07-22", "tba": false, "updated": "2021-07-23T06:37:03", "background_image": "https://media.rawg.io/media/screenshots/8bb/8bb068d0770d744cba46c02612614775.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 29, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["JR"], "genres": [], "publishers": [], "esrb_rating": null}