{"id": 6392, "slug": "endless-nights-rpg", "name": "Endless Nights RPG", "name_original": "Endless Nights RPG", "description": "Endless Nights is a roguelike rpg that lets you play **your** way, with a skills-based system that recognizes the actions of your character in the game and develops those skills.  This means you can choose to use a sword, or a mace, use magic or pray to the gods, and you never need worry about picking a class and no visiting trainers to 'learn' new skills.<br/><br/>You just play the game and the skills you use will increase as you play, and when you've learned enough of a skill, new skill trees and abilities will become available.<br/><br/>Endless Nights is a role-playing game in the rogue-like tradition, which means randomized adventure areas, random dungeons and a different adventure each time you play the game.   The TitanFire RPG system used in the game provides for strategic combat by putting an emphasis on defense and on developing strategies to break through the defenses of your opponent during combat.   <br/><br/><br/>A tweak to the rogue-like style is the Profile system, which allows for a certain amount of permanence with the inclusion of profiles that allow you to carry over some gold or gems to a new character. <br/><br/>Endless Nights Features:<br/><br/>* A rogue-like RPG with random quests, random dungeons and a new adventure each time you play.<br/>* Over 100 different abilities to learn in the skills-based system.<br/>* Strategic turn-based combat.<br/>* Profiles let you choose a different way to play the game.<br/>* Themed monster areas will have you clearing woods of spiders and taking out a group of kobolds.<br/>* A crafting system that includes magical manastones that can be found or rewarded by quests.<br/><br/>Endless Nights is similar to RPG classics like Rogue, Moria, Omega, Angband and Diablo with a level of challenge similar to Demon's Souls and Dark Souls.<br/><br/>A sequel to Endless Depths, the game takes the fun out of the dungeon and into overland areas, providing random quests to go along with the goodness.   <br/><br/>Note: The public domain tilesets used in Endless Nights come from the RLTiles collection.  Some of the sounds used come from www.freesfx.co.uk, including sounds by qudobup, and the font used for the Endless Nights logo was created by fontmesa at fontspace.com.", "metacritic": null, "released": "2013-12-30", "tba": false, "updated": "2019-07-30T05:59:33", "background_image": "https://media.rawg.io/media/screenshots/c56/c568b88c19fa92701268413583c665c3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 119, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Daniel Nations"], "genres": ["Adventure", "RPG"], "publishers": ["Daniel Nations"], "esrb_rating": null}