{"id": 63923, "slug": "doctor-flow", "name": "Doctor Flow", "name_original": "Doctor Flow", "description": "Doctor Flow is a puzzle game of deduction and decision making. You assume the role of a doctor who decides which tests are performed on patients and in what order. Through its stylized interaction you are not only responsible for cost effective medical diagnoses, but also affect patient satisfaction and the quality of health care. Multiple solutions are possible, but only one is the most cost effective. Choose wisely!<br/>\n<br/>\r\n•\tPlay 40 challenging scenarios for hours of puzzle fun<br/>\r\n•\tComplete all 20 Steam achievements<br/>\r\n•\tGet the highest score and compete against other players in the online leaderboards <br/>\r\n•\tDeveloped in collaboration with medical specialists, educational experts and doctors in training<br/>\r\n•\tChoose from 3 themes: doctor, koi or alien<br/>\r\n•\tFeel like a doctor (well, sort of…)<br/>\n<br/>\r\nDoctor Flow started out as a game for actual doctors to train their decision making. The process of taking tests and taking them in the right order makes for deep gameplay, and the immediate response was so positive that we made an extended version, with extra levels, music, visual themes, updated control scheme and polish throughout the game.<br/>\n<br/>\r\nDoctor Flow was designed as part of a project to raise awareness of the cost associated with healthcare. For doctors in training the focus on the importance of conscious decision making is paramount. Not only for the costs, but also the patient's satisfaction. After research, the process of performing tests on patients and linking symptoms to diseases, stood out as the subject to base a game on. Being smart and conscious about choosing tests lowers costs and leads to higher patient satisfaction. Additionally, choosing the right strategy also gives an immediate sense of accomplishment. That's how Doctor Flow became a game about deduction, decisions and efficiency, one that clicked very well with its target audience, and one we like to offer players the world over.", "metacritic": null, "released": "2018-06-27", "tba": false, "updated": "2019-08-28T21:56:05", "background_image": "https://media.rawg.io/media/screenshots/e5b/e5b0129970d675d57f65b4c19e97eb8d.jpg", "website": "https://www.grendel-games.com/doctor-flow/?lang=en", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 95, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Grendel Games"], "genres": ["Simulation", "Casual"], "publishers": ["Grendel Games"], "esrb_rating": null}