{"id": 639356, "slug": "politic-control", "name": "Politic Control", "name_original": "Politic Control", "description": "<p>My old game from 2019</p>\n<p>There may be bugs in the HTML5 version, I recommend downloading the game</p>\n<p>This is a game where you act as a god. You control the whole world and all countries in the literal sense. Simulate different events and just watch how the states will survive in your world! You can create your own world or take a ready-made (real world). The scripts are still in development. You can add new states to your world or delete, change their treasury, relationships, cities and much more!</p>\n<p>An economically and militarily strong state usually wins. Weak states prefer to be friends and bargain with other states, but if their affairs are very bad and they have a lot of troops, then they can attack another state in order to seize resources. Therefore, the one who has the most resources develops faster and wins. The game has a tutorial where everything is written in detail about everything.</p>\n\n<p>Моя старая игра, созданная в 2019 году</p>\n<p>В HTML5 версии возможны баги, рекомендую скачать игру</p>\n<p>Это игра, где вы выступаете в роли бога. Вам подвластен весь мир и все страны в прямом смысле. Симулируйте разные события и просто наблюдайте, как государства будут выживать в вашем мире! Вы можете создавать свой мир или взять готовый (реальный мир). Сценарии еще в разработке. Вы можете добавлять новые государства в ваш мир или удалять, изменять их казну, отношения, города и многое другое!</p>\n<p>Экономически и военно сильное государство обычно побеждает. Слабые государства предпочитают дружить и торговаться с другими государствами, но если их дела совсем плохи и у них есть много войск, то они могут напасть на другое государство с целью захвата ресурсов. Поэтому тот, у кого больше всех ресурсов, быстрее развивается и побеждает. В игре есть туториал, где все обо всем подробно написано.</p>", "metacritic": null, "released": "2021-07-21", "tba": false, "updated": "2021-07-23T07:17:40", "background_image": "https://media.rawg.io/media/screenshots/4d0/4d0fe8b13e772ac524255efc63590889.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 166, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["Ilya873"], "genres": ["Strategy", "Simulation"], "publishers": [], "esrb_rating": null}