{"id": 63944, "slug": "explodey-sci-fi-side-scroller-w-splosions", "name": "Explodey - Sci-fi Side Scroller w/ 'splosions", "name_original": "Explodey - Sci-fi Side Scroller w/ 'splosions", "description": "The galaxy is in peril. Equipped with the latest military tech, pilot your heavily armed space fighter through 5 exotic planets to destroy the evil Dr Grag and save the Life Spark. Joining you on your journey is The Engineer, a silicon being capable of building anything you need. Unfortunately, he's a jackass...<br/>\n<br/>\r\nENGAGE THE ENEMY AND BLOW THEM TO BITS<br/>\n<br/>\r\n* Battle across 5 exotic planets<br/>\r\n* Conquer a large variety of ground and air units<br/>\r\n* Attack while maneuvering with a dual joystick configuration <br/>\r\n* Solve challenging puzzles<br/>\n<br/>\r\nCUSTOMIZE YOUR FIGHTER WITH EXPLOSIVE WEAPONRY<br/>\n<br/>\r\n* 5 Ship Bodies - Each improving in destructive power as you progress<br/>\r\n* 5 Blasters - Normal, Spread, Heal, Cannon, and Sniper<br/>\r\n* 4 Rockets - Normal, Rapid Fire, Fire Ball, BIG ONE<br/>\r\n* 4 Bombs - Normal, Mini, Napalm, Fast Drop<br/>\r\n* 2 Special Weapons - Floating Mine, Shield<br/>\n<br/>\r\nBATTLE 5 CHALLENGING BOSSES<br/>\n<br/>\r\n* Battle The Ice Elemental, Mega Tank, Xenogiger, Zargbots, and Dr Grag - the evil mastermind who is holding the galaxy hostage<br/>\r\n* Recover each of 5 powerful crystals to re-ignite the Life Spark and save the galaxy<br/>\r\n* Follow along with a riveting story and cast of characters, including you (The Soldier), The Engineer, Dr Grag, and General Goat (The Leader of Resistance, Leader of The Knights of Galadorn, Defender of the Universe, and our pet).<br/>\n<br/>\r\nDESTROY YOUR FRIENDS IN MULTIPLAYER<br/>\n<br/>\r\n* Engage in LAN battles with friends. Show them who's boss by exploding them.<br/>\n<br/>\r\nINCREASE YOUR SOCIAL STATUS WITH HATS<br/>\n<br/>\r\n* Yeah, they don't do anything special except make you look awesome<br/>\r\n* Complete all levels and earn The General's Hat, complete with Cigar<br/>\r\n* Complete all achievements and earn The Mighty Beanie of Galderon.<br/>\n<br/>\r\nMAKE TRIPS TO THE TOILET LAST 4x LONGER<br/>\n<br/>\r\n* Forget sending email and browsing Instagram on the toilet - what a waste of time. Play Explodey for hours and hours and when your boss asks what's been going on, you can say EXPLODEY JERK.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:56:04", "background_image": "https://media.rawg.io/media/screenshots/769/7698ef7b8e41119bb40b99172a95a172.jpg", "website": "http://explodey.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 254, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["YitYat Studios"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["YitYat Studios"], "esrb_rating": null}