{"id": 639409, "slug": "museum-monsters", "name": "Museum Monsters", "name_original": "Museum Monsters", "description": "<p>Monsters are everywhere! But even more so are BODY PARTS! </p>\n<p>In Museum Monsters, you have the chance to collect body parts from actual paintings found in museums and create your own monstrosities. Want to combine your favorite creatures from a famous Bosch painting? Or remix the Mona Lisa with Munch's Scream? Now you can*!</p>\n<p>After you build your monster from parts and name your creation, you may publish it to the Monsterverse**, where it will meet other Monsters and can receive ratings. </p>\n<p>In the Monsterverse you can also find out how others made their monsters, by looking up the source paintings where the body parts come from***.</p>\n<p>Explore other people's creations and rate them, or just show your friends and have fun remixing and learning about famous art!</p>\n\n<p>Note: You should be able to play on Chrome browsers, tested on Win10, Android, iOS platforms. It just takes a while to load :)</p>\n\n<p>Credits</p>\n<p>Code &amp; design</p>\n<p>Horațiu Roman</p>\n<p>@horatiu665</p>\n<p>Music design</p>\n<p>Gabriel Gallardo Alarcon</p>\n<p>@gab_gallard</p>\n<p>2D art &amp; cutouts</p>\n<p>Emmanuel Ayala</p>\n<p>@emm_ayala</p>\n<p>Thanks to</p>\n<p>Milan Grajetzki</p>\n<p>@atomtwist</p>\n<p>for support</p><p>and thanks to </p><p>Mark Wahnish from Layers</p><p>for the help with the sound system</p>\n<p>Also thanks to</p>\n<p>Julian</p>\n\n\n<p>* Now you can, but the materials used in the game so far come from a selection of museums in Germany, which facilitated the jam where this game was made. Coming soon to a museum near you!</p>\n<p>** The Monsterverse is not online yet, so for now we ask you to share your creations privately with your friends, or maybe on Twitter with the hashtag #monsters2021 - it is as close as we get for now.</p>\n<p>*** The concept of showing the source of the materials used is still important to us, but we didn't get around to implementing it. We have all the sources of the original pieces, and we plan to show for every monster which parts were used, so people can remix them and learn about art in the process.</p>\n\n\n<p>This prototype was made for<strong> the A MAZE. Museum Online Game Jam 'A World in Motion' organized by the Leibniz Research Museums and the A MAZE. / Berlin 2021 - 10th International Games and Playful Media Festival.</strong></p>\n<p>We have used assets primarily from:</p>\n<ul><li>Germanisches Nationalmuseum – Leibniz Research Museum of Cultural History, Nuremberg\r\n</li></ul>\n<p>And we thank the other museums participating:</p>\n<ul><li>Deutsches Bergbau-Museum Bochum – Leibniz Research Museum for Geo-resources \r\n</li><li>Deutsches Museum, Munich</li></ul>\n<ul><li>German Maritime Museum – Leibniz Institute for Maritime History, Bremerhaven\r\n</li><li>Museum Koenig – Leibniz Institute for the Analysis of Biodiversity Change, Bonn\r\n</li></ul>\n<ul><li>Römisch-Germanisches Zentralmuseum – Leibniz Research Institute for Archaeology, Mainz\r\n</li></ul>\n<ul><li>Senckenberg Society for Nature Research – Leibniz Institution for Biodiversity and Earth System Research\r\n</li></ul>", "metacritic": null, "released": "2021-07-21", "tba": false, "updated": "2021-07-23T07:30:49", "background_image": "https://media.rawg.io/media/screenshots/c66/c668cd9d2063ac8ada49b8026e381af7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 124, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["horatiuromantic"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}