{"id": 639540, "slug": "telekinetic-dodgeball", "name": "Telekinetic Dodgeball", "name_original": "Telekinetic Dodgeball", "description": "<p>It's dodgeball with telekinesis!</p>\r\nTelekinetic\r\n<p>Using the power of your mind, cast and redirect orbs at your opponents to eliminate them. Your telekinetic powers are influenced by your movement—if you're moving to the right when you cast an orb, it'll gain a rightward trajectory. Your teammates can also be influenced by your telekinesis; if you see them about to get hit, push them out of the way!</p>\r\nDodgeball\r\n<p>In this dodgeball-like twist, teammates are crucial. Work together to cast and redirect orbs in all sorts of directions to throw off or catch your opponents off guard. Protect each other, because losing any of your teammates will result in loss of the round. Don't worry about hitting your teammates; they will be pushed by the orbs instead, but do be careful not to trap them against a wall! </p>\r\nHow The Game Works\r\n<p>Telekinetic Dodgeball requires at least one player on each team, and currently supports up to three players on each team. A match lasts 3 minutes and a round ends when a team eliminates any player on the opposing team. A player is eliminated if they are hit by an orb of the opposing team. The team that does not have an eliminated player is awarded a point. After 3 minutes, whichever team has the most points wins, or another round will be played to determine the final victor in case of a tie.</p>\r\nControls\r\n<p>WASD - Move</p>\n<p>Space - Jump; Hit again to double jump; Hit when against a wall to wall jump.</p>\n<p>E - Cast an orb</p>\n<p>Shift (Hold) - Fast fall</p>\n<p>Left Ctrl (Hold) - Slide</p>\n<p>Left Mouse Button - Push (away from yourself)</p>\n<p>Right Mouse Button - Pull (towards yourself)</p>\n<p>Escape - Toggle escape menu (leads to lobby or setting sensitivity)</p>\n<p>You may want to play around with the controls in the single player mode before playing with your friends.</p>\r\nSetup\r\n<p>Currently, online multiplayer is only supported through Steam and lobbies. One of your friends should host a game with the desired host options on the multiplayer screen and everyone else should join that game. Friends may have to hit the refresh button on the multiplayer screen to see the lobby after it is created. Double click a lobby to join it.</p>", "metacritic": null, "released": "2021-07-20", "tba": false, "updated": "2021-07-23T08:09:25", "background_image": "https://media.rawg.io/media/screenshots/6f5/6f5484912561591ace58ce763b94e518.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 102, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["JJamesWWang"], "genres": ["Shooter", "Sports"], "publishers": [], "esrb_rating": null}