{"id": 639664, "slug": "fluff-house", "name": "Fluff House", "name_original": "Fluff House", "description": "A short horror game submission for the  \"<strong>RPG Maker MZ Touch the Stars Game Jam</strong>\" hosted by <strong>Komodo</strong>.\r\n<p>Fluff House is a survival-horror RPG game made using RPGMAKER MZ. Inspired by other legendary horror RPGMAKER games such as The Witch's House, The Crooked Man, etc. Development started on 29/06/2021<br/></p>\n<p>Gen, the protagonist of this game has invited his two friends on a camping trip for summer break, Tina and Rachet. They decided to make their destination within a forest, however, during a stormy night, they had to look for shelter. They found an abandoned house and decided to enter for shelter, unfortunately, their night was just beginning to start...<br/></p>\n<p>This game is actively being updated and future chapters are being developed. Once the game reaches about 3 hours of playtime (around 10 chapters), Character Busts, Title Screen and picture artworks will be redrawn. Eventually, replacing default assets as well. Please be patient as this project is being worked on by only one person, any feedback or criticism are welcome.<br/></p>\n<p>Currently, playtime is about 40 minutes for 2 chapters if players fully explore the game and read the dialogue. (20/07/2021)</p>\n<p><strong>Game features:</strong><br/></p>\n<ul><li> Lighting system, using lanterns and flashlights to explore areas and avoid danger.</li><li>3 Playable characters (only 1 is available for now)</li><li>Lurking enemies and sudden death.</li><li>Fight back enemies using certain light gadgets.</li><li>An immense horror atmosphere with music and sound effects.</li><li>Headphones and playing in the dark are strongly recommended.</li><li>Collectables to sell to merchants to buy and upgrade light gadgets.</li></ul>\n<p><strong>Planned updates:</strong></p>\n<ul><li>Multiple choices may affect the ending.</li><li>More death scenes.</li><li>More explorable areas.</li><li>Difficult puzzles for high reward.</li><li>Combat with Horror Bosses.</li></ul>\n<p>Credits can be found within the game folder and end of game.<br/></p>\n<p><strong>Latest Upload: </strong>21/07/2021 (AEST)<br/></p>", "metacritic": null, "released": "2021-07-20", "tba": false, "updated": "2021-07-23T08:40:30", "background_image": "https://media.rawg.io/media/screenshots/9f5/9f5bdcf1e902d41de4a579fce92f500c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 98, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["GenRex"], "genres": ["Adventure", "RPG", "Puzzle"], "publishers": [], "esrb_rating": null}