{"id": 63966, "slug": "heroes-trials", "name": "HEROES TRIALS", "name_original": "HEROES TRIALS", "description": "Welcome to Heroes Trials! This is a dynamic and fast-paced adventure game with a trial system that takes you through more than 10 different tests that will prepare you for the final challenge. Clear them and rise to the position of defender of your homeland... Or stay forever as a trainee!<br/>\n<br/>\r\nExplore your island freely but be sure to clear the trials on time. Want to be a speedrunner and beat the game faster than anybody else? Heroes Trials helps you keep track of your times. Are you a treasure hunter? You can find hidden items all over the island. Do you care about trophies above anything else? You can get them without breaking a sweat.<br/>\n<br/>\r\nControl two heroes with two different attack modes and combine their abilities to solve puzzles and defeat bosses. Do you want to play the game as a top-down shooter from beginning to end? It's totally up to you!<br/>\n<br/>\r\nThe story of the game is told through a simple narrative that helps you understand your goals. A helpful navigation system and a fascinating soundtrack will also invite you to spend more time with the game just to listen to the tracks maestro Benedikt Grosser prepares for you.<br/>\n<br/>\r\nHeroes Trials brings the best elements of traditional RPGs and delivers a compact and intense experience that takes less than 4 hours to complete, but provides you with a satisfaction that can normally only be obtained with a longer game in the genre. Heroes Trials achieves that by excluding all repetitive quests, fillers, empty events and grinding.<br/>\n<br/>\n<br/>\r\nEnjoy your journey to the top of the heroes of Délhua!", "metacritic": null, "released": "2018-06-20", "tba": false, "updated": "2023-01-24T05:17:50", "background_image": "https://media.rawg.io/media/screenshots/aaf/aaff0c342529b310d0d57ec611771875.jpg", "website": "http://heroestrials.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 35, "beaten": 2, "toplay": 1}, "playtime": 0, "achievements_count": 142, "ratings_count": 4, "suggestions_count": 366, "game_series_count": 0, "reviews_count": 4, "platforms": ["Nintendo Switch", "PS Vita", "Xbox One", "PC", "macOS"], "developers": ["Ratalaika Games", "Shinyuden"], "genres": ["Action", "Adventure", "RPG"], "publishers": ["Ratalaika Games", "Shinyuden"], "esrb_rating": null}