{"id": 639607, "slug": "pocket-adventure", "name": "Pocket Adventure", "name_original": "Pocket Adventure", "description": "Everyone has\r\na story to tell.\r\n<p><strong>Pocket Adventure is a lightweight role-playing game system capable of supporting any theme or genre. Its core rules can fit on the back of a playing card.</strong></p>\n<p>I created Pocket Adventure so my girlfriend (who was new to RPGs at the time) and I could play games together while on car trips and vacations. The system is so light, you barely even need a pen and paper. The Game Master never has to roll dice, as the outcome of scenarios are controlled by the fate of the player, their decisions, and how complicated situations become as the story continues.  </p>\r\nSo Why Pocket Adventure?\r\n<p>Storytelling can be an art, but it doesn’t have to be a lonely art. Pocket Adventure aims to create a fun and quick way to come up with a new worlds and interesting scenarios. The point of the game isn’t to “win” or complete something necessarily (though it can be), but instead, to be part of a journey. Sometimes you and your friends don’t have the time for a long game, or maybe you’ve just met some people and would like a creative way to break the ice. Either way, Pocket Adventure serves as a tool that can help push conversation, jog the creative part of the brain, or help generate new ideas through using its tools found on a simple, single sheet of paper.<br/></p>\r\nHow is this different?\r\n<p>While this is a special version of my game Pocket Adventure—I actually have a full version that I always dreamed one day could be a real game. Unfortunately, anyone I've ever pitched the game to has more or less shown zero interest, as there is such a huge deluge of RPGs anymore, especially in the world of D&amp;D clones, PbtA hacks and micro RPGs. My game <em>does</em> try to do something different though... I've built my robust \"randomizers\"—a series of simple A/B charts that allow players the ability to simple roll dice to completely come up with things on the fly. Now... I <em>know</em> this isn't a <em>new</em> idea—but I went a little bonkers, and built Pocket Adventure with <em>everyone</em> in mind, from kids to grandma, so my randomizers have everything from settings, to plots, to character builders, to... well... you name it! In this one-page challenge, I had to limit it—but you'll see how much STUFF is STUFFED in there. Maybe I'm overzealous. Either way, I hope you enjoy...</p>\r\nPocket Adventure.", "metacritic": null, "released": "2021-07-20", "tba": false, "updated": "2021-07-23T08:26:41", "background_image": "https://media.rawg.io/media/screenshots/1cd/1cd32dcb9e048b14912ea0d4792f8fe2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 44, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mekkakat"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}