{"id": 63961, "slug": "blunt-force", "name": "Blunt Force", "name_original": "Blunt Force", "description": "You are looking at action game mixing in an alluring way past with future. A breathtaking story inspired by World War 2 and achievements of Virtual Reality combined to deliver hours of immersive entertainment.<br/>\n<br/>\r\nBlunt Force is a thrilling VR WW2 game that follows two parallel storylines before and during the war. First one reveals spy’s secrets. Main hero – Jean De Meyer – is working for His Majesty intelligence service. His role is to infiltrate and find the mole inside the local structures. The task is not easy, every conversation with “friends” could be the last one. He will be forced to solve the riddles, play in mind games, connect all the dots and find who is worthy of our trust. Second storylines explore the same locations but touched by the finger of war. As a soldier, fighting in World War 2 Jean encounters Nazi platoons. This combat trial stretches his body and mind. The brutality of enemies and death awaiting on every corner ruins a psyche. But our goal has the highest possibility. But on the other hand, it’s also a chance – he can solve old mysteries and find the truth.<br/>\n<br/>\r\nThe game has two modes - arcade and challenge. That applies to both layers of gameplay, peaceful levels where Jean solves the puzzles and war, where the main character is using a huge arsenal of weapons. Arcade mode in the first layer offers many tips. The game itself is helping to move plot further. However, if you are feeling confident, pick the challenge and face the enigmas without any aid. Shooting experience is one of the most enjoyable parts of the Blunt Force. Arcade path gives plenty of simplifications - your role is to control enemies at the battle arena and focus on aiming. Challange is a real game changer. The weapon needs to be held appropriately, even operation of reloading is a true test of our skills. Enthusiast of authentic mechanics will love that.<br/>\n<br/>\r\nBlunt Force is developed by Monad Rock. Formed in February 2018, a polish game-dev studio, created by 20 passionate professionals. The group has significant experience in the gaming industry and now decided to probe still unexplored areas of Virtual Reality. It is the second project of Monad Rock. First released application is Summer Funland - VR amusement park, which you can check on Steam.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:56:03", "background_image": "https://media.rawg.io/media/screenshots/0d5/0d58b874b95dbb8dfd496c9a5cad8000.jpg", "website": "http://monadrock.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 392, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Monad Rock"], "genres": ["Action", "Adventure"], "publishers": ["Moand Rock"], "esrb_rating": null}