{"id": 6397, "slug": "almightree-the-last-dreamer", "name": "Almightree: The Last Dreamer", "name_original": "Almightree: The Last Dreamer", "description": "<p>Everyone you knew, all you have loved are gone and the world is literally shattering at your feet. A thrilling and challenging 3D puzzle platformer, Almightree: The Last Dreamer has you racing through a crumbling world to find your way to awaken the majestic Almightree to restore life and order.<br />\nTake on the role of the last dreamer, imbued with the ability to commune with nature on a magical level, for it is up to you to quickly traverse what is left of your world in search of the mystical Almightree and its seedlings. Restore them to health and restore order, or the very world in which you live will cease to exist. Alas, hope is not lost. You have the power as a dreamer to make things right.<br />\nThrilling 3D puzzle platformer experience<br />\nConquer 100+ puzzles across 20 stages<br />\nOver 6 unique puzzle features to overcome such as Steel Blocks, Dandelishock plants and more<br />\nAdjustable Difficulty provides a personal gaming experience for gamers of all skill levels<br />\nUnlock 10+ mysterious illustrations about the hero<br />\nLocal Speedrace game mode (2 player split-screen on the same computer)<br />\nOnline Speedrace game mode (cross-platform between Windows and Mac)<br />\nLocalized in 11 languages (English, German, Dutch, French, Italian, Spanish, Brazilian-Portuguese, Russian, Japanese, Korean, Simplified and Traditional Chinese)<br />\nSteam Support includes: Steam Achievements, Steam Leaderboard, Steam Cloud and Full Gamepad Big Picture Support</p>", "metacritic": null, "released": "2014-08-28", "tba": false, "updated": "2023-09-18T09:04:06", "background_image": "https://media.rawg.io/media/games/72d/72d5420fe23093a936caeccafa9d6be9.jpg", "website": "http://digitaltribegames.com/almightree/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 121, "beaten": 1, "toplay": 2, "dropped": 1}, "playtime": 4, "achievements_count": 18, "ratings_count": 3, "suggestions_count": 380, "game_series_count": 0, "reviews_count": 3, "platforms": ["Android", "Linux", "macOS", "PC", "iOS", "Nintendo Switch"], "developers": ["Crescent Moon Games", "GodSpeed Games", "Chocoarts"], "genres": ["Action", "Adventure", "Strategy", "Indie", "Puzzle"], "publishers": ["Digital Tribe", "Crescent Moon Games", "West Coast Software"], "esrb_rating": "Everyone"}