{"id": 63981, "slug": "draw-chilly", "name": "DRAW CHILLY", "name_original": "DRAW CHILLY", "description": "<strong>DRAW CHILLY</strong> - a hell of an Arcade game. In the role of Vladimir, you’ll gradually raise the city of Mechanics from the depth of the unknown abyss. <br/>Following the lead of the Oldest and Wisest of the Mechanics, they defend their city and expertly control mechanisms. <br/>However, the wrench can be used not solely for the purpose of screwing up the nuts, it also happens to be an excellent weapon that helps in the fight against the main enemy of the Grimy Mechanics - the Grease Monkeys.<br/><br/>Simple controls, the unique “Any-Means-to-an-End” battle system, diligent fighters of Vladimir's squad and their not always intelligible behavior.<br/><br/>Choose your actions and where to move your fighters. Changed your mind? Re-make your choice and try again! Defend the mechanisms and use assets of your city wisely!<br/><br/>- Immortal, but vulnerable leader - Vladimir.<br/>- Unique squad fighters, divided into not the most obvious classes - mechanics, defenders, thugs and engineers.<br/>- Hundreds, no, thousands of monkeys, whose thoughts wander between the desires for bananas and murder.<br/>- Well-wishers who help Vladimir and you in his mission.<br/><br/>No matter how hard you try to raise your city to the surface, do not rush. DRAW it CHILLY!", "metacritic": null, "released": "2019-02-11", "tba": false, "updated": "2023-02-16T15:31:15", "background_image": "https://media.rawg.io/media/screenshots/1c9/1c9ac19f809bfd3d63ff9673f0367776.jpg", "website": "http://azamatika.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 36, "beaten": 1, "toplay": 2, "dropped": 7}, "playtime": 1, "achievements_count": 42, "ratings_count": 4, "suggestions_count": 165, "game_series_count": 0, "reviews_count": 4, "platforms": ["iOS", "Nintendo Switch", "PC"], "developers": ["AZAMATIKA", "Azamat Bayzulaev"], "genres": ["Action", "Strategy", "Casual", "Indie"], "publishers": ["HypeTrain Digital", "AZAMATIKA", "Azamat Bayzulaev"], "esrb_rating": null}