{"id": 640, "slug": "sky-gamblers-storm-raiders", "name": "Sky Gamblers: Storm Raiders", "name_original": "Sky Gamblers: Storm Raiders", "description": "<p>THIS IS THE ULTIMATE WWII AIR COMBAT GAME!<br />\nYou’ll participate in visceral dogfights, protect cities and fleets, bomb enemy structures and even fly through tunnels. Everything is set up in accurately recreated real life locations like Pearl Harbor, Coast of Dover, Midway, Germany and France.<br />\nImmersive Gameplay<br />\nTake off and land on landing strips and carriers. You will fly in fully recreated cities with realistic weather, accurate atmospheric scattering with aerial perspective and highly detailed planes with interactive cockpits.<br />\nHuge historic Fleet<br />\nFly highly detailed WWII top aces planes. Watch the progressive damage affecting planes and finally being shredded into pieces.<br />\nHuge Collection Of Cross-platform Online Modes<br />\nInvite your friends to play online! Choose between cooperative and competitive modes: Survival, Last Man Standing, Free Flight, Free for All, Team Match, Capture the Flag and Defend the base. Play with your friends regardless of the platform (available on iOS, Android, Mac, Windows, Linux).<br />\nFeatures<br />\n3 singleplayer campaigns with a total of 17 missions, recreating historical events from WW2.<br />\n5 tutorials explaining how to play the game<br />\nonline internet multiplayer and local LAN multiplayer<br />\n29 planes each with 3 different stat versions (meaning 87 planes, all included in the game, no DLC)<br />\n8 different play modes, accessible either in multiplayer or singleplayer (against AI bots)<br />\nendless mode (survival) against the AI bots, alone or with your friends<br />\nexploration mode with no enemies<br />\ncustomizable plane weapons (10 weapons plus acrobatic smoke)<br />\ncustomizable plane paint job<br />\nsupport for gamepads and joysticks (simple or HOTAS setup)<br />\nfully customizable controls</p>", "metacritic": null, "released": "2012-11-29", "tba": false, "updated": "2023-11-23T13:32:43", "background_image": "https://media.rawg.io/media/screenshots/938/938100fea18d3cb1db4e12407673b0a7.jpeg", "website": "http://www.atypicalgames.com/StormRaiders/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 23, "beaten": 2, "toplay": 1, "playing": 1}, "playtime": 4, "achievements_count": 99, "ratings_count": 3, "suggestions_count": 411, "game_series_count": 0, "reviews_count": 4, "platforms": ["Android", "Linux", "macOS", "PC", "iOS", "Nintendo Switch"], "developers": ["Atypical Games", "Revo Solutions"], "genres": ["Simulation", "Arcade"], "publishers": ["Atypical Games"], "esrb_rating": null}