{"id": 640022, "slug": "nemjem", "name": "nemjem", "name_original": "nemjem", "description": "<p>Did you ever wanted to take care of a little creature that is pretty exhausting to please? No? Well, the 'best' things in life come as a surprise!\r\n</p>\n<p>nemjem is a game for twitch streamers that want to challenge or test themselves and their own chat! \r\n</p>\n<p>Create your own nemjem, name it and start letting your chat take care of it. \r\n</p>\n<p>The role of the streamer is to overwatch. You earn money over time with which you can buy items that could help you in difficult situations but also items that are important for the survival of your nemjem.\r\n</p>\n<p>Do you want more action? You can also play with your chat. Take both roles to be more hands-on. \r\n</p>\n<p>The role of the chat is to care. Join nemjem's friend book and earn points over time. You can use the points for commands that help nemjem's wellbeing... or use them to be a little bit meaner? It is in your hands. The more you help the more you earn friendship levels. The higher your friendship lever the more commands you can use\r\n</p>\n<p>Commands:</p>\n<p>!join - Join the friend book to earn points and play along\r\n</p>\n<p>!talk - Talk with nemjem to gain Attention and a little Fun\r\n</p>\n<p>!joke - Tell nemjem a joke to gain Fun and a little Attention\r\n</p>\n<p>!hug - Hug nemjem to gain Attention\r\n</p>\n<p>!rob - Try to rob the streamer of his money \r\n</p>\n<p>!walk - Walk with nemjem to gain fun. Can also be tiring \r\n</p>\n<p>!relax - Relax with nemjem to gain Fun and lose Sleep\r\n</p>\n<p>!redeem [level] - Redeem friendship levels to gain points\r\n</p>\n<p><strong>More commands are coming!</strong>\n</p>\n<p>How to connect the game to your Twitch-Channel:\r\n</p>\n<ol><li>Go to https://twitchapps.com/tmi/ to get an OAuth code\r\n</li><li>Start the game\r\n</li><li>Go to \"Settings\"\r\n</li><li>On the left-hand side, you have to text fields. The first one is for your channel name and the second is for your OAuth code. You need to paste the complete code (\"oauth:xxxxxxxxx\")!\r\n</li><li>Hit \"Save\" and <strong>restart the game</strong></li><li>Open your own twitch page and go to the chat\r\n</li><li>Go to Settings and click on \"Twitch-Connectivity Check\"\r\n</li><li>You should now see a message in your chat from yourself and you are ready to go!</li></ol>", "metacritic": null, "released": "2021-07-19", "tba": false, "updated": "2021-07-23T10:20:55", "background_image": "https://media.rawg.io/media/screenshots/38c/38c177dca76260ccf1b36789caf81ca3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 9, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Copperleaf"], "genres": [], "publishers": [], "esrb_rating": null}