{"id": 640019, "slug": "kasta", "name": "Kasta!", "name_original": "Kasta!", "description": "Un regolamento di fantastiscienza italica\r\n<p>Ovvero dove la scienza e il fantasy si fondono per creare un mondo fittizio abitato da creature e individui ispirati dal moderno folklore italiano. </p>\n<p>Ci saranno (o potrebbero esserci) Origini come l'Eroe Pagano, il Cavaliere Mascarato, lo Pseudo-sindacalista, il Kastocrate, oppure Nemici come la Manina, il Draghi, i Poteri Forti e altro ancora.</p>\r\nCompatibile con Troika!\r\n<p>\n</p>\n<p><strong>Kasta! è il regolamento comunitario</strong> che traduce, sintetizza e riorganizza il gioco di ruolo <em>Troika!</em> nella sua versione SRD.</p>\n<p>È pertanto <strong>al 100% compatibile con Troika!</strong> stesso ed è pensato sia come rapido riferimento delle regole per l’utilizzo al tavolo che come base regolistica per le proprie creazioni grazie alla sua licenza.</p>\r\nKasta! è in sviluppo\r\n<p>Questa è infatti la bozza in formato Google Docs <strong>rilasciata alla comunità per una libera revisione</strong>, correzione, chiarificazione e finalizzazione di quello che sarà il prodotto finito.</p>\n<p><strong>Il regolamento è completo e utilizzabile così com'è</strong>, ma manca ancora di alcune cose che comunque si trovano tutte sul SRD di Troika!: tabella delle Armi, descrizione di Oggetti e Incantesimi, Nemici, Origini (di cui comunque ne trovate a palate in rete e qualcuna in italiano).</p>\n<p>\n</p>\n<p><strong>Sentitevi quindi liberi (anzi <em>dovete!</em>) commentare il testo, segnalare errori, refusi, incongruenze con le regole originali e punti poco chiari.</strong></p>\r\nUna traduzione comunitaria\r\n<p>Essendo questa <strong>una traduzione comunitaria e indipendente</strong> dall'edizione di Troika! di Need Games (che è fedele al manuale originale e quindi altrettanto figa) vari termini sono per forza di cose differenti.</p>\n<p>Inoltre Origini e Nemici non saranno gli stessi di Troika!, poiché abbiamo voluto dare la nostra interpretazione dell'opera originale, e forse mancheranno alcune tabelle e descrizioni che tuttavia potrete trovare sia sulla SRD (da cui Kasta! deriva) sia sul gioco originale.</p>\r\nIpergiallo!\r\n<p>Questo tema ipergiallo non sarà (forse) quello finale del prodotto, ma per la fase in cui si trova e per i riferimenti a cui si rifà al momento va più che bene.</p>\n<p>---</p>\n<p><em>Kasta! è una produzione indipendente di OSR Italia e non è affiliata con Melsonian Arts Council.</em></p>", "metacritic": null, "released": "2021-07-19", "tba": false, "updated": "2021-07-23T10:20:21", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["OSR Italia"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}