{"id": 640194, "slug": "grey-lucidity", "name": "Grey Lucidity", "name_original": "Grey Lucidity", "description": "Grey Lucidity is a visual novel, scary, adventure horror game about surviving from the cursed town. Escape for your life! multiple endings - because you decide what will happens.<br/><br/><br/><h3>STORY</h3>There’s a city called Roseberry town. The place is silent and in there, the people live in good faith. People in that town know each other. One day there’s a secret facility built there, in the hospital. The secret facility gets funding from big pharma. The Scientists come there and live there peacefully. Until someday the research gets malfunctioned. The dangerous virus spread from the air. The people there don’t feel anything. Until some of them get the kind of epilepsy syndrome.<br/><br/>What people believe there is they are possessed with a demon. Until almost all of them die. Some survivors go to an asylum.<br/><br/>The government says there's a mass possessed case happening there. They are trying to close the case because big Pharma interfered. Now the city is fully abandoned and closed to a restricted demon area.<br/><br/>The truth cannot be hidden forever. Doctor Larry Brigham has one only daughter called Cassandra. She hides Cassandra during the mass possession, she hides from the police and military who kill the citizens. In the shelter for 1 month, and after that she must escape from the cursed town.<br/><br/>Then the game begins…<br/><br/><h3>FEATURES</h3><ul><li>Multiple endings and hell story tree<br/></li><li>innovative visual novel with comic panel story telling<br/></li><li>Beautifully-drawn<br/></li><li>Engaging gameplay<br/></li><li>Full gameplay support for both keyboard/mouse</li></ul>", "metacritic": null, "released": "2021-07-23", "tba": false, "updated": "2021-07-26T02:15:09", "background_image": "https://media.rawg.io/media/screenshots/0e8/0e8cc893d0c8165a1568cf9d043aa53e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 280, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Miracle Gates Entertainment"], "genres": ["Action", "Casual"], "publishers": ["Miracle Gates Entertainment"], "esrb_rating": null}