{"id": 640192, "slug": "arcade-jukebox", "name": "Arcade Jukebox", "name_original": "Arcade Jukebox", "description": "Discover retro, nostalgic and the latest, most popular gaming soundtracks and more Get the latest news, sound tracks released on STEAM, reviews and top rated tracks. <br/><br/><br/><br/>Create your playlists, listen to our online radio station, update profile, make music requests to be added to our playlists and rotation. Get access to the latest free offers and downloads posted by producers and artists.<br/><br/><ul><li> Create your profile and playlists.<br/></li><li> Arcade Jukebox Soundtrack Mix. *Download a mix of published soundtracks exclusive to Arcade Jukebox.<br/></li><li> Free featured music download limited time offers for members. *Check in often for offers.<br/></li><li> Discover soundtracks of unique genres from video games.<br/></li><li> Get the latest in top rated music and soundtracks. <br/></li><li> Get access to playlists or create your own. <br/></li><li> Rate/Review or Vote for your favorite tracks.<br/></li><li> Show support for your favorite artists/composers/producers.<br/></li><li> Buy tracks through Steam's Store widget.<br/></li><li> Get access to free downloads and giveaway events.<br/></li><li> Can also be accessed from any web browser or mobile device. </li></ul><h3>Calling All Game Developers, Producers and Artists:</h3><br/><br/><ul><li> All soundtracks and music can by easily linked to your STEAM store page for purchase.<br/></li><li> Get your soundtracks heard by other players, connect with your fans &amp; grow your audience.<br/></li><li> Create stations, playlists or get your songs playlisted and aired on gaming radio stations.<br/></li><li> Hold giveaways and events or launch a new album.<br/></li><li>  Promote your upcoming game title with fully produced songs or soundtracks. </li></ul><br/>*If you are an artist/composer or producer with music or soundtracks currently on Steam, you can receive free access and placement in our network to have your songs featured. We will be giving full access to those who qualify. Apply Here<h3>Our Goals:</h3><br/><br/>We aspire to create more exposure and opportunities for video game music composers, producers and artists while keeping the interest in video game soundtracks in high demand. By providing opportunities through Steam and our network, we hope to provide a strong base for listeners to engage new music, news and updates on the latest in video game music production, music and sound.", "metacritic": null, "released": null, "tba": false, "updated": "2021-07-26T02:14:00", "background_image": "https://media.rawg.io/media/screenshots/f14/f148c8437b297a1905b0a314ce0945bd.jpg", "website": "https://www.arcadejukebox.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 190, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Arcade Jukebox"], "genres": ["Action", "Simulation", "Casual"], "publishers": ["Arcade Jukebox Studios"], "esrb_rating": null}