{"id": 640271, "slug": "doggface-skate-and-stack", "name": "Doggface: Skate and Stack", "name_original": "Doggface: Skate and Stack", "description": "Are you ready for the official Doggface skateboard game? Prepare to relax and go up as high as you can stacking your skateboard to the sky!<br/><br/>Play as Doggface and collect skateboard to get taller and avoid selfies,  obstacles, grind some rails and drink some juice all while riding your skateboard and race to the end! <br/><br/>How far can you stack up your skateboard? These are games for all ages, and easy enough for a kid to beat. But maybe you'll need to be the smartest kid to beat this! Take your skateboard and get to the end! do you have what if takes to beat this fun run with Doggface?  <br/><br/>Who is this game for?<br/><br/>People that wanna relax! Have a break and play this free game now. A kid would love to play this! And so would adults! A skateboard game for all!<br/><br/><br/>Want a break from the kid? <br/><br/>Have them ride their skateboard here with Doggface in this fun run and ride that skateboard to victory!  Do you have the moves to beat all of the levels?  Play now and lets see! These games for you to pick up all of the skateboards!<br/><br/><br/>How to play?<br/><br/>Swipe left or right to pick up a skateboard and get higher to get over the obstacles. Hit a sweet jump with your skateboard and collect coins!<br/><br/>Taking a break? <br/><br/>Race your way through all of these levels with your skateboard with these game for a fun run. In this skateboard game you can grind rails, go off sweet jumps and get really tall!<br/><br/><br/><br/>If you have any questions or comments, feel free to contact us at: hello@gamejam.co<br/><br/>Please note that our VIP Membership is an auto-renewing subscription!<br/><br/>Link to Terms and Conditions: https://gamejam.com/terms<br/>Link to Privacy: https://gamejam.com/privacy<br/>Link To Cookies Policy: https://gamejam.com/cookies-policy", "metacritic": null, "released": "2021-07-22", "tba": false, "updated": "2021-07-26T03:16:53", "background_image": "https://media.rawg.io/media/screenshots/bad/bad8dc28398201494b8dccd1170c5e08.jpg", "website": "https://gamejam.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 35, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Gamejam Co."], "genres": ["Sports", "Casual"], "publishers": ["Gamejam Co."], "esrb_rating": "Everyone 10+"}