{"id": 640262, "slug": "bomb-club", "name": "Bomb Club", "name_original": "Bomb Club", "description": "If you have a knack for explosives, the Bomb Club welcomes you! Meet new bombs, uncover new challenges, and create awesome chain reactions in this explosive puzzle game!<br/><br/>Bring your best bomb-fu to detonate all bombs on the board in one single chain reaction. With dozens of bombs, hats and level types, you'll need more than your love of things that go 'BOOM' to succeed. Fortunately, the other club members will be there to guide you!<br/><br/>--- More than 20 wacky bombs to add to your arsenal ---<br/>Meet the Laser bomb, the Black Hole bomb, the Magma bomb, the Smoke bomb and many more, each with their own effect and range. Being a bomb expert is no easy task... But the Nitronomicon will always be at hand to remind you what they all do. Years of bomb research are compiled in this book, so keep it close!<br/><br/>--- The pinnacle of bomb technology: Bomb hats! ---<br/>Put a hat on a bomb and it will get a new effect! With the Party hat, the Hard hat, the Top hat and other fashionable headgears, you'll never lack options and your bombs will never lack style!<br/><br/>--- A huge map to explore ---<br/>Hundreds of levels are waiting for you, with various level types. Choose your path, explore new zones at your own pace, and unlock new stuff as you progress. Who knows what's waiting for you at the end of it all?<br/><br/>--- Become a bomb expert ---<br/>Master all bombs and hats and complete the optional objectives to increase your score and become the club's most trusted bomb expert. Bomb Club's systems are extremely simple, but you'll soon find out that they can be challenging too! Newcomers will have no trouble progressing the story, but puzzle experts will also find levels that will push them to their limits!<br/><br/>--- More explosions! ---<br/>What's that? You crave more explosive challenges? Bonus level packs are available, with even more bombs and more devious levels!", "metacritic": null, "released": "2021-06-30", "tba": false, "updated": "2021-07-26T03:11:36", "background_image": "https://media.rawg.io/media/screenshots/87e/87ebf3db4d47dd059e895248c550ab17_6iMjn9j.jpg", "website": "http://bombclub.sos-webcomic.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 190, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Antoine Latour"], "genres": ["Casual", "Puzzle"], "publishers": ["Antoine Latour"], "esrb_rating": "Everyone 10+"}