{"id": 640268, "slug": "car-soccer-2", "name": "Car Soccer!", "name_original": "Car Soccer!", "description": "Download and compete in the arcade-style soccer and car game! Customize your car, hit the field, and compete in one of the most critically acclaimed sports games of all time! Download and take your shot!<br/>Hit the field by yourself in SOLO 1v1, DUO 2v2, and TRIO 3v3 Online Modes Unlock items in Soccer Pass, enjoy cross-platform progression, and more! The field is waiting. Take your shot!<br/><br/><br/>Drive your car across the soccer field, defend your goal, and hit the ball to score and beat your opponent. There are no rules or referees.<br/><br/><br/>Taking inspiration from soccer, cars, and retro arcade, Car Soccer is a completely unique arcade sports game. Jump in to play an action-packed 5-minute match that is very intense.<br/><br/><br/>CUSTOMIZE YOUR PLAYER CAR<br/>Choose how you want your car to look:<br/>• From a long list of cars<br/>• Amazing Boost trails<br/>• Wear a hat as you drive<br/>• Show an amazing explosion when you score<br/>• Communicate efficiently using emojis<br/><br/><br/>PERFECT YOUR STRATEGY!<br/>Car Soccer relies heavily on your personal skill. Do you prefer defense, offense, or a more balanced approach? Plan out your strategy in the field by customizing your car. Also, don't forget to upgrade your player boost, on your player profile.<br/><br/><br/><br/>BE THE BEST!<br/>• Level up and make your way across getting new Trophy badges. <br/>• Rise to the top of the leaderboard by gaining trophies from matches. <br/>- Get your name on top of the leaderboard,<br/>- Score goals, and raise trophies to get into the all-time leaderboard.<br/><br/><br/>Ready to become the next STAR PLAYER? Download Car Soccer now for free and take your shot!", "metacritic": null, "released": "2021-03-05", "tba": false, "updated": "2021-07-26T03:14:39", "background_image": "https://media.rawg.io/media/screenshots/89c/89c04c429cf42de0e6dc533a8837c671_MhfGanu.jpg", "website": "https://linktr.ee/ironstonegames", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 150, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ironstone Games"], "genres": ["Action", "Sports"], "publishers": ["Ironstone Games"], "esrb_rating": "Everyone 10+"}