{"id": 640202, "slug": "nibiru-uncharted-planet", "name": "Nibiru: Uncharted Planet", "name_original": "Nibiru: Uncharted Planet", "description": "<strong>Nibiru: Uncharted Planet</strong> is a remaster of the <strong>Nibiru</strong> game, the story and basic mechanics remain as they were before. The game has changed visually, a huge amount of textures, the entire user interface and some mechanics have been replaced.<br/><br/><strong>Nibiru: Uncharted Planet</strong> is a harsh adventure on an uncharted planet that full of danger and trials. In the big and open world you ought to get resources for survival and explore locations in search of salvation along with other players. Left alive, you must find out the reason of the radio silence and, of course, survive.<br/><br/>The fall of the spacecraft is only the beginning. Seven astronauts survived the crash. The purpose of the expedition – exploration of the planet, data collection and survival.<br/><br/><br/><br/><strong>Wonder around</strong><br/>Uncover the mystery of the death of the colony, in a colorful and bright open world, an area of 38 square kilometers, full of different living creatures and anomalous monsters.<br/><br/><strong>Play with friends </strong><br/>Join other players to increase your chances of survival and overcome one of the most difficult challenges in your life.<br/><br/><strong>Survive</strong><br/>Challenge the new lands and explore the uncharted corners of the planet Nibiru in this at the same time beautiful and ruthless world. The night is full of danger, merciless monsters and сreepy screams. Stock up the ammunition during the day, because the night will be long<br/><br/><strong>CREATE AND IMPROVE </strong><br/>Collect everything on your way to create the tools that will help you to survive: weapons, armor and tools for resource extraction. Improve the skills of survival in your shelter, adjusting them to your style of survival.<br/><br/><strong>Hunt or run away </strong><br/>Let this world see what you are capable of. However, remember: you are always surrounded by the monsters of a pure evil, which is far more dangerous than a beast or any weapon that you have. Show your abilities in a world that covered by monsters, deadly phenomena and incredible beauty, which is goes by attraction for new inhabitants.<br/><br/>All this and even more awaits you in Nibiru: Uncharted Planet.", "metacritic": null, "released": "2021-07-23", "tba": false, "updated": "2021-07-26T02:20:36", "background_image": "https://media.rawg.io/media/screenshots/90c/90c8f159c5dc79ee143b2902467c13a4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 498, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["FSS", "Mad Monkeys"], "genres": ["Action", "Adventure", "Massively Multiplayer"], "publishers": ["Mad Monkeys"], "esrb_rating": null}