{"id": 640285, "slug": "wingspan-the-board-game", "name": "Wingspan: The Board Game", "name_original": "Wingspan: The Board Game", "description": "Wingspan is a relaxing, award-winning strategy card game about birds for 1 to 5 players. Each bird you play extends a chain of powerful combinations in one of your three habitats. Your goal is to discover and attract the best birds to your network of wildlife preserves. <br/><br/>You are bird enthusiasts—researchers, bird watchers, ornithologists, and collectors—seeking to discover and attract the best birds to your network of wildlife preserves. Each bird extends a chain of powerful combinations in one of your habitats. Each habitat focuses on a key aspect of the growth of your preserves.<br/><br/>In Wingspan up to 5 players compete to build up their nature preserves in a limited number of turns. Each beautiful bird that you add to your preserve makes you better at laying eggs, drawing cards, or gathering food. Many of the 170 unique birds have powers that echo real life: your hawks will hunt, your pelicans will fish, and your geese will form a flock.<br/><br/>Features<br/>- Relaxing strategy card game where your goal is to discover and attract the best birds.<br/>- Single player and multiplayer modes for up to five players.<br/>- Based on award winning, competitive, card-driven, engine-building board game.<br/>- Hundreds of unique, animated birds with their real life sound recordings.<br/>- Multiple ways to accumulate points with birds, bonus cards and end-of-round goals.", "metacritic": null, "released": "2021-07-20", "tba": false, "updated": "2023-12-21T19:31:32", "background_image": "https://media.rawg.io/media/screenshots/e24/e24fd6bafe37653d7d0115d577909f49_SkwAArd.jpg", "website": "https://wingspan.monstercouch.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 214, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Monster Couch"], "genres": ["Strategy", "Board Games"], "publishers": ["Monster Couch"], "esrb_rating": "Everyone 10+"}