{"id": 640284, "slug": "ultimate-tiger-simulator-2", "name": "Ultimate Tiger Simulator 2", "name_original": "Ultimate Tiger Simulator 2", "description": "Take control of our most realistic tiger ever in the sequel to one of the most popular animal simulators of all time! Explore a massive tropical world brimming with prey and predators at every turn. Search out other tigers and live together, raise a family, hunt for food, and become the strongest tiger in the world!<br/><br/>HYPER REALISTIC SIMULATION<br/>The jungle has never been more alive! Explore and hunt to maintain your tiger's thirst and hunger in the most detailed world we’ve ever created!<br/><br/>NEW ALERT SYSTEM<br/>Sneak your way through the dense jungles to avoiding alerting nearby animals and giving them a head start trying to escape you! Animal AI is smarter and faster than ever!<br/><br/>NEW BATTLE SYSTEM<br/>Omnidirectional dodge system brings a new level of skill to your fights! Quickly react to your opponents attack direction to dodge and avoid damage!<br/><br/>NEW RELATIONSHIP SYSTEM<br/>Build deeper bonds with your tigers through the new relationship and personality system. Your pack recognizes heroic and caring acts that will alter relationships. Gain bonuses from synergetic tigers hunting together!<br/><br/>EXPANDED FAMILY<br/>Have up to TEN tigers in your pack! Seek out friendly tigers and pass their challenges to recruit them to your pack! Play as your new tiger to help them level up and improve relations with other family members!<br/><br/>BABY AND TEEN TIGERS<br/>A brand new age makes raising your cubs even more real! Breed tiger cubs that will grow into teens and eventually full grown members of your pack! <br/><br/>NEW CUSTOMIZATIONS<br/>Introducing expanded animal customization options for fine-tuning your tiger's look! Alter physical features like height and ear size to accentuate your tiger's personality!<br/><br/>BRAND NEW BOSS BATTLES<br/>Experience free-range cinematic boss fights against gigantic kings of the jungle with entirely new mechanics!<br/><br/>UPGRADE STATS AND SKILLS<br/>Gain experience and level up your tiger to unlock stat bonuses and unique skills! Skills will grant specialized tiger abilities like healing, tracking, and battle strength!<br/><br/>NEW DEN CRAFTING<br/>Collect materials to decorate and upgrade your dens and make life for your tigers even better! Building animal traps and watering holes can provide your pack with guaranteed tasty snacks in the mornings!<br/><br/>MASSIVE OPEN WORLD JUNGLE<br/>We have done away with procedural flora, and have instead hand placed every blade of grass and tree in the world, bringing a more detailed purposeful world for you to explore!<br/><br/>REALISTIC WEATHER AND SEASONAL CYCLE<br/>The world around you will change before your eyes with our brand new seasonal cycles. Snow piles up, soils glisten with wetness as rivers rage, and leaves turn brilliant oranges and yellows in fall!<br/><br/>INCREDIBLY DETAILED ANIMALS<br/>Discover the all new wildlife of the jungles! Improved AI and animations combined with species specific action trees will immerse you in our most detailed world to date. Track down animals like Lion, Elephant, Rhinoceros, Monkey, Ram, Warthog, Lynx, Stork, Flamingo, Crow, Raccoon and of course Tigers!<br/><br/>IMPROVED NEXT-GEN GRAPHICS<br/>Introducing AAA PC quality graphics in a mobile simulator! With meticulously optimized models and textures, we’ve managed to reach an unrivaled level of visual quality!<br/><br/>OPTIONAL BLOOD EFFECTS<br/>If you are of age or have your parents permission, turn on the blood effects to add even more realism!<br/><br/>GLUTEN-FREE PROMISE<br/>With all of our games you will always get the full game with no ads or additional purchases!<br/><br/>Download the Ultimate Tiger Simulator 2 and prove you can survive as a wild tiger in our all-new completely revamped simulation!<br/><br/>If you liked living as a Tiger then be sure to check out our other animal simulators!<br/><br/>We plan on creating more sequels so give us a shout and let us know what you want to play next!<br/>facebook.com/glutenfreegames<br/>twitter.com/glutenfreegames", "metacritic": null, "released": "2021-07-22", "tba": false, "updated": "2021-07-26T03:23:15", "background_image": "https://media.rawg.io/media/screenshots/bff/bffdc2e51e20b073466971165bc2d7db_fcZoFTS.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 220, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Gluten Free Games"], "genres": ["Adventure", "RPG", "Educational"], "publishers": ["Gluten Free Games"], "esrb_rating": "Teen"}