{"id": 640256, "slug": "squad-alpha-action-shooting", "name": "Squad Alpha - Action Shooting", "name_original": "Squad Alpha - Action Shooting", "description": "► Squad Alpha – are you up to the challenge?<br/> <br/>Looking for an engaging casual shooter that’s easy to get the hang of but offers engrossing action and real tactical challenges? Squad Alpha is a top-down shooting game with intelligent mechanics, loads of cool upgradeable guns, and addictive gameplay that’ll have your trigger finger itching and tickle your strategic brain. <br/> <br/>Duck, dodge, run and take cover, then pick off multiple targets to complete endless levels of thrilling action and get awesome rewards  so you can upgrade your gear and prove your agents worthy of the elite Squad Alpha!<br/> <br/> <br/>►The alpha and omega of mobile shooters <br/> <br/>• Think before you shoot – Squad Alpha is a blast and a half, with intuitive top-down gameplay that’s easy to get into. But you can’t just go out with all guns blazing. The clever mechanics and carefully designed levels mean you’ll need to pause your trigger finger, plan your moves and play the angles to take out all your enemies and reach the end of the progressively more challenging levels.<br/> <br/>• The action never ends – over 200 unique levels, each requiring its own tactical approach and ever more ingenious strategy to master, as well as nearly 20 different bosses providing extra challenges and awesome rewards for your  elite agents.<br/> <br/>• Get the squad back together – progress through the game to gather all the elite agents of Squad Alpha, each with their own unique style, skills, and 4 different skins to collect and wear.<br/><br/>• Bullet points – over 30 different guns to collect, cherish and upgrade, including pistols, shotguns, SMGs, and much more. Earn cash in levels and reach game benchmarks to build up your arsenal and find the gun that suits your shooting style, then fine-tune it in the workshop to create a truly awesome weapon that will strike fear into the heart of your foes. And that’s not to mention grenades…<br/><br/>• Banging sounds – Squad Alpha boasts simple but stylish graphics that are light enough to play on any device while also looking sleek and cool, as well as a fantastic and atmospheric soundtrack to enhance the action and adventure.<br/> <br/>►Guns, grenades, and gumption… <br/> <br/>Plan your moves and let the bullets fly in this edge-of-your-seat action game that’s fun to play for 5 minutes or hours on end. Looking for a new take on a top-down shooter that combines tactical challenges with really engaging gameplay, stylish looks, and super-cool sounds, and a huge amount of collectible to ensure there’s always something new that’ll keep you coming back for more and more fast-paced shooter action? <br/> <br/>Download Squad Alpha now for thrills, adventure, and guaranteed trigger happiness.", "metacritic": null, "released": "2021-07-20", "tba": false, "updated": "2021-07-26T03:08:37", "background_image": "https://media.rawg.io/media/screenshots/096/09620d288fa6cdb78b2d28b63dc0ce76.jpg", "website": "https://say.games/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 152, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["SayGames"], "genres": ["Action", "Casual"], "publishers": ["SayGames"], "esrb_rating": "Teen"}