{"id": 64032, "slug": "ai-escort", "name": "AI Escort", "name_original": "AI Escort", "description": "This is an Otome visual nove, it is a satire on highly developed industrial technology in Japan, in which the decline of human civilization, moral decays, and low birth rate gets out of control under the huge social pressure. <br/>\r\nSomeday, on her way back from work, Ruri picked up an abandoned android, Aizen. Ruri stayed up all night to repair Aizen, but due to his former hostess’ negligence of periodic inspection and maintenance, Aizen’s body function could only last for five days. So Ruri decided to spend the last five days with Aize.<br/>\n<br/>\r\n♡Character Introduction♡<br/>\r\nRuri<br/>\r\nRuri is qualified as a maintenance technician for androids, and she owns a shabby workshop at the corner of the city. She is highly skilled as a technician, but she could barely make ends meet in her profession. Although she is not a Material Girl, she has to learn from Sakura in order to make a living, which is trading secret milk for money.<br/>\n<br/>\r\nAizen<br/>\r\nAizen is a RC4698 android made by RC LLC. He is good-natured, well-spoken and always wearing a smile. During the five years after he left the factory, his hostess has been treating him horribly. He is not well-maintained and finally abandoned after he is broken.<br/>\n<br/>\r\nMurasaki<br/>\r\nAs the tipster of the streets, Murasaki is a handsome “New Half” who helps Ruri. He loves money so much that he could do anything for it.<br/>\n<br/>\r\nBenino<br/>\r\nBenino is the VIP of all Ruri’s guests. He is an adult Shota. Contrary to his appearance, he is actually an adult. There are two things he couldn’t give up, smoking and making a move on Ruri.", "metacritic": null, "released": "2018-04-12", "tba": false, "updated": "2022-08-18T20:51:48", "background_image": "https://media.rawg.io/media/screenshots/fdc/fdc28f0f769a0f44bcca4dfce4f3cf0f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 18}, "playtime": 5, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 293, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["MagicHouse"], "genres": ["RPG", "Indie"], "publishers": ["SakuraGame"], "esrb_rating": null}