{"id": 64037, "slug": "ore", "name": "ORE", "name_original": "ORE", "description": "ORE is a couch-cooperative twin stick shooter where you and your friends are space miners draining a hostile alien planet of a volatile resource that's corrupted the planet's inhabitants. Fight through a handful of levels and navigate the planet's varied surface to collect as much ORE as you can before the planet implodes. Once you've gathered enough ORE to upgrade your crazy weapons, take a trip to the planet's core where you will face the corrupted Core Wurm that's causing the planet to collapse-in on itself. Defeat the Wurm, save the planet, and get rich!<br/><br/>ORE merges roguelike game structures with twin-stick gameplay in order to create high-risk, high-reward systems for players to navigate. The game also uses friendly fire, a shared economy, various weapon damage types, and more to encourage intentional cooperation between players. With our game’s intricate and dynamic enemy behaviors, alongside a handful of unpredictable guns, any play session can quickly turn to a chaotic fight for survival.<br/><br/><br/><strong>1-4 Players:</strong> Team up with as many as three friends or attempt to solo the game!<br/><strong>Local-Cooperative Emphasis:</strong> While you can play alone, the game was built specifically to be enjoyed with friends.<br/><strong>High-Risk, High-Reward Systems:</strong> Players are in control of when they want to leave the planet surface with their stash, or keep fighting for more loot! <br/><strong>Crazy Weapons:</strong> Each weapon feels entirely unique and has designed to be either great or terrible depending on the situation and enemies you face. <br/><strong>3 Dangerous Biomes to Explore:</strong> Travel across our frost, swamp, and lava environments to explore old excavation sites as well as undiscovered terrain.<br/><strong>Shared Economy Structure:</strong> Everyone shares the game's resource pool, so work together and spend wisely!", "metacritic": null, "released": "2018-05-01", "tba": false, "updated": "2019-08-28T21:55:57", "background_image": "https://media.rawg.io/media/screenshots/67e/67ec015c97a8388b11b18f5257ac776c.jpg", "website": "https://www.orethegame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 112, "toplay": 1}, "playtime": 1, "achievements_count": 27, "ratings_count": 2, "suggestions_count": 547, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Couch Cosmonauts"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Couch Cosmonauts"], "esrb_rating": null}