{"id": 64079, "slug": "the-outsiders", "name": "The Outsiders", "name_original": "The Outsiders", "description": "The Outsiders puts you in the inverted role: you are the Alien Big Boss defending your planet against human invasion! You don't fight the big monster, YOU ARE him! There's nothing bigger than you on screen, only tiny humans and their hopeless machines. But if you don't find the right strategy to survive longer... they'll overwhelm you and fulfill the classic hero finale!<br/><br/>The game is a simple indie sci-fi survival shooter with endless gameplay for you to survive as long as you can, beat your own record and rise up on the leaderboard. At your disposal you have a giant worm on your shoulder to serve you as weapon, several boss skills that allow you to hit and kill multiple enemies and loyal minions that will fight for you to the death. <br/><br/>The Outsiders is a short and visceral game for those moments when you just want some good gruesome fun, when you don't have a lot of time to spare or even between two matches of your favorite MOBA or Battle Royale.MAIN FEATURES OF THE GAME<br/><ul><li>Visceral action that puts you on the role of the Big Boss;<br/></li><li>Nothing bigger than you on screen, you are the gigantic badass monster;<br/></li><li>Endless gameplay with good replayability;<br/></li><li>3 different random arena levels;<br/></li><li>3 different powerful weapons to allow for diverse strategies;<br/></li><li>3 different Boss skills that will slay them all!<br/></li><li>Awesome heavy metal soundtrack by Paulo Germano. We assure you will love it;<br/></li><li>Global Leaderboard just for the good and old bragging rights;</li></ul><br/>The challenging of surviving is one of the main points of the game. You will need to learn new strategies as you go. You will fail! Don't worry, soon enough humans won't be a match for you!<br/><br/>Daisu Games is a small indie dev company in Recife, Brazil. The Outsiders is our debut title on PC.", "metacritic": null, "released": "2018-06-18", "tba": false, "updated": "2019-08-28T21:55:54", "background_image": "https://media.rawg.io/media/screenshots/be9/be9bbbc80e7a83b72083a9828def41c0.jpg", "website": "https://www.daisu.games/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 534, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Daisu Games"], "genres": ["Action", "Indie"], "publishers": ["Daisu Games"], "esrb_rating": null}