{"id": 640764, "slug": "the-club-itch-straski", "name": "The Club (itch) (Straski)", "name_original": "The Club (itch) (Straski)", "description": "<p>Walk through The Club as you retrieve your friend's lost items, but be sure not to be seen by the thug your friend owes money to.</p>\n<p>I was toying around with a concept for a horror game where you hear a scary noise when you're looking in the general direction of the enemy, regardless of whether or not the enemy is near you. I think the concept would work a lot better in a larger game with scarier graphics, but for this game jam I tried to adapt the idea into a bite sized experience as best as I could (and unfortunately, I'm the furthest thing from a visual artist).</p>\n<p>This is my first game period and the first time I've done most things in this game, so I spent basically the whole time learning everything you see, but I learned a hell of a lot! I tried to take on an ambitious amount for a beginner because hey, you need a reason to push yourself to learn new things. I learned everything from how casting <em>actually</em> works, to how to use AI behavior trees. I'm afraid some of my design choices might make some of the things I learned go unnoticed, but it be like that. I'll do better next time.</p>\n<p>I'm really glad I decided to participate, even if it didn't come out as well as I would have wanted. I didn't have a lot of time to have it play tested, and when it finally was, it was found to be a bit too easy. I've tried to bump the difficulty up, so hopefully people will lose at least once. :)</p>", "metacritic": null, "released": "2021-07-25", "tba": false, "updated": "2021-07-26T05:31:04", "background_image": "https://media.rawg.io/media/screenshots/6a3/6a3c4af88c8819493fe533a087aad8b2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Straski"], "genres": [], "publishers": [], "esrb_rating": null}