{"id": 640884, "slug": "monday-night-minin", "name": "Monday Night Minin'", "name_original": "Monday Night Minin'", "description": "<p>Welcome to <strong>Monday Night Minin'</strong>, the best ripoff of <strong>Friday Night Funkin'</strong> AND <strong>Minecraft</strong> that you'll ever play!</p>\n<p>First thing's first: <strong>This is NOT a mod for Friday Night Funkin'.</strong> It was meant to be a programming exercise for me, so the game was built from the ground up. </p>\n<p>=========================================================</p>\n<p>In this game, you go up against famous characters from the Minecraft Universe in a beat-based battle of the blocks! Just like most rhythm games, you have to press the right key at the right moment. But instead of <em>BORING</em> arrows, you get to use <em>EPIC</em> Minecraft ores instead!</p>\n<p><strong>Monday Night Minin'</strong> currently features 5 characters: <strong>Steve, Alex, CosmicCrowMC, Dream, and Herobrine</strong>, each with their own song and location. Don't know who that third one is? Take a wild guess. Anywho, I may add more characters in the future, I may not. We'll just have to see if people like this game or not. (I'm erring towards the latter...)</p>\n<p>The difficulty of this game varies wildly, so there's something for players of every skill level in here. You can also customize your keybinds to your liking, and even <strong>play with someone else on the same keyboard!</strong> (Or control two players by yourself just to flex.)</p>\n<p>This game was programmed with Processing for Java. Music, art, charting, and animations were all done by me. I'm just that talented. I'm pretty humble, too.</p>\n<p>If you like this game, you're awesome. Awesome people also like my other game called <strong>\"Enter The Backrooms\"</strong>, which you can find on Steam: https://store.steampowered.com/app/1511670/Enter_The_Backrooms/</p>\n<p>If you like what I do or just want to add another person to your mile-long subscription list on YouTube, check out my channel <strong>CosmicCrowMC Gaming</strong>, where I upload update videos and... other... things. https://www.youtube.com/channel/UC8DJV4pfPswdcjc8IWbJ-5A</p>\n<p>=========================================================</p>\n<p><strong>Known Issues:</strong><br/></p>\n<p>- Discord is DUMB and STINKY and doesn't like streaming the game. BEFORE you try streaming this on Discord, make sure you go to User Settings &gt; Voice and Video &gt; Find the switch that says \"Use our latest technology to capture your screen\" and turn that OFF. I dunno what that \"latest technology\" is but it just can't handle the sheer epicness of Monday Night Minin'.</p>\n<p>- Streaming on Discord will sometimes make the video lag behind the audio. Discord just has all sorts of problems, doesn't it? Or is it me? Nah, I'm a perfect specimen. It's Discord.</p>", "metacritic": null, "released": "2021-07-24", "tba": false, "updated": "2021-07-26T06:02:46", "background_image": "https://media.rawg.io/media/screenshots/6f0/6f04eff70a4b578f5acef0fef2a04332.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 50, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["CosmicCrowMC"], "genres": ["Action"], "publishers": [], "esrb_rating": null}