{"id": 640879, "slug": "cloister-cards", "name": "Cloister Cards", "name_original": "Cloister Cards", "description": "<p>Cloister Cards imagines the cycle of medieval monastic life through a deck of cards. Acquire and manage your holdings, feed your growing community's needs, expand your monastery, and define an enduring legacy.</p>\n\n<p>The game applies deck-building mechanics to express the experience of survival for a medieval monastery. Simple, hand-drawn images represent the growing monastery to give substance to the growing deck of cards. This is a one-person project by a medievalist who enjoys expounding on the past and is now looking to do it in game form.</p>\n<p>This game is currently in early access, and I heartily look forward to getting feedback as it moves forward.</p>\n<p>Currently implemented:</p>\n<ul><li>Basic holdings (forests, farmland, etc.) and actions (harvest, construction, etc.)</li><li>The events system and some initial events. Most are unfriendly.</li><li>Construction of new and upgraded monastic holdings, through level 2 for the core buildings (church and dormitory) and level 1 for the ancillary buildings (infirmary, scriptorum, and lay dormitory)</li></ul>\n<p>Future development:</p>\n<ul><li>Visual touches - card art to replace the existing type color splotches, refining the assets I'm currently not satisfied with, and providing art to represent your holdings on the screen. The screen will be a sketch evoking all your holdings, not just the core buildings.</li><li>More \"things\" - that is, new holdings, actions, and rare cards to develop your monastery's particular focus and provide differentiation to play.<ul><li>Will you exploit wetlands and manage the consequences, build up an agricultural machine, or fund your expansion with pastures through endless sheep?</li><li>Relic cards and pilgrimage to improve your wealth and piety</li></ul></li><li>More events - a healthy balance of good, bad, and indifferent events. Like the existing Flood event, many will allow you to modify the deck or occur in response to what you have built. A few will be historical markers - an end to Viking attacks, for instance, or the Black Death (actually, that one's already in-game, but playing until then will be, I assure you, quite tedious for the moment).</li><li>Buildings -  level 3 for ancillary buildings and level 4 for core buildings. Expanding means more manpower, piety, and improved functions for your infirmary and scriptorum, but also higher maintenance costs.</li><li>Victory conditions - several routes to a proper \"victory\" will be offered, focusing on different ways real monasteries established names for themselves that often outlived the monastic communities themselves. These will be outlined in more detail later.</li></ul>\n<p>The game is designed on and for Windows, and has been tested only on the Windows OS. I can make no guarantees about it on any other OS.</p>", "metacritic": null, "released": "2021-07-24", "tba": false, "updated": "2021-07-26T06:01:12", "background_image": "https://media.rawg.io/media/screenshots/27a/27af9f42234e044e501d0c26aed35c47.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 50, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["DukeLeto42"], "genres": [], "publishers": [], "esrb_rating": null}