{"id": 641184, "slug": "the-useless-game-hawke-gaming", "name": "The Useless Game (Hawke Gaming)", "name_original": "The Useless Game (Hawke Gaming)", "description": "<p><strong>Edit: zoomed out camera on level 5 to allow it to be completed<br/></strong></p><p><strong>Game must be played in full screen</strong><br/></p><p>The goal of this game is to make Useless Machines! (I would suggest looking it up if you don't know what those are)</p>\n<p>Controls: Hold \"Q\" to open the Radial and select different elements. Each element does something different:</p>\n<p>Wires: Use wires by connecting them to a power source (such as a switch or a button, or another wire), then place the other end of the wire where you want to place the component you want to power. The wire will then transmit power from the source to the connected component.<br/></p>\n<p>Cannons: When connected to a wire, cannons will fire off a cannonball when powered. These cannonballs will bounce off most elements and can also flip switches and press buttons.<br/></p>\n<p>Pushers: Pushers will extend, flipping switches, and pressing buttons.</p>\n<p>Button: These basically act like the main switch, but you can place them as a more mobile power source.</p>\n<p>Eraser: Erases components by left-clicking.</p>\n<p>To put away an components you are holding, simply right-click. To place the component, left click. <br/></p>\n<p>Once you are ready, press the green button at the top of the screen, flipping the switch. hopefully, the machine you constructed will flip the switch back off, officially becoming a useless machine. But if your machine does not work as intended, simply press the button again to reset and continue editing the machine.<br/><br/><br/></p>\n<p>Also, I apologize for the level design as I finished the game at 2 am :)<br/></p>", "metacritic": null, "released": "2021-07-24", "tba": false, "updated": "2021-07-26T07:22:37", "background_image": "https://media.rawg.io/media/screenshots/650/6509a3664e728b6f5e8f5cf6470d01b9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 8, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Hawke Gaming"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}