{"id": 64129, "slug": "monsters-of-kanji", "name": "Monsters of Kanji", "name_original": "Monsters of Kanji", "description": "BE WARNED: This is no real learning software.<br/>There's no explanation of grammar here, you won't even find a KANA-chart.<br/><br/>Instead, this is a journey. Most of all, a journey of imagination. And that imagination COULD lead to learning a lot of stuff.<br/><br/><br/><br/>A WORLD OF MONSTERS<br/><br/>Marty's world is full of dangerous creatures. They might look like certain kanji. They might reflect the components of certain kanji. But seeing those reflections and putting them together will be left to the player. You will get the most out of it, if you have already begun learning japanese.<br/><br/>In it's core, MONSTERS OF KANJI is a very minimalistic RPG, made with RPG MAKER MV.<br/>It tells the story of MARTY's journey into the unknown and it represents my personal journey of learning japanese.<br/>If you decide to play it then, first of all, you should know that everything goes away.<br/><br/>Grab a pen, grab a notebook and start scribbling down everything you see. Make simple maps and put down notes wherever you discover words or kanji or maybe something that has nothing to do with the japanese language at all. Because learning about the world, about cultures, isn't just learning about communication.<br/><br/><br/><br/>When all of this sounds a little too vague for your taste, don't worry - here are the facts:<br/><br/>- 20+ hours of old-school RPG-gameplay<br/>- 1 huge world map with lots of alternate routes and locations, many of which are completely optional<br/>- 6 characters to level up and evolve<br/>- over 15 dangerous bosses<br/>- more than 100 MONSTERS OF KANJI<br/>- 80 hidden MEMORY DISCS that tell the story of the strange world that MARTY lives in.<br/>- over 2000 words to collect and memorize<br/>- the ANCIENT ARCHIVE provides a chance to review every monster, kanji and word that you have found<br/><br/><br/><br/>also part of the adventure: chilling mechanicals sloths, safety-focused robot-owls, one stuttering fox, a giant epic world devouring plant and a hero with a cape.<br/><br/>There's even more, but I wouldn't want to spoil the surprises.<br/>I really hope you will enjoy what is here. If not, let me know. Write me if you have any feedback or ideas, or if you discover any bugs.<br/>This game is a very personal project. It's a work of heart, more than it is a work of art. Please remember this.<br/><br/>---- EARLY GAME VERSION ----<br/>look out for more material including a proper trailer in summer 2018!", "metacritic": null, "released": "2019-05-03", "tba": false, "updated": "2019-08-28T21:55:50", "background_image": "https://media.rawg.io/media/screenshots/5bf/5bfef27d6f32408432f10a18b487d529.jpg", "website": "https://www.sleepy-racoon.de/monsters-of-kanji/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 260, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["sleepy-racoon"], "genres": ["RPG"], "publishers": ["sleepy-racoon"], "esrb_rating": null}