{"id": 6414, "slug": "in-churning-seas", "name": "In Churning Seas", "name_original": "In Churning Seas", "description": "In Churning Seas is a hypnotic, physics-based arcade/puzzle game filled with lore. It features two different game modes which will challenge your ability to quickly make clever decisions under pressure (in &amp;quot;Build&amp;quot; mode), and to carefully plan the short and long-term consequences of your actions (in &amp;quot;Crystallize&amp;quot; mode).<br/><br/>• &amp;quot;Taken with its beguilingly gentle, offbeat tone, it&amp;#39;s a game that can sap a surprising amount of your time.&amp;quot;<br/>- Pocker Gamer<br/><br/>• &amp;quot;It&amp;#39;s hard to express how wonderful this hypnotic and unusual building/physics game is...&amp;quot;<br/>- Lavender, Touch Arcade Member<br/><br/>• &amp;quot;Impressive graphics and gameplay. It&amp;#39;s a great casual balancing game with a creepy soundtrack. Instantly fell in love with it.&amp;quot;<br/>- Wristtattoo, Touch Arcade Member.<br/><br/>• &amp;quot;Found this game by accident and now it&amp;#39;s one of the best I&amp;#39;ve every played. So much fun and very addictive!&amp;quot;<br/>- BritainGreen on the App Store<br/><br/>In Churning Seas features two game modes &amp;quot;Build&amp;quot; &amp;amp; &amp;quot;Crystallize&amp;quot;:<br/><br/>In &amp;quot;Build mode&amp;quot;, you&amp;#39;ll use your reflexes to cleverly build the highest island possible by staking up random rocks. Using some shapes as levers and others as counterweights, thinking fast, and strategically spending sparse special-effect tokens, your goal is to build a safe, sound structure and climb as high as possible before the ever-rising seas catch up on you.<br/><br/>In &amp;quot;Crystallize mode&amp;quot;, you&amp;#39;ll instead have all the time you need to plan how to use the laws of physics to best combine specifically numbered rocks into their highest possible value. As you progress, the simple rules to crystallize rocks will soon lead to a thrilling tension.<br/><br/>In both cases, please do note that hostile seas are no joke. They will test your sharp reflexes, clever planning, and determination.<br/><br/>• In Churning Seas features five previously unreleased instrumental versions of songs by Nick Grey (​ http://nick-grey.com)<br/><br/>• In Churning Seas is a universal app, it is best played on iPhone 5s and up, as well as iPad Air (2013 model) and up<br/><br/>• Contact us on twitter at @boucastral or by email at boucastral@gmail.com", "metacritic": null, "released": "2015-05-29", "tba": false, "updated": "2019-10-22T14:28:53", "background_image": "https://media.rawg.io/media/screenshots/4b2/4b21f647829686c0698dd16aa147d552.jpeg", "website": "http://inchurningseas.tumblr.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 41, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Rodolphe Gonzales"], "genres": ["Arcade", "Puzzle"], "publishers": ["Rodolphe Gonzales"], "esrb_rating": "Everyone 10+"}