{"id": 641541, "slug": "you-are-not-a-hero", "name": "You are not a Hero!", "name_original": "You are not a Hero!", "description": "<p>Content Warning: Blood (Not much though)</p>\n<p>------</p>\n<p>Controls: W A D or Arrow Keys or Space for jump (A and UPArrow also works for jumping). LeftMouseButton to press buttons. I don't know what the use of jumping is except for using it as an emote.</p>\n<p>------</p>\n<p>You are trapped in an Evil Doctor's, who has a weird accent, bunker and you are a part of his experiment: \"You are not a Hero!!!\". What will you do? Will you let his strange, robotic words influence your actions or will you be a hero with the risk of him getting bored and killing you?</p>\n<p>------</p>\n<p>There are four endings. One of them is a secret ending. Getting some endings are luck-based as the Evil Doctor will maybe get bored by your decisions and kill you. The game will close itself if you get killed. If somebody manages to record a walkthrough for every ending and upload it you can put it in the comments (Sorry, I won't put a link to it here... I changed my mind so you, whoever would make/will make/made, will just have to put it in your comment).</p>\n<p>------</p>\n<p>This game was made for the Bored Pixels Game Jam #8 (2021). I had a ton of fun making this game. I hope you enjoy it!</p>\n<p>Thank you for playing this game. :D</p>\n<p>------</p>\n<p>Notes about Problems:</p>\n<p>1. The game art could look bad (for example some art assets could be blurry). The art isn't actually like that. This game was made to work for both good AND bad computers so the exported project probably has some weird art. Maybe I will somewhen add a new version that has better graphics for better computers.</p>\n<p>2. If you find any bugs/glitches please tell me.</p>\n<p>Thank you for understanding!</p>", "metacritic": null, "released": "2021-07-23", "tba": false, "updated": "2021-07-26T08:59:20", "background_image": "https://media.rawg.io/media/screenshots/f03/f0300ca854b4ba246ba3e4c16bfaf5a2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 30, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Hydro Dev"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}