{"id": 641615, "slug": "coronation-mbdot00", "name": "Coronation (Mbdot00)", "name_original": "Coronation (Mbdot00)", "description": "<p>Become a King/Queen, Hold Council Meetings, Build Castles, Trade and Prosper, Engage in Melee Directional Combat!<br/></p>\n\n<p>Coronation is a Medieval Kingdom Multiplayer Game developed by the creators of The Lordaeron Empires v2.4c Warcraft III custom map.<br/></p>\n<p><em>In our Current Demo, you can:</em></p>\n<ul><li>Gather resources\r\n</li><li>Build a town with a Fortnite-styled building system\r\n</li><li>Trade and hire Villagers or Mercenaries from visiting Merchants\r\n</li><li>Assign Forager, Lumberjack, Miner, Blacksmith jobs to Villagers\r\n</li><li>Give area commands to nearby Villagers\r\n</li><li>Conquer other players' towns and pillage their loot\r\n</li><li>Try to conquer the whole land</li></ul>\n<p><em>More features to be added to the Demo:</em>\n</p>\n<ul><li>Start off as a Peasant and climb the medieval corporate ladder</li><li>Work in medieval job professions such as Farmer, Fisherman, Hunter, Blacksmith, Tailor, Guard...</li><li>Sit and eat cooked food together with NPCs</li><li>Socialize with the villagers and build close relationships</li><li>Buy Land and build your own house with furniture</li><li>Plan parties and celebrate<br/>\n</li><li>Start up businesses such as Taverns, Inns, Restaurant, Shops...</li><li>Become a wealthy Merchant by completing trade contracts and form your own Army to protect your assets from Bandits</li><li>Become a Lord and create new towns to lease the Land for other players to buy</li><li>Become a King/Queen, maintain the Throne and hold Council meetings</li><li>Wage wars with other players</li><li>Conquer the entire land and become Emperor of the whole Kingdom</li></ul>\n\n<p>Here's a list of games that have inspired us:\r\n</p>\n<p><strong>Rust, Mount &amp; Blade Bannerlord, Anno 1404, Total War Medieval 2, Mabinogi, RuneScape, Banished, Tropico 6.</strong>\n</p>\n<p>A little background info about us:\r\n</p>\n<p>My brother and I are working on the game full-time, 12 hours or more on it everyday, using our savings earned from our previous construction engineering jobs. We want to make our dream world a reality, where people experience realistic medieval life.</p>\n<p><strong>Please add the game to your collection! It will be free to play when it's released in August 2021.</strong></p>", "metacritic": null, "released": "2021-07-23", "tba": false, "updated": "2021-07-26T09:21:12", "background_image": "https://media.rawg.io/media/screenshots/e9a/e9a6ac8d0ee09eca8102346a430635d0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 309, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mbdot00"], "genres": ["Adventure", "Strategy"], "publishers": [], "esrb_rating": null}