{"id": 641764, "slug": "retrold", "name": "RETROLD", "name_original": "RETROLD", "description": "If you were killed and, after turning into a ghost, gained the right to do <strong>what you want whenever you want</strong>, what would you do first? Well, in <strong>RETROLD</strong> let's play all the games possible in the best arcade center in the region, don't worry, there's no one watching, you can cut in line ;D<br/><br/>Your mission here is to earn as many points as you can in the available games, so you get tickets and consequently unlock new arcades, has 11 arcades for now (there will be updates in the future), the only unlocked from the begin will be the one I did inspired by the classic Pong (made in 1972), where you control a kind of rectangle that must hit a ball at high speed until your enemy can not hit it back, it's like tennis or ping pong (but simple), later you can play others games inspired by Asteroids, Space Race, Gun Fight, Sea Wolf, Tank, Pac man, Donkey Kong 3, Battle Toads, Space Invaders and Death Race. All games have singleplayer mode and local versus mode (if you want to play with a friend far away from you use Steam Remote Play Together :D)<h3>~BING BONG~</h3><h3>~METEORITES BATTLE~</h3><h3>~GOTTA GO FASTER~</h3><h3>~DON'T SHOOT (OR DIE)~</h3><h3>~(NOT SO) OLD WEST~</h3><h3>~DEEP KABUM~</h3><h3>~RUN MAN RUN~</h3><h3>~WHAT HUNGER!~</h3><h3>~THEY SHALL NOT PASS~</h3><h3>~INSANE FROG~</h3><h3>~WHERE'S THE MONKEY?~</h3>", "metacritic": null, "released": "2021-07-28", "tba": false, "updated": "2021-07-30T03:24:00", "background_image": "https://media.rawg.io/media/screenshots/627/627be49b24902a39904d0b13658458bb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 106, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Bernardo Barreiros Fialho"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Bernardo Barreiros Fialho"], "esrb_rating": null}