{"id": 641715, "slug": "dark-lord-peacemaker", "name": "Dark Lord: Peacemaker", "name_original": "Dark Lord: Peacemaker", "description": "This game is part of The Reanimator Saga. The Reanimator makes her appearance in it and MaouCat Studio's Dice and the Tower of the Reanimator: Glorious Princess, but the stories are independent of each other and can be enjoyed separately.<br/><br/>https://store.steampowered.com/app/1489290/<h3>Gameplay</h3><br/><br/><strong>Create a character.</strong> Customize your race, sex, name, class and non-combat skill. Create a unique protagonist.<br/><br/><strong>Who do you want to venture with?</strong> A human cleric, a dark elf ranger, or an orc defender? Gather a party that's the best for you!<br/><br/><strong>Choices affect the plot.</strong> How you interact with people in neighboring country depends on you, but beware - you may start a war.<br/><br/><strong>Turn-based combat with a focus on teamwork.</strong> Beware classes have their own strengths and weaknesses. Complement each other to win.<h3>Main Characters</h3><br/><br/><br/><strong>Dark Lord</strong><br/>The dark-one monarch who has lived for five hundred years. She is determined to end the perennial struggle between dark ones and humans.<br/><br/><br/><strong>Hero</strong><br/>A descendant of the legendary hero. It is a calling for him to expel dark ones.<br/><br/><br/><strong>Philia the Human Cleric</strong><br/>A cleric of the border sanctuary. She has a dream that one day everyone in the world can be equal.<br/><br/><br/><strong>Venom the Dark Elf Ranger</strong><br/>A dark elf who specializes in swordplay and archery. His close friend was killed by the Hero.<br/><br/><br/><strong>Coyote the Orc Defender</strong><br/>A boy warrior from a tribe. He longed for the acceptance of humans and dark elves.<br/><br/><br/><strong>Sanguine the Reanimator</strong><br/>A master of alchemy and necromancy. She is unscrupulous for her goals.<br/><br/><br/><strong>Bambooblade the Eastern Warrior</strong><br/>The protagonist of MaouCat Studio's Dice and the Tower of the Reanimator: Glorious Princess. He comes from the Silver Kingdom in the Southeast.", "metacritic": null, "released": "2021-07-26", "tba": false, "updated": "2021-07-30T11:35:10", "background_image": "https://media.rawg.io/media/screenshots/233/2338c1ca1c2a2f170badb74e91a9675d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 364, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Sounding Stone", "老奉毊", "MaouCat Studio", "魔王貓工作室"], "genres": ["Adventure", "RPG", "Casual", "Indie"], "publishers": ["Sounding Stone", "老奉毊"], "esrb_rating": null}