{"id": 641761, "slug": "adventures-of-human-being", "name": "Adventures of Human Being", "name_original": "Adventures of Human Being", "description": "You are hurt and running away from armed men who are hell bent on ending you. You escape just in time to a completely new place. Tired and helpless, you wander around. Until you meet a feline stranger who takes care of you as you heal.<br/><br/><br/><br/><br/>You Only Know One Thing, <strong>Kill the King</strong>.<br/><br/><br/><br/><br/>Developing friendship, you find out that the king resides in City 4. Solving a roster of interesting puzzles, with new mechanics introduced in every new city, ride on this adventure.<br/><br/><h3>Features:</h3><ul><li>A simple cohesive <strong>story</strong> keeping the puzzles tied up together.<br/>Each city tells its own tales, introducing new characters with interesting backstories.</li></ul><br/><br/><br/><br/><ul><li>Minimal <strong>choice</strong> structures with crucial consequences.<br/>It is a game with essentially a linear story structure. But on few occasions, a companion character asks you to make a choice, which will later prove to be important.</li></ul><br/><br/><br/><br/><ul><li>Roster of engaging <strong>puzzles</strong> using the mechanics in new and unexpected ways.<br/>Each city introduces a new puzzle mechanic. And every puzzle builds itself on top of the previous ones, increasing the challenge and also keeping it fresh.</li></ul><br/><br/><br/><br/><ul><li><strong>1-bit Pixel Art</strong>.<br/>Which means, to use a set of only two colours throughout the game, including the UI, menus and the cutscenes.</li></ul><br/>", "metacritic": null, "released": "2021-07-28", "tba": false, "updated": "2021-07-30T03:21:50", "background_image": "https://media.rawg.io/media/screenshots/dee/dee39cc0f4ef9810150cb5ee92d4bae1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 102, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC", "macOS"], "developers": ["RK Jain"], "genres": ["Adventure", "Indie"], "publishers": ["RK Jain"], "esrb_rating": null}