{"id": 641787, "slug": "idle-td-heroes-vs-zombies", "name": "Idle TD: Heroes vs Zombies", "name_original": "Idle TD: Heroes vs Zombies", "description": "An endless swarm of evil zombies are invading from The Darkness… it is up to you to stop them! As commander of the Heroes of Light, you’ll defend what’s left of the world in <strong>Idle TD: Heroes vs Zombies</strong>.<br/><br/>This never-ending take on tower defense puts you in charge of powerful Heroes trying to stop evil zombie invaders from reaching The Light. Strategically place allies like Earth Surfer for extra-speedy attacks, or use Light Bringer for heavier damage. And if things get real dicey, just wipe the map clean with a firestorm spell!<br/><br/>Eradicating zombies gives you upgrades to bolster power, speed, and other stats - and the more zombies you obliterate, the more Heroes you’ll unlock. Idle TD: Heroes vs Zombies’s menagerie is filled with awesome heroes, like surfers with guns and fire blowing wizards. Discovering new heroes is part of the fun.<br/><br/>Like any loyal pal, Idle TD: Heroes vs Zombies takes care of itself when you’re away. Come back in a few days to claim offline progress and resources to power up your defenses. Those zombies don’t sleep - but neither do your heroes.<br/><br/><strong>Features:</strong><br/><ul><li> Unlock 40 unique heroes, all of which have different skill sets that make tower synergy crucial to success.<br/></li><li> Strategize by placing up to 10 heroes at a time. Determining the most effective combination of their skills will keep you entertained and speculating for weeks!<br/></li><li> Rotate through several different maps, each of which requires different strategies to defend most efficiently.<br/></li><li> Bi-weekly PvP tournaments give this casual game a competitive edge.<br/></li><li> Discover countless upgrades, research, spells, artifacts, technology, and more to level up with a variety of different resources.<br/></li><li> Several rewarding mini-games such as Zombie Swarms, Grave Diggers, and Evil Scientists.<br/></li><li> Offline progress rewards you even while the game is closed!<br/></li><li> Complete tons of daily missions and achievements.<br/></li><li> Fantasy RPG-based world and classes.<br/></li><li> Non-stop, endless gameplay!</li></ul><br/>Idle TD: Heroes vs Zombies is a perfect blend of the Idle and Tower Defense genres. The game is endless and can mostly play itself without much interaction. However, an immense amount of strategy is required to play efficiently and place well against your peers on the leaderboards. Go on an epic never-ending quest, explore a fantastic world, battle heroes and zombies, and defeat epic bosses in Idle TD: Heroes vs Zombies!", "metacritic": null, "released": "2021-07-29", "tba": false, "updated": "2021-07-30T03:40:44", "background_image": "https://media.rawg.io/media/screenshots/b8b/b8bba04aedf6546fd63e98a90d4da74a.jpg", "website": "https://discord.gg/ebHUWeV", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 24, "ratings_count": 0, "suggestions_count": 299, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["TBiz5270"], "genres": ["Strategy", "Casual", "Indie"], "publishers": ["TBiz5270"], "esrb_rating": null}