{"id": 641749, "slug": "iragon-prologue", "name": "Iragon: Prologue", "name_original": "Iragon: Prologue", "description": "Iragon: Prologue allows you to experience living out a high fantasy adventure where you are in control of your destiny!<br />\nIt is best experienced in VR, but we&#39;ve dedicated an equal amount of care and time to make sure that playing without a VR headset packs just as much of a punch.StoryYou play as Darick, a poor kid from a small village, who won&#39;t let anything stand in the way of his dream of becoming a knight and a hero. Everything changes when you meet a young woman who gets ambushed by soldiers of the Empire.  You must learn to use your magic and journey into a dangerous world on your quest to bring her home safe. Along the way, you will battle enemy soldiers, undead skeletons, and perhaps cross paths with seductive creatures of the frozen land while you unlock new erotic adventures.<br />\nBe the hero, live the story, and go on the adventure of a lifetime while immersing yourself fully in the world of Iragon: Prologue. The story is delivered with motion-captured animations and full voice acting from a professional cast. For those who prefer to just get on with slaying witches and laying bitches, we have also made all the cutscenes and interactions skippable.FeaturesWhether you play in VR or not, you can expect us to deliver:<br />\nA beautiful love interest<br />\nInteractive experiences with your love interest<br />\nDifferent outfits for the love interest<br />\nVoice acting<br />\nMotion captured animations<br />\nA dynamic combat system that features both magic and melee<br />\nDestructible environments<br />\nA dialogue choice system that influences the response you getGameplayThis is not just a story with pretty girls. It&#39;s an adventure! Fight your way through tough enemies, master the elements with your magic, collect loot, upgrade your powers, go on quests, interact with whoever catches your eye. Immerse yourself fully in the world, the characters, and the story of a full-fledged fantasy adventure RPG.</p>", "metacritic": null, "released": "2021-07-27", "tba": false, "updated": "2023-11-08T15:53:35", "background_image": "https://media.rawg.io/media/screenshots/1a8/1a8b1bc9e9a810bc5a584250d662f092.jpg", "website": "http://www.repulse.com/Iragon/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 373, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Repulse"], "genres": ["Adventure", "RPG", "Casual", "Indie"], "publishers": ["SZH"], "esrb_rating": null}