{"id": 641783, "slug": "abomi-nation", "name": "Abomi Nation", "name_original": "Abomi Nation", "description": "<h3>Battle for control of Abomi Nation!</h3>Build your party from over <strong>100 Abomis</strong> to recruit, evolve and master! No two teams will be alike! Inspired by the <strong>Nuzlocke</strong> challenge, Abomi Nation is designed to be extremely <strong>replayable</strong> and <strong>customizable</strong>.<br/><br/><br/><br/>Master a unique <strong>turn-based battle system</strong> that emphasizes <strong>1-on-1 combat</strong>, but allows for <strong>tactics</strong> that impact benched Abomis before they even enter the fray. Unleash <strong>devastating attacks</strong> such as ‘Infernal Blast’ and ‘Quivering Quake’ to <strong>exploit your opponents' weaknesses</strong>, or <strong>rally your own teammates</strong> with moves like ‘Speech!’<br/><br/>Every Abomi possesses <strong>tremendous abilities</strong>. Via their <strong>elemental types</strong> (Neutral, Fire, Water, Ice, Plant, Lightning, Air, and Earth), Abomis in a different time utilized <strong>power</strong> and <strong>strategy</strong> to dominate each other. After becoming civilized, most Abomis tended to forget about their violent history. But, now, as a <strong>powerful threat emerges</strong>, your team will have to <strong>rediscover their powers</strong> and fight for Abomi Nation's safety.<br/><br/><h3>Explore a Nation unique to your playthrough!</h3>Every run of Abomi Nation will <strong>generate a uniquely-shaped island</strong> for your team to traverse, offering up a <strong>different combination</strong> of areas, bosses, and Abomis to recruit <strong>every time you play</strong>! <strong>Replayability</strong> is a main focus of Abomi Nation.<br/><br/>There will always be ways to <strong>tweak your game's settings</strong> to keep each new run <strong>feeling fresh</strong>. Don't worry! If you end up losing all of your Abomis, you can continue your run with <strong>death turned off</strong> at the sacrifice of some rewards. So give it your best shot!<br/><br/><br/><br/><strong>Play at your own pace</strong>! Want to completely <strong>randomize</strong> which Abomis can spawn at any level? Want more <strong>control</strong> over who you add to your team? Want to control whether your team members will <strong>permanently die</strong> in battle or not? You'll have the freedom to play the game in a length and manner that <strong>suits you</strong>.<h3>Watch your team bond!</h3><strong>No two teams will be alike</strong> in Abomi Nation thanks to the myriad of <strong>randomized factors</strong> that go into each run. Abomis have <strong>different personalities</strong> from one another, and this will impact how multiple Abomis <strong>react</strong> to the same situation. As your adventure unfolds, the <strong>bond</strong> between any two Abomis will <strong>grow</strong>, causing them to <strong>behave differently</strong> when their friends are in danger.<br/><br/><br/><br/>Not everything in Abomi Nation is about fighting. Experience <strong>cuteness overload</strong> while you <strong>boost your team’s stats</strong> by eating together, playing <strong>minigames</strong>, and participating in all sorts of <strong>events</strong> offered by friendly townsfolk. It's OK to enjoy some down time in between life-risking battles.<br/><br/><br/>discord.gg/GTzqg2F", "metacritic": null, "released": "2021-07-28", "tba": false, "updated": "2023-04-07T06:10:07", "background_image": "https://media.rawg.io/media/screenshots/785/78581ac19ac3ec6ec62f64357dd7ad70.jpg", "website": "https://www.orangepylongames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 8, "toplay": 2}, "playtime": 0, "achievements_count": 25, "ratings_count": 1, "suggestions_count": 233, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Orange Pylon Games"], "genres": ["RPG", "Strategy", "Indie"], "publishers": ["DANGEN Entertainment"], "esrb_rating": null}