{"id": 641819, "slug": "aplestia-retold", "name": "Aplestia: Retold", "name_original": "Aplestia: Retold", "description": "Aplestia:Retold unravels the story of Britton, Summer, Rover and Marina, four friends that went on their first S Class Quest by mistake! Even though they are still rookie adventurers, they will try their best to tackle on a difficult, gem-related and full of mystery adventure! Follow their steps as they travel on the colorful and gem-monster pested Aplestia island! They will have to find secrets, solve problems, defeat various enemies and complete quests!<br/><br/>For the most part, this adventure will challenge your exploration prowess. Secret rooms, super secret rooms, ancient ruins and hidden places are all there, waiting to be discovered. Be ready to utilize a plethora of skills, spells and permanent stat boosts to maximize your strategy! Epic weapons, armors and rings, unlockable mini-dungeons that will test your wit and powers, shops, side quests and interactive objects and characters! All of that and more are waiting for you on Aplestia:Retold!<br/><br/>Will Britton, Summer, Rover and Marina be able to help the people of the island? Will they put a stop to darkness’ plan? Aplestia:Retold is the remade version of the 2017 game Aplestia and answers all of that and even more. This remade version features double the content, more story, lore and information about the world, technical fixes and better versions of previous mechanics. In addition, many new quests, places to visit and a completely reworked soundtrack are waiting for you to explore them!<br/><br/><br/><ul><li>True Fullscreen mode from the Options<br/></li><li>Choose Window Skins from the Options<br/></li><li>Controller/touch/keyboard/mouse support<br/></li><li>FPS Synchronization option for newer monitors<br/></li><li>Choose your difficulty option<br/></li><li>Quick Combat!<br/></li><li>Colorful, full of gems areas<br/></li><li>6 secret rooms with a visual cue<br/></li><li>10 super secret rooms with little to no clues<br/></li><li>Epic Weapons, Armors and Rings<br/></li><li>Fun and unique characters to interact with<br/></li><li>26 side quests – trackable with a Quest Log<br/></li><li>Virtual Notepad for any note-taking<br/></li><li>Save your progress anywhere you want<br/></li><li>Visible, non-respawning enemy encounters<br/></li><li>Mini-bosses and optional Bosses to challenge your strategy<br/></li><li>28 adventurous music tracks<br/></li><li>Over 12 hours of gameplay, depending on the difficulty and exploration</li></ul><br/>", "metacritic": null, "released": null, "tba": false, "updated": "2021-07-30T04:08:47", "background_image": "https://media.rawg.io/media/screenshots/17e/17eb19204d2a6cf0766bc876ff4f37d0.jpg", "website": "https://orfeasgamestudio.com/our-games/aplestiaretold/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 295, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Orfeas Game Studio"], "genres": ["Adventure", "RPG", "Casual", "Indie"], "publishers": ["Orfeas Game Studio"], "esrb_rating": null}