{"id": 641828, "slug": "dr-livingstone-i-presume-demo", "name": "Dr Livingstone, I Presume? Demo", "name_original": "Dr Livingstone, I Presume? Demo", "description": "The full version of Dr Livingstone, I Presume? is available on GOG.com. You can purchase it here\n\n\n  StoryDuring your long journey through Africa, you return to a friend who asks you for help in a mysterious letter. When you cross the threshold of his home, nothing greets you but a hollow silence. A series of closed doors awaits and you must use all your puzzle-solving skills to find the keys. Go deeper into the house and discover what happened to Dr Livingstone.A sharp mind is the keyYou will face more complex puzzles in every room. But giving up is not an option. \n<br/>\nTake on an increasingly challenging and bizarre house full of puzzles that will take your logical thinking to the limit. Remember that each room is unique and has its secrets. Intuitive interaction with the elements of the environment will allow you to fully immerse yourself in the game. Be thorough, be wise, explore.\n<br/>\n<br/>\n\n  Feel the atmosphere of AfricaAllow yourself to dive into a picturesque world where every texture is hand-painted from the first pixel. The items and patterns in the game carry the spirit of an African-British fusion with a pinch of travel and history. The whole adventure is complemented by music inspired by African culture.\n<br/>\n<br/>\n\n  Narrative adventureLook around. Investigate carefully. There is a story enchanted in objects in many corners of the game, and if you search the house carefully, you will find notes and letters that complete this alternate story about the explorers of Africa. Will you have the opportunity to say famous words?\n<br/>\n<br/>\n\n  Reverse escape roomYour goal is not to run away from the house but to go deeper and deeper. Make your way through all the rooms and find the missing traveller. More and more complicated puzzles will stand in your way. Will the Final Room be the answer to why Livingstone asked for help?\n<br/>\n<br/>", "metacritic": null, "released": "2021-05-31", "tba": false, "updated": "2021-07-30T04:16:46", "background_image": "https://media.rawg.io/media/screenshots/73f/73fb27ba5a0ed2b66f5ce1b6b932d142.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 19, "dropped": 1}, "playtime": 0, "achievements_count": 4, "ratings_count": 2, "suggestions_count": 381, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Vulpesoft"], "genres": [], "publishers": ["Vulpesoft"], "esrb_rating": null}