{"id": 642059, "slug": "knight-of-favonius", "name": "Knight of Favonius", "name_original": "Knight of Favonius", "description": "<p>    </p>\n<p>English : </p>\n<p>In his battle against demons from another world that ends in defeat, the two brothers Felix and Iman must be separated. Ilman must try to save his younger brother Felix who is being held by the demon king in his place. The MC now has the tough task of not only studying and understanding his world, but also finding clues about where his separated sibling is. A world called Kalasan which is divided into 2 regions, namely the human area and the demon world area.</p>\n<p>Indonesia :</p>\n<p>Dalam pertarungannya melawan iblis dari dunia lain dengan hasil berujung kekalahan, dua kakak-beradik felix dan llman pun harus terpisah. Ilman harus berusaha untuk menyelamatkan adiknya yaitu felix yang sedang ditahan oleh raja iblis di tempatnya. Sang MC pun kini punya tugas berat untuk tidak hanya mempelajari dan memahami dunianya, tetapi juga mencari clue dimana posisi saudaranya yang terpisah. Dunia bernama Kalasan yang terbagi atas 2 wilayah yaitu wilayah manusia dan wilayah dunia iblis.   Human land sendiri adalah sebuah wilayah yang dihuni oleh manusia yang sedang berjuang dari jajahan para iblis yang ingin memperluas kekuasaannya. Lantas, konflik seperti apa yang harus dihadapi oleh sang MC di Human Land dan Dark Land? Mampukah ia menyelamatkan adiknya yang disandra? monster seperti apa saja yang ia temui?</p>", "metacritic": null, "released": "2021-07-29", "tba": false, "updated": "2021-07-30T05:30:41", "background_image": "https://media.rawg.io/media/screenshots/8c1/8c1c443dcbdc8f7103e01ae48450cf01.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 53, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["felixcion123"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}