{"id": 642198, "slug": "0312-three-kingdom-chess", "name": "(03/12) Three Kingdom Chess", "name_original": "(03/12) Three Kingdom Chess", "description": "<p>Month 3 of 12\r\n      </p>\n<ul><li>Idea \r\n</li></ul>\n<p>Asymmetrical three player chess game, featuring local hot-seat multiplayer and network multiplayer.</p><p>The HTML5 version can join but not host games. This is due to browser security restrictions.<br/></p>\n<p><strong>Disclaimer:</strong> Do not share your IP address or accept connections with people you do not know and trust. You are responsible for your own network security. This software is provided \"as is,\" without warranty of any kind, express or implied. In no event shall the authors or copyright holders be liable for any claim, damages or other liability, whether in an action of contract, tort or otherwise, arising from, out of or in connection with the software or the use or other dealings in the software.<br/></p>\n<p><strong>Current Rule Set (v0.4.0 Beta)</strong><br/></p>\n<ul><li>First player to checkmate another player wins. Checkmate is calculated on the beginning of the checked player's turn.</li><li>Turn order is blue, red, green.</li><li>Red and green do not have to ally, but are highly encouraged to.</li><li>Pawns move and capture by moving one space forward at a time. Pawns automatically promote to a Queen on crossing the enemy river.</li><li>Knights move one space orthogonal then one space diagonal, jumping over intervening pieces.</li><li>Bishops move on the diagonal for any number of unblocked spaces.</li><li>Rooks move on the orthogonal for any number of unblocked spaces.</li><li>Queens move one space at a time in any direction.</li><li>Kings move one space at a time in any direction but cannot move into check.</li></ul>", "metacritic": null, "released": "2021-07-29", "tba": false, "updated": "2021-07-30T06:10:44", "background_image": "https://media.rawg.io/media/screenshots/09b/09b258f1d7df2c147ee61758e3867c17.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 61, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "Web", "PC", "macOS"], "developers": ["Jack Anderson"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}