{"id": 642252, "slug": "prodigal-itch", "name": "Prodigal (itch)", "name_original": "Prodigal (itch)", "description": "\n<p>Return to your childhood town of Vann's Point in this adventure-puzzle game filled with colorful and heartfelt characters. As the runaway miner Oran, you'll swing your pick-axe through treacherous dungeons in order to prove yourself, collect treasure, help your grandfather's apprentice with his latest masterpiece, and explore the place you once left behind.<br/>  Rebuild your relationships with your childhood friends, and get to know the people who have arrived since you've been gone! Maybe you will even become something more than friends...? Not all the townsfolk are so eager to welcome you back, however. Will you be able to find your place here once more?<br/><br/>Fight your way through multiple dungeons in search of mysterious treasures while solving unique puzzles and fighting bizarre bosses! Get to know some of the townsfolk for special extra dungeons and stories, purchase helpful items at the Potion Shop and Tavern, and maybe even discover some hidden rooms that expand on the mysteries of Vann's Point... Or you can always spend some time gambling at the Crocasino!<br/>Featuring graphics that pay homage to the 8-bit hand-held title of years past and a soundtrack featuring a mixture of chip-tune and instrumentals, this may end up a nostalgic trip both for you and for Oran!</p>\n\n<p>The challenges that stand between you and regaining the favor of the people of Vann's Point are great, but there stands yet more challenges ahead of you! On completing the game once, you have the chance to continue your story a little further! Powerful forces have their eyes on Vann's point, a legend must reawaken, and only YOU can do something about it!<br/>If you choose to start over again, a mysterious figure will offer you the chance to add extra elements to your game that will increase their difficulty. Can you complete the ultimate Four-Altar run? Or perhaps you will see what the Chaos Altar has to offer...?</p>\n<p>The only way to know for sure is to take your first step into <em><strong>Prodigal</strong></em>!<br/></p>\n\r\nCome join our Discord Server to keep up with what we're doing!", "metacritic": null, "released": "2021-07-28", "tba": false, "updated": "2021-07-30T06:24:11", "background_image": "https://media.rawg.io/media/screenshots/cbc/cbc4651ebf96706f604778261cd3c062.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 153, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Colorgrave"], "genres": ["Adventure", "RPG", "Puzzle"], "publishers": [], "esrb_rating": null}