{"id": 642373, "slug": "pacificus", "name": "Pacificus", "name_original": "Pacificus", "description": "<p>The world is in chaos, the surface is crumbling and debris is falling to the ocean floor. The powerful trident has been misplaced and the ocean has been turned upside-down. You play as Pacificus, an ethereal being summoned to the depths by an ancient civilization whose world has been submerged by the waves, and it is your purpose to restore the balance of the ocean. To do this you need to find the lost trident, solve the ancient puzzles to uncover new sections of the deep and take the trident back to its original location. By wielding the power of the trident you can possess sea creatures and fish to aid you in your underwater adventure to restore order to the ocean. </p>\n<p>Pacificus is a single player underwater puzzle adventure game where you use your surroundings as your platforms. Discover the ancient temple ruins in a beautiful underwater world filled with creatures and corals. Be amazed by the ambience of the deep as you roam the ocean and solve the puzzles of the temples.\r\n</p>\n<p>Can you reach the end and place the trident back at its original location, or will the oceans be doomed to remain upside down for eternity?<br/>\n</p>\n<p>The game was created in two weeks in Unreal Engine 4 by a team of seven students at the FutureGames school in Stockholm, Sweden.\r\n</p>\n<p>Game Designers:<br/>Per Hallros<br/>Benjamin Hallberg<br/>Niklas Pålsson<br/>Mikael Owlheart<br/><br/>3D Artists:<br/>Hugo Svedstam<br/>Lolo Lin<br/>Petra Aderlund</p>", "metacritic": null, "released": "2021-07-28", "tba": false, "updated": "2021-07-30T06:58:36", "background_image": "https://media.rawg.io/media/screenshots/b9b/b9bc54cd9c463810595a4574a59c22cb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 157, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["PerHallros"], "genres": ["Adventure", "Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}