{"id": 642356, "slug": "spear-girl", "name": "Spear Girl", "name_original": "Spear Girl", "description": "In a big, pleasant, fruitful and extensive kingdom, known for its great forests, beautiful caves and its dazzling castles… or at least it was. At dawn the year before, an ancient terrifying power had been discovered beneath the realm, capable of shaping and controlling the land, bringing the undead as warriors, and subduing any creature that dared to oppose its command. The Merciful King, seeing his capacity for destruction and inciting evil to the human heart, ordered his three investigators to close their investigations, but they had a different idea.<br/>\n<br/>\r\nUsing the fearsome powers given them, the three subjugated the king and imprisoned him, taking the crown and rulership of the kingdom.<br/>\n<br/>\r\nBy the kindness of the king, the subjects began to rebel, showing not only disapproval but violence against the forces of the army and even the family of the new rulers.<br/>\n<br/>\r\nSeeing no other way out, each of the researchers takes a third of the power and uses it to change the landscapes and serenities of the realm into twisted traps and scatters them with monsters and unholy creatures, and, in fear of each other, splits the realm into three parts so they don't end up fighting each other.<br/>\n<br/>\r\nThe people now live in fear, in the midst of dangers that could annihilate them at any second.<br/>\n<br/>\r\nBut a hope! From the sky, sent by the Gods, a shooting star splits into three parts and falls into three different forests.<br/>\n<br/>\r\nIs this an opportunity to counterattack? Is this the answer to prayer for so many families?<br/>\n<br/>\r\nIt is a risk, however, one you are willing to take.", "metacritic": null, "released": "2021-07-28", "tba": false, "updated": "2022-01-07T03:02:24", "background_image": "https://media.rawg.io/media/screenshots/7fd/7fd3580cc56e611f6fea2639fbb9fefc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 91, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "Linux", "PC", "macOS"], "developers": ["1-Bit Pudding Games", "One Bit Pudding"], "genres": ["Adventure", "Casual", "Indie", "Platformer"], "publishers": ["One Bit Pudding"], "esrb_rating": null}