{"id": 642432, "slug": "dungeons-of-mysteria", "name": "Dungeons of Mysteria (itch)", "name_original": "Dungeons of Mysteria (itch)", "description": "<p>----DOWNLOAD IS FOR DEMO ONLY----<br/>(Final price yet to be determined)</p>\n<p>A procedurally generated Dungeon Crawler set in the newly discovered land of Mysteria, rich in ancient dungeons to explore and loot for epic treasures. Filled with evil monsters, and soon to be filled with the corpses of your characters.</p>\n\n<p>All dungeons, magic scrolls, and weapons are procedurally generated, so keep an eye out because there could always be a better weapon around the next corner.</p>\n\n<p>With full character customization you can create unique and interesting characters for each playthrough, and those characters can become NPC's later.</p>\n\n<p>Loot everything, your goal is to amass 1000 or more gold in order to retire so grab everything, and sell what you don't need. </p>\n<p>Each dungeon contains a special artifact of great value that will boost your gold reserves by a massive amount. </p>\n\n<p>All weapons, scrolls, armor and accessories are procedurally generated so there are thousands of possible items. On top of that there are potions, food, gold, precious gems, and many other items to help you through the dungeon.</p>\n\n<p>Once a character has amassed a thousand or more gold they can retire and open a shop in the forest clearing. Before long you will have a small village that you can visit to prepare for your next dungeon run.</p>\n\n<p>This is Abraham, he retired and opened a Weapon Shop. His dialogue is taken from his adventures when he was being used as a character, for instance the Giant bat he speaks about was the boss he fought in that dungeon. Each npc is unique to each persons game.</p>\n\n<p>When you die you stay dead. Permadeath means you will be starting again from the beginning, but sometimes you leave something behind. Characters that die are buried in the cemetery in the clearing, and sometimes an item will be buried with them that you can reclaim. <br/></p>\n\n\n<p>You will encounter many different monsters on your travels. Over 100 types of monsters are planed to inhabit the dungeons of Mysteria(the list currently stands at over 40) with many different skills, strengths and weaknesses, some of them more dangerous than others.</p>", "metacritic": null, "released": "2021-07-28", "tba": false, "updated": "2021-07-30T07:17:10", "background_image": "https://media.rawg.io/media/screenshots/037/0378da0dc9469155b93f516e4ae480c9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 234, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Grindalf Games"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}