{"id": 642415, "slug": "freddy-in-space-2", "name": "Freddy In Space 2", "name_original": "Freddy In Space 2", "description": "Try On GameJolt\r\n<p>Freddy is back... in space! Every good horror series inevitably goes to space, but how many of them go back for a second round?\r\n</p>\n<p>When Freddy leaves the lunar base on a deep-space mission, the central computer system is hijacked by the newly installed high-tech computer assistant: L.ogarithmic O.nline LAN-compatible Z.ero-error H.ydraulic A.uxiliary X.ylophone(?), otherwise known as L.O.L.Z.H.A.X.\r\n</p>\n<p>LolzHax has brainwashed the other resident space warriors, Bonnie, Chica, Foxy, and that weird gangly space puppet, and has locked Freddy's son outside the station with limited air remaining. Can Freddy rescue his friends, defeat LolzHax, and save his son in time?\r\n</p>\n<p>--------------------------------------------------------------\r\n</p>\n<p>IMPORTANT:  Some people have been having difficulty with the controls in this game. To change the controls at any time, press CTRL+Y to bring up the control menu. From there, click on the X in the keyboard column for player 1; that will let you set the keyboard keys. From here you can also change to joystick mode! :)\r\n</p>\n<p>--------------------------------------------------------------\r\n</p>\n<p>This game was originally designed for the December 3rd, 2019 fundraiser for St. Jude hosted by Game Theory. The live-stream is over now and was a big success. Thank you to everyone who watched and contributed!\r\n</p>\n<p>Even though there are no more donation incentives left in the game and its purpose has been fulfilled, hopefully you can all still find a lot of fun and replayability in this game! So please download and enjoy! It was a lot of fun to make.</p>", "metacritic": null, "released": "2021-07-28", "tba": false, "updated": "2021-07-30T07:12:39", "background_image": "https://media.rawg.io/media/screenshots/20b/20b837388e437cd5031cb25472366c42.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 251, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Scott Cawthon"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}