{"id": 642430, "slug": "youll-be-frustated", "name": "You'll Be Frustated", "name_original": "You'll Be Frustated", "description": "<p>Hi! I am Sayantan. I am just a 21 years old VR game enthusiast. I always wanted to purchase a real VR headset after I tried Google Cardboard VR. Since VR headsets are overpriced in my country, i.e., India and I had no savings (as I am still a college student of Physics), that dream of having a VR headset got real after two years.</p><p>After playing a few games on VR, I wanted to know more about developing games. I had basic knowledge of Coding as it was my optional subject in High School. Still, it was not enough to create a VR Game. I started learning about Unity and OpenXR and grasped it after two months of extensive research on YouTube and GitHub.</p><p>I had no plans of creating this game. I was just seeing whether I was able to successfully develop a locomotion system and grabbing system on VR. I have had another idea to create a much more entertaining game on Indian Mythology. But, after my locomotion system worked, I thought of creating this mini puzzle game just to try out things. </p><p>I gave this to some of my beta testers and they said that it was good enough to be listed on stores. Since all good things comes with a cost, I am charging just $ 4.99 for it. If this game sells (though beta testers are praising my creation, I am a bit skeptical about it as all developers should be), it will a great help to me in creating the next big game about Indian Mythology.</p><p>I will update this game too with more puzzle levels as days pass.</p><p>(I will refund your money if you do not like the game after purchasing, just drop an email at rnsproductions@gmail.com)</p>", "metacritic": null, "released": "2021-07-28", "tba": false, "updated": "2021-07-30T07:16:32", "background_image": "https://media.rawg.io/media/screenshots/adc/adc7d765dceacaa5f19f5c953e32f921.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 77, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["rnsproductions"], "genres": ["Strategy", "Puzzle"], "publishers": [], "esrb_rating": null}