{"id": 642531, "slug": "mabnan", "name": "Mabnan", "name_original": "Mabnan", "description": "Mabnan\r\n<p>O relógio de viagem no tempo foi quebrado após o viajante utilizá-lo várias vezes, de forma que, em sua ultima utilização, envolveu um paradoxo temporal que prendeu o relógio em um local inalcançável, além disso, todos seus poderes foram expelidos e estão espalhados por todo o paradoxo. O viajante agora se encontra preso em um loop infestado por seres mortos-vivos, e precisa reencontrar seus poderes dentro do paradoxo para conseguir recuperar o relógio quebrado e voltar para casa.</p>\n\n<p>\n</p>\r\nObjetivo\r\n<p>Em Mabnan, você está preso dentro de um loop, e será necessário dar várias voltas dentro do paradoxo para encontrar todos os poderes do viajante do tempo. À cada ciclo dentro do paradoxo, os poderes do viajante podem ser adquiridos de maneiras diferentes, de forma que um novo poder lhe permite alcançar o próximo.</p>\r\nMecânicas\r\n<p><strong> Movimentação</strong></p>\n<p>Movimente-se através das setas do teclado, sendo a seta da esquerda e direita para movimentar para os lados e a seta cima para pular.</p>\n<p><strong> Espada</strong></p>\n<p>Após adquirido a espada dentro do jogo, pressione Z para atacar. Não é possível atacar durante o pulo.</p>\n<p><strong> Salto duplo</strong></p>\n<p>O salto duplo permite que seu personagem possa pular mais uma vez durante o pulo normal.</p>\n<p><strong> Velocidade</strong></p>\n<p>A super velocidade permitem que seu personagem se movimente mais rápido enquanto a tecla X está pressionada no teclado. Isso também influencia na distância do seu pulo.</p>\n<p><strong> Explosão</strong></p>\n<p>Emite uma explosão que destrói obstáculos ao seu redor ao pressionar a tecla C. Durante a execução não é possível se movimentar. É necessário recarregar esse poder se quiser utilizá-lo novamente.</p>\n<p><strong> Crucifixo</strong></p>\n<p>As vezes, a morte é a única saída.</p>\n<p><strong> Relógio</strong></p>\n<p>Manipula o tempo ao seu redor.</p>\n<p><strong> Inimigos</strong></p>\n<p>Tenha cuidado ao encontrar um ser morto-vivo. Eles lhe atacarão e você será levado ao início do paradoxo caso seja atingindo por seus ataques ou caso você toque neles. Mortos-vivos nunca morrem!</p>\r\nGame Assets\r\n\n<p>Apesar de ter sido feito em pouco tempo, esse projeto demorou bastante para ser desenvolvido e todos os sprites foram feitos com muito carinho. Por isso, estou disponibilizando aqui todos os game assets do jogo, desde os sprites até o próprio link de download do projeto do Construct 3 para você estudar caso queira.\r\n</p>\n<p>Download de todo game assets:</p>\n<p>https://conradosaud.itch.io/mabnan-game-assets<br/></p><p>Exceto pelas músicas (que são free copyright), todos os sprites e imagens são de minha autoria e você pode utilizá-los a vontade :)</p>\n<p>Divirta-se!</p>\r\nConsiderações Finais\r\n<p>Mabnan é o segundo jogo que faço para a game jam \"Game Jaaj\", sendo o primeiro jogo participante da Game Jaaj 5 chamado Torre dos Mortos, que possui um tema bem diferente e em 3D. Você pode baixar gratuitamente aqui:\r\n</p>\n<p>https://gamejolt.com/games/torre_dos_mortos/574423\r\n</p>\n<p>O Mabnan foi desenvolvido no Construct 3 em sua versão gratuita, o que tornou o desenvolvimento do jogo bem limitado próximo ao final do desenvolvimento. Alguns bugs e outras imperfeições não puderem ser corrigidas por conta da versão free limitar o número de eventos possíveis no jogo, então peço desculpas caso você tenha jogado e sentiu que algo ficou faltando ou que pudesse ser melhor de outro jeito.</p>\n\r\nDetonado\r\n<p>Caso sinta-se perdido durante o jogo, essa sessão de detonado explica como finalizar o game.<br/></p>\n<p><strong>ATENÇÃO: CONTEM SPOILER</strong><br/></p>\n<ol><li>Pegue a espada. Ela está logo no centro do mapa na parte de baixo, após utilizar a plataforma elevadiça.</li><li>Consiga o pulo duplo. Para conseguir o pulo duplo é necessário derrotar 6 inimigos com sua espada.</li><li>Libere a super velocidade. Você poderá liberar a super velocidade no mesmo lugar onde você pegou a espada, porém, dessa vez é possível pular mais alto para subir na plataforma superior. Após subir na plataforma, tente realizar o pulo duplo para a direita e alcançar a nova parte do mapa que antes não era possível.</li><li>Obtenha a explosão. Suba no pedaço de mapa que há logo no começo do jogo, e então, mantenha X pressionado enquanto corre para a direita e realiza o pulo duplo, alcançando assim uma nova área do mapa, lá está a explosão. Pressione C para explodir o chão e ser liberado.</li><li>Pegue o crucifixo. Na parte inferior direita do mapa, onde está o último inimigo, há um pedaço de chão quebradiço. Utilize a explosão para quebrá-lo e pegar o crucifixo. Caso não tenha mais cargas de explosão, repita o passo 4 novamente.</li><li>Morra e volte no tempo. Com o crucifixo obtido, agora é necessário morrer para qualquer inimigo e ser levado ao cemitério. Uma vez no cemitério, seus poderes desaparecerão, então será necessário evitar os inimigos e chegar até o final do mapa onde está o relógio que lhe permitirá voltar no tempo, antes de ter sido morto.</li><li>Finalize o jogo obtendo o relógio quebrado. Agora, com a parte direita do mapa bloqueada, você precisará contorná-lo uma última vez e encontrar o relógio no final do mapa. Ao tocar no relógio, você voltará no tempo, para o começo do jogo, onde a barreira que impedia você de pegar o relógio quebrado não existia, porém agora com seus poderes você poderá utilizar o pulo duplo para alcançá-lo, quebrar o paradoxo e chegar ao final do jogo.</li></ol>", "metacritic": null, "released": "2021-07-27", "tba": false, "updated": "2021-07-30T07:41:58", "background_image": "https://media.rawg.io/media/screenshots/6d6/6d63eeac7d76373f7bdc03c97f9b2652.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 97, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Conrado Saud"], "genres": ["Adventure", "Platformer"], "publishers": [], "esrb_rating": null}