{"id": 642669, "slug": "petualangan-kucing-wibu", "name": "Petualangan Kucing Wibu", "name_original": "Petualangan Kucing Wibu", "description": "<p> Game Perjalanan Kucing Wibu adalah permainan platform 2D yang memiliki alur cerita dan dipenuhi dengan berbagai rintangan yang akan membuat mental kamu melemah. </p>\n<p>______________________________ </p>\n<p> *Fitur Permainan*</p>\n<p> + Terdapat berbagai rintangan dan lokasi yang berbeda,</p>\n<p> + Terdapat 2 bahasa Indonesia - Inggris,</p>\n<p> + Kontrol yang mudah, </p>\n<p>+ Milikilah berbagai Skin Karakter yang menarik,</p>\n<p> + Penggunaan Iklan, yang memberikan kita hadiah,</p>\n<p> + Gunakanlah Kode Cheat, dan jadilah Pro, </p>\n<p>+ Menggunakan berbagai efek particle system yang keren,</p>\n<p> + Terdapat beberapa Cut Scene, yang memperlihatkan alur cerita.  ______________________________ </p>\n<p> *Alur Cerita* </p>\n<p>Kucing Wibu Mencari Keadilan . </p>\n<p>Dahulu kala terdapat seekor kucing jantan yang lucu, gagah dan imut, dan dalam keadaan apapun Ia selalu tersenyum manis bersama wajah lucunya, dan ketika dia beranjak dewasa, Ia salah masuk pergaulan, dan akhirnya Ia mempunyai impian menjadi seorang Dokter Bidan atau Dokter Kandungan. </p>\n<p> Lalu karena si kucing bingung harus memulainya bagaimana, jadi dia meminta bantuan kepada para manusia agar membantunya untuk menjadi Dokter Bidan, tapi setiap kali manusia ingin membantu, Khususnya Para YOUTUBER GAMING, mereka bukannya membantunya, tapi malah membuat keadaannya semakin memburuk, dengan sering menjatuhkan kucing tersebut dan mengejek wajah lucu kucing tersebut, yang akhirnya mental si kucing down dan mengurung diri sendirian,dan Ia menjadi WIBU sejati yang suka Mikey. </p>\n<p> Tapi suatu hari, ketika Ia keluar dari kediamannya, Ia malah melihat seorang kucing yang sedang mengalami apa yang dulu Ia pernah rasakan, tapi saat Ia ingin menolongnya, Ia sudah terlambat :( </p>\n<p> Akhirnya Ia menjadi sangat marah dan mentalnya kembali menjadi lebih kuat lagi, sampai Dia Berubah dan Berevolusi dan Bermutasi dan Berproduksi menjadi Seekor KUCING 6pack. Lalu Ia Memlingkarankan Tekad untuk meminta keadilan kepada Para Manusia, Khususnya YOUTUBER GAMING yang sering mengejek Kucing Lucu tersebut. </p>\n<p> Ingin Tahu Akhir Dari Cerita si Kucing 6pack yang Lucu ini ??? Ayo mainkan gamenya dan bantu kucing mendapatkan keadilannyaaa !!!!</p>\n<p>______________________________ </p>\n<p> *NOTE* </p>\n<p>Jangan bermain jika : </p>\n<p>- Mental Kalian Lemah,</p>\n<p>- Memiliki Darah Tinggi, </p>\n<p>- Sering Tosik dan bermain didepan Orang Tua, </p>\n<p>______________________________</p>\n\n<p> Jika versi tidak kompetible, kalian dapat mendownloadnya di </p>\n<p> Website : http://www.mygamedevelopment.epizy.com/daftarGame.html </p>\n\n<p> Dan jika ingin bertanya, atau mengejek dan sebagainya, kalian bisa hubungi kami disini:</p>\n<p>Instagram : https://www.instagram.com/agapegames</p>\n<p>Youtube https://www.youtube.com/channel/UC3X69Ao8Qj9uV3H-2JgScJA</p>", "metacritic": null, "released": "2021-07-27", "tba": false, "updated": "2021-07-30T08:20:19", "background_image": "https://media.rawg.io/media/screenshots/e0d/e0dc9bd3029f07aa9054c8b2a2c679d0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 17, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Agape Games"], "genres": ["Adventure", "Platformer"], "publishers": [], "esrb_rating": null}