{"id": 642702, "slug": "mais-ma-reine-mais-ma-reine", "name": "Mais Ma Reine (Mais Ma Reine)", "name_original": "Mais Ma Reine (Mais Ma Reine)", "description": "<p>Once upon a time in a far far, very far trust me, universe lived a Queen and her King. We actually don’t really know the specifics, but it’s not relevant to the story. Unfortunately their household didn’t get on well.<br/></p>\n\n<p>His Majesty “Le Roi” had forbidden the Queen to raise an army and use her power over the Kingdom. Between you and me he wasn’t that nice with her. Her Majesty “La Reine”, to escape the tyranny of her husband, decided to flee the castle.</p>\n<p>Loyal subjects and glory, this is what the Queen is seeking. To carry out this venture, the player shall have to go on a journey going from land to land in order to build an army and overthrow the King.</p>\n\n<p>But a far bigger threat, that we’re gonna call “La Calamité” will jeopardise the squabbles of the Royal Couple and threaten the entire Kingdom. And that’s where the epic tale of our Queen shall begin.</p>\n\n<p>Mais Ma Reine is a 2D tactical RPG narrative game. You will play as La Reine, the Queen of the kingdom, trying prove to the King that she is as capable to rule as he is.</p>\n<p>You'll have to recruit new subjects called \"Fidèles\" in order to defeat enemies and successfully complete your quests throughout all the territories. Grab and move them to stategic locations and interact with other characters!</p>\n\n<p>Team : Armand Gémeux / Lena Brasseau / Andréa Birman / Raphaël Bureau / </p>\n<p>Eva Lecocq</p>\n<p>Developed at E-artsup Bordeaux during our final year.</p>", "metacritic": null, "released": "2021-07-27", "tba": false, "updated": "2021-07-30T08:29:10", "background_image": "https://media.rawg.io/media/screenshots/42f/42feb240d85e5f35edc73880165d7153.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 115, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mais Ma Reine"], "genres": ["Adventure", "Strategy"], "publishers": [], "esrb_rating": null}