{"id": 64275, "slug": "dyo", "name": "DYO", "name_original": "DYO", "description": "DYO is an award-winning local co-op puzzle platformer for one or two players in which you navigate two Minotaurs through a seemingly impassable maze and solve mind-bending puzzles. Each Minotaur is trapped in their half of the split screen – but only in a combined effort can they escape the cursed labyrinth.<br/><br/><br/><br/>In this impossible maze, you can merge both halves of the split screen into one and thus hop from one side of the screen over to the other. Use this ability to your advantage! It’s up to you to rearrange and manipulate the level structures of 30 carefully crafted levels in order to carve out a path to the exit. Many have tried to figure out the numerous mind-boggling challenges hidden in the depths of this cursed labyrinth. Will you be the first to solve them?<br/><br/>Team DYODYO started out as a holiday project of four Game Design students in 2014. Since then, DYO has come a long way: It’s 2018 and – after winning several awards and having been exhibited all over the world – DYO is now finally available on Steam. So grab a copy, grab a friend and get ready for 30 levels of mind-bending puzzle action!Features<ul><li>Good old local co-op fun for 1 or 2 players.<br/></li><li>Merge and split your screens to manipulate the level around you.<br/></li><li>No precision platforming. No enemies. No timers. Just you and your brains.<br/></li><li>30 levels (3-4 hours of playtime) of mind-bending puzzles and more to come.<br/></li><li>Find multiple solutions to each level (some of which not even the devs might know of).<br/></li><li>Don't have two controllers to play with your friend? You can also play on one shared controller!</li></ul>RecommendationFor the best DYO experience, we recommend playing with a friend!", "metacritic": null, "released": "2018-02-13", "tba": false, "updated": "2023-12-10T15:45:07", "background_image": "https://media.rawg.io/media/screenshots/17c/17c827c9988fa6d514a1d76c5928f238.jpg", "website": "http://www.teamdyo.com", "rating": 3.75, "rating_top": 4, "added_by_status": {"yet": 10, "owned": 284, "beaten": 9, "toplay": 1, "dropped": 8, "playing": 1}, "playtime": 1, "achievements_count": 7, "ratings_count": 20, "suggestions_count": 239, "game_series_count": 0, "reviews_count": 20, "platforms": ["PC"], "developers": ["Team DYO"], "genres": ["Indie"], "publishers": ["Team DYO"], "esrb_rating": null}