{"id": 642775, "slug": "boxwindow", "name": "Boxwindow", "name_original": "Boxwindow", "description": "<p>You are a brightly colored box. Dodge faintly colored boxes for as long as you can and hope to get a high score!<br/>Use WASD, F to select menu stuff and R to reset.<br/>Oh, and if you get to the top of the screen all currently placed boxes are destroyed. Hooray! <br/></p>\n\n<p>This game was made with the goal of being fun with as little flashiness as possible. No sounds, no animations,  heck, no real colors either. It also has a microscopically small file size of 1mb, so if you can read this description the game has probably loaded already. <br/>Essentially, it's the idea of making a Minimum Viable Product stand into a fully enjoyable time waster in its own right.<br/></p>\n<p>However, there are still issues that will hopefully get ironed someday:<br/>- Lack of arrow key support. Oh, the horror of AZERTY players...<br/>- Being crushed by a grey box lacks impact and looks glitchy. Might make it slowly sink/squish behind the grey box instead of \"phasing into the position\".<br/>- Limited to 4:3 aspect ratio...? In 2021...?<br/>- Blurry text? Oh yeah, Bitmap text. <br/>- Questionable cover image.<br/>- Broken fullscreen!? And the default resolution is 480p!? (It's because I use a 768p screen, so the game looks alright to me)<br/>- No mobile controls!?!?</p>\n<p>Well, that's it. Let me know if the game's fun enough, or not.<br/>And feel free to throw suggestions! <br/></p>", "metacritic": null, "released": "2021-07-27", "tba": false, "updated": "2021-07-30T08:50:21", "background_image": "https://media.rawg.io/media/screenshots/896/896413061b8cfaf436823c6b2949de90.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 1, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["MSH"], "genres": ["Action"], "publishers": [], "esrb_rating": null}