{"id": 642715, "slug": "growing-trends", "name": "Growing Trends", "name_original": "Growing Trends", "description": "<p>Follow the development and discussion over at Weight Gaming</p>\n<p>A snafu somewhere in the timeline of human history has led to an alternate reality. People now strive to become bigger, better versions of themselves, and they seek to outdo each other to increase their social standing. The entertainment industry has found new ways to capitalize off of the growing figures of the general population through televising eating contests, casting actors with… larger bodies, and now with their latest endeavor, bringing talented belly-idols into the spotlight! Now, take part in the adventures of a perpetually hungry girl in:\r\n</p>\n<p><strong>GROWING TRENDS</strong>\n</p>\n<p>Our story follows the adventures of Amy and Emily, who enroll in an academy specializing in teaching girls how to become belly-idols! Join them in their day-to-day life as they train to reach new heights and capacities in this bizarre career that has emerged from this new society!\r\n</p>\n<p>Despite being developed in RPG Maker, there will be very little, if any, traditional turn-based RPG combat present in the game. Instead, players will duel with characters and NPCs in “shows”, where they will try to impress a panel of judges using their style, growing figures, and poses. These duels will be rhythm-based battles, much in the style of games such as DDR or Friday Night Funkin’.\r\n</p>\n<p>-------------</p>\n<p><strong>Currently looking for artists!</strong>\r\nIf you’d like to volunteer your services, that would be much appreciated! If you think that you can deliver work on a schedule (and have time slots available for a <em>lot</em> of assets) <strong>I’d also be more than happy to commission art from you!</strong>\n</p>\n<p><strong>This game is very much still in very early stages of development, and ideas for fleshing out the world such as side quests, locations, etc. would all be very helpful! I am but one person, and as much as I like to dream up new ideas, my imagination can only stretch so far lol</strong>\n</p>\n<p>I’ll be posting releases bi-weekly, starting in 5 days from this post. The first build will be simply a barebones look at the starting environment, with some interactable objects and a few NPCs. All sprites/art assets at this stage are placeholders as I look for artists to work on assets and also develop characters sprites on my own (although help would be much appreciated on this front as well).\r\n</p>\n<p>Please let me know what you think, every idea or criticism goes far in helping to develop and flesh out (pun intended) a game like this.\r\n</p>\n<p>Cheers!</p>", "metacritic": null, "released": "2021-07-27", "tba": false, "updated": "2021-07-30T08:31:46", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["humblesasquatch"], "genres": [], "publishers": [], "esrb_rating": null}