{"id": 642813, "slug": "qliphot", "name": "Qliphot", "name_original": "Qliphot", "description": "<p>Hi! And thank you for checking out Qliphot!</p>\n<p>Qliphot is an Action-Adventure RPG much like the top-down Zelda games I grew up loving. I've added a bit a more modern, PC-based control scheme, where the character attacks and looks at your Mouse Pointer, while moving with WASD. <br/></p>\n<p>A word of caution, and probably of bit of self-excusing: This project is in its very early stages. I am a Game Designer at heart, so visual assets are mostly things I bought in Unity's Asset store, there's no save yet, and some sounds and graphics I borrowed from games to illustrate. I will work on replacing these very soon (All games are properly credited).</p>\n<p>However, I want to hear from you: What you think about it, what you don't like, what you imagine I could do with the systems... All feedback more than welcome!</p>\n<p>Thank you so much for playing!<br/></p>\n\n\n\n<p>All music made by Winterquilt, a friend and extremely talented musician who encouraged me to upload this demo with his support and enthusiasm for the project!</p>\n<p>Twitter</p>\n<p>IG<br/></p>\n<p>Bandcamp<br/></p>\n<p>Spotify</p>\n\n<p>Cover art made by Michael from LIMINAL GARDEN. Check out his art, he does some wonderful art for different albums and owns a Vaporwave label filled with great talent! </p>\n\n\n<p><em>PS: If you're an artist, or a programmer, and this project vibes with you, please feel free to contact me and we can talk about working on this project together! Right now, this prototype is a proof of concept, but I want to pitch it to real publishers or maybe Kickstart it in the future!</em>\n</p>\n<p><em>Email me at: sebastiancova@gmail.com</em>\n</p>", "metacritic": null, "released": "2021-07-26", "tba": false, "updated": "2021-07-30T08:59:35", "background_image": "https://media.rawg.io/media/screenshots/000/000d16112217b2bd7e002f4ea850887d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 110, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Negimagi"], "genres": ["Action", "Adventure", "RPG"], "publishers": [], "esrb_rating": null}