{"id": 642846, "slug": "roundellos", "name": "Roundellos", "name_original": "Roundellos", "description": "<p>Updated version with some bugfixes now available: https://chronodile.itch.io/roundellos-prototype-11</p><p>In Roundellos, you have to quickly serve customers their orders to earn points and win the game! This is a prototype so it's more of a proof of concept than anything else at the moment...but there is a game, and it can be won!<br/></p>\n\n<p>INTRODUCTION</p>\n<p>Hi! I'm Chronodile, and this is Roundellos, a prototype game made for the Pridetharian Jam 2021! It's also the first game I've ever made!</p>\n<p>You can find out more about the jam at https://itch.io/jam/pridetharian21 .</p>\n<p>The jam was ran by Pythar, a Twitch streamer at https://twitch.tv/pythar</p>\n<p>I also stream on Twitch! Catch my streams (which sometimes maybe will involve gamedev...) at https://twitch.tv/chronodile</p>\n<p>CONTROLS</p>\n<p>WASD to move</p>\n<p>Mouse to look around</p>\n<p>E to collect donut box / collect donuts / discard donuts / serve customers</p>\n<p>Q to invite a customer into the shop</p>\n<p>GAMEPLAY</p>\n<p>Bring customers into the shop and serve them quickly!</p>\n<p>When customers arrive, they'll give you their order in the top right corner of the screen. Grab a donut box from the crate on the left, and then collect the required donuts from the cardboard boxes around the cafe. Once you've got the customer's order prepared, walk up to the customer and serve them.</p>\n<p>You don't have to match the order the customer's donuts are in - you just need to have the same (e.g. if the customer's order is pear, plum, pear, you can collect the donuts as pear, pear, plum and still win!)</p>\n<p>If you make a mistake, don't worry; you can throw the donuts away at the bin and start again!</p>\n<p>Serve customers quickly to earn money, but be careful - if you're too slow, the customer will leave! Every time you serve a customer successfully, the next customer will wait for a shorter time! If three customers leave, it's game over!</p>", "metacritic": null, "released": "2021-07-26", "tba": false, "updated": "2021-07-30T09:11:55", "background_image": "https://media.rawg.io/media/screenshots/a88/a880f947d5f6331ed28f24f026a6be17.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 18, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["chronodile"], "genres": [], "publishers": [], "esrb_rating": null}