{"id": 642890, "slug": "battle-for-sol", "name": "BATTLE FOR SOL", "name_original": "BATTLE FOR SOL", "description": "<p>You are humanity's last defense against a brutal unknown alien attacker.  One year ago, scientists on Earth picked up a strange signal originating from deep within the Kuiper Belt. The initial excitement that came with the discovery that we are not alone, however, was soon quelled when radar systems stationed in orbit of Pluto observed a large mass heading towards Titan. The humble colonies of Saturn’s gem were defenseless against the attack. Millions died that day. One by one, the colonies of Man were wiped out until all that was left standing was Earth. Our weapons were rendered useless against their advanced technology, but after managing to capture one of their fighters, the best of humanity worked tirelessly to reverse engineer their machines of war. Today, after outfitting what was left of Humanity’s forces with highly advanced fighters, the Battle for Sol begins.<br/></p>\n<p>Begin the fight by defending Earth from a brutal assault. Once Earth is safe, proceed to Mars and retake what we lost. Finally, head to Saturn and drive the enemy back into the wormhole where they originated.\r\n</p>\n<p>Modifications:</p>\n<p>1) Modified the main menu screen to be more visually stimulating and added moving objects such as asteroids and space stations to make it feel more alive.</p>\n<p>2) Created an original soundtrack for each level including the main menu using FLStudio 20.</p>\n<p>3) Modified each level to give them their own unique feeling that fits the story I created.  </p>\n<p>4) Increased the number of enemies each level and the speed at which your gun shoots to balance out the difficulty. </p>\n<p>5) Added in spawners so that all the enemies don't just appear at once.</p>\n<p>6) Changed the texture of the asteroid barrier to instead be a field of debris.</p>\n<p>7) Added instructions to the instructions tab in the main menu.</p>\n<p>Credits:</p>\n<p>Created by Jack Hodges</p>\n<p>Used FL Studio 20 to create the soundtrack</p>", "metacritic": null, "released": "2021-07-26", "tba": false, "updated": "2021-07-30T09:22:33", "background_image": "https://media.rawg.io/media/screenshots/300/300881a36d67afedd9bde873e2773c87.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 79, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["jackfhodges"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}