{"id": 64301, "slug": "reptiloids", "name": "REPTILOIDS", "name_original": "REPTILOIDS", "description": "<strong>‘Reptiloids’ is a super action game about a reptiloids’ alien invasion!</strong><br/><ul><li>The main character stays at the office till late and finds himself in the center of an alien invasion. Reptiloids possess some of the hero's colleagues and try to kill him!</li></ul><br/><ul><li>The main reptiloids’ boss kidnaps the hero’s beloved, you must save her! Neutralize all the reptiloids or just surrender and become one of them.</li></ul><br/><ul><li>To progress successfully through the game, you can use different tactics in close fighting, block punches, dodge, run away, choose your goals, and do other things.</li></ul><br/><ul><li>In ‘Reptiloids’, not only your fists and legs become your weapons but a variety of entourage items, such as movie cameras, fire extinguishers, boomboxes, and a lot of other office items. </li></ul><br/><ul><li>Beware of treacherous reptiloids: they are incredibly powerful with a huge amount of health and strong defense.</li></ul><br/><ul><li>If you play successfully, the main character will receive bonuses and additional weapons. But if you play badly, you can lose weapons, health, and any hope of salvation! </li></ul><br/><ul><li>Anyone can turn out to be a reptiloid! Save yourself and your loved ones, stop the alien invasion!</li></ul>", "metacritic": null, "released": "2018-02-07", "tba": false, "updated": "2019-08-28T21:55:37", "background_image": "https://media.rawg.io/media/screenshots/21a/21a7a5bcbd38a7d9af956164b0ea2d5f.jpg", "website": "http://gearguns.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 12}, "playtime": 4, "achievements_count": 20, "ratings_count": 1, "suggestions_count": 400, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Alexey Glinskiy"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Alexey Glinskiy"], "esrb_rating": null}