{"id": 64300, "slug": "gamedevdan-vs-life", "name": "GameDevDan vs Life", "name_original": "GameDevDan vs Life", "description": "50 games in 1 pack, spanning a 10 year career from hobbyist, to novice, to barely competent game designer! GameDevDan vs Life features a whole host of jam games, throwaway projects and - dare I say it - even a few decent titles.<br/><br/>Open up the launcher and play the games in any order you like. Sort from oldest to newest and you'll be looking at the journey of a young man from greasy teenager to slightly-less greasy adult. Alternatively, sort from best to worst and have a go at a few of the pack's hard-hitters such as GMC Jam winner Chickens and Moles or Android smash-hit Gyro Boss (re-imagined for PC).<br/><br/>With games spanning genres from arcade shooter to murder mystery, guitar sim to platform-puzzler, there's something in the pack for every mood. Climb inside the life of GameDevDan - will you come out clean on the other side? There's only one way to find out.<br/><br/><strong>What's Inside?</strong><br/><br/>All 4 games in the Antibody Blast series make an appearance, if smashing up bacteria and viruses is your idea of a fun Friday night then these are the games for you!<br/><br/>Mobile favorites SuperBeanJump, Balloon Festival, Thawed Out, The Mystery of Bockston House and Ring of Fire have garnered hundreds of thousands of downloads between them and now they're bursting onto your PC screen with the same lovable characters and addictive gameplay.<br/><br/>Classic jam games like Chickens and Moles, Papantzin, Radslaughter, Dewey Feed Grogg, Paper Pumpkin Apocalypse, Tiny Panda Barrage, Tiny Pirate Captain and Potato Patch Propaganda give you insight into the mind of a slightly unhinged, tea-fuelled game developer and are all well worth a play or two.<br/><br/>Plus many more including the brand-new and exclusive <strong>Super Jam Land Kart Racing</strong>, featuring characters, locations and items from all of the other games in the pack smashed together into a kart racer full of multiplayer mayhem!", "metacritic": null, "released": "2018-03-15", "tba": false, "updated": "2019-08-28T21:55:37", "background_image": "https://media.rawg.io/media/screenshots/1fb/1fb5afd9d24cb2ce598103274a2fd04f.jpg", "website": "http://chequered.ink/gamedevdan-vs-life", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 146, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Chequered Ink", "GameDevDan"], "genres": ["Casual"], "publishers": ["Chequered Ink"], "esrb_rating": null}