{"id": 643156, "slug": "rejump-boy", "name": "RE:Jump Boy", "name_original": "RE:Jump Boy", "description": "Jump, jump, jump, jump small steps, take a rainbow bath in the last toilet, and you will enter the next level.<h3>How to play:</h3>You can move left and right, jump, and the length of time the jump button is pressed determines the height of your jump, so you don’t need to consider the power storage. The enemy can be trampled to death when falling, if the enemy can be trampled to death. If the wall is allowed to climb, you can slide against the wall. Press the up and down keys to climb the ladder, and the space bar to jump off the ladder.<br/><br/><h3>Features:</h3><ul><li> A refreshing sense of jumping, don’t be careful.<br/></li><li> Rough lines, simple environment, this is a fragrant game.<br/></li><li> Seize the timing, sometimes it takes a little advance or sprint.<br/></li><li>Limited lives cannot die indefinitely. If the number of resurrections is used up, the game is over.<br/></li><li> Pick up 100 gold coins to get a chance to resurrect.<br/></li><li>Not all enemies can be trampled to death.<br/></li><li>Each level has different terrain and mechanisms, so it is important to grasp the timing. </li></ul><br/><strong>In the past year, after participating in the development of several games, my game development technology has further grown, so I re-made the Jump Boy game, re-written the game’s jumping and level mechanism, and made the game The operation is smoother and more reliable, the level rhythm has been redesigned and produced, and the art has been almost completely reproduced. Re:Jump Boy will be a long-term updated version. I will regularly optimize and improve this game. If you have any opinions and suggestions on this game, please leave a message.  </strong>", "metacritic": null, "released": "2021-07-31", "tba": false, "updated": "2021-08-02T02:13:54", "background_image": "https://media.rawg.io/media/screenshots/818/8180f5c317978a4f94153f3ab4981cbb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 74, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["AHui.Game"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["AHui.Game"], "esrb_rating": null}