{"id": 643157, "slug": "an-odd-tale", "name": "An Odd Tale", "name_original": "An Odd Tale", "description": "An Odd Tale is an indie adventure-RPG developed by “Change Studios”—just two nerdy high schoolers.<br/><br/>After discovering a lost government file about a mysterious project, you venture out into the Kingdom to find answers. Discover strange locations, meet interesting people, and try not to laugh at sub-par humor in order to uncover the mysterious history of this fantastical world, all while trying to save the Kingdom from a villain with seemingly limitless power.<br/><br/><strong>KEY FEATURES</strong><h3>Take on a variety of challenges</h3>The Odd Kingdom is constantly changing, and you must adapt to each quest you take on. Switch to first-person to scale mountains with a grappling hook, fine-tune your movement to navigate past a dungeon’s traps, or even get a top-down perspective to cook in a restaurant.<br/><br/><br/><h3>Explore a lore (and comedy)-rich world</h3>With each place you discover and person you meet, you’ll learn more about the mysterious past of the Odd Kingdom. Each interaction you have will bring you new insights, and laughs.<br/><br/><br/><h3>Customize your combat</h3>From Barbecue Masters to Math Teachers, Pastry Lords to Unicorns, every class has a unique gimmick that changes the way you play. And with a wide-range of weapons to choose from, each with a unique ability, your fighting style can take on any shape.<br/><br/><br/><h3>Be a completionist—well, if you WANT to be…</h3>The “notebook” is your most trusted tool. As you discover more about the Kingdom and the people within it, your notebook will fill up with more and more lore about the world you’re trying to save. Explore every inch of the Kingdom to light “braziers,” which doll out boones of trivia, history, and achievements for each one you find.<br/><br/><br/>", "metacritic": null, "released": "2021-07-31", "tba": false, "updated": "2022-08-30T15:57:57", "background_image": "https://media.rawg.io/media/screenshots/471/471b6b6b726e1152400f8cb427244d80.jpg", "website": "https://changestudios.dev/#aot", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 177, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Change Studios"], "genres": ["Action", "Adventure", "RPG", "Casual", "Indie"], "publishers": ["Change Studios"], "esrb_rating": null}