{"id": 643181, "slug": "tears-of-themis", "name": "Tears of Themis", "name_original": "Tears of Themis", "description": "What seemed to be independent cases slowly begins to link together and form a larger picture.<br/>The hand behind it all has no regards for social order and aims only to destroy all that is decent and good.<br/>As the truth becomes more obscure and shrouded in mystery, the lines between good and evil blurs. With the world against you and the words of reason falling on deaf ears...<br/>Will you still be determined to stand by your choices and beliefs?<br/><br/>Evidence Collection - Search the scene and uncover the truth<br/>Discover delicate evidence and items lying at the crime scene and reveal the truth.<br/>Acquire testimonies from suspects. Analyze and compare their testimonies to <br/>contradicting clues found on them to uncover the key evidence.<br/>Defeat your opponents in the court of law with logic and wits to deliver true justice!<br/><br/>Exquisite Dynamic Illustrations - Learn everything about him<br/>The exquisite Dynamic Illustrations brings cards to life, forever framing your treasured memory with him in vivid detail.<br/>Once a personal story is unlocked, you will begin to receive video calls from your special someone! Indulge in his resonating voice and daily interactions!<br/>Go on dates that will make you melt and experience heart-racing intimate moments. <br/><br/>Precious Memories  - Create cherished memories together<br/>Every character has their unique story arcs that hide his most well-guarded secrets.<br/>Venture deeper into his heart by completing these stories to learn the truth about him, creating memories that belong to just the two of you. <br/><br/>Offical Website：https://tot.mihoyo.com/en-us/<br/>Offical Twitter Account：https://twitter.com/TearsofThemisEN<br/>Offical Facebook Fanpage：https://www.facebook.com/tearsofthemis.glb<br/>Customer Service：totcs_glb@mihoyo.com", "metacritic": null, "released": "2021-07-27", "tba": false, "updated": "2023-10-06T19:04:20", "background_image": "https://media.rawg.io/media/screenshots/848/8488c0f1f549d5919c1d65666f2f21e0.jpg", "website": "https://tot.mihoyo.com/en-us/", "rating": 3.86, "rating_top": 4, "added_by_status": {"yet": 1, "beaten": 1, "dropped": 4, "playing": 4}, "playtime": 0, "achievements_count": 0, "ratings_count": 7, "suggestions_count": 168, "game_series_count": 0, "reviews_count": 7, "platforms": ["iOS"], "developers": ["miHoYo"], "genres": ["RPG", "Simulation"], "publishers": ["miHoYo"], "esrb_rating": "Everyone 10+"}