{"id": 643174, "slug": "blokdokus-space-jewel-blast", "name": "Blokdokus: Space Jewel Blast", "name_original": "Blokdokus: Space Jewel Blast", "description": "Blokdokus: Space Jewel Blast is an exciting game; for one, even though it is based on the game, which is a combination of the classic block puzzles and sudoku, it turns out to be creative in its own way. Gems are placed for each element of blocks. The sparkling jewel blocks make this game more attractive than the others. Refresh your mind and have an exciting free time by playing Blokdokus!<br/><br/>Once you start to play this exciting 9-in-1 block puzzle game, you will definitely become addicted to Blokdokus: Space Jewel Blast. There is no time limit, so you can play as much as you want. This is another example of simple design and simple gameplay making a great app. Drag the blocks and create the complete line in horizontal and vertical, or fill in the 3x3 grids to clear them and aim for the highest score as much as possible. If you can’t fit the given piece anymore, the game is over.   <br/><br/>Besides, the talented developers and game designers have added many great features and graphical effects that spruce up the gameplay. Once you get enough points, you will be rewarded coins to purchase for the powerful boosters, including the hammer and rotate feature. The other highlight is the superb background music. Playing this for a long time will make your mind trippy.<br/>◉ HIGHLIGHT FEATURES<br/>● A perfect combination of Block puzzle &amp; Sudoku<br/>● Sparkling jewel blocks make this game more attractive<br/>● Clear the lines &amp; squares to score<br/>● Beat your high score and challenge other players<br/>● Easily rotate the blocks<br/>● Powerful booster: Use a hammer to destroy a 3x3 grid<br/>● Free &amp; No time limit<br/>● Relaxing &amp; Addictive<br/><br/>Challenge this addictive 9-in-1 puzzle game and blast jewels with the fastest speed. Are you ready to make Blokdokus: Space Jewel Blast one of your favorites and a great stress buster? Get it now for free!<br/><br/>Privacy Policy URL: https://privacy.athena.studio/<br/>Term of Service URL: https://privacy.athena.studio/terms-of-service", "metacritic": null, "released": "2021-07-13", "tba": false, "updated": "2021-08-02T02:24:24", "background_image": "https://media.rawg.io/media/screenshots/c29/c29582042cb618636e5816165616cd62_OSnnGXe.jpg", "website": "https://athena.studio/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 108, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Athena Studio"], "genres": ["Board Games", "Puzzle"], "publishers": ["Athena FZE"], "esrb_rating": "Everyone 10+"}