{"id": 6432, "slug": "micro-machines", "name": "Micro Machines (2016)", "name_original": "Micro Machines (2016)", "description": "The legendary MICRO MACHINES gameplay returns in this all-new multiplayer combat racer from Codemasters!<br/><br/>MASSIVE RACING ON A MICRO SCALE!<br/>Race across 21 fun-filled tracks including breakfast tables, desktops, pool tables and kitchen sinks in a vast array of tiny, but powerful, MICRO MACHINES. <br/><br/>LEGENDARY GAMEPLAY<br/>Original creators, Codemasters, have lovingly updated the classic MICRO MACHINES gameplay for mobile devices. All the rivalry, excitement, humor and fun of the games that first appeared in the 1990’s is back! <br/><br/>GO G.I. JOE<br/>Take to the tracks in seven classic G.I. JOE combat vehicles. Dominate the desks in the H.I.S.S. Tank, try arena combat in the Cobra RAGE or take on toy town with all-conquering Rolling Thunder.  <br/><br/>COLLECT THEM ALL!<br/>Assemble your collection of all 84 vehicles from hot rods to muscle cars, fire trucks, police cars, sports cars, tanks, hovercraft and loads more.<br/><br/>BATTLE WITH NERF!<br/>For the FIRST TIME ever MICRO MACHINES features awesome battle arenas. Pick up real NERF blasters to take down the competition and rule the arena! <br/><br/>LOCK AND LOAD<br/>Enter one of the 3 event types and equip your vehicles with one of the 60+ upgrades from shields to flame throwers, axes and shrink rays.<br/><br/>BECOME A WORLD CHAMPION<br/>Represent your country in solo and Facebook leaderboards or join your friends, work colleagues or team mates and take on the world together!<br/><br/>JOIN OUR CLUB<br/>Join or create your very own MICRO MACHINES club, make your mark on world leaderboards and compete each week to win great prizes and unlock cool customisations.<br/><br/>MICRO MACHINES, HUNGRY HUNGRY HIPPOS, NERF, OUIJA, G.I. JOE and all related characters are trademarks of Hasbro and are used with permission. ©2015 Hasbro. All Rights Reserved.<br/><br/>Important Consumer Information. This app: Requires acceptance of EA&amp;#39;s Privacy &amp;amp; Cookie Policy, TOS and EULA. Includes in-game advertising. Collects data through third party ad serving and analytics technology (see Privacy &amp;amp; Cookie Policy for details). Requires a persistent Internet connection (network fees may apply). Contains direct links to the Internet and social networking sites intended for an audience over 13. Allows players to communicate via Facebook notifications and gifting. To disable see the settings in-game. <br/><br/>Terms of Service : http://terms.ea.com/en<br/>Privacy &amp;amp; Cookie Policy : http://privacy.ea.com/en<br/>EULA : http://tos.ea.com/legalapp/mobileeula/US/en/OTHER/<br/>Visit http://www.chillingo.com/about/game-faqs/ for assistance or inquiries.<br/><br/>EA may retire online features and services after 30 days notice posted on www.ea.com/1/service-updates", "metacritic": null, "released": "2016-07-12", "tba": false, "updated": "2019-10-22T14:28:53", "background_image": "https://media.rawg.io/media/screenshots/f28/f28da6317ee94f6147b18b2cce56a318.jpeg", "website": "https://chillingosupport.zendesk.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "beaten": 2, "playing": 1}, "playtime": 6, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 146, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Big Red Software"], "genres": ["Racing", "Arcade"], "publishers": ["Codemasters", "Chillingo"], "esrb_rating": "Teen"}