{"id": 64337, "slug": "2dgamemanias-taken", "name": "2DGameManias Taken", "name_original": "2DGameManias Taken", "description": "2DGameMania's Taken is a 2.5D retro platform game in which you have been taken by the unknown and you need to fight your way to freedom. <br/>Fight your way through multiple enemy types and obstacles and use your special powers such as the beam weapon which fires bursts of bullets in a 360 motion, laser wipe which will swipe across the screen killing most things in its path and not forgetting your trusty gun which holds different bullet types.<br/><br/>There are lots of collectibles and extra points awarded for killing more enemies, which are then added up after each level.  If you achieve a top 10 score, your score will be recorded along with the amount of time you took to complete the game...especially good for speed-runs.  There are achievements for completing the game in a fast time also.One of the bosses, fight or run? <br/><br/>Four huge levels and bosses. At the end of each level you need to collect the teleporter part and find the teleporter to gain access to the next level within a certain amount of time otherwise a big explosion will come your way!Secrets.  Some are large areas, some are small like this one <br/><br/>Hard difficulty level but rewarding.  Good replay value, lots of hidden areas to find and explore, with varied levels.  Inspired from some of the old classic games from the past, hopefully this game will bring back some memories.Now with music by \"The Cynic Project\"Secret here? Please note you'll have a much better experience playing on Joystick (eg Xbox 360/One or PS4 etc), keys will work but better on Joystick", "metacritic": null, "released": "2018-05-04", "tba": false, "updated": "2022-10-17T16:04:40", "background_image": "https://media.rawg.io/media/screenshots/c9e/c9e4d452879b6ae6bc2b73b368336a4c.jpg", "website": "http://www.2dgamemania.co.uk", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 130, "dropped": 1}, "playtime": 1, "achievements_count": 16, "ratings_count": 2, "suggestions_count": 381, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["2DGameMania"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["2DGameMania"], "esrb_rating": null}