{"id": 64340, "slug": "roa", "name": "RŌA", "name_original": "RŌA", "description": "Few in the world attain to the wordless teaching<br/>and the advantage arising of non-action. -Laozi<br/><br/>RŌA is a short cryptic single-player first-person play on awareness and fugacity.<br/><br/>Somewhere between life and dream, we are an observer of our own experience... Are you playing them? Are they playing you? What does your happiness feel like. What was your first memory. Who has changed you. Restless seekers, bustling, endeavoring, zealously and always busy. Their origin is the same, but their paths are not.<br/><br/><strong>Gameplay</strong><br/>While in many games the beings are eliminated by clicks, in RŌA you put them at rest or awake them again. Choose their pose from a range of options. There are two possible endings. However, the journey is the destination here, a challenge not everyone is ready for. Chasing meaning in the void. Are you open to the uncommon, in wonder watching the stars and chaos, maybe going to museums sometimes? Then the game might be notable for you.<br/><br/><strong>Controls</strong><br/>Classic Mouse&amp;Keyboard or any gamepad to walk and look around. The Screen stays HUD-free. One button is referring to Rest or Awake creatures, another is to clear the screen by Scanning for them.<br/><br/>RŌA\\ro'-a\\n. See also REST (contemporary): ancient tongue for TRANQUILITY, REPOSE: State of inner calm. Also: stillness, silence, peace.", "metacritic": null, "released": "2018-06-02", "tba": false, "updated": "2019-08-28T21:55:34", "background_image": "https://media.rawg.io/media/screenshots/9e9/9e9a37d215d8a0d566ad287707bd403c.jpg", "website": "http://www.arquoia.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 20, "toplay": 1, "dropped": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 284, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["ARQUOIA"], "genres": ["Adventure", "Indie"], "publishers": ["ARQUOIA"], "esrb_rating": null}