{"id": 643717, "slug": "ballistic-mecha-watchbunny-vr", "name": "Ballistic Mecha Watchbunny (VR)", "name_original": "Ballistic Mecha Watchbunny (VR)", "description": "<p><strong>Update: </strong>6 hours after the end of the jam, the first 2 waves are in the game, and the Windows build is now available! More to come.\r\n</p>\n<p>The tortoise and the hare are up to their old rivalries again in this VR mecha defense game. Ever since the hare discovered that the tortoise had spiked its drink with sedatives before the big race, the hare has been protesting this illicit race.<br/></p>\n<p>Now the hare is piloting a mecha bunny, and defending the finish line against the heavily armored tortoise tanks. The hare can also build strategic barricades to help slow down the tortoises. </p>\n\n<p>This is a very rough build and not the complete game. This should give a little taste of the intended experience.<br/><br/><strong>Controls:</strong></p>\n<strong>Action</strong><strong>Control</strong>WalkMove your hands as if you are walking with your hands. The mecha's feet will follow your hands 1:1.Aim/FireAim with your head (look at the reticle). Fire by pressing the trigger on either hand.Place BarricadeSqueeze the side grips on both controllers at the same time to place the barricade in front of you.\r\n\n<p>Install the .APK file on Oculus Quest or Quest 2 with Sidequest. Or run the Windows build with SteamVR or Oculus desktop.<br/></p>\n<p>Made in 3 days for OST Jam Vol. 3.</p>\n<p><em>Music: \"Music To Get A GRIP TO\" by Possums at Twilight.</em></p>", "metacritic": null, "released": "2021-08-01", "tba": false, "updated": "2021-08-02T04:57:52", "background_image": "https://media.rawg.io/media/screenshots/655/655856adf62cb21461526f5408b0e164.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 43, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Android"], "developers": ["andyman404"], "genres": ["Action"], "publishers": [], "esrb_rating": null}