{"id": 643858, "slug": "the-zone-samuelsons-last-letter", "name": "The Zone - Samuelson's Last Letter", "name_original": "The Zone - Samuelson's Last Letter", "description": "<p><strong><em>The phone rings in the middle of the night. A strange package with a letter marked [CLASSIFIED - YOUR EYES ONLY]. You've been chosen for the next expedition into The Zone.</em></strong></p>\n<p><em><strong>Samuelson was the one who chose all the expedition members. Who studied their psychological profiles. Assembled the teams. Sent them in to almost certain death.</strong></em></p>\n<p><em><strong>But you don't all feel the same way about them. Did you love them? Did you hate them? And how do you feel about each other?</strong></em></p>\n<p><em><strong>One day Dr Samuelson got up from their desk, suited up, and walked into The Zone, never to be seen again. They chose you to follow them.</strong></em></p>\n<p><em><strong>They chose you. Why? We'll play to find out</strong></em></p>\n<p><em><strong>That's what we will define for the next 20-30 mins, before we begin to play The Zone</strong></em></p>\n<p><strong>This is an experimental supplement, made in 1 hour for the Story Synth Summer Jam!</strong></p><p> I loved the idea of having a short Descended From The Queen style game you could insert for 15 mins in the middle of character creation, that would add depth to your relationships, and likely create a weird Chekhov's gun in the form of the mysterious Dr Samuelson, whose last act before choosing you was to wander alone into The Zone, never to be seen again—except perhaps... by you.</p><p>Briefly play this game (~20 mins), right after you've picked your characters in a game of The Zone (www.TheZoneRpg.com) to add complications to your backstories and to your relationship with the enigmatic figure you all know as Dr Samuelson.</p>", "metacritic": null, "released": "2021-07-31", "tba": false, "updated": "2021-08-02T05:36:34", "background_image": "https://media.rawg.io/media/screenshots/d97/d97e9d29b2a23da30142186458f33039.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 22, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["raphdamico"], "genres": [], "publishers": [], "esrb_rating": null}