{"id": 643808, "slug": "panic-at-the-picnic", "name": "Panic! At the Picnic", "name_original": "Panic! At the Picnic", "description": "<p>The weather is beautiful, and you've decided to have a picnic! Since you're such a nice person, you invited your pale emo friend to socialize and get some sun. Unfortunately, endless waves of ants have decided they want to join in on the fun.<br/></p>\n<p>Since your emo friend \"seeks pain to feel alive,\" he won't stop eating, even if ants end up on his food! As you might imagine, this could end poorly. Place bug Zappers on the table to prevent the ants from reaching his plate.</p>\n\n<p>Left Click: Place Zapper<br/></p>\n<p>Right Click: Remove Zapper</p>\n<p>Hold Tab: View blocked areas</p>\n<p>Mouse: Scroll wheel to zoom, hover screen edges to move camera</p>\n<p>\"Done\" Button: Start wave without waiting for time</p>\n<p>\"Clear All\" Button: Remove all currently placed towers</p>\n\n<ul><li>The table setup is generated randomly each match.</li><li>You start with 50 health and 10 zappers.</li><li>Each zapper does 1 damage per shot.</li><li>Before each wave, you are given time to place your zappers.</li><li>You may not place towers on top of other towers, the ant hill, the plate, the table edges or off of the table, or in a way that would completely prevent there being a valid path between the ant hill and plate.</li><li>Each wave has a set number of ants, with a set health.</li><li>Ants will follow the shortest path from the anthill to the plate.</li><li>Each ant does 1 damage to you when reaching the plate.</li><li>After each wave, you are given more zappers and time to place them.</li><li>Ants move a little faster each wave, but zappers fire faster at the same proportion. This is to make later waves not take as long.</li><li>Ants gain a speed boost if they have not been hit by a zapper for a few seconds.</li><li>If your health reaches zero, the match is over.</li><li>There is no win condition, just try to complete as many waves as possible!</li></ul>", "metacritic": null, "released": "2021-08-01", "tba": false, "updated": "2021-08-02T05:23:31", "background_image": "https://media.rawg.io/media/screenshots/a6f/a6f80dd4566ed3892e7fc61b127a3e7f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 16, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["clickbaitgames"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}