{"id": 643941, "slug": "in-the-loop-jeffrey-lindsey-secondshow-papercutdoc", "name": "In the Loop (Jeffrey Lindsey, secondshow, papercutdoctor)", "name_original": "In the Loop (Jeffrey Lindsey, secondshow, papercutdoctor)", "description": "<p>In the Loop is a visual novel about friendship and conflict. You play as Payton, a slightly scatterbrained UFO enthusiast. Your friend Rain is angry with you, but you don't remember what you did wrong. Can you resolve the conflict? Can you jog your memory? Can you identify that flying object?</p>\n<p>This game was made entirely within the month of July 2021 as part of the Toadhouse Visual Novel Game Jam 2021.</p>\r\nThis game was made by a team who had never worked together before this month.  I am so very proud of them and what they have managed to accomplish in such a short timeframe.<br/>\r\n- Jeffrey (project lead)\r\n\r\nCredits\r\n<p><strong>Angela Geiss</strong> created all of the music for this game.<br/>\r\nShe created four brilliant tracks, one of which is well-hidden.<br/>\r\nAngela can be found on Twitter as @holyeggshells.</p>\n<p><strong>Anouk van der Sluijs </strong>crafted this story and did the majority of the writing.<br/>\r\nShe also did a lot of editing and tied up loose ends.<br/>\r\nAnouk can be found on Twitter as @papercutdoc.</p>\n<p><strong>Rebecca Lieberwirth</strong> did all of the character art.<br/>\r\nShe crafted the art for these characters from their initial design to their final illustrations.<br/>\r\nBec can be found on Twitter as @straybec.</p>\n<p><strong>Daniel Cruz</strong> provided sound effects.<br/>\r\nDaniel can be found on Twitter as @Mr_DanielC, and online at www.sonicmedley.com.</p>\n<p><strong>Eli Berg-Maas</strong> did a lot of the programming.<br/>\r\nHe set up the source control repository, got everything started with Ren'Py, and implemented a minigame which is hidden in one of the branches.<br/>\r\nEli can be found on Twitter as @rngwrldngnr.</p>\n<p><strong>Jeffrey Lindsey</strong> gathered this team together and made sure everyone knew what they needed to do.<br/>\r\nHe also helped with some of the programming.<br/>\r\nJeffrey can be found on Twitter as @jeffreylindsey.</p>\n<p><strong>Taylor Dryden</strong> created all of the background art.<br/>\r\nShe also wrote all the location descriptions and a bit of dialogue.<br/>\r\nTaylor can be found on Twitter as @lakeffectkids.</p>", "metacritic": null, "released": "2021-07-31", "tba": false, "updated": "2021-08-02T05:59:03", "background_image": "https://media.rawg.io/media/screenshots/be7/be713bf5e178a5a0b362e3f3788e5cda.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 124, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["papercutdoctor", "Jeffrey Lindsey", "secondshow"], "genres": [], "publishers": [], "esrb_rating": null}