{"id": 643986, "slug": "spire-gamble", "name": "Spire Gamble", "name_original": "Spire Gamble", "description": "<p><strong>!!!READ THE GAME RULES BELOW BEFORE PLAYING</strong><strong>!!!<br/></strong></p>\n<p>Spire Gamble is a cardgame best played with a friend, but it can be played against a simple AI. I made the game quite quickly for RNDGAME JAM II.</p>\n\n<p><strong>RULES<br/></strong></p>\n<p>Spire Gamble is played with standard playing cards numbered 1-10, with 9 of them placed face down on the field, with 1 leftover card placed face down beside the field. The goal of the game is to select a straight line of 3 cards (either vertical, horizontal or diagonal) that has a total value that is higher than the total value of the opponent's selected line. The following rules explanation attempts to explain both how to play the game with either physical playing cards, or playing by using the PICO-8 game. The game however will not allow you to make moves that are forbidden by the rules.<br/></p>\n<p>A regular match follows this structure:<br/><br/></p>\n<ol><li>Card flipping phase<ul><li>Players take turns flipping face down cards. Any face down card can be flipped, even the leftover card. Face up cards cannot be flipped.<ul><li>In singleplayer, flipping cards costs money, which is gained back upon winning a match. Losing all of your money results in losing the game.</li></ul></li><li>If no cards can be flipped, the current player must select a line.<ul><li>A player may choose to select a line at any point in the flipping phase, which will move the game into the picking phase.</li></ul></li></ul></li><li>Line picking phase<ul><li>Once either player has selected a line, the player who has yet to select a line can choose to place the leftover card over any face down card on the field, overriding it's value. Doing this will not use up the player's turn, but it cannot be done before one player has already selected a line.</li><li>After choosing whether to place the leftover card or not, the player must choose a line.</li><li>After both players have chosen a line, any face down cards are flipped the count the score.<ul><li>The game announces the winner of the match under the turn counter.</li></ul></li></ul></li></ol>", "metacritic": null, "released": "2021-07-31", "tba": false, "updated": "2021-08-02T06:11:18", "background_image": "https://media.rawg.io/media/screenshots/069/06973e18d9fabd13e3525378a690a36d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["Lunahere"], "genres": [], "publishers": [], "esrb_rating": null}