{"id": 643939, "slug": "the-rpg-engine", "name": "The RPG Engine", "name_original": "The RPG Engine", "description": "Are you bored of playing your TTRPGs using outdated 2D visualisation systems?<br/>\r\nDo you want a more atmospheric way to represent your world and combat scenarios?<br/>\r\nWell look no further!<br/>\n<br/>\r\nFrom intuitive terrain sculpting to item placement and control, to player navigation and animations, The RPG Engine offers a powerful all in one solution to allow for fast and simple building of small interactive maps. With an integrated dice roller, chat system and character control, playing your favourite TTRPG has never been so engaging!<br/>\n<br/>\r\nAs a Game Master you can Create &amp; Manage interactive worlds to effectively tell stories online by:<br/>\r\n - Sculpting and Painting the terrain including overhangs and caves.<br/>\r\n - Fill the world with props and items for the players to discover.<br/>\r\n - Assign control of characters to your players allowing them to freely move and explore your world.<br/>\r\n - Automatically host a server for your friends to join as players.<br/>\r\n - Attach and remove weapons and items from players.<br/>\r\n - Simulate combat scenarios.<br/>\n<br/>\r\nAs a  Player you can: <br/>\r\n - Explore unique custom created worlds with your friends.<br/>\r\n - Be truly immersed in your game master's stories.<br/>\r\n - Control movement and animations of your assigned characters.<br/>\r\n - Visualise and engage in combat scenarios.<br/>\n<br/>\r\nAs a Tool, The RPG Engine can also be used for:<br/>\r\n - Brainstorming<br/>\r\n - Story boarding<br/>\r\n - Visual story telling<br/>\r\n - Level design Prototyping<br/>\n<br/>\r\nPlease note this game is currently in alpha. Some features and visuals do not represent the final look and feel of the game. Please see the discussion  board for planned upcoming features and suggestions.", "metacritic": null, "released": "2021-07-31", "tba": false, "updated": "2023-09-18T15:14:32", "background_image": "https://media.rawg.io/media/screenshots/b76/b76afe77f8263503601e625cd145a4f8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 54, "dropped": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 168, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["The Architect", "PolyDemons"], "genres": ["Adventure", "RPG", "Strategy", "Simulation"], "publishers": ["PolyDemons"], "esrb_rating": null}