{"id": 644008, "slug": "five-nights-at-freddys-2-remaster-dublado", "name": "Five Nights At Freddy's 2 Remaster Dublado", "name_original": "Five Nights At Freddy's 2 Remaster Dublado", "description": "<p>Versão Dublada Em Português Do FNaF 2 Remasterizado, Espero Que Curta :), E Creditos Para o GAMER2603 Por ter Botado a Dublagem No Jogo.</p>\r\nDescrição\r\n<p>Bem-vindo de volta à nova e melhorada Freddy Fazbear's Pizza! Em Five Nights at Freddy's 2, os antigos e envelhecidos animatrônicos são unidos por um novo elenco de personagens. Eles são adequados para crianças, atualizados com a mais recente tecnologia de reconhecimento facial, vinculados a bancos de dados criminais locais e prometem oferecer um show seguro e divertido para crianças e adultos! O que poderia dar errado? Como o novo segurança que trabalha à noite, seu trabalho é monitorar as câmeras e garantir que nada dê errado após o expediente. O guarda anterior reclamou sobre os personagens tentando entrar no escritório (ele já foi transferido para o turno diurno). Então, para tornar seu trabalho mais fácil, você recebeu sua própria cabeça vazia de Freddy Fazbear, que deve enganar os personagens animatrônicos e deixá-lo sozinho se acidentalmente entrarem em seu escritório. Como sempre, a Fazbear Entertainment não se responsabiliza por morte ou desmembramento.</p>\r\nCreditos\r\n<p>Criador: Scott Cawthon</p>\n<p>Dublagem: DublandoCoisas</p>\n<p>Quem Pois a Dublagem: GAMER2603</p>", "metacritic": null, "released": "2021-07-31", "tba": false, "updated": "2021-08-02T06:17:08", "background_image": "https://media.rawg.io/media/screenshots/e89/e89fee70ad660bdbd8b1f3c59b335234.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 17, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["KangApenas"], "genres": [], "publishers": [], "esrb_rating": null}