{"id": 644031, "slug": "deoti-ode-dioti-ode", "name": "Deoti Ode (διότι ὧδε)", "name_original": "Deoti Ode (διότι ὧδε)", "description": "<p>Deoti Ode (διότι ὧδε) is a game based on the Greek myth of Theseus with a horror touch. The story takes place in 9th century BC Crete. </p>\n<p>You take the role of the hero Theseus on his mission to escape the labyrinth of the heartbroken King Minoa after his son's death. The labyrinth was created by King Minoa to prison a beast called Minotaur, a beast half man, half bull. Ariadne, Minoa's daughter fell in love with Theseus and gave him an infinite thread to find his way out with the promise of taking her with him.</p>\n<ul><li>A Random generated maze for a unique experience.</li><li>Atmospheric ancient Greek vibe, made by Greeks.</li><li>Theseus isn't the only one who tries to escape the Maze,  needing to overcome the \"Stupidity\" of the other victims. </li><li>Ariadne's thread will help Theseus to trace his path in order to avoid insanity and find his way out.</li><li>Maximize Theseus' health by finding ancient Potions.</li></ul>\n\n<strong>Controls</strong>\n<ul><li>Use WASD or The Arrow keys to navigate the menu.</li><li>Use WASD to move.</li></ul>\n<p>The game contains mild nudity, you can turn it on or off through the settings menu.</p>\n\n<p><strong>The price will be 0.00$ until 2 of August.</strong></p>\n<p>Criticism to improve our game is always welcome.</p>", "metacritic": null, "released": "2021-07-31", "tba": false, "updated": "2021-08-02T06:22:21", "background_image": "https://media.rawg.io/media/screenshots/cba/cba67137509a015897855d5d7ec59d51.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 226, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["dpStudios"], "genres": [], "publishers": [], "esrb_rating": null}