{"id": 64412, "slug": "lazy-devils-game-life-fei-zhai-mo-wang-de-xing-fu-", "name": "Lazy Devil's game life /废宅魔王的幸福生活", "name_original": "Lazy Devil's game life /废宅魔王的幸福生活", "description": "[Game Story]<br/>After defeating 999 famous heroes,devil lucie had conquered the world and became the strongest one.<br/>However... She did not rule the world, but hid in the castle playing games!<br/>Suddenly, The demon sovereign's frontier territory was raided by brave human, and the devil king decide to deal with the threat herself.<br/>However, it seems that some people try to wastting time so that the devil can't find the brave human.<br/>The devil have to find clues himself and find the brave human to defeat him.<br/><br/>[game play]<br/>In the game, you can control the magic King moving on the map and explor.<br/>You will talk to monster  and fight for more information.<br/>Use skills and items to damage the target during the battle and win the final victory.<br/>A large number of treasure boxes are scattered in the game map, and the treasure can be obtained by dialogue with the treasure box.<br/><br/>[Combat Mode]<br/>The devil is powerful, kill them by magic power.<br/><br/>[Strip Mode]<br/>When the devil is defeated by the brave or the man of practice (PS: use prop), she will release the power of the seal in the armor, but it will lose part of the armor.<br/>(PS: it's a real failure if you defeated by monster)<br/><br/>[Hidden Branch]<br/>Part of the map has hidden events, without not any prompt.Player can explore yourself, such as hidden roads, open doors and so on.<br/>There have some nice treasures. There are also villages and field trials where people can challenge. Defeated to get interesting props.<br/><br/>The author said: This is a small creative game that I did with my spare time. There is not much content and the process is not long. Please forgive me.", "metacritic": null, "released": "2018-03-30", "tba": false, "updated": "2019-08-28T21:55:29", "background_image": "https://media.rawg.io/media/screenshots/f93/f9366ff84f6cf3ed2dfd2ba9541981a8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 7}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 166, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Philosophy"], "genres": ["RPG", "Casual", "Indie"], "publishers": ["Tengenstudio"], "esrb_rating": null}