{"id": 644161, "slug": "project-orbs", "name": "Project Orbs", "name_original": "Project Orbs", "description": "<p><strong>Eng-Usa:<br/></strong></p>\n\n\n<p>And if suddenly the person responsible for all life on a planet were irritated by its creation? <br/></p>\n<p>As was the case of this planet, taken from its solar system and released in a violent shower of meteors and other cosmic phenomena, this alien race will have to use its most advanced technology not to be extinguished.</p>\n\n<p>Project orbs is a singleplayer game where the player will have to keep several asteroids away from a planet inhabited by an alien race.</p>\n<p>Inspired by arcade games and made in flash games, all interaction with the game is done by mouse.</p>\n<p>This game was developed for gamejaaj 6 in the year 2021, so its playing time is not very long, and it has a relatively simple gameplay. This game was made with great care and the creative team hopes you will have a lot of fun playing it.<br/></p>\n\n<p><strong>How to play:   </strong> <br/></p>\n<ul><li>Don't let the asteroids hit the planet;   </li><li> Use the mouse to grab the asteroids and launch them in another direction;    </li><li>By hitting 2 asteroids there is the possibility of spawning an item;</li><li>Watch out for black holes, they pull and launch asteroids with greater speed;</li><li>Click on the screen to advance the cutscenes, press Esc to jump (Not recommended, or you'll lose the jojo reference).</li></ul>\n\n\n<p><strong>Pt-Br:<br/></strong></p>\n\n\n<p>E se de repente o responsável por toda a vida em um planeta se irritasse com sua criação? <br/></p>\n<p>Foi o caso desse planeta, tirados do seu sistema solar e soltos em uma chuva violenta de meteoros e outros fenômenos cósmicos, essa raça alienígena terá que usar sua tecnológica mais avançada para não ser extinta.</p>\n<p>Project orbs é um jogo singleplayer onde o jogador terá de manter diversos asteroides longe de um planeta habitado por uma raça alienígena.</p>\n<p>Inspirado pelos jogos arcade e jogos criados em flash, toda interação com o jogo é feita pelo mouse.</p>\n<p>Esse jogo foi desenvolvido para a gamejaaj 6 no ano de 2021, logo seu tempo de jogo não é muito grande, e possuí uma jogabilidade relativamente simples. Esse jogo foi feito com muito carinho e a equipe de criação espera que se divirtam muito jogando.</p>\n\n<p><strong>Como Jogar: </strong><br/></p>\n<ul><li>Não deixe os asteroides baterem no planeta; </li><li>Use o mouse para agarrar os asteroides e lançar eles em outra direção;</li><li>Ao bater 2 asteroides há a possibilidade de spawnar um item;</li><li>Cuidado com os buracos negros, eles puxam e lançam os asteroides com maior velocidade;</li><li>Clique na tela para avançar as cutscenes, aperte Esc para pular (Não recomendado, ou perderá a jojo reference).</li></ul>", "metacritic": null, "released": "2021-07-31", "tba": false, "updated": "2021-08-02T06:55:45", "background_image": "https://media.rawg.io/media/screenshots/2c4/2c40c96a15066c4772869bebd1ce2ff7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 83, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Bus Station Games"], "genres": [], "publishers": [], "esrb_rating": null}