{"id": 644127, "slug": "the-virus-unfinished", "name": "The Virus [unfinished]", "name_original": "The Virus [unfinished]", "description": "<p>(Note: This game is currently still in development, and was originally created for the Toadhouse Game Jam. The original Toadhouse Jam submitted version is in downloads, but we intend to update the default version as our team continues to work on it.)</p>\n<p><strong>Description</strong></p>\n<p>In this game, you play as Morton Antivirus, and you must identify the source of a computer's problems before it's too late! Team up with RAM and investigate software that could potentially be a vector for the virus. You might want to talk with Viper, a programming language that is full of messy code. Or maybe you should investigate FlameFennec, everyone's favorite web browser.</p>\n<p>You only have one chance to perform the virus scan correctly and identify the virus. Gather evidence and choose wisely, the fate of the motherboard is in your hands!</p>\n<p><strong>How to Play</strong><br/></p>\n<p>Click around to go from scene to scene, talk to characters, and gather evidence. Click on a character to give them items you've collected, and open the evidence menu to click on evidence to present that evidence to a character. You can also navigate around some scenes by clicking the left and right buttons. </p>\n<p>Once you've determined which software you think has the virus, click the Scan button and you can scan to see if they have the virus. Choose carefully, you only get one chance!</p>\n<p>Press ESC to quit the game.</p>\n<p>(Note: Biscuit Clicker is not currently available as a software to investigate)</p>\n<p><strong>Credits</strong><br/></p>\n<ul><li>Nathan Hahn - Programming and Writing (also some temp art)</li><li>Will Maskell - Music and Sound</li><li>Zachary Miller - Art and Writing</li></ul>", "metacritic": null, "released": "2021-07-31", "tba": false, "updated": "2021-08-02T06:45:27", "background_image": "https://media.rawg.io/media/screenshots/810/8109578f90efe7cb167b7b4a5e660144.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 8, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["nhahn"], "genres": [], "publishers": [], "esrb_rating": null}