{"id": 64429, "slug": "plants", "name": "Plants", "name_original": "Plants", "description": "Plants is a nontraditional and nonviolent experience where you take control over a growing flower.<br/>Unwind and de-stress with the help of the calm music and serene environment.<br/>Your goal: enjoy the scenery and have a pleasant trip.<br/><br/><strong>Features</strong><br/>- relaxing music<br/>- a stress relieving environment<br/>- family friendly content<br/>- full screen and windowed possibility<br/>- mute sound effects and/or music<br/>- day and night cycle<br/>- 6 flower body mutations<br/><br/><strong>Gameplay</strong><br/>Plants is a single player game in which you first select a flower and then control the flower (upwards). Your friendly flower follows your mouse cursor at all times.<br/>That way you can guide it towards an item, while it leaves a trail of his own body behind.<br/>Flower movement uses energy, picking up water drops prevents running out of energy. When you are out of energy, the session ends.<br/><br/><strong>Update history</strong><br/>This game was already available in other stores. The release here also brings a new update: v1.0.2.<br/>So while v1.0.1 was not available on Steam, here is a presentation of the changes from v1.0.1 to v1.0.2:<br/><br/>Update v1.0.2 brings a lot of new things. (18 changes in total)<br/>The biggest additions are the following:<br/>* Achievements<br/>* 2 new Plant Body mutations: Dark Mode and Twinkling Stardust<br/><br/><strong>New content (5 additions)</strong><br/>·         Achievements<br/>·         2 new Plant body items (Dark Mode and Twinkling Stardust)<br/>·         3 new flowers to select<br/>·         You now notice bees flying around<br/>·         A tree has been added to the background<br/><br/><strong>Visible changes (9 changes)</strong><br/>·         The Colour game mode does not automatically make plant bodies disappear on the screen anymore, unless you touch it. Also: the speed gradually increases and gets a reset when you switch colours again<br/>·         Main game: the floating dandelion now swings back and forth.<br/>·         The font in the main menu and Restart screen is now bigger and more clear<br/>·         Main menu: a purple oval is added to clearify which option is selected<br/>·         The sound effect of going back in the menu screen is changed<br/>·         A back-arrow has been added to all screens in the main menu<br/>·         The background of the credits screen is cleaner (used to be an enlarged sprite).<br/>·         The circle showing which flower you are about to select is increased in size<br/>·         Pause-animation: the button is now disappearing more quickly.<br/><br/><strong>Fixes (4 fixes)</strong><br/>·         In the Colour game mode you could get under the grass. The camera now stops at the bottom when you move down<br/>·         In the Colour game mode small spawned flowers would never fade away. They do not appear anymore due to the changes made in Colour Mode.<br/>·         There was a situation where 2 items were spawned at the same time. Limited to max 1<br/>·         The crickets would keep on singing when restarting a game at night. Fixed.", "metacritic": null, "released": "2018-06-05", "tba": false, "updated": "2019-08-28T21:55:28", "background_image": "https://media.rawg.io/media/screenshots/33f/33fb08829ba2498f585910369047dc1a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 103, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Rogerty"], "genres": ["Casual", "Indie"], "publishers": ["Rogerty"], "esrb_rating": null}