{"id": 6443, "slug": "air-patriots", "name": "Air Patriots", "name_original": "Air Patriots", "description": "Amazon Game Studios presents: Air Patriots!<br/>Air Patriots redefines defense games with unique drawing controls, and \"towers\" that take flight! <br/><br/>In Air Patriots, you control a squadron of airplanes by drawing the paths they will follow to engage the enemy! Unlike normal defense games, in Air Patriots your weaponry is all mobile, allowing you to change up tactics on the fly and move your \"towers\" to where they're needed the most!<br/><br/>Prepare your defenses for when the combat gets fierce by leveling-up airplanes and collecting gears that will both unlock new battlefields and add new unique aircraft for your armada. Score high enough to receive a medal of honor on the Rookie, Pro, and Veteran levels of each map and you’ll unlock one of the 100 wave survival levels that will challenge your strategies to the fullest.<br/><br/>Air Patriots features beautiful rich visuals, over 50 achievements, an awesome music score, and nearly endless hours of fun!<br/><br/>• Redefines Defense games!<br/>• Draw your defense paths!<br/>• Retina display supported on iPad, iPhone 4 &amp; 5!<br/>• 10 Unique maps<br/>• Choose your fleet from 16 unique airplanes!<br/>• 40 levels of challenging gameplay!<br/>• 52 achievements to earn!<br/><br/>*****GAMEPLAY*****<br/>Air Patriots is an action strategy game with simple controls. By drawing lines with your fingers you will precisely determine the path each airplane in your fleet will follow as they move to engage the enemy. Air Patriots challenges players to balance a full squadron of aircraft using quick, but well thought-out strategies to eliminate the on-coming waves of enemy tanks.<br/><br/>*****FEATURES*****<br/>- Use simple intuitive touchscreen controls to direct your squadron<br/>- Score high to receive the best medal possible on each of the levels<br/>- Hand pick your squadron from a variety of unique airplanes<br/>- Play for hour after hour to achieve high scores and unlock all achievements<br/>- Level-Up your airplanes to make them even more destructive<br/>- Uses Game Center for friendly leaderboard competition<br/><br/>*****ADVANCED GAMEPLAY*****<br/>- PATROL PATHS - Drawing paths is just the beginning; you can create a patrol path by drawing a circle. Once an airplane is in a patrol path it will follow the same path indefinitely, so strategize well! <br/>- MAP STRATEGY - Find your own favorite spots for patrol paths on each of the 7 unique maps to personalize your strategy and maximize your score!<br/>- SQUADRON SELECTION – Missile can be fired from a distance, bombs may do additional fire or radiation damage. In all there are 13 plane types, but you can only start a level with 5. Pick your winning combination!", "metacritic": null, "released": "2012-11-01", "tba": false, "updated": "2019-10-22T14:21:21", "background_image": "https://media.rawg.io/media/screenshots/cb7/cb70c7567a67536ee787a9bce5c6d309_eoX5Ywi.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 195, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Lemon Games"], "genres": ["Action", "Strategy"], "publishers": ["Lemon Games"], "esrb_rating": "Teen"}