{"id": 64446, "slug": "the-council-of-hanwell", "name": "The Council of Hanwell", "name_original": "The Council of Hanwell", "description": "Play through the major locations of Welcome to Hanwell!The Council of Hanwell is a concentrated horror experience featuring all the locations from Welcome to Hanwell for people that love to get right into the story, environmental storytelling is employed heavily in The Council in a classic linear horror experience.The CouncilOtherwise known as the <strong>Hanwell Council of Public Protection</strong> or <strong>HCPP</strong> was formed in Hanwell almost a century ago to protect the residents from the newly emerging creatures referred to as Anomalies. It was a long time ago, and things have surely changed, in no small part thanks to <strong>The Doctor</strong>.<br/><br/>You wake up in a makeshift morgue set up in the old disused maintenance tunnels under Hanwell Power, you can't remember anything, but you know The Doctor had something to do with your situation, and he's at <strong>The Council</strong> So you'll set off to find him, discovering along the way the countless horrors of Hanwell's Anomalies and more disturbingly, Hanwell's Elite. Bad people reside in Hanwell and <strong>The Council</strong> is the root of it all.<br/><br/>There is something deeply unsettling about Hanwell. Unexplained noises, something in the corner of your eye or laying just beyond the shadows create an atmosphere that will keep you constantly on edge.TLDR! Gimme the Important Bits!<ul><li>Play through the major locations of Hanwell in a story driven horror campaign!<br/></li><li>In addition to the story driven campaign, there are many different extra game modes included with The Council of Hanwell.<br/></li><li>Fight against wave after wave of increasingly challenging anomalies in the all new <strong>Survival</strong> mode.<br/></li><li>Run or Hide from The Brute and revel in the tension of the <strong>Escape</strong> mode.<br/></li><li>Play through the earliest prototype gameplay taken from the very beginning of development in the <strong>Prototype Demo</strong> bonus.<br/></li><li>Graphical Overhaul! Featuring new effects such as Volumetric Fog and re-textured in 4K environmental assets and character skins.</li></ul>", "metacritic": null, "released": "2018-03-14", "tba": false, "updated": "2022-11-06T18:35:29", "background_image": "https://media.rawg.io/media/screenshots/bc9/bc97389177ee0e9443ec5f3d48af5985.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 24, "beaten": 1, "toplay": 1, "dropped": 1}, "playtime": 5, "achievements_count": 10, "ratings_count": 3, "suggestions_count": 424, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["Nathan Seedhouse"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Nathan Seedhouse"], "esrb_rating": null}