{"id": 644418, "slug": "solarsystem-morenostef", "name": "SolarSystem (morenostef)", "name_original": "SolarSystem (morenostef)", "description": "<p>This program is a simple simulation of the solar system with planets,dwarf planets,main moons and asteroids.You can see,for example,Jupiter with its main moons,orbiting around the planet.</p>\n<p>First of all press \"H\" keyboard button to use the main window and \"I\" for info on a selected object<br/></p>\n<p>But you can see exoplanets (alien planets),choosing another star.Due to upload file size,only a limited number of exoplanets have been included.Control with \"Down\" button if a selected star has planets.</p>\n<p>Important.  Before pressing \"go\" button for an exoplanet (planet of star other than the sun),select the star and press \"go\" on the star,and then select the planet,otherwise there could be visualization problems for the planet.For solar system,no problems.<br/></p>\n<p>When you start,you find a list of stars.First the sun,then the nearest stars and some bright stars.</p>\n<p>You have two buttons \"Up\" and \"Down\". Pressing Down you can go from stars to planets (or asteroids),and from planets to moons.</p>\n<p>Pressing Up you can from moons to their planets,and from planets to stars.</p>\n<p>A star can be a multiple star,so if you want to see the component stars,you must press Down on the multiple star.</p>\n<p>When you have chosen the object,press \"Go\" button and you will move to the new object.</p>\n<p>When a button or a slider is not active,it means that it can't be used.</p>\n<p>Pressing \"OrbitMap\" button,you'll see shapes and inclinations of planet orbits. In OrbitMap Mode ,click a planet in the list and a line will show you the orbit of that planet.Pressing OrbitMap again,you will return to normal mode.</p>\n<p>Pressing \"StarMap\" button,you'll see the distribution of the stars of the list in the space.</p>\n<p>Select a star (if multiple star,AZURE SELECTION,press down) and it will be placed in the center.Pressing StarMap again,you will return to normal mode with the selected star.</p>\n<p>On the top of the main window,you can see information on the active object,the active star system and the active map (star,orbit,normal).</p>\n<p>I have tried to respect the scales in terms of sizes, and periods of orbit and rotation,using real data.</p>\n<p>For missing data (especially rotation period for some stars), I entered average (or fictional) values.</p>\n<p>Movements for multiple stars are not included.This means that if you select a star of a multiple star,you'll see the selected star rotation,its orbiting moons,but the other stars will be fixed (not orbiting around the center of mass of the system).</p>\n<p>I shortened the distances among multiple stars due to difficulties with the size of the stars .</p>\n<p>Sometimes some object (moons) may be very small (10 km for example) and therefore may not be visible while it is orbiting around the planet.</p>\n<p>In this case,select the moon and use the slider \"Zoom on moons\" to enlarge the object.</p>\n<p>it will return to normal size when you point to an object other than a moon.</p>\n<p>Planets and moons have different rotation periods,so you can accelerate time pressing \"T+\" and slowing down time pressing \"T-\".</p>\n<p>With stars,don't press too many times T+,otherwise you may have a problem with starlight.</p>\n<p>Try \"T+\" many times on Saturn to see the sun light on its rings.</p>\n<p>The \"Sky\" button is used to exclude the sky,if you want to see objects more clearly,without confusing them with the background stars.</p>\n<p>To move around the object,use right or middle mouse button.</p>\n<p>To change the distance between you and the object,use mouse wheel. If you you want to move faster,move \"Mouse Speed\" slider.</p>\n<p>You can do the same thing using up and down arrow,this is recommended if you want to travel large distances.</p>\n<p>Maps of sun,sky,planets,moons the maps have been downloaded,following all rules of the sites,so i must give CREDITS:</p>\n<p>- Courtesy NASA/JPL-Caltech</p>\n<p>- solarsystemscope.com</p>\n<p>- planetpixelemporium</p>\n<p>All other maps (exoplanets) have been made by me using other software.</p>", "metacritic": null, "released": "2021-07-30", "tba": false, "updated": "2021-08-02T08:06:08", "background_image": "https://media.rawg.io/media/screenshots/d01/d01487fc6575a6246e2fd9b9773473fe.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 33, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["morenostef"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}