{"id": 644591, "slug": "chess-2-horsing-around", "name": "Chess 2: Horsing around", "name_original": "Chess 2: Horsing around", "description": "GAME OVERVIEW:\r\n<p>\n</p>\n<p>Did you think chess didn’t have enough horses? Well, this one Does!<br/></p>\n<p>The game is a blend of Traditional Chess and Advance wars. Using the elements of being able to use objects available in the map to strategically turn the tides.\r\n</p>\n\r\nKEEP IN MIND:\r\n<ul><li>The hook is the fact that the mount is essential in the gameplay scenario. This will emphasize what the player wants to mount the horse and strategize according to that. This just adds another dimension to gameplay. </li><li>You play the Pieces on the Chessboard.  Depending on what color you choose, you will play the pieces associated with it. </li></ul>\n\r\nFeatures \r\n Mount System  \r\n<p> The horses which are going to be available on the map are units that persist, even if the mount’s rider is eliminated. This allows an opportunity for a unit to claim that mount and upgrade itself into a mounted unit. Which will have special abilities. Like being able to move after securing an enemy unit. or being able to move after claiming amount itself.  \r\n</p>\r\n The Barracks\r\n<p>  Since the inclusion of mounts makes maneuvering around the chessboard easy for certain units, the Board is extended in size. But Each corner has A Barrack building associated with the side. The Barrack will spawn a pawn every 5 turns from each barrack. Only if the amount of pawns in the team is less than the max pawns in the beginning of the game. (i.e 8 pawns per side).\r\n</p>\r\nControls\r\n\n<p>It’s a mouse click heavy game where you have to select the units and move them according to where you click on the Chess Board. \r\n</p>\n<p>There will be additional controls for the camera, But these are secondary.\r\n</p>\r\nDEVELOPMENT TEAM:\r\n\r\n<p><strong>Game Design/Programming/Art: Diego Leonardo Gonzalez Lopez</strong>\n</p>\n<p><strong>UI Art/Game Design</strong><strong>: Aakash Kumar Bhagchandani</strong>\n</p>\n<p><strong>Game Design/SFX/Art</strong><strong>:</strong> <strong>Vittal Gunja</strong>\n</p>\n<p><strong>Art/Game Design</strong><strong>:  Siddarth Vimala Ravindren</strong><br/></p>\n<p>*Game Design Document in the downloadable contents*\r\n</p>\n<p>Link to Group Trello Board:\r\n</p>\n\n<p>Link to Git History:\r\n</p>", "metacritic": null, "released": "2021-07-30", "tba": false, "updated": "2021-08-02T08:55:30", "background_image": "https://media.rawg.io/media/screenshots/c81/c814d599bf0c1fa265e5e9336cf2cc44.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 78, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["AakashBhagchandani", "LEAsmodeus", "DapperPenguin", "OldbearLive"], "genres": [], "publishers": [], "esrb_rating": null}