{"id": 64457, "slug": "parker-lane-criminal-justice", "name": "Parker & Lane: Criminal Justice", "name_original": "Parker & Lane: Criminal Justice", "description": "Help rookie detective Parker solve cases and bring criminals to justice!<br/><br/><strong>In Parker &amp; Lane: Criminal Justice, a streak of murders plagues the city. Become a homicide detective and restore law and order in this unique crime investigation game!</strong><br/><br/>Lily Parker is a smart and righteous detective who works hard to put criminals behind bars and make the world a better place, even if her own life is a mess. Victor Lane is a smug but charming criminal defense attorney who doesn’t care who he’s defending as long as he’s getting paid. He’s also the best at his job.<br/><br/>When some of the criminals Lane defended in the past start dying, Parker’s forced to work with him to find the culprit. Could it be one of the criminal’s victims? Or perhaps some kind of vigilante? Is Lane himself being targeted?<br/><br/>Immerse yourself in the first episode of an exciting time management story game, feel the thrill of the chase and prove that your detective skills are second to none! Parker &amp; Lane: Criminal Justice is waiting for you.<br/><br/><ul><li> <strong>Help expose the hidden killer</strong> before another victim falls!<br/></li><li> <strong>Look for evidence</strong> while investigating 9 different locations<br/></li><li> <strong>Master 18 mini games</strong> based on forensic investigation<br/></li><li> <strong>Examine clues and analyze objects</strong> using forensic techniques<br/></li><li> <strong>Play through 60 extraordinary story levels</strong> and 30 extra challenge levels<br/></li><li> <strong>Complete your case file</strong> by collecting diamonds<br/></li><li> <strong>Conquer daily challenges</strong> to earn extra diamonds for your case file<br/></li><li> <strong>Beat your high score</strong> with a choice of 15 awesome endless levels</li></ul>", "metacritic": null, "released": "2018-02-27", "tba": false, "updated": "2019-08-28T21:55:26", "background_image": "https://media.rawg.io/media/screenshots/566/566592a0f1f55e505ea4d5220db6fad2.jpg", "website": "https://www.gamehouseoriginalstories.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 6, "toplay": 2}, "playtime": 18, "achievements_count": 12, "ratings_count": 2, "suggestions_count": 322, "game_series_count": 0, "reviews_count": 2, "platforms": ["macOS", "Android", "PC"], "developers": ["GameHouse", "Big Blue Studios"], "genres": ["Adventure", "Simulation", "Casual"], "publishers": ["Gamehouse"], "esrb_rating": null}