{"id": 64451, "slug": "taco-gun", "name": "Taco Gun", "name_original": "Taco Gun", "description": "In <strong>Taco Gun</strong>, you take on the role of a mexican pistolero; fighting with or against your friends in an absurd world where food is bullets, the only way to survive is to shoot your opponents full of tacos!<br/><br/><strong>Taco Gun</strong> is an up to 4 player PvP party game about shooting your friends up with tacos and various other food items until they explode! Foodfight your way through 8 different levels, taking your pick out of 7 different characters each with unique weapons and abilities!<br/><br/>Every level in <strong>Taco Gun</strong> features unique mechanics and new obstacles to overcome. Take advantage of the situation and find creative ways to blow your opponents up!<br/><br/><br/><ul><li>Immersive Fattening System!The more you eat, the rounder you get! You might walk slower, but bouncing around is still an option, as is taking a swig of Diet Tequila!<br/></li><li> Parkour-like Grace~Wall Jumping and air-dashing couldn’t be easier! Hunger can be a great motivator.<br/></li><li> 8 Insane Levels to choose from!Fight your friends across trains, factories or UFO-infested cornfields. Nothing is sacred, lather everything up with your food of choice!<br/></li><li> 7 pistoleros, armed to the teethThey lie in wait, each has unique abilities and weapons, prepared for any type of foodfight. Find your favorite or pick around, either way you’ll enjoy it!<br/></li><li> 8 unique music tracks for fighting to the death!Each level features it’s unique theme song, making sure the taco-shooting mood keeps going!</li></ul>", "metacritic": null, "released": "2018-05-17", "tba": false, "updated": "2019-08-28T17:04:41", "background_image": "https://media.rawg.io/media/screenshots/098/098bde42741f552274fb313676257cc0.jpg", "website": "https://www.floatingislandstudios.com/taco-gun", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 16}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 258, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Floating Island Studios"], "genres": ["Action", "Casual", "Indie"], "publishers": ["eNVy softworks"], "esrb_rating": null}