{"id": 644679, "slug": "eluxia-enigma", "name": "Eluxia Enigma", "name_original": "Eluxia Enigma", "description": "Deserting your squad after a battle ending in a bloodbath, you are left alone wandering around the vast emptiness of space. You intercept a strange signal originating from an uncharted planet called <strong>Eluxia</strong>. You decide to investigate and you'll find that the planet is not your ordinary celestial body...<h3>Oldschool 2D platforming with a twist!</h3>Take on this platforming challenge and open your mind to thinking about platformer games from a different perspective. In order to find out what the planet upholds, you'll have to master your jump, your movement and the gravity. You take control of Lieutenant Aura Mitchell, a starship captain running away from war. On Eluxia, you realize that you are not alone, and you will learn to about the gravitational anomalies.... <strong>Time your movement, avoid dangers and explore the world in this retro-esque 2D platformer!</strong><h3>Game Features</h3><ul><li><strong>A vast planet to explore:</strong> The planet of Eluxia is uncharted and waiting to be explored. Jump and dash your way through the planet and uncover the secrets it holds.<br/></li><li><strong>Platforming at its core:</strong> Tricky jumps in all dimensions! No unfair traps, just simple controls and fair challenge.<br/></li><li><strong>Collectibles:</strong> The world of Eluxia is filled with different collectibles and hidden areas. Can you find them all?<br/></li><li><strong>Original Soundtrack:</strong> Brilliant (and 100% NES compliant!) original chiptunes!<br/></li><li><strong>Multiple ways to play:</strong> Use your keyboard or plug in a controller. Support for button mappings for both XBOX and PlayStation controllers.</li></ul><br/>Can you solve the Eluxia Enigma?", "metacritic": null, "released": "2021-08-05", "tba": false, "updated": "2021-08-06T02:30:45", "background_image": "https://media.rawg.io/media/screenshots/5ef/5efc83fe0a74b145d90d47c7471c6462.jpg", "website": "http://www.mikkotheque.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 117, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mikkotheque"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Mikkotheque"], "esrb_rating": null}