{"id": 644691, "slug": "seafarers", "name": "Seafarers", "name_original": "Seafarers", "description": "Working as a ship hand for a pirate crew for many years, you've finally decided that you've had enough, and with your life savings you go and buy a boat of your own to become the best merchant that has ever lived! As you sail around the world and visit lots of towns and colonies, you aim to spread your name and become recognized as a world-class merchant. You will recruit crewmembers, and they will help you on your journey as you get to know them better. Trade, and negotiate your way to the top in your own style!<br/><br/><strong>Trading</strong><br/><ul><li>Buy and sell 16 different goods across the world to various towns and colonies<br/></li><li>Find the best trade routes and think strategically as supply and demand dictate the worlds prices<br/></li><li>Haggle over prices with town merchants to get the best prices<br/></li><li>Fund projects in towns in order to boost their production and get better prices for goods</li></ul><br/><strong>Interaction</strong><br/><ul><li>Interact with the world by talking to people you meet<br/></li><li>Get to know people better and invite them to join your crew<br/></li><li>Explore small storylines with your crewmates as your friendship grows</li></ul><br/><strong>Dynamic World</strong><br/><ul><li>Adjust trade routes according to supply and demand as other traders change across the world with what they buy and sell<br/></li><li>World Events such as Hurricanes and Droughts affect region-wide prices and make things quite expensive... and quite lucrative<br/></li><li>Change the game by upgrading towns to produce or consume faster, and upgrade your ship to be able to carry even more precious cargo</li></ul>", "metacritic": null, "released": "2021-08-01", "tba": false, "updated": "2021-08-06T02:37:22", "background_image": "https://media.rawg.io/media/screenshots/399/3994383a59e93efc297049fef3c25c00.jpg", "website": "https://eggheadinteractive.net/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 97, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Egghead Interactive"], "genres": ["Adventure", "Strategy", "Casual", "Indie"], "publishers": ["Egghead Interactive"], "esrb_rating": null}