{"id": 644664, "slug": "terrorbane", "name": "tERRORbane", "name_original": "tERRORbane", "description": "<p>Become the mighty Terrorbane, a hero caught up in the Developer’s endless pursuit of creating the perfect video game. Embark on a jRPG-inspired adventure, full of references to iconic gaming moments, and hunt down scores of bugs to become the Bane of Errors!<br />\nDeceptively presented as a classic jRPG inspired by the 16bit era, tERRORbane is a tongue-in-cheek meta-adventure that eschews genres and tells the story of an obnoxious videogame Developer at his ﬁrst videogame project, eager to make the Player his unfortunate test subject.<br />\nAs a Player, you will have to endure the sloppy but funny storyline and ever-changing gameplay, in a bid to learn how to exploit bugs and surmount the impossible odds that separate you from your prize, the ending credits!Become Terrorbane, the hero of legend!Travel through majestic lands and defeat epic foes!There is nothing wrong with this game!Subtle references to legendary games!The Developer is here to guide and help you!A 100% bug free experience!<br />\nCurious what to expect from this 4th-wall-breaking, meta-commenting, legend-referencing, bug-finding work of art?Well, wonder no more!<br />\nIn tERRORbane you’ll find:<br />\nJRPG inspired gameplay with majestic lands and mighty foes<br />\nQuirky characters and snappy dialogue<br />\nBugs!<br />\nMore references to video games than you can handle<br />\nA friendly, and a bit cocky Developer<br />\nOriginal take on classic mechanics<br />\nAbsolutely no bugs!<br />\nDiverse lands that don’t fit into any one genre (Fantasy? Post-apo? We don’t know!)<br />\nAlright, there might be a few bugs here and there, but you’ll help us find them, right?<br />\nGeorge!</p>", "metacritic": null, "released": "2022-04-01", "tba": false, "updated": "2023-12-13T02:20:11", "background_image": "https://media.rawg.io/media/screenshots/206/2064f3fd67658b8359430a2da4cf3d8a.jpg", "website": "http://www.terrorbane.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 14, "beaten": 1, "toplay": 10, "dropped": 2}, "playtime": 2, "achievements_count": 11, "ratings_count": 3, "suggestions_count": 248, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC", "Nintendo Switch"], "developers": ["BitNine Studio"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["BitNine Studio"], "esrb_rating": null}