{"id": 64469, "slug": "shooting-sports-gun-club", "name": "Shooting Sports Gun Club", "name_original": "Shooting Sports Gun Club", "description": "In the beautiful setting of Lakeside Gun Club, experience a Shooting Sports simulation. <strong>Regulation standard shotgun games of Trap, Skeet and Five Stand.</strong><br/>Added fun with our exclusive game \"Crazy Targets!\"Monitor your progress and improve your shotgun shooting skills over time. <br/>If you've never played before, here's a great introduction to learn how to play. <br/><br/>Practice shooting moving targets from the convenience of your computer.<br/>Sight pictures are just like the real thing. <br/>Work on leads. Work on that dreaded station. Work on your game. <br/>Use the \"Slo-Mo\" so you can really get a good look at that target.<br/><br/><strong>All for less than the price of a couple of rounds of the real thing! </strong><strong>FEATURES</strong><br/>* Three great 12 gauge shotguns to choose from.<br/><br/>* Play Trap: One of the three major disciplines of competitive clay pigeon shooting (shooting shotguns at clay targets). Targets are launched from a single \"house\" or machine, generally away from the shooter.<br/><br/>* Play Skeet: A round of Skeet involves one box of 25 shotgun shells, which will be fired at eight stations. Targets are launched from two \"houses\" in somewhat \"sideways\" paths that intersect in front of the shooter.<br/><br/>* Play Five Stand:  A type of shotgun sport shooting with five stations, or stands with eight strategically placed clay target throwers (called traps).<br/><br/>* Play \"Crazy Targets\": Tons of targets in all different shapes and sizes. Oil barrels, gas cans, propane cylinders, oxygen tanks.  Shoot as many as you can inside of 30 seconds.<br/><br/>* Steam Achievements!<br/><br/>* Visit the Clubhouse. <br/><br/>* Many more shooting sports games to come . . .", "metacritic": null, "released": "2018-05-15", "tba": false, "updated": "2019-08-28T21:55:25", "background_image": "https://media.rawg.io/media/screenshots/eda/edafb5e0324e28599c1caa969e8495cb.jpg", "website": "http://gunclubgame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 241, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Smart Integrations"], "genres": ["Simulation", "Sports"], "publishers": ["Smart Integrations"], "esrb_rating": null}