{"id": 644766, "slug": "enherjar-synergy", "name": "Enherjar Synergy", "name_original": "Enherjar Synergy", "description": "ATTENTION fans &amp; followers of Enherjar Synergy: we are announcing that we have to delay the game's release date, but no worries, it is only going to be a minor wait for those of you who were looking forward to playing on the 4th of August. To bring you the best version of this brand-new FPS, our new release date will be August 11th, to allow us to finish making all the final tweaks that need to be made in order to give you the absolute optimal experience possible. Thank you for your patience, we are looking forward to playing with you on the Otherside!<br/>\n<br/>\r\nThis Online Multiplayer is designed by eSports FPS professional, Cloud Darkson, with the intention of creating \"Arena Shooter Perfection\". After decades of competing on other game platforms, it is our absolute mission to produce an Arena that eliminates all coreplay imbalances with mechanics that highly reward both individual skill and team-based strategy to be the zenith experience in our genre for players to compete in developer hosted tournaments.<br/>\n<br/>\r\nAfter years in-the-making, we are proud to present to you an all new eSports Arena with the fiercest, most fair gameplay the world has ever seen. The devteam here at Cosmic Perspective Studio would like to personally invite you to experience the revolutionary, Enherjar Synergy!<br/>\n<br/>\r\nFeatures:<br/>\r\n-Free-to-Play<br/>\r\n-Releases August 4th<br/>\r\n-Playlist for FFA, 1v1s, 2v2s, 4v4s, 5v5s<br/>\r\n-Quick Reflex Ultra-Fast Gameplay on Small Competitive Maps<br/>\r\n-Fun, Addictive, Immersive High Skill Lead-based Shooting<br/>\r\n-Groundbreaking Netcode (incredibly high hit registration)<br/>\r\n-Instant Matchmaking: Virtually Zero Lobby Wait Times<br/>\r\n-Advanced Matchmaking designed to always give fair, challenging rounds,<br/>\r\naccording to your own skill level<br/>\r\n-User-friendly, new players to the scene are welcome<br/>\r\nand will find matches to not be overly-difficult while learning the ropes<br/>\r\n-Safe Environment, Public Chat is disabled/troll-free, limiting communication<br/>\r\nwith only your friends, so you can enjoy your time playing with peace of mind<br/>\r\n-Strong Clan Support integration<br/>\r\n-Monthly Hack-free Tournaments:<br/>\r\n\"Climb to the top, become one of our League's in-house professional players!\"<br/>\r\n-Gorgeous, Next-Gen Dark Neon Visuals within a 40+ hours story in the lore of Transcendence", "metacritic": null, "released": "2021-08-31", "tba": false, "updated": "2021-08-06T03:32:11", "background_image": "https://media.rawg.io/media/screenshots/6f4/6f4fdd5733eab7c8a1486af4659c0b6d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 366, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Cosmic Perspective Studio"], "genres": ["Action", "Adventure", "Massively Multiplayer"], "publishers": ["Cosmic Perspective Studio"], "esrb_rating": null}