{"id": 644739, "slug": "protect-eggs", "name": "Protect Eggs", "name_original": "Protect Eggs", "description": "Protect Eggs<br/>\n<br/>\r\nProtect eggs and hatched birds from being caught by foxes and Eagle<br/>\n<br/>\r\nThe player plays a lovely squirrel and Phoenix, looking for the phoenix nest in the beautiful forest, laying eggs (press R key), driving away foxes and eagles during the incubation period of bird eggs (left and right mouse button skills), when the bird is born, it can be summoned around (Q skill)<br/>\r\nPhoenix nest is divided into three kinds, each with different functions<br/>\r\nThe flame above the bird's head can replenish the life of the big bird<br/>\r\nSnails on the grass can replenish the flame of birds. Be careful not to hit them too hard<br/>\r\nGrass is a good place for birds. They can avoid eagles, but they can't escape Fox's nose<br/>\n<br/>\r\nFor the nest with \"shield cover\", after laying eggs, it will hatch into birds after waiting for a period of time, and grow up with time. When it grows to the maximum, it can attack foxes and eagles to protect other birds or eggs<br/>\n<br/>\r\nTips: laying eggs can be understood as building a system, and the hatched big birds play a role in protecting other birds, which is equivalent to a simple tower defense system<br/>\n<br/>\r\nOther operations:<br/>\r\nESC - out of the game<br/>\r\nTab - hidden interface<br/>\r\nPAUSE - Pause, Continue Game<br/>\r\nF12 - screenshot", "metacritic": null, "released": "2021-08-03", "tba": false, "updated": "2021-08-06T03:14:05", "background_image": "https://media.rawg.io/media/screenshots/500/500c128ac09241e6daf0e4f754fca5c2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 239, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["RestfulSense"], "genres": ["Casual", "Indie"], "publishers": ["RestfulSense"], "esrb_rating": null}