{"id": 644747, "slug": "space-tek", "name": "Space Tek", "name_original": "Space Tek", "description": "Hey, are you feeling the need to blow some spaceships up? Want to send your opponents back to the dark ages? Do you like the thrill, in a team or alone?<br/><br/>SpaceTek is an exciting ship building and combat game inspired by Sci-Fi movies and series. The SpaceTek commanders mission will be to design and create a unique or inspired spaceship. Place turrets, Utilities, Shields and more on your ship to make yourself the most effective ship in the fleet. You will therefor need to destroy and gather enough Raw Metal components to buy new blocks ready to be used on your ship.<br/><br/><h3>Gamemodes</h3>Once you are ready to go, you will be able to choose from 2 gamemodes, whether that's team deathmatch or capture the ship is up to you. Team deathmatch game mode puts you head to head with another fleet of SpaceTek commanders, but be warned they could have defensive or weaponry blocks that could cause you serious damage. Your goal in team deathmatch is to destroy the enemies team relay station by doing so you stop there commanders from regenerating there ships.<br/>Capture the ship game mode will again put you head to head with enemy SpaceTek commanders but your task is to bring back enough disabled ships by tractoring them towards your relay station. Which ever fleet collects the most disabled ships wins the battle.<h3>Multiplayer</h3>Play alone in a artificial fleet, or team up with players in Online matches bringing all the deadly abilities with you to eliminate the enemy fleet<h3>Ship customisation</h3>By using your collected Raw Metal components, gather blocks to build a ship ready to face the enemy fleet. There are a range of blocks to choose from such as turrets, Shields, Grappling hooks, Shield plating, core hull blocks and more. Try combine different blocks to see how much you can devastate your enemies.", "metacritic": null, "released": null, "tba": false, "updated": "2021-08-06T03:19:41", "background_image": "https://media.rawg.io/media/screenshots/ecb/ecbd16b7e934879bf4b2f405767cfc27.jpg", "website": "https://www.raworangestudios.com/spacetek", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 391, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Raw Orange Studios"], "genres": ["Action", "Casual", "Massively Multiplayer", "Indie"], "publishers": ["Raw Orange Studios"], "esrb_rating": null}