{"id": 644725, "slug": "officescape", "name": "OFFICESCAPE", "name_original": "OFFICESCAPE", "description": "OFFICESCAPE is a first-person puzzle-platformer adventure game.  In OFFICESCAPE <strong>you </strong>play as yourself, <strong>you </strong>are stuck in a dream and <strong>you </strong>are trying to wake up.  <strong>You </strong>are not alone however, I, the NARRATOR, will be your guide through this journey and I, will help <strong>you </strong>reach your goal!.. of waking up...<br/><br/><strong>BOXGUN</strong><br/><br/>The BoxGun Is a gun that shoots boxes, pretty self-explanatory.  This will be an essential tool for your adventures into the scape.<br/><br/><strong>RPGG (Rocket Propelled Grappling Gun)</strong><br/><br/>The RPGG (Rocket Propelled Grappling Gun) is a grappling gun that can only grapple onto pink blobs!<br/><br/><strong>SECRETS</strong><br/><br/>Throughout the scape, you will find secrets littered around!  Discover them to unlock achievements and uncover the secrets of OFFICESCAPE.<br/><br/><strong>9 LEVELS TO EXPLORE</strong><br/>The game has a total of 9 levels!  New mechanics are introduced every few levels to keep gameplay fresh and exciting.<br/> <br/><strong>NARRATOR</strong><br/>and finally the best part of all, ME!  I will be your guide through this adventure!  Since there's no chance you'd make it through without me, after all.  I'll be monitoring you on your adventure with many cameras so good luck!", "metacritic": null, "released": "2021-08-02", "tba": false, "updated": "2021-08-06T03:04:02", "background_image": "https://media.rawg.io/media/screenshots/32f/32f39f6ed827a8a022b55560b00f4d0c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 12, "ratings_count": 0, "suggestions_count": 123, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["B3 Studios"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["B3 Studios"], "esrb_rating": null}