{"id": 644751, "slug": "open-bar-3", "name": "Open Bar", "name_original": "Open Bar", "description": "Have you ever dreamed of being a bartender?  Ever wonder what magical ingredients makes up those mystic cocktails?  Now's your chance!  Welcome to OPEN BAR: The Game!!!  With this first person, 3D, cooking style game, you are the bartender!  Serve customers, take drink orders, earn tips, and most fun of all, actually make the drinks!  Equipped with a full \"OPEN BAR Bartender's Handbook Drink Guide\" containing over 100 real drinks recipes, including full color pictures and specifically listed ingredients, also access to a full \"OPEN BAR STORE\" from which equipment upgrades and power-up purchases can be made, you'll have the chance to do battle with numerous heart-pounding levels, in a variety of locations of varying difficulty.  At the core of being a successful bartender is having the ability to craft only the very best cocktails.  Uh-oh, if a customer orders a drink, what do I do?  What do I put in the glass?  Which glass do I even use?  Don’t worry, we got you covered.  Any drink where the recipe eludes you, simply pick up your trusty in-game Handbook.  Each recipe explains which liquors to use, mixers to use, which garnish or garnishes, if you need any tools to make the drink, and down to even which piece of glassware to use.  Now, on to the tips!  When a bartender serves a drink to a customer, it's customary to leave a tip.  OPEN BAR is no different!  When you construct well-crafted cocktails and serve up shaken or stirred spirits in a promptly manner, the customers will generously leave you a Tip.  You'll collect Tips through out the level to earn Stars.  Earn up to 3 Stars per Level!!!  Earning Stars will unlock new Locations, new Drinks and more!!!  Do you have what it takes to be a Master Bartender?  Good Luck, and Happy Pouring!!!", "metacritic": null, "released": "2021-08-31", "tba": false, "updated": "2021-08-06T03:22:20", "background_image": "https://media.rawg.io/media/screenshots/001/001d3ab6ccdcf2d2aa81b64f7e96e37f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 285, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Chris Farkas", "Russ Mozol"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["onMouseDown"], "esrb_rating": null}