{"id": 644749, "slug": "the-marauder-chronicles-curse-over-valdria", "name": "The Marauder Chronicles - Curse over Valdria", "name_original": "The Marauder Chronicles - Curse over Valdria", "description": "When Dayren Vel'sharek, the charming male protagonist of cursed Valdria is sent by his master to assassinate a sworn enemy, he is thrown into an epic journey that will test both his allegiances and his skills and allegiances.<br/><br/>Explore a vast kingdom filled with beautiful and powerful women to engage, while making impactful choices that may later affect the outcome of the larger story. But be aware, lurking within this cornucopia of conquests is the ominous Marauder, creator of dark, monstrous beings ready to bring uncertainty and unexpected events…<br/><br/>Curse Of Valdria is just the beginning of The Marauder Chronicles upcoming saga.<br/><br/><br/><ul><li>First chapter in a larger tale of The Marauder Chronicles<br/></li><li>Gorgeous women to seduce<br/></li><li>Visual novel<br/></li><li>Beautiful fantasy art</li></ul><br/><br/>Part of the small amount of males that survived the plague that turn them into monstrous creatures known as Gaharoul, Dayren is Valdria's most famous, feared and persuasive assassin, currently serving the almighty Black Empress of Sharakan but, for how long?<br/><br/><br/>Captain among \"The Steel's Betrotheds\", a military Order consecrated to the Gaharoul's destruction. By vicissitudes of destiny, she has been forced to become Dayren's relentless interrogator.<br/><br/><br/>No one can explain the impressive power that the ruthless ruler of the most powerful kingdom in Valdria exhibits. The Black Empress of Sharakan, Dayren's master and owner,  is a manipulative and unstoppable force to be reckoned.<br/><br/><br/>Unpredictable and fierce, the Wild Witch is the governor of the second most powerful kingdom in Valdria and it's been too long since she decided to replace her rival. Opportunist and cunning, she's found a weakness... and she plans to take advantage of it.", "metacritic": null, "released": null, "tba": false, "updated": "2021-08-06T03:21:08", "background_image": "https://media.rawg.io/media/screenshots/93c/93c0ca7d446825119ac14f505b11bde3.jpg", "website": "http://www.gamuzumi.com/index.php", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 569, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mambo Dancing Shrimp"], "genres": ["Adventure"], "publishers": ["Gamuzumi"], "esrb_rating": null}