{"id": 644781, "slug": "mir4", "name": "MIR4", "name_original": "MIR4", "description": "<h3>[Features]</h3>Warriors, which path would you choose in the land of MIR?<br/><br/>Venture into the unknown seeking the next adventure<br/>Perhaps live a peaceful life through hunting and gathering<br/>Or wage war against other warriors and clans to conquer over all.<br/><br/>Follow your heart and choose your path.<br/>This is where your story begins... Mir4.<br/><br/><h3>*Beauty and elegance of Oriental movement</h3>Experience the elegant style of oriental martial arts combined with real-time fluid combat motions.<br/><br/><h3>*All paths lead to your growth</h3>Every trade has its master! Tired of hunting? Try gathering or mining.<br/><br/>All of your activities in MIR4 will ultimately reward you with character growth.<br/>Your time and effort spent in-game never goes to waste!<br/><br/><h3>*Who will claim the treasure. Free Looting</h3>Unprecedented Free-for-All looting system where anyone has the right to claim loot.<br/><br/>Be aware of others when attempting to loot!<br/><br/><h3>*Hidden Valley Capture</h3>Hidden Valley, the core of MIR4's economy.<br/><br/>Monopoly through control or mutual gain through coexistence.<br/>Which path will your clan choose?<br/><br/><h3>*From my battle to our war, Castle Siege.</h3>Face the challenges of life and death alongside Clan-mates<br/><br/>Compose an epic story through countless glorious battles<br/>At the end of your conquest, the strongest Clan will be born!<br/>For your Clan's honor and legacy, start your war now in MIR4!<br/><br/><br/>A true cross-platform massively multiplayer game that allows you to play with your friends from your PC and Android/iOS devices.<br/>MIR4 supports 12 different languages.", "metacritic": null, "released": "2021-08-24", "tba": false, "updated": "2023-09-25T05:41:50", "background_image": "https://media.rawg.io/media/screenshots/650/650350f286e4e809da148b9495031489.jpg", "website": "https://mir4global.com/", "rating": 2.15, "rating_top": 1, "added_by_status": {"yet": 4, "owned": 357, "toplay": 1, "dropped": 11, "playing": 3}, "playtime": 3, "achievements_count": 0, "ratings_count": 20, "suggestions_count": 314, "game_series_count": 0, "reviews_count": 20, "platforms": ["PC", "iOS"], "developers": ["Wemade Co", "Wemade Next"], "genres": ["Action", "Adventure", "RPG", "Massively Multiplayer"], "publishers": ["Wemade Co", "Wemade"], "esrb_rating": "Teen"}