{"id": 644743, "slug": "one-drunken-knight", "name": "One Drunken Knight", "name_original": "One Drunken Knight", "description": "<strong>What dost hast happeneth last night?</strong><br/><br/>You are a knight, a curse knight... You wake up in the desert, hungover, unable to remember what happened to you (obliviously). You find the an old Scottish owl, the guardian of the Holy Grail, just lying there next to your smelly bulk! He's got a foul mouth on him and tells you that you need to drink to stay alive and get special powers. Great lesson for the wee kids, I know...<br/><br/>You use your new-found powers to retrace your steps, drunk-box the skeleton army (which you awoke, of course), solve puzzles (often by peeing on them) and get back to your beautiful bride-to-be, all the while trying to piece together what happened last night.<br/><br/>It's a story of a medieval bachelor party gone very wrong... You'll need to escape the desert and find your way out of the Great Pyramid, make friends with different people and creatures to help you along the way, walk through a sexy-parrot-infested jungle, hire a skeleton pirate to get you across the sea (guess how that turns out), visit the underwater world of the sirens (of course), save a bunch of kids from fanatical priests, and so on. Fun for a very limited part of the whole family...<br/><br/>Gameplay is a \"pee-zle\" platformer with a rich story-driven humoristic conversation system. You've never played a game like this... And if you did, you're too drunk to remember anyway... Cheers!", "metacritic": null, "released": null, "tba": false, "updated": "2021-08-06T03:16:48", "background_image": "https://media.rawg.io/media/screenshots/ee8/ee81b46c982068eac1cae3492a8f8d3b.jpg", "website": "http://www.OneDrunkenKnight.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 330, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Professional Imagination", "Captainsteff"], "genres": ["Indie"], "publishers": ["Professional Imagination"], "esrb_rating": null}