{"id": 644836, "slug": "top-troops", "name": "Top Troops!", "name_original": "Top Troops!", "description": "The war is raging! <br/>BUILD your army, TRAIN &amp; MERGE your troops and LEAD them into massive battles. Your order, your command.<br/><br/>Customize your army and fight alongside swordsmen, archers, dragons, trolls and more! Careful, choosing their position on the field can have a big impact on whether you win or lose... You also need the brains as well as the brawn!<br/><br/>As your army emerges victorious from another bloody battle of the masses, you believe the end is nigh... Unfortunately, the Primal King stops for no one...<br/><br/>After bringing in more than 20 million players, the Social Empires Facebook game has been reborn, and with brand new mechanics:<br/>- QUICK, FUN &amp; EPIC BATTLES: Mass idle battles<br/>- MERGE &amp; UPGRADE YOUR TROOPS: Upgrade your units to knock down stronger enemies<br/>- EXPAND &amp; MANAGE YOUR KINGDOM: Reconquer the lost land to the evil forces of the Primal King<br/>- CHOOSE YOUR STRATEGY: Unique mechanics will determine whether your heroes succeed<br/>- PLENTY OF GAME MODES: including Campaign Mode and PvP Mode<br/><br/>Lead your armies to victory, choose from dozens of different strategies and command your troops to overcome the evil that has forsaken the world of Top Troops!<br/><br/>Top Troops is FREE to download and FREE to play. However, you can purchase in-game items with real money. If you wish to disable this, please turn off the in-app purchases in your phone or tablet’s Settings.<br/><br/>Enjoying Top Troops? Drop us a review.    :)", "metacritic": null, "released": "2021-07-20", "tba": false, "updated": "2021-08-06T04:18:37", "background_image": "https://media.rawg.io/media/screenshots/804/804598100da4dda9da655ac40505fbce_0C5ZblA.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 164, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Parrot Games"], "genres": ["Adventure", "Strategy"], "publishers": ["Parrot Games"], "esrb_rating": "Teen"}