{"id": 644868, "slug": "swords-n-slimes", "name": "Swords n' Slimes", "name_original": "Swords n' Slimes", "description": "<p>Click an drag entities on to the board. Held entities can be rotated by right- or middle-clicking, or by pressing Q or E. Right click an entity on the board to remove it.</p>\n\n<p>You are an evil wizard, living high in his mighty tower... Which a God has cursed you to never leave. Luckily for you, you're a craft wizard, and you can send minions to do your bidding for you. However, there's a catch - while you have all the info you need to prepare beforehand, you can't see the battle as it ensues, so you must use your knowledge of the heroes and your monsters to predict the outcome of the battle.</p>\n<p>This is a prototype for a puzzle game that involves you trying to plan out how a number of AIs would behave given any initial state - when you start the program, you are shown the first 10 turns, and then when one of the factions is defeated, you will be shown the final 10 turns. </p>\n<p>In its current state, you can place, move, and remove the two basic entities: Swords or Slimes. Swords will patrol a rectangular area in the center, while Slimes will (attempt  to) patrol the edge of the board. Both will attack the other if they come close.</p>\n<p>There are a number of bugs, and it's not perfect - but I'm really happy with my little simulation. I hope you enjoy.</p>\n\n<p>Submission for Neumont Game Jam - CURSED</p>", "metacritic": null, "released": "2021-08-06", "tba": false, "updated": "2021-08-06T04:27:42", "background_image": "https://media.rawg.io/media/screenshots/53b/53bfe3f7cff1fc825139ccb520d747fb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 23, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Ryder James"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}