{"id": 644945, "slug": "hearithen", "name": "Hearithen", "name_original": "Hearithen", "description": "<p>Hearithen is a Virtual Pet game where, instead of pets, you get to raise up to 4 elemental Witches at the same time! 🌟 </p>\n<p>You may rise 1 Witch from each of the 4 elements (Air ♠️ Fire ♣️ Water ♥️ and Earth ♦️), your goal is to train them to their full potential and make way for your next generation of Witches!</p>\n<p>Each individual Witch has their own quirks, some get hungry faster, some are very talented at magic, some need to socialize more, etc. Get to know them, and you'll be able to take better care of them!</p>\n<p>Depending on the element, the food you may feed your Witch, the minigames you can play to train them and their needs will vary a lot. Find the element that suits you best!</p>\n<p><strong>--- Before playing! ---</strong></p>\n<ul><li>Please make sure to download and take a look at the guide!</li><li>If you pause the game / put it in the background, it will stop running but the stats will update after reopening. You will <strong>not </strong>get notifications when your Witch needs something, so make sure to close the game completely if you are not going to be able to play for a while!</li><li>Opening the game after having it closed for a while will also update some stats, but their health will not worsen. Make sure to feed them right after opening the game each time!</li><li>Since we haven't found anyone to test the MAC and Linux builds yet, we haven't uploaded them here yet. If you are able to test either of them, please come to our Discord server and help us out!</li></ul>\n<p><strong>--- Links ---</strong></p>\n<p>Twitter: https://twitter.com/TeamNaipals</p>\n<p>Discord: https://discord.gg/t76EPNrEf3</p>\n<p>Ko-fi: https://ko-fi.com/naipals</p>", "metacritic": null, "released": "2021-08-05", "tba": false, "updated": "2021-08-06T04:47:27", "background_image": "https://media.rawg.io/media/screenshots/882/882d7073a699bdf1ed89890ead404889.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 120, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Android"], "developers": ["Naipals"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}