{"id": 6449, "slug": "space-station-frontier-hd", "name": "Space Station: Frontier HD", "name_original": "Space Station: Frontier HD", "description": "&amp;quot;...an incredibly addicting and challenging game... Space Station: Frontier is a well-rounded and well-designed game that&amp;#39;s perfect for any strategy gaming fan. One word of warning: once you get sucked in, this game is very hard to put down.&amp;quot;<br/>cnet.com<br/><br/>&amp;quot;The game just looks, sounds, and plays like a well oiled extraterrestrial machine.&amp;quot;<br/>appsmile.com<br/><br/>&amp;quot;...easily justifies the iPad as a viable gaming platform. 5/5&amp;quot;<br/>infoaddict.com<br/><br/>As overseer of a deep space mining operation you&amp;#39;d expect it to be a peaceful job. No such luck with a mysterious alien race violently contesting your claim to the territory!<br/>Harvest precious energy, fortify your station, build up your firepower to defend humanity&amp;#39;s domain on this new frontier!<br/><br/><br/>FEATURES<br/><br/>• Construct weaponry and mining tools using an intuitive tower defense style interface.<br/><br/>• Design and power vast networks of structures, then defend them against alien incursion!<br/><br/>• Earn upgrades and unlocks for your space station to increase its power and abilities!<br/><br/>• Story-based campaign mode where you are humanity&amp;#39;s last chance for survival.<br/><br/>• Play one of three freeform, endless modes and compete with other players worldwide using the online leaderboards.<br/><br/>• Mission mode provides quick tactical challenges. Beat a scenario to earn achievements!<br/><br/>• Playable in portrait or landscape - at any time!<br/><br/>• Interactive mini-map!<br/><br/>• Multiplayer head-to-head! Play against another player on iPhone, iPod Touch or iPad! Needs LAN WiFi or Bluetooth.<br/><br/>• GameCenter integration provides online leader boards and lots of achievements to earn.<br/><br/>• Awesome music &amp;amp; sound effects by Earcom.", "metacritic": null, "released": "2010-04-23", "tba": false, "updated": "2019-10-22T14:28:54", "background_image": "https://media.rawg.io/media/screenshots/c98/c9879d09be211fb8bea85be88407c660_Pq6rRMj.jpeg", "website": "http://www.origin8.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 123, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Origin8"], "genres": ["Action", "Strategy"], "publishers": ["Origin8 Technologies"], "esrb_rating": "Everyone 10+"}