{"id": 64499, "slug": "hive-quest", "name": "Hive Quest", "name_original": "Hive Quest", "description": "Hive Quest is an immersive real time strategy game set in a mythical woodland filled with ancient magic, strange creatures &amp; intriguing puzzles. As the Hive Mind you will guide your insect tribe on a hazardous adventure to find safety after a terrible cataclysm. Explore mysterious locations with the help of your pet Shrublet, find allies, uncover the story behind the Old Orchard and fight against other tribes. Do you have what it takes to re-establish your Hive’s fortunes and seek out the mythical ‘Sunny Uplands’?<br/><br/>– Guide your embattled tribe on a quest to find fortune, glory and a new home.<br/>– Interact with a wide variety of crazy puzzles and strange goings on as you try to make sense of it all.<br/>– Explore the mysteries of the Deep Woods and uncover new allies and enemies.<br/>– Battle against other hives to maintain control of your territory.<br/>– Manage resources and build your Hive into a powerful kingdom, filled with hard working drones.<br/>– Take mind control of your drones and send them into unknown territory on dangerous missions.<br/>– Launch attacks on enemy Hives &amp; dangerous creatures that stand in your way.<br/>– Obtain woodland elementals as pets and upgrade them to fight and do your bidding.<br/><br/><br/><br/><br/><br/><br/><br/>", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:55:23", "background_image": "https://media.rawg.io/media/screenshots/a4d/a4dd623219c9c86d5f5d5e9f4a71d834.jpg", "website": "http://www.goldenheartgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 413, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Golden Heart Games"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["Golden Heart Games"], "esrb_rating": null}