{"id": 644955, "slug": "break-carry-kill", "name": "Break, Carry, Kill", "name_original": "Break, Carry, Kill", "description": "<p><strong>INSTRUCTIONS BELOW</strong></p>\n<p>The B.C.K. has contracted you to investigate a potentially lucrative mining world. They didn't expect the wealth of minerals below- or the aggressive fauna lurking just out of sight. Luckily, you came prepared. Deploy and command your three types of drones to tunnel through rock, gather up valuable ores, and defend your central drill-base. </p>\n<p>Or rather... <strong>BREAK, CARRY, KILL.</strong></p>\n\n<p>Controlled with mouse only (for now)</p>\n<p>Move the camera by dragging with middle-mouse click, and zoom with scroll wheel<br/></p>\n<p>Click on the Drill Base (orange octagon with spinning light) to open its menu and spawn a drone of your choice:</p>\n<ul><li><strong>Breakers </strong>drill through nearby blocks, opening up paths and freeing minerals</li><li><strong>Carriers</strong> pick up freed minerals, and transfers them to the Drill Base upon return</li><li><strong>Killers </strong>will automatically shoot at monsters, defending the Drill Base and other drones</li></ul>\n<p>You can currently have up to 2 drones at once.</p>\n<p>Click the drone, then click anywhere else to instruct it to walk there. Clicking the drone twice will open its menu, which gives the option of self-destructing the drone, if needed.</p>\n<p>Right-clicking, or clicking on the sidebars, will deselect the drone.</p>\n<p>Clicking the buttons on the left sidebar with center the camera on the corresponding drill base (orange octagon) or drone (colored X-shape)</p>\n<p>Please bear with this WIP game</p>", "metacritic": null, "released": "2021-08-05", "tba": false, "updated": "2021-08-06T04:50:05", "background_image": "https://media.rawg.io/media/screenshots/aa4/aa4c0306f45ea103d0f74293c6f19493.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 94, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["gocolumbia"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}