{"id": 64506, "slug": "cosmic-top-secret", "name": "Cosmic Top Secret", "name_original": "Cosmic Top Secret", "description": "<p>Do we really know each other? Cosmic Top Secret plunges players into a fantastic world of intrigue and espionage where all is not what it seems. Based on actual events, play as T and help her unravel the truth about her parents’ work as spies for the intelligence services during the Cold War.<br />\nBrought to life through its cast of colourful characters, Cosmic Top Secret features a truly unique storybook world made entirely from paper and cardboard. 7 years in the making and formed from hours of real-life audio and documentary footage; this is an incredible real-life mystery like you’ve never seen before.Features<br />\nAn unforgettable true story<br />\nJoin T and a cast of 30 unique characters on a journey of discovery as she seeks to reveal the secrets surrounding her parent’s roles within the intelligence services during the Cold War.<br />\nHours of real video footage and audio<br />\nCosmic Top Secret brings its true story to life through real video and audio recordings, as well as dozens of documents and files from the Cold War era.<br />\nExperience an incredible storybook world<br />\nTruth meets fantasy in a storybook world made entirely of paper and cardboard. Click to interact with environments and flick, float, roll and glide T on her journey.<br />\nHours of gameplay<br />\nUncover clues, complete the secret dossier and gather 400 collectables across 6 levels for hours of playtime.Sponsers</p>", "metacritic": 74, "released": "2021-05-21", "tba": false, "updated": "2021-05-27T12:24:19", "background_image": "https://media.rawg.io/media/screenshots/aeb/aeb98699e4a65fd6d1d412050972e71b.jpg", "website": "http://cosmictopsecretgame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1, "beaten": 1, "toplay": 5}, "playtime": 0, "achievements_count": 12, "ratings_count": 1, "suggestions_count": 367, "game_series_count": 0, "reviews_count": 1, "platforms": ["Nintendo Switch", "Xbox One", "PlayStation 4", "PC", "macOS"], "developers": ["Klassefilm"], "genres": ["Adventure", "Indie", "Puzzle"], "publishers": ["Nakana.io"], "esrb_rating": null}