{"id": 6450, "slug": "wind-up-robots", "name": "Wind Up Robots", "name_original": "Wind Up Robots", "description": "Critics are LOVING Wind Up Robots!<br/>* Named &amp;#39;Gaming App of The Day&amp;#39; on Kotaku<br/>* Featured here four times and counting!<br/>* Nominated &amp;quot;Game of The Week&amp;quot; on TouchArcade<br/><br/>From giant B-Movie robots, iron giants and beeping droids, robots captivate our hearts. Part imaginary friend part tin man they fill our dreams. <br/><br/>For Zach though they stand between peaceful slumber and the nightmares that have haunted him since his birth. Enter the world of Wind Up Robots where the battlefield is the dreamscape of a boy with a powerful destiny. <br/><br/>&amp;quot;It’s downright fun and engaging, and it certainly doesn’t lack in the challenge department.&amp;quot;<br/>&amp;quot;...a base defense game with a fantastic story, loads of polish, an awesome upgrade system, and great gameplay. &amp;quot;<br/>&amp;quot;Soma Games has done an incredibly good job.&amp;quot;<br/>&amp;quot;Wind Up Robots is remarkably deep.&amp;quot;<br/><br/>Recent Enhancements: <br/>* Much improved controls <br/>* Better level balancing <br/>* Integrated range indicators. <br/><br/>Features:<br/>* 7 totally unique robots defenders including sniper, healer and SAM launcher.<br/>* 12 increasingly creepy enemies to blow back to the darkness.<br/>* 28 levels from kids play to legendary brawls!<br/>* Dynamic upgrade system to make powerful robots even stringer, faster, more devastating to those dastardly creatures.<br/>* Powerful super weapons to back you up when robots slip.<br/>* Special costumes to personalize your robots and get ready for the upcoming Wind Up Theatre...<br/><br/>Help keep the monsters at bay. Explore Zachs world in a fully 3 dimensional world. Choose your robots to battle an onslaught of monsters from cow spawning alien ships to Beaver toothed t-rexes. Don&amp;#39;t miss out!  Wind Up Robots will delight and wonder kids both young and old.<br/><br/>Wind Up Robots is only compatible with iOS 5 devices.", "metacritic": null, "released": "2011-12-15", "tba": false, "updated": "2019-10-22T14:28:54", "background_image": "https://media.rawg.io/media/screenshots/d52/d52bd5ba94d1150a8b4f05580507be1d.jpeg", "website": "http://thatwinduprobotgame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 120, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Soma Games"], "genres": ["Strategy", "Arcade"], "publishers": ["Soma Games"], "esrb_rating": "Everyone 10+"}