{"id": 64526, "slug": "rustler", "name": "Rustler", "name_original": "Rustler", "description": "<p>Grand Theft… Horse<br />\nIn Rustler, you’re not a hero. This time, you weren’t born to be a mighty knight and you won’t become the king after killing a dragon.<br />\nYou’re just a medieval thug, a simple criminal who’s trying to get rich and not killed in the meantime. Easy to say, harder to do - especially when you’re on the rock-bottom of feudal social ladder. But who said you need to obey the law? Throw a knight off his horse, lose the chase and roam around the castle town like a boss.Every choice has its consequences… but not here!<br />\nEnjoy your freedom in an open-world, medieval-inspired setting. You won’t find here either historical, or political correctness. Prepare yourself for wild, over-the-top action and parody of RPG cliches. Take a job from one of various fractions: spoiled priests, exploitative merchants, corrupted city guards or boorish villagers. Or... just give up the plot like you always do and make some mess in the city using melee and ranged weapons.Different times, same sh… style<br />\nExperience old school, skill-based combat in fast-paced gameplay. Fight on foot or hop on one of the mounts (like horses or wagons). Slash your enemies with a sword, impale them upon your spear... or just use a simple pitchfork if you don’t have any fancy weapons. Take them down from distance with a bow or crossbow.Friends? I don’t know those peasants…<br />\nPlay the online multiplayer mode, classic way: grab a few friends, choose the map, game mode (deathmatch, CTF, jousting tournament or race) and play! No XPs, loot boxes, and skins - just pure rampage!</p>", "metacritic": 62, "released": "2021-08-31", "tba": false, "updated": "2024-01-22T16:20:38", "background_image": "https://media.rawg.io/media/games/fce/fcee8d0b8c747e64c0e19103f8b6bb96.jpg", "website": "", "rating": 2.58, "rating_top": 1, "added_by_status": {"yet": 58, "owned": 1082, "beaten": 12, "toplay": 32, "dropped": 19, "playing": 3}, "playtime": 1, "achievements_count": 76, "ratings_count": 30, "suggestions_count": 284, "game_series_count": 0, "reviews_count": 31, "platforms": ["Xbox Series S/X", "Xbox One", "PC", "PlayStation 4", "PlayStation 5", "Nintendo Switch"], "developers": ["Jutsu Games"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Games Operators"], "esrb_rating": null}