{"id": 645224, "slug": "the-kingdom-savior", "name": "THE KINGDOM SAVIOR", "name_original": "THE KINGDOM SAVIOR", "description": "INTRODUZIONE\r\n<p><em>The Kingdom Savior</em> è un gioco rpg nel quale impersonificherai Reid, un giovane abitante del grande Regno deciso a entrare nell'esercito per seguire le orme del padre. La vita di Reid viene però stravolta quando un gruppo di terroristi che si fa chiamare l'<strong>Impero </strong>attacca la sua città natale, Boschia. </p>\r\nPERSONAGGI\r\n\n<strong><em>REID</em></strong>\n<p><em> </em></p>\n<p><strong>Reid</strong> è un giovane abitante del grande Regno deciso a entrare nell'esercito per seguire le orme del padre.  È un ragazzo gentile e determinato che non si fa abbattere da niente.</p>\n<strong><em>GALE</em></strong>\n\n<p><strong>Gale</strong> è il migliore amico di Reid. Figlio di un falegname, si imbarca insieme a Reid in una grande avventura per proteggere il Regno. </p>\n<em><strong>KASEY</strong></em>\n\n<p><strong>Kasey</strong> è una giovane maga che sente su di se il peso delle aspettative per essere figlia di uno dei più grandi magi del Regno.  Si unirà al gruppo di Reid per dimostrare a tutti le proprie capacità. </p>\n<em><strong>ELIOT</strong></em>\n\n<p><strong>Eliot</strong> è un giovane chierico abitante di una città distrutta dall'Impero. Si unirà al gruppo di Reid per salvare suo fratello, che ha visto portare via dall'Impero.</p>\r\nGAMEPLAY\r\n<p><em>The Kingdom Savior</em> presenta un battle system a turni, dove le azioni selezionate durante il turno vengono eseguite immediatamente. Sferra abilità speciali utilizzando i <strong>Punti Magia </strong>e i<strong> Punti Tecnica</strong>, ed esplora un vasto mondo ricco di missioni da completare e posti da visitare!</p>\n\n<p><em>Questa demo comprende solo le prime due Missioni Principali (circa mezz'ora di gameplay), un solo personaggio giocabile, e solo la lingua italiana. Buon divertimento!</em><br/></p>", "metacritic": null, "released": "2021-08-04", "tba": false, "updated": "2021-08-06T05:56:15", "background_image": "https://media.rawg.io/media/screenshots/832/832d2f77e1990a0527fa68bfec3aad88.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 157, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Antogrammer"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}