{"id": 645357, "slug": "scalex-official-game", "name": "Scalex - Official Game", "name_original": "Scalex - Official Game", "description": "<p> THIS GAME WAS MADE FOR THE AUSTRALIAN STEM VIDEO GAME                               CHALLANGE!</p>\n<p>If you want to Support this game more, leave a Favourite and Love on the scratch website! : https://scratch.mit.edu/projects/544499479/</p>\n<p>- All the game was made by me and my friend Zach</p>\n<p>- Music was produced using Soundtrap</p>\n<p>- Sprites were made all manually</p>\n<p>- All assets are original except or some text fonts</p>\n<p>- INSTRUCTIONS ARE IN THE GAME</p>\n\n<p>You are a legendary hero named Scalex who was born a Lizard with the ability to scale through sizes. A half robotic scientist (Named Mecha) attempted to mutate animals to have human like ability and created Scalex, but the mutation machine couldn't handle Scalex's power and the building exploded as Scalex and the scientist fell from the sky, Scalex managed to survive but the scientist was destroyed along with the building, now the scientists son (Named Nexus) is hungry for revenge and wants payback for Scalex obliterating his father and now sending all of his robots to destroy him. Now your only goal is to destroy each robot and snap Nexus back to his senses! Lets Go! The game is a fast-paced action platformer and is intended for younger audiences. (but older ages can obviously play it too)</p>", "metacritic": null, "released": "2021-08-04", "tba": false, "updated": "2021-08-06T06:31:25", "background_image": "https://media.rawg.io/media/screenshots/d6c/d6ca97914b84122d973ccdd759d21b03.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 48, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Web"], "developers": ["XenoDev"], "genres": ["Action", "Platformer"], "publishers": [], "esrb_rating": null}