{"id": 6454, "slug": "legends-of-callasia", "name": "Legends of Callasia", "name_original": "Legends of Callasia", "description": "The Great Callasian War rages across the lands. Choose a faction and awaken the legendary heroes to lead your armies and destroy enemy forces! Build cities, conquer kingdoms, and form or break alliances on tabletop-style maps with bonus cards that can turn the tide of battle. Follow the story of the factions in single-player campaign missions, or test friendships in online multiplayer with an original simultaneous turn-based system that adds deep strategic elements in predicting other players’ moves. Fight your way to the top of the leaderboard, and dominate the fantasy world of Callasia!<br/><br/>Note: This is a free demo which includes the tutorial, starter campaigns and four heroes for each faction, and three maps for skirmish and multiplayer. The full version can be unlocked through a one-time purchase from within the game or via DLC.Full Version Features: <br/><ul><li>Three Factions to choose from: Hundred Kingdoms, Faeborne, and Revenant<br/></li><li>Over 25 Heroes with different classes, traits, and bonus cards<br/></li><li>30 Single-Player Campaign Levels worth almost 40 hours of gameplay<br/></li><li>More than 40 tabletop-style Skirmish/Multiplayer maps playable up to 8 players<br/></li><li>Pay once and play on all platforms: also available on iPad and Android</li></ul>", "metacritic": null, "released": "2016-06-10", "tba": false, "updated": "2019-10-22T14:28:54", "background_image": "https://media.rawg.io/media/screenshots/470/470084264b342db36cf18165b32b9a2a.jpeg", "website": "http://legends.boomzap.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 4, "owned": 206, "beaten": 1}, "playtime": 1, "achievements_count": 29, "ratings_count": 3, "suggestions_count": 451, "game_series_count": 0, "reviews_count": 3, "platforms": ["macOS", "iOS", "PC"], "developers": ["Boomzap", "Boomzap Entertainment"], "genres": ["Strategy", "Board Games"], "publishers": ["Boomzap Pte", "Boomzap Entertainment"], "esrb_rating": "Everyone 10+"}