{"id": 6455, "slug": "captain-temporium", "name": "Captain Temporium", "name_original": "Captain Temporium", "description": "Captain Temporium is a classic fast paced shoot 'em all up style arcade game. <br/><br/>An evil time traveling empire has altered the fabric of time by invading contemporary history. They've taken over our technological achievements, starting with the dawn of flight. Captain Temporium is the last remaining pilot of the temporal air force. She desperately fights the enemy wherever she finds them – in the skies from the early 20th century and on into the future.<br/><br/>Now only you can save our history and future. Take control of her time machine and fight the endless onslaught!<br/><br/><br/>Gameplay hints:<br/><br/>• Fire your weapon wisely – it may overheat and needs cooling then.<br/>• Defend yourself with the shields but always watch out that you don’t run out of shield energy!<br/>• Collect parachutes to get new shield energy, weapon improvements, cooling improvements, fuel for the afterburner, bonus lives or bonus score.<br/>• Afterburner might help to escape enemy bullets or to get a parachute before it disappears.<br/>• Don’t fire at the parachutes!<br/>• Watch out! The enemy could be hidden by the clouds, don’t run into it! <br/>• Cloud cover will increase at higher levels and overall visibility will get worse.<br/>• Some enemies need more hits than others. Some will fire missiles at you.<br/>• The boss at the end of each level can be huge, really huge! It takes many hits to kill each boss.<br/>• Try to ram the with your shields if you still have plenty of shield energy left.<br/>• Overall speed and number of enemies increases with each new level.<br/>• Use the few slower levels at the beginning to collect as many parachutes as possible. <br/>• Keep the main menu open and watch the AI vs AI battles to learn how the AI plays the game.", "metacritic": null, "released": "2016-11-23", "tba": false, "updated": "2020-12-11T03:52:18", "background_image": "https://media.rawg.io/media/screenshots/25d/25d359e2b1118dce4c27952ae1c10c96.jpeg", "website": "http://www.captaintemporium.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 102, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mark Hessburg"], "genres": ["Arcade", "Casual"], "publishers": ["Mark Hessburg"], "esrb_rating": null}