{"id": 64561, "slug": "raiders-of-the-lost-island", "name": "Raiders Of The Lost Island", "name_original": "Raiders Of The Lost Island", "description": "Raiders Of The Lost Island is a semi-cooperative party game for up to 4 players, where you and your weird looking friends are hunting treasures on the mysterious Lost Island.<br/><br/>Collect the most riches to win this race! Don't hold back and don't be shy to push one or two pretenders into the ocean! What if they can't swim? It's all for a good cause, right?<br/>Your cause!<br/><br/> <br/><br/>However, the island is cursed to sink under the rising waters and soon everyone will die if none of you greedy bastards take the time to build the escape boat before the final wave. Of course, that hard working lad, doesn't have to be you. There's plenty of losers who don't really need those shiny diamonds!<br/><br/>Keep an eye on who gets ahead and join the others to take down the leader and steal his booty! If by any miracle your party survives, you get to count your wealth and possibly win as the richest player. If greed gets the best of you and you all drown, well, then none of this matters... everyone will lose!<br/><br/><strong>ADVENTURE CAMPAIGN</strong><br/>For the true raiders, who really know what they're doing, a series of lost islands awaits to be explored, one by one, in the most dangerous adventure. Collected treasures will be summed up in your hideout, where you all return after each raid, and the winner will be declared at the end of the campaign.<br/><br/>Long adventures give you the chance to unlock special equipment and to complete your most precious collection of idols. Now, these idols, that's something to hold on to! There are 5 different pieces and if you own them all before the final raid, they'll score big time for you!<br/><br/><br/><br/>And don't forget, if you have a hard time, feeling poor and miserable, you can join forces with another sad raider and form a team. If you don't manage to do better, at least you'll have a shoulder to cry on.<strong>FAMILY FRIENDLY</strong><br/>For families or friends who prefer the cooperative side over the competitive one, it's perfectly fine to play friendly as a big team, without shedding any tears. Small kids, who just learn how to play, can team up with their parents or bigger brothers.<br/><br/>The controls are simple enough: only one stick and 2 buttons. Sharing the keyboard or the gamepads is also supported.<strong>PLAYING SOLO</strong><br/>For the best experience and a maximum amount of fun the recommended number of players is 3 or 4. But, you can challenge yourself as a solo player and see how much treasure you can collect and get away with, until your friends arrive and the \"real\" game begins!<strong>WIN ALONE OR DIE TOGETHER!</strong><br/>Grab your friends and venture to the Lost Island! Seek your fortune, survive together and get rich in the process! Don’t let the greed get the best of you or you will all be sleeping with the fishes on the bottom of the ocean!", "metacritic": null, "released": "2017-09-14", "tba": false, "updated": "2020-04-15T10:23:41", "background_image": "https://media.rawg.io/media/screenshots/5e4/5e47d522b9edaaf8a9258202ca344c79.jpg", "website": "http://www.raidersofthelostisland.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 20, "ratings_count": 0, "suggestions_count": 470, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Last Tales", "Alexandru Simion"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Last Tales"], "esrb_rating": null}