{"id": 645816, "slug": "dalton-goes-to-the-store", "name": "Dalton Goes to the Store", "name_original": "Dalton Goes to the Store", "description": "<p>In this short comedy RPG, you play as Dalton McDoggo, a dachshund who loves putting barbecue sauce on pretty much everything he eats. But tragedy strikes when Dalton runs out of barbecue sauce! To make things worse, all the barbecue sauce at his local grocery store has been stolen! It's up to Dalton to assemble a team to find out who the thief is, fight them, and take the condiments back!</p>\n<ul><li>Explore a locally-owned grocery store with cheesy music!</li><li>Buy 12 different items to refill your health (HP), to refill your Special Points (SP), to equip weapons, armor, and a stick of butter (for agility), and to wake up allies who fall asleep (status effect cure)!</li><li>Meet a cast of quirky characters, including Ella, a grocery clerk who would rather be working on her gaming channel, Frida, a perky and friendly tourist who loves small businesses, and Izzy, an animatronic character who's NOT evil or haunted. There's also a talking chicken. You cannot recruit the chicken, but it will give you hints!</li><li>Fight an intimidating boss!</li><li>Use SP for elemental powers! Fire, earth, water, and air! Nobody knows why they have these powers!</li><li>Choose from one of two different endings!</li><li>Discover secrets!</li><li>Tons of silly jokes, puns, and references!</li></ul>\n<p>WARNING: This game contains mentions of absurd, twisted, and frankly stupid food combinations involving barbecue sauce. Proceed with caution.</p>\n<p>In all seriousness, this game is family-friendly. No inappropriate content.</p>", "metacritic": null, "released": "2021-08-02", "tba": false, "updated": "2021-08-06T08:29:17", "background_image": "https://media.rawg.io/media/screenshots/631/63185fea0cc69fc81ed22c4e2a2bfc39.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 49, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Foxalopod"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}