{"id": 645820, "slug": "soda-cans-early-build-demo", "name": "Soda cans (Early build demo)", "name_original": "Soda cans (Early build demo)", "description": "Stats off the game\r\n<p>The game is still in early development build so there is maybe some bugs here and there. There is a feedback buttion where you are more then welcome if you have any ideas/changes to the game, or if you find any bugs when you are playing. </p>\r\nHow are you planning on involving the Community in your development process?\r\n<p>We will listen to evey thing that is going to happen in the Community. The Community comes first before $$. if the Community dont like something, we will try our best to change that. The Community means a lot to us. If you dont listen to your Community, that why are you share your game in the first place? We are open for any questions, so feel free to contact us at anytime you want.</p>\r\nWhat is this game about?\r\n<p>Soda cans is a game with Multiple modes.<br/>Where you have to surival from killing soda cans that wanted to kill you.<br/>Surival as long as you can that is the main goal in this game.<br/>The game is a littel funny meme game, that is all about just having fun.</p>\r\nHow many are working on this game?\r\n<p>There is  1 full time worker who is working on this game, the rest off the team are freelancers who work once in a while work at the game. </p>\r\nKey Features in the demo\r\n<p>1 modes as of right now<br/>1  maps as of right now.<br/>1  Soda cans that wanted to kill you as of right now<br/>1  Weapon as of right now</p>\r\nHow is the full game going to be?\r\n<p>First off all the full game will looks much better and will runs better.Remember this is just a test verison. There is still a LOT to change and to add to this game. But there will be 3 maps at launch day, and a lot of Weapons (We not sure yet much many) But there will be multi weapons to play with. The game will have 3 soda cans that will try to kill you. The game will also have a BIG badass boss that wanted to kill you.</p>\r\nHow long will the game be in Early demo build?\r\n<p><em>As of right now are we not sure,somethings things can go faster than you have anticipated with. But there can also happen some things that can slow down the development. That why we are staying we not sure. There is no one who knows how the future is going to be, no one can wacth in the future. Everything can happen. But if things goes as plans, will we reckon it will take 6 to 12 months.”</em></p>", "metacritic": null, "released": "2021-08-02", "tba": false, "updated": "2021-08-06T08:30:18", "background_image": "https://media.rawg.io/media/screenshots/05d/05d22a4bf4f9a756febc5079a3207124.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 168, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Viktus Games"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}