{"id": 6459, "slug": "candy-crush-saga", "name": "Candy Crush Saga", "name_original": "Candy Crush Saga", "description": "<p>Candy Crush Saga, from the makers of Candy Crush Soda Saga<br />\n&amp; Farm Heroes Saga!<br />\nJoin Tiffi and Mr. Toffee on their sweet adventure through the Candy Kingdom. Travel through magical lands, visiting wondrous places and meeting deliciously kooky characters! Switch and match your way through hundreds of fun levels in this delicious puzzle adventure. The sweetest game just keeps getting sweeter!<br />\nTake on this deliciously sweet Saga alone or play with friends to see who can get the top score!<br />\nCandy Crush Saga is completely free to play but some optional<br />\nin-game items will require payment.<br />\nYou can turn off the payment feature by disabling in-app purchases in your device’s settings.<br />\nCandy Crush Saga features:<br />\n● Tasty ways to play: Target Score, Timed Levels, Drop Down Mode and Order Mode<br />\n● Collect sugar drops to progress along the Sugar Track for super sweet surprises!<br />\n● Spin the Daily Booster Wheel for a delicious prize<br />\n● Pass level 50 to unlock Dreamworld and escape reality with Odus the Owl<br />\n● Unwrap delicious environments and meet the sweetest characters<br />\n● Tasty Candies, wrapped and striped Special Candies, Color Bombs and various other magical boosters to help with challenging levels<br />\n● Hundreds of the best levels in the Candy Kingdom with more added every 2 weeks for your entertainment<br />\n● Leaderboards to watch your friends and competitors!<br />\n● It&#39;s easy to sync the game between devices and unlock full game features when connected to the Internet<br />\nVisit https://care.king.com/ if you need help!<br />\nFollow us to get news and updates;<br />\nfacebook.com/CandyCrushSaga<br />\nTwitter @CandyCrushSaga<br />\nhttps://www.youtube.com/user/CandyCrushOfficial<br />\nhttp://candycrushsaga.com/<br />\nHave fun playing Candy Crush Saga!<br />\nMinimum iOS version recommended: 5.1.1</p>", "metacritic": null, "released": "2012-11-14", "tba": false, "updated": "2023-11-09T18:10:35", "background_image": "https://media.rawg.io/media/screenshots/51d/51dd944987e4efb74b4bfd9cf0999d40.jpg", "website": "http://candycrushsaga.com/", "rating": 3.29, "rating_top": 3, "added_by_status": {"yet": 2, "owned": 49, "beaten": 8, "dropped": 39, "playing": 3}, "playtime": 1, "achievements_count": 0, "ratings_count": 32, "suggestions_count": 160, "game_series_count": 0, "reviews_count": 34, "platforms": ["Android", "iOS", "PC"], "developers": ["King"], "genres": ["Arcade", "Casual", "Puzzle"], "publishers": ["King.com"], "esrb_rating": null}