{"id": 645957, "slug": "video-editor", "name": "Video Editor", "name_original": "Video Editor", "description": "<p>Video Editor App provides bundle of features like Cut, Crop, Compress, video to audio, Video Mixer, Video Joiner and Video Converter etc.</p>\n<p> Features of this Video Editor <br/> Video Cutter &amp; trimmer</p>\n<p>Trim and edit videos to cut off unnecessary scene. You can cut video clip from long video according to the length you need. Output video clip will be in the best quality</p>\n<p> Video Compress</p>\n<p>Compress long video without losing quality. You can also choose resolution to compress and convert your video according to needs.</p>\n<p> Video to MP3</p>\n<p>Convert your favorite song or sound in video to audio file quickly. MP3 and AAC format available with Bit rate.</p>\n<p> Video Mixer</p>\n<p>Add audio to any video file to edit videos and create cool funny video clips.</p>\n<p>Video Merger &amp; Video Joiner</p>\n<p>Merge or Join two video clips into one long video without losing quality. No crop &amp; very useful video editor feature.</p>\n<p> Video to Image</p>\n<p>Capture images from any video to make timeline story using this video editing app.</p>\n<p> Video Converter</p>\n<p>Convert videos into small size formats like flv, mkv, wmv and 3gp. It saves more than 80% size without losing much quality.</p>\n<p> Fast Motion &amp; Slow Motion</p>\n<p>Control video speed using fast motion / slow motion feature as you like. Adjust video speed from 0.5x to 2x options and create an interesting video by using this video editor.</p>\n<p> Video Cropper</p>\n<p>Crop video to any ratio you want like square, portrait, landscape, 2:3, 3:2 and 3:4 etc. Crop video </p>\n<p> Video to GIF</p>\n<p>Convert your favorite video into a really interesting gif. Save great video moments into a compact and easy-to-share image file <br/> Video Rotate</p>\n<p>Rotate video by different angles like 90 degree, 180 and 270 etc.</p>\n<p> Video Split</p>\n<p>Split or divide long video into parts so you can easily share on social media.</p>\n<p>Video Reverse</p>\n<p>Reverse video to create interesting and funny video clips.</p>\n<p> Photo to Video editor</p>\n<p>Create video from images and share to timeline story. You can also add music and different frames to make video more beautiful.</p>", "metacritic": null, "released": "2021-08-02", "tba": false, "updated": "2021-08-06T09:06:30", "background_image": "https://media.rawg.io/media/screenshots/ce3/ce33f82c52afdd822a9d11a9b19ade56.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 54, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["emaluaen"], "genres": [], "publishers": [], "esrb_rating": null}