{"id": 646, "slug": "her-majestys-spiffing", "name": "Her Majesty's SPIFFING", "name_original": "Her Majesty's SPIFFING", "description": "The Empire Staggers BackIn the wake of political developments during the summer of 2016 and the events that followed, Britain found itself increasingly isolated from global society. Frustrated by the demise of this once great nation Her Majesty the Queen concluded that the elected representatives at Westminster were no longer fit to govern her United Kingdom.<br/><br/><br/>Having dissolved parliament, returning the United Kingdom to an autocratic government, improvements were immediate and wide ranging. However, ever the pragmatist, Her Majesty concluded that, given the complications Britain was facing returning to a position of power on earth, perhaps it was time to focus her attention elsewhere... <br/><br/>Establishing S.P.I.F.F.I.N.G. (Special Planetary Investigative Force For Inhabiting New Galaxies) Her Majesty has turned to the stars in a bid to establish a new, Galactic British Empire!<br/><br/>Assuming command of the near futuristic space ship HMSS Imperialise and her crew (distinguished veteran and gentleman Captain Frank Lee English and Aled, his mild-mannered South Walean colleague) <strong>YOU</strong> will venture into the cosmos, solving puzzles, engaging in witty banter, deal with crippling claustrophobia, gradually succumb to the sustained exposure of cosmic radiation and so on, all for Queen and Country. <br/><br/>Heck, along the way, you may stumble into a few other folks venturing about the cosmos with their own intergalactic aspirations…<br/><br/><strong>***SPOILERS BELOW***</strong><br/>You will stumble into a few other folks venturing about the cosmos with their own intergalactic aspirations.", "metacritic": 60, "released": "2016-12-07", "tba": false, "updated": "2019-10-22T14:30:36", "background_image": "https://media.rawg.io/media/screenshots/0be/0be187ad58546514a84093123b2b98c5.jpeg", "website": "http://press.billygoat.tv", "rating": 3.5, "rating_top": 3, "added_by_status": {"yet": 6, "owned": 98, "beaten": 10, "toplay": 3, "dropped": 1}, "playtime": 2, "achievements_count": 103, "ratings_count": 7, "suggestions_count": 517, "game_series_count": 0, "reviews_count": 8, "platforms": ["iOS", "Xbox One", "PlayStation 4", "Nintendo Switch", "PC", "Linux", "macOS"], "developers": ["Billy Goat Entertainment", "BillyGoat Entertainment"], "genres": ["Adventure", "Indie", "Puzzle"], "publishers": ["Libredia", "Billy Goat Entertainment", "Billy Goat"], "esrb_rating": null}