{"id": 646029, "slug": "cow-creatively-organized-waffles", "name": "C.O.W. (Creatively Organized Waffles)", "name_original": "C.O.W. (Creatively Organized Waffles)", "description": "<p><em>Sort and rearrange tiles in this fast-paced puzzle game!</em></p>\n<p>C.O.W. 🐮 is a puzzle game inspired by my love for Lumines and other puzzle games like Meteos, PuyoPuyo and - of course - Tetris. <br/></p>\n<p>Pick and place blocks in the colored zones to destroy them and score big! The block's counter will go down when placed correctly ; once it reaches zero, they disappear and you get points. As the timer passes, new blocks are generated - so watch out, once the generators are all filled up, it's game over!<br/></p>\n<p>Will you be able to finish all 7 levels and get the biggest score?</p>\n<ul><li>7 levels featuring hand-drawn backgrounds, music and different gameplay mechanics</li><li>An arcade mode, and a level select / score mode</li><li>A pretty good start screen, if I say so myself</li><li>A trippy ending!</li></ul>\n<ul><li>Color-blind friendly mode (tested to the best of my capacity, feedback welcome!)</li><li>By default the game is played in \"Drag &amp; drop mode\". However it was designed with the \"Pick &amp; place mode\" which I find less straining for the fingers (and easier for faster levels!).</li></ul>\n<ul><li>Left click : pick &amp; place pieces</li><li>Left click pressed (costs 100 points) : clear a zone of all tiles inside</li><li>Right click/Q/W : rotate</li><li>Mouse wheel : next/previous piece</li><li>Mouse wheel click / Space bar : pass time</li><li>Escape, p : Pause </li></ul>\n<p>Like my previous game, this one has been on the back-burner for the last 10 years. Originally called \"Inside a cow\" the idea was a game about digesting ingredients inside a cow's multiple stomachs. So you digest it a bit in the first one, then you could go on in the second and third to continue digesting. Then the idea of multiple screen with different themes came and the design changed to get this. I kept the cow as the main theme because it was funny and I really really wanted to make this start screen. Isn't it cool? :D<br/></p>\n<p>Hope you have fun! Thanks for checking the game out 💚</p>", "metacritic": null, "released": "2021-08-02", "tba": false, "updated": "2021-08-06T09:24:26", "background_image": "https://media.rawg.io/media/screenshots/352/352b03b4d6566eb6b73b3ba4000fb100.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 111, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["LeSam"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}