{"id": 646077, "slug": "nations-merge", "name": "Nations Merge", "name_original": "Nations Merge", "description": "<p><strong>[Please read before playing:]</strong></p>\n<p>This game is pretty buggy and no-where near as polished as I'd like it to be. In order to have the best experience you might need to play it a few times to get the gist. I didn't have enough time to create a tutorial so this is basically everything you're gonna need to know: (if you're in a rush the first two are the most important and the rest can be learnt)</p>\n<p>•Click your nation to see your info (Your nations name and colour will be displayed on the top left-hand side of the screen, just find the nation that matches the colour)</p>\n<p>•Click on other nations to select them, this allows you to see their info but also lets you fight or send gifts to them.</p>\n<p>•Fight other nations to conquer them. There are a few factors to keep in mind when fighting other nations. A big one is how far away or close they are. Unless you're strong enough or have researched boats and carriages enough you probably wont be able to attack nations that are not adjacent to you. Another factor is climate. If a nation's climate is different from yours don't attack it unless you're much stronger or more developed than it.</p>\n<p>•Giving gifts are an easier way to grow, but it gives you less points. If a nation likes you enough it'll join you.</p>\n<p>•Researching can be used to get stronger. If you're surrounded by stronger countries and don't want to buy them over, researching is an easy way to get the upper-hand.</p>\n<p>•You've got a set amount of actions each turn. Once you've used them all up you can end your turn. When you end your turn it give other nations an opportunity to do stuff like attack you or each other and research. (I think I coded them to give gifts but I haven't seen that happen yet so maybe I didn't)</p><p>•You use food to increase your population (an important part of waging war). You can get food by raiding other nations or by having fertile land.</p>", "metacritic": null, "released": "2021-08-02", "tba": false, "updated": "2021-08-06T09:36:50", "background_image": "https://media.rawg.io/media/screenshots/e8c/e8ca2cedeed86c8c03b17dc112cea27c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 44, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Nexade"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}