{"id": 646083, "slug": "pagak-puzzle", "name": "Pagak Puzzle", "name_original": "Pagak Puzzle", "description": "<p><strong>ENG<br/>*The web and windows version is in Indonesian, Play store and .apk is in English and Indonesian<br/>**This game is originally intended to be played and published on Google Play Store, For now limited to South East Asia and US.  Play it on android to get the best experience<br/><br/></strong>Pagak Puzzle is a puzzle game based on real village in Indonesia, Village of Pagak which located in Purworejo, Central Java Province. This game created to promote the village culture and tourists site. <br/><br/>This game consist of 3 level :<br/>1st is rotational puzzle<br/>2nd is sliding puzzle<br/>3rd is jigsaw puzzle<br/><br/>By solving this puzzle you will obtain an information about this village.<br/><br/><br/><strong>INDONESIAN<br/></strong><strong>*Game ini tersedia di playstore melalui link dibawah, mainkan di android untuk mendapatkan pengalaman yang maksimal<br/></strong><br/>Pagak Puzzle adalah game puzzle yang berbasis dari desa Pagak di kecamatan Ngombol, Purworejo, Jawa Tengah. Game ini dibuat untuk mempromosikan budaya dan pariwisata desa <br/><br/>Game ini mempunyai 3 level yang puzzlenya adalah rotate puzzle, sliding puzzle, dan jigsaw puzzle<br/><br/>Setiap menyelesaikan level maka pemain akan mendapatkan pop up informasi tentang desa Pagak. Informasi ini dapat dilihat kembali di menu Koleksi</p>", "metacritic": null, "released": "2021-08-02", "tba": false, "updated": "2021-08-06T09:38:11", "background_image": "https://media.rawg.io/media/screenshots/72a/72a46acc7574be4084b631f2a2258678.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 84, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Android"], "developers": ["MurionDev"], "genres": ["Educational", "Puzzle"], "publishers": [], "esrb_rating": null}