{"id": 64622, "slug": "milky-way-map", "name": "Milky Way Map", "name_original": "Milky Way Map", "description": "(Program art music is made by me alone, half of the original design)<br/><br/>Games using Unreal Engine to create it, 3D games lock perspective.Game Features1. Unreal Engine 3d Times Picture and Light Effect.<br/>2. Original Music and Sound Effects.<br/>3. Through the beautiful picture and comfortable music, exposure to the pattern puzzle thinking, experience the joy of fresh puzzle game.<br/>4. Unlimited levels, unlimited patterns, you can always encounter every fresh puzzles and challenges!<br/>5. Pure hexagonal grid geometry knowledge of the show<br/>6. Checkpoint pattern save function, your efforts in the game will not be wasted, you can take the generated pattern (png format image file) to do other use him!GameplayClick Rotate hexagonal independent small pattern, think of ways to match the formation of a closed loop unique big picture.<br/><br/>The core gameplay is to solve puzzles, unlimited puzzles, each pass will be more difficult than the last pass, and each pass is a different puzzle. <br/><br/>You can feel the effect of puzzle through the fresh patterns met by each visit and the puzzle solved by each new pattern, because the games made with Unreal Engine have beautiful pictures and beautiful Music for Jun experience.<br/><br/>The game must play more than the 30th level, otherwise you will not experience the core gameplay of this game!<br/><br/>Try it if it looks interesting.", "metacritic": null, "released": "2018-03-09", "tba": false, "updated": "2019-08-28T21:55:14", "background_image": "https://media.rawg.io/media/screenshots/ca2/ca29540923f532b9995bea8628e71185.jpg", "website": "http://www.whoopsue.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 29, "toplay": 1}, "playtime": 13, "achievements_count": 55, "ratings_count": 0, "suggestions_count": 55, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["whoopsGames"], "genres": ["Strategy", "Casual", "Indie"], "publishers": ["whoopsGames"], "esrb_rating": null}