{"id": 646287, "slug": "dev-inc", "name": "Dev Inc", "name_original": "Dev Inc", "description": "Create and manage a game development company from 1980 onwards!<br/><br/><strong>Theme</strong><br/>Starting in your home office begin your career creating games and use the sales profits to make improvements to your company.<br/><br/><strong>Story</strong><br/>* The game currently offers 2 unique alternative history/future storylines to play through on release (more coming).<br/>* Each story mode is unique, maybe PC isn't popular but another PC like device dominates the market, there are many choices.<br/>* Mini events will give you a chance to be a respectable developer or somebody who favors profits over people.<br/><br/><strong>Compete against other developers</strong><br/>* A global leaderboard will display the richest gaming companies, most profitable games, best selling custom consoles and most advanced gaming engines.<br/>* The leaderboards will be updated daily, so you can compare your progress to that of other developers all around the world.<br/><br/><strong>Rewards</strong><br/>* Players that appear on the leaderboards will win special rewards.<br/>* You can also earn game coins by completing task, you will receive 3 new task every 4 hours.<br/>* Game coins can be used to purchase in-game items.<br/><br/><strong>Choices matter</strong><br/>The technologies used during game development and the time spent on each aspect will determine how well each game you make is reviewed, in-turn creating more sales revenue.<br/><br/><strong>Additional features</strong><br/>* Over 250 technologies <br/>* Over 130 game topics (100 for free)<br/>* Over 80 gaming platforms<br/>* Over 50 office upgrades<br/>* Over 70 years of narrative and platform releases (1980 till somewhere after 2050)<br/>* Moral choices that can have a deep effect on your company<br/>* Release games using multiple topics, genres and on multiple platforms<br/>* Create custom consoles<br/>* Create custom game engines<br/><br/>Note that this game is the official sequel to 'The Developer', a similar but simpler version released here on Steam<br/><br/><strong>Other languages</strong><br/>* Though the game currently only supports English, it is our intention to release this game with multiple language support if possible.", "metacritic": null, "released": "2021-08-07", "tba": false, "updated": "2021-08-09T02:08:24", "background_image": "https://media.rawg.io/media/screenshots/135/13523de84225b1c35d12a7b3903e6a16.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 45, "ratings_count": 0, "suggestions_count": 304, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Huntah"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["Huntah"], "esrb_rating": null}