{"id": 646361, "slug": "match-island-tropical-escape", "name": "Match Island - Tropical Escape", "name_original": "Match Island - Tropical Escape", "description": "Looking for an escape? Ready to build your dream city? Then come to Match Island and make the most of your idle time among new friends!<br/>Set out into the wild and discover an abandoned island that needs your help to become a city. Get to know ambitious Amy Smith as she tries to own her story among palm trees, sea and sunshine, and collect unique characters along the way! Escape your everyday life with this one-of-a-kind idle game combining city-building and match 3 puzzles.<br/><br/>Features:<br/>ESCAPE the hustle and bustle of city life to build your dream island<br/>COLLECT unique and loveable characters<br/>FOLLOW Amy’s story of self-achievement among new friends<br/>IDLE your way into solving relaxing yet challenging match 3 puzzles<br/>CRAFT wild new recipes with tropical fruit <br/><br/>Let your hair down while you help Amy achieve her dreams in this story full of love, friendship and realizations. Dive headfirst into an untamed land where you’ll be the city-planner of Amy’s new home, a foodie looking to collect tropical fruit and create wild new recipes, and an explorer among the highest trees and the bluest of seas.<br/><br/>Find the city-builder in you, the island’s waiting! Are you ready to escape into a new home on a dream island?<br/><br/>Match Island will be updated with more challenging puzzles, stories and unique characters regularly! If you haven’t relaxed enough yet, stay tuned for our updates and drop us a review!<br/><br/>Note: An internet connection is required to play the game", "metacritic": null, "released": "2021-07-12", "tba": false, "updated": "2021-08-09T02:59:35", "background_image": "https://media.rawg.io/media/screenshots/e29/e29ca3e7531a100d75011b931849aa48.jpg", "website": "https://www.matchisland.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 150, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Pixowl"], "genres": ["Simulation", "Puzzle"], "publishers": ["Pixowl"], "esrb_rating": "Everyone 10+"}