{"id": 646389, "slug": "binogo-super-bino-run", "name": "Binogo - Super Bino Run", "name_original": "Binogo - Super Bino Run", "description": "Join Bino challenge your quick thinking and ingenuity with challenges of running, jumping, odging obstacles on the road and finally killing the boss. <br/>In the game you have options to explore the fashion inventory with different shapes such as: Chef Bino, Police Bino, Hero Bino, Student Bino... Also you can build a big warehouse of weapons to defeat the giant turtles. <br/><br/>GAME FEATURES <br/><br/>- Bingo contains well-designed levels, multiple enemies, simple gameplay, extreme 3D graphics, breathtaking effects, and vibrant sounds. <br/><br/>- Overcoming obstacles, destroying enemies on the road requires you to have a quick reflex and a smart strategy. Pass the levels with ease and show your talent! <br/><br/>- Collect items and keys along the way, then buy more costumes and weapons to help you upgrade your strength, defeat your enemies quickly. <br/><br/>- Face the big Bosses at the end of the game. Show off your amazing skills to defeat them and get great rewards for passing each level.<br/><br/>- The game has a lot of attractions with reasonable Gold systems, amazing costumes and weapons that can be unlocked. <br/><br/>- Lucky Spin - With Free Spins, you can get Gold and strong weapons to help you kill your enemies easily. <br/><br/>- Daily Gift - Access the game daily to receive items and unlock special costumes. <br/><br/><br/>Download Binogo - Super Bino Run game for free today! Overcome all the levels and show your talent! Binogo will bring you exciting moments and countless surprises. What are you waiting for? Let's install the app and join the game!<br/><br/>Visit our website if you need further support https://tqcglobal.com", "metacritic": null, "released": "2021-05-24", "tba": false, "updated": "2021-08-09T03:15:26", "background_image": "https://media.rawg.io/media/screenshots/c08/c082ea220c30b1d1bdf439ed9bc33402_oMKDnLj.jpg", "website": "https://zf5iuhvi.app-adstxt.dev", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 102, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Huy To Duy"], "genres": ["Action", "Casual"], "publishers": ["Huy To Duy"], "esrb_rating": "Everyone 10+"}