{"id": 646306, "slug": "titankin-prologue", "name": "TITANKIN: Prologue", "name_original": "TITANKIN: Prologue", "description": "TITANS have long been mere stories, but soon twin protagonists Torden and Jorden are going to experience the thunderous rise of the long-dormant creatures.<br/><br/>Inspired by Celtic mythology, TITANKIN Prologue takes you on a tight JRPG-style adventure where you'll meet plenty of colourful characters, wield the power of TITANS, and enjoy thoughtful turn-based battles in a delightfully crafted pixel-art world.<br/><br/><ul><li> <strong>Strategic Turn-Based Combat</strong><br/>Each enemy you encounter has distinct strengths and weaknesses - discover and employ your own strategies to quickly overthrow the enemy.  <br/></li><li> <strong>Command TITANS</strong><br/>Defeating each TITAN will yield a KINSTONE- equip one on a character and they’ll benefit from enhanced stat growth, as well as the ability to call upon the TITAN in battle!<br/> <br/></li><li> <strong>The Classic JRPG, Modernized</strong><br/>No random encounters: on-map enemies will chase or run from the player, and superior balancing removes the need to grind for levels. Save points within a dungeon will also fully restore the party!<br/></li><li><strong>Vibrant Celtic-Mythology Setting</strong><br/>You will meet, battle, and recruit creatures and entities inspired by famous and obscure mythical stories of Ireland, Scotland, Wales, and more.<br/></li><li> <strong>Short and Sweet</strong><br/>This opening act of the TITANKIN saga won't devour all your time- if you love JRPGs but don't have 50+ hours to spend on a juggernaut, TITANKIN Prologue will leave you feeling fulfilled.</li></ul>", "metacritic": null, "released": "2021-08-31", "tba": false, "updated": "2021-08-09T02:19:53", "background_image": "https://media.rawg.io/media/screenshots/546/54646ebdfc11335edd24461eaa6e637a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 371, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["FerfWorks"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["FerfWorks"], "esrb_rating": null}