{"id": 646399, "slug": "sync-ball", "name": "Sync-Ball", "name_original": "Sync-Ball", "description": "Greetings 21st Century Earthlings!<br/><br/>Transport your mind beyond earthly concerns with the engaging puzzle experience of Sync-Ball.<br/><br/>Gently swipe your finger on the screen to move the synchronized balls up, down, left and right. Your goal is to align the balls and drop them into the holes on the same swipe. <br/>•\tUse maze walls to block movement and align the balls to achieve your goal.<br/>•\tWatch-out for the edges! If you roll a ball off the platform, you'll have to start over.<br/>•\tBegin with two-ball puzzles and simple mazes that teach the game's elegant mechanics and strategies.<br/>•\tAdvance to more complex puzzles with up to four synchronized balls in play at one time. And you thought rocket science was tough!<br/>•\tExperience 80 levels of stellar satisfaction.<br/><br/>Do you long to escape the frenzied pace of modern life? Sync-Ball was designed to provide the perfect balance of tranquility and cerebral stimulation for a quick escape wherever and whenever you need one.<br/>•\tNo time limits mean you can ponder a puzzle for as long as you like without incurring a penalty.<br/>•\tNo scores artificially inflate your sense of panic.<br/>•\tProgress at your own pace. <br/>•\tReset a stage as often as you like.<br/>•\tConcentration, memory and problem-solving skills are all you need.<br/><br/>Have fun!", "metacritic": null, "released": "2010-03-08", "tba": false, "updated": "2021-08-09T03:20:22", "background_image": "https://media.rawg.io/media/screenshots/139/13929cca1b60df2a838956b4174b5b6f_xkY7sWp.jpg", "website": "http://sync-ball.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 57, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tozai"], "genres": ["Strategy", "Educational", "Puzzle"], "publishers": ["Tozai"], "esrb_rating": "Everyone 10+"}