{"id": 646364, "slug": "merge-dream-mansion-design", "name": "Merge Dream - Mansion Design", "name_original": "Merge Dream - Mansion Design", "description": "Henry is a leading interior designer in the world. He has gone on a long journey to travel all around the world, discovering everything about the design and decoration of many countries with various cultures. Now, he has returned to his old hometown, where he grew up with the dream of building a leading interior design company here. This is a mystery town with many old romantic mansions that need a renovation to become splendid.<br/><br/>Every day, Henry meets so many customers who need him to renovate and decorate their villa.<br/><br/>Follow and help Henry in adventure to make his dream come true: <br/>Sketch beautiful house plans, and give every room an exquisite makeover.<br/>Choose the best decoration from a wide variety of selections. <br/>Renovate and decorate  to give every room the best look.<br/>Help clients build their dream manor and luxurious gardens.<br/><br/>AMAZING FEATURE IN THIS MANSION GAME<br/>Flexible to change style color for your  designer’s vision<br/>10+ rooms with hundreds of decorations to choose.<br/>New supportive characters will appear throughout the story to help you and Henry<br/>Unlock new rooms with unique gameplay, luxurious decorations, amazing animations.<br/>Merge items to discover hundreds of unique tools to create and use your renovation<br/><br/>HOW TO PLAY<br/>MERGE: Merge items into the useful tools that will help you to renovate and decorate the many rooms of the mansion that were destroyed.<br/>DESIGN: <br/>Collect stars and unlock new decorations.<br/>Repair and design the house with luxurious exterior and interior furniture and make it like new.<br/>Use your designer’s vision to create a unique home with your own sense of style and creativity.<br/><br/>UNCOVER: find and discover mysterious objects in the house. There is always new evidence to discover and more rooms to organize.<br/><br/>Let’s jump together with Henry on his respective journeys and help him achieve his dream.<br/>Download for free today and join the manor house game!", "metacritic": null, "released": "2021-08-05", "tba": false, "updated": "2021-08-09T03:01:15", "background_image": "https://media.rawg.io/media/screenshots/984/984e30b36eb16426ec318a8b56cb9011.jpg", "website": "http://cscmobi.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 141, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["CSC Studio"], "genres": ["Simulation", "Puzzle"], "publishers": ["CSCMOBI VIET NAM TECHNOLOGY JOINT STOCK COMPANY"], "esrb_rating": "Everyone 10+"}