{"id": 646352, "slug": "otherworld-heroes", "name": "Otherworld Heroes", "name_original": "Otherworld Heroes", "description": "Explore new world’s, fight magical battles and complete epic missions in Otherworld Heroes, the first-ever AR location-based MMORPG. <br/><br/>Select your hero and enjoy this enchanting universe, full of heroes, villains, monsters, and magic. Everywhere you walk you’ll encounter new challenges, incredible opportunities and face mortal dangers!<br/><br/>- EXPLORE THE UNIVERSE - Fight evil monsters, find powerful magical items, and go on epic quests for glory and power with your friends!<br/><br/>- REAP THE REWARDS - Earn XP by collecting gold and precious resources to improve your strength and power and unlock mystical secrets.<br/><br/>- LEVEL UP YOUR HERO - Unlock new skills and new weapons to increase your fighting power. You’ll need it to take on massive monsters and difficult battles.<br/><br/>The world in Otherworld Heroes is like no other you’ve ever experienced. You can enjoy it with your friends, exploring, fighting and questing through this magical universe as a team. <br/><br/>Together, you’ll tackle epic adventures and real-time battles that will build friendships that last forever.<br/><br/>Are you ready for the challenge?<br/><br/>※ NOTES ※<br/><br/>- Otherworld Heroes is free to download and play with in-app purchase options.<br/>- A cellular is required to play the game. It is optimized for smartphones, not tablets.<br/>- The game also requires a GPS connection to enable the map-based gameplay. <br/>- You may experience difficulties playing the game if connections are weak or inconsistent.<br/>- Otherworld Heroes is compatible with the following devices: [ iOS version 11 or higher ]. <br/>- For Customer Support : join our Discord community or send us an email on customersupport@bublar.com<br/>- Privacy Policy : https://otherworldheroes.com/privacy<br/>- Terms of Use : https://otherworldheroes.com/terms/<br/><br/>* Follow us on :<br/><br/>- Website &amp; the latest news : https://otherworldheroes.com/<br/>- Discord : https://discord.gg/wfsVhW9<br/>- Reddit : https://www.reddit.com/r/otherworldheroes/<br/>- Twitter : https://twitter.com/Otherworld_Hero/<br/>- Facebook : https://www.facebook.com/0therWorldHeroes/<br/>- Instagram : https://www.instagram.com/otherworld_heroes/<br/><br/><br/>* For iOS version 11 or higher, we require approval of Permissions :<br/><br/><br/>[ Permissions Guide ]<br/>- (Mandatory) Location Access : Otherworld Heroes needs access to your device's location in order to enable map-based gameplay.<br/><br/>[ How to revoke approval of access authority ]<br/>- Please follow the below steps to revoke approval of Permissions.<br/><br/>[ iOS version 11 or higher ]<br/>- Settings &gt; Otherworld Heroes &gt; Location &gt; revoke Permissions<br/><br/>[ Lower than iOS version 11 ]<br/>- Update OS or delete App to revoke approval of Permissions", "metacritic": null, "released": "2021-06-07", "tba": false, "updated": "2021-08-09T02:54:28", "background_image": "https://media.rawg.io/media/screenshots/b92/b928fa5bc1ccac46077fa91f15a58dea_p30uD9t.jpg", "website": "http://otherworldheroes.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 180, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Bublar Group"], "genres": ["Adventure", "RPG"], "publishers": ["Bublar Group"], "esrb_rating": "Everyone 10+"}