{"id": 646489, "slug": "planet-rebirth", "name": "Planet Rebirth", "name_original": "Planet Rebirth", "description": "<p>Controls:</p>\n<ul><li>Move with: WASD , Arrow keys or Controller ( not fully supported )</li><li>Interact with objects using: Left Click,  Spacebar or E</li><li>Exit menu's by walking away or pressing ESC</li><li>Open options using ESC</li></ul>\n<p>[Sorry, were some major bugs on build]</p>\n<p>Summary:\r\n</p>\n<p>This is a top-down 2D game which focuses around exploration and gathering resources. There is the unique “Rebirth” mechanic which allows you to bring in NPCs to help you in your endeavours and reach your end goal. In the game, there are lots of cool environments to explore as well as a computer interface to guide you along the way. The gameplay loop revolves around going to a new biome to discover new things and then eventually automating everything so you can gather tons of Wood, Stone, Ores and more!\r\n</p>\n<p>Gameplay:\r\n</p>\n<p>In Planet Rebirth, you play as a lone prison warden who is transporting inmates between different galaxies. Due to unpredicted circumstances, you end up crash landing on Habitable Planet#1027833 with all the ship components heavily damaged.\r\n</p>\n<p>You will have to gather resources in order to repair the modules and restore power. Your most crucial resource is probably going to be electricity which you get by collecting carbon and converting it using a bio generator. Once you have enough power stored up, you will be able to release some of the inmates but with wiped memories. This is called the “Rebirth” procedure.\r\n</p>\n<p>After they are released from their cryosleep, you will be able to enlist the prisoners to help you gather resources and you can increase their resource gain rate by giving them food. The end goal here is to restore the ship and it’s original power systems - but you will encounter many roadblocks along the way.\r\n</p>\n<p>You will have to travel to the four biomes including Grasslands, Deserts, Forests, Swaps and Tundras to gather the different resources needed. There is always the possibility of running into different creatures (possibly hostile) who may try and stop you. Equipped with you is your multitool which operates as a mining drill, a woodcutting axe and a weapon to deter any hostiles. Once you discover a resource in its location, you will be able to enlist your newly found workforce to aid you in collecting it.\r\n</p>\n<p>Credits:</p>\n<p>Programmers:</p>\n<ul><li>Jack Eatock</li><li>Nathan James Anderson<br/>\n</li><li>Rares Morosan (Astro)</li></ul>\n<p>Audio:</p>\n<ul><li>Jack Jefferies (Jarf)<br/>\n</li><li>Rhys Lampard (Fusia)<br/>\n</li><li>Nahu</li></ul>\n<p>Art:</p>\n<ul><li>DoodleGhost<br/>\n</li><li>Isabelle Stuetz<br/>\n</li></ul>\n<p>Special thanks to:</p>\n<ul><li>Max </li><li>Mike England</li></ul>", "metacritic": null, "released": "2021-08-08", "tba": false, "updated": "2021-08-09T03:42:05", "background_image": "https://media.rawg.io/media/screenshots/bf7/bf79710702f75494ac54fd8993152364.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 102, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["JackEatock", "UntitledTeamSlime"], "genres": [], "publishers": [], "esrb_rating": null}