{"id": 646536, "slug": "planet-jumpers", "name": "Planet Jumpers", "name_original": "Planet Jumpers", "description": "Gameplay\r\n<p>The game is split into multiple “phases”.\r\n</p>\r\nCrash\r\n<p>You start off, having just run out of fuel, careening towards an unknown planet.  You must avoid debris and ground  obstacles to make it safely all the way to the surface.\r\n</p>\r\nExplore\r\n<p>Once  you reach the surface, you step outside of your ship, and must explore  the landscape.  Your goal, to obtain enough fuel rods to launch your  ship back into space.  You can also find other items, such as ship  repair kits while exploring!\r\n</p>\r\nLaunch\r\n<p>After  launching back into space, you pick a direction and start flying.  Be  careful to not be sucked into the gravitational pull of hazards such as  stars, and avoid any other untimely visitors! Keep an eye on your fuel  gauge, when you run out you will float until you hit something! Use the  gravity of planets to launch yourself further and maximize fuel!  \r\n</p>\r\nDeath\r\n<p>When  you die, your journey is not forgotten!  An online leaderboard allows  you to submit your jump results.  You can also view the top 10 most  legendary jumps that have been completed!\r\n</p>\r\nTips\r\n<ul><li>If you are having trouble, use <em><em>Explorer Mode</em></em> to  make the game significantly easier (Found on the main menu).  You won’t  be able to submit to the leaderboard, but you may be able to see more  content in each run.\r\n</li><li>Planet gravity can be used to speed yourself up without wasting fuel, allowing you to travel further.\r\n</li><li>Planets  with the worst atmosphere are darker and tinted green.  Planets with  “bad” atmosphere are slightly dark and tinted red.  Planets that are  bright will have the best atmosphere.  The better the atmosphere, the  less O2 you use on the surface.\r\n</li><li>Smaller planets actually  have smaller landscapes to explore, this can make finding fuel on them  easier at times (Although less fuel is present overall on these  planets).\r\n</li><li>Some planets have “air pockets” that are planet colored squares on the ground.  These will refill your oxygen.\r\n</li></ul>\r\nFeatures\r\n<ul><li>Fully procedural universe.  Every playthrough is different.   Every galaxy has a variety of planets at different distances/locations.  Every planet has a variety of properties that affect things from size,  air quality, gravity and more.  Every planet landscape is uniquely  generated based on properties from the planet.\r\n</li><li>Tutorials!  Play new game with tutorials to see a tutorial before each phase of the game.\r\n</li><li>Aliens! After exploring so far, you may encounter alien ships.  Avoid their missiles or your ship will take damage!\r\n</li><li>Six unique planet biomes, each with their own surface and hazards.\r\n</li><li>Four unique ways to die!\r\n</li><li>An online leaderboard, compete for a position on the list of <em>Legendary Jumps</em>!\r\n</li><li><em>Explorer Mode</em>!   Is the game too tough?  Do you want to just see what the universe has  to offer?  Turning on this flag at the main menu means that you will not  die from lack of oxygen, and your ship still works with no fuel!  You  won’t be able to submit your journey to the leaderboard though.\r\n</li><li>Adjust the music and sound effects (or turn them off!).\r\n</li><li>Quick transition mode, for skipping the interim messages (I know it can get old).\r\n</li></ul>\n\n\n<p>This game was originally created for Ludum Dare 45. <br/></p>\n<p>https://ldjam.com/events/ludum-dare/45/planet-jumpers</p>", "metacritic": null, "released": "2021-08-08", "tba": false, "updated": "2021-08-09T03:54:42", "background_image": "https://media.rawg.io/media/screenshots/220/22002dff671c8c1ca6c68fc9ed7ee043.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 34, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["garrett_mg"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}