{"id": 646658, "slug": "michael-the-happiest-camper", "name": "Michael (The Happiest Camper)", "name_original": "Michael (The Happiest Camper)", "description": "<p>A semi-sequel\\follow up to my previous jam submission, Michael was made for Beregon's 4th RPG Maker Horror Game Jam in the hopes that I could improve upon the flaws that my previous game had. Don't worry, you don't need to have played the previous game in order to understand this one. </p>\n<p>I had a lot of fun making this game, and hopefully that shows in the final product. I'd really like to thank Beregon for making these game jams that have given me the motivation to start working creatively again. I'd also like to give a special thank you to my great friend Riley Kelk for recording video and audio and allowing me use of their likeness, without their part in this game I doubt the story would have ever found the richness of life that it did.</p>\n<p>Before you start playing this game, I have a few important things to tell you. First of all, some of the puzzles can get extremely complicated, so I highly recommend you take notes and inspect everywhere you can. Using the internet is discouraged, but not forbidden. Secondly, there are a lot of objects in the game that might not look like they can be interacted with, but doing so will give you unique dialogue or activate an event. As with all RPG Maker games, you can interact with objects by pressing Z, and pressing X will open up a menu. Third and lastly, there's a glitch in RPG Maker MV that when enemies touch one of your following party members they will not activate as they would if they touched the main player. While the game may not have been designed with this in mind, I suggest you take advantage of it whenever you can to make your journey easier.</p>\n<p>Thank you so much for giving my game a try. If you're part of the 4th RPG Maker Horror Game Jam, then I look forward to seeing what you come up with. If not, then I still highly encourage you to check out the other submissions. Using RPG Maker itself is easy, but completing a project under a strict deadline is very tough so a big hug and round of applause to all of those who make it!</p>\n<p>I look forward to seeing you again - Carter</p>", "metacritic": null, "released": "2021-08-08", "tba": false, "updated": "2021-08-09T04:23:42", "background_image": "https://media.rawg.io/media/screenshots/815/81544adb345269559b3b54d6d0e70b3f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["The Happiest Camper"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}