{"id": 646684, "slug": "road-life", "name": "Road Life", "name_original": "Road Life", "description": "<p>At the start of this endless game, the most primitive \"houses\" made of wood of several types appear around, along the way the structures will change and become more and more complex, at later stages the buildings will already resemble real ones.</p>\n<p>The floors of buildings are called genetics, the lowest floors make up the support, the oldest (largest) are located here, and the higher the floor is, the younger (smaller) it is. Such a system looks like a social unit in which a new generation is preparing to conquer new heights. The close family influences subsequent generations, the likelihood of rushing up becomes higher. This idea is similar to the modern world, when the elite support their own kind and they jointly achieve even more in this world and either pull a similar environment to themselves, or remain among the like, while the lower strata of the population try to equalize with their neighbors, increasing their position ... But growth will not always be visible, sometimes the tallest go down to the very bottom, being surrounded by lower buildings.</p>\n<p>Leaving old acquaintances, we do not forget about them at all, the world is changing dynamically and once you return to the beginning and you no longer recognize those who started with you. As soon as you move n-meters away from the building, it immediately changes, in step with the times, forcing the environment to follow this principle (the most developed ones will be at the very beginning, finding several formations and rebuildings). In pursuit of time and personal values, we forget about the most important thing - the preservation of the architectural and cultural heritage of the area and region. We are spending less and less time for the older generations, those who were at the origins of what we have now. New technologies force us to gradually abandon many buildings, and for a rapidly growing population, a place is needed, which is sometimes located in the very territory where previously someone created something incredible, which now requires restoration and proper care from specialists, instead of demolishing and subsequent development of this territory ... So, the history of the culture of the place is changing, if not forgotten at all.</p>\n<p>The difference in models does not affect relations in society, it does not matter if you look richer or have a different texture, everyone is equal in this project, and they carry out a common goal - to reach their maximum and help each other in the same. This is how this project intends to answer the question \"How are we going to live together?\" based on the hectic life of interesting structures.</p>", "metacritic": null, "released": "2021-08-08", "tba": false, "updated": "2021-08-09T04:29:57", "background_image": "https://media.rawg.io/media/screenshots/d84/d84362fef347a709d6a2b0f79b7b8e40.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1, "toplay": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 72, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "macOS"], "developers": ["repsoloff"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}