{"id": 646754, "slug": "package-rush", "name": "Package Rush", "name_original": "Package Rush", "description": "Have you ever had your package delayed? Would you like to fix it? In Package Rush you run your own delivery company.<br/><br/>Package Rush is a strategy game about planning a delivery route system in a fast-growing city. Build and modify routes to get all packages on time. How long can you keep delivering?<br/><br/><br/><br/><br/>The city is growing. More and more orders are coming in, and there is less and less time to fulfill them. The demand for your company's services is increasing. You'll be constantly managing your route system to meet the changing conditions and be as efficient as possible.<br/><br/><br/><br/><br/><br/>Deliver packages and get upgrades. Each upgrade has its own unique effect and rarity. You can decide whether to use it now or save it for later stages. Upgrades can have a big impact if used wisely<br/><br/><br/><br/><br/><br/>Warehouse explosion, Stop time, Cards shuffling, Mystery Orders and more<h3>Key Features</h3><ul><li>Enjoy fun, relaxing, and sometimes hectic gameplay, where each game is unique<br/></li><li>Try four game modes: Classic for scored game, Rush for fast-paced play, Custom for creating your own mode, and Snake in which routes cannot intersect<br/></li><li>Build routes and think carefully about strategy<br/></li><li>Choose from a variety of unique upgrades<br/></li><li>Set records and compete with other players<br/></li><li>Cute cartoon graphics<br/></li><li>Wonderful soundtracks</li></ul>", "metacritic": null, "released": "2021-08-08", "tba": false, "updated": "2022-10-31T02:49:59", "background_image": "https://media.rawg.io/media/screenshots/ce2/ce2194c9c5a980b4a84e4c91464ae2f1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 28, "ratings_count": 0, "suggestions_count": 266, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC", "Web"], "developers": ["Campfire Studio", "Bubo4400"], "genres": ["Strategy", "Simulation", "Casual", "Indie"], "publishers": ["Campfire Studio"], "esrb_rating": null}