{"id": 646703, "slug": "package-resolved", "name": "Package Resolved", "name_original": "Package Resolved", "description": "<p>It's another day at the Swifty Package Factory, and you have a long list of orders to deliver, with no time to spare! Can you collect all of the packages to deliver in the time allotted? Watch out for palettes and wet floors, or you'll get really injured!</p>\n<p><strong>Package Resolved</strong> is a short game written in Godot for the 132nd Trijam* game jam. Development time overall was 4 hours, and the artwork in 3 hours.</p>\n<p> </p>\n<p><strong>How to play</strong><br/></p>\n<p>Use the arrow keys or the A and D keys to move left and right; for touchscreen devices, tap and hold on the left and right edges. Run into packages to collect them, and avoid running into palettes. You must collect all of the required packages (seen in top left) before time runs out (seen top right). You can choose between the regular arcade game with levels, or you can play the endless mode and see how far you can get.</p>\n<p><em>Powerups</em><br/></p>\n<ul><li>Packages with a red border act as the equivalent of collecting two packages.</li><li>Pocket watches with the plus sign add time to your timer.</li></ul>\n<p><em>Hazards</em></p>\n<ul><li>Water puddles marked with wet floor signs cause you to speed up.</li><li>Palettes marked with wet floor signs cause an instant game over on contact.</li></ul>\n<p><strong>Credits</strong><br/></p>\n<ul><li>Swift bird costume sprite based off of character template created by LimeZu.</li><li>Main menu artwork created by Raseruuu.</li><li>Music and SFX created with JSFXr and BeepBox.</li><li>Inter font created by Rasmus Andersson.</li><li>JetBrains Mono font created by JetBrains s.r.o.</li></ul>\n<p>This project is neither affiliated with nor endorsed by Apple Inc. Swift (programming language) is a trademark of Apple Inc.</p>\n<p><em>*I've learned my lesson and made sure Apple didn't autocorrect this.</em></p>", "metacritic": null, "released": "2021-08-08", "tba": false, "updated": "2021-08-09T04:34:08", "background_image": "https://media.rawg.io/media/screenshots/d4a/d4af9c990021897a45ea6fd8d876b672.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 25, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["Raseruuu", "Marquis Kurt"], "genres": [], "publishers": [], "esrb_rating": null}