{"id": 64683, "slug": "build-wars", "name": "Build Wars", "name_original": "Build Wars", "description": "Are you ready for some serious building action? Build Wars brings popular concept of realtime online PvP building contests to standalone game. You and up to 14 opponents will build randomly selected object and after 8 minutes of struggle the winner will be decided by completely subjective voting among contenders.<br/><br/><br/><ul><li>Eight minutes of building time<br/></li><li>Face of against 9+ opponents in realtime PvP battle<br/></li><li>One common topic/object to build chosen randomly from dozens of themes<br/></li><li>15 seconds to rate each of other players creations<br/></li><li>Best builders get reward to unlock new blocks in chests</li></ul><br/>So standard rules, eh? Our build wars is serious 3D building game with live multiplayer that even lets you unlock new block to improve your building capabilities. Improve your skills and your tools too and trample down your opponents - or just enjoy their masterpieces and learn from them as they defeat you. No block is wasted! <br/><br/><br/><ul><li>Familiar building blocks graphic<br/></li><li>Online PvP building contest inspired by popular mod<br/></li><li>Review and rate creations of your opponents right after building phase<br/></li><li>Become amazing builder<br/></li><li>Creative mode style building without crafting but with fly mode!<br/></li><li>Many building blocks to choose from - different materials, objects and even animals, mobs and other NPC<br/></li><li>Change day time, use lights and torches<br/></li><li>Change your floor blocks - pyramid looks better on sand but snowman thinks that snow is much more cool<br/></li><li>Browse TOP10 monthly creations from all over the world</li></ul>", "metacritic": null, "released": "2018-04-20", "tba": false, "updated": "2019-09-17T13:38:52", "background_image": "https://media.rawg.io/media/screenshots/e26/e26f7b21fd8dadc5958d587540ea6705.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 162, "beaten": 1, "dropped": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 182, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Alda Games"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Alda Games"], "esrb_rating": null}