{"id": 647070, "slug": "permanence-kyou", "name": "Permanence (Kyou)", "name_original": "Permanence (Kyou)", "description": "<p>Rook is lost.</p>\n<p>He was trying to fulfill a debt of gratitude. Indeed, he was compelled, duty-bound by his very nature to fulfill it. The situation, however, got out of hand, forcing him to abandon his friend lest he be destroyed.</p>\n<p>Of course, this was intolerable. He swore to her he would repay her kindness! He SWORE it! To leave her to struggle alone in her time of need...! It wasn't long before he began seeking her out in earnest to make things right.</p>\n<p>But then... well, it's unclear what happened, exactly. Perhaps something  interfered with his teleportation in a major way? Whatever the case may be, when Rook tried to retrace his steps, he somehow tumbled outside of all of existence, landing abruptly on an odd mechanical platform floating in a void.<br/></p>\n<p>He's now at the mercy of this strange coin-operated machine and its yet stranger operator, a ghostly girl calling herself Charlotte. With her cooperation, his search continues, but he can't shake the feeling that something's stirring in the background, something far beyond even him and his friend's combined strength...</p>\r\nContent warnings\r\n<p>Permanence contains the following potentially sensitive adult content:\r\n</p>\r\n\r\nExpand warning list\r\n<ul><li>Mention of suicide</li><li>Discussion of bullying</li><li>Discussion of child neglect</li><li>Discussion of mental illness</li><li>Discussion of intrusive thoughts</li><li>Discussion of psychological trauma</li></ul>\r\n\r\nControls\r\n<ul><li>Use the WASD or arrow keys to move and to navigate menu options.\r\n</li><li>Use the Z or Enter/Return key to interact with objects, decide menu options, and advance text.\r\n</li><li>Use the X or Escape key to open and close the pause menu.\r\n</li><li>Use the Delete key in the save/load menu to delete unwanted save data.\r\n</li></ul>\r\nInstallation Instructions\r\n<p>Linux users will need to download and install the Love2D framework in order to run the .love file containing the application.\r\n</p>\n<p><strong>NOTE:</strong> The downloads currently available on this page are development builds, and as such may contain bugs or lack some gameplay features. Please feel free to send bug reports, suggestions, comments, or any other such feedback to \"kyousystem at protonmail dot com\".</p>", "metacritic": null, "released": "2021-08-07", "tba": false, "updated": "2021-08-09T06:06:39", "background_image": "https://media.rawg.io/media/screenshots/d5c/d5c6333991a1430e4740431383e6fd13.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 83, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Kyou"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}