{"id": 64704, "slug": "eep-tsm-gotthardbahn-nordrampe-modul-erstfeld", "name": "EEP TSM Gotthardbahn Nordrampe Modul Erstfeld", "name_original": "EEP TSM Gotthardbahn Nordrampe Modul Erstfeld", "description": "Start your mission at the Gotthard Railway North RampDo you have the skill and nerves of steel for a job at the Gotthard Railway North Ramp? Can you manage to deliver wagons and trains on time and manage even the trickiest shunting tasks? Can you manage to load and transport tons of goods safely? Then you are our man for a new adventure with EEP TS Mission! Based on the basis of the world's most successful railway simulation EEP, it is possible to take on complex tasks related to rail traffic on the detailed layouts.<br/><br/><ul><li>True in scale engines and waggons<br/></li><li>Realistic simulation of train physics<br/></li><li>Prototypical signalling<br/></li><li>Freight operation<br/></li><li>Exciting missions<br/></li><li>Career mode</li></ul>Controlling locomotives, shunting wagons, loading goodsThe new EEP TS Mission edition takes you into the complex railway worlds of the Swiss mountains. Here, however, you do not have to build layouts like in the main EEP software, but instead carry out comprehensive tasks on the Gotthard railway, which has been designed in an exemplary manner. And there is plenty to do! Take on the role of a locomotive driver, shunter or crane driver and experience the dense and realistic atmosphere in Erstfeld and the narrow Reuss valley nearby.Realistic train movementEEP TS Mission is based on the basics of Eisenbahn.exe Professional (EEP), but goes far beyond that in terms of realism. EEP TS Mission is the new standard with its emphasis on a physically realistic simulation of train movements and goods loading as well as a rich sound backdrop.", "metacritic": null, "released": "2018-05-09", "tba": false, "updated": "2019-08-28T21:55:07", "background_image": "https://media.rawg.io/media/screenshots/e1b/e1b4276844c6da0cea662f9ec6b892e1.jpg", "website": "http://train-simulator.trendverlag.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 420, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Trend Readaktions- und Verlagsgesellschaft mbH"], "genres": ["Simulation"], "publishers": ["Trend Readaktions- und Verlagsgesellschaft mbH"], "esrb_rating": null}