{"id": 647147, "slug": "aarls-alchemy", "name": "Aarl's Alchemy", "name_original": "Aarl's Alchemy", "description": "<p><em>Aarl's Alchemy</em> is a gem-capturing puzzle game! Click on a gem, and all gems of the same type in the same row or column will be attracted to it, moving to get as close as possible to the gem you clicked. Any gems of other types that get in the way will be captured!</p>\n<p><strong>Game modes</strong>\n</p>\n<p>In <strong>Challenge Mode</strong>, you're trying to make big clusters of a single type of gem. The objective in the top-left corner will tell you what kind of gem to focus on, and how big your cluster should be. You have 10 turns to make each cluster. Casting a spell is free; it doesn't take up a turn.\r\n</p>\n<p>In <strong>Endless Mode</strong>, you're free to click around as much as you want with no move limit. Try to make fun shapes!\r\n</p>\n<p><strong>Spells</strong><br/></p>\n<p>When you capture gems, you charge up corresponding magic spells:</p>\n<ul><li>The 🌞<strong>Sun🌞 </strong>spell randomly turns some leaf gems into bloom gems. </li><li>The 🌙<strong>Moon🌙</strong> spell randomly turns some bloom gems into leaf gems.</li><li>The ⏳<strong>Time</strong>⏳ spell randomly turns some moon gems into sun gems and vice versa.</li><li>The 💧<strong>Water</strong>💧 spell randomly moves each row one step left or right.</li></ul>\n<p><strong>Known issues:</strong><br/></p>\n<ul><li>The audio can be crackly in Chromium-based browsers. It sounds much better in non-Chromium browsers such as Firefox, or in the downloadable desktop version.</li></ul>\n<p><strong>Credits</strong></p>\n<p><em>Aarl's Alchemy</em> was created by Michael Stroud for the 90 Days &amp; Ship! Jam 2021 game jam. It was created using the Godot game engine. See the \"license\" directory in the game files (also available as as separate download) or the \"Credits\" screen in-game for the license terms of all used software and assets.</p>", "metacritic": null, "released": "2021-08-07", "tba": false, "updated": "2021-08-09T06:28:30", "background_image": "https://media.rawg.io/media/screenshots/241/241d85cb12c10ba7071688649baa3734.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 63, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux", "Web"], "developers": ["Aezart"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}