{"id": 64725, "slug": "champ-against-chumps-upgrade-edition", "name": "Champ Against Chumps Upgrade Edition", "name_original": "Champ Against Chumps Upgrade Edition", "description": "Let me start over.<br/><br/>Champ Against Chumps Upgrade Edition is an avoider-like game with, of course, upgrades.  You have to avoid enemies or shoot them (When you have it upgraded).  There are coins to collect.  Collecting a coin will reset the timer and add to your money.  You can use the money you earn to buy upgrades.  You can upgrade your speed, the timer, your bullet damage (First upgrade unlocks shooting), the coin worth, shooting reload time, and the enemy worth.  When you collect $500 in a single game, the boss will appear and you will have to defeat it.<br/><br/>You start off with a very low speed and a timer that is three seconds long.  If the timer runs out then you will lose.  The timer restarts every time you collect a coin.  Enemies will start coming in from off-screen.  As you collect the coin, the speed of the enemies will change.  You can't shoot them yet because you have to unlock it by upgrading the bullet damage upgrade.  So, you will have to try avoiding them until the first bullet damage upgrade is purchased.  Each coin you collect will not only reset the timer, but it will also add more to your money which you can use to buy more upgrades.  Upgrades are awesome.  <br/><br/>Oh yeah, by the way, after you reach $500 in a single game the boss will appear.  Defeat the boss to complete the game.  Maybe you'll get a trophy or something?  Who knows?What are the upgrades?<ul><li> Speed - Will make you faster.<br/></li><li> Timer - Will make the timer longer.<br/></li><li> Bullet Damage - Will make your bullet damage higher and able to kill enemies faster.  The first upgrade will allow the player to shoot.<br/></li><li> Coin Worth - Will make the coins worth more.<br/></li><li> Reload Upgrade - Will reduce the reload speed for shooting bullets.<br/></li><li> Enemy Worth - Will make the enemies worth more after the player kills them.</li></ul>Features<ul><li> Upgrades!  Gotta have them!<br/></li><li> Steam achievements! You better believe it.<br/></li><li> A boss battle after you reach $500 in a single game!  I'm not kidding!<br/></li><li> More game options.  Eh.</li></ul>", "metacritic": null, "released": "2018-04-20", "tba": false, "updated": "2019-08-28T21:55:06", "background_image": "https://media.rawg.io/media/screenshots/8cd/8cdba44e748f5a341e974d925c4e9d4b.jpg", "website": "http://misterttocs.com/games.html#ChampAgainstChumpsUpgradeEdition", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 1, "achievements_count": 21, "ratings_count": 0, "suggestions_count": 39, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MisterTtocS"], "genres": ["Indie"], "publishers": ["MisterTtocS"], "esrb_rating": null}