{"id": 64747, "slug": "rabbit-valley-legend-tu-zi-shan-gu-chuan-shuo", "name": "Rabbit Valley Legend (兔子山谷传说)", "name_original": "Rabbit Valley Legend (兔子山谷传说)", "description": "Plot SummaryIn Happy Valley, the rabbit Fu-generation live a happy life, it is said long, long ago, there was a big crisis in the valley rabbit, is a crucial moment unsung heroes to stand up and protect the rabbit race, and left to protect the artifacts of the valley, and since then, the rabbit valley will hold an important ceremony in the Peak snow each year, but after a long time, and now the rabbits are in play, the free ride every day, I have not forgotten the rabbit this ceremony is for nothing, but thought it was just left behind traditional festivals, even this is not in the care. Rabbit grandfather left behind in the snow on top of an old man, which is the guardian of the snowy mountain top in many years, the annual festival, which will give a small rabbit who speak many old legends, but adult rabbits are thought to coax a child playing, traditional festival has become a hero bunny rabbits happy little snowball wars entertainment section. This year the protagonist rabbit came to the top of snow-capped mountains, a pleasure to participate in this snowball war, but people did not expect things snowball at the end of the war, a terrible secret has emerged to the surface of the water crisis, the valley has a rabbit while many people unknowingly quietly came, but this time the protagonist and only know it all together to face grandfather rabbit, the rabbit will be the protagonist of a new generation of rabbit hero, looking for artifacts and legends of the hidden world behind secret.Feature1. Swing Arm to Move In Vr.2. You can grab, throw snowball, throw magic snowball, use snowgun...etc.<br/>3. Send special object to NPC to get more friend army and help.<br/>4. Cute and funny game characters.", "metacritic": null, "released": "2018-05-06", "tba": false, "updated": "2019-08-28T21:55:04", "background_image": "https://media.rawg.io/media/screenshots/76d/76df75d8a12983a783e64701d607258e.jpg", "website": "https://bamboosecret.com/%E5%85%94%E5%AD%90%E5%B1%B1%E8%B0%B7%E4%BC%A0%E8%AF%B4vr", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 10}, "playtime": 1, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 208, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Bamboo Secrets Co.,Limited"], "genres": ["Action", "Indie"], "publishers": ["Bamboo Secrets Co.,Limited"], "esrb_rating": null}