{"id": 64755, "slug": "3-minutes-to-midnight", "name": "3 Minutes to Midnight", "name_original": "3 Minutes to Midnight", "description": "<strong>Description</strong><br/>Somewhere in New Mexico, an explosion shatters the night. Plucky teenager Betty Anderson wakes with a jolt. Where is she? Who is she? <br/><br/>Whatever blew up in the desert seems to have wiped her memory clean, but as she’ll soon learn, Betty has a lot more to worry about than amnesia. Like, say, a town full of people who aren’t what they seem, a corrupt mayor, a secret military base, the mafia, and a potbelly pig with a vendetta. Then there’s this little problem of a doomsday plot counting down to the extinction of the human race… and time’s running out.<br/><br/>Join Betty to crack the conspiracy that starts with a bang and ends at 3 Minutes to Midnight—if we’re lucky.<strong>Features Of 3 Minutes to Midnight</strong><br/><br/>•\t<strong>Classic adventure gameplay.</strong>  Inspired by LucasArts adventures like The Secret of Monkey Island, Day of the Tentacle, and Sam &amp; Max Hit the Road, 3 Minutes to Midnight combines the point &amp; click gameplay and absurdist humor of the “good old days” with high-def cartoon art, an intuitive interface, and a compelling mystery.<br/><br/><br/>•\t<strong> Two playable characters. </strong> Play as both Betty Anderson and Mayor Eliza Barret to unravel a plot much deeper and darker than it seems at first glance.<br/><br/><br/>•\t<strong> A small town of strangers and secrets. </strong> Each of 3 Minutes to Midnight’s 40+ characters has a detailed backstory with unexpected ties to each other and the world we live in. Scratch the surface to get just the info you need, or delve deeper to discover who these people truly are.<br/><br/><br/>•\t<strong> Puzzles up the wazoo. </strong> Yeah, puzzles—remember those? Kick off your walking shoes and put on your thinking cap, because 3 Minutes to Midnight will keep your brain ticking all night long.<br/><br/><br/>•\t<strong> A whole lot of localization. </strong> 3 Minutes to Midnight will be voiced in English, with subtitles planned in English, German, French, Italian, Spanish, Russian, Chinese, Portuguese, Czech, Polish, Korean, Japanese, Turkish, and[/ Catalan. (Whew!)", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:55:03", "background_image": "https://media.rawg.io/media/screenshots/d14/d147801e9dc5858a4a74648a04fc3aed.jpg", "website": "https://scarecrow-studio.com/3-minutes-to-midnight-point-and-click-adventure-game/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "toplay": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 440, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Scarecrow Studio"], "genres": ["Adventure"], "publishers": ["Scarecrow Studio"], "esrb_rating": null}