{"id": 647592, "slug": "vulgords-tower", "name": "Vulgord's Tower", "name_original": "Vulgord's Tower", "description": "<h3>Wield Your Power in Vulgord's Tower!</h3><br/>Welcome to Vulgord’s Tower! A fantasy adventure game of whimsy, woe, and wizardry! Your mission is simple. Storm the tower and defeat Vulgord (a wizard-turned-dragon by an unrelenting madness and an insatiable urge for power).<br/><br/>You will travel through four elemental realms rife with cruel beasts and bizarre encounters in pursuit of the tower keys. Punish your enemies with the help of the wizard’s spell. Amass an army, gain renown, and ride to victory. Your outcome is one of triumph or certain death!<h3>Vulgord's Tower Gameplay</h3><br/>Vulgord's Tower plays like a traditional board game fused with card-based RPG battle mechanics. The goal is to be the first to storm the tower to defeat Vulgord. To do this, you must survive through all four realms, acquire skills, and amass an army large enough to defeat Vulgord. <br/><br/><strong>Fight to survive! The spoils of battle come in the form of gold, warriors, and keys. All of which are integral to your quest:</strong><br/><br/><br/><br/><strong>Visit Bazaars to level up your attacks:</strong><br/><br/><br/><br/><strong>Visit Wizard Towers to cast spells on your opponents:</strong><br/><br/><br/><br/><strong>Find keys (one in each realm) before proceeding to the next realm:</strong> <br/><br/><br/><br/><strong>Every turn triggers an event. Events can be a battle, a story/lore, a branching conditional event that requires choices, or a trip to the bazaar or wizard tower:</strong><br/><br/><br/><br/><strong>Each realm contains a unique set of enemies, and in some instances, special events:</strong><br/><br/><br/><br/><strong>Be the first to storm the tower!</strong><br/><br/><h3>The Story of Vulgord</h3><br/>Vulgord was once a wizard with a proclivity toward the sinister and macabre. A dark incantation sent him spiraling into madness (a madness so deep that it was able to produce his dragon form). Vulgord’s lunacy and viciousness know no bounds. His terror reigns atop a tower located centrally between the four elemental realms. He must be stopped!<br/><br/>You have been called to complete a formidable task. Defeat Vulgord and free the realms from his spell. On this archetypal quest you will amass an army, battle Vulgord's minions, obtain riches, and thwart all of those who stand in your path to glory! <br/><br/><strong>Be the first to wield your power in Vulgord's Tower!!!</strong>", "metacritic": null, "released": "2021-08-09", "tba": false, "updated": "2021-08-13T02:37:30", "background_image": "https://media.rawg.io/media/screenshots/433/4333c485cefd3190611d53188cfb01ea.jpg", "website": "https://vulgordstower.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 317, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Stone Giant"], "genres": ["RPG", "Strategy", "Casual", "Indie"], "publishers": ["Stone Giant"], "esrb_rating": null}