{"id": 647551, "slug": "bionicle-masks-of-power", "name": "BIONICLE: Masks of Power", "name_original": "BIONICLE: Masks of Power", "description": "<p>Disclaimer - This is an unofficial fan game produced and provided 100% free-of-charge under rules and policies provided by The LEGO Group.</p>\n<p>BIONICLE: Masks of Power is an all-new open world adventure set in the BIONICLE universe. Currently in development by Team Kanohi, BIONICLE: Masks of Power retells the legendary stories of BIONICLE&#39;s initial launch in 2001. Built from the ground up in Unreal Engine 4, Mata Nui and its inhabitants have been completely re-imagined for the modern day. Revisit beloved locations and characters, enjoy thrilling open-world gameplay and get lost in the BIONICLE universe all over again.</p>\n<p>Discover Mata Nui<br />\nThe ancient tropical island of Mata Nui is home to beautiful vistas, formidable dangers, and countless mysteries. Once a tranquil paradise, Mata Nui’s inhabitants have been cast into shadow by the dark spirit known only as the Makuta. Tribes of brave Matoran villagers struggle to survive, placing their hopes in the arrival of legendary Toa heroes. Discover the island’s six distinct regions, brave its perils, and unlock its secrets in this all-new open-world adventure.</p>\n<p>Challenge the Rahi<br />\nThe dark spirit Makuta has cast his shadow on Mata Nui and its inhabitants. Fearsome Rahi beasts roam the lands, their masks infected with the Makuta’s influence. You must face these formidable guardians on your quest to obtain the Kanohi masks of power and defeat the Makuta.</p>\n<p>Find the Power<br />\nPlay as each of six Toa heroes, prophesied warriors washed ashore on the island’s beaches. Wielders of great elemental power, each Toa must collect the twelve Kanohi masks of power if they hope to challenge the Makuta. It’s up to you to help the Toa complete their quest, find the hidden masks of power, and cast aside the Makuta’s shadow. The fate of Mata Nui is in your hands.</p>", "metacritic": null, "released": null, "tba": true, "updated": "2021-08-11T19:58:33", "background_image": "https://media.rawg.io/media/screenshots/979/9796f716babfc97d3ee6ecc843e0c64e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 326, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Team Kanohi"], "genres": ["Action"], "publishers": [], "esrb_rating": null}