{"id": 647687, "slug": "port-city-ship-tycoon", "name": "Port City: Ship Tycoon", "name_original": "Port City: Ship Tycoon", "description": "All the ship lovers, ship collectors and ship simulation enthusiasts who love everything ship transport related unite! It’s time to put your ships on waters and build a port city and a global ship empire. Become a ship tycoon and enjoy a beautiful ship simulation journey full of surprises, city customizations, achievements and challenging contracts. Express your ship self!<br/>Discover and collect hundreds of famous real life ships. The better the ship, the more cargo it can take, the easier your strategy becomes. It can become quite challenging sometimes, but as a ship tycoon looking to build the biggest ship empire in the world you’ll find a way!<br/>Shipping the required cargo and completing various contracts is the key to develop your port city.<br/>Upgrading ships comes in handy because an upgraded ship fleet is way more powerful when completing contracts and can save a lot of time on waterways! Did you know that there are ship rarity categories in this tycoon city simulation? Rare ships have higher transport capacity! Bending rules of a port city tycoon simulator has never been easier either.<br/>Port City game tycoon features:<br/> ▶ Own popular ships from history of maritime transport<br/>▶ Collect famous cargo ships, upgrade them and reach their full transport potential<br/>▶ Meet interesting contractors and complete ship freight transport and logistics jobs<br/>▶ Coordinate and transport your ships according to your own simulation strategy<br/>▶ Enhance your port city and build bigger and better transport facilities and docks to fit more ships <br/>▶ Explore new global regions as your ships travel the seas through bridges and islands<br/>▶ Play new events every month in the Port City Ship Tycoon<br/>▶ Team up with fellow ship tycoon enthusiasts during events &amp; work together<br/>▶ Compete in leaderboards to become the biggest ship tycoon<br/>▶ Dispatch freight ships to collect resources and transport those to your contractors &amp; city to complete jobs<br/>Are you up for a transport challenge and ready to collect ships, to build and manage a global city and ship empire and become the biggest global ship tycoon in the Port City world?<br/>Have you encountered a ship contract which does not suit your strategy? You can easily swap the ship transport requirements, or cargo requirements to get a better fit for your sea transportation needs. Both kids and adults can do this!<br/>PLEASE NOTE! Port City is an online free strategy tycoon simulation game to download and play that requires a network connection to play. Some in-game items can also be purchased for real money. If you don't want to use this feature please disable in-app purchases in your device's settings.<br/>Do you have any suggestions or problems in your port city? Our caring community managers would love to hear from you, visit https://care.pxfd.co/portcity!<br/>Terms of Use: http://pxfd.co/eula Privacy Policy: http://pxfd.co/privacy<br/>Do you enjoy our 3D tycoon simulation game? Follow @portcitygame on social media to get the latest news and updates.", "metacritic": null, "released": "2021-08-04", "tba": false, "updated": "2021-08-13T03:47:55", "background_image": "https://media.rawg.io/media/screenshots/0f1/0f186a53fbeafbac79fb0601208f8a78.jpg", "website": "https://pixelfederation.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 207, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Pixel Federation Games"], "genres": ["Strategy", "Simulation"], "publishers": ["Pixel Federation Games"], "esrb_rating": "Teen"}