{"id": 647714, "slug": "race-master-3d-car-racing", "name": "Race Master 3D - Car Racing", "name_original": "Race Master 3D - Car Racing", "description": "🏎️  Race Master 3D – Fast, furious and super-fun racing  <br/><br/>Keep your finger to the floor and be ready for absolutely anything in this ridiculously entertaining mobile racing game where you really never know what’s around the next corner. Fine tune your ride, keep your foot on the gas, dodge the endlessly varied obstacles, and try to keep out the way of your equally manic rivals in super-fast, super-exciting, psychedelic races that always offer something new and unexpected. Feel the need for speed? <br/><br/>You’ll get speed, drama, awesome cars and a whole lot more in this addictive casual driving game that’s as intuitive as it is outrageous.<br/><br/>🏁 TO GET YOUR PULSE RACING… 🏁 <br/><br/>🥇 Hard to keep track: 33 unique levels with a huge range of different surfaces and obstacles to race over and around at breakneck speed. Plus 8 different bosses in specially tricked out cars ready to make your ride even more hair-raising.<br/><br/>🥇Racing all over the world: 7 different locations with different track characteristics and richly detailed backdrops, decorated with ramps and tunnels with 14 different neon illumination designs, ensuring there’s always something to look at out the window.<br/><br/>🥇What’s in your garage? 7 classic sports cars to collect and customize as you race through the levels in the game. Place high in every race to earn more cash, tune your car’s engine for ultimate speed, acceleration and handling, add exciting accessories and choose between 15 different paint jobs to really pimp your ride.<br/><br/>🥇 Hear me roar: who needs music when you have the roar of high-performance engines, the screech of tires and the crunch of colliding metal? Enjoy the rich sound world of Race Master 3D alongside simple but striking graphics and spectacular crash effects that’ll shake your bones every time you come spinning off the track or grind to a thudding halt.<br/><br/>🔥 THE ULTIMATE POCKET RACER… 🔥<br/><br/>Looking for a racing game that’s easy to play, provides a real driving challenge, and offers excitement and endless variation, cools cars and dangerous rivals, all in fast and furious races that can be run in a matter of minutes? <br/><br/>Keep Race Master 3D in your pocket and you’ll have instant access to awesome driving thrills anytime, any place and anywhere, trying again and again to reach the podium despite a series of increasingly surreal and testing obstacles that come rushing at you down the track in a crazy, colorful whirl.<br/>Download now to find out if you can be the master of the track in the wackiest, wildest, winningest mobile racing game available.", "metacritic": null, "released": null, "tba": false, "updated": "2021-08-13T04:04:59", "background_image": "https://media.rawg.io/media/screenshots/670/670e865f901a60da55a29fe39290603f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 163, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["SayGames"], "genres": ["Racing"], "publishers": [], "esrb_rating": "Everyone"}