{"id": 64779, "slug": "isu", "name": "I・S・U", "name_original": "I・S・U", "description": "Sit in the Chair by any means !<br/>Break a leg !▼What's this game ?▼This game is \"top-view fighting action musical chair game\".<br/>In this game, you will control the character selected by you to compete with other players for the chair.<br/>If you want to sit in the chair, there is no problem kicking the chair or other players in this game (Please don't kick others in the real world).▼Rule▼After sitting in the Chair for 3 seconds, you will be the winner. Otherwise,you will be an underdog.<br/>In the game with the time limit, the closest player will be the winner when time is up.(By default, the time limit is 60 seconds.)<br/>If your HP is eliminated, you will drop out.▼Actions▼Playable characters have each unique skills to win the chair.<br/>The skill can be used by pressing the 1 or 2 button, so you don't need to practice complicated command inputs like typical fighting games.<br/>Also, there are two types of gauges (SP gauge and EX gauge) gathered according to time, you can take actions to accumulate gauges and activate skill by consuming gauge.<br/>Then various situations will occur during the game by each players' actions.<br/><br/><strong>-Possible actions during game（Buttons of Xbox controllers）-</strong><br/>・<strong>MOVE</strong>（L stick）：Movement in 8 directions.<br/>・<strong>STRIKE</strong>（A／Y）：Attack to nearby enemies.<br/>・<strong>TACKLE</strong>（B）：Rush in the direction facing.You can change the facing direction before moving.<br/>　・<strong>TECHNICAL TACKLE</strong>（B during other actions）：TACKLE will be activated during another actions.If starting of TACKLE is invincible, the invincible time of TACKLE is 0 or short.<br/>　・<strong>CHAIR TACKLE</strong>（B during sitting）：Immediately rush from the chair.<br/>・<strong>SP ARTS</strong>（X）：SP gauge usage skills. Techniques to expand the range of strategies such as jumps and invincible actions.<br/>・<strong>EX ARTS</strong>（LB＋ A／B／X／Y）：EX gauge usage skills. Techniques that suits the personality of the character.<br/>・<strong>CHARGE</strong>（LB）：Speed up accumulation of SP gauge and EX gauge.<br/>・<strong>GUARD</strong>（RB）：Invalidate damage from your opponent. If you receive a guard break attack (GB) such as TACKLE, GUARD reduce damage by half .<br/>　・<strong>SIT/STAND</strong>（RB by the chair）：Sit in the Chair. / Stand up from the Chair<br/>・<strong>MIRACLE</strong>（LB＋RB）：Skill that can be used only once during game. Cancel the current action and blow away what is in the surroundings. You can cancel rigidity of this skill with EXTRA.<br/>・Pause（START）：Pause the game.<br/>・Zoom In（LT）：Zoom in when the camera mode is Player.<br/>・Zoom Out（RT）：Zoom out when the camera mode is Player.<br/>・Zoom Reset（Back）：Initialize zoom.<br/><br/><strong>-Operation on selection scene-</strong><br/>・Switch players（Keyboard1-4）：When you press that in the title scene, you change the number of the keyboard operated player.<br/>・Move（L stick）：Change the focus. On the character select scene, the cursor moves.<br/>・Decide（A）：Select the focused one.<br/>・Cancel（B）：Cancel your selection.<br/>・Decide CPU characters（X／Y／LB／RB）：Press it on the character panel when you want to decide the CPU on the character select screen, .<br/>・Game Start （Start）： Press it and start the game when the game start condition is set.<br/>・Back（Back）：Return to the previous screen.<br/><br/><strong>-Keyboard configuration (Modifiable) -</strong><br/>・arrow key：L stick<br/>・Z key：A button<br/>・X key：B button<br/>・C key：X button<br/>・A key：Y button<br/>・L-Shift：L button <br/>・R-Shift：R button <br/>・S key：L trigger<br/>・D key：R trigger<br/>・Space：Start<br/>・Escape：Back▼Game mode▼There are various modes in this game.<br/>Please choose the mode you want to do.<br/><br/><strong>LESSON</strong><br/>Characters will explain the operation and skills in this mode.<br/>If you don't know how to operate and rules of this game, please try playing this mode first.<br/><br/><strong>REHEARSAL</strong><br/>You can practice in this mode.<br/>Please prepare the environment with rehearsal options and practice.<br/><br/><strong>VS</strong><br/>You can fight among players, fight with CPU, watch match between CPUs in this mode.<br/>Up to 4 players can play at the same time.<br/>・Camera mode<br/>　You can choose from 3 camera modes. Please switch  in options mode according to your preference and situation.<br/>　First：Mode to draw around 1P.<br/>　Players：Mode to divide the screen and draw each player.<br/>　Chair：Mode to draw around the Chair.<br/><br/><strong>２VS２</strong><br/>You can fight at 2 VS 2 in this mode.<br/>The team to which the winning player belongs wins.<br/>Please enjoy the strategy by combining various characters.<br/><br/><strong>ARCADE</strong><br/>It is a mode of fighting continuously with the CPUs.<br/>If you clear stage 10, you can see ENDING.<br/><br/><strong>OPTIONS</strong><br/>You can make various changes such as change of key config, game speed, time limit, processing at the time of dropout.<br/>Since the settings of ARCADE mode and REHEARSAL mode are independent without basic setting (1st page), please change from OPTIONS on each character select scenes.<br/><br/><strong>AWARDS</strong><br/>You can see the awards of releasing.<br/>It also contains hints of awards that have not yet been achieved.<br/>You need to use the keyboard to achieve all awards.▼Playable Characters▼<br/><strong>Histoire</strong><br/><br/>Birthplace : France<br/>He is the game master of I・S・U. <br/>He is art works with ego. His head is made of the concept of a chair.<br/>His ability is good at handling the Chair.<br/><br/><strong>Fadia</strong><br/><br/>Birthplace : Dubai<br/>She is a robot with free will after singularity.  fights for self-sacrifice for salvation.<br/>Her feature is two different battle modes. You can change these modes in battle.<br/><br/><strong>Kokuzo</strong><br/><br/>Birthplace : Japan<br/>She is a ninja aiming for the villain who killed his father.<br/>Her HP is small, but she has fast legs, high offensive sword and \"shuriken\"(throwing star).<br/>With her EX ARTS, she can go behind the nearest enemy from the chair. So sometimes she can reverse the situation.<br/><br/><strong>Iwan</strong><br/><br/>Birthplace : Russia<br/>He is a clumsy, honest and powerful farmer. His hobby is wrestling.<br/>He has high endurance and long invincible time.<br/>His legs are so late that it is difficult for him to win once he leaves the chair.<br/><br/><strong>Meaw</strong><br/><br/>Birthplace : Thailand<br/>Ze is a lovely ladyboy. Ze zirself is non-violent, but a violent spirit \"Phi\" protects zir.<br/>You will operate two characters(Meaw and Phi) at the same time.<br/>Even if Meaw sits in the chair Phi can attack, so this character is very strong.<br/><br/><strong>I Pak-ssu</strong><br/><br/>Birthplace : Korea<br/>He is a Ponchak Star. He loves to dance and sing.<br/>Because he has skills that can cancel all actions, he can respond instantly to various situations.<br/>During EX ARTS invocation you will be able to attack the enemies that are falling, so you can hit great damage by hitting STRIKE.<br/><br/><strong>Dan</strong><br/><br/>Birthplace : Scotland<br/>He is a genius football juvenile. He was born as a nobleman, but he dislikes that his father is severe.<br/>Because his attack range is long, with this character you can control the game without getting close to the chair.<br/>However, it takes time to recover when under attack, sometimes he'll drop out without counterattack.<br/><br/><strong>Dafu</strong><br/><br/>Birthplace : Hong Kong<br/>He is a chubby trickster who are easily deceived. Master of Kung Fu.<br/>There are few circumstances that are difficult for him, and he is easy to use.<br/>You can decide the game at once with high risk - high return skill.<br/><br/><strong>Wunala</strong><br/><br/>Birthplace : Australia<br/>He is a violent kangaroo fighter. Attack, break, fun.<br/>His HP is small, but he has fast legs and high offensive power.<br/>It is difficult to play as him because he will be knocks out as soon as you make a mistake.<br/><br/><strong>La Suicida</strong><br/><br/>Birthplace : Mexico<br/>She is a daredevil Lucha Dola. She will accept anyone's challenge.<br/>Tackle movement distance is characteristic of her.<br/>Because she is easy to use, if you are troubled with the character you use, I'd recommend using this character for the time being.<br/><br/><strong>Shanti</strong><br/><br/>Birthplace : Himalayan Range<br/>She is a yoga master. She meditates anyway.<br/>Because meditation (EX ARTS) improves ability, meditation is a way to win.<br/>She also has a full recovery skill, so you may take aggressive actions.<br/><br/><strong>Steven</strong><br/><br/>Birthplace : United States of America<br/>He is a spokesman for justice. He is a mayor who resolves anything by power.<br/>His feet are slow, but he has skills to move, so he will move around.<br/>Because his ability to take chairs is low, you basically have to defeat your opponent when using him.<br/><br/><br/>In this game, we use the materials of the following site.<br/><br/>-image<br/>ぴぽや<br/>白螺子屋<br/><br/>-Sound effect<br/>ザ・マッチメイカァズ<br/><br/>-Music<br/>甘茶の音楽工房<br/>魔王魂<br/>龍的交響楽<br/><br/>-Font<br/>Lightmorning<br/>うつくし明朝体フォント<br/>FatCow Font Family<br/><br/><br/>This is a work of fiction. <br/>The characters, incidents and locations portrayed and the names herein are fictitious and any similarity to or identification with the location, name, character or history of any person, product or entity is entirely coincidental and unintentional.<br/><br/>Written by fuddy (Shota Fujimoto)", "metacritic": null, "released": "2018-04-20", "tba": false, "updated": "2019-08-28T21:55:01", "background_image": "https://media.rawg.io/media/screenshots/72f/72ff2fe7b6f78ee1d3e66c10e3caaa73.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Parir-mar"], "genres": ["Action", "Indie"], "publishers": ["Parir-mar"], "esrb_rating": null}