{"id": 647701, "slug": "block-craft-world-craftio", "name": "Block Craft World: Craft.io", "name_original": "Block Craft World: Craft.io", "description": "You will join wonder world with many beauty scenes in Block Craft.<br/>Do you an io and building game fan? Do you like arcade action game and simulation game?Have you ever played minicraft games? Block Craft World is a new fun game and relaxing game that you don’t wanna miss and you can creative your world which can’t make in real.<br/> <br/><br/>Block Craft World – the fascinating combination of smasher io game and gamecube. In this free fighting game, you will play as a craftsman gunner and join in battle arena. You will be fully equipped with weapons such as hammer, gun, sword, knife. Your mission is so simple: Smash them all!<br/> <br/>You must destroy dwarf and the more dwarfs you kill by weapon, the bigger and stronger you become. Exploring endless funny moments in offline game by using your crafting hammer to smash others and don't get hit or slither. When you win the blockworld battlefield, you can become the last survival masterscraft.<br/> <br/>Moreover, there are two modes minigame of creation and survival in the offline game. Block Craft World is a sandbox crafting build game which will help you make your dream comes true. You will craft and explore the adventure blockworld, seek resources, sandbox, block craft and build great world. You can gather different resources as earth, stone, wood or open ark…and building a world with exciting multicraft to craft block and survive in the adventure smash io game.<br/> <br/> GAME FEATURES <br/>-        Awesome 3D gamecube graphics<br/>-        Simple and funny io smasher game<br/>-        Many blocks and sandboxes in this relaxing game<br/>-        Enter the war and fighting with enemy in survival mode<br/>-        Easy to control io game<br/>-        Build your world with many block in game<br/>Download BLOCK CRAFT WORLD now for free!!!", "metacritic": null, "released": "2021-07-30", "tba": false, "updated": "2021-08-13T03:55:33", "background_image": "https://media.rawg.io/media/screenshots/51f/51fb3e18499e64c7b54f1515a1320312_pLBGZo0.jpg", "website": "https://galaxyshooter.club/savegirl/privacy.html", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 128, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["XGame"], "genres": ["Adventure", "Simulation"], "publishers": ["XGAME SERVICE AND TECHNOLOGY JOINT STOCK COMPANY"], "esrb_rating": "Everyone 10+"}