{"id": 647702, "slug": "allstar-hero-super-stick-fight", "name": "AllStar Hero Super Stick Fight", "name_original": "AllStar Hero Super Stick Fight", "description": "Super Stick Fight All-Star is the best action for Stickman games and fighting arcade game on App Store.<br/><br/>A whole new storyline about characters familiar to all of us. <br/>A Devil God group capable of bringing all characters from different universes gathered in your world through a space portal. You, along with all your new friends, will have to face the most powerful villains in the multiverse. This war is called Chaos War. Stand side by side with teammates and fight and bring new peace to your world.<br/><br/>You can choose their Super Heroes, upgrade the ultimate power, join the tournament of multiverses and climb TOP on worldwide rankings.<br/><br/>- Unique graphics, amazing music and sound effects.<br/>- Deep storyline with 11 chapters - 500 levels ( update new chapters and levels weekly).<br/>- 142 heroes for you to choose (update new heroes weekly)! Please collect, level-up and evolve them.<br/>- The upgrade system is huge but easy to use.<br/>- Super diverse combat skills with more than 300 different skill types: Hame attack ball, Final Blast, Spider web, Thunder Flash, Roar of the God, Iron Gun Machine, Brave Soldier, Dragon Sword, X beam, Great Fox, Storm Of God... ( And many skills A to Z, all in one game).<br/>- Unlock many mode and face many challenges.<br/>- 7 Leagues in PvP Mode: Beginner, Amateur, Pro Player, Top Player, Legend, God, Ultimate<br/>- Climb top of the word in PvP Mode to get super rewards for the strongest man.<br/>- Try your power in Power Challenge. You will have a new experience with Rogue-like gameplay in a combat fighting game. <br/>Download Super Stick Fight All-Star now - to experience the world's best fighting action game.", "metacritic": null, "released": "2021-08-02", "tba": false, "updated": "2021-08-13T03:56:15", "background_image": "https://media.rawg.io/media/screenshots/c0e/c0ecd7ed4115c7760c62bedc5cadf849.jpg", "website": "https://onegamestudio.net", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 297, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["MOBIONE TELECOMMUNICATIONS TECHNOLOGY AND SERVICE CO"], "genres": ["Action", "Casual"], "publishers": ["MOBIONE TELECOMMUNICATIONS TECHNOLOGY AND SERVICE CO"], "esrb_rating": "Teen"}