{"id": 64782, "slug": "amaranthine-voyage-the-shadow-of-torment-collector", "name": "Amaranthine Voyage: The Shadow of Torment Collector's Edition", "name_original": "Amaranthine Voyage: The Shadow of Torment Collector's Edition", "description": "From <strong>Eipix</strong>, the studio who brought you Hidden Expedition, presents another Amaranthine Voyage!<br/><br/>Long ago, Anther was a realm of beauty and magic, but the appearance of a being named Torment drained their magic and forced the survivors to flee to a world called Earth. Years later, one of their artifacts has been uncovered, reopening the way between both worlds. You must enter the portal and stop Torment before it turns its sights toward Earth. An ancient prophecy declares that you will be the one to save both worlds, but will it come true? Find out in this breathtaking Hidden Object Puzzle Adventure game!<br/><br/>This is a special Collector's Edition release full of exclusive extras you won't find in the standard version. The Collector's Edition includes:<br/><br/>A thrilling bonus adventure with Professor Burns' protégé!<br/>Unlock mini-games to extend the challenge<br/>Music, wallpapers, concept art, and more!<br/>An available Strategy Guide<br/><br/><br/>This is a Hidden Object Puzzle Adventure game, meaning a specific genre of story-driven, point &amp; click adventures. Throughout the game, players are tasked to find a list of objects hidden within a particular scene, and to occasionally complete various mini-games/puzzles.", "metacritic": null, "released": "2018-02-12", "tba": false, "updated": "2019-08-28T21:55:01", "background_image": "https://media.rawg.io/media/screenshots/2db/2dbeb5b0009a5b334d142c21c53d9977.jpg", "website": "https://www.bigfishgames.com/games/7917/amaranthine-voyage-the-shadow-of-torment-ce/?pc", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 6}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 616, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Eipix Entertainment"], "genres": ["Adventure", "Casual"], "publishers": ["Big Fish Games"], "esrb_rating": null}