{"id": 64788, "slug": "jack-and-sara-educational-game", "name": "Jack and Sara: Educational game", "name_original": "Jack and Sara: Educational game", "description": "<strong>\"Jack and Sara\"</strong> – There are a lot of interesting, colorful and fun games for children up to 5 years of age who so actively learn about the world.<br/>In an unobtrusive way, Jack and Sara will teach your child fun games for the development of logic, attention, memory and color perception. Developers took care about the beautiful music and the voice acting.<br/><br/><strong>\"Jack and Sara\" offers the following mini-games:</strong><br/>1. Vegetables. Help Sara to collect vegetables and arrange them by colour.<br/>2. Toys. Collect all the toys in the yard together with Jack.<br/>3. Pets. Help Sara to find pets in the yard.<br/>4. Butterflies. Help Jack to search for butterflies of the same color.<br/>5. Sweets. Put sweets in the basket together with Sara.<br/>6. Car designer. Build a car together with Jack.<br/>7. A bouquet of flowers. Help Sara to collect the flowers that she needs.<br/>8. Fish in an aquarium. Help Jack to count fish in the aquarium.<br/>9. Castle designer locks. Build a house together with Sara.<br/>10.Bedroom. Help Jack and Sara to find pictures and fall asleep.<br/><br/><strong>Features</strong><br/>★ Bright and atmospheric graphics,<br/>★ Calm and beautiful music,<br/>★ Recorded voice,<br/>★ Teaching a child the color associations, logic, memory development.<br/><br/>Play wonderful mini-games with <strong>\"Jack and Sara\"</strong>!", "metacritic": null, "released": "2018-05-02", "tba": false, "updated": "2021-09-17T14:50:42", "background_image": "https://media.rawg.io/media/screenshots/8b6/8b62c19c90cdcb2441532e167db22fe8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 31}, "playtime": 1, "achievements_count": 10, "ratings_count": 0, "suggestions_count": 348, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["REEW GAMES", "beherzt"], "genres": ["Adventure", "Casual", "Educational"], "publishers": ["REEW GAMES"], "esrb_rating": null}