{"id": 647879, "slug": "run-robin-run", "name": "Run Robin, Run", "name_original": "Run Robin, Run", "description": "<p><em>By The Explorers </em></p>\n<p><strong>Introduction</strong></p>\n<p>Run Robin, Run is a 2D sidescroller-game in which the player controls the rabbit Robin, our protagonist. While controlling Robin, you will run through a future full of burning wildfires caused by climate change and try to escape from this while avoiding different obstacles along your way. During the travel you will be able to view the level with a back to present vision that allows you to have an improved view of the level and see what it looked like before the wildfires came. In the end we compile a list of tips for you to help the climate - and save Robin from experiencing this in the future!</p>\n\n<p><strong>Controls</strong>\n</p>\n<ul><li>Use the arrow keys og ‘A’ and ‘D’ keys to go left and right\r\n</li><li>Press the spacebar to jump.\r\n</li><li>Press F to create the back to present vision for a better view of the level, and a circle of the present will appear. \r\n</li></ul>\n\n<p><strong>Values</strong><br/></p>\n<ul><li>Interesting environment\r\n</li><li>Seeing future and present time \r\n</li><li>Immersion and engagement\r\n</li><li>Open up for reflection and discussion\r\n</li><li>Suggesting ways to help the climate\r\n</li></ul>\n\n<p><strong>Mechanics</strong>\n</p>\n<p>In the game, which is set in the future, you’ll sometimes be unable to go past certain obstacles without using the back to present vision ability. This ability grants you the power to go back to the present and see what the forest looked like before the wildfires came. We implemented this mechanic as a way of going between the future and the present, and to create an interesting way of going through the level. \r\n</p>\n\n<p><strong>Narrative</strong></p>\n<p>The game has an enacted narrative; the game is structured around Robin’s movements and the different features/obstacles will be a factor in determining the outcome of the game (Jenkins, 2003). You get introduced to Robin’s situation through a prologue and will then play as her to get through the wildfires and into safety. Upon reaching safety, an epilogue will tell you that Robin is safe, as well as give you tips on how to help her - these tips are aimed at children to help the climate and in that sense help Robin as well.\r\n</p>\n\n<p><strong>Becoming Robin\r\n</strong></p>\n<p>In our game we wanted to focus on an animal protagonist, as we wanted to create more empathy (Gardner, 2020). By choosing a rabbit rather than a man as avatar for our game, we wanted to promote the feeling of helplessness - and encourage the player to help save Robin from the wildfire. We worked with the term mimicry for this game as well, hoping to create a simulated experience which might help get the player immersed in Robin’s story, and in that way get more involved and aware of climate change and wanting to do something about it (Murray, 1998) (Caillois, 1962). In the epilogue, we’ve included tips to children for how to help the climate. \r\n</p>\n\n<p><strong>Theme</strong>\n</p>\n<p>During the pandemic, there’s been an increasing focus on the next big threat of climate change. Changing weather and more frequent and extreme natural disasters are becoming the new new normal. For our project, we wanted to focus on bringing awareness to climate change by focusing on the target group of children.</p>", "metacritic": null, "released": "2021-08-12", "tba": false, "updated": "2021-08-13T04:44:01", "background_image": "https://media.rawg.io/media/screenshots/7ca/7ca4d4aa2a13566705ffc7900cb3380c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 37, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["The Explorers"], "genres": [], "publishers": [], "esrb_rating": null}