{"id": 648275, "slug": "manu-first-person-horror", "name": "Manu First Person Horror", "name_original": "Manu First Person Horror", "description": "<p>Manu is a no-code game engine, which natively only supports side-scrolling view at the moment. I pushed the engine to its limits and did seemingly impossible: first person horror game with procedural maze generation. There are some caveats though, more on that later.</p>\r\nHow to play\r\n<ul><li>WASD to move</li><li>Hold Shift to run and turn faster</li><li>Find a key (spinning golden cube)\r\n</li><li>Find an exit door (same as wall, but slightly tinted blue) - it's open if you've found a key</li><li>Avoid a ghost (spinning black thing)\r\n</li><li>If you get caught by a ghost, you’ll need to find a key again and it might be in a different location\r\n</li><li>Maze is randomly generated every game launch, but is not change after getting caught<br/>\n</li></ul>\r\nCaveats\r\n<ul><li>Due to the way maze generation works, you'll have to wait some time before the maze is fully generated. You can start playing right away (but the maze doesn't start all connected) or you can just wait around 5-7 minutes</li><li>With first-person view, I couldn't get collisions to work properly, so you can go through walls, but you shouldn't! It's on you - no cheating!</li><li>It seems like Manu creates a distinct material for every object with a texture. I initially had all walls textured: it looked much better, but it worked very slow, so I had to sacrifice graphics in favor of gameplay and removed textures from walls</li></ul>\n<p> </p>", "metacritic": null, "released": "2021-08-11", "tba": false, "updated": "2021-08-13T06:29:57", "background_image": "https://media.rawg.io/media/screenshots/333/3334f34ee842e50d8e6d61eac2a604da.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 105, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Igor Konyakhin"], "genres": [], "publishers": [], "esrb_rating": null}