{"id": 64830, "slug": "our-hero-hyper-sword", "name": "Our Hero! Hyper Sword", "name_original": "Our Hero! Hyper Sword", "description": "What is \"Our Hero! Hyper Sword\"?<br/>Our Hero! Hyper Sword is an epic action-adventure game with some RPG mechanics starred by fancy and colorful characters, inspired by such titles as Castle Crashers, Jak and Daxter &amp; Zelda.<br/><br/>The game involves seamlessly alternating Hack'n'Slash and platforming sections, free-to-explore environments dotted with secrets to collect and enemies to fight in frantic real-time battles, each guarded by armored and evasive boss which require timing and tactics to hit in an opening.<br/><br/>The game's main focus is the Story Mode, playable in Single-Player or in local Multiplayer with a friend.Features<br/><ul><li>Explore a sprawling open world divided into zones: discover the Royal Gardens, the Castle Vaults, the Lost Valley, the Ancient Forest and other enchanted places.<br/></li><li>Each Hero has his own special abilities: switch your Heroes and Cooperate with your Companion to overcome obstacles and proceed through the Atcs.<br/></li><li>A lot of action: run, jump, fight, run on walls, climb, shoot and take control of enemies!<br/></li><li>Immersive Story starred by nice NPCs and rascally enemies.<br/></li><li>Local 2 player Co-Operative play.<br/></li><li>Real-time Battle System.<br/></li><li>More than 30 unique Swords to discover and collect: boost and transform your swords!<br/></li><li>10 different zones to explore and overcome: solve puzzles, discover secret places and fight epic boss battles!<br/></li><li>Side quests and funny minigames to play during your adventure.<br/></li><li>Trophies to unlock in the Trophies Hall and Cards to collect to complete your Gallery.<br/></li><li>Take part in the Final Battle and save the heroes' world.</li></ul>Story<br/>Are you itching to cut down a swathe of baddies, with your back stretched and a giant sword in your hands? The King is in need of help, and you've been trusted with the task of making a stand for the entire world.<br/><br/>Step in the shoes of the Ourhero, arm yourself with your trusty swords, and set off on a quest to retrieve the Theoremas Crystal and the beloved Royal Piggy!<br/><br/>The devious Finalboss is racing against you to nab the Theoremas Crystal for himself, giving himself the ultimate magical power to sink the world into despair and suffering. What's the real power of the Crystal? Do not let Finalboss to find it out.<br/><br/>Journeying through forests and fortresses, seas and skies, vast stretches of land and tight dungeons, carving your way through Finalboss and his cronies with the help of other mighty warriors and a cast of colorful NPCs assisting you in uncovering the land's treasures and secrets, and wielding an array of mighty weapons to collect and upgrade.<br/><br/>Are you ready?<br/><br/>The world of heroes awaits you!", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:54:58", "background_image": "https://media.rawg.io/media/screenshots/937/9377492dbb4b0ad8d53532d9f1b429dd.jpg", "website": "https://stesproject.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 148, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Ste's Project"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Ste's Project"], "esrb_rating": null}