{"id": 648493, "slug": "find-the-exit-tofu-sheets-visual", "name": "Find the Exit (Tofu Sheets Visual)", "name_original": "Find the Exit (Tofu Sheets Visual)", "description": "<p><em>\"They thought the dungeon was dead, empty... how foolish the townspeople were! The dungeon is very much alive and active, and it's starting to wreak havoc! That's where you, dear hero, come in...traverse every single floor of the dungeon until you reach the final exit to come back home!\"</em></p>\n<p>\"Find The Exit\" is a double-sided one page dungeon crawler that uses 2D6, playing cards, and coin flips for its mechanics.  Players generate their own maps by drawing a simple grid of 6 rows with 6 columns, and you can randomly fill in the squares with various encounters such as foes, chests, gold rooms, etc. as well as boss and exit locations! Simply roll 2D6 to determine where you are on the grid until you're able to traverse to the next floor!</p>\n<p>The setting is kept purposely vague and ambiguous to allow players to flesh out the details themselves. Is it a typical fantasy setting, post-apocalyptic, sci-fi, horror, or something more creative? What sort of monsters and bosses will you fight, or what sort of quests will you undertake? That's all up to you! And while classes and items are set, feel free to change or modify them to suit your game! Hack the stats to adjust difficulty if you need to. Be creative, have fun!</p>\n<p>For 2-3 players (with one acting as GM, or no GM with the 2P Share Mode)</p>\n<p><strong>ALL YOU NEED TO PLAY:</strong></p>\n<ul><li>A printed copy of this guide (or read it on your tablet/computer)</li><li>A notebook/pad for character sheets, quest logs, battle scoring, etc.<br/>\n</li><li>Some sheets of paper (or sketchbook) to draw the maps</li><li>A standard deck of playing cards</li><li>2 six-sided dice</li><li>1 coin</li></ul>\n<p><em>Credits:</em><br/></p>\n<p>This game was created by me for One-Page RPG Jam 2021.</p>\n<p>Images for the thumbnail were all from Pixabay, edited by me.</p>\n<p>Font used on the game's cover is Train One by FontWorks.</p>", "metacritic": null, "released": "2021-08-10", "tba": false, "updated": "2021-08-13T07:27:08", "background_image": "https://media.rawg.io/media/screenshots/60e/60e170622eb5cf03057dfffb4544545c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 36, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Tofu Sheets Visual"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}