{"id": 64848, "slug": "hidden-life", "name": "Hidden Life", "name_original": "Hidden Life", "description": "WARNING -<br/>This game deals with some controversial topics like depression and suicide. Not graphic in nature, but please be wary if you like to avoid such topics.Story<br/>Those who suffer from depression often find it hard to put into words what they deal with, those who have never had true depression don't understand it. Harder still is to notice someone suffering without them telling you, many find out only when it's too late. We all look back and think, \"Is there something I could have done?\" If you look hard enough, you can find different choices, but only when you look back knowing what you know now. <br/><br/>College, a fun time for some, a bad time for others. All have hopes and dreams, but some demons pull them down to a hole they can't climb out of. Life changes based on the smallest things, and those who suffer can sometimes see a light to help escape the darkness, or be forever wrapped in it.Features<br/><ul>[4 unique endings.]</ul><br/><ul>[2 playable characters.]</ul><br/><ul>[Unique characters and areas to explore.]</ul>Small note with minor spoiler<br/>This is all based on my experiences on both sides of the isle. Almost no one is ever to blame for choices made by others, and this is not meant to say you could've done something different to stop bad things from happening. We can always look back and see we should've noticed or we could've done better, but without knowing exactly what is going on, we can't ever really know.", "metacritic": null, "released": "2018-03-16", "tba": false, "updated": "2019-08-28T21:54:56", "background_image": "https://media.rawg.io/media/screenshots/3c6/3c628e6f43a4a3afcc3106b6d7dc4d97.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 75, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Taotie Industries"], "genres": ["RPG", "Indie"], "publishers": ["Taotie Industries"], "esrb_rating": null}