{"id": 648575, "slug": "afterworld-itch-dying-sun-games", "name": "Afterworld (itch) (Dying Sun Games)", "name_original": "Afterworld (itch) (Dying Sun Games)", "description": "<p><strong>Welcome to the Pulp-pocalypse</strong><br/></p>\n<p>The Atomic Revolution made everything better. Flying cars and groundbreaking science. Life was easy with a cup full of cybernetics and a household AI to keep things tidy. One could almost forget the ever-looming arms race.</p>\n<p>When the bombs fell, civilization was blown to bits and those not atomized were forced to deal with the fallout. The remainder of humanity began to rebuild from the irradiated ashes, forging a new history divorced from the divisions of the past.</p>\n<p>Then things got weird. Strange and magical mutations, Rogue AI set to destroy (or slightly annoy) mankind, and spectral politicians resurrected to continue their seemingly pointless work.</p>\n<p>Afterworld is a post-apocalyptic rpg where things always get weird before they get better. You play as a group of adventurers shimming across the atomized remains of the old world.  Follow your Game Master on blood-pumping, disco-dancing, robo-raging high-jinx as you see just how crazy things can get.</p><p><strong>Afterworld is a 47 page tabletop rpg zine about adventuring in the weird and having a blast. Made for Zinequest 3. A great rpg for an off-session one-shot. No character sheets. Use cards to pick up and play. Make wild characters and get a game up and running in 5-10 minutes. </strong>\n</p>\n<p><strong>Includes</strong>\n</p>\n<ul><li>core ruleset\r\n</li><li>print and play cards\r\n</li><li>introductory adventure</li></ul>", "metacritic": null, "released": "2021-08-10", "tba": false, "updated": "2021-08-13T07:47:48", "background_image": "https://media.rawg.io/media/screenshots/49a/49a9f3ab84d9e1b1556cb7453ad6b0cb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 9, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dying Sun Games"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}