{"id": 648917, "slug": "snuggle-smuggle", "name": "Snuggle Smuggle", "name_original": "Snuggle Smuggle", "description": "<p>The rival gang is crashing your gang's teddy bear smuggling operation, so grab as many teddies from the canister as you can and load them into the truck before they swarm you!  The teddy bear you are holding will be knocked out of your hands if a rival gang member hits you, so dodge them or knock them out when they get in your way!  Keep loading that truck until you eventually get overwhelmed!</p>\n<p>This is my submission to Games for Love's Charity Jam II, whose theme is \"Brawler+\" with the goal of combining the brawler genre with another core genre and one or more genre addons.  For this, my additional core genre is \"Cooking\" a la Overcooked that involves assembly gameplay in challenging environments, and this challenging environment is due to enemies attempting to smack what you're trying to deliver out of your hands.  I had wanted to add more assembly mechanics, such as taking a bear to another station to dye it a different color, and in particularly add in the mechanics that require longer focused interaction (e.g. synchronously cutting onions or asynchronously letting soup cook in Overcooked), but ran out of time in order to add this in.  My genre addon is \"Arcade\" and the goal would have been to surface a score in the UI for each teddy bear smuggled and enemy knocked out, but I did not have time to add in the scoring UI.</p>\r\nHow to Play\r\n<p>Movement: WASD or gamepad left analog stick<br/>Jump: I or gamepad south button<br/>Punch: J or gamepad west button<br/>Interact (pick up teddy from canister or deposit teddy into truck): L or gamepad north button</p>\n<p>Move your character close to the teddy bear canister on the left and push the \"Interact\" button to pick up a teddy, then work your way to the other side of the room and push the \"Interact\" button near the truck to smuggle the teddy out of the warehouse!</p>\r\nKnown Issues\r\n<ul><li>Moving using keyboard controls requires you to push a movement button upon landing after a jump since it doesn't recognize the movement button is still held down (not an issue with gamepad controls)</li><li>Sometimes you or an enemy will get locked into a hit animation, but after getting smacked around a few times it tends to fix it :) </li></ul>", "metacritic": null, "released": "2021-08-09", "tba": false, "updated": "2021-08-13T09:23:58", "background_image": "https://media.rawg.io/media/screenshots/e72/e728c6ddad55fa3997fb3980599ff442.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 31, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Matt Colón"], "genres": ["Action"], "publishers": [], "esrb_rating": null}