{"id": 649072, "slug": "castle-of-the-underdogs-episode-1", "name": "Castle of the Underdogs: Episode 1", "name_original": "Castle of the Underdogs: Episode 1", "description": "<strong>Castle of the Underdogs</strong> is a comedy JRPG game inspired by Suikoden-like games, with strategic turn-based combat, mass recruiting and a castle HQ.<br/><br/><br/><br/>Join <strong>Hikaru</strong>, a mischevous and carefree girl that learns magic, in an absurd adventure where she must recruit dozens of friends in order to restore the peace in the Bestann Federation despite spreading <strong>chaos</strong> to most places she steps on.<br/><br/><br/><br/><ul><li><strong>A classic story gone comedy</strong><br/>\tA hilarious story driven game with unpredictable situations and outcomes.<br/></li><li><strong>Lots of recruitable characters</strong><br/>\tRecruit characters during your adventure, each with his own ridiculous backstory. From guys having problems distinguishing reality from fiction to plunger-throwing failed ninjas.<br/></li><li><strong>Classic JRPG gameplay</strong><br/>\tLearn spells and abilities, steal equipment, explore the country, assault and loot the villagers' houses, find treasures and fight against the bad guys.</li></ul><br/><br/><br/><br/><br/><ul><li> <strong>Strategic battle</strong><br/>\tTurn-based JRPG battle system that draws its features from both Final Fantasy X and Suikoden series.<br/></li><li> <strong>Quick tagging</strong><br/>\tControl 6 players in battle, 3 at the same time, and tag between them strategically.<br/></li><li> <strong>Unite Attacks</strong><br/>\tMake several characters collaborate to unleash special attacks combining their skills.<br/></li><li> <strong>Knowledge system</strong><br/>\t A complex knowledge system that allows you to discover the enemies strengths and weaknesses, allowing you to plan your battle actions accordingly, as well as collecting the bestiary data.<br/></li><li> <strong>Create your own runes.</strong><br/>\tImbue the knowledge learnt during your adventure and combine it to create more powerful runes.</li></ul><br/><br/><br/><br/><br/><ul><li> <strong>Adjust difficult any time</strong><br/>\t5 difficulty levels to choose from, you can either enjoy the adventure without any battle hassle or be challenged by mighty foes.<br/></li><li> <strong>Flexible save system</strong><br/>\t99 saveslots for each playthrough, and all the playthroughs you want.<br/></li><li> <strong>Customizable HQ</strong><br/>\tExpand and decorate your own HQ (not yet in this version)<br/></li><li> <strong>Minigames</strong><br/>\tSeveral minigames available that will be expanded in both content and number in the following episodes.</li></ul>", "metacritic": null, "released": "2021-08-14", "tba": false, "updated": "2021-08-16T02:51:39", "background_image": "https://media.rawg.io/media/screenshots/c5e/c5ecc60fe59e30a1d68eccc0de19eb86.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 11, "ratings_count": 0, "suggestions_count": 242, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["House of Pandas"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["House of Pandas"], "esrb_rating": null}