{"id": 649079, "slug": "mycraft-2", "name": "MyCraft", "name_original": "MyCraft", "description": "Introducing MyCraft game !<br/>This is a stunning 3D pixel world in which you have the freedom of expression, the opportunity to develop your craft.<br/><br/>A free game in which you can mine resources, start your own farm, build various structures from a house to a whole CITY, explore endless cube worlds, craft weapons, tools and much more. Fight many dangerous monsters at night, create your own creative maps<br/><br/>My Сraft has different modes<br/><br/>- SURVIVAL - in this mode, players must defend themselves from night monsters, monitor hunger, build, collect resources and tame animals in order to survive!<br/><br/>- CREATIVE - in this mode, players have an unlimited assortment of resources with which you can build palaces of different sizes, it all depends on your imagination. Also, the player is given the option of a free flight mode<br/><br/>- MULTIPLAYER - a mode with the ability to play on different servers, exploring various created worlds and locations with real players, chatting with friends and having a great time with a large circle of people.<br/><br/><br/>FEATURES<br/><br/>- various skins<br/>- constantly generated worlds<br/>- the ability to play without connecting to a Wi-Fi network<br/>- different game modes<br/>- many different mobs<br/>- pixel 3D graphics<br/>- many different blocks<br/>- the ability to play with many players in multiplayer<br/>- survival in single player, crafting, offline<br/>- binoculars mode, thanks to which you can increase your<br/>  viewing range<br/>- mini map mode for better orientation on the terrain<br/><br/>By downloading this game you have unlimited access to the development of your imagination and creativity. You have the opportunity to start it now!<br/><br/><br/>MyCraft is not an official Mojang app. Minecraft is a trademark of Mojang AB and it is not endorsed by or affiliated with the creator of Minecraft or its licensers.", "metacritic": null, "released": "2021-02-21", "tba": false, "updated": "2021-08-16T02:58:18", "background_image": "https://media.rawg.io/media/screenshots/bc7/bc78a411bf18b64a58199b1944d460dd.jpg", "website": "http://mycraft.cloud", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 361, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sergei Zholnach"], "genres": ["Action", "Simulation"], "publishers": ["Sergei Zholnach"], "esrb_rating": "Everyone 10+"}