{"id": 649036, "slug": "singulive", "name": "Singulive", "name_original": "Singulive", "description": "Singulive is an immersive experience that takes you to concert halls and live music experience! It is now a reality that artists' tours stop at your home. <br/><br/>Your virtual reality device is now part of the tour schedules, something that has never happened before. Singulive is a virtual place that coexists with the physical concert halls that we all visit in real life to experience live music. It is a new way of understanding music by artists and spectators. <br/><br/>You can live the experience alone or accompanied (up to four), look at the web premieres, write them down in your agenda and appoint your companions, with weekly releases Singulive will ensure that your contact with live music is constant and vibrant. <br/><br/>Prepare your mind and passion for music for what Singulive offers you, social networks, news, premieres, archives, multiplayer experience and above all feel an active part of the live shows and venues you will enjoy. A calendar with different spaces, designed for a multitude of styles such as pop, rock, dance, blues, jazz, trap, classical. Exclusive concerts recorded for Singulive and that all Singuliners will enjoy intensely.<br/><br/><ul><li> Walk around and feel the atmosphere of our rooms, full of stories and songs<br/></li><li> Search in the interface for news, catalog, interviews, biography, etc.<br/></li><li> Meet your friends to enjoy a concert and share the experience.<br/></li><li> Meet new artists and become a fan<br/></li><li>Easy to master, in seconds you will be part of the Singulive World<br/></li><li> Enjoy artists of all styles<br/></li><li> Concert venues will never be far away again<br/></li><li> Join Singulive's social networks to live the full experience every day of your life.</li></ul>", "metacritic": null, "released": "2021-08-13", "tba": false, "updated": "2021-08-16T02:25:33", "background_image": "https://media.rawg.io/media/screenshots/70d/70d5da377df8b4662f834b74e5b4d86d.jpg", "website": "https://www.singulive.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 221, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Singulive"], "genres": ["Casual"], "publishers": ["Singulive"], "esrb_rating": null}