{"id": 649023, "slug": "xi-hu-duan-qiao-bai-niang-zi", "name": "西湖断桥白娘子", "name_original": "西湖断桥白娘子", "description": "\n<br/>\r\nAs a large online online online game, white lady of the bridge broken in West Lake is not ready to open any recharge. So games tend to be more team-based and social.<br/>\n<br/>\r\nGame features<br/>\n<br/>\r\n*Different sects<br/>\n<br/>\r\nThe selection of the corresponding school will affect the growth of your own attributes and the positioning of the battle in the whole game.<br/>\n<br/>\r\n*Match your own lineup<br/>\n<br/>\r\nPlayers can adjust the formation and lineup to deal with different levels and competitions. You can make yourself stronger by improving your level, cultivating skills and building equipment. Any group in the game may improve your combat power and expect the players to explore and explore.<br/>\n<br/>\r\n*A variety of ways to play<br/>\n<br/>\r\nThe total number of games is more than 30 kinds of play. Besides the daily play methods, we also add some limited time play and periodic play to increase the fun and exploration of the game. And each play has a relatively good output, so that players can play every day to play different and interesting patterns.<br/>\n<br/>\r\n*Rich task lines<br/>\n<br/>\r\nThere are not only main line tasks, but also regional tasks and special tasks. In order to assist the players to understand, there are corresponding guidance tasks when players unlock new functions. You will get a lot of rewards for completing all tasks.<br/>\n<br/>\r\n*Create exclusive partners and pets<br/>\n<br/>\r\nIn addition to some basic skills, players can adjust the way and skills of partners and pets according to their own needs. There are rich skill systems in the game for players to choose from.<br/>\n<br/>\r\nCome and join our game, and win the fame in the school. Press the crowd in the arena! Hope the game can bring different surprises to all players!", "metacritic": null, "released": "2021-08-12", "tba": false, "updated": "2021-08-16T02:16:48", "background_image": "https://media.rawg.io/media/screenshots/b43/b437c8d97b0f6ff6d4bddf578305cc57.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 313, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["wuwukai studio"], "genres": ["Strategy", "Casual"], "publishers": ["wuwukai studio"], "esrb_rating": null}