{"id": 649002, "slug": "rogue-spirit-2", "name": "Rogue Spirit", "name_original": "Rogue Spirit", "description": "<p>Reality and the spirit world are now intertwined: defeat the armies of Chaos to save the people of the Kingdom of Midra from demonic invaders.</p>\n<p>Rogue Spirit is a 3D rogue-lite action game with light stealth elements. Play as the Ghost of the Prince of the Kingdom of Midra, possess enemy characters and absorb their unique skills to fight the evil presence that has corrupted your land.</p>\n<p>Features:<br />\n• Action game with stealth elements in a rogue-lite game loop<br />\n• Play as the steadfast Ghost of the Prince of Midra<br />\n• Possess the enemies you fight with and absorb their combat features to go on in the battle at your best<br />\n• Master different characters&#39; playstyles, improve your skills, and adapt to an ever-changing world<br />\n• Explore the wonderful Kingdom of Midra and learn its legends and lore<br />\n• 20 characters with different abilities, weapons and playstyles<br />\n• 10 procedurally-generated levels set in 5 different biomes<br />\n• Dozens of essences and skills to make each run different<br />\n• Unlock permanent upgrades between runs<br />\n• Secrets and bosses are waiting for you<br />\n• 3D graphics inspired by traditional Asian designs</p>\n<p>Play as the Ghost of the Prince of the Kingdom of Midra and explore your land.</p>\n<p>Possess enemy characters to absorb their unique skills and adapt your combat style to different circumstances.</p>\n<p>Free your Kingdom by fighting the evil presence that has corrupted your home.</p>\n<p>Introduction to the Rogue Spirit world:</p>\n<p>For thousands of years, the people of the Kingdom of Midra lived in relative harmony and peace. From generation to generation, the oldest of tales were told over and over again. The stories told of the great Chaos: A Demon King who was sealed away by a hero of long-forgotten ages. Over time, the residents of the land turned the tale into a legend, then a myth, until it was all but forgotten.</p>\n<p>Days passed by in this peaceful slumber. The denizens&#39; obliviousness to their own terrifying past weakened the chains of the prison containing the Demon King, until one day they finally broke. The Chaos awakened and the horrifying nightmares of the forgotten past came back to life. He was once more known to every inhabitant of the land – child, adult and elderly alike. He sowed fear in the hearts of the brave, as an inevitable war came along with him. Those who could fight did, and fell. Those who were not strong enough to fight were possessed by demonic energy. The Chaos left no warrior&#39;s body alone and absorbed it into his army. Leaving no hostages behind, he incorporated inhabitants across all social classes and sorts, from lowly beggars to the noblest lords. His power grew to be so unimaginable that no mortal could stand against it.</p>\n<p>As a final resort, the Last Ones, monks of the Forgotten Monastery who still have a memory of what once happened, performed the ritual of summoning to bring back from the spirit world our Hero who sealed away the Chaos in the distant past.</p>\n<p>You play as the Ghost, the summoned Spirit of the Prince of the Kingdom of Midra, wandering your land. Passing through your kingdom&#39;s villages, forests and marshes, you&#39;ll have to defeat and possess your foes to acquire their skills and adapt your combat style to different circumstances. Each defeated enemy is an opportunity for a body with better chance of survival.</p>", "metacritic": null, "released": "2021-09-01", "tba": false, "updated": "2023-09-13T13:01:55", "background_image": "https://media.rawg.io/media/screenshots/53d/53dc8bcbe1bd2723733b91e911ea43df.jpg", "website": "http://www.roguespiritgame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 17, "beaten": 1, "toplay": 10, "dropped": 1}, "playtime": 3, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 391, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["Kids With Sticks"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["505 Games"], "esrb_rating": null}