{"id": 649088, "slug": "nova-island", "name": "Nova Island", "name_original": "Nova Island", "description": "On Nova Island, experience 1v1 card battles like you never have before!<br/><br/>No matter what you’re looking for, Nova Island has the gameplay experience for you! Take on one of many single player challenges or jump right into a competitive PvP mode and climb the leaderboards.  Nova Island is FREE TO PLAY and FREE TO WIN!<br/><br/>Battle for territory on the most uniquely energetic game board imaginable! Collect Floral, Energy, Moxie, and Boom cards; then mix &amp; match to create your own personalized decks. Play cards to gain strength, deal damage, or disrupt your opponent in a way they’ll never see coming.  Choose from a variety of Pros to strategically take advantage of the overwhelming Superpowers they bring to battle. <br/><br/>There’s no time to waste in pursuit of the most precious resource ever known...NOVAS. Become a Nova Researcher – download and play today!<br/><br/><br/>Features:<br/><br/>- CLIMB THE LEADERBOARDS - Battle against players from around the world in real-time 1v1 matches<br/><br/>- DAILY CHALLENGES – Earn rewards by playing wild challenges with a new way to play every day<br/><br/>- GO ON THE ISLAND RUN – Topple a series of Trainers in this single-player mode to win the grand prize<br/><br/>- BUILD YOUR COLLECTION – Discover and unlock your favorite cards using Novas you collect by playing the game<br/><br/>- CREATE DECKS – Develop unique strategies of your very own while mixing &amp; matching cards of different types<br/><br/>- CHOOSE YOUR PRO – With Max, Flora, Dr. Boom &amp; Jack, learn new playstyles and play them all<br/><br/>- FREE TO WIN – All cards &amp; Pros are unlocked with Novas - NEVER with real money<br/><br/>- WATCH &amp; CHEER – Spectate matches to learn from other players or just to enjoy the fireworks!<br/><br/>- CHANGE THE GAME – Become part of a vibrant community that will guide the future of Nova Island", "metacritic": null, "released": "2021-08-05", "tba": false, "updated": "2021-08-16T03:03:07", "background_image": "https://media.rawg.io/media/screenshots/3e5/3e5ce9067fcc9d01d9f8783c9ce5838c.jpg", "website": "https://novaisland.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 194, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Thirteen Games"], "genres": ["Strategy", "Card"], "publishers": ["Thirteen Games"], "esrb_rating": "Everyone 10+"}