{"id": 649044, "slug": "demons-residence", "name": "Demon's Residence", "name_original": "Demon's Residence", "description": "You've been called in to value the residence before it gets put on sale. From what you've heard the residence is built in the 1800's but it has seen a lot of renovation during the years. You accepted the job and are on your way to the old and quiet countryside. The old lady that requested your valuation Is living in another country and hinted you where the front door key is located..<br/><br/><br/><br/><strong>Explore</strong> the mysterious residence of the countryside, <strong>find and collect</strong> items and keys to unlock all the areas of the house. <strong>Complete puzzles</strong> to unlock secret areas. Make your path through the old house by using vents and other clever methods. The game is also filled with more <strong>horror elements &amp; easter eggs</strong>. Sometimes it's better to keep quiet just in case someone is listening. Expected <strong>game length</strong> is ~2 hours depending on the player.<br/><br/><br/> <ul><li><strong>Enemy AI</strong><br/>The mysterious creatures have randomized patterns and they are ready to catch you. You can hide or you can fight.<br/><br/></li><li><strong>Fully customizable settings </strong><br/>The settings menu is full of stuff for you to change. Amazing or awful pc, the graphic settings have you. Settings also let you configure all the keybinds for keyboard &amp; controllers.<br/><br/></li><li><strong>Full controller support</strong><br/>This game includes<strong> Full</strong> controller support. You can play the game from the beginning to the end without having to touch your keyboard. Includes Xbox &amp; PlayStation controllers of all generations.<br/><br/></li><li><strong>Saving system</strong><br/>The game has full flexible saving system, save and load anywhere and continue when you have time to play the game again. Game also includes auto saves frequently.</li></ul>", "metacritic": null, "released": "2021-08-13", "tba": false, "updated": "2021-08-16T02:30:41", "background_image": "https://media.rawg.io/media/screenshots/fed/fedd4c4006704f53cc802ed7da31423d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 287, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Morning Shift Studios"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Morning Shift Studios"], "esrb_rating": null}