{"id": 649093, "slug": "first-refuge-z", "name": "First Refuge: Z", "name_original": "First Refuge: Z", "description": "Do you have what it takes to rule the wasteland?<br/><br/>Humanity has been brought to the edge of extinction by a deadly zombie virus. The desperate actions of survivors are futile in the face of treacherous bandits, fierce zombies, and sinister corporations that roam this wasteland, all contending for supremacy. It’s your job to take command of a group of survivors and build an underground fortress. It’s time to battle the zombie invasion and fight against players from all over the world. The fate of humanity rests on your shoulders.<br/><br/>FEATURES<br/><br/>-Build your own unique Underground Fortress! You have the freedom to develop and enhance your base however you wish!<br/>-The first chapter of the apocalypse starts here! Command your troops to conquer the wasteland and save humanity.<br/>-Take survivors under your wing! Assign jobs to the right people or just banish them into the wasteland. Their lives are in your hands.<br/>-Enlist Legendary Heroes! Choose from a diverse array of heroes who will help you conquer the wasteland.<br/>-Strength in numbers! Team up with other players and fight alongside each other. Taking out enemies is easier when you have back up!<br/>-Survival of the fittest! Form alliances with other players and battle the zombie hordes or just conquer the entire wasteland. It's up to you!<br/>-Multiplayer battles! Even the toughest captains need others to watch their back - enemies will forever be after your head!<br/>-Take Command! The Underground Fortress is under your control. Expand and develop it. Make it the envy of the Wasteland!<br/>-Join countless players worldwide! Players of all languages and cultures competing to rule the wasteland. You can write the final chapter of history.<br/><br/>Follow our Facebook fan page for the latest info and upcoming events.<br/>https://www.facebook.com/FRZW.37Games<br/><br/>ATTENTION<br/>First Refuge: Z is a free-to-play mobile strategy game. This app offers in-app purchases. As required by 37Games Terms of Use and Privacy Policy, players must be over 12 years play.<br/><br/>HELP<br/>Need help?<br/>We provide first-rate support to help solve any in-game problems you have! You can reach our support team at any time, either by clicking on our in-game support button or via： global.support@37games.com<br/><br/>PRIVACY POLICY:<br/>https://gpassport.37games.com/center/servicePrivacy/privacy<br/><br/>TERMS OF USE:<br/>https://gpassport.37games.com/center/servicePrivacy/service", "metacritic": null, "released": "2021-08-11", "tba": false, "updated": "2021-08-16T03:05:59", "background_image": "https://media.rawg.io/media/screenshots/72f/72f74bcb8d4a7f55c572f96079d48ac8_KL2yU1V.jpg", "website": "https://www.facebook.com/FRZW.37Games", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 292, "game_series_count": 0, "reviews_count": 2, "platforms": ["iOS"], "developers": ["37GAMES"], "genres": ["RPG", "Strategy"], "publishers": ["G-MEI NETWORK TECHNOLOGY CO"], "esrb_rating": "Teen"}