{"id": 649105, "slug": "car-climb-4x4-offroad-drive", "name": "Car Climb 4x4 - Offroad drive", "name_original": "Car Climb 4x4 - Offroad drive", "description": "Welcome to Car Climb 4x4<br/>Do you like drive cars?  Do you like climbing games? Do you want to climb Mount Everest by racing cars the mountain through the rugged and challenging mountain roads..<br/>If you are a lover of speed, like the thrills of racing and like to conquer difficulties when climbing, you cannot miss this mountain racing game.<br/>Your task is to control a climbing car, jumping from hill to hill on the steep, bumpy roads. Overcoming obstacles on the mountain road to climb Mount Everest fastest and become the winner.<br/>You have complete control of the car in the race when climbing mountains and hills. Please control the car very cleverly so as not to fall off a cliff, avoid rocks so as not to be crushed. The task is becoming more and more difficult and interesting. The levels will have a fixed time.<br/>The game has 105 levels with increasing levels of difficulty. The more you play the more you will be attracted ..<br/>HOW TO PLAY: <br/>+ The game has 3 different control modes. Choose a control mode that suits you best<br/>-        Control by steering wheel<br/>-        Control by tilting the phone<br/>-        Control with the left and right buttons<br/>+ Press the accelerator pedal to move forward.<br/>+ Press brake pedal to stop. Hold the brake button to go backward.<br/>+ Collect lots of coins on the track to change new cars.<br/>+ Eating bottle nitro on the track to speed faster.<br/>+ Eat time items to increase time.<br/>FEATURE:<br/>+ Stunning 3D graphics<br/>+ Addictive game with lots of fun<br/>+ Real car sound effects.<br/>+ Control car handling realistic and smooth ..<br/>+ Attractive addictive game<br/>+ Difficult task<br/>+ Enhance nitro to speed up crazy acrobatics.<br/>Be the best and the fastest racer.<br/>Download the free game NOW !. Enjoy the game and rate us!", "metacritic": null, "released": "2021-08-04", "tba": false, "updated": "2021-08-16T03:13:43", "background_image": "https://media.rawg.io/media/screenshots/b18/b18f1a9d963dbe1234156dba97c444b0_38iEGhm.jpg", "website": "https://remygames.netlify.app/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 95, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Remy Studio"], "genres": ["Simulation", "Racing"], "publishers": ["THAI HOA TECHNOLOGY AND MEDIA SOLUTION JOINT STOCK COMPANY"], "esrb_rating": "Everyone 10+"}