{"id": 649117, "slug": "old-friends-dog-game", "name": "Old Friends Dog Game", "name_original": "Old Friends Dog Game", "description": "Welcome to Old Friends Dog Game, where love never grows old! A story game about friendship for people who love dogs. Made in collaboration with the real Old Friends Senior Dog Sanctuary.<br/> <br/>In this beautiful studio ghibli inspired game, you create your own dog sanctuary - nurture and care for adorable senior dogs by baking treats, petting and playing with them. As each dog’s loyalty toward you grows, unlock story episodes with choices and learn more about the dogs’ loveable personalities.<br/> <br/>This dog game is inspired by the famous organisation, Old Friends Senior Dog Sanctuary, where a real life team of dog-loving heroes care for and love senior dogs. Each of the beautiful characters you meet is based on a wonderful resident from the real-life sanctuary.<br/> <br/>Gameplay<br/>● Take care of senior dogs - rescue and care for cute old doggos and spend your days loving them and growing their loyalty toward you. Become an animal care expert as you pet, feed and nurture your residents.  <br/>● Choose your story - make choices as you unlock each narrative episode. As your dog's loyalty grows, you will unlock new narrative chapters! Enjoy adorable story episodes as you unlock chapter after chapter in this wholesome narrative game. <br/>● Decorate your sanctuary home - decorate indoors and outdoors with cute furniture and toys that your residents will love. <br/>● Baking delicious treats - use your kitchen to get baking tasty treats for your pets, to earn more loyalty and unlock new story episodes!<br/>● Dress up your residents in their own cute outfits! Each dog has adorable accessories, which you earn as rewards in the narrative episodes.<br/>● This game is full of all kinds of dogs - big dogs, small dogs, dogs the size of a horse! There is a favourite dog for everyone.<br/>● Document your journey - make your very own sanctuary profile, complete with your custom avatar and full of cute snaps of your best doggy friends.<br/> <br/>If you love story games and dogs, we made this game for you! Every animal deserves to be loved, whether they are an old senior or a young puppy. We hope you love spending time in your very own dog sanctuary home, where love never grows old.<br/> <br/>***By award winning studio Runaway Play, with over 10 million downloads of wholesome games, including Furistas Cat Cafe, Splash: Ocean Sanctuary, Flutter: Butterfly Sanctuary and Flutter: Starlight***<br/> <br/>This game is free to play but does contain some items to purchase for real money. If you run into any issues while playing or you have any suggestions, please reach out to us at support@runawayplay.com. OLD FRIENDS DOG SANCTUARY™ is made by Runaway Play.", "metacritic": null, "released": "2021-08-08", "tba": false, "updated": "2021-08-16T03:19:50", "background_image": "https://media.rawg.io/media/screenshots/683/683de5f4b390ced38560de5debfeb932.jpg", "website": "http://www.runawayplay.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 214, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Runaway"], "genres": ["Simulation", "Casual"], "publishers": ["Runaway Play"], "esrb_rating": "Everyone 10+"}