{"id": 649365, "slug": "sunrise-on-the-moon", "name": "Sunrise on the Moon", "name_original": "Sunrise on the Moon", "description": "<p>On the moon, consecutive sunrises and sunsets occur approximately 29 1/2 days apart. For as long as Maria has lived in the Lunar Colonies, she's never failed in her tradition to watch the sunrises from the station's viewing platform. As she's waiting for her tram to arrive, however, she encounters a curious young woman that piques her interest. For once, Maria feels compelled to engage in a friendly conversation.</p>\r\nMaria\r\n<p>   </p>\n<p>Maria is a strong-willed and hard-headed woman with many years and experiences under her belt. She's also perhaps a bit too intelligent for her own good, as she often has difficultly not letting her pedantic nature take over. </p>\n<p>She jokes about her own age, but doesn't take kindly to others doing the same.</p>\n<p>As per tradition, she plans to head to the viewing platform to watch the sunrise.</p>\r\nAeda\r\n\r\nAeda is a cute, enigmatic girl that Maria meets as she is waiting for her tram to arrive. Normally Maria is not one for idle conversations with strangers, but something about this girl piques her interest.\r\n<p>Though ever-friendly, she also seems a bit airheaded.</p>\n\r\nContent Warning:\r\n<p>Mild swearing</p>\n<p>Flashing Lights</p>\n<p>Existentialism</p>\n\r\nCredits:\r\n<p>Made with Ren'Py<br/></p>\n<p>Music by Kevin MacLeod</p>\n<p>SFX by dmochas</p>\n<p>Special thanks to my editors, bug testers, proofreaders, and moral support Hollowmend and Brittany. </p>\n<p>I couldn't have done it without you!</p>", "metacritic": null, "released": "2021-08-15", "tba": false, "updated": "2021-08-16T04:29:46", "background_image": "https://media.rawg.io/media/screenshots/bc3/bc3e610b4b6911d641b622905713396e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 98, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Brii-Nanas"], "genres": [], "publishers": [], "esrb_rating": null}