{"id": 649413, "slug": "spaceshape", "name": "Spaceshape", "name_original": "Spaceshape", "description": "<p>This is the first game I've made, it's a spaceshooter for PC. It was made in Unity as a school project. </p>\n<p><strong>Tutorial:</strong><br/></p>\n<p>You play as a blue spaceship and rotate it with your mouse towards enemies, your spaceship will always be in the middle only being able to rotate and shoot. You shoot the pink spaceships with a circle, triangle or square, only one is correct for every enemy, you can <strong>not</strong> shoot with a bullet that has the same shape or color as your enemy. If you shoot with one of the wrong shapes your enemy will survive and you can try again with a different bullet.  You shoot by pressing 1, 2 or 3. Every shot makes your enemies travel slightly faster towards you, when one of the pink spaceships collides with you it's Game Over.</p>\n<p><strong>Scores:</strong></p>\n<p><strong>Shots fired</strong> is how many bullets you have shot, you get 100 <strong>pre-score</strong> points for every enemy you destroy, <strong>accuracy</strong> is how often your bullets have destroyed your enemies. When it's Game Over you get a <strong>Final Score</strong> which is calculated with your <strong>pre-score</strong> times your <strong>accuracy</strong>. <strong>Best Score</strong> is your best <strong>Final Score</strong>. You can also see how many seconds has passed in your current round and your longest round with the <strong>Time</strong> in the bottom right corner. </p>\n<p><strong>Summary:</strong></p>\n<p>Rotate your spaceship towards your enemies and shoot the correct bullet. Be accurate so you get the most points and so your enemies stay as slow as possible so you can survive the longest.</p>\n<p><strong>Don't be afraid to post your record, I'm more than happy to see how you do and who will be the best:</strong><br/></p>\n<p>Tell me your best result and post a video of your best round if you feel like it, I'm interested to see how many points are possible. </p>\n<p>My personal record so far is 23 377 points (Final Score) and in that round I survived for 10 minutes and 6 seconds.</p>\n<p><strong>Tell me what you think:</strong><br/></p>\n<p>I enjoyed working on this game, I took my first steps in coding, and made my first game, coding was interesting and became a little hobby. Creating this game was fun and I like the result. I hope you like it too, and I wish you'll be having a great time playing my game. Tell me about your experince playing the game, what you think and so on, is it easy or hard, what are your thoughts?</p>", "metacritic": null, "released": "2021-08-15", "tba": false, "updated": "2021-08-16T04:40:30", "background_image": "https://media.rawg.io/media/screenshots/746/746897c782f2f48ea0e374b78f988dcf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 59, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["THurisaz"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}