{"id": 649411, "slug": "imperio-cobra-vr-oculus", "name": "Imperio Cobra VR (Oculus)", "name_original": "Imperio Cobra VR (Oculus)", "description": "<p>¿Quién no recuerda esas tardes ochenteras jugando a juegos de mesa como el famosísimo \"En busca del Imperio Cobra\"? He querido rendir un homenaje a dicho juego realizando un fan art para dispositivos Oculus de Realidad Virtual.\r\n  </p>\n<p>No se trata de un videojuego sino de un simulador de la realidad, es decir, una reproducción virtual del juego y sus piezas de tal forma que como sucede en la realidad no es el programa el que controla el juego, el movimiento de fichas etc… sino los propios jugadores. De hecho se puede hacer trampas como en la realidad o inventar un nuevo juego con nuevas reglas.\r\n  </p>\n<p>Sin embargo me encontré con dos problemas a la hora de reproducir la realidad. Una fue el barajeo de las cartas. Debido a las limitaciones del software y hardware actual la tarea aunque posible es sumamente fastidiosa así que no me quedó más remedio que implementar el barajeado automático de las cartas. El otro era lo que le sucedía a los objetos cuando se caían de la mesa. Mis Oculus no permiten llegar hasta ese nivel para recoger objetos pequeños y se perdían irremediablemente así que vuelven a la mesa en cuanto tocan el suelo “de forma mágica”.\r\n  </p>\n<p>A veces la experiencia de manejar objetos pequeños en Realidad Virtual es frustrante. Esto cambiará en el futuro, espero. Pero con un poco de práctica todo se logra.\r\n  </p>\n<p>El juego estaba proyectado para ser multijugador desde un principio pero disponiendo tan sólo de unas gafas de VR me resulta imposible seguir avanzando en el desarrollo multijugador así que he creado dos versiones: una final (salvo bugs) individual llamada ImperioCobraOne y otra en desarrollo a la espera de encontrar testers que me echen una mano llamada ImperioCobraMulti_Beta.</p>", "metacritic": null, "released": "2021-08-15", "tba": false, "updated": "2021-08-16T04:40:02", "background_image": "https://media.rawg.io/media/screenshots/5d8/5d8568d43154df09ffef169077b094c7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 332, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["wopper"], "genres": ["RPG", "Simulation"], "publishers": [], "esrb_rating": null}