{"id": 64941, "slug": "draw-near", "name": "Draw Near", "name_original": "Draw Near", "description": "<strong>You can play this game even if you do not have a VR headset. </strong><br/>It is divided into \"non-VR main story mode\" and \"VR dedicated battle mode\".<br/><br/><strong>\"VR dedicated battle mode\" is just a bonus content. Do not expect too much because it is incomplete.</strong>●StoryHuge meteorites suddenly collided with your spaceship and your ship is drifting in the outer space.<br/>Let's take various actions and survive in the lonely universe!●GenreSpace survival simulation / action●Docking to drifting shipsLet's dock to ships drifting in outer space, explore inside, fight enemies and collect resources and items.<br/>You can choose the drifting ship you dock to by yourself.●Expand spaceship freely Let's expand your spaceship freely by using the brought back resources and items.<br/>By constructing new facilities, things that can be done will increase.●Self-sufficiencySelf-sufficiency is important, such as operating thermal power generators and nuclear power generators, planting crops in fields and harvesting.<br/>Let's take care of food.●Item craftYou can craft new items by combining items you have.<br/>Crafts require exclusive facilities and machinery, and in some cases electricity, water, oxygen and chemicals are necessary.●Rescue companionsLet 's ride a Planet Exploration Boat and rescue companions who crashed by the collision of the meteorite.<br/>Various merits will arise if you help your companions.●VR dedicated battle modeVR dedicated battle mode is not related to main story.<br/>Let's defeat the enemy and aim for high score! Score will be deducted if you take damage.●Multiplatform supportWindows, Android, iOS supported. <br/>By using the built-in data synchronization function, you can share data with multiple devices.●DeveloperThe group of two self-taught high school students created this game.<br/>From planning to release, it took about a year of time to complete.DonationIf you are satisfied with this game, please support us by purchasing this donation DLC.<br/>http://store.steampowered.com/app/832950/Draw_Near__Donation/", "metacritic": null, "released": "2018-04-15", "tba": false, "updated": "2019-08-28T21:54:48", "background_image": "https://media.rawg.io/media/screenshots/083/0837717d5acae9e7590fcef147f60d0f.jpg", "website": "http://omniscience.hateblo.jp/entry/DrawNear", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 104}, "playtime": 1, "achievements_count": 12, "ratings_count": 1, "suggestions_count": 429, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Omniscience"], "genres": ["Action", "Adventure", "Simulation", "Indie"], "publishers": ["Taiga Nishimura"], "esrb_rating": null}