{"id": 64958, "slug": "geeste", "name": "Geeste", "name_original": "Geeste", "description": "Take on the role of the ultimate Ghost-Fighting robot \"Ghostatron 9000\" and eradicate every ghost in site, you are humanity's last hope. <br/>\n<br/>\r\nTaking inspiration from the coolest little yellow dot to grace arcade screens, Geeste brings a whole new spin to a classic gaming formula.<br/>\n<br/>\r\nGeeste is the Afrikaans word for \"Spirits\" and represents not only the overlaying eerie horror theme but also the level of skill and perseverance you will need in order to succeed in the game.<br/>\n<br/>\r\nIn true arcade fashion (and to amplify the Horror element), Geeste is also a survival game with no saves. Either play to get a high score and compete with your friends, see how many Rounds you can last or if you're brave see if you can be the 1st player who can make it past Round 20 and you might be able to claim your prize ;)<br/>\n<br/>\r\nFinally, to keep the game exciting and interesting, each round will add a new element or tweak an existing one.<br/>\n<br/>\r\nFeatures:<br/>\n<br/>\r\n- Fast-paced FPS Action<br/>\r\n- A Unique Aiming and Shooting style to accentuate the arcade speed<br/>\r\n- Arcade, Horror, Survival at its best<br/>\r\n- Compete for High Scores<br/>\r\n- A Prize at the end for the 1st player to reach round 20<br/>\r\n- Each round a new element is added or tweaked to keep it fresh.<br/>\r\n- 20 Rounds of pure CARNAGE!!!<br/>\r\n- COMING SOON: Leaderboards<br/>\n<br/>\r\nPlanned DLC, with your help:<br/>\n<br/>\r\n- The best $1 Multiplayer add-on ever!<br/>\r\n- If we can get enough sales we would love to add more Rounds and Prizes to win via cheap, small DLCs.<br/>\r\n- With all of you behind us, we can expand Geeste into something really special", "metacritic": null, "released": "2018-04-18", "tba": false, "updated": "2019-08-28T21:54:47", "background_image": "https://media.rawg.io/media/screenshots/5a9/5a91ede8866afcc7bd182d6d168e9940.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 7}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 204, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Skobbejak Games"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Skobbejak Games"], "esrb_rating": null}