{"id": 649596, "slug": "pawsecuted", "name": "Pawsecuted", "name_original": "Pawsecuted", "description": "<h3>Features</h3><br/><strong>Explore </strong><br/>A different world each time with dynamically spawned quests and encounters.<br/><br/><br/><br/><strong>Scavenge </strong><br/>The world was left devastated after the Great Mammal War. Search through the ruins of the Furless in a post-apocalyptic world.<br/><br/><br/><br/><strong>Craft </strong><br/>Create the tools of survival and help rebuild the society of the Evolved.<br/><br/><br/><br/><strong>Recruit </strong><br/>Hire mercenaries and convince followers to populate your Outposts or join you in battle.<br/><br/><strong>Consistent Map Transition</strong> <br/>Time doesn't stop when you get into a fight. Long, drawn out battles will tire you out.<br/><br/><br/><br/><strong>Combat </strong><br/>Fight off venomous snakes, pistol-toting wallabies, and everything else trying to kill you. Or run away, that's fine too.<br/><br/><br/><br/><strong>Tactical Gameplay</strong> <br/>Time only moves when you do. Think and plan ahead to avoid death.<br/><strong>Day/Night Cycle</strong> <br/>Makes activities during the night more dangerous. Line of sight, travel/search speed affected.<br/><strong>Tag-Based Actions</strong> <br/>Extensive item tagging system that determines actions available to you. Anything with an Ignite tag can start a fire, anything with a Slice tag can make a sandwich.<br/><strong>Story or Sandbox</strong> <br/>Follow the main storyline to find out more about the world, or completely ignore it and wander the Outback.<br/><strong>Branching Quests</strong> <br/>Multiple ways to complete quests. Bribe a dog, complete a fetch quest or beat him up to get answers.<br/><strong>Difficulty </strong><br/>The world becomes more dangerous the further out you travel. You decide when you're ready.<br/><strong>Moddability </strong><br/>Data-driven design allows modders to create their own questlines, enemies, equipment, items and more.<br/><br/><h3>Lore/Backstory</h3>Pawsecuted exists in an alternate timeline that diverges from ours after the first cloning of sheep in 1984. This breakthrough led to huge advances in gene editing technology, and created a world with zero ethical restrictions on modifying DNA of non-human mammals.<br/><br/>There was massive demand from people who wanted pets with humanlike qualities. Even wild animals were being modified to become suitable as household companions. By the mid-2010's, consumers could conveniently purchase gene mods giving their pets abilities such as speech, upright movement and even higher intelligence. Almost every household had multiple pets, modded for everything from entertaining children to construction work.<br/><br/>In the 2020's, mammals started demanding equal rights to humans. Their demand was simple - nobody 'owns' anybody else, all mammals are free to choose their own destiny. Humanity pushed back, and the Great Mammal War for independence began. War lasted for over a decade and the world was left devastated. By the 2050's, the humans had all but been annihilated and forgotten. The only reminders of their rule are the ruined cities, towns and villages left behind.<br/><br/>Your story begins in the distant aftermath of this war. You are a life-long convict in a work camp run by a zealous Koala. This is all you've ever known and all you expected to ever know. Until one day...", "metacritic": null, "released": "2021-08-15", "tba": false, "updated": "2022-11-04T04:45:47", "background_image": "https://media.rawg.io/media/screenshots/014/01482fcb52dfc5387de2801508eea0d6.jpg", "website": "https://pokingwatergames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 132, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Poking Water Games", "PokingWaterGames"], "genres": ["RPG", "Strategy"], "publishers": ["Poking Water Games"], "esrb_rating": null}