{"id": 64957, "slug": "ash-2", "name": "A.S.H.", "name_original": "A.S.H.", "description": "<strong>2. Features</strong><br/>a. Slasher/Platformer with RPG elements<br/>b. Medieval fantasy<br/>c. Unique enemies<br/>d. Wide range of weapons<br/>e. Detailed animation<br/>f. Many well-developed levels<br/>g. Interesting and intriguing plot with global events<br/>h. Original and immersive combat system<br/>i. User-friendly UI<br/>j. Pleasant and immersive graphics<br/>k. Great OSTs<br/><br/><br/> <strong>a. Battle system</strong>The in-game battle system is well-thought, rich and easy to learn. It is a fighting/slasher mix. Prepare to show you skill by parring and hitting in three directions, making crushing combos, bouncing and rolling from unblockable attacks of large creatures.<strong>b. Lvl up</strong>Kill enemies to lvl up. When reaching lvl up, you get points that can be spent to increase your health, stamina or strength. With every lvl up you unlock deadlier combos and weapons.<br/><br/><br/><br/><strong>c. Equipment</strong>Loot enemies, chests and hidden places to find potions and equipment parts, such as armor, weapons and runes. <br/><br/><br/><br/>There are more than 40 weapons divided into two types – cutting and blunt. Swords and axes deal more damage to enemies from flesh, like zombies, gnomes, ghouls, minotaurs, etc. Hammers and maces are more effective against skeletons, stone golems, panzer spiders and mechanic creatures. Legendary weapons have special super attacks. <br/><br/><br/><br/>Hroft uses runes to upgrade weapon’s battle states. When a rune is filled with energy, a weapon gains super abilities, for example, to cut few enemies in a row or to freeze them. <br/><br/>https://www.youtube.com/watch?v=4UNrqWY2VgQ<strong>d. Co-op</strong>We plan to add rank 1v1 battles for the most powerful and skilled warriors. <br/>There will also be interesting quests. Go into different dungeons, castles and abandoned villages. Man, there is even Hell with few bosses eager to kick your ass.<br/><br/><strong> </strong><br/>Hroft is the savior hunter, who fights evil and dangerous creatures from other worlds. Whilst traveling, he found traces of Chaos creatures that lurk in the hidden Portal between worlds – The Shadow Path. He started fighting them, but it was a trap.<br/><br/>https://www.youtube.com/watch?v=928zuJfkFfw&amp;t=3s<br/><br/>The Portal started to shine in a distance. The only way to survive. It teleported him to Anvilor, but Hroft lost his memory. <br/><br/>Hroft heard hundreds of souls begging for help. They summoned him to a burnt village. The place was somewhat familiar. He sensed presence of the Three Dark Forces. <br/><br/>The villagers were guarding the Tear of the One-Who-Must-Not-Be-Named. The Soul Amulet of this world was stolen. Hroft understood that the souls were screaming from that exact Crystal.  <br/><br/>You have to find out, who is Hroft, what Forces seized the Soul Amulet. Demons? Chaos spawns? Why is it so important to save Anvilor?<br/><br/><br/><br/><br/>Every note resembles the Hero’s feelings. During fights, it rushes your blood. It also underlines fantasy atmosphere, the world’s tragedy and key plot moments.<br/><br/><br/> <br/><br/>When travelling through cold and snowy North Wasteland of Anvilor, you will fight undead to get into dungeons. There you will meet the cursed gnomes that are inventive and furious warriors. The path, filled with deadly traps, leads to forest thicket where lives the self-proclaimed Queen of Necromancers. <br/><br/><br/><br/>You will also meet different allies that help if you can negotiate. <br/><br/><br/><br/>The world is cruel and against you, but it does not revolve around you. Anvilor inhabitants fight with each other. For example, necromancers fight with demons, gnomes with underground creatures, gigantic golems fight each other. <br/><br/><strong>7. About me</strong><br/>My name is Denis Listnov, I am 28. I am an ordinary rural guy that wants to develop a game. I had to learn programming and animation to understand the development workflow. I read articles of successful game makers to learn something from them. <br/><br/>For two years of development process new ideas kept appearing in my head. I was searching for freelancers to help with the technical part of the game. I took a loan to pay for their work. I want to thank everyone of those enthusiasts that helped me make my dream come true. <br/><br/>https://www.youtube.com/watch?v=bNdOrnH6k3I<br/><br/>During the development process, I become more experienced and my ambitions and thirst to complete this project are even higher. There were a lot of mistakes, but only by solving them the game gets better and better. The project was rebooted three times (I still have a prototype of the previous versions). Right now I understand what my game should look like. <br/><br/>One of the main goals is to think outside the box and bring the uniqueness that makes players come back.<strong>8. Animation</strong>We need a lot of animations for the battle system. I use motion capture for this purpose.  <br/><br/><br/><br/><br/><br/><br/><br/>For the time being, there are 200 made animations, but there are more to come. We strive to make animations as lively as we can.  <br/>I sold my car to make animations.<strong>9. Inspirations</strong>I was thrilled by books, written by Robert Salvatore and Nick Perumov. The global events, the falls of entire empires, Gods’ overthrows, well-thought heroes’ motivations and intriguing plots fascinated me. These books and such games as Skyrim and Blade of Darkness were blending in my game as a unique story. And I want to share it with you. This is how it all started for Hroft, the savior hunter in the Anvilor.", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:54:47", "background_image": "https://media.rawg.io/media/screenshots/9c9/9c9df08ce1059fdf68e4afa2b1a1a0c4.jpg", "website": "http://ash-indie.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 425, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ONI studio"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["ONI studio"], "esrb_rating": null}