{"id": 649700, "slug": "battle-commander", "name": "Battle Commander", "name_original": "Battle Commander", "description": "<p>You are a Battle Command who has to deal with a broken system and is unable to get any work done. Maybe you'll be able to get IT to bring you a new system in a few days that actually works. If you're lucky...\r\n</p>\n<p>In the mean time, might as well learn a bit about the system.</p>\n\n<p>What was once going to be a strategic puzzle game inspired by the board game Battleship and Mindsweeper is now a game featuring a neat, elaborate, and extensive  button system design.</p>\n<p>Go ahead, select a Scout.<br/></p>\n<p>Now click and hold down your mouse button on the Command Grid. Yeah...</p>\n<p>Then slowly move your mouse away from the cell and watch as it turns from blinking shades of bright blue to a dark red!<br/></p>\n<p>\n<em>Oh, man... that's intense!</em><br/></p>\n<p>There's a few other cool things.<br/></p>\n<p>Place the scouts (yellow square on the right of the screen) on the map to see the few events I've programmed in.</p>\n<p><strong>Black screens</strong> with <strong>white text</strong> and a <strong>progress bar</strong>!</p>\n<p><em>What?!</em> I'm in!<br/></p>\n<p>Originally there was going to be a fog of war, but with so little to do, it would be rather boring to do anything, so I removed it.</p>\n<p><em>Oh, Yeah...</em><br/></p>\n<p>Even with it incomplete, I'm still proud of what I accomplished and am looking forward to see what I can do with this.</p>\n<p>Already have like a dozen more of those <strong>black screens</strong> with <strong>white text</strong> that'll disappear when you click on them but won't screw you over if you accidentally double click!</p>\n<p><em>Now that's progress...</em></p>\n<p>So check it out today!<br/></p>\n<p>\n</p>\n<p><strong>Oh!</strong><strong> One more thing.</strong></p>\n<p>If you want to play it at the official 64x64 pixel format, just resize the game.</p>\n<p>I paid some special attention to that too!</p>\n<p>:D<br/></p>", "metacritic": null, "released": "2021-08-14", "tba": false, "updated": "2021-08-16T05:56:47", "background_image": "https://media.rawg.io/media/screenshots/cf6/cf692f2a9e33279cab108cad8f1f9a69.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 27, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["akciom"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}