{"id": 649787, "slug": "micro-ninja-meteorwave", "name": "Micro Ninja (meteorwave)", "name_original": "Micro Ninja (meteorwave)", "description": "<p><strong>The year is 204X . . .</strong><br/></p>\n<p> Automation and robotics have changed the world.  Police have been replaced with Cop Bots.  An evil scientist named Dr Ravana has infected the Cop Bots with a computer virus. Now the bots are out of control and need to be stopped before they destroy the world!  </p>\n<p>Join our hero Fuma Hanzo , the Micro Ninja, as he jumps, runs, and shoots his way through a challenging level.  </p>\n<p><strong>Controls. . .</strong><br/></p>\n<p>Arrow Keys:  Movement</p>\n<p>Space Key:  Jump</p>\n<p>D Key:  Shoot</p>\n<p><strong>My First Game!</strong><br/></p>\n\r\nMicro Ninja needs power-ups to maintain energy throughout the level.  Once you lose all your HP, you're dead\r\n\n<p>Hi I'm Meteorwave, and this is my first game ever!  I decided to participate in the LOWREZJAM to give myself a due date, and keep myself motivated to finally finish a game.  The object of this  jam was to design a game that fits into a 64 x 64 space.  </p>\n<p><strong>I created all my own art assets, as well as my own original music! </strong></p>\n<p>I learned a ton doing this.  I'm more of an artist and a musician, but I'm currently learning programming.  I originally tried to build my game in Python but came across scaling issues that wouldn't uphold the requirements of the Jam.  So I chose GDevelop to complete my project.</p>\n<p>There's one thing I realized, if you have a concept for a game, it's not simple enough!  I was hoping to make a five level platformer, but I was only able to make one stage before the deadline.</p>\n<p>I ran out of time to continue to test the game,  so If you come across any bugs,  please feel free to share them with me!  I won't be offended.  I want to use this experience to learn and either continue making this game, or make a different one.</p>\n<p><strong>Ideas that didn't make it into the game:</strong><br/></p>\n<ul><li>Level checkpoints/respawn points (for now I have just placed large HP tanks frequently in the stage)</li><li>Player knockback while taking damage</li><li>Each level has an ending boss</li><li>In addition to the large HP power-up, I wanted a small power-up</li><li>Player has 3 lives.  I was only able to end the game after losing all your HP, could never figure out how to create player lives.  </li><li>More enemies</li><li>Better Enemy AI ( I'm happy I was able to make any AI, for my first game)</li><li>Death animation for the player </li><li>Multiple themed levels</li><li>And more!</li></ul>", "metacritic": null, "released": "2021-08-14", "tba": false, "updated": "2021-08-16T06:20:13", "background_image": "https://media.rawg.io/media/screenshots/355/3555b2c98f9a0cd6ff6ecd0efd69d390.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 77, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Web"], "developers": ["meteorwave"], "genres": ["Action", "Platformer"], "publishers": [], "esrb_rating": null}