{"id": 6498, "slug": "bloons-td-4", "name": "Bloons TD 4", "name_original": "Bloons TD 4", "description": "<p>Version 3.6 is now live featuring a brand new track and 2 new challenges.<br />\nUpdate history:<br />\n3.5 - Added Pool Party Map.<br />\n3.4 - Added 2 new Challenges.<br />\n3.3 - Added 2 new Challenges.<br />\n3.2 - Added Beehive Map, Extreme Challenges and Mystery Tower.<br />\n3.1 - Added 2 new Challenges.<br />\n3.0 - Added 2 new Challenges.<br />\n2.9 - Added Monkey Heart Map.<br />\n2.8 - Added 2 new Challenges and Jolly Roger Extreme Map.<br />\n2.7 - Added 2 new Maps, 2 new Challenges, Festive Towers and Double XP!<br />\n2.6 - Bug Fixes<br />\n2.5 - Added new tower Spike Factory<br />\n2.4 - Added Trick or Treat Map and Spooky Tower Surprise.<br />\n2.3 - Added 3 new Challenges with unique gameplay elements.<br />\n2.2 - Added Blue Laser Challenge and IAP Extreme Maps.<br />\n2.1 - Added Firecracker Map.<br />\n2.0 - Added Challenge Mode.<br />\n1.9 – Added Sweet Tooth Map<br />\n1.8 - Added new tower Dartling Gun.<br />\n1.7 - Added DNA Test Map.<br />\n1.6 - Added Deflation Mode.<br />\n1.5 - Added Spring themed Daisy Chain map and IAP for Special Upgrades.<br />\n1.4 - Added Apopalypse Mode.<br />\n1.3 - Added new Sun God Temple Map.<br />\nWe are continuously working hard to bring you a whole host of brand new content updates over the coming weeks so stay tuned.<br />\nYou&#39;ve been waiting patiently, thousands have requested it and finally it&#39;s here.....<br />\nNINJA KIWI&#39;S BLOONS® TD 4 HAS ARRIVED ON THE APP STORE!<br />\nThat&#39;s right the monkeys are back and this time there is a whole new army of bloons to burst. Featuring a whole host of new tower and enemy types, Bloons® TD 4 is the long awaited sequel to Bloons® TD iPhone.<br />\nThis time the monkeys are serious and are ready to take down the enemy from the land, air and sea. Utilising a new ranking system you can build up your experience and gain access to even more powerful towers and upgrades. Call in mortar strikes, deploy the monkey aces and  harness the power of banana farms as you bid to take down the enemy in true bloon popping fashion.<br />\nBloons® TD 4 iPhone features a mix of classic tracks from the online game as well as a whole host of new tracks for you to master. The medal ranking system is also back to add a new level of difficulty to the challenge. Can you battle through all 75 rounds to earn the gold medal?<br />\nOf course, even if you do, the fun doesn&#39;t stop there and you can continue the madness in freeplay mode. Discover how many rounds can you survive before the enemy overpowers you then challenge your friends to beat your score using Game Centre high scores.<br />\nBloons® TD 4 combines all of this with Game Centre achievements and there is even some special bonuses which you can discover and unlock by mastering the tracks!<br />\nFeatures:-<br />\n• All of your Bloons® TD 4 favourites, including the all powerful Sun God and Dartling Gun.<br />\n• 25 different tracks plus 5 Extreme Maps (available through IAP).<br />\n• Challenge Mode and all new Extreme Challenges.<br />\n• 3 difficulty settings on each map, Easy, Medium and Hard for varying degrees of challenge.<br />\n• Continue the popping frenzy in freeplay mode once you master a track.<br />\n• Game Centre high score tables and achievements.<br />\n• Special bonus unlocks.<br />\n• Now includes Apopalypse and Deflation modes.</p>", "metacritic": null, "released": "2010-12-07", "tba": false, "updated": "2023-03-09T20:26:31", "background_image": "https://media.rawg.io/media/screenshots/926/9260f62149f42ec0499980bdb9d3a0bf.jpg", "website": "http://ninjakiwi.com", "rating": 3.71, "rating_top": 4, "added_by_status": {"yet": 2, "owned": 2, "beaten": 3, "toplay": 1, "dropped": 8}, "playtime": 0, "achievements_count": 0, "ratings_count": 7, "suggestions_count": 201, "game_series_count": 5, "reviews_count": 7, "platforms": ["Nintendo DS", "PC", "iOS", "Android"], "developers": ["Ninja Kiwi"], "genres": ["Strategy", "Arcade", "Casual"], "publishers": ["Kaiparasoft", "Digital Goldfish"], "esrb_rating": null}