{"id": 649891, "slug": "running-on-empty-tfancs", "name": "Running On Empty (T.F.A.N.C.S.)", "name_original": "Running On Empty (T.F.A.N.C.S.)", "description": "<p>Running On Empty is a post-apocalyptic resource management/survival RPG, with 64x64 resolution, made for LOWREZJAM 2021 in 2 weeks</p>\n<p>-You are a porter and you have to deliver the package to the destination safely</p>\n<p>Controls<br/>Space - Open Menu<br/>1~9 - Select Options<br/>Enter - Confirm<br/>Esc - Cancel<br/>Arrow keys/WASD - Move cursor<br/>O/P - Adjust Music Volume<br/>K/L - Adjust SFX Volume</p>\n<p> In combat<br/>Enter - Fire/Throw<br/>Up arrow key/W - Aim<br/>Down arrow key/S - Duck<br/>Space - Open Menu</p>\r\n\r\n  Stats (Click to show)\r\n<p>Health - Your health<br/>Armor - Armor of your vehicle<br/>Clothes - Condition of your clothes. It reduces your damage. You'll catch a cold if it's too low. </p>\r\n\r\n\r\n  Items (Click to show)\r\n<p>Bobby Pins - Used to pick locks<br/>Stimulants - Heal your health. Can be used in combat<br/>Medkits - Heal your health greatly. Cannot be used in combat<br/>Antibiotics - Cure infections<br/>Repair Kits - Repair your vehicle's armor<br/>Flashbangs - Used to stun enemies to run away in combat<br/>Spare Clothes - Used to change clothes<br/>Fuel Tanks - Used to refuel your vehicle</p>\r\n\r\n\r\nSkills (Click to show)\r\n<p>Guns - affects your aim accuracy and damage you give<br/>Repair - affects your efficiency of Repair Kits<br/>Sneak - affects your probability of successful sneaking and escape<br/>Lockpick - affects your lockpicking ability<br/>Survival - affects your effectiveness of food and water<br/>Speech - affects your success rate of persuasion and intimidation<br/>Barter - affects purchase prices of items<br/>    Some skills affect certain options in some events</p>\r\n\r\n\r\nUpgrades (Click to show)\r\n<p>Fully Automatic - Enables you to shoot faster and continuously<br/>Floating Module - Enables you to cross rivers safely<br/>Booster - Enables you to travel faster (with increased fuel consumption)<br/>Motion Tracker - Detects enemies and prevents ambush<br/>Disinfector - Prevents illnesses caused by contaminated water<br/>Stabilizer - Reduces your gun's recoil<br/>Ballistic Armor - Reduces your vehicle's armor damage taken</p>\n<p>You can get upgrades at locations with bigger building icons</p>\n<p>Please contact me if find any glitches</p>", "metacritic": null, "released": "2021-08-14", "tba": false, "updated": "2021-08-16T06:48:31", "background_image": "https://media.rawg.io/media/screenshots/ad9/ad921fb09c9c9f5bc1b5d2bf51bd6738.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 53, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["T.F.A.N.C.S."], "genres": ["RPG"], "publishers": [], "esrb_rating": null}