{"id": 649860, "slug": "smilez", "name": "Smilez", "name_original": "Smilez", "description": "<p>Challenge yourself with this mini puzzle game, where you will get a flavour of what it is like to be a dentist.<br/></p>\n<p>You will face various levels, of increasing difficulty. Where you will be asked to scale and polish, remove cavities, polish, and any other combination. </p>\n<p>Be careful of not touching the sensitive areas as otherwise your patient might lose blood and be too stressed to continue.</p>\n<p>Your progress is saved automatically when you exit. </p>\n<p>I'm afraid this is not optimized for mobile devices.</p>\r\nInstructions\r\n<p>Use the right tool for the job.</p>\n<p>Click (left mouse button) on the open mouth icon to open the mouth</p>\n<p>Click on any tool to start using it</p>\n<p>Click on the little hand to release the tool and pick another one</p>\n<p>Left Mouse Button to pick up a tool or press a button\r\n</p>\n<p>Continous left-click to use the tool\r\n</p>\n<p>Continous right-click to rotate the tool\r\n</p>\n<p>Esc during the game to go back to the main menu<br/></p>\n<p>To do a scaling job you need to use the sickle</p>\n<p>To polish, you need the polisher</p>\n<p>To remove decay first use a drill, then the plugger to put some filler</p>\n<p>Beware of blood loss and patient comfort/stress level</p>\n<p>Try not to touch on sensitive areas such as libs or gums, this will result in some blood and comfort loss depending on which tool you are using</p>\n\r\nCredits\r\n<p>Music by<strong> Kevin MacLeod</strong></p>\n<p>Sound FX various CC0 sources</p>\n<p>Art and Code by myself</p>\n<p>Powered by <strong>GODOT</strong> Game Engine</p>\r\nAuthor\r\n<p>I'm a Full Stack Software Developer, Italian of origin and living in the Emerald Isle (i.e. Republic of Ireland). <br/></p>\n<p>One day I'll ship a proper commercial game or app, in the meantime, I participate in Game Jams and create the odd plug-in/game mod/etc.</p>\n<p>Check out my open-source projects on my GitHub</p>\n\r\nDisclaimer\r\n<p>Released for the itch.io LowRez Game Jam 2021 on Aug 14th 2021</p>\n<p>All rights reserved by the respective owner</p>\n<p>The game is provided as-is and free of charge. There might be bugs, typos, unbalanced mechanics, unpleasant sounds (anybody likes the sound of the dentist's drill?).</p>\n<p>Although the game depicts some medical procedures, they are fictional and do not represent the real practice of dentistry and medicine. Please seek a professional if you need medical attention</p>", "metacritic": null, "released": "2021-08-14", "tba": false, "updated": "2021-08-16T06:40:30", "background_image": "https://media.rawg.io/media/screenshots/53f/53f661b449631eff440a06d9d1b76022.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 44, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["tomdubliner"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}