{"id": 649913, "slug": "mata-dez", "name": "Mata Dez", "name_original": "Mata Dez", "description": "<p>Mata Dez foi feito em um desafio: Fazer um jogo do zero em três dias.</p>\n<p>Quanto à história, me inspirei no livro \"As Intermitências da Morte\", de José Saramago. No livro, a morte, humanizada, decide parar de matar as pessoas de uma cidade. No começo todos ficam felizes, porém depois de um tempo pedem para ela retornar ao trabalho. Então, a morte, em uma noite, mata todos que deveriam ter morrido naquele intervalo de tempo. E é daí que veio minha inspiração.</p>\n<p>Em Mata Dez você é a morte, e deve capturar 10 almas (entrando nas casas de portas abertas) dentro de 2min30s. Ao capturar as 10 almas, você deve retornar ao cemitério para vencer o jogo. Porém, em todo novo jogo as casas que estão abertas são aleatórias!</p>\n<p>Use A e D para andar para a esquerda ou direita, W para entrar nas casas e Espaço para pular.</p>\n<p>Por ter sido feito em um período curto, algumas ideias como um sistema mais bem desenvolvido de recordes e um meio de contar a história do jogo acabaram ficando de fora. Também existem alguns pequenos bugs e erros em sprites, mas nada que impeça a jogabilidade.</p>\n\n<p>Eu não pretendo retornar a esse projeto, então essas ideias não serão implementadas no futuro. Esse jogo foi deixado público mais como uma forma de documentar meu trabalho.</p>\n<p>A programação e arte foi feita inteiramente por mim. A trilha sonora foi criada pelo Marcos Vinícius (Incansável).</p>\n<p>Estou apenas começando na produção de jogos, mas pretendo chegar longe.</p>", "metacritic": null, "released": "2021-08-14", "tba": false, "updated": "2021-08-16T06:55:59", "background_image": "https://media.rawg.io/media/screenshots/874/874b483c8fec4424c7afa6ca0bd2dd5b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 44, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Vinicius_VPC"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}