{"id": 650214, "slug": "phrase-scramble-1st-edition-2021", "name": "Phrase Scramble 1st Edition 2021", "name_original": "Phrase Scramble 1st Edition 2021", "description": "Enjoy a different kind of word game. With this new two stage Safari  into the World of Words!!!\r\nWith retro sounds, scoring, bonuses, video, music, even clues and so much more...\r\n\r\n\r\nObject:\r\nFirst unscramble the words, then the phrase . Do it quickly and get Bonuses along the way, and watch the money roll in....  We keep track of your progress each game, so you don't have to worry. \r\nBut that's not the end! There's a whole library of phrases to solve from simple to challenging! And more types of phrase libraries on the way!\r\n\r\nControls:\r\nStage 1: \r\n1. Type number next to scrambled word.\r\n (Note 0 is lowest number)\r\n2. Respell word or type 1 for clues\r\n(always press enter after each selection)!\r\nStage 2:\r\n1. Type the number beside the word you want to  position in phrase. \r\n(Note Again 0 is lowest number)\r\n2. Type number beside of solved word you want to position in the phrase or type 12 to buy a word.\r\nOr if your feeling brave type 10 and try to solve \r\nYou may always type 11 to quit (But if you quit in the middle of a game your current game wont be saved! \r\n\r\nCredits:\r\nThis game was written in Python by me.\r\nThe music was written and produced  by me.\r\n\r\nHints:\r\nIf you type 1 to get clue in 1st stage, (and its a long word) and after the  clues - as long as you have 4 letters left then type n to exit, and you will be placed back in the main list. Simply retype any number and respell again because (your time starts over) and even get bonuses. This is a new feature due to more challenging words with 5 or more letters we've added.", "metacritic": null, "released": "2021-08-13", "tba": false, "updated": "2021-08-16T08:20:28", "background_image": "https://media.rawg.io/media/screenshots/0b4/0b4a91a4cbf5df143a2bb5d1b5784dbe.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 232, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Never Satisfied"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}