{"id": 650229, "slug": "colxor", "name": "Colxor", "name_original": "Colxor", "description": "\n<p>\n</p>\n<p>Welcome to the magical world of mixing paint using bitwise logic.  If that sounds fun to you then I'm sorry . . . also: hi, I'm Dave, we should hang out.</p>\n<p>My entry for LowRezJam 2021.</p>\r\nHow to play:\r\n<p>You have 3 minutes to correctly mix as many paint colors as possible. There are eight paint colors each containing some combination of red, yellow, and blue pigment. To recap lessons from early childhood:</p>\n<ul><li>White paint has no pigment.</li><li>Brown paint has all three pigments.</li><li>Red, yellow, and blue paints all have their respective pigments.</li><li>Orange paint has red and yellow pigments.</li><li>Green paint has yellow and blue pigments.</li><li>Purple paint has blue and red pigments.</li></ul>\n<p>You are given 8 pairs of paint colors: an input and an output.  You are also given a random paint color and a random logic operator.  You must mix your random color using the logical operator with one of the input colors so that it matches the output color.  Doing so results in 10 points and a 2 second time bonus.  Getting the mix wrong costs you 5 points.</p>\n<p>The mix is done by performing the logic operation on each of the 3 pigments between the random color and the selected input color. </p>\r\nControls:\r\n<ul><li>Up/Down - move up or down the rows of color pairs.</li><li>Left/Right - swap the input and output colors of the selected row.</li><li>O/X - perform the mix operation.</li><li>Start - pause the game (you can exit the game or disable the BGM).</li></ul>\r\nLogical operations:\r\n<ul><li>AND ∧ - if both colors have the pigment then it will be in the result.</li><li>OR ∨ - if either or both colors have the pigment then it will be in the result.</li><li>XOR ⊕ - if only one of the colors has the pigment then it will be in the result.</li><li>NAND ↑ - the pigment will be in the result unless it's in both colors.</li><li>NOR ↓ - if neither color contains the pigment then it will be in the result.</li><li>XNOR ⊙ - if both colors do or don't have the pigment then it will be in the result.</li></ul>\n<p>The truth table for each operation is also displayed on the bottom left of the game, underneath the operation name.</p>\n<p>If you're having trouble figuring things out, or simply want to cheat for no reason, go ahead and use the Konami code.</p>\n<p>I deeply apologize for this poor excuse for a game.  Maybe next time I'll just stick with my first idea: Jet Ski Johnny.</p>\n\n<p>\"Vrooom!\"</p>", "metacritic": null, "released": "2021-08-13", "tba": false, "updated": "2021-08-16T08:23:50", "background_image": "https://media.rawg.io/media/screenshots/577/5774021fea661b64aa383327b4e74258.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 26, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["impliedchaos"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}