{"id": 650582, "slug": "toca-hair-salon-me", "name": "Toca Hair Salon Me", "name_original": "Toca Hair Salon Me", "description": "<p>Give your friends and family a totally new look! Simply snap a picture and you’re transported to a world of hair-raising fun!<br />\nIn this new version of the wildly popular Toca Hair Salon series we want you to create the characters!<br />\nToca Hair Salon Me lets you be the customer and the stylist! Curly, straight or purple? Create a funky hairdo any way you like. Grow it long or cut it short, shave one side or spray paint it every color of the rainbow. The possibilities are endless!<br />\nAdd accessories such as hats, sunglasses and hair clips to top it off. Don’t forget to take a photo and share with friends. Now you can use your own photos as backdrops to complete your style transformation.<br />\nCheck out what’s new in Toca Hair Salon Me!<br />\n- Snap a picture of your friends to create their new hairstyle<br />\n- Or use a photo from your camera roll<br />\n- Tons of fun new accessories from mustaches to hats<br />\n- Even more hair colors to choose from<br />\n- Create photo backgrounds from your own pictures<br />\nAnd all the features you already love:<br />\n- Use G.R.O. to make short hair long again<br />\n- Lather, rinse &amp; blow-dry<br />\n- Use tools to curl, straighten, crimp, shave &amp; trim<br />\n- Characters make fun faces and sounds while you style them<br />\n- No rules or stress – play any way you want to!<br />\n- Kid-friendly interface<br />\n- No third-party advertising<br />\n- No in-app purchases<br />\nEndless hours of hairstyling fun awaits with hair cutting tools and accessories at ready to play with! Be a hairstylist and give your friends and family a crazy, fun or cool haircut that they’ll love.</p>", "metacritic": null, "released": "2014-05-15", "tba": false, "updated": "2021-08-19T15:55:30", "background_image": "https://media.rawg.io/media/screenshots/c23/c23b05d9415b9f09faa2b226bafce2d1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 114, "game_series_count": 0, "reviews_count": 2, "platforms": ["iOS", "Android"], "developers": ["TOCA BOCA"], "genres": ["Simulation", "Educational", "Family"], "publishers": [], "esrb_rating": "Everyone"}