{"id": 650636, "slug": "citystate-ii", "name": "Citystate II", "name_original": "Citystate II", "description": "<p>Build an entire Nation, one city at a time<br />\nBuild roads, railways and subways. Lay out commercial, residential and industrial zones. Provide health and education services, place fire and police stations and extend public buildings to fit the growing population.<br />\nClaim new lands to build new cities and extend your Nation. Each map comes with 64 buildable cities!</p>\n<p>One of the most advanced economic system in the genre…<br />\nSet tax rates for each sector, build enough zones for businesses to expand. Print money with the central bank to avoid bankruptcy but beware of the inflation rate! Keep the unemployment under control and maintain positive approval ratings or the population will take the streets! Balance taxes and regulations to create the best conditions for your citizens to climb the social ladder.<br />\n…that gives you all powers to alter your Nation’s destiny.<br />\nDefine how fast your population grows by setting a border policy. Make sure your city is ready for more migrants or poverty will spread. Increase your Nation’s attractiveness to appeal to richer populations.<br />\nChoose how to deal with contemporary political issues and economic matters by enacting some of the 60 policies at your disposition. Each comes with 4 options, offering anything between socialist strategies and anarchist ideals.</p>", "metacritic": null, "released": "2021-09-23", "tba": false, "updated": "2021-09-24T03:22:57", "background_image": "https://media.rawg.io/media/screenshots/584/584cc69fb2195b305dfd945eea80840e.jpg", "website": "http://www.citystategame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 12, "toplay": 7}, "playtime": 4, "achievements_count": 30, "ratings_count": 0, "suggestions_count": 248, "game_series_count": 1, "reviews_count": 0, "platforms": ["PC"], "developers": ["Andy Sztark"], "genres": ["Strategy", "Simulation"], "publishers": ["Andy Sztark"], "esrb_rating": null}