{"id": 650608, "slug": "nobody-saves-the-world", "name": "Nobody Saves the World", "name_original": "Nobody Saves the World", "description": "<p>Transform from a featureless nobody into a SLUG, a GHOST, a DRAGON, and MORE in this new take on Action RPGs from the creators of Guacamelee!</p>\n<p>Complete quests to discover and swap between 15+ varied and distinct Forms. Mix and match abilities in unexpected ways to unlock and complete even MORE challenging quests. Explore a vast overworld - on your own or with a friend online - while clearing shape-shifting dungeons in an effort to stop The Calamity and SAVE THE WORLD!</p>\n<p>KEY FEATURES<br />\nTransform into MANY FORMS: Unlock 15+ distinct Forms, from Rat to Rogue to Robot, each with its own unique gameplay mechanics.<br />\nMix &amp; Match ABILITIES: Combine over 80 Form abilities to create powerful customized builds. Play as an Egg that can leave a trail of slime and shoot fireballs!!! We can&#39;t stop you!<br />\nUnconventional QUESTS: Help the strange inhabitants of this world deal with their troubles. Each Form also has its own set of quests, which you can complete in creative ways.<br />\nEvolving Dungeons: As you become stronger, procedurally generated dungeons increase in difficulty and complexity to keep you on your toes.<br />\nOnline Co-op: Invite a friend to play through all, or part, of your adventure together!<br />\nAwesome Soundtrack: New original music by acclaimed composer Jim Guthrie.<br />\nMore to come! Stay tuned…</p>", "metacritic": null, "released": "2022-01-17", "tba": false, "updated": "2024-04-17T22:52:54", "background_image": "https://media.rawg.io/media/games/b44/b448c0725eb490dda9cfb23b826da68a.jpg", "website": "https://nobodysavestheworld.com", "rating": 3.81, "rating_top": 4, "added_by_status": {"yet": 54, "owned": 781, "beaten": 69, "toplay": 96, "dropped": 83, "playing": 17}, "playtime": 5, "achievements_count": 94, "ratings_count": 131, "suggestions_count": 301, "game_series_count": 0, "reviews_count": 134, "platforms": ["PlayStation 5", "Xbox Series S/X", "PC", "Nintendo Switch", "Xbox One"], "developers": ["DrinkBox Studios"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["DrinkBox Studios"], "esrb_rating": "Teen"}