{"id": 650604, "slug": "marvels-midnight-suns", "name": "Marvel's Midnight Suns", "name_original": "Marvel's Midnight Suns", "description": "<p>Marvel’s Midnight Suns is a new tactical RPG set in the darker side of the Marvel Universe, putting you face-to-face against demonic forces of the underworld as you team up with and live among the Midnight Suns, Earth&#39;s last line of defense.</p>\n<p>After centuries of sleep, Lilith, Mother of Demons, has been revived by Hydra through a twist of dark magic and science. Lilith stops at nothing to complete an ancient prophecy and bring back her evil master, Chthon. Pushed to the brink, the Avengers desperately look to fight fire with hellfire and enlist the help of the Midnight Suns - Nico Minoru, Blade, Magik and Ghost Rider - young heroes with powers deeply rooted in the supernatural, formed to prevent the very prophecy Lilith aims to fulfill. Together, they resurrect an ancient warrior - the Hunter, Lilith’s forsaken child and the only hero known to have ever defeated her. In the face of fallen allies and the fate of the world at stake, it will be up to you to rise up against the darkness!</p>\n<p>From the legendary studio that changed strategy and tactics games forever comes a new title, offering cinematic tactical combat with a Super Hero flair, friendships to forge with iconic heroes, and an unforgettable adventure that dives deep into the darker side of Marvel.</p>", "metacritic": null, "released": "2022-12-02", "tba": false, "updated": "2024-04-15T07:44:52", "background_image": "https://media.rawg.io/media/games/d47/d471344cc698b2dc660ab09880e1e884.jpg", "website": "https://midnightsuns.2k.com", "rating": 3.92, "rating_top": 5, "added_by_status": {"yet": 62, "owned": 379, "beaten": 48, "toplay": 196, "dropped": 15, "playing": 23}, "playtime": 8, "achievements_count": 127, "ratings_count": 63, "suggestions_count": 530, "game_series_count": 31, "reviews_count": 66, "platforms": ["PlayStation 5", "Xbox Series S/X", "PlayStation 4", "PC", "Xbox One"], "developers": ["Firaxis"], "genres": ["RPG", "Strategy"], "publishers": ["2K Games"], "esrb_rating": "Teen"}