{"id": 650615, "slug": "jumanji-the-curse-returns", "name": "Jumanji: The Curse Returns", "name_original": "Jumanji: The Curse Returns", "description": "<p>A game for those who seek to find a way to leave their world behind… roll the dice, read the riddles and experience the board game from the original 1995 film in a contemporary digital style. The Jumanji game will summon a magical jungle and take over the town — unless you stop it!</p>\n<p>Face the dangers with your friends and family and prepare for a fun, casual co-op adventure like no other. In every round, you’ll be matching the correct items from your stash with those needed to send the perils back into the board. Time restrictions mean you’ll have to work together to be victorious. You’ll face crocodiles, elephants, rhinos and more, plus creeping jungle vines that will try to ensnare you all. And if the game releases Van Pelt, the hunter pop up at random moments and try to disable your team! It’s up to you and your friends to stop Jumanji from invading the town! Stand together, make it to the center of the board… and win the game.</p>\n<p>Can you hear the drums?<br />\nFeatures</p>\n<p>Play the magical board game<br />\nROLL THE DICE TO MOVE YOUR TOKEN - DOUBLES GETS ANOTHER TURN - REACH THE CENTER TO WIN… the Jumanji board game is a magical portal. You’ll be moving around the board AND matching items to banish the jungle creatures and plants that come out of it!</p>\n<p>Cooperate in real time<br />\nThey grow much faster than bamboo - take care or they’ll come after you! Creeping vines slow you down, but they’re just one of the fun challenges you and your friends will face. It’s the most mysterious board game ever imagined, and you’ll have to work together to win!</p>\n<p>Team up with 4 players<br />\nJust like the film, it takes 4 to triumph over Jumanji. If you have fewer players, AI companions will join to complete your team. Win together and banish the jungle!</p>\n<p>Test your co-op skills<br />\nThis will not be an easy mission - monkeys slow the expedition! Every round has set time limits, so you’ll have to work together to stay in the game. Use the right items at the right time, manage token power-ups and apply bonus abilities to banish a danger in a single move! It’s co-op fun whether you’re facing a stampede or a combination of crocodiles, piranhas and the hunter, Van Pelt!</p>\n<p>Anyone can play<br />\nADVENTURERS BEWARE: DO NOT BEGIN UNLESS YOU INTEND TO FINISH… It’s so quick and easy to pick up, anyone can play! So bring your friends and family together for a fun Jumanji co-op board game experience like no other!</p>\n<p>Contemporary style<br />\nBright contemporary sets and characters deliver an exciting new take on the classic board game experience of the 1995 film!</p>\n<p>Explore classic Jumanji sights<br />\nPlay the board game in iconic settings from the 1995 film, including the Parrish Mansion Attic, the Shoe Company, Sir Sav-A-Lot, the Riverbank and the Town Center!</p>", "metacritic": null, "released": null, "tba": true, "updated": "2022-09-19T08:16:26", "background_image": "https://media.rawg.io/media/screenshots/eea/eeab6e95d6f7b90127ad246b66ceebab.jpg", "website": "https://marmaladegamestudio.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 257, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Nintendo Switch", "PC"], "developers": ["Marmalade Game Studio", "Marmalade Games Studio"], "genres": ["Adventure", "Simulation", "Board Games", "Casual", "Card", "Indie"], "publishers": ["Marmalade Game Studio"], "esrb_rating": "Everyone 10+"}