{"id": 650660, "slug": "ultimsnake", "name": "UltimSnake", "name_original": "UltimSnake", "description": "<p>Oh No! Not yet another snake !<br />\nThis is the best snake of the AppStore :</p>\n<ul>\n<li>Game Center support with leaderboard and 17 achievements to earn.  </li>\n<li>Use either the accelerometer or the screen control to direct the snake  </li>\n<li>Discover the 200 different types of vitafruits with various graphism and fill up the encyclopedia  </li>\n<li>Masterize the 22 options and learn to combine them to get extra points scores  </li>\n<li>Use your dexterity and try to obtain a score of more than a millions of points  </li>\n<li>Zero Launch Time (ZLT) Technologyie for instant playing.  </li>\n<li>Support for iOS 4 multitasking.  </li>\n</ul>\n<p>RULES<br />\nUse the arrows on screen to direct the snake.<br />\nEat the vitafruits which appear on the game board without eating yourself or touching the board edge.<br />\nEach time you eat a vitafruit:<br />\n- your score increases by the vitafruit value,<br />\n- one vitamin is added to the vitabar,<br />\n- the snake&#39;s tail grows by one segment.<br />\nIf you don&#39;t eat a vitafruit, the vitabar is reducing by 10 vitamins.<br />\nAs the vitabar increases, the appearing vitafruits will have more value.</p>\n<p>Can you obtain more than one million points ?</p>\n<p>VITAFRUITS<br />\nThere are 200 different vitafruits in the game!<br />\nEach time you eat a new vitafruit, it is added to the encyclopedia with its value and the number of times you eat it.<br />\nThe unknown vitafruits are displayed with a question mark in the encyclopedia.</p>\n<p>Can you discover the entire encyclopedia ?</p>\n<p>OPTIONS<br />\nThere are 22 options in the game, grouped in 5 categories, for exemple:<br />\n- shrink the snake<br />\n- speed up or down the snake<br />\n- drunken snake<br />\n- and much more...<br />\nThe options frequency occurrence is different for each one.<br />\nBe careful, they aren&#39;t all good to take! Learn to recognize them to optimize there functionality and avoid the traps!</p>\n<p>Be strategic when using the options to explode the scores!</p>", "metacritic": null, "released": "2010-07-29", "tba": false, "updated": "2021-09-05T21:03:14", "background_image": "https://media.rawg.io/media/screenshots/666/666485199c822be64bd5dc32ee3f740d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 131, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": [], "genres": ["Arcade", "Casual"], "publishers": [], "esrb_rating": null}