{"id": 650740, "slug": "war-beasts", "name": "War Beasts", "name_original": "War Beasts", "description": "After the decline of magic and mythology, technology and machines rose.there is never a shortage of inhabitants in the dark world. The heirs of these evil wills have been threatening the settlers from earth civilization.<br/>\n<br/>\r\n▲ You need to familiarize with your arsenal<br/>\r\nMachine gun is a short-range defense unit, attacks aircraft and footman.<br/>\r\nCannons, artillery and laser are medium-range weapons against heavily armored tanks, robots on the battlefield.<br/>\r\nRocket launcher and Cruise missile are long-range weapons against densely formed zombie legion.<br/>\r\nAir defense sites attacks jet fighters beyond-horizon, intercepts starship in space.<br/>\r\nShockers can paralyze the squad on lands.<br/>\r\nThe laser turret can intercept 3 aircrafts at the same time, e.g. artillery shells, jet fighter, biochemical dragonfly.<br/>\r\nWormholes can weaken the armor of giant war machines, e.g. titan, warship.<br/>\r\nSatellite is an advanced defense unit that can boom space fleets.<br/>\r\nThe main fort unlocks tech level of your camp.<br/>\n<br/>\r\n▲ Energy stations generate gold coins within fixed period of time, once placed, they cannot be moved<br/>\r\nDefensive buildings can be strengthened and be repaired.<br/>\r\nResearch institute can upgrade the armor, attack power, and AI of troops. They accumulate energy, release skills(protective shields),strengthen the abilities of machines within range.<br/>\r\nAuxiliary sites cannot be upgraded.<br/>\n<br/>\r\n▲ In every new level, enemies with new abilities will appear<br/>\r\nYou can freely place defensive towers on the map, along the path that raiders come from.<br/>\n<br/>\r\n▲ Some information about the Dark Legion<br/>\r\nBiochemical spiders and robots are fast-moving units.<br/>\r\nWar machines, e.g. tanks, titans, battleships, and aircraft carriers are heavy armored.<br/>\r\nAir offensive units, e.g. hovering swarms, jet fighters, penetrate defenses from the air and launch missiles to attack<br/>\r\nInvisible units will penetrate silently, what you need is a sonar site.<br/>\r\nThere are electromagnetic special operations units, such as detonators that paralyze targets.<br/>\r\nBomber can carry out dense carpet bombing<br/>\r\nThe transport aircraft can drop all kinds of combat weapons, e.g. biochemical spiders, robots, tanks, laser cannons, and swarms<br/>\n<br/>\r\n▲ Each level has 5 stars. The higher the star level, the more waves the enemy will attack. You need to establish an advantage as soon as possible.<br/>\r\nYou can select an enemy. When the target is killed, you will get gold coins as a reward.<br/>\n<br/>\r\n▲ Unlike the tower defense mode, in the clan battle, as top commander of legions, you need to choose mobile tanks instead of building defensive sites.<br/>\r\nDecide the crusade strategy, make a balance between Land and Air Force, heavy armor units and mobility units, then wage wars.<br/>\n<br/>\r\nIt is a total war to save the world against Dark Legions, good luck, commander.", "metacritic": null, "released": "2021-08-17", "tba": false, "updated": "2021-09-06T12:41:04", "background_image": "https://media.rawg.io/media/screenshots/aac/aacfbdf23a4b01c5cbbb71ee9eff3ca2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 276, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Beast Of World"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["Beast Of World"], "esrb_rating": null}