{"id": 650744, "slug": "start-again-a-prologue", "name": "START AGAIN: a prologue", "name_original": "START AGAIN: a prologue", "description": "<p>START AGAIN START AGAIN START AGAIN: A PROLOGUE (or: START AGAIN: a prologue) is a story driven turn-based RPG where you, Siffrin, are stuck in a time loop for no reason you can find. The country is frozen in time, and together with your allies you fought your way through the castle and fought the King to put an end to this curse… And you died and found yourself right back at the entrance. Again. And again. And again. But you’re the only one who remembers it; your allies are none the wiser. And there’s no end in sight.<br />\nYou&#39;re fine though! Hiding your knowledge from your friends is easy! Fighting the same enemies is easy! Dying to the same final boss over and over again is easy! Explore the castle, make your way to the king, and try to break the loop. Maybe this time, it’ll be different. Because if you fail, if you die, you’ll find yourself right back where you started.<br />\nYou have to make sure your friends don&#39;t find out about the super fun time travel times you&#39;re having  though.<br />\nThey can&#39;t know.<br />\nThey can&#39;t.<br />\nFEATURES:<br />\nA story all about how time loops would affect someone and their relationship with their friends! With no end to the loop in sight and the seemingly endless cycle wearing you down, can you find a way to break free before it breaks you?<br />\nATB based gameplay!  Utilize rock-paper-scissors style weaknesses and strengths to tactically take down your foes!<br />\nFour &quot;endings&quot; depending on your choices (as in, as in, four different ways the battle against the final boss can go)! Including one True Ending!<br />\n3-5 hour playtime!<br />\nYour friends having fun conversations about crabs while you&#39;re in the corner on the verge of a panic attack!<br />\nAn amazing chiptune soundtrack by Studio Thumpy Puppy!<br />\n&quot;HEY WAIT WHY IS THIS CALLED A PROLOGUE IS THIS COMPLETE OR NOT&quot;<br />\nSTART AGAIN: a prologue is the first installment (out of two, with another game already in the works) in the START AGAIN series, but this game is complete and you will not finish it feeling like you only read Chapter 1 of a 1000 page book! This prologue is more akin to a side story, and stands completely on its own.<br />\nAlso &quot;prologue&quot; is just a cool word.</p>", "metacritic": null, "released": "2021-08-18", "tba": false, "updated": "2023-10-17T21:01:36", "background_image": "https://media.rawg.io/media/screenshots/82e/82e8ff00375c655cc26a786a4c7b948c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 12, "beaten": 1, "toplay": 2, "playing": 1}, "playtime": 2, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 209, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["insertdisc5"], "genres": ["RPG", "Indie"], "publishers": ["insertdisc5"], "esrb_rating": null}