{"id": 650792, "slug": "card-survival-tropical-island", "name": "Card Survival: Tropical Island", "name_original": "Card Survival: Tropical Island", "description": "Card Survival: Tropical Island is a card-based survival experience from the creators of Card Quest.<br/><br/>Experience what life would be like if you were stranded on a desert island, all in a card format.<br/>Explore, craft tools and manage your needs in order to survive in this hostile environment.<h3>Key Features</h3><ul><li>Simple but deep system: all interactions are done by using cards or combining them together.<br/></li><li>Realistic Simulation: Fight dehydration, starvation, depression and more in a scenario where every decision counts, as dying means starting over.<br/></li><li>Multiple endings: build yourself a raft to find a way back to civilization, make yourself a more permanent residence on the island or find one of the secret endings.</li></ul><h3>Many things to do</h3><ul><li>Explore the island to find caves to use as shelter, shipwrecks to scavenge, useful vegetation, water sources and more.<br/></li><li>Build structures out of wood and mud bricks, make clay containers with a kiln, and eventually complete advanced structures like a water reservoir or a stove for your home.<br/></li><li>Train skills like spearfishing, climbing, swimming and cooking to improve their chances of success and unlock new cards.</li></ul><h3>Interesting food and drink mechanics</h3><ul><li>Drink from coconuts, capture rainwater in coconut shells or other containers, collect and purify water from puddles or even extract it from banana trees or solar stills.<br/></li><li>Many ways to fish: use a fishing rod with different types of bait, try setting some fish traps or learn the art of spearfishing. Smoke or salt your fish meat so that it can last longer.<br/></li><li>Prepare lots of different foods in your campfire and smoke or salt it so it can last longer. Try to keep a varied diet to avoid saturation and cook complex recipes to keep things entertaining.</li></ul><h3>Complex health system</h3><ul><li>Make sure you stay happy and motivated to keep your body's defenses up. Entertain yourself by swimming, having deep conversations with imaginary friends, playing music and even making castles in the sand.<br/></li><li>Suffer from foot and hand sores, calluses, back pain, sunburns, sickness and even bug bites. Craft protective clothing and use multiple medicinal plants to treat these ailments.<br/></li><li>Fall from trees, slip on rocks, cut yourself, get bitten, gored or step onto urchins and spiders. Wash and dress your wounds and take antibiotics to stave off infection and fever.</li></ul>", "metacritic": null, "released": "2021-08-16", "tba": false, "updated": "2023-03-05T02:53:00", "background_image": "https://media.rawg.io/media/screenshots/018/0180d150c277b5ca8080547c651453be.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 22, "beaten": 1, "toplay": 1, "dropped": 3}, "playtime": 7, "achievements_count": 53, "ratings_count": 4, "suggestions_count": 236, "game_series_count": 0, "reviews_count": 4, "platforms": ["PC"], "developers": ["WinterSpring Games"], "genres": ["Adventure", "Strategy", "Simulation", "Indie"], "publishers": ["WinterSpring Games"], "esrb_rating": null}