{"id": 650756, "slug": "gravitators", "name": "Gravitators", "name_original": "Gravitators", "description": "Gravitators is a Gravity Twin Stick Shooter game where you pilot ships and complete mission objectives to secure the future of humankind. Defend the Earth and travel through the galaxy to repel a relentless alien invasion.<br/><br/>Inspired by classic games like Thrust, Gravitar, Asteroids, Solar Jetman and others, Gravitators unshelves this old genre and overhauls it into modern times, while keeping the genre's trademark features: maneuvering through tight spots while carrying heavy objects, fighting enemies and preserving fuel.<br/><br/><br/><br/>Each Gravitator ship has unique piloting controls and distinct weaponry.<br/><br/>Flying each one completely changes the game experience, as the variations in thrusting, rotation controls and weaponry require alternative combat strategies.<br/><br/>Mastering all 4 Gravitator ships is already a challenge on its own.<br/><br/><br/><br/>Travel throughout the Solar System and the Milky Way. Missions will take place on Earth, the Moon, asteroids, planets, exoplanets, outer space and even wormholes and black holes!<br/><br/>Don't let the battle prevent you from admiring the scenery though: it's all beautifully done in Low Poly Art style, featuring an original soundtrack that will immerse you into all these locations.<br/><br/><br/><br/>There is a huge variety of mission objectives: escort nuclear weapons, destroy enemy structures or bases, rush to save civilians from a doomed city, hack enemy terminals, collect samples, retrieve objects from exploding bases, chase escaping enemies, rescue human prisoners, steal enemy machinery, protect important targets, and many more!<br/><br/>Experience gravity, but in its full mind-bending extent: pulling your ship down, up, left and right. Or no gravity at all, forcing you to thrust into the opposite direction to slow down!<br/><br/>Missions will sometimes have clouds or gases that obstruct your view, underwater sections that will slow you down, and pitch black areas that hide lurking enemies. There are many, many obstacles and enemies that will try to stop you from completing missions.<br/><br/>Exploring the battlefield can unlock hidden objectives and rewards.<br/><br/><br/><br/>Every mission has 12 awards for pilots to achieve. Specific awards will unlock one of the 30 Power Ups and 30 Perks available to aid you in battle.<br/><br/>Power Ups can increase your damage output, add effects to your weapons, increase your speed or hull, improve your ship armor and shield, or add certain useful abilities. Choosing the right power up for your mission can make a huge difference in its outcome.<br/><br/>Perks permanently increase the stats of your ship or other human objects and structures.<br/><br/><br/><br/>True to its genre, Gravitators is a difficult game. Scenarios are unforgiving and mistakes can be deadly. Missions will challenge your skills and reflexes.<br/><br/>If you've never played this kind of games before, you should probably start the game in EASY and learn the ropes. Contrary to many games today, EASY mode is actually very challenging as well. And don't worry: you can switch mission difficulty at any time, your progress won't be affected by it.<br/><br/>On the other hand, if you're an experienced pilot looking for real challenge, HARD has been specifically tailored for you.<br/><br/><br/><br/>You ready to gravitate?", "metacritic": null, "released": null, "tba": false, "updated": "2021-09-06T12:52:21", "background_image": "https://media.rawg.io/media/screenshots/3b3/3b361b305f295fa3263aec4c1fa6d2a7.jpg", "website": "https://www.insulargames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 370, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Insular Games"], "genres": ["Action", "Indie"], "publishers": ["Insular Games"], "esrb_rating": null}