{"id": 650776, "slug": "blood-for-poppies", "name": "Blood for Poppies", "name_original": "Blood for Poppies", "description": "You have wings, but you can’t fly. Your wings are pitiful, broken things made of bone and shredded skin stitched together. Your mysterious benefactor, Doctor, has cared for you for as long as you can remember. Doctor never allows you to leave the 8th floor of the Summerset Apartment Complex, and the only people you have contact with are the other freaks of the 8th floor. Will Doctor's entrapment of you ever end? Will you escape his clutches and make your way into a bustling city that has always been so near--and yet so far--just outside the window of your cramped room? Will you continue Doctor's work or will you break the cycle of trauma perpetuated by his dark and tortured legacy of mad science?<br/><br/>Blood for Poppies is a 188,000-word psychological horror interactive novel by M.E. Smith about entrapment and the lingering effects of trauma. It's entirely text-based, without graphics or sound effects, and fueled by the vast, unstoppable power of your imagination. <br/><br/><ul><li> Play as male or female; gay, bi, or straight.<br/></li><li> Romance a seemingly emotionless young woman struggling to feel human, an insecure and compassionate artist striving to achieve his dreams despite Doctor's control, and a rebellious young man with a temper that eclipses his better nature. <br/></li><li> Befriend and uplift your fellow freaks or alienate all around you through cruelty, manipulation, and betrayal. Characters respond to your choices... for better or worse.<br/></li><li> Escape Doctor's clutches or inherit his scientific work for your own benevolent or malicious designs.<br/></li><li> Devote yourself to Doctor by expressing loyalty to him or rebel against him at every opportunity.<br/></li><li> Ally yourself with others for your own goals, but be careful; everyone has their own motivations and betrayal is always a possibility.<br/></li><li> Revel in the hideous or cultivate beauty, live joyously or give in to despair, express compassion or cruelty, allow your fate to be malleable putty in the hands of others or manipulate all around you; your attitudes and tendencies are up to you.<br/></li><li> Achieve endings that change in minor and major ways depending on the actions you take and the relationships you build.</li></ul><br/>Influence who lives and dies; not everyone makes it to the end.", "metacritic": null, "released": "2021-08-19", "tba": false, "updated": "2021-09-06T13:08:43", "background_image": "https://media.rawg.io/media/screenshots/01d/01d898a1614cc0a99da93785f12afa47.jpg", "website": "https://www.choiceofgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 33, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Hosted Games"], "genres": ["Action", "Adventure", "RPG", "Casual", "Indie"], "publishers": ["Hosted Games"], "esrb_rating": null}