{"id": 650762, "slug": "wolf-attack-2", "name": "Wolf Attack", "name_original": "Wolf Attack", "description": "The pig is back, and he is now even stronger than before. With shotguns or bows at your disposal, defeat the wolves once and for all! A new Improved graphic design and different characters, a new 1 vs. 1 battle system, and different maps are waiting for you! And on top of that, encounter allies or new enemies in our brand new <strong>PVP multiplayer mode</strong>. Numerous entertaining game content is ready for you to play now.<br/><br/><br/><br/>Decide between a shotgun and a bow. The story mode progresses in a total of 4 waves. Use healing items at the right time to defeat the wolf pack and keep the peace of your town once again.<br/><br/>Improve your skills and try to get the most points. Be one of the top rankers on the leaderboard to write history.<br/><br/><br/><br/>Pick one of six characters and prove who is the strongest among your friends. Each character is then teleported to a fixed position on the battlefield. Emerge victorious from the battlefield by defeating the most opponents in epic PvP encounters!<br/><br/><br/><br/><ul><li> Simple yet Entertaining VR shooting game<br/></li><li> Choice between a bow and a shotgun in two single game modes <br/></li><li> PVP Multiplayer mode to enjoy with friends and others<br/></li><li> Various multiplayer mode maps to explore<br/></li><li> Multiplayer mode to Six new characters to pick from<br/></li><li> Different weapon skins for each character</li></ul><br/>", "metacritic": null, "released": "2021-08-18", "tba": false, "updated": "2021-09-06T12:57:20", "background_image": "https://media.rawg.io/media/screenshots/bf4/bf400a6e3e7833ff005b5cb59e9dd28e.jpg", "website": "http://www.tomatovr.kr/wolfattack", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 433, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["TOMATOVR"], "genres": ["Action", "Casual", "Indie"], "publishers": ["TOMATOVR"], "esrb_rating": null}