{"id": 650849, "slug": "inciu-kitan-sacrifice-of-shrine-maiden", "name": "Inciu kitan - sacrifice of shrine maiden", "name_original": "Inciu kitan - sacrifice of shrine maiden", "description": "[Story]<br/><br/>There was a village called Tatsuo in the mountains.<br/>Even though it was the 21st century in Japan, old-fashioned customs were still strongly rooted in this village.<br/>Among the many customs, one of the most strictly practiced is the \"human sacrifice\".<br/>It was believed in this village that calamities came because the gods were angry with human beings for their sins.<br/>Whenever famine or natural disaster, the gods would be worshipped at Manago shrine.<br/> To appease them. young and beautiful women have been sacrificed to the Dragon God enshrined in the Manago shrine.<br/><br/>In recent years, a number of people in Tatsuo village had been dying of unexplained illnesses.<br/>The parents of Kagurazaka Yuina, the most beautiful girl in the village, also died of this disease.<br/>When Yuina was grieving, a village leader appeared and said to her.<br/>\"Yuina, I want you to become a sacrifice to Dragon God.\"<br/><br/>On the eve of the sacrifice ceremony, Yuina receives a huge blessing from the villagers.<br/>Becoming a sacrifice is considered an honorable thing to do because it means saving the village.<br/>As the applause continued to pour in, Yuina's heart was not at ease.<br/>She was a girl, and she did not want to die for honor.<br/>Especially since she had dreams of leaving this village and living an urban life.<br/><br/>On the night after the eve night party, two men sneak up on her.<br/>The two men forcefully rape Yuina.<br/>After having her body fucked, she thought to herself,<br/>I don't want to be sacrificed to these villagers.<br/>Yuina ran away and hid herself, but the men of the village came to search for her and found her.<br/>She is forcibly taken to the Manago shrine.<br/><br/>Eventually, the Dragon God appears through a ritual and is a horrible looking monster with a huge number of tentacles.<br/>I don't want to be the sacrifice of this ugly monster, she thought, and desperately resisted, but her resistance was futile.<br/>And Yuina is raped by the tentacles of Dragon God, while a large number of villagers stare at her.<br/>After torturing Yuina for several hours, Dragon God thanked the villagers for their sacrifice and took her to the back of the shrine.<br/><br/>Once inside the shrine, she found that it was connected to the underworld. And there was a beautiful woman who had been a human sacrifice in the past.<br/>\"You are mine forever. I won't let you go back to the world you were. I will rape you until you die.\"<br/>Yuina is told by Dragon God.<br/>She and the woman, who also became a sacrifice, escaped from Dragon God and wandered around the underworld.<br/>And struggles to return to the original world........<br/><br/><br/>[shrine maiden]<br/><br/>Name: Yuina Kagurazaka <br/>In order to please the people of the village, she plays the part of a prim and proper lady, a traditional Yamato Nadeshiko.<br/>But in her heart, she is a modern girl with a strong yearning for the city.<br/>She is secretly popular among the men of the village, who often look at her ample breasts with an horny eyes.<br/>She seems to be aware of this, and feels unconfortable about it.<br/><br/><br/>[Rape]<br/><br/>A pure-hearted shrine maiden is raped to the desires of men.<br/>90% of the sex scenes will be rape scenes.<br/>The same rape event will be different with a higher level of lewdness.<br/>The way the shrine maiden receives and feels it will be a little more lewd.<br/><br/><br/>[others]<br/><br/>There is a backdoor memory mode.<br/>An adventure RPG with no combat.", "metacritic": null, "released": "2021-08-22", "tba": false, "updated": "2021-09-06T14:01:30", "background_image": "https://media.rawg.io/media/screenshots/f2a/f2a29cb48c1a74a6de0388e130600e18.jpg", "website": "http://h-game.site/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 262, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Nekoshaku"], "genres": ["RPG"], "publishers": ["H-GAME"], "esrb_rating": null}