{"id": 650808, "slug": "dragon-and-home", "name": "Dragon And Home", "name_original": "Dragon And Home", "description": "<strong>Background Story</strong><br/>After an earth-shattering fight between the two Dragons, the Tree of Life was severely damaged and was on the verge of collapse. The Tree of Life condensed its remaining energy into the Seed of World as a means of self-preservation. However, the overflowing energy brought about concerning changes to the native creatures on the continents. The Dragon of Light gathers capable people from all over the world to protect the Tree of Life and save this dilapidated world.<br/>You woke up in the outpost as the hero to save the world chosen by the Tree of Life. You will encountered the enigmatic Witch Sakura. With the help of Sakura, you will learn survival skills and embark on an unpredictable adventure. You and Sakura need to travel throughout different continents, retrieve all the Seed of World and find out the way to sustain and save the dying Tree of Life.<br/><br/><br/><strong>Accompanied by Sakura, You can step into the wonderful unknown world</strong><br/>Sakura will be your guide in the adventure, leading you to explore the unknown and mysterious world: many bizarre creatures are hidden here, many dangers await, and all of these are waiting to be revealed as you start your adventure.<br/>Gather the materials you need by collecting, mining, hunting, fishing, and other fun content, and confront the challenge of surviving in the changing weather system. Don't forget to team up with your friends on the adventure, or find new friends on the way.<br/><br/><br/><strong>Take your well-forged weapons and go on an adventure </strong><br/>There are three classes to choose from: Warrior, Mage, Hunter. The class you play depends on the equipment and the weapons you wear. Experience a variety of combats by freely switching equipment. You can increase the equipment's attributes by forging and inlaying them with Soul Stones, creating unique armors and weapons, enriching your combat skills, and rejecting the same boring battles.<br/><br/><br/><strong>In offline mode, customize your ideal Utopia</strong><br/>Dragon and Home provide thousands of styles of building materials, furniture, and decorative plants for designers to choose from. Even beginner architectures can complete a design easily using the help of our Building-AI. If there are no restrictions, how will you build your Utopia?<br/><br/><br/><strong>Relax and enjoy rural idyll with your friends</strong><br/>Invite friends to live the life you want in shared Homelands. You can try out weaving and tanning leather and make yourself new clothes; you can take care of your farm and treats your friends with a generous meal with different dishes; you can also breed and train high-quality mounts and become a happy rancher. With the Homeland’s free trading system, you can also become a merchant and place your excess materials at a stall.<br/><br/><br/><strong>Explore and dive into the dangerous Boss levels</strong><br/>Bosses are located in the secret realms of the continents where dangers and traps are hidden. You can team up with your friends and explore these areas together. Apart from fine equipment and weapons, teamwork and wisdom are also the keys to the battle. Remember to bring the potion you brewed for it can lower the difficulty of fighting the boss and make you more courageous in the thrilling battle.<br/>", "metacritic": null, "released": "2021-08-19", "tba": false, "updated": "2021-09-06T13:31:26", "background_image": "https://media.rawg.io/media/screenshots/661/661e181f56cd096899a805ccdc02865e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 23}, "playtime": 5, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 442, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["HIG"], "genres": ["Adventure", "RPG", "Casual", "Massively Multiplayer", "Indie"], "publishers": ["HIG"], "esrb_rating": null}