{"id": 650932, "slug": "metal-dogs", "name": "METAL DOGS", "name_original": "METAL DOGS", "description": "<h3>What is \"METAL DOGS\"?</h3>This game is a top-down 3D roguelike action game with a fighting \"dog\" as the main character.<br/>You can enjoy the exhilaration of shooting various weapons such as machine guns, cannons, and missiles, blowing away countless monsters, and battling with the mighty \"WANTED\"; all with simple controls.<br/><br/><h3>Game Features</h3><ul><li> A wide variety of weapons</li></ul>Weapons in three categories: machine guns, cannons, and S-E (special equipment) are your primary armaments.<br/><br/>Machine guns: Low power, but excellent rate of fire and reload speed.<br/>Cannons: Powerful, but with a small number of bullets and a slow reload speed.<br/>S-E: Special equipment such as missiles. Capable of ranged attacks.<br/><br/>Weapons can be freely assigned to 3 slots, so it is possible to customize your load-out according to your play style, such as \"attack power specialized type equipped with cannons in all slots\".<br/><br/><br/><br/><ul><li>Changing Dungeons</li></ul>The terrain and treasure chests change each time you play the dungeon.<br/>Therefore, even if you play the same map many times, you can have a different experience each time.<br/><br/><ul><li>Item Collecting</li></ul>Equipment such as weapons and armor will be randomly given additional effects.<br/>There are various types of effects, such as increased damage and magazine capacity.<br/>In addition, equipment has rarity, and the higher the rarity, the more additional effects will be given.<br/>The so-called \"hack and slash\" element of hunting monsters in search of better equipment is one appeal of this game.<br/><br/><ul><li>Post-Apocalyptic World View</li></ul>The setting is Japan after most of humanity has died due to the \"great destruction\". The base is a village at the foot of Mt. Fuji, which has been devastated.<br/>The hero \"Pochi\" who was revived by the mysterious old scientist \"Dr. Minchi\" will search for his master who left him behind, and go an adventure through dangerous dungeons infested with ferocious monsters.<br/><br/><ul><li>The Terrifying \"WANTED\"</li></ul>Among the monsters, the ones that are especially dangerous are referred to as \"WANTED\", and a large amount of prize money is applied.<br/>Formidable opponents such as the elusive giant tank \"Rommel Ghost\" and \"Missileceros\", a rhinoceros equipped with strong armor and missiles, stand in the way.<br/><br/><ul><li>Cute Dogs</li></ul>The player can operate three cute \"dogs\".<br/>Shiba Inu \"Pochi\", Doberman \"Bell\", and Bulldog \"Bonanza\".<br/>Popular voice actor Hiro Shimono is in charge of the voices of the dogs, and he plays the three voices brilliantly.<h3>What's Included in Early Access</h3>・ Over 25 quests<br/><br/>・ More than 5 types of WANTED<br/>・ Over 35 types of weapons<br/>・ Play time exceeding 10 hours<h3>What is the \"Metal Max\" series?</h3>The setting is a post-apocalyptic world. Players ride on \"tanks\" that are the relics of civilization, hunt WANTED monsters in various places, and remodel their tanks with the prize money. A role-playing game series featuring a high degree of freedom.", "metacritic": null, "released": "2021-08-24", "tba": false, "updated": "2023-04-23T04:04:01", "background_image": "https://media.rawg.io/media/screenshots/fab/fab3602f6ce8f47f917416f45e3ee2e6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 11, "toplay": 1, "dropped": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 462, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["24Frame,inc."], "genres": ["Action", "RPG", "Indie"], "publishers": ["24Frame,inc."], "esrb_rating": null}