{"id": 650929, "slug": "embraced-by-autumn", "name": "Embraced by Autumn", "name_original": "Embraced by Autumn", "description": "Marcel is the illegitimate son of the famous actor Georges de Saint-Rémy, a celebrated virtuoso on the stage, and a notorious rake with a penchant for sleeping with other men’s wives. Owing to his father’s seedy reputation and his own meek, socially awkward mannerisms, Marcel is bullied relentlessly by the other boys at his Parisian school, who seem determined to make his life miserable.<br/><br/>At the beginning of autumn in 1896, Marcel’s brigand of a father becomes embroiled in a particularly salacious scandal, which is widely circulated in tabloids across Paris and beyond.<br/><br/>Fearful for her son’s welfare, and desperate for him to have a respite from their family’s continued drama, Marcel’s long-suffering mother pulls Marcel from his school, and instead chooses to send him to her older sister’s school in Myennes, deep in the French countryside. There is a catch in this seemingly innocuous plan, however. Marcel’s formidable aunt, Albertine, owns an all-girls’ establishment, which has never before admitted any male students. To attend his aunt’s school, Marcel is bidden to dress and act like a girl – which he does, albeit, begrudgingly.<br/><br/>Marcel never much fit in with his male classmates at his Parisian school, but he’s similarly fearful that his female classmates in Myenes will also shun him. Uneasy and afraid, Marcel expects only the worst when he arrives at his aunt’s school…<br/><br/>Which is why he finds it so very surprising when, rather than being treated with scorn, his new classmates instead seem rather fond of him.<br/><br/>During his stay in the countryside, Marcel meets four girls who express an interest in him: the quiet, inscrutable Luce; the fiery troublemaker, Claudine; the elegant pianist, Celine; and the class dunce, Mirabel.<br/><br/>As the autumn months pass, Marcel grows closer to these four girls – but which one will he develop the strongest bond with? That is up for the reader to decide.<br/><br/><br/><ul><li>200,000 words of text (approx 8-12 hours of reading)<br/></li><li>Four love interests with wholly unique routes<br/></li><li>Detailed character artwork<br/></li><li>An entirely original soundtrack<br/></li><li>A crossdressing protagonist<br/></li><li>Scenic depictions of the French countryside<br/></li><li>Happy endings!</li></ul>", "metacritic": null, "released": "2021-08-24", "tba": false, "updated": "2021-09-06T15:03:31", "background_image": "https://media.rawg.io/media/screenshots/ef6/ef603f87b3952a73827cedfc8a52fb23.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 366, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ebi-hime"], "genres": ["Casual"], "publishers": ["ebi-hime"], "esrb_rating": null}