{"id": 650992, "slug": "mightyys-fps-aim-trainer", "name": "Mightyy's FPS Aim Trainer", "name_original": "Mightyy's FPS Aim Trainer", "description": "The overall goal with Mightyy’s FPS Aim Trainer was to try to make the best Aim Trainer on the market. The Aim Trainer has basically every feature you’d expect from the other trainers while innovating and adding more features on top of that.<br/><br/><br/><ul><li><strong>Advanced Game Importing</strong> - Import a large collection of games into the aim trainer.<br/></li><li><strong>User Created Scenarios</strong> - Browse Online User Generated Content designed to help you practice and warm up.<br/></li><li><strong>Leaderboards</strong> - Climb the online leaderboards as you compete in challenges, replay the best scores from the leaderboard as well.<br/></li><li><strong>Replay System</strong> - Relive and rewatch your aim back as the aim trainer offers full replay support.<br/></li><li><strong>Aim Guides</strong> - Browse a collection of free aim guides from top fps players, who have thousands of hours of experience.<br/></li><li><strong>Full Map Editor</strong> - Create your own maps in the aim trainer. No need to download junkware or third party tools to create levels.<br/></li><li><strong>Most Advanced Statistic System</strong> - In Depth Statistic System gives you unprecedented access to your career progress and match history highlights.<br/></li><li><strong>Full Editing Controls</strong> - Create your own movements, characters, weapons, bots, abilities and maps in the aim trainer. <br/></li><li><strong>Endless Customization</strong> - Customize your hud and layout, hide and show specific elements and create color theming styles for the hud.</li></ul><h3>Supported Games and much more!</h3><br/>★ Apex Legends<br/>★ Call of Duty <br/>★ CS:GO<br/>★ Overwatch<br/>★ VALORANT<br/>★ Fortnite<br/>★ Rainbow Six Siege<br/>★ Team Fortress 2<br/>★ Warzone<br/>★ Diabotical <br/>★ Battalion 1944<br/>★ Splitgate <br/><br/><br/><br/><ul><li><strong>No Selling your data</strong> - Did you know that some free aim trainers are just free so they can sell your data for profits? They would rather forcefully buy out communities for the monopoly and data profits, rather than focusing on making a product that delights customers.<br/></li><li><strong>Feedback Matters</strong> - If something sucks or isn't right, let me know so I can improve it. The game is entirely funded by Mightyy so he doesn't have to answer to investors or have meetings to vote on certain features.</li></ul>", "metacritic": null, "released": "2021-08-26", "tba": false, "updated": "2021-09-06T15:50:30", "background_image": "https://media.rawg.io/media/screenshots/38d/38d441e59e20ef35fc8dce7f1b8c7c02.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 130, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mightyy"], "genres": ["Action", "Simulation", "Indie"], "publishers": ["Mightyy"], "esrb_rating": null}