{"id": 651081, "slug": "kuang-noshi-jie-crazy-world", "name": "狂の世界-Crazy World", "name_original": "狂の世界-Crazy World", "description": "<strong>1.  overview</strong><br/>After work, head to the station near the last train. However, something is wrong. I get on the train thinking so. Beyond that, a crazy different world full of death, madman and monsters awaited. There was a girl who got lost in another world as well as wandering in another world. She manages to find a way out of her and return to her original world with her girl.<br/><strong>2.  Game content</strong><br/>⑴ It is necessary to explore another world and find a means of escape while hiding yourself from madmen and monsters (in the grass, under a table, in a locker, etc.) or temporarily incapacitating with a gun.<br/>⑵ The heroine girl has a good feeling. Increase her liking by having proper conversations and giving away recovery items and lost items.<br/>⑶ If you eat or drink something from another world, the \"Yomotsuhegui value\" will accumulate, and if this accumulates above a certain level, you will not be able to return to the original world. This applies not only to players but also to heroines.<br/>⑷ There are three difficulty levels, easy, normal, and hard, and the amount of recovery items recovered, the amount of ammunition obtained, and the heroine are different.<br/>⑸ Heart items (5 for each difficulty level) for releasing the heroine's swimsuit costume are placed at various places on the stage.", "metacritic": null, "released": "2021-09-01", "tba": false, "updated": "2021-09-06T17:06:16", "background_image": "https://media.rawg.io/media/screenshots/003/003deb6bad9f8847b450a8694dfaf866.jpg", "website": "http://nngame.web.fc2.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 232, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["NNゲーム工房"], "genres": ["Action", "Indie"], "publishers": ["NNゲーム工房"], "esrb_rating": null}