{"id": 65100, "slug": "funny-wings-vr", "name": "Funny Wings VR", "name_original": "Funny Wings VR", "description": "Fly with style in immersive beautiful environments. Chase the witch who has stolen all your rare artifacts.<br/><br/>From the makers of one of the best-selling games, Lost Twins.Features<ul><li> Original VR flying mechanic combining turning, gliding, ascending &amp; dipping - one if its kind<br/></li><li> Dodge different type of in-air obstacles in your path while collecting as many stars as you can<br/></li><li> Play with different characters, each with its own unique aura<br/></li><li> Multiple environments, each with its own unique paths &amp; vivid sceneries<br/></li><li> Simple touch controls to guide your flying character<br/></li><li> Enhance your character by using the crazy power-ups</li></ul><br/>All El-Diablo has ever wanted is to be accepted into the Council of OOO; a place where only the best wizards gather. With a foolproof plan to collect the rarest of magical artifacts, El Diablo zips and zooms through the world on his trusty glider, placing every item he has into his poochy pouch. However, the evil witch Verruca Bagboiler has managed to throw a wrench in El Diablo’s plans by stealing his poochy pouch. Now with your help, El Diablo must retrieve his pouch and prove to the world that he’s worthy of the Council. Maybe if he saves the world along the way, it won’t be so bad.<br/><br/>Have fun by joining the Steam's most unique flying game.", "metacritic": null, "released": "2018-03-30", "tba": false, "updated": "2019-08-28T21:54:35", "background_image": "https://media.rawg.io/media/screenshots/466/466530e20f637c543a5c383bac77fa95.jpg", "website": "http://www.werplay.com/view_games.php", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 12}, "playtime": 1, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 291, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["weRplay"], "genres": ["Action", "Adventure", "Casual"], "publishers": ["weRplay"], "esrb_rating": null}