{"id": 651054, "slug": "seed-of-the-dead-sweet-home", "name": "Seed of the Dead: Sweet Home", "name_original": "Seed of the Dead: Sweet Home", "description": "<strong>Slaughter the ghouls to save the girls!</strong><br/><br/>Build up your love nest and woo four heroines as you fight to survive a ruined zombie hellscape!<br/>Upgraded graphics, more content, enhanced gameplay and yes, even more...'that'...a complete renewal of everything!<br/><br/>A one-of-a-kind <strong>Post apocalyptic FPS dating sim game</strong> filled with intense zombie killing action and lusty romance!<br/> <br/> <br/><br/><strong>The end of the world has given you a shot at a new life.<br/>Will you make your life a heaven, or be dragged down to the bowels of hell...?!</strong><h3>Earn points and items fighting in intense FPS combat!</h3>Upgrade your base and buy new character skills by collecting items and points.<br/>Blast away at zombies to rack up kills and create a whole new you!<h3>Get tender with lovely heroines back at Home Base!</h3>Give them presents and make conversation to build a relationship.<br/>The closer you become, they more of them you will see out on the battlefield!<br/>Then, once you win the affection of your favorite girl, unlock special intimate events<br/>and really bring your relationship to the next level!<br/>　<h3>Heroines</h3><br/><strong>Hikari Kondo</strong><br/>The bright and smiling leader of the bunch.<br/>Physically and mentally fit, Her experiences as a track-and-field athlete have been the key to her survival.<br/>She normally faces any challenge with a smile, but lately she appears distraught thinking about the past...<br/><br/><br/><strong>Aya Kagano</strong><br/>The discipline master of Home Town. The mature and reliable missus.<br/>A former medical school student, she uses her cunning instinct and many talents to make Home Town a better place.<br/>Trusted by her friends and colleagues, she fulfills many crucial roles in running Home Town.<br/><br/><br/><strong>Kirara Suzune</strong><br/>The popular face of the group.<br/>wields a giant weapon capable of mowing down throngs of enemies with ease.<br/>Beloved for her caustic in-your-face attitude, this girl doesn't back down from anything or anyone.<br/><br/><br/><strong>Ichika Hazuki</strong><br/>The Mysterious sniper in a cat ear hoodie.<br/>A girl who doesn't open her heart to anyone and prefers fighting solo.<br/>She rarely speaks except for when she's threatening others with violence. Could she be hiding something...?<br/>　<h3>Features</h3><ul><li>Eight high-powered stages<br/></li><li>4 gorgeous and delightful heroines<br/></li><li>Over 40 different heroine interaction scenes <br/></li><li>Four difficulty levels<br/></li><li>More than 30 different types of weapons<br/></li><li>Four types of bonus outfits<br/></li><li>Over 100 different kinds of items<br/></li><li>Expand your in-game hub with over 7 kinds of additions<br/></li><li>More than 50 different trainable skills<br/></li><li>15~30 hours of play time</li></ul>", "metacritic": null, "released": "2021-08-27", "tba": false, "updated": "2024-04-03T17:26:30", "background_image": "https://media.rawg.io/media/screenshots/156/156dc7fdb5fff7ab077d588813f91d04.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 14, "beaten": 1, "toplay": 4, "dropped": 3, "playing": 1}, "playtime": 3, "achievements_count": 17, "ratings_count": 2, "suggestions_count": 594, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["TeamKRAMA"], "genres": ["Action"], "publishers": ["Eroge Japan"], "esrb_rating": null}