{"id": 651063, "slug": "dragon-question", "name": "Dragon Question", "name_original": "Dragon Question", "description": "Dragon Question is an edutainment software that combines mathematical exercises with the defense genre.<br/>\n<br/>\r\nYou are Archmage Ryn, tasked with guarding the millennial kingdom of Mathateria.<br/>\r\nDefend the gates by solving math problems from hordes of monsters.<br/>\r\nDefend all four gates before a showdown with Isaac, the dragon of doom, and the main culprit behind the chaos.<br/>\n<br/>\r\nYou will come across math problems in three forms.<br/>\r\n1. Simple problem solving - General Battle<br/>\r\n2. Quick-fire questions where you have to guess the right answer - Special Magic Time<br/>\r\n3. Solve three questions and enter them in order of numbers - Final Boss Battle<br/>\n<br/>\r\nRyn uses three  types of magic.<br/>\r\nEarth magic deals physical shock.<br/>\r\nIce magic blocks enemies behind you.<br/>\r\nFire magic deals damage to enemies in front of and behind you.<br/>\r\nMagics can be upgraded to Level 3, switch between them according to situation.<br/>\n<br/>\r\nEven the explanation looks difficult, huh?<br/>\r\nThere are three levels of difficulty in Dragon Question.<br/>\r\nThe lowest difficulty level was created easy enough even for elementary school students to enjoy.<br/>\r\nBut just because it's called 'easy' doesn't mean it is a piece of cake.<br/>\r\nEach wave and stage will have ever-changing difficulty, so you can feel a great sense of achievement when you complete it.<br/>\r\nIt has been designed to improve math skills while providing a challenge with a sense of achievement.<br/>\r\nThere are also normal and hard difficulties, for users who have general mental arithmetic skills and those who are skilled in mental arithmetic respectively.<br/>\r\nIn addition, there are also modes where you can practice addition, subtraction, multiplication and division.<br/>\n<br/>\r\nWe hope you enjoy getting to know math with Dragon Question.", "metacritic": null, "released": "2021-09-02", "tba": false, "updated": "2021-09-06T16:51:20", "background_image": "https://media.rawg.io/media/screenshots/f19/f1995945cd2beb5c45aec6c599ee0973.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 168, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Game Museum"], "genres": ["RPG", "Indie"], "publishers": ["Game Museum"], "esrb_rating": null}