{"id": 651008, "slug": "phantom-thief-sylphy", "name": "Phantom Thief Sylphy", "name_original": "Phantom Thief Sylphy", "description": "Phantom Thief Sylphy is a stealth adventure game. Sneak, evade capture and solve puzzles as you steal from and expose the corruption of the rich and powerful. Try not to get caught though, lest you become another victim.<br/><br/>This game is a spin off/prequel for Abyssal Agent Alyss and includes Sylphy's first brush with the supernatural. She and her hacker partner: Voyeur work together to solve a missing person case. Unlike Abyssal Agent Alyss, this game is not an rpg.<h3>Gameplay</h3><br/>Run around, avoid detection, swing to new heights with Sylphy's Grapple Gun. If She has nothing to defend herself her clothes will be torn off and she'll be captured. but after the lewd scene she'll escape and continue unless something more permanent occurs.<h3>Features -</h3><br/>Live2d sex animations<br/><br/>Casual difficulty, only certain fail states result in a game over. but you can also savescum if you encounter difficulties.<br/><br/>Simple and Fun stealth gameplay with puzzle solving. Understanding the layout of a level can also be integral to progression.<br/><br/>A plethora of pleasure for our pretty &amp; plump protagonist should you fail to evade capture.<br/><br/>Unlockable gallery upon completion.<br/><br/><br/><br/>Phantom Thief Sylphy is made with RPGMaker MV.<br/><br/>Native resolution - 1200x720 (because tiles are 48x48)", "metacritic": null, "released": "2021-08-31", "tba": false, "updated": "2021-09-06T16:05:23", "background_image": "https://media.rawg.io/media/screenshots/626/626e6bfd85b6a38341fdb12c93a45f3a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 224, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Azurezero"], "genres": ["Action", "Adventure", "RPG"], "publishers": ["Azurezero"], "esrb_rating": null}