{"id": 651072, "slug": "si-ji-deathly-stillness", "name": "死寂（Deathly Stillness）", "name_original": "死寂（Deathly Stillness）", "description": "<ul><li>A nervous and a little bit of horror of the third person shooting zombie game<br/></li><li>Complete the quest to kill all the zombies (plot may be added later)<br/></li><li>Unless you have super high marksmanship, you'll need to search the scene for ammunition supplies<br/></li><li>5 or more melee attacks will trigger a skill that can kill a zombie in one blow<br/></li><li>There are no health packs, which means you have to keep an eye on your health<br/></li><li>There are two maps and weapons of different difficulty for players to choose from<br/></li><li>This is beta 2.2, with a total development time of 13 days<br/></li><li>The game is bilibli Chen Jiancheng tutorial case game, not a formal game<br/></li><li>Because time is limited, the gameplay is simple: kill every zombie you see</li></ul><br/><strong><h3>Game Development History:</h3></strong><br/><ul><li>The game came out of a live broadcast by Bilibili, half an hour to Make a Zombie Game.<br/></li><li>although the challenge failed, but spent 3 days to slightly improve the game, free open to fans to try<br/></li><li>As more people played and I got more feedback, I spent a total of 10 days perfecting the game completely<br/></li><li>In order to better display the game, I made a website to release some free games for fans to play<br/></li><li>Finally, because of the slow download speed of Baidu online disk, I resolutely paid 100 dollars to register as a Steam developer and release the game here for everyone to play<br/></li><li>It took me another 3 days to fix a lot of details and bugs because I had to release Steam</li></ul>There are many imperfections in the game, and there is no story, so I'm going to share it with you for free just for fun!<br/><br/><strong><h3>Development cost:</h3></strong><br/>The total development cost of the game (excluding the time cost) includes purchasing model resources + server fees + Steam developer deposit =8137.31￥<br/><br/><strong><h3>Q&amp;A</h3></strong><br/><strong>Why was the game released and released on Steam?</strong><br/>It's not an official game, it's a teaching case, just to give my fans who support me and want to play my game a way to download it quickly<br/><br/><strong>Do you plan to improve the game in the future?</strong><br/>- there is a plan to continue the development if the players' expectations are high, because it is an amateur production and the development will be slow<br/><br/><strong>Why should the game be free?</strong><br/>Because I knew the game had a lot of flaws, and it took a short time to make, but it was complete<br/>Part of the reason is that if the game is paid and the player is the consumer, but if the game is free AND I have a relaxed state<br/><br/><strong>What development experience do you have?</strong><br/>By 2021, I have 4 years of experience using Unreal Engine, 2 years of experience teaching Unreal Engine, and in 2019, I was certified as an Unreal official instructor. This game is not all of my strengths<br/>If you want to learn Unreal 4, Bilbili searches uE4 and the first one is my tutorial<br/><br/><strong>What did you do in this game?</strong><br/>In addition to the characters and scene models I paid for, THE UI, UI interaction, functional logic, character movement system, pickup system, shooting system, damage system, scene atmosphere, AI system, game optimization, etc., were all done by myself. There was no need to apply any template<br/><br/>In the end, thank you for playing the game. I am aware of many shortcomings, but these improvements need time and energy. I am happy to share my game, but please respect the results of my labor.", "metacritic": null, "released": null, "tba": false, "updated": "2023-08-08T20:26:01", "background_image": "https://media.rawg.io/media/screenshots/c75/c75a4791a935e447a97dd11c1e818453.jpg", "website": "http://www.xmcjc.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1, "dropped": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 504, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["谌嘉诚"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["谌嘉诚"], "esrb_rating": null}