{"id": 651079, "slug": "wo-fan-dui-zhe-men-qin-shi-im-against-this-marriag", "name": "我反对这门亲事-I'm against this marriage", "name_original": "我反对这门亲事-I'm against this marriage", "description": "①Lets begin with the game story:<br/>Guonong Xiao, a husband and father who maintained the routine of 9:00 in the morning and 9:00 in the evening during the long working years. It cannot be recalled when he became hot-tempered and bad-tempered, he acted as the boss in front of his family and dog in front of the leader.<br/><br/>Xiao supported his family with suffering, struggling, and looking forward to retirement and liberation. Unexpectedly, when he was 43 years old, his wife asked for a divorce. His company dismissed him, and his daughter even fell in love with a \"kept man\" who wanted him to pay 400,000 dowry money.<br/><br/>One night, he accidentally learned of his future from a weird mouse, that is, his house was deceived by the “kept man”. Even if he can't fully believe it, Xiao's hatred for this son-in-law made him determined that he must break his daughter up with the “kept man”!<br/><br/>Within 2 years, change the destined ending and let Xiao’s daughter leave the “scumbag”.  At the same time, whether Xiao can become frank and straight with his relationship with his wife, stop inconstancy, and change the trajectory of life, all this is up to you!<br/><br/>②About game planning.<br/>For the time being, there are only 4 female characters that can be planned in the game. The main goal of the player is to make money. The player can either choose to make money and collect 400,000 yuan in daughter’s dowry money so that the daughter can get married in the end, or go to the detective and pool money step by step to find a way to make the detective find the flaws in the \"kept man\", so that his daughter and the “kept man” broke up. But no matter which two points, it will not be easy for the player.<br/><br/>③About the game's money system.<br/>There are two ways to make money in the early stage of the money system——<br/><br/>1.Become a market vendor who do commodity reselling, earn the difference between middlemen. (This will bring more income than work.)<br/><br/><br/>2.There will be many pitfalls when the player is finding a job. There may be many scam companies that will make you lose your money and your job. However, the reason why this module exists is that a connection system will be added in the future, but it will not be launched in the early stage. The follow-up connection system will lead to new projects, so finding a job will be very important in the later stages.<br/>In addition, here displays something which will be prepared and arranged in follow-up stage-(early only the mailbox and work functions are available.)<br/><br/>It is expected that after logging in to the game, the icon <br/>and fishing functions will be finished in two weeks.<br/>At present, the icon function has been completed——<br/><br/>After the fishing function is on the settings, if you participate in the first year of the competition and get the first place, the mermaid character will be unlocked and you can conduct the mermaid strategy.<br/><br/><br/>There is also a marriage market. After the daughter breaks up, the player can go to the marriage market to set her up with someone (it is also possible before the breakup, but it will lead to a worse relationship with his daughter) ——<br/><br/>In addition to looking for a son-in-law, players can also go to the marriage market to find another lover (don’t forget to buy gifts).<br/><br/>The countdown to the game is 2 years, and player operations are calculated based on week. The background room of the main interface will change according to the house the player buys.<br/><br/><br/>We also thought about many other functions. We will develop text messages, connection with friends, writing novels, opening online stores, opening physical stores, making movies, and various entrepreneurial projects and unlocking female characters related to entrepreneurial projects.<br/>The current CG of the game is as follows (because the game is made by two people, we are not financially sufficient, and the translation and painting will be updated after the later game income is higher):<br/><br/><br/><br/>In addition, the main task will be triggered in different weeks——<br/><br/>Thank you for your kindly support!!", "metacritic": null, "released": "2021-08-31", "tba": false, "updated": "2021-09-06T17:04:19", "background_image": "https://media.rawg.io/media/screenshots/3d4/3d4532601e0a38b13c153f7fbf7355de.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 291, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["闪金游戏"], "genres": ["Casual", "Indie"], "publishers": ["闪金游戏"], "esrb_rating": null}