{"id": 651155, "slug": "squirrelmageddon", "name": "Squirrelmageddon!", "name_original": "Squirrelmageddon!", "description": "Squirrelmageddon! is a 3rd Person / 1st Person, dark humour, sci-fi, run and gun, high score wave shooter for 1-4 LAN or ONLINE players.<h3>The year Is 2184</h3><br/>Climate change has forced humans to live underground for many years.  In our absence, squirrels have become the new apex predator on the planet.<br/><br/>Sometime during the last great war the squirrel experiments began.  From what we know, genetically modified squirrels, intentionally infected with an engineered strain of super virus, were to be unleashed upon our enemies.<h3>'I want squirrels of the highest caliber, with a killer instinct, that can withstand being dropped out of drone bomber at 1000 meters!!!' - General Dixon</h3><br/>The Squirrel bio-weapon was designed to do but just one thing - clear entire continents of all human life... They did just that... and more.<br/><br/>It was in the great cities where the first waves of carnage began.  Humans are delicious, it would seem.<br/><br/>It took many years for the squirrels to make it far out into the remote areas of the globe, where some humans managed to to survive for longer than the city folk... even so, it was only a matter of time before their fates too, were sealed.<br/><br/>Over the last 100 years, driven by a rabies like insanity and a genetically instilled lust for meat, squirrels have killed almost every living creature on the planet.<br/><br/>Deep within the bowels of the earth, vast government and privately built complexes now contain what little is left of the human race.<h3>The year is 2184 and the world above has changed.</h3><br/>Nature has once again taken over the earth and re-balanced herself.  Drones are sending back images daily of a reborn and revitalized world.  We are ready to build a new future for humankind.<br/><br/>Yet... as always, this future would be one we would have to fight for.<br/><br/>Early expeditions above ground proved disastrous. Even with our power amour and advanced weaponry, experienced soldiers were proving no match for the enemy.<br/><br/>Though once we knew what to expect in combat, future expeditions gradually made it further and further into the field. <br/><br/>Yet time and time again... radio silence.<br/><br/>It's your turn now. You've been sent top-side and your orders are clear:<br/><br/>Find a way to eradicate the enemy.<br/><br/>You are ready, and you know what to expect. The others have given it a name... they call it:<br/><br/>Squirrelmageddon!", "metacritic": null, "released": "2021-09-02", "tba": false, "updated": "2021-09-06T18:03:01", "background_image": "https://media.rawg.io/media/screenshots/d60/d6041e68596e48c310ba3315b342751f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 63, "ratings_count": 0, "suggestions_count": 298, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Other Account Games"], "genres": [], "publishers": ["The Streets Network"], "esrb_rating": null}