{"id": 651101, "slug": "super-woden-gp", "name": "Super Woden GP", "name_original": "Super Woden GP", "description": "Will you be able to reach the top of the motorsport world?<br/>\r\nYour story at Super Woden GP will start from the lowest in terms of resources and budget. With this, you must get a cheap vehicle and sign up for some races to start being someone and acquire better vehicles and advance to the top of the motor world.<br/>\n<br/>\r\nChampionships, Rallys, weekend events, arcade mode, endurance races ... In Super Woden GP you will race in all kinds of competitions!<br/>\n<br/>\r\n■ An intuitive main map where you will have access to a multitude of possibilities.<br/>\n<br/>\r\n■ A huge number of vehicles of all kinds, from compact cars, rally cars, or fast prototypes. You can buy them with the credits you earn as you compete, or even unlock hidden vehicles.<br/>\n<br/>\r\n■ 6 vehicle manufacturers from different parts of the world, each with its own history and style.<br/>\n<br/>\r\n■ Repaint any vehicle at the shop.<br/>\n<br/>\r\n■ Vibrant graphic section that stands out thanks to the artistic style and various display modes.<br/>\n<br/>\r\n■ Wide variety of scenarios; like deserts, snowy landscapes, cities, forests and more.<br/>\n<br/>\r\n■ Powerful soundtrack, by Franikku Music and Incognito Devito.<br/>\n<br/>\r\n■ Local multiplayer for up to 4 players in split screen.", "metacritic": null, "released": "2021-09-01", "tba": false, "updated": "2023-11-12T12:01:17", "background_image": "https://media.rawg.io/media/screenshots/04f/04f92a06edb1c9cc6c8aaabb10f644a9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 36, "beaten": 1, "toplay": 2, "dropped": 1, "playing": 2}, "playtime": 1, "achievements_count": 39, "ratings_count": 2, "suggestions_count": 393, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC", "Linux"], "developers": ["ViJuDa"], "genres": ["Sports", "Racing", "Indie"], "publishers": ["Vijuda"], "esrb_rating": null}