{"id": 651104, "slug": "little-sim-world", "name": "Little Sim World", "name_original": "Little Sim World", "description": "<strong>Little Sim World</strong> is an indie Open World 2D Life Simulator with RPG and multiplayer elements that has been in development since early 2019 for the PC. Little Sim World is being made by Terry along with a few friends who have a passion towards the Sims genre. It is unique in design, but also takes much inspiration from the likes of The Sims, Animal Crossing, Stardew Valley and Pokemon.<br/><br/><strong>Little Sim World </strong>is set in the heart of London with streets bustling full of cars, NPCs and all sorts of busy shops. The entire world at your disposal with no loading or transition screens. Recreate yourself and live a life where every day is different. Design and decorate your dream home and live the way you want! There is a whole selection of shops to visit with styling that reimagines London.<br/><br/><strong>Create the house of your dreams:</strong> Decorate, buy furniture and upgrade your house!<br/><strong>Discover yourself:</strong> Develop your personality and reveal who you really are!<br/><strong>Start a career:</strong> Chase after the career of your dreams - the possibilities are endless ~ <br/><strong>Fall in love: </strong>Be part of the community, meet someone new and find your significant other!<br/><strong>An open world: </strong>No loading screens, visit everywhere you want!<br/><strong>Cars, buses and the underground: </strong>Want to get around faster? Travel however you want.<br/><strong>Weather and different seasons:</strong> Every day is slightly different! <br/><strong>Play with others (optional!):</strong> Share a room with your friend! Why play alone?", "metacritic": null, "released": null, "tba": false, "updated": "2021-09-06T17:27:10", "background_image": "https://media.rawg.io/media/screenshots/112/112cb5a9ee04e7a1b2e4fb774c5c0321.jpg", "website": "https://lsw.gg//", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 305, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Team LSW"], "genres": ["Simulation", "Indie"], "publishers": ["Team LSW"], "esrb_rating": null}