{"id": 651144, "slug": "malum", "name": "Malum", "name_original": "Malum", "description": "Malum is a co-op horror survival game for 1-4 players. Solve procedural puzzles in abandoned soviet bunkers, dank sewers, insane asylums and more all while being stalked by a gruesome collection of demons and monsters. Run, hide, scream; but whatever you do, don't miss.<br/><br/>Assemble a squad and explore the world’s darkest corners, each with its own resident evil. Find the clues and assemble artifacts to summon a weapon powerful enough to blast the Demons back to where they came from.<br/><br/>Each Demon has its own set of abilities and twisted logic. Some taunt and trap while others scream and charge. You’ll have to learn their strengths and weaknesses in order to evade them until you have that weapon in your hands. And when you do... <strong>the only thing they’ll fear is you</strong>.<br/><br/><h3>Features</h3><ul><li><strong>Tons of replayability</strong><br/>The Procedural Horror Director will keep you going with unpredictable behaviour, randomised items and other things that hide in the dark...<br/></li><li><strong>The Hordes of Hell</strong><br/>With their own AI behaviours, abilities and twisted, taunting logic, these Demons won't give up until you're all dead.<br/></li><li><strong>Multiple playable characters</strong><br/>Including Jeff, the team's token Furry.<br/></li><li><strong>Multiple difficulty settings</strong><br/>Make the game as accessible or challenging as you want.<br/></li><li><strong>Positional Voice Chat</strong><br/>Not for the weak of heart.<br/></li><li><strong>Live Game</strong><br/>The game will be supported through launch with more maps and Demons added, all free and included in the game’s base price.</li></ul><br/><h3>Warning</h3>This game contains flashing lights that may make it unsuitable for people with photosensitive epilepsy or other photosensitive conditions. Player discretion is advised.<br/><br/>This game is hard. It will make you scream. You have been warned.<br/><br/>Join us on Discord!<br/>https://discord.gg/ffqJZvBn9m", "metacritic": null, "released": "2021-09-02", "tba": false, "updated": "2021-09-06T17:53:48", "background_image": "https://media.rawg.io/media/screenshots/778/77897368a5bb06e5c08d11b7825a12d2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 25}, "playtime": 2, "achievements_count": 17, "ratings_count": 1, "suggestions_count": 285, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["MalumGames"], "genres": ["Action", "Adventure"], "publishers": ["MalumGames"], "esrb_rating": null}