{"id": 651250, "slug": "the-magister-demo", "name": "The Magister Demo", "name_original": "The Magister Demo", "description": "This game is part of the GOG Games Festival!<br/> Discover new releases, hot gaming deals, latest demos to try and a whole line-up of exciting upcoming titles that you can wishlist.<br/>\n\n\nThe Magister is coming soon! You can wishlist it here\n\n\n\n\n<br/>\n<br/>\n<br/>\nRandomly generated murder-mystery: A walkthrough won’t help here! The events, clues, motives, and murderer change with every playthrough. Only YOU can identify the guilty suspect.\n<br/>\n<br/>\n<br/>\nTactical card-based encounters: Your combat and negotiation skills are determined by the cards in your deck. Use a vast array of cards, such as ‘Heartstopper’, ‘Poison Slash’, ‘Weak Joke’, and ‘Long Talk’.\n<br/>\n<br/>\n<br/>\nPacify enemies for a peaceful outcome: Use ‘Tactical Diplomacy’ as an alternative to fighting and calm foes with your conversation cards to reduce their Rage level to 0.\n<br/>\n<br/>\n<br/>\nChoose your Magister: Different Magisters come with their own specialities and flaws. From cunning alcoholic to intelligent insomniac – every variation defines a different adventure.\n<br/>\n<br/>\n<br/>\nRecruit a human ally or furry companion: If needed, a Mercenary, Spy, or Sage can be recruited to assist in your investigation. You can also befriend one of the local cats or dogs to fight by your side in battles.\n<br/>\n<br/>\n<br/>\nSet in a captivating fantasy world: You have 14 days to wander Silverhurst and befriend or intimidate its inhabitants as you race against time to unmask the murderer.Developed by Nerdook Monster Slayers, Reverse Crawl, Vertical Drop Heroes", "metacritic": null, "released": "2021-08-18", "tba": false, "updated": "2021-09-06T19:17:39", "background_image": "https://media.rawg.io/media/screenshots/bad/bad4055338aa8161fa5c2331d6beb25f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 38, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 319, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Nerdook Productions"], "genres": [], "publishers": ["Digerati"], "esrb_rating": null}