{"id": 651242, "slug": "road-96-hitchhiker-bundle", "name": "Road 96 - Hitchhiker Bundle", "name_original": "Road 96 - Hitchhiker Bundle", "description": "The Road 96 Hitchhiker Bundle contains all you need to be a old and modern-times Petria connoisseur and to experience the Petria roadtripper life in the most authentic way! It contains the game Road 96, its OST and a game book that tells the story prior to the game.<br/>\n<br/>\nRoad 96<br/>\nRoad 96 is a crazy, beautiful road-trip. The discovery of exciting places, and unusual people on your own personal journey to freedom.<br/>\n<br/>\nAn ever-evolving story-driven adventure inspired by Tarantino, The Coen Brothers, and Bong Joon-ho. Made by the award-winning creators of Valiant Hearts and Memories Retold. Announced as part of the OMEN Presents initiative from HP Inc.<br/>\n<br/>\nMoments of action, exploration, contemplative melancholy, human encounters and wacky situations. Set against a backdrop of authoritarian rule and oppression.<br/>\n<br/>\nA stunning visual style, a soundtrack filled with 90s hits, and a thousand routes through the game combine so each player can create their own unique stories on Road 96.<br/>\n<br/>\nThe Road 96: Prologue game book<br/>\nMuch like the acclaimed book series of the 80s and 90s, it offers the reader to experience a literary adventure where you choose your path to adventure.<br/>\n<br/>\nRoad 96: Prologue takes place in the Road 96 video game universe – 10 years before the events of the game, to be specific. You do not need to play Road 96 to appreciate the book, or vice-versa, but the two bodies or work align, and they complement one another. Therefore you should expect to recognize places, events, and characters, and you will expand your knowledge of Petria.<br/>\n<br/>\nThe Road 96 OST<br/>\nA collection of evocative, nostalgia-laced tracks, that express where you are on your journey, by some of the most talented and well-regarded names in music. A blend of folk, pop, dance music, and electronica songs that stay with you long after you’ve finished the game.<br/>\nFeel the wide-open road, the peaceful landscapes, the broad skies, the colorful locals, moments of danger, a sense of wonder and the ever-changing world around you.", "metacritic": null, "released": "2021-08-15", "tba": false, "updated": "2023-03-23T05:58:39", "background_image": "https://media.rawg.io/media/screenshots/1aa/1aaff6aca535471cb532f4e72294ba31.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 494, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["Digixart"], "genres": [], "publishers": ["Digixart"], "esrb_rating": null}