{"id": 651274, "slug": "the-legend-of-heroes-trails-into-reverie", "name": "The Legend of Heroes: Trails into Reverie", "name_original": "The Legend of Heroes: Trails into Reverie", "description": "Where one trail ends, another begins...<br />\nThe intertwining fates of three figures in Zemuria will be decided in this climactic chapter of The Legend of Heroes series! Follow the footsteps of the war hero Rean Schwarzer, the liberator Lloyd Bannings, and the masked enigma &quot;C&quot;, and switch between each of their paths freely with the Crossroads system.<br />\n- Lloyd Bannings, leader of the Crossbell Police Department’s Special Support Section, finds himself fighting for his city&#39;s freedom once again after Crossbell&#39;s independence celebrations are interrupted by the sudden reappearance of an old threat.<br />\n- Following the events of the Great Twilight, Erebonian hero Rean Schwarzer and his students return to life at the branch campus. However, this fleeting peace is disturbed by the emergence of a new threat.<br />\n- When the former governor general of Crossbell suddenly returns and lays claim to the city state, four figures carry out a secret mission to investigate his actions. Their leader is &quot;C,&quot; a masked individual who seems to be using the same codename as the leader of the Imperial Liberation Front. But to what end?<br />\nKey Features<br />\nA Trio of Trails: Experience three different story arcs and switch between them any time with the Crossroads system. Plus, discover side episodes to fully flesh out the characters and world of Zemuria.<br />\nReverie into Reality: Enter the True Reverie Corridor, which allows you to encounter and recruit new characters from across Zemuria, enter randomly generated dungeons to test your mettle, and play a variety of mini games.<br />\nParagons of Combat: Utilize Arts, Brave Orders, and cunning tactics to prevail in battle. Master the new United Front system and harness the power of your entire team to decimate enemies while empowering yourself.</p>", "metacritic": null, "released": "2023-07-07", "tba": false, "updated": "2024-01-06T05:05:40", "background_image": "https://media.rawg.io/media/games/6b4/6b45e71c67bc54f7a3c2a943aea46e3d.jpeg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 7, "owned": 10, "beaten": 7, "toplay": 35}, "playtime": 0, "achievements_count": 37, "ratings_count": 2, "suggestions_count": 538, "game_series_count": 13, "reviews_count": 2, "platforms": ["PC", "Nintendo Switch", "PlayStation 5", "PlayStation 4"], "developers": ["Nihon Falcom", "PH3"], "genres": ["Action", "RPG"], "publishers": ["NIS America"], "esrb_rating": null}