{"id": 651254, "slug": "shardpunk-verminfall-demo", "name": "Shardpunk: Verminfall Demo", "name_original": "Shardpunk: Verminfall Demo", "description": "This game is part of the GOG Games Festival!<br/> Discover new releases, hot gaming deals, latest demos to try and a whole line-up of exciting upcoming titles that you can wishlist.<br/>\n<br/><br/>Shardpunk: Verminfall is coming soon and can be wishlisted \nhere<br/><br/> \n\nDo you plan your route to reach the stack of boxes shielding you from the two rat snipers on overwatch? Or do you take the sole fusion core in your possession and hurl it at your enemies? You go with the latter and watch core’s powerful charge annihilate enemies that were blocking the way to a door. It’s a door that sadly won't budge. The door needed a fusion core inserted in its ever-hungry socket, the same item that you exploded to defeat your rodent foes.\n<br/><br/>\n<br/>\nSTORY\nThere has been an unexpected breakthrough during the long and exhausting siege of The Empire's Capital. The Rat Swarm managed to breach the walls and flood the city with vermin. You control a group of surviving city-dwellers who are trying to escape and rescue as many others as they can. They will need to scavenge the destroyed city for resources, fight off rat vermin, and escape safely from the city.\n<br/><br/>\n<br/><br/>\nYou will need to use every single tool at your disposal: every scrap of metal, fusion core, weapon upgrade, and medical supply to tend to the inevitable injuries. Push through three districts with progressively more vicious enemies, rising emergency levels, and supplies that dry up like blood from a decaying knife wound. Constantly on the move, you’ll search bodies and lockers only to realize that each detour means the Rat Swarm reinforcements are getting closer. The only respite is locked behind bunker doors that can only be opened with the most precious of all finds: the all-powerful fusion core. \n<br/><br/>\n<br/>\nCHOOSE YOUR MISFORTUNE\nHow will you deploy your fusion cores? You could use it as a super-powerful explosive to get rid of a five-rat-strong pack, but then you’ll lose the means to open a bunker door that will allow you to tend to injuries and fix up weapons.\n<br/>\nBLOW OFF SOME STEAM\nAll the guns in Shardpunk are energy-based, and once you get a specific number of shots in, you’ll need to cool it off. However, you can test your luck and attempt a fifth shot on that four-shot cannon. But if it backfires or overcharges, you’ll have to hope that there's still one turn left before that rat sniper gets his bearings.\n<br/>\nBUNKER DILEMMAS\nThe hiss of the heavy bunker door locking down behind you is only a part of the deal. It's never a matter of “is anyone hurt?” but rather “whose injuries require the most attention?” You’ll rarely be able to heal everyone and save some med kits for later. Who can keep fighting despite their wounds?\n<br/>\nDO YOU SPLIT?\nShould you keep all your troops moving at the same pace to find and reach the bunker door in one piece, or split the crew into groups and cover twice as much ground? You can scavenge more loot with the latter strategy, but you’ll risk your smaller squads getting cornered and wiped out by an enemy swarm.\n<br/>\nDRAFT A MOTLEY CREW\nShardpunk gives you loads of flexibility in putting together your crew of survivors. For example, you could go with the dependant Mycroft with his exoskeleton, powerful ground slam, and heavy cannon that holds more limited charges, or you could take your chance with Silas, a twice-shooting jerk. Sure, he hates everyone, but has a chance to blast two rats in a round.\n<br/>\nPICK YOUR TREE TO CLIMB\nGet a few kills in, pick up that experience, and reach a temporary zone to upgrade your skills. Should you invest in a larger area for the katana-wielding close combat, or put your skills in the shotgun spread? It’s yet another choice that will impact your experience.", "metacritic": null, "released": null, "tba": false, "updated": "2023-09-17T06:13:31", "background_image": "https://media.rawg.io/media/screenshots/80a/80a5c2a1ed951fecb5e9ae19cd741a81.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 30}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 240, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Clockwork Pile"], "genres": [], "publishers": ["Retrovibe"], "esrb_rating": null}