{"id": 651281, "slug": "dv-rings-of-saturn-demo-2", "name": "ΔV: Rings of Saturn Demo", "name_original": "ΔV: Rings of Saturn Demo", "description": "Hard sci-fi, top-down physics based space mining simulator. Master realistic spaceflight using true-to-life technology, upgrade your ship to best suit your flight style and hire a crew to assist you.\n<br/>\n<br/>\n∆VDelta-V, symbolized as ∆V and pronounced delta-vee, is the change in velocity that a spacecraft can achieve by using its entire propellant load.\n<br/>\n<br/>\n\n  The year is 2273\nThe unexpected discovery of valuable minerals within the rings of Saturn has sparked a thriving space excavation industry. You control an asteroid excavation ship hoping to make it rich out on the rings, but soon you find out that all is not as it appears. Experience a hard sci-fi story backed up with real physics and science.\n<br/>\n<br/>\n\n  Players say\"The way the lights on the ship light up the asteroids, the way even informational screens change when power goes out, the music that simultaneously carries emotions of loneliness, adventure, and mystery, all beautiful.\"\n<br/>\n<br/>\n\"[...]while this definitely is not my style of game, it is EXTREMELY well done for it's genre. The aesthetic and art style are simply awe inspiring.\"\n<br/>\n<br/>\n\"[...]love how the gameplay with keyboard/mouse AND gamepad is equally satisfying, while it 'plays' somewhat differently. [...] Having to constantly apply controls, to adjust speed, bearing, velocity is really fun, engaging and satisfying.\"\n<br/>\n<br/>\n\"Nice game, very captivating. The silence and mystery of space feels spot-on.\"\n<br/>\n<br/>\n\"I’m in love, I’ve been waiting for a game like this my whole life.\"\n<br/>\n<br/>\n\"[...]looks really really good! I love this kind of sims on where all is about precise control\"\n<br/>\n<br/>\n\n  Key Features<ul><li>Realistic top-down hard sci-fi space flight experience. Every aspect of gameplay is backed up by real science. Ships fly just as starships should. \n<br/>\n</li><li>Jump into action in seconds with autopilot assist or save fuel by manual thruster maneuvers. \n<br/>\n</li><li>Detailed ship simulation down to every subsystem - upgrade your ship, fix or even jury-rig broken systems on the fly. Every system failure will impact gameplay - adapt to survive in the hostile environment of space.\n<br/>\n</li><li>Discover the mystery of the Rings, or just try to get rich leading your excavation company. \n<br/>\n</li><li>Plan your strategy back on Enceladus Prime station. Sell your output, upgrade your ship, hire the crew and manage your company. </li></ul>\n<br/>", "metacritic": null, "released": null, "tba": false, "updated": "2021-09-06T19:42:37", "background_image": "https://media.rawg.io/media/screenshots/f23/f23f6da52433d3cfc10918a22a53584f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 35}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 242, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "macOS", "Linux"], "developers": ["Kodera Software"], "genres": [], "publishers": ["Kurki.games", "Kodera Software"], "esrb_rating": null}