{"id": 651381, "slug": "real-manager", "name": "Real Manager", "name_original": "Real Manager", "description": "Introducing – The Official Fantasy Soccer game!<br/><br/>Did you always think you can manage a Real Soccer team with Real Players and a Real Budget and be the best manager in your country?<br/>Well, now it’s OFFICIAL - In Real Manager you can!<br/><br/>Wait no more and take part in the most advanced fantasy football game there is!<br/>Show the world and your friends what you can do with real life players and a big budget:<br/><br/>JOIN THE OFFICIAL GAME IN 4 COUNTRIES AND START YOUR JOURNEY TO THE WORLD CLASS MANAGER TITLE<br/><br/>•\tPick your team’s name and branding.<br/>•\tBuild the best Fantasy Soccer Dream Team from real life players.<br/>•\tTrain your players by signing the right coaches and assign training sessions to improve your players abilities to gain more points. <br/>•\tInvite and challenge your friends and family for weekly competitions. <br/>•\tCollect incomes from your sponsors and hourly rewards.<br/>•\tCompete in the global ranking of the best Real Manager. <br/><br/>Don’t just watch soccer– Take a part in Real Manager’s community on social media networks at Facebook, Twitter and Instagram, and stay up to date on all the latest news, features and tips.<br/><br/>It’s your time to be more than just a fan – Start your Fantasy Football carrier today and enhance your sports experience.<br/><br/>Have a problem or a suggestion? We want you to tell us.<br/>Feel free to share with us at:<br/>http://www.funatix.club/#contact", "metacritic": null, "released": "2019-11-14", "tba": false, "updated": "2021-09-06T20:50:18", "background_image": "https://media.rawg.io/media/screenshots/104/104c1dd0ddc6cbbf688f946a40710e9d_zFz8UJr.jpg", "website": "https://www.real-manager.club", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 112, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Funatix"], "genres": ["Strategy", "Sports"], "publishers": ["Proyoli Gaming"], "esrb_rating": "Mature"}