{"id": 651320, "slug": "melty-blood-type-lumina", "name": "MELTY BLOOD: TYPE LUMINA", "name_original": "MELTY BLOOD: TYPE LUMINA", "description": "<ul>\n<li>This set contains both the MELTY BLOOD: TYPE LUMINA game as well as the MELTY BLOOD ARCHIVES content. Please be careful not to purchase multiple copies of the same item.  </li>\n</ul>\n<p>Early Purchase Bonuses:<br />\n- Additional Content: Arcueid Round Announcements<br />\nThese bonuses will be available to download for free until October 27.<br />\nCustomers who purchase the game after October 27 will be able to get the bonus content as paid DLC.</p>\n<p>Game Details<br />\nMelty Blood is reborn.<br />\nThis is the latest addition to the series of 2D fighting games based on TYPE-MOON&#39;s visual romance novel, Tsukihime.<br />\nThe curtain rises once more on dramatic battles played out with familiar characters from Tsukihime -A piece of blue glass moon-.</p>\n<p>◆ All-New Stories, Visuals, &amp; Characters<br />\nExplore an all-new MELTY BLOOD world from scenario writer Kinoko Nasu, based on the events of Tsukihime -A piece of blue glass moon-.<br />\nUnique story events for each character give each playthrough its own feel, adding to the overall experience.<br />\nVisuals have been updated with HD graphics, and include animation sequences by A-1 Pictures for special attacks.<br />\nDialog is fully voiced and will change depending on which characters are brought into battle, giving more insight into the characters&#39; interpersonal relationships.</p>\n<p>◆ Iconic Battle Systems<br />\nUse characteristic Melty Blood mechanics such as Aerial Combos, Shields, Magic Circuits, Arc Drives, and Last Arcs, as well as a few new powerful techniques under the Moon Skill system. On top of that, an all-new simple control system has been implemented to make the intense battles a little more manageable, while also maintaining a balance which will allow both seasoned veterans and new players alike to fully enjoy the world of Melty Blood.</p>\n<p>◆ Rich Customization &amp; Gallery Feature<br />\nCustomize your title, profile icon, and character outfits for battle. They can even be used in online matches!<br />\nCollect visuals, opening cinematics, music tracks, voices, pixel art, and more in the gallery. You’ll even be able to take a look at guest illustrations created by artists connected to TYPE-MOON titles.</p>", "metacritic": null, "released": "2021-09-29", "tba": false, "updated": "2023-11-06T17:58:22", "background_image": "https://media.rawg.io/media/games/5f5/5f5823e3eba2d204ad0500e24e9e6dbf.jpeg", "website": "https://meltyblood.typelumina.com/en/", "rating": 3.62, "rating_top": 4, "added_by_status": {"yet": 12, "owned": 141, "beaten": 6, "toplay": 14, "dropped": 8, "playing": 7}, "playtime": 5, "achievements_count": 92, "ratings_count": 13, "suggestions_count": 327, "game_series_count": 2, "reviews_count": 13, "platforms": ["PC", "Xbox One", "Nintendo Switch", "PlayStation 4"], "developers": ["Tamsoft", "FRENCH-BREAD", "Type-Moon", "GameLoop", "Lasengle"], "genres": ["Action", "Fighting"], "publishers": ["Lasengle"], "esrb_rating": null}