{"id": 651371, "slug": "logic-wiz-sudoku", "name": "Logic Wiz Sudoku", "name_original": "Logic Wiz Sudoku", "description": "Fun and brain-stimulating game. Play twelve different Sudoku variations in a single app. Thousands of beautifully hand crafted boards, multiple variations on a single puzzle, ranging from beginner to extremely difficult boards, are packed full of logic and entertainment and will take your Sudoku experience to a different level. Each board includes a different set of variants and presents a unique twist of brain challenging logic. We are adding new boards and variants frequently. Variants include: Classic, Killer, Sandwich, Palindrome, Thermo, Arrow, XV, Kropki, Non-consecutive, Diagonal, Chess King and Chess Knight. <br/><br/><br/><br/>Logic-Wiz Sudoku includes a well thought out design, is feature-rich and created with love by high-tech veterans and Sudoku enthusiasts.<br/><br/><br/><br/>The game is built with multiple quests. Each quest is highly entertaining, designed with adaptive difficulty progression to improve logical thinking and elevate brain power, processing speed, math skills,  and cognitive abilities.<br/><br/><br/><br/>Smart hints help and teach when you run into a hurdle. Visual hints are computed based on your progress in the game and will improve your playing skills.<br/><br/><br/><br/>Six game zones allow you to focus on your preferred Sudoku variations and logic development path. Variants with complementing logic are combined into a single zone. New zones are added frequently.<br/><br/><br/><br/>Rich game settings and error notification modes offer experience that match your personal playing style.<br/><br/><br/><br/>Create your own Sudoku, or get help solving Sudoku from a newspaper or magazine - ‘Solve Your Own’ allows you to use Logic-Wiz smart hints and beautiful user interface to help you proceed.<br/><br/><br/>BOARD/PUZZLE FEATURES:<br/><br/>- 12 Sudoku Variants: Classic, Killer, Sandwich, Palindrome, Thermo, Non-consecutive, Diagonal, Arrow, Kropki, XV, Chess King &amp; Chess Knight.<br/>- Thousands of beautifully hand crafted boards.<br/>- New variants and boards are added occasionally.<br/>- Multiple variants on a single board.<br/>- Multiple difficulty levels from beginner to expert.<br/>- Unique solution to each puzzle.<br/>- All boards designed and created by Logic-Wiz. <br/>- Sharpen logic, boost memory and increase brain power.<br/><br/>GAME FEATURES:<br/><br/>- Smart Hints to help and teach.<br/>- Gallery game view.<br/>- Play multiple quests &amp; games.<br/>- Light and Dark Themes.<br/>- Sticky digit mode.<br/>- Select multiple cells at once.<br/>- Multiple pencil marks styles.<br/>- Auto remove pencil marks.<br/>- Highlight matching digits and pencil marks.<br/>- Multiple error modes.<br/>- Performance tracking for each puzzle.<br/>- Statistics and Accomplishments.<br/>- Unlimited Undo/Redo.<br/>- Various cell marking options- highlights and symbols.<br/>- Combinations Panel for Killer and Sandwich boards.<br/>- User defined virtual cages in killer games.<br/>- Fully functional combinations panel for virtual cages(Killer).<br/>- Auto sum for multiple cage selection in Killer.<br/>- Track and improve solving time.<br/>- Board preview.<br/>- Six playing zones.<br/><br/>Logic Wiz Sudoku variants are arranged in 6 engaging playing zones. Each zone has its core variants, which appear in all the boards of that zone. For additional fun, thrill and challenge, some boards in the zone may include additional variants. Each zone has 5 difficulty levels: Beginner, Easy, Medium, Hard &amp; Expert. Once you select a zone and a difficulty level, the quest begins. <br/><br/><br/>Logic Wiz Team.", "metacritic": null, "released": "2021-03-09", "tba": false, "updated": "2021-09-06T20:43:46", "background_image": "https://media.rawg.io/media/screenshots/283/283c9a01ae4ab886ef0fae249a6dd51b_ehkUmMV.jpg", "website": "https://logic-wiz.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 84, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Logic-Wiz"], "genres": ["Board Games", "Puzzle"], "publishers": ["Logic-Wiz"], "esrb_rating": "Everyone 10+"}