{"id": 651364, "slug": "the-farming-game-3d", "name": "The Farming Game 3D", "name_original": "The Farming Game 3D", "description": "THE FARMING GAME®, a Monopoly style board game where players harvest crops with the roll of the dice, dodge droughts, uncertain markets and insects. Buy land, cattle, wheel and deal. Always different and always a challenge. Build the best farm in the county. A truly rewarding time that entertains, teaches and is just plain fun. An International award-winning game! Hundreds of thousands of copies sold. Fresh from the country. A classic family board game! So much fun, some people say it's the best game they've ever played, others call it addictive. This international award-wining game has sold hundreds of thousands of copies. So educational, it has been used by homeschoolers and thousands of schools around the world. So realistic, World Bank had it translated into Russian to assist farm privatization. Good clean wholesome fun. THE FARMING GAME ® is perfect for home on any rainy day or family get together, for a weekend up at the cabin, or down at the beach. A great gift for anyone, including yourself! One size fits all. PLOW THE BACK FORTY ON YOUR KITCHEN TABLE A board game is a dream machine, a vehicle to create an alternative reality. In THE FARMING GAME®, each player starts the game with 20 acres inherited from Grandpa. This property includes 10 acres in hay and 10 acres in grain. The 20 acres is not a large enough farm to make a living for a family, so each game farmer must also have a part-time job in town. With each completed trip around the game board you receive $5,000 from your year's wages to plow back into the farm. The object of THE FARMING GAME\" is to build your farm large enough to be able to quit the job in town, come home to be your own boss, and farm full time. If you can do that without going broke, you win the game! $250,000 in total net assets are required to win THE FARMING GAME®. The gaming track is the calendar year, with a square for each week. Crops are harvested by the roll of the dice (about as much control as real farmers feel they have over yields and prices received for their crops). In THE FARMING GAME®, there is enough acreage for six players to diversify into a hay, grain, fruit, or cattle operation. Each individual farm is capable of pasturing 20 head of cattle. If any player wishes to run more than 20 cows, he can try to lease one of the range units in the hills. Warning: This family game is so much fun it may become habit-forming!", "metacritic": null, "released": "2021-06-20", "tba": false, "updated": "2021-09-06T20:39:11", "background_image": "https://media.rawg.io/media/screenshots/152/152846a5e9d4e8511b02fb0a5c6f11c8.jpg", "website": "https://docs.google.com/document/d/1yJpqPKTEykztl_9zdgWpx9ruN23o9xBBYrlfTQtDYHI", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 193, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ryan Tensmeyer"], "genres": ["Simulation", "Board Games", "Educational"], "publishers": ["Ryan Tensmeyer"], "esrb_rating": "Everyone 10+"}