{"id": 651317, "slug": "street-outlaws-2-winner-takes-all", "name": "Street Outlaws 2: Winner Takes All", "name_original": "Street Outlaws 2: Winner Takes All", "description": "The stakes have just been raised! In this high-octane sequel, you have to prove your mettle in some of the roughest and most unforgiving drag and street races across the United States. Your success depends on how you perform, your strategy on modding your car, and how much reputation you ultimately earn along the way.<br/>\n<br/>\r\nThe Unreal Engine brings Street Outlaws to a whole new level of visual fidelity with improved lighting, textures, and everything else! You can customize your car, but you can also customize your team garage to truly make it your own. Along with the street racing seen on TV, you will also be able to participate in unique races and stunts all while interacting with your favorite cast members from the show! Do you have what it takes to be crowned the Winner Takes All National Champion?<br/>\n<br/>\r\n• 26 drag vehicles plus 5 challenge cars <br/>\r\n• 36 unique locations for races and challenge events<br/>\r\n• Over 250 parts for deep car customization including rims, parachutes, tires, window tints, tire smoke colors, as well as personal garage customization<br/>\r\n• Put up or shut up through the in-game race wager feature<br/>\r\n• Featuring Ryan Martin, Big Chief, AZN, Lizzy, Farmtruck and many more from the Street Outlaws TV show<br/>\r\n• Asynchronous multiplayer tournaments and leaderboards", "metacritic": null, "released": "2021-09-21", "tba": false, "updated": "2022-11-28T16:38:36", "background_image": "https://media.rawg.io/media/screenshots/bd0/bd0a338a9ddc307e37f3eceb54090474.jpg", "website": "https://streetoutlawsgame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 15, "toplay": 1, "dropped": 1}, "playtime": 1, "achievements_count": 18, "ratings_count": 1, "suggestions_count": 485, "game_series_count": 0, "reviews_count": 1, "platforms": ["Xbox One", "PC"], "developers": ["Team6 Game Studios"], "genres": ["Racing"], "publishers": ["GameMill Entertainment"], "esrb_rating": null}