{"id": 651341, "slug": "bubble-classic-shoot-pop", "name": "Bubble Classic! Shoot & Pop", "name_original": "Bubble Classic! Shoot & Pop", "description": "Bubble Classic: an addictive bubble pop adventure!<br/><br/>Match 3 to blast &amp; drop colorful balls in this addictive bubble shooter game! Explore caves filled with treasure as you blast your way to the top! Use your bubble shooter to break pots, collect gems, and more as you challenge a variety of levels!<br/><br/>Will you be able to finish the level before you run out of shots? Pop your way through challenging puzzles using a combination of skill, strategy, and luck. Enjoy hours of ball pop fun - perfect for killing time both at home or out and about!<br/><br/>Challenge yourself to get the highest score possible on each level, earning stars and coins with each success! An accurate guiding line will help you to make tricky shots off the wall. Aim, match, and shoot carefully to pop bubbles and drop as many as possible! Get combos to charge up special boosters and super-charge your shots!<br/><br/>Blast your way to victory in these free bubble pop games! <br/>Don't miss out on the chance for adventure, and download today!<br/><br/>HOW TO PLAY<br/>• Use the guiding line to aim your shooter and release where you want!<br/>• Match 3 or more bubbles to make them pop!<br/>• Use less shots to score higher and try to earn 3 stars.<br/>• Create powerful boosters &amp; items to help you blast through levels.<br/><br/>FEATURES<br/>• Daily spinner to earn coins or special boosters!<br/>• Hundreds of unique levels with various fun challenges!<br/>• Easy to learn but difficult to master.<br/>• No WiFi needed. Play anytime, anywhere.<br/>• Play everyday to get special rewards! <br/>• Shooting sounds and gorgeous visual effects.<br/>• Optimized for tablets &amp; smartphones<br/><br/>NOTES<br/>• Bubble Classic! Shoot &amp; Pop contains ads like video and house ads.<br/>• Bubble Classic! Shoot &amp; Pop is free to play, but you can purchase in-app items like coins.<br/><br/>E-MAIL<br/> contactus@puzzle1studio.com<br/><br/>PRIVACY POLICY<br/>https://www.puzzle1studio.com/privacy-policy/", "metacritic": null, "released": "2021-08-11", "tba": false, "updated": "2021-09-06T20:28:09", "background_image": "https://media.rawg.io/media/screenshots/c05/c05274871a81ae91181b4c10420a821f.jpg", "website": "https://www.puzzle1studio.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 96, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Puzzle1Studio,inc."], "genres": ["Board Games", "Puzzle"], "publishers": ["Puzzle1Studio,inc."], "esrb_rating": "Everyone 10+"}