{"id": 651335, "slug": "player-piano-plus", "name": "Player Piano Plus", "name_original": "Player Piano Plus", "description": "- “New and Noteworthy”  - Apple<br/>- “Stonking good fun” – appsummary.com<br/>- “My daughter played with it all day and announced that she learned how to play the piano”  - Customer Review<br/><br/>NOW –  on the iPhone and the iPad<br/><br/>Get ready for exciting FUN with your friends or alone with Player Piano Plus for the iPad and iPhone.  Even if you never took a Piano lesson in your life, this new iPad / iPhone Piano app allows you to play along or sing along with these extraordinary famous artists:<br/><br/>- Mark Farner - formerly of Grand Funk Railroad  (12 gold and 10 platinum records)<br/>- Mr. Steve - The music teacher host of PBS Kids<br/>- “Big Mike” Lynche – American Idol Finalist Season 9<br/>- Katelyn Epperly - American Idol Finalist Season 9<br/>- Ayla Brown - American Idol Finalist Season 5<br/><br/>Now with even more songs!  With your FREE download you will get everything you need to play the children classic, “B I N G O”; the beautiful classical piece, “Ride of the Valkyries”; and the Christmas classic “We Wish You a Merry Christmas.”  More songs are available to download now (39 total) and lots more is being produced with many great artists.  And, if you purchase songs on the iPad, they will also show up on this app on the iPhone.  No need to pay twice.<br/><br/>Just like a Player Piano, the sheet music will show each note as the Piano lights each key with full accompaniment and vocals.  But-- there is so much more and that is why we call it “PLUS”:<br/><br/>Fully Functional 61 key piano with incredible sound<br/>Play Along Sheet Music with Lyrics<br/>Sheet Music for easy Piano melody and a more difficult (iPad only) Piano melody", "metacritic": null, "released": "2010-12-07", "tba": false, "updated": "2021-09-06T20:25:10", "background_image": "https://media.rawg.io/media/screenshots/173/173bee86e597f663a8b2fed66c945a5f_0hfvLCn.jpg", "website": "http://www.PlayerPianoPlus.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 91, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Barrett Productions"], "genres": [], "publishers": ["Barrett Productions"], "esrb_rating": "Everyone 10+"}