{"id": 651386, "slug": "super-boxing-championship", "name": "Super Boxing Championship!", "name_original": "Super Boxing Championship!", "description": "Knock out your foes using a full body physics interaction system with simulated weight and collision.<br/><br/>Brawl against an infinite number of random opponents of all skill levels and backgrounds. Earn cash to unlock items such as outfits, hairstyles, and emotes! Battle in an exhibition match or an eight-man bracket tournament. <br/><br/>Build up a hall-of-fame worthy record while destroying any random opponent in your path during your exhibition matches, or earn as many trophies as possible through conquering the Amateur, Professional, and All-Star bracket tournaments!<br/><br/>Send your opponent rag dolling to the canvas with a powerful punch, or chip away at their health with a quick jab. Need to block a punch? Use your arms to protect that beautiful face of yours.<br/><br/>You have 11 physics based moves in your arsenal to utilize in your simulated boxing match:<br/><br/>Left Hook - Cock back that left arm and smash your opponents face!<br/>Right Hook - Load up that right hand and deliver a devastating blow!<br/><br/>Uppercut - Wind up a dangerous swift uppercut!<br/>Left Jab - Throw a quick left jab!<br/>Right Jab - Pop a fast right jab!<br/>Low Jab - Throw a quick body shot to push your opponent away!<br/>Lean Left - Slip away from any incoming attacks! <br/>Lean Right - Bend in closer to extend your reach!<br/>Block - Defend yourself against a barrage of punches!<br/>Step Right - Move toward your opponent for the kill!<br/>Step Left - Get out of range and retreat to safety!", "metacritic": null, "released": "2021-08-06", "tba": false, "updated": "2021-09-06T20:52:57", "background_image": "https://media.rawg.io/media/screenshots/947/9476952e028a1d894c425b06cf042b37_l9zenn6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 123, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Carson Brownlee"], "genres": ["Simulation", "Sports"], "publishers": ["Carson Brownlee"], "esrb_rating": "Teen"}