{"id": 651315, "slug": "dustwind-the-last-resort", "name": "Dustwind - The Last Resort", "name_original": "Dustwind - The Last Resort", "description": "25 years have passed since the ‘Awakening’ – a cataclysmic event triggered by a renegade artificial intelligence known as ‘Mainframe’. The AI’s robot armies targeted all other life forms on Earth. Humans won the war, but only barely. <br/><br/>The few survivors of this apocalypse now struggle to survive in the Wastelands. It’s a free-for-all here – a brutal time to be alive! While foraging for food in the Wastelands, you and your daughter are ambushed by Raiders. They torture you, rob you, and leave you for dead. But in a curious way, their murderous ambush invigorates you. Amnesiac and hopelessly out-gunned, you vow to save your daughter! But you must proceed with caution and choose your tactics wisely, or you won’t stand a chance! In the course of your adventures, you realize that it is not just your own destiny that is at stake – this is about so much more. <br/><br/>Dustwind - The Last Resort is a post-apocalyptic real-time tactical action game with demanding combat, hours of exploration and a moving story. The engrossing single-player campaign takes place in 16 gripping story missions. Roam the Wastelands in single-player mode, develop your own survival strategies, find weapons and equipment, adapt your character to your preferred way of playing, and become a leader in these dark times. Become the nameless heroine of the Wastelands!<br/><br/>Features:\r\n- Tactical combat: It takes a tactical mind and lightning-fast reflexes to survive combat in the Wastelands! \r\n- Clusterfun: Nothing is quite so satisfying as killing an enemy with a plunger you just fired straight into their face with your bow.\r\n- Single-player campaign: Play the moving campaign that tells the story of the nameless heroine. The story consists of 16 missions and takes about 10 hours.\r\n- Skirmish: Get ready for a wide range of thrilling isometric single-player maps in several game modes!\r\n- Optimized control elements and user interface to make your post-apocalyptic life in the Wastelands easier<br/><br/>\r\nRaces\r\n- Humans: The last survivors of the war and the aftermath. Normal people are rare in the world of Dustwind, but they still exist. <br/><br/>- Valkyries: Valkyries are specialized cybernetic melee units. Fast and resilient, their advanced nano-robot systems allow them to regenerate at inhuman speeds. When they attack, Valkyries can close their blades to boost their attack speed or open the blades to deal slower, but more far-reaching and devastating attacks which can even pierce thick armor. Valkyries are slightly more susceptible to EMP attacks than humans.<br/><br/>- Humanoids: These two-legged armored robots can use all regular weapons, just like humans (although maybe better). Their large multi-wavelength sensor units make them hard to hide from. However, their hydraulics make a lot of noise, so they aren’t exactly camouflage artists themselves either. Although tough to kill, they do have one weakness – EMP weapons can circumvent their thick armor and quickly render their delicate electronics useless.<br/><br/>- Titans: A Titan cyborg is as close to being a walking turret as it gets. Titans can soak up a lot of damage, have nanobot-enabled regeneration abilities and use no time to reload their specialized guns - which are essentially modified vehicle cannons. And even without any guns installed, getting punched by a Titan is like getting hit by a car. Being Winded or Encumbered has no effect on Titans whatsoever. Breaking just one arm or leg also doesn't bother them - only damaging both arms or legs will cripple a Titan. On the downside, these fearsome death machines are so heavy that they can only slowly walk, even when undamaged. Also, their Stealth is horrible, and their resistance against all forms of non-kinetic damage is shoddy at best.<br/><br/>- Dogs: Dogs are fast, keen reinforcement units which drive vehicles, heal people, set and disarm traps, repair stuff, throw grenades, sniff out hidden enemies to bite them in the rear, and much more. The only thing they CAN’T do is use (most) human weapons.<br/><br/>- Sewer Dwarfs: These blood-thirsty carnivorous mutants usually lurk in small packs in the dark places below ground. They are not hard to defeat unless they surround you. These wretched, ugly creatures seem to be some kind of mutated human. However, nobody has tried to find out more about them because any curiosity is generally met with guns and axes.<br/><br/>- Many more mutants: Common animals affected by the radiation have adapted to the Wastelands.", "metacritic": null, "released": "2021-09-15", "tba": false, "updated": "2021-09-06T20:13:19", "background_image": "https://media.rawg.io/media/screenshots/2ed/2ed9690751f2e58ad35c5be7f606f3ab_pBOs8uk.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 585, "game_series_count": 0, "reviews_count": 0, "platforms": ["Xbox One"], "developers": [], "genres": [], "publishers": [], "esrb_rating": null}