{"id": 651383, "slug": "endzone-franchise-manager", "name": "ENDZONE Franchise Manager", "name_original": "ENDZONE Franchise Manager", "description": "ENDZONE Franchise Football Manager is an all-new way to experience a Mobile Football Management Game on the go. <br/><br/>Pick and lead your team through exhibitions, seasons, and championship bowl matches all the way to become a Legendary Franchise Football Manager.<br/><br/>FEATURES<br/>- A realistic and authentic football manager experience<br/>- Take over as the General Manager (GM) of a football franchise team<br/>- Play with today's Football Superstars and Legends in your roster<br/>- Rise to fame in the brand-new State Bowl and National Bowl Championships<br/>- Partner with friend’s football clubs<br/>- Play with managers across the world in Online Multiplayer leagues and championships<br/><br/>ULTIMATE FRANCHISE MANAGEMENT GAME<br/>- Join Managers worldwide to build a Professional Football Roster<br/>- Build football stadiums and facilities in stunning 3D<br/>- Play Football Coach Games to nurture and manage talent in the club practice squad<br/>- Win leagues and championship bowls to be successful as a GM<br/><br/>BUILD YOUR ULTIMATE TEAM<br/>- Decide the superstars to buy and sell on the transfer market<br/>- Find the next football legends from young players<br/>- Coach your team and manage to get the best out of your players<br/>- Find and train your star quarterback, linebacker, and tailback for your roster<br/>- Pick your offense and defensive line-up and decide your matchday playbook<br/><br/>REALISTIC FOOTBALL SIMULATION<br/>- Watch football games live<br/>- Feel the pressure in the Redzone<br/>- Take control of the game pass your way to victory<br/>- Analyze your football team's performance with in-depth statistics<br/>- Watch how your MVP performed<br/><br/>BE A MANAGER<br/>- Your decisions affect the attitude of the football club board, football players, and the football fans<br/>- Fantasy Football Games with realistic game economy<br/>- Every Football player has unique skills, nurture them to be the ultimate team<br/><br/>Disclaimer :<br/>- ENDZONE Franchise Football Manager is free to play.<br/>- ENDZONE Franchise Football Manager requires the internet to play.<br/>- ENDZONE Franchise Football Manager has in-app purchases for in-game items.<br/>- ENDZONE Franchise Football Manager compatibility is not guaranteed for all devices.<br/><br/>Every touchdown is a step towards the prestigious legendary champions super bowl trophy!", "metacritic": null, "released": "2021-07-16", "tba": false, "updated": "2021-09-06T20:51:19", "background_image": "https://media.rawg.io/media/screenshots/770/77018a57cbcf6f39c0be03e4315d6fc7_llUCfxW.jpg", "website": "http://awesomeprototype.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 52, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Awesome Prototype"], "genres": ["Simulation", "Sports"], "publishers": ["Awesome Prototype"], "esrb_rating": "Everyone 10+"}