{"id": 651366, "slug": "recursive-programming-puzzles", "name": "Recursive: Programming Puzzles", "name_original": "Recursive: Programming Puzzles", "description": "Recursive is a puzzle game about recursion, patterns, and programming. It is the perfect game for people who love hard puzzles.<br/><br/>Your goal is to help little robots complete their mission and collect all gems by finding the correct pattern and translating it into a short program.<br/><br/># Programming language (no prior knowledge required)<br/><br/>The programming language is minimalistic and easy to learn. It doesn't require any prior programming knowledge and consists of only four instructions.<br/>- Move forward: Move one cell forward.<br/>- Rotate left: Rotate 90° left in place.<br/>- Rotate right: Rotate 90° right in place.<br/>- Change color: Load a chip of a specified color and execute the instructions it contains.<br/><br/>And even with this simple programming language, robots can follow complex patterns thanks to the power of recursion and to other tricks that you can discover along with your progression in the game.<br/><br/># Rich levels<br/><br/>Recursive offers a large variety of levels thanks to supporting multiple types of elements.<br/>- Robots: They can have different colors that reflect the chip they have loaded.<br/>- Gems: Your goal is to collect all of them.<br/>- Bugs: They destroy robots and make them disappear.<br/>- Chips: They make robots load a different program.<br/>- Teleportation gates: They make robots teleport to a different location.<br/>- Inactive robots: They are activated when touched by another robot.<br/><br/># Mastering recursion<br/><br/>Recursion is said to be hard to understand as a famous quote attributed to Stephen Hawking says: \"To understand recursion, one must first understand recursion.\" However, we believe that playing Recursive is another fun way to understand it or even master it.", "metacritic": null, "released": "2021-01-28", "tba": false, "updated": "2021-09-06T20:40:19", "background_image": "https://media.rawg.io/media/screenshots/4a9/4a94a446152ff72e32e977e6ebdc7ddc.jpg", "website": "https://www.kidori.com/games/recursive", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 75, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Kidori"], "genres": ["Strategy", "Educational", "Puzzle"], "publishers": ["Kidori"], "esrb_rating": "Everyone 10+"}