{"id": 651450, "slug": "city-tour-adventure-car-race", "name": "City Tour Adventure Car Race", "name_original": "City Tour Adventure Car Race", "description": "Test your Driving skills in an amazing open world exciting game, speed your cars and enjoy the drifts and driving around the city. City Car Driving tour Simulator combines the realism and fun driving physics to create the best car driving simulator on mobile with its advanced car driving physics engine. The best car driving simulator comes with the best driving physics! From racing cars to off road SUVs, all kinds of vehicles have their own physics!<br/>Get behind the wheel of the most realistic City car driving simulator game! Drive fast and drift hard in high octane drifting in one of the best car driving simulator games! Beautiful graphics with realistic scenarios will make the game an addictive one for all those who love to drive. Be a furious racer on a whole city for you. Real driving with a manual transmission, with clutch and stick shift! This is a game that will not only test your skills in controlling the car but also need full attention to traffic rules when you are driving in car or parking in traffic. we offer you realistic offroad and racing experience at a high level. The road system is also very dense, with highways and mountains, with hill-climb.<br/><br/>FEATURES of Luxury City car Driving:<br/>•\tStunning graphics<br/>•\tStunning 3D environment<br/>•\tAmazing cars collection<br/>•\tChallenging game<br/>•\tFree to play", "metacritic": null, "released": "2018-09-09", "tba": false, "updated": "2021-09-06T21:26:53", "background_image": "https://media.rawg.io/media/screenshots/41f/41f82d55382b251510508773a634e881_PjSaUug.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 82, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Cliff David"], "genres": ["Action", "Simulation"], "publishers": ["Cliff David"], "esrb_rating": "Everyone 10+"}