{"id": 651416, "slug": "soul-land-reloaded", "name": "Soul Land Reloaded", "name_original": "Soul Land Reloaded", "description": "Attention all manga and webnovel fans, Soul Land Reloaded has finally come!  Official launch at the end of August.<br/><br/>100% based on the original Soul Land story and officially licensed by the Soul Land series. Experience Tang San’s epic journey, meet Shrek Seven Devils, hunt down Soul Beasts and conquer Sea God Island. <br/><br/>Join our official Discord Server and Facebook community, receive game information and meet Soul Land fans all over the world! <br/>FB：https://www.facebook.com/SoulLandReloaded/<br/>DC：https://discord.gg/jxYaXpgQkF<br/><br/>Game Features:<br/>[Official Copyright License]<br/>Soul Land Reloaded is in direct cooperation with the Soul Land anime series, we aim to provide our players with an experience that matches reading the original novel or watching anime, from character personality to exciting plot twists, you'll find all the familiar Soul Land elements here.<br/><br/>[No Wasted Investment]<br/>There's no useless Martial Soul in Soul Land, just like there's no wasted investment in the game, all resources you spent can be refund by reincarnating heroes. There are also various convenient functions that you can use to reach the top faster.<br/><br/>[Real-time Combat]<br/>True Soul Masters never stand still in battle, control your character to dodge dangerous enemy attacks, find advantageous points to outplay your opponents, activate ultimate at the right moment to maximize your damage or negate enemy skills.<br/><br/>[Insane progression Speed]<br/>Free 10 pull for your first 7 day log-in, super high drop rate and multiple guaranteed summons, all your favorite characters can be collected with ease. On top of that, there are countless in-game events and free daily gifts for you to claim.<br/><br/>[Build Heroes and Compete]<br/>Sometimes you just need to show them the color of your Soul Ring, and if that's not enough, flex your Martial Soul and Extended Soul Bone. In Soul Land Reloaded, you will develop your characters like a real Soul Master, and you know what to do next, compete with other players for the Ultimate Douluo Title.", "metacritic": null, "released": "2021-08-24", "tba": false, "updated": "2021-09-06T21:09:02", "background_image": "https://media.rawg.io/media/screenshots/2cc/2ccb34720996df07e9626c8aba230e6c_tG57ceR.jpg", "website": "https://soulland.acngames.com/#/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 231, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["SINGAPORE AZURE TIMES PTE.LTD"], "genres": ["Adventure", "RPG"], "publishers": ["SINGAPORE AZURE TIMES"], "esrb_rating": "Teen"}