{"id": 651452, "slug": "idle-collector-bouncer-ball", "name": "Idle Collector: Bouncer Ball", "name_original": "Idle Collector: Bouncer Ball", "description": "Idle Collector is an incremental physics and exponential idle game where you tap the ball to bounce and collect cash from the spinner and build your idle bouncers with cash earned or with gems. Let the ball bounce and collect cash!<br/><br/>Fling your collector around and hit the spinners to collect cash. With the cash that you collect, you can upgrade your gem generator to get gems.<br/><br/>Use your gems to buy upgrades and unlock special bouncers to destroy the spinners.<br/><br/>Types of special bouncers:<br/>- Collector Bouncer - Collects the cash of any spinner in the range that is defined by the level of the upgrade of your idle bouncer ball.<br/>- Magic Bouncer - Discards the cash and splits the spinner in two after the time that depends on the level of your upgrade. Gives you twice as much cash if the spinner count is full!<br/>- Explosion bouncer - Gives you 1 gem for every 50k cash collected <br/>- Physical bouncer - Collects twice as much cash after the time defined by the level of your upgrade.<br/><br/>When you have earned at least 100k cash, you can prestige. Every time you prestige, the amount of cash required for the next prestige point increases by 5k. The bonus percent increases your cash earned per second upgrade by the percent.<br/><br/>Spinners generate cash, which can be collected by bringing it within range of the collector, by bouncers, or by hitting corner bonuses. As a spinner fills up with cash, it turns green.<br/><br/>Cash upgrades are upgrades that target spinners. These are available:<br/>- Corner Bonus - The Corner Bonus upgrade increases the bonus given when a spinner hits a corner.<br/>- Spinner Count - The Spinner Count increases the maximum spinners that are available. If the maximum spinner count is not reached, a new spinner will spawn once the cooldown is over.<br/>- Max Stored Cash - The Max stored increases the maximum amount of cash a spinner can store.<br/>- Cash Per Second - The Cash Per Second upgrade increases the amount of cash a spinner will generate in a second. It cannot generate cash greater than the Max Stored Cash.<br/><br/>Tap anywhere on the screen and the bouncing ball will move toward your finger. If any spinners get in range of the collector, you'll collect the cash. Tap your fingers quickly on each side of the screen, moving the collector from one end to the other.<br/><br/>Just bounce and collect cash from each spinner and level up various upgrades to unlock and get a more powerful idle bouncer! Start the exponential idle growth!", "metacritic": null, "released": "2021-07-20", "tba": false, "updated": "2021-09-06T21:27:49", "background_image": "https://media.rawg.io/media/screenshots/f95/f95fa54641c492dedcdaa116b48ced27.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 116, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["WaffleStack Studio"], "genres": ["Strategy", "Casual"], "publishers": ["WaffleStack Studio"], "esrb_rating": "Everyone 10+"}