{"id": 651440, "slug": "street-drag-race-online-pvp", "name": "Street Drag Race: Online PvP", "name_original": "Street Drag Race: Online PvP", "description": "Street Drag: Elimination  Online PvP multiplayer - the most realistic and engaging drag racing experience ever created for mobile devices - is finally here! Build, Race, and Tune your car until it’s at the absolute peak of it’s performance. Go up against the best of the best in online multiplayer play! This is no over produced side-scrolling pseudo racer. This is raw drag racing - NO FLUFF! - just you, your car, and your competitors.<br/>ONLINE MULTIPLAYER<br/>Play other racers from all over the world in online multiplayer. Be careful out there though - there are some fast folks on this game!<br/>Do you think street car racing is easy against your racing rivals? Try this car racing game and find the best speed car to race with nitro and prove yourself that you are better drag racer than others! Do not let other racers to pass you and beat them by upgrading your car to higher levels!<br/>NO BOUNDARIES<br/>America, Europe, Asia, Australia ... They are just words. More than 10 million players around the world are always ready to take your challenge!<br/>UNIQUE STYLING<br/>Love to express yourself? This is the right game for you! Turn your car into a work of art!<br/>TUNING<br/>Install unique exclusive spare parts into your car and see how its performance will improve!", "metacritic": null, "released": "2021-08-14", "tba": false, "updated": "2021-09-06T21:22:09", "background_image": "https://media.rawg.io/media/screenshots/a33/a3393870bc5da8001dbf6dbf3bff60fc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 275, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Igor Chetrus"], "genres": ["Simulation", "Racing"], "publishers": ["Igor Chetrus"], "esrb_rating": "Everyone 10+"}