{"id": 651492, "slug": "gold-rush-td", "name": "Gold Rush TD", "name_original": "Gold Rush TD", "description": "Join up and take command! A murderous army of steam powered Creeps is bent on wiping out humanity and only you can turn the terrible tide. Battle from the very gates of your city to the molten depths of the planet itself in order to win the war!<br/><br/>Victory will depend on many factors. Balance mining gold versus building defenses to conquer waves of deadly Creeps. Upgrade your Command Center to unlock perks and gain access to advanced Towers. After the mayhem subsides, use the Scrap from defeated foes to unlock new Modules that provide powerful effects to shape the course of future battles.<br/><br/>Forging your tech tree is key to vanquishing the onslaught of the Creep menace. The choice is yours!<br/><br/>- Unique resource system featuring active income management. Choose between short term defense boost or long term resource gain.<br/>- An intriguing campaign of 12 different level spread across 4 world areas.<br/>- 16 persistent modules to choose from to specialize your defenses and customize the way you play.<br/>- 12 towers each with a different effect and role in your defense.<br/>- 24 advanced tower perks to alter and enhance the effects of your towers.<br/>- 15 creep types to challenge you at every turn of the game.<br/>- 4 epic boss fights to culminate each world area.<br/>- 3 different difficulty settings ranging from a more casual experience to an intense challenge.<br/>- The game does not require internet to be played.<br/>- No microtransactions, loot boxes, or wait timers.", "metacritic": null, "released": "2021-01-03", "tba": false, "updated": "2021-09-06T21:48:42", "background_image": "https://media.rawg.io/media/screenshots/573/5731b74004022bb1f44f125f0e8acada.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 225, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Element Studios"], "genres": ["Strategy"], "publishers": ["Element Studios"], "esrb_rating": "Everyone 10+"}