{"id": 651449, "slug": "blaster-destroy", "name": "Blaster Destroy", "name_original": "Blaster Destroy", "description": "When alien invaders threaten to wipe out all life on earth, its up to you, the Pilot, to defend the last rebel base with one of the aliens most powerful weapons. <br/><br/>Warning. A threat has been detected. The Blaster deployed. Enemy forces are mounting a massive attack. Your mission is to the defend the gate but you face an uphill battle. The stakes are high. The odds are stacked against you.<br/><br/>- Flying enemy bombs that detonate on contact or when time expires!<br/>- Enemy Blasters that fire destructive bullets!<br/>- A moving shield that deflects enemy fire!<br/>- A rolling laser barrier that strikes without warning!<br/><br/>Just some of the dangers that you must face. In this all out fight for survival, it's destroy or be destroyed. <br/><br/>FEATURES<br/><br/>- 50+ levels: Massive Alien Attacks. Strategic battle formations. <br/>Invaders Attack - Levels 1-50. <br/>Blasters Attack - More levels coming soon.<br/>- Laser Cannon: Fire shots at angles and off of walls, and even off of other surfaces like enemy defenses. <br/>- Deadly alien weapons and defenses.<br/>- Takes skill and strategy to master. Must destroy enemy targets with speed and accuracy before time runs out. Fast reflexes are critical. Dodge enemy threats and don't get hit.<br/>- Special Features: The Blaster Wars | How To Play.<br/>- Great minimalistic graphics.<br/>- Fast-paced arcade action and addictive gameplay.<br/>- Incredibly fun and insanely challenging! <br/><br/>If you love the game, please leave a review. And if its so challenging that you find it frustrating please leave a review. Thanks for playing!", "metacritic": null, "released": "2018-12-31", "tba": false, "updated": "2021-09-06T21:26:23", "background_image": "https://media.rawg.io/media/screenshots/1c5/1c5da45282b5ea467e2a410940beb879.jpg", "website": "http://blasterdestroy.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 49, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Derrick Allen"], "genres": ["Action", "Casual"], "publishers": ["Derrick Allen"], "esrb_rating": "Everyone 10+"}