{"id": 651409, "slug": "a-simple-mistake", "name": "A Simple Mistake", "name_original": "A Simple Mistake", "description": "STORY<br/>It is a cold wintery night. You are driving on the deserted road towards the familiar hills of Westlake Creek and it isn’t far until you will be home.<br/><br/>But then…BANG and a sound of grinding metal! A sudden jolt and you notice smoke is pouring from the hood of your car. You need to call for help.<br/><br/>You look around and notice a large mansion house down a gated path. Lights are on so someone must be home. You are thankfully not alone out here.<br/><br/>You decide to see if whoever lives there can help. But have you just made a simple mistake?<br/><br/>GAMEPLAY<br/>Explore an ancient old building. A home to an elaborate architect that has a passion for puzzles and secret passageways.<br/><br/>Make your way through the house room by room trying to make that all elusive telephone call.<br/><br/>What secrets will you discover, will you ever manage to make that telephone call and escape?<br/><br/>FEATURES<br/>= Amazing visuals<br/>= Captivating soundscapes<br/>= Brain teasing puzzles <br/>= Hidden pathways <br/>= Bountiful inventory items and combinations<br/><br/>BACKGROUND<br/>From the creator of Mystery of Camp Enigma. If you are a fan of point and click, hidden object, mystery, adventure or escape rooms then you will love playing A Simple Mistake<br/><br/>A Simple Mistake is the vision of a solo developer. I am always fascinated by your feedback, which is turn gives me the inspiration for the next adventure!<br/><br/>Please continue to share your thoughts and feedback in all the usual ways.<br/><br/>NOTES<br/>Please note that saving is automatic as each room or level is completed.", "metacritic": null, "released": "2020-12-10", "tba": false, "updated": "2021-09-06T21:05:14", "background_image": "https://media.rawg.io/media/screenshots/ed8/ed859d8b0755b851ecb5a1844e73cd99_kLgjzC8.jpg", "website": "https://www.m9games.co.uk/GAMES/ASimpleMistake/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 226, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["M9 Packaging"], "genres": ["Adventure", "Puzzle"], "publishers": ["M9 Packaging"], "esrb_rating": "Teen"}