{"id": 651415, "slug": "car-crash-sim-death-stairs", "name": "Car Crash Sim: Death Stairs", "name_original": "Car Crash Sim: Death Stairs", "description": "Ready to take charge of most exciting stairs jumps down beamng with vehicle destruction skills!Select best vehicles and race high speed to prove that you're best crash master on deadly stairs ramp.This Derby Destruction gives bullet speed to get maximum impact on your vehicle and destroy highway road vehicles. So enjoy the best stairs down jumps and be a champion.<br/><br/>In this speed breaker &amp; stairs jump down challenge you have to complete crashes on different modes like hitting opponents, objects and specially from to to down stairs jumps. Because this is specially designed not for speed bumps crashes but also for high speed jumps top stairs to down by crashing as a muscle car crash. <br/><br/>Crash simulator 2019 on high jumps is actually accident simulator with specially designed deadly speed breaker for the death race crash.This car crash destruction game comprises of dazzling visuals and high definition crash flashbacks. Remember! You can drive everywhere but avoid to restricted areas and opposite lane in this beam car crash Accident Simulator.<br/><br/>Features:<br/><br/>- Show your monster vehicle destruction skills<br/>- 3D high jumps for up stair to down<br/>- Master skills to car accident in crash mode<br/>- Be a crash master by winning scenic demolition crashing stunts<br/>- Loud rap music, blatant crashing", "metacritic": null, "released": "2019-10-09", "tba": false, "updated": "2021-09-06T21:08:29", "background_image": "https://media.rawg.io/media/screenshots/21c/21c9eac961933b1d1d9a89dbd23224cf_eP7wZpj.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 140, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["MASH Entertainment"], "genres": ["Action", "Simulation"], "publishers": ["MASH Entertainment Pvt"], "esrb_rating": "Everyone 10+"}