{"id": 651469, "slug": "knight-runner-by-play-magnus", "name": "Knight Runner by Play Magnus", "name_original": "Knight Runner by Play Magnus", "description": "Knight Runner is a FREE, chess puzzle-adventure game focused on giving you an exciting and immersive brain-training experience. Prepare to play for countless hours! No prior chess knowledge required. <br/><br/>STORY<br/>Once upon a time, in a land far away…<br/>Enemy forces captured a peaceful kingdom and banished their leaders into a mysterious portal. Just before the portal closed, the Knight Runner jumped in, embarking on a wild rescue mission through chess history.<br/><br/>We invite you to join this heroic story and become the Knight Runner. To fulfill your quest, jump your way through different eras and locations, such as India, New York, Iceland, Norway, and the Future.<br/><br/>Navigate each level by capturing and crushing enemy pieces, teleporting, and puzzle-solving. <br/><br/>The fate of the Chess Kingdom is in your hands. Restore peace and order to the land. <br/><br/>Get the GAME PASS to unlock new worlds and levels frequently.<br/><br/><br/>HERE'S WHY YOU'LL LOVE KNIGHT RUNNER<br/>• FREE to play, with in-app purchase options. <br/>• NO ADS, so you can focus on the game play <br/>• GO ON A WILD ADVENTURE through chess history <br/>• TRAIN YOUR BRAIN while having SO much fun!<br/>• DELIGHTFUL, fun, and clean design <br/>• ENJOY a beautiful, epic, and dynamic music soundtrack throughout the whole game<br/>• PLAY and learn chess without even realizing it! <br/>• CHALLENGE yourself and beat your records<br/><br/>EXPLORE A FUN-FILLED CHESS PUZZLE ADVENTURE<br/>• COLLECT COINS – 100 coins give you an extra life!<br/>• KNIGHTVISION – See all dangers with this special ability<br/>• BOMBS – Explode all surrounding pieces<br/>• TELEPORTS – Jump between squares instantly<br/>• STARS – Get a 3-star rating on each level<br/>• POINTS – Break your records<br/>• PAUSE SQUARES – Stop time and calculate your path<br/>• WORLDS – Travel through time and space to different locations such as India, New York, Iceland, Norway, and the future…<br/>• LEVELS – Enjoy the first 50 levels for free and then get ready for frequently added levels with our GAME PASS!<br/><br/>FROM AN AWARD-WINNING TEAM<br/>The Knight Runner app team has been featured on The Wall Street Journal, Financial Times, Business Insider, Fast Company, The Guardian, and Norwegian newspapers such as VG and DB. The team is also behind the famous Play Magnus, Magnus Trainer, and Tactics Frenzy chess apps. The team has won several design awards throughout the years.<br/>World Chess Champion Magnus Carlsen is also on the team!<br/><br/>“I’ve always done things a little differently. That is what inspired me. Chess has always been fun, but this takes learning and training chess to a new level. Knight Runner is chess training for everyone!”<br/>— Magnus Carlsen<br/><br/>REACH FURTHER WITH A GAME PASS<br/>The app is free to use, with added benefits for paying members.<br/>Members enjoy instant access to all levels, many exclusive only for members. As a member, you also get infinite lives, so you can always keep playing, including exclusive bonus levels. In addition, members get several save slots.<br/>For Knight Runner, we offer the following subscriptions:<br/>1-week<br/>1-month<br/>12 months<br/>Lifetime<br/><br/>TERMS OF PAYMENT<br/>Payment will be charged to your iTunes account after you’ve confirmed a purchase. Subscription to a membership automatically renews unless auto-renew is turned off at least 24 hours before the end of the current period. Your account will be charged for renewal within 24 hours of the end of the current period, and the price for the renewal will be provided. You can change your subscription settings in Subscriptions in App Store when a subscription is active.<br/>It is not possible to cancel an active subscription to get a refund of the remaining time.<br/>Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication.<br/><br/>TERMS OF USE<br/>https://company.playmagnus.com/terms<br/><br/>PRIVACY POLICY<br/>https://company.playmagnus.com/privacy", "metacritic": null, "released": "2021-08-16", "tba": false, "updated": "2021-09-06T21:36:54", "background_image": "https://media.rawg.io/media/screenshots/c0c/c0c94b5ec35486f36b5e9c226e050b7d_V5ZRkXr.jpg", "website": "https://company.playmagnus.com/press", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 127, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Play Magnus"], "genres": ["Board Games", "Educational", "Puzzle"], "publishers": ["Play Magnus AS"], "esrb_rating": "Everyone 10+"}