{"id": 651506, "slug": "superhero-ramp-car-stunt-3d", "name": "SuperHero Ramp Car Stunt 3D", "name_original": "SuperHero Ramp Car Stunt 3D", "description": "Are you ready for ramp car jumping superhero racing stunt games? In this new car racing game real driving you will enjoy while performing crazy races stunts in megafly ramp car racing impossible stunts 2 free car jumping stunts 2021. Many different ramping car stunts are free designed for your ultimate car stunts fun. You have to be a part of crazy car stunts 3d free extreme city gt racing car stunt racing games in this crazy car stunts 3d free car racing games. Are you looking for car stunt games 2020 3d racing free or amazing spider car games? Let's start super hero car racing stunts races mega ramps - ultimate races 2021 which are full of mega ramp car jumping stunt car game 2021.<br/>Complete the interesting and different challenging missions to hone your skills in car games 2021<br/>Boost up your powers by completing the stunt challenges on impossible tracks with different environment and win the different titles of mega ramp stunt driving games<br/>Hurry to beat the finish line with dangerous stunts to win the exciting rewards and to qualify for the next challenging missions<br/><br/>Features of this Superhero ramp car stunts 3d: new car games 2021 are as:<br/>- New car stunts in mega ramping extreme.<br/>- Flipping mega ramp car impossible stunts.<br/>- Modern superhero vehicle.<br/>- Hydraulic brakes and best acceleration nitro for 3D ramp extreme car jump.<br/>- Best steering and motion controls.<br/>- Different sports cars to complete the impossible tracks<br/><br/>If you really enjoy out game give feedback it is important for us to more improvements in game.", "metacritic": null, "released": "2021-08-23", "tba": false, "updated": "2021-09-06T21:56:37", "background_image": "https://media.rawg.io/media/screenshots/958/958b3ccca84fd4507c7652f60543861d_MIUM9uL.jpg", "website": "https://trendingracinggames.netlify.app/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 69, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Top Car Games"], "genres": ["Simulation", "Racing"], "publishers": ["ABC VIETNAM TELECOMMUNICATIONS SERVICES COMPANY"], "esrb_rating": "Everyone 10+"}