{"id": 651503, "slug": "law-empire-tycoon-idle-game", "name": "Law Empire Tycoon - Idle Game", "name_original": "Law Empire Tycoon - Idle Game", "description": "Are you ready to manage your own law firm and become a renowned attorney?<br/> <br/>Take on the challenge and become rich while winning crucial trials for your clients!<br/><br/>Start running a small firm and work hard to earn prestige and make your reputation grow. Investigate every detail, track all the leads to turn your business into a successful corporation. <br/><br/>Deal with the needs of your clients and defend them in court in a fair trial. Choose your cases and hire external detectives and interns to collect evidence and convince the jury. Change the judge’s final verdict thanks to intense research and prove in front of a judge that your defendant is Not Guilty. Invest your money wisely in your business to win harder cases, and impress other famous lawyers with your fine work. Take decisions intelligently, and adapt your strategy accordingly. <br/><br/>WIN CASES AND STAND OUT FROM THE REST OF LAW FIRMS:<br/><br/>Accept those cases you think can increase your reputation. Specialize in lawsuits related to robbery, bribery, extortion, threat, fraud, drug trafficking; or even solve crimes of passion, murders, love triangles, and mafia-related crime. Demonstrate to the prosecutor that your clients are innocent! Use the prestige earned after each victory to expand your business if you want to handle more special cases. <br/><br/>INVESTIGATE AND DEFEND YOUR WORK IN COURT:<br/><br/>All the previous research must be defended in front of a judge. Everything will be useless if you don’t advocate all your inquiries and your findings properly. The judge has to be convinced before hitting the table with the mallet. Look for your defendant’s acquittal in every case. Deal with prosecutors and prove that they are wrong!<br/><br/>MANAGE YOUR STAFF: <br/><br/>You will need the best working team at your law firm. Study the situation and hire lawyers, legal interns, or investigators according to your workflow and growth strategy. All the departments need the best equipment and the best attorneys to cover all the needs in your business. Manage your team wisely to make your business profitable and renowned. <br/><br/>MAKE CONTACTS AND JOIN EXCLUSIVE LAW CLUBS:<br/><br/>Gain prestige and be invited by famous lawyers to the Lawyers Club. Accept their challenges to increase your reputation and prove your worth in front of all the members. Progress up the career ladder and maintain influential contacts in the club. <br/> <br/>If you like management and idle games, you will enjoy Law Empire Tycoon! A casual easy-to-play game where strategic decisions have to be taken to manage a law firm with profitable results. Improve your empire starting from a small and modest office and unlock visible progress in your premises. Transform your small business into the best law firm and become the best law corporation around the world!<br/><br/>- Casual and strategic gameplay for every player<br/>- Multiple lines of investigation and legal cases<br/>- Dozens of objects to be unlocked and upgraded<br/>- Lots of characters and interactions<br/>- Funny 3d graphics and great animations <br/>- Management of a successful business<br/>- A small living world in miniature.", "metacritic": null, "released": "2021-08-31", "tba": false, "updated": "2021-09-06T21:55:03", "background_image": "https://media.rawg.io/media/screenshots/7bd/7bd60bb069cd94189340a1874eaf914d_h2jB37c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 169, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Digital Things"], "genres": ["Strategy", "Simulation"], "publishers": ["Digital Things Sociedad Limitada"], "esrb_rating": "Everyone 10+"}