{"id": 651523, "slug": "rescue-dash", "name": "Rescue Dash", "name_original": "Rescue Dash", "description": "Rescue Dash Adventures is a fascinating city rescue game. A began in The city is plunged into a real chaos: all the animals in the local zoo have escaped and caused turmoil! Seals, dogs, rabbits, raccoons - all of them must be rescued and returned home! The rescue team led by the brave Jessica is in a hurry to help everyone and help the city to regain peace and order! Walk the whole adventure with her and acquire new friends and a cheerful mood.<br/><br/>Help<br/>Have you ever dreamed of becoming a rescuer and helping people? It's so great to swim in the rays of gratitude of the city's residents! This game gives you a chance to make this dream come true! Now city residents are in a panic - wild animals roam the streets, scare children and destroy city property! Who, if not rescuers, can restore the normal way of life!<br/>There are many quests to overcome, from putting out fires to cleaning up after hurricanes! In the meantime, you will rescue cute animals, frightened children and civilians from troubles. You will have to clear rubble, remove trash, rebuild roads, get to the animals through a series of difficult obstacles and feed them tasty treats.<br/>To complete your mission, you need speed, ingenuity, and the ability to be a team player!<br/><br/>Earn points<br/>In the course of the quest, you will need resources that have yet to be collected. Develop your own strategy to help you complete tasks in as efficient and as simple way as possible. And don't forget about the time limit! Remember that, if you fail to meet the deadline, the points that had taken you so much effort to earn, will be canceled. In short, be alert!<br/>By the way, timely task completion is great to develop self-restrain and teach you to always be collected!<br/><br/>Harder with each step!<br/>The complexity of the game increases with each next level, which means you won't get bored. Unlock new locations, pass through challenging mazes, solve tricky puzzles and receive generous rewards for a job well done!<br/>Develop your characters and compete with other players for the title of champion of the Rescue Service! There are advantages to playing as a team: other players will support you if you run out of energy! And of course having fun together is always more enjoyable.<br/><br/>More possibilities!<br/>You can pump up your character faster if you buy additional packages of resources and bonuses. They are not expensive but they will make the quests even more interesting! After all, if the character is properly pumped up, he will perform tasks faster and better than others!<br/><br/>Enjoy the game<br/>Time-management games are timeless classics, and Rescue Team is yet another testament to this. Enjoy excellent modern graphics, dynamic gameplay and pleasant music. The game is installed on a smartphone or tablet in one click and does not require a lot of free memory. The controls are intuitive - follow the on-screen prompts and guide the character to where his help is most needed. Become one with your character and prove to your teammates that you are the best rescuer in this vibrant and cheerful city!", "metacritic": null, "released": "2021-07-15", "tba": false, "updated": "2021-09-06T22:06:09", "background_image": "https://media.rawg.io/media/screenshots/ff0/ff0e4a9e7b7fe3de53ace037dfee84b3_S0JQWF2.jpg", "website": "https://matryoshka.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 173, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Matryoshka Games"], "genres": ["Simulation", "Casual"], "publishers": ["MATRYOSHKA GAMES CY"], "esrb_rating": "Everyone 10+"}