{"id": 65162, "slug": "armoured-engines", "name": "Armoured Engines", "name_original": "Armoured Engines", "description": "<strong>Armoured Engines</strong> is a steam punk western epic following the journey of train conductor Dusty Beats and her partner in crime, the ancient living engine Billy Wylam, as they search for El Dorado. Protect your train and shoot, fling, slice, blow up, and otherwise bother a horde of vibrant enemies, utilizing a fully customizable arsenal of weaponry and armed passengers.<br/><br/><br/><br/><br/>Encounter cyborgs, undead sheriffs, cactus people, yetis, and the weird dark unknown of the Eastern Green. Lots of folks are after Billy - the only choice he and Dusty have is to reach El Dorado, the ancient home of the living engines. Within lies endless wealth, the answers to countless mysteries, and an undecided future.<br/><br/><br/><br/><br/>Scavenge, buy, and craft carts and gadgets to help you fend off enemies. You can also use the cargo and passengers you transport from station to station to help defend your train. Each piece of equipment has strengths and weaknesses, and choosing the right tools - and the right arrangement - for each level will be the key to success!<br/><br/><br/><br/><br/>Battle enemies and giant bosses in the levels between stations, and try to get through without losing any carts! You can use everything at your disposal to battle enemies, including throwing cargo or getting your passengers to help.  As you defend your train, you'll build up steam power that can be used to activate powerful buffs on a cart of your choice, giving you the opportunity to adapt your strategy in the heat of battle and give a boost where it is needed most.<br/><br/><br/><br/><br/>Explore an expansive and diverse world. Rumble through Ambush Canyon, charge up the vertical walls of Sunset Mesa, go spelunking through the Crystalwhim Caverns, blast through the air fired from massive cannons during the Golden Pilgrimage, cross the crumbling Thornvale Wall - and many more.<br/><br/><br/><br/>Put on your engineer's cap and fill your heart with steam. Beyond the oil and bones, a wealthy future awaits the bold. So how 'bout it? You in?", "metacritic": null, "released": null, "tba": false, "updated": "2019-08-28T21:54:30", "background_image": "https://media.rawg.io/media/screenshots/867/867c6fc774ad3bb77e141f4997ead1bb.jpg", "website": "http://boundergames.com/armoured-engines/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 177, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Bounder Games"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Bounder Games"], "esrb_rating": null}