{"id": 651757, "slug": "vardir", "name": "Varðir", "name_original": "Varðir", "description": "<em>\"In Norse mythology, a vǫrðr\r\n (pl. varðir or verðir — \"warden,\" \"watcher\" or \"caretaker\") is a warden spirit, believed to follow from birth to death the soul (hugr) of every person.\"</em>\n<p><em>as the only non-human villager of Vikgade, you've never known much about your origin or purpose. Even if the people have always been welcoming towards you, it's been hard not to feel isolated...</em></p>\n<p><strong>It's time to find the answers you deserve.</strong></p>\n<p><strong>Varðir</strong> is an interactive fiction WIP made on Twine (sugarcube) which includes the following features: <br/></p>\n<ul><li>enjoy a lighthearted tale about personal growth.</li><li>discover the viking-inspired town of Vikgade.</li><li>get to pick the pronouns and appearance of your main character, being able to decide how inhuman you appear...</li><li>use the return feature to discover other possible paths within the story without having to restart.</li><li>while romance is not the focus of the game, there are three available characters which you will be able to pursue, or not if that's not your thing.</li><li><strong>unveil the truth of who you're meant to be.</strong></li></ul>\n\n<p>  </p>\n<p>I'm going to be releasing the game episodically! There's no set schedules, though, just whenever I've got the time to work on it.</p>\n<p>The current demo features only the short prologue and the first chapter (named chapter zero). It's not too extensive, but it offers the initial introduction to the town and its locals. I'm aware it might not be much, but you can return to it later if you wish to read more content!</p>\r\nArt credits to pyreios, sugarcube template credits to nyehilism!", "metacritic": null, "released": "2021-09-05", "tba": false, "updated": "2021-09-06T23:09:33", "background_image": "https://media.rawg.io/media/screenshots/a24/a245ea5ac64babb88573ef7112baa4d8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 95, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["technicangels"], "genres": [], "publishers": [], "esrb_rating": null}