{"id": 6518, "slug": "mr-cond-2", "name": "Mr. Cond 2", "name_original": "Mr. Cond 2", "description": "Re-join the world of Mr. Cond, the beloved game that pokes fun at a hushed topic!<br/><br/>Mr. Cond is back on his adventures to keep healthy and he&amp;#39;s ready to explore. This addictive game will keep you entertained for hours on end with immense gameplay, vibrant graphics and intuitive controls.<br/><br/>Mr. Cond is out on a mission to catch rouge bacterium and other microorganisms as they travel. Tap to shoot and capture them as you tilt your device to aim, however, failing to do so will result in losing a life - so make sure they don&amp;#39;t escape! Increase your score by catching bacterium and then gain extra lives from catching pills. After the game has finished, you can share your score on Facebook or Twitter to spread the word... not the disease! Your enemies are ready, are you?<br/><br/>Enter the world of safety, with Mr. Cond 2.<br/><br/>- Share your score through Facebook or Twitter<br/>Want to challenge you friends to beat your high score or just show off about your achievement - do that easily with integrated Facebook and Twitter sharing!<br/><br/>- Endless Gameplay<br/>Long journey? Need a game that you are not going to finish? Mr. Cond 2 is endless meaning simply - there is no end!<br/><br/>- 2 special powers!<br/>Afraid you&amp;#39;re going to run out of lives and being hit by a wave of bacteria? No problem, just deploy one of two powers to eradicate remaining bacteria!<br/><br/>- Tilt and Turn<br/>Mr. Cond 2 uses your accelerometer to track your movement. This allows you to deploy attacks wherever you need, with pinpoint accuracy!", "metacritic": null, "released": "2012-04-05", "tba": false, "updated": "2019-10-22T14:28:57", "background_image": "https://media.rawg.io/media/screenshots/ff4/ff4e085e291b090bb057239899f4831b.jpeg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 193, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mykola Golyash"], "genres": ["Action", "Arcade"], "publishers": ["Mykola Golyash"], "esrb_rating": "Mature"}