{"id": 651837, "slug": "solar-constelation", "name": "Solar Constelation", "name_original": "Solar Constelation", "description": "<p>!Disclaimer <br/>This game is a prototype.</p>\n<p># Short Story</p>\n<p>You are a medium that predicts the future. You prove that constantly by predicting the constelation of the stars and planets. The more your predictions occur the better is your reputation. But with time the people get increeasingly skeptical.</p>\n<p># Gameplay</p>\n<p>At the bottom of the screen you see the constelations you 'predicted' to occur.<br/>Now you need for them to actually appear. From the planets point of views. By rotating planets around stars you can fullfill your predictions.<br/></p>\n<p>Planets are the little Blue Circles with a white triangle. Drawing a straight line from the planet in all 4 directions (up, left, right, down) will give you the star-constelations, the planet perceives.</p>\n<p>A constelation must appear in order and with nothing in between, to count as valid. It is not necessary to start from the beginning. If for example a planet sees \"Red, Yellow, Red, Purple\" , it would fit both constelations \"Red, Yellow, Red\" and \"Yellow, Red, Purple\". <br/></p>\n<p>Having the same constelation appear multiple times increases the overall points you get for that. However a single line of sight (Up, Down, Left, Right) can only count for a single Constelation. But a planet can have multiple. This means per planet you can have 0 to 4 times showing your constelation.</p>\n<p>You manipulate the board by clicking on any bigger celestial objects. this includes the black hole, the yellow dwarf sun, and the red giant sun. Upon doing so all objects in a certain range rotate around that object. The yellow dwarf has a range of 3, the red giant of 5 and the black holes influence is infinte.</p>\n<p>Objects cannot leave the map if they would do so the appear at the next position in the that is on the board again.<br/><br/>Code: https://github.com/tobidot/solar-constelation</p>", "metacritic": null, "released": "2021-09-05", "tba": false, "updated": "2021-09-06T23:28:10", "background_image": "https://media.rawg.io/media/screenshots/0cc/0cceafd813523155a43d341d179b5afa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["TobidoT"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}