{"id": 65193, "slug": "frio-lost-in-old-town", "name": "Frio - Lost in old town", "name_original": "Frio - Lost in old town", "description": "Thank you for passing Steam Greenlit as a one-man developer.<br/>http://steamcommunity.com/sharedfiles/filedetails/?id=426024795<br/>The title has been replaced due to problems with pronunciation and notation.<br/><br/><br/><br/>This is basically a room escape game. Survival-Horror elements at its most atmospheric in an advanced technique. <br/>The game starts in an earlier timeline set in a decaying town, deserted and ghostly, centering on two sister last one left nearby who got involved in a ghost accident.<br/>With this game, You will be exploring the most extremely scary experience and tasked with figuring out the proper tools and <br/>deciphering all clues with your wit and keen observation for survive.<br/><br/><br/><br/>-It supports 9 languages.<br/> English, 日本語, español, Deutsch, français, русский, Indonesia, ไทย, 한국어<br/><br/>-A newly designed interface that is completely compatible with PC environment.<br/><br/>-An option to adjust difficulty according to one’s playing capacities.<br/><br/>-Fear of now knowing what or when it will appear.<br/><br/>-Various and logical puzzle play<br/><br/><br/>※ Those who consider their state of mind and body to be weak are advised not to play this game. Realistic appearances of the evil spirits might give you a heart failure.  <br/>This is not a mere scare tactic. The Elderly, pregnant and underage individuals are restricted from playing this game. <br/><br/>I am a solo developer who does all the work alone. I will do my best in the future. From now on. I worked hard to upgrade, will satisfy users.", "metacritic": null, "released": "2018-02-05", "tba": false, "updated": "2019-08-28T21:54:27", "background_image": "https://media.rawg.io/media/screenshots/e47/e4787abb644b79da824a22dd6418b9d8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 12, "playing": 1}, "playtime": 2, "achievements_count": 9, "ratings_count": 1, "suggestions_count": 305, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["zoocros"], "genres": ["Adventure", "Indie"], "publishers": ["zoocros"], "esrb_rating": null}