{"id": 651924, "slug": "memes-against-humanity", "name": "Memes against humanity", "name_original": "Memes against humanity", "description": "<p>Same or shame<br/></p>\n<p>Unleash the 7 deadly sins hidden inside everyday memes.</p>\n<p>Memes Against Humanity is a 2D card game, where the player gets instructions from the mystical god Cthulhu who is trapped in the digital space and recruiting human slaves. The Player gets tested to see his or her skills regarding reading the 7 deadly sins hidden within memes.<br/><br/>We have tapped into Cthulhu collective consciences by designing a crazy social experiment. In order, to understand how we perceive the 7 deadly sins in classical paintings slapped with modern text on top we created a survey HERE. Then we averaged the answers and added them as values to each meme. So the values of the memes (cards) were balanced by the public opinion. We would like to see how far we can test humanity's sanity by comparing the collective consciences vs the individual's perception of memes. </p>\n<p>Cthulhu's TERMS AND CONDITIONS:<br/></p>\n<p>You receive a strange package in the mail. Wrapped inside strange black paper there is a mobile device. When you turn it on you receive instructions from an ancient deep god Cthulhu. This god demands that you follow his instructions in order to influence the world depending on which SIN is required NOW!\r\n</p>\n<p>Your target is to please Cthulhu’s sins three times in a row to summon THE ANCIENT ONE!!! But SIN should NEVER disappear from this world, if any SIN counter is empty or another SIN becomes dominant you are GONE!\r\nTo spread the SIN you are tasked to post MEMES. However, MEMES and SINS are perceived differently by individuals so Cthulhu tapped in the collective conscience of humanity through a SIN SURVEY.</p>\n<p><strong>Disclaimer</strong>: All images and text were collected from the internet without the intention to insult or offend anyone. The ones that were chosen for the game were voted on by public opinion and can be taken away by those same forces, just let us know :))<br/></p>\n\n<p>Credits:</p>\n<p>Code - insanityinc.itch.io<br/></p>\n<p>Art - hm-itso.itch.io\r\n</p>\n<p>Sound - hectorjotta.itch.io\r\n</p>\n<p>Game Design - annsch.itch.io &amp; kikerkov.itch.io\r\n</p>\n<p>Thanks to the organizers of the jam! <br/>https://itch.io/jam/ga-remote-jam-2021</p>", "metacritic": null, "released": "2021-09-05", "tba": false, "updated": "2021-09-06T23:50:02", "background_image": "https://media.rawg.io/media/screenshots/55d/55d8e679f62c2e27244bbfae191cdd9a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 116, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["kikerkov", "InsanityInc", "HM_Itso", "hectorjotta", "Ann Schomburg"], "genres": [], "publishers": [], "esrb_rating": null}