{"id": 6520, "slug": "zday-survival-simulator", "name": "ZDAY Survival Simulator", "name_original": "ZDAY Survival Simulator", "description": "Excellent Player resources and help from the developers can be found on player forums: http://forums.mongadillo.com<br/><br/>New Game Engine!  Greatly improved player controls, much better UI, enhanced gameplay puts more control of your items and survival party in your hands!<br/><br/>This version is compatible with all iPad versions, and iPhone 3GS and later, and iPod touch 3G and 4G<br/><br/>&amp;quot;For those of a certain age who loved adventure game books, it’s the perfect app to play and one that players will find themselves returning to. Not least because they’ll have to be pretty skilled to ‘win’!&amp;quot; <br/><br/>4 out of 5 stars - Jennifer Allen, 148 Apps.com<br/><br/>&amp;quot;I&amp;#39;ve been having a blast with this since it&amp;#39;s essentially gameifies what runs through my head whenever I read or watch a piece of zombie content, but it&amp;#39;s also solid production-wise. I heartily recommend this to anyone that still has an itch for zombies, or even an appreciation of primarily text-based titles.&amp;quot;<br/><br/>~ 4/5 stars - Brad Nicholson, Toucharcade<br/><br/>&amp;quot;ZDAY is a 21st century text-based Simulator game that puts you the player in tough, real-world situations. The game play is easy and you can soon control it well.&amp;quot;<br/><br/>~ 4/5 stars - Top10app.com<br/><br/>&amp;quot;4/5 Stars&amp;quot; - Dan Zuccarelli, Gamezebo.com<br/><br/>What better way to survive a full blown apocalypse than to PRACTICE? This is not a traditional shooter or an arcade style game where you poke buttons to shoot digital bullets at virtual zombies.  ZDAY is a 21st century text-based Simulator that puts you the player in tough, real-world situations and says &amp;quot;what would YOU do?&amp;quot;.<br/><br/>Created and Designed by Animator and Director Ed Anderson, and beautifully illustrated by renowned DC comics artist Matt Haley, ZDAY is an intelligent adventure game that starts you in a crowded suburb at ground zero of a full blown infection, and says &amp;quot;what would you do?&amp;quot;. Faced with one scenario after another, the player has to make choices that will either lead him to escape the zombie-filled suburbs or perish like so many others. The sophisticated game engine keeps track of every decision that you make, and keeps a running tab on your survival probability based on the choices you make. <br/>So keep your wits about you, and choose carefully, because one wrong move could have you facing a zombie horde or roving bands of trigger-happy looters.  <br/>The detailed results given after the player has completed the challenge provides very useful insight to what he may have done right and wrong. If the player wants to try again he can, and since the game engine reshuffles many of the exact events, ZDAY Survival Simulator is never exactly the same twice.", "metacritic": null, "released": "2012-01-07", "tba": false, "updated": "2019-10-22T14:28:20", "background_image": "https://media.rawg.io/media/screenshots/5d4/5d4d285768bc3080b3624738420ea002.jpeg", "website": "http://www.mongadillo.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 144, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mongadillo Studios"], "genres": ["Action", "Simulation"], "publishers": ["Mongadillo Studios"], "esrb_rating": "Teen"}