{"id": 652176, "slug": "vermoidi-innamorati", "name": "Vermoidi Innamorati", "name_original": "Vermoidi Innamorati", "description": "<p>This is a 1 or 2 player game.<br/> The aim is to solve the maze of each level; in the case of two<br/> active players, the two worms, meeting, both pass the level<br/> following.<br/> However, eating all the tokens in a level will open an exit in a<br/> any point of the labyrinth.<br/> The pieces are placed in different places each time.<br/> Equipped with presentation, interlude and end-game demo.<br/> Possibility to use both keyboard and mouse (left and right button).<br/> Program supplied with 1 small level (1280x800), 1 medium level<br/> (2560x1456) and 1 large level (5120x2768).<br/> Music and sound effects on PC-Speacker.</p>\n<p> ONLINE OPTIONS:</p>\n<p> Use VERMOIDS /? to know the available options.<br/> For example use VERMOIDS / N to play no music or FX, use<br/> VERMOIDS / X to disable RASTER synchronism, use VERMOIDS nnn (eg.<br/> VERMOIDS 148) to set the freq. video refresh through the IRQ of the<br/> timer.</p>\n<p> KEYBOARD OPTIONS (DURING THE GAME):</p>\n<p> ENTER: Turn on the first camera.<br/> ESC: Close the first camera.<br/> ARROWS: Direction R / L / D / U Worm1.<br/> P: Pause On / Off (Worm1). If in pause it is possible to scroll the level.<br/> E: Unlock Error x Dead End (Worm1).<br/> S: Change the special text display mode (Worm1).<br/> T: Change the text display mode (Worm1).<br/> O: Waves On / Off (Worm1).</p>\n<p> SPACE: Turns on the second camera.<br/> TAB: Close the second camera.<br/> SHIFT + ARROWS, 6,4,2,8: Direction R / L / D / U Worm2.<br/> SHIFT + P: Pause On / Off (Worm2). If in pause it is possible to scroll the level.<br/> SHIFT + E: Unlock error x dead end (Worm2).<br/> SHIFT + S: Change the special text display mode (Verme2).<br/> SHIFT + T: Change the text display mode (Verme2).<br/> SHIFT + O: Waves On / Off (Worm2).</p>\n<p> F1, F2: Select 1 or 2 players (1 player camera change).</p>\n<p> Paolo Fassin (PCDear.ent.games)</p>", "metacritic": null, "released": "2021-09-05", "tba": false, "updated": "2021-09-07T01:04:19", "background_image": "https://media.rawg.io/media/screenshots/a67/a676ddbecac60139d3243c16d856d153.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 35, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Paolo Fassin"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}