{"id": 652220, "slug": "inner-demons-aw-morgan", "name": "Inner Demons (A.W. Morgan)", "name_original": "Inner Demons (A.W. Morgan)", "description": "<p><em><strong>Inner Demons</strong></em> is a supernatural horror story set in modern-day Seattle. It's a text-based interactive fiction, with choices throughout to determine your character's appearance, personality, skills, and relationships.</p>\n<p>You play as the family screw-up who accidentally unleashes hell right in the middle of Pike Place Market. Whether you save the world or succumb to your darker side is entirely up to you.<br/></p>\n<p><em>Inner Demons can be played on PC and mobile!</em></p>\n<p>This game is a work in progress and new chapters will be released periodically. For updates, please follow the <em>Inner Demons</em> tumblr blog.</p>\n<p><strong>Content Warnings:</strong> this game is currently <strong>rated 16+</strong> and contains strong language, depictions of violence, death, murder, and trauma. Optional 18+ sexual content to be added later.<br/></p>\n\r\nYou hadn't meant to start the apocalypse today, yet here you are: sandwiched between two sorcerers and facing off against a horde of snarling demons as they rampage through Downtown Seattle.\r\n<p>When your grandmother passes away unexpectedly, you are thrust into the world of dark magic; a world she tried all your life to keep you safe from.<br/><br/>Like Nana, you possess abilities that could be humanity’s saving grace...or their downfall. You're hunted by demons and sorcerers alike as you learn to wield your powers, but with good and evil on both sides, who can you trust?</p>\n\n<ul><ul><li>Play as female, male, or non-binary (set pronouns separately or enter your own)</li><li>Romance, befriend, or antagonize any of six characters, three of whom have selectable genders of female, male, or non-binary</li><li>All ROs are romanceable by any MC (you will not be asked to specify your sexuality)</li><li>Romance is not required; every RO has a platonic path</li><li>Customize your appearance, personality, emotional intelligence, etc.</li><li>Hone your sorcery skills &amp; demonic influence</li><li>Select an animal familiar (or don't)</li><li>Save humanity or leave them to their doom</li></ul></ul>\n\n<p><strong>Desi (gender selectable)</strong> is your relentlessly optimistic childhood best friend. You recently rekindled your friendship after losing touch for over a decade, but when Nana dies, you discover that Desi has been hiding way too many secrets from you. Can you trust the charismatic sorcerer or is this easy friendship hiding wicked intentions?</p>\n<p><strong>Ciaran (male, he/him) </strong>is the brooding, secretive sorcerer who Nana entrusted with your protection. As you spend more time with him, you find that there’s a softer side lurking beneath Ciaran’s tough exterior. But does this multifaceted man really have your best interests at heart?</p>\n<p><strong>Yu (enby, they/them)</strong> is a master sorcerer from the Order of Watchers, a group hellbent on harnessing your unique abilities. Enchanting and elusive, Yu makes it clear early on that they are not to be trusted. Then again, they could capture you with the flick of a wrist...so what are they waiting for?</p>\n<p><strong>Sam (gender selectable)</strong> is the deeply sardonic Nephilim currently residing in your head. As the offspring of Samyaza, the fallen angel who led the Watchers to their downfall, Sam is more powerful than you and your friends can comprehend. So why are they spending their time teaching you how to banish their kind?</p>\n<p><strong>Amina (female, she/her) </strong>is a young Cambion who devoted her life to serving Sam. She’s dispatched to watch over you and, diligent to a fault, ends up biting off more than her fangs can chew. Fierce, fiery, and too intense for her own good, can Amina be trusted or is she simply following orders?</p>\n<p><strong>James (gender selectable)</strong> is a sweet, nerdy comic shop owner who gets roped into the whole ordeal when you seek out their expertise. As the town’s resident demonic lore keeper, they’re no stranger to the darker side of Seattle. But is there more to James than meets the eye?</p>\n<p>Character Page | Playlists | Mood Boards</p>\n<p>Thank you for reading! If you encountered any bugs or typos that you'd like to report, please complete this form. &lt;3</p>", "metacritic": null, "released": "2021-09-04", "tba": false, "updated": "2021-09-07T01:16:03", "background_image": "https://media.rawg.io/media/screenshots/5e8/5e8d418424ed94be630b173497f0d46d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 89, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["A.W. Morgan"], "genres": [], "publishers": [], "esrb_rating": null}