{"id": 65239, "slug": "spring-it", "name": "Spring It!", "name_original": "Spring It!", "description": "You have just been hired to fix the mess that is Toy Robot Emporium's production line.  <br/><br/>The men and women down in engineering have whipped up various tools they believe will help you make a complete production line.  You just need to drag and drop these springs and other such tools onto the line, and <strong>TA-DA</strong>, they are built before your eyes. <br/><br/>They made you some springs for bouncing the robots, fans for blowing the robots, and these magnet things for...I'm not really sure what they are for, they just sorta spin the robots in circles.  You're the expert so I'm sure you'll figure it out, I mean that is why we hired you.<br/><br/>You can always send a test robot down the line to make sure it works. But some of the production lines have more problems than may first appears. We have 50+ lines in need of your expertise.<br/><br/> We are also cutting costs and only making limited tools for you to use.  But you'll be fine.  If you need me, I'll be in my office overseeing the rest of Human Resources.<br/><br/><strong>Key Features</strong><br/><ul><li>Four different unique tools to use<br/></li><li>Tools combine for an even greater effect<br/></li><li>Ability to create infinite loops, you know, for \"science\"<br/></li><li>60 levels, with the last 5 so hard even the programmer didn't beat them<br/></li><li>Awesome soundtrack</li></ul>", "metacritic": null, "released": "2018-02-12", "tba": false, "updated": "2019-08-28T21:54:23", "background_image": "https://media.rawg.io/media/screenshots/a9b/a9b07a10b6523890b236e58323fbea31.jpg", "website": "http://www.pagodagames.net/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 232, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "Linux", "PC"], "developers": ["Pagoda Games"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["Pagoda Games"], "esrb_rating": null}