{"id": 6523, "slug": "cut-the-rope-magic", "name": "Cut the Rope: Magic", "name_original": "Cut the Rope: Magic", "description": "<p>ABRACADABRA! After more than 960 million downloads, the Cut the Rope series returns with a magical new sequel: Cut the Rope: Magic!</p>\n<p>Join Om Nom’s newest adventure and transform him into magical forms to help the lovable little monster recover candy stolen by an evil wizard!</p>\n<p>EXCITING NEW FEATURES<br />\n- A magical world with completely new graphics, sound and gameplay elements<br />\n- 6 ways to transform Om Nom into magical creatures along his journey<br />\n- Complex boss levels that will challenge your candy-crunching, rope-cutting skills<br />\n- 160+ all-new puzzles, with more coming soon</p>\n<p>A magical mishap has accidentally teleported Om Nom to a mystical world filled with challenging puzzles for players of all ages. Can you use Om Nom’s new skills to solve an evil wizard’s tricks and traps? The latest installment of this globally popular entertainment franchise puts a fresh spin on Cut the Rope’s iconic physics-puzzle gameplay, introducing more than 160 all-new magic-themed levels across a richly imagined, colorful world.</p>\n<p>MAGICALLY TRANSFORM OM NOM INTO NEW FORMS<br />\n- The Bird Form helps Om Nom fly up above obstacles and potential traps<br />\n- The Baby Form allows Om Nom to squeeze into small, restricted spaces<br />\n- The Fish Form can help Om Nom dive deep to snatch up all the delicious candy<br />\n- The Mouse Form gives Om Nom a heightened sense of smell to help him sniff out the sweets he craves<br />\n- The Spirit Form ensures that nothing gets in Om Nom’s way during his magical journey<br />\n- The Dragon Form summons a powerful sneeze that sends everything flying</p>\n<p>THAT’S NOT ALL -- Additional levels and transformations coming soon!</p>\n<p>Already a fan? Stay in touch!<br />\nLIKE US: http://facebook.com/cuttherope<br />\nFOLLOW US: http://twitter.com/cut_the_rope<br />\nWATCH US: http://youtube.com/zeptolab<br />\nVISIT US: http://cuttherope.net/</p>", "metacritic": 87, "released": "2015-12-16", "tba": false, "updated": "2023-04-22T17:00:13", "background_image": "https://media.rawg.io/media/screenshots/348/3483d421eb388193dca2dffaeafec540.jpg", "website": "http://cuttherope.net", "rating": 4.0, "rating_top": 4, "added_by_status": {"yet": 1, "owned": 8, "beaten": 11, "toplay": 1, "dropped": 7}, "playtime": 0, "achievements_count": 0, "ratings_count": 10, "suggestions_count": 94, "game_series_count": 14, "reviews_count": 10, "platforms": ["Android", "iOS"], "developers": ["ZeptoLab"], "genres": ["Arcade", "Casual", "Puzzle"], "publishers": ["ZeptoLab UK"], "esrb_rating": "Everyone 10+"}