{"id": 652672, "slug": "dollface-steamvr-version-vive-rift-index-etc", "name": "Dollface (SteamVR version - Vive, Rift, Index etc)", "name_original": "Dollface (SteamVR version - Vive, Rift, Index etc)", "description": "<p>Dollface - my Master's project in Creative Digital Media and UX specialising in VR. </p>\n<p>The original version featured an onboarding level, challenges and missions - but I have removed these and cleaned things up a little to help them play on newer devices. The older version was not working great with updated software for Oculus or SteamVR so this has been retooled a bit to try and reduce problems - as it's now just a side project, the new version has not been tested as much so it could be terribly buggy on your device. </p>\n<p>I've released the keyboard separately for both Oculus Quest with hand tracking and for SteamVR - see my other pages for links.</p>\n\n<p>Features - books, records, toys, things to play with in the doll house. You can make your own music with an experimental keyboard, take photos with a manual camera, buy more objects on your laptop with unlimited money, and cook food - or burn it. You can also redecorate your home with fabric swatches, bigify or de-bigify your objects and yourself, and hack your doll house on the laptop using snakescript.</p>\n<p>All of the media content is female - I was inspired by memories from my childhood, and by themes of being a little girl playing with dolls, and having all these different inspirations and influences thrown at you - so you can watch a 1980s exercise tape or watch Oprah, or the Mary Tyler Moore show, read Anne Frank's diary, or Germaine Greer, or turn the keys on your doll friends' backs to hear Malibu stacey quotes. </p>\n<p>Music samples for educational purposes only.</p>", "metacritic": null, "released": "2021-09-03", "tba": false, "updated": "2021-09-07T03:15:55", "background_image": "https://media.rawg.io/media/screenshots/aa9/aa91ccf8ac360b91da5120a12a4cff10.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 151, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ciara Tamay"], "genres": [], "publishers": [], "esrb_rating": null}