{"id": 652642, "slug": "scatternoid", "name": "Scatternoid", "name_original": "Scatternoid", "description": "<p>CURRENTLY IN A VERY WIP STATE - nothing works! The loading of the spritesheet and level background should work on the WebGL version, but that's it. Unfortunately couldn't finish during jam time, but decided that heck it, I'll just upload what I had done. More information below. I will be updating this in the future to a working version though, as it is the first real project for KAPE homebrew and helps me develop that further as well.<br/></p><p>An entry to the 3rd Vaultacular Game Jam. Unfortunately fell ill for over a week during the jam, so didn't finish. Have plans for finishing it all later. Here is the preliminary Web Emulator playable in the browser, and also the latest emulator version for download (should work for all desktop computers, whether Windows Linux or Mac). Both of them get stuck, WebGL version because it uses a test binary file, and the DesktopGL version because it gets halted on a non-implemented GPU/CPU operation. But ehhh here they are.<br/><br/>The project is for KAPE 8bit homebrew console, in 6502 assembly. To help everyone else play it as well, I've been working on an emulator for both desktop and web.<br/></p>\n<p>The game idea itself is a Arkanoid/Breakout kind of paddle/ball game where you break bricks, with added \"open world\" level traversal. There are keys to collect, bricks to break, doors to unlock, treasures to be found and secrets to unveil.<br/><br/>Screenshots are from mockups and/or from emulator.<br/></p>\n<p>To be updated.<br/></p>", "metacritic": null, "released": "2021-09-03", "tba": false, "updated": "2021-09-07T03:06:11", "background_image": "https://media.rawg.io/media/screenshots/7fa/7fa0944d170b11dda68b0e4c6e10f502.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 84, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["zment"], "genres": ["Action"], "publishers": [], "esrb_rating": null}