{"id": 652613, "slug": "indiepocalypse-20", "name": "Indiepocalypse #20", "name_original": "Indiepocalypse #20", "description": "ISSUE #20\r\nCover - Teal Sather  \r\n\n<p>Hello and welcome to Indiepocalypse!</p>\n<p>Indiepocalypse is a curated monthly collection looking to highlight the very best of the DIY indie game scene. </p>\n<p>Each month will feature games by 10 different developers, including newly commissioned game exclusive to the bundle-zine. The games cover a wide variety of styles, genres, and themes as they fight against any definition of \"indie game\" as a genre.</p>\n<p>Also, and this part is very important to me and should truly be taken as given, each contributor is paid and developers are paid royalties on all future sales.<br/></p>\n<p>*NOTE* Fuzz Dungeon is too big and needs to be uploaded on its own. Unzip it and put it in the \"Jeremy Couillard\" folder and it should be fine</p>\r\nThis Month's Games\r\n<br/>Will Die Alone (WIN/MAC) by Arianna Ravioli\r\n\n<p>The first breakthrough for Alex came when her best friend Vince realized that some memories are not meant to be kept. The second coincided when she was hired by Dewitt Corp. On paper, the task is simple: to delete her clients’ painful memories so that they could be happy again. Her new job begins in two days. Alex will find herself lonely and in the middle of nowhere with an assignment that no one wants to do. She must make hard choices. Her entire world resides in her computer, but reality will keep intruding. All she can do is pray and hope that nothing bad will happen to her family while she is stuck in virtual hell. Will Die Alone is a journey through painful memories. It’s a game about loss, the role of the past, and possible futures. Every choice comes with a price. Will you be willing to pay?</p>\n\r\nMind Psychometry (WIN/MAC/Browser) by Juniper-C\r\n\n<p>Mind Psychometry is a personality test designed by a dystopian HR department to coerce employees into signing away their freedom. Contains body horror, exploitation, and highly subjective poems.</p>\n\r\nFuzz Dungeon (WIN) by Jeremy Couillard\r\n\n<p>The well back to your job has been absorbed inside a sasquatch sex amulet. Journey through 15 levels of absurdist human history to try and bring it back.</p>\n\r\nAnd Other Stories<strong> </strong>(WIN/Browser) by JohnLee Cooper, Austin Heller\r\n\n<p>And Other Stories is a mixed media mess of bitsy, unity, photography, sprite work, and more. Live through four stories at once, as the mind does, and watch as mysterious effects unfold in the margins.</p>\n\n<p>Retromeme Generator (WIN/MAX) by Vector Hat</p>\n<p>IT'S A JANKY TOOL FOR MAKING JANKY MEMES... or is it more? WHAT WILL YOU MAKE WITH IT?<br/></p>\n\n<p>Anxietyware (Android*/WIN/MAC) by Kate Killick<br/></p>\n<p><em><br/>*The game is designed for mobile</em><br/>Think fast to beat the recurring nightmares in this collection of disturbing, quick-fire mini games.</p>\n<p>- Glue your teeth together! <br/>- Escape that inexplicably fast rising tide! <br/>- Don’t be naked at work!</p>\n\n\n<p>Stakes and Strategy (Physical) by Jeremy Harper</p>\n<p>A Lasers and Feelings hack about exploring the supernatural, fighting vampires and demons, and protecting your high school from whatever baddies that forsaken place attracts. Can you defeat the big bad and save your school? Find out in Stakes and Strategy!</p>\n\n\n<p>A Twisted Place (WIN/Browser) by Rana Strange</p>\n\n<p>A Twisted Place is cosmic horror interactive fiction game built around self-loathing thoughts of unproductivity and uselessness. Content warning for self-loathing thoughts, discussion of suicide, and grief</p>\n\n<p>Space Hop: EP. 1 <strong>(WIN) by </strong>Curryswirl</p>\n\n<p>curry, the terrible <br/>Space Hop: EP. 1 is the beginning of a kinetic visual novel about ambition, family, and weird little guys shooting rayguns. ye-rin and their co-hop annie are space hoppers, adventurers for hire, except in outer space.</p>\n\n<p><em>*NEWLY COMMISSIONED FOR INDIEPOCALYPSE*</em></p><p>oxalis (WIN) by 01010111</p>\n\n<p>OXALIS is a virtual remote ranger application\r\n</p>\n<p>Operators conduct various missions to determine optimal action sequences.\r\n</p>\n\n<p> </p>\n<p><strong>*BONUS*Electric Zine Maker </strong>(WIN/MAC) by alienmelon</p>\n\r\nLauncher Courtesy of MM Bundle Launcher\r\n\r\nIndiepocalypse zine contents\r\n<p><strong>COMICS<br/></strong><em>Screen Snacks</em> by Sam Pender<br/><em>Not Hot</em> by feardeer</p>\n<p><strong>FEATURES</strong><br/><em>Cassidy's Bad Game Corner: Bad Street Brawler</em> by Cassidy<br/>Parts 37-39 of <em>69 Games About Romance</em> by Andrew<br/></p>\n<p>Interested in the Indiepocalypse being delivered straight to you every month? Sign up for the <strong>PATREON</strong>.</p>\n<p>If you are interested in contributing to Indiepocalypse check out the submission page:</p>\n<p><strong>SUBMIT YOUR GAME TO THE INDIEPOCALYPSE</strong></p>\n<p><strong>TUNE INTO INDIEPOCALYPSE RADIO, SATURDAYS 7pm EST</strong></p>\n<p><strong>FOLLOW INDIEPOCALYPSE ON TWITTER</strong><br/></p>\n<p><strong>COMIC ARTISTS AND OTHER ZINE CONTRIBUTORS APPLY HERE</strong></p>\n<p><strong>SIGN UP FOR THE NEWSLETTER </strong>(and get free copies of the PDFs!)</p>\n<p><strong>THE FULL INDIEPOCALYPSE CATALOG</strong></p>\n<p><strong>DISCORD</strong></p>\n<p><strong>ADVERTISE WITH US</strong></p>", "metacritic": null, "released": "2021-09-03", "tba": false, "updated": "2021-09-07T02:58:39", "background_image": "https://media.rawg.io/media/screenshots/147/147efd68ebd0c08cffe5abdbb883e028.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 8, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["PIZZAPRANKS"], "genres": ["Action", "RPG"], "publishers": [], "esrb_rating": null}