{"id": 652727, "slug": "homem-chiclete-infinity-run", "name": "Homem Chiclete - Infinity Run", "name_original": "Homem Chiclete - Infinity Run", "description": "<p>Homem-Chiclete – Infinity Run é um jogo de corrida infinita onde o personagem principal é o super herói brasileiro criado por Ede Galileu.</p>\n<p>Criado pela Hera games, o jogo apresenta o herói das histórias em quadrinhos, pela primeira vez em um game onde iremos ajudar nosso herói a superar os obstáculos colocado pelos vilões.</p>\n<p>Nessa corrida infinita, corra, pule os obstáculos com o Homem-Chiclete. Você também pode destruir os vilões e suas armas ao adquirir alguns “power-ups”, use os itens mas preste atenção no tempo.</p>\n<p>Você também pode arrecadar as moedas até conseguir o suficiente para desbloquear os outros personagens do universo do Homem-Chiclete.</p>\n<p>QUEM É O HOMEM-CHICLETE</p>\n<p>O jovem Wesley Josuá, após sofrer um acidente envolvendo descarte clandestino de uma fábrica de doces, acaba ganhando super poderes, agora seu corpo possui as propriedades de um chiclete, permitindo que ele se estique e mude a densidade e viscosidade conforme sua vontade, além de uma pele rosa e um cheirinho de tutti-frutti.</p>\n<p>Quer conhecer mais sobre o personagem, acesse:</p>\n<p>Seu perfil no instagram: www.instagram.com/homemchiclete</p>\n<p>Sua HQ também pode ser comprada na loja do autor em: www.jundcomics.com.br/loja</p>", "metacritic": null, "released": "2021-09-03", "tba": false, "updated": "2021-09-07T03:32:38", "background_image": "https://media.rawg.io/media/screenshots/4f3/4f312870a04b41e0c31dedf826e89529.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 260, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Renan Felipe"], "genres": ["Action"], "publishers": [], "esrb_rating": null}