{"id": 6527, "slug": "zombie-panic-in-wonderland-plus", "name": "Zombie Panic in Wonderland Plus", "name_original": "Zombie Panic in Wonderland Plus", "description": "“Zombie Panic in Wonderland”, which reached number one in the Nintendo WiiWare worldwide rankings, has now come to the iPhone, iPod Touch and iPad in improved and extended form!<br/><br/><br/>* iOS-exclusive features<br/>- Streamlined and intuitive controls perfectly suited to the iPhone, iPod Touch and iPad!<br/>- New levels and enemies! <br/>- Spectacular HD graphics compatible with the Retina display! <br/>- 3D sound! <br/><br/><br/>*  Summary<br/>From a fog of exotic perfume arises a plague of amorous zombies, and now they’re invading all your favorite fairytale kingdoms! What the heck is going on here? Who’s responsible for this apocalyptic mess? There’s only one way to find out -- it’s time to take up arms and carve your way to the root of the problem in a spray of bullets, flames, and grenades!<br/><br/>- You’ll bust a gut laughing in this action-packed shoot ‘em up!<br/>-Demolish anything you see, including the game’s very environments! <br/>- Seven playable characters, and drop us a line to let us know what you want in updates!<br/><br/><br/>* What the press said about the WiiWare version of “Zombie Panic in Wonderland”<br/><br/>- Picked up as App of the Day by EUROGAMER<br/>“Destructible environments: so simple, so effective. I will never, ever tire of this.”<br/><br/><br/>- FAMITSU<br/>“Very good work. Beautiful character design. Its well-adjusted difficulty makes it very addictive. Weapon changing provides for a high level of strategy.”<br/><br/><br/>- MERISTATION<br/>“A success in every way. Great atmosphere. Brilliantly adjusted gameplay.  Probably the most standout WiiWare game on a technical level.”", "metacritic": null, "released": "2012-03-01", "tba": false, "updated": "2019-10-22T14:28:57", "background_image": "https://media.rawg.io/media/screenshots/513/5135be8d3a225087760a4011e32a3184.jpeg", "website": "http://www.akaonistudio.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 257, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Akaoni Studio"], "genres": ["Action", "Arcade", "Casual"], "publishers": ["Akaoni Studio"], "esrb_rating": null}