{"id": 65280, "slug": "amazon-rush", "name": "Amazon Rush", "name_original": "Amazon Rush", "description": "Enjoy the unique world of adventure and challenges. \"Amazon Rush\" is an infinite running game with lots of thrill and fun. This running game is beautifully designed with 2D pixel art with fascinating background and awesome sound effects. The game is so exciting and interesting that you can play this game anytime you want irrespective of time and location. <br/>\n<br/>\r\nAmazon Rush - is very easy to play with intuitive gaming controls perfect for players from all groups kids to teens to adults. The game has also got lot many surprises while you play. Enjoythe huge variety of diamond stores and enjoy its luxury. You can also buy power up upgrades with the coins you collected to cover the maximum distance in this unlimited infinite rush game. These power up upgrades help you with speed, jet and increase your acceleration. You can also get these exciting power up upgrades during the game as the bonus points.<br/>\n<br/>\r\n=================<br/>\r\nGAME FEATURES<br/>\r\n=================<br/>\r\n-\tCollect coins and diamonds<br/>\r\n-\tAvoid the deadly spikes<br/>\r\n-\tBuy power-up upgrades<br/>\r\n-\tBuy new characters to play<br/>\n<br/>\r\nCheck out for new and trending characters in the Amazon Rush store and get your favorite character with unique powers. The game is the best and only one of its kind to keep you or your kids engaged all the time. Along with you can also check out your gaming skills and response skills with the game. Get the game and enjoy the unlimited fun of this infinite Amazon Rush game.<br/>\n<br/>\r\n=================<br/>\r\nHOW TO PLAY<br/>\r\n=================<br/>\n<br/>\r\nPess 'Space' to jump!, hold the button to jump higher!!", "metacritic": null, "released": "2018-03-06", "tba": false, "updated": "2023-07-22T21:09:59", "background_image": "https://media.rawg.io/media/screenshots/3a1/3a13ad63d6584e58123da4f7bd571aca.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 32, "dropped": 1}, "playtime": 1, "achievements_count": 124, "ratings_count": 1, "suggestions_count": 77, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "macOS", "Linux"], "developers": ["Victor Corradi"], "genres": ["Adventure", "Simulation", "Casual", "Indie"], "publishers": ["Corradi Games"], "esrb_rating": null}