{"id": 652814, "slug": "skippers-maze-demo", "name": "Skippers Maze Demo!", "name_original": "Skippers Maze Demo!", "description": "<p>“Are you ok with how it ended? Well? Are you?</p>\n<p>You're Not? Good!!! <br/>It’s time to climb your way out and take back your life then!</p>\n<p>It won't be easy though, I, Death will guide you as much as I can without breaking any rules. </p>\n<p>Skipper it's time to climb your tower free from this realm of souls. Good luck, and remember……. I am always around the corner.”</p>\n<p><strong>Harm Has Fun presents to you Skippers Maze Demo!</strong><br/></p>\n<p>After his gruesome and untimely demise Skipper finds himself confronted by a slightly peeved and very sympathetic manifestation of death...with a capital D. With his schedule in total disarray, Death is set on helping Skipper escape the land of the dead to set things right; and maybe get some revenge in the process. Purgatory Tower, the barrier between the realms, with its winding stairs and hidden secrets is all that stand between your skeletal hero and his second chance at life. Death himself is restricted by the code of immortal law, unable to return you directly to the land of the living; he will however keep you on the right path and out of the afterlife by returning you to the Tower floor should you be unsuccessful in traversing it.</p>\n<p>This is the demo for our game releasing on December ,2021.</p>\n<p>Please let us know what you think of this demo. We are excited to read your comments and suggestions for improvements </p>\n<p>You can also support us on Kickstarter https://www.kickstarter.com/projects/skippers-maze/skippers-maze</p>", "metacritic": null, "released": "2021-09-03", "tba": false, "updated": "2021-09-07T04:01:15", "background_image": "https://media.rawg.io/media/screenshots/124/124ebdb6b9b42fd462eae9ea619ac02c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["HarmHasFun"], "genres": ["RPG", "Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}