{"id": 652989, "slug": "legpuzzel", "name": "Legpuzzel", "name_original": "Legpuzzel", "description": "<p><strong>English:</strong></p>\n<p><strong>\"<em>Legpuzzel</em>: <em>Puzzles in German.\"</em> </strong></p>\n<p>The topic of miniaturization is seen daily around us; we want to explore that in different ways; it's an ambitious project whose idea came about thanks to the <strong>Epic MegaJam 2021.</strong></p>\n<p>You take the role of a volunteer to participate in a military technology project, codenamed \"<strong>NEQSE</strong>\" (Spanish acronym for \"<em>Nos Estamos Quedando Sin Espacio</em>,\" or \"<strong><em>We're Running Out of Space</em></strong>\").</p>\n<p>This project has many advantages, it can carry weapons, different types of cameras, gadgets and technological components, however its versatility is affected by the lack of space between its components and in the maximum load capacity.</p>\n<p>Initially the volunteer will only be able to explore the basic functions of the \"NEQSE\" project, which will push the technological marvel to its limits, but it won't be long before the project acquires new horizons... or even intelligence of its own.</p>\n<p><strong>Note: </strong>This game has been created with the idea of being told in chapters and additionally there will be temporal changes between one chapter and another.</p>\n\n<p>_________________________________</p>\n<p><strong>Español:</strong></p>\n<p><strong><em>\"Legpuzzel: Rompecabezas en Alemán.\" </em></strong></p>\n<p>El tema de  la miniaturización se ve a diario a nuestro al rededor; queremos explorar eso de diferentes maneras; es un proyecto ambicioso cuya idea surgió gracias a la<strong> Epic MegaJam 2021.</strong></p>\n<p>Tomas el papel de un voluntario para participar en un proyecto tecnológico militar, con nombre clave \"<strong>NEQSE</strong>\" (Acrónimo en español de \"<em>Nos Estamos Quedando Sin Espacio</em>\").</p>\n<p>Éste proyecto tiene muchas ventajas, puede portar armas, diferentes tipos de cámaras, artilugios y componentes tecnológicos, sin embargo su versatilidad se ve afectada por la falta de espacio entre sus componentes y en la capacidad máxima de carga.</p>\n<p>Inicialmente el voluntario sólo podrá explorar las funciones básicas del proyecto \"NEQSE\"; que pondrán al límite la maravilla tecnológica, sin embargo no pasará mucho antes de que el proyecto adquiera nuevos horizontes... o incluso inteligencia propia.</p>\n<p><strong>Nota: </strong>Éste juego se ha creado con la idea de ser contado en capítulos y adicionalmente habrán saltos temporales entre un capítulo y otro.<br/></p>\n<p>_________________________________\r\n</p>\n<p><strong>CONTROLS:</strong><br/></p>\n<p>Movement: W,A,S,D</p>\n<p>Camera: Mouse.</p>\n<p>Jump: Space bar.</p>\n<p>Sprint: Shift</p>\n<p>Switch camera: V</p>\n<p>Restart level: L</p>\n<p>_________________________________</p>\n<p><strong>THIRD PARTY:</strong></p>\n<p><strong>SuperGrid Starter Pack</strong> - By ZeOrb - Unreal Marketplace.</p>\n<p><strong>HUD Elements by Shizune </strong>- https://www.vecteezy.com/vector-art/2202532-set-of-ui-and-hud-game-ready-element...</p>\n<p><strong>Font</strong>: Sarpanch - Google Font.</p>\n<p><strong>Wallpaper</strong>: Wallpaperacces.</p>\n<p><strong>Audio:</strong> Andromeda by WeLoveIndies</p>\n<p><strong>Sounds:</strong> SCIENCE FICTION DEVICE Metal Rattle Lock 01,02 and 03 by WeLoveIndies</p>", "metacritic": null, "released": "2021-09-02", "tba": false, "updated": "2021-09-07T04:55:49", "background_image": "https://media.rawg.io/media/screenshots/c9c/c9c872fc2f11ea38985aaeb524f321ef.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 90, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["virthauri_games"], "genres": ["Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}