{"id": 652964, "slug": "remedy-itch-geomart", "name": "Remedy (itch) (geomart)", "name_original": "Remedy (itch) (geomart)", "description": "<p>***NOTE TO ALL + JUDGES: Unfortunately a slight hiccup prevents you from activating the final node and completing the mission. We have a fixed build and will publish when able due to the nature of the jam. Thanks for understanding and thank you for playing Remedy***</p>\n<p>You are an anti-virus program inside a Quantum Computer where data processing is represented by the Quantum Processing Landscapes. The system is under attack and it is your job to protect it. Use various weapon modes, platforms, and more to fight through incoming viruses. Use the Neural Node Network to lockdown parts of the system by activating the nodes. Keep an eye on your memory though as your program can only handle so much in one area. This means enemies, placing platforms, and even firing your mighty RAMREX virus shredder will take up memory, and you might not want to run low on that or bad things will happen. As well nodes and doors can only be accessed with all memory cleared so you’ll have to clear the area of enemies before accessing the node. Time is of the essence, get out there and defeat those viruses.</p>\n<p>Remember Priority 1: Protect the System\r\n</p>\n\n\n<p>If controls are stuck, pause and unpause the game, also, check your memory space, might be the issue.</p>\n<p>There are a total of 6 nodes, 1 in each \"arena\" which is defined as where the enemies spawn from portals (except the very first one). Look high and low for them and make sure you active them before moving on. The Last Node is the Center node in the junction room but requires the other rooms nodes be activated first before ending the game.</p>\n<p>Gameplay Instructions:</p>\n<p>WASD, Mouse</p>\n<p>Space – Jump</p>\n<p>LMB – Shoot</p>\n<p>RMB – Place Platform</p>\n<p>Q,E or 1,2,3 – Weapon Select and Toggle</p>\n<p>R – Clear Weapon Memory Cache</p>\n<p>X – Clear Platform Memory Cache</p>\n<p>Z – Platform Debug</p>\n<p>T – Toggle Timer</p>\n<p>LALT – Platform Flip</p>\n<p>LShift – Dash</p>\n<p>C – Momentum Stop</p>\n<p>***P.S. There’s an in game “tutorial” which also displays this info***</p>\n<p>Content Created before Jam:</p>\n<p>KitBash Monument Pack</p>\n<p>Main Menu UI Sounds: Soundly, dynamedion</p>\n<p>Main Menu Scene Assets: UM – Modular SciFi Office</p>\n<p>Circuit Texture: UM – Circuit Textures</p>\n<p>Shotgun Mode Sound: UM – Ultimate Sound FX</p>\n<p>Launcher Mode Sound: UM – Ultimate Sound FX</p>\n<p>Clear Weapon Cache Sound: dynamedion</p>\n<p>Clear Platform Cache Sound: dynamedion</p>\n<p>Launcher Explosion: UE FPS Starter Content</p>\n<p>Arms but with changed material: UE FPS Starter Content</p>\n<p>Idle and Jump Animations: UE FPS Starter Content</p>\n<p>Grid Material: UM – Prototype Grid Material</p>\n<p>Muzzle Flash: Previous Project</p>\n<p>Death Sound for Virus 5: dynamedion</p>\n<p>Laser wind up and shot: dynamedion</p>\n<p>Boss Intro Sound: dynamedion</p>\n<p>A few materials and assets from: UM - Science Lab</p>\n<p>Loading Cutscene, Intro Animation: Youtube, uncopyrighted, free use.</p>\n<p>Fonts: Online various</p>\n<p>Title Background: contentlab.com </p>\n<p>Everything else was made in house for the jam! Including but not limited to:</p>\n<p>Music, Models, Animations, Narration, Menu Widgets and Images, Variety of Sounds and of course the mechanics and game!</p>\n<p>We hope you enjoy!</p>", "metacritic": null, "released": "2021-09-02", "tba": false, "updated": "2021-09-07T04:47:12", "background_image": "https://media.rawg.io/media/screenshots/eb7/eb752eb063ae15a2204beb9b73ee9f62.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 14, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["geomart"], "genres": [], "publishers": [], "esrb_rating": null}