{"id": 653072, "slug": "holevos-bound-planet-meltdown", "name": "HOLEVO'S BOUND: PLANET MELTDOWN", "name_original": "HOLEVO'S BOUND: PLANET MELTDOWN", "description": "\n<p>A giant alien crashed into Planet Holevo and you need to rid this monster before you fall off of it!</p>\n<p>Holevo's Bound is a 2.5D Side-scroller based in outer space featuring an interesting idea of run in and out of space. The players can utilize a Freeze Flame Thrower to help them with their journey and the final boss battle! Enemies will shoot at you even when they miss, your ground will disintegrate before you know it! Get moving before you run out of space!</p>\n<p>This is a rare photo of the idiot who is wrecking your planet. Do you have what it takes to defeat his might? (By the way, that thing in his hand is an arm from his fallen brethren. This way, even in death, they can still make war).</p>\n<br/>\n<p>1 MINUTE DEMO</p>\n<p>FULL PLAYTHROUGH</p>\n\n<p><strong>TEAM BIOS:</strong></p>\n<p><strong>AUTUMNREALM</strong>\n</p>\n<p>Pratyush Srivastava- Lead Developer - Responsible for programming the Level Pools (prep work for procedural level generation), Random Block Generators (RBG’S), Platform Enumerators, Main Character, and the Main Boss fight. He also shared the responsibility with Phil regarding the cleanliness of the repository and sound implementation. \r\n3 Yrs. Game Industry experience, 3 Years Unreal Engine 4. \r\n</p>\n<p>Phil Randolph Sinchioco- Programmer - Responsible for weapons and enumerators, damage, controls, repository, turrets, block disintegration, UX Widget and game flow, sfx implementation, and Goblin Gunner A.I. \r\n4 Yrs. Game Industry experience, 4 Years Unreal Engine 4. \r\n</p>\n\n<p>\n<strong>YHWH GAMES!, LLC.</strong>\n</p>\n<p><strong>Shawn A. Irons</strong> - Junior Lead Animator- Responsible for 90% of the main characters' animation sets. We actually had 2 guns planned and he created both sets, unfortunately, the 2nd didn’t make it in. 3 Yrs. Game Industry experience, 3 Years Unreal Engine 4. \r\n</p>\n<p>\r\nJason Stansbury- Creative Director - Responsible for Creative Direction, Story, Cinematics, Video Editing, Level Design, Level Flow Mapping, Unreal Engine Environment Composition, Lighting, Logo Design, and keeping the team level Headed. 20 Yrs. Media and Film Industry experience, &lt;1 Year Unreal Engine 4.\r\n</p>\n<p><strong>Vincent Michah’El Donatelli </strong>- Director/ Producer -<strong> </strong>Responsible for G.D.D., Asset Control Lists (ACL), Scheduling, Production Pipeline, Reverse Engineering, Cross-Department Communication, Character Modeling, Unwrapping, Texturing, Sculpting, Rigging, 10% of Main Character Animations, Boss Animation, Goblin Animation, Scene Assembly, RBG Planning and Implementation, SFX Design, VFX implementation, General Workflow Efficiency and Branding. <br/>20 Yrs. Game Industry experience, 14 Year Unreal Engine 4.</p><p>KNOWN ISSUES\r\n</p>\n<p>SOFT CRASHES (MEANING, THE GAME LOCKS UP INTERNALLY, NOT ALLOWING YOU TO PROGRESS ANY FURTHER).\r\n</p>\n<ul><li>As you start climbing up the vertical level pool and you happen to die from around that area moving forward, the system spawner spawns the player in at the height of the previous levels spawning area and not higher up. The player will continue to spawn into a death loop.\r\n</li><li>At the apex of the vertical area, there is a turret that is destroying a crucial block. If that block gets destroyed, the player can not move forward.\r\n</li><li>Sometimes when the boss hits you with his arm-hammer, you get ejected out of the map.\r\n</li><li>In the beginning area, the platforms go below the pit, meaning you can ride them down to your death.\r\n</li><li>There is a lower-platform right before the double-bridges that if you fall on it, the distance is too great for you to jump onto the next platform.\r\n</li><li>When the boss slams his hand down, he does 5 damage, but if youre still standing there next to his fist even though hes clearly not attacking, he will do another 5 points of damage\r\n</li></ul>\n<p>K.S. (THEY’RE KNOWN AND SHIPPED WITH THE ERROR CAUSE, YOU KNOW, WE ONLY HAD 7 DAYS :) )\r\n</p>\n<ul><li>The grenades don’t destroy blocks the player is standing on.\r\n</li><li>The boss’s decisions are a bit too quick.\r\n</li><li>Overall, the game isn’t balanced.\r\n</li><li>Enemies just stand there and don’t run at you.\r\n</li><li>Some of the platforms don’t move like the others do, whether it’s up or down or left and right.\r\n</li><li>Visually, the platform behaviors aren’t consistent, meaning, if a platform just drops, others that look like that platform may move left and right and so on.\r\n</li><li>When the player is in prone, she can angle her body up too high or waay too low.\r\n</li><li>Players have a hard time understanding why they need 2 guns.\r\n</li><li>The ice-blocks don’t melt.\r\n</li><li>There are no ice-attacks.\r\n</li><li>The RBG (Random Block Generator) HP is too high.\r\n</li><li>It would be nice if we had a clamber animation when blocks are just out of reach.\r\n</li><li>It would be nice to have a double jump.\r\n</li><li>The SFX are too loud.\r\n</li><li>The fonts don’t look consistent with the branding.\r\n</li><li>There is no real GUI HUD\r\n</li><li>The Gun-Goblins have no eyes.\r\n</li><li>The lighting was not built before shipping.\r\n</li><li>The enemies don’t fall when you shoot out the blocks from under them.\r\n</li><li>When a platform moves down, the jump is truncated.\r\n</li><li>The player spawns facing the camera.\r\n</li><li>The music stacks when dying.\r\n</li><li>Respawning bridge units will not explode again.\r\n</li><li>In the vertical section, there is a platform that just disappears when trying to get the extra-life.\r\n</li><li>You can’t shoot Gunner-Goblins when they are standing right next to you!\r\n</li><li>The turret has no material\r\n</li><li>The turret is not on a block\r\n</li><li>The Gunner-Goblins won’t turn around when the player is behind them.\r\n</li><li>No SFX when hitting the boss.\r\n</li><li>When standing on the “L” Block, you hover and not stand on the lower platform.\r\n</li><li>When fighting the boss and he kills you, you don't get to use your extra-lives.\r\n</li><li>When you defeat the boss, there are explosions, but the audio doesn't fire off with each blast.\r\n</li><li>Player can’t drop down to the platform below.\r\n</li><li>Player is no dash.\r\n</li><li>Player is no melee.\r\n</li><li>The camera is too far underneath the boss. You can’t really see his head.\r\n</li><li>The camera doesn’t lead the player when turning, meaning,the player shouldn't be in the center of the screen but offset to wherever she is facing so that you can see more of what is in front of you. (See Song of Iron)\r\n</li><li>Player has no nades.\r\n</li></ul>\n\n<p>7 Day Epic Game Jam, 2021</p>", "metacritic": null, "released": "2021-09-02", "tba": false, "updated": "2021-09-07T05:24:54", "background_image": "https://media.rawg.io/media/screenshots/cd9/cd959250cc478c088fd5300ff0ebdb7b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 238, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["GeneralSoundwave"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}