{"id": 653100, "slug": "reclaym-the-kingdom", "name": "RECLAYM THE KINGDOM", "name_original": "RECLAYM THE KINGDOM", "description": "<p><strong>Team: </strong><strong> Work Hard, Clay Hard<br/></strong><em>This game was developed in 7 very long days for the Epic MegaJam 2021 by Work Hard, Clay Hard. They are: Daniel Asperen (Level Design), Morris Belfrage (Animation), Josh Dutton (Audio), Luke Parkes-Haskell (Design), and Oskar Selin (Art).<br/><br/></em>The Kingdom of Plato once held aloft in the sky, falls into ruin. It has been abandoned by the High-Kings of old, leaving the denizens trapped as it slowly decays and crumbles into the abyss. They are quite literally <strong>running out of space</strong> - and it's only going to get worse.<br/><br/>Enter our erstwhile adventurer, Cassius who seeks to claim the throne, ergo the Kingdom for himself - and will stop at nothing to get it.</p>\n<p>Navigate and fight your way through a world full of devious enemies, and defeat them by picking up floor tiles and using them as deadly projectiles - but you need to take great care, as each time you remove a floor tile, you give yourself one less to stand on, and you too may find yourself <strong>running out of space.</strong><br/><br/><strong>Controls:</strong><br/><em>This game is best played with a controller. Menus are operated with the mouse.<br/></em></p>\n<p>KEYBOARD:<br/>Move with the WSAD keys.<br/>Jump using the Space bar.<br/>Grab a tile with the Left Mouse or E, and again to throw it.<br/><br/>CONTROLLER:<br/>Move with the Left Analogue stick.<br/>Jump using the bottom face button (A on an XBox Controller).<br/>Grab a tile with either Trigger, and use the Trigger again to throw it.<br/><br/><br/><strong>Designer's Notes:</strong><br/>The game was built around a fairly old-school design philosophy - short, sweet, and on repeat. The game has a challenging learning curve and shows the player no mercy - but mechanics are tight and usually fair. This is all part of the fun; overcoming challenges like these can be extremely gratifying, though also not without moments of frustration!<br/><br/><em>The expression 'Nintendo Hard' was employed more than once during development.</em><br/></p>\n<p>For players who find this all a bit too much, an 'Easy' difficulty setting has been added that attempts to save encounters whilst in progress, allowing the player to resume from part way through when killed instead of from the beginning. The game's unique mechanics revolving around the theme of <em>'Running out of Space'</em> are pushed aside in favour of making the game a lot easier to complete.<br/></p>\n<p>For players who find the regular difficulty not challenging enough, there is of course a hard mode too.<br/><br/>Have fun!<br/>- Team Work Hard, Clay Hard</p>", "metacritic": null, "released": "2021-09-02", "tba": false, "updated": "2021-09-07T05:33:18", "background_image": "https://media.rawg.io/media/screenshots/6c7/6c7c9d4007b605f63a6954ef7444a896.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 168, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Connecta", "ambershee", "Trinxy"], "genres": ["Action"], "publishers": [], "esrb_rating": null}