{"id": 653179, "slug": "no-more-space-dumbeldor", "name": "No More Space (Dumbeldor)", "name_original": "No More Space (Dumbeldor)", "description": "<p>Hi fellow GameJammers,</p>\n<p>It’s with great pleasure that we present you our game : <strong>No More Space</strong>.</p>\r\nStory :\r\n<p>After running out of space on earth, humanity went in Space to find a new home.</p>\n<p>You will be in charge of relocating the most of people you can.</p>\n<p>But be careful, humanity never stops to grow, and you may run out of space </p>\r\nGameplay :\r\n<p>The goal of the game is to create buildings, for a population that never stop to grow, and to relocate the maximum of peoples you can.</p>\n<p>To help you for this task, you’ll unlock new buildings with more space, but be careful because this will also make the population to grow faster.</p>\n<p>Of course it’s possible to destroy previous buildings, if you want to change them by new ones, but this choice will have consequences and you’ll have to be fast enough to replace the space you’ve just destroyed.</p>\r\nControls :\r\n<p>-    Left Click: Place building</p>\n<p>-    Right Click : Rotate the camera</p>\n<p>-    R : Rotate the buildings</p>\n<p>-    Suppr : Delete a building selected</p>\n<p>-    Esc : Unselect a building</p>\r\nTools we used to create the game:\r\n<p>-    Unreal Engine 4.26.2</p>\n<p>-    Blender et 3DS Max</p>\n<p>-    Substance Painter</p>\n<p>-    Inkscape</p>\n<p>-    Vegas pro</p>\n<p>No assets were create before the event.</p>\n<p>All our musics are from Dynamedion (music and sound effects), but are customized with modulation.</p>\r\nOur Team :\r\n<p>Lunder (Yannick IMPOSTI) - Game Designer </p>\n<p>Dumbeldor (Vincent GLIZE) - Programmers</p>\n<p>Toufic (Emilien MEFFE) - Programmers / 3D Environments</p>\n<p>Wyd (Anais BUON) - 3D Environment</p>\r\nFeedback :\r\n<p>We’ve learned so much during the GameJam.</p>\n<p>It was the second time we participate to such event, and each time was a great moment to learn new things and push us to solve new problems.</p>\n<p>We wants to give a shoutout to Wyd (our main 3D Environment artist), who joined us in the middle of the project, and helped us a lot in creating this beautiful cartoon-ish world.</p>\n<p>Finally, we just want to quickly talk about our studio : Half Awake.</p>\n<p>It was created a few month ago, in order to publish our first complete game : it will be a FPS//RPG online game, based on Ninja theme. If you liked No More Space, do not hesitate to follow us to not miss any news about our next game.</p>\n<p><strong>Thank you all, and thank you to Epic Games to create such event for indepent developers.</strong></p>", "metacritic": null, "released": "2021-09-02", "tba": false, "updated": "2021-09-07T05:58:58", "background_image": "https://media.rawg.io/media/screenshots/872/872817cdf526ad7b90dcb08868ee7c96.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 159, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dumbeldor"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}