{"id": 65319, "slug": "fierce-tales-feline-sight-collectors-edition", "name": "Fierce Tales: Feline Sight Collector's Edition", "name_original": "Fierce Tales: Feline Sight Collector's Edition", "description": "Another innovative tale from <strong>Blam!</strong>, creators of Fierce Tales: A Dog's Heart and Fierce Tales: Marcus' Memory. <br/><br/>A series of mysterious snow-leopard attacks has Snowville in a panic! As the town’s best veterinarian and feline expert, it’s up to you to find out why they’ve left their forest reserve and come after humans. But things get personal when your own housecats suddenly decide to run off with the leopards. Can you find out who is controlling the leopards and get back your pets? The cat’s out of the bag in this thrilling Hidden Object Puzzle Adventure game!<br/><br/>This is a special Collector's Edition release full of exclusive extras you won’t find in the standard version. The Collector’s Edition includes:<br/><br/>A bonus game that reveals the origins of the snow leopards<br/>Achievements to record exceptional accomplishments<br/>Concept art, music, wallpapers, and more!<br/>An available Strategy Guide<br/><br/><br/>This is a Hidden Object Puzzle Adventure game, meaning a specific genre of story-driven, point &amp; click adventures. Throughout the game, players are tasked to find a list of objects hidden within a particular scene, and to occasionally complete various mini-games/puzzles.", "metacritic": null, "released": "2018-02-26", "tba": false, "updated": "2019-08-28T21:54:17", "background_image": "https://media.rawg.io/media/screenshots/388/38873754c9dfaf4f5a056427e786087b.jpg", "website": "https://www.bigfishgames.com/games/8327/fierce-tales-feline-sight-collectors-edition/?pc", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 6}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 662, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Blam! Games"], "genres": ["Adventure", "Casual"], "publishers": ["Big Fish Games"], "esrb_rating": null}