{"id": 653106, "slug": "blobbits", "name": "Blobbits", "name_original": "Blobbits", "description": "<p>September 3rd Update: Updated the game play video!<br/></p>\n<p>Welcome to the Isle of Hand, a tropical paradise being invaded by Blobbits! They are many, breed fast, and will soon overrun the island. You must <strong>act quickly</strong> before you run out of space. Pick up Blobbits with your left mouse button, and release them into the grinder to earn their unique currency. Bring up the build menu to use the currency to purchase traps and unlock new Hand abilities to stop their advance!<br/></p>\n<p>Each Blobbit gives you 1 currency of their own color, to build more powerful traps you have to either color grey Blobbits with color pits into primary colors, or mix two Blobbits of primary colors in a cauldron to get a special color Blobbit. </p>\n<p>Survive until the timer runs out!</p>\n<p>Controls: <br/><strong>Pick up/Release</strong> - LMB <br/><strong>Slap</strong> - RMB (Must be unlocked) <br/><strong>Smash</strong> - Spacebar (Must be unlocked) <br/><strong>Build menu</strong> - B<br/><strong>Zoom camera</strong> - Scroll wheel</p>\n<p>If the population reaches 100, it's game over.</p>\n<p><strong>HINT</strong>: If you find yourself struggling to keep your population under control, try shredding your blobs earlier in the level. Once the total populations gets above 40, the rate in which they breed can quickly get out of control unless you have a decent number of traps established. Make sure to build towards getting some Spike Traps down, and don't forge to use your Hand abilities once unlocked. Also remember that the Catapult must be manually activated by you by pressing the big red button. <br/></p>\n<p>All assets were made during the jam.<br/></p>", "metacritic": null, "released": "2021-09-02", "tba": false, "updated": "2021-09-07T05:35:13", "background_image": "https://media.rawg.io/media/screenshots/f94/f942d43ffc066af529afb887177323a4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 76, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Araklaj", "aokgaming", "Obiwahn89", "Haakond", "akomili"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}