{"id": 653891, "slug": "juego-para-coches-pequenos-buscar", "name": "Juego para coches pequeños buscar", "name_original": "Juego para coches pequeños buscar", "description": "Juego para coches pequeños buscar\r\n<p>Juego creado para <strong>tu juego a juicio jam</strong>, donde cumple con la temática de jugar con un <strong>coche demasiado largo(Limusina)</strong></p>\n<p>En el titulo, al final pone buscar esto hace referencia a un meme, pero no tiene que ver nada con que haya algo que buscar.</p>\n<p>El Juego es muy <strong>corto y en ningún momento el escenario es infinito</strong>.<strong> Vale la pena acabarlo</strong>, ya que hay hechas animaciones.</p>\n<p>En si el juego intenta adaptarse al tema haciendo un circuito donde con un coche largo sea mas difícil, en el 2o nivel se intenta estrechar y hacer carreteras estrechas pero me he encontrado con la complicación que si se exagera demasiado es injugable y estresante ya que debes ratificar cada curva. Puedes opinar sobre las dimensiones de la pista en los comentarios y dar tu opinión si cumple con el hecho de presentar una dificultad o no tener un coche largo.</p>\n<p><strong>Aviso!:</strong> El 1r Nivel consiste en 2 vueltas, <strong>no pienses que es infinito</strong>. <strong>Los bots pueden atascarte</strong> así que intente de <strong>marcha atrás o intente derrapar</strong>(Espacio).<strong> Al final de cada nivel(Hay 2) hay una animación</strong>, el 2 nivel consiste en una vuelta. El juego esta pensado en ser acabado en menos de 3 - 4 minutos, <strong>vale la pena llegar al final,</strong> no es muy difícil. <strong>Las colisiones no son exactas</strong> porque para evitar bugs los hice a mano con cubos gigantes invisibles independientemente de los objetos así que da la sensación de muros invisibles. </p>\n<p><strong>Controles: </strong>En el juego mismo los explica muy intuitivamente, pero igualmente los dejo aquí: <strong>A o flecha izquierda</strong> -&gt; Girar Izquierda. <strong>D o flecha derecha</strong> -&gt; Girar Derecha. <strong>W o flecha arriba</strong> -&gt; acelerar. <strong>S o flecha abajo</strong> -&gt; frenar o ir hacia atrás. <strong>Espacio</strong> -&gt; Derrapar</p>\n<p><strong>Guía:</strong> En sí el juego trata de 2 niveles, el 1r nivel trata de un tutorial en el lore de la clasificación. Al dar 1 vuelta aparecerán bots contra los que debes esquivar, en sí los bots tienen una mala IA debido al plazo de tiempo, en algunos casos se ha reportado que<strong> estos bots te arrastraban y te impedían mover</strong>, en ese caso intente ir hacia atrás o derrapar con espacio, al acabar la 2a vuelta, aparecerá una animación que al finalizar le conduce al 2 nivel donde debe hacer una carrera con cronómetro lo antes posible, al acabar aparecerá una animación final donde le volverá a dar su puntuación final. <strong>¿Puede compartir su puntuación en los comentarios, mi récord es 01:34:68, podrás superar-me?</strong></p>\n<p>Assets: Los vehículos y escenario, excepto vallas y rocas han sido creados por mi, el efecto de partículas de explosión es de la asset store pero he tenido que retocarlo para adaptarlo al URP. El agua, cielo, diseño, animaciones han sido creado por mi y la música ha sido descargada de YouTube sin ningún tipo de copyright</p>\r\nSi en los comentarios ponéis vuestra mejor vuelta, os la dejare en la tabla con vuestro nombre\r\n\r\nPersonaPuntuaciónNPol Gauchia1:00:581Nil Gauchia1:05:682Hermano de BesDeb1:12:393Roxas1:15:314Chewico01:34:6855BesDeb1:46:426Iru02:14:547", "metacritic": null, "released": "2021-09-01", "tba": false, "updated": "2021-09-07T09:44:12", "background_image": "https://media.rawg.io/media/screenshots/230/230bf1b285967e9df1de43550e4a1239.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 153, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Chewico"], "genres": ["Racing"], "publishers": [], "esrb_rating": null}