{"id": 653886, "slug": "panic-rails", "name": "Panic Rails", "name_original": "Panic Rails", "description": "<p><strong>HISTORIA</strong></p><p>Tras explorar una cueva encantada y tomar un cristal extraño, la cueva comienza a colapsar y debes encontrar una salida.    Esto te obliga a salir  huyendo y encontrarte con un carrito que hechas a andar a toda velocidad a tu suerte.</p>\n<p>En el camino notarás que el cristal que has tomado te ha otorgado habilidades para manipular el tiempo donde puedes hacerlo Demasiado Largo o Demasiado Corto según así lo decidas.</p>\n<p><strong>CONTROLES</strong></p><p><strong>Opción 1:     </strong><strong>AWSD</strong></p><p>A - Presiona para regresar el tiempo unos segundos.<br/></p><p>S - Hacer el tiempo lento (El tiempo se hace demasiado largo)</p><p>D - Regresa el tiempo a la normalidad<br/></p><p>W / Barra Espaciadora - Saltar</p><p>R - Reiniciar el nivel</p><p><strong>Opción 2:  Flechas</strong><br/></p><p>Izquierda  - Presiona para regresar el tiempo unos segundos.\r\n</p>\n<p>Abajo  - Hacer el tiempo lento (El tiempo se hace demasiado largo)\r\n</p>\n<p>Derecha - Regresa el tiempo a la normalidad\r\n</p>\n<p>Arriba/Barra Espaciadora - Saltar\r\n</p><p>R - Reiniciar el nivel</p><p><strong>ERRORES CONOCIDOS</strong><br/></p>\n<ul><li>El juego se congela:  Acá esta pasando un comportamiento  bastante extraño que impide que se reinicie el nivel al presionar R.   Acá debes cerrar e iniciar el juego nuevamente.</li><li>El carrito salta mas de lo habitual:  En algunos navegadores el carrito salta mucho mas alto de lo debido.   </li><li>El carrito puede quedar atrapado:  Acá el carrito se puede quedar congelado en uno de los colliders y no te dejará avanzar.  Acá presionando la tecla [R] para reiniciar el nivel.</li><li>Los checkpoins no están funcionando .    Esto puede provocar que se deba comenzar el nivel desde el principio.  </li></ul>\n<p><strong>CRÉDITOS</strong><br/></p>\n<p>Este juego lo he trabajado solo usando aproximadamente unas 5 horas por temas de trabajo y otras actividades que tengo y por lo mismo no me dio oportunidad de colocar un  mejor menú y corregir los bugs.       Sin embargo siento que esta bien por ser un juego para una JAM donde busco experimentar la mecánica para    manipular el tiempo que ha sido bastante interesante (no esta tan fácil como se ve implementarlos).</p><p>La mayoría de los recursos utilizados en el juego han sido adquiridos en los siguientes sitios con su respectiva licencia de uso:<br/></p>\n<p>Game Developer Studio</p>\n<p>Game Dev Market</p>\n<p>Zagsplat</p>\n<p>DaFont</p>\n<p>Música  por Andrew Sitkov adquirida en el paquete de Humble Bundle: Big Music 2</p>\n<p>https://es.humblebundle.com/software/big-royaltyfree-music-2-software</p>\n<p>Agradecería mucho sus comentarios para saber si surgen mas bugs o sugerencias para así, conforme tenga un tiempo  pulir un poco mas este prototipo.</p>", "metacritic": null, "released": "2021-09-01", "tba": false, "updated": "2021-09-07T09:42:27", "background_image": "https://media.rawg.io/media/screenshots/64b/64b17f9be02c227efa0ce415df241a4f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 126, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Web"], "developers": ["Edgar Quex"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}