{"id": 654042, "slug": "mind-jab", "name": "Mind Jab", "name_original": "Mind Jab", "description": "Two minds duel to stay sane.\r\n<p>Mind Jab is a both a race to build enough sanity and/or resources to win and a challenge to avoid losing all your sanity.\r\n</p>\n<em>Brain power</em>\n<p>Take turns to play (or discard) a card from a hand of 6 cards, earning resources, dealing damage, and building bonuses. Use empathy, diplomacy and rationality to boost your own mind, weaken your opponent's, and build enough sanity to win.\r\n</p>\n<ul><li>Do you rush for early destruction of enemy's sanity?\r\n</li><li>Or play sanity boosting cards to protect yourself from harm?\r\n</li><li>Is resource generation your preferred strategy?\r\n</li><li>Do you play a lesser powerful card in order just because it's type matches the synergy star?\r\n</li><li>Or do you decide your mind's fate with each new turn?\r\n</li></ul>\n<em>Cards for sorrow, cards for pain</em>\n<p>Mind Jab features a deck of approx 100 cards, all unlocked, all unique, all original, all equally mad. Cards cost 1 of 3 resource types to play. For roughly half of all the cards, the resource type is randomly chosen every time that card is drawn (the cost never changes).</p>\n<p>Mind Jab is inspired by <em>Arcomage</em> from the Might And Magic series.\r\n</p>\n<em>Free Demo</em>\n<p>A free demo of Mind Jab is available and is limited to 1 game mode, Human VS AI only, and a rubbish AI. The full game includes more game modes and decent AI.\r\n</p>", "metacritic": null, "released": "2021-09-01", "tba": false, "updated": "2021-09-07T10:32:46", "background_image": "https://media.rawg.io/media/screenshots/326/32690a04e9d11ec60d7c71430b5f3f24.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 181, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Tackorama"], "genres": [], "publishers": [], "esrb_rating": null}