{"id": 65403, "slug": "merge-evolution-best-game", "name": "Merge Evolution - Best Game", "name_original": "Merge Evolution - Best Game", "description": "It’s your chance to create an entire unique element Universe!<br/><br/>Merge similar elements and they will turn into an unexpected item. Match seeds to get the weeds or air to get the fluffy cloud. What’s next? It’s your turn to be the Columbus of The New World of Elements!<br/><br/>Discover all obscure elements in the world!<br/><br/><br/>SUBSCRIPTION PRICING AND TERMS<br/><br/>Subscription options<br/><br/>In our game we offer you the next subscription options:<br/><br/>1. Weekly Membership offers you a weekly subscription for $7.99 after 3-day free trial. We will double your all gems revenue and give you 20 coins every day. Moreover, we will remove all pop-ups and banner ads for your better game experience. <br/> <br/>2. Monthly Membership offers you a monthly subscription for $19.99. We will double your all gems revenue and give you 20 coins every day. Moreover, we will remove all pop-ups and banner ads for your better game experience. <br/> <br/>3. Yearly Membership offers you a yearly subscription for $99.99. We will double your all gems revenue and give you 20 coins every day. Moreover, we will remove all pop-ups and banner ads for your better game experience.<br/> <br/><br/>End of trial and subscription renewal<br/> <br/>This price is for United States customers. Pricing in other countries may vary and actual charges may be converted to your local currency depending on the country of residence.<br/> <br/>Payment will be charged to iTunes Account at confirmation of purchase.<br/> <br/>Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period.<br/> <br/>The account will be charged for renewal within 24-hours prior to the end of the current period, and identify the cost of the renewal.<br/> <br/>Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user’s Account Settings after purchase.<br/> <br/>Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable.<br/> <br/>Canceling trial or subscription<br/> <br/>You can turn off the auto-renew for the subscription whenever you want to through iTunes account. Check https://support.apple.com/HT202039. When your current trial/subscription period expires, you will be unsubscribed. The current active subscription period cannot be canceled. After your subscription expires, you will no longer be able to use elements offered in your chosen Subscription Option.<br/> <br/>If you have any questions or comments, feel free to contact us at support@playgendary.com <br/> <br/>Privacy Policy: https://www.playgendary.com//privacy-policy <br/>Terms of Use: https://www.playgendary.com/terms-of-use", "metacritic": null, "released": "2018-07-05", "tba": false, "updated": "2019-10-22T14:00:55", "background_image": "https://media.rawg.io/media/screenshots/9cd/9cd1e5a910671646f9014d220f456929.jpg", "website": "https://www.playgendary.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 76, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Playgendary"], "genres": ["Arcade", "Puzzle"], "publishers": ["Playgendary"], "esrb_rating": "Everyone 10+"}