{"id": 65415, "slug": "hexio-puzzle-game", "name": "Hexio - Puzzle Game", "name_original": "Hexio - Puzzle Game", "description": "Simply drag the same-colored tiles from the belt to make as many hexagons as you can. As you connect tiles in hexagons, they disappear! <br/><br/>Are you in a mess? Just refresh the belt or rotate the tiles to get more hexes. Discover this really unique gameplay and you will absolutely get stuck to our hexes!<br/><br/>Hexio’s main features:<br/>– 6 Game Modes to discover. Classic, XXL, Blitz, Stars, Gears, Anti. Choose the ideal mode personally for you! <br/>– Hexio is super user-friendly. We offer night and day modes taking care of your eye health. <br/>– What’s more, we care about all people. We created a Color Blind mode - now small symbols differing the colors appear on the tiles!<br/>– Play the game without Wi-Fi connection.<br/>– Cool graphics and easy-to-understand gameplay<br/><br/>Show all agility of your brain!<br/><br/><br/>SUBSCRIPTION PRICING AND TERMS<br/><br/>Subscription options<br/><br/>We offer you the following subscription options:<br/><br/>1. Weekly Diamond Membership offers a weekly subscription for $7.99 after a 3-day free trial. It unlocks all game modes, gives 7 extra moves and additional time. Moreover, it removes all pop-up and banner ads.<br/><br/>2. Monthly Diamond Membership offers a monthly subscription for $19.99. It unlocks all game modes, gives 7 extra moves and additional time. Moreover, it removes all pop-up and banner ads.<br/><br/>3. Yearly Diamond Membership offers a yearly subscription for $99.99. It unlocks all game modes, gives 7 extra moves and additional time. Moreover, it removes all pop-up and banner ads.<br/><br/>End of trial and subscription renewal<br/><br/>This price is for United States customers. Pricing in other countries may vary and actual charges may be converted to your local currency depending on the country of residence.<br/><br/>Payment will be charged to iTunes Account at confirmation of purchase. Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period. The account will be charged for renewal within 24-hours prior to the end of the current period, and identify the cost of the renewal. Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user’s Account Settings after purchase. Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable.<br/><br/>Canceling trial or subscription<br/><br/>You can turn off the auto-renew for the subscription whenever you want to through iTunes account. Check https://support.apple.com/HT202039. When your current trial/subscription period expires, you will be unsubscribed. The current active subscription period cannot be canceled. After your subscription expires, you will no longer be able to use elements offered in your chosen Subscription Option.<br/><br/>If you have any questions or comments, feel free to contact us at support@playgendary.com<br/><br/>Privacy Policy: http://www.playgendary.com/privacy-policy/<br/>Terms of Use: http://www.playgendary.com/terms-of-use/", "metacritic": null, "released": "2018-05-22", "tba": false, "updated": "2019-10-22T14:00:59", "background_image": "https://media.rawg.io/media/screenshots/234/234c611395979981e961e0a49b77c18d.jpg", "website": "http://www.playgendary.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 43, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Playgendary"], "genres": ["Board Games", "Puzzle"], "publishers": ["Playgendary"], "esrb_rating": "Everyone 10+"}