{"id": 654103, "slug": "the-big-man-on-mulberry-street", "name": "The Big Man on Mulberry Street", "name_original": "The Big Man on Mulberry Street", "description": "<p>Rick Alexander Morrison is head of the William Joel high school school newspaper and president of said school’s journalism club. As a self-proclaimed ametuer sleuth and investigative journalist in training, he is often commissioned by his peers to assist in making heads or tails of mysterious and puzzling occurrences at school. On one fateful Autumn morning, Rick is called upon to solve a murder mystery... whose victim happens to be a potted plant. Join Rick as he interrogates classmates, thumbs through security camera footage, and exuberantly monologues his way toward the discovery of a hidden herbicidal scoundrel!</p>\n<p>This is my first attempt at a mystery game, and as such it’s not exactly very good. I wrote essentially all of it over two years ago, but dropped the project in favor of something else once Summer ended. Returning to it I found the plot to be kind of nonsensical, but I ended up finishing and releasing it anyway for the fun of it. In spite of all this, I hope you enjoy it! For this project especially, if you have any questions, problems, or suggestions please don’t hesitate to comment them below or email me! As always, thanks for playing!\r\n</p>\n<p>Plugins Used:\r\n</p>\n<ul><li>Galv’s Message Sound Effects\r\n</li><li>SRDude’s Window Frame Anti-Stretch</li><li>Yanfly’s Message Core</li><li>Tor Damian Design’s Bind Pictures to Map</li></ul>", "metacritic": null, "released": "2021-09-01", "tba": false, "updated": "2021-09-07T10:50:56", "background_image": "https://media.rawg.io/media/screenshots/c84/c8496cad5935e7b5d97574059f6eeb77.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 125, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Phil Johnson"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}