{"id": 654212, "slug": "squiggly-kids-math-games", "name": "Squiggly: Kids Math Games", "name_original": "Squiggly: Kids Math Games", "description": "<p>Built by students and teachers, Squiggly is an open-world 3D adventure game that teaches counting, adding up to 2 digits, and subtracting up to 2 digits. Choose between 5 learning levels across 4 unique worlds: Island Hero, Castle Hero, Space Hero, and Ninja Hero. Whether it’s harvesting pineapples to feed to the hungry orcas or delivering zero-gravity space pizza to the astronaut party, Squiggly is sure to create lasting memories and teach valuable early math skills.</p>\n<p>In the Squigglyverse, you choose who you are, how you learn, and where you want to go. We founded Squiggly to create a virtual learning environment where all students can play, explore, and discover on their own terms.</p>\n<p>From the creators of Redwood AR, the world’s 1st augmented reality math adventure game, Squiggly stands as the next evolution of game-based learning. To learn more about our mission to accelerate the pace of human learning &amp; play Squiggly Math on web, visit squiggly.school </p>\n<p>We are constantly trying to make our games more fun and educational and could use your help. Please reach out to info@squiggly.school with any feedback, suggestions, questions, concerns, or ideas you and your learners have.</p>\n<p>Squiggly Math features 4 ad-free, kid-approved learning games:\r\n</p>\n<p>1. Island Hero\r\n</p>\n<p>2. Castle Hero\r\n</p>\n<p>3. Space Hero\r\n</p>\n<p>4. Ninja Hero</p>\n\n<p>What do you learn in Squiggly Math?\r\n</p>\n<p>- Counting to 25\r\n</p>\n<p>- Single-digit addition\r\n</p>\n<p>- Double-digit addition\r\n</p>\n<p>- Single-digit subtraction\r\n</p>\n<p>- Double-digit subtraction</p>\n\n<p>How to play Squiggly Math:\r\n</p>\n<p>1. Create a free Squiggly Math account or play as guest\r\n</p>\n<p>2. Choose a minigame to explore\r\n</p>\n<p>3. Choose your learning level / difficulty\r\n</p>\n<p>4. Pick your avatar!\r\n</p>\n<p>5. Collect objects around the in-game world (pineapples, apples, pizza, or carrots)\r\n</p>\n<p>6. Throw the objects to the destination (orca whales, horses, astronauts, or rabbits) to answer the question\r\n</p>\n<p>7. Tap the check box on the bottom center when you answered correctly</p>\n\n<p>Privacy policy: https://redwood-learning.com/user-privacy/\r\n</p>\n<p> \r\n</p>\n<p>Your family’s privacy is extremely important to us. We do not collect individually-identifiable information and anonymize all the data we do collect. We will never sell data to third parties and will never show targeted ads.\r\n</p>\n<p> \r\n</p>\n<p>We are committed to remaining 100% ad-free.\r\n<br/></p>", "metacritic": null, "released": "2021-09-01", "tba": false, "updated": "2021-09-07T11:23:01", "background_image": "https://media.rawg.io/media/screenshots/def/def8a29e07ca3f198310c77e4ea365dc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 93, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["squigglyschool"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}