{"id": 6542, "slug": "space-age-a-cosmic-adventure", "name": "Space Age: A Cosmic Adventure", "name_original": "Space Age: A Cosmic Adventure", "description": "<p>Space Age is a game of cosmic adventure. Set in the retro-futuristic sci-fi world of 1976, it follows a small but determined band of intergalactic explorers who land on a seemingly uninhabited planet, Kepler-16. They soon discover there’s something both strange and familiar about this alien place…  And what happens next is a clash of old and new, a battle of past mistakes and future fallout.<br />\n“Presented through gorgeous pixel graphics straight out of an adventure game from 20-30 years ago. There&#39;s not much else like it out there.”<br />\n- Techcrunch<br />\nSpace Age is a graphic adventure in the vein of 1990s classics, reimagined for the new millennium and its amazing mobile devices. Told in grand cinematic style, orchestrally scored, filled with drama, humor, and nostalgia, Space Age is a golden-age science-fiction story come to immersive life.<br />\n&quot;The game looks gorgeous, the atmospheric soundtrack is delightful, and there is a ton of stuff to love about the gameplay and story of Space Age.&quot;<br />\n— AppAdvice<br />\n“Its expertly-judged nostalgia sees game ideas and aesthetics of the past blended masterfully within a fun, genuinely witty story.”<br />\n— Pocket Gamer<br />\nWhat can you expect from Space Age? Why, no less than:<br />\n• Many hours of challenging gameplay<br />\n• Multiple characters, controlled individually and in small groups<br />\n• Tactical maneuvering and strategic planning<br />\n• Varied environments and storylines<br />\n• Puzzles, mysteries, challenges<br />\n• Dialogue, inventory, sneaking. Just like the good old days.<br />\n• Action, fun, and… romance.<br />\n&quot;I could ramble on about Space Age, but instead I&#39;m just going to end things here and tell you to go download the game.&quot;<br />\n— iMore<br />\nSpace Age is a game to fall in love with.</p>", "metacritic": null, "released": "2014-11-13", "tba": false, "updated": "2022-08-12T06:05:39", "background_image": "https://media.rawg.io/media/screenshots/fc1/fc1d49f40ecf9692eb673d761d36615f_OW9gs4Z.jpg", "website": "http://spaceageapp.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "beaten": 4, "toplay": 1, "dropped": 2, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 4, "suggestions_count": 234, "game_series_count": 0, "reviews_count": 4, "platforms": ["iOS", "macOS"], "developers": ["Big Bucket Software"], "genres": ["Adventure", "Strategy", "Arcade", "Casual"], "publishers": ["Matthew Comi"], "esrb_rating": null}