{"id": 654364, "slug": "jamais-vu-patfio", "name": "Jamais Vu (patfio)", "name_original": "Jamais Vu (patfio)", "description": "<p>Movement with Arrow Keys.</p>\n<p>Walk into unique sprites to initiate dialogue. <br/></p>\n<p><em>Jamais Vu </em>is a project built for Dr. Greg Zinman's \"Historical Approaches to New Media\" class in the Digital Media program at Georgia Tech. <br/></p>\n<p>All dialogue has been quoted from various texts outlined below. For full textual citations, see attached Appendix. <br/></p>\n<p>WORKS CITED<br/></p>\n<p>Gaudreault, André. “Film, Narrative, Narration: The Cinema of the Lumière Brothers.” Collected in Early Cinema : Space, Frame, Narrative, by Thomas Elsaesser and Adam Barker. BFI Publishing, 1990.</p>\n<p>Gorky, Maxim. “The Lumiere Cinematograph.” Nizhegorodski listok, newspaper, 4 July 1896. Translated by Leda Swan. Reproduced in Kino, a History of the Russian and Soviet Film, by Jay Leyda. Macmillan, 1960. http://hdl.handle.net/2027/mdp.39015003853564. </p>\n<p>Gunning, Tom. “The Cinema of Attractions: Early Film, Its Spectator and the Avant-Garde.” Collected in Early Cinema : Space, Frame, Narrative, by Thomas Elsaesser and Adam Barker. BFI Publishing, 1990.</p>\n<p>Hansen, Miriam. Babel and Babylon: Spectatorship in American Silent Film. Harvard University Press, 1991.</p>\n<p>Huhtamo, Erkki. Illusions in Motion Media Archaeology of the Moving Panorama and Related Spectacles. MIT Press, 2013.</p>\n<p>Loiperdinger, Martin. “Lumiere’s Arrival of the Train: Cinema’s Founding Myth.” Translated by Bernd Elzer. The Moving Image, vol. 4, no. 1, 2004, pp. 89–118. Crossref, doi:10.1353/mov.2004.0014.  </p>\n<p>Lumière, Auguste, and Louis Lumière, directors. L'arrivée d'un train en gare de La Ciotat. Société Lumière, 1895.</p>\n<p>Mandelstam, Osip. “377 The Last Supper.” The Selected Poems. Translated by Clarence Brown and W. S. Merwin. The New York Review of Books, 2004. </p>\n<p>Rancière, Jacques. The Emancipated Spectator. Translated by Gregory Elliott. Verso, 2009.<br/></p>\n<p>Vaughan, Dai. “Let There Be Lumière.” Collected in Early Cinema : Space, Frame, Narrative, by Thomas Elsaesser and Adam Barker. BFI Publishing, 1990.</p>", "metacritic": null, "released": "2021-08-31", "tba": false, "updated": "2021-09-07T12:08:26", "background_image": "https://media.rawg.io/media/screenshots/7e3/7e37b0e0147d71de7950ab0d4d71b852.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 4, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["patfio"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}