{"id": 654418, "slug": "bamboo-slicer", "name": "Bamboo slicer", "name_original": "Bamboo slicer", "description": "<p>ESP</p>\n<p>Bamboo slice es un juego hecho para \"Tu juego a juicio JAM\", organizada por Alva Majo.\r\n</p>\n<p>Eres el aprendiz de un famoso samurái y tu sensei necesita que cortes unas cuantas varas de bambú que son <strong>demasiado largas</strong> para mejorar tus habilidades con la espada.\r\n</p>\n<p>El juego es simple: tienes que conseguir el máximo número de puntos en un minuto.\r\n</p>\n<p>Para conseguir puntos, corta el bambú en las marcas, el juego tiene en cuenta la precisión y longitud de los espadazos. Tu sensei te tirará también pergaminos para comprobar tus reflejos. ¡Procura no cortarlos!</p>\n\n<p>ENG</p>\n<p>Bamboo slice is a game made for \"Tu juego a juicio JAM\", organized by Alva Majo.</p>\n<p>You are an apprentice to a famous samurai, and your sensei needs you to cut some bamboo sticks that are <strong>too long</strong> in order to hone your skills with the sword.</p>\n<p>The game is simple: You have to get the maximum number of points in one minute.</p>\n<p>To get points, you have to slice the bamboo on the marks, the game takes into account the precision and the longitude of the cut sword swing. Your sensei will also throw scrolls at you to check your reaction time, try no to cut them!</p>\n\n<p>Full project: https://github.com/saix93/BambooSlicer</p>", "metacritic": null, "released": "2021-08-31", "tba": false, "updated": "2021-09-07T12:25:06", "background_image": "https://media.rawg.io/media/screenshots/76f/76f9b76882f3225b9563f67e4154fe47.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["Raúl Torres"], "genres": ["Action"], "publishers": [], "esrb_rating": null}