{"id": 654493, "slug": "officer-jones-trouble-in-sekai-city", "name": "Officer Jones Trouble in Sekai City", "name_original": "Officer Jones Trouble in Sekai City", "description": "<p> Alfred is a detective with the Sekai City police department. After what was meant to be a simple job he learns about a huge problem brewing in the city he swore to protect. Now he’s determined to set things right by finding out who’s behind it and putting them away. It’s his obligation to the people!\r\n </p>\n<p> The game has around 75000 words. For one play through I estimate you’ll read around 60,000.\r\n </p>\n<p> The game recognizes itself as Yaoi Jam 2021, I didn’t come up with the name until four days before the month’s end.\r\n </p>\n\n<p><strong>Bla Bla Bla</strong>\n</p>\n<p> Thank you for taking a look at my game, it's basically fanfiction!\r\n </p>\n<p> This game is full of ‘floating pieces’, things that seem like they'll lead to something but go nowhere.\r\n </p>\n<p> Towards the end when you’re presenting everything you may think, ‘what was the point of that other thing?’, all the clues had a use, but I ran out of time and had to cut a lot, I also had to make the final confrontation much simpler.\r\n </p>\n<p> Time is also the reason for the limited expressions and nonexistent shading.  As well as the lack of CG, I originally planned 10, two for each guy, and the rushed backgrounds. Admittedly the backgrounds aren’t too far off from what I do when I have time, I suck at those T_T.\r\n </p>\n<p> MUSIC! I debated putting in any music because it was all done on the last day I couldn’t find something that precisely fit what I imagined. In the end I figured it was better to include some music than none. That way if you don’t like it you can mute it and play your own.\r\n </p>\n<p> I did try to lower it, but renpy wasn’t having it. I’m not sure what I did wrong, I’ve successfully fiddled with sound before.\r\n </p>\n<p> Every game jam I’m in I overestimate my abilities. It’s a curse.\r\n </p>\n<p> I imagined this game to be so much more than it turned out, Still I’m happy to have put it out at all, I’ve joined around twelve game jams in the past year, after Unruly King, and dropped out of them all because I couldn’t finish on time.\r\n </p>\n<p> I’m done with this game. Usually I plan to tidy things up after the jam, but this one burned me out so bad I never want to look at it again. I considered giving up so many times and only the promise of ice cream kept me pushing until the end.\r\n </p>\n<p> So unless there’s some bug the prevents you from getting to the end I wont be touching this again. Even still, I hope you enjoy what I have. This game started off as a labor of love to an old fandom and turned into a nightmare.\r\n </p>\n<p> Thank you for playing! And let me know if there’s a game breaking bug, that's a possibility since I only had half the last day to play test. You can get to an end with each guy, I made sure of that!</p>", "metacritic": null, "released": "2021-08-31", "tba": false, "updated": "2021-09-07T12:47:17", "background_image": "https://media.rawg.io/media/screenshots/3e3/3e36fd77077ee9de8f1a910268f22dbd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 198, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["jaydalyn"], "genres": [], "publishers": [], "esrb_rating": null}