{"id": 6545, "slug": "lode-runner-classic", "name": "Lode Runner Classic", "name_original": "Lode Runner Classic", "description": "DON’T WASTE YOUR MONEY ON FOOL’S GOLD<br/>Play the authentic Lode Runner… this is the real deal!<br/><br/>AWARD WINNING GAMEPLAY<br/>Lode Runner Classic combines the game play and all 150 levels of the award-winning Apple II original Lode Runner with graphics and features engineered for today&amp;#39;s advanced smartphones. The game&amp;#39;s frantic action takes place in maze-like, static levels, where a single player dodges enemies while running and climbing to reach and claim stacks of gold. No jumping is allowed. And shooting enemies is forbidden, but you can blast blocks to access lower platforms or trap pursuing enemies. Winding your way through ever-increasing levels of complexity makes for a superior challenge, but now you can choose to play any one of the 150 levels at any time. <br/> <br/>EXCITING NEW FEATURES<br/>Although the gameplay remains true to the original Apple II version, there are plenty of new features to enhance the experience.  You can magnify the screen around the Runner, set the play speed, adjust the coloring of the art and compete for top spot on the worldwide leaderboards.<br/> <br/>•150 puzzling levels – all unlocked and accessible<br/>•Two game modes – Expedition and Time Attack<br/>•New magnification effect – zoom the action around the Runner<br/>•Multiple play speeds – super slow to superfast action<br/>•Fully adjustable color palettes<br/>•Worldwide leaderboards<br/>•Multiple control schemes<br/>•Illustrated How to Play section<br/> <br/>&amp;quot;When the first Lode Runner came out on the Apple II, the last thing I expected was that the game would be alive and kicking on a platform as advanced as today’s smartphones more than 25 years later. It&amp;#39;s really gratifying to me that so many people are still interested in the game.&amp;quot;<br/> Douglas E. Smith, Original Creator<br/><br/>“In the early days, there was Lode Runner. I consider it a real puzzle game. That was my favorite for many, many years. It’s such a good combination of dynamic stuff, the finger-work, and real planning and puzzle-solving. Every level was a real puzzle with its own mechanics, its own dynamics, its own kind of solution. At the same time, it was an arcade game to play. This combination was done absolutely right. I can’t imagine any other game with such inventive and unusual design.”<br/>Alexey Pajitnov, Tetris Creator<br/>Interview with Edge Magazine<br/><br/>Tozai Games and Lode Runner are trademarks of Tozai, Inc. registered or protected in the US and other countries. Lode Runner is protected under US and international copyright laws ©1983-2012 Tozai, Inc. All rights reserved.", "metacritic": null, "released": "2013-01-17", "tba": false, "updated": "2019-10-22T14:28:57", "background_image": "https://media.rawg.io/media/screenshots/d56/d56f2a72b2e8fd95e7b5f54075e91e89.jpg", "website": "http://loderunnerclassic.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 0, "achievements_count": 8, "ratings_count": 0, "suggestions_count": 184, "game_series_count": 14, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["Tozai", "Tozai Games"], "genres": ["Action", "Arcade", "Puzzle"], "publishers": ["Tozai"], "esrb_rating": null}