{"id": 65468, "slug": "golf-solitaire-muse-free-card-games-with-friends", "name": "Golf Solitaire Muse: Free Card Games with Friends", "name_original": "Golf Solitaire Muse: Free Card Games with Friends", "description": "*** We’ve taken solitaire as you love it, and made it THE ONLY real time Multiplayer, story based Golf solitaire game in the world! ***   <br/>In case you didn’t get it yet, you will actually play solitaire against someone else in real time. You and your opponent will compete on the same shuffle attempting to be the first collecting all 4 Gold cards. You will of course see your opponent’s progress bar so you will be able to know how ahead you are, all while discovering and traveling between different famous art galleries.<br/>The goal is to match cards one higher or lower than the one on your deck and collect all gold cards as fast as you can and before your opponent does. All played on a fascinating art gallery world where you travel in time and discover different art galleries in different style ages. All together you will experience a unique, addictive, fast paced, real time, social, and competitive golf solitaire game, discovering a whole new world of art and galleries. <br/>No registration and no complicated rules. Just start playing and have fun!<br/>The rules of the game are exactly as you already know them, just tap on the card and it will automatically find its way to the deck, allowing you to collect all gold cards way faster. Connect with Facebook, if you want your friend as your opponents. You can still play the game without Facebook connection, don't worry.<br/><br/>Solitaire Muse Features: <br/>• \tEnjoy a one-on-one multiplayer environment<br/>• \tExperience a new way of playing Solitaire with rich and immersive graphics set in Famous art galleries<br/>•\t Challenging and adventurous with 5 different game mode galleries and many to come.<br/>•\t Powerful boosters to help with challenging levels<br/>• \tWatch out for the unique blockers testing your skills! <br/>•\t Available to play on mobile and tablet devices <br/><br/>Our players say: <br/>“Love it!! Brilliant thinking! Love the fact I am competing an opponent over the same draw.” - Janet <br/>“Thank you for hours of FUN, I am getting better every day. Best solitaire ever made ;-)” – Margaret<br/>“Just love solitaire Muse, can’t stop playing. Very well done” – John", "metacritic": null, "released": "2016-01-13", "tba": false, "updated": "2019-07-29T13:18:26", "background_image": "https://media.rawg.io/media/screenshots/516/516664c19410df79c8bf0516cc5201a8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 159, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Come2Play"], "genres": ["Card", "Puzzle"], "publishers": ["COME2PLAY"], "esrb_rating": null}