{"id": 65470, "slug": "horseworld-show-jumping", "name": "HorseWorld: Show Jumping", "name_original": "HorseWorld: Show Jumping", "description": "Your dream come true: Care for your own horses and master exciting jumping courses with them! No matter if you’re in Paris, Sydney, or New York: you and your horse make an invincible team that can overcome every obstacle!<br/><br/>***The second installment in the successful HorseWorld series***<br/> Following HorseWorld 3D comes HorseWorld: Show Jumping as the next great horse simulation for you to discover and enjoy! Improved graphics and even more exciting riding courses make this app a must-have for any horse lover.<br/><br/>***Build and create your own jumping courses!***<br/>You’re through with the boring old jumping course on the ranch – now it’s time for you and your horses to explore the world! Big cities like Paris and New York await you and your talent on challenging courses. Demonstrate great timing and your love of horses, and win every tournament in the world!<br/><br/>***Care for your horses before tackling the course***<br/>Your dear horses can only do their best if they’re taken care of, so you’ve got to fulfill their needs and wishes. Feeding, brushing, and combing are all on the agenda, but of course there’s also time for some cuddles! After lots of fun out in the meadow, the course will be no problem for the two of you.<br/><br/>* Various beautiful horses, such as Hannoverians, English Thoroughbreds, Arabians and Andalusians, are just waiting for you to care for them!<br/>* Design and build your very own jumping courses!<br/>* Demonstrate your skills in the world’s biggest tournaments<br/><br/>Jump in the saddle and let’s go! Download HorseWorld: Show Jumping and try out the challenging courses.<br/><br/>Visit us on Facebook: facebook.com/tivolamobile", "metacritic": null, "released": "2017-06-14", "tba": false, "updated": "2019-10-22T14:35:11", "background_image": "https://media.rawg.io/media/screenshots/2fe/2feaa7395766ebeefff90c24edf3efb4.jpg", "website": "http://www.tivola-mobile.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 304, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Tivola", "Tivola Publishing"], "genres": ["Simulation", "Family"], "publishers": ["Tivola Publishing"], "esrb_rating": null}