{"id": 654855, "slug": "mixt-itch", "name": "MIXT (itch)", "name_original": "MIXT (itch)", "description": "<p><strong>Story:</strong><br/>MIXT is set on the fictional world, Hatteras, a once thriving water-based planet, but its inhabitants have drained the world of its resources. Poisonous gas now seeps out of the dry and cracked earth, forcing its inhabitants to flee by any means necessary. Two such groups looking to escape the rapidly uninhabitable planet are the Angler Folk nation and the Copper Head nation. These once hostile nations must set their differences aside to construct a floating airship, the first of its kind. The nations have agreed to exchange blueprints and work together to quickly construct a self-sustaining ship which can take them above the increasingly toxic surface. If the nations can’t learn to cooperate then their airship will be overtaken by the fog and these once two mighty nations will fall. </p>\n<p><strong>Gameplay:</strong><br/>In Mixt, two players must collaborate through exchanging and placing blueprints on their shared airship. Players can add to their personal sectors to help bolster their resource gathering, but the need to be mindful of contributing to the shared drive sector which helps both nations get above the toxic fog. Mixt is turn-based so players will alternate taking turns buying, placing, and exchanging cards. The game ends when the players reach 4000 Fathoms or if the fog overtakes them. </p>\n<p><strong>How to Play Game:</strong><br/>Included with the game is a full fledged tutorial. Follow along with the tutorial to get your bearings with the world of MIXT.<br/></p>\n<p><strong>How to Play Online Multiplayer:<br/></strong>For online multiplayer one of the two players should download the game and then share their screen using a video chat app. (Zoom/Teams/Parsec/or other video chat app that allows sharing and controlling of a users screen). The other player should request control of the screen in whichever video chat app is chosen. Now players can take turns playing their respective turns.</p>\n<p>Game was created by:</p>\n<p>Luca Azzopardi <br/>Art Director <br/> <br/>Lin Gan <br/>UI/UX \r\n</p>\n<p>Zhizun Geng <br/>Game Designer \r\n</p>\n<p>Du Jun <br/>Technical Artist</p>\n<p>Forrest Pando <br/>Producer and Lighting Artist \r\n</p>\n<p>Tianlei Song  <br/>Technical Designer \r\n</p>\n<p>Mengxing Sun <br/>Game Designer <br/> <br/>Songjiang Yu <br/>Systems Designer \r\n</p>\n<p>Special Thanks:</p>\n<p>Martin Lynagh<br/>William Kavanagh<br/>Niall Moody<br/>Abertay University</p>", "metacritic": null, "released": "2021-08-30", "tba": false, "updated": "2021-09-07T14:34:05", "background_image": "https://media.rawg.io/media/screenshots/166/16663ac8f5bbc7928b44f9503f26f501.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 152, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["forrestpando", "Jessica710", "lucaazzopardi", "Zoe12138", "nietzstl", "Andyjune", "Zhizungenggrey", "Csomething"], "genres": [], "publishers": [], "esrb_rating": null}