{"id": 654909, "slug": "i-dunnit", "name": "I-dunnit", "name_original": "I-dunnit", "description": "<p>I-dunnit is a choice-based text game which is a twist on the murder mystery genre. </p>\n<p>The aim of the game is to make choices to avoid the suspicion of your fellow dinner party guests as you attempt to cover up the murder you have committed.  By stoking the feuds between the other guests, build  resentment and shirk blame off of yourself so that you can get away scot free.</p>\n<p>To get away with it a majority of the guests (including yourself) must vote in favour of someone else getting the blame. You lose the game, and go to jail, if 3 people vote for you, or if the group is unable to come to a consensus. If there's a tie in the voting or no one person gets 3 votes, the group will be divided when the police arrive, causing them to look deeper into the case and you get caught anyway.</p>\n<p>There are 6 different endings, 5 for winning and 1 for losing. If you'd like you can replay the game and see if you can get all of them.</p>\n\n<p>Brief Character Breakdown:</p>\n<p>Sapphire - You/Murderer</p>\n<p>Citrine - Your Victim</p>\n<p>Emerald - Confident, if not slightly arrogant man. Fellow dinner guest and Opal's rival</p>\n<p>Opal - Charismatic woman. Fellow dinner guest and rivals with Emerald</p>\n<p>Ruby - Shy woman. Fellow dinner guest who keeps to herself.</p>\n<p>Quartz - Calculating, logical person. Fellow dinner guest with a penchant for gossip.</p>\n<p>Amethyst - Uncertain, nervous man. Fellow dinner guest, usually follows someone else's lead.</p>\n\n<p>Have fun!</p>", "metacritic": null, "released": "2021-08-30", "tba": false, "updated": "2021-09-07T14:49:47", "background_image": "https://media.rawg.io/media/screenshots/918/9183f69e4f98ad278ec05811a6d3cd0e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 9, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["jessicaslaven"], "genres": [], "publishers": [], "esrb_rating": null}