{"id": 654960, "slug": "double-or-nothing-commodore-64", "name": "Double or Nothing [Commodore 64]", "name_original": "Double or Nothing [Commodore 64]", "description": "<p>Double or Nothing is a vertical push scrolling shoot 'em up for one player only.  This game was the winner of the Official C64 SEUCK Compo 2014. This is the fully enhanced edition of the game which features the following:</p>\n<ul><li>Loading bitmap</li><li>Full front end presentation</li><li>Hi Score table</li><li>Atmospheric trance music composed in DMC V2.0 (Best heard on 8580 SID)</li><li>Power Ups</li><li>and much more</li></ul>\n<p><strong>This game is only compatible on PAL C64's. The framework does not support NTSC C64's.</strong><br/><br/><strong>The Story<br/><br/><strong><em>Your world is at war. But as the chaos rages around you,   your   mind   seems to drift...<br/></em></strong></strong><strong><strong><em> your memories grow contradictory. You fear   that  you are   going mad. Are you living in two places at once? Are you  experiencing   an  alternate life in a parallel reality?\r\n               Are you one man in one world... or two identical copies sharing    one   mind   and two realities?\r\n               You must survive the war to find the truth. </em></strong></strong></p>\n<p><em><strong>You must stake everything      on  finding yourself. It's double or nothing.\r\n               \r\n               With one joystick you control two alternate versions of the  protagonist.       One version (left-hand screen) fights an alien invasion  of Earth, the   other    (right-hand screen) fights an army of robots. Occasionally  both  versions   may enter the same reality.  Eventually both men will  enter  a shared   space outside normal spacetime, where they can confront  the source  of the   invasions.</strong> </em></p>\n<p><strong>Controls:<br/></strong>Use joystick in port 2 or VICE controlled keys<br/>Run Stop / Escape - Pause<br/>Q  (While paused - Abort mission)</p>\n<p><strong>Credits:<br/><br/></strong>Original SEUCK code <strong>Sensisoft</strong><br/>Game design, loading bitmap, graphics and sound effects by <strong>Alf Yngve</strong><br/>SEUCK Redux source code and tape loader by <strong>Martin Piper<br/></strong>Additional front end and programming by <strong>Richard Bayliss<br/></strong>Title screen logo by <strong>Shine/Delysid</strong><br/>Music by <strong>Richard Bayliss</strong><br/></p>\n<p>(C)2014 Alf Yngve. Published by The New Dimension<br/></p>\n<p><em>This game is free software and may be copied and distributed free of charge. You are not permitted to sell this production in digital or physical form without permission from the developers of this production. <br/><br/></em>Mastered with:<br/><br/></p>", "metacritic": null, "released": "2021-08-30", "tba": false, "updated": "2021-09-07T15:06:36", "background_image": "https://media.rawg.io/media/screenshots/f91/f91604fd53e92d8785af51fa0412d2a9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 170, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Richard of TND"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}