{"id": 655058, "slug": "nukeheck", "name": "NUKEHECK", "name_original": "NUKEHECK", "description": "Welcome to <strong><em>NUKEHECK</em></strong>\r\nControls\r\n<ul><li>LMB - shoot</li><li>to collect souls enemies drop - stop shooting</li><li>RMB - throw collected souls when not shooting</li><li>Throw them at the buildings to power them and activate their effects! </li><li>Throw souls at the soulstone in the middle of arena to send the souls back to camp crater where they can be used in the construction of THE NUKE</li><li>Some buildings make you stronger. Some make the enemies stronger. Some are too expensive to unlock alone so bring a friend, everyone in the arena get its effects!</li></ul>\r\nMusic\r\n<p>The tunes are all from Thunderdoom - a compilation of tracks by various artists that was released under (CC BY-SA 4.0) license.</p>\n<ul><li><em><strong>stream on youtube<br/></strong></em></li><li><em><strong>music label website  <br/></strong></em></li><li><em><strong>bandcamp</strong></em></li></ul>\r\nContext\r\n<p>On August 30th 2021 meteor struck the earth opening an unstable portal to hell. Researchers predict that if not dealt with in 30 days the portal will tear itself wide open releasing the inhabitants of hell upon us and surpassing the point of no return. Only one solution was clear: Destroy hell before it destroys us. A group of volunteers trying to ward off existential boredom have gathered in a camp inside the resulting crater to build a nuke powered by the souls of the damned that can accomplish this monumental task. You are one of them. Bring souls to the surface using the soulstone in the middle of arena. If you are having troubles - bring a friend. Don't forget the decontamination procedure before leaving the camp. You were walking on living alien flesh that has a heartbeat after all. <br/></p>\n<p>P.S. Currently hosting the hub on my laptop. Sometimes it dies. Currently hosted on a bigboy server. That costs money. Will stay alive for the entirety of September, maybe more. If you get the \"Offline\" text in the corner you can check this channel to be sure its on our end https://t.me/coxplodestatus<br/></p>\n<p>P.P.S. Nameless person top right of campfire in the crater is not real and will not respond to you ( but they will appreciate it if you are kind to them ). That's a lost soul gaining a physical form ( we are next to a portal to hell, nothing unusual about that ). They are harmless and just hang out there sometimes.<br/></p>", "metacritic": null, "released": "2021-08-30", "tba": false, "updated": "2021-09-07T15:35:15", "background_image": "https://media.rawg.io/media/screenshots/ec1/ec1c75f0a616b3ef8d3c173e961f789c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 183, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux", "Web"], "developers": ["Ash K", "Maxim Loboda"], "genres": ["Action"], "publishers": [], "esrb_rating": null}