{"id": 655011, "slug": "hades-vs-satan", "name": "Hades vs. Satan", "name_original": "Hades vs. Satan", "description": "<p>Welcome to Hades vs. Satan!!!!</p>\n<p>So you are aware....this is a jam game(made for GMCJam 42 in 4 days), and therefore like about everybody participating in jams, not all the content I wanted to put in is there.  However, it is fully functional, and only has a single bug as far as I know.</p>\n<p>You are Hades(who is not actually evil contrary to popular opinion).  You are also tired of Satan(who is actually evil) doing all the wrong.  It's up to you to go to hell and ferret Satan out.  Your own leader Zeus is also against you in this however, and will have to be dealt with.</p>\n<p>Default controls use A and D to move left and right, W to jump, and the Space Bar to shoot(just hold it down).  You can use the options menu to change those.  Click on the button for the one to change, and then hit the new button you want for the action.  Gamepads are also supported, including older DirectInput devices as well as XBOX gamepads.</p>\n<p>Make your way through 3 levels of hell.  Defeat Zeus, so you can make it to confront Satan(there is very little ending though).</p>\n<p>Hades' arsenal includes fireballs....and more fireballs.  Collect his emblems found throughout hell to upgrade yourself, allowing you to shoot faster and survive a single hit.  Complete a set of 10 emblems for this upgrade.</p>\n<p>The UI in the upper right shows your score(and yes it resets if you die).  The upper left shows how many emblems you currently have(you can only get 10 and then it resets).  An arrow will show just below that value if you are currently upgraded as well.</p>\n<p>Feel free to provide feedback, and thanks for playing.  I'm not currently planning on making this a full project, and if I do, I will likely do it in a different art style(I suck at pixel art as you can see).</p>", "metacritic": null, "released": "2021-08-30", "tba": false, "updated": "2021-09-07T15:21:15", "background_image": "https://media.rawg.io/media/screenshots/0ce/0cefa0eac77a4edeadf007d5054bd766.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Firehammer Games"], "genres": ["Action", "Platformer"], "publishers": [], "esrb_rating": null}