{"id": 655016, "slug": "28-seconds-with-a-twist", "name": "28 Seconds with a Twist", "name_original": "28 Seconds with a Twist", "description": "<p><em>Press Escape to pause the game at any time.</em><br/></p>\n<p><em>Press Enter to proceed to the next dialogue.</em>\n</p>\n<p><em>If ever you get stuck, press H to reach the very last level's exit point. <strong>Press H to win. This was included in the game because the bulk of the theme's implementation was implemented in the ending. It's best to watch the ending to get the full experience of this extended version of 28 seconds.</strong></em></p>\r\n28 Seconds with a Twist\r\n<p>This alternate version of 28 Seconds is a small action-platformer game created in 1 week for the FennecJam 1.\r\n</p>\n<p>The game was made by 1 Bit Monster. Almost all assets used in the game, excluding the music used in the main game loop, were all made during the jam. A video that tackles the process behind creating this game will be uploaded on Youtube on 1 Bit Monster's channel.\r\n</p>\n<p>The theme was \"Looks Can Be Deceiving.\" In this alternate version of 28 Seconds, you must find out why you got stuck in a simulation in the first place. You have to persevere to reach the very end of the simulation in a limited amount of time per room. You'll have 28 seconds to escape a room before the room blows up into oblivion. Make every second count.</p>\n<p>Try to accomplish the game in the fastest time possible! The timed mode is what the game was intended to be played by the get-go, but the untimed mode is present if in case the timed mode seems too hard.</p>\n<p>The bulk of the ending's music and sound effects were outsourced from other creators. The sound effect of the very last scene was taken from this website: https://freesound.org/people/Nanakisan/sounds/204703/.</p>", "metacritic": null, "released": "2021-08-30", "tba": false, "updated": "2021-09-07T15:22:32", "background_image": "https://media.rawg.io/media/screenshots/c3d/c3d7c702e3a22385da717fc6ae835cee.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 31, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["1 Bit Monster"], "genres": ["Action", "Platformer"], "publishers": [], "esrb_rating": null}