{"id": 655029, "slug": "rotation-relocation", "name": "Rotation Relocation", "name_original": "Rotation Relocation", "description": "<p><em>** Made for Kenney Jam 2021 **</em><br/></p>\n<p>The residents of this town are never happy with their house's location for long. You play as the pilot of a crane, tasked with moving these finicky residents to new locations, fulfilling their requests and convincing them to stay for as long as you can.<br/></p>\r\nGameplay\r\n<p>Residents will request their house to be moved to a new location, with a specific feature. They may want to be near the beach or river, or may want to be away from the highway.</p>\n<p>Pick their house up with your crane, and move them to a new location to keep them happy.</p>\n<p>Fail 10 requests and the game is over.</p>\r\nControls\r\nARotate the crane anti-clockwise (left)DRotate the crane clockwise (right)<br/>WMove the hook towards the craneSMove the hook towards the cameraQMove the hook upwardsEMove the hook downwardsSPACEHook/Unhook the housesESCPause the game\r\n\r\nKenney Jam 2021\r\n<p>This game was created for the 2021 Kenney Jam - a 48 hour game jam with the theme \"Rotation\".</p>\n<p>Unfortunately, due to last minute bugs and errors, I was unable to upload a working submission before the jam deadline. I worked for another couple of hours the following day to squash the bugs, and upload a working build.</p>\n<p>I plan to continue the development of this game, as I find the concept to be fun and interesting, so I thought it would be good to upload the prototype here.</p>", "metacritic": null, "released": "2021-08-30", "tba": false, "updated": "2021-09-07T15:26:43", "background_image": "https://media.rawg.io/media/screenshots/cfb/cfb52026226e40ff22b6cee821859b22.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 48, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["FuzzyMelon94"], "genres": [], "publishers": [], "esrb_rating": null}