{"id": 6552, "slug": "roll-turtle", "name": "Roll Turtle", "name_original": "Roll Turtle", "description": "**IMGA(International Mobile Gaming Awards) China - Best Quickplay Game-**<br/>Roll Turtle is an easy to play but challenging, action driven puzzle platformer That embarks you on an exciting rolling journey. Help Daddy Turtle to save his baby in 5 fantastic worlds! That&amp;#39;s Rolling! <br/><br/>◆<br/><br/>Fan Quotes<br/>5/5 - &amp;quot;This is one of those excellent puzzle games that might fall under the radar unless it&amp;#39;s featured...&amp;quot; - by Donny K76<br/><br/>5/5 - &amp;quot;This game is actually really cool! At first I thought it would be easy to play, but after about five levels, I realized it would take a lot more skill. The graphics are great, with an excellent parallax background effect, but it&amp;#39;s the intentionality behind the level design that really gets me excited. I definitely recommend.&amp;quot; - by rainmaker101<br/><br/>5/5 - &amp;quot;I really love this game. It looks amazing and the gameplay is fun and challenging. One time payment which is completely worth it!&amp;quot; - by Esther Lapre<br/><br/>5/5 - &amp;quot;Clearly made by someone who has a natural affinity for games! Alluring, seductive, infuriating - this game will suck the time like a Dyson on steroids. Enjoy - I am!&amp;quot; - by Moss bunnie<br/><br/>AWARDS &amp;amp; RECOGNITION<br/>► Winner of the IMGA(International Mobile Gaming Awards) China - Best Quickplay Game Award<br/>► Nominated of the IMGA Global (International Mobile Gaming Awards) <br/>► Nominated of the IMGA SEA(International Mobile Gaming Awards)<br/>► Gamesalad 2016 Game of the Year  <br/>► Chunghwa Telecom software development awards - Best Game<br/>► Golden Penguin Award - Find the Best Apps in Taiwan<br/>► Golden Penguin Award - Best Entertainment App 2016<br/>► Golden Penguin Award - Best International Development App 2016<br/>► WINNER of the 4C Digital Design Award<br/>► WINNER of the Bahamut Indie Game Award<br/>► Featured in the App Store’s &amp;quot;10 Best Games in Taiwan&amp;quot;<br/>► Featured in the GameSalad’s Game of the Month May 2016<br/>► Featured in the App Store’s Best New Game 116 countries<br/>► Selected at Taipei Game Show Indie Game Award Top 10 Game<br/>► Selected at Tokyo Game Show Indie game area<br/>► Selected at Casual Connect Asia Indie Game Prize<br/><br/>Features<br/>• Casual gameplay combining platformer, puzzles, and challenging with innovative level design.<br/>• 5 different worlds with 100+ truly unique levels and boss level.<br/>• Intuitive and Easy to understand controls, Touch then roll!<br/>• Super cute characters, but beware of the progressive difficulty that has a challenge for everyone!<br/>• Memorable, fun and unique soundtrack, with a different theme for each world!<br/>• No iap, No ads, with the progress of the game to unlock everything.<br/>• Universal app optimized for iPhones, iPods and iPads.<br/>• Achievements &amp;amp; Leaderboards.<br/><br/>* Retina display support - view all the detailed artwork in high quality!<br/>* Universal app: play on your iPhone, iPad or iPod touch.<br/><br/>Roll Turtle is now available in all of the following languages(accessible from the settings menu): English, French, Italian, German, Spanish, Japanese, Korean, Chinese(Traditional), Chinese(Simplified), Thai,Indonesian Bahasa, Russian.<br/><br/>Check out the game trailer - https://youtu.be/vcirq-BZS40<br/>Check out the Preview Video - https://youtu.be/1L-FVWvXaBY<br/>Official website - http://rollturtle.strikingly.com<br/><br/>Follow us:<br/>Facebook - https://www.facebook.com/RollTurtle<br/>Twitter - https://twitter.com/kirafuRyu<br/>Blog - http://tinyurl.com/jc7tyo7", "metacritic": null, "released": "2016-05-18", "tba": false, "updated": "2019-10-22T14:28:58", "background_image": "https://media.rawg.io/media/screenshots/9ba/9babca8e43dce2e254d7c85fbbf34635.jpeg", "website": "http://rollturtle.strikingly.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 118, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["FU Chun-Wei"], "genres": ["Arcade", "Family"], "publishers": ["FU Chun-Wei"], "esrb_rating": "Everyone 10+"}