{"id": 65531, "slug": "doghotel-premium-my-hotel-for-labradors", "name": "DogHotel Premium- My hotel for labradors", "name_original": "DogHotel Premium- My hotel for labradors", "description": "Open your own dog hotel now! <br/><br/>Look after all the doggies placed in your care.<br/>Granny Edith's poodle needs to lose some weight, beefy Lucky wants to join the fire department and little Lizzy wants to learn her first tricks. <br/>Make sure all the dogs have a nice time in your hotel and that they return to their owners happy!<br/><br/><br/>THE FEATURES AT A GLANCE<br/><br/># Run and expand your very own dog boarding kennel!<br/># Care for cute beagles, loyal labradors, agile Australian Shepherds and lots more breeds!<br/># Feed and groom your doggy guests and train them in clicker training and on the challenging obstacle course!<br/># Complete exciting missions. Each dog has its own story and presents you with challenging tasks!<br/># Expand your boarding kennel and decorate it to your tastes with pirate baskets or a magical shower!<br/># Pet and play with your dogs, or watch them frolic around together on the lawn! <br/><br/><br/>CARE FOR UP TO EIGHT DIFFERENT DOGS<br/><br/>As a fresh, young boarding kennel manager, you take control of your very own dog hotel. You'll find dog-caring tasks waiting for you there. <br/>You ensure that all of the dogs are happy and satisfied during their stay. Up to eight dogs can stay in your boarding kennel at a time – so you've got your paws full! <br/>Make sure they've got enough food, wash and brush their coats and clean their cages. With lots of good care and plenty of activities, they'll feel right at home! And of course don't forget to give them lots of loving care and attention.<br/><br/>So what's keeping you? Your doggy guests are waiting! Download DogHotel 3D now and open up your own boarding kennel!<br/><br/><br/>SUPPORT<br/><br/>If you have any questions or comments about this app, please contact our support team at apps@tivola.de. <br/>Or visit our Facebook page: facebook.com/tivolamobile", "metacritic": null, "released": "2015-04-02", "tba": false, "updated": "2019-10-22T14:00:54", "background_image": "https://media.rawg.io/media/screenshots/e5c/e5c88efde61bf202399a11948831252c.jpg", "website": "http://www.tivola-mobile.com/app/doghotel", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 159, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tivola Publishing"], "genres": ["Simulation", "Family"], "publishers": ["Tivola Publishing"], "esrb_rating": null}