{"id": 65551, "slug": "frontier-zombie-sniper-shooting-showdown-dead-men-", "name": "Frontier Zombie Sniper Shooting Showdown Dead Men Target Killing Games", "name_original": "Frontier Zombie Sniper Shooting Showdown Dead Men Target Killing Games", "description": "Go on a headhunt and shoot the zombies and kill them to be the hero.<br/>This is the right time to show your Sniper skills at perfect moment. No time to remain hidden after your first shot so make your own strategy before you start this shooting game. Come participate in the battle zone for human survival and zombie annihilation. Pick up your Thunder weapons and kill the zombies.<br/><br/>Multiple shooter missions and undead walking zombies to increase the thrill of the kill. Search and kill the zombies till you have secured the dead zone free of zombies.All you have to do is to pull the trigger to kill the merciless, bloody zombies. Aim the zombies at their heads for an instant kill and see the head-shot effect. Upgrade your guns to the most powerful one and shoot these zombies courageously by head hunting them.<br/><br/>This game won’t let you down with different dead killer modes and an Auto fire option. Reload your gun, shoot the zombies and be a brave shooter and go where no man has dared to go before. Choose from a wide variety of thunder guns and bullets to kill every zombie in dead zone. So what are you waiting for? Get ready to face the vicious clash to show your strength like a dead killer.<br/><br/>Game Features:<br/><br/>* 3D Zombie shooting game.<br/>* Kill different kinds of zombies.<br/>* Powerful weapons ready for total elimination.<br/>* Easy pick Up and Playing controls on the screen.<br/>* Ravishing graphics with immersive quality sound.<br/>* Furious game play<br/>* Powerful Weapons to feel the realistic performance<br/>* Various challenges with high standard shooting levels<br/>* Highly detailed open world game environment<br/>* Realistic shooting effects.<br/>* Choose from Pistols,Sub Machine Guns, Automatic guns and Machine guns<br/><br/><br/>How To Play :<br/><br/>*Tap right icons to Shoot and Reload<br/>*Use left button to move around", "metacritic": null, "released": "2016-07-21", "tba": false, "updated": "2019-10-22T14:00:58", "background_image": "https://media.rawg.io/media/screenshots/949/94935f9566d4434969058ce14bb3ac0e_FDYFRdU.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 184, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Multi Touch Studio"], "genres": ["Action", "Adventure"], "publishers": ["Multi Touch Studio"], "esrb_rating": "Mature"}