{"id": 65560, "slug": "bus-driver-2016-schoolbus-vehicle-steering-simulat", "name": "Bus Driver 2016 Schoolbus Vehicle Steering Simulator Driving School Training", "name_original": "Bus Driver 2016 Schoolbus Vehicle Steering Simulator Driving School Training", "description": "Join the Bus Ride of a lifetime with Bus Driver 2016!<br/>In Bus Driver 2016,your duty is to TRANSPORT passengers between the bus stops around the city more you transport passenger more you can earn.<br/><br/>You can buy more POWERFUL buses from your earning. You can drive the Bus through hills or on the highway. This is the place where you can experience all kind of MADNESS as a bus driver.Get set for another round of an EXCITING bus driving simulation game, this time with more fun and action packed game-play.<br/><br/>Try to stop in time at the right bus stop and complete your route. <br/>Open up the doors again and say goodbye to your passengers.<br/>Park your bus without hitting barriers.<br/><br/>With over 20 missions in this Bus Driver 2016, you will get more than enough challenges, thrills and entertainment.<br/><br/>As soon you reach nearby parking spots, make sure that you apply the brakes gently since you want to assure a smooth ride for the passengers.<br/><br/>This game will serve as a test for your driving and parking skills.<br/><br/>Bus Driver 2016 FEATURES :<br/><br/>Realistic Bus Simulation<br/>High quality graphics and multiple missions<br/>Realistic bus driving experience<br/>Exciting Difficult Missions set in a 3D City Environment<br/>Pick up and Drop off Passengers at the right destination<br/>Full 3D Bus Simulator<br/>Smooth Bus Handling<br/>Classic Drive Controls<br/>Challenging Game-play<br/><br/>HOW TO PLAY :<br/><br/>Tap your iPhone/iPad on right to change Gears and accelerate.<br/><br/>Control the steering on left side.", "metacritic": null, "released": "2016-09-03", "tba": false, "updated": "2019-10-22T14:00:58", "background_image": "https://media.rawg.io/media/screenshots/5c4/5c421e32d502ab905604e6b88c1037ae_SMROAuF.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 153, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Multi Touch Studio"], "genres": ["Adventure", "Simulation"], "publishers": ["Multi Touch Studio"], "esrb_rating": "Everyone 10+"}