{"id": 655616, "slug": "this-is-fine-gammafoxtbg-arkanpixel-alejandro-phz", "name": "This is Fine (GammaFoxTBG, Arkanpixel, Alejandro PHz)", "name_original": "This is Fine (GammaFoxTBG, Arkanpixel, Alejandro PHz)", "description": "<p>After a heated argument with your boss, probably involving pineapple and pizza, you are now the proud owner of the flimsiest ship in the galaxy, on your way to deliver your cargo of [REDACTED] to [REDACTED]. How long will it take? Who knows!<br/></p>\n<p><strong>HOW TO PLAY</strong></p>\n<p>You must survive as long as you can with your ship, fixing up its constantly-breaking stations to keep both it and you voyaging through space! Make sense of the chaos around you through visuals and sound to prioritize the immediate dangers that arise. The different areas will have different cues pertaining to their current status, so pay careful attention as you learn to recognize them!</p>\n<p>We apologize, as we ran out of time to make a tutorial or win screen, but you can brag about how many years you survived in the comments! If you want to have a straightforward explanation of the stations instead, read below.</p><p><strong>PLAY GUIDE</strong><br/></p><p>- Radar: Controls whether the alarm sounds off when your ship is going to collide with something. You'll know this needs repair when you no longer hear the occasional regular pinging</p><p>- Pilot seat: You interact with this to extend how long before you collide with an asteroid. If you fail to do so, you will be hit at a faster rate, so this will be a top priority!</p><p>- Oxygen generator: Unsurprisingly, a lack of oxygen causes death. There's a subtle whirring sound in the background while this is working, and you can hear it slowly shut off when the power is depleted. Pay attention to the sound and your health!</p><p>- Medbay: The lights on the bed will indicate whether it has power or not, and after so many uses, it will break down.</p><p>- Elevator: Similar to the medbay, but you'll see sparks flying out when it's unusable</p><p>- Power generator: You'll notice that the lights are fading, and this is the time to start running to repair! Once this happens, the backup power will start depleting, and when fully drained, the ship will stop running. As soon as you start repairing it, backup power will begin to replenish, so don't worry if it gets a bit low, but ideally fix it up as much as you can.</p><p>- Vent: Despite those warm, glowing eyes, you'll want to be careful around the vent. When you hear the screech from across the ship, there'll be danger afoot! You'll want to repair the vent when the monster isn't present, or you might get a painful hug.</p>\n<p><strong>CONTROLS</strong></p>\n<p>WASD / Arrow Keys - Move<br/>E - Repair/Interact<br/>Escape - Quit</p>", "metacritic": null, "released": "2021-08-29", "tba": false, "updated": "2021-09-07T18:21:51", "background_image": "https://media.rawg.io/media/screenshots/2b1/2b160837ba006fda0f4b8ef35956c76f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 99, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Web"], "developers": ["GammaFoxTBG", "Alejandro PHz", "Arkanpixel"], "genres": [], "publishers": [], "esrb_rating": null}