{"id": 655868, "slug": "case-moonlight", "name": "Case Moonlight", "name_original": "Case Moonlight", "description": "<p>A retired detective with a mysterious past will have to return to his old home to solve an unfinished case, but not only the case will be the greatest of his concerns, he will have to face his destiny and unravel the dark secrets of the city of FlowerStone. Will he be able to solve the case that once plagued him? Or he will be consumed by his own demons?<br/></p>\n<p>Case Moonlight is a visual novel with some Point &amp; Click game elements</p>\n<p>The game is just a demo of what I plan to do</p>\n<p><strong>Update 0.0.4</strong><br/></p>\n<p>I'm already working on the next part of the prologue!</p>\n<p>Thanks for the support, you have motivated me to continue with the project</p>\n<p>I just updated the game to fix some bugs and add a few tidbits</p>\n<p><strong>What's new?</strong></p>\n<p>* Fixed some transitions</p>\n<p>* Fixed most grammar errors</p>\n<p>* A new hint system</p>\n<p>The continuation of the story will come out in the next version, again thank you very much!</p>\n<p>Any doubt, error, suggestion you can leave it in the comments\r\n</p>\n<p>If you find a spelling mistake, don't hesitate to let me know\r\n</p>\n\n<p>---------------------------------------------------------------------------------------------------<br/></p>\n<p>Un detective retirado con un misterioso pasado tendrá que volver a su antiguo hogar para resolver un caso que quedó inconcluso, pero no solo el caso será la mayor de sus preocupaciones pues tendrá que enfrentarse con su destino y desentrañar los oscuros secretos de la ciudad de FlowerStone, ¿será capaz de resolver el caso que alguna vez lo atormento? ¿O será consumido por sus propios demonios? <br/></p>\n<p>Case Moonlight es una novela visual con algunos elementos de juegos Point &amp; Click</p>\n<p>El juego solo es una demo de lo que planeo hacer por ahora</p>\n<p><strong>Actualización</strong><strong> 0.0.4</strong></p>\n<p>Ya estoy trabajando en la siguiente parte del prólogo!</p>\n<p>Gracias por el apoyo, ustedes me han motivado a seguir con el proyecto</p>\n<p>Acabo de actualizar el juego para arreglar algunos errores y agregar algunas cosillas </p>\n<p><strong>¿Que hay de nuevo?</strong></p>\n<p>*Se arreglaron algunas transiciones</p>\n<p>*Se arreglaron la mayoría de errores gramaticales </p>\n<p>*Un nuevo sistema de pistas</p>\n<p>La continuación de la historia saldrá en la siguiente versión, de nuevo muchas gracias!</p>\n<p>Cualquier duda, error, sugerencia puedes dejármela en los comentarios <br/></p>", "metacritic": null, "released": "2021-08-29", "tba": false, "updated": "2021-09-07T19:42:24", "background_image": "https://media.rawg.io/media/screenshots/9d8/9d8384357303838c2fc6eb76e37b7002.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 168, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Android"], "developers": ["TheAlvaroex"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}