{"id": 65582, "slug": "flying-ambulance-3d-simulator-2016", "name": "Flying Ambulance 3d Simulator 2016", "name_original": "Flying Ambulance 3d Simulator 2016", "description": "Flying Ambulance 3d simulator<br/><br/>Welcome to biggest open world Flying Ambulance Simulator. In this crazy game you will be flying with an amulance.<br/>Everything including physics are created to be as realistic as a real flying ambulance as possible. <br/>Explore the beautiful open world with big cities and amazing wild nature terrains. <br/><br/> Life and death is in the balance and everything depends on your helicopter piloting skills!<br/>aircraft Ambulance features finely-tuned controls, once you master them you’ll be able to airborne quickly and smoothly across beautifully rendered 3D terrain.<br/>Detailed HUD system including all essential flight information: airspeed, ascent/descent speed, altitude, ground altitude, motor blade <br/><br/>rotation speed, and engine power switch. You have total control of your rescue emergency vehicles!<br/>Get ready to experience the endless flying Car Battle with the simulation of city with high-rise buildings.<br/><br/>Drive your muscle car do stunts and drifts ! burn the asphalt road ! be the best car driver!<br/>You are free in a world that you can do what you want.<br/><br/>Play airborne,ambulance to save people from disasters &amp; accidents.<br/>Enjoy this ambulance simulator game and you will forget about school bus parking or ambulance parking games.<br/>This air ambulance airborne simulator games provides you with many hours of exciting and challenging game levels. <br/>Your mission is the same as normal, not aircraft simulator. A lot of really cool features opportunities are waiting for you. Have Fun.<br/>Install now and feel the best airplane flight experience!<br/><br/><br/>key features: <br/><br/>Amazingly realistic emergency game<br/>you are driving a ambulance which looks really amazing!<br/>Show off your skills", "metacritic": null, "released": "2016-05-02", "tba": false, "updated": "2019-10-22T14:00:59", "background_image": "https://media.rawg.io/media/screenshots/0d4/0d4e99a75ca043f9912c877c090fa923.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 120, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["yibi gen"], "genres": ["Simulation", "Racing"], "publishers": ["yibi gen"], "esrb_rating": "Everyone 10+"}