{"id": 655998, "slug": "tank-tactics-igor-konyakhin", "name": "Tank Tactics (Igor Konyakhin)", "name_original": "Tank Tactics (Igor Konyakhin)", "description": "5Mf4Qwyh0UFQV83qBhUY \r\n<p>Join the first official public room (paste the code above in a Room ID field)<br/></p><p>Tank Tactics is a simple looking online multiplayer game about cooperation and trust. </p>Rules overview<p>You control a tank in a grid among <strong>20+ other players</strong>. Your goal is to kill everyone else and remain the only one alive. Do you have what it takes to be the one?</p><p>All your actions cost action points. You can shoot within your range (1 damage - 1 action point), you can move (1 cell - 1 action point), you can gift your action points or health to other players within your range. Your range starts at 2, but you can upgrade it for 3 action points. You can also heal for 3 action points.</p><p>How do you get action points? You get 1 action point every 17 hours. <strong>This is a slow-paced game</strong>. And that is intentionally so: talk, unite, strategize and plan with other players in-between. The game is going to take a couple of weeks to complete, probably, but it shouldn't require more than a few minutes of your time each day ... At least that's what the original game creator Luka Muscat thought before they had started playing.</p>\r\nGame rules\r\nTeam up and strategize!\r\n<p>For that you have chat at the bottom of this page and (probably more importantly) the ability to change your \"status\" in the right column with a text of up to 200 characters - you can use it to share your contact details, so others can contact and discuss with you privately. <strong>Play \"outside\"!</strong> In fact, the game is designed to be played outside: exchange Discord/Telegram details, organize chats, do voice calls - whatever it takes, you are free<br/></p>\r\nYou control a tank, you can\r\n<ul><li>Move  orthogonally or diagonally - click on the blue cell to move: moving one  cell takes one action point (cells where you can move are highlighted in  blue, specified with corresponding move cost depending on the distance)\r\n</li><li>Shoot  players within you range (hover mouse over them and choose how much  damage you want to deal), dealing one damage takes one action point\r\n</li><li>Kill other players, player is killed when his/her health becomes zero\r\n</li><li>Capture dead player's action points: when you kill a player, you automatically get all this player's action points\r\n</li><li>Transfer  (=gift) action points or health points to players within your range  (hover mouse over the player and choose what and how much you want to  transfer). There is no transfer fee - the player receives exactly the  same amount you transferred.\r\n</li><li>Restore health: each health point costs 3 action points (in the \"Self actions\" section)\r\n</li><li>Increase your range: each range point costs 3 (in the \"Self actions\" section)\r\n</li><li>Revive dead players by transferring them one or more health point\r\n</li></ul>\r\nYou can't\r\n<ul><li>Sacrifice your last health point to transfer it to someone else\r\n</li></ul>\r\nDead players form \"The Jury\"\r\n<ul><li>You are not out of the game\r\n</li><li>You can vote for the player you'd like to help. Every 3  votes from the jury award the player extra action point at the  \"schedule\". To vote hover the mouse over the player-cell (not player in  the right column) you'd like to vote for.\r\n</li><li>Furthermore, you can be revived if someone transfers=gifts you a health point\r\n</li></ul>\r\nOnce every 17 hours so called \"schedule\" happens\r\n<ul><li>Dead players (the Jury) each receive 1 vote(s)\r\n</li><li>Alive players receive 1 action point(s) each\r\n</li><li>In addition to regular received action points, alive player receives extra 1 action point for every 3 votes received from the jury\r\n</li><li>Votes  don't carry over, neither for alive players, nor for jury. Meaning each  \"schedule\" both jury's unused votes and alive players' remaining votes  are reset to zero.\r\n</li></ul>\r\nLast standing player wins\r\n<p>In case something is unclear, you want to join discussion or for any other reason, <br/>join game's official Discord: discord.com/invite/f5XpW3k89v <br/>or message me on Telegram (@nns2009) <br/>Watch the video that inspired the making of this game: The Game Prototype That Had to Be Banned by Its Own Studio (it might also help if you are confused about the rules). And by the way, I also have a YouTube channel, where I'll be making video about making this game and how it played out, so if you are curious, subscribe to my YouTube not to miss it.</p>", "metacritic": null, "released": "2021-08-29", "tba": false, "updated": "2021-09-07T20:25:34", "background_image": "https://media.rawg.io/media/screenshots/2c7/2c7988da1230788899afdf95b72573e4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 11, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Igor Konyakhin"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}