{"id": 655922, "slug": "empty-canvases", "name": "Empty Canvases", "name_original": "Empty Canvases", "description": "<p>UPDATE: due to feedback of game difficulty, there is an alternate version available here with scaled back difficulty: Empty Canvases v1.1 by VanBurace (itch.io).</p>\n<p>NOTICE: for anyone not interested in downloading the game, there is a gameplay-only version linked here: Empty Canvases (gameplay only) by VanBurace (itch.io).</p>\n<p>Please rate on this page if playing on either alternative link.</p>\n<p>I recommend the full download for the best experience, but this is for anyone who has any reason to not do so. Rating only available on the main submission page.</p>\n<p>Follow a tale of self sabotage and frustration as a man who once aspired to be an artist rages against the world of art as a whole until nothing remains but a room of empty canvases. </p>\n<p>I suggest giving it a go blind first, but feedback has told me the game eres on the side of difficult, so if you are having trouble...</p>\n<p>GAMEPLAY TIPS/STAGE REQUIREMENTS:</p>\n<p>Stage 1: get close to the blocks and jump straight up till you hit the peak of your jump, then move in the direction of the block. This makes getting on top without jostling them much easier.</p>\n<p>Stage 2: dodge projectiles till a sword is thrown. Pick it up and a visual indicator will show you where to cut. Do this 3 times.</p>\n<p>Stage 3: the most straight forward, just platform quickly. The floor is made of multiple segments, each with their own collider, which occasionally causes the player to get stuck, just hop forward to proceed.</p>\n<p>Stage 4: Final boss, 7 hits total to win. Hit it in the eye by jumping straight up from the top platform and attacking. Upwards attacks recommended. Good luck.</p>", "metacritic": null, "released": "2021-08-29", "tba": false, "updated": "2021-09-07T20:00:34", "background_image": "https://media.rawg.io/media/screenshots/d9a/d9aba3d157462df2b8c79c1625688adf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 138, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["VanBurace"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}