{"id": 655907, "slug": "factory-of-anarchy", "name": "Factory of Anarchy", "name_original": "Factory of Anarchy", "description": "Factory of Anarchy\r\n<p>Welcome new employee! It is good to have you with us. Please make yourself comfortable while I get your paperwork in order. I can see that you are well qualified. I hope that means you will last longer than previous workers...</p>\n\r\nOur reactor is such a fickle thing. Always breaking in one way or another...\r\nThe Game\r\n<p>The factory reactor is ready to overload. Complete as many tasks as possible to keep it working. If you can't fix it fast enough, you could always call for someone else to do it. Know however that we will deduct the expenses from your paycheck.</p>\r\nHow to play\r\n<p>Press enter to start the game and use your mouse to complete various tasks. Fullscreen is recommended.</p>\r\nCredits\r\n<ul><li>All art made by Nicolas Vandendriessche.</li><li>All music and sound were done by Maximiliaan Hendrikx. </li><li>All programming by Nicolas and Maximiliaan.</li></ul>\n<p>P.S. The WebGL version has some issues: certain sound effects sound very differently (softer, some frequencies filtered out), and the bottom left microgame doesn't always properly follow the mouse. The Windows build can always be downloaded to avoid these issues :)</p>Detailed explanation<p>If you'd like to have a detailed explanation of the entire game before going on, here's a tutorial.</p><p>There is a chaos meter (the big green bar) that is constantly increasing. If the bar fills up completely, you lose the game. In order to bring the bar down, you have to constantly complete the six microgames that are sporadically activated (you can see this by looking at the lights which turn red if you need to fix it).\r\n</p>\n<p>There are six microgames: \r\n</p>\n<ul><li><strong>Color Switch</strong> (top left): All nine of the tiles must be the same color as the indicator right below it. Change the color by clicking on a tile.\r\n</li><li><strong>Pressure Regulator</strong> (top middle): All three gauges have to be filled by clicking on the buttons below them repeatedly, until they are all simultaneously full.\r\n</li><li><strong>Temperature Regulator</strong> (top right): The temperature has to be set to the desired amount. You can change the temperature by clicking on the +1 and +0.1 buttons. If you overshoot, click on the reset button.\r\n</li><li><strong>Rewire</strong> (bottom left): Every lightbulb must be dragged to the socket of the same colour. Click and drag to move lightbulbs.\r\n</li><li><strong>Levers </strong>(bottom middle): All levers have to be up (also indicated with a green light). Every lever that you click changes the levers in a particular way, try to figure out what they all do.\r\n</li><li><strong>Fuses </strong>(bottom right): All fuses have to be on at the same time. Click on a fuse to toggle it on.\r\n</li></ul>\n<p>Every completed microgame gives you a coin, which you can use on the three buttons to the right. These buttons will finish a certain amount of microgames for you and bring the chaos meter down.</p>", "metacritic": null, "released": "2021-08-29", "tba": false, "updated": "2021-09-07T19:55:31", "background_image": "https://media.rawg.io/media/screenshots/fc8/fc839d7c745131d428bc88f118ff9859.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 86, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["bobbes4321", "Nicolas Vandendriessche"], "genres": [], "publishers": [], "esrb_rating": null}