{"id": 656093, "slug": "boxes-drones-and-kaos", "name": "Boxes, Drones and Kaos!", "name_original": "Boxes, Drones and Kaos!", "description": "<p>You work at Box&amp;Fuel, a packaging company with several warehouses that have to be perfectly organized.</p>\n<p>One day, you are fired and replaced by drones (which do the job better and cheaper).</p>\n<p>Filled with rage, you accidentaly summon <strong>Kaos, god of destruction</strong>. He offers you a deal: Let him inside your body and he'll give you the powers to get your revenge!</p>\n<p>Your goal in this fast-paced game is to get as many boxes out of their place as you can! Although you begin only being able to take them with your hands, the more you move them, the quicker you'll level up and obtain new abilities.</p>\n<p>There are over <strong>13 unique abilities</strong>! Dashing, Fireballs, Grenades, Freezing, Tornadoes, Explosive Ducks, even Black Holes and many more!! </p>\n<p>Try to<strong> destroy as much as you can</strong> in 3 warehouses (each bigger than the last!) while drones try to put every box back in its place.</p>\n<p> Discover the secrets of the company you've worked for with <strong>2 cinematics</strong> and many <strong>voicelines</strong> from Kaos, talking from within you...</p>\n<p>Get your revenge fighting against the<strong> Final Boss</strong> and unlock God Mode, where you get no cooldowns and a whole city to destroy!! </p>\n<p>Don't hold anything back, level up by moving everything out of place, discover new and fun powers of destruction and most importantly...<br/></p>\n<p><strong>LET THERE BE CHAOS  KAOS</strong></p>\n\n<p>This game was developed by Víctor de Campos and assets, art and programming were made from scratch :)<br/></p>\n<p>(art ig: @the_erydian)</p>", "metacritic": null, "released": "2021-08-29", "tba": false, "updated": "2021-09-07T20:54:42", "background_image": "https://media.rawg.io/media/screenshots/a93/a93d1fb59869095e7482367a85b45b78.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 218, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Erydan"], "genres": ["Action"], "publishers": [], "esrb_rating": null}