{"id": 656185, "slug": "blazing-lambert-demo", "name": "Blazing Lambert [Demo]", "name_original": "Blazing Lambert [Demo]", "description": "<p>WARNING</p>\n<p>This game contains flashing lights, It may cause discomfort and trigger seizures for people with epilepsy, player discretion is advised.</p>\n<p>Description </p>\n<p>This is a endless runner game with a lot of neon lights :D. The game is not complete yet, this is a demo for the game which will soon be release on mobile platforms. <br/></p>\n\n<p>I am a Game Tester by profession, but i am a Bachelor in Game Development &amp; Animation, i have always tried working on my own stuff, learning new thing and exploring all departments in the gaming industry. During my 3 year degree program i learned game development in Unity, but i genuinely want to know more so I started working on unreal engine recently, I have been trying to understand blueprints and how other stuff work in unreal, it's pretty fun but also a tad bit confusing sometimes :D. I started with a endless runner game, i just wanted to make it look as simple as possible, but something different at the same time. For basics i tried following some tutorial to get the endless runner mechanisms. Then i started creating the player and environment design. I realized neon bars are was something which are very simple but attractive, so i decided to go with that. Now the game isn't completed yet, i keep getting stuck when it comes to programing stuff. So i thought maybe ill share a glimpse of my game here, and if there is someone who is interested in working on this with me, ill be more than happy. I wont be able to pay you, all i can do is to add you names in the credits of the game once its done, dm me if you are interested, and if you are not interested that is completely fine too, just let me know how you feel about the game, is it good? is it bad? is it just uhh ok? :D Just keep in mind i have a lot more stuff planned to add to this game, lets hope all goes well &amp; i get done with this soon Please fill this form if you are interested to work on it with me https://lnkd.in/eYtiMYJ</p>", "metacritic": null, "released": "2021-08-29", "tba": false, "updated": "2021-09-07T21:23:35", "background_image": "https://media.rawg.io/media/screenshots/e05/e057dd0b6b573359d6139037800b7e81.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 57, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Remenent"], "genres": [], "publishers": [], "esrb_rating": null}