{"id": 656293, "slug": "saturday-morning-apocalypse", "name": "Saturday Morning Apocalypse", "name_original": "Saturday Morning Apocalypse", "description": "<p>Shi Sakerarenai ( 避けられない 死 ), is a power telepath who has dissociative identity disorder. Each of her four personalities has a different psychic ability and she can not control when her personality changes. Believing that one day she will go nuclear, Shi was brought to a government lab to receive a lobotomy to neutralize her powers. However, before the operation could start, Shi escaped the government lab, destroying everything and everyone in her path.<br/></p>\n<p>In this fast-paced shoot ‘em up, inspired by 90’s Saturday morning cartoons, you play as Shi with access to her unique powers and abilities. Battle your way through the chaos of ferocious security bots before time runs out to complete your escape! All the while, you are unable to control your abilities causing massive chaos, each time your powers switch your perspective of the world changes based on your personality. Though do all this knowing that after you escape you will soon end the world. You are the villain, this is how it all ends, let there be chaos!</p>\n<p><strong>Power Types :</strong></p>\n<ol><li>Telekinesis - Move floating knives with your mind to attack.</li><li>Pyrokinesis - Control fire itself to attack your enemies.</li><li>Psychic Blast - Release psychic energy to attack.</li><li>Electrokinesis - Control Lightning to attack your enemies.</li></ol>\n<p><strong>Instructions / Controls :</strong></p>\n<p>Survive the wave of enemies until the timer runs out. Use your keyboard and mouse to move up and down and shoot. Or use your gamepad ( Xbox A button to fire ). Press the start button, or the ESC key at any time to access the pause menu which may be useful to restart the level.</p>", "metacritic": null, "released": "2021-08-29", "tba": false, "updated": "2021-09-07T21:57:22", "background_image": "https://media.rawg.io/media/screenshots/3a8/3a81fe2aee4f5178f7a039e31edbd237.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 127, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Johnny Jacques", "Brian Paul Zimmerman"], "genres": ["Action"], "publishers": [], "esrb_rating": null}