{"id": 65644, "slug": "flying-school-bus-simulator-game", "name": "Flying School bus Simulator game", "name_original": "Flying School bus Simulator game", "description": "Flying School Bus simulator<br/><br/>Are you ready for an entertaining adventure? <br/>Hey there Flying School Bus simulator! We offer you the chance to be the best schoolbus of the city!<br/>Welcome to biggest open world Flying car Simulator. In this crazy game you will be flying with an bus. this might seem strange, but this game is really a lot of fun and challenge. Everything including physics are created to be as realistic as a real flying bus as possible.<br/> <br/>Explore the beautiful open world with big cities and amazing wild nature terrains. <br/>Thanks to modern games that look cool even on mobile phones, now we can better understand how it would look in real life.<br/>Flying Car Battle is 3D Battle game with fast flying cars simulation. It is a unique 3D BUS shooter with a creative physical puzzle.<br/>Start the engine and go up into the sky. Good graphics help you even more to smile watching how to fly this old veteran coaches like modern combat fighter.<br/>The summer holidays are finally over and you’re preparing to get back to work. The kids are waiting for their favorite bus driver to transport them.<br/><br/>This game is perfect for you! You can test your airplane pilot skills and bus driving ability at the same time.<br/>Fly your plane around the world discover new landscapes, Drive your muscle car do stunts and drifts ! burn the asphalt road ! be the best car driver!<br/>Flying School Bus simulator 3D is made for all fans of free car driving games, Simulation games and Airplane Flight games.<br/><br/>Graphics is wonderful interiors will make you feel like driving a real bus!<br/>Fly around the world travel beautiful landscapes be a real bus driver.You are free in a world that you can do what you want.<br/>Install now and feel the best airplane flight experience!A lot of really cool features opportunities are waiting for you. Have Fun.<br/><br/>Key Features: <br/><br/>=&gt; Stunning HD Graphics<br/>=&gt; Beautiful Landscapes<br/>=&gt; Easy and Free to use<br/>=&gt; Beautiful Mountains<br/>=&gt; No WiFi? No Problem.<br/>=&gt; Offline Play", "metacritic": null, "released": "2016-05-24", "tba": false, "updated": "2019-10-22T14:27:03", "background_image": "https://media.rawg.io/media/screenshots/a76/a768079b9aea9d377e2583e9294dfa63.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 89, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["yibi gen"], "genres": ["Racing", "Family"], "publishers": ["yibi gen"], "esrb_rating": "Everyone 10+"}