{"id": 65652, "slug": "winter-snow-hill-bus-driving-simulator", "name": "winter Snow hill Bus Driving simulator", "name_original": "winter Snow hill Bus Driving simulator", "description": "winter Snow Hil Climb Bus driving simulator 2016<br/><br/>From each other by mountain climbing adventure race level is waiting for you!<br/>This Snow Hill Bus Drive give you the chance to become a pro driver of the winter bus on the slope snow.<br/>You need to act fast and drive carefully in the hazardous weather of snowstorm and snowfall.<br/>Hilltop bus driving are experts in cutting those curvy hilly corners but snow blizzards and land sliding adds to the real risk and challenge.<br/>Winter Snow bus is a challenging game and you can test your driving skills in risky and dangerous conditions and difficult snowy paths.<br/>Snowy mountains are extremely slippery and covered with a thick blanket of snow during winter season and get the real feel of nature.<br/>It’s a survival game, so play as the extreme highland bus driver to fulfil the duty .<br/>Face the challenges of unique mount climbing environments with many different buses. Gain bonuses from daring tricks and collect coins to upgrade your bus and reach even higher distances.<br/><br/>Drive and climb throughout different scenarios. Change your Bug and get a new gaming experience.<br/><br/>key features:  <br/><br/>Amazing Hill Station and with heavy snow 3D Graphics.<br/><br/>Smooth Steering, Brakes and Drifting<br/><br/>Explore city and hilly with heavy snow<br/><br/>Smooth touch controls for easy driving", "metacritic": null, "released": "2016-02-02", "tba": false, "updated": "2019-10-22T14:27:04", "background_image": "https://media.rawg.io/media/screenshots/660/66075ee5043898a02be368d57d5dbf63.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 161, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["yibi gen"], "genres": ["Simulation", "Racing"], "publishers": ["yibi gen"], "esrb_rating": "Everyone 10+"}