{"id": 656668, "slug": "diner-defender-alpha", "name": "Diner Defender (Alpha)", "name_original": "Diner Defender (Alpha)", "description": "<p><strong><em>Description:</em></strong></p>\n<p>Have you ever played a tower defense game where instead of shooting enemies using ammo and gunpowder, you rather throw junk food at them? Well, this game revolves around the idea of having to satisfy customers before they reach headquarters to complain.</p>\n<p>Satisfy each customer's needs by delivering their orders. Some customers need more food to satisfy themselves. Can you satisfy them all?</p>\n<p><em><strong>Development Notes:</strong></em></p>\n<p>The game is in early development (alpha). Please note that there is still a lot to add to the game (the addition of a lasagna diner, a sushi diner, and sound/music for instance).</p>\n\n<p><strong><em>Cheat Codes:</em></strong></p>\n<p>(Here are all of the cheat codes that can be used in the game. Use Tab to enable or disable the console. Beware: cheats are case sensitive)</p>\n<p><em>CompleteLevel</em>  - This cheat will clear the current level (unlocking the next level).</p>\n<p><em>AddPMoney</em> - This cheat will add P to your current save to use on unlocking towers.<br/></p>\n<p><em>AddCashMoney</em> - This cheat will add dollars to your in-game money to use on upgrading towers.<br/></p>\n<p><em>UnlockLevels</em> - This cheat unlocks all current levels.</p>\n<p><em>UnlockDiners</em> - This cheat unlocks all current towers.</p>\n<p><em>EasyEverything</em> - This cheat unlocks all towers, all levels, sets your P count to 1000, and (if you are in-game) sets your dollar amount to $1000000.<br/></p>", "metacritic": null, "released": "2021-08-28", "tba": false, "updated": "2021-09-07T23:52:27", "background_image": "https://media.rawg.io/media/screenshots/e59/e59771bbbe40e11fd30f4496c9396324.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 79, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Coded Cookie"], "genres": [], "publishers": [], "esrb_rating": null}