{"id": 65662, "slug": "prince-of-persia-classic-hd", "name": "Prince of Persia Classic HD", "name_original": "Prince of Persia Classic HD", "description": "\"Faithful recreation of one of the most famous games in the history of the medium, with revised graphics and touchscreen controls that make it feel like a new experience\" - Pocketgamer <br/><br/>#1 app in over 20 countries ! <br/><br/>\"The game looks and sounds absolutely gorgeous \" - Toucharcade <br/><br/>\"App of the Day: Prince of Persia HD\" - Eurogamer <br/><br/>\"The Original Prince of Persia Gets a Gorgeous HD iOS Makeover\" – Kotaku <br/><br/><br/>\"Challenging and methodical, Prince of Persia’s gameplay feels well-suited to the restrictions of the iPhone\" - Slide To Play <br/><br/>___________________ <br/><br/>The Age Old Epic Saga is back in High Definition. Relive the classic or play it for the first time, either way it’s always been your destiny.<br/><br/>Features<br/><br/>Old tale, New skin<br/><br/>The Path to rescue is thrilling. Replay the adventure of the original Prince of Persia in a complete new skin as you battle your way through the game to rescue the Princess. Perform death defying stunts as you proceed from the dark and grim dungeons to the beautiful Palace tower.<br/><br/>Amazing Levels<br/><br/>The path to rescue is never simple. The levels are filled with traps which won’t be all that easy to navigate across and merciless prison guards! Unveil the dark secret and set in stone the legacy that will follow. <br/><br/>Multiple Game Modes<br/><br/>-Normal Mode: Understand the game, learn different tricks and find the quickest way without having to worry about time or death penalty. <br/>-Time Attack: Race against the sands of time as you navigate the levels, fighting the guards and find the exit on your quest to rescue the Princess. Make haste… you have only 60 minutes. <br/>-Survival: The most compelling and challenging way of rescuing the Princess is the one in which the Prince remained unbeaten. Complete the game, in 60 minutes, without dying. <br/><br/>Facebook and Game Center<br/><br/>What is a rescue without any rewards, apart from the Princess of course!<br/>-Unlock Game Center ACHIEVEMENTS and earn a place on the LEADERBOARDS to challenge your friends to perform better than you.<br/>-Every hero deserves recognition. Share your achievements and score with your friends via FACEBOOK and MAIL.<br/><br/>If you have any feedback, please email us at apple.support@ubisoft.com", "metacritic": null, "released": "2012-02-29", "tba": false, "updated": "2019-07-29T09:09:51", "background_image": "https://media.rawg.io/media/screenshots/790/790ff95532d18fd5e7092c144c530f42.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 2, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 108, "game_series_count": 0, "reviews_count": 3, "platforms": ["iOS"], "developers": ["Ubisoft"], "genres": ["Action", "Adventure"], "publishers": ["Ubisoft Entertainment"], "esrb_rating": null}