{"id": 656758, "slug": "tinker-tanks-2", "name": "Tinker Tanks!", "name_original": "Tinker Tanks!", "description": "<p>Welcome to Tinker Tanks! You are a tank.<br/></p>\n<p>A plastic toy death machine shrunk down to fit in the palm of your hand. Rubber ducks and pincushions tower before you. Time to break stuff!</p>\n<p>Blast your way through Level Mode, where over 33 destruction-filled levels await! Test your skill in Trial Mode, and survive 50 brutally designed arenas!<br/>Fight with (or against) your friends in the chaotically crafted Battle Mode!<br/>Relax in the Stage Builder, as you design your own Custom Battle Maps!</p>\n<p>Unlock Powerups and Hats.<br/>Modify your tank with these newfound abilities, and resume the destruction.<br/>Unlock Endless Mode.<br/>Survive in procedurally generated arenas that get more difficult the further you go.<br/>Unlock the Custom Tank Creator.<br/>Make your own Custom AI Tanks and place them in your Custom Battle Maps!</p>\n<p>Engage in destructively fun top-down tank warfare! Try out the constructively fun battle arena building! Topple a monarchy. Upgrade your tank. Wear a silly hat. Wear a serious hat. Cooperate with your friends. Destroy your friends.</p>\n<p>For you are a tank.</p>\n\n<p>Tinker Tanks! features:<br/>33+ Levels for 1-3 players.<br/>50 handcrafted Trials for 1-2 players.<br/>An infinite number of procedurally generated Trials for 1-2 players.<br/>20 Battle Mode Maps for 1-4 players<br/>The ability to make, share, and play on Custom Battle Maps!<br/>The ability to make, share, and battle Custom AI Tanks!<br/>A progression system, where your high scores become a currency that can unlock many things!<br/>A myriad of options to improve performance, tweak controls, and change the flow of the Battles!<br/>Mouse/Keyboard and X-box Controller support (each player will need their own controller)</p>", "metacritic": null, "released": "2021-08-28", "tba": false, "updated": "2021-09-08T00:20:24", "background_image": "https://media.rawg.io/media/screenshots/ffc/ffca48b224d367b07c5d7f726dd9fa10.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 63, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Guppy Jar Games"], "genres": ["Action"], "publishers": [], "esrb_rating": null}