{"id": 656760, "slug": "redsugarsociety", "name": "REDSUGARSOCIETY", "name_original": "REDSUGARSOCIETY", "description": "<p><em>Sit, smile, eat. Leave everything to Maddox, nod along, play along. Don't worry about anything else.</em></p>\n<p><em>The intimate dining room feels suffocating, the only thing going round in your head the only one that shouldn't, because fuck if it doesn't make you dizzy and antsy and just all around ill at ease, and all these people—these politicians, doctors, the deputy fucking mayor of Adafield—with their hollow smiles and even emptier words just drive you further towards what you think is the edge of losing your mind.</em></p>\n<p><em>They don't know, you think as your gaze slides over the opposite side of the oaken table. They don't have the faintest idea what is going to happen to them.</em></p>\n<p>...Because <strong>you are </strong>what is going to happen to them.</p>\n<p><strong>REDSUGARSOCIETY </strong>is a fast-paced, romance-driven episodic 18+ interactive story in development where you join forces with a former crime lord gone good and the Deputy Mayor's child, to put an end to the grand scheme of the corrupted elite in the city of Adafield, all the while trying to keep your co-worker slash babysitter breathing down your neck at bay.\r\n</p>\n<p>One of them might die. Another might betray you. It is your choices that will determine what happens.</p>\n\n<ul><li><strong>MC with semi-set personality and customizable appearance.</strong> The choices you make throughout the story <strong>will not</strong> directly affect the MC’s core personality, but you have the power to choose how they handle the arising situations.</li><li><strong>Three (3) romanceable-for-all love interests.</strong> Turn your fake spouse with criminal tendencies into a real partner, find love under impossible circumstances with the kid of a politician, or make your babysitting co-worker worry about something entirely else than the success of your gig.</li><li>A handful of possible endings, including bad ones, all of them depending on the choices you make throughout.</li><li>Keep up the appearances with your partners in crime, all the while <em>taking care</em> of the Red Sugar Society on the down-low...</li><li>...but don’t forget to enjoy yourself, and all the finer things in life. You only get to infiltrate the rotten creme de la creme once in your life, after all.</li><li><strong>TL;DR</strong>: Fake date. Fall in love. Murder. Party. Rinse and repeat.</li></ul>\n\n<p>There are three (3) romanceable characters whose respective fates are dependant on your choices.</p>\n<p><strong>Maddox la Zar</strong> (they/them)</p>\n<p>A crime lord 'gone good'. You and Maddox go way back, having first met in high school; you weren’t their biggest fan then, and you certainly aren’t one now either, thanks to their rather obnoxious, snooty attitude towards everyone and their tendency to drag you into their odd schemes time after time.</p>\n<p><strong>Santana Vanhoudt</strong> (she/her or he/him)</p>\n<p>Deputy Mayor Vanhoudt’s child. You are first introduced to Santana via Maddox. You have your reservations towards them for reasons more than obvious, but Santana soon proves to be quite different from what you had expected from a kid of a politician, though you do think there is something more to them than meets the eye.<br/></p>\n<p><strong>Harlan Crow</strong> (he/him)</p>\n<p>Your co-worker assigned by your boss to keep an eye on you as your gig with Maddox begins. Though you’re not too familiar with him, you quickly come to notice that Harlan and Maddox seem to have a somewhat volatile relationship with each other. You just hope you won’t get caught in the crossfire.<br/></p>\n<p><strong>Game development blog</strong>: REDSUGARSOCIETY (Tumblr)</p>\n<p><strong>Reporting bugs and typos</strong>: Riotdevs (Tumblr)<br/>Direct messages are preferred, but reports via ask are also more than OK.</p><p><strong>29/8/2021</strong><br/><em>PILOT </em>published.<br/></p>", "metacritic": null, "released": "2021-08-28", "tba": false, "updated": "2021-09-08T00:21:06", "background_image": "https://media.rawg.io/media/screenshots/13a/13af5684f11faef2698e7b150c018680.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 8, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["riotdevs"], "genres": ["Action"], "publishers": [], "esrb_rating": null}