{"id": 656826, "slug": "epic-bounce-casual-arcade", "name": "Epic Bounce Casual Arcade", "name_original": "Epic Bounce Casual Arcade", "description": "<p>Are you getting bored in your free time? Will you like to play a jumping ball boredom killer game to spend quality time? How about you test reflex and skills in an amazing idle ball jump game? Whether you are a fan of ball survival games looking for some new action or you are someone who wants to test reflex and play a smooth tap tap game, this amazing game has got it all for you. You must avoid collision and do the best you can to keep the ball bouncing in the air. Your score depends upon the number of times you manage to keep the ball in the air.</p>\n<p>With this Basic physics based platformer game, you get to test reflex and experience an epic arcade style mechanics game play. As an Addictive boredom killer, this game will give you the quick game kick you need to become more active at any time of the day. From its simple and straightforward game play to exhilarating challenges, this jumping ball game is here to offer you an exciting ride!</p>\n<p>No need to trouble yourself with complex game controls! This idle ball jump game is one of the easiest yet highly addictive ball survival games you will ever play in your life. While the jumping ball is in the air, you must tap tap as fast as you can on your screen to keep the ball bouncing. Make sure that the ball stays in the air so you can avoid collision with saw-toothed obstacles present on the top and bottom of each level.</p>", "metacritic": null, "released": "2021-08-28", "tba": false, "updated": "2021-09-08T00:39:44", "background_image": "https://media.rawg.io/media/screenshots/f8b/f8b4bc73ab184dbb7eebd3138b0d7955.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["justaguyproduction"], "genres": [], "publishers": [], "esrb_rating": null}