{"id": 6568, "slug": "oddhop", "name": "Oddhop", "name_original": "Oddhop", "description": "Get rid of creatures until only one remains in this original puzzle game!<br/><br/>Think Peg Solitaire with cute creatures instead of pegs and feature-filled terrains instead of a wooden board with holes in it. Add innovative gameplay mechanics, lush graphics, charming atmosphere, and over 100 challenging puzzles and you get Oddhop!<br/><br/>Oddhop is a unique puzzle game, where each puzzle takes place on a hexagonal terrain populated by a group of creatures. The goal is to collect points by eliminating the creatures one by one until a single survivor remains. This elimination is carried out by making the creatures jump, &amp;quot;hop&amp;quot;, over other adjacent creatures. In this core gameplay, Oddhop resembles the classic Peg Solitaire. However, Oddhop utilizes a wide range of features to take the gameplay to the next level! Highlights include:<br/>• Play with three creature types of varying characteristics!<br/>• Traverse varying terrain types!<br/>• Interact with various gameplay elements including portals, cherry-picking, revolving platforms, statues and more!<br/><br/>Don&amp;#39;t let the cute appearances fool you, things can get quite tricky!<br/><br/>HOW TO PLAY:<br/>The goal is to eliminate creatures so that only one is left alive, while collecting the cherries. Tap to select a creature. Valid moves will be highlighted for you. Tap a highlighted position to jump there. Collect all the cherries by landing on them with creatures for maximum points!<br/><br/>Oddhop is the new game from MHGames, the maker of the popular Jewels games!", "metacritic": null, "released": "2016-05-12", "tba": false, "updated": "2020-12-14T19:54:52", "background_image": "https://media.rawg.io/media/screenshots/e0a/e0ae27c32ab79bb7ed1330a360e2b77c.jpeg", "website": "http://www.mhgames.org/oddhop", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 143, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["mhgames"], "genres": ["Board Games", "Puzzle"], "publishers": ["Mika Halttunen"], "esrb_rating": "Everyone 10+"}