{"id": 65697, "slug": "army-commander-city-simulator", "name": "Army Commander City Simulator", "name_original": "Army Commander City Simulator", "description": "Army Commander City Simulator<br/><br/>Army Commander City  brings the underworld of the city to life in this third person 3D action game. Rise from a foot soldier as you take on the role of a hit man, enforcer, getaway driver and more in this newest 3D crime war game. The game features loads of different action packed missions with different sub quests possible in a Chicago city that is more than 5 square miles. From taking out gangsters, diving into car chases, big street shootouts everything you like to see in a big free open world 3D crime simulation and war game. \u2028\u2028\u2028As a player you can perform a wide variety of different activities, car fighting  to assassinations like a real hit man. Earn money and respect on the streets, upgrade and buy a new arsenal of weapons in this Chicago crime city inspired crime game! <br/><br/>There are 8 different types of weapons and you can choose from that and enjoy the game in city location. This game mostly works on energy base, so be careful and use your energy in right way to finish all enemies.<br/><br/>There are total 25 levels in this Crime Army war game; you need to complete one level to go for further level of game. There are many exciting achievements and daily reward system in the game.<br/><br/>\u2028EXPLORE THE ARMY WAR: CHICAGO CITY FIGHTER<br/><br/>\u2028Army War: Chicago City Fighter3D takes place in the Crime city of Chicago for years criminal case numbers were going down in the City. But today it's time for you to show everyone who the boss is in city. Pick up your guns and start shooting down your rivals that now rule the streets of crime game.<br/><br/> \u2028ARMY WAR: CHICAGO CITY FIGHTER: CRIME GAME FEATURES\u2028\u2028<br/><br/>=&gt;  Earn money, buy different guns and vehicles<br/>\u2028=&gt;  Loads of different city mission types<br/>\u2028=&gt;  Find all hidden packages and rewards\u2028<br/>=&gt;  Epic fun crime story game\u2028<br/>=&gt;  Ride on awesome looking car and fight with enemies \u2028<br/>=&gt; Set in a 15 levels in open city world, enjoy the music, enjoy the feeling<br/>\u2028=&gt;  Realistic 3D graphics and amazing killing effects in mission\u2028<br/>=&gt;  Camera View realistic Feature in game", "metacritic": null, "released": "2017-03-24", "tba": false, "updated": "2019-10-22T13:55:01", "background_image": "https://media.rawg.io/media/screenshots/a1c/a1ce48a6c6146d5fd004d2716e2a8678_IhrAoY4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 157, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["yibi gen"], "genres": ["Action", "RPG"], "publishers": ["yibi gen"], "esrb_rating": "Mature"}