{"id": 657041, "slug": "button-city-itch", "name": "Button City (itch)", "name_original": "Button City (itch)", "description": "<p>OUT NOW</p>\n<p>🦊  Twitter<br/>🐱 Website<br/>🐰 Discord<br/>🐼 Make your own Fluffsona<br/></p>\n\n<p>Fennel is a shy little fox who just moved into town. After  discovering the local arcade, he makes new friends and gets swept up in a  whirlwind adventure to save it from being shut down at the paws of  greedy fat cat Peppermint Pepperbottom!\r\n  </p>\n<p>Button City is a colorful low poly narrative adventure game about  friendship and community. Enter a pastel diorama world inspired by 90’s  nostalgia and filled with cute characters to befriend. Complete quirky  quests around town, play arcade games, collect fun costumes, solve  puzzles and more as you follow a story about growing up and saving the  things that are important to you. <br/></p>\n\n<ul><li>Explore a beautiful and lovingly crafted world in a low poly art style.\r\n</li><li>Befriend a cast of charming animal characters.\r\n</li><li>Complete fun and silly side quests at your own pace.\r\n</li><li>Master arcade games to unlock new game modes and prize items!\r\n</li><li>Dress up in fun costumes and decorate your room.\r\n</li></ul>\n\n\n\n<p>★ <strong>Gobabots</strong> is the latest craze sweeping the arcade. Two teams of four cute fruit robots battle it out in an intergalactic competition to make the biggest smoothie! Each Gobabot has its own unique weapons and attacks -- collect them all at the arcade prize counter, form your perfect team, and become arcade champions!</p>\n<p>★ Zoom down Watermelon Mountain in tuned-up electric cars in <strong>rEVolution Racer</strong>, a pastel take on classic arcade racing games. Race as Evie in her custom EV Sprinter against her fierce rival Spin. Drift to charge your batteries then unleash extreme boosts to speed past the competition!</p>\n<p>★ <strong>Prisma Beats</strong> is a rainbow rhythm game with funky visuals and awesome tunes! Hit notes on the beat and show off your best dance moves -- and try out the challenge modes, if you’re feeling competitive</p>\n<p>JOIN OUR DISCORD COMMUNITY<br/></p>", "metacritic": null, "released": "2021-08-27", "tba": false, "updated": "2021-09-08T01:41:33", "background_image": "https://media.rawg.io/media/screenshots/89b/89bdac80379962d7b2c32491fbe1725b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 88, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Subliminal Gaming"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}