{"id": 65702, "slug": "balls-go-brick-breaker", "name": "Balls Go - Brick Breaker", "name_original": "Balls Go - Brick Breaker", "description": "Shoot the ball, break the brick! Super simple and Instantly fun!<br/><br/>Balls Go! is a perfect time killer and addictive balls game. Break bricks as many as possible. Relax your brain and just enjoy the eliminate pleasure.<br/><br/>It is very easy to play but hard to get high scores. You don't need to worry about losing balls. Just focus on shoot angle and brick break. You can make endless balls chain.If you want to get high scores, think strategically and get more powerful ballz. Deal damage to bricks and break bricks.<br/><br/>Ballz Go! is the greatest fun Brick Breaker game. Hold the screen to aim, swipe the ball to the brick and break all the bricks easily! Hundreds of stages of this balls games, the addictive gameplay is all player’s favorite.<br/><br/>[How to play]<br/>- Swipe and aim the bricks by shooting balls<br/>- Get bounce balls of each round to break bricks as many as possible<br/>- When ball hit the brick, durability of brick is reduced. When durability is 0, the brick breaks<br/>- Collect gold coins to level up new powerful balls <br/>- When the bricks reach the bottom, game is over<br/>- Challenge with your friends <br/><br/>[Game Feature of Balls Games]<br/>- Free Play and endless game play<br/>- Easy ball control Balls Games <br/>- Beautiful graphic and strong sense of rhythm<br/>- Two modes to play: challenge mode and classic mode <br/>-  Many balls and launchers to choose<br/><br/>Come to download it and enjoy this balls game. Have fun playing Ballz Go!", "metacritic": null, "released": "2017-09-07", "tba": false, "updated": "2019-10-22T14:27:05", "background_image": "https://media.rawg.io/media/screenshots/a71/a716837d56e41411a93a8e3c0a6c40be.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 59, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tingting Liu"], "genres": ["Family", "Puzzle"], "publishers": ["Tingting Liu"], "esrb_rating": "Everyone 10+"}