{"id": 657062, "slug": "a-future-in-robots", "name": "A Future in Robots", "name_original": "A Future in Robots", "description": "<p><em>This is a prototype for a puzzle game I made to try and learn the Godot engine. </em></p>\n<p><em>NOTE: This game is free of price, but I don't gaurantee it's free of defects. Most of the graphics here are just basic placeholders to make the game playable. The primary purpose of this page is just to share with friends/others to see if the primary game play idea is fun to play, or just fun to make to help me decide if I should spend more time on this project or move on to something else. I make no promises of fixing anything or adding more levels, just putting it out there to see what people think of the idea.</em><br/></p>\n\n<p>Take control of the world of nano-bots on a quantum level to etch electrical circuits before everything overheats! </p>\n<p>How to Play (pre-ALPHA 0.1)</p>\n<p>- Your mission is to make sure each of the microchips on the board are connected to at least one power source.</p>\n<p>- To do this nano-bots will be spawned on the board periodically. Each spawned nano-bot will increase the ambient heat in the environment.</p>\n<p>- If the environment gets too hot, you lose.</p>\n<p>- You will guide nano-bots using three commands: MOVE, EAT, ETCH</p>\n<p>- MOVE: Encourages a nano-bot to move to a specific location.</p>\n<p>- EAT: Encourages a nano-bot to \"eat\" a tile on the board. Eaten tiles are converted to energy. You can store a max. of 10 energy</p>\n<p>- ETCH: Builds a single wire on a tile. Connect a power source to a microchip by building a continious path of wires.</p>\n<p>-  Excess heat can be reduced with heat sinks. Heat Sinks cost 5 energy to build.</p>\n<p>- Occasionally nano-bots will malfunction. Malfunctioning nano-bots will destroy etched wire and ignore commands.</p>\n<p>- Malfunctioning nano-bots can be destroyed with turrets.</p>\n\n<p><em>NOTE: This game is free of price, but I don't gaurantee it's free of defects. I make no promises of fixing anything or adding more levels, just putting it out there to see what people think of the idea.</em></p>", "metacritic": null, "released": "2021-08-28", "tba": false, "updated": "2021-09-08T01:48:05", "background_image": "https://media.rawg.io/media/screenshots/a9a/a9ac21962e54fe5afe00a867188fbdd9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 15, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["starfox1981"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}