{"id": 657283, "slug": "landshark", "name": "Landshark", "name_original": "Landshark", "description": "<p>This game was developed using GDevelop 5 for a solo school project. We could produce any game we liked, but the grader recommended focusing on arcade-style designs, with high scores and a simple game loop.</p>\n<p>My initial ideas included incorperating a hunger system, where player health decreased persistently, incentivising taking action (which itself cost health), and having the game centre on a tactile, physics-based challenge that players would want to master. An earlier version of the design involved ammo that would need to be replenished with pick-ups, but I ultimately decided to have health be the player's \"ammo\", as it reduced the number of variables for players to keep track of, and I liked the risk/reward dynamic that came from consuming health in order to restore more health.<br/></p>\n<p>The high score table is neither online nor persistant, but all the scores on it initially are perfectly beatable. The difficulty level increases with the number of balloons popped, but only up to a certain level. The game has no \"kill screen\" (a point where it becomes unfeasible for a human to play beyond), so there shouldn't be any scoring ceiling for a player skilled and patient enough.<br/></p>\n<p>Have fun :)</p>\n<p>Note: now supports Xbox, PS4 and PS3 controller input.</p>\n<p>Keyboard Controls: A/D - Move Left/Right, W/S or K/L - Aim Cannon Up/Down, Space - Fire Cannon, P - Pause, O - Unpause, Q - Quit When Paused<br/></p>\n<p>Xbox Controls: Left Stick - Move Left/Right, Right Stick - Aim Cannon Up/Down, A/LT/RT - Fire Cannon, Start - Pause, Y - Unpause, Back - Quit When Paused</p>\n<p>PS4 and PS3 Controls: Left Stick - Move Left/Right, Right Stick - Aim Cannon Up/Down, Cross/L2/R2 - Fire Cannon, Options/Start - Pause, Triangle - Unpause, Share/Select- Quit When Paused<br/></p>", "metacritic": null, "released": "2021-08-27", "tba": false, "updated": "2021-09-08T02:53:08", "background_image": "https://media.rawg.io/media/screenshots/513/513f559e1eb0020cdec0410c97b93c61.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Beth A"], "genres": ["Action"], "publishers": [], "esrb_rating": null}