{"id": 657491, "slug": "bloodlust-curse", "name": "Bloodlust Curse", "name_original": "Bloodlust Curse", "description": "<p>Step into the shadow of the hell house! You're back at Transylvania on business!<br/>After defeating Dracula and destroying Castlevania, Simon Belmont decided to rest the whip.<br/>As time passed, he became sick from an unknown illness that no one knew how to cure.<br/>But... one day, while visiting the grave of his family on the Hill of Angels, a woman appeared out of the morning mist, and told him that he, and by extension, all of Transylvania, were cursed by Dracula, for his bodily parts were scattered all over the land, still carrying his influence and evil presence over this plane. The only way to fix this is gather the parts in an altar at the Castle ruins, bring Dracula back, to then have a final showdown with the Count.<br/><br/>Simon decides to take the whip back into action, and travel through the countryside, to put an end to the curse, once and for all.<br/>He's not alone, as he has his two best friends along for this journey: Agnes, a very capable healer sent by the church, and Vincent, his arch-rival vampire hunter.<br/><br/>______________________________<br/>This is a castlevania 2 expanded remake.<br/><br/>+ choose your own path: multiple choices, and 16 possible outcomes can be achieved(done)<br/>+ castlevania 1 mini-game: called \"Dracula's memory\", a randomized version of CV1 can be played and rewards can be obtained. No playthrough will be the same(Done)<br/>+ side-quests based on real Transylvania lore(unfinished)<br/><br/>- graphics by Thaddeus / Wilker<br/>- music by optomon<br/>- engine by Obivanhelgen</p>", "metacritic": null, "released": "2021-08-27", "tba": false, "updated": "2021-09-08T03:43:59", "background_image": "https://media.rawg.io/media/screenshots/7ee/7eed85f91e867a7d1a989be70d13fd12.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 177, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Richterwilker"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}