{"id": 657502, "slug": "double-bubble-mancos-edition", "name": "Double Bubble (Mancos' edition)", "name_original": "Double Bubble (Mancos' edition)", "description": "<p>Dou and Bub are naughty bubbles, always getting into trouble, but this time, the thing was complicated. You control Dou and must guide Bub to the exit of each level. Bear in mind that Bub moves slower than Dou. If you get pass all 25 levels that make up the game you can escape your so yearned atmosphere.</p>\n<p>Beware of spikes, enemies and other dangers lurking.</p>\n<p>Each level has limited time, but you can expand it by collecting the clocks that appear on stage.</p>\n<p>Good luck!</p>\n<p>Controls:</p>\n<p>O - Left</p>\n<p>P - Right</p>\n<p>Q - Top</p>\n<p>The game can be executed both 48k and 128k.</p>\n<p>Credits:</p>\n<p>Design, implementation and music. Miguetelo. Miguel Ángel Tejedor López</p>\n<p>Made: March, April and May 2016</p>\n<p>Loading Screen: Rui Martins</p>\n<p>AGD made with Jonathan Cauldwell</p>\n<p>Thanks to all who keep the Spectrum scene alive.</p>\n<p>Legal:</p>\n<p>You may not distribute commercially this game without the author's consent.</p>\n\n<p>/////////////////////////////////////////////////////////////////////////</p>\n<p>DOUBLE BUBBLE</p>\n<p>Argumento:</p>\n<p>Dou y Bub son unas burbujas traviesas, siempre metiéndose en líos, pero esta vez la cosa se ha puesto complicada. Controlas a Dou y debes guiar a Bub a la salida de cada nivel. Debes tener en cuenta que Bub se desplaza a una velocidad inferior a la de Dou. Cuando consigáis superar los 25 niveles que componen el juego podréis escapar a vuestra tan añorada atmósfera.</p>\n<p>Ten cuidado con los pinchos, los enemigos que acechan y demás peligros.</p>\n<p>El tiempo por pantalla es limitado, pero podrás ampliarlo recogiendo relojes que aparecen en el escenario.</p>\n<p>!Buena suerte!</p>\n<p>Controles:</p>\n<p>O - Izquierda</p>\n<p>P - Derecha</p>\n<p>Q - Arriba</p>\n<p>El juego puede ser ejecutado tanto en 48k como en 128k.</p>\n<p>Créditos:</p>\n<p>Diseño, realización y música de Miguetelo. Miguel Ángel Tejedor López</p>\n<p>Realizado durante marzo, abril y mayo de 2016</p>\n<p>Pantalla de carga: Rui Martins</p>\n<p>Realizado con AGD de Jonathan Cauldwell</p>\n<p>Gracias a todos los que mantienen la escena del Spectrum viva.</p>\n<p>Legal:</p>\n<p>Está prohibido distribuir este juego de manera comercial sin el consentimiento del autor.</p>", "metacritic": null, "released": "2021-08-27", "tba": false, "updated": "2021-09-08T03:46:51", "background_image": "https://media.rawg.io/media/screenshots/8ef/8efd3413eb765ac5cf9d5ff0400b58df.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 116, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Miguetelo"], "genres": ["Action"], "publishers": [], "esrb_rating": null}