{"id": 657782, "slug": "dissensus", "name": "Dissensus", "name_original": "Dissensus", "description": "<p>Produced as part of an art exhibition asking for prototype monuments that might better respond to our current moment, Dissensus is a sketch for a hypothetical app. The imagined app would use geo-fencing to send text messages to users' phones about things other users wish to memorialize throughout the city—whether moments of trauma, joy, human connection, or alienation. Users would have no preexisting knowledge about what areas had been demarcated in this way, and would simply happen upon them. Each text message sent would include a question from the sender in the hopes that it might stick with the reader and be reassessed over time.\r\n </p>\n<p>In this Bitsy game, I endeavor to recreate this experience of wandering through a city haunted by the digitally delivered memories of its inhabitants. Featured writing by deSolid State, Myra Lilith Day, anonymous, and Tabitha Nikolai. This piece was commissioned as part of Converge 45's Portland Monuments and Memorials Project. You can read the full exhibition statement below:\r\n </p>\n<p>###<br/></p>\n<p>The way cities are constructed and maintained marginalizes different people in a variety of ways—genocide, redlining, displacement, criminalization, nimbyism, ableist design, gendered spaces, to name only a few. In consideration of this I propose a hypothetical smartphone app in which users would be divided into two anonymized roles: Questioners, and Recipients. Questioners would be selected by invitation-only in collaboration with community partners who address related challenges. The role of Recipient would be open to anyone who installed the app. The app would use a technology called geofencing—the digital demarcation of physical space using GPS. Questioners would select places in the city of personal significance and compose a note giving context about the place and their experience in it. Notes can be narrative, concrete, or poetic, but regardless of style the note would include a question for the Recipient. Recipients have no foreknowledge of what locations have been demarcated by Questioners, they merely receive the corresponding notes via text message if/when they cross into those areas. No communication from the Recipients to the Questioners is possible on the app, the questions are for Recipients to reflect or act on independently.</p>\n<p>The intent is, in part, to create a geographic digital surface for people alienated by the city to inscribe themselves upon, and to make requests—rhetorical or specific—of other inhabitants. But further, it provides a way for people to gain a deeper understanding of different emotional realities through their ties to place as something both shared, but often experienced quite differently. My hope is that this spatial specificity allows for a more grounded, and curious experience than conventional or social media tend to provide, and a more engaged and immediate experience than traditional monuments tend to provide.</p>\n<p>I believe that asking questions as a tool toward this end is especially useful. Monuments conventionally function as declarative statements, whether critical or affirmative, about specific individuals, places, events, or narratives. The intent is generally to be unambiguous, and I believe these kinds of declarations (when not outright oppressively weaponized) are often easily consumed, supposedly internalized, and disregarded. Questions, on the other hand, have the capacity to be stickier by implicating the listener, pulling them out of the supposed distance of history, and into the present with some request, whether literal or cognitive, on behalf of the Questioner. And if the question is sticky enough they have the capacity to stay with us through time, and be reassessed—questions push individual curiosity into the present, where monumental declarations rest events in the past. Curiosity is necessary to extend education beyond the limited container of a physical monument itself. To this end, the project eschews specific topicality to preserve the autonomy of the Questioner and place the burden of parsing ambiguity on the Recipient, rather than giving them something they can place in a preconceived box. </p>\n<p>I lack the technical ability and resources to produce this app myself, so what I present here is a sketch meant to encompass something of its psychological landscape. Dissensus is a short videogame produced using a tool called Bitsy. In this game you navigate a version of Portland and experience hidden notes and questions of the type described. They are written by myself and collaborators—moments of our ephemeral trauma, alienation, joy, and human connection akin to countless others that go without recognition or collective understanding.</p>", "metacritic": null, "released": "2021-08-27", "tba": false, "updated": "2021-09-08T05:05:31", "background_image": "https://media.rawg.io/media/screenshots/648/648d30e5db57f300f3d59308e2918d9b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 45, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Tabitha Nikolai"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}