{"id": 65797, "slug": "hello-kitty-jewel-town", "name": "Hello Kitty Jewel Town!", "name_original": "Hello Kitty Jewel Town!", "description": "Sanrio Digital presents to you Hello Kitty Jewel Town! Nail the puzzle puzzle with style for Free!<br/><br/>Join Hello Kitty and her friends, My Melody, Pochacco, Bad Badtz-Maru, Pompompurin, Keroppi, Dear Daniel, and Little Twin Stars, on a journey to match jewel and solve match-3 puzzles! The world’s cutest British girl, Hello Kitty will be with you! Be prepared with your lunchbox and stay tuned with your journey in the Hello Kitty World!<br/><br/>**EXCITING GEM PUZZLE ACTION**<br/>Match-3 to earn points for each matching set of jewels paired - the longer the combo, the bigger the score! Don't forget to use your special boosters in case you get stuck! Hello Kitty will give you one at the beginning to make sure you will have your journey safe! You can nail it with your skills and boosters!<br/><br/>**ACQUIRE TONS OF COLLECTIBLES**<br/>Dress up your room with fabulous decor - your friends will love it when they visit your house in-game! We have over 250 Sanrio themed collectibles await you to collect. Cute Hello Kitty will be appeared in various forms to be with you! You are able to dress up your room to be a Hello Kitty Nail Salon, to be a Hello Kitty Cafe, or to be a Hello Kitty Restaurant!  Decorate with various adornments in different themes, Carnival, Festival, Fun Park, Christmas, Collage, Pink, Coloring, Magical, you name it!<br/><br/>**DECORATE AND SHARE WITH YOUR FRIENDS**<br/>Build your home from scratch with Hello Kitty in iMessage! Free stickers inside!<br/>Send a Message to HelloKitty JewelTown: hellokitty.sanriodigital@gmail.com<br/><br/>Features:<br/>- Join Hello Kitty and friends in a new adventure!<br/>- Exciting match-three puzzle gameplay!<br/>- Over 300 levels<br/>- Decorate your home with cute Sanrio themed furniture<br/><br/>Become a fan! Stay up to date on our latest news.<br/>If you like us, 'Like' us on Facebook: https://www.facebook.com/HelloKittyJewelTown<br/>Support: http://m.me/hellokittyjeweltown<br/><br/>Hello Kitty Jewel Town is a fun application for kids allowing them to entertained! Test your skills with the Kitty matching game or play fun puzzles for Free!", "metacritic": null, "released": "2014-11-25", "tba": false, "updated": "2023-03-02T20:37:45", "background_image": "https://media.rawg.io/media/screenshots/5c0/5c015860fd5090d022fa06efd945ed53.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 47, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Sanrio Digital Europe"], "genres": ["Strategy", "Simulation"], "publishers": ["Sanrio Digital Europe"], "esrb_rating": null}