{"id": 657915, "slug": "nuevas-reglas-de-dano-y-absorcion-para-dungeon-hac", "name": "Nuevas reglas de Daño y Absorción para Dungeon Hack", "name_original": "Nuevas reglas de Daño y Absorción para Dungeon Hack", "description": "<p>Estas <strong>Nuevas Reglas de Daño y Absorción para Dungeon Hack </strong>beben, directamente, de los valores de D&amp;D Clásico (hasta un +3) por lo que las matemáticas (malditas matemáticas) parece que están bien calculadas. A los aficionados a esa maravilla de universo rolero que es el juego <strong><em>Warhammer Fantasy RPG</em> </strong>también les resultará familiar los valores de absorción fijos de las armaduras. Uno, que le gusta mezclar cosas en la batidora del <strong>OSR.</strong><br/></p>\n<p> Espero que os guste este pequeño entremés, fácilmente adaptable a tus personajes de <strong>Dungeon Hack</strong>, y que sigáis disfrutando de nuestra compañía en este año rolero que termina de empezar.</p>\n<p><em>Nuevas reglas de Daño y Absorción es una ayuda de juego de Jesús “Capitán Mordigan” del Arco, maquetada por Luis Gimeno y bajo licencia Creative Commons Atribución</em><em>-NoComercial-CompartirIgual 4.0 para Dungeon Hack, de Carlos Julián del Cerro, bajo licencia OGL. La ilustración es un grabado en madera de E. E. Viollet le Duc, reconocida como Public Domain.  ¿Qué quiere decir que sea licencia Creative Commons BY-NC-SA? ¡Que puedes hacer con este material lo que quieras! Incluso publicar tu propia variación (siempre y cuando lo hagas bajo la misma licencia, con fines no comerciales y atribuyendo la autoría de la fuente principal, que es de bien nacidos el ser agradecido).</em></p>", "metacritic": null, "released": "2021-08-26", "tba": false, "updated": "2021-09-08T05:41:30", "background_image": "https://media.rawg.io/media/screenshots/d34/d345f517c9fd1080723de8965e6d6adc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Los Pergaminos del Fénix"], "genres": [], "publishers": [], "esrb_rating": null}