{"id": 657989, "slug": "u-1536", "name": "U-1536", "name_original": "U-1536", "description": "<p>Created for the HSPS1 Summer of Shivers Game Jam</p>\n<p>Made with Unity 5.65 Personal Edition.</p>\n<p>Cinematics and pre-rendered backgrounds created in Blender 2.72</p>\n<p><strong>Story</strong><br/></p>\n<p>It's been 76 years since the disappearance of Germany's sole production example of the Type-31 U-Boat, an experimental prototype about which little is known, but has encompassed rumors of supposedly being powered by revolutionary breakthroughs in Dark Matter technology.</p>\n<p>After decades in which the submarine traversed dimensional rifts, U-1536 has inexplicably rematerialized in the shallow coastlines upon the North Sea, with irregularities in the U-Boat's damaged reactor facilitating unexplained electromagnetic phenomena which has perpetrated bizarre disappearances upon maritime and air traffic in the vicinity.</p>\n<p>As one with a particular fascination in the rapidly unfolding events at hand, freelance oceanographer/mercenary Thuy Moc has elected to infiltrate the sub's interior with hopes of ascertaining some answers for herself. </p>\n<p>Before long, she'll discover a host of bizarre phenomenon, including a peculiar breed of interdimensional monsters which materialize out of nowhere and attack on site, while the surviving crew members have aged only a few days within the space of several decades.</p>\n<p><strong>Gameplay</strong><br/></p>\n<p>Per the creative aesthetic of the first Resident Evil game, U-1536 employs combat and exploration with low-polygonal 3-D characters superimposed on top of pre-rendered backgrounds.</p>\n<p>Mechanics will involve combat and exploration, with a few rudimentary puzzles thrown into the mix.</p>\n<p><strong>Controls</strong></p>\r\narrow keysmovementshiftrunZattackX\"finishing move\"E/spacebarinteract/examineescapepause gameIinventory\r\n\n<p>*Update:  I've re-uploaded the game with the opening movie reconfigured in MP4 as opposed to  MPG format, because, for some reason, the opening cinematic was not displaying on some people's computers. </p>", "metacritic": null, "released": "2021-08-26", "tba": false, "updated": "2021-09-08T06:03:01", "background_image": "https://media.rawg.io/media/screenshots/bfb/bfb0f669577d9a0719032fcdae3445cf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 346, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jesse Hamm"], "genres": ["Action"], "publishers": [], "esrb_rating": null}