{"id": 6580, "slug": "crimson-steam-pirates", "name": "Crimson: Steam Pirates", "name_original": "Crimson: Steam Pirates", "description": "In Crimson: Steam Pirates, plumes of black smoke fill the blue Caribbean sky as Thomas Blood’s pirate fleet steams ahead—over, above, and below the waves. On the surface, ships bristle with swivel cannons and lightning guns. Above, zeppelins drip with incendiary bombs. And below, silent and deadly, submarines stalk their targets, torpedoes at the ready.<br/> <br/>Command your fleet and your Steampunk crew using an elegant action interface. Crimson: Steam Pirate’s turn-based gameplay provides an addicting mixture of strategy and action as you anticipate your enemies’ moves and counter them, luring them into a deadly hail of weapons fire while uncovering the mystery brewing in the Caribbean.<br/> <br/>Crimson: Steam Pirates features:<br/> <br/>•         8 free-to-play voyages begin the tale of Thomas Blood’s adventures in the Caribbean<br/>•         Chapters 2 &amp;amp; 3 feature a total of 16 additional voyages that complete the tale, available as in-app purchases<br/>•         2 “Pass-and-Play” multiplayer scenarios<br/>•         Over a dozen types of ships, subs, and airships<br/>•         Over 20 unique crew members whose special abilities enhance gameplay<br/> <br/>Presented by Bungie Aerospace and conceived by the mind of Harebrained Schemes&amp;#39; Jordan Weisman, creator of the MechWarrior, Crimson Skies, and Shadowrun universes.", "metacritic": null, "released": "2011-09-01", "tba": false, "updated": "2019-10-22T14:28:59", "background_image": "https://media.rawg.io/media/screenshots/a92/a9289c962951cfa83ef5a3ee4a64cfea.jpeg", "website": "http://www.bungie.net/projects/aerospace/crimson/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 201, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Bungie Aerospace"], "genres": ["Strategy"], "publishers": ["Bungie Aerospace"], "esrb_rating": "Teen"}