{"id": 658193, "slug": "gatling-guy-2019-ims-213-final-project", "name": "Gatling Guy (2019) - IMS 213 Final Project", "name_original": "Gatling Guy (2019) - IMS 213 Final Project", "description": "Story and Controls\r\n<p>In this game you play as a Gatling Pea from Plants Vs. Zombies, venturing off on his own. He has ended up in the sky among platforms, blocks and Zombies. However, his friends, the Sunflowers, have offered to help him if he carries them with him. Upon touching one, they cloak him in a shining glare that allows him to move faster and take no damage! This is the adventure of Gatling Guy.</p>\n<p><strong>WASD - Move</strong></p>\n<p><strong>Mouse - Aim</strong></p>\n<p><strong>Left Click - Shoot</strong></p>\n<p><strong>C - Save, E - Load, Enter - Reload the current room</strong></p>\r\nLoading with no manual save will cause a crash, and you'll have to click Abort\r\n<p>There are more controls but they are listed in the game.</p>\r\nBackground\r\n<p>We learned and used Game Maker for creating these games. We made a movement game (which I never made an executable file for, sadly), a Fighting game (a Street Fighter knockoff), a Plants Vs. Zombies knockoff, and then a final project (this upload).</p>\n<p>I started playing around and adding a bunch of unnecessary \"Cheats\" to the game to make it much more fun. Hope you enjoy finding and using them all!</p>\r\nGoals\r\n<p>I made this game in IMS 213: Intro to Game Development. We were given a list of Basic and Advanced Goals to try to get working in the game. The amount we had determined what grade we received. The ones I chose are listed below:</p>\n<p>Basic Goals</p>\n<ol><li>You have created a tile-based side-scrolling game in which a character walks from left to right on-screen jumping on top and over obstacles. (Side-scrolling implies that you use a camera system.)</li><li>There are enemies that walk around on tiles of the same height, but they never fall off the edge. If they reach the edge the turn and walk in the other direction.</li><li>Whenever there is an uninterrupted straight line between the enemies and the player, they will shoot a bullet towards the player. If a bullet hits the player, the player loses.</li><li>You control the game with WASD and the mouse. Space bar will let you jump. Pressing space bar twice will let you double jump.</li><li>The player has a walking, jump and idle animation, and will always face the mouse pointer.</li><li>When you left click the mouse, you will shoot a bullet towards the mouse pointer. If a bullet hits an enemy more than once, the enemy dies.</li><li>If the player presses the B button, the character will become invincible and no longer take damage. If the player presses the B button again, the character will become vulnerable again.</li><li>There are signposts in the level. Pressing up while being near to one shows a funny message.</li></ol>\n<p>Advanced Goals\r\n</p>\n<ol><li>Pressing shift will make the player run faster, but jumping is not influenced.</li><li>The zombies from plants vs zombies are in the game. The first time they are hit, their head falls off. The second time they are hit, they die.</li><li>The final level is a single room that fits entirely in the screen. You fight a randomly moving Voltorb that kills you on contact. If you hit it 5 times, it dies. Pressing the N button teleports the player to this scene automatically.</li><li>By pressing down, the player becomes semi-transparent and enemy fire no longer hurts.</li><li>There is a flying enemy that does not fly through tiles. It drops a bomb when it is close to the player, and this bomb will kill the player when it hits.</li><li>There are sunflowers from Plants vs Zombies throughout the level. Walking into one makes it disappear and change the graphics of the player character for 5 seconds. During this time, running into enemies will kill them.</li><li>The game has 3 or more levels. After dying (or when closing the game and opening the game again), the player can continue in the last level that he was playing.</li></ol>", "metacritic": null, "released": "2021-08-25", "tba": false, "updated": "2021-09-08T07:00:31", "background_image": "https://media.rawg.io/media/screenshots/66e/66ea3b016e9de732b2a4238886b48a7f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 11, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Adam Larson"], "genres": ["Shooter", "Platformer"], "publishers": [], "esrb_rating": null}