{"id": 658437, "slug": "re-mind-2", "name": "RE: mind", "name_original": "RE: mind", "description": "<p>Hola! Espero que te encuentre muy bien, muchas gracias por elegir nuestro juego! Deseo que te encuentres con más de lo que esperabas, pero sobre todo, espero que te diviertas. Este juego fue hecho por el equipo \"Los perros mamados\" (Si, lo que leíste, así se llama nuestro grupo jaja), el cual esta integrado por  Enid Reyes, David Suarez, Yurie Romero , Ezequiel Ruiz Pacios y Malena Calatayu. En esta oportunidad, la temática de la GameJam era \"Navegando en Aguas desconocidas\" y a lo que llegamos fue este juego, en el cual queremos mostrar lo previo hacia ese destino desconocido, que es lo que viene después de la muerte. En términos generales, la muerte es considerada un tema tabú y regularmente asociada a un aspecto negativo, cuando (entre muchas comillas) es parte de la vida misma. Espero que este juego ayude a ampliar un poco el espectro de lo que hoy se considera la muerte.  Nuevamente, te agradezco por haber jugado, y paso a dejar comentarios del equipo. Saludos!</p>\n<p><strong>                                                                                                                                   -El perro mamado</strong></p>\r\n-Zaira Enid Martínez Reyes | Fondos , diseño de personaje|\r\n<p> Me siento muy feliz y muy agradecida de ser parte de este proyecto. La verdad me siento muy afortunada  de estar en un equipo tan pero tan talentoso además de súper lindo en donde hubo click desde un inicio y el simple hecho de poder ser parte de él, me enriqueció me hizo tener la confianza  y creer en mí además de motivarme a seguir adelante , solo me queda decir ”gracias” y sobre todo gracias por la diversión y las risas que no podían faltar muajajjajajaajajaj, espero que lo disfruten y le den mucho amor.  Fighting!<br/></p>\n<p>https://www.instagram.com/artofenid/  @artofenid\r\n</p>\r\n-Malena Calatayu | Narrativa y Sonido | \r\n\r\n<p>Como primera experiencia, considero que fue un éxito total , tanto en términos del producto final como el desarrollo del mismo. Me encontré con un equipo donde no solo me divertí , sino que aprendí un montón de cada uno de ellos y en sus respectivas áreas. Espero haber dejado mi marca personal en el juego, como también en algún jugador que decida probarlo.\r\n</p>\n<p>Muchas gracias a Women Game Jam y a mi equipo, que considero lo más valioso de esta bella aventura. \r\n</p>\n<p>malenavalentinacalatayu@hotmail.com / @male.val3 - Instagram</p>\r\n-Yurie Romero | Diseño de props y elementos gráficos generales | Animación de personaje |\r\n\r\n<p>Disfruté mucho esta experiencia que me llevo como un recuerdo maravilloso, ya que en el trayecto de este proyecto, el trabajo en equipo cambió su concepto para mí, pues se volvió una forma más de enfocarnos en expresarnos a quienes queríamos dirigirnos con nuestro trabajo, haciéndolo interesante, apasionante y por supuesto divertido, donde además, siempre se podía mantener la confianza en un gran equipo de trabajo que se comprometía con ello, compartiendo al mismo nivel sus propias expectativas, sueños y metas, así que, quedo agradecida con ellos, con cada oportunidad que nos trajo hasta este lindo momento y espero que así como nosotros, todos disfruten este juego que nos da tanta felicidad presentarles.\r\n</p>\n<p>yurie.raven@gmail.com | @yurie.art - Instagram </p>\r\n -Ezequiel Ruiz Pacios | Programación|\r\n<p> Otra Jam a la cual debo estar agradecido por tener un excelente ambiente y grupo de trabajo. Objetivos personales logrados. Me agradó la forma en la que el proyecto iba creciendo y completándose.</p>\r\n -David Andrés Suárez | Programación de Gameplay y UI|creacion de efectos|\r\n<p>¡Fue una experiencia única!, conocer gente cariñosa y talentosa de Argentina y Mexico fue lo que más motivo para trabajarle más horas a este proyecto!! Disfrutamos mucho en las llamadas de ideación e incluso nos reímos en la implementación en Unity. Sin duda volvería a trabajar con mi equipo, pero espero el siguiente juego no sea tan triste.\r\n</p>\n<p>das4224@hotmail.com | @dasfried - Instagram</p>", "metacritic": null, "released": "2021-08-25", "tba": false, "updated": "2021-09-08T08:10:50", "background_image": "https://media.rawg.io/media/screenshots/c4c/c4c4b4e2080662e18ffdafadca69e7ed.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 165, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Restiur1", "Rina", "Yuriev", "zaieni", "David S."], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}