{"id": 65899, "slug": "tank-simulator-2016-blocky-tanki-racing-battle", "name": "Tank Simulator 2016 | Blocky Tanki Racing Battle", "name_original": "Tank Simulator 2016 | Blocky Tanki Racing Battle", "description": "Russia is on red alert, several insurgent army units are destroying the country. Their objective is to achieve an seizure of power. You've finagle your way to get a tank to face them, keep the peace and stop the destruction of the whole city.<br/><br/>Be careful! The rebels now are aware that you have a tank, and that you know what to do with it. They won't hesitate to attack you from side to side. They will shoot you, throw bombs, and they will even try to drive over you! They won't let you escape easily.<br/><br/>Choose your tank and stand in front of your battalion to liberate the city, dominate the battle to be the fastest, and become Russia's hero.<br/><br/>Enjoy a new adventure with pixel graphics style, retro tanks, and a war atmosphere of the real soviet style. Do not stop running until the city is safe and the peace is back!<br/><br/>Attack other tanks, dodge them and destroy the betrayers! To win this battle you need all your skills, abilities, and speed, because only the fastest survive.<br/><br/>Can you get through this battle? In this race you do not fight for a trophy, you run for the salvation of a whole nation!<br/><br/>Soldier, Russia is in your hands, save us from the terrorists tanks and become our hero!<br/><br/>What are you waiting for? The destruction has already begun!<br/><br/><br/>Follow us on Twitter: @LabCave<br/>Like us on Facebook: www.facebook.com/LabCaveGames", "metacritic": null, "released": "2016-04-13", "tba": false, "updated": "2019-07-29T08:13:35", "background_image": "https://media.rawg.io/media/screenshots/eb3/eb3c29d4eeda6967e06265bdab841768.jpg", "website": "http://labcavegames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 218, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Lab Cave Apps"], "genres": ["Simulation", "Racing"], "publishers": ["Lab Cave Apps"], "esrb_rating": null}