{"id": 6589, "slug": "wisp-eiras-tale-a-casual-and-relaxing-indie-puzzle", "name": "Wisp: Eira's tale - A casual and relaxing indie puzzle game inspired by nordic and celtic mythology", "name_original": "Wisp: Eira's tale - A casual and relaxing indie puzzle game inspired by nordic and celtic mythology", "description": "Wisp: Eira’s Tale is going FREE, read the reasons why at the bottom of the description.<br/><br/>Guide Eira the fairy through the fantastic fun, rich, and relaxing world of forests, you must help her to find her way back home. <br/><br/>On the way back home Eira the beautiful fairy finds out that the dragon Fáfnir has returned to the forest to do everything in his power to stop Eira from ever returning home. Lost and surrounded by evil, Eira has to avoid being consumed while solving the mysteries ahead. With Fáfnir&amp;#39;s corrupted blood he tries to destroy the forest and Eira&amp;#39;s way home.<br/><br/>Your mission is to help Eira on her Adventure.<br/><br/>In your adventure you will find 3 different magic elements fire, ice &amp;amp; stone to help you through your adventure to overcome the obstacles.<br/><br/>Your mission will be to avoid the corrupted blood fired by the evil dragon of the forest. Avoid the danger that might wait for you around the corners. Lost and surrounded by the evil force of Fáfnir you’re the only one who can help Eira to avoid being consumed while solving the mysteries ahead. <br/><br/>Features:<br/><br/>•3 different worlds with 10 levels each.<br/>•Soothing gameplay like you haven&amp;#39;t seen before.<br/>•Award winning soundtrack.<br/><br/>This game is suitable for all ages, from young kids (girls and boys alike) to older gamers with its soothing, relaxing puzzle gameplay everyone can enjoy playing Wisp: Eira’s tale and help guide Eira on her adventure through the magical and mysterious fairy forest. <br/><br/>Follow us on Twitter and Facebook<br/>http://twitter.com/triolith<br/>http://www.facebook.com/TriolithEntertainment<br/><br/>The soundtrack of Wisp is available for FREE on SoundCloud!<br/>http://soundcloud.com/triolithentertainment/sets/wisp-ost<br/><br/>-=:{REVIEWS}:=-<br/>TOUCHARCADE.COM<br/>&amp;quot;This game is suitable for those who enjoy chillaxing with a<br/>graphically-appealing game, with tilt controls and no emphasis<br/>on score or best times.&amp;quot;<br/><br/>148APPS.COM<br/>&amp;quot;A beautiful platformer with delicate touch controls, Wisp is a magical puzzle waiting to be solved.&amp;quot;<br/><br/>APPADVICE.COM<br/>&amp;quot;If you like soothing, low pressure games with unlimited time, then you will definitely want to check out Wisp: Eiraís Tale.&amp;quot;<br/><br/>TESTED.COM<br/>&amp;quot;Wisp definitely gets our seal of approval.&amp;quot;<br/><br/>Toucharcade comments &amp;quot;Yeah, this is one Hell of a game. It&amp;#39;s like Dark Nebula and Lander had a child.&amp;quot;, &amp;quot;I&amp;#39;m loving Wisp so far, it&amp;#39;s every bit as gorgeous as it is fun to play.&amp;quot; Wisp: Eira&amp;#39;s tale has over over 100 000 downloads on all versions. <br/><br/>It’s fairy puzzle solving fun!<br/><br/>***Why is wisp going FREE?***<br/>First of i would like to thank those of you who have supported us and bought Wisp and we are grateful for your support! <br/><br/>However Wisp was first released in 2011 and is quite old at the moment, because of this we no longer make many sales. At the moment Triolith Entertainment has a shortage of funds and we need to start generate more revenue and ad’s is at the moment our best option. Due to this I had the option to either make Wisp free and ad ads or start to thinking about closing down the business and remove the games (but I prefer to keep the games alive). So this is the reason, and to any old customers that doesn&amp;#39;t like the ads I am sorry but it was a necessary evil, I’ll see what we can do to limit ads you see.", "metacritic": null, "released": "2011-06-15", "tba": false, "updated": "2019-10-22T14:28:59", "background_image": "https://media.rawg.io/media/screenshots/6d5/6d5bc68eff8711f0c9e347f3b202e8ba.jpeg", "website": "http://www.triolith.com/games/wisp/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 170, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Triolith Entertainment"], "genres": ["Adventure", "Puzzle"], "publishers": ["Triolith Entertainment"], "esrb_rating": "Everyone 10+"}