{"id": 65902, "slug": "steel-robots-2-war-robot-fighting-game-vs-tanks", "name": "Steel Robots 2 . War Robot Fighting Game vs Tanks", "name_original": "Steel Robots 2 . War Robot Fighting Game vs Tanks", "description": "The futuristic war between robots and combat tanks seems to have no end! <br/>On one side, we have the human war tanks trying to resist against the robot invasion. On the other side, we have ultimate robots with artificial intelligence trying to break the combat tank barrier and reach the human military basement. It is a matter of time for the robots to win the war... Or may be not! Human resistance is incredible! Fight by the side of the robots trying to make your way out of the human tank barrier and survive in this amazing game full of action!<br/><br/>Enjoy fighting with the robot of the future against combat tanks trying to destroy in this war to the death!<br/><br/>- Choose a robot to fight with and help him to survive to each tank attack!<br/>- Make your way out in a survival race for a better tomorrow for the robots!<br/>- Learn to avoid every enemy by dodging tanks at full speed!<br/>- Easy mobile controls which make it easier to play and immerse yourself in this awesome war game!<br/>- Intuitive game rules: This funny game is easy to play but hard to master!<br/>- Share your highest scores of these robots and tanks games with your friends on Facebook, Twitter and Google+!<br/><br/>Are you ready to enjoy this futuristic war simulator?<br/><br/>Twitter: @LabCave<br/>Facebook: www.facebook.com/LabCaveGames", "metacritic": null, "released": "2017-03-08", "tba": false, "updated": "2019-07-29T08:11:31", "background_image": "https://media.rawg.io/media/screenshots/0e0/0e029b382efdf4e245be7a0fdc8528e2.jpg", "website": "http://labcavegames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 300, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Lab Cave Apps"], "genres": ["Action", "Simulation"], "publishers": ["Lab Cave Apps"], "esrb_rating": null}