{"id": 65908, "slug": "super-runner-pixel-surfer", "name": "Super Runner - Pixel Surfer", "name_original": "Super Runner - Pixel Surfer", "description": "Run away as fast as you can!<br/>Dodge the crumbling blocks!<br/><br/>You've stolen the mystic cube from the pixel pyramid. Strange things are happening! Blocks are crumbling and coming at you! <br/><br/>Now you have to run away for your life!  Escape from the crumbling block world! Watch out!<br/><br/>HOW TO PLAY:<br/>1.\tTilt your phone or tablet left, right, forward or backward.<br/>2.\tDodge the blocks and bricks; Pick up the power-ups.<br/>3.\tDash as fast as you can; Run away as far as you can. SCORE to win!<br/>4.\tUse power ups to make it more fun!<br/><br/>FEATURES: <br/>1.\tBest pixel style running game!<br/>2.\tExciting BGM &amp; sound effects. Get heart beating and palm sweating!<br/>3.\tSurvive Earthquake, Upside Down and other events!<br/>4.\tFree to play<br/>5.\tEndless gameplay<br/>6.\tSimple control<br/>7.\tVarious power ups such as Slow Down, Immunity, Magnet, etc.<br/><br/>Tilt your phone left or right to direct you through the blocks! Tilt your phone forward or backward to accelerate or slow down!<br/><br/>Tilt to turn, accelerate or slow down to avoid obstacles, collect power ups, unlock new characters, and see how far you can run!<br/><br/>Test your reflexes, as you race amongst the bulging and engulfing blocks. Help yourself escape from the gloomy blocks jungle, earthquake, and upside down space twist!", "metacritic": null, "released": "2017-11-22", "tba": false, "updated": "2019-07-29T10:46:37", "background_image": "https://media.rawg.io/media/screenshots/e87/e87f3f73a7d151f4cfd5624479a67584.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 59, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Haishan Li"], "genres": ["Racing", "Arcade", "Casual"], "publishers": ["Haishan Li"], "esrb_rating": null}