{"id": 659105, "slug": "prehistoric-enchantment", "name": "Prehistoric Enchantment", "name_original": "Prehistoric Enchantment", "description": "<p><strong>Prehistoric Enchantment - Gioco di ruolo di Andrea Melloni</strong></p>\n\n<p><em>E’ il 1916 e voi siete dei membri dell’Ordine Ermetico del Tramonto Dorato, setta esoterica dedita allo studio delle arti occulte. State sperimentando metodi di magia coi Tarocchi e siete insieme al vostro mentore. Avete a fianco il fossile di un’antica creatura rinvenuto di recente, quando di colpo dalle antiche ossa un portale si apre... Vedete al suo interno un ambiente forestale verdeggiante e su di esso un meteorite che sta piovendo dal cielo purpureo. State analizzando il bizzarro fenomeno, quando un’invisibile forza magnetica vi spinge insieme al vostro mentore e al mazzo dei Tarocchi all’interno del portale, il quale si chiude alle vostre spalle! Siete ora prigionieri di questo ambiente misterioso. In primo luogo scoprite che il vostro maestro non è più con voi. Poi qualcuno di voi si accorge della presenza di alcune grosse creature rettiliformi... Che siano i dinosauri di cui tanto si parla? Qualcosa nella vostra mente vi dice che il modo di tornare indietro non è lontano ma un altro fenomeno bizzarro attira la vostra attenzione: vi accorgete di possedere nuovi poteri straordinari, di poter piegare le leggi fisiche a vostro piacere e di avere ancora con voi gli intrugli alchemici usati per la concentrazione... Ma dove è finito il magico fossile che vi ha portato fin qui? Dov’è il vostro insegnante? Come è possibile che i Tarocchi ora vi permettano di eseguire gli Incantesimi che tanto ricercavate? E soprattutto... Quanto tempo manca prima che il meteorite cada sul pianeta?</em></p>", "metacritic": null, "released": "2021-08-23", "tba": false, "updated": "2021-09-08T11:14:56", "background_image": "https://media.rawg.io/media/screenshots/c11/c119785759de4441e0d9ef21ee97e039.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 10, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["shazorack"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}