{"id": 659116, "slug": "crazy-penguin-catapult", "name": "Crazy Penguin Catapult", "name_original": "Crazy Penguin Catapult", "description": "<h2>Jurassic 3D Rollercoaster Rush™ coming soon - the followup to the smash hit iPhone game!</h2>\n<p>CRAZY PENGUIN CATAPULT 2 LEVEL PACK - COMING SOON<br />\nWe&#39;re offering users a new way to play Crazy Penguin Catapult 2 via Level Packs. In anticipation of the new version, we&#39;ll be reducing the price of the original game by 50%! Get it now before it&#39;s too late!</p>\n<hr />\n<p>GAME REVIEW<br />\nIGN scores 8/10 and says &quot;I think any casual gamer will get a lot of smiles from it. The turn-based strategy game is a cool extra that helps make Crazy Penguin Catapult well worth the price.&quot;</p>\n<hr />\n<p>Award Winning and Most Anticipated Game! Get 2 games in 1: Launch over 200 penguins in Campaign Mode or play endless matches in Strategy Mode.</p>\n<p>Fend off invading Polar Bears by hurtling courageous penguins at them with your trusty catapult! Triumph in boss battles and unlock crazy penguin power-ups including Ninja, Fire, The Twins and more! Get an additional Strategy game that lets you command armies of penguins to attack and capture enemy polar bear territories. Didn&#39;t get a perfect score? Retry levels to get the highest score possible with endless replay value! Watch your score bubble up as you are racing to break ice blocks and knock over polar bears.</p>\n<p>PREMIUM FEATURES:<br />\n- Two great game games in one:<br />\n(1.) Campaign Mode: Original and charming story with over 200 penguins to launch<br />\n(2.) Strategy Mode: Take over enemy bear territories in a turn-based struggle for domination<br />\n- Unlock 9 clever power-ups<br />\n- Explore 3 unique maps<br />\n- Great controls - gently slide or tap your fingers on the touch screen to move your penguin on the map<br />\n- Use the accelerometer when launching the penguins by doing a quick flick with your device<br />\n- Check your progress in real time with High Scores<br />\n- Bright and polished graphics creating a vibrant Antarctic environment<br />\n- Excellent music and sound effects</p>\n<p>STILL NOT SURE? Try the Free Version</p>\n<p>MORE FUN FOR FREE ON APPLE APP STORE<br />\nThere is a Lite version for each D Choc game: Crazy Penguin Catapult, Chocolate Shop Frenzy, Diamond Islands, 3D Tower Bloxx Deluxe, Mini Golf 99 Holes Theme Park, Picto Play Plus, Kamikaze Robots, Tornado Mania!, Pyramid Bloxx, Stunt Car Racing 99 Tracks, Rollercoster Rush, Kamikaze Robots, Johnny Crash, 24 Special Ops and 3D Brick Breaker Revolution.</p>\n<p>You can currently find our classic pocket sized games for iPhone or iPod touch in a variety of categories including arcade, action, adventure, puzzle, sim, strategy, racing and more!</p>\n<p>GREAT DEAL w/ THE PREMIUM VERSION<br />\nDownload the Paid version for unlimited replay value packed with even more gameplay modes, levels, power-ups and special unlocks. Get the full experience!</p>\n<p>FIND DC ON THE WEB<br />\nGet updated with Dig ital Chocolate’s latest product, promos and game tips! Visit us on Facebook, MySpace, YouTube and Twitter! Find us FAST by searching for dchoc.</p>\n<p>All trademarks referenced herein are the property of their respective owners</p>", "metacritic": null, "released": "2008-12-12", "tba": false, "updated": "2023-10-09T07:06:34", "background_image": "https://media.rawg.io/media/screenshots/42e/42e1f3351851fe8d0bfad935409f0c3a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 217, "game_series_count": 1, "reviews_count": 1, "platforms": ["iOS", "PC"], "developers": ["Digital Chocolate"], "genres": ["Action", "Strategy"], "publishers": ["Digital Chocolate"], "esrb_rating": null}