{"id": 659243, "slug": "a-jornada-de-tie", "name": "A Jornada de Tiê", "name_original": "A Jornada de Tiê", "description": "<p>\n</p>\n<p><strong>Este jogo começou a ser desenvolvido durante a Women Game Jam, com o tema “Navegando em Águas Desconhecidas”, e continua em desenvolvimento.</strong><br/></p>\n<p>Embarque nessa aventura rumo ao desconhecido, acompanhando os passos de Tiê, uma pessoa que busca encontrar seu lugar num mundo onde os encaixes pré-definidos da existência não lhe cabem. Inspirado numa história real, <em>A Jornada de Tiê </em>conta a história de uma pessoa que, ao ver que a vida adulta demanda que abramos mão de nossas identidades para nos encaixar num mundo cinza e monótono, decide tomar o destino nas próprias mãos e navegar rumo ao Desconhecido, se defendendo de quem não aceita sua existência e se desvencilhando de normas e obrigações criadas para a forçar num lugar indesejado, tudo isso enquanto lida com decepções amorosas, tão comuns a todos nós. Num mundo tão diverso quanto o nosso, é irreal imaginar que todos iremos ser felizes com dois papéis de gênero tão simplistas. O mundo é enorme, e Tiê é uma pessoa disposta a se aventurar para descobrir qual é seu lugar neste mar infinito.</p>\n<p>Neste jogo, você controla Tiê, que navega num barco num grande oceano. Use as setas para a esquerda e direita para desviar dos ataques de corporativistas, das performances forçadas de feminilidade e das pessoas que tentam quebrar o seu coração. Tiê conta com um escudo, que consegue suportar uma quantidade limitada de ataques. Caso seu escudo quebre, você terá a oportunidade de começar de novo.</p>\n<p>Créditos:<br/>Roteiro: Ana Clara Freitas<br/>Arte e programação: Nayara Lara<br/>Produção e Programação: Mariana Calil<br/>Música: Eric Skiff - Resistor Anthems - Disponível em http://ericskiff.com/music</p>\n\n<p>#womengamejam #wgj2021 #wgjbr #wegamejam</p>", "metacritic": null, "released": "2021-08-23", "tba": false, "updated": "2021-09-08T11:51:14", "background_image": "https://media.rawg.io/media/screenshots/89a/89a7fcd1feb40b75a6c4f561bd8ab9f5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 19, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["PandaPixel", "mscalil", "kaasha"], "genres": ["Action"], "publishers": [], "esrb_rating": null}