{"id": 659373, "slug": "destroy-the-planet", "name": "Destroy the Planet", "name_original": "Destroy the Planet", "description": "<p>Destroy the Planet is a clicker/idle game where the goal is to pollute and consume! </p>\r\nNOTE: The web version of the game might perform poorly, especially in Chrome. Use the downloadable versions for best performance.\r\n<p>This game was originally created for Godot Wild Jam #36. The theme of the jam was \"Uncontrollable Growth\".<br/></p>\n<p>The objective is to either pollute to the max or use up all of the planet resources. You have five types of buildings, factories being the main ones since they are the only type that generate money and also produce much more pollution than others. However, building other types of buildings add bonuses to your factories.</p>\n<p>Clicking on empty places generates some money which can be useful at the beginning. Later on, you can use the \"Manual Cycle\" option of buildings to increase production. Click on a factory, and then under \"Manual Cycle\" click on the \"Perform\" button.</p>\n<p><strong>Short Tutorial</strong></p>\n<ul><li>You start with $100. Use it to build a factory. Just click on the top-most icon on the toolbar and click on a location on the planet.</li><li>Your factory starts generating money. You can generate more by clicking on an empty space.</li><li>When you've gathered $200, you can build build one of the other four types of buildings.</li><li>Factories generate money and pollution based on the following criteria:<ul><li>Factory level. You can upgrade buildings by clicking on them and then clicking on the upgrade button on the left panel (if available).</li><li>Amount of power available. Build powerplants to generate more power.</li><li>The amount of minerals available. Build mines to increase mining level.</li><li>The demand. Demand is a combination of two factors: population and entertainment. Apartment buildings increase population while bars increase entertainment.</li></ul></li><li>You need to either max out pollution or consume all of the planet resources to win the game.</li></ul>\n<p><strong>Known issues</strong></p>\n<ul><li>Degraded performance and audio glitches in the browser especially in the endgame. Firefox seems to be much better than in Chrome, but not completely fine.</li><li>This is not the most balanced game ever, but hey, it's a jam game! Hopefully, post-jam updates will fix some issues.</li></ul>\n\r\n\r\nLicenses\r\n<ul>\n<li>This game uses the Godot Game Engine.\r\n\n<p>\r\nPermission is hereby granted, free of charge, to any person obtaining a copy\r\nof this software and associated documentation files (the \"Software\"), to deal\r\nin the Software without restriction, including without limitation the rights\r\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\r\ncopies of the Software, and to permit persons to whom the Software is\r\nfurnished to do so, subject to the following conditions:\r\n</p>\n<p>\r\nThe above copyright notice and this permission notice shall be included in all\r\ncopies or substantial portions of the Software.\r\n</p>\n<p>\r\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\r\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\r\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\r\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\r\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\r\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\r\nSOFTWARE.\r\n</p>\n<p>\r\n-- Godot Engine</p></li>\n<li>Secula Font. OFL.\r\n</li><li>Smoke Particles by Kenney. CC0.</li><li>UI Audio Pack by Kenney. CC0.</li><li>Missle launch sound. CC0.</li><li>Rough Rumble sound. CC0.</li><li>Music: Big Eyes by Rafael Krux. CC0. Obtained from here.</li>\n</ul>", "metacritic": null, "released": "2021-08-22", "tba": false, "updated": "2021-09-08T12:28:46", "background_image": "https://media.rawg.io/media/screenshots/066/066e6ffe9e35a8410e2ba237fa6abab4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 55, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["elektito"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}