{"id": 659389, "slug": "contre-nature", "name": "Contre-Nature", "name_original": "Contre-Nature", "description": "<p>Protect your crops against the invading giant plants!</p><p>The following is not needed to play the game, you may only read it if the in-game tutorial isn't clear enough.</p><p><strong>Controls:</strong></p><p><strong>Move</strong> with <em>WASD / ZQSD / Left Stick<br/></em><strong>Go left and right in your inventory</strong> with <em>Left Arrow and Right Arrow / Scroll Wheel / Left and Right on DPad<br/></em><strong>Go up and down in your inventory</strong> with <em>Up Arrow and Down Arrow / Mouse Wheel Click / Up and Down on DPad</em><br/><strong>Use the item you selected</strong> with <em>Space Bar / Left Click / A Button<br/></em><strong>Collect grown crops</strong> with <em>Left Shift / Right Click / B Button<br/></em><strong>Open and close the shop</strong> with <em>Tab / X Button<br/></em><strong>Navigate in the shop</strong> with <em>WASD / ZQSD / Arrow Keys / Mouse Pointer and Left Click / Left Stick / DPad</em><br/><strong>Buy the selected item in the shop </strong>with <em>Space Bar / Enter / Clicking the Buy Button / A Button</em><br/><strong>Pause the game and access menu</strong> with <em>Escape / Start<br/></em><strong>Toggle in-game tutorial</strong> with <em>T key / Select<br/></em><strong>Toggle fullscreen </strong>with <em>F11</em> (Well, in Web Format, prefer in-game button)</p><p>Plant your seeds by selecting them in the inventory, going on a dirt tile, and pressing the action button!<br/>Giant plants may want to eat your crops, defend yourself using your scissors: select them in the inventory and press the action button to attack! You will have to wait a bit until you can use them again though...<br/>Grown crops will display an arrow other them. Go over them and press the collect button to collect the money you get for reselling them.<br/>If you have trouble aiming at a crop, select an item that shows the tile you're on (such as any seed).<br/>You can then buy new crops in the shop using your well-earned money. Press the shop button, navigate to the item you want to buy and click the Buy button.<br/>You will then have to switch items with the up and down inventory controls to find your newly bought items.<br/>Hoes allow you to grow more crops by transforming grass tiles into dirt tiles. You may want to buy a more efficient one than the one you start with though...<br/>Watering cans saves you a small amount of time in the growth cycle of a crop.<br/>The Hammer can be used to gain a bit of time whilst fighting enemies!<br/>Pressing the action button during an action will cancel it.<br/>If you lose all money and seeds, you will want to restart using the pause menu.</p><p>Can you reach the ending by growing a sacred dandelion?<br/></p><p><strong>Random trivia about the game:</strong></p><p>Enemies spawn at regular intervals with a cap number set depending on the value of the crops on the terrain.<br/>The music changes with depending on the number of enemies.</p>", "metacritic": null, "released": "2021-08-22", "tba": false, "updated": "2021-09-08T12:33:01", "background_image": "https://media.rawg.io/media/screenshots/4f0/4f06344d929674068be8135f434ed6f8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 16, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Kiwy"], "genres": ["Action"], "publishers": [], "esrb_rating": null}