{"id": 6594, "slug": "fantastic-plastic-squad", "name": "Fantastic Plastic Squad", "name_original": "Fantastic Plastic Squad", "description": "The Golden Age of Action Figures is here again. Travel back to 1984 and join forces with a team of 5” action figures known as the Fantastic Plastic Squad! Choose between the heroic Cyber Squad, the noble HeroBots, or the enchanting Glamazons and get ready for high adventure. Take command and defend your house from the ever growing hordes of evil. Enjoy explosive third-person combat in a nostalgic throwback to the landscape of yesterday. Explore a detailed world of heroes, accessories, and villains as you battle to defeat the nefarious Dr. Demonocle and his Legion of Goons!<br/><br/>Features:<br/><br/>• FULLY POSEABLE ACTION FIGURES!!<br/>Your action figures spring to life as they battle Dr. Demonocle’s Legion of Goons. Grab a hero from one of the three unique factions and get started!<br/><br/>• COLLECT, DEFEND, ATTACK!!<br/>Collect hundreds of awesome and unique action figures! Unlock radical weapons and boost your hero’s stats. Use your newfound power to defend the whole house from evil!<br/><br/>• PLAY FOR POWERFUL UPGRADES!!<br/>Every victory will get you closer to unlocking incredible upgrades. With millions of combinations, you will never be bored!<br/><br/>• ADAPTABLE GAMEPLAY!!<br/>Thumb fatigue? No way! Stuck on a level? Bogus! Our game assist technology can give your fingers a rest as our automatic, cybernetic computer brain takes control to do the heavy lifting!<br/><br/>• EXTREME MULTIPLAYER ACTION!!<br/>Crushing it in Campaign Mode? Then dive into the fast paced Player vs Player Arena as you battle friends and enemies alike with a new experience every time.<br/><br/>• STEP INTO THE TIME RIFT!!<br/>Immerse yourself in the 1980s and reminisce about those most excellent days! Not old enough to remember the 80s, dude? Well you’ll still have a bodacious blast with the awesomely detailed environments and non-heinous gameplay.<br/><br/>**** NOTE: Game is not optimized for iPad 2, iPad mini, iPod Touch (5th Gen), and iPhone 4S. ****", "metacritic": null, "released": "2015-12-09", "tba": false, "updated": "2019-10-22T14:29:00", "background_image": "https://media.rawg.io/media/screenshots/fdd/fdd3153c8275d84d79fcf26af2e196ce.jpeg", "website": "http://www.poundsand.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 201, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Pound Sand"], "genres": ["Action", "Adventure"], "publishers": ["Pound Sand"], "esrb_rating": "Everyone 10+"}