{"id": 65947, "slug": "dirt-bike-exploration-racing", "name": "Dirt Bike Exploration Racing", "name_original": "Dirt Bike Exploration Racing", "description": "Download our best motorcycle game now to feel like a true champion driving in an adventure you will not forget!<br/><br/>If you love the Dirt Bikes and speed on two wheels this is the game you've been waiting for!<br/><br/>You have to get to an appointment as soon as possible and will only be on time if you go with a bike. You steal an amazing Dirt Bike, but an undercover cop has seen you and prepares to chase you at full speed!<br/><br/>Survive in a crazy escape in which the police and the different obstacles that you will cross along the way try to stop you from arriving on time!<br/><br/>◉ INCREDIBLE DIRT BIKES ◉<br/>You'll be surprised by the pixelated design of the Dirt Bikes and you'll feel very comfortable during the motorcycle racing!<br/><br/>As you climb your driving experience level you'll be able to drive better Dirt Bikes! They are ideal for lovers of blocky games!<br/><br/>The controls are very simple so that your escape will totally depend on your driving skills and abilities!<br/><br/>There's no time to lose! Choose your pixel bike and escape the police showing that no one can reach you!<br/><br/>◉ MISSIONS AND FUNNY POWER-UPS ◉<br/>In addition to the escape in which you will take part, there are many missions to overcome in the race in order to obtain more points, improvements and progress in the game!<br/><br/>The higher your driving skills will be the more difficult the missions will be, so you will have to be very concentrated while driving your Dirt Bike!<br/><br/>On your way you'll encounter monster trucks, buses, billboards, and other boxes that may get into your lane and force you to dodge them to survive. In order to continue your race and not die, make sure to dodge all the obstacles!<br/><br/>Collect coins for upgrades, nitros to be invincible and destroy everything, magnets to attract all the coins and bonuses to multiply your scores! Leave nothing on the road and stay tuned because there are also lives that appear!<br/><br/>Follow us on Twitter: @LabCave<br/>Like us on Facebook: www.facebook.com/LabCaveGames", "metacritic": null, "released": "2015-05-30", "tba": false, "updated": "2019-10-22T14:27:08", "background_image": "https://media.rawg.io/media/screenshots/15d/15d3980f3be3127726e3bb43673dbc47.jpg", "website": "http://labcavegames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 130, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Lab Cave Apps"], "genres": ["Simulation", "Racing"], "publishers": ["Lab Cave Apps"], "esrb_rating": "Everyone 10+"}