{"id": 659640, "slug": "beat-rush-itch-ongakken-s-r-o", "name": "Beat Rush (itch) (Ongakken s. r. o.)", "name_original": "Beat Rush (itch) (Ongakken s. r. o.)", "description": "<p>Beat Rush is a musical racing game in which your goal is to catch as many <em>points</em> as possible, survive and upgrade your ship to the max.<br/><br/>You'll be in control of a space vessel capable of flying above a special platform that enables you to fly. You'll begin with a regular ship and work your way up by collecting <em>blue points</em> and using them to upgrade your vessel. The vessel's speed will increase by each beaten level. In the background of every level, you'll hear a different pumped-up electronic track.<br/><br/>In Beat Rush, your goal is to survive throughout the music track playing in the background.<br/>You'll play with spaceships, which you can upgrade.<br/>But it's not going to be that easy!<br/>There will be obstacles spawning in your way. Colliding with them will cause damage to your ship: too much damage and ... boom.<br/>You will also encounter what we call '<em>points</em>.' They are shining conical objects.<br/>The <em>points</em> come in 3 colors, according to their function in the game.<br/>All <em>points</em> replenish some of your health.<br/>The <em>blue</em> ones are used as a currency in Beat Rush. You can spend them in the Shop.<br/>The <em>pink</em> ones allow you to jump; <strong>15 pink points = 1 jump</strong>.<br/>The <em>orange</em> ones allow you to regenerate your shield, which you'll unlock with the 3rd ship in the Shop.<br/>Each level will be more complicated than the previous one: more obstacles and higher speed.<br/>Colliding with the walls on your sides also damages you - be careful while moving towards them!<br/>Ships 4 and higher have unique features that you can activate with the key that regenerates your shield.</p>", "metacritic": null, "released": "2021-08-22", "tba": false, "updated": "2021-09-08T13:47:01", "background_image": "https://media.rawg.io/media/screenshots/2d4/2d4cb5999df27fce55d9cdd1dfedba78.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 14, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ongakken s. r. o."], "genres": ["Racing"], "publishers": [], "esrb_rating": null}