{"id": 660, "slug": "killer-instinct", "name": "Killer Instinct", "name_original": "Killer Instinct", "description": "<p>A famous series of fighting games, that for a long time, remained an exclusive for consoles. In 2013, the game got a reboot on the Xbox One, and in 2017 the game moved to the PC.</p>\n<p>Killer Instinct of 2017 is all the same one on one melee fights. The developers got inspiration from other legendary games in the genre: attack set was borrowed from Street Fighter series and finishing moves from Mortal Kombat. In the reboot, the Combo Breaker mechanic has been changed a little - now it is necessary to coincide in strength and timing with a counter blow to make a successful break. The plot of the game almost wholly repeats the plot of the first part: each fighter passes the way in a tournament organized by a mega-corporation and fights with the final Fulgore boss. The details of the story are different for each character.</p>\n<p>You can fight for 20 stages with a dynamically changing environment and destructibility. Besides, the game has all the fighters from the previous parts. The plot campaign with cinematic cut scenes will have to be done alone. With other players, you can compete in online multiplayer, with the online ranking system. To play on a PC, the developers advise using a controller.</p>", "metacritic": null, "released": "2013-11-22", "tba": false, "updated": "2024-01-31T11:00:16", "background_image": "https://media.rawg.io/media/screenshots/48f/48fccb824104ff02029e855bbfdcbe45.jpg", "website": "https://www.ultra-combo.com/", "rating": 3.54, "rating_top": 4, "added_by_status": {"yet": 68, "owned": 1805, "beaten": 56, "toplay": 20, "dropped": 151, "playing": 23}, "playtime": 2, "achievements_count": 955, "ratings_count": 307, "suggestions_count": 669, "game_series_count": 0, "reviews_count": 312, "platforms": ["Xbox One", "PC"], "developers": ["Iron Galaxy"], "genres": ["Action"], "publishers": ["Microsoft Studios"], "esrb_rating": "Teen"}