{"id": 660092, "slug": "follow-the-leader-nisovin", "name": "Follow The Leader (Nisovin)", "name_original": "Follow The Leader (Nisovin)", "description": "<p>The Ginkapo are mysterious and magical creatures that live deep in the Elder Woods. They love to play games, and their favorite is <em>Follow the Leader</em>! Help the Ginkapos play <em>Follow the Leader</em>, but watch out for the dangerous snake-vines, and don't crash into each other! (This is a snake clone.)</p>\n<p>Ginkapos like to hide underground much of the time, but they can be brought out to play by running over their hiding places. They will dive back underground if they are in danger.<br/></p>\n<p>There are two varieties of <em>Follow the Leader</em> that the Ginkapos like to play.<br/></p>\r\nSunlit Glade\r\n<p>Run around within a small grove. Dodge the snake-vines, which grow faster as the game goes on. Last as long as you can!<br/></p>\r\nStorm Run\r\n<p>Run through the forest, with the storm front right behind. Dodge snake-vines and other obstacles. As time passes, the storm moves faster and the snake-vines grow faster. Go as far as you can!</p>\n\r\nAbilities / Controls\r\n<p>Supports both keyboard and controller (instructions assume an Xbox controller). You will often need a mouse for the menus. There is a tutorial in game, but the information is provided here as well for convenience.<br/></p>\r\nMove\r\n<p>Keyboard: WASD or arrow keys<br/>Controller: Left stick or d-pad</p>\r\nJump\r\n<p>Leap over obstacles to avoid them! You have 3 charges with a cooldown.<br/>Keyboard: Space bar<br/>Controller: A</p>\r\nMagic\r\n<p> Shoot a bolt of magic, destroying the first vine it hits. Short range. You have only one charge with a cooldown.</p>\n<p>Keyboard: F or Left-click<br/>Controller: X</p>\r\nStealth\r\n<p>Makes you stealthy for a short time, allowing you to pass through vines and each other. You have 2 charges with a cooldown.<br/>Keyboard: Shift or Right-click<br/>Controller: Y</p>\r\nPause\r\n<p>The pause menu also has volume and other settings.<br/>Keyboard: Esc or P<br/>Controller: Select or Start<br/></p>", "metacritic": null, "released": "2021-08-21", "tba": false, "updated": "2021-09-08T16:08:25", "background_image": "https://media.rawg.io/media/screenshots/e33/e335fba91c458c13c333f3e61ac24d49.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 53, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["Nisovin"], "genres": [], "publishers": [], "esrb_rating": null}