{"id": 660174, "slug": "line-con", "name": "Line Con", "name_original": "Line Con", "description": "<p>The doors to Quakecon are near. You can hear the cheering, the computer fans, the clinking of bawls. Soon you will be back in Quakecon’s embrace, if only it weren’t for these long lines. Well, if we’re going to be in line for the day, may as well make our own convention out of it, shall we? \r\n</p>\n<p>Compete in a series of mini-games as you earn your way to the front of the line. Line Con has never been better as you play as some of your favorite Bethesda characters with up to 50 of your friends, and foes.\r\n</p>\n<p>Line Con is a project made for the 2021 Quakecon Game Jam, for the theme “Waiting in Line”.\r\n</p>\n<p><strong>Controls<br/></strong></p>\n<p>- Jump: SPACE<br/></p>\n<p>- Chat: T<br/></p>\n<p>-Send Message: ENTER</p>\n\n<p><strong>Features\r\n</strong><br/></p>\n<ul><li>3 Mini-games:\r\n<ul><li>Rogues of Dunwall\r\n<ul><li>Sneak your way past Dunwall’s guards, but make sure to freeze when they look in your direction!\r\n</li></ul></li><li>Road Rage\r\n<ul><li>Race through the Outlands as a raging fire nicks at your heels. Perform tricky jumps to reach the end, or else you’ll have to face the heat\r\n</li></ul></li><li>Typhon Outbreak\r\n<ul><li>An infection has broken out, can you withstand the alien plague?\r\n</li></ul></li></ul></li></ul>\n<ul><li>Massive Multiplayer\r\n<ul><li>Play with up to 50 users in this massive online multiplayer party game\r\n</li></ul></li><li>Chat\r\n<ul><li>Send messages to other users with a preliminary chat feature</li><li>Press \"t\" to Chat, and \"enter\" to send a message</li></ul></li><li>Multi-Platform: Supports Windows &amp; Mac<br/>\n</li></ul>\n<p><strong>Features Cut\r\n</strong><br/></p>\n<ul><li>Unlock Heroes\r\n<ul><li>Catch swag that is thrown out to Line Con participants, and unlock more heroes to play as.\r\n</li></ul></li><li>6 Mini-games:\r\n<ul><li>Gol Hah Dov\r\n<ul><li>Play Simon Says with the Greybeards on High Hrothgar. Learn the way of The Voice, or else!\r\n</li></ul></li><li>Moon Hop\r\n<ul><li>Jump over Gargs and Vorgs in a deathly game of alien jump rope\r\n</li></ul></li><li>Wasteland Matchup\r\n<ul><li>Test your intelligence stat with a faction-themed memorization test\r\n</li></ul></li><li>Demon Crusher\r\n<ul><li>What’s better than crushing demons? Crushing a whole tower of demons faster than your buddies\r\n</li></ul></li><li>Don’t Panic\r\n<ul><li>Hurry to safety as Sebastian Castellanos offers you steady advice on which tiles guarantee your life, fail to heed his words and you’ll meet your doom\r\n</li></ul></li><li>Instagib\r\n<ul><li>Frag others in a fast-paced arena: one hit, one kill\r\n</li></ul></li></ul></li></ul>\n<p><strong>Known Bugs\r\n</strong></p>\n<ul><li>Doesn’t save unlocked Heroes\r\n</li><li>After playing a game of Typhon Outbreak and becoming infected, your Hero skin stays appearing as an Infected\r\n</li><li>The Fire Wall in Road Rage does not always reset when you replay the mini-game, so it continues moving forward, and spawning into the level can result in death\r\n</li><li>Constantly running left or right in the line\r\n</li><li>Spawning in improper locations\r\n</li><li>Instantly was infected when loaded in Typhon Outbreak\r\n</li></ul>\n<p><strong>Credits\r\n</strong></p>\n<ul><li>Andrew Pyle: Coder\r\n</li><li>Christalynne Pyle: Artist\r\n</li><li>Emily Ingalls: Sound Designer\r\n</li><li>Cameron Ingles: Artist\r\n</li></ul>", "metacritic": null, "released": "2021-08-21", "tba": false, "updated": "2021-09-08T16:34:26", "background_image": "https://media.rawg.io/media/screenshots/629/62916d719d838c9a533aaaae08e8d947.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 146, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Christalynne Pyle"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}