{"id": 660232, "slug": "legend-of-labot-the-golden-pearl", "name": "Legend of Labot: The Golden Pearl", "name_original": "Legend of Labot: The Golden Pearl", "description": "Play as a young orphan named Labot, who aspires to become a great warrior in his village of Naothob. Upon hearing the news of the golden pearl missing, he seeks the permission of the Chief Commander to go and join the quest. <br/><br/>What if he is rejected because he is just a kid and has no experience on the battlefield? Will you help this poor little guy find who stole the golden pearl amidst dangerous monsters lurking in the island? Together, prove that you're not fragile and weak but a strong and courageous warrior of the village.<h3>CHALLENGING GAMEPLAY</h3><br/>The game tests the player's dodging skills and reflexes in a real-time combat. Monsters are a little bit smart and somehow conscious, so expect a fairly challenging yet beatable game.<h3>RELAXING EXPERIENCE</h3><br/>Inspired heavily by nature thus anticipate a very calming ambience and soothing experience while playing.Key Features<br/><ul><li><strong>intense fighting mechanics</strong><br/>Action-loaded combat with smart and powerful enemy AI for those that are hungry for real-time battle experience.<br/></li><li><strong>super smooth controls</strong><br/>Controls are hand-tailored to be buttery smooth to ensure seamless experience while playing.<br/></li><li><strong>crispy 2D pixel art</strong><br/>Immerse yourself with the beautiful pixel art backgrounds that are deeply inspired by nature's wonder.<br/></li><li><strong>relaxing background music and sound effects</strong><br/>Imbued with realistic sounds of birds chirping, rain, beach and many more of nature's soothing sounds.</li></ul>", "metacritic": null, "released": "2021-08-21", "tba": false, "updated": "2021-11-19T04:10:35", "background_image": "https://media.rawg.io/media/screenshots/195/1958ed9484c2ed60b77ee401c58aeff3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 198, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["naknamu", "DreamJoy Studios"], "genres": ["Action", "Adventure", "RPG", "Indie", "Platformer"], "publishers": ["DreamJoy Studios"], "esrb_rating": null}