{"id": 660370, "slug": "scratchin-melodii-demo", "name": "Scratchin' Melodii [DEMO]", "name_original": "Scratchin' Melodii [DEMO]", "description": "<p>In this game, you're playing as the young DJ and musician, Melodii. After getting caught doing graffiti, they've gotta scratch up some melodies to pay debt for their felonies! Defeat your rivals to get to your jobs (Bosses) on time!<br/><br/>The current demo has:<br/>1 tutorial level (Astral Advisory),<br/>1 Rival Battle (Cream Cheese Icing),<br/>and 1 Boss Battle (Grease Poppin').</p>\n<p>You can get the soundtrack here!: https://lj-lephemstar.bandcamp.com/album/scratchin-melodii-ost</p>\n<p><strong>TROUBLESHOOTING<br/><br/></strong></p>\n<p><strong>\"Why isn't my controller mapped right?\"</strong><br/>If you're using a controller, you should add the game's exe to your Steam Library* and run it from there. That'll make sure that any controller you use (that's supported by Steam at least) works as expected. (If you're using a PS4 controller, turn off DS4 too.) And don't forget to change your controller layout accordingly in the game's Options menu!!</p>\n<p>How to add non-Steam games to your Steam Library*<br/><br/><strong>\"When I try to select a song, I'm taken back to the title screen\"</strong><br/>Chances are, you either need to refer to the first troubleshooting question or are pressing the wrong button. For example, if you use the games NS layout settings instead of Steam's, \"A\" will be the Cancel button and \"B\" will be the Select button.<br/><br/><strong>\"I'm experiencing a bit of lag.\"</strong><br/>From my testing, I've only experienced hiccups at the beginning of a song when I have a program open that's using up a lot of my PC's power while the game is trying to run (Usually the Unity Editor). BUT, if you do run into any a quick \"Retry\" from the pause menu should let the game run  everything smoothly from there. Try turning the quality down in the Options menu if needed as well!<br/><br/><strong>\"...In Grease Poppin' I turned into a 3-Dimensional being and the game did [Insert unknown glitch that very likely exists here]\"</strong><br/>That's the experimental \"Ascension\" feature! It hasn't had much testing, and you're barely likely to run into it unless you have insane skills/dedication to trying to activate it. But if you do, let me know if you see anything fishy and when it happened so I can fix it!<br/></p>", "metacritic": null, "released": "2021-08-21", "tba": false, "updated": "2023-09-09T12:16:10", "background_image": "https://media.rawg.io/media/screenshots/b7b/b7b8c9a51aadf446f2aea386167e827e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 2, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 80, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["LJ LephemStar"], "genres": [], "publishers": [], "esrb_rating": null}