{"id": 660436, "slug": "you-probably-wont-die", "name": "You Probably Won't Die", "name_original": "You Probably Won't Die", "description": "<p>You Probably Won't Die is a zombie survival game where you play as someone trapped on a desert island and must survive 7 waves of monsters that arrive via the Sea that surrounds said desert island.</p>\n<p><strong>How to Play:</strong><br/>Upon starting and in between each wave you have a 30 seconds grace period where you can use your Axe, to chop down Trees to get Wood which you can then use to build yourself a temporary base, sometimes the Trees also drop Saplings which can be used to plant new Trees.</p>\n<p>During waves monsters will randomly spawn and begin approaching your position, this is where your Shotgun comes in handy as you not only gain points for surviving each wave you also gain points for killing said monsters, try to find the balance between hiding in your base and running around killing to optimize your point gain!</p>\n<p><strong>Controls:<br/></strong>&gt; W, A, S, D or Arrow keys to move.<br/>&gt; 1-6 keys to switch hot bar slot.<br/>&gt; Mouse to aim.<br/>&gt; Left or Right click to shoot/use tool/place</p>\n<p><strong>Furthermore:<br/></strong>As of a week ago I watched BadGameDev's video on making the \"easiest game ever\", I felt a spark of inspiration and wanted to try making it myself, originally aimed to follow the same deadline rules of 2 days it ended up becoming a week long endeavor as I kept finding things I could tweak, improve and fix, ultimately I'm quite fond of how it turned out and I did at least follow the rule of using the art pack selected for Miziziziz's Miz Jam 1.<br/><br/>You can check out the game of inspiration, here.<br/>You can check out the art pack used, here.</p>\n<p><strong>Shameless Plug:<br/></strong>Want to support development of my games, both old and new? well you can, here!<br/></p>", "metacritic": null, "released": "2021-08-21", "tba": false, "updated": "2021-09-08T17:55:18", "background_image": "https://media.rawg.io/media/screenshots/44f/44f45e584bdd4babb40d66f98b36836f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 64, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Vulpini Templar"], "genres": ["Action", "Shooter", "Strategy"], "publishers": [], "esrb_rating": null}