{"id": 660539, "slug": "three-kingdomthe-journey", "name": "Three kingdom:The Journey", "name_original": "Three kingdom:The Journey", "description": "Game in development!!\r\n<p>Hi everyone, this is Sen, I am Chinese game developer who was working on this project for almost 2 year, This is an ongoing project and I will keep develop this game and upload new version each 2 weeks. In this patch, game is playable but please take it as an alpha test stage. And please share your advise to me ! </p>\n<p>If you are waiting for a more complete version, you can add game in Wishlist in STEAM, while if you like to develop with me and provide early advises I will be very grateful.</p>\n\r\nDESCRIPTION\r\n\n<p>Three Kingdom: The Journey is an game which focus on player choice and build path rougelike card game. You are able to choose the play style from the beginning of the game as one of faction in Three Kingdom. Build up new deck and fight with different powerful enemies, take down city points to empower your deck, then fight to the end.<br/><br/><br/><strong>Game Feature</strong><br/><br/>-Engagement: Every time you enter the journey, you can choose from random different type of territory which lead you to face random enemies, shop, event...<br/><br/>-Choice: Choice begin matter since the beginning of the game, you are able to choose your preparation like your general and equipment, and empower them on your journey. There are hunderds of cards and different reward that will leave you to make the choice, making a beatiful combo to enemies is the key to conquer your journey.<br/><br/>-Feedback: You don't need to worry about your journey, keep gaining experience to unlock more powerful equipments.<br/><br/>-Deck Build: Build up your deck from the journey, grow your army team by defeating enemies, hiring.....Or if you are lucky, some legendary general would like to join you.<br/><br/><strong>Game Content</strong><br/><br/>-100+ Cards.<br/>-20+ Equipments.<br/>-60+ Enemies.<br/>-20+ Evenets.<br/>-9 different type of territories.<br/>-3 Level of Journey.</p>", "metacritic": null, "released": "2021-08-20", "tba": false, "updated": "2021-09-08T18:26:22", "background_image": "https://media.rawg.io/media/screenshots/3ec/3ec4b664126217640ac39f69aa44e76c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 99, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["senyan"], "genres": [], "publishers": [], "esrb_rating": null}