{"id": 66074, "slug": "crossword-puzzle-star", "name": "Crossword Puzzle Star", "name_original": "Crossword Puzzle Star", "description": "Crossword Star features a brand new crossword puzzle every single day!<br/><br/>Our crosswords are a fun way to keep your brain active - designed to be a challenge but not too difficult.<br/><br/>They can be solved at your own pace, in your own time, wherever you are. Whether that’s at home, whilst travelling or even by the pool!<br/><br/>Each crossword is based on a theme including music, food and drink, books, the world and more. At least 5 clues are theme-related so even if you don’t know much about the day’s theme, you can still solve the crossword.<br/><br/>If you get stuck, no problem! The app lets you check if your answer is correct or to request the solution for a line or square. All at no extra cost!<br/><br/><br/><br/>Our daily themes are:<br/>- Music Mondays (Artists, songs, albums)<br/>- Coffee Time Tuesdays (Food and drink)<br/>- Wonder Wednesdays (Natural wonders, cities, countries etc.)<br/>- Fiction Thursdays (Books, authors, characters)<br/>- Film Fridays (Actors, directors, films)<br/>- Sporting Saturdays (All kinds of different sports)<br/>- Super Sundays (A fun random theme to finish the week!)<br/><br/>Features<br/>- A new puzzle every day, 365 days a year<br/>- Show errors to highlight wrong letters<br/>- Reveal letters and words you don’t know<br/>- Clear, simple and easy to use<br/>- Puzzles that are not too easy yet not too hard<br/>- Wonderful appearance and a pleasure to play<br/>- Offline mode so you can play Crossword Star anywhere, anytime.<br/>- Hold your device as you like to hold it and play in landscape or portrait mode.<br/>- Sync your crossword progress between all of your devices<br/><br/><br/>Subscription Pricing &amp; Terms<br/>This app requires a subscription purchase to access the crosswords. All customers are welcome to try the app out for a free 7 day trial before purchasing.<br/><br/>Crossword Star is free to download. All customers are welcome to try a free 7 day trial period. If you choose to continue using Crossword Star, you can choose between the auto renewing subscriptions:<br/><br/>Monthly subscription: $4.49 USD<br/>Yearly subscription: $34.99 USD<br/><br/>The subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period. The account will be charged for renewal within 24-hours prior to the end of the current period, at the same price that you initially secured.<br/><br/>You may cancel automatic renewal by selecting Manage App Subscriptions in your iTunes Account settings and selecting the subscription you want to modify. Alternatively you can tap on Manage Subscription in the Settings section of the app.<br/><br/>Terms &amp; Conditions can be found at http://wubuapps.com/terms", "metacritic": null, "released": "2018-02-21", "tba": false, "updated": "2019-10-22T14:27:09", "background_image": "https://media.rawg.io/media/screenshots/e5d/e5d407d865a9df2afe28d15bf4263639.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 74, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Wubu Apps"], "genres": ["Puzzle"], "publishers": ["Wubu Apps"], "esrb_rating": "Everyone 10+"}