{"id": 66087, "slug": "market-for-tf-2", "name": "Market for TF 2", "name_original": "Market for TF 2", "description": "Market for TF 2 allows you to keep an eye on the prices of Team Fortress 2 items on the Steam Community Market. If you fancy getting great deals on items simply set up your alerts, you will be notified the second the price drops below your anticipated value. Market for TF 2 is also a helpful tool to analyze the Steam Community Market, it comes in handy when you want to sell some of your stuff and are waiting for the best moment to do it so or if you simply want to be up to date with Team Fortress 2 item pricing. With Market for TF 2 you’ll never again miss out the deals you were waiting for!<br/><br/>Features: <br/>- Over 5,500 Team Fortress 2 items – that’s every item you can find on the Steam Community Market!<br/>- Adding Team Fortress 2 items to your Watch List<br/>- Unlimited customizable alerts!<br/>- Real-time Steam Community Market monitoring<br/>- Background monitoring - you won’t need to check the app every few minutes, you’ll get an alert as soon as the deal you were waiting for appears!<br/>- Price difference alerts - allow you to to monitor how the prices change<br/>- Price change alerts - notify you when the price drops below or raises over your anticipated value<br/>- Most common currencies to monitor the prices in<br/>- Convenient and easy to use", "metacritic": null, "released": "2015-08-22", "tba": false, "updated": "2019-10-22T14:27:09", "background_image": "https://media.rawg.io/media/screenshots/aa4/aa46f3ec4866d14be2a377509ba5f8dc.jpg", "website": "http://www.facebook.com/marketfor", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 60, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mateusz Grabowski"], "genres": ["Action"], "publishers": ["Mateusz Grabowski"], "esrb_rating": "Everyone 10+"}