{"id": 660825, "slug": "elysium-aidan-sanjay-uowm-game-development-jujuann", "name": "Elysium (Aidan Sanjay, UOWM Game Development, JujuannaIguana, Nessa Ong, darrenchong, Chris LY, JellyFeng, Chong Chun Zeng)", "name_original": "Elysium (Aidan Sanjay, UOWM Game Development, JujuannaIguana, Nessa Ong, darrenchong, Chris LY, JellyFeng, Chong Chun Zeng)", "description": "ENTER ELYSIUM \r\n<p><em><strong>\"If you have faith, you will be granted strength.\"</strong></em></p>\n<p>Elysium, set in ancient Greece; a place where the Greek Faith is at it's peak.  Protected and governed by 8 individuals who are regarded as the <strong>Pillars of Elysium</strong>, they have been granted Godly powers from their respective Gods in exchange for their unyielding faith. The Greek Gods gain power as more people have faith in them &amp; worship them. </p>\n<p>You take on the Artorius, a weak individual who is frustrated at himself for being weak and a coward in battle. He travels to Elysium to seek strength from the God of War, Ares and his Pillar that represents him on Elysium. Elysium has a rule where those that arrive here on a pilgrimage may not stay for long, but Artorius was determined to meet the Pillar of Ares; so he stayed back and was involved in an event not even the Gods could have predicted. The faith of Elysium has been corrupted, the Gods have now lost connection to Elysium. </p>\n\n<p>Artorius now has to combat his way to each Pillar cleansing them from their corruption (<em>also taking their powers for himself</em>) and restoring Elysium back to it's glory and along the way becoming Elysium's greatest hero. </p>", "metacritic": null, "released": "2021-08-20", "tba": false, "updated": "2021-09-08T19:53:12", "background_image": "https://media.rawg.io/media/screenshots/b10/b10e5a624dd0eb2ab1aca0a71c5c2c97.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 133, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["JellyFeng", "UOWM Game Development", "Chris LY", "JujuannaIguana", "darrenchong", "Aidan Sanjay", "Nessa Ong", "Chong Chun Zeng"], "genres": ["Action"], "publishers": [], "esrb_rating": null}