{"id": 66122, "slug": "bts-world", "name": "BTS World", "name_original": "BTS World", "description": "It's 2012 - and you work at Big Hit. As BTS's manager, their debut is up to you!<br/><br/>Is this the beginning of your success story?<br/>Will you be able to go back to your own world?<br/>It’s time to live your wildest dreams - jump right in!<br/><br/>[Game Characteristics]<br/>▶ 'Help BTS Debut! Dramatic, cinematic 〈BTS STORY〉<br/>- Embark on a journey where you and BTS grow together!<br/>- Bring the members together and help them develop into great artists!<br/><br/>▶ What if they never joined BTS? 7 members, 7 different stories 〈ANOTHER STORY〉<br/>- \"I'll be your strength!\" Befriend the different members and help them solve their problems to fulfill their dreams!<br/>- Enjoy various genres of storytelling, from Mystery to Comedy to Sports and more!<br/>- Detective Kim Namjun/Handsome Hotelier Kim Seok Jin/Min Yunki and the Music Academy/White-coated Angel Jeong Hoseok/<br/>Park Jimin’s Rice Cakes, Dancing, Tears/Lv. 1 Farmer Kim Taehyung/Jeon Jeongguk and the Taekwondo Club<br/><br/>▶ \"Who keeps pressing 'Like' on every new photo?\" 〈1 on 1 conversations with the members of BTS〉<br/>- Texts! Social Feed! Voice Calls! Video Calls!<br/>Your battery can’t keep up with all these conversations!<br/>- Increase Affinity with the members! Who knows, maybe you'll even learn their innermost thoughts!<br/><br/>▶ Available exclusively in BTS WORLD: 〈BTS Member Cards〉<br/>- “I bet you’ve never seen a moving photo card before - right?\"<br/>Collect moving photo cards of BTS and let the members speak to you!<br/>- Collecting and upgrading your different BTS Member Cards<br/>will reveal even more exclusive stories and interactions with the members!<br/><br/>---------------<br/>*For the best possible gameplay, make sure you have enough storage space.<br/>*Additional fees may apply for in-app purchases.<br/><br/>[Optional Auto-renewable Subscription Info]<br/>VIP Membership: 4.99 USD / Monthly (or local equivalent)<br/>Subscriptions are available as an optional in-app purchase. Subscriptions will automatically renew at the applicable subscription price at the end of the subscription period unless you cancel your subscription. Payment for the next subscription period will be charged to your iTunes account within 24-hours prior to the end of the current subscription period. You can cancel your subscription at any time by accessing your iTunes Account Settings and selecting to cancel your subscription. After canceling, you will still be responsible for paying the subscription fee for the current active applicable subscription period.<br/><br/>[Minimum Specs]<br/>iPhone 5S or higher, iOS 9 or higher<br/><br/>[Permissions Info]<br/>▶ Necessary Permissions<br/>Storage<br/>- Device Storage access is required to store and install data and to access the CS Center.<br/><br/>▶ Optional Permissions<br/>Camera<br/>- Camera access is needed to access Mobile content and to access the CS Center.<br/>*The service can be used even if permissions are not granted.<br/><br/>- Privacy Policy: http://help.netmarble.com/policy/privacy_policy.asp<br/>- Terms of Service: http://help.netmarble.com/policy/terms_of_service.asp", "metacritic": null, "released": "2018-07-31", "tba": false, "updated": "2019-07-29T18:01:33", "background_image": "https://media.rawg.io/media/screenshots/872/8725fac4a6db13255ef92ed8cb835fd3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 296, "game_series_count": 0, "reviews_count": 2, "platforms": ["iOS"], "developers": ["NetMarble", "Ninh Ngo Hai"], "genres": ["Adventure", "RPG", "Puzzle"], "publishers": ["Netmarble", "Ninh Ngo Hai"], "esrb_rating": "Everyone 10+"}