{"id": 661469, "slug": "embracelet-itch", "name": "Embracelet (itch)", "name_original": "Embracelet (itch)", "description": "<p><strong>Travel to northern Norway, solve puzzles using a mysterious, magical bracelet and make new friends on your journey to discover the past - and yourself!</strong></p>\n<p>From the solo developer of the award-winning game Milkmaid of the Milky Way comes a new, lovely adventure where you play teenager Jesper who is given a strange bracelet from his grandfather. A bracelet with strange, telekinetic powers! <br/></p>\n<p>You are urged to reveal the mystery behind the bracelets magical powers, and try to discover why your grandfather fled the island where he grew up. Along your journey you'll hook up with teenagers Hermod and Karoline, and get involved in the struggle the island faces.</p>\n<p>Embracelet was greeted with critical acclaim (85% metacritic) and was nominated for Best Serious Game at BIG Festival in Bilbao and Game of the Year at spillprisen in Norway. Now it's your turn to play this indie gem here on itch!</p>\n<p><strong>Playtime:</strong> 3-6 hours with different endings.<br/><strong>Specs:</strong> A PC with Intel Iris or better graphics, 1GB of space, 4GB ram minumum. The Linux build is experimental, but has similar requirements as the PC version.</p>\n<p><strong>Playing with a controller is strongly recommended!</strong> <br/>If you play with mouse/keyboard, please go into settings -&gt; controls and choose mouse/keyboard instead of controller.</p>", "metacritic": null, "released": "2021-08-18", "tba": false, "updated": "2021-09-08T23:15:43", "background_image": "https://media.rawg.io/media/screenshots/09d/09d45b224cbd37cfaaeff4c3d4bd1f9d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 165, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["Machineboy"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}