{"id": 661636, "slug": "superlative-frank-cousins-land", "name": "Superlative Frank Cousins Land", "name_original": "Superlative Frank Cousins Land", "description": "<p>SUPERLATIVE FRANK COSUINS LAND  a game by cody Pinnick<br/>A six level, one world, playable experiment.</p>\n<p>Runs above in browser, but it's a little clunky. The downloadable version is better and has gamepad support!</p>\n<p>-----STORY----\r\n  </p>\n<p>Two cousins, who are not brothers or plumbers (they're car mechanics) found a secret tunnel behind their car service center in Staten Island! The tunnel leads to the magical world of the Peps, pepper people ruled over by the kindly and beautiful Princess Pepper. Unfortunately, the world of the Peps is in chaos because Princess Pepper has been kidnapped by Staglor, king of the evil Beetle tribe! Can Frank and his cousin Leonard fight off Staglor's bugs and save the princess?\r\n  </p>\n<p>----CONTROLS---\r\n  </p>\n<p>WASD - move\r\n  </p>\n<p>J – jumps</p><p>K- runs/shoots fire (if you have the powerup)</p>\n<p>----WHY DID YOU DO THIS----\r\n  </p>\n<p>I wanted to challenge myself to recreate a game that is like another popular franchise about jumping on stuff, just for fun. I feel like I got pretty close! There's one world of six levels in the game now, but I might make more if people enjoy it or I need a break from other projects, who knows! Either way I had fun making this and I hope you have some fun playing it. Find all the secret pizza coins and you can unlock an area with some cut content you can play around with!\r\n  </p>\n<p>----CREDITS---\r\n  </p>\n<p>art/programming/some sfx – cody Pinnick in Clickteam Fusion 2.5 and LapChirp\r\n  </p>\n<p>music from various 8-bit music packs I bought from Snabisch who does great work!\r\n</p>", "metacritic": null, "released": "2021-08-17", "tba": false, "updated": "2021-09-09T00:05:21", "background_image": "https://media.rawg.io/media/screenshots/432/43286011516c64949224ca7750ef06a7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 35, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["cthomaspinnick"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}