{"id": 661601, "slug": "viaja-baraja", "name": "Viaja Baraja", "name_original": "Viaja Baraja", "description": "<p><em>¡Únete a Vale, Tilde y Nehúen en un viaje lleno de emociones! Recorre nuevos paisajes, camina las sendas hasta la cima del monte Milpasos y ayuda a tus amigues a atravesar momentos difíciles de sus vidas íntimas.</em></p>\n\n<p>      </p>\r\nSobre el juego\r\n<p><strong><em>Viaja Baraja</em></strong> es una novela visual latinoamericana en la que juegas cartas para tener conversaciones íntimas con tus amistades.</p>\n<p>Recién graduada de la secundaria, emprendes un viaje en camioneta con tus amigues para conocer nuevos paisajes y escapar de las decisiones que debes tomar sobre tu futuro. Durante el viaje recorrerás sitios que remiten a diferentes locaciones de nuestro continente y ayudarás a tus tres amigues —Vale, Tilde y Nehuén— a enfrentarse a problemáticas sociales y personales que afectan a la juventud de nuestra región. En estas conversaciones, deberás jugar cartas que representan emociones y características de tu personalidad, decidiendo cómo te quieres expresar en cada situación. De esta manera, profundizarás tus amistades, y tú también cambiarás, ganando nuevas cartas y perdiendo otras más viejas. Con un poco de suerte, regresarás a casa con las cartas necesarias para enfrentarte a la decisiones que ahí te esperan.</p>\n<p>       <br/>\n</p>\r\nVale\r\n<p>Responsable, confianzuda y optimista, Vale es una atleta con una gran pasión por el deporte.</p>\n\r\nTilde\r\n<p>Elegante, relajade e inteligente, Tilde es una persona muy social y une excelente fotógrafe que está todo el día subiendo publicaciones a sus redes.</p>\n\r\nNehuén\r\n<p>Gracioso, ocurrente y confiable, Nehuén es un muchacho que se la toma a la ligera y no se hace muchos problemas por la vida. </p>\n<br/>\r\n\r\nDesarrollo\r\n<p>Viaja Baraja fue desarrollado por Matajuegos en colaboración con la Fundación SES como parte del programa SPORTIC.</p>", "metacritic": null, "released": "2021-08-17", "tba": false, "updated": "2021-09-08T23:54:26", "background_image": "https://media.rawg.io/media/screenshots/710/7102f95f38f94ccedff09dde114dea3f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 197, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["David T. Marchand", "Mer Grazzini", "PfQ~", "Matajuegos", "Fundación SES", "FedeCardi"], "genres": [], "publishers": [], "esrb_rating": null}