{"id": 66173, "slug": "football-pixel-kick-2016-champions-big-win-opportu", "name": "Football Pixel Kick - 2016 Champions (big win opportunities for everyone who are soccer fans)", "name_original": "Football Pixel Kick - 2016 Champions (big win opportunities for everyone who are soccer fans)", "description": "Football is favorite game of all world. If you are passionate about it  you can test your aim in our football pixel kick game. This is free game here you can shoot on a free throw in the field gates. our game have various football fields combinations, so the bigger game level the harder will be to kick goal. In this game you'll be  goal scorer who scores goals in every mach and leads own football team forward to victory. To kick goal you just need to trace the trajectory of the ball and press with your finger then it show toward gates.  Each level can be required in any area of the field, so the angle of the shot may be different and the difficulty increases.<br/><br/>Talking about football in countries level this is very popular sport in Italy, also its top 10 sport game over 51 countries including UK, Japan, Netherlands, Turkey, Spain, Germany &amp; France, Belgium, Greece and etc! Even now lots of people tracking football champion league or uefa  2016. So don't be on side came and play with our play game, and feel football in your heart.<br/><br/>Pixel Football kick game is a very happy soccer simulator of pixel style. Here you can play soccer (football) with all your emotions. Your pixel ball are easy to control and score goal, once you try to play this pixel ball game you  understand how to deal with it. Try out and you become passionate about all football pixel goals. Have you got what it takes to score the match winning goal? Recreate your favorite goals in this unique football based pixel game. Football fan or not, this app will keep you entertained for hours!<br/><br/>Here you can become a real football star, scoring spectacular goals, just press on pixel ball and make your perfect strike!  Here you can be the most valuable player and bring your team to victory in the football 2016 or even 2018 championship.  Play game every day and improve your skills, and become number 1 teams in Europe.<br/><br/>Download Now 2016 Football Pixel Kick Goal game, and have hours of fun playing favorite game!", "metacritic": null, "released": "2016-06-29", "tba": false, "updated": "2019-07-29T08:58:12", "background_image": "https://media.rawg.io/media/screenshots/87b/87b4cd9e0dda0312bd8ba587a85328f4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 47, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Armantas Pranaitis"], "genres": ["Action", "Arcade", "Casual"], "publishers": ["Armantas Pranaitis"], "esrb_rating": null}