{"id": 66179, "slug": "fun-pool-party-sun-tanning", "name": "Fun Pool Party - Sun & Tanning", "name_original": "Fun Pool Party - Sun & Tanning", "description": "Fun Pool Party Sun &amp; Tanning is a free mobile game for girls and kids. Do you want to play in swimming pool with your friends and family? You can teach your kids that how to swim? then this is the right educational game for your kids. Everyone wants to go for crazy fun pool party. There are lot of fun activities for pool party sunshine. High school girls and boys are very crazy to have some real &amp; amazing joy with friends in this pool game.<br/><br/>There are many different levels in this pool party game:<br/><br/>* Choose from the many levels of this swimming pool party game<br/>* Apply some sun protect skin creams before swimming in the pool<br/>* DressUp with different bikini, swim suits, hairstyles and skin care creams<br/>* Prepare your swimming dressUp bag with many necessary items<br/>* Prepare some yummy fruit salads and juices for good health<br/>* Play with different balls and swimming tubes<br/>* Clean the garbage from swimming pool and kill the germs<br/>* DressUp your swimming pool with chairs, umbrella and flowers<br/>* Help your hands and foots with manicure and pedicure<br/><br/><br/>It is the free entertaining pool party educational game for toddlers and girls. You can wear the sunglasses, shoes , hats and swimming suits in this pool game. Help your kids to enjoy in this funny pool party crazy game. Enjoy this summer holidays with your family and friends in this seaside pool party game. Show your swimming skills and help your kids to learn the swimming and enjoy cool water in these summer vacations.<br/><br/><br/>Make your kids summer holidays more memorable and enjoyable by visit this seaside swimming pool. You can makeover your kids with beach outfits before pool party activities. You can wait for our upcoming cooking, dress up, makeup and makeover games. Remember, It is the FREE pool party Sun &amp; Tanning game to have some real Fun.<br/><br/>TinyBit games, tiny masterpieces !", "metacritic": null, "released": "2017-07-06", "tba": false, "updated": "2019-10-22T14:27:10", "background_image": "https://media.rawg.io/media/screenshots/6a7/6a79b5d946a8f06304b87ab0ab8beccd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 96, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["stefano frasi"], "genres": ["Adventure", "RPG"], "publishers": ["stefano frasi"], "esrb_rating": "Everyone 10+"}