{"id": 661957, "slug": "ashland-dossier-demo-psyrob", "name": "Ashland Dossier Demo (PsyRob)", "name_original": "Ashland Dossier Demo (PsyRob)", "description": "<p>1960, Cold War. Atrocities of WWII are almost forgotten. Nonetheless, a special task force is set out to hunt Nazis down. As its leader, you will be gathering evidence of war crimes against them and bringing these criminals to justice.</p>\n<p>«Ashland Dossier» is an espionage thriller packed with elements of turn-based stealth tactics and role-play adventure. Use your cunning, agility, and wit to finish off the Nazi plague for good this time. Ahead of you lies a deadly confrontation as the enemy threatens to drive the world into the depth of dreadful and pointless war once again.<br/><br/><br/>After WWII, numerous Nazis managed to slip through the cracks and escape overseas. Like rats, they scattered around the world to hide in shadows believing that the long arm of justice will never reach them. However, this is one fatal delusion.<br/>In the late 1950s, a private investigative organization has been formed. INCU (International Nazi Crime Unit) has only one specific goal in mind: to find such criminals and get them back for a fair trial.<br/><br/>You will assume the role of an officer that is looking for a group of the most rotten scoundrels. In the past, all of them committed extremely heinous crimes which are still left unpunished. Your goal is to find their trail, gather all the possible evidence, and finally bring them to justice.<br/><br/>Easier said than done, though. There is another new force that has just appeared out of nowhere – «Ashland». Unfortunately, these people will stop at nothing in their decisive effort to help runaway Nazis...<br/><br/></p>\n<ul><li>Tense operations that include pinpointing, following and extracting a suspect\r\n</li></ul>\n<ul><li>Rich lore and backstory of the unfolding events\r\n</li></ul>\n<ul><li>Scrupulous analyzing of intel, evidence, and witnesses’ testimonies\r\n</li></ul>\n<ul><li>Two playable timelines: 1960-1964 and 1941-1945\r\n</li></ul>\n<ul><li>Unique characters, unexpected plot twists, multiple endings\r\n</li></ul>\n<ul><li>A deep and realistic look into the truthful dreads of WWII</li></ul>\n\r\nMy cause was justice, not vengeance.\r\nSimon Wiesenthal (1908-2005)\r\nNazi hunter\r\n\r\nThe full game is coming out Q4 2021, so please wishlist it if you liked it!", "metacritic": null, "released": "2021-08-16", "tba": false, "updated": "2021-09-09T01:32:46", "background_image": "https://media.rawg.io/media/screenshots/5d3/5d3c2f4e36bdadbcc380b2523c555ec4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 125, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["PsyRob"], "genres": ["Adventure", "Simulation", "Puzzle"], "publishers": [], "esrb_rating": null}