{"id": 662078, "slug": "mission-mars-2047", "name": "Mission: Mars 2047", "name_original": "Mission: Mars 2047", "description": "<p><em>***Description en français plus bas***</em></p><p><strong>The challenge :</strong></p>\n<p>In june 2021, I've decided to defy myself with a 60 day challenge. <br/></p>\n<p>The challenge? Learn the basics and create my very first mini game. I've choose to create a classic retro arcade space shooter called \"Mission : Mars 2047\" with Game Maker Studio 2. </p>\n<p>For the challenge, I have to go through everything : draw the objects, make the sounds, import them to GMS 2, learn GML, program the game, etc.</p>\n<p>The game still in development, but you could download it right now for free!</p>\n<p>I also want to publish the game online, so you will be able to play on your browser. </p><p><strong>How to play :</strong></p><p>To play, you only need a Windows PC,  a mouse and of course a spider sense to dodge the lasers. ;)\r\n</p>\n<p><em>Here's how to control your ship :\r\n</em></p>\n<p><em>Move forward : mouse right click\r\n</em></p>\n<p><em>Move direction : mouse direction\r\n</em></p>\n<p><em>Shoot : mouse left click</em></p>\n<p><strong>The story : </strong></p>\n<p>Year 2047... </p>\n<p>The planet Earth was unhabitable, due to 150 years of massive industrialization.</p>\n<p>The human kind have to find a new home... </p>\n<p>We decided to create an international space exploration corporation, called I.S.E.C., to build a colony on the red planet. </p>\n<p>After 22 years of works, we're ready. An hundred of terrians have gone to Mars and start to lived in the very new colony... but we doesn't know we're not alone over there... </p>\n<p>The locals start to attack our colony, or as some people say, they try to protect they're land... </p>\n<p>To protect the colony, we have to count on the G.U.A.R.D.I.A.N.S., a special space force team lead by Captain Morrisson, an experiment leader. </p>\n<p>But we only have one ship to defend ourselves...</p>\n<p>/////////////////////////////////</p>\n<p><strong>Le défi :</strong></p>\n<p>En juin 2021, j'ai décidé de me lancer un défi 60 jours.\r\n</p>\n<p>Le défi? Apprendre les bases et créer mon tout premier jeu vidéo. Étant un fan incontesté de jeux d'arcade rétro, j'ai opté pour un bon vieux \"space shooter\" dont le but ultime est de battre le meilleur score!\r\n</p>\n<p>Pour réussir mon défi, je devais : choisir la plateforme de création, dessiner les objets, créer les audios, apprendre le language GML, programmer le jeu, etc.\r\n</p>\n<p>Le jeu demeure en développement pour le moment, car j'aimerais lui ajouter quelques fonctions supplémentaires et le publier en ligne afin que tu puisses y jouer en ligne sans le télécharger, directement sur ton navigateur.\r\n</p>\n<p>Mais en attendant, tu peux le télécharger gratuitement dès maintenant sur la plateforme itch.io.</p><p><strong>Comment jouer :</strong>\n</p>\n<p>Pour jouer, tu as simplement besoin d'un PC Windows, d'une souris et bien entendu d'un sens d'araignée (précognition) pour éviter les lasers!</p>\n<p><em>Voici comment contrôler ton vaisseau :</em></p>\n<p><em>Avancer : clic de droit sur ta souris</em></p><p><em>Direction : l'angle de la souris</em></p><p><em>Tir : clic de gauche sur la souris</em></p>\n<p><strong>L'histoire :</strong>\n</p>\n<p>L'an 2047...\r\n</p>\n<p>La planète Terre est désormais inhabitable, conséquence des 150 années d'industrialisation massive.\r\n</p>\n<p>La race humaine doit se trouver une nouvelle maison...\r\n</p>\n<p>La communauté internationale a décidé de créer une agence d'exploration spatiale, nommé I.S.E.C., avec pour mission de construire une colonie sur la planète rouge.\r\n</p>\n<p>Après 22 ans de préparation et d'efforts, nous sommes enfin prêts. Un peu plus d'une centaine d'humains ont été envoyés sur Mars afin d'y vivre, d'entretenir et d'agrandir les installations. Mais nous nous doutions pas que nous étions pas seuls à vivre...\r\n</p>\n<p>Les locaux (martiens) ont commencés à attaquer la colonie, ou comme certains le disent, à protéger leurs terres.\r\n</p>\n<p>Afin de protéger le dernier espoir de l'unité, nous devons compter sur les G.U.A.R.D.I.A.N.S., une unité spéciale dirigée par le capitaine Morrisson de la force d'armée spatiale internationale.\r\n</p>\n<p>Mais nous n'avons qu'un seul vaisseau pour assurer notre sécurité...\r\n</p>", "metacritic": null, "released": "2021-08-16", "tba": false, "updated": "2021-09-09T02:11:37", "background_image": "https://media.rawg.io/media/screenshots/ac2/ac2d202c1128e8ddfee49d832d47b42e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 47, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Totalement Geek"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}