{"id": 662192, "slug": "monkey-water-balloon-toss", "name": "Monkey Water Balloon Toss", "name_original": "Monkey Water Balloon Toss", "description": "<p><strong>Monkey Water Balloon Toss</strong> is a 2-player co-op game where you play as two monkeys challenging themselves to toss a steadily increasing number of water balloons back and forth to each other for as long as they can! Catching a balloon after the other player throws it earns you a point, but if even one water balloon hits the ground, it's game over! So grab a friend and toss water balloons back and forth as many times as you can in this frantic fun skill game!<br/></p>\r\nCONTROLS\r\n<ul><li><strong>Player 1 (WASD Keys)</strong><ul><li><strong>A,D                                        -move left/right</strong></li></ul><ul><li><strong>W                                           -jump</strong></li><li><strong>W (holding balloon)   -toss balloon (hold for extra power)</strong></li></ul></li><li><strong>Player 2 (Arrow Keys)\r\n</strong><ul><li><strong>Left,Right                          -move left/right<br/>\n</strong></li></ul><ul><li><strong>Up                                          -jump\r\n</strong></li></ul><ul><li><strong>Up (holding balloon)  -toss balloon (hold for extra power)</strong></li></ul></li></ul>\n<p>This game was developed in 3 hours* for Trijam #133! The theme is \"Don't drop it!\" Because of the limited amount of time, there is no partner monkey AI, so having a second player is pretty doggone necessary to play this game. Perhaps these monkeys will see some updates in the near future! Maybe a single player mode, 4-players, a versus/battle mode, or even online multiplayer if I'm feeling ambitious! Who knows?? Let me know what you think!</p>\n<p>*From the time I opened GameMaker Studio to the point of having the fully functioning game is what took almost 3 hours exactly. Before those 3 hours, I spent hours planning, writing some pseudocode, downloading sound effects and music, and creating the monkey sprites and beach background. After the 3 hours of development, I added the start screen and game over screen and also added the music and sound effects. I also did some final touch ups. By most others' criteria, I'd say I spent more like 5 to 6 hours developing the game. I hope to try another Trijam to actually only spend 3 hours developing.</p>", "metacritic": null, "released": "2021-08-16", "tba": false, "updated": "2021-09-09T02:41:20", "background_image": "https://media.rawg.io/media/screenshots/c77/c7719fa764b41306a088e0ab12a785e9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 49, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["aptBenj"], "genres": ["Action"], "publishers": [], "esrb_rating": null}