{"id": 662255, "slug": "dont-drop-it-kaffe", "name": "Don't Drop It (Kaffe)", "name_original": "Don't Drop It (Kaffe)", "description": "<p>Don't Drop It is a beautiful casual arcade-like game where you try to balance a glowing ball on a platform against AI enemies.</p>\n<p>Your objective is to keep the ball on the platform for as long as you can.</p>\n<p>In Don't Drop It you don't get weapons, but you get a deployable <strong>forcefield</strong> you can use to fend off enemies and prevent them from dropping the ball.</p>\n<p>I'm planning on adding additional features if this game is well received, power-ups, news levels, different AI for enemies, basically making the game more interesting.</p>\n\n<p>The objective here is to keep the ball on the platform but also to increase your score. You have 3 ways to do that.</p>\n<ul><li>Wait. Your score slowly increases over time.</li><li>Yeet enemies off the platform. Whenever an enemy falls off the platform your score increases by <strong>200</strong>. You can use your forcefield to assist you with this.</li><li>Deactivate the enemy spawn pads. Doing that not only increases your score by <strong>1000, </strong>it also stops enemies from spawning on that platform for <strong>30 seconds</strong>.</li></ul>\n\n<p>WASD/Arrow Keys - Move your character.</p>\n<p>Space Bar - Deploy Forcefield</p>\n<p>ESC - Restart</p>\n<p>(I'm pretty sure it also works with controllers but I'm not sure. Why don't you tell me? :D )</p>\n\n<p>During my tests the WebGL build has been tricky to work with. The game looks horrible and the game freezes sometimes. I am deeply sorry about that. I couldn't get Unity to properly build the game for browsers. If you play the browser version please be aware that it is not a faithful representation of the full game, please please please give the Windows/OSX build a try. Your experience will be much much much better, I promise. Thank you.</p>\n\n<p><strong>Made by me</strong></p>\n<p>Game was made with Unity<br/></p>\n<p>VFX were made using Unity Shader Graph</p>\n<p>3D Assets made in Blender</p>\n<p><strong>Other Sources</strong></p>\n<p>Skybox, BGM and SFX.</p>", "metacritic": null, "released": "2021-08-16", "tba": false, "updated": "2021-09-09T03:01:49", "background_image": "https://media.rawg.io/media/screenshots/4dd/4dd12d697eacfd88ac916212973f18c3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Web"], "developers": ["kaffe"], "genres": ["Action"], "publishers": [], "esrb_rating": null}