{"id": 66221, "slug": "bun-wars-free-best-of-fun-for-boys-girls-and-kids", "name": "Bun Wars Free: Best of fun for Boys Girls and Kids", "name_original": "Bun Wars Free: Best of fun for Boys Girls and Kids", "description": "It's a time to DEFEND your castle by playing unique strategy Tower Defense game - Bun Wars!<br/><br/>      Bun Wars is a new world with immersive atmosphere and great battles, excellent graphics! <br/>      Defence your castle from the crowds of enemy units, which sets new large-scale standards in tower defence genre.<br/>     In this world players have the opportunity to feel great strategists. Great not without purpose.<br/>     There are very many enemies - up to 5000 units per battle, and 1000 units per attack, and they all rush to the gate of the castle. <br/>     The only result is to win or be defeated. <br/>     All the sceneries of the game Buns Wars have been hand drawn, and the availability of advanced artificial intelligence of the units makes the game more exciting and dynamic, and provides an opportunity to develop a large number of defense tactics. <br/>     Give battle, you are the only hope for repelling the attacks of evil and powerful enemy buns in this story. <br/><br/>FEATURES of the Full version: <br/><br/>1. Universal application (iPhone, iPod touch, iPad) <br/>2. 3D landscape <br/>3. 2 worlds and 24 exciting battles <br/>4. 25 cool monsters + defenders <br/>5. 4 types of towers, each of which has three levels of improvement <br/>6. The height of the landscape affects a long range of towers and enemy units <br/>7. All the buildings are in close collaboration with the enemy units (can be attacked and destroyed.) <br/>8. Freedom in the construction of the towers and obstacles <br/>9. Advanced artificial intelligence of units <br/>10. A large number of units involved in the battle at the same time (up to 1000 units per attack) <br/>11. Excellent graphics <br/>12. Colorful effects, built on a system of particles <br/>13. Cool fight action game and fun war strategy<br/>14. Support of the Game Center <br/>15. Free updates<br/><br/>Defence a Kingdom, Save a Castle, Became a defender, a hero and the last hope of the world, Give the battle for the army of the evil buns!<br/>Solve the puzzle using logic to destroy evil plan of destroying the whole world! Save a life, save a justice! <br/>It's not a line game, you should develop a really great strategy to defence your kingdom!<br/><br/>Have fun!<br/><br/>We hope it would be intresting as for girls, boys, teens and as for adults and kids!<br/>Play the best top only pocket strategy games! <br/>Find us on www.facebook.com/FirePlusTeam <br/>GamePlay Video http://youtu.be/S9IGBDcGRIE <br/>Follow us on twitter.com/FirePlusTeam<br/>Tell about us to you friends", "metacritic": null, "released": "2012-11-29", "tba": false, "updated": "2019-07-29T09:50:33", "background_image": "https://media.rawg.io/media/screenshots/bff/bff9362549297c87fc41a0cf30cd0315_VIByCXB.jpg", "website": "https://www.facebook.com/FirePlusTeam", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 74, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Eugene Mikhalevskiy"], "genres": ["RPG", "Strategy"], "publishers": ["Eugene Mikhalevskiy"], "esrb_rating": "Teen"}