{"id": 662344, "slug": "mrtreemp", "name": "Mr.Treemp", "name_original": "Mr.Treemp", "description": "This game is a 2d platformer, parkour, adventure. The protagonist of the game is a kind of typical misfit, from the \"simple folks\", trying to get to <br/>\r\npower. As it usually goes with this kind of people, he cannot set the boundaries of his success. He wants to go higher and higher. In this game <br/>\r\nyou will help him achieve this boundless success.<br/>\n<br/>\r\n.1.Player control.<br/>\r\n      ~ Move the hero to the left - key on the keyboard to the left<br/>\r\n      ~ Move the hero to the right - keyboard key to the right<br/>\r\n      ~ Hero jump up - keyboard key up<br/>\r\n2. Control characteristics.<br/>\r\n      ~ While jumping up, you can continue to hold down the right or left moving key, the hero will move up and to the right or up and to the left.<br/>\r\n3.Physics of the hero's movement.<br/>\r\n      ~ The hero can be motionless only while standing on the plane, which are the platforms depicted in the form of stylized brickwork.<br/>\r\n          If the hero is not on the platform, he will fall down until he is on any platform. When the hero falls down freely, it is impossible to control <br/>\n<br/>\r\nhim.<br/>\r\n          At the moment of  jumping up when it reaches its maximum point, movement in the \"air\" to the right, to the left within a small range is <br/>\n<br/>\r\npossible.<br/>\r\n         This is done for the comic behavior of the hero.<br/>\r\n      ~ The movement of the hero takes into account energy, strength, speed and acceleration.<br/>\r\n      ~ The longer the hero runs, the greater his speed and strength of the jump, and the height he can jump. In other words,<br/>\r\n          if the hero accelerates before jumping, he will be able to jump to a greater height than jumping from still position.<br/>\r\n4. What is your purpose in the game?<br/>\r\n     ~ Collect virtual money in the form of coins, admiration and approval of fans and voters in the form of hearts.<br/>\r\n     ~ Move to another level of the game.<br/>\r\n     ~ Everything that was written in point # 3 also depends on the inner energy of the hero. At the beginning of the game, the hero's <br/>\r\n        internal energy is 200 units. With each jump, the energy decreases by 2, 4, 7 units, depending on the difficulty of the game: Easy, <br/>\r\n        Complicated, Heavy. It may turn out that the internal energy drops to a value at which the hero cannot jump even on a platform <br/>\r\n        close to it. To prevent this from happening, you need to eat caramel in the form of green maple leafs. This gives a 20 units of energy <br/>\r\n        boost for every green caramel eaten.<br/>\r\n    ~  At all levels, green caramel is more than necessary. The hero will not lack energy if you play with the set difficulty Easy. But for<br/>\r\n        the Complicated and Heavy levels, it may not be enough. Therefore, at the levels difficulties Complicated and Heavy, especially<br/>\r\n        Heavy, you need to think over the route of movement of the hero so that you collect all the coins, hearts, the required amount of green <br/>\r\n        caramel in one non-repeating route. In order not to make unnecessary jumps.<br/>\r\n    ~  There is also a brown, burnt caramel on the playing field. Upon contact with the caramel, the hero loses 10 units of energy. The <br/>\r\n        hero needs to stay away from it. But it has one useful feature. If you touch it not slowly <br/>\r\n        (passively) but with considerable speed and strength, then the direction of movement of the hero will change to the opposite, and <br/>\r\n        the strength of the jump will double. For instance, you need to jump onto a very high platform, the hero does not have enough<br/>\r\n        energy to jump. Under the platform there is a brown burnt caramel. You need to jump so that the hero falls on the burnt caramel <br/>\r\n        from above. After that, the direction of movement of the hero will change to the opposite (he will fly up), and the strength of the<br/>\r\n        jump will increase twice from the current one. Since the strength of the jump also depends on the internal energy of the hero, <br/>\r\n        in this way he can jump very high. This is only valid for this jump. For this you will lose 10 units of internal energy.<br/>\r\n    ~ Red spears. When hitting them, the hero starts the current level from the beginning. Try not to hit them.<br/>\r\n5. How to start playing.<br/>\r\n    ~ After starting the game, you will find yourself in a menu consisting of items:<br/>\r\n                                      ~ Game<br/>\r\n                                      ~ Game settings<br/>\r\n                                      ~ New Game<br/>\r\n                                      ~ Help<br/>\r\n                                      ~ Quit<br/>\r\n    ~ Menu items can be selected by moving through them with the  Up    Down   Enter  keys on the keyboard or by selecting them <br/>\r\n       with the left mouse button.<br/>\r\n    ~ To start a new game, select Game settings and the difficulty of the game. The default difficulty of the game is Easy.<br/>\r\n    ~ Next select New Game. You will be taken to the beginning of the first level playing field.<br/>\r\n    ~ After passing the level and entering EXIT on the playing field, you get to the next level and so on.<br/>\r\n    ~ If you exit the game in the menu, the current game is saved automatically.<br/>\r\n    ~ You can quit the game completely through Quit. When you restart the game, select the Game menu item and the game will start <br/>\r\n        from the level and from the place where you last stopped.", "metacritic": null, "released": "2021-09-06", "tba": false, "updated": "2021-09-10T02:26:57", "background_image": "https://media.rawg.io/media/screenshots/66a/66a822deb5dd8fd27772b8dd37f1bc68.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 93, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Saranchov Serhii"], "genres": ["Adventure", "Indie"], "publishers": ["Saranchov Serhii Games"], "esrb_rating": null}