{"id": 662366, "slug": "placebo-love", "name": "Placebo Love", "name_original": "Placebo Love", "description": "When Lorne Volley answers a mysterious email from Lady Love he quickly finds his soulmate. <br/><br/>Twice. <br/><br/>Twin strangers who look alike, talk alike, and live similar lives.<br/><br/>You are Lorne's silent Muse. His guiding hand. His inspiration.<br/><br/>Draw him from his loneliness to connect with acquaintances, reunite with family, and explore the ebbing romances of two distant cities. Maybe you'll unravel his doppelganger dilemma and reveal true love. Or maybe he'll end up alone.<h3>KEY EXPERIENCES</h3><br/><ul><li><strong>FOMO:</strong> Navigate a tight schedule of diverse bonds<br/></li><li><strong>HONESTY:</strong> Choose when to tell the truth or hide those feelings<br/></li><li><strong>FUTURES:</strong> Unlock multiple endings by juggling contacts<br/></li><li><strong>INSPIRATION:</strong> Be the gentle push and pull of lonely lives</li></ul><h3>OTHER FEATURES OF NOTE</h3><br/><ul><li>Narratively rich. Like a dense brownie made of book parts. Expect a lot of good reading.<br/></li><li>Gorgeous soundtrack by Lannie \"Merlandese\" Neely III and Fernando \"Ferdk\" Carabajal. We're proud of it.<br/></li><li>LGBTQ+ inclusion.<br/></li><li>A schedule system. That's the heart of it. Think of, like, a Persona game but with none of the dungeon-y stuff.<br/></li><li>Alcohol is represented and in some cases abused. Be careful.<br/></li><li>Sex is implied and mentioned in some cases, but is never the focus.</li></ul>", "metacritic": null, "released": "2021-09-07", "tba": false, "updated": "2021-09-10T02:42:30", "background_image": "https://media.rawg.io/media/screenshots/8ac/8accfead37568dcafc8e029826cfdf3e.jpg", "website": "https://www.twelvetiles.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 299, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Twelve Tiles"], "genres": ["Casual", "Indie"], "publishers": ["Twelve Tiles"], "esrb_rating": null}