{"id": 662343, "slug": "world-of-paranoia", "name": "WORLD OF PARANOIA", "name_original": "WORLD OF PARANOIA", "description": "WORLD OF PARANOIA is a dystopian world that offers you the power to play the role of a supercomputer in the not too distant future.<br/>\n<br/>\r\nRESEARCH NEW TECHNOLOGIES - Each new technology you research increases your chances of generating more resources, building new facilities, and controlling your citizens.<br/>\n<br/>\r\nBUILD YOUR UTOPIA- As the game progresses, you can build new facilities in your futuristic complex.<br/>\n<br/>\r\nBeware of TRAITORS! A citizen who is not happy is a traitor. A citizen who yearns for freedom is a traitor, and those who are criminals or belong to a secret society ... are the worst traitors!. Search for traitors using snitches, electric eyes or security robots. Many of your citizens are hiding a lot of secrets.<br/>\n<br/>\r\nSECRET SOCIETIES - The unhappy citizens will join secret societies . The 'Runners' will try destroy you with cyberattacks, The 'Drones' will demand equality of social classes from you or they will destroy your complex. The 'Dreamers' will live in a virtual world and will not be productive, The 'Cult of sirius' will be your ally as long as you are their God, 'Antirobots' will destroy your robots, and the 'Protechs' will murder the last ones to save robots ...  There are secret societies planned for the future of the game!.<br/>\n<br/>\r\nCONTROL YOUR CITIZENS - Give them happiness pills, lock them up in isolation chambers, , implant chips in their brains, clone them, or turn them into pure energy... use your imagination but be careful, they may rebel against you.<br/>\n<br/>\r\nAND GET READY FOR THE WAR - The attack from the other factions is eminent. Are you prepared for the endless war?.<br/>\n<br/>\r\nAre you capable of achieving hive mind consciousness?. Can you build the final utopia?. Will you defeat your enemies?...<br/>\n<br/>\r\nYour citizens are conspiring against you, it is essential to act quick. A WORLD OF PARANOIA.", "metacritic": null, "released": "2021-08-13", "tba": false, "updated": "2021-09-17T14:55:27", "background_image": "https://media.rawg.io/media/screenshots/e12/e12e373b5f769de02a7e70ff9cb7861e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 219, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["LeMachinga"], "genres": ["Strategy", "Indie"], "publishers": ["LeMachinga"], "esrb_rating": null}