{"id": 662367, "slug": "sin-unit", "name": "S.I.N. Unit", "name_original": "S.I.N. Unit", "description": "S.I.N. Unit puts you in the shoes of a paranormal investigator. Together with other people like you, you will enter haunted locations full of paranormal activity to investigate and catch the entity or ghost that haunts the place. A good entity will also appear to help you. 1-4 Players.<br/><br/>Beware it is no easy task. First gather all the information you can, use your equipment to your advantage: EMF readers, Holy Water, Thermometers, UV Flashlights, among many many others. Find all the evidence, discover what kind of entity or ghost is haunting the location and catch it for your collection!<br/><br/><br/><br/><br/><br/><ul><li>Prepare mentally, psychologically.<br/></li><li>Enter the haunted location.<br/></li><li>Find the Entity's or Ghost's current haunting spot.<br/></li><li>Gather evidence, fingerprints, temperatures below zero, doll possession, etc, etc...<br/></li><li>Discover the Entity's or Ghost's type.<br/></li><li>Catch it with the TOS (Trapper of Souls) device correctly configured for that kind of Entity!<br/></li><li>A good Entity will help you.</li></ul><br/><br/><br/><br/>Use the radio to speak to your team and tell them when you find new evidence. Together you can discover the truth and be able to catch the Entity. Up to 4 investigators can go on a mission together.<br/><br/><br/><br/><br/><br/>Whatever you do, do not forget, you are still human. You will be terrified of being near the Entity. Your Terror level will be displayed in the way your vision will lose the sense of color, also your heart will be louder and louder. Till you finally die. Use your items to prevent that from happening and DO NOT be near the Entity for long periods of time, especially... when It is hunting.<br/><br/>You will have an ally. A benevolent ghost that will help you. Listen carefully to her humming. Get close and you will lose all fear.<br/><br/><br/><br/>Thank you for your support! ♥", "metacritic": null, "released": "2021-09-07", "tba": false, "updated": "2021-09-10T02:43:45", "background_image": "https://media.rawg.io/media/screenshots/ae6/ae61a6f147bbad84d4a3d1e65b67f027.jpg", "website": "https://sinunit.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 334, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Carlos Alberto Martinez Carrillo"], "genres": ["Casual", "Indie"], "publishers": ["Carlos Alberto Martinez Carrillo"], "esrb_rating": null}