{"id": 66236, "slug": "movie-night-with-best-friends", "name": "Movie Night with Best Friends", "name_original": "Movie Night with Best Friends", "description": "Hey friends! Let’s hang out and plan a “Movie Night with Best Friends” today. Oh this friends party is going to be so much fun. We can run our own movie theatre, we can create all sorts of lovely posters for our movies, ummm maybe there needs to be some Theatre repairing as well. Can you just imagine how fun is popcorn making going to be and yes we would be having a great time at our very own snacks shop, so much soda, drinks, nachos and popcorns. Can we get a better chance than this to dress up all Stylish and fashionable just like a superstar and take loads of selfies. “Movie Night with Best Friends” is the greatest girl’s game for our winter vacations.<br/><br/>Can you just believe our luck that we have the BIG responsibility of carry out all duties of management team like arranging cinemas tickets, entering tickets payments on the cash register, help people find seats of the films, leading the production house, utilizing our cinematography skills for using flashlights and doing Photo-shoot. It’s also has been our dream to enter the cinema club and become good at dramaturgy. Be our date girl and have an awesome yet thriller weekend. <br/><br/>After all such duties of making public entertainment more fun for our friends we have got some other work up our sleeves like managing the silver screen throughout the picture show, we have to make sure the experience is so good for our friends that  movie rating goes up and it becomes a blockbuster hit. After all this trip adventure how can we forget cleaning up all the mess and making the place as neat and beautiful as possible. Finally after a long fun filled day it would be time to go home and have a steaming hot cup of coffee girls. Oh WAIT! Some car repairing needs to get done.  Time to show sore real skills and girl’s power during the “Movie Night with Best Friends”.<br/><br/>Come on date girl! Let’s list down all the thriller, trip adventure, fun activities we are going to be having this winter vacations:-<br/><br/>•\tGet the chance to do stylish and fashionable dress up like a superstar<br/>•\tTake selfies and get your photo-shoots done with proper flashlights<br/>•\tRunning the Snacks shop and giving out unlimited soda, drinks<br/>•\tDo some real friends party while popcorn making<br/>•\tDesign beautiful movie posters for the promotion of the movie<br/>•\tSelling the cinemas tickets for the picture show<br/>•\tUpdating the tickets payment entrees in the cash register<br/>•\tMake sure this comes out to be the best public entertainment<br/>•\tHelp your friends from the cinema club, find seats<br/>•\tMake sure the films rock the silver screen<br/>•\tHelp increase the movie ratings and turn them into a blockbuster hit <br/>•\tManage the dramaturgy, cinematography and production house<br/>•\tBecome professional in car repairing and theatre repairing<br/>•\tIt’s your duty to do the cleaning up as well<br/>•\tMake your weekend fun with this perfect hangout<br/><br/>“Movie Night with Best Friends” has turned out to be the most amazing girls game this winter.<br/><br/>What are you waiting for my Stylish friends? This girl’s game is more than what we bargained for.  Just imagine a thriller hang out or friend’s party arranged at the theatres. Prepare for the most awaited  “Movie Night with Best Friend” Let’s go dress up for this date girl it’s going to be so much fun, we will be taking endless selfies. Yes the snacks shop is going to be a mess after all the popcorn making and unlimited soda and drinks but we will be wasting no time in cleaning it up fast. Shout out to all the lovely friends who are equipped with fine car repairing and theatre repairing skills. Winter vacations or any random weekend has never been so busy yet fun. We better arrange some flashlights for some lovely photo-shoots. The production house is looking for girls with potential in cinematography and dramaturgy. Enter the cinema club to make some exciting movie posters and help find seats for the guests. Don’t miss this fun filled adventure.<br/><br/>TinyBit games, tiny masterpieces !", "metacritic": null, "released": "2018-01-16", "tba": false, "updated": "2019-10-22T14:27:11", "background_image": "https://media.rawg.io/media/screenshots/21d/21dd1ca459a9a3af5e2cae87e857c377.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 116, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["stefano frasi"], "genres": ["RPG", "Family"], "publishers": ["stefano frasi"], "esrb_rating": "Everyone 10+"}