{"id": 662336, "slug": "dirge-2", "name": "Dirge", "name_original": "Dirge", "description": "<h3>Introduction</h3>The early 20th century was rife with death and darkness on a global scale. The destruction and chaos of the Great War was quickly followed by a deep depression, only to be capped off with the horrors of the 2nd World War. Darkness on a much smaller scale such as brutal murders and abuse can on their own result in hauntings of tormented spirits and dark entities, the horrors of the turn of the century have thus cast the recovering world into a black shadow.<br/><br/>Across the world supernatural horrors that have long been suppressed since their days of myth and dominance are bleeding into the gaps left in the chaos of the wars. All corners of the globe have become infested by the restless spirits of betrayed soldiers, widowed wives, victims of criminal activity, and poor souls who have fallen victim to similar entities long lost to folklore.<br/><br/>Governments, organizations, and vigilantes who are aware of the battle against the dark entities creeping out of the gaps in the world move to keep the truth from the general populace. This is where our investigators draw their ranks. Government agents, men of faith, researchers, and vagabond hunters join forces to tackle the most dangerous of these dark entities in anguished locations across the globe. In Dirge you step into the post war era to explore the haunted mansion of Hillview. Your goal is to investigate the entity lurking there, discover its weaknesses, and defeat it... if you can.<br/><br/><h3>Investigator Gameplay</h3><br/>Dirge uses procedural code to randomize the item locations and types across the levels to make sure you never solve the same hunt twice. Keys to rooms will choose from hundreds of artist placed locations to spawn, as will clues, equipment, or haunted traps. Additionally we have produced extremely modular level assets which allows us to swiftly create and nest dozens of different floor plans and layouts for the same map sets, so no game in the mansion will ever be the same. This will help maintain a sense of the unknown even if it is your hundredth game in a level, as rooms and floor plans will have shifted along with the items you need to find and collect. Add this variation to the different survival strategies you have to employ to avoid being brutally murdered by the three different entities we plan to launch with, and Dirge should continue to be a thrilling game even years after its release.<br/><br/>While that is the design philosophy of our systems and sounds fun, the real question you have is \"Yes but what do you do, how do you play?\"<br/><br/>Well the short answer is, you explore the house and participate in a deadly scavenger hunt. The investigators enter the manor of Hillview with at minimum their light source and a revolver, and must find other equipment and weapons to help them succeed.<br/><br/><h3>Monster Gameplay</h3><br/>The dark entities are an entirely different case. Born into darkness, or perhaps corrupted into it, they move through the manor like they own the place. That is because they do. Many playable entities interact directly with the world, driving lesser spirits and creatures before them in terror, or perhaps gazing out at the investigators from frost rimmed mirrors as they stalk them from another realm. The entities of the house sometimes know what the investigators are looking for, seeing them highlighted in the world so they can plan their ambushes, other more powerful spirits don't bother conceiving what the living are doing in their realm, and simply allow their power and implacable presence win the day. Monster players move around the level much like a living investigator, however nearly all of them have ways of fast travel around the map. Some phase out of physical form so they can float at higher speeds and pass through doors, others climb in and out of mirrors using them as portals into 'the other side', and others potentially teleport. These abilities, as well as their lethal capabilities are generally governed by a resource, their rage. The encroachment of the living into their domain slowly builds their rage, and the actions of the investigators and the entity can either slow or speed up the accumulation of rage in the monster as its loathing grows. The player controlling the creature can then spend the rage on various abilities to help them find, haunt, and ultimately murder all of the interlopers.<br/><br/>The question simply becomes who will succeed first. Will the investigators finish their scavenger hunt, equipping them to destroy or banish the monster. Perhaps they have to burn the bones of the spirit, and finding the remains and the means to set it alight is their goal. Or perhaps finding the Bloody Maid's true mirror via clues in the world so they can shatter it is the only way to clear the house of her evil. Regardless, their time limit is how well the monster can play his deadly game of cat and mouse, hide and seek, and all the while both sides have very human intelligence working together or against one another.<h3>Features</h3><ul><li>1v4 Multiplayer Survival Horror.<br/></li><li>Multiple unique monsters to survive/murder with<br/></li><li>Multiple unique weapons to fight the creatures of the house.<br/></li><li>Collect equipment, items, and clues to defeat the Entities while they hunt you down.<br/></li><li>Use the environment to help hunt down the investigators.</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2021-09-10T02:22:01", "background_image": "https://media.rawg.io/media/screenshots/549/549039daf795bbdb596cd07ffe16ff55.jpg", "website": "http://non-nobis-games.com/games", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 54, "ratings_count": 0, "suggestions_count": 500, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["NonNobis Games"], "genres": ["Indie"], "publishers": ["NonNobis Games"], "esrb_rating": null}