{"id": 662364, "slug": "metal-swarm-infinity", "name": "Metal Swarm Infinity", "name_original": "Metal Swarm Infinity", "description": "Blast your way through an almost infinite number of procederally generated waves of enemies in this arcade style shoot 'em up as you rid the galaxy of the Metal Swarm menace. Collect powerups to access special weapons, face off against 5 unique and gigantic bosses then harvest their power cores to unlock powerful upgrades for your own ship!<br/><br/>Choose between three game modes and decide what kind of challenge you want!<br/><ul> <li>Arcade Mode - Battle through 50+ waves of enemies, defeat each of giant bosses and set the highscore in classic arcade style shoot 'em up gameplay.<br/></li><li>Practice Mode - Hone your skills on just the first 25 waves and practice fighting each of the bosses with additional starting lives and more forgiving mechanics.<br/></li><li>Deathwish Mode - Want a ultimate challenge? Start with just 1 life and see how long you can survive in this fiendishly unforgiving challenge mode.</li></ul><br/>Complete in-game achievements to unlock a variety of additional bonus content along the way.<br/><ul><li>40 Steam Achievements - Every in-game award also unlocks an equivalent Steam Achievement.<br/></li><li>Ship Cosmetics - Unlock a variety of cosmetic skins for your ship that visually show off your achievements.<br/></li><li>Retro Filter - Unlock the CRT \"Retro Filter\" and play the game with visuals that will make you like you're right there in the arcade.<br/></li><li><strong>And much more! All unlockable for free and earned through gameplay!</strong></li></ul><br/>Enable \"Streamer Mode\" to invite the H1V3M1ND bot to your stream and let your viewers vote in real time to influence events in game.<br/>Quick, simple and customisable Twitch Integration offering the following options:<br/><ul><li>Boss Voting - Let your viewers vote to decide your fate by deciding which of the 5 bosses you will face in battle next.<br/></li><li> Upgrade Voting - Let viewers spend your hard earned power cores, and choose which upgrade you can unlock.<br/></li><li> Player Override - And if you don't like their choices? You can have the option to overrule them.</li></ul><br/>", "metacritic": null, "released": "2021-09-07", "tba": false, "updated": "2021-09-10T02:41:07", "background_image": "https://media.rawg.io/media/screenshots/d98/d98f8f89cbfd962fedc67ffa20eaec69.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 184, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Andrew Nutter666 Jaggar", "George Dutton"], "genres": ["Action", "Indie"], "publishers": ["Andrew Nutter666 Jaggar"], "esrb_rating": null}