{"id": 662425, "slug": "stickman-brawl-super-warriors", "name": "Stickman Brawl :Super Warriors", "name_original": "Stickman Brawl :Super Warriors", "description": "Discover stickman brawl legends, martial arts, ultimate skills and nonstop one-on-one combats, through several places of Stickman brawl! Becoming stronger, faster, deadlier and compete against dangerous villains! Join the battle with your favorite manga characters and fighting in Stickman Battles across the anime.<br/><br/>A WHOLE NEW RANGE OF UNPREDICTABLE MAPS<br/>Stick brawl introduces several fighting stages, in which you and your warriors will be taking part in different levels, from bottom to the top. Starting from the Green Jungle, this condition appears to be nicely suitable for fresh brawl, but it could become more serious when you go deeper. You may not only find it struggling in The Forgotten Sand Valley, but unstoppable combats will make you and the shinobi unrested in The Mountains! Better prepare yourself because a moment of carelessness could result death!<br/>Don’t forget that you need to face a true boss at the end of each map. Bosses could be villains, elite ninjas or warriors with much experience in long-live wars, who could make you struggle for hours!<br/><br/>MORE NINJA, MORE SKILLS, MORE FIGHTS!<br/>Stick brawl contains a large variety of powerful ninjas and warriors, so feel free to choose a favorite character and discover this new world. Those masters of martial arts have unique styles of fighting, assassination and ultimate ninja skills, so if you could manage to combine the right fighters to the right combo, your phone would get multiple flashy effects which attracts people nearby! That’s how we want to play, too! More Shinobi, more friends, more fun!<br/>Also, it is recommended that you put volume up to get the most experience of this game. The sound effects for each ninja are different, so you can feel the intense of the combat!<br/><br/>SEVERAL FEATURES<br/>- Starting Character Pack, including some main warriors reliving your youth days.<br/>- 10 maps, 300 levels from easy to difficult levels, 30 bosses. Oh yeah, the bosses are more dangerous later, too!<br/>- More strength enhancement included, with rewards!<br/>- Intense fights among deadly ninjas, using assassination skills.<br/>- The higher result, the better rewards after each level.<br/>Enter this whole new world of elite ninja, fight for your live and glory! This would become one of the best stickman experiences that you can get!<br/>Download Stick brawl today, enjoy the stick game with your friends, relive those youth days from your favorite ninja!", "metacritic": null, "released": "2021-08-25", "tba": false, "updated": "2021-09-10T03:30:53", "background_image": "https://media.rawg.io/media/screenshots/3ee/3eeff8e1345983ed0933aca9c4fb8542_ymgkkJk.jpg", "website": "https://managamesgoglobal.blogspot.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 225, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Bui Van Son"], "genres": ["Action", "Adventure"], "publishers": ["Bui Van Son"], "esrb_rating": "Teen"}