{"id": 662407, "slug": "animalia-survival", "name": "Animalia Survival", "name_original": "Animalia Survival", "description": "<strong><h3>Thrive</h3></strong><br/>Can you imagine what it would be like to live as an african lion? Or what it'd be like to be apart of a giant buffalo herd in the african plains? Maybe you'll be chosen as the elephants family matriarch, or choose to be a nile crocodile, lurking beneath the water ready to lunge at prey at any second. <br/>Whatever path you choose, the choice is yours.<br/>Make the correct choices in order to see the next sunrise hanging over the savannahs horizon, and stay strong and alert in order to survive the ultimate battle between life or death! <br/><br/><br/><br/><strong><h3>Protect</h3></strong><br/>In Animalia you can live as your favourite animals! Fight and search across the land for food and water whilst doing your best to avoid predators, potential threats and rivals. Animalia is a game centered around the life cycle of the animal you've chosen, whether that be a buffalo, african lion, gazelle and more!<br/>The first scenery you'll come across on your journey to survival is the African continent. Here, you'll find all the typical species you'd find in real world Africa today, accompanied by a rich ecosystem and AI animals. Animalia is an online multiplayer survival game, allowing you to play with new or existing friends, surviving the African environment together in real time! <br/><br/><br/><br/><strong><h3>Adapt</h3></strong><br/>Animalia also offers you an amazing opportunity to choose and protect your territory, whilst also surviving as your favourite species from the animals perspective. Animalia is a must have for animal enthusiasts and survival simulator lovers.<br/>", "metacritic": null, "released": "2021-09-09", "tba": false, "updated": "2021-09-10T03:17:09", "background_image": "https://media.rawg.io/media/screenshots/238/238ae5026ca0ed44482f4c7e2e6730d2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 431, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["High Brazil Studio"], "genres": ["Action", "Adventure", "Strategy", "Simulation", "Massively Multiplayer", "Indie"], "publishers": ["High Brazil Studio"], "esrb_rating": null}