{"id": 66257, "slug": "heartbreaking-story-breakup", "name": "Heartbreaking Story - Breakup", "name_original": "Heartbreaking Story - Breakup", "description": "Girls and teen boys get ready for the real high school hear breaking love story adventure game. A girl is very much disappointed with her boyfriend and wants your help to give her a cool dressUp, spa, makeup and makeover to look more fresh and her ex-boyfriend may be again interested with her for a crazy date and movie in a cinema. Boy is a cheater, who involved in love with other girls while this cute girl was fall in love deeply with this boy. To steal your boyfriend from other girl is not an easy job. You need to behave positive, build trust, create the positive memories, build up your communication and remind him about the good old relationship days when your and he was very much happy.<br/><br/>Discuss the different subjects with your boyfriend, so your boyfriend like to spend lot of time with you and never go for the other girls. Flirt or kiss with your boyfriend and have some nice and fun time. You and your boyfriend should spend lot of time alone and show affection with established attraction through flirting, closeness and positive experience. If you are in a class and your boyfriend is not giving your time, talk to the other boys of class, get them to laugh. His jealous can provoke his to action. Keep yourself good and fit like eat hygiene , exercise and practice speaking in a mirror. Exchange some nice gifts with your boyfriend and girlfriend as well.<br/><br/>**** Features in this Heartbreaking Love Story Getting Over Breakup game **** <br/><br/>* It is a free Love story heartbreaking school girls crush game<br/>* There is thrill, adventure and Love story secret romance of other girl<br/>* Boyfriend has broken his girlfriend heart by getting fall in love with other girl<br/>* Boy has started flirt with other girl when both was in cinema for movie<br/>* Girl has found another boyfriend who is very much loving and cute<br/>* It is a free Love heartbreak kissing game for teens <br/>* Reveal the secret romance of boyfriend with other girl<br/>* Easy to touch and control with user friendly game play<br/>* Makeup, makeover, dressUp and dinner with music party with new boyfriend<br/>* High quality graphics games for school teens and school girls<br/><br/><br/>You can try for separating yourself from your ex-boyfriend or ex-girlfriend by getting involved in different activities like cut off all your contacts with them, avoid places where your ex hangs out, cleanse your space of reminders about ex. Channel your energy into new activities. You can wait for our upcoming cooking, dress up, makeup, love story romance crush game, kissing games, school teacher classroom, gymnastic, fashion blogger and makeover games. Remember, It is the FREE Game to have some real Fun.<br/><br/>TinyBit games, tiny masterpieces !", "metacritic": null, "released": "2017-10-29", "tba": false, "updated": "2019-10-22T14:27:12", "background_image": "https://media.rawg.io/media/screenshots/5ed/5edd0dcf9380074642b16bd9e27c92f1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 86, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["stefano frasi"], "genres": ["RPG", "Simulation"], "publishers": ["stefano frasi"], "esrb_rating": "Everyone 10+"}