{"id": 66264, "slug": "a-love-story-be-crazy-in-love", "name": "A Love Story - Be Crazy in Love", "name_original": "A Love Story - Be Crazy in Love", "description": "Love Story - be Crazy in Love is a real high school love story crush game for high school girls and boys. High school teen boy is getting ready for his first date with the girl of his dreams. He wants to looks gorgeous and amazing. So help him to choose best outfits with nice perfume and body spray to attract the attention of his girlfriend. He has to sort out his crazy beard and shave as well. Where on the other side, his girlfriend is busy for cooking &amp; decorating the cake for her boyfriend. Help the girl to decorate the cake with lot of ingredients to impress her boyfriend to make her first crush date more memorable.<br/><br/>Ohhh No !!! Boy’s car is damage and stop in the road, he is getting late and now he is much worried because his girls friend is waiting him. Hurry up, help the boy and fix his car and give a cool wash to make his car more new.<br/><br/>The girl has arranged a surprise party for her boyfriend. She has arranged a lovely table with a music party to impress the boyfriend. Help the girl to arrange the things quickly as boyfriend is on the way. Arrange the table, put cold drinks and then lighter the candles.<br/><br/>Love story - be Crazy in Love game features:<br/><br/>* A boy is going to propose his girlfriend in high school<br/>* Boy is getting ready with dozen of outfits and accessories <br/>* Girl is also very caring about her boyfriend and have crush on him<br/>* Boy usually offers some tea to girl in cafeteria <br/>* Girl looks very happy to receive some beautiful flowers from her first crush<br/>* Girl wants to design dresses with her own expectations <br/>* Girl is decorating the surprise Cake<br/>* Choose some accessories for designing of high school girl’s dress<br/>* High quality game for Kids, girls and high school teens<br/>* Easy to touch and control<br/>* Fun for children of school children and teens<br/>* Different gorgeous dresses to choose for girls and teens<br/>* Dozens of dress accessories for High school girls and boys<br/>* Lot of beautiful clothes colors<br/>* Fun accessories to complete the makeover are ready for endless combinations<br/>* Share your creations easily by Save in your images gallery<br/><br/><br/>Do not forget to play all of our other dressUp, makeup, makeover, cooking, love story, high school games, girls games.<br/><br/>TinyBit games, tiny masterpieces !", "metacritic": null, "released": "2017-07-15", "tba": false, "updated": "2019-10-22T14:27:12", "background_image": "https://media.rawg.io/media/screenshots/f53/f533de571fbd9a5e591cfb0f16f5dbd7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 93, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["stefano frasi"], "genres": ["RPG", "Simulation"], "publishers": ["stefano frasi"], "esrb_rating": "Everyone 10+"}