{"id": 662673, "slug": "commando-adventure", "name": "Commando Adventure", "name_original": "Commando Adventure", "description": "<p>Commando Adventure V.1</p>\n<p>Run-and-gun shooter genre</p>\n<p>Single Player Mode</p>\n<p>The player controls a soldier, who begins by opening a gate with a key, and must fight his way out alone. The game is armed with one assault rifle (which has unlimited ammo) as well as a limited supply of hand grenades at level 5. And can fire his weapon in any of the eight directions he faces, his grenade can only be thrown at the top of the screen, regardless of direction. faced.</p>\n<p>Unlike assault rifle bullets, grenades can be thrown to clear obstacles, and the explosion from a well-placed grenade can kill multiple enemies at once. At the end of each level, the player must pass through the gate and walk on to continue to the next level and to achieve the ultimate victory must pass 30 levels and one final stage. Extra life is given with 3 lives and every 1 life there is 10 energy and if it hits the opponent's bullet or touches it will be reduced (1) one in 10 (ten) energy</p>\n<p>How to play with a shoot button and a grenade throw button and a walk button in eight directions and another button to return to the start menu, stop button and restart the game from the current stage (android).</p><p>control for windows (keyboard) Ctrl and Shift</p>\n<p>click Enter to continue and to move use keyboard arrow</p>\n<p>All opponents can be destroyed with one bullet except against tanks with 10 bullets or one grenade and against enemy cars and large guns with only grenades but not with bullets</p>\n<p><strong>For Desktop PC</strong><br/></p>", "metacritic": null, "released": "2021-09-09", "tba": false, "updated": "2021-09-10T04:33:37", "background_image": "https://media.rawg.io/media/screenshots/6d1/6d1307f2bf8c0def0f361efddb004dbb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 121, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["AppDayDev"], "genres": ["Shooter", "Adventure", "Platformer"], "publishers": [], "esrb_rating": null}