{"id": 662724, "slug": "the-vii-enigma-demo", "name": "The VII Enigma [Demo]", "name_original": "The VII Enigma [Demo]", "description": "The VII Enigma \r\n<p><strong>The VII Enigma</strong><em> is a ground breaking sci-fi / mystery visual novel epic. Head down the rabbit hole and uncover the mysteries of a man set against the world. With many bad endings along the way, the player must navigate the path to the true ending and overcome the tyranny of time itself.</em></p>\r\nThis is the <em><strong>FREE DEMO</strong></em> of a much larger world...\r\n<p>The full game is already almost complete, and will release on Steam shortly. Read below for a rundown on the full game, and wishlist on steam here.</p>\n<p><strong><em>_________________________________________________________</em></strong></p>\n<strong><em>Who am I to decide the fate of the world?</em></strong>\n<strong><em>Why should I save it when it has stolen everything from me?</em></strong>\r\nSYNOPSIS:\r\n<p>In the year 2060, Dr Elijah Shaw awakens in a state of confusion, the only clue to his past a mysterious orb clutched in his hand. After being hauled in for interrogation by an agent of the totalitarian ruling faction known as <em>'The Bureau'</em>; Elijah is rescued by a small band of rebel fighters. Join Elijah and the rebels as they seek to untangle the web of deceit behind <em>'The Bureau's</em> control and to discover the secrets of Elijah's past.<br/><strong><em>Can you overcome the tyranny of time itself? Will you crack 'The VII Enigma'?</em></strong><br/></p>\r\nFEATURES:\r\n<ul><li>A deep, character based psychological story.<br/>\n</li><li>Dynamic kinetic action sequences.<br/>\n</li><li>A broad cast of complex characters set in an intricate world.<br/>\n</li><li>Bad endings, normal endings, and one 'true' ending; all reached based upon your choices.<br/>\n</li><li>Over 30+ songs on the soundtrack, written and recorded by composer 'Caleb Coles'.<br/>\n</li><li>Over 250+ background images sporting a diverse amount of scenes and locations; alongside detailed character designs by head artist Garbiel Weisz.<br/>\n</li><li>Utilizes the third-person limited perspective along with side-imaging, the combination a first for the visual novel medium, to give a larger world feel.<br/>\n</li><li>15-25 hours worth of gameplay with full 1080 HD for all assets and visuals.<br/>\n</li><li>A unique in-game encyclopaedia called 'The Enigma Files', to help you piece together the clues.<br/>\n</li><li>Sci-fi and time-travel elements integrated with action, psychological themes, plot twists and impacting character moments.</li></ul>", "metacritic": null, "released": "2021-09-09", "tba": false, "updated": "2021-09-10T04:45:03", "background_image": "https://media.rawg.io/media/screenshots/9c0/9c0183346884abd6846f8b66d7db8dad.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 288, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Spiregames"], "genres": [], "publishers": [], "esrb_rating": null}