{"id": 663084, "slug": "lovephysics", "name": "LövePhysics", "name_original": "LövePhysics", "description": "<p>Draw, fling shapes, and drop your FPS with this teeny physics sandbox powered by LÖVE (or LÖVE Potion, if you have a 3DS)!</p>\n<p>Made over a couple months in-between other projects, my first attempt at writing 3DS homebrew was supposed to stay that way, but then I wanted a bigger screen for shape flinging.</p>\n<p>Everything's controlled with the mouse, left click to interact with shapes and right to pan the camera around on most tools, with the 1-9 keys to swap between those. Escape opens the menu where you can change various settings for the tool you have selected, or the game itself.</p>\n<p>What're these tools though? You can change 'groups' by pressing the 1-9 keys, and pressing the same key again to select a tool within that group. Here's what they all do:</p>\n<ul><li>Objects<ol><li>Move: Drag objects around and fling them when you let go.<br/>\n</li><li>Rotate: Rotates an object around its origin.<br/>\n</li><li>Destroy: Destroys whole objects when you click and hold them.<br/>\n</li><li>Duplicate: Copies any object you click and drag.<br/>\n</li></ol></li><li>Shapes<ol><li>Circle: Click and drag to make a circle of any radius.</li><li>Rectangle: Click and drag to draw a rectangle.</li><li>Line: Click and drag to draw a line between two points.</li><li>Polygon: Click and drag your mouse around to draw a polygon of almost any shape, up to 32 vertices.</li><li>Destroy: Destroys shapes that you click and hold. Polygons are composed of triangles, so it might be tricky to destroy those.</li></ol></li><li>Vacuum<ol><li>Pull: Pulls all objects in the world towards your mouse. Like a vacuum.</li><li>Push: Pushes all objects in the world away from your mouse. Like the opposite of a vacuum.</li>\n</ol></li></ul>", "metacritic": null, "released": "2021-09-08", "tba": false, "updated": "2021-09-10T06:19:05", "background_image": "https://media.rawg.io/media/screenshots/de1/de1310bb3434fe01c5c3c97a5f4f8b4e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 42, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Moohemoth"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}