{"id": 663137, "slug": "penumbra-crystallis", "name": "Penumbra Crystallis", "name_original": "Penumbra Crystallis", "description": "<p>Penumbra Crystallis is an RPG Maker MV game that is heavily inspired by series such as Final Fantasy, and borrows lightly from others such as Dragon Quest. Penumbra Crystallis tells the story of Vahn Vainstrong as he is gradually swept up into plot to drain the Crystals of the Elements by a mysterious entity known as Malacore that will take him and his friends on an adventure that spans the entire globe as they fight to protect the Crystals and the elements themselves.</p>\n<p>Penumbra Crystallis was originally conceived as a remake of Blackmoon Prophecy, a Final Fantasy fan game I completed ten years ago, but with original assets and all Final Fantasy references stripped away. It has since evolved into a bit more than that, and while the story and world are very similar to what was featured in Blackmoon Prophecy, there are going to be many key departures along the way that will catch returning players completely by surprise, namely the story eventually veering off into completely uncharted territory. This game may have many of the same story beats as Blackmoon Prophecy, and many of them will unfold in the same way, but where you ultimately end will be so far removed from the later events of Blackmoon Prophecy that this is more than just a reimagining. Penumbra Crystallis takes the shell of Blackmoon Prophecy and makes something completely new out of it.</p>\n<p>So, if you liked Blackmoon Prophecy, strap yourselves in! This game should not disappoint, and I hope to have the original game's fans all along for the ride on this weird journey!</p>\n<p>The Penumbra Crystallis demo is free to play. The full game, expected to be completed hopefully in 2023, will be approximately $15 USD. If you would like to donate when downloading the demo, that would be AWESOME since it could potentially help me cover dev costs (as character art, monsters, and music is comissioned/original).</p>\n<p><strong>Like the game and want to follow its progress? Stop by the Discord server for regular updates!<br/></strong></p>", "metacritic": null, "released": "2021-09-07", "tba": false, "updated": "2021-09-10T06:30:55", "background_image": "https://media.rawg.io/media/screenshots/838/83858a0935f2ed3d87c1c253e98d3792.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 154, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["UPRC"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}