{"id": 663281, "slug": "kokeshi-unfinished", "name": "Kokeshi (unfinished)", "name_original": "Kokeshi (unfinished)", "description": "<p>An unfinished rhythm-action game I made for Global Game Jam 2013. You can play it solo or with two players on the keyboard.</p>\r\nHow to Play\r\n<p>&gt;&gt; PRESS ENTER TO START THE GAME &lt;&lt;<br/>Once you have started the game, you will see a timeline below a large unpainted kokeshi doll. The timeline will have coloured notes on it like most traditional rhythm games. The colours correspond to each player (koto or taiko drum) and the key to press is written on the note. </p>\n<p>The keys are as follows:<br/>- Player 1 (Koto harp): press Q,W,E,R for different tones (low to high)<br/>- Player 2 (Taiko drum): U,I,O,P for different tones (chu, shime1, shime2, stick)</p>\n<p>After the demonstration, press the keys in time with the notes to get onto the next stage. The difficulty is not well balanced, and gets quite difficult if you play solo. I don't think there are that many stages, but it's been a while!.</p>\n<p>Press space bar to enable auto play. With auto play enabled, the game should play itself and advance to the end, although do bear in mind it's not finished!</p>\r\nSource\r\n<p>You can find code and graphics source on my Github: https://github.com/andyp123/canvas_kokeshi<br/></p><p>Note: I have no idea where I found the sounds, but they are probably not CC-0. Everything else was made by me.</p>\r\nOriginal Description\r\nKokeshi is a Japanese themed rhythm action game where you must master the koto and taiko drum in order to play music to enchant and bring to life a giant kokeshi doll.\r\n<strong>How does this tie into the theme?</strong> (the theme was \"Ritual\")\r\nThe taiko drum is intended to be like the heartbeat of the living doll, but I have yet to implement this :/\r\nAlso, there is a bit on wikipedia that I found interesting: <br/>\"In Looking for the Lost, Alan Booth suggests that kokeshi may be fetish substitutes for unwanted babies killed after birth and the characters can be understood as 子消し (made up of child (子 ko) and erasing, extinguishing (消し keshi)\"\r\nI thought that maybe the two instrumentalists (not yet implemented!) on either side of the doll could be a couple who had a baby that they killed and are trying to capture the soul of their baby in the kokeshi doll in order to be forgiven by the gods.", "metacritic": null, "released": "2021-09-07", "tba": false, "updated": "2021-09-10T07:07:21", "background_image": "https://media.rawg.io/media/screenshots/013/0138849fcbc0b94ed1818f8740911ec4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 28, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["MrFlamey"], "genres": [], "publishers": [], "esrb_rating": null}