{"id": 66352, "slug": "wormyio", "name": "wormy.io", "name_original": "wormy.io", "description": "Snake IO game simulated game Snake on older phones were very familiar to everyone.<br/>But with new features allowing players to play online together or play against A.I (offline) makes particularly attractive for video game and fun!<br/><br/>Amazing Features:<br/>• Allows the player chooses to play online server. Easy to play with friends, easily choose the best server, the fastest<br/>• Support 2 game center modes: Online and against A.I. Along with racing top players in the world :)<br/><br/>How to play the game:<br/>• Control the snake to avoid crashing into the other snakes.<br/>• Use a speed button (shaped rocket, the lower right corner of the screen) to run faster. Note when running fast, the snake's length will be reduced.<br/>• Round (bottom right): Map &amp; your location.<br/>• Leaderboard (top right corner): Ranking the top 10 longest snakes.<br/>• Your and Your length Rank (bottom left): Length and your ratings.<br/><br/>Some gaming experiences when playing snake:<br/>• When new to play, go under the large and wait, \"buffer fight\" and we will have a hearty meal.<br/>• When you see the food, just curled around it as quickly as possible to avoid being robbed others.<br/>• You can hunt by curled around the smaller snake. But beware those \"opportunities\" can do so with both you and your prey.<br/>• Use well-timed acceleration, it makes solid shortening. Sometimes you can not control the speed, crashing into another snake!<br/>• When the larger snakes move slower and more difficult to wriggle. If you are a kid solid, calmly waiting for the opportunity to wriggle or large solid block head.<br/>• When you go big, focus hunting large batches.<br/>• Do not be impatient, let snake grows slowly!<br/><br/>Wish you have moments of hunting fun, comfortable with the Snake game :)", "metacritic": null, "released": "2016-12-05", "tba": false, "updated": "2019-10-22T14:27:16", "background_image": "https://media.rawg.io/media/screenshots/67b/67bc3f5dbec9cefed1724eadefe65a1c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 106, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Twin Dragons Creation & Technology Joint Stock Company"], "genres": ["Strategy"], "publishers": ["Twin Dragons Creation & Technology Joint Stock Company"], "esrb_rating": "Everyone 10+"}