{"id": 663682, "slug": "warlike-itch", "name": "Warlike (itch)", "name_original": "Warlike (itch)", "description": "<p><strong>FTL meets Slay the Spire.</strong><br/></p>\n<p>Command a battleship engaged in combat with varied enemy vessels. Raise shields, fire Lasers, unleash Missile salvos, hack enemy systems, build a drone fleet, create weaponized micro black holes, or immobilize and board enemy ships</p>\n<p>As big fans of both games, we want to create a game that pays homage to both, while bringing new elements to the card game deck building formula, while making it a more dynamic and visually thrilling experience</p>\n<p>We plan to update this Alpha at regular intervals , adding new features to it with every release, so keep an eye on this page to stay updated</p>\n<p>---------------------------------------------------------------------------------------------------</p>\n<p><em>Alpha 1.02 Release notes:</em>\n</p>\n<p><em>This is a very early build of the game, so expect a lot of bugs and confusion, but hopefully it's enough to give you a glimmer into what we are trying to create. Currently we only focused on the combat loop and want to ensure that is not confusing to people, and it's actually playable.</em>\n</p>\n<p><em>Everything else in between is just placeholder (The ship hangar/shop is also very basic compared to where it will be)</em>\n</p>\n<p><em>What you will find in this build:</em>\n</p>\n<p><em>- 5 different enemies to fight, each progressively more difficult , and requires a better understanding of the mechanics to beat.</em>\n</p>\n<p><em>- A shop where you can buy various pieces of equipment for your ship, experiment with different loadouts, and see how it affects how you fare against the enemies (Sometimes having only a few key pieces of equipment is better than a fully loaded out ship)</em>\n</p>\n<p><em>- Around 40-50 different cards, ranging from simple and straightforward, to more complex cards that require to be played together with other cards for maximum effect</em>\n</p>\n<p><em>- A lot of placeholder art, this is still a very early build, and our focus was on the gameplay , not the graphics</em>\n</p>\n<p><em>Known bugs:</em>\n</p>\n<p><em>- Buying things at the shop currently doesn't deduct money, this is a known bug, but feel free to abuse it in order to try out different pieces of equipment</em>\n</p>\n<p><em>- Some card keywords don't display correctly, or don't display at all</em>\n</p>\n<p><em>- The settings button doesn't currently work- We only have one spaceship model for now, so we keep reusing it</em>\n</p>\n\n\n<p>Our Discord: https://discord.gg/NHDnG9CdW9</p>\n<p>Our Twitter: https://twitter.com/WarlikeCCG</p>\n<p>Our Website: https://www.projectwarlike.com/</p>", "metacritic": null, "released": "2021-09-06", "tba": false, "updated": "2021-09-10T08:51:22", "background_image": "https://media.rawg.io/media/screenshots/4e8/4e808e8bceb84d9c75f6288fd2cb6e53.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 186, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["warlike"], "genres": [], "publishers": [], "esrb_rating": null}