{"id": 663606, "slug": "stopwaitingforgodot-chess", "name": "#StopWaitingForGodot Chess", "name_original": "#StopWaitingForGodot Chess", "description": "<p>Source code available on GitHub!</p>\n<p>A simple chess implementation in Godot. Supports all the rules of chess, including castling, en passant (HOLY HELL), promotion <em>(currently, the UI only lets you promote to queen)</em>, and draws by insufficient material, fifty move rule, and threefold repetition. <em>(Draws by fifty move rule and threefold repetition get auto-claimed, so there is no seventy five move rule or fivefold repetition.)</em> Supports parsing and generating FEN strings, and generates the game's moves in SAN format as the game is played (similar to Lichess). Also, there is a really simple random move bot (to play against it, check the \"Bot Enabled\" box). Lastly, press F11 to toggle fullscreen if applicable.</p>\n<p>This is my entry in Terry Cavanaugh's STOP WAITING FOR GODOT Jam! I had a lot of fun working on this project! I previously attempted to make chess in Godot some months ago but failed miserably. But after participating in the GMTK Game Jam 2021 and using Godot for that, I felt I had a better shot and that I could give it another go.</p>\n<p>I learned a lot during this project, including how to use the built in drag and drop functionality, groups, singletons, and defining my own object classes! I documented some of the development process in the Log section of the GitHub README.md, go check it out if you're interested!</p>\n<p>The full credits and attributions are in the game's Credits menu, but alternatively you can view them online here: CREDITS.md</p>\n<p>Thanks for playing! <em>(and please let me know if you find any bugs!)</em></p>\n<p>- thearst3rd</p>", "metacritic": null, "released": "2021-09-06", "tba": false, "updated": "2021-09-10T08:30:04", "background_image": "https://media.rawg.io/media/screenshots/c55/c55947077b7d5dc88111955f939b1710.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 41, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["thearst3rd"], "genres": [], "publishers": [], "esrb_rating": null}