{"id": 663672, "slug": "inter-galactic-earth-invaders-from-beyond-outer-sp", "name": "Inter-Galactic Earth-Invaders from Beyond Outer Space", "name_original": "Inter-Galactic Earth-Invaders from Beyond Outer Space", "description": "<p>You are part of Earth's Defense Force and have been called to fight off the Aliens that are trying to escape with all of our technology. You will be controlling a EDV - Mark IV (Earth Defense Vehicle) armed with a laser. Your laser is able to bounce off of your own ship, as well as your co-defenders' ETG (Electrical Travel Grid) (i.e. Red laser will bounce off of Red player and Blue 'line'. Blue laser will bounce off of Blue player and Red 'line'.) and thanks to innovative technology in the last minute, your lasers will now also bounce off of the Beam that the Aliens are using.\r\n</p>\n<p>Yellow and Red Aliens are different from your average Green ones, as they will explode upon being imprisoned. Both the Aliens and their explosions are lethal and you must avoid them at all cost. The fragments as well as the Aliens will bounce off of the ETG, so beware.\r\n</p>\n<p>There is hope, however: If you do manage to blast a Yellow Alien, you will be granted a boost in fire-power and be able to shoot faster. If you Blast a Red Alien, you will be able to travel faster across the ETG. Of course there is a limit to how much faster you will be able to shoot and move, but it is certainly enough to grant you an advantage.\r\n</p>\n<p>Should you under any circumstance hit your co-defender with a laser, then your work has been for naught and your score will be reset; For whatever reason it seems to amuse the Aliens, however, as they tend to slow down their attack when this happens. Your co-defender, however, will lose all their power-ups and stay frozen for a few seconds, unable to fire. So be careful.\r\n</p>\n<p>Good luck out there and remember: The Fate of Humanity is in your hands.\r\n<br/><br/>Player 1 Controls:<br/>W = UP<br/>S = DOWN<br/>C = FIRE\r\n</p>\n<p>Player 2 Controls:<br/>ARROW UP = UP<br/>ARROW DOWN = DOWN<br/>L = FIRE\r\n<br/><br/>Common Controls:<br/>ESCAPE = RETURN TO MENU\r\n<br/>R = RESET CURRENT GAME\r\n</p>", "metacritic": null, "released": "2021-09-06", "tba": false, "updated": "2021-09-10T08:48:38", "background_image": "https://media.rawg.io/media/screenshots/ee6/ee6a7def0be932e24faedeca11c009da.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 11, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Lord_Santa"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}