{"id": 663835, "slug": "decluster-zero", "name": ".Decluster Zero", "name_original": ".Decluster Zero", "description": ".Decluster Zero is simply an outstanding bit of joy.<br/>- Touch Arcade (5/5)<br/><br/>.Decluster Zero: Bullet Nocturne is a fantastic bullet hell shooter.<br/>- 148Apps (4.5/5)<br/><br/><br/>##<br/>## Please try the lite version first to make sure if your device can run the game. ##<br/>##<br/><br/>--<br/><br/>'.Decluster Zero (dot decluster zero)' is a Japanese style bullet-hell shooter with abstract and pixelated neo-retro graphics. The game offers modern-classic bullet-hell gameplay and traditional Japanese beautiful bullet patterns. You'll get new bullet-hell experiences which are brought by Bullet-Canceling system.<br/><br/>In the game, you'll encounter tons of bullets which are insane. It is impossible to keep dodging, but you can erase the bullets easily.<br/><br/>A main mechanic is 'homing laser' with CANCELING enemy bullets around your ship. It requires gauge, but easy to fill.<br/><br/>You should use the homing laser aggressively and it is the best way to defeat enemies. Moreover, there is a mechanic which slows down bullets around your ship in order to dodge them easily.<br/><br/><br/>Are you interested in this game? You can watch user's replay videos on Everyplay:<br/>https://everyplay.com/-decluster/videos<br/><br/>You can also watch them in this app. Tap 'EVERYPLAY' button on the title screen. (The lite version also.)<br/><br/>--<br/><br/>.Decluster Zero is a remix version of bullet-hell shooter '.Decluster: Into The Bullet Hell'. With many remixes and new features: remixed soundtracks, modified mechanics, redesigned levels, and more.<br/><br/><br/>#1 SOUND<br/>- Remixed all soundtracks + new soundtrack<br/><br/>#2 MECHANICS<br/>- Expanded homing laser system<br/>- Touch and hold a second finger...<br/>- Bullets around the player are slowed down (Capture Mode)<br/>- New scoring system<br/>(Homing laser basics are the same as before: requires meter and cancels bullets.)<br/><br/>#3 LEVEL DESIGN<br/>- Redesign for new mechanics plus new scenes<br/>- Modify/add bullet patterns and enemies<br/><br/>#4 PLAYER SHIP<br/>- Full-power from beginning<br/>- Change basic weapon anytime<br/>- Three level stock homing laser gauge<br/>- Charge the meter by itself (Charge Mode)<br/><br/>#5 GRAPHICS<br/>- Improve visibility<br/>- Improve graphics quality<br/><br/>--<br/><br/>FEATURES:<br/>- Japanese style bullet-hell shooter<br/>- Terrific bullet hell experience<br/>- 5 various levels + 1<br/>- Beautiful bullet patterns<br/>- Boss battles which take your breath away<br/>- 4 levels of difficulty that actually make a difference<br/>- Soundtracks to make you high<br/>- Optimized controls for mobile<br/>- Restart from any level you reached<br/>- Adjustable gameplay area <br/>- Various settings<br/>- Replay video through Everyplay<br/>- Game Center support - Leaderboard/Achievement<br/>- Leaderboard for each difficulty/level<br/>- Universal app for iPhone/iPad/Apple TV<br/>- MFi controller support<br/><br/><br/>Trailer:<br/>https://www.youtube.com/watch?v=QZI665o_pMs<br/><br/>SoundCloud:<br/>https://soundcloud.com/dot_decluster<br/><br/>Twitter:<br/>https://twitter.com/dot_decluster", "metacritic": null, "released": "2015-08-04", "tba": false, "updated": "2021-09-13T02:58:40", "background_image": "https://media.rawg.io/media/screenshots/78e/78e3f06f05951662c081d98d9afc0399_bZiQDeA.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 202, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["MASAYUKI ITO"], "genres": ["Action", "Casual"], "publishers": ["MASAYUKI ITO"], "esrb_rating": "Everyone 10+"}