{"id": 663808, "slug": "the-married-managers-scandalous-services-the-pleas", "name": "The Married Manager's Scandalous Services - The Pleasures of the Night Shift", "name_original": "The Married Manager's Scandalous Services - The Pleasures of the Night Shift", "description": "<p>This is a Low-priced practical erotic game.《Contents》CG : 15<br />\nIntimate scene : 15<br />\nVoice : Heroine Full Voice.《Features》You can have the same experience as the protagonist.You can click on the heroine and enjoy her reactions.Two endingsCG Gallery ModeScene Replay Mode《Story》<br />\n&quot;Quit your yammering and get back to work!&quot;<br />\nThat sharp-eyed woman is Kanade Otoya, the store owner&#39;s wife.<br />\nThe manager here isn&#39;t just tough; she never changes her mind<br />\nand won&#39;t tolerate a single word from others about how the shop is run.<br />\nHowever, she&#39;s convinced things aren&#39;t going well because of everyone but her<br />\nand flips out at me and the part-time staff, so I haven&#39;t been able to find a solution.<br />\nI force a smile in an attempt to avoid her wrath,<br />\nand she heads to her office, where she remains for the next few hours.<br />\nWhen I glance at my watch, I notice it has gotten quite late.<br />\nIt should be okay for me to go home now.<br />\nI approach the door to the manager&#39;s office to let her know I&#39;m leaving.<br />\n&quot;Khh… mmm… mm… Ngh… mm… ah…&quot;<br />\nWhat the hell are those sounds?<br />\nI&#39;m about to knock on the door when I notice strange noises coming from within.<br />\nThere&#39;s a kind of vulgarity in the air, which makes me instinctively try to hide my presence.<br />\nWhy is she moaning like that…? What&#39;s going on inside?<br />\nFull of trepidation, I softly crack open the door…《Character》<br />\n■Kanade Otoya (VA: Nanami Natsukawa)<br />\nMeasurements: height 160cm, bust 95cm (F cup), waist 59cm, hips 96 cm<br />\nSelf-assured and stubborn. Believes she&#39;s #1.<br />\nThe wife of an owner of many convenience stores.<br />\nShe manages one of those stores in place of her husband, who is constantly bouncing around between his other stores.<br />\nShe&#39;s something of a sadist, and she&#39;s even gotten herself off on her own poor treatment of others.<br />\n*Before purchasing this product, we highly recommend that you play the demo[Japanese only] to check if the game works properly on your computer in your region.</p>", "metacritic": null, "released": "2021-09-30", "tba": false, "updated": "2021-09-13T15:34:17", "background_image": "https://media.rawg.io/media/games/0b5/0b5a9753355c6bf9475419be6ecd4292.jpg", "website": "http://www.appetite-game.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 257, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Appetite"], "genres": ["Simulation"], "publishers": ["Tensei Games"], "esrb_rating": null}