{"id": 66386, "slug": "groove-coaster2-original-style", "name": "Groove Coaster2 Original Style", "name_original": "Groove Coaster2 Original Style", "description": "[Rave reviews from all corners of the world! Over 3,000,000 downloads!]<br/><br/>Rhythm Game &amp; Roller Coaster!<br/>The award-winning Groove Coaster with its unique gameplay and multiple awards from all over the world has been upgraded with the new Original Style where you can use your surroundings as instruments to play the game!<br/><br/>+ Simple + Fun + Exciting +<br/><br/>Intense and exhilarating gameplay by simply tapping in time with the music!<br/>Blast off through the music galaxy on a roller coaster of lights and sounds!<br/><br/>+ 215 Total Tracks! Over 1200 Stages! (*separate modes) +<br/><br/>A huge compilation of amazing music from tons of genres that can only be enjoyed here! Vocaloid, Video games, and even original tracks commissioned from popular artists specifically for Groove Coaster!<br/><br/>New tracks added all the time!<br/><br/>+ No need for a touchscreen! We've added Original Style which lets you use anything as an instrument to play the game! +<br/><br/>Sing, clap, drum on your desk! Use your surroundings as instruments to play the game!<br/>You can even play with more than one person so feel free to invite friends and family to join in on the fun!<br/><br/>*You can still play the game with the touchscreen.<br/><br/>+ Now with Arcade Mode! +<br/><br/>We've ported in the extremely well received Arcade version of Groove Coaster found in arcades all over Japan!<br/>Now you can taste the excitement of the Arcade version any where, any time, using dynamic controls with both hands!<br/><br/>+ Tons of Planned Crossover Events! +<br/><br/>We're planning on running crossover events with many characters, artists, and other games!<br/><br/>+ Other Improvements Across the Board! +<br/><br/>- Multi touch support so you can play using multiple fingers<br/>- Added Mission feature where you get rewards by completing various challenges<br/>- Added Title feature where you can show the world how awesome you are<br/>- Upgraded Event feature<br/>- Added S+ and S++ ratings<br/>- Some Avatars are now in full color<br/>Countless other improvements<br/><br/>Fill the world with music!<br/>PLAY MUSIC!!<br/>---------------------------------- <br/><br/>Available Languages <br/>English / Français / Italiano / 日本語 <br/><br/>Compatible Devices <br/>iPhone (5 - 8) / iPod touch (5th generation or higher) / iPad (4th generation or higher)<br/>** iPhone OS 8 or higher is required to play GROOVE COASTER 2 ORIGINAL STYLE.<br/><br/>*There are some In-App Purchases in this game.", "metacritic": null, "released": "2012-11-20", "tba": false, "updated": "2019-07-29T08:27:14", "background_image": "https://media.rawg.io/media/screenshots/fc6/fc60d5b25673697aca30077dc6907d1e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 154, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Taito"], "genres": ["Arcade", "Casual"], "publishers": ["Taito"], "esrb_rating": null}