{"id": 663926, "slug": "singo-a-few-days-in-the-countryside", "name": "Singö - A Few Days in the Countryside", "name_original": "Singö - A Few Days in the Countryside", "description": "The island and the cottage were your whole summers as a child. You played a hundred games on the rocky plot of land, dreamed a thousand daydreams on the porch. The pine tree forest, blueberry bushes underfoot, was home to all manner of creatures and you wanted to make it your home, too. The sea, in the calm, shallow bays, was comfort in the heat, and on the cliffs, it scared and enticed you in equal measure. Wild strawberries grew along the side of the gravel road, and mosquitos nibbled at you in the not-dark of the summer nights. You never thought, then, that summers wouldn't always be like that.\r\nSo much has changed. You have changed. The island has changed. The school closed down long ago; the grocery store hangs on through the perseverance of the locals and the wallets of the summer guests. You could never afford a place out there now, the real estate market being what it is, but you're blessed in that the old place has stayed in the family.   \r\nYet, you imagine there must be many things there that are still just the same. You can see it all so clearly, if you just close your eyes.\r\n  \r\nNow you go back, for the first time in years, to <strong>spend a few days in the countryside.</strong>\n<p><em>Singö - A Few Days in the Countryside</em> is a solo journaling game about spending a few days in a cottage in the countryside. It is a game about spending a few days in the intersection of your past and your present. It is a game about weather, and nature, and memories of your childhood. And maybe trolls.</p>\n<p>This game is my first venture into game design. It's a consequence of the many hours I've spent playing solo rpgs in the last year or two. The simple card-drawing mechanic was initially inspired by the \"Alone...\" games by Takuma Okada and particularly the Alone by Distant Shores hack by Geostatonary.</p>\n<p><em>Singö</em> is a real place, which really was my whole summers as a child. It will always have a special place in my heart, and I wanted to share it.</p>", "metacritic": null, "released": "2021-09-12", "tba": false, "updated": "2021-09-13T03:22:11", "background_image": "https://media.rawg.io/media/screenshots/265/265d776a089cf5e128770129cb21bf8e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 24, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["EmmaLindhagen"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}