{"id": 663984, "slug": "abstraction-point", "name": "Abstraction Point", "name_original": "Abstraction Point", "description": "<p>Abstraction Point is a Psychological Horror game, with Survival and FPS mechanics present. As a security guard at a research complex, your task is to conserve the safety of personnel at any cost...even if you are the only one left? You are trapped between endlessly dark corridors of a place previously habited by hundreds, eaten away slowly by the dark, and frozen to death by the cold. Can you find a way to get out? And how do you preserve sanity?</p>\n<p>Inspiration was drawn from such games as S.T.A.L.K.E.R., Half-life, System Shock 2, and others.</p>\n<p><em>The project is still under development, which means that not everything is present in the current, or later builds until the final release. Things might change slightly, or drastically.</em></p>\n\n<p>It's the 19XX's, and people are in fear. The world's natural disasters have driven the belief that our planet, and humanity as we know it, is in danger. People are both outraged and worried, the news networks and journals are full of unanswered questions. The government had an answer to all these questions: An undisclosed research facility, surrounded by nothing but snow, was issued to be constructed. In 19XX, the construction of such a facility begins. It may have seemed things have calmed down in the media.</p>\n<p>A few years go by, and the facility has been operational for over 6 months, and they have begun working on experiments on human preservation. You have been employed for 3 months, and have begun having concerns about such experiments. There's something wrong.</p>\n\n<p>The game consists of a singleplayer storyline, spanning throughout multiple parts of the facility (Current builds only include one-off scenarios). The levels are going to be semi-open: Your journey through them is linear, but the areas themselves are freely explorable.</p>\n<p>Exploring such areas should be done with care, as there could be a sentry turret anywhere, hiding in the dark corner of a room. Make sure to keep quiet, and to use such darkness as your friend to stay hidden for as long as possible.</p>\n<p>If stealth doesn't work, time for some action. There is an arsenal of weapons present and available to fire and swing around, but pulling the trigger should be conserved for later, as it is not the best answer to all encounters, you might want to stick to hiding instead.</p>\n<p>Being by yourself with a gun in hand, you won't be able to live for long, as such, getting hold of equipment is vital in staying alive. Geiger counters, flashlights, binoculars, anything to prepare you for what lies ahead.</p>\n<p>You can learn about all of the basics of the game in the Tutorial, where you will be taught movement, interaction, the use of items, the inventory, and weaponry.</p>", "metacritic": null, "released": "2021-09-12", "tba": false, "updated": "2021-09-13T03:35:48", "background_image": "https://media.rawg.io/media/screenshots/c9f/c9ff9aea05683323d4e3038e07ef34cf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 77, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Doomer022"], "genres": ["Action"], "publishers": [], "esrb_rating": null}