{"id": 664064, "slug": "chain-reaction-working-title", "name": "Chain Reaction (working title)", "name_original": "Chain Reaction (working title)", "description": "<p>So it's a bit late to join the party (72 hour jam started ~46 hours ago), but hey, my evening and next day is mostly free, why not? :)</p>\n<p>The plan is to make a 2D / fake 3D physics game featuring  moving and swinging chains and the player has little time to decide which chains to cut and where.</p>\n<p>In other words, the game is about quickly reacting to chains. You know, chain-reaction. That's <em>clearly</em> what Lana and the Azure team meant right? ;)</p>\n<p>(I'm terribly sorry. I also have that condition.)<br/></p>\n<p>Current goal of the game is to land red boxes in the red lane, green boxes in the green lane and blue boxes in.. well, you'll probably guess it. If you land the right box in the right lane, it's good. If you mismatch it and land it in the wrong lane, it's bad. Grey and beige boxes are neutral, they will just disappear; however you can no longer destroy grey boxes by clicking/tapping them. I'm going to get some sleep now and continue in the morning. You can restart the game by pressing R and toggle full screen mode by pressing F.</p><p> I'll be updating this page and the devlog quite a few times in the next 26 hours and I'm also starting a Github repo (not with the source code, but the exported HTML5 game) so development progress can be tracked in accordance with the jam rules.<br/></p>", "metacritic": null, "released": "2021-09-12", "tba": false, "updated": "2021-09-13T03:55:07", "background_image": "https://media.rawg.io/media/screenshots/1fe/1fecc7d26630e79ab42f70c351c9f8c9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 24, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Fodi"], "genres": ["Action"], "publishers": [], "esrb_rating": null}