{"id": 664010, "slug": "living-metal", "name": "Living Metal (itch)", "name_original": "Living Metal (itch)", "description": "<p>by James Black</p>\n<p>Escape the ship, but watch out. You are not alone...</p>\r\nControls\r\n<ul><li>    WASD to move.</li><li>    Move mouse to look around.</li><li>    Space to jump.</li><li>    Left ctrl to crouch.</li><li>    Shift to walk.</li><li>    Left mouse button to interact with things, such as airlock buttons and doors.</li></ul>\n<p>Hint: If you can hear your footsteps, so can everyone else.</p>\r\nCredits\r\n<p>    Monster sounds and door sounds from freesound.org</p>\n<p>    Draxel font from dafont.com</p><p><em>This game was created in half a semester for my video game AI class at UNCC. Below is an edited GDD that describes what I was going for. Anything struck through didn't end up making it in the current release of the game. Most of my time ended up focusing on making the AI, since that is what the class was about.</em></p>\r\nGame Identity / Mantra\r\n<p>Stylized FPS horror game with a complex monster AI who will find and chase the player as he/she attempts to escape a spaceship. Think Alien: Isolation mixed with System Shock 2.\r\n</p>\r\nDesign Pillars\r\n<p><strong>Terror. </strong>The monster should wander around the spaceship, looking for its prey. The player will not have constant knowledge of where the monster is. For all they know, it could be right around the corner.\r\n</p>\n<p><strong>Horror.</strong> Upon finding the player, the monster should chase the player to capture him/her.\r\n</p>\n<p><strong>Strategy.</strong> The player must outsmart the hunter or become hunted. Several abilities the player has can help them leave the spaceship.\r\n</p>\r\nGenre/Story/Mechanics Summary\r\n<p>If I have enough time, I’d like to make a few different starts where each character has a unique initial inventory. If I run out of time, the plan is just to use one player start, where the player is a scavenger who boards a derelict ship looking for goods when they discover they aren’t alone on the ship. The player must make a break for the escape pods.\r\n</p>\n<p>The monster will use all its simulated senses, from touch, to smell, to hearing, to visuals, in order to find its prey. It will utilize a decision tree to determine when to investigate a room and when to run towards the player.\r\n</p>\n<p>A separate “director” AI will give the monster hints as to where the player is, so that the monster does not get completely lost; however, a “tension” variable will measure the perceived terror the player is experiencing, and if it gets too high, the director will get the monster to back off. The tension variable will consider the health of the player, the proximity of the monster to the player, if the player can see the monster, and if the player was previously spotted.\r\n</p>\r\nFeatures\r\n<p>Sneaking will be crucial to the survival of the player. Hiding in the shadows will help prevent the monster from seeing the player. There are various hazards on board the ship that can hurt the player. Falling damage, toxins, burns, and more stand in the player’s way.\r\n</p>\n<p>Distractions will aid the player in getting the monster to move elsewhere, allowing them to sneak by. Throwing items is a good example.\r\n</p>\n<p>Some areas will be locked off by keycards, or loss of power. Having the correct tool for the job will allow access. The spaceship will be a cheese hole design to allow freeform movement within it. In general, if there is a room in the ship, there will always be two exits (With exceptions. Sometimes it just won’t be possible).\r\n</p>", "metacritic": null, "released": "2021-09-12", "tba": false, "updated": "2021-09-13T03:41:37", "background_image": "https://media.rawg.io/media/screenshots/cf9/cf95e3143e0031c8d7ed2b5c9bb2c224.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 93, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Singulo"], "genres": [], "publishers": [], "esrb_rating": null}