{"id": 664242, "slug": "at-the-break-of-dawn-xcvg", "name": "At The Break Of Dawn (XCVG)", "name_original": "At The Break Of Dawn (XCVG)", "description": "<p><strong>Part two of the Outliers and Outsiders series.</strong></p>\n<p><strong>Created for Magical Girl Game Jam 4.</strong></p>\n<p>At The Break Of Dawn is a first person shooter with guns and magic, plus elements from a few other genres mixed in. It stars a novice magical girl on her second adventure where the stakes are high and everything is going wrong. It's set in late 2020, against the backdrop of the global pandemic.</p>\n<p>This is a sequel to my Magical Girl Game Jam 2 game, In The Middle Of The Night. It is highly recommended that you play that game first. You can import a save from a completed run into this game.</p>\n<p>Although it's not a salvage project this time, it is still kind of janked together and ridiculously short. I do feel it's an improvement over the first game in every meaningful way, however.</p>\n<p><strong>Storyline</strong></p>\n<p>It's been (not even) three months since Gina learned she was a magical girl, having gone on a high-intensity adventure after Magical Girl Sakura (yeah, the capitalization feels right) barged into her room in the middle of the night. Since then, they've just barely kept in touch. Now, once again, Sakura is asking for her help. This time, the stakes are high, and everything goes wrong. It's not just Shades that are after magical girls...</p>\n<p><strong>Gameplay</strong></p>\n<p>This game is a first-person shooter, heavily influenced by the Halo series by Bungie and 343 Industries. It also has dialogue sections (really more western RPG than visual novel), quick-time events and an interactive diary section.</p>\n<p><strong>Acknowledgements</strong></p>\n<p>Ran d'Reille for hosting the Magical Girl Game Jam (for the fourth time, no less!).</p>\n<p>A very long list of asset creators and technology vendors. Like most of my games it's pretty bodged together. Refer to the included README and CREDITS files for details.</p>", "metacritic": null, "released": "2021-09-12", "tba": false, "updated": "2021-09-13T04:36:34", "background_image": "https://media.rawg.io/media/screenshots/f9d/f9da799ea765d657c9077b318fe34f97.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 63, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["XCVG"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}