{"id": 664202, "slug": "the-worthless-dirt-boys", "name": "The Worthless Dirt Boys", "name_original": "The Worthless Dirt Boys", "description": "<p>Your Little League baseball team, the Worthless Dirt Boys, has lost to America’s Perfect Boys every year since 1922. Can you give your underdogs a fighting chance with steroids, guns, and blood magic? Explore 5+ endings, branching romance, ludicrous training exercises, and more in this absurdly funny narrative RPG.</p>\n<p>\r\nThat’s right, your choices matter. Yes, you’re picking whether your star pitcher eats rocks or steals a cursed baseball bat from the Little League Hall of Fame, but every choice will have consequences for the big game! Level up stats so that you can do what you want when it counts.</p>\n<p>\r\nIn the evening, pursue the person and/or inanimate object of your dreams. You might be a coach during the day, but at night, you’re a hot single who just <br/>happens to live with their parents.</p>\n<p>\r\nIt’s a text adventure. There are a lot of endings. Heck, you can even abandon <br/>the team if you want.</p>\r\nFEATURES\r\n<ul><li>25,000+ word underdog story about the worst youth baseball team in the world and their coach (that's you!) who'll do anything to win\r\n</li><li>20+ bizarre training activities to whip your team into shape, from chugging irradiated water to summoning the god of stale pudding\r\n</li><li>10+ characters to train and romance, ranging from a scarecrow covered with baseball gloves to Satan himself\r\n</li><li>This game respects your time! Make a choice you don’t like? Travel back in time and make a different one</li><li>5+ bonkers endings based on how you approach your training and love life\r\n</li><li>Comedy from the addled minds who brought you Ridiculous Text Adventures and Blood Bath &amp; Beyond and this article about Christian Bale playing the sandworm in Dune</li><li>FREE. Not really a feature, but yeah. Worth mentioning</li></ul>\r\nCREDITS\r\n\r\n<ul><li>Writing and design: Neil Floyd &amp; Hershall Cook\r\n</li><li>Art: Drawgonian</li><li>Music: Alex P. Grover</li></ul>", "metacritic": null, "released": "2021-09-12", "tba": false, "updated": "2021-09-13T04:27:49", "background_image": "https://media.rawg.io/media/screenshots/c9b/c9b3bdc13c1421005dd275b2e2f9c971.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 98, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Neil Floyd"], "genres": [], "publishers": [], "esrb_rating": null}