{"id": 664486, "slug": "shadow-of-arthylon", "name": "Shadow of Arthylon", "name_original": "Shadow of Arthylon", "description": "Greetings! \r\nYou are about to download the latest ALPHA version of Shadow of Arthylon!\r\nIf you have paid* for Shadow of Arthylon, thank you x1,000,000!!! Your support is the only thing keeping this project alive and thriving.<br/>If you haven't paid, that's fine too. Maybe somebody really cool gave you the link to this. If that's the case, please support the game by playing it, enjoying it, and providing your feedback :)<br/>Please keep in mind this game is in a VERY EARLY  development stage. There is no guarantee  that your experience won't be riddled with bugs, poor tilemapping, bad collisions, frequent server crashes, loss of player data, catastrophic dismemberment, and death. <br/>Once Shadow of Arthylon is released to the general public, a monthly subscription plan will be enacted to provide players with \"enfranchisement\" and cosmetic perks. However, Shadow of Arthylon will always remain a \"free to play\" game, and will always remain ideologically opposed to \"pay2win\" mechanics and content hidden behind microtransactions. Any revenue generated by this project will directly support Shadow of Arthylon, and me (Arzadar). \r\nAlso, I strongly urge you to join us in our Discord: https://discord.gg/SQmKaqKEPZ\r\nThank you!!\r\n-Arzadar\r\n<p>~~~</p>\n\n<p>Shadow of Arthylon is an upcoming 2D Fantasy MMORPG with a heavy emphasis on politics and economy.  More information can be found here.<br/></p>\n<p>Please consider supporting development through our Ko-Fi</p>\n<p>http://ko-fi.com/arthylon<br/></p>\n\n\n\n\n<p>*By purchasing Shadow of Alpha through itch.io,  you will receive Early Access to our alpha development server. Your experience, player data, and access to the server is not guaranteed and may change or be revoked at any time.</p>", "metacritic": null, "released": "2021-09-04", "tba": false, "updated": "2021-09-13T05:36:47", "background_image": "https://media.rawg.io/media/screenshots/af9/af91e3f3c6ead4d3b13421db8670b89b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 108, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Shadow of Arthylon"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}