{"id": 664553, "slug": "combat-felines", "name": "Combat Felines", "name_original": "Combat Felines", "description": "COMBAT FELINES\r\n\r\nGood morning, kit...\r\n<p>Thrown into the world of WarriorCombat Felines, you must make your way with your clan. Start as a kit and learn about the clan and histories; become an apprentice and learn your craft; and finally take on responsibility as a fully-fledged Feline.</p>\n<p>What's ahead of you, kit?</p>\n<p><em>Game plays best in full-browser mode on a computer. Mobile gaming is supported. </em><br/></p>\n<p>Designed for the Narrative Driven Jam, Sept 10 2021.  </p>\r\n\r\nTeam @DumbLuckInteractive:\r\n<p>Story: Miles Cumiskey, Nina Navazio, Ciomara Valentine</p>\n<p>Art: Miles, Ciomara</p>\n<p>Programming (Twine SugarCube): Nina</p>\n<p>Audio: Meaghanne McBride (feat. Ciomara, Emily Zbyszynski)</p>\n<p><em>Adapted Minimap code used in the sidebar, from TheMadExile on Twinery forums.</em></p>\n<p><em>Adapted sliding puzzle code used in a minigame, from 101Computing. </em></p>\r\n\r\nKnown bugs features:\r\n<strong>Bug name</strong><strong>Description</strong><strong>Solution</strong>$clan.warriors[$parentIndex].name visibleSometimes variables don't load for some reason. Instead, shows the Twine variable name in plaintext instead of the value of the variable.Restart game by closing tab with game and re-opening.<br/>(You will lose all your progress.)<br/>Page refresh brokenWhen refreshing the page, the sidebar disappears. Restart the game (instructions above).Unsolvable combat sliding puzzleThe sliding puzzle isn't solvable sometimes. There's no checker to make sure players can complete the puzzle.Use the \"reshuffle\" button at the bottom and... hope. 🤞Stack trace errorAfter some of the minigames / upon completion of some of the minigames, a pop-up with a \"Stack Trace Error\".Hmmm... Yea, uh... Not sure why that's happening. Shouldn't be gamebreaking. No solution.geyser fields linkWhen investigating the geysers, the link doesn't look as expected.Whoops! Our fault in production. Sorry! No solution.italicized emojisSome emojis are italicized.Our fault, sorry! This is because we used // instead of \\\\ to denote translation in a draft. No solution.audio keeps playingAfter using the \"back\" button on certain browsers to get back to the itch.io page, the audio continues to play.We... are not sure why this is happening. But thanks Meaghanne for an awesome soundtrack!\r\n\r\n\r\nThanks!\r\n<p>We're so gratefurr you checked out our game. What's your favurrite generated cat name you saw? 🐱 Let us know in the comments below! 👇</p>", "metacritic": null, "released": "2021-09-11", "tba": false, "updated": "2021-09-13T05:56:10", "background_image": "https://media.rawg.io/media/screenshots/16c/16c40d21bf3b87561a0609ce12dfe3a6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Dumb Luck"], "genres": [], "publishers": [], "esrb_rating": null}