{"id": 664646, "slug": "mourning-path", "name": "Mourning Path", "name_original": "Mourning Path", "description": "<p><strong>Mourning Path</strong> est un court prototype de jeu d'<em>aventure graphique 2D</em> de type side scroller sur le deuil, le souvenir et la guérison.<br/><br/>Vous incarnez un personnage abattu par le récent décès d'un proche. Dévasté, vous n'avez plus goût à rien et le désespoir vous ronge toujours plus chaque jour. Vous aurez à affronter divers obstacles ; <em>dépression, solitude, colère, culpabilité, douleur, déni, autodestruction</em>... Votre voyage consistera à traverser diverses étapes du deuil afin d'accepter de laisser s'envoler les fantômes du passé, sans pour autant oublier, et ainsi aller de l'avant.</p>\n<p>Réalisé dans le cadre de mon mémoire, « <strong>la </strong><strong>Thérapie par le jeu : </strong><em>Ces jeux qui nous font du bien »</em>, ce prototype de quelques minutes permet d'avoir un bref aperçu de certaines mécaniques prévues en jeu.<br/></p>\n\n<p><strong>Mourning Path</strong> is a short <em>2D side scoller adventure game</em> prototype about loss, memories and healing.<br/></p>\n<p>You play as a character devastated by the recent death of a loved one. Depressed, you feel listless and despair is eating you away a bit more every day. You will have to face several osbtacles ; <em>depression, loneliness, anger, guilt, pain, denial, self-destruction</em>... Your journey will involves going through different stages of mourning so that you can accept to let your ghosts fly away, without forgetting, and thereby move forward.<br/></p>\n<p>This short prototype was achieved as part of my thesis, «<strong> Therapy through games</strong><em> »</em>, it shows you a brief overview of some mechanics planned in the game.<br/><br/></p>\n<p>-------------------------------------------------------------------------------------------<br/></p>\n<p>Merci à <strong>Clément Baille</strong> et <strong>Arnaud Gauthier-Lissarague</strong> pour leur très grande aide et conseils sur la programmation, et sans qui ce modeste prototype n'existerait pas.</p>\n<p>Thanks to <strong>Clément Baille</strong> and <strong>Arnaud Gauthier-Lissarague</strong> for their help and advices about programming, without whom this modest prototype wouldn't even exist.</p><p>-------------------------------------------------------------------------------------------</p><p>Introduction scene (animated storyboard)<br/></p><p>Ending scene (animated storyboard)</p><br/>", "metacritic": null, "released": "2021-09-10", "tba": false, "updated": "2021-09-13T06:22:15", "background_image": "https://media.rawg.io/media/screenshots/ea5/ea58913e61fd106f10921ca6fa389e42.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 152, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Llythium"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}