{"id": 664680, "slug": "takaimaton-demo", "name": "Takaimaton DEMO", "name_original": "Takaimaton DEMO", "description": "<p><em>Takaimaton</em> is a project inspired by Yacht Club Games' <em>Shovel Knight, </em>Devolver Digital's <em>Katana Zero</em> and similar 'nostalgia games':</p>\n\r\n- <strong><em>Story -</em></strong>\n<p>In a world where the population consists entirely of automatons, take on the role of <strong>bounty hunter</strong> in this early excerpt level <em>'Pachinko Plaza'; </em>with your target being 'Topper': the gambling tycoon. His rigged casino has drawn many a-robot into a crippling gambling addiction, and the public consensus is that he should be purged from existence.</p>\n\r\n- <em>Gameplay</em> -\r\n<p>Your movement system centres around your versatile weapon, whose extending blade and rocket booster propel you through the stages and shatter through your enemies! However, be wary of how long you spend in the air, as performing two actions without touching the ground will drain your energy and you'll need half a second to recharge..</p>\n<p>Each screen makes new use of a gimmick and presents a new challenge in collecting <strong>bolts</strong> - the game's currency. The entire thing is designed to be speedrunnable too, so enjoy competing for the fastest time!</p>\n\r\n- <em>Installation</em> -\r\n<p>Once you click download on 'Takaimaton DEMO.zip' you may be prompted for a donation, absolutely don't feel that you need to, this is purely to gauge interest in the project and allow for the final to be ported to a variety of platforms.</p>\n<p>With the zipped file in your downloads, you can move it to a suitable location and open it. Run the file named 'Takaimaton DEMO', and choose 'extract all' to the same location. Finally, if the 'Takaimaton DEMO' file has a gms2 logo as its icon, the game is ready to run!</p>", "metacritic": null, "released": "2021-09-10", "tba": false, "updated": "2021-09-13T06:30:04", "background_image": "https://media.rawg.io/media/screenshots/f80/f802d6eae09a946d11ddcdf0e71a9bce.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 344, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["WayneMakesGames"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}