{"id": 664703, "slug": "love-tryouts-demo", "name": "Love Tryouts Demo", "name_original": "Love Tryouts Demo", "description": "Demo: The Pôle Emploi Chronicles\r\n<p>Plus que 4 mois d'assurance chômage, la situation est préoccupante ! HEUREUSEMENT, le Pôle Emploi est là pour vous recevoir, vous orienter et vous aider à trouver l'emploi de vos rêves et peut-être plus...</p>\n<p><em>Only four months left of your unemployment benefits, the situation is getting dire! FORTUNATELY, your local unemployment office is here to guide you and help you find your dream job and maybe more...</em><br/></p>\r\nLove Tryouts\r\n<p>Love Tryouts est un visual novel qui vous permettra de découvrir le monde fantastique de la ProGIEG, une entreprise d'import-export dont les principaux actifs sont ses employé-e-s hauts en couleurs (256). Travaillez dur pour ne pas vous faire virer et qui sait, vous y trouverez peut-être bien plus que des stock-options. Mais avant de pouvoir vous lancer à corps perdu dans le monde de l'entreprise, il faudra vous faire recruter !<br/></p>\n<p><em>In this fully colored visual novel, you'll discover the fantastic world of ProGIEG, a flourishing import-export company. Work hard to avoid being fired and who knows, you may find more than stock options. But before you can throw yourself into the corporate fray, you'll have to be hired! <br/></em></p>\n<p><em>(The demo defaults to french, click the bottom-right corner flag to switch languages)</em><br/></p>", "metacritic": null, "released": "2021-09-10", "tba": false, "updated": "2021-09-13T06:37:07", "background_image": "https://media.rawg.io/media/screenshots/949/949989ed161ec7ae54ed70856cb8bf50.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 92, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["LEAR", "Bosh'tet"], "genres": [], "publishers": [], "esrb_rating": null}