{"id": 664872, "slug": "erannorth-chronicles", "name": "Erannorth Chronicles", "name_original": "Erannorth Chronicles", "description": "Erannorth Chronicles is an old-school sandbox RPG/Card Game with focus in Deck-Building freedom and Character Customization.<h3>Character Customization Freedom.</h3><br/><ul><li> Create your unique Hero by choosing from 9 Species (with 35 variants) and 9 Classes (with 47 specializations) each with different Skills, Perks, Starting Decks and Card Pools.<br/></li><li> Your Skills will affect both your card pool and the effectiveness of your cards, while your Perks will let you increase specific effects and tailor your cards around your build.<br/></li><li> No tedious Unlock systems. Play the hero you want, whenever you want.</li></ul><h3>Deckbuilding Freedom.</h3><br/><ul><li> Build hundreds of different decks and collect over 2630+ cards.<br/></li><li> Adjust your Deck and Add and Remove the cards you collect at any time. <br/></li><li> Tactically switch Decks &amp; Equipment during Encounters to gain advantage or just get out of a tough spot.<br/></li><li> Fetch &amp; Use Consumables from your Backpack.</li></ul><h3>Free Sandbox Exploration.</h3><br/><ul><li> Roam in a large sandbox world with many different locations, challenges and treasure hunts.<br/></li><li> No 'forced story'. Just your imagination (and dozens of multi-branching and randomized events to spice up and make each Adventure feel different).<br/></li><li> Choose which areas to explore (and when). <br/></li><li> Adapting your deck to gain advantage or to overcome the ever-changing leylines can be the key between life and death.<br/></li><li> Experiment with different Action card combinations and overcome over 200+ unique enemies that can level up \"indefinitely\". <br/></li><li> Enemies have different Damage types, Resistances, Vulnerabilities, Immunities and a decision making AI that will react to your Actions. Your build *will* fail. But you have all the tools to bounce back and adapt.</li></ul><h3>Full Modding and Steam Workshop Support</h3><br/><ul><li> Single player means 'your game, your rules'. And Erannorth let's you do just that. <br/></li><li> Adapt the game to your skill by making everything harder, more hardcore and rogue-like, or easier, casual and relaxing.<br/></li><li> Tweak, Mod and create your own game modes, locations, events, enemies, cards, classes &amp; species and more. All the software you need is your text editor of choice.<br/></li><li> Change the card, ally and enemy artworks just by copy/pasting your own images into a mod folder. <br/></li><li> Modding a game was never easier!</li></ul>", "metacritic": null, "released": "2021-09-16", "tba": false, "updated": "2021-09-17T02:17:26", "background_image": "https://media.rawg.io/media/screenshots/1a6/1a609857dc09b7c66904c7a145e59b14.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 10, "toplay": 2}, "playtime": 1, "achievements_count": 6, "ratings_count": 0, "suggestions_count": 437, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Spyridon Thalassinos"], "genres": ["Adventure", "RPG", "Strategy", "Indie"], "publishers": ["Spyridon Thalassinos"], "esrb_rating": null}