{"id": 66485, "slug": "monster-fighting-games", "name": "Monster Fighting Games", "name_original": "Monster Fighting Games", "description": "Are you looking for entertaining games and would like to play free games for kids and adults? Download Monster Fighting Games free app for iPhone; play the best match 3 games where you battle monsters and dark forces on Halloween night!<br/><br/>++ Play these cool games for iPhone on your phone or tablet and kill monsters! ++<br/><br/>Monsters, ghosts and demons are running wild in the night and creating scary sounds on Halloween eve. The moon has come down to defend the planet from evil spirits as the Halloween ghost has taken its place in the sky and is attacking with all his little monsters. In these battle games your mission is to save the planet by killing monsters; match 3 of the same colors or use the Halloween pumpkin bombs to destroy the scary monsters and win points in these matching games with monsters.<br/><br/>Play fun games with levels where point multipliers accelerate the earning of points on every game level. If you enjoy classic arcade games and like the atmosphere in horror games; these are the right ghost games for you. You can play these free mobile games as pastime games on the bus or as competitive strategy games and compete for a place on the global leaderboard. These are iPad games for girl and boys, fun and addictive games that will make you want to complete the next level, earn more points and play more and more scary games every day!<br/><br/>Download Monster Fighting Games iPad app now; play free match 3 games for iPad and battle evil monsters in this monster match game app!<br/><br/>Play free iPhone games on your phone or iPad, screen size will adapt to a wide number of devices when you play these monster defense games.<br/><br/>With an in app purchase you can remove ads and get extra features in this iPhone monster app.", "metacritic": null, "released": "2015-01-13", "tba": false, "updated": "2019-07-29T09:14:32", "background_image": "https://media.rawg.io/media/screenshots/159/159984e5a920b2eda7fab548adf7e720.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 56, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Netfocus Apps Sweden", "Netfocus Universal"], "genres": ["Strategy", "Arcade", "Casual"], "publishers": ["Netfocus Apps Sweden", "Netfocus Universal"], "esrb_rating": null}