{"id": 664883, "slug": "mondealy-day-one", "name": "Mondealy: Day One", "name_original": "Mondealy: Day One", "description": "Assume the role of Michael - just an ordinary guy who managed to discover the pathways leading under his hometown, right into the unexplored underground kingdom of Dargratt. By a strange set of events and coincidences, Michael meets the royal family, now it’s up to them to decide what is going to happen with him next…<br/><br/><br/><br/><ul><li>Spend one day at the underground kingdom - meet, explore, unravel!<br/></li><li>Meet deep, flamboyant, and sexy characters - Inhabitants of both worlds, the one above and the one under are ready to tell you their stories, share their unique vision of the world around you. They may ask for your assistance, but it's up to you to decide whether you want to help them or not.<br/></li><li>Explore both of the game's worlds - Vast various dungeon areas, the castle with its inhabitants, the mysterious hometown on the surface as well as the character's residences are waiting to be explored. Things might look ordinary, but how ordinary are they, and what lies beneath?<br/></li><li>Unravel a part of the main storyline and side quests - You will have access to the introduction of the game, which will gradually immerse you into the underworld with its laws, beliefs, events, and inhabitants. The more you investigate - the more you learn, which in turn might reward you with additional stories and events to participate in.<br/></li><li>In-game gallery - The in-game character gallery will allow the most dedicated and curious players to learn more about the characters you can meet while playing Mondealy. Learn more about how they were created, their in-game history, and the sources of inspiration.</li></ul>", "metacritic": null, "released": "2021-09-13", "tba": false, "updated": "2021-09-17T02:24:55", "background_image": "https://media.rawg.io/media/screenshots/13e/13ec0e4e739c7e9e1647247dd73b01de.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "beaten": 1, "toplay": 1}, "playtime": 0, "achievements_count": 13, "ratings_count": 1, "suggestions_count": 149, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["uglycoal"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Valkyrie Initiative"], "esrb_rating": null}