{"id": 664878, "slug": "story-of-seasons-pioneers-of-olive-town", "name": "STORY OF SEASONS: Pioneers of Olive Town", "name_original": "STORY OF SEASONS: Pioneers of Olive Town", "description": "Build Your Farm From the Ground Up!<br />\nWelcome to Olive Town, a peaceful community established by your trailblazing grandfather and his friends. Now that you&#39;ve taken over his farm, it&#39;s your job to carry on his legacy.<br />\nPlant crops, raise animals, build relationships, and get to know the residents of your new home in this brand-new entry in the STORY OF SEASONS series!<br />\nCultivate Your Farm, Cultivate Your Town<br />\nTame the wilderness and build your farm from the ground up! Gather and process materials to fulfill requests and improve Olive Town&#39;s infrastructure, upgrade tools, or commission new outfits and accessories.<br />\nA Farm of Endless Possibilities<br />\nClear the land, repair old facilities, and place new ones wherever you see fit. Level up your farming skills and craft a variety of decorations and facilities, from fences and automatic feeders for livestock to sprinklers for crops!<br />\nNew Adventures Off the Beaten Path<br />\nFinding Earth Sprites while exploring your farmland may lead you to mysterious, fantastical lands such as gardens where the seasons never change, an island in the sky, or even the inside of a volcano!<br />\nThere&#39;s Always Something Going on in Olive Town!<br />\nParticipate in local festivals and watch the town come to life! Get to know your neighbors better with over 200 unique events, and you may even find love with a special someone!</p>", "metacritic": null, "released": "2021-09-15", "tba": false, "updated": "2023-12-26T07:51:36", "background_image": "https://media.rawg.io/media/games/121/1213dea5ce21e30a190b18d2251ab5df.jpg", "website": "http://www.storyofseasons.com/PoOT/", "rating": 3.58, "rating_top": 4, "added_by_status": {"yet": 4, "owned": 28, "beaten": 7, "toplay": 11, "dropped": 3, "playing": 4}, "playtime": 17, "achievements_count": 152, "ratings_count": 12, "suggestions_count": 278, "game_series_count": 0, "reviews_count": 12, "platforms": ["PlayStation 4", "Nintendo Switch", "PC"], "developers": ["Marvelous"], "genres": ["RPG", "Simulation", "Casual"], "publishers": ["XSEED Games", "Marvelous USA", "Marvelous"], "esrb_rating": null}