{"id": 664948, "slug": "chicken-duty", "name": "Chicken Duty", "name_original": "Chicken Duty", "description": "<strong>Protect the neighbor's Chicken while they're away! You better hurry, they'll be home soon.</strong><br/><br/>Run after the chicken and lead it to safety as it encounters multiple threats along it's path through town!<br/>Compare times with others and try to keep your Chicken safe as fast as you can.<br/><br/>*This game was created in only 3 days for a Game Jam, and then polished and released over a few more days.<br/>- Reviews keeping this in mind are appreciated!<br/><br/>Attempt to beat the times of others in this time-trial, level based speed-run game. Levels include:<br/><ul><li>Fox Hunt - The chicken runs into a hungry family of foxes who chase after the chicken. Eliminate the foxes before they get to the chicken!<br/></li><li>Chase - Hunters in the woods find the Chicken and chase after it. You now become the chicken, and must run through a short puzzle to get away!<br/></li><li>Road Run - There's no turning back now, you must safely cross the highway to get to the other side!<br/></li><li>Surgery - The chicken was hurt from a falling stone! You must complete surgery by answering math questions until you've healed the chicken.<br/></li><li>Butcher - The chicken made it to town, but ran into a butcher shop! Find the chicken and run to the exit before the butcher does!</li></ul><br/>The game includes achievements for all three difficulty levels.", "metacritic": null, "released": "2021-09-15", "tba": false, "updated": "2021-09-17T03:13:22", "background_image": "https://media.rawg.io/media/screenshots/a1c/a1c2d030ea1821cae9ee74a3f4788903.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 9, "ratings_count": 0, "suggestions_count": 287, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Peter Buonaiuto"], "genres": ["Action", "Strategy", "Casual"], "publishers": ["Peter Buonaiuto"], "esrb_rating": null}