{"id": 664908, "slug": "animation-studio-manager", "name": "Animation Studio Manager", "name_original": "Animation Studio Manager", "description": "Build your Animation Studio from hiring your first few Production Employees that make short Webisodes to running a full Award-Winning Corporate Studio, trying to win over your fans and appeal to the critics! <br/><br/>Your motivation? To impress your Mother - a really big-time industry Producer.  Of course, there's only one thing she respects: Film Awards!<br/><br/>Honestly, your mother doesn't have a lot of confidence in you and usually expects you to embarrass her…will you prove her wrong?<br/><br/><br/><br/>Hire Writers, Animators, Editors and your entire Production crew to start making short Webisodes and TV shorts. They don't make much money, but you have to start somewhere!<br/><br/>Keep growing and expanding and as long as you keep hitting your weekly payroll, you can grow your Studio to make longer Web Shows and full TV episodes.<br/><br/><br/><br/>You'll also need to expand and hire H.R., I.T., Security and other Corporate Departments once your studio grows over 100 Employees! <br/><br/>If you grow big enough, you'll be ready to start releasing Films! Of course, you'll now have to deal with your annoying Producer who loves meetings way too much. Unfortunately you need him to produce your films as well as set up Fan Conventions and Focus Testing.<br/><br/><br/><br/>Once you've unlocked your entire crew, you'll be ready to start competing in the Award Ceremonies! Of course, once you start getting a little fame, your Fans start making demands.<br/><br/>You'll have to make sure you balance your Fan Demands with your Awards attempts - it seems the Fans don't really appreciate you focusing on winning Awards instead of making Films for them!<br/><br/><br/><br/><ul><li>Hire and manage Employees for 9 Production Departments &amp; 7 Corporate Departments<br/></li><li>Upgrade your Employees or deal with them being sick and tired<br/></li><li>Release Webisodes, T.V. Episodes and Films<br/></li><li>Build your Rotted Potatoes score and Win Awards<br/></li><li>Deal with Fan Demands and P.R. Disasters<br/></li><li>Win Minigames to gain Perks</li></ul><br/><br/><br/>Run your Studio your way<br/><ul><li>Do you pump your Employees full of Coffee so they work faster?<br/></li><li>Do you sell a portion of your Soul or take that Risky Business to get ahead?<br/></li><li>Choose your path to overthrow your mother as the best in the biz.</li></ul>", "metacritic": null, "released": "2021-09-14", "tba": false, "updated": "2021-09-17T02:41:08", "background_image": "https://media.rawg.io/media/screenshots/e21/e21b95797629944a9d701df7c5d176c4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 283, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["David Estes Creations"], "genres": ["Strategy", "Simulation", "Casual", "Indie"], "publishers": ["David Estes Creations"], "esrb_rating": null}