{"id": 664947, "slug": "kukoos-lost-pets", "name": "Kukoos - Lost Pets", "name_original": "Kukoos - Lost Pets", "description": "<p>This 3D platformer takes players to a new universe of limitless adventures, join the Kukoos in a corky and upbeat adventure to rescue the brainwashed pets. Enter the Kukoo Tree and its infinite doors that take you to unimaginable words of dangers and wonders.<br />\nThe accessible gameplay teaches beginners to progress and uncover the mysteries story. As you play and master the mechanics the game grows with the player and challenges you with more ways to interact and think outside the box.<br />\nPlay as K or Kika and meet many friendly Kukoos, not so friendly Sea creatures and Join Forces with 5 uncanny  Pets that will change your gameplay, inviting you to learn adapt, unleashing new powers and ways think the levels.<br />\nPlay as different characters.<br />\nVisit 4 different worlds with forests, ancient temples, super modern cities, delicious ice cream mountains and old haunted pizzerias + special areas ready to test your skills.<br />\nMeet different pets in each world and free them from brainwashing.<br />\nDefeat 5 Bosses with increasing levels of challenge.<br />\nJoin forces with 5 different pets with distinct gameplay styles, strengths and weaknesses.<br />\nSolve light puzzles and tricky situations.<br />\nFind all the hidden Fwendly Plants and become a master of secrets.<br />\nCollect coins to unlock more content.<br />\nGet immersed in the mystery of why the pets rebelled and took over the Kukoo tree as you travel across worlds. Find colorful captivating cinematics that help you tell the story of how the Kukoos will solve the rebellion.</p>", "metacritic": null, "released": "2022-12-06", "tba": false, "updated": "2022-12-05T12:36:33", "background_image": "https://media.rawg.io/media/screenshots/470/4706c3a6956b9d61b53d36b53f974dde.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 426, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "Nintendo Switch", "PlayStation 4"], "developers": ["Petit Fabrik"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["Petit Fabrik"], "esrb_rating": null}