{"id": 664988, "slug": "enf-novels-dress-code", "name": "ENF Novels: Dress Code", "name_original": "ENF Novels: Dress Code", "description": "ENF novels: dress code is an erotic choice based visual novel with multiple endings. The player will not directly impersonate a character, but will have control over the evolution of the story. The character Brigitte Wagner has 10 days to force 3 of her subordinates to resign, to do so she will resort to the most despicable means. ENF novels dress code is based on around 550 full hd images, 20,000 words and an original soundtrack.<h3>ABBY</h3><br/>Abby is a very serious and professional girl. She is a hard worker, she is gifted with great intelligence and self-control. She enjoys helping people and doing menial jobs. Abby is something of a leader, her decisions are always very wise and thoughtful.<h3>LINDA</h3><br/>Linda is a very down to earth girl. At work she is very skilled, although she prefers to enjoy her free time by following her bizarre lifestyle. Linda is shrewd and direct in dealing with problems and always tries to find the shortest way to solve them.<h3>MEGAN</h3><br/>Megan is the most naive of the three girls. She loves her job, even though she is more interested in making a career than in producing results. She respects the chains of command a lot and has esteem for her superiors, she tries to defend them even when they objectively commit injustices.<h3>BRIGITTE</h3><br/>Brigitte Wagner is the boss nobody wants to have. Brigitte is ready to do anything to defend the economic interests of the company she works for. She loves her boss and she would do anything to please him. She is merciless with her subordinates, she has no limits and is ready to humiliate them in any way to obtain their resignation.", "metacritic": null, "released": "2021-09-16", "tba": false, "updated": "2021-09-17T03:41:18", "background_image": "https://media.rawg.io/media/screenshots/4b4/4b4dde867eb74b8350275fc01f519289.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 12, "toplay": 4}, "playtime": 0, "achievements_count": 7, "ratings_count": 0, "suggestions_count": 369, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ENF Novels"], "genres": ["Adventure", "Indie"], "publishers": ["ENF Novels"], "esrb_rating": null}