{"id": 664921, "slug": "laser-chess-deflection", "name": "LASER CHESS: Deflection", "name_original": "LASER CHESS: Deflection", "description": "Deflection is a strategy board game, inspired from the classic Laser Chess games and the famous board game Khet. Move and rotate different pieces to destroy the enemy with your laser!<br/>With a variety of pieces each having different advantages, abilities and weaknesses, use the one move you are allowed per turn to strategically bring you closer to victory. <strong>Enemy mirrors, Disruptors, Portals etc. can be used to your advantage! </strong><br/>At the end of every turn, you must shoot your laser... be careful not to hit your own pieces! <br/><h3>Play with friends</h3>Play with your friends in the same room (local multiplayer/same PC) or remotely in the online multiplayer game mode, to show them who is the best!<h3>Create your own levels</h3>Create Levels in the in-game Level Editor! Play them in Local or Online Multiplayer with a friend (without having him to download anything), or against the AI in Singleplayer. (Steam Workshop integration coming soon).<br/><h3>Strategy and rules</h3>To win, you have to destroy the enemy's king. Most pieces can move in all directions by one cell and rotate 90 degrees, which constitutes one move. Advanced pieces such as the Disruptor can disable and weaken nearby pieces, Splicers split your laser into two, and others like the Portals can be used to surprise your enemy from behind!<br/>Green pieces can be controlled by both players, which provides a new twist in your strategy.<h3>Play and train against AI</h3>Your friends are unavailable or you want to practice? Don't worry, you can play against the AI in the same scenarios/maps. The tutorial mode will guide you through the rules and useful tactics.<h3>A ton of scenarios/maps to choose from!</h3>Deflection comes with plenty of scenarios which keeps the game interesting. Some being simpler for beginners, and some requiring much more strategical skill to overcome the opponent.<h3>Features</h3><ul><li>Local and Online <strong>Multiplayer</strong>.<br/></li><li><strong>Singleplayer</strong>: Play versus AI.<br/></li><li><strong>Level Editor!</strong><br/></li><li><strong>Tutorial mode</strong> which goes through rules and tactics. <br/></li><li>[Replay mode (go through and analyze the moves and laser shots you and your opponent made after a game. <br/></li><li>All games can also be played in<strong> Competitive/Timed Mode</strong>!<br/></li><li>A lot of <strong>scenarios/maps</strong> designed to challenge you, some having unique pieces only available in them.<br/></li><li>Many different pieces with advantages, downsides, abilities and more.<br/></li><li>3D Camera with full control, with cutscenes during kills, activations etc.<br/></li><li><strong>Steam Achievements and stats</strong>.</li></ul>", "metacritic": null, "released": "2021-09-14", "tba": false, "updated": "2021-09-17T02:52:45", "background_image": "https://media.rawg.io/media/screenshots/e2d/e2d17f40b60c2e69a83dbb1d13e180fc.jpg", "website": "https://www.coreffect.ca/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 291, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["Coreffect Interactive"], "genres": ["Strategy", "Casual", "Indie"], "publishers": ["Coreffect Interactive"], "esrb_rating": null}