{"id": 664918, "slug": "mo-ta-di-lao", "name": "魔塔地牢", "name_original": "魔塔地牢", "description": "Tower of Magic is kind of a childhood memory for post-90s/00s, I guess, my earliest exposure to the game was Tower of Mordor, that's why I want to make a Tower of Magic game<br/>Adding the now popular Roguelike element, adding randomness to each area based on the reasonably planned route of the Magic Tower game, so what does certainty plus uncertainty equal?<h3>⭐ Five regions, over 150 maps, experience hundreds of gear &amp; skill combinations</h3>         Plan your route through the area, defeat enemies as harmlessly as possible, defeat the boss, move on to the next area, and pick the area rewards<br/>         Use different equipment skill sets to defeat different enemies depending on their characteristics!<br/>         Occasionally, we come across the odd map<br/>         After passing the level, you can challenge the high difficulty dungeon, the road to become a big man of the Magic Tower<h3>⭐ Eight characters, eleven professions</h3>          Enjoy the Assassin Attack Stream, Knight Defense Stream, Wizard Spell Stream, Sacrifice Stream, Attack Speed Stream, and many other superb ways to play!<br/>          Black out <strong>the character</strong> and experience the character's great power as well as control the great power side effects<h3>⭐Multiple DLCs available during the course of the game</h3>          Turn on skill tree mode<br/>          Embark on an endless journey<br/>          Open the Volcano/Sky City map<br/>          ......<br/>          Start enjoying a trip to the Magic Tower dungeon!<br/><br/><br/>Benefits of Steam version vs. Android version.<br/>①6000 souls<br/>②200% in-game soul acquisition<br/>③ Steam Ring [Ex]<br/>④ The Demon King's Treasure DLC direct access", "metacritic": null, "released": "2021-09-14", "tba": false, "updated": "2021-09-17T02:50:06", "background_image": "https://media.rawg.io/media/screenshots/0ea/0ea8a9c210e5e9d07b0c77094ace5c17.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 274, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Zeros工作室"], "genres": ["Adventure", "RPG", "Strategy"], "publishers": ["Zeros工作室"], "esrb_rating": null}