{"id": 664953, "slug": "captures-ii", "name": "Captures II", "name_original": "Captures II", "description": "Captures II, similar to Captures, is a chess-driven puzzle game. The objective is to capture the opponent's pieces.<br/>While the chess pieces move according to the regular rules, the board itself varies from level to level.<br/>Also certain squares on the board might have \"tile effects\".<br/>Introduced in Captures; poison, curse, portal and random effect are present in Captures II as well. Two <strong>new</strong> tile effects, <strong>shield</strong> and <strong>snow</strong> are new additions.<br/><br/><strong>New Feature:</strong> <strong>Trade Offer</strong><br/>A new concept called trade offer has been implemented. The cpu can offer to add new pieces to the board or remove them. After completing the trade offer world, the player is also able to make trade offers.<br/><br/><strong>New Feature:</strong> <strong>Perks</strong><br/><br/>Completing a world(a set of eight levels) now reward the player with a perk. Perks can make your pieces stronger against tile effects, let you create trade offer or alter the board with new tile effects. For those who are looking for a challenge, try to disable all perks and win all the levels to unlock gradmaster achievements.<br/><br/><br/><strong>CONTROLS</strong><br/><br/>-Drag &amp; drop pieces. <br/>-Click the restart button or press R key to restart the levels.<br/><br/><strong>RULES</strong><br/><br/>-All black pieces must be removed from the board to win the level. <br/>-If a stalemate occurs, the level fails.<br/>-If white loses all of their pieces the level fails. However, if white loses their last piece at the same time with the black, the level is completed.<br/>-During a speed run, reseting a level counts as a mistake.<br/><br/><br/><strong>TIPS</strong><br/>-Random tips will be shown through out the game.<br/>-CPU likes to trade pieces, take advantage of it!", "metacritic": null, "released": "2021-09-15", "tba": false, "updated": "2021-09-17T03:16:57", "background_image": "https://media.rawg.io/media/screenshots/707/707bfea8a302445ddc878c28d4f6a422.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 103, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["cosmic_dust"], "genres": ["Strategy", "Sports"], "publishers": ["cosmic_dust"], "esrb_rating": null}