{"id": 665090, "slug": "la-vendetta-dellartista", "name": "La vendetta dell'artista", "name_original": "La vendetta dell'artista", "description": "<p>Il Grand Musée d'art contemporain de Demòn è stato appena aperto e il successo è immediato.\r\n </p>\n<p>Parigi, se già  da prima era una grande città di cultura, ora è divenuta la quintessenza dell'arte europea.\r\n </p>\n<p>Il tutto grazie all'acquisizione da parte del museo della collezione completa di opere ideata dallo scomparso artista Vincent Demòn. Le vicende della sua morte sono misteriose: i giornali raccontano che il grande artista sia stato trovato morto impiccato in casa sua, circondato da tutti i suoi lavori che avevano come tema orrende creature e scene di violenza. Si pensa al suicido ma voci dicono che non sia così.\r\n </p>\n<p>Voi siete membri dello staff del museo e il vostro compito oggi è quello di allestire la mostra per l'apertura di domani: - Dovete essere rapidi e precisi - vi dice il direttore del museo: - Finite entro sera e domani sarà una grande giornata! - dopodiché si ritira nel suo ufficio.\r\n </p>\n<p>Lavorate incessantemente tutto il giorno. Mentre lavorate avvengono tuttavia diversi incidenti: un addetto ai lavori cade da una scala molto alta e si rompe una gamba. Un commesso della reception ha un malore e sviene senza più riprendere i sensi. Sembra che la fortuna oggi non sia dalla vostra parte.\r\n </p>\n<p>Arriva la sera e avete ormai concluso l'allestimento quando sentite un rumore provenire dall'interfono, è il direttore: - Presto, dovete venire subito nel mio ufficio! Il quadro di Demòn sta... - ma la trasmissione si interrompe. Vi dirigete verso l'ufficio del direttore, aprite la porta, entrate all'interno...\r\n </p>\n<p>E la scena che vi si para davanti è a dir poco raccapricciante: la creatura che stava all'interno di un quadro di Demòn è uscita letteralmente dall'opera e ha fatto a brandelli il direttore. Ora i resti del suo corpo sono sparsi per tutta la stanza e la bestia vi osserva con aria truce pronunciando le seguenti parole: - Non ci fermeremo finché il responsabile della morte di Demòn non sarà morto! -<br/></p><p>La vendetta dell'artista è un <strong>gioco di ruolo pen and paper narrativo breve</strong> di genere fantasy in stile Azione/Avventura, ambientato a Parigi, nella Francia del XXI secolo; il gioco è ispirato a Duma Key di Stephen King, al film Netflix Velvet Buzzsaw e ha preso spunto da numerosi manuali di storia dell'arte.\r\n </p>\n<p>Crediti\r\n </p>\n<p>Playtesting: Andrea Chiari, Federico Lio, Francesco Mastrandrea, Giulia Gennari, Marco Panconesi, Marta Melloni, Mattia Marchetti, Riccardo Preghiera, Samuele Zentile, Sara Sena, Simone Monari\r\n </p>\n<p>Ringraziamenti: Andrea Mondin, Diego Fabris, Giacomo Carnaghi, Simone Meconi\r\n </p><p>\n</p>", "metacritic": null, "released": "2021-09-16", "tba": false, "updated": "2021-09-17T04:38:18", "background_image": "https://media.rawg.io/media/screenshots/b4b/b4bc435dddd8e73033c7ccae43372559.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 22, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Andrea Melludus"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}