{"id": 665005, "slug": "world-of-stalkers", "name": "World Of Stalkers", "name_original": "World Of Stalkers", "description": "World Of Stalkers is an exciting online first-person shooter, Stalker-style, in which you have to fight the strongest Stalkers of Cordona. An unforgettable multiplayer experience awaits you in the Exclusion Zone, where not only skill and accuracy, but also the ability to play as a team, decides.<br/>\n<br/>\r\nIn 1986, due to a number of circumstances and mistakes, the most terrible tragedy happened, which has never happened in the world - this is the Chernobyl accident. As a result of the accident, an exclusion zone was formed - a place where amazing, strange and terrible things happen.<br/>\n<br/>\r\nThe game has a unique mechanic - an exoskeleton. Each fighter is equipped with an individual energy shield that absorbs damage and draws energy from the Zone. Each Stalker has a unique ability - warp jump, which makes it possible to implement various tactics of combat. It is up to you to decide how to manage the energy of the zone. Be extremely careful, on the battlefield you may encounter local inhabitants - creatures of the Zone.<br/>\r\nChoose one of the parties, play as Loners or Mercenaries. The battle of the strongest takes place on a huge map in the center of the Exclusion Zone, on which there are many secrets and dangers. The game features a wide variety of weapons that you have to find.<br/>\r\nJoin the ranks of the Stalkers.", "metacritic": null, "released": "2021-09-16", "tba": false, "updated": "2021-09-17T03:57:58", "background_image": "https://media.rawg.io/media/screenshots/116/1167620af0b59dbbb07fe86f7cb50184.jpg", "website": "https://vk.com/worldofstalkers", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 361, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["FragZonaGame"], "genres": ["Action", "Massively Multiplayer"], "publishers": ["FragZonaGame"], "esrb_rating": null}