{"id": 665000, "slug": "hedgie-simulator", "name": "Hedgie Simulator", "name_original": "Hedgie Simulator", "description": "<h3>Trapped within the offices of a large hedge fund called Sipadel Finance. It's your job to take a sip and make the apes dip.</h3><br/>Hedgie simulator is joke perspective of how hedge funds operate. As the player, you work as a hedge fund manager trying to make the big bucks using whatever method you can to win. Using traditional methods of buying and selling, shorting and of course the legendary <strong>Naked Shorting</strong> options you can manipulate the market as you strife forward trying make the GameShop GME stocks value hit 0.<br/><br/>However you should be weary, strange noises have been heard within in the offices. The sounds of Ooga and the Booga. They say Apes are on the loose shouting words like diamond hands and HODL.<br/><br/><strong>Game Features:</strong><h3>Trade on the Market</h3>Buy and sell shares the GameShop GME stock on the market. Fight or utilise the growing interest of the stock to make billions.<h3>Short Sell</h3>Why buy your own shares? when you can just barrow someone elses?<br/> Borrow multiple loans of the GameShop GME stock and trade it away to make a quick buck. Be sure to cover that short before the deadline.<h3>Naked Short</h3>The market price getting too high for your liking? Just naked short it. Watch everyone dip while you sip on a nice cup of coffee.<h3>FUD and Back Alley Dealings</h3>You ever think social media was a mistake. Watching communities work together to grow a stock, well now you have a solution. Just deploy FUD. Maybe pay off a few News stations, some articles here and there. And well if that doesn't work just pay the retail investment platforms off. Have them block new buy orders.", "metacritic": null, "released": "2021-09-16", "tba": false, "updated": "2021-09-17T03:54:30", "background_image": "https://media.rawg.io/media/screenshots/703/7038f1b9c88d9fedaa6d53081a4b7625.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 135, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Eltar"], "genres": ["Simulation", "Indie"], "publishers": ["Eltar"], "esrb_rating": null}