{"id": 665066, "slug": "mars-itch-ionking1151", "name": "Mars (itch) (IonKing1151)", "name_original": "Mars (itch) (IonKing1151)", "description": "<p>How to play:</p>\n<p>At the start, if you do not want to sit through the intro, click the Mars planet. You can click and drag the lander to move it. Then, to get more ore miners (light blue, cost 10 ore, 1 ore every 5 seconds) click on one after you get 10 ore. Don't forget to press qwertyuiop at the beginning, because it will build more collection rovers (grey rover cost 20 ore and produces 2 ore per 4 seconds, yellow miner cost 30 ore and produces 1 gold per 5 seconds, green miner cost 10 gold and fifty ore and mines 1 regolith every 5 seconds, dark blue miner cost 10 regolith, 30 gold and 100 ore and collects 1 obsidian ore per 5 seconds, and that is all the qwertyuiop miners.) After you get more obsidian miners and enough research, collected by people, you can get a steel factory (green), which turns 5 obsidian into 1 steel every 10 seconds. To get another, you will need 5 steel. You can also get a steel miner for 50 steel and mines 1 steel per 5 seconds. After a little while, you will get a black and grey factory which generates 1 oil per 10 seconds out of 5 steel. Getting another of these factories costs 5 oil. You can also get a black miner that mines 1 oil every 5 seconds, which costs 50 oil.</p>\n<p>⭐= project that I worked hard on</p>\n<p>TIP: get as much panel power as possible, as it will pave the way to transcendence... when I say a lot, I mean a LOT (500,000)</p>\n<p>TIP #2: get as much raw ore and sand as possible to build up your sandbags to stop the flood</p>\n<p>ps: press qwertyuiop at beginning</p>\n<p>z: show variables</p>\n<p>x: hide variables</p>\n<p>click: buy another</p>\n<p>q= ore miner (grey, 20 ore)</p>\n<p>w= gold miner (gold, 30 ore)</p>\n<p>e= regolith miner (green, 10 gold, 50 ore)</p>\n<p>r=obsidian miner (bluish-greenish, 30 gold, 100 ore, 10 regolith)</p>\n<p>y= steel miner(purple, 50 ore)</p>\n<p>u= oil miner (black, 50 oil)</p>\n<p>a= show knowledge graph</p>\n<p>s= hide knowledge graph</p>\n\n\n<p>            --------------------Updates--------------------</p>\n<p>1.40.1 bug fixes</p>\n<p>1.40.0: added a warning message at beginning, added new achievement</p>\n<p>1.39.9: added more lore, changed update log</p>\n<p>1.38.9 bug fixes</p>\n<p>1.38.8: added more achievements cuz why not</p>\n<p>1.37.8 bug fixes</p>\n<p>1.36.8 : Story Achievements added, larger versions of achievements that can be removed by clicking them</p>\n<p>1.35.8 : capitol building and solar panels now have to be unlocked using ore, also changed some things that makes the elements of the game work better together</p>\n<p>1.34.8 beta: added an unbreakable red metal alloy of a thousand substances all around the universe called Unmeracictanium , and to craft this medal forged by the gods themselves, you need a Unmeracictanium Nerioniver, a furnace with the power to melt planets trillions of light years away. This is the future of Mars, and interplanetary excavation can now be achieved, and the ice age that we are stuck in will slowly melt away.</p>\n<p>1.34.7 : added new achievements (ana update)</p>\n<p>HUGE 1.33.7 update: added over 10 new features: New items added: coal, raw titanium, titanium, titanite, unobtanium. Other updates: Coal furnace, titanium blast furnace, titanite blast furnace, unobtanium blast furnace. Also removed pressing A to delete rovers</p>\n<p>1.32.7 : Added ore per second and SpentOre (not visible) also added new achievements</p>\n<p>1.31.7 : Fixed a glitch that have been out for a very long time: infinite steel, this is no longer possible</p>\n<p>1.30.7 : Custom life is the future...</p>\n<p>1.29.7 : Next gen achievements added</p>\n<p>1.28.7 : Added Atmosphere Generators and purity, achievements to go along with it</p>\n<p>1.27.7 : Achievements added</p>\n<p>1.26.7 : A LOT of animation changes are under work... as of right now, it's only the menu</p>\n<p>1.25.7 : I know some people have been confused on what to do, so I added onto the tutorial... if more people are confused, then I will make an entire scratch project dedicated to a tutorial. </p>\n<p>1.24.7 : fixed the \"My Save\" glitch</p>\n<p>1.24.6 : Scratches 300 clone limit is no longer a problem</p>\n<p>1.23.6 : Changed design of the flood, </p>\n<p>1.22.6 bu... man there's a lot of bugs to fix!</p>\n<p>1.22.5 bug fixes</p>\n<p>1.22.4 : click to skip intro</p>\n<p>1.21.4 bug fixes</p>\n<p>1.20.4 : Added Neptune and ice.</p>\n<p>1.19.4 bug fixes</p>\n<p>1.19.3 : added Other Side</p>\n<p>1.18.3 : water moves slower, miner rover mines automatically, generating 2 raw ore, sand bag now takes only 5 sand and 5 raw ore</p>\n<p>1.17.3 : bug fixes</p>\n<p>1.16.3 : changed music AGAIN</p>\n<p>1.15.3 : changed music (runs smoother)</p>\n<p>1.14.3 : added menu (wait 30 seconds and game will start)</p>\n<p>1.13.3 bug fixes</p>\n<p>1.12.3 : added levels</p>\n<p>1.11.3 beta: added water, sand maker, sandbags, sand, also changed background a little</p>\n<p>1.10.3 : god power can now be used to summon the god of dark and light, fake cardboard demon has been added, true knowledge has been added, raw ore can be mined using personnel rover</p>\n<p>1.9.3 beta: added god power and The Miner of the Gods, which mines god power from the center of the earth (god power is useless right now)</p>\n<p>1.9.2 : changed design of oil miner</p>\n<p>1.8.2 : press S to delete ALL solar panels</p>\n<p>1.7.2 : added transcendence, and numerous costumes to match</p>\n<p>1.6.2 : added aliens, mutations, fur, alien research, panel power, uranium and gave the capitol more costumes</p>\n<p>1.5.2 bug fixes (changed name of error to 3r04, and can now press A to delete old rovers)</p>\n<p>1.5.1 : added capital, civics and error</p>\n<p>1.4.1 : added many more items</p>\n<p>1.2.1 bug fixes</p>\n<p>1.2.0 : moveable rover, dog and cat</p>\n<p>1.1.0: electric thingies added</p>\n<p>1.0.0 : oil added</p>\n<p>Release: I regret everything...</p>\n\n<p>Special thanks to SoundTrap, I used this to make the music</p>\n<p>My account: https://www.soundtrap.com/damionyoung26</p>", "metacritic": null, "released": "2021-09-17", "tba": false, "updated": "2021-09-17T04:32:24", "background_image": "https://media.rawg.io/media/screenshots/1f7/1f77d754e45dcb82746810a8b422a6ee.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 6, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["IonKing1151"], "genres": [], "publishers": [], "esrb_rating": null}