{"id": 665026, "slug": "alphalink", "name": "AlphaLink", "name_original": "AlphaLink", "description": "AlphaLink pits players in a 2D dystopian intergalactic arena multiplayer battle to shift the tides in the war of factions! Pick a faction, find some friends, and engage in the fight of your life in local or online matches! Earn XP and Galactic Credits to unlock new cosmetics like armor, helmets, guns, and more! Features \"stop and pop\" style aiming system (not a dual stick shooter) for slower, more calculated aiming. Suit up and jump in!<br/><br/><strong>Other Features:</strong><br/>- Hub area to engage with NPCs to reveal lore in the Kova universe.<br/>- Multiple game modes for online and local play<br/>- Faction standings and leader boards<br/>- Various weapon pick ups<br/>- XP and progression system<br/>- Wide range of cosmetics to personalize your player<br/>- Beautiful array of hand-painted levels<br/>- Supports Xbox controller and Experimental Mouse and Keyboard Controls<br/><br/><br/><br/><strong>Weapons and Upgrades</strong><br/><br/>Within matches, players can find pick ups for different weapons like the strategic \"Proximity Vector\" or upgrades like \"Rapid Reload\".<br/><br/><br/><br/><strong>The Meat Grinder Hub</strong><br/><br/>In the Hub, you can view faction leaderboards, customize your character's appearance, talk to NPCs, and deploy to matches. The Hub gives you a place to view things in one place while offering a glimpse into the cyberpunk aesthetic that encapsulates AlphaLink's major deployment sector.<br/><br/><br/><br/><strong>Customization</strong><br/><br/>Players can update their appearance by unlocking new suits, gun skins, and banners. Win matches to gain XP and credits and spend them in The Hub! Try completing the Single Player experience to unlock exclusive faction-specific armor!<br/><br/><br/><br/><strong>Controls</strong><br/><br/>AlphaLink is <strong>not </strong>a twin stick shooter. The controls take on characteristics, we refer to as 'Stop and Pop', of similar games in the genre. The player only has three shots by default, so aiming is crucial. Holding \"Aim\" will put the player in an aim state and then allow them to fire. The controls are simple but take some practice to master. <br/><br/>Currently AlphaLink supports Xbox One controller with more controllers being added. Keyboard and mouse is currently supported as experimental features in Early Access.<br/><br/><br/><br/>What are you waiting on! Suit up soldier! We look forward to seeing you on the battlefield!", "metacritic": null, "released": "2021-09-30", "tba": false, "updated": "2022-12-19T04:02:09", "background_image": "https://media.rawg.io/media/screenshots/3e0/3e05e334db8ed6cd76d099e7638cf4f6.jpg", "website": "http://www.kovagame.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 209, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Xbox One"], "developers": ["Black Hive Media"], "genres": ["Action"], "publishers": ["Black Hive Media"], "esrb_rating": null}