{"id": 6652, "slug": "mechanic-panic", "name": "Mechanic Panic", "name_original": "Mechanic Panic", "description": "*** Check out our newest game, &amp;quot;Drop Drop Zoo&amp;quot;, available now on iOS for FREE! http://itunes.apple.com/app/id984311392 ***<br/><br/>Featured in Apple&amp;#39;s &amp;quot;New and Noteworthy&amp;quot; &amp;quot;What&amp;#39;s Hot&amp;quot; and &amp;quot;Staff Favorites&amp;quot;!<br/>*** Over 400,000 downloads! Join in! ***<br/><br/>&amp;quot;Mechanic Panic is very well suited for its platform and offers a winning, endlessly replayable game design that will help you kill a lot of time on your commute or a flight&amp;quot; - Kotaku.com<br/><br/>&amp;quot;It’s very simple, very addictive and infinitely replayable, which is how I prefer my iPhone games&amp;quot; - GamePro.com<br/><br/>&amp;quot;It&amp;#39;s a very addictive game that you can play for a minute here and there, making it perfect for mobile gaming&amp;quot; - Destructoid.com<br/><br/>&amp;quot;Mechanic Panic will be one of the games high on my list of Top Games of 2011&amp;quot; - Bob &amp;#39;Ashyukun&amp;#39; Babcock - The Appcast<br/><br/>&amp;quot;Mechanic Panic is one of the most fun casual jumping games I have come across&amp;quot; - Touchgen<br/><br/>&amp;quot;The unique features and unexpected elements help make Mechanic Panic an excellent addition to the survival jumping iOS library&amp;quot; - Slide Gamer<br/><br/>&amp;quot;A great new addition to any survival gamers collection&amp;quot; - Gamezebo<br/><br/><br/>Work was great, until the day the elevators stopped working.<br/>A catastrophic explosion has rocked the world&amp;#39;s first Space Elevator. Thankfully you&amp;#39;re on the job!<br/><br/>As the fearless mechanic, jump as high as you can to save all the people in peril. The environment around you is crumbling. Beware of the many hazards that will come crashing down. <br/><br/>Oh and don&amp;#39;t forget about the burning fireball of doom rising up.<br/><br/>Highlights:<br/>- Simple &amp;quot;One Touch&amp;quot; action game lets you be the Hero<br/>- XP and Level up system. In-game objectives<br/>- Play the slots to unlock robot buddies<br/>- Unlockable skills<br/>- Dynamically generated gameplay makes every climb unique<br/>- Save falling civilians and fellow mechanics, or let them perish…<br/>- Avoid falling hazards and tricky wall obstacles<br/>- Game Center enabled. Challenge your friends and earn achievements<br/>- Compatible with your music library<br/><br/>Mechanic Panic is memory intensive. If you are experiencing crashing, please reboot your device/close background applications. Mechanic Panic does NOT support jail broken devices.", "metacritic": null, "released": "2011-03-11", "tba": false, "updated": "2019-10-22T14:28:21", "background_image": "https://media.rawg.io/media/screenshots/69b/69b033a2a6f0ac4a08fd2e4c51d94e58.jpeg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 82, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Jeffrey Yim"], "genres": ["Action", "Arcade"], "publishers": ["Jeffrey Yim"], "esrb_rating": "Teen"}