{"id": 665285, "slug": "fnf-testground", "name": "FNF TestGround", "name_original": "FNF TestGround", "description": "FNF TestGround - The real FNF Character playground!\r\n<p>Test your favorite Friday Night Funkin characters in a single game! Take in mind that this game will get updates from time to time with new characters, so, each time you visit it you will find new stages to play!</p>\n<p>Currently, in this<strong> FNF TestGround</strong>, you will find the following characters to test around:</p>\n<ol><li> AGOTI</li><li> Garcello</li><li> Luca</li><li> Whitty</li><li> Flippy (Fliqpy)</li><li> Girlfriend</li><li> Monika</li><li> Ruv</li><li> Shaggy</li><li> Tricky</li><li>Miku</li><li>TO BE CONTINUED...</li></ol>\n<p>As you can see, there are today 11 different characters to test. Each one comes with multiple animations, cutscenes, hidden animations, tricks, vocals, and instrumentals.</p>\r\nAll the FNF Test games in a single, big and awesome playground!\r\n<p>You can play FNF TestGround in full-screen too! In the right of the game, you have an icon with an 'i' from the information. Hit it to see all the credentials for each character from the game.</p>\n<p>Use the arrows to move up and down to see all the FNF characters. Hit the head to load the game. I tried to make this game unblocked, but I'm not 100% it will work from the school computers. </p>\n<p>Please have patience. Some Friday Night Funkin' test mods will load slowly because they are big - for example, FNF Tricky Test.</p>\r\nA new and improved Friday Night Funkin test game mod - FNF TestGround!\r\n\r\n<p>I will try to update the game as much as I can!</p>\n<p>Oh, this game is made in Construct 3, so, it is compatible with any device that supports HTML5, including computers, laptops, tablets, phones, and even some smartwatches.</p>\n<p>Did I say that the game is free, online, and awesome?</p>\n<p>If you like it, please don't forget to rate it and share it with your friend!</p>\n<p>Have fun! :)</p>", "metacritic": null, "released": "2021-09-16", "tba": false, "updated": "2021-09-17T05:29:07", "background_image": "https://media.rawg.io/media/screenshots/82c/82ce779c58e7670d6997fd09153ed173.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 105, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["StefanN"], "genres": [], "publishers": [], "esrb_rating": null}