{"id": 665387, "slug": "london-of-shakespeares-time", "name": "London of Shakespeare's Time", "name_original": "London of Shakespeare's Time", "description": "<em><strong>“Really? This place is in shambles.”</strong></em>\n<p>You are an <em><strong>astronaut</strong>.</em> Your partner is an <em><strong>android</strong>. </em>Your jobs consist of exploring a dead planet called Earth and gathering information about the people that used to live there. This abandoned museum is no different.</p>\n<p>A very short game made in three weeks for a class project. It looks very basic and I have no plans to update anything that's a bit finnicky.</p>\n<em><strong>HOW TO PLAY:</strong></em>\n<p>The bolded orange text or \"&gt;&gt;\" are links that advance the pages like a URL, minus THE ASTRONAUT'S name. The \"Go back.\" links might appear blue and then pink when you hover over them. They still act the same as links.<br/></p>\n<em><strong>KNOWN ISSUES:</strong></em>\n<p>If you are blocking all cookies or third-party cookies in your browser the sound will not work and you will get an error.</p>\n<em><strong>For Chrome:</strong></em>\n<p>Click the three dots on the top right corner under the X. Go to Settings. Click Privacy &amp; Safety. Click Cookies and other site data. Click \"Allow all cookies.\"</p>\n<em><strong>For Firefox:</strong></em>\n<p>Click the three lines at the top right of Firefox. Scroll until you see Settings and click that. Scroll until you see Privacy and Security and click that. Scroll until you see Cookies and other site data. Click that, and then click \"Allow all cookies.\"</p>\n<em><strong>For Opera GX:</strong></em>\n<p>Click the gear on the left sidebar. Scroll until you see Privacy and Security. Cookies and other site data is the second link the in section. Click that, and hit \"Allow all cookies.\"</p>", "metacritic": null, "released": "2021-09-15", "tba": false, "updated": "2021-09-17T05:53:49", "background_image": "https://media.rawg.io/media/screenshots/31f/31f185004e08ada28d846ec4ced59295.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 15, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Appelsina"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}