{"id": 665441, "slug": "samurai-slaughter-house-early-access", "name": "Samurai Slaughter House (Early Access)", "name_original": "Samurai Slaughter House (Early Access)", "description": "<p>Samurai Slaughter House is a <strong>PCVR ONLY</strong> action adventure game with lite RPG features.<br/></p>\n<p><strong>The game is still currently in development so there is a relatively small amount of content at the moment and there will likely be bugs here and there.</strong></p>\n<p>I will be updating the game regularly to add more content and increase the quality and stability of the game.</p>\n<p>Purchasing that game here will also entitle you to a Steam key when the full game launches (likely Q4 2022 to line up with the launch of PSVR2).</p>\n<p>Besides purchasing the game here, you can also get access to the latest build of the game on my Patreon as well as my other creations for<strong> only $5</strong> a month. Once reaching $30 total in Patreon subscription fees, you will be give an Itch key to keep and be marked down to receive a Steam key when the full version of the game launches. I recommend getting the game through Patreon so that you can also have access to the other things I upload.</p>\n\n<p>Samurai Slaughter House is a semi-linear open world game (similar to games like Zelda or Pokemon) in which players will be able to explore various areas, including towns with NPCs that give quests that will give the player rewards, advance the story, and/or unlock new areas.</p>\n<p>The game is currently more of a sandbox with only a few quests but I will be updating the game with the first chapter of the game's full -length story soon.</p>\n<p>There will be much much more added to the game but here is what is in the work-in-progress build <strong>as of now</strong>.</p>\n<p> - 4 zones to explore</p>\n<p> - 8 enemy types</p>\n<p> - 3 weapons, including throwing stars</p>\n<p> - 1 NPC companion that can be asked to join you in combat</p>\n<p> - 1 non-combat NPC the gives out quests.</p>\n<p> - 3 quests</p>\n<p> - Multiple non-weapon items that can be used as make-shift weapons</p>\n<p> - Fishing (probably different than what you're expecting but a lot of fun)</p>\n<p> - An optional 3rd person camera (only affects output to main monitor, game will still be in 1st person for view in HMD) that is great for streaming and content creation.</p>\n<p> - Two original soundtracks, drum 'n' bass and Lo-fi (player may chose if they wish to hear tracks from one or both albums)</p>\n<p> - Intense volumetric blood effects (can be turned off in settings)</p>", "metacritic": null, "released": "2021-09-15", "tba": false, "updated": "2021-09-17T06:08:57", "background_image": "https://media.rawg.io/media/screenshots/81f/81fcd97708b924a314a000c95fa33d21.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 381, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Tab Games"], "genres": ["Adventure", "Fighting"], "publishers": [], "esrb_rating": null}