{"id": 665680, "slug": "path-of-shield", "name": "Path of Shield", "name_original": "Path of Shield", "description": "<p>This is a one level version of our prototype for the game <strong>Path of Shield</strong>. The game has been started to get developed for the purpose of being our final project for our course, Experience Design Practices.</p>\n\r\nRules:\r\n<p>-<strong> WASD </strong>keys are for moving. Character speeds up <strong>in time</strong> so, the player should keep moving until the <strong>Shield</strong> pops up and starts protecting from the turrets around.</p>\n<p>- <strong>Turrets</strong> have 10 bullets per magazine. Once the player gets into their <strong>range</strong> they will start to shoot. Once their <strong>magazine</strong> is empty, they will take couple of seconds to reload, which makes them vulnerable for destroying. Taking <strong>cover</strong> would also help in order to escape from them.</p>\n<p>- Once again, if the <strong>required speed</strong> is reached by the character the Shield becomes a throwable and can be used to destroy the turrets. Remember, <strong>throwing the Shield</strong> would make the player vulnerable for brief seconds, as it won't be in his / her inventory to use until it<strong> teleports</strong> back.</p>\n\r\nNotes:\r\n<p>This is a very brief showcase of our main mechanic that depends of a choice of vulnerability versus a chance using a weapon. Also the game features a lot of UI and UX elements for the relevant course that has been taken by us. So, this is a very early version of a product that has been made in a very limited time.</p>\n\r\nTeam:\r\n<p>-<strong> Izel Levi</strong> / Designer and Developer</p>\n<p>- <strong>Atakan Düzyol</strong> / Animator, Sound Designer, Level Designer and 3D Artist</p>", "metacritic": null, "released": "2021-09-14", "tba": false, "updated": "2021-09-17T07:12:30", "background_image": "https://media.rawg.io/media/screenshots/f2c/f2c8f4c5cda4d28f8dab0b569deb3e1d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 126, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Izel Levi"], "genres": ["Action"], "publishers": [], "esrb_rating": null}