{"id": 6658, "slug": "little-raiders-robins-revenge", "name": "Little Raiders: Robin’s Revenge", "name_original": "Little Raiders: Robin’s Revenge", "description": "Little Raiders is a wonderful mixture of adventure, combat and building experience. Build your village, raise your army of Raiders, recruit unique heroes and equip them with legendary weapons.<br/><br/>5/5: “I am really enjoying this game. It is a delightful change from many other games!”<br/>5/5: “It&amp;#39;s games like this that are just too awesome! Super addictive, always fun to play and the levels are challenging!”<br/>5/5: “This game is just beautiful, the gameplay is easy there is a lot of content so it will keep you playing for weeks!”<br/><br/>… And many more players loving this unique and incredibly polished game!<br/><br/>FEATURES:<br/>•         5 Heroes to rescue and train<br/>•         15 different buildings types to create your own village<br/>•         200+ weapons to collect and equip on your Raiders<br/>•         5 Special Powers to master<br/>•         Hundreds of missions to get awesome rewards<br/>•         Epic Boss battles<br/>•         Craft your own weapons and produce the resources your need<br/>•         Dozens of enemy types<br/>•         3 Regions to conquer<br/>•         Play with friends<br/>•         Over 80 Game Center Achievements to complete!<br/>•         Supported languages: English, French, Italian, German, Spanish, Japanese, Russian, Korean, Brazil/Portuguese &amp;amp; Simplified Chinese<br/><br/>Join the adventure now!<br/><br/>PLEASE NOTE<br/><br/>Little Raiders is free to play, you can choose to pay real money for some in game items which will charge your iTunes account. You can disable in-app purchases by adjusting your device settings.<br/><br/>We’re really sorry, but Little Raiders doesn’t work on iPhone 4. <br/>We tried very hard to accommodate this device, but we weren’t able to create the experience we want you to have.<br/><br/>Disappointed? Please contact our customer support and let us know.<br/><br/>Having issues? Try http://bit.ly/LR-FB", "metacritic": null, "released": "2014-08-28", "tba": false, "updated": "2019-10-22T14:28:21", "background_image": "https://media.rawg.io/media/screenshots/5dc/5dc98f487a019ec34637a4b0b3d545c9.jpeg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 193, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ubisoft"], "genres": ["RPG", "Strategy"], "publishers": ["Ubisoft Entertainment"], "esrb_rating": "Everyone 10+"}