{"id": 66589, "slug": "goat-mountain-the-treacherous-hill-climb-of-the-ib", "name": "Goat Mountain (The Treacherous Hill Climb of the Ibex Formally Known as Rampage)", "name_original": "Goat Mountain (The Treacherous Hill Climb of the Ibex Formally Known as Rampage)", "description": "Have you ever thought, Man those goats jumping up and down those gigantic mountains were boring?<br/><br/>NO YOU HAVEN'T! BECAUSE THERE IS NO GREATER SITE IN THE WORLD!  THE GOAT FORMALLY KNOWN AS RAMPAGE MAKES SLIGHT WORK OF ANY VERTICALLY CHALLENGED SITUATIONS YOU MAY HAVE FOUND YOURSELF IN..... EVER<br/><br/>FROM ROCK TO ROCK AND TREE TO TREE YOU JUMP LIKE A MAJESTIC IBEX OF THE NORTH, CLIMBING TO YOUR HEARTS DESIRE, UNTIL YOU REACH THE SUMMIT OF YOUR DREAMS AND STAND VICTORIOUS ATOP THE MOUNTAIN TOP OF MARVELOUSNESS.<br/><br/>YOU DON'T KNOW HOW TO PLAY?  GREAT!<br/>IF YOU DID I WOULD EXPECT NOTHING LESS THAN 4 PAGE PAPER ON WHY THE MOON IS NOT MADE OF CHEESE (IS IT? I DON'T KNOW, AND NEITHER DO YOU, BECAUSE YOU HAVEN'T BEEN THERE!)<br/><br/>ON THE SUBJECT OF THE MOON, THAT'S WHAT YOU'RE SHOOTING FOR, THE MOON, THE SUN, THE SKY, THE INFINITE ABYSS OF AWESOMENESS (YOU CAN FIND ME DOWN THE HALL AND TO THE RIGHT)<br/><br/>OH GAMEPLAY.. RIGHT.....<br/>TAP THE SCREEN IN THE DIRECTION YOU WANT TO JUMP, AND LIKE A ROCKET SPACESHIP WATCH AS YOUR IBEX EXPLODES WITH A MOMENTUM THAT CAN MOVE MOUNTAINS (LITERALLY, AND FIGURATIVELY).<br/><br/>YOU MAY HAVE TO TAKE NOTES, BECAUSE THEIR IS A WAY UP THESE MOUNTAINS, AND A WAY DOWN.  AND IF YOU DON'T FIGURE OUT THE WAY UP, YOU WILL FIND YOUR WAY DOWN.  <br/><br/>GRAB LIFE BY THE HORNS (THE IBEX HORNS) AND JUMP TO AN INESCAPABLE FATE OF TALLS MOUNTAINS, GLORIOUS SCENERY, AND OF COURSE.....<br/>AWESOMNESS!", "metacritic": null, "released": "2014-05-16", "tba": false, "updated": "2019-07-29T08:25:23", "background_image": "https://media.rawg.io/media/screenshots/8c0/8c0d6135f5c567550e09be770b9978de.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 71, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["FAD Games"], "genres": ["Adventure", "Arcade", "Casual"], "publishers": ["FAD Games"], "esrb_rating": null}