{"id": 66601, "slug": "bubble-coco-color-match-pop", "name": "Bubble CoCo: Color Match Pop", "name_original": "Bubble CoCo: Color Match Pop", "description": "Aim your bubble cannon and blast away!<br/><br/>Shoot bubbles with your trusty bubble shooter, and pop your way to victory!<br/><br/>CoCo the mother hen knows her baby chicks are a handful...they get into sticky situations on a daily basis! CoCo is one special chicken though: she owns a fancy magic bubble shooter cannon. She request your help in her bubble popping endeavor, so she can rescue her troublemaker baby chicks stuck in bubbles and treetops! Aim, shoot, and pop all the bubbles in this FREE to play bubble shooter game!<br/><br/>Blast away in the bubble pop adventure with bubble bird CoCo and her bubble shooter cannon!<br/><br/>[Bubble CoCo Features]:<br/>* Bubble popping, bubble shooting, bubble mania!<br/>Bubble CoCo combines a classic bubble shooter arcade game with fun power up items and various game modes in hundreds of levels! More than 1200 levels are waiting to challenge your bubble shooting skills!<br/><br/>* Boosters and modes to entertain all!<br/>Bubble CoCo is a bubble game with a captivating challenge! Addictive game modes, helpful booster buble, and constant NEW game level updates so you can enjoy never ending bubble games!<br/><br/>* Easy, intuitive control!<br/>Bubble CoCo is as easy has 1, 2, 3! Aim the bubble, shoot the bubbl, and pop the bubble! The power of the bubble shooter is right at your fingertips! Not one stray lost bubble under CoCo's watch! Fire that red bubble to the top!<br/><br/>* New game EVENTS and rewards!<br/>Bubble CoCo will hold fun game events everyone can enjoy, such as the Egg Festival! Participate in new events so you can earn rewards for your bubble pop adventure!<br/><br/>* Play with or without friends!<br/>Send gifts, request help, and compete against friends to see who is the best hand at the bubble shooter! Bubble CoCo is also playable WITHOUT an internet connection, so you can continue your bubble blitz bubble games anytime, anywhere!<br/><br/>* Colorful and vibrant graphics!<br/>Looking for free bubble pop games with rich colors and cute characters? Beautiful graphics with bubblegum pink, island blue, and witch purple! Check out the eye popping, bubble popping Bubble CoCo now! Blast bubbles with color match cannons! These bubles are asking to be popped! Bubble CoCo is the cute bubble game you are looking for!<br/><br/>* No eggs left behind!<br/>Help CoCo the chicken protect her eggs! The mother hen is definitely one angry bird if she gets her eggs stolen! We don't want Mr. Fox getting his hands on an egg, do we? Blast the bubbles before you get a bunch of angry birds in this shooter match 3 game! <br/><br/>* The best bubble game for you!<br/>We are talking about the best bubble game for kids and family! Not just the best matching games for adults, but also matching games for kids! Blast away boredom with the best bubble shooter game! Looking for freebubble games? Go on your very own bubble pop adventure with CoCo and the bubble birds! You won't need to search for any other free bubble games! No lost bubbles here: bubble bobble, pop your bubble! <br/><br/>-----------------------------------------<br/>Look out for Bubble CoCo's Bubble Shooter news and events on the official fan page:<br/>https://www.facebook.com/playbubblecoco<br/><br/>Visit the Bubble CoCo Help Center: http://www.bit.ly/BC_help<br/><br/>POP!", "metacritic": null, "released": "2015-09-23", "tba": false, "updated": "2019-07-29T08:39:07", "background_image": "https://media.rawg.io/media/screenshots/705/705eddfcde4f0a0c9d06727a93c93daf_BcaV5Hx.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 47, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["CookApps"], "genres": ["Arcade", "Casual", "Puzzle"], "publishers": ["cookapps"], "esrb_rating": null}