{"id": 66609, "slug": "popstar-star-blast-puzzle-game", "name": "PopStar-Star Blast Puzzle Game", "name_original": "PopStar-Star Blast Puzzle Game", "description": "What are you waiting for? Join other 4 million people and play together the game “PopStar!”<br/><br/>【Thoughtful design – excellence experience】 Popstar has over 4 million fans. As well as, the stars that have been popped could almost cross the galaxy many round. The graphic of the game is fresh and the method is very easy to handle. To be specific, the player only need to pop the similar colors which next to each other and then get the point.  Meanwhile, there are no level limits, once you start, never stop!<br/><br/>【Creative method: Matching + Puzzle】 Combine “PopStar” with “Tetris” together, create a new entertainment way. Players could find so much fun from it, what they need to do is just fulfill different sharps of star in one Horizontal or vertical line. Once you click the download bottom, you could experience those two types of game play and got dozens happiness.<br/><br/>【Save star】For this function, we add more level challenges and interesting elements to it. You can tap one star or more stars with same color to clear them. After clearing, the Save star will be moved up automatically. When they move to the top, game will be over. Single star can also be cleared now for this new version!  <br/><br/>【Intellectual challenge】Puzzle Stars has two kinds of levels, includes the simple level and the hard level. Stars in this mode have very various styles. You need to clear all the stars in the level then you can pass it. Although the style in each level is so cute , you also need to be careful.<br/><br/>【Link star】Link star contains a lot of level packages. Each level has been restricted by step and cover. If you want to own the full-star, you need to concentrate on the two indexes. Come on…<br/><br/>The game setup rich daily price, daily duty, and level challenge etc. Interesting contents, full of surprises and gifts make PopStar become a very funny ‘time killer’ game. Once start, never stop!<br/><br/>【Contact Information】<br/>［ PopStar! ］official website: http://popstar.zplay.com/", "metacritic": null, "released": "2014-11-25", "tba": false, "updated": "2019-07-29T08:08:40", "background_image": "https://media.rawg.io/media/screenshots/507/507d20a71579e401d4523da2e83cd5d3.jpg", "website": "http://popstar.zplay.cn/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 42, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["ZPLAY"], "genres": ["Arcade", "Casual", "Puzzle"], "publishers": ["Zplay (Beijing) Info. Tech. Co.,Ltd."], "esrb_rating": "Everyone 10+"}