{"id": 666150, "slug": "peabody-et-sherman-apres-la-pluie-le-beau-temps", "name": "Peabody et Sherman, Après la pluie, le beau temps !", "name_original": "Peabody et Sherman, Après la pluie, le beau temps !", "description": "<p>GAWC6 : Bombardement imminent\r\n  </p>\n<p> \r\n  </p>\n<p> \r\n  </p>\n<p> \r\n  </p>\n<p><strong>Mon Idée </strong>\n</p>\n<p>Retrouvez Mr PEabody et Sherman dans une toute nouvelle aventure !\r\n  </p>\n<p>Evoluez de plateforme en plateforme, en activznt les mécanismes gris (Attaques de Mr Peabody) et orange (Projectiles de Sherman), afin de rejoindre le chronomate tout en haut du niveu.\r\n  </p>\n<p> \r\n  </p>\n<p>Attention cepeandant aux baguettes de pain trop cuites, larguées par des boulangers démoniaques (ouaip je ne suis pas du tout inspiré niveau scénar, je sais XD)\r\n  </p>\n<p>A jouer en coop (une personne à la manette (Peabody) , l'autre au clavier + souris (Sherman) (Option clavier manette modifiable dans le menu pause)\r\n  </p>\n<p> \r\n  </p><p>Détails : ZQSD, barre espace et F : Contrôles de Sherman; Manette Ps4, Xbox ou autre : Contrôle de Mr Peabody</p><p>Si tu passes en mode \"clavier\" pour les 2 persos (ouvre le menu avec enter ou echap, et décoche \"manette + clavier\". Dans ce cas là tu vas contrôler Peabody avec les flèches directionnelles, la barre espace, et clique droit de la souris. Ce qui change pour Sherman, c'est le saut, qui va s'effectuer avec Ctrl gauche...</p><br/>\n<p> \r\n  </p>\n<p> \r\n  </p>\n<p> \r\n  </p>\n<p> \r\n  </p>\n<p> \r\n  </p>\n<p><strong>Ce qui s’est bien passé pendant le Challenge </strong>\n</p>\n<p>Le design global du gameplay.\r\n  </p>\n<p>Level design avec plateformes, pièges, etc...\r\n  </p>\n<p>Interaction entre les personnages pour pouvoir avancer tout au long du niveau.\r\n  </p>\n<p>Motivation au top.\r\n  </p>\n<p> \r\n  </p>\n<p> \r\n  </p>\n<p><strong>Ce qui s’est mal passé pendant le Challenge </strong>\n</p>\n<p>Mauvaise gestion du temps.\r\n  </p>\n<p>Beaucoup de bugs subsistent et obligent à recommencer le niveau depuis le menu pause, notamment le bug des spawner (de plateformes) qui disparaissent (croisons les doigts pour qu'ils ne fassent pas leur show durant le test).\r\n  </p>\n<p>Edit : <strong>Nope problème réglé au dernier moment, grâce à PIK, mon nouveau héro XD</strong>\n</p>\n<p>On peut dire qu’il tombe à pic pour le coup !\r\n  </p>\n<p> \r\n  </p>\n<p> \r\n  </p>\n<p><strong>Ce que j’ai appris durant ce Challenge </strong>\n</p>\n<p>On peut partir d'un concept sur le papier et le modifier dans son essence en cours de route...\r\n  </p>\n<p>Simuler la trajectoire d’un projectile à partir d’un théorème de mécanique.\r\n  </p>\n<p>Au début je souhaitais faire un jeu de type \"plante vs zombie\", avec comme objectif de protéger son propre camp, puis de fil en aiguille, je me suis plutôt orienté vers des phases de plateformes.\r\n  </p>\n<p> \r\n  </p>\n<p>PS : TRES IMPORTANT, ne pas oublier svp de créditer l’origine des musiques utilisées dans le jeu, en description de la vidéo test 😉   </p>\n<p>« Music: https://www.bensound.com »\r\n  </p>", "metacritic": null, "released": "2021-09-13", "tba": false, "updated": "2021-09-17T09:20:29", "background_image": "https://media.rawg.io/media/screenshots/67f/67f67eb10753bebf4a3b32fef967ae6c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 25, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["WilliamTYSON"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}