{"id": 666253, "slug": "watchout-2", "name": "WatchOut!", "name_original": "WatchOut!", "description": "<p>Réalisé sous Unreal Engine 4.26</p>\n<p>L'idée est simple, ça faisait un moment que j'avais envie de faire un mini-jeu classique que l'on peut retrouver dans un Mario Party, Pummel party etc. Et le thème est super bien tombé puisqu'il collait à mon envie. Du coup, WatchOut! est un mini-jeu où le but est de survivre à une pluie de bombe pendant une minute ! Petite spécificité qui me tentait : Il est possible de jouer à deux sur le même clavier !</p>\n<p>Globalement, ça s'est bien passé dans l'ensemble. J'ai pu créer un timer complet que je pourrais réutiliser dans mes autres projets, de quoi gagner un peu de temps !</p>\n<p>Je n'ai pas rencontré de réel difficultés durant le projet mis à part que j'utilise trop de nodes <em>CastTo</em> ou de <em>Get All Actors of Class</em> à mon goût. Le seul autres soucis que j'ai eu, c'est la flemme qui m'a parfois fait perdre du temps.</p>\n<p>J'ai appris à me servir des Dispatchers et surtout à comprendre comment on s'en sert et quelle joie ! J'ai aussi appris à réaliser un jeu en multi local, via écran partagé ou non, et  en passant soit par différent contrôleurs, soit par le même pour chaque joueur et c'est sacrément intéressant ça. Sinon, je pense que la prochaine fois j'essayerais de mieux exploiter le cœur de mon jeu.</p>\n<p>En résumé, c'était un projet agréable et plus enrichissant que le précédent, sur lequel je garde un très bon souvenir.</p>", "metacritic": null, "released": "2021-09-13", "tba": false, "updated": "2021-09-17T09:46:51", "background_image": "https://media.rawg.io/media/screenshots/209/2098f1297a20d8ea972d335fb587cbc6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 46, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Stry"], "genres": [], "publishers": [], "esrb_rating": null}