{"id": 666314, "slug": "harrowing-hunts-vol-2", "name": "Harrowing Hunts (Vol 2)", "name_original": "Harrowing Hunts (Vol 2)", "description": "<p><em>This is a supplement for</em><em> Slayers by GilaRPGs. You will need a copy of that game to use these hunts the way they were intended. I am not affiliated with GilaRPGs.</em></p>\n<p>Harrowing Hunts (Vol 2) is a collection of 6 hunts for use with Slayers, each taking place in a different genre. This does not require  Harrowing Hunts (Vol 1), and is a much sillier collection than that game.</p>\n<p><strong>Slayers: Supers </strong>takes Slayers to a superhero world, where over-the-top villains in four-color capes rob banks and pull off elaborate schemes in the interest of domination! 3 pages.</p>\n<p>\n</p>\n<p><strong>Crimewave </strong>Has the players investigating a string of murders and having to take sides in a battle of gangs, technology, and revenge. Originally envisioned as a sort of steam-tech cyberpunk adventure, this one falls somewhere between police procedural and referee. 7 pages.</p>\n<p><strong>Everything is Fine </strong>is a combatless adventure where the Slayers have to catch a sentient train and teach it to love before it starts a robot uprising across The City. This adventure opens with a passenger broadcasting: <em>“Please help, I'm a passenger on train 33A and everything is fine.”</em>  5 pages. <br/></p>\n<p><strong>Slayers: Noir </strong>is a tropey noir adventure about a cursed tea kettle. It's basically just Malete Falcon brought to Slayers. Recommended to have some extra actors for NPCs on hand. 5 pages.<br/></p>\n<p><strong>The Jewel King</strong> is the shortest adventure in this set, and can be played immediately after <strong>Noir. </strong>It's an epic boss fight about trying to destroy a cursed item in a volcano that's appeared in the middle of The City. There's Orcs and an incredibly powerful Jewel King who needs to be put in his place. The Volcano. His place is the Volcano. 2 pages.<br/></p>\n<p><strong>Space Age Rescue </strong>has the Slayers rescuing a handsome space prince from an oppressive government regime. Can you get his information into the hands of the freedom fighters? 3 pages.<br/></p>", "metacritic": null, "released": "2021-09-13", "tba": false, "updated": "2021-09-17T10:04:18", "background_image": "https://media.rawg.io/media/screenshots/c43/c436999a0d8b191447a8c24ab9c5fade.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 147, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Alex Rinehart"], "genres": ["Action"], "publishers": [], "esrb_rating": null}