{"id": 666377, "slug": "outcast-2-a-new-beginning", "name": "Outcast 2 — A New Beginning", "name_original": "Outcast 2 — A New Beginning", "description": "<p>20 years after the award-winning action adventure hit, Outcast, pioneered the genre of non-linear open-world games, the long-awaited sequel sees Cutter Slade return to the spectacular alien world of Adelpha. Resurrected by the almighty Yods, he has returned to find the Talans enslaved, the world stripped of its natural resources, and his own past intertwining with the invading robot forces. It&#39;s up to him to go on a mission and save the planet again.<br />\nThe original team behind Outcast 1 has reunited to create this fascinating world, full of dangerous creatures and home to the Talan people – an ancient culture whose fate has become inextricably linked with earth since the events of the first game. You play as Cutter Slade, ex-Navy SEAL, sporting the same dry wit he had back in the 90s – however, the world around him has changed and eventually, so will he.<br />\nTo save Adelpha, you will …<br />\nuse your jetpack to jump, air-dash, glide, and quickly traverse the fantastic in-game open world<br />\ncombine dozens of different modules to create your own personal weapon for taking down the robot invaders<br />\nhave total control to approach the story at your own pace in this non-linear world<br />\nexplore the world without boundaries, discover hidden temples and dangerous wildlife<br />\nget familiar with the Talan culture while helping them free their villages and gain access to ancient Talan powers that use forces of nature to destroy your enemies<br />\nexperience a beautiful, hand-crafted world accompanied by an epic soundtrack by Outcast&#39;s original composer, Lennie Moore</p>", "metacritic": null, "released": "2024-03-15", "tba": false, "updated": "2024-04-11T02:58:51", "background_image": "https://media.rawg.io/media/games/cb0/cb06048aa9b03f002af6351b500b4cc9.jpg", "website": "", "rating": 2.33, "rating_top": 3, "added_by_status": {"yet": 3, "owned": 7, "beaten": 2, "toplay": 32, "dropped": 4, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 6, "suggestions_count": 250, "game_series_count": 1, "reviews_count": 6, "platforms": ["Xbox Series S/X", "PlayStation 5", "PC"], "developers": ["Appeal Studios"], "genres": ["Action", "Adventure"], "publishers": ["THQ Nordic"], "esrb_rating": null}