{"id": 666402, "slug": "ji-mo-shen-ming-de-xin-yuan-shou-ji", "name": "寂寞神明的心愿手记", "name_original": "寂寞神明的心愿手记", "description": "<strong>Introduction of the game</strong><br/><br/>This game is a AVG game, which collects adventure, love, and growth. The player will become the Sirazi exile king daughter, step by step to find the truth. During this journey, she will also find their own \"the right person\".<br/><br/>The game has internal whole character plot dubbing, providing various choices and endings to players. Once finished the game round, the player can be opened after the completion of two weeks, unlock more endings and side stories. Players can also trigger special characters’ stories to collect special CGs.<br/><br/><strong>The main story</strong><br/><br/>In a political conspiracy, Silazi kingdom's lieutenant-in-law (played) and dauphin alex have come into exile in the capital of the eastern empire. To make a living, they started running circuses and earning money by taking commission.<br/><br/>An accidental commission let her get acquainted with the mysterious painter · childe Jing that unseen for others. Concomitant the bedeviling commission from sprits, the still have the human of all sorts -- romantic doctor Bu LinFeng, teenager swordsman Mo Feng, month full building head card idol Leng Yuexin…… <br/><br/>In this game, players can find stories about sprite, human beings, and the relationships between them. in this adventure, the political issue of the two countries, the truth about the world and even the true face of god, will gradually opened the curtain. The girl and others can not unlock the \"predestined relationship\" also quietly growing......", "metacritic": null, "released": "2021-09-16", "tba": false, "updated": "2021-09-20T02:09:59", "background_image": "https://media.rawg.io/media/screenshots/a94/a945dc8964ec20f124c66d47d530cc46.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 472, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["妖妖灵制作组", "燃心游戏工作室"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["妖妖灵制作组"], "esrb_rating": null}