{"id": 666473, "slug": "on-the-edge-bryant-games", "name": "On The Edge (Bryant Games)", "name_original": "On The Edge (Bryant Games)", "description": "<p>Finally, Some Time Off! Your boss has given you and your crew the rest of the night off after working double time in the mines. You have some last minute errands to run at work and then you head to your car. When you finally get there, you realize you car wont start. Looks like its better time than nay to start walking,\" You say as you know you have the fitness test coming up in two months. </p>\n<p>As you start to walk, you realize that you've made a wrong turn. You start to turn around retracing your steps, only to realize you are back in the exact same spot. You tell yourself that you must be hallucinating. You start to walk again, only to have the same thing happen. Right back beside this dam campfire, what is going on you exclaim. </p>\n<p>You notice a nurse walking towards you, you try to ask her for directions but she says nothing. As you look closer, you realize she has a knife in her hand and does not llok friendly. You start to run, but as you turn around you see a doctor heading towards your way as well, with an evil looking grin. </p>\n<p>You've made a terrible choice in coming here. Disturbing my work will be the last mistake you ever make. You stumble and fall, as you fall your headlamp comes on. Why am I still wearing this. As the light flashes into the eyes of the nurse, she vanishes and a cross falls in her place. You touch the cross and it instantly disappears into the air. You hear a scream coming from where the doctor was at. </p>\n<p>You fool, do you really believe you can stop me. Girls, get him. </p>\n\n<p><strong>Credit</strong></p>\n\n<ul><li>Pixel Art Forest: Eder Muniz\r\n  </li><li>Ghost Voices – SFX: Patrick Flattery\r\n  </li><li>Dark Mystical Music Park: MakotoHiramatsu\r\n  <ul><li>This asset is released under Attribution 4.0 International (CC BY 4.0) https://creativecommons.org/licenses/by/4.0/\r\n  </li></ul></li><li>Sprite Pack 1: GrafxKid\r\n  </li><li>Serene Village Re-Vamped: LimeZu\r\n  </li><li>Horror Pixel Characters: Maranza\r\n</li></ul>", "metacritic": null, "released": "2021-09-20", "tba": false, "updated": "2021-09-20T02:49:13", "background_image": "https://media.rawg.io/media/screenshots/08b/08b13ac57ab99e359914a44260ca03b4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 82, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Bryant Games"], "genres": [], "publishers": [], "esrb_rating": null}