{"id": 666431, "slug": "trap-genesis", "name": "Trap Genesis", "name_original": "Trap Genesis", "description": "<h3>Overview</h3><strong>A new universe of traps is here!</strong><br/><br/>This is the long-awaited final of the ten-year-old \"Trap\" series! <br/>This is the genesis of a blessed world where Gods, men, and crossdressers can love each other freely! <br/>We invite all our readers to immerse themselves in this brand new world, and be lifted to ever greater heights by this, the holy scripture of the Trap series! <br/>Finally, the advent is upon us!<h3>Characters</h3><br/>Hinowa<br/><h3>\"I'm a god, for realsies!\"</h3><br/><strong>Chaos Crossdressing Goddess</strong><br/>The incarnation of a Komainu enshrined in the shrine.<br/>This klutzy self-proclaimed goddess actually turns out to be a goddess of chaos with the power to destroy the whole world!<br/>She toys with our hero with her newfound powers, but what are her true intentions?<br/>(This is the game's main heroine.)<br/>　<br/>　<br/><br/>Endou Mishiro　　<br/><h3>\"My sister sense if tingling! Sluts are coming after my Maa-kun!\"</h3><br/><strong>Crossdressing Shrine Maiden and Obsessed Sister</strong><br/>A sister that untiringly works for the sake of her love, but also has a dark, potentially dangerous possessive streak.<br/>She finally managed to reconcile and bond with Yui over their love for Masato, and now hope to strive to be the best wives for him they can ever be.<br/>　<br/>　<br/><br/>Yui<br/><h3>\"I shall grant your wish!\"</h3><br/><strong>Sealed Crossdressing Goddess</strong><br/>A crossdressing goddess that was sealed in Kotomusubi shrine's cave.<br/>She is now under the moniker of hinky goddess.<br/>This goddess is reduced to a small, cute form when she runs out of power.<br/>　<br/>　<br/><br/>Takatou Subaru　<br/><h3>\"I want to see less talking and more working!\"</h3><br/><strong>Stickler for Discipline</strong><br/>The previous chief shrine maiden before Mishiro took over her place.<br/>She was reticent about accepting love between men and crossdressers at first, but after acknowledging her feeling for Masato, she has become a supportive and loving part of the ever growing family.<br/>She currently clashing with Mishiro over who's the legal wife.<br/>　<br/>　<br/><br/>Tamaki　<br/><h3>\"My powers are not like those of my sister!\"</h3><br/><strong>Love-Hating Goddess</strong><br/>A crossdressing goddess, and sister of Yui. She is another kind of Hinky goddess, although the nature of her powers is completely opposite from Yui's.<br/>Descending to Earth with the mission of sealing Yui once more, she was cooperating with Subaru to take over the shrine, but after meeting Masato and falling in love with him, she is convinced that love trumps all.<br/>　<br/>　<br/>Masato<br/><strong>Quintessential Protagonist</strong><br/>The chief priest of Kotomusubi shrine.<br/>In addition to Yui and Mishiro, Subaru and Tamaki have become his wives as well, but before he can even think about getting used to his new marital life, he must stand against Hinowa's world-ending threat!<br/>Truly, this man can not catch a break!<br/>　<h3>Story</h3>After settling out the ban on love imposed by Tamaki and Subaru, peace returns to the life of our favorite group. Finally, it's time for the festival... unless a certain kluts of a goddess called Hinowa has a say in it! As luck, would have it, Hinowa turns out to be an ancient goddess of chaos!<br/><br/>As the world as we know it is about to be engulfed in chaos and darkness, our lovely hinky goddesses make a final stand!<br/>Will they be able to save the world?!　Will their love finally be acknowledged?!<br/><br/>Find out this and more, in <strong>Trap Shrine trilogy's riveting finale!</strong><h3>Features</h3><ul><li>Visual novel<br/></li><li>Estimated playtime: 2-4 hours</li></ul>", "metacritic": null, "released": "2021-09-17", "tba": false, "updated": "2022-05-27T08:42:19", "background_image": "https://media.rawg.io/media/screenshots/4fd/4fd657c4f56cde33981f4be3c56fb14d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 14, "beaten": 1, "toplay": 4}, "playtime": 4, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 502, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["No Strike"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Eroge Japan"], "esrb_rating": null}