{"id": 666584, "slug": "pumpkin-keeper-minijam-89", "name": "Pumpkin Keeper (MiniJam 89)", "name_original": "Pumpkin Keeper (MiniJam 89)", "description": "<p>Pumpkin Keeper is a survival and farm game. The main goal is to farm pumpkins and protect the crops from evil beings using your tools and resources around.</p>\n<p>MYTH/ LEGEND (Limitation): A long time ago in Ireland, they used to place harvested pumpkins, well-known as Jack O' Lanterns, to scare evil creatures from their crops when the date of Halloween was approaching.</p>\n<p>To do it a bit more challenging, I limited myself only to use an 8 color palette and an 8x8 canvas.</p>\n<p>Please, feel free to comment what you've liked and disliked about the game or any bugs you found, all the reviews are appreciated!! Thanks!!!</p>\r\nTips when playing: \r\n<p>· To defend your crops from enemies you can build fences and Jack O' Lanterns or kill them yourself. </p>\n<p>· To build anything, you have to go near an special dirt block. (They are all around the crops) and have your building hammer eqquiped. Use Tab to switch between building objects.</p>\n<p>· To do any interaction with the environment that requires any tool, you need that tool equipped. For example, to plant, you must have equipped the hoe and also have seeds in your inventory.</p>\n<p>· To plant, you must water the dirt and place the seed (both of them in no particular order).</p>\n<p>· You can refill the bucket of water when is empty when going near the water and pressing E (Interaction button).</p>\r\nControls:\r\n<p>W,AS,D -- Move.</p>\n<p>E -- Interact</p>\n<p>Tab -- Close Crafting menu and switch in building mode.</p>\n<p>Space -- skip dialog.</p>\n<p>1,2,3,4,5,6 -- to equip/ unequip the tools in the hotbar.</p>", "metacritic": null, "released": "2021-09-19", "tba": false, "updated": "2021-09-20T03:18:48", "background_image": "https://media.rawg.io/media/screenshots/b81/b816c1d65679eba12ebddc97c75ce816.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 23, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Haukrr"], "genres": [], "publishers": [], "esrb_rating": null}