{"id": 666694, "slug": "into-the-swarm-doomlightning", "name": "Into the swarm (doomlightning)", "name_original": "Into the swarm (doomlightning)", "description": "<p>Edit: for some reason the HTML5 its very buggy, for now, pls play in the Arrow instead the WASD, thx</p>\n<p>B.O.C.C (Bionic Operator Control Center) are special bionic computers whose was purpose was to control the gray goo.</p>\n<p>but one day, they could no longer be controlled and now they've begun their brutal rampage.</p>\n<p>You, the most advanced version of B.O.C.C must go straight into the eye of the storm in order to stop them before it's too late!</p>\n<p>only one problem, your aircraft has no weapon other than a shock wave and is almost entirely dependent on an external weapon capable of creating shock waves in various forms, but is also much less mobile than itself.</p>\n<p>Will you be able to survive and plow your way into the eye of the storm?</p>\n<p>Into the swarm is a prototype created following \"VimJam 2: Boss [8 Bits to Infinity]\", inspired by 1942 and Chicken Invasive-style games, and tries to be true to their retro style with some modern points.</p>\n<p>This is the first game I have ever made in this way and although it's not the most stable game in the world, I'm proud of it that I managed to meet the goal that I've failed so many times before.</p>\n<p>It's unbalanced and difficult, but that's because there was no time, so I hope you'll forgive me on that front.</p>\n<p>Enjoy!</p>", "metacritic": null, "released": "2021-09-19", "tba": false, "updated": "2021-09-20T03:44:23", "background_image": "https://media.rawg.io/media/screenshots/a4a/a4a2c3e74375c91e41f7e53edf4d40a4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 10, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["doomlightning"], "genres": ["Action"], "publishers": [], "esrb_rating": null}