{"id": 666636, "slug": "walk-home-hengikken", "name": "Walk Home (Hengikken)", "name_original": "Walk Home (Hengikken)", "description": "<p>Welcome to my second solo project: a short story about a couple.</p>\n<p>Now walk home...</p>\n<p>(The game is free, but if you want to support you can donate, i will be making more games so it wont be for nothing.)</p>\n<p>In this game you simply walk home after a visit to your significant other was cut short, with a feeling that something is off...</p>\n<p>This is an exploration-based game where your detective skills will be rewarded.</p>\n<p>The game is short but has multiple endings depending on what you do, which changes the course of the story.</p>\n<p>CONTROLS:</p>\n<p>ESC to pause</p>\n<p>WASD to move</p>\n<p>!GAMEPAD RECOMMENDED!</p>\n\n<p>GENERAL GAME INFO:</p>\n<p>The game was made in Unreal engine 4. </p>\n<p>my main idea for the art style was to try and only use images that i have taken as textures, to try and replicate the uncanny look of early games which used photoscans while still keeping it low poly. </p>\n<p>The main goal was to make a real atmosphere that captures the feeling of walking home alone after dark...<br/></p>\n<p>MUSIC:</p>\n<p>there are 11 songs in this game, 10 short ones that acts as the phone's music library, and the games main theme.</p>\n<p>The game theme and 7 of the phone songs are made by me.</p>\n<p>The 3 others are made by close friends of mine, Thanks for the help!</p>\n\n<p>THANKS FOR ALL THE LOVE AND SUPPORT:</p>\n<p>feedback is always welcome, tell me why you love or hate the game so i can apply the critique to my next game</p>", "metacritic": null, "released": "2021-09-19", "tba": false, "updated": "2021-09-20T03:30:46", "background_image": "https://media.rawg.io/media/screenshots/cd1/cd141997e2746e6ccc89216bbe207954.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 27, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["hengikken"], "genres": [], "publishers": [], "esrb_rating": null}