{"id": 66674, "slug": "edjing-pro-dj-controller", "name": "edjing Pro - dj controller", "name_original": "edjing Pro - dj controller", "description": "Designed to reach the same level of features as a professional DJ controller, edjing Pro will be you best companion to perform high quality live sessions anywhere.<br/><br/>With audio effects coming directly from pro DJ hardware, the best sound rendering, and the most complete music library, edjing Pro will amaze you by its level of performance.<br/><br/>Focus on your mix, edjing Pro does the rest! <br/>Thanks to a brand new audio system, developed by MWM’s engineers, result of five years of R&amp;D, edjing pro redefines the boundaries of the mix experience. Access: <br/><br/>- Brand new audio effects, essential for experienced DJs – like the Slip and the Roll<br/>- An automated audio effects synchronization on the BPM, the beats and the audio sequences of the tracks to obtain the best sound rendering<br/>- A manual audio system settings for purists who prefer a total control of their set like the Pitch setting mode or the choice of the crossfader curve<br/>- The most complete music library with an access to +50 million tracks (mp3, SoundCloud, Deezer,…)<br/><br/>GENERAL CHARACTERISTICS:<br/><br/>- A ‘Pre-Cueing’ feature that enables to prepare the next track on your headphones<br/>- Incredible color effects to add more texture to your mixes like the Super Filter, the Reverb, the Delay or the Echo Out<br/>- Perfectly synchronized rhythmic effects on your tracks beats like the Beatgrid, the Roll or the Roll Filter<br/>- An unlimited access to your SoundCloud music library<br/>- A Deezer access with more than 30 million tracks available (for Deezer Premium Plus members)<br/>- An access to your whole iTunes library<br/>- A smart search feature to find any track in one click on multiple music libraries at once<br/>- A ‘Queue’ function to prepare your DJ set in advance<br/>- An ‘Automix’ function that automatically plays the tracks listed in the queue<br/>- A ‘Record’ function in .aiff format to save your mixes in HD<br/>- Two large audio spectrums for an optimal BPM tracking and beat matching<br/>- An ‘Edit BPM’ function to manually adjust the BPM of your tracks, with the possibility to modify it by ear thanks to the ‘Tap BPM’ or by eyesight with the dedicated spectrum adjustment<br/>- A new ‘Freeze’ function to freeze one of the spectrum and play or replay the best instants<br/>- A brand new ‘Sync’ feature for a perfect synchronization<br/>- An interchangeable interface with a turntable view mode for turntablists<br/>- A smart mini spectrum that enables you to browse through the track <br/>- A three-band frequency equalizer<br/>- Airplay compatibility<br/>- Apple Watch compatibility<br/>- The application is not optimized for iPhone 3G, 3GS and iPad 1<br/><br/>YOUR CREATIVITY IS NOW LIMITLESS. <br/><br/>Let your imagination run free! edjing Pro enables you to explore your creativity without worrying about technical constraints by proposing the best sound rendering ever developed on iPhone and iPad. Realize unrivalled structure and rhythmic effects, synchronized on your beats tracks for an optimum result. Imagine. Mix. <br/> <br/>MIXFADER COMPATIBILITY<br/><br/>Control edjing Pro with the world's first wireless crossfader: Mixfader.<br/>More information on themixfader.com<br/><br/>Website: http://www.edjing.com/pro<br/>Contact: support.pro@edjing.com<br/>Facebook: https://www.facebook.com/pages/edjing-Pro/1574512199467994", "metacritic": null, "released": "2015-04-19", "tba": false, "updated": "2019-07-29T09:02:49", "background_image": "https://media.rawg.io/media/screenshots/668/668d40e940414d04c54454d4f7db5b96.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 106, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["MWM"], "genres": ["Simulation"], "publishers": ["MWM"], "esrb_rating": null}