{"id": 666871, "slug": "work-enviornment", "name": "Work Enviornment", "name_original": "Work Enviornment", "description": "Welcome to your new job!\r\n<p>We at Newark Enterprises welcomes you to an interview, that could change your life forever! You can apply for one of the highest paying officejobs at our office, and get huge benefits! Like 3$ overtime! A withering pension scheme! A <strong>VERY </strong>unfair employment contract, and much <strong>MUCH</strong> more!</p>\n<p>Our officespace is located in the tallest building in the city! Engulf yourself with a hot cup of coffee, and enjoy the view! <strong>ALOT</strong> of officespace means <strong>ALOT</strong> of job positions! So don't worry, your competition is nothing less than uneducated, idiotic fools, who definetly don't know that they will need a good pension scheme! This job is perfect, and it might just be as perfect for you.<strong> Apply now!</strong></p>\n\n<p>Newarkenterprises are not responsible for any injury/death at the workplace, please contact totalylegitmail@serivzes.com to find more information</p>\n<p>Work Enviornment is a <strong>horror game</strong>, very scary, so play at your own risk. People diagnosed with photosensitive epilepsy should <strong>NOT</strong> play this game, it contains flashing colors and fast jump scares, playing this could lead to risk of health and safety.</p>\n<p>This game was made for the Vim Jam 2, which means I had a limited time. However I did get alot done, but updates and trailer are due in the future!</p>\n<p>Work Enviorment controls:</p>\n<ul><li>W-A-S-D  - Move (or arrows)</li><li>Mouse1 - use objects / enter rooms</li><li>Mouse2 - lock door</li><li>R - peep through the door</li></ul>\n<p>Version 1.0:</p>\n<p>Made for the Vim Jam 2 gamejam</p>\n<p>Updates coming in the furture!</p>", "metacritic": null, "released": "2021-09-19", "tba": false, "updated": "2021-09-20T04:28:06", "background_image": "https://media.rawg.io/media/screenshots/b00/b003293623ba83f75425fa23f5f9ee3d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 51, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Evinor Games"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}