{"id": 666895, "slug": "a-desert-dream", "name": "A Desert Dream", "name_original": "A Desert Dream", "description": "<p>A Desert Dream is a platform game. This project was created for my university assignment purposes.</p>\n<p>An adventurer is sleeping with his camel in the middle in the desert and all of the sudden he was at the desert underground hunting for</p>\n<p>treasure. Is it all just a dream. Can he escape from the dream?</p>\n<p>More info:<br/></p>\n\n<p>1.Why the player only have 3 lives?\r\n--&gt; despite there are only 3 stages, the player can get through stage 1 and 2\r\nvery easily if they know what they are doing, and enemy attacks are not big\r\n</p>\n<p>2.Why the time limit is only 4 minutes?\r\n--&gt; I retested the game multiple times to see which time is suitable. First\r\n    try is only 2 minutes but it will be a tall order for players. Second\r\n    try is 5 minutes but it will be too easy. Therefore, 4 minutes is the way\r\n    to go as it makes the game more fair and tense\r\n</p>\n<p>3.Why mummy would not damage the players?\r\n--&gt; they are only there to slow the player down and force the player to stay\r\n    with them for eternal because the clock is ticking.\r\n</p>\n<p>4.Why there are tombs falling out of sky during the last stage?\r\n--&gt; since this game do not have any boss, one of the way to make the game fun \r\nand suit for the theme is having a bunch of tomb fall down. It will test \r\nplayer reflex and this is just a dream.\r\n</p>", "metacritic": null, "released": "2021-09-19", "tba": false, "updated": "2021-09-20T04:34:12", "background_image": "https://media.rawg.io/media/screenshots/843/84362c09f507ab02fdd561586f2324ca.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 18, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["limziliang9"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}