{"id": 666980, "slug": "ambermoonnet", "name": "Ambermoon.net", "name_original": "Ambermoon.net", "description": "<p>Ambermoon.net is a full C# rewrite of Ambermoon and will run at least on Windows, Linux and Mac.</p>\n<p>Explore a huge fantasy world with lots of interesting people, brutal monsters and all kind of magic. Visit all the islands on the home planet Lyramion and even fly to the two moons which both are home to unexpected inhabitants.</p>\n<p>--</p>\n<p>The ingame experience and game mechanics are indentical to the original game by Thalion Software but the remake allows higher resolutions, fullscreen mode, music volume, an optional cheat console, an optional graphic filter, an optional auto derune function and much more.</p>\n<p>Of course the usability was improved a bit as well but without destroying the retro flair.</p>\n<p>No matter if you are a fan of Ambermoon or retro games in general or if you are just someone who wants to play a lovely crafted RPG with a huge world and story, this game is exactly what you are looking for. :)<br/></p>\n<p>You can also visit the project page on github at https://github.com/Pyrdacor/Ambermoon.net or just visit my own website at https://pyrdacor.net.</p>\n<p>Have fun playing Ambermoon! :)</p>\r\nDisclaimer\r\n<p>As mentioned this is a remake. The original game \"Ambermoon\" was developed by Thalion Software in 1993. Unfortunately the company went bankrupt and was closed in 1994.</p>", "metacritic": null, "released": "2021-09-19", "tba": false, "updated": "2021-09-20T04:54:28", "background_image": "https://media.rawg.io/media/screenshots/e4c/e4cae772a040031da3629b01f1e98268.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 302, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Pyrdacor"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}