{"id": 667113, "slug": "andeli", "name": "Andeli", "name_original": "Andeli", "description": "<p>In Andeli, you are a wizard who runs around spelling powerful words from letters that randomly rain from the sky. </p>\n<p>Click on your desired location. Walking next to the various statues around the terrain will take you into combat. In combat, letters will begin to fall down into the arena. Collect letters to spell words. Once you have a good word, click and hold the green \"Fire Word\" button to release the spell. Note: the Fire Word text will be replaced by the current value of the wordspell that you have.</p>\n<p>To erase a single letter, just tap its tile on the lower bar. To erase an entire word, click and hold the red \"Erase\" button at the bottom.</p>\n<p>You win combat by filling the top bar (moving it all the way to the right). Rarer letters, like Q, Z, and J, grant more power while common letters grant less. Letters also each have latent powers that have a chance of activating upon gaining additional letters; therefore, longer words are more likely to activate letters' effects for even more powerful spells, like freezing the enemy or doubling the letter's power. An activated letter power is identified by the particle effects around it.<br/></p>\n\n<p>PROTOTYPING NOTES:</p>\n<p>- Don't use the leftmost or rightmost buttons on the bottom. They either are placeholders or buggy due to resolution issues.</p>\n<p>- Pathfinding issues I need to solve</p>\n<p>- Collisions with the cat can lead to the player getting stuck.</p>\n<p>- Programmer art for now, except for the tileset, which I like. It is Matt Walkden's excellent 16x16 tileset.</p>", "metacritic": null, "released": "2021-09-18", "tba": false, "updated": "2021-09-20T05:25:35", "background_image": "https://media.rawg.io/media/screenshots/9f8/9f8a641b8f44b9a9c102422d62ade340.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 14, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Defrag"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}