{"id": 667166, "slug": "moena-medenacci", "name": "Moena (Medenacci)", "name_original": "Moena (Medenacci)", "description": "<p><em>READ FIRST (09/12/2021): If you are going to purchase, please click the \"view bundle\" button above and purchase there.</em></p>\n\n\n<em>\n<p><strong>At the moment Moena requires a joystick or gamepad.</strong> You can download and fly an aircraft in Moena today, but for now documentation and some game settings are incomplete. Game mechanics have also not been added yet, so the game right now is basically a \"4d flight sim\" where you can practice taking off and landing on runways.</p>\n</em>\n<p>\n</p>\r\n\r\n\r\n\r\nMoena: a 4d Game — Think and move in four dimensions.\r\n\r\n\r\n<p>\n</p>\n<p>Moena (pronounced \"meena\") is an upcoming 4d game in early access. With Moena, you'll be able to do things in 4d space that you enjoy doing in the games you already play — finding and collecting items, interacting with 4d NPCs, shooting projectiles, and even flying 4d airplanes and spaceships. All you need to begin is basic experience playing 3d games.</p>\n<p>\r\nMoenablocks is being developed along with Moena: a 4d game. I hope you enjoy this game, now and as development progresses.\r\n</p>\n<p>\n<em>Moenablocks included: buy Moena in early access and<br/>  get a 4d blockworld sandbox.</em>\n</p>\r\n\r\nHow it works\r\nStaging a four-dimensional view\r\n<p>\n</p>\n<p>An image of a four-dimensional world is shown in a three-dimensional cube-shaped view. Unlike the frame of a 3d image, which fits neatly onto the screen of a monitor, the frame of a 4d image requires further processing to be displayed. This is called <em>staging the view</em>.</p>\n<p>In three dimensions, there's <em>forward, backward, up, down, left, </em>and<em> right</em>. For rotation there's <em>roll, pitch, </em>and<em> yaw</em>. There's a total of six directions to move and there's a total of three ways to rotate.</p>\n\n<p>\r\nIn four dimensions, there are a total of eight movement directions, and six ways to rotate. The names used in Moena for the two directions along the fourth dimension are <em>on</em>  (also called \"an\" or \"ana\") and <em>again</em> (also called \"kata\"). In addition to roll, pitch, and yaw, there are three new rotations in four dimensions which are named <em>reel</em>, <em>twirl</em>, and <em>tumble</em>.</p>\n\r\nElevational and horizontal displays\r\n\n<p>As the view is staged, it can be swiveled to any angle. However, there are two ways of positioning the view that are most helpful for making sense of a four-dimensional world. The first of these modes is with the view upright and forward, called <em>elevational display</em>. Elevational display allows you to see the height of things. The second has the view turned up and is called <em>horizontal display</em>, which allows you to effectively see the ground — to see the <em>horizon</em> — of a four-dimensional planet.</p>\n\r\nOverhead maps\r\n\n<p>\r\nThe surface of a 3d planet can be mapped in two dimensions. This is because the <em>topology</em> of the plane is 2-dimensional. Similarly, the topology of a 4d planet is 3-dimensional, and can be displayed in a view similar to the image cube of a compositional first-person view.\r\n</p>\n<p>\r\nHowever, a 4d planet contains four-dimensional height features. This is because the <em>topography</em> of a 4d planet is four-dimensional. These height features can be shown using a topography map, just like a topography map for 3d terrain.\r\n<br/><br/>\n</p>\r\nCurrent state\r\nSystem Requirements\r\n<ul><li><strong>OS: </strong>64-bit Windows 7 or higher / 64 bit Linux</li><li><strong>CPU: </strong>Intel i7 4790S equivalent (more cores are better)</li><li><strong>Graphics: </strong>4GB Nvidia GTX 960 equivalent.</li><li><strong>RAM: </strong>8GB</li></ul>", "metacritic": null, "released": "2021-09-13", "tba": false, "updated": "2021-09-20T05:38:05", "background_image": "https://media.rawg.io/media/screenshots/606/606c37970f2a6a3cff526bcf46466d5f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 137, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["Medenacci"], "genres": [], "publishers": [], "esrb_rating": null}