{"id": 667114, "slug": "evesfill", "name": "Evesfill", "name_original": "Evesfill", "description": "ENGLISH\r\n<p>This is my very first game, I put a lot of work and effort on it and I'm really happy with the result, as a personal challenge I didn't use any plugin or external resource (having an exception of a Laugh with No copyright from FreeSounds). </p>\n<p>It's inspired by games like Undertale, where exploration, knowledge of the world, making decisions and getting to know some characters is the main part of the gameplay.</p>\r\nEXPLORE\r\n\r\nSOLVE PUZZLES\r\n\n<p>The most important thing about this game is that every choice you make will have an impact on the game, leading to different endings, having One true ending, one bad ending, and some neutral endings.<br/></p>\r\nCHOICES CHANGE THE STORY\r\n\n<p><em>This game was made in spanish and then traslated, so please, expect some typos or wrong translations.</em><br/></p>\n<p>_______________________________________________________________________________</p>\r\nESPAÑOL\r\n<p>Este es mi primer juego, he trabajado un montón en él y le he dedicado bastantes horas de esfuerzo y estoy muy contento con el resultado. Como desafío personal, no he usado ningún plugin ni ningún recurso externo (siendo la excepción una risa sin copyright que descargué en FreeSounds).</p>\n<p>El juego está inspirado en títulos como Undertale, en el que la exploración, el conocimiento del mundo, la toma de decisiones y conocer a algunos personajes, es la parte principal del juego.</p>\r\nEXPLORA\r\n<p>\n</p>\r\nRESUELVE PUZZLES\r\n<p>\n</p>\n<p>Lo más importante en este juego es que cada decisión que tomas, afectará en la partida, lo cual desembocará en diferentes finales, teniendo un final verdadero, un final malo y varios finales neutrales.<br/></p>\r\nLAS DECISIONES CAMBIAN LA HISTORIA\r\n\n\n<p>_______________________________________________________________________________</p>\n<p><strong>CONTROLES/CONTROLLS</strong></p>\n<p>Arrow keys/Flechas = Movement/Movimiento</p>\n<p>Z = Interact or Accept/ Interactuar o aceptar</p>\n<p>X= Cancel or Open Menu/ Cancelar o Abrir menú</p>\n<p>Shift= Run/Correr</p>\n<p>You can also use your mouse for everything/ También se puede usar el ratón para todo.</p>\n<p>_______________________________________________________________________________\r\n</p>\n<p><strong>FEEDBACK</strong></p>\n<p>Please if you find any bug, leave a constructive comment and I'll fix it asap. / Por favor, si encuentras un bug, deja un comentario constructivo y lo arreglaré cuanto antes.</p>", "metacritic": null, "released": "2021-09-18", "tba": false, "updated": "2021-09-20T05:25:45", "background_image": "https://media.rawg.io/media/screenshots/12a/12ac841a336060b4497a4c755efbd92a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Rumikuchi"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}