{"id": 66723, "slug": "piano-magic-tiles-2-christmas", "name": "Piano Magic Tiles 2: Christmas", "name_original": "Piano Magic Tiles 2: Christmas", "description": "Play the best Piano Magic Tiles 2 - White Tiles on your iPhone &amp; iPad now! FOR FREE! It's the best Christmas Games in this coming Xmas! <br/><br/>Have you ever dreamed of becoming a professional pianist like Beethoven, Chopin or Mozart? Have you ever dreamed of playing classical songs like Little Star, Canon or Jingle Bells on a piano?<br/><br/>Now your dream can come true with Piano Magic Tiles 2: Black &amp; White Tiles! Piano Magic Tiles 2 is the latest hit piano app to take iOS by storm. With this piano app even a child can play classical songs like a real piano master. It’s easy to learn, and incredibly fun to play! With Piano Magic Tiles 2: Black &amp; White Tiles your iPhone &amp; iPad becomes a magic piano, by tapping on the black tiles, you can play your favourite songs just like the best pianists!<br/><br/>Piano Magic Tiles 2: Christmas Music Songs is your choice! With redesigned graphics, optimized tunes, and 300+ songs, Magic Piano: Christmas Music Songs will bring you fresh gaming experience and make this Christmas more fun and hilarious! <br/><br/>HOW TO PLAY:<br/>Piano Magic Tiles 2: Christmas Music Songs (Black &amp; White Tiles) is very simple to play! <br/>1)\tTap the black tiles, don’t tap the white tiles. Do not miss any black tiles ever after high speed soundtrack.<br/>2)\tWhen there comes a long tile, press down on the long tile and release at its end. <br/>3)\tControl your tempo as the tiles goes quicker and quicker. <br/>4)\tMake it to the end, and collect the bonus coins and diamonds after you finish the song.<br/><br/>Notes:<br/>1)\tCoins and diamonds can be used to unlock locked songs.<br/>2)\tPlay daily challenges to win more diamonds.<br/>3)\tListen to the whole song before and after you play. Just tap the headphone icon on the left.<br/>4)\tSelect your favorite instruments: Piano, Electric Piano or Harpsichord.<br/>5)\tEnter the endless mode directly by tapping the quick play icon on the right, without having to start from scratch.<br/>6)\tPlay hard to win! A lot of achievements and rewards are waiting for you!<br/>7)\tWatch video to get free diamonds if you are in need.<br/>8)\tAdd songs to the favorite list by just toggling the heart icon on the upper right.<br/><br/>FEATURES:<br/>1)\tAwesome graphics and sound effect. Playing this tile app is like playing a real grand piano.<br/>2)\tHigh quality piano music soundtracks. Features a large collection of piano songs from Mozart, Chopin, Bach, Tchaikovsky, to Beethoven.<br/>3)\tHit songs including: Happy Birthday to You, Little Star(Mozart), Jingle Bells, Canon, Fur Elise(Beethoven), Swan Lake, etc.<br/>4)\tSimple to play, difficult to excel. Tapping only the black tiles, avoid the white tiles can be very challenging under high speed circumstances!<br/>5)\tSmooth gaming experience. We tried our best to turn your mobile phone into a magic piano with great sound effects. <br/>6)\tRegular Updates! Frequently updating Magic Piano: Christmas Tiles 2 to fix any bugs and come up with new awesome features. <br/>7)\tMagic Rush. After you play the whole piano song, you can enter the ENDLESS mode directly by tap the fast play button.<br/>8)\tFavorite List. You can save your favorite piano songs. Easy to access your favorite songs and songs recently played.<br/><br/>Remember, just tap the black tiles, don’t tap the white tiles!", "metacritic": null, "released": "2016-12-06", "tba": false, "updated": "2019-10-22T14:27:19", "background_image": "https://media.rawg.io/media/screenshots/af4/af413d74d5e89d7858481b1a4abc7658.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 90, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Hailin Li"], "genres": [], "publishers": ["Hailin Li"], "esrb_rating": "Everyone 10+"}