{"id": 667362, "slug": "blind-flagflip", "name": "blind flagflip", "name_original": "blind flagflip", "description": "<p><strong>The audio of this game has been specifically designed to make it possible to play and beat this game while relying on sound alone. What follows are a set of pedantic instructions that assume you can not see anything on the screen. If you are not using text to speech to read this, you might want to go play the original version to learn the basic rules visually and then return if you feel up for the challenge of solving the puzzle audio-only.<br/></strong></p>\n\r\n\r\nGame rules: \r\n<p>Your goal is to move the 5 flag  pieces from the left column into the right column  by moving them through a passage at the top. Both columns have space for a vertical stack of 5 pieces, the left column is filled with 5 flags while the right column is currently empty.<br/>You have a small pocket  for storing a single piece above the left column to help you with this task. The issue with moving the pieces is that they can not move  below their original height, so a piece that started in layer 3 can only rest in  layers 0, 1, 2 and 3. This means the only way to store the pieces in the  right column is in the same order as they originally rested on the left (1 2 3 4 5).</p>\n<p>Since each flag piece is unique, we can call them flag 1, flag 2 and so on. Flag 1 is the flag that started in layer 1. <br/></p>\r\n\r\nControls + audio guide: \r\n<p>While playing you can press  Space to hear a sequence of notes that represent the column your cursor is positioned at (either left or right column). The sound sequence starts in the top passage, at your cursor position (layer 0) and moves downwards to layer 5, making a sound each time it travels. Each  flag piece plays a distinct note with the highest piece (tile 1) being  represented a low note and the lowest piece producing a high note. An empty space produces a clicking sound. This sequence of sounds can tell you which flag piece is in which position.<br/></p>\n<p>You can listen to the sequence by by pressing space on the game screen until you hear a sequence of 6 sounds. If you do not hear the sequence, make sure you have focused the game window at the top.  With most screen readers, the game window should be called 'blind flagflip game window'. I have not tested this game with mobile screen readers and recommend playing on desktop.<br/></p>\n<p>In the initial game state, when the left column sequence plays you hear a click (denoting the empty tile in the top passage) followed by 5 notes. The right column (which you can reach by pressing right) will sound 6 clicks (after you press space), denoting that none of its slots contain a flag piece.</p>\n\n<p>Moving between the columns is done with the<strong> left/right key</strong>. If you move left on the left column or right while your cursor is on the right column, you do not move and there is no sound. If you successfully move through the passage there are two different sounds, one means you are carrying a flag piece, the other indicates you are crossing columns empty-handed. If you try to move a piece while layer 0 (the passage) of the other side is blocked with another, movement will cancel. <br/></p>\n\n<p><strong>You</strong> can pick up and drop pieces with the <strong>up/down key. Picking up a piece means it starts moving from its current position towards your cursor, making a click sound each step, then playing its own note at the end together with the last click. Dropping a piece functions</strong> similarly, except there is an extra click and the flag piece note plays after the last click. If layer 1 of the column is blocked, you will drop the piece right under your cursor (in layer 0), making no clicks and just playing the piece note.<br/></p>\n<p>To give some examples:</p>\n<ul><li> flag 2 dropped into layer 2 sounds like \"click, click, click, two\". Two means the distinct sound that flag 2 makes.</li><li>flag  4 dropped into layer 3 sounds like \"click, click, click, click, four\"</li><li> flag 3 that is picked up from layer 3 sounds like \"click, click, click-three\" . Click-three means the Click and the sound for flag 1 produce a sound at the same time</li></ul>\n\r\n\r\nHints for sighted players:\r\n<p>I've  made the screen fill up with black particles to push sighted players  towards relying on their ears. If they want, they can <em>'cheat'</em> by pressing Space a few times in succession to clear some of the black particles. The black particles will return, so soon the screen will be without information again.<br/></p>\n<p>\n</p>\r\nFor blind players:\r\n<p>If the information given here is not enough or you have any other issue with playing the game, please let me know. I am happy to produce an alternative version suited to your needs (slower, faster, different sounds).<br/></p>\n<p>\n</p>\n<p>After clearing the first level, you will reach the second level. The second level is the same as the first, except there is a sixth flag piece and layer, also there is no way to clear the black particles anymore. If you want to listen to the original 123456 sequence again, you can press R to reset, space to listen, then U to undo twice to get back to your previous position.</p>", "metacritic": null, "released": "2021-09-17", "tba": false, "updated": "2021-09-20T06:28:27", "background_image": "https://media.rawg.io/media/screenshots/281/2817f48e5adf4cc8213146bdaf41209e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 4, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["minotalen"], "genres": ["Simulation", "Puzzle"], "publishers": [], "esrb_rating": null}