{"id": 667335, "slug": "stuck-in-the-past-definitive-edition", "name": "Stuck In The Past - Definitive Edition", "name_original": "Stuck In The Past - Definitive Edition", "description": "<p>When Reid is banished to a foreign world he can't fight his way out of, he confides his remaining knowledge an in unlikely hero to retrieve an artifact and take him home. As the two heroes journey on, one learns about the other's world while the other realizes battling isn't all Heal and Spark.</p>\n<p>Originally created for the Enter The Haroldverse jam, this final version features some important changes and fixes.</p>\n<ul><li>BUG FIXES: Surprisingly enough, some issues slipped into release. There was even a missing tree tile in the first overworld!</li><li>QUALITY OF LIFE IMPROVEMENTS: Some particularly frustrating elements of the Haroldverse version have been fixed. For example, spawn rates are lower, stronger enemies spawn farther away, and certain moves have more use to them.</li><li>MORE CONTENT: No pesky time limit means less of a rush to complete the game. This also means just about everything you can find is interactive! Additionally, there is now a fully developed postgame. Go out and explore!</li></ul>\n<p>Otherwise, you'll still get everything you loved from the original, including...</p>\n<ul><li>Turn-based RPG with a unique mentor system\r\n</li><li>30-50 minute play time\r\n</li><li>Graphics by the creator of Axial\r\n</li><li>Fully original soundtrack (Theme6 notwithstanding) by an Axial composer\r\n</li><li>The rest of the game by said Axial composer\r\n</li><li>Hilarious Harold hijinx and more!\r\n</li></ul>\n<p>By callmeDJ and Violet Spinel.</p>", "metacritic": null, "released": "2021-09-18", "tba": false, "updated": "2021-09-20T06:22:42", "background_image": "https://media.rawg.io/media/screenshots/e9c/e9c8b5ef8c72b6b326690a9d4218601f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 42, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["callmeDJ"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}