{"id": 66745, "slug": "tapsonic-world-champion", "name": "TAPSONIC World Champion", "name_original": "TAPSONIC World Champion", "description": "Welcome to TAPSONIC World Champion!<br/>Brand-new features, a number of playable songs, and players all around the world are waiting for you.<br/>ARE YOU READY TO BE THE WORLD CHAMPION?<br/><br/>TWC invites you to the worldwide competition.<br/>Be a member of national team and compete with other players all over the world.<br/><br/>- MULTIPLAYER MODE-<br/>Multiplayer rhythm game up to six players!<br/>Enjoy the rhythm with people all around the world.<br/><br/>- AUTHENTIC RHYTHM GAME -<br/>TAPSONIC World Champion is a traditional arcade-style rhythm game with music video.<br/>Music, beat, video, and notes. What more do we need for rhythm game?<br/><br/>- RANKING -<br/>TAPSONIC WORLD CHAMPION provides various ranking systems. Including rank by country, world, international competitions, and also there are Masters Ranking for the true champions. Prove your skills in various rankings, and become the representatives of your countries!<br/><br/>- CHAMPION'S TOUR -<br/>CAHMPION'S TOUR provides a field of competition with selected tracks and scheduled day to players.  <br/>Similar to the real sports competition, there is only one chance for all participants.  <br/>Premium tracks that users have to buy to play will be provided for free in CHAMPION'S TOUR.  <br/>It is a competition that participants can truly show their skills.<br/><br/>- PLAY-TO-WIN -<br/>TAPSONIC WORLD CHAMPION highly supports 'Fair Play' attitude.  <br/>There are no pay-to-win elements in game such as characters or score boosters. You can play dozens of tracks for free including basically given tracks and ad-acquired tracks.<br/><br/>- Download free songs from the previous TAPSONIC and DJMAX series.<br/>- Tap &amp; Slide, easy to play. <br/>- Experience high quality of rhythm effect – with many kinds of music, rhythm and beat. <br/>- Challenge 3 different difficulties : Basic, Pro and Legend.<br/>- Tap Tap! Get more medals with high score to make your country win.<br/>- Offline game mode supported : No network is required.<br/><br/>You are the champion of global rhythm game TAPSONIC World Champion!<br/><br/>※ Forward all and any inquiries to mobilecs@help.pmang.com.<br/><br/>@ NEOWIZ All rights reserved.", "metacritic": null, "released": "2017-07-25", "tba": false, "updated": "2019-07-29T09:29:46", "background_image": "https://media.rawg.io/media/screenshots/de2/de28347db410db7fd1b8d2f4bbf6f06a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 178, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["NEOWIZ"], "genres": [], "publishers": ["NEOWIZ"], "esrb_rating": "Everyone 10+"}