{"id": 667500, "slug": "god-of-uno", "name": "God of UNO", "name_original": "God of UNO", "description": "<p>For the classic UNO experience, select the \"4\" option on the main menu.<br/></p>\n<p>Unzip the files and run God_of_UNO.exe to play! If you run into ANY errors at all, please let me know! I will ensure you get a working version!</p>\r\nHow to Play:\r\n<p>Try to be the first one to play all of your cards on the discard pile. To play on the discard pile, you must have a card that matches the color or number. If you play a Skip (/), Reverse , or Draw +2/+3/+4 card, the opponent's turn will be skipped and you may play again.</p>\n<p>If you cannot play a card, you must draw one from the draw pile. If the card can be played, it will be played automatically.</p>\n<p>When you play a wild card, buttons will appear representing your choice of color. You can choose here, or you can simply click a card in your hand to automatically select that color.</p>\r\nScoring\r\n<p>When you play your LAST card, your score is the total number of points in your opponents hand.</p>\n<p>Number cards are worth their face value.</p>\n<p>Action cards are worth 20 points, and Wild Cards are worth 50 points.</p>\n<p>The Wild Draw +8 card is worth 300. (Level 6 only)</p>\n<p>Try to collect the highest bounty you can. The more cards your opponent has at the end of the game, the better chance you will have for a large bounty.</p>\r\nDifficulty Levels\r\n<p>3 - Simple - Only uses 3 colors.</p>\n<p>4 - Normal - Regular Game of UNO with 4 colors.</p>\n<p>5 - Advanced - Adds a 5th color (Purple), also +3's.</p>\n<p>6 - Expert - Adds a 6th color (Orange), also a single +8.</p>\n<p>At levels 5 and 6, the backs of the cards have a variety of different outline colors. This indicates that the card is a +2, +3, +4, or +8 card, depending on the color. Use this to your advantage and plan ahead! Draw +2's are Green, +3's are Blue, +4's are Purple, and the +8 is Orange.</p>\r\nAuto Play\r\n<p>You can turn on auto play and leave the game running to simulate many games at a time. Use the Up and Down arrow keys to increase or decrease the computer speed.</p>\r\nTechnical Details\r\n<p>Written entirely in C++ with SFML graphics library. It should work on most resolutions, however, the text and buttons may look a little off. The game should work flawlessly on 1920x1080.</p>\r\nCredits\r\n<p>Music is from https://catsystemcorp.bandcamp.com/track/suite-3000</p>\n<p>Thanks to my brother Collin Pickup and other family/friends for testing this on their machines.</p>\n<p>Special thanks to some of my twitch viewers as well, for helping me out! Thinking of you Down16IQ, beefviper, AtlantiaKing, etc.</p>", "metacritic": null, "released": "2021-09-17", "tba": false, "updated": "2021-09-20T07:02:38", "background_image": "https://media.rawg.io/media/screenshots/cde/cde1d6cea078c4a3a5754ab1adce6cc9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 32, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["lockpickup"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}