{"id": 667595, "slug": "project-hike", "name": "Project Hike", "name_original": "Project Hike", "description": "Concept:\r\n<p>Basically a hiking game with a beautiful and relaxing world design with a story based on social melancholy and uncertainty.\r\n </p>\r\nMechanics:\r\n<ul> <li>First person walking simulator. </li><li>Saving mechanics work by posting photos on social media after reaching places with data coverage. This will help guide the narrative and show the social impact on the character. How comments and strangers can impact ones emotions.\r\n </li></ul>\r\nPlot:\r\n<p>You have just finished college and don't have an idea what to do in life ahead. So you decide to go on a hike.\r\n </p>\r\nIdea:\r\n<p>To discover self worth and acknowledge that everyone is made different and success is nothing but subjective. And that one must focus on things they themselves love over things that are perceived as a universal success.</p>\r\nNote From Dev:\r\n<p>This is my first ever Unity project so I'm learning everything as I go. I also lack any prior C# experience so that's something I need to figure out as I continue working on the game. I will continue posting whenever a major milestone is hit so I can get feedback to make it more polished and better. These releases will be more like a mechanics showcase of sorts for playtesting than the read deal and will lack the main storyline for the most part.  And thank you for spending your time however little it is on this little project of mine &lt;3 </p>\r\nPlaytests:\r\n<ol><li> <strong>Character controller (17th Sept, 2021): </strong>The first thing I've ever made in Unity and C#. It has a few bugs like camera gitter while using headbob. Well all the bugs are due to headbob so turning it off will solve them. Let me know about the feel of the character controller as a whole. I'm going for a more laid back feel like the one in a game like Firewatch for an example. As this game is after all a walking simulator. </li></ol>\r\nOngoing Development For Next Playtest Build:\r\n<ul><li>Wind Shaders for grass and leaves</li><li>Terrain and vegetation</li></ul>\r\nKeybindings:\r\n<ul><li>WASD to move</li><li>SPACE to jump</li><li>SHIFT to sprint</li><li>CTRL to crouch (a bit buggy due to headbob)</li><li>R to restart</li><li>ALT + F4 to exit </li></ul>", "metacritic": null, "released": "2021-09-17", "tba": false, "updated": "2021-09-20T07:25:58", "background_image": "https://media.rawg.io/media/screenshots/5ea/5ea30b532f49828f175e5db306c3d57f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Shines ✨"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}