{"id": 667573, "slug": "on-the-edge-of-the-ledge", "name": "On The Edge Of The Ledge", "name_original": "On The Edge Of The Ledge", "description": "<p>A strategy game for one or two players where dice will infuriate and aid in your outcome to lead the ultimate team of boss characters to victory!</p>\n<p>Made as an entry for</p>\n<p>                                      </p>\n<p>The theme of this jam was \"On The Edge\" with a requirement of BOSS.<br/></p>\n\n<p>This was a solo effort by myself and I had an extra limitation on my wife booking me up for the last weekend of the jam .. so everything had to get done by the Friday (5 out of the 10 days)!</p>\n<p>As such I decided that I would lean on assets found in the Unity Asset Store heavily for this one and concentrate on the game mechanics and polish. I have linked to everything at the bottom of this page.</p>\n<p>I know two player games are a little awkward to judge in jams, so I added a basic AI option to play against .. if I had that last weekend I would have made it a little smarter .. if you like the game let me know in the comments and I will whip up a video breakdown for it on my channel when I get my next free time allocation.</p>\n<p>So lets talk gameplay:</p>\n<p>Each player gets to pick two characters to join their team from a raster of six, each character has traits you can assess in the character selection screen, from higher health to inflicting more damage and better range of movement. Some even come with a ranged attack. </p>\n<p>To add depth to these stats I also gave the characters special actions where they can damage the other team, heal their own or use a vampire skill and suck the health from the other team to fill their own. Each of these special actions is balanced against the owners character skill stats. </p>\n<p>Please don't hate me if one character comes across too OP just let me know in the comments, I played a lot of rounds in this game and didn't find one myself but then this game is open to a lot of strategy variations on play.</p>\n<p>And that's it .. I hope you like the game and if you entered the Jam all the best of luck with your entry.<br/></p>\n\n<p>If your interested in making games I have a YouTube channel where I talk about the games I am working on and how I build them, so please come along and maybe support by subscribing.  Soon I will put up a video detailing all the components that went into this jam entry.</p>\n\n<p>As a shameless plug reference to the guy running this Jam  I also have a video on me helping to build Vimlark's game \"Monkeys With Guns\"</p>\n\n<p>Game assets:</p>\n<p>Art - The characters, props and buildings come from \"Synty Studios POLYGON City\" pack found here.. they were having a sale at the start of the jam so I got most of them for free.</p>\n<p>Animations - Mixamo does some great free animations and Synty have a video on how to convert them for use. Other than that I used some free packs from  Kevin Iglesias found here</p>\n<p>Sound - FX and Music came from the \"Ultimate Sound FX Bundle\" found here</p>\n<p>Font - This is \"Space Mono\" and can be found here </p>\n<p>Icons - Any that weren't made by hand can be found in the \"64 Flat Game Icons\" pack found here</p>", "metacritic": null, "released": "2021-09-17", "tba": false, "updated": "2021-09-20T07:21:04", "background_image": "https://media.rawg.io/media/screenshots/236/236f82c88ddcc37349fb38e331eccdf3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 27, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Warped Imagination"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}