{"id": 667607, "slug": "immortal-guns", "name": "Immortal Guns", "name_original": "Immortal Guns", "description": "<p>Immortal Guns is a new FPS game with a powerful level maker. The game offers multiple game modes, maps, weapons, and console quality graphics that are optimized for all mobile devices. The level maker is a powerful, easy-to-use tool with a terrain builder and object editor that lets you build and play your own levels. You can even share your custom levels with your friends.<br/><br/>DISCLAIMER: EARLY ACCESS GAME<br/><br/>Immortal Guns is currently in early access. We are actively developing new maps, adding new weapons and game modes as we continue to grow. Our vision is to enable players to play and enjoy the levels they build with their friends online.<br/><br/>✔️Online multiplayer with full offline capabilities<br/>✔️Console quality graphics and optimization for weaker devices<br/>✔️Completely free to play<br/>✔️Powerful level maker<br/><br/>🎮 Game Modes 🎮<br/>Team Deathmatch<br/>Kill enemy players in a fight for domination. The team with the highest number of kills at the end of the round wins.<br/><br/>Free for All<br/>You’re on your own! The player with the highest number of kills at the end of the round wins.<br/><br/>🔨 The Level Maker 🔨<br/>Forge your own levels<br/>Create custom terrain with a powerful terrain editor and add objects to make your own levels. Go further by tweaking engine settings like run speed and game modes.<br/><br/>Add vehicles and jump-pads<br/>Add vehicles and jump pads to your levels to create a fun and wacky experience.<br/><br/>🚀 Upcoming Features 🚀<br/>New maps<br/>New weapons<br/>More level assets<br/>More game modes<br/>Skins<br/><br/>Join our communities to stay up to date with the latest game news:<br/>Discord: https://discord.gg/m2UfUfJYYC<br/>Twitter: https://twitter.com/immortalguns1</p>", "metacritic": null, "released": "2021-09-17", "tba": false, "updated": "2021-09-20T07:28:44", "background_image": "https://media.rawg.io/media/screenshots/782/7829d687362faeea92a79f3179c63cbb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 133, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["mortartribe"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}