{"id": 667673, "slug": "bean-stalker", "name": "Bean Stalker", "name_original": "Bean Stalker", "description": "The branches reach up to the sky, and the beanstalk provides a link between Earth and the Upper world. Every continent and every climate rises from the underworld. An endless horde of creatures descend from the sky and crawl out from the depths. You must hunt creatures and adapt to a new way of vertical life. Become a Stalker of this New Realm. Use your Blade Slammer and turn into more than a new hunter of this new world.<br/>Evolve, create, develop to be the most skilled among all, and defeat the spirit of the tree on top.<br/><br/><br/><br/><ul><li><strong>Endless variations</strong><br/>Every time you put on your headset, the realm of the beanstalk will be different. The game includes procedurally-generated random vertical worlds with immense verticality, sandbox-like elements and constantly changing quests and challenges. You will never solve a quest or find an adventure the same way twice, so do not forget to make the best shots of your gameplay.</li></ul><br/><br/><br/><ul><li><strong>You cannot climb the same way twice</strong><br/>Use your Blade Slammer not only for face-to-face fights but to wander around the branches and reach the top. Experience the feeling of real climbing with the unique vertical platform elements, from the comfort of your own room.</li></ul><br/><br/><br/><ul><li><strong>Survive </strong><br/>Unique challenges wait around every corner. Beware of the creatures of the beanstalk; they have already fought their way to the highest branches for the sweetest of saps. Defeat them to gain the most valuable resources.<br/>Don't hesitate to leave the tree and save your skin. You can always come back wielding better equipment and be ever ready to defeat the foes that block your path to the top where you will face the spirit of the tree</li></ul><br/><br/><br/><ul><li><strong>Craft</strong><br/>You’ll need to craft different tools and solve quests to reach higher levels and face the spirit of the tree on top. You can craft swords, crossbows, shields, grenades, and grappling hooks to make your movement more efficient across the branches. Don't forget to use your Book of Crafts!</li></ul>Brace yourself for a brand new adventure in this strange world!", "metacritic": null, "released": "2021-09-20", "tba": false, "updated": "2021-09-24T02:20:37", "background_image": "https://media.rawg.io/media/screenshots/5d4/5d4a06818987558112ea389f25354a6c.jpg", "website": "https://beanstalkergame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 4, "owned": 35}, "playtime": 1, "achievements_count": 32, "ratings_count": 0, "suggestions_count": 440, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["VR Storm Studio"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["VR Storm Studio"], "esrb_rating": null}