{"id": 667655, "slug": "klang-2", "name": "Klang 2", "name_original": "Klang 2", "description": "<p>Klang 2 is a psychedelic rhythm-action game, blindly pursuing full immersion with dance music through high-speed combat. Conduct electronic symphonies with your lightning powers, wield magical tuneblades, and achieve a euphoric state of trance through skillful play.</p>\n<p>The player&#39;s abilities to fight and defeat enemies are divided into three categories: Strikes, dashes and holds. Strikes are the most common and will let you fast-attack the enemy with flashy fireballs. The dash makes you dodge and counter enemy attacks. The hold makes you deal enough lightning damage to shame even the greatest gods of mythology.</p>\n<p>Klang 2s not only the ideal introduction to the Klang universe, but all things rhythm-action!</p>\n<p>Key features:</p>\n<ul>\n<li>\n<p>30 levels of intense EDM-Action. Playable at both normal and fast speed for extra challenge.</p>\n</li>\n<li>\n<p>Semi-procedural combat system ensuring the same track never plays exactly the same.</p>\n</li>\n<li>\n<p>Several boss types gradually changing the rules of engagement.</p>\n</li>\n<li>\n<p>Music by the legendary composer bLiNd, and other talented artists such as James Landino, Arcien, Nhato, Steven Silo, City Girl, cYsmix and more!</p>\n</li>\n<li>\n<p>Techno-greek aesthetic is inspired by synthwave, musical symbolism and greek sculpture.</p>\n</li>\n<li>\n<p>Playable with numerous control inputs such as: Mouse, gamepad, drawing tablet and touch.</p>\n</li>\n</ul>", "metacritic": null, "released": "2021-10-20", "tba": false, "updated": "2021-10-28T14:14:39", "background_image": "https://media.rawg.io/media/screenshots/78d/78d1202e5d7b24d963679d94ea5729ca.jpg", "website": "http://tinimations.net/presskit_klang2/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 4, "owned": 3, "toplay": 1, "dropped": 1}, "playtime": 0, "achievements_count": 59, "ratings_count": 0, "suggestions_count": 402, "game_series_count": 1, "reviews_count": 0, "platforms": ["PlayStation 5", "PlayStation 4", "Xbox One", "Xbox Series S/X", "Nintendo Switch", "PC"], "developers": ["Tinimations"], "genres": ["Action", "Indie"], "publishers": ["Tinimations"], "esrb_rating": null}