{"id": 667651, "slug": "war-mongrels", "name": "War Mongrels", "name_original": "War Mongrels", "description": "<p>War Mongrels, or WM, is an isometric real-time tactics game that takes place on the eastern front of World War II. This part of the war has been receiving less attention in gaming, even though it ended or changed a considerable number of lives and brought forward many stories of courage, comradery, but also further proof of twisted societies and the darkest parts of the human character. War Mongrels builds its foundations on these two opposing mental forces. First driven by propaganda, our heroes soon find their purpose in fighting back the expanding Nazi forces that entangled them in the international conflict in the first place. From boys to men in days, they open their eyes to the atrocities of war and find their purpose in the fight to prevent further meaningless killing.</p>\n<p>The heavily history-inspired storyline guides players through the journey of two Wehrmacht soldiers as they go from deserters to hefty guerilla fighters. Their team expands as they meet new characters who support the same cause. As each character has their own set of skills and advantages, players must learn to combine them effectively to outsmart the enemy during a variety of missions in a changing environment. Sneaking, distraction, silent kills, and using the environment are some of the main skills players will have to take to heart, but a stock of firearms will also be available and useful in completing mission objectives. And as the goal of every hero is to save others and hopefully survive, our heroes strive to prevent the deaths of innocent people instead of getting away from the war as originally intended.<br />\nMain Features<br />\nJoin forces – Online co-operative multiplayer for two players.<br />\nHistorical lesson – Events, dates, locations, weapons, uniforms, in-game historical articles, and much more.<br />\nUse force! – Have you been spotted? Draw your weapon and try to shoot your way out!<br />\nUnique team - Each character has their own personality, background, and skills to use during the journey.<br />\nTake or break – Interactive environment that opens up many tactical options.<br />\nReplay value – Try different tactics in each mission, play alone, or with different friends.<br />\nDark world – War is hell, and War Mongrels doesn’t sugar coat anything.<br />\nInfernal storyline – As grim as the bloody trenches where dead soldiers remain after battle.<br />\nJust wow! – Audio-visual quality like you’ve never seen in an RTT game before.</p>", "metacritic": null, "released": "2021-10-19", "tba": false, "updated": "2023-09-01T12:48:56", "background_image": "https://media.rawg.io/media/screenshots/2c2/2c2b71389803bcaa7c6ed64f90fc0975.jpg", "website": "https://www.warmongrels.com/", "rating": 3.4, "rating_top": 3, "added_by_status": {"yet": 13, "owned": 82, "beaten": 5, "toplay": 19, "dropped": 3}, "playtime": 5, "achievements_count": 80, "ratings_count": 10, "suggestions_count": 460, "game_series_count": 0, "reviews_count": 10, "platforms": ["PC"], "developers": ["Destructive Creations"], "genres": ["Action", "Adventure", "Strategy"], "publishers": ["Destructive Creations", "Surefire.Games", "DMM Games - Asia"], "esrb_rating": null}