{"id": 667696, "slug": "kingdom-of-heroes", "name": "Kingdom of Heroes", "name_original": "Kingdom of Heroes", "description": "An RPG game that grows by defeating monsters to level up and making a variety of items.<br/>\n<br/>\r\nAs this is a defense RPG game, monsters invades through the door of the dimensions to destroy Archangel where is in the center of town every two hours.<br/>\r\nIf Archangel is destroyed, you'll lose the game, so you'll have to defend it.<br/>\r\nTo stop monsters that are getting stronger over time, you should grow seven heroes and guards quickly<br/>\n<br/>\r\nField<br/>\r\n You can hunt monsters on the field to level up and take various items accordingly. <br/>\n<br/>\r\nDungeon<br/>\r\n The dungeon is located up to the 6th floor and you can go upstairs every time you clear each floor one by one. <br/>\r\n You will be able to win the game if you defeat the last boss monster on the 6th floor. <br/>\r\n To get to the dungeon, you need to have fragment of dimension and you can obtain it by hunting the field monsters.<br/>\n<br/>\r\nItems and strengthen<br/>\r\n You can make items through materials obtained by killing monsters.<br/>\r\n You can also strengthen it 3 times.  Keep in mind that the item will be disappeared if it fails.<br/>\n<br/>\r\nRune<br/>\r\n It is the item with various statistics and It consists of seven parts. <br/>\n<br/>\r\nGuard<br/>\r\n You can get coins of Honor in the dungeon.<br/>\r\n If you can recruit guards with the coin of honor, the guard can also be level up by hunting like a hero.<br/>\n<br/>\r\nAchievement<br/>\r\n  Once every kind of achievement is made, you can get the capability and it of course apply to all guards.", "metacritic": null, "released": "2021-09-20", "tba": false, "updated": "2021-09-24T02:36:07", "background_image": "https://media.rawg.io/media/screenshots/955/9552c156412fa31f717dda623f133f05.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 416, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MoonlightGames"], "genres": ["Action", "Indie"], "publishers": ["MoonlightGames"], "esrb_rating": null}