{"id": 667654, "slug": "nascar-21-ignition", "name": "NASCAR 21: Ignition", "name_original": "NASCAR 21: Ignition", "description": "<p>The Champions Edition will give you access to the forthcoming Season Pass which includes 3 monthly content drops, each containing over 55  alternative paint schemes, one alternative driver and a legendary driver.</p>\n<p>The Champions Edition offers a career booster pack   so you&#39;ll be able to sign up to a full season contract with any team of your choice, allowing you to jump right into the action with a championship caliber team. Save yourself some time by not having to sign for a underfunded team on a part-time schedule.</p>\n<p>The Champions Edition also includes access to Driver’s Champion Bill Elliott, including paint schemes , helmet and fire suit.</p>\n<p>ABOUT THIS GAME<br />\nTHE OFFICIAL NASCAR VIDEO GAME<br />\nNASCAR 21: Ignition redefines the official video game of the world’s most popular stock car racing series. With incredible graphics and immersive gameplay, NASCAR 21: Ignition brings a whole new level of authenticity and atmosphere to the NASCAR Cup Series.</p>\n<p>Complete with official drivers, teams and tracks from the 2021 NASCAR Cup Series season, the authentic presentation, including broadcast quality pre-race build up and post-race replays, takes you as close to the real thing as you can get.</p>\n<p>The handling of the car is a direct representation of how it feels to drive one of these incredible machines, complete with updated track packages that represent the 2021 NASCAR Cup Series schedule. This puts you in the heat of the action as the green flag drops, while a full suite of driver assists make the game accessible to new racers.</p>\n<p>Either dive straight into the action with Race Now, playing as your favorite official driver from the NASCAR Cup Series, or take on the immersive and engaging career mode as you build your reputation in the sport and battle your way toward the championship.</p>\n<p>A brand-new Paint Booth offers an unrivalled level of customization allowing you to create your own NASCAR Cup Series paint scheme complete with your own iconic race number.</p>\n<p>Supporting online multiplayer races, you are never far from a race whether that is in a party with your friends or racing with other players from around the world.</p>\n<p>· Experience the thrill and atmosphere of the NASCAR Cup Series with official cars, drivers and tracks from the 2021 season<br />\n· New Paint Booth offers unrivalled customization for your paint scheme<br />\n· Race online with other players for fun or competitively<br />\n· Incredible visuals and presentation<br />\n· True to life vehicle physics and handling with a suite of driver assists available<br />\n· Immersive Career Mode where you can create your NASCAR legacy</p>", "metacritic": null, "released": "2021-10-26", "tba": false, "updated": "2021-11-21T04:47:01", "background_image": "https://media.rawg.io/media/games/e48/e4822a250ad590cc1647ccd4743213cd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 24, "beaten": 1, "toplay": 1}, "playtime": 2, "achievements_count": 78, "ratings_count": 0, "suggestions_count": 168, "game_series_count": 0, "reviews_count": 1, "platforms": ["Xbox One", "PlayStation 4", "PC", "Xbox Series S/X", "PlayStation 5"], "developers": ["Motorsport Games"], "genres": ["Simulation", "Sports", "Racing"], "publishers": ["Motorsport Games"], "esrb_rating": null}