{"id": 667752, "slug": "flewfies-adventure", "name": "Flewfie's Adventure", "name_original": "Flewfie's Adventure", "description": "<h3>Planet Cutemellow is in trouble, Uzzu and his swarm of monsters are here to take over!</h3><br/><br/><br/>One day, disaster strikes on the sweet, colorful world of Cutemellow – a cruel, angry cat named Uzzu and their swarm of monsters have invaded! Under their orders, they begin wreaking havoc on the once peaceful planet …<br/><br/>Who is Uzzu and what do they want? When they break into the best laboratory of Cutemellow, they take off with Scientist Snail’s top secret experiments with one goal in mind: To take control over Cutemellow and all surrounding worlds! <br/><br/>Join Flewfie on this epic adventure! Fly across the sticky Caramel Coves, the shimmering scenes of the Crystal Plains and sneak through the murky depths of the Abandosphere – and explore each world to discover many quests on your journey! With the help of your friends Scientist Snail, Bunn Bunn and Pinky Panda, can you put an end to the chaos and stop Uzzu?<h3>KEY FEATURES</h3><ul><li>2 player local co-op for double the fun!<br/></li><li>Use your powerful UFO beam to move obstacles and control enemies.<br/></li><li>Level up your UFO and customize weapons to aid you in combat.<br/></li><li>Find Glop the puzzlemaster in every level! Test your skills with intricate puzzles and obstacles. Can you rescue all the Bundrops?<br/></li><li>Help those in need by completing various side quests.<br/></li><li>Play the original card game Fyued against rescued friends – and collect 100 cards!<br/></li><li>Packed with beautiful artwork and a cast of cute original characters.</li></ul><ul><li>Easy - Normal - Hard difficulty modes to challenge any player!<br/><br/></li></ul>", "metacritic": null, "released": "2021-09-23", "tba": false, "updated": "2021-09-24T03:21:36", "background_image": "https://media.rawg.io/media/screenshots/ad4/ad47c0a7bb44eb5feaf4ea8fa2d5b74a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 100, "ratings_count": 0, "suggestions_count": 301, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Valorware", "Cosmic Boop"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Valorware"], "esrb_rating": null}