{"id": 667723, "slug": "broken-thorns-west-gate", "name": "Broken Thorns: West Gate", "name_original": "Broken Thorns: West Gate", "description": "A symbolic story where you play as a stranger who just came from cursed land, searching for peace in this wretched world. You will have to travel through the land of West Gate, once a beautiful place that has become home to demons, shadows, and many other evil spirits.<br/><h3>Gameplay</h3>You will wander through the dying world, finding yourself in many different situations where evil forces will try to stop you by using your fears, doubts, temptations, and weaknesses. You won't have a hard time figuring out which choices in those situations are correct, hard will be choosing them honestly. Lying in this game is the same as losing. The evil Liar has spread his lies all over West Gate... Will you help him or defeat him?<h3>Unique Graphics</h3>A map, situations, items, and enemies are hand-drawn with colored pencils by five awesome young artists like in no other game. All human characters are drawn as stickmen.<h3>Features</h3><ul><li>An open world with several sidequests </li></ul><ul><li>80+ colourful hand-drawn pictures</li></ul><ul><li>50+ different situations where you can make new friends or meet dark enemies</li></ul><ul><li>Enemies will attack YOU, the player. They don't care about your avatar</li></ul><ul><li>Story inspired by real events, experiences and thoughts of the author</li></ul><br/><br/><br/>Note: Steam doesn't support Slovak language but you can set the game fully to Slovak in the game options.", "metacritic": null, "released": null, "tba": false, "updated": "2021-09-24T03:00:06", "background_image": "https://media.rawg.io/media/screenshots/1e6/1e68519cd21cdb69aae17f223e2644ee.jpg", "website": "https://www.facebook.com/Stick-Productions-106431288153070", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 312, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Stick Productions", "Xeroyd"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Stick Productions"], "esrb_rating": null}