{"id": 667736, "slug": "cyjin-the-cyborg-ninja", "name": "Cyjin: The Cyborg Ninja", "name_original": "Cyjin: The Cyborg Ninja", "description": "Precision platforming, challenging difficulty, pick-up and play, unique control, fast-paced action, neon cyberpunk, robot and ninja -- all combined into one game. Put away your keyboard, and beat it with just your mouse!<br/><br/><h3>You'll have to be a true ninja with lightning reflexes to beat this game!</h3> <br/>During your journey, you will face many challenges that will push your gaming skill to the limit -- and you'll do it with only your mouse! It's not just the lasers obstructing the path or the deadly spikes, but also the army of hostile yōkai-inspired robots that will try to kill you before you take the next step! Can you find your way out of these dangerous, enemy-infested mazes in one piece? Get your mouse ready to help Cyjin defeat the fearsome Shōgun! <br/><br/><br/> <br/><br/><h3>Game Features:</h3> <br/><br/><ul><li>Unique Mouse-based Twitch Control - Experience one of the most unique gameplay with mouse-based precision platforming. Master how you twitch your mouse to get Cyjin into lightning action. Using your ninja-fast mouse skill, overcome challenges of all kinds created by our crazy developers.<br/><br/></li><li>Accelerated Dashing Action - Take control of your cyborg ninja in accelerated dashing action, and strike your enemies. A fun way to crush your enemies with speedy destruction.   <br/><br/></li><li>Swift &amp; Precise Platforming - Aim with your mouse to target your path and landing. Manage your precision and timing to pass through tricky obstacles.   <br/><br/></li><li>Exciting Bosses - Our developers have prepared intense bosses of all sizes that will stomp whoever challenges them. Get yourself ready for exciting boss fights that will challenge your precision, speed and skill!   <br/><br/></li><li>2D Oriental Cyberpunk - Savour the rich world of Cyjin, blending oriental inspiration with cyberpunk theme. Adventure through different areas, from the deep wasteland of the Junkyard, to the industrial grime of the Automation Factory, and the traditional futurism of the Urbanscape. All combined into a platformer and a retro atmosphere.   <br/><br/></li><li>Challenging Puzzles - Each level contains puzzles which will require quick thinking and ninja-fast timing to navigate. Can you solve them with the limited time you have? <br/><br/><br/> <br/><br/>After suffering defeat at the hands of his arch-nemesis, the Shōgun, Cyjin was abandoned and left to rust in a robot graveyard. However, a spark of life yet remained. Awaking from beneath the mountain of scraps, Cyjin vows to seek revenge on his enemies. Will Cyjin ascend back to the land of the living and find justice?</li></ul>", "metacritic": null, "released": "2021-06-09", "tba": false, "updated": "2023-03-18T05:19:28", "background_image": "https://media.rawg.io/media/screenshots/cbf/cbf95fd63ddcabc22eb276407c07308e.jpg", "website": "https://www.aiyagames.co.th/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4, "beaten": 2, "toplay": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 479, "game_series_count": 0, "reviews_count": 4, "platforms": ["PC"], "developers": ["Aiya Games"], "genres": ["Action", "Indie", "Platformer"], "publishers": ["Aiya Games"], "esrb_rating": null}