{"id": 667707, "slug": "chessplosion", "name": "Chessplosion", "name_original": "Chessplosion", "description": "Chessplosion is an arcade action puzzle game where you drop chess piece-shaped bombs to create chain reactions and trap opponents. Defeat enemies and bosses in Adventure Mode, break targets with limited bombs in Puzzle Mode, dodge explosions in Survival Mode, or fight friends and AI in Battle Mode. No prior chess knowledge is required, as the optional tutorials will get you up to speed.<br/><br/><br/><br/>Defeat a variety of enemy types and boss fights in Adventure Mode, inspired by the movement patterns of chess pieces. Avoid charging Rooks, don't get shot by Bishops' diagonal projectiles, and watch out for stomping Knights.<br/><br/><br/><br/>Solve over 100 puzzles in Puzzle Mode, by using limited bombs to cause a chain reaction and break the targets. Make sure you don't get trapped in the blast yourself!<br/><br/><br/><br/>Dodge explosions in Survival Mode, where you're pitted against waves of tricky bomb patterns. It starts simple enough, but by the end you'll be dodging bullet hell Queen explosions and solving chess puzzles in real-time.<br/><br/><br/><br/>Go head to head in Battle Mode, either fighting against the AI or against other players in local or online multiplayer (with rollback netcode). If you want a change from the regular Free For All Battles or Team Battles, the Tennis Battle mode lets you throw bombs over the center line to create bomb patterns for your opponent to dodge.<h3>Features</h3><ul><li>Fight through 8 bosses and over 90 stages in Adventure Mode.<br/></li><li>Solve over 100 target-breaking puzzles in Puzzle Mode.<br/></li><li>Survive over 10 stages of explosion-dodging challenges in Survival Mode.<br/></li><li>Battle your friends in 12 different arenas in Battle Mode, with up to 4 players in online or local multiplayer.<br/></li><li>Use the comprehensive Assist Mode to adjust the game to your liking by tweaking health, lives, game speed, or outright skipping troublesome stages.</li></ul>", "metacritic": null, "released": "2021-09-21", "tba": false, "updated": "2024-03-24T05:37:11", "background_image": "https://media.rawg.io/media/screenshots/631/63168fea4c45ec8aa8747afb07cbadad.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 8, "playing": 1}, "playtime": 26, "achievements_count": 21, "ratings_count": 1, "suggestions_count": 116, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["CT Matthews"], "genres": ["Action", "Indie"], "publishers": ["CT Matthews"], "esrb_rating": null}