{"id": 667740, "slug": "listen-to-the-wind", "name": "Listen to the Wind", "name_original": "Listen to the Wind", "description": "During the Ming dynasty Jiajing era, rampant government corruption and border mismanagement has given Japanese pirates a chance to attack the south-east coast of the country. One day, our main character who has lived in the mountains for many years, gets tasked to support the soldiers in fighting the pirates. However, while fighting in service of the people and the country, you discover there is more than meets the eye in this pirate invasion.<br/><br/>Will you decide to find out who's pulling the strings behind the government or will you choose to move back to your hermit ways after your quest is completed. The choice is yours to make.<br/><br/>As the story progresses, historical figures such as Qi Jiguang, Wang Zhi, Xu Hai, Matsura Takanobu and others make an appearance. How will the story turn out? Find out by unveiling the secrets!<br/><br/><br/><br/>Players will face many types of enemies, such as renegades, evil monks and your apprentices. Chinese warriors only need a few moves to determine who wins or losses. Chasing the enemy is not the best way to win, study you enemy's every move. <br/><br/>Be precise and sharp to take the upper hand. <br/>Wait for an opening in the enemy's defense and be like water, be as light as a cloud, be decisive and you will then emerge victorious.<br/><br/><br/><br/>Depending on your choices, you will navigate through different scenarios that will branch out the story of the game. You and your apprentice could get entangled into a conflict. There are dozens of plotlines in the game that you can go back and re-play if you wish to get to know more about the characters and their relationships.<br/><br/><br/><br/>● Unique parry-like mechanic that gives you a satisfying parry-attack experience.<br/>● Enjoy a deep story rich game with multiple endings.<br/>● Gaze through a combination of Chinese art styles such as free hand brush work, watercolor painting, oil painting and others.<br/>● Cutscenes with storyboards in Chinese comic style.<br/>● Meet Chinese generals, royal members, Japanese pirates and the resistance leader among many other historical figures.<br/>● Delight yourself while outside of battle with a cooking system that will make you feel the charm of Chinese food through the vast amount of ingredients, you'll be able to choose from.<br/><br/>", "metacritic": null, "released": "2021-09-22", "tba": false, "updated": "2021-09-24T03:13:16", "background_image": "https://media.rawg.io/media/screenshots/536/536ad2eca76e854397829e19af6a560f.jpg", "website": "https://weibo.com/p/1006066469614836", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 461, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Papertiger Studio"], "genres": ["Action", "Indie"], "publishers": ["Gamera Game"], "esrb_rating": null}