{"id": 667716, "slug": "onmyoji-in-the-otherworld-sayakas-story", "name": "Onmyoji in the Otherworld: Sayaka's Story", "name_original": "Onmyoji in the Otherworld: Sayaka's Story", "description": "<h3>FEATURES</h3><ul><li>Turn-based combat. Expel spirits by night.<br/></li><li>Shop, upgrade, and top up your powers by day.<br/></li><li>Master and summon 15 different spirits with unique abilities.<br/></li><li>15+ hours of story and gameplay.</li></ul><h3>SUMMARY</h3><br/>In a regional city in the present day, Sayaka Mimuro manages her family's Shinto shrine on behalf of her absent parents. Along with her childhood friend Haru and a talking furball (rabbit?) god, she lives a peaceful life, but when an earthquake strikes, aggressive spirits suddenly appear and her world is torn apart.<br/><br/>Sayaka receives divine tidings that the only one who can save the city is herself—she's actually an Onmyoji with the power to vanquish spirits! However, in order to unlock her powers, she must first perform certain rituals with a man...<br/><br/>\"...If I'm the only one who can do it, then I guess I have no choice!\"<br/><br/>Sayaka is bewildered to say the least, but her natural sense of justice gives her the resolve to fight...<br/><br/>\"There is only one person I can ask to do this and that's you, Haru... Please?\"<br/><br/>With no one else to turn to, Sayaka asks a confused Haru to be the male partner she needs for her rituals. With his help, Sayaka finally unlocks her battle-princess powers to wage war on the spirits that ravage her city...<h3>CHARACTER</h3><br/>Heroine: Sayaka Mimuro<br/>Voice: Yui Sakakibara<br/><br/><br/><br/>“Nothing is impossible if you give it your all.”<br/><br/>A hardworking and beautiful girl with a strong sense of justice. Although Sayaka herself doesn't know it, she's descended from a line of Onmyoji sorcerers, and the powers of exorcism slumber within her.<br/><br/>She was brought up to be responsible, and she'll never abandon anyone in need. She also tries to see the best in every situation—even the bad one that her dutiful nature has gotten her into now.<br/>When it comes to love, she has as much of an interest as anyone else, but the shrine work she does in her parents' stead has always kept her too busy to date.<br/><br/>Weapon: Spirit Sword", "metacritic": null, "released": "2021-09-21", "tba": false, "updated": "2021-09-24T02:53:39", "background_image": "https://media.rawg.io/media/screenshots/b6d/b6da886e8b83a93071e9aba6dde44468.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 190, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Debonosu Works"], "genres": ["Adventure", "Strategy"], "publishers": ["Shiravune"], "esrb_rating": null}