{"id": 6678, "slug": "ninja-boy-adventures-bomberman-edition", "name": "Ninja Boy Adventures - Bomberman edition", "name_original": "Ninja Boy Adventures - Bomberman edition", "description": "Ninja Boy Adventures is FREE today with AppGratis.com<br/><br/>“I highly recommend giving Ninja Boy Adventures a try if you’re a fan of Bomberman or like challenging maze strategy games” - AppAdvice.com<br/><br/>“... I can safely say this is old-school Bomberman through and through, from the level designs to the power-up items and even the enemy behaviors. It's really awesome!” - TouchArcade.com<br/><br/>“With MFi controller support and no IAP whatsoever, Ninja Boy Adventures will be the Bomberman game iOS players have been waiting for quite a long time” - TouchTapPlay.com<br/><br/>Ninja Boy Adventures is an strategy game inspired in the arcade’s classic Bomberman. Take power ups, put bombs and destroy all the enemies to complete the levels in this amazing adventure.<br/><br/>STORY MODE<br/>Play 30 challenging levels distributed in 11 zones and 3 imaginary worlds. Eliminate all enemies and bosses to clear all the levels and complete the game. Up to 4 players at the same time in a incredible collaborative mode.<br/><br/>BATTLE MODE<br/>Play multiplayer online with up to 4 players at the same time over Internet. On your Apple TV you can also play offline on the same device. Now is time to demostrate your friends who are the best!<br/><br/>AMAZING GRAPHICS AND GAMEPLAY<br/>Explore worlds filled with gorgeous environments, hilarious characters, 8-bit sounds effects and music and stunning graphics.<br/><br/>NO ADS, NO HIDDEN PAYMENTS<br/>Pay just one time and play all you want. There is no hidden in-apps and annoying ads.<br/><br/>BLUETOOTH CONTROLLERS COMPATIBLE<br/>Now you can play the game with your bluetooth controller. Up to 4 controllers can be connected at the same time. Of course touchscreen controllers are also available.<br/><br/>GAME CENTER SUPPORT<br/>Unlock all the achievements and connect to Game Center to beat the high scores.<br/><br/>IPHONE, IPAD &amp; APPLE TV<br/>We have designed the game to be 100% compatible with all iOS devices. Download the game once and you will have it on all your devices. Amazing!<br/><br/>Join now into the Ninja Boy Adventures!<br/><br/>Thanks for playing Ninja Boy Adventures! <br/>If you have any suggestions please contact us at: support@theclashsoft.com or www.theclashsoft.com<br/><br/>Developed by: The Clash Soft (www.theclashsoft.com) &amp; Rocker Apps (www.rockerapps.com)", "metacritic": null, "released": "2016-02-02", "tba": false, "updated": "2021-03-08T03:58:07", "background_image": "https://media.rawg.io/media/screenshots/216/216061d8c1fbff490ab9c660dc3d1613.jpeg", "website": "http://www.theclashsoft.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 97, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["The Clash Soft"], "genres": ["Strategy", "Arcade", "Casual"], "publishers": ["Javier Aznar de los Rios"], "esrb_rating": null}