{"id": 667945, "slug": "ecotopia-team-awesome", "name": "Ecotopia (Team Awesome)", "name_original": "Ecotopia (Team Awesome)", "description": "<p><strong>Humanity is in a dark age</strong><strong>. </strong>Social systems are failing. Disease and illness run rampant in cities. Climate disasters devastate entire countries. Humans very existence teeters on the <strong>brink of extinction. </strong></p>\n<p> As more Humanity is wiped out by their own undoing, planet Earth begins to thrive. For thousands of years <strong>Earth has been plagued by the constant virus that is Humanity.</strong> Earth has done as much as possible to stop humanity from depleting its resources and life. Earth has unleashed fires, floods, earthquakes, and disease, <strong>yet still the virus remains. </strong></p>\n<p> Is there a way to find a compromise between both organisms? Can Humanity find a way to no longer extract resources and stop wiping out ecological diversity? Will Humanity destroy all inhabitable terra in search of the next best solution? Is there a way to utilize biodiversity and regenerative resources to build a society that works with Earth not against it? </p>\n<p> <strong>Ecotopia is the goal. </strong></p>\n<p>With Humanity working together, it is possible to create <strong>cities that are healthy and thriving for all that exist.</strong> Earth has a desire to maintain ecological harmony and requires the stewardship of Humanity to ensure that there is a balance. However, if Humanity continues to fall into the trap of their own ego, then <strong>Earth will have to use everything within its power to rid itself of the virus of Humanity.</strong></p>\n<p>Link to Miro for visual flow of storyline.</p>", "metacritic": null, "released": "2021-09-23", "tba": false, "updated": "2021-09-24T04:29:05", "background_image": "https://media.rawg.io/media/screenshots/039/039d774ded1666674ab6161ddf6745ba.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 65, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Team Awesome"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}