{"id": 668060, "slug": "hex-master-lobosandia", "name": "Hex Master (Lobosandia)", "name_original": "Hex Master (Lobosandia)", "description": "<p>Hex Master is a first person shooter where you play as Lluuvia, a Mage apprentice exploring the dangerous \"Chaos Spire\" and defeat the monsters inside to prove her mentor she is a skilled magician.</p>\n<p>The game features some RPG elements, Lluuvia can level up by defeating enemies and obtain points to increase her stats.</p>\n<p>By increasing stats she can attack faster, do more damage, endure more hits or regenerate her magic faster.</p>\n<p>Keyboard Controls</p>\n<p>D-PAD: Arrow Keys or WASD - Up and Down on the D-PAD moves the character forward and back, on pause menu it's used to cycle between stats.</p>\n<p> Left and Right either turns character or strafes to the chosen direction depending whether the A button is being held or not.</p>\n<p> On pause menu it's used to increase or decrease the selected stat.</p>\n<p>B Button: J or Z - Shoots a magic projectile.</p>\n<p>A Button: K or X - If held, the character strafes instead of turning when pressing the D-PAD left or right.</p>\n<p>Start Button: Enter - Starts the game, Skips Cutscenes and opens/closes the Pause menu.</p>\n<p>Select Button: Unused.</p>\n<p>The game is also compatible with a XInput gamepad (Like the ones for the Xbox 360/Xbox One/Xbox Series)</p>\n<p>In this case, Left Thumbstick and the D-PAD should act as a Gameboy D-PAD, the X button would act as the B button and the A button as the A button.</p>", "metacritic": null, "released": "2021-09-23", "tba": false, "updated": "2021-09-24T04:54:37", "background_image": "https://media.rawg.io/media/screenshots/c32/c32b565787682c8a1a2dd3d14038b49d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 107, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Lobosandia"], "genres": ["Shooter", "RPG"], "publishers": [], "esrb_rating": null}