{"id": 66837, "slug": "do-not-disturb-2-pranks-and-comedy-jokes-with-grum", "name": "Do Not Disturb! 2 - Pranks and Comedy Jokes with Grumpy's Mailbox", "name_original": "Do Not Disturb! 2 - Pranks and Comedy Jokes with Grumpy's Mailbox", "description": "Don’t you hate waiting for the delivery of that special package to your mailbox? And don’t you get a little angry when something else gets delivered first? Well, Mr. Grumpy McGrump knows exactly how it feels!<br/><br/>Yes, Mr. McGrump is back! But no, he is not pleased to meet you again. If you loved Do Not Disturb, you’re going to be amazed with Do Not Disturb 2! All-new content from your favorite marmot -- or perhaps the only one you know.<br/><br/>Mr. McGrump is not a very cheerful marmot -- after all, he’s not named Grumpy by coincidence -- but his crankiness is sure to make you laugh hard! Play funny pranks on him and see the most hilarious reactions. Have fun with the funniest virtual pet you can own!<br/><br/>FUNNY REACTIONS<br/>Tap the mailbox and interact with the scenario to earn coins and unlock new and hilarious reactions. You can’t have enough of Mr. McGrump, the grumpy marmot.<br/><br/>COLLECTIBLE SOUVENIRS<br/>Share the most exciting hobby of Mr. McGrump: stamp collecting! Earn surprise stamps as souvenirs from your pranks on him and keep them forever in your own personal collection. Can you get them all?<br/><br/>HIGHLIGHTS<br/>• Great cartoon artwork<br/>• Greatly improved animations<br/>• Perfect entertainment for kids (and adults as well!)<br/>• Dozens of funny reactions: you’ll laugh out loud with everyone around<br/>• Interact with objects and the scenario to discover all surprises<br/>• Interactive gameplay<br/><br/>So stop reading and start playing! Laugh twice as hard with Do Not Disturb 2.<br/>And if you don’t know the original one, try the first Do Not Disturb as well!<br/><br/>Disclaimer: While this App is completely free to play, some additional content can be purchased for real money in-game. If you do not want to use this feature, please turn off in-app purchases in your device's settings.<br/><br/>Like our page on Facebook and be the first to know about our upcoming games and updates! http://fb.com/tappshq", "metacritic": null, "released": "2014-10-15", "tba": false, "updated": "2019-10-22T14:20:02", "background_image": "https://media.rawg.io/media/screenshots/814/8146000d65556daf776243e9162b584b.jpg", "website": "http://tappsgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 106, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tapps Tecnologia da Informação Ltda."], "genres": ["Simulation", "Family"], "publishers": ["Tapps Tecnologia da Informacao LTDA."], "esrb_rating": null}