{"id": 668353, "slug": "adelheid", "name": "Adelheid", "name_original": "Adelheid", "description": "<p>An interactive game with turn-based combat revolving around purifying the woods beyond a secular seal, currently a prototype.<br/></p><p><em>I'm sorry, mother, I can't honor your wishes, so I'll have to be a little selfish and pursue my own.</em></p>\n<p>The Autumn Festival is nearby, but this time, Adelheid has decided to start off by finishing once and for all the annual purifying ceremony at the Old Woods and banishing the miasma himself. But is he really prepared for taking a century-old curse and shatter it?</p>\n<p>A young lad that takes on the role of a purifier, a demon with weird garments and perhaps too much interest in aiding someone who should very well be his enemy. What exactly is going on here?</p>\n\n\n\r\nA Letter from the Dev\r\n<p>Hello there!</p>\n<p>As you can see, this is a very early prototype that I spent the entirety of September working on. It was pretty much my first heavy coding experience with games and is definitely one I learned a lot with.</p>\n<p>\"Adelheid\" is a placeholder name, and the initial concept was completely different! First, I had this idea where Adelheid (then nameless as a protagonist) would be taken to hell by this demon (you know who it is), and then forced to use his spells to help the guy get back in command. It was mainly focused on the combat system, and you can see how that turned out: Barebones at best!<br/><br/></p>\n<p>I had so many issues coding the battle system, around 8 to 10 days were me just fiddling around with it, trying to find out why things were broken and how I could make them work. The Exploration system, on the other hand, went smoothly, and I was really shocked at how easy it was, it made me appreciate JSON files so much more.<br/></p>\n<p>Art-wise, I decided to go with a more sketchy, monochrome look for the corrupted areas, giving that sense of \"lacking a soul\", you know? It might come off as lazy, though, since I'm not the best sketcher at the moment, haha.</p>\n<p>It was all worth it, though, and I learned so much, wrote so much code and drew so many things. In the end, making games for me is a learning experience, and hoo man this experience left me tired, but very satisfied.<br/></p>\n<p>Anyway, I really hope you can like this prototype, I'll take a short break and focus on myself for a bit, thank you so much for downloading it, and thank you even more for reading this letter!</p>\n<p>- Perse.</p>\r\nCredits\r\n<p>Persephius - Art, Music, Coding, and Writing</p>\n<p>Emilio Coppola - Dialogic Plugin for Godot (Thank you so much!)</p>", "metacritic": null, "released": "2021-09-22", "tba": false, "updated": "2021-09-24T06:06:36", "background_image": "https://media.rawg.io/media/screenshots/f52/f521e53c73a4ae8b26d03174593c8486.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 106, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Persimmon"], "genres": [], "publishers": [], "esrb_rating": null}