{"id": 668398, "slug": "au-racing", "name": "AU RACING", "name_original": "AU RACING", "description": "<p>AU Racing is my complete driving game on Unity HDRP (High Definition Render Pipeline). In this game, I created my own race tracks on Blender. After designing the race tracks on Blender, I imported them onto Unity and set up different types of cars. Each car will have its own driving style and I customised it on the inspector panel. </p>\n<p>AU Racing covers, different handling on grass, gravel and road surfaces; setting up AI cars that will compete against you in race mode; checkpoints and lap counting; keeping track of car positions and displaying finish place at the end of the race; mini-map; main menu, race track, select menu and a car showroom, so you can buy extra cars for the open-world race track. </p>\n<p>AU Racing allows you to choose various colours for the cars you buy; you can see the leaderboard and race stats; there is a save system to save your credits and high scores (Crucial!); race customisation system from the track options menu; an option to either use keyboard or gamepad control systems; I added terrain sculpting and texturing to add extra details for both the rack track and the open-world race track. </p>\n<p>At the end of developing AU Racing, I have a complete game but I want to continue developing and adding more features. I am so happy to develop a fully 3D racing game as this genre is one of the hardest games I produced and this game wouldn't be possible if I hadn't developed my previous games either 2D or 3D. </p>\n<p>Controls: Up Arrow or W (Accerlate), Left Arrow or A (Turn Left),  Right Arrow or D (Turn Right), Down Arrow or S (Slow down, Brake, Reverse), C (Change Camera)</p>", "metacritic": null, "released": "2021-09-22", "tba": false, "updated": "2021-09-24T06:17:33", "background_image": "https://media.rawg.io/media/screenshots/f43/f435df384db9f62a81f5abcbf7be22f0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 34, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["AAhmed9"], "genres": ["Racing"], "publishers": [], "esrb_rating": null}