{"id": 668497, "slug": "fel-industries-outworld-prototype", "name": "FEL - Industries Outworld (prototype)", "name_original": "FEL - Industries Outworld (prototype)", "description": "<p>A powerful warship was destroyed under mysterious circumstances, however something remains alive on board the wreckage.</p>\n<p>Take control of a maintenance robot and navigate the ship's interior in search for answers.<br/></p>\n<p>-----<br/></p>\n<p>FEL - Indusries Outworld (or just Felio for short) is a little 3D/2.5D indie puzzle platformer set on board a fleet of derelict starships, which hold many secrets and dangers.</p>\n\n<p><strong>NOTE: The current release is a first prototype demo meant to test the base systems and features and is in no way final. The levels and story are pretty much just quick placeholders, created for the purposes of a university presentation.</strong><br/></p>\n<p>In the final release you will be able to explore multiple starships, engage with strange characters and learn their stories, test your skills in puzzle-based combat,  customize your character with cosmetics unlockable through gameplay and more.</p><p>I plan to post incremental updates every month or two as I continue to refine and expand the game.<br/></p>\n\n<p>Features that are actually present in this demo are:</p>\n<ul><li>Basic 2.5D movement (run, jump, crouch, sneak, ledge grab)</li><li>Reactor Energy Management<ul><li>(Every ship/level has a reactor that holds certain amount of power. Using items such as doors and floating platforms depletes energy. If the reactor is offline or out of power, these devices cannot be used.)</li></ul></li><li>Dynamic music that changes in accordance to remaining reactor power.</li><li>Basic character customization (you can change the robot's color in the pause menu)</li><li>Some really bad, bland and janky menus</li><li>Multiple language support (currently only English and Czech, plans exist for eventually allowing community translations)</li><li>Lots of bugs</li></ul>\n<p>-----</p>\n<p><strong>Controls</strong></p>\n<ul><li>Movement = WASD/arrowkeys</li><li>\r\nJump = Spacebar</li><li>\r\nCrouch = Ctrl</li></ul>\n<p>Cat moves slower when crouching but jumps higher.</p>\n<p>Videos between levels can be skipped by pressing spacebar.</p>\n<p>-----<br/></p>\n<p><strong>Known Issues</strong></p>\n<p>- Music may be a bit too loud by default, it's recommended to lover the music volume to around 50% if you value your ear drums.</p>\n<p>- Ledge detection is far from perfect and character has a tendency to sometimes climb the air.</p>\n<p>- In rare cases the character can miss a trigger and fail to turn a corner, which can put them out of bounds. This is inconsistent enough that a level restart should help.</p>\n<p>- Some text bubbles may disappear before the player can read them and will not appear again until the level is restarted.</p>\n<p>- It is recommended not to pause during the final boss minigame. There's a chance of soft-lock or a complete program failure.</p>\n<p>- The final video plays when exiting the second level even if the player didn't complete the level.</p>\n<p>- The game doesn't behave well on resolution ratios other than 16:9</p>\n<p>Opinions and reports of errors not in the above list can be sent to kochich71@gmail.com</p>", "metacritic": null, "released": "2021-09-21", "tba": false, "updated": "2021-09-24T06:39:25", "background_image": "https://media.rawg.io/media/screenshots/def/defbaa00bf08fe6841400c99d41c7c4e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 186, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["Kochich"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}