{"id": 66864, "slug": "toilet-treasures-time-for-a-bathroom-adventure-gam", "name": "Toilet Treasures - Time for a Bathroom Adventure Game", "name_original": "Toilet Treasures - Time for a Bathroom Adventure Game", "description": "You sit on it every day, but do you know what lies within the depths of your toilet when it is clogged? Sit tight and prepare yourself to play a game based on true discoveries directly from the annals of plumbing history. Find the long lost and wondrous objects from inside your toilet in Toilet Treasures!<br/><br/>Grab your plunger and get ready: you’ll be amazed with what is inside of your toilet!<br/><br/>Collect dozen of marvelous artifacts sunken in your toilet. As you complete each thematic collection, earn exquisite thematic plungers. Plus, can you find all the rare and legendary golden objects? Try Toilet Treasures now and live a realistic unclogging experience -- finally a game where you might actually learn something useful for life.<br/><br/>HIGHLIGHTS<br/>• 60 bizarre objects to collect <br/>• Thematic plungers to unlock<br/>• Tasteful design<br/>• Feel like a real plumber<br/>• Based on a true story<br/><br/>Download Toilet Treasures now and reflect upon the beauty hidden in the depths of everyday life.<br/><br/>Disclaimer: While this App is completely free to play, some additional content can be purchased for real money in-game. If you do not want to use this feature, please turn off in-app purchases in your device's settings.<br/><br/>Like our page on Facebook and be the first to know about our upcoming games and updates! http://fb.com/tappshq", "metacritic": null, "released": "2014-07-13", "tba": false, "updated": "2019-07-29T09:30:55", "background_image": "https://media.rawg.io/media/screenshots/c12/c12394f9d1da09546014e47b2455f95f.jpg", "website": "http://tappsgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Tapps Tecnologia da Informação Ltda."], "genres": ["Strategy", "Simulation"], "publishers": ["Tapps Tecnologia da Informacao LTDA."], "esrb_rating": "Everyone 10+"}