{"id": 668717, "slug": "tick-tock-time-machine", "name": "Tick Tock Time Machine", "name_original": "Tick Tock Time Machine", "description": "<p>Tick Tock Time Machine is a 2D platforming adventure for everyone!<br/>\r\nPlay as Charlie Parker, a feline adventurer whose only limit is his weight.<br/>\r\nUse a mysterious pocket watch to bend time to your will &amp; apply its powers to reach your goals.</p>\n<p>Actual modifications that I've made to the game:</p>\n<ul><li>I created 4 new levels, one of them being a tutorial, with the other three being complete, coherent levels. Each one brings unique gameplay and challenges to the player.</li><li>I modified the main menu by changing its font, background, design, etc.</li><li>I reskinned the <em>entire</em> game. All the art, sprites, animations, etc. on the screen were created by me.</li><li>I utilized the Unity 2D experimental lighting feature to create a new, dynamic lighting system.</li><li>I added lava &amp; water to add detail and flair to the game.</li><li>I replaced all the sound effects with my own custom effects, alongside creating custom music for the main menu and levels.</li><li>I added a new player ability, which allows the player to slow and speed up time. Each of these different states of time allows for special abilities and variations in gameplay.</li><li>I modified the in-game GUI to display the current pace of time and modified health bar.</li></ul>\n\n<p>Credits:</p>\n<p>Created by Chris Cardimen in September of 2021 for MI445-001 at MSU.<br/>\r\nAll art, sounds, and other graphical assets are my own. The custom scripts that were written are also my own. The only asset that isn't my own, is the font: Retron2000,<br/>Base gameplay functionality was provided by Michigan State University.</p>", "metacritic": null, "released": "2021-09-21", "tba": false, "updated": "2021-09-24T07:34:51", "background_image": "https://media.rawg.io/media/screenshots/73f/73f689c3c057d45651d3df09d39b7791.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 140, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Web"], "developers": ["Chris Cardimen"], "genres": ["Adventure", "Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}