{"id": 668746, "slug": "city-run-vr-run-jog-and-train-in-vr-with-your-ocul", "name": "City Run VR - Run, Jog and Train in VR with your Oculus Quest 1 & 2!", "name_original": "City Run VR - Run, Jog and Train in VR with your Oculus Quest 1 & 2!", "description": "You can run, jog and train in VR!\r\n<p>Do you want to running, jogging or simply stay fit with with your <strong>Oculus Quest</strong>? Now You can! We have released City Run VR, the <strong>first and most realistic</strong> simulation for jogging, running and walking in a realistic and immersive virtual 3d environment! </p>\n<p>The App is <strong>totally compatible</strong> with your Oculus Quest VR headset (1 &amp; 2) and very soon it will also be compatible with all the other VR viewers and the smartphones on the market.\r\n</p>\n<p>The virtual environment reproduces reality faithfully. You will have the feeling of running in a <strong>real urban environment</strong> with traffic, pedestrians, voices, ambient sounds, streets, buildings, etc. <br/></p>\n<p>The experience includes many different variables including: complete day / night cycle, synchronization with <strong>the time and weather</strong> conditions of the player's location, wind, rain, clouds, sunrise, sunset, traffic, pedestrians, for an <strong>ever-changing and engaging</strong> game scenario!<br/></p>\n<p>You will be able to train in many different conditions (night, day, sunrise, sunset, rain, wind, busy city, deserted city, etc.) <strong>just like in reality</strong>!<br/></p>\n<p>We have worked over two years to offer you the <strong>most innovative and realistic</strong> jogging and running simulation ever made. You will be able to train in an effective and fun way from the comfort of your home whenever you want.</p>\n<p>Do you want to stay fit jogging,running  or walking  in the <strong>comfort of your home</strong>? Do you want to do physical activity <strong>when and how</strong> do you want? Do you want to play sports without going to <strong>crowded place</strong>s or risking unnecessarily at the health level? \r\n</p>\n<p>With our Virtual App you can comfortably  stay fit  in a safe, <strong>fun and engaging</strong> way at home  at work or anywhere else you want at anytime of the day and  whenever you want!  </p>\n<p>Thanks to the AI each workout will be <strong>different</strong> from the previous one and you will be able to train in a setting that is always <strong>new and engaging</strong>. The AI recognise also the time (e.g. if you train in the evening <strong>it will also be</strong> in the app). </p>\n<p>You will be able to run or walk in a totally immersive virtual environment also <strong>monitoring your progress in real time</strong> (steps taken, distance travelled) You will able  to  train  in a  effective and fun way  with a <strong>pleasant and motivating</strong> background music  in an absolutely realistic virtual environment with your VR headset (Oculus Quest 1 &amp; Oculus Quest 2).  </p>\r\nFeatures:\r\n<p> ■ <strong>You can run at home</strong></p>\n<p>Limited time? Bad weather? No problem! With our App You can run confortably at home.\r\n</p>\n<p>■ <strong>Stunning experience</strong>\n</p>\n<p>The first and most realistic simulation for jogging in a  immersive 3d environment.\r\n</p>\n<p>■ <strong>Stay fit with music</strong>\n</p>\n<p>Train with an energetic and motivating soundtrack that changes everytime.\r\n</p>\n<p> ■ <strong>Each traning is unique</strong>\n</p>\n<p>Each training session will be fun, engaging and different from the last thanks to the AI. \r\n</p>\n<p>■ <strong>Track your progress</strong>\n</p>\n<p>You can monitor your progress in real time every time (steps taken, distance travelled)..\r\n</p>\n<p>■ <strong>No need of costly gear</strong>\n</p>\n<p>Forget expensive gym membership or costly equipments, you need only the Oculus viewer  that you already have.</p>\n<p>■ <strong>A real training in VR</strong>\n</p>\n<p>Each training session wil be absolutely effective, you will burn almost 636 calories with an hour training session.</p>\n<p>■ <strong>Too out of shape to run?</strong>\n</p>\n<p>You can simply just walknd loosing weight while having fun.</p>\n\n<p><strong>Watch on the video below one of the infinite City Run VR Gameplay Scenarios : Jogging in the Evening with Light Rain !</strong></p>\n<br/><br/>", "metacritic": null, "released": "2021-09-19", "tba": false, "updated": "2021-09-24T07:41:28", "background_image": "https://media.rawg.io/media/screenshots/37f/37f060e1a7af9759c62c595ccc2151c4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 94, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["fitnessvr"], "genres": ["Simulation", "Sports"], "publishers": [], "esrb_rating": null}