{"id": 66879, "slug": "ninja-combat-samurai-warrior", "name": "Ninja Combat: Samurai Warrior", "name_original": "Ninja Combat: Samurai Warrior", "description": "Ninja Combat is a 3D epic action game. You play as a legendary angry green ninja, who knows how to use fighting dragon skills, martial arts, kung fu and karate. He is also armed with ethernity shurikens, sword weapon - katana blade. You find your self in a jungle near to water, while you meet hunter villiger, who seeks help againt horde of mercenary barbarians that are heavy armored and who invided town and tower temples. If you accept this glory challenge, you will face pure evil, which even your sensei couldn't prepare you for. If you defeat every enemy in this battle field war, you will be known as immortal legend. You can also use your infiltration skillls ( stealth ) to sneak into places unaware like a spy avoiding fight not like a violent rogue assassin ( hitman ) and perform bloody revenge. Your impressive powerful agile body is also lethal weapon, you can use mortal tiger kick, crush punch, special killer strike or you can just run away if you are almost dead to avoid death and prepare counter attack after heal. Your weapon is more powerful and helps you in this clash fight even more, you just have to chop and slash your way through the horde.<br/><br/>- Beautiful 3D HD graphics in one level<br/>- Far east / Japanese open world environment ( forest, city )<br/>- Amazing open space, adventure world that we craft very well<br/>- several missions such as vicious assassination, punishing murder for crime, rescue camp and captives, gaining loot and other gear up missions<br/>- Elite rising shadow hero that needs to do his duty<br/>- option to fight, run, swim, climb etc", "metacritic": null, "released": "2016-03-10", "tba": false, "updated": "2019-07-29T09:37:01", "background_image": "https://media.rawg.io/media/screenshots/c47/c476d53df6f93f6e304df91220b93830.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 290, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["HGames-ArtWorks", "Martin Hofmann", "HGamesArt"], "genres": ["Action", "Adventure"], "publishers": ["Martin Hofmann", "HGames-ArtWorks"], "esrb_rating": "Teen"}