{"id": 66881, "slug": "pink-piano-tiles-piano-games", "name": "Pink Piano Tiles: Piano Games", "name_original": "Pink Piano Tiles: Piano Games", "description": "Girls favourite color is Pink. so we have develop special piano games for girls.<br/>Pink Piano tap games for girls<br/><br/>Piano tap games is specially for New Years 2017. Free play and enjoy real piano tap games. <br/>The Original, Famous and Wonderful Game-Piano tap!<br/>This is a super fun and highly addictive game suited for everyone.<br/>No special skills needed, all this game asks of you is an attentive mind and fast fingers!<br/>Piano tap is 2017 best and free games.<br/><br/>Piano music and piano songs.<br/><br/>The perfect PIANO tap, new piano music play, not step on the white pieces! Follow the music click on the color, simple operation, rich gameplay! Can compete with a small partner, so you have a perfect music beyond imagination feast!<br/><br/><br/>How To Play:-<br/>Tap on the black tiles while listening to music. Avoid the white ones<br/><br/>Game features:<br/>- multi color piano tap games<br/>- multiple sound collections<br/>- Color Piano tap have 10 levels<br/>- Piano tap game is colorful game<br/>- awesome sound available in piano tap.<br/><br/>Piano tap have most popular 4 levels:-<br/><br/>Classic piano tap : In classic mode you have to tap number of tap in minimum time period as fast as u can tap.<br/><br/>Arcade piano tap : In Arcade mode you have to tap on black tiles (Don't tap withe tiles) without missing any black tiles.<br/><br/>Zen piano tap : For Zen level you have to tap as fast as u can in limited time period.<br/><br/>Bomb piano tap : In Bomb level Don't tap on Bomb and white tiles, you have to identified bomb and forgot it without tap.<br/><br/>pink themes Piano games<br/>pink themes<br/>pink princess games<br/>Pink keybord<br/>Pianotiles2<br/>Pianotiles is best game in 2016<br/>Enjoyed Piano tap : Piano Game - Don't Tap White Tiles with listing heartless music.", "metacritic": null, "released": "2017-02-24", "tba": false, "updated": "2019-07-29T09:14:40", "background_image": "https://media.rawg.io/media/screenshots/573/573bf5868d8fe5116266def883930c6c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 29, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["sohil kadevar"], "genres": ["Board Games"], "publishers": ["sohil kadevar"], "esrb_rating": null}