{"id": 668886, "slug": "us-amdotblacksheep", "name": "US (amdotblacksheep)", "name_original": "US (amdotblacksheep)", "description": "<p>The developer's delirium:</p>\n<p>At the beginning of the Jam, when I conceived this project, I had calculated to devote half a day to the game every day for 7 days (Monday to Sunday). Actually, I was able to dedicate only 3 days to it and therefore many elements have been removed from the initial project (but they will be inserted as soon as possible. These elements are: an interactive tutorial, a random level generation, the SFX, and the background music).</p>\n<p>I am aware of these bugs:</p>\n<ul><li>the bottom turret does not work;</li><li>the AI of the enemies is not the best.</li></ul>\n<p>This game is a submission to Godot Wild Jam #37 (deadline missed) and VimJam 2.</p>\n<p>(Take care of) US is a frenetic strategy space shooter game. You are the captain of a spaceship that has a big problem: the engine has jammed and it is stuck at full power. Only two crew members execute your orders and they need you to manage the four turrets, the direction of the ship, the shield, and the time dilation system. <br/>The space is a very dangerous place these days... Will you be able to rescue your crew?</p>\n<p>How to play:</p>\n<p>Select one of the two upper-left crew members and assign them a task using the bottom right buttons. You can perform all actions with the mouse or with the numpad.</p>\n<p>Credits:</p>\n<ul><li>A game by amdotblacksheep;</li><li>Assets by Deep-Fold,  kenney and amdotblacksheep.</li></ul>", "metacritic": null, "released": "2021-09-20", "tba": false, "updated": "2021-09-24T08:26:21", "background_image": "https://media.rawg.io/media/screenshots/8e5/8e54ae875aff7a8e65a0fe41ab1b0323.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 9, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["amdotblacksheep"], "genres": ["Action", "Shooter", "Strategy"], "publishers": [], "esrb_rating": null}