{"id": 668808, "slug": "clea-2-itch", "name": "Clea 2 (itch)", "name_original": "Clea 2 (itch)", "description": "<p>Four years have passed since the Whitlock Mansion tragedy. Florine, a former maid, is determined to resurrect the person who means everything to her. To succeed, she must travel past the third dimension and into the realms beyond. Otherworldly horrors lie in wait, but Florine is determined to soldier on.</p>\n<p>This, after all, is her final chance at redemption.<br/><br/>* * *</p>\n<p><strong>Skill-focused horror:</strong></p>\n<p>Clea 2 is primarily a test of skills. Enemies roam the halls dynamically in real-time, reacting to the players' every noise. Clea is a challenging title, rewarding those who have mastered its mechanics.<br/><br/></p>\n<p><strong>No jump scares:</strong><br/></p>\n<p>Clea 1 was a jump scare free experience, and the tradition continues here in this sequel.<br/><br/></p>\n<p><strong>Replayability:</strong><br/></p>\n<p>Unlockable costumes/galleries/difficulty modes, multiple endings and even an arcade feature. Plenty of reasons for Florine to revisit her journey.<br/><br/></p>\n<p><strong>Fully voiced:</strong><br/></p>\n<p>Every cutscene is fully voiced. Please enjoy the cast’s performance as we sink deeper into Clea’s lore than ever before.<br/><br/>* * *<br/><br/>Thank you for all your support with Clea throughout 2019. I hope this sequel is everything you have dreamed of and more. Have fun!</p>", "metacritic": null, "released": "2021-09-20", "tba": false, "updated": "2021-09-24T08:01:18", "background_image": "https://media.rawg.io/media/screenshots/212/2126cf6402a01bbef9584bc283cdf8f9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 306, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["InvertMouse"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}