{"id": 66895, "slug": "cookbook-master", "name": "Cookbook Master", "name_original": "Cookbook Master", "description": "Put on you chef apron and get cooking! Master delicious recipes, equip your kitchen with the best cooking gear and make bold culinary experiments like a real gourmet expert!<br/><br/>Fry, cook, bake, glaze and stir incredible food in your path to cuisine glory! Try many delicious recipes and learn how to execute them perfectly to unlock even more exotic dishes from all kinds of cuisines!<br/><br/>HIGHLIGHTS<br/>• COOK with over 40 ingredients and let your gourmet creativity loose! Eggs, cheeses, potatoes, mushrooms, bread, peppers, chocolate, exotic spices and extracts and even fruit!<br/>• LEARN and MASTER more than 30 real-life recipes! Prepare tasty dishes and tempting desserts like Spaghetti alla Bolognese, Garlic Mashed Potatoes, Ceasar Salad, Hamburger, Beef Strogonoff, Stuffed Mushrooms, White Cake, Molten Lava Cake and many others!<br/>• UPGRADE your kitchen with professional equipment that will help you to cook mouth-watering food faster and better!<br/>• PLAY fun cooking minigames to master the culinary arts of breaking eggs, slicing vegetables, stirring and more!<br/>• COMPLETE your cookbook, try and get all-star ratings in every recipe and become an expert chef!<br/><br/>If you need a cooking simulator to get some practice before getting into the kitchen for real of if you just can’t let go of your culinary experiments even when on the go, this game is perfect for you!<br/><br/>Challenge yourself to fill your recipe book and try your hand in executing every single dish perfectly! Prove your friends and even your mom you can handle yourself very well in the kitchen!<br/><br/>Download now, learn the recipes and start cooking like a master!<br/><br/>Disclaimer: While this App is completely free to play, some additional content can be purchased for real money in-game. If you do not want to use this feature, please turn off in-app purchases in your device's settings.<br/><br/>Like our page on Facebook and be the first to know about our upcoming games and updates! http://fb.com/tappshq", "metacritic": null, "released": "2014-10-28", "tba": false, "updated": "2019-10-22T13:59:06", "background_image": "https://media.rawg.io/media/screenshots/5fc/5fcbe9e8fef26740c431dbfbf3e693e8.jpg", "website": "http://tappsgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 52, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tapps Tecnologia da Informação Ltda."], "genres": ["Simulation", "Family"], "publishers": ["Tapps Tecnologia da Informacao LTDA."], "esrb_rating": null}