{"id": 66896, "slug": "cruise-ship-cooking-scramble-2", "name": "Cruise Ship Cooking Scramble 2", "name_original": "Cruise Ship Cooking Scramble 2", "description": "Ultimate restaurant simulation experience &amp; begin your world chef journey to become a super chef with \"Cruise Ship Cooking Scramble\". Cook at a feverish pace in this new restaurant management game weaving memorable kitchen stories as master chefs do. Fun time management game, epic kitchen scramble as you build your Restaurant Empire.<br/> <br/>Download \"Cruise Ship Cooking Scramble 2\", Start your world journey in this new restaurant management game as a rising star chef!<br/><br/>Upon stepping on the cruise ship’s food court; immediately the cooking craziness commences. You serve various character some lovable and others downright annoying. Cruise Ship Cooking Scramble 2 could be the best looking and fastest Cooking game.  But hey, the game has been played &amp; enjoyed by 8+ MILLION customers around the world! AND, by playing this fast food game you help feed hungry kids of Backpack Buddies! Not only are you giving it back to the society but you rightfully earn bragging rights as a super star chef, who built a restaurant empire.<br/> <br/>You are a rising star master chef hired to run different cruise ship restaurants, manage the scramble in the kitchen, make yummy fast food or exotic dishes and serve your vacation customers from around the world as you have carnival FUN AND earn MONEY. This new time-management game will serve you hours of challenging and cruising fun for the whole family, and endless play to master a deliciously addictive restaurant simulation game!<br/> <br/>FEATURES:<br/>• Play 70 different levels of fun restaurant management!<br/>• Feed the world with 7 different restaurants to master the carnival challenge, Super chef!<br/>• Tons of different ingredients &amp; exotic dishes to delight any world chef!<br/>• Earn money to decorate the restaurant. Super chef!<br/>• PLUS PLAY MINI RESTAURANT SIMULATION GAME CHALLENGES!<br/> <br/>There are numerous restaurant cooking simulation games, but few stand out from the crowd. \"Cruise Ship Cooking Scramble 2\" is one such restaurant &amp; time management game in the making. Why wait? The game is FREE. Download Now!<br/><br/>So, you think you have the cooking &amp; time management skills to be a rising star master chef, make your mama proud, and be the super chef of the world? Challenge your time management skills in a fast paced restaurant simulation game!<br/><br/>DOWNLOAD the New restaurant management game Now! Make awesome kitchen story like a master chef, collect golds &amp; gems; grow your restaurant empire and become a restaurant tycoon.<br/><br/>Like us on Facebook!  https://www.facebook.com/Flowmotionentertainment<br/>Follow us on Instagram!  http://www.instagram.com/flowmotion_entertainment  <br/>Watch us on Youtube! https://www.youtube.com/channel/UCCqHMfkyV7F8QTZIS_eN_kA<br/>Hangout with us on Google+!  https://plus.google.com/115747041915102598016/  <br/>Follow us on Twitter!  http://www.twitter.com/flowmotiongames   <br/>Pin us on Pinterest! http://www.pinterest.com/flowmotiongames<br/>Backpack buddies! http://www.backpackbuddies.ca", "metacritic": null, "released": "2016-04-30", "tba": false, "updated": "2019-10-22T14:27:20", "background_image": "https://media.rawg.io/media/screenshots/161/1614552d52c1d70e47d8bec871dc2648.jpg", "website": "http://www.instagram.com/flowmotion_entertainment", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 118, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["FlowMotion Entertainment: Top Free Fun Addictive Cool Games"], "genres": ["RPG", "Family"], "publishers": ["FLOWMOTION ENTERTAINMENT: TOP FREE FUN ADDICTIVE COOL GAMES"], "esrb_rating": "Everyone 10+"}