{"id": 668903, "slug": "escape-the-temple-kitifulnines", "name": "Escape the Temple (kitifulnines)", "name_original": "Escape the Temple (kitifulnines)", "description": "<p>Escape the Temple is a challenging platformer where the goal is to, well, escape the temple!</p>\n<p>You and your boss uncovered an ancient artifact on an archaeology trip, but OH NO! It was a trap! Your boss, knowing he won't be able to make it, hands the artifact to YOU, and orders you to escape while you still can!</p>\n<p>Simple enough, right? WRONG. The temple is slowly filling up with lava, so you gotta keep moving while also avoiding obstacles if you don't wanna become toast! Made with Construct 3 for VimJam2.</p>\n<p>PLEASE NOTE THIS GAME IT MEANT TO BE VERY CHALLENGING!!!!</p>\r\nESTIMATED RUNTIME\r\n<p>This game holds only 3 levels! But don't let the small number fool you. This game is REALLY difficult. I suspect that for experienced players, it'll take 2 minutes max. Average players might take about 5 minutes, while those with low experience... I would suggest maybe not playing altogether???? unless you like difficult games???? I might've gone a bit overboard with the difficulty, so I'm very sorry about that.</p>\r\nCONTROLS\r\n<p>THIS GAME ONLY WORKS WITH A KEYBOARD.</p>\n<p>To move the character, you can press the A/D or Left/Right buttons! To jump, you can press W, Up, or Space!</p>\n<p>At the end of each level, there is a lever. To pull it, press E.</p>\n<p>If you're somehow stuck, you can restart the level by pressing R!</p>\r\nCREDITS\r\n<p>Programming, Art, SoundFX: kitifulnines\r\n</p>\n<p>Music: Purchased from WOW Sound</p>\n<p>Color Palette: Mega Drive Blue by MetaruPX</p>", "metacritic": null, "released": "2021-09-20", "tba": false, "updated": "2021-09-24T08:30:18", "background_image": "https://media.rawg.io/media/screenshots/dcf/dcfcf42fc209fe466fa9690b5b8b0654.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 26, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["kitifulnines"], "genres": ["Adventure", "Platformer"], "publishers": [], "esrb_rating": null}