{"id": 668969, "slug": "knights-of-invasion-foundry-vtt-access", "name": "Knights of Invasion • Foundry VTT Access", "name_original": "Knights of Invasion • Foundry VTT Access", "description": "<p><strong>Your kingdom is on the brink of war.</strong> A tournament has been arranged to celebrate your monarch’s birthday, and envoys from the enemy kingdom will be attending the festivities. As if the situation isn’t stressful enough, strange lights are seen in the sky, and a terrifying alien invasion begins.</p>\n<p>Gather your fellow knights to battle with little green men and fire trebuchets on acid-filled insect creatures. Can the rival kingdoms put aside their problems and work together, or will one side use the chaos of the situation to their own advantage? Find out in this Fate World of Adventure by Richard Bellingham.</p>\n<p><strong>Knights of Invasion.  Follow the code.  Protect your liege.</strong>\n</p>\n<p><em>The Fate Adventures &amp; Worlds line provides compact, rich, affordable, gorgeous settings with a ready-to-go adventure for GMs in a pinch. Buy one this afternoon, be ready to run this evening.</em>\n</p>\r\nModule Features\r\n<ul><li>A setup tool that will fully deploy the content of this module into a world of your choice. This is the way we recommend you use this module, and it works best if you start with a fresh new world. On first load, click the 'Knights of Invasion' thumbnail to commence the setup process, or use the Setup macro listed below.\r\n</li><li>Five <strong>GM characters and associated tokens</strong>,. If you set this world up using our tool you'll find them in an Actor folder called \"Knights of Invasion GM Characters\". Otherwise, they're n the Knights of Invasion Characters compendium. \r\n</li><li>Six <strong>sample player characters and associated tokens.</strong> Found in the \"Knights of Invasion Player Characters and Retainers\" folder or the Characters compendium. \r\n</li><li>Four <strong>sample siege weapons and associated tokens</strong>. Found in the \"Knights of Invasion Siege Weapons\" folder or the Characters compendium.\r\n</li><li>Five <strong>sample extras</strong> you can use to get started on armour and horses for your characters.\r\n</li><li>Predefined <strong>default character frameworks </strong>allowing you to instantly create knights, good retainers, fair retainers, siege weapons, and aliens with the correct tracks, aspects, and skills.\r\n</li><li>62 <strong>tokens</strong> for use as player or GM characters, stored in /art/tokens/ and ready for use via the Foundry file browser.\r\n</li><li>Eight <strong>linked handouts</strong> installed in this world's journal folder or accessed from the Knights of Invasion Journal compendium. They provide the entire contents* of <em>Knights of Invasion</em>, a Fate World first released by Evil Hat Productions as a PDF Contents.\r\n</li><li>One start scene for <strong>basic orientation</strong> and <strong>player character tokens</strong>.\r\n</li><li>One Playmat scene which features some handy rules references and an easily changeable background. \r\n</li><li>One <strong>map </strong>scene displaying the continent of Jorl, where the kingdoms of Regen and Stroming can be found..</li></ul>\r\nFoundry VTT Release\r\n<p>This release is intended for use with the Fate Core Official system for Foundry VTT and requires that users already have a Foundry VTT Software License. \r\n</p>\n<p>Once purchased you'll receive an access key on the Download Page (click the \"Claim Key\" button to reveal it) that can be used to unlock the Foundry Premium Content.\r\n</p>\r\nTo activate a key:\r\n<ol><li>Log-in to the Foundry Virtual Tabletop website\r\n</li><li>Click your username in the upper right corner to access your profile page\r\n</li><li>Click the <strong>Premium Content</strong> Button in the lower left\r\n</li><li>Copy and paste your content key into the <strong>Content Key</strong> field\r\n</li><li>Click the <strong>Activate Content</strong> button\r\n</li></ol>\n<p>Once activated the Content Key is added to your account and no further steps are required. Your premium content will appear in your \"Unlocked Premium Content\" list, showcasing what content you have permission to access via the Premium Content section of the package installer in Foundry Virtual Tabletop.\r\n</p>\r\nTo install premium content:\r\n<ol><li>From the Setup menu within Foundry VTT, select the appropriate tab for your content: Game Worlds, Game Systems, or Add-on Modules.\r\n</li><li>On this tab, click the install button in the bottom left corner.\r\n</li><li>In the installation menu that appears, filter the view by clicking the <strong>Premium Content</strong> category on the left hand side.\r\n</li><li>Locate your Premium Content within the list or use the filter field to search for it and click the <strong>Install</strong> button on the right-hand side.\r\n</li></ol>\n<p>If your content displays \"Not Owned\" instead of an installation button please verify that you have activated the content for your account.\r\n</p>\n<p>More details on accessing Premium Content here.</p>", "metacritic": null, "released": "2021-09-20", "tba": false, "updated": "2021-09-24T08:46:24", "background_image": "https://media.rawg.io/media/screenshots/645/64531a989e53c1c5bb90c3d6f25f3e44.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 264, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["evilhat"], "genres": [], "publishers": [], "esrb_rating": null}