{"id": 66905, "slug": "vlogger-go-viral-tube-star", "name": "Vlogger Go Viral - Tube Star", "name_original": "Vlogger Go Viral - Tube Star", "description": "Get ready to become the next Internet sensation in Vlogger Go Viral, the idle clicker game where every tap takes your channel one step closer to the top. Begin with only a dream in your head and a camera in your hands, and climb your way to stardom. Do you have what it takes?<br/><br/>Produce videos, manage your channel, gain millions of subscribers and views, grow billionaire and upgrade your sweet equipment and studio to reach the skies!<br/><br/>Follow the comments on your channel to discover what’s trending. Produce a video with a trending topic and watch it go viral! Master all the topics on your journey to become rich and famous, all that without ever leaving your bedroom. Okay, maybe just for toilet breaks.<br/><br/>HIGHLIGHTS<br/>• Tons of upgrades for your equipment and home studio<br/>• Lots of topics to choose from: cats, dogs, food, games, music, movies, geek and many more!<br/>• Manage your channel: upvote your fans, downvote your haters (just like in real life)<br/>• Actually watch the videos you make!<br/>• Hats! Yes, you heard it right.<br/><br/>AND LAST BUT NOT LEAST<br/>Pugs with ties, robot parrots, walking pineapples, last-year’s console and comfy armchairs! What else could a world famous vlogger possibly want?<br/><br/>All right, now that’s a wrap! Download Vlogger Go Viral and start filming now!<br/><br/>Disclaimer: While this App is completely free to play, some additional content can be purchased for real money in-game. If you do not want to use this feature, please turn off in-app purchases in your device's settings.<br/><br/>Like our page on Facebook and be the first to know about our upcoming games and updates! http://fb.com/tappshq", "metacritic": null, "released": "2015-11-26", "tba": false, "updated": "2019-07-29T09:19:36", "background_image": "https://media.rawg.io/media/screenshots/b15/b15421ba05e20043fb6ca416c0965f02.jpg", "website": "http://tappsgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 130, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tapps Tecnologia da Informação Ltda."], "genres": ["Strategy", "Simulation"], "publishers": ["Tapps Tecnologia da Informacao LTDA."], "esrb_rating": "Everyone 10+"}