{"id": 669045, "slug": "the-outsider-in-space", "name": "The Outsider In Space", "name_original": "The Outsider In Space", "description": "<p>Credits:</p>\n<p>Basic art and scripts------MSU GEL LAB</p>\n<p>Game and level design , Art design ------YUCHEN ZHANG, MSU,2021</p>\n<p>Significant modifications  beyond the tutorial:</p>\n<p>1. Create a complete interesting, comprehensive, and coherent level.I used almost every methods in the Tutorial to make this game more interesting .</p>\n<p>2. Add multiple additional levels and tie them in to create a logical progression in the game. I designed 3 levels in this game ,following a timeline of the story , In Level 1, the astronaut lands in the planet and leaves the space to explore . In Level 2 , the astronaut explores the outspace creatures's base and escapes from it . In Level 3 , if the astronaut moves towards left and he will find that the space ship has been invaded so the astronaut has to move forward to the deep of the planet . I put two goal pick ups in level3 and I tried to make a branch plot of the story  of different level 4 ,but level 4 has not finished yet because of the due time ,this is my first time using unity so I spent much time exploring the software . The setting of different story lines is just an attempt .</p>\n<p>3. Modify the out-of-game menus in some significant and meaningful way.</p>\n<p>4. Add additional significant and coherent graphical elements to the game, especially in the level 3 , I add some image and animation in the scene ,such as the starry sky,magma and its eruption , the land with grass , the animation of a 'boss' ,for I don't know how to write new scrpits to create a brand new enemy with new actions , I could only put the animation just to  make a sense of tension.</p>", "metacritic": null, "released": "2021-09-20", "tba": false, "updated": "2021-09-24T09:09:16", "background_image": "https://media.rawg.io/media/screenshots/432/432ddc5db428e6f16409324321188b27.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 66, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["zhan1959"], "genres": [], "publishers": [], "esrb_rating": null}