{"id": 669108, "slug": "space-attack-spherous", "name": "Space Attack (spherous)", "name_original": "Space Attack (spherous)", "description": "<p>Created in 10 days for VimJam 2!</p>\n<ul><li>Theme: On the Edge</li><li>Restriction: Boss</li><li>I used 1 Diversifier: <strong>Shapely</strong> - All visuals are basic shapes in solid colors</li></ul>\n<p>Controls\r\n</p>\n<ul><li>WASD - Move\r\n</li><li>Left Click - Shoot\r\n</li><li>Space Bar - Consume Energy Bar</li></ul>\n<p>Volume controls are top right.</p>\n\n<p>Watch out for the blitz clock in the top left! Run out of time and you lose! Killing enemies, destroying rocks, and clearing waves extends the time!</p>\n<p>You will be offered a choice of powerups every few waves!</p>\n<p>If you attack too often, or move too much, you may push your energy bar to the edge! At any time, press <strong>space bar</strong> to consume your energy bar and grant yourself a powerful temporary buff depending on the amount and type of energy consumed!</p>\n<p>Consuming red energy will give you increased offensive capabilities, while reducing nearby enemies' offensive stats.</p>\n<p>Consuming blue energy will grant you a boost of speed while slowing, and even stopping nearby opponents!</p>\n<p>Be careful, red and blue energy oppose each other, thus the buffs granted by one, reduce your capabilities in the other. Meaning red buff slows you down and even stops you, while blue buff makes your attacks less effective.</p>\n<p>Protip: If you activated a full strength red buff and find yourself suddenly locked in place, simply use <strong>space bar</strong> to activate your energy bar again to enable a weaker buff, thus freeing you from the powerful slow!</p>\n\n<p>Can you master energy and beat the clock by defeating the boss on wave 50?</p>\n<p>Leave a comment with your highscore!</p>", "metacritic": null, "released": "2021-09-20", "tba": false, "updated": "2021-09-24T09:24:43", "background_image": "https://media.rawg.io/media/screenshots/b7a/b7aa3e8509086858842f11c3d1c52b38.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 50, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["spherous"], "genres": ["Action"], "publishers": [], "esrb_rating": null}