{"id": 669155, "slug": "stickman-blast-through-platforms", "name": "Stickman - Blast through platforms", "name_original": "Stickman - Blast through platforms", "description": "<p>Stickman- Blast through platforms is a 3d arcade game where players smash, bump and bounce through the colourful stack platforms platforms to reach the end.</p>\n<p>Sound easy? You wish!!<br/>The stickman fights and smashes like a warriour through colorful platforms that block its descent, but if you hit a black one, it's all over!<br/>But even black platforms are no match for a stickman falling at full speed! Choose your strategy: speed up like a madman or stop and wait for your next chance to roll and jump. Other stickman games wish they were this fun!<br/>Let the stickman fall down through the colourful stack platforms. Break the stack with the stickman falling from top, escape from obstacles and guide it to victory. If you hit the black piece of the platform with the ball it will shatter into pieces.<br/><br/>Hold onto the stickman as long as possible to blast through platforms and reach the end of the stack to achieve victory!<br/><br/>How To Play:<br/>- Press and hold to pop the stacks<br/>- Escape from obstacles<br/>- Blast through stack platforms<br/>- Reach the end of the stack for victory<br/><br/>Features:<br/>- Stickman Dances<br/>- Fun and Entertaining Stickman Game<br/>- Colourful stacks<br/>- 1000+ Unique Levels<br/>- Combo Booster<br/>- Time Killer<br/>- Stress Buster<br/>- Relaxing Gameplay<br/>- Crazy fast speed<br/>- Fun gameplay<br/>- Bright vibrant graphics<br/>- Simple and easy to play<br/>- Great time killer<br/><br/>Try out the game and Have Fun...and Enjoy...!<br/>Start playing Stack Pop 3D Game and blast you stress and get some refreshment..!</p>", "metacritic": null, "released": "2021-09-20", "tba": false, "updated": "2021-09-24T09:35:09", "background_image": "https://media.rawg.io/media/screenshots/c35/c356cde75a065a9ee3ca91d495a8c314.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 146, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["blablaalb"], "genres": [], "publishers": [], "esrb_rating": null}