{"id": 669366, "slug": "the-book-of-bondmaids", "name": "The Book of Bondmaids", "name_original": "The Book of Bondmaids", "description": "A Kingdom in ruins, a Princess in chains, a Hero caught between redemption and damnation, and an ancient, worn, dusty Book...<br/><br/>The ruling royal dynasty of Conussia has been overthrown, and an undead Lich now sits on the throne. As a courtier to the previous regime you were partly responsible for the coup, and as such, your services have been retained by the Lich.<br/><br/>As the story unfolds, you learn that there is much more to this occupation than meets the eye, and must choose whether to ally yourself with the Lich and his seductive right-hand woman, with the Resistance to try and undo the damage you have unwittingly done, or to walk the dangerous thin line of the mercenary, loyal to no-one but his friends.<br/><br/>Lastly, of course, is the Princess, who from her prison cell holds a terrible secret that could change everything.<br/><br/>TKS: The Book of Bondmaids is a story-driven visual novel and sequel to Three Kingdoms Story: Conussia. The game features branching narrative paths and multiple endings, plus six erotic short stories written exclusively for TKS: The Book of Bondmaids by Trude Perkins.<br/><br/>TKS: The Book of Bondmaids is strictly 18+ due to mature themes and extremely strong sexual content, including depiction of consensual and non-consensual acts, BDSM, gay/ lesbian sex, graphic descriptions of torture, use of drugs and alcohol, group sex, murder, strong language and swearing, full male and female nudity, and prostitution.", "metacritic": null, "released": "2021-09-23", "tba": false, "updated": "2024-01-31T18:14:06", "background_image": "https://media.rawg.io/media/screenshots/165/165b551d8031e176b370a3b023872f6b.jpg", "website": "https://kamtigames.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 4, "owned": 28, "beaten": 2, "toplay": 6, "dropped": 1}, "playtime": 4, "achievements_count": 21, "ratings_count": 3, "suggestions_count": 369, "game_series_count": 0, "reviews_count": 3, "platforms": ["Linux", "macOS", "PC"], "developers": ["kamti"], "genres": ["Indie"], "publishers": ["kamti"], "esrb_rating": null}