{"id": 669371, "slug": "mystery-box-hidden-secrets", "name": "Mystery Box - Hidden Secrets", "name_original": "Mystery Box - Hidden Secrets", "description": "<strong>Mystery Box</strong> is a puzzle game where you have to solve intriguing riddles to open boxes and get pieces to discover the history of the world's most popular inventions.<br/><br/>To unlock the boxes you have to interact with objects, handles, buttons, and wheels on each side. You can find puzzle pieces on a random side of the boxes as well.<br/><br/>• REALISTIC GRAPHICS<br/>It feels like you're handling a real box in a dark room.<br/><br/>• DISCOVER INVENTIONS<br/>Once you open all 8 boxes of a chosen pack, you'll be able to compose a puzzle and find out a brief history of the discovered invention.<br/><br/>• AMAZING PUZZLES<br/>Think outside of the box to solve all riddles, it's not always an easy job!<br/><br/>• CHILLING BACKGROUND MUSIC<br/>Play the game with your headphones to get totally immersed in it!<br/><br/>• GUARANTEED FUN<br/>Like jack in the box games, or escape room games, Mystery Box will give you hours of fun and will also challenge your brain skills with some good tricky riddles<br/><br/>• VIDEO HINTS<br/>In case you get stuck you can click the bulb button to watch a video that will help you solve puzzles and finish a level<br/><br/>• SHARE INVENTIONS<br/>Get exposed on Twitter by sharing the game after completing an invention image on the Discovery screen. Let your community know what you're playing<br/><br/>• MULTIPLE LANGUAGES<br/>Available in English*, German, French, Italian, Russian, Spanish, and Japanese<br/><br/>*English is the default language so you'll see it if your computer's language is different than the above-listed languages", "metacritic": null, "released": "2021-09-30", "tba": false, "updated": "2024-03-02T06:12:58", "background_image": "https://media.rawg.io/media/screenshots/73c/73cdd103ce75a69e18e40623ff60c32f.jpg", "website": "https://xscoder.com/mysterybox", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 79, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "macOS"], "developers": ["XScoder"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["XScoder"], "esrb_rating": null}