{"id": 669301, "slug": "lair-of-alkarisi", "name": "Lair of Alkarisi", "name_original": "Lair of Alkarisi", "description": "Gameplay\r\n<p>You are a father who is searching for his kidnapped daughter in the lair of Alkarısı, a legendary creature. Your only enemy is not Alkarısı, but also the time. The time you can spend in this other dimension is limited, but you can lengthen the time by collecting pumpkins.<br/></p>\r\nStory\r\n<p>\"Have you ever heard of the myth of Alkarısı? It's not a myth, actually. She is real.\r\n</p>\n<p>A red monster that haunts postpartum women and horses, pursuing their babies.  </p>\n<p>I thought she was just a bogeyman. A fabricated creature to scare us. But on the Halloween night of 1989, I found out that I was wrong. It was when she kidnapped my daughter to her own dimension.</p>\n<p>My mother is a wise woman, she knows lot about these creatures and their dark world. I could pursue Alkarısı to her dimension, but my time would be limited there.</p>\n<p>The pumpkin faces, mom told me they were made to face both of the worlds. The pumpkins could lengthen the time I could spend in the dark world.</p>\n<p>I would go to the lair of Alkarısı in her world. And not come back without my daughter.\"\r\n</p>\r\nCredits\r\n<p>2D Art: Egesu Arpacı</p>\n<p>Programming: Ahmet Kamil Keles</p>\n<p>Music: Ugurcan Orcun (made for Pawn ofthe Dead, before MiniJam89)</p>\n<p>Gate sprite: Sercan Uysal (made for Yerlik, before MiniJam89)<br/></p>", "metacritic": null, "released": "2021-09-20", "tba": false, "updated": "2021-09-24T10:13:13", "background_image": "https://media.rawg.io/media/screenshots/bd5/bd55f6dded62770f4aa9328b50a48474.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 40, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Ahmet Kamil Keleş"], "genres": ["Action"], "publishers": [], "esrb_rating": null}