{"id": 669425, "slug": "exit-the-curse-of-ophir", "name": "EXIT – The Curse of Ophir", "name_original": "EXIT – The Curse of Ophir", "description": "Famous writer Tory Harlane has disappeared without a trace and you've been hired to find him! He was last seen at the Hotel Ophir, deep in the Wichita Mountains of Oklahoma, researching alleged haunted houses. There are many rumors about this remote place: rumors of a supposed city of gold, of unexplained phenomena, and also of a curse. And then there is this eerie comet in the sky, the appearance of which has sent a shiver down your spine – and not only yours. <br/><br/>When you arrive at the Hotel Ophir, you quickly realize that something is not quite right here – and this place literally won't let you go. <br/><br/>Go in search of the missing man, investigate the hotel for clues, discover mysterious relics, solve puzzles and unravel the mysteries of the Ophir that go far back in time. Can you solve the disappearance of Tory Harlene and escape from the hotel?<br/><br/><br/>• Prove yourself in a brand new digital adventure: The award-winning game series \"EXIT® - The Game\" now as an app. <br/>• Escape the curse: Exciting escape room game with an all-new storyline<br/>• Conquer the challenge alone: For a single player<br/>• The adventure awaits you: Exciting mystery puzzle adventure with multi-layered, creative puzzles <br/>• Think beyond the app: Anything can be part of the game!<br/>• Immerse yourself in the mysterious setting: atmospheric soundtrack, voiced texts and hand-drawn background graphics create a suspenseful atmosphere<br/>• Are you ready? Age recommendation 12 +<br/><br/><br/>***** <br/>Questions or suggestions for improvements: <br/>Mail to ios@usm.de <br/>We are looking forward to your feedback! <br/><br/>For more information on news and updates: www.usmgames.com <br/>or visit us on www.facebook.com/UnitedSoftMedia and twitter.com/USM_News <br/><br/>*****", "metacritic": null, "released": "2021-09-22", "tba": false, "updated": "2021-09-27T03:01:24", "background_image": "https://media.rawg.io/media/screenshots/fc0/fc0d2216fcf1c6c94b7aecc4b77ee9c7.jpg", "website": "https://exitgame.app/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 132, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["USM"], "genres": ["Adventure", "Puzzle"], "publishers": ["United Soft Media Verlag"], "esrb_rating": "Teen"}