{"id": 669416, "slug": "love-pies-merge-game", "name": "Love & Pies - Merge Game", "name_original": "Love & Pies - Merge Game", "description": "Can you solve the mystery of the Windmill Cafe?<br/>When someone burns down a family cafe, everyone’s a suspect! Follow the exciting storyline to help Amelia find answers - and maybe even the love of her life. <br/> <br/>Merge cakes, cookies and other yummy treats to serve customers and restore the cafe.<br/> <br/>Once you try Love &amp; Pies you will forget about other merge games — this one will keep you on your toes as you solve delicious mysteries. Play this irresistible merge adventure now!<br/> <br/>A tasty new game full of excitement <br/>Love &amp; Pies is a brand new merge game where you can combine tasty treats to make them even sweeter. Discover something unique, easy to learn and hard to put down. Solve satisfying mysteries as you give Amelia’s cafe a fresh makeover!<br/> <br/>Create delicious treats<br/>Merge cute cakes, cookies and coffee to serve hungry customers! Discover endless new recipes and expand your cafe menu to keep giving your customers new kinds of treats.<br/> <br/>Renovate &amp; design your cafe<br/>Design your dream cafe from scratch and bring it to life! You can choose from a range of fashionable decorations to put your own mark on the place. Every room needs your expert eye. An exciting and amusing merge game that will make you forget about the other home and garden decoration games.<br/> <br/>Endless drama, love and scandals<br/>Uncover juicy secrets in every room as Amelia solves mysteries in her family cafe. In a story full of twists and turns, you’ll meet flirty strangers, sexy exes, nasty rivals, eccentric relatives, adorable pets and friendly customers. <br/> <br/>If you like merge games then Love &amp; Pies is just for you. Merge tasty treats and serve customers to solve the delicious drama and discover Amelia’s love story. On top of this, you will be able to design your dream cafe!<br/> <br/>In Love &amp; Pies you’ll: <br/> • MERGE sweet ingredients to make cakes, pies and other treats<br/> • RELAX as you play a fun and interactive merge game<br/> • DISCOVER new secrets to the story and new plot twists<br/> • SOLVE the mysteries of the old cafe<br/> • MAKEOVER the old rooms and garden with fresh new design", "metacritic": null, "released": "2021-09-21", "tba": false, "updated": "2021-09-27T02:55:20", "background_image": "https://media.rawg.io/media/screenshots/715/71561385d76db314fdb22b04d4dc75af_U0LF5xQ.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 190, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Trailmix"], "genres": ["Casual", "Puzzle"], "publishers": ["Trailmix"], "esrb_rating": "Everyone 10+"}