{"id": 669420, "slug": "the-lord-of-the-rings-war", "name": "The Lord of the Rings: War", "name_original": "The Lord of the Rings: War", "description": "Epic tales of old, be it of love, friendship, or glory, are in days bygone. A new War of the Ring is on the horizon, and the fate of Middle-earth now falls into your hands. An irrepressible dark power has been growing and seeping through every inch of Middle-earth. From Minas Tirith to Mount Doom, each faction is desperate to seize control over the One Ring and take dominion over Middle-earth once and for all.<br/><br/>One Ring to Rule Them All.<br/><br/>The War of the Ring has reignited!<br/><br/>- Live Your War of the Ring<br/>The One Ring has resurfaced in the deserted castle of Dol Guldur. It bestows unrivaled power to dominate Middle-earth on its bearer, luring peoples from all factions into a great war.<br/>- Build A Fortified Settlement<br/>Your settlement infrastructure dictates the efficacy of your strategies. Each building functions uniquely, and your power grows with the development of your settlement. <br/>- Assemble Formidable Armies<br/>From spearmen, archers, and knights to marvellous creatures and dreadful beasts—all forces must be mustered before the battle is waged. Victory will be yours if your strategy is sound and your forces are mighty.   <br/>- Form Your Fellowship<br/>As a Steward of Middle-earth, you must step into a vast world and take control by developing your settlement, expanding your territory and founding your own Fellowship. Grand challenges await.<br/>- Expand Factional Territories<br/>Throughout the season, your power enhances by building expeditionary forces, expanding land tiles, collecting valuable resources, and repelling the enemies. The experience and strength you gained during your conquest would help you get through any unexpected obstacles.  <br/>- Explore Middle-earth’s Wonders<br/>From the lofty majesty of Minas Tirith to the brutish terror of Barad-dûr, experience a re-creation of Middle-earth that places you on the ground in the expansive world created by J.R.R. Tolkien.<br/><br/>Facebook Fan-page:<br/>https://www.facebook.com/gaming/lotrrisetowar<br/>Discord Community:<br/>https://discord.gg/Na7rGAJM6a<br/>YouTube Channel:<br/>https://www.youtube.com/channel/UCkV855DPObfN8wtGedYJ33Q/videos", "metacritic": null, "released": "2021-09-22", "tba": false, "updated": "2021-09-27T02:58:50", "background_image": "https://media.rawg.io/media/screenshots/f4f/f4f1d79ee6a4d58ddc948aff9d4b5980_q0wzHTV.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 332, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["NETEASE INTERACTIVE ENTERTAINMENT PTE"], "genres": ["Strategy", "Simulation"], "publishers": ["Netease"], "esrb_rating": "Teen"}