{"id": 669538, "slug": "mysteries-of-clarks-magic-academy", "name": "Mysteries of Clarks Magic Academy", "name_original": "Mysteries of Clarks Magic Academy", "description": "<p>You are finishing your second year student at Clarks Magic Academy when students start disappearing. No one knows what is going on, but a similar event happened 50 years ago. </p>\n<p>You will need to explore dungeons to rescue students, but also - keep up your grades, go to class, hang out at school clubs, and learn more about your friends. </p>\n<p>This project was inspired by the Persona series and Harry Potter games and was able to come to life by HomeTeam Game Dev.</p>\n\n<p>Developed June 6 to Sept 26, 2021 - </p>\n<p><strong>Cassidy Noble: </strong></p>\n<p>Project lead, core gameplay, JRPG battle/spells/leveling system and related authoring, most character (student, professor, and monster) models and animations unless otherwise credited, non-procgen environment layouts, UI functionality, friendship and lectures/exams writing and systems, character party change feature, minibosses and bosses, many bug fixes, main writing except where noted below, passage of time calendar and related systems (club, friendships, and sleep), scene transitions, various decoration models in the castle and dungeons, hallway students, stat tuning, save and load, locked door descriptors, fail state handling, progress locks, dungeon cutscenes and theming</p>\n<p><strong>Michael \"Misha\" Fewkes: </strong></p>\n<p>Procedural generation of all dungeons (hospital, city, boat, clouds, courthouse, and forest), including treasure, enemy, exit, and advancement portal placement, all music (including exploration, every battle song, dungeons, friendships, and all other scenes), FMOD integration and related audio functionality (transitions), assorted bug fixes, portal spawning</p>\n<p>\n</p>\n<p><strong>Tyler Funk: </strong></p>\n<p>Wendigo model and related animations, skull biker (model, animations, implementation), system-wide font replacement, occlusion data, fixes to z fighting, tile and floor patterns, static environment optimization, worldspace shader adjustment with related environment material assignments, improved the moon, door script interaction fix, staircase lights, second floor lighting touchup</p>\n<p>\n</p>\n<p><strong>Christer \"McFunkypants\" Kaitila: </strong></p>\n<p>Randomized bookshelf, worldspace shader with rock/wood materials, gothic pillar wall, chalkboard, fluffy cloud effect, Harper's Cloud Castle area, magical pause buttons, chandelier, public domain paintings integration, house logos integration touch up, star and cloud skybox, lighting and related material adjustments for baking in majority of scenes, stone door arch, UV mapping of assorted meshes for lighting, title screen background scene, title menu improvements, optimizations, floor torches, font selection, dungeon tutorial system</p>\n<p>\n</p>\n<p><strong>Luis Montaña: </strong></p>\n<p>Item and battle inventory implementation, store functionality, chest functionality, chest reward notification, recovery items for magic and health, inventory bug fix, pause menu</p>\n<p>\n</p>\n<p><strong>Ian Cherabier:</strong></p>\n<p> Friendship related scene animations, props, and implementation of Rhys, Harper, and Jameel</p>\n<p>\n</p>\n<p><strong>Rob Tunstall: </strong></p>\n<p>Sounds (Takuhe, Chupacabra, Menuhene, Chessie, Bigfoot, Jackalope, Loveland Frog, Pukwudgie, Van Meter and Salem Witches) and related implementation</p>\n<p>\n</p>\n<p><strong>Stebs: </strong></p>\n<p>Name entry screen improvements, improved debug functionality, controls menu, tips for tutorial, playtesting notes, stone step integration, UI click sound hookup, door audio, classroom dialog voice (wah wahs), wand sound</p>\n<p>\n</p>\n<p><strong>H Trayford: </strong></p>\n<p>Models (picnic table, basic and fancy stairs, chair decoration, altar, additional fountain, candelabra)</p>\n<p><strong>Brian Nielsen: </strong></p>\n<p>Cauldron smoke effects, title screen, timeline fade, button animations</p>\n<p><strong>Gabriel Cornish: </strong></p>\n<p>Classroom and treasure chest for Charms class, tower for outside castle</p>\n<p>\n</p>\n<p><strong>Batu Aytemiz:</strong></p>\n<p> Navmesh movement system</p>\n<p><strong>Trenton Pegeas:</strong></p>\n<p> Rain effects, hospital models</p>\n<p><strong>Jeremiah Franczyk: </strong></p>\n<p>Lyle and Specter Dialogue, Skye Dialog Tree</p>\n<p><strong>isogramc: </strong></p>\n<p>House logos</p>\n<p><strong>Muhammed \"EyeForcz\" Durmusoglu: </strong></p>\n<p>Fountain model</p>\n<p><strong>Chris DeLeon: </strong></p>\n<p>Project support meetings, Credits compilation.</p>\n\n<p>Thank you everyone! We could not have pulled this off without you!</p>", "metacritic": null, "released": "2021-09-26", "tba": false, "updated": "2021-09-27T03:30:27", "background_image": "https://media.rawg.io/media/screenshots/7ab/7ab15b76cefc11fcbaca59cb910108fb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 250, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["ChaoticPlay"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}