{"id": 669637, "slug": "the-key-is-the-moon", "name": "The Key is the Moon", "name_original": "The Key is the Moon", "description": "THE KEY IS THE MOON\r\n<p><strong>O USO DE PAPEL E LÁPIS É FORTEMENTE RECOMENDADO!</strong></p>\r\nCONTROLES\r\n<p>Clique com o botão esquerdo do mouse nas passagens para mover entre salas e nos cristais para ativá-los.<br/></p>\r\nO JOGO\r\n<p><strong>The Key is the Moon</strong> é um puzzle coop para 2 jogadores em um labirinto. Para poderem escapar, ambos os jogadores precisarão depender das informações do outro para prosseguir - não apenas para descobrir o layout do mapa, como também para deduzir como o jogo funciona.</p>\r\nA  JAM\r\n<p>Este jogo foi desenvolvido para a Crossover Jam, uma parceria entre as entidades Fellowship of the Game, GAMUX, Ufscar Gamedev e USP GameDev. Para o desenvolvimento, três restrições foram aderidas:<br/>-Usar apenas 2 botões (do teclado, mouse ou gamepad)<br/>-Não ter texto escrito na narrativa<br/>-Não incluir criaturas humanóides<br/></p>\n<p>Além disso, vários achievements também foram alcançados durante o desenvolvimento:<br/>-Uma pessoa de outro gamedev<br/>-Faça um jogo multiplayer<br/>-Não usar teclado para movimentação<br/>-Incluir mecânica de teleporte<br/>-O jogo pode ser vencido em qualquer ordem de eventos<br/></p>\r\nCRÉDITOS\r\n<p>Danilo Isamu (MisterProject) - Programação, Level Design e Arte<br/>Felipe Pacheco Manoel (MrColorHD) - Programação, Arte<br/>Nostress767 - Arte<br/></p>", "metacritic": null, "released": "2021-09-26", "tba": false, "updated": "2021-09-27T03:54:03", "background_image": "https://media.rawg.io/media/screenshots/5d0/5d027d8295d876b89e371439028b4905.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 39, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux", "Web"], "developers": ["MisterProject", "MrColorHD"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}