{"id": 66976, "slug": "wrestling-revolution-hd", "name": "Wrestling Revolution HD", "name_original": "Wrestling Revolution HD", "description": "Get an even better view of the action with this special high-resolution version for tablets! Change the button size to suit you, or go entirely touch-screen as you tap, pinch and swipe for intuitive control.<br/><br/>For the first time in 2D, you can start your career either side of the curtain - with wrestling and booking modes now available in one epic game! Create your own star and embark on an endless career full of possibilities, as you attempt to make all the right moves backstage as well as in the ring. Lose yourself in a gigantic universe of 400 wrestlers spread across 9 different promotions - and as many of them in the ring as your device can handle!<br/><br/>When you want to get serious, upgrade to \"Pro\" status to enjoy each career mode at its best - starting with anyone, anywhere. You can also make the world your own by saving your changes to all characters and pitting them against each other in \"Exhibitions\" where YOU make the rules!<br/><br/>BUTTON CONTROLS<br/>Please play through the tutorial for full instructions.<br/>A = Attack (with a direction to aim high, without to aim low)<br/>G = Grapple / Throw object<br/>R = Run<br/>P = Pick up / Drop (with a direction to throw)<br/>T = Taunt / Pin / Referee duties<br/>* To set fire to a handheld weapon, press the R and P buttons simultaneously next to one on the ground. This torch can then be used to set fire to a larger item using the same command.<br/><br/>TOUCH CONTROLS<br/>- TOUCH anywhere in the arena to walk towards it.<br/>- SWIPE to run or trigger moves.<br/>- TAP your opponent to attack that part of their body.<br/>- PINCH to grab or pick-up.<br/>- PART your fingers to taunt, pin, or cancel an action.<br/>- Touch the clock to PAUSE the game, and then the arrow to EXIT.<br/><br/>MENU CONTROLS<br/>- Touch either side of a value or box to browse its contents left or right.<br/>- When selecting characters, touching their slot once will display their stats and touching again will proceed to access them. Touch the company logo to choose a different roster.<br/>- Hold your finger over a character slot to move it and switch with another. Move it to the company logo to switch rosters.<br/>- At the calendar screen, touch any date to view its contents. Touch your character to edit them, touch their stats for training, touch the company logo to view the whole roster, touch the match title to see an exact description of the rules.<br/>- When setting up an exhibition, touch a character to replace them and touch the match title to change the rules. From that screen, touch the table icon to add weapons and touch the ring icon to edit the arena.<br/>- Touch any speech bubbles to speed up conversations. Touch any other static screen to proceed as soon as possible.", "metacritic": null, "released": "2013-01-14", "tba": false, "updated": "2019-07-29T10:36:06", "background_image": "https://media.rawg.io/media/screenshots/6fa/6fa980bbc82602b69294f6bb0f48b7f4_ayaW5w9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 256, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["MDickie"], "genres": ["Simulation", "Sports"], "publishers": ["MDickie"], "esrb_rating": null}