{"id": 6699, "slug": "1-bit-hero", "name": "1-Bit Hero", "name_original": "1-Bit Hero", "description": "Retro junkies, platform fanatics and game enthusiasts in general, rejoice!<br/>In 1-Bit Hero, you take the role of an unnamed hero who can&amp;#39;t stand still. Featuring unique gameplay mechanics and graphics that are about as retro as it gets.<br/><br/>- Time.com: &amp;quot;Give 1-Bit Hero a shot - it takes a lot of courage to go back to square one and put out a game that evokes an entire lost generation of entertainment.&amp;quot;<br/>- toucharcade.com : &amp;quot;Mobile-friendly gameplay and great balance of challenge and playability.&amp;quot;<br/>- indiegamemag.com : &amp;quot;Featuring a pumping chiptune soundtrack and classic, platform gameplay with unique twists, 1-Bit Hero is bound to make the retro gamer rejoice and give newcomers a new taste of olden day gaming greatness.&amp;quot;<br/>- appadvice.com : &amp;quot;The visuals take me back to my childhood, the chiptunes bring a smile to my face, and the controls are fantastic for a platformer.&amp;quot;<br/><br/>Features :<br/>- Extremely retro graphics<br/>- Platform gameplay with a unique twist<br/>- Journey through 20 brutally unpredictable levels<br/>- Awesome chiptunes soundtrack<br/>- Universal App; play on both iPhone and iPad<br/>- Game Center Leaderboards &amp;amp; Achievements<br/>- Social network sharing: Share to Facebook &amp;amp; Twitter<br/>- Record and share game replay<br/><br/>How to play :<br/>- Tap left to make the hero turn around<br/>- Tap right to make the hero jump<br/>- Don&amp;#39;t die<br/><br/>Owned and published by Macrobean Entertainment Inc. Developed in collaboration with Mudloop.", "metacritic": null, "released": "2014-11-05", "tba": false, "updated": "2019-10-22T13:57:30", "background_image": "https://media.rawg.io/media/screenshots/f32/f3280b15c797f69187309538d6c6ef20.jpeg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 55, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Macrobean Entertainment"], "genres": ["Action", "Adventure"], "publishers": ["Macrobean Entertainment"], "esrb_rating": "Everyone 10+"}