{"id": 6700, "slug": "the-sleeping-prince-royal-edition", "name": "The Sleeping Prince: Royal Edition", "name_original": "The Sleeping Prince: Royal Edition", "description": "***FLASH SALE - 50% OFF FOR LIMITED TIME***<br/><br/>He’s a strong and heroic prince, out to rescue the people of Cloudreach from an evil spell. The only problem is…he’s sound asleep. Unleash the magic in your fingers to drag and toss the Sleeping Prince through a series of challenging and entertaining physics-based puzzles – reverse the spell and save the princess!<br/><br/>The malevolent Sydney Slime has cast a mysterious spell on the kingdom, turning it into a dormant dreamland where everyone is sound asleep. The only one who can rescue Princess Leona is our hero, Prince Perilous – but he is also under this sleepy spell. <br/><br/>You’re the only one that can help! Use your magic to throw, flick, and toss the Sleeping Prince through the castle, towers, gardens, and rooftops to rescue the Princess and save your kingdom!<br/><br/>-- SHINE AND RISE! --<br/>Drag the ragdoll Sleeping Prince through over 40 increasingly challenging levels. Master your flinging skills and plan your moves carefully so you don’t run out of Magic!<br/><br/>-- SHAKE A LEG --<br/>Throw the Prince around to explore the castle, attack dangerous enemies, avoid deadly traps, and solve ingenious puzzles with smooth and intuitive physics-based gameplay.<br/><br/>-- CATCH SOME ZZZ’S --<br/>Find and collect Gems, Stars and Z Coins in each level. The more you collect and the faster you do it will allow you to earn medals to unlock more levels! Check out Pluskin’s Shop for items and upgrades to assist you during your adventure. <br/><br/>-- POWER NAP --<br/>Rely on the King, Queen, Knight, and Wizard Plushkin’s special powers to reach new heights and discover secret areas.<br/><br/><br/>Please Note: A network connection is required to play. <br/><br/>The Sleeping Prince is compatible with the iPhone 4S or newer, iPad 2 or newer, and iPad mini. For an optimal experience, we recommend playing The Sleeping Prince while awake.<br/><br/>Questions or feedback? support@thesleepingprince.com", "metacritic": null, "released": "2014-09-04", "tba": false, "updated": "2019-10-22T14:28:22", "background_image": "https://media.rawg.io/media/screenshots/87f/87fa82b8b01502f720b234a81cc90faf.jpg", "website": "http://www.thesleepingprince.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 486, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["Signal Mobile"], "genres": ["Adventure", "Puzzle"], "publishers": ["Signal Mobile"], "esrb_rating": "Everyone 10+"}