{"id": 67015, "slug": "logic-pic-nonogram-puzzles", "name": "Logic Pic - Nonogram Puzzles", "name_original": "Logic Pic - Nonogram Puzzles", "description": "Solve endless logic puzzles and get a bit smarter every day while having fun!<br/><br/>Sharpen your mind anywhere, anytime with easy to learn, hard to master nonogram puzzles (a.k.a. Picross, Griddler, Picture Cross), all while discovering awesome pixel art illustrations!<br/><br/>Have your wits always one step ahead!<br/><br/>HOW TO PLAY<br/>If you’re already familiar with grid puzzles, you’ll quickly get the hang of nonograms.<br/>You only need to follow two steps to get started:<br/><br/>1-Look at the numbers at the ends the rows and columns;<br/>2-Use logic to fill the blocks and discover the hidden picture!<br/><br/>Our quick in-game tutorial will have you solving picture cross puzzles like a genius in no time!<br/><br/>FEATURES<br/>•SOLVE countless brain-teasing, easy-to-expert nonogram puzzles!<br/>•BEAT a challenge every day with the Daily Levels feature!<br/>•USE logic to color the blocks on the grids and reveal the pictures hidden underneath them. The simple and fun picross gameplay you know and love! <br/>•ENJOY hours upon hours of picross picture logic puzzles with varying difficulty: lots of fun for all ages and skill levels!<br/>•NO WI-FI NEEDED: play the game offline at any time!<br/>•DISCOVER beautiful pixel art pictures from different thematic sets in the biggest selection of picture cross puzzle categories yet! Puzzle Packs include famous landmarks, animals, everyday objects and movies<br/>•SHOW OFF how smart you are by solving nonograms with record speed in front of your friends or that special someone you wish to impress!<br/>•AUTO-SAVE feature lets you resume your picross puzzle solving from where you left!<br/><br/>Complete fun thematic puzzle sets and power-up your problem solving skills without even noticing it! <br/><br/>Download now and start boosting the power of your brain!<br/><br/>LOGIC PIC SUBSCRIPTION<br/>- You can subscribe for new content updates (every day, new levels will be available for playing)<br/>- Subscriptions are from $1.99 USD weekly, $4.99 USD monthly and $29.99 USD annually*<br/>- Payment will be charged to iTunes Account at confirmation of purchase<br/>- You will be able to access all available packs for the duration of the subscription<br/>- Subscription automatically renews for the same price and duration period as the original \"weekly\"/\"monthly\"/\"yearly\" package unless auto-renew is turned off at least 24-hours before the end of the current period<br/>- Account will be charged for renewal within 24-hours prior to the end of the current period at the cost of the chosen package (weekly, monthly or yearly package)<br/>- Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's iTunes Account Settings after purchase<br/>- No cancellation of the current subscription is allowed during active subscription period<br/>- You may cancel a subscription during its free trial period via the subscription setting through your iTunes account. This must be done 24 hours before the end of the subscription period to avoid being charged. Please visit http://support.apple.com/kb/ht4098 for more information<br/>- You may turn off the auto-renewal of your subscription via your iTunes Account Settings. However, you are not able to cancel the current subscription during its active period<br/>- Any unused portion of a free-trial period, will be forfeited when the user purchases a subscription<br/><br/>Links to our Terms of Service and Privacy Policy can be found below:<br/>Privacy Policy: http://pp.tappsgames.com/?app=br.com.tapps.logicpic<br/>Terms of Use: http://tos.tappsgames.com/?app=br.com.tapps.logicpic<br/><br/>* Prices are equal to the value that \"Apple's App Store Pricing Matrix\" determines as the equivalent of the subscription price in $ USD.<br/><br/>Disclaimer: While this App is completely free to play, some additional content can be purchased for real money in-game. If you do not want to use this feature, please turn off in-app purchases in your device's settings.<br/><br/>Like our page on Facebook and be the first to know about our upcoming games and updates! http://fb.com/tappshq", "metacritic": null, "released": "2014-05-20", "tba": false, "updated": "2019-10-22T13:59:06", "background_image": "https://media.rawg.io/media/screenshots/5aa/5aa5eba6d05c5ad811212fa2f3802b68_WWs3MtC.jpg", "website": "http://tappsgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 124, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tapps Tecnologia da Informação Ltda."], "genres": ["Board Games"], "publishers": ["Tapps Tecnologia da Informacao LTDA."], "esrb_rating": null}