{"id": 670113, "slug": "mille-bornext-zx-spectrum-next", "name": "Mille Bornext (ZX Spectrum Next)", "name_original": "Mille Bornext (ZX Spectrum Next)", "description": "<p>In this card game, you are in a 1000 milles road race against your ZX Next CPU. Try to be the fist player reaching exactly 1000 milles.<br/></p>\n<p>There are several types of cards: </p>\n<ul><li>Accident</li><li>Repair</li><li>Distance</li><li>Ace cards</li></ul>\n<p>Each accident card is fixed by a repair. The target distance is reached by playing distance cards.</p>\n<p>In the turn, each player may use a card:</p>\n<ul><li>Green semaphore, if the red semaphore is active ans there isn't accident cards.</li></ul>\n<ul><li>Distance card, if green semaphore is on. If there is speed limitation in player area, only 25 and 50 distance cards can be played.</li></ul>\n<p> You can't use more than two 200 milles card. The distance card you use, can't exceed the 1000 milles top.</p>\n<ul><li>Repair card, if an accident type flat tire, out of gas or collision occurs, you can fix it with the correct repair card: spare type, gas tank and collision repair.</li></ul>\n<p> If a speed limit is set, ypu can remove it with a end of limit card.</p>\n<p> You must repair any accident card before you can roll again with the green semaphore.  </p>\n<ul><li>Accident card, if the opponent's accident zone is empty, you can use one accident card (flat tire, out of gas or collision). You can use a speed limit card, even </li></ul>\n<p> if an accident card is in the opponent's zone. You can't use an accident card if the opponent has an Ace card that protects against it.</p>\n<p>Aces card, you can use them to protect again certain accidents types:</p>\n<p>   Ace driver: protects against out of fuel, flat tire and collision cards </p>\n<ul><li>   Ace fuel: protects against out of fuel card</li><li>   Ace wheel: protects against flat tire card</li><li>   Ace priority: red semaphore and speed limit cards</li></ul>\n<p>If you repair and accident (out of fuel, flat tire or collision) you need play a green semaphore card in order to roll again except if you have the Ace priority card that enables the green semaphore as soon as the reparation is done.</p>\n<p>You can voluntarily or if you can't play any card in your turn, discard on card of the hand.</p>\n<p>Keys:</p>\n<ul><li>Q or Left cursor-left </li><li>W or Right curdor-right</li><li>P or Space-play card  </li><li>D or X -discart card</li><li>N - returns to menu</li></ul>\n<p><strong>This game was done using:</strong>\n</p>\n<p>ZX Basic compiler (https://www.boriel.com/ by José Rodríguez Boriel)\r\n</p>\n<p>NextBuild (http://zxbasic.uk/nextbuild/ by David Saphier)</p>\n<p>Shiru's BeepFX engine and sounds (https://shiru.untergrund.net/software.shtml)\r\n</p>\n<p><strong><em>Thanks to Duefectu, Alessandro Grussu and Arnau Jess for his help.</em></strong>\n</p>\n<p>Game coded by Oscar BraindeaD in august-september 2021</p>", "metacritic": null, "released": "2021-09-25", "tba": false, "updated": "2021-09-27T05:50:17", "background_image": "https://media.rawg.io/media/screenshots/da8/da8b320cdcd507ee057df25872483cbd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 84, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["OscarBraindeaD"], "genres": [], "publishers": [], "esrb_rating": null}