{"id": 670308, "slug": "rufaru-the-seller", "name": "Rufaru The Seller", "name_original": "Rufaru The Seller", "description": "<p>A score-based RPG that lets you get absorbed in the gameplay of resource management</p>\n<p>Creator</p>\n<p>Kobayashi-sensei</p>\n<p>Introduction</p>\n<p> You can start the game by executing \"Game.exe\".</p>\n<p>Play time :30 minutes to 1 hour</p>\n<p>------------------------------</p>\n<p>1.1 Game description 1.1</p>\n<p>As the title suggests, this game is a game of Wolfar, where your possessions are scored. How much money can you earn?</p>\n<p>In this game, you have to talk to your uncle to draw lots. You can get items and learn new tricks, but you will lose your vouchers.</p>\n<p>The key to success is to think carefully about how to use the vouchers.</p>\n<p>The 13th Wolf RPG Editor Contest</p>\n<p>[Introduction</p>\n<p>The main character is Ulfar, a guide in Udita... It's a well-balanced RPG with a tricky storyline, and you can either earn money by selling the vouchers you get from winning the isolated island arena, or you can gamble by drawing lots.</p>\n<p>It's hard to choose a squad. The battle screens and enemy graphics are common, but it would be a shame to dismiss the game for that reason. The content is short and plays on gameplay, so if you like that kind of thing, go for it. It's highly addictive. The scores of the top rankers show how addictive it is.</p>\n<p>The full voice of the author may not be to everyone's taste. With all due respect, I think the cheesiness of the game makes you laugh, and is a refreshing change from resource management games that tend to be bleak. However, if you really don't like it, you can set the SE volume to zero in the system settings.</p>\n<p>(*The above introduction is taken from Salt's note.</p>\n<p>(*The above introduction is from Salt's note.</p>\n<p>This is an unlikely game. I like this kind of game. It's quick and easy to play, but also tense. The first island has a free save and a tutorial, so it's easy to get into. It's a unique system, and at first you don't know if you should sell your vouchers or which ones to buy, so it's nice to be able to try different things while you're save free.</p>\n<p>I'm tempted to be stingy when it comes to paying for saves, so I'll settle for saving once every two or three battles, but this was just the right amount of thrill for me. And the enemies are pretty strong! I had to throw away my idea of having enough money early on and use it all up to win! Of course, depending on the results of the raffle, you might be able to have some leeway, but even if you sold your vouchers steadily, you could just barely win. Of course, depending on the results of the raffle, you can get a bit of leeway, but even with a steady stream of vouchers to sell, you can just about win.</p>\n<p>Some impressions</p>\n<p>My impression is that this is a resource management type RPG.</p>\n<p>In the early versions of the game, there was not much of a lottery.</p>\n<p>In the early versions of the game, the raffle was not very useful.</p>\n<p>However, with the new version, you can get more effective items, which makes it more fun to play.</p>\n<p>There is also a ranking element, and if you are aiming for a high score, you can play enthusiastically and it will be very challenging.</p>\n<p>Personally, I've been playing it a lot in order to achieve a higher ranking, but I also felt that the game was well-designed in a way that you can't see.</p>\n<p>The game is characterized by the randomness of a lottery game like the recent gacha games.</p>\n<p>At the end of the game, you'll be fighting a series of strong enemies that at first glance may seem impossible.</p>\n<p>The game has a lot of randomness, just like a lottery game.</p>\n<p>It's a game that seems to be falling apart, but it's balanced just in the nick of time, which gives it a strange sense of style.</p>\n<p>[8/15]ver.2.50 update contents</p>\n<p>Implemented the lottery table from the menu.</p>\n<p>Changed some skills and conditions.</p>\n<p>[8/12]ver.2.40 update contents</p>\n<p>Changed skills and enemy behavior.</p>\n<p>[8/4]ver.2.30 Updated</p>\n<p>Fixed the equipment of counter.</p>\n<p>Added SP consumption to the skill.</p>\n<p>[8/1]ver.2.20 Updated</p>\n<p>Fixed some equipment, fixed some dialogues.</p>\n<p>[7/21]ver.2.10 Updated</p>\n<p>Adjusted abilities of Ulfar and enemies.</p>\n<p>[7/19]ver.2.00 Updated</p>\n<p>Implemented voice.</p>\n<p>Fixed battle balance and other issues.</p>\n<p>Changed the option to cancel the sign.</p>\n<p>Online ranking has been implemented.</p>\n<p>\"Information to be sent</p>\n<p>Ulfar Possession Score</p>\n<p>\"Purpose of handling.</p>\n<p>Possession score ranking posted</p>\n<p>===================================</p>\n<p>I'd love to hear about this game.</p>\n<p>You don't have to contact me, but if you do</p>\n<p>You don't have to contact me, but if you do, I'll be happy to watch.</p>\n<p>リソース管理の駆け引きに熱中できるスコアタRPG</p>\n<p>■制作者■</p>\n<p>小林先生</p>\n<p>■はじめに■</p>\n<p> 「Game.exe」を実行すると、ゲームを開始することができます。</p>\n<p>プレイ時間 :３０分〜１時間</p>\n<p>――――――――――――――――――――――――――――――</p>\n<p>一一ゲーム説明一一</p>\n<p>このゲームはタイトルの通り所持金が点数になるウルファールのゲームです。君はいくら稼げるか…</p>\n<p>くじ引きおじさんに話し掛けるとくじ引きができます。アイテムがもらえたり、新しく技を覚えたりしますが、引換券を失います。</p>\n<p>引換券をどのように使うのか良く考えるのが攻略の鍵です。</p>\n<p>第１３回WolfRPGエディターコンテスト 出品作品</p>\n<p>【紹介】</p>\n<p>ウディタの案内人ウルファールが主人公のバカゲー...と見せかけて中身はトリッキーながらバランスの取れたRPG。孤島闘技場で勝ち抜いて得られる「引換券」を売って堅実に稼ぐか、くじ引きで賭けに出るか。</p>\n<p>スクショを選ぶのが難しい。戦闘画面や敵グラフィックはよく見かけるものなのですが、それを理由に敬遠するのはもったいないです。短編かつゲーム性で勝負する内容なので、そういうのが好きな方は是非。熱中度が高いです。上位ランカーのスコアが中毒性を物語っています。</p>\n<p>たぶん作者さん自身の裏声によるフルボイスは好みがわかれるかもしれません。失礼ながら、このチープさが笑いを誘い、殺伐としがちなリソース管理ゲーの清涼剤になっていると思います。ただ、どうしても苦手ならシステム設定からSEの音量をゼロにすればOKです。</p>\n<p>（※上記の紹介文はソルトさんのnoteより引用）</p>\n<p>【感想】</p>\n<p>ありそうでないゲーム。こういうの好きです。さくっとお手軽に遊べつつ、緊張感もある。最初の島ではセーブ自由でチュートリアルをしてくれたり、入り込みやすい作りなのもよかった。独特のシステムで、最初は引換券を売るべきなのかとか、どれを購入するべきなのか、という感覚が全然わからないので、セーブ自由なうちに色々試せるのが嬉しい。</p>\n<p>セーブが有料になるとケチりたくなるので、2～3戦に1回のセーブに落ち着くんだけど、これはちょうどいいドキドキ感だった。で、敵が結構強い！ 資金に余裕を持たせようという考えは早めに捨てて、きっちり使い切って勝ちに行く必要のある歯ごたえだった！ もちろん、くじ引きの結果次第では余裕ができるんだろうけど、堅実に引換券の売却をしてもギリギリ勝ち進めるくらい。初期に強力な攻撃魔法ジャッジメントを引いて小躍りしたり、後半の敵の火力で絶望したりと、苦戦しながらも運と工夫でなんとかなるバランスだった。</p>\n<p>■一部感想■</p>\n<p>リソース管理型RPGという印象。</p>\n<p>お金を稼いでアイテムを買ったりくじ引きでランダムで入手したりすることでウルファールを鍛えて進める。</p>\n<p>初期バージョンではくじ引きがあまり役に立たなかったが、</p>\n<p>バージョンアップで効果的なアイテムが入手できるようになったので、より楽しく遊べるようになった。</p>\n<p>ランキング要素もあり、高得点を目指すなら熱中して遊べるためやりごたえもバッチリ。</p>\n<p>個人的にはランキング上位を目指すためやり込んだが、その上で見えない部分の作り込みを感じた。</p>\n<p>くじ引きによる昨今のガチャゲーのようなランダム性が特徴。</p>\n<p>終盤は一見すると無理じゃないかと思うような強敵との連戦になるが、</p>\n<p>強力な装備が手に入るとそいつらをなぎ倒せるほどの強さが手に入ることもある。</p>\n<p>崩壊してそうでギリギリのところでバランスが取れている辺りに妙なセンスを感じる</p>\n<p>[8/15]ver.2.50 更新内容</p>\n<p>メニューからくじ引きテーブルの実装</p>\n<p>一部技能，状態異常の変更</p>\n<p>[8/12]ver.2.40 更新内容</p>\n<p>技能と敵の行動を変更</p>\n<p>[8/4]ver.2.30 更新内容</p>\n<p>カウンターの装備を修正，</p>\n<p>技能に消費SPを記載</p>\n<p>[8/1]ver.2.20 更新内容</p>\n<p>一部装備を修正，一部台詞を修正</p>\n<p>[7/21]ver.2.10 更新内容</p>\n<p>ウルファールや敵の能力調整</p>\n<p>[7/19]ver.2.00 更新内容</p>\n<p>ボイスを実装しました。</p>\n<p>バトルバランス等を修正しました。</p>\n<p>看板のキャンセルになる選択肢を変更しました。</p>\n<p>オンラインランキングを実装しました。</p>\n<p>「送信される情報内容」</p>\n<p>ウルファール所持金スコア</p>\n<p>「取り扱い目的」</p>\n<p>所持金スコアランキング掲載</p>\n<p>===================================</p>\n<p>このゲームの実況，紹介は大歓迎です。</p>\n<p>連絡は無くてもよいですが，連絡頂ければ</p>\n<p>積極的に見に行きます。</p>", "metacritic": null, "released": "2021-09-25", "tba": false, "updated": "2021-09-27T06:38:24", "background_image": "https://media.rawg.io/media/screenshots/39e/39e90c765efef212d3337f2d2a32ed47.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 24, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["devilsky634@gmail.com"], "genres": ["Adventure", "RPG", "Simulation"], "publishers": [], "esrb_rating": null}