{"id": 67055, "slug": "booking-revolution-hd", "name": "Booking Revolution HD", "name_original": "Booking Revolution HD", "description": "\"The deepest wrestling game you will have on your tablet for some time to come.\"<br/>- Better Gaming Bureau<br/><br/>Enjoy a better view of the show on the big screen and direct the action with more precise touch controls! Wrestling Revolution may be the reigning champion in the ring, but now \"Booking Revolution\" takes you behind the scenes where the REAL power is. Assume control of your chosen promotion and set about making it your own by hiring new stars or changing the gimmicks of existing ones. Then deploy your talent in matches of your own creation - complete with sophisticated ratings that measure the entertainment you're providing. As a fully playable wrestling management sim, it's also your responsibility to put the right person over in the right way at the right time for maximum impact! But with a locker room full of egos and rival promotions seeking to beat you in the ratings, your dream job could turn into a nightmare.<br/><br/>This version is \"Pro\" as standard, allowing you to enjoy your own dream matches with no pressure in \"Exhibition\" mode. You can also save your changes to all 350 characters across all 9 rosters to create your own universe.<br/><br/>In order to focus on the management possibilities, the following guide assumes that you are familiar with the basic controls from Wrestling Revolution:<br/><br/>RATINGS SYSTEM<br/>The key ingredients to a \"good\" match are as follows:<br/>- The \"Popularity\" of the wrestlers involved determines how much the fans will care about their actions. It affects their overall enthusiasm for the match, as well as how much they will \"pop\" for key moments (such as a near fall). In some instances, it is \"Strength\" that determines how entertaining an attack is, etc.<br/>- The purple vial indicates whether there is a Face-Heel \"chemistry\" between a good guy and a bad guy. Without this, the match may lack meaning (although especially popular or talented wrestlers can overcome it). Wrestlers who are friends in real life may also have automatic chemistry.<br/>- The green scales indicate whether the match is evenly \"balanced\" or not. Fans will quickly lose interest if one person dominates and they are not convinced that anybody could win at any moment. It is important to keep an eye on the health meters and make sure there is some back-and-forth.<br/>- The clock grows increasingly solid, indicating that the match is running is too long. The fans have a limited attention span depending on the scale of the match. It is not impossible to make gains after boredom has set it, but it's certainly harder. Note that the last minute of a match ceases to be boring! Long-sighted bookers can use this for exciting time limit draws.<br/>- The skull &amp; crossbones indicates that the match is relying too much on extreme violence. Fans can become desensitized to this after a while and it will lose its impact. The damage is not permanent though, and faith can be restored if you lay off the weapons.<br/>- A flame around the rating indicates that there is an established rivalry that the fans are getting a kick out of seeing. This enhances their enthusiasm for the match - as well as providing pre-match \"hype\" (a better starting score). You can use promos to create rivalries if they do not happen naturally. <br/>- The overall score for a show is the average of all the matches on the card - with the \"main event\" being twice as significant as all the others. It is slightly more generous than the rating for a single match, as it is not expected that every match on the card will be a classic. A 5-star show may be one full of 4-star matches!<br/><br/>I regret that there is more to this game than I could ever explain here! I hope you enjoy figuring some things out for yourself, but if not you are also welcome to join the debate at the official Facebook page where any curious questions will be answered:<br/>www.facebook.com/MDickieFans", "metacritic": null, "released": "2013-04-10", "tba": false, "updated": "2019-10-22T14:27:22", "background_image": "https://media.rawg.io/media/screenshots/a23/a23d93324b6fb41bd954c1dc4704e9c2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 151, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["MDickie"], "genres": ["Simulation", "Sports"], "publishers": ["MDickie"], "esrb_rating": "Teen"}