{"id": 67051, "slug": "dear-diary-interactive-story", "name": "Dear Diary - Interactive Story", "name_original": "Dear Diary - Interactive Story", "description": "Destiny is one tricky thing, isn’t it? What if you could be its master? Meet Anna Blake, a girl who is making her way through highschool, and help her make life changing decisions. Every choice you make will interfere directly in Anna’s fate… And that’s kind of awesome! Sneak peek at Anna’s diary and join her in all the amazing adventures!<br/><br/>Rick - the handsome and popular football player - or Martin - the smart and cute guy? Red or blue dress for prom night? Even harder: going or not going to the prom and with whom?! Studying or going out? Kissing or waiting? Tough decisions... What about a little help with that?<br/><br/>HIGHLIGHTS<br/>• New challenging way of reading and interacting with a story<br/>• Different endings depending on your choices<br/>• Don’t worry: when the story ends, you can go back in time and choose differently. Can you discover every possible ending for Anna’s story?<br/>• Beautiful doodle art<br/><br/>Life can be very challenging. Will you leave Anna by herself?<br/><br/>Disclaimer: While this App is completely free to play, some additional content can be purchased for real money in-game. If you do not want to use this feature, please turn off in-app purchases in your device's settings.<br/><br/>Like our page on Facebook and be the first to know about our upcoming games and updates! http://fb.com/tappshq", "metacritic": null, "released": "2015-07-02", "tba": false, "updated": "2019-07-29T09:19:56", "background_image": "https://media.rawg.io/media/screenshots/121/1210b2e86b1ef9bdad84832f687835f3.jpg", "website": "http://tappsgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 79, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tapps Tecnologia da Informação Ltda."], "genres": ["RPG", "Simulation"], "publishers": ["Tapps Tecnologia da Informacao LTDA."], "esrb_rating": "Everyone 10+"}