{"id": 670612, "slug": "frightwood", "name": "Frightwood", "name_original": "Frightwood", "description": "<p>Join a group of fairy teens in their attempt to discover a grand treasure - one that can only be earned during the night of Halloween. Explore the mystical forest, and find out if the claims are true, or merely a mischievous trap.</p>\n<p>Frightwood is a visual novel created over the course of a month for the Spooktober VN Game Jam 2021. An average playthrough takes around <strong>30-40 minutes</strong>.</p>\n<p>This story is a spooky prequel to my already existing VN Lovewood (think of it like a Halloween Special episode!). You don't need any pre-knowledge about Lovewood to enjoy this game, but if you're already familiar with the characters, you may get an extra kick out of seeing what Moth, Blossom and Aleth were like as teenagers! <br/></p>\n<p>A lot of passion and work went into this game - I hope it comes through &lt;3</p>\n\r\nContent warnings\r\n<p>This game includes: <br/>- mentions of emotional abuse through a parent<br/>- mild swearing<br/>- some loud noises that could be startling (no actual jumpscares though). <br/></p>\n<p>Apart from this, the game aims to be as tame as a Halloween special  episode from any 90ies cartoon.\r\n    </p>\n\r\nAccessibility\r\n<ul><li>Measures were taken to make this game accessible to blind players.  You  can toggle automatic self-voicing at any point by pressing V, or  toggle  it in the Options menu.</li><li>Audio captions for relevant sounds can be activated in the Options.</li><li>The interface is blue and yellow and should be well-readable with all variants of color blindness.</li><li>Screenshake is enabled by default, but can be turned off in the Options menu.</li><li>A German translation can be activated in the Options. [Eine deutsche Übersetzung kann im Optionenmenü aktiviert werden.]</li><li>Frightwood is optimized as a PC game, but a somewhat simplified Android build is available,  recommended for tablets or large phones. There is a known bug in which  the app only loads a black screen, which may occur on older phones or  Huawei devices.</li></ul>\r\nCredits\r\n<p>Art, Writing, Coding and Translation by Linda Roethlin (LadyIcepaw)</p>\n<p>Testing and Android build assistance by Harald Roethlin<br/></p>\n<p>Sound effects from Kenney.nl and Zapsplat.com<br/></p>\n<p>Screenshake setting by TheoMinute<br/></p>\n<p>Created with the Renpy engine (7.3.5 = PC build; 7.4 = Android build)<br/></p>\n<p>Please view the game's About menu or credits.txt for full music credits!<br/></p>", "metacritic": null, "released": "2021-09-24", "tba": false, "updated": "2021-09-27T08:01:32", "background_image": "https://media.rawg.io/media/screenshots/389/389aee7afccbfbd0dd8814e88464ebc7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 162, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux", "Android"], "developers": ["LadyIcepaw"], "genres": [], "publishers": [], "esrb_rating": null}