{"id": 670736, "slug": "garena-free-fire-max", "name": "Garena Free Fire MAX", "name_original": "Garena Free Fire MAX", "description": "Free Fire MAX is designed exclusively to deliver premium gameplay experience in a Battle Royale. Enjoy a variety of exciting game modes with all Free Fire players via exclusive Firelink technology. Experience combat like never before with Ultra HD resolutions and breathtaking effects. Ambush, snipe, and survive; There is only one goal: to survive and be the last one standing.<br/><br/>[Fast-paced, deeply immersive gameplay]<br/>50 players parachute onto a deserted island but only one will leave. Over ten minutes, players will compete for weapons and supplies and take down any survivors that stand in their way. Hide, scavenge, fight and survive - with reworked and upgraded graphics, players will be richly immersed in the Battle Royale world from start to finish. <br/><br/>[Same game, better experience]<br/>With HD graphics, enhanced special effects and smoother gameplay, Free Fire MAX provides a realistic and immersive survival experience for all Battle Royale fans.<br/><br/>[4-man squad, with in-game voice chat]<br/>Create squads of up to 4 players and establish communication with your squad right from the start. Lead your friends to victory and be the last team standing victorious at the apex!<br/><br/>[Firelink technology]<br/>With Firelink, you can login your existing Free Fire account to play Free Fire MAX without any hassle. Your progress and items are maintained across both applications in real-time. You can play all game modes with both Free Fire and Free Fire MAX  players together, no matter which application they use.<br/><br/>Privacy Policy: https://sso.garena.com/html/pp_en.html<br/>Terms of Service:  https://sso.garena.com/html/tos_en.html<br/><br/>[Contact us]<br/>Customer Service: https://ffsupport.garena.com/hc/en-us", "metacritic": null, "released": "2021-09-27", "tba": false, "updated": "2021-10-01T02:28:48", "background_image": "https://media.rawg.io/media/screenshots/598/59887ea2ff4d950923a8cf4536c85ad3_d4vKCsz.jpg", "website": "http://ff.garena.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 347, "game_series_count": 0, "reviews_count": 2, "platforms": ["Android", "iOS"], "developers": ["GARENA INTERNATIONAL I"], "genres": ["Action", "Adventure"], "publishers": ["GARENA INTERNATIONAL I PRIVATE"], "esrb_rating": null}