{"id": 670723, "slug": "colorswipes-color-by-number", "name": "Colorswipes - Color by number", "name_original": "Colorswipes - Color by number", "description": "We are happy to introduce a breaking any frames and rules coloring game. At this time, you get a unique chance to turn your fingers into paintbrushes. From now on, art comes closer and closer to you. You can feel it with the tips of your fingers. <br/><br/>Our team has made deep research on the field of coloring apps and we developed our brand new coloring game!  This time, tap and color by number turn to the swipe and color by number. This is a revolution in the world of coloring games. <br/><br/>Have you ever been to any picture gallery? If the answer is no, start your own one! It is high time for you to prepare your paint and start playing the game that follows the idea of a paint by number game.<br/> <br/>Our new approach: swipe and color are as easy as swiping your news on social network apps. And it is as authentic as a real paintbrush. Your drawings will definitely excite your audience. <br/> <br/>We give you a chance to become a real artist or show off your skills as a mature one. No more tap, just swipe it! <br/> <br/>Place your finger-brush on a color you want and swipe it on the pale area. Add more colors and enjoy the process! Coloring games are becoming more and more enjoyable and healthy!<br/> <br/>A great variety of wonderful colors will make your every picture be a masterpiece! Write your coloring book by playing this magnificent coloring game!<br/> <br/>Release yourself! Swipe and color your drawing! Feel free while using our coloring game. Be unique! Share! Exhibit your picture gallery! <br/><br/>Terms of Service: https://colorswipes.colorgame.life/term.html<br/>Privacy Policy: https://colorswipes.colorgame.life/policy.html", "metacritic": null, "released": "2021-09-18", "tba": false, "updated": "2021-10-01T02:20:15", "background_image": "https://media.rawg.io/media/screenshots/bdc/bdc8db14b53dfc755f8a4dc1e23b9834_opsCBjC.jpg", "website": "https://colorswipes.colorgame.life/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 206, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Fuero Games"], "genres": ["Board Games"], "publishers": ["Fuero Games"], "esrb_rating": "Teen"}