{"id": 670730, "slug": "emergency-driving-simulator-3d", "name": "Emergency Driving Simulator 3D", "name_original": "Emergency Driving Simulator 3D", "description": "The city needs your help! Hundreds of patients are waiting for you to take them to the hospital. Hurry, time is running out! You will have to learn how to operate a flying car and deliver the sick or injured. Try your hand at such an unusual adventure - download the app!<br/>Complete levels one after another and rescue helpless people! The most important thing is to keep track of the time. Try to have time to complete the task before it ends. You can easily do it, because you will be driving not an ordinary, but a flying car. This feature will allow you to fly around all obstacles and quickly move around the city!<br/><br/>Premium features: <br/>- Access to all levels <br/>- Unlocked all types flying cars <br/>- Exciting tasks<br/><br/>Stunning HD graphics and high-quality 3D design make the gameplay as realistic as possible! The control of the car happens just like in real life - smoothly and believable. You will be delighted with the possibilities of this application!<br/>Don't delay and download this exciting game right now! Forget boring video games and start an exciting new adventure!<br/><br/>Important - you need subscription to use the app! There are no free functional inside!<br/>* Upon confirmation of purchase of your subscription, payment will be charged to your iTunes account.<br/>* Subscription will automatically renew unless auto-renew is turned off at least 24 hours before the end of the current period and payment is charged to your iTunes account.<br/>The renewal cost depends on your subscription plan. Our standard subscription plan - 1 week subscription is $5.99<br/>For other currencies, the price matches the price level in the App Store Price Matrix.<br/>* Subscription with a free trial period automatically renews to a paid subscription. You can cancel or manage the automatic renewal of the free trial by going to your Account Settings after purchase. Cancellation will take effect 24 hours after the last day of the current subscription period and you will be transferred to a free service.<br/>* Please note: Any unused portion of the three-day free trial period (if offered) will be forfeited when purchasing a premium subscription during the free trial period.<br/>* For any other information, see our privacy policy and terms of use.<br/>Privacy Policy:  https://docs.google.com/document/d/1PSQl8-msxhwx78bw6uciE6Q5A7Q-VG30J_Ehlb_IgXQ/edit?usp=sharing<br/>Terms of use:  https://docs.google.com/document/d/1pJgdIUNKNedxoGHCY0FJ_xtGfV_5lAbTbHii4yt3Po8/edit?usp=sharing", "metacritic": null, "released": "2021-09-16", "tba": false, "updated": "2021-10-01T02:23:40", "background_image": "https://media.rawg.io/media/screenshots/2df/2df0bcc19c4f7e6b00f56a3a1b170988_x8cKqRJ.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 143, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Szymon Tomczyk"], "genres": ["Simulation", "Racing"], "publishers": ["Szymon Tomczyk"], "esrb_rating": "Everyone 10+"}