{"id": 670910, "slug": "as-lendas-de-mboi", "name": "As Lendas de M'boi", "name_original": "As Lendas de M'boi", "description": "<p>   As Lendas de M'boi foi um projeto realizado entre os anos de 2018-2019 pela equipe do Transmídias PTI (Parque Tecnológico de Itaipu), professores e discentes do curso de Cinema e Audiovisual da Unila (Universidade Federal da Integração Latino-Americana) e discentes do curso de Ciência da Computação da Unioeste (Universidade Estadual do Oeste do Paraná), que juntos compunham o JogArt - Laboratório de Interatividade em Jogos, Narrativa e Arte.</p>\n<p>    No jogo é possível interagir com diversos pontos de interesses em quatro imagens de 360º de pontos turísticos fronteiriços. Para liberar cada mapa virtual os usuários tiveram de \"caçar\" totens espalhados pelo Campus da Unila, onde estava localizado um QR Code que ao ser lido pelo jogo, liberava uma das fases. </p>\n\n\r\nTotens de liberação das fases - (a) Marco das três fronteiras, (b) Ilha de Acaray, (c) Cataratas do Iguaçu, (d) Itaipu Binacional.\r\n\n<p>    Dentro de uma fase cada ponto de interesse funciona de forma distinta podendo apresentar informações ou a narração de uma lenda indígena relacionada ao local em português, espanhol ou guarani. Coletar todos os pontos de interesse em todos os mapas permitem ao usuário liberar a última fase do jogo. Esta última fase, no lançamento do jogo, se passou no mundo real e consistia de uma instalação audiovisual imersiva onde imagens e sons relacionados à M'boi foram expostos com o jogo indicando em um mapa onde a intervenção artística estava instalada.</p>\n\n\r\nFase final do jogo (Instalação) - (a), (b) e (c): Voal onde as imagens eram projetadas, (d): Ñanduti refletido em uma \"poça\" d'água.\r\n\n<p>Este trabalho foi publicado no SBGames de 2019 realizado no Rio de Janeiro - RJ. Link para o artigo: Processos Criativos da Obra-jogo \"As Lendas de M’Boi\": Uma Experiência de Exploração Interativa entre Mitologia e Arte.</p>\n\n<p><strong>INSTRUÇÕES PARA JOGAR</strong></p>\n<p>1. Abra a aplicação e selecione o ícone de máquina fotográfica para abrir a câmera do dispositivo.</p>\n<p>2. Aponte a câmera para um dos QR Code disponiblizados para download, o que irá liberar uma das fases.\r\n</p>\n<p>3. Navegue pela fase tocando na tela e arrastando o dedo. Procure pelos pontos de interesse, lendo as informações apresentadas e os áudios das lendas ao clicar nestes pontos. Ao finalizar a exploração, retorne para a tela inicial e repita o processo com a câmera e o QR Code para liberar outras cenas.\r\n</p>\n<p><strong>Observação: </strong>Como a última fase consistia de uma instalação no mundo real, não é possível acessá-la mais.\r\n</p>", "metacritic": null, "released": "2021-09-30", "tba": false, "updated": "2021-10-01T03:13:19", "background_image": "https://media.rawg.io/media/screenshots/7e4/7e4490f16c8877520fb1ec640d43225a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 204, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["FFracaro"], "genres": ["Educational", "Puzzle"], "publishers": [], "esrb_rating": null}