{"id": 67112, "slug": "surprise-toy-gift-unwrap", "name": "Surprise Toy Gift Unwrap", "name_original": "Surprise Toy Gift Unwrap", "description": "Hello! Welcome to the amazing toy shop for both girls and boys. Let’s go to the kids toy shop store and find out your favorite toys out there. Have you ever think of buying toy that you only dreamed of? No? No need to worry about that. Welcome to the toy fantasy toy world where you can get the gifts and find out the surprise in the hidden objects. The departmental toy world is opened for you. Just walk into the toy fantasy world and find out all the toys that you are longing for. You can find your favorite toy from this entertaining toy kids shop.<br/><br/>This is the right place for the kids whether it is boy or girls because you can find every kind of toy in this kids game toy world shop. This is the best toy shop ever. This is the most fun loving best kids game with the best toy fantasy store.<br/>This is the real virtual toy shop that is opened for you anytime you want to buy toys. Kids always love to have new toys so don’t wait and start to buy toys for your kids as they are waiting for the amazing surprise you want to give them. They will be happy when they open up the toy fantasy that you have bought from this virtual toy world.<br/><br/>You can find a variety of toys in this best virtual kids game toy shop. You will never going to find these types of toy gift in any other toy game. The best feature in this game; find out the amazing variety of toys for both whether it’s a girl or a boy. This is the simplest toy shop kids game where you can pick up your favorite toy not only 1 but can pick up to 5 toys at a time. Yes! That’s a good news that there is limitation to buy a single toy from the biggest toy world in the Play store ever.<br/><br/>Choose your favorite toys from the variety of options to select. You can pick up the gender specific toys in this girl toy shop. This is a two in one kids toy shop where you can shop for the gifts for your boy and toy for girls are also available. Enjoy the candy un fantasy toy shop game with entertaining toys for boys. There are many stuff toys in the kids game best toy shop. Just choose the toys and see what is hidden in those packed gifts. You will definitely find a great surprise inside the hidden objects.<br/><br/>Every boy loves to play with the super hero. So get ready for these super hero toys and play with them. You can find all the super hero in the toy fantasy toy shop. You can find all kind of stuff toys for all the kids. Get your favorite candy fun as your toy and enjoy the colorful candy in the candy fantasy fun game for kids. Girls can choose the dolls and other character dolls of their own choice so they can play with them in the dolls for girls.<br/><br/>******How to Play Surprise Toy Gift Unwrap******<br/>Tap on the play button<br/>Select the character to choose the toys from the toy shop accordingly<br/>Select up to 5 toys from the toy world simulator<br/>Open up the toys to play<br/><br/>*******Features*******<br/>Gender Selection option<br/>Different girls toys to play like dolls, fidget spinner, stuff toys, candies etc<br/>Different boys toys to play like super hero toy, candy fun etc<br/>Choose up to 5 toys at a time<br/>Colorful environment <br/>Fun loving background sound<br/><br/>Download this entertaining toy fantasy family kids game and enjoy different toys from the best stuff toy kids game!", "metacritic": null, "released": "2018-07-30", "tba": false, "updated": "2019-10-22T14:01:48", "background_image": "https://media.rawg.io/media/screenshots/e3e/e3ee4a0013a56d8485d83b76c103d7a7_vJnJygE.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 95, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tik Tok"], "genres": ["Arcade", "Casual", "Puzzle"], "publishers": ["Tik Tok"], "esrb_rating": null}