{"id": 671196, "slug": "the-legendary-adventure-of-buck-quickshot", "name": "The Legendary Adventure of Buck Quickshot!", "name_original": "The Legendary Adventure of Buck Quickshot!", "description": "<p><em>The Legendary Adventure of Buck Quickshot </em>is an epic adventure for Game Boy of Legendary proportions. You play as the hero in a quest to save a town in the American Wild West. Featuring impressive 1-bit(ish) graphics! Gun slingers! Bank Robbers! Shootouts! It's got some of those, and MORE!</p>\n<p>This is an adventure parody game was made using GB Studio for the Game Boy Competition 2021. </p>\n<p>Controls:</p>\n<strong>Action</strong><strong>Game Boy</strong><strong>Keyboard</strong>MoveD-PadArrow KeysInteract/TalkAZShoot in Top-Down ViewBXShoot in Platform viewAZJump in Platform ViewBAView MenuStartEnterUse DynamiteSelectShit\r\n<p>All development of assets and programming took place during the time of the competition. I edited some stock photos to work with the Game Boy I got from Picsart, and an image from 1966's <em>The Good The Bad and The Ugly</em>. I'm claiming fair use/parody law on that one. But I don't think anyone really cares. This is just for fun.  </p>\n<p>Splash Screen by jaredchansen,  (I think only a sign post) from GB Studio stock assets/ Chris Maltby. All other art and music were created by me. </p>\n\n<p>Tools I used: GBSTUDIO, Pixel Studio, Tiled, and Milky Tracker.</p>\n\n<p>Thanks to Robert Doman for his tutorials!</p>\n<p>https://youtube.com/channel/UCU_4orRy-j0qTenIZ5BYL4w<br/></p>\n<p>I hope you enjoy the game! I will definitely work to expand and improve the game in the future. Thanks!</p>", "metacritic": null, "released": "2021-09-29", "tba": false, "updated": "2021-10-01T04:25:49", "background_image": "https://media.rawg.io/media/screenshots/5c8/5c89c8e69547673352f64a34e5a98a83.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 51, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["wbutz1"], "genres": ["Action", "Adventure"], "publishers": [], "esrb_rating": null}