{"id": 671243, "slug": "hordebreak-development-build", "name": "Hordebreak Development Build", "name_original": "Hordebreak Development Build", "description": "<p><strong>Welcome to the current development build for Hordebreak!</strong></p>\n<p>Hordebreak is a co-op open world survival game taking place on the mutant horde infested planet Kryst. Build a base, loot abandoned infested settlements and fight hordes of hundreds and potentially even thousands of mutants.</p>\n<p><strong>Discord channel</strong><br/>https://discord.gg/ukpPaGbe</p>\n<p><strong>Web site &amp; Mail list signup <br/>https://hordebreak.com/<br/></strong></p>\n<p><strong>Some useful things to keep in mind when trying the demo:</strong><br/></p>\n<ul><li>Pressing escape in game will allow you to find a list of all the controls</li><li>Some seeds have you surrounded by the arctic biome early on. If that's the case, you will have to remake the world as well, or perhaps be very creative</li><li>When exiting the game, use the in-game menu. Otherwise the world save might get corrupted</li><li>Sometimes players do not see roads or settlements on the world map</li><li>AI is wonky right now</li><li>The progression line ends after building the advanced work bench. All progression afterwards is very WIP.</li></ul>\n<p><strong>When playing with friends:</strong><br/></p>\n<ul><li>The game server supports up to 4 players</li><li>Starting a game automatically hosts the server as well. There is no difference between hosting a server and playing solo. This will make windows ask you about firewall permissions even when playing single player.</li><li>If you play with friends it is preferable if the player with the most capable CPU hosts the server</li><li>For hosting a server we recommend an upload and download speed of 10 mbits/s. Lower speeds should be fine unless a very big number of enemies are spawned</li><li>You connect via direct IP, which means the host must ensure that no firewall or other security measures blocks the connection. The default port for port forwarding is 7676. You can watch a tutorial for a minecraft server or similar if you host a server but your friends can't connect</li></ul>\n<p><strong>Thanks for trying Hordebreak!<br/></strong>We are an indie studio and this is an early development build, as such it is quite rough and it has not been tested on a wide variety of hardware or networking setups. We would greatly appreciate all feedback, suggestions and reports you may have regarding the game and its performance:</p>", "metacritic": null, "released": "2021-09-29", "tba": false, "updated": "2021-10-01T04:39:35", "background_image": "https://media.rawg.io/media/screenshots/bc2/bc29cc1fc5350d0010e1f5fd33313627.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 307, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Far North Entertainment"], "genres": [], "publishers": [], "esrb_rating": null}