{"id": 671280, "slug": "assignment-one-adventure-game", "name": "Assignment One: Adventure Game", "name_original": "Assignment One: Adventure Game", "description": "<p>This is an adventure game that the player, a black blob, explores two rooms and avoids obstacles. When collecting all items, the black blob wins the game. The aesthetic materials were inspired by my favorite game\" Give It Up!\".  The traps are needles on the ground. When the black blob touches needles, the game is over. <br/></p>\n<p>At first, I do not convert my assets to a prefab. I found that I need to copy assets and set them one by one when I created the second scene. After that, I started to convert assets to prefabs. I found that the prefab system help me save much time.  <br/></p>\n<p>At last, I started to think of how to change to the \"Win\" scene.  My thought is that the player went to the Win scene when the player collected all items. I added an if statement into the script of the player. I write a statement that if the score is equal to 35, the scene changed to the Win scene. </p>\n<p>There is a bug that I have not fixed yet. When the player opened the door and entered another room, the score in another room was initial value，zero.   After collecting the first item in the second room, the score started to accumulate.  I think that I might make some changes to the script of the public variable.  I cannot find any relevant tutorials on the Internet.  So, I have not fixed this bug yet. Moreover, when I played the game, the player touched the needle and the game was over. After restarting, the score was not the initial value. The scores in the previous game were accumulated into scores of the present game. This is also another bug that I did not fix.<br/></p>\n<p>If I have more development time, I would fix the bug and design enemies that can move around. Adding more obstacles and traps increases the game's difficulty and  makes the game more playful and funny. </p>", "metacritic": null, "released": "2021-09-29", "tba": false, "updated": "2021-10-01T04:49:41", "background_image": "https://media.rawg.io/media/screenshots/5ea/5ea55d8cd54951fc0b9726940070af1d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 2, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Android", "Web"], "developers": ["tarahu"], "genres": [], "publishers": [], "esrb_rating": null}