{"id": 671283, "slug": "bad-faith-the-game", "name": "Bad Faith (The Game)", "name_original": "Bad Faith (The Game)", "description": "<p><strong>A Mother brings her son to a specialized \"Weight Loss\" Clinic in order to help him lose weight.  But for weeks, treatment had shown no progress...</strong></p>\n\n<p>(This Visual Novel was made for the 2021 Spooktober VN Jam)</p>\n<p><strong>[CONTENT WARNING]</strong><br/></p>\n<p>Strong Language, Gore, Body Horror, Body Image Issues, Religious Fanaticism, Abuse, Mental Trauma, Flashing / Flickering Lights </p>\n<p>---</p>\n<p><em>Hello!  This is a Game based on a Horror Comic I drew in 2020 for \"Let's Make Comics Chicago's Tasty Anthology\".  </em><br/></p>\n<p><em>This project was made as a way to get my feet wet (again) in the Game Development Environment after a couple years out of it.  I also don't tend to do Horror-related work, so I understand this could be rough.</em>\n</p>\n<p><em>I hope to refine this game to have a bit more content at a later date, but hope you enjoy the base game and its story that I've finished.</em>\n</p>\n<p>---<br/></p>\n<p><strong>[Current Road Map]</strong></p>\n<p>-Slightly more refined graphics on some items.<br/></p>\n<p>-A couple extra backgrounds here or there.</p>\n<p>-An Alternate Ending</p>\n<p>-Cooler Animation Stuff.</p>\n<p>-Slightly less scuffed coding for certain events.  There are certain concerns I have that the game may have some graphical inconsistencies on select devices right now.</p>\n<p>-A possible save system, so you don't have to play the entire game in one long 10-minute session!</p>\n<p>-Better Size Optimization.</p>\n<p>---</p>\n<p><strong>[Known Bugs]</strong></p>\n<p>-Videos sometimes flash a frame midpoint before playing the video in full.  </p>\n<p>-\"Why does some music cut off immediately?\" You may ask.  I don't know.  I will travel the stars to find the answer.</p>", "metacritic": null, "released": "2021-09-29", "tba": false, "updated": "2021-10-01T04:50:35", "background_image": "https://media.rawg.io/media/screenshots/ddb/ddb1610eb25dc497147300341c410905.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 91, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["CatTrigger"], "genres": [], "publishers": [], "esrb_rating": null}