{"id": 67137, "slug": "piano-challenges-white-tiles-2", "name": "Piano Challenges White Tiles 2", "name_original": "Piano Challenges White Tiles 2", "description": "Let’s play Piano Challenges 2 White Tiles – one of the new games 2017, on your device NOW! FOR FREE!<br/><br/>Have you ever dreamed of becoming a music maestro? Playing Chopin, Mozart, Beethoven and 2017 HOT songs on a grand piano? Now your dream can come true with Piano Challenges 2 White Tiles - the best piano games series ever! <br/><br/>Tap on the black tiles, don’t tap the white tiles to feel the rhythm and melody.<br/><br/>HOT UPDATES:<br/>• Update NEW SKIN version with NEW AWESOME experience<br/>• The one and only Battle Mode - a new feature in 2017: challenges with more than 5 million players around the world in a “no - mercy” piano online match! The winner takes it all!<br/>• Request any piano songs you love and leave it to us. We will find and bring it to you as fast as we can.<br/>• All new trending songs (updated every week) with a variety of K-pop and US-UK hits in high-quality piano songs.<br/><br/>TOP FEATURES:<br/>• Beautiful piano music which makes it become the best awesome piano games for family &amp; friends. Perform your favorite piano songs and challenges with your friends and other players to show them your piano talent.<br/>• Simple to play, difficult to master – one of the hardest game ever. Catching all the tiles in these high-speed piano games is not easy, especially in our new Battle Mode!<br/>• 200 different piano songs to diverse your music nature.<br/>• Awesome game design and graphic for the piano challenging games. You will feel like you are playing a real luxurious classic piano made with expensive mahogany, whose rhythm is perfect for any piano music lover.<br/>• Smooth gaming experience, easy to play and lightweight to install.<br/>• Songs frequently updated, diverse from classic songs (like Beethoven, Chopin, Mozart, Schubert, Tchaikovsky) to the most popular one.<br/>• Feel the beautiful piano music melodies beyond imagination through every tap with perfect timing tiles.<br/>So, do you have what it takes to get on top of our Leader Board with over 5 million players? This speed tapping piano games is definitely more challenging than you could imagine.<br/><br/>Try out this game now and challenges your own reaction speed and skills!<br/>Piano Challenges 2 White Tiles is waiting for the pianist challengers!<br/>No need to hesitate because we are FREE!<br/>Happy 2017!<br/><br/>Privacy Policy: https://goo.gl/uvQtqM", "metacritic": null, "released": "2016-03-28", "tba": false, "updated": "2019-10-22T14:01:48", "background_image": "https://media.rawg.io/media/screenshots/18d/18d50d1f75fe957e9a6d27f9bb4d3bfb.jpg", "website": "https://www.facebook.com/PianoChallengesFans/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 42, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Vo Binh"], "genres": ["Arcade"], "publishers": ["Vo Binh"], "esrb_rating": "Everyone 10+"}