{"id": 671378, "slug": "escape-2d-topdown-retro-game", "name": "ESCAPE: 2D Topdown Retro Game", "name_original": "ESCAPE: 2D Topdown Retro Game", "description": "<strong>Introduction</strong><p>This is a 2D topdown game invovling different types of basic traps. All you need  is to control the character and manage to escape, while collecting as many coins as you can. Easy to play, hard to get a high score!</p>\n<p>Playing the game, you'll be able to experience 2 scenes. One is trying to get into the car by grabbing the key first, while bypassing the bomb, going through the spikegate and avoiding the fires. The other is to drive the car rushing to the finish line, escaping from the bullets, lasers, and passing the spikestrip. Try not to be hit by the traps, or the limited health won't guarantee a win. Meanwhile, try to collect the coins on the road since they are worth a lot in the final score.</p>\n<p>Have fun!</p>\n\r\nPost Mortem\r\n<p>There are few points I'd like to address in learning Unity and developing the game.</p>\n<p>First, apart from the player's key input, this game is mainly triggered by colliders. Box collider, circle collider and mesh colliders for walls and different traps. However, whether to add rigid body components depends on the exact actions I need. If the trap is transformed by scripts like the bomb or the fire ring, or is exerted by a force like the bullet, then a rigid body component must be added. On the other hand, custom animation without the rigid body like the spikegate, spikestrip and laser could also be used. An extral help of no rigid body is that, the gameobject won't be limited by other colliders, for example, the laser would go through the wall instead of beating the wall and being destroyed. </p>\n<p>Second, there are some tricks I figured out in solving problems about the animations. To change the animation states by a delayed time, I tried to use StartCoroutine, yield and WaitForSeconds at the beginning, only to find out it didn't work. Then, I set a transition bool parameter controlled by scripts using Time.delataTime, still failed. Finally, I deleted the transition bool parameter and used script to control the play of animation state directly, it worked. This is specifically useful for letting the spikegate close and reopen for some seconds.</p>\n<p>Another trick I find out is to use animation events to tell the script when a state begins and ends. GetCurrentAnimatorStateInfo(0).IsName() didn't work. This trick is used for waiting and playing the end animation of scene 1 (car starting up) and then load to scene 2.</p>\n<p>What's more, to rotate a gameobject smoothly,  Quaternion.Slerp may be used. However, it is not the case with the fire ring which turns around and around and around in 360 degrees. Using slerp results in rotating to the angle less than 180 degrees. Therefore, it won't rotate from 0 to 359, instead, from 0 to 1. To solve this problem, a very simple line can be introduced -- transform.Rotate(new Vector3(0, 0, 100) * Time.deltaTime * speed).</p>\n<p>At last, this game is still in very early development. The game mechanics and game play runs well. But there are still a lot more work remaining in the visial part.</p>\n\r\nAppendix\r\n<p>Here is the design draft of the game.</p>", "metacritic": null, "released": "2021-09-29", "tba": false, "updated": "2021-10-01T05:16:15", "background_image": "https://media.rawg.io/media/screenshots/9d5/9d53fd0f3d2f861a2e8fea91a0269c7b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 33, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["royyang"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}