{"id": 67134, "slug": "sling-drift", "name": "Sling Drift", "name_original": "Sling Drift", "description": "Fast action drifting with your car around an endless race track.<br/><br/>One tap easy to learn controls with addictive gameplay.<br/><br/>How far can you go?<br/><br/><br/>Subscription Terms<br/><br/>VIP Access offers a weekly subscription for $5.99 after a 3 day free trial. Upon purchase of this subscription, you will immediately receive: 3 new legendary cars, 200% extra gems from daily gift and gameplay, and remove all ads. There are 2 additional legendary cars that are unlockable with sustained VIP access. You will receive the first after (2) paid subscription weeks, and the second after (4) paid subscription weeks. This is an auto-renewable subscription. The payment is charged to your iTunes account after purchase confirmation. Your subscription is renewed unless you turn it off at least 24 hours before the period ends. Your account will be charged for renewal as well. See below links for more information.<br/><br/>The prices are set for United States customers. Pricing in other countries may vary and actual charges may be converted to your local currency.<br/><br/>Canceling your Subscription<br/><br/>Please visit this link: https://support.apple.com/HT202039<br/><br/>For our privacy policy visit: http://tastypill.com/privacypolicy<br/>For our terms of service visit: http://tastypill.com/tos<br/><br/>For any additional question, please contact us at: help@tastypill.com", "metacritic": null, "released": "2018-04-30", "tba": false, "updated": "2022-11-03T19:09:42", "background_image": "https://media.rawg.io/media/screenshots/394/394c9f139b784f47321fb0e56bac4b76.jpg", "website": "http://www.facebook.com/tastypill/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 2, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 65, "game_series_count": 0, "reviews_count": 2, "platforms": ["Android", "iOS"], "developers": ["tastypill"], "genres": ["Action", "Racing"], "publishers": ["Tastypill"], "esrb_rating": null}