{"id": 671391, "slug": "aeternum-vale", "name": "Aeternum Vale", "name_original": "Aeternum Vale", "description": "“Aeternum Vale” is Latin for “Farewell Forever”. It explores the topics of death and the afterlife in a bittersweet esoteric adventure inspired of both retro classics and indie darlings.<h3>Save Your Soul</h3><br/>Fallen through space and time into unknown limbos, you will have to face the world’s hardships to earn your soul’s right of passage. The very environment is littered with enigmas and seems to be intentionally designed as a giant misleading maze. What is this place? How to get out?<br/><br/><h3>Explore. Upgrade. Improve. Overcome.</h3><br/>Jump, Push, Dash, Climb, Glide &amp; Slice your way through hidden paths and secret passages. Pick your own fights, upgrade your weapon, and spend some time with the weird locals. The story will only go as far as you go looking for it! <br/>YOU are the one forging your own path. <br/>But will you be strong enough to save your soul?<br/><h3>Features:</h3><br/><ul><li> A Magnificent classic orchestral original soundtrack from composer Wesley Coleman!<br/></li><li> A Huge beautifully handcrafted pixel-art open-world!<br/></li><li> Tight controls and fast paced, challenging platforming &amp; combat action!<br/></li><li> A really cool dog!<br/></li><li> Upgrade your weapon, refine your skills, and come back stronger: there is no tweaking the difficulty settings!<br/></li><li> Meet a fully voiced cast of quirky, lovable characters!<br/></li><li> Let the world tell its own story: exploration is key and you will have to explore its every corners to get answers…<br/></li><li> Seriously, the dog is pretty cool.</li></ul><br/><br/><br/>Do you want to know more? https://discord.gg/S4hCcE7", "metacritic": null, "released": "2021-09-29", "tba": false, "updated": "2022-10-07T05:50:46", "background_image": "https://media.rawg.io/media/screenshots/4a1/4a1a0d72caeb369f1b76a9cac6cdb724.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 101, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Whalics", "Boris Cerdan"], "genres": ["Action", "Shooter", "Adventure", "Indie"], "publishers": ["Boris Cerdan"], "esrb_rating": null}