{"id": 671521, "slug": "journey-to-the-pearly-gates-limbo-cards", "name": "Journey to the Pearly Gates (Limbo Cards)", "name_original": "Journey to the Pearly Gates (Limbo Cards)", "description": "<p>“So you’ve finally died and have sailed over the river Styx.  You are now in limbo, purgatory to be exact.”<br/></p>\n<p>“I’m not here to hand-hold you on your way to Heaven. You shall make this journey alone by yourself. Who you will meet, even I do not know. Make your way towards what your intuition guides. The fate you yearn for shall lead your way.\"</p>\r\nHow to play\r\n<p>Place cards in between you and your opponent. When a card is on the board, it will automatically attack the minion across from it at the end of the turn. <strong>(A minion's attack is on the bottom left of the card</strong><strong>)</strong>. If there is no minion, then the enemy hero will take damage.  If a minion reaches zero health <strong>(Health is on the bottom right)</strong>, it will be sent to the graveyard. If a player tries  to draw a card with no cards in their deck, the graveyard will be shuffled back into their deck. A minion will not attack the first turn it is played.</p>\n<p><strong>Each card has a cost (top right). </strong>A player has 8 willpower to spend each turn. At the start of your turn, your willpower returns to 8 and you draw a card. </p>\r\nCertain cards have special effects. These can be seen by clicking on the card.\r\n<p>Once an enemy is defeated, you can let them go<strong> (green button)</strong> or kill them <strong>(red button</strong>). Killing them will give you a stronger card, but you will be judged for your actions. </p>\r\nYou can click on the cards in the decision panel to examine them too.\r\n\n<p>Made by Jonas Traweek, NvN, Tartles, Sincey, and RacingAndy. (AKA The Limbo Bars)</p>\n<p>Credit to White Bat Audio for the music. (Used under Creative Commons License)</p>", "metacritic": null, "released": "2021-09-26", "tba": false, "updated": "2021-10-01T05:56:32", "background_image": "https://media.rawg.io/media/screenshots/90b/90befa24789162c5f721f125e4372476.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 55, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["Weak_Tray_Games"], "genres": [], "publishers": [], "esrb_rating": null}