{"id": 67159, "slug": "fat-no-more", "name": "Fat No More", "name_original": "Fat No More", "description": "Can you get everyone fit? Help your clients reach their life goals with fun and addictive exercising and diet routines. Lift weight, jump the rope, run the treadmill and more! Warm-up and let’s start!<br/><br/>In Fat No More fat is burned and pride is earned!<br/><br/>You know how candy, pizza and burgers are delicious. But they have a price that cost more than money and it starts to be charged when extra fat begins dangling off by the flanks!<br/><br/>You are a great personal trainer -- the best of the kind actually -- and people will come to you with the most diverse reasons to get fit: summer slim down, fit the maid of honor dress, preparing for a marathon, vacation weight gain, feel confident for flirting again or for health issues such as gain or lose weight to live a healthier life.<br/><br/>Make specific diets and sequence of exercises for each client you have to mentor and help customers fit back in their favorite jeans! Gift your students items that will help them in their fitness missions. Help them to help you!<br/><br/>FITNESS FUN MINIGAMES<br/>• Running: improve cardio by keeping the rhythm of a run<br/>• Weight lifting: boost strength of muscles by lifting moderate and heavy dumbbells<br/>• Rope Skipping: better body resistance and breath<br/><br/>HIGHLIGHTS<br/>• +40 characters for you to train and hundreds of different challenges to complete<br/>• Power gifts for your students: running shoes, glasses, weightlifting belt, wrist straps, knee support, head band, rope, jumping shoes<br/>• Fitness minigames: running, weight lifting and rope skipping<br/><br/>Disclaimer: While this App is completely free to play, some additional content can be purchased for real money in-game. If you do not want to use this feature, please turn off in-app purchases in your device's settings.<br/><br/>Like our page on Facebook and be the first to know about our upcoming games and updates! http://fb.com/tappshq", "metacritic": null, "released": "2014-12-03", "tba": false, "updated": "2019-07-29T09:22:50", "background_image": "https://media.rawg.io/media/screenshots/ef4/ef48fa203659af0713c34aa01063e325_9O6FyoN.jpg", "website": "http://tappsgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 85, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tapps Tecnologia da Informação Ltda."], "genres": ["Simulation"], "publishers": ["Tapps Tecnologia da Informacao LTDA."], "esrb_rating": "Everyone 10+"}