{"id": 671569, "slug": "west-shooter", "name": "West Shooter", "name_original": "West Shooter", "description": "West Shooter\r\n<p>West Shooter è un semplice gioco arcade nel quale devi uccidere più nemici  possibili nel giro di 30 secondi. Più nemici uccidi e più il tuo punteggio sarà alto alla fine della partita. Ogni volta che uccidi un nemico il gioco ti assegna un punto. Per uccidere i nemici ti basta premere una volta sul nemico e quest'ultimo verrà ucciso. Questo gioco si può giocare da telefono e da pc. Se il gioco vi piace, fatecelo sapere qui sotto nei commenti così in futuro porteremo diversi aggiornamenti su questo gioco. Detto questo, divertitevi.</p>\r\nChi ha sviluppato il gioco?\r\n<p>Antonio Visconti e Andrea Barattolo sono due ragazzi di 18 anni che hanno la passione per l'informatica , precisamente per la programmazione. Hanno deciso di unire le forze e di iniziare a collaborare per creare diversi giochi che possano piacere alle persone. Questo è il loro primo gioco  insieme ma sarà il primo di una lunga serie.</p>\r\nCome abbiamo creato il gioco?\r\n<p>Il gioco è stato creato grazie a construct 2 https://www.construct.net/en che è un programma che ti permette, attraverso dei blocchi di codice, di sviluppare fantastici giochi 2d. Il gioco è stato sviluppato in due settimane. Antonio Visconti si è occupato della parte di sviluppo, ovvero di tutta la programmazione, mentre Andrea si è occupato della parte dei suoni. I suoni sono stati realizzati grazie a bfxr https://www.bfxr.net/ mentre la musica, di cui si è occupato Antonio Visconti, è stata realizzata con bosca ceoil https://boscaceoil.net/. Gli assets sono stati presi proprio da questo sito, ovvero itch.io.</p>", "metacritic": null, "released": "2021-09-28", "tba": false, "updated": "2021-10-01T06:09:15", "background_image": "https://media.rawg.io/media/screenshots/1f4/1f41b8ec89f69877861f62516bcb57cb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 31, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["TwoDevOneGame"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}