{"id": 67165, "slug": "do-not-disturb-the-grumpy-virtual-pet-marmot", "name": "Do Not Disturb! The Grumpy Virtual Pet Marmot", "name_original": "Do Not Disturb! The Grumpy Virtual Pet Marmot", "description": "Knock, knock! Mr. Grumpy McGrump is not the happiest, but he is definitely the most hilarious marmot in the neighborhood. Knock the door, tap the windows and ring the bell to check the funniest reactions from Mr. McGrump. Just don’t get caught!<br/><br/>Play tricks to see dozens of reactions from Mr. McGrump! Kids love it!<br/><br/>COLLECTIBLE SOUVENIRS<br/>Collect surprise souvenirs from Mr. McGrump! Each tap adds a little to the Annoy-o-Meter and every time you reach the top you get a souvenir to keep forever! Can you get them all?<br/><br/>NEW DOOR BELLS<br/>Each tap also gives you coins that you can use to get new fun door bells sounds and colors. Try all of them!<br/><br/>WHAT PEOPLE ARE SAYING?<br/>“... it’s so funny! Makes me want to tap it all day long!”<br/>“Can’t get enough of Mr. McGrump! You’re sure to have a great time discovering his tricks.”<br/>“I’ve never found marmots particularly amusing, but this one is so much fun!”<br/><br/>HIGHLIGHTS<br/>√ Perfect to entertain children (and adults too, why not?)<br/>√ Dozens of funny tricks and reactions<br/>√ Collectible souvenirs<br/>√ Different doorbells<br/>√ Fun and cute illustrations<br/>√ Cats and dogs are over. Marmots are awesome!<br/><br/>Disclaimer: While this App is completely free to play, some additional content can be purchased for real money in-game. If you do not want to use this feature, please turn off in-app purchases in your device's settings. <br/><br/>Like our page on Facebook and be the first to know about our upcoming games and updates! http://fb.com/tappshq", "metacritic": null, "released": "2013-07-03", "tba": false, "updated": "2019-10-22T14:31:08", "background_image": "https://media.rawg.io/media/screenshots/e37/e379cb1759f152eedeb3a7cb8ca7a68c.jpg", "website": "http://games.tapps.com.br", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 136, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tapps Tecnologia da Informação Ltda."], "genres": ["Simulation", "Family"], "publishers": ["Tapps Tecnologia da Informacao LTDA."], "esrb_rating": null}