{"id": 671792, "slug": "acattag", "name": "ACATTAG", "name_original": "ACATTAG", "description": "<p><strong><strong>Take DNA scans of the creatures around you, and then synthesize new creatures using their combined DNA to solve puzzles!</strong></strong></p>\n<p><strong><em>Synthesis is super buggy</em></strong><strong><em>- I've added a cheat in case it's too finnicky to progress: Press SELECT (C in browser) to open any gate.<br/></em></strong></p>\n<p><em>(Press Z to jump, X to interact OR download ROM and play in own emulator!)<br/></em></p>\n<p><em>To synthesize a new creature:</em></p>\n<p><em>1. Scan smaller creatures in the environment for parts</em></p>\n<p><em>2. Interact with the synthesis machine in certain rooms<br/></em></p>\n<p><em>3. Select a creature you scanned from the top row using the Interact button. A secondary cursor should stay on it if it's selected properly</em></p>\n<p><em>4. Select a slot of the new synthesis creature's body part. Moving the cursor all the way to the right or left will go to the cross, which has empty slots for each limb. When you hit the Interact button, it will change that slot to the scanned part you selected.<br/></em></p>\n<p><em>5. Hit right on the D-Pad until you get to the Synthesize button, click Interact, and your new creation will synthesize!<br/></em><br/></p>\n<p>For GBJAM9 / GBCompo 21</p><p>If you're here from the GBCompo rather than GBJam, please check the github link below for the latest release (Rom file is in releases OR bin)! (If you're here from the GBJam and you look at them make sure your ratings are still based on the older version here on itch!)<br/></p>\n<p>Click here to view the source code on github!<br/><br/>I didn't really manage to finish in time, but It's been a huuuge learning experience.<br/>I've never developed for the Game Boy (or coded in C at all really) before, so all things considered I'm kinda happy with how much I did get<br/></p>\n<p> Not to mention this was kind of an ambitious idea to begin with<br/></p>\n<p>Big thanks to  Zalo and the other folks in the GBDK discord for help!</p>", "metacritic": null, "released": "2021-09-28", "tba": false, "updated": "2021-10-01T07:06:43", "background_image": "https://media.rawg.io/media/screenshots/177/17714851b79e7be8aa567d463fc2541f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 182, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["selkie"], "genres": ["Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}