{"id": 671779, "slug": "fallstar-itch", "name": "Fallstar (itch)", "name_original": "Fallstar (itch)", "description": "Controls:\r\n<p><em>(Controls can be rebound from the Settings menu.)</em></p>\n<ul><li>Arrow keys - D-pad</li><li>Z - A</li><li>X - B</li><li>C - Start</li><li>V - Select</li></ul>\r\nA statement from the Video Memories Project:\r\nSince wrapping up restoration work on <strong>Witch Machine</strong> back in 2019, the Video Memories Project's inbox has been full of messages from people offering to send us builds of unreleased Game Boy games on which they once worked.\r\nWhile we can't respond to every message we receive — and we don't have the resources to restore every build we're offered — a team member will always reach out to you if we're interested in your unreleased game build.\r\nAs an apology for our radio silence over the past year, we wanted to take this opportunity to finally release a game that we've been working hard to restore!\r\n<strong>FALLSTAR</strong> was developed by \"Team Slime,\" a group of friends trying to make an arcade shooter that would outshine the very basic ports of big-name arcade titles like Space Invaders and Galaga, which dominated the genre on the Game Boy.\r\nUltimately, the game's publisher annulled their contract. A company representative explained that they had no interest in challenging industry titans behind the games that Team Slime wanted <strong>FALLSTAR</strong> to take on. Discouraged from putting more time, effort, and money into the game, the friends cut their losses, halting work on <strong>FALLSTAR</strong> in the final months of its development and dissolving Team Slime as a corporate entity. \r\nThere has been plenty of innovation in the handheld arcade shooter space in the three decades since the Game Boy was released, but our team members keep going back to <strong>FALLSTAR</strong>. Sometimes it's to try different crew member abilities; other times, it's to take down the bosses that punctuate the game's intelligently generated stages.\r\nHaving played the game so much ourselves, we felt compelled to restore and release <strong>FALLSTAR</strong> for everyone else to enjoy, too!\r\nCredits:\r\n<ul><li><strong>Character art and animation </strong>- austinbrook (@austindotorg), jane underscore (@janederscore), victoria lacroix (@arachonteur)</li><li><strong>Character design </strong>- austinbrook, victoria lacroix, mabel mabel</li><li><strong>Cover art</strong> - austinbrook </li><li><strong>Fake ad copy </strong>- blues (@blues_turn_gold)</li><li><strong>Gilmore Girls expert </strong>- austinbrook</li><li><strong>Portrait art </strong>- gwen lawson (@reziarts), sid vesper</li><li><strong>Programming</strong> - victoria lacroix</li><li><strong>Audio </strong>- austinbrook, victoria lacroix</li></ul>", "metacritic": null, "released": "2021-09-28", "tba": false, "updated": "2021-10-01T07:03:23", "background_image": "https://media.rawg.io/media/screenshots/833/83395f9e5f6ce86e4ee7eb618ee1fb48.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 59, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["victoria lacroix"], "genres": [], "publishers": [], "esrb_rating": null}