{"id": 6717, "slug": "inks", "name": "INKS.", "name_original": "INKS.", "description": "<p><strong> App Store Best of 2016 </strong><br />\n<strong> Apple Design Award Winner 2016 </strong><br />\nFrom the makers of BAFTA-winning Lumino City comes INKS.<br />\nINKS updates pinball for a new generation. It combines the joy of pinball with skilful tactical challenges, and allows you to create wondrous works of art as the ball smashes around the canvas.<br />\nBlocks of colour burst like beautiful fireworks across the surface, building up in vivid layers and recording a visual history of your game as you perfect your score.<br />\nFEATURES:<br />\n- Beautiful and elegant design<br />\n- Over 100 unique tables to play<br />\n- Perfectly balanced gameplay<br />\n- Each canvas tells the story of your game<br />\n- Share your favourite levels and high scores<br />\nIf you&#39;re enjoying INKS and want to extend the experience further you can also buy Powerups - slow-mo &#39;Precision&#39; aim, and the &#39;Stopper&#39; to prevent you from losing the first precious Gold Ball.<br />\n“Amazing looking... vibrant, full of life. Are we excited about this.” Pocket Gamer<br />\nInspired by artists like Miro, Matisse, Jackson Pollock and Bridget Riley, each table becomes a unique work of art, sculpted by the player as they fire an ink covered ball around the canvas.<br />\nWith State of Play’s creative flare and skill at crafting beautifully elegant gameplay, INKS offers something new: art and gameplay as one, for everyone.</p>", "metacritic": 77, "released": "2016-05-04", "tba": false, "updated": "2023-04-22T17:01:07", "background_image": "https://media.rawg.io/media/screenshots/988/988fd70f9c1d84907f4f9f7cfe8db690.jpg", "website": "http://inksgame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 5, "beaten": 3, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 4, "suggestions_count": 60, "game_series_count": 0, "reviews_count": 4, "platforms": ["iOS"], "developers": ["State of Play Games"], "genres": ["Arcade", "Casual", "Puzzle"], "publishers": ["State of Play Games"], "esrb_rating": null}