{"id": 67184, "slug": "popscene-backstage-pass", "name": "Popscene (Backstage Pass)", "name_original": "Popscene (Backstage Pass)", "description": "This special \"VIP\" edition of the music industry sim allows you to enjoy it at its best with no interruptions - plus a \"Backstage Pass\" that invites you behind the scenes to save your changes to all 150 characters!<br/><br/>Bring your music collection to life with animated performances as you embark on a career in the industry. Form your own band by recruiting talent from over 100 artists across 6 unique labels. Then record hits that will top the charts and take them on the road to over 20 different venues - complete with real reviews that scrutinize your strengths and weaknesses. With an endless schedule of possibilities before you, and an ever-evolving industry to immerse yourself in, Popscene captures the highs and lows of music in the palm of your hand!<br/><br/>* Please note that this game's use of MP3s may not be compatible with some devices. If this affects you, consider turning off MP3 music in the options.<br/><br/>PLAYING GUIDE:<br/>Popscene divides the music making process into entertainment (represented by stars) and artistry (represented by hearts). As in real life, popular music is more likely to shoot up the charts and draw fans - but without substance, the success may be short-lived. Each of the game's many artists has the following attributes that influence this process:<br/><br/>- POPULARITY is the artist's ability to draw fans to entertaining content.<br/>- REPUTATION is their ability to draw fans to artistic content.<br/>- PERFORMANCE is their ability to perform entertaining songs live.<br/>- TALENT is their ability to perform artistic songs live.<br/>- PRODUCTION is their ability to compose entertaining music.<br/>- WRITING is their ability to compose artistic music.<br/>- HAPPINESS is the pleasure they currently get from their work.<br/>- ATTITUDE indicates how likely they are to either contribute or cause trouble.<br/><br/>Each week, depending on the size of your team and their collective attitude, new songs may be recorded. Each member of the team contributes their score to a new song, and whoever scores the highest will be credited with making it. Members who are dedicated backstage staff will contribute twice instead of once - increasing the chances of a good song being written.<br/><br/>Once songs exist, it is the on-stage performers who must bring it to life. As with writing, each band member on stage contributes their score and the highest determines how well the song was received in each category. This time, it is the \"frontman\" who gets to contribute twice instead of once - so consider who is at the forefront.<br/><br/>The overall rating for a show is the average of all the songs performed - albeit slightly more generous so that perfection is not required. This is also true of album reviews. A 5-star performance may consist of consistent 4-star contributions. Reviews are where your performances feed back into the stats that produced them, because each attribute will rise or fall to reflect what just happened.<br/><br/>When booking venues, you must consider how much it will cost versus how much you are likely to recoup. Tickets are sold at $5 per song so it depends how long your set is. You will receive a percentage of this revenue, and must then use that to pay your employees and any other expenses. Singles are sold at $1 each whereas albums are sold at $1 per song for a maximum of $10. If you have a week of inactivity, you may find that you make a loss because of the expenses of your lifestyle (which reflects your wealth).<br/><br/>I regret there is more to this game than I could ever explain here, so enjoy figuring some things out for yourself!", "metacritic": null, "released": "2014-02-06", "tba": false, "updated": "2019-07-29T10:37:35", "background_image": "https://media.rawg.io/media/screenshots/823/823602670d9f117e2942b08316714279.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 268, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["MDickie"], "genres": ["Simulation"], "publishers": ["MDickie"], "esrb_rating": null}