{"id": 67183, "slug": "balloon-party-tap-pop-balloons-free-game-challenge", "name": "Balloon Party - Tap & Pop Balloons Free Game Challenge", "name_original": "Balloon Party - Tap & Pop Balloons Free Game Challenge", "description": "Let's agree that a birthday party without balloons can’t really be called a party! If you agree that balloons are the essence of a birthday party, then lets’ pop all of them in Balloon Party, the game!<br/><br/>So many colors, so many shapes, so many balloons to burst! Do you think you can pop all of them? Burst the highest numbers of balloons you can! Have fun and reach the highest score at the same time!<br/><br/>Balloon Party is an amusing and intuitive game, both kids and adults will love it! Keep your attention to match colors and mainly watch out for special balloons, that will give you extra points to boost your score.<br/><br/>Burst all kinds of balloons such as cute little pets, sports items, funny monsters and delicious candies! Crush all of these to get to the great final of hitting a piñata! Yes, that's right: a PIÑATA filled with yummy candies!<br/><br/>HIGHLIGHTS<br/>• Designed for kids, adults, boys and girls<br/>• Assures fun for people of all ages<br/>• Beautiful graphics with cute illustrations<br/>• Easy and addictive gameplay<br/><br/>BALLOON SHAPES FOR ALL TASTES<br/>• Sports: Baseball, basketball, football and tennis ball<br/>• Scary Monsters: Zombies, skulls and Halloween pumpkins<br/>• Cute Pets: Dogs, cats, mices and octopuses<br/><br/>With Balloon Party the party never ends, download now and burst your boredom away!<br/><br/>Disclaimer: While this App is completely free to play, some additional content can be purchased for real money in-game. If you do not want to use this feature, please turn off in-app purchases in your device's settings. <br/><br/>Like our page on Facebook and be the first to know about our upcoming games and updates! http://fb.com/tappshq", "metacritic": null, "released": "2012-07-24", "tba": false, "updated": "2019-07-29T09:41:36", "background_image": "https://media.rawg.io/media/screenshots/7b5/7b52e6742e646f3a00ca8246d9684ed2.jpg", "website": "http://tappsgames.com/app/balloon-party/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 54, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tapps Tecnologia da Informação Ltda."], "genres": ["Strategy"], "publishers": ["Tapps Tecnologia da Informacao LTDA."], "esrb_rating": "Everyone 10+"}