{"id": 67196, "slug": "extra-lives-infinite", "name": "Extra Lives (Infinite)", "name_original": "Extra Lives (Infinite)", "description": "Get the most out of the zombie survival sim with this special \"Infinite\" edition! Fully unlocked as standard, you can start with a character of your creation and save your changes to all others to make the world your own. You can even choose how many zombies you start with to either dive in at the deep end or ensure a slow build. Full access to the special \"Deathmatch\" mode also gives you all the fun of slaying zombies with none of the pressure!<br/><br/>Meanwhile, the \"Survival\" mode tests how long you can last in a world full of brainless zombies and heartless humans. Develop unique relationships with 200 other characters spread across 8 warring factions - each with their own beliefs about what the problem is and how to solve it. Explore over 50 different locations on your journey to restore order to every corner of the city, with hundreds of interactive objects to help you along the way. Featuring an above-average combat system from the Wrestling Revolution series, tearing enemies apart has never been so satisfying!<br/><br/>HOW TO PLAY<br/>Players of previous games may need to take the time to adjust to the new control system, which distinguishes between the left or right hands:<br/><br/>* The RED fist buttons allow you to ATTACK from either side.<br/><br/>* The BLUE hand buttons allow you to PICK-UP or DROP with either hand (hold a direction to THROW).<br/><br/>+ Pressing BOTH buttons on either SIDE will attempt to USE what is in that hand - such as eating food or reading books (notice that some actions may cause you to swap hands to use them properly).<br/><br/>+ Pressing BOTH pick-up buttons together will COMBINE the objects you have in each hand or nearby on the ground. Both hands can also be used to pick up larger furniture so long as they are empty and there is nothing closer to handle.<br/><br/>+ Pressing BOTH attack buttons together will attempt to GRAB your opponent (press again to release or any other combination of buttons to execute moves).<br/><br/>+ DOUBLE-TAP any direction to RUN.<br/><br/>- Touch the HEALTH METER to SLEEP when your energy is low.<br/><br/>- Touch the CLOCK to PAUSE - where you can exit or access other options.<br/><br/>I regret that there's more to this game than could ever be explained here, so please look out for additional hints in the game itself.", "metacritic": null, "released": "2017-10-22", "tba": false, "updated": "2019-07-29T10:37:47", "background_image": "https://media.rawg.io/media/screenshots/6b9/6b93270c8924d7ae6c3e616f18ef523a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 244, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["MDickie"], "genres": ["Action", "Adventure"], "publishers": ["MDickie"], "esrb_rating": null}