{"id": 6719, "slug": "feed-me-oil-2", "name": "Feed Me Oil 2", "name_original": "Feed Me Oil 2", "description": "Channel oil into the gaping jaws of surreal living worlds in Feed Me Oil 2, the sequel to the groundbreaking and genre-defining Feed Me Oil. <br/><br/>This app offers in-app purchases. You may disable in-app purchasing using your device settings. See http://support.apple.com/kb/HT4213 for more info. <br/><br/>&amp;quot;Feed Me Oil 2 is a must-have and a fantastic way to start off the year.&amp;quot; – App Advice, 5/5<br/><br/>&amp;quot;A fantastic title that a lot of puzzle-lovers will really enjoy.&amp;quot; – Capsule Computers, 85%<br/><br/>SLICKER THAN YOUR AVERAGE<br/>Guide gallons of the stuff around a series of mind-bending mechanical designs using new and improved physics. Watch as the oil moves realistically around each level and through the air, water and along ice in four fun-filled chapters. <br/><br/>SLIPPERY SITUATIONS<br/>Touch and drag new tools around to experiment with windmills and fans to create the perfect solution. Try using as few tools as possible to earn a three-star rating to share with your friends.<br/><br/>MECHANICAL MONSTROSITIES <br/>Feed Me Oil 2 has been overhauled with a radical new visual style. A new mechanical look literally brings each quirky design to life like never before!<br/><br/>Game Features: <br/>• Six chapters overflowing with mind-bending puzzles<br/>• Realistic physics that react to wind, water, and ice<br/>• Fun tools including windmills, fans and more<br/>• Find new ways to solve puzzles to earn three stars<br/>• Share your highest ratings with your friends on Facebook<br/>• Play each day to unlock new gifts<br/><br/>Visit the Chillingo room on the App Store to see more of our great games: appstore.com/chillingo<br/><br/>Important Consumer Information. This app: Requires acceptance of EA’s Privacy &amp;amp; Cookie Policy and User Agreement.Contains advertisments for EA and its partners. Collects data through third party analytics technology (see Privacy &amp;amp; Cookie Policy for details). Contains direct links to the Internet and social networking sites intended for an audience over 13. Allows players to communicate via Facebook notifications. To disable see the settings in-game. <br/><br/>User Agreement : http://terms.ea.com/en<br/>Privacy &amp;amp; Cookie Policy : http://privacy.ea.com/en<br/>Visit http://www.chillingo.com/about/game-faqs/ for assistance or inquiries.<br/><br/><br/>EA may retire online features and services after 30 days notice posted on www.ea.com/1/service-updates", "metacritic": null, "released": "2014-01-02", "tba": false, "updated": "2019-10-22T14:28:23", "background_image": "https://media.rawg.io/media/screenshots/f05/f056be231de27085ffd3bccbbda6ac69.jpg", "website": "https://chillingosupport.zendesk.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 158, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["Alexander Ilin", "HolyWaterGames"], "genres": ["Family", "Puzzle"], "publishers": ["Chillingo", "Alexander Ilin"], "esrb_rating": "Everyone 10+"}