{"id": 672238, "slug": "gnome-platformer", "name": "Gnome Platformer", "name_original": "Gnome Platformer", "description": "<p>This is a retro style 3D platformer made for the 32bit jam 2021</p>\n<p><strong>-----------------------------------------------<br/>Right now there is only one level.<br/></strong>-----------------------------------------------</p><p>There's only one level because I ran out of time during the jam. At the moment the hub world (the one with floating blobs of mercury) only has one level to go to, and the portal at the end of that level just takes you back to the hub world. </p>\n<p>Next steps will be to make a UI that shows the  player's number of lives, health, number of crystals collected, and  number of Z's collected, add sound, and build more diverse levels. At  the moment there is no significance to collecting anything, but  eventually there will be. Think of the crystals like the gems from  Spyro, and the Z's like the purple crystal in from crash bandicoot. Z's  unlock levels, and collecting all the gems may unlock an alternate  ending. </p><p><strong>-----------------------------------------------</strong><br/></p>\n<p>You are a gnome who has gone to sleep and can't wake up. Each level is a dream. Find and collect the Z in each level and reach the end portal to progress. (Similar to how you progress in crash bandicoot by finding finding crystals) The game starts out with good dreams and as you near the final level they are more like nightmares. The ultimate goal is to complete the final nightmare and wake up.<br/></p>\n<p>I am undecided on the name. What do you think it should be called?</p>\n<p><strong>------    Keyboard Controls</strong><strong>    ------<br/></strong>Move: W, S, A, and D<br/>Look: Mouse<br/>Shoot: E<br/>Jump: Space Bar (hold for longer jumps)</p>\n<p><strong>------    Controller    ------</strong><br/>Move: Left Stick<br/>Look: Right Stick<br/>Shoot: RB / R1<br/>Jump: A<br/></p>\n<p><strong>Can you find the hidden bee?</strong><br/></p>", "metacritic": null, "released": "2021-09-27", "tba": false, "updated": "2021-10-01T09:17:27", "background_image": "https://media.rawg.io/media/screenshots/033/033e7c192cc5d56e520eec204d55f211.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 85, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MBDesigns"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}