{"id": 672226, "slug": "fps-game-ztau", "name": "FPS Game (ztau)", "name_original": "FPS Game (ztau)", "description": "<p>Initial release! More of a demo at the moment as there was a lot I didn't get to before the end of the jam. Made in the 2 weeks during. </p><p>2 levels, each their own little worlds to explore. Level 2 is a lot bigger than the first, with no actual win states at the moment. Level 2 has a lot of vertical platforming fun if you can find your way up! Hint: Jump Upgrades help. Remember to multi-jump and hover (hold space).</p><p>Just started learning to program and develop games, so this is my first shot. Made in godot, mostly from scratch using blender, photoshop, and despration.</p>\n<p>Everything was modelled/animated/coded/made by me, excpet for some stock sound effects and the fonts and some shaders . </p>\n<p>I tried to make it my dream Quake/Doom mashup, with a dose of craziness. Will definitely be updating this in future, and is a lot of fun as it is currently.<br/></p>\n<p>Some tips:<br/>-Try to use open space to your advantage. You can also alert small groups of enemies to make encounters easier.<br/>-Every weapon is useful! Even the melee one. <br/>-Experiment with weapons, shields and moving in and out of enemy fire. <br/>-There's also some hidden areas here and there, mainly in the second level. Try upgrading your jump and glide and going up!<br/>-You can also use E to instantly kill an enemy, or G to enable god mode to have a more chill experience. Shields will still bounce back projectiles while God Mode is on :D</p>\n\n<p>Fun facts:<br/>-Shields will block damage while active. They also deflect projectiles.<br/>-So do sword swings. <br/>-Oh, and enemies hate eachother as much as they hate you. See if you can get em to kill eachother.<br/>-Each jump resets your glide time left.<br/>-Oh! Push E to open doors.<br/><br/></p>\n<p>Good luck!</p>", "metacritic": null, "released": "2021-09-27", "tba": false, "updated": "2021-10-01T09:13:55", "background_image": "https://media.rawg.io/media/screenshots/e0c/e0cf1e3fd440e208fbcdcb819be183b6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ztau"], "genres": ["Action"], "publishers": [], "esrb_rating": null}