{"id": 672348, "slug": "dreams-of-the-elements", "name": "Dreams Of The Elements", "name_original": "Dreams Of The Elements", "description": "The world is made up of the four natural elements: Water, Wind, Fire, and Earth.  These elements are kept in perfect balance by mystical fairies.  However, this long-standing balance is currently being threatened by dastardly forces!<br/>\n<br/>\r\nJoin Aria, Lyle, Gray, and Kaze as they journey across their world to save it from a maniacal plan set into motion by a group of devious and unpredictable villains!<br/>\n<br/>\r\nDreams Of The Elements is a retro-themed JRPG inspired by the classics of the 90's.  As the player, you will control a team of four party members, each identifying with one of the four natural elements of water, wind, fire, and earth.  Over the course of the game each party member will level up and learn new spells, but there are also fairies hidden in caves and lakes scattered throughout the overworld that will gift the party members with a choice of one of two special abilities to be used in battle.  The player can only choose one ability from each fairy per playthrough of the game, giving the game some replayability if the player wants to try different skills upon a second or third playthrough.<br/>\n<br/>\r\nAlso hidden throughout the overworld are optional dungeons and boss fights to be found.  Akin to classic PS1 JRPGs, exploring the overworld beyond where the game tells the player to go will reward the player with optional dungeons and boss fights, including superbosses and dungeons even tougher than the final dungeon of the main story itself.  Of course completing these dungeons and defeating the bosses will result in better gear and items for the player!<br/>\n<br/>\r\nThe story itself focuses on a group of four warriors who wish to save their world.  While the plot seems fairly straightforward upfront, there is a very deep, rich lore supporting a running story that encompasses multiple themes such as friendship, determination, sorrow, and pain.  The story quickly develops into a deeper experience in which the heroes and villains see character progression and development,<br/>\n<br/>\r\nWhether you enjoy a deep story or personalizing gameplay abilities, Dreams Of The Elements offers something for every JRPG fan!  Thank you for taking the time to look into this game, and I hope you enjoy the journey that lies ahead!", "metacritic": null, "released": "2021-10-01", "tba": false, "updated": "2021-10-04T02:30:12", "background_image": "https://media.rawg.io/media/screenshots/b87/b87b21c5c60d2ba0a236a05b4f3f6e7c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 263, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Nicholas Stephens", "Crusader's Fellowship"], "genres": ["Adventure", "RPG"], "publishers": ["Crusader's Fellowship"], "esrb_rating": null}