{"id": 672399, "slug": "olden-card-game", "name": "Olden: Card Game", "name_original": "Olden: Card Game", "description": "Olden: Card Game is designed in such a way that every battle will give a different and unique experience. A mix of overpowered and weak cards in your hand and deck will constantly test you and your opponent ability to adapt and make the best out of the current situation. In order to give players a form of individuality and theory crafting outside the match, the game offers unique talent systems per every avatar that will help the player with various perks.<br/><br/><br/>In this battle of entities there is no deck building and no card collecting, so all you need to do in order to enter the match is to choose your avatar and hit the play button.<br/>For now, there is: Entity of Light, Death, Chaos and Life.<br/>Your entity will give your troops a unique bonus during the whole length of the game.<br/><br/><br/>Basic rules<br/>To win the game, the player needs to harvest <strong>300 value points</strong>. Your entity receives value points whenever you sacrifice your own cards.<br/>Once your turn begins, you receive 2 tokens: an action token and a draw token. Your options are to:<br/><br/>- Play a card and build your board presence<br/>or<br/>- Engage in combat by attacking one of your opponents’ cards<br/>or<br/>- sacrifice your own card, so you can harvest its current value.<br/><br/>Doing any one of these three things will consume your action token.<br/>To consume your draw token, simply click on the main deck to draw a card, and that's it.<br/><br/><br/><br/>For now, there are 3 card abilities, effect, passive and combat.<br/><br/><strong>Effect</strong> is something that will happen only once, at the moment a card is played by the player. A card’s effect does not trigger in cases where you summon or resurrect it with other cards. Effects take place only if they are played directly from your hand.<br/><br/>A card’s <strong>passive</strong> ability will be present so long as the chosen card is on the board. Once the card with the passive ability is removed from the board, its passive ability will go away along with it.<br/><br/><strong>Combat</strong> ability is something that will only trigger once that card engages in combat with an enemy card.<br/><br/><br/>As mentioned, you can use your turn to perform an attack action and engage in combat. To perform an attack, simply place your card on the top of the opponent card. After one turn, your card value number will sink its value into the opposing card. If your card has enough value to destroy your opponent’s card, it will do so, and then it will return to your side of the board.<br/>If your card does not have enough value to destroy an opponent’s card, it will do its damage after one turn, and then be destroyed.<br/>You can engage in combat with cards that are already on the board, or with the cards from your hand.<br/>One card can be attacked by multiple cards at the same time.<br/><br/><br/><br/><br/><br/>To win the game, a player needs to harvest 300 value points. Players can harvest value points by sacrificing their own cards that are not currently in combat. To perform a card sacrifice, select your card, and then click on its respective altar. Performing a card sacrifice will consume your <strong>action token</strong>.<br/><br/><br/><br/><br/><br/><strong>Dandy Rat Studio</strong> takes a very strong stance against microtransactions, pay to win attitude and other predatory business practices. You are more than welcome to visit us on our official website and subscribe to our newsletter, so you can receive important announcements, special events and gifts such as: beta keys, high-res digital art, unique skins and many more things.<br/>We thank you for having the time to check out our first game.", "metacritic": null, "released": null, "tba": false, "updated": "2021-10-04T03:11:54", "background_image": "https://media.rawg.io/media/screenshots/714/714e05e21faf9a58bd37118479089c60.jpg", "website": "https://www.dandyratstudio.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 277, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dandy Rat Studio"], "genres": ["Adventure", "Strategy", "Casual", "Indie"], "publishers": ["Dandy Rat Studio"], "esrb_rating": null}