{"id": 672371, "slug": "distortion-vr", "name": "Distortion VR", "name_original": "Distortion VR", "description": "The world of Distortion exists in a Cyberpunk mega city in the near future.  It is a world  where technology  is being abused and the citizens are being controlled by thought from birth.  What's real is uncertain.  The population's perception of reality is being controlled unknowingly by FA Corporation.  Rumor has been said this is being done using a form of artificial neural implants initiated at birth.  The implants are controlled by FA Corp's main data servers to control the significant actions taken by individuals.  \"Free will\" and \"liberty\" have been engineered and distributed at scale to the masses.  These actions effect everything from political, career and financial decisions throughout the implant sector of society.<br/><br/>Uncover the secrets of FA Corporation's \"Thought Program\" and destroy their central data network located in the highly secured corporate headquarters.  Because of the various distortions, putting the pieces back together will not be easy on this journey but perhaps awakening a few key people could set the course for a new stage of freedom.<br/><br/>Experience a massive Cyberpunk world &amp; experience the deep complex storyline.<br/>Explore the immersive detailed Cyberpunk world of Distortion including city streets, flying car sequences, dark alleyways, building hallways, bars &amp; nightclubs, rooftops, subway trains, metro stations &amp; many new levels in development. <br/>Choose from a variety of high tech Cyberpunk weapons ranging from pistols to automatic weapons.<br/><br/>Built from the ground up for VR, (PSVR, Oculus Rift, Quest, HTC Vive, Windows Mixed Reality &amp; Steam VR)<br/>Choose your play style with a variety of control option including 2 handed motion controls, official 3D Rudder support, Aim controller support (PSVR) &amp; standard gamepad.<br/>A full length campaign with additional endless modes <br/>Discover the parallel universe of mind &amp; audio frequency<br/> Exclusive music soundtrack by Leon Switch/Kryptic Minds", "metacritic": null, "released": null, "tba": false, "updated": "2021-10-04T02:47:47", "background_image": "https://media.rawg.io/media/screenshots/bf2/bf2199e670b2be010c9595936bf92aba.jpg", "website": "http://distortionvr.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 384, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["OutSource Studios"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["FutureMental Games"], "esrb_rating": null}