{"id": 672354, "slug": "cry-of-athena-vr-battle-simulator", "name": "Cry of Athena VR Battle Simulator", "name_original": "Cry of Athena VR Battle Simulator", "description": "Cry of Athena is sandbox battle simulator for VR where you can set up battles, watch them fight, intervene with god powers as a divine entity or even join in the battle yourself as a mortal on the battlefield. It features nuanced AI behaviors as well as a wide range of methods for combat and destruction.<br/><br/><br/><ul><strong>Features:</strong><li> Create your own battles! <br/></li><li> Fight on the battlefield as a mortal, play as a god, or simply spectate the battle - the choice is yours!<br/></li><li> Destructible and interactive environments such as breakable buildings or trees that can be used as weapons.<br/></li><li> A variety of AI types to create your battles including the minotaur, siege weapons, and modern day soldiers.<br/></li><li> Command your army down to the individual level to follow, charge, or let them act on their own accord!<br/></li><li> Choose from a large arsenal of weapons and combat mechanics - fight with sword or bow, guns or cannons, or as a massive all-mighty god. <br/></li><li> Mission mode where you can use strategy and tactics to fight the forces of Ares and overcome battle scenarios.</li></ul><br/><br/><br/><h3>Join the community on our Discord channel by clicking the banner below to follow development, talk with the developers, keep up with opportunities to participate in testing, and give your own ideas and suggestions!</h3><br/><br/><br/><br/><br/><br/><br/><br/><br/><strong>Below is the Youtube Channel where development logs and gameplay videos will be posted, as well as the official Cry of Athena Facebook and Twitter pages!</strong><br/><br/>", "metacritic": null, "released": null, "tba": false, "updated": "2021-10-04T02:34:38", "background_image": "https://media.rawg.io/media/screenshots/a67/a6794140d9ee8815371e876c5f8953ed.jpg", "website": "https://www.simulated-minds.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 564, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Simulated Minds"], "genres": ["Action", "Strategy", "Simulation", "Indie"], "publishers": ["Simulated Minds"], "esrb_rating": null}