{"id": 672390, "slug": "legends-of-murder-collection", "name": "Legends of Murder Collection", "name_original": "Legends of Murder Collection", "description": "<strong>Magical Murder Mysteries</strong><br/><br/>When a murder is committed under mysterious and supernatural circumstances, the Inspector arrives on the scene, ready to interrogate witnesses, decipher riddles, and fend off attackers seeking their next victim. Play as the Inspector to piece together each mystery as you gather clues and expand your inventory. Ready your spyglass and sword as you take on these two perilous and puzzling investigative murder mystery RPGs from Softdisk Publishing.<br/><br/>Legends of Murder: Volume 1 - Stonedale Castle<br/>The King has been murdered! You are the Inspector, a cunning sleuth with magical abilities who has been summoned by the King’s former elven advisor from across the sea to investigate the killing. Navigate the halls of Stonedale Castle, question its inhabitants, and gather clues and items to help you uncover the identity of the murderer. But keep your sword and spellbook at the ready, as there are some who will stop at nothing to prevent you from discovering the true culprit.<br/><br/>Legends of Murder II: Grey Haven<br/>The Inspector is called upon to investigate the murder of Eryl Drafe, a wizard’s apprentice who was found dead at the school of wizardry. The murderer still wanders the town of Grey Haven and must be discovered before another victim turns up. You once again take control of the Inspector to interview witnesses and potential suspects, find clues linked to the crime, solve cryptic puzzles, and battle assailants. Explore Grey Haven and untangle the mystery of the killer’s identity!<br/><ul><li>Explore Stonedale Castle and the town of Grey Haven in an overhead perspective, with detailed text descriptions which bring life to the world.<br/></li><li>Gather clues and evidence by speaking with numerous characters, searching the environments, and defeating a wide variety of enemies.<br/></li><li>Equip the Inspector with weapons and armor you find along the way and engage your opponents with physical and magical attacks.</li></ul>", "metacritic": null, "released": "1988-12-31", "tba": false, "updated": "2023-02-08T10:50:14", "background_image": "https://media.rawg.io/media/screenshots/a55/a551ec8232491d26a7c5897f6aa78187.jpg", "website": "http://www.ziggurat.games", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 8, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 186, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Softdisk Publishing"], "genres": ["Adventure", "RPG"], "publishers": ["Ziggurat", "Ziggurat Interactive"], "esrb_rating": null}