{"id": 672337, "slug": "ninja-express", "name": "Ninja Express", "name_original": "Ninja Express", "description": "▲You are a ninja<br/>\r\nBut in daily life, you will act as a courier,<br/>\r\nResponsible for delivering the items entrusted by the customer to the shipper.<br/>\r\nThis not only protects your identity, but also collects information that is essential for ninjas.<br/>\n<br/>\r\nThis is a simple task, but there are still some troubles to be solved and some rules to be followed.<br/>\n<br/>\r\n● Don't provoke the police. If you run a red light, the police will notice you.<br/>\r\nStay away from the police car, your unique ninja temperament is fascinating.<br/>\r\nBut if a policeman is fascinated by you, that is a bad thing.<br/>\n<br/>\r\n● Take care to avoid dangerous objects, such as burning gas canisters.<br/>\r\nAlthough you are a great ninja, the gas tank also hides dangerous strength.<br/>\n<br/>\r\n● Don’t be distracted by electronic billboards, these things will waste your precious time.<br/>\n<br/>\r\nOkay, let's go, the customer has something important to entrust to you.<br/>\n<br/>\r\n------------------------------------------------------------------------------------<br/>\r\nHere are some rules you need to know:<br/>\r\nYou can switch lanes of different heights by simply jumping, or avoid dangerous objects in the game, such as traffic lights.<br/>\r\nIf you hit the traffic light more than 10 times, the mission will fail<br/>\r\nIf you hit a gas tank, you will be sent to the hospital for rescue, causing the mission to fail<br/>\r\nIf you hit a police car, you will be arrested by the police, causing the mission to fail<br/>\r\nIf you hit an electronic billboard, you will be fined, resulting in extended mission time", "metacritic": null, "released": "2021-09-30", "tba": false, "updated": "2021-10-04T02:22:36", "background_image": "https://media.rawg.io/media/screenshots/445/445451b9b5711e172927fc9e9a0fce0f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 323, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Beast Of World"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Beast Of World"], "esrb_rating": null}