{"id": 672368, "slug": "charlie-the-legend", "name": "Charlie | The Legend", "name_original": "Charlie | The Legend", "description": "Equip yourself with the best weapons and prepare to face your worst fears...<br/>\r\n\"Charlie | The Legend\" aims to become a \"must have\" for all those who enjoy multiplayer horror games.<br/>\r\n\"Charlie\" is an asymmetric multiplayer horror game in which 4 survivors must face a devilish doll possessed by a demon.<br/>\r\nIt's up to you! Play as Charlie and defeat the other players or face Charlie as a survivor.<br/>\n<br/>\r\nPlay with your friends and try to defeat Charlie and take him back to hell or play as Charlie and prevent the survivors from escaping.<br/>\n<br/>\r\nAs a survivor you have two ways to end the game successfully. Escape from the map alive or defeat Charlie.<br/>\r\nTo escape from the map you will have to follow several steps that will be different depending on the map you are in. Knowing how to play your cards correctly and not wasting time will be the key to achieving this.<br/>\r\nIf time runs out or you don't see the possibility of escaping from the map, there is also the option of defeating Charlie.<br/>\n<br/>\r\nBy playing as Charlie you will have all the powers of a dark demon in your hands. But obviously you'll have to save your strength so that you don't stand unarmed in front of players who decide to take on you.<br/>\r\nYou will also have the extra help of the \"Scavengers\" that you can summon at certain points on the map and that will keep the survivors \"busy\" while you carry out your evil plans.<br/>\n<br/>\r\nWill you accept the challenge to become a true legend?", "metacritic": null, "released": "2021-10-01", "tba": false, "updated": "2021-10-04T02:45:00", "background_image": "https://media.rawg.io/media/screenshots/793/793bb3202d510c601c3a06a40618aff7.jpg", "website": "http://www.charliethelegend.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 30, "ratings_count": 0, "suggestions_count": 399, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Fireblitz Games"], "genres": ["Action", "Massively Multiplayer", "Indie"], "publishers": ["Fireblitz Games"], "esrb_rating": null}