{"id": 672405, "slug": "halloween-stories-horror-movie-collectors-edition", "name": "Halloween Stories: Horror Movie Collector's Edition", "name_original": "Halloween Stories: Horror Movie Collector's Edition", "description": "The nightmare continues with another new tale to terrify! <strong>Elephant Games</strong> proudly presents Halloween Stories: Horror Movie!<br/><br/>Nobody believed Ellie when her three best friends were pulled into a cursed horror movie on Halloween night. But two years later to the day, the infernal tape has returned, and now it’s up to Ellie to rescue her long-lost friends and survive the very real ghosts, creeps, and slashers behind the movie magic! Are you brave enough to guide Ellie through three terror-packed films where danger lurks in every dark corner? There’s only one way to find out!<br/><br/>This is a special Collector’s Edition release full of exclusive extras you won’t find in the standard version. The Collector’s Edition includes:<br/><br/>o\tJoin Detective Jessica Holmes in investigating strange events at the local high school.<br/>o\tSearch for spooky hidden figures, puzzle pieces, and morphing objects. Explore more in the Secret Room!<br/>o\tReplay your favorite HOPs and mini-games - and earn more achievement awards!  <br/>o\tRemember the high notes of the game! Save and enjoy wallpapers, concept art, and music. <br/>o\tKeep your adventure on track with the strategy guide!<br/><br/>This is a Hidden Object Puzzle Adventure game, meaning a specific genre of story-driven, point &amp; click adventures. Throughout the game, players are tasked to find a list of objects hidden within a particular scene, and to occasionally complete various mini-games/puzzles.", "metacritic": null, "released": "2021-10-01", "tba": false, "updated": "2021-10-04T03:16:15", "background_image": "https://media.rawg.io/media/screenshots/cbf/cbf2870384a20fc80de14a7813a23a6e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 4}, "playtime": 4, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 513, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Elephant Games"], "genres": ["Adventure", "Casual"], "publishers": ["Big Fish Games"], "esrb_rating": null}