{"id": 672463, "slug": "mad-fut-22-draft-pack-opener", "name": "MAD FUT 22 Draft & Pack Opener", "name_original": "MAD FUT 22 Draft & Pack Opener", "description": "Welcome back to Madfut! We have improved the newest version of our FUT app in every way. Get ready for even more new modes and more exciting content than ever before. The ’22 FUT season officially starts now, and we can’t wait to make it the best one yet.<br/><br/>Big new additions in Madfut 22:<br/>• SBC Groups: complete collections of interesting Squad Building Challenges to earn elite rewards and unique cards.<br/>• FATAL My Club: use cards from your own collection to compete in eight Rating Series, each one with a different maximum rating requirement. Improve and change your teams whenever and however you want. New Rewards every week.<br/>• FATAL Draft: play Fatal using the teams you build in Draft. New Rewards every week.<br/>• Online Multiplayer: now you can choose to play Fatal against other users online.<br/><br/>Enjoy the improved modes and features you already know and love:<br/>• Build Squads and Drafts, and win knock-out Draft Tournaments.<br/>• Open Packs and Player Picks.<br/>• Play Fatal Classic mode: upgrade your team from Bronze to all-Special.<br/>• Complete Objectives to earn cards and other rewards.<br/>• Trade Cards and Packs with other players.<br/>• Complete Pack and Draft Of The Day challenges, and daily SBCs.<br/><br/>New content every day. Plus, several unique Objectives and SBC Card Types are coming soon. And of course, there will be multiple new Modes throughout the year.", "metacritic": null, "released": "2021-10-01", "tba": false, "updated": "2021-10-04T04:00:33", "background_image": "https://media.rawg.io/media/screenshots/9d3/9d35c10068569950fc6dad70fbe46424_b6ZPmzv.jpg", "website": "https://www.madfut.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1, "toplay": 1, "playing": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 290, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Madfut"], "genres": ["Sports", "Casual"], "publishers": ["MEDFUT, OOO"], "esrb_rating": "Everyone 10+"}