{"id": 672452, "slug": "game-theory-at-christmas", "name": "Game Theory At Christmas", "name_original": "Game Theory At Christmas", "description": "<strong>✱This game requires internet to play normally</strong><br/><strong>✱The English of this game is made with Google Translate.  My apologies.</strong><br/><br/>In order to participate in the game competition, let's make a game with the theme of Game Theory. Originally thought so, but due to various complicated reasons. In the end it became a spoof game.<br/><br/>Because the game operation method is very intuitive and simple, I won’t introduce it here.<br/><br/><br/>The game contains a total of six non-zero sum games:<br/><br/>1. Guess the mean 2/3<br/>Enter a number from 0 to 100 .The one who enters the number closest to the average 2/3 of all people’s numbers will get 1,000 coins.<br/><br/>2. Dollar auction<br/>Enter a price of 0~1000 to bid for some coins. The person who bid the highest price wins the bid, but everyone has to pay their bid.<br/><br/>3. Traveler's dilemma<br/>Enter a number from 0 to 2,000 coins. The one who enters the smallest number will get the same amount of money.<br/><br/>4. Prisoner's dilemma<br/>All members cooperate, all get 1,000 coins, one betray, traitors get 500 coins, plural betray, all lose 500 coins.<br/><br/>5. Free rider problem<br/>Choose ignore or resist, ignore loss of 300 coins, resist loss of 1,000 coin and terminate the round.<br/><br/>6. Ultimatum Game<br/>Enter 0~500 twice to decide how much money distributed to others. If someone refuses to distribute, you will lose 1,000 coins.<br/><br/><br/><br/>The game will revolve around the above game. The accumulated star coins or snow coins can be used to upgrade characters. Each character can have different effects according to the level. Only by fulfilling the conditions of the level can you advance the plot, so you need to adopt a strategy that can meet the conditions of the level without losing too many star coins and snow coins. <br/><br/>Some levels require the character to reach a certain level to pass the level,  so when you are stuck in a level, you can replay the previous level and accumulate star coins to upgrade your character.", "metacritic": null, "released": "2021-10-31", "tba": false, "updated": "2021-10-04T03:50:13", "background_image": "https://media.rawg.io/media/screenshots/bdc/bdc2814dce052ccf7080e8fd24282f26.jpg", "website": "https://asd414831.wixsite.com/theory/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 182, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["不重要", "番茄紅貓", "tan90"], "genres": ["Strategy", "Casual", "Indie"], "publishers": ["不重要"], "esrb_rating": null}