{"id": 672410, "slug": "dan-sisals-501-darts-trainer", "name": "Dan Sisal's 501 Darts Trainer", "name_original": "Dan Sisal's 501 Darts Trainer", "description": "Hello and thanks for checking out my Steam page! I'm Dan Sisal - an avid darter who's worked in the video game industry for the better part of the last decade. I created this trainer as a hobby project for personal use, specifically to help improve my real-life darts game in an entertaining way that allows me to memorize and practice checkouts for 501 whenever I can't physically get to the oche.<br/><br/><br/>I've had so much interest from other players in the darting community that I've finally decided to polish my work and turn it into a full-fledged product instead of keeping all the darting goodness to myself.<h3>GAME FEATURES</h3><br/><ul><li><strong>Arcade darts gameplay with all the options needed to simulate your favorite 01 games!</strong> Play 301, 501, 701, 901, 1101, and 1501. Adjust match duration via \"leg\" and \"set\" requirements, and apply optional rules such as \"double in\" and \"win by two clear legs\".</li></ul><ul><li><strong>Carefully designed artificial intelligence allows for a wide range of bot behavior to mimic real dart players of all skill levels.</strong> Adjust 20 levels of difficulty to find the right challenge for your play style. High-level bots can use marker darts for checkouts, attempt cover shots when beds are blocked, and even evaluate complex risk/reward calculations before every throw, just as a real player would adapt throughout a game.</li></ul><ul><li><strong>Play PvP exhibition matches!</strong> Put your skills to the test in local games, or use Steam's awesome \"Remote Play Together\" feature to challenge friends online.</li></ul><br/><br/><br/><ul><li><strong>In-game dart editor for even the most creative tungsten tinkerers.</strong> Design your dream range or re-create your real-life match darts! Swap out barrels, flights, shafts, and points, then apply realistic finishes and all manner of PVD color coatings to each part. You can even start with any of the professionally designed artist presets to use as templates for your own creations!</li></ul><br/><br/><br/><ul><li><strong>Handcrafted models and textures with attention to detail only a dart player would appreciate.</strong> Every aesthetic has been accounted for, from the clips holding the number ring on the board to the grip patterns machined into the dart points themselves. Everything in-view can be customized, even the room decor!</li></ul><br/><h3>Wishlist to be notified on launch day!</h3><br/>For regular dev updates and all manner of darts-related banter, follow me on twitter: https://twitter.com/DanSisal<br/><br/><br/>(Please note, this is <strong>NOT</strong> a VR experience. This game is played entirely with a mouse.)", "metacritic": null, "released": null, "tba": false, "updated": "2021-10-04T03:20:26", "background_image": "https://media.rawg.io/media/screenshots/8dc/8dcf46894544724e13f18bb701cb6e5f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 220, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dan Sisal"], "genres": ["Simulation", "Sports", "Casual", "Indie"], "publishers": ["Dan Sisal"], "esrb_rating": null}