{"id": 67244, "slug": "forest-defense", "name": "Forest Defense", "name_original": "Forest Defense", "description": "A Captivating Epic!!<br/>Forest Defense tells the story of the Devout and his epic quest to defend the last Hamadryad and her ancient forest. Once a tranquil haven for beasts of all shapes and sizes, the Hamadryad’s Forest is on on the verge of destruction, systematically assaulted by enigmatic mechanical invaders called the Automata. Only the Devout stands in the way of complete annihilation.<br/><br/>*** Not Your Average Tower Defense Game **<br/>Forest Defense combines strategy and tower defense with real-time combat action, resulting in a game that is as intuitive as it is exciting - and free!<br/><br/>You command the Devout, a being who serves the age-old nature spirit known only as the Hamadryad. Wave upon wave of Automata invaders are slashing and burning their way towards the Hamadryad, eager to devour her power. You must command the Devout in battle and summon the fiercest animals to aid you as you attempt to defend the forest against the relentless onslaught.<br/><br/>Step into the Heart of the Battle with Forest Defense<br/>Build and lead an army of original and uniquely designed magical creatures. Gain experience and upgrade the Devout, his powers, and the forest’s creatures. Fight alongside your beast soldiers and repel the unrelenting Automata in massive battles of truly epic scale. Dodge the enemy’s attacks and devastate your opponents with the Devout’s melee and magical abilities.<br/><br/>Build an Army Like You’ve Never seen Before !!<br/>Guided by you, the Devout will use the powers of Sun and Water to oppose the heartless Automata, but one defender - no matter how powerful - cannot succeed alone. Conscript, upgrade, and summon various ferocious beasts to aid you in your Forest Defense. These fantastical birds, mammals, reptiles, and mythical creatures will follow you on the battlefield in a last desperate attempt to defend their home.<br/><br/>Challenging and Exhilarating !!<br/>Are you ready for the Forest Defense? Fight in 50 increasingly difficult levels of frenzied action to defeat the mechanical invaders. Remember to choose your soldiers wisely: the right creatures at the right moment could change the tide of battle. Forest Defense is an exhilarating tower defense game that challenges your strategic abilities and reflexes at the same time.", "metacritic": null, "released": "2012-03-19", "tba": false, "updated": "2019-10-22T14:01:46", "background_image": "https://media.rawg.io/media/screenshots/542/542ffd516e520adf4087036f883ee0c0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 120, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Oriented Games"], "genres": ["Action", "Strategy"], "publishers": ["Oriented Games"], "esrb_rating": "Everyone 10+"}