{"id": 672622, "slug": "brainxious", "name": "Brainxious", "name_original": "Brainxious", "description": "<p><strong>Push anxiety out of the way and all tasks and duties deeper into your brain!</strong><br/>as if it only could be done so easily...</p>\n<p>This time, the theme was a hard one for me, I kept a long time brainstorming and nothing really came to my mind except an idea for a previous ludum dare, where you would play as a hostage negotiatior in hilarious situations. But as life is not super easy these days, this idea of stuffing tasks in your brain came up. I don´t know if it is really fun or a game, but it is something that didnt let me go. Even as my hard drive died on the second day (in typical gamejam fashion) I salvages what I could, rewrote the lost code and kept at it, because I didnt want to forfeit.</p>\n\n<p>I am very happy with the graphics. Although crude and simple I made sure almost everything moves and changes. The hand wanders around the brain like a clock and looks older the longer you play. The brain jiggles more frenetically with the stress and when the game is over there is some time to relax. Originally I planned to do something with photos as graphics and focus on sound and music before the theme was announced, but maybe next time there is time for that.</p>\n\n<p>Putting gameplay and depth into this thing was super hard. My message I wanted to convey and typical gamey stats stuff didn´t play along niceley together. So either it was boring if you play it right, or too chaotic to be a game. I stepped away from a semi linear story as you play to getting random tasks and worries that you just have to contain inside your brain. During prototyping I tried to go for a point scoring system to balance your work/life or keep a certain amount of items (eg 2 hearts, 1 clock and a tweet) in mind. Sadly also sound had to be scrapped due to the day 2 debacle of my dying hard drive. Ultimately though I am contempt with what it became and even more, its kind of a callback to last years entry, where I let you experience the stressful life of a bagel factory worker.\r\n</p>", "metacritic": null, "released": "2021-10-03", "tba": false, "updated": "2021-10-04T04:36:52", "background_image": "https://media.rawg.io/media/screenshots/ff8/ff8be3cc3cf6292a79ae3f6f87bdf00b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 65, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["ancientpixel"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}