{"id": 67269, "slug": "time-monkeys-arcade-shooter", "name": "Time Monkeys - Arcade Shooter", "name_original": "Time Monkeys - Arcade Shooter", "description": "Shoot your way across near-future London as time travelling monkeys! Use your time powers to build an army of ghost monkeys to destroy banks, labs &amp; entire streets in your quest to bring the evil Sim-Ion Corp to justice!<br/> <br/>Use incredible weapons from rocket launchers to lightning cannons!<br/> <br/>Solve puzzles and sneak through levels to face thrilling bosses &amp; fight waves of enemies!<br/> <br/>From the mind that made MICRO MACHINES, Time Monkeys is action-packed fun, with hours of unique dynamic levels!<br/> <br/>Unleash the true power of your Apple TV with cutting-edge graphics, featuring stunning 3D visuals that capture the chaos of battle!<br/><br/>---<br/><br/>DESTROY! Lay waste to the streets of London, smashing museums, banks and offices in your quest for revenge!<br/><br/>TRAVEL IN TIME! Death isn’t a barrier - fight alongside your previous self over and over! Build an army of Monkey Time Ghosts!<br/><br/>PUZZLE-TASTIC! Use your Time abilities to solve fiendish puzzles.<br/><br/>SNEAK! Use stealth tactics to break into heavily guarded areas and steal mystical artefacts.<br/><br/>LOCK AND LOAD! Wield a formidable arsenal of weaponry to cause maximum destruction including Lasers, Rocket Launchers, Mini Guns and Lightning Cannons!<br/><br/>DEVIOUS ENEMIES! Battle against an ever expanding robot army created by the Sim-Ion Corp; a shady multi-national with dubious intentions.<br/><br/><br/>Follow @TimeMonkeys on Twitter!<br/><br/>Like us at facebook.com/TimeMonkeys and say hi!", "metacritic": null, "released": "2016-05-11", "tba": false, "updated": "2019-07-29T10:48:01", "background_image": null, "website": "http://www.kwalee.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Kwalee"], "genres": ["Action", "Arcade", "Casual"], "publishers": ["Kwalee"], "esrb_rating": null}