{"id": 672736, "slug": "train-tilt-ld49", "name": "Train Tilt (LD49)", "name_original": "Train Tilt (LD49)", "description": "<p>Deliver cargo on an <strong>unstable </strong>train. Try to balance weight for maximum acceleration and toss some crates onto the tracks if they get to be too much.<br/></p>\n<p>Developed using Godot in under 9 hours for the second half of Compo because I had a change of heart on game concept - mostly because I envisioned this one as complete whereas the first idea was heading nowhere fast.\r\n</p>\n<p>It’s a bit wonky, but I hope you’ll get some fun out of it.\r\n</p>\n<p>I learned a lot of Godot and I see now why it’s so beloved.\r\n</p>\r\nConcept\r\n<p>Deliver the cargo as quickly as possible - and as much of it as you can save.\r\n</p>\n<p>The train slows down if it touches the track. If it’s too slow, game over!\r\n</p>\n<p>Balance weight on the train (including your own) for maximum speed.\r\n</p>\n<p>Distance from the center matters!\r\n</p>\n<p>What’s the highest level you can reach? And the most boxes delivered?\r\n</p>\r\nControls\r\n<p>Move: A/D keys, arrows, d-pad, or left stick\r\n</p>\n<p>Jump: space, key X, gamepad bottom button\r\n</p>\n<p>Grab/Throw: alt, key C, gamepad left button (hold to grab - you will also auto-grab anything that falls on your head)\r\n</p>\n<p>Pause: Esc, Pause/Start/+\r\n</p>\n<p>Quit (after pausing): key Q, Back/Share/-\r\n</p>\r\nKnown Issues\r\n<p>You can get trapped/buried under too many boxes. Try jumping or grabbing and throwing to dig your way out. Otherwise you may have to wait and hope.\r\n</p><p>I accidentally left the levels quicker than intended (for testing). So the early ones end kind of suddenly, but on the plus side you should survive more levels.<br/></p>\r\nCredits\r\n<p>In loving memory of Charlie, my furry companion who left us suddenly and far too soon right as the event was beginning.\r\n</p>\n<p>Special thanks to my wife Kate for being super supportive on this maddeningly difficult weekend. She continues to keep me going even when I think it’s impossible.\r\n</p>", "metacritic": null, "released": "2021-10-03", "tba": false, "updated": "2021-10-04T05:05:00", "background_image": "https://media.rawg.io/media/screenshots/83f/83f9361eaa6a145d5e202a331843f2f5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 24, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["Retro Indie Josh"], "genres": ["Action"], "publishers": [], "esrb_rating": null}