{"id": 6729, "slug": "merchant-rpg", "name": "Merchant RPG", "name_original": "Merchant RPG", "description": "Be the Merchant of your very own empire! Quest, Craft, Profit, Upgrade!<br/><br/>As the Merchant, you are the commander of your own domain!<br/><br/>Blending together traditional RPG systems, tycoon mechanics, and a fantasy overworld, Merchant aims to reimagine the traditional mobile RPG. In Merchant, players take the role of a shopkeeper who must manage a team of Heroes and Crafters. Heroes are sent out on quests in order to fight enemies and gather materials. Crafters then use those materials to create weapons and armor. As the shopkeeper, players must balance their micro-economies between selling items for gold and crafting items to better ensure success for the Heroes. <br/><br/>* * *<br/><br/>TAKE REIGN OF YOUR MARKET<br/><br/>- Send Heroes out on epic adventures!<br/>- Pay Crafters to create gear!<br/>- Earn gold and dictate the direction of your economy!<br/>- Grow your inventory and profit from your trade empire!<br/><br/>VICTORY THROUGH CONQUEST<br/><br/>- Choose your cast of characters from multiple Hero classes!<br/>- Ride out to battle to bring back items and loot!<br/>- Customize your champions with weapons and armor!<br/>- Band together to raid powerful bosses as a party!<br/>- Better performance leads to greater rewards!<br/><br/>CRAFT YOUR LEGACY<br/><br/>- Utilize the unique Crafters to create items and gear to use and sell!<br/>- Train the Crafters to create better items, allowing them to master their trade!<br/>- Ensure the victory of your Heroes by outfitting them with superior items!<br/><br/>* * *", "metacritic": null, "released": "2016-06-09", "tba": false, "updated": "2019-10-22T14:28:23", "background_image": "https://media.rawg.io/media/screenshots/411/4110313d78be3594dc6f4c4054b5d9ee.jpeg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 38, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Retora Game Studios"], "genres": ["RPG", "Simulation"], "publishers": ["Tyler Coleman"], "esrb_rating": "Everyone 10+"}