{"id": 673120, "slug": "qraps", "name": "Qraps", "name_original": "Qraps", "description": "<p>Rules: </p>\n<p>Select your dice type from the options listed below.  Then, click Roll to throw two dice.  If the sum of these dice is 7 or 11, the player wins. If the sum is 2,3 or 12, the player loses. Otherwise, the sum become your point.  Continue to roll until either the point comes up again, in which case you win or you throw 7, in which case you lose.</p>\n<p>Types of Dice:\r\n</p>\n<ol><li><strong>Classical dice</strong> Two good old classical craps, perfectly distinguishable.\r\n</li><li><strong>Bosonic dice</strong> Two quantum dice acting as bosons meaning that one cannot distinguish.\r\n</li><li><strong>Fermionic dice</strong>  Two quantum dice acting as fermions meaning that one cannot distinguish them but in addition they have to obey the Pauli exclusion principle and never ever show the same face.\r\n</li><li><strong>Entangled Bosonic dice</strong> When two quantum bosonic dice are entangled they always show the same face.\r\n</li><li><strong>Entangled Fermionic dice </strong>When two quantum fermion dice are entangled they always show the opposites faces.\r\n</li></ol>\n\n<p>Learn More!</p>\n<p>One of the most fundamental differences between classical and quantum mechanics is the necessity of introducing quantum statistics — Bose–Einstein statistics for particles with integer spins (bosons) and Fermi–Dirac statistics for particles with half-integer spins (fermions)— for systems of identical particles. \r\n</p>\n<p>As a part of the standard physics curriculum ,quantum statistics are usually introduced in courses on statistical physics or quantum mechanics with special emphasis on their applications on statistical systems. For example, Bose–Einstein statistics provide a natural understanding of the blackbody spectrum, and the Fermi theory on electronic bands of condensed matter systems has its foundation on Fermi–Dirac statistics. \r\n</p>\n<p>On the other hand, probability theories with quantum statistics are rarely discussed. This is a curious omission, given the close connection between classical statistics and probability theory. In this game we try to fill this gap by studying the two dice sum probability distributions in the classic game of craps, for different kind of dice.\r\n</p>\n<p>We believe that a better understanding of quantum statistics is needed for novel quantum simulations on quantum computers. The atomic world behaves like a huge number of many-faced dice, constantly being rolled and rerolled!!!\r\n</p>\n<p>Credits:<br/></p>\n<p>Design, Programming - David Eisner</p>\n<p>Quantum - Mahnoor Fatima</p>\n<p>Music - Giovanni Palmitesta</p>\n<p>Design, Quantum - Ioannis Theodonis</p>", "metacritic": null, "released": "2021-10-03", "tba": false, "updated": "2021-10-04T06:32:51", "background_image": "https://media.rawg.io/media/screenshots/5d5/5d5383a03f640436c083e7f980ab4c62.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 10, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["SuperStingray", "Ioannis", "maxwell042"], "genres": [], "publishers": [], "esrb_rating": null}