{"id": 673136, "slug": "arilland-a-beautiful-painful-world-ita-eng", "name": "Arilland-a beautiful painful world (ITA-ENG)", "name_original": "Arilland-a beautiful painful world (ITA-ENG)", "description": "ITALIANO\r\n<p>E se non ci fosse solo il mondo che conosciamo?</p>\n<p>Se esistesse un'altra realtà simile alla nostra, ma pervasa da una misteriosa energia che permette l'uso della magia?</p>\n<p>Vieni a scopire Arilland e salvala dal dolore che la tormenta da secoli.</p>\n<p>Entra nei panni di Luke e dei suoi amici e parti all'avventura in un modo pieno di pericolose creature da affrontare in un combattimento a turni.</p>\n<p>Trova le quattro armi sacre e salva Arilland riportando l'equilibrio nell'Arill.</p>\n<p>Nella pagina trovate sia la versione web da giocare online e la Rom del gameboy giocabile tramite emulatore.<br/></p>\n<p>Realizzato da RedFoXalabama</p>\n\r\nENGLISH\r\n<p>What if it wasn't just the world we know?</p>\n<p>What if there was another reality similar to ours, but pervaded by a mysterious energy that allows the use of magic?</p>\n<p>Come and discover Arilland and save it from the pain that has plagued it for centuries.</p>\n<p>Steps into the shoes of Luke and his friends and embarks on an adventure in a way full of dangerous creatures to face in turn-based combat.</p>\n<p>Finds the four sacred weapons and saves Arilland by restoring balance to the Arill.</p>\n<p>On the page you will find both the web version to play online and the gameboy Rom playable via emulator.</p>\n<p>Made by RedFoXalabama</p>", "metacritic": null, "released": "2021-10-03", "tba": false, "updated": "2021-10-04T06:36:37", "background_image": "https://media.rawg.io/media/screenshots/e9c/e9c732ae538f850c4adab0534bce086a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 66, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["RedFoXalabama"], "genres": ["Adventure", "RPG", "Puzzle"], "publishers": [], "esrb_rating": null}