{"id": 67329, "slug": "ben-10-up-to-speed", "name": "Ben 10: Up to Speed", "name_original": "Ben 10: Up to Speed", "description": "Use Ben 10's alien powers to run, jump and smash your way past enemies, obstacles and supervillains in Ben 10: Up to Speed!<br/><br/>MEET BEN TENNYSON<br/>Ben was on a road trip with his Grandpa Max and cousin Gwen when he discovered the alien watch known as the Omnitrix. Now, he can use it to turn into alien superheroes, each with amazing abilities.<br/><br/>UNLEASH ALIEN POWERS<br/>Turn into the super-strong Four Arms, the fiery Heatblast, the lightning-quick XLR8 and more incredible aliens. Use their individual powers to blast the bad guys, smash through obstacles and even access alternate paths.<br/><br/>POWER UP THE OMNITRIX<br/>Level up your aliens and the Omnitrix itself to become faster, stronger and more heroic. Change into the right alien in each situation to make the most of your powers.<br/><br/>MORE ALIENS, MORE LEVELS, MORE BOSSES<br/>Stay tuned for massive updates! We'll be adding new aliens with their own unique powers for even more ways to play. You'll also get new levels &amp; environments and new boss battles to test your skills.<br/><br/>Master the Omnitrix and its aliens to save the day in BEN 10: UP TO SPEED!<br/><br/>*****<br/><br/>IMPORTANT CONSIDERATIONS: <br/>This app may contain ads that feature other products, services, shows or offers from Cartoon Network and our partners.<br/><br/>PRIVACY INFORMATION: <br/>Your privacy is important to us at Cartoon Network, a division of Turner Broadcasting System, Inc. This game collects and uses information as described in Cartoon Network’s Privacy Policy linked below. This information may be used, for example, to respond to user requests; enable users to take advantage of certain features and services; personalize content; serve advertising; perform network communications; manage and improve our products and services; and perform other internal operations of Cartoon Network web sites or online services. Our privacy practices are guided by data privacy laws in the United States. For users residing in the EU or other countries outside the U.S., please note that this app may use persistent identifiers for game management purposes. By downloading this application, you accept our Privacy Policy and End User License Agreement, and you give permission for such uses for all users of your device. The Privacy Policy and End User License Agreement are in addition to any terms, conditions or policies imposed by your wireless carrier and Apple, Inc. Cartoon Network and its affiliates are not responsible for any collection, use, or disclosure of your personal information by Apple or your wireless carrier. <br/><br/>Terms of Use: http://www.cartoonnetwork.com/legal/termsofuse.html <br/>Privacy Policy: http://www.cartoonnetwork.com/legal/privacy/mobile.html", "metacritic": null, "released": "2017-01-12", "tba": false, "updated": "2019-07-30T19:50:15", "background_image": "https://media.rawg.io/media/screenshots/1c3/1c346001b0e92b03a175f1b69dc3f8ca.jpg", "website": "http://www.cartoonnetwork.com/apps/ben-10/up-to-speed/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 256, "game_series_count": 15, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Cartoon Network"], "genres": ["Action", "Arcade", "Casual"], "publishers": ["Turner Broadcasting System"], "esrb_rating": null}