{"id": 673253, "slug": "magnet-mechs", "name": "Magnet Mechs", "name_original": "Magnet Mechs", "description": "<p><strong>Magnet Mechs</strong> is a light-hearted mech simulation where you must carefully manoeuvre your mech around the levels in order to collect Rescue Pods and take them to safety.</p>\n<p><strong>Mech Jam II</strong><br/>\r\nThis was made over two weeks for Mech Jam II. I got really carried away with this and spent waaay too much time on it. I'd just started learning Godot engine a week earlier when I used it in the Stop Waiting for Godot jam and was still feeling like I wanted to make tons of games. Everything in the game was made during the jam, although I spent a couple of days figuring out how to do IK in Godot with some experiments before the jam, because I knew I'd need that knowledge.</p>\n<p>In hindsight, the game isn't particularly fun because I wasted too much time working on assets, such as the buildings in the environment, title menu etc. and not concentrating on the important parts like controls, gimmicks and stage design. Still, it was really about learning how to use Godot and seeing what I could do with its 3D features in a game jam, and on that front it's been a success, and very rewarding.</p>\n<p><strong>On Godot:</strong><br/>\r\nThis was the second jam I tried with Godot, and although I could probably have made the same thing with Unity or Unreal, I don't think I would have enjoyed the process as much as I have with Godot, and perhaps wouldn't have been quite as productive despite having more experience with both engines (although less so for Unity 2020+).</p>\n<p>I really like how little friction I notice when working with Godot, as the engine loads projects quickly, and it plays nicely with GIT, so you needn't close the editor to commit or push work. Godot also has very good documentation, so even though I had to learn a ton of stuff in a short space of time, it was fairly painless to look stuff up, and the built-in help system in the editor is very handy too.</p>\n<p>Unreal and Unity are amazing tools, but for game jams and prototypes I'm really digging Godot and will definitely use it again in the future. Everyone should try at least one game jam with Godot :P</p>", "metacritic": null, "released": "2021-10-03", "tba": false, "updated": "2021-10-04T07:07:29", "background_image": "https://media.rawg.io/media/screenshots/964/96480f5b0cc6484eae4dd35a6e8a5b9b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 75, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MrFlamey"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}