{"id": 673226, "slug": "change-of-heart", "name": "Change of Heart", "name_original": "Change of Heart", "description": "<p>As the burning sun’s light shines down upon the city, where the birds sing and the public talk. Lived a man who lived a life of crime and dishonesty. His name is Hideki Manabu. Hideki has always been living this life for many years, almost as if it was a lifestyle. Walking into shops and stealing for the good feelings that would arise after the dash away through the streets to then claim his sudden success from getting away. In this, it was always about finding the highs and adventures in his life which makes him feel like he has a purpose. The problem was one night stopping all that, which took a dark turn for the worst. </p>\n<p>After his daily run to a different local shop and running out with items in his clothing, he was spotted by one of the policemen that were sadly at the time keeping a close eye around the area. Without hesitation, the policeman charged him to capture him, as he always heard about someone shoplifting from different stores but always got away. He turns around and suddenly from behind him, the policemen shot him. Hideki never imagined that he would ever have gotten himself in this space. Is this his last, as he bleeds out while thoughts roam through his head of desperation? His eyes slowly close, as the image of the cop blurs into darkness.</p>\n<p>The light creeps through his eyelids, which awakens him. A man stared at him in what appeared to be a white room at which he laid, on soft cloudy flooring. Questioning if he was dead or if it was just a dream, as he squints trying to make his eyes steadily adjust. A loud but strong menacing voice flows throughout the room.\r\n</p>", "metacritic": null, "released": "2021-10-03", "tba": false, "updated": "2021-10-04T07:00:02", "background_image": "https://media.rawg.io/media/screenshots/e94/e94ad128dc84a378c9aab07cb5224c8c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 49, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["DerpySatanpai"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}