{"id": 673393, "slug": "touch-boy", "name": "Touch Boy", "name_original": "Touch Boy", "description": "Bonjour à tous et bienvenue sur \"Touch Boy\"\r\nHello everyone and welcome to \"Touch Boy\" (text in English below)\r\n\r\nTouch Boy c'est le pari un peu fou que je me suis lancé en début d'année 2021, de créer un jeu video, alors que je n'ai aucune connaissance, ni en programmation, ni en informatique en général !\r\n\r\nVoici donc le résultat final, après beaucoup de \"petits\" jeux, de conseils, de rencontres, de videos tuto, de forums, de galères, de doutes ...\r\n\r\nLe jeu est destiné aux smartphones et tablettes, dans l'idéal dans sa version Android Apk (procédure pas à pas d’installation en bas de page, et c'est très simple !). \r\n(Pour les possesseurs de matériel IOS, j'ai créé la version en ligne, mais du fait des serveurs, elle peut présenter des lags ou bugs (de musique notamment), indépendants de ma volonté, et je m'en excuse...).\r\n\r\nLe jeu est une sorte d'hommage à la mythique Nintendo GameBoy originale qui fête ses 31ans en occident cette année ! \r\nJ'espère qu'il vous plaira, et surtout n'hésitez pas à me le dire qu' il vous ait plu ou non, et surtout pourquoi !\r\n\r\nLe jeu est disponible en Français, Anglais, Espagnol, et j’espère bien qu'il sera joué dans le monde entier, donc partagez le, c'est le meilleur cadeau que vous pourrez me faire !\r\n\r\nPour terminer, je ne remercierais jamais assez Alexandre Carret, qui est spontanément venu me demander si j'avais besoin d'aide. Et cela n'a pas été de refus pour la musique qu'il a magistralement composée, majoritairement sur son temps de vacance ! Chose dont j'étais franchement incapable (la musique, pas le temps de vacance...).\r\n\n\r\nVous pouvez le retrouver sur sa page facebook : \r\nOu sur son youtube :\r\nSon souncloud pour retrouver entre autre la musique du jeu :\r\n<em>Pour me contacter moi :</em>\r\nMon twitter :  \r\nMon facebook : \r\n\r\nJe vous remercie d'avance d'avoir accorder un peu de temps à ce projet, quelque soit votre implication, et vous invite à cliquer sur la section \"crédit\" du jeu pour voir mes remerciements en intégralité !\r\n\r\nBon jeu à tous, et croyez en vos rêves !\r\nLe lien direct vers la musique du jeu : https://soundcloud.com/alexandre-carret/sets/touch-boy-ost?fbclid=IwAR3oyh8AOWGb...\r\n\n\r\n\"Touch Boy\" is the crazy bet I made at the beginning of 2021, after losing my job, to create a video game, even though I have no knowledge, neither in programming, nor in computer science in general!\r\nHere is the final result, after a lot of \"small\" games, advices, meetings, video tuto, forum, galley, doubts...\r\nThe game is intended for smartphones and tablets, ideally in its Android Apk version. (step by step installation procedure at the bottom of the page, and it's very simple!)\r\nFor IOS hardware owners, I created the online version, but due to the servers, it may present lags or bugs (music in particular), beyond my control, and I apologize...\r\nThe game is intended to celebrate the anniversary of the release of the Nintendo GameBoy, which is celebrating its 31st birthday in the West! I hope you'll like it, and don't hesitate to tell me whether you liked it or not, and especially why!\r\nThe game is available in French, English, Spanish, and I hope it will be played at the end of the world, so please share it, it's the best gift you can give me !\r\nFinally, I can't thank Alexandre Carret enough, who spontaneously asked me if I needed help. And it was not a refusal for the music that he masterly composed, mostly on his holiday time! Something I was frankly incapable of doing (the music, not the holiday time...).\r\n\r\nI would like to thank you in advance for giving some time to this project, whatever your involvement, and invite you to click on the \"credit\" section of the game to see my thanks in full!\r\n\r\nEnjoy the game!\r\n\n\r\n\r\n\r\nInstallation  de la verson Apk  android Installation of the Apk android version : \r\n\n\n\n\n\n\n\r\nN'hésitez pas à me contacter en cas de difficultés !", "metacritic": null, "released": "2021-10-03", "tba": false, "updated": "2021-10-04T07:39:06", "background_image": "https://media.rawg.io/media/screenshots/556/556b3d5db4a4b208d0812c869a4f9eb1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 75, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "Web"], "developers": ["JH10"], "genres": [], "publishers": [], "esrb_rating": null}