{"id": 673478, "slug": "cargo-hell", "name": "Cargo Hell", "name_original": "Cargo Hell", "description": "<strong>WELCOME TO CARGO HELL<br/></strong>\n<p>You are a new-hire space courier and need to get to your destinations safely, but intergalactic space pirates are on your tail. On top of that, the space mail company that hired you is on a tight budget, so your ship has no weapons! Your only option available is a reflector shield which activates while your ship is moving. If you stand still for too long, it will deactivate in order to conserve energy, so keep moving if you want a chance of surviving!<br/></p>\r\nCONTROLS\r\n<ul><li>WASD/Arrow Keys:  move the space ship</li><li>Mouse: control the space ship's direction and aim the reflected projectiles</li></ul>\r\nThere are two options for <strong>space ship's aim </strong>in the options menu:\r\n<ul><li>Mouse: direct mouse input, the space ship points exactly to where the mouse is\r\n</li><li>Controller Like: more like a controller's joystick , the space ship direction points towards the mouse movement <em>(can be used with actual gamepads also, see note below)</em></li></ul>\n<p>This is our first alpha version, and features 6 levels (5 of which are unlocked as you beat them). There is also a global scoreboard for sharing your highest scores with all other players!<br/></p>\r\nPLAYTESTING\r\n<p>If you enjoyed playing this version of Cargo Hell, please consider answering our <strong>playtest questionnaire</strong>. Your feedback is very important to us!\r\n</p>\n<p>We plan to release a full version of this game in the future, so stay tuned for more updates. Some of the features to be included in the full version are:</p>\n<ul><li>Even more levels, enemies, and boss fights;<br/>\n</li><li>A tutorial session with dialogue, explaining the lore and contextualizing the player;</li><li>Original assets (sprites, art and even more original music by som_dood);</li><li>Upgrade shop where you can spend your score points to purchase ship improvements;</li><li>And last but not least, a level editor where players can create and share their own levels using the enemies from the game.</li></ul>\r\nTEAM\r\n<p>This game was made by Diogo Muller and Julia Melgaré with initial help from Conrado Boeira. Features music by som_dood (Level 1 and credits music).<br/></p>\n<p>Note: There's gamepad support for playing the levels, but not for the UI. If you want to play with a gamepad, use a mouse to interact with the UI. Please note that you have to activate the \"Controller Like\" input option on the Options menu.</p>\n<p>Assets used:</p>\n<p>Pixel Space Shooter Pack by Ravenmore</p>\n<p>Celestial Objects Pixel Art Pack by N2D</p>", "metacritic": null, "released": "2021-10-02", "tba": false, "updated": "2021-10-04T08:03:22", "background_image": "https://media.rawg.io/media/screenshots/5a2/5a220ea7e66de3744664974ce172fd84.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 39, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Julia Melgare", "Diogo Müller"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}