{"id": 673593, "slug": "the-pixel-maze-1-bit-adventure-game", "name": "The Pixel Maze: 1-bit Adventure Game", "name_original": "The Pixel Maze: 1-bit Adventure Game", "description": "Preview demo:\r\n<p>This is a preview demo and there a few things that I would like to implement including but not limited to music and perhaps more riddles for fun-ish gameplay experience.</p>\r\nBefore you play:\r\n<p><strong>The Pixel Maze</strong><strong> </strong>is a pay-what-you-want title, which means that if you prefer to play it for free, please do! I'd really appreciate it a lot if you choose to click the \"support this game\" button above, but ultimately have fun! I will also publish source code a bit later (clean up!) for PICO-8 enthusiasts.</p>\r\nHow to play:\r\n<p>Arrows - walk around, C - jump, X - use items.</p>\n<p>On mobile devices, the game will show additional controls.</p>\n<p>Solve a few riddles, find a treasure chest in the labyrinth and bring it back. If you played Maze by Christopher Manson, it is a similar idea but much less sophisticated.<br/></p>\n<p>I recommend to grab a piece of paper and a pen, this is a maze after all and you need Ariadne's thread to guide you.</p>\r\nCredits:\r\n<ul><li>@mrmotarius: mrmotext tiles and miniadventures</li><li>@alanxoc3: sprite outline function</li><li>@fred72: polyfill function</li><li>@electricgryphon: metablobs</li><li>@profpatonildo: textbox functions</li><li>and you, thank you for playing!</li></ul>\r\nMotivation:\r\n<p>I have been doing software development for over 15 years, and I thought that I could apply some of my skills in another domain for fun. This time I wanted to try something different, and I started working on a tiny 1-bit retro game.</p>\n<p>I heard many horror stories that gamedev is hard, and I wanted to get the heartfelt first-hand experience. While it is certainly true that prior experience helps, but gamedev requires a multidisciplinary approach. One has to compose music, create sound effects, draw tiles and sprites, think carefully about game mechanics and many many other things.\r\n</p>\n<p>On top of that, I am a solo-developer, and I have to prioritize ruthlessly, i.e. whether a new idea adds something meaningful to a game, or it is nice to have but will drain my energy, and I will abandon a game quickly. I am lucky to meet great people in gamedev groups. Also, I find gamedev community very friendly and supportive. It is a rewarding experience. Thank you.</p>\n<p>I will also publish a write up to explain how different parts of the game are implemented. Surprisingly, there are just a few tutorials explaining how to implement a lighting system on PICO-8.</p>", "metacritic": null, "released": "2021-10-02", "tba": false, "updated": "2021-10-04T08:32:06", "background_image": "https://media.rawg.io/media/screenshots/0c4/0c4f414feac0bd94d83c25ec6dd56d68.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 45, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["oneearedrabbit"], "genres": ["Adventure", "Platformer"], "publishers": [], "esrb_rating": null}