{"id": 673767, "slug": "halloween-scrooge-demo", "name": "Halloween Scrooge (Demo)", "name_original": "Halloween Scrooge (Demo)", "description": "<p><strong>October 30th: </strong>You’ve just moved to Ravenville, and Halloween is the last thing on your mind, even if it seems like your new town is <strong><em>obsessed</em></strong> with it. You decide you’ll skip the festivities this year as you settle into your new home, expecting teenagers to welcome you to the neighbourhood by egging your house and toilet-papering your trees, per Devil’s Night tradition. Instead, you get a visit from 3 handsome Halloween Ghosts, who try to convince you to stop being a scrooge and give the holiday a chance. Will they convince you that it’s worth getting in the Halloween spirit after all? Or will you just spend the entire time trying to flirt with them?</p>\r\nNote:\r\n<ul><li> Due to time constraints, this SpooktoberVNJam Submission consists of the intro and chapter 1 of the full game (about 30% of the story). The game will remain in development after the jam and will be available by Halloween 2021. Follow<strong> Hamilton Hour </strong>on twitter to get a behind-the-scenes look at development updates.</li></ul>\r\nFeatures:\r\n<ul><li>3k of text, about 5~10 minutes of gameplay for the demo</li><li>Customizable protagonist name (pronouns are gender-neutral throughout)</li><li>Multiple dialogue choices (they don't affect the results in the demo so feel free to explore the different dialogue changes)!</li><li>Original, full-colour backgrounds and multiple character expressions</li><li>Custom textbox UI with Ren'py built-in accessibility features.</li></ul>\n\n<p>Meet the cast of Halloween Scrooge: The Ghosts of Halloween History, Hedonism, and Future:</p>\n\n<br/>\n\n\n<p>\n</p>\n<p>Halloween Scrooge is a short visual novel/kinetic novel created by Vanade for SpooktoberVNJam 2021. This project was Vanade's first visual novel and solo-developed game and the demo was created in a month, with all assets created by Vanade including character/background art, custom gui elements, logo, promo material and script + programming. </p>\n<p>Thanks for checking it out!\r\n</p>\n<p>See more of Vanade's art at https://vanade.tumblr.com  or twitter: https://twitter.com/veetwentythree</p>\n<p>Follow Vanade's indie VN studio <strong>Hamilton Hour</strong> at Hamilton Hour on twitter.</p>\r\nAdditional Credits: \r\nBeta Readers:\r\n<ul><li>Ravenville Mayor</li><li>Ravenville  Gardener</li><li>Chelsea</li><li>Fareeha</li></ul>\n<p>\n</p>", "metacritic": null, "released": "2021-10-02", "tba": false, "updated": "2021-10-04T09:16:42", "background_image": "https://media.rawg.io/media/screenshots/e6e/e6e0614b8f2729f7c2de65e761c67d0c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 125, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Vanade"], "genres": [], "publishers": [], "esrb_rating": null}