{"id": 673886, "slug": "wetworkrl", "name": "WetworkRL", "name_original": "WetworkRL", "description": "<p><em>Corpopunk \"bounty hunting\" traditional roguelike. Become an empty husk whose sole purpose is market manipulation. Pump your body full of various black market chemicals. Commit unspeakable acts of white collar cruelty. <strong>Eliminate the competition or die trying.</strong></em></p>\n<p><strong> Currently implemented features</strong></p>\n<ul><li>Ranged and melee combat</li><li>Small selection of melee weapons, guns, armor, and consumables</li><li>\"Bounty hunting\": eliminate targets in order to progress through the world</li><li>Four character attributes (Attack, Defense, Cunning, and Accuracy)</li><li>Hostile and neutral NPCs</li><li>Cool ASCII graphics, complete with \"animations\"</li></ul>\n<p><strong>(Currently) planned features</strong></p>\n<ul><li>Stock market trading</li><li>Extensive effect systems (buffs, debuffs, etc)</li></ul>\n<p><strong>Controls and general guide</strong></p>\n<ul><li>MOVEMENT: Arrow keys, VI keys or Numpad</li><li>WAIT: Numpad 5 or Period</li><li>PICK UP ITEM: G</li><li>DROP ITEM: D</li><li>INVENTORY: I</li><li>USE EXIT: Shift + D</li><li>MELEE ATTACK: Bump into the enemy you want to attack</li><li>RANGED ATTACK: S to enter SHOOT MODE, movement keys to aim, Enter to shoot</li><li>RELOAD WEAPON: R</li><li>VIEW LOG: V</li><li>LOOK: L</li></ul>\n\n<p><strong>A WORD OF WARNING...</strong><br/></p>\n<p>There is a risk that your AV software will flag the .exe used to run the game as a virus. This in completely unintentional on my part - WetworkRL is a computer game and nothing else. The reason it's being flagged most likely has something to do with the process of turning Python programs into Windows executables. I have no fix for this at the moment, sorry.</p>\n\n<p><strong>ALPHA 0.1.2 CHANGELOG</strong></p>\n<p><em>NEW FEATURES</em></p>\n<ul><li>Added fire, which causes Burning on living entities and burns through walls</li><li>You can no longer level up CON manually; instead, the player gains 3 maximum HP each time they level up</li><li>Changed Riot Dispersion Grenade into Magnesium Grenade, which causes entities caught in the blast to be set on fire</li><li>When determining if an attack hits, the game now rolls 2d{attacker ACC} vs 1d{attacker ACC * 2} instead of for some reason rolling 1d{attacker ACC} vs 1d{target DEF}</li></ul>\n\n<p><em>BUGFIXING</em><br/></p>\n<ul><li>Fixed issue where enemies sometimes wouldn't attack the player despite being in melee range (for real this time)\r\n</li><li>Fixed the K9 enemy being completely unable to actually harm the player 95% of the time</li><li>Fixed issue where using the grenade would cause an error\r\n</li><li>Fixed issue where enemy turns would sometimes be handled twice per turn\r\n</li><li>Various balance tweaks to account for players now gaining HP with each level up and for attacks less frequently missing</li></ul>", "metacritic": null, "released": "2021-10-01", "tba": false, "updated": "2021-10-04T09:46:09", "background_image": "https://media.rawg.io/media/screenshots/6ae/6ae9143fc22ffc99dea47998571bbd36.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 65, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["fetfluga66"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}