{"id": 67391, "slug": "rockstars-of-ooo-adventure-time-rhythm-game", "name": "Rockstars of Ooo - Adventure Time Rhythm Game", "name_original": "Rockstars of Ooo - Adventure Time Rhythm Game", "description": "Calling all rockstars! Feel the rhythm in Adventure Time Rockstars of Ooo!<br/><br/>TAP TO THE BEAT!<br/>Get ready for a new musical adventure! Tap to the rhythm to sing and play with Finn, Jake, Princess Bubblegum, BMO, and Fionna!<br/><br/>ROCK AROUND OOO!<br/>Explore some of your favorite Adventure Time moments, including BMO Noire, Fionna and Cake, Wizard Battle, Marceline’s henchmen, and Party Pat in the Belly of the Beast!<br/><br/>10+ ORIGINAL SONGS!<br/>All-new songs were composed exclusively for Rockstars of Ooo! Can you keep up with the beat and ace all 30 levels? <br/><br/>Rock out with ROCKSTARS OF OOO!<br/><br/>*****<br/><br/>This game is available in the following languages: English, French, Italian, Spanish (Latin American), Portuguese (Brazilian), Russian, Turkish, Arabic, Simplified Chinese, Korean, Japanese <br/><br/>If you're having any problems with this app, feel free to contact us at advanced.platforms@turner.com. Tell us about the issues you're running into as well as what device and OS version you're using. <br/><br/>*****<br/><br/>IMPORTANT CONSIDERATIONS: <br/>This app may contain ads that feature other products, services, shows or offers from Cartoon Network and our partners.<br/><br/>PRIVACY INFORMATION: <br/>Your privacy is important to us at Cartoon Network, a division of Turner Broadcasting System, Inc. This game collects and uses information as described in Cartoon Network’s Privacy Policy linked below. This information may be used, for example, to respond to user requests; enable users to take advantage of certain features and services; personalize content; serve advertising; perform network communications; manage and improve our products and services; and perform other internal operations of Cartoon Network web sites or online services. Our privacy practices are guided by data privacy laws in the United States. For users residing in the EU or other countries outside the U.S., please note that this app may use persistent identifiers for game management purposes. By downloading this application, you accept our Privacy Policy and End User License Agreement, and you give permission for such uses for all users of your device. The Privacy Policy and End User License Agreement are in addition to any terms, conditions or policies imposed by your wireless carrier and Apple, Inc. Cartoon Network and its affiliates are not responsible for any collection, use, or disclosure of your personal information by Apple or your wireless carrier. <br/><br/>Terms of Use: http://www.cartoonnetwork.com/legal/termsofuse.html <br/>Privacy Policy: http://www.cartoonnetwork.com/legal/privacy/mobile.html", "metacritic": null, "released": "2015-08-06", "tba": false, "updated": "2019-10-22T14:37:31", "background_image": "https://media.rawg.io/media/screenshots/6cc/6cc242a5f8e0593238d9ab3032e2fe6e.jpg", "website": "http://www.cartoonnetwork.com/apps/adventure-time/rockstars-of-ooo/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 211, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Cartoon Network"], "genres": ["Arcade"], "publishers": ["Turner Broadcasting System"], "esrb_rating": null}