{"id": 673948, "slug": "eye-of-the-moon", "name": "Eye of the Moon", "name_original": "Eye of the Moon", "description": "<p><strong>Recovering from the consequences of a divine war,</strong> the pantheon of Kaluwalhatian adjusts to the shared rule of Mayari, the peacekeeping goddess of the moon, and Apolaki, the trailblazing god of the sun.</p>\n<p>As the deity of lost things, you occupy yourself with discovery and exploration, using your gifts to guide the mortals that pray to you and to find forgotten treasures. But when the truce between the rulers of Kaluwalhatian begins to splinter, deity and mortal alike call on you to restore the balance.</p>\n<p><em><strong>Will you make your greatest discovery yet, or will you succumb to the forces threatening to tear the heavens apart?</strong></em></p>\n\n<p><em>Eye of the Moon</em> is an adventure and romance story inspired by Filipino mythology. Written by a Filipina woman, this interactive fiction game is a labor of love about protecting your home, complicated families, and relying on each other.</p>\n<p><em>Features:</em></p>\n<ul><li>an immersive world exploring the Philippines and its rich indigenous mythologies\r\n</li><li>in depth character customization including appearance and personality\r\n</li><li>romances that are integral to the story, with two bisexual love interests and a poly route\r\n</li><li>choices that influence the story and your relationships, with multiple possible endings\r\n</li></ul>\n<p>Eye of the Moon is a work in progress and will be released chapter by chapter. Follow the game blog for the latest updates and extra content. If you're enjoying the game, you can send me a tip either here on itch.io or on Ko-fi! </p>\n<p>Official art by borgdraws.</p>\n<p><strong>Note:</strong> This game is rated M for language, violence, and sexual content. It will eventually include optional explicit content.</p>\n\n<p>Eye of the Moon is set in Kaluwalhatian, the realm of the deities in Filipino mythology. As the deity of lost things you will travel all over the heavens, exploring the Philippines' most majestic landscapes and visiting the mortals on earth when your adventures require. </p>\n<p>The story is immersed in pre-colonial Filipino culture and history; it purposefully sheds Western concepts around gender, sexuality, and religion.</p>\n<p>Within the game, you'll set your pronouns and choose your love interest(s) but gender and sexuality are completely up to your headcanon! You'll also be able to customize your Moonfinder's appearance and personality.</p>\n<p>There are three main personality archetypes in Eye of the Moon; these affect the Moonfinder’s overall demeanor.</p>\n<p><strong>Blue:</strong> <em>charitable and sympathetic</em></p>\n<p><strong>Purple:</strong> <em>playful and mischievous</em></p>\n<p><strong>Red:</strong> <em>aloof and exacting</em></p>\n<p>There are also two other variable traits. These have more to do with how the Moonfinder handles social situations and conflict resolution.</p>\n<p><em>Proactive/reactive</em></p>\n<p><em>Diplomat/fighter</em></p>\n<p>The proactive/reactive trait also affects how the Moonfinder approaches romance.</p>\n<p>Please note, the Moonfinder is <strong>not</strong> a blank slate MC! You can find an MC guide including clothing references and setting appropriate names here.</p>\n\n\n<p>Eye of the Moon features two love interests: <strong>Tala</strong>, goddess of the stars and navigation and <strong>Dumakulem</strong>, god of the mountains and hunting. You can pursue them individually or simultaneously through the poly route!</p>\n<p>\n</p>\n<p><strong>Tala</strong> pierces stars through the night sky, turning them into brilliant jewels that guide mortals through the dark. It is said that every time a new deity is born, Tala creates a new constellation in the ocean above to welcome them to Kaluwalhatian. Mortals worship her because without the stars as their map they would be lost in the seas.</p>\n<p><strong>Duma</strong> resides in the mountains on earth, teaching and protecting the mortals within his domain. He is one of the most revered amongst the pantheon because of his reputation as a provider: of sustenance, of guidance, of endurance. Whether hunters are still learning to notch their bows or are tracking down the most elusive of prey, Duma is the recipient of their prayers.</p>", "metacritic": null, "released": "2021-10-01", "tba": false, "updated": "2021-10-04T10:03:46", "background_image": "https://media.rawg.io/media/screenshots/8c5/8c59cf81371818089e60d62a553cec70.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 112, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["atemaarte"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}