{"id": 674063, "slug": "chronicles-of-two-heroes", "name": "Chronicles of two Heroes", "name_original": "Chronicles of two Heroes", "description": "<em>Chronicles of 2 Hereoes: Amaterasu’s Wrath is a 2d action platforming game with metroidvania elements. Dart through levels facing Amaterasu’s minions and switch character in real time to unleash their unique skills and save Japan from the goddess’ madness.</em>\n<p>  <br/></p>\n<br/>You can download for FREE the demo of our game. Please consider to help us by answering the 9-question survey linked below. Thank you for your support and we hope you enjoy it!<br/><br/><br/>SURVEY<br/><br/><br/>GAMEPLAY:<br/>\n<p>Switch characters in real time to face the challenges of Amaterasu, use the unique skills of each sibling to find new ways to defeat your enemies and save Japan!\r\n</p>\n<p>Every character relies onto a great variety of unique skills unlockable throughout the game. The key to victory lies in being able to combine the right move at your disposal at the right time. Will you brave Amaterasu’s wrath?</p>\r\nLORE:\r\n  \r\n<p>Ancient legends tell about the great Amaterasu’s Wrath and of the cruel reign of her disciple, Empress Imiko, who through the iron fist of her mighty imperial army dragged Ancient Japan into an endless vortex of wars, famine, and epidemics.\r\n  </p>\n<p>The hope to bring back peace and order to the reign are entrusted to two siblings, Kensei a samurai and Ayame a kunoichi. Thanks to the teachings of their master and the support of the people that they will meet on their journey, decide to walk straight into the imperial capitol to steal the empresses’ source of power: the three sacred treasures. \r\n  </p>\n<p>This endearing plan will sever once and for all the link between Imiko and the mad goddess Amaterasu and restore peace to the reign.</p>\r\nSETTING:\r\n  \r\n<p>COTH is set between 400 and 600 AD into the mystical land of Japan! Venture through its beautiful landscapes and prepare for a journey that will lead you to the imperial capitol of Osaka… and back!\r\n  </p>\r\nENEMIES:\r\n  \r\n<p>Beside Imiko’s mighty imperial army, Amaterasu will unleash hordes of otherworldly creatures to try to stop you: be ready to face multitudes of Yokais and bosses highly inspired by Japanese mytholgy the likings of Gashadokuro and Tengu!</p>\n<br/><br/>Share with us the final stats of the run on the comments or in our discord channel!", "metacritic": null, "released": "2021-10-01", "tba": false, "updated": "2021-10-04T10:34:28", "background_image": "https://media.rawg.io/media/screenshots/f68/f68f672a6e19ac34a1c493668c7d0a57.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 247, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Infinity Experience"], "genres": ["Action", "Adventure", "Platformer"], "publishers": [], "esrb_rating": null}