{"id": 67429, "slug": "superstar-jypnation", "name": "SuperStar JYPNATION", "name_original": "SuperStar JYPNATION", "description": "Exciting new music game with your favorite artists from JYP ENTERTAINMENT!<br/>Make your favorite artist the best K-POP Star with SUPERSTAR JYPNATION!<br/><br/>▶SuperStar JYPNATION◀<br/>- 14 group artists from JYP ENTERTAINMENT<br/>- Play 134+ songs from JYP ENTERTAINMENT’s artists!<br/>- 900+ cards to collect<br/>- Weekly Ranking, Best Record for each song, and many more competitions inside<br/> <br/>▶Main Features◀<br/>-'SUPERSTAR LEAGUE' - New League Is Added! Random Song For Each Day! Compete Against All Players For 7 Days!<br/>- CardBook system added. Check your own cards.<br/>- 3 different levels of difficulty for each song (EASY/NORMAL/HARD)<br/>- Star cards that can be collected and equipped to improve the abilities<br/>- Weekly Ranking, which is determined by sum of the top 5 scored songs<br/>- Weekly highest scores to determine your class rank<br/>- Compete against new players in the same tier every week<br/>- My Best Record and Global Best Record for each song<br/>- Enhance your Star Cards to Power Up and Upgrade them for more points!<br/><br/>▶Featured Artists◀<br/>J.Y. Park<br/>Wonder Girls<br/>Sunmi<br/>2AM<br/>2PM<br/>miss A<br/>GOT7<br/>Baek A Yeon<br/>15&amp;<br/>Day6<br/>TWICE<br/>SUZY<br/>JUN.K<br/>JJ Project<br/><br/>-----------------<br/>[Access Permission Rights For Smart Device App]<br/><br/>SUPERSTAR JYPNATION hereby asks you to grant permission to access specific apps in smart devices to provide the Service as set forth in these Terms of Service.<br/><br/>*Required Access Rights*<br/>Picture (Photos / Gallery) / Video / File : To save a game data<br/>Read, Record and Save at External Storage : To save sound source data cache and game options<br/>Device ID and Call Information : Advertising Tracking Research and Token Generation For The Push Notification<br/>Wi-Fi Connection Information : To send a message about Wi-Fi connection when there is an additional data download<br/>ID : Required for 'User Account Generation and Check'<br/><br/>[Access Permission Revoke]<br/>Settings &gt; SUPERSTAR JYP &gt; Access Agree or Access Revoke<br/><br/>※ Graphic Option<br/>If you experience lags in the game you can change your visual setting. \"My Info\" - \"Graphic Option\" - Check \"Low Resolution\" for better performance!<br/><br/>※ If you have any inquiries or require any further information, please contact us at.<br/>E-MAIL: support.jypnation@dalcomsoft.com", "metacritic": null, "released": "2018-07-30", "tba": false, "updated": "2019-07-30T22:50:07", "background_image": "https://media.rawg.io/media/screenshots/62c/62c81b1ca658b1944e87bac563cfb9d8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "dropped": 2, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 273, "game_series_count": 0, "reviews_count": 2, "platforms": ["Android", "iOS"], "developers": ["Dalcomsoft"], "genres": ["Arcade", "Casual"], "publishers": ["Dalcomsoft"], "esrb_rating": null}