{"id": 674204, "slug": "scp-970-the-recursive-room", "name": "SCP-970 The Recursive Room", "name_original": "SCP-970 The Recursive Room", "description": "This game will interact you in SCP-970 EXP. PROTOCOLS and not only in it...<br/>Explore the endless room and try to understand what's going on in the Recursive Room of SCP-970-1<br/><br/>This puzzle and detictive game will plunge you headlong into the story of SCP-970 story and riddles.<br/>As a class-D personal try to understand what's going in The Recursive room and try to escape from this endless dimension<br/>SCP - 970 is a game based on the works of the SCP Foundation community. <br/>The SCP Foundation is a non-governmental organization with a high reign of the prosperity of humanity — while remaining in total secrecy. They were once dedicated to containing and researching anomalous entities of our world, protecting humanity under a shade of moral grey.<br/><br/>The directive of the SCP Foundation made a complete shift upon the discovery of a foreign entity that has infected every human’s psyche. The O5 Council, the leaders of the SCP Foundation, initiated a directive to exterminate the human race in an attempt to stop the nefarious entity from reaching its true potential, undertaking the belief that doing so would be a mercy.<br/><br/>Additional SCP-970 The Reursive Room features include:<br/>Original SCP-970 interractive story<br/>Puzzle levels<br/>The Author's endings<br/><br/>Original SCP-970 document excerpt:<br/><strong>SCP-970</strong> is a spatial phenomenon wherein a collection of rooms are looped on themselves. In all cases found, this is by means of a series of doors appearing in the walls, all in a straight line, such that it is possible to walk forwards and end up at the starting position. The alteration to the rooms does not affect neighbouring rooms and floors. There is as of yet no known explanation for the appearance of this phenomenon.<br/><br/>SCP-970-01 is a cell-block within Sector 19, and the first example of the SCP-970 phenomenon encountered by the Foundation. It was constructed with the intent of housing class-D personnel, and fulfilled that purpose until ██/██/████, when several D-classes breached containment in an escape attempt. The investigation into the incident led to the discovery that a series of doors had appeared in the cell-block, leading into rooms on the opposite side of the corridor. It was quickly established that the layout of the building did not support this addition, and that the rooms were following a non-standard geometry.", "metacritic": null, "released": null, "tba": false, "updated": "2021-10-08T02:32:03", "background_image": "https://media.rawg.io/media/screenshots/d07/d0777c556b0d1909db38cd93b15879c9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 64, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["HJ GAMES"], "genres": ["Adventure", "Indie"], "publishers": ["HJ GAMES"], "esrb_rating": null}