{"id": 674209, "slug": "the-revival", "name": "The Revival", "name_original": "The Revival", "description": "<h3>Key Features:</h3><br/><br/><strong>Single Player Campaign and Cinematics</strong><br/>Engaging campaign and storyline where you will play as an elite mercenary<br/>taking you to different dangerous places and conflicts around the world.<br/>Including many first person cutscene storytelling.<br/>With the special weapons and equipment which is provided to you, your actions will determine the fate of millions of people.<br/> <br/><strong>STORYLINE</strong><br/>In the near future, a mysterious virus of unknown origin has taken over a large portion of the world’s population. It kills the infected within a day. There is a temporary injection treatment which is resets every 1 day. The permanent cure is stolen from the biggest biotech lab in the city that could eradicate the virus.<br/><br/>Your mission is bring the cure back to the biotech lab and fight against top-secret military groups. <br/>What begins as an dangerous mission turns into a deathwish when the militants coming dozens of vehicles filled with hundreds of trained killers <br/>armed to the teeth with assault rifles, grenades, and rocket launchers.<br/>Your team will provide you with any updates and tactical support during the operations and battle if you need it.<br/><br/><strong>Alternate Story and Zombie Mode</strong><br/>What if the virus takes over the whole world, what if you fail your mission ?<br/>Alternate story will take you to the zombie apocalypse.<br/>The permanent cure was never found.<br/>%90 of the world's population turned into monsters because of the virus.<br/>Different story, challenging missions and different weapons...<br/> <br/><strong>//Developer's note</strong><br/>We are planning to do alternate story and missions after the full game released.<br/>***Not certain but likely", "metacritic": null, "released": null, "tba": false, "updated": "2021-10-08T02:35:31", "background_image": "https://media.rawg.io/media/screenshots/7c5/7c5316b8098729c8a99693320f8d260a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 409, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["NorthWind Interactive"], "genres": ["Action", "Indie"], "publishers": ["NorthWind Interactive"], "esrb_rating": null}