{"id": 674298, "slug": "slow-living-with-princess", "name": "Slow living with Princess", "name_original": "Slow living with Princess", "description": "Red has been kicked out of the party of heroine who were adventuring to defeat the Demon Lord. He retires from the front lines of the battle and opens an apothecary in the frontier called Zoltan. Now his happy new life depends on the relationship with former tsundere(hot-cold personality) princess and his cute little sister, Ruti who is the world only hope for defeating the Demon Lord as the heroine. <br/><br/><h3>Let's Make This Herb Shop A Success!</h3>Run the store together with the attractive characters and make it bigger!<br/><br/><br/><strong>Here are some of the tips to run a successful apothecary:</strong><br/><br/>1. Gather materials from the fields, gathering, fishing, and defeating monsters.<br/><br/><br/>2. Use the collected materials to mix medicines and cook food.<br/><br/><br/>3. Raise the apothecary rank by selling medicines and food in the store.<br/><h3>Complete Quests to Increase The Adventurer Rank!</h3>Listen to the villagers' requests to raise the adventurer rank and get special rewards.<br/><h3>Increase intimacy with the characters and get to know them better!</h3>Listen to the wishes of the princess and his sister to increase intimacy! Let's see how the relationships with them will change over time...<br/><br/><br/><h3>Story</h3>It's been three years since the invasion of Avalon by Taraxon, the Raging Demon Lord, who rules the Dark Continent. In just three years, half of the continent has fallen into the hands of the Demon Lord. It seemed that there was nothing that humans could do about it... But God did not abandon people. <br/><br/>A girl, Ruti Ragnason, commanded the troops in the provinces where there was almost no defensive force and defeated the advance troops of the Demon Lord. She appeared in the royal capital with the evidence that everyone could see, the \"Divine Blessing of the Hero\".<br/><br/>Gideon Ragnason has been discharged from Ruti's party because he was not \"strong enough\". Since then, he has retired from the front lines of the battle and changed his name to Red. Now he opens an Apothecary in the frontier called Zoltan and hopes to have a happy slow living life style.<br/><br/>", "metacritic": null, "released": "2021-10-06", "tba": false, "updated": "2021-10-08T03:39:32", "background_image": "https://media.rawg.io/media/screenshots/55c/55cdcc1de696dce21041e008d75df78c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 386, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["KADOKAWA", "TSUKURITE."], "genres": ["Simulation", "Indie"], "publishers": ["0UP GAMES"], "esrb_rating": null}