{"id": 674200, "slug": "super-sketchy-party", "name": "Super Sketchy Party", "name_original": "Super Sketchy Party", "description": "Super Sketchy Party is a Drawing Guessing Game, not unlike Pictionary. What is great about Super Sketchy Party is that you can either play it locally with your friends on your couch or play it online with your friends with a big screen device (like a computer or an internet ready TV) and your smartphone.<br/><br/><br/><br/>Super Sketchy Party supports crossplay with multiple friends in the same place and online combined in an easy way. Players can join a party locally or from anywhere with their own devices (no streaming required).<br/><br/>The game offers multiple languages, and the players can contribute content for all players in all languages to be enjoyed. Every player, who owns the game can submit their own phrases in their own language. If we and the community have enough phrases for a new language, it'll be added to the game.<br/><br/>The game comes with a native client but can also run on any device via its website. The game is identical and only requires a copy of the game on Steam.<br/><br/><strong>Note</strong>: Only one player needs to own the game to host a party.<br/><strong>Note</strong>: Currently only English and German is being offered.<br/><strong>Note</strong>: macOS offers a client for the website, not a native client. A Steam login on startup is required.", "metacritic": null, "released": "2021-10-07", "tba": false, "updated": "2021-10-08T02:29:37", "background_image": "https://media.rawg.io/media/screenshots/79c/79cf187c6f8fc7ed7560cec14829b0ff.jpg", "website": "https://www.supersketchy.party/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 90, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Elusive Drafts"], "genres": ["Casual"], "publishers": ["Elusive Drafts"], "esrb_rating": null}