{"id": 674286, "slug": "labtrainingvr-personal-protective-equipment-editio", "name": "LabTrainingVR: Personal Protective Equipment Edition", "name_original": "LabTrainingVR: Personal Protective Equipment Edition", "description": "This basic-level course is designed to enhance laboratory scientists' ability to identify how personal protective equipment (PPE) can help reduce the risk of exposure to hazardous materials, prevent transmission of infectious agents, and demonstrate how to don and doff PPE in the correct order to minimize contamination and potential exposures. This course empowers learners to apply knowledge and practice selecting the appropriate PPE and properly donning and doffing it in a virtual museum. It concludes with a final exam in a virtual laboratory.<h3>OBJECTIVES:</h3>After completing this course, learners will be able to:<br/>•\tIdentify the routes of transmission of infectious agents.<br/>•\tDemonstrate how to don and doff the appropriate PPE for daily use at the bench<br/>•\tDemonstrate how to don and doff PPE during an emergency.<h3>AUDIENCE:</h3>This course is designed for clinical and public health laboratory professionals, including safety professionals and persons who work with potentially infectious agents in a laboratory.<h3>VR NOTE:</h3>This course is designed to work ONLY on the HTC Vive VR platform.  A play area of at least 3 ft. x 3 ft. is recommended, but a larger 20 ft. x 20 ft. space would be ideal, to make the learning experience in this VR courses feel more authentic and real.  This VR course also requires a play area with 360° tracking. In addition, a learner’s computer must meet the following specifications:", "metacritic": null, "released": "2021-10-06", "tba": false, "updated": "2021-10-08T03:31:57", "background_image": "https://media.rawg.io/media/screenshots/03a/03aaa0102b1360fcb92c87d8d100f2b0.jpg", "website": "https://www.cdc.gov/labtraining/training-courses/vr/labtrainingVR_PPE.html", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 182, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Centers for Disease Control and Prevention"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["Centers for Disease Control and Prevention"], "esrb_rating": null}