{"id": 674326, "slug": "eclipse-3", "name": "Eclipse", "name_original": "Eclipse", "description": "<strong>W</strong>hat if you were a god? Play for an ancient god in a new hack &amp; slash adventure from an indie developer MadRock. Crush monsters, complete quests, find and destroy the source of evil. But what if it's not that simple?<br/><br/><br/><br/>Once upon a time gods sent you here. You’ve slept in a glass sarcophagus for hundrends of years. When people find themselves on the brink of extinction, you’ll have to wake up. Now, the time has come. Get up and save the medieval village from the monsters coming from the abandoned dungeons!<br/><br/><br/><br/><strong>Eclipse</strong> is a mix of nostalgic hack &amp; slash games and sci-fi projects. The dynamics of modern games and a well-developed plot with elements of a detective story complement classic control mechanics.<br/><br/><br/><br/>The future is here! Use the weapons of the future in a medieval setting. Find out how technology fell into the hands of the people of that time!<br/><br/>Your skills and abilities are at the forefront, not the item statistics or the quality of the armor. To complete the game, you have to not only wield your axe or sword, but also use your brains: the dungeons are full of mysteries, secret passages and magic items.<br/><br/>Complete quests, explore locations, or simply cut your way further down - in the end you’ll find a secret, which you’d prefer not to reveal.", "metacritic": null, "released": "2021-10-07", "tba": false, "updated": "2023-03-18T05:23:42", "background_image": "https://media.rawg.io/media/screenshots/7a5/7a51d20047c1b0d3ad2289aebd3786d3.jpg", "website": "https://www.eclipseoffical.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 16, "toplay": 4}, "playtime": 5, "achievements_count": 23, "ratings_count": 1, "suggestions_count": 531, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["MadRock"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["MadRock"], "esrb_rating": null}