{"id": 674364, "slug": "abacrux-peg-solitaire", "name": "AbaCruX - Peg Solitaire", "name_original": "AbaCruX - Peg Solitaire", "description": "AbaCruX is a luxurious implementation of peg solitaire. We wanted to make something that looks attractive and is fun to keep around, because that used to be a main function of Peg Solitaire through the ages. It served as a marvelous coffee-table curiosity to entertain the occasional guest. Being the quintessence of a casual game we also wanted to avoid long load times. Like other single player games AbaCruX can be quite relaxing. At the same time, however, it is also quite challenging and fantastic mental exercise. <br/><br/>This is a game for those who cherish a challenge, because these puzzles are not easy. One ball hops over the other to remove it from the board. Easy enough. Do that until there is only one ball left in a specific location. Done. But don't you expect to be able to solve each and every puzzle in an afternoon. Some of these configurations are very difficult to solve. The difficulty of a puzzle depends on the kind of board it uses and of course the initial constellation of its game pieces. But that's not all. In this game we play against the clock. So there is that. <br/><br/>All boards are available and all of them hold their own secrets. Switching boards is allowed and encouraged. Each board has a set of 15 puzzles in ascending difficulty. Each board's first configuration has already been unlocked. The rest of them have to be unlocked by solving each preceding puzzle with a score of 4 stars minimally. <br/><br/>Altogether there are 8 boards in the basic game. Each with 15 puzzles. That is quite a bit of work. For those that would like more, there is an option to purchase an additional 8 boards. The package is called Extra Boards. It includes another 8 boards. These puzzles and boards are a bit more advanced. They are also quite beautiful in their complexity.<br/><br/>Some configurations may be difficult to play on some of the smaller devices. That is unfortunately due to physical limitations. We hope that the availability of the game other devices like a Mac, iPad or Apple TV may mitigate this circumstance. <br/><br/>GameCenter is a new addition and includes a full secondary scoring system. This one is built on points and allows competition between players. This system takes moves and time taken into account. But it is entirely optional.<br/><br/><br/>New Features<br/>• play against the clock<br/>• positional audio<br/>• many more puzzles<br/>• solutions are available<br/>• GameCenter integration<br/>• includes iOS, iPadOS, tvOS and macOS apps<br/><br/>Please note that some of the images shown may illustrate add-on functionality not available with the basic version of the app. Any in-app purchases are available on all platforms and can only be purchased once.", "metacritic": null, "released": "2019-02-12", "tba": false, "updated": "2021-10-08T04:28:44", "background_image": "https://media.rawg.io/media/screenshots/288/28858ad1345c36ecd742678bc8c0c41f_as5EUtT.jpg", "website": "https://rogame.com/abacrux.html", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 94, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["RoGame Software"], "genres": ["Board Games", "Puzzle"], "publishers": ["Arthur Roolfs"], "esrb_rating": "Everyone 10+"}