{"id": 674321, "slug": "age-of-darkness-final-stand-2", "name": "Age of Darkness: Final Stand", "name_original": "Age of Darkness: Final Stand", "description": "Build, Gather and Fight in a Desperate Last Stand Against an Onslaught of Never Ending Evil!<br/><br/>The darkness is an entity of evil. Some say it is the manifestation of human fear and nightmares, others say it is a wandering mass of damned souls haunting us. The origin of the darkness itself is unknown, but one thing for certain is that we can keep it at bay through the power of light and fire.<br/><br/><br/><br/>Brace yourself against huge tidal waves of Nightmares. Leveraging an internally developed technology called ‘SwarmTech’ allows the game to render over 70,000 enemy units on the screen at one time. These enemy legions claw their way up through seething fissures in the earth to reinforce ‘The Veil’.  <br/><br/><br/><br/><br/><br/>Light up a rich, complex, procedurally generated map to claim territory back from ‘The Veil’. A dynamic living death fog that conceals enemies and drains life from your troops. Holding the line against this terror is not for the faint of heart.<br/><br/><br/><br/><br/><br/>Borrowing from the the roguelite genre, Malices are random afflictions placed on the player during every Death Night, unraveling the best made plans. Conversely, if a Death Night is survived, you may decide between three randomly selected Blessings, enriching the experience and giving your army a much needed edge.<br/><br/><br/><br/><br/><br/>Lead the charge against the horrors of the night with powerful and unique Heroes. Using special abilities gained from leveling up, these Heroes can be key to turning the tide of a desperate battle. But beware, the Nightmares have Elite roaming champions of their own that drop precious resources when killed, posing an extreme and ever-present threat to your expansion.<br/><br/><br/><br/><br/><br/><ul><li>'SwarmTech' allowing for over 70,000 swarming AI units on screen at any time<br/></li><li>Build defenses against thousands of enemies during Death Nights<br/></li><li>Day &amp; Night transitions, expand by day, hunt by night<br/></li><li>Unique Heroes to level up and micro-manage to gain an edge against the dark<br/></li><li>Living Death Fog system that grows and recoils from the light<br/></li><li>Randomized Malices &amp; Blessings to make every survival unique<br/></li><li>Multi-faceted Skill Tree system to progress through for your Units<br/></li><li>Wandering Elite Nightmares that may ambush your party and drop precious Dark Essence<br/></li><li>Horror and Embolden based status effects which may curse or aid your troops<br/></li><li>Special Nightmare units, Spitters, Crushers, and Wraiths that test your combat skills</li></ul>", "metacritic": null, "released": "2021-10-07", "tba": false, "updated": "2024-01-30T13:25:24", "background_image": "https://media.rawg.io/media/screenshots/f6e/f6e0bb35396f66fbefd224620261268e.jpg", "website": "https://www.ageofdarkness.com/", "rating": 3.5, "rating_top": 4, "added_by_status": {"yet": 7, "owned": 152, "beaten": 4, "toplay": 27, "dropped": 6, "playing": 4}, "playtime": 3, "achievements_count": 0, "ratings_count": 16, "suggestions_count": 383, "game_series_count": 0, "reviews_count": 16, "platforms": ["PC"], "developers": ["PlaySide"], "genres": ["Strategy"], "publishers": ["Team17 Digital"], "esrb_rating": null}