{"id": 674336, "slug": "reverie-knights-tactics", "name": "Reverie Knights Tactics", "name_original": "Reverie Knights Tactics", "description": "<p>Reverie Knights Tactics is a turn-based tactical RPG with strategic battles in isometric grids where every decision you make can alter the story and the way you configure the characters.<br />\nEmbark on an expedition to find Lennorien, the long lost elvian city to save your loved ones, while fighting the goblin menace that spread terror across the continent!<br />\nLead your party of heroes, each one with distinct, special abilities and skills, allowing you to use multiple battle strategies to defeat your enemies.<br />\nDiscover a fantasy world featuring deep map and scenario exploration in an epic adventure, visual novel style!<br />\nCraft new items and accessories from the treasures you collect and use them as tactical advantage every time you configure your characters.</p>\n<p>Key Features:<br />\nBeautiful Hand Drawn Art: Meticulous multilayer artwork from pencil sketch to full detail color.<br />\nDecision-driven Storyline: Make several decisions through your quests, affecting the story and other characters<code>reactions.  \nCharacter Customization: Customize character</code>s performance attributes, skills, and accessories for heightened abilities!<br />\nItem Crafting: Collect powerful items as you explore the world and discover combinations to create new items.<br />\nExploration: Travel your way through an expansive map, unlocking secret quests, solving puzzles, and exploring scenarios and evil dungeons!<br />\nUp to Four Hero Characters: Control 4 different heroes, each one with distinct, special abilities and skills, allowing multiple battle strategies.<br />\nBattle Phases: React to your opponent&#39;s strategy and come up with the perfect tactic every turn, challenging you to think ahead.<br />\nInteractive Battle Scenarios: Manipulate parts of the battle environments, and use scenario effects to your advantage!<br />\nMultiple Battle Grids: Each battle contains a different isometric grid, making every battle an unique experience.</p>", "metacritic": null, "released": "2022-01-25", "tba": false, "updated": "2022-12-06T13:03:55", "background_image": "https://media.rawg.io/media/screenshots/39d/39d46bd46aac4fc4e96a81ae3e8f59d9.jpg", "website": "https://www.1cpublishing.eu/game/764-reverie-knights-tactics", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 11, "beaten": 1, "toplay": 5, "dropped": 2}, "playtime": 12, "achievements_count": 18, "ratings_count": 4, "suggestions_count": 364, "game_series_count": 0, "reviews_count": 4, "platforms": ["PlayStation 4", "Nintendo Switch", "Xbox One", "PC", "macOS", "Linux"], "developers": ["40 Giants Entertainment"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["1C Entertainment"], "esrb_rating": "Teen"}