{"id": 674599, "slug": "bine-mountain-of-power", "name": "Bine - Mountain of Power", "name_original": "Bine - Mountain of Power", "description": "<p> <strong>GAWC #07 : Double Sens</strong>\n</p>\n<p><strong>Mon idée :</strong></p>\n<p>N’étant pas un très bon storyteller , j’ai choisi d’adapter le thème au gameplay et non au scénraio. Première idée, casser un peu les codes du jeu de plateforme, très souvent de gauche à droite. Ici, on contrôle deux personnages en même temps, dans des sens opposés. Le nom Bine, vient du fait que les personnages sont librement inspirés du jeu Trine (il manque la voleuse, donc ils ne sont que deux, donc Bine au lieu de Trine #JaiLaRef). Je voulais proposer une ambiance globale inspirée de cette excellente série de plateformers.\r\n </p>\n<p><strong>Ce qui s’est bien passé :</strong>\n</p>\n<p>Mon idée finalisée s’est vite démarquée des autres idées que j’avais en tête. Le gameplay de base à été mis en place en 10 minutes, ce qui m’a permis de me concentrer sur un aspect que je travaille d’habitude très peu : le leveldesign. J’ai réussi à mettre en place un workflow entre Tiled (éditeur de tilemap) et Gdevelop 5, le moteur/éditeur de jeu. Pas le meilleur workflow, mais assez simple et rapide pour une Jam.\r\n </p>\n<p><strong>Ce qui s’est mal passé :</strong>\n</p>\n<p>Je n’aime pas le leveldesign ! C’est ultra répétitif, j’avais l’impression de ne pas avancer. Je préfère largement passer du temps à définir des règles et laisser le jeu générer ses niveaux selon mes règles ^^. J’ai du utiliser des assets issu d’Internet car je ne sais pas dessiner en PixelArt.<br/>Pas de soucis techniques en revanche, Gdevelop 5 étant idéal pour les bricoleurs comme moi.</p>\n<p><strong>Ce que j’ai appris :</strong>\n</p>\n<p>Je n’aime pas le leveldesign ! Ah je l’ai déjà dis ? :D Ca me conforte dans mon envie d’apprendre beaucoup plus du côté de la génération procédurale.<br/>L’éditeur Tiled est ultra puissant, et je devrais plus souvent l’utiliser pour de futurs projets 2D.<br/>Gdevelop est vraiment performant, notamment au niveau des effets visuels. J’ai découvert leur fonctionnement, et je suis très satisfais du résultat, pour un premier jeu qui les utilise.</p>\n<p><strong>Pour conclure :</strong>\n</p>\n<p>J’aurai pu aller beaucoup plus loin dans ce challenge, j’avais largement le temps. Mais je pense être arrivé à mes objectifs,<br/>Un de mes plus gros défauts est de toujours vouloir ajouter des choses si j’ai un peu de temps disponible. Après la Epic Mega Jam, c’est le deuxième challenge dans lequel j’arrive à arrêter mon projet une fois les idées de base mises en place.</p>\n\n<p><strong>CREDITS :</strong></p>\n<p><strong>*** 2D assets ***</strong></p>\n<p>Characters : Made with pro version of Character Creation Tool/Generator<br/>Environment : Free Pixel Art Platformer Tileset by aamatnieskss<br/>Font : Enchanted land by Dennis Ludlow<br/>Mountain : by Tyler Lastovich</p>\n<p><strong>*** Sounds &amp; Music ***</strong></p>\n<p>Music : Winds of Stories by HorrorPen<br/>Jump : by dklon<br/>Thunder : by InspectorJ<br/>Rain : by Ylmir </p>\n<p><strong>*** Tools ***</strong></p>\n<p>Game Engine : GDevelop 5<br/>Picture Editor : Affinity Photo<br/>Sound Editor : Audacity<br/>Tilemap editor : Tiled</p>", "metacritic": null, "released": "2021-10-07", "tba": false, "updated": "2021-10-08T05:28:31", "background_image": "https://media.rawg.io/media/screenshots/ba7/ba71b46f31fabe6261ff1b495d69de1d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jean Charpentier"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}