{"id": 674559, "slug": "unusual-findings", "name": "Unusual Findings", "name_original": "Unusual Findings", "description": "It’s the 80s and the Christmas is coming, Vinny, Nick and Tony are young and their new cable signal descrambler just arrived. That same night while trying to decrypt a pay per view adult channel, they pick up the distress signal of an alien spaceship crash-landing in the woods near their town… Things only get weirder as they realize that the towering alien is killing very specific members of their community!<br />\nExplore the world oozing with nostalgia, check the Video Buster Store for clues, challenge other kids at the Laser Llamas Arcades, go learn a new trick at The Emerald Sword comic store, try to get along with the punk looking Lost Boys at their hideout or even dare to ask THE BULL, the quintessential 80s Action hero, for some help!<br />\nFollow the story that pays tribute to 80s classics like The Goonies, The Explorers, Monster Squad, The Lost Boys, They Live, Terminator, and Aliens among others and a gameplay that combines mechanics of Point and Clicks masterpieces like Full Throttle with its own unique twist and more.<br />\nYour decisions do matter, and the way you make these three friends interact with each other increasingly affects their friendship and the whole story, changing the way they solve the game puzzles, the locations they visit, the answers they find, the story, everything.<br />\nUncover the truth hidden behind the alien invasion… well sort of. Why here? Why is it killing locals? How can the boys stop it? Will they tune in the adult channel after all? The answers to these and other questions… in Unusual Findings.<br />\nFollow the Sci-Fi coming-of-age story. Three friends fighting together against the unknown… things (maybe against some known things too).<br />\nSee, Grab and Talk action tokens, an inventory to use and combine items and your wits it’s all you need to play.<br />\nStylized Pixel Art. All the charm of pixel art of the past with more colors and the new effects of the future. Some pixels look so real they can almost jump out of the screen<em><br />\nGo back to a simpler time where mix tapes were a thing, Commodore 64 was a king, kids could play outside late at night and the only thing to worry about was THE GIANT KILLER ALIEN TRYING TO GET YOU AND YOUR FRIENDS.<br />\nThe decisions you make affect the relations between characters and thus the puzzles, the game progression and the story.<br />\nThe most radical music a synthesizer can play. Cool popular Synthwave Music alongside catchy tunes made exclusively for the game to power up the 80s vibes.<br />\n</em>The pixels do not actually jump out of the screen, In case you actually see a pixel jumping out the screen please visit an ophthalmologist... or/and look for psychological help.</p>", "metacritic": null, "released": "2021-10-07", "tba": false, "updated": "2023-07-17T05:41:18", "background_image": "https://media.rawg.io/media/screenshots/93c/93c7cb8936bbdbb2d8f83327978af17c.jpg", "website": "", "rating": 3.88, "rating_top": 4, "added_by_status": {"yet": 4, "owned": 55, "beaten": 6, "toplay": 13, "dropped": 1}, "playtime": 3, "achievements_count": 30, "ratings_count": 8, "suggestions_count": 319, "game_series_count": 0, "reviews_count": 8, "platforms": ["PC", "Nintendo Switch"], "developers": ["Buka Entertainment", "Epic Llama Games"], "genres": ["Adventure", "Indie", "Puzzle"], "publishers": ["ESDigital Games"], "esrb_rating": null}