{"id": 67468, "slug": "high-school-story", "name": "High School Story", "name_original": "High School Story", "description": "Live high school your way! <br/><br/>5/5 \"Out of all the iPhone games I've played, High School Story is easily the one with the most heart.\" - K. Alpert<br/><br/>5/5 \"I'm way past my high school years... but this game is hands down one of the best games I have ever played.\" - Kaytumbear99<br/><br/>Meet All-Star classmates in all-new exclusive stories! Add them to the school of your dreams, filled with all your friends. Throw parties, go on dates, and recruit jocks, nerds, cheerleaders, and MANY MORE classmates to unlock their stories! Go on wild trips, take your team to the next level, and discover hundreds of other adventures!<br/><br/>- ADD SPECIAL CHARACTERS to your school, and unlock exclusive stories!<br/>- THROW PARTIES to unlock over 30 characters!<br/>- DATE your crush and play matchmaker for everyone at your school!<br/>- BATTLE a rival high school in an evolving story, including a showdown at the Homecoming game, a science fair, a prank war, and more!<br/>- PUT YOUR FRIENDS in the game and join them on adventures, dates, and parties!<br/>- MAKE NEW FRIENDS and play their stories!<br/>- BUILD your dream school and decorate it with everything from a half-pipe to a box of puppies!<br/>- CUSTOMIZE your look and choose your clique!<br/>- LEARN new vocabulary in fun mini-games!<br/>- ENJOY tons of new content every week, including more characters, more stories, and more romance!<br/><br/>Please note that High School Story is completely free to play, but you can purchase some game items with real money. If you don’t want to use this feature, you can disable in-app purchases in your device’s settings.<br/><br/>-----------------------------------------------<br/>To our players:  Thank you for your passion.  Pixelberry is a firm believer that games can make a difference.  And you’ve proven they can.  <br/><br/>When we partnered with non-profits, like The Cybersmile Foundation, a cyberbullying non-profit, and the National Eating Disorders Association (NEDA) you responded with great enthusiasm.  Together, we’ve done some amazing things. <br/>* Over 4 million players have learned more about cyberbullying.<br/>* Over 30,000 players have visited NEDA's sites to learn more about eating disorders.<br/>* And thousands of players have reached out to Cybersmile, often for help with bullying.<br/><br/>Thank you!  We really, sincerely appreciate your enthusiasm and support.<br/><br/>- The Pixelberry Team<br/><br/>-----------------------------------------------<br/>Your use of this application is governed by the Terms of Service available at: http://highschoolstory.com/terms-of-service/<br/>Collection and use of your data are subject to the Privacy Policy available at:<br/>http://highschoolstory.com/privacy-policy/<br/><br/>Get the game now to join in the fun!<br/><br/>Chat with us: facebook.com/HSSgame<br/>Follow us: twitter.com/HSSGame", "metacritic": null, "released": "2013-08-01", "tba": false, "updated": "2019-07-29T10:36:39", "background_image": "https://media.rawg.io/media/screenshots/b89/b8956cb7b89a9a9ccb83bc18feb77741.jpg", "website": "http://www.highschoolstory.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 166, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["Pixelberry Studios", "Pixelberry"], "genres": ["RPG", "Simulation"], "publishers": ["Pixelberry Studios"], "esrb_rating": "Everyone 10+"}