{"id": 674621, "slug": "ufo-elstudio314", "name": "U.F.O. (elStudio314)", "name_original": "U.F.O. (elStudio314)", "description": "<p>Inspired by the STOP WAITING FOR GODOT jam I decided to try to learn Godot. Sadly I could not participate due to lack of time, so I set myself a limit of roughly two and a half to three days (the time I imagined I'd realistically would have had during the jam), started reading and watching tutorials and began coding. The result is this little game.</p>\n<p>What can I say? I had a lot of fun with the engine, and decided to work a little more on this project. The \"JAM result\" will still be downloadable here, but the browser version will be updated (hopefully regularly).</p>\n<p>Hope you have fun with the game. I am very grateful for any kind of feedback!<br/></p>\n<p><strong>Goal <br/></strong>Transport all the animals (rectangular cuboids) on board your spaceship and avoid (or kill?) the people (cubes) who want to keep them for themselves.<br/></p>\n<p><strong>Rules<br/></strong>Animals can be brought on board your spaceship with the tractor beam. Cows (large rectangular cuboids) give more points than sheep (small rectangular cuboids), but they also take longer to pick up and therefore consume more energy.</p>\n<p>You can also use your energy to defend yourself against the people (attack them) who throw their projectiles at you.</p>\n<p>The game ends when you have freed all the animals or your health drops to zero.</p>\n<p><strong>Controls</strong></p>\n<strong>Action</strong><strong>Keyboard</strong><strong>Controller</strong>MovementWSAD or Arrow KeysLeft Stick<br/>Tractor BeamSpaceFace Button South<br/>(e.g. Xbox : A, PS: X)AttackE or Ctrl/StrgFace Button West<br/>(e.g. Xbox: X, PS: Square)PauseESCStart\r\n<p>--------------------------------------------------------------------------------------------------------<br/></p>\n<p><strong>FAQ\r\n<br/></strong>Probably.\r\n</p>\n<p><em>Q: The game freezes when I press \"EXIT\" . Why?</em><br/>A: Sorry for that. I forgot to hide the button in the HTML build.  It was only meant to be there in the desktop builds. Reloading the page is the only way to restart the game if this happens.</p>", "metacritic": null, "released": "2021-10-07", "tba": false, "updated": "2021-10-08T05:33:19", "background_image": "https://media.rawg.io/media/screenshots/f98/f983810fd6f440db68848e226e5c9b3c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["elStudio314"], "genres": [], "publishers": [], "esrb_rating": null}