{"id": 674698, "slug": "tumbletile", "name": "TumbleTile", "name_original": "TumbleTile", "description": "<p>TumbleTile is a competitive board game where you must knock all of your opponent's chips from the board. This is done by creating and using holes in the board by overloading tiles on it.</p>\n<p>Seeing as this is just a prototype right now, I'll have to describe how to play here, as there is no in-game tutorial.</p>\r\nGame Rules\r\n<ol>\n<li>\r\nA stack of chips is owned by whichever player has the top chip.\r\n</li>\n<li>A player can only move a stack of chips they own.\r\n</li>\n<li>A player can move chips from a stack they own in a straight line.\r\n<ol>\n<li>The movement range is up to how many chips are on the tile.\r\n</li>\n<li>Chips are dropped from the bottom of what you \"picked up\" as you move along the line. So, if you pick up three chips to move three tiles, the bottom will be dropped first, then the middle, then the top chip. The top chip of what you grabbed will be what goes to the end of your move.\r\n</li></ol>\n</li><li>\r\nPlacing 6 chips on a stack causes the tile to fall. All chips on the tile are lost, and moves can no longer end there.\r\n</li>\n<li>\r\nMoves that pass over a fallen tile will lose whatever chip would have dropped on that tile.\r\n</li>\n</ol>\n<p>\r\nThe game ends when either player runs out of chips or has no moves left to make on their turn.</p>\n<p>The yellow indicator shows whose turn it currently is, and possible moves will be highlighted when you click a starting tile.</p>\n<p><strong>If you have any questions or run into any issues, please let me know in the comments!</strong><br/>\n</p>\n<p>Source: https://github.com/Syldarion/TumbleTile</p>", "metacritic": null, "released": "2021-10-06", "tba": false, "updated": "2021-10-08T05:55:20", "background_image": "https://media.rawg.io/media/screenshots/ab1/ab115b7dd7839168c76749869369e897.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 6, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Syldarion"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}