{"id": 674625, "slug": "slice-smash-break-it-all", "name": "Slice Smash - Break it all", "name_original": "Slice Smash - Break it all", "description": "<p>Latest release:</p><p>Google Play:\r\n</p>\n<p>Slice Smash - Break it all - Apps on Google Play\r\n</p><p>Slice Smash - Break it all is an exciting and fun game where players destroy slices into pieces by the Swipe right and left and avoid obstacles and win different prizes<br/></p><p>You will definitely LOVE:<br/><br/>- The Player smashing action is so strong and impressive<br/>- The Player can choose 8 unique characters<br/>- Beautiful 3D levels with straight and curved paths to the finish<br/>- Colorful slices to break , obstacles and enemies to avoid<br/>- Simple one-finger control 👆<br/>- Walking or Running - Speed and difficulty defined by players<br/>- Collect Trophy Awards for Good, Great and Perfect play<br/>- Engaging music and sound effects with voices and vibration<br/>- Challenging - Easy to Play but difficult to Master<br/>- Best time killer<br/><br/>Why Slice Smash: Break it all rules:<br/>👍 Addictive<br/>👍 Crazy fast speed and dynamic gameplay (Walking and running)<br/>👍 Fun gameplay<br/>👍 Bright vibrant and unique 3d graphics with multiple themes<br/>👍 Engaging music and sound effects<br/>👍 Challenging - Easy to learn but difficult to master<br/>👍 Great time killer<br/><br/>Which level can you get to ?! Slice Smash - Break it all is ready to challenge you! Choose your character and Smash Slices and Win prizes.</p>\n<p>Google Play:</p>\n<p>Slice Smash - Break it all - Apps on Google Play<br/></p>", "metacritic": null, "released": "2021-10-07", "tba": false, "updated": "2021-10-08T05:34:41", "background_image": "https://media.rawg.io/media/screenshots/c48/c48c1c8d5c39aa61a29e99e7170b6cc5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 151, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Nirhan"], "genres": ["Action"], "publishers": [], "esrb_rating": null}