{"id": 674623, "slug": "juggernaut-itch-elstudio314", "name": "Juggernaut (itch) (elStudio314)", "name_original": "Juggernaut (itch) (elStudio314)", "description": "<p>This is a small game on the topic of species extinction, which was created as part of the lecture \"Medienproject\" at the university. The task was to present one topic with the help of different media.  The last part of the assignment was the implementation as an interactive medium.<br/></p>\n<p><strong>Goal<br/></strong>Asphalt the whole world to make enough space for every human being. Or not. It's up to you.</p>\n<p><strong>Rules<br/></strong>You got 60 seconds to produce as much living space as possible.  You can only asphalt green areas  (no matter what else is on them) and cannot drive into cities.<br/>But be careful: each move uses fuel. </p>\n<p><strong>Controls</strong>WSAD or arrow keys to move.</p>\n<p>--------------------------------------------------------------------------------------------------------</p>\n<p><strong>Audio</strong><br/>Diesel idle 1 by C-V (freesound.org) [parts of]<br/>Breaking bones by apolloaiello (freesound.org) [parts of]<br/>DS-walking &gt; Running through grass by Slave2theLight (freesound.org) [parts of]<br/>Mini Airplane Alarm by CaptainBusiness67 (freesound.org)<br/>Countdown &gt; 10 sec countdown by dbosst (freesound.org)<br/>Electric Punishment by Adam Vitovsky (adamvitovsky.com)</p>\n<p><strong>Font</strong><br/>CGF Arch Reactor by Chris Garrett (dafont.com)</p>\n<p>--------------------------------------------------------------------------------------------------------</p>\n<p><strong>FAQ<br/></strong>Probably.</p>\n<p><em>Q: How can I create so little living space when I have asphalted so much of the earth?</em><br/>A: The ratio of area used by humans to unused wilderness is not correct. If it were realistic, far too little area would be created on which the player can move. The green areas symbolise the approx. 22,000,000 km² (ca. 15% of the total land area) of unused, wild natural spaces that still exist. Partially used area is excluded here.<br/></p>\n<p><em>Q: Is there a way to end the game early? Where is the game menu?<br/></em>A: Nope. Once you have started, you must complete your work until either time or fuel runs out. As soon as you have started to change the living space, there is no turning back.</p>\n\n<p><em>Q: I can't move more than 5 squares. What the heck?</em>A: The grid is built completely randomly. It is possible to get a level where humanity has built its cities, so you can't get any further or reach every green space. </p>\n\n<p><em>Q: How can I remove the hideous *insert colour here* bars on the sides of the fullscreen image?</em><br/>A: Sadly, you can't do that at the moment, as far as I know. Part of the non-optimised state of the game is the limitation to only one aspect ratio of the resolution - 16:9. Other values lead to bars on the sides. Unfortunately, these can sometimes be very unattractive. More supported settings are possible for later releases. In the current state, however, the game is sometimes partially cut off when I enable the option, which is why it is presently deactivated. You can run it in window mode, though.</p>\n<p><em>Q: Will this game be completed at some point (aka V1.0)?</em><br/>A: To this I can answer quite clearly: Perhaps! For now I'm heading to the next assignments, but I hope to come back and improve one or two things. I don't think there will be more features in future, since the primary goal was to make a playable prototype, and therefore it's not very modular. But who knows...<br/>But to be honest: the version numbers used here were more of a rough estimate than real representation of state.</p>", "metacritic": null, "released": "2021-10-07", "tba": false, "updated": "2021-10-08T05:33:41", "background_image": "https://media.rawg.io/media/screenshots/2c7/2c7e6734a35a9601e95adc7979517508.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Web"], "developers": ["elStudio314"], "genres": [], "publishers": [], "esrb_rating": null}