{"id": 674894, "slug": "customech", "name": "Customech", "name_original": "Customech", "description": "Welcome to the infinite possibilities of Customech v0.1!\r\n<p>Customech is Arkhein Games' submission for MechJam2.  Customech is a 2 person 2D fighting game where players can customize their mechs with user made components. These mech parts can have user created animations and stats.\r\n </p>\r\nInstallation Instructions\r\n \r\n<ol><li>Copy Customech.exe, CustomechBaseUserData.zip, and CustomechDataExtractor.bat to your preferred installation folder\r\n</li><li>Run CustomechDataExtractor.bat. This will copy the necessary files  to your user data folder. This is only necessary before the FIRST time  you run Customech.\r\n</li><li>Run Customech.exe\r\n</li></ol>\r\nAdding Custom Components\r\n \r\n<ol><li>Anytime after initial installation, open the folder located at C:\\Users\\%USERNAME%\\AppData\\Roaming\\Godot\\app_userdata\\MechJam2</li><li>Add any custom part images to the ComponentImages subfolder \n<ol><li> Note: Custom images should be the same size and include the blue \"sockets\" in the same size/position as our base cores, arms, and legs. The projectile only needs to meet the size requirements. It is recommended to copy and edit one of our included images when making a custom component.\r\n</li></ol></li><li>Add a line to PartsListV1_0.csv containing \n<ol><li>Your part name in the first column</li><li>The part type in the second column. Valid types are Core, Legs, Arms, and Projectile</li><li>The part level in the third column. Part levels should be greater than zero and less than 5. Part levels can include decimals. Leg level determines speed, projectile level determines projectile damage, core level determines health, and arm level determines projectile speed. </li><li>The filename of the \"stationary\" image of your part in the fourth column </li><li> Any additional image filenames used in your part's animation to the next columns in order\r\n</li></ol></li><li>Launch the game and enjoy your custom component!\r\n</li></ol>\r\nFinal Notes\r\n<p>The game is in very early development. It's super buggy, the UI needs a lot of love, and the core mechanics need balancing and rework. That being said, we had a blast starting on this game and we hope you can enjoy it for what it is!</p>\n<p>- The Arkhein Games Development Team</p>", "metacritic": null, "released": "2021-10-06", "tba": false, "updated": "2021-10-08T06:41:52", "background_image": "https://media.rawg.io/media/screenshots/0dd/0dd5ac8d2799ba24cfd5baf1c22ca448.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 24, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jetewr"], "genres": ["Fighting"], "publishers": [], "esrb_rating": null}