{"id": 674947, "slug": "ww1-no-mans-land", "name": "WW1 - No Man's Land", "name_original": "WW1 - No Man's Land", "description": "<p>Hi! Thanks for checking this page out! </p>\n<p>So some quick background first. I am Diego Avena. I consider myself to be more of a programmer, but I have also done a lot of work with pixel art and 2D vector art, so I can hold my ground in this area for the most part (hopefully hehe). Up to now, I have completed about 4 Unity games, with 1 of those, a 4 member team project called Sengoku - A Time of Warriors and Demons, being published on Steam.  Besides Unity, I have also completed a variety of other programming projects, especially in C++, so I would say my 2 main programming languages are C# within Unity, and C++. Feel free to check out my itch.io account for those other Unity games I mentioned here, or you can also see my website with all the programming projects I have done up to now.</p>\n<p>Ok, so a while back I designed a physical board game for my level design class. The board game was a turn based strategy game based on WW1 trench warfare. Having the game design basically done, I thought why not try and take that physical version and adapt it into a Unity game, so now here I am trying to do just that. </p>\n<p>This game is still very early in its development, and so things are still a bit rough (especially with this itch.io page), but I hope to take it all the way to the finish line. My plans are to ultimately have 3 modes in the game: a pvp mode where 1 player plays against another locally on the same machine, a player vs ai mode, and a multiplayer mode where players can search for opponents online.  For the networking part, I am planning to make use of Photon networking, since its the one I have had the most experience so far in terms of networking Unity games, though I will be looking into other alternatives as well before making my final decision. <br/></p>\n<p>As of now, I got the early beginnings of the top down movement system. I think one of the biggest challenges I will face is making the AI, though I also think this will be the funnest part of the project, and I am super excited to finally reach this part. Before I can start programming the AI though, I need to get all the main game mechanics solidified (otherwise whats the point of making the AI if I have no actions for it to perform haha). From this, my priorities right now are getting the movement system in, the die system in, along with the card systems. </p>\n<p>I am going to strive to document my entire dev process as well. Due to this, I will be uploading a devlog each day (even though some of them may be short), and try to have a video showing what new features were added. </p>\r\nSome art from the board game itself\r\n<p>I am planning to do an entire re-skin of the art I did for the physical board game, since I want a pixel art look; however, below is the 2D vector art I created in Adobe Illustrator for the physical version of this board game! </p>\n\n\n<p>(The board itself, which has 3 trenches)</p>\n\n<p>(Some of the non lethal cards players can choose from)</p>\n\n\n<p>(Some of the lethal cards players can choose from)</p>\n\n\n<p>(The troop pieces, consisting of British and German forces)<br/></p>\n<p>As of now, none of the actual art for the game is ready, but I am not planning to get started on that until I am happy with the programming side of things, since I want to avoid having to redo art because some mechanic did not work out the way I intended, etc. (This was a mistake I made a while back on my game called The Gloom).</p>\n<p>Well, this is all for now! Like I said before, this page will be getting updated, particularly through the dev logs section, as I develop the game. I am planning to work on this project for about 4-5 hours each day, so there will hopefully be a lot of progress (depending on how productive I manage to be or if any roadblocks appear, which, from my experience in game dev so far, are bound to occur, ahhhhhh!!!). </p>\n<p>Also, don't forget to check out my devlog section if you are interested in keeping up to date with the project! </p>", "metacritic": null, "released": "2021-10-06", "tba": false, "updated": "2021-10-08T06:55:47", "background_image": "https://media.rawg.io/media/screenshots/0ec/0eca04cc4368ae9aea06847914356c67.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 61, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Diego A."], "genres": ["Action", "Strategy"], "publishers": [], "esrb_rating": null}