{"id": 67501, "slug": "car-driving-school-simulator", "name": "Car Driving School Simulator", "name_original": "Car Driving School Simulator", "description": "Get behind the wheel and start your lessons in the most realistic city driving simulator around! This is a game that will not only test your skills in controlling the car but also demand full attention to traffic rules. You will have to mind the stop signs, intersection lights, remember to use your blinkers, turn on your wipers where necessary… If you’re looking for the most genuine driving experience, you’ve surely come to the right place!<br/><br/>Car Driving School redesigned! With the newest update we changed how the game is structured. Instead of unlocking whole maps and having to do all of the content there you now have the ability to select mission packs that interest you the most. We also redesigned how the garage works. Please note that those changes do not affect content that you’ve already unlocked in the game.<br/><br/>The update also introduced a completely new content! A new Tokyo map is now available for high speed driving. Free Roam has also been introduced as a brand new game mode.<br/><br/>We hope that you enjoy all of the new features and we look forward to bringing new and exciting additions to Car Driving School in the future! This update is only the beginning! <br/><br/>After a tutorial that will teach you all the rules in a closed training course you will be able to explore multiple different open city environments. Everything you’ve learned will be put to the test there in missions that you will approach in a variety of cars. In addition to that you can also compete with other people online in free roaming challenges!<br/><br/>24 UNIQUE CARS<br/>The game features a really wide selection of cars. You will have to show your driving skills in multiple sedans, pickup trucks, a muscle car, some 4x4s, buses and – to top it off – a powerful supercar. Now after a Christmas Update you can also drive Santa’s Sleigh!<br/><br/>REALISTIC TRAFFIC<br/>Driving around the city is a challenge on its own, especially when you have to abide by the rules. But it’s not all you will have to think about! The areas you will be cruising around are populated by realistic traffic. Be careful not to crash!<br/><br/>ONLINE MULTIPLAYER FREE ROAMING MODE<br/>When you’re done with all the missions in the single player or just looking for a change of pace, you can try something different in our new multiplayer mode! There you will get points for driving with accordance to law and additional bonuses for collectibles. Compete with other players locally or globally over the internet and see who’s the best driver!<br/><br/>FREE TO PLAY<br/>The Main Game Mode is 100% FREE to play, all the way through, no strings attached! Extra Game Modes which alter the rules slightly to make the game easier are available through optional In-App Purchases. Each mode has separate leaderboards to make for totally fair competition!<br/><br/>GAME FEATURES<br/><br/>▶ HUGE CAR COLLECTION: Feel truly free driving 24 Awesome Cars (including Santa’s Sleigh!)<br/>▶ MULTIPLE MAPS TO EXPLORE: Tutorial Course, California, Aspen, Canada, Las Vegas, New York, Miami and Frozen Lake<br/>▶ FREEDRIVE UPDATE: Learn to drive in a stress free environment on all maps available in the game! Enjoy the game without limitations, focusing on what you like!<br/>▶ DYNAMIC TRAFFIC: Deal with Real Traffic AI<br/>▶ PRO PARKING MISSIONS: Huge campaign to beat, earn in-game money for your progress<br/>▶ 100% Free to Play Missions<br/>▶ CONTROLS: Buttons, Wheel, Tilt &amp; MFi Game Controller Support<br/>▶ CAMERAS: Multiple cameras including First Person view for full immersion<br/>▶ iCLOUD: Supports play between your devices &amp; automatic progress backup with iCloud", "metacritic": null, "released": "2017-08-09", "tba": false, "updated": "2019-07-30T22:55:16", "background_image": "https://media.rawg.io/media/screenshots/2b1/2b1a0c98e5586371030d94fe8f8b6315.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 139, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["BoomBit", "BoomBit Games"], "genres": ["Sports", "Racing"], "publishers": ["BoomBit"], "esrb_rating": null}