{"id": 67508, "slug": "microsoft-solitaire-collection", "name": "Microsoft Solitaire Collection", "name_original": "Microsoft Solitaire Collection", "description": "<p>The World&#39;s #1 Solitaire game is now on iPhone and iPad!</p>\n<p>For over 25 years, Microsoft Solitaire Collection remains one of the most played games of all time and is now available FREE for your iPhone or iPad!</p>\n<p>The Microsoft Solitaire Collection offers FIVE of the best Solitaire card games in one app!</p>\n<p>KLONDIKE<br />\nTimeless &amp; Classic Solitaire. Clear all the cards from the table using one or three-card draw. Also try out Traditional or Vegas scoring! </p>\n<p>SPIDER<br />\nEight columns of cards await you. Clear them all with fewest moves possible. <br />\nPlay single suit or challenge yourself with four suits! </p>\n<p>FREECELL<br />\nBe strategic and use the four extra cells to move cards around and try to clear all cards from the table.  <br />\nFreeCell rewards players who think several moves ahead. </p>\n<p>TRIPEAKS<br />\nSelect cards in a sequence, earn combo points, and clear as many boards as you can before you run out of deals!</p>\n<p>PYRAMID <br />\nCombine two cards that add up to 13 to remove them from the board. Challenge yourself to reach the top of the Pyramid and clear as many boards as you can!</p>\n<p>DAILY CHALLENGES<br />\nPlay new guaranteed solvable challenges in all 5 game modes with 4 levels of difficulty every day!  By completing Daily Challenges, you will earn badges and rewards!</p>\n<p>XBOX LIVE SUPPORT<br />\nSign in with your Microsoft account to earn Xbox Live achievements and compete with your friends and family. Continue playing on any Windows 10, iPhone or iPad device because your progress and game data will be saved in the cloud!</p>\n<p>Upgrade to Premium on iPhone and iPad<br />\nYou can now get the Microsoft Solitaire Collection Premium Subscription for $1.99 per Month or $9.99 per Year.  With  Premium Subscription you get these great features:<br />\nWith Premium Edition you get these great features:<br />\n•             No Advertisements<br />\n•             More coins for completing Daily Challenges<br />\n•             Get a boost for every game of TriPeaks and Pyramid<br />\n•             NOTE: this will not grant Premium on other platforms</p>\n<p>Payment will be charged to your iTunes Account on confirmation of purchase. Subscription automatically renews monthly or annually depending on the subscription type purchased. Payment will be charged to your iTunes Account within 24-hours prior to the end of the current period ($1.99 monthly, or $9.99 annually, depending on the subscription type purchased). You can turn off auto-renewal by going to your Account Settings after purchase. If auto-renewal is turned off at least 24-hours before the end of the current period, you will not be charged for the next period.  All cancellations will take effect at the end of the current period.</p>\n<p>For more information visit: https://zone.msn.com/microsoftcasualgames/casualsuite/support/default.htm <br />\nPrivacy policy: https://aka.ms/privacyioslink/ <br />\nTerms of Use: https://www.microsoft.com/en-us/servicesagreement/</p>", "metacritic": null, "released": "2016-11-23", "tba": false, "updated": "2024-02-24T17:32:38", "background_image": "https://media.rawg.io/media/screenshots/3e7/3e728c858ebd673e099cab3558a47d42.jpg", "website": "http://microsoftcasualgames.com/index.htm", "rating": 3.34, "rating_top": 4, "added_by_status": {"yet": 5, "owned": 393, "beaten": 25, "dropped": 34, "playing": 11}, "playtime": 0, "achievements_count": 40, "ratings_count": 96, "suggestions_count": 205, "game_series_count": 0, "reviews_count": 97, "platforms": ["Android", "PC", "iOS"], "developers": ["Microsoft"], "genres": ["Card"], "publishers": ["Microsoft Studios"], "esrb_rating": null}