{"id": 675009, "slug": "sumire-itch", "name": "Sumire (itch)", "name_original": "Sumire (itch)", "description": "<p>Note: Thank you for considering Sumire! When buying Sumire on itch.io you will receive a Steam key to play the game using your Steam account. (At this time there is not a separate downloadable game here on itch.)</p>\n<p><strong>Sumire</strong> is an indie narrative adventure, featuring a one-day journey through a picturesque Japanese village. In this enchanted place, a disenchanted girl named Sumire meets a mischievous spirit who makes her a deal to fulfill her most desired wish.</p>\n<p>But in order to see this wish come true, she must complete a series of tasks in return, before night falls and this special day reaches its end.<br/><br/><br/></p>\r\nA Narrative Quest-Driven Adventure\r\n<ul><li>Follow Sumire on a series of quests both big and small, given by charming forest creatures, quirky townspeople, and Sumire's own heartfelt needs.<br/>Take or refuse them, but be wary: as the day progresses, your path will change and you may never get the same chance again.<br/>\n</li><li>Discover collectibles, bonus items, tests of skill, and other challenges -- some hidden, some not.<br/>\n</li><li>Explore a variety of lush, beautiful environments rendered in a painterly style.<br/>\n</li><li>A one day time limit. With the sky changing from the promise of morning to the soft twilight, all choices are finished when the sky turns to violet.\r\n</li></ul>\n\r\nBetween the Magical and the Mundane\r\n<ul><li>For a single day, the magical world crosses with ordinary life for Sumire.<br/>\n</li><li>Within this ambiguous time, be extra mindful of words, choices, and actions taken.<br/>\n</li><li>What awaits at the end of the day...?</li></ul>\n\r\nA Day to Remember, and Choices to be Made\r\n<ul><li>Guide Sumire through her reality, her dreams, and her memories.<br/>\n</li><li>As the sky changes throughout the day, Sumire too must come to terms with the changes that have affected her life, as well as those around her.<br/>\n</li><li>How Sumire ultimately addresses these matters is influenced by the player's guidance, seeking to turn a life unlived into a final dream come true.<br/>\n</li></ul>", "metacritic": null, "released": "2021-09-21", "tba": false, "updated": "2021-10-08T07:12:02", "background_image": "https://media.rawg.io/media/screenshots/0b5/0b514d4b88afaad6b2c5a9dc87407ec6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 252, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["GameTomo"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}