{"id": 675116, "slug": "river-tails-stronger-together-alpha-demo", "name": "River Tails: Stronger Together - ALPHA DEMO", "name_original": "River Tails: Stronger Together - ALPHA DEMO", "description": "River Tails: Stronger Together\r\n(alpha-demo)\r\n\n<p>Pick a trusted teammate and prepare to experience an epic couch co-op journey through nature in all its glory!</p>\n\n\n<p>With distinctive asymmetrical gameplay and a colorful cartoon aesthetic, <strong><em>River Tails: Stronger Together</em></strong> is a 3D action-adventure platformer designed around a unique couch co-op system. Friends get the chance to team up and work together to defeat end-of-level bosses and solve puzzles across different natural-world environments.</p>\n<p>Take a deep breath and plunge into an immersive world of lush vegetation and glistening waters with Furple the cat &amp; Finn the fish. Traveling together through woodland and river, help them return home in time to fight off the white wolf that is threatening Furple's family.</p>\n\n\n\n<p>Embark on an epic and visually stunning journey across land and water, explore the flora of an uncharted tropical forest, soak up the magical atmosphere of its caves, meet a wide range of local wildlife – though be sure to work out which are your friends and which are foes before it’s too late! \r\n</p>\n<p>Leap, dive, dart, dodge... and find out how a cat and a fish decided to join forces for an adventure they would never be able to survive alone.</p>\n\n\n<p>Features:</p>\r\n Local Co-op Mode ( keyboard&amp;mouse - keyboard&amp;controller - 2 controllers)\r\n Single Payer \"Lone Wolf\" (two analog sticks controller needed)\r\n<p> Mysteries and river secrets waiting to be found</p>\n<p> Innovative and constantly evolving gameplay</p>\n\r\nWe want to hear your feedback!\r\n<p>!Please be aware this is an alpha demo and you are going to experience bugs.</p><p>!CONTROLLER we had the chance to test it with dual shock 4 and Xbox one controller, we can't guarantee other controllers for now, but please report to us and we can do our best to make it works in the new releases.<br/></p>", "metacritic": null, "released": "2021-10-05", "tba": false, "updated": "2021-10-08T07:38:48", "background_image": "https://media.rawg.io/media/screenshots/2f5/2f5f16fb50a6fa93ee0c0571f511317e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 179, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kid Onion Studio"], "genres": ["Adventure", "Platformer"], "publishers": [], "esrb_rating": null}