{"id": 67520, "slug": "episode-choose-your-story", "name": "Episode - Choose Your Story", "name_original": "Episode - Choose Your Story", "description": "Episode lets you LIVE your stories with love, romance, adventure, and drama. Wouldn’t it be amazing if YOU were a character in your favorite story? Episode lets you do just that with over 100,000 gripping stories, where you make choices that matter.<br/><br/>With billions of reads, Episode is the world’s largest collection of interactive stories where YOU choose your destiny. Or become a creator and write your own!<br/><br/>How does it work?<br/>• Customize your avatar and design your outfit<br/>• Develop relationships with your favorite characters - will they be rivals or lovers?<br/>• Change fate through your choices<br/>• Discover all of the different endings<br/>• Immerse yourself in thousands of diverse worlds, the options are endless!<br/><br/>Not only can you read your favorite stories, you can also write your own! Write and publish your very own interactive stories on Episode’s platform, ammassing millions of reads yourself.<br/><br/>Some of our favorites include:<br/><br/>THE BABY PROJECT. Your world is turned upside down when you’re paired with a mysterious new *HOT* student for Riverside High’s “Baby Project.” This high school drama will leave you breathless.<br/><br/>PRETTY LITTLE LIARS. Will you and the other liars be able to uncover the mysterious “A” as she threatens to blackmail you? All is not what it seems in this original twist on the hit TV series.<br/><br/>I MARRIED A PRINCE. You are forced to marry a prince due to an ancient family contract. Will you end up falling in love in this modern day fairytale? Tread carefully, or your fortune might unravel at your feet….<br/><br/>DEMI LOVATO: PATH TO FAME. When you win a chance to tour with the one and only superstar Demi Lovato, your ability to balance love, friends, and fans is put to the test! Will you make it to the final stage?<br/><br/>BAD BOY’S GIRL. Tessa’s had a crush on Jay Stone for years. But when his half-brother Cole Stone comes back to town, everything changes. Will you play it safe or chance crossing the line?<br/><br/>STARTED WITH A LIE. A little lie leads to the romance of a lifetime - but also a massive murder investigation. How will you react when thrust into the media spotlight while untangling this mystery? <br/><br/>Other goodies include:<br/>• Mean Girls: Senior Year<br/>• The Royal Baby<br/>• My Brother’s Best Friend<br/>• Clueless: School’s Out<br/>• It Started With a Bra<br/>• Falling for the Dolan Twins<br/><br/>PLUS… more new stories EVERY WEEK!<br/><br/>PRETTY LITTLE LIARS and all related characters and elements © &amp; ™ Warner Bros. Entertainment Inc. (s18)<br/>TM &amp; ©2018 Paramount Pictures. All Rights Reserved.<br/>™ &amp; ©2018 Universal Studios<br/><br/>PLEASE NOTE: Episode lets you purchase items within the game for real money. Please disable in-app purchases on your device if you do not want this feature to be accessible.<br/><br/>EPISODE UNLIMITED SUBSCRIPTIONS:<br/>You can subscribe for unlimited access to Episode content<br/>The subscriptions are $2.99 weekly, $7.99 monthly and $39.99 annually*<br/>You'll be able to access unlimited stories for the duration of your subscription<br/>Payment will be charged to iTunes Account at confirmation of purchase<br/>Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period<br/>Account will be charged for renewal within 24-hours prior to the end of the current period<br/>Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's Account Settings after purchase<br/>No cancellation of the current subscription is allowed during active subscription period<br/>Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication<br/>*Prices are equal to the value that \"Apple's App Store Matrix\" determines is the equivalent subscription price in $USD<br/><br/>Your use of this application is governed by the Terms of Service available at http://pocketgems.com/episode-terms-of-service/. Collection and use of your data are subject to the Privacy Policy available at http://pocketgems.com/episode-privacy-policy/.", "metacritic": null, "released": "2013-12-18", "tba": false, "updated": "2023-01-20T21:03:36", "background_image": "https://media.rawg.io/media/screenshots/6cf/6cffd429041ea287e3cd8b1d53a9dfc5.jpg", "website": "https://pocketgems.com/episode/", "rating": 3.75, "rating_top": 4, "added_by_status": {"owned": 4, "beaten": 1, "toplay": 2, "dropped": 5, "playing": 4}, "playtime": 0, "achievements_count": 0, "ratings_count": 7, "suggestions_count": 299, "game_series_count": 0, "reviews_count": 8, "platforms": ["Android", "iOS"], "developers": ["Episode Interactive"], "genres": ["RPG", "Simulation"], "publishers": ["Episode Interactive"], "esrb_rating": null}