{"id": 675207, "slug": "ceibaia", "name": "Ceibaia", "name_original": "Ceibaia", "description": "<p>Juego de plataforma que combina diferentes transformaciones que ayudaran al jugador a poder pasar los diferentes niveles, el cual va acompañado de una aventura narrativa, donde puedes descubrir lugares y charlar con NPCs.</p>\n\n<p><strong>PARA DISFRUTAR MEJOR LA EXPERIENCIA JUEGALO EN  PANTALLA COMPLETA</strong></p><p><strong>IMPORTANTE: PARA CAMBIAR DE PERSONAJE, PRESIONAR 1, 2 Y 3</strong></p>\n\n<p><strong>Historia</strong>\n</p>\n<p>Año 2035, ciudad de Medellín.\r\n</p>\n<p>El mundo ha cambiado, millones de personas están viviendo en una ciudad sumergida en el caos, los avances tecnológicos que se dieron durante años tuvieron una desconexión con la naturaleza causando un caos irremediable, la ciudad futurista soñada se quedó en el solo olvido de los ciudadanos, donde la esperanza de una mejor vida ha desaparecido.\r\n</p>\n<p>¿Cuál es el costo de esta desconexión? ¿Hay esperanza para Medellín?\r\n</p>\n<p>En otro plano astral existe un espacio donde se alberga toda la fuerza de la naturaleza y su protector mejor conocida como Pachamama que se encarga de que la naturaleza y el ser humano viva en armonía, pero desde los sucesos, la protectora no ha podido conectarse con la ciudad para saber que paso y poder restablecer la armonía, por desgracia sus poderes y espíritu se disminuyeron, convirtiéndola en una estatua postrada hasta que la conexión vuelva a restablecerse.\r\n</p>\n<p>Un día la protectora tuvo una idea para poder salvar la ciudad, asi que con su última esencia creo un ser, un guardián el cual tenía la habilidad de conectarse mediante la tierra a diferentes espacios y poder restablecer la conexión entre la naturaleza y la tecnología, gracias a su máscara de ceiba que creo la protectora para poder obtener los poderes necesarios para dar su conexión;  también tiene el poder de los dos animales más magníficos de los bosques de Medellín, el zorro y el barranquero que le ayudaran al guardián a pasar todos los obstáculos y poder conectar y convertir la ciudad de Medellín en la ciudad futurista soñada.\r\n</p>\n<p>¿Qué estás esperando guardián?, convierte a Medellín en un hábitat 4.0 sostenible.\r\n</p>", "metacritic": null, "released": "2021-10-05", "tba": false, "updated": "2021-10-08T08:08:12", "background_image": "https://media.rawg.io/media/screenshots/496/496436acffb0e50f95d69272c02456c8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["hyunalexa"], "genres": [], "publishers": [], "esrb_rating": null}