{"id": 675317, "slug": "you-can-do-it-astro-pup", "name": "You can do it, Astro Pup!", "name_original": "You can do it, Astro Pup!", "description": "<p><strong>You can do it, Astro Pup!</strong><br/></p>\n<p>Astro Pup is known across the galaxy for his bravery and charisma, but today he faces his greatest challenge yet - caught in an asteroid field, his ship damaged and spinning out of control, Astro Pup is stranded and all hope seems lost! </p><p>Despite overwhelming odds, Astro Pup stands tall - why? Because he knows that he can do it!</p><p>Walkthrough:<br/></p><ol><li>Head into power and place the two fuel tanks onto the holders. Now head to the PC in the corner of the room and click the middle node to divert power to the centre of the ship.</li><li>Leave power through the now locked door and head into the hold. Bring the fuel tanks in hold back to the holders in power one by one until all four tanks are placed. You can now use the PC in power to divert power across the rest of the ship.</li><li>Head back into the hold and bring two oxygen tanks one by one into O2, placing them on the holders at the top of the room.</li><li>Head up to the bridge and place the four power crystals in the PC at the top of the room.</li><li>Go down to engines and use the PC on your left as you enter. Type in the given code to reveal the crystal alignment sequence.</li><li>Return to the bridge and use the PC at the top of the room. Place the crystals in the order shown on the PC in engines. This will activate the shield and the ship will begin to stabilise.</li><li>Head to the bottom area of the ship's hold,  where you will find the dark matter core. Carefully carry it to engines and place it on the holder in the centre of the room, avoiding touching the ships walls as you do so. If you touch a wall while holding the core it will smash and another will have to be retrieved from the hold.</li></ol>", "metacritic": null, "released": "2021-10-05", "tba": false, "updated": "2021-10-08T08:36:25", "background_image": "https://media.rawg.io/media/screenshots/f63/f63420c3bf62119f802d22773f80a8c5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["benskca"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}