{"id": 67543, "slug": "pixel-cat-color-by-number", "name": "Pixel Cat - Color by Number", "name_original": "Pixel Cat - Color by Number", "description": "Improve your mood by helping Pixel Cat to color scenes!<br/>Drawing by numbers is a great way to spend time with pleasure and fun. <br/><br/>Plunge into a chill coloring! Start your trip to various worlds and help Pixel Cat to collect, color and enjoy all pieces of landscapes and make new friends. <br/><br/>Pixel Cat app brings you:<br/><br/>* Great variety of worlds for all tastes<br/>* Many of amazing coloring pages and palettes<br/>* Awesome pixel arts<br/>* Option to share your artworks with friends in one tap <br/><br/>The fresh and harmonic color palettes are designed for stress relieving coloring! Try it now!<br/><br/>PREMIUM subscription  <br/><br/>Subscribe to Premium to enjoy the full and exclusive content!<br/><br/>The app contains the following subscription options:<br/>- Weekly &amp; annual*<br/>- Trial subscription is automatically renewed unless canceled 24 hours before the renewal<br/>- Any unused portion of a trial period, if offered, will be forfeited when the user purchases a subscription to that publication<br/>- Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user’s Account Settings after purchase<br/><br/>Privacy Policy: http://harmonybit.com/privacy.html<br/>Terms of Service: http://harmonybit.com/terms.html<br/><br/>*Price are equal to the value that “Apple’s App Store Matrix” determines is the equivalent of the subscription price in $USD.\"", "metacritic": null, "released": "2017-12-20", "tba": false, "updated": "2019-10-22T13:54:55", "background_image": "https://media.rawg.io/media/screenshots/715/71561385d76db314fdb22b04d4dc75af.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 46, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Hanna Davidziuk"], "genres": ["Family", "Puzzle"], "publishers": ["Hanna Davidziuk"], "esrb_rating": "Everyone 10+"}