{"id": 6755, "slug": "barcode-knight", "name": "Barcode Knight", "name_original": "Barcode Knight", "description": "The sequel to Barcode Kingdom has finally launched!<br/>Teleport to a dungeon by offering a barcode up as a sacrifice to a barcode portal!<br/>Let's be a legendary hero of the world!<br/><br/>'Barcodia', the world is made from magic powers, was peaceful and beautiful, but the power of evil hit the world, the land became empty and useless and started infesting with monsters. Barcodians who livelihoods are under threat was decided to hunt monsters for a living.  And then one day, they found a portal to a dungeon and built a town around the portal. <br/>'The Barcode town' is one of the town made this way. <br/><br/>Could the knight be the a legendary hero of the world in this town?<br/>Now it's time to scan a barcode! <br/><br/>* FEATURE *<br/>60 different types of monsters<br/>The growing town with the Knight<br/>Powerful enchanted items<br/>Avatar system : Possible to create half a million different hero styles<br/>Mercenary system : Fight with a mercenary against monsters<br/>Forge system : Upgrade and enchant your items at the Forges<br/>Quest system : Provides a quest every hour<br/>The Random dungeon : Available to use without a barcode<br/>The Gate Of The Other World : The direct gate to the monsters' base<br/>The Daily dungeon : Find out The Daily dungeon and Get a huge bonus every day", "metacritic": null, "released": "2015-07-14", "tba": false, "updated": "2019-07-30T15:46:10", "background_image": "https://media.rawg.io/media/screenshots/fff/fffd4858b4fb661f341e29bc3b5c7820.jpg", "website": "http://mgcube.cafe24.com/barcodeknight.html", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 248, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Magic Cube"], "genres": ["RPG", "Arcade", "Casual"], "publishers": ["Magic Cube"], "esrb_rating": "Everyone 10+"}