{"id": 675580, "slug": "ans-table", "name": "An's Table", "name_original": "An's Table", "description": "<p>IMPORTANT:  CLICK THE FULLSCREEN BUTTON IN THE BOTTOM LEFT CORNER!</p>\n<p>An’s Table is a bullet hell food delivery game where you (An) have to satisfy angry gangster customers that came to your restaurant. Mysterious enemies are there to ruin your day and progressing with the service will eventually make things… unstable.\r\n</p>\n<p>The objective of the game is to survive as much as you can, keeping the customers satisfied, and killing meatball monsters.\r\n</p>\n<p>Touch the table to start the game!\r\n</p>\n<p>HINT: The dish pile can act as a flail if it has enough momentum (and enough plates...)\r\n</p>\n<p>WASD to move.\r\n</p>\n<p>Left mouse click to throw dishes to customers. It won't fill them up, but you can calm their temper.\r\n</p>\n<p>Right mouse click to use the shotgun, one bullet is enough to kill each enemy! Shotgun is also used to propel yourself.\r\n</p>\n<p>The number of dishes you hold is also your health bar, don't get hit without holding any plate. \r\n</p>\n<p>Touch the customer to deliver the dish on top of the pile you are holding. The customer will only accept the dish he wants at the moment.\r\n</p>\n<p>5 plates fill a customer, customers stack their eaten plates on the table, under their gun.\r\n</p>\n<p>If customers are not fed they become angry and fill their gun with bullets, after 5 bullets customers will shoot you, calm them down. \r\n</p>\n<p>Full customers will leave, and drop ammo.\r\n</p>\n<p>As the game progresses more enemies will spawn, more customers will show up and the chef will become progressively less efficient.\r\n</p>", "metacritic": null, "released": "2021-10-04", "tba": false, "updated": "2021-10-08T09:40:44", "background_image": "https://media.rawg.io/media/screenshots/eac/eaca5aa60e01d53ea556d6b31db0360e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 9, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["regoli"], "genres": ["Action"], "publishers": [], "esrb_rating": null}