{"id": 67555, "slug": "asphalt-xtreme", "name": "Asphalt Xtreme", "name_original": "Asphalt Xtreme", "description": "<p>Available exclusively for Netflix members.<br />\nCharge through canyons, drift across dunes and rocket past your opponents in this extreme off-road racing experience.</p>\n<p>Forget everything you know about racing — all you need are your instincts and a fearless desire for speed.</p>\n<p>• Unleash the power of a 4x4 monster truck. Feed your passion for fast wheels with a muscle car. Or go wild on the track in an agile buggy, a dirt-loving rally car or an unstoppable truck.</p>\n<p>• Go head-to-head with eight-player, simultaneous free-for-alls. You’ll be facing tight competition, so stay on top of your game as you climb the leaderboard!</p>\n<p>• Race in a variety of extreme locations from around the globe. Prepare to shred the glaciers of Svalbard, summit the Alps, cut through the jungles of Thailand and much more.</p>\n<p>• Need to pump up your motorsport car’s engine power? Feel like decking out your rally racer? There’s an impressive collection of custom setups and upgrades to make every set of wheels unique.</p>\n<p>• There are always new obstacles to climb and experiences to try with five game modes, over 300 career events and more than 1,100 mastery challenges.</p>", "metacritic": 77, "released": "2016-11-02", "tba": false, "updated": "2023-08-31T00:51:09", "background_image": "https://media.rawg.io/media/screenshots/c38/c38c9d56e7a66983fc123994572ed0fa.jpg", "website": "https://help.netflix.com/en/node/122604", "rating": 2.9, "rating_top": 3, "added_by_status": {"yet": 1, "owned": 2, "beaten": 4, "toplay": 1, "dropped": 11, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 11, "suggestions_count": 253, "game_series_count": 15, "reviews_count": 10, "platforms": ["iOS", "Android"], "developers": ["Gameloft", "Netflix"], "genres": ["Action", "Racing", "Arcade", "Casual"], "publishers": ["Gameloft", "Netflix"], "esrb_rating": "Teen"}