{"id": 67554, "slug": "tiny-goat", "name": "Tiny Goat", "name_original": "Tiny Goat", "description": "Want to GROW RICH? Can you TAP FAST enough? CLICK - TAP - BUILD earn cash every day and farm away - even when you're not playing! <br/><br/> 6 REASONS TO PLAY TINY GOAT! <br/><br/>- SUPER CASUAL GAME PLAY Just keep tapping the screen. The perfect tycoon story!<br/><br/>- TAP &amp; BUILD Build your farm, make money, herd animals, upgrade your township! Tap! Tap! Tapped!<br/><br/>- CLICK &amp; CASH Casual &amp; addictive idle clicker game play for players happy to click &amp; pocket money every day! Grow rich!<br/><br/>- UPGRADE &amp; GROW Plan your cash investments and level up your hay barn with multiple story upgrades <br/><br/>- UNIQUE VISUALS Flock of goat in your barn with a happy PET DOG to keep them in line, eagles to hunt with amazing 3D city visuals and farming scenery<br/><br/>- CHALLENGE FRIENDS Think you have more happy animals than your friends? Got more milk? Send them a challenge to see who has the bigger cheese!<br/><br/>Tap like a tycoon and clone as many tiny goats as you can (don’t forget to feed them hay!) to grow and upgrade your city to pocket MONEY in this awesome 3D game! A goat farming simulator like no other - animals galore!<br/><br/>3 SIMPLE STEPS TO GROW YOUR CITY<br/>1. Tap to goat - (idle simulator mode when away!)<br/>2. Research to win<br/>3. Upgrade your milk factory to be the township tycoon story all your friends are talking about!<br/><br/>Challenge your friends to see who makes the best milk in this idle farming pocket clicker!<br/><br/>~~~~~~~~~~~<br/>ALREADY LOVE THE GAME?<br/>Like us: https://www.facebook.com/tinytycoon/", "metacritic": null, "released": "2017-06-13", "tba": false, "updated": "2019-10-22T14:26:33", "background_image": "https://media.rawg.io/media/screenshots/040/0409b2810da5df127781657223a67a01.jpg", "website": "http://www.mindstormstudios.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 105, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mindstorm Studios"], "genres": ["Simulation", "Family"], "publishers": ["Mindstorm Studios"], "esrb_rating": null}