{"id": 675690, "slug": "enhanced-itch-greon-hermitao", "name": "Enhanced (itch) (Greon, Hermitao)", "name_original": "Enhanced (itch) (Greon, Hermitao)", "description": "<p>A game made for Ludum Dare 49 - Unstable</p>\n\n<p><strong>CONTROLS - GAMEPAD RECOMMENDED (but not required)</strong></p>\n<p>Use WASD or controller thumbstick to walk around, E/Space to Dash and Left Mouse Button to Attack</p>\n<p>Use the mouse to navigate the menus if needed.</p>\n<p><strong>IMPORTANT SIDENOTES</strong></p>\n<p>Go to the lights on the floor next to the walls to change rooms, as there is no indicator of the way to go. </p>\n<p>You might need to try a few of the doors to find another room, but generally the rooms are generated to the right and to the top most of the time. If you die, press ESC and go to the menu to restart (click the button with the mouse). You can skip the intro by pressing pressing the dash or attack button in either the keyboard or controller after you've seen it once (and you can also press l if you want to skip it the first time, if you don't want to see it &lt;:C)..</p>\n<p>We haven't managed to finish the end part of the game, but, consdering everything goes right, we're planning on releasing a version with most of the things we planned at the start of the jam in a few days just so we can show what we planned and with a few important fixes, so if you happen to like it, stay tuned! :D</p>\n<p>Have fun and thank you so much for checking our game out! Happy jamming!</p>\n<p>Credits -</p>\n<p>Hermitao: Code, Audio, Music and Game Design.</p>\n<p>Greon: Art, Level and Game Design.</p>", "metacritic": null, "released": "2021-10-04", "tba": false, "updated": "2021-10-08T10:09:04", "background_image": "https://media.rawg.io/media/screenshots/32f/32fcc26a74b9383980b98e54fff61db3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Hermitao", "Greon"], "genres": ["Fighting"], "publishers": [], "esrb_rating": null}