{"id": 67586, "slug": "colorbox-number-coloring-book", "name": "Colorbox: Number Coloring Book", "name_original": "Colorbox: Number Coloring Book", "description": "If you are fond of painting and coloring, Colorbox is a must-have app for you! Come and try this relaxing game for FREE! It is a perfect app for both children and adults to color pictures by the numbers. <br/><br/>Key Features:<br/>- Easy gameplay: coloring with numbers is easy and fun!<br/>- Large selection of pictures for you to choose from!<br/>- Share your creations on Facebook and Instagram! Paint with your family and friends and share your best ones together!<br/>- Great stress reliever right in the palm of your hand!<br/>- Play Colorbox anytime and anywhere you want!<br/><br/>Join now to start your painting journey! Enjoy the fun of painting and coloring! Make your life more colorful with Colorbox and enjoy painting by the numbers with family and friends!<br/><br/>Colorbox Premium Subscriptions Info<br/><br/>- Subscribe to Colorbox Premium to unlock all the features and content within the app.<br/><br/>- Premium Weekly Access offers $9.99 per week to access above features after a 3-day FREE Trial.<br/><br/>- Payment will be charged to the applicable iTunes Account at confirmation of purchase. The prices may vary depending on countries. The actual money charged may also be converted into your local currency based on iTunes Account policy.<br/><br/>- Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period. <br/><br/>- Account will be charged for renewal within 24-hours prior to the end of the current period, and identify the cost of the renewal.<br/><br/>- Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's Account Settings after purchase.<br/><br/>- Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable.<br/><br/>- Tap “Restore” to restore your plan on your new device!<br/><br/>- Please kindly access the Terms of Use and Privacy Policy at http://colorbox.zenjoycasual.com/<br/><br/>*Terms of Use and Privacy Policy - http://colorbox.zenjoycasual.com/", "metacritic": null, "released": "2017-12-02", "tba": false, "updated": "2019-07-29T07:56:45", "background_image": "https://media.rawg.io/media/screenshots/d7f/d7fd3284de259a89349c1fe129d91a0f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 60, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Zentertain"], "genres": [], "publishers": ["Zentertain"], "esrb_rating": "Everyone 10+"}