{"id": 675983, "slug": "tidy-tides", "name": "Tidy Tides", "name_original": "Tidy Tides", "description": "<p>It’s there. At last. The sea. The s...tillness of the water. The sun. You’re finally able to enjoy the long-awaited vacation you’ve dreamt about aboard your brand new boat. This newfound parisian life and its people have worn you out. Careless, they’re oh-so careless! And loud… and dirty. You can’t stand it, you who love when everything’s squared up.</p>\n<p>You take a deep breath. The feeling of the fresh air filling your lungs calms you down. You’re relaxed. You peacefully drift away to a world of matching socks and perfectly aligned bookshelves…\r\n</p>\n<p>Or so you thought! What… a mess! The waves have come crashing against the hull.and have displaced all the stuff you had carefully tidied up... God damn it! TRIGGERED! \r\n</p>\n<p>Quick! Everything has to go back to its original spot or you fear you’ll lose your mind. Pick up items and put them back to their needed spots, in accordance with location and colour constraints. Fight against the sea swell and clean up the room before it is too late, for your stress level might rapidly become unbearable. But beware not to confuse hurry and haste, or it could get even worse…\r\n</p>\n\n\n\n<p>A game lasts 2 minutes. \r\n</p>\n<p>As the room is littered with displaced items, your stress jauge increases naturally. \r\n</p>\n<p>Your objective is to slow its progression down by tidying up the room, as quickly as possible.\r\n</p>\n<p>You lose if your stress gauge fills in full.\r\n</p>\n<p>You win if you manage to clean everything up, bearing in mind location and colour constraints, before the timer expires.</p>\n<p>Items must be placed among 3 specific spots inside the room:<br/></p>\n<ul><li>The Library: books, photo frames\r\n</li><li>The Shelf: socks, box\r\n</li><li>The Desk: pencils, coffee cups\r\n<ul><li>Vases can be placed anywhere\r\n</li></ul></li></ul>\n<p>Waves<br/></p>\n<p>As you’re on a boat, the swell is making your life harder.\r\n</p>\n<p>Waves periodically come crashing against the hull, creating instability and displacing items. Make sure to keep an eye on your beloved photo frames and fragile coffee cups!</p>\n\n<p>• Robin Moreux - Producer\r\n</p>\n<p>• Arthur Terrier - Producer\r\n</p>\n<p>• Tobias Orange - Game Designer\r\n</p>\n<p>• Eva Desmazures - Game Artist</p>\n<p>• Alexandre Janin - Developper\r\n</p>\n<p>• Noé Palmero - Developper</p>\n<p>• Raphaël Marteaux - Original Soundtrack, Sound Design</p>\n\n<p>Inspired by the theme “Unstable”, Tidy Tides was created in 3 days by a team of maniacs who poured their hearts and souls into it. </p>\n<p>This game was developed for Ludum Dare 49. We hope you enjoy<em> Tidy Tides</em>!\r\n</p>\n<p><strong>Your opinion matters</strong>!\r\n</p>", "metacritic": null, "released": "2021-10-04", "tba": false, "updated": "2021-10-08T11:19:57", "background_image": "https://media.rawg.io/media/screenshots/656/65634a5d891498d110c2a219c422c260.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 72, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["WaxWire1", "Tobias_", "delaterriere", "killingbanana", "EvaDesmazures"], "genres": ["Action", "Adventure"], "publishers": [], "esrb_rating": null}