{"id": 67593, "slug": "pop-frenzy-emoji-movie-game", "name": "POP FRENZY! Emoji Movie Game", "name_original": "POP FRENZY! Emoji Movie Game", "description": "Inspired by Sony Pictures Animation's The Emoji Movie, POP FRENZY! The Emoji Movie Game features all your favorite Emojis and moments from the movie in this fresh take on the bubble shooter with blitz-style gameplay.<br/><br/>Help Gene, Hi-5 and Jailbreak escape to The Cloud by clearing away bubbles that stand in their way!  Flex those fingers for this new fast paced bubble shooter game. Take aim and blast away as many bubbles as you can before the timer runs out. Collect mystery boxes to unlock your favorite characters from the movie- each has a special bubble blasting power!<br/><br/>Now go show off! <br/><br/>Features: <br/><br/>New Blitz-Style: New spin on the traditional bubble shooter with a fast-paced style featuring boosters and power-ups. <br/><br/>Unlimited Bubble Poppin':  Blast away with Gene and the gang to achieve the highest score. <br/><br/>Daily Rewards: Don't forget amazing daily rewards to help blast more bubbles.<br/><br/>Explosive Gameplay: Fill the Super Meter to activate FRENZY MODE for fiery bubble popping fun. <br/><br/>Be at the top: Climb the leaderboard to become the best bubble shooter around. <br/><br/>Collect'em all: Grab those mystery boxes and unlock all the different Emojis from the movie! <br/><br/>Awesome Stickers: Win amazing stickers of Emojis, then use them in iMessages!<br/> <br/>If you have issues, questions, or comments please email us at (games_support@spe.sony.com).  We want to hear directly from you! <br/> <br/> <br/>NOTE: If you uninstall POP FRENZY! The Emoji Movie Game (or if your device is lost, stolen or destroyed), all unused consumables (In-app purchases) will not be refunded and cannot be transferred to new devices or accounts. <br/>This app may include advertising tailored to your interests on behalf of the Sony Corporation family of companies, as well as third parties. To learn more about this, visit www.aboutads.info. To exercise certain choices regarding interest-based advertising, visit www.aboutads.info/choices. You may also download the App Choices app at www.aboutads.info/appchoices. <br/><br/>Privacy Policy: http://www.sonypictures.com/corp/privacy.html <br/>Terms of Use: http://www.sonypictures.com/corp/tos.html <br/><br/>", "metacritic": null, "released": "2017-07-26", "tba": false, "updated": "2019-07-30T04:39:28", "background_image": "https://media.rawg.io/media/screenshots/a67/a67f6316f6ea91376b28ad0626bc8172.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 71, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sony Pictures Television"], "genres": ["Arcade", "Casual", "Puzzle"], "publishers": ["Sony Interactive Entertainment"], "esrb_rating": null}