{"id": 676059, "slug": "the-sanctity-compliant-yggdrasil-worldship", "name": "The Sanctity Compliant Yggdrasil Worldship", "name_original": "The Sanctity Compliant Yggdrasil Worldship", "description": "<p><strong>Trigger warnings: </strong>administrative forms, torture, body horror (including eyes), shaming, religion, burning, murder, crude imagery, violence against non-human animals. <br/><strong>I think printing the form can give a better experience, but you could also fill them with a pdf viewer, for instance.</strong><br/></p>\n<p>You shall never disobey the SANCTITY or the Inquisition. <br/>You shall never leave the SANCTITY Compliant Yggdrasil worldship.<br/>You shall never feed the firebirds, even if they’re beautiful.<br/>You need one <strong>(1) </strong>Sanctity-Compliant pen and one <strong>(1)</strong> pencil to play this game.</p>\n<p><strong>If you're lost: </strong></p>\n<p><em>This is interactive fiction, but in the medium of physical forms that you will fill to play the game. The questions are usually multiple choice, and can have some mechanical effects depending on your answers (there will be instructions to follow).\r\n</em></p>\n<p><em>If you have played text-based games before, like twine games for instance, this is similar, except instead of following hyperlinks, you tick boxes. You are the one who gets to decide the content of your adventure. Every time you have boxes to check, you get to decide for yourself what is true and what is not.\r\n</em></p>\n<p><em>You can share the content of your experience, and you can send these back to us, if you want! But you don’t need to do that. And you don’t need anyone else to play; this is entirely a single player experience. You’re a character in the game’s world that wakes up, and find forms they have to fill. Life has happened to them before, and happens to them in between the forms, and is implied by the text and created by your decisions.\r\n</em></p>\n<p><em>It’s a text-based aid to telling a story to yourself. Like maybe you used to do, or still do, before going to sleep. Maybe like a choose your own adventure book. You have to work a little bit for it to function, because you’re the machine running the game, but I hope for some people it will be worth it :)</em></p>\n<p><strong>v1.1 Changelog</strong></p>\n<p>- Added in a line to state at the start that forms should never be opened unless instructed to.<br/>- Fixed a continuity error at the end of form ODB-WR [101-230].<br/>- Changed the folder structure so it's more user-friendly, thanks to feedback from @Carraka on the LD website. Notably, W [21-24] is now alone as a root form and accompanied by only one folder named accordingly, to enforce the intuitivity of its use as a starting point.<br/>- Tiny fixes to consistency issues with word choices, formulations, file names and presentation accross forms.</p>\n<p>Made by fae.exe and alyd asmar, in 72h, for LD49.</p>", "metacritic": null, "released": "2021-10-04", "tba": false, "updated": "2021-10-08T11:36:55", "background_image": "https://media.rawg.io/media/screenshots/0d8/0d871e3a7f6580515d93985073e425e7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 4, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["fae.exe", "alyd asmar"], "genres": [], "publishers": [], "esrb_rating": null}