{"id": 676006, "slug": "balkanization-1", "name": "Balkanization 1", "name_original": "Balkanization 1", "description": "<p>Made for Ludum Dare 49 Jam, theme \"unstable\".</p>\n<p>One victory condition managed to get into the game - Economic Victory (achieve 400 DEM income per turn).</p>\n<p>Lead your chosen Balkan nation from early history to the modern age in this Civ-like grand strategy game made over a weekend.</p>\n<p>Please no hate.</p><p>VICTORY CONDITION\r\n</p>\n<p>Only one victory condition made it to the game, economic victory by joining the EU (must have income of 400 per turn).\r\n</p>\n<p>WAR\r\n</p>\n<p>(Wage War button) You can attack only the faction that your public opinion wants to attack for that turn, as shown in lower part of the screen.\r\n</p>\n<p>Attacked nations that run out of defending units will have their economy set to zero. Attacked separatist republics that run out of defending units will be temporarily destroyed.\r\n</p>\n<p>It will be a faction that is bordering yours, and your nation must be either “indifferent” to it or “hate” it. Same goes for AI. Sadly I didn’t had time to add info panel for each nation’s likes and dislikes, so you will have to learn that with practice. But in general, Serbia and Montenegro will like each other, nations and their separatists will hate each other, and nations who are the same ethnic group as separatists will like each other.\r\n</p>\n<p>UNIT RESEARCH\r\n</p>\n<p>(Modernize Army button) You must aim to upgrade your troops to the next level whenever possible. All of your troops will be upgraded, so the more troops you have the more will the upgrade cost.\r\n</p>\n<p>ECONOMY\r\n</p>\n<p>The only way to win the game, use the Modernize Economy button to upgrade your income per turn. Nations that lose all their troops in war (or don’t have troops at all) will have their economy level set back to zero. Some specific AI nations may randomly receive monetary gifts from the EU in order to keep the game more challenging.\r\n</p>\n<p>SEPARATISM\r\n</p>\n<p>All nations have constantly increasing separatism counter that can be reduced by using the Squelch Separatism button. Once this counter reaches 100, some nations will have separatist republics spawned, while others will just have a riot and lose income for that turn.\r\n</p>\n<p>Separatist republics act like tampons, they will allow the nation that they like (same ethnic group) to attack across their border, while the nation which they got separated from will have to destroy them before being able to attack across.\r\n</p>", "metacritic": null, "released": "2021-10-04", "tba": false, "updated": "2021-10-08T11:24:30", "background_image": "https://media.rawg.io/media/screenshots/f08/f08e7387db134feb68a96dfe39041973.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Krafter"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}