{"id": 67601, "slug": "diy-fashion-star", "name": "DIY Fashion Star", "name_original": "DIY Fashion Star", "description": "With over 1.5 billion downloads and growing, TabTale has established itself as the creator of pioneering virtual adventures that kids and parents love. TabTale’s apps spark children’s imaginations and inspire them to think creatively while having fun!<br />\nVisit us: https://www.tabtale.com/<br />\nLike us: https://www.facebook.com/TabTale<br />\nFollow us:@TabTale<br />\nWatch us: https://www.youtube.com/Tabtale<br />\nCONTACT US<br />\nLet us know what you think! Questions? Suggestions? Technical Support? Contact us 24/7 at WeCare@TabTale.com<br />\nFOR PARENTS<br />\nThe app is free to play but certain in-game items may require payment. You may restrict in-app purchases by disabling them on this device. The app may include advertising for TabTale and certain third parties which will redirect users to our sites, apps or third-party sites.<br />\nPrivacy is important to us. The app may enable collection of limited user data by TabTale or its carefully selected providers (e.g. ad networks and analytics) for limited legal purposes described in our Privacy Policy (e.g. respond to support queries; enable, analyze and improve the app’s features and services; serve contextual ads). The app includes certain features only accessible behind an age-gate to protect children (e.g. restrict behavioral ads; social networks links to connect with others while playing; option to accept push notifications to inform of exciting news e.g. updates). By downloading or using the app you accept our Privacy Policy: https://tabtale.com/privacy-policy/ and Terms of Use: https://tabtale.com/terms-of-use/ and permit such uses for users of your device.</p>", "metacritic": null, "released": "2018-06-30", "tba": false, "updated": "2023-02-09T02:31:45", "background_image": "https://media.rawg.io/media/screenshots/062/062c47c9c17208d03e757eb474a7085f.jpg", "website": "https://www.tabtale.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 109, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Baby Education Animal Weather Toys"], "genres": ["RPG", "Simulation"], "publishers": ["Baby Education Animal Weather Toys"], "esrb_rating": null}