{"id": 67617, "slug": "xtreme-truck-mud-runner", "name": "Xtreme Truck: Mud Runner", "name_original": "Xtreme Truck: Mud Runner", "description": "Get ready for a revolutionary quest in extreme truck driving simulator. Offroad truck driving spin tires while driving through a new land. Get wedged in mud, tear around springy dunes, charge through rocky canyons and drive across tricky terrain in off-road jeep driving adventure. <br/><br/>Ambition several 6x6 trucks and 4x4 jeeps all in unique gameplay of mud runner spin tires.<br/>Ready to neutralize the rules of physics in the dirt environment where there’s no road and rules and offroad truck driving with power through mud, pass over hill rock bridges like evade hurdles, hike rises, cross narrowing channel and cross rivers,  all designed to test your extreme 4x4 and 6x6 truck driving skills.<br/><br/>Select from extreme off-road vehicles 6x6 Mud-Runner, 4x4 SUV Jeep and 8x8 Centipede Truck. Here is no speed boundary so hit the upswings, and proceeds dirt ambition to new summits in this truck madness.<br/><br/>Mud runner spin tires Features:<br/>Challenging 4x4, 6x6 and 8 wheeler driving missions<br/>Multiple off-road vehicles to choose from<br/>Advanced physics of revved up engine with wheel suspension<br/>Immersive 4x4 driving controls on off-road dirt tracks<br/>Realistic 3D graphics and countryside area to explore<br/><br/>Enjoy the exclusive gameplay and give your opinion to help us progress this game in future releases.", "metacritic": null, "released": "2018-05-13", "tba": false, "updated": "2019-10-22T13:54:56", "background_image": "https://media.rawg.io/media/screenshots/781/7813e44adabb1e4f4892b8cdf5f7614b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 237, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Muhammad Wasif"], "genres": ["Adventure", "Simulation"], "publishers": ["Muhammad Wasif"], "esrb_rating": null}