{"id": 676175, "slug": "deepwell-safety-inc", "name": "Deepwell Safety Inc.", "name_original": "Deepwell Safety Inc.", "description": "<p>For Ludum Dare 49</p>\n<ul><li>Designer: @BigYelow</li><li>Programmer: @IZAYA @rock-gong</li><li>Artist: @AegisFate</li></ul>\n<p>The universe is peaceful on the surface, but full of danger. The conflicts between planets and nations never end. You are an employee of the Deepwell Safety Inc. Your daily job is receiving, sending back, and taking care of your customers’ goods. Through interacting with your customers, try to find out what is happenning in the universe, and try to protect your company and the planet from danger.</p>\n<p>Control:\r\n</p>\n<ul><li>Use mouse left click to press buttons\r\n</li><li>Press the switch on the top-right corner (or press D key) to process to the next day\r\n</li><li>Press the red “CARGO-PORT” button to meet your customer\r\n</li><li>Press the “STORAGE-PLAN” button to open the storage grid\r\n</li><li>Drag tickets to storage grid to store inventories\r\n</li><li>Drag inventories to move it</li><li>When dragging a inventory, press R key to rotate\r\n</li></ul>\n<p>Cautious! Some inventories may cause temperature problem and radiation hazard, and some inventories is fragile. Some inventories may change the story flow. Treat the inventories carefully and put them in proper place. At the same time, overcome the personal financial problem. Try you best to reach the good ending.\r\n</p>", "metacritic": null, "released": "2021-10-04", "tba": false, "updated": "2021-10-08T12:09:31", "background_image": "https://media.rawg.io/media/screenshots/330/3307fbf5b97508a698dbe14552cc822c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 117, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["ThreeKU"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}