{"id": 676251, "slug": "packages-on-ice", "name": "Packages on Ice", "name_original": "Packages on Ice", "description": "<p><strong>Sorry but: EXPERIENCED BEST IN DESKTOP (the HTML browser version is slow, see below)</strong><br/></p>\n<p><strong><em>Edit: yeah it was so bad I actually removed the browser version. If you would like to play please download below (Windows and Mac available), sorry for the inconvenience! </em></strong></p>\n<p>Ludum Dare 49<br/></p>\n<p>Theme: Unstable</p>\n<p>In Packages On Ice you must deliver packages across a frozen lake. Be careful! If you travel along the same path too many times you will fall into the water... How many packages will you be able to deliver before getting soaked?!</p>\n<p><strong>reminder: EXPERIENCED BEST IN DESKTOP (the HTML browser version is like sludge)</strong></p>\n<p>This is my first entry in any Game Jam. I have a limited understanding of coding but I am a challenge producer by trade. It was fun to take part in such a taxing event. It's shocking how long things can take to do.  </p>\n<p>If anyone pops the hood on this baby  they will smell some STANKY code. I'm pretty sure this game runs 50k collision checks per minute because I couldn't get my 1 player check to work... so instead I had each individual object do the check rather than the player. For this reason the desktop version of this game plays better. </p>\n<p>I hope you enjoy and can get a better score than me, 17!<br/></p>", "metacritic": null, "released": "2021-10-04", "tba": false, "updated": "2021-10-08T12:27:57", "background_image": "https://media.rawg.io/media/screenshots/d1a/d1ae5127ef3547521888c734bfb6defa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 136, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["financialdiet"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}