{"id": 67621, "slug": "knife-hit", "name": "Knife Hit", "name_original": "Knife Hit", "description": "The ultimate knife challenge!<br/><br/>Throw the knives into the logs to break them. Slash the apples and unlock new knives. Each 5th stage is defended by a boss - beat them to get exclusive knives!<br/><br/>Be careful to not hit the knives or the spikes. Time your actions, target carefully and become the knife master!<br/><br/>Can you beat all the bosses?<br/><br/><br/>Subscription Terms<br/><br/>VIP MEMBERSHIP offers a weekly subscription, you will have a 3-days FREE trial period, after this period you will be charged $4.99. After buying this subscription, you will unlock +200% apples from daily gift, +200% experience from bosses and remove ads. This is an Auto-renewable subscription. The payment is charged to your account after confirmation. The subscription is renewed unless you turn it off 24 hours before the period ends. Your account will be charged for renewal as well.<br/><br/>The prices are established for United States customers. Pricing in other countries may change and actual charges may be converted to your local currency.<br/><br/>End of trial and subscription renewal:<br/>• The payment is charged to your account after a confirmation of purchase.<br/>• The subscription is renewed unless you turn it off 24 hour before the end of the current period.<br/>• The account will be charged for renewal within 24 hours before the end of the current period at the cost of the weekly subscription.<br/>• The user may manage the subscription and auto-renewal have to be turned off by going to the user’s account settings after purchase in the Store.<br/>• No cancellation of the current subscription is allowed during the active subscription period.<br/><br/>Canceling a trial or a subscription:<br/>• If you want to cancel a subscription during its free trial, you have to cancel it through your account in the Store. This must be done at least 24 hours before the end of the free trial period to avoid being charged.<br/><br/>For more information, please visit https://support.apple.com/HT207865 for more informations<br/><br/>If you have any questions, feel free to contact us at contact@ketchappgames.com<br/><br/>Privacy Policy and Terms of use : https://legal.ubi.com", "metacritic": null, "released": "2018-01-20", "tba": false, "updated": "2022-11-03T17:34:38", "background_image": "https://media.rawg.io/media/screenshots/814/8141fdf0500911939a1de18dd17f4d04.jpg", "website": "", "rating": 3.64, "rating_top": 4, "added_by_status": {"owned": 2, "beaten": 2, "dropped": 11, "playing": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 11, "suggestions_count": 83, "game_series_count": 0, "reviews_count": 11, "platforms": ["Android", "iOS"], "developers": ["Ketchapp"], "genres": ["Action", "Arcade", "Casual"], "publishers": ["Ketchapp"], "esrb_rating": null}