{"id": 676214, "slug": "chessapeak-city", "name": "Chessapeak City", "name_original": "Chessapeak City", "description": "Overview\r\n<p>Somewhere in the world, a plot of land is constantly afflicted by unfortunate weather anomalies. A few dare to live on there, but you decide you want to try your best to create a bustling city. In order to do so, you must be mobile and move your buildings around, build up, and hope weather doesn't destroy your progress. All while making sure your city stays afloat.<br/><br/>Your goal is to build the biggest city you can.</p>\n\r\nGame Rules\r\n<p>You can click on a building to move the building. It will move at the end of the cycle.<br/>Use industry points to buy new buildings</p>\n<p>Each piece can move a certain way, and has their own production values.</p>\n<p>Knight (Housing) - Houses 5 people, creates a person every 3 ticks. Every unfeed resident at the end of the tick dies.<br/></p>\n<p>Rook (Agriculture) - Up to 4 people can work here. Each person produces 2 food.<br/><br/>Bishop (Industry) - Up to 2 people can work here.  Each person produces one industry point. Everyone wants to work here, so make sure you have enough people to support this industry building.</p>\n<p>End goal - Build as many buildings as you can before the level ends.</p>\r\nControls\r\n<p>Click and drag from the shop to buy buildings with your Industry score.</p>\n<p>Click on a building to queue up a move for the end of the turn.<strong><em>Created for LDJam 49 by</em></strong><br/></p>\n<p>- Alexander Xie (Programmer) (https://github.com/Sorrer)</p>\n<p>- Alan Tong (Programmer, Artist, Music) (https://github.com/Atlinx)<br/></p>\n<p>- Christian Pasamba (Sound FX) (https://soundcloud.com/pasambablu)</p>", "metacritic": null, "released": "2021-10-04", "tba": false, "updated": "2021-10-08T12:19:24", "background_image": "https://media.rawg.io/media/screenshots/eb5/eb5237883ccafc82fd17f1d1937c8aae.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 78, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Sorrer"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}