{"id": 676355, "slug": "howard-bobo_baqa-bimgusgaminf", "name": "Howard (Bobo_Baqa, BimgusGaminf)", "name_original": "Howard (Bobo_Baqa, BimgusGaminf)", "description": "<p>Centuries of human carelessness has rendered most of the planet’s landmasses completely uninhabitable. The few habitable islands left remaining are defenseless against the onslaught of tides and volcanic eruptions that viciously shake them and toss the inhabitants like dirty laundry into the sea. In order to prevent hundreds of people from meeting a watery grave, the planet has begun hiring Giants to balance the landmasses holding what’s left of humanity. <br/></p>\n<p>You are a Giant named Howard. You’ve fallen on hard times due to the turbulent Giant economy, but luckily, you have just learnt of this lucrative job prospect. While your hiring manager has told you that your explicit task is to keep islanders from being swallowed by the ocean, insufficient man-power leaves you largely unaccountable, and thus, your only performance review is your own conscience. Will you do your best to keep Islanders from drowning, or will you expedite the tragic, painful deaths of the happy island nation?\r\n</p>\n\n<p><strong>Controls:</strong></p>\n<p>Use WASD to move, space to jump. You can also swim around.</p>\n<p><strong>Credits:</strong></p>\n<p>Ben - Coding and materials,</p>\n<p>Bimgus - 3d modelling and animations,</p>\n<p>Shrub - Music and sounds (and, like, one island),</p>", "metacritic": null, "released": "2021-10-04", "tba": false, "updated": "2021-10-08T12:54:18", "background_image": "https://media.rawg.io/media/screenshots/f88/f88a43a25e0b185750591c75293b8f60.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 10, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Bobo_Baqa", "BimgusGaminf"], "genres": ["Action", "Platformer"], "publishers": [], "esrb_rating": null}