{"id": 676341, "slug": "unstable-chemistry", "name": "Unstable Chemistry", "name_original": "Unstable Chemistry", "description": "<p>Welcome to 🥼⚗️ <strong>Unstable Chemistry</strong> 🧪👨‍🔬</p>\n<p>In this game your labor is to combine all incoming chemical solutions in the proper way so they are not unstable.</p>\n<p>Drag and combine them together but... <strong>be careful</strong>! Follow the instructions so you don't make even more unstable solutions that increase the level of instability of the lab.</p>\n<p>Your goal is to stabilize as many flasks as possible before they are processed by our cute solution-processor-robot Queue-A 🤖. Every unstable solution that is being processed will increase the unstable bar, if this bar gets at 100% your game is over and your score will be saved. Talking about the score, each stabilized solution being processed by Queue-A will give you points depending on the flask type.</p>\n<p>❔🔍 How many points can you get before Queue-A detects a point of no return of instability? Comment down below to compare highscores!</p><p>We did this game with much love ❤️ during this weekend for the Ludum Dare 49.<br/></p>\n<p>We hope you enjoy our game and all the others that are being developed during the Ludum!</p>\n<p>⚠️<strong>Disclaimer:</strong> We don't have a colorblind option sadly so please take this into consideration if you want to try the game. Sorry for the inconvenience.</p>\n<p>Cheers!</p>\n<p><strong>How to play</strong></p>\n<p>Drag and drop the flasks to make stable solutions. Check the RGB diagram to see what you need to move and the examples in the instructions button in the game menu.</p>\n<p>You can drag flasks 🧪 to:</p>\n<ul><li>Other flasks 🧪 to combine them</li><li>The Queue-A machine 🤖 to process them before they reach the end if you don't want to wait</li><li>The recycling bin ♻️ to safely dispose of the solution (be patient, it takes some time 😜)</li><li>The fridge ❄️ to store them instead of leaving them in the belts</li></ul>", "metacritic": null, "released": "2021-10-04", "tba": false, "updated": "2021-10-08T12:50:08", "background_image": "https://media.rawg.io/media/screenshots/e72/e72f0c74164808a8feb301d90a3fd603.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 10, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["theepsi"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}