{"id": 676356, "slug": "the-blue-bedroom", "name": "The Blue Bedroom", "name_original": "The Blue Bedroom", "description": "<p>In this point-and-click game, <strong>follow Van Gogh's footsteps and creations</strong> during his stay in Arles, France.<br/></p>\n<p>Read his own words, extracted from his letters to his brother Theo Van Gogh.</p>\n<p>Discover his desire to build a community of artists in his Yellow House with his friend Paul Gauguin. From his blissful days and creations <strong>to his mental breakdown and instability</strong>.</p>\n<p><strong>Game based on historical facts</strong>, as an interactive visual novel.</p>\r\nInstructions\r\n<ul><li><strong>WEB VERSION:</strong> Play on Chrome or Firefox.<br/>\n</li><li><strong>MOBILE</strong>: It plays well on Chrome for Android. Does not work on iOS.</li><li>You can<strong> use the mouse</strong> for everything.</li><li>You reach the end when there's a \"The End\" screen.</li><li>It’s highly recommended that you fully read the content of all letters to understand everything.</li><li><strong>If you prefer, some shortcuts:</strong><ul><li>Go back: Left arrow</li><li>Advance: Right arrow</li><li>Read letter: L</li><li>Close modals: ESC</li></ul></li><li>ALT+Enter for fullscreen</li><li>The game has many <strong>secrets to be unlocked</strong>.</li></ul>\r\nBackstory\r\n<p>Van Gogh wrote constantly to his brother Theo, talking about his paintings, sketches, mental state, books, and more. More than 800 letters survived, which are a look straight into Van Gogh's heart and mind, or better yet, <strong>his letters are a gate into his soul</strong>.</p>\n<p>I've read all of his letters and I always felt \"connected\" to him. When I read about the theme \"Unstable\" in a game jam (Ludum Dare), I had a burst of excitement: <strong>\"THE PERFECT THEME TO MAKE A GAME ABOUT VAN GOGH\"</strong>.</p>\n<p>So I chose one of his periods - Arles, France - in which his mood fluctuated on a daily basis, and <strong>in a matter of 3 months went from being extremely excited to have a mental breakdown (ear cut)</strong>. The reasons? This is what you can see in the game.</p>\r\nNotes\r\n<ul><li>The chronological order of some of the letters was changed, to accommodate the structure of the game, but the content has been unchanged.</li><li>Music from https://www.zapsplat.com/. Sound effects from https://www.zapsplat.com/ and https://freesound.org/.</li><li>Made from scratch in 3 days, all by myself, for the game jam Ludum Dare 49.</li><li>Letters from: http://vangoghletters.org/vg.</li></ul>", "metacritic": null, "released": "2021-10-04", "tba": false, "updated": "2021-10-08T12:54:39", "background_image": "https://media.rawg.io/media/screenshots/abe/abe58de58af00f641befd952bb43126c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 197, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux", "Web"], "developers": ["Alfred Reinold Baudisch"], "genres": [], "publishers": [], "esrb_rating": null}