{"id": 67637, "slug": "boggle-with-friends-word-game", "name": "Boggle With Friends: Word Game", "name_original": "Boggle With Friends: Word Game", "description": "** Welcome Word Streak players! Word Streak is now Boggle With Friends!**<br/><br/>Bring the fun of family game night with you on the go with the Boggle With Friends game. This new take on the classic board game from Hasbro is loaded with fun new modes, daily challenges, and puzzling twists! Challenge your friends, family, or new opponents to spell out the most words before the clock runs out in two minutes! <br/><br/>Want to boost your word search game? Train on your own in solo play against the Coach to test your word skills in a three-round match of wits. Got a competitive streak? Compete in live head-to-head tournaments and lightning fast single round tournaments to show off your puzzle solving skills and earn rewards along the way. <br/><br/>Join the fun and download Boggle With Friends today!<br/><br/>CREATE A MATCH<br/>It all starts here! Challenge an opponent to three rounds of fun to see who can find the most words, score the most points and emerge victorious.<br/><br/>COMPLETE DAILY &amp; WEEKLY CHALLENGES<br/>Brand new challenges are updated daily, as well as weekly. Play to win sweet rewards!<br/><br/>TRAIN IN SOLO PLAY<br/>Test and improve your word smarts in solo mode! Challenge yourself against the Coach in three rounds which get harder as you move up.<br/><br/>COMPETE IN LIVE TOURNAMENTS<br/>Go head-to-head with friends, family and new opponents in live tournaments and advance through lightning rounds with lots of bonus tiles! <br/><br/>COLLECT DAILY PRIZES<br/>Win a daily bonus with prizes and power-ups! Play each day to get better rewards.<br/><br/>PLAY OFFLINE <br/>Play anytime, anywhere, even offline 24/7. <br/><br/>AVAILABLE IN 9 LANGUAGES<br/>Choose your language and start a game in Spanish, French, German, Italian, Dutch, Danish, Swedish, Turkish, and English.<br/><br/>Download Boggle With Friends for a word search experience you can’t put down!<br/><br/>Additional Information <br/>The game is free to play; however, in-app purchases are available for additional content and in-game currency. In-app purchases range from $0.99 to $99.99 USD.<br/><br/>BOGGLE is a trademark of Hasbro and is used with permission. © 2018 Hasbro. All Rights Reserved. Licensed by Hasbro.", "metacritic": null, "released": "2017-03-15", "tba": false, "updated": "2019-07-31T00:39:18", "background_image": "https://media.rawg.io/media/screenshots/a32/a321cba155e8966b512c6dc61c2d441e.jpg", "website": "https://www.zynga.com/games", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 80, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android", "iOS"], "developers": ["Zynga"], "genres": ["Puzzle"], "publishers": ["Zynga Mobile"], "esrb_rating": null}