{"id": 67630, "slug": "farm-dozer-coin-carnival", "name": "Farm Dozer: Coin Carnival", "name_original": "Farm Dozer: Coin Carnival", "description": "The most addictive coin pusher game Ever!<br/><br/>Relive your chilhood memories with classical arcade game of farming festivals. Play like a hero, drop constant flow of coins, attack with eggs, spin casino style slots, try your luck at fortune wheel and quest through the valley of adventures and advance through terrains by unlocking wonderful items and powers.<br/><br/>Farm dozer offers fun collectable like cows, flower baskets, scarecrows, tractors, watering cans and alot more. This ads-free farming game presents right mix of anticipation and luck. If you feel luck is not on your side, try spinning Fortune Wheel and unlock premium village items, along with that we have Slots for you to unlock special farming items.<br/><br/> Farm dozer: Coin Carnival features:<br/>- Dozens of farming prizes to collect!<br/>- Monthly live events and special adorable characters!<br/>- World Class 3D graphics to relive a farm life.<br/>- Special quests where fun collectables and animals help unlock upgrades<br/>- Superb coin dozer physics, special effects and animations that light up your Farm<br/>- Fun chips with unique pusher powers that can be upgraded<br/>- Village's Slots: Our slots machine mini-game to win tons of prizes<br/>- Animal Fortune Wheel: Spin the wheel of fortune to win special rewards<br/>- Compete on leaderboards and unlock achievements<br/>- Look out for awesome new updates!<br/><br/>For support please contact krypton.surfer@gmail.com<br/><br/>Visit our Facebook page at https://www.facebook.com/coinparty and join our active community of players!", "metacritic": null, "released": "2016-02-08", "tba": false, "updated": "2019-10-22T14:26:34", "background_image": "https://media.rawg.io/media/screenshots/458/458ff06cd1c14f4491587598c5cdee7d.jpg", "website": "http://www.mindstormstudios.com/index.php/games", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 129, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mindstorm Studios"], "genres": ["Arcade"], "publishers": ["Mindstorm Studios"], "esrb_rating": null}