{"id": 676400, "slug": "crystal-crypt-prototype-demo", "name": "Crystal Crypt (Prototype Demo)", "name_original": "Crystal Crypt (Prototype Demo)", "description": "<p>This is a prototype and a learning project I did as I wanted to make a melee FPS style game and learn more about enemy AI. It takes about 15- 20 mins to complete, but is quite difficult so it may take you longer</p>\n<p>It features 8 rooms with different traps and things to avoid, and 3 different enemies, finished by a boss fight. It has a progression system similar to Hades, where at the end of each room you get to pick a power up.</p>\n<p>The main focus was on design and how to setup enemies to do well telegraphed attacks that can be dodged or parried similar to dark souls style, and to attempt to make a boss fight as first person, as I don't think you see many FPS melee boss fights done well.  The art wasn't a focus for me as I wasn't happy with the art style I attempted to make, and ended up just getting it done very quickly with basic textures. which is why it doesn't look great.</p>\n<p>The game is set to testing mode which just means you can skip to the boss by pressing B and going through the door next to the powerups</p>\n<p>**I'm not sure how well this runs on lower end systems so please let me know if it lags as I will try to optimise it, I haven't really done much optimization</p>\n<p><strong>CONTROLS</strong></p>\n<p>MOVE --   WASD</p>\n<p>ATTACK -- LEFT CLICK</p>\n<p>BLOCK / PARRY -- RIGHT CLICK</p>\n<p>SPACE -- JUMP</p>\n<p>Q --  SPECIAL ATTACK (KNOCKBACK)</p>\n<p>E -- CAST SPELL</p>\n<p>SHIFT -- DODGE</p>\n<p>ESC -- PAUSE</p>\n\n<p>***extra testing</p>\n<p>B -- this is a shortcut to open the boss door instead of going through the whole game. if you want to check out the boss</p>", "metacritic": null, "released": "2021-10-04", "tba": false, "updated": "2021-10-08T13:07:06", "background_image": "https://media.rawg.io/media/screenshots/b20/b2089fe3ef365013b6b37370e93bab0f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 203, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Fidrik"], "genres": ["Action"], "publishers": [], "esrb_rating": null}