{"id": 67643, "slug": "word-fiends-wordsearch-puzzle", "name": "Word Fiends -WordSearch Puzzle", "name_original": "Word Fiends -WordSearch Puzzle", "description": "Word Fiends is a casual and addictively fun word game that will keep your hooked on to your device for hours. Play with your friends or random players from all around the world to find as many words as possible in two minute rounds. Swipe over the scrambled letters to form the words and use special tiles to collect more points than your opponent. Stay tuned for a bonus round at the end of each game to get a trivia question to get bonus points. So hurry up and come join the new boggle word fiend revolution! <br/><br/>Story<br/><br/>Fiends, are the little creatures from the planet Cinco, are on their annual vacation to planet Earth and have been greatly inspired and awestruck by the capability of the humans of this land to form words out of thin air! 7.6 Billion bogglers have made friends with each human on Earth to cheer them on as they Level up and take on opponents from all around the world in this boggle styled online multiplayer!<br/><br/>The fiends of the best player will be crowned the next King of Cinco, so fight and use all your wit to be the best friend a boggler can ask for!<br/><br/>Features<br/>* Play with your Facebook friends in this scrambled word brain teaser game.<br/>* Play with players from all around the word and put your word knowledge to test against the world in real-time in Boogle Style challenges and rake up the trophies<br/>* Unlock all 7 of the amazingly beautifully designed rooms as you increase your trophies and increase your chances of winning more gold<br/>*Get a taste of challenging trivia questions in the bonus round to score more points!<br/>* Upgrade your letter cards to score more and more points in the battle and increase your chance of winning<br/>*Collect multiple fiends along the way (under development)<br/>Smart Match: Find other players that match your skill level through Smart Match!<br/>*Daily Rewards: Get prizes for logging in every day to win cool prizes!<br/>* Play with your friends and connect via Facebook and see who can help their fiend become the next king of Minutia!<br/>*STAY TUNED More rooms, cute characters, gameplay, tournaments and surprises are on the way!<br/>*Get access to 100,000 words in the boards to increase your vocabulary.<br/><br/><br/>Get hooked on to a constant challenge in this brain teaser. Are you tired of old and repetitive gameplay? Get on with Word Fiends with interesting boards and trivia. Make the obvious words before your opponent to ensure you get more points in the match. Relive the nostalgia of old word games in a completely new real time boggle design. Play as many rounds of words with every round giving a different challenge.<br/><br/><br/><br/>Sit back, unwind and recognise the word patterns in the grid to make valid words. Highlight the letters to form a word in your wordsearch. Play with friends or family in this family friendly game.<br/><br/>Are you greedy for more points? Get the trivia answer correct in the bonus round to boost your score. Trivia questions are from a number of topics but there is only one valid answer. If the questions gets too tough for you then you can use a hint to get a clue. <br/><br/>--Download Word Fiends by Mindstorm Studios NOW!--<br/>The game is free to play; however, in-app purchases are available for additional content and in-game currency. In-app purchases range from $0.99 to $99.99 USD", "metacritic": null, "released": "2018-03-21", "tba": false, "updated": "2019-10-22T14:26:34", "background_image": "https://media.rawg.io/media/screenshots/f8f/f8f42223ef27cf4d5d7f21a9a710a11a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 87, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mindstorm Studios"], "genres": ["Family"], "publishers": ["Mindstorm Studios"], "esrb_rating": null}