{"id": 67652, "slug": "tiny-turkey-clicker-game", "name": "Tiny Turkey: Clicker Game", "name_original": "Tiny Turkey: Clicker Game", "description": "Want to GROW RICH? Can you TAP FAST enough? CLICK - TAP - BUILD collect roast meat and make cash every day! The cash keeps coming even when you’re not playing! <br/><br/>6 REASONS TO PLAY TINY TURKEY!<br/>SUPER CASUAL GAME PLAY Just keep tapping the screen. The perfect meat produce capitalist's story! Consumer is king!<br/>TAP &amp; BUILD Build your dope barn, collect money, pet dogs, upgrade your township and keep growing! Tap! Tap! Tapped!<br/>CLICK &amp; CASH Casual &amp; addictive captivating idle clicker township game play for turkey happy to go clicking &amp; pocket money every day! Collect what you’re owed from the turkey roast consumer, watch it transported all parts of the world and grow rich!<br/>UPGRADE &amp; GROW Plan your cash investments, lay down and level up your conglomerate business with multiple story upgrades so the cash keeps coming. Progress is the key<br/>UNIQUE VISUALS Amazing and captivating 3D township with beautiful barn scenery, cunning turkeys, roast carrier and Pet dogs<br/>CHALLENGE FRIENDS Think you sell more roast than your friends? Get more turkeys? Exact your revenge and send them turkies this thanksgiving when you lay down a challenge!<br/><br/>Tap like a tycoon and clone as many tiny turkeys as you can to grow your conglomerate and keep upgrading your barn to pocket exact MONEY you are owed from your consumer in this awesome 3D game! Play with swag and see the money come in from all angles, remember to have deep pockets.  A meat roasting farming scenery township simulator with a swag that’s like no other - with dogs you can adopt! You can never have enough!<br/><br/><br/>How long will you keep making hens and sell their eggs for profit. The world wants thee enigma of roasted turkey this thanksgiving so squeeze all the lemons out to make this money lemonade this thanksgiving. Raid the profits of all rival barns in this idle clicker game. Bonus production when you hit hawks to make you a billionaire sooner than later! Get in on this adventure.<br/><br/>3 SIMPLE STEPS TO KEEP GROWING YOUR TOWN<br/>1. Keep clicking to clone and roast - (idle simulator mode when away!)<br/>2. Research and prestige to win<br/>3. Upgrading your habitats to be the farmland township tycoon story all your friends are talking about!<br/><br/><br/>Challenge your dope friends to see who can get rich and sell the rarest roasts in this inline idle cooking pocket clicker! So many reasons to hop on this adventure this thanksgiving and be the richest turkey tycoon this world has ever seen!<br/><br/>Log in to Google Game services to save your progress and continue playing on multiple devices.<br/><br/>~~~~~~~~~~~<br/>ALREADY LOVE THE GAME?<br/>Like us: https://www.facebook.com/tinytycoon/", "metacritic": null, "released": "2017-11-10", "tba": false, "updated": "2019-10-22T14:26:34", "background_image": "https://media.rawg.io/media/screenshots/1a3/1a31daae3d6a1e1ed0bc889426e14ff6.jpg", "website": "http://www.mindstormstudios.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 158, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mindstorm Studios"], "genres": ["Simulation", "Family"], "publishers": ["Mindstorm Studios"], "esrb_rating": null}