{"id": 67658, "slug": "cars-lightning-league", "name": "Cars: Lightning League", "name_original": "Cars: Lightning League", "description": "Feel the thrill of high-octane sport racing in Disney•Pixar’s Cars: Lightning League!<br/> <br/>Blindsided by a new generation of blazing-fast racers, the legendary Lightning McQueen is suddenly pushed out of the sport he loves. To get back in the game, help train the Piston Cup champ in iconic film locations as he prepares for a speedy comeback in this all-new game inspired by Disney•Pixar’s “Cars 3.” Race fast, race smart, and prove to the world that it’s not over until lightning strikes! <br/> <br/>Give it everything you’ve got by assembling a garage of legendary racers featuring Lightning McQueen, Cruz Ramirez, Jackson Storm, and more. Upgrade each car and explore their true potential by reaching insane record-breaking speeds!<br/>• RACE on “Cars 3” inspired tracks—cruise the beach, burn rubber near Radiator Springs, and more!<br/>• COLLECT new speedsters like Jackson Storm and Cruz Ramirez, and old favorites!<br/>• COMPLETE high-speed missions to gain new upgrades and blitz past your rivals!<br/>• WIN challenges to earn slick prizes and go LIGHTNING FAST!<br/><br/>Like us on Facebook for cool games tips &amp; the latest news: www.Facebook.com/DisneyGames.<br/> <br/>Before you download this experience, please consider that this app contains social media links to connect with others, push notifications to let you know when we have exciting updates like new content, as well as advertising for The Walt Disney Family of Companies and some third parties. This mobile app contains in-app purchases and advertising messages, including the option to watch ads for rewards. In-app purchase cost real money and are charged to your account. To disable or adjust the ability to make in-app purchases, adjust your device settings. We respect your wishes regarding your Privacy. You can exercise control and choice by resetting your Advertising Identifier in your device’s Privacy Settings.<br/> <br/>Privacy Policy - http://disneyprivacycenter.com<br/>Terms of Use - http://disneytermsofuse.com", "metacritic": null, "released": "2017-06-15", "tba": false, "updated": "2019-10-22T14:26:34", "background_image": "https://media.rawg.io/media/screenshots/8c8/8c80065d21cb188dfbee661b2f4da271.jpg", "website": "http://lol.disney.com/games/cars3mobile", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 233, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS", "Android"], "developers": ["Disney"], "genres": ["Action", "Racing"], "publishers": ["Disney Interactive"], "esrb_rating": "Everyone 10+"}