{"id": 67676, "slug": "fishing-kings-free", "name": "Fishing Kings Free+", "name_original": "Fishing Kings Free+", "description": "Now you can play the best fishing game on mobile for FREE! <br/>Grab your rod and make the biggest catch! <br/>*******************************************************<br/><br/>- PLAY FOR FREE<br/>Download the game and start playing for free. As you play you will earn cash and XP, which can be used to unlock tons of extra items and new locations. Or purchase packs of cash from the shop to unlock them faster. It’s up to you!<br/><br/>- 15 FISHING SPOTS WORLDWIDE<br/>Visit 5 beautiful 3D-rendered locations from around the world, including saltwater fishing in the Bahamas or exotic places like the Amazon River and the Waikato River in New Zealand, each with 3 different fishing spots.<br/><br/>- 33 DIFFERENT SPECIES TO CATCH<br/>From bass and piranhas to golden dorados and marlins, catch a wide variety of fish in every location you visit. You can even learn more about each species thanks to in the in-game fishing diary.<br/><br/>- GET CLOSER TO THE STRUGGLE THAN EVER!<br/>The underwater camera is a unique feature on the iPhone/iPod touch that puts you in the heart of the action as you struggle to reel in the big one! You can also just have a look at the dozens of fish swimming around you.<br/><br/>- MAKE THE BIGGEST CATCH<br/>Unlock achievements in your Gameloft LIVE! profile, show off your best scores on the dedicated website and vie for the title of Best Fisherman.<br/><br/>- INTENSE AND REALISTIC GAMEPLAY<br/>Whether you’re an experienced fisherman or a fish out of water, the gameplay aims at providing you the most realistic fishing sensations, thanks to a wide range of available moves and actions, from casting your line to hooking and struggling with fish.  <br/><br/>- A HUGE TACKLE BOX<br/>Catching a trophy marlin is more than luck! Access a wide range of fishing gear and use the right tools to catch the species you want.<br/><br/>*******************************************************  <br/><br/>_____________________________________________<br/><br/>Visit our official site at http://www.gameloft.com<br/>Follow us on Twitter at http://glft.co/GameloftonTwitter or like us on Facebook at http://facebook.com/Gameloft to get more info about all our upcoming titles.<br/>Check out our videos and game trailers on http://www.youtube.com/Gameloft <br/>Discover our blog at http://glft.co/Gameloft_Official_Blog for the inside scoop on everything Gameloft.<br/><br/>_____________________________________________<br/>This app allows you to purchase virtual items within the app and may contain third party advertisements that may redirect you to a third party site.<br/><br/>Privacy Policy : http://www.gameloft.com/privacy-notice/<br/>Terms of Use : http://www.gameloft.com/conditions/<br/>End User License Agreement : http://www.gameloft.com/eula/", "metacritic": null, "released": "2011-10-14", "tba": false, "updated": "2019-10-22T14:26:34", "background_image": "https://media.rawg.io/media/screenshots/740/7403959e9d8e4fb3d861753e18fada13.jpg", "website": "http://www.gameloft.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 159, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Gameloft"], "genres": ["Sports", "Arcade"], "publishers": ["Gameloft"], "esrb_rating": null}