{"id": 676704, "slug": "the-forgotten-world-itch", "name": "The Forgotten World (itch)", "name_original": "The Forgotten World (itch)", "description": "<p>This is a small game (maybe more of a demo) for what could be a much larger game.</p>\r\nNOTE!\r\n<p>For the duration of Ludum Dare, I will have my web-playable game be the \"Jam Version\" If you want to play post-jam versions you should check the downloads for an updated file. After Ludum Dare I'll remove this block of text and keep the web-playable as the latest version<br/></p>\r\nBasic Outline\r\n<p>There was a fissure in the middle of town and you fell down into it. You found a strange fungal waste, some friendly creatures and some not so friendly creatures. </p>\r\nControls\r\nController/Gamepad\r\n<p>Theoretically this game has full controller compatibility, even the web version. However, I was only able to test with a knock-off xbox 360 usb controller so I can't say if any controller will work. It uses Godot's built-in controller support so I'm hoping it works for you.</p>\r\nMouse &amp; Keyboard\r\n<p>Movement = WASD, Arrow Keys</p>\n<p>Interact/Proceed Dialogue = Z, Enter, Left Mouse Click</p>\r\nTheme Explanation\r\n<p>The theme for the 49th Ludum Dare was \"Unstable\"<br/></p>\n<p>I wasn't able to make as much as I would like thanks to mental instability. Therefore I followed the theme perfectly!!! (I'm doing much better now)</p>\r\nInspiration\r\n<p>This game is mainly inspired by Undertale and Deltarune. I was hoping to iterate on mechanics from both of those games.  </p>\r\nFuture Plans\r\n<p>I think that in its current state, this is fine for a Jam game, but I want to make it a bit more than it is now. To follow my inspiration I want to make more thematic and interesting battles, more interesting story. I will of course keep my two little lads I made.</p>\r\nCredits\r\n<p>I used a lot of Kenney assets for blockouts and in the initial phases. All art, music, code, etc... are made by me excepting the tools I used and the Godot plugins.</p>\r\nTools Used:\r\n<ul><li>Godot<ul><li>Dialogic</li></ul></li></ul>\n<ul><li>Aseprite</li><li>LMMS</li></ul>", "metacritic": null, "released": "2021-10-04", "tba": false, "updated": "2021-10-08T14:26:49", "background_image": "https://media.rawg.io/media/screenshots/a01/a018ad736eb3033da4130f2eee1f7115.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 19, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["QueenOfSquiggles"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}