{"id": 676825, "slug": "pigeon-gang", "name": "Pigeon Gang", "name_original": "Pigeon Gang", "description": "<p>In a small town in Denmark called Randers, a group of cruel biker pigeons <br/>is causing trouble in town, especially around the local train station.<br/><br/>The local police force has called in expertise from the experienced hunter Frans Rasmussen, in an attempt to save the city and create peace for the inhabitants.<br/><br/>As the character Frans, your job is to eradicate as many pigeons as needed to get through to the next level, and if you are a sharp shooder, you will get bonus for Extra pigeons taken down within each level.<br/><br/>A fun and addictive game, both as single player and used as highscore competition between friends.<br/><br/>CAN YOU GET THE HIGHEST SCORE :)<br/><br/>How to play:<br/>You use your mouse to scroll left and right on the train station,<br/>use left mouse to shoot, and use right mouse to reload your gun if out of shots.<br/>The futher away the pigeons, the higher the points and there is bonus for <br/>precision, so dont waist your shots in the air.<br/>There is also extra bonus if you can take down more pigeons then<br/>the level requires within the time.<br/><br/>As you get though the levels, more and more pigeons are required to be taken down, and it will be more and more stressfull to match the required amount to get to the next leve.<br/><br/>This product is freeware and you are hereby authorized to make as many digital copies of it as you wish - provided you do so for free.<br/>No transaction can be involved in the distribution of this product. <br/><br/>This game was developed in 2018 in a retro gaming community in Denmark.<br/></p>\n<p>Credits: <br/>Graphics and Music: Teddy Rene Hansen aka 'Mis' <br/> Programming: Karsten Tarnow Niemeier aka 'Tarnow'<br/><br/>Requirements:<br/>64bit Windows</p>", "metacritic": null, "released": "2021-10-04", "tba": false, "updated": "2021-10-08T14:59:41", "background_image": "https://media.rawg.io/media/screenshots/ae1/ae1f703d36eb14555a9a7fc50df7a807.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 126, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["mis_dk"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}