{"id": 67687, "slug": "spades-plus-card-game", "name": "Spades Plus - Card Game", "name_original": "Spades Plus - Card Game", "description": "Let’s join the LARGEST SPADES COMMUNITY in the world to play with millions of online players!<br/><br/>Spades Plus offers you a great experience against many Spades players from all around the world!  You can play in many different game modes such as Classic, Solo, Mirror and Whiz. <br/><br/>Now playing Spades is much better with Tournaments, Knock-Out and many other different modes!<br/><br/>Spades is one of the traditional trick-taking card games like Bid Whist, Hearts, Euchre &amp; Canasta, but this game is played in pairs in which spades is always the trump. <br/><br/>==SPADES PLUS FEATURES==<br/><br/>● FREE COINS<br/>Get 20,000 Free Coins as a “Welcome Bonus”, and get even more coins by collecting your “Daily Bonus” every day!<br/><br/>● DIFFERENT MODES<br/>Play Spades however you want!<br/><br/>CLASSIC:  Make your bid with your partner and challenge other teams  <br/>VIP:  Play the classic Partnership Spades in custom Tables<br/>SOLO:  There is no partnership.  Each player gets his/her own points<br/>MIRROR:  You bid the number of your Spades Cards in your hand<br/>WHIZ:  You can bid “NIL” or the number of your Spades Cards in your hand   <br/><br/>● TOURNAMENTS &amp; CHALLENGES<br/>Win the 16 player-Tournament or Knock-Out Challenge to get amazing prizes!<br/><br/>● GREAT SOCIAL EXPERIENCE<br/>Meet new people and add them as friends to be their best partner or challenge them in games!<br/>Use Public or Private Chat to stay in touch with other players.<br/><br/>● CREATE YOUR OWN TABLES<br/>You can create tables in different modes.  Choose your “Game Rule” type, set the “Bet Amount” and the “Final Point” or decide if there will be “Nil”, “Blind Nil” or “Chat” options.  If you don’t want to be found, create your own “Private Table” where games are “Invite Only”.<br/><br/>● GET NEW DECKS<br/>Join the seasonal competitions to get new deck designs.  Show your new decks to other users while playing against them!<br/><br/><br/>Additional information:<br/><br/>*Make sure you have a good internet connection to get the best experience.<br/>*The game is free to play; however, in-app purchases are available for additional content and in-game currency. In-app purchases range from $0.99 to $99.99 USD.<br/>*Use of this application is governed by Zynga’s Terms of Service, found at www.zynga.com/legal/terms-of-service.<br/><br/>Spades Plus has monthly Subscriptions that allow you unlock Emoji, Table Colors and Remaining Cards features unlimited and get additional game currencies every day.<br/><br/>Prices are in United States dollars and will be converted to the local currency or your country of residence. Pricing and other subscription details are subject to change upon prior notice by Zynga. <br/><br/>Account will be charged for renewal within 24-hours prior to the end of the current period, and identify the cost of the renewal.  Additionally, auto-renewals may be turned off in your Device Settings after purchase. Your iTunes Account will be charged when the purchase is confirmed. Refunds will not be provided for the unused portion of any term.<br/><br/><br/>", "metacritic": null, "released": "2014-05-19", "tba": false, "updated": "2019-07-30T18:04:41", "background_image": "https://media.rawg.io/media/screenshots/a38/a38b87349f7830ed0756ba48570751dc_syJ82wQ.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 70, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["Zynga"], "genres": ["Board Games", "Card"], "publishers": ["Zynga"], "esrb_rating": null}