{"id": 676908, "slug": "the-howitzer", "name": "The Howitzer", "name_original": "The Howitzer", "description": "<p>The Howitzer, is a hyper casual slingshot based adventure game, which can be played by people of all age groups. The game is intended to provide all round fun to people by playing the game at their comfort and free time.<br/><br/>Game play is pretty simple, like any other casual game, but we have tried to make it interesting by introducing some new type of obstacles and game play challenges. Game is thoroughly tested and have gone through a 3 months of BETA testing to ensure that players enjoy playing the game.<br/><br/>Some of the key features of the game:<br/><br/>- Easy game play.<br/>- Physics based game.<br/>- Social login.<br/>- Global Leaderboard<br/>- Friend Leaderboard<br/>- No advertisement during gameplay.<br/>- Different objects to throw<br/>- Settings.<br/>- Credits to development team.<br/>- Google Play Services integration<br/><br/>We have not limited our development and creativity for this game to the above listed features. We are planning to build some many interesting features like competitive game play, compete with friends game play, and more. We are always fascinated by creative yet simple games, and so we have put our efforts to create this game.<br/><br/>We will await your feedback and reviews. We do expect positive/negative feedback's and it will help us make the game even better. Feel free to drop us a message or email anytime and we will be happy to assist.</p>", "metacritic": null, "released": "2021-10-04", "tba": false, "updated": "2021-10-08T15:22:09", "background_image": "https://media.rawg.io/media/screenshots/70c/70c67d7a86f59b04c2ff1320e8c24730.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 28, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Techymau Game Studios"], "genres": ["Shooter", "Adventure"], "publishers": [], "esrb_rating": null}