{"id": 677066, "slug": "sleepless-ojosama", "name": "Sleepless (ojosama)", "name_original": "Sleepless (ojosama)", "description": "<p><strong><br/>SUMMARY</strong></p>\n<p>St. Helga Academy, a private all-girls boarding school in America, is home to some of the greatest young minds in the country. Hidden away in a small suburb, most students complete their education here without harm.</p>\n<p>However... on an especially normal day, the students at St. Helga find themselves facing a problem that may very well threaten all of their lives: spirits who are out for their blood. For one student, this is nothing but a wonderful dream. But, for everyone else, this is just the start of a waking nightmare...</p>\n<p><strong>GAMEPLAY</strong></p>\n<ul><li>While Nora may not start with many skills, she will able to gather more and more as the game goes on. </li><li>Various characters can be recruited throughout the game.</li><li>Enemies can be talked to, but don't expect them all to be friendly.</li><li>As the friendship between certain party members grow, scenes between them will be shown. (This is mostly unfinished, but I'll MAYBE add in more in a later patch)</li></ul>\n<p><strong>HOW TO PLAY</strong><br/>Unzip it and place the game into a directory of your choice. Run the exe file included.</p>\n<p><strong>CHANGELOG</strong><br/>The initial release of the game starts the player in the debug room! If you're reading this, the current download is fine.<br/>(all times are in the CST timezone)<br/>10/3/2021 11:55 PM: I found a bug in the intro of the game. Please redownload to experience full intro of the game, and apologies for all the screw-ups!<br/>10/4/2021 1:57 PM: Bugs on the 1st floor are fixed. If you are unable to proceed, please download the new update.<br/>10/5/2021 2:07 AM: Supports for some characters have been implemented into the game, and encounter rate has been adjusted. Also, fairies won't end your life as fast.<br/>10/6/2021 1:45 PM: Made a few balance changes so that a certain boss didn't have completely busted stats. <br/></p>\n<p><strong>CREDITS</strong></p>\n<p>Writing, art, and gameplay are done by yours truly.<br/>Sprites are made by First Seed Material and edited by me.<br/>A big thanks to all of the composers below for creating the songs featured in the game:<br/></p>\n<p>TAM Music Factory - 闇詠乃 功良 - Moon☆Wind - Ivy Maze - G2-MIDI<br/></p>", "metacritic": null, "released": "2021-10-04", "tba": false, "updated": "2021-10-08T16:03:01", "background_image": "https://media.rawg.io/media/screenshots/864/864db594ed137f6145ac4904a0a97905.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 83, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["ojosama"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}