{"id": 6770, "slug": "granny-smith", "name": "Granny Smith", "name_original": "Granny Smith", "description": "From the makers of Sprinkle!<br/><br/>&amp;quot;Granny Smith feels like the climactic chase scene of a Wallace &amp;amp; Gromit cartoon&amp;quot; [slide to Play]<br/><br/>&amp;quot;Gaming app of the day&amp;quot; [Kotaku]<br/><br/>&amp;quot;Another great looking release from the Sprinkle crew, one that provides hours of entertainment without a steep learning curve&amp;quot; [JayIsGames]<br/><br/>&amp;quot;The graphics have been polished to perfection, and have an almost Pixar-like appearance.&amp;quot; [GameTrailers]<br/><br/>Granny Smith loves her apples, but a bewheeled thief is stealing from her precious garden! Help Mrs. Smith as she swiftly skates through farmland and cityscapes, crashing through everything from barns to offices in the pursuit of fruit. Get to the apples before the thief does!<br/><br/>Granny Smith is a fast-paced racing platformer filled with spectacular crashes and amazing stunts. Jump, glide, swing and smash your way through 57 hand-crafted levels in four distinct settings. Just be sure to land on your feet!<br/><br/>Features:<br/><br/>* Spectacular physics – Granny Smith uses some of the most advanced destruction physics in mobile games. Crash through crates and windows and watch the pieces fly all over!<br/><br/>* Dazzling visuals – Zoom through dozens of vibrant, whimsical worlds! Each level is like a fanciful, three-dimensional storybook.<br/><br/>* Intuitive controls – Help Granny pull off crazy moves with simple two-button controls – perfect for both tablets and phones.<br/><br/>* Vintage replays – Watch your best runs in retro movie style with cool camera angles and slow-motion effects!<br/><br/>* Power Granny up – Collect coins and equip Granny with a helmet, banana peels and baseballs. If Granny is getting old, you have two alternative characters to play with – Scruffy and Stanley!<br/><br/>With the apple thief on the loose, Granny is going to need some help. Hop to it!", "metacritic": null, "released": "2012-08-30", "tba": false, "updated": "2024-01-23T06:25:56", "background_image": "https://media.rawg.io/media/screenshots/432/432a58b7bf40017fd088926dd057124e.jpg", "website": "http://www.grannysmithgame.com", "rating": 4.33, "rating_top": 4, "added_by_status": {"owned": 2, "beaten": 7, "toplay": 1, "dropped": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 6, "suggestions_count": 151, "game_series_count": 0, "reviews_count": 6, "platforms": ["Android", "iOS"], "developers": ["Mediocre"], "genres": ["Racing", "Arcade", "Casual"], "publishers": ["Mediocre"], "esrb_rating": "Everyone 10+"}