{"id": 677172, "slug": "forest-adventure-3", "name": "Forest adventure", "name_original": "Forest adventure", "description": "<h3>Story</h3> One morning, a little girl who had just woken up saw that her favorite handkerchief had been taken away by a wolf. In order to get her handkerchief back, the girl, who had no fighting ability, decided to follow the wolf to the mountain.<h3>Gameplay</h3> This is a stealth game where the girl must avoid the enemy’s line of sight, solve puzzles blocking her path, pass through multiple levels, and finally retrieve her handkerchief.<br/><br/><ul><li>Crouching in dark grass can help avoid detection.<br/><br/><br/></li><li>Wind magic is weak and cannot harm enemies. However, it can ring some bells, and the sound of bells can attract animals’ attention and divert them.<br/><br/><br/></li><li>Life magic can heal injured animals. There will be other animals accompanying injured animals, and these animals will not be attracted by other things. They need to wait for the injured animal to recover before they can move.<br/><br/><br/></li><li>Life magic can accelerate plant growth, allowing vines to grow along cliffs and allowing the girl to climb up the mountain.<br/><br/><br/></li><li>Accelerating the growth of plants under rocks can lift the rocks to a certain height, allowing the girl to step on them and jump over wider distances.<br/><br/><br/></li><li>Flame stone piles can drop some small pieces of flame stone, which can make noise when thrown out to attract enemy attention.<br/><br/><br/></li><li>At the final Water Ruins, the gate switch can be triggered by water magic, but the girl does not know water magic. How should she solve this problem? <br/></li></ul>", "metacritic": null, "released": "2021-10-10", "tba": false, "updated": "2023-09-08T03:45:57", "background_image": "https://media.rawg.io/media/screenshots/ab4/ab4032feb7f1f288d2cc5cf92a764a37.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 176, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Quarlellle", "90s Studio"], "genres": ["Action", "Adventure", "RPG", "Casual", "Indie"], "publishers": ["Quarlellle", "90s Studio"], "esrb_rating": null}