{"id": 67712, "slug": "frozen-free-fall", "name": "Frozen Free Fall", "name_original": "Frozen Free Fall", "description": "Play Disney's #1 puzzle game featuring 1,000+ challenging puzzles! <br/><br/>“I thought there was a lot to like about Frozen; I could probably talk about it for a long time.” – Penny Arcade<br/> <br/>Get ready for an epic puzzle matching adventure in the Kingdom of Arendelle, inspired by Disney’s Frozen! Join Anna, Elsa, Olaf and more of your favorite characters on a journey to slide and match hundreds of icy puzzles for FREE!<br/> <br/>Unlock MORE seasonal puzzles and game modes as you explore the land with our new updates!<br/> <br/>JOURNEY WITH FACEBOOK FRIENDS - Ran out of Hearts? Ask your friends for more and return the favor by gifting them right back!<br/><br/>EXCITING MATCH-3 GAMEPLAY – Slide beautiful and colorful ice crystals to match 3 or more, and test your matching skills with extra challenging objectives!<br/> <br/>UNLOCK YOUR FAVORITE CHARACTERS – Follow the story and play with even more characters like Olaf, Kristoff, Sven, Hans, and more!<br/> <br/>UNIQUE POWER-UPS SPECIALLY DESIGNED FOR EACH CHARACTER – Use Anna’s torch to burn up an entire row of crystals, or Elsa’s glacier power-up to make all of the same color crystals magically disappear! Try Hans’ sword to slash right through the crystals, and explore many more cool power-ups!<br/><br/>BRING YOUR OWN ARENDELLE TO LIFE - Earn coins &amp; rewards by beating levels to decorate and customize your own Plaza in Arendelle with shops, fountains, carts, and more!<br/><br/>iCLOUD SUPPORT-Sync your game progress across multiple Apple devices through iCloud!<br/><br/>Visit Facebook.com/DisneyGames for cool game tips, news and more! Free Fall is free to play but some in-game items may require payment. <br/> <br/>Before you download this experience, please consider that this app contains social media links to connect with others, in-app purchases that cost real money, push notifications to let you know when we have exciting updates like new content, as well as advertising for The Walt Disney Family of Companies and some third parties.<br/><br/>We respect your wishes regarding your Privacy. You can exercise control and choice by resetting your Advertising Identifier in your device’s Privacy Settings.<br/> <br/>Privacy Policy - http://disneyprivacycenter.com<br/>Terms of Use - http://disneytermsofuse.com", "metacritic": null, "released": "2013-11-21", "tba": false, "updated": "2019-07-29T07:53:25", "background_image": "https://media.rawg.io/media/screenshots/cee/cee15a5cb20dbe8d3d67f346e9341749.jpg", "website": "http://disney.go.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 30, "dropped": 2}, "playtime": 0, "achievements_count": 7, "ratings_count": 1, "suggestions_count": 363, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS", "Android"], "developers": ["Disney"], "genres": ["Arcade", "Family", "Puzzle"], "publishers": ["Disney Interactive"], "esrb_rating": "Everyone 10+"}