{"id": 677176, "slug": "your-sword-is-so-big", "name": "Your Sword Is So Big", "name_original": "Your Sword Is So Big", "description": "Your Sword Is So Big is an emotional game with a 3rd-person view in the fantasy genre. Visit medieval castles and cities, forests, swamps, dark ruins and dungeons. Face off against knights, samurai, Vikings and monsters. Use your big, sharp two-handed sword to defeat them all. By killing enemies, you will accumulate experience, open new attacks and become stronger. In terms of gameplay, Your Sword Is So Big is a set of arenas where you need to kill all the enemies. The levels in the game are not large, however, they are perfectly designed and densely filled with enemies to create a dynamic battle.  The detailed appearance of the character, a deep combat system and sensual animations will not let you get bored, and the beauty of the local castles and landscapes takes your breath away!<br/><br/><h3>Features Of the Your Sword Is So Big</h3><br/><ul><li> Epic sword battles<br/></li><li> A variety of enemies and locations<br/></li><li> Modern graphics<br/></li><li> Medieval Music<br/></li><li> A sensual character</li></ul><br/><br/>Controls:<br/>Press G to switch the character<br/>Press M to turn the music on or off<br/>Press F to draw the sword<br/>Click the right mouse button to take a fighting pose<br/>Click the right mouse button to block the kick<br/>Click the left mouse button to strike with the sword<br/>Press Q to display the combat interface<br/><br/>When you kill several enemies and gain experience, new animations of sword strikes will become available to you and you will be able to do somersaults.<br/><br/>While in a fighting pose, press the space to somersault<br/>Hold down the left mouse button to make an attack on the area<br/>Press the number 3 on the keyboard to make a series of strokes<br/><br/>Disclaimer: This is a small project made by one person, which is a set of arenas where enemies are placed. This game is suitable for you only if you want to wave a sword in medieval scenery, no more. Thank you for paying attention to this.", "metacritic": null, "released": "2021-10-08", "tba": false, "updated": "2021-10-11T02:10:43", "background_image": "https://media.rawg.io/media/screenshots/7c6/7c62bfbd5a16a54b6f03920be0725a52.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 550, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Flex Entertainment"], "genres": ["Action", "Adventure", "RPG", "Simulation", "Casual", "Indie"], "publishers": ["Flex Entertainment"], "esrb_rating": null}