{"id": 677239, "slug": "zhi-shi-chu", "name": "指示厨", "name_original": "指示厨", "description": "Instruction Chu is a game for live streamers. The streamer needs to control a head, and retrieve his body under the guidance of the audience.<br/><br/>As for whether the audience will deliberately mislead the streamer, or the streamer could look through the large number of chat, to find the chat those help them sincerely. Or can the streamer establish a powerful way to communicate with the audience, and use timely and efficient communication to, finally, get the head back upon the body before everything goes awful.<br/><br/>That definitely would be an interesting question.<h3>Game Features</h3><ul> <li> Short but funny 30 mins adventure.<br/></li><li> Puzzles and levels greatly challenge the friendship between streamer and audience.<br/></li><li> Choose a difficulty, and have fun with a bunch of random-generated levels.<br/></li><li> Give your audience an unique watch experience.</li></ul><br/>(To broadcast and play the game, the streamer needs OBS Studio)<h3>The unique gameplay different from other streaming games</h3>Unlike other streamer games, Instruction Chu is a game about trust and communication.<br/>The words audience send in the chat, would not directly change the game content.<br/><br/><strong>Instead, there are so much essential information, which could only seen by audience.</strong><br/><br/>But some of these information are full of danger, some would be hard are to describe with words.<br/>As an streamer, let's embark on an unknown and funny journey of challenge with your audience!<br/><br/>Of course, even if you are not a streamer, you can also play the game with your friends, just like any other cooperative games.", "metacritic": null, "released": null, "tba": false, "updated": "2021-10-11T02:58:30", "background_image": "https://media.rawg.io/media/screenshots/ddc/ddc66a4b65d0ecb97230dac4c2971646.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 163, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["瑞翠瞎做"], "genres": ["Indie"], "publishers": ["瑞翠瞎发"], "esrb_rating": null}