{"id": 677222, "slug": "rc-rush", "name": "RC Rush", "name_original": "RC Rush", "description": "RC Rush is an exciting arcade racing game featuring radio controlled trucks. Win races to unlock career events, compete in head to head battles to unlock new vehicles, and level up your way to becoming the ultimate RC champion!<br/><br/><strong>Key Features</strong><br/><ul><li>Race on over 30 different tracks - You'll visit the scrapyards, playgrounds, a volcano and more! You’ll compete in places you wouldn’t normally be allowed to race RC vehicles, like the inside of an Egyptian tomb!<br/></li><li>Free roam - Explore the levels outside of races, including two bonus crawler-style levels designed for exploration.<br/></li><li>Career mode - 100 race, elimination and time trial events currently make up career mode.<br/></li><li>Realistic, but not *too* realistic - Cutting edge physics make the RC vehicles feel realistic, but gives them arcade-style handling with the focus on fun!<br/></li><li>VR or not - Play in VR from a standing (static) viewpoint for the full immersive RC Rush experience, or play on a regular screen on one of 3 different viewpoints (standing, behind the truck or top-down cameras).</li></ul><br/><br/><br/>RC Rush is an amazing racing experience you can play in VR or on your PC monitor. To drive, you can use a gamepad, keyboard or VR controllers. There are several options to allow you to play the game how you want - choose the A.I. driver difficulty level and apply helpers to the steering or braking, if you like. The goal here is RC FUN for EVERYONE!<br/><br/>https://store.steampowered.com/app/1654800/RC_Rush/", "metacritic": null, "released": "2021-10-08", "tba": false, "updated": "2023-05-19T14:26:23", "background_image": "https://media.rawg.io/media/screenshots/634/634164b30c14a8bf479ed061a280070e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 0, "achievements_count": 22, "ratings_count": 0, "suggestions_count": 428, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["4 Fun Studio", "Tea Monster Games"], "genres": ["Action", "Sports", "Racing"], "publishers": ["Tea Monster Games"], "esrb_rating": null}