{"id": 677274, "slug": "disney-wonderful-worlds", "name": "Disney Wonderful Worlds", "name_original": "Disney Wonderful Worlds", "description": "Join Minnie, Mickey and other classic Disney characters to solve puzzles, then design your very own fantastical theme park in Disney Wonderful Worlds! <br/><br/>For a limited time, celebrate 50 years of magic with Disney Wonderful Worlds, honoring the 50th Anniversary of Walt Disney World Resort. Watch your park come to life with exclusive decorations and rewards, from wherever you are in the world!<br/><br/>The sky’s the limit in this puzzle-meets-builder game! Swipe and match colorful gameboards to win prizes, and unlock iconic Disney attractions from around the globe to place in your park. Level up and create your unique park with exclusive decorations, landmarks and characters. Play events and watch your magical park come to life from morning to night with the Mid-Day Parade and Evening Fireworks Show! <br/><br/>In Disney Wonderful Worlds, you will:<br/><br/>- PLAY fun and challenging Match-3 puzzles to build your very own Disney experience, with new levels weekly<br/>- BUILD classic attractions from Disney Parks around the world<br/>- PERSONALIZE your park with exclusive decorations and landmarks<br/>- CELEBRATE fantastic events in your park<br/>- GRANT WISHES for your Disney Park guests in exciting missions<br/><br/>What are you waiting for? Bring your fantasy to life in Disney Wonderful Worlds!<br/><br/>* Please note: Disney Wonderful Worlds is completely free to play but offers some game items for purchase with real money. <br/><br/>If you choose not to use this feature, you can disable in-app purchases in your device’s settings.<br/><br/>--<br/><br/><br/>Created with Unity. Portions of this program © 2005-2020 Unity Technologies.<br/>DISNEY WONDERFUL WORLDS software © 2020 Ludia, Inc. All Rights Reserved.<br/><br/>Privacy policy can be found at https://legal.ludia.net/mobile/2019-2/privacyen.html<br/><br/>Terms of service can be found at https://legal.ludia.net/mobile/2019-2/termsen.html<br/><br/>http://legal.ludia.net/mobile/wys/legal.html<br/><br/>By installing this application you agree to the terms of the licensed agreements.", "metacritic": null, "released": "2021-10-05", "tba": false, "updated": "2021-10-11T03:23:09", "background_image": "https://media.rawg.io/media/screenshots/989/9895a93ac07596d1b8bbff4cd4dabdb7_b2hQF5h.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 195, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ludia"], "genres": ["Simulation", "Puzzle"], "publishers": ["Ludia"], "esrb_rating": "Everyone 10+"}