{"id": 677228, "slug": "deep-despair-2", "name": "Deep Despair 2", "name_original": "Deep Despair 2", "description": "<strong>Deep Despair 2</strong> is an open world survival action adventure game with procedural generation and complete freedom of action. The game is a direct continuation and development of the first part. The sequel has become much larger, more serious, more interesting and has acquired many new mechanics that will help you survive or brighten up your leisure time in the game. You are free to engage in animal breeding, the production of alcohol for the manufacture of various drinks and Molotov cocktails, brewing, cooking, farming, building and strengthening your base (electricity will help you!) Or just collect food and go on a journey across a diverse world accompanied by the rain. Potions will help you grow faster and stronger, cooking will open up many satisfying dishes for you, and your own farm will supply you with all the resources you need. In the game you will not be bored if you love freedom of action and know how to entertain yourself!<br/>Prepare a sword, sharpen it on an anvil, put on obsidian armor, stock up on food with potions and go into the bowels to get magma crystals to create the best equipment in the game! After that, you can go to the snow-covered North Pole and enjoy the coolness. Welcome to the wonderful new world of Deep Despair 2! He is back.<br/><br/><br/><ul><li>More than 500 items and a wide craft using a variety of devices<br/></li><li>Huge procedurally generated worlds with rich flora and fauna<br/></li><li>Diverse biomes: forest, desert, beach, river, ocean, swamps, jungle and even the North Pole<br/></li><li>Water transport for full sea voyages<br/></li><li>4 levels of dungeons: mines, deep caves, lava lakes and bowels<br/></li><li>Dangerous bosses with unique loot<br/></li><li>More than 10 types of armor with unique bonuses<br/></li><li>Full-fledged in-game map with a labeling system<br/></li><li>New combat system based on parrying and blocking attacks with a shield<br/><br/></li><li>New types of weapons and tools (maces, crushers, hammers, sickles and others)<br/></li><li>Farming and growing flowers, trees, berries and more<br/><br/></li><li>Livestock and farms<br/></li><li>Expanded building system with tons of decor, paint blocks and furniture<br/><br/></li><li>Protecting your base with stakes, electricity and other things<br/></li><li>Change of time of day and weather<br/></li><li>Large-scale forest fires that have a destructive effect on nature<br/></li><li>Alcohol production and brewing<br/><br/></li><li>Cooking: more than 20 types of food to choose from<br/></li><li>Mining craft: mining and smelting in a furnace<br/><br/></li><li>Processing of raw materials in different ways using different devices<br/></li><li>Repair tools, armor and weapons on the anvil<br/></li><li>Exploration of dungeons and dangerous battles<br/></li></ul>", "metacritic": null, "released": "2021-10-08", "tba": false, "updated": "2023-06-02T15:31:05", "background_image": "https://media.rawg.io/media/screenshots/fb7/fb7376e3e8b6d95058bb538e27049b6c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 6, "owned": 2, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 393, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BekkerDev Studio"], "genres": ["Adventure", "RPG", "Simulation", "Indie"], "publishers": ["BekkerDev Studio"], "esrb_rating": null}