{"id": 67739, "slug": "tiny-hamster-clicker-game", "name": "Tiny Hamster: Clicker Game", "name_original": "Tiny Hamster: Clicker Game", "description": "Do you LOVE HAMSTERS? Want to be a MONEY TYCOON? Can you TAP FAST enough? RESEARCH - TAP - DIG DEEP - RESEARCH - CLONE and tap away - even when you're not playing! <br/><br/>8 REASONS TO PLAY TINY HAMSTERS TYCOONS! <br/>SUPER DOPE GAMEPLAY Just keep tapping the screen. The perfect idle clicker tycoon game, without every feeling bored! Or having to battle against your foes Find all the emerald and coal the mines have to offer!<br/>TAP, BUILD, RESEARCH &amp; UPGRADE Upgrade your Hamsters, make money, do researches and feel rich! Tap! Tap! Tapped!<br/>CLICK &amp; CASH Casual &amp; addictive gameplay for aspiring capitalist who love to click &amp; make Money. Boot the competition in this episode of hamster tycoons!<br/>ADD SWAG TO YOUR COUNTRY’s ECONOMY Not everything is about Profit! Can your hamsters reshape the economy of your country? Take prestige in raiding other economies and be the ultimate miner tycoon. UNIQUE VISUALS Feed bones to your dogs and watch it run all over town, silly dogs to hunt and carrier storks to steal from with amazing 3D visuals and captivating scenery.<br/>BE A BONUS BUFF Lots of bonuses with every prestige, will keep you coming back for more, fulfil your consumers’ appetite for electricity and coal city building dig deep to be the biggest Capitalist of this era.<br/>QUIRKY ECONOMY Take full advantage of this enigmatic economy by clicking on your quirky tiny hamster to make more and more money<br/>PRESTIGE Use your swag to sell your minerals for more money by gaining more prestige in this quirky clicker game<br/><br/>You have the greatest invention of this era – your own cloning machine - Tap like a tycoon and make as many Tiny Hamsters as you can to grow and upgrade your town to make MONEY in this awesome 3D game! Make emeralds not war. Pay the quantum of compensation due to steer away from any trouble!<br/>Expansion is the goal. Make emerald not war. <br/><br/>Lay back and enjoy your story to world rescue in this idle clicker game with an amazing &amp; addictive game-play.", "metacritic": null, "released": "2017-10-03", "tba": false, "updated": "2019-10-22T14:02:09", "background_image": "https://media.rawg.io/media/screenshots/a64/a64a94ee7fb7fa6963fc5d779f678ed7.jpg", "website": "http://www.mindstormstudios.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mindstorm Studios"], "genres": ["Simulation", "Family"], "publishers": ["Mindstorm Studios"], "esrb_rating": null}