{"id": 677449, "slug": "spark-3", "name": "Spark!", "name_original": "Spark!", "description": "<p><strong>SPARK!</strong></p>\n<p>Spark est un jeu de coopération asymétrique dans lequel vous contrôlez  un agent de terrain (WASD + souris), chargé de connecter les câbles pour que l'électron puisse se déplacer. Le joueur 2 joue l'éléctron (Manette).<br/></p><p>Ensemble vous devrez veiller à ce que la corruption informatique n'atteigne pas 100%.</p>\n<p>-La victoire vous sera offerte lorsque toutes les données situées au point de sauvegarde ont été récupérées (barre bleue). Pour les récupérer, il faut impérativement que les deux joueurs restent sur le point de sauvegarde.\r\n</p>\n<p>Restez attentifs car de vilains personnages viendront couper les connexions, et des mini-défis vont jouer sur l'issue du jeu, rendant la tâche intéressante pour chacun des joueurs avec des défis exclusifs.</p><p><strong>Réalisation : ChronoMakers</strong></p><ul><li>Thibaud Simon</li><li>Ilona Peltier</li><li>Nicolas Gravel</li></ul><p><strong>Styles imposés : Coop, chance</strong></p><p><strong>Thème : Connexion</strong></p><p><strong>Interface</strong>\n</p>\n<ul><li>La gauche de l'écran affiche les mini-défis de l'éléctron, intéractifs à la manette\r\n</li><li>La droite de l'écran affiche les mini-défis de l'agent de terrain, intéractifs au clavier\r\n</li><li>En bas de l'écran, une barre affiche le temps restant avant Game Over. Ce temps peut être augmenté en réussissant des défis d'éléctron ou d'agent de terrain\r\n</li><li>En haut de l'écran, une autre barre affiche la quantité de données récupérées. Une récupération à 100 % est la condition de Victoire.\r\n</li></ul><p><strong>Contrôles </strong></p><p>L'agent tourne en fonction des mouvements de la souris, il intéragit avec les défis avec la touche E du clavier (Boites de connexions, serveurs cassés (étincelles bleues))\r\n</p>\n<p>L'électron se contrôle avec le joystick gauche de manette.  Il se déplace sur les lignes éléctriques d'intersections en intersections (blocs roses). Il peut rencontrer des défis par hasard à certaines intersections (symbolisés par des blocs noirs).\r\n</p>\n<p>Chaque défi permet de remonter la barre de temps située en bas de l'écran, si remporté. Attention cependant car un défi échoué applique un malus sur le temps.</p><p><strong>Mécaniques</strong></p>\n<ul><li>Chaque défi permet de remonter la barre de temps, si remporté. Attention cependant car un défi échoué applique un malus sur ce temps !</li><li>Pour passer, l'électron doit se faire ouvrir la voie par l'agent de terrain (J2). Si un fil est coupé, la boite de liaison à proximité propose un défi permettant de colmater le fil lors de la réussite.</li><li>Le but du jeu est d'atteindre un 100% de récupération de données (barre bleue haut d'écran).</li><li>Pour récupérer les données, il faut que les deux joueurs se rejoignent sur le terminal de sauvegarde, situé en haut à droite du plateau. </li><li>Il faut veiller à ne pas perdre tout le temps restant, en étant mobile, en accomplissant des défis, et en s'entraidant.</li></ul>", "metacritic": null, "released": "2021-10-10", "tba": false, "updated": "2021-10-11T04:12:57", "background_image": "https://media.rawg.io/media/screenshots/2ec/2ecf39ae96031cfbe8c7fa3c72889d95.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 23, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ChronoMakers"], "genres": [], "publishers": [], "esrb_rating": null}