{"id": 67758, "slug": "fruit-nibblers", "name": "Fruit Nibblers", "name_original": "Fruit Nibblers", "description": "From the creators of ANGRY BIRDS comes the most DELICIOUS of match 3 games with CUTE characters and FRESH and FRUITY puzzle gameplay. Meet the NIBBLERS – your fishy friends who only want to eat YUMMY fruit – ALL the yummy fruit! Om nom nom! <br/><br/><br/>All fun and games right? Woohoo! Fruit party over here! Well, the island’s reptilian inhabitants are not too happy about our group of aquatic party animals gobbling up all their fruit, and they’ll try to stop them at all turns. It’s up to you to use the Nibblers’ special powers to keep a steady supply of fruit flowing and elude those pesky lizards in this soggy saga!<br/><br/>-----------------------------<br/><br/>*** FROM THE CREATORS OF ANGRY BIRDS ***<br/>The masterminds behind Angry Birds have ingrained Nibblers with their brand of zany humor, a beautiful design style, and fun &amp; addictive gameplay!<br/><br/>*** MEET THE NIBBLERS ***<br/>Match four, five, or more fruit to call in Coral, Octo, and the rest of the Nibblers. These fish have some tricks up their sleeves. Use their special abilities to munch more fruit, topple the lizards, and take out obstacles. <br/><br/>*** FUN AND CASUAL ***<br/>Nibblers is super simple to learn! Just match three similar fruits and you’re nibbling! It’s easy to pick up and play, but with over 200 levels – and more to be added, there’s always a new challenge waiting!<br/><br/>*** OUT OF THE WAVES, INTO THE JUNGLE ***<br/>Embark on an island hopping adventure and navigate obstacles in a multitude of unique and puzzling levels – with new ones added all the time!<br/><br/>*** PLAY WITH FRIENDS ***<br/>Get social! Connect to Facebook and challenge your friends in the leaderboards, see their progress on the island map, and share special gifts! <br/><br/>*** NOT IN OUR BACKYARD ***<br/>Heaps of scaley baddies aim to crash your fruit party. Matching fruits next to a lizard is enough to send it packing, but you’ll have to get crafty to take care of tougher enemies – and boss battles will pit your fruit matching skills against the toughest of the lizardy ranks. <br/><br/><br/>-----------------------------<br/><br/>We have a COMMUNITY where fish are FRIENDS and not food, join now for the freshest news:<br/><br/>Follow: http://www.twitter.com/nibblersgame<br/><br/>Like: http://facebook.com/nibblersgame<br/><br/>Pin: http://pinterest.com/nibblersgame <br/><br/>-----------------------------<br/><br/>Having trouble? Send a message to our support team at support@rovio.com<br/><br/>-----------------------------<br/><br/>Nibblers is completely free to play, but there are optional in-app purchases available. Time to get your nibble on! <br/><br/>Terms of Use: http://www.rovio.com/eula<br/>Privacy Policy: http://www.rovio.com/privacy", "metacritic": null, "released": "2015-09-09", "tba": false, "updated": "2019-07-29T07:19:42", "background_image": "https://media.rawg.io/media/screenshots/4ea/4eacbbc098c5817242f53624a777b5b8.jpg", "website": "http://www.rovio.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 136, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Rovio Entertainment", "Rovio Entertainment Oyj"], "genres": ["Adventure", "Puzzle"], "publishers": ["Rovio Entertainment Oyj"], "esrb_rating": "Everyone 10+"}