{"id": 677565, "slug": "lugdunum-convenarum", "name": "Lugdunum Convenarum", "name_original": "Lugdunum Convenarum", "description": "We are the BrasKC team, and we're glad to present Lugdunum Conveniarum , a game created in a 48hours gameJam. We had an imposed theme which was \"The Roman Empire in our region (Occitanie,FRANCE). Moderators gave us \"St Bertrand de Comminges city\" as a starting point. \r\n\n<p><strong>We decided to honor this city and its History, to understand our approach, we have to take you back a long time ago... The city was created by Pompe, a general under Cesar in -70c BC. This city was a really good place to settle because it was easier to convert Gaulish people into Romania. Lugdunum Conveniarum was the name given to this city at the time, and the title of our video Game !</strong></p>\n<p><strong>We decided to create a really short game where it takes place 1c AC, where you embody a really dumb roman on his chariot : your aim is to catch Gaulish people to convert them to romania ! It's really important because the city is building its famous thermes, the problem is : you are really lazy, and you don't want to do the job, so you had this incredible idea: make Gaulish to do what you were supposed to do. But you have to be careful cause the ghost of Pompe is still haunting the city and to ensure everything goes smoothly. If he see</strong><strong>s you exploiting Gaulish people, he will be enraged and attack you ! </strong></p>\n<p><strong>We had to learn a lot on our own History and villages just next to us. We made a point of insisting on logical facts about the city (some of the monuments are reproduced nearly how they were), Romans Helmets, shape of the city and localizations of monuments are accurate. </strong></p>\n<p><strong>It was really instructive, and we are really thankful to this theme. There are two views in the game because we wanted to try two angles of view. The second is prettier ♥</strong></p>\n<p><strong>Enjoy !</strong></p>\n<p>-----------------------</p>\n\n\n<p><em>Our team was composed by :</em></p>\n<p><em>3 graphists : Xnaut, Nolwenn Armand and Nicolas Gouzin (DKor) </em></p>\n<p><em>3 programmer: Tinuviel, Bahagran, and Vixe. </em></p>", "metacritic": null, "released": "2021-10-10", "tba": false, "updated": "2021-10-11T04:41:05", "background_image": "https://media.rawg.io/media/screenshots/d46/d46d579d32c6856474ec45f85190134c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 89, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Xnaut"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}