{"id": 677549, "slug": "objetos-del-trasfondo-para-mausritter", "name": "Objetos del trasfondo para Mausritter", "name_original": "Objetos del trasfondo para Mausritter", "description": "<p><em>Mausritter, un juego de rol de espadas y bigotes</em> es un juego muy simpático y carismático en el que interpretas a los pequeños habitantes del reino ratón. Pero que esta fachada no te engañe; la vida como ratón puede ser muy dura. Como dice el juego: \"<em>Los dados son peligrosos. Juega para ganar, pero deléitate en el fracaso. Pelea sucio, corre, muere, hazte una ficha nueva</em>\".</p>\n<p>El sistema de creación de personajes es ágil y rápido, aunque hay que añadir un pero: ¡hay trasfondos que tienen objetos para los que no existe tarjeta en los recortables! Con lo maniático que nuestro compañero Luis es, esto no podía permitirse. Así manos a la obra. Un poco de dibujo por aquí, unas cuantas letras por allá... ¡y listo: objetos iniciales preparados!</p>\n<p>Con esta ayuda de juego la creación de personajes será un poco más rápida y podréis poneros antes a jugar.</p>\n<p>¡Sé un valiente habitante de los reinos ratón y usa estos objetos sabiamente! <br/></p>\n\n<p><em>\n</em></p>\n<p><em><em> <em>\"Objetos del trasfondo\" es una obra independiente creada por Luis  Gimeno para Los Pergaminos del Fénix y no está afiliada a Losing Games ni a El Refugio de Ryhope.  Se publica bajo la Licencia a Terceros de Mausritter. </em></em>Los derechos de Mausritter son propiedad de Losing Games y de El Refugio de Ryhope (para la edición en castellano)<em>. Las ilustraciones de este suplemento  están bajo licencia CC BY-NC-SA.</em></em></p>", "metacritic": null, "released": "2021-10-10", "tba": false, "updated": "2021-10-11T04:36:52", "background_image": "https://media.rawg.io/media/screenshots/d7d/d7dedcb3771d71f37293b3a31b1352fd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 27, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Los Pergaminos del Fénix"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}