{"id": 677585, "slug": "when-we-are-women", "name": "When We Are Women", "name_original": "When We Are Women", "description": "<p>This is a broad game about women's lives, based on the classic broad game, <em>The Game of Life</em>. In this game, you are a person with a woman's soul. Your soul defines your identity but not your assigned sex and your sexual orientation, which both will be decided by the dice as you play. You will face the challenges and problems of different women. Some of those challenges are difficult, and you are encouraged to ask for help from other players.</p>\n\n<strong>Game Starts!</strong>\n<p><strong>To play the game you need:</strong>\n</p>\n<p>This game needs at least 2 players and the playingcards.io room link above.\r\n</p>\n<p><strong>How to win</strong>\n</p>\n<p>Starting from the \"start\" sign, you move your piece forward and experience fun and problems in a woman's life. When everyone reaches the end, the player with the wealthiest player and the player with the highest hope win. If all players have hope &gt;30, you guys become one of <strong>the most hopeful feminist group!</strong>\n</p>\n<p><strong>How to play</strong>\n</p>\n<p><strong>Let the spin decide your assigned gender</strong>\n</p>\n<p>The first person who joins the room goes first. At the start position, roll the spin and let it decide your assigned gender. Move to the upper path as you get 1-3, and move to the lower path when getting 4-6. After you know which way to go, roll the spin again to see how far you will go.\r\n</p>\n<p><strong>Roll the dice and move forward</strong>\n</p>\n\n<p>You move forward that number shows on the spin.</p>\n<p>You need to stop at the hexagon the first time you reach or pass that fork. Roll the dice again to decide your sexual orientation. When you roll the dice to make choice, you will take the upper path as you get numbers 1-3, and take the lower path when you get 4-6.\r\n</p>\n<p><strong>Pull cards to see how the story goes</strong>\n</p>\n<p>After you stop on a square, pull one card from the deck that has the same color as your square. Show the card to other players and follow the instruction on your card. You might take money or hope chips beside the spin or put them back. Keep the card you pulled with the chips you left. You will use them after the last person reaches the end.\r\n</p>\n\n<p>Sometimes you will receive collaboration cards. Those cards can give you a large amount of money or hope for a return as long as you can find a player that fits the written requirements. You can't use the card if no player who is playing meets the requirement. Put the card back at the bottom of its deck if you can't use it.</p>\n<p>Stop for one term when you land on the squares below:\r\n</p>\n\n<p>You will stop for one term as you land on those signs. Take your time to find a celebrity who has the same identity as you in this game, and introduce her to other players before you start the next term and win hope+20 or money+10.</p>\n<p><strong>You turn has finished</strong>\n</p>\n<p>You have finished your turn. The next person on your will take your turn.\r\n</p>\n<p><strong>After everyone reaches the end</strong>\n</p>\n<p>Check how much hope and money you have left. Count how many cards you have in front of you. Add 1 hope for each card.\r\n</p>\n<p>The person with the highest hope and the person with the largest amount of money are two personal winners. If all players have hope higher than 30, you guys are the most hopeful group!\r\n</p>", "metacritic": null, "released": "2021-10-10", "tba": false, "updated": "2021-10-11T04:45:39", "background_image": "https://media.rawg.io/media/screenshots/c27/c27fefc9fa71d9bee08487e67d9d7d9e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 14, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["AnKK"], "genres": [], "publishers": [], "esrb_rating": null}