{"id": 677649, "slug": "cool-nondescript-space-game-with-a-funky-art-style", "name": "Cool Nondescript Space Game with a Funky Art Style that Hopefully Redeems the Recycled Gameplay Loop", "name_original": "Cool Nondescript Space Game with a Funky Art Style that Hopefully Redeems the Recycled Gameplay Loop", "description": "<p>## Inspiration</p>\n<p>One of my favorite pass times is playing retro video games. From Galaga to Dig Dug, I love it all. So, when I saw that the theme for this year's hackathon was retro throwback, I saw my opportunity. Asteroid is a definite classic due to its simple and appealing gameplay loop. Because of the simplicity of this style of gameplay, I knew that I could use this hackathon as an opportunity to tackle a project that is within my scope. </p>\n<p>## What it does</p>\n<p>My project is a digital game, allowing the user to play with whichever controls they see fit, supporting both gamepad and keyboard.</p>\n<p>## How we built it</p>\n<p>I built this software within the Unity engine. I used C# to code the individual scripts. Additionally, I used a microphone and online synth piano to record all of the audio for the game. Last, I used pencil and paper to create all of the graphics, from the spaceship to the text font.</p>\n<p>## Challenges we ran into</p>\n<p>One of the tricky parts of this project was getting the movement down. Because the spaceship is controlled relative to itself (rather than the screen), I had to do some vector mathematics to localize the direction. Additionally, getting pencil and paper graphics, alongside custom audio to work with Unity in a cohesive, satisfying way, proved to be challenging. </p>\n<p>## Accomplishments that we're proud of</p>\n<p>I'm very proud of my project management skills on this project. In past hackathons, I've had issues with scoping, often biting off too much to chew. This has led to me scrapping gameplay or story in the last few hours. Yet, this year I did an excellent job monitoring my progress and was able to readjust my scope and strategy as I went, ensuring that I was able to accomplish everything I needed to within the given time.</p>\n<p>## What we learned</p>\n<p>I learned that creating a game, including the code, graphics, and audio is very time intensive and requires careful planning to accomplish correctly. I also was able to become more familiar with Unity. As I clicked through tutorials for help, I found myself understanding more of what they said than in previous years. I'm extremely excited that game development is slowly feeling less like black magic and more like a tangible process.</p>\n<p>## What's next for Cool Nondescript Space Game with a Funky Art Style ...</p>\n<p>\"Cool Nondescript Space Game with a Funky Art Style that Hopefully Redeems the Recycled Gameplay Loop\" served as an excellent learning opportunity, allowing me to branch out from the tutorials available online to seek my own solutions and polish for game development. In the future, I will take the lessons learned from this build to help me establish the basics and empower me to explore more complex issues and gameplay.</p>", "metacritic": null, "released": "2021-10-10", "tba": false, "updated": "2021-10-11T05:02:25", "background_image": "https://media.rawg.io/media/screenshots/036/036b265390b19dd821dbbd3443834f59.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 6, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["kyleyoung1121"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}