{"id": 67788, "slug": "race-driving-school-car-racing-driver-license-test", "name": "Race Driving School Car Racing Driver License Test", "name_original": "Race Driving School Car Racing Driver License Test", "description": "Join your personal Driving Tutor at the Race Track today! Follow his advice to earn your license and get promoted to the Race Team as a Test Driver! Take control of 15 High Performance Cars and complete various Tests of Driving Skills and Advanced Car Control to earn your Racing License.<br/><br/>FOLLOW YOUR INSTRUCTOR<br/>Enter various Driving Test events such as Slaloms, Braking Tests, Racing Lines &amp; Apex Tuition, Drifting and Donuts! Learn the “Art of Race Driving’ through advice from the Virtual Tutor and put it all together on the Race Track to earn Medals and unlock faster cars! Can you beat the Tutor on the road?!<br/><br/>REALISTIC RACE TRACK<br/>Ultra HD Graphics and High-Resolution Track Modeling, including realistic corner curbs, pit garages and surfaces with varying grip levels. Learn and Master various different layouts of the main Race Circuit in increasingly powerful cars!<br/><br/>CAR COLLECTOR<br/>Featuring 15 Awesome Cars including Rear Wheel Drive, Front Wheel Drive and All Wheel Drive. Jump into Off-Road and Rally cars for a different driving experience including some mixed surface rally-cross stages with epic rally cars!<br/><br/>GAME FEATURES\t<br/>▶ Sit alongside your Virtual Driving Instructor<br/>▶ Learn how to handle High Performance Cars<br/>▶ Complete 60 Driving Tests to earn your new Racing License<br/>▶ Racing Lines, Apexes, Braking Points and Drift Control Lessons<br/>▶ Get behind the wheel of 15 Awesome Track Tuned Cars<br/>▶ Featuring Realistic Racing Circuit with Multiple Layouts<br/>▶ 100% Free-2-Play, No Strings Attached!<br/>▶ iCloud Support – continue your career on your other devices!<br/>▶ Customisable Control Methods (Tilt, Buttons, Steering Wheel)<br/>▶ Multiple Views (including Bonnet Cam) <br/>▶ Runs on anything from (or better than) the iPhone 4, iPad 2, iPad Mini &amp; iPod Touch (5th Generation)<br/><br/>OUR FREE TO PLAY PROMISE<br/>The Main Game Mode is 100% FREE to Play, all the way through, no strings attached! Extra Game Modes that alter the rules slightly to make the game easier are available through In-App Purchases.", "metacritic": null, "released": "2016-11-09", "tba": false, "updated": "2019-07-29T21:38:07", "background_image": "https://media.rawg.io/media/screenshots/8ad/8adf874dfab4af8f8d72e35f89304f80.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 109, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["BoomBit"], "genres": ["Sports", "Racing"], "publishers": ["BoomBit"], "esrb_rating": null}