{"id": 67793, "slug": "jurassic-dino-saur-online-sim-ulator", "name": "Jurassic Dino-saur Online Sim-ulator", "name_original": "Jurassic Dino-saur Online Sim-ulator", "description": "Jump into a virtual multiplayer world filled with many species of Jurassic era dinos. You can play online and hunt as epic dinosuars like the T-Rex, Spinosaur and Raptor! Can you become the strongest of the pack and survive in this simulator?<br/><br/>Huge 3D Worlds to Explore.<br/><br/>You begin your adventure on the ancient island, and you can progress to an arctic world and even a volcano world!<br/> <br/>Choose Your Breed<br/><br/>Play as dangerous carnivores like T-Rex, Raptor and the Spinosaur! You can also play as plant-eating herbivoes such as the Triceratops and Iguanadon. Many epic monster dinosaurs to choose from, even babies and rare animals like the Wooly Mammoth and Saber Tooth Tiger!<br/><br/>Hunt Together in Packs<br/><br/>Become the ultimate predator as you team up with your carnivore friends and hunt bigger dinos together. The bigger dinosaur you hunt, the more you can level up your dino! Battle it out and see who is the strongest in the park!<br/><br/>Form Alliances, Meet Friends &amp; Chat<br/><br/>Make friends with other players and chat to plan hunting and survival strategies!<br/><br/>Tons of Missions<br/><br/>Join an adventure to rescue dinosaurs as you hunt, search for food and shelter, and battle for survival.<br/><br/>Updates: Foxie Games are planning lots of stable updates to make the game even more fun.<br/><br/>Play for Free! You can play through the whole game without paying any real money! However, like all our games, Dino World Online is free to play, but it contains upgrades that can be purchased for real money.<br/><br/>Visit our official website at www.foxiegames.com", "metacritic": null, "released": "2017-01-27", "tba": false, "updated": "2019-07-29T11:18:23", "background_image": "https://media.rawg.io/media/screenshots/c5c/c5c12517ce4408584ce8069ae849f6c9.jpg", "website": "http://www.appforgegames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 180, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["AppForge"], "genres": ["Adventure", "Simulation"], "publishers": ["AppForge"], "esrb_rating": null}