{"id": 678023, "slug": "astral-drift", "name": "ASTRAL DRiFT", "name_original": "ASTRAL DRiFT", "description": "<p>The fuel tanks are empty and the engines have failed - all hope seems lost. But wait! Your spaceship's S.C.A.L.E device allows you to manipulate the mass and location of planetary bodies, allowing you to carefully construct and execute the perfect gravity slingshot in order to arrive gracefully at your destination. <br/></p>\n<p>ASTRAL DRiFT is a physics-based puzzle game that incentivizes both efficient and speedy solutions, catering to a variety of playstyles with its time and mass based challenges. Along the way, you'll experience a diverse set of mechanics and levels that are sure to tickle your puzzle bone. <br/></p>\n<p>In the meantime, you'll discover more about the vast galaxy around you with the help of your AI companion known affectionately as 'Bluey'. And maybe, just maybe, you'll uncover a conspiracy far grander than either of you could have imagined...<br/><br/></p>\n<p>ASTRAL DRiFT is qreated by a small and passionate team of 3 aussie teenagers - currently it's in a beta stage while we polish and adjust the game in line with community feedback. The game is story and feature complete but needs some refinement and polish before we're ready to launch a full release. Check out our fledgling discord at https://discord.gg/wJMWYemFUv for development updates. Lastly, thank YOU for checking out our game! Give yourself a virtual fist-bump from us :)<br/></p>", "metacritic": null, "released": "2021-10-09", "tba": false, "updated": "2021-10-11T06:36:37", "background_image": "https://media.rawg.io/media/screenshots/e2c/e2c59cd5394e12e4a83222c832c4c3f0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 43, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Quzx Qreations"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}