{"id": 67812, "slug": "words-with-friends-word-game", "name": "Words With Friends – Word Game", "name_original": "Words With Friends – Word Game", "description": "The World’s Most Popular Mobile Word Game now has even more ways to play! Try new rewards and boosts to help you play smarter and faster!<br/><br/>Words With Friends is the fun, free word game that lets you connect with friends and family while expanding your vocabulary and sharpening your wit. Test your brain power and spell your way to victory.  <br/><br/>May the Best Friend Win.™ <br/><br/>Game Features: <br/><br/>•\tWEEKLY CHALLENGE: Play the weekly challenge and earn fun, themed badges<br/>•\tSOLO PLAY: Play offline and sharpen your skills with solo play<br/>•\tHINDSIGHT: Uncover the best word you could have played after each turn <br/>•\tWORD RADAR: Heat map reveals all possible moves before you take a turn<br/>•\tPROFILE FRAMES: Show off your unique style with custom profile frames <br/>•\tSMART MATCH: Connect with players of a similar skill with Smart Match<br/>•\t6 LANGUAGES: Choose to play in Spanish, French, German, Italian, Brazilian Portuguese and British English<br/><br/>*Play Words With Friends without third party ads between moves if you previously purchased Words With Friends Pro on iOS or any other mobile device. Be sure to login with Facebook or the email account you used to make the previous purchase to continue to play without third party ads between moves.<br/><br/>Already an accomplished Wordie? Like us on Facebook or follow us on Twitter to stay up-to-date on game news, contests, polls and more.<br/><br/>https://www.facebook.com/WordsWithFriends<br/>https://twitter.com/WordsWFriends  <br/>https://instagram.com/wordswithfriends <br/><br/>We love hearing from you! Have a question or a suggestion? <br/>Ask questions here: http://zynga.tm/d01Tx  <br/>Share suggestions here: http://zynga.tm/r02dY <br/><br/>Thank you for playing Words With Friends!<br/><br/>Additional Information:<br/>The game is free to play; however, in-app purchases are available for additional content and in-game currency. In-app purchases range from $0.99 to $99.99 USD.", "metacritic": null, "released": "2014-10-09", "tba": false, "updated": "2019-07-29T12:17:29", "background_image": "https://media.rawg.io/media/screenshots/0b9/0b9754ed9f0f2c32e46ee31279aabedb.jpg", "website": "https://zynga.com/games/words-friends", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1, "dropped": 1, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 106, "game_series_count": 0, "reviews_count": 2, "platforms": ["iOS"], "developers": ["Zynga"], "genres": ["Board Games", "Puzzle"], "publishers": ["Zynga Mobile"], "esrb_rating": "Everyone 10+"}