{"id": 67813, "slug": "epic-paint-adventure-color-matching-combo-quest", "name": "Epic Paint Adventure - Color Matching Combo Quest", "name_original": "Epic Paint Adventure - Color Matching Combo Quest", "description": "Epic Paint Adventure is a fun new twist on match three puzzle games!<br/><br/>As you solve a series of match three puzzles, you’ll be helping famous artists paint their next masterpiece! These famous artists need you to solve puzzles by matching colored dots so that they’ll have the paint they need to perfect their artistic craft. Epic Paint Adventure takes you on a quest to help gather the paint colors the artists need to create their masterpiece!<br/><br/>Your goal is to strategically connect colored paint dots together in groups of four, making them pop and freeing up space on the board. Take your time and think carefully before moving each paint bubble; you have a limited number of moves and every move you make adds additional paint dots to the playing field. But be careful! If the board gets full of paint dots you’ll be boxed in and run out of possible moves.<br/><br/>Key Features:<br/><br/>- 72 challenging puzzles and levels to solve in this fun RPG!<br/>- 14 locations and famous artists to unlock including Leonardo da Vinci, Frida Kahlo, Vincent Van Gogh and more!<br/>- 14 paintings to complete, help these artists hone their craft!<br/>- Complete games to learn fun facts about each artist!<br/>- No need to blitz your way through! Play games at your own pace, no annoying time limits!<br/>- Fun and quirky cartoon graphics!<br/>- Life upgrades can be bought to make gaming easier!<br/>- Guaranteed fun for both kids and adults!<br/><br/>Embark on a colorful and fun-filled quest of color matching and puzzle solving with Epic Paint Adventure! This isn’t like other jewel match, bubble bobble pop puzzle games; this game will take you on a lively art adventure! Great for kids of any age, this game requires planning and strategy to move from level to level. And with no time limits, you don’t need to blitz your way through the game recklessly! Take your time and solve all puzzles at your own speed!<br/><br/>In Epic Paint Adventure, you’ll bounce between 72 different challenging puzzles and globe trot through different world regions. As you unlock all the famous painters from Leonardo Da Vinci to Fernando Amorsolo, you’ll hone your artistic skills in this puzzle rpg! Help each famous artist hone their craft and learn facts about their life’s work! This fun new twist on RPG and puzzle games will have you addicted and playing for hours!<br/><br/>Create a masterpiece and download Epic Paint Adventure now--it's totally FREE!<br/><br/>PLEASE NOTE: Epic Paint Adventure is completely FREE-TO-PLAY but some game items can also be purchased using real money. If you don't want to use this feature, please disable in-app purchases from your device settings. Epic Paint Adventure DOES NOT require an internet connection to play.<br/><br/>Website: http://www.kuyimobile.com/<br/><br/>Support and Feedback: http://www.kuyimobile.com/support.php<br/><br/>Twitter: @kuyimobile<br/><br/>Facebook: http://facebook.kuyimobile.com/", "metacritic": null, "released": "2014-03-20", "tba": false, "updated": "2019-07-29T11:21:43", "background_image": "https://media.rawg.io/media/screenshots/c25/c25f0b2f4ac3b363574914da52fa0d9c.jpg", "website": "http://www.appforgegames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 124, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["AppForge"], "genres": ["Strategy", "Puzzle"], "publishers": ["AppForge"], "esrb_rating": null}