{"id": 6781, "slug": "tons-of-bullets-super-2d-action-adventure-game", "name": "Tons of Bullets! Super 2D Action Adventure Game", "name_original": "Tons of Bullets! Super 2D Action Adventure Game", "description": "Tons of Bullets **Top #10 Hot Games Touch Arcade**<br/>A super retro 2D pixel platformer adventure infused with tons of bullets and tons of features!<br/>Fight as Kenji the Ninja and embark on his adventure to save his girlfriend who is kidnapped by his nemesis, Dr. Mad. Jump! Shoot! Swim! Do whatever it takes to save his loved one in this action packed 2D pixel platformer game!<br/><br/>Chase Dr. Mad and his henchmen through various obstacles and environment such as Snow field, Lava and submerged caves. Uncover secret rooms to obtain new weapon arsenal to use them against Dr. Mad’s creatures such as the killer Penguins. <br/><br/>Beware Dr. Mad's bots and guns as they will shoot anyone in sights. If you can't destroy them, hide in the shadow and become invisible. <br/><br/>If you are a fan of 2D retro action platformer games, Tons of Bullets is one game that you should not miss!<br/><br/>=== FEATURES ===<br/>o Action platformer game at its finest; shoot, teleport, swing, double jump, jetpacking, carry, push and more!<br/>o Stealth mode mechanics, Ninja style<br/>o Eye Candy Pixel Art graphics<br/>o Rideable vehicles to help you get through the adventure<br/>o Various different weapons with its inventory system<br/>o Scripted cut scenes<br/>o Night Vision mode<br/>o Destructible objects<br/>o Huge bosses!<br/>o Great touch control<br/>o Gamepad support (MFI and iCade for iOS official gamepads)<br/>o Multi lingual support – final list of language supported will be provided nearing to launch day!<br/>... and much more!<br/><br/>Check out our pages below for more information, updates and announcement about Tons of Bullets!<br/><br/>Official Page: http://playplayfun.com/tons-of-bullets-game-official-page/<br/>Facebook Page: https://www.facebook.com/2dpixel/\"", "metacritic": null, "released": "2016-09-21", "tba": false, "updated": "2019-07-30T07:55:11", "background_image": "https://media.rawg.io/media/screenshots/15d/15d0c81bcfdc8a98d1ba15c34f3d49af.jpeg", "website": "http://playplayfun.com/tons-of-bullets-game-official-page/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 93, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["FredBear Games"], "genres": ["Action", "Arcade", "Casual"], "publishers": ["FredBear Games"], "esrb_rating": null}