{"id": 678303, "slug": "ebb-and-feel", "name": "Ebb and Feel", "name_original": "Ebb and Feel", "description": "<p>Play how you want, challenge yourself - just experience <em>something unique</em>.<br/></p>\n<p>Arrow keys to move (or WASD). Shift key to use items you’ve picked up.\r\n</p>\n<p>Hint: take a careful note of the stone of stability in the bottom right corner of your screen. Watch the world around you as it changes…\r\n</p>\n<p>Good luck.<br/>\n</p>\n<p><strong>Notes and known issues:</strong></p>\n<ul><li>The game is currently in post-jam development (completing some of the missing elements to perfect the game how it was intended and major bug fixes only). This is the first game for which I have done this due to how important this is to me for this particular submission.\r\n</li><li>The animations do not always match up to the key presses accurately (they’re close, but not perfect). I have a fix for this but in the spirit of LD I will keep it on a developmental branch. Check back in a few days to play the dev branch version how the game was intended :)<br/>\n</li><li>The story kind of…falls off. This is because one entity is missing from the code which will also be added to the dev branch.\r\n</li><li>Some images don’t perfectly line up with the platforms they sit on and some platforms can be fallen off too easily. This will be fixed on the live version and are virtually not-noticeable unless you’re the artist that drew them… :)\r\n</li><li>A speed up to the character movement will be added to make motion a bit smoother, based on one of the game mechanics… but for now, this is the speed the game was written and intended at.\r\n</li><li>Credits button doesn’t show our team credits in-game.\r\n</li><li>The end screen could do with some information + a replay/end game visual…\r\n</li></ul>", "metacritic": null, "released": "2021-10-08", "tba": false, "updated": "2021-10-11T07:47:14", "background_image": "https://media.rawg.io/media/screenshots/e23/e23feb9fead162754d1e3463b9f5d073.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 60, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Baconeta"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}