{"id": 67832, "slug": "bid-whist-plus", "name": "Bid Whist Plus", "name_original": "Bid Whist Plus", "description": "Let’s join the LARGEST BID WHIST COMMUNITY in the world to play with thousands of online players!<br/><br/>Bid Whist Plus offers you a great experience against many Bid Whist players from all around the world!  You can play in many different game modes such as Classic, Solo, or Whist. <br/><br/>Bid Whist is one of the traditional trick-taking card games played in pairs like Spades, but in this game players determine the Trump suit by bidding higher than others. <br/><br/>==BID WHIST PLUS FEATURES==<br/><br/>● FREE COINS<br/>Get 20,000 Free Coins as a “Welcome Bonus”, and get even more coins by collecting your “Daily Bonus” every day!<br/><br/>● DIFFERENT MODES<br/>Play Bid Whist however you want!<br/><br/>CLASSIC: Make your bid with your partner and challenge other teams  <br/>VIP:  Play the classic Bid Whist in custom Tables.<br/>SOLO:  There is no partnership.  Each player gets his/her own points.<br/>WHIST:  No one bids in Whist tables! Trump suit changes automatically in each round. <br/><br/>● GREAT SOCIAL EXPERIENCE<br/>Meet new people and add them as friends to be their best partner or challenge them in games!<br/>Use Public or Private Chat to stay in touch with other players.<br/><br/>● CREATE YOUR OWN TABLES<br/>You can create tables in different modes.  Choose your “Game Rule” type, set the “Bet Amount” and the “Final Point” or decide if there will be “Faster Play” or “Chat” options.  If you don’t want to be found, create your own “Private Table” where games are “Invite Only”.<br/><br/><br/>Additional information:<br/><br/>* Make sure you have a good internet connection to get the best experience. <br/>* The game is free to play; however, in-app purchases are available for additional content and in-game currency. In-app purchases range from $0.99 to $99.99 USD.<br/>* Use of this application is governed by Zynga’s Terms of Service, found at www.zynga.com/legal/terms-of-service. <br/><br/><br/>", "metacritic": null, "released": "2017-01-10", "tba": false, "updated": "2019-07-29T12:19:06", "background_image": "https://media.rawg.io/media/screenshots/bcf/bcfc68beda98d1f28265763a3ba12f82.jpg", "website": "https://www.zynga.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 124, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["Zynga"], "genres": ["Board Games", "Card"], "publishers": ["Zynga"], "esrb_rating": "Teen"}