{"id": 678373, "slug": "last-genesis-itch", "name": "Last Genesis (itch)", "name_original": "Last Genesis (itch)", "description": "<p>Welcome to the continent of Atlia! Even though it had been consumed by war and chaos for centuries, it has now entered a new golden age thanks to the Atlian Union, a cosmopolitan organization created to unite the nations and maintain peace. This peace is perfect for Johann Kestler, a young man living far out in the country, but after his father goes missing, he's forced to travel across all of Atlia and uncover the truth for himself. Along the way, he meets Jack Fleming, a student framed for the murder of his headmaster, and Jean Versailles, a mysterious traveler who had been arrested by the Atlian Union. Together, they uncover a conspiracy that leaves not only Atlia, but the entire world at stake.<br/></p>\n<p><em>Last Genesis</em> is a classic styled turn-based RPG that wouldn't feel out of place on the GBA. Bringing a fair challenge, the turn-based combat won't leave you mindlessly button mashing and contemplating suicide the majority of the time. With over 10 hours of content, my sister considers it \"too long.\" Many small choices throughout the game can alter gameplay and story leaving room for replayability and actual roleplay. And it all culminates in an epic finale with six different endings! What are you waiting for? Buy it October 8th! Or were you planning on buying 20 gumballs instead or something?</p>\n<p>Join the Discord! https://discord.gg/4PtJQmUV6r</p>", "metacritic": null, "released": "2021-09-18", "tba": false, "updated": "2021-10-11T08:11:00", "background_image": "https://media.rawg.io/media/screenshots/7dc/7dc23e4d6ec2b2a73e4cd1dbf8c25ae4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 87, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["RenoGTYoung"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}