{"id": 67839, "slug": "angry-birds-pop", "name": "Angry Birds POP!", "name_original": "Angry Birds POP!", "description": "Bird Island is overflowing with bubbles, and it’s up to you to pop them all! Help your favorite Angry Birds characters burst bubbles, and solve tricky puzzles in a simply delightful bubble shooter. There are plenty of cute animals and extra-cute Hatchlings that need saving, and plenty of piggies that need defeating as well – so grab your trusty slingshot and settle in for some bubble-popping fun!<br/><br/>Angry Birds POP is simple and easy to play, just pull back the slingshot, aim and shoot. Match 3 bubbles of the same color to pop them, and repeat! It’s easy at first, but you’ll need to be a star bubble shooter to complete the toughest challenges. Just aim, shoot, and pop through loads of fun puzzles! Dynamic controls allow you to tap, slingshot, or point and shoot to take on challenges your way, and vibrant graphics and animations make every level a treat!<br/><br/>FEATURES:<br/>– Over 3000 levels! New levels added every week.<br/>– Tons of bubble popping puzzles to solve, from simple to difficult.<br/>– Easy to pick up and play anytime!<br/>– Shoot matching bubbles to pop them.<br/>– Bounce bubbles to pull off precise bank shots.<br/>– Earn high scores and 3 stars in every level!<br/>– Figure out the best way to solve every level – tap into your creativity!<br/>– Intuitive controls – tap, slingshot, or point to shoot with precision.<br/>– Play fun, limited-time events for the best rewards.<br/>– Save cute animals and take on a variety of game modes!<br/>– Defeat enemies with the slingshot – those piggies have met their match!<br/>– Fun and colorful graphics and animations.<br/>– Challenge your friends for the best scores and most stars.<br/>– Simple bubble-popping fun for adults and kids alike! Or adults who want to be kids. Also kids who want to be adults. It’s basically fun for everyone!<br/><br/><br/>-----------------------------<br/><br/>Need some help? Visit our support pages, or send a message to the stars on our support team! https://support.rovio.com/<br/>Like us on Facebook: https://www.facebook.com/angrybirdspop/<br/><br/>-----------------------------<br/><br/>Angry Birds Pop! - Bubble Shooter is completely free to play, but there are optional in-app purchases available. Either way, it’s tons of fun!<br/><br/>Terms of Use: https://www.rovio.com/terms-of-service<br/>Privacy Policy: https://www.rovio.com/privacy", "metacritic": null, "released": "2015-03-12", "tba": false, "updated": "2023-02-09T02:30:08", "background_image": "https://media.rawg.io/media/screenshots/26c/26cc5407cb9b2c1b3cb5c1ebc3823da0.jpg", "website": "http://www.rovio.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 117, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Rovio Entertainment Oyj"], "genres": ["Arcade", "Casual", "Puzzle"], "publishers": ["Rovio Entertainment Oyj"], "esrb_rating": null}