{"id": 67845, "slug": "plumber-reloaded", "name": "Plumber Reloaded", "name_original": "Plumber Reloaded", "description": "Plumber Reloaded a simple, fun, addicting fast thinking puzzle logic game at it's best.<br/>As a Plumber you have to connect color pipes so the fluids can flow without crossing paths. Plumber Reloaded is a game of logic, fast thinking and perception. Goal of game is to connect every two elements of the same color with pipes, so the water can flow. No problem, right? Well, the problem is, that pipes you draw cannot cross each other, you are limited to grid and moreover you have time running fast. So act quick, or you'll loose all lives and soon the game will be over ;)<br/>If you draw the wrong pipe, just tap on base element of that pipe. Or shake the phone to reset the level completely.<br/>Unlike all the existing Plumber games it’s not based on turning of the pipes, rather on joining them together. Currently game has little over 260 levels (puzzles) in 5 different difficulties, each with own graphics theme. Sounds that add to the positive experience and motivate user to play more and more. There are 3 game modes – standard 3 stars mode in which you can beat levels one after another, time attack mode with 3 different types – sprint, summer run and marathon – each takes different amount of random levels from each difficulty to solve. Third game mode is training where you can practice your skills. The game provides hours of good fun. The game is also called Arukone in some countries.<br/>Global leaderboards!<br/>Like Plumber Reloaded on Facebook: http://www.facebook.com/PlumberReloaded<br/>If you'd like to translate this game, just send me an email from the game's About screen...", "metacritic": null, "released": "2014-01-25", "tba": false, "updated": "2019-07-29T11:23:16", "background_image": "https://media.rawg.io/media/screenshots/237/237d2564aded7442d4c3165de345a0e3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 150, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["AppForge"], "genres": ["Arcade", "Casual", "Puzzle"], "publishers": ["AppForge"], "esrb_rating": null}