{"id": 678562, "slug": "soundodger-2-2", "name": "Soundodger 2", "name_original": "Soundodger 2", "description": "<h3>Dodge The Music</h3><strong>Soundodger 2</strong> is an experimental dodge-em-up music game that turns every song into a choreographed dance of bullets, lasers, and challenges to weave through in order to survive. The sequel to 2013's award-winning Soundodger+, <strong>Soundodger 2</strong> is bigger, better, and dodgier than ever before. With an all-new selection of songs from international musicians and a fully-featured level editor to use your own music, you'll never run out of things to dodge.<br/><br/><h3>Key Features</h3><ul><li><strong>Rebuilt from the ground up</strong> to allow for amazing visuals, dense patterns, and buttery-smooth framerates<br/></li><li>A <strong>brand-new soundtrack</strong> from thumping beats to beautiful serenades - all from an incredible group of award-winning musicians<br/></li><li><strong>Challenge Modes</strong> ask you to step up your game and perform under intense scenarios - balancing mirror images of yourself, guiding a trail of followers, dodging arena-filling giant bullets, and much more<br/></li><li>Jump into the improved <strong>Level Editor</strong>, where new workflow options make it even easier and faster to craft the level of your dreams<br/></li><li>Multiple <strong>difficulty levels</strong> for each song allow you to progress through the game at a pace that's most enjoyable for you<br/></li><li><strong>Legacy support</strong> for older Soundodger+ levels gives you access to hundreds of classic levels made by the community over the years<br/></li><li>Choose between mouse, keyboard, or a controller to find the playstyle that suits you best</li></ul><br/>", "metacritic": null, "released": "2021-10-11", "tba": false, "updated": "2021-10-15T02:36:23", "background_image": "https://media.rawg.io/media/screenshots/1b0/1b060e3ee16922f1ce709add7dd3a00d.jpg", "website": "https://soundodger.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 5, "toplay": 1}, "playtime": 44, "achievements_count": 27, "ratings_count": 0, "suggestions_count": 186, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Studio Bean"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Studio Bean"], "esrb_rating": null}