{"id": 678598, "slug": "ghostcast", "name": "GhostCast", "name_original": "GhostCast", "description": "This Multiplayer First Person Shooter game is Fast paced, you will die but won't be dead, you will be a ghost but you can be human again.<br/>\r\nIf you die and to be a ghost, you will respawn outside the rooms, and you can pass through the room-walls to attack humans, If you succeed in killing a person, you can be reborn. But you have no weapons, so be fast to attack or hide. <br/>\r\nOf course, if you are still alive, be careful of the ghost behind you and try to save your own life.<br/>\r\nThough it is a FPS game, shooting is not all, so you may not have good shooting skills, but as long as you can move, you can also use the advantages of ghosts to get achievements.<br/>\n<br/>\r\nFeatures:<br/>\r\n1. Fast paced and exicting. <br/>\r\n    If you are a human, you almost have no time to rest and have to keep moving and shooting and surviving.If you are a ghost and want to revive, You need to seize <br/>\r\n    the time to attack humans.<br/>\r\n2. Support Single-Player and Multi-Player Mode. <br/>\r\n    you can play with AI or with your friends or with other players.<br/>\r\n3. The mechanism is interesting.<br/>\r\n    If you are a ghost, you can hide and attack people, and you need to compete with other ghosts to be a human again, of course if you don't want to revive, <br/>\r\n    you can choose to remain a ghost, just make the people to be a ghost.<br/>\r\n4. Intesting Items or Skills. <br/>\r\n    Whether you are human or ghost, you can get special skills by picking up specific items to help you survive or compete.<br/>\r\n5. More combat modes.<br/>\r\n    According to the mechanisms, there will be a variety of different combat modes. For example, DeathMatch or Team Deathmatch or Survival mode and etc.<br/>\r\n6. Cartoon style graphics.", "metacritic": null, "released": null, "tba": false, "updated": "2021-10-15T03:07:09", "background_image": "https://media.rawg.io/media/screenshots/8ce/8ce073d2303f62c2ed69929b49a336c3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 186, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["7OfUs"], "genres": ["Action", "Casual", "Indie"], "publishers": ["7OfUs"], "esrb_rating": null}