{"id": 678561, "slug": "orpiment", "name": "Orpiment", "name_original": "Orpiment", "description": "Choose your knight, earn him the most beautiful and powerful equipment, but above all, surround yourself with the best supporters to encourage you during your fights! In Orpiment you don't play the knight but the members of the audience who all have their own skills. <br/>You don't control your knight during the fights but you can intervene at any time by using the special abilities of your audience members. Throw a roast chicken, drop your panthers on the field or steal your opponent's shield to tip the balance in your favor! <br/>In this rogue-like game where the heroes are the shadowy characters, bring your knight into the story by using the best audience member combo possible.<br/><br/><br/><br/>Recruit new audience members through victories<br/>Get new equipment to replace those destroyed in battle.<br/>Repair your shields and armor at the blacksmith's, upgrade your supporters at the inns, and buy rare equipment from the merchants.<br/><br/><br/><br/>Progress through your adventure via a procedurally generated map, choose your path amongst the various pitfalls that make up the map, surround yourself with the best supporters and equip yourself with the most powerful equipment to face the Golden Demon and his 4 demonic knights.<h3>Features:</h3><ul><li>4 knights with different characteristics<br/></li><li>Around 20 different audience members<br/></li><li>Over 60 special abilities<br/></li><li>Almost infinite team compositions<br/></li><li>Over 80 different weapons!<br/></li><li>Over 40 different shields!<br/></li><li>More than 40 different battle armors!</li></ul>", "metacritic": null, "released": "2021-10-11", "tba": false, "updated": "2021-10-15T02:35:41", "background_image": "https://media.rawg.io/media/screenshots/60b/60bc5b447b2834ad0b02663e15008882.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 378, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Yobiké"], "genres": ["Strategy"], "publishers": ["Yobiké"], "esrb_rating": null}