{"id": 678573, "slug": "xplorasi3d", "name": "XPLORASI3D", "name_original": "XPLORASI3D", "description": "Xplorasi3D is a Digital Game-based Learning (DGBL) recommended for teachers and students to teach/learn about basic science knowledge. The player collects stars and diamonds to get Score points and Blue Cube to earn Knowledge points and trigger Learning Information in the form of infographics. At the end of the game (level), the player collects Red Cube and then triggers to Quiz Section. <br/><br/>At the end of the game, students can understand:<br/>- What is science?<br/>- Laboratory Rules and Regulations.<br/>- Measurement<br/>- Scientific investigations<br/>- Pollutions<br/>- Earth Systems<br/><br/>LESSON PLAN (SUGGESTION)<br/><br/>During Online Class<br/>The teacher can use the Xplorasi3D during the online class as an interactive activity with students. The teacher plays the game and explains the contents of the learning material to students. Students can take turns to answer the quizzes. <br/><br/>During Class Lesson<br/>The students can use joystick during the lesson in the class. The teacher can prepare suitable activities together with students.<br/><br/>DETAILS<br/><br/>Xplorasi3D consists of 5 Levels of the game, which can be selected from the Main Menu. When the player completes the level, the next level is unlocked. The player also can go to the quiz section using QUIZ MENU separately.<br/><br/><br/><br/>The player moves to collect Stars, Diamond and Cubes. The player plays to collect Stars and Diamonds to get Score points.<br/><br/><br/><br/>Collect Blue Cube triggers to learning information (Knowledge).<br/><br/><br/><br/>At the end of the game, the player collects Red Cube to Unlocked Next Level and go to Quiz Section.<br/><br/><br/><br/>The overall scores and points will be displayed on the scoreboard once you have completed answering the quizzes. Hit Retry to repeat the questions.<br/><br/>", "metacritic": null, "released": null, "tba": false, "updated": "2021-10-15T02:43:27", "background_image": "https://media.rawg.io/media/screenshots/162/162452237488f4d0f7fc7f83080f25e5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 176, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Syahir Bahiran Hilmi"], "genres": ["Adventure"], "publishers": ["MULTIPDPKIT"], "esrb_rating": null}