{"id": 678664, "slug": "the-sundew", "name": "The Sundew", "name_original": "The Sundew", "description": "Shibukawa, capital of Japan, 2054. Water drips from the cracked ceiling onto the edge of your bed as the incessant rain masks the whine of a refrigerator and the neon hum of the city outside. You don’t recognise the heavy breath in your ear nor the warmth of the body lying next to you... <br/><br/>The world’s gone to hell, and it’s taking you down with it. <br/><br/><br/><br/>Welcome to Shibukawa. You are Anna Isobe, a cybernetically enhanced cop in a world that’s left you behind. Once a shining hope for the future, cyborgs have become taboo, replaced by drones and automata that make even your heightened abilities obsolete. Stuck in a thankless job surrounded by indifferent eyes you still have a duty to protect and serve, and that’s just what you’re going to do.<br/><br/>The Sundew is a dark adventure game set in the aftermath of a devastating future war, where the world as we know it was twisted by flames into a terrifying new dystopia. What begins as a normal day quickly becomes something else, and soon a lonely beat cop will hold the fate of the world in her hands.<br/><br/><br/><br/>The Sundew pays homage to classic adventure games of old while reflecting contemporary issues and gameplay. Beautifully drawn pixel-art and stunning sound design brings this dark future to life and grounds you in a vision of humanity’s progress that is both alien and strangely familiar...<br/><br/><br/><br/>Japan lies in ruins, save for the bustling haven of Shibukawa. Guide Anna through this new megalopolis and beyond in her search for the mystery behind a growing conspiracy. Travel from the backstreets of the city to far-flung isles, and the most notorious prison this side of the Steppe.<br/><br/><br/><br/>Alongside classic point-and-click gameplay The Sundew will ask you to make decisions that will change the future of humanity. Playing off contemporary issues, the choices offered are never black and white. Where do you believe mankind’s interests lie, and what means are acceptable to achieve them?<br/><br/><strong>Features</strong><br/><br/><ul><li>Guide Anna Isobe, a cyborg cop with a dark past, through the unravelling of a global conspiracy.<br/></li><li>Experience a diverse cast of characters, each with their own secrets and history.<br/></li><li>Explore Shibukawa and the remnants of the old world.<br/></li><li>Make decisions that will change the fate of humanity, for better or worse.</li></ul>", "metacritic": null, "released": "2021-10-14", "tba": false, "updated": "2023-10-18T19:30:40", "background_image": "https://media.rawg.io/media/screenshots/e2f/e2fc0c19c96f2c3713aea132ec2b2e0a.jpg", "website": "https://www.2054games.net", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 8, "beaten": 1, "toplay": 3, "dropped": 2}, "playtime": 1, "achievements_count": 22, "ratings_count": 3, "suggestions_count": 391, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC", "Linux"], "developers": ["2054"], "genres": ["Adventure"], "publishers": ["2054"], "esrb_rating": null}