{"id": 678660, "slug": "the-darkest-tales-into-the-nightmare", "name": "The Darkest Tales — Into the Nightmare", "name_original": "The Darkest Tales — Into the Nightmare", "description": "Join a stuffed bear named Teddy and his magical fairy sidekick Lighty on a high-stakes journey through a nightmarish realm of sinister dreams and distorted childhood fairytales to rescue Alicia — Teddy’s now grown-up owner. Who else will fight for the life of the girl, if not her once most loved toy?<br/><br/><strong>The Darkest Tales — Into the Nightmare</strong> is a free-to-play prologue, bringing players into the first two chapters of Teddy and Lighty’s journey across this familiar yet twisted world. Are you ready to leave your dusty old toy box and finally take on a real challenge? Do you have what it takes to hack, slash, and dash your way through hostile lands crawling with deadly traps and bloodthirsty monsters? If yes, then turn the page and immerse yourself in <strong>The Darkest Tales</strong>.<br/><br/><br/><strong>Happily Never After</strong><br/>Meet familiar characters from childhood bedtime stories, but don’t expect any hugs and kisses. The wolves are out for blood, the great beanstalk is crawling with bugs and carnivorous plants, and Little Red Riding Hood… well, she may just slice you up in two.<br/><br/><br/><strong>Teddy Scissorpaws</strong><br/>Don’t let looks fool you — Teddy may be soft, but with Lighty by his side, our heroes make for a formidable duo. Turn old scissors into magic-powered swords, needles into powerful arrows and grappling hooks, but use your mana wisely, so you don’t lose your stitches. Remember, all is fair in the race to rescue Alicia.<br/><br/><br/><strong>Ahead Lies Only Darkness</strong><br/>Each chapter takes place in a recognizable yet distorted fairytale world rife with combat, obstacles, and secrets. Put your skills to the test against tough opponents and bring back hope to dreamlands now engulfed by the forces of evil. Gain experience, master and branch out your skill tree, and reach the depths of the nightmare to come out victorious.<br/><br/><br/><strong>The Darkest Tales</strong> is a game with deep and mysterious lore. As you progress through each page of this story, you’ll begin to unveil the secrets behind this nightmarish world. How will this tale end? It will be up to you to decide.<br/> <br/>Progress saved in the free version will be automatically carried over into the full version of <strong>The Darkest Tales</strong>.", "metacritic": null, "released": "2021-10-13", "tba": false, "updated": "2024-04-17T20:29:49", "background_image": "https://media.rawg.io/media/screenshots/e3a/e3a6291e3bebe2c39da28b4c3e56a045.jpg", "website": "https://store.101xp.com/en/games/thedarkesttales/", "rating": 2.85, "rating_top": 4, "added_by_status": {"yet": 35, "owned": 487, "beaten": 5, "toplay": 27, "dropped": 6, "playing": 1}, "playtime": 1, "achievements_count": 82, "ratings_count": 13, "suggestions_count": 811, "game_series_count": 0, "reviews_count": 13, "platforms": ["PC", "Nintendo Switch"], "developers": ["Trinity Team"], "genres": ["Action", "Adventure"], "publishers": ["101XP"], "esrb_rating": null}