{"id": 678678, "slug": "ark-mobius-censored-edition", "name": "Ark Mobius: Censored Edition", "name_original": "Ark Mobius: Censored Edition", "description": "<h3>Censored Edition removes some content that is not suitable for users of all ages from Ark Mobius. Therefore, Censored Edition does not has the \"adults only\" label, which can be searched by users in more regions.</h3><h3>Game Intro</h3>Ark Mobius is a gal-game that contains beautiful girl and rhythm.<br/>In 2320, black goat, a huge humanoid monster with tentacles suddenly appeared on the earth. She fell into madness and made human beings attack each other through mind control. Only magical power could damage her. However, due to excessive industrial development and pollution, there is not much magical power left on the earth. Therefore, as the container, you need to travel to other worlds to obtain power against the monster from various beautiful girls and save the human being.<h3>Rhythm Game</h3>Ark Mobius contains easy yet fun rhythm elements. You can finish them by mouse. It also has various traditional 2d side-scroll scenes, diverse enemies and beats. (headphones are strongly recommended)<br/>We also provide a \"Lock HP\" function for players who are not very good at rhythm games, it can be check at \"Option\" panel.<br/><br/><br/>If you are interested in Ark Mobius, you can add the game to the wishlist. This will be very helpful to us. Thank you very much~", "metacritic": null, "released": "2021-10-14", "tba": false, "updated": "2021-10-15T04:10:45", "background_image": "https://media.rawg.io/media/screenshots/710/7102286d5c8216151d629f453bbcac04.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 6}, "playtime": 2, "achievements_count": 37, "ratings_count": 0, "suggestions_count": 415, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["YellowDuckWorks"], "genres": ["Action", "Adventure", "RPG", "Casual", "Indie"], "publishers": ["YellowDuckWorks"], "esrb_rating": null}