{"id": 678699, "slug": "circuit-superstars-top-gear-time-attack", "name": "Circuit Superstars - Top Gear Time Attack", "name_original": "Circuit Superstars - Top Gear Time Attack", "description": "CIRCUIT SUPERSTARS is a top-down racer built by racing fans, for racing fans. The game celebrates generations of multi-disciplinary motorsport, focusing on driving that feels great – but with a high skill ceiling, that will have players spending hours honing their perfect lap. Starting out is simple but learning the nuances of each car’s handling and finding the best racing line through each corner of each track will be a challenge for a long time to come. Not only that, but with the option of fuel usage, tire degradation and racing damage, even a good pit stop strategy could make the difference between hero and zero.<br/><br/>In Circuit Superstars players will be transported to the Top Gear Test Track, where they can try to beat top-tier motorsport, esports and YouTube stars on Circuit Superstars’ version of the world-famous circuit from the legendary BBC TV show.<br/><br/>Feel the rubber bite into the road as you pass the start/finish line and dive, brakes squealing, into the first corner!<br/><br/>FEATURES<br/><br/>Feel the tires meet the road\r\nTactile handling model that lets you feel the tires bite into the asphalt.<br/><br/>Celebrating Motorsport\r\nRace vehicles across multiple motorport disciplines including Rallycross, Open wheel single seaters, SuperTrucks, GT racing, Eurotrucks and many more.<br/><br/>Pit Stop Strategies\r\nFeaturing tire degradation, fuel consumption, and damage, Circuit Superstars challenges you to dynamically choose your pit stop strategy during the race.<br/><br/>Online Multiplayer\r\nDive into specially curated online multiplayer races of up to 12 players from around the globe.<br/><br/>Weekly Time Trials\r\nEvery hundredth of a second counts! Challenge your friends and the rest of the world in regularly updated Time Trials events.<br/><br/>Grand Prix\r\nMaster all disciplines by conquering each of the single player tournaments designed for all 12 categories. <br/><br/>Always a worthy rival\r\nCompete against 5 different AI difficulties to challenge you on your path to mastery on the world of Circuit Superstars.<br/><br/>Free Play Mode\r\nCreate your own race events or tournaments and play vs AI or with your friends in local multiplayer. <br/><br/>The Garage\r\nCustomize your cars and driver with liveries, helmets and victory celebrations you unlock as you level up!<br/><br/>Ready Your Engines!\r\n12 vehicles to choose from, each with their own unique handling models.<br/><br/>I Ain’t Afraid of No Ghost\r\nGlobal ghosts let you see how players around the world are tackling each track, including the celebrity drivers from Top Gear x Circuit Superstars Star in a Reasonably Fast Car Invitational 2021!<br/><br/>Location Location Location\r\nRace in 19 tracks across 13 vibrant locations.<br/><br/>Race Replays\r\nReplays let you re-watch your races to see your epic overtakes or study your racing lines and those of your opponents.<br/><br/>Create your Story\r\nUse a variety of Replay cameras to view your experiences on the track from different angles that bring you close to the action!<br/><br/>Split Screen Local Multiplayer\r\nChallenge up to three of your mates and skillful AI to single races or create your own tournaments!<br/><br/>Top Gear Time Attack\r\nTake on a different kind of challenge with Circuit Superstars’ recreation of the world-famous Top Gear Test Track! Go up against drivers from a whole range of real-life motorsport series' as well as top eSports stars and see if you can beat them. Practice with your heroes to perfect your racing lines and look great while doing so with the special Stig costume!<br/><br/>Built by Motor racing fans, for Motor Racing Fans\r\nA lifetime of racing experience inspired the developers to build the racing world of Circuit Superstars. The developers grew up on the pitlane, the paddock and the racetrack, living and loving the entirety of motorsport.", "metacritic": null, "released": "2021-10-12", "tba": false, "updated": "2021-10-15T04:28:18", "background_image": "https://media.rawg.io/media/screenshots/119/11950cc6fe844e6fc6c83fac060c19ce.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 380, "game_series_count": 0, "reviews_count": 0, "platforms": ["Xbox One"], "developers": [], "genres": [], "publishers": [], "esrb_rating": null}