{"id": 678695, "slug": "beholder-3", "name": "Beholder 3", "name_original": "Beholder 3", "description": "<p>Welcome to The Greatest Union!<br />\nA totalitarian state that controls everything and everyone through oppressive laws, total surveillance, and intimidation.<br />\nYou are Frank Schwarz, a husband, and father who lost his cushy office job at the Ministry after someone set him up. The only way to avoid jail time was to make a deal with a high-ranking security officer.<br />\nNow a government spy working undercover as a landlord, you must break into tenants&#39; apartments, search them for contraband and eliminate anyone your boss wants out of the picture.<br />\nAt the same time, you’ll have to spy and scheme against co-workers and superiors in the Ministry to work your way back up the ladder. Different factions are secretly vying for power over the Ministry and the country – play them against each other to your advantage.<br />\nCan you get your old life back, or even something better?<br />\nWill you fight for change and truth or uphold the status quo?<br />\nWho are you willing to sacrifice to get what you want? Features: Work two jobs: in an apartment block and in the Ministry.<br />\nDifferent political factions are fighting for power. Pick your side wisely.<br />\nComplete quests from the Ministry: promote the ideology of the totalitarian state, manipulate flags and spread whatever propaganda you’re told to.<br />\nInstall surveillance cameras and search apartments and offices.<br />\nMaintain your cover by doing everyday chores like paying bills, fixing up apartments, and keeping your tenants happy.</p>", "metacritic": null, "released": "2022-03-03", "tba": false, "updated": "2024-03-23T03:46:37", "background_image": "https://media.rawg.io/media/games/312/3121ba5c3d5fbe8b747475099f3e63b8.jpg", "website": "", "rating": 3.2, "rating_top": 3, "added_by_status": {"yet": 27, "owned": 149, "beaten": 23, "toplay": 25, "dropped": 18, "playing": 1}, "playtime": 4, "achievements_count": 10, "ratings_count": 40, "suggestions_count": 262, "game_series_count": 2, "reviews_count": 40, "platforms": ["Nintendo Switch", "Xbox Series S/X", "PlayStation 4", "Xbox One", "PlayStation 5", "PC", "macOS"], "developers": ["Paintbucket Games"], "genres": ["Puzzle"], "publishers": ["Alawar Entertainment", "Alawar Premium"], "esrb_rating": null}