{"id": 678729, "slug": "real-coaster-idle-game", "name": "Real Coaster: Idle Game", "name_original": "Real Coaster: Idle Game", "description": "Build and run the world’s most exciting idle theme park and earn a fortune! Ride amazing 3D rollercoasters and many popular fun park simulations!<br/><br/>Develop your dream idle theme park with awesome roller coasters. Attract more visitors, collect income from rides and shops and invest in new assets. Build many different parks in stunning locations and grow your empire. Become the next theme park tycoon!<br/><br/>Features: <br/><br/>BUILD - Easy to play idle gameplay for every player.<br/><br/>HAVE FUN - Ride incredible 3D roller coasters and attractions in first person.<br/><br/>UPGRADE – Improve and decorate your fun park rides to earn even more.<br/><br/>INVEST - Add stunning theme parks to your portfolio from Gold Rush Park Nevada to Cyber Park Tokyo.<br/><br/>COLLECT – Become a quadrillionaire and own your ultimate theme park empire.<br/><br/>MANAGE – Decide which investment tasks to complete to grow your theme park fast and keep your visitors happy.<br/><br/>SHARE – Capture videos of the coolest rides and share them with your friends.<br/><br/>PLAY – anytime – no internet connection needed. <br/><br/>Real Coaster is not only an entertaining and fun idle game but also offers a 3D rides simulator of the theme park attractions you build. Different camera angles make the simulation feel real. If you are a rollercoaster enthusiast or just like fun parks, there will be a coaster type for you!<br/><br/>With Real Coaster Idle Tycoon anyone can be a successful theme park tycoon. <br/><br/>Download the Real Coaster now and have fun!<br/><br/>Want to keep up to date with the game? <br/><br/>Follow us on:<br/>Facebook: https://www.facebook.com/raventurn <br/>Instagram: https://instagram.com/raventurn <br/>Twitter: https://twitter.com/raventurngames <br/>YouTube: https://www.youtube.com/channel/UCJCANJ2C_w1dYgXA0LiVR9A <br/> <br/>Questions about the game? Contact our support at support@raventurn.com", "metacritic": null, "released": "2021-10-07", "tba": false, "updated": "2021-10-15T04:43:30", "background_image": "https://media.rawg.io/media/screenshots/532/532a467404ae5f99a8c64a6d13573213_HthXgI7.jpg", "website": "http://realcoaster.raventurn.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 232, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Raventurn Games"], "genres": ["Strategy", "Simulation"], "publishers": ["Raventurn Games"], "esrb_rating": "Everyone 10+"}