{"id": 678714, "slug": "pixel-art-gallery-paint-color", "name": "Pixel Art Gallery: paint color", "name_original": "Pixel Art Gallery: paint color", "description": "Just chill &amp; let your inner artist out by creating a gallery with pixel arts! <br/>Pixel Art Gallery: Paint Color is an ultimate form of escapism that helps you relax and unwind. <br/><br/>It’s a free game where your aim is to select from a wide range of stunning pixel artworks and paint them by number to pass time. Zoom in and tap the corresponding pixel to color in. In Pixel Art Gallery: Paint Color, there are so many artwork topics that you can choose from the library including mystery, animal, nature, architecture, character, food, object, vehicle, and so on. You’ll never run out of neat objects to color. Moreover, you will be rewarded with a Daily picture and boosters such as Magnifying glass, Paint bucket, and Bomb every day.<br/><br/>This game is much more attractive than other digital coloring books by allowing you to update to the premium version with no ads as well as to buy extra boosters to paint faster.<br/><br/>There are so many objects, so this could keep you busy for a long time. If you enjoy coloring books, it’s a great way to carry lots around in your pocket! <br/><br/>◉ HIGHLIGHT FEATURES<br/>300+ mind-blowing artworks to keep you busy for a long time.<br/>Powerful boosters: Magnifying glass, Paint bucket, and Bomb<br/>Special Daily artwork is rewarded every day.<br/>Share your creations with friends and family.<br/>No time limit to enjoy and let your inner artist out.<br/>Free &amp; Simple to play with endless fun.<br/><br/>You don’t need any skills to be a mastermind in this game. Smartly tap-tap and discover colorful pixel arts waiting for you to color them. Give this Pixel Art Gallery: Paint Color a try!<br/><br/>*******<br/>Information about the auto-renewal of subscription:<br/>This is an auto-renewable subscription. A subscription is valid for 1 week or 1 month, depending on the subscription type selected.<br/>- Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period.<br/>- Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's Account Settings after purchase.<br/>- Payment will be charged to iTunes Account at confirmation of purchase.<br/>Terms of Service: https://privacy.athena.studio/terms-of-service<br/>Privacy Policy: https://privacy.athena.studio/<br/>CONTACT US:<br/>Fanpage &amp; CS Support: https://www.facebook.com/athenamobilegames/", "metacritic": null, "released": "2021-05-14", "tba": false, "updated": "2021-10-15T04:36:46", "background_image": "https://media.rawg.io/media/screenshots/56b/56ba54825f1f2cb9f2a0314d883e0f09_IAklEUt.jpg", "website": "https://athena.studio", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 104, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Athena Studio"], "genres": ["Board Games", "Casual"], "publishers": ["Athena FZE"], "esrb_rating": "Everyone 10+"}