{"id": 678876, "slug": "the-wrld", "name": "The Wrld", "name_original": "The Wrld", "description": "<p>Turn based strategy game with tower defense elements. Each player starts with one town which they can upgrade and defend from monsters. Click your town twice to open its town screen.<br/></p>\n<p>On the town screen players can fortify the town hall to withstand more impacts, train militia to reduce the damage taken by the town hall, and  direct the population of the town to produce a certain type of resource (there are 7 resources: lumber, stone, metal, food, luxury, sulfur and coal).</p>\n<p>Click 'build' button to enter build mode. In build mode you can upgrade the town by placing buildings. There are several buildings to increase maximum workers on resources; other buildings give direct income; and there are towers to get rid of besiegers. Consider the landscape of the town – it is impossible to place a building on a too steep slope.</p>\n<p>Train units to conquer more towns. You can find several neutral (with a grey flag) towns on a global map. Select your unit with left mouse button and send them to target with right mouse button. Once unit enters a hostile town, they looses all movement points and appears in a siege configurator of the town. Double click on a hostile town shows  the siege configurator, so you can distribute besiegers in waves and start a siege.</p>\n<p>During a siege units appears on a spawn point and walks to town hall. Once unit touches the town hall they broke into the town, causing damage to the town hall and taking damage from the militia. Besieger player can buff their units and defender player can deploy temporary fortifications (towers with limited ammo, dense blocks to stun units and checkpoints to change a way from spawn point to town hall). While wave is spawning controls for both besieger and defender freezes.<br/></p>\n<p>Currently the game is in early stage of development.</p>\n\r\nTechnical information\r\n<p>The game based on my free (as in freedom) game engine KawaiiWorlds. It uses Qt 5 for UI-s and window system interactions. Game logic is written on JS and QML. OpenGL 3.1, OpenGL 4.5 Core or Vulkan (currently only on Linux) can be used as a graphical back-ends.<br/></p>\n<p>There are builds to Windows (MSVC 2019), Ubuntu Linux 20.04 and Arch Linux. For other OS you can download a world and CMakeLists.txt to download and build the game engine from the source code.</p>\n\r\nPlans\r\n<ul><li>Come up with an interesting name for the game, since \"the_wrld\" is not really fun;<br/></li><li>Replace 3D models of units and buildings with fancy and animated ones;</li><li>Add music and sound effects;</li><li>Continuously upgrade the UI and improve QOL;</li><li>Add 4 playable races: humans, amphibians, insectoids and  thinking mushrooms with unique units, buildings and different but overlapping resources;</li><li>Improve shader based graphical effects</li><li>Support more OS / platforms</li><li>Tune the game balance</li></ul>", "metacritic": null, "released": "2021-10-14", "tba": false, "updated": "2021-10-15T05:20:30", "background_image": "https://media.rawg.io/media/screenshots/19c/19c4eaeb1bfacc2869238db46c90cc29.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 148, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["Alessa_95"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}