{"id": 678974, "slug": "max_q", "name": "Max_Q", "name_original": "Max_Q", "description": "<p><strong>Max-Q </strong><br/></p>\n\n<p>\"50 years after the Messier-87 rebellion, scrap gatherers are still roaming the debris looking for valuable junk like the precious Energy Cores.</p>\n<p>Equiped with their ElectroVaccums and Magboots, they fight each other, scavenging for this precious loot. You can make a fortune on the black market if you get lucky.</p>\n<p>But Core Hunting is a dangerous game, as Messier-87 is full of explosive and sharp debris as well as numerous asteroids... though they can always be used as bullets.</p>\n<p>Your shift is starting, send back as many Cores as you can to the company HQ, your paycheck depends on it, employee_1312b !\"</p>\n<p>In this 2-Players versus game, your goal is to bring the most energy cores you can back to your base. To do so, you must cross your opponent, whot has the same objective. In zero-G space, you will have to use floating debris and asteroids as makeshift weapons. <br/>The push/pull mechanics can be a bit tricky to master at first, but 5 minutes in and you'll get the hang of it and the game will become very enjoyable and skillful so don't be discouraged too soon !</p>\n<p>Controls :<br/></p>\n<ul><li>Right Stick : Aim</li><li>Left Stick : Move</li><li>Right Trigger : Push</li><li>Left Trigger (hold) : Pull</li><li>A : Jump</li><li>B : Hit</li><li>X : Call back</li></ul>\n<p>Made by H&amp;T in 72h</p>", "metacritic": null, "released": "2021-10-14", "tba": false, "updated": "2021-10-15T05:43:07", "background_image": "https://media.rawg.io/media/screenshots/059/0597900849a5fe48d606fb80321068f1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 138, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["H&T"], "genres": ["Action", "Fighting", "Platformer"], "publishers": [], "esrb_rating": null}