{"id": 67904, "slug": "mother-chef-food-delivery-game", "name": "Mother Chef Food Delivery Game", "name_original": "Mother Chef Food Delivery Game", "description": "This game tells you the story of a single mom, a working mother and home manager. She has been managing her home and kids all alone. After a lot of struggle for kids she finally manages to start her own home chef food delivery business to support her kids education and live like a happy and sound family. She was always good in cooking delicious foods and as user gets to play as the virtual chef be ready to prepare awesome dishes and deliver them to doorsteps. <br/><br/><br/>Begin your day virtual mother, wake up and prepare breakfast for your kids so they don't get late from high school. The school bus might be here anytime. Once the kids leave for school, you need to complete all your household tasks like cleaning, gardening, kitchen work and giving food to your pet dog. Then it's the like to wear apron and start making some delicious food that you need to deliver to doorstep to earn yourself a better living. You daughter will also help you in some kitchen work as the kitchen helper once she returns from school. After all done you'll be packing all the stuff and driving to the desired locations to drop ready made food boxes in this Virtual Mother Home Chef Food Delivery Games. <br/><br/><br/>Have you ever tried hand in cooking as the virtual chef or family games with driving tasks? We got all covered for you with Virtual Mother Home Chef Food Delivery Games. Only a Virtual Mother like you can manage both home and work at the same time. Be the best working mom and to manage home chef duty, household tasks and much more so the kids could feel proud on their single mom. <br/><br/><br/>Top Features:<br/>•\tBest 3D Family Games Working Mom likes to play<br/>•\tReal Cooking Fun with home adventure<br/>•\tBest Game for single moms to play and Enjoy Working Life style<br/>•\tBe a real mom in happy home mother games<br/>•\tBe the Home Chef and Deliver Food Boxes to Doorsteps", "metacritic": null, "released": "2018-07-23", "tba": false, "updated": "2019-10-22T14:02:09", "background_image": "https://media.rawg.io/media/screenshots/71f/71f61c809a67d229fdf0caccc84a84a3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 192, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Muhammad Wasif"], "genres": ["Adventure", "Simulation"], "publishers": ["Muhammad Wasif"], "esrb_rating": null}