{"id": 679133, "slug": "witchs-night", "name": "WiTCH'S NiGHT", "name_original": "WiTCH'S NiGHT", "description": "<p>The witch you're playing as has quite a bad dream: she trapped in a never ending bullet hell. Even though it'd be impossible to get out of this trouble but perhaps she can become the best bullet dodger out there? Or will she find it fun to just dodge things without competition?</p>\n<p><strong>Features:</strong></p>\n<ul><li>Around 4 billions different but at the same time similar seeds (levels)</li><li>Ranking system: create an account, automatically submit your plays and compete with other people</li><li>Skinning system: if you dont like how the game looks, you can easily modify its look (skinning guide is below)</li><li>Replays system: save your best plays and  watch them when you wish</li><li>Mouse / tablet / whatever that supposts cursor input movement: unlike majority of bullet hell games here you dont need keybord to move character</li><li>Mods: if you want to complicate a gameplay for yourself try enabling mods. You probably already saw it somewhere!</li><li>..way more features will be added as time goes by</li></ul>\n<p>Gameplay is simple as it can be - dodge bullets, get highest combo you can. Getting hit by bullet wont kill you instantly, but you already can go back to menu for score submit. Play with mods for higher multipliers and try other seeds!</p>\n<p><strong>IMPORTANT:</strong>\n</p>\n<p>The game doesnt have its own soundtrack. It'd be very boring to play without music, so listen to your spotify/youtube/any playlist while playing!</p>\n<p><strong>Rules:</strong>\n</p>\n<p>For saving healthy competition some rules must exists:\r\n</p>\n<ul><li>Do not create more than 1 account.\r\n</li><li>Do not play using someone's else account.</li><li>Do not use any cheats, do not perform any manipulation with game's code (for example - reversing)\r\n</li><li>Overall, if you think an action you want to perform might be suspicious refrain from doing it.\r\n</li></ul>\n<p><strong>GAME ELEMENTS DETAILS:</strong><br/></p>\n<p><strong>Seeds details:</strong></p>\n<ul><li>In main menu you will find a field where you can put any signed integer number (-2147483648 to 2147483647). After that, hitting \"Play\" button will put you on a level that will be the same no matter how much time you retry it untill you change the seed.</li><li>You can leave that field empty, in this case seed will be randomly picked</li><li>You can click at a play on \"Latest plays\" to instantly copy its seed to the field</li><li>After entering the menu seed is automatically generated but doesnt show up on a field.</li></ul>\n<p><strong>Hotkeys / Controls details:</strong></p>\n<ul><li>Esc - in menu - opens settings. In game it opens a menu where you can retry, exit or resume gameplay.\r\n</li><li>F7 - sets some limits on framerate. Usefull if you play on laptop for battarey saving. You can click it multiple times to switch between fps modes.\r\n</li><li>Hold R - in game only, retries current level. This is usefull if you dont want to always open menu and press retry button.\r\n</li><li>F2 - at a game over screen - saves replay. The game might lag a little for this time\r\n</li></ul>\n<p><strong>Ranking system details:</strong></p>\n<ul><li>After going back to menu from play you will be awarded with points (pts). The amount of them solely depends on max combo that you got at your run and the mods you used.</li><li>Do not confuse pts with a total score. The latter is usually a big number while pts is a number that has \"pts\" after itself.</li><li>Only your best pts per seed will be saved. E.g. if you played on seed 0 and got 5pts playing again on this seed and scoring 3pts wont give you 5+3=8pts. Instead, only the highest one will stay, so from this seed you will have 5pts.</li><li>The total amount of pts you have is NOT an actuall summ of all yours top scores on different seeds. It first orders it by descending, then taking only 100 highest of them and then calcualtes total amount of pts by summing them where each of score has a multiplier of 0.95^n, where n - its position, can go from 0 to 99 (0 - highest from those 100, 99 - lowest). Example: if your best pts plays are 5pts, 3pts, 7pts, 1pts heres how its calculated: (1st step - ordering) 7pts, 5pts, 3pts, 1pts (2nd step) 7*0.95^0 + 5*0.95^1 + 3*0.95^2 + 1*0.95^3 = 7 + 4.75 + 2.7 + 0.86 = 15.3pts</li><li>Your ranked place (displays as #X in game) depends only on your total pts. Obviously, #1 means that you're currently the best!</li><li>Retrying the seed (level) without going back to menu will not perform a score submission so take that in mind</li><li>You need to get at least 1pts on a level for score submission.</li><li>Pts formula is 10^-5 * Combo^2 * SCORE_MULTIPLIER</li></ul>\n<p><strong>Skinning details:</strong></p>\n<ul><li>If you want some game elements (like backgrounds, buttons) to look different, open Settings in main menu (Esc) and press \"Open skin folder\" button. It will open a folder with a README text file that contains mostly everything you need to know.</li><li>Not everything is skinnable. More skinnable elements will be added as time goes by.</li><li>You must use the same file extension for an element thats written in README file. For example, if you place a png image with name \"game.background.png\" to the skin folder it wont be loaded. As README file says you need it to be .jpg file, so use any tools (photoshop, or some free websites / tools that provide image file convertation) to convert it to needed extension. </li><li>You must press \"Reload skin\" if you did change something in your skin to see  the changes in game.</li><li>If you want to get back to default skin element delete the element from the skin directory and restart the game.</li></ul>\n<p><strong>Replays details:</strong></p>\n<ul><li>Press F2 at a fail screen to save replay. The game might lag a little at this point.</li><li>You can access folder where replays stored by opening replays tab in main menu (playback button) and click \"Replays folder\" button.</li><li>You can put there any replay from other people and they will appear in game after reopening replay tab.</li><li>To start watching replay you need to simply click on the replay you want to watch.</li><li>While watching replay you will see all other hints.</li><li>Replays are recorded at 60fps, REPLAY_FPS field stands for player's fps at a certain point of replay.</li><li>Sync replay framerate field (and option in settings) will force your game to aim for the same framerate as player had. This is essential to get best synchronization. On low framerates game behaves slightly different, and the difference become as big as lower fps is. So if you have 1000fps (GAME_FPS) and the player had 30fps (REPLAY_FPS) you will see way different picture from what player saw. In this case you must enable the option.</li><li>If you want best as possible replay accuracy refrain from increasing replay's speed. Increasing replay's speed might offset things by small amount of ms what is usually enough to provide inaccurate replay synchronization.</li></ul>\n<p><strong>MISC:</strong></p>\n<p>The game is currently in development but you can already play it since it already has the minumum I wanted. This is obviously not even close to what I want and I have lots of ideas and goals for this so stay around for more updates!</p>\n<p>Official game's discord link will be here once it will be needed and I set up everything there. Till that, please use comment section below.</p>\n<p>If you wish to donate I'll be extremely happy! https://www.donationalerts.com/r/dafiely</p>", "metacritic": null, "released": "2021-10-13", "tba": false, "updated": "2021-10-15T06:21:13", "background_image": "https://media.rawg.io/media/screenshots/582/582895afcb9197e3d12ba3107afc7bdf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 40, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dafiely"], "genres": ["Action"], "publishers": [], "esrb_rating": null}