{"id": 679174, "slug": "cairn-mathairs-curse-demo", "name": "Cairn: Mathair's Curse (Demo)", "name_original": "Cairn: Mathair's Curse (Demo)", "description": "<p><strong>When an ancient evil is awoken by a most certainly odd cult, a boy must venture from his home to save his home (and also the world...).</strong><br/><br/><br/><br/>Cairn: Mathair's Curse is an RPG inspired by 90s JRPGs and Scottish culture. Explore a variety of interesting locations and fight strange and unusual enemies.</p>\n<ul><li><strong>A deep-rooted conspiracy to unravel</strong><br/>A plot centuries in the making threatens everyone in Albaness. Animals are leaving the forests, a secret organisation lurks in the dark, and people are going missing from their homes. It is only a matter of time before the world is swallowed in chaos. Who will uncover these mysteries?<br/><br/>\n</li><li><strong>Character-rich story</strong><br/>A cast of weird and wonderful characters await. Meet family, friends and rivals as you explore the country of Albaness. Who will you meet?<br/><br/><br/><br/>\n</li><li><strong>A world filled with wild and wonderful locations</strong><br/>Explore a large variety of hand-crafted locations, from quaint seaside villages to ancient underground caverns and secret high-tech lairs. Don't feel like the trip back? Catch a lift in the family campervan and return to previously explored locations. (In a campervan, did I mention campervan!?)<br/><br/><br/><br/>\n</li><li><strong>A quirky turn-based battle system</strong><br/>Fight a host of unusual and wacky enemies (or allies, who knows), including wild roaming haggis', bewildered stop signs and an odd group of cultists bent on<br/>destroying the world. Use character unique skills to tip the balance and unleash devastation on your foes. Combine the skills of your friends to tactically defeat your enemies.<br/><br/><br/><br/>\n</li><li><strong>An original soundtrack</strong><br/>A soundtrack hand-crafted for the world of Cairn. Bop to a variety of tracks from bouncing combat music to spooky exploration ambience and heartbreaking melodies.\r\n</li></ul>", "metacritic": null, "released": "2021-10-13", "tba": false, "updated": "2021-10-15T06:30:58", "background_image": "https://media.rawg.io/media/screenshots/97d/97dcf188de10ee307bf72bbcf953f0be.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 212, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["RosstheBoss0"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}