{"id": 679146, "slug": "the-way-home-itch-brie-y-r", "name": "The Way Home (itch) (Brie Y. R.)", "name_original": "The Way Home (itch) (Brie Y. R.)", "description": "<p>They say home is where your heart is, and for a dog, her home is definetely her owner, not the empty house she's living alone.<br/></p>\n<p>So when her owner is not back at the same usual time, she decides to go out and find her. Yet as a blind dog, she can't see through her eyes. All she can use is the sounds she hear through her ears, the ground she touches through her paws, and the scents she smell through her nose.<br/></p>\n<p>The most important thing is to follow the smell. Yet smells can be misleading, for they can be preserved for about three days, and you may be following the route she walked yesterday or the day before yesterday. And even worse, sometimes smells can be swiped off by the water of the streams in the countryside or be covered by the smelly gasoline of the vehicles in the busy city avenues.</p>\n\n<p><strong>- How to Play -</strong></p>\n<p>  Mouse to Turn around</p>\n<p>  W A S D to Move around</p>\n<p>  Left Shift + W A S D to Sprint</p>\n<p>  Spacebar to Jump</p>\n<p>  Hold Tab to show the Distance from the Nearest Smell of her</p>\n<p>  Hold Esc to show Tutorials<br/></p>\n<p>  Earphones are required, for the sound will help to provide the info of where you are.</p>\n<p>  Different smells is presented as different colors of particles, and the amount matters. </p><p>  When it rains, dogs can only sniff the scents within several feet; while in sunny days, they can sniff as far as half a mile.</p>\n\n<p><strong>- Experimental Prototype - </strong></p>\n<p>This is a very early experimental prototype. The full game is supposed to have combat system with a boss-battle, several branching narrative events with voice-acting, and two more levels of city and countryside besides this beginner level of suburb, and etc. but these mechanics and contents are not included in this rapid prototype, for before the heavy dev work, I wanna firstly experiment if the core mechanic is fun. So please feel free to leave comments below and tell me how you feel about it. Do you think this core mechanic is interesting? or need to be improved (and what do you hope it has in future)? or simply boring and you don't wanna play it at all?</p>", "metacritic": null, "released": "2021-10-13", "tba": false, "updated": "2021-10-15T06:24:20", "background_image": "https://media.rawg.io/media/screenshots/fad/fad49de622ef0789c6d3fcde8964c5b2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 47, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["Brie Y. R."], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}