{"id": 67929, "slug": "paper-toss-boss", "name": "Paper Toss Boss", "name_original": "Paper Toss Boss", "description": "The mega-hit Paper Toss game franchise just got a big promotion to Paper Toss Boss!<br/>Paper Toss Boss: more papery, tossy, and bossy than ever before! (It’s cool, tossy is a word now, don’t worry about it.) There are tons of things to throw and oodles of things to throw them at! Score.<br/><br/>- 16 unique items to toss, from classic wads of paper to the epic rubber band ball<br/>- 10 dynamic environments of varying difficulty in which to toss around <br/>-Break, blow up, and burn the objects found around the office (?)<br/>- Toss stuff at the Boss and other co-workers to annoy them (in game, not real life — but we won’t tell if you pretend it’s real life)<br/>- Missions offer challenges to show off your paper (and non-paper) tossing skills in exchange for awesome rewards<br/>- Moving targets, bank shots, and bunches of baskets will test the true prowess of your paper tossing skills <br/>- Power-ups boost your scores and mix up the gameplay for a variety of fun ways to toss <br/>- Game Center leaderboards and achievements so you can challenge your friends and smite your adversaries<br/><br/>Remember those pesky “Hey, you hit me!” co-workers from the original Paper Toss? Well now you can throw right at them! (You devil, you.) You’ll still score points for flicking wads of paper into the office trash can, now with a handsome new ergonomic design! Plus, try your skills with flaming paper balls, tossable bananas, tomatoes, grenades, and other fun stuff to hurl in classic office settings and more. What are you waiting for?! Get tossing!<br/><br/>Install Paper Toss Boss for FREE today!<br/>PLEASE NOTE! Paper Toss Boss is completely free to play, but some game items can also be purchased for real money. If you don't want to use this feature, please disable in-app purchases. Plays best on devices like iPhone 5 or iPad 4/iPad Mini 2 and better. <br/>______________________________<br/>Paper Toss Boss is brought to you by Backflip Studios, makers of absurdly fun mobile games like DragonVale, NinJump, and Transformers: Earth Wars, and is a proud partner of Hasbro, Inc.", "metacritic": null, "released": "2011-12-08", "tba": false, "updated": "2019-08-30T04:11:48", "background_image": "https://media.rawg.io/media/screenshots/e8c/e8c57782186b92d208b31315c8ed827e.jpg", "website": "http://www.backflipstudios.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "beaten": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 93, "game_series_count": 0, "reviews_count": 2, "platforms": ["Android", "iOS"], "developers": ["Backflip Studios"], "genres": ["Simulation", "Arcade", "Casual"], "publishers": ["Backflip Studios"], "esrb_rating": "Everyone 10+"}