{"id": 679313, "slug": "skull-arena", "name": "Skull Arena", "name_original": "Skull Arena", "description": "<p>First thanks a lot for checking out this game. This was the first game jam I participated in so it has been a unique experience for me.  The total duration of the jam was 2 days long and making a 'complete' game in just 2 days is not something I do regularly but nonetheless, it has been fun. </p>\n<p>It was really hard but I'm really glad I could pull through the end of my first game jam so hopefully, that will also be the case in future game jams.</p>\n<p>The game jam I participated in was themed around Halloween and we must do something with the keyword 'skull' so that's why I created this skull arena.</p>\n<p>You will be piloting a zombie/mech humanoid against a large skeleton. It is a very simple fight you can only throw and receive punches and after one of the two goes down the game ends. </p>\n<p>I wish I had more time to work on the mechanics, the models(especially the zombie/mech humanoid, really wanted to do more with him), the map, the crowd, basically, everything but the clock was ticking and corners had to be cut.</p>\n<p>The game was completely created by myself. I really wanted to prove that I was capable of making a game by myself so that's the reason I didn't want to develop in a team.</p>\n<p>I don't know If I will continue development on this game, the code isn't amazing so that's something I need to redo if I want to further develop this. Maybe making a different game but with the same concept would be more likely to happen.</p>\n<p>If you have played my game, I hope you enjoyed it and have a wonderful day!</p>", "metacritic": null, "released": "2021-10-13", "tba": false, "updated": "2021-10-15T07:09:59", "background_image": "https://media.rawg.io/media/screenshots/073/07357bd0d48dfa19d414d9e7092cfe36.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 150, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Tom Verbeeck"], "genres": ["Fighting"], "publishers": [], "esrb_rating": null}