{"id": 67937, "slug": "disney-jigsaw-puzzles", "name": "Disney Jigsaw Puzzles!", "name_original": "Disney Jigsaw Puzzles!", "description": "**The more you play, the more FREE puzzles you unlock!**<br/> <br/>Now puzzlers who love Disney can choose from hundreds of Disney Jigsaw puzzles—from Frozen to Finding Dory, Disney Princess to Zootopia, Mickey Mouse to Disney Classic Movies! Test your skills to unlock free puzzles and jigsaw your way through your favorite Disney moments! Scale the challenge to fit all ages and levels! And of course, take Disney jigsaw puzzles everywhere—without any clean up, or a single lost piece!<br/> <br/>FEATURES<br/>• SOLVE PUZZLES with your favorite Disney and Pixar characters and moments!<br/>• COMPLETE puzzles of your favorite animated and live action scenes!<br/>• UNLOCK up to 50 free puzzles as you play through your favorites!<br/>• LEVEL-UP the challenge as you re-size &amp; solve puzzles from 6 to 200+ pieces! (64 piece max on iPhone)<br/>• BEAT the clock and your personal bests as you puzzle against the timer!<br/>• CUSTOMIZE your experience by changing background colors, showing edge pieces &amp; more!<br/>• FREE daily puzzles!<br/>• NEW puzzle packs being added all the time!<br/><br/>Before you download this experience, please consider that this app contains in-app purchases that cost real money, as well as advertising for the Walt Disney Family of Companies.<br/> <br/>If you’re experiencing difficulties with audio, please check the audio settings with your device to see if your device is muted. Don’t hesitate to contact customer care at http://help.disney.com/Apps/Disney-Jigsaw.<br/><br/>https://disneyprivacycenter.com<br/>https://disneytermsofuse.com", "metacritic": null, "released": "2015-11-05", "tba": false, "updated": "2019-10-22T14:02:11", "background_image": "https://media.rawg.io/media/screenshots/066/066603ebcbbfa982ab7ccf6176c352a1.jpg", "website": "http://disneystories.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 225, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Disney"], "genres": ["Family", "Puzzle"], "publishers": ["Disney Interactive"], "esrb_rating": "Everyone 10+"}