{"id": 679451, "slug": "touhou-hollow-hearts", "name": "Touhou: Hollow Hearts", "name_original": "Touhou: Hollow Hearts", "description": "Unlikely Explorers\r\n<p>After learning about an ancient artefact, the Mask of the Lost Emotion, frail scholar Patchouli and unfazeable oddball Kokoro team up and set out on an unlikely quest to recover it.</p>\n<p>Exploring the ruins of a now-lost civilization from the years before Gensokyo was founded, they slowly uncover some horrifying truths that perhaps would've been best left buried.</p>\r\n\r\nAgainst All Odds\r\n<p>A tag-team metroidvania where you need to alternate between swordfighting and magic to suit the situation, exploring caves thick with mystery... and bullets. Take on fearsome bosses, break suspicious-looking walls, and dig further than anyone has ever gone before.</p>\n<p>Forge your own playstyle with powerful magical artefacts... at a cost. There's no right or wrong way to play.<br/></p>\n<p>Face familiar foes, and unearth unknown creatures not quite of this world. Test your mettle against withering ancestors, decrepit artefacts, and an ancient eastern bloodline.<br/></p>\r\n\r\nAncient Magic\r\n<p>Delve into the darker side of Touhou lore as you explore the early days of Gensokyo. Cherish the heartwarming moments you can find in an abandoned world, long since dead.<br/></p>\n<p>An unique desaturated visual style both helps danmaku feel more magical, and makes it easier to keep track of enemy bullets.<br/></p>\n<p>Features a completely custom soundtrack with somber orchestrated remixes of classic Touhou hits like <em>U.N. Owen Was Her</em>, <em>Bad Apple!</em> and <em>Love-Colored Master Spark</em>.</p>\r\n\r\nFan Work Disclaimer\r\n<p>Touhou Project original concept, characters, and other elements are the property of ZUN and Team Shanghai Alice. This game is a fanmade work and is not affiliated with or endorsed by the original creators. Please support the official series.<br/></p>", "metacritic": null, "released": "2021-10-12", "tba": false, "updated": "2021-10-15T07:42:52", "background_image": "https://media.rawg.io/media/screenshots/870/870d5d2b39b563527d8e9c72542b492e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 286, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Yal"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}