{"id": 679563, "slug": "dbclashcom", "name": "DBClash.com", "name_original": "DBClash.com", "description": "<p>Did you ever played a <strong>character building game</strong>, or a <strong>Dragon Ball game</strong>? Well, DBClash is both of them... and more! Absolutely FREE, no P2W !<br/></p>\n<p><strong>PLAY THE GAME</strong></p>\n<p>\r\n    Create, train and teach your own Dragon Ball character - fight monsters and other players. Let's see step by step:</p>\r\nChoose a character\r\n\r\n  \r\n        Select a Dragon Ball legend from <strong>15 characters</strong>.<br/><br/>\r\n        Every character has a different starting skill and trait.<br/><br/>\r\n        Don't worry, all of them can be built in thousand ways and trained to learn all sort of skills.<br/><br/>\r\n        Register a character here.\r\n       \r\nTrain\r\n\r\n  \r\n        Travel across the world and train your character.<br/><br/>\r\n        By training, your character will increase his/hers stats.<br/><br/>\r\n        A character has 4 stats: <strong>Health</strong>, <strong>Defense</strong>, <strong>Strength</strong> and <strong>Energy</strong>.<br/><br/>\r\n        The character's <strong>Power level</strong> is an average of these four stats.\r\n       \r\nLearn skills\r\n\r\n  \r\n        Learn from <strong>21 skills</strong>.<br/><br/>\r\n        Every skill has <strong>5 levels</strong>, and every level has an increasing amount of lessons to learn.<br/><br/>\r\n        Skills can be offensive or defensive, strength or energy based, and each differs in cooldown, damage composition and much more.<br/><br/>\r\n        Check the learnable skills list on every location.\r\n       \r\nPVE and PVP battles\r\n\r\n  \r\n        Engage in <strong>PVE and PVP battles</strong> on every location.<br/><br/>\r\n        The battle-system is a <strong>cooldown turn-based system</strong>, which means that both you and the enemy perform skills than waits for the skill's cooldown to end. <br/><br/>\r\n        It's not just about strategy and character skills! <strong>It's about your own skills too!</strong> When executing a skill, you need to perform a reflex check by pressing keys as fast as you can - this is called a <strong>try check</strong>. The faster and more accurate you act, the more damage you inflict.\r\n       \r\nAP system\r\n\r\n  \r\n        Grow big by using your AP wisely.<br/><br/>\r\n        Almost every action you're character takes cost AP (action point).<br/><br/>\r\n        You'll get <strong>1 AP / hour</strong>, hence you need to plan smart for what will you use them.<br/><br/>\r\n        Your character can store up to 72 AP at once, so you should visit him/her at least once per three days.\r\n       \r\nSeasons\r\n\r\n  \r\n        A new year: a new season - and <strong>many gifts!</strong><br/><br/>\r\n        In every year's january prizes are released for all leaderboard rankings, following a full reset of the characters and leaderboards.<br/><br/>\r\n        We respect new players and fair competition.<br/><br/> <strong>Noone will overgrow, Noone will pay-to-win!</strong> Veterans and newbies, poor and rich has the same chances in DBClash.com<br/><br/>\n<p> Register! </p>", "metacritic": null, "released": "2021-10-12", "tba": false, "updated": "2021-10-15T08:19:49", "background_image": "https://media.rawg.io/media/screenshots/c67/c6733e9f19f9f39df3b4318bf63f79a0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 154, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Szabo Sandor"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}