{"id": 679865, "slug": "your-distant-voice", "name": "Your Distant Voice", "name_original": "Your Distant Voice", "description": "Présentation\r\n<p><strong><em>Your </em></strong><em><strong>Distant Voice</strong></em> est un jeu de rôle en solitaire qui raconte une histoire d’amour où souvenirs du passé, réflexions et reconstruction au présent s’entremêlent jusqu’au dénouement inéluctable.</p>\n<p>Inspirée du schéma des mangas romantiques japonais, votre aventure démarre alors que vous arrivez, seul(e), dans la <em>Ville</em> immense et tentaculaire. Face à l’inconnu, vous avez pris votre courage à deux mains pour vous inscrire à l’université et louer un appartement minuscule… Dans le but de retrouver votre Être aimé avec qui le contact est rompu et de faire en sorte que votre histoire se termine bien. Sauf si votre nouvelle vie vous amène sur un chemin différent.<br/></p>\r\nSystème\r\n<p><strong><em>Your </em><em>Distant Voice</em></strong> est basé sur la mécanique de jeu <strong>« Follow the Leads »</strong> par Nicolas « Gullix » Ronvel, popularisée dans son jeu <em>Après l'accident</em>.  Le jeu se décompose en trois chapitres, symbolisés par des cartes à jouer, qui reposent beaucoup sur l’introspection, l'improvisation guidée et les sentiments. Souvenirs du passé, péripéties du présent, nouvelles rencontres et dénouement de l’histoire sont générés par un tirage de cartes. A votre charge ensuite de jouer l’événement, raconter ce qu’il s’est passé en ajoutant des détails, des personnages, des descriptions ou même des dialogues. <br/></p>\n<ul><li>Les cartes <em>Trèfle </em>  \t  correspondent à l’acte 1 : les souvenirs de la rencontre avec l'Être.<br/>\n</li><li>Les cartes <em>Pique </em>    \tsont pour l’acte 2, elles posent un cadre sur la rupture passée et les éléments qui agitent votre installation dans le présent.</li><li>Les <em>Carreaux </em>    \tsont les cartes de l’acte 3, elles traitent de votre reconstruction et des nouvelles rencontres que vous faites dans votre nouvelle vie.</li><li>Enfin, les cartes \t<em>Cœur </em>    sont liées à la mécanique du jeu : ce sont les pistes et le déclenchement de la fin de la \tpartie.\r\n \r\n</li></ul>\r\nLa suite ?\r\n<p>Le jeu est téléchargeable à \"prix libre\", c'est à dire que vous pouvez l'acquérir gratuitement ou laisser quelques euros à votre convenance (et selon vos moyens !). L'argent potentiellement récolté servira dans un premier temps de \"pourboires\" aux artistes dont les images libres sont intégrées au livre.<br/>Le jeu sera régulièrement mis à jour, surtout au début, selon les retours que je reçois et les corrections de fautes à assurer. Pensez à revenir régulièrement pour télécharger la dernière version à jour.</p>\n<p>Dans tous les cas, je vous suis extrêmement reconnaissant de tout intérêt porté au jeu. N'hésitez pas à me faire des retours pour l'améliorer !</p>", "metacritic": null, "released": "2021-10-11", "tba": false, "updated": "2021-10-15T09:34:26", "background_image": "https://media.rawg.io/media/screenshots/a7f/a7f9d6572829f069743867c174b118fd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 41, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kaefer"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}