{"id": 679800, "slug": "cavaleiro-sanguinario", "name": "Cavaleiro Sanguinário", "name_original": "Cavaleiro Sanguinário", "description": "Sinopse:\r\n<p>Em uma expedição ao norte a cientista <em>Rose Barfastrod</em>, captada uma energia, que origina de uma caverna, ela acreditar se tratar de um dos Cristais Elementais. Inesperadamente ela e seus soldados achando um jovem congelado. </p>\n<p><em>Aaron Field</em>: um cavaleiro da Raça Sanguinária que no passado derrotou um Demônio Sanguinário.</p>\n<p>Nesta era...  <em>LordKed </em>vem conquistando território e devastando reinos, cabe a Rose e <em>Alan Hawley</em> a missão de encontrar os Cristais, afim de derrotar <em>LordKed</em>.</p>\n<p>Ela acredita que o poder extraordinário desse jovem, pode de ser de grande ajuda contra a ameaça Lordked... Que ela não sabe que este jovem trás com ele segredos e ameaças que podem acabar com o mundo. </p>\n<p>Inspirações em clássicos como final fantasy, chrono trigger, tales of phantasy, dragon quest... etcs</p>\n\n<p><strong>OBS:</strong> As imagens dos quadrinho é do tempo que ele foi feito no Rpg Maker Xp, então as imagens são baseadas no RTP dá época.</p>\n<p><strong>OBS2</strong>: É uma demonstração, não está tudo perfeito, ainda pode sofre modificações ao longo do tempo, o tempo de duração é aproximadamente de 5h.</p>\n<br/>\n<br/>\n<p>Abertura:</p>", "metacritic": null, "released": "2021-10-11", "tba": false, "updated": "2021-10-15T09:20:28", "background_image": "https://media.rawg.io/media/screenshots/204/204a2b39481e3f13beba7f68f65f9dcd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 63, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["cardrocha_rj"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}