{"id": 679847, "slug": "blueberry-astrid", "name": "Blueberry Astrid", "name_original": "Blueberry Astrid", "description": "<p><strong>Warning: Contains blueberry inflation fetish material, including optional popping.<br/></strong></p>\n<p>Hello again, and sorry for the hiatus this past month! Here's a mini-game commissioned by Timebrain (www.deviantart.com/timebrain) featuring Astrid from How to Train Your Dragon, made using art by freakinweirdo on DeviantArt. Check out his work at: https://www.deviantart.com/freakinweirdo<br/></p>\n<p>In this game, Astrid has already undergone a blueberry transformation, but still wants more. Click and drag the berries that grow around the screen to her mouth and she'll eat them, gradually swelling afterwards (sometimes the berries take a while to activate).</p>\n<p>There's a selection of voice samples in-game, so there's a separate toggle for them on the start screen and during gameplay. The popping toggle affects the gameplay, and can't be changed mid-game.</p>\n<p><em>Controls:</em><br/>R to restart<br/>Left mouse and hold on berry to drag it<br/>Left click on Astrid's belly to bounce it<br/>Hold right mouse on Astrid's belly to rub it<br/></p>\n<p>In-game, berries will gradually grow along certain spots on-screen. Larger berries will have a greater and longer-lasting effect, but waiting too long will cause them to fall. Clicking a berry will also drop the surrounding berries. Left-click and hold the mouse button to drag a berry to Astrid to cause growth. As she grows and when her belly is rubbed, cosmetic floating hearts will appear.</p>\n<p>When she's full, the berries will shrink away and stop appearing if popping is disabled, signalling the maximal size and end of the mini-game. If popping is enabled, instead there will be one or more creaking moments as she's fed berries, the last of which will cause a blue explosion and set her back to her starting size, allowing the mini-game to continue.</p><p>Thanks again to Timebrain for commissioning this mini-game (and being patient), to freakinweirdo for creating the artwork, and to everyone who's kept following my work despite the recent drought.<br/></p>", "metacritic": null, "released": "2021-10-11", "tba": false, "updated": "2021-10-15T09:30:33", "background_image": "https://media.rawg.io/media/screenshots/666/666d9306ac7a44523150ff4fe0450930.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 24, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Blunder Jub"], "genres": [], "publishers": [], "esrb_rating": null}