{"id": 679958, "slug": "kemada", "name": "Kemada", "name_original": "Kemada", "description": "Uma breve historia de jogo Queimada\r\n<p>Apesar da origem da queimada ser confusa, há relatos de que o esporte nasceu na Idade Média. Assim, no norte da Europa Meridional, no reino da Papônia, o rei Papus treinou seus soldados contra a invasão dos Bárbaros por meio de arremesso de bolas de fogo.</p>\n<p>Para brincar, é preciso dividir o grupo em dois times. O jogador que estiver com a bola deve arremessá-la tentando acertar (queimar) uma pessoa do outro time. Quem for queimado sai do jogo. Vence a equipe que conseguir queimar todo o time adversário primeiro.<br/></p>\n<p>Queimada (em Crioulo cabo-verdiano (escrito em ALUPEC): Kemada) é uma aldeia na ilha de São Nicolau de Cabo Verde.</p>\n<p>É um jogo de infancia de cabo verde que não é muito praticado hoje em dia também, é um jogo muito comum para fazer dinâmicas entre crianças e adolescente. A partida consiste em dois times, separados por uma linha de quadra, que tentam acertar os oponentes e retirá-los do jogo.</p>\r\nKemada\r\n<p>É um jogo baseado no jogo real Dodgeball  formado por dois times  onde o principal objetivo do jogo é acertar o oponente com a bola e evitar de ser atingido,  caso você seja acertado com a bola vai para o cemitério. O jogador que esta no cemitério também pode atingir o adversário com a bola.  É um jogo esportivo muito usado como brincadeira infantil.</p>\n<p>Cada personagem possui uma habilidade individual.</p>\n<p><strong>Regra do Jogo</strong></p>\n<p>• Jogador : No maximo de 8 jogadores, 4 de cada equipa; <br/>• Numero bola: 1 ou 2; <br/>• Tempo de jogo: 3 minutos de jogo; <br/>• Empate: Mais 30 segundos de morte súbita; <br/>• Vitória: O jogo será ganho por aquele que tiver mais jogadores em campo; <br/>• Cenário: Com o tempo o jogo mudara de cenário;                                                                              •Multijogadores: O jogo será para vários jogadores.</p>", "metacritic": null, "released": "2021-10-11", "tba": false, "updated": "2021-10-15T09:58:41", "background_image": "https://media.rawg.io/media/screenshots/e8e/e8e6caa23b4edff22bc1a3e3e3145ef6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 34, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["5Sharkcv"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}