{"id": 67990, "slug": "ballet-dancer-competition", "name": "Ballet Dancer Competition", "name_original": "Ballet Dancer Competition", "description": "Sunstorm is the pioneer of the popular \"Maker\" and \"Sunnyville\" series of games. Founded in 2009, Sunstorm provides creative and fun experiences for kids and parents to enjoy together. Sunstorm is a subsidiary of TabTale, a leading, global creator of innovative games, interactive books and educational apps.<br/>Visit us: http://www.tabtale.com/ <br/>Like us: http://www.facebook.com/TabTale<br/>Follow us:@Tabtale<br/>Watch us: http://www.youtube.com/iTabtale<br/><br/>CONTACT US <br/>Let us know what you think! Questions? Suggestions? Technical Support? Contact us 24/7 at WeCare@TabTale.com.<br/><br/><br/>FOR PARENTS<br/>The app is free to play but certain in-game items may require payment. You may restrict in-app purchases by disabling them on this device. Use of the app is subject to TabTale’s terms of Use: https://tabtale.com/terms-of-use/ . The app may include advertising for TabTale and certain third parties which will redirect users to our sites, apps or third-party sites. <br/><br/>TabTale is committed to protect its users’ privacy. The app may enable collection of limited user data by TabTale or its carefully selected providers (e.g. ad networks and analytics) for limited and lawful purposes (e.g. respond to support queries; maintain, analyze and improve the app’s features and services; serve contextual advertising). By downloading or using the app you accept TabTale’s Privacy Policy: https://tabtale.com/privacy-policy/  and permit such uses for users of your device. For more information please refer to our Privacy Policy.", "metacritic": null, "released": "2015-11-09", "tba": false, "updated": "2019-10-22T14:26:36", "background_image": "https://media.rawg.io/media/screenshots/b04/b04ef4fa4ef62148f5c5dffa6452f00b.jpg", "website": "https://tabtale.com/app/ballet-dancer/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 157, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sunstorm Interactive"], "genres": ["Simulation", "Sports"], "publishers": ["Sunstorm Interactive"], "esrb_rating": null}