{"id": 680065, "slug": "vhs-3", "name": "VHS", "name_original": "VHS", "description": "<p>Something Evil has arrived in the video store...<br />\nAbominations once confined to video store cassettes have escaped the tape and transformed into deadly reality. Experience pulse-pounding 4v1 combat amidst neon-soaked cinematic labyrinths where power shifts unpredictably between Good and Evil, but always ends in a fight-to-the-death climax fit for the silver screen.<br />\nMonsters follow a script that calls not only for death, but total domination. Be you the Werewolf-- brutal and swift, or the Dollmaster-- creeping and conniving, you are designed to feast on fear, terrorizing your teenage prey relentlessly.<br />\nTeens scramble to flip the script with weapons fueled by ancient Stigma-- Burn, Shock, Curse, and Purify-- that extinguish Evil. Blast monsters with a faceful of Flame and Fury, dish out a killer jolt from your Raygun or RC Flyer, swing Cursed Swords and cast curses, and harness the glory of a Holy Slingshot or Cross.<br />\nVHS bleeds 80s horror, and if you’re not careful, you will too.<br />\nFight Back or DieThe monsters of VHS are a tribute to over the top 80s horror where anything goes. From a classic Werewolf to the sinister Dollmaster, fight as a growing roster of grotesque, ferocious, and lethal creatures. As a Teen, craft and master a variety of single use and limited fuel weaponry for a shot at turning the tables on the monster. There is no escape, so you must fight to survive.<br />\nMovie MagicEach level is hand-crafted and designed for the ultimate cinematic showdown. Explore classic and fantastical cinematic locales, from decrepit hotels to top-secret research facilities.Hero’s JourneyEach character has a skill tree full of unique perks and custom cosmetics along their personal path to becoming the ultimate hero or villain.Celebrate CreativityShowcase your own style from head to toe in colorful costumes and vivid variants that celebrate the freedom of the 80’s video era. Become the ultimate Video Horror Society fan as you collect an entire shelf of movies full of challenges that reveal hidden lore and reward themed cosmetics. Free to PlayVHS is already yours to enjoy, so hop in!</p>", "metacritic": null, "released": "2022-07-18", "tba": false, "updated": "2023-07-29T14:52:28", "background_image": "https://media.rawg.io/media/screenshots/17d/17d2020ebf64730fc81db8c0a912fab8.jpg", "website": "https://www.vhsgame.com", "rating": 2.33, "rating_top": 1, "added_by_status": {"yet": 7, "owned": 234, "toplay": 3, "dropped": 8, "playing": 2}, "playtime": 2, "achievements_count": 0, "ratings_count": 9, "suggestions_count": 422, "game_series_count": 0, "reviews_count": 9, "platforms": ["PC"], "developers": ["Hellbent Games"], "genres": ["Action", "Indie"], "publishers": ["Hellbent Games"], "esrb_rating": null}