{"id": 680015, "slug": "the-last-defender-2d-shooter", "name": "The Last Defender (2D Shooter)", "name_original": "The Last Defender (2D Shooter)", "description": "<p>The work of Yurchenkov Vsevolod is a 2D shooter.</p>\n<p>Modifications:</p>\n<p>1) Added music of my own (sorry for the quality, this is the first time I did this, the very first melody was made for the main menu, the last one was for the second level, I think the difference is noticeable)</p>\n<p>2) The player's starship and all types of enemies have been repainted</p>\n<p>3) 2 levels - battles, 1 level - obstacle course.</p>\n<p>4) English (I apologize in advance, since the translation was carried out through Google Translator)</p>\n<p>5) Added titles, added buttons (try again, etc.)</p>\n<p>6) Added mini-plot</p>\n<p>7) All scenes have been decorated</p>\n<p>Perhaps these are not all modifications and I probably forgot something, I hope you like my ... \"creation\".</p>\n<p>Be sure to look at the \"Instructions\".</p>\n<p>I tried to fix all the bugs and so on, but most likely there is still something left.</p>\n<p>Please do not underestimate the points, because at my university the choice of subjects depends on this (if I have bad grades, I will not be able to choose subjects in the field of game development).</p>\n<p>Created by Vsevolod Yurchenkov, be healthy and hello to you from Russia;)<br/></p>\n<p>P.S.:</p>\n<p>For some reason, WebGL may not open in full screen mode. In this case, please download the attached files depending on your platform, because not in full screen mode it will be inconvenient to play + the interface and decorations on the edge are not visible. Sorry for the inconvenience, I first came across this (can anyone come across the same problem, can you tell me how it can be solved?).<br/></p>", "metacritic": null, "released": "2021-10-10", "tba": false, "updated": "2021-10-15T10:14:36", "background_image": "https://media.rawg.io/media/screenshots/9ab/9abbdef76998d8a61f2e5d37d2ed49c8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 122, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Web"], "developers": ["Vsevolod_Yurchenkov"], "genres": ["Action"], "publishers": [], "esrb_rating": null}