{"id": 680071, "slug": "halloween-stories-the-neglected-dead-collectors-ed", "name": "Halloween Stories: The Neglected Dead Collector's Edition", "name_original": "Halloween Stories: The Neglected Dead Collector's Edition", "description": "This Halloween, <strong>Elephant Games</strong> brings you the next eerie entry in the always entertaining Halloween Stories series!<br/><br/>The Myth Debunkers make it their business to travel the world exposing creepy myths and legends as the hoaxes that they truly are, but their confidence is shattered after a series of cases in locations around the world turn out to be more real than they ever expected! Can the team survive these living nightmares, and what will become of them if they do? Get ready for a truly chilling spooky season in this hair-raising Hidden-Object Puzzle Adventure game!<br/><br/>This is a special Collector's Edition release full of exclusive extras you won't find in the standard version. The Collector's Edition includes:<br/><br/>•\tPursue the legendary Mothman in the Bonus Chapter!<br/>•\tTons of collectible cards and puzzle pieces to find!<br/>•\tReplay your favorite scenes and mini-games to unlock unique achievements!<br/>•\tExclusive wallpaper, soundtrack, and more to keep the spirit of the season going after the game is done!<br/>•\tA strategy guide to help you stay on track!<br/><br/>This is a Hidden Object Puzzle Adventure game, meaning a specific genre of story-driven, point &amp; click adventures. Throughout the game, players are tasked to find a list of objects hidden within a particular scene, and to occasionally complete various mini-games/puzzles.", "metacritic": null, "released": "2021-10-15", "tba": false, "updated": "2021-10-18T02:38:30", "background_image": "https://media.rawg.io/media/screenshots/b10/b1042ddefbef923e9b828a443eff1418.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 525, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Elephant Games"], "genres": ["Adventure", "Casual"], "publishers": ["Big Fish Games"], "esrb_rating": null}