{"id": 680114, "slug": "number-match-logic-puzzle", "name": "Number Match - Logic Puzzle", "name_original": "Number Match - Logic Puzzle", "description": "Number Match is an addictive puzzle game with simple rules: match pairs and clear the board to succeed. Playing Number Match is a useful pastime for your brain. Train your logic and concentration skills, and try to beat your high score!<br/><br/>Try a mobile version of the pen and paper game from your childhood. Now you can take your number game with you wherever you go. Solving free Number Match puzzles on mobile is much easier than using a pencil and paper.<br/><br/>How to play:<br/><br/>• The goal is to clear the board.<br/>• Find pairs of equal numbers (1 and 1, 7 and 7) or pairs that add up to 10 (6 and 4, 8 and 2) on the number grid.<br/>• Tap on the numbers one by one to cross out them and get points.<br/>• You can connect pairs in adjacent horizontal, vertical and diagonal cells, as well as at the end of one line and the beginning of the next.<br/>• When you run out of moves, you can add extra lines with the remaining numbers to the bottom.<br/>• Speed up your progress with Hints if you are stuck.<br/>• You win after all numbers are removed from the number puzzle grid.<br/><br/>There are a lot of ways to solve the puzzle. But it’s not as easy as it seems. Tease your brain and get the engaging experience!<br/><br/>What you get:<br/><br/>• Easy to learn logic puzzle<br/>• Hours of gameplay for you to enjoy<br/>• Hints to help you reach the goal faster<br/>• No time limit, so no rush, just relax<br/>• New numbers game from a top developer!<br/><br/>Challenge your brain with Number Match puzzle and have fun! Play number game anywhere, anytime!", "metacritic": null, "released": "2021-10-11", "tba": false, "updated": "2021-10-18T03:12:35", "background_image": "https://media.rawg.io/media/screenshots/a52/a52bdb0dfb7a0d9727e28b3cb3f2c3f0_Lr67YXO.jpg", "website": "https://easybrain.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 24, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Easybrain"], "genres": ["Board Games", "Puzzle"], "publishers": ["EASYBRAIN"], "esrb_rating": "Teen"}