{"id": 680325, "slug": "blnd", "name": "bl:nd", "name_original": "bl:nd", "description": "<p>Yesh. Made this in a rush (less than an hour for everything!) because \r\n</p>\n<ol><li>jam ending\r\n</li><li>laptop dying\r\n</li><li>coffeeshop closing\r\n</li><li>I love dark, single-room games (so fucking much) \r\n</li></ol>\n<p>Even with a pinch for time i wanted to submit to this. not my best work at all. i didn't even really want to submit. but I really wanted to, because I love the quote \"The blind man, in the dark room, searching for the black cat that isn't there.\" I made another game-ish thing that was an adaptation of an older piece of mine (here, with the iris clawed out), here's an excerpt:\r\n</p>\r\nYou are the squish of mud between toes. Imagine: A small room where there is a water tank (empty), a synthetic plant (orchid), and window blinds blinding no window (drywall). Imagine the carpet, a thue-morse sequence of pixilated blues and greens and vermillions, imagine wiping your feet (muddy) on said carpet. So soft. So intentional. So William Carlos Williams being hungry and eating the plums.\r\n\r\n<p>But it didn't translate as well to twine as i'd've liked. so. \r\n</p>\n<p>TA-DA! Here this is. It is short and dumb but whatever. It's my second thing I've ever made using Twine 2! Which is so user-friendly it hurts. \r\n</p>\n<p>I'm sad I didn't have time to do more (Doors that lead back into the room! Windows that aren't windows! <em>In another dark or in the same another devising it all for company!)</em> but at least i got something in. Maybe better next time. \r\n</p>\n<p>The title glyph-play is from McKenna Nicole Leighton's ford &amp; sanchez st, published in shufPoetry issue 9 (it's also the first thing i've ever made in twine 2!).\r\n</p>", "metacritic": null, "released": "2021-10-17", "tba": false, "updated": "2021-10-18T04:10:32", "background_image": "https://media.rawg.io/media/screenshots/b58/b58ec9ae60170d0e2d46279e476e227f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 2, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["cacaos"], "genres": [], "publishers": [], "esrb_rating": null}