{"id": 680624, "slug": "manawar", "name": "ManaWar", "name_original": "ManaWar", "description": "<p>Mana War has entered Early Access!</p>\n<p>Mana War is an online turned based miniatures game where two teams compete to score victory points by using a customized group of Heroes to fight on the battlefield and capture objectives.</p>\n<p>This game consists of rounds which are divided into three phases: Movement Phase, Ability Phase, and Capture Phase. </p>\n<p>Teams take turns moving their heroes, fighting, and capturing objectives. </p>\n<p>Abilities and captures are attempted through an actual dice roll that is shown in game.</p>\n<p>Mana Crystals are placed throughout the battlefield, where Grunts and Heroes can be used to capture them. Mana Crystals are a resource each team can use to boost their Heroes' power.</p>\n<p>Players earn Mana Power by playing in online matches. Mana Power can be used to unlock new Heroes.</p>\n<p>Players can also purchase Gold that can be used to buy new Dice skins, Base skins, and Grunt models for their teams. Purchases help support the development of Mana War.</p>\n<p>To kick off Early Access, I have 20 Heroes available, 10 for the Savagery Faction and 10 for the Fellowship Faction. All players start with 5 unlocked Heroes for each of these Factions.</p>\n<p>This is just the beginning folks! The next thing on my list is to add 10 Heroes for the Shadow Faction and 10 Heroes for the Mayhem Faction. I will be adding nearly 100 Heroes to this game, with more game types and missions to play, and a 2v2 and 3v3 online PVP mode, and more! I will also be adding new skins for Dice, Bases, and Grunts. </p>\n<p>Gameplay is most important, and I am looking to build a community and use input from my players to help make this game the best it can be.</p>\n<p>Please join, subscribe, and follow Mana War social media so you can share your voice and opinions on this game.</p>\n<p>Discord:</p>\n<p>https://discord.gg/zreb8znRtV<br/></p>\n<p>Twitter:</p>\n<p>https://twitter.com/ManaWar98969030</p>\n<p>YouTube:</p>\n<p>https://www.youtube.com/channel/UCL07gHDoSlk3-6m2Gzs4C4g</p>\n\n<p>Want to play against the developer? Join the Discord to setup a time!<br/></p>", "metacritic": null, "released": "2021-10-17", "tba": false, "updated": "2021-10-18T05:19:59", "background_image": "https://media.rawg.io/media/screenshots/f0c/f0cb0d5e4d0b59fb9a7783b5b64ba0de.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 305, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Manawarstudios"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}