{"id": 680670, "slug": "matheus-costas-nightmare", "name": "Matheus Costa's Nightmare", "name_original": "Matheus Costa's Nightmare", "description": "<p>English: Matheus Costa's Nightmare is the Matheus Costa's horror/comedy game, Matheus is a brazillian influencer who pranks his father Seu Zé with grammar mistakes, and in this game the story is: Matheus decided to take his father's dog Lion to another place, he returns to his house and his father noticed that the dog wasn't there, his father doesn't liked that, and Matheus decided to take a nap, something strange is happening and to reveal the dog's story he will have to complete a goal.\r\n</p>\n<p>The game has 4 endings.\r\n</p>\n<p>This game has three languages support: English, Spanish and Portuguese. Any other language will be in english in the game.\r\n</p>\n<p>.\r\n</p>\n<p>Português: Matheus Costa's Nightmare é o jogo de terror/comédia do Matheus Costa, Matheus é um influenciador brasileiro que brinca com seu pai Seu Zé com erros de português, e neste jogo a história é: Matheus decidiu levar o cachorro de seu pai Lion para outro lugar, ele volta para sua casa e seu pai percebeu que o cachorro não estava lá, seu pai não gostou disso, e Matheus resolveu tirar uma soneca, algo estranho está acontecendo e para revelar a história do cachorro ele terá que cumprir um objetivo.\r\n</p>\n<p>O jogo tem 4 finais.\r\n</p>\n<p>Este jogo tem suporte para três idiomas: Inglês, Espanhol e Português. Qualquer outro idioma será em inglês no jogo.\r\n</p>\n<p>.\r\n</p>\n<p>Español: Matheus Costa's Nightmare es el juego de terror/comedia de Matheus Costa, Matheus es un influencer brasileño que le hace bromas a su padre Seu Zé con errores gramaticales, y en este juego la historia es: Matheus decidió llevar al perro de su padre, Lion, a otro lugar, él regresa a su casa y su padre notó que el perro no estaba, a su padre no le gustó, y Matheus decidió tomar una siesta, algo extraño está sucediendo y para revelar la historia del perro tendrá que cumplir una meta.\r\n</p>\n<p>El juego tiene 4 finales.\r\n</p>\n<p>Este juego tiene soporte en tres idiomas: inglés, español y portugués. Cualquier otro idioma estará en inglés en el juego.\r\n</p>\n<p>.\r\n</p>\n<p>Drines' Instagram: https://www.instagram.com/drines_evandrines/\r\n</p>\n<p>Matheus Costa's Youtube channel: https://www.youtube.com/channel/UCq2TEI7fzjOAuPmA_50Po8g\r\n</p>", "metacritic": null, "released": "2021-10-17", "tba": false, "updated": "2021-10-18T05:30:54", "background_image": "https://media.rawg.io/media/screenshots/dd8/dd80234c4d63fd9982a6e79a89ddfafd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 77, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Drines"], "genres": [], "publishers": [], "esrb_rating": null}