{"id": 680967, "slug": "through-tears-steel", "name": "Through Tears & Steel", "name_original": "Through Tears & Steel", "description": "<p><strong>Written in 24hrs to celebrate #FreeRPGday 2021</strong>Through Tears &amp; Steel is a two person tabletop role playing game about the co-pilots of a mech navigating their budding relationship set amidst the backdrop of a major war. Players work together to highlight both the moments of care and affection that bring the characters together and their tense struggles as the war threatens to tear them apart. The ultimate goal is bring the relationship and the war to its conclusion, whether it be via medium of final victory and retirement or something a little more sombre and bittersweet. <br/><br/><strong>What you Need to Play: <br/>- A Piece of Paper and a Pencil. <br/>- A collection of six sided dice in two colours.</strong><strong><strong><br/>- Two People</strong></strong>.<br/><strong>- The PDF below or the instructions to your right &gt;&gt;&gt;&gt;&gt;&gt;&gt;</strong><br/><br/><strong>What kind of Relationship?: </strong>The exact nature of the characters relationship and its development is entirely up to the players, you could end up as lovers, romantic partners, squishes or maybe even just closely bonded friends, we’re not judging.   </p>\n<p><strong>What Kind of Mechs are we Talking?</strong>: The kind of mech you and your co-pilot operate should be discussed in detail and will set the tone for the warfare aspects of the game. You are welcome to build whatever kind of mech you wish but here are a d6 worth of handy examples:\r\n <strong><em><br/><br/>1-Steampunk</em></strong> giants with smokestacks, boilers, gears and brass. Perfect for fighting amidst the trenches or engaging in daring skirmishes as you attempt to free your small homeland from the clutches of its oppressive occupiers.\r\n <strong><em><br/><br/>2-Post Apocalyptic</em></strong> mechs built from scrap metal and rusted parts. Built to survive the harsh territorial skirmishes of the wasteland or for raiding the guarded utopian bastions that have denied people like you a normal life. <br/><br/> <strong><em>3-Pristine Sci-Fi</em></strong> mechs with shiny control panels, perfect for space warfare and fighting back against a rapidly expanding evil empire from beyond the periphery of space!  <strong><em><br/><br/>4-Magical Mechs</em></strong> with living computers, be them plants or some kind of magical soul battling neighbouring kingdoms or leading the revolution against a corrupt monarch.\r\n <strong><em><br/><br/>5-Divine Mechs</em></strong> blessed by the gods of this world and branded with holy symbols for doing battle with demons, literal or ideological.  \r\n <strong><em><br/><br/>6-Dieselpunk Mechs,</em></strong> possibly even massive quadrupeds with turrets, visible rivets and fume funnels leading the charge in a pseudo first world war.    <br/><br/></p>", "metacritic": null, "released": "2021-10-16", "tba": false, "updated": "2021-10-18T06:41:15", "background_image": "https://media.rawg.io/media/screenshots/8cc/8cc67ba232be0493685cb9469423076d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 69, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Hecate Rose"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}