{"id": 68104, "slug": "zombie-road-trip-trials", "name": "Zombie Road Trip Trials", "name_original": "Zombie Road Trip Trials", "description": "The hit game Zombie Road Trip is back with an all NEW trials spin off! Hundreds of extreme missions await you and your friends in this fun filled and action packed physics game. Show off your driving, shooting, flipping, racing and zombie smashing skills in this awesome spin on the classic trials genre!<br/><br/>Choose from an arsenal of guns to dispatch zombies roaming the wastelands. Watch them get dismembered thanks to our realistic rag-doll physics. Your garage is packed full of different vehicles that you can buy, upgrade and even repaint to your liking. Each vehicle is unique in both how it drives and looks.<br/><br/>Compete with your friends and thousands of players in the turn-based multiplayer mode for both money and fame. Race your Facebook friends and show them who is the boss! Not keen on using your Facebook ID? Well there is a guest mode awaiting as well.<br/><br/>ZRT: Trials lets you race, climb hills and shoot zombies across a variety of awesome post apocalyptic landscapes ranging from desolate deserts to destroyed cites and more.<br/><br/>Zombie Road Trip Trials features:<br/><br/>- 480 physics based missions<br/>- 10+ hours of single player<br/>- zombies with realistic rag doll physics<br/>- cross platform multiplayer<br/>- lots of upgradable cars and weapons<br/><br/>iOS exclusive features:<br/><br/>- Game Center - Earn achievements and compete with people around the world for top leader board spots<br/>- iCloud - Your garage purchases are now kept in the cloud and you never lose your cars again!", "metacritic": null, "released": "2014-05-07", "tba": false, "updated": "2019-10-22T14:26:38", "background_image": "https://media.rawg.io/media/screenshots/f88/f88b27d889fa539f48da57975ffe55ab.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 297, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Noodlecake Studios"], "genres": ["Racing", "Arcade"], "publishers": ["Noodlecake Studios"], "esrb_rating": null}