{"id": 68101, "slug": "christmas-kids-new-puppy-boys-girls-spa-games", "name": "Christmas Kids New Puppy - Boys & Girls Spa Games", "name_original": "Christmas Kids New Puppy - Boys & Girls Spa Games", "description": "Surprise! How adorable! A new baby puppy for Christmas! You need to take take of the cutest Pomeranian pet pup around. Play interactive activities, care for the puppy at the nursery and more! Bark!<br/><br/>Level 1 : It's time to eat! Feed the cute new puppy and give a milk-bottle! Eat baby pet food and then have a dog treat! Don't forget to add the Christmas hat!<br/><br/>Level 2 : Care for the new baby puppy in the Christmas nursery room! Change diaper, add little puppy socks, add lotion give a binkie and play with pet toys!<br/><br/>Level 3 : The puppy was playing outside and got muddy! Give the puppy a bath and clean-up!! Use the soapy sponge to remove dirt, apply shampoo to the hair and brush the messy dog hair!<br/><br/>Wash off the soap and dirt with water sprayer. Then dry off with the towel. Don't forget to brush little pet teeth with the toothbrush!<br/><br/>Level 4 : Play with toys in the Christmas tree room! Play with a play, rattle, binkie and more! Use the pet vacuum to clean up the dirty floor!<br/><br/>Level 5 : The puppy is hungry - Help set the table! Place the bib, flowers, bowl and milk! What a cute puppy!<br/><br/>*Level 6 : The puppy is tired from playing and eating! It is pet nap time. Help the puppy fall asleep by giving milk, a toy doll and binkie. Then play music and place the nightlight so the puppy will have a good night sleep!<br/><br/>*Level 7 : Oh no! The puppy was playing outside and made a mess in the living room! Help clean off the snow from the puppy, vacuum the Christmas room, play with a rattle and hang up the picture frame!<br/><br/>*Level 8 : It's time for a car ride with the puppy! Help the pet puppy get ready. Clean up the car seat, give a milk-bottle, puppy hat, binkie and toys!<br/><br/>*Please note that levels 6-8 must be purchased separately.<br/>*Please note that Pet Puppy Nursery Time is free to play, but you are able to purchase game items and remove ads with real money. If you don’t want to use this feature, please disable in-app purchases.* <br/><br/>Kids Games Studio is very concerned about our users' privacy. To understand our policies and obligations, please read our Terms Of Service and Privacy Policy carefully. <br/><br/>Terms Of Service: http://www.kidsgamesstudio.com/tos <br/>Privacy Policy:<br/>http://www.kidsgamesstudio.com/privacy", "metacritic": null, "released": "2016-12-23", "tba": false, "updated": "2019-06-14T02:07:20", "background_image": "https://media.rawg.io/media/screenshots/f2e/f2e9707ea943aa1d5ffcaf1c6f9f302a_e4n27N1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 89, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Kids Games Studios"], "genres": ["RPG", "Family"], "publishers": ["Kids Games Studio"], "esrb_rating": null}