{"id": 681285, "slug": "the-spirited-rise-of-the-raga-1", "name": "The Spirited - Rise of the Raga 1", "name_original": "The Spirited - Rise of the Raga 1", "description": "<p>You have been summoned ! Rise and become the supernatural spirit, explore the depths of the Mystical Labyrinth of Ahantha and acquire the energy of Raga before it is too late.</p>\n\r\nExplore the secret powers\r\nExplore the secret powers that can aid you on your journey and progress deeper into the ethereal realm.\r\n\r\n\r\n\r\nTransform surroundings\r\n<p>Transform the sections of the Mystical Labyrinth to your advantage so you find your path and never get trapped. \r\n</p>\n\r\nPower Grabbers Alert\r\n<p>Beware of power grabbers that steal your light, warmth, or other energies. \r\n</p>\n\r\n3D sounds and OST\r\nAn immersive audio experience is provided by ambient sounds, original music, and positional audio. Use headphones for the best experience.  \r\n<br/>\n<br/>\r\nRealistic 3D rendered environments \r\nAll environments are rendered with physically based shading, lighting and atmospheric effects to provide the best experience of Earth's unearthly dimension.\r\n\n\n<br/>\n\r\nThe Legend of the Spirited\r\n<p>Life is a movement of eternal energy. While some energies emerge as life, others emerge in time and space in order to maintain balance. A group of galactic protectors arise as these energies emerge, to keep them from falling into the wrong hands. These Protectors have the power of transcending their bodies. When the time comes, they transform into spirits and travel to the mystical regions to obtain the energy that has manifested.\r\n</p>\n\r\nGame Controls\r\n<br/>\n<br/>", "metacritic": null, "released": "2021-10-15", "tba": false, "updated": "2021-10-18T08:02:00", "background_image": "https://media.rawg.io/media/screenshots/209/209da4129a965caffdb0a7400c18f03f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 255, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["Macrobeing"], "genres": ["Adventure", "RPG", "Puzzle"], "publishers": [], "esrb_rating": null}