{"id": 681451, "slug": "sprite-fantasia", "name": "Sprite Fantasia", "name_original": "Sprite Fantasia", "description": "The sequel to the classic \"Grand Fantasia Online\", a 3D adventure MMORPG full of love and friendship, with unique warm and cute \" sprite \" pets and a hilarious plot, in a fantasy world full of fairy tales. Start a relaxing and relieving fun journey!<br/><br/>[Explore the fantasy world]<br/>Enter the mysterious and magical continent of Saphael, where mountains, plains, rivers and lakes are everywhere, and the adventure is no longer boring. You will travel around as a Sprite messenger and lead the Sprites to fight against the alien civilization together.<br/><br/>[Cute Sprite, Personal Protection]<br/>The Sprite is a unique magical creature in the Saphael continent, always affectionately calling the Sprite messenger \"master\", and always follows the master everywhere with its different personalities such as quirky, arrogant and optimistic under a cute appearance.<br/><br/>[Strategic Teaming, Extreme Control]<br/>Build a super Sprite Fantasia team, equip the sprites with different memory cards, and cast various skills to defeat the enemy! Defeat a boss with thousands of strategies. Multiple skill characteristics such as powerful damage, defense recovery on the messenger, providing a variety of enhancements to conquer the deficits.<br/><br/>[Dream Island, Personalized Life]<br/>Become the master of an island, you'll decide the operation and layout! Full 3D island scenery. Through the workshop, you can make various types of furniture, designing your own exclusive island, but also can send elves to run errands, collecting or making powerful and fashion equipment, all handmade.<br/><br/>[Various outfits in one book collection]<br/>In the world of Saphael, there are many stories that adventurers will enjoy. Through the system of battles, quests, books and elven islands, the records of filling up the collection step by step will bring the character to grow continuously, and at the same time, you can obtain more than a hundred sets of outfits!", "metacritic": null, "released": "2021-10-17", "tba": false, "updated": "2021-10-29T04:47:25", "background_image": "https://media.rawg.io/media/screenshots/d01/d0185127452a99f1338cf3b9d5d5a243.jpg", "website": "https://www.x-legend.com/spritefantasia", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 49, "dropped": 1}, "playtime": 2, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 315, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "iOS"], "developers": ["X-Legend Entertainment Co"], "genres": ["Action", "Adventure", "RPG", "Massively Multiplayer"], "publishers": ["X-Legend Entertainment Co"], "esrb_rating": "Teen"}