{"id": 6814, "slug": "puncho-fighto", "name": "Puncho Fighto", "name_original": "Puncho Fighto", "description": "Puncho Fighto is classic 2D fighting reimagined for the touch screen.  <br/><br/>Moves are performed by tapping and swiping on the screen.  Special moves are two-part swipes; i.e., swiping down and then towards your opponent will perform Zong&amp;#39;s fireball.  You&amp;#39;ll get the hang of it fast - it&amp;#39;s a cool alternative to on-screen buttons and it feels natural with a little practice.  Check the move lists in the help menu for details.<br/><br/>Although it&amp;#39;s not as sophisticated as some modern fighting games, Puncho was made with love and is unique enough to keep you interested for a while.<br/><br/>There are three gameplay modes: <br/><br/>1. Story mode - a single-player battle versus 5 opponents with 5 AI difficulty levels<br/><br/>2. Two-player mode - play against a friend on the same device using split-screen (works best on iPad)<br/><br/>3. Online mode - use game center to play against anyone in the world<br/><br/>Note: The character story lines will probably never be finished - sorry!<br/><br/>Note 2: Online multiplayer works well on a fast connection but should be considered in beta otherwise.<br/><br/>Note 3: The game now uses analytics to track a small amount of anonymous data - basically just so I can tell how many people are playing.<br/><br/>Note 4: Puncho Fighto is now a free, ad supported game!  If you paid for the game, you can disable ads for free - please email support@punchofighto.com to find out how.  OR disable ads for $0.99 in the Options menu!<br/><br/>Thanks to everybody who has downloaded, reviewed and even paid for my game!", "metacritic": null, "released": "2012-04-02", "tba": false, "updated": "2019-10-22T14:29:01", "background_image": "https://media.rawg.io/media/screenshots/6aa/6aaa50acd7e235a3245e732fdaa7aa67.jpeg", "website": "http://punchofighto.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 123, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Creative Submersible Research"], "genres": ["Action", "Arcade"], "publishers": ["Oliver Smith"], "esrb_rating": "Teen"}