{"id": 681442, "slug": "always-the-same-nightmare-2", "name": "Always The Same Nightmare", "name_original": "Always The Same Nightmare", "description": "<strong>Try, Die, Learn and Retry! This is the ultimate challenge, escape the nightmare!</strong><h3>Story</h3>Number 42 found himself trapped within the walls of a dark and perilous dungeon. He didn't know where he was, but he knew he had to escape. However, just as he was about to break out, he found himself surrounded by mysterious enemies. Despite his best efforts, he was swiftly defeated and killed. To an ordinary person death is the end, but to Number 42, it was only the beginning.<br/><br/>As he died, something strange happened. Time itself began shifting, and he found himself back in the dungeon, alive once more. He didn't know how nor why he was confined to this place, or how he was alive, but he was certain of one thing: he could escape. Even in death he could try again and find his way out of this place!<h3> Let's begin the escape!</h3><h3>Main Features</h3><ul><li> Intense, dynamic and high speed gameplay<br/></li><li> Become strong by defeating monsters and customize your weapons<br/></li><li> Over 40 handcrafted levels with 5 powerful bosses<br/></li><li> Deploy your own checkpoints and manipulate time itself<br/></li><li> Show off your skills and fly through levels as fast as you can!</li></ul><h3>Gameplay</h3><ul><li> With each death, you can turn back time: use your mistakes to learn and gain an advantage! Place your own checkpoints throughout the level!<br/></li><li> Having trouble going down one path? Freeze time and become invincible! Is a boss too strong? Kill monsters and upgrade your equipment!<br/></li><li> A boss is too strong? Farm monsters in the previous levels and upgrade your weapons!<br/></li><li> Monsters can drop various upgrades like a triple jump, stat booster, shield, or even a triple shot!</li></ul>", "metacritic": null, "released": "2021-10-18", "tba": false, "updated": "2021-10-22T02:51:55", "background_image": "https://media.rawg.io/media/screenshots/5e0/5e077745d3cd21b29877a6297dd68832.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 216, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["DreamVeloper Studio"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["DreamVeloper Studio"], "esrb_rating": null}