{"id": 681497, "slug": "dreamland-prison", "name": "Dreamland Prison", "name_original": "Dreamland Prison", "description": "Dreamland Prison is an action RPG slasher game with dynamic combat. You play as Ares the young man who get's involved in demons game. Your main goal is to destroy Leviathan's strongest servant Archdemon, only by doing it you can save hundreds of people in white sleep.<h3>Story</h3>A mysterious disease - white sleep takes place in the Arai city. People suffering from it fall into a deep coma and a mysterious birthmark appears on their hands. Several days after the first case of the disease, hundreds of sick people die simultaneously in one evening. After this event, more people get sick the very next day, including mother of our main character - Ares. During a visit to his mother in the hospital, Ares falls asleep. He awakens in front of a powerful being - Beliar.  The demon explains to Ares that he became his player in the game against the second gamemaster Leviathan. To save his mother and hundreds of people in white sleep Ares must win the demonic game.<br/><br/><h3>Combat</h3>We chose a combat system in which all attacks are area of ​​effect, thanks to which we can simultaneously slaughter hordes of enemies. As you play you need to avoiding monsters area attacks as well. The fight will become more and more spectacular and interesting as our character grow. Stronger enemies will have more and more deadly skills.<br/><br/><h3>Key features</h3><ul><li> Fictionalized quests and captivating story<br/>Play as Ares and sink in an immersive world full of dozens of different tasks.<br/><br/></li><li> Get into a conflict of interest<br/>Two demons are playing with your world - are you able to survive their demonic game?<br/><br/></li><li> Takeover the power of Ezares<br/>Explore a beautiful handcrafted world!<br/><br/></li><li> Deep character development<br/>Strengthen your character with attribute points, choose from a wide range of skills and face hordes of enemies.<br/><br/></li><li> Hundreds of items ready to be equipped<br/>Equip your character with legendary item sets and take on Leviathan's most powerful creation.</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2021-10-22T03:33:25", "background_image": "https://media.rawg.io/media/screenshots/baa/baaafca9617811b10fce3c03b30c0dc6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 306, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Laughing fox games"], "genres": ["Action", "RPG"], "publishers": ["Laughing fox games"], "esrb_rating": null}