{"id": 681527, "slug": "warlocks-entanglement", "name": "Warlocks Entanglement", "name_original": "Warlocks Entanglement", "description": "Warlocks Entanglement puts you into a destructible open world in a magical medieval setting.  Explore and learn all this world has to offer and then open a gateway to the next world!.<br/><br/><ul><li><h3>Destructible environment</h3>  Destroy anything see you see and build something new with the resources. <br/></li><li><h3>Combat</h3> Fight a variety of different creatures with various weapons that you can either find from looting or craft yourself as you learn.<br/></li><li><h3>Day and night cycles</h3> Craft torches to provide you light or enchant one of your weapons with radiance to help you see in the dark,  You can carry torches in both hands giving much more visibility in dark places.<br/></li><li><h3>Looting and exploring</h3>  There are many locations to loot but as you exhaust areas you must start heading further afield to find what your looking for.<br/></li><li><h3>Base building</h3> You can occupy a house and convert it to your own requirements or build one from scratch, there are many different resources around that you can utilise to aid you in this.<br/></li><li><h3>Levelling</h3>  As you gain experience create more advanced high tier weapons / bows and armour.<br/></li><li><h3>Gardening</h3> You can create or loot seeds and plant them to grow crops, Cross contaminating some crops can cause more exotic and useful plants to grow,  You can learn the secret to this as you go.<br/></li><li><h3>Brew potions</h3> As your cauldron grows stronger with the ingredients it needs you will be able to brew more powerful potions, Providing an array of additional skills to aid you.<br/></li><li><h3>Delving deep underground</h3> There are many chasms that open up to underground tunnels and sometimes cities,  There are many precious recourses to loot and mine underground<br/></li><li><h3>Many Worlds</h3> Play the pre-selected map or a randomly generated world.   </li></ul>", "metacritic": null, "released": "2021-10-21", "tba": false, "updated": "2021-10-22T03:56:53", "background_image": "https://media.rawg.io/media/screenshots/efb/efb3a7e66f24f451af997caa636d0130.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 39, "ratings_count": 0, "suggestions_count": 280, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Sub Orbital Software"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Sub Orbital Software"], "esrb_rating": null}