{"id": 681564, "slug": "touhou-adventure", "name": "Touhou Adventure", "name_original": "Touhou Adventure", "description": "Touhou Adventure takes place in the land of Gensokyo, a super natural realm made of magic.<br/><br/>Dangerous youkais dwells the infamous places of Gensokyo, prepare yourself to fight, train, become stronger!<br/><br/>But fear not! you can be helped by various inhabitants of this mysterious land, sells, buy stuff and become richer!<br/><br/>In this game you can<br/><ul><li>Craft<br/></li><li>Plant and plow<br/></li><li>Shoot<br/></li><li>Talk to people<br/></li><li>Sell and buy<br/></li><li>Travel</li></ul><h3>Crafting</h3>Crafting lets you build various objects, such as bullets and pellets, by adding various object in the correct order on the crafting grid, you can a new item out of it, which can be sold or bought.<h3>Plant and plow</h3>A core mechanic of the game, where you can plow your fields, plant crops and harvest these crops, but you need to know that you can't plow everywhere, only where the player reside can the land be plowed, see it as convenient farming, where you don't need to travel a lot to get your crops done.<br/><br/>Off course crops can be sold and bought.<h3>Shoot</h3>Another core mechanic of the game, since it is based on bullet hell.<br/><br/>You can shoot any bullet you have on your inventory by equipping them on the hotbar, then pressing on the numbers from 1 to 9. <br/>You don't actually kill enemies, they always respawn at some point, they just get too tired to fight and disappear, every enemies drops a coin when defeated, coins are useful for trading!<h3>Talk to people</h3><br/>As the land is full with a bit of everything, including NPC, you can interact with them, by click E when closed to it. Some off the NPC might have things to sell, or  important piece for the lore, it's up to you to talk to them, embark a journey of wonders!<h3>Sell and buy</h3><br/>Money is important to anyone in anywhere, even in Gensokyo! Why not trading then ? Sometimes you can't find an item you want, or maybe it's too hard to get it.<br/><br/>Well then money is the way to go ! Each coin is 1 amount of money, but use it wisely! Most of the shops are in the human village for now<h3>Travel</h3><br/>The playable will be huge! But for now it's way smaller, but even that, there is still a lot to explore, NPC are scattered around the map, they might have important things to say, who knows...<br/><br/>Each bit of the map is unique, having points of interest, and based from the original franchise, if you're a Touhou fan, you might enjoy these little things<h3>Controls</h3><br/>\"WASD\" is for moving<br/>\"LMB\" for shooting<br/><br/>\"RMB\" for using tools<br/>\"SHIFT\" for going slower<br/>\"E\" is for interacting<br/>\"B\"  for brining the inventory<br/>\"X\" is for bombs<br/>\"R\" is for getting back the catch(when fishing)<br/>\"C\" for bringing  the crafting menu", "metacritic": null, "released": "2021-10-20", "tba": false, "updated": "2021-10-22T04:23:31", "background_image": "https://media.rawg.io/media/screenshots/140/1405be41cdcc5909aec6c4c41e286212.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 60, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Crimson Games"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Crimson Games"], "esrb_rating": null}