{"id": 681543, "slug": "house-of-sin", "name": "House of Sin", "name_original": "House of Sin", "description": "House of Sin will lead you down a sensual descent into the world of legendary naughty fantasies.<br/>Play as the mischievous Eros, a wicked seducer, and let yourself be enveloped by the endless pleasures this game has to offer.<br/><br/>If you’ve ever dreamed about what a threesome with ancient Greek goddesses Aphrodite and Athena would be like, now’s your chance to engage in some very steamy adventures! <br/>And don’t worry - ancient Greece is not the only sinful realm you can visit. We won’t spoil it for you, but stay tuned for upcoming updates!<br/><br/><br/><br/>As an idle clicker with fantastic storytelling mechanics, House of Sin becomes more and more captivating the deeper you venture into its plot.<br/>The erotic storytelling sim aspect of it will have you immersed in the lewd stories of all the historical characters, and the accompanying artwork will have Hentai and Western style fans alike mesmerized. <br/><br/>Don’t keep these passionate women waiting for you, come inside and discover all their seductive secrets!<br/><br/><br/><br/><ul><li>Enjoy dozens of animated orgies featuring the mythical main characters of the game!<br/></li><li>Meet and seduce tons of gorgeous legendary beauties! <br/><br/><br/><br/></li><li>Explore 3 main locations: Greece, the Northern lands and the Near East!<br/></li><li>Feast your eyes on more than 50 high quality erotic images that will leave you panting!<br/><br/><br/><br/></li><li>Discover and live out more than 50 naughty stories!<br/></li><li>Indulge into all kinds of kinks: lesbian, bdsm, oral, anal, toys, group sex, public and much more!</li></ul>", "metacritic": null, "released": "2021-10-21", "tba": false, "updated": "2022-08-30T14:41:50", "background_image": "https://media.rawg.io/media/screenshots/1d2/1d2b87ba44913b49329eb62d1b4e4796.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 97, "toplay": 1, "dropped": 1}, "playtime": 3, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 393, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Volcano Games"], "genres": ["Casual", "Indie"], "publishers": ["Nutaku Publishing"], "esrb_rating": null}