{"id": 681552, "slug": "slime-factory-2", "name": "Slime Factory", "name_original": "Slime Factory", "description": "<strong>Slime Factory</strong> - is a game in which you have to develop your factory for breeding Slimes. Manage resources and construction, unlock new types of buildings and explore a variety of biomes in an open world. And also find different characters to help with improving your farm. <br/><br/><ul><li><strong>IN ORDER TO IMPROVE YOUR FARM</strong> and increase income, discover and create new devices for processing materials, combine different types of found resources, build better pens, and also monitor the condition of Slimes and meet their needs.<br/><br/><br/><br/></li><li> <strong>DISCOVER</strong> a variety of locations and places, explore a variety of biomes that contain useful resources, interesting secrets, and of course the different types of Slimes.<br/>Also improve your robot helper, and explore new places to expand your dream farm!<br/><br/><br/><br/></li><li><strong>FIND</strong> new types of pets that will increase your income and give you useful resources. Also find merchants and characters to help you develop and improve your factory!<br/><br/><br/><br/></li><li><strong>But not everyone is satisfied with this alignment ...</strong> Lord Dark Head wants to destroy your farm, so he sends his subjects to destroy your factory at night. Defend yourself and upgrade your cannon to confront him and get to his lair.<br/><br/><br/><br/></li></ul><h3>Key Features:</h3><ul><li><strong>Open World:</strong> Explore different biomes with unique types of pets and various interesting things!<br/></li><li><strong>Build and improve</strong> various devices to improve your factories and create various new resources<br/></li><li><strong>Modify and improve</strong> your cannon, as well as various robotic helpers<br/></li><li><strong>Find</strong> the most profitable merchants and different characters, hire staff to make it easier to maintain the farm<br/></li><li><strong>Defend</strong> your farm and defeat the Lord Dark Head!</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2021-10-22T04:16:00", "background_image": "https://media.rawg.io/media/screenshots/291/291c9e38e0cfba9950311831bb5afdbb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 319, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Blue Stone"], "genres": ["Adventure", "Simulation", "Indie"], "publishers": ["Blue Stone"], "esrb_rating": null}