{"id": 681563, "slug": "the-alchemist-shop-an-apprentices-life", "name": "The Alchemist Shop: An Apprentice's Life", "name_original": "The Alchemist Shop: An Apprentice's Life", "description": "The Alchemist Shop: An Apprentice's Life is a game that mixes <strong>Visual Novel</strong> and <strong>Solitaire</strong>. You play as Faih, a young alchemist that just managed to be hired by Arcani, the owner of the <strong>BEST Alchemist Shop</strong> of the continent. You will be in charge of the shop for 15 days and must deliver the best <strong>potions </strong>possible if you want to keep your job. Are you up to the task?<h3>How To Play</h3><h3>Listen to your master!</h3><br/>Arcani is here to guide you and make sure you do not get into trouble! I mean, in theory...<br/><br/><h3>Solitaire</h3><br/>You have to manage a board full of cards using a solitaire-like mechanic. You can only move a card on top of another with a value lower than theirs.<br/><br/><h3>Create Potions</h3><br/>Find the right ingredients among the cards you have and place them on the slots at the middle of the table to create a potion!<br/><br/><h3>How to know the right recipe?</h3><br/>Make sure to check the right ingredients required to complete the order! If you don't remember the recipe, do not worry! Faih is an organized person, he keeps a note for all recipes!<br/><br/><h3>Time Limit</h3><br/>Time sure flies by when you're having a good time. Be aware of the time, you need to finish all recipes by the end of the day! Or else...<br/><br/><h3>Key Features </h3><br/>- Enjoy this different approach to a <strong>Solitaire </strong>game! Challenge yourself to find the right <strong>ingredients </strong>to complete your <strong>orders</strong>!<br/><br/>- <strong>Game Story</strong>: Succeed in 15 different challenges and dive into the story of the young Alchemist apprentice! Be aware, your <strong>choices </strong>will shape your destiny!<br/><br/>- A beautiful and <strong>original soundtrack</strong> will make you feel as you're the alchemist apprentice yourself!<br/><br/>- Enjoy the company of<strong> Faih and Arcani</strong>, they are excited to spend some time with you!", "metacritic": null, "released": null, "tba": false, "updated": "2021-10-22T04:23:00", "background_image": "https://media.rawg.io/media/screenshots/b6d/b6dfc09bdb3c6eb167caafb0e2c2f7e6.jpg", "website": "https://www.instagram.com/lumo_entertainment/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 153, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Lumo Entertainment"], "genres": ["Strategy", "Indie"], "publishers": ["Lumo Entertainment"], "esrb_rating": null}