{"id": 681541, "slug": "speed-mazing", "name": "Speed Mazing", "name_original": "Speed Mazing", "description": "<strong>Speed Mazing</strong> will have you and your friends run carelessly through a maze full of dangerous spikes!<h3>Ideal party game!</h3>For up to 4 players at a time. <strong>Speed Mazing</strong> is amazingly accessible for all players. Rules are easy to pick up and controls are very simple. The matches will keep you on your toes, though. Get ready for some seriously exciting battles! Per-player handicap settings allow you to balance players with different skill levels.<br/><br/><h3>Perfect game to play with your kids!</h3><strong>Speed Mazing</strong> lets you easily cheat your kids into thinking they are better players than you! Falling off the ledge is a common thing here, so your kids won't even notice you doing it on purpose to let them win. Tested to work with kids up to 8 years old. It makes for a wonderful parent-child time &lt;3<br/><br/><h3>Challenging and addictive speed runs for single player!</h3>While <strong>Speed Mazing</strong> is a great party game, it also includes an equally challenging as rewarding Time Trial mode. Play on a handful of stages with varying complexity. Learn all the routes, choose the optimal path and perfectly execute your run. Take the risk by cutting corners and collect time bonuses to beat your best results and reach the top of the Leaderboards.<h3>Game Features</h3><ul><li>Hundreds of interesting and competitive maps divided into 5 diverse environments.<br/></li><li>Beautiful graphics, catchy music and impactful effects.<br/></li><li>Thrilling battles for 2 - 4 players on a shared screen.<br/></li><li>Challenging Time Trial mode for single player with specially crafted courses.<br/></li><li>Decent amount of Achievements to unlock and Leaderboards to conquer.</li></ul>", "metacritic": null, "released": "2021-10-21", "tba": false, "updated": "2021-10-22T04:07:15", "background_image": "https://media.rawg.io/media/screenshots/9ed/9ed085e69566aa9b179830235ffd7aad.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 28, "ratings_count": 0, "suggestions_count": 124, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Piotr Zurek", "Łukasz Leszczuk"], "genres": ["Sports", "Racing", "Casual", "Indie"], "publishers": ["Infinite Dreams"], "esrb_rating": null}