{"id": 681514, "slug": "inquisitors-heart-and-soul", "name": "Inquisitor’s Heart and Soul", "name_original": "Inquisitor’s Heart and Soul", "description": "Inquisitor's Heart and Soul is a third-person adventure game about how AI-equipped fantasy game characters begin to live their own lives, repeating the mistakes of humanity, and a player from the real world with fire and sword brings them back on the right path<br/><br/><h3>DEMONIC INVASION IS FUN</h3>Life begins to play with new colors when a spiritualistic storm is playing out nearby. Therefore, if it seems to you that it is time to change something in life, then this is one of the options. You can try in safe mode - in the form of passing our game - and then think again about whether you need this in real life<br/><br/><br/><h3>GAMEPLAY FEATURES</h3>The game alternates between two types of gameplay. One is designed for arcade adventure missions, with elements of simple puzzles and a small amount of battles. The second is intended for fierce battles against entire armies of traitors and their heretical bosses. As a result, we adjusted everything so that the player does not get used to one type of gameplay and constantly faces new challenges.<br/><br/><br/><h3>TUNE THE MUSIC OF THE HIGHER SPHERES</h3>Taking up a sword in order to make the world a better place, you should concentrate on thinking about something good, light and sophisticated. A specially selected soundtrack will help you maintain a philosophical mood and unclouded feelings while burning out the filth. Relax and have fun!<br/><br/><br/><h3>LIST OF GAME ELEMENTS:</h3><ul><li> Different variations of gameplay<br/></li><li> Sci-fi graphics and atmosphere<br/></li><li> Combat scenes using magic techniques<br/></li><li> Stunning soundtrack</li></ul>", "metacritic": null, "released": "2021-10-20", "tba": false, "updated": "2022-12-02T06:56:30", "background_image": "https://media.rawg.io/media/screenshots/39c/39c4b410220e9bd82bb5776bf4bd5341.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 404, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Whale Rock Games", "CyberCry Creators"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Whale Rock Games", "CyberCry Creators"], "esrb_rating": null}