{"id": 681607, "slug": "axis-allies-1942-online", "name": "Axis & Allies 1942 Online", "name_original": "Axis & Allies 1942 Online", "description": "JOIN THE BATTLE!<br/>Play Axis &amp; Allies 1942 Online on your iPad! It’s the official digital version of Hasbro’s classic board game, Axis &amp; Allies 1942 Second Edition. Strategy is key as you command armies across the globe!<br/><br/>*Note: Apple Accounts held by users aged 12 and under will not be able to access our online multiplayer features.<br/><br/>Team up with friends across platforms, get competitive in ranked seasons, play solo against the A.I., or pass &amp; play with a pal on one tablet!<br/><br/>FEATURES<br/><br/>Official Rules <br/>- Adapts rules from Hasbro’s Axis &amp; Allies 1942 Second Edition<br/>- Choose from two game scenarios &amp; victory conditions!<br/>- Allies: Command your forces as the United Kingdom, United States, or Soviet Union<br/>- Axis: Take control of Germany or Japan’s armies &amp; prepare for battle!<br/><br/>Learn to Play <br/>- Great for new players— no setup or cleanup required!<br/>- Tutorials &amp; In-Game Tooltips help beginners dive in<br/><br/>Turn-Based (Asynchronous) <br/>- Fully turn-based gameplay fits into your busy schedule! <br/>- Ranked games allow 24 hours to take your turn<br/>- Instead of playing for hours on end, get notified when it’s your turn, then use the War Diary to check out what you missed! (or stick around &amp; watch the battle unfold in real time— that’s an option too!)<br/><br/>Player Accounts &amp; Profiles<br/>- Track your stats &amp; win/loss rates for each alliance<br/>- Your commander account syncs across devices<br/>- Switch seamlessly between iPad &amp; desktop to take your turns, view your stats &amp; connect with friends<br/><br/>Dice Modes<br/>- Standard mode mimics random dice results<br/>- Low Luck dice use averages to calculate hits<br/>- Biased dice favor rolls of 2, 3, &amp; 4, over 1 &amp; 6<br/><br/>Immersive Gameplay<br/>- High quality graphics, music &amp; sound effects add drama to your battles!<br/><br/>GAME MODES<br/><br/>Single-Player<br/>- Enjoy casual games with A.I. computer players<br/>- Great for learning to play or testing out strategies<br/><br/>Hot Seat<br/>- Pass the tablet around to play with friends &amp; family<br/><br/>Online Multiplayer<br/>- Cross-platform play between tablets &amp; computers<br/>- Create custom games for 2 to 5 players<br/>- Games can include a mix of humans &amp; A.I. players<br/><br/>Ranked Seasons<br/>- Challenge the world’s top Axis &amp; Allies players in official ranked seasons<br/>- Rise through the ranks to take top honors: Wood, Bronze, Silver, Gold &amp; Platinum Tiers!<br/>- Matchmaking pairs you with similarly ranked players<br/><br/>SPRING 1942...THE WORLD IS AT WAR<br/>German tanks mobilize in the west, blitzing into France and pushing back the Soviet Union in eastern Europe. The United States rises in response to Japanese aggression in the Pacific. The United Kingdom rallies allies as bombers menace the skies. The year is 1942, and the world is at war! <br/><br/>Victory goes to the side that conquers its opponents on the field of battle and occupies the greatest cities of the world. Will the Axis continue to spread across the globe unchecked, or will the Allies rally to push back against imperialistic tyranny? Challenge your friends and change the course of history!", "metacritic": null, "released": "2019-07-30", "tba": false, "updated": "2022-09-24T09:19:10", "background_image": "https://media.rawg.io/media/screenshots/3fd/3fd478223e8c449251d5439c3afdd502.jpg", "website": "https://www.axisandalliesonline.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 235, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS", "PC", "macOS"], "developers": ["Beamdog", "Overhaul Games"], "genres": ["Strategy", "Board Games"], "publishers": ["Beamdog", "Overhaul Games"], "esrb_rating": "Everyone 10+"}