{"id": 681647, "slug": "red-triangle-super-collection", "name": "Red Triangle Super Collection", "name_original": "Red Triangle Super Collection", "description": "Red Triangle Games' collection of short OHR.RPG.CE games all in one place! Five great games to start with more games added over time, all absolutely free. This bundle showcases not only Red Triangle Games but also several members of the Hamster Republic community, showing that with this little RPG engine, you can make just about anything. These titles are special to Red Triangle Games because they are made with dear friends and are some of the earliest titles that we've produced, revisited for this release. There's something for everyone in this collection!<br/><br/><br/><br/><ul><li>Scare Spree, a spooky romp around town where you try to unlock costumes and scare townspeople and monsters in three unique locations.<br/></li><li>Graffiti Goose, a mouse based puzzle game where you use your knowledge of mixing paints to get the high score. You'll have to act quick to reach the end.<br/></li><li>Video Goose, a short point-and-click adventure game with a quirky store about a video rental store owner who is down on his luck, and the misadventures of the goose he hires in his desperation for success.<br/></li><li>Missing You, a short arcade game where two hearts unite under a starry sky. You play as a falling star from one trying to reach the other.<br/></li><li>Knight Slights, a quirky play on a popular card game with mid-evil jokes and innuendos. Can you be the more terrible of the four knights and win the round?</li></ul>", "metacritic": null, "released": "2021-10-21", "tba": false, "updated": "2021-10-25T02:25:12", "background_image": "https://media.rawg.io/media/screenshots/f23/f233d23f6fa75357908d04511437aaf0.jpg", "website": "https://www.redtrianglegames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 24, "ratings_count": 0, "suggestions_count": 149, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Red Triangle Games"], "genres": ["Action", "Adventure", "Casual", "Puzzle"], "publishers": ["Red Triangle Games"], "esrb_rating": null}