{"id": 6816, "slug": "flight-of-the-amazon-queen-20th-anniversary-editio", "name": "Flight of the Amazon Queen: 20th Anniversary Edition", "name_original": "Flight of the Amazon Queen: 20th Anniversary Edition", "description": "\"A great game, that'll give you hours of fun and leave you feeling good. We love it!\"<br/>-Mr. Bill's Adventureland<br/><br/>\"Walks on the fine line between Monkey Island and Indiana Jones without falling.\"<br/>\"A well-executed adventure.\"<br/>- Leading MobyGames reviewers<br/><br/>The year is 1949 and you assume the role of Joe King, a pilot for hire who is given the job of flying Faye Russell (a famous movie star) into the Amazon jungle for a photo shoot.<br/>Of course, things never go according to plans. After an unfortunate turn of events they find themselves stranded in the heart of the Amazon jungle, where Joe will embark on a quest to rescue a kidnapped princess and in the process, encounter a dangerous temple, fearsome Amazonian warriors, and a powerful mad scientist intent on taking over the world!<br/>It's up to you to deal with the imminent threat of world domination … but be careful, or this may be the last Flight of the Amazon Queen!<br/><br/>The game features:<br/><br/>- A classic graphic adventure based on the much-loved LucasArts adventure games and the adventure films of the '40s<br/>- Explore over 100 exotic locations and interact with over 40 wildly individual characters including, but not limited to, a tribe of Amazon women and 6-foot-tall pygmies<br/>- Witty dialogues packed with sassy humor will make you laugh out loud<br/>- FULL voice-acting including the talents of the famous British actress Penelope Keith, Actor William Hootkins who played Red Six(Jek Porkins) in Star Wars, Brad Lavelle, Tom Hill, Enn Reitel, Jon Coleman, Debbie Arnold and more!<br/><br/>'20th Anniversary Edition' features:<br/><br/>- Totally new, much praised, game play controls that were built from the ground up for touch-screens.<br/>   *  Hotspot based - no more pixel hunting!<br/>   *  All-new slick icons and animations.<br/>   *  For more details, please see our tutorial video: https://youtu.be/Scq1QDKOFHA<br/><br/>- High-end graphics upscaling (xBR filter) for high-resolution displays<br/><br/>- Completely new game menus and save/load system<br/><br/>- Music options: MT-32 or Original Adlib <br/><br/>- Optional retro settings: play with original graphics and even the original controls (mouse pointer)<br/><br/>- A lot of extras:<br/>   * ‘The Making of’ booklet (35 pages)<br/>   * Interview Mini-Game featurette with Commentary by Game Creator<br/>   * Original US and EU manuals<br/>   * The Official Playing Guide (97 pages)<br/><br/>- Multiple languages (ALL included without additional payment):<br/>English voice acting, with the option for adding subtitles in English, Spanish, Italian and Hebrew<br/>German voice acting with or without German subtitles<br/>French voice acting with or without French subtitles<br/><br/>The 20th Anniversary Edition produced and developed by MojoTouch © 2008-2018 all rights reserved.<br/>Licensed from Red Sprite Studios - the original game developer. An Australia-based company.<br/>Uses ScummVM which is protected under GNU-GPL v2. For more information, please visit http://mojo-touch.com/gpl<br/><br/>LucasArts, Monkey Island, Indiana Jones and Star Wars are registered trademarks of Lucasfilm Ltd.", "metacritic": null, "released": "2016-03-23", "tba": false, "updated": "2019-10-22T14:29:03", "background_image": "https://media.rawg.io/media/screenshots/5c1/5c18f19014d00308e719e323b3b605be.jpeg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 242, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Liron Barzilai"], "genres": ["Adventure"], "publishers": ["Liron Barzilai"], "esrb_rating": null}