{"id": 681871, "slug": "sahara-some", "name": "Sahara. Some", "name_original": "Sahara. Some", "description": "<p>This is 'Sahara. Some', a new video game from Outhouse Media. Muhalla, the world's first and newest standalone fair of nature, public, recreational, arts, and culture, has launched.<br/>\nSahara is an urban environment that is emulated by the breed of animals, indigenous plants and natural features that are at the core of Sahara's natural openness and natural beauty. This includes water, air, alien landscapes, public spaces, and many others. Sahara is new and fresh, from the artist's point of view.\n\nSahara's global vision is simple: to create a game that will change the way people perceive and enjoy nature, creating a place grown around the planet and shaped by nature as it is.\n\nSahara is a transport game due to Sahara's mission statement, \"To improve the world we live in\", through its unique experiences and lifestyle.\n\nSahara is simple, yet complex. You play as a Sahara and you represent it, because you can, if you like, cheat, alter, rip-off, or otherwise make the game known to be anything you like.\n\nSahara is only 72 hectares (1,320 acres), one of many locations worldwide. The team has developed various ways of creating the game's landscape, which allows for a larger level of gameplay and i-Direction. The digital terrain is created using Cloud Teal, and of course, the land is also completely recreated. The team tried all available techniques and materials available on the market, come</p>", "metacritic": null, "released": "2021-10-21", "tba": false, "updated": "2021-10-22T05:58:02", "background_image": "https://media.rawg.io/media/screenshots/2b6/2b61191044af5087a582f8455911c7a3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 4, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["Outhouse Media"], "genres": [], "publishers": [], "esrb_rating": null}