{"id": 681903, "slug": "in-all", "name": "in all", "name_original": "in all", "description": "<p>This is 'in all', a new video game from Outhouse Media.<br/>\nThe Japanese company launched this spate of layoffs this week, sending out an email to all of its employees yesterday. The emphasis is clearly on the English player. \"We currently have 168 (and counting) employees in full-time employment and we are currently closing dozens of positions,\" reads the email. \"We are committed to hiring for the rest of the year.\"\n\nOuthouse Media went on to say that it plans to lay off as many as 10-20% of its staff in the coming weeks.\n\nIt continues, \"In order to support our full-time employees, we have decided to reduce the number of staff positions related to development. These people will no longer be working on the overseas titles but instead will be working on the Japanese titles in the English language version.\"\n\nThe company also announced that it would be shutting down its Japanese outlet, but it will rebrand it as Outhouse Media Japan.\n\nThe company claims that the cutbacks would have an impact on its operations. \"Personal expenditures for development and business activities are expected to increase by approximately 20% at the same time as internal expenses will be decreased due to these reductions,\" reads Outhouse's email.\n\nOf course, as we all know, this announcement comes just after the company was blasted by Twitter for suspending all offline multiplayer for Half-Life 2: Episode One.\n\nSome people today are wondering if these layoffs are the result of the entire Half-Life 2</p>", "metacritic": null, "released": "2021-10-21", "tba": false, "updated": "2021-10-22T06:05:35", "background_image": "https://media.rawg.io/media/screenshots/ffe/ffe40a23363c5140d90daba9e99e634a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 35, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Outhouse Media"], "genres": [], "publishers": [], "esrb_rating": null}