{"id": 681954, "slug": "soda-lord", "name": "Soda Lord", "name_original": "Soda Lord", "description": "<p>            In my game, Soda Lord, you play as the Soda Lord, who must protect their soda bottles from being stolen by demons.</p>\n<p>When I started working on the ghost movement code, I had the ghosts spawn, track the location of the nearest soda bottle, and head towards it. This led to a design challenge, because the ghosts had usually spent around just one or two seconds on screen before they found the nearest bottle. This didn’t give the player long enough to react to the ghost’s presence before they had already picked up the bottle and left. In the end, I changed this mechanic to instead have the ghosts choose a random soda bottle. By making ghosts usually look for farther bottles, they were on screen for long enough for the player to have good reaction time. This made the challenge of the game more reasonable.\r\n  </p>\n<p>One of the major additional mechanics that I added to this game, which made it more unique, was the fog of war. I felt like without fog of war, my game would look pretty generic and boring. Adding fog of war would add interest and challenge to the game. I was inspired to add the fog of war because of what I imagined it would be like to stop thieves in a real grocery store. In real life, people do not have eyes in the back of their head. People cannot see behind themselves, or beyond their peripheral vision. And now, the player would not be able to see behind themselves in game, either. Instead, they would constantly have to be looking and turning around to make sure that everything is ok, like a spy who has to make sure that nobody is sneaking up on them. Adding the fog of war made my game more similar to real life, and the challenge that came with it made my game a lot more enjoyable to play.\r\n  </p>\n<p>At this point in the design, I felt that the prototype seemed pretty fine, but it was a little boring because the player did not have that much agency. There were not that many actions that the player could do. To solve this, I added a way to let the player pick up the bottles and move them around the room. This would give them more actions to do, and make the game more strategic and interesting to play. The player would have to consider when the pursue the ghosts, when to pick up and move bottles, and where those bottles should be moved to. To pick up a bottle, the player must press space and collide with it. They will keep carrying the bottle until they release the space bar. This also complemented my constraint of “collection”, because now the player can pick up / collect the bottles, just as the enemies already could.\r\n  </p>\n<p>            I have a lot of ideas for ways that I could expand upon this prototype, to make it into a full fledged game:\r\n  </p>\n<ul><li>Give the player a powerup, which they can activate to temporarily light up the whole screen for a second or two, temporarily removing fog of war.\r\n  </li><li>Add a sprinting mechanic\r\n  </li><li>Add multiple kinds of ghosts with different behavior\r\n  </li><li>Add different levels with multiples kinds of terrain and obstacles.   </li></ul>\n<p>While these mechanics would add a certain layer of polish, I am still happy with this prototype, as a test of how I can use the fog of war and collection mechanics to make an interesting action game.\r\n</p>\n\n<p>Controls:</p>\n<p>Use W to go forward, and A and D to turn left or right. Hold space to pick up and move a bottle, and collide with an enemy to make them go away.</p>", "metacritic": null, "released": "2021-10-21", "tba": false, "updated": "2021-10-22T06:18:45", "background_image": "https://media.rawg.io/media/screenshots/558/558c6ac5d7178f0541b10c30a942f741.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Josh Finkel"], "genres": ["Action"], "publishers": [], "esrb_rating": null}