{"id": 682092, "slug": "wtktotf", "name": "WtKTotF", "name_original": "WtKTotF", "description": "<p>The game is an endless runner, or rather rider on a scooter. The main character, the color palette, the enemies, and the music are inspired by FLCL.  The main character on the scooter and the robot enemy are my best effort of drawing characters resembling something from the show.</p>\n<p>If you want to know what the name of the game means, listen to the album mentioned at the bottom of this description.<br/></p>\r\nGame jam stuff\r\n<p>The game is an entry for Autumn Lisp Game Jam 2021, written in Fennel, which is a kind of lisp that compiles to lua. And using that, it runs as a mod for another game of mine, Someone. The engine itself has been made a while ago using C++ and Lua, with some modifications specifically for the jam done in the jam time. The game that is the entry for the jam is written exclusively in Fennel.</p>\r\nControls\r\n<p><strong>Z</strong> to jump<strong>.<br/></strong><strong>X</strong> to hit enemies with your guitar<strong>.<br/></strong><strong>M</strong> to mute the music.<br/><strong>Q/E</strong> to reduce/increase volume, hold <strong>Shift</strong> to change SFX volume.<br/><strong>F1</strong> to make the window smaller/bigger.<br/>When prompted, <strong>R</strong> to restart.</p>\n<p>\n</p>\r\nCredits\r\n<p>Programming by me, most of the art by me. <br/>Bullet enemy design by Moonburnt with minor edits by me. <br/>Font is \"Abaddon\" by Caffinate.<br/>Sound effects generated with sfxr.me.<br/>Music by Nommy.<br/>Additionally, you can also listen to \"Little Busters\" by \"the pillows\", which is the band that did soundtrack for FLCL, in background. When there was no music in the game, that's what I did.</p>\r\nTroubleshooting\r\n<p>If the game doesn't start, make sure there are no non-ascii character in the path. Also, the MacOS build works, both on x86 and arm macs, if you allow the gatekeeper to run it. If you get \"permission denied\" when trying to run the .app, you should open your terminal and cd inside the .app to \"Contents/MacOS\" and run \"chmod +x wtktotf\", then it should run fine.<br/></p>", "metacritic": null, "released": "2021-10-20", "tba": false, "updated": "2021-10-22T06:52:18", "background_image": "https://media.rawg.io/media/screenshots/41a/41a82488a79768d174e3373945c17705.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 28, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["vaartis"], "genres": [], "publishers": [], "esrb_rating": null}