{"id": 682117, "slug": "city-zero-the-gamedemo", "name": "City Zero The Game(Demo)", "name_original": "City Zero The Game(Demo)", "description": "<p><em>-<strong>City Zero-</strong></em></p>\n<p>Welcome to City Zero! A small town that was the unwitting participant in a botched government experiment.</p>\n<p>Over a period of weeks, the towns people were secretly exposed to an airborne chemical that is designed to make the person \"less Intelligent\"  with the hope that the \"infected\" people,  will be less likely to question authority. and follow directions without question.</p>\n<p>Well, it worked, a little too good. Now we have a town overrun with mindless zombies! </p>\n<p>There are a few folks that appear to be immune to the chemical and now they are left cowering in fear for their lives. </p>\n<p>It is your job to go in and rescue as many of them as possible and to kill as many zombies as you like! </p>\n<p>Also, one of the scientists that was secretly working in the city fled so fast he left behind a bunch of important briefcases full of secret information! If you could collect them as well, we'd be very pleased!</p>\n<p>By the way, did I mention you are on a time limit?? Good luck!</p>\n<p>This game is also a submission for the Halloween Game Jam found here -  https://itch.io/jam/halloween-game-jam-by-official-horror-video-games   <strong>#officialhorrorvideogames #horrorvideogames</strong></p>\n<p>And  the \"Let's Make A Game!\" Jam found here - https://itch.io/jam/lets-dev- .</p>\n<p> #letsmakeagame</p>\n<p>***** This is the demo version, so only 1 character is playable and only easy difficulty available for now! ***** </p>\n<p>(Game is still under development, so expect bugs! or not, who knows?? :))</p>\n<p>Your opinions are very much appreciated, so leave a comment and let me know what is good bad or ugly! I would really like to get as much feedback as possible, as I would like to continue developing this game, but I need your input to help me along! Thank you!!! :)</p>\n<p>(*** The gameplay video was made before current updates. ****)</p>\n<p>#CityZeroTheGame<em>  </em><em>#HCG</em></p>", "metacritic": null, "released": "2021-10-20", "tba": false, "updated": "2021-10-22T06:59:20", "background_image": "https://media.rawg.io/media/screenshots/1b0/1b02c2d102e120edad0f21b5552e22b6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 162, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["HCG"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}