{"id": 68223, "slug": "carnival-fair-food-maker-kids-food-cooking-games", "name": "Carnival Fair Food Maker - Kids Food Cooking Games", "name_original": "Carnival Fair Food Maker - Kids Food Cooking Games", "description": "A carnival fair is a perfect place to experience yummy foods. Experience the Fun of the Fair with Fair Food Maker!<br/>Pick from tons of flavors, sweet candy toppings, and decorations. Can you make the coolest snow cone? The best funnel cake? The most beautiful cotton candy? Make them all!<br/>Let’s get cooking to see how many different carnival favorites you can make. Be sure that you have all the right ingredients, and get started cooking up the best food around. Think you can surprise your friends and family with some amazing dishes? Try it out today! <br/><br/>Make Fantastic Foods:<br/>*Cotton Candy!<br/>*Snow Cone!<br/>*Funnel Cake!<br/><br/>Product Features:<br/>-A super fun food-making game<br/>-Make yummy foods from scratch<br/>-Tons of realistic cooking tools to play: spatula, cooking pan, knife, oven, food blenders and so much more<br/>-Tons of food materials and decorations to try: flour, sparkling sugar, sauces, olive oil, salt, milk, eggs, sprinkles, candies, fruits and so much more<br/><br/>How to play: <br/>- Use interactive controls to play the game<br/>- Try different tools to make your foods<br/>- Mix various ingredients to create the unique flavor and color of your foods<br/>- Decorate your foods with beautiful sprinkles, candies, fruits and cream toppings and enjoy the yummy foods<br/><br/>For more cooking games, visit our official site at http://www.makerlabs.net/<br/>Any new idea or suggestions to our game? Please follow us on Twitter at https://twitter.com/The_MAKER_LAB", "metacritic": null, "released": "2017-03-22", "tba": false, "updated": "2019-10-22T14:26:38", "background_image": "https://media.rawg.io/media/screenshots/12e/12ec28af719e6f18e065b0930e4e501e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 28, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Maker Labs"], "genres": ["Simulation", "Family"], "publishers": ["Sky Creator"], "esrb_rating": "Teen"}