{"id": 682258, "slug": "twitch-game-squid-game-with-chat", "name": "Twitch Game - Squid Game with Chat!", "name_original": "Twitch Game - Squid Game with Chat!", "description": "<p><strong>Twitch Game!<br/></strong><br/><strong>IF YOU DOWNLOAD FROM BROWSER, READ MESSAGE AT THE END:</strong><br/><br/>Based on the popular Netflix series, I have made a version of Squid Game that streamers can play entirely with their Twitch chat! No setup required, just a Twitch Channel name!</p>\n<p>Art by the fantastic msmetafan : https://twitter.com/msmetafan1</p>\n<p>Misc Game Assets by the great Phoenix: https://www.instagram.com/finix.arts</p>\n<p>Games included: </p>\n<p>Red Light, Green Light! - Move your avatar to the other side while it is safe</p>\n<p>Tug of War - Users are divided into two groups and need to outspam each other!</p>\n<p>Lights Out! - No one is safe at night. Avoid the lights controlled by chat and stay alive until the end of the round</p>\n<p>Glass Stairs - A special twist on the game in the Netflix series! A special surprise for those who make it this far...</p>\n<p>Squid Game- A special spin on the very last game. Will test your Twitch knowledge and speed.</p>\n<p>Please leave your feedbacks and comments below!<br/><br/>Tech notes: The game uses read-only tokens in order to use Twitch IRC and find user avatars. Streamers or people who play do not need to take any other steps<br/><br/><strong>DOWNLOADING FROM BROWSER</strong>: If the game is installed through the itch io app then you will be able to play the game just fine as it is digitally signed. If you download through the browser, you <strong>MUST </strong>keep the file and ignore the discard message. <br/></p>", "metacritic": null, "released": "2021-10-20", "tba": false, "updated": "2021-10-22T07:39:16", "background_image": "https://media.rawg.io/media/screenshots/27d/27d83261345ca784c70976a0e366a03c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 90, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["davidarthurpaul"], "genres": [], "publishers": [], "esrb_rating": null}