{"id": 68228, "slug": "solitaire-pro-hd", "name": "Solitaire Pro HD", "name_original": "Solitaire Pro HD", "description": "You've spent countless hours playing Klondike Solitaire on your desktop. Now you can play on your mobile device as well with this beautifully designed version of Solitaire. <br/><br/>ONE TOUCH MOVES <br/><br/>Our innovative one-touch moves feature allows you to move cards with a single tap, making gameplay much faster and less frustrating. If you prefer to drag and drop you can do that as well. We're all about giving you choices. <br/><br/>BIGGER CARDS <br/><br/>Forget about trying to tap the tiny little cards in other Solitaire games. Solitaire Pro HD gives you awesome large cards that are easier to see and move. <br/><br/>MULTIPLE THEMES <br/><br/>With twelve beautiful professionally-designed themes, you can customize the game to suit your tastes. Play on wood, felt, leather, or fabric with color coordinated card decks that perfectly match your choice of background. <br/><br/>MULTIPLE SCORING MODES <br/><br/>Track how well you're doing with standard, vegas, or vegas cumulative scoring, or turn off scoring entirely for a zen-like Solitaire experience. <br/><br/>PORTRAIT AND LANDSCAPE SUPPORT <br/><br/>All screens fully support portrait and landscape mode, so you don't have to try playing sideways. Go wild and switch back and forth as often as you like. We'll put everything back where it belongs, we don't mind. <br/><br/>MULTIPLE DRAW TYPES <br/><br/>Draw 1 or Draw 3 Solitaire with limited passes through the deck when Vegas scoring is enabled and unlimited passes when standard scoring is enabled. We don't recommend playing Vegas Draw 1 unless you love losing. <br/><br/>STATISTICS <br/><br/>Track key statistics such as games played, games won, fastest time, highest score, and longest winning streak for both Draw 1 and Draw 3. Put your friends to shame by showing them your amazing Solitaire stats. <br/><br/>If that list of features didn't sell you on Solitaire Pro HD, we don't know what will. You won't find a better Solitaire game on the App Store. Download Solitaire Pro HD today and join the fun!", "metacritic": null, "released": "2014-04-05", "tba": false, "updated": "2019-07-29T11:26:43", "background_image": "https://media.rawg.io/media/screenshots/a15/a15f7d2b28cffe3ff0771315c09d73a9.jpg", "website": "http://www.optimesoftware.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 74, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Optime Software"], "genres": ["Board Games", "Card"], "publishers": ["Optime Software"], "esrb_rating": null}