{"id": 682256, "slug": "alchemysterious", "name": "Alchemysterious", "name_original": "Alchemysterious", "description": "<p>Stabilize the Philosopher Stone. Search through an old alchemy lab to find clues and ingredients to follow a long forgotten recipe. Solve riddles, understand the hints and unlock objects using The Room's style of tactile interactions.<br/></p>\n<p>Project initially realized during the 49th Ludum Dare game jam.</p>\n\r\nV2 Release notes :\r\n<ul><li>The level was entirely redone, new puzzle design, new recipe, new machines, new interactables, new ingredients, and more</li><li>The build still has a few bugs : <ul><li>the ambient lighting in the game scene is gone, so it's mostly pitch black but we added a temporary light source to the player,</li><li>a custom font is exporting incorrectly, but it's still readable,</li><li>the settings menu is a bit broken, the control page is shown on top until you go to that page, and the saving/loading is very wrong,</li><li>the ocean shader is temporary, it's a bit ugly currently.</li><li>the french translation is only partly done, none of the notes are translated, although the rest is</li></ul></li><li>Some machines are lacking feedback and audio but the game should be redeable enough to be played, we'll work on that next</li><li>A tutorial would definitely improve the experience</li><li>The music playlist still isn't looping, only the first music can be heard, and only once :(</li></ul>\n\r\nControls (almost all rebindable in game) :\r\n<ul><li>Movement : WASD (auto switches to ZQSD for azerty keyboards)</li><li>Look around : Mouse movement</li><li>Pick item/Interact : Left click   or   E</li><li>Drop item : Middle click   or   Q (A on azerty)</li><li>Exit interaction : Right click   or   Escape</li></ul>\r\n\r\nObjective\r\n<p>Right now the philosopher stone isn't in game, so it stops when the transmutation crystal is crafted and placed near the start point. To do that you'll have to search the lab to find notes containing informations about the different ingredients and recipes to use. Some ingredients are mined in the rocky backyard, others are found in shelves. They are combined using several machines with specific settings found on the notes.</p>\n<p>Use the different informations in the lab to piece up how and what to do.</p>", "metacritic": null, "released": "2021-10-20", "tba": false, "updated": "2021-10-22T07:38:43", "background_image": "https://media.rawg.io/media/screenshots/b1d/b1d08eb9ddd18a86145cd7b42edb9cba.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 44, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["PatateNouille", "Beshop"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}