{"id": 682305, "slug": "cluster-ks", "name": "cluster [ks].", "name_original": "cluster [ks].", "description": "<p>This is 'cluster [ks].', a new video game from Outhouse Media. It's a funny title, but it will appeal to anyone who loves taxidermy and cat pictures, as the game is called. The game is currently in development and available for iOS and Android devices, and features a number of different creatures to choose from, including a hunting tiger, stuffed hippopotamus, and a cherry red bear.<br/>\nAccording to Outhouse Media's website, the title comes from a number of different funding sources, from the various animal life collecting groups such as AVF and WWA to the book \"Cluster of Champions,\" which also features the characters of dinosaurs.\n\nAccording to @OuthouseMedia, \"Cluster\" is not an SNES/Super Nintendo game. It's a spin-off title from the video game \"SuperCluster.\" — Boston Globe (@BostonGlobe) May 22, 2017\n\nCluster of Champions is a a fast-paced survival game set in the realm of Earth where dinosaurs and humans have been intermingled since prehistoric times. Players take control of the titular hero, a hunter and scavenger, in this world of story shortens, but short. You must not be discovered, and you must survive.\n\nAnnounced last year in a trailer, Cluster of Champions is expected to release on May 23rd, then followed by an official reveal on May 28th and launch on June 3rd. More information will be released as soon as possible, at 9am PT (2am</p>", "metacritic": null, "released": "2021-10-19", "tba": false, "updated": "2021-10-22T07:50:52", "background_image": "https://media.rawg.io/media/screenshots/6d2/6d23a3dd2c60005acadc25d18aa2bbd7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 20, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Outhouse Media"], "genres": [], "publishers": [], "esrb_rating": null}