{"id": 682311, "slug": "natural-medicine", "name": "natural medicine.", "name_original": "natural medicine.", "description": "<p>This is 'natural medicine.', a new video game from Outhouse Media. They have done exactly what you have asked them to do by claiming to be 'natural.'\"<br/>\nClaiming that \"natural\" means \"exclusively natural,\" in the dash to support falsifiability, Outhouse Media argues that \"natural\" means \"appropriate,\" effectively arguing that natural is what you should consider natural. They also claim to be \"concerned that the emerging term 'natural' is introducing a confusing and potentially misleading realm of practices that are completely outside the scope of the natural healer's training.\" The \"new word natural…is a fundamental mistake.\"\n\nYes, \"natural\" has some business in the medical field, but this non-medical term is not being applied to a doctor or a holistic practitioner.\n\nThey also claim that \"natural practices\" are \"culturally rooted.\" What they are actually describing is the mainstreaming of a too-corrupt, and therefore wrong, cult that uses its own purported \"natural\" conditionality as its spiritual and therapeutic norm. The deep, black, spiritual nature of the acupuncturist Kabuki theater is at the core of the healing practices they are advising viewers to adopt. And Kabuki theater is a wildly well-researched cult; the central figure in it is said to be \"Aristotle, the father of natural philosophy, and the founder of modern Indian philosophy.\"\n\n\"The more I hear from people who have come along with this practice [acupuncture] and now think their</p>", "metacritic": null, "released": "2021-10-19", "tba": false, "updated": "2021-10-22T07:52:29", "background_image": "https://media.rawg.io/media/screenshots/4b7/4b77b87ff02645b73dd1ead8a6a0f8e5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "Linux"], "developers": ["Outhouse Media"], "genres": [], "publishers": [], "esrb_rating": null}