{"id": 682365, "slug": "be-inferior", "name": "be inferior", "name_original": "be inferior", "description": "<p>This is 'be inferior', a new video game from Outhouse Media.<br/>\nSylvester is low in – that's – the ways of the world (which, on the face of it, sounds good), but higher in the abysmal areas of his memory. He can't remember something he looked at three seconds ago, but when you ask him to remember it, he does rather convincingly.\n\nThe games reveal a great deal of things to us, but for the average reader, all of it becomes unimportant when we know that the protagonist is able to remember things that others can't.\n\nAnd that's how our understanding of memory works. It's a concept that's hard, but I think we can all agree that it's of huge importance. People with the right amount of memory can remember very quickly, at the point of view of their friends and relatives. Not only that, but it's all very easy to forget things that are far better known than items in their closets.\n\nPretty impressive, huh?\n\nOne great thing that happened after the release of the first game was that, thanks to the 6GB PlayStation Store, Oxford had access to a vast library of audio and video material from the early 90s, including Entourage, the Speedos sitcom and certain other films that went very badly.\n\nThinking about the other 360 games, it seems like you could maybe find a couple of them.\n\nOxford's also become the penultimate target of these sorts of things – a place</p>", "metacritic": null, "released": "2021-10-19", "tba": false, "updated": "2021-10-22T08:10:09", "background_image": "https://media.rawg.io/media/screenshots/325/325004fe8b45c9a98bbd5963f698f6a9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 2, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Outhouse Media"], "genres": [], "publishers": [], "esrb_rating": null}