{"id": 682389, "slug": "europe-including", "name": "Europe, including", "name_original": "Europe, including", "description": "<p>This is 'Europe, including', a new video game from Outhouse Media. It's a small team obsessed with producing the best video game possible, with only a few ties to the real world.<br/>\nHere's what we know:\n\nThe game takes place in the Mideast, who are divided into different parts of the world. The story begins with the small city of Raqqa taking part in the invasion of the Islamic State. You play as a mercenary, a former soldier from the invading army, who has been brought back to the city and arrives in the aftermath of the fighting.\n\nThe main objective of the game is to defeat the army of ISIS, but you cannot play a single game with a single character. You can only play with friends. There is no online leaderboard or leaderboard badges, not even the many Facebook game's to prove it. You don't need to take part in a game and in fact, you cannot win. The AI does not have a clue what you are trying to accomplish, other than trying to escape. It's this rare sense of 'I have to do something to get out of this situation', that will keep them coming back.\n\nThe game's gameplay involves a lot of choices, decision making, and clever little tricks and attacks you can hand in order to advance through the game and win.\n\nThere are a lot of people online who self-identify as gamers, and would probably mind a little bit of money if they are in this. That said, the number of people interested in</p>", "metacritic": null, "released": "2021-10-19", "tba": false, "updated": "2021-10-22T08:16:31", "background_image": "https://media.rawg.io/media/screenshots/55f/55f69ad7204c25a6bfa5d940628eacf2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 11, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Outhouse Media"], "genres": [], "publishers": [], "esrb_rating": null}