{"id": 682326, "slug": "questions-there", "name": "questions there", "name_original": "questions there", "description": "<p>This is 'questions there', a new video game from Outhouse Media. It's a look at what it's like to play your character from the point of view of a moron while also introducing virtual reality and the difference between camera and screen in mind games.<br/>\nAdvertisement\n\nThe video game comes to PC with Oculus Rift support, which means that it has a VR experience you can use quietly while watching some more TV. The glowing, faux-pewter console and camera that sits above it are necessary in order to project it onto a wall. But if you want to get a little closer to the action, you can also race around the environment by capturing a race number and broadcasting it online. It's similar to using headphones at a football match, but actually feels like you're actually standing in the ground.\n\nGet The Weekender in your inbox: The Globe's top picks for what to see and do each weekend, in Boston and beyond. Sign Up Thank you for signing up! Sign up for more newsletters here\n\nOuthouse Media's team has worked with Oculus to make the video game more interactive than just doodling on a screen, pushing it from fun arcade games to video games that rely on a near real-time camera tracking your avatar and player movements. It's also spruced up the interface with new tools that make it easier to navigate, like a tool that allows you to track multiple people at once.\n\nOuthouse Media\n\nThe team also hopes that the virtual reality experience will be enough of</p>", "metacritic": null, "released": "2021-10-19", "tba": false, "updated": "2021-10-22T07:57:47", "background_image": "https://media.rawg.io/media/screenshots/d0c/d0c5067508d3cd451f299040ff23c71f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 29, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Outhouse Media"], "genres": [], "publishers": [], "esrb_rating": null}