{"id": 682349, "slug": "website-dedicated", "name": "website dedicated", "name_original": "website dedicated", "description": "<p>This is 'website dedicated', a new video game from Outhouse Media. The site has been developed by Jonathan Johnson and calls itself 'a new and innovative way to play tabletop games.'<br/>\nIn this video, they call it a 'new form of video game Pikmin'. They want to see games that are 'free to play' so that players can play, but they feel there should be 'chapters' that are shorter and easier to understand – in other words, they want to see a series of the same thing.\n\nYou must enter the characters you see in the image into the box below to be added to the team\n\nThe idea is to create a video game that 'learns' by playing games with you or your friends.\n\nWhat Outhouse Media works on is different from games like the current market leader – Braid.\n\nBraid is free-to-play, and if you haven't played it you should put in your hard-earned cash and buy in. However, you will learn more about the game – and I mean much more – via the learning process.\n\nPikmin is a series of the same games, but you have to play through the whole thing to see what's behind the designs.\n\nThis makes for an easier learning experience, but it means that players have to directly challenge each other to re-design their game on a specific level.\n\nIn Pikmin, I found myself playing through completely different levels without getting better. I put in the effort and got three</p>", "metacritic": null, "released": "2021-10-19", "tba": false, "updated": "2021-10-22T08:05:45", "background_image": "https://media.rawg.io/media/screenshots/1e8/1e85b59a332ce6c3ef02437f33d94b14.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Outhouse Media"], "genres": [], "publishers": [], "esrb_rating": null}