{"id": 6824, "slug": "boogey-boy", "name": "Boogey Boy", "name_original": "Boogey Boy", "description": "It’s time for bed and the boogeyman is out to get you! Can you escape your nightmares?<br/><br/>Boogey Boy is a 3D side-scrolling runner. Escape the boogeyman by collecting batteries to activate your flashlight. Play through the boy&amp;#39;s dreamworlds, dodging strange and bizarre enemies. Activate special powerups to help the boy escape from the terrors of the night.<br/><br/>Story and Arcade mode<br/>Play story mode to escape and defeat the boogeyman.<br/>Play arcade mode and go for the high score.<br/><br/>Vibrant and colorful 3D stages<br/>Make your way through five wild, whimsical stages.<br/>The stages are random every time. Every play is new and exciting!<br/><br/>Activate powerful abilities<br/>Defeat the monsters of the night with five different power-ups.<br/>Use powerups to change the way you play!<br/><br/>In-app purchases<br/>Just kidding. Pay once, play forever!<br/><br/>**NOTE: Optimized for iPad 2 and up, iPhone 4S and up.**<br/><br/>SlidDB top 50 of 2014<br/><br/>===== REVIEWS =====<br/><br/>“It is a colorful, action-filled platforming game that will easily draw you into its clutches” – Droidgamers<br/><br/>“Addictive platforming at it’s finest!” – Withinthegame<br/><br/>“A compelling platform runner for iOS”” – iphoneitalia<br/><br/>“My love for Boogey Boy comes from the art. The look is really dream-like and surreal” – Crotchetyoldgamer", "metacritic": null, "released": "2014-09-08", "tba": false, "updated": "2019-10-22T14:29:02", "background_image": "https://media.rawg.io/media/screenshots/244/2440c656a72ecf8d0dc0e647cfc00ee7.jpeg", "website": "http://www.goonstudios.com/boogeyboy/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 134, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Goon Studios"], "genres": ["Action", "Arcade"], "publishers": ["Goon Studios"], "esrb_rating": "Everyone 10+"}