{"id": 682559, "slug": "magne-tech-prototype-v1", "name": "MAGNE-TECH Prototype V1", "name_original": "MAGNE-TECH Prototype V1", "description": "<p>Hi, we are a student game dev team, we would be very grateful if you could give us any feedback on our WIP game project 😊🙏</p>\n<p>Download game link at bottom of page.</p>\n<p><em>After playing please answer this short questionnaire: https://forms.gle/p6xZNzSYELRDPGYH7</em></p>\n<p><em>We'd love to hear your feedback so we can refine our next build.</em></p>\n<p><em><br/>Thank you very much - </em></p>\n\n<p>----------------------------------------------------------------------<br/></p>\n<p><strong>How to play &amp; Game description:</strong></p>\n<p>You are a damaged and obsolete worker robot, but you want to escape this facility rather than become scrap metal, and your only way to salvation is with your <strong>magnet pod firing tool gun</strong>.</p>\n<p>The overall aim of our game is to use nothing but your magnet pod tool gun to solve the puzzle in each area to progress to the next area.<br/><br/></p>\n<ul><li>Magnetic materials are the only interactable surfaces/objects you can manipulate directly to achieve this goal.<br/><br/></li><li>Your gun shoots magnet pods, they work in pairs.<br/>Shoot Pod 1 on Object A &amp; Pod 2 on Object B, these 2 objects will then move towards each other and/or snap together with magnetic forces.<br/></li></ul>\n<ul><li>Recall the magnet pods to reuse as many times as you need, there is no limit or ammo to worry about.<br/><br/></li><li>Experimentation is key, what can be moved? what can be broken?, what can be combined with something else to solve a problem? try everything! <br/>Try to think logically about mass, physics and magnetic forces to solve puzzles.<br/><br/></li><li>You can collect a maximum of 3 pod pairs to use as you progress, red, green and blue pod pairs, but don't worry, each pod pair only reacts magnetically to its paired colour pod while ignoring the other pairs.<br/><br/></li><li>With each pod pair collected, you now weild more magnetic power and also more strategies to use multiple pod pairs at the same time to achieve something.<br/>Eg. Something previously too heavy could now possibly be moved with 2 or 3 pod pairs. <br/>Maybe a door needs 1 pod pair to hold it open but you needed a 2nd pod pair to pull something through it etc</li></ul>\n<p>----------------------------------------------------------------------\r\n</p>\n<p><strong>Controls:</strong></p><p>- R key resets WHOLE game not the room, just FYI.<br/>- ESC to close game (there's no pause so be careful)<br/>- WASD to move.<br/>- Space to jump.<br/>- LMB to shoot a magnetic pod.<br/>- RMB (hold) to recall a specific pod pair (when aiming at a pod)<br/>- Shift + RMB recall all fired pods.<br/>- MMB / Mouse wheel button reverses magnetic polarity of pod pair you're aiming at.</p>\n<p>No fall damage or health.<br/>No crouch.<br/>No run.</p>\n<p>Known bugs/issues: <br/>Player sometimes may get stuck on edges of objects &amp; unable to jump. (fixed in current WIP build)<br/></p>\n<p>----------------------------------------------------------------------</p>\n<p><em>Have fun! and cheers for playing!</em></p>", "metacritic": null, "released": "2021-10-19", "tba": false, "updated": "2021-10-22T08:58:20", "background_image": "https://media.rawg.io/media/screenshots/3b5/3b5f6e110a1c4fc7621ff91726a8bad0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 208, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Team CHONK"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}