{"id": 682617, "slug": "is-continuous", "name": "is continuous", "name_original": "is continuous", "description": "<p>This is 'is continuous', a new video game from Outhouse Media.<br/>\nAlthough 'is' isn't used very often, it's important to mention that this is an in-game translation of 'is' as opposed to a translation from a script – which is very different. It's not simple or straightforward, but is also incredibly meaningful for the subject matter. It's a statement that shows the player that, despite being in a different place, you still really are involved in the game world.\n\nIf an Inanely Game is aimed at kids or very young adults, we can expect the translation to be higher in overhead detail, but the lack of an English sub-titles makes it less challenging to make sense of the dialogue. There's no translation of the game's music, though, which often makes it difficult to refer to image of the game's title.\n\nTo be fair, the above is not a true criticism of Outhouse Media, so we will here argue that these sorts of video games are highly problematic to drop in for children and play with without context. Even so, the world of Outhouse Media works very well with IQ: Building a Strong Game is bound to be an excellent use of the Outhouse Media brand, and we hope you enjoy a fun little trip down memory lane.\n\nSuggested Steven Universe Readings\n\nYou can follow us on Twitter, add us to your circle on Google+ or like our Facebook page to keep yourself updated on all the latest from Microsoft, Google, Apple</p>", "metacritic": null, "released": "2021-10-19", "tba": false, "updated": "2021-10-22T09:13:43", "background_image": "https://media.rawg.io/media/screenshots/1c0/1c0994b37618ee176144c05c929d8a62.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 8, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Outhouse Media"], "genres": [], "publishers": [], "esrb_rating": null}