{"id": 682674, "slug": "that-make", "name": "that make", "name_original": "that make", "description": "<p>This is 'that make', a new video game from Outhouse Media. Released last month, the game gives players a tour of an abandoned town called Cale had taken over. The community there, they say, is around around 50 people, and the town itself is even smaller.<br/>\nThe town crumbles, leaving behind a squalid, abandoned landscape, complete with broken windows and damp dirt road. Unfortunately for the townspeople, there is nothing left but the ruins of the old town, the derelict remains of buildings that once were part of this much larger place.\n\nYou play as Michael, who volunteers to build a rudimentary radar station and guide his two rat-like neighbors who have found the place to him. Together they must save Cale from arriving a giant monster that is threatening to destroy them all.\n\n\"There's lots of things about the game that have gone out of the box,\" says Outhouse's Marvin Hoffman, referring to the game's presentation. \"It's quite an interesting take on a natural disaster movie. We've had a lot of people saying 'what could have happened here?' and the answer is, 'that make'. It's like the game itself is part of the disaster, but you're helping make it happen.\"\n\nWe've had a lot of people saying 'what could have happened here?' and the answer is, 'that make'. It's like the game itself is part of the disaster, but you're helping make it happen. — Marvin Hoffman, Outhouse Media\n\nThe</p>", "metacritic": null, "released": "2021-10-18", "tba": false, "updated": "2021-10-22T09:27:23", "background_image": "https://media.rawg.io/media/screenshots/f3c/f3ca157a57f23c774f878f69f05669f3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 9, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Outhouse Media"], "genres": [], "publishers": [], "esrb_rating": null}