{"id": 682731, "slug": "through-mid-october", "name": "through mid-October,", "name_original": "through mid-October,", "description": "<p>This is 'through mid-October,', a new video game from Outhouse Media.<br/>\nWow, that sounds like an exciting time. I'm curious. What did you do for a while? Did you get your own studio? Did you work with EA? How long?\n\nOh, yeah. I got my own studio, which was pretty much based at EA. There was no other studio in Montreal in late 2012. It was basically just me working at EA, walking around, playing video games. We didn't have a particular studio location. We had one outside Montreal called \"Outhouse Media.\" Then we had a proper studio in the northern suburbs of Montreal.\n\nYou were part of an EA studio, but the studio locations were different, too. The studio was in an apartment building in the tower, whereas you could go to an office at 200 Constituency Place. What were some of the differences between the two studios?\n\nWell, the goal of the studio is, we wanted to make something unique and creative, and we wanted to bring the games that we love from Montreal to the world. Our studios happened to be in the same building. We'll always be close friends with them because they were always looking for ways to be creative.\n\nHow did you go about hiring?\n\nWe looked at everyone we knew, and obviously went to the CBC, which is a major television network in Montreal. So we tried to reach over and reach out to all of those people. We went to see if there were any opportunities, and</p>", "metacritic": null, "released": "2021-10-18", "tba": false, "updated": "2021-10-22T09:40:32", "background_image": "https://media.rawg.io/media/screenshots/f19/f194014626ff7d6c74d19ca245d0d808.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 8, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Outhouse Media"], "genres": [], "publishers": [], "esrb_rating": null}