{"id": 682850, "slug": "rumsfeld-game", "name": "Rumsfeld Game", "name_original": "Rumsfeld Game", "description": "<p>This is 'Rumsfeld Game', a new video game from Outhouse Media. 'Rumsfeld', the title of the 16-bit video game, even had a humorous political spin released years later. One of the characters was Larry the Cat and it was set in a dystopian future where the United States had been overrun by terrorists. In a campaign to save the world, players take control of an evil leader (the closest analogue to President Obama) who is determined to bring about a return to the glory days of American dominance.<br/>\nThe game comes with a selection of 'Rumsfeld Game' characters, and jokes and commentary. The game was created by a 1st generation college student who earned a degree in game design, and Blemish is one of the game's lead creators. Blemish also designed 'Spectral Voices', the first video game to give a voice to all the people who have never heard a voice in their life.\n\nOther members of the Blemish family have also worked on a number of video games such as Grid 2: Simulation + Design and Sudden Strike Underground.\n\nWhen asked by Grand Theft Auto Online why he did not try to work with the President, Blemish responded, \"I had to study international relations, so I didn't know how to think about it and I was influenced by Bruce Willis, on the other hand when I was younger I felt I could do something different with that. The most important thing was that I was still trying to steer myself away from games,\" he shared.</p>", "metacritic": null, "released": "2021-10-18", "tba": false, "updated": "2021-10-22T10:10:23", "background_image": "https://media.rawg.io/media/screenshots/fc0/fc0d52905b9f397c67f67ed95ebe30f4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 18, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Outhouse Media"], "genres": [], "publishers": [], "esrb_rating": null}