{"id": 683, "slug": "sonic-sega-all-stars-racing", "name": "Sonic & SEGA All-Stars Racing", "name_original": "Sonic & SEGA All-Stars Racing", "description": "<p>SONIC AND SEGA ALL-STARS RACE FOR VICTORY IN A HIGH SPEED HIGH SKILL RACETRACK SHOWDOWN!<br />\nTAKE TO THE TRACK BY CAR, MONSTER TRUCK, BIKE AND EVEN AEROPLANE IN SONIC &amp; SEGA ALL-STARS RACING.<br />\nExplore stunning new circuits including Sonic Seaside Hill, Curien Mansion and Blizzard Castle as you zip around medieval castle ramparts, hurtle under lush rain forest canopies and tear through bustling city scapes in a frantic race to the finish line. Jostle against a selection of 20 challengers including Super Monkey Ball’s Ai Ai, Amigo from Samba and the evil Dr. Eggman in your unique character vehicle. Stay ahead of the pack by dodging traps and launching outrageous character moves such as the invincible Super Sonic, Banana Blitz assault of monkey balls or Tails wild Tornado - set to throw any vehicle clean in the air! But if you’ve been battered, beaten and broken, it’s not over yet! Super-charge your vehicle with power-ups to get back in the race and be sure to stay alert for the secret short-cuts that will give you the edge to victory.<br />\nParty Racing Fun - Battle it out in single player, challenge your friends in 4 player split-screen for the ultimate track racing showdown!<br />\nAll Your Favorite Racers - Choose from 20 different characters from the Sonic &amp; SEGA universe including Sonic, Tails, Aiai and Amigo.<br />\nHigh Velocity Vehicles - Every character drives their own unique vehicle including sports cars, bikes, planes and even a giant banana to perform bespoke special man-oeuvres!<br />\nAll-Star Moves - Need to get by a competitor? Can’t overtake a racer? Then take them out with a pick-up weapon (missiles, mines and other obstacles) or one of the 20 unique character moves that allows the recipient to know who just hit them!<br />\nStunning Visuals - Race over medieval castle ramparts, under lush rain forest canopies and through bustling city scapes as you battle through 27 challenging tracks from the Sonic and SEGA Universe.</p>", "metacritic": 65, "released": "2010-02-23", "tba": false, "updated": "2024-01-18T07:24:02", "background_image": "https://media.rawg.io/media/screenshots/4d5/4d558909512d99baeca227b50ff34595.jpg", "website": "http://www.sega.com/sonicracing/", "rating": 3.68, "rating_top": 4, "added_by_status": {"yet": 76, "owned": 1243, "beaten": 110, "toplay": 17, "dropped": 69, "playing": 5}, "playtime": 1, "achievements_count": 43, "ratings_count": 140, "suggestions_count": 513, "game_series_count": 62, "reviews_count": 141, "platforms": ["PlayStation 3", "Xbox 360", "Android", "iOS", "PC", "Nintendo DS", "Wii"], "developers": ["Sumo Digital"], "genres": ["Racing"], "publishers": ["SEGA"], "esrb_rating": "Everyone 10+"}