{"id": 683206, "slug": "golf-solitaire-simple", "name": "Golf Solitaire Simple", "name_original": "Golf Solitaire Simple", "description": "A simple Golf Solitaire game with several common rule variations and a challenge mode with more than 100 levels! Can you beat all 100+ levels?<br/><br/><strong>How to play</strong><br/><br/>Move the topmost tableau cards to the waste pile, one at a time, as long as they are one up or one down in rank (suits do not matter).  So, if your top waste card is a 7, for example, you may remove any 6s or 8s from the tableau.<br/><br/>In traditional Golf rules, aces are always low, and you may build A-2-A but not 2-A-K. You may not build up or down on a king at all.  If you take a king from a tableau or deal one from the deck, simply deal another card from the deck and move along to the next tee.  You may play through the stock pile only once.<br/><br/><strong>Winning</strong><br/><br/>The goal is to clear away the entire tableau, moving all cards to a single waste pile.  At the end of the game, count how many cards are left in the tableau; this is your score -- the lower the score, the better.<br/><br/><strong>Common variations on these rules include:</strong><br/><br/><ul><li> Queens may be played on top of Kings.<br/></li><li> Turning the corner is permitted so that a King can be played on top of an Ace, and vice versa.<br/></li><li> One or both of the Jokers may be added to the deck and used as wild cards that represent any value.<br/></li><li> The foundation pile can start off empty, so players can choose one of the exposed cards to move them to the foundation for a \"head-start\".</li></ul>", "metacritic": null, "released": "2021-10-22", "tba": false, "updated": "2021-10-25T02:37:14", "background_image": "https://media.rawg.io/media/screenshots/978/978e03a72ec6f5eb34be64a660387be5.jpg", "website": "https://joustingknightgames.com/games/golf-solitaire/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 64, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Jousting Knight Games"], "genres": ["Casual"], "publishers": ["Jousting Knight Games"], "esrb_rating": null}