{"id": 683204, "slug": "lifing-2", "name": "Lifing", "name_original": "Lifing", "description": "Lifing is a challenging turn-card-roguelike base game, set in a mix of fantasy/sci fi/random universe breaking limits of card and deck manipulation.<br/><br/><h3>Features</h3>Play one of 24 different characters, each with a unique starting deck, spaceship layout and playstyle.<br/><br/>Explore the 8 planets of the Gnifil galaxy, each with their own biomes and wildlife.<br/><br/>Jump from island to island, golf style, battle hostile creatures, collect rewards and use them to upgrade your deck and spaceship.<br/><br/><br/><br/>Over 750 upgradable cards including units, structures, abilities, items, spaceship modules and modifiers.<br/><br/>Modify cards and your deck without limitations easily creating very powerful beasts, or just get unlucky and lose them.<br/><br/>Ending a campaign will trigger a new game plus mode with extra challenges and features, making all runs unique, adding replayability to the game.<br/>All sorts of mini games, secrets and other shenanigans will become available during runs, that will help you get stronger, better and smarter... maybe not the last one.<br/><br/><br/><br/>Each unique character has an intriguing, mysterious or humorous story to be told.<br/><br/>Disguised as a casual, easy game, Lifing will challenge players with a steep learning curve attenuated by luck and wisdom.<br/><br/>Unlock new items and characters by spending points earned from previous successful or unsuccessful runs.", "metacritic": null, "released": "2021-10-22", "tba": false, "updated": "2021-10-25T02:35:51", "background_image": "https://media.rawg.io/media/screenshots/1df/1df807dece7495e2d3af098254810061.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 254, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Machine Nun"], "genres": ["Strategy", "Indie"], "publishers": ["Machine Nun"], "esrb_rating": null}