{"id": 6832, "slug": "gravbot", "name": "GravBot", "name_original": "GravBot", "description": "Get ready to defy the law of gravity in GravBot, the latest game from the folks who brought you Bounce On, Phobic Studios!<br/><br/>GravBot is a physics-based puzzle platformer, where you decide which way is &amp;quot;up&amp;quot; as a little robot falls and pivots through each level.  Collect all the batteries to win, but watch out.  A wrong move could be deadly!<br/><br/>Each level presents a unique challenge.  Find the right path, avoid enemies, spike traps and laser beams.  Use levers, buttons and elevators to solve the puzzles.  GravBot is fun for all ages, but with the game&amp;#39;s physics, the simplest solution isn&amp;#39;t always what it seems!  Challenge yourself to earn a bronze, silver or gold metal for the smallest number of pivots needed to complete the level, then compete with your friends on Game Center Leaderboards.<br/><br/>★★★★★★★★★★★★★★★★★★★★★<br/><br/>GravBot has been featured by Apple as &amp;quot;iPhone Game of the Week&amp;quot;<br/><br/>Featured under Kotaku&amp;#39;s &amp;quot;iPhone&amp;#39;s Best Free Games&amp;quot;<br/><br/>&amp;quot;GravBot is puzzle platforming at it’s finest&amp;quot; - App Advice<br/><br/>&amp;quot;Not everyday you get a game that has both gameplay and graphics right. &amp;quot; - Nine Over Ten<br/><br/>&amp;quot;There&amp;#39;s really not anything I don&amp;#39;t like about GravBot, and it has become one of my most favorite puzzle games that I&amp;#39;ve played on the iPhone.&amp;quot; - Touch Arcade<br/><br/>★★★★★★★★★★★★★★★★★★★★★<br/><br/>GravBot includes twenty-two levels you can play for free!  Then, if you&amp;#39;re up for the challenge, two add-on level packs are available for purchase, each with twenty more levels for you to play!<br/><br/>Game Highlights:<br/><br/> * Play 12 levels for free + 10 free Halloween Levels!<br/> * Two level packs with twenty levels each, available for purchase<br/> * High resolution support for Retina Display<br/> * Share your scores on Twitter<br/> * Compete on Game Center Leaderboards and collect achievements<br/> * Easy intuitive controls suitable for all ages<br/><br/>If you like GravBot, be sure to check out Phobic Studios&amp;#39; other games: Bounce On, Bounce On 2, Tunnel Shoot, iTD, Undead Ocean and Glow Bugs.  Follow @phobicstudios on twitter, or find us on Facebook!", "metacritic": null, "released": "2010-09-30", "tba": false, "updated": "2019-10-22T14:29:02", "background_image": "https://media.rawg.io/media/screenshots/b14/b144642d89900d7a3d0c725afe463a78.jpeg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 188, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Team Phobic"], "genres": ["Strategy", "Puzzle"], "publishers": ["Team Phobic"], "esrb_rating": "Everyone 10+"}