{"id": 683347, "slug": "terranova-strategy-survival", "name": "TerraNova: Strategy & Survival", "name_original": "TerraNova: Strategy & Survival", "description": "TERRA NOVA : Strategy of Survival<br/><br/>* The action begins in 2050, when humanity by their ignorance destroyed the Earth. The colony you are about to develop is the only salvation for you and the people who have followed you, as well as those who will join you along the way.<br/><br/>* The hostile environment as well as the interactions with other groups of people make the experience unique.<br/><br/>* You will need to research and build the infrastructure and buildings for the colony and make sure that they all have the resources they need to live and thrive.<br/><br/>* Discover the big map around the colony and send research teams in missions to find a way for a better life.<br/><br/>* Make wise decisions when your colonists ask for your opinion or ask for your help because the welfare and the future of the colony will depend on you.<br/><br/>* Some people will join the colony but other groups will attack it. And not just people ... you will find out about this in the long run.<br/><br/>*Decide if you want to get in touch with people who pass by, accept or not those who want to join, trust others or not, fight if necessary, trade with other groups and most importantly, keep them all alive!<br/><br/>* ... and many more you will see in the game.<br/><br/>** More about:<br/>• RTS(Real Time Strategy);<br/>• Offline game(no internet needed to play);<br/>• FREE to play; <br/>• Fine graphics;<br/>• Grate gameplay and mechanics;<br/>• Game story modeled by your decisions;<br/>• More and more future updates.<br/><br/>*** This game was made by BENDIS Games, it is the work of a single person and I would be grateful for any feedback and ideas, this will help me develop this game further and for you to have a gaming experience as you wish.<br/><br/>I am waiting for opinions or ideas here in comments or <br/>-Website: www.BendisGames.tk<br/>-Facebook: www.facebook.com/BendisGames<br/>-Mail: bendisgamesstudio@gmail.com", "metacritic": null, "released": "2020-11-22", "tba": false, "updated": "2021-10-25T04:10:15", "background_image": "https://media.rawg.io/media/screenshots/a72/a7230aea1c7fe461c3a3f694e262d865_RZnJoSL.jpg", "website": "http://www.bendisgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 222, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Andrei Radu"], "genres": ["Strategy", "Simulation"], "publishers": ["Andrei Radu"], "esrb_rating": "Everyone 10+"}