{"id": 683346, "slug": "afk-heroes-idle-rpg-arena", "name": "AFK Heroes: Idle RPG Arena", "name_original": "AFK Heroes: Idle RPG Arena", "description": "Multiverse and superhero-themed Idle RPG. Lead your team of superheroes to venture deep into the mystery parallel universe and save the ruined world invaded by the Undead and darkness!\t<br/> <br/>#Background Story#\t<br/>Millions of years ago, the ancient mysterious race of the universe, the Gods, came to the earth and carried out a genetic experiment. They create three races, the ancestor of modern human beings, the Undead and the Eternals.\t<br/>The Undead, who are hidden in the depths of the earth, have developed a powerful weapon technology, and created a super technology civilization that stimulates the body's special functions. The extremely ambitious Undead are unwilling to stay below the earth's surface all the time and begin to prepare and carry out the plan of ruling the earth.\t<br/>The Undead encroach on the territory of the human beings, and enslave them to make more powerful weapons. The Eternals awaken their own super power and declare the war on the Undead hand in hand with the human beings.\t<br/>The exciting story begins…\t<br/> <br/>#Game Features#\t<br/>【ETERNALS REVIVE, NEW ADVENTURE START】\t<br/>The Undead invade, the Eternals revive, and a brand new chapter of fantasy and adventure starts. Free up your hands and enjoy the fun as the auto-battle system takes the strain. No complicated gestures or strategies needed. Your heroes will fight and amass riches for you. The only one thing is to claim the rewards and train your heroes in a few minutes a day. Join us and enjoy the fantasy adventure!\t<br/> <br/>【WARRIORS RECRUIT, SET UP SUPERHERO SQUAD】\t<br/>There are more than one hundred epic superheroes waiting for you in the hero tavern. The heroes are designed from five camps with different combat attributes. Build your strongest superheroes team and dominate the peak arena. \t<br/> <br/>【SPACE CHALLENGE, EXPLORE THE MYSTERIES OF MULTIVERSE】\t<br/>Choosing different hero camps, using professional attributes to restrain others, changing the heroes' positions, and adjusting the artifact equipment will all reverse the final war situation. You can experience hundreds of combinations and variable tactics in AFK Heroes. Defeat the ultimate boss and explore the mystery of the multiverse.\t<br/> <br/>【PEAK ARENA, ETERNALS VS UNDEAD】\t<br/>Unique style and multiverse-themed Idle RPG. When the ancient run into the future, magic combined with sci-fi, the Orient and the Occident are fused, the unique and fantasy battle world is created. Let's enjoy the final battle between justice and evil in the new parallel universe! Who will win the final competition between the Eternals and the Undead?\t<br/> <br/>【COOL EXPERIENCE, MASSIVE REWARDS WAITING FOR YOU】\t<br/>Hero expedition, infinite campaign, exclusive equipment, mysterious shop, legendary artifact, afk global arena, boss challenge, exploration zone, endless mode, championship competition, alliance altar, dozens of game playing methods and massive benefits are waiting for you.\t<br/> <br/>Limited amount legendary heroes are available for free currently, download AFK Heroes now, join millions of adventurers and enjoy the fantasy experience! Form your heroes and battle for victory!<br/><br/>#Contact Us<br/>Facebook: https://www.facebook.com/Idle-Battles-1635110626787952<br/>QQ: 947579634", "metacritic": null, "released": "2020-07-31", "tba": false, "updated": "2021-10-25T04:09:36", "background_image": "https://media.rawg.io/media/screenshots/b1e/b1ea2914479eec71541ce2099dc52fad_Pbt2H75.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 138, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["caesars"], "genres": ["RPG", "Strategy"], "publishers": ["YunPeng Shen"], "esrb_rating": "Everyone 10+"}