{"id": 683322, "slug": "winter-survival-battle-royale", "name": "Winter Survival Battle Royale", "name_original": "Winter Survival Battle Royale", "description": "Made for mobile, Winter Survival Battle Royale is a Casual Battle Royale Online Shooting Game for everyone to enjoy. Survival Shooting Game with Battle Squad Mode in PVP Battleground. is a Casual Battle Royale Online shooting game for everyone to enjoy. Enter the Snow battle arena and become the #1 SHARPSHOOTER in this thrilling PVP Counter Attack battleground. <br/><br/>Ultimate survival shooter game available on mobile with free guns game and brawl in modern strike battle arena experience battle Royale mode. In this free shooting game, you have a vast variety of style weapons, Winter-like environments, and intense battleground shooting. Easy-to-use controls and smooth graphics promise the best winter shooting survival battle royale experience you will find on mobile.<br/><br/><br/>Winter Survival Battle Royale is a Casual Battle Royale Online Shooting Game for everyone to enjoy. Survival Shooting Game with Battle Squad Mode in PVP Battleground.<br/><br/>Winter Survival Battle Royale Features :<br/><br/>• Enjoy breathtaking 3D GRAPHICS<br/>• Try intuitively easy controls - SWIPE, ZOOM, SHOOT!<br/>• Develop your COMBAT CAREER<br/>• Ally with your friends and create an UNSTOPPABLE BATTLE SQUAD!<br/>•Real-time fast-paced MATCHES against players from all over the world!<br/>• TEAM PLAY! Join forces with a Battleground Buddy and play together.<br/>• MEGA REWARDS! Collect new characters, emotes, and parachutes as you level up.<br/>• Unlock rewards and flaunt them in the arena battle.<br/>• HUGE game map to explore. Parachute into your area of choice<br/>• Tons of ITEMS to loot!.", "metacritic": null, "released": "2021-04-14", "tba": false, "updated": "2021-10-25T03:54:16", "background_image": "https://media.rawg.io/media/screenshots/d87/d8726d6197eb932e3e07230d2cd027ce_BhLwxgx.jpg", "website": "https://sites.google.com/view/limelightstudios/home", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 189, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Hamza Sher"], "genres": ["Action", "Adventure"], "publishers": ["Hamza Sher"], "esrb_rating": "Mature"}