{"id": 683302, "slug": "legends-of-libra", "name": "Legends of Libra", "name_original": "Legends of Libra", "description": "If you love action-packed adventure games, Legends of Libra is a fantasy game that you will have to try yourself to see how awesome it is. Play alone or with friends, and participate in an exciting multiplayer RPG game. Pick up your epic hero, choose your weapon and brawl against evil creatures. Be a hero star!<br/>Set foot on battle lands and join the fight right now by clicking the install button!<br/><br/>START YOUR EPIC FIGHT!<br/>Start your adventure with Abe, a grumpy but kind-hearted jungle dweller, or Clara - smart and danger-seeking  scientist, and take them on a memorable journey through action-packed levels. Defeat hordes of enemies and archero warriors unlock new heroes and restore balance in the universe.<br/>Every battle counts! Collect gold, gather blueprints, get weapons and equipment, upgrade them to beat powerful enemies and unique bosses, and become a true Legend of Libra.<br/>Choose between fast, powerful, or balanced weapons and discover your playstyle. Combine that with the right armor, gun, sword, bow, arrow, helmet, and trinket and you will become unstoppable.<br/>Get legendary weapons that enhance your skills or grant you unique abilities.<br/><br/>Work together in coop events to gather gold, resources and equipment, or compete against each other in the arena and gain fortune and glory by becoming the star of Libra.<br/><br/>Enter one of many Libra temples throughout the world, and discover their secrets. Each temple has a portal that leads to mysterious worlds among the stars. Avoid traps and bullets, solve puzzles, and race against time in this alien world and bring valuable loot back to your world.<br/><br/><br/>• Simple and intuitive controls to play on the go.<br/>• Upgrade your character with powerful talents.<br/>• Enhance your equipment and fuse it together.<br/>• Combine skills to max out their potential.<br/>• Fight unique enemies and bosses.<br/>• Explore colorful worlds.<br/>• Discover loot-packed bonus levels.<br/>• Play daily events to get awesome rewards.", "metacritic": null, "released": "2021-10-15", "tba": false, "updated": "2021-10-25T03:42:51", "background_image": "https://media.rawg.io/media/screenshots/924/924855e156003a07f623ab77926f0359_7uPgQYZ.jpg", "website": "https://legendsoflibra.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 138, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["SOZAP"], "genres": ["Action", "Adventure"], "publishers": ["SOZAP"], "esrb_rating": "Everyone 10+"}