{"id": 683307, "slug": "crack-shooter", "name": "Crack Shooter", "name_original": "Crack Shooter", "description": "《Crack Shooter》 will keep you on your toes in with a fluid and satisfying shooting experience via simple virtual joystick controls.  <br/><br/>---Wild West Adventure--- <br/>A group of cowboys called 'Trailblazers' ventured into the wild west and eventually settled there. Leaving the civilized world behind, they toiled and struggled, gaining their foothold on this harsh land and started their farm. Life seemed peaceful. But good times never last…… <br/>Mysterious creatures seemingly crawled out of nowhere, ruining the farmlands and assaulting anyone they come across. Be the hero you used to be. Protect the folks and eliminate these vermins! Save Kidd's lover, don't keep him waiting in despair!  <br/><br/>---Features--- <br/>-Smooth virtual joystick control allows you to dodge and roll however you want. Evade the bullets and make it stylish! <br/>-Plenty of satisfying yet destructive abilities that wipe the enemies clean off the map! <br/>-Try out different combos with dozens of passive abilities. Level your way up and experiment with even more possibilities!  <br/>-Randomly generated stages that never repeat.  <br/><br/>--Are you ready for the wild west adventure?\"<br/><br/>\"Subscription:<br/>-We will block all in-game advertising for subscribers. You can obtain items directly, unlock corresponding functions, and enjoy a number of benefits.<br/>-The fee will be paid from your iTunes account after you confirm the purchase.<br/>-The user can manage the subscription, and automatic renewals can be turned off by modifying the user's account settings after purchase.<br/>-Please cancel the automatic renewal at least 24 hours before the end of the current period, otherwise, it will be automatically renewed, and the renewal fee will be deducted from your account.<br/>-Please be sure to complete it 24 hours before the end of your subscription in case the system charges you.<br/>-If applicable, any unused portion of the free trial period (if provided) will be forfeited when the user purchases a subscription to the publication.<br/>-If you unsubscribe, you will lose all aforementioned privileges.<br/>Terms of use and privacy policy:http://taplab.eyugame.com/mostbrain.htm", "metacritic": null, "released": "2019-12-03", "tba": false, "updated": "2021-10-25T03:45:24", "background_image": "https://media.rawg.io/media/screenshots/f56/f56e2516193b4595e00910b99c975eb1_laVhigg.jpg", "website": "http://www.gogogame.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 190, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Hui Ku"], "genres": ["Action", "Adventure"], "publishers": ["Hui Ku"], "esrb_rating": "Everyone 10+"}