{"id": 68345, "slug": "haunted-manor-hd-full", "name": "Haunted Manor HD FULL", "name_original": "Haunted Manor HD FULL", "description": "Just about anywhere you go, you'll hear a spooky story about “the house on the hill”.<br/>Legends of ghosts, blood, and murders spread suspicion and fear around town. If you happen to be at the smoky local tavern on a rainy night, most certainly you will hear fragments of wisdom about the house. These are stories within the story, quietly whispered by the locals as a warning to unwary newcomers. Be warned: these are stories which will never be openly acknowledged, so don’t even try to mention them outside of this circle...<br/><br/>There are many stories but one common theme... stay away from the \"Haunted Manor\".<br/><br/>That night I should have followed this advice. I should have stayed in the comfort of my warm hotel room... unfortunately curiosity prevailed!<br/><br/>Faithful to the legend, I arrived on a stormy night at the red blood cast iron gate of the old secluded mansion. After that... all hell broke loose!\"<br/><br/>How brave are you, young adventurer?<br/><br/>We shall see!<br/><br/>You are about to enter a land where anything and everything could happen. The house will test your heart, body and soul. If you can keep your composure, your mind open, and your wits together, you may succeed in taming the house.<br/><br/>\"Haunted Manor\" is an adventure game that will test your mental abilities and observation skills. You will have to explore the house and solve numerous, at times dark but always challenging riddles in order to progress through the game. If you succeed, you will finally discover and maybe solve the mystery of the secret kept hidden in the house...<br/><br/>This game is a one of a kind! The Haunted Manor is one of the best horror and frightening cinematic-like game experiences ever created on the iPhone.<br/><br/>Its graphics were created using the best 3D modeling techniques, film camera composition and high dynamic range photography techniques.<br/><br/>The incredible graphics are complemented by carefully crafted 3D sounds effects and a gloomy horror theme that will accompany you throughout the game.<br/><br/>These features, it's incredible story, and its cleverly crafted challenges make \"Haunted Manor\" the best horror and frightening puzzle game ever presented on the iPhone.<br/><br/>Features:<br/><br/>* A Great Horror Story<br/>* Classic and intuitive point and tap gameplay.<br/>* Amazingly funny and clever puzzles.<br/>* Many different environments to discover &amp; explore.<br/>* 3D Sounds e HDR photography techniques<br/>* Film camera composition<br/>* An interactive original &amp; unique storyline.<br/>* Superb game design.<br/>* High-resolution graphics optimized for retina display.<br/>* Multiple languages, AutoSave and much more...", "metacritic": null, "released": "2012-12-16", "tba": false, "updated": "2019-07-29T22:29:12", "background_image": "https://media.rawg.io/media/screenshots/8f6/8f666b00c23a424f028480dcc0bfff2c_GmduO6N.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 314, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["redBit games"], "genres": ["Adventure", "Puzzle"], "publishers": ["redBit games"], "esrb_rating": null}