{"id": 683566, "slug": "einsamkeit-halwende-the-2nd-episode-press-kit", "name": "Einsamkeit: Halwende the 2nd Episode Press Kit", "name_original": "Einsamkeit: Halwende the 2nd Episode Press Kit", "description": "Only those with a clean past deserve the chance of a bright future:\r\n<p>Following the events of the previous episode, some of those left alive begin to do all they can to make sure the game ends prematurely by forming an alliance. Others hide themselves from the world as they cower at the thought of their own demise, but such a thing is futile when ghosts from the contestants' pasts literally begin to haunt them. As insanity spreads, even if a contestant earns their reward for surviving these twisted events will they be too broken to appreciate it?</p>\n\r\n Their fate is in your hands: \r\n<p>In Einsamkeit: Halwende no one is too important to evade death. Anyone can die at any moment, and your choices decide who makes it out of the macabre game hosted at Motel 7 Heaven. Split into five episodes, there are many different endings and secrets to discover.</p>\n\r\n A story never seen before:\r\n<p>Einsamkeit: Halwende is comprised of many different story elements. While playing you will encounter mystery, drama, romance, surrealism, and various styles of horror from psychological, to slasher, and supernatural among others. All of these aspects are blended to create a truly unique and unpredictable plot unlike any other.</p>\n\r\n Characters:\r\n<p>The cast of Einsamkeit: Halwende is as diverse as it is compelling. With characters of multiple different life experiences, the unpredictability of the plot is only heightened.</p>\n\r\n Ainsley:\r\n\n<p>An employee at Motel 7 Heaven who wants nothing more than the end of human suffering. He only means well, but due to his lack of social skills he is often mistaken as a creepy individual.</p>\r\n Nyx:\r\n\n<p>A law student at the local college. Ever since high school she's claimed to have been stalked by a former foster sibling, but not only does no one believe her, no one seems to remember the atrocities the child committed when he stayed with her family as well.</p>\r\n Christie:\r\n\n<p>Nyx's roommate and one of her best friends. She's a very sociable girl who anyone can get along with, yet no one truly knows her or her past.</p>\r\n Layle:\r\n\n<p>A good friend of Christie and Nyx. He's at their school studying music theory, but because he comes from a well off family it’s often wondered why he ended up at the same school as the other two since he could've gone anywhere with his parents' coin.</p>\r\n Asreal:\r\n\n<p>The only therapist in town. He has somewhat of a god complex, and must always have control of any situation. As the therapist of some of the others—such as Lily and Nyx—he comes off as the one who holds the most standing in the game.</p>\r\n Lily:\r\n\n<p>A woman who has Asreal in the palm of her hand. She goes to him to ease her family who believes she has a strong addiction to sex, but there's more to her than anyone could fathom.</p>\r\n Dolores: \r\n\n<p>Known all over town for her insanity, Dolores is a woman beyond any salvation. She wants to kill Asreal Sullivan more than anything for reasons that made him quit the asylum he worked at before he started his own practice.</p>\r\n Travis:\r\n\n<p>As one of Dolores' twin sons, Travis has been bullied relentlessly for as long as he can remember because of his mother's reputation. He and his brother Trystin—who've freshly turned eighteen—want nothing more than to leave town, and with it their suffering.</p>\r\n Devon: \r\n\n<p>Also known as Super Remix, Devon is a boy who believes himself to be a hero of justice, and will punish anyone he deems evil without the slightest hesitation.</p>\r\n Erburus: \r\n\n<p>An eccentric amnesiac who knows nothing of his life beyond two years ago. He only ever speaks in esoterics, and for some reason has an obsession with Ainsley.</p>\r\n Toni: \r\n\n<p>One of the only two contestants who knows a bit about what's going on. She's as calculated and calm as she is beautiful, and she won't stop until she gets what she wants.</p>\r\n Cecil:\r\n<p>Toni's only friend, and the only other person who has an idea of what's happening. He's a hacker who makes his living by syphoning money from the upper class, though gives most of his earnings to those in need.</p>\r\n Thomas:\r\n\n<p>A boy much smarter than his age and appearance would suggest. He parades his mother around on a leash, as she can do nothing but drool and speak infant-like jargon.</p>", "metacritic": null, "released": "2021-10-24", "tba": false, "updated": "2021-10-25T05:08:42", "background_image": "https://media.rawg.io/media/screenshots/81c/81c44e2ae34a2b99673f4f12b59a1822.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 37, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Canaan"], "genres": [], "publishers": [], "esrb_rating": null}