{"id": 683939, "slug": "bewitching-brewery", "name": "Bewitching Brewery", "name_original": "Bewitching Brewery", "description": "Welcome to Bewitching Brewery! \r\n<p>Hurry and open up your shop! <br/>Potions, Poisons, Elixirs, Ointments .. you got them all! <br/>The line outside is also getting pretty long .. looks like your customers are eagerly waiting for you to brew them some of your magical concoctions!</p>\r\nWhat is Bewitching Brewery?\r\n<p>Bewitching Brewery is a 2D puzzle point&amp;click game, in which you, the witch, must combine ingredients to brew potions for the orders of your customers. </p>\n<br/>Choose one of many orders and create the perfect potion!\r\n<p>Help your clients in every life situation they may go through. Getting orders right, will make you a wiser witch, which lets you brew more advanced potions for your demanding customers.</p>\n\r\nUndecisive? Mix as many ingredients together as you want!\r\n<p>Some potions are easy to make and do not neccessarily require more than one or two ingredients. More advanced potions may need a combination of three to five ingredients, so be prepared for a lot of mixing! </p>\n\r\nUnlock over 15 different potions (including some easter eggs)\r\n<p>The more combinations you try, the more likely you are to learn new potions and unlock them in your recipe book. (Hint: There are 3 easter eggs hidden in the game, that no customer asks of you. Can you find them all?)</p>\n\r\nControls\r\n<ul><li>left mouse button - interact with everything</li><li>click book to see your recipe book, order list, options and credits</li><li>click ladle to finish brewing your potion and delivering your order</li><li>left/right arrow - turn page in the spellbook</li></ul>\n\r\nStill a WIP \r\n<p>For now you can't close the standalone game via ingame options, please use Alt + F4 or the task manager.\r\n</p>\r\n\r\nTeam\r\n<p>Engineer - David Schmidt<br/>2D Artist - Gem Koller<br/>2D Artist - Michelle Eibeck<br/>Designer - Martin Krüger<br/>Designer - Pia Zdila<br/>Music Composer - Heinrich Wallroth</p>", "metacritic": null, "released": "2021-10-24", "tba": false, "updated": "2021-10-25T06:41:03", "background_image": "https://media.rawg.io/media/screenshots/571/5713e2e9244768b5579ebcc3d3fd5e17.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 75, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["MichelleE", "SchmidtDavid", "thefrogstoes", "bluemoths", "grendel"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}