{"id": 684156, "slug": "the-occultist-old-growth", "name": "The Occultist: Old Growth", "name_original": "The Occultist: Old Growth", "description": "<p>INSTRUCTIONS: Right click to cycle between action types EXAMINE, INTERACT, and WALK TO. Left click on the screen to activate that action. The bag in the bottom left opens your inventory, the tools in the bottom right open settings.</p><p>STORY: Katherine O'Neill and her daughter Anna went missing in Willamette National Park near Salem, Oregon two weeks ago. As Ian James McDermott, you are lead investigator of ESPER,  a secret organization that helps stand in the gap between the darkness and the light, and right now, you may be the only one who can help...</p>\n<p>...because you are the one they call The Occultist.</p>\n<p>A point and click horror adventure made in Adventure Game Studio in ten days for Scream Jam 2021, this is the rebirth of an old series that went under the name E.S.P.E.R.. Left click to interact, look, or move the Occultist. Right click changes interaction type between Walk To, Interact, and Examine. The bag in the bottom left corner opens your inventory, and the wrench and screwdriver in the bottom right opens the Settings panel.</p>\n<p>All art and programming done by The Wandering Wizard, sound effects from www.freesound.org, and music from https://freepd.com/. </p>\n<p>KNOWN BUGS: One character moves slightly after they die. Right now, you cannot use one inventory item on another without a game crash, but it isn't necessary to do so. I also wasn't able to add a few of the scary elements I meant to toward the end of the game, and I haven't thoroughly playtested it yet, although BOTH endings are definitely achievable.</p>\n<p>I will be adding to this game, and working on a number of sequels. If anyone is interested in helping, that would be spectacular!</p>\n<p>Thanks for checking it out. Enjoy!</p>\n<p>TRIGGER WARNINGS: This game contains violence (some involving children), adult language, drug use, and an overall \"occult\" theme. </p>", "metacritic": null, "released": "2021-10-23", "tba": false, "updated": "2021-10-25T07:34:19", "background_image": "https://media.rawg.io/media/screenshots/31e/31e0e4d8c86edb2e38859b208293f478.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 69, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dog and a Half Entertainment"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}