{"id": 684179, "slug": "wave-itch-famoustree", "name": "wave (itch) (famoustree)", "name_original": "wave (itch) (famoustree)", "description": "<p>WARNING: This game might trigger epilepsy. There's some bright flashing colours, and there are a lot of bouncy objects being all noisy on the screen. I am not sure at what degree this might be an issue, but you know you best. Be advised.</p>\n<p>Jump over hazards to gain score. The entire game is designed as a puzzle to figure out the best route to gain the most score.<br/></p>\n<p>P.S. This game is kind of bullshit, it's hard and some of the hazards are following a five-stroke pattern which makes it feel unnatural. Sorry. :D</p>\r\nMaking your on tracks\r\n<p>While selecting a track to play, a save directory will show up in the top left corner. Going to that directory will have a template track stored under user-tracks. It's the same track as in the game. Copy-paste it, remove the .template extension and rename it to whatever you please. If you want custom music you can add it to the music directory. To use the music in a track, use the song filename, verbatim (with file extension), in your track.lua file. See the template. I've used a multiline string in moonscript, which for some reason compiles to single line lua strings.</p>\r\nSave data\r\n<p>This game stores data in a save directory that shows up in the top left corner while selecting a track. If you wish to delete all files created by this game, you'll need to delete this folder as well.</p>\r\nDistribution\r\n<p>This game is written in löve2d.</p>\n<p>This game is built for several targets, win32, win64, MacOS and almost linux.</p>\n<p>All builds were made following the steps on [external link] Game Distrubtion</p>\n<p>\n</p>\n<p>Win32/64 and MacOS should run out of the box. Running it on Linux will require you to get your hands on löve2d yourself, most package managers got it in their default repositories.</p>\n<p>If you don't want to download and run a random binary off the internet, download the source code and the resources. Get yourself löve2d 11.3 and moonscript. After compiling the sources, copy the resource dir into the output directory and you should be set. Run love2d with that output directory as a target.</p>\r\nWeb build?\r\n<p><strong>I added a web build, it seems a biiiiit janky, use at your own peril (also my vm loses connection to my firewall every five days or so, it might be down): https://memset.se/wave/</strong></p>", "metacritic": null, "released": "2021-10-23", "tba": false, "updated": "2021-10-25T07:38:55", "background_image": "https://media.rawg.io/media/screenshots/ed0/ed09b40bc837d99d8400ec3f77642c38.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 71, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["famoustree"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}