{"id": 684347, "slug": "winning-love-by-daylight-ep-1-2", "name": "Winning Love by Daylight [Ep 1 + 2]", "name_original": "Winning Love by Daylight [Ep 1 + 2]", "description": "<p>This is Maya who can control any device connected to electricity. She mostly uses it to crush at online video games.</p>\n\n\n<p>This is Kiana who has the strength to pick up a whole island, but is more interested in skateboarding and football. The best quarter back the school's ever seen.</p>\n\n<p>This is Emily, from a family of witches Emily is still learning to control her magical fire, and usually hangs out with her friends and her cat at the secret tavern her Aunt owns.</p>\n\n<p>This is Willow, she's the daughter of two druids, and the spirits of the forest have asked for her help!</p>\n<p>This is June, after inheriting a cursed sword that talks non-stop from her father, she mostly likes to meditate and try to find peace where she can.</p>\n\n\n<p>This is Alannah, and alien that accidentally crashed into our planet, and has been stuck her ever since. She's now studying super hard at high school to try and learn as much as she can about her new home planet.</p>\n\n<p>This is SoFi, a half-siren still trying to control her powers, and wears big headphones so that when she's singing along to something she doesn't put herself to sleep.</p>\n\n\n<p>This is Molly, granddaughter to the arch demon Moloch, she spends most of her magical energy to stop people from noticing her, so that she can live a low key life.</p>\n\n\n<p>The Winning Love by Daylight visual novel runs along the path of a student slowly realising that superheroes attend his high school. A Super villain has threatened to unmask any superhero vigilantes, as they've discovered they attend the school, and so all of the girls try to act as close to normal students as possible, but that isn't so easy...\r\n</p>\n<p>Travel through the story of the game which is part of an upcoming Boardgame, and is part of an online webcomic, as you learn more about the characters and their backstories and personalities, as you try and decide who you will invite to the prom.\r\n</p>", "metacritic": null, "released": "2021-10-23", "tba": false, "updated": "2021-10-25T08:26:35", "background_image": "https://media.rawg.io/media/screenshots/904/904450bff5a46d1d6226af45989d43a8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 190, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["CutlassBoardgame"], "genres": [], "publishers": [], "esrb_rating": null}