{"id": 684768, "slug": "causalitas-alpha", "name": "Causalitas (Alpha)", "name_original": "Causalitas (Alpha)", "description": "<p>Causalitas est un <strong>Visual Novel</strong> développé en cinq semaines dans le contexte d'un projet scolaire (<strong><em>ActivDesign</em></strong>, Rennes).<br/></p>\n<p>Ena Suzuki était une fille déterminée et pleine d'espoir, mais, à dix-sept ans, elle n'est plus que cynisme désabusé et ennui, la vie dans un japon réactionnaire lui ayant lentement écrasé tout ses rêves de devenir artiste.  <br/>Alors qu'une journée comme les autres semblaient sur le point de commencer dans un cycle sans fin de banalité, une rumeur inquiétante se propage dans le Lycée... Un élève normal aurait été retrouvé mort pour des raisons inexpliquées, mais avant même que la question soit creusée, l'établissement se mit à étouffer l'affaire. <br/></p>\n<p>Ce qui aurait dû être une simple histoire d'accident mystérieux devient alors un cauchemar sans fin, plongeant au plus profond de la nature humaine.</p>\n<p>Ena et ses amis devront trouver un moyen de démasquer la personne derrière tout cela, tout en faisant face à leurs propres problèmes personnels, à moins que ceux-ci se rassemblent tous en un point de convergence... ?<br/></p>\n<p><em>Découvrez une aventure à choix en quatre chapitres + un prologue et un épilogue aux trois fins différentes, pour peu que vos décisions aient réellement un impact... </em><br/></p>\n\n<p><strong>/!\\ AVERTISSEMENT /!\\</strong></p>\n<p><em>Ce jeu traite de sujets difficiles qui pourraient heurter la sensibilité de certains joueurs, bien que l'objectif soit d'apporter une réflexion positive et optimiste, les personnes souffrant de troubles d'anxiété et de dépressions sont déconseillées d'y jouer. </em><br/></p>\n<p><em><strong>Artistes derrière les assets libre de droits utilisés (Backgrounds) :</strong><br/></em></p>\n<p>GIAONP, HeHudojnik, Kjkjmulo, Anatoly Shaban, X-post rimaginaryinteriors, arsenixc, VVCephei, Dao Dao, Purrian_          <em>                                                                                                                                         <strong>      Musiques : </strong></em></p>\n<p>Shoji Meguro, Naoto Tanaka, Masafumi Takada, Yasumasa Kitagawa, Hiromitsu Maeba</p>\n\n<p><em>Jeu uniquement en français en version Alpha. Entièrement jouable mais possibilité de petites erreurs, possibles mises-à-jour à venir afin de rajouter des illustrations uniques lors des dialogues.</em><br/></p>", "metacritic": null, "released": "2021-10-22", "tba": false, "updated": "2021-10-25T10:14:56", "background_image": "https://media.rawg.io/media/screenshots/263/2636fcdb5ea9086aee943b94d54d2743.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 164, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Louis Néhou"], "genres": [], "publishers": [], "esrb_rating": null}