{"id": 684832, "slug": "mech-arena-mega-bots-robot-fighter", "name": "Mech Arena: Mega Bots Robot Fighter", "name_original": "Mech Arena: Mega Bots Robot Fighter", "description": "<p>Enjoy Battle Bot Style Of Robot Fighting In Wide Battle Arena!<br/></p>\n<p>Are you ready for the mini battle bot robot championship, then play this ultimate fighting robot and battle your way to the top of mech arena mega bots robot fighter. Mech arena mega bots robot fighter is minibots &amp; robot fighting game where you to kill other mega mech bots enemies to win the fight. Enroll yourself in battlebot style robot fighting arena to win championship title. Get ready for most powerful robot fighting machine fight for battle arena. Enter robot battle arena and matched with opponents, it will be crash fight a kind of real steel robot fighting to have endless robot fight. Enjoy real steel robot fighting.\r\n<br/></p>\n<p>In this mech arena mega bots robot fighter us boosters to surprise opponents robots. Enemies are more powerful and they can kill you as well in this mech arena mega bots robot fighter, don’t let them kill you activate well timed boosters in robot battle dodge attacks, deal with extra damage through speed. You robotic enemies are too fast so use your robot fighting skills to kill mini bots with this mech arena mega bots robot fighting. Be the part of this awesome robot battle arena championships.\r\n<br/></p>\n<p>Become more competitive and unlock new robots by winning bot fights in championship to get high rank. It’s an amazing robot fighting game, be prepared and quip your robotics battle machine with craziest, most brutal weapons and jump right into the robot fighting action games. The battle bot arena and mech arena mega bots robot fighter is the best robot from you. This is super chance to become ultimate robot fighting champion with your robotics skills.\r\n<br/></p>\n<p>Features:\r\n</p>\n<p>• High Quality Graphics\r\n</p>\n<p>• Astonishing But Realistic Sound Effects\r\n</p>\n<p>• Exciting Battlebot Fighting Experience With Parts Destruction\r\n</p>\n<p>• Battlebots Meet Cool Mecha Robot Battles\r\n</p>\n<p>• Championship Modes With Lots Of Mini Bots\r\n</p>", "metacritic": null, "released": "2021-10-09", "tba": false, "updated": "2021-10-25T10:31:11", "background_image": "https://media.rawg.io/media/screenshots/7ec/7ec78d40fbf11c857ec91a2336c42af9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 34, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["francolins.studio"], "genres": ["Action", "Shooter", "Adventure"], "publishers": [], "esrb_rating": null}