{"id": 684974, "slug": "prognostic", "name": "Prognostic", "name_original": "Prognostic", "description": "<strong>Prognostic </strong>is a first-person detective horror in which player will be able to master a wide range of realistic psychic practices and uncover secrets of the past. You play as an young man whose family died under mysterious circumstances. You are returning to the house of your insane grandmother in order to accept her legacy, become a highly talented medium, a prognostic, and find those who responsible for the death of your parents... If forces that you've conjured will not find you sooner.<h3>Lurking Horror </h3>Playing with the world of shadows comes with a price. Your predecessor, a deceased medium, had returned to demand her toll. She brought with herself an unknowable forces who will watch your every step. Can you uncover their secrets before they get to you?<h3>Fortune Teller Simulator </h3>Learn rituals based on historical divination methods. Rituals will allow you to directly experience rites, fully immerse yourself into the atmosphere of the mystery and protect yourself from the approaching nightmare... at least for a while.<h3>Mystical investigation </h3>Each new night brings a new crime. Uncover the secrets of the cursed town by reading the fate of its inhabitants. Seek for the killers, criminals and missing people, determine motives and try to understand why your home town has become the capital of murders. <br/><br/>What awaits you: <br/><ul><li> Uncover the secrets of <strong>unstoppable horror</strong>. <br/></li><li> Master <strong>rituals</strong> inspired by the culture of the Western Europe and Scandinavia. <br/></li><li> Feel the cards at your fingertips thanks to a <strong>realistic rethinking</strong> of each rite. <br/></li><li> <strong>Conduct investigations</strong> and look for criminals, relying on your own logic and the help of supernatural forces. <br/></li><li> Delve into <strong>dark secrets</strong> of local people. Find out what driving them mad. <br/></li><li> <strong>Open rooms</strong> of a huge house, gaining access to new methods of divination and secrets of your family. </li></ul>", "metacritic": null, "released": "2021-10-26", "tba": false, "updated": "2024-04-19T09:36:42", "background_image": "https://media.rawg.io/media/screenshots/985/985fd5886c050551c0ea7f5b69701e9f.jpg", "website": "", "rating": 3.43, "rating_top": 4, "added_by_status": {"yet": 1, "owned": 29, "beaten": 2, "toplay": 2, "dropped": 3}, "playtime": 1, "achievements_count": 0, "ratings_count": 6, "suggestions_count": 278, "game_series_count": 0, "reviews_count": 7, "platforms": ["PC"], "developers": ["Steppe Hare Studio"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Steppe Hare Studio"], "esrb_rating": null}