{"id": 684958, "slug": "g-modeakaibusu-nu-shou-ling-feng-da-wang-sheng-dx", "name": "G-MODEアーカイブス+ 怒首領蜂大往生DX", "name_original": "G-MODEアーカイブス+ 怒首領蜂大往生DX", "description": "“You will die.”<br/>Confirm it with your own eyes. See with your own eyes the most deadly barrage ever spread across your palms.<br/><br/>\"DoDonPachi DaiOuJou\" is a vertical scrolling shooting game released in 2002.<br/>Its challenging game system, detailed world view, and challenging difficulty level won the support of many users.<br/><br/>\"DoDonPachi DaiOuJou DX\", which is being reprinted as an archive, is a feature phone port of the same game.<br/>Not only can you take on the threatening barrage of bullets that the name \"DaiOuJou\" implies, but you can also compete with users all over the world in online ranking.<br/><br/>You can also change the difficulty level, select your ship type, and choose an elemental doll to suit your skill and preference.<br/>Whether you are a beginner or an expert in shooting games, this is the game for you. Whether you're a beginner or an expert, challenge the line of death and show off your deadly skills.<br/><br/><br/>■ About G-MODE Archives<br/>The G-MODE Archives is a reissue project that faithfully recreates old feature phone games as they were back then.<br/><br/>In order to enjoy the app as it was back then, the web-connected menu, buttons, and keys have been transplanted, but some of them may not work.<br/>For more information on the Steam version, press START button and see the \"How to play\" in the OPTION menu.", "metacritic": null, "released": null, "tba": false, "updated": "2021-10-29T03:24:11", "background_image": "https://media.rawg.io/media/screenshots/f04/f0409c1bef0015835a6dcab4c3a7b81e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 177, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["G-mode"], "genres": ["Action"], "publishers": ["G-Mode"], "esrb_rating": null}