{"id": 684993, "slug": "purgatory-2", "name": "P.U.R.G.A.T.O.R.Y", "name_original": "P.U.R.G.A.T.O.R.Y", "description": "<strong>Welcome to P.U.R.G.A.T.O.R.Y!</strong> Experimental dark comedy sandbox time killer. Weave through the swarm of souls entering death wanting voyage into their next life. It is your position to judge souls upon arrival, do they deem worthy of entrance to your vision of heaven, or hell? Maybe they deserve to be ground into tomato soup. Hundreds of possible souls will enter, we're human and we ain't perfect.<br/><br/><strong>So... what can you do?</strong><h3>BE A CONSERVASIONIST</h3>You can put souls into a 'meat' grinder, yes, <strong>really</strong>.<br/><br/><h3>PLAY SESSION UNLOCKS</h3>No hidden in-game purchases here. Put that ground soul juice to use on spendable abilities; cast Pestilence on souls and have their body gib into mush; perhaps something more tame? Have the devil perform an extreme cavity search on a handful of unfortunate souls!<br/><br/><br/><ul><li> <strong>Thunderbordem</strong>: Bored, drunk, Zeus begins throwing thunderbolts down from the heavens, evaporating souls on impact.<br/></li><li> <strong>Happy Aneurysm</strong>: Extra strong brain freeze.<br/></li><li> <strong>Like A Bat Outta Hell</strong>: There's a chance that facility bats will yeet a soul into hell. <br/></li><li> <strong>Wee Boot</strong>: Mouse clicks allow you to tw@ a soul into heaven or hell.<br/></li><li> <strong>Holy Piss</strong>: For a long minute, weather reports suggest a chance of dissolving.<br/><br/><strong>And more!</strong></li></ul><br/><h3>JUDGE THOSE SOULS</h3>It's up to you, does the soul in line deserve a rightful place in heaven, hell or the grinder? This is dark humour, humans are far from perfect or even nice; you may across some positively nasty people, watch out!<br/><br/><br/><h3>CAN'T WE ALL GET ALONG?</h3>There are 'unique' souls who may enter P.U.R.G.A.T.O.R.Y, political idiots and social morons; do as you wish with them honestly.<h3>EXTRA GOODIES</h3>There are achievements, just like every other game.<h3>MOD SUPPORT</h3>Mod support. <strong>MOD SUPPORT</strong>! Put your family and friends in <strong>P.U.R.G.A.T.O.R.Y </strong>and have a grotesque time with their after life.<br/><br/><h3>LOOSESCREW COMMUNITY</h3><br/>Join the LooseScrew Discord server to share your feedback and join in with discussion of our games.<br/><br/>", "metacritic": null, "released": "2021-10-27", "tba": false, "updated": "2021-10-29T03:50:31", "background_image": "https://media.rawg.io/media/screenshots/2b2/2b28327b6327bf583a294c7ffd1ccfd1.jpg", "website": "http://www.loosescrewgames.co.uk", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 17, "ratings_count": 0, "suggestions_count": 129, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["LooseScrew Games"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["LooseScrew Games"], "esrb_rating": null}