{"id": 684961, "slug": "reign-and-ruin", "name": "Reign and Ruin", "name_original": "Reign and Ruin", "description": "Reign and Ruin is an online multiplayer survival game, set in a medieval fantasy world. <br/><br/><strong>Do you enjoy action?</strong> Explore a vast, open-world in which you must survive the harsh elements, hunt to survive, establish a settlement, defend your home from raiders, slay monsters that crawled out of the void, and dominate all those who stand in your way!<br/><br/><strong>Do you enjoy roleplay?</strong> Craft dozens of different medieval fantasy outfits, plant crops or decorative florals in your farm, sightsee dozens of scenic locations, express yourself with a huge variety of emotes and dances, connect with others using voice chat, and live out your medieval fantasies!<br/><br/>Play together with friends and strangers as you adventure this beautiful and perilous new land. Build your own home or even a shared thriving citadel. Climb your way up from a lowly peasant to a mighty king. Hold the peace in the realm by hosting lavish banquets, or dominate your enemies in epic siege warfare!<br/><br/><strong>Enjoy Reign and Ruin in single-player, co-op, or persistent online multiplayer!</strong><br/><br/>War ravaged through most of the world: your homeland and everything you held dear was brought to ruin. After a powerful storm sinks the ship you stowed away on, your life is spared through divine intervention. When you gain consciousness, you find yourself in a far a more dangerous land. Despite the abundance of beauty and wonder before you, this realm is a battleground of banished gods. The exiled deities tear open rift portals from the void, sending forth their armies in an attempt to re-establish their ancient dominion.<br/><br/>Will you rise up against these divine beings to establish your reign, or will you meet you join them in causing ruin?", "metacritic": null, "released": null, "tba": false, "updated": "2021-10-29T03:26:37", "background_image": "https://media.rawg.io/media/screenshots/2b6/2b6b41cd5ea270cf7ad1f9dc682c9537.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 405, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Golden Treb"], "genres": ["RPG"], "publishers": ["Golden Treb"], "esrb_rating": null}