{"id": 684997, "slug": "wasting-away", "name": "Wasting Away", "name_original": "Wasting Away", "description": "<strong>Story</strong><br/><br/>The Vainonmiel camping destination in northern Finland used to be popular, until some of the visitors started disappearing without a trace. Recently, a horribly mutilated body was found, prompting the local police to close the destination for investigation. <br/><br/>Yet with his boss pressuring him and threatening his job, the Reporter has no choice but to sneak in and gather all the material he can get his hands on for an article about the incident. Much to his dismay, he will soon discover he is not alone in the forest... Can the Reporter survive and keep his job, or will he get arrested or fall victim to the mysterious killer of Vainonmiel?<br/><br/><strong>Game</strong><br/>Wasting Away is a 3D retro horror game. The game is very much a survival horror game with a particular focus on stealth mechanics and gathering objects like notes, photos and other evidences. In addition, the game will be heavily story driven and we aim is to create intimidating atmosphere by using strong narrative, effects and sounds appropriate to the chosen style of the game. Game happens during year 1987. <br/><br/><strong>GamePlay</strong><br/>Player as The Reporter gets to explore and navigate their way through Vainonmiel.  <br/>During playing, the player most needs to collect notes and take photos, which affect the ending of the game. Furthermore, the player is able to collect other items, which can be used, for example, to deceive enemies or heal and boost the player. <br/>In addition, during the game, the player must avoid enemies.", "metacritic": null, "released": "2021-10-27", "tba": false, "updated": "2021-10-29T03:54:51", "background_image": "https://media.rawg.io/media/screenshots/def/defa5222ddd5ce424a20d941e919d0f6.jpg", "website": "https://www.kajakgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 239, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Creepy Crew"], "genres": ["Action", "Indie"], "publishers": ["Kajak Games"], "esrb_rating": null}