{"id": 685049, "slug": "hunkenstein", "name": "Hunkenstein", "name_original": "Hunkenstein", "description": "You’re brain’s been harvested and sold to the lowest bidder. <br/>\n<br/>\r\nNow, you’ve been implanted in the latest creation of the infamous and lusty Dr. Anna Stasis. As a handsome abomination of medical waste and muscle, you’ll walk an earth where Mad Science rules and scary movies have become reality. <br/>\n<br/>\r\nIn this quasi-erotic horror adventure of monstrous proportions, you’ll hunt the creatures of night that plague the innocent…for a pricey fee. <br/>\n<br/>\r\nWith a litany of weapons at your disposal, you’ll become a helpful part of your community, destroying pesky vampires, bothersome werewolves, and ill-timed zombie infestations. Grind these household pests into mulch. Burn them, stake them, or just crush them with a good old fashioned anvil. <br/>\n<br/>\r\nThe choice is yours!<br/>\n<br/>\r\n- Equip your trusty pickup-truck with the latest in anti-monstrosity equipment, including giant glue-trap, fall-cage, net-launcher, meat-magnet, gas-can, anvil-launcher, monster-mixer, and the ever handy pitchfork!<br/>\n<br/>\r\n- Raid the labs of rival mad-scientists to steal their work!<br/>\n<br/>\r\n- Investigate and exterminate! Disappearances, exsanguinations, misplaced mummies. The night has many mysteries to unravel. <br/>\n<br/>\r\n- Face a horrific variety of physics based enemies to destroy in any way you see fit.<br/>\n<br/>\r\n- Meet the neighbors! You're not the only monster on the block. Chat up a cast of ne'er-do-wells and societal rejects just like you! <br/>\n<br/>\r\n- Fall in love. Romance can be found in the strangest of places.<br/>\n<br/>\r\n- Level up! Become faster, stronger, hunkier!<br/>\n<br/>\r\n- Survive. The onslaught of the damned never ends, even at home. Be on your toes!<br/>\n<br/>\r\nFree additional content is planned in the future!", "metacritic": null, "released": "2021-10-28", "tba": false, "updated": "2021-10-29T04:34:36", "background_image": "https://media.rawg.io/media/screenshots/28a/28a4005cc1ed91c7d8f4363e0348fabf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "playing": 1}, "playtime": 0, "achievements_count": 7, "ratings_count": 0, "suggestions_count": 426, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Oubliette"], "genres": ["Action", "Adventure", "Simulation", "Indie"], "publishers": ["Oubliette"], "esrb_rating": null}