{"id": 685045, "slug": "spacefolk-city", "name": "Spacefolk City", "name_original": "Spacefolk City", "description": "<strong>The Spacefolk are in trouble! Their sun is going supernova, and they need your help to build up their city and find a way to escape the impending solar disaster!<br/> <br/>Spacefolk City is an approachable, funky take on the city-building genre. Construct a floating city in space, decorate it with a variety of absurd items, and keep your Spacefolk citizens happy.</strong><br/><br/>Ever dreamed of creating your dream house in an out-of-this-world setting? In Spacefolk City citizens inhabit a solar system where the sun is close to going supernova and it is up to you to create a city for all of those who are fleeing their homes! <br/><br/><br/><br/>Solar flares and other dangerous activities have resulted in the destruction of Spacefolk settlements around the system, leaving many Spacefolk without a home. Stranded citizens are brought to your new settlement and you must help them build a new city and eventually construct a solution to allow everyone to escape the danger of their dying sun.<br/><br/><br/><br/><br/><br/>But hey, that doesn’t mean it has to be a boring job!<br/><br/>The Spacefolk are lovely citizens and all want to have a good time. They have different backstories and talents, and they’d love to contribute to your efforts of making a new home for them. It’s up to you to create a spacious space… in outer space!<br/><br/>Spacefolk all have interests that are indicated by their body type. By building homes and facilities that are decorated with items matching Folks’ Interests, you can make them happy. Happy Folks perform their roles around the city more efficiently, and can also make use of special abilities unique to each species.<br/><br/><br/><br/>Construct a floating city in free space, and enjoy the tactile sensation of hand-placing buildings at any orientation to create unusual and unique urban layouts in VR.<br/><br/><br/><br/>Different strokes for different Folks! Interact with an eclectic cast of Spacefolk, complete with a diverse array of abilities and personalities! <br/><br/><br/><br/>Channel your inner home renovator with a range of absurd objects and items that appeal to different Folks’ interests to make them happy! <br/><br/><br/><br/>Maximize Folks’ roles and special abilities around the city to build more efficiently. <br/><br/>Let’s groove tonight! Listen to a diverse, funky soundtrack of more than 20 songs influenced by late-70s electro-disco and early-80s electro-pop. <br/><br/>Spacefolk City has something for everyone and is built with first-time VR users and city building veterans in mind. Whether you like to play alone or have spent hundreds of hours creating architectural masterpieces in other games, there’s a little something for everyone!<br/><br/><br/><br/>With a wacky, wild, and whimsical style, Spacefolk City is a great way to introduce family and friends to the wonderful world of VR! Its approachable controls and easy-to-learn mechanics are perfect for VR first-timers, and the adorably bubble graphics will charm younger players who just want to go bananas with Mr. Banana.<br/><br/>", "metacritic": null, "released": null, "tba": false, "updated": "2023-08-18T18:25:21", "background_image": "https://media.rawg.io/media/screenshots/175/175f851114687887d8a4afa2105207f0.jpg", "website": "https://www.spacefolkcity.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 173, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Moon Mode"], "genres": ["Simulation", "Indie"], "publishers": ["Beyond Frames"], "esrb_rating": null}