{"id": 685067, "slug": "solitaire-tripeaks-travel", "name": "Solitaire Tripeaks Travel", "name_original": "Solitaire Tripeaks Travel", "description": "Start your magical solitaire game with a lot of fun! Play free solitaire game after game, and relax your mind. Solitaire is a great way to stay sharp just like hearts, mahjong and word search. Mental sharpness is something that we all struggle with at the end of the day, so play solitaire free of charge. This solitaire app is not like the standard solitaire game. At Solitaire Tripeaks Journey, you will have a blast and get a chance to play solitaire with friends.<br/><br/>HOW TO PLAY<br/>- Star/Level Chest: Collect stars to open the Star/Level chest to win abundant rewards.<br/>- Undo: Tap \"Undo\" icon to try again, you can play the card you've missed.<br/>- Combo Bonus: Additional bonuses will be awarded for continuous removing the cards.<br/>- Wild Card: You can use the wild card to remove any cards you want to get rid of.<br/>- Remove 3 Cards: After choosing this booster, you get rid of 3 cards in the beginning.<br/><br/>SPECIAL FEATURES<br/>- 1000+ levels to play<br/>- Lots of unique Solitaire card game layouts<br/>- New fun solitaire game twists<br/>- Complete your collection and boost your gameplay<br/>- Easy to play yet challenging to master - let's see if you can win!?<br/><br/>Solitaire Tripeaks Journey is a free solitaire card game to download and free to play for everyone. But you can purchase in-app items, such as extra moves or lives.<br/><br/><br/>► CONTACT US:<br/>23018987@qq.com<br/><br/>►Our company website: <br/>http://letsfungame.com/", "metacritic": null, "released": "2021-09-18", "tba": false, "updated": "2021-10-29T04:49:44", "background_image": "https://media.rawg.io/media/screenshots/70e/70e6d82718f2870006bcb9c6f9c507df_iFLVKv4.jpg", "website": "https://letsfungame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 85, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Let's Fun Studio"], "genres": ["Casual", "Card"], "publishers": ["Shenzhen Lechang Information Technology Co"], "esrb_rating": "Everyone 10+"}