{"id": 685061, "slug": "agony-agony-unrated", "name": "Agony + Agony UNRATED", "name_original": "Agony + Agony UNRATED", "description": "<p>This pack includes two versions of Agony: Agony and Agony UNRATED.<br />\nExplore the most terrifying vision of Hell in the history of gaming!<br />\nKill everyone who will stand in your way, and find the Red Goddess, in fully uncensored, Agony UNRATED.YOU ARE IN HELL:<br />\nBe a witness to the brutal scenes of murder and become a judge and an executioner of the condemned souls!<br />\nAvoid the traps and develop your character&#39;s skills to discover the secret of your past and the path to salvation.<br />\nYour actions rewrite you to eight different endings that combine to form a bloody puzzle full of sin, sex and manipulation.SUCCUBUS MODE:<br />\nTake on one of the most dangerous and at the same time the most attractive demon from hell.<br />\nComplete the story mode as a brutal predator, leaving behind a bloody path littered with the limbs of your victims!STORY MODE<br />\nYou will begin your journey as a tormented soul within the depths of hell, without any memories about your past.<br />\nThe special ability to control people on your path, and even possess simply minded demons, gives you the necessary measures to survive in the extreme conditions you are in.<br />\nBy exploring the hostile environment and interacting with other weary souls of the hellscape, the hero will soon understand that there is only one way to escape from Hell, and it will require meeting the mystical Red Goddess.AGONY MODE<br />\nAgony features a full-fledged story mode as well as an open challenge system that<br />\nrandomly generates levels for players to explore and survive to gain new Highscores.<br />\nChallenge other players on the most brutal and malevolent environments.<br />\nComplete the challenges of Agony Mode, and fight the Bosses, in several completely different environments, full of threats and traps!<br />\nAgony throws you in the midst of hell where you strive to stay alive<br />\nand solve the riddle behind the mysterious Red Goddess; architect of this place of sorrow<br />\nand pain, and the sole entity with knowledge of how escape… but there is more to the<br />\nstory than it seems. Haunted by nightmare creatures, You will gain the ability to possess<br />\ndemons and other souls to find a way out of hell.</p>", "metacritic": null, "released": "2018-05-28", "tba": false, "updated": "2022-04-28T10:15:26", "background_image": "https://media.rawg.io/media/games/293/293764c9e5bc4b13b29843b321302e65.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 498, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Madmind Studio"], "genres": ["Action"], "publishers": ["Madmind Studio"], "esrb_rating": null}