{"id": 685084, "slug": "color-ball-sort-puzzle", "name": "Color Ball Sort Puzzle", "name_original": "Color Ball Sort Puzzle", "description": "Dino Bubble Sorting Puzzle is a fun and relaxing time-killing game. Just tap the balls and switch the same balls to tubes and make them sort correctly. It's easy to learn with endless challenges.<br/><br/>HOW TO PLAY:<br/>- Tap any tubes to pick a ball<br/>- Put it into a tube that contains the same color ball on the top of the tube that has enough space, or an empty tube.<br/>- Stack all the balls with the same color into a single tube.<br/>- Try not to get stuck! But you can undo the ball move by using the back function or restart the level anytime you want.<br/>- Don’t forget you also can add an empty bubble tube to make the game easier <br/><br/><br/>FEATURES<br/>- Easy to play but hard enough to exercise your brain<br/>- One finger control.<br/>- Thousands of levels, can you pass all of them?<br/>- New themes and background skin.<br/>- NO penalties &amp; time limits; you can enjoy the ball sort puzzle anywhere you want.<br/>- All offline, no need for connection! Free for download!<br/>- Suitable for all ages. Let's share this bubble sorting game with your friends and your family members to have a good time with them.<br/><br/>What are you waiting for? Get ready for exploring a new Dino bubble sorting puzzle game with colorful balls and funny bubble tubes right now. You will enjoy the whole day long by playing this ball sorting color match game. Hopefully, Dino bubble sorting puzzle game will make your day become more interesting and colorful.", "metacritic": null, "released": "2021-09-09", "tba": false, "updated": "2021-10-29T05:00:46", "background_image": "https://media.rawg.io/media/screenshots/baa/baa67682b1158add18daac19e7e56aef.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 73, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Hue Anh Nguyen"], "genres": ["Puzzle"], "publishers": ["Hue Anh Nguyen"], "esrb_rating": "Everyone 10+"}