{"id": 685072, "slug": "farkle-online-10000-dice-game", "name": "Farkle online -10000 Dice Game", "name_original": "Farkle online -10000 Dice Game", "description": "Ready for some Farkle?<br/>Farkle is a classic dice game that will bring you endless fun. Roll the dice and try to collect combinations that will earn you maximum points. But, if you decide to take a risk and continue rolling, you could lose your points in a Farkle!<br/><br/>Even if you do Farkle, it's fun just saying Farkle, right?<br/><br/>• For any age: with easy to learn instructions, Farkel is just the thing to get everyone playing. Farkle takes just minutes to learn and can be played hours on end.<br/>• Easy gameplay: Roll dice, set aside dice worth points, re-roll remaining dice or stop and bank your points before you farkle!<br/>• The Dice game that involves guts and luck.<br/>• Tournaments: King of the Hill and Double elimination tournaments. Climb the ladder!<br/>• Everything is better with friends: play with your Facebook friends, invite more!<br/>• Collect cups and dices: 60 different cup and dice designs for all tastes!<br/>• Educational game: combining both math skills and attentiveness, Farkel is perfect to challenge the knowledge of your friends in a fun and an engaging game.<br/>• Bigger is better: A worldwide favorite, Farkel is the game that everyone wants to play and now you can play it online! Big enough for all your friends and family to join on in.<br/><br/>Farkle is also known as Zonk. Whatever you call it, this is a game of luck and greed. Roll the dice, press your luck, and score. Reach 10,000 points and you win! Yes, it's that simple.", "metacritic": null, "released": "2020-04-16", "tba": false, "updated": "2021-10-29T04:53:59", "background_image": "https://media.rawg.io/media/screenshots/173/1738936311f9fc1a4080b3c1770e39a3.jpg", "website": "https://skillcap.net", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 108, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Skill Cap"], "genres": ["Board Games", "Casual"], "publishers": ["Skill Kep, OOO"], "esrb_rating": "Mature"}