{"id": 685019, "slug": "alchera", "name": "Alchera", "name_original": "Alchera", "description": "During an operation, the steward, who is a soldier, stumbles upon a portal that was hidden at the end of the cave and used by wizards and wizards in ancient times. If you cast a spell according to a custom that sorcerers believe, you will have to pay a price. When the steward passes through the portal, he is cursed by the gods, gaining powers for other people to kill people for. He gave a piece of his soul as a price. When a piece of his soul was gone, he saw changes in his body.<br/>Is Steward ready to survive in an age he doesn't know?<h3>Game Mods </h3><strong>Story Mode </strong><br/>In an age unknown to Steward, join the adventure of surviving the gods and god soldiers and reaching the portal.<br/><strong>Huge open world </strong><br/>With an area of ​​16 kilometers, It Offers You Many Portals and Locations to Explore<br/><strong>Dynamic Weather </strong><br/>Weather Changes Randomly<br/><strong>Third Party Camera </strong><br/>There is only one camera angle<br/><strong>Loot Old Wizard houses </strong><br/>The spellbook from the wizard houses shows the location of the Portals and helps you to finish the game<br/><strong> Crafting and Skill tree </strong><br/>You can improve collectibles or craft new items<br/>You can increase the level of Powers with spellbooks whose supernatural powers can be collected because they are cursed by god<br/><strong>Dynamic Battle System </strong><br/>You will feel the pleasure of the Game to the End with the Streamlined Battle system while you are fighting with god or god soldiers.<br/><br/>Are you ready to survive in an age you don't know?", "metacritic": null, "released": "2021-10-27", "tba": false, "updated": "2021-10-29T04:12:01", "background_image": "https://media.rawg.io/media/screenshots/59d/59dd30fe455e5ae9b8a9049b4fead5e7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 145, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Unisclord Game Studio"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Unisclord Game Studio"], "esrb_rating": null}