{"id": 685081, "slug": "sudoku2-new-concept", "name": "Sudoku2 - New Concept", "name_original": "Sudoku2 - New Concept", "description": "We meticulously re-designed the game from the ground up: whether you’re advanced Sudoku players or beginners to this easy to learn, but hard to master brain puzzle game, Sudoku2 is good for you.<br/><br/>With this minimalist, modern, and feature-rich design, playing Sudoku2 on mobile is even better than with a pencil and paper.<br/><br/>The level &amp; different awards make the puzzle solving an amazing experience!<br/><br/>Key Features:<br/>●  Unlimited puzzles, each puzzle has one solution.<br/>●  Featuring 5 levels, ranging from “Easy” to “Master”.<br/>●  Upgrade level, gain the points, break the record, see your improvement.<br/>●  Complete Daily Challenges and get unique awards.<br/>●  Unlock different types of awards, gain more fun!<br/>●  4 different hints, make the game easier when you get stuck.<br/>●  Emoji mode, use Emoji to replace the numbers and try to solve it in this fun way.<br/>●  Learn mode, learn multiple techniques for solving Sudoku.<br/>●  Unique game design &amp; skills: highlight, long-press, double-tap, even more.<br/>●  20 New themes of variety in style.<br/>●  Globe Leaderboards, play against the best in the World<br/>●  Kiddo Sudoku, Children's Day Gift<br/><br/>Challenge your brain with Sudoku2 Now!<br/><br/>If you subscribe via iTunes:<br/><br/>Payment will be charged to iTunes Account at confirmation of purchase. Subscription automatically renews unless auto-renew is turned off at least 24 hours before the end of the current period. The account will be charged for renewal within 24 hours prior to the end of the current period at the rate of the selected plan. Subscriptions and auto-renewal may be managed by going to Account Settings after purchase.<br/><br/>Terms of Service: https://sudoku.detlafun.pro/terms<br/>Privacy policy: https://sudoku.detlafun.pro/privacy", "metacritic": null, "released": "2019-12-25", "tba": false, "updated": "2021-10-29T04:59:07", "background_image": "https://media.rawg.io/media/screenshots/16c/16c1474248db43f3affdfdca8abc1f83_CsFp69Z.jpg", "website": "https://sudoku.deltafun.pro/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 30, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Chuxiong Huang"], "genres": ["Board Games", "Puzzle"], "publishers": ["Chuxiong Huang"], "esrb_rating": "Everyone 10+"}