{"id": 685103, "slug": "thrivefantasy", "name": "ThriveFantasy", "name_original": "ThriveFantasy", "description": "Daily Fantasy Sports App. Engaging the Everyday Fan!<br/><br/>Determining the Right Contest for You<br/>Start by choosing a contest in the Contest Lobby. ThriveFantasy offers contests in NFL, NBA,<br/>and MLB. Our contests are broken down into two contest types.<br/><br/>Traditional: <br/>Select a player’s individual stat-line or a combination of stat-lines to win a predetermined amount of fantasy points.<br/><br/>Versus:<br/>Select which of two players will perform better in the pre-selected stat category. The player less likely to win will earn more fantasy points.<br/><br/>From there, the contests are broken down in the lobby by how many other opponents you’ll be<br/>playing against.<br/><br/>• Featured – These contests have the “star” logo. They have the biggest prize pools and the<br/>largest payouts.<br/>• Tournaments/Leagues – Small &amp; large field contests with huge prizes.<br/>• Head to Head – Face-off against one opponent; winner takes all.<br/><br/>Selecting Your Picks:<br/>Every contest will give you the opportunity to pick certain props from a predetermined list. Each unique prop has an “Over” and “Under” point value assigned to it and you will be rewarded that point value if that prop is correct. The higher the point value, the less probable it is to occur.<br/><br/>Your team is made up of 15 picks that you select out of an available list of 20. You’ll also select<br/>two In-Case-of-Emergency (ICE) picks. An ICE pick will automatically be added to your team only if an athlete is ruled out of a game prior to their start time. You will be notified if an ICE pick is being used.<br/><br/>Check Results:<br/>If you’ve placed in a paying position, the amount you’ve won, as determined by the prize structure of the contest, will be credited to your ThriveFantasy account.<br/><br/>You can use your winnings to play more contests, try other sports, or withdraw the amount to your PayPal account", "metacritic": null, "released": "2018-02-01", "tba": false, "updated": "2021-10-29T05:12:03", "background_image": "https://media.rawg.io/media/screenshots/7de/7de49f9c2ce16d112dc164711bb9b3a3.jpg", "website": "http://www.thrivefantasy.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 53, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Props2Fantasy.com"], "genres": ["Sports"], "publishers": ["Props2Fantasy.com"], "esrb_rating": "Mature"}