{"id": 685131, "slug": "wild-skunk-survival-simulator", "name": "Wild Skunk Survival Simulator", "name_original": "Wild Skunk Survival Simulator", "description": "Are you ready for a gas attack? Live the life of a real skunk with our animal survival simulator! Behave as a real adult striped skunk – struggle against your opponents and predators using your secret weapon, search for food, mate with the other skunks, take care ‘bout cubs and have fun with Wild Skunk Survival Simulator!<br/>Enjoy the wilderness, run across the woods and fight for your life against predators and herbivores alike, or befriend them! Earn experience and level up your skills, learn new attacks or change the color of your skin – check different color schemes and try to be a hog-nosed skunk, spotted skunk (a.k.a. zorilla), hooded skunk, stink badger and others.<br/>Explore this unfriendly American plains, full of different animals – some of them could become your friends, but others are your direct rivals, or – even worse – the predators! Mind your hunger and health indicators – if one of them drops, your chances to survive would fell too. Eat plenty of food - hunt cockroaches and snakes - drink enough water and collect coins and buy power-ups – it could help you to survive in the hostile world of this animal survival simulator!<br/>Be ready to battle against animals – especially at night, when hideous creatures lurk in shadows of trees! Search for food, run over plains and forests, struggle other beasts, mate and raise up cubs! Start your own wild adventure and be the real wild skunk with Wild Skunk Survival Simulator!<br/>Wild Skunk Survival Simulator features<br/>Search for food, mate and raise cubs<br/>Use poison stinky gas to fight against predators<br/>Customize your skunk as you wish<br/>Intuitive and simple controls<br/>Amazing 3D graphics<br/>Search for food, run over plains and forests, struggle other rodents and predators! Start your own wild adventure and be the real wild skunk with Wild Skunk Survival Simulator!", "metacritic": null, "released": "2017-03-07", "tba": false, "updated": "2021-10-29T05:27:51", "background_image": "https://media.rawg.io/media/screenshots/140/14085b97905adc02a9787c6ebd5e5bbe_pilFvXz.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 75, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tayga Games OOO"], "genres": ["Simulation"], "publishers": ["Tayga Games OOO"], "esrb_rating": "Teen"}