{"id": 6851, "slug": "gamebook-adventures-6-the-wizard-from-tarnath-tor", "name": "Gamebook Adventures 6: The Wizard from Tarnath Tor", "name_original": "Gamebook Adventures 6: The Wizard from Tarnath Tor", "description": "An interactive fantasy adventure! It's a book. It's a game. It's an RPG. It's a Gamebook Adventure!<br/><br/>Please note that you do not need to have read any of the previous gamebooks in order to read and play this. The critically acclaimed series of newly imagined interactive fantasy gamebooks puts you, the reader, in control of the story! Along with a realistic dice-based battle system to fight creatures, an epic tale and beautiful artwork, The Wizard from Tarnath Tor will give you many hours of gamebook adventuring! <br/><br/>\"Two hundred years ago, the legendary City of Tarnath Tor was destroyed as it’s defenders, the mighty wizards valiantly tried to repel an orcun horde. Now just a place set within stories and myths, it has been lost to the outside world. A chance encounter with one who claims to be a time traveller  sends you on a mission to recover some magical artifacts. This search will lead you to great ruins and the dark forces who have made it their home. Who is this wizard from Tarnath Tor and how can you trust him?\"<br/><br/>\"Gamebook Adventures are fun to read – not just because the RPG mechanic draws you in and engages you in the story, but also because the stories are good fantasy fiction. The artwork is great and there is a great deal of replayability in the application, especially when you consider the hundreds of choices that can be made and the various difficulties.\" - WIRED.COM<br/><br/>\"After finally making my way through the series’ newest release, I’m somewhat ashamed that I’ve waited so long to take the plunge...the only real question is, “How much longer do I think I can hold out before buying the other five volumes?” The answer: Not very.\" - 148APPS (4/5)<br/><br/>\"Interactive Gamebook Adventures hits iOS for six with The Wizard from Tarnath Tor\" - POCKET GAMER<br/><br/>Gamebook Adventures 6: The Wizard from Tarnath Tor is the sixth in a series of newly written adventure gamebooks for the iPhone, iPod Touch and now beautifully realised for the iPad! We are completely original and not simply a re-print of old gamebooks.<br/><br/>•Includes all the interactive reading and gameplay features found in the previous Gamebook Adventures titles.<br/>•Read the story and dictate the direction of the story! Options based on who you have met, where you have visited and what you have found.<br/>•Written by Al Sander, the winner of the 2008 Windhammer Prize for Short Gamebook Fiction!<br/>•Dan Maxwell lends his artistic talents to both cover and interior illustrations. His haunting imagery brings alive the mysterious Tarnath Tor.<br/>•Battle an array of creatures from protective gryffons to strange, magical creatures from a mirrored world. Become an unwitting accessory for alchemist's experiment and barter your way past a goblyn king!<br/>•Unique battle system using realistic 3D dice which can be rolled by shaking your iDevice. <br/>•Three difficulty levels: Classic, Bookworm and Novice. <br/>•Lots of achievements to collect and artwork to find throughout the book. These are placed on your achievement wall.<br/>•Illustrations can now be viewed full screen by simply tapping on them in the book and we have higher resolution artwork for iPhone 4 and iPad users.<br/>•New widgets at the bottom of each page access direct to your inventory, settings and main menu making easier than ever to find your way around the gamebook.<br/>•An update to the constantly changing world map and gazetteer, Orlandes Uncovered. This now includes Rema and Drymar.<br/>•Wizardly soundtrack composed by GA newcomer, Ryan Grogan.", "metacritic": null, "released": "2011-05-17", "tba": false, "updated": "2019-10-22T14:08:12", "background_image": "https://media.rawg.io/media/screenshots/d5d/d5d6cd841b30b45c5b11d5ff9c56ccc9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 288, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tin Man Games"], "genres": ["RPG"], "publishers": ["Tin Man Games"], "esrb_rating": null}