{"id": 685123, "slug": "war-of-deities", "name": "War of Deities", "name_original": "War of Deities", "description": "Welcome to War of Deities! In this marvelous world, you can build a city of your own and fight alongside the Deities, with diverse terrain, real-time battles, and brilliant strategies. Start your journey here and establish the greatest empire with your wisdom and leadership!<br/><br/>Ever since humans were created with free will, there has been much dispute among the Deities over whether humans deserve such valuable quality. The dispute soon led to a brutal war, and the civilized world returned to a misty and void wasteland after the clash of Deities. But the crisis is not yet over. The good and the evil are still battling deep down the unknown, and the Dark Power is still prowling around, looking for revenge.<br/><br/>Get ready to explore this world, uncover the mystery and eliminate the devils to defend the cause of justice and freedom! Take actions now – fight against evil spirits with your allies and expand your territory, construct your city and revitalize the civilization. You will be the chosen one to bring back peace and prosperity!<br/><br/>[Features]<br/><br/>* Smooth and free march movement. You can command your marching troops to carry out various tasks with a simple tap and drag on the map. You will become the true strategist leading your army and conquer the world.<br/><br/>* Powerful Deities at your Service. Deities from various mythologies with splendid art design and intimidating power will bless you all the way. They will lead your Commanders and troops to win you triumph and glory!<br/><br/>* Brilliant Commanders show their talents. Recruit powerful Commanders to increase your troop size for a mighty army. Upgrade the Commanders by drag &amp; merge to get more powerful Commanders with the fun play!<br/><br/>* Enjoy teamwork in an Alliance. One tree does not make a forest. Meet new friends and fight for a common goal in the Alliance, and the solidarity and team effort will crown you the King of the world!<br/><br/>* Expedition. Battle and clear stage by stage to exploit more open space for your city development and win valuable rewards. Make wise planning to challenge various enemies with various troop formations.<br/><br/>* Construction &amp; Research. Construct your city to make a beautiful landscape and a prosperous homeland. Research to unlock more powerful troops and all kinds of boosts to enhance your power!<br/><br/>[Notes]<br/><br/>* Network connection is required.<br/>* Privacy Policy: https://privacy-policy.simpysam.com/<br/>* Terms of Use: https://privacy-policy.simpysam.com/terms_of_use.html", "metacritic": null, "released": "2021-10-20", "tba": false, "updated": "2021-10-29T05:28:24", "background_image": "https://media.rawg.io/media/screenshots/2ec/2ec61bc0a00625eb0fd37c892bf4f4a3_gee7ZjA.jpg", "website": "http://www.leyinetwork.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 151, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["JOYSTIX"], "genres": ["Strategy", "Simulation"], "publishers": ["JOYSTIX"], "esrb_rating": null}