{"id": 685114, "slug": "rupauls-drag-race-superstar", "name": "RuPaul's Drag Race Superstar", "name_original": "RuPaul's Drag Race Superstar", "description": "Bring. Back. My. Girls! <br/><br/>Enter the iconic Werk Room and experience the world of RuPaul’s Drag Race. Werk your way to the top by selecting from hundreds of fashion pieces, and create the fiercest look to slay the runway. Live the life of a Drag Race Superstar by putting your all into the Werk Room against rival Queens trying to snatch your wig.<br/><br/>Once you’ve climbed to the top of the Werk Room, slay your competition with your best looks against other player Queens from around the world to become the Top Queen. Win amazing new fashion pieces to add to your wardrobe, and earn the respect of real Queens from the show!  You’ve got what it takes to slay, make sure you don’t sashay away.  And may the best drag Queen - Win!<br/>-----------------------------------------------------------------------<br/>GAME FEATURES <br/><br/>FIERCE FASHION<br/>Choose from hundreds of fabulous fierce fashion pieces across a multitude of different drag genres to combine and create your own unique style. Upgrade your pieces to create stunning looks, hunty, that will make everyone gag.<br/><br/>CHALLENGE THE WORLD<br/>Werk the runway! Take your looks into nail biting competitions with other Queens around the world, and fight to be the next drag superstar. Win more incredible looks that will help you serve your eleganza extravaganza. <br/><br/>WERK THE ROOM<br/>Experience all the tea and sisterhood of the Werk Room right out of the show. Put in werk to prepare yourself for the Maxi Challenge where you can slay your rivals.<br/> <br/>RU'S GIRLS<br/>Unlock Queens from RuPaul’s Drag Race, party in the Untucked lounge, and win some of their most iconic outfits.<br/><br/>By downloading this app, you agree to our privacy policy and terms of use, available at: <br/>Terms of Service - https://service-terms.eastsidegames.com<br/>Privacy Policy - https://privacy-policy.eastsidegames.com/<br/><br/>Please note that this game is free to download and play, but some game items are available for purchase using real money. A network connection is required to play the game.", "metacritic": null, "released": "2021-10-25", "tba": false, "updated": "2021-10-29T05:18:31", "background_image": "https://media.rawg.io/media/screenshots/43b/43b6d9178b3ddeee2f5159866d8056c8_1Z45tVn.jpg", "website": "http://eastsidegames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 224, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Eastside Games"], "genres": ["RPG", "Simulation"], "publishers": ["East Side Games"], "esrb_rating": "Mature"}