{"id": 685130, "slug": "river-legends", "name": "River Legends", "name_original": "River Legends", "description": "“Sometimes you just need a relaxing pixel art fishing game, and this is a great one”<br/>PCGamer<br/><br/>River Legends: A Fly Fishing Adventure is a single-player, pixel art fishing simulation with RPG and adventure elements. Learn to fly fish while traversing the virtual Pine Canyon.<br/><br/><br/>“...simple yet pleasing angling mechanics...”<br/>Rock Paper Shotgun<br/><br/>Features<br/><br/><br/>■ Explore the far reaches of a wild canyon in glorious pixel art<br/><br/>■ Pursue multiple species of challenging fish with realistic AI, each with their own fly and weather preferences<br/><br/>■ Master dynamic weather conditions and realistic water currents<br/><br/>■ Choose the best tackle based on water conditions​ - wet, dry, and streamer flies<br/><br/>■ Cast your fly fishing line with real-time controls<br/><br/>■ Master the art of landing tough fighting trophy fish, both trout and other freshwater species<br/><br/>■ Keep track of the fish you catch in your trophy album<br/><br/>■ Adventure into an array of fishing environments including forgotten canyons, dark forests, alpine lakes, sylvan ponds, and more<br/><br/>With River Legends, you can play at your own pace and choose your own goals. Try to catch all of the fish species available or just target trophy fish. Stick with your favorite fishing spots or keep exploring new regions as you unlock them. Earn new items to cast farther and to expand your fishing territory. Relax and cast your line in the best locations or hike to see the wonders of Pine Canyon at your leisure.<br/><br/>“...captured the essence of fly fishing in one outstanding retro gaming experience”<br/>Alt Fly Fishing Magazine<br/><br/>Original Game Design, Artwork, and Development by Brian Chau<br/><br/>Programming and Software Development by David Dolynny<br/><br/>What are you waiting for? Cast your way into River Legends: A Fly Fishing Adventure today!", "metacritic": null, "released": "2021-04-27", "tba": false, "updated": "2021-10-29T05:27:22", "background_image": "https://media.rawg.io/media/screenshots/0cd/0cdbfaef3f32b0ca201beb7d0fe79145.jpg", "website": "https://www.riverlegendsgame.com/press-kit", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 183, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Brian Chau"], "genres": ["RPG", "Sports"], "publishers": ["Brian Chau"], "esrb_rating": "Everyone 10+"}