{"id": 685362, "slug": "who-knows-the-news", "name": "Who Knows the News", "name_original": "Who Knows the News", "description": "<p>Unscramble the news headline! Both desktop and mobile browser friendly.</p>\n<p>After picking a topic, the game randomly select an article from the Google News RSS feed. Then, it's up to your powers of contextual deduction and an unscrambling mind to restore the original headline. As a winning bonus, you get the pleasure of visiting the original article where the headline came from (if you want to, of course).</p>\n<p>Once the game is started, there's two ways to unscramble the headline:</p>\n<ol><li>Type the two letters you want to swap on your keyboard</li><li>Tap/press the two letters you want to swap in the <em>virtual</em> keyboard onscreen (the headline itself is just static text for now).</li></ol>\n<p>The headlines coming from Google News RSS feed only undergo filtering for ease of playing the game. This game in no way shape or form suggests or claims that headlines and articles chosen are an optimal representation of current news, good sources, or anything of the likes. No filtering is done to favor or exclude any specific publishers.</p>\n<p><strong>Created for the 2021 Charity Firejam.</strong></p>\n<p>Given the theme of \"everything changes\", what changes more often than the news?Made by Patrick W. Crawford, credit to TheKindKitten for helping playtest. More credits built into the game itself.</p>", "metacritic": null, "released": "2021-10-28", "tba": false, "updated": "2021-10-29T06:23:58", "background_image": "https://media.rawg.io/media/screenshots/9e5/9e58388f33321345c169ffad5038899a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 32, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Patrick W. Crawford"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}