{"id": 685410, "slug": "four-before-midnight", "name": "Four Before Midnight", "name_original": "Four Before Midnight", "description": "<p><strong>Launch date: 31 October 2021</strong><br/></p>\n\n<p>It’s the night of the royal ball! A night of excitement, festivities, and romance—as well as gruesome death for everyone in the castle, unless the irresponsible fairy godparent Ivy can change their fates.<br/></p>\n<p>Explore the castle, eavesdrop on its many inhabitants, and solve elaborate puzzles through careful (or not-so-careful) magical meddling. Everything in the castle is interconnected in ways that may not be obvious at first glance: turning candy into bananas might result in a broken statue, and revising a painting could lead to accidental arson.</p>\n<p>Armed with just four minutes, your brains, and a time-traveling clock, can you bring this story to its happily ever after?</p>\n\n<ul><li>Over an hour of narrative and point-and-click puzzles per playthrough</li><li>~70k words, with multiple story paths and secrets to discover</li><li>Includes download of original soundtrack (5 songs)</li></ul>\n<p><em>Content warning: Death; blood; alcohol use. Otherwise PG-equivalent.</em><br/></p>\n<p><em>Accessibility: Font select; text speed slider; assistive tooltips toggle.</em><em> Game includes spoiler-free walkthrough PDF.</em><br/></p>\n<p><em>Six Before Midnight was made by Res, an indie game developer working from British Columbia, Canada.</em></p>", "metacritic": null, "released": "2021-10-28", "tba": false, "updated": "2021-10-29T06:34:33", "background_image": "https://media.rawg.io/media/screenshots/8d7/8d7d3c56f13188bf9077fb4b7e63b45c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 194, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Res"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}