{"id": 685686, "slug": "absorb-the-orb", "name": "Absorb The Orb", "name_original": "Absorb The Orb", "description": "<p>Each level is a set of colored orbs(balls) connected to each other.<br/>The main goal is to absorb these orbs, but absorbing of one orb may impact other orbs according to the following basic rules:<br/>- Absorbed orb absorbs all other connected to it orbs that have the same color<br/>- Absorbed orb recolors to its own color all other connected to it orbs that have different color<br/></p>\n<p>The challenge is to collect as long chains of absorbed orbs as possible until there are no orbs left on the level.<br/>The longer the chain of orbs you absorb in one turn - the more score you get.<br/><br/>Over time, different types of orbs appear in the game, each with its own unique behavior.<br/>For example, there will be orbs that change their color periodically.<br/><br/>Game uses rank system:<br/>- Each rank contains a set of new levels<br/>- Some ranks also unlock access to new features of the gameplay<br/>- Complete all levels of the current rank with three Stars in order to get new rank<br/>- It is not possible to return to levels of previous ranks, however this does not make sense<br/><br/>Besides the usual levels, game has Premium Levels that you can buy using free in-game currency (like Stars and others).<br/>In-game currency is earned by completing levels in PLAY mode.<br/><br/>Game has free main part with a big set of ranks and levels.<br/>But if this is not enough for you, then you can buy a VIP, which will open access to an unlimited number of levels for the PLAY mode.<br/>VIP also gives +1 bonus to all earned items.</p>", "metacritic": null, "released": "2021-10-27", "tba": false, "updated": "2021-10-29T07:44:00", "background_image": "https://media.rawg.io/media/screenshots/0b5/0b5d5e3f421b7c82a269b0786ebacf04.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 74, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["homefortstudio"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}