{"id": 685634, "slug": "palmares", "name": "Palmares", "name_original": "Palmares", "description": "High Concept\r\n<p>Lidere a resistência contra os Senhores de Engenho e proteja o QUILOMBO DOS PALMARES SOB A PELE DO LENDÁRIO ZUMBI!</p>\r\nSobre o jogo\r\n<p>Sinta a fúria de um verdadeiro líder que lutou contra as terríveis tropas dos perversos senhores de engenho para defender a liberdade de seu povo que conseguirá conquistar com unhas e dentes, enfrente as tropas inimigas para provar aos quilombolas que a vontade de viver como homem livre é maior que o desespero que ameaça suas vidas.</p>\r\nPrincipais características\r\n\n<ul><li><strong>Defenda o quilombo dos palmares</strong>: <em>Lute pela liberdade dos escravos protegendo o Quilombo! Não deixe as tropas inimigas derrubarem esse refúgio!</em></li><li><strong>Tropas inimigas</strong>: Diferentes tipos de tropas inimigas virão para tentar derrubar o Quilombo. Detenha-os e utilize os diferentes tipos de armas que eles derrubam para continuar protegendo a liberdade!</li><li><strong>Enfrente chefões</strong>: Os capitães do mato estão atrás de fugitivos para levá-los de volta a senzala. Derrote-os e defenda seu povo!</li><li><strong>Conte com a ajuda de guerreiros quilombolas</strong>: Zumbi não está sozinho! Conte com a ajuda de diferentes tipos de guerreiros para defender o Quilombo!</li></ul>", "metacritic": null, "released": "2021-10-27", "tba": false, "updated": "2021-10-29T07:31:45", "background_image": "https://media.rawg.io/media/screenshots/ccd/ccdf947e5d42cf68c2dfd94705e12fa8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 94, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ascheente"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}