{"id": 685953, "slug": "astralis-alpha-release", "name": "Astralis [Alpha Release]", "name_original": "Astralis [Alpha Release]", "description": "<p>CONTROLS\r\n</p>\n<ul><li>Use WASD or the arrow keys to move around the world\r\n</li><li>Press SHIFT to dash in the direction you are moving\r\n</li></ul>\n<p>\n</p>\n<p>PLATFORMS\r\n</p>\n<ul><li>You can stick to any side of a platform \r\n</li><li>Platforms that have the [!] symbol will vanish after you jump off of them\r\n</li><li>Platforms that have the [~] symbol are broken and have a limited lifespan\r\n</li><li>Normal platforms have no symbol \r\n</li></ul>\n<p>\n</p>\n<p>FODDIAN GAMEMODES\r\nhave no normal platforms, ascend the map as fast as you can, faster dash cooldown \r\n\r\n</p>\n<ul><li>The normal Foddian gamemode (top portal) is tall, wide, and fairly easy map\r\n</li><li>The Foddian Lite gamemode (left portal) is a smaller, wider, and faster map\r\n</li><li>The Foddian Extreme gamemode (right portal) is a taller, thinner, and more challenging map \r\n\r\n</li></ul>\n<p>\r\nTRAVERSAL GAMEMODES [DISABLED]\r\nhas a mix of all platforms, traverse the map to the east as fast as you can \r\n\r\n</p>\n<p>MISCELLANEOUS \r\n</p>\n<ul><li>You may enter a specific seed into the \"seed\" input, so you can compete against your friends on a specific map [NOT AVAILIBLE ON ITCH.IO, SEE LINK BELOW]</li><li>Press [R] to restart the level \r\n</li><li>Press [C] to copy the link to that level to share with people\r\n</li><li>Press [X] to disable particles\r\n</li></ul>\n<p>\n</p>\n<p>\n</p>\n<p>Dev note: Hello Otto, Ludwig, Michael, &amp; Co.!  Big fan :) \r\n</p>\n<p>\n</p>\n<p>As you may be able to tell, this is not a complete game. I’m a very busy person, I’m a member of a FIRST Tech Challenge Robotics team, a member of multiple clubs such as Theatre Tech, Yearbook, and more. Long story short, I’m busy. \r\n</p>\n<p>\n</p>\n<p>It doesn’t take a genius to figure out that the purpose of the Ludwig Jam is to create new games for Ludwig to play in streams.\r\n</p>\n<p>\n</p>\n<p>As such, rather than presenting you will a complete game, I’m presenting you with this concept of a game. If I had perhaps a week or two longer, I would be able to implement the art (which I already have created lol just needed like one or two more hours), the gamemodes I have temporarily disabled as they aren’t stable enough, and just overall a more fun and more developed game.\r\n</p><p>To see a more developed version of the game (with seeds and stuff like that) check it out here https://thesimg.github.io/astralis-alpha/</p>\n<p>\n</p>\n<p>It is currently 5:57 ET and there are 3 minutes until deadline, so I’m going to keep this brief. Please feel free to reach out to me on Twitter @thesimg_ or on Discord at Sim#0465\r\n</p>\n<p>\n</p>\n<p>Thank you! Graham/Sim\r\n</p>", "metacritic": null, "released": "2021-10-26", "tba": false, "updated": "2021-10-29T08:56:28", "background_image": "https://media.rawg.io/media/screenshots/ecf/ecfec780504f9a5a4cbb98ce6f23be3e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 25, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["thesimg"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}