{"id": 685951, "slug": "butter-fingers", "name": "Butter Fingers", "name_original": "Butter Fingers", "description": "<p>A short Foddian platformer where you play as a slippery stick of butter created for the 2021 Ludwig Jam.</p>\n<p>The game is open source with the MIT license, as per the game jam's rules. Here is the GitHub repository.</p>\n\n<p><strong>Credits</strong></p>\n<p>The game was programmed and designed by ArjhanToteck. All art assets used were also designed by ArjhanToteck.</p>\n<p>JSFXR was used to create the sound effects for the game.</p>\n<p>All music in the game is in the public domain (except for one exception, see below). The music, authors, and places they are used are listed below.</p>\n<p>- \"8-bit theme - Moving Right Along\" by Wolfgang was used in the menu, credits, settings, and level select screens.</p>\n<p>- \"Returning to OpenMPT III\" by Spring Spring was used in the first level. This one is available under the CC-BY 4.0,  CC-BY 3.0, CC-BY-SA 4.0, and CC-BY-SA 3.0 licenses, unlike all the others which are public domain.</p>\n<p>- \"The War Over A Melon Field - Themes and Jingles\" by Spring Spring was used in the second level.</p>\n<p>- \"Boss Battle #6 [8-bit]\" by nene was used in the third level.</p>\n<p>- \"Bossfight by Frenchyboy was used in the fourth level.</p>\n<p>Note:</p><p>I submitted this mere seconds before the deadline, so there were a few bugs I didn't fix, like how you literally can't beat any level because I accidentally forgot to reset a certain variable, or how I didn't have time to upload the WebGL build so you have to download the game to play it. When the jam ends, I'll upload the update I made that makes the game actually enjoyable.</p>", "metacritic": null, "released": "2021-10-26", "tba": false, "updated": "2021-10-29T08:55:54", "background_image": "https://media.rawg.io/media/screenshots/51e/51ede41e4a943cc3602ac41a7034de10.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["ArjhanToteck"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}