{"id": 68611, "slug": "paper-girl-crazy-day", "name": "Paper Girl Crazy Day", "name_original": "Paper Girl Crazy Day", "description": "With over 1 billion downloads and growing, TabTale has established itself as the creator of pioneering virtual adventures that kids and parents love. With a rich and high-quality app portfolio that includes original and licensed properties, TabTale lovingly produces games, interactive e-books, and educational experiences. TabTale’s apps spark children’s imaginations and inspire them to think creatively while having fun! <br/>Visit us: http://www.tabtale.com/ <br/>Like us: http://www.facebook.com/TabTale<br/>Follow us:@TabTale<br/>Watch us: http://www.youtube.com/Tabtale\t \t<br/><br/>CONTACT US <br/>Let us know what you think! Questions? Suggestions? Technical Support? Contact us 24/7 at: WeCare@TabTale.com.<br/><br/>IMPORTANT MESSAGE FOR PARENTS:<br/><br/>This app may include advertising for TabTale and certain third parties which will redirect users to our sites, apps or third-party sites.<br/><br/>TabTale Ltd. is committed to protect the privacy of its apps users. This app may enable collection of limited user data by TabTale or its carefully selected third party providers (e.g. advertising networks and web analytics) for limited and lawful purposes (e.g. respond to support queries; maintain, analyze, provide and improve the app’s functionalities and performance; serve contextual advertising; protect app and users’ security). By downloading or using this app you accept TabTale’s Privacy Policy at: http://tabtale.com/privacy-policy/ and permit such uses for users of your device. For more information please refer to our Privacy Policy.", "metacritic": null, "released": "2014-10-01", "tba": false, "updated": "2019-10-22T13:54:58", "background_image": "https://media.rawg.io/media/screenshots/ebd/ebd8185906264d3eaa2355d1b95f97e6.jpg", "website": "https://www.tabtale.com/app/morning-madness-paper-girl-adventures/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 131, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Kids Fun Club by TabTale"], "genres": ["Adventure"], "publishers": ["Kids Fun Club by TabTale"], "esrb_rating": null}