{"id": 6862, "slug": "trouserheart", "name": "Trouserheart", "name_original": "Trouserheart", "description": "Get up from the throne and defeat Blockolds, Tentacles, Derp Knights, Jelly Cubes, and other peculiar adversaries! The King needs his pants back! <br/><br/>* Grand Prize Winner in Unity game contest 2013! *<br/><br/>REVIEWS <br/><br/>&amp;quot;It&amp;#39;s fresh, it&amp;#39;s fun, and it&amp;#39;ll keep you playing for hours.&amp;quot; <br/>- Pocket Gamer 8/10 <br/><br/>&amp;quot;Trouserheart is a well-built hack-and-slash game that simply turns you loose to rip things up with your sword.&amp;quot; <br/>- Gamezebo 4/5 <br/><br/>&amp;quot;Quite an engaging experience, and one you’ll find difficult to put down.&amp;quot; <br/>- iFanzine 5/5 <br/><br/>&amp;quot;A well-made hack-and-slash game with a lot of personality.&amp;quot; <br/>- Cult of Mac 4/5 <br/><br/>DESCRIPTION <br/><br/>Unsheathe your sword and journey through realm filled with monsters, traps, and treasures. Defeat monster mobs, slay bosses, hoard treasure, and upgrade your sword, shield and armor. Follow the trousers to the world&amp;#39;s end and claim what is rightfully yours! <br/><br/>Trouserheart is all about fun, instantly accessible, pick up and play hack’n’slash gameplay with playful art style and humorous tone. Super fluid controls with options for both fixed and floating modes make the game a joy to play for beginners and veteran gamers alike. The game offers two difficulty levels and even an optional perma-death mode for the bravest of adventurers! <br/><br/>- Meet peculiar enemies <br/>- Hoard treasures <br/>- Upgrade your sword, shield, and armor <br/>- Defeat 10 unique bosses <br/>- Gain more than dozen achievements <br/>- Explore exciting environments <br/>- Choose between two difficulty levels plus the perma death mode<br/><br/>Trailer: bit.ly/16XSPsd", "metacritic": null, "released": "2013-09-26", "tba": false, "updated": "2021-06-21T03:02:09", "background_image": "https://media.rawg.io/media/screenshots/f7a/f7a8bc058788aacca06de1e38a15bb43.jpg", "website": "http://www.kyygames.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 520, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "Nintendo Switch", "iOS"], "developers": ["10tons", "Kyy Games"], "genres": ["Action", "Adventure"], "publishers": ["Kyy Games Oy", "Kyy Games"], "esrb_rating": "Teen"}