{"id": 686227, "slug": "hourglass-itch", "name": "Hourglass (itch)", "name_original": "Hourglass (itch)", "description": "<p>Hourglass is a 2D platformer made for 2020 Tencent Game Designer Open Courses minigame project(remote). The protagonist accidentally falls into a world inside an ancient hourglass. The hourglass frequently flips itself, making the space upside-down and the flow of time reversed. To escape, the protagonist needs to<strong> collect the space-time gems </strong>while trying to <strong>avoid touching another protagonist</strong> in the time inversion.</p>\n\r\nFeature \r\n<ul><li>An interesting mechanism: Retrograde with another you in the reversed flow of time.</li><li>An experience of \"Present VS Past\": You're your own worst enemy. </li><li>An asynchronous puzzle-solving: Planning the route \"downstream,\" solving the puzzles \"upstream.\"  </li></ul>\n\r\n\"When <em>TENET</em> meets Badeline in  <em>Celeste</em>\"\r\n\"Time Clamp Adventure\"\r\n<p>Time clamp movement is the core definition in the movie TENET. In the movie, the red protagonist moves in one direction in time and the blue one in the opposite direction. In the game, we create a time inversion mechanism so the player can experience both \"two\" protagonists in one linear level.</p>\n\r\nBadeline\r\n<p>Badeline is the main antagonist in Celeste. She haunts Madeline in Chapter 2 by simply following Madeline's track a few seconds later. Once Madeline runs into Badeline, she will die. This part of gameplay is like a self-confrontation, bringing so much excitement and thrill to the game. What's more, it also adds route strategy into a game that centers on platform challenges, bringing more fulfillment to players.</p>\n\n\r\nExperience Goal\r\n<ul><li>The fulfillment after solving a difficult space-time puzzle by a well-thought-out plan.\r\n</li><li>Want to \"punch yourself\" after being trapped or killed by yourself.\r\n</li><li>Tension and trills during the confrontation of two protagonists.\r\n</li></ul>", "metacritic": null, "released": "2021-10-26", "tba": false, "updated": "2021-10-29T10:09:34", "background_image": "https://media.rawg.io/media/screenshots/ab4/ab48c663b50e2de87ed577ac90ebbea6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 95, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["hawkliu"], "genres": ["Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}