{"id": 68639, "slug": "gift-delivery-car-driving-parking-in-block-city", "name": "Gift Delivery Car: Driving & Parking in Block City", "name_original": "Gift Delivery Car: Driving & Parking in Block City", "description": "If you're crazy about delivery games then this block city package delivery van game is what you need! Now you can enjoy the coolest package delivery van that has blended with cube craft world city the best of transport delivery games. We can assure you that this delivery van games were never such before.<br/><br/>Transport driving is not that easy. This game is a coolest block city package delivery driving simulator in which our role is to drive the van and deliver packages. You have to go around the block city looking for different destinations by following an arrow indicating your way. Drive fast your car through the cube craft world building and traffic, pick up the packages and deliver parcels to their destinations in time. Our goal is to drive the car in block city and deliver packages to the clients as fast as we can without getting late.<br/><br/>Deliver and transport parcels at the customer’s location that we will operate by using the arrow buttons provided on the screen. Package Delivery is very tough and challenging job! You will have a specific time limit in each level and you must complete the level within the given time otherwise the game will get over and be sure to don’t be hit with anything it damages your car health.<br/><br/>If you like craft world driving games or transport parking games, this delivery game is right up your street. You can be driving around the block city, suburbs, craft construction sites, parks and even the beach. So take your package delivery van and get ready to deliver parcels in this craft world city environment.<br/><br/>GAME FEATURES:<br/><br/>• Block craft world graphics and smooth simulation<br/>• 30 challenging delivery driver missions<br/>• Many different routes across the block city<br/>• Smooth driving controls with breaks and acceleration paddle<br/>• Rush through craft buildings with extreme fun and challenges<br/>• Transport cargo and deliver packages to their destinations<br/>• Complete mission to unlock next Level.", "metacritic": null, "released": "2017-01-11", "tba": false, "updated": "2019-10-22T14:26:42", "background_image": "https://media.rawg.io/media/screenshots/364/364c5183beaae4e9a3bc41b6d76935cf_v43q3vO.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 61, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Files Studio"], "genres": ["Simulation", "Racing"], "publishers": ["FILES TECHNOLOGY PRIVATE"], "esrb_rating": null}