{"id": 686428, "slug": "efish-re-fished-version", "name": "E.Fish: Re-Fished Version", "name_original": "E.Fish: Re-Fished Version", "description": "<p>You and your fish pet are travelling around the space. How long can you make it before flushing him into the toilet? Choose 1 out of 3 fish and survive the longest by taking quick choices to avoid him getting killed.</p>\n<p>This game was originally made for the Mini Jam 91: UFO. However, since some issues with that game, it was improved, with the code being re-worked from the start. This is know as the Re-Fished version of this game, which you can find here:</p>\n<p>https://missingwilliam.itch.io/efish-browser-version<br/></p>\n<p>I'm also planning on getting a mobile version soon (sadly it will still be only playable from browser though.)\r\n</p>\n<p>Edit: Mobile Version is here. You can find it on the link below or at the start of the game on \"Change Device\" Option:</p>\n\n<p>https://missingwilliam.itch.io/efish--re-fished-mobile</p>\n<p>Controls:</p>\n<p>- Left / Right Arrow Keys to choose a window to move.\r\n</p>\n<p>- Up to feed your fish\r\n</p>\n<p>- Down to change the water your fish is in.\r\n</p>\n<p>- N° 1; 2 and 3 to make a fish choice in selection menu.\r\n</p>\n<p>- Enter to replay  after losing.\r\n</p>\n<p>Everything in this game is made by MissingWilliam. All sprites, assets, sfx and music have been made by me. Engine used is Construct 2, sprite \"engine\" is Piskel, and for the main theme I've used Google Music Lab and Filmora to edit the SFX (homemade) and change the tone of the music. </p>", "metacritic": null, "released": "2021-10-25", "tba": false, "updated": "2021-10-29T11:06:29", "background_image": "https://media.rawg.io/media/screenshots/c95/c95e2e0457b6310f4276f42ab15ee646.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["MissingWilliam"], "genres": [], "publishers": [], "esrb_rating": null}