{"id": 68651, "slug": "furious-taxi-city-driver", "name": "Furious Taxi City Driver", "name_original": "Furious Taxi City Driver", "description": "Drive taxi is not so easy, life in the city is crazy, watch out for the people and the traffic! And then race faster than in the bus simulator, to take passengers to the destination! Can you keep your focus and bring your passengers towards their destinations? Please do because otherwise they might choose to travel with a different kind of public transport next time. Are you fit doing some speed driving and control your cab towards the big city during the city rush?<br/><br/>When playing this taxi driving simulator you need to follow the arrow on the map so you know where in the big city your passengers are waiting for you. After the passengers will get in your taxi the cab meter will start to run and money will be earned if you drop the passenger on time.<br/><br/>As a taxi driver you need to focus on the track, drive your taxi car smooth and precise, avoid obstacles and make the passengers happy on time.<br/><br/>If you like to play public transport simulator games then you will LOVE this taxi duty driver game!<br/><br/>TAXI CRAZY DRIVER FEATURES:<br/><br/>-\tRealistic Car Physics<br/>-\tChallenging Missions<br/>-\tRealistic urban city environment<br/>-\tDrop passengers in limited time<br/>-\tSmooth and 3 types of controls<br/>-\tMany different routes across the city<br/>-\tDrive the passengers to their destinations<br/><br/>Master your driving skills and download the taxi driving game with your friends!", "metacritic": null, "released": "2017-02-01", "tba": false, "updated": "2019-10-22T14:26:42", "background_image": "https://media.rawg.io/media/screenshots/b89/b89a3427a53eeb02627e0a1646eda928.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 104, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Files Studio"], "genres": ["Simulation", "Racing"], "publishers": ["FILES TECHNOLOGY PRIVATE"], "esrb_rating": null}