{"id": 686707, "slug": "old-tale-janku", "name": "Old Tale (Janku)", "name_original": "Old Tale (Janku)", "description": "<p>A tale of mystery, imagination and journey through known and unknown, that will take you through old, forgotten walls that echo times of greatness. Once inside, you will be on your own.</p>\n<p>...<br/></p>\n<p>Use Left Mouse Button to travel through lands of old...</p>\n<p>Use \"F\" to interact with your surroundings...</p>\n<p>Good luck, little one...<br/></p>\n\n\n<p>Descriptions and hints :</p>\n<p>If a light is green - you can pick up objects -&gt; if light stays - it means its infinite source of these objects and you can pick up another, after you used previously picked up object.</p>\n<p>If a light is yellow - great, you can solve a puzzle.</p>\n<p>If a light is red - you need to find object that can solve this puzzle.</p>\n<p>Hints :</p>\n<p>First area -&gt; to walk through the castle gate you need to walk past the tree growing on a side of the wall and find dead mouse. Next to it, will be lever, that you need to put in a panel next to the gate -&gt; press F and the gate will start to open.</p>\n<p>Second area -&gt; in the shadows, you'll find lever to open gate. Next, on the bridge you will find lever needed to lower down the bridge next to the empty panel.</p>\n<p>Third area -&gt; to open the next door you will have to walk to the little rocks source and use them next to the torch hanged on the wall. Then, after torch burns the thorns guarding the door, you will need to pick up the torch to reignite the furnace next to the door. That way, mechanism will activate and the door will fall, revealing entrance to next area.</p>\n<p>Fourth area - two plates, two boxes - figure out, how you can use them to your advantage. Watch out! Our creature throws boxes a bit, so you will have to navigate them on certain angle!</p>\n<p>Fifth area - to walk through the burning bridge you will need to disable fire mechanism. To do this, go to previous area and get bucket with water near the fountain, then go back to the main furnace and pour down water on it. Great! Now you can go on the bridge, but watch out! You will still have to be weary of the giant blades roaming through the hall!</p>", "metacritic": null, "released": "2021-10-25", "tba": false, "updated": "2021-10-29T12:17:05", "background_image": "https://media.rawg.io/media/screenshots/ae8/ae899fe598b37d4ecb02a0d0495f1f67.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 246, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Janku"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}