{"id": 686769, "slug": "reflections-itch-warped-imagination", "name": "Reflections (itch) (Warped Imagination)", "name_original": "Reflections (itch) (Warped Imagination)", "description": "<p>A game where you must use your reflections to solve  puzzles<br/></p>\n<p>Made as an entry for</p>\r\n                                     <br/>\n<p>The theme of this jam was \"Opposites\".</p>\n<p>This was a solo effort by myself and was created in under 72 hours.</p>\n<p>Assets wise you may recognize the avatar as I took the basic avatar from Mixamo and ripped the hands and head off. The hands were re-rigged to work and the head was split so you had the yellow and green indicating the left and right sides. Audio wise I used the  \"Galactic Adventure Music Pack 1\" from the Unity asset store found here.</p>\n<p>All other assets, shaders, effects etc.. were created by me during the development.</p>\n<p>So lets talk gameplay:</p>\n<p>You must move the blue cube to the goal within the puzzle bounds .. sounds easy right, well it kinda is, because I didn't want to make it too hard for a game jam.</p>\n<p>The difficulty comes in my interpretation of the game jam theme \"opposites\", I derived the meaning to be \"your opposite\" and \"your opposite side\". Hence the reflections of yourself. You must use your reflection to complete puzzles in front of the reflected avatar which in turn enable you to progress within the puzzle in front of you by using \"gates\". To make matters worse some levels have your reflection flipped so right is left and left is right .. or is it right is a reflected right and left is a reflected left .. I am not sure but to help I have color coded the hands so moving you left green hand moves all green hands across the avatars.</p>\n<p>Design points that can easily be missed while your solving the puzzles:</p>\n<ul><li>The hand models blend when interacting</li><li>There is a full interactive tutorial system</li><li>There is a full menus (which is a little sensitive)</li><li>There is a grading for each level using a stopwatch time which increases as you interact with the cubes (can you score three stars on all levels?)</li><li>As your time runs out the music changes in intensity using Unity audio mixer system.</li></ul>\n<p>And that's it .. I hope you like the game and if you entered the Jam all the best of luck with your entry.</p>\n\n<p>If your interested in making VR games I have a YouTube channel where I talk about the games I am working on and how I build them, so please come along and maybe support by subscribing.  Soon I will put up a video detailing all the components that went into this jam entry.<br/><br/>Here is one of the videos where I talk about building the Ultimate Turret Shooter including my custom full motion simulator!<br/></p>", "metacritic": null, "released": "2021-10-25", "tba": false, "updated": "2021-10-29T12:31:27", "background_image": "https://media.rawg.io/media/screenshots/0ac/0acefa3a20c0bb53ace716bd628f4a25.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 14, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Android"], "developers": ["Warped Imagination"], "genres": [], "publishers": [], "esrb_rating": null}