{"id": 686856, "slug": "princess-girl-avatar-maker", "name": "Princess Girl - Avatar Maker", "name_original": "Princess Girl - Avatar Maker", "description": "If you love to play dress up doll games, or create a pretty princess or a super pastel girl, this is the game for you! <br/><br/>Go from gothic fantasy, eastern style to cute casual vintage designs!<br/><br/>SPECIAL BENEFITS:<br/><br/>-Color editing tool!<br/>Customize the color of EVERYTHING, add new colors or edit colors with the high level of customization that princess girl implements.<br/><br/>-Layering tool<br/>Edit the layers of the accessories that your cute princess has, so you can choose which accessories come first to make your design even more stunning.<br/><br/>-Customizable clothing tool<br/>High level of customization of the items your princess has.Edit the color, the position, the order,and more. Decorate the dress design as you wish!.<br/><br/>-Beautiful accessories<br/>Add the accessories of your preference,using trendy fashion from cute necklaces to long skirts to creating unique princess designs. All items are unlocked!.<br/> <br/> <br/>- Create beautiful scenes<br/>Decorate the dream room of your lovely princess with tons of stickers and cute backgrounds and kawaii furniture.<br/><br/>Make your princess doll interact through speech bubbles and share through social media.<br/><br/>  Save your cute pastel goth girls as avatars to use as a profile image, background image, or whatever you like.<br/><br/>Create as many characters as you wish!<br/><br/><br/>-Tons of assets, options are limitless!<br/>With the wide range of available assets you can create infinite combinations of cute girls, creating more than humans, demons, monsters or zombie dolls.<br/><br/>-Kawaii interface<br/>This dress up game, tries to implement a simple kawaii and easy to understand interface.<br/><br/>HOW TO PLAY<br/><br/>1.Create your own anime doll girl<br/>2. Dress up your girl<br/>3. Add your cute doll princess to the scene (as many as you wish!)<br/>4. Save the scene to your gallery using our share feature.<br/>5. Remove the characters using dragging them to the trash can<br/>6. Edit old characters to create new ones renaming them<br/><br/>Clarifications<br/><br/>- Picture files will be saved inside a folder with the game's name.<br/>- Your characters get stored in your phone's internal storage.<br/><br/>Follow our social media for more Cute dress up games", "metacritic": null, "released": "2021-10-14", "tba": false, "updated": "2021-11-01T02:45:47", "background_image": "https://media.rawg.io/media/screenshots/2a0/2a0d2754cf1a3314cf826bc101b16959_ly6ci2d.jpg", "website": "https://www.playmadogames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 124, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Veronica Amado"], "genres": ["Simulation", "Casual"], "publishers": ["Veronica Amado"], "esrb_rating": "Everyone 10+"}