{"id": 686833, "slug": "football-rivals-soccer-game", "name": "Football Rivals - Soccer Game", "name_original": "Football Rivals - Soccer Game", "description": "Do you want to experience something different from the usual soccer games you play? Football Rivals is just for you.<br/><br/>A multiplayer soccer game that brings sports fans together. Team up with your friends and lead your team to success! Help it to become the ultimate team!<br/><br/>Start your soccer career <br/>Millions of players from all over the globe are waiting for you in this social soccer game, where you can meet new friends and join a supportive community. Here, teamwork makes the difference!<br/><br/>Deal soccer cards to attack your ultimate rivals! Participate in exciting matches where you will have to prove your team spirit and tactical skills. A soccer game you shouldn't miss out on! Match by match you can improve your strategy to bring fame by your side.<br/><br/>Join your local soccer community<br/>Find and team up with people from your country to support your national soccer team and defeat rival countries! <br/>Lots of friends that love soccer games just like you do are waiting for you. Who knows, maybe those friendships that you will start in Football Rivals can transform into real ones, and you will have new mates to go to real soccer games with! <br/><br/>Main Features<br/>• Join a Team: collaborate, make strategies and play matches with other real people - each match will be a real challenge;<br/>• Finish the Academies to gain skills;<br/>• Team customization - logo, avatars, description, statuses;<br/>• Team Chat: where you can talk to your teammates and prepare the strategies for the upcoming tournaments;<br/>• Matches - participate in each soccer match with your team and score as many goals as you can;<br/>• Use emojis to communicate your thoughts to your rivals;<br/>• Energy to play a slot machine - attack rivals in a penalty shootout mini-game, help your teammates &amp; friends with gifts, level up, and become the hero of your team;<br/>• Soccer game competitions - participate in competitions like Champions Cup, American League, Continental Cup, National Cup, Super Cup, and World Nations Cup<br/>• In World Nations Cup, your Club can take over different National Teams and bring them to glory in the qualifying, groups, and knockout stages;<br/>• Training Sessions: a 50 players competition where the biggest goal is to increase your level faster; <br/>• Thematic Golden Ball Competitions - with the possibility of unlocking unique items that will help you on each match: special ball, stronger defense, customized football cards, and more possession to defeat your opponents.<br/><br/>Deal soccer cards, play soccer games, win and become a champion.<br/>In this virtual soccer world, players from all over the world can connect, build friendships, create the best teams and fight together for the same goals. Football Rivals is your daily escape from real life where you can be part of your dream soccer team and fight in your dream league.<br/><br/>Step on the field and try out this multiplayer soccer game!<br/>Your goal is to win trophies and fight for a better place in the National and World Rankings. The adrenaline increases during the LIVE matches played against other Real Players, this is why being ACTIVE, especially during the live match, is an essential part. To win, besides Energy, you’ll also need your teammates. You need to be there for them, no matter what! To draw the winning soccer cards and become champions together by winning your dream league and lots of other tournaments. <br/>One thing is for sure - Teamwork helps you SCORE in Football Rivals!<br/><br/>An online soccer world in your hands!<br/>You can connect your social media account to find your friends easily and make new ones! Join the Football Rivals online soccer community on Facebook, Instagram, and TikTok and stay updated with contests, new features, releases, and news!<br/><br/>Football Rivals is free to play, but some items can be purchased for real money.<br/>A network connection is required to play!<br/><br/>For any issues or suggestions regarding the game, contact us at: support.footballrivals@greenhorsegames.com", "metacritic": null, "released": "2020-09-08", "tba": false, "updated": "2021-11-01T02:34:23", "background_image": "https://media.rawg.io/media/screenshots/b2f/b2f70c82da7bde31b6e26875be796fd9.jpg", "website": "https://www.greenhorsegames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 177, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Green Horse Games"], "genres": ["Sports"], "publishers": ["Green Horse Games"], "esrb_rating": "Mature"}