{"id": 686862, "slug": "456-survival-challenge", "name": "456 Survival Challenge", "name_original": "456 Survival Challenge", "description": "Red Light - Blue Light is one of the most thrilling challenges in the fish game. And we launch the game 456 Survival Challenge to help you transform into the main character number 456 and experience the death games.<br/><br/>When you incarnate into player number 456, you will have to do everything to survive and win huge prizes. You will have to face hundreds of other opponents through the rounds. To increase the fun, you will have to fight other players and they will appear in the interface of familiar characters in each round.<br/><br/>🧠 In 456 Survival Challenge<br/>❌ Green light - Red light: the most impressive opening game that attracts many players. Therefore, the challenge and fighting rate is extremely high. 🚦<br/>❌ Dalgona candy: requires ingenuity, careful attention to detail to be able to separate pieces of candy.<br/>❌ Tug of war: your strength, agility and intelligence need to be fully utilized in this game.<br/>❌ Jump on the glass: memory and luck will help you pass this round easily. But be careful not to be fooled.<br/><br/>Game Features:<br/>🔻 The interface is extremely eye-catching with a familiar soundtrack that brings a sense of thrill and fear.<br/>🔻 Constantly updated games will not keep you waiting.<br/>🔻 Join with real players so the difficulty will increase.<br/><br/>❗ In all minigames, just a little carelessness, you will be the loser and die, the huge amount of money will slip out of your hands and fall into the hands of others. So focus all your action to pass all the games and become the last survivor.<br/><br/>⏺ Download 456 Survival Challenge now to immerse yourself in the super hot game and become the ultimate winner bringing home the prize of 45.6 billion won. Enjoy the game with friends and family, you will never be disappointed.", "metacritic": null, "released": null, "tba": false, "updated": "2021-11-01T02:50:32", "background_image": "https://media.rawg.io/media/screenshots/ccc/ccc13e71ca6ddfa4cd7ac40764a23465.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 121, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["PHOENIX GAME STUDIOS"], "genres": ["Action"], "publishers": [], "esrb_rating": "Everyone 10+"}