{"id": 686863, "slug": "brain-puzzle-tricky-test", "name": "Brain Puzzle - Tricky Test", "name_original": "Brain Puzzle - Tricky Test", "description": "Welcome to Brain Puzzle - Tricky Test - top fun thinking and brain up games! Many tricky and funny puzzles are waiting for you. You have entered a funny world that can make your mind explode and free from common frameworks! Let's test your brain with Brain Up! 👌 🧠<br/><br/>Squid Challenge, Tricky Test is an addictive free tricky puzzle game with a series of tricky brain teasers and different riddles testing challenge your mind😝. It evaluates your logical think ability, reflexes, accuracy, memory and creativity. Do not answer the quests ❌ in the ordinary way if you don’t want to be tricked. The solution subverts normal thinking is the most interesting thing in this trivia game. We bring you a different game experience with creative thinking and absurd solution.<br/><br/>🕵️ GAME FEATURES<br/>⚈ Absolutely unimagined gameplay<br/>⚈ Easy and simple but humorous game process<br/>⚈ Funny sound and witty game effects<br/>⚈ Unexpected game answers<br/><br/>🍀How to play🍀<br/>The game rules are very simple. You just need to use your finger to touch, click, swipe, or even shake your phone to find the right answer.<br/>It may be a question of finding differences, hiding objects, word finders and other mind games... The answer will probably surprise you!<br/>The puzzles will be arranged from very easy to very difficult. Please calm down to pass!<br/><br/>Thinking games allow people to practice their mental and cognitive skills, improve their memory and keep them running for free. No matter your age, you can play this Brain Puzzle : Tricky Brain Teasers and train your brain to function better.<br/>Download the FREE brain game on your device NOW and get started!", "metacritic": null, "released": null, "tba": false, "updated": "2021-11-01T02:51:29", "background_image": "https://media.rawg.io/media/screenshots/b58/b5826548336b76deca01bc5a0e9fc2ff.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 133, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["ABI Global"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": "Teen"}