{"id": 686809, "slug": "house-builder-2", "name": "House Builder", "name_original": "House Builder", "description": "<p>Become one man construction crew and build houses like a simple African mud hut and as complex as a super modern energy saving architectural marvel.</p>\n<p>Let us take you on a trip to various spots on the globe and experience true architectural variety. You will try to build a mud hut in Africa, an igloo in the Arctic, a Canadian house, a log cabin in Siberia, traditional house made of bricks, airbricks or concrete and many, many more…<br />\nEvery house consists of hundreds elements you need to match according to rules of construction.</p>\n<p>See how the construction technologies differ from each other. Learn how to apply proper materials and procedures during building process.<br />\nBuild houses brick by brick, element after element, down from the foundations and up to the roof.<br />\nLearn different structures of buildings, construction materials, their features and properties. Build simple constructions made of primitive materials, but also ultramodern buildings featuring the latest technological discoveries.</p>\n<p>Use various tools depending on the situations and requirements. Improve your skills, use better equipment to be able to build complex structures quickly and efficiently.</p>\n<p>Sometimes there is no way out. Demolish everyting on you way and start over!</p>\n<p>ABOUT HOUSE BUILDER</p>\n<p>Building is your hobby? Thanks to the House Builder you will become a one-man construction crew! Find a perfect piece of land and create something amazing there! Constructing is only limited by your imagination and bank balance… So control your resources, keep up with construction standards and raise buildings that everyone will love!</p>\n<p>HOUSE BUILDER – MAIN FEATURES:</p>\n<p>To build a first-class house, start with choosing the perfect location. You can select every place in the world! Boiling Africa, frosty Siberia or tropical Amazon Rainforest? It’s up to you!<br />\nNext let’s focus on the project - you can create different types of buildings - from miserable little shed to exclusive mansion. This will depend also on the materials you will use. Each of them has different properties. Using a wrong material will cause unpleasant consequences. Prove your cleverness and knowledge to prevent any glitch in construction. By the time your skill will be better and buildings more advanced. When all the pieces are set, it only takes a moment to finish and give a unique look to your house. The buyers will be delighted!</p>\n<p>MAIN FEATURES</p>\n<p>Build all over the world - Learn more about the architectural style of the region and let your imagination run wild!<br />\nLearn new technologies - With every building your skill improves and new technologies will expedite your work.<br />\nDemolish! - Some of the houses must be cleaned up and rebuilt from scratches.<br />\nGo back in time - Travel across many periods in history and try to build all iconic designs<br />\nDiverse climate - scorching and freezing temperatures can be a challenge to sustain. Be aware of dangerous fauna.</p>\n<p>Home Builder.</p>", "metacritic": null, "released": "2021-11-10", "tba": false, "updated": "2024-03-02T15:33:01", "background_image": "https://media.rawg.io/media/screenshots/884/8845dbf1e82f5b1a6ef3a2a243def650.jpg", "website": "http://www.freemind.games", "rating": 3.4, "rating_top": 3, "added_by_status": {"yet": 5, "owned": 82, "beaten": 3, "toplay": 5, "dropped": 4, "playing": 4}, "playtime": 6, "achievements_count": 54, "ratings_count": 10, "suggestions_count": 267, "game_series_count": 0, "reviews_count": 10, "platforms": ["PC"], "developers": ["Freemind"], "genres": ["Adventure", "Simulation", "Casual", "Indie"], "publishers": ["PlayWay", "FreeMind"], "esrb_rating": null}