{"id": 686822, "slug": "superheroes-music-fighting-games", "name": "Superheroes Music Fighting Games", "name_original": "Superheroes Music Fighting Games", "description": "In Music Hero Free Fighting Games you can play the best of street fighting games and the best of music games . For your super heroes to fight with the beat of the music, you must match the pulsations which are synchronized with the rythm of the dubstep so you can hit your opponent.<br/><br/>Download this fighting game and prove how you can smack with your punch and the skills of your super hero in a fast fight to death. Feel how your opponent's sweat splatters, since these fast-paced street fights are very realistic. They have the best of boxing games with the beat of dubstep music.<br/><br/>These superheros master all street fighting techniques, wrestling, kung fu, mma and boxing, so you only have to choose the superhero you like the most and start the adventure to save the humankind with the beat of dubstep music.<br/><br/>                                           GAME FEATURES    <br/><br/><br/>■ Create dubstep music with the beat of the pulsations.<br/>■ Be amazed with its awesome 3D fighting graphics.<br/>■ Dance with more than 30 free music tracks to play and fight your rivals. <br/>■ Collect more than 20 superheroes to fight.<br/>■ Fight with quick fight mode, face to face in Arcade mode.<br/>■ Challenge your friends in multiplayer mode and combat against players from all over the world.<br/>■ Combat in different dynamic stages.<br/>■ Play with any device with your saved game.<br/><br/>With Superheroes Music Fight you will be able to enjoy all fight disciplines of street fighting; compete agains masters of kung fu, mma, karate, wrestling, boxing and all other fighting styles to enjoy an epic battle. You will be able to pick between more than 20 heroes totally for FREE! Unlock cards and get your new heroes using summoning crystals.<br/><br/>Remember that when a hero dies, a legend is born and the music will help you in your path of glory to fight for your planet. Every piano chord or guitar touch will be an opportunity to hit with a punch the other fighter.<br/><br/>You will be able to listen to the music every day of your life, since it is the best of free iOS games that mixes up the versatility of street fight with the elegance and finesse of rythm games; everything with free dubstep music, totally original.<br/><br/>Feel like the best of super heroes of the Universe and fight to save the planet from the inminent threat of the villains who want to conquer the Earth with the beat of dubstep music.<br/><br/>Remind that this game represents a fictional universe of Altivasoft and it is not affiliated to any promotion or trademark.", "metacritic": null, "released": "2017-05-06", "tba": false, "updated": "2021-11-01T02:28:51", "background_image": "https://media.rawg.io/media/screenshots/95d/95dd6eaf78062877a87ef6b124da78cd_UjFl8gY.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 184, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Altivasoft"], "genres": ["Casual"], "publishers": ["Altivasoft"], "esrb_rating": "Everyone 10+"}