{"id": 68698, "slug": "princess-shaving-salon-kids-games-boys-girls", "name": "Princess Shaving Salon - Kids Games (Boys & Girls)", "name_original": "Princess Shaving Salon - Kids Games (Boys & Girls)", "description": "***Over 1.75 Million Downloads!*** Help the rainbow princess look her best!! Go to the hair, pet and fashion salon for a beautiful royal makeover!<br/><br/>**Features 3 Salon Rooms Including:**<br/>Hair Spa: Oh No! The rainbow princess is a mess. Help the princess get cleaned up and fix make up! Use the tools on the right-side bench to remove the dirty layers &amp; hair slime, then add fun stickers and clean the hair!<br/><br/>Pet Spa: Wash the baby pet hair and give the cute pet a new makeover! Clean up using the bottom bench pet salon tools. Use bubbly soap bar to clean off the pet then rinse off, remove bugs and more!<br/><br/>Fashion Room: Go to the fashion walk-in closet and pick out the perfect outfit for your princess! Change hair styles, dresses, outfits, hats and more! Add hair accessories like hats &amp; princess tiara's! Then finish with jewelry such bracelets, earrings, necklaces and glasses!<br/><br/>*Please note that Rainbow Princess Hair Salon is free to play, but you are able to purchase additional characters, game items and remove ads with real money. If you don’t want to use this feature, please disable in-app purchases.* <br/><br/>Ninjafish Studios is very concerned about our users' privacy. To understand our policies and obligations, please read our Terms Of Service and Privacy Policy carefully. <br/><br/>Terms Of Service: http://www.ninjafish.com/tos <br/>Privacy Policy: http://www.ninjafish.com/privacy", "metacritic": null, "released": "2014-06-12", "tba": false, "updated": "2019-10-22T14:26:43", "background_image": "https://media.rawg.io/media/screenshots/42e/42e3377591de9f3ca3ed62a806be1bf8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 119, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ninjafish Studios"], "genres": ["RPG", "Family"], "publishers": ["Ninjafish Studios"], "esrb_rating": null}