{"id": 687014, "slug": "pumpkin-smashing", "name": "Pumpkin Smashing", "name_original": "Pumpkin Smashing", "description": "<p>The pumpkins are coming! And their god couldn't be happier!</p>\n<p>Nestled in the castle of the Skeleton Kingdom, the Skeleton King's personal Skeleton Chef tamed the god of the Pumpkins. He did this by feeding him pumpkins. How the Skeleton Chef discovered that the god had a taste for his own kind, no one knows.</p>\n<p>Angry at this affront, the pumpkins have come to enact revenge on the Skeleton Kingdom. Famine followed in their orange wake as they consumed the Boneseed crops of the skeletons. God and Chef both seeing opportunity, they send their line cook to destroy the pumpkins, bring back their insides, and cook a mass of pies to feed the starving kingdom with.</p>\n<p>You play as this humble line cook, bullied by your boss and the cannibalistic god he conspires with. With your tenderizer mallet, go forth and do their bidding!</p>\n<p><strong>HOW TO PLAY</strong></p>\n<p>Smash pumpkins and bring their smashed remains back to the skeleton chef for him to bake pies with. Make sure the meter is full, otherwise the chef will berate you. You cannot pick up more smashed remains while the meter is full. The chef will reward you with a slice of pie for your efforts that will refill some of your health. Once you meet the pie quota, you will move onto the next level. New levels means new challenges, including new enemies to face.</p>\n<p><strong>DEFAULT CONTROLS</strong></p>\n<p>Movement: W, A, S, D</p>\n<p>Swing Hammer: Right CTRL</p>\n<p>Menu/Pause: ESC</p>\n<p>You can rebind these keys in the options menu, and even use a controller.</p>\n<p><strong>KNOWN ISSUES</strong></p>\n<p>- Voice lines can overlap.</p>\n<p>- Collision issues. You can get stuck in walls, especially if you hit them diagonally.</p>\n<p>- Enemies can spawn in starting area.</p>\n<p>- Pumpkin remains stop enemy movement.</p>", "metacritic": null, "released": "2021-10-31", "tba": false, "updated": "2021-11-01T03:28:35", "background_image": "https://media.rawg.io/media/screenshots/83b/83b54d39be3fe35b26e57022a306702b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 8, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["billy2600"], "genres": [], "publishers": [], "esrb_rating": null}