{"id": 68703, "slug": "sniper-squad-hero", "name": "Sniper Squad Hero", "name_original": "Sniper Squad Hero", "description": "Sniper Squad Hero is a 3D action sniper shooter game fully packed with fury action and shooting simulations. You are legend fury Sniper Squad Assassin part of a secret agent for counter terrorist contract killing. Now as the part of this sniper squad agent you are assigned super hero to a mission.<br/><br/>We have to take down all the enemies and save the citizenry from gangs, robbers, and other terrorists that are trying to take over the streets. You have modern sniper gun and you are elite sniper squad hero assassin so hunt down one by one these counter terrorists with your sniper gun. Take place on the tower of this enormous city and sniper them all with your rifle. Prove yourself as one man army and make your Sniper Squad Assassin team proud of you.<br/><br/>Though it was an impossible mission but we are sure you will successfully accomplish this mission by using your Sniper Squad Assassin heroes skills. As a professional elite sniper secret agent, you are called to defeat the counter terrorists. <br/><br/>Go undercover and become gangster revenge the streets need! So do not wait any longer and join this elite sniper shooter 2017 game now with your device! So agent if you like this game give us a rating and review and let us know what to do better.<br/><br/>Game Features:<br/><br/>-\tRealistic 3D graphics.<br/>-\tEasy sniper gaming controls.<br/>-\tFully packed with action!<br/>-\tTotally FREE to play.<br/>-\tSmart Combat Enemies", "metacritic": null, "released": "2017-01-27", "tba": false, "updated": "2019-10-22T14:26:43", "background_image": "https://media.rawg.io/media/screenshots/660/660cf159bfe103d2a88341369bedec91.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 114, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Files Studio"], "genres": ["Action", "Simulation"], "publishers": ["FILES TECHNOLOGY PRIVATE"], "esrb_rating": null}