{"id": 68714, "slug": "monster-ramp-stunts-challenge", "name": "Monster Ramp Stunts Challenge", "name_original": "Monster Ramp Stunts Challenge", "description": "Welcome to Mega Ramp Stunts game of Monster trucks:<br/>Save yourself from massive stunts, jumps tricky tracks, massive jumps with a number of obstacles and with mud roads this adventuring game is assuredly designed to make an air stunt of asphalt truck.<br/><br/>Are you daring adequate to initiate with racing monster truck futuristic stunts free on impossible tracks and ramps containing expertness enough to be a super master in impossible track monster driving &amp; trucker stunting destruction?<br/><br/>Let’s check your skills and expertise you can survive or not in this gravedigger monster truck game because there are twisted roads, crazy stunts tricky tracks on the sky because this is made as sky stunt making a game with 4x4 truck &amp; crazy monster, truck freestyle.<br/><br/>You might have played many air monster 3d, monster truck block &amp; monster truck driving games but while playing this Xtreme Monster Truck, Ride on death monster truck stunts track and regulate your classical monster trucker driver carefully by evading with pebbles to grasp the terminal point in the required time period.<br/><br/>Driving a big vehicle can be difficult; will you be able to finish all the jobs of the monster truck rally? Jump into luxury monster trucks to drive safely on curvy and zigzag tracks and reach at road end to finish all levels.", "metacritic": null, "released": "2018-08-25", "tba": false, "updated": "2019-10-22T14:26:43", "background_image": "https://media.rawg.io/media/screenshots/70a/70a4cc8e45395069b0fadb1bb4bbed2e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 84, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Files Studio"], "genres": ["Simulation", "Racing"], "publishers": ["FILES TECHNOLOGY PRIVATE"], "esrb_rating": "Everyone 10+"}