{"id": 687293, "slug": "sky-jumper-the-elegist", "name": "Sky Jumper (The Elegist)", "name_original": "Sky Jumper (The Elegist)", "description": "<p>This demo was made during the Devtober challenge set by Jonathan \"Ellian\" Rousseau in 2021.</p>\n<p>My goal for this challenge was to learn more about 3D game development, including the process of making 3D models, shaders, textures, etc and managing my time on actually kind of finishing a project.</p>\n<p>This is my very first project relying heavily on the 3D space and I learned a lot during this challenge.</p>\n<p>The game mechanics you will find in this demo might end up being used in an actual game I am planning to do at some point, but I am not entirely sure about its direction yet.</p>\n<p>Of course I had many more features I wanted to implement, but due to the time constraint I had to cut a lot. Sometimes I cut even pretty important features, like an ingame tutorial. You can read more about my experience during this month in my post mortem, that I will upload later today.</p>\n<p>Thank you so much for checking this out and taking your time to read this! &lt;3</p>\n\n<p>\n</p>\r\nHow to play\r\n<p>It is reccomended to play this demo with a controller.</p>\n<p>(XBOX Layout):</p>\n<p>Left Stick / WASD - Move Player</p>\n<p>Right Stick / Mouse - Move Camera</p>\n<p>A / Space - Jump</p>\n<p>RB / Shift - Dash</p>\n<p>You can double jump in this game.</p>\n<p>To perform a wall run dash into a wall und hold RB. While you are holding RB you will stick to the wall, release it and you'll fall. You'll still have your double jump then, they refill on floors and walls. Depending on the angle you hit the wall, the character will move along it sideways or upwards. While on walls press jump to perform a wall jump.</p>\r\nGoal\r\n<p>Run, jump and wall run through the level and reach the goal.</p>\n<p>Optionally there are 63 feathers for you to collect.</p>\r\nKnown Issues and minor problems\r\n<ul><li>The fullscreen checkbox will not be marked as highlighted when turned on, which can lead to confusion</li><li>The music restarts when dying or restarting the level</li><li>Some sfx are missing, like dying or reaching the goal</li></ul>\n<p>Let me know if you find more issues. I am more than happy for feedback!</p>", "metacritic": null, "released": "2021-10-31", "tba": false, "updated": "2021-11-01T04:33:09", "background_image": "https://media.rawg.io/media/screenshots/db7/db7f5af9d5762596247e47438dd0a322.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 40, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["The Elegist"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}