{"id": 687377, "slug": "goraca-krew", "name": "Gorąca krew", "name_original": "Gorąca krew", "description": "<p>Obracasz się za mijanym na ulicy mężczyzną - czy on naprawdę był tak blady? I ile właściwie miał lat?<br/></p>\n<p>Na zatłoczonym parkiecie, kiedy tańczysz ze zjawiskową dziewczyną, nagle czujesz ugryzienie w szyję. Inne niż wszystkie dotychczasowe.</p>\n<p>W zaułku osacza cię trzech ludzi z kołkami w dłoniach. Uśmiechasz się, odsłaniając kły. W lokalu obok leci twoja ulubiona piosenka. Przeciągasz się i ruszasz do tańca. Nie mają z tobą szans.<br/></p>\n<p>Tak właśnie wygląda świat \"Gorącej krwi\" - gry fabularnej, w której taniec jest sensem wydarzeń, osią wszystkich fabuł i bronią przeciwko twoim wrogom. Tych możesz spotkać na każdym kroku; nocnym życiem niechętnie muszą dzielić się w fikcyjnym świecie ludzie i wampiry. Każda ze stron chce zaś przejąć noc tylko dla siebie. Parkiety, dyskoteki, potańcówki i prywatki stają się polem walki o przetrwanie, a wygodne ubranie, buty do tańca i przećwiczone ruchy to twoje zbroja i oręż.<br/></p>\n<p>\"Gorąca krew\" to pulpowa gra fabularna, w której przeniesiesz się do czasów świetności muzyki disco. W fikcyjnym świecie tworzonym podczas rozgrywki obok ludzi tańczą jednak wampiry. Każda ze stron walczy z drugą o przetrwanie i prawo do nie-skrępowanej nocnej zabawy. Ich bronią – twoją bronią – staje się w tym starciu taniec, a polem walki parkiety, dyskoteki, potańcówki i prywatki.</p>\n<p>\"Gorąca krew\" to:</p>\n<ul><li><strong>20-stronicowy podręcznik</strong> (także w wersji printer friendly), z którego dowiesz się, jak stworzyć ludzką lub wampirzą postać oraz, wspólnie z innymi osobami przy stole, historię o lojalności, tańcu oraz konfrontowaniu się z przeciwnościami, których pozornie nie da się pokonać;</li><li><strong>system do jedno- lub wielostrzałów </strong>umożliwiający dynamiczną rozgrywkę i wspierający nieszablonowe rozwiązania;</li><li><strong>fikcyjny świat </strong>inspirowany pełną paletą dzieł: od \"Draculi\" Brama Stokera przez filmy \"Footlose\" i \"Rocky Horror Picture Show\" po godziny muzyki disco.</li></ul>\n<p>Gotycka groza spotyka się tu z pulpowymi dynamiką i przerysowaniem, a epickie sceny taneczne - z rozwiązywaniem tajemnic i odkrywaniem tajemnic nocy. Żeby wejść do tego świata, potrzebujesz:</p>\n<ul><li>ośmiościennej kości;</li><li>podręcznika i karty postaci;</li><li>od 1 do 4 osób;</li><li>3-4 godzin czasu na rozgrywkę;</li><li>zarysu fabuły, który rozwiniesz podczas sesji.</li></ul>\n<p>To co, widzimy się na parkiecie?<br/><br/></p>", "metacritic": null, "released": "2021-10-31", "tba": false, "updated": "2021-11-01T04:53:20", "background_image": "https://media.rawg.io/media/screenshots/25c/25c7fc4ad425e96c3a4deb344a338b5e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 78, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["solskaia"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}