{"id": 687486, "slug": "sweetest-valentine", "name": "Sweetest Valentine", "name_original": "Sweetest Valentine", "description": "♡ Summary ♡\r\n<p><em><strong>\"Well... love makes you do stupid things, after all.\"</strong></em><br/></p>\n<p>1 day later, and it'll be Valentine's Day.<br/></p>\n<p>You're playing as Aimi (name changeable) and, of course you're not going to miss out going on a date during the special day.  The problem is, you'll have to choose between your childhood friend or your crush who doesn't seem to like you back.</p>\n<p>Unfortunately, that isn't the only problem you'll be facing. \r\n</p>\n<p>In your hometown, some people have gone missing without a word. Whether they are killed or kidnapped, nobody knows. You might want to be careful so that you don't become one of them.</p>\r\n♡ Characters ♡\r\n<br/>\r\n♡ Features ♡\r\n<ul><li>This is a short game. It has 17k words and takes around an hour to finish.</li><li>35+ CGs</li><li>Two routes to choose from and a total of nine endings (six bad endings, one normal ending, one good ending, and one true ending)</li><li>All choices in this game matters (except for the first choice in day 1).</li></ul>\r\n♡ Additional Info ♡\r\n<p><strong>Content warning (possible spoilers): </strong>mild gore, depictions of  blood, murder, suicide, implications of abuse, mentions of animal death and animal cruelty, yandere-ish behavior</p>\n<p>For full credit (photo bg, SFE, and BGM sources), read the Full Credits.txt file inside the Sweetest Valentine folder.</p>\r\n.•° ୨୧ °•.\r\n<p>Thank you for checking this page out!  This game is inspired by CHARON's games and DDLC. It's also my first game. I hope you'll enjoy playing it as much as I enjoy making it. Feedback will be greatly appreciated!</p>\r\n°•. ୨୧ .•°", "metacritic": null, "released": "2021-10-31", "tba": false, "updated": "2021-11-01T05:19:29", "background_image": "https://media.rawg.io/media/screenshots/98a/98a577a4407d5912c9b8ea7075aa4d3e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 254, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["syllphana"], "genres": [], "publishers": [], "esrb_rating": null}