{"id": 68741, "slug": "stickman-zombie-sniper-shooter", "name": "Stickman Zombie Sniper Shooter", "name_original": "Stickman Zombie Sniper Shooter", "description": "Files Studio would like to welcome you to our Stickman Zombie Sniper Shooter game of last night survival. The entire theater is covered with stickmen zombies, this unavoidable deathmatch of Stickman Zombie Counter Shooter is about to start! Are you capable of living in stick zombie thrill or at night of the Halloween dead? Meet the real challenge of a zombie outbreak, save the world, defend the camp, Beat as many deadly zombies as possible and become the stickman zombie real sniper counter shooter.<br/>It’s last night survival for you in this stickman Zombie Apocalypse Survival mania. You’ve also got training in third-person shooting and first-person shooting with survival dead squad of the military. So you don’t need to worry about the rise of dead zombie &amp; DEAD TARGET Halloween. Now it’s your time to become Halloween dead Sniper and just enter into scary games for Halloween games &amp; kill last stickman zombie.<br/>How to Play this Stickman Zombie Sniper Shooter?<br/>Defeat the virus of stickman real zombies before the infection spreads all over and kill the zombies’ stickmen squad with different sniper and gunshots to stop the tsunami of evils. Align the shot of weapons at Zombies Arena, zoom the camera as Assassin counter shooter and take head shots by clicking the trigger at zombie stickmen arena. You have to be a real zombie stickmen hunter in this sniper stickmen zombie real shooter assault game.<br/>Features of Stickman Zombie Sniper Shooter:<br/>Realistic Environment having sharp sniper Halloween shooter.<br/>Challenging game missions of zombie survival game.<br/>Realistic and latest models of sniper shooting guns.<br/>Nonstop action zombie war frontier simulation.<br/>Compatible user interface having Stickman zombies APOCALYPSE.", "metacritic": null, "released": "2018-07-24", "tba": false, "updated": "2019-10-22T14:26:44", "background_image": "https://media.rawg.io/media/screenshots/a55/a552d5ab4a53bfbb32e2bc4535ea5810.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 168, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Files Studio"], "genres": ["Action", "Adventure"], "publishers": ["FILES TECHNOLOGY PRIVATE"], "esrb_rating": null}