{"id": 687515, "slug": "death-saw-challenge-unity", "name": "Death Saw Challenge [Unity]", "name_original": "Death Saw Challenge [Unity]", "description": "<p>It is time to be running scared. It is time for another spooky game. For Halloween 2021, The New Dimension is proud to bring you a gruesome party game called <strong>Death Saw Challenge</strong>. Created as a fun practice piece and also for fun in <strong>Unity 2018</strong><strong>, </strong>but final compiling was done in <strong>Unity 2020</strong>. <br/><br/><strong><em>This game is not suitable for the faint hearted - although it is supposed to be fun.<br/><br/></em>This is a fun hi score attack challenge, based on the Commodore 64 game, which was released Halloween last year. <br/></strong><br/>You are a blue troll who has been thrown into a dismal cell inside a haunted prison. You are not alone. In fact, you have company. Ah, that's nice !!! ... Well it wont be very nice to be honest. <br/></p>\n<p>Out from nowhere magic death saws will appear. You cannot sit idle. You had better run. Keep on running to score points and survive for as long as you can. You will be alerted when a death saw will appear on screen via an alarm signal. After six death saws have appeared, there is one more deadlier surprise. <br/><br/>Try to score as many points as you can by running around, before you face your fate - <strong>death</strong>. Good luck. !!!<br/><br/><strong>Credits:<br/><br/></strong>Game design, graphics, programming and music (Composed back in 2007 in MadTracker V2) by <strong>Richard Bayliss<br/></strong>Additional graphics by <strong>MightyMechanic<br/></strong>Sound effects by <strong>Simon13666<br/>Built in Unity 2018, but compiled and final building in Unity 2020</strong></p>\n<p><strong><br/>(C) 2021 The New Dimension<br/></strong>This game production is free. Not to be sold in any form by all means.<br/></p>", "metacritic": null, "released": "2021-10-31", "tba": false, "updated": "2021-11-01T05:26:02", "background_image": "https://media.rawg.io/media/screenshots/033/033fa88dda1eb6d6517f2edc1691af91.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 84, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["Richard of TND"], "genres": [], "publishers": [], "esrb_rating": null}