{"id": 687635, "slug": "snip-snip-snippy-demo", "name": "Snip Snip Snippy DEMO", "name_original": "Snip Snip Snippy DEMO", "description": "<p><em>The game may take a while to load when you first come here, as your browser needs to download the assets and get them ready.  I tried to make this as easy as I can by minimizing the number of assets, but the one informative article on Ren'Py web builds I could find when I looked into it told me to use webps and I hate those things</em><em> so much i hate them so much oh god-- oh, it also may not run in Safari or other webkit browsers</em><br/></p>\n<p>Your parents died recently.  While they haven't seen much of you since you moved to the city a few years back, they still left everything to you, fully paid off house included.  It's time you see what else has changed in your absence.</p>\n<p>This demo is short, about equivalent to one \"chapter,\" and with three routes, one \"ending\" per route.<br/></p>\n<p><strong>(This was made in a month and a half, distributed in a way that is currently in beta, and as such some corners had to be cut.  Some story elements were altered for the purpose of this demo as well, to shorten the length while still leaving a close-to-desired impression.  Please consider it more of a proof of concept than an indication of the final product.)</strong></p>\n<p>Content warnings found here.<br/></p>\n<p><strong>Q &amp; A?  sure</strong></p>\n<p><strong>Will the full game also be free and in my browser?</strong>  No.  It will be a download and cost money.   I expect 5-10 USD depending on how long it turns out.  This demo is simply in-browser to make it that much more quick &amp; easy for people to try it.</p>\n<p><strong>Will that one ending be in the full game?</strong>  No lol</p>\n<p><strong>Why is there only a volume slider for music?</strong>  Because music is literally the only audio present.  Had I had the time to find and implement sound effects in this version, that would be different.  (There will be sound effects in the full game.)<br/></p>\n<p><strong>Will you update this demo?</strong>  When Ren'Py's web distributions see significant improvement I'll rebuild the distribution in that newer version to smooth out any rough edges (it's in pretty early beta as I type this), but no new content will be added to it.  Only <em>glaring</em> mistakes/bugs will be changed.<br/></p>\n<p><strong>When will the full game come out?</strong>  Not sure yet, but I'll post here about it when I get a better idea.</p>\n<p><strong>How can I support further development?</strong>  You can donate to the project right here on itch, <em>or</em> I have a ko-fi here.  No reward tiers have been set up there yet, but monthly donations are an option if you feel so inclined.<br/></p>", "metacritic": null, "released": "2021-10-31", "tba": false, "updated": "2021-11-01T05:55:03", "background_image": "https://media.rawg.io/media/screenshots/70f/70f82804d23184274ebc3731c97f5daa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 10, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Orange Carnation"], "genres": [], "publishers": [], "esrb_rating": null}