{"id": 687861, "slug": "ten-paces-ver-20", "name": "Ten Paces (Ver 2.0)", "name_original": "Ten Paces (Ver 2.0)", "description": "How to Play\r\n<p>Pistols at dawn! At the start of each round both players will automatically walk ten paces away from each other. A countdown timer at the top of the screen shows the time this will take.</p>\n<p>Players can play fairly and wait until they have walked ten paces to turn and fire - their character has had the time to breath and concentrate their aim, so they will automatically hit their target. This is a test of fastest reaction time!</p>\n<p>How to <strong>REALLY </strong>play Ten Paces: <strong>YOU MUST CHEAT!</strong> Turn to face your opponent early, but take a moment to focus your aim by inputting the directional button sequence shown. The earlier you decide to turn, the longer the sequence of inputs you'll have to make. If you mess up your inputs you'll have to start the sequence over. The first player to complete their button sequence wins the round. <strong>You must wait at least one pace to turn (you have a little bit of honour at least).</strong></p>\n<p>There are strategies to Ten Paces: Turn early and accurately press your buttons. Or maybe wait for your opponent to mess up their inputs and then turn to have a shorter sequence of buttons with the same amount of time to press them. If you're confident that your opponent will not correct their aim fast enough, you can even wait the full ten paces like a gentleman and turn to shoot them with no effort! Damn your eyes!</p>\n<p>P1 Controls (Red Player): <strong>Space</strong> or <strong>Left Shift</strong> to turn. <strong>W</strong> = UP, <strong>S</strong> = DOWN, <strong>A</strong> = LEFT, <strong>D </strong>= RIGHT</p>\n<p>P2 Controls (Blue Player): <strong>Right Ctrl</strong> or <strong>Page Down</strong> to turn. <strong>Arrow Keys </strong>= Directional Inputs</p>\n<p><strong>Fullscreen</strong><strong> recommended!</strong></p>\n<p><strong>Menus can be navigated with WASD, arrow keys, mouse. Confirm selection with Space, Return, Enter, Left Shift, Right Ctrl, Page Down, Left Click. (P2 cannot select anything other than their difficulty on the Main Menu. Other buttons must be pressed by P1 or mouse input.)</strong></p>\n<p><strong>Default difficulty is Advanced - this is recommended for most players as it allows for just under 3 inputs per second which creates a super competitive game with a bit of practice.</strong></p>\n<p><strong>Use the Main Menu to change difficulty. The difficulty option must be selected with mouse click or a confirm input (P1: Left Shift, Space) (P2: Return, Enter, Right Ctrl, Page Down). </strong></p>\n<em>Credits</em>\n<p><em>A game created by Monster Hammer Games for Leeds Beckett University Game Jam, October 2021. Ten Paces was the winning game of this jam, with the theme \"Ten Seconds\".</em></p>\n<p><em>Additional features and bug fixes have been implemented for this build post-jam. The original build can be found at rhydonal.itch.io.</em></p>\n<p><em>Monster Hammer Games Team</em></p>\n<p><em>Rhydian Carter, Ryan Graysmith, Cassie White</em></p>\n<p><em>Original game concept, design and development by Rhydian Carter.</em></p>\n<p><em>(rhydonal.itch.io)</em></p>\n<p><em>3D character models and flintlock pistol model by Ryan Graysmith.</em></p>\n<p><em>Main gameplay music and credits page music by Cassie White.</em></p>\n<p><em>3D models of trees, fences and rocks by Broken Vector.</em></p>\n<p><em>- Available for free on itch.io</em></p>\n<p><em>Seamless grass texture by 3D Textures.</em></p>\n<p><em>- Available for free on 3dtextures.me</em></p>\n<p><em>SFX by Mixkit.</em></p>\n<p><em>- Available for free on mixkit.co</em></p>", "metacritic": null, "released": "2021-10-30", "tba": false, "updated": "2021-11-01T06:46:27", "background_image": "https://media.rawg.io/media/screenshots/236/236421cae03007764f9ff22e059c13ae.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 24, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Rhydonal"], "genres": ["Action"], "publishers": [], "esrb_rating": null}