{"id": 68781, "slug": "color-by-number-fashion-cpix", "name": "Color by number - Fashion CPiX", "name_original": "Color by number - Fashion CPiX", "description": "Fashin Color by Number: Enjoy coloring the best Fashin artworks! Relax, relieve your stress and enjoy coloring!<br/><br/>Enjoy daily new artwork from the Fashin category. Best in its class! <br/><br/>Amazing large selection of hand picked and crafted art.<br/><br/>Challenge yourself and color to unleash your inner creative artist.<br/><br/>Anti-stress coloring at its best! Start now and try it for yourself!<br/><br/>Put simply, the best pixel art color by number app!<br/><br/>Fashion CPiX Premium Unlimited Subscription:<br/>You can access all of the artworks and images (new ones added regularly), remove advertisements, and more with a paid subscription. <br/><br/>One subscription is available:<br/>-Weekly at $3.99 or equivalent<br/><br/>-Fashion CPiX Premium offers a 3 day free trial to access the full app content. Any unused portion of a free trial period will be forfeited if you purchase a paid subscription before the end of the free trial. <br/><br/>-You may cancel or manage the free trial or any of the paid subscriptions from your iTunes account settings. Auto-renewal may also be turned off via the account settings in iTunes.<br/><br/>-Your account will be charged for renewal of the chosen subscription within 24-hours prior to the end of the current subscription period.<br/><br/>-Cancellation of the current active subscription is not possible during the active subscription period.<br/><br/>-Paid subscriptions automatically renew within 24-hours prior to the end of the current active subscription period.<br/><br/>-Note that prices of paid subscriptions may vary depending on your country. The actual amount charged will be presented to you in your local currency at the time of first purchase.<br/><br/>You can read our Privacy Policy and Terms of Use via the following links:<br/>Privacy policy:<br/>http://mafooly.com/configs/apps/fashion_cpix/privacy_policy.html<br/><br/>Terms of use:<br/>http://mafooly.com/configs/apps/fashion_cpix/terms_of_use.html<br/><br/>You can contact us via:<br/>http://mafooly.com/mapps/pages/contact/<br/><br/>Enjoy!", "metacritic": null, "released": "2018-01-31", "tba": false, "updated": "2019-10-22T13:54:58", "background_image": "https://media.rawg.io/media/screenshots/765/765f05c0c02cb7b4fb0e953f3403729c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 61, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mafooly"], "genres": ["Family", "Puzzle"], "publishers": ["Gamma Web"], "esrb_rating": "Everyone 10+"}