{"id": 68791, "slug": "cookie-empire", "name": "Cookie Empire", "name_original": "Cookie Empire", "description": "You have been put in charge of an up and coming bakery! Your mission is to turn your small bakery into a world conquering desserts empire! Get ready to play the best clicker game available!<br/><br/>Grow your bakery by collecting cookies, buying powerful structures, unlocking amazing upgrades, discovering new desserts, researching epic upgrades and using sweet power-ups! <br/><br/>Get a head start on your bakery and stay ahead of your friends! Prove to them that you have a bigger cookie empire than they do - don't let them beat you!<br/><br/>FEATURES<br/><br/>◆ Discover 80+ desserts including brownies, pastries, cookies, cakes and donuts!<br/>◆ Invest in powerful structures to maximize your earnings!<br/>◆ Use the power of cupcakes to get a mega boost!<br/>◆ Research epic upgrades to supercharge your profits!<br/>◆ Unlock 1,000+ wacky upgrades!<br/>◆ Special showcase items to collect!<br/>◆ Mega boosts to take your production to the next level!<br/><br/>We're always listening to all feedback we receive! We want to make Cookie Empire the absolute best clicker / incremental game and your feedback helps us reach that goal. We read *everything* you send us, so please let us know what you'd like to see! Feel free to send us feedback by going to Menu &gt; Settings &gt; Feedback :)<br/><br/>WARNING: We're not responsible for any dessert cravings you may experience while playing this game. You've been warned!<br/><br/>Use reddit? r/CookieCollector<br/><br/>----------------<br/><br/>Cookie Empire offers a paid Cookie Club subscription in addition to other in-app purchases. The Cookie Club subscription gives access to exclusive in-game perks (see the full list in-game by going to Menu &gt; Shop &gt; Cookie Club).<br/><br/>The Cookie Club subscription is charged monthly, and renews automatically each month. Payment will be charged to your iTunes Account upon confirm your subscription. The subscription will automatically renew unless auto-renew is turned off at least 24 hours before the subscription renewal date.<br/><br/>Subscriptions can be managed and auto-renew can be turned off by going to your iTunes Account Settings after purchase. No cancellation is allowed during active subscription period.<br/><br/>Privacy Policy: www.pixelcubestudios.com/Privacy<br/>Terms of Service: www.pixelcubestudios.com/terms", "metacritic": null, "released": "2017-08-19", "tba": false, "updated": "2019-07-30T00:29:02", "background_image": "https://media.rawg.io/media/screenshots/c40/c40c1b6dc15a29f9bf4c752c66f952f6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 40, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["PixelCUBE Studios"], "genres": ["Strategy", "Simulation"], "publishers": ["PixelCUBE Studios"], "esrb_rating": null}