{"id": 688110, "slug": "the-5-gentlebones", "name": "The 5 Gentlebones", "name_original": "The 5 Gentlebones", "description": "<p>Welcome to <strong>Gentletown</strong>. Home to concerts from the famous group \"The 5 Gentlebones\". But it's members are a pain in the butt for the inhabitants. <strong>Teach them manners by throwing them pumpkins</strong> in this spooky and goofy open-world first person game.</p>\n\r\nGame content\r\n<p>This is short experience where the aim is to create a specific atmosphere. In this game <strong>you have to beat 5 skeletons</strong> that are hidden in the town. Each game, each of the 5 skeleton is given one of it's 3 possible position so it's up to you to do your best to find them. At the end of the game a completion time is given.</p>\n\n<p>You can also enjoy three mini-games. Minigolfing, a concert and secrets finding. </p>\n<ul><li><strong>The minigolfing</strong> is 5 tiny courses where you can move the balls by shooting pumpkins at them or walking on it. It's a bit rough-edged and there's no score. But you might get confettis!</li><li>In <strong>the concert</strong> you take controls of each 5 of the Gentlebones, there's 5 keys, each one playing notes. Play the music you deserve but not the music you like...</li><li>Secrets finding is simple. There's <strong>5 small sprites hidden</strong> in Gentletown, shoot them!</li></ul>\n\n<p><strong>You might want to play with audio</strong> and it's even better with headsets, as some audio in the game gives clues on how to find the skeletons. It's not a necessity though, it's harder but deaf friends can still enjoy the game with no audio :)</p>\n<p>There are no options in the game, no resolution support or controls remapping, I'm sorry. For audio, keep in mind that the song in the title screen is the loudest thing in the game, so please do configure your computer audio around that.</p>\n<p>The game is available in <strong>English </strong>and <strong>French</strong>.</p>\r\nGame Jam\r\n<p>This game is the product of an unofficial game jam with friends on a French forum \"Guerre des Consoles\". So please keep in mind that <strong>this was entirely made in 22 days</strong>.</p>\n<p>The theme of the jam was \"<strong>Halloween et les spooky skeletons</strong>\", a last minute finding because we had none, but it inspired me to do a ˢᵖᵒᵒᵏʸ but funny game with monsters and lot of orange/purple things.</p>\n\n<p>There was very little play-test and optimisation, so <strong>please send me a message if you find glitches or if the game runs poorly</strong> on your computer, I'll be glad to fix that post-jam!</p>\r\nControls\r\n<p>The game controls are all described in the game but here's a reminder :</p>\n<ul><li><strong>WASD</strong> keys to<strong> move</strong> (or <strong>ZQSD </strong>if you choose French)</li><li><strong>Left mouse</strong> click <strong>to throw</strong> a pumpkin</li><li><strong>Space</strong> to <strong>jump</strong></li><li><strong>Shift </strong>to <strong>run</strong></li><li><strong>F</strong> is a contextual key, generally <strong>to interact</strong> with a door or for menus</li><li><strong>Escape</strong> is meant to <strong>exit the game</strong>, press it twice to close the game</li></ul>\n<p>Gamepad is <strong>not </strong>recommended, it might work a bit but the game has not been coded to handle gamepads, sorry.</p>\n\r\nCredits\r\n<p>This project was made only by me, except for the two songs in the game:</p>\n<p>\"Spagetti Western\" by Spring Spring</p>\n<p>\"Mevalspook\" by Tozan</p>\n\r\nSpecial thanks\r\n<p><strong>Kenney</strong> for his amazing modeling tool, Asset Forge</p>\n<p><strong>Bruteforce</strong> for his beautiful Grass Shader</p>\r\nLast note\r\n<p><strong>Huge thanks to you</strong> for reading the description and playing the game! It's my first full fledged 3D game and had a ton of fun making it. If there is anything you wan't to ask or say to me, <strong>please do leave a comment :)</strong></p>", "metacritic": null, "released": "2021-10-30", "tba": false, "updated": "2021-11-01T07:49:57", "background_image": "https://media.rawg.io/media/screenshots/15a/15aa68ac2e449edcc9b4611d10fcb543.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 245, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Quentin Delvallet"], "genres": ["Shooter", "Adventure"], "publishers": [], "esrb_rating": null}