{"id": 688263, "slug": "adaptive-level-generation-chronogate", "name": "Adaptive Level Generation (ChronoGate)", "name_original": "Adaptive Level Generation (ChronoGate)", "description": "<p>Project: 'Chrono-Gate' is a thrilling first-person roguelike with time travel and shenanigains! Created using the practice-led methodology to identify core principles required for efficiently implementing adaptive level generation.</p>\n<p>Trailer: https://www.youtube.com/watch?v=5MUb7aKNktw</p>\n<p>Raw Gameplay: https://www.youtube.com/watch?v=H9VW2SJd2wY</p>\n\n<p><strong>Research Abstract</strong><br/></p>\n<p>Current research into adaptive level generation is significant; however, most research revolves around collecting player information rather than the application into specific use cases. Using the practice-led research methodology with Riel’s action research model, this research builds on the experience-driven procedural content generation framework, to identify three principles for converting information gathered through player experience models into adaptive level generation. These principles help to illuminate the best practices for level designers and programmers by offering a guide for practitioners attempting to implement adaptive level generation—steering them towards an efficient method that they can adapt for their own needs.</p>\n<p><strong>Controls while playing:</strong>\n</p>\n<ul><li>Movement: WASD keys to move forward, left, backwards, and right.\r\n  </li><li>Aiming/Viewing: Move the camera/viewing angle by moving the cursor across the screen.\r\n  </li><li>Shoot: Shoot/Fire using the left mouse button.\r\n  </li><li>Melee: Sword attack with the E key.<br/>\n</li><li>Jump: Jump using the space bar.\r\n  </li><li>Reload: Reload using the R key.\r\n  </li><li>Drop: Drop using the V key.\r\n  </li><li>Swap Weapon: Swap weapons by using the scroll wheel or using 1 for the primary and 2 for the secondary.\r\n  </li><li>Ability: Use characters unique ability with the Q key.\r\n  </li><li>Debug: Open the debug console using the forward slash key (/). Enter key to activate the command.\r\n  </li></ul>\n<p><strong>Useful console commands:</strong>\n</p>\n<ul><li>Help: Launch Help HTML. Opens HTML file contains all possible commands.\r\n  </li><li>Respawn: Skip to end screen by dealing 1000 damage to self.\r\n  </li><li>GenerateWeights: Regenerate Procedural Generation weights based on current Skills and Abilities. Then displays weights in the console. Useful for viewing the effects of level weights.\r\n  </li><li>ShowFPS: Displays the current FPS on screen.\r\n  </li><li>GetSkills: Prints the players current skills in the console.\r\n</li></ul>", "metacritic": null, "released": "2021-10-30", "tba": false, "updated": "2021-11-01T08:32:23", "background_image": "https://media.rawg.io/media/screenshots/ae5/ae5bce6cb2242865b544d4a79ea3222c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 160, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Benjamin Finlay"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}