{"id": 688357, "slug": "chance-of-rain", "name": "Chance of Rain", "name_original": "Chance of Rain", "description": "Chance of Rain\r\nA slightly interactive and slightly meditative pond simulation\r\nControls\r\n<ul><li>ARROW KEYS: control frog</li><li>Z: surface/submerge</li><li>X: tongue</li><li>ENTER: options</li></ul>\r\nGameplay\r\n<p>This simulation is meant to be watched more than played (though you may interact with it by suggesting actions for the frog). </p>\n<p>There are four types of creatures living in this rainy pond: a frog, fish, flies, and dragonflies. Enjoy watching them swim, fly, eat, die, and birth new generations. Flies birth larva into the water which swim towards the nearest rock, where they slowly mature and eventually sprout wings - becoming flies themselves. Well-fed fish will turn green and reproduce when near each other. Dragonflies swarm the lillypad to spawn new. Each parent passes genetic predispositions onto their offspring - which allows for behavior evolution over time. Creatures may die of old age or starvation. All the while, a happy frog swims about - ready to offer a guiding hand (or, rather, mouth) if one part of the ecosystem becomes unbalanced.</p>\n<p>Occasionally, you may see some event-triggered haikus or tips to help you further enjoy and understand the game. Statistics about your world will also slide by from time-to-time (and can be triggered manually from the options menu). If your ecosystem fails or you lose a creature type, just keep playing - there are heavy storms that roll in occasionally to replenish your stock.</p>\n<p>Every game has randomizations, so each experience will be unique.</p>\r\nDNA System \r\n<p> A <strong>DNA system</strong> has been implemented that allows parents to pass certain parameters onto their offspring. There is even a chance of slight genetic mutations for each parameter. Through this system, each species will actually evolve its behavior over time to be best-suited to its environment. </p>\n<ul><li>Dragonflies pass on these parameters to their offspring <ul><li>speed, initial lifespan, threshold for hunger, starvation resistance, tolerance for rain, and others </li></ul></li><li>Fish pass on these parameters to their offspring <ul><li>speed, initial lifespan, threshold for hunger, and starvation resistance </li></ul></li><li>Insects pass on these parameters to larva which become adult flies <ul><li>speed, initial lifespan, swarming location, tolerance for rain, and others</li></ul></li></ul>\r\nOptions\r\n<p>Press the ENTER key to adjust these options: </p>\n<ul><li>If the text scrolls too quickly or too slowly, you may <strong>adjust your reading speed</strong></li><li>If you are returning to the game, <strong>you may disable tips</strong> to enjoy only haikus and stats</li><li>If you want a more meditative experience, you may <strong>disable the text completely</strong></li><li>You may also manually <strong>prompt gameplay stats</strong> to scroll by. This will happen occasionally through normal gameplay, as well. </li></ul>\r\nCreature colors\r\n<ul><li>Green: well-fed and fertile - will birth a new generation when a partner is found</li><li>Red: starving - will alter its behavior to look for food more seriously</li><li>Grey/Brown: getting old - will likely die soon</li><li>Peach: just born!</li></ul>\r\nFinal thoughts\r\n<p>There is a ton of nuance and complexity to the system but my goal was to simplify the player's experience as much as possible. Furthermore, I wanted to expose as much of the game as possible to the player from within the game itself (hence the tips that scroll by). Creature lifespans can be as long 40+ minutes, so this game was definitely meant to be enjoyed in the background / as a virtual aquarium. Personally, I turn off all scrolling text and leave it on during the workday to observe the system over many hours. I hope you, too, find enjoyment in this experience :)</p>\r\nPico-8 BBS Link\r\n<ul><li>https://www.lexaloffle.com/bbs/?tid=45112</li></ul>", "metacritic": null, "released": "2021-10-29", "tba": false, "updated": "2021-11-01T08:58:11", "background_image": "https://media.rawg.io/media/screenshots/182/182718793b2e831da4a897f57dd2437c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 14, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["professir"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}