{"id": 68839, "slug": "empire-millennium-wars", "name": "Empire: Millennium Wars", "name_original": "Empire: Millennium Wars", "description": "Lead your corporate empire on Mars! Build up your base, train your units, and command them in action-packed battles. Prospect and mine the rare resource Millennium and ship as much as you can to the Mars Trade Federation. Observe your enemies' every move on the world map and intercept rival shipments or loot their bases and refineries.<br/><br/>It’s the new gold rush in space with Earth corporations flocking to Mars in a bid to secure the biggest share of the pie in the lucrative Millennium mining frenzy. With exclusive contracts and controlling interest of the Mars Trade Federation awarded to the most productive company, corporate warfare turns ruthlessly violent to sabotage and eliminate competition. <br/> <br/>Who will dominate the Millennium mining and ultimately control the Mars Trade Federation with their corporate empire? Compete with other corporations to dominate the mining industry on Mars. Use any means necessary to crush your rivals and ultimately rule the Mars Trade Federation! Do you have what it takes to dominate them all? <br/><br/>FEATURES<br/>* JOIN the war in space with millions of other players <br/>* BUILD your base and train your units<br/>* COMMAND your army in tactical fights to loot enemies bases<br/>* SCAN the surface for Millennium deposits<br/>* MINE the unique resource Millennium<br/>* INTERCEPT rival shipment and steal resources<br/>* ALLY with players all over the world and communicate in a real-time chat<br/>* RULE the Mars Trade Federation as CEO and get unique rewards<br/><br/>Lead your corporate empire in space and join the Millennium Wars now. Enjoy a non-stop 24/7 action-packed game, brought to you by the developers of the global strategy hit “Empire: Four Kingdoms”.<br/><br/>Facebook https://www.facebook.com/EmpireMillenniumWars<br/>Website https://www.empiremillenniumwars.com<br/><br/>Terms and Conditions: https://www.goodgamestudios.com/terms-of-service/<br/>Privacy Policy: https://www.goodgamestudios.com/terms_en/#privacy-mobile<br/>Imprint: https://www.goodgamestudios.com/terms_en/#imprint<br/><br/>This app is completely free to play. Additionally it offers optional in-app purchases. You may disable in-app purchasing using your device settings.<br/><br/>This game requires an internet connection.", "metacritic": null, "released": "2018-03-26", "tba": false, "updated": "2019-07-29T11:38:35", "background_image": "https://media.rawg.io/media/screenshots/24e/24ef40014122a65e38a0c96bcb404a73.jpg", "website": "https://www.empiremillenniumwars.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 254, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Goodgame Studios"], "genres": ["Action", "Strategy"], "publishers": ["Altigi"], "esrb_rating": "Everyone 10+"}