{"id": 688422, "slug": "ultimate-zombie-death-ball", "name": "Ultimate Zombie Death Ball", "name_original": "Ultimate Zombie Death Ball", "description": "Ultimate Zombie Death Ball is a 1v1 arena sports game set in a zombie apocalypse. The object of the game is to get a ball in your opponent’s net, while being chased by a hoard of hungry zombies. Also, the ball is electrified, and will stun you if you kick it. <br/><br/><br/>Luckily, the zombies can kick the ball for you. Do this by using your self as bait, or by throwing meat on the field for them to chase.<br/><br/><br/>After 3 minutes play is over, and the winner is whoever has more goals.<br/><br/>When the world falls apart it is the job of the survivors to build it back up again better than it was before. The old ways of justice were flawed and fraught with loopholes… well no longer. <br/><br/>Introducing <strong>Ultimate Zombie Death Ball</strong><br/><br/>a pure justice system for our post-apocalyptic times. All crimes will be treated as equal and will result in a trip to the Zombie Dome.  We are all equal in the ravenous eyes of Zombie Lady Justice. Only the strongest, fastest and most innocent will survive. Come out and watch the spectacle of our modern justice system, see as the guilty are devoured and the innocent earn their freedom.<br/><br/>Features:<br/>1v1 local PvP gameplay <br/>Randomly generated character name and humorous crimes<br/>Short but intense matches<br/>lots and lots of zombies<br/>Randomly generated characters featuring multiple body types, skin tones and tattoos<br/><br/><br/>For best experience 2 controllers are strongly recommended!<br/>", "metacritic": null, "released": "2021-10-29", "tba": false, "updated": "2022-07-29T06:14:31", "background_image": "https://media.rawg.io/media/screenshots/ae8/ae897235d96c16e67cb8f05fda6f4386.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 296, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Devil's Cider Games"], "genres": ["Sports"], "publishers": ["Devil's Cider Games"], "esrb_rating": null}