{"id": 68859, "slug": "magic-fairy-cake-diy-cooking", "name": "Magic Fairy Cake! DIY Cooking", "name_original": "Magic Fairy Cake! DIY Cooking", "description": "Welcome to the magic world of cakes and bake the best and eye catching doll cakes straight out of a fairy tale. Be the magic chef of this doll cooking game and have a blast making your favorite fictional dolls with ice cream and edible cake sponge. Freeze your ice cream and shape it into a stunning doll shape using a traditional doll cake pan. Use this as a base and crown it with an array of frozen cake toppers in all colors of the rainbow to create gorgeous edible dolls that taste as great as they look.<br/>Shape your choice of fondant into popular movie characters and favorite sparkly princesses. Top your ice cream scoop with the favorite character of your dreams and place it on top of your favorite cake. You can change the hair styles and makeover the dolls in the way you like using your favorite eye colors, hair styles and dresses. Then add the magic fairy feathers in rainbow and unicorn colors that glow in the dark to create an out of the world experience. Bake moist, ooey-gooey cakes that melt in your mouth, sending a tingly sensation all the way to your toes.<br/>This dessert is so fantastic that you will love making it all day long using step by step, real life applicable cooking procedure. You can display your menagerie of magic fairy cake princesses in your doll cake shop, and have everyone dying to sample your creations. Teach kids DIY steps learnt through this game to become a culinary star. Show the creative genius chef in you to one and all!<br/><br/>You Can Make oddly satisfying cakes like:<br/>Glow in the Dark Doll Cake<br/>Magic Fairy Rainbow Ice cream doll Cake<br/>Gold and Black Glitter Ice cream Cakes<br/>Tinker &amp; Frozen Blue Doll Cakes<br/>Princess Unicorn Doll Cake <br/>Galaxy princess Cake <br/>And so much more from the list of your favorite super heroes.<br/><br/>This is the best and most satisfying doll cake challenge game that will give you chills and you won’t be able to resist making and decorating the cakes step by step all day long. Learn how to make doll cake at home and unleash the master dessert chef in you and show your doll cake cooking &amp; baking skills to everyone with this sweetest cooking &amp; edible doll dress up and makeover game for girls and boys.", "metacritic": null, "released": "2018-07-27", "tba": false, "updated": "2019-10-22T14:36:09", "background_image": "https://media.rawg.io/media/screenshots/d3e/d3e3fa707b60fd119037dfe8ba3c91be.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 95, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sarah Shahzad"], "genres": ["RPG", "Family"], "publishers": ["Sarah Shahzad"], "esrb_rating": null}