{"id": 688646, "slug": "shut-in-demo", "name": "SHUT IN - [Demo]", "name_original": "SHUT IN - [Demo]", "description": "Fight yourself. Die Trying.\r\n== This is the free demo version of SHUT IN.<br/>Download the full version HERE. ==\r\n\n\n<p><strong>SHUT IN is a dark comedy/psychological horror adventure game which explores depression and isolation by trapping you inside your own house.</strong>\n</p>\n<p>Your task is simple: Get out of bed, go outside, and get some Fresh Air. Think you can handle that?\r\n</p>\n<p>Oh, but it might not be quite that simple. Your house isn't looking quite like it used to. You don't recognise any of these photos, everything's gotten dirty and disgusting, cracks seem to be opening up everywhere, and you're SURE everything didn't used to be so... constantly trying to kill you. </p><p>Maybe it's not worth it. Maybe go back to bed. Try again tomorrow. </p><p>If you do decide to keep going, you'll have to face strange puzzles, bizarre and uncomfortable obstacles, and a narrator who is unreliable at best, and downright insulting at worst. You'll have to get through your day under a constant barrage of judgment, sarcasm, and melancholy. If you can cope with that. Idiot. </p><p><strong>SHUT IN</strong> is about tension and discomfort in a familiar environment. Your greatest tools are also your worst enemies. Common sense will keep you alive, but it might not get you very far. Curiosity can have great rewards, but will probably just get you killed.</p><p>But don't worry. When you (inevitably) die - because you fell down the stairs, were too stupid to operate an oven properly, got ripped apart by untold invisible horror, something like that - you can always just give up. Try again tomorrow. Or the next day. Or the next day.\r\n</p>\r\nHere's what people have been saying about the game:\r\n<p><em>“Tackles the subject of mental health in a really clever way... whilst striking the perfect balance with its dark comedy.”\r\n9.2/10 – Full Sync </em></p><p><em>“With depth far beyond the initial on-the-surface horror story, this experience taps into the evocativeness of a mental health crisis.”\r\n9/10 – Cubed3\r\n</em>\n</p>\n<p><em>\"It's funny. It's darkly funny. It's cruelly funny.\"</em> Buried Treasure\r\n</p>\n<p><em>“Exploring themes of mental illness has certainly been done in games before, but SHUT IN does it exceptionally well.”</em>\n<strong>4/5 </strong>– Adventure Gamers\r\n</p>\n<p><em>“I’ve never felt more unintentionally *seen* by a video game before.”  HeyPoorPlayer </em>\n</p>\r\nKey Features:\r\n<ul><li>Over a dozen unique ways to die!\r\n</li><li>Probably a way to survive!\r\n</li><li>Original atmospheric horror soundtrack by composer Luc Wilkinson.\r\n</li><li>Everything else done by person/mess Cael O'Sullivan.\r\n</li><li>A dangerous house full of original puzzles, and loads of ways to get them wrong!\r\n</li><li>A hint system which isn't that helpful, and often insults you!\r\n</li><li>Multiple items to experiment with, each with tons of unique interactions that solve no puzzles and achieve nothing.\r\n</li><li>Option to just stay in bed forever!\r\n</li><li>Quite short, so it's over quicker!\r\n</li><li>Writing up these features is exhausting...\r\n</li><li>Try again tomorrow.\r\n</li></ul>", "metacritic": null, "released": "2021-10-29", "tba": false, "updated": "2021-11-01T10:15:39", "background_image": "https://media.rawg.io/media/screenshots/5cd/5cdcb998688da1558e8d185dd3cdafe5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 131, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["HiddenTrack"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}