{"id": 688768, "slug": "the-lost-king-of-avallon", "name": "The Lost King of Avallon", "name_original": "The Lost King of Avallon", "description": "The Lost King of Avallon is a challenging turn-based rogue-lite RPG set in a medieval setting. The open world will allow you to do what you want and even be who you want: knight, paladin, hunter, thief, mage, elemental, demon, angel ...<br/><br/>You have to assemble a team of heroes, where each of them has its own advantages and disadvantages, as well as find a clue to the strange story that happened to the missing king of Avallon.<br/><br/><ul><li>12 playable classes: paladin, knight, cleric, hunter, thief, mage, shaman, cultist, dark knight, elemental, demon, angel.*<br/></li><li>7 unique perks for each class.<br/></li><li>Team RPG - gather a team of 4 brave adventurers.<br/></li><li>Open world. Move wherever you want, an 8,000 square mile procedurally generated island at your fingertips.<br/></li><li>Make alliances with lords or go to war with them. After all, 4 heroes can defeat an entire army, right?<br/></li><li>Unique turn-based combat system.<br/></li><li>50+ different monsters.<br/></li><li>Magic, illusion and the simple power of persuasion will allow you to avoid conflict if you don't want to.<br/></li><li>4 fundamentally different endings of the main plot, as well as 20+ options for the development of the story.<br/></li><li>Replayability - your story never repeats itself.<br/></li><li>You can rob caravans!</li></ul><br/>Act, Avallon has long been waiting for its hero, who will restore peace and order ... or maybe plunge the country into chaos and devastation. You decide!<br/><br/>* At the start of the game, only three classes will be available to you: knight, paladin and hunter. The rest of the classes will become available after completing the game quests, and then, when your hero dies (and they will certainly die someday), you can continue playing with a character of another class.", "metacritic": null, "released": "2021-11-02", "tba": false, "updated": "2021-11-05T03:02:26", "background_image": "https://media.rawg.io/media/screenshots/df0/df0476b36f316efaf18f053aea3267f9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 447, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "Linux", "PC"], "developers": ["Freeline Games"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Freeline Games"], "esrb_rating": null}