{"id": 688791, "slug": "escherion", "name": "Escherion", "name_original": "Escherion", "description": "At the Dawn of Human Civilization the Ancient Titans constructed a inescapable multi dimensional prison known as the Tartarus.<br/>\n<br/>\r\nA endless dungeon of torment and suffering where souls are judged after death and where the wicked received divine punishment.<br/>\n<br/>\r\nLocated deep beneath the Underworld within the Eternal Abyss.<br/>\n<br/>\r\nInhabited by Primordial Demons, Spirits, Entities and imprisoned Titans. <br/>\n<br/>\r\nYour goal as an Envoy is to explore, conquer, find allies and uncover its secrets. <br/>\n<br/>\r\nRe-engineering the technology found throughout the labyrinth and slowly learning how to navigate the portal system once used by the Titans to travel the multiverse.<br/>\n<br/>\r\nAlong the way you will encounter a vast variety of obstacles; traps, puzzles and challenges. That will test the limits of your abilities.<br/>\n<br/>\r\nWhere you will be awarded with an array of equipment, weapons, spells and abilities. That the Envoy can switch between at will.<br/>\n<br/>\r\nThe possibilities are limitless, however time is of the essence.<br/>\n<br/>\r\nFor the Tartarus gets progressively more difficult the longer you remain within it.<br/>\n<br/>\r\nThe Escherion Research Collective is not responsible for anyone that may become imprisoned.<br/>\n<br/>\r\nAs we merely provide the interface in which you may project your consciousness into this ethereal realm using the Echelon system.<br/>\n<br/>\r\nWhich restarts, manipulates and stores all the information found throughout the Tartarus. <br/>\n<br/>\r\nImproving our ability to process, navigate and organize the chaos, which allows us to constantly upgrade our systems. <br/>\n<br/>\r\nWe're searching for anyone willing to join us on our explorations into the Eternal Abyss.<br/>\n<br/>\r\nInterested in rediscovering the lost secrets of the Ancients and searching for a way into the Multiverse.", "metacritic": null, "released": "2021-11-01", "tba": false, "updated": "2021-11-05T03:17:07", "background_image": "https://media.rawg.io/media/screenshots/6b1/6b120482d5ca01383441270863fd5354.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 231, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Escherion Studios"], "genres": ["Action", "RPG"], "publishers": ["Escherion Collective"], "esrb_rating": null}