{"id": 688782, "slug": "sky-tale", "name": "Sky Tale", "name_original": "Sky Tale", "description": "Sky Tale is a cute city building game about creating lovely islands using various tiles and buildings. Sky Tale provides you challenging and yet relaxing experience. You can try to set new highscore by carefully planning all your moves and building up strong economy or you can simply explore colorful biomes and build settlements, villages or even towns.<br/><br/><br/><br/>Choose from a multitude of tiles and resources including trees, berries, rocks and plenty of others to create island of your dreams. <br/><br/><br/><br/>Are you a perfectionist and like straight rows of buildings? Or do you like chaotic placement? In Sky Tale you can do both. Place various building, group them by their functions and watch how your tiny settlement becomes a vast city.<br/><br/><br/><br/>Explore different buildings functions and synergies. Plan everything well and be rewarded with points. As you gain points you get new cards into the deck, unlock new tiles, buildings and biomes. Try to get as many points as you can but don't forget to enjoy the process.<br/><br/><br/><br/>Regrow resources, convert rocks to minerals, create biomes and more with a single mouse click. Experience new mechanics and use them to your advantage.<br/><br/><br/><br/>4 eye-catching biomes await you: Field, Desert, Mountains and Arctic. Each of them brings new set of resources, buildings and tiles to fill your island with life.<br/><br/><br/><br/>Discover plenty of cards to add to your deck. Choose cards that work together, get more points, refill your deck and create unique settlement each time you play.<h3>Want to know more about gameplay?</h3>Sky Tale features two game modes: Classic mode and Sandbox. <br/><br/><br/>In Classic mode you start with one of ever-changing islands and a stack of cards. Use tiles to expand your island and buildings to get points. The amount of points depends on building and its functions. Gather enough points to refil your deck. If your deck run out of cards the game end. This is where you can take a screenshot of your epic island and start one more round.<br/><br/>In Sandbox mode everything is under your control. Use all in-game cards to build lovely islands and enjoy a relaxing atmosphere.", "metacritic": null, "released": "2021-10-31", "tba": false, "updated": "2021-11-05T03:11:30", "background_image": "https://media.rawg.io/media/screenshots/512/512e7adae892846dd9538c962404cce2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 23, "ratings_count": 0, "suggestions_count": 211, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["FrostPeek Studio"], "genres": ["Strategy", "Casual"], "publishers": ["FrostPeek Studio"], "esrb_rating": null}