{"id": 688841, "slug": "food-decisions", "name": "Food Decisions", "name_original": "Food Decisions", "description": "How can you eat healthier? Explore food in a lab and choose healthier in a restaurant, a supermarket &amp; your kitchen. Battle with your friends in mini games like Food Olympics and play Health Chess.<br/>\n<br/>\r\nFOOD DECISIONS is a learning platform for teachers and nutritionists to add playful exercises to their courses.<br/>\n<br/>\r\nLESSONS explain basic concepts like reducing added sugar or consuming more fiber.<br/>\n<br/>\r\nEXERCISES practice the lesson content in simulated real-life situations like a restaurant, a supermarket or a kitchen.<br/>\n<br/>\r\nMINI GAMES reinforce the learning, adding playful and competitive elements.<br/>\n<br/>\r\nOPEN WORLD allows the players to (virtually) eat where they want and what they like for a whole day - with detailed health feedback at the end of the day.<br/>\n<br/>\r\nLEARNING BUTTON provides in-game knowledge boosts, for example providing a ranking of all choices from the previous round.<br/>\n<br/>\r\nINSTRUCTOR MODE enables teachers and nutiritionists to play customized games with their group, freely selecting the places and challenges.<br/>\n<br/>\r\nTROPHIES track the learning progress by player. Players choose the sequence of the levels they play.<br/>\n<br/>\r\nLEARNING STATUS collects the player's performance across games by topic. This helps to focus learning activities.<br/>\n<br/>\r\nLEARNING LINKS provide further content related to each game, including TED talks and scientific articles.<br/>\r\nSETTINGS allow a customization of food labels.<br/>\n<br/>\r\nVIEWS allow to change the camera position (1st and 3rd person) and the player's avatar.", "metacritic": null, "released": "2021-11-02", "tba": false, "updated": "2021-11-05T03:52:38", "background_image": "https://media.rawg.io/media/screenshots/21a/21af96a6f22feff212d85acab8504fcc.jpg", "website": "https://www.fit-talent.com/food-decisions", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 291, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BP"], "genres": ["Simulation"], "publishers": ["FIT Talent Games"], "esrb_rating": null}