{"id": 688801, "slug": "mages-defense", "name": "Mages Defense", "name_original": "Mages Defense", "description": "A Mage has the strategy to defeat the hostiles, the wisdom to lead the armies, and the courage to intimidate their enemies. A mage sees what nobody can see, he foresees all the futures possibles. A mage fights in the dark of the night, in the wind of the storm, in the cold of the winter. A mage is where he needs it!<br/><br/>Mages defense is a third-person strategic adventure game set in a fantasy world with tower defense elements whose main goal is to defend the crystal from waves of enemies by setting deadly traps in their path and using the power of the mages to stop them. defend more than 30 kingdoms from these creatures like evil mages, dragons, orcs, witches, ghosts, wizards, trolls, pirates, skeletons, zombies, vampires, and much more. All of them aiming to destroy everyone and conquer the world<br/><br/><br/><br/>Unlock different traps to help you in your journey and use them to defeat the waves of enemies. The more enemies you kill, the more summoning power you'll have to buy traps! Traps are a need to prevent enemies from reaching the crystal.<br/><br/><br/><br/><br/><br/><br/>Buying time and stopping enemies are priorities in this game. Before starting the waves, the player can see what kind of enemies are going to come and select the best traps for the battle. Many different traps allow different setups. Some of the traps can let the enemy slow or stop the enemy entirely. Other traps are going to explode them!  Burn, shoot, freeze, explode, bite, slow them down, poison them! Use all your resources wisely... <br/><br/><br/><br/><br/><br/>The Mages Are Your Best Allies in this adventure. You can summon them to help you defeat the waves. They are going to attack, distract the enemy and take damage for you while you worry about other enemies.<br/><br/><br/><br/><br/><br/><br/>You must defend the crystal at all cost. The crystals are the casters of the holy shields. The Holy Shields are around all the villages and protect the people from evil creatures. For a long time, the evil couldn't enter.<br/><br/>But now, the enemies found out how to open portals inside of the Holy Shields. For our lucky, they can send just a few warriors per time, that's our advantage!!!<br/>They will try to break the crystal. If they manage that, the holy Shield will be destroyed and the evil army will invade the villages.<br/><br/><h3>Main Features</h3>30 Villages to defend - islands of great kings, forests of the powerful mages, and kingdoms to defend. All in need of a mage to protect them.<br/><br/>More than 50 kinds of enemies - Mages, Dragons, orcs, witches, ghosts, wizards, trolls, pirates, skeletons, zombies, vampires.<br/><br/>Buy traps - Unlock different traps to help you in your journey.<br/><br/>18 Deadly traps - Build traps making the enemies slow or freeze them to get you time. Explode them without mercy!!!<br/><br/>The Mages - Summon the mages to help you defend the cristal and distract the enemies. choose between 3 mages what's the best of them to control", "metacritic": null, "released": null, "tba": false, "updated": "2021-11-05T03:24:11", "background_image": "https://media.rawg.io/media/screenshots/7b8/7b833a62684d6ac1defcf6c0ed686fd4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 460, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Happy Eagle Games"], "genres": ["Action", "Adventure", "Strategy", "Indie"], "publishers": ["Happy Eagle Games"], "esrb_rating": null}