{"id": 688807, "slug": "parkour-tag", "name": "Parkour Tag", "name_original": "Parkour Tag", "description": "Parkour Tag is an online, platforming, PvP game that faces two-players off in a competitive game of tag. Run vertically or horizontally on any wall, jump, double jump, slide, vault and more to outmaneuver your opponent and claim victory!<h3>Online Competition</h3><br/>Enter the online arena and prove your platforming abilities. Here, you will face off against your opponent in the most extreme parkour tag battle of your life. <br/><br/><br/><br/><ul><li>Each round one player will act as the <strong>tagger</strong>, and the other player will act as the <strong>runner</strong>. <br/></li><li>If you are the <strong>tagger</strong>, catch your opponent before the time runs out to score a point.<br/></li><li>If you are the <strong>runner</strong>, evade the tagger until time runs out to score a point. <br/></li><li>The first person to reach the score cap with a two point lead will win the game. <br/></li><li>Players can host private matches, or queue for random matchmaking.<br/></li><li>Earn XP and level up by winning matches.</li></ul><h3>Movement </h3><br/>Movement mechanics are the heart and soul of Parkour Tag. Run vertically or horizontally on any wall, sprint, jump, double jump, slide, vault and climb your way around the arena. Combine different move sets to reach difficult places on each map and create complex routes to outmaneuver your opponent.  <br/><br/><h3>Time Trials</h3><br/>For the gamers who like to speed run, race against the clock in the time trials to try to get the fastest time possible. Courses of varying difficulty aim to challenge your parkour abilities and sharpen your platforming skillset. Optimize your routes to achieve better times and earn titles to display online.<h3>Customization </h3><br/>Create a custom face to showoff your style and level up to earn new emotes, avatars, or titles. If you enjoy achievement hunting, complete challenges to earn unique titles and showcase your abilities.", "metacritic": null, "released": "2021-11-01", "tba": false, "updated": "2021-11-05T03:28:41", "background_image": "https://media.rawg.io/media/screenshots/956/9565986ccd82e083bd294bcebac115c6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "dropped": 1}, "playtime": 3, "achievements_count": 21, "ratings_count": 0, "suggestions_count": 189, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Loopnova Studio"], "genres": ["Action", "Sports", "Indie"], "publishers": ["Loopnova Studio"], "esrb_rating": null}