{"id": 688811, "slug": "super-snow-tubes", "name": "Super Snow Tubes", "name_original": "Super Snow Tubes", "description": "<strong>\"Super Snow Tubes\" is a satisfyingly cute, retro-inspired snow racer for the whole family.</strong><br/><br/>Starring a cast of quirky and adorable animal buddies, the fun and fierce battle for first place takes you from snowy mountains and arctic ice shelves to candy kingdoms and even to the moon (which, as it turns out, is indeed made of cheese)!<h3>Features</h3><br/><ul><li> Play a Polar Bear, Penguin, Seal and more quirky and adorable animal buddies<br/></li><li> Ride fat and fun, colorful snow tubes with different steering behaviours<br/></li><li> Race tons of courses through the seasons and all around the world<br/></li><li> An homage to the winter sports classics of the early to late 90s</li></ul><h3>Inspiration</h3><br/>If you loved playing the classic winter sports games of the DOS era (such as Ski or Die and SkiFree), or you have fond memories of the fun racers of the Nintendo 64 era (such as Snowboard Kids 1 + 2, Diddy Kong Racing, and the Mario Kart franchise), then Super Snow Tubes definitely is a title you do not want to miss!<br/><br/><ul><li> Some say it's: \"Ski or Die meets Snowboard Kids\"<br/></li><li> Others call it: \"Top-down Mario Kart in the snow\"</li></ul><h3>Wishlist NOW</h3><br/><strong>Don't forget to add \"Super Snow Tubes\" to your Steam Wishlist!</strong> It ensures you'll get notified when the game comes out.<br/><br/>It's the big, green button - just below the screenshots (or, the smaller blue one :)", "metacritic": null, "released": null, "tba": false, "updated": "2021-11-05T03:31:02", "background_image": "https://media.rawg.io/media/screenshots/555/555382b5681d64c1913287e098d88d52.jpg", "website": "http://GameDevMix.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 181, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["GameDevMix"], "genres": ["Action", "Adventure", "Sports", "Racing", "Casual", "Indie"], "publishers": ["GameDevMix"], "esrb_rating": null}