{"id": 688819, "slug": "1f-y0ure-a-gh0st-ca11-me-here-you-ling-re-xian", "name": "1f y0u're a gh0st ca11 me here! 幽铃热线", "name_original": "1f y0u're a gh0st ca11 me here! 幽铃热线", "description": "We will be updating this game frequently to make it even better<br/>\r\nIf you find a bug or have a suggestion, please post it in the reviews or in the community!<br/>\r\nWe'll look over everything and make the game even better!<br/>\n<br/>\r\nHello. This is Vanitas in charge of the Ghost Call Center!<br/>\n<br/>\r\n1f y0u're a gh0st ca11 me here! is an adventure where the player must instantly judge the content of multiple conversations that are displayed on the screen at the same time, and continue to make the right choices in order to connect combos!<br/>\n<br/>\r\nThis game is a novel game, but it is a new genre of game that can be called an action novel game.<br/>\r\nMore than three speech balloons appear on the screen at once, each with a simultaneous conversation. All of them are talking to the player!<br/>\r\nThe player has to understand the meaning of the conversations simultaneously on the screen and make the right choice for each one.<br/>\r\nIt's an experience like listening to several people talking at once, and doing so is like trying to connect a busy phone line to the right circuit.<br/>\n<br/>\r\nThe main character, Vanitas, is employed at a call center in the underworld and is tasked with guiding ghosts from the underworld to the underworld<br/>\r\nThe ghosts are facing various difficulties such as getting lost or being almost expelled, and they are all asking for help at once without caring about our situation<br/>\n<br/>\r\nYou need to instantly understand what these ghosts are saying and connect them to the correct number<br/>\r\nThe prejudice against communication technology, the lack of human resources, the confusion of a new life with the evolution of technology...<br/>\r\nOvercome many things and become a first-class call master!", "metacritic": null, "released": "2021-11-01", "tba": false, "updated": "2021-11-05T03:36:47", "background_image": "https://media.rawg.io/media/screenshots/807/80740f398a10ffd1f8eb8feea1ee64da.jpg", "website": "https://furoshikilab.wixsite.com/furoshikilab/1f-y0u-re-a-gh0st-ca11-me-here", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 32, "ratings_count": 0, "suggestions_count": 224, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Furoshiki Laboratory", "フロシキラボ"], "genres": ["Action", "Adventure"], "publishers": ["WhisperGames"], "esrb_rating": null}