{"id": 688900, "slug": "milfs-of-sunville", "name": "MILFs of Sunville", "name_original": "MILFs of Sunville", "description": "<p>A young guy is forced to leave his luxurious life in a big city behind and return to a small town of Sunville, located near the ocean shore.<br />\nHe dreams of going back and is mad at his father who ditched him for a young wife and left him without any financial support.<br />\nHe must find a way and acquire the means to make his plan come true, but will he be able to do it?<br />\nA lot of temptations await him on his way.The college he’s going to attend is full of sexy girls and teachers.<br />\nHe needs to make a choice: follow his original goal or dive into a seductive world of love affairs. But nothing is ever easy — some relationships will demand changes from him.<br />\nHe comes into town as a simple guy, will he be able to change? And what direction will those changes take? Will he become better or worse? There are a lot of different ways of achieving his goals.<br />\nYou’re going to assume the role of that young man in a visual novel with excellent animations and quality graphics.<br />\nThe game also has a slew of cool features. For example, you can take hidden photos with your phone’s camera.<br />\nExplore the world of MILFs of Sunville!<br />\nDive deep into realistic relationships with people around you!Early AccessThis game is in Early Access.<br />\nRegular free updates will be provided to anyone who has already purchased the game.</p>", "metacritic": null, "released": "2021-11-04", "tba": false, "updated": "2024-01-31T18:05:34", "background_image": "https://media.rawg.io/media/screenshots/f60/f6048dd6718bcfeb4033ac3e40ae19e5.jpg", "website": "https://l7-team.com/", "rating": 4.0, "rating_top": 4, "added_by_status": {"yet": 7, "owned": 47, "beaten": 4, "toplay": 16, "dropped": 3, "playing": 2}, "playtime": 2, "achievements_count": 73, "ratings_count": 11, "suggestions_count": 412, "game_series_count": 0, "reviews_count": 11, "platforms": ["PC", "macOS"], "developers": ["L7team"], "genres": ["RPG", "Indie"], "publishers": ["L7team"], "esrb_rating": "Adults Only"}