{"id": 688982, "slug": "hero-shooter", "name": "Hero Shooter", "name_original": "Hero Shooter", "description": "Game background:<br/>In 2043 AD, the last world war of mankind broke out, and the horrible Z virus was thrown into the war. Subsequently, the Z virus was spread worldwide, and more than 99% of humans died of the plague, but this is only the beginning. The dead have climbed up again. They are no longer humans, they have become zombies that devour living people. Some fierce beasts infected with the virus have become the invincible overlords, ruling this dark world. Where should survivors go, as a hero zombie hunter, can you save humanity?<br/><br/>Game introduction:<br/>This is a 3D hero shooting game (RPG), where the player plays a hero shooter to clear the zombies in the city, divided into multiple levels and regions to gradually deepen. The operation of the game is simple but has a certain skill, which requires the player to operate the position and use the skills reasonably. Players need to upgrade guns, pets, heroes, cultivate attributes, and improve their combat power in the game, thus defeating various bosses in the zombie world. There are 5 hero skills in the game, each unlocking a hero will unlock a skill. Using different skills for different monsters requires players to study.<br/><br/>BGM: Darkling Skies , License: CC by 4.0 , by indie musician Jelsonic.   <br/> <br/>Have a good time!", "metacritic": null, "released": "2020-12-01", "tba": false, "updated": "2021-11-05T05:33:44", "background_image": "https://media.rawg.io/media/screenshots/a70/a708cc6e8651b66a5705bf71de678699.jpg", "website": "https://im-crazy.github.io/index.html", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 256, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["剑 崔"], "genres": ["Action", "RPG"], "publishers": ["剑 崔"], "esrb_rating": "Teen"}