{"id": 688946, "slug": "hearts-online-card-games", "name": "Hearts Online: Card Games", "name_original": "Hearts Online: Card Games", "description": "Do you love card games? Want to play the best of all card games - Solitaire games or Classic Hearts Games? Start playing this amazing card game of Hearts Online where you can play online multiplayer card game leagues with other players online.<br/><br/><br/>Hearts Online: Multiplayer Solitaire Card Games is one of the best online multiplayer card games with 7 different game leagues and leaderboards features. You can play and compete with other players online on this Hearts game. If you like playing solitaire games or classic hearts games, you will love playing the Hearts Online game. Enjoy this hearts game with live players worldwide. You can play the game with coins and the game also has different ways to earn coins.<br/><br/>Game Modes<br/><br/>You can start playing Hearts Online Game in either of the below game modes:<br/> Quick Mode with a Single Round<br/><br/> Standard Mode to 100 Points<br/><br/>In the Standard Mode the game can be with many rounds until one of the Players makes 100 Points. In the Quick Mode you will play only 1 Round. The Winner is whoever has less points than the other Players.<br/><br/><br/>You will never get bored while playing this online hearts multiplayer card game.<br/><br/>Game Leagues<br/>Hearts Online allows you to play the game with different game leagues:<br/>Golden<br/>Platinum<br/><br/>Diamond<br/>Millionaire<br/>Billionaire<br/><br/>Master<br/>Grand Master<br/><br/>Each of these leagues allows you to place different bets. Keep playing and get on top of the leaderboard.<br/><br/>Win Free Coins<br/>You can win free coins on the hearts online game. Here’s how:<br/>Get Daily Free Coin Bonuses<br/>Watch Video Ads &amp; Win Free Coins<br/>Spin the Wheel to Win Coins<br/>Play Amazing Slots Game<br/><br/>Game Features<br/>Hearts Online: Multiplayer Solitaire Card Games is packed with amazing features to help you have a seamless game experience. Here’s a summary of the features:<br/>Standard Game to 100 Points and Quick Game just 1 Round<br/>7 Different Online Game Leagues: Golden, Platinum, Diamond, Millionaire, Billionaire, Master and Grand Master.<br/>Leaderboards - Keep Winning to Become the King of Hearts!<br/>Login with Facebook and share your success with your friends.<br/>Get your best Game Avatar from a wide range of selections<br/>Play the Game with different tables<br/>Classic Slots Machine Games to Win Coins<br/>Spin the Wheel - You can win Millions of Coins!<br/>Enjoy this Hearts Online Multiplayer game with live players worldwide!<br/><br/>Download Hearts Online Game and Start organizing decks, discovering new ways to have fun, play your way with different card games - the best of all Hearts Card Games or Solitaire Card Games.<br/><br/><br/>Hearts Online: Multiplayer Solitaire Card Games features flexible user setting options, table and deck designs to choose from, as well as intuitive statistics and scoreboard options to ensure that competitive gamers and casual players alike see exactly how they’re playing every game in this package with ease.<br/><br/><br/>Hearts Online is an addictively fun and enticing card game. You will love playing with other players worldwide.<br/><br/>Support Us<br/>Do you have any feedback to share? Please feel free to send us an email. If you like our game, please rate us on the play store and share it with your friends.<br/><br/>Grand Games LTD OOD is presenting this amazing new Hearts Online Multiplayer Game.", "metacritic": null, "released": "2021-10-27", "tba": false, "updated": "2021-11-05T05:16:07", "background_image": "https://media.rawg.io/media/screenshots/8f3/8f33536fd43c185e026510c2b7118667_Vi1wU0a.jpg", "website": "https://www.facebook.com/heartsonlinecardgames", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 235, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Grand Games"], "genres": ["Casual", "Card"], "publishers": ["GRAND GAMES LTD OOD"], "esrb_rating": "Mature"}