{"id": 688921, "slug": "simpleplanes-vr", "name": "SimplePlanes VR", "name_original": "SimplePlanes VR", "description": "Strap a VR headset on your face and fly fighter jets, bombers, helicopters, WW2 planes, civilian planes, race cars, monster trucks, tanks, and pretty much anything else you can think of. There are over half a million crafts available to download for free.<br/><br/>* Several crafts are included with fully immersive cockpits with virtual controls that you can reach out and grab with virtual hands.<br/>* Choose from hundreds of thousands of crafts to fly for free. Even if it does not have a fully immersive cockpit, you can still fly from the chase,  orbit, and fly-by camera modes.<br/>* If you'd rather use a gamepad, joystick, or HOTAS you can do that as well.<br/>* Engage enemy aircraft with air-to-air missiles, such as the Guardian which is a highly maneuverable short-range missile, or fire and forget with the long-range Interceptor missile.<br/>* Assault ground threats with an extensive arsenal of air-to-ground weapons and sink ships with torpedos.<br/>* Take off from an aircraft carrier with a launch catapult system and land on the carrier deck by snagging the arresting cable. Just make sure you pick an aircraft with a tailhook.<br/>* Multiple islands to explore such as Snowstone, the ice-covered island with a hidden base, and Maywar a desert island with a mysterious pyramid.<br/>* Race against AI opponents in several courses.<br/><br/>Note: SimplePlanes VR does <strong>not</strong> include a building mode. All crafts are built in the original SimplePlanes.<br/><br/>Bonus Note: If you already own SimplePlanes, then purchasing SimplePlanes VR will also unlock VR mode in your original SimplePlanes. This means you will be able to easily jump into VR at any time during flight so you can easily test your builds in VR.", "metacritic": null, "released": null, "tba": false, "updated": "2021-11-05T04:57:08", "background_image": "https://media.rawg.io/media/screenshots/c30/c30d7288c8ba1822aaaee818a9e89c0c.jpg", "website": "http://www.simpleplanes.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 7}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 244, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jundroo"], "genres": ["Simulation", "Indie"], "publishers": ["Jundroo"], "esrb_rating": null}