{"id": 688936, "slug": "klondike-solitaire-cards-game", "name": "Klondike Solitaire: Cards Game", "name_original": "Klondike Solitaire: Cards Game", "description": "Join the Klondike Solitaire fun, this Halloween all you solitaire players! You've reached the #1 relaxing, free Klondike Solitaire card game app! <br/>Treat yourself to this challenging virtual world of classic solitaire games - there's endless Klondike solitaire sessions you can enjoy when downloading our free Klondike Solitaire app! It's so comforting when you're able to play your favourite free card game online, anytime and anywhere, on your mobile phone or tablet. <br/><br/>Return and play Klondike Solitaire every day and you will not be tricked - you'll be rewarded with a unique Daily Solitaire Challenge to solve. Solve the Daily Challenge and receive a solitaire crown for each day, plus you get to train your brain and keep mind sharp by frequently exercising logic. In addition, you'll be delighted to see you can get more classic solitaire item prizes through the solitaire fruit machine. <br/>Don't wait another minute, download Klondike Solitaire app right now to play the best classic Solitaire card game online on Halloween!<br/><br/>Check out some of Solitaire Klondike Features to understand why you need this app on your mobile device:<br/>- Klondike Solitaire has beautiful graphics<br/>- It's all about pure, original Klondike gameplay and it's completely free<br/>- Fun Daily Challenges await when you play solitaire every day<br/>- Beginner classic solitaire players will surely appreciate the unlimited free Hints<br/>- Players benefit by Standard &amp; Vegas Solitaire Scoring<br/>- 1 Solitaire Card Draw / 3 Solitaire Cards Draw - you choose!<br/>- Personal Klondike Solitaire Records at your disposal<br/>- Custom Klondike Game Styles to enhance your game experience<br/>- Left Handed Solitaire Mode to meet all players' needs.<br/><br/>Choose wisely how to spend your breaks and spare time - a good old solitaire card game online - be it Klondike, Spider Solitaire or even Pyramid Solitaire -  is exactly what you need for both stress relief and brain training. Klondike Solitaire is both a \"train brain\" type of game, and a free card game of luck, exciting and fun.<br/><br/>Install Klondike Solitaire app today, play and solve challenges, enjoy all the customisation options and don't forget to rate &amp; review us - your feedback is highly appreciated at NewPub!<br/><br/><br/>Consult Klondike Solitaire Terms of use: http://loppipoppi.com/terms-of-use", "metacritic": null, "released": "2020-08-05", "tba": false, "updated": "2021-11-05T05:10:58", "background_image": "https://media.rawg.io/media/screenshots/075/0753721f9841ce2841ca2245e9c836d2_6NZoKhm.jpg", "website": "http://newpub.co", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 71, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["NewPubCo"], "genres": ["Board Games", "Card"], "publishers": ["NewPubCo"], "esrb_rating": "Everyone 10+"}