{"id": 688971, "slug": "space-shooter-star-squadron-vs", "name": "Space Shooter Star Squadron VS", "name_original": "Space Shooter Star Squadron VS", "description": "If you are a big fan of classic arcade shooting games like galaxia, galaxian and galactica, you will enjoy Space Shooter : Star Squadron . <br/><br/>FEATURES<br/>-  Featuring prize competitions provided by Skillz™<br/>-  Challenge people around the world with Skillz™, power fair, fun and meaningful competition in mobile games with leaderboards, trophies, real-world prizes, and an amazing loyalty program that rewards you for playing!<br/>- Perfect shmup, shoot ‘em up action: choose your fighter ship to beat your opponents! <br/>- Epic and huge bosses: show-off your skills. Enjoy the arcade bullet hell!<br/>- Stunning graphics, amazing lighting and special effects.<br/><br/>HOW TO PLAY<br/>- Slide to control your spaceship dodge enemy's bullets.<br/>- Use coins to upgrade or evolve your spaceship to fight with giant enemies and alien invaders.<br/>- Use appropriate spaceships and strategies for each level and boss.<br/>- Remember to use the BOOSTERS.<br/><br/>Commander!<br/>Our galaxy is under alien shooter attack! We need your help!  <br/>The space aliens invaders destroyed all squads of galactica! <br/><br/>The Star Squadron team is waiting for your command! <br/>Please command the ship to protect the galaxy planets and asteroids<br/><br/>The Galaxy's future is now in your hands. Get your ship ready for space attack in this arcade galaxy shooter game.", "metacritic": null, "released": "2021-08-09", "tba": false, "updated": "2021-11-05T05:28:36", "background_image": "https://media.rawg.io/media/screenshots/309/30973e5cfe7e5d8a1dd51be99e7aa320_hHRGnl0.jpg", "website": "http://www.solarismobile.co", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 194, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Solaris Mobile Tecnologia LTDA"], "genres": ["Action", "Sports"], "publishers": ["Solaris Mobile Tecnologia LTDA"], "esrb_rating": "Mature"}