{"id": 688909, "slug": "legend-of-krilona", "name": "Legend of Krilona", "name_original": "Legend of Krilona", "description": "Erlebe ein märchenhaftes Abenteuer, in der Welt von Roh' Klama, bei dem man gegen Monster kämpfen muss. Es gibt Schlösser zu erkunden und Quests zu erledigen. Begib dich, ohne Zeitdruck, in diese magische mittelalterliche Welt.<br/>\n<br/>\r\nDu steuerst vier verschiedene Helden, die unterschiedliche Fähigkeiten haben und gegen ihre Feinde einsetzten können. Bei einigen Attributen muss jedoch darauf geachtet werden, dass diese mit bedacht eingesetzt werden müssen. <br/>\n<br/>\r\nIn den Labyrinthen, welche es zu erkunden gilt, wirst du viele und starke Monster töten müssen um an dein Ziel zu kommen.<br/>\n<br/>\r\nDoch die Fähigkeiten des Schwertkämpfers, Kampfkünsterls, Magiers und Heilers werden dir in jeder Situation um Kampf helfen.<br/>\n<br/>\r\nKämpfe gegen eine Vielzahl von Monstern und Gegnern, sowie mehrere Bosse.<br/>\n<br/>\r\nAlle Gegner, denen du begegnest, haben unterschiedliche Stärken und Schwächen.<br/>\n<br/>\r\nRüste deine Helden in den verschiedenen Item Shops, mit den unterschiedlichsten Waffen, Rüstungen und Gegenständen aus. Lasse sie sich in den Inn's wieder erholen um neue Kraft gegen weiter Kämpfe zu sammeln. Dabei musst du jedoch einige der Händler und Schlafstätten erst finden, da manche von ihnen sehr versteckt sind.<br/>\n<br/>\r\nEinige Hinweise sind sehr versteckt und es muss vieles untersucht werden um diese zu finden und heraus zu finden, was sie bereit halten.", "metacritic": null, "released": "2021-11-30", "tba": false, "updated": "2021-11-05T04:44:44", "background_image": "https://media.rawg.io/media/screenshots/8ab/8ab735f225f16c5b2723b47569201dc5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 123, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Bauschan Gamez"], "genres": ["Adventure", "RPG", "Casual"], "publishers": ["Bauschan Gamez"], "esrb_rating": null}