{"id": 68900, "slug": "clash-of-queens-light-or-dark", "name": "Clash of Queens: Light or Dark", "name_original": "Clash of Queens: Light or Dark", "description": "Fight, chat, grow!<br/><br/>Choose your path; rule as a powerful QUEEN or fight as a brave KNIGHT to defend her honor! Raise a DRAGON to fight for your kingdom. Form close bonds with Queens and Knights from around the world!<br/><br/>FEATURES<br/>-- Raise a young dragon from birth and train him to fight for your army.<br/>-- The dragon hunting campaign pits your most powerful forces against deadly dragons.<br/>-- Queens and Knights play together on our global server and grow their kingdoms together.<br/>-- Recruit “citizens” to build and upgrade multiple buildings at once.<br/>-- Streamlined gameplay that makes for a smoother experience and faster growth.<br/>-- Mages join your forces, making your armies stronger than ever.<br/>-- The in-app translator allows you to meet new friends and form strong alliances in any language.<br/>-- Alliance members send resources, reinforcement troops, and building speed-ups.<br/>-- Large scale battles with multiple alliances on both sides.<br/>-- New events keep you on your toes and give you chances to win gold and other prizes.<br/><br/>GAMEPLAY<br/>Experience next generation mobile gaming in this brand new MMO world.; this fun new RTS war game pits your army against other Queens and Knights from all over the world in a battle to control the throne. Meet and chat with guys and girls from around the world while you grow your kingdom, in this tactical MMORPG game. Research new skills to increase the power of your defenses and your army. Station archers, infantrymen, cavalry, and powerful mages to guard your city from attack as you work to manage your resources, upgrade your castle, and plan your next attack against other Kings and Queens, dragons, and other monsters in medieval PVP and PVE combat! Do you have what it takes to crush your enemies in this real-time combat MMO game?", "metacritic": null, "released": "2016-06-06", "tba": false, "updated": "2019-07-29T12:38:34", "background_image": "https://media.rawg.io/media/screenshots/c23/c23d3924e166ed7ad7eb916d3043744a_7Fxttyc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 352, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Elex Wireless"], "genres": ["RPG", "Strategy"], "publishers": ["ELEX Technology Holdings Co"], "esrb_rating": "Everyone 10+"}