{"id": 689154, "slug": "jam18", "name": "jam18", "name_original": "jam18", "description": "<em>I think this—somewhat unintentionally—became a <strong>permanent</strong> single run experience. I may have playtested this on a browser without cookies; in any event, if you reopen it in a private window it should restart.</em>\n<em>otherwise, there are no play instructions.</em>\r\nall spoilers\r\n<p>jam18 is a 'nonlinear' interactive poem loosely inspired by 起承转合, in particular 绝句, or the 'chinese quatrain'. the story is always coherent and complete, but evolves as you develop your emotional response to the prompt.<br/></p>\n<p>the mechanics are informed by the PAD model. the overarching frame follows a three part structure:</p>\n<ul><li>introduction: arousal  (and disinterest)</li><li>change: dominance (and submission)</li><li>result: pleasure (and discontent)</li></ul>\n<p>and each subframe follows a similar structure, but with respect to valence:<br/></p>\n<ul><li>introduction: negative</li><li>change: positive</li><li>result: neutral</li></ul>\n<p>such that your decisions in each subframe determine the valence of each axis in the superframe; i.e. the experience is a commutative determination of a 9-state system: given a situation or event, the sentiment expressed in reply.<br/></p>\r\nmeta\r\n<p>this jam was done as a part of a small working group where we play a source game, analyze it, then respond by making another one (each member makes their own) . the prompt for this one was the following:<br/></p>\n<ul><li>interactive fiction</li><li>must be able to playtest in 5 mins or less</li><li>structure must be a tree</li><li>branching factor is fixed at 5 (no more, no less)</li><li>the structure of the work must fundamentally be informed by <em>moon  hunters</em> or expressible as a response to or criticism of <em>moon hunters</em></li></ul>\n<p>clearly I brushed off the 5 factor rule. I felt bad, but shifting from PAD to something more dubious and complicated just felt like a bad design choice.</p>\n<p>I don't remember how long this took to make, but from looking at my logs it would seem to be ~6hrs in one session. notable comments include \"I have a headache\" and \"I'm tired and it's 6 am, so let's do it\" and \"I'm concerned this is going to end up being rather abstract and inscrutable\".<br/></p>\r\nother notes\r\n<p>this mechanical model is somewhat generalizable, so I think it would be kind of neat to make an anthology. you can also recursively embed the 3x3 setup into other instances of itself.</p>\n<p>also inspired by some unpublished work on improvisation in game design:  the game you are making is never unplayable, the game you are playing is always complete.<br/></p>\n<p>re: moon hunters. you could say this was an attempt to streamline the idea of limited player agency under a fixed set of narrative beats—a 'personality quiz' of oneshots embedded inside a constrained dramatic structure. one of the things we found troublesome about the game was the drawn-out pacing and rote exploration, so I tried cutting that down (although this is as much a result of the time constraint as it is some kind of commentary).<br/></p>\n<p>motivated somewhat by the idea of making an explicitly 'creative' or 'sandbox' IF game.<br/></p>", "metacritic": null, "released": "2021-11-04", "tba": false, "updated": "2021-11-05T06:19:09", "background_image": "https://media.rawg.io/media/screenshots/da0/da0df57a036793040fdecb6ed9011f03.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 53, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["acgaudette"], "genres": [], "publishers": [], "esrb_rating": null}