{"id": 689287, "slug": "acab-prototype-no-longer-in-development", "name": "ACAB - Prototype (No longer in development)", "name_original": "ACAB - Prototype (No longer in development)", "description": "<p><strong>ACAB </strong>is no longer in active development. You can, however, still get your fascist-stomping groove on with Basta Ya, the game that ultimately emerged from this prototype.</p>\n<p>Stop singing and start swinging! Help Athena wrest back the streets from a battalion of riot cops and other thugs armed to the teeth and rabidly devoted to propping up the craven coterie of racists, sexists, capitalists, and crypto-fascists clinging to power in the dying days of the American empire.</p>\n<p>The ACAB prototype features Skirmish Mode, where our heroine squares  off against 25 riot cops. Beat them as quickly as you can- and then try to beat your best time! Careful though: take too long and the rooftop snipers will get you in their sights. Get your combo to 10 and you'll be rewarded with a devastating POWER SURGE. You can also power up by collecting gas and bottles for a MOLOTOV COCKTAIL.</p>\n<p>BTW: the in-game Donate button is for contributing to your local bail fund via an external link to Act Blue (with which Left Turn Workshop has no relationship). If you want to donate to help development please contribute here on Itch!</p>\r\nTech Requirements\r\n<p>Use of a CONTROLLER is STRONGLY RECOMMENDED! (The options settings in the main menu require a mouse: this will be addressed in the next iteration of the game, along with the addition of more tweakable settings.)</p>\n<p>Since the game is still at an early stage in the development cycle there remains a lot of optimization work to be done.  If you've got plenty of RAM and a current gen graphics card you hopefully shouldn't have too much trouble running the game at a playable frame rate. Optimizing for less powerful systems is one of our main priorities for the next stage of development.</p>", "metacritic": null, "released": "2021-11-04", "tba": false, "updated": "2021-11-05T06:50:13", "background_image": "https://media.rawg.io/media/screenshots/c22/c2264f6fc8bff78f8806f23c1e3c819f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 311, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Left Turn Workshop"], "genres": ["Action", "Fighting"], "publishers": [], "esrb_rating": null}