{"id": 689371, "slug": "aliens-bath-mania-lean-la-pagina-del-juego", "name": "Alien's Bath Mania (LEAN LA PAGINA DEL JUEGO)", "name_original": "Alien's Bath Mania (LEAN LA PAGINA DEL JUEGO)", "description": "<p><strong><br/>ATENCION!: POR ERROR HE SUBIDO LA VERSION QUE HICE AYER Y ESTA EXTREMADAMENTE BUGUEADA/INJUGABLE, PARA JUGAR LA VERSION BUENA, INGRESA A LA NUEVA PAGINA (https://angelhyype.itch.io/aliensbathmania) DEL JUEGO Y USA ESTA PARA RANKEARLO.<br/></strong><br/>Tu eres Alien, el cual tiene un trabajo de oficina.<br/>Este mes, Alien se ha esforzado mucho para conseguir el gran titulo del \"Empleado del mes\" Pero...Oh no! ha ocurrido algo!<br/>Su mejor amigo Willy, le ha dado una bebida para conmemorar el increíble esfuerzo de Alien durante todo el mes, pero ¡Vaya! Sin que Willy lo supiera, esta bebida contenía una sustancia que hacia que Alien tuviera muchas ganas de ir al baño.<br/>¡Ayuda a Alien a <strong>contener</strong> sus ganas a la vez que contiene su duro trabajo hasta las 12 PM!<br/><br/>Te mueves con las teclas \"wasd\" y saltas con la barra espaciadora.<br/>Tienes que trabajar en tu computadora a la vez que vas al baño para hacer tus necesidades y bajar el porcentaje.<br/>Pero! Hay ciertos puntos en contra tuyo.<br/>Si tienes muy pocas ventas, tu jefe se enojara y tus ganas de ir al baño aumentaran descontroladamente.<br/><br/>De igual forma, cada cierto tiempo, tu jefe saldrá de su oficina para ir a ver tu escritorio, y si no estas ahí, se enojara aun mas! Cuando escuches la puerta sonar, corre a tu escritorio!<br/><br/>Y...ya hemos hablado de Mark? Un tipo aprovechado que te amenazara con decirle al jefe que te escapaste del trabajo si no arreglas la cafetera.<br/><br/>La velocidad aumenta poco a poco a medida que avanza el tiempo...cuidado!<br/><br/>Idea, código, sprites, y sonidos creados por AngelHYYPE<br/>Sonido de teclado: \"Mechanical Keyboard typing\" hecho por GeorgeHopkins<br/>https://freesound.org/people/GeorgeHopkins/sounds/537244/<br/>Sonido de inodoro \"Toilet Flush\" de EminYINDIRIM:<br/>https://freesound.org/people/EminYILDIRIM/sounds/536107/<br/>Sonido de agua cayendo \"pee1\" de SmokenweewALT:<br/>https://freesound.org/people/smokenweewALT/sounds/261257/<br/>Sonido \"Hearthbeat, Regular, Single, 01-01, LOOP\" de InspectorJ:<br/>https://freesound.org/people/InspectorJ/sounds/485076/<br/>Sonido de click \"Click.mp3\" de Taira Komori:<br/>https://freesound.org/people/Taira%20Komori/sounds/212520/<br/><br/>Vuelvo y repito: <strong>INSTALALO DESDE ESTE LINK DE ITCH.IO:</strong> https://angelhyype.itch.io/aliensbathmania<br/><strong>Y RANKEALO EN ESTA PAGINA.<br/></strong>Puedes instalar el juego de esta pagina, pero es totalmente injugable.<br/></p>", "metacritic": null, "released": "2021-11-04", "tba": false, "updated": "2021-11-05T07:10:43", "background_image": "https://media.rawg.io/media/screenshots/3a3/3a327faa01a34a1dfc883685e5ea7f8d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 28, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["AngelHYYPE"], "genres": [], "publishers": [], "esrb_rating": null}