{"id": 689466, "slug": "fantome", "name": "Fantôme", "name_original": "Fantôme", "description": "Fantôme is a multiplayer (5 vs 1) psychological - horror game where you play with friends to Escape or as a Grifter, betray your friends and prevent them from Escaping by killing. So that you can prove your loyalty.<br/><br/>Players will be given a role as a Survivor or as a Grifter, which is being randomly chosen!<br/><br/><strong>Being a Survivor!</strong><br/><br/>Your main motto is to escape from this hell by finding an Escape Route or a Gate around the Map. But, later you discover that an unexpected curse blocks your way leaving behind some Symbolic Codes that you need to solve before you can Escape. Meanwhile you have to be aware of getting killed by Grifter.<br/><br/><strong>Role as a Grifter</strong><br/><br/>Revenge against your friends and loyalty towards the Demon Lord is the only thing you seek! Just act like others, when everyone's around. At the same time, kill them when no one's watching.<br/><br/><strong>Key Features</strong><br/><br/><ul><li><strong>Friend or a foe?</strong> - Survivors can either cooperate with you or use you as a meat shield against the Grifter!</li></ul><br/><ul><li><strong>A Hope</strong> - Both the Survivors or Grifter are Equipped with a knife to kill and defend. While Survivor loses its usage only if being used against your friends!</li></ul><br/><ul><li><strong>Immersive Experience</strong> - Blend into the world of horrors, with a realistic atmosphere that gives a chilling experience.</li></ul><br/><ul><li><strong>Am I alone?</strong> - Lost in the middle of the Map or being separated from the group will give some chilling JumpScares down your Spine!</li></ul>", "metacritic": null, "released": "2021-11-03", "tba": false, "updated": "2022-08-12T06:40:32", "background_image": "https://media.rawg.io/media/screenshots/2b7/2b7bc76e1efb88a058e68643d20bdfaa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 3, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC", "Web"], "developers": ["Gloac Games", "Crasse", "Gloac"], "genres": ["Action", "Indie"], "publishers": ["Gloac"], "esrb_rating": null}