{"id": 689651, "slug": "warm-place", "name": "Warm Place", "name_original": "Warm Place", "description": "<p>I have been making this game for a while now, and it has gone trough multiple test prototypes. This game here is just a demo and a small portion of the scope I was originally aiming for.  I don't know if I continue this project in this or any form but I like to share at least this idea.<br/>I am more than happy to receive feedback and I hope you have fun paying.</p>\n<p><strong>Some hints:</strong>\n</p>\n<p><em>While I have made most important information available in game and planed to other information to be more of a mystery for the player to solve, I would like to give some hints to prevent possible frustration:\r\n</em></p>\n<p><em>\r\n- Every trader has 2 things they want and they will trade specific item when receiving one of those items.\r\n</em></p>\n<p><em>-All traders can take any item as a trade, and they give back their personal standard item.\r\n</em></p>\n<p><em>-Traders share multiple pieces of information when you talk to them repeatedly.\r\n</em></p>\n<p><em>-Some enemies turn aggressive only when hey are visible to you.\r\n</em></p>\n<p><em>-You can sometimes see lines covering your heart icon (top left) this indicates safe place when a spore storm hits.\r\n</em></p>\n<p><em>-During spore storm there is a chance of one of your inventory items to turn into moss if you are not in a safe place. You can also take damage to your health.\r\n</em></p>\n<p><em>-Your stats are from left to right: health, hunger, social stamina and secret. Secret is most difficult stat to replenish and requires multiple trades.</em>\n</p>", "metacritic": null, "released": "2021-11-03", "tba": false, "updated": "2021-11-05T08:25:35", "background_image": "https://media.rawg.io/media/screenshots/d45/d4533bcfd84f9c57546f704b38c16503.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 26, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Miikka"], "genres": [], "publishers": [], "esrb_rating": null}