{"id": 689660, "slug": "paperbox", "name": "PaperBox", "name_original": "PaperBox", "description": "<p>PaperBox by Diana Yee</p>\n<p><strong>INTERACTIVE GAME POSTER WALKTHROUGH</strong></p>\n\n<p>When starting the poster, the player will see a paper box cursor and the title. From here, the player can press anywhere on the screen, and the ball will attract to the cursor. If the player mouse is released, the ball will spread out and bounce around on the screen. The player can click on the question mark button on the right-top and lead the player to the “help” screen. If the player press the R key can start the game right away.</p>\n\n<p>On the help page, the player can interact with two instruction images by pressing the key is shown or left-click. The player can return to the starting page by pressing space and the R key to start the game.\r\n</p>\n\n\n<p>After pressing the R key, the player will enter the game screen with a 5-second timer count down. Then the player can use WASD to move the paper box or mouse to drag the item into the paper box. If the player collects one item, the player will earn one point, and both the paper box and item will place in a new location.</p>\n<p> </p>\n<p>On the ending page, players can see the score they got from the game. The player can interact with the bouncing ball in the background by pressing anywhere on the screen. And the ball attracts to where the cursor was; the ball will spread out as the player releases the mouse. The player can press space to return to the starting page and start a new game.</p>\n<p><strong>INTERACTIVE GAME POSTER GOALS AND PROCESS</strong></p>\n<p><strong><strong>Design Goal for PaperBox</strong></strong></p>\n<ul><li>Collection<ul><li>When I get the concept of paper boxes, I found that they often used to contain the stuff that we no longer to used or stuff from a young age. Thus, I was planned to make the interaction of referring to the memory with the item by pulling it out from the box. However, this plan failed with the problem of animation and controls, so I revised and replaced the plan by referring to collecting the memory with items by collecting the stuff.</li></ul></li></ul>\n<ul><li>Always be Willing to Scope Down\r\n<ul><li>I want to create everything in the poster interactive and numerous graphics. However, it requires a lot of complex works, such as drawing a large number of items. Figuring this out helps to resolve many unnecessary troubleshot, as well as to understand what are the essential things in this poster.</li></ul></li></ul>\n<ul><li>Discover the Problem\r\n<ul><li>During the coding, I often run into troubleshot, and sometimes it is difficult to find where the problem was. Using the strategy of the console to discover is very helpful to solve the problem as keep up with the process.\r\n</li></ul></li><li>Colors \r\n<ul><li>I want this poster game to be as colorful as possible and use color to fill the emptiness of the poster or to tinker with it a little.</li></ul></li></ul>\n<p><strong>Design Process for PaperBox</strong>\n</p>\n<p>Personal Successes:\r\n</p>\n<ul><li>I was able to get hands-on with the user controls and use them to control screen changes, box direction, and image change.\r\n</li><li>I figure out how to import more stylistic fonts and use them in the interactive poster game.\r\n</li><li>I find a library to check the collision of items, which helps me to check whether the player collects points.</li></ul>\n<p>Personal Challenges:\r\n</p>\n<ul><li>It was a struggle to create animation for images. For example, I try to make items pop out from the box, and players can click and drag on them. However, it ran the issue that the image was shaking in one place; else it was never shown. \r\n</li><li>Coding in the control elements, such as item dragging in the game was challenging. Although I can find serval tutorials; however, implementing the code run into lots of bugs.\r\n</li><li>As I tried to put in sound effects; Such as the sound of the paper box moving, it went into an endless loop and ended up with a sharp sound during the play and decided to remove it because I was unable to find a resolution for it.\r\n</li><li>Several problems were raised with the color of the bouncing balls in the intro and ending page. When I used hex code color, it ran into bugs such as animation stopping working; the only method I got right now was to keep in HSB code color with random color but controllable lightness.\r\n</li></ul>", "metacritic": null, "released": "2021-11-03", "tba": false, "updated": "2021-11-05T08:27:27", "background_image": "https://media.rawg.io/media/screenshots/70f/70f466acdd2c674408339f96eb258b19.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 11, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["dimyee"], "genres": [], "publishers": [], "esrb_rating": null}