{"id": 689628, "slug": "pumpkin-boy-futuregames-joshua-asberg-sodaro-jason", "name": "Pumpkin Boy (Futuregames, Joshua Ásberg, Sodaro, Jason Sandelin Francis, Snufhuffboy, Ruthenium)", "name_original": "Pumpkin Boy (Futuregames, Joshua Ásberg, Sodaro, Jason Sandelin Francis, Snufhuffboy, Ruthenium)", "description": "<p>Part of Futuregames 2021 fall term game project 1</p>\n<p>Pumpkin Boy is a top-down 3D puzzle game that puts you in the shoes of a young boy kidnapped by a witch on Halloween and cursed with a detached head. The boy awakens in the witch’s dungeon, the player must use body and head together, as well as<em> their</em> own <em>head</em>, to solve the puzzles and make their escape from the dungeon, restoring the boy to human form.\r\n  </p>\n<p>The player can independently control the body and head with the two analogue sticks. They must learn to throw and roll the head over obstacles and through gaps to get to otherwise unreachable areas, and use the body to move heavier objects and activate floor triggers. Each level presents the opportunity to complete an optional extra challenge to collect candy on the way out.\r\n  </p>\n<p>The game aims to be an accessible, child-friendly, introduction to cerebral puzzle games with a charming setting and light story elements. Made in less than two weeks, the project was a tough but rewarding group effort, a hard lesson in puzzle design and time management. \r\n</p>", "metacritic": null, "released": "2021-11-03", "tba": false, "updated": "2021-11-05T08:18:17", "background_image": "https://media.rawg.io/media/screenshots/f6e/f6ed6b71a20b9ae7690f5ebeb9b8af81.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 181, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Sodaro", "Ruthenium", "Joshua Ásberg", "Futuregames", "Jason Sandelin Francis", "Snufhuffboy"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}