{"id": 689726, "slug": "hot-coffee-bill-mcdonald", "name": "Hot Coffee (Bill McDonald)", "name_original": "Hot Coffee (Bill McDonald)", "description": "<p>Dans une ruelle, vous devez défendre un sdf. Vous devez alors lancer des boules de neige sur les zonards pour arriver à sauver sa peau. La vie est tolérable avant le problème. Mais quelque chose ne va pas, vous avez peine à vous faire une place sur les réseaux. Vous essayez de vivre avec le problème, espérez que ce n’est pas trop grave ou pensez que quelqu’un d’autre va le résoudre. Il devient évident que vous ne devez pas éviter d’agir. Lors d’une fête, vous faites la connaissance d’un gars qui vous propose une manière de croître son nombre d’abonnés. Pour résoudre le problème, vous allez faire appel à Damon. Vous essayez de résoudre le problème. Lors de la première tentative, vous allez dans la rue, lancez du café chaud sur des inconnu puis fuyez dans un fourgon. En réalité le café cache un secret, il n’est pas vraiment ce qu’il semble prétendre être. Damon vous engueule, n’avez pas asperger assez de personnes. Le problème n’a pas été résolu et la situation s’est aggravée. Vous vous rendez compte que leur premier plan était imparfait, d’autres perdent espoir en vous. Seulement, quelque chose est trouvé ce qui vous donne l’espoir de surmonter le problème... Si vous risquez tout ! Désormais le protagoniste a une d’arme de malade mental. MENTAL! Il devient clair qu’une idée dangereuse pourrait fonctionner, éventuellement avec le sacrifice de soi. Le groupe se réconcilie autour de leur objectif commun et, ensemble, ils tenteront un plan désespéré pour surmonter le problème. Vous économisez des ressources dans l’espoir d’acheter une énorme cuve qui sera déversée dans le niveau. Le moment noir, tous ces risques semblent ne pas pouvoir être payés. Tout est perdu ! Sauf qu’une petite chose qu’ils ont apprises pourrait bien suffire... Peut-être ! Vous vous apercevez de la supercherie que Damon à mis au point et un flic vous vient en aide. [...]</p>", "metacritic": null, "released": "2021-11-03", "tba": false, "updated": "2021-11-05T08:42:20", "background_image": "https://media.rawg.io/media/screenshots/3a9/3a9cf34c6636cce9363a982d4f604d98.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 52, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Bill McDonald"], "genres": ["Action"], "publishers": [], "esrb_rating": null}