{"id": 689761, "slug": "haunted-itch-fortstudios", "name": "Haunted (itch) (Fortstudios)", "name_original": "Haunted (itch) (Fortstudios)", "description": "<p>Haunted is a horror game where you play as a blind child. You need to navigate your way around the house late at night.</p>\n<p>The initial short story for the alpha build was to get a drink of water and get back to bed while being followed by a spirit. <br/></p>\n<p>For this alpha build, I only have the touch to inspect, read notes, bed interaction, door interaction and sink interaction added, I have other features partially coded but not implemented yet and others planned that I want to add in time, there are other levels I want to add to flesh out the story and explore the mystery of why you are being followed by a spirit.</p>\n<p>There are a bunch of key objects scattered around on the ground floor but currently, only the study door can be unlocked.<br/></p>\n<p>The sight is handled by a shader that slightly illuminates vertices based on their distance to the camera, there is only one light source in the entire game, that is only used while in debug mode.</p>\n<p>I need to work on making the notes more visible. Currently, the only readable note in the game is on the desk in the room you start in.<br/></p>\n<p>If you download and test out the alpha let me know what you think of the concept. This build is currently just over two months of work.<br/></p>\n<p>Controls:</p>\n<p>WASD - Movement</p>\n<p>Left Shift - Run</p>\n<p>Left CTRL - Crouch<br/></p>\n<p>E or LMB - Interact<br/></p>\n<p>F or RMB - Pickup</p>\n<p>Menu - Esc<br/></p>\n<p>Dev controls are in the controls panel<br/></p>\n\n<p>Known Bugs:</p>\n<p>While inspecting items you are supposed to be able to put them down without picking them up or without fully uncovering them. In the unity editor version, this was possible but in the build, it seems to be broken. That will be fixed in time.</p>", "metacritic": null, "released": "2021-11-03", "tba": false, "updated": "2021-11-05T08:51:19", "background_image": "https://media.rawg.io/media/screenshots/003/00355315b43bbce1cc72d661187505ab.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 48, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Fortstudios"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}