{"id": 68986, "slug": "clash-of-kings-cok-2", "name": "Clash of Kings - CoK", "name_original": "Clash of Kings - CoK", "description": "Clash of Kings is an MMORPG war game chosen by billions of players worldwide. Players from nearly 200 countries are in the same kingdom to develop and fight. Millions of players online at the same time, over 15 million wars occur everyday, 21 language game versions, and real-time translation mechanism, all make it easy for you to make friends and fight together all over the world. As the most classic strategy game, Clash of Kings has been awarded a lot of prizes. If you like games with attention to Strategy and Customization, then Clash of Kings is what you are looking for!<br/><br/>Battle kingdoms, wage war, fight armies, build your castle and conquer an empire with real time strategy! Download Clash of Kings to experience the fantasy world of PVP medieval combat action and join millions of players worldwide!<br/><br/>***Classic Features***<br/>#Real-Time Battles#<br/>Play Clash of Kings with real time MMO battle action against thousands of players worldwide.<br/><br/>#Exploration &amp; Investigation#<br/>Battle kingdoms, upgrade dragons, recruit heroes, increase your army defenses, collect resources and build an empire in this epic multiplayer online game.<br/><br/>#Conquer the Kingdom#<br/>Fight against a rival castle, palace or kingdom and navigate the fantasy world. Use tactical MMO RPG gameplay to prevent a siege on your palace, battle enemies and manage your palace’s resources to become one of the most powerful lords in the Clash of Kings Empire.<br/><br/>#Alliance System#<br/>Play tactical MMO real time battle strategy and build alliances with other lords. Summon powerful Alliance bosses to the world and team up with your Alliance members to defeat them in epic PVE action.   <br/><br/>#4 Unique Civilizations#<br/>Battle and conquer kingdoms in four brand new civilizations of Dragon-born, Viking, Yamato and Huaxia. With new heroes each with their own specialties battling it out in the ancient valley, these battle-tested warriors are ready for intense fighting action within the ever expanding multiplayer fantasy world.<br/><br/>#7 Dragons#<br/>Each player has at most 7 Dragons that they can raise and customize with special abilities, making each battle unique.<br/><br/>Please Note:<br/>- Payment will be charged to your iTunes Account at confirmation of purchase.<br/>- Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period.<br/>- Your account will be charged for renewal within 24-hours prior to the end of the current period, and identify the cost of the renewal.<br/>- Subscriptions may be managed by the user and auto-renewal may be turned off by going to the account Settings after purchase.<br/><br/>Connect with Clash of Kings<br/>●\tFacebook: https://www.facebook.com/Clash.Of.Kings.Game<br/>●\tTwitter: https://twitter.com/ClashOfKingsCOK<br/><br/>Privacy Policy and Terms of Use please check: http://elex-tech.com/Index/privacy", "metacritic": null, "released": "2014-12-30", "tba": false, "updated": "2019-07-29T12:38:31", "background_image": "https://media.rawg.io/media/screenshots/1cd/1cdbb01462cbe6723f7b2fe4f223b78b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 3, "playing": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 525, "game_series_count": 0, "reviews_count": 2, "platforms": ["iOS"], "developers": ["Elex Wireless"], "genres": ["RPG", "Strategy"], "publishers": ["ELEX Technology Holdings Co"], "esrb_rating": "Teen"}