{"id": 689817, "slug": "buttons-football-the-videogame", "name": "Buttons Football: the videogame", "name_original": "Buttons Football: the videogame", "description": "<ul><li><em>The Game</em></li></ul>\n<p><em>Buttons Football: the videogame is a game based on the real “Button Football (Soccer)” that is played on a table.</em></p>\n<p><em>It is a simulation of football played on a table, using concave buttons or special discs to represent players on the field. Just like a game of pool or billiards, aiming and strength skills will be tested.</em></p>\n<p><em>My intention is to bring some of the experience provided by Button Soccer to a game made in 3D with immersion and challenge to players.</em></p>\n<ul><li><em>Work In Progress </em></li></ul>\n<p>At the moment, the game is playable for local multiplayer. You can choose colors, emblems, playing time, rules, day or night, tactical formation, field type, ball type and performance graphics options. But I know there's still a lot to do to make it even better. And with your help, I know I can do it.</p>\n<ul><li><em>Early Access</em></li></ul>\n<p>This game is in development. This means you will experience bugs, unfinished features, and many more things that disrupt your game experience. Please submit your feedback and impressions via the website: Buttons Football or via the game page on Itch.io.</p>\n<p>Thank you for participating!</p>\n\n<p><strong>_____________________________________</strong></p>\n<ul><li><strong>O Jogo</strong></li></ul>\n<p>Buttons Football: the videogame é um jogo baseado no verdadeiro “Futebol de Botão” que é jogado sobre uma mesa.</p>\n<p>Trata-se de uma simulação de futebol praticado sobre uma mesa, utilizando botões côncavos ou discos especiais para representar os jogadores em campo. Assim como um jogo de sinuca ou bilhar, as habilidades de pontaria e força serão testadas.<br/></p>\n<p>Minha intenção é trazer um pouco da experiência proporcionada pelo Futebol de Botão para um jogo feito em 3D com imersão e desafio aos jogadores.</p>\n<ul><li><strong>Jogo em Desenvolvimento</strong></li></ul>\n<p>Nesse momento, o jogo está jogável para <em>multiplayer </em>local. É possível escolher cores, emblemas, tempo de jogo, regras, dia ou noite, formação tática, tipo de campo, tipo de bola e opções gráficas de desempenho. Mas sei que ainda há muito o que fazer para torná-lo ainda melhor. E com a sua ajuda, sei que posso conseguir.</p>\n<ul><li><strong>Early Access</strong></li></ul>\n<p>Este jogo está em desenvolvimento. Isso significa que você poderá perceber bugs, funcionalidades inacabadas e muitas outras coisas que atrapalham sua experiência de jogo. Por favor, envie seu feedback e suas impressões através do site: Buttons Football ou através da página do jogo no Itch.io. </p>\n<p>Obrigado por participar!</p>", "metacritic": null, "released": "2021-11-02", "tba": false, "updated": "2021-11-05T09:06:00", "background_image": "https://media.rawg.io/media/screenshots/f52/f529080317de982f5fcea6ec7e9ad65e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 149, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Lucasoliveira"], "genres": ["Sports"], "publishers": [], "esrb_rating": null}