{"id": 689851, "slug": "thunderbuddy01s-life-a-simple-video-game", "name": "ThunderBuddy01's Life - A Simple Video Game", "name_original": "ThunderBuddy01's Life - A Simple Video Game", "description": "<p>This is a short and simple video game showcasing the life and interests of ThunderBuddy01, a semi-famous YouTuber who resides in Southwest Connecticut. </p>\n<p>Albertus Magnus AR-218-1 F2021 Artist Statement:</p>\n<p>This is a simplistic game showcasing all of the things that matter most to me (ThunderBuddy01) not only as a YouTube content creator, but also as a person. The coins - as collectables - I care about because it helps me expand my horizons for content ideas, gives me more motivation to create videos, and it helps me get through school. The Computer - as a platform - I care about the most because it's the same computer that helped make this project possible; this is a Late 2013 13-inch Retina MacBook Pro, which has been my computer ever since 8th grade, and it means a lot to me as one of the best computers I've ever had. The Radio, showcased in the menu, is the main driving force of my YouTube career; I've been collecting radios for over 7 years at the time of this game's creation (Fall 2021), and I've built a collection that most normal people would consider an obsession. The NASCAR™ diecast represents my passion for motorsports and my love of cars. </p>\n<p>The Enemy - a transparent version of the main character - represents the negative energy I have faced and battled with over the years as an individual both inside and outside the home and social media. There's too many instances of this to fit into this one statement, but it's enough for me to portray it as an enemy figure.</p>\n<p>As a player of this game, I hope that you can take the time out of this game and enjoy it, despite its minimalist nature. <br/></p>", "metacritic": null, "released": "2021-11-02", "tba": false, "updated": "2021-11-05T09:15:04", "background_image": "https://media.rawg.io/media/screenshots/455/455c15eadccc53d194391fb710337578.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 9, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["albertus_game_1"], "genres": [], "publishers": [], "esrb_rating": null}