{"id": 68991, "slug": "slots-tiger-house-casino-free-vegas-slot-machine-g", "name": "SLOTS - Tiger House Casino! FREE Vegas Slot Machine Games of the Grand Jackpot Palace!", "name_original": "SLOTS - Tiger House Casino! FREE Vegas Slot Machine Games of the Grand Jackpot Palace!", "description": "SLOTS - Tiger House Casino is the #1 free-to-play Slots Game!<br/><br/>Tiger House gives you the chance to WIN BIG and enjoy the most authentic online casino experience right on your device! <br/><br/>Make a fortune with HUGE Payouts, Free Hourly Coins, Bonus Games, and more! Get ready to play Slots featuring HD 3D art and animations only seen before on real slot machines in the best casinos!<br/><br/>Tiger House Slots<br/>Explore the sacred hills of Southern China and awaken the Roaring Beast!<br/><br/>Lost Pyramid Slots<br/>The forsaken Pyramid across the desert holds a Golden Secret!<br/><br/>Cave of Riches Slots<br/>Light some Dynamite and dig up a Mountain of GOLD NUGGETS!<br/><br/>Undersea Quest Slots<br/>The Mermaid Goddesses are waiting for YOU!<br/><br/>Metro S.W.AT. Slots<br/>The Biggest Heist in American History is in progress and the Bank has only one hope!<br/><br/>Cash Farm Slots<br/>SUPER Payouts all throughout old Leroy's CASH FARM!<br/><br/>Circus Deluxe Slots<br/>All bearded ladies may play for free in this Amazing Circus!<br/><br/>Jolly Queen Slots<br/>Unlock Her Majesty's ice Kingdom and discover a Mountain of Jolly Riches!<br/><br/>TOP FEATURES: <br/><br/>- Huge variety of top-quality slot machines (with more being released all the time!)<br/>- Exciting “Spin The Wheel” Bonus Game!<br/>- Free bonus coins every hour – Collect higher coin amounts as you increase your player level!<br/>- Progressive Daily Bonus Rewards<br/>- Use Gems to multiply your winnings. Win more Gems with more game play<br/>- Facebook Login<br/>- Full Game Center integration<br/><br/>For help and support please contact us at: support@rialtogames.com", "metacritic": null, "released": "2015-11-07", "tba": false, "updated": "2019-10-22T14:26:46", "background_image": "https://media.rawg.io/media/screenshots/03e/03e4d72923743a22f021835448020dce.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 120, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mega Spin Studios"], "genres": [], "publishers": ["Mega Spin Studios"], "esrb_rating": "Teen"}