{"id": 689954, "slug": "memories-with-you", "name": "\"Memories With You\"", "name_original": "\"Memories With You\"", "description": "<p>The main character, Makoto, wakes up in an unfamiliar place. Apparently, it is a ceremonial room in a Shinto temple. Suddenly a blond girl runs into the room and starts yelling at Makoto. He has no idea what's going on, and then... someone grabs his leg! </p>\n<p>It turns out that the blond girl is Makoto's cousin, the miko, priestess of the temple. And the other girl is the fox goddess, Setsuko. </p>\n<p>Sort of figuring out what's going on, Makoto tries to ask some questions. But when he calls the goddess by name, he falls to the floor because of the tremendous pain that pierced him. </p>\n<p>Why would a goddess sealed in this temple for more than a thousand years is awake? What kind of person was Makoto before he lost his memory? Is this really the first time Makoto sees Setsuko? <br/><br/>Game is a fusion of moege (slice-of-life, romantic visual novels) with survival. <br/>Main heroines (and outfits example):<br/><br/>Backgrounds (you can see some more after downloading zip file or in the google drive https://drive.google.com/drive/u/0/folders/1tRTubbC7nAj3-CUcaRPEE9C4LHU9o5wl):</p>\n\n\n\n<p>CGs:<br/><br/></p>\n\n<p>Game will have voice over for all heroines, live2d animated sprites, 30+ CGs and 15+ BGs. Estimated size: 6-10 hours.  CGs are 70% ready, BGs - 60%!</p>\n<p>Game is in an active development! I'm BGs, CGs, sprites and live2d artist + I'm music composer, so this parts of the game dont need any money! So I need money for: Taxes, Proofreading and Editing, Code, UI, Voice over.</p>\n\n<p><strong>Goal 0: Demo<br/></strong></p>\n<p>I'll publish the Demo of the game (first 2 hours of the gameplay) soon! But I can't afford to hire anyone, so Demo wouldn't have voice-over (and lipsync).</p>\n<p><strong>Goal 1: Proofreading</strong><br/>I'm not native English (even though I'm pretty good at it), so I need an editor. The lowest rate is 2$/100 words, so for medium-sized game I'll need 600$. But maybe my knowledge of English will be enough (you can write your opinion in the comments), and then this step can be skipped!</p>\n<p><strong>Goal 2: Voice-over</strong></p>\n<p>The lowest rates of English voice actresses are 5$/100 words. My VN is strongly based on the dialogues and I'm not sure that the lowest paid VAs would be good enough, so for this step I'll need 1200-1400$. But even if I don't raise enough money, I can make partial voice-over (only for main heroine, for example) or make Russian voice-over (it would cost 10 times less). I'm not sure is English audience okay with non-English voice-over, so let me know what do you think!<br/><br/><strong>Goal 3: UI and Code</strong></p>\n<p>Good friend of mine made a custom VN engine for me! So I didn't have to spend any money on it. But he needs some payments to make games for other platforms (Windows, Linux, Android and iOS). Also without good UI game menu, text frame and etc looks not the best. I'll need  800-900$ for this goal.<br/><br/>Money gathered: 0$ (02.11.2021)</p>", "metacritic": null, "released": "2021-11-02", "tba": false, "updated": "2021-11-05T09:38:18", "background_image": "https://media.rawg.io/media/screenshots/757/757c97ddf49dd9c1a00b676aeb780f0b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 41, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["alexeyizimov"], "genres": [], "publishers": [], "esrb_rating": null}