{"id": 68993, "slug": "dead-attack-zombie", "name": "Dead Attack: Zombie", "name_original": "Dead Attack: Zombie", "description": "Zombie Attack, Multi-Level and sophisticated ammo are ready for zombie killer. The world is under zombie attack after the war. Zombies are everywhere on the streets and city centers. Dead Attack: Zombie is the simulation of the zombie attack on the city. <br/>Dead Attack: Zombie is a multi-level game zombie shooting game. The game runs adrenaline in the blood of zombie shooters. Remember, you are not an ordinary shooter or sniper, you are a zombie killer. Therefore, boost up your energy and pack up your ammunition to shoot zombies and vanish each zombie from the city streets. <br/>Dead Attack: Zombie makes you to expert at shooting zombies. Do not fear of any zombie attack just find zombies and shoot them at first sight. Select your best weapons because the number of zombies is going to increase by each level therefore you could be in serious zombie problem. <br/>Dead Attack: Zombie has been developed in real 3d graphics that are cool enough to attract your attention. The background sounds and music adds adrenaline to shoot zombies and vanish away every single zombie. <br/><br/> How to Play<br/>Dead Attack: Zombie is a deadly game for zombie killers. So be ware and learn to kill zombies.<br/>\tTap to select the zombie level.<br/>\tTap to select the ammo.<br/>\tShoot zombies wandering on the city streets.<br/><br/> Features <br/>Dead Attack: Zombie is a futuristic game for zombie game with multi – levels. <br/>\tAdrenaline Booster for Zombies Shooter.<br/>\tReal 3d Shooting Environment.<br/>\tReal Zombie Graphics", "metacritic": null, "released": "2017-02-15", "tba": false, "updated": "2019-10-22T13:54:59", "background_image": "https://media.rawg.io/media/screenshots/e93/e93445ae80ecf5572b81b80657f455d1.jpg", "website": "https://www.youtube.com/watch?v=JVwTB2Ejncc&feature=youtu.be", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 97, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Files Studio"], "genres": ["Action", "Adventure"], "publishers": ["FILES TECHNOLOGY PRIVATE"], "esrb_rating": null}