{"id": 689974, "slug": "lost-vault-vaultomb", "name": "Lost Vault (Vaultomb)", "name_original": "Lost Vault (Vaultomb)", "description": "<p>Join the mixed world of post-apocalypse and fantasy. Build your character, collect mythic gear and climb the rank! Upgrade your shelter to stay safe and raid the unprepared. Explore the wasteland and clear scattered all over the world Vaults.</p>\n<p>Lost Vault is a variation of idle and active MMORPG. There is no auto-play which would make your life easier. Prepare for resources optimisation and performing the actions carefully!</p>\n<p>◆ POST-APO vs FANTASY: Choose your side by playing as Ranger, Rebel or Knight and Wizard. Everyone has equal chances to dominate the world.</p>\n<p>◆ JOIN THE CLAN: Playing as a lone wolf is not the best strategy during apocalypse. Establish or join one of the clans to gather bonuses and access to dangerous bosses.</p>\n<p>◆ BUILD SHELTER: Stay safe and upgrade the only safe place you got. Gather resources and raid other players.</p>\n<p>◆ NO P2W: You not gonna rule the world with your credit card.</p>\n<p>◆ UNLOCK DUNGEONS: Defeat locked in the underground Vaults bosses and steal the hidden treasuries.</p>\n<p>◆ COLLECT EQUIPMENT: Naked survivor is dead survivor. Find best gear divided by multiple tiers and rarities.</p>\n<p>◆ NO GRINDING: Play just short sessions during the day to stay competitive.</p>\n<p>◆ WORKSHOP: Upgrade your items and put precious gems into the sockets.</p>\n<p>◆ NO ADS: As simple as that.</p>\n<p>◆ EXPLORE DISTRICTS: 20 locations with various beasts are waiting for being explored.</p>\n<p>◆ SMASH YOUR FOES: PvP, PvE, GvG, GvE. It's all here.</p>", "metacritic": null, "released": "2021-11-02", "tba": false, "updated": "2021-11-05T09:43:30", "background_image": "https://media.rawg.io/media/screenshots/4f9/4f9f9a90d12702067b6ffa6ec335474a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 186, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Vaultomb"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}