{"id": 689965, "slug": "fitzroy-dives-deep", "name": "Fitzroy Dives Deep", "name_original": "Fitzroy Dives Deep", "description": "Description\r\n<p>Fitzroy has finished his seafaring holiday where he did what must look suspiciously like a lot of work and not much holidaying. Now he is looking for a change and something that does not involve any mines (sea mines or otherwise). Due to inherent attraction to up and coming disasters and calamities he has learned that the nearby town’s underground water facility is in a state of disrepair and the town will soon be devoid of water. Describing it as a facility might be stretching it, it is more of a series of water caves with some water infrastructure here and there.\r\n</p>\n<p>\r\nIt is now Fitzroy’s challenge (as the only volunteer), (If there was anyone else I wouldn’t be telling the story, now would I?) to repair the facility and escape the monsters lurking below. So now our intrepid hero must go back underground (luckily for him this is a well-lit cave system unlike his previous cave experience) for a new adventure. Rumour has it the cave also contains treasure so now is the right time to save the town and get a tiny bit wet!\r\n</p>\n<p>Fitzroy Dives Deeper is a platform game played both on land and underwater for the Amstrad CPC as a 2021 entry for the annual CPCRetroDev game competition.</p>\n<p>The game has been developed using the amazing CPCtelera game library.</p>\r\nHow to Play\r\n<p>Default controls are as follows (or rebind them to your own preference)</p>\n<ul>\n<li>Left: Move the player left</li>\n<li>Right: Move the player right</li>\n<li>Up: Move the player upwards when in water with scuba gear.</li>\n<li>Down: Move the player downwards when in water with scuba gear.</li>\n<li>Z: Jump vertically (when out of the water) or quickly move upward when in water (boost) while carrying the scuba gear.</li>\n<li>X: (Use) Activates an interactable if Fitzroy is in front of it.</li>\n<li>Space: (Shoot) Fires the weapon if Fitzroy has picked it up and has sufficient ammo.</li>\n</ul>\n<p>Be sure to use a careful combination of boost and up in the water to maximise speed and control while avoiding the spikes!</p>\r\nAuthors and Licenses\r\n<p>This game has been developed by:</p>\n<ul><li>Adrian Parker (awergh) - Everything but music</li></ul>\n<p>With some added help this year:</p>\n<ul><li>Eric Love - Music and testing</li></ul>\n<p>The game source code has been released under an MIT License.</p>\n<p>The game was developed with the help of the following software:</p>\n<ul><li>CPCTelera 1.5 (dev) (ronaldo / (Cheesetea, Fremos, ByteRealms)) - Tool chain and libraries building the game for the Amstrad CPC.</li><li>Retro Game Asset Studio (lachlank) - For game graphics</li><li>Microsoft Visual Studio Code and Microsoft Visual Studio - Text Editor and Integrated Development Environment.</li><li>Arkos Tracker 2 - Sound and Music</li><li>Arkos Tracker 2 with CPCtelera - Arnaud provided assistance and helpful source files for integrating CPCtelera with Arkos Tracker 2.</li><li>WinAPE (Richard Wilson) - To run the game I used WinAPE 2.0 Beta 2 and my Amstrad CPC 464.</li><li>CPCEC (cngsoft - Cesar Nicolas-Gonzalez) - I also used CPCEC for my testing as an alternate emulator and it had a closer matching green to my GT64 than WinAPE.</li><li>WinCPCTelera (Arnaud) - In order to leverage the Microsoft Visual Studio Debugger I used WinCPCTelera by Arnaud</li><li>Allegro 5.2.7 - As part of my development process I created a map editor using Allegro for creating levels.</li><li>Azure DevOps - Every project needs source control, task tracking and continuous integration.</li></ul>\r\nGesture\r\n<p>Fitzroy in the Deep includes a gesture for Rainbow Islands in the form of a water chase section. If you climb the screen too slowly the water will catch up with you!</p>\n<p>Compare the below screenshot with the other screenshot on the page to see the water has climbed.</p>\n\r\nInstall Instructions\r\nOn a real Amstrad CPC:\r\n<p><strong>Loading from disk: </strong></p>\n<ul><li>Type Run”Game and press Enter </li></ul>\n<p><strong>Loading from tape: </strong></p>\n<ul><li>Press <strong>CTRL </strong>and the <strong>Small ENTER </strong>key, then press Play.</li></ul>\r\nUsing an emulator:\r\n<p>You can play the game using any Amstrad CPC emulator (<strong>WinAPE</strong>, <strong>CPCEC</strong>, <strong>RetroVirtualMachine</strong>). </p>\n<p>Load the game file into the emulator, then type <strong>RUN\"</strong> and press <strong>ENTER</strong>.<br/></p>", "metacritic": null, "released": "2021-11-02", "tba": false, "updated": "2021-11-05T09:40:46", "background_image": "https://media.rawg.io/media/screenshots/d86/d865dcab64a4b1c0122bab6916a9c746.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 33, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["awergh"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}