{"id": 69003, "slug": "age-of-warring-empire", "name": "Age of Warring Empire", "name_original": "Age of Warring Empire", "description": "⊕⊕WAR in our world, RULE in yours⊕⊕<br/>Play a game for WARRIORS, None of that Cartoon Nonsense!<br/>Stunning battle ANIMATIONS and TACTICAL combat. <br/>RPG ADVENTURE, never seen before in any STRATEGY game! <br/> <br/>=User REVIEWS=<br/>5/5“This is the perfect game. It is easy to pick up yet hard to master! With other games, you spend days building and are just too complicated” <br/>5/5 “Finally! A strategy game that is NOT a ‘TAP and WAIT’. This game beautifully combines a fast-paced RTS with hundreds of legendary heroes that literally lead your troops into battle. <br/>5/5 “Never played strategy games before, but i’m already loving it! The community is huge and they update it regularly, seems they really want players to love this game!” <br/>5/5“Everything about this game is so smooth! From loading to in game battles to real time chat.<br/> <br/>=Features=<br/>√Build your EMPIRE &amp; Conquer all foes! <br/>√ACTION packed game play and PROGRESSION like never before!<br/>√Recruit your favorite HISTORIC, LEGENDARY &amp; FOLKLORE HEROES from ancient GREECE, ROME and PERSIA. <br/>√All skilled HEROES come with unique abilities and stunning BATTLE animations.<br/>√Craft, Upgrade and Socket LEGENDARY weaponry and armour and equip them to your HEROES.<br/>√RESEARCH techonologies &amp; ENHANCE your troops to make your EMPIRE more POWERFUL!<br/>√Create or Join an ALLIANCE and conquer enemies together or battle in the EPIC Imperial City Alliance BATTLE to become KING!<br/>√Chat and strategize with your friends and alliance or banter in WORLD CHAT before laying waste to your enemies!<br/><br/>NOTE: A network connection is required to play.", "metacritic": null, "released": "2013-06-17", "tba": false, "updated": "2019-07-29T12:38:32", "background_image": "https://media.rawg.io/media/screenshots/cbc/cbc03f50a84f02517cfca1c8a694a36f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 288, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Elex Wireless", "Elex"], "genres": ["RPG", "Strategy"], "publishers": ["ELEX Technology Holdings Co"], "esrb_rating": "Teen"}