{"id": 69020, "slug": "oddly-satisfying-asmr-game", "name": "Oddly Satisfying ASMR Game!", "name_original": "Oddly Satisfying ASMR Game!", "description": "The first ever oddly satisfying game that will give you chills and calm your nerves is here! Try not to get satisfied with this super relaxing series of activities with the best anti stress experience of your life including 5 of the viral oddly satisfying activities including:<br/><br/>DIY super cool squishy stress ball:<br/>Press the squish balls of your choice for the most satisfying experience ever and unlock the amazing collection of your squishies after earning some coins. You can also enjoy squishy ball cut open activity with slime squish balls and press it for some soothing and nerve calming experience.<br/><br/>Experiment hydraulic press:<br/>Experiment different squishy and hard objects with hydraulic press and try not to get satisfied.<br/><br/>ASMR Slime Poking, pressing and stretching:<br/>Enjoy relaxing ASMR slime activities including oddly satisfying slime poking pressing and jiggling for a super relaxing and calming experience.<br/><br/>Soft Jelly Wire mesh cutting:<br/>Cut different colors of slimy jelly using 1000 degree mesh for some brain melting and satisfying experience.<br/><br/>1000 degree Knife crayon Burning:<br/>Burn different colors of crayons with 1000 degree knife and enjoy the ASMR melting experience that will calm your nerves like never before.<br/><br/>Enjoy this oddly satisfying game relaxing game addictive as anything in your mobile device for the very first time and have fun.", "metacritic": null, "released": "2018-08-26", "tba": false, "updated": "2019-10-22T14:26:47", "background_image": "https://media.rawg.io/media/screenshots/1dd/1dd63c8dacaac9c35bb503c320617664.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 86, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sarah Shahzad"], "genres": ["RPG", "Family"], "publishers": ["Sarah Shahzad"], "esrb_rating": null}