{"id": 69039, "slug": "amazing-chocolate-bar-cake-diy", "name": "Amazing Chocolate Bar Cake DIY", "name_original": "Amazing Chocolate Bar Cake DIY", "description": "Learn how to make the most amazing chocolate cake with this new DIY cooking game for kids. Unleash your DIY cooking skills &amp; be the cake master dessert chef of this amazing chocolate cake sweet as heaven that will melt in your mouth with every single bite. Make this out of the world sweet chocolate cake made with chocolate sticks in so many colors. First of all make Chocolate sticks using ice cream wafer stick then coat your wafer stick with chocolate syrup, white chocolate, strawberry, mango and so many rainbow colored syrups of your choice.<br/> Bake the moist chocolate cake smooth as silk and soft as sponge using baking soda, cocoa powder and cake mix. Decorate and design the fresh baked black forest chocolate cake with chocolate bar, white chocolate sticks or any colored chocolate stick of your choice. Decorate the cake top with candies, chocolates candy canes and biggest collection of amazing and eye catching designs. Design the best chocolate cake of your dreams like you have never done in this sweet desserts food maker game.<br/><br/>Chocolate Cake Dessert Game Menu &amp; Features:<br/>White Chocolate Cakes with rainbow colored toppers.<br/>Unicorn Chocolate Cake with mystical toppings.<br/>Black forest cake with candy cane sticks.<br/>Rainbow Colored Chocolate Cakes with Unicorn Toppings<br/>Gold Chocolate Bar Fondant<br/>Amazing chocolate cake decorations<br/>Most satisfying desserts for kids<br/>And so much more…<br/><br/>Download this latest trendy chocolate unicorn dessert DIY cooking game for kids and make the best chocolate cake ever. Serve these eye catching designs with amazing chocolate cake decorations perfect to serve as birthday cake on your birthday party or as wedding cake!", "metacritic": null, "released": "2018-03-08", "tba": false, "updated": "2019-10-22T14:26:47", "background_image": "https://media.rawg.io/media/screenshots/09c/09c9742ef26cf7f761a108ce265805eb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 103, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sarah Shahzad"], "genres": ["RPG", "Family"], "publishers": ["Sarah Shahzad"], "esrb_rating": null}