{"id": 690545, "slug": "safecracker-itch", "name": "Safecracker (itch)", "name_original": "Safecracker (itch)", "description": "<p>You play a safecracker with 12 chances to guess a 4-digit passcode. Luckily for you, your tools and flaws in the safe will make it easier.<br/></p>\n<p><em>If you prefer to play with touch or mouse, tap or click the screen to bring up a Chip-8 keypad.</em></p><p><strong>Rules</strong></p><p>Your current guess is the rightmost column of numbers.</p>\n<p>The passcode will not use a digit more than once. If the currently selected passcode repeats digits, an \"X\" will be displayed above it, and you won't be able to submit it. A valid passcode will display \"OK\" above it. Decreasing or increasing a digit past 0 or 9 will wrap around to the other side. </p>\n<p>After every guess, you will see feedback above it in the form of up to four dots:</p>\n<ul><li>Every dark dot represents a digit in the correct location</li><li>Every light dot represents a digit that is somewhere in the passcode, but currently in the wrong place</li><li>Fewer than four dots means that not all of the digits in your guess are in the passcode</li><li>0 dots mean that none of the digits you guessed are in the code</li></ul>\n<p>After the 12th guess, the game will be over, and you will win or lose depending on whether your last guess was correct. You can also win earlier by deducing and submitting the correct passcode. </p><p>After a game is over, you can press the submit key to start a new game.<br/></p><p><strong>Controls</strong></p>\n<p>If you prefer to play with touch or mouse, tap or click the screen to bring up a Chip-8 keypad. </p>PC Keyboard Key(s)Chip-8 Keypad Key(s)Game ActionFESubmit current passcode if valid (\"OK\" displayed above rightmost column)<br/>1, 21, 2Increment / decrement 1st digitQ, E4,5Increment / decrement 2nd digitA, S7, 8Increment / decrement 3rd digitZ, XA, 0Increment / decrement 4th digit\r\n<p>Sadly,  sound has been omitted in the Octojam release version due to unexpected events during the time allotted for development.<br/><br/>The font used is based on Tom Thumb, a 4x6 monospace bitmap font released under CC0 Public Domain Dedication.<br/><br/>Source can be found at https://github.com/pushfoo/Octo-Safecracker.</p>", "metacritic": null, "released": "2021-11-01", "tba": false, "updated": "2021-11-05T12:14:08", "background_image": "https://media.rawg.io/media/screenshots/777/777d380595634533aaae9917cb58d689.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["pushfoo"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}