{"id": 690678, "slug": "alien-inv8sion", "name": "Alien Inv8sion", "name_original": "Alien Inv8sion", "description": "<p>This game is best played full screen to save your eyes 👀</p>\n<p>Bonus content:\r\n</p>\n<ul><li>Suggested soundtrack 🎶😄\r\n</li><li>Run the game in the Octo interpreter, to prove it's still just a regular XO-CHIP game 😉  (reduced colours)</li></ul>\r\nHow to play Alien Inv8sion\r\nControls\r\n<ul><li>Arrow keys or WASD to control your ship (or keys 5, 7, 8 and 9 on mobile / Cosmac VIP)\r\n</li><li>E or spacebar to fire lasers (or key 6 on mobile / Cosmac VIP)</li></ul>\r\nGameplay\r\n<p>You are famed airship pilot Gunnar Gunman, and after the aliens striked first and destroyed most of the human fleet, you are planet Earth's only hope! Destroy as many aliens as you can before they hit the ground to give your fellow human being a fighting chance! 👽\r\n</p>\n<p>For each alien spaceship you shoot down, you gain points (shown on the top left, indicated with \"PTS\"). If you let alien ships escape and get down to the planet, you lose points. For every 250 points you collect, you go up a level (current level shown bottom left, indicated with \"LVL\"). But beware! Each level, the attacks get more fierce!\r\n</p>\n<p>Your ship does not have unlimited power. The power meter (white indicator on the left of the playfield, which turns red) shows you how much power your ship has left. Shooting your lasers takes power, and if you lose power your lasers will be less powerful. More importantly, your power also feeds your shields. If you run your ship into alien ships, your shield will compensate and draw power. Lose all your power and you lose your shields, leaving you vulnerable to the alien ships!\r\n</p>\n<p>Good luck Gunnar, and may lady luck smile on you!\r\n</p>\r\n\r\nThe concept\r\n<p>Alien inv8sion is a nod to the endless stream of space shooters that popped up in the late 70s and early 80s after the popularity of the game Space Invaders from 1978. This is very much the exact same period in which CHIP-8 became popular, and there are a lot of Space Invaders clones and other space shooters for CHIP-8. Time to add my twist on the theme to the fray!\r\n</p>\n<p>Having recently developed a WebAssembly CHIP-8, SCHIP and XO-CHIP interpreter called Silicon8 that supports the full range of XO-CHIPs potential colour space  (a whole whopping 16 colours!) I figured it would be a shame not to make use of those colours in my next game. So I did, and I bumped the virtual CPU speed to an absolutely insane 12Mhz to bring CHIP-8 (or more specifically XO-CHIP) much closer to the coveted arcade systems of the time, or even systems like the NES.\r\n</p>\n<p>Unfortunately I didn't have very much time to work on this game this year, and the actual gameplay may not be what you expect from an arcade or NES game. But it's fun to fly around and shoot aliens, and as a demo of what CHIP-8 can do if pushed: a fully animated colourful parallax background with lots of masked sprites flying across the screen!</p>\n<p>For more background information and the source code, see the Github repository.</p>", "metacritic": null, "released": "2021-10-31", "tba": false, "updated": "2021-11-05T12:43:40", "background_image": "https://media.rawg.io/media/screenshots/e66/e66571d44dcf037bd89487260485b27f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 34, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Timendus"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}