{"id": 690772, "slug": "hope-despair-chaos", "name": "Hope Despair Chaos", "name_original": "Hope Despair Chaos", "description": "A <strong>real time social deduction game</strong> with unique <strong>Talents ( skills )</strong> combine with <strong>Factions (winning condition)</strong>, real time lightning, flashlight management and hiding in shadow. <br/><br/>Follow us for more news: <strong>Twitter</strong>, <strong>Youtube</strong>,<br/><strong>Discord server</strong>: Looking for group to play, interacting with dev, discord chat voice and much more ... <br/><br/>Welcome to Hope Despair Chaos ! <br/><br/>A game about <strong>Hope Cultivation</strong> programs and includes some of the <strong>Despair</strong> elements to stimulate the best outcome possiple. Join the program and may the fortune of luck let you be one among us, <strong>Symbols of Hope</strong>. Those remain evil will be chosen as <strong>Symbol of Despair</strong>, atempting to eliminate everything.<br/><br/><br/><br/><strong>Top Features:</strong><br/>- <strong>Talents ( skills ) and Factions (winning conditions) are independent</strong> meaning a Doctor can be <strong>Hope Doc</strong> or <strong>Despair Doc</strong> or <strong>Chaos Doc</strong> or any faction possiple.<br/>- When you are killed, you leave an <strong>Encrypted Victim Message</strong> behind.<br/>- <strong>Crime scene investigation</strong> with flashlight, <strong>decrypting victim message</strong> and looking for the <strong>true murder location</strong>.<br/>- <strong>Real time shadow</strong> allow you to hide in shadow for real, as well as <strong>hiding a body</strong>.<br/>- <strong>Personal flash light</strong> with limit battery allow you to show off your management skill.<br/>- <strong>5 cloth slot</strong> fully customiable for your fashion talents to shine.<br/>- You only need <strong>one copy</strong> of a cloth to wear it on your character in game. Feel free to trade or market your surplus cloths as you want. Most of cloths are <strong>tradable, marketable</strong> following Steam policy.<br/><br/><strong>Features:</strong><br/>- <strong>Multiplayer real time</strong> casual assassinating and investigating game.<br/>- Playable from 1 to 10 players.<br/>- <strong>SPECIAL 2+ players game mode:</strong>: All player start as Symbol of Hope. Those first players to finish all tasks become Senior Symbol of Despair.<br/>- Each player start game with <strong>a unique talent</strong> benefit to all factions, ready to cook your master plan right from the begining.<br/>- Room host have <strong>extensive controls</strong> (see below).<br/>- <strong>Faction evidences</strong> scatter around the map, enjoy the treasures hunter experience, <strong>burn</strong> or <strong>share</strong> evidences just as plan.<br/>- <strong>3D environment</strong> to show off your camera work.<br/>- Each room has their own <strong>light switch button</strong>, limit <strong>power hub</strong> to charge light.<br/>- Everyone can <strong>vote to return to waiting room safely</strong>, without remake a new room.<br/>- <strong>Player colors are fully customized</strong>, everyone can use a same color if need.<br/>- <strong>Voice chat</strong>.<br/><br/><br/><br/><strong>Factions:</strong><br/>- Each player belongs to 1 faction when a game starts. There are special talents which <strong>CHANGES faction</strong> of a player.<br/><br/><strong>Symbols of Hope</strong><br/>- The ultimate <strong>good faction</strong>.<br/>- Objective: Overthrow Symbols of Despair.<br/><br/><strong>Symbols of Despair</strong><br/>- The <strong>lose at the end faction</strong>.<br/>- There are 2 rank: Senior, Ultimate. Each rank gives players additional talents.<br/>- Objective: Overthrow Symbols of Hope.<br/><br/><strong>Symbols of Chaos</strong><br/>- The <strong>****</strong> faction.<br/>- Objective: Get voted out.<br/><br/><strong>Chaos Slayer</strong><br/>- The <strong>meme faction</strong>.<br/>- Objective: Personally slay exactly 1 member of each of faction: Hope, Despair, Chaos.<br/><br/><br/><br/><strong>Talents:</strong><br/>- Host of a room can fully customize the talents pool, all assassins or all fashion models as you wish.<br/>- Host can config to play with <strong>Talentless pool, everyone has no talent</strong>.<br/>- Each player possesses 1 talent when a game starts.<br/>- Each talent gives players a way to be different, a chance to role play, a challenge to actually win.<br/><br/><strong>Talents list (update to newest version):</strong><br/>- Talentless, Plumber, Assassin, Engineer, Scout, Bartender, Doctor, Streamer, Lawyer, Fashion Model, Runner, Dreamer.<br/>- Luck talent is not available and under research.<br/><br/><br/><br/>Only Room host has these <strong>powers</strong> !<br/>- <strong>Kick a player</strong> out of room, no question ask.<br/>- Make <strong>Entrance Test</strong> to filter compatible players against the host.<br/>- Config <strong>Force premade name</strong> to manage game environment.<br/>- Config <strong>Talents pool</strong>, all lawyers or all doctors as you wish.<br/>- Other features...", "metacritic": null, "released": "2021-11-07", "tba": false, "updated": "2021-11-08T03:25:29", "background_image": "https://media.rawg.io/media/screenshots/96a/96a501589317d4793be83a6dab51f45f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 123, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Nguyen Trong Khanh"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Nguyen Trong Khanh"], "esrb_rating": null}