{"id": 690748, "slug": "solitaire-ted-and-pet", "name": "Solitaire TED and PET", "name_original": "Solitaire TED and PET", "description": "Now's the perfect chance to head back in time with your fellow courageous travellers! Behold the wonderous world of the Jurassic period along with its main inhabitant: the T-rex! Many tough layouts await you ahead, but we know you can handle them all!<br/>\r\nCheck out 12 unforgettable time periods and earn tons of memorable trophies! Get several hours of enthralling gameplay from levels of varying difficulty. Unique gold cards make things even more fun!<br/>\r\nComplete each and every Solitaire layout to travel through time and make it back home to the future! Get your thrills with Solitaire. Ted and P.E.T.!<br/>\r\nThis game is for people who enjoy card games as spider solitaire, pyramid, hearts, klondike, free cell, crescent, golf, addiction, three peaks, yukon, forty thieves, scorpion, gaps, canfield, crazy quilt, algerian, montana, eight off, calculation, clock solitaire. But regardless of the type, solitaire is an age-old game that never loses its flavor!<br/>\n<br/>\r\n- Increase your endurance and finish every layout!<br/>\r\n- Solitaire card game – collect chains of cards!<br/>\r\n- Exciting levels that are sure to hold your interest!<br/>\r\n- Vivid graphics on each level!<br/>\r\n- Get rid of cards faster with jokers, and increase the combo multiplier to earn more coins!<br/>\r\n- Remove cards faster to increase your combo multiplier and get more coins!<br/>\r\n- For daring players – special tasks and over 15 colorful trophies!<br/>\r\n- Original themed decks and 12 card back styles!<br/>\r\n- Hours of fun guaranteed!", "metacritic": null, "released": "2021-11-05", "tba": false, "updated": "2021-11-08T03:08:23", "background_image": "https://media.rawg.io/media/screenshots/a43/a43721efc0e6dc6f75ede86d80bd1731.jpg", "website": "https://www.facebook.com/8FloorGames/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 6}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 286, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Somer Games"], "genres": ["Casual"], "publishers": ["8Floor"], "esrb_rating": null}