{"id": 690727, "slug": "lets-build-a-zoo", "name": "Let's Build a Zoo", "name_original": "Let's Build a Zoo", "description": "It's time to build a zoo! Let out your wild side, and create your own animal empire with this cute, expansive management sim. Import and breed rare creatures, hire the right staff, keep your visitors happy, and deal with plenty of weird and wonderful events. Then try your hand at DNA Splicing, and stitch together over 300,000 different types of animal, ranging from the majestic Giraffephant to the peaceful PandOwl!<br/><br/><br/><ul><li>Build your own zoo with over 500 different animals at your disposal, then splice together over 300,000 different animal combinations<br/></li><li>Keep your animals and your visitors happy, with hundreds of buildings, foliage, path and enclosure decorations<br/></li><li>Hire the perfect employees to deal with a variety of life events <br/></li><li>Control everything that happens in your park, from what your animals eat to what eats your animals...<br/></li><li>Decide whether you want to run your Zoo above board... or break the law and pocket the extra cash</li></ul><br/><strong>Let's Build a Zoo</strong> lets you import a variety of animals from other Zoos around the world! Breed your animals and start families to expand your wildlife and fill your enclosures. But if that doesn't suit you... you could just create animals instead! With DNA splicing at your finger tips, you have the power to bind together over 300,000 different types of animal, creating monstrosities and oddities as you go! Ever wondered what a ChicKaka would look like? Now you can find out!<br/><br/>", "metacritic": null, "released": "2021-11-05", "tba": false, "updated": "2023-11-10T10:27:32", "background_image": "https://media.rawg.io/media/screenshots/399/3998fc3dac9da097c980680464e1eeee.jpg", "website": "http://letsbuildazoo.com", "rating": 3.48, "rating_top": 4, "added_by_status": {"yet": 6, "owned": 287, "beaten": 2, "toplay": 14, "dropped": 17, "playing": 3}, "playtime": 5, "achievements_count": 84, "ratings_count": 23, "suggestions_count": 301, "game_series_count": 0, "reviews_count": 23, "platforms": ["PC"], "developers": ["Springloaded"], "genres": ["Strategy", "Simulation"], "publishers": ["No More Robots"], "esrb_rating": null}