{"id": 690731, "slug": "aeternum-quest", "name": "Aeternum Quest", "name_original": "Aeternum Quest", "description": "In the beginning before the universe being even born was four main powers that ruled everything... The Fire, the Thunder, the Wind and the Ice... These four elemental powers were given to this universe to balance the world... Born from these power came the gems... Four mystical gems that would represent each of the powers that were given to the world... A Ruby, an opal,  an emerald and a sapphire...<br/><br/>Mankind thirsty for power, fused these gems into the Aeternum Gem, a gem so powerful that anyone that would own the gem with the knowledge to use it could rule not only this world but the entire universe... In fear that this tragic fate would ever occur, the first united kingdom heads decided to shatter the gem back into their four respective pieces and hide them around the kingdom to be never seen again...<br/><br/>Thousand years passed and mankind now wants the power of the gem back... They created an academy that would form wizards with power to use the gem's energy... Your father was one of the best gems user... You want to follow in his footstep and learn the secrets that the gems holds... A long journey is waiting for you...<br/><br/>This game is a turn-based JRPG made with the Smile Game Builder engine. This game is based on the principles of Quest 64, Holy Magic Century or Eltale Monsters ( エルテイル モンスターズ ). We have tried to create a spiritual successor that would keep a good part of the original game mechanics while bringing new elements in terms of game-play. As this game is made using SGB we wasn't able to bring back the original combat system. One new mechanic is the Capture/Summon mechanic. This new game-play element enable the player to capture monsters they encounter to summon them in battle as an ally.<br/><br/><br/><br/>We strongly recommend to play the game with a controller but It is entirely possible to play with the keyboard due to the fact that the camera automatically follow you when using the run button.<br/><br/><br/><br/>The game has been made entirely with the Smile Game Builder engine and as not been exported to Unity to customize it in any way! So this game is an example of what you can do with the SGB engine without any knowledge of programming whatsoever! Keep in mind when playing that this engine as some limitation...<br/>", "metacritic": null, "released": "2021-11-04", "tba": false, "updated": "2021-11-08T02:54:38", "background_image": "https://media.rawg.io/media/screenshots/900/90074e25457894708a49041f03d1322e.jpg", "website": "http://www.wathitdew.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 176, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Wathitdew Record"], "genres": ["Adventure", "RPG"], "publishers": ["Wathitdew Record"], "esrb_rating": null}