{"id": 690801, "slug": "artech-war-game-bundle", "name": "Artech War Game Bundle", "name_original": "Artech War Game Bundle", "description": "Original developers Artech Digital Entertainment brought gamers into the fray with these three immersive war titles which you can now experience for yourself. Dive deep below the sea using German submarines in Das Boot: German U-Boat Simulation, dogfight with the best fighter pilots of WWI in Blue Max: Aces of the Great War and command your troops across battlefields of all eras in Theatre of War. Return to the world of historical battle simulators with the Artech War Game Bundle.<br/>\n<br/>\nThis bundle includes 3 iconic arcade games from Artech Digital Entertainment:\n<ul>\n<li>Das Boot: German U-Boat Simulation - Provides an exact replica of submarine warfare during World War II. Originally published by Artech Digital Entertainment in 1990, Das Boot puts you in the command of a 1941-era Type VII U-Boat, deep under the icy waters of the Atlantic.</li>\n<li>Blue Max: Aces of the Great War - The “Pour le Merite” or Blue Max fighter pilots were something to be both admired and feared. An award given to the best German pilots of World War I, if you ended up in the sights of a Blue Max plane, you knew your flying days were over.</li>\n<li>Theatre of War - The rolling hills of the battlefield lay before you as you carefully move your units into position. The clock is ticking, and the enemy is already attacking the vulnerable city near the center of the board with bomber units. Will you pull off your attack and annihilate the enemy? Or will you be outsmarted by your cunning opponent?</li>\n</ul>", "metacritic": null, "released": "2021-11-04", "tba": false, "updated": "2021-11-08T03:45:38", "background_image": "https://media.rawg.io/media/screenshots/3a2/3a29fd6b51e3fe4f4555e3cf3d38cb2b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 163, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Artech Digital Entertainment"], "genres": [], "publishers": ["Ziggurat Interactive"], "esrb_rating": null}