{"id": 690818, "slug": "mamoball-2d-multiplayer-soccer", "name": "MamoBall 2D Multiplayer Soccer", "name_original": "MamoBall 2D Multiplayer Soccer", "description": "MamoBall - 2D Multiplayer Soccer is a unique multi-player online soccer game to play with friends. It is an extremely addictive and fun soccer game that will never let you get bored. You play soccer with other online gamers like you in the MamoBall league.<br/><br/>The “MamoBall - 2D Multiplayer Soccer” game tests your futsal/football/soccer skills to test along with your reflexes. While playing with other online players globally, you keep improving your skills and getting better. This soccer game is about strategy. The bouncing soccer ball will puzzle you and mess your head around. The gameplay is in your hands and you need to control the soccer ball to make sure that it hits your goal-post and also avoid the opponent’s soccer ball to reach their goal. <br/><br/>****************<br/>FEATURES<br/>****************<br/>Still looking for features that make “MamoBall - 2D Multiplayer Soccer” the best online multi-player soccer game? Here are features of the app that make it incredible - <br/>-\tBeautiful gameplay that is a mix of football and air-hockey<br/>-\tSimple game controls<br/>-\tAmazing gameplay sounds<br/>-\tMulti-player game with 2 teams to play with<br/>-\tInvite your friends to join and play with them online<br/>-\tJoin other soccer leagues or create your own league (for future)<br/><br/>All these features on the “MamoBall - 2D Multiplayer Soccer” are available for free. So, what are you waiting for? Put up all your gaming skills and focus to score the maximum points and get yourself into the leader board. Gear up! Play, Score and challenge your friends to beat up your score.<br/><br/><br/>****************<br/>SAY HELLO<br/>****************<br/>We are constantly working hard on making the “MamoBall - 2D Multiplayer Soccer” game better and more entertaining for you. We need your constant support to get going. Please feel free to email us for any queries/suggestions/problems or if you just want to say hi. We would love to hear from you. If you have enjoyed any feature of the “MamoBall - 2D Multiplayer Soccer” app, do rate us on play store. Tell your friends if you have enjoyed any feature of the “MamoBall - 2D Multiplayer Soccer” app.", "metacritic": null, "released": "2019-11-06", "tba": false, "updated": "2021-11-08T03:55:30", "background_image": "https://media.rawg.io/media/screenshots/9b5/9b532e9e60869037061df05bce471f51.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 50, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Alberun Technology"], "genres": ["Sports"], "publishers": ["ALBERUN TEKNOLOJI SANAYI VE TICARET LIMITED SIRKETI"], "esrb_rating": "Everyone 10+"}