{"id": 690825, "slug": "tales-of-luminaria-anime-rpg", "name": "Tales of Luminaria - Anime RPG", "name_original": "Tales of Luminaria - Anime RPG", "description": "Tales of Luminaria is a new Tales anime RPG game for mobile!<br/>You can enjoy a high-quality anime RPG game with 21 protagonists.<br/>Find your favorite character and explore the world of Tales together!<br/><br/>●Recommended for people who:<br/>-Want to play an epic anime RPG with an intricate storyline set in a fantasy world.<br/>-Have played RPG games from the Tales series.<br/>-Love Japanese anime and games and are looking for a new Japanese RPG.<br/>-Are searching for a 3D action RPG and adventure RPG.<br/>-Want to play an anime RPG game that has many attractive characters.<br/>-Play MMORPGs and online RPGs.<br/>-Want to play an action RPG and a 3d RPG.<br/>-Enjoy beautiful graphics and anime images in RPG games.<br/>-Want to play an anime adventure RPG that they can enjoy with friends in multiplayer battles.<br/>-Want to play a high-quality anime RPG.<br/>-Love Japanese manga and anime games.<br/><br/>●The Story of Tales of Luminaria<br/>Each of the 21 protagonists has a different purpose and distinct storyline in which they must follow the path they believe in. Despite frustrating challenges, they grow steadily, and confront them strongly!<br/>Choose a protagonist and help them survive this turbulent world with utmost concentration ! You will also meet various characters you have never seen before, yet grow to love them deeply!<br/><br/>●Worldview<br/>In this world, prosperity is built by the “Mana” produced by the mysterious giant life form“ Primordial Beasts” that transcends human knowledge. The Federation, regards Primordial Beasts as sacred and emphasizes coexistence with nature, while the Empire depends on Primordial Beasts as energy source to develop their technology and civilization.<br/><br/>Through this battle of conflicting ideas of justice, the thoughts of both enemies and friends are shown from various angles!<br/><br/>●Action<br/>With cell graphic-like visuals that coexist with profoundness and beauty, such as a map with a sense of depth and atmosphere, you can freely explore a vast and alluring location! The game sequence has been designed to ensure that battles and events proceed seamlessly and at a good pace. Basic Attack /Technique/ Secret Mystery can be activated by tapping and flicking. Each action and operation system has its own characteristics, expressing the characters’ individuality!<br/><br/>【Tales of Luminaria Official site】<br/>https://luminaria-en.tales-ch.jp/<br/><br/>【Tales of Luminaria Official Twitter】<br/>https://twitter.com/to_luminaria_en<br/><br/>BANDAI NAMCO Entertainment Inc. Website:<br/>https://bandainamcoent.co.jp/english/<br/><br/>By downloading or installing this app, you agree to the BANDAI NAMCO Entertainment Terms of Service.<br/><br/>Terms of Service:<br/>https://legal.bandainamcoent.co.jp/terms/<br/><br/>Privacy Policy:<br/>https://legal.bandainamcoent.co.jp/privacy/<br/><br/>Note:<br/>This game contains some items available for in-app purchase that can enhance gameplay and speed up your progress. In-app purchases can be disabled in your device settings, see https://support.apple.com/en-us/HT201304 for more details.", "metacritic": null, "released": "2021-11-05", "tba": false, "updated": "2021-11-08T03:59:58", "background_image": "https://media.rawg.io/media/screenshots/f6a/f6aec8e8b2fe2cf5c6624e62ec71d7cf.jpg", "website": "https://luminaria.tales-ch.jp/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 444, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Bandai Namco Entertainment"], "genres": ["Action", "RPG"], "publishers": ["Bandai Namco Entertainment"], "esrb_rating": "Teen"}