{"id": 690840, "slug": "farmville-3-animals", "name": "FarmVille 3 - Animals", "name_original": "FarmVille 3 - Animals", "description": "Start your own animal farm from the ground up by breeding and building a thriving farm! You build the farm and decide which baby animals to raise and breed. You choose which animal habitats to renovate and where to expand your farm. It's up to you to build the biggest, most impressive animal farm for breeding and farming in all the village. Enjoy the latest in a line of amazing farm games and harvest games from Zynga!<br/><br/>• Become a master farmer in this harvest game as you make your own animal collection, choosing from hundreds of types, including specialty breeds like Alpacas. Each animal breed gives you a unique farm good, such as milk, eggs or wool, that you can sell, trade, or use to complete orders and improve your farm crops from day to day. These farm goods can be anything, ranging from a saddle, to cream, bacon, mushrooms, sheep milk, fine feather, horse hair, or buffalo milk! <br/><br/>• Match and mate your animals to raise baby animals and discover new breeds, like a Steinbacher Goose, Emu, Tudanca Cow, Blue Peacock, American Guinea Hog, Bourbon Turkey, or a Scarlet Macaw! In this farming game for free, each new breed produces rare farm goods to help my farm grow!<br/><br/>• Raise all your favorite and exotic animals, including an Embden Goose, Shorthorn Cow, Brown Alpaca, Flame Llama, Hedgehog, Red Squirrel, and American Painted Horse! <br/><br/>• Customize and design your family ranch home with hundreds of unique decorations, building styles, farmhands’ outfits, and more for you, your Farmhands, and your baby animals to enjoy. Your adventure is entirely for you to customize! <br/><br/>• Use the weather to improve your farm. Check the forecast in this harvest game for perfect farming weather and plan for a healthy harvest of hay, crops, and more.<br/><br/>• Make your own baked goods to sell, including Bread, Carrot Cake, Apple Pie, Mushroom Pizza, Tuna Casserole, Seafood Paella, and much more! <br/><br/>• In this free farming game, build a team of specialised Farmhands, ranging from heavy-duty lumberjacks to talented cooks to help your farmhouse. Level them up to unlock new skills and recipes and improve their farming abilities.<br/><br/>• Expand your world with exotic breeds, such as a Brown Bear, Polar Bear, Penguin, Red Kangaroo, Arctic Fox, Fennec Fox, Red Fox, Red Panda, Grey Wolf, Black Wolf, Bog Turtle, Black Marsh Turtle, Brown Kangaroo, Skunk, Tibentian Sand Fox, Macaroni Penguin, Alligator Snapping Turtle, and Elephant! <br/><br/>• Join a Co-Op and complete special events to unlock new farm animals and special items to help progress in this free farm game. <br/><br/>Come build an animal farm with unique breeds of baby animals in this free game. Enjoy complimentary building, breeding animals and farming, for no charge!<br/><br/><br/>Play FarmVille 3, the latest of farm animal games from Zynga games, following FarmVille 1, FarmVille 2, FarmVille 2: Country Escape, and FarmVille 2: Tropic Escape.<br/><br/>• Use of this application is governed by the Zynga Terms of Service. These Terms are available through the License Agreement field below, and at http://m.zynga.com/legal/terms-of-service.<br/>• For specific information about how Zynga collects and uses personal or other data, please read our privacy policy at http://m.zynga.com/privacy/policy. Zynga’s Privacy Policy is also available through the Privacy Policy field below.<br/>• The game is free to play, however in-app purchases are available for additional content and premium currency.<br/>• This game does permit a user to connect to social networks, such as Facebook, and as such players may come into contact with other people when playing this game. Social Networking Service terms may also apply.", "metacritic": null, "released": null, "tba": false, "updated": "2021-11-08T04:10:41", "background_image": "https://media.rawg.io/media/screenshots/b86/b86dbcf5482cdcf99da78e00d57bb9d7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 191, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Zynga"], "genres": ["Simulation"], "publishers": [], "esrb_rating": "Everyone"}