{"id": 690979, "slug": "tarte-au-quetsche-rpg", "name": "Tarte au quetsche RPG", "name_original": "Tarte au quetsche RPG", "description": "<p><strong>Jeu fait pour la VGLab jam, utilisez les touches fléchées ou le stick analogique pour jouer. Pas de sons, j'ai pas eu le temps, désolé. Si vous le testez, jouez y au moins deux fois!</strong></p>\n<p>Ma décision pour correspondre au thème, arcade, était de proposer un jeu à la durée de vie assez courte, entièrement jouable au stick, comme à l'époque.</p>\n<p>Bien que mes autres jeux ont une difficulté assez élevée, correspondant probablement plus au standards de l'arcade, j'ai décidé que, pour une fois, j'allais faire un jeu avec plusieurs modes de difficulté. La difficulté \"arcade\" est donc représentée par le personnage avec un seul point de vie, et le jeu à était conçu avec lui en tête, et testé avec lui.</p>\n<p>---------------------------------------------------------------------------------------------</p>\n<p>------------------------------TARTE AU QUETSCHE RPG------------------------------</p>\n<p>---------------avec des vrais morceaux de peintures de Dali dedans!---------------</p>\n<p>---------------------------------------------------------------------------------------------<br/><br/>SYNOPSIS:<br/>Le petit Antoine était bien malade, et sa tante, celle qui fait des pizza aux poivrons, est venu en bateau le chercher pour le ramener chez elle en Italie le temps que ses parents travaillent. Malheureusement pour lui, elle n'avais pas prise avec elle les fameux bonbons de la Ligurie dont il raffole tant. C'est pour cela que, quand elle lui fit la bise pour lui dire bonjour, Antoine était tout bougon.<br/><br/>Réalisé sans trucage.<br/><br/></p>\n<p><em>Tarte au quetsche RPG est un jeu qui n'as rien à voir, ni avec la taille des scaphandre, ni avec le choc des mots, ni avec le poids des photos, et encore moins avec le poids des regrets.</em></p>", "metacritic": null, "released": "2021-11-07", "tba": false, "updated": "2021-11-08T04:42:07", "background_image": "https://media.rawg.io/media/screenshots/966/96610f0f2fdd1fa6bf66ef6c68a503f7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MarionLAsticot"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}