{"id": 690943, "slug": "la-desolation-darcadia", "name": "La Désolation d'Arcadia", "name_original": "La Désolation d'Arcadia", "description": "La Désolation d'Arcadia\r\nDescription\r\n<p>Pour le thème \"arcade\", le jeu cherche à couvrir les points suivants (cf. Wikipédia pour les termes):</p>\n<ul><li>Niveaux très courts;</li><li>Mécanismes de contrôle intuitifs et simples;</li><li>\"Le débordement du joueur par le jeu\"</li><li>Court temps de prise en main</li><li>Courbe d'apprentissage facile</li> </ul>\n<p>Le jeu est constitué de trois modes de jeux dont la difficulté augmentent plus le score est élevé:<br/></p>\n<ul><li>Un gameplay mobile, où l'héroïne attaque au corps à corps avec son épée: l'héroïne se déplace avec les flèches directionnelles gauche et droite. Elle peut attaquer avec la flèche directionnelle haute.</li><li>Un gameplay fixe, où l'héroïne attaque à distance avec un pistolet: les ennemis arrivent sur trois chemins prédéterminés. L'héroïne peut attaquer en s'orientant sur l'un des chemin en utilisant les flèches directionnelles.</li><li>Un gameplay mobile à moto, où l'héroïne doit éviter les obstacles qui viennent sur elle. Elle n'attaque pas les ennemis. Elle ne fait que les éviter.</li></ul>\n<p>L'aboutissement logique est constitué de vagues d'ennemis trop importantes à gérer. Et bien sûr l'affichage du HighScore.<br/></p>\r\nRetour sur la GameJam\r\n<p>Trop de choses à faire à une seule personne ! <br/></p>\n<p>Cela étant dit, tout les assets sont faits maison (ça se voit...).<br/></p>\n<p>Ce que je retiens surtout de cette Jam, c'est de m'avoir exercé aux animations. Elles sont faites maison donc elles sont horribles, qu'on ne se le cache pas! Mais elles ont le mérite d'exister.  Les keyframes se sont mélangées de toute part sur les exports, c'est catastrophique.. (On ne mentionnera pas le cou et les épaules pendant la phase de tir). Il faut que je définisse un meilleur workflow pour ça...</p>\n<p>Sur cette version prête pour la soumission à la Jam, je n'ai eu le temps de couvrir:</p>\n<ul><li>La mise en situation de l’héroïne. Je souhaitais au moins mettre un dialogue de départ…;</li><li>Le design du Menu (Celui actuel c'est du bricolage de dernière minute);</li><li>Les musiques (Celle présente n'aurait dû être que celle du menu);</li><li>Un design d'ennemi spécifique à chaque phase;</li><li>L'attaque spéciale. Elle est d'ailleurs implémentée dans cette première version, si jamais! Je n'ai juste pas eu le temps d'implémenter sa barre de charge dans l'UI...</li><li>Travail sur l'environnement et les textures;</li><li>etc.</li></ul>\n<p><strong>A noter sur la version Jam :</strong> Parfois aucun ennemi n'apparaît sur le phase de combat à l'épée... Aucune idée pourquoi. ça semble aléatoire et ce sont les mêmes objets qui font apparaitre les ennemis sur les autres phases... C'est obscur. A investiguer.<br/></p>\n<p>Je publierai très certainement une version post-jam, pour couvrir les éléments pour lesquels le temps m'a manqué.<br/></p>", "metacritic": null, "released": "2021-11-08", "tba": false, "updated": "2021-11-08T04:34:59", "background_image": "https://media.rawg.io/media/screenshots/c74/c745ccb2def9b3a4cac0f25ac3abd65a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 17, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Aos Sí"], "genres": ["Action"], "publishers": [], "esrb_rating": null}