{"id": 691127, "slug": "chimera-force", "name": "Chimera Force", "name_original": "Chimera Force", "description": "<p>Half a century ago, there was an alien invasion. Unlike science fiction movies, there wasn’t anyone who saved the day. Multi-species allied forces from the stars occupied Earth and built countless ecosystems on its surface to accommodate members of the allied forces with different biological habits. From that day on, Native Earthlings started to accept the fact that they were no longer the only intelligent race on the entire planet.</p>\n<p>However, the regime symbolized by the Core City is not as indestructible as it is. The dissolution of the human government did not extinguish the resistance movement. Human beings that cannot tolerate aliens have moved underground to continue their war. At the same time, the various intelligent species within the Alliance is engaged in open and secret political struggle.</p>\n<p>Alliance occupation forces realize they need stable capital to achieve internal stabilization, and maintenance their ruling. They cannot govern a prosperous and diverse Earth without human assistance. Therefore, Alliance has absorbed humans into the alien alliance and established a law enforcement force to deal with the complex extraterrestrial tensions between multiple species in Core City. This multi-species law enforcement force was named \"<strong>Chimera</strong>\".<br/></p>\n<p><strong>Written and Designed by: David Liao &amp; Logan Kornota</strong><br/></p>", "metacritic": null, "released": "2021-11-07", "tba": false, "updated": "2021-11-08T05:20:17", "background_image": "https://media.rawg.io/media/screenshots/a3d/a3dccd32de4d497392beede5769910bf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 42, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["David Liao"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}