{"id": 691180, "slug": "minesweeper-but-with-cats", "name": "Minesweeper but with Cats", "name_original": "Minesweeper but with Cats", "description": "<p>Minesweeper but with Cats is a twist on classic Minesweeper where a unique cat picture is chosen as the background image each game, which you slowly uncover as you clear the board. It also comes with all the \"standard\" features you'd expect from a Minesweeper game: easy, normal, and hard difficulty modes, custom board sizes, and stats tracking, plus 4 different theme options. </p>\n<p>Some important things to know about how it works: When the game is first started it will visit the r/cats subreddit and download all the images it finds in the 50 most recent posts. These will be saved in a folder called \"cats\" that will be automatically generated by the program. Once it has finished a popup will appear letting you know it's done. After this initial pull you should never have to wait again since it will refresh silently in the background for you when it gets low, but not empty. </p>\n<p>You can include personal pictures of your own pets if you'd like by simply putting them into this folder yourself. It only works with .png and .jpg files though. </p>\n<p>Once a game has been won, the image you uncovered will be moved out of the cats folder and into another folder called \"completed\". The game will also save an extra copy next to the application called recent so it's easy to find. Recent will be overwritten the next time you win a game, but the original image will always be safe inside of the completed folder. </p>\n<p>Lastly, \"Offline Mode\" will disable this downloading step in case you don't want it to or don't have an internet connection or something. Offline Mode will also disable the removal of images from the cats folder to avoid running out.</p>\n<p>The source code for the game can be found on this github page if you wanted to check it out. </p>", "metacritic": null, "released": "2021-11-07", "tba": false, "updated": "2021-11-08T05:31:45", "background_image": "https://media.rawg.io/media/screenshots/634/634c8f67e2b1ea33cef15c623f5d3712.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 84, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Xaklor"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}