{"id": 691218, "slug": "ufo-pete-ainsworth", "name": "UFO (Pete Ainsworth)", "name_original": "UFO (Pete Ainsworth)", "description": "<p>Planet Earth is in a  right mess, and the Ovisarian Empire has had enough of it. So you've been sent to Earth in your UFO to abduct as many sheep as you can and free them from the tyrannical human race. The problem is that the human's aren't too happy with you taking away their source of lamb chops, so you best be prepared for battle!\r\n</p>\n<p>UFO is a Defender inspired 2d action arcade game where you play the role of a flying saucer commander that has to capture sheep, rescue fellow aliens and avoid being destroyed by the foolish Earthlings!</p>\n\n<p><strong>Basic instructions:</strong></p>\n<p>To complete each level you must collect all the sheep in the level. Once you have done this you are free to destroy all of the enemies to clear the level. If you try to kill all of the enemies before you have cleared all the sheep, the enemies will respawn.</p>\n<p>Collecting sheep will also give you a health boost if your UFO is damaged, and rescuing aliens will give you energy to recharge your plasma bomb reserves.</p>\n<p><strong>Radar:</strong></p>\n\n<p>The radar sits at the top of the screen and shows you the position of enemies, radar towers, sheep and aliens. The slowly filling bar that goes from green to red below the radar is your radar lock meter. This fills up based on how many radar towers are in the level, and can be reduced by destroy them. If you destroy all of the radar towers in the level, the radar lock will reduce to zero, but it will continue to fill at a slow rate afterward.</p>\n<p><strong>Radar colours:</strong></p>\n<p>Different objects are marked by a corresponding colour on the radar.</p>\n<p><strong>Enemies:</strong></p>\n<p>Tanks and Gunships = Blue.</p>\n<p>Mine Dropper Gunship = Green.</p>\n<p>Hover Drones and Swarmers = Yellow.</p>\n<p>Radar Bases = Flashing Yellow/White.</p>\n<p>Radar Tanks = Red.</p>\n<p>Catchers and Power Tanks = Purple.</p>\n<p>Missile and other weapons = Flashing Red/Orange.</p>\n<p>Objects to collect:</p>\n<p>Sheep = White.</p>\n<p>Aliens = Flashing Blue/White.</p>\n<p><strong>Flying your UFO:</strong></p>\n\n<p>To give the player as much vision ahead of their UFO, so as to avoid flying into enemies and other objects that you can't see, the UFO has been made to move to the opposite side of the screen to the direction of travel. So, if you're moving to the left, the UFO will move to the right hand side of the screen to give you a better view of enemies moving in from the left, and if you're moving to the right, the UFO will move to the left hand side of the screen to give you a better view of enemies moving in from the right.</p>\n<p>This may feel a little strange at first, so level 1 of the game has been made especially easy, with only a small number of enemies, so that you can get to grips with the UFO movement before tackling the later levels.</p>\n<p>TIP: Look at the ground to see your direction of travel, not the UFO.</p>\n<p><strong>Controls:</strong></p>\n<p>The game is designed to be played with an Xbox360 style gamepad.</p>\n<p><strong>The controls are:</strong></p>\n<p>Left Analog L/R = Move Left/Right</p>\n<p>Left Analog U/D = Move Up/Down</p>\n<p>X = Drop Plasma Bombs</p>\n<p>A = Fire Laser</p>\n<p>B = Engage Tractor Beam</p>\n<p>Start = Pause <br/>Select = Quit.</p>\n<p>There are also keyboard controls for people without a gamepad.</p>\n<p>Left Arrow = Move Left</p>\n<p>Right Arrow = Move Right</p>\n<p>Up Arrow = Move Up</p>\n<p>Down Arrow = Move Down</p>\n<p>N = Drop Plasma Bombs</p>\n<p>Space = Fire Laser</p>\n<p>B = Engage Tractor Beam</p>\n<p>P = Pause</p>\n<p>Esc = Quit</p>\n<p>To start the game from the title screen, press ENTER.</p>\n<p><strong>FEEDBACK:</strong></p>\n<p>If you have any comments, suggestions, want to report bugs, or just want to say hi, drop a comment in the box below. I'm always happy to hear from anyone who plays my games.</p>", "metacritic": null, "released": "2021-11-07", "tba": false, "updated": "2021-11-08T05:40:11", "background_image": "https://media.rawg.io/media/screenshots/964/9648333f5d50611ab87b797889a90343.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 145, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Pete Ainsworth"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}