{"id": 691303, "slug": "that-day-when", "name": "THAT DAY WHEN", "name_original": "THAT DAY WHEN", "description": "<p><em><strong>ALERT:</strong> On November 7, 2021, at exactly 6:00 p.m., an unknown strange entity appeared over our heads. A strange glow swept across the planet, disabling our infrastructure. The world's superpowers immediately took action. Whatever we're dealing with, it's obvious it's not coming in peace. Energy beams have begun to beam down from space, clearly aimed at destroying our Earth. They must be eliminated. The red ones are devastating and they attack with them, but the green ones we can defend ourselves with... The world must unite and face a common enemy!</em></p>\n<p><em><strong>Are you prepared to face the unknown and defend your home?</strong></em></p>\n<p>-</p>\n<p><em><strong>VAROVÁNÍ: </strong>Dne 7. listopadu 2021, přesně v 18:00, se nad našimi hlavami zjevila neznámá podivná entita. Po celé naší planetě se prohnala zvláštní záře, jež vyřadila naši infrastrukturu. Světové velmoci okamžitě začaly konat. Ať už máme co do činění s čímkoli neznámým, je zřejmé, že nepřichází v míru. Z vesmíru se začaly snášet energetické paprsky, které mají evidentně za cíl zničit naši Zemi. Je nutno je eliminovat. Červené jsou zničující a útočí jimi, těmi zelenými se ovšem můžeme bránit… Svět se musí spojit a čelit společnému nepříteli! </em></p>\n<p><strong><em>Jste připraveni čelit neznámému a bránit svůj domov?</em></strong><br/></p>\n\n<p><strong>CONTROLS / OVLÁDÁNÍ :<br/></strong>Left Mouse Click – control the satellite<br/>Right Mouse Click – shoot</p>\n<p>Levé tlačítko myši – ovládání satelitu<br/>Pravé tlačítko myši – střelba</p>\n\n\n<p>A short <em>shoot 'em up</em> game by Daniel Šipoš, Jakub Kozelka, EarthstarMusic and Kristýna Sulková.</p>", "metacritic": null, "released": "2021-11-07", "tba": false, "updated": "2021-11-08T06:03:06", "background_image": "https://media.rawg.io/media/screenshots/cd7/cd7681442f7f99ec668c89715cd2395b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 183, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["kristyna.sulkova", "EarthstarMusic", "Jakub Kozelka", "daniel.sipos"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}