{"id": 691570, "slug": "cold-harvest", "name": "Cold Harvest (itch)", "name_original": "Cold Harvest (itch)", "description": "<p>A few weeks before Christmas, the main character Robert (NEET)* finds a flyer under the door with an invitation to work - for which it turns out to be paid good money. Experiencing financial difficulties, the hero overcomes his fears and goes to the streets of the city to get an interview. Following to his goal through the park, he meets a girl who awakens what he has been hiding from for the past three years (uncontrollable erection).</p>\n<p>Despite the difficulties on the way, the hero still gets a job as a courier. Fulfilling the first order, he opens up a 100% way of seducing girls and soon Robert completely surrenders to lust, using the method of seduction on the girls he likes.</p>\n<p>For a while, he is doing well, until one morning, he discovers growing horns on his head.</p>\n\n<p>Cold Harvest combines visual novel with adventure, dating, and a world to explore. Visually, the game looks like an interactive comic strip (black and white manga) with colored elements and chapters.</p>\n<ul><li>free movement around the world</li><li>interaction with characters and objects</li><li>the change of night and day</li><li>transfer of objects between locations</li><li>solving riddles and puzzles</li><li>dynamically developing plot</li><li>mini games built into the gameplay</li><li>romantic relationships with many girls</li><li>horror and action scenes</li><li>Christmas atmosphere</li></ul>\n<p>In the game, you can play for different minor characters whose storylines run parallel to the main story, this will allow you to get to know them better, and in some cases save their lives. The player will often have to choose which of the secondary characters will survive and get to the finale. Also, the game provides several endings that will allow you, if you wish, to go through the game again and end it differently.</p>\n<p>* NEET, an acronym for \"Not in Education, Employment, or Training\", refers to a person who is unemployed and not receiving an education or vocational training.</p>", "metacritic": null, "released": "2021-11-07", "tba": false, "updated": "2021-11-08T07:17:18", "background_image": "https://media.rawg.io/media/screenshots/efd/efdb53cf270592b7504c41f9407e36bb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 199, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["GrebotGames"], "genres": [], "publishers": [], "esrb_rating": null}