{"id": 691664, "slug": "nociception-1-voltaic-marketplace", "name": "Nociception 1 ~ Voltaic Marketplace", "name_original": "Nociception 1 ~ Voltaic Marketplace", "description": "<p>https://discord.gg/sUWtgHMRxd<br/></p>\n<p><em>https://twitter.com/EtherealAirport<br/></em></p>\n<p><em>“The Miracle” is an event that happened 500 years ago on the planet Commotion. It marks the day that the dead began coming back from their graves in strange new forms, and the knowledge of where people go when they die was no longer a mystery. Turns out people have become much too complex to send to either just heaven or hell when they die, so it was revealed that you will take a certain “death route” depending on how you lived and died.</em></p>\n<p><em>The Miracle Festival celebrates this special day and the beauty of the cycle of life and death. It happens all over the planet but the festival in Mordimane, the planet's densest city, is said to be the grandest of them all.\r\n</em></p>\n<p><em>This year, the festival started out great as usual but halfway through the day the air became very...Charged! No one could touch anything without getting a small shock and peoples hair was standing on end. Most don’t care much and are still enjoying the festival as normal, but a select few take off to see if they can find the cause of this phenomenon. Onward! </em>\n</p>\n<p>--------------------------------------------------------------------------------------------------</p>\n<p><strong>Here it is!! The demo for the next game in the Nociception series. </strong></p>\n<p><strong>Ive been working on this demo for a long time, I have come a long way from where i was skill-wise during Nocieption 0, but I still have a very, very long way to go as a game dev and programmer. As such, I hope you will forgive any jank in this game (though suggestions/advice welcome!!) </strong></p>\n<p><strong>Thank you to everyone that has given me helpful advice, encouragement, and support on this project thus far. Especially my wife Cakey, whos interest in my art stopped me from giving up years ago.</strong></p>\n<p><strong>A game by Ethereal Airport (Sawney Arnett)</strong></p>\n<p><strong>Featuring music by Pengosolvent and Princess Sylvysprit </strong></p>\n<p>(Full credits in the game folder. The full game will have a proper credits sequence!</p>\n<p>How to play: </p>\n<p>This plays like an average shmup/bullet hell, but with the edition of a \"Journal\", which you unlock pages to by getting your character close to enemies and bosses in opportune moments. In addition, getting close to enemies will raise your life and bombs meters, so be sure to get as many as you can! Each player will have 3 attacks for you to use, normal shot (Z button), bomb (X button), and focus shot (shift+Z). When you run out of lives, its game over! </p>", "metacritic": null, "released": "2021-11-07", "tba": false, "updated": "2021-11-08T07:38:29", "background_image": "https://media.rawg.io/media/screenshots/b35/b359cdaea45159b6c53e34982aa51d6a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 143, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ethereal airport"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}