{"id": 691704, "slug": "a-knights-heart", "name": "A Knights Heart", "name_original": "A Knights Heart", "description": "<em>They say every creature in Hollas has magic in them. It doesn't have to be too much, but there will always be just a bit inside even in the weakest people. You, on the other hand? You have no magic. Nada, nelch. No mana runs through your veins, no sparks glow from your hands. You are the only magic-less creature on the continent. So why is that you have visions of your death? </em>\n<p>A Knights Heart is a tale of you, a knight who is framed for the crime of summoning demons in a place where they should not have. As a result, you are executed...in your dreams, that is. Yes, you are not dead quite yet, but you know the details of what will happen. It's your job to not only save yourself from that tragic fate, but also serve as the personal knight of the prince of Fenia.</p>\n\n<p>Two kingdoms have ruled Hollas for centuries. To the south, the Kingdom of Fenia. To the north, the Kingdom of Vol. Neither particularly like each other and the plot begins when you, aged 16, are taken away from your home of Vol to become the prince of Fenia's new knight. Unfortunately, this has unforeseen consequences. \r\n</p>\n<p>It's up to you to deal with them and stop a war from brewing. Or inadvertently cause one. You hold the fate of two kingdoms in your hands; the ball is in your court. <br/></p>\n\n<p><strong>Prince Oran of Fenia</strong> <em>(M) (25)</em>: The heir to the kingdom of Fenia and the knight's boss. Calm and collected, he seems to fit the prince charming mold to a T...but really, he's just as hotblooded as his rival, Prince Oscar, is. This competitiveness has attracted a lot of fans towards him, but he has a case of vanishing without a trace in the presence of them. His love is warm and kind, never threatening nor overbearing.\r\n</p>\n<p><em>\"If I could repeat one moment forever...it would be this one, here with you.\"</em>\n</p>\n<p><strong>Rionna</strong> <em>(F) (29)</em>: A knight in service to Fenia, she's lived all her life training to get where she is. Well respected in the castle, she spends her reading and gardening, often times found in the kitchen making snacks for herself (she doesn't like to share). She is caring and calming, somewhat becoming a mother figure to other knights, the others simply falling for her instead. Her love is forgiving and compassionate, always and forever. \r\n</p>\n<p><em>\"No matter where you choose to go...you'll always be by my heart.\"</em>\n</p>\n<p><strong>Prince Oscar of Vol </strong><em>(M) (25)</em>: The heir to the kingdom of Vol and the knight's childhood rival/friend. Hot tempered and somewhat ill mannered, he nonetheless has a good heart on him and an open mind. However, one wrong move and he could be set on the path of destruction forever. His love is passionate and burning, sure to sweep you up in succession. If he were to be compared to a star, it would be the sun. \r\n</p>\n<p><em>\"I always knew you'd come back to me...why'd you take so long?!\"</em>\n</p>\n<p><strong>Lady Dahlia Evergreen</strong> <em>(F) (24)</em>: The daughter of a visiting noble...and the one who framed the knight. She's ambitious and cunning, only acting innocent to get things her way. Two faced as she is, there is a genuine to her that few get to see, her father included. Does she hold any ill will towards the knight? Or did she do what she had to do to get her way? Her love is deep and genuine, terrifying when faced at first, but warms into something loving.\r\n</p>\n<p>\"It seems I'm in love with you...well, you'll have to stay with me now, won't you?\"\r\n</p>\n<p><strong>Adrean</strong> <em>(Genderfluid, can be chosen as male or female)</em>: Oscar's summoned demon who is first introduced before the knight leaves for Fenia. They are ordered to protect the knight as best they can and soon end up attached for good. Teasing and slightly provocative, they find themselves delighted at everything Hollas has to offer...and angered at the misjustice caused to the knight. Their love is poetic and soft, never judging and always bright. \r\n</p>\n<p><em>\"We make a good team you and I...why don't we make it permanent~?\"</em>\n</p>\n<p><em>And one more RO will be hidden from sight for now~</em>\n</p>", "metacritic": null, "released": "2021-11-07", "tba": false, "updated": "2021-11-08T07:47:15", "background_image": "https://media.rawg.io/media/screenshots/ef8/ef88b8d95b0a1c96291433f8e7fd2649.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 46, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Mona"], "genres": [], "publishers": [], "esrb_rating": null}