{"id": 691707, "slug": "picohaven", "name": "PICOhaven", "name_original": "PICOhaven", "description": "Controls:\r\n<p>PICOhaven can be played with keyboard, on mobile (a virtual D-pad and two buttons will appear on-screen), or with a game controller:</p>\n<ul><li>Arrows: move</li><li>Z / 🅾️: main button (select, confirm, continue)</li><li>X / ❎: less used button: cancel, undo, or special (as prompted in UI)</li></ul>\r\nOverview:\r\n<p>PICOhaven is a small tactical card-based dungeon crawler / light solo RPG inspired by the board game Gloomhaven. It adopts a modified &amp; simplified version of the mechanics used in that game, to fit within the constraints of the PICO-8 'retro fantasy console'  (128x128 pixel resolution,  &lt;16kB code+data), and to streamline solo play.</p>\n<p><em>Note: This is just a free, solo-fan-made project and has no affiliation with Gloomhaven. If you like this type of game I recommend buying Gloomhaven (or its official video game adaptation) for a game with a lot of tactical depth from multi-character cooperative play!</em></p>\r\nGameplay: Quick Overview\r\n<p>(for those who like to jump straight in and figure it out as you go)</p>\n<p>You start the game with a \"deck\" of action cards that let you move, fight, heal, and take other actions. Using two different cards each turn, defeat enemies to advance the story and unlock new scenarios, as well as upgrades to your ability and modifier decks.</p>\n<p>You are 'exhausted' and fail a scenario if you take too much damage, or if your deck runs out of cards (each time through your deck you reshuffle the discarded cards to reuse them, but one random card is 'burned' and not available for the rest of the scenario). In addition, if you would take fatal damage but have cards in hand, you will also  'burn' a random card to avoid it, so beware: you have limited turns to win each scenario!</p>\n<p>The game should automatically save your progress after each scenario, success or failure, allowing you to come back to it later on the same device (you can retry the same scenario multiple times and earn XP even on failure).</p>\n<p>If you're not sure what happened in combat because a lot of text scrolled by quickly, at the end of any round you can press ❎ to scroll back through the message log.</p>\n<strong>(Click here for more Detailed Gameplay / Rules)</strong>\r\nGameplay: Detailed\r\n<p>PICOhaven is a small tactical turn-based dungeon crawler / light RPG. You win each scenario and unlock new ones by defeating all enemies in all rooms (unless otherwise specified) before you are exhausted.\r\n</p>\n<p>PICOhaven is <em>card-based</em> in that at the beginning of each round, you choose two action cards you'll use. These include Movement, Attacks, and other actions:\r\n</p>\n<p>After you select your cards, enemies will draw random action cards, and you will see an overview of what each character will do that round (the white numbers indicate the initiative: characters with lower numbers will act earlier).\r\n</p>\n<p>When it is your turn, you get to play these two actions (in either order)... or instead use either of them as a default \"move 2\" or \"attack 2\" action if that's more useful.\r\n</p>\n<p>At the end of the round, you discard those two action cards, and will have to choose different actions the next turn. When you've played through your entire deck, you will automatically 'short rest': you redraw your discard pile but randomly <strong>burn</strong> one of those cards, meaning you can no longer use it during this scenario. This means you have a finite number of rounds of play before your deck runs out of cards. Some more powerful cards are burned rather than discarded when you play them, so they can only be used once per scenario.\r\n</p>\n<p>You become <em>exhausted</em> and lose a scenario if you either run out of health (HP), or if you run out of cards in your deck.\r\n</p>\n<p>At the end of each scenario (success or failure), you return to town and all of your cards, HP, and items are restored, in preparation for your next adventure-- you can try any scenario as many times as needed. The game should automatically save your progress each time you return to town and allow you to return to it later (on the same device/browser-- data is saved locally).\r\n</p>\r\nAdditional Tips and Rules:\r\n<p>You will discover additional details, special cards, powers, items, and rules by playing, but if you prefer to read about them ahead of time, a few other notable rules:</p>\n<ul><li>You open a door by ending your movement on it. Monsters revealed in the next room will not act until the next round.\r\n</li><li>Your initiative in each round (how early or late you act relative to the monsters) is set by the initiative value of the <em>first</em> of the two cards you selected before the round (shown in a circle in the upper right corner of the card in the card-selection screen):\r\n</li></ul>\n\n<p>So even once you know what two cards you want to play this round, by choosing which card you select first in that 'choose cards' view, you can choose whether you will act earlier or later in the round. When your turn comes in the round, you can still choose to <em>play</em> those cards (or the default move 2 / attack 2 actions) in any order.\r\n</p>\n<ul><li>A \"burn when used\" card is only burned if you actually play it. If you select it as one of your two cards for the round, but when your turn comes you use a default Move 2 / Attack 2 action instead of playing it, that card is only discarded, and you'll have another chance to use it the next time you redraw your hand.\r\n</li><li>You collect treasure or coins by ending the turn on them (or by using certain cards or items). You do not <em>need</em> to collect treasure (and rarely will have enough time to collect all of it without running out of cards and failing a scenario), but it will eventually allow you to buy items that enhance your powers. Note that once you defeat the last enemy in a scenario (or achieve some other special scenario objective) the scenario is over and you return to town, so if you want to pick up treasure you have to do it before completing the scenario... that may not make sense fantasy-dungeon thematically :), but the game's balanced around only being able to afford a few items over the course of the entire campaign.\r\n</li><li>Whenever you attack, you draw a random <em>modifier card</em> from your deck of modifiers which is applied to the damage from your attack card. Most modifiers are -1, +0, or +1, but there are some that are larger, including a \"*2\" and a \"/2\". When you first get to town, try \"View Profile\" to see your current modifier deck. You'll have opportunities to upgrade this deck over the course of the campaign, whether that's by removing negative modifiers or adding additional positive modifier cards.\r\n</li></ul>\n\n<ul><li>Enemies do not have modifier decks and always do the damage shown on their card for the round.\r\n</li><li>If you would take damage that would reduce you to 0hp, you will instead randomly <strong>burn</strong> a card from your deck to negate that damage, though this reduces the number of rounds you have until you are exhausted by running out of cards. If you have no cards in your hand (i.e. all of them are already discarded or burned) when you are reduced to 0hp, you cannot burn a card and are exhausted as above.\r\n</li><li>There are a few special conditions that attacks (yours or monsters) can apply, including <em>stun</em> and <em>wound</em>. Stun makes the recipient skip their next turn. Wound makes the recipient lose 1HP at the end of every round (until healed).\r\n</li><li>Some monsters, actions, and items may provide a Shield, which negates the first N points of damage from every attack.\r\n</li></ul>\r\nStrategy Tips (minor spoilers):\r\n<ul><li>Look at upcoming enemy actions for the turn and try to avoid taking unnecessary damage. While you are a warrior, a few mighty blows can bring you to your knees, and healing is in short supply. Winning many scenarios involves more tactical positioning than 'tanking' damage.\r\n</li><li>Don't be afraid to fail a scenario-- you gain some small amount of XP for the actions you take during a scenario, and you keep any gold you collected even if you fail, and you can try again.\r\n</li><li>Sometimes it's advantageous to choose a slow initiative, to let yourself react to monster actions or let a monster move closer so you can dart in and attack it without getting counterattacked. Remember that you can use the default Attack 2 / Move 2 actions, so you can select a slow-initiative card such as \"Loot 1\" as your first card, to use its slow initiative... but then when your turn comes, play it as a Move 2 or Attack 2 instead.\r\n</li><li>Using too many \"burn when used\" cards early in the scenario will reduce the number of turns you have until you are exhausted by running out of cards-- you may want to save them for important moments (by using them as Move 2 / Attack 2 defaults the first time through your deck).\r\n</li><li>Collecting treasure can help you buy items, but is not required-- if you spend too many turns doing that you'll run out of cards before you can complete the scenario...\r\n</li><li>There are 16 playable scenarios, though about one third of them are optional 'side quests'.\r\n</li><li>You do not <em>need</em> to use the 'long rest' action-- you will automatically 'short rest' to redraw cards each round. The 'long rest' can be useful when you critically need healing, an item refresh (for a few specific items), or access to a specific card quickly, but it uses up a turn and burns a card so there's a cost to it...\r\n</li><li>'Long rest' is the one action you can still perform while stunned.\r\n</li><li>Add your own Q&amp;A in the comments below!</li></ul>\n<p> </p>\r\n\r\nDeveloper Notes:\r\n<p>PICOhaven was developed part-time over the course of about 3 months, from Aug 2021 to Oct 2021.</p>\n<p><strong>Thank You:</strong></p>\n<ul><li>Thanks to SH, SF, DW, and HB  for playtesting and feedback.\r\n</li><li>I watched some of the LazyDevAcademy \"Developing A Roguelike\" videos and they inspired interesting ideas, even if this isn't a roguelike.</li><li>I adapted morgan3d's code for A* pathfinding on PICO-8 from https://github.com/morgan3d/misc/tree/master/p8pathfinder .</li></ul>", "metacritic": null, "released": "2021-11-07", "tba": false, "updated": "2021-11-08T07:48:02", "background_image": "https://media.rawg.io/media/screenshots/7f5/7f5e2c1f87fd33ef15b2292018821ca9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 68, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["icegoat9"], "genres": ["RPG", "Strategy"], "publishers": [], "esrb_rating": null}