{"id": 691726, "slug": "kendan-and-the-gem-of-eru", "name": "Kendan and the Gem of Eru", "name_original": "Kendan and the Gem of Eru", "description": "<p><strong>Kendan and the Gem of Erú </strong>is a fantasy RPG made in GB Studio.  </p>\r\nNow  on KICKSTARTER\r\n\n<p>You play the game as Kendan, a young adventurer who wakes one morning to find a blight has spread throughout the island of Una. Will you embark on the quest to cure the darkness? Or will corruption shape your narrative.</p>\n<p>This demo begins towards the start of the game with a few limitations in place.</p><p><strong>CONTROLS:</strong><br/></p><p><strong>D-PAD</strong> - Arrow KEYS</p><p><strong>(A)</strong> - Z KEY</p><p><strong>(B)</strong> - X KEY</p><p><strong>START</strong> - ENTER/RETURN</p><p><strong>SELECT</strong> - SHIFT</p>\n<p>Explore the area begin your journey and complete some of the side quests that will be available in the full release. </p>\n<p>The island is divided into three <strong>regions;</strong> Endúl, Hamún and Zú. Each region hosts unique landscapes, NPCs and side quests that you'll discover as you progress through the game. You will begin in the small, fishing village of Endúl with plenty to explore before beginning your journey.  </p>\n<p>Journeying throughout different lands, you will meet a variety of characters who you can help or hinder along the way, gaining XP and items.  </p>\n<p>There are many ways to level up throughout the game; from the main story, side quests, combat, even hidden treasure chests.  Bounties can reward you with various potions or XP to help you advance between LVLs. Your total HP and ATK values will increase with each LVL. </p>\n<p>The battle system is a turn based mechanic. You can view your opponent's STATS before deciding to FIGHT, drink POTIONS to restore HP, use a MAGIC spell to disable your enemy and even RUN if you choose. Beware; not all enemies will let you escape so easily. </p>\n\n\n<p>www.stompypawsstudios.com</p>\n<p>Thanks to a great community for helping start this creation.</p>\n\n<p>Current build of the game has been created with user shared assets, funding will go towards building the game with all new art and music as well as physical production costs. We hope to create more for future releases with everything we've learned from this project.<br/></p>\n<p>Assets seen in demo/trailer provided by:</p>\n<p>https://sondanielson.itch.io/gameboy-simple-rpg-tileset<br/></p>\n<p>https://kicked-in-teeth.itch.io/gameboy-items</p>\n<p>Some artwork has been edited/modified.</p>", "metacritic": null, "released": "2021-11-07", "tba": false, "updated": "2021-11-08T07:53:25", "background_image": "https://media.rawg.io/media/screenshots/c83/c837f78534f978668e7cb60ee6abb3cf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 15, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["StompyPawsStudios"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}