{"id": 69196, "slug": "bejeweled-classic-hd", "name": "Bejeweled Classic HD", "name_original": "Bejeweled Classic HD", "description": "“Bejeweled — perhaps the most insanely addictive puzzle game ever.” — Games Magazine<br/><br/>Discover your perfect match with 6 breathtaking modes in this classic gem-matching game, from the fast-paced, time-based Lightning, to the gem-driven Flushes and Full Houses of Poker Mode. Create electrifying special gems like Flame gems, Star gems, Hypercubes, and Supernova gems, collect flashy Bejeweled badges and achievements, and soar to dazzling heights in the Game Center leaderboards – all while enjoying fantastic Retina-display graphics! This is the Bejeweled you’ve loved for years, and it’s still delivering amazing high-carat excitement!<br/><br/>This app offers in-app purchases. You may disable in-app purchasing using your device settings. <br/><br/>CLASSIC GEM-MATCHING <br/>Play the most popular puzzle game of the century with powerful new gems. You’ll find cascades of fun as you test your gem-swapping ability!<br/><br/>MODES FOR EVERY MOOD<br/>Enjoy the original in Classic, race against time in Lightning, dig deep for treasure in Diamond Mine, discover your own relaxing retreat in Zen, match gems to save Butterflies from a hungry spider in Butterfly, keep the cold out in Ice Storm, and make top hands with gems in Poker.<br/><br/>BOOST YOUR WAY TO BIG SCORES<br/>Each mode has two Boosts, one regular and one Super Boost, which help you make even more matches and set even higher scores. Whether it’s pulling all the Butterflies to the bottom row with Reset in Butterfly mode or shuffling the board in Classic mode, Boosts take your game to a whole new level!<br/><br/>PROVE YOUR SKILLS, CLIMB THE RANKS<br/>Earn flashy Bejeweled badges and Game Center achievements to prove your multifaceted skills, and compete against the world and your friends in Game Center leaderboards for the top score! Gloat over your scores for total matched gems, all-time best moves, and top 10 personal bests in Classic and Diamond Mine.<br/><br/>HINTS ON DEMAND<br/>Can't quite spot the next match? Use the \"Hint\" button for a quick tip.<br/><br/>Stars mode will open a separate, free Bejeweled Stars App.<br/><br/>Important Consumer Information.  This app requires acceptance of EA’s Privacy &amp; Cookie Policy, TOS and EULA; includes in-game advertising; contains direct links to the Internet and social networking sites and the Internet intended for an audience over 13.", "metacritic": null, "released": "2012-05-17", "tba": false, "updated": "2019-07-29T12:09:02", "background_image": "https://media.rawg.io/media/screenshots/7cb/7cb0ba8dc9d696f972f3f1764846ebbc.jpg", "website": "http://ea.com/iphone", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 114, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["PopCap Games"], "genres": ["Puzzle"], "publishers": ["PopCap"], "esrb_rating": null}