{"id": 69193, "slug": "video-poker-free-multihand-casino-free-video-poker", "name": "Video Poker - FREE Multihand Casino Free Video Poker Deluxe Games", "name_original": "Video Poker - FREE Multihand Casino Free Video Poker Deluxe Games", "description": "Get the Best experience in Video Poker casino game. Play Free Classic Video Poker game and have a lot of endless fun.<br/>Download Multi-Hand Videopoker now and play 24 different games for FREE today.<br/><br/>Now featuring LEVEL UP POKER - Win upto 4 times! <br/><br/>5/5 Stars *****<br/>I jus quit playing another game cause of all the bots u don't have to worry about that here. Fast paced fun and no cheating. jus started plying this game tho, n so far I like it.<br/><br/>5/5 Stars *****<br/>Best Video Poker app. Its a lot of fun. Love the two hour bonus chips &amp; multi hand concept. You can take it at your own pace. Hours of fun &amp; winning. Probably my favorite and most realistic Video Poker app.<br/><br/>Videopoker comes with a variety of unique themes! Play with the theme that’s perfect for you.<br/>Play Video Poker game like never before! <br/>Similar shuffle engine as the video poker in a real casino.<br/><br/>MULTI HAND VIDEO POKER GAMES:<br/><br/>Try your luck at more than 24 video poker games. <br/>Choose from numerous unique rooms that allow you to play MULTIPLE HANDS at once. <br/>The lobby has an amazing layout that lets you get straight to the action.<br/>Retro classic look of the game along with different themes.<br/><br/>MACHINE VIDEO POKER GAMES:<br/><br/>The similar graphical user interface as the Video Poker in a real casino. <br/>This is a simulator of the classic video poker<br/><br/>List of VideoPoker Games:<br/><br/>\t1.\tJacks or Better                           <br/>\t2.\tBonus Poker<br/>\t3.\tJoker Poker                                <br/>\t4.\tEights or Better<br/>\t5.\tTens or Better                             <br/>\t6.\tTriple Bonus Poker                       <br/>\t7.\tDouble Joker Poker                    <br/>\t8.\tUltra Bonus Poker                       <br/>\t9.\tTwo Way Royal                           <br/>\t10.\tBonus Poker Deluxe                       <br/>\t11.\tDouble Bonus Poker                  <br/>\t12.\tWhite Hot Aces                       <br/>\t13.\tAces &amp; Faces                         <br/>\t14.\tDouble Double Bonus<br/>\t15.\tAll American                               <br/>\t16.\tTriple Double Bonus<br/>\t17.\tDeuces Wild                               <br/>\t18.\tSuper Bonus Deuces Wild<br/>\t19.\tDouble Deuces Wild                   <br/>\t20.\tDouble Bonus Deuces Wild<br/>\t21.\tDeuces &amp; Joker<br/>\t22.\tBonus Deuces Wild<br/>\t23.\tOne Eyed Jack<br/>\t24.\tTriple Deuces Wild<br/>\t25.    Loose Deuces<br/>        26.   Bonus Draw Poker<br/>        27.   Deuces Wild Bonus Poker<br/>        28.   Double Bonus Draw Poker<br/>        29.   Super Double Bonus Poker<br/>        30.   Super Aces Bonus Poker<br/><br/><br/>Coming soon in the next versions:<br/><br/>＊ Aces Wild<br/>＊ Faces Wild<br/>＊ Anything is Wild<br/><br/>SLOT POKER:<br/><br/>Love Slots &amp; love Poker? Then this variation is definitely for you.<br/>We have integrated both Slots &amp; Video Poker in a single game. Have a lot of fun by playing Slot Poker.<br/>Maximise your wins &amp; take the advantage against the house.<br/><br/>TOURNAMENTS:<br/><br/>Take part in variety of video poker tournaments that will pitch your skills against the World. <br/>Different modes of videopoker tournaments let you play with your choice of entry cost.<br/>The game has tournaments with three modes – Big Prize, Mega Prize, and Shootouts!<br/><br/>DAILY SPIN &amp; FREE BONUSES:<br/><br/>Try out the daily spin to win lucrative prizes &amp; look out for the special bonus every 2 hours for even more chances for free rewards.<br/>Get huge coin rewards for having your friends play the game.<br/><br/>We are constantly working on new rooms &amp; new game modes to make the game more fun!<br/><br/>FEATURES:<br/><br/>\t•\tPlay all 24 Video Poker Games for FREE!<br/>\t•\tA Daily Spin with all manner of lucrative prizes<br/>\t•\tProgressive JACKPOTS constantly ticking away on our Multi-Hand Video Poker rooms! Each Unique to every room!<br/>\t•\tWin HUGE CHIPS<br/>\t•\tTournaments running at every conceivable hour!<br/>\t•\tA special Bonus every 2 hours<br/>\t•\tPower Ups have been added to Multi-Hand Video Poker!! Who doesn't want a little bit of an upper hand every now and then, anyways?<br/><br/><br/>There's always more! Our team is already developing content for our next major update! <br/>\u2028This game is for amusement purposes only &amp; is intended for use by players 21 and over.", "metacritic": null, "released": "2015-03-30", "tba": false, "updated": "2019-10-22T14:26:51", "background_image": "https://media.rawg.io/media/screenshots/fe2/fe24dffa91c83f89f97102bd76636409.jpg", "website": "http://yesgnome.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 177, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["YesGnome Gaming Solutions"], "genres": ["Card"], "publishers": ["YESGNOME GAMING SOLUTIONS PRIVATE"], "esrb_rating": "Teen"}