{"id": 6920, "slug": "slender-rising-2", "name": "Slender Rising 2", "name_original": "Slender Rising 2", "description": "HE IS BACK! The official sequel to the scariest game on the AppStore! An unforgettable horror trip unlike anything else!<br/><br/>TouchArcade: \"A terrific sequel.\" <br/><br/>This is what players say: <br/>\"So much scarier than the first one! I screamed!\"<br/>\"Get the game it's absolutely creepy, scary and fun!!!!\" <br/>\"This is it! A totally worthy sequel and a must have!\" <br/>\"I've never been so scared from a horror game!\" <br/>\"Improved a lot, impressed!\" <br/>\"OMG sooooo fun. I'm trembling every second.\" <br/>\"You don't know fear until you have played this!\"<br/><br/>• New Game Modes<br/>Two completely different game modes. Liberate the lost souls from their curse to save yourself from becoming one of them. Or collect the mysterious signs that tell a distubring tale and escape. <br/><br/>• All New Horror Locations<br/>Four new, creepy and vastly different locations, including a abandoned Mansion and a Ghost Town in the gloomy sunset among others. <br/><br/>• Intense Atmosphere<br/>Spine chilling sound effects and music set the tone for a terrifying experience. Each location now comes with unique atmospheric effects including thunderstorm and blizzard.<br/><br/>• Defend yourself<br/>Find the shotgun to defeat your enemy and escape. But nothing is what it seems...<br/><br/>• Easy Controls<br/>Intuitive  and simple, pick your favourite from four different control schemes.<br/><br/>• Unreal Engine Powered Graphics<br/>Special effects for the newest devices and support for older ones from iPhone 3GS upwards. <br/><br/><br/>Use headphones when playing, ideally at night and alone! ;) <br/>It is recommended to close all background apps when playing on older devices. <br/><br/><br/>Credits: bit.ly/XTgXPP", "metacritic": null, "released": "2014-01-16", "tba": false, "updated": "2019-10-22T14:29:05", "background_image": "https://media.rawg.io/media/screenshots/1e3/1e3c372a6a5695275508ea12a4795f0a.jpg", "website": "https://twitter.com/HegiDev", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 214, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Michael Hegemann"], "genres": ["Action", "Adventure"], "publishers": ["Michael Hegemann"], "esrb_rating": null}