{"id": 692231, "slug": "third-option", "name": "Third Option", "name_original": "Third Option", "description": "THIRD OPTION\r\n<em>Tetris on a pen and paper!<br/></em>\n<p>In this puzzle game for 1 - 12 players, your goal is to fill 9x9 grid as completely as possible with \"Tetris shapes\". Sit back, relax, and start drawing. In this game, you are free to take as much as time to think, strategize and <strong><em>color </em></strong>your beautiful shapes. </p>\n<p>Every turn, two puzzle tile cards are revealed, and each player  chooses one of them, then marks off squares on their personal grid that  match the shape of the image shown on their chosen card. Multiple  players can choose the same card. If a player cannot fit either revealed  shape into their grid, they get a <em><strong>THIRD OPTION</strong></em> and reveal one  card from the deck just for them. If they can fit this shape in their  grid, they do continue normally next round; otherwise they are  eliminated from play.\r\n  </p>\n<p>The game ends when all players have been eliminated, the deck of  puzzle cards has run out, or a player has completely filled their grid.  If someone has filled their grid, they win. If all players have been  eliminated or the deck ran out of cards, then whoever has the fewest  empty spaces wins. <br/></p>\n<p><strong>Features: </strong><br/></p>\n<ul><li>Players: 1 - 12</li><li>Playing time: 10 - 15 min</li></ul>\n<p><strong>What you need: </strong><br/></p>\n<ul><li>Pen and paper</li></ul>\n<p><strong>How to play: <br/></strong></p>\n<p>1. Start by drawing a 9x9 square, with small dot in the middle<br/></p>\n\n<p>2. Insert your starting shape. The shape must overlap the dot in the middle. Each player will receive unique starting shape. <br/></p>\n\n<p>3. When every player has received their starting shape, start placing down the puzzle shapes. You can choose either one of the 2 options available. You are free to rotate and mirror the shapes in any way you want. Remember to color your shapes in creative ways and take all the time you need. :-)<br/></p>\n\n<p>4. Eventually you are not able to fit any more shapes to the grid. When neither of the 2 options fit, you will be granted a <strong>THIRD OPTION. </strong>The third option will be unique to the player who is not able to fit neither of the regular shapes, no other player can use that shape. If you manage to fit the third option to your grid, you are back in the game, and you are even eligible for another third option in the next round, if neither of those fit again. If you are not able to fit even the third option, you are out of the game. <strong>The 1st player dropping out of the game will receive a free 1x1 square as a reward for playing aggressively. </strong>Once you are out, count the empty squares in your grid. This number will be your score, lower the better. <br/></p>\n<p> </p>\n<p>5. The game will end when: </p>\n<ul><li> None of the players can fit more shapes, not even the third options</li><li>The deck runs out of cards</li><li>Someone manages to fill their 9x9 grid 100 %. That player will immidiately win</li></ul>\n<p>The winner is the player with least empty squares on their 9x9 grid, or the player who first manages to fill their grid 100 %. <br/></p>", "metacritic": null, "released": "2021-11-04", "tba": false, "updated": "2021-11-08T10:03:59", "background_image": "https://media.rawg.io/media/screenshots/1e7/1e7f596934523e015dd8a89b18a563af.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 28, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "Web"], "developers": ["Martta"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}