{"id": 692205, "slug": "brawler-bros", "name": "Brawler Bro's", "name_original": "Brawler Bro's", "description": "IMPORTANT DISCLAIMER:  DON'T BUY THIS!\r\n<p>As of today this is a very early version after just two months of prototyping and not a full game. And it might never make it into a full release, since we haven't even finished pre-production yet. So please only buy this if you want to support us in our indie gamedev endeavors and are able to spare the coin.</p>\n\r\nDescription\r\n<p>Brawler Bro's is an arcade beat em up that takes inspiration from the famous \"Fight Night\" series made by EA. </p>\n<p>The core of it is underground-kickboxing fights between two opponents controlled by flickstick inputs - therefore playing with a controller is mandatory at the moment (there exist no mouse or keyboard support right now!)</p>\n<p>Be assured to encounter bugs, glitches and faulty balancing. Progression is not really implemented yet and the available content is limited to four fighters and a hand full of stages.</p>\n<p>Any feedback on the controls, gameplay or performance reports and technical issues are very much appreciated!</p>\n<p>You can either leave a comment or go old school and shoot us an email here \"info(AT)phosdigital.com\"</p>\n\r\nHardware requirements\r\n<p>Brawler Bro's currently does require a xbox compatible controller to be played!</p>\n<p><strong>Min Hardware</strong>: i5 CPU (or similar) and a GTX 1050 (or similar) for Full HD @30FPS<br/><strong>Recommended:</strong> i5 CPU (or better) and a GTX 2060 (or similiar) for WQHD @60FPS</p>", "metacritic": null, "released": "2021-11-05", "tba": false, "updated": "2021-11-08T09:56:12", "background_image": "https://media.rawg.io/media/screenshots/ab4/ab47669a685771efc93f1603f05fdfad.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 211, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Peter Hann"], "genres": ["Action", "Sports", "Fighting"], "publishers": [], "esrb_rating": null}