{"id": 69223, "slug": "a-knight-blade-hero-middle-age-darkness", "name": "A Knight Blade Hero - Middle Age Darkness", "name_original": "A Knight Blade Hero - Middle Age Darkness", "description": "Have you read a book about the medieval age when hero knights exist? How about a story about wizards, magicians casting spells using their wands, and darkness? Sounds interesting, isn’t it? We usually see in the movies that knights are considered heroes because they protect the kingdom and the castle where they belong. Hero Knights fight against the dark-minded people that will try to abduct the kingdom or castle of their king and queen. Hero Knights are the army of the royal castle or kingdom. They are the soldiers of war who are willing to sacrifice their lives just to protect their beloved kingdom or castle.<br/>The epic stories about Hero Knights are real. They are brave and angry towards injustice. They are men who always wear armor and have a sword which blade is sharp. Hero Knights are also good in archery and are considered legends in the world history of fighting. They have good defense strategy and always ready for wars. Hero knights are ready every day to fight for battle. They are as swift as the wind and as strong as a storm. Do not try to capture the princess of their castle or the lord of their kingdom because they will rescue them for sure and death will be your sanction for the crime committed.<br/><br/>Knight Blade Hero game will let you experience how to become a Hero Knight. You will have the chance to experience how challenging it is to be a hero knight and see for yourself how amazing the quest of a hero knight is. This game will stimulate your imagination. This game plays with HD graphics, colorful background setting and realistic sound effects that will spice up more your imagination while playing. Children, boys and even girls, will surely enjoy playing this game because of the colorful set up and cute looking characters. This game is as good as those 3D games available in the market. It is full of fun and adventure. You will learn something while playing.<br/><br/>A Knight Blade Hero Quest is a game about clash of hero knights vs darkness. In this game, you will play as the hero knight who will fight against the Darkness. You will attack them using the sword you have. During your quest, there will be a lot of distractions that will come your way so be ready to defend yourself. A lot of obstacles are waiting for you during your quest. There are bats, other creatures and of course, the darkness that will block your way. Bring the empire of the walking dead down or else you will be the one who they will bring down. Be sure to remain undead for you to continue yourKnight Blade Hero. Play like a pro and defeat all of your enemies. There are coins that will show up during your quest, so gather as many coins as you can for a higher score.<br/><br/>This Knight Blade Hero is one of the games that will surely make your free time full of thrill and fun. Download this game immediately and enjoy it for gratis!", "metacritic": null, "released": "2015-04-21", "tba": false, "updated": "2019-10-22T14:26:52", "background_image": "https://media.rawg.io/media/screenshots/065/065f38100780efc6235975280504cb99.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 143, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["elias sleiman"], "genres": ["Adventure", "Arcade"], "publishers": ["elias sleiman"], "esrb_rating": "Everyone 10+"}