{"id": 692328, "slug": "indiepocalypse-22", "name": "Indiepocalypse #22", "name_original": "Indiepocalypse #22", "description": "ISSUE #22\r\nCover - Flynn Nicholls  \r\n\n<p>Hello and welcome to Indiepocalypse!</p>\n<p>Indiepocalypse is a curated monthly collection looking to highlight the very best of the DIY indie game scene. </p>\n<p>Each month will feature games by 10 different developers, including newly commissioned game exclusive to the bundle-zine. The games cover a wide variety of styles, genres, and themes as they fight against any definition of \"indie game\" as a genre.</p>\n<p>Also, and this part is very important to me and should truly be taken as given, each contributor is paid and developers are paid royalties on all future sales.</p>\r\nThis Month's Games\r\n<br/>Yuki's Palpitating, Passionate, Phenomenal, and quite frankly Proficient quest for a (hot) girlfriend!!!  (WIN/MAC) by milkkylemon\r\n\n<p>a useless lesbian tries to get a girlfriend</p>\n\r\nCatharsis Maker (WIN/MAC) by Ráchel Plutón<br/><br/>\n<p>A short interactive collage for making your own catharsis over 3 minutes and 44 seconds.</p>\n\r\nThe Distortion Beast: A Choosey Comic (WIN) by Sean Lewis\r\n\n<p>The Distortion Beast is an interactive fantasy comic! Explore a bizarre dungeon as Maria of Cardo, finding items, avoiding traps, and attempting to kill the titular beast!</p>\n\r\nA Journey In Search Of The Unknown (Physical) by Washington Albuquerque\r\n\n<p>A Journey In Search Of The Unknown is a solo journaling game about exploration and mysteries, inspired by Indiana Jones, Tomb Raider and so many awesome stories about the unknown.</p>\n\r\n\r\nTHE GIRLFRIEND OF MY GIRLFRIEND IS MY FRIEND (Physical) by stargazersasha\r\n\n<p>stargazersasha's THE GIRLFRIEND OF MY GIRLFRIEND IS MY FRIEND is a simple, heartfelt TTRPG about art, magic, and coming of age as a trans young adult.<br/></p>\n\r\n\r\nAfter Triumph (WIN/MAC) by Nick Murray\r\n\n\n<p>After Triumph is a walk across an uncanny landscape. A text-based tarot-reading walking simulator. The walk is long, but the game is short. (approximately five minutes to get through to an ending.) <br/><br/>The game plays as a journey and also a reading of the major arcana. Each half sort of divines the other.</p>\n\n\n\r\n\r\nSpirited Suites (WIN/MAC/Linux) by Team Canned Gluten: Brendan Roarty, Marissa Borowski, Sarah Kosco, Dillan Murillo, James Cannizzaro, Thomas Hamilton, Mads Pappas\r\n\n<p>Spirited Suites is a quirky 3D Puzzle Platformer following a space explorer who crash lands on a mysterious planet, leading to his demise. However, that doesn't stop him from exploring the strange hotel towering over him! Use your lifeless corpse to battle, solve puzzles, and reach the top of the hotel to retrieve your ship and return home. Be cautious. You never know what might be hiding in Spirited Suites Hotel!</p>\n\n\r\n\r\nWere|House (WIN/MAC) by Sad Ghost Studios\r\n\n\n<p>What if the monsters in the haunted house weren’t just wearing a costume...? By accident, Dori stumbles across the monstrous secret behind popular haunted house, the Were|House - and then they get roped into working alongside the crew on Halloween night! A job's a job, right? But will Dori make it through three days of hard work preparing for the big night - and will they grow closer to any of the monsters...? Were|House is a comedic visual novel with dashes of romance and three routes to pursue: werewolf Cormac, kelpie Morag, and gorgon Esseth ♡</p>\n\n\ndeath of vansat finfail (WIN/MAC/Linux) by GURN GROUP\r\n\n<p>vansat finfail perishes in the street, cast out like a dog</p>\n\r\n\r\n*NEWLY COMMISSIONED FOR INDIEPOCALYPSE*\r\ngloom reducer (WIN) by owch\r\n\n\n<p>A wandering game with two endings. <br/>This game contains discomforting images.</p>\n\n\n\n<p>\n</p>\n<p> </p>\n<p><strong>*BONUS*Electric Zine Maker </strong>(WIN/MAC) by alienmelon</p>\n\r\nLauncher Courtesy of MM Bundle Launcher\r\n\r\nIndiepocalypse zine contents\r\n<p><strong>COMICS<br/></strong><em>Shower in the Dark</em> by Sam Pender</p>\n<p><strong>FEATURES</strong><br/>Parts 43-45 of <em>69 Games About Romance</em> by Andrew<br/></p>\n<p>Interested in the Indiepocalypse being delivered straight to you every month? Sign up for the <strong>PATREON</strong>.</p>\n<p>If you are interested in contributing to Indiepocalypse check out the submission page:</p>\n<p><strong>SUBMIT YOUR GAME TO THE INDIEPOCALYPSE</strong></p>\n<p><strong>TUNE INTO INDIEPOCALYPSE RADIO, SATURDAYS 7pm EST</strong></p>\n<p><strong>FOLLOW INDIEPOCALYPSE ON TWITTER</strong><br/></p>\n<p><strong>COMIC ARTISTS AND OTHER ZINE CONTRIBUTORS APPLY HERE</strong></p>\n<p><strong>SIGN UP FOR THE NEWSLETTER </strong>(and get free copies of the PDFs!)</p>\n<p><strong>THE FULL INDIEPOCALYPSE CATALOG</strong></p>\n<p><strong>DISCORD</strong></p>\n<p><strong>ADVERTISE WITH US</strong></p>", "metacritic": null, "released": "2021-11-05", "tba": false, "updated": "2021-11-08T10:27:16", "background_image": "https://media.rawg.io/media/screenshots/473/47309c1b775454627870c0203d1729ef.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 18, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["PIZZAPRANKS"], "genres": ["Action", "RPG"], "publishers": [], "esrb_rating": null}