{"id": 692316, "slug": "generador-de-poblaciones-para-cronicas-del-ocaso", "name": "Generador de Poblaciones para Crónicas del Ocaso", "name_original": "Generador de Poblaciones para Crónicas del Ocaso", "description": "<p>En su periplo por el antiguo continente los personajes de las jugadoras viajarán por tierras ignotas, catacumbas prohibidas y lugares abandonados, pero siempre volverán a la civilización. Y ahí es donde queremos echarte una mano desde <em>Los Pergaminos del Fénix</em>.</p>\n<p>El <em>Generador de poblaciones para Crónicas del Ocaso</em> es una sencilla herramienta para establecer al vuelo los asentamientos por los que quieran pasar el grupo de aventureras, en sus hazañas por las tierras de Nexaria. </p>\n<p>Plantea el número y proporción de clases de personajes jugadores, y categorías de personajes no jugadores, que puedes encontrar en esos lugares; creando un entorno que aporte verosimilitud a tu relato. Incluso, tras explicar el procedimiento, un ejemplo te permitirá tener las cosas más claras para generar una localidad al vuelo. </p>\n<p>Además, para esos días en que la inspiración parece estar un poco más perezosa, las últimas tablas del suplemento aportan unas breves indicaciones para describir las calles y recovecos de las poblaciones, aprovechando los sentidos más relevantes. </p>\n<p>Esperamos que la próxima vez que tus jugadoras quieran entrar, en esa población de la que solo tienes un nombre, podamos ayudarte para vivir grandes aventuras en ella.</p><p><em>El <strong>Generador de poblaciones para Crónicas del Ocaso</strong> es una ayuda de juego no oficial para «Crónicas del Ocaso» escrito por Jesús «Capitán Mordigan» del Arco, con diseño y maqueta de Daniel Fernandez García. El contenido del manual es parte del Game Content y está bajo la Open Game License Versión 1.0a, exceptuando el apartado destinado a describir la aldea de Crayham que se considera Product Identity y pertenece a sus autores. La ilustración de la portada ha sido obtenida del proyecto Backgrounds de Kronbits y el resto de ilustraciones pertenecen al catálogo de la página Old Book Illustrations , que utilizamos bajo su licencia Creative Commons Attribution-NonCommercial-ShareAlike 4.0.</em><br/></p>", "metacritic": null, "released": "2021-11-05", "tba": false, "updated": "2021-11-08T10:24:54", "background_image": "https://media.rawg.io/media/screenshots/2b5/2b5ecf826b3872295cdb4059a6a29e42.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 39, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Los Pergaminos del Fénix"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}