{"id": 692428, "slug": "a-lighthearted-game", "name": "A Lighthearted Game", "name_original": "A Lighthearted Game", "description": "<p>Original description:</p>\n<p><em>\"Pete may be at death's door, but he hasn't rung the doorbell yet. Struck by a car and cast (prematurely) into the afterlife, every remaining heartbeat brings him one step closer to salvation... or the grave!  From award-winning indie game developer David J. Sushil (Vanessa Saint-Pierre Delacroix &amp; Her Nightmare, Not Without You) comes a novel platformer with a wicked sense of humor. Guide Pete through 27 levels of white-knuckled arcade insanity. Dodge dimwitted Ghosts, soul-sucking Spectres, and ravenous Grabby Hands. Collect secret items, unlock trophies, and earn a spot on the global high score list.\" </em></p>\n<p>In 2013, a group of game developers in Orlando organized a meetup for the Global Game Jam.  Over the course of a weekend, several great games were developed, all based around the theme: <em>heartbeat</em>.  The friendships made then planted the seeds of what would later become Indienomicon, Orlando's monthly showcase of local independent video games, which I hosted for the first four years.  </p>\n<p>Anyhow, at this particular meetup, I brought several members of the Terncraft team - Sam, Paul, Pascal, and Joe.  We built most of <em>A Lighthearted Game</em> that weekend, and then spent another few weeks polishing it up.  </p>\n<p>I love this game.  It landed with a thud and nobody played it, but there's something great about it that I wish more people could see.  Maybe it will find an audience here on itch.io?</p>\n<p><em>A Lighthearted Game</em> was originally coded in C# using the XNA framework, but has been pretty faithfully rebuilt in JavaScript.  It is lacking only access to a global high score list.  Maybe if there's enough interest...</p>\n<p><strong>Design<br/></strong>David J. Sushil<br/>Joe Rowles<br/><br/><strong>Programming</strong><br/>David J. Sushil<br/>Nathan Youngpeter<br/><br/><strong>Artwork</strong><br/>Samantha Poslinski<br/>Paul S. Vanterpool II<br/>Pascal Duverger<br/><br/><strong>Music</strong><br/>Kevin MacLeod</p>", "metacritic": null, "released": "2021-11-05", "tba": false, "updated": "2021-11-08T10:51:19", "background_image": "https://media.rawg.io/media/screenshots/507/5073dcb7be76552eccfdf92cc1384131.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 60, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["modernloner"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}