{"id": 692439, "slug": "undemon", "name": "UNDEMON", "name_original": "UNDEMON", "description": "Hello, one-person development studio \"WEST SUN\".<br/><br/>I interested in horror contents. and virgin ghost is a familiar character in Korea.<br/>I started developing that \"How about making a virgin ghost the main character of the game?\"<br/>This game was developed by mixing the feelings of the 2D platform genre in the 90s.<br/><br/><br/>I would appreciate it if you could enjoy the 2D platformer genre game where the cute virgin ghost is the main character.<br/><br/>Since it's a game made by oneself, there may be a bug.<br/>I would appreciate it if you could report the fatal bug by e-mail.<br/><br/>Thank you.<br/><br/>* This game supports the following controllers.<br/>xbox 360 pad / xbox one pad / play station 4 pad (dual shock 4)<br/><br/>===============================================================================================<br/><br/><br/>Synopsis<br/><br/><br/>One dark day...<br/><br/>A strong lightning strike a shabby tomb hard.<br/><br/>Due to the unknown cause, a ghost in the form of a woman appears in the tomb, but<br/>virgin ghost suffer without remembering anything.<br/><br/>Someone found a virgin ghost in a house nearby,<br/>The game begins as the virgin ghost notices it and enters the house.<br/><br/>Why did the main character become a ghost?<br/>Let's go on a mysterious journey to find out who did it!<br/><br/><br/>===============================================================================================<br/><br/><br/>Hide System<br/><br/><br/>Luna, a virgin ghost, can hide slightly as a \"hide\".(not completely) <br/>and It can stun state the other person for a while or pass through the body.<br/><br/>However, most people drink strange water,  can see the existence of the ghost Luna.<br/><br/>Hiding is useless for animals.<br/><br/><br/><br/><br/>Certain obstacles can be passed as 'hide' state.<br/><br/><br/>Bump as 'hide' state at humans enemy.<br/>The human enemy in stun state for a moment and the attack is valid.<br/><br/><br/>Bosses have strong energy and cannot give them a state of stun, but they pass through the body as they are.<br/>Instead, if you continue to attack, they can be stun state, so aim for that time.<br/><br/><br/>===============================================================================================<br/><br/><br/>Sight System<br/><br/><br/>Luna hasn't been long since she became a ghost, so can only see humans her closely without lighting.<br/>However, raising your ability widens the scope of seeing humans.<br/>but, she can see animals regardless of sight range.<br/><br/><br/>===============================================================================================<br/><br/><br/>Ability<br/><br/><br/>Collect souls, and raise your ability.<br/><br/><br/>Attack<br/> - The offense gradually increases, and the energy flies to the end.<br/><br/>Sight<br/> - The extent to which human enemies can be seen increases. (Including human bosses)<br/><br/>Friction<br/> - It becomes easier to control the movement of slippery ghosts.<br/><br/>Hiding time<br/> - Hiding time increases.<br/><br/>Recover Hiding<br/> - The recovery time for hiding ability is reduced.<br/><br/>Flying time<br/> - Flying becomes possible, and flying time increases.<br/><br/>Recover Flying<br/> - The recovery time of flying ability is reduced.<br/><br/><br/>===============================================================================================<br/><br/><br/>Stage progress<br/><br/><br/><br/>At the beginning of the stage, check the yellow key's image on the hint sign.<br/><br/><br/>Find the key on the stage.<br/>You can't throw away the key once you get it.<br/>Yellow keys may have fake ones, so check them out in detail.<br/>If the key you checked matches the key you found, obtain it.<br/><br/><br/>The red key doesn't have a fake.<br/>If you find it, get it right away.<br/><br/><br/>Enter the next step using the right yellow key.<br/>If a fake key is used, you will receive a penalty.", "metacritic": null, "released": "2021-11-05", "tba": false, "updated": "2021-11-15T03:22:05", "background_image": "https://media.rawg.io/media/screenshots/ac5/ac5b1a015c7bf526dc4fab0e6e4bbfa7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 213, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["diskzzang@naver.com", "WEST SUN"], "genres": ["Action", "Indie", "Platformer"], "publishers": ["WEST SUN"], "esrb_rating": null}