{"id": 692596, "slug": "blue-reflection-second-light", "name": "BLUE REFLECTION: Second Light", "name_original": "BLUE REFLECTION: Second Light", "description": "“As the last summer day fades, all is illuminated.”<br />\nWith gorgeous translucent designs by Mel Kishida, as well as a story that depicts the youth of lifelike girls, based on a theme of human identity and bonding, a new title in the BLUE REFLECTION series is here!<br />\nStory<br />\nUnder a piercing blue sky, surrounded by crystal clear water, the sun scorched Ao Hoshizaki&#39;s skin.<br />\nGazing at the summer scenery, it seemed as if the girl was left behind in a world that she had wandered into.<br />\nAt a school adrift in the distance, there lived three girls who had lost their memories.<br />\nThe only thing they could remember was their names.<br />\nAo, shrouded in confusion, begins to lead a strange communal life with the girls as they seek clues about a way to return to their original world.<br />\nOne day, in this world where the school was surrounded by nothing but water, a path that led to new scenery suddenly appeared.<br />\nAt the end of the path was a mysterious location, where familiar things existed inexplicably.<br />\nIn order to grasp the situation, the girls decided to venture forward, but as soon as they took their first steps, they encountered a monster they had never seen before.<br />\nBut just when they thought things had become hopeless, the girls obtain a mysterious power.<br />\nIn a world that seemed to be trapped in summer, young girls have lost their memories.<br />\nIf the girls solve the mystery, what will they obtain?<br />\nFeatures<br />\n■Make your very own school with “School Development”!<br />\nThe girls are the only ones at the school surrounded by water. You can freely build useful facilities the girls come up with, such as a “Takoyaki Stand” or “Pool”. By building the facilities that your favorite girls like, or simply the ones you are interested in, you can enjoy building a school to your liking.<br />\n■The command-style battles are even faster with “Exhilarating Real Time Battles”!<br />\nThe real-time battles from the previous game have been greatly improved with this title&#39;s exhilarating real time battles, allowing players to increase the tempo of battles based on the amount of time elapsed and the skills they use. By unleashing skills one after another to chain together combos and aim for maximum damage, battles will excite players with their sheer speed and power!<br />\n■Communicate with the girls in a wide variety of ways!<br />\nBy listening to the girls&#39; requests, going on dates with them, and more, players can communicate with the girls at the school in a variety of ways. By strengthening your bonds with the girls, they will develop, and new items can be obtained.<br />\n■Explore beautiful, mysterious worlds!<br />\nIn this game, you explore Heartscapes, locations that embody the heart and mind of each character. At them, you can enjoy travelling to a mysterious world where the voice and memories of the character are revisited.<br />\nNote: Costumes can be used after unlocking Change Outfit.<br />\nNote: For details about content, please visit the official site.<br />\nNote: The game is also included in the set products &quot;BLUE REFLECTION: Second Light Digital Deluxe Edition&quot; and &quot;BLUE REFLECTION: Second Light Ultimate Edition&quot;. Be careful to avoid making a redundant purchase.</p>", "metacritic": null, "released": "2021-11-08", "tba": false, "updated": "2023-11-03T11:46:07", "background_image": "https://media.rawg.io/media/games/624/62467eb1e6bba1d6d3b098a96dd4153e.jpg", "website": "https://blue-reflection.com/secondlight/us", "rating": 3.29, "rating_top": 5, "added_by_status": {"yet": 5, "owned": 51, "beaten": 5, "toplay": 15, "dropped": 1}, "playtime": 4, "achievements_count": 103, "ratings_count": 7, "suggestions_count": 534, "game_series_count": 2, "reviews_count": 7, "platforms": ["PlayStation 4", "Nintendo Switch", "PC"], "developers": ["KOEI TECMO GAMES CO"], "genres": ["RPG"], "publishers": ["Koei Tecmo Games"], "esrb_rating": "Teen"}