{"id": 692570, "slug": "ani-leaving-sirius", "name": "Ani Leaving Sirius", "name_original": "Ani Leaving Sirius", "description": "<strong>You must leave the planet!</strong><br/>Ani Leaving Sirius is a 2D Platformer Game combining captivating action-adventure elements with simple, yet alluring mostly hand-drawn art style. Play as Ani, a determined and strong character who embarks on a challenging escape adventure. <br/>Survive in a dying planet in energy chaos, dangerous districts, dark tunnels and challenging combats with uncanny creatures. Your only chance to escape the planet is through an old technology inconsistent portal! Manage limited sources and gain energy crystals by slaying enemies to improve your abilities and acquire helper drones. Complete your escape quest in this atmospheric and challenging rouge-lite gameplay.<h3>GAME FEATURES</h3><br/>•  Discover new districts and secret areas as you try to leave the planet.<br/>•  Use portals and tunnels to navigate. Portals are the only way to escape. But some might be inconsistent!<br/>•  Engage in powerful Boss combats with proper game mechanics. Fight 30+ enemies and environmental dangers.<br/>•  Upgrade all 10 of your abilities to prevail. Obtain Explorer and Guard Drones for a little help in this compelling journey. <br/>•  Master your attacks, dash enemies with your axe, fly, slay and survive!<br/>•  Collect energy crystals for all upgrades by defeating enemies. Manage your sources wisely and timely. <br/>•  Find game portals and use additional mini games to play for resources.<br/>•  Experience a simply entertaining gameplay in this fast-paced escape journey and step into an alluring new world<br/><br/><br/><br/><br/><br/><h3>ADDITIONAL RESOURCE GAMES</h3>You can find the game portals and play mini games for extra resource and have fun at the same time! <br/><br/><br/><br/>", "metacritic": null, "released": "2021-11-08", "tba": false, "updated": "2021-11-12T03:14:23", "background_image": "https://media.rawg.io/media/screenshots/e61/e6125809963f4f831bdc3829c6d28405.jpg", "website": "https://www.anileavingsirius.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 355, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["e2gamestudio"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["e2gamestudio"], "esrb_rating": null}