{"id": 69251, "slug": "diy-slime-maker-squishy-asmr", "name": "DIY Slime Maker! Squishy ASMR", "name_original": "DIY Slime Maker! Squishy ASMR", "description": "Taa daa! Its time to relax with your own homemade fluffy diy slime. Have you ever tried to make slime at home. With this DIY slime making game you can make the best slime at home with or without glue and borax. This slime maker #1 game is a must to beat the stress out of you. Unleash your creativity skills and make oozy &amp; fun to play smooth textured slime that you can’t resist squishing and stretching. Your homemade kawaii slime is so soothing and relaxing that you won’t be able to resist stretching and poking it all day long. Learn the real life applicable process of slime making, use slimy ingredients and learn how to make slime and play with the DIY jelly in this ASMR slime games for girls and boys. Spend your leisure time with this creative DIY crafts game. For some extra fun you can also see the glow in the dark slime feature to amaze everyone with the lights of in the room. Join the squishy &amp; slimy adventure with us with amazing slime poking, stretching and jiggling features to relax the stress out of you in your extra time.<br/><br/>Slime Maker Game Play &amp; features:<br/>Learn to make DIY fluffy slime with real life applicable making process.<br/>Squishy slime pressing and slime satisfying ASMR activities to tickle your brain.<br/>Learn how to make and play slime &amp; mixing all my slime in this game.<br/>Amazing glow in the dark slime feature to amaze your friends.<br/>Biggest collection of slime colors.<br/>Fun to do amazing ASMR satisfying slime activities that you had never experience before.<br/>Slime fails with too many poking and squishing with some crazy slime fun.<br/><br/>Make so many types of squishy slimes:<br/>Bead Slime <br/>Glitter Slime ASMR<br/>DIY crunchy slime<br/>Rainbow Unicorn Slime<br/>Glow in the dark slime<br/>Glossy slime<br/><br/>5 types of amazing activities to beat the stress out of you:<br/>Real Slime pressing<br/>Slime Poking with finger<br/>Slime coloring in rainbow &amp; unicorn colors<br/>Slime jiggling in all directions<br/>Slime stretching all across the screen<br/>Tingling slimy sensation", "metacritic": null, "released": "2018-04-22", "tba": false, "updated": "2019-10-22T14:36:09", "background_image": "https://media.rawg.io/media/screenshots/fa1/fa1949111d65be318454182b6d76faf9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 49, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sarah Shahzad"], "genres": ["Simulation", "Family"], "publishers": ["Sarah Shahzad"], "esrb_rating": null}