{"id": 692538, "slug": "deathverse-let-it-die", "name": "Deathverse: Let It Die", "name_original": "Deathverse: Let It Die", "description": "<p>Greetings to all of you looking to relieve your daily stress and fulfill an insane desire for extreme self-expression. </p>\n<p>We invite you to take part as a contestant in a literal survival game show that has enthralled the world over! !<br />\nDEATHVERSE is a full-scale survival action game in the same world as LET IT DIE, hundreds of years after the events of that game.The player will participate in the violent survival TV show DEATH JAMBOREE as a contestant.<br />\nIt’s an inhumane program in which 16 participants must murder each other to try to survive on an uninhabited desert island that grows increasingly polluted by the curious element of SPLithium.<br />\nOnly those who can truly entertain and capture the hearts of the crowd can claim fame and glory.</p>\n<p>This game carries on the spirit of the violent, twisted world of LET IT DIE.<br />\nYou never know what will happen in a do-or-die battle to the death fought only with violent, powerful melee weapons.<br />\nInstantaneous decisions such as whether to attack, defend, or go for the kill, surprise attacks making use of terrain, or whether to hold out in a grueling battle will mean the difference between life and death.<br />\nContestants must also watch out for “hunters”, malevolent hired killers whose only job is to eliminate them, as well as the savage cryptids that lurk in the battlefield.<br />\nThe key to surviving is to put on a good show and earn “GP” by thrilling the program’s audience.<br />\nStand out from the crowd by pulling off flashy moves, and aim to be the last one standing through skillful use of various strategies.</p>", "metacritic": null, "released": "2022-09-28", "tba": false, "updated": "2023-10-01T00:09:05", "background_image": "https://media.rawg.io/media/games/da4/da4707919ac9397f98787c44db5ecafa.jpg", "website": "https://deathverse.com/en", "rating": 2.14, "rating_top": 3, "added_by_status": {"yet": 5, "owned": 154, "beaten": 1, "toplay": 2, "dropped": 4}, "playtime": 1, "achievements_count": 33, "ratings_count": 6, "suggestions_count": 648, "game_series_count": 1, "reviews_count": 7, "platforms": ["PC", "PlayStation 5", "PlayStation 4"], "developers": ["SUPERTRICK  GAMES,Inc.", "SUPERTRICK GAMES"], "genres": ["Action"], "publishers": ["GungHo Online Entertainment"], "esrb_rating": "Teen"}