{"id": 692635, "slug": "your-dead-majesty", "name": "Your Dead Majesty", "name_original": "Your Dead Majesty", "description": "👑 <strong>RTS with a face</strong> - lead your army from the frontlines and get in the middle of the action<br/><br/>👑 <strong>Army with limited slots</strong> - create a winning composition<br/><br/>👑 <strong>Unit variety</strong> - discover many units, each with unique abilities<br/><br/>👑 <strong>Pixel-perfect</strong> - enjoy adorable pixel-art graphics and carefully crafted animations<br/><br/>👑 <strong>More than a sum of its parts</strong> - employ powerful synergies to boost your army in combat<br/><br/>👑 <strong>Fight for your life</strong> - battle a plethora of different enemy types and challenge mighty bosses<br/><br/><br/><br/>Control the mischievous king and order your plentiful and varied roster of units. Choose a winning army composition for any given scenario and venture on the path to victory. Cover all your bases and upgrade your buildings to gain more powerful underlings. Battle various enemy types and watch out for their defensive towers and traps. If you get past the defenses prepare to fight powerful boss enemies that do significantly more damage. When the going gets hard, persevere through the use of unit synergies - cover your enemies in tar, then set them ablaze. Conquer all of the enemy bases and gain a forward base to take on the next opponent. But whatever you do, keep Your Dead Majesty alive!<br/><br/>", "metacritic": null, "released": null, "tba": false, "updated": "2021-11-12T04:01:39", "background_image": "https://media.rawg.io/media/screenshots/3eb/3eb3ebcb73c57c960d5fb270ac9b18fa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 184, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Shockwork Games"], "genres": ["Strategy", "Indie"], "publishers": ["Destructive Creations"], "esrb_rating": null}