{"id": 692605, "slug": "sole-iron-tail", "name": "Sole Iron Tail", "name_original": "Sole Iron Tail", "description": "<strong>Sole Iron Tail is a momentum-based platformer, based around sliding and charging with your tail as fast as your can! </strong><br/><br/><br/><br/><strong>Features:</strong><br/><ul><li>A cute, but challenging single-player adventure with 5 tales (50-60 min playtime), featuring a cast of friendly characters and giant foes!<br/></li><li>Charge, Slide, Surf, and Hover with various mechanics!<br/></li><li>Tons of scarves and badges to collect for 100%!<br/></li><li>Face chatty characters in time trials!</li></ul><br/><br/><br/><strong>Story:</strong><br/>A sole, single Iron Tail has been tracked down within the Snowy Tundra! With the persistent, plundering Pumpkin Co. on their tail, the Iron Tail is losing hope in finding their family. A glimmer of hope appears when some mysterious Stranger creates a path of Golden Scarves, a path that spans snowy slopes, icy icebergs, assaulting airships, and possibly leads to family! But watch out! Your being tracked by something bigger than just Pumpkin Co.. As the Iron Tail, is your special tail slide-ey enough, charg-ey enough, and Iron-ey enough, to reach the last Golden Scarf? Are there any more Iron Tail's out there?<br/><br/><br/><br/>Follow the Golden Scarves! Avoid getting caught by Pumpkin Co.! Find your family!<br/><br/>", "metacritic": null, "released": "2021-11-09", "tba": false, "updated": "2021-11-12T03:37:01", "background_image": "https://media.rawg.io/media/screenshots/f81/f8116bba2765f9051f0c0689b09ad0e8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 216, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Sunset Dreamland"], "genres": ["Action", "Adventure", "Simulation", "Casual", "Indie"], "publishers": ["Sunset Dreamland"], "esrb_rating": null}