{"id": 692641, "slug": "virtualcop", "name": "VirtualCop", "name_original": "VirtualCop", "description": "VirtualCop lets you feel what it’s like to be a New Zealand Police Officer. See what policing in Aotearoa is all about by helping the crime scene staff search for evidence, engage with people in the community, and help direct police resources to catch offenders.<br/><br/>Created using the talents of real officers, VirtualCop allows you to feel the kind of experiences police officers have every day to your PC and VR headset. <br/><br/>Do you care enough to be a cop?<br/><br/><br/><br/>VirtualCop is a Virtual Reality experience that lets you become a virtual member of the New Zealand Police, assisting officers in making Aotearoa the safest country. Your journey will take you from a command center where you'll choose which cases to take, and out into the community where you'll assist officers at the scene of a burglary, or in getting to know the local community in a series of mini-game interactions.<br/><br/><br/><ul><li><h3>Solve Cases</h3>Choose which incoming cases to help our officers with and which units to deploy.<br/></li><li><h3>Meet your Community</h3>Engage in the one of the most important parts of keeping Aotearoa safe, getting to know the community! <br/></li><li><h3>Search for evidence</h3>Sweep a crime-scene for evidence as a Scene of Crime Officer.<br/></li><li><h3>VR or PC</h3>VirtualCop is playable with or without a Virtual Reality headset! <br/></li><li><h3>Do you care enough to be a cop?</h3></li></ul><br/>", "metacritic": null, "released": "2021-11-10", "tba": false, "updated": "2021-11-12T04:06:30", "background_image": "https://media.rawg.io/media/screenshots/d02/d02bbe3737e670327e88b79fae614b84.jpg", "website": "https://www.newcops.co.nz/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 237, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Wrestler"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["New Zealand Police"], "esrb_rating": null}