{"id": 692638, "slug": "temple-of-endless-night", "name": "Temple of Endless Night", "name_original": "Temple of Endless Night", "description": "Use your voice to charm the people around you, or focus on the power of magic to destroy your enemies! Start a servant rebellion, or use poison to solve your problems! Do what your patron deity tells you to, or abandon their teachings! Stay loyal to the Pharaoh, or betray him and join the forces of darkness to change the face of Egypt forever!<br/><br/>Temple of Endless Night is a thrilling 200,000 word interactive fantasy novel by Dariel Ivalyen, where your choices fully control the story. It's entirely text-based—without graphics or sound effects—and fueled by the vast, unstoppable power of your imagination.<br/><br/>When a strange man stops you on the streets of your hometown and sends you to an ancient temple that no one seems to know anything about, you grow both curious and worried. As the caravan gets closer to the mysterious place, you realize that the world around you isn’t exactly what it seems. You see things that are not there, and you can tell something is deeply wrong. Something is trying to influence your mind.<br/><br/>When you find yourself surrounded by nightmares and illusions, will you use the light to cast them out, or will you help them become reality?<br/><br/><ul><li> Choose your gender (male, female, nonbinary).<br/></li><li> Play as gay, straight, bisexual and asexual.<br/></li><li> Romance one of four unique characters: a charming mercenary, a sensible and caring servant, a calculative High Priest, or a forgotten Pharaoh!<br/></li><li> Choose your town, class and god. Work on your relationship with your patron!<br/></li><li> React to situations differently based on your sanity level.<br/></li><li> Experience many different endings, including bad ones.<br/></li><li> Enjoy the beauty of Ancient Egypt.</li></ul><h3>Will You Serve the Light, Or Give In to Darkness?</h3>", "metacritic": null, "released": "2021-11-30", "tba": false, "updated": "2021-11-12T04:04:21", "background_image": "https://media.rawg.io/media/screenshots/595/595e23dc87ea032f3baaf4b3bf2f14c8.jpg", "website": "https://www.choiceofgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 57, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Hosted Games"], "genres": ["Action", "Adventure", "RPG", "Casual", "Indie"], "publishers": ["Hosted Games"], "esrb_rating": null}