{"id": 692689, "slug": "mythbusters-the-game-crazy-experiments-simulator", "name": "MythBusters: The Game - Crazy Experiments Simulator", "name_original": "MythBusters: The Game - Crazy Experiments Simulator", "description": "<p>MythBusters: The Game is an official video game adaptation of the legendary Discovery show. Become a Mythbuster yourself, both in front of and behind the camera!Be a Real Mythbuster</p>\n<p>Utilize the full MythBusters Workshop, and explore other locations like the warehouse, MythBusters Hall, and the testing ground. There’s always a new myth to unlock, so level up to try the next experiment. Be careful and be prepared, because each experiment carries a huge risk. And remember:Don’t Try This At Home</p>\n<p>In MythBusters: The Game, you can:<br />\nSolve puzzles in the Blueprint Zone to work out the mechanics of each myth<br />\nCollect the materials for experiments and craft the equipment to use<br />\nBring the experiment to life by setting it up and testing it out<br />\nConfirm or bust crazy real-life myths, or deem them plausible<br />\nBuild your audience to get as much popularity as you can!<br />\nProduce and Direct!</p>\n<p>Fund and cut your episodes to grow the popularity of the show! First, manage your production budget and inventory. Once you conduct your experiments, play with the video editing module wisely, choosing the best bits to show. Make sure you have everything you need to impress the audience!</p>", "metacritic": null, "released": "2022-09-01", "tba": false, "updated": "2022-09-02T10:45:25", "background_image": "https://media.rawg.io/media/screenshots/f27/f27b665a0e4c5bd2584f960054d49960.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 205, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Byte Barrel"], "genres": ["Adventure", "Simulation"], "publishers": ["PlayWay", "Movie Games"], "esrb_rating": null}