{"id": 692634, "slug": "knights-risen", "name": "Knights Risen", "name_original": "Knights Risen", "description": "The goal is simple, escape the clutches of wilderness. Knights Risen is a multiplayer VR and PC game. Players will utilize different resources to craft, pillage, and loot their way to fight and escape. In this battle of the fittest, only the mighty survive. One may escape, or all my fall to the wrath of Mother Nature.<h3>Survival:</h3><br/>There is only one rule in Knights Risen, survive. Craft tools and weapons to defend yourself. Battle nature and other players to ensure you are the one who makes it out alive.<h3>Crafting and Scavenging:</h3><br/>Players need to scavenge for resources in a widespread area to craft tools and weapons to help them survive and escape. Players can craft weapons or they may craft tools. It all depends on you, whether you like to escape stealthily or go out axe blazing. Only the smartest survive.<h3>Building:</h3><br/>Player needs to withstand the attacks from both the enemies and wild life. To secure themselves, players can build wooden shelters that can help them bear attacks from the environment and other players.<h3>PVP:</h3><br/>Players will have to brave other players in this multiplayer battle-arena, who are hell-bent to be the one to escape.<h3>PVE:</h3><br/>Players will encounter different challenges like extreme radiation, killer tornadoes, and wild and mutant animals. All these elements lead to the player taking damage and losing health.<h3>Flairs:</h3><br/>All Knights have unique abilities or “Flairs” which aid the player in different aspects. Go invisible, heal quicker and more, to be the one who escapes.", "metacritic": null, "released": null, "tba": false, "updated": "2021-11-12T04:00:56", "background_image": "https://media.rawg.io/media/screenshots/ca8/ca8666c6d155d6391e9355ad51139ec0.jpg", "website": "https://knightsrisen.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 504, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Portsea Games"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Portsea Games"], "esrb_rating": null}