{"id": 692704, "slug": "airport-billionair", "name": "Airport BillionAir", "name_original": "Airport BillionAir", "description": "Welcome aboard Pilot, let’s kick the tires and light the fires of your Airport empire today! <br/><br/>You’ve just graduated from Pilot academy and are assigned your very first airport to manage… which happens to be a giant dump. Seriously, this place is one pothole away from a lawsuit!<br/>You and your crew must take on the mission to restore this airport and transform it into the most lucrative business on Earth! You will receive missions to rebuild your terminal by constructing brand new businesses, building your fleet of aircraft, recruiting staff, and piling up profit to restore other airports around the world!<br/><br/>Are you ready for take off? From there, you can become an Airport BillionAir!<br/><br/><br/>ASSEMBLE AIRCRAFT<br/>Assemble your fleet of aircraft, with dozens available from scrappy Bi-Planes to monstrous Jumbos!<br/><br/>BUILD BUSINESSES<br/>Expand your airport by opening new facilities such as Vending Machines, Coffee Bars or Souvenir Shops. It is not only about tapping, be smart and use strategy to pile up even more money and improve your airport!<br/><br/>COLLECT CREW<br/>Automate your airport to generate even more cash with freshly hired Staff. Collect and level up quirky workers for your airport including Pilots, Services, Flight Crew and more!<br/><br/>YOUR AIRPORT IN AUTOPILOT<br/>People are travelling day and night, but don’t worry, your staff will take care of the airport and generate profit while you are away!<br/><br/>MANAGE AN INTERNATIONAL HUB<br/>Build crazy new airports in vibrant locations with our exclusive limited time events, coming soon!<br/><br/>JOIN A FLIGHT ALLIANCE<br/>Join a community of well-heeled and seasoned pilots, and unlock more airports from regional, to international and even space to build a high-flying empire together!<br/><br/><br/>*** Become the richest idle pilot on earth with Airport BillionAir! *** <br/><br/>Disclaimer: an internet connection is required to play the game. Airport BillionAir is free to play but there are optional in-game items that can be purchased for real money. <br/><br/>Pilot, we are ready to help you at any time with problems or questions. We also love receiving suggestions and feedback from you, so feel free to send a message to support@rogueharbour.com. <br/><br/>We are looking to hiring plenty of new pilots for our social channels, feel free to: <br/>--- Like us on Facebook: https://www.facebook.com/AirportBillionAir<br/>--- Visit our website: https://www.rogueharbour.com/", "metacritic": null, "released": "2021-11-08", "tba": false, "updated": "2021-11-12T04:52:48", "background_image": "https://media.rawg.io/media/screenshots/1cd/1cd60ff0b6984e175bd0ab74e1f5516a.jpg", "website": "https://www.rogueharbour.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 205, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Rogue Harbour Game Studio"], "genres": ["Simulation", "Casual"], "publishers": ["Rogue Harbour Game Studio"], "esrb_rating": "Everyone 10+"}