{"id": 69304, "slug": "my-talking-angela", "name": "My Talking Angela", "name_original": "My Talking Angela", "description": "<p>Explore the glamorous world of Talking Angela! Adopt baby Angela and make her your very own virtual pet. She&#39;s all yours to look after as she grows from kitten to cat. Just watch – she’ll become your new best friend!<br />\nPlay addictively cute mini-games and collect coins to get cool items for Angela. You’ll just LOVE her wardrobe. That’s where you can DRESS HER UP IN THE LATEST FASHIONS, and then CHOOSE THE PERFECT PAIR OF SHOES to match her outfit.<br />\nYou can GIVE HER A MAKEOVER whenever you want and make her feel super special. Just pick a lip balm, maybe give her a hint of eye shadow, some mascara, and voila!<br />\nRemember to collect coins! You can use them to MAKE ANGELA’S HOME CHIC AND COZY. You can also FEED HER HEALTHY AND DELICIOUS TREATS. With your help, Angela can have a fabulous life!<br />\nThere are all-new cool features to enjoy in My Talking Angela’s latest update as well, including NEW REWARDS, STICKER SWAPS, GIFTS, DISCOUNTS, AND MORE!<br />\nFRIENDSHIP, FASHION, AND FUN ALL FOR YOU, ALL THE TIME!<br />\nADOPT BABY ANGELA<br />\nAdopt Angela as your very own virtual pet and give her a fabulous life! Help her grow into a stylish city kitty. From teeth brushing to clothes shopping – she’s all yours!<br />\nTAKE CARE OF HER<br />\nMake Angela your very own superstar! Nurture her, sing to her, and feed her delicious treats. Just watch – she’ll become your new best friend!<br />\nCREATE COLORFUL MAKEUP LOOKS<br />\nLipstick, eyeshadow, blush - you can customize her look to your heart&#39;s content!<br />\nEXPRESS YOUR FLAIR FOR FASHION<br />\nYou’re fabulous, so make Angela fabulous too! Dress her in the latest fashions and the cutest costumes, from beautiful ballerina outfits to punk ninja clothes!<br />\nCOLLECT STICKERS<br />\nAs you help Angela grow and progress through the levels, you will collect super cool stickers that you can stick in your album and even swap with your friends.<br />\nPLAY MINI-GAMES<br />\nDiscover and play amazing new mini-games! From Happy Connect and Bubble Shooter to Tiny Puzzles, all your favorites are here!<br />\nAND MUCH MUCH MORE...<br />\nDOWNLOAD FOR FREE AND START PLAYING MY TALKING ANGELA NOW! MAKE HER YOUR SUPERSTAR!<br />\nThis app is PRIVO certified. The PRIVO safe harbor seal indicates Outfit7 Limited has established COPPA compliant privacy practices to protect your child’s personal information. Our apps do not allow younger children to share their information.<br />\n“My Talking Angela” offers users an exclusive monthly subscription with additional exclusive gameplay features as an optional in-app purchase.<br />\nAngela’s Gaming Superpowers monthly subscription is available on a monthly basis and priced at $4.99 per month. Monthly subscription will be charged to the user’s iTunes Account upon confirmation of purchase. The monthly subscription will automatically renew every month unless auto-renew is turned off at least 24 hours before the end of the current month / payment period. If auto-renew remains active during that time, the user’s account will be charged.<br />\nSubscriptions can be managed by the user; auto-renewal can be turned off in the user’s iTunes Account Settings after purchase for the next month. However, no cancellation of the monthly subscription will be possible during an active subscription period.<br />\nThis app contains:<br />\n- Promotion of Outfit7&#39;s products and advertising<br />\n- Links that direct users to other apps and Outfit7&#39;s websites<br />\n- Personalization of content to entice users to play the app again<br />\n- The possibility to use and connect with friends via social networks<br />\n- Watching videos of Outfit7&#39;s animated characters via You Tube integration<br />\n- Items are available for different prices in virtual currency, depending on the current level reached by the player<br />\n- Alternative options to access all functionalities of the app without making any in-app purchase using real money (level progress, games, in-game functionalities, ads)<br />\nTerms of use: http://outfit7.com/eula/<br />\nPrivacy policy: http://outfit7.com/privacy-policy/<br />\nCustomer Support: support@outfit7.com</p>", "metacritic": null, "released": "2015-01-01", "tba": false, "updated": "2022-12-27T13:19:32", "background_image": "https://media.rawg.io/media/screenshots/106/106df0da2b16fd0e66f234935e0919a0.jpg", "website": "http://outfit7.com/", "rating": 3.0, "rating_top": 4, "added_by_status": {"owned": 2, "beaten": 4, "toplay": 1, "dropped": 6, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 9, "suggestions_count": 104, "game_series_count": 0, "reviews_count": 9, "platforms": ["iOS", "Android"], "developers": ["Outfit7"], "genres": ["Simulation", "Casual", "Family"], "publishers": ["Outfit7"], "esrb_rating": null}