{"id": 693065, "slug": "meow-meow-sweety", "name": "Meow Meow Sweety", "name_original": "Meow Meow Sweety", "description": "<p>Humaaan~ Preparing yourself to The Casual Puzzle Game, immersive with nice vibes and background of The Grandma’s shop, where a lot of tasty dessert, together with more a lot of types of adorable cat want to eat up all the dessert in the grandma’s shop.<br/><br/>The way to help all of meow it too easily. Humaaan~ You can touch the sweet on the dessert tower, we will eat it. But you need to be careful the sweets around of me, along with all of obstacle that can push me out of the tower. Meow~</p>\n<p>Moreover 50 level of dessert levels, humaaan~ you can help me challenge your ability in the Endless Tower and rang up to the top of Meow Meow World!<br/><br/>That looks very fun, right!? Wait… we have many joyful events meow~ For<br/>example…<br/><br/>• Challenging over 50 levels<br/>o Challenging with over 50 dessert levels of Grandma’s shop.<br/>o Encountering the obstacles, special events and goals that difference in the levels.<br/>o Collecting point in game to receive 3 stars.<br/>o Immersive with delightful desserts in each level, bright background and melted your heart with the voice of cat.<br/><br/>• Immersive with the Dessert Worlds<br/>o Starting with ‘Moji World’ where is full of testy dessert.<br/>o Waiting fantastic new world when update future patch.<br/><br/>• Rank up in the Leaderboard<br/>o Gathering point to rank up to the top of leaderboard.<br/>o Be the winner of leaderboard and sharing to all players.<br/>o Preserve your position by always gathering point.<br/><br/>• Surprising with Gachapon<br/>o Exciting with random Gachapon for receiving loved cat.<br/>o Each time of random, you can opportunity to receive S rank cat.<br/>o Finishing collects 10 types of the cat.<br/><br/>• More fun with Boosters<br/>o Fun with choose 4 boosters in each level, and easy pass it.<br/><br/>• Achievement<br/>o Encountering many quests that make you funny.<br/>o Unlock new quests when finish the obvious quest.<br/><br/>• Endless Dessert Tower<br/>o Challenging your ability with the dessert endless tower.<br/>o Gathering endless tower point and sharing to your friend for showing your power.<br/><br/>Wooooooow! That’s more events are look have fun! Meow~ Humaaan~ Let’s adventure in Meow Meow Sweety together!<br/><br/>_____________________________________________________________________<br/>Like, Subscribe and Please always follow Meow Meow Sweety for updating latest news at<br/>Facebook Fanpage: https://www.facebook.com/gamax.mms<br/>Email: support@gamaxplus.com<br/>Discord: https://discord.gg/jDPbSpZ7YX<br/></p>", "metacritic": null, "released": "2021-11-11", "tba": false, "updated": "2021-11-12T06:36:19", "background_image": "https://media.rawg.io/media/screenshots/db8/db884cb08c0fd1b3924ecab676255e24.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 49, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["GamaxPlus"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}