{"id": 693003, "slug": "neverlooted-dungeon-demo", "name": "Neverlooted Dungeon - Demo", "name_original": "Neverlooted Dungeon - Demo", "description": "<p>Venture deep into the <strong>Neverlooted Dungeon</strong> and face its treacherous, deadly traps. Armed with your creativity, trusty weapon and magical items, find your own ways to outsmart the dangers in a highly immersive world. Be careful, become paranoid, and be the first to loot the <strong>Neverlooted Dungeon</strong>!<br/></p>\r\nStory\r\n<p>\"Have you ever heard of the Neverlooted Dungeon and its Legendary Treasure? It's a perilous place filled with deadly traps that no one has ever returned from alive, but I'm sure someone as smart and skillful as you could easily succeed. Try your luck now, loot and glory await you!\"</p>\n<p>As you enter, you feel like something isn't quite right, and there may be a good reason why no one has ever returned. Will you be the first to loot the Neverlooted Dungeon?</p>\n\r\nFeatures\r\n<ul><li>Defeat Hidden Treacherous TrapsLive  out an intense adventure with a unique focus on defeating treacherous,  deadly traps. Be careful, pay attention to the details, sharpen your  senses, watch your steps, don't touch anything, become paranoid.\r\n</li><li>Find Your Own Ways Through an Immersive WorldFind  your own ways to overcome the dangers and challenges in a deeply  immersive and interactive world where your creativity is rewarded. Pile  crates on stakes, block saws with chairs, throw buckets at levers - it’s  up to you.\r\n</li><li>Careful Nonlinear ExplorationExplore  a great variety of non-linear levels overflowing with forgotten  secrets, hidden relics, piles of treasure, countless traps, and lurking  monsters.\r\n</li><li>A Dungeon Unlike Any OtherDiscover  a dungeon full of flashing arrows and vending machines, in a unique  satirical dark fantasy world where something really wrong is going on.\r\n</li><li>Customize Your AbilitiesAcquire  powerful magical items to customize your abilities, whether you're a  careful explorer, an outstanding acrobat, or a reckless fighter.\r\n</li><li>Survive Lurking MonstersAvoid monsters, fight them, lure them into traps, kick them into pits, or serve them as food.</li><li>Dying is a New BeginningIf you die, try your luck again. Loot your previous corpse and use it to your advantage to progress even further.</li></ul>\n\r\nJoin the Community\r\n<p>Join the DISCORD to join the community and chat directly with us.\r\n<br/>Follow me on TWITTER to get the latest news.</p>", "metacritic": null, "released": "2021-11-11", "tba": false, "updated": "2022-10-14T10:58:33", "background_image": "https://media.rawg.io/media/screenshots/a96/a96028e7c0311974bb703c0180ac3438.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 249, "game_series_count": 2, "reviews_count": 1, "platforms": ["PC", "Linux"], "developers": ["Wild Mage Games"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}