{"id": 693356, "slug": "armatelum-showdown-the-official-demo", "name": "Armatelum Showdown (The Official Demo)", "name_original": "Armatelum Showdown (The Official Demo)", "description": "<p><strong>Please make sure you download this game's ZIP file via the Itch.io App, so you can get the updates automatically as they come out.<br/></strong>(The video featured is the latest update video of the game but the game available here is even further updated than the build featured in the video. The video is the July 2021 build while this page's game is the October 2021 build.)</p>\n<p>This is a demo version of Armatelum Showdown (Version 4). The content is limited up to Chapter 3. If you want to experience Chapter 4 and beyond, please buy the proper game here!<br/><em>[Steam: Possibly Coming Soon]<br/>[Itch.io: Coming Soon]</em></p>\n<p>A new AR sport known as \"Armatelum\" (Ar-mat-a-lum) is growing in popularity worldwide. They say it's based of an old fairy tail: a history that was lost to the passage of time. This lost legend gets reawaken when a small boy comes into contact with a magical sword from the forgotten era. Join Nova Starrise, stage name: Justice Star (J-Star) as he adventures around the new Armatelum themed resort of Bedandera, meeting new faces and uncovering the mystery of the forgotten past.</p>\n<p>This Visual Novel - Shoot-Em-Up Hybrid will get you adventuring and building affinity with a cool cast of characters while facing off with wacky villains as you help the people of Bedandera and find out more about a legend that's been forgotten to time. As you do so, you'll be playing the fight scenes in a shoot-em-up battle system with customisation options to UPgrade your blaster. <em>Are you ready to Throwdown a Showdown?</em></p>\n<p>For more, please follow the Armatelum Channel YouTube Channel [Click Here] and Twitter [Click Here].</p>\n<p>Warning... There <em>will</em> be bugs, glitches and game crashes that I have missed. If any are found, please report them to me on any social media I'm on. If a crash log shows up, screenshot it and send it my way. Thank you in advance.</p>", "metacritic": null, "released": "2021-11-10", "tba": false, "updated": "2021-11-12T07:47:47", "background_image": "https://media.rawg.io/media/screenshots/424/424e5de892b24fbf35184a870f02c497.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 219, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Armatelum Dev"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}