{"id": 693343, "slug": "historyxhistory", "name": "HistoryxHistory", "name_original": "HistoryxHistory", "description": "<p>Objetivo del Juego:\r\n</p>\n<p>Ser el mejor expositor de las distintas cartas conceptuales asociadas a la Guerra Fría, superando los desafíos de asociación impuestos por la aleatoriedad de las cartas conceptuales y de evento, sin dejar de lado los beneficios o dificultades que resulten de la (s) tirada (s) de los dados de eventos.\r\n</p>\n<p>Preparación:\r\n</p>\n<p>El jugador debe colocar las cartas de conceptos con imágenes mezcladas con las cartas de creación (mazo central) boca - abajo, las cuales se van a revelar dependiendo del nivel de dificultad en el cual decidan competir. Posteriormente, resolverán las cartas de conceptos con imágenes. El siguiente paso corresponderá a la definición de las cartas de eventos y activar las cartas asociadas a estos (antes o al final de la exposición), dependiendo del resultado obtenido: pregunta, tiempo, trampa, bonus y ayuda. Finalmente, se da paso a la exposición de las cartas de conceptos con imágenes, específicamente la definición de las cartas y el (los) puente (s) (relación existente entre dos cartas), lo que será evaluado con una asignación de puntaje en fichas por parte del Gran Master, de acuerdo a sus aciertos, errores u omisiones.  \r\n</p>\n<p>Final de la Partida:\r\n</p>\n<p>El jugador que triunfará en el juego, será aquel que obtenga la mayor cantidad de puntaje en la cantidad de rondas que se pacten con antelación, que puede ser de una, hasta que se terminen las cartas, o bien, cuando uno de los jugadores alcance los 100 puntos.\r\n</p>", "metacritic": null, "released": "2021-11-10", "tba": false, "updated": "2021-11-12T07:43:24", "background_image": "https://media.rawg.io/media/screenshots/9f1/9f1a2b433a7ae1bba72ca32c9578bb3c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["shelitzin", "Jonthan Vega"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}