{"id": 693316, "slug": "crystal-seeker-gaker19", "name": "Crystal Seeker (gaker19)", "name_original": "Crystal Seeker (gaker19)", "description": "<p>Please check out ggenije on Scratch, he did all of the hard work, I just ported it to run natively on PC.</p>\n<p>Oh no! The crystals have been stolen! Take on the role of the Crystal Seeker and get them back!</p>\n<p>A 3D game with a lot of action, some puzzle elements and three tension-filled boss fights!</p>\n<p>Q1: How to save game </p>\n<p>A1: When you beat a level, click on save button </p>\n<p>Q2: Why are enemies 2D </p>\n<p>A2: Because performance </p>\n<p>Q3: Why it is so hard, add more checkpoints </p>\n<p>A3: It is not hard, but you have to think more</p>\n<p>Q4: How to beat the dull bull (level 3)</p>\n<p>A4: Go far away, and make it charge at you in order to destroy the fence. </p>\n<p>Q5: How to beat tech mech (level 6) </p>\n<p>A5: When the big robot do his giant snowball, you have to go beside him and his snowball will land on him , causing him damage. </p>\n<p>Q6: How to beat slog frog (level 9) </p>\n<p>A6: You need to predict the boss movement. The boss always goes in same pattern, jump, tongue, break jump, in jump it can to the all tiles next to it, and also it can skip one tile, in break jump in can jump only on the tiles next to it. Regardless of what jump is it, jump will always jump to the tile which is the nearest to the player. You need to be about one diagonal tile away when frog attacks you with the tongue </p>\n<p>Q7: How to unlock level 6 </p>\n<p>A7: Replay levels in time trial to get time crystals.<br/></p>", "metacritic": null, "released": "2021-11-10", "tba": false, "updated": "2021-11-12T07:37:11", "background_image": "https://media.rawg.io/media/screenshots/0e9/0e929b09945cde20c32733af90a2fecf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 59, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["gaker19"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}