{"id": 6934, "slug": "fighting-fantasy-blood-of-the-zombies", "name": "Fighting Fantasy: Blood of the Zombies", "name_original": "Fighting Fantasy: Blood of the Zombies", "description": "Fighting Fantasy, the world famous interactive gamebook series returns for its 30th Anniversary! Ian Livingstone and Tin Man Games present Blood of the Zombies on iOS!!<br/><br/>\"Insane megalomaniac Gingrich Yurr is preparing to unleash an army of monstrous zombies upon the world. He must be stopped and his undead horde defeated. In this life-or-death adventure the decisions YOU make will decide the fate of the world. Can YOU survive or will YOU become a zombie too?\"<br/><br/>** REVIEWS **<br/><br/>“Blood of the Zombies is a hugely enjoyable, brilliantly presented, hilariously violent romp. If this is your first gamebook or your 30th, you’re going to have a whale of a time.” – POCKET GAMER - 9/10 - GOLD AWARD!<br/><br/>“…its speedy combat and inbuilt adversity make it a great candidate for the app treatment. A skilled app designer and an experienced author have collaborated and managed the rare feat of creating something greater than the sum of their individual talents.” - GAMEZEBO - 4.5/5<br/><br/>“Ultimately, fans of the old stories should enjoy Blood of the Zombies. It delivers an authentic Fighting Fantasy experience while updating the gameplay and style in its own way. ” – STARBURST - 8/10<br/><br/>“…for those looking for an interesting storyline and a delightful walk down memory lane, it’s a sterling effort and one that very much deserves its asking price. I’m already looking forward to other Fighting Fantasy/Tin Man Games collaborations.” – 148 APPS - 4.5/5 – EDITOR’S CHOICE!<br/><br/>“Beautifully presented, a little campy but oh-so-worth that walk down memory lane, Blood of the Zombies will not go amiss in your library of interactive iOS-based tales.” – TOUCH ARCADE - 4/5<br/><br/>** FEATURES **<br/><br/>Blood of the Zombies is a digital Fighting Fantasy gamebook, an interactive adventure in which YOU are the hero! You can only win through by choosing the correct path, finding  equipment, avoiding traps and surviving combat.<br/><br/>Exclusive new features in the app:<br/><br/>• All new death endings, written by Ian Livingstone. Not available in the print book!<br/>• Kevin Crossley’s amazing illustrations colorised for the app, making full use of the high-resolution retina displays.<br/>• Alternate artwork to unlock by Fighting Fantasy favourite, Martin McKenna.<br/>• Achievements to find throughout the gamebook with full Game Center connectivity.<br/>• Make the gamebook as easy or hard as you like and even turn on a special cheat mode to read it old-school!<br/>• An animated Greg Staples cover – the zombie comes to life!<br/><br/>Blood of the Zombies has been brought to iOS using Tin Man Games’ critically acclaimed Gamebook Adventures Engine featuring:<br/><br/>• Universal iOS support. Buy the app once and it works on all your devices!<br/>• Read the book horizontally or vertically on your iPad.<br/>• An automated Adventure Sheet to keep track of stats and inventory.<br/>• Realistic physics based dice rolling. Shake your iOS device!<br/>• Artwork gallery. Find an illustration in the gamebook and be able to access it full-screen forever.<br/>• Bookmarking system which saves your position in the gamebook, much like putting your fingers between the pages to remember your previous page when reading the paperback!<br/>• Specially composed soundtrack and sound effects.<br/><br/>Tin Man Games have signed a licensing deal to release the Fighting Fantasy series on iOS, so expect to see more of your favourite adventure gamebooks appearing on the App Store!<br/><br/>Available Now: The Forest of Doom, Starship Traveller, Island of the Lizard King, Caverns of the Snow Witch, House of Hell and Bloodbones!<br/>Coming Soon: The Warlock of Firetop Mountain!", "metacritic": null, "released": "2012-10-17", "tba": false, "updated": "2019-10-22T14:29:05", "background_image": "https://media.rawg.io/media/screenshots/1ba/1ba8772f1dbb27cb6961f81d9db0a302_sHFDRTU.jpg", "website": "http://www.fightingfantasyapps.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 189, "game_series_count": 11, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tin Man Games"], "genres": ["RPG"], "publishers": ["Tin Man Games"], "esrb_rating": null}