{"id": 69348, "slug": "clay-ball-balloon-slime-game", "name": "Clay Ball & Balloon Slime Game", "name_original": "Clay Ball & Balloon Slime Game", "description": "Beat the boredom with thrifty and fun ideas for kids with the home made slime. You might have tried all the traditional slime making recipes like borax powder, baby powder slimes and edible slimes but have you ever made one with clay balls its not only stretchy and jiggly but too squishy to handle!<br/>Making Clay Ball Slime:<br/>Well this stress relieving game is really fun to play and brings you something new and out of the box fun with traditional slime. In this amazing oddly satisfying game you can now make clay ball slime by mixing different colors of clay balls and pressing them one by one with your finger for some oddly satisfying brain triggering experience. <br/>Making Giant Slime Smoothies with balloon slime<br/>Use balloon slimes to unleash real slime ingredients including crunchy slime and glitter slime ingredients. Cut the balloon in this amazing ASMR cutting activity using scissors and enjoy mixing all the slime ingredients one by one in this amazing ASMR activity. Make so many slimes so your choice. Enhance the fun by putting all these slims into a huge jar to make giant slime smoothie of your choice. <br/>Once the slimes are made you can enjoy fun ASMR activities like<br/>* Satisfying Slime poking <br/>* Antistress Slime pressing with hands<br/>* Calming and soothing Slime Stretching in all directions<br/>* Funny slime fails<br/>* Relaxing jiggly experience <br/><br/>Embrace the making of giant slime smoothies and clay ball slime with this bouncy, jiggly squishy and stretchy experience ever. Enjoy relaxing fun squishy stress reliever game and beat your friends in this amazing giant slime challenge by making the biggest possible slime ever. We bet this is the most satisfying slime ASMR experience that you will relax with playing all day long. Show your amazing creations like giant cloud slime, bead slime, glitter slime and so much more to everyone you don’t need to buy this toy in real after playing this super slime simulator game.", "metacritic": null, "released": "2018-08-26", "tba": false, "updated": "2019-10-22T14:27:00", "background_image": "https://media.rawg.io/media/screenshots/00e/00e2150718ff7b923a47d835fe6f09e3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 116, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sarah Shahzad"], "genres": ["Simulation", "Family"], "publishers": ["Sarah Shahzad"], "esrb_rating": null}