{"id": 693558, "slug": "abash-demo-v101", "name": "Abash Demo v1.01", "name_original": "Abash Demo v1.01", "description": "<p>This is a work in progress.<br/></p>\n\n\n<p><strong>10 Game Rules:</strong></p>\n<p>1. Attacking loses stamina, revealing a blue bar on your health bar. If hit after stamina drops, all stamina shown will turn into damage, along with the damage the regular hit is worth.</p>\n<p>2. Hold down the back right bumper to power up.</p>\n<p>3. Tap the back right bumper to reflect projectiles (projectiles are auto-reflected while blocking). When in control of the projectile, you can tap the back right bumper to absorb your own energy.</p>\n<p>4. To counter a grab, press the grab button before the grab lands (back left bumper).</p>\n<p>5. Combos can be permed by tapping a single button, but each button is respective to a limb. <strong>West </strong>= left punch | <strong>North </strong>= right punch | <strong>South </strong>= right kick | <strong>East </strong>= left kick.</p>\n<p>6. You can alter a move by pairing it with a direction using the dpad.  At any point while attacking, you can perform any move performed in the character's initial stance using any direction / face button. The character will transition into it without any pauses. Make sure not to lose all your stamina as you continue!</p>\n<p>7. To roll or jump, use a diagonal direction. After the stance initiates, press a face button to do a move respective to that stance.</p>\n<p>8. Some moves end in unique stances. In unique stances, directions do not matter. The face buttons do unique moves. Pressing a direction in these stances will perform either a transition into another stance, or move the character back into idle.</p>\n<p>9. Hold down the (front right bumper) button to complete the animation for big damage. If your health is below the health bar marker, a special attack with trigger, as long as your opponent isn't powering up their own.</p>\n<p>10. Win x amount of times to unlock special modes on the main menu. Also, if your frame rate seem low, enter the options settings on the menu to change the quality / resolution.</p>\n<p>Stay up to date on this game's development on Discord: https://discord.gg/PfwfFwRX4Z\r\n</p>\n<p>Enjoy!\r\n</p>\n\n<p>11/11 edit:</p>\n<p>I took care of some glitches based on feedback from the discord. If you notice something weird, please let me know! This demo likely won't receive more content as I continue to develop, but your thoughts will certainly shape the final product!</p>", "metacritic": null, "released": "2021-11-10", "tba": false, "updated": "2021-11-12T08:45:39", "background_image": "https://media.rawg.io/media/screenshots/93c/93caa3e1e6b138b7854309abad89835c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 33, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["UndieStudio"], "genres": ["Fighting"], "publishers": [], "esrb_rating": null}