{"id": 693576, "slug": "digital-janitors-itch", "name": "Digital Janitors (itch)", "name_original": "Digital Janitors (itch)", "description": "Play as an IT admin facing off against merciless hackers on the eve of Y2K!\r\n\r\nFight back against a hacker taking over your workplace!\r\n<p>As the IT admin at Merter Corporation, you’re responsible for making sure the whole corp’s system is running smoothly. Unfortunately for you, the company has been the target of a brutal hack, and everything’s at risk. Battle against malicious folders and save the company!</p>\r\nThe company’s last line of defense? You’re IT.\r\n<p>Ascend Merter Tower, meet the unique characters that work there, and get to the bottom of the mystery. Why are these hackers targeting this company? How deep does the virus go? Discover the motive of the hack and uncover the story of Digital Janitors.</p>\r\nIntense File-Sorting Action!\r\n<p>Excise the virus taking over your workplace through file-sorting action! With dozens of unique power-ups at your disposal, using your sharp skill and an arsenal of potent cyber-abilities fight for the system to save safe files and delete the infected!</p>\r\nThree Game Modes!\r\n<p>Enjoy beyond the <strong>Story </strong>mode with our <strong>Time Trials</strong> and<strong> Endless</strong> game modes! In Time Trials, sort through files as fast as you can in bite-sized challenges! In Endless mode, test your sorting skills against an infinite barrage of malicious files!</p>", "metacritic": null, "released": "2021-11-09", "tba": false, "updated": "2021-11-12T08:52:03", "background_image": "https://media.rawg.io/media/screenshots/238/2385b3dd8b0c22a7ae65ef0665d63c89.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 142, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["TiredTurtleGames"], "genres": ["Action"], "publishers": [], "esrb_rating": null}