{"id": 693644, "slug": "prototype-the-wolf-of-the-ivory-tower", "name": "(Prototype) The Wolf of the Ivory Tower", "name_original": "(Prototype) The Wolf of the Ivory Tower", "description": "<p>== The Wolf of the Ivory Tower ==<br/></p><p>A proof of concept for combining the Ink scripting language with a simple tile-based positioning. It's not complete but it contains just enough dialog and environment to give a slight impression of an open-world environment. Right now there's only movement and dialog but what's already implemented can easily be extended to include inventory, player attributes/statistics, combat, and perhaps a day/night cycle.<br/></p>\n<p>If you have any suggestions or want to see more, leave a comment!</p>\n<p>== Editing ==<br/></p>\n<p>The text input at the top left is for pasting in a script made with the Ink language. To try it out yourself, learn Ink here: https://www.inklestudios.com/ink/ and then write a script in the Inky editor for debugging. When you're done, you'll have a script that looks like this: https://pastebin.com/Mc0qtUMe that you can then paste into this game to see it played in-engine. The only restriction at the moment is that it will only display 5 options (only because I didn't need more).</p>\n<p>To pan the camera, use the custom external \"camera_pan(x, y)\" function. For example:</p><p>~ camera_pan(2, -1)</p><p>will move the camera to two squares east of the origin and one square to the south.<br/></p><p>There's no option for changing, rearranging, or adding new art to the terrain, however there's nothing stopping you from writing a story that pans the camera out into space to match art that hasn't been drawn yet.<br/></p>", "metacritic": null, "released": "2021-11-09", "tba": false, "updated": "2021-11-12T09:10:57", "background_image": "https://media.rawg.io/media/screenshots/eec/eecd6f6161a387b42ce9c339305fd7b0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 17, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Flaise"], "genres": [], "publishers": [], "esrb_rating": null}