{"id": 69372, "slug": "my-talking-tom", "name": "My Talking Tom", "name_original": "My Talking Tom", "description": "<p>Is it a baby? Is it a puppy? No! It’s Talking Tom! The cutest kitten, the coolest cat, and the biggest superstar in the world!<br />\nMy Talking Tom is the best virtual pet game for children, and big kids of all ages. That’s right - even grandma and grandpa can join the fun!<br />\nAdopt Tom as a cute kitten and take care of him every day. Make sure he gets enough food and sleep, take him to the toilet, and keep him happy, smiling and laughing. You can pet and poke Tom, and even speak to him - he repeats everything you say in his cute, funny voice! Tom even has a collection of fun mini games to play - puzzle games, action games, adventure games, and even a sport game. There’s something for everyone!<br />\nAs you play, Tom grows up and you unlock loads of cool new clothes for him and new furniture items for his house. There are many costumes to choose from - an astronaut, a pilot, a superhero… or maybe you just want to dress Tom in something cool and casual. You can even mix and match Tom’s clothes for some crazy combinations! And every room in Tom’s house can be customized too!<br />\nMillions of people play My Talking Tom every day, so why not join the fun? You can even take Tom on trips to other countries and build up an album of photos from his travels!<br />\nAnd best of all… it’s absolutely FREE! So download now, and start playing today!<br />\nThis app is PRIVO certified. The PRIVO safe harbor seal indicates that Outfit7 has established COPPA-compliant privacy practices to protect your child’s personal information. Our apps do not allow younger children to share their information.<br />\n“My Talking Tom” offers users an exclusive monthly subscription with additional exclusive gameplay features as an optional in-app purchase.<br />\nTom’s Game Squad monthly subscription is available on a monthly basis and priced at $4.99 per month. Payment will be charged to the user’s iTunes Account upon confirmation of purchase. The subscription will automatically renew every month unless auto-renew is turned off at least 24 hours before the end of the current payment period. If auto-renew remains active during that time, the user’s account will be charged.<br />\nSubscriptions can be managed by the user; auto-renewal can be turned off in the user’s iTunes Account Settings after purchase. However, no cancellation of the subscription will be possible during an active subscription period.<br />\nThis app contains:<br />\n- Promotion of Outfit7&#39;s products and advertising;<br />\n- Links that direct customers to Outfit7’s websites and other apps;<br />\n- Personalization of content to encourage users to play the app again;<br />\n- The possibility to connect with friends via social networks;<br />\n- YouTube integration to allow users to watch videos of Outfit7&#39;s animated characters;<br />\n- The option to make in-app purchases;<br />\n- Items to purchase (available in different prices) using virtual currency, depending on the player’s progress; and<br />\n- Alternative options to access all functionalities of the app without making any in-app purchases using real money.<br />\nTerms of use: http://outfit7.com/eula/<br />\nPrivacy policy: http://outfit7.com/privacy-policy/<br />\nCustomer support: support@outfit7.com</p>", "metacritic": null, "released": "2013-12-01", "tba": false, "updated": "2023-08-14T13:47:52", "background_image": "https://media.rawg.io/media/screenshots/961/9613b2d7432a5df9f3fad797b8b34869.jpg", "website": "http://outfit7.com/", "rating": 3.38, "rating_top": 4, "added_by_status": {"owned": 2, "beaten": 4, "dropped": 8, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 8, "suggestions_count": 92, "game_series_count": 0, "reviews_count": 8, "platforms": ["iOS", "Android"], "developers": ["Outfit7"], "genres": ["RPG", "Simulation", "Casual"], "publishers": ["Outfit7"], "esrb_rating": null}