{"id": 69373, "slug": "31-gold", "name": "31 Gold", "name_original": "31 Gold", "description": "This fast paced casual card game for all ages is a time travel into your past. Teenage fortune hunters, pub gamblers and daredevil holiday gamers listen up: Now available for iPhone or iPad, “31” sets a new challenge for anyone with a soft spot for timeless card games. On holiday, on the go or within your own four walls, simply pull out your iPhone or iPad, tap on the app and let the game begin… <br/>The hands are dealt, the deal moves clockwise, it´s your turn. Use your power of deduction. It´s all about drawing and swapping cards or passing at the right time. Three cards of the same suit or the same value earn you the highest score. A hand value of “31” reigns supreme, the name of the game. You knock on the table: Blitz! With an ace and two face cards you are all set for the next round. When you lose your three lives (matches), you get one extra, your very last chance, if you miss it, you are out. But don´t worry, “31” is addictive. You´ll soon be playing over and over again.<br/><br/>31 comes with full localization in: English, French, German, Spanish, Italian, Dutch, Danish, Norwegian, Russian, Japanese, and Chinese.<br/><br/>Features:<br/><br/>-\tsophisticated 3D graphics<br/>-\tintuitive controls <br/>-\tup to three opponents<br/>-\tcountless settings (players, lives, cards, sounds...)<br/>-\tresult list<br/>-\toptimised for iPad", "metacritic": null, "released": "2010-09-23", "tba": false, "updated": "2019-10-22T14:27:00", "background_image": "https://media.rawg.io/media/screenshots/248/248be19170bd5b241cb2b03240ebb974.jpg", "website": "http://www.lite-games.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 71, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["LITE Games"], "genres": ["Board Games", "Card"], "publishers": ["LITE Games"], "esrb_rating": null}