{"id": 693813, "slug": "minesweeper-interactive-poster", "name": "Minesweeper Interactive Poster", "name_original": "Minesweeper Interactive Poster", "description": "Walkthrough\r\n<ul><li>My Documents\r\n<ul><li>Click the PDF to see the previous game poster assignment\r\n</li></ul></li></ul>\n<ul><li>Recycle\r\n<ul><li>Click the first pdf to see the old font study poster\r\n</li><li>Click the second pdf to see an old design for a bomb\r\n</li><li>Click the third pdf to see another old font study poster\r\n</li></ul></li></ul>\n<ul><li>Media Player\r\n<ul><li>Click the first mp3 to hear an 8-bit version of Blink-182’s All the Small Things \r\n</li><li>Click the second mp3 to hear an 8-bit version of aha’s Take On Me\r\n</li><li>Click the third mp3 to hear an 8-bit version of Destiny’s Child’s Say My Name \r\n<ul><li>Click the same mp3 file to pause the music</li></ul></li></ul></li></ul>\n<ul><li>Minesweeper Demo\r\n<ul><li>Features a playable mini minesweeper game\r\n<ul><li>Nothing happens when you win\r\n</li><li>Restart the project to play again\r\n</li></ul></li></ul></li></ul>\n<ul><li>Discord\r\n<ul><li>Click the first spoiler button to reveal an AM Roasting Meme\r\n</li><li>Click the second spoiler button to reveal an AM Quote Meme\r\n</li></ul></li></ul>\n<ul><li>Zoom\r\n<ul><li>Click the picture of Pepper to her them meow\r\n</li></ul></li></ul>\n<ul><li>After all icons have been explored, one last poster for Minesweeper will show up on the desktop along with some background music\r\n</li></ul>\r\nDesign Goals and Process\r\n\r\n<p>For this interactive poster I wanted to try and recreate an interactable computer / desktop with that of the Windows 98 aesthetic. Going off of this idea, I tried to reuse and recreate the windows and match the same colors that were used. My end goal was ultimately an interactive experience mixing both older aesthetics of Windows 98 while also adding a touch of more present computer applications and also some references to the class ARTG 80G. \r\n</p>\n<p>While working on this assignment, I wanted to add more pixel animations but was limited due to my laziness to try and figure out how animation works on P5. I also got the chance to toss ideas back and forth with Patrick during office hours and one concept that came up that I would have loved to integrate would be a transition from the old gross color palette of the cold blues and greys to that of the windows vaporwave aesthetic with a brighter mix of pinks and blues.  A glitching effect as the user moved between the icons could of had some potential. Along the lines of other icons, the idea of making a sketchpad came up, letting the user draw and sketch whatever they wanted. Due to risking its implementation of an additional canvas and the lack of clearing said second canvas prevented its addition to the poster.</p>\n<p>But with the stuff that I was able to complete, I’m happy that I was able to figure out how to code separate scenes for the different browsers along with the working bounding boxes. I was so frustrated trying to figure out how to get the dang clickable boxes working. It took a hot minute, but once I was able to figure it out, I was able to start churning them out like a factory. This along with the music was one of my bigger accomplishments when working on this assignment. There was so much satisfaction listening to the 8-bit songs play from the p5 file, being able to play, pause, and switch between the different songs was so cool to me. In a way, I kind of wished I spent more time adding a bigger selection of songs.\r\n</p>\n<p>On the other hand there were some complications that arose while slowly making progress. One issue that came up while coding was being unable to close the windows of the different files after opening them. I had coded the different bounding boxes and shapes that were necessary, but I wasn’t able to wrap my head around trying to hide the objects after having them shown. A similar issue arose to the minesweeper demo. At first the minesweeper wasn’t suppose to be a demo, but I was unable to figure out how to reset the game having “hacked” the game from another source. With this road bump I thought I would turn it into an intentional design and serve as a “demo” with only 1 play.\r\n</p>\n<p>Overall though I can say that I’m a little proud with what I was able to make even with all of the voices in my head saying otherwise. Hope ya enjoy :)</p>", "metacritic": null, "released": "2021-11-09", "tba": false, "updated": "2021-11-12T09:52:45", "background_image": "https://media.rawg.io/media/screenshots/d02/d02c60869756bd46ca060c2c152bae45.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 2, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Joostan"], "genres": [], "publishers": [], "esrb_rating": null}