{"id": 693894, "slug": "4-plant-pvz-clone-test-night", "name": "4-Plant PvZ Clone Test (Night)", "name_original": "4-Plant PvZ Clone Test (Night)", "description": "<p>You know the drill, all assets are from Popcap / EA, I do not wish to claim them as my own and this is only made for non-profit purposes.</p><p>MAIN EDIT: The puffshroom bugs seem to be gone for now. The following edits happened before I fixed the problem.</p>\n<p>EDIT: I reworked a bug which caused only one Puffshroom in line to attack. Sadly I couldn't stop Puffshrooms to attack when there's a zombie behind them. However, as I only wanted the Puffshrooms to attack zombies that are up to 3 blocks forward, I put it so a Puffshroom spore destroys after reaching the 3rd block.</p>\n<p>EDIT 2: I messed up the code and now the updates won't work. Can't figure out the reason for now so this might be the last version for a very long time. I promise I will try my best to fix it.</p>\n<p>So, EA didn't take out my last PvZ related project, so why not try another one? I'll try not to surpass their limits but I really wanted to try out another version of this.</p>\n<p>So yeah, you now got the Sunshroom, the Puffshroom, the Iceshroom and the Grave Buster. I may change the zombies to newer ones (I was thinking football and newspaper maybe) but for now they're the same as the old version.</p>\n<p>I also added a grave rising mechanic as it happened in night levels. It's kinda different but I tried making everything the most accurately possible as it was in the og game.</p>\n<p>If you found this project but want the day version with the Sunflower, Peashooter, Wall-nut and Potato Mine, here it is: </p>\n<p>https://missingwilliam.itch.io/4-plant-pvz-clone-test</p>", "metacritic": null, "released": "2021-11-09", "tba": false, "updated": "2021-11-12T10:15:05", "background_image": "https://media.rawg.io/media/screenshots/642/6429e8dc31446fa99ad715ffcc0c2ce8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 25, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["MissingWilliam"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}