{"id": 693967, "slug": "spaceship-atari-2600", "name": "Spaceship Atari 2600", "name_original": "Spaceship Atari 2600", "description": "<p>This is my first prototype for a new Atari 2600 game. It is still missing a lot stuff, (animations, game logic, ...) but the core of the game is there. It is a horizontally scrolling shooter where the player should destroy all the enemies before they reach the left side of the screen. In the top scoreboard bar the \"L\" indicates the remaining lives and the \"E\" indicates the max number of enemies that can reach the left part of the screen before the game over. The player has only 1 missile that, after bein fired,  is available again only when  it reaches the right part of the screen or is destroyed while hitting an enemy. There can be up to 6 enemies on the screen at the same time with different speed (in the final game the number of enemies will increase over time, for now just to present the game all the enemies are appearing on the screen).</p>\n<p>The game is entirely developed in assembly using the 8bitworkshop website ide (I also bought the book indicated in the website - Making games for the Atari 2600 -  it is awesome and very helpful to write Atari 2600 games).</p>\n<p>The game runs using the Javatari emulator.</p>\n<p>Thanks a lot to Gustavo Pezzi and his great Udemy course about Atari 2600 (Learn Assembly Language by Making Games for the Atari 2600 | Udemy)</p>\n<p>Also great help came from this website for the playfield scrolling.</p>", "metacritic": null, "released": "2021-11-08", "tba": false, "updated": "2021-11-12T10:33:09", "background_image": "https://media.rawg.io/media/screenshots/591/59102cbb46f3c1ff3c56bc7792301bdf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 6, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["kamaleon70"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}