{"id": 694, "slug": "super-glyph-quest", "name": "Super Glyph Quest", "name_original": "Super Glyph Quest", "description": "Combine elemental glyphs together to cast powerful spells and vanquish adorable monsters in this puzzler that&amp;#39;s so much more than a match 3.<br/><br/>&amp;quot;Bigger and better than before.&amp;quot; - Touch Arcade, 4.5/5 stars.<br/>&amp;quot;Super Glyph Quest has a foot in both the puzzle and role playing game worlds and delivers on both fronts.&amp;quot; - Arcade Sushi, 8/10 sushis.<br/>&amp;quot;Super Glyph Quest really does offer that ‘just one more go’ factor&amp;quot; - 148Apps, 4/5 stars.<br/><br/>It&amp;#39;s been almost 1000 years since the Bad Dragons were defeated and banished from the world. Spells began to weaken and monstrous creatures disappear as slowly all of the magic withered without the Bad Dragons to keep it alive. It&amp;#39;s been almost 1000 years of peace but all of that is about to change as one jilted Magus seeks to bring the magic back.<br/><br/>Featuring:<br/>New Glyphs!  The elements of Primal and Metal join Air, Earth, Fire, Water, Light and Dark.<br/>New Spells!  Over 60 spells to master.<br/>Character Customization!  Create your very own caster.<br/>More Quests!  All new map with a host of new questing locations.<br/>Crazy Collaborations! Guest stars from Monument Valley, Hatoful Boyfriend and Skullkickers.<br/>New Story!  Character interactions and conversations.<br/>More Monsters!  All new fiends to save the world from.<br/>Crafting!  Create new gear out of all those pelts and icky stuff.<br/>Levelling Up!  Customize your play with new abilities and power ups.<br/>Multiple Enemy Encounters!  More than one critter can show up in battle at once.", "metacritic": null, "released": "2014-10-22", "tba": false, "updated": "2019-10-22T14:27:32", "background_image": "https://media.rawg.io/media/screenshots/548/548457ae99ec226f6d29976bdfad547e.jpeg", "website": "http://glyphquest.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 113, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Alexander Trowers"], "genres": ["RPG", "Puzzle"], "publishers": ["Alexander Trowers"], "esrb_rating": "Everyone 10+"}