{"id": 69406, "slug": "joyride-live-game-shows", "name": "Joyride: live game shows", "name_original": "Joyride: live game shows", "description": "Already know all the answers to Jeopardy and Wheel of Fortune?  Dominating QuizUp, TriviaCrack, and SongPop?  Then you're going to love the live trivia game shows on Joyride!<br/><br/>With live trivia and music game shows streamed to you everyday, you play against the community and win with your friends!  <br/><br/>On Joyride, you'll get to:<br/>*  Play in live quiz shows for fame and fortune<br/>*  Connect with your friends and play as a team<br/>*  Interact with the community in text chat and make new friends<br/>*  Join video chats with friends to keep playing when the show's over<br/><br/>What are you waiting for? Discover our live shows like Music Mania, Quizzo, and Trivia Crush and start having fun!<br/><br/>Note: Must be 13 or older to use the app. Need to enjoy fun, meeting cool people, and socializing. Don’t be mean. Don’t be gross.<br/><br/>WANT MORE KEYS?<br/>Upgrade to become a Joyride Member to receive even more keys every week. Keys allow you to continue playing after a wrong answer and to access premium content. <br/><br/>* Joyride offers subscriptions which may include a free trial<br/>* Joyride subscriptions cost starts at $6.99 per week and provide 14 keys per week<br/>* Only subscribers will be able to purchase key packs starting at $6.99/14 keys<br/>* Any unused portion of a free trial period, if offered, will be forfeited when you purchase a subscription to that publication, where applicable<br/>* You'll be able to access your weekly keys for the duration of your subscription<br/>* Payment will be charged to your iTunes Account at confirmation of purchase<br/>* Subscriptions may be managed in your iTunes Account Settings after purchase<br/>* Subscriptions auto-renew unless turned off in your iTunes Account Settings at least 24-hours prior to the end of the current subscription period<br/>* No cancellation of the current subscription is allowed during active subscription period<br/>* If you don’t choose to purchase a Joyride Membership subscription, you can continue to play for free<br/>* Prices are equal to the value that \"Apple's App Store Matrix\" determines is the equivalent subscription price in USD<br/><br/>By using Joyride, you agree to our Terms of Use, Privacy Policy and Contest Rules:<br/>https://www.onjoyride.com/legal#terms<br/>https://www.onjoyride.com/legal#privacy<br/>https://www.onjoyride.com/legal#rules", "metacritic": null, "released": "2016-12-30", "tba": false, "updated": "2019-10-22T14:27:01", "background_image": "https://media.rawg.io/media/screenshots/743/743e5f9ba14c77b880e3468f1f0abc90.jpg", "website": "https://www.onjoyride.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["KIWI"], "genres": ["Family"], "publishers": ["Kiwi"], "esrb_rating": "Mature"}