{"id": 694146, "slug": "croquet-climb-final-version", "name": "Croquet Climb (Final Version)", "name_original": "Croquet Climb (Final Version)", "description": "<p><strong><em>Trailer (Script in youtube description): </em></strong></p>\n\n\n\n<p><strong><em>Croquet Climb</em></strong> is a game about hitting a ball up a hill, but you only have a few shots to do it. In the Foddian spirit, there are lots of ledges and slopes that if not navigated with precision will make you lose lots of progress, but most concerningly, running out of shots will cause your next shot to be almost completely uncontrollable. To give you a chance, there are <strong>w</strong><strong>ickets</strong> and <strong>flags </strong>along your path that can give you extra shots.\r\n</p>\n<p><strong>Wickets</strong> are white hoops which can be tricky to get through, but if you manage to do so, you will be rewarded with <strong>+1 shot</strong>. Accurately hitting the ball through wickets is vital to beating the game, but if you have a bad angle,<strong> you can decide to skip a few since all wickets are optional</strong>.\r\n</p>\n<p><strong>Flags</strong> are wooden poles in the ground which when hit will reward <strong>+5 shots</strong>, but they are very scarce and can only be collected once. When you run out of shots, however, all of the flags will reset so you can collect them again.</p>\n<p><strong>CONTROLS:</strong>\n</p>\n<p>The only control you need to know is <strong>click and drag</strong> to hit the ball. You can do this <strong>even while the ball is rolling</strong> if you are about to go over a ledge or miss a wicket, but be careful not to go overboard and waste all your shots.\r\n</p>\n<p>The game is playable through the browser, but downloading the executable directly will give you a higher quality experience.\r\n</p>\n<p>If you enjoy the game, you can check out my other Foddian game Worm Adventure 4: Into the Wormhole. I had a lot more than a week to work on it, and it's a lot more polished, unique, and fun in general\r\n</p>", "metacritic": null, "released": "2021-11-08", "tba": false, "updated": "2021-11-12T11:17:42", "background_image": "https://media.rawg.io/media/screenshots/853/853dd7c51ae44f97bb7a280e33b49bff.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 23, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Lummie Thief"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}