{"id": 694396, "slug": "junkpunk", "name": "JUNKPUNK", "name_original": "JUNKPUNK", "description": "Embark on a journey of transformation to <strong>restore</strong> an entire planet that has encountered a horrific runaway event. You must <strong>craft</strong>, <strong>manufacture</strong>, <strong>grow</strong> and <strong>manage</strong> to return the planet to its former prosperity. <strong>JUNKPUNK</strong> is an <strong>upto 5 player multiplayer</strong> experience but can still be enjoyed as a singleplayer. <strong>Explore</strong> a huge handcrafted and detailed open world filled with different biomes and locations. Explore these locations to discover new items, tech and story.<br/> <br/><br/><br/><br/><br/><strong>Clean and transform</strong> the world you have crash landed on, using a multitude of machines, crafted items and tools. <strong>Explore</strong> the world and collect varying types of scrap materials found across the planet's surface. <strong>Recycle</strong> and <strong>refine</strong> these items to craft and build higher tier equipment and items. <br/><br/><br/><br/><br/><strong>Collect</strong> seeds, balance soil, water and power to <strong>grow plants</strong>. Start regrowing plant life for the planet's surface. Use these plants to create a biological key and transform the planet's atmosphere. <br/><br/><br/><br/><br/><br/><strong>Manufacture</strong> to construct special items to assist in unlocking super machines and convert the planet. Start by manually crafting then progressively automate your entire workflow to become almost fully <strong>autonomous</strong>.<br/><br/><br/><br/><br/><br/>Construct a customisable base from many different pieces that can be found and refined on the planet's surface. Build your own vision of manufacturing.<br/><br/><br/><br/><br/>Brave dust storms and extreme windspeeds. Harvest fluctuating energy from the sun and the wind. Store power in batteries as backup to continue automated crafting.<h3>Roadmap </h3><br/>", "metacritic": null, "released": "2021-11-12", "tba": false, "updated": "2021-11-15T03:04:19", "background_image": "https://media.rawg.io/media/screenshots/5b3/5b39e4fc74b06dcd5dcd344fb1195032.jpg", "website": "https://www.seacorptech.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 18, "dropped": 1}, "playtime": 2, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 482, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["SCT"], "genres": ["Adventure", "Simulation", "Casual", "Indie"], "publishers": ["SCT"], "esrb_rating": null}