{"id": 694466, "slug": "dino-quest-2-3d-dinosaur-game", "name": "Dino Quest 2: 3D Dinosaur Game", "name_original": "Dino Quest 2: 3D Dinosaur Game", "description": "Imagine yourself managing a Jurassic world museum, where 3D dinosaurs and fossils can decorate a museum on your phone: welcome to Dino Quest 2, the sequel to the highly acclaimed paleontology/dinosaur game, Dino Quest!<br/><br/><br/><br/>Explore the world and dig fossil after fossil to show off your dino collection in your jurassic museum, in this mobile paleontology dino game! Dig up dinosaur bones, complete new fossils, and start your own jurassic world park in your dino museum.<br/><br/><br/>Speaking of a world famous dinosaur museum, this time around, you can get behind the management of your very own dino museum! Attract more visitors with new, impressive dinosaur species you've dug up in your excavations as the only paleontology master alive!<br/><br/><br/>In Dino Quest 2 you can find 3D dinosaur models for you to decorate your dino museum - it's a Jurassic world made alive, all over again! And this time, fossils themselves will not harm the visitors!<br/><br/><br/>Several different dinosaur species await you, the best paleontologist we have!<br/><br/><br/>Bring all visitors alive and VIP visitors to your museum so you can earn more money and get to farther expeditions to discover even more dinosaur fossils!<br/><br/><br/>Manage your own museum and watch it get full of visitors claiming this is the best dino museum ever - let's make this dinosaur experience awesome so all visitors can enjoy and stay alive (no pun intended)! Imagine your museum with a T-rex fossil!<br/><br/><br/>What’s the best thing to do if you see a Tyrannosaurus Rex?<br/><br/>Pray that it doesn’t see you.<br/><br/>What dinosaur could jump higher than a house?<br/>All of them. Houses can’t jump.<br/><br/><br/>Please note! This fossil finding and museum managing game is free to play, it contains items that can be purchased for real money. Some features in the description of this dinosaur game may also have to be purchased for real money.<br/><br/><br/><br/>Also, to support our devs even more, you can always check our no ads deal!<br/><br/><br/><br/>", "metacritic": null, "released": "2021-11-10", "tba": false, "updated": "2021-11-15T04:00:23", "background_image": "https://media.rawg.io/media/screenshots/84c/84c72f8721b941f18ac988a484f84d50_9Ikv4UJ.jpg", "website": "http://tappsgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 148, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tapps Games - Jogos Eletronicos"], "genres": ["Strategy", "Simulation"], "publishers": ["Tapps Games - Jogos Eletronicos, Unipessoal, Lda"], "esrb_rating": "Everyone 10+"}