{"id": 694456, "slug": "blue-archive", "name": "Blue Archive", "name_original": "Blue Archive", "description": "<p>A Story Kept Within the Heart<br />\nYouth x Academy x Military RPG = Blue Archive<br />\nYou have been appointed as an advisor to the Federal Investigation Club, Schale, located in Kivotos. It&#39;s a huge academy city where numerous academies are clustered together.<br />\nResolve the endless incidents that occur in Kivotos with charming allies full of personality, and build special memories with them!<br />\n■ 3D battles with cute characters<br />\n3D real-time battles with detailed animations and skill cutscenes will keep you glued to the screen!<br />\nConsider your team’s abilities, terrain, and synergy to guide them to victory with your strategic leadership!<br />\n■ The more you get to know them, the more charming your allies get<br />\nThe more time you spend with each character, the deeper the bond.<br />\nInteract using the in-game messenger, Momo Talk, and discover new charming secrets!<br />\n■ An exciting story that gets you curious about how it will all unfold<br />\nAn unpredictable main story about the girls&#39; friendship, love, and thrilling military action adventures!<br />\nDiscover a miracle within the wild daily lives of these characters through relationship stories that can reveal their innermost feelings, as well as sub stories that show the daily lives of various clubs!<br />\nFollow Us:<br />\nOfficial Site: https://bluearchive.nexon.com/<br />\nFacebook: https://www.facebook.com/EN.BlueArchive<br />\nTwitter: https://twitter.com/EN_BlueArchive<br />\nYoutube: https://www.youtube.com/channel/UCsrnDYrkovQhCCE8kwKcvKQ<br />\nNote: An internet connection is required to play this game.<br />\n<em>For the best gaming experience, the following specs are recommended: iOS 13 or higher / iPhone 8+ or higher / Minimum 3GB RAM required<br />\nBy downloading this game, you are agreeing to our Terms of Service and Privacy Policy.<br />\n- Terms of Service: http://m.nexon.com/terms/304<br />\n- Privacy Policy: http://m.nexon.com/terms/305<br />\n■ App Permission Information<br />\nIn order to provide services below, we are requesting certain permissions.<br />\n[Optional Permission]<br />\nCamera: To take photos or record videos for upload<br />\nPhotos: To save and upload photos / videos<br />\nMicrophone: To enable voice chat during the game<br />\n</em>You can still use the service without granting optional access.<br />\n[Permission Management]<br />\n▶Go to Settings &gt; Privacy, select a permission and toggle the button next to the app&#39;s name.<br />\n※ This app offers in-app purchases. You can disable this feature by adjusting your device settings.</p>", "metacritic": null, "released": "2021-02-04", "tba": false, "updated": "2024-03-10T04:07:44", "background_image": "https://media.rawg.io/media/screenshots/7ea/7ea528219d53d8987eac8d45292fb907_5OluUrF.jpg", "website": "https://bluearchive.nexon.com", "rating": 4.11, "rating_top": 4, "added_by_status": {"yet": 3, "owned": 3, "toplay": 4, "dropped": 8, "playing": 10}, "playtime": 0, "achievements_count": 0, "ratings_count": 9, "suggestions_count": 393, "game_series_count": 0, "reviews_count": 9, "platforms": ["Android", "iOS"], "developers": ["NEXON Company"], "genres": ["RPG", "Strategy"], "publishers": ["NEXON KOREA", "YOSTAR"], "esrb_rating": "Teen"}