{"id": 694449, "slug": "blitz-rise-of-heroes", "name": "BlitZ: Rise of Heroes", "name_original": "BlitZ: Rise of Heroes", "description": "A new mobile arena full of brave heroes has arrived! Dive into an epic fantasy RPG in BLITZ: Rise of Heroes! Summon your legendary warrior, battle for victory, and dominate your way to glory!<br/><br/>Features:<br/><br/>Choose heroes by alliances, stats, and classes<br/>Upgrade your warriors in various ways<br/>Level up weapons to increase their power<br/>Train your squad of summoners <br/>Fight in manual or auto 6v6 battles<br/>Accumulate resources even when you’re offline<br/>Get free daily rewards <br/>Explore locations, each with tricky enemies<br/>Autobattler gameplay to play anywhere and anytime.<br/><br/>Become a hero!<br/><br/>Immerse yourself in hundreds of hours of epic stories. Enjoy fast-paced combat with thrilling special effects, great sound effects, rewarding damage points, all set against breathtaking backdrops. Fight monsters and try to survive while looting valuable items to further increase your character’s strength. Earn experience, learn new skills, and conquer the world of Asteria. BLITZ: Rise of Heroes is also an idle fantasy RPG with an auto-battle mode. Even if you’re offline, your heroes will still be fighting for you!<br/><br/>Challenge epic bosses!<br/><br/>Set up your team in these 6v6 battles and watch your strategy unfold on the battlefield. The further you advance, the tougher the fights and the more valuable the rewards. Every RPG combat in our game is an exciting idle duel! Crush dozens of evil bosses for more loot, powerful gear, and glory! Deploy your winning formations to earn trophies and dominate this fantasy world, and become the true legend of BLITZ: Rise of Heroes!<br/><br/>Improve your warriors!<br/><br/>Build your characters from the ground up! Train recruits, level them up, develop skills, use only the best weapons, and get amazing gear. Sell or buy the warriors, or even remove duplicate heroes in the Heavenly Forge! Get fighters as a reward for victories or exchange them for more powerful warlords. Put forth your best conquerors to battle the forces of darkness in this idle Blitz arena! Develop perfect game tactics! May the war of mighty knights reveal who is the strongest! <br/><br/>Upgrade weapons!<br/><br/>Get free weapons from daily bonuses or as a reward after royale battles. Craft and forge deadly weapons, level them up, and upgrade their abilities and rarity. Equip your warriors with the best gear, and become a master of sword crafting!<br/><br/>Form invincible squads!<br/><br/>Strategy is key to victory in this game! Unlock legendary heroes and upgrade them nonstop to help your armies win the battles. Your squads can have up to 6 characters from different factions, each with unique features. Each warrior has a rare super attack that accumulates over time depending on the damage done. Craft schemes with other alliances and create unique synergies to overcome your opponents in each round!<br/><br/>Enjoy the adventure!<br/><br/>Embark on an epic voyage of wonder and courage. Discover the mysterious world of Asteria, and travel through different locations with new challenges, hidden secrets, exclusive enemies to fight, and legends to discover. Clash with cursed monsters and ultimate bosses in the dark dungeons to find even more treasures!<br/><br/>Get daily rewards!<br/><br/>Log into the game every day to receive amazing rewards. Get gold to purchase new upgrades, find scrolls and hero spirits to summon new warriors, and gain hero experience to increase your stats.<br/>Use strategies to boost your ranking and win the final prize!<br/><br/>Join the fight!<br/><br/>Dive into a fantasy world of the BLITZ: Rise of Heroes with turn-based battles and RPG elements! Enjoy the convenience of the idle auto-play system. Explore an exciting story, collect all the invincible heroes, fight epic bosses, and become the true legend of the realm!", "metacritic": null, "released": "2021-11-07", "tba": false, "updated": "2021-11-15T03:50:04", "background_image": "https://media.rawg.io/media/screenshots/c67/c67d0b453137f25124fdf7eca5dd9f2f.jpg", "website": "https://whaleapp.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 398, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["WhaleApp"], "genres": ["RPG"], "publishers": ["WhaleApp"], "esrb_rating": "Teen"}