{"id": 694436, "slug": "play-nine-the-golf-card-game", "name": "Play Nine: The Golf Card Game", "name_original": "Play Nine: The Golf Card Game", "description": "Inspired by the classic golf card game, Play Nine is an exciting and hilarious game for all ages. Challenge your friends and family in Bonfit’s newest mobile game, Play Nine: The Card Game Of Golf.  Play strategically to match cards and reduce your strokes; after 9 holes the lowest score wins! <br/><br/>In this mobile edition of Play Nine, you can hone your skills by challenging the AI in our offline game or compete against your friends and family in multiplayer.<br/><br/><br/>\u2028EXPERIENCE<br/><br/>- Unlimited FREE gameplay against the AI.<br/>- 10 FREE tickets for multiplayer games against your friends and family.\u2028<br/>- Collect coins by earning new achievements.\u2028<br/>- Win it big by using coins in tournaments.<br/>- Use coins to buy multiplayer tickets and other future items.<br/><br/>FEATURES<br/><br/>- Perfect card game for the family. Fun for any age.\u2028<br/>- Create a local game and play against your friends and family.<br/>- Challenge other fans of Play Nine from around the world in our multiplayer mode.<br/>- Play offline when you’re in Airplane Mode or happen to find yourself without a cell signal.\u2028<br/>- Play time: 15-20 min.<br/><br/>OBJECTIVE<br/><br/>Just like golf, the goal of the Play Nine is to take as few strokes as possible. Limit your strokes by matching pairs and getting a Hole In One. Take the fewest strokes and go for the lowest score after 9 Holes.<br/><br/>GAMEPLAY<br/><br/>Each player is dealt eight cards with a discard pile and draw pile at the center of the table. To start the game each player flips two cards face up. Moving clockwise each player draws from either the deck or discard pile and has an option to replace one of their face up or facedown cards. If a player does not want their drawn card they may choose to flip one of their facedown cards for their turn. Players work to match vertical pairs of cards to reduce their number of strokes. Just like the game of golf the person with the lowest score wins the hole. <br/><br/>Additional game instructions can be found in the app as well as an in-game tutorial that provides all the details on how to play.\u2028\u2028<br/><br/>Find the physical card game on our website or Amazon.\u2028\u2028<br/><br/>Visit us on the web:\u2028<br/>https://www.playnine.com<br/><br/>\u2028\u2028Like us on Facebook:\u2028<br/>https://www.facebook.com/playninecardgame/\u2028\u2028<br/><br/>Follow us on Instagram:\u2028<br/>https://www.instagram.com/playninecardgame/<br/><br/>Terms of Use: <br/>https://www.apple.com/legal/internet-services/itunes/dev/stdeula/", "metacritic": null, "released": "2021-08-27", "tba": false, "updated": "2021-11-15T03:41:48", "background_image": "https://media.rawg.io/media/screenshots/944/94434cf036f79c79cce072a73eb2ae05.jpg", "website": "https://playnine.com/pages/app", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 40, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Bonfit America"], "genres": ["Casual", "Card"], "publishers": ["Bonfit America"], "esrb_rating": "Everyone 10+"}