{"id": 694445, "slug": "the-matching-dead", "name": "The Matching Dead", "name_original": "The Matching Dead", "description": "To anyone who survived the zombie apocalypse:<br/>If you are reading this, well, congratulations! You haven't been turned into a zombie. 3 months ago, a zombie virus infected 90% of the population of this city. Only a few lucky people like you and me managed to survive. Now, you need to build a shelter, recruit survivors and collect weapons to fight off the zombies.<br/>Here are some tips for you:<br/><br/>[Unity is power] <br/>Get help! You will need to recruit as many survivors as possible. They might be veteran soldiers, former police officers, nurses and doctors…everyone can be helpful. Train them and defend your shelter against waves of zombies.<br/><br/>[Match &amp; Fight]<br/> Match tiles with strategy to create combos and wipe out the zombies.<br/><br/>[Build Fortress] <br/>Turn your shaby shelter into a fortress where you may gather resources, train heroes and produce food and weapons.<br/><br/>[Alliance] <br/>Sometimes you don't have many options on means when you have to fight other humans in order to survive. Join alliance, fight for resources.<br/><br/>[The Tower]<br/> Built by a mysterious organization. You might find abundant resources there but they come with great risks. Send a team of the best heroes of yours to explore it!<br/><br/>Find our official fan page on Facebook: <br/>https://www.facebook.com/thematchingdead.37games<br/><br/>Do you need help?<br/>Feel free to contact us via the in-game Customer Service or send us an Email at: global.support@37games.com<br/>Privacy Policy:<br/>https://gpassport.37games.com/center/servicePrivacy/privacy<br/>Terms of Use:<br/>https://gpassport.37games.com/center/servicePrivacy/service", "metacritic": null, "released": "2021-08-11", "tba": false, "updated": "2021-11-15T03:47:28", "background_image": "https://media.rawg.io/media/screenshots/0a9/0a9911705cc75de3d5877fa22e88a6f5_UNIznOJ.jpg", "website": "https://www.37games.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 202, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["37GAMES"], "genres": ["Puzzle"], "publishers": ["G-MEI NETWORK TECHNOLOGY CO"], "esrb_rating": "Teen"}