{"id": 694411, "slug": "lost-bubbles-sweet-mates", "name": "LOST BUBBLES: Sweet mates", "name_original": "LOST BUBBLES: Sweet mates", "description": "<strong>The seventh of low-price series of Kimidorisoft! \"LOST BUBBLES: Sweet mates\" appeared!</strong><br/><strong>For video creators and streamers</strong><br/>KIMIDORI SOFT permits monetization through partner programs using KIMIDORI SOFT games.<br/><br/>This is a hard action adventure game for the modern warrior who survives in a harsh society, depicting the smoothness of soap, the stubbornness of defying it while cutting yourself, and the sense of unity with like-minded friends you meet along the way. When your mind is worn out with frustration, the soap is also worn out,  Literally, physically.<br/><br/><strong>Game goals:</strong><br/>Control the soap, move, and dash to get to the soap holder. However, each time the soap is moved, its durability is reduced by friction with the floor. Please reach the soap holder before it loses its durability.<br/><br/><strong>Feature:</strong> <br/>Online multiplayer: There are quick matches and friend matches, both of which you are free to enter and exit at any time. In Quick Match, soaps from all over the world are trying to reach the soap holder at their own pace. In Friend Match, you can easily play with specific friends only by using one keyword. Up to 10 players can play together. Of course, you can also play alone.<br/><br/>Soap bubbles: When you use the dash, it increases your movement speed and produces soap bubbles. Because it's soap. Using soap bubbles with the soaps you're adventuring with is another fun way to make the stage look fantastic.<br/><br/>There is proof of life: Even when the soap wears itself out and ends its life, there will remain proof of your life (recovery items).<br/>Other soaps (players) will have your proof of life and will never forget your aspirations and your way of life. Maybe, just maybe, they will.<br/><br/>Collection Item: After washing yourself with soap, you wipe yourself with a towel, right? Yes, you need a towel. Soap and towel are a set.<br/>There is a towel somewhere on the stage. If you finish with a towel, your reputation will be high.<br/><br/>Growth System: Depending on the distance you move, your soap will become more and more durable and tougher.<br/>It is the same with your mind. Never give up and keep going, and one day you will surely feel the growth.<br/><br/>Checkpoint: Touch a checkpoint to respawn from it at any time. However, you will lose some life when you respawn.", "metacritic": null, "released": "2021-11-12", "tba": false, "updated": "2021-11-15T03:17:56", "background_image": "https://media.rawg.io/media/screenshots/a55/a553a5cbdcb5c550ee5b66f608740257.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 284, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["KIMIDORI SOFT"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["KIMIDORI SOFT"], "esrb_rating": null}