{"id": 694505, "slug": "woolly-way", "name": "Woolly Way", "name_original": "Woolly Way", "description": "<p>*<strong>English below*</strong></p>\n<p>Bienvenue à Woolly Way! Dans ce jeu, vous contrôlerez des chiens de berger qui devront guider leur moutons vers leur enclôt. Cependant, la tâche ne sera pas si facile. Vous devrez vous assurer que vos moutons ne se perdent pas en sortant de l'écran, et vous devrez également repousser les prédateurs en aboyant jusqu'à ce qu'ils se sauvent.</p>\n<p>Alors? Serez-vous capable de braver les 6 niveaux inclus afin de pouvoir vous proclamer comme meilleur chien de berger?</p>\n<p>Contrôles: </p>\n<p>Clic gauche de la souris: Tracer un trajet pour son chien<br/></p>\n<p>Clic droit de la souris: Japper pour faire accélérer les moutons ou faire fuir les prédateurs</p>\n<p>R: Remettre à zéro</p>\n<p>L: Sauter un niveau</p>\n<p>.</p>\n<p>Welcome to Woolly Way! In this game, you will control sheepdogs who will have to guide their sheep to their enclosure. However, the task will not be so easy. You'll need to make sure your sheep don't get lost when exiting the screen, and you'll also need to fend off predators by barking until they run away.</p>\n<p>So? Will you be able to brave the 6 levels so that you can proclaim yourself as the best sheepdog?</p>\n<p>Controls:</p>\n<p>Left mouse click: Draw a route for your dog</p>\n<p>Right mouse click: Bark to speed up sheep or scare away predators</p>\n<p>R: Reset the level</p>\n<p>L: Skip a level</p><p>CHALLENGE COMPLETED: </p><p>Self Made Asset-er </p><p>Watches Steve Irwin Once </p><p>The Egg Came First (Tabascoco from Hot Coco in Level 6)</p><p> Look Ma! one Hand! </p><p>We Love You Too  UwU</p><p>Gotta Love Nostalgia</p>", "metacritic": null, "released": "2021-11-15", "tba": false, "updated": "2021-11-15T04:14:20", "background_image": "https://media.rawg.io/media/screenshots/422/42287ea3090c88946212a6056776bd25.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 24, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["RoseDuf", "WilliamLebel", "LeMilenov", "JeremieLapointe", "toomanypotatoes27"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}