{"id": 69451, "slug": "monster-marble-fireball-dragon-blast-bubble-zumi-p", "name": "Monster Marble Fireball Dragon Blast - Bubble Zumi Popping Revenge", "name_original": "Monster Marble Fireball Dragon Blast - Bubble Zumi Popping Revenge", "description": "Dragon Monsters rule in Jellyland and the game is survival!  Match three or more jelly bombs with your favourite monster shooting at the helm in this addictive and fun logic puzzle game.<br/><br/>Jelly Monsters are notoriously greedy, they roam the worlds looking for the best wobbly tracks from which to collect the most jelly bombs, but time is ticking so be quick and aim sharp, for you’ll wake the lands’ sleeping sinkhole and your bombs will be sucked into the depths and lost forever. <br/><br/>A super fun and contagious puzzler game that will have you trying just ONE MORE TIME! to beat the clock and eat your way to the top of the Leaderboards, just grab your favourite monster and conquer those wobble tracks! <br/><br/>The challenge waits. Can you make it through 5 different Jelly Worlds and 25 of the coolest tracks to become the Jelly Monster Hero? Of course you can…or can you?<br/><br/>Features:<br/><br/>- 5 Wobble JellyLand Worlds<br/>- 25 Super Wibbly Tracks<br/>- 3 Hungry Jelly Monsters<br/>- Game Center Leaderboards<br/><br/><br/>Find Us Online:-<br/><br/>Facebook : Facebook.com/RisingHighApps<br/>Twitter: @RisingHighApps<br/>Web: www.RisingHigh.net", "metacritic": null, "released": "2014-01-25", "tba": false, "updated": "2019-10-22T14:25:43", "background_image": "https://media.rawg.io/media/screenshots/4b8/4b8f97ddec15965e9812ea4a01f0069d.jpg", "website": "http://www.Risinghigh.net", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 62, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Go Free Games - Best Top Fun Apps"], "genres": [], "publishers": ["Rising High Apps"], "esrb_rating": "Everyone 10+"}