{"id": 6946, "slug": "rebirth-of-fortune-2", "name": "Rebirth of Fortune 2", "name_original": "Rebirth of Fortune 2", "description": "◆Rebirth of a legend<br/><br/>Rebirth of Fortune 2, is the 4th story of the Fortune Chronicle Episode and the official sequel to the 2009 release of SRPG Rebirth of Fortune.<br/><br/>Newly revived with a more extensive volume, cool improved graphics, and utterly more unstoppable fun than the original.<br/><br/>As the story continues from Rebirth of Fortune, Sorcerer of Fortune, Defense of Fortune, experience a highly interesting storyline, full of Fortune world's Magic and Ether.<br/><br/><br/><br/>◆Game Features<br/> <br/>1. 25 classes of combat units capable of getting into battle formation and over 35 classes of various enemy monsters.<br/><br/>2. A more strategic and enjoyable battle system.<br/><br/>3. The biggest. Over a thousand stages of vast volumes and stories. <br/><br/>4. More beautiful and appealing. The ultimate 2D graphics.<br/><br/>5. Has Retina Display Support. A universal app, supporting all models (iPhone 3gs and above, iPad 2 and above) running on iOS.<br/><br/>6. Supports Achievements and Leaderboards via Game Center.<br/><br/>7. Capable of playing with users from around the world at anytime via Game Center.<br/><br/>8. On some iOS Device the game in progress can be shared by using iCloud.<br/><br/>Please note that although this game can run on iPhone 3gs and lower, these do not have Retina Display Support and the low resolution may cause the text to appear unclear.<br/><br/><br/><br/>◆Game Rules <br/><br/>1. The basic battles of SRPG(Simulation Role Playing Game) is similar to the rules of chess. Players take turns selecting a single unit to move and attack the enemy.<br/><br/>2. After taking turns, the first player to annihilate its opponent is the winner.<br/><br/>3. Each unit has a variety of skills and abilities. These skills can be used by using up Ether which is collected during the game. Since more powerful skills consume more Ether, it has to be used strategically at a critical moment.<br/><br/>4. With the war funds obtained from battles, units can be upgraded. When units are upgraded, a new skill is unlocked or a profession from a higher ranking class can be used.<br/><br/>5. There is a Coliseum in the game in which users from around the world with different strategic styles can go head to head via Game Center. If the AI in single player mode is not challenging enough, try playing in the Coliseum where you can enjoy competing with users from around the world.<br/><br/><br/>◆Caution:<br/>If the game crashes. Please update to the latest iOS version. (iCloud problem)", "metacritic": null, "released": "2013-05-11", "tba": false, "updated": "2019-10-22T14:08:40", "background_image": "https://media.rawg.io/media/screenshots/ae9/ae95a9e48dce712c4ea1441c2cba052d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 245, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Dotomchi Games"], "genres": ["RPG", "Simulation"], "publishers": ["Dotomchi Games"], "esrb_rating": null}