{"id": 694622, "slug": "nightmare-frames", "name": "Nightmare Frames", "name_original": "Nightmare Frames", "description": "Alan Goldberg is a frustrated slasher movie screenwriter in the Hollywood of 1985 who feels his career is at a standstill, but his luck is about to change: Helen Westmore, an eccentric millionaire, will grant him anything he could wish for if he is able to find genius horror director Edward Keller's last, unpublished work, which is said to be the scariest film of all time.<br/><br/>Alan will find his way amongst B-films production companies, VFX workshops, religious cults, and a small haunted town called Serena, the dark reputation of which began when Keller was last seen there.<br/><br/><br/><br/><br/><br/><ul><li> Point &amp; click adventure game solely based on inventory puzzles. </li></ul><br/><ul><li> An investigative thriller that gets darker as you progress into the story.  From ambient horror to the gory depths of Hell.  </li></ul><br/><ul><li> More than 80 playable locations, and 50 characters to interact with. </li></ul><br/><ul><li> Original soundtrack by synthwave musician Stefano Rossi. </li></ul><br/><ul><li> In Joe's Diner you'll be able to listen to SYNTHWAVE FM, where DJ Karen Johnson broadcasts licensed tracks by Heclysma, Decade Defector, Vincenzo Salvia and Self Delusion. </li></ul><br/><ul><li> By the author of award-winning Urban Witch Story and Billy Masters Was Right. </li></ul><br/>", "metacritic": null, "released": "2021-11-14", "tba": false, "updated": "2022-06-17T07:03:15", "background_image": "https://media.rawg.io/media/screenshots/a09/a09535642be10dce463499ed4e1f9a4a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 9, "toplay": 4, "playing": 1}, "playtime": 4, "achievements_count": 14, "ratings_count": 0, "suggestions_count": 482, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Postmodern Adventures"], "genres": ["Adventure"], "publishers": ["Postmodern Adventures"], "esrb_rating": null}