{"id": 69462, "slug": "3d-blocky-moto-ambulance-king-emergency-dr-rush-ro", "name": "3D Blocky Moto Ambulance King - Emergency Dr Rush Road Parking Mini Game", "name_original": "3D Blocky Moto Ambulance King - Emergency Dr Rush Road Parking Mini Game", "description": "3D Ambulance Emergency Parking demands ultimate driving precision and your very, very best parking skills.  Use your multi-directional camera to get into the heart of the action in these truly immersive 3D environments. Drive your way around the City in a variety of ambulance vehicles, your goal is to reach the emergency designated parking zone in each of the challenging levels.<br/><br/>With 4 Ambulance Vehicles for you to get to grips with are you ready to take on the 33 intense day and night driving emergencies in all types of weather? Your emergency vehicles are randomly selected on each mission for a superior gameplay experience. All you need is a rock steady nerve and the skills to manoeuvre your vehicles through Town and Country settings, coping with the roughest terrain and through the tightest driving turns imaginable! <br/><br/>Drop into the rescue and emergency depot for steering wheels, essential vehicle repair packs or kit yourself up with extra lives and even gain total control over the City weather. <br/><br/>Main Features:<br/><br/>- Multi Directional Camera<br/>- Immersive 3D Town and Country Environments<br/>- 33 Day and Night emergency parking challenges<br/>- 4 Ambulance Vehicles, randomly selected<br/>- Realistic precision driving simulator<br/>- Experience weather conditions and rough terrain<br/>- Weather Control open option<br/>- Awesome Soundtrack<br/><br/>Visit us Online:<br/><br/>Facebook: Facebook.com/RisingHighApps <br/>Twitter: @RisingHighApps <br/>Web: www.RisingHigh.net", "metacritic": null, "released": "2015-01-09", "tba": false, "updated": "2019-10-22T14:25:44", "background_image": "https://media.rawg.io/media/screenshots/197/197c48aaf4a49a1172d819559e960b77.jpg", "website": "http://www.risinghigh.net/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 174, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Go Free Games - Best Top Fun Apps"], "genres": ["Racing", "Arcade"], "publishers": ["Rising High Apps"], "esrb_rating": "Everyone 10+"}