{"id": 694855, "slug": "alienated-annalein", "name": "Alienated (A.n.n.a.l.e.i.n)", "name_original": "Alienated (A.n.n.a.l.e.i.n)", "description": "<p>Ein Ergebnis aus dem ersten Healthcare Game Jam der Charitè Berlin und der Stiftung Digitale Spielekultur.</p><p>1.Platz</p>\n<p>Wann beschäftigen wir uns eigentlich mit Themen, wie Pflege und Gesundheitsprofessionen? \r\n  </p>\n<p>Zumeist erst dann, wenn wir selbst auf irgendeine Art betroffen sind! \r\n  </p>\n<p>Wir 7, eine spontan zusammengewürfelte Gruppe aus 3 Game-Designern und 4 Expert*innen der Pflege haben in den letzten 48h folgendes bestätigen können: \r\n  </p>\n<p>Das Gesundheitswesen und unser Mikrokosmos Krankenhaus sind für Patient*innen und Angehörige oft wie ein fremder Planet! \r\n  </p>\n<p>Manchmal sprechen wir scheinbar nicht einmal die gleiche Sprache.  \r\n  </p>\n<p>Wie 2 unterschiedliche Spezies begegnen wir einander nun in einer ganz besonderen und individuellen Situation. \r\n  </p>\n<p>Doch treten wir in Beziehung zueinander, so stellen wir fest, dass wir uns in die gleiche Richtung, hin zu gleichen Zielen bewegen möchten. \r\n  </p>\n<p>„Alienated“ führt Spieler*innen ein in das Gefühl als Patient*in aus dem gewohnten Leben geholt und plötzlich „lost in space“ zu sein. \r\n  </p>\n<p>Der Umgang mit externen und internen Aliens symbolisiert dabei sowohl das Krankheitserleben, als auch den Umgang mit Fachkräften des Gesundheitswesens. \r\n  </p>\n<p>Seid selbst aufgeworfen in dieses „fremde“ Leben eines Menschen mit Schlaganfall! \r\n  </p>\n<p>Geht euren Weg, um mit der Fremde um euch herum und im eigenen Körper  umgehen zu lernen. \r\n  </p>\n<p>Klick um Klick und mit jeder Entscheidung kannst du dich aus der anfänglichen Akutsituation herausentwickeln. \r\n  </p>\n<p>Manches erschließt sich dabei, wie im echten Leben von Patient*innen, vielleicht auch erst durch einen Perspektivwechsel. \r\n  </p>\n<p>Wir und „Alienated“ möchten dich dazu einladen! \r\n</p>\n\n<p>Sound from Zapsplat.com<br/></p>", "metacritic": null, "released": "2021-11-14", "tba": false, "updated": "2021-11-15T05:39:18", "background_image": "https://media.rawg.io/media/screenshots/fb2/fb220b0f4598fc1066f1c631d8f04a2c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 33, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["A.n.n.a.l.e.i.n"], "genres": ["Adventure", "Educational"], "publishers": [], "esrb_rating": null}